{
  "author": "_Rafs",
  "original_created_utc": 1641384855,
  "title": "Heads up and be safe: I just lost BTC because of Malware that highjacks my clipboard [Windows]",
  "created_utc": 1641418362,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just lost a significant amount of BTC (to me at least, I can only save ~100$/month). I had my last BTC (sats, really) purchases sitting in my exchange and wanted to move them to my (software) wallet that I use on my phone. So I copied/pasted it the address on a secure notepad app that syncs with PC, then checked that the address shown on my PC matched the wallet address. It did, so that&amp;#39;s cool.&lt;/p&gt;\n\n&lt;p&gt;So on the PC I copied/pasted it on the address box for the withdrawal at my exchange, it was shown as a valid address and I proceeded with the transaction. WRONG!&lt;/p&gt;\n\n&lt;p&gt;I sat there waiting for my funds to appear on my wallet but they never did. Transaction was shown as completed on the exchange and then I got alarmed. Started to write an email to my exchange&amp;#39;s support team and then it clicked.&lt;/p&gt;\n\n&lt;p&gt;I wanted to say that the destination address was &amp;#39;X&amp;#39; but somehow it was being shown as &amp;#39;Y&amp;#39; on the transaction history. But every time I tried to paste my address it was changing right before my eyes. So my email was looking like &amp;lt;&amp;lt;&lt;em&gt;This is mi destination address: &amp;#39;Y&amp;#39; // This is the address shown on the transacion history: &amp;#39;Y&amp;#39;&lt;/em&gt;&amp;gt;&amp;gt;. Now, my notepad app was clearly showing that the adddress I was trying to copy was most definitely not &amp;#39;Y&amp;#39;, so something was up.&lt;/p&gt;\n\n&lt;p&gt;Anyway, at that point I deleted the email, no need to bother some support dude because of something that was looking more and more like a royal fuck up.&lt;/p&gt;\n\n&lt;p&gt;And then there it is, there was some malware on my PC that was actively seeking BTC addresses and switching them to something similar but a different address alltoghether from whoever scammer made the damned thing. I clearly fucked up by not realizing that, and now&amp;#39;s too late.&lt;/p&gt;\n\n&lt;p&gt;Malwarebytes was quick to find and delete the thing and now the computer&amp;#39;s clean again (just like my exchange account, haha. FUCK.)&lt;/p&gt;\n\n&lt;p&gt;Be safe out there and double check or triple check everything when doing a transaction. I didn&amp;#39;t realize  at the time so I&amp;#39;m an idiot, but maybe you won&amp;#39;t have to be.&lt;/p&gt;\n\n&lt;p&gt;---&lt;/p&gt;\n\n&lt;p&gt;TL;DR&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s malware out there reading your clipboard to find BTC addresses, and when you try to copy/paste it will paste a similar address from the scammer. I didn&amp;#39;t realize so I&amp;#39;m an idiot, but maybe you won&amp;#39;t have to be.&lt;/p&gt;\n\n&lt;p&gt;---&lt;/p&gt;\n\n&lt;p&gt;EDIT: Okay, thanks for the awards and all. I read the comments but was lazy to reply to each one individually.&lt;/p&gt;\n\n&lt;p&gt;1- My PC wasn&amp;#39;t as infested as some of you may think, I actually clean installed windows 11 like 3 weeks ago FFS. I will reformat it again on the weekend, no worries there. The fucking antivirus did find the culprit, though. After deleting the files and restarting the PC, clipboard was behaving correctly again (I checked a shit ton of times).&lt;/p&gt;\n\n&lt;p&gt;2- &amp;#39;A secure notepad app that syncs&amp;#39; was just to make it easier to explain. It was Bitwarden, using the note entry options. It&amp;#39;s a password manager so it is indeed secure.&lt;/p&gt;\n\n&lt;p&gt;3- Mac / Linux people... Let&amp;#39;s just not go there, I don&amp;#39;t care about OS master race. Windows is a great fit for what I use it and all other OS have their flaws too.&lt;/p&gt;\n\n&lt;p&gt;4- Hardware wallet option is something that I&amp;#39;m always considering, I just fear loosing it, TBH. 2-stage transactions seems like a good enough compromise to me for the time being.&lt;/p&gt;\n\n&lt;p&gt;5- Software wallet on my phone gets uninstalled after each deposit, because I agree that it&amp;#39;s not a great thing to carry around. Then whenever I want to transfer again I re-download it and use the seed phrase to access my stuff.&lt;/p&gt;\n\n&lt;p&gt;6- Now let&amp;#39;s be clear, I know that evrything&amp;#39;s my fault, here. For what is worth, the address was very similar (first letters were the exact same), and was given as a valid address by the exchange so i trusted it more than I should have, but i did not check the complete string and that&amp;#39;s on me. I&amp;#39;m a bit of a newbie, but not a complete idiot, it&amp;#39;s just that I plain hadn&amp;#39;t heard about this particular scam before (hence why I wrote it to alert any other newbie that could find the info useful).&lt;/p&gt;\n\n&lt;p&gt;7- To the people thinking that this was an ad and I didn&amp;#39;t just lose my money... I wish it was so, I truly truly do. Imagine if those fuckers were paying me, too. Ah... Wouldn&amp;#39;t that be nice? &lt;/p&gt;\n\n&lt;p&gt;Anyway, you can&amp;#39;t trust your clipboard, there&amp;#39;s a lesson learned.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a few steps back and it kinda sucks, but I&amp;#39;ll go back to stacking sats.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/Bitcoin/comments/rwlkd0/heads_up_and_be_safe_i_just_lost_btc_because_of/",
  "subreddit": "Bitcoin",
  "id": "rwlkd0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just lost a significant amount of BTC (to me at least, I can only save\n~100$/month). I had my last BTC (sats, really) purchases sitting in my exchange\nand wanted to move them to my (software) wallet that I use on my phone. So I\ncopied/pasted it the address on a secure notepad app that syncs with…"
}