{
  "author": "savage-dragon",
  "original_created_utc": 1626845211,
  "title": "Not everything happening with prices has to do with conspiracy theories. There isn't a secret cabal group of whales trying to fuck you over while you sleep.",
  "created_utc": 1626882373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll start this by acknowledging that manipulation does exist and it is even more rampant than the stock market due to crypto&#39;s unregulated nature. And I will admit there&#39;s something re assuring to look at Wyckoff charts expecting another pump.</p>\n\n<p>However...</p>\n\n<p>According to most YouTubers and traders and sentiment peddlers in this space, there seems to be a secret group of &#39;they&#39; who move as if possessing a singular will in well rehearsed cadences.</p>\n\n<p>From game theory perspective, this assumption is false.</p>\n\n<p>Most whales and institutions have their own priorities and interest, and those groups are just as likely to compete against one another as they&#39;re likely to cooperate. Fact is, we can&#39;t know for sure. So it&#39;s nonsensical to think that whenever you lose money there must be some kind of high powers that are behind it, hell bent on reducing your holdings to zero. I&#39;ve seen it all. I&#39;ve seen Asians blaming the Westerners for &#39;selling&#39; and I&#39;ve seen the Westerners blaming the Asians for &#39;dumping&#39;. Likewise, I&#39;ve seen people attribute pumps to different demographics across the ocean.</p>\n\n<p>This leads us to the question of media FUDs. Again, whenever FUDs drop, this sub attribute the FUDs to &#39;them&#39; as in, &#39;they&#39; want you to sell. Well, it&#39;s true that it&#39;s possible to pay newspapers to drop these FUDs, but again, there isn&#39;t a single entity or a big bad group behind the scene trying to fuck you over. It&#39;s a complex war for interest between hedge funds, institutions, and the policy makers. Attributing the FUDs to a single entity is a very simplistic way to look at the way things operate.</p>\n\n<p>It&#39;s great to be cynical and to keep your awareness up. But don&#39;t fall too deeply into the rabbit hole and become a conspiracy theorist of the crypto world.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/oojldp/not_everything_happening_with_prices_has_to_do/",
  "subreddit": "CryptoCurrency",
  "id": "oojldp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'll start this by acknowledging that manipulation does exist and it is even\nmore rampant than the stock market due to crypto's unregulated nature. And I\nwill admit there's something re assuring to look at Wyckoff charts expecting\nanother pump.\n\nHowever...\n\nAccording to most YouTubers and traders…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず始めに、操作が存在すること、そしてそれが株式市場以上に横行していることを認めます。\n暗号の規制されていない性質上、株式市場よりもさらに横行しています。そして、私は\nワイコフチャートを見て、また上昇するのではないかと期待するのは何か安心感があることは認めます。\nと期待してWyckoffのチャートを見るのは安心感があります。\n\nしかし...\n\n多くのYouTuberやトレーダーによると...",
      "title": "価格に関することがすべて陰謀論とは限らない。あなたが寝ている間に、クジラの秘密結社があなたを騙そうとしているわけではないのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我首先要承认，操纵行为确实存在，而且由于加密货币不受监管，它甚至比股票市场更猖獗。\n由于加密货币不受监管的性质，它比股票市场更加猖獗。而且我\n我承认，看着Wyckoff的图表，期待着另一次抽水，是一件令人放心的事情。\n另一个泵。\n\n然而...\n\n根据大多数YouTubers和交易者的说法...",
      "title": "不是所有发生在价格方面的事情都与阴谋论有关。并不是有一个秘密的鲸鱼集团想在你睡觉时搞垮你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我首先要承認，操縱行爲確實存在，而且由於加密貨幣不受監管，它甚至比股票市場更猖獗。\n由於加密貨幣不受監管的性質，它比股票市場更加猖獗。而且我\n我承認，看着Wyckoff的圖表，期待着另一次抽水，是一件令人放心的事情。\n另一個泵。\n\n然而...\n\n根據大多數YouTubers和交易者的說法...",
      "title": "不是所有發生在價格方面的事情都與陰謀論有關。並不是有一個祕密的鯨魚集團想在你睡覺時搞垮你。"
    }
  ]
}