{
  "author": "rexkoner",
  "original_created_utc": 1635591186,
  "title": "Anyone slowly building up a degenerate portfolio?",
  "created_utc": 1635633639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was exclusively holding BTC and staking ETH for a couple of years. Since my portfolio has doubled in value now I am expanding into shitcoin territory. But again I don&#39;t think these cryptos I invested into aren&#39;t inherently shit because I kinda <em>do my own research.</em></p>\n\n<p>Anyways Now the only top 100 coin I have is ETH. Hell, I don&#39;t even have any top 200 coins anymore. My portfolio consists of coins from the 1000s, 2000s, and 3000s. </p>\n\n<p>And why I do this? Because I am a smart individual seeking value investing opportunities and bluechips.</p>\n\n<p>Let&#39;s share the most low cap coin you own. Let me start: DERC.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qiz2ea/anyone_slowly_building_up_a_degenerate_portfolio/",
  "subreddit": "CryptoCurrency",
  "id": "qiz2ea",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was exclusively holding BTC and staking ETH for a couple of years. Since my\nportfolio has doubled in value now I am expanding into shitcoin territory. But\nagain I don't think these cryptos I invested into aren't inherently shit because\nI kinda do my own research.\n\nAnyways Now the only top 100 coin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数年前からもっぱらBTCを保有し、ETHを賭けていました。私の\nポートフォリオの価値が2倍になったので、シットコインの領域にも進出しています。しかし\n私が投資したこれらの暗号が本質的にクソではないとは思いません。\n私は自分で調査しているからです。\n\nとにかく今、唯一のトップ100コインは...",
      "title": "誰かがゆっくりと堕落したポートフォリオを作っているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我专门持有BTC和押注ETH有几年了。由于我的\n现在我的投资组合已经翻倍，我正在扩大到屎币领域。但是\n我不认为我投资的这些加密货币本质上不是狗屎，因为\n我有点做自己的研究。\n\n无论如何，现在唯一的前100名硬币...",
      "title": "有谁在慢慢建立起一个堕落的投资组合？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我專門持有BTC和押注ETH有幾年了。由於我的\n現在我的投資組合已經翻倍，我正在擴大到屎幣領域。但是\n我不認爲我投資的這些加密貨幣本質上不是狗屎，因爲\n我有點做自己的研究。\n\n無論如何，現在唯一的前100名硬幣...",
      "title": "有誰在慢慢建立起一個墮落的投資組合？"
    }
  ]
}