{
  "author": "_526",
  "original_created_utc": 1628649844,
  "title": "Calling all my Runescape nerds. Bitcoin = Partyhat?",
  "created_utc": 1628721074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last night i had an epiphany. Bitcoin is the real world version of runescape party hats. </p>\n\n<p>For those unaware of this game, Runescape is an MMO game that has a fully functioning inflationary economy. Nearly two decades ago &quot;Party Hats&quot; of various colors were introduced to the game, and eventually were discontinued,  capping the supply and creating a scarce asset within the game. In this game due to its inflationary economy, the majority of valuable items in the game lose nominal value year after year due to ever increasing item and gold supply.</p>\n\n<p>However, Party Hats have increased in value almost every single year since their creation. In fact, they have increased in value so much, the game is not even programmed to allow you to hold enough gold in your inventory to purchase one. The richest players in the game even purchase them to hedge against the declining value of their other items.</p>\n\n<p>Have any you guys ever thought about this before?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/p248ly/calling_all_my_runescape_nerds_bitcoin_partyhat/",
  "subreddit": "Bitcoin",
  "id": "p248ly",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Last night i had an epiphany. Bitcoin is the real world version of runescape\nparty hats.\n\nFor those unaware of this game, Runescape is an MMO game that has a fully\nfunctioning inflationary economy. Nearly two decades ago \"Party Hats\" of various\ncolors were introduced to the game, and eventually were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨晩、私はあることを思いつきました。ビットコインはルネスケープの現実世界版である。\nパーティーハットです。\n\nこのゲームを知らない人のために説明すると、ルネスケープは、完全に機能するインフレ経済を持つMMOゲームです。\nインフレ経済が完全に機能しているMMOゲームです。約20年前、様々な色の「パーティーハット」が登場しました。\nこのゲームでは、様々な色の「パーティーハット」が登場し、最終的には...",
      "title": "すべての私のRunescapeオタクを呼び出します。Bitcoin = Partyhat?"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天晚上，我有一个顿悟。比特币是现实世界中的runescape的版本\n的现实版本。\n\n对于那些不了解这个游戏的人来说，Runescape是一个MMO游戏，它有一个完整的\n运作的通货膨胀经济。将近二十年前，各种颜色的 \"派对帽 \"被引入游戏。\n颜色的 \"派对帽 \"被引入到游戏中，并最终被...",
      "title": "召唤我所有的Runescape书呆子。比特币=党羽？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天晚上，我有一個頓悟。比特幣是現實世界中的runescape的版本\n的現實版本。\n\n對於那些不瞭解這個遊戲的人來說，Runescape是一個MMO遊戲，它有一個完整的\n運作的通貨膨脹經濟。將近二十年前，各種顏色的 \"派對帽 \"被引入遊戲。\n顏色的 \"派對帽 \"被引入到遊戲中，並最終被...",
      "title": "召喚我所有的Runescape書呆子。比特幣=黨羽？"
    }
  ]
}