{
  "author": "quan42069quan",
  "the_new_excerpt": "Most of the BABA DD and articles for that matter are shallow and simplistic.\nHere is the paraphrased narrative you hear over and over again:\n\n> Jack Ma gave a speech where he bashed the centralized banking system in China.\n> The CCP was pissed. So they stopped the ANT Ipo and opened an…",
  "original_created_utc": 1618289920,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BABAのDDや記事のほとんどは、浅くて単純なものです。\n何度も耳にする言い換えられた物語は以下の通りです。\n\n> ジャック・マーは、中国の中央銀行制度を非難するスピーチをしました。\n> 中国共産党は腹を立てた。中国共産党は怒った。だから彼らはANT Ipoを止めて、...",
      "title": "BABA DD：恨みではなかった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大部分的BABA DD和文章都是浅薄而简单的。\n以下是你反复听到的解说词。\n\n> 马云在演讲中抨击了中国的中央银行系统。\n> 中共很生气。所以他们停止了ANT Ipo，并开了一个... ...",
      "title": "巴巴DD：这从来都不是什么恩怨。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大部分的BABA DD和文章都是淺薄而簡單的。\n以下是你反覆聽到的解說詞。\n\n> 馬雲在演講中抨擊了中國的中央銀行系統。\n> 中共很生氣。所以他們停止了ANT Ipo，並開了一個... ...",
      "title": "巴巴DD：這從來都不是什麼恩怨。"
    }
  ],
  "title": "BABA DD: It was never about a grudge",
  "created_utc": 1618335139,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most of the BABA DD and articles for that matter are shallow and simplistic. Here is the paraphrased narrative you hear over and over again:</p>\n\n<blockquote>\n<p>Jack Ma gave a speech where he bashed the centralized banking system in China. The CCP was pissed. So they stopped the ANT Ipo and opened an investigation into Alibaba, and created a draft of anti-monopoly regulations through <a href=\"https://en.nim.ac.cn/node/647\">SAMR</a>. BABA&#39;s stock price plummeted. For a time, Ma disappeared and was feared dead. The communists in charge of the PRC don&#39;t tolerate free speech like Jack Ma&#39;s and they&#39;re teaching him - and others - a lesson. While he came-out alive, this has still all been a flex by the PRC on one guy.</p>\n</blockquote>\n\n<p>This is reductive, simplistic, and a mildly <a href=\"https://en.wikipedia.org/wiki/Anti-Chinese_sentiment\">sinophobic</a>.  I know; this is an investment sub, why tf are we talking about social justice shit? We&#39;re not. We&#39;re talking about blinders that can make you make bad investment decisions. If you look back a few months from now and realize part of your assumption about Chinese stocks is that the PRC is fundamentally irrational and anti-competitive because they love commie-ism so much and aren&#39;t as intelligent as their American counterparts...maybe its time to reflect on that shit and/or stick to stocks where your cable news geopolitics don&#39;t cloud your judgement.  </p>\n\n<p>But I digress.</p>\n\n<p>The series of anti-monopoly actions taken by SAMR since November have nothing to do with Jack Ma&#39;s speech. In fact, the cause and effect are backwards on that one - Ma heard a leak about the SAMR regulations that were coming and got all heated about it and gave that speech anyway. The regs caused the speech, the speech didn&#39;t cause the regs. Ma probably should&#39;ve called-in sick and got drunk in his penthouse instead, mighta saved him some money but he&#39;s clearly a sassy lil fucker.</p>\n\n<p>Alibaba has $1.3 trillion in assets and less than half of that in debt. They have 1 billion subscribers but lots of room to grow with a newly-formed world&#39;s biggest trade block in the pacific. They&#39;ve been under 20 p/e for the last few months but rival amazon in size, scope, and product diversification. </p>\n\n<p>Did you think that the CCP was bad enough at judgement to blow it up because a little dude with a funny shaped head said some words they didn&#39;t like? I mean, don&#39;t you <em>have</em> to assume the CCP is pretty stupid to think that was going to happen? </p>\n\n<p>Economically, competitively, geopolitically - Alibaba&#39;s existence and <em>strength</em> is good for the PRC under almost any condition. Unless it fucks-up a trade deal, lets the US run roughshod over them in years of trade litigation, or is an actual debt time bomb. All of those things were at risk in November which is the true cause of the crackdown.</p>\n\n<p>The 3 primary catalysts for the SAMR regs, ANT delay, and BABA investigation were:</p>\n\n<ol>\n<li>Completion of the <a href=\"https://www.reddit.com/r/wallstreetbets/comments/juoce8/rcep/\">RCEP</a>. (Link is to a post from 4 months ago when it passed)</li>\n<li>Winning trade-war litigation v. the US via WTO <a href=\"https://www.wto.org/english/tratop_e/dispu_e/dispu_e.htm\">dispute settlement</a>. (Remember most of this began days after Biden had won the election: thus, PRC knew that de-escalating the trade war and needing to defend trade law more meticulously would be a reality in a new administration).</li>\n<li>ANT was printing loans and flipping them before they had time to count the money. It was a credit liquidity WMD and it needed to be corrected.</li>\n</ol>\n\n<p>Quick DD on each catalyst that I should probably cite more but I&#39;m not going to because I&#39;m drunk and want to play video games soon:</p>\n\n<h1>Completion of RCEP:</h1>\n\n<p>Regional Comprehensive Economic Partnership is the largest trading block in the world, basically the includes the whole western pacific/SE asia region. China was making it a point to get this done before Biden got into office and could begin using soft power to repair alliances/partnerships throughout the pacific. Mango fucked-up a lot of US relations throughout the region and China didn&#39;t fuck around filling-in the void. RCEP also has conditional inclusion requirements for Australia and India, basically an offer neither can refuse but would naturally make them less dependent on the US for foreign investment. For the PRC, that&#39;s a smart fucking play and a shitburger for biden to eat. (See, this is how actual Machiavellian realpolitik shit allows one to make causal connections outside of &quot;Jack Ma said bad words CCP don&#39;t like, duh.&quot;) </p>\n\n<p>One of the many complexities of negotiating trade agreements is making sure all signatory countries&#39; regulations on markets are fairly similar.</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/kmhx7d/forget_the_jack_ma_grudge_thing/\">I predicted months</a> ago that BABA would gladly drop the &quot;pick 1 of 2&quot; rule as a part of the anti-monopoly stuff, get slapped on the wrist and that&#39;d be about it. ANT would have to be a real bank too (that&#39;s below). I&#39;m not fucking nostradamous, the rule just wouldn&#39;t make sense under RCEP.</p>\n\n<p>1 of 2 makes a merchant pick <strong>ONE</strong> platform exclusively for distribution. The RCEP makes e-commerce, auto sales, everything equivalent in every members state. You can sell a blender with Indonesian and Chinese parts in Thailand without having to pay a differential tax/tariff/etc.</p>\n\n<p>So with 1-of-2 <em>and</em> RCEP in place, Alibaba as a company would force companies in Indonesia NOT to use Sea Limited products? Why the fuck would that make sense? And what country in their right fucking mind would sign a trade agreement like that? Of course they had to drop that shit, it was an anti-competitive incubator law for Baba and other tech behemoths to grow. It worked, they&#39;re ready. Don&#39;t need the incubator any more. A couple weeks after the SAMR started huffing and puffing, the RCEP was done.</p>\n\n<h1>TRADE WAR DE-ESCALATION:</h1>\n\n<p>The previous administration levied a lot of tariffs to initiate a trade war with China. They did tariffs back (called countervailing duties). This is why countries don&#39;t do trade wars that much, its a <a href=\"https://www.brookings.edu/blog/order-from-chaos/2020/08/07/more-pain-than-gain-how-the-us-china-trade-war-hurt-america/\">shitty</a> outcome for everyone every time.</p>\n\n<p>So basically Biden has to clean-up a big fucking no-win food fight that&#39;s been going on for years. Not biden himself, <a href=\"https://ustr.gov/about-us/biographies-key-officials/juan-millan-austr\">this guy</a> and a platoon of trade lawyer nerds. The problem is that the US used some fucking stupid excuses for levying tariffs, specifically the national security defense of steel/aluminum (spoiler alert: there aren&#39;t many ways the US could lose a war but running out of steel is NOT one of them), which are going to be hard to excuse in arbitration. And the trade rep from the PRC isn&#39;t going to give a fuk that there&#39;s a new US president: the US did what the US did. China can use the justification of &quot;national security&quot; for shielding itself from amazon/google etc. while sheltering the development of its tech behemoths through RCEP.</p>\n\n<p>Arbitration through the WTO makes <em>theatrical self-regulation lucrative</em> for a country but destroying giant companies isn&#39;t. Every big free trade agreement is preceded by participants &quot;cleaning up their act&quot; (and not). It pays to bark at one&#39;s tech giants but not to bite. So the PRC needed to create the impression of due diligence, if not <em>over</em> diligence, to create legal fodder for their attorneys to de-escalate the trade war advantageously.</p>\n\n<p>Plus there is a lot of synergy between RCEP and trade war de-escalation.</p>\n\n<p>An important component for any attack on PRC trade policies for USTR will be that the RCEP is anti-competitive because it is exclusive. Those criticisms are hard to make when its a done deal. If the US wanted in, they should&#39;ve have pushed for that before the deal&#39;s completion. China knew that mango couldn&#39;t see the chess game so there was no harm or hindrance to closing the deal ASAP after the US election was conclusive.</p>\n\n<h1>ANT time bomb</h1>\n\n<p>Should cite. Won&#39;t cite. But ANT was writing loans like it was nothing and then flipping them by the millions to whatever venders for whatever price. ANT had no liability and was writing billions in loans. So there was actual credit market concern if the IPO wasn&#39;t held-up. SAMR is going to make them be a legit bank that needs backing for what they&#39;re writing.</p>\n\n<p>Dropping the 1 of 2 thing and the slap-on-the-wrist fine is the 2nd to last thing.</p>\n\n<p>Last thing will be SAMR giving an explicit green light (and maybe a date) to the Ant IPO. I&#39;d say that will happen soon but I&#39;ve been thinking that for months.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>TLDR</strong></p>\n\n<p>China was never going to blow-up baba or ANT. They need to do a pose to complete RCEP and &#39;win&#39; the trade war de-escalation with the US.</p>\n\n<p>&#x200B;</p>\n\n<p>Positions: 250 shares @ 236</p>\n\n<p>40 ish calls through Sept</p>\n</div><!-- SC_ON -->",
  "score": 64,
  "permalink": "/r/stocks/comments/mpvhop/baba_dd_it_was_never_about_a_grudge/",
  "subreddit": "stocks",
  "id": "mpvhop",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618928
}