{
  "author": "Badders00",
  "original_created_utc": 1631010022,
  "title": "I went down the NFT \"rabbit hole\".. here's what I found out!",
  "created_utc": 1631021436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So a little like most people here, I have often found myself wondering.. just what the hell is an NFT anyway? How are people making such an absurd amount of money from them? And why would anyone pay millions of dollars for a picture of a rock? Or 50 bucks for the latest Kings of Leon album in NFT form? Am I missing out on a massive opportunity?</p>\n\n<p>So I decided to find out, I was going to do some research and then mint, market, and (hopefully) sell an NFT! Easy right?! WRONG.. Here is my story, a cautionary tale that may teach you all something (or not..)</p>\n\n<p>First off for the uninitiated... what is an NFT?  We can describe an NFT as <strong>a cryptographic token that defines an asset uniquely</strong>. It can represent both a digital asset such as an image, GIF, or piece of digital artwork, but it can also track real-world assets, such as a house or car, or a song, for example. </p>\n\n<p>Using a marketplace like Opensea just about anyone with a little blockchain knowledge (and a wallet) can create and sell one. Now I am no artist, but if you take a look at Opensea you will see that amongst the genuinely impressive artwork on display, there are some very questionable pieces being sold for obscene amounts of money.</p>\n\n<p>So to make this a fair experiment I decided to create 3 different kinds of NFT:</p>\n\n<p>1: A few genuine pieces of art (created by my GF who is indeed a talented artist!): Price: 0.5 - 1 ETH</p>\n\n<p>2: A few pieces of digital art I quickly created myself: Price: 0.025 - 0.05 ETH</p>\n\n<p>3: A set of pixelated &quot;Crypto Calling Cards&quot; (images based on existing generic gaming/sci-fi artwork and ideas) these were pretty basic and at the lower end of quality: Price: 0.01 ETH</p>\n\n<p>I had my images and I was all set to mint! Minting the NFT&#39;s themselves was relatively painless apart from the large gas fee. I was surprised to find that there was not a fee for each individual NFT.. but just a one-off fee that allowed you to mint as many as you like! </p>\n\n<p>So my NFT&#39;s were out in the world! What next? Well.. nobody knew they existed so I set about attempting to publicise them. Redditt seemed promising but yielded few results, lots of nice messages but no buyers. Instagram did not seem to have much awareness at all of NFT&#39;s. For reasons beyond my comprehension Twitter seems to be a hub of NFT activity and interest, so I set about setting up an account to advertise my artworks and interact with willing and eager buyers. Now here is where it gets interesting.. </p>\n\n<p>There are literally millions of accounts on Twitter spamming NFT artwork (no surprise there), but there are also thousands and thousands of accounts posing as NFT &quot;buyers&quot;, they are extremely similar in style and tone and endlessly post asking to see new NFT&#39;s and artwork. Basically, all of these accounts look the same and post extremely similar tweets and similar times of the day, after dropping links to my work on a few of them for days.. I started to receive all kinds of messages, &quot;ahhh!&quot; I thought.. buyers at last?! Not quite..</p>\n\n<p>Message after message invited me to pay THEM to buy my NFT&#39;s, some asking hundreds of dollars, some thousands, others $50.. They promised to promote my work after purchasing, to sell them on for larger sums (offering me a cut), and just about everything else you could think of. Now not being desperate to sell anything, I was considered and careful in my response and declined their offers, but it is extremely easy to see how many people could be sucked into this scheme with promises of larger returns and interest for minting a few simple NFT&#39;s. After this I reached out to others on Twitter in the community, did anyone else have experience with such people?...</p>\n\n<p>Story after story poured in of people paying these &quot;buyers&quot; with hopes of their NFT&#39;s becoming famous, becoming rich, careers taking off and more.. Almost all of them found the buyers had either not purchased their NFT when paid or the buyer had never promoted them as promised. Stories of other artists copying work were rife, nobody I spoke to had a positive or successful story. So it became clear that NFT&#39;s are the new &quot;Wild West&quot; of the internet, winner takes all and millions left disappointed and out of pocket. To succeed in the space either requires enormous amounts of luck, or to already possess a high profile. It is of course possible, but the chances for the 99% are slim. </p>\n\n<p>Like just about everything else in Crypto, NFT&#39;s are wide open goals to scammers who prey on desperate and naive people. After a few weeks, I felt deflated and demotivated.. Little to no interest had been generated in my NFT&#39;s (unsurprisingly!). There were no Lambos and no sales. I could see how any genuine artist could quickly become disillusioned and disappointed, there are some genuinely amazing pieces of art out there and yet millions are paid for a picture of a rock. I gave up promotion and left my NFT&#39;s to their unknown fate..</p>\n\n<p>So if you are looking at NFT&#39;s wondering how on earth they work, why they work, and how you could make a quick buck.. I hope you have learned from my experiment!</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/CryptoCurrency/comments/pjka8a/i_went_down_the_nft_rabbit_hole_heres_what_i/",
  "subreddit": "CryptoCurrency",
  "id": "pjka8a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So a little like most people here, I have often found myself wondering.. just\nwhat the hell is an NFT anyway? How are people making such an absurd amount of\nmoney from them? And why would anyone pay millions of dollars for a picture of a\nrock? Or 50 bucks for the latest Kings of Leon album in NFT…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいる多くの人たちと同じように、私もしばしば疑問に思っていました......。\nNFTとは一体何なのか？どうやって人々はNFTであんなに莫大な金額を稼いでいるのか？\nどうやってあんなに莫大な金額を稼いでいるんだろう？そして、なぜ誰もが岩の写真に何百万ドルも支払うのか？\nロックの写真に何百万ドルも払う人がいるのか？あるいは、キングス・オブ・レオンの最新アルバムがNFTで50ドル...。",
      "title": "NFTの \"うさぎの穴 \"に行ってきました...その結果は以下の通りです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以和这里的大多数人一样，我经常发现自己在想......只是\nNFT到底是什么？人们是如何通过它们赚取如此荒谬的金额的？\n钱？为什么会有人花几百万美元买一张石头的照片？\n石头的照片？或者花50美元购买国王莱昂乐队的最新专辑的NFT...",
      "title": "我进入了NFT的 \"兔子洞\"，以下是我发现的情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以和這裏的大多數人一樣，我經常發現自己在想......只是\nNFT到底是什麼？人們是如何通過它們賺取如此荒謬的金額的？\n錢？爲什麼會有人花幾百萬美元買一張石頭的照片？\n石頭的照片？或者花50美元購買國王萊昂樂隊的最新專輯的NFT...",
      "title": "我進入了NFT的 \"兔子洞\"，以下是我發現的情況"
    }
  ]
}