{
  "author": "operator139",
  "original_created_utc": 1642453906,
  "title": "It's pretty interesting when you get to the point where you wake up each day and lose or gain 10k+ or so.",
  "created_utc": 1642470244,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It puts things into perspective. What even is money if it can come and go so easily? Crypto is so relentless in how volatile it is, sometimes you wonder if you&amp;#39;ll wake up and be more successful than you ever could imagine.&lt;/p&gt;\n\n&lt;p&gt;Does anyone else relate? I got back into this ages ago, and I&amp;#39;ve gotten so used to the market, I don&amp;#39;t even care when I see my money fluctuate that much. I&amp;#39;m just like, oh, cool, another day. I made 10k or lost 10k over night on a trade, who cares.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s amazing that it can be like that, I never thought I would see my income streams be that worthless but exciting at the same time. It&amp;#39;s truly exciting but at the same time as of late I&amp;#39;ve learned to check out since we&amp;#39;ve been on a downtrend. My main holdings are in alts so I&amp;#39;m seeing more volatile movement, I&amp;#39;m really big on LUNA and AVAX- I think they are extremely promising projects, I also love Ethereum for obvious reasons like Smart Contracts.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t even imagine people who wake up each day and lose or gain 1 mil, 5 mil... and to think it&amp;#39;s just perspective.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 611,
  "permalink": "/r/CryptoCurrency/comments/s6f0m2/its_pretty_interesting_when_you_get_to_the_point/",
  "subreddit": "CryptoCurrency",
  "id": "s6f0m2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It puts things into perspective. What even is money if it can come and go so\neasily? Crypto is so relentless in how volatile it is, sometimes you wonder if\nyou'll wake up and be more successful than you ever could imagine.\n\nDoes anyone else relate? I got back into this ages ago, and I've gotten so…"
}