{
  "author": "C3naa",
  "the_new_excerpt": "Since i joined this emotional rollercoaster few years back. It has completley\nchanged my life style. Every one talks about the negative side effects to it but\nim talking about the good ones that i really appereciate. I spent almost all of\nmy money and never ever saved anything, financially was a…",
  "original_created_utc": 1621717299,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数年前にこの感情のジェットコースターに参加して以来 私のライフスタイルを完全に\n私の生活スタイルを変えました。誰もが副作用の話をしていますが\n私は本当に感謝している良いものについて話しています。私はほとんどすべてのお金を使い\n私はお金のほとんどを使ってしまい、何も貯めることができませんでした、経済的には...",
      "title": "暗号が私の人生を変えました。実際に救われました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从我几年前加入这个情感过山车后。它已经完全\n改变了我的生活方式。每个人都在谈论它的负面效应，但是\n我说的是好的方面，我真的很感激。我几乎花光了所有的钱\n我的钱几乎都花光了，从来没有存过钱，在经济上是个大问题。",
      "title": "Crypto改变了我的生活。实际上是拯救了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從我幾年前加入這個情感過山車後。它已經完全\n改變了我的生活方式。每個人都在談論它的負面效應，但是\n我說的是好的方面，我真的很感激。我幾乎花光了所有的錢\n我的錢幾乎都花光了，從來沒有存過錢，在經濟上是個大問題。",
      "title": "Crypto改變了我的生活。實際上是拯救了。"
    }
  ],
  "title": "Crypto changed my life. Saved actually.",
  "created_utc": 1621748988,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since i joined this emotional rollercoaster few years back. It has completley changed my life style. Every one talks about the negative side effects to it but im talking about the good ones that i really appereciate. \nI spent almost all of my money and never ever saved anything, financially was a mess. I smoked two packs of ciggaretts every day, was obese from all the fast food. Generally a down person.\nTwo weeks after joining crypto, i started to realize the changes, i started to question everything i bought before buying them, can i turn this into a coin? I quit smoking after few months and saved the money to put in coins, quit fast foods and going out and put that into crypto too. I got in shape, it gave me a reason to get better healthier. I save and invest, its so addicting and its the best god damn addiction i have ever had.</p>\n</div><!-- SC_ON -->",
  "score": 642,
  "permalink": "/r/CryptoCurrency/comments/nis0vb/crypto_changed_my_life_saved_actually/",
  "subreddit": "CryptoCurrency",
  "id": "nis0vb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383362
}