{
  "author": "frischance",
  "the_new_excerpt": "I personally hope it carries on for a few months so I can snatch up my fave\ncoins on discount.\n\nBut I just confess I am surprised at how happy and calm I am. I'm still in\nprofit as I bought in late January but I am super excited about pay day coming\nsoon and it's a huge discount!\n\nEnd of the day…",
  "original_created_utc": 1621613896,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "個人的には、数ヶ月間続いて欲しいと思っています。そうすれば、私のお気に入りを手に入れることができます。\nのコインを安く買えるように。\n\nでも、正直言って、自分がこんなに幸せで落ち着いていることに驚いています。私は1月下旬に購入したので、まだ利益があります。\n1月下旬に購入したのでまだ利益は出ていますが、もうすぐ給料日が来ることに超興奮しています。\nもうすぐ給料日だし、しかも大安売りだし\n\n一日の終わりに・・・。",
      "title": "このディップについて、意外と冷静でハッピーな人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我个人希望它能持续几个月，这样我就能抢到我喜欢的\n币的折扣。\n\n但我只是承认，我对自己的快乐和平静感到惊讶。我仍然在\n但我对即将到来的发薪日感到超级兴奋。\n而且是巨大的折扣!\n\n一天结束了...",
      "title": "还有人对这次下跌感到意外的平静和高兴吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我個人希望它能持續幾個月，這樣我就能搶到我喜歡的\n幣的折扣。\n\n但我只是承認，我對自己的快樂和平靜感到驚訝。我仍然在\n但我對即將到來的發薪日感到超級興奮。\n而且是巨大的折扣!\n\n一天結束了...",
      "title": "還有人對這次下跌感到意外的平靜和高興嗎？"
    }
  ],
  "title": "Is anyone else suprisingly calm and happy about this dip?",
  "created_utc": 1621632638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I personally hope it carries on for a few months so I can snatch up my fave coins on discount. </p>\n\n<p>But I just confess I am surprised at how happy and calm I am. I&#39;m still in profit as I bought in late January but I am super excited about pay day coming soon and it&#39;s a huge discount! </p>\n\n<p>End of the day everything I have paid in is money i was prepared to loose and I plan to hodl for a long time. </p>\n\n<p>Yes at first I was a bit panicked when Elon first tweeted but the day after waking up and seeing an even larger dip I was genuinely excited! I little end of lockdown sale!</p>\n</div><!-- SC_ON -->",
  "score": 1022,
  "permalink": "/r/CryptoCurrency/comments/nhwemb/is_anyone_else_suprisingly_calm_and_happy_about/",
  "subreddit": "CryptoCurrency",
  "id": "nhwemb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381680
}