{
  "author": "Social_History",
  "the_new_excerpt": "In an unusual move, the Federal Trade Commission announced that they have filed\nsuit to block genetic sequencing leader Illumina’s (ILMN) $7.1B merger with the\nliquid biopsy company Grail.\n\nInterestingly, Grail was founded as a subsidiary of ILMN and was spun off. After\nfiling to go public, Grail…",
  "original_created_utc": 1617160710,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在一个不寻常的举动中，联邦贸易委员会宣布，他们已经提起诉讼，阻止基因测序领导者Illumina（ILMN）71亿美元的合并。\n诉讼，以阻止基因测序领导者Illumina（ILMN）71亿美元与液体活检公司Grail的合并。\n液体活检公司Grail的合并。\n\n有趣的是，Grail是作为ILMN的一个子公司成立的，并被剥离出来。在\n在提交上市申请后，Grail...",
      "title": "美国联邦贸易委员会对Illumina（ILMN）提起诉讼，阻止与Grail的垂直整合"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一個不尋常的舉動中，聯邦貿易委員會宣佈，他們已經提起訴訟，阻止基因測序領導者Illumina（ILMN）71億美元的合併。\n訴訟，以阻止基因測序領導者Illumina（ILMN）71億美元與液體活檢公司Grail的合併。\n液體活檢公司Grail的合併。\n\n有趣的是，Grail是作爲ILMN的一個子公司成立的，並被剝離出來。在\n在提交上市申請後，Grail...",
      "title": "美國聯邦貿易委員會對Illumina（ILMN）提起訴訟，阻止與Grail的垂直整合"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "米連邦取引委員会（FTC）は、異例の事態として、米大統領選に立候補したと発表した。\n遺伝子配列決定のリーダーであるイルミナ（ILMN）の71億ドルでの合併を阻止するため、訴訟を起こします。\nリキッドバイオプシー企業のグレイル。\n\n興味深いのは、GrailはILMNの子会社として設立され、スピンオフされたことだ。その後\n株式公開を申請したGrail...",
      "title": "FTCがイルミナ（ILMN）に対し、グレイルとの垂直統合を阻止するための訴訟を起こす"
    }
  ],
  "title": "FTC files suit against Illumina (ILMN) to block vertical integration with Grail",
  "created_utc": 1617244246,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In an unusual move, the Federal Trade Commission announced that they have filed suit to block genetic sequencing leader Illumina’s (ILMN) $7.1B merger with the liquid biopsy company Grail.</p>\n\n<p>Interestingly, Grail was founded as a subsidiary of ILMN and was spun off. After filing to go public, Grail announced that they had entered into an agreement for ILMN to buy the rest of the company.</p>\n\n<p>It is the FTC’s position that ILMN may stifle competition in the emerging liquid biopsy market. Because ILMN holds a monopoly on short read sequencing, their competitors in the liquid biopsy space have no choice but to use ILMN’s products. Thus, the FTC believes the acquisition of Grail is anti-competitive.</p>\n\n<p>Interestingly, ILMN used to be one of the largest holdings in the ARKK and ARKG ETFs. Cathie Wood chose to divest after ILMN announced the acquisition of Grail because she believed it would put ILMN in direct competition with their competitors. </p>\n\n<p>This is the second time in 40 years that the FTC has blocked a vertical integration. They sued AT&amp;amp;T to block the integration with Time Warner Cable, which ultimately failed.</p>\n\n<p>Interestingly, this is the second time in two years the FTC has sued to block ILMN’s acquisitions. They previously sued ILMN to block their merger with PACB. Ultimately ILMN and PACB terminated the merger.</p>\n\n<p>Exact Sciences recently completed a horizontal integration to acquire the liquid biopsy company Thrive, which was not challenged.</p>\n\n<p><a href=\"http://www.wsj.com/amp/articles/ftc-challenges-illuminas-proposed-acquisition-of-liquid-biopsy-firm-grail-11617131491\">www.wsj.com/amp/articles/ftc-challenges-illuminas-proposed-acquisition-of-liquid-biopsy-firm-grail-11617131491</a></p>\n\n<p>Personally I believe this will take some time to wash out and I expect a bigger correction in ILMN stock. I believe this represents an opportunity for entries into a long position in ILMN. I have a hard time believing this merger won’t go through.</p>\n\n<p>Long $ILMN.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/investing/comments/mgwz1w/ftc_files_suit_against_illumina_ilmn_to_block/",
  "subreddit": "investing",
  "id": "mgwz1w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140068
}