{
  "author": "NaterTater796",
  "original_created_utc": 1632290693,
  "title": "Why do some murder or disappearing person cases get significantly more coverage than others?",
  "created_utc": 1632311035,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This question was brought upon by the Gabby Petito investigation and I’m sorry if this seems out of line or insensitive but why does her death govern a bigger response than all the other murder cases that go on every day? It’s awful and terrible that it happened but I just don’t know why.</p>\n\n<p>This reminds me of the Travis Alexander murder at that time I still had the same question of why does this matter more than all the other deaths that happened that day. </p>\n\n<p>My current theory is that unfortunately it’s all because of money. A murder case with a mystery drives clicks so it gets picked up because it makes news applications money.</p>\n\n<p>Again sorry if this comes off poorly but I’m genuinely curious.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/pt1afi/why_do_some_murder_or_disappearing_person_cases/",
  "subreddit": "NoStupidQuestions",
  "id": "pt1afi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This question was brought upon by the Gabby Petito investigation and I’m sorry\nif this seems out of line or insensitive but why does her death govern a bigger\nresponse than all the other murder cases that go on every day? It’s awful and\nterrible that it happened but I just don’t know why.\n\nThis…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、ギャビー・プティートの調査によってもたらされたものです。\n筋違いや無神経と思われるかもしれませんが、なぜ彼女の死が、毎日起こっている他の殺人事件よりも大きな反響を呼ぶのでしょうか？\nなぜ彼女の死は、毎日起こっている他の殺人事件よりも大きな反応を示すのでしょうか？起こってしまったことはひどく、恐ろしいことです。\n起こってしまったことは恐ろしいことですが、私には理由がわかりません。\n\nこの...",
      "title": "なぜ、ある殺人事件や失踪事件は他の事件よりも大きく報道されるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题是由加比-佩蒂托的调查引起的，我很抱歉。\n如果这看起来不合时宜或不敏感，但为什么她的死亡比每天发生的其他谋杀案有更大的反应？\n但为什么她的死亡比每天发生的所有其他谋杀案的反应更大？这是可怕的\n但我只是不知道为什么。\n\n这...",
      "title": "为什么有些谋杀案或失踪者案件的报道明显多于其他案件？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題是由加比-佩蒂託的調查引起的，我很抱歉。\n如果這看起來不合時宜或不敏感，但爲什麼她的死亡比每天發生的其他謀殺案有更大的反應？\n但爲什麼她的死亡比每天發生的所有其他謀殺案的反應更大？這是可怕的\n但我只是不知道爲什麼。\n\n這...",
      "title": "爲什麼有些謀殺案或失蹤者案件的報道明顯多於其他案件？"
    }
  ]
}