{
  "author": "overflow238",
  "original_created_utc": 1634156168,
  "title": "I made the huge mistake of telling my parents about my crypto investments",
  "created_utc": 1634174116,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I first started investing in crypto in March and since then I have doubled my money and I&#39;m pretty happy about how things are going so far.</p>\n\n<p>Even though I live in my parents house, I have a job and I saved up most of my income in three years of working.\nI decided to invest gradually and at the moment I have more than half of my savings into Crypto.</p>\n\n<p>Yesterday I was feeling a little too excited and also felt that they deserve to know what happens with my money since I still live in their house at 22 years of age.</p>\n\n<p>It wasn&#39;t a very wise move from me, my mom immediately thought I was joking and started laughing at me. When she finally understood that I was being serious, she started telling me about how I got scammed and it&#39;s impossible to ever get that money back because no one would ever wanna trade real money for &quot;fake digital money&quot;.</p>\n\n<p>I tried telling her that I can cashout whenever I want and she demanded me to do so to prove her.</p>\n\n<p>I then asked;</p>\n\n<ul>\n<li><p>&quot; Will you be ok with it once I show you I can cashout?&quot;</p>\n\n<p>-&quot;No&quot;</p></li>\n</ul>\n\n<p>So I refused to cashout.</p>\n\n<p>So there&#39;s that. My mom now thinks I&#39;m an idiot who got scammed for &quot;fake internet money.&quot;</p>\n\n<p>My dad? Oh he was okay with it.</p>\n</div><!-- SC_ON -->",
  "score": 296,
  "permalink": "/r/CryptoCurrency/comments/q7jop5/i_made_the_huge_mistake_of_telling_my_parents/",
  "subreddit": "CryptoCurrency",
  "id": "q7jop5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I first started investing in crypto in March and since then I have doubled my\nmoney and I'm pretty happy about how things are going so far.\n\nEven though I live in my parents house, I have a job and I saved up most of my\nincome in three years of working. I decided to invest gradually and at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は3月に初めて暗号化投資を始めましたが、それ以来、資金を2倍に増やしました。\n今のところ、かなり満足しています。\n\n私は両親の家に住んでいますが、仕事をしていますし、3年間働いて収入のほとんどを貯めました。\n働いて3年でほとんどの収入が貯まりました。私は少しずつ投資することにしましたが、その際に...",
      "title": "暗号投資のことを両親に話したのは大きな間違いだった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我在3月份首次开始投资加密货币，从那时起，我的资金已经翻了一番。\n到目前为止，我对事情的进展相当满意。\n\n尽管我住在父母的房子里，但我有一份工作，我在三年的工作中积攒了大部分的\n我在三年的工作中积攒了大部分收入。我决定逐步投资，在...",
      "title": "我犯了一个巨大的错误，就是把我的加密货币投资告诉了我的父母"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我在3月份首次開始投資加密貨幣，從那時起，我的資金已經翻了一番。\n到目前爲止，我對事情的進展相當滿意。\n\n儘管我住在父母的房子裏，但我有一份工作，我在三年的工作中積攢了大部分的\n我在三年的工作中積攢了大部分收入。我決定逐步投資，在...",
      "title": "我犯了一個巨大的錯誤，就是把我的加密貨幣投資告訴了我的父母"
    }
  ]
}