{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "Hi everybody, I've decided to finally try and write up a more in depth DD for CLOV because I think a lot of people have a tough time understanding their business model, and understanding why they have a legitimate shot at helping to fix one of the biggest issues with healthcare in America. For some background, I'm an MD who did my undergraduate degree focused on healthcare systems and economics-essentially many of the same courses someone pursuing an MPH would take (I actually did about 2/3rds of the courses required for an MPH at my alma mater). So in addition to being a WSB degen I understand what Clover Health is trying to accomplish, and I'm going to try and explain it because I think unlike a video game retailer or a movie theater most people have no idea wtf CLOV does.\n\n# What is Medicare Advantage and why was it created?\n\nTo understand Clover's business model we first need to understand what ***Medicare Advantage*** is, because that's Clover's primary business model (though they also have expanded into Direct Contracting Medicare which is somewhat similar). Medicare Advantage was created by the government to try and fix a lot of the broken incentives in our healthcare system that have lead to rampant inflation in the cost of healthcare in the US.\n\nHave you ever wondered why healthcare costs per person [**have more than doubled in the last decade?**](https://fred.stlouisfed.org/series/HLTHSCPCHCSA)  Healthcare costs have been growing for a long time and [have worsened wealth inequality](https://www.ft.com/content/0d7ea0c1-f0b8-4c8a-a532-f18f147079bc) due to growing 5X since 1980, but this inflation has accelerated the last decade so we're going to focus on the primary cause of this for simplicity.\n\nRight now, literally everyone in the existing healthcare system has had financial incentives to continue driving up costs, from consumers to hospitals to physicians to drug companies to insurance companies. Focusing on insurance though, the crazy thing is that **insurance companies only make more money if healthcare costs more money.**\n\nWait a minute you say, \"That makes no sense! Why would insurance companies make more money if they're paying out more money?\" That might have been the case in the past but over most of the last decade insurance companies have been restricted by the [80/20 rule](https://www.healthcare.gov/health-care-law-protections/rate-review/), a frankly economically stupid regulation that was ironically pitched as a way to bring costs down in health insurance. You'll often see this referred to as a \"Medical Loss Ratio\" especially when talking about earnings for insurance companies. But basically the law was changed so that insurance companies could only keep 20% of whatever money they charged for an insurance policy and had to pay out at least 80%.\n\nSo what did health insurance companies do? With this new law it meant that every insurance company was **now aligned with** ***higher*** **payouts to hospitals, physicians and pharmacies** and [stopped trying all that hard lower healthcare costs](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5145008/) because the higher their payouts were the more money they could charge on their insurance policies the next year. That's become the primary way for health insurers to grow their profits and revenues. Letting healthcare costs grow out of control is a big part of why [United Healthcare stock has rocketed up in a straight line up for the last decade-up more than 1300% since Obamacare passed in 2010.](https://finance.yahoo.com/chart/UNH#eyJpbnRlcnZhbCI6Im1vbnRoIiwicGVyaW9kaWNpdHkiOjEsImNhbmRsZVdpZHRoIjoxNi4zMzMzMzMzMzMzMzMzMzIsImZsaXBwZWQiOmZhbHNlLCJ2b2x1bWVVbmRlcmxheSI6dHJ1ZSwiYWRqIjp0cnVlLCJjcm9zc2hhaXIiOnRydWUsImNoYXJ0VHlwZSI6ImxpbmUiLCJleHRlbmRlZCI6ZmFsc2UsIm1hcmtldFNlc3Npb25zIjp7fSwiYWdncmVnYXRpb25UeXBlIjoib2hsYyIsImNoYXJ0U2NhbGUiOiJsaW5lYXIiLCJwYW5lbHMiOnsiY2hhcnQiOnsicGVyY2VudCI6MSwiZGlzcGxheSI6IlVOSCIsImNoYXJ0TmFtZSI6ImNoYXJ0IiwiaW5kZXgiOjAsInlBeGlzIjp7Im5hbWUiOiJjaGFydCIsInBvc2l0aW9uIjpudWxsfSwieWF4aXNMSFMiOltdLCJ5YXhpc1JIUyI6WyJjaGFydCIsIuKAjHZvbCB1bmRy4oCMIl19fSwibGluZVdpZHRoIjoyLCJzdHJpcGVkQmFja2dyb3VuZCI6dHJ1ZSwiZXZlbnRzIjp0cnVlLCJjb2xvciI6IiMwMDgxZjIiLCJzdHJpcGVkQmFja2dyb3VkIjp0cnVlLCJyYW5nZSI6eyJkdExlZnQiOiIyMDEwLTAzLTAxVDA1OjAwOjAwLjAwMFoiLCJkdFJpZ2h0IjoiMjAyMS0wNS0wNFQwMzo1OTowMC4wMDBaIiwicGVyaW9kaWNpdHkiOnsiaW50ZXJ2YWwiOiJtb250aCIsInBlcmlvZCI6MX0sInBhZGRpbmciOjB9LCJldmVudE1hcCI6eyJjb3Jwb3JhdGUiOnsiZGl2cyI6dHJ1ZSwic3BsaXRzIjp0cnVlfSwic2lnRGV2Ijp7fX0sImN1c3RvbVJhbmdlIjp7InN0YXJ0IjoxMjY3NDE5NjAwMDAwLCJlbmQiOjE2MTk4NDE2MDAwMDB9LCJzeW1ib2xzIjpbeyJzeW1ib2wiOiJVTkgiLCJzeW1ib2xPYmplY3QiOnsic3ltYm9sIjoiVU5IIiwicXVvdGVUeXBlIjoiRVFVSVRZIiwiZXhjaGFuZ2VUaW1lWm9uZSI6IkFtZXJpY2EvTmV3X1lvcmsifSwicGVyaW9kaWNpdHkiOjEsImludGVydmFsIjoibW9udGgifV0sInN0dWRpZXMiOnsi4oCMdm9sIHVuZHLigIwiOnsidHlwZSI6InZvbCB1bmRyIiwiaW5wdXRzIjp7ImlkIjoi4oCMdm9sIHVuZHLigIwiLCJkaXNwbGF5Ijoi4oCMdm9sIHVuZHLigIwifSwib3V0cHV0cyI6eyJVcCBWb2x1bWUiOiIjMDBiMDYxIiwiRG93biBWb2x1bWUiOiIjZmYzMzNhIn0sInBhbmVsIjoiY2hhcnQiLCJwYXJhbWV0ZXJzIjp7IndpZHRoRmFjdG9yIjowLjQ1LCJjaGFydE5hbWUiOiJjaGFydCIsInBhbmVsTmFtZSI6ImNoYXJ0In19fX0-)\n\nNow, most people in the United States may have private healthcare through their work. But a very large chunk of healthcare costs are paid out by the government through Medicare because the oldest and sickest patients that use the most healthcare dollars are people over 65. The most expensive healthcare in America is the catastrophic kind-where patients have a stroke, have a heart attack, get cancer, and then they require repeated hospitalizations and extremely expensive treatments that run well into the six and seven figures. As healthcare costs have gone completely insane the amount of money the government has had to spend on Medicare has gone crazy as well. Medicare Advantage is their attempt at trying to align better healthcare that costs less with higher profits for insurance companies. Instead of hospitals and doctors billing the government directly for care provided to Medicare patients, the government just hands over a set amount of money for each patient that an insurer covers. So the more patients a health insurance companies has, the more money they get from the government for taking care of those patients. This basically brings back into the system the old incentive where spending less money on healthcare leads to better profits. Now you're going to think, doesn't that just mean they'll just deny paying for everything and make bank? No, because combined with this the government also looks at the quality of the outcomes and care that patients get, and the better the patients do the higher the pay you get per patient. This is the government's attempt to fix the completely broken incentives in the healthcare system.\n\n# Why Clover Health?\n\nSo now you have some idea of what Medicare Advantage is. Why should you invest in Clover and not just buy shares of United Healthcare and Anthem since they've been printing money since before JPow bolted the turbo to the money printer? What it comes down to are two things.\n\n**1)** **Clover Health is a \"pure\" play where focusing on improving healthcare by preventing health problems before they become catastrophic will always improve Clover's profitability.** Clover only covers patients with either Medicare Advantage, or Medicare Direct Contracting (to avoid this being 80 pages long, this is a type of  hybrid of traditional Medicare with incentives for quality and cost reduction). This means that they can aggressively focus on improving healthcare quality, preventing patients from needing to be hospitalized, preventing patients from having those heart attacks, strokes, cancer. If other insurance companies aggressively improved the health of their patients they would actually make less money over time because the majority of their profits come from patients on plans where they only make more money if you're less healthy and requiring more and more expensive healthcare. If United Healthcare or Anthem successfully got their patients to be healthier they'd actually make less and less money due to the 80/20 rule! So they literally cannot be aggressive in pursuing a focus on preventing those terrible healthcare problems because they'll actually annihilate their own profits if they succeed. Any company that's attempting to do both traditional health insurance and also Medicare Advantage will be fighting with itself, either they do really well with Medicare Advantage or they do really well with their traditional insurance business. They can't actually succeed in both because the path to profitability for each are completely different. With Clover, if they succeed it's literally a win for everyone. It's a win for shareholders with larger profits, it's a win for patients because they have better health, it's a win for physicians because their patients are healthier which actually means less of a workload and physicians actually getting paid to keep people healthy, it's a win for the entire United States because we can maybe stop setting all our money on fire and maybe do something other than spend a quarter of a our salaries on healthcare while having our healthcare system [ranked last place against similar nations](https://www.citizen.org/article/dead-last-u-s-health-care-system-continues-to-rank-behind-other-industrialized-countries/).\n\n**2) Clover Assistant**. This is the killer app that Clover has been working on, it's their electronic health records system that attempts to keep track of all the moving pieces in healthcare to help physicians help their patients in a timely manner. For example, a lot of the time a patient gets hospitalized and they get well enough to go home, but they're supposed to follow up with their physician to make sure that they're continuing to improve, that they're not getting worse again. In traditional healthcare what happens is that the hospital physician sends the patient home and gives them a pile of papers and written somewhere in there is that they should go see their doctor within a week. The patient may or may not read this, and even if they do they'll call their doctor and the phone number will be busy and since they're not feeling well to begin with the patient gives up. 2 weeks later, the patient is feeling sicker than ever and ends up calling 911, ends up back in the emergency room, back in the hospital. [Medicare has attempted to punish this type of thing by financially penalizing hospitals for this type of situation known as a bounceback](https://www.cms.gov/Medicare/Medicare-Fee-for-Service-Payment/AcuteInpatientPPS/Readmissions-Reduction-Program) but it's still a rampant problem. With Clover Assistant however, the software is constantly looking at every patient's record and if it sees that a patient was hospitalized and discharged it proactively notifies their primary care physician that hey, you need to see and follow up with this patient to make sure they're continuing to get better. Then their physician might intervene with something like a $20 prescription for new antibiotics to help the patient continue to improve, instead of yet another $20,000 hospitalization. That's just one example of what it can already do today, but the Clover Assistant will eventually be able to use a large dataset of health records with AI to discover new ways to improve healthcare.\n\n# Addressing short seller critiques\n\nTo be frank, the report from Hindenburg sounds like it was written by someone with absolutely no real knowledge of healthcare or the healthcare business. But since this report is what so many people like to harp on when trashing Clover Health as some sort of scam I'm going to address the points they bring up.\n\n**#1 Claim: Clover is being investigated by the Department of Justice.**\n\nClover received what is known as a Civil Investigative Demand from the Department of Justice, which is a request for more information from Clover to make sure that there is no Medicare fraud occuring. This doesn't mean that there's any actual fraud, but it's standard when the government is your primary payer that you get hit with these CIDs to make sure that everything is on the up and up. There's no credible evidence that this has any actual material impact on Clover Health's performance. As an example, where was Hindenburg's short report when [Anthem dealt with a DOJ CID in 2018?](https://www.fiercehealthcare.com/payer/anthem-doj-medicare-advantage-risk-adjustment-chart-review-civil-investigative-demand) If we [take a look at Anthem's stock during this same time period](https://finance.yahoo.com/chart/ANTM#eyJpbnRlcnZhbCI6IndlZWsiLCJwZXJpb2RpY2l0eSI6MSwiY2FuZGxlV2lkdGgiOjM4LjU0Mzg1OTY0OTEyMjgxLCJmbGlwcGVkIjpmYWxzZSwidm9sdW1lVW5kZXJsYXkiOnRydWUsImFkaiI6dHJ1ZSwiY3Jvc3NoYWlyIjp0cnVlLCJjaGFydFR5cGUiOiJsaW5lIiwiZXh0ZW5kZWQiOmZhbHNlLCJtYXJrZXRTZXNzaW9ucyI6e30sImFnZ3JlZ2F0aW9uVHlwZSI6Im9obGMiLCJjaGFydFNjYWxlIjoibGluZWFyIiwicGFuZWxzIjp7ImNoYXJ0Ijp7InBlcmNlbnQiOjEsImRpc3BsYXkiOiJBTlRNIiwiY2hhcnROYW1lIjoiY2hhcnQiLCJpbmRleCI6MCwieUF4aXMiOnsibmFtZSI6ImNoYXJ0IiwicG9zaXRpb24iOm51bGx9LCJ5YXhpc0xIUyI6W10sInlheGlzUkhTIjpbImNoYXJ0Iiwi4oCMdm9sIHVuZHLigIwiXX19LCJsaW5lV2lkdGgiOjIsInN0cmlwZWRCYWNrZ3JvdW5kIjp0cnVlLCJldmVudHMiOnRydWUsImNvbG9yIjoiIzAwODFmMiIsInN0cmlwZWRCYWNrZ3JvdWQiOnRydWUsImV2ZW50TWFwIjp7ImNvcnBvcmF0ZSI6eyJkaXZzIjp0cnVlLCJzcGxpdHMiOnRydWV9LCJzaWdEZXYiOnt9fSwiY3VzdG9tUmFuZ2UiOnsic3RhcnQiOjE1MjAyMjYwMDAwMDAsImVuZCI6MTU1NDA5MTIwMDAwMH0sInN5bWJvbHMiOlt7InN5bWJvbCI6IkFOVE0iLCJzeW1ib2xPYmplY3QiOnsic3ltYm9sIjoiQU5UTSIsInF1b3RlVHlwZSI6IkVRVUlUWSIsImV4Y2hhbmdlVGltZVpvbmUiOiJBbWVyaWNhL05ld19Zb3JrIn0sInBlcmlvZGljaXR5IjoxLCJpbnRlcnZhbCI6IndlZWsifV0sInN0dWRpZXMiOnsi4oCMdm9sIHVuZHLigIwiOnsidHlwZSI6InZvbCB1bmRyIiwiaW5wdXRzIjp7ImlkIjoi4oCMdm9sIHVuZHLigIwiLCJkaXNwbGF5Ijoi4oCMdm9sIHVuZHLigIwifSwib3V0cHV0cyI6eyJVcCBWb2x1bWUiOiIjMDBiMDYxIiwiRG93biBWb2x1bWUiOiIjZmYzMzNhIn0sInBhbmVsIjoiY2hhcnQiLCJwYXJhbWV0ZXJzIjp7IndpZHRoRmFjdG9yIjowLjQ1LCJjaGFydE5hbWUiOiJjaGFydCIsInBhbmVsTmFtZSI6ImNoYXJ0In19fSwicmFuZ2UiOnsiZHRMZWZ0IjoiMjAxOC0wMy0wMVQwNTowMDowMC4wMDBaIiwiZHRSaWdodCI6IjIwMTktMDQtMDJUMDM6NTk6MDAuMDAwWiIsInBlcmlvZGljaXR5Ijp7ImludGVydmFsIjoid2VlayIsInBlcmlvZCI6MX0sInBhZGRpbmciOjB9fQ--) we can see that there was literally no impact from this on their share price, and since 2018 their stock has grown over 70%! It's absurd to believe that this has any material impact even if you do somehow believe that Clover broke the law in pursuing their vision. They pitch it as an \"existential risk\", essentially insinuating that the government would stop working with Clover even though this is clearly not true as CMS has continued to approve Clover for new programs and frankly this has never happened to any legitimate health insurer. [Clover also recently added this heavy hitter to their board](https://www.nashvillepost.com/business/health_care/clover-health-taps-former-cms-official-for-board/article_51803ebc-e162-596b-a372-d7907d6abe7a.html) which will help them navigate the complex regulations around Medicare.\n\n**#2 Claim: Clover had tons of patients inappropriately funneled to them through Seek Healthcare**, a Medicare plan comparison portal owned by Clover's head of sales.\n\nThis claim just has no factual basis, the vast majority of plans recommended by Seek were for non-Clover plans so all the evidence out there points to them having been neutral in matching patients to a plan that would benefit them.  Regardless, Clover has made it clear on Seek's website that Seek is an affiliate of theirs.\n\n**#3 Claim: Clover's software tries to \"upcode\"**\n\nIf you're not familiar with healthcare this will sound negative, but what Clover's software is doing is literally what every piece of healthcare software does. Medicare billing codes can be coded higher (meaning that your care and work is seen as more valuable to Medicare) based on how much data you've included about a patient in your documentation. Traditionally on a paper chart a doctor would have needed to write down the x-rays, labwork, etc. to bill the higher codes but with electronic health records systems you can code at a higher level without extreme effort because all the data is right there. That's a large part of their business plan, because they can show that yes we have the data and our physicians are able to review this to provide better and more detailed care. Hindenburg makes it sound like they're doing something nefarious when in fact, reviewing and providing this extra data is exactly what will provide better care. Complete absurd negative spin from Hindenburg on this claim and I frankly don't know of any healthcare record software that would purposely not include healthcare data so that physicians would only be able to have rudimentary data-free documentation. That'd be beyond moronic.\n\n**#4 Claim: Doctor's whine about Clover's software.**\n\nSo coincidentally in a past life I actually worked to train physicians to use electronic health record systems. I'm sure that Hindenburg was able to interview several physicians who would have complained about Clover Assistant, but the part they're not telling you is that a [third of physicians are over the age of 60.](https://www.medicaleconomics.com/view/physician-retirement-why-its-hard-doctors-retire) There is no software in existence that isn't going to be whined about by physicians, it doesn't matter if it's Allscripts, Epic, whatever, the reality is that the older physicians will struggle to learn any new software they have to deal with. If you've ever tried to help your grandma learn how to use a computer you probably have a good idea of what I'm talking about so to use this as a critique is yet again incredibly stupid.\n\n**#5 Claim: Clover health pays doctors money to use Clover Assistant and they pay primary care physicians good money.**\n\nHindenburg tries to spin this as a negative, that doctors are getting paid $200 per patient visit to have them adopt Clover Assistant. Well, in order to improve patient outcomes and thus eventually make more money by having healthier patients the entire business model revolves around having physicians adopt Clover Assistant. Clover also pays primary care physicians more money because investing more money into primary care to prevent health issues down the line is their business model. **Studies show that** [**every $1 extra spent on primary care is going to save $12 down the line**](https://www.medicaleconomics.com/view/delivering-value-healthcare-starts-increased-primary-care-investment). This is actually what sets Clover apart from the other health insurance companies, they're going out of their way to pay primary care physicians more, so they can spend more time with each patient, **so they can use the Clover assistant to deliver higher quality care that'll prevent more health problems down the line**. Hindenburg doesn't actually seem to be able to at all understand Clover's Medicare Advantage business model here, which makes me seriously question how they felt they were qualified to analyze Clover at all.\n\n**#6 Claim: Clover's CEO made his previous hospitals a ton of money charging a lot of money.**\n\nI could go into the nuances of how the CEO justified this type of billing as a negotiation tactic with existing insurance companies that had bullied these hospitals into bankruptcy in order to save hospitals that were going to be shut down. But forget that and realize what you have here is a short seller ***spinning the CEO of a healthcare company being incredibly good at making money in healthcare as a negative***. I honestly can't think of a stupider fucking thing for a short seller to say.  Garipalli knows and understands the business of healthcare better than anyone else, and now with Clover he's going to fix how fucked up it is while Clover makes bank.\n\n# Short term price catalysts/Short Squeeze prospects\n\nThis is probably the part that most of you degenerates care about so we probably should go over it. I think Clover health is going to be an incredible long term hold. Chamath thinks it's one of the most obvious 10-baggers he's ever seen and frankly I agree, but let's break down the short term.\n\nShort Interest: Over the last few weeks SI has been 40-50% of the float. I know some people have talked about some institutional shares being misclassified, and the SI being even higher but it's not clear to me that this is the case. Nonetheless, [Ortex is looking into this](https://twitter.com/trades_dutch/status/1406999851313807362) so we'll know for sure what the correct numbers are soon enough. It really doesn't matter that much though, this is extremely highly shorted. When VW underwent their infinity squeeze **the SI was only 12%**, what actually made it squeeze was that all of a sudden the short sellers couldn't cover their position-that matters much more than the exact number the SI% is. 40-50% is honestly a massive number that's more than enough for a huge short squeeze to occur.\n\n**Why did the price just jump?**\n\nNow here's the big thing that makes me think that CLOV is a prime short squeeze target right now. If you read BS financial blog posts a lot of people claim that it's because of WSB reading the SEC filings where the short squeeze is mentioned as a risk, but that's not the reason. Obviously WSB has obviously thought it's a possible squeeze target for a long time so to believe that an SEC filing triggered the price runup is stupid.\n\nThe reason is simply that 6/22 is the day that a ton of shares became unavailable for short sellers to borrow. A ton of call options for CLOV expired ITM on 6/18. How these work is that they get executed after market hours finish and then the people who sold the calls have to settle them in 2 business days. That's known as T+2 settlement, which is the settlement time for options contracts in the US. So any hedge fund that sold naked calls had another 2 business days to provide the shares. Purchases can be done through prime brokerages with T+1 settlement, meaning that the last day a hedge fund or market maker could have scrambled for shares to hand out on 6/22 was Monday 6/21. So they had a lot of incentive to drive the price down and force some liquidity on Monday, which is pretty much what you saw happen. But Tuesday all those shares went to people who executed their ITM call options.\n\nNow if you think about it, why would someone execute an ITM call option instead of just selling it off? It's because those entities want to hold those shares for a longer time frame. So as these shares got assigned off to folks who wanted to just hold these shares with their diamond hands you saw that share borrow availability tank. By 4PM on 6/22 there were ZERO shares available to borrow at IBKR and the borrow fee had jumped to almost 9%.\n\nRegardless, that major change of hands in shares has likely made this one of the weeks where it's going to be harder than every before for short sellers to be able to obtain shares to close out their short position. Even though CLOV has had a very high short squeeze score for a while now [(100/100 at S3)](https://twitter.com/ihors3/status/1404880301428547585?s=19). I think the folks holding shares this week may be more likely than ever before to be the type that refuse to sell to the shorts cheaply.\n\n# Long term value\n\nThis is admittedly hard to pin down because while CLOV doesn't currently generate profits they're an incredibly fast growing company. If they manage to achieve what they're trying to achieve the sky is going to be the limit, because we're talking about profit margins that would put every other insurer to shame while continuing to grow at double digit percentages per year. Plus while their current core business is Medicare Advantage and Medicare they also have an entire other business in the possibility of licensing out Clover Assistant. The EHR business could become another multi-billion dollar business alone. Allscripts is worth $2.5 billion and Epic is worth more but it's privately held. It's going to be years of work before Clover grows to a massive size and scale but I think if it does happen then Chamath's 10-bagger estimate is going to look conservative.\n\n# Positions or ban\n\n**What can I say, I like the stock.**\n\nhttps://preview.redd.it/887il0m5ky671.png?width=1354&format=png&auto=webp&s=cf1a285ed97bfcf2f544b9997b95b4b3067b6612\n\nI [doubled down on my YOLO before](https://www.reddit.com/r/wallstreetbets/comments/nr6rpz/clov_yolo_part_2_the_double_down/) but with the drop to the $11's on Monday I've added another 25,000 shares and now hold 98888 shares of CLOV. Ironically, I started buying CLOV trying to find a stock that was heavily undervalued and was going to put $100K into it. Now my attempt at building a diversified value portfolio with $1 million has somehow turned into this insanity but hey, I guess I've spent too much time here.",
  "author_fullname": "t2_22hjfdx",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "CLOV detailed DD",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "DD"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "dd",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "887il0m5ky671": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/887il0m5ky671.png?width=108&crop=smart&auto=webp&s=5d352b13d01510fa59a70d2b6d30b03b77b86764"
        },
        {
          "y": 143,
          "x": 216,
          "u": "https://preview.redd.it/887il0m5ky671.png?width=216&crop=smart&auto=webp&s=f071841f084d80101ddb5191b43d9f2fd5701cba"
        },
        {
          "y": 212,
          "x": 320,
          "u": "https://preview.redd.it/887il0m5ky671.png?width=320&crop=smart&auto=webp&s=5f0a181a68c30ad4243439bf8f666096e359308b"
        },
        {
          "y": 424,
          "x": 640,
          "u": "https://preview.redd.it/887il0m5ky671.png?width=640&crop=smart&auto=webp&s=d8abc7d5e1e64651156da8a73960174561a3aeb8"
        },
        {
          "y": 637,
          "x": 960,
          "u": "https://preview.redd.it/887il0m5ky671.png?width=960&crop=smart&auto=webp&s=4ecbd9b5835e2755e58a3d53c409641d108a34be"
        },
        {
          "y": 717,
          "x": 1080,
          "u": "https://preview.redd.it/887il0m5ky671.png?width=1080&crop=smart&auto=webp&s=910c888e943bf966d999b05084a710192e210612"
        }
      ],
      "s": {
        "y": 899,
        "x": 1354,
        "u": "https://preview.redd.it/887il0m5ky671.png?width=1354&format=png&auto=webp&s=cf1a285ed97bfcf2f544b9997b95b4b3067b6612"
      },
      "id": "887il0m5ky671"
    }
  },
  "name": "t3_o672a9",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.8,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1530,
  "total_awards_received": 40,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "DD",
  "can_mod_post": false,
  "score": 1530,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 6,
    "gid_3": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1624457929,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everybody, I&#39;ve decided to finally try and write up a more in depth DD for CLOV because I think a lot of people have a tough time understanding their business model, and understanding why they have a legitimate shot at helping to fix one of the biggest issues with healthcare in America. For some background, I&#39;m an MD who did my undergraduate degree focused on healthcare systems and economics-essentially many of the same courses someone pursuing an MPH would take (I actually did about 2/3rds of the courses required for an MPH at my alma mater). So in addition to being a WSB degen I understand what Clover Health is trying to accomplish, and I&#39;m going to try and explain it because I think unlike a video game retailer or a movie theater most people have no idea wtf CLOV does.</p>\n\n<h1>What is Medicare Advantage and why was it created?</h1>\n\n<p>To understand Clover&#39;s business model we first need to understand what <strong><em>Medicare Advantage</em></strong> is, because that&#39;s Clover&#39;s primary business model (though they also have expanded into Direct Contracting Medicare which is somewhat similar). Medicare Advantage was created by the government to try and fix a lot of the broken incentives in our healthcare system that have lead to rampant inflation in the cost of healthcare in the US.</p>\n\n<p>Have you ever wondered why healthcare costs per person <a href=\"https://fred.stlouisfed.org/series/HLTHSCPCHCSA\"><strong>have more than doubled in the last decade?</strong></a>  Healthcare costs have been growing for a long time and <a href=\"https://www.ft.com/content/0d7ea0c1-f0b8-4c8a-a532-f18f147079bc\">have worsened wealth inequality</a> due to growing 5X since 1980, but this inflation has accelerated the last decade so we&#39;re going to focus on the primary cause of this for simplicity.</p>\n\n<p>Right now, literally everyone in the existing healthcare system has had financial incentives to continue driving up costs, from consumers to hospitals to physicians to drug companies to insurance companies. Focusing on insurance though, the crazy thing is that <strong>insurance companies only make more money if healthcare costs more money.</strong></p>\n\n<p>Wait a minute you say, &quot;That makes no sense! Why would insurance companies make more money if they&#39;re paying out more money?&quot; That might have been the case in the past but over most of the last decade insurance companies have been restricted by the <a href=\"https://www.healthcare.gov/health-care-law-protections/rate-review/\">80/20 rule</a>, a frankly economically stupid regulation that was ironically pitched as a way to bring costs down in health insurance. You&#39;ll often see this referred to as a &quot;Medical Loss Ratio&quot; especially when talking about earnings for insurance companies. But basically the law was changed so that insurance companies could only keep 20% of whatever money they charged for an insurance policy and had to pay out at least 80%.</p>\n\n<p>So what did health insurance companies do? With this new law it meant that every insurance company was <strong>now aligned with</strong> <strong><em>higher</em></strong> <strong>payouts to hospitals, physicians and pharmacies</strong> and <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5145008/\">stopped trying all that hard lower healthcare costs</a> because the higher their payouts were the more money they could charge on their insurance policies the next year. That&#39;s become the primary way for health insurers to grow their profits and revenues. Letting healthcare costs grow out of control is a big part of why <a href=\"https://finance.yahoo.com/chart/UNH#eyJpbnRlcnZhbCI6Im1vbnRoIiwicGVyaW9kaWNpdHkiOjEsImNhbmRsZVdpZHRoIjoxNi4zMzMzMzMzMzMzMzMzMzIsImZsaXBwZWQiOmZhbHNlLCJ2b2x1bWVVbmRlcmxheSI6dHJ1ZSwiYWRqIjp0cnVlLCJjcm9zc2hhaXIiOnRydWUsImNoYXJ0VHlwZSI6ImxpbmUiLCJleHRlbmRlZCI6ZmFsc2UsIm1hcmtldFNlc3Npb25zIjp7fSwiYWdncmVnYXRpb25UeXBlIjoib2hsYyIsImNoYXJ0U2NhbGUiOiJsaW5lYXIiLCJwYW5lbHMiOnsiY2hhcnQiOnsicGVyY2VudCI6MSwiZGlzcGxheSI6IlVOSCIsImNoYXJ0TmFtZSI6ImNoYXJ0IiwiaW5kZXgiOjAsInlBeGlzIjp7Im5hbWUiOiJjaGFydCIsInBvc2l0aW9uIjpudWxsfSwieWF4aXNMSFMiOltdLCJ5YXhpc1JIUyI6WyJjaGFydCIsIuKAjHZvbCB1bmRy4oCMIl19fSwibGluZVdpZHRoIjoyLCJzdHJpcGVkQmFja2dyb3VuZCI6dHJ1ZSwiZXZlbnRzIjp0cnVlLCJjb2xvciI6IiMwMDgxZjIiLCJzdHJpcGVkQmFja2dyb3VkIjp0cnVlLCJyYW5nZSI6eyJkdExlZnQiOiIyMDEwLTAzLTAxVDA1OjAwOjAwLjAwMFoiLCJkdFJpZ2h0IjoiMjAyMS0wNS0wNFQwMzo1OTowMC4wMDBaIiwicGVyaW9kaWNpdHkiOnsiaW50ZXJ2YWwiOiJtb250aCIsInBlcmlvZCI6MX0sInBhZGRpbmciOjB9LCJldmVudE1hcCI6eyJjb3Jwb3JhdGUiOnsiZGl2cyI6dHJ1ZSwic3BsaXRzIjp0cnVlfSwic2lnRGV2Ijp7fX0sImN1c3RvbVJhbmdlIjp7InN0YXJ0IjoxMjY3NDE5NjAwMDAwLCJlbmQiOjE2MTk4NDE2MDAwMDB9LCJzeW1ib2xzIjpbeyJzeW1ib2wiOiJVTkgiLCJzeW1ib2xPYmplY3QiOnsic3ltYm9sIjoiVU5IIiwicXVvdGVUeXBlIjoiRVFVSVRZIiwiZXhjaGFuZ2VUaW1lWm9uZSI6IkFtZXJpY2EvTmV3X1lvcmsifSwicGVyaW9kaWNpdHkiOjEsImludGVydmFsIjoibW9udGgifV0sInN0dWRpZXMiOnsi4oCMdm9sIHVuZHLigIwiOnsidHlwZSI6InZvbCB1bmRyIiwiaW5wdXRzIjp7ImlkIjoi4oCMdm9sIHVuZHLigIwiLCJkaXNwbGF5Ijoi4oCMdm9sIHVuZHLigIwifSwib3V0cHV0cyI6eyJVcCBWb2x1bWUiOiIjMDBiMDYxIiwiRG93biBWb2x1bWUiOiIjZmYzMzNhIn0sInBhbmVsIjoiY2hhcnQiLCJwYXJhbWV0ZXJzIjp7IndpZHRoRmFjdG9yIjowLjQ1LCJjaGFydE5hbWUiOiJjaGFydCIsInBhbmVsTmFtZSI6ImNoYXJ0In19fX0-\">United Healthcare stock has rocketed up in a straight line up for the last decade-up more than 1300% since Obamacare passed in 2010.</a></p>\n\n<p>Now, most people in the United States may have private healthcare through their work. But a very large chunk of healthcare costs are paid out by the government through Medicare because the oldest and sickest patients that use the most healthcare dollars are people over 65. The most expensive healthcare in America is the catastrophic kind-where patients have a stroke, have a heart attack, get cancer, and then they require repeated hospitalizations and extremely expensive treatments that run well into the six and seven figures. As healthcare costs have gone completely insane the amount of money the government has had to spend on Medicare has gone crazy as well. Medicare Advantage is their attempt at trying to align better healthcare that costs less with higher profits for insurance companies. Instead of hospitals and doctors billing the government directly for care provided to Medicare patients, the government just hands over a set amount of money for each patient that an insurer covers. So the more patients a health insurance companies has, the more money they get from the government for taking care of those patients. This basically brings back into the system the old incentive where spending less money on healthcare leads to better profits. Now you&#39;re going to think, doesn&#39;t that just mean they&#39;ll just deny paying for everything and make bank? No, because combined with this the government also looks at the quality of the outcomes and care that patients get, and the better the patients do the higher the pay you get per patient. This is the government&#39;s attempt to fix the completely broken incentives in the healthcare system.</p>\n\n<h1>Why Clover Health?</h1>\n\n<p>So now you have some idea of what Medicare Advantage is. Why should you invest in Clover and not just buy shares of United Healthcare and Anthem since they&#39;ve been printing money since before JPow bolted the turbo to the money printer? What it comes down to are two things.</p>\n\n<p><strong>1)</strong> <strong>Clover Health is a &quot;pure&quot; play where focusing on improving healthcare by preventing health problems before they become catastrophic will always improve Clover&#39;s profitability.</strong> Clover only covers patients with either Medicare Advantage, or Medicare Direct Contracting (to avoid this being 80 pages long, this is a type of  hybrid of traditional Medicare with incentives for quality and cost reduction). This means that they can aggressively focus on improving healthcare quality, preventing patients from needing to be hospitalized, preventing patients from having those heart attacks, strokes, cancer. If other insurance companies aggressively improved the health of their patients they would actually make less money over time because the majority of their profits come from patients on plans where they only make more money if you&#39;re less healthy and requiring more and more expensive healthcare. If United Healthcare or Anthem successfully got their patients to be healthier they&#39;d actually make less and less money due to the 80/20 rule! So they literally cannot be aggressive in pursuing a focus on preventing those terrible healthcare problems because they&#39;ll actually annihilate their own profits if they succeed. Any company that&#39;s attempting to do both traditional health insurance and also Medicare Advantage will be fighting with itself, either they do really well with Medicare Advantage or they do really well with their traditional insurance business. They can&#39;t actually succeed in both because the path to profitability for each are completely different. With Clover, if they succeed it&#39;s literally a win for everyone. It&#39;s a win for shareholders with larger profits, it&#39;s a win for patients because they have better health, it&#39;s a win for physicians because their patients are healthier which actually means less of a workload and physicians actually getting paid to keep people healthy, it&#39;s a win for the entire United States because we can maybe stop setting all our money on fire and maybe do something other than spend a quarter of a our salaries on healthcare while having our healthcare system <a href=\"https://www.citizen.org/article/dead-last-u-s-health-care-system-continues-to-rank-behind-other-industrialized-countries/\">ranked last place against similar nations</a>.</p>\n\n<p><strong>2) Clover Assistant</strong>. This is the killer app that Clover has been working on, it&#39;s their electronic health records system that attempts to keep track of all the moving pieces in healthcare to help physicians help their patients in a timely manner. For example, a lot of the time a patient gets hospitalized and they get well enough to go home, but they&#39;re supposed to follow up with their physician to make sure that they&#39;re continuing to improve, that they&#39;re not getting worse again. In traditional healthcare what happens is that the hospital physician sends the patient home and gives them a pile of papers and written somewhere in there is that they should go see their doctor within a week. The patient may or may not read this, and even if they do they&#39;ll call their doctor and the phone number will be busy and since they&#39;re not feeling well to begin with the patient gives up. 2 weeks later, the patient is feeling sicker than ever and ends up calling 911, ends up back in the emergency room, back in the hospital. <a href=\"https://www.cms.gov/Medicare/Medicare-Fee-for-Service-Payment/AcuteInpatientPPS/Readmissions-Reduction-Program\">Medicare has attempted to punish this type of thing by financially penalizing hospitals for this type of situation known as a bounceback</a> but it&#39;s still a rampant problem. With Clover Assistant however, the software is constantly looking at every patient&#39;s record and if it sees that a patient was hospitalized and discharged it proactively notifies their primary care physician that hey, you need to see and follow up with this patient to make sure they&#39;re continuing to get better. Then their physician might intervene with something like a $20 prescription for new antibiotics to help the patient continue to improve, instead of yet another $20,000 hospitalization. That&#39;s just one example of what it can already do today, but the Clover Assistant will eventually be able to use a large dataset of health records with AI to discover new ways to improve healthcare.</p>\n\n<h1>Addressing short seller critiques</h1>\n\n<p>To be frank, the report from Hindenburg sounds like it was written by someone with absolutely no real knowledge of healthcare or the healthcare business. But since this report is what so many people like to harp on when trashing Clover Health as some sort of scam I&#39;m going to address the points they bring up.</p>\n\n<p><strong>#1 Claim: Clover is being investigated by the Department of Justice.</strong></p>\n\n<p>Clover received what is known as a Civil Investigative Demand from the Department of Justice, which is a request for more information from Clover to make sure that there is no Medicare fraud occuring. This doesn&#39;t mean that there&#39;s any actual fraud, but it&#39;s standard when the government is your primary payer that you get hit with these CIDs to make sure that everything is on the up and up. There&#39;s no credible evidence that this has any actual material impact on Clover Health&#39;s performance. As an example, where was Hindenburg&#39;s short report when <a href=\"https://www.fiercehealthcare.com/payer/anthem-doj-medicare-advantage-risk-adjustment-chart-review-civil-investigative-demand\">Anthem dealt with a DOJ CID in 2018?</a> If we <a href=\"https://finance.yahoo.com/chart/ANTM#eyJpbnRlcnZhbCI6IndlZWsiLCJwZXJpb2RpY2l0eSI6MSwiY2FuZGxlV2lkdGgiOjM4LjU0Mzg1OTY0OTEyMjgxLCJmbGlwcGVkIjpmYWxzZSwidm9sdW1lVW5kZXJsYXkiOnRydWUsImFkaiI6dHJ1ZSwiY3Jvc3NoYWlyIjp0cnVlLCJjaGFydFR5cGUiOiJsaW5lIiwiZXh0ZW5kZWQiOmZhbHNlLCJtYXJrZXRTZXNzaW9ucyI6e30sImFnZ3JlZ2F0aW9uVHlwZSI6Im9obGMiLCJjaGFydFNjYWxlIjoibGluZWFyIiwicGFuZWxzIjp7ImNoYXJ0Ijp7InBlcmNlbnQiOjEsImRpc3BsYXkiOiJBTlRNIiwiY2hhcnROYW1lIjoiY2hhcnQiLCJpbmRleCI6MCwieUF4aXMiOnsibmFtZSI6ImNoYXJ0IiwicG9zaXRpb24iOm51bGx9LCJ5YXhpc0xIUyI6W10sInlheGlzUkhTIjpbImNoYXJ0Iiwi4oCMdm9sIHVuZHLigIwiXX19LCJsaW5lV2lkdGgiOjIsInN0cmlwZWRCYWNrZ3JvdW5kIjp0cnVlLCJldmVudHMiOnRydWUsImNvbG9yIjoiIzAwODFmMiIsInN0cmlwZWRCYWNrZ3JvdWQiOnRydWUsImV2ZW50TWFwIjp7ImNvcnBvcmF0ZSI6eyJkaXZzIjp0cnVlLCJzcGxpdHMiOnRydWV9LCJzaWdEZXYiOnt9fSwiY3VzdG9tUmFuZ2UiOnsic3RhcnQiOjE1MjAyMjYwMDAwMDAsImVuZCI6MTU1NDA5MTIwMDAwMH0sInN5bWJvbHMiOlt7InN5bWJvbCI6IkFOVE0iLCJzeW1ib2xPYmplY3QiOnsic3ltYm9sIjoiQU5UTSIsInF1b3RlVHlwZSI6IkVRVUlUWSIsImV4Y2hhbmdlVGltZVpvbmUiOiJBbWVyaWNhL05ld19Zb3JrIn0sInBlcmlvZGljaXR5IjoxLCJpbnRlcnZhbCI6IndlZWsifV0sInN0dWRpZXMiOnsi4oCMdm9sIHVuZHLigIwiOnsidHlwZSI6InZvbCB1bmRyIiwiaW5wdXRzIjp7ImlkIjoi4oCMdm9sIHVuZHLigIwiLCJkaXNwbGF5Ijoi4oCMdm9sIHVuZHLigIwifSwib3V0cHV0cyI6eyJVcCBWb2x1bWUiOiIjMDBiMDYxIiwiRG93biBWb2x1bWUiOiIjZmYzMzNhIn0sInBhbmVsIjoiY2hhcnQiLCJwYXJhbWV0ZXJzIjp7IndpZHRoRmFjdG9yIjowLjQ1LCJjaGFydE5hbWUiOiJjaGFydCIsInBhbmVsTmFtZSI6ImNoYXJ0In19fSwicmFuZ2UiOnsiZHRMZWZ0IjoiMjAxOC0wMy0wMVQwNTowMDowMC4wMDBaIiwiZHRSaWdodCI6IjIwMTktMDQtMDJUMDM6NTk6MDAuMDAwWiIsInBlcmlvZGljaXR5Ijp7ImludGVydmFsIjoid2VlayIsInBlcmlvZCI6MX0sInBhZGRpbmciOjB9fQ--\">take a look at Anthem&#39;s stock during this same time period</a> we can see that there was literally no impact from this on their share price, and since 2018 their stock has grown over 70%! It&#39;s absurd to believe that this has any material impact even if you do somehow believe that Clover broke the law in pursuing their vision. They pitch it as an &quot;existential risk&quot;, essentially insinuating that the government would stop working with Clover even though this is clearly not true as CMS has continued to approve Clover for new programs and frankly this has never happened to any legitimate health insurer. <a href=\"https://www.nashvillepost.com/business/health_care/clover-health-taps-former-cms-official-for-board/article_51803ebc-e162-596b-a372-d7907d6abe7a.html\">Clover also recently added this heavy hitter to their board</a> which will help them navigate the complex regulations around Medicare.</p>\n\n<p><strong>#2 Claim: Clover had tons of patients inappropriately funneled to them through Seek Healthcare</strong>, a Medicare plan comparison portal owned by Clover&#39;s head of sales.</p>\n\n<p>This claim just has no factual basis, the vast majority of plans recommended by Seek were for non-Clover plans so all the evidence out there points to them having been neutral in matching patients to a plan that would benefit them.  Regardless, Clover has made it clear on Seek&#39;s website that Seek is an affiliate of theirs.</p>\n\n<p><strong>#3 Claim: Clover&#39;s software tries to &quot;upcode&quot;</strong></p>\n\n<p>If you&#39;re not familiar with healthcare this will sound negative, but what Clover&#39;s software is doing is literally what every piece of healthcare software does. Medicare billing codes can be coded higher (meaning that your care and work is seen as more valuable to Medicare) based on how much data you&#39;ve included about a patient in your documentation. Traditionally on a paper chart a doctor would have needed to write down the x-rays, labwork, etc. to bill the higher codes but with electronic health records systems you can code at a higher level without extreme effort because all the data is right there. That&#39;s a large part of their business plan, because they can show that yes we have the data and our physicians are able to review this to provide better and more detailed care. Hindenburg makes it sound like they&#39;re doing something nefarious when in fact, reviewing and providing this extra data is exactly what will provide better care. Complete absurd negative spin from Hindenburg on this claim and I frankly don&#39;t know of any healthcare record software that would purposely not include healthcare data so that physicians would only be able to have rudimentary data-free documentation. That&#39;d be beyond moronic.</p>\n\n<p><strong>#4 Claim: Doctor&#39;s whine about Clover&#39;s software.</strong></p>\n\n<p>So coincidentally in a past life I actually worked to train physicians to use electronic health record systems. I&#39;m sure that Hindenburg was able to interview several physicians who would have complained about Clover Assistant, but the part they&#39;re not telling you is that a <a href=\"https://www.medicaleconomics.com/view/physician-retirement-why-its-hard-doctors-retire\">third of physicians are over the age of 60.</a> There is no software in existence that isn&#39;t going to be whined about by physicians, it doesn&#39;t matter if it&#39;s Allscripts, Epic, whatever, the reality is that the older physicians will struggle to learn any new software they have to deal with. If you&#39;ve ever tried to help your grandma learn how to use a computer you probably have a good idea of what I&#39;m talking about so to use this as a critique is yet again incredibly stupid.</p>\n\n<p><strong>#5 Claim: Clover health pays doctors money to use Clover Assistant and they pay primary care physicians good money.</strong></p>\n\n<p>Hindenburg tries to spin this as a negative, that doctors are getting paid $200 per patient visit to have them adopt Clover Assistant. Well, in order to improve patient outcomes and thus eventually make more money by having healthier patients the entire business model revolves around having physicians adopt Clover Assistant. Clover also pays primary care physicians more money because investing more money into primary care to prevent health issues down the line is their business model. <strong>Studies show that</strong> <a href=\"https://www.medicaleconomics.com/view/delivering-value-healthcare-starts-increased-primary-care-investment\"><strong>every $1 extra spent on primary care is going to save $12 down the line</strong></a>. This is actually what sets Clover apart from the other health insurance companies, they&#39;re going out of their way to pay primary care physicians more, so they can spend more time with each patient, <strong>so they can use the Clover assistant to deliver higher quality care that&#39;ll prevent more health problems down the line</strong>. Hindenburg doesn&#39;t actually seem to be able to at all understand Clover&#39;s Medicare Advantage business model here, which makes me seriously question how they felt they were qualified to analyze Clover at all.</p>\n\n<p><strong>#6 Claim: Clover&#39;s CEO made his previous hospitals a ton of money charging a lot of money.</strong></p>\n\n<p>I could go into the nuances of how the CEO justified this type of billing as a negotiation tactic with existing insurance companies that had bullied these hospitals into bankruptcy in order to save hospitals that were going to be shut down. But forget that and realize what you have here is a short seller <strong><em>spinning the CEO of a healthcare company being incredibly good at making money in healthcare as a negative</em></strong>. I honestly can&#39;t think of a stupider fucking thing for a short seller to say.  Garipalli knows and understands the business of healthcare better than anyone else, and now with Clover he&#39;s going to fix how fucked up it is while Clover makes bank.</p>\n\n<h1>Short term price catalysts/Short Squeeze prospects</h1>\n\n<p>This is probably the part that most of you degenerates care about so we probably should go over it. I think Clover health is going to be an incredible long term hold. Chamath thinks it&#39;s one of the most obvious 10-baggers he&#39;s ever seen and frankly I agree, but let&#39;s break down the short term.</p>\n\n<p>Short Interest: Over the last few weeks SI has been 40-50% of the float. I know some people have talked about some institutional shares being misclassified, and the SI being even higher but it&#39;s not clear to me that this is the case. Nonetheless, <a href=\"https://twitter.com/trades_dutch/status/1406999851313807362\">Ortex is looking into this</a> so we&#39;ll know for sure what the correct numbers are soon enough. It really doesn&#39;t matter that much though, this is extremely highly shorted. When VW underwent their infinity squeeze <strong>the SI was only 12%</strong>, what actually made it squeeze was that all of a sudden the short sellers couldn&#39;t cover their position-that matters much more than the exact number the SI% is. 40-50% is honestly a massive number that&#39;s more than enough for a huge short squeeze to occur.</p>\n\n<p><strong>Why did the price just jump?</strong></p>\n\n<p>Now here&#39;s the big thing that makes me think that CLOV is a prime short squeeze target right now. If you read BS financial blog posts a lot of people claim that it&#39;s because of WSB reading the SEC filings where the short squeeze is mentioned as a risk, but that&#39;s not the reason. Obviously WSB has obviously thought it&#39;s a possible squeeze target for a long time so to believe that an SEC filing triggered the price runup is stupid.</p>\n\n<p>The reason is simply that 6/22 is the day that a ton of shares became unavailable for short sellers to borrow. A ton of call options for CLOV expired ITM on 6/18. How these work is that they get executed after market hours finish and then the people who sold the calls have to settle them in 2 business days. That&#39;s known as T+2 settlement, which is the settlement time for options contracts in the US. So any hedge fund that sold naked calls had another 2 business days to provide the shares. Purchases can be done through prime brokerages with T+1 settlement, meaning that the last day a hedge fund or market maker could have scrambled for shares to hand out on 6/22 was Monday 6/21. So they had a lot of incentive to drive the price down and force some liquidity on Monday, which is pretty much what you saw happen. But Tuesday all those shares went to people who executed their ITM call options.</p>\n\n<p>Now if you think about it, why would someone execute an ITM call option instead of just selling it off? It&#39;s because those entities want to hold those shares for a longer time frame. So as these shares got assigned off to folks who wanted to just hold these shares with their diamond hands you saw that share borrow availability tank. By 4PM on 6/22 there were ZERO shares available to borrow at IBKR and the borrow fee had jumped to almost 9%.</p>\n\n<p>Regardless, that major change of hands in shares has likely made this one of the weeks where it&#39;s going to be harder than every before for short sellers to be able to obtain shares to close out their short position. Even though CLOV has had a very high short squeeze score for a while now <a href=\"https://twitter.com/ihors3/status/1404880301428547585?s=19\">(100/100 at S3)</a>. I think the folks holding shares this week may be more likely than ever before to be the type that refuse to sell to the shorts cheaply.</p>\n\n<h1>Long term value</h1>\n\n<p>This is admittedly hard to pin down because while CLOV doesn&#39;t currently generate profits they&#39;re an incredibly fast growing company. If they manage to achieve what they&#39;re trying to achieve the sky is going to be the limit, because we&#39;re talking about profit margins that would put every other insurer to shame while continuing to grow at double digit percentages per year. Plus while their current core business is Medicare Advantage and Medicare they also have an entire other business in the possibility of licensing out Clover Assistant. The EHR business could become another multi-billion dollar business alone. Allscripts is worth $2.5 billion and Epic is worth more but it&#39;s privately held. It&#39;s going to be years of work before Clover grows to a massive size and scale but I think if it does happen then Chamath&#39;s 10-bagger estimate is going to look conservative.</p>\n\n<h1>Positions or ban</h1>\n\n<p><strong>What can I say, I like the stock.</strong></p>\n\n<p><a href=\"https://preview.redd.it/887il0m5ky671.png?width=1354&amp;format=png&amp;auto=webp&amp;s=cf1a285ed97bfcf2f544b9997b95b4b3067b6612\">https://preview.redd.it/887il0m5ky671.png?width=1354&amp;format=png&amp;auto=webp&amp;s=cf1a285ed97bfcf2f544b9997b95b4b3067b6612</a></p>\n\n<p>I <a href=\"https://www.reddit.com/r/wallstreetbets/comments/nr6rpz/clov_yolo_part_2_the_double_down/\">doubled down on my YOLO before</a> but with the drop to the $11&#39;s on Monday I&#39;ve added another 25,000 shares and now hold 98888 shares of CLOV. Ironically, I started buying CLOV trying to find a stock that was heavily undervalued and was going to put $100K into it. Now my attempt at building a diversified value portfolio with $1 million has somehow turned into this insanity but hey, I guess I&#39;ve spent too much time here.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#365b8c",
  "id": "o672a9",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bittabet",
  "discussion_type": null,
  "num_comments": 166,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/o672a9/clov_detailed_dd/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/o672a9/clov_detailed_dd/",
  "subreddit_subscribers": 10578312,
  "created_utc": 1624463355,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1624429129,
  "the_new_excerpt": "Hi everybody, I've decided to finally try and write up a more in depth DD for\nCLOV because I think a lot of people have a tough time understanding their\nbusiness model, and understanding why they have a legitimate shot at helping to\nfix one of the biggest issues with healthcare in America. For some",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CLOVDD\nCLOV\n\n1...",
      "title": "CLOVDD"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "CLOVDD\n\n\n...",
      "title": "CLOVDD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "CLOVDD\n\n\n...",
      "title": "CLOVDD"
    }
  ],
  "source_updated_at": 1624614204508
}