{
  "author": "ToonSquadFan4Ever",
  "the_new_excerpt": "Love her a lot. She's not at all interested in crypto but my fiancee still puts\nsome effort into understanding it just because I care about it and every time I\nwant to sell something she will sit down with me and ask me \"Hey, if you think\nthis is rationally the right thing to do that's great, but…",
  "original_created_utc": 1615236674,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很爱她。她对加密技术一点都不感兴趣，但我的未婚妻还是把\n一些努力去了解它，只是因为我关心它，每次我\n她会坐下来问我：\"嘿，如果你觉得......\"。\n这在理智上是正确的做法，这是伟大的，但... ...",
      "title": "我真的很幸运，能有一个鼓励我不卖东西的伙伴。每次我想卖掉的时候，她总能让我冷静下来，理性地思考问题，如果没有她，我不知道自己会在哪里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很愛她。她對加密技術一點都不感興趣，但我的未婚妻還是把\n一些努力去了解它，只是因爲我關心它，每次我\n她會坐下來問我：\"嘿，如果你覺得......\"。\n這在理智上是正確的做法，這是偉大的，但... ...",
      "title": "我真的很幸運，能有一個鼓勵我不賣東西的夥伴。每次我想賣掉的時候，她總能讓我冷靜下來，理性地思考問題，如果沒有她，我不知道自己會在哪裏。"
    }
  ],
  "title": "I'm really lucky to have a partner that encourages me to hodl instead of sell. Every time I think about selling she always gets me to calm down and think about things rationally, and I don't know where I'd be without her.",
  "created_utc": 1615286264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Love her a lot. She&#39;s not at all interested in crypto but my fiancee still puts some effort into understanding it just because I care about it and every time I want to sell something she will sit down with me and ask me &quot;Hey, if you think this is rationally the right thing to do that&#39;s great, but are you being rational or emotional right now?&quot; and she always brings me back down to earth. I&#39;ve asked her to just tell me I&#39;m being dumb sometimes and she&#39;s happy to comply.</p>\n\n<p>It&#39;s funny, I try to be super rational, research things, I&#39;m lucky to come from a tech background, my dad got me into crypto himself (he even gave me Ada for my birthday haha) and I know that I&#39;d still manage to fuck it all up if not for her. The one rule I have is to talk over any investments with her before I do anything, and even though she isn&#39;t super in tune with the tech or the market she <em>is</em> very much in tune when I&#39;m acting dumb so she can tell based on my tone when to tell me to slow the fuck down. I&#39;m really lucky to have her. </p>\n\n<p>Not much of a point to this post, just honestly wanted to say I&#39;m really happy I have someone who can keep my head straight because <em>oh my god I&#39;m a dumbass who shouldn&#39;t be left unsupervised with internet money</em> and I&#39;m aware I&#39;m really lucky.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/m0pqzr/im_really_lucky_to_have_a_partner_that_encourages/",
  "subreddit": "CryptoCurrency",
  "id": "m0pqzr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573502
}