{
  "author": "nobjos",
  "the_new_excerpt": "I had posted the previous picks from my program and my analysis here and the\nresponse I received was amazing. I have been working on improving the program\nand have made the program public. If you have seen the previous posts, please\nfeel free to skip to the DD.\n\nHow does it work: The program is…",
  "original_created_utc": 1615207597,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我曾在这里发布过我之前的选秀节目和我的分析，并在这里发布了\n我收到的回应是惊人的。我一直在努力改进这个程序\n并已将该方案公开。如果您看到之前的帖子，请\n随意跳到DD。\n\n它是如何工作的。这个程序是...",
      "title": "我分析各社交媒体对股票的提及率和情绪，来寻找上涨的股票! 本周涨幅最高的股票及其DD：$UWMC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾在這裏發佈過我之前的選秀節目和我的分析，並在這裏發佈了\n我收到的迴應是驚人的。我一直在努力改進這個程序\n並已將該方案公開。如果您看到之前的帖子，請\n隨意跳到DD。\n\n它是如何工作的。這個程序是...",
      "title": "我分析各社交媒體對股票的提及率和情緒，來尋找上漲的股票! 本週漲幅最高的股票及其DD：$UWMC。"
    }
  ],
  "title": "I analyze mentions and sentiment of stocks across social media to find rising stocks! This week's top growing stock and its DD: $UWMC",
  "created_utc": 1615213592,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had posted the previous picks from my program and my analysis here and the response I received was amazing. I have been working on improving the program and <strong>have made the program public</strong>. If you have seen the previous posts, please feel free to skip to the DD.</p>\n\n<p><strong>How does it work:</strong> The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth.</p>\n\n<p>Here is the stock picked by the program and my DD</p>\n\n<p><strong>Stock: UWM Holdings ($UWMC)</strong></p>\n\n<p>Week on Week increase in mentions: +1286.9%</p>\n\n<p>Month on Month increase in mentions: +2762%</p>\n\n<p>Average sentiment across mentions: <strong>+21.83%</strong></p>\n\n<p><strong>Core Product</strong></p>\n\n<p>United Wholesale Mortgage (UWM) underwrites loans for mortgage brokers, banks and credit unions. It doesn&#39;t lend directly to borrowers. Instead, they are simply the facilitator and underwriter. What they mainly provide is consumers, lenders and institutions a simple process by which they can apply, compare and complete a mortgage application. They currently have one of the fastest and most effective consumer to lender processes due to their heavy investments into IT infrastructure (UWMC’s mortgage process takes an average of 17 days from start to finish when compared to the industry average of 47 days)</p>\n\n<p><strong>Financials</strong></p>\n\n<p>UWM had a stellar year in 2020 and it reflects in its financials.</p>\n\n<p>UWM reported 4Q20 net income of $1.37 billion and FY20 net income of $3.38 billion, an 821% and 715% increase over 4Q19 and FY19 respectively. Their total loan volume amount for 2020 was $182.5B which was 69% higher than 2019.</p>\n\n<p>Cash in hand also rose from 133M in 4Q-19 to 1.22B in 4Q-20. Credit quality of the loans improved with the weighted average FICO of 757 for the full year of 2020. This brought down the 60+ delinquency rates well below the industry average. UWMC also just declared its first regular quarterly dividend of $0.10 per share on the outstanding shares of Class A Common Stock. The dividend is payable on April 6, 2021 to stockholders of record at the close of business on March 10, 2021.</p>\n\n<p><strong>Potential and Hype Factors</strong></p>\n\n<p>Russell index addition: UWMC is expected to be added into Russell 1000 and Russell 3000 index by end of March. This will force all the funds tracking these indices to add UWMC to their portfolio possibly driving the stock price higher.</p>\n\n<p>Technology moat: UWMC invests heavily in IT infrastructure and technology. They develop all their technology with in-house developers. They have developed tools such as Blink+, UWM InTouch, and Brand 360 which enables them to have an industry-leading close time (almost twice as fast as Rocket and 3x as fast as the industry average)</p>\n\n<p>Short interest: While the company is in no way similar to the GME case in short interest (140% which was a very rare event), it still is at 31% which is significantly higher than average. (source: fintel.io)</p>\n\n<p>NPS score: They currently have the happiest customers among their competition with an NPS score 16% higher than that of Rocket (which is at 2nd place).</p>\n\n<p><strong>Risk and Competition</strong></p>\n\n<p>75% of the mortgage volume was based on refinancing ($42.9B new mortgages, $139.3B refinancing). This is predominantly driven by declining mortgage rates. If the mortgage rates increase, then UWMC’s refinancing volume will take a significant hit bringing down their revenues.</p>\n\n<p>There is a lot of discussion around this being one of the reasons UWMC went public so as to capitalize on the refinance boom. I don’t completely buy this argument as company executives themselves are solidifying their position (Director of $UWMC just reported his SEC form 4, showing he more than doubled his own position on March 1st, from 50k to 110k shares).</p>\n\n<p>The full impact of UWMC’s CEO&#39;s surprise announcement that they wouldn’t work with mortgage brokers that work with Rocket or Fairway Independent Mortgage is still not clear. UWMC has said that the split will take effect from March 15th.</p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>This is the first time in my experience that a trending stock that has solid fundamentals is generating revenue, is profitable, and has no debt. Although there are some risks in terms of mortgage rates and the surprise announcement, I think the current market conditions put UWMC in a very strong position as a long-term play.</p>\n\n<p><em>Disclaimer: I am not a financial advisor. I currently do not own any stock of UWMC. Please do your own extensive research before investing in any stock.</em></p>\n</div><!-- SC_ON -->",
  "score": 527,
  "permalink": "/r/stocks/comments/m0eycg/i_analyze_mentions_and_sentiment_of_stocks_across/",
  "subreddit": "stocks",
  "id": "m0eycg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542577950
}