{
  "author": "theusdesi",
  "the_new_excerpt": "Like many noob crypto investors, I made a chargeback mistake. That means my\nbalance went negative on Binance.US [https://Binance.US]. It was just $100 and I\nsettled quickly within two days by doing a wire transfer. However, they locked\nmy asset which is significantly more than $100. I was hung out…",
  "original_created_utc": 1617886567,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの未熟な暗号投資家と同様に、私もチャージバックのミスを犯しました。それは、私の\nBinance.US [https://Binance.US]で残高がマイナスになりました。それはわずか100ドルで、私は\n電信送金をすることで2日以内にすぐに解決しました。しかし、彼らは私の資産をロックしてしまいました。\n私の資産は100ドルを大幅に超えています。私は干されました...。",
      "title": "Binance.USはサポートがなく、出金をロックしているため、アルトコインの取引にはお勧めできません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像很多无名地下投资者一样，我犯了一个收费错误。这意味着我的\nBinance.US[https://Binance.US]上的余额变成了负数。它只是100美元，我\n通过做电汇，两天内迅速解决。然而，他们锁定了\n我的资产这是显着 超过100元。我被挂出...",
      "title": "Binance.US不应该被推荐用于alt币交易，因为他们没有支持，而且是锁定提现。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像很多無名地下投資者一樣，我犯了一個收費錯誤。這意味着我的\nBinance.US[https://Binance.US]上的餘額變成了負數。它只是100美元，我\n通過做電匯，兩天內迅速解決。然而，他們鎖定了\n我的資產這是顯着 超過100元。我被掛出...",
      "title": "Binance.US不應該被推薦用於alt幣交易，因爲他們沒有支持，而且是鎖定提現。"
    }
  ],
  "title": "Binance.US should not be recommended for alt-coin trade as they have no support and are locking up withdrawal.",
  "created_utc": 1617908092,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like many noob crypto investors, I made a chargeback mistake. That means my balance went negative on <a href=\"https://Binance.US\">Binance.US</a>. It was just $100 and I settled quickly within two days by doing a wire transfer.  However, they locked my asset which is significantly more than $100. I was hung out dry for about two weeks without any help.</p>\n\n<p>In another instance, my friend did a wire transfer, but he forgot to add a unique code in the wire transfer so the money was in limbo and not released by Binance. He is fighting to have it released with no response.</p>\n\n<p>Those are all common mistakes people make. I agree I am partially at fault here, but you need swift customer support to fix this.  <a href=\"https://Binance.US\">Binance.US</a>  fails so badly in this.</p>\n\n<p>Big story short. I reached out to a lawyer for counsel and he asked me to reach to <a href=\"https://Binance.US\">Binance.US</a> compliance officer. Last week, I emailed the compliance officer explaining the situation, and the account was unlocked in 2 hours.</p>\n\n<p>&#x200B;</p>\n\n<p>Either you are a pro or noob crypto investor, <a href=\"https://Binance.US\">Binance.US</a> is not an ideal place to trade. Even for a small mistake, they are locking up accounts without providing any support.  Their ticket system is joke and tickets are being closed without solving them.</p>\n\n<p>Maybe one day if they have customer support like Kraken, <a href=\"https://Binance.US\">Binance.US</a> is a good place, but until then I would avoid it.</p>\n</div><!-- SC_ON -->",
  "score": 416,
  "permalink": "/r/CryptoCurrency/comments/mmr6ao/binanceus_should_not_be_recommended_for_altcoin/",
  "subreddit": "CryptoCurrency",
  "id": "mmr6ao",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566612879
}