{
  "author": "ilove711hotdogs",
  "original_created_utc": 1630624454,
  "title": "I fucking hate ETH. It takes $1000 to move $3 of COMP.",
  "created_utc": 1630633202,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Middle of the transaction, the gas fees went up and now I had to transfer another ETH!\nFuck that shit. Lost so much transferring, swapping, and got nothing. What the fuck is this network? Maybe the price of ETH rises and liquidity on ETH DeFi is high because people can’t actually move their tokens.\nNice. </p>\n\n<p>How is this top 2 is beyond me. Oh before you talk about decentralization, the Nakamoto Coefficient of Ethereum is just 3 and that means only 3 entities are enough to disrupt the network.</p>\n\n<p>We need scalable chains. Any great contenders?</p>\n</div><!-- SC_ON -->",
  "score": 223,
  "permalink": "/r/CryptoCurrency/comments/pgt0sv/i_fucking_hate_eth_it_takes_1000_to_move_3_of_comp/",
  "subreddit": "CryptoCurrency",
  "id": "pgt0sv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Middle of the transaction, the gas fees went up and now I had to transfer\nanother ETH! Fuck that shit. Lost so much transferring, swapping, and got\nnothing. What the fuck is this network? Maybe the price of ETH rises and\nliquidity on ETH DeFi is high because people can’t actually move their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "取引の途中でガス料金が上がり、さらに別のETHを送金しなければならなくなりました。\nETHを送金しなければならない。くそくらえだ。送金、交換に多くの時間を費やし、何も得られませんでした。\n何も得られなかった このネットワークはいったい何なんだ？多分、ETHの価格が上がって\nETH DeFi の流動性は高い 人々は実際には移動できないから...",
      "title": "ETHはクソ嫌いです。3ドルのCOMPを動かすのに1000ドル必要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在交易过程中，汽油费增加了，现在我不得不转移\n另一个ETH! 去他妈的。转移、交换损失了这么多，却什么也没得到\n什么都没有。这他妈的是什么网络？也许ETH的价格上涨了，而\nETH DeFi的流动性很高，因为人们实际上无法移动他们的...",
      "title": "我他妈的讨厌ETH。需要1000美元才能移动3美元的COMP。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在交易過程中，汽油費增加了，現在我不得不轉移\n另一個ETH! 去他媽的。轉移、交換損失了這麼多，卻什麼也沒得到\n什麼都沒有。這他媽的是什麼網絡？也許ETH的價格上漲了，而\nETH DeFi的流動性很高，因爲人們實際上無法移動他們的...",
      "title": "我他媽的討厭ETH。需要1000美元才能移動3美元的COMP。"
    }
  ]
}