{
  "author": "StimCop87",
  "the_new_excerpt": "I’ve been loosely involved in crypto for the past decade and hold BTC and ETH\n(and now, Algo) - I examined the shitcoins available during the last bullrun,\nbut aside from ETH, did not ultimately conclude that any were worth the\n“investment” (i.e. trying to time the dumps following the pumps). Mass…",
  "original_created_utc": 1619652117,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は過去10年間、ゆるやかに暗号に関わってきており、BTCとETHを保有しています。\n(そして現在はAlgo) - 前回のブルランの際には、利用可能なクソコインを検討しました。\nETHは別として、最終的には「投資」に値するものはないと結論づけました。\n\"ETHは別として、最終的には「投資」の価値があるとは判断しませんでした（つまり、ポンプの後のダンプのタイミングを計ろうとしたのです）。マス...",
      "title": "アルゴランドの採用と使用例"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的十年中，我一直松散地参与加密货币，并持有BTC和ETH（现在是Algo）。\n以及现在的Algo）--在上一次牛市中，我研究了可用的狗屎币。\n但除了ETH之外，最终没有得出任何值得投资的结论。\n\"投资\"（即试图在抽水机之后的跳水时间）。大众...",
      "title": "Algorand的采用和使用案例"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的十年中，我一直鬆散地參與加密貨幣，並持有BTC和ETH（現在是Algo）。\n以及現在的Algo）--在上一次牛市中，我研究了可用的狗屎幣。\n但除了ETH之外，最終沒有得出任何值得投資的結論。\n\"投資\"（即試圖在抽水機之後的跳水時間）。大衆...",
      "title": "Algorand的採用和使用案例"
    }
  ],
  "title": "Algorand Adoption and Use Case",
  "created_utc": 1619674501,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been loosely involved in crypto for the past decade and hold BTC and ETH (and now, Algo) - I examined the shitcoins available during the last bullrun, but aside from ETH, did not ultimately conclude that any were worth the “investment” (i.e. trying to time the dumps following the pumps). Mass adoption is something I did not consider remotely possible during the last run... my reasoning at the time: “the average person can barely handle possessing a credit card, let alone figuring out the complexities of purchasing and storing digital assets with long alpha numeric addresses at 8+ digit amounts.” User interfacing and general crypto knowledge have improved significantly now (and therefore, general adoption), some 3 to 4 years later.</p>\n\n<p>This cycle, Algorand has caught my attention. Semi-relatedly, I have been following Cardano (ADA) for the past few months, but the lack of working smart contracts, coupled with the founder’s eccentricism and overall demeanor, have kept me from investing.  Coming from a mathematical background myself, I do appreciate the focus of ADA’s development; but I worry about the missed deadlines and the ‘never-ending (and potentially unwarranted) ADA optimism baked with subtle pessimism for other projects that Charles portrays in seemingly every interview I watch or statement I read. </p>\n\n<p>This leads me to my question: why is everyone sleeping on Algorand (ALGO)? Algo does, currently,  almost everything that ADA claims it will do (and that ETH hopes it will do, should the open-heart-network-surgery being planned in the roll-out out EIP-1559 and Eth2.0). I am not here to shill - I am simply curious. Algo functions on pure proof of stake (PPoS), has working smart contracts, has a secure native wallet, features lightning fast transaction times (that will only improve) and low transaction fees, and has a smaller final circulating supply. The staking rewards system is great now (yes, it is an inflationary distribution - but, so what? This argument could be made about any coin that has not yet hit its full circulating supply, whether by PoS or PoW). Even Charles has stated that Algo is the real contender for (fully functioning) ADA (and again, ADA is not fully functioning as of yet). Algo was created by Silvio Mecali and team (both Silvio and another of the team members won the Turing Award in 2012 for their work in cryptology, and Silvio has been publishing work on blockchain technology since the 80s).</p>\n\n<p>I believe that true crypto adoption will come by means of USDC and government adoption (whether we like it or not), and I think Algorand is poised to be the network that facilitates this adoption (look up the USDC/Algorand relationship as it stands now, already).</p>\n\n<p>Am I alone here? How do you all feel about Algo?</p>\n\n<p>EDIT: \nAppreciate all of the spirited discussion. I think it might be time to buy some more algo</p>\n</div><!-- SC_ON -->",
  "score": 369,
  "permalink": "/r/CryptoCurrency/comments/n0rkir/algorand_adoption_and_use_case/",
  "subreddit": "CryptoCurrency",
  "id": "n0rkir",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776213355
}