{
  "author": "FrantiekEugeneD2E",
  "original_created_utc": 1635336057,
  "title": "Anybody else genuinely prefer rain/overcast over sunshine?",
  "created_utc": 1635366300,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don’t gather me wrong, the sun is great and absolutely essential but.. does anybody else get genuinely excited for rain? Or enjoy days withovercast (dark gray clouds above) more than those bright sunshine days?</p>\n\n<p>&#x200B;</p>\n\n<p>I feel enjoy everybody always talks about how great the weather is and then you look outside to see a blazing sun at 2pm, not a cloud in site and extremely dry?</p>\n\n<p>&#x200B;</p>\n\n<p>I worship being outdoors and hikingbut 100% if it’s raining or heavy overcast it’s going to be a far better day than a day full of sun.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/qgv2d7/anybody_else_genuinely_prefer_rainovercast_over/",
  "subreddit": "NoStupidQuestions",
  "id": "qgv2d7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Don’t gather me wrong, the sun is great and absolutely essential but.. does\nanybody else get genuinely excited for rain? Or enjoy days withovercast (dark\ngray clouds above) more than those bright sunshine days?\n\n\n\nI feel enjoy everybody always talks about how great the weather is and then you\nlook…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解を恐れずに言えば、太陽は素晴らしく、絶対に必要なものですが...。\n雨が降ると純粋にワクワクする人はいませんか？あるいは、オーバーキャスト（上空に暗い灰色の雲）のある日は、明るい日よりも\n暗い灰色の雲が上にある日は、明るい太陽の日よりも楽しいですか？\n\n\n\n誰もがいつも天気の良さについて話しているのに、見てみると・・・。\n見てみると...",
      "title": "純粋に、太陽よりも雨や曇りが好きな人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要把我想错了，太阳是伟大的，也是绝对必要的，但是......有谁会因为下雨而真正感到兴奋？\n还有人对下雨天感到真正的兴奋吗？或者享受有阴雨的日子（上面的黑\n灰色云层）的日子比那些阳光明媚的日子更喜欢？\n\n\n\n我觉得每个人都在谈论天气有多好，然后你看\n看看...",
      "title": "还有人真正喜欢下雨/阴天而不是阳光吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要把我想錯了，太陽是偉大的，也是絕對必要的，但是......有誰會因爲下雨而真正感到興奮？\n還有人對下雨天感到真正的興奮嗎？或者享受有陰雨的日子（上面的黑\n灰色雲層）的日子比那些陽光明媚的日子更喜歡？\n\n\n\n我覺得每個人都在談論天氣有多好，然後你看\n看看...",
      "title": "還有人真正喜歡下雨/陰天而不是陽光嗎？"
    }
  ]
}