{
  "author": "Mengerite",
  "original_created_utc": 1624362778,
  "title": "How to do this - from a former top buyer",
  "created_utc": 1624380241,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tons of posts right now from people about to cave to their emotions and make bad short-term decisions. I thought I&#39;d try to share my experience as a former bag holder and how I wound up successful. I bought near the top in 2017. BTC was boring and &quot;expensive&quot; so I had a mix of shitcoins in my portfolio (I&#39;ll not throw shade on anyone in particular to protect my inbox). For a time, I was a genius. Then all of a sudden I wasn&#39;t. Eventually, I found myself down 50% and had to make some tough decisions. Here&#39;s what I did and how it turned out.</p>\n\n<p>I first had to decide if I was a long-term bull or bear on crypto. Obviously, I&#39;m still here because I think crypto is the future. I also looked at the cyclical price history and surmised that - although it might be a while - crypto would blow by the previous highs. Rather than try to time the market, I decided to DCA.</p>\n\n<p>Three important things about that DCA.</p>\n\n<ol>\n<li>It was a monthly buy that I could afford as part of my household budget.</li>\n<li>I decided to focus on BTC and ETH (I did continue to buy LTC for a while since it was on Coinbase).</li>\n<li>I concerned myself with other things in order to forget (or not focus on) the DCA. It simply did its thing no matter the price.</li>\n</ol>\n\n<p>Looking back at my buy history, I picked up some ETH near $80. The magic of DCA is that <em>most</em> of my crypto was purchased at those low prices. Importantly, I never knew where the market was going in the short term (still don&#39;t), but through my own research, I developed a bull thesis for crypto long term.</p>\n\n<p>Now I use the <a href=\"https://www.blockchaincenter.net/bitcoin-rainbow-chart/\">rainbow chart</a> to guide my DCA. In short, I pause it in the orange and start back up in the green (just started it back up with my June purchase yesterday). I had started this before finding the rainbow chart. When your monthly buy is a tiny fraction of your total holdings, it will feel like a waste. The chart formalizes this intuition into a plan, but it&#39;s still DCA.</p>\n\n<p>I know the exact feelings many on this board are experiencing. I can empathize. <strong>IF</strong> after careful consideration, you decide you are a long-term bull like myself, I hope you&#39;ll consider the strategy above. It&#39;s boring. It&#39;s not guaranteed to work. It has worked well for me so far.</p>\n\n<p>This run may or may not be over, but I&#39;m excited to see where we are ~1.5 years after the next BTC halving. Good luck to everyone.</p>\n\n<p>EDIT: thanks to <a href=\"/u/aladdinr\">u/aladdinr</a> for providing the rainbow chart for ETH: <a href=\"https://www.blockchaincenter.net/ethereum-rainbow-chart/\">https://www.blockchaincenter.net/ethereum-rainbow-chart/</a></p>\n</div><!-- SC_ON -->",
  "score": 292,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?auto=webp&s=23971b688713d31a95c93ec423afda3d614d4a5e",
          "width": 896,
          "height": 597
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?width=108&crop=smart&auto=webp&s=ce0c98faa0cee7c03fbdaccf74a3d096d6e45f53",
            "width": 108,
            "height": 71
          },
          {
            "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?width=216&crop=smart&auto=webp&s=8a13ae08a273e91157d4fc44157346aa7c7c59c5",
            "width": 216,
            "height": 143
          },
          {
            "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?width=320&crop=smart&auto=webp&s=73df69ec262017daa1c9b067837a2b0c21c4047f",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/SewGpYdYjd6-lqf-MFD30wS-07DnvHk7GLgVFN9tTT4.jpg?width=640&crop=smart&auto=webp&s=0234068ed1312f1cf8c0fee09279b3a4ac34e4e3",
            "width": 640,
            "height": 426
          }
        ],
        "variants": {},
        "id": "PHBK3wl6pSDGIOV55LeJEjuaVGRNdfns-wkQMyLImV4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/o5lb6v/how_to_do_this_from_a_former_top_buyer/",
  "subreddit": "CryptoCurrency",
  "id": "o5lb6v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Tons of posts right now from people about to cave to their emotions and make bad\nshort-term decisions. I thought I'd try to share my experience as a former bag\nholder and how I wound up successful. I bought near the top in 2017. BTC was\nboring and \"expensive\" so I had a mix of shitcoins in my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "感情に負けて短期的な判断を誤ろうとしている人たちの投稿が今、たくさんあります。\n短期的な判断を誤ろうとしています。ここでは、かつてバッグを持っていた私の経験と、どのようにして成功したかを紹介したいと思います。\n私がどのようにして成功したのかをお伝えしたいと思います。私は2017年のトップ近くで買いました。BTCは\nつまらなくて「高い」と思ったので、クソコインを混ぜて持ってい...",
      "title": "その方法は、元トップバイヤーから"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在有大量的帖子是人们向自己的情绪屈服并做出错误的\n短期决定。我想我将尝试分享我作为一个前包商的经验\n持有人的经验，以及我是如何成功的。我在2017年的顶部附近买入。BTC当时\n枯燥和 \"昂贵\"，所以我在我的账户中混合了一些垃圾币。",
      "title": "如何做到这一点--来自一位前顶级买家的建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在有大量的帖子是人們向自己的情緒屈服並做出錯誤的\n短期決定。我想我將嘗試分享我作爲一個前包商的經驗\n持有人的經驗，以及我是如何成功的。我在2017年的頂部附近買入。BTC當時\n枯燥和 \"昂貴\"，所以我在我的賬戶中混合了一些垃圾幣。",
      "title": "如何做到這一點--來自一位前頂級買家的建議"
    }
  ]
}