{
  "author": "Many_Scratch2269",
  "original_created_utc": 1639064665,
  "title": "If someone claims to be Satoshi, they are not Satoshi.",
  "created_utc": 1639078485,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It should be very clear that anyone claiming to be Satoshi is just looking for fame. There was a reason for Bitcoin being made anonymously under an anonymous username.&lt;/p&gt;\n\n&lt;p&gt;If the real Satoshi wanted to make himself known, he&amp;#39;d already be having it done a long time ago. Craig Wright claiming himself to be the inventor of Bitcoin can&amp;#39;t even prove Satoshis wallet is his despite the authorities asking him repeatedly to move even a small amount in order to prove it.&lt;/p&gt;\n\n&lt;p&gt;TLDR: The real Satoshi would not chase the media for attention because Satoshi created Bitcoin to save people from the greed of banks and politicians, not for personal fame.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/rckbr7/if_someone_claims_to_be_satoshi_they_are_not/",
  "subreddit": "CryptoCurrency",
  "id": "rckbr7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It should be very clear that anyone claiming to be Satoshi is just looking for\nfame. There was a reason for Bitcoin being made anonymously under an anonymous\nusername.\n\nIf the real Satoshi wanted to make himself known, he'd already be having it done\na long time ago. Craig Wright claiming himself to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サトシを名乗る者は、ただ単にサトシが目当てであることは明白である。\n名声 ビットコインが匿名で作られたのには理由があり\nというユーザー名です。\n\nもし本物のサトシが自分のことを知られたいと思っていたら、すでにそうしているはずです。\n遥か昔に。クレイグ・ライトは、自らを...",
      "title": "誰かがサトシを名乗ったとしても、その人はサトシではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "应该非常清楚，任何声称是中本聪的人都只是在寻找\n名声。比特币以匿名方式制作是有原因的。\n的用户名。\n\n如果真正的中本聪想让自己为人所知，他已经在很久之前就开始做了\n很久以前。克雷格-赖特声称自己是...",
      "title": "如果有人声称自己是中本聪，他们就不是中本聪。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "應該非常清楚，任何聲稱是中本聰的人都只是在尋找\n名聲。比特幣以匿名方式製作是有原因的。\n的用戶名。\n\n如果真正的中本聰想讓自己爲人所知，他已經在很久之前就開始做了\n很久以前。克雷格-賴特聲稱自己是...",
      "title": "如果有人聲稱自己是中本聰，他們就不是中本聰。"
    }
  ]
}