{
  "author": "MrASDFtype",
  "original_created_utc": 1626134383,
  "title": "Are all Sikh people really this nice or is this an aberration?",
  "created_utc": 1626167503,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in a rural area of the United States which is 99% white but I happen to come across about a dozen Sikh people in the last few years and they have all been so incredible that I cannot believe the entire culture is like this.  They are hard working, polite, generous, moral, with seeming no faults whatsoever.  Are all Sikh folk like this or am I missing something?  These are some mighty fine people that I wish were given more credit.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/oj3ri8/are_all_sikh_people_really_this_nice_or_is_this/",
  "subreddit": "NoStupidQuestions",
  "id": "oj3ri8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in a rural area of the United States which is 99% white but I happen to\ncome across about a dozen Sikh people in the last few years and they have all\nbeen so incredible that I cannot believe the entire culture is like this. They\nare hard working, polite, generous, moral, with seeming no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカの99％が白人の田舎に住んでいますが、ここ数年、たまたま10数人のシーク教徒に出会いました。\nここ数年で十数人のシーク教徒に出会いましたが、彼らは皆、信じられないほど素晴らしい人たちでした。\n彼らは皆、文化全体がこのようなものだとは信じられないほど素晴らしい人たちでした。彼らは\n彼らは勤勉で、礼儀正しく、寛大で、道徳的で、一見すると...",
      "title": "シーク教徒はみんなこんなに親切なのか、それともこれは異常なことなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在美国的一个农村地区，那里有99%的白人，但在过去几年里，我碰巧遇到了十几个锡克教徒，他们都有一个共同的特点，那就是都是白人。\n在过去的几年里，我遇到了十几个锡克教徒，他们都是如此的不可思议，我无法相信整个文化是这样的。\n他们都是如此不可思议，以至于我无法相信整个文化是这样的。他们\n他们努力工作，有礼貌，慷慨大方，有道德，似乎没有什么不妥。",
      "title": "所有的锡克族人真的都这么好吗，还是说这是一种反常现象？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在美國的一個農村地區，那裏有99%的白人，但在過去幾年裏，我碰巧遇到了十幾個錫克教徒，他們都有一個共同的特點，那就是都是白人。\n在過去的幾年裏，我遇到了十幾個錫克教徒，他們都是如此的不可思議，我無法相信整個文化是這樣的。\n他們都是如此不可思議，以至於我無法相信整個文化是這樣的。他們\n他們努力工作，有禮貌，慷慨大方，有道德，似乎沒有什麼不妥。",
      "title": "所有的錫克族人真的都這麼好嗎，還是說這是一種反常現象？"
    }
  ]
}