{
  "author": "John-McAfee",
  "original_created_utc": 1630129407,
  "title": "What’s the worst crypto decision you’ve ever made?",
  "created_utc": 1630146978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have made several bad trades since 2017. One of the worst trades I’ve ever made was selling 69 BNBs for $30 each and never buying them back. And buying few ETHs for $150 during the crash and selling them for 250. </p>\n\n<p>I’m the king of bad trades. I always tell my friends to HODL, DCA, never FOMO and never Day Trade but I never follow these rules myself and it had cost me dearly in the past. </p>\n\n<p>So I’d like to know what are the worst trades you’ve done till now and feel slightly better about myself. ¯\\_(ツ)_/¯</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/pd46if/whats_the_worst_crypto_decision_youve_ever_made/",
  "subreddit": "CryptoCurrency",
  "id": "pd46if",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have made several bad trades since 2017. One of the worst trades I’ve ever\nmade was selling 69 BNBs for $30 each and never buying them back. And buying few\nETHs for $150 during the crash and selling them for 250.\n\nI’m the king of bad trades. I always tell my friends to HODL, DCA, never FOMO\nand…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2017年から何度も悪いトレードをしています。私がこれまでに行った最悪のトレードの一つは\n69枚のBNBを1枚30ドルで売って、それを買い戻さなかったことです。そして、いくつかの購入\nETHを暴落時に150ドルで買い、250ドルで売ったことです。\n\n私は悪いトレードの王様です。私はいつも友人にHODL、DCA、決してFOMOにならないように言っています。\nそして...",
      "title": "これまでに行った最悪の暗号化の決定は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自2017年以来，我已经做了几次糟糕的交易。我所做过的最糟糕的交易之一\n是以每个30美元的价格卖出69个BNB，然后再也没有买回它们。并在大跌期间以150美元的价格买入少量\nETH，在暴跌期间以150美元买入，然后以250美元卖出。\n\n我是最糟糕的交易之王。我总是告诉我的朋友们，HODL，DCA，永远不要FOMO\n和...",
      "title": "你做过的最糟糕的加密货币决定是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自2017年以來，我已經做了幾次糟糕的交易。我所做過的最糟糕的交易之一\n是以每個30美元的價格賣出69個BNB，然後再也沒有買回它們。並在大跌期間以150美元的價格買入少量\nETH，在暴跌期間以150美元買入，然後以250美元賣出。\n\n我是最糟糕的交易之王。我總是告訴我的朋友們，HODL，DCA，永遠不要FOMO\n和...",
      "title": "你做過的最糟糕的加密貨幣決定是什麼？"
    }
  ]
}