{
  "author": "AmunPharaoh",
  "original_created_utc": 1636006850,
  "title": "Am I an arsehole for hiding my family's financial situation from girls I date?",
  "created_utc": 1636026560,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just came across a question on the relationship sub that has me feeling a bit sick. It was a girl who said her bf had lied to her about his family having money and she was pissed off and wanted to break it off with him. Everyone was on her side, saying to leave him immediately and that he couldn&#39;t be trusted, etc.</p>\n\n<p>The issue is, I do this. Not to the extent that the guy did in the post I saw (she said he was inventing stories of them being extremely poor and making her pay for things, claiming he had no money and such, for five solid years). In my case I usually hold off for about a year as far as actually taking them to my parents&#39; house and them getting to see it etc. I live in a pretty normal flat, drive a 7 year old car, and I don&#39;t pretend to be skint or anything, I&#39;m just an average university student basically. I never make girls pay for anything but I don&#39;t flaunt in any way that I have more money than any normal person. I just sort of leave out the details I don&#39;t want them to know, and put off showing them anything that could give it away. </p>\n\n<p>I did this with my current gf and she did seem a bit confused by it at first but after I explained why she seemed to understand. I do it because if I&#39;m really into a girl, I want to be sure she actually likes ME, and isn&#39;t just tolerating me thinking I&#39;m her personal ATM. My gf seems to have reacted well, we&#39;re still together and she appears to still trust me. The only issue was it seemed like it made her kind of insecure for awhile. But I haven&#39;t noticed it lately. </p>\n\n<p>If what I&#39;m doing is wrong, what should I do instead to weed out people who wouldn&#39;t want to date me except for the money thing?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/qmefut/am_i_an_arsehole_for_hiding_my_familys_financial/",
  "subreddit": "TooAfraidToAsk",
  "id": "qmefut",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just came across a question on the relationship sub that has me feeling a bit\nsick. It was a girl who said her bf had lied to her about his family having\nmoney and she was pissed off and wanted to break it off with him. Everyone was\non her side, saying to leave him immediately and that he couldn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はちょうどリレーションシップサブで、ちょっと気分が悪くなるような質問を見つけました。\n感じました。それは、彼の家族がお金を持っているという嘘をついたという女の子の質問でした。\n彼の家族がお金を持っていると嘘をついたので、彼女は腹を立てて彼と別れたいと言った女の子でした。誰もが彼女の味方で\n誰もが彼女の味方で、すぐに彼と別れろ、彼には無理だ...と言っていました。",
      "title": "付き合っている女の子に自分の家庭の経済状況を隠している私は、最低の人間でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚在关系子上看到一个问题，让我感到有点\n有病。一个女孩说她的男朋友骗她说他的家庭有钱。\n她很生气，想和他断绝关系。每个人都在\n每个人都站在她这边，说要立即离开他，他不能...",
      "title": "我向我约会的女孩隐瞒我的家庭经济状况，是个混蛋吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛在關係子上看到一個問題，讓我感到有點\n有病。一個女孩說她的男朋友騙她說他的家庭有錢。\n她很生氣，想和他斷絕關係。每個人都在\n每個人都站在她這邊，說要立即離開他，他不能...",
      "title": "我向我約會的女孩隱瞞我的家庭經濟狀況，是個混蛋嗎？"
    }
  ]
}