{
  "author": "solscend",
  "the_new_excerpt": "So what I've gathered lately from the market is that US treasury bonds have been\nselling poorly and thus the yield has been going up on the ten year bond.\nSomething about investors won't buy it unless it has a higher interest rate\nbecause fear of inflation. Now that we're on the verge of signing in…",
  "original_created_utc": 1615345946,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我最近从市场上收集到的信息是，美国国债已经被\n卖得不好，因此十年期国债的收益率一直在上升。\n除非它的利率更高，否则投资者不会买它的东西。\n因为害怕通货膨胀。现在我们已经快要签到了...",
      "title": "刺激法案国债销售"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我最近從市場上收集到的信息是，美國國債已經被\n賣得不好，因此十年期國債的收益率一直在上升。\n除非它的利率更高，否則投資者不會買它的東西。\n因爲害怕通貨膨脹。現在我們已經快要簽到了...",
      "title": "刺激法案國債銷售"
    }
  ],
  "title": "Stimulus bill treasury bond sale",
  "created_utc": 1615361291,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So what I&#39;ve gathered lately from the market is that US treasury bonds have been selling poorly and thus the yield has been going up on the ten year bond. Something about investors won&#39;t buy it unless it has a higher interest rate because fear of inflation. Now that we&#39;re on the verge of signing in a 1.9 trillion stimulus bill, I have a some questions about the effect on the bond market.</p>\n\n<ul>\n<li>When does the US treasury sell the 1.9 trillion in bonds to pay for it?</li>\n<li>Does it do it in one massive sale? What types of bonds does it sell (2 year, 5 year, 10 year)?</li>\n<li>If bonds are already selling poorly, then wouldn&#39;t a massive influx of bonds on the market make the yield situation even worse?</li>\n<li>Are investors/banks prepared to buy it all up? Or will the federal reserve step in and buy the remainder?</li>\n<li>Is it therefore possible that the signing of the stimulus will actually hurt stocks in the short term due to bond market/yield fluctuations?</li>\n<li>Can anyone explain what happened with US treasury/bonds during the 2 trillion stimulus last year? Or the 900 billion stimulus earlier this year?</li>\n</ul>\n\n<p>Thanks for any insight guys! New to the bond side of the market</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/investing/comments/m1nxdy/stimulus_bill_treasury_bond_sale/",
  "subreddit": "investing",
  "id": "m1nxdy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575836
}