{
  "author": "gilgamesh_20",
  "original_created_utc": 1632064038,
  "title": "It's ridiculous that banks keep our money, make more money from them, oh and charge us extra if we don't keep a minimum balance!",
  "created_utc": 1632109056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto is the way to change this practice of banks. \nCrypto won&#39;t completely replace fiat for now, but after all those news about wide adoption of crypto throughout the world I&#39;m confident that Crypto can one day replace fiat(not completely but to a certain extent), especially with advancements in technology. </p>\n\n<p>In my place if we don&#39;t keep a minimum balance they charge a definite amount of fee(different for different banks). So basically they want our money to survive and if we don&#39;t they&#39;ll take more cause we are hurting them.</p>\n\n<p>The banks must really hate the very existence of crypto lol. I read a post a month ago about how a bank banned every one of it&#39;s employees from buying crypto.</p>\n\n<p>Banks will never go away, but we can change the way banks work. I just hope crypto adoption is fast in coming years.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/pr9ntv/its_ridiculous_that_banks_keep_our_money_make/",
  "subreddit": "CryptoCurrency",
  "id": "pr9ntv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto is the way to change this practice of banks. Crypto won't completely\nreplace fiat for now, but after all those news about wide adoption of crypto\nthroughout the world I'm confident that Crypto can one day replace fiat(not\ncompletely but to a certain extent), especially with advancements in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような銀行のやり方を変えるには、暗号化が有効です。今のところ、暗号が完全にフィアットに取って代わることは\n今のところ完全にフィアットに取って代わることはできませんが、世界中で暗号が広く採用されているというニュースを見ると\n完全ではないが、ある程度は）いつかは暗号がフィアットに取って代わると確信しています。\n完全にではないが、ある程度は）、特に...の進歩により、暗号がフィアットに取って代わる日が来ると確信しています。",
      "title": "銀行が私たちのお金を預かり、さらにお金を稼ぎ、さらに最低残高を維持しないと追加料金を請求するなんて、馬鹿げています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Crypto是改变银行这种做法的方法。目前，加密货币不会完全\n暂时不会完全取代法定货币，但在所有这些关于广泛采用加密货币的新闻之后\n我相信加密货币有一天会取代法币（不是完全取代，而是在一定程度上取代）。\n但在一定程度上），特别是随着技术的进步。",
      "title": "银行留着我们的钱，从他们身上赚更多的钱，哦，如果我们不保持最低余额，还要向我们收取额外的费用！这太荒谬了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Crypto是改變銀行這種做法的方法。目前，加密貨幣不會完全\n暫時不會完全取代法定貨幣，但在所有這些關於廣泛採用加密貨幣的新聞之後\n我相信加密貨幣有一天會取代法幣（不是完全取代，而是在一定程度上取代）。\n但在一定程度上），特別是隨着技術的進步。",
      "title": "銀行留着我們的錢，從他們身上賺更多的錢，哦，如果我們不保持最低餘額，還要向我們收取額外的費用！這太荒謬了。"
    }
  ]
}