{
  "author": "fora_bozoladrao",
  "the_new_excerpt": "Hello guys!\n\nFirst of all, *sorry for my english* it’s not my native language.\n\nToday is a big day for me. I just sold all of my crypto to pay lawyers and\npaperwork to get my italian citizenship.\n\nLast year I made two goals (my moons), first one was the prices of everything\nrelated to…",
  "original_created_utc": 1617543752,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好！首先，*对不起，我的英语*不是我的母语。\n\n首先，*对不起我的英语*它不是我的母语。\n\n今天对我来说是个大日子。我刚刚卖掉了我所有的加密货币来支付律师和\n办理意大利公民身份的文件。\n\n去年，我制定了两个目标（我的月亮），首先是所有东西的价格。\n与...",
      "title": "今天卖掉了我的加密货币来支付我的意大利公民身份"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好！首先，*對不起，我的英語*不是我的母語。\n\n首先，*對不起我的英語*它不是我的母語。\n\n今天對我來說是個大日子。我剛剛賣掉了我所有的加密貨幣來支付律師和\n辦理意大利公民身份的文件。\n\n去年，我制定了兩個目標（我的月亮），首先是所有東西的價格。\n與...",
      "title": "今天賣掉了我的加密貨幣來支付我的意大利公民身份"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "皆さん、こんにちは。\n\nまず最初に、*英語でごめんなさい*それは私の母国語ではありません。\n\n今日は私にとって大切な日です。イタリアの市民権を得るための弁護士や書類作成の費用を払うために、手持ちの暗号を全部売ったんだ。\nイタリアの市民権を得るための書類作成のために。\n\n去年、私は2つの目標を立てました（私の月）最初の目標は、すべての関連する価格の\n関連した...",
      "title": "今日、イタリアの市民権を得るために暗号を売却しました。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nまず最初に、*英語でごめんなさい*それは私の母国語ではありません。\n\n今日は私にとって大切な日です。イタリアの市民権を得るための弁護士や書類作成の費用を払うために、手持ちの暗号を全部売ったんだ。\nイタリアの市民権を得るための書類作成のために。\n\n去年、私は2つの目標を立てました（私の月）最初の目標は、すべての関連する価格の\n関連した...",
      "title": "今日、イタリアの市民権を得るために暗号を売却しました。"
    }
  ],
  "title": "Sold my crypto today to pay for my italian citizenship",
  "created_utc": 1617550227,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello guys!</p>\n\n<p>First of all, *sorry for my english* it’s not my native language.</p>\n\n<p>Today is a big day for me. I just sold all of my crypto to pay lawyers and paperwork to get my italian citizenship.</p>\n\n<p>Last year I made two goals (my moons), first one was the prices of everything related to paperwork/lawyers etc and the second was the ticket and life in Italy for at least 3 months while I wait for the citizenship to get a job.</p>\n\n<p>Today I hit my first one.</p>\n\n<p>I was saving money and last year I started saving it on crypto as well and today was the day that I finally got enough to pay all the paperwork/lawyers fees/translations.</p>\n\n<p>I will start saving again from next month on because after the paperwork is done I need to go to Italy to start the process of the citizenship there and of course, crypto is the future!</p>\n\n<p>I’m in Argentina but my great-grandfather came from Italy, so by blood and proving it I have the right to get the citizenship. It’s a long and expensive process but worth it. I don’t know what to expect when I get to Europe but I hope it will be better than here and more opportunities to succeed. </p>\n\n<p>100 years ago he came looking for a better life, now it’s my turn.</p>\n\n<p>Anyways, just wanted to write this here because reddit was really important to me and I want to thank all of you, even tho I am not present writing stuff all the time I always connect to read your stories and advices, grazie a tutti!</p>\n</div><!-- SC_ON -->",
  "score": 3934,
  "permalink": "/r/Bitcoin/comments/mjwhag/sold_my_crypto_today_to_pay_for_my_italian/",
  "subreddit": "Bitcoin",
  "id": "mjwhag",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961873795
}