{
  "author": "Cussi2021",
  "original_created_utc": 1651696970,
  "title": "Forked over 380,000 BTC to to the US government to reduce sentence from 40 to 10 years",
  "created_utc": 1651732703,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;By 2013, Slomp had made 380,000 Bitcoin, valued at €3 million (£2.6 million) at the time. According to court documents, he sold about 104 kilograms of MDMA, 566,000 ecstasy pills, four kilograms of cocaine and “substantial quantities” of amphetamine, LSD, weed, ketamine and Xanax on the dark web website &amp;quot;Silk Road&amp;quot;. He was sentenced to 40 years in prison, but got a reduction after handing over his Bitcoin stash. People often remind him they could be worth billions now, but he always thought his freedom was more important. “What’s the use of having a few hundred million euros if you’re in prison?” he said.&lt;/p&gt;\n\n&lt;p&gt;BTC current price 39,800 x 380,000 = 15.1 billion &lt;/p&gt;\n\n&lt;p&gt;Couple of questions here...&lt;/p&gt;\n\n&lt;p&gt;What does the US do with that BTC?\nAnd would you sacrifice 30 years for 15 billion?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/Bitcoin/comments/uig3b6/forked_over_380000_btc_to_to_the_us_government_to/",
  "subreddit": "Bitcoin",
  "id": "uig3b6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "By 2013, Slomp had made 380,000 Bitcoin, valued at €3 million (£2.6 million) at\nthe time. According to court documents, he sold about 104 kilograms of MDMA,\n566,000 ecstasy pills, four kilograms of cocaine and “substantial quantities” of\namphetamine, LSD, weed, ketamine and Xanax on the dark web…",
  "localize": [
    {
      "locale": "ja",
      "title": "米国政府に38万BTCを送金し、40年から10年への減刑を要求",
      "the_new_excerpt": "2013年までにSlompは38万ビットコインを作り、当時300万ユーロ（260万ポンド）に相当した。\nを稼いでいた。裁判資料によると、彼は約104キログラムのMDMAを販売した。\n56万6000錠のエクスタシー、4キログラムのコカイン、そして「相当量の」アンフェタミン、LSDを販売した。\nアンフェタミン、LSD、マリファナ、ケタミン、ザナックスなどをダークウェブで販売していた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "到2013年，Slomp已经赚了38万个比特币，当时的价值为300万欧元（260万英镑）。\n当时的价值为300万欧元（260万英镑）。根据法庭文件，他出售了大约104公斤的摇头丸。\n566,000粒摇头丸，4公斤可卡因和 \"大量 \"安非他明、迷幻药。\n安非他明、迷幻药、大麻、氯胺酮和安乐死在暗网上。",
      "title": "向美国政府支付380,000 BTC，将刑期从40年减至10年。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "到2013年，Slomp已經賺了38萬個比特幣，當時的價值爲300萬歐元（260萬英鎊）。\n當時的價值爲300萬歐元（260萬英鎊）。根據法庭文件，他出售了大約104公斤的搖頭丸。\n566,000粒搖頭丸，4公斤可卡因和 \"大量 \"安非他明、迷幻藥。\n安非他明、迷幻藥、大麻、氯胺酮和安樂死在暗網上。",
      "title": "向美國政府支付380,000 BTC，將刑期從40年減至10年。"
    }
  ]
}