{
  "author": "dirtmother",
  "the_new_excerpt": "This has been a ... Surprisingly hard question to google, at least for me,\nunskilled in the way of google-fu. First thing that came up said that the whale\nhad to be chained on the right side of the boat but... How do you get chains\naround a whale? And how does that prevent them from diving? And why…",
  "original_created_utc": 1617953253,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、今までの... 意外とググるのが難しい質問ですね、少なくとも私にとっては。\nググるのは意外と難しい。最初に出てきたのは、クジラは\n船の右側に鎖をつけなければならないとありましたが どうやって鯨に鎖をつけるの？\nどうやってクジラに鎖をつけるの？そして、どうやってクジラが潜るのを防ぐのか？そして、なぜ...",
      "title": "捕鯨船はどうやってクジラが潜らないようにしていたのでしょうか？船全体を沈めることはできなかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这已经是一个... 出乎意料的是，至少对我来说，谷歌的问题很难。\n不熟练的google福的方式。第一件事是说，鲸鱼\n必须用铁链拴在船的右边，但是... ... 你怎么得到链子\n在鲸鱼周围？这又是如何阻止它们潜水的呢？又为什么...",
      "title": "捕鲸人是怎么让鲸鱼不潜水的？难道他们不能把整条船都拿下来吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這已經是一個... 出乎意料的是，至少對我來說，谷歌的問題很難。\n不熟練的google福的方式。第一件事是說，鯨魚\n必須用鐵鏈拴在船的右邊，但是... ... 你怎麼得到鏈子\n在鯨魚周圍？這又是如何阻止它們潛水的呢？又爲什麼...",
      "title": "捕鯨人是怎麼讓鯨魚不潛水的？難道他們不能把整條船都拿下來嗎？"
    }
  ],
  "title": "How did whalers keep whales from diving? Couldn't they just take the whole boat down?",
  "created_utc": 1617983635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This has been a ... Surprisingly hard question to google, at least for me, unskilled in the way of google-fu. First thing that came up said that the whale had to be chained on the right side of the boat but... How do you get chains around a whale? And how does that prevent them from diving? And why the right side? It just creates more questions than answers, especially when you realize that people were doing this in prehistoric times with canoes. What is the secret? Or am I just seriously overestimating the size, intelligence, and strength of a whale?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/mnc02q/how_did_whalers_keep_whales_from_diving_couldnt/",
  "subreddit": "AskHistorians",
  "id": "mnc02q",
  "is_self": true,
  "media": null,
  "is_video": false
}