{
  "author": "Chad_deeds",
  "original_created_utc": 1633048474,
  "title": "Why arent prisons more self sustainable so taxes dont go towards them?",
  "created_utc": 1633073220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw a black mirror episode where there were people who biked all day and gave electricity to the rest of the country and i was thinking. Why dont prisoners who are serving life anyways not contributing anything but get to live with food and shelter with our tax money</p>\n\n<p>Edit: please dont take this so seriously i have no experience with prisons . Never been to a prison. Know nothing about expenses . So please if youre gonna come tell me im dumb go for it but im done explaining that this was just a silly question and didnt expect a wave of hatred towards me . I love the comments that inform me so i can learn something about this stuff</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/pywouz/why_arent_prisons_more_self_sustainable_so_taxes/",
  "subreddit": "TooAfraidToAsk",
  "id": "pywouz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I saw a black mirror episode where there were people who biked all day and gave\nelectricity to the rest of the country and i was thinking. Why dont prisoners\nwho are serving life anyways not contributing anything but get to live with food\nand shelter with our tax money\n\nEdit: please dont take this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブラックミラーのエピソードで、一日中自転車に乗っていて、国中に電気を供給している人がいました。\n国中に電気を供給している人たちがいました。なぜ囚人たちは\n終身刑の囚人は何の貢献もしていないのに、私たちの税金で食べ物やシェルターに囲まれた生活をすることができます。\n私たちの税金で衣食住を提供することはできないのでしょうか？\n\n編集：これを取らないでください...。",
      "title": "なぜ刑務所は、税金を使わずに自立できるようになっているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看了一集《黑镜》，其中有一些人整天骑自行车，给其他国家供电。\n我在想。为什么囚犯不\n囚犯在服刑期间不做任何贡献，却能用我们的税款获得食物和住所。\n用我们的税款支付住房。\n\n编辑：请不要把这个...",
      "title": "为什么监狱不能更多地自我维持，以便税收不用于它们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看了一集《黑鏡》，其中有一些人整天騎自行車，給其他國家供電。\n我在想。爲什麼囚犯不\n囚犯在服刑期間不做任何貢獻，卻能用我們的稅款獲得食物和住所。\n用我們的稅款支付住房。\n\n編輯：請不要把這個...",
      "title": "爲什麼監獄不能更多地自我維持，以便稅收不用於它們？"
    }
  ]
}