{
  "author": "roymustang261",
  "original_created_utc": 1632499618,
  "title": "The prices may go up or down - Crypto Expert",
  "created_utc": 1632533646,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello, I&#39;m a crypto expert and I&#39;ve been trading Bitcoin since 2004. I know a lot of you are new and some of you kids might be wondering what&#39;s going to happen next, so let me tell you that the prices will definitely go up or down for the next few years. The chart will go to the right. The whales don&#39;t want you to know this but I&#39;m here to help you out. If you don&#39;t know when to buy any coin, just buy at any price between $0 - $500,000,000,000. I know it seems complicated but in 17 years you will learn how to be a successful investor too, trust me I&#39;m an expert in quantitative crypto charting sigma analysis. Financial Advice. Don&#39;t Do Your Own Research</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/pumwqi/the_prices_may_go_up_or_down_crypto_expert/",
  "subreddit": "CryptoCurrency",
  "id": "pumwqi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello, I'm a crypto expert and I've been trading Bitcoin since 2004. I know a\nlot of you are new and some of you kids might be wondering what's going to\nhappen next, so let me tell you that the prices will definitely go up or down\nfor the next few years. The chart will go to the right. The whales…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私は暗号の専門家で、2004年からビットコインを取引しています。皆さんの中には\n皆さんの多くは初心者で、子供たちの中にはこれから何が起こるのかと思っている人もいるでしょう。\n今後数年間、価格は確実に上下することをお伝えしておきます。\nこれからの数年間、価格は間違いなく上がるか下がるかのどちらかです。チャートは右の方に行きます。クジラは...",
      "title": "価格は上がるか下がるか - Crypto Expert"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我是一名加密货币专家，我从2004年就开始交易比特币。我知道\n我知道你们中的很多人都是新手，你们中的一些孩子可能想知道接下来会发生什么。\n接下来会发生什么，所以让我告诉你们，价格肯定会上升或下降\n在接下来的几年里。图表会向右走。鲸鱼...",
      "title": "价格可能会上升或下降--加密货币专家"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我是一名加密貨幣專家，我從2004年就開始交易比特幣。我知道\n我知道你們中的很多人都是新手，你們中的一些孩子可能想知道接下來會發生什麼。\n接下來會發生什麼，所以讓我告訴你們，價格肯定會上升或下降\n在接下來的幾年裏。圖表會向右走。鯨魚...",
      "title": "價格可能會上升或下降--加密貨幣專家"
    }
  ]
}