{
  "author": "CentripetalFarce",
  "original_created_utc": 1657454825,
  "title": "Did people really just say and do anything in front of their servants?",
  "created_utc": 1657467509,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m watching a terrible upstairs/downstairs historical drama (I have covid, give me a break) and the fancy people are always airing their metaphorical dirty laundry  or talking shit about all the other fancy people while the servants just stand there. The servants may have their own dramas but what they don&amp;#39;t do is go across the street to Mrs. Fancy&amp;#39;s house to tell their friends who work for Mrs. Fancy that Mrs. Snooty called Mrs. Fancy a ho and said her dress looked cheap and oh yeah Mr. Snooty pees in the parlour palm when he comes home drunk and he has a big gambling debt and a sidepiece and he and Mrs. Snooty have been fighting about it. Or whatever.&lt;/p&gt;\n\n&lt;p&gt;Like I get that if you got caught gossiping about your employer you&amp;#39;d get fired and not have a reference which could easily lead to a life of desperate poverty, but wouldn&amp;#39;t Mrs. Snooty still have some reservations about  the risk? Or just be embarrassed to be crying about Mr. Snooty&amp;#39;s sidepiece in front of the butler? Did employers just see servants as ambulatory furniture while simultaneously servants had some insane sense of loyalty to their employers? Because that sounds crazy.&lt;/p&gt;\n\n&lt;p&gt;Are there any historical examples of servants causing trouble (or even preventing trouble) by not keeping their employer&amp;#39;s secrets?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/vvq3bo/did_people_really_just_say_and_do_anything_in/",
  "subreddit": "AskHistorians",
  "id": "vvq3bo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm watching a terrible upstairs/downstairs historical drama (I have covid, give\nme a break) and the fancy people are always airing their metaphorical dirty\nlaundry or talking shit about all the other fancy people while the servants just\nstand there. The servants may have their own dramas but what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ひどい上下の時代劇を見ている（コビドを持っているので、ギブ\nを観ているのだが、派手な連中がいつも自分の汚れた洗濯物に喩え\nの悪口を言いながら、使用人たちはただ立っているだけ。\nそこに立っている。使用人には使用人のドラマがあるのでしょうが、なんとも...。",
      "title": "人々は本当に召使の前で何でも言ったりやったりしていたのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在看一部可怕的楼上/楼下历史剧（我有covid，让我休息一下）。\n而那些花里胡哨的人总是在宣扬他们比喻性的脏东西\n而仆人们只是站在那里，他们总是在晾晒他们隐喻的脏衣服或谈论所有其他花哨的人。\n站在那里。仆人们可能有他们自己的剧情，但什么...",
      "title": "人们真的只是在他们的仆人面前说什么做什么吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在看一部可怕的樓上/樓下歷史劇（我有covid，讓我休息一下）。\n而那些花裏胡哨的人總是在宣揚他們比喻性的髒東西\n而僕人們只是站在那裏，他們總是在晾曬他們隱喻的髒衣服或談論所有其他花哨的人。\n站在那裏。僕人們可能有他們自己的劇情，但什麼...",
      "title": "人們真的只是在他們的僕人面前說什麼做什麼嗎？"
    }
  ]
}