{
  "author": "dreadful_name",
  "original_created_utc": 1632214497,
  "title": "At the turn of the century, why was the Ottoman Empire considered the sick man of Europe and not Spain/Portugal?",
  "created_utc": 1632246259,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Ottomans seemed to have much more of a say in terms of European politics and were a fairly formidable force militarily if not on the same level as France, Britain, Germany and Russia. Spain and Portugal on the other hand were nowhere near this level and had lost their empire by this point. So surely it would be fairer to give them this title.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/psewmw/at_the_turn_of_the_century_why_was_the_ottoman/",
  "subreddit": "AskHistorians",
  "id": "psewmw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Ottomans seemed to have much more of a say in terms of European politics and\nwere a fairly formidable force militarily if not on the same level as France,\nBritain, Germany and Russia. Spain and Portugal on the other hand were nowhere\nnear this level and had lost their empire by this point. So…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オスマン帝国は、ヨーロッパの政治に関して、より多くの発言力を持っていたようで\nフランス、イギリス、ドイツ、ロシアと同じレベルではないにしても、軍事的にはかなり強大な力を持っていました。\nフランス、イギリス、ドイツ、ロシアと同じレベルではないにしても、軍事的にはかなり手強い存在でした。一方、スペインとポルトガルはこのレベルには到底及ばず\n一方、スペインとポルトガルはこのレベルには遠く及ばず、この時点では帝国を失っていました。つまり...。",
      "title": "世紀に入り、なぜスペインやポルトガルではなく、オスマン帝国がヨーロッパの病人とされたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "奥斯曼人在欧洲政治方面似乎有更多的发言权，而且在军事上也是相当强大的力量。\n在军事上是一支相当强大的力量，即使与法国、英国、德国和俄国不在同一水平线上。\n英国、德国和俄国。另一方面，西班牙和葡萄牙则远未达到这一水平。\n另一方面，西班牙和葡萄牙远未达到这个水平，而且此时已经失去了他们的帝国。所以...",
      "title": "在世纪之交，为什么奥斯曼帝国被认为是欧洲的病夫而不是西班牙/葡萄牙？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "奧斯曼人在歐洲政治方面似乎有更多的發言權，而且在軍事上也是相當強大的力量。\n在軍事上是一支相當強大的力量，即使與法國、英國、德國和俄國不在同一水平線上。\n英國、德國和俄國。另一方面，西班牙和葡萄牙則遠未達到這一水平。\n另一方面，西班牙和葡萄牙遠未達到這個水平，而且此時已經失去了他們的帝國。所以...",
      "title": "在世紀之交，爲什麼奧斯曼帝國被認爲是歐洲的病夫而不是西班牙/葡萄牙？"
    }
  ]
}