{
  "author": "angryscout2",
  "original_created_utc": 1642403881,
  "title": "Why is it that meat eaters are supposed to cater to the dietary wishes of vegan/vegetarian guests but not the other way around?",
  "created_utc": 1642425770,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit:  Since a lot of people are jumping to the conclusion that I hate vegans/vegetarians let me provide a little context.&lt;/p&gt;\n\n&lt;p&gt;This question came up yesterday when my wife and I were talking about a wedding we attended several years ago.  One of the invited guests was a vegan.  She cancelled a week or so before the wedding and the couple getting married had the menu adjusted to remove the one vegan meal they had ordered to accommodate her.  In the end, this girl showed up anyway.  The question came up because this particular girl was the militant type and made it loudly known how disappointed she was that there was no vegan entree and she pitched a fit that now all she could eat were some sides.  She ended up making such a scene that the couple getting married had her escorted from the party and AFAIK their friendship with this girl ended that day.&lt;/p&gt;\n\n&lt;p&gt;TBH, I could give a shit less what you want to eat. If you come over to my place for a BBQ there will be meat.  If you are vegan and I go over to your place I would not expect meat because I expect you to give as much of a shit about my dietary choices as I do about yours.  If you come over to my place and complain about there not being any non-meat dishes then you will be asked to leave.  I will not preach at you about what to eat and I expect you to extend me the same courtesy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 140,
  "permalink": "/r/NoStupidQuestions/comments/s5xy17/why_is_it_that_meat_eaters_are_supposed_to_cater/",
  "subreddit": "NoStupidQuestions",
  "id": "s5xy17",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Edit: Since a lot of people are jumping to the conclusion that I hate\nvegans/vegetarians let me provide a little context.\n\nThis question came up yesterday when my wife and I were talking about a wedding\nwe attended several years ago. One of the invited guests was a vegan. She\ncancelled a week or so…"
}