{
  "author": "angryscout2",
  "original_created_utc": 1642403881,
  "title": "Why is it that meat eaters are supposed to cater to the dietary wishes of vegan/vegetarian guests but not the other way around?",
  "created_utc": 1642425770,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit:  Since a lot of people are jumping to the conclusion that I hate vegans/vegetarians let me provide a little context.&lt;/p&gt;\n\n&lt;p&gt;This question came up yesterday when my wife and I were talking about a wedding we attended several years ago.  One of the invited guests was a vegan.  She cancelled a week or so before the wedding and the couple getting married had the menu adjusted to remove the one vegan meal they had ordered to accommodate her.  In the end, this girl showed up anyway.  The question came up because this particular girl was the militant type and made it loudly known how disappointed she was that there was no vegan entree and she pitched a fit that now all she could eat were some sides.  She ended up making such a scene that the couple getting married had her escorted from the party and AFAIK their friendship with this girl ended that day.&lt;/p&gt;\n\n&lt;p&gt;TBH, I could give a shit less what you want to eat. If you come over to my place for a BBQ there will be meat.  If you are vegan and I go over to your place I would not expect meat because I expect you to give as much of a shit about my dietary choices as I do about yours.  If you come over to my place and complain about there not being any non-meat dishes then you will be asked to leave.  I will not preach at you about what to eat and I expect you to extend me the same courtesy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 140,
  "permalink": "/r/NoStupidQuestions/comments/s5xy17/why_is_it_that_meat_eaters_are_supposed_to_cater/",
  "subreddit": "NoStupidQuestions",
  "id": "s5xy17",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Edit: Since a lot of people are jumping to the conclusion that I hate\nvegans/vegetarians let me provide a little context.\n\nThis question came up yesterday when my wife and I were talking about a wedding\nwe attended several years ago. One of the invited guests was a vegan. She\ncancelled a week or so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：多くの人が私が嫌いだという結論に飛びつきました。\nヴィーガン/ベジタリアンの背景を少し説明させてください。\n\n昨日、妻とある結婚式の話をしていて、この質問が出ました。\n数年前、私たちが出席したときのことです。招待客の一人がヴィーガンでした。彼女は\n1週間ほど前にキャンセルしたのですが...",
      "title": "なぜ、肉食の人はヴィーガンやベジタリアンのゲストの食事の希望に応えなければならないのに、その逆はないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：由于很多人都在跳出结论说我讨厌\n素食主义者，让我提供一点背景。\n\n这个问题是昨天出现的，当时我和妻子正在谈论几年前参加的一场婚礼\n我们几年前参加的一个婚礼时，这个问题就出现了。被邀请的客人中有一位是素食者。她\n她取消了一个星期左右...",
      "title": "为什么吃肉的人应该迎合素食/荤食客人的饮食愿望，而不是反过来呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：由於很多人都在跳出結論說我討厭\n素食主義者，讓我提供一點背景。\n\n這個問題是昨天出現的，當時我和妻子正在談論幾年前參加的一場婚禮\n我們幾年前參加的一個婚禮時，這個問題就出現了。被邀請的客人中有一位是素食者。她\n她取消了一個星期左右...",
      "title": "爲什麼喫肉的人應該迎合素食/葷食客人的飲食願望，而不是反過來呢？"
    }
  ]
}