{
  "author": "Jaarloso",
  "the_new_excerpt": "As title, we got it. It's counterproductive to keep posting \"hodl\", \"don't\npanic\", \"this is normal\", \"i've been through bear market, you've seen nothing\",\n\"fuckin' breathe\".\n\nI'm not saying to ignore it, surely a lot was worried and newbies needed to be\nreassured, but spamming about it will only get…",
  "original_created_utc": 1618765632,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトル通り、手に入れました。このまま「Hodl」、「Don't panic」、「This is normal」、「I've been through bear market, I've used in the name of a soldier」などを投稿するのは逆効果です。\nパニックになるな」「これが普通だ」「私はベアマーケットを経験してきたが、お前は何も見ていない」。\n\"fuckin' breathe \"とかね。\n\n無視しろとは言いませんが、確かに多くの人が心配していましたし、初心者は安心させる必要がありました。\nしかし、この件でスパムをするのは、ただ...",
      "title": "市場が低迷するたびに、サブサイトには「パニックにならないように」という投稿が殺到します。我々はそれを得た。もう、やめてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如标题，我们得到了它。老是发 \"hodl\"，\"不要\"，会适得其反。\n恐慌\"、\"这很正常\"、\"我经历过熊市，你什么都没见过\"。\n\"该死的呼吸\"。\n\n我不是说不理它，肯定有很多人在担心，新手也需要\n放心吧，但滥发信息只会让... ...",
      "title": "每次市场下挫的时候，子都会被淹没在告诉不要恐慌的帖子里。我们知道了 现在，请停止。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如標題，我們得到了它。老是發 \"hodl\"，\"不要\"，會適得其反。\n恐慌\"、\"這很正常\"、\"我經歷過熊市，你什麼都沒見過\"。\n\"該死的呼吸\"。\n\n我不是說不理它，肯定有很多人在擔心，新手也需要\n放心吧，但濫發信息只會讓... ...",
      "title": "每次市場下挫的時候，子都會被淹沒在告訴不要恐慌的帖子裏。我們知道了 現在，請停止。"
    }
  ],
  "title": "Every time the market dips, the sub gets flooded with post telling not to panic. We got it. Now, please, stop.",
  "created_utc": 1618800437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As title, we got it. It&#39;s counterproductive to keep posting &quot;hodl&quot;, &quot;don&#39;t panic&quot;, &quot;this is normal&quot;, &quot;i&#39;ve been through bear market, you&#39;ve seen nothing&quot;, &quot;<em>fuckin&#39; breathe</em>&quot;.</p>\n\n<p>I&#39;m not saying to ignore it, surely a lot was worried and newbies needed to be reassured, but spamming about it will only get them more paranoid.\nIn addition, a few hours after the dip started, a few posts already explained pretty well what might have caused this dip.</p>\n\n<p>Oh yeah, and as always, the number of people saying this is 10 times the number of those panicking.</p>\n\n<p>I&#39;d say we had enough and can continue hodling.</p>\n\n<p>Sorry for the rant, i&#39;m nervous today and it was annoying af.\nSeems like this time was on me to follow the tradition of complaining about this on the dips.</p>\n\n<p>Edit: typo</p>\n\n<p>Edit edit: since someone didn&#39;t get my message, just wanted to specify again that <strong>i&#39;m not saying we should avoid at all these posts. Just do not spam them, we&#39;re not brainwashing the newcomers</strong></p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/mtgu3o/every_time_the_market_dips_the_sub_gets_flooded/",
  "subreddit": "CryptoCurrency",
  "id": "mtgu3o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521464
}