{
  "author": "Latespoon",
  "original_created_utc": 1644412672,
  "title": "Coinbase have stolen my Eth deposit and ignored my correspondence with them. A quick search of their support sub reveals they do this a lot and apparently they're getting away with it.",
  "created_utc": 1644421031,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I deposited ETH, from an address I have used many times, to my CB address I have used many times without issues. Deposit made on Christmas day 2021.&lt;/p&gt;\n\n&lt;p&gt;I got the usual CB email saying they&amp;#39;d received my deposit, and the tx is confirmed on etherscan.&lt;/p&gt;\n\n&lt;p&gt;The coins were never put into my portfolio.&lt;/p&gt;\n\n&lt;p&gt;I opened a support ticket, and got a vague non-answer by reply (we&amp;#39;re looking into it). It was promptly closed without explanation. I have since opened another 3 tickets which have all been met with similar vague responses, and then the tickets are closed without explanation. My requests to make a complaint have been ignored. I posted on their subreddit 2 weeks ago and got another vague response, no DMs etc.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve posted there again today but don&amp;#39;t expect much.&lt;/p&gt;\n\n&lt;p&gt;My account is not suspended etc., I am still able to transact with existing funds and deposit fiat. I tested this yesterday.&lt;/p&gt;\n\n&lt;p&gt;The funny thing is I trade high volume and had I continued using CBP, I would have paid them multiples of the value of this deposit in fees over the next 12 months. Congrats, you played yourselves.&lt;/p&gt;\n\n&lt;p&gt;I was able to live with CBP constantly going down during periods of volatility (sus AF!) but this is crossing the line.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;I am purely posting to encourage others to stay away from coinbase and CBP.&lt;/strong&gt; I am not the first person this has happened to. There are literally hundreds of posts like mine on their support sub where people have had funds vanish and the support team just ignores them.&lt;/p&gt;\n\n&lt;p&gt;Aside from this their fee structure sucks anyway. People seem think CBP is the cheapest for fees but they&amp;#39;re only the cheapest if you trade over $100k per month. I only used them because it was a quick cash onramp from my Revolut account. I&amp;#39;ll be sticking with Binance and Kraken from here on out.&lt;/p&gt;\n\n&lt;p&gt;Be careful where you leave your funds.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Lots of people doubting the legitimacy of my post which I guess is healthy skepticism. When I get home from work I will redact my personal details and edit in links to my (very one sided) correspondence with Coinbase.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 855,
  "permalink": "/r/CryptoCurrency/comments/sode68/coinbase_have_stolen_my_eth_deposit_and_ignored/",
  "subreddit": "CryptoCurrency",
  "id": "sode68",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I deposited ETH, from an address I have used many times, to my CB address I have\nused many times without issues. Deposit made on Christmas day 2021.\n\nI got the usual CB email saying they'd received my deposit, and the tx is\nconfirmed on etherscan.\n\nThe coins were never put into my portfolio.\n\nI…"
}