{
  "author": "mrfilthynasty4141",
  "the_new_excerpt": "CHEWY DUE DILLIGENCE\n\n____________________________________________________________________________________________________________\n\nREVENUE for 2020 with YOY revenue growth %\n\n\n\nOct. 31, 2020 1.78 bil 44.9%+ July 31, 2020 1.70 bil 47.31%+ April 30, 2020 1.62\nbil 46.17%+ Jan 31, 2020 1.35 bil…",
  "original_created_utc": 1616128531,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "咀嚼式消化器\n\n____________________________________________________________________________________________________________\n\n2020年收入，收入按年增长%。\n\n\n\n2020年10月31日 1.78亿元 44.9%+ 2020年7月31日 1.70亿元 47.31%+ 2020年4月30日 1.62亿元\n46.17%+ 2020年1月31日 1.35亿...",
      "title": ""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "咀嚼式消化器\n\n____________________________________________________________________________________________________________\n\n2020年收入，收入按年增長%。\n\n\n\n2020年10月31日 1.78億元 44.9%+ 2020年7月31日 1.70億元 47.31%+ 2020年4月30日 1.62億元\n46.17%+ 2020年1月31日 1.35億...",
      "title": ""
    }
  ],
  "title": "Chewy Due Diligence - I am adding more!",
  "created_utc": 1616153075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>CHEWY DUE DILLIGENCE</h1>\n\n<p>____________________________________________________________________________________________________________</p>\n\n<p><strong>REVENUE for 2020 with YOY revenue growth %</strong></p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Oct. 31, 2020</th>\n<th align=\"left\">1.78 bil</th>\n<th align=\"left\">44.9%+</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">July 31, 2020</td>\n<td align=\"left\">1.70 bil</td>\n<td align=\"left\">47.31%+</td>\n</tr>\n<tr>\n<td align=\"left\">April 30, 2020</td>\n<td align=\"left\">1.62 bil</td>\n<td align=\"left\">46.17%+</td>\n</tr>\n<tr>\n<td align=\"left\">Jan 31, 2020</td>\n<td align=\"left\">1.35 bil</td>\n<td align=\"left\">24.54%+</td>\n</tr>\n</tbody></table>\n\n<p>____________________________________________________________________________________________________________</p>\n\n<p>This past year has been one hell of a year for this retailer. The pandemic was a driving factor for the growth we saw take place this year with Chewy adding over <strong>5 million new users</strong>. They reported positive growth quarter after quarter leading up to the pandemic (they were poised for success and executed perfectly), in addition to a hopeful outlook on customer retention moving forward as a result of covid. Who wants to switch back to lugging bags of pet food around? They will also benefit from the generational &quot;trendiness&quot; of the company as they continue to grow and expand their services. </p>\n\n<p>&quot;Just order from Chewy&quot;. I remember my dad always telling me to &quot;just order from amazon&quot; whenever I wanted something I could not find in stores. He would also advocate for using the service due to their unbeatable prices. The fast delivery was but a bonus as I would have preferred to go to the store and buy my item right away (if it was something I was excited about/wanted). I guess my point here is that pet food really is not all that exciting. It is more of a necessity than a want. If Chewy can compete with in store prices, who in their right mind would go out for pet food? Just order from Chewy and forget about it right? Amazon was but a book store....</p>\n\n<h1>In the works....</h1>\n\n<p><strong>Compounding -</strong> this is service offered by Chewy&#39;s pharmacy where they customize pet medications to meet specific needs of individual pets. Some animals can only take certain medications in a liquid form or require very specific doses or formulations of a particular drug. Their pharmacy will formulate these medications to meet a vets request for a pet and can deliver said formulation for consumption. They plan to eventually offer this service directly to vets so they can offer the service to their &quot;in house&quot; patients. </p>\n\n<p><strong>Connect with a vet -</strong> pretty self explanatory but has more implications than meets the eye....once they have the ability to consolidate their customers needs into one service, hopefully their own service, I believe the revenue jump will be huge. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>- Some key figures -</strong></p>\n\n<blockquote>\n<p><strong>2.8% in net sales increase per customer ($363/customer)</strong>  </p>\n\n<p><strong>5 mil new users added in 2020 (40% increase YOY)</strong>  </p>\n\n<p><strong>25.5 gross margin (increase by 180-basis points as they spend less on customer acquisition and see an increase in brand recognition)</strong>  </p>\n\n<p><strong>Free Cash Flow positive at 32.9 mil compared to -12.8 mil the year before</strong>  </p>\n\n<p><strong>Net Cash from operating activities up to 63.4 mil from only 1.6 mil the year before</strong> </p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>Ownership is an interesting topic here. Back in 2019 Chewy was acquired by BC Partners who also owns PetSmart. They own approximately 63% of the company. BC Partners acquired Chewy as a strategic move after seeing revenues slip due to losing market share to the online retailer. Chewy is NOT a subsidiary of PetSmart or vice versa. BC Partners own each of them separately. </p>\n\n<p>Technical Analysis - consolidation in the 50-60 price range was very strong...this is where i started my position and have been tracking support and resistance for some time now familiarizing myself with the stocks movements. The price peak back in September to around 75 created a strong level for us to monitor. The 75 resistance was broken, followed by strong price action to the upside. We are now coming back down to test the 75 level for new support before pushing higher. The weekly chart is in play, using the 180/200 ma as a buy level. </p>\n\n<p>Chewy was modelled with Amazon in mind. The CEO stated that he used the 1997 letter to shareholders by Jeff Bezos to model the building of his company. This has proven to be very true as they offer 1-2 day delivery for orders over $50, prices beat out brick and mortar stores, the bonuses and discounts for signing up and sticking with them, as well as their expansion into different fields of pet care. Chewy customer service is outstanding, something not even Amazon can compete with for the time being. The personalization is second to none. Chewy also has a 1 year return window vs Amazon&#39;s 1 month window. Chewy&#39;s pharmacy is something Amazon does not have. Amazon may sell flee or tick medications, but they do not fill scripts. With purchase experience varying with Amazon from one experience to the next due to different dealings with vendors and individual sellers, the experience for the customer at Chewy is one Amazon simply can not compete with. </p>\n\n<p>We may see some minor pull back in revenues as the 2020 surge may be hard to keep up with. Will this effect the stock price in a negative way? Possibly. But i doubt it. I believe this is being priced in as we speak. The long term outlook does not change. I believe this company will continue to grow over time and will continue to increase their margins and revenues.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/investing/comments/m89ans/chewy_due_diligence_i_am_adding_more/",
  "subreddit": "investing",
  "id": "m89ans",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752818325
}