{
  "author": "Shit-Scry-Scanlan",
  "original_created_utc": 1644512783,
  "title": "If min wage isn't enough to survive on, are we moving back into slavery with the disguise of capitalism?",
  "created_utc": 1644521644,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been terrified of asking this question because I don&amp;#39;t want it to be taken the wrong way. Just know this is coming from genuine curiosity.&lt;/p&gt;\n\n&lt;p&gt;From what I learned from public schools and the internet about slavery, slaves would be given somewhere to eat and sleep. &lt;/p&gt;\n\n&lt;p&gt;I understand in some/most situations they would be multiple people shoved into one room with barely the nececities.&lt;/p&gt;\n\n&lt;p&gt;In the current US, people who make minimum wage usually cannot afford to live, have to get roommates in tiny apartments, and need government assistance. And they usually need a second/third job.&lt;/p&gt;\n\n&lt;p&gt;If the current pattern of inflation increase and wage stagnation continues, will we be in a situation where people would be better off if they were slaves back then?&lt;/p&gt;\n\n&lt;p&gt;Again, please don&amp;#39;t hate me, not trying to end up on &lt;a href=\"/r/fragilewhiteredditor\"&gt;r/fragilewhiteredditor&lt;/a&gt; just trying to understand if history is repeating itself in a way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/TooAfraidToAsk/comments/spbf4m/if_min_wage_isnt_enough_to_survive_on_are_we/",
  "subreddit": "TooAfraidToAsk",
  "id": "spbf4m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been terrified of asking this question because I don't want it to be taken\nthe wrong way. Just know this is coming from genuine curiosity.\n\nFrom what I learned from public schools and the internet about slavery, slaves\nwould be given somewhere to eat and sleep.\n\nI understand in some/most…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問をするのが怖くなったのは、そう受け取られたくないからです。\nということです。ただ、これは純粋な好奇心から来るものだと知っておいてください。\n\n私が公立学校やインターネットで奴隷制について学んだところでは、奴隷は\n食べる場所と寝る場所は確保されていたはずです。\n\n私は、いくつかの/ほとんどの...",
      "title": "最低賃金では生きていけないとしたら、資本主義を装った奴隷制に逆戻りするのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直很害怕问这个问题，因为我不希望它被认为是\n错的方式。只要知道这是出于真正的好奇心就可以了。\n\n根据我从公立学校和互联网上了解到的关于奴隶制的情况，奴隶们\n会有地方吃饭和睡觉。\n\n我知道在一些/大多数...",
      "title": "如果最低工资不足以生存，我们是否在资本主义的伪装下重新进入奴隶制？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直很害怕問這個問題，因爲我不希望它被認爲是\n錯的方式。只要知道這是出於真正的好奇心就可以了。\n\n根據我從公立學校和互聯網上了解到的關於奴隸制的情況，奴隸們\n會有地方喫飯和睡覺。\n\n我知道在一些/大多數...",
      "title": "如果最低工資不足以生存，我們是否在資本主義的僞裝下重新進入奴隸制？"
    }
  ]
}