{
  "author": "Many_Arm7466",
  "original_created_utc": 1632757641,
  "title": "If You Bought Bitcoin Instead of Alcohol in 2010 You Would have... Well if my Aunt had balls she would be my uncle",
  "created_utc": 1632778364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Does anybody else hate the articles or posts about “If you had bought Bitcoin in 2010 instead of groceries it would be worth this much at today’s price”... I feel like this type of thinking is counterproductive and just serves to rub it in our faces that we missed out on life changing wealth. </p>\n\n<p>The thing is if you looked at Bitcoin then it was a highly speculative concept with a lot of unfamiliarity and shadiness associated with it. Of course now in hindsight it’s obvious that we should have bought in. But just like anything it was a risky bet in which nobody not even Satoshi himself could have predicted what it would be today. </p>\n\n<p>So stop slapping yourself over not buying in earlier or if you did selling too early, cause there is no way you could have known it would be as big as it is today.</p>\n\n<p>If your aunt had balls she would be your uncle... but she doesn’t and she isn’t. Just like if you had bought into Bitcoin in 2010 you would be rich... but you didn’t and you’re not. And that is perfectly okay because guess what my little crayon eating Redditor... you’re still early. We see amazing projects coming up and Crypto and Bitcoin are not even remotely near their potential peaks </p>\n\n<p>So stop thinking about all the boats you have missed and start thinking about the next boat you will hope on that will bring you life changing gains. </p>\n\n<p>Anyways thanks for attending my Ted talk of why your aunt can’t be your uncle.</p>\n</div><!-- SC_ON -->",
  "score": 225,
  "permalink": "/r/CryptoCurrency/comments/pwjvo5/if_you_bought_bitcoin_instead_of_alcohol_in_2010/",
  "subreddit": "CryptoCurrency",
  "id": "pwjvo5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Does anybody else hate the articles or posts about “If you had bought Bitcoin in\n2010 instead of groceries it would be worth this much at today’s price”... I\nfeel like this type of thinking is counterproductive and just serves to rub it\nin our faces that we missed out on life changing wealth.\n\nThe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2010年に食料品の代わりにビットコインを買っていたら」という記事や投稿を嫌う人はいませんか？\n2010年に食料品の代わりにビットコインを買っていたら、今日の価格でこのくらいの価値になっていただろう」という記事や投稿を嫌う人はいますか？I\nこの種の考え方は逆効果で、人生を変えるようなチャンスを逃してしまったことを\nこのような考え方は逆効果で、人生を変えるような富を逃したと顔に書いてあるだけのような気がします。\n\nその...",
      "title": "もし2010年にアルコールの代わりにビットコインを買っていたら... もしもおばさんにボールがあったら、僕のおじさんになっていただろうね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是否有人讨厌那些关于 \"如果你在2010年买了比特币，而不是买了杂货，以今天的价格，它将值这么多 \"的文章或帖子？\n如果你在2010年买了比特币，而不是买了杂货，以今天的价格，它将值这么多钱\"...... I\n我觉得这种类型的想法是适得其反的，只是在我们的生活中抹黑\n我们错过了改变生活的财富。\n\n我觉得这种想法适得其反。",
      "title": "如果你在2010年买了比特币而不是酒精，你会有... 如果我姨妈有种，她就是我的叔叔了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是否有人討厭那些關於 \"如果你在2010年買了比特幣，而不是買了雜貨，以今天的價格，它將值這麼多 \"的文章或帖子？\n如果你在2010年買了比特幣，而不是買了雜貨，以今天的價格，它將值這麼多錢\"...... I\n我覺得這種類型的想法是適得其反的，只是在我們的生活中抹黑\n我們錯過了改變生活的財富。\n\n我覺得這種想法適得其反。",
      "title": "如果你在2010年買了比特幣而不是酒精，你會有... 如果我姨媽有種，她就是我的叔叔了"
    }
  ]
}