{
  "author": "huscarl86",
  "the_new_excerpt": "The account of Ibrahim ibn Ya'qub (a Jewish merchant from Tortosa), describes a\nvisit to Northern Europe in 965, including the city of Schleswig.\n\nIn the account he asserts ' The inhabitants worship Sirius, except for a small\nnumber of Christians'. He also refers to inhabitants making offerings 'to…",
  "original_created_utc": 1621468203,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イブラヒム・イブン・ヤクブ（トルトサのユダヤ人商人）の記述によると、965年に北欧を訪れ、シュレスヴィヒという街を訪れている。\n965年に北欧を訪れ、シュレスヴィヒを訪れたことが記されている。\n\nその中で彼は「少数のキリスト教徒を除いて、住民はシリウスを崇拝している」と主張している。\n少数のキリスト教徒を除いて、住民はシリウスを崇拝している」と述べている。また、住民が「...に」捧げ物をしていることにも言及している。",
      "title": "965年になってもシュレスヴィヒが異教徒の街だったのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Ibrahim ibn Ya'qub（一位来自托尔托萨的犹太商人）的记述描述了965年对北欧的访问，包括施莱辛格城。\n965年对北欧的访问，包括石勒苏益格城。\n\n他在记述中断言：\"居民们崇拜天狼星，除了一小部分基督徒之外。\n的基督徒外，居民都崇拜天狼星\"。他还提到居民们向\"...... \"献祭。",
      "title": "为什么石勒苏益格直到965年仍是一个异教城市？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Ibrahim ibn Ya'qub（一位來自托爾託薩的猶太商人）的記述描述了965年對北歐的訪問，包括施萊辛格城。\n965年對北歐的訪問，包括石勒蘇益格城。\n\n他在記述中斷言：\"居民們崇拜天狼星，除了一小部分基督徒之外。\n的基督徒外，居民都崇拜天狼星\"。他還提到居民們向\"...... \"獻祭。",
      "title": "爲什麼石勒蘇益格直到965年仍是一個異教城市？"
    }
  ],
  "title": "Why was Schleswig still a pagan city as late as 965?",
  "created_utc": 1621494181,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The account of Ibrahim ibn Ya&#39;qub (a Jewish merchant from Tortosa), describes a visit to Northern Europe in 965, including the city of Schleswig.</p>\n\n<p>In the account he asserts &#39; The inhabitants worship Sirius, except for a small number of Christians&#39;. He also refers to inhabitants making offerings &#39;to the gods&#39;.</p>\n\n<p>This surprised me, as my guess was that this part of Northern Germany/Danish border would have been Christianised at the end of Charlemagne&#39;s Saxon Wars in the early 800s. </p>\n\n<p>Why was the city pagan so late on? What kind of deity was Sirius? The name doesn&#39;t fit with the Saxon/Germanic patheon that we know. Is it the star Sirius? </p>\n\n<p>What do historians make of this?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ngkz9g/why_was_schleswig_still_a_pagan_city_as_late_as/",
  "subreddit": "AskHistorians",
  "id": "ngkz9g",
  "is_self": true,
  "media": null,
  "is_video": false
}