{
  "author": "DubiousTarantino",
  "original_created_utc": 1646582012,
  "title": "Is it ok to be excited to tell my therapist I was able to reach the goal we set for the week?",
  "created_utc": 1646598587,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my therapist and I have been working on my social anxiety and my ability to hold conversation with other people. The goal she set for me was to talk to at least one girl (even if I’m not attracted to them, talking to girls trip me up because the last thing I want to do is make a girl feel uncomfortable) at a social gathering; by the end of the night, I got three different numbers!! The whole time I was so happy and couldn’t wait to tell my therapist we reached the goal. Then I did a double take and thought “dude, that’s kinda weird how you want to celebrate this with your therapist…” so, it is normal to want to share your achievements with your therapist?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/t81lbg/is_it_ok_to_be_excited_to_tell_my_therapist_i_was/",
  "subreddit": "TooAfraidToAsk",
  "id": "t81lbg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So my therapist and I have been working on my social anxiety and my ability to\nhold conversation with other people. The goal she set for me was to talk to at\nleast one girl (even if I’m not attracted to them, talking to girls trip me up\nbecause the last thing I want to do is make a girl feel…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、セラピストと私は、社会不安と能力について取り組んできました。\nと会話することができます。彼女が掲げた目標は、「少なくとも1人と話すこと」でした。\n少なくとも一人の女の子（たとえ興味がなくても、女の子と話すとトリップしてしまうのです。\nなぜなら、私が最後にしたいことは、女の子を不安にさせることだからです。",
      "title": "セラピストに、その週に決めた目標を達成できたと興奮気味に伝えてもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我的治疗师和我一直在努力解决我的社交焦虑和我的能力问题。\n与他人交谈的能力。她为我设定的目标是至少与一个女孩交谈\n她为我设定的目标是至少与一个女孩交谈（即使我对她们没有吸引力，但与女孩交谈会让我绊倒。\n因为我最不想做的事情就是让一个女孩感到...",
      "title": "兴奋地告诉我的治疗师我能够达到我们为本周设定的目标，这样做可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我的治療師和我一直在努力解決我的社交焦慮和我的能力問題。\n與他人交談的能力。她爲我設定的目標是至少與一個女孩交談\n她爲我設定的目標是至少與一個女孩交談（即使我對她們沒有吸引力，但與女孩交談會讓我絆倒。\n因爲我最不想做的事情就是讓一個女孩感到...",
      "title": "興奮地告訴我的治療師我能夠達到我們爲本週設定的目標，這樣做可以嗎？"
    }
  ]
}