{
  "author": "Tiltnes",
  "original_created_utc": 1630419394,
  "title": "How to: Start compounding Crypto by Staking, Lending or Liquidity Providing!",
  "created_utc": 1630438237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Introduction:</strong> I’ve noticed many are still uncertain on what, how and where to compound their crypto. Not having time to doing research or being wary of doing something wrong many chose to let their BTC, ETH, ERC-20’s etc. sit idle in their mobile wallet.</p>\n\n<p>One of the wonders of crypto and <a href=\"https://en.wikipedia.org/wiki/Decentralized_finance\">DEFI</a>, is that you easily can beat a banks interest by many multipliers, on top for your asset gaining value! Especially interesting is easily being able to earn great interest rates for stable coins for up to 8% <a href=\"https://www.investopedia.com/terms/a/apr.asp\">APR</a> or more! If you compound your interest  e.g. weekly, the % rate of return increases and its what we call <a href=\"https://www.investopedia.com/terms/a/apy.asp\">APY</a>. An example is if you have 70% APR but compound your gains weekly, you get and APY for 100% (A nice <a href=\"https://www.omnicalculator.com/finance/apy\">APR-APY calculator</a>)</p>\n\n<p>Always examine if there are staking, or lending options for your crypto; because it almost always is. Let me show you a few examples to explore. <em>Disclaimer: Prices are per 30.08 and 31.08; I started writing this yesterday.</em></p>\n\n<h1>Staking and Earning:</h1>\n\n<p><strong>1) Staking with your own private crypto wallet</strong>(<em>reminder: always use hardware-wallet if possible like</em> <a href=\"https://www.ledger.com/\"><em>Ledger</em></a> <em>or</em> <a href=\"https://trezor.io/\"><em>Trezor</em></a> <em>for security)</em>. By staking your coin or tokens on your protocol of choice: You typically contribute to the security of the chain by validating blocks (like ETH, SOL and MATIC). Usually you have  delegate to validator such as on (ADA or FTM), or just let it sit in your wallet (ALGO).  In DEFI-projects, typically help vote on governmental proposals and/or earn percentages of the revenue (AAVE, SUSHI, Pancakeswap, YFI, 1Inch etc.). Typically you get a lock-up period, but this varies. Examples are of popular &quot;stakable&quot; crypto and APR  are:</p>\n\n<ul>\n<li><strong>Polkadot</strong> 13.4%</li>\n<li><strong>CRO</strong> 12%</li>\n<li><strong>MATIC</strong> 11%</li>\n<li><strong>AVAX</strong> 9.68%</li>\n<li><strong>FTM</strong> 9.64%</li>\n<li><strong>SOL</strong> 6.27%</li>\n<li><strong>ADA</strong> 6.24%</li>\n<li><strong>ETH</strong> 5.62% (wait until you can join staking pools or use 3rd party – see below)</li>\n<li><strong>ALGO</strong> 5.5%</li>\n<li><strong>AAVE</strong> 4.61%</li>\n</ul>\n\n<p><strong>2) Staking or “Earning” via. Centralized 3rd party/client:</strong> By letting the platform hold or lock-up your crypto, they give you rewards. The mechanism here varies. Often you get great rates, and insurance, however you are no NOT in charge of your coins should something happen like regulation! Examples are:</p>\n\n<ul>\n<li><strong>Staking for you:</strong> Example is Ethereum since it ATM is complex to stake by yourself, platforms such as <a href=\"https://stake.lido.fi/\">Lido</a> (stake via ledger), <a href=\"https://www.binance.com/en/eth2\">Binance</a> and <a href=\"https://help.coinbase.com/en/coinbase/trading-and-funding/staking-rewards/eth-2-0-staking\">Coinbase</a> provides staking options (Careful, your funds will typically be locked until Eth 2.0 launch). Soon Staking-pools (<a href=\"https://www.rocketpool.net/\">Rocketpool</a>) will go live, making staking a lot more easy.</li>\n<li><strong>“Earn”:</strong> Platform’s and Wallet providers such as <strong>Celsius, Crypto.com, NEXO</strong> and <strong>BlockFi</strong> acts like a crypto bank, where you hold your crypto in their wallet, while they make money lending it out. Examples are:</li>\n<li><a href=\"https://celsius.network/rates/\">Celsius</a> APY (<strong>8.8% on stable coin</strong>s like USDC or DAI, and variable rates on a great selection crypto like <strong>BTC 6.2%, ETH 5.35%</strong>, MATIC 10.5%, AAVE 4.86% and UNI 2.5%).</li>\n<li><a href=\"https://nexo.io/earn-crypto\">NEXO</a> APY (<strong>10% on stable coins</strong> like USDC or DAI, <strong>and up to 8%</strong> on other crypto such as <strong>BTC, ETH,</strong> LINK and XRP but fewer options than Celsius).</li>\n<li><a href=\"https://crypto.com/eea/earn\">Crypto.com</a> APY (10% stable coins. BTC 4,5% and Eth 5,5%. If you hold CRO the rewards can be increased)</li>\n</ul>\n\n<h1>Decentralized Lending:</h1>\n\n<p>Decentralized protocols like <a href=\"https://app.aave.com/\">AAVE</a>, <a href=\"https://app.compound.finance/\">Compound</a> (COMP) and many others on different chains give you the possibility to join a decentralized bank, where you can use your own web3 wallet (<a href=\"https://metamask.io/\">Metamask</a>, <a href=\"https://trustwallet.com/\">Trustwallet</a>, Coinbase wallet etc.) to lend/deposit your crypto via battle-testet smart contracts. I personally access my funds via Metamask in my browser, and sign transaction on my hardware wallet Ledger.  The only risk here is if the smart contract gets hacked. Oh, and when you deposit your crypto, it can work as a collateral where you can borrow other crypto or more of the same crypto, that you can trade or deposit again to earn interest on the borrowed crypto.</p>\n\n<ul>\n<li><strong>Aave</strong> current APY on following assets (On ETH Mainnet, other rates on Polygon and soon Harmony): DAI 6.95%, USDC 7.5%, <strong>ETH 0.38%, wBTC 0.96% etc</strong>.</li>\n<li><strong>Compound</strong> current APY on following assets: 2.7%, USDC 3.29%, <strong>ETH 0,13%, wBTC 0.45%</strong> and AAVE 0.4% etc.</li>\n</ul>\n\n<p>Interestingly there are protocols like <a href=\"https://yearn.finance/vaults\">Yearn.finance</a> (YFI), where you deposit your crypto or LP-tokes (see below) into a “vault” smart contract where it through complex algorithms tries to find the best rates through various DEFI platforms for you.</p>\n\n<ul>\n<li>Current APY on Yearn: DAI 5.18%, USDC 6.41%, <strong>ETH 1.08%, wBTC 3,45%</strong> and AAVE 34.96%. There are many choices here and more to come here.</li>\n</ul>\n\n<h1>Liquidity providing (LP) and “farming” with LP-tokens:</h1>\n\n<p>The one with <strong>highest yields</strong>, but also <strong><em>highest RISK!</em></strong> Here you <a href=\"https://academy.binance.com/en/articles/what-are-liquidity-pools-in-defi\">provide liquidity</a>, typically by depositing a pair like e.g. ETH and USDC to a “Pool” (smart contract) that will be traded upon by the users. Here are many options, but the most know being e.g. UniSwap (UNI) Curve (CRV), Sushiswap (SUSHI). Where Curve and Sushiswap also have integrated other blockchains than ETH, such as Polygon, Fantom, Harmony, BSC etc. You in return receive LP-tokes (Liquidity Provider).</p>\n\n<ul>\n<li>You earn percentages of the trading fees on the pair on the platform. exchanges has “Farming options” where you can deposit the LP-tokens to receive additional rewards, such as Sushiswap.</li>\n<li>LP provides new forms of risk besides hack of smart contract, such as <a href=\"https://academy.binance.com/en/articles/impermanent-loss-explained\">Impermanent Loss</a> (You REALLY need to understand this first!) if your pair has high volatility and “Rug-pulls” (cool <a href=\"https://rugdoc.io/\">list</a>) from sketchy exchanges exiting or scamming with the liquidity.</li>\n<li>Here is potential for insane farming APY’s on new exchanges on the growing “Alt-coin” chains, that offers these rates in order to draw the much needed liquidity from other exchanges and competing blockchains in order to grow, and provide low price slippage to its customers.</li>\n<li>“Yield Farming” on the new protocols has since it’s introduction been one of the hottest trends in DEFI.</li>\n<li>Ethereum being congested causing high gas fees, has drawn many Yield farmers to other growing chains like Polygon, BSC, Fantom, Harmony, lately Solana and AVAX.</li>\n</ul>\n\n<p>Examples of front-running DEXes (there so many more on the different chains) with Farms on these chains are:</p>\n\n<ol>\n<li>Polygon’s <a href=\"https://quickswap.exchange/#/quick\">Quickswap</a> (QUICK) APY: ETH-USD 35%, wBTC-USDC 30%, MATIC-USDC 68%, ETH-BTC 9%, AAVE-ETH 13%, LINK-ETH 17%, QUICK-MATIC 40%, ETH- MATIC 24%.</li>\n<li>BSC’s <a href=\"https://pancakeswap.finance/farms\">Pancakeswap</a> (CAKE) APY:  BTCB-ETH 7.4%, BTCB-BUSD 20%, ETH-USDC 14,8%, BNB-ETH 13.4%, CAKE-BNB 37%, CAKE-USDT 49% etc.</li>\n<li>Solana’s <a href=\"https://raydium.io/farms/\">Raydium</a> (RAY) APY: RAY-pairs high with RAY-ETH 124%, RAY-SOL 92%, RAY-USDT 143%, RAY-SRM 99%.</li>\n<li>Fantom’s <a href=\"https://spookyswap.finance/farms\">Spookyswap</a> (BOO) and <a href=\"https://app.spiritswap.finance/#/farms\">Spiritswap</a> (SPIRIT): FTM-USDC 392%, ETH-FTM 138%, BTC-FTM 114%, BNB-FTM 161%, SUSHI-FTM 150%, LINK-FTM 143%, YFI-FTM 162%, FTM-AAVE 114% etc.</li>\n<li>Harmony’s <a href=\"https://viperswap.one/#/staking/pools\">Viperswap</a> (VIPER) APY (<em>Though Sushi-swap is the biggest here</em>): ONE-BTC 76%, ONE-ETH 26%, ONE-1USDC 138%, BNB-VIPER 675%, LINK-VIPER 216% etc.</li>\n<li>AVAX’ <a href=\"https://app.pangolin.exchange/#/png/1\">Pangolin</a>(PNG): AVAX-PNG 68%, AVAX-wETH 116%, AVAX USDT 260%, AVAX-LINK 60%, PNG-ETH 75%, PNG-LINK 33% and more.</li>\n</ol>\n\n<p>There are literally hundreds of different “Farming pairs” on these exchanges, and many shady or up-and-coming exchanges on these chains.  Be careful, as many of the token pairs are hardcore “shitcoins” money-grabs and probable scam that can offer e.g. &gt;300% APR. Often if it’s too good to be true, it most likely is! I recommend staying to only known crypto pairs you trust and DYOR before trying to ride the wild horse of price dumps, exit scams and bad tokenomics, like the millions lost in the TITAN “bank run”. However, the DEFI-pro’s find the gems (both pairs and exchanges) with high APR and move around chains and exchanges when the APR falls or price pumps for maximize gains. Their path they keep a secret, as most gains are when you are early.</p>\n\n<h1>Ending:</h1>\n\n<p>Now that you got an idea, go out and explore your options. Don’t spoil this opportunity to earn interest and compound your crypto while these wild rates exist in order to draw users to their platforms while this space is new. Congratulations, you made it thought!</p>\n\n<p>What is your favorite place to stake, earn, lend or liquidity farm?</p>\n\n<p><strong><em>EDIT 1:</em></strong> It seems this is controversial! 40% downvotes lol. Reddit Fam, you need to stake it to make it. Let your digital gold grow with interest over years, it will be an incredibly powerful tool in 5-10 years from now.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/pf6qq7/how_to_start_compounding_crypto_by_staking/",
  "subreddit": "CryptoCurrency",
  "id": "pf6qq7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Introduction: I’ve noticed many are still uncertain on what, how and where to\ncompound their crypto. Not having time to doing research or being wary of doing\nsomething wrong many chose to let their BTC, ETH, ERC-20’s etc. sit idle in\ntheir mobile wallet.\n\nOne of the wonders of crypto and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はじめに 多くの人が、自分の暗号を何に、どのように、どこで合成すればいいのか、まだわからないでいることに気づきました。\n迷っている人が多いようです。研究する時間がなかったり、何か間違ったことをするのではないかと警戒したりして\n多くの人がBTC、ETH、ERC-20などをモバイルウォレットに放置しています。\nモバイルウォレットの中で眠っているのです。\n\n暗号の不思議の一つは、...",
      "title": "ハウツー ステーキング、レンディング、リクイディティの提供でCryptoの複利運用を始めよう!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "导言。我注意到，许多人仍然不确定什么、如何以及在哪里复合他们的加密货币。\n复合他们的加密货币。由于没有时间做研究或担心做错事\n许多人选择让他们的BTC、ETH、ERC-20等闲置在他们的手机钱包里。\n他们的手机钱包。\n\n加密货币的神奇之处在于，它可以让人们在任何时候、任何情况下都能享受到它所带来的好处。",
      "title": "如何。通过抵押、借贷或提供流动性开始复合加密货币!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "導言。我注意到，許多人仍然不確定什麼、如何以及在哪裏複合他們的加密貨幣。\n複合他們的加密貨幣。由於沒有時間做研究或擔心做錯事\n許多人選擇讓他們的BTC、ETH、ERC-20等閒置在他們的手機錢包裏。\n他們的手機錢包。\n\n加密貨幣的神奇之處在於，它可以讓人們在任何時候、任何情況下都能享受到它所帶來的好處。",
      "title": "如何。通過抵押、借貸或提供流動性開始複合加密貨幣!"
    }
  ]
}