{
  "author": "jesusvsaquaman",
  "original_created_utc": 1640520004,
  "title": "Just remember that for every 1 guy that gets insane returns from shitcoins there are 999 others that got f#*ked",
  "created_utc": 1640539858,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We always see headlines like that person who invested $8,000 in SHIB and then turned into $5 billion.&lt;/p&gt;\n\n&lt;p&gt;But people seem to fail to realize that these headlines are the exception and that usually most of the people investing in shitcoins and memecoins often don’t make any profit or even go into loss.&lt;/p&gt;\n\n&lt;p&gt;A 100x is nice but I would prefer a nice and consistent 2x.&lt;/p&gt;\n\n&lt;p&gt;I would also much rather invest in a project with actual use case like MATIC since it helps with scalability or something with actual backing BitDAO since they have a $3 billion treasury which is by far the biggest in the market.&lt;/p&gt;\n\n&lt;p&gt;Memecoins are fun. But don’t waste all your money on them. Be a little mindful.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/rovmbs/just_remember_that_for_every_1_guy_that_gets/",
  "subreddit": "CryptoCurrency",
  "id": "rovmbs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We always see headlines like that person who invested $8,000 in SHIB and then\nturned into $5 billion.\n\nBut people seem to fail to realize that these headlines are the exception and\nthat usually most of the people investing in shitcoins and memecoins often don’t\nmake any profit or even go into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SHIBに8,000ドル投資した人が、その後どうなったかというような見出しをいつも目にします。\nが50億円になった。\n\nしかし、人々はこのような見出しが例外であること、そして\nシットコインやミームコインに投資している人のほとんどは、通常、そのような投資をしていないことが多いということです。\nを、「某国」「某国」「某国」「某国」「某国」「某国」と呼びます。",
      "title": "クソコインから異常なリターンを得た人が1人いる一方で、騙された人が999人いることを忘れないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们总能看到这样的标题：有人在SHIB投资了8,000美元，然后\n变成了50亿美元。\n\n但人们似乎没有意识到，这些头条新闻是例外的，通常大多数投资狗屎币和纪念币的人都不会去投资。\n通常情况下，大多数投资粪币和纪念币的人通常不会赚到钱。\n赚取任何利润，甚至进入...",
      "title": "请记住，每有一个人从狗屎币中获得疯狂的回报，就有999人被骗。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們總能看到這樣的標題：有人在SHIB投資了8,000美元，然後\n變成了50億美元。\n\n但人們似乎沒有意識到，這些頭條新聞是例外的，通常大多數投資狗屎幣和紀念幣的人都不會去投資。\n通常情況下，大多數投資糞幣和紀念幣的人通常不會賺到錢。\n賺取任何利潤，甚至進入...",
      "title": "請記住，每有一個人從狗屎幣中獲得瘋狂的回報，就有999人被騙。"
    }
  ]
}