{
  "author": "PersonalShopper5",
  "original_created_utc": 1636636226,
  "title": "Do women really only dress up for themselves?",
  "created_utc": 1636645708,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I tried posting on askwomen, but they require  what/when/where questions. </p>\n\n<p>I always see women criticising people for saying they don&#39;t wear make up and dress up for other people, it&#39;s for themselves. But do you think that is actually true? I am a woman, and when I&#39;m sat at home on my own on a friday/Saturday night, I don&#39;t do my make up and hair, and wear a skimpy dress. If, hypothetically, I went for a drink with a girlfriend and knew we wouldn&#39;t see a single other person the whole night (like empty pubs and streets), I wouldn&#39;t dress up. But if I go on a date, or for drinks with friends, I dress up and do my make up, because I want to look nice, and it&#39;s nice to feel a bit attractive. Could you honestly say you only wear make up and dress up for yourself?</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/NoStupidQuestions/comments/qrkzbt/do_women_really_only_dress_up_for_themselves/",
  "subreddit": "NoStupidQuestions",
  "id": "qrkzbt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I tried posting on askwomen, but they require what/when/where questions.\n\nI always see women criticising people for saying they don't wear make up and\ndress up for other people, it's for themselves. But do you think that is\nactually true? I am a woman, and when I'm sat at home on my own on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "askwomenに投稿しようとしましたが、what/when/whereの質問を求められます。\n\n私はいつも、人のために化粧やおしゃれをするのではなく、自分のために化粧やおしゃれをするのだと言って人を批判する女性を見ます。\n批判している女性をよく見かけますが、それは他人のためではなく、自分のためです。と批判している女性をよく見かけますが、実際にそうだと思いますか？\n実際にそうでしょうか？私は女性ですが、家で一人で座っているときは...。",
      "title": "女性は本当に自分のためだけにおしゃれをするのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我试着在askwomen上发帖，但他们要求回答什么/什么时候/什么地方的问题。\n\n我总是看到女性批评别人说她们不化妆，不为别人打扮，是为自己。\n为别人打扮，而是为自己打扮。但你认为那是\n实际上是真的吗？我是一个女人，当我一个人坐在家里的时候，我就在...",
      "title": "女人真的只为自己打扮吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我試着在askwomen上發帖，但他們要求回答什麼/什麼時候/什麼地方的問題。\n\n我總是看到女性批評別人說她們不化妝，不爲別人打扮，是爲自己。\n爲別人打扮，而是爲自己打扮。但你認爲那是\n實際上是真的嗎？我是一個女人，當我一個人坐在家裏的時候，我就在...",
      "title": "女人真的只爲自己打扮嗎？"
    }
  ]
}