{
  "author": "mimblezimble",
  "original_created_utc": 1639102192,
  "title": "The blockchain scripting wars are over. Bitcoin has won.",
  "created_utc": 1639155598,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For years, Bitcoin has faced the competitive challenge posed by the Ethereum strategy.&lt;/p&gt;\n\n&lt;p&gt;What is the &lt;strong&gt;Ethereum strategy&lt;/strong&gt;?&lt;/p&gt;\n\n&lt;p&gt;A better (Turing complete) blockchain scripting language (such as Solidity) would lead to more innovation in smart contracts.&lt;/p&gt;\n\n&lt;p&gt;In the Ethereum strategy, smart contracts are to be implemented as blockchain scripts.&lt;/p&gt;\n\n&lt;p&gt;At the same time, we have now discovered that every &lt;strong&gt;blockchain script&lt;/strong&gt; can also be implemented as an &lt;strong&gt;off-chain scriptless script&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;This new approach is much more &lt;strong&gt;scalable&lt;/strong&gt; and respectful of the user&amp;#39;s &lt;strong&gt;privacy&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Furthermore -- and that is truly a catastrophe for the Ethereum strategy:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;While all blockchain scripts can be implemented as off-chain scriptless scripts, the other way around is not true.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Therefore, the Ethereum strategy now faces the following devastating consideration:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Off-chain scriptless scripts are vastly superior to blockchain scripts.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Extensive blockchain scripting is no longer the way to go, and &amp;quot;better blockchain scripting&amp;quot; is simply pointless. It is now effectively a legacy technology.&lt;/p&gt;\n\n&lt;p&gt;Hence, the Ethereum competitive gamble has essentially failed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/Bitcoin/comments/rcxgq1/the_blockchain_scripting_wars_are_over_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "rcxgq1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For years, Bitcoin has faced the competitive challenge posed by the Ethereum\nstrategy.\n\nWhat is the Ethereum strategy?\n\nA better (Turing complete) blockchain scripting language (such as Solidity)\nwould lead to more innovation in smart contracts.\n\nIn the Ethereum strategy, smart contracts are to be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何年もの間、ビットコインはイーサリアムがもたらす競争上の課題に直面してきました。\n戦略です。\n\nイーサリアム戦略とは？\n\nより優れた（チューリング完全な）ブロックチェーンスクリプト言語（Solidityなど）。\nは、スマートコントラクトのイノベーションをより促進することにつながる。\n\nイーサリアムの戦略では、スマートコントラクトは...",
      "title": "ブロックチェーンのスクリプト戦争は終わりました。ビットコインが勝った。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "多年来，比特币一直面临着以太坊所带来的竞争挑战\n战略。\n\n什么是以太坊战略？\n\n一个更好的（图灵完整的）区块链脚本语言（如Solidity）\n将导致智能合约的更多创新。\n\n在以太坊战略中，智能合约是要...",
      "title": "区块链的脚本战争已经结束。比特币已经赢了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多年來，比特幣一直面臨着以太坊所帶來的競爭挑戰\n戰略。\n\n什麼是以太坊戰略？\n\n一個更好的（圖靈完整的）區塊鏈腳本語言（如Solidity）\n將導致智能合約的更多創新。\n\n在以太坊戰略中，智能合約是要...",
      "title": "區塊鏈的腳本戰爭已經結束。比特幣已經贏了。"
    }
  ]
}