{
  "author": "BellybuttonFuzzer",
  "original_created_utc": 1629247081,
  "title": "Grandpa Joe might not know much, but he knows enough.",
  "created_utc": 1629293444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My father-in-law is currently shilling crypto to the rest of the family. I just got out of the shower and there were like 30 messages in a group chat. He’s going on about how it’s time to get in before crypto takes off. He said stuff about how defi is the future. He’s asking me to weigh in and of course I totally have this dude’s back. He doesn’t know much about blockchain technology, but he’s knows enough to recommend BTC, ETH, and ADA (I told the fam about ALGO and VET). He says, “now, I’m not very smart, so take this with a grain of salt…” I think he’s brilliant. His motivation? Not riches. Not lambos. Not a private island in the Caribbean (my particular motivation). Nah. He wants to pay off his kid’s student loans (we live in America) and to simply finance the educations for his grand children. I don’t know. That’s kinda cool. Just thought you guys would appreciate Grandpa Joe too.</p>\n\n<p>Edit: sorry I realize I was a tad confusing. He’s not my grandpa but my father-in-law. We all just call him grandpa Joe now that he has a couple grandkids. Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/p6geig/grandpa_joe_might_not_know_much_but_he_knows/",
  "subreddit": "CryptoCurrency",
  "id": "p6geig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My father-in-law is currently shilling crypto to the rest of the family. I just\ngot out of the shower and there were like 30 messages in a group chat. He’s\ngoing on about how it’s time to get in before crypto takes off. He said stuff\nabout how defi is the future. He’s asking me to weigh in and of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の義理の父は今、家族に暗号を教えています。私はちょうど\nシャワーから出ると、グループチャットに30件ほどメッセージが入っていました。義父は\n暗号が普及する前に参入すべきだという内容でした。彼が言うには\n未来はDefiだとか。私にも意見を求めてきて...",
      "title": "ジョーおじいちゃんは、あまり多くを知らないかもしれないが、十分に知っている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的岳父目前正在向家庭其他成员兜售加密货币。我刚刚\n我刚洗完澡，在一个群聊里有30多条信息。他在说\n他在说，现在是时候在加密货币起飞之前加入了。他说的东西\n关于defi如何成为未来。他要求我参与其中，并且...",
      "title": "乔爷爷可能知道的不多，但他知道的足够多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的岳父目前正在向家庭其他成員兜售加密貨幣。我剛剛\n我剛洗完澡，在一個羣聊裏有30多條信息。他在說\n他在說，現在是時候在加密貨幣起飛之前加入了。他說的東西\n關於defi如何成爲未來。他要求我參與其中，並且...",
      "title": "喬爺爺可能知道的不多，但他知道的足夠多。"
    }
  ]
}