{
  "author": "roymustang261",
  "original_created_utc": 1630347042,
  "title": "I bought Bitcoin in February at $48,000 and its still at $48,000. WTF. I thought this was a volatile market",
  "created_utc": 1630355981,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earlier this year I sold all my other investments to go all in on Bitcoin because I was told this is a volatile market and I won&#39;t have to wait long for good returns. I just looked at the price and its still at $48,000. That thing hasn&#39;t moved in over 6 months. Has Satoshi stopped the Bitcoin servers? WTF is going on? I guess I will go back to the stock market where we get real volatility. I once made +2.4% in the stock market in just 5 months, we sometimes get -5% drops but I guess the stock market isn&#39;t for the light hearted. Oh well what would you kids know about volatility</p>\n</div><!-- SC_ON -->",
  "score": 485,
  "permalink": "/r/CryptoCurrency/comments/pennoy/i_bought_bitcoin_in_february_at_48000_and_its/",
  "subreddit": "CryptoCurrency",
  "id": "pennoy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Earlier this year I sold all my other investments to go all in on Bitcoin\nbecause I was told this is a volatile market and I won't have to wait long for\ngood returns. I just looked at the price and its still at $48,000. That thing\nhasn't moved in over 6 months. Has Satoshi stopped the Bitcoin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年の初め、私は他の投資をすべて売却して、ビットコインに全力で取り組みました。\nというのも、この市場は変動が激しく、良いリターンを得るために長く待つ必要はないと言われたからです。\nその理由は、この市場は変動が激しく、良いリターンを得るために長く待つ必要はないと言われたからです。今、価格を見てみると、まだ48,000ドルのままです。これは\n半年以上も動いていません。サトシはビットコインを止めてしまったのか...。",
      "title": "私は2月に48,000ドルでビットコインを購入しましたが、まだ48,000ドルのままです。ワロタ。これは変動の激しい市場だと思っていたのに"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年早些时候，我卖掉了我所有的其他投资，全力投入到比特币上。\n因为有人告诉我，这是一个不稳定的市场，我不需要等很久就能得到好的回报。\n好的回报。我刚刚看了一下价格，它仍然在48,000美元。那东西\n已经6个多月没有动过了。中本聪是否已经停止了比特币的...",
      "title": "我在2月份以48,000美元的价格买入了比特币，现在它仍然在48,000美元。WTF。我以为这是个不稳定的市场"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年早些時候，我賣掉了我所有的其他投資，全力投入到比特幣上。\n因爲有人告訴我，這是一個不穩定的市場，我不需要等很久就能得到好的回報。\n好的回報。我剛剛看了一下價格，它仍然在48,000美元。那東西\n已經6個多月沒有動過了。中本聰是否已經停止了比特幣的...",
      "title": "我在2月份以48,000美元的價格買入了比特幣，現在它仍然在48,000美元。WTF。我以爲這是個不穩定的市場"
    }
  ]
}