{
  "author": "DuineDeDanann",
  "the_new_excerpt": "I've been reading a lot of Celtic and Irish folklore, and there is so MUCH\nINCEST, and a LOT of rape as well.\n\nMy question is, did the writers or the storytellers add the embellishments to\nspice up the story, or was rape and incest commonplace? or, was rape and incest\nbetween royals not considered a…",
  "original_created_utc": 1623381347,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ケルトやアイルランドの民話をよく読んでいるのですが、そこにはたくさんの\n近親相姦、そして多くのレイプもあります。\n\n疑問なのは、作家や語り部が物語のスパイスとして装飾を加えたのか、それともレイプや近親相姦は当たり前だったのかということです。\nそれとも、レイプや近親相姦は当たり前のことだったのでしょうか？ それとも、王族同士のレイプや近親相姦は、王族の間では考えられなかったのでしょうか？\n王族間のレイプや近親相姦は考えられなかったのか？",
      "title": "社会の物語は、その社会のモラルを反映しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读了很多凯尔特人和爱尔兰的民间传说，其中有很多乱伦的故事。\n乱伦，还有大量的强奸。\n\n我的问题是，作家或讲故事的人是否添加了一些修饰，以调剂故事？\n还是强奸和乱伦是司空见惯的？\n王室成员之间的强奸和乱伦不被认为是一种...",
      "title": "一个社会的故事是其道德的反映吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀了很多凱爾特人和愛爾蘭的民間傳說，其中有很多亂倫的故事。\n亂倫，還有大量的強姦。\n\n我的問題是，作家或講故事的人是否添加了一些修飾，以調劑故事？\n還是強姦和亂倫是司空見慣的？\n王室成員之間的強姦和亂倫不被認爲是一種...",
      "title": "一個社會的故事是其道德的反映嗎？"
    }
  ],
  "title": "Are the stories of a society a reflection of its morals?",
  "created_utc": 1623404000,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been reading a lot of Celtic and Irish folklore, and there is so MUCH INCEST, and a LOT of rape as well. </p>\n\n<p>My question is, did the writers or the storytellers add the embellishments to spice up the story, or was rape and incest commonplace? or, was rape and incest between royals not considered a bad thing? </p>\n\n<p>Often folklore and myths involving gods have some kind of moral message. So what are the takeaways regarding societies with common stories of mothers getting pregnant by their sons, men bedding their own daughters, and teenage kings raping their ex-wives when they find them bathing?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/AskHistorians/comments/nx5znk/are_the_stories_of_a_society_a_reflection_of_its/",
  "subreddit": "AskHistorians",
  "id": "nx5znk",
  "is_self": true,
  "media": null,
  "is_video": false
}