{
  "author": "Onebadmuthajama",
  "original_created_utc": 1640124891,
  "title": "Discussion regarding L2 scaling in ETH, and how do you guys expect it to grow the space?",
  "created_utc": 1640140328,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Right now there are lots of cryptos who are rolling out zkRollup solutions.  I will not mention any by name, since I had a post earlier mentioning some by name, and it was removed, however, I am still very interested in having an orderly discussion about how L2 scaling will grow ETH.&lt;/p&gt;\n\n&lt;p&gt;Right now there is a fairly steep barrier to entry, as we all know, especially for those who are not technologically involved, this barrier is price of gas fees, and understanding of how to stay safe.&lt;/p&gt;\n\n&lt;p&gt;There are now existing solutions that will allow users to use L2 platforms for free, without paying the gas fee to create a L1 wallet, which tells me that there is plans for the space to grow in the near-term (1-3 years) at a very fast rate compared to which the rate it&amp;#39;s grown in the past.  Along with more people being curious about crypto, and the attention that it&amp;#39;s been getting in the MSM.&lt;/p&gt;\n\n&lt;p&gt;Do you guys here think that L2 will be the catalyst required to have ETH grow into much more than it already is today, and what solutions in the space are you most excited for, and, as an enthusiast, how can I get involved in growing the L2 space, since we all know that paying a $1 gas fee is 100x better than paying a $100 gas fee, literally, and finally, what cryptos should I look into if I really want to prepare my wallet for this adoption, and invest into projects in the space?&lt;/p&gt;\n\n&lt;p&gt;I look forward to reading your responses, and discussing in the comments!  Thanks guys, -obmj&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 209,
  "permalink": "/r/CryptoCurrency/comments/rlpmuh/discussion_regarding_l2_scaling_in_eth_and_how_do/",
  "subreddit": "CryptoCurrency",
  "id": "rlpmuh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Right now there are lots of cryptos who are rolling out zkRollup solutions. I\nwill not mention any by name, since I had a post earlier mentioning some by\nname, and it was removed, however, I am still very interested in having an\norderly discussion about how L2 scaling will grow ETH.\n\nRight now…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、zkRollupのソリューションを展開しているクリプトはたくさんあります。I\n以前、いくつかの名前を挙げて投稿したことがあるので、名前を挙げることはしません。\nしかし、私は、そのような\nL2スケーリングがETHをどのように成長させるかについて、順を追って議論しています。\n\n今現在は...",
      "title": "ETHのL2スケーリングに関する議論、皆さんはそれがどのように空間を成長させると期待していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，有很多加密货币正在推出zkRollup解决方案。I\n我不会提到任何名字，因为我之前有一个帖子提到了一些名字\n但是，我仍然非常希望能有一个有序的讨论。\n有序地讨论L2扩展将如何增长ETH。\n\n现在...",
      "title": "关于ETH的L2扩展的讨论，以及你们期望它如何增长空间？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，有很多加密貨幣正在推出zkRollup解決方案。I\n我不會提到任何名字，因爲我之前有一個帖子提到了一些名字\n但是，我仍然非常希望能有一個有序的討論。\n有序地討論L2擴展將如何增長ETH。\n\n現在...",
      "title": "關於ETH的L2擴展的討論，以及你們期望它如何增長空間？"
    }
  ]
}