{
  "author": "No_Weather682",
  "original_created_utc": 1634484166,
  "title": "Most people want to get rich in crypto yet are too lazy to do minimum research",
  "created_utc": 1634502891,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously, there’s too many people that will throw a large amount of money in a coin without researching before just because some tiktoker said that it would pump. I don’t understand why people want to make <del>life</del>  wife changing money yet won’t even research what are they investing in. It’s so sad to see  a good post on this subreddit of an analysis or explanation and people in the comments only care of when or what to buy a coin.</p>\n\n<p>I get it, we all want to get rich. But how can you expect to get rich in crypto without doing MINIMUM research. Just stop asking what are some underrated altcoins, and start doing some proper research.</p>\n\n<p>DYOR, ffs.</p>\n\n<p>Edit: For those asking, I have a post that will help you to DYOR.  <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/q5bgv1/beginners_guide_to_altcoin_research/\">(Beginner’s Guide to Altcoin Research )</a></p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/qa0trw/most_people_want_to_get_rich_in_crypto_yet_are/",
  "subreddit": "CryptoCurrency",
  "id": "qa0trw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously, there’s too many people that will throw a large amount of money in a\ncoin without researching before just because some tiktoker said that it would\npump. I don’t understand why people want to make life wife changing money yet\nwon’t even research what are they investing in. It’s so sad to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真面目な話、ティクトーカーが「これは使える」と言ったからといって、ろくに調べもせずに大金を投入する人が多すぎます。\nコインに大金を投じる人が多すぎます。\nポンプ。人生を変えるような大金を稼ぎたいのに、何に投資するのか調べようとしない人がいるのは理解できません。\n自分が何に投資しているのか調べようともしない。とても悲しいことです...",
      "title": "ほとんどの人は暗号で金持ちになりたいと思っていますが、最低限の調査をするのが億劫なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，有太多的人在没有研究的情况下就把一大笔钱扔进了一个\n币而不做任何研究，只因为一些炒家说它会\n抽水。我不明白为什么人们想赚取改变生活的钱，但却\n甚至不研究他们投资的是什么。这真是太可悲了...",
      "title": "大多数人想在加密货币中致富，但却懒得做最起码的研究"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，有太多的人在沒有研究的情況下就把一大筆錢扔進了一個\n幣而不做任何研究，只因爲一些炒家說它會\n抽水。我不明白爲什麼人們想賺取改變生活的錢，但卻\n甚至不研究他們投資的是什麼。這真是太可悲了...",
      "title": "大多數人想在加密貨幣中致富，但卻懶得做最起碼的研究"
    }
  ]
}