{
  "author": "Silent_Butterfly_348",
  "original_created_utc": 1653925620,
  "title": "Boredom is the proof that life is a mistake and meaningless.",
  "created_utc": 1653966567,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I found this quote from Schopenhauer are there other philosophers who have come to the same conclusion?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“Human life must be some kind of mistake. The truth of this will be sufficiently obvious if we only remember that man is a compound of needs and necessities hard to satisfy; and that even when they are satisfied, all he obtains is a state of painlessness, where nothing remains to him but abandonment to boredom. This is direct proof that existence has no real value in itself; for what is boredom but the feeling of the emptiness of life? If life—the craving for which is the very essence of our being—were possessed of any positive intrinsic value, there would be no such thing as boredom at all: mere existence would satisfy us in itself, and we should want for nothing.” ― Arthur Schopenhauer&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/v1331n/boredom_is_the_proof_that_life_is_a_mistake_and/",
  "subreddit": "askphilosophy",
  "id": "v1331n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I found this quote from Schopenhauer are there other philosophers who have come\nto the same conclusion?\n\n> “Human life must be some kind of mistake. The truth of this will be\n> sufficiently obvious if we only remember that man is a compound of needs and\n> necessities hard to satisfy; and that even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ショーペンハウアーの言葉を見つけたのですが、同じ結論に達した哲学者は他にいますか？\n同じような結論に達した哲学者が他にいるでしょうか。\n\n> 人間の人生はある種の間違いであるに違いない。このことの真理は\n> 人間は、満足させるのが難しい欲求と必需品の複合体であることを思い出しさえすれば、この真理は十分に明らかになる。\n> を満たすのは難しい。",
      "title": "退屈は、人生が間違いであり、無意味であることの証明である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发现了叔本华的这句话，还有其他的哲学家也来过吗？\n得出同样的结论吗？\n\n> \"人类的生活必须是某种错误。这方面的真理将是\n> 只要我们记住人是一种难以满足的需求和必需品的复合体，这一点就足够明显了。\n> 必需品难以满足；而且即使是...",
      "title": "无聊是生活是一个错误和无意义的证明。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現了叔本華的這句話，還有其他的哲學家也來過嗎？\n得出同樣的結論嗎？\n\n> \"人類的生活必須是某種錯誤。這方面的真理將是\n> 只要我們記住人是一種難以滿足的需求和必需品的複合體，這一點就足夠明顯了。\n> 必需品難以滿足；而且即使是...",
      "title": "無聊是生活是一個錯誤和無意義的證明。"
    }
  ]
}