{
  "author": "thatstupidfossil",
  "original_created_utc": 1649335490,
  "title": "Why do people believe that it's hard to get out of the \"hood\"?",
  "created_utc": 1649349521,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m asking just incase I misunderstood the meaning behind &amp;quot;getting out of the hood&amp;quot;. Does it mean I have to become a wealthy millionaire or something? Cause I ain&amp;#39;t no millionaire.&lt;/p&gt;\n\n&lt;p&gt;I grew up in Compton. I&amp;#39;m also black. I grew up with people of all different races, TV shows, movies, and social media telling me about the struggles of being a poor black person in the hood, and the difficulties and challenges we face to better our lives. But when I turned 18 a few years ago, getting out was... so easy. Like there was no challenges or nothing. You couldn&amp;#39;t even make a 15 minute short film about my struggles to get out of Compton. I literally just picked a better neighborhood on Zillow, found the local panda express with a friend, got jobs there and we were out.&lt;/p&gt;\n\n&lt;p&gt;We both worked 36 hours weeks while attending the community college there, for free. A combination of $14 an hour, with financial aid checks from college, along with CalFresh EBT for students. Living in a 1 bedroom apartment with my friend was not a struggle at all. The apartment was owned by a corporation or something, all the forms were online, never even met the property manager until the day I received my keys.&lt;/p&gt;\n\n&lt;p&gt;We didn&amp;#39;t even go to a 4 year university, we just got some certificates, got jobs that barely pays $45k a year, and now we&amp;#39;re just living like normal people. There was no struggle, and as far as I can tell, there was no luck involved.&lt;/p&gt;\n\n&lt;p&gt;Where&amp;#39;s the struggle here? Am I supposed to believe I was extremely lucky? I feel like nothing I did was luck based.&lt;/p&gt;\n\n&lt;p&gt;So pretty much, my experience was, getting out of the hood was as simple as picking a new neighborhood and moving.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/tyc9rk/why_do_people_believe_that_its_hard_to_get_out_of/",
  "subreddit": "NoStupidQuestions",
  "id": "tyc9rk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm asking just incase I misunderstood the meaning behind \"getting out of the\nhood\". Does it mean I have to become a wealthy millionaire or something? Cause I\nain't no millionaire.\n\nI grew up in Compton. I'm also black. I grew up with people of all different\nraces, TV shows, movies, and social…"
}