{
  "author": "MoeNancy",
  "the_new_excerpt": "I think we all agreed about the moving of the us stock market has great impact\non the crypto market, but how about the opposite?\n\nBefore people don’t think crypto market can influence the stock a lot, but now\nthings are changing.\n\nIf we look back to what happening in the last few weeks or months, we…",
  "original_created_utc": 1614058130,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想大家都同意美国股市的走势有很大的影响。\n在加密市场上，但是反过来呢？\n\n以前人们不认为加密市场能对股票产生很大的影响，但现在呢？\n事情正在发生变化。\n\n如果我们回顾一下过去几周或几个月发生的事情，我们... ...",
      "title": "加密市场和股市之间可能会有一个反馈循环"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想大家都同意美國股市的走勢有很大的影響。\n在加密市場上，但是反過來呢？\n\n以前人們不認爲加密市場能對股票產生很大的影響，但現在呢？\n事情正在發生變化。\n\n如果我們回顧一下過去幾周或幾個月發生的事情，我們... ...",
      "title": "加密市場和股市之間可能會有一個反饋循環"
    }
  ],
  "title": "There could be a feedback loop between crypto market and the stock market",
  "created_utc": 1614079720,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think we all agreed about the moving of the us stock market has great impact on the crypto market, but how about the opposite? </p>\n\n<p>Before people don’t think crypto market can influence the stock a lot, but now things are changing. </p>\n\n<p>If we look back to what happening in the last few  weeks or months, we can clearly see the connection between stock market and the crypto market are fundamentally changed, because those crypto companies like $riot are actually in the stock market now, not only a concept sort thing. And also companies like $tsla are publicly admitted they invested in the crypto. So the moving of the crypto market will directly influenced the price of those companies and the influence the whole stock market.</p>\n\n<p>This totally changed the big picture. We can imagine, since the us stock market only opens in the the certain time, but the crypto markets is 24/7, and also the other big players Chinese and Europeans are totally in different time zone, the impact between those traders are delayed, so it’s possible making a feedback loop. Think about if a investment institution invested in $BTC a few days ago. Then the stock market start moving down. Then they have to dump some $BTC to make up the loss, then drive the crypto market down, then at night the European Chinese might consider dumping a bit to avoid the risk as the market going down. The. The next morning the institution sees the BTC going down, he might need to dump some stocks to make up the loss of the $BTC. </p>\n\n<p>So the trend might be enhanced by this loop, up or down, either way could be. And that might explain the moving of the market in the last few days and foreshadowing the future.</p>\n\n<p>This is not a investment advice, only my personal thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 81,
  "permalink": "/r/stocks/comments/lqabal/there_could_be_a_feedback_loop_between_crypto/",
  "subreddit": "stocks",
  "id": "lqabal",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332886308
}