{
  "author": "LamasInLava",
  "original_created_utc": 1660181107,
  "title": "Do you think it's possible that there are english-speaking Chinese/Russian entities, working in many secret offices, that are paid to sit behind a keyboard and comment and create posts on Reddit/Twitter/etc to increase tension, divide, discourse, etc?",
  "created_utc": 1660213755,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: thanks for the answers yall. Such an evil job, being paid for gaslighting innocent people. As much as I hate it, I&amp;#39;d rather be an innocent civilian in psychological warfare between nations. I guess psychological gaslighting is a lesser evil than actual chemical gassing in a land invasion... Crazy world.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/wlel8b/do_you_think_its_possible_that_there_are/",
  "subreddit": "NoStupidQuestions",
  "id": "wlel8b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Edit: thanks for the answers yall. Such an evil job, being paid for gaslighting\ninnocent people. As much as I hate it, I'd rather be an innocent civilian in\npsychological warfare between nations. I guess psychological gaslighting is a\nlesser evil than actual chemical gassing in a land invasion...…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：皆さん、回答ありがとうございます。ガスライティングで給料をもらうなんて、邪悪な仕事だ。\n罪のない人々をガスライティングしてお金をもらうなんて。私はそれが嫌いですが、むしろ国家間の心理戦争で罪のない一般市民でありたいと思います。\n国家間の心理戦に巻き込まれるのは嫌だけどね。心理的なガスライティングは、実際の化学兵器よりも\n陸上侵攻で実際に化学薬品を使うよりは、悪の度合いが低いのだろう......。",
      "title": "英語を話す中国/ロシアの団体が、多くの秘密のオフィスで働き、キーボードの後ろに座り、Reddit/Twitter/その他でコメントや、緊張、分裂、言論などを高めるための投稿を作成するためにお金をもらっている可能性はあると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：感谢你们的回答。这样一份邪恶的工作，为气化无辜的人而获得报酬\n无辜的人。尽管我讨厌它，但我宁愿在国家间的心理战中做一个无辜的平民。\n国家之间的心理战。我想心理上的气化是一种\n比起在土地入侵中实际的化学毒气，我想心理上的毒气是一种较小的罪恶，......。",
      "title": "你认为是否有可能有讲英语的中国/俄罗斯实体，在许多秘密办公室工作，他们受雇坐在键盘后面，在Reddit/Twitter/等网站上发表评论和创造帖子，以增加紧张局势、分裂、话语等？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：感謝你們的回答。這樣一份邪惡的工作，爲氣化無辜的人而獲得報酬\n無辜的人。儘管我討厭它，但我寧願在國家間的心理戰中做一個無辜的平民。\n國家之間的心理戰。我想心理上的氣化是一種\n比起在土地入侵中實際的化學毒氣，我想心理上的毒氣是一種較小的罪惡，......。",
      "title": "你認爲是否有可能有講英語的中國/俄羅斯實體，在許多祕密辦公室工作，他們受僱坐在鍵盤後面，在Reddit/Twitter/等網站上發表評論和創造帖子，以增加緊張局勢、分裂、話語等？"
    }
  ]
}