{
  "author": "RefugeeDutch_Syrian",
  "original_created_utc": 1646602216,
  "title": "Fantom developer and Yearn Finance founder quit, causing prices to plunge",
  "created_utc": 1646627861,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In an unexpected twist, this morning Anton Nell, developer for Fantom (FTM), and Andre Cronje, founder of decentralized finance (DeFi) projects like Yearn Finance (YFI), announced that they are quitting DeFi and indeed the cryptocurrency sector in general.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Nell reports via Twitter that as many as 25 apps and services will be terminated on April 3. These include the following crypto projects: Yearn Finance (YFI), Keep3r (KP3R), Multichain (MULTI), Chainlist (CLIST), Solidly (SOLID) and Bribe.crv.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/9y8k59l60ul81.png?width=602&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=95eb11b9084970afae84486f8f4eb25ae1f75237\"&gt;https://preview.redd.it/9y8k59l60ul81.png?width=602&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=95eb11b9084970afae84486f8f4eb25ae1f75237&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Unlike previous &amp;quot;building in defi sucks&amp;quot; rage quits, this is not a knee jerk reaction to the hate received from releasing a project, but a decision that has been coming for a while now. Thanks you to everyone that supported us over the past few years.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Thus Knell. The authenticity of the message was initially doubted, as Cronje no longer has a Twitter account. However, journalist Colin Wu reports that Cronje confirmed the news via LinkedIn. The tantrums Knell refers to are familiar to Cronje. He has threatened to resign before when things went wrong with some of his DeFi projects. Cronje had in fact launched DeFi projects a few times with the warning that they were not yet finished. Despite this, people put a lot of money into them that was then stolen when vulnerabilities were exploited by hackers.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Major damage Fantom and co the result?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Yet the community cries that &amp;quot;terminated&amp;quot; may be a misleading term. After all, not all projects are being shut down.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;To contain further damage, a number of projects have already announced that Cronje was not the only developer working on this crypto. The Fantom Foundation reports that more than 40 people are working on the Fantom platform. Also &amp;#39;Banteg&amp;#39; from Yearn Finance says that as many as 50 developers are active.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;However, this may not be true for all projects. Some apps, such as Bribe.crv, now have a welcome message on the website stating that the service will be discontinued on April 3. Also, damage control seems to be working only slightly; the prices of many of these crypto received heavy blows this morning.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;For example, YFI is down 11%, FTM 16%, KP3R 27%, MULTI 19%, CLIST 7%, and SOLID a whopping 70%. Solidly, by the way, launched less than a week ago. The hefty declines seem to be pulling even the rest of the market along.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/t88xsy/fantom_developer_and_yearn_finance_founder_quit/",
  "subreddit": "CryptoCurrency",
  "id": "t88xsy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In an unexpected twist, this morning Anton Nell, developer for Fantom (FTM), and\nAndre Cronje, founder of decentralized finance (DeFi) projects like Yearn\nFinance (YFI), announced that they are quitting DeFi and indeed the\ncryptocurrency sector in general.\n\n\n\nNell reports via Twitter that as many…"
}