{
  "author": "BabyGates_",
  "original_created_utc": 1640022040,
  "title": "My girlfriend was raped... How do we move on?",
  "created_utc": 1640038694,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was across the country on work travel when my girlfriend (Jane Doe) decided to go out to dinner with a few of her friends. When she arrived, she noticed her ex boyfriend (John Doe) was also invited and had shown up. John proceeded to get incredibly drunk and was unable to drive home. Jane wanted to be the bigger person and drive John back to his house so he wasn&amp;#39;t left stranded. They arrived at his house and she helped him get inside. From there things got heated. Their previous relationship was toxic and John insisted on touching her and getting physical. Sparing the details, Jane was raped - full vaginal sex. She did not fight back, rather just sobbed throughout and accepted what was happening to her. &lt;/p&gt;\n\n&lt;p&gt;I came back from work travel 3 days later. She tells me this story in tears driving back from the airport. This is her third rape (first one with me as her partner). Through some internet detective work, I am able to find the guys facebook and place of employment - I don&amp;#39;t know what to do with this information. I feel a mixture of guilt, livid anger, terror, and uncertainty for the future of our relationship. I don&amp;#39;t know how we are supposed to move past this as a couple and return to our normal life after this. He took away something that was supposed to be an intimate act between two loving people forced it upon her with violence - tarnishing the magic of sex. My sex drive is at an all time low just thinking about it. Jane does not want to file a report, she tried with her previous two offenders and claims it doesn&amp;#39;t do anything (she lost the restraining order hearing both times). How do I/we move past this as a couple?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/rkspoh/my_girlfriend_was_raped_how_do_we_move_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "rkspoh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was across the country on work travel when my girlfriend (Jane Doe) decided to\ngo out to dinner with a few of her friends. When she arrived, she noticed her ex\nboyfriend (John Doe) was also invited and had shown up. John proceeded to get\nincredibly drunk and was unable to drive home. Jane wanted…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は仕事の出張で国内を移動していましたが、ガールフレンド（Jane Doe）が\n友人たちと食事に出かけた。到着したとき、彼女は元彼の\n彼氏（John Doe）も招待され、姿を現していました。ジョンは\n信じられないほど酔っぱらってしまい、家まで運転することができなくなりました。ジェーンが望んだのは...",
      "title": "恋人がレイプされた...。どうすればいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在全国各地工作旅行时，我的女朋友（无名氏）决定\n与她的几个朋友出去吃饭。当她到达时，她注意到她的前任\n她注意到她的前男友（无名氏）也被邀请并出现了。约翰接着就喝得酩酊大醉\n令人难以置信的醉酒，无法开车回家。简想...",
      "title": "我的女朋友被强奸了... 我们该如何继续前进？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在全國各地工作旅行時，我的女朋友（無名氏）決定\n與她的幾個朋友出去喫飯。當她到達時，她注意到她的前任\n她注意到她的前男友（無名氏）也被邀請並出現了。約翰接着就喝得酩酊大醉\n令人難以置信的醉酒，無法開車回家。簡想...",
      "title": "我的女朋友被強姦了... 我們該如何繼續前進？"
    }
  ]
}