{
  "author": "Jew_With_A_Tattoo",
  "original_created_utc": 1643177057,
  "title": "Our children’s friends parents are swingers and they tried to make a move on us. How do we handle the situation?",
  "created_utc": 1643205927,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We have three kids. My oldest and middle child are very good friends with the swinger parent’s kids who are in the same grade. They came over last Saturday to watch football and UFC. When they party, they party hard (get pretty drunk). The wife gets very touchy feely when she is wasted. And this time around she was trying to make out with my wife, me as well as trying to rub my junk, and her husband started getting touchy feely with my wife. Told us she was bi and has had multiple threesomes. Husband didn’t care that his wife was all over me. I told them it was pretty late, and it was time to wrap up the party. We really like these people as they are fun to hang around and our kids are best friends. But they are clearly swingers and wanted to “swap” which isn’t our thing at all. This has us pretty weirded out, and we just want things to be normal. Not sure if we should pretend it didn’t happen, or let them know we like them and aren’t judgmental of their lifestyle but that isn’t our thing.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 133,
  "permalink": "/r/TooAfraidToAsk/comments/scyz8a/our_childrens_friends_parents_are_swingers_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "scyz8a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We have three kids. My oldest and middle child are very good friends with the\nswinger parent’s kids who are in the same grade. They came over last Saturday to\nwatch football and UFC. When they party, they party hard (get pretty drunk). The\nwife gets very touchy feely when she is wasted. And this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "うちには3人の子供がいます。上の子と真ん中の子は、とても仲良しの\n同じ学年のスインガーペアレントの子供たち。先週の土曜日に彼らがやってきて\nフットボールとUFCを見る。彼らはパーティーをするときは、激しくパーティーをします（かなり酔います）。その\n妻は酔っぱらうと、とても気難しくなる。そして、この...",
      "title": "子供の友達の親がスインガーで、私たちに言い寄ってきた。どうしたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们有三个孩子。我最大的孩子和中间的孩子与同年级其他家长的孩子是非常好的朋友。\n我的大女儿和二女儿与同年级的父母的孩子是非常好的朋友。他们上周六过来\n看足球和UFC。当他们开派对的时候，他们很卖力（喝得很醉）。妻子\n妻子在醉酒后会变得非常感性。而这...",
      "title": "我们孩子的朋友的父母是交换者，他们试图对我们采取行动。我们该如何处理这种情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們有三個孩子。我最大的孩子和中間的孩子與同年級其他家長的孩子是非常好的朋友。\n我的大女兒和二女兒與同年級的父母的孩子是非常好的朋友。他們上週六過來\n看足球和UFC。當他們開派對的時候，他們很賣力（喝得很醉）。妻子\n妻子在醉酒後會變得非常感性。而這...",
      "title": "我們孩子的朋友的父母是交換者，他們試圖對我們採取行動。我們該如何處理這種情況？"
    }
  ]
}