{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "Burton Malkiel\n\n**A Random Walk Down Wall Street**\n\n- 2 types of analysis\n  - Fundamental analysis or Firm Foundation Theory based on Fisher&#39;s DDM\n  - Technical analysis or Castle in the Air or greater fool&#39;s theory by Keynes\n- No one person or institution consistently knows more than the market\n- Short run changes in stock prices are unpredictable. Therefore, investment advisory services, earnings forecasts, and complicated chart patterns are useless\n- Greed run amok has been an essential feature of every spectacular boom in history\n- In their frenzy, market participants ignore firm foundations of value for the thrilling proposition that they can build castles in the air\n- Castle in the air theory can explain speculative binges after they occur, trying to outguess the reactions of a fickle crowd is a most dangerous game. Unstainable prices can persist for years but they eventually come back down\n- Sir Isaac Newton &quot;I can calculate the motions of heavenly bodies, but not the madness of people.&quot;\n- Styles and fashions in investors evaluations of securities can and often do play a critical role in the pricing of securities. The stock market at times conforms well to the castle in the air theory, for this reason, it can be very dangerous\n- Do not purchase today&#39;s hot new issue. Most IPO&#39;s are bad for retail investors. But good for underwriters\n- Most bubbles have been associated with some new technology or with some new business opportunity.\n- Bubbles are a positive feedback loop. A bubble starts when a group of stocks begin to rise. The updraft encourages more people to buy, which causes more TV/Print coverage, which causes more people to buy, which creates big profits for early investors. The successful investors talk about how easy it is to get rich, which causes more people to buy. The whole idea is a kind of Ponzi scheme needing more and more greater fools to buy. But eventually they run out of fools and the stock plummets.\n- Technical analyst looks at charts and patterns (They don&#39;t exist). They believe the market is 10% logical and 90% psychological and attempt to beat the crowd with their picks. Does not work.\n- Fundamental analyst believe that the market is 90% logical and 10% psychological. Caring little for patterns and past price movements. Fundamentalists seek to determine a stocks proper value. Value applies to assets, growth rates, earnings and dividends, interest rate, and risks. They believe that the company&#39;s price will eventually reflect its real worth\n- God Almighty does not know the proper P/E multiple for a common stock\n- The history of stock price movement contains no useful information that will enable an investor to consistently to outperform a buy and hold strategy\n- Dogs of the Dow. This short-term strategy actually did work for some time but currently doesn&#39;t. You bought the lowest 10 stocks of the Dow Jones that year based on low P/E and high Dividend Yield. Once everyone started using the strategy, it stopped working.\n- Technical analysis strategies are usually amusing, often comforting, but of no real value\n- The past history of stock prices cannot be used to predict the future in any meaningful way\n- Technical analysis enriches people marketing them, not investors\n- The idea is simple, if past prices contain little to no useful information for the prediction of future prices, there is no point in following any technical trading rule for the timing of purchases or sales. A simple policy of buying and holding will be at least as good as any technical procedure. Also, buying and selling short term generate taxable events, brokerage charges, and spreads that decrease returns\n- Security analysts are incorrect much of the time. 5 factors why\n  - Random events\n  - &quot;Creative accounting&quot; by the business\n  - Errors made by analysts themselves\n  - Loss of the best analysts to other higher paying jobs\n  - Conflicts of interest\n- Analysts&#39; recommendations are tainted by very profitable investment banking relationships\n- Brad Barber studied the performance of the &quot;strong buy&quot; recommendations and found the results were terrible\n- Stock recommendations of firms without investment banking relationships were much better according to a study by Cornell\n- Investors have done no better with the average mutual fund than they could have done by purchasing and holding a broad stock index\n- Simply buying and holding the stocks in a broad market index is a strategy that is very hard for the professional money manager to beat\n- The evidence in favor of indexing grows stronger over time. Indexing holds true for large cap, us small cap, international, emerging markets, bonds. Over 2/3 of the active managers were outperformed by their index over 5-year periods. The results also repeat over 10 or 20-year periods.\n- Index investing is SMART investing\n- Benjamin Graham, heralded as the father of fundamental security analysis came to the conclusion that security analysis could no longer be counted on to produce superior investment returns. &quot;I am no longer an advocate of elaborate techniques of security analysis in order to find superior value opportunities. Today, I doubt whether such extensive efforts will generate sufficiently superior selections to justify the cost…. I am on the side of the &quot;efficient market school of thought.&quot;\n- Efficient-market hypothesis explains why a random walk is possible. It holds that the stock market is so good at adjusting to new information that no one can predict its future course in a superior manner. Because of the action of pros, the prices of stocks quickly reflect all available information\n- One of the best documented propositions in the study of finance is that, on average, investors have received higher rates of return for bearing greater risk\n- Diversification can reduce but not eliminate portfolio risks.\n- Capital asset pricing model says that there is no premium for bearing risks that can be diversified away. Thus, to get a higher average long run rate of return, you need increase the risk level of the portfolio that cannot be diversified away.\n- Systemic Risk AKA &quot;Market Risk&quot; – arises from the basic variability of stock prices in general and the tendency for all stocks to go along with the general market, at least to some extent. Cannot be eliminated by diversification\n- Unsystematic Risk – results from factors peculiar to that specific company. IE – strikes, new products, management, etc. This can be eliminated through adequate diversification. With as few as 60 stocks.\n- Beta – relative volatility or sensitivity to market moves\n  - Numerical description of systemic risk\n  - It is a comparison between the movements of an individual stock or portfolio and the movements of the market as a whole\n  - IE – the total stock market has a Beta of 1. If a stock has a Beta of 2. It will move up or down 2x as much as the total market. +-10% change in the total market would mean a +-20% change for the stock. Beta of 0.5 would be +-5%\n- Investors will not be paid for bearing risks that can be diversified away. The is the logic behind the capital asset pricing model\n- As the systemic risk (Beta) of an individual portfolio increases, so does the return an investor can expect\n- Beta isn&#39;t the end all be all though. Fama and French did a study in 1992 that discovered that there was no relationship between returns for portfolios and their beta measures. It is not a useful single measure to capture the relationship between risk and return\n- It appears that the only way to obtain higher long-run investment returns is to accept greater risks\n- Unfortunately, a perfect risk measure doesn&#39;t exist. Beta and rate of return has not corresponded to the relationship predicted in theory. Beta can also change.\n- Behavioral Finance\n  - Investors are generally overconfident in their ability and convinced they can beat the market. A study showed that the more a person traded, the worse they did. Males traded more than females and did worse. Over optimism in forecasting the growth of existing companies could be one reason growth stocks tend to underperform value stocks.\n  - Biased Judgments – Investors tend to think they can control their investment results even though they can&#39;t.\n  - Herding – research shows that groups tend to make better decisions than individuals. But this can cause &quot;group think&quot; where individuals will reinforce one another into believing that some incorrect view is the correct one\n  - Loss aversion – A study concluded that losses were 2 ½ times as undesirable as equivalent gain were desirable\n  - Pride and Regret – Investors find it very difficult to admit that they have made a bad stock market decision. But are quite proud to tell of their gains. Many investors therefore will hold onto losing positions hoping it recovers.\n- The problem with trying to &quot;trade&quot; with these ideas is that the market can remain irrational longer than you can remain solvent.\n- What are the lessons for the individual investor on behavioral finance?\n  - In investing, we are often our own worst enemy\n  - Avoid herd behavior. Any investment that has become a topic of widespread conversation is likely to be especially hazardous. But the same behavior leads investors to throw in the towel when pessimism is rampant – a good time to buy\n  - Avoid overtrading – this incurs more taxes and trading costs which decrease returns\n  - Be wary of new issues or IPO&#39;s\n  - Stay cool to Hot Tips\n  - Never buy anything from someone who is out of breath\n  - Distrust foolproof schemes\n- High multiple growth stocks are difficult to invest in because of the danger is forecasting future earnings growth. If the growth fails to materialize, investors get hit with an earning decrease and P/E multiple decrease, a double whammy\n- Smart Beta – Maybe possible to gain excess returns by using a variety of passive investment strategies that involve no more risk than would be assumed by investing in a low-cost Total Stock Market index fund. Very difficult to do and their record has been suspect\n- There is overwhelming evidence to support small cap beating large and value beating growth stocks\n- The record of &quot;Smart Beta&quot; funds beating the market has been spotty. Especially the low volatility and momentum strategies have done very poor vs their index. The value and small tilt have done better. But be aware you are taking extra risk to get these extra returns. You can take a chance that some risk factor(tilt) will generate excess returns in the future, if the core of your portfolio consists of capitalization weighted broad based index funds.\n- Smart beta portfolios will not protect you from market bubbles\n- Exercise 1 - The most important driver in the growth of your assets is how much you save and saving requires discipline. The only reliable way to build up a nest egg is slowly and steadily. Begin a regular savings program and stick with it. Start now.\n- Exercise 2 – Remember Murphy&#39;s Law, what can go wrong will go wrong. Keep a cash reserve of at least 3 months. Get a good term life policy. And avoid variable annuities.\n- Exercise 3 – Try to keep pace with inflation on your cash reserve yield. This may include MMF, CD&#39;s, Internet Banks, T-Bills or tax exempt MMF.\n- Exercise 4 – Avoid the tax man. Save as much as you can through your tax-sheltered accounts.\n- Exercise 5 – Have clear goals. Decide what degree of risk you are willing to take\n- Exercise 6 – Buy a house. Real estate is a great inflation hedge. REIT&#39;s are a good choice to own commercial real estate\n- Exercise 7 – Invest in Bonds\n- Exercise 8 – Gold can have a place in your portfolio (5%). It is a good diversifier and is an excellent inflation hedge. Don&#39;t invest in diamonds or Collectibles. Buy diamonds and collectibles because you like them. Not as an investment. Do NOT invest in commodities futures contracts. You will get burned. Stay away from hedge funds, private equity, and venture capital funds. They are great for the managers, not for you\n- Exercise 9 – Remember the costs of investing. Keep them low.\n- Exercise 10 – Diversify your investments. It reduces risk.\n- Long-Run equity return = Initial dividend yield + growth rate. This has historically been about 5% and 5% for a total of 10%\n- Even if a company pays a small dividend today and retains most or all of its earnings to reinvest in the business, the investor assumes that such reinvestment will lead to a more rapidly growing stream of dividends in the future or more stock repurchases\n- In the short run, change in valuations can have a major role in determining returns. IE – P/E&#39;s and Dividend yields\n- P/E have varied widely. During the early 2000&#39;s with high optimism, the P/E&#39;s were about 30. During 1982 stocks sold at only a P/E of 8\n- P/E go up with lower interest rates and go down with higher interest rates because now equities have to compete with bonds\n- Long - Run returns on bonds are easy if you hold the bond to maturity. The yield that the bond investor receives is the yield to maturity of the bond at the time of purchase.\n- But if bonds are not held to maturity, then changes in interest rates take effect. Higher interest rates lower bond prices and the opposite is true.\n- In principle, common stocks should be an inflation hedge\n- In general, investors have earned a higher rate of return from the stock market when P/E was low and low rates of return when stocks were purchased at high P/E\n- 90% of return is determined by asset class chosen and percent. Less than 10% is determined by individual stock selection or manager selection\n- History shows that risk and return are related\n- Risks of investing in stock and bonds depends on length of time. Longer periods have lower variation in return\n- DCA can be useful\n- Rebalancing can reduce risk\n- You must understand your attitude and your capacity toward risk\n- The longer the time period over which you can hold on to your investments, the greater should be the share of common stocks in your portfolio\n- Rebalancing yearly reduced volatility and increased returns\n- If you job is in an area, you should probably not invest in that area too. Because if something bad happened, you would have more trouble. IE – GM employee owns lots of GM stock. If GM does bad, you would lose your job and your investment\n- Mutual Funds are better for DCA your money into the market. ETF&#39;s are better for &quot;lump sum&quot; investing\n- Don&#39;t day trade ETF&#39;s\n- If you want to buy individual stocks, Index the core portfolio and then take active bets with extra funds. That way if you miss, it won&#39;t prove fatal.\n- 3 rules for successful stock selection\n  - Confine purchases to companies that appear able to sustain above-average earnings growth for at least 5 years\n  - Never pay more for a stock than can reasonably be justified by a firm foundation of value\n    - P/E is a good place to start\n    - Beware of stocks with high P/E&#39;s\n  - Trade as little as possible\n- There is no way to beat the market consistently by purchasing the mutual funds that have performed best in the past\n- Often, one year&#39;s hot performers are next year&#39;s dogs\n- Morningstar rating system do not guarantee superior results",
  "author_fullname": "t2_6ucr2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Burton Malkiel A Random Walk Down Wall Street Summary",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_obd5nu",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.9,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 33,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 33,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1625138626,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Burton Malkiel</p>\n\n<p><strong>A Random Walk Down Wall Street</strong></p>\n\n<ul>\n<li>2 types of analysis\n\n<ul>\n<li>Fundamental analysis or Firm Foundation Theory based on Fisher&#39;s DDM</li>\n<li>Technical analysis or Castle in the Air or greater fool&#39;s theory by Keynes</li>\n</ul></li>\n<li>No one person or institution consistently knows more than the market</li>\n<li>Short run changes in stock prices are unpredictable. Therefore, investment advisory services, earnings forecasts, and complicated chart patterns are useless</li>\n<li>Greed run amok has been an essential feature of every spectacular boom in history</li>\n<li>In their frenzy, market participants ignore firm foundations of value for the thrilling proposition that they can build castles in the air</li>\n<li>Castle in the air theory can explain speculative binges after they occur, trying to outguess the reactions of a fickle crowd is a most dangerous game. Unstainable prices can persist for years but they eventually come back down</li>\n<li>Sir Isaac Newton &quot;I can calculate the motions of heavenly bodies, but not the madness of people.&quot;</li>\n<li>Styles and fashions in investors evaluations of securities can and often do play a critical role in the pricing of securities. The stock market at times conforms well to the castle in the air theory, for this reason, it can be very dangerous</li>\n<li>Do not purchase today&#39;s hot new issue. Most IPO&#39;s are bad for retail investors. But good for underwriters</li>\n<li>Most bubbles have been associated with some new technology or with some new business opportunity.</li>\n<li>Bubbles are a positive feedback loop. A bubble starts when a group of stocks begin to rise. The updraft encourages more people to buy, which causes more TV/Print coverage, which causes more people to buy, which creates big profits for early investors. The successful investors talk about how easy it is to get rich, which causes more people to buy. The whole idea is a kind of Ponzi scheme needing more and more greater fools to buy. But eventually they run out of fools and the stock plummets.</li>\n<li>Technical analyst looks at charts and patterns (They don&#39;t exist). They believe the market is 10% logical and 90% psychological and attempt to beat the crowd with their picks. Does not work.</li>\n<li>Fundamental analyst believe that the market is 90% logical and 10% psychological. Caring little for patterns and past price movements. Fundamentalists seek to determine a stocks proper value. Value applies to assets, growth rates, earnings and dividends, interest rate, and risks. They believe that the company&#39;s price will eventually reflect its real worth</li>\n<li>God Almighty does not know the proper P/E multiple for a common stock</li>\n<li>The history of stock price movement contains no useful information that will enable an investor to consistently to outperform a buy and hold strategy</li>\n<li>Dogs of the Dow. This short-term strategy actually did work for some time but currently doesn&#39;t. You bought the lowest 10 stocks of the Dow Jones that year based on low P/E and high Dividend Yield. Once everyone started using the strategy, it stopped working.</li>\n<li>Technical analysis strategies are usually amusing, often comforting, but of no real value</li>\n<li>The past history of stock prices cannot be used to predict the future in any meaningful way</li>\n<li>Technical analysis enriches people marketing them, not investors</li>\n<li>The idea is simple, if past prices contain little to no useful information for the prediction of future prices, there is no point in following any technical trading rule for the timing of purchases or sales. A simple policy of buying and holding will be at least as good as any technical procedure. Also, buying and selling short term generate taxable events, brokerage charges, and spreads that decrease returns</li>\n<li>Security analysts are incorrect much of the time. 5 factors why\n\n<ul>\n<li>Random events</li>\n<li>&quot;Creative accounting&quot; by the business</li>\n<li>Errors made by analysts themselves</li>\n<li>Loss of the best analysts to other higher paying jobs</li>\n<li>Conflicts of interest</li>\n</ul></li>\n<li>Analysts&#39; recommendations are tainted by very profitable investment banking relationships</li>\n<li>Brad Barber studied the performance of the &quot;strong buy&quot; recommendations and found the results were terrible</li>\n<li>Stock recommendations of firms without investment banking relationships were much better according to a study by Cornell</li>\n<li>Investors have done no better with the average mutual fund than they could have done by purchasing and holding a broad stock index</li>\n<li>Simply buying and holding the stocks in a broad market index is a strategy that is very hard for the professional money manager to beat</li>\n<li>The evidence in favor of indexing grows stronger over time. Indexing holds true for large cap, us small cap, international, emerging markets, bonds. Over 2/3 of the active managers were outperformed by their index over 5-year periods. The results also repeat over 10 or 20-year periods.</li>\n<li>Index investing is SMART investing</li>\n<li>Benjamin Graham, heralded as the father of fundamental security analysis came to the conclusion that security analysis could no longer be counted on to produce superior investment returns. &quot;I am no longer an advocate of elaborate techniques of security analysis in order to find superior value opportunities. Today, I doubt whether such extensive efforts will generate sufficiently superior selections to justify the cost…. I am on the side of the &quot;efficient market school of thought.&quot;</li>\n<li>Efficient-market hypothesis explains why a random walk is possible. It holds that the stock market is so good at adjusting to new information that no one can predict its future course in a superior manner. Because of the action of pros, the prices of stocks quickly reflect all available information</li>\n<li>One of the best documented propositions in the study of finance is that, on average, investors have received higher rates of return for bearing greater risk</li>\n<li>Diversification can reduce but not eliminate portfolio risks.</li>\n<li>Capital asset pricing model says that there is no premium for bearing risks that can be diversified away. Thus, to get a higher average long run rate of return, you need increase the risk level of the portfolio that cannot be diversified away.</li>\n<li>Systemic Risk AKA &quot;Market Risk&quot; – arises from the basic variability of stock prices in general and the tendency for all stocks to go along with the general market, at least to some extent. Cannot be eliminated by diversification</li>\n<li>Unsystematic Risk – results from factors peculiar to that specific company. IE – strikes, new products, management, etc. This can be eliminated through adequate diversification. With as few as 60 stocks.</li>\n<li>Beta – relative volatility or sensitivity to market moves\n\n<ul>\n<li>Numerical description of systemic risk</li>\n<li>It is a comparison between the movements of an individual stock or portfolio and the movements of the market as a whole</li>\n<li>IE – the total stock market has a Beta of 1. If a stock has a Beta of 2. It will move up or down 2x as much as the total market. +-10% change in the total market would mean a +-20% change for the stock. Beta of 0.5 would be +-5%</li>\n</ul></li>\n<li>Investors will not be paid for bearing risks that can be diversified away. The is the logic behind the capital asset pricing model</li>\n<li>As the systemic risk (Beta) of an individual portfolio increases, so does the return an investor can expect</li>\n<li>Beta isn&#39;t the end all be all though. Fama and French did a study in 1992 that discovered that there was no relationship between returns for portfolios and their beta measures. It is not a useful single measure to capture the relationship between risk and return</li>\n<li>It appears that the only way to obtain higher long-run investment returns is to accept greater risks</li>\n<li>Unfortunately, a perfect risk measure doesn&#39;t exist. Beta and rate of return has not corresponded to the relationship predicted in theory. Beta can also change.</li>\n<li>Behavioral Finance\n\n<ul>\n<li>Investors are generally overconfident in their ability and convinced they can beat the market. A study showed that the more a person traded, the worse they did. Males traded more than females and did worse. Over optimism in forecasting the growth of existing companies could be one reason growth stocks tend to underperform value stocks.</li>\n<li>Biased Judgments – Investors tend to think they can control their investment results even though they can&#39;t.</li>\n<li>Herding – research shows that groups tend to make better decisions than individuals. But this can cause &quot;group think&quot; where individuals will reinforce one another into believing that some incorrect view is the correct one</li>\n<li>Loss aversion – A study concluded that losses were 2 ½ times as undesirable as equivalent gain were desirable</li>\n<li>Pride and Regret – Investors find it very difficult to admit that they have made a bad stock market decision. But are quite proud to tell of their gains. Many investors therefore will hold onto losing positions hoping it recovers.</li>\n</ul></li>\n<li>The problem with trying to &quot;trade&quot; with these ideas is that the market can remain irrational longer than you can remain solvent.</li>\n<li>What are the lessons for the individual investor on behavioral finance?\n\n<ul>\n<li>In investing, we are often our own worst enemy</li>\n<li>Avoid herd behavior. Any investment that has become a topic of widespread conversation is likely to be especially hazardous. But the same behavior leads investors to throw in the towel when pessimism is rampant – a good time to buy</li>\n<li>Avoid overtrading – this incurs more taxes and trading costs which decrease returns</li>\n<li>Be wary of new issues or IPO&#39;s</li>\n<li>Stay cool to Hot Tips</li>\n<li>Never buy anything from someone who is out of breath</li>\n<li>Distrust foolproof schemes</li>\n</ul></li>\n<li>High multiple growth stocks are difficult to invest in because of the danger is forecasting future earnings growth. If the growth fails to materialize, investors get hit with an earning decrease and P/E multiple decrease, a double whammy</li>\n<li>Smart Beta – Maybe possible to gain excess returns by using a variety of passive investment strategies that involve no more risk than would be assumed by investing in a low-cost Total Stock Market index fund. Very difficult to do and their record has been suspect</li>\n<li>There is overwhelming evidence to support small cap beating large and value beating growth stocks</li>\n<li>The record of &quot;Smart Beta&quot; funds beating the market has been spotty. Especially the low volatility and momentum strategies have done very poor vs their index. The value and small tilt have done better. But be aware you are taking extra risk to get these extra returns. You can take a chance that some risk factor(tilt) will generate excess returns in the future, if the core of your portfolio consists of capitalization weighted broad based index funds.</li>\n<li>Smart beta portfolios will not protect you from market bubbles</li>\n<li>Exercise 1 - The most important driver in the growth of your assets is how much you save and saving requires discipline. The only reliable way to build up a nest egg is slowly and steadily. Begin a regular savings program and stick with it. Start now.</li>\n<li>Exercise 2 – Remember Murphy&#39;s Law, what can go wrong will go wrong. Keep a cash reserve of at least 3 months. Get a good term life policy. And avoid variable annuities.</li>\n<li>Exercise 3 – Try to keep pace with inflation on your cash reserve yield. This may include MMF, CD&#39;s, Internet Banks, T-Bills or tax exempt MMF.</li>\n<li>Exercise 4 – Avoid the tax man. Save as much as you can through your tax-sheltered accounts.</li>\n<li>Exercise 5 – Have clear goals. Decide what degree of risk you are willing to take</li>\n<li>Exercise 6 – Buy a house. Real estate is a great inflation hedge. REIT&#39;s are a good choice to own commercial real estate</li>\n<li>Exercise 7 – Invest in Bonds</li>\n<li>Exercise 8 – Gold can have a place in your portfolio (5%). It is a good diversifier and is an excellent inflation hedge. Don&#39;t invest in diamonds or Collectibles. Buy diamonds and collectibles because you like them. Not as an investment. Do NOT invest in commodities futures contracts. You will get burned. Stay away from hedge funds, private equity, and venture capital funds. They are great for the managers, not for you</li>\n<li>Exercise 9 – Remember the costs of investing. Keep them low.</li>\n<li>Exercise 10 – Diversify your investments. It reduces risk.</li>\n<li>Long-Run equity return = Initial dividend yield + growth rate. This has historically been about 5% and 5% for a total of 10%</li>\n<li>Even if a company pays a small dividend today and retains most or all of its earnings to reinvest in the business, the investor assumes that such reinvestment will lead to a more rapidly growing stream of dividends in the future or more stock repurchases</li>\n<li>In the short run, change in valuations can have a major role in determining returns. IE – P/E&#39;s and Dividend yields</li>\n<li>P/E have varied widely. During the early 2000&#39;s with high optimism, the P/E&#39;s were about 30. During 1982 stocks sold at only a P/E of 8</li>\n<li>P/E go up with lower interest rates and go down with higher interest rates because now equities have to compete with bonds</li>\n<li>Long - Run returns on bonds are easy if you hold the bond to maturity. The yield that the bond investor receives is the yield to maturity of the bond at the time of purchase.</li>\n<li>But if bonds are not held to maturity, then changes in interest rates take effect. Higher interest rates lower bond prices and the opposite is true.</li>\n<li>In principle, common stocks should be an inflation hedge</li>\n<li>In general, investors have earned a higher rate of return from the stock market when P/E was low and low rates of return when stocks were purchased at high P/E</li>\n<li>90% of return is determined by asset class chosen and percent. Less than 10% is determined by individual stock selection or manager selection</li>\n<li>History shows that risk and return are related</li>\n<li>Risks of investing in stock and bonds depends on length of time. Longer periods have lower variation in return</li>\n<li>DCA can be useful</li>\n<li>Rebalancing can reduce risk</li>\n<li>You must understand your attitude and your capacity toward risk</li>\n<li>The longer the time period over which you can hold on to your investments, the greater should be the share of common stocks in your portfolio</li>\n<li>Rebalancing yearly reduced volatility and increased returns</li>\n<li>If you job is in an area, you should probably not invest in that area too. Because if something bad happened, you would have more trouble. IE – GM employee owns lots of GM stock. If GM does bad, you would lose your job and your investment</li>\n<li>Mutual Funds are better for DCA your money into the market. ETF&#39;s are better for &quot;lump sum&quot; investing</li>\n<li>Don&#39;t day trade ETF&#39;s</li>\n<li>If you want to buy individual stocks, Index the core portfolio and then take active bets with extra funds. That way if you miss, it won&#39;t prove fatal.</li>\n<li>3 rules for successful stock selection\n\n<ul>\n<li>Confine purchases to companies that appear able to sustain above-average earnings growth for at least 5 years</li>\n<li>Never pay more for a stock than can reasonably be justified by a firm foundation of value</li>\n<li>P/E is a good place to start</li>\n<li>Beware of stocks with high P/E&#39;s</li>\n<li>Trade as little as possible</li>\n</ul></li>\n<li>There is no way to beat the market consistently by purchasing the mutual funds that have performed best in the past</li>\n<li>Often, one year&#39;s hot performers are next year&#39;s dogs</li>\n<li>Morningstar rating system do not guarantee superior results</li>\n</ul>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "obd5nu",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "captmorgan50",
  "discussion_type": null,
  "num_comments": 0,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/obd5nu/burton_malkiel_a_random_walk_down_wall_street/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/obd5nu/burton_malkiel_a_random_walk_down_wall_street/",
  "subreddit_subscribers": 78950,
  "created_utc": 1625121151,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1625109826,
  "the_new_excerpt": "Burton Malkiel\n\nA Random Walk Down Wall Street\n\n * 2 types of analysis\n   * Fundamental analysis or Firm Foundation Theory based on Fisher's DDM\n   * Technical analysis or Castle in the Air or greater fool's theory by Keynes\n * No one person or institution consistently knows more than the market\n *…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バートン・マルキール\n\nア・ランダム・ウォーク・ダウン・ウォール・ストリート\n\n * 2種類の分析法\n   * ファンダメンタル分析、またはフィッシャーのDDMに基づくFirm Foundation Theory\n   * テクニカル分析、またはCastle in the AirやケインズのLarger fool's theoryなど。\n * 一人の人間や機関が一貫して市場よりも多くを知っていることはない\n *...",
      "title": "バートン・マルキール A Random Walk Down Wall Street Summary"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "伯顿-马尔基尔\n\n在华尔街的随机漫步\n\n *2种类型的分析\n   * 基本面分析或基于费雪DDM的坚实基础理论\n   * 技术分析或空中城堡或凯恩斯的大傻瓜理论\n * 没有一个人或机构始终比市场知道得更多\n *...",
      "title": "伯顿-马尔基尔《在华尔街随机漫步》摘要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "伯頓-馬爾基爾\n\n在華爾街的隨機漫步\n\n *2種類型的分析\n   * 基本面分析或基於費雪DDM的堅實基礎理論\n   * 技術分析或空中城堡或凱恩斯的大傻瓜理論\n * 沒有一個人或機構始終比市場知道得更多\n *...",
      "title": "伯頓-馬爾基爾《在華爾街隨機漫步》摘要"
    }
  ],
  "source_updated_at": 1625218968190
}