{
  "author": "OGSquidFucker",
  "the_new_excerpt": "DOGE mania is bringing lots of new clueless people here and the sub feels\ncluttered with a lot of newbie threads about basics that have been covered in\ndepth over and over.\n\nHow should we deal with this? A stickied FAQ or at least a pinned post urging\nnewbies to use the search function seems like it…",
  "original_created_utc": 1620525520,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DOGEマニアが多くの新しい無知な人々をここに連れてきており、サブの方は\n何度も何度も説明されている基本的なことについての多くの初心者のスレッドで散らかっています。\nが散らかっているように感じます。\n\nどのように対処すべきでしょうか？FAQに付箋を貼るか、少なくとも初心者に検索機能の使用を促すピン留めされた投稿を\n検索機能を使うように初心者に促すピン留めされた記事があるといいのですが...。",
      "title": "DOGEは、GMEがサブ機に投資したように、サブ機の品質を下げています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "DOGE的狂热给这里带来了很多新的无知者，而且子网站感觉很杂乱。\n很多关于基础知识的新手主题让人感觉杂乱无章，而这些基础知识已经被反复介绍过了。\n深入浅出。\n\n我们应该如何处理这个问题？在贴纸上写上 \"常见问题\"，或者至少在贴纸上呼吁\n新手使用搜索功能似乎是个不错的选择。",
      "title": "DOGE正在降低子系统的质量，就像GME对投资子系统所做的那样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "DOGE的狂熱給這裏帶來了很多新的無知者，而且子網站感覺很雜亂。\n很多關於基礎知識的新手主題讓人感覺雜亂無章，而這些基礎知識已經被反覆介紹過了。\n深入淺出。\n\n我們應該如何處理這個問題？在貼紙上寫上 \"常見問題\"，或者至少在貼紙上呼籲\n新手使用搜索功能似乎是個不錯的選擇。",
      "title": "DOGE正在降低子系統的質量，就像GME對投資子系統所做的那樣。"
    }
  ],
  "title": "DOGE is bringing down the quality of the sub like GME did to investing subs",
  "created_utc": 1620536046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>DOGE mania is bringing lots of new clueless people here and the sub feels cluttered with a lot of newbie threads about basics that have been covered in depth over and over. </p>\n\n<p>How should we deal with this? A stickied FAQ or at least a pinned post urging newbies to use the search function seems like it would be helpful.</p>\n\n<p>I wish nothing but the best for everyone joining us, but not fond of scrolling through 10 newbie threads to find a technical discussion about coins with serious use cases.</p>\n</div><!-- SC_ON -->",
  "score": 11142,
  "permalink": "/r/CryptoCurrency/comments/n83wha/doge_is_bringing_down_the_quality_of_the_sub_like/",
  "subreddit": "CryptoCurrency",
  "id": "n83wha",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990899
}