{
  "author": "RenLovesStimpy",
  "the_new_excerpt": "REGULATORS SUBPOENA MASS. RESIDENT ‘ROARING KITTY’ REGARDING GAMESTOP SAGA\n[https://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty-gamestop-saga/]\n\nhttps://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty…",
  "original_created_utc": 1612973235,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "监管者传唤马萨诸塞州的居民 \"咆哮的小猫 \"对GAMESTOP SAGA的关注。居民 \"咆哮的小猫 \"对GAMESTOP SAGA的评价。\n[https://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty-gamestop-saga/]\n\nhttps://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty...",
      "title": "监管机构就GameStop传奇传唤马萨诸塞州居民 \"Roaring Kitty\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "監管者傳喚馬薩諸塞州的居民 \"咆哮的小貓 \"對GAMESTOP SAGA的關注。居民 \"咆哮的小貓 \"對GAMESTOP SAGA的評價。\n[https://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty-gamestop-saga/]\n\nhttps://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty...",
      "title": "監管機構就GameStop傳奇傳喚馬薩諸塞州居民 \"Roaring Kitty\"。"
    }
  ],
  "title": "Regulators subpoena Mass. resident ‘Roaring Kitty’ regarding GameStop saga",
  "created_utc": 1612982055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h2><a href=\"https://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty-gamestop-saga/\">Regulators subpoena Mass. resident ‘Roaring Kitty’ regarding GameStop saga</a></h2>\n\n<p><sup><a href=\"https://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty-gamestop-saga/\">https://www.bostonglobe.com/2021/02/09/business/mass-regulators-subpoena-local-man-known-roaring-kitty-gamestop-saga/</a></sup></p>\n\n<h2>The issue: Did Keith Gill, an employee of the financial services giant MassMutual, violate state securities laws by promoting the stock?</h2>\n\n<h3>&quot;Gill to testify Feb. 26 before the Securities Division in Boston&quot;</h3>\n\n<p>&nbsp;</p>\n\n<blockquote>\n<p>Massachusetts securities regulators want to interview Keith Gill, the investor known online as Roaring Kitty, whose multimillion-dollar gains on stock in the retailer GameStop have made him legendary in Internet stock-trading circles.</p>\n\n<p>A spokeswoman for Secretary of State William Galvin said the office sent a subpoena late Monday to Gill, seeking his testimony as it investigates whether any securities regulations were violated when the Wilmington resident, who works at MassMutual, the Springfield financial services company, touted GameStop stock in his spare time.</p>\n\n<p>Gill, who holds licenses to sell most kinds of investments and offer financial advice, is required as a registered broker-dealer agent to tell his employer about outside business activities. At issue is whether his online activity laying out his enthusiasm for GameStop on social media was work, or a hobby.</p>\n\n<p>For much of the time that Gill was promoting GameStop in YouTube videos and on an investor forum on Reddit, he was working for MassMutual as a director of financial wellness education. He resigned from the company last month.</p>\n\n<p>The subpoena calls for Gill to testify Feb. 26 before the Securities Division in Boston. The office said it was awaiting a response from Gill; it was not clear if Gill has an attorney. He did not respond to a message from the Globe left at a phone number listed in his name.</p>\n\n<p>Galvin’s office had previously had requested information from MassMutual about Gill’s responsibilities and how it supervises registered brokers, including their use of social media.</p>\n\n<p>Galvin has said that MassMutual told his office that had it known about Gill’s online commentary on Gamestop, it would have ordered him to stop. MassMutual also said it had denied an earlier request by Gill to manage investments for a family friend, according to Galvin. Gill gave notice on Jan. 21 and left his job a week later, Galvin’s office said.</p>\n\n<p>A MassMutual representative could not be reached for comment.</p>\n\n<p>Galvin declined to comment further on Tuesday. Last week, he said the investigation “is not about him [Gill]. It’s about the bigger issues here: transparency and the adequacy of the licensing process.”</p>\n\n<p>Gill, raised in Brockton, has become a central character in an unlikely run for the stock of GameStop, which has been struggling to reinvent itself amid rapid change in the physical retail and video game industries. Gill bought into the company more than a year ago and has regularly updated members of the popular Wallstreetbets forum on Reddit about the progress of his investment.</p>\n\n<p>On that social media site, where he is known as Deep[expletive]Value, Gill has told fellow investors and stock market enthusiasts that he invested $53,566 in the stock. At the peak of trading in late January, when GameStop’s stock price hit $347, Gill posted an account statement showing his holdings were valued at $48 million.</p>\n\n<p>The stock price has since retreated, closing Tuesday at $50.31, down 16.1 percent but still well above the single digits where it was trading just a month ago — and far above the price Gill reported paying for his shares. He has since built up a cash balance of almost $14 million, according to a statement he posted Feb. 3, and still owns another 50,000 shares, plus an options contract for more.</p>\n\n<p>The investment has made him a star on the forum, particularly as its membership has surged in recent months amid a rise in day trading through services such as &quot;<em>that-one-garbage-app-no-one-should-use</em>&quot;. Many others bought in as the stock rose in value, some of whom were motivated by a desire to stick it to a group of hedge funds who had “shorted” GameStop stock, betting that it would go down rather than up.</p>\n\n<p>Gill has gone quiet on YouTube, where he is known as Roaring Kitty.In numerous earlier videos, he maintained there is long-term value in GameStop’s business that the the stock market has failed to see.</p>\n\n<p>In his most recent stream on YouTube, on Jan. 22 — a day when the stock had risen by more than 50 percent to $65 — he said he was focused on GameStop’s next act.</p>\n\n<p>“I’m so excited to see what is ahead for this company, and now what you’re seeing is the rest of the market, right? They’re getting real excited for what lies ahead — and that’s cool to see,” he said.</p>\n\n<p>The stock would continue its rise for several days before plummeting back down.</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/stocks/comments/lgwv8f/regulators_subpoena_mass_resident_roaring_kitty/",
  "subreddit": "stocks",
  "id": "lgwv8f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204990
}