{
  "author": "paslode_go_brrrrr",
  "original_created_utc": 1660100827,
  "title": "Aside from their side effects on the home front and I'm sure emotionally, were the \"pals battalions\" of WW1 Britain effective?",
  "created_utc": 1660138940,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Anyone with an interest in the first world war has surely heard of the pals battalions employed by Britain. However, most information I&amp;#39;ve found regarding them has been heavily focused on the aftermath of a whole towns men being killed or wounded all at once. &lt;/p&gt;\n\n&lt;p&gt;My question, then, is did their effectiveness in combat differ notably in any way from other units? Were pals battalions known to achieve success on the battlefield? Or were they considered on par or sub par to a similar unit made up of men from all over the country? Were their close civilian bonds an aide or a detriment at the front? &lt;/p&gt;\n\n&lt;p&gt;I realize it&amp;#39;s a pretty open ended question and maybe there wasn&amp;#39;t any noteworthy differences displayed in combat but I&amp;#39;d be thrilled to hear some of your thoughts regardless.&lt;/p&gt;\n\n&lt;p&gt;Edit: Grammer&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/wkmhxh/aside_from_their_side_effects_on_the_home_front/",
  "subreddit": "AskHistorians",
  "id": "wkmhxh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Anyone with an interest in the first world war has surely heard of the pals\nbattalions employed by Britain. However, most information I've found regarding\nthem has been heavily focused on the aftermath of a whole towns men being killed\nor wounded all at once.\n\nMy question, then, is did their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第一次世界大戦に関心のある人なら、きっと聞いたことがあるであろう「パルズ\nイギリスが採用したパルスの大隊のことは、誰でも聞いたことがあるはずだ。しかし、私が見つけたほとんどの情報は\nしかし、私の知る限り、そのほとんどは、町中の兵士が一度に死傷した後のことである。\nという話に終始している。\n\nそこで、私が疑問に思うのは、彼らの...",
      "title": "家庭での副作用はもちろんのこと、精神的なものも含めて、「プ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何对第一次世界大战感兴趣的人肯定都听说过伙伴们的故事\n英国雇用的伙伴营。然而，我所找到的关于他们的大多数信息\n他们的信息主要集中在整个城镇的人被杀或受伤的后果上。\n或受伤的后果。\n\n那么，我的问题是，他们是否...",
      "title": "除了他们在后方和我肯定在情感上的副作用之外，一战英国的 \"伙伴营 \"是否有效？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何對第一次世界大戰感興趣的人肯定都聽說過夥伴們的故事\n英國僱用的夥伴營。然而，我所找到的關於他們的大多數信息\n他們的信息主要集中在整個城鎮的人被殺或受傷的後果上。\n或受傷的後果。\n\n那麼，我的問題是，他們是否...",
      "title": "除了他們在後方和我肯定在情感上的副作用之外，一戰英國的 \"夥伴營 \"是否有效？"
    }
  ]
}