{
  "author": "ClaustrophobicShop",
  "the_new_excerpt": "Not really a big fan of Warren Buffett, but I think this quote describes\nperfectly how wealth is accumulated....and it's why everyone is here. No offense\nto the traders here, but the goal isn't to be sitting in front of screens making\nthe right timing decisions...it's to be letting assets you own…",
  "original_created_utc": 1624044127,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウォーレン・バフェットの大ファンというわけではありませんが、この言葉は富がどのように蓄積されていくかを完璧に表していると思います。\n富がどのように蓄積されていくのかを見事に表現していると思います....、だからこそ皆がここにいるのです。ここにいるトレーダーの皆さんに悪意はありませんが\nトレーダーの皆さんには悪いのですが、目標はスクリーンの前に座って\n正しいタイミングで判断することではありません...自分の所有する資産を...",
      "title": "ウォーレン・バフェット：\"寝ている間にお金を稼ぐ方法を見つけなければ、死ぬまで働くことになるだろう\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是沃伦-巴菲特的大粉丝，但我认为这句话完美地描述了\n完美地描述了财富是如何积累的....，这也是每个人在这里的原因。无意冒犯\n无意冒犯这里的交易员，但我们的目标不是坐在屏幕前做出\n正确的时机决策......而是让你拥有的资产......。",
      "title": "沃伦-巴菲特：\"如果你不找到一种在睡觉时赚钱的方法，你将工作到死\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是沃倫-巴菲特的大粉絲，但我認爲這句話完美地描述了\n完美地描述了財富是如何積累的....，這也是每個人在這裏的原因。無意冒犯\n無意冒犯這裏的交易員，但我們的目標不是坐在屏幕前做出\n正確的時機決策......而是讓你擁有的資產......。",
      "title": "沃倫-巴菲特：\"如果你不找到一種在睡覺時賺錢的方法，你將工作到死\"。"
    }
  ],
  "title": "Warren Buffett: \"If you don't find a way to make money while you sleep, you will work until you die.\"",
  "created_utc": 1624055437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not really a big fan of Warren Buffett, but I think this quote describes perfectly how wealth is accumulated....and it&#39;s why everyone is here. No offense to the traders here, but the goal isn&#39;t to be sitting in front of screens making the right timing decisions...it&#39;s to be letting assets you own accumulate. So congrats for being here and starting on that path...</p>\n</div><!-- SC_ON -->",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/o2y18g/warren_buffett_if_you_dont_find_a_way_to_make/",
  "subreddit": "CryptoCurrency",
  "id": "o2y18g",
  "is_self": true,
  "media": null,
  "is_video": false
}