{
  "author": "ThrowRa1247262",
  "original_created_utc": 1646313191,
  "title": "Is it racist to dislike black americans because you exclusively have bad experiences with them but have no problems with black people or any other race from other countries?",
  "created_utc": 1646327384,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im sure this will spark some outrage and I dont mind being called names on the internet but please elaborate first. Also, this isnt bait, just a legit question.&lt;/p&gt;\n\n&lt;p&gt;Lets just say that thanks to my job I served people all over the world. Americans in general were by far the worst, however I havent had a decent experience with african americans. Always first to cause a scene or get riled up or whatever. &lt;/p&gt;\n\n&lt;p&gt;I dont have a problem with any other race or culture, I&amp;#39;ve met African people of all colors and they are some of the nices I ever met. Australians too, British people as well etc. &lt;/p&gt;\n\n&lt;p&gt;I dont judge people based on what they look like...unles they are american...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/t5rb84/is_it_racist_to_dislike_black_americans_because/",
  "subreddit": "TooAfraidToAsk",
  "id": "t5rb84",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Im sure this will spark some outrage and I dont mind being called names on the\ninternet but please elaborate first. Also, this isnt bait, just a legit\nquestion.\n\nLets just say that thanks to my job I served people all over the world.\nAmericans in general were by far the worst, however I havent had…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このようなことを言うと、怒りの声が聞こえてきそうですが、私はこのようなことを言われても気にしません。\nインターネットでは、まず詳しく説明してください。また、これは餌ではありません。\nという質問をします。\n\n私は仕事の関係で、世界中の人々にサービスを提供しています。\n一般的にアメリカ人は最悪ですが、私はそのようなことはありません...",
      "title": "黒人のアメリカ人は嫌だけど、他の国の黒人や他の人種は問題ないというのは、人種差別ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信这将引发一些愤怒，我不介意在互联网上被骂。\n但请先说明一下。另外，这不是诱饵，只是一个合法的\n问题。\n\n我只想说，由于我的工作，我为全世界的人服务。\n一般来说，美国人是迄今为止最糟糕的，然而我没有...",
      "title": "不喜欢美国黑人是因为你只和他们有不愉快的经历，但对其他国家的黑人或其他种族却没有问题，这算不算种族主义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信這將引發一些憤怒，我不介意在互聯網上被罵。\n但請先說明一下。另外，這不是誘餌，只是一個合法的\n問題。\n\n我只想說，由於我的工作，我爲全世界的人服務。\n一般來說，美國人是迄今爲止最糟糕的，然而我沒有...",
      "title": "不喜歡美國黑人是因爲你只和他們有不愉快的經歷，但對其他國家的黑人或其他種族卻沒有問題，這算不算種族主義？"
    }
  ]
}