{
  "author": "matthewsmazes",
  "original_created_utc": 1635364483,
  "title": "Stop being surprised and start strategizing around alt coins",
  "created_utc": 1635388619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand. I understand that it&#39;s frustrating to see a coin that you and everyone in your circle called a &#39;shit coin&#39; take off. I get that seems counter-intuitive to your research, passion, logic, feelings, etc...     </p>\n\n<p>But there are very legitimate and logical reasons it keeps happening over and over, even if you don&#39;t see those reasons and even if you don&#39;t like those reasons.       </p>\n\n<p>Here&#39;s a few quick, logical reasons for what SHIB is doing today:       </p>\n\n<ul>\n<li>DOGE showed that there was global interest in a low-cost coin for people who didn&#39;t &#39;get into BTC in 2012.&#39;<br/></li>\n<li>SHIB is (according to their community) looking to improve upon the DOGE model.<br/></li>\n<li>SHIB is marketing genius.  They identified their adversary and set out to shift its supporters and funds over to its coffers. You might &quot;hate marketing&#39; but I have news for you... marketing won&#39;t go away in a Decentralized world. In fact, it is going to be 10000x more important in a decentralized world as long as we are not all given equal access to meet our basic human needs.<br/></li>\n<li>While many people enter this space to make some money, many people in the world right now see Crypto as a means to improve their life in the near future. They cannot fathom doing that by investing into 0.00001 BTC, but they can see it happening with something that only costs 0.004 per coin.  This isn&#39;t wise if they FOMO into it, true.  But PEOPLE, as a general rule, ARE NOT WISE. They want gains, and they want it as quick as possible. This is true in all markets, and will not stop in Crypto.<br/></li>\n</ul>\n\n<p>There&#39;s a lot more I can say on this, but the general point is this:     </p>\n\n<p>Stop being surprised by these events. Instead, use your logic and concern and plan for them.      </p>\n\n<p>find an amount you are willing to risk and take some risks on promising alt coins. Personally, I keep 5-15% of my portfolio for this purpose. But do whatever you want.     </p>\n\n<p>This isn&#39;t financial advice. Just my opinion and approach to dealing with what so many people on here seem to have trouble accepting:      </p>\n\n<p>Emotional movement in a market is logical. Learn to read it and move accordingly.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qh52eg/stop_being_surprised_and_start_strategizing/",
  "subreddit": "CryptoCurrency",
  "id": "qh52eg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand. I understand that it's frustrating to see a coin that you and\neveryone in your circle called a 'shit coin' take off. I get that seems\ncounter-intuitive to your research, passion, logic, feelings, etc...\n\nBut there are very legitimate and logical reasons it keeps happening over…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "わかりました。あなたやあなたの周りの人たちが「クソコイン」と呼んだコインが流行るのを見るのが悔しいのはわかります。\nあなたやあなたの周りの人たちが「クソコイン」と呼んでいたコインが離陸するのを見るのが悔しいのはわかります。あなたの研究、情熱、論理、感覚とは逆行しているように思えるのもわかります。\nあなたの研究、情熱、論理、感情などに反しているように見えるのもわかります...。\n\nしかし、それが繰り返されるのには、非常に正当で論理的な理由があるのです...。",
      "title": "驚くのはやめて、アルトコインで戦略を立てよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解。我理解，看到你和你圈子里的每个人都称之为 \"狗屎硬币 \"的硬币起飞，这让人感到沮丧。\n你和你的圈子里的每个人都称之为 \"狗屎硬币 \"的硬币脱手。我明白这似乎\n与你的研究、热情、逻辑、感觉等背道而驰......。\n\n但是，有非常合理和合乎逻辑的原因，它不断地发生在...",
      "title": "停止惊讶，开始围绕替代币制定战略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解。我理解，看到你和你圈子裏的每個人都稱之爲 \"狗屎硬幣 \"的硬幣起飛，這讓人感到沮喪。\n你和你的圈子裏的每個人都稱之爲 \"狗屎硬幣 \"的硬幣脫手。我明白這似乎\n與你的研究、熱情、邏輯、感覺等背道而馳......。\n\n但是，有非常合理和合乎邏輯的原因，它不斷地發生在...",
      "title": "停止驚訝，開始圍繞替代幣制定戰略"
    }
  ]
}