{
  "author": "busterrulezzz",
  "original_created_utc": 1652966815,
  "title": "Tether just released it's quarterly reserve assesment, and they claim to have access to US$82,424,821,101",
  "created_utc": 1652983458,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So after the UST/Luna fiasco, stablecoins have rightfully came under much more scrutiny. And everyone in this space knows that USDT (Tether) has long been suspected of hiding its true reserves.&lt;/p&gt;\n\n&lt;p&gt;This morning, Tether &lt;a href=\"https://tether.to/en/assurance-opinion-once-again-re-affirms-tethers-reserves-fully-backed-reveals-significant-reductions-in-commercial-paper-and-increase-in-us-treasury-bills/\"&gt;published a report&lt;/a&gt; signed by an independent firm in which the reserves are estimated at just over 82 billion USD.&lt;/p&gt;\n\n&lt;p&gt;One thing I personally find interesting is that Tether seems to be moving away from commercial paper (illiquid debt instruments compared to other financial vehicles) and more towards the rock solid US treasury bills. They claim that commercial papers went down by 17% fro prior quarter. Tether also says that the ratings of the commercial papers they still hold has been upgraded from A-2 to A-1, which theoretically mean that they are less likely to default.&lt;/p&gt;\n\n&lt;p&gt;Now, I would not take for granted all this information. Tether has shown some tendency to be somewhat secretive in the past. But given the recent events, I think it&amp;#39;s a good thing that they try to be more transparent - and &lt;strong&gt;if the assesment is truthful, then the biggest stablecoin in our ecosystem is safe&lt;/strong&gt;, and we don&amp;#39;t have to worry about another depeg disaster.&lt;/p&gt;\n\n&lt;p&gt;What do you think about Tether reserve? I personally prefer USDC/DAI, but I&amp;#39;m curious about where this sub stands about USDT now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "permalink": "/r/CryptoCurrency/comments/ut3exb/tether_just_released_its_quarterly_reserve/",
  "subreddit": "CryptoCurrency",
  "id": "ut3exb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So after the UST/Luna fiasco, stablecoins have rightfully came under much more\nscrutiny. And everyone in this space knows that USDT (Tether) has long been\nsuspected of hiding its true reserves.\n\nThis morning, Tether published a report\n[https://tether.to/en/assurance-opinion-once-again-re-affirms…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "UST/Luna騒動の後、安定化コインは当然ながら、より多くの人に注目されるようになりました。\n精査されるようになりました。そして、USDT（Tether）が長い間、以下のような疑いをかけられてきたことは、この分野の誰もが知っています。\n本当の埋蔵量を隠しているのではないかという疑惑があることは、この分野では誰もが知っています。\n\n今朝、Tether社はレポートを発表しました。\n[https://tether.to/en/assurance-opinion-once-again-re-affirms..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，在UST/Luna的惨败之后，稳定币理所当然地受到了更多的关注。\n审查。这个领域的每个人都知道，USDT（Tether）长期以来一直被怀疑为\n被怀疑隐藏了其真正的储备。\n\n今天早上，Tether发布了一份报告\n[https://tether.to/en/assurance-opinion-once-again-re-affirms...",
      "title": "Tether刚刚发布了它的季度储备评估，他们声称可以获得82,424,821,101美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，在UST/Luna的慘敗之後，穩定幣理所當然地受到了更多的關注。\n審查。這個領域的每個人都知道，USDT（Tether）長期以來一直被懷疑爲\n被懷疑隱藏了其真正的儲備。\n\n今天早上，Tether發佈了一份報告\n[https://tether.to/en/assurance-opinion-once-again-re-affirms...",
      "title": "Tether剛剛發佈了它的季度儲備評估，他們聲稱可以獲得82,424,821,101美元。"
    }
  ]
}