{
  "author": "nagarams",
  "original_created_utc": 1640501416,
  "title": "Is it bad that I downvote anti-vaxxers?",
  "created_utc": 1640521618,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;No matter what they say, the moment they start a comment with “I’m an anti-vaxxer”, I hit the downvote button. Sometimes it’s not explicitly stated, all they say is “I didn’t get vaccinated and I’m fine”.&lt;/p&gt;\n\n&lt;p&gt;I generally consider myself open-minded and willing to listen to all opinions and not judge based on my first impression. But when it comes to vaccination… I feel like it’s a social responsibility? It doesn’t just affect you, it affects everyone else too. And I guess it gets on my nerves more cos there’s so much misinformation surrounding the topic as it is.&lt;/p&gt;\n\n&lt;p&gt;To clarify, I don’t mean unvaccinated people, who may have underlying conditions etc. I mean the people who identify as hostile to vaccinations.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 147,
  "permalink": "/r/TooAfraidToAsk/comments/rorh7b/is_it_bad_that_i_downvote_antivaxxers/",
  "subreddit": "TooAfraidToAsk",
  "id": "rorh7b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "No matter what they say, the moment they start a comment with “I’m an\nanti-vaxxer”, I hit the downvote button. Sometimes it’s not explicitly stated,\nall they say is “I didn’t get vaccinated and I’m fine”.\n\nI generally consider myself open-minded and willing to listen to all opinions\nand not judge…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何を言われても、コメントの冒頭で「私は」と言った瞬間に\nアンチ・ヴァクサー(anti-vaxxer)と言って、ダウンボートボタンを押しています。明示されていないこともあります。\n予防接種を受けなかったから大丈夫」しか言わない。\n\n私は一般的に、自分は心が広く、あらゆる意見に耳を傾けることができると思っています\nと判断しないように...。",
      "title": "アンチヴァクサーにダウンヴォートするのは悪いことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "无论他们说什么，只要他们在评论中以 \"我是一个反疫苗的人 \"作为开头，我就会点击降权按钮。\n反疫苗\"，我就按下了降权按钮。有时并没有明确说明。\n他们只说 \"我没有接种疫苗，我很好\"。\n\n我一般认为自己思想开放，愿意听取所有意见\n而不是评判...",
      "title": "我给反疫苗的人降权，这很糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "無論他們說什麼，只要他們在評論中以 \"我是一個反疫苗的人 \"作爲開頭，我就會點擊降權按鈕。\n反疫苗\"，我就按下了降權按鈕。有時並沒有明確說明。\n他們只說 \"我沒有接種疫苗，我很好\"。\n\n我一般認爲自己思想開放，願意聽取所有意見\n而不是評判...",
      "title": "我給反疫苗的人降權，這很糟糕嗎？"
    }
  ]
}