{
  "author": "SpoogeMcDuck69",
  "the_new_excerpt": "XRT is an ETF that tracks retail. Here is the chart. https://imgur.com/a/a027rvQ\n\nI can understand a rally leading into loosening of coronavirus restrictions and\npeople going out and about. However, retail has been on a decline for years. You\ncan see this ETF was trading in the 40s in 2016 and now…",
  "original_created_utc": 1615815202,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "XRT是一只跟踪零售的ETF。以下是图表。https://imgur.com/a/a027rvQ\n\n我可以理解集会导致冠状病毒限制的松动，也可以理解。\n的人外出活动。然而，零售业多年来一直处于下滑状态。你\n可以看到这只ETF在2016年的交易额是40多万，现在...",
      "title": "为什么零售业涨幅这么高？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "XRT是一隻跟蹤零售的ETF。以下是圖表。https://imgur.com/a/a027rvQ\n\n我可以理解集會導致冠狀病毒限制的鬆動，也可以理解。\n的人外出活動。然而，零售業多年來一直處於下滑狀態。你\n可以看到這隻ETF在2016年的交易額是40多萬，現在...",
      "title": "爲什麼零售業漲幅這麼高？"
    }
  ],
  "title": "Why the hell is retail up so high?",
  "created_utc": 1615832731,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>XRT is an ETF that tracks retail. Here is the chart. <a href=\"https://imgur.com/a/a027rvQ\">https://imgur.com/a/a027rvQ</a> </p>\n\n<p>I can understand a rally leading into loosening of coronavirus restrictions and people going out and about. However, retail has been on a decline for years. You can see this ETF was trading in the 40s in 2016 and now its all the way up to mid 90s? Does anyone have a good explanation for this or are these companies way overvalued? </p>\n\n<p>The only thing I can think of to justify the valuations is that a ton of these retailers who were slowly losing for the last few years have been pushed to expedite their ecommerce transition during COVID so it is possible that these valuations are secondary to the retail market actually successfully pivoting.</p>\n\n<p>Any thoughts?</p>\n\n<p>Edit: Gamestop. It&#39;s gamestop guys. Thanks for playing.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/stocks/comments/m5ks1b/why_the_hell_is_retail_up_so_high/",
  "subreddit": "stocks",
  "id": "m5ks1b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382532
}