{
  "author": "Kbg4213711",
  "original_created_utc": 1636555389,
  "title": "Is there a way to humanely euthanize our cat at home?",
  "created_utc": 1636562262,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Our cat is old and her health has been degrading over the past month. We were going to take her to my father in laws for thanksgiving for her to live out the rest of her days before passing on but this morning she seems to be in a good amount of pain and can barely walk. Over night she really seemed to of taken a down turn. I only have one vet office within a 2 hour drive and they won’t see any pets (even euthanasia) unless a prior appointment and that’s usually two weeks out. I do hunt but I don’t have any close public hunting grounds or areas I could shoot at to put her down that way, nor do I really think I could despite trying to think of something that would be very quick for her. It would be too hard I think for me mentally. </p>\n\n<p>So is there anything I can do humanely at home? Sleeping pills? Anything? I wouldn’t want to give her anything that would just cause her more sickness or pain. It’s a messed up question but I don’t know who ask or what to do. I just don’t want her to suffer.</p>\n</div><!-- SC_ON -->",
  "score": 376,
  "permalink": "/r/TooAfraidToAsk/comments/qqvy23/is_there_a_way_to_humanely_euthanize_our_cat_at/",
  "subreddit": "TooAfraidToAsk",
  "id": "qqvy23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Our cat is old and her health has been degrading over the past month. We were\ngoing to take her to my father in laws for thanksgiving for her to live out the\nrest of her days before passing on but this morning she seems to be in a good\namount of pain and can barely walk. Over night she really seemed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "我が家の猫は高齢で、この1ヶ月で健康状態が悪化しています。私たちは、この猫を\n感謝祭に義理の父のところに連れて行って、余生を過ごしてから逝こうと思っていました。\nしかし、今朝、彼女はかなりの痛みを感じているようで、ほとんど歩くことができません。\n今朝、彼女はかなりの痛みを感じているようで、ほとんど歩くことができませんでした。一晩中、彼女は本当に...",
      "title": "我が家の猫を自宅で人道的に安楽死させる方法はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们的猫已经老了，在过去的一个月里，她的健康状况一直在退化。我们本来\n我们打算在感恩节时把她带到我岳父家，让她在去世前度过余生。\n但今天早上，她似乎处于相当大的痛苦之中。\n疼痛，几乎不能走路。今天晚上，她似乎真的...",
      "title": "有什么办法可以在家里对我们的猫进行人道的安乐死吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們的貓已經老了，在過去的一個月裏，她的健康狀況一直在退化。我們本來\n我們打算在感恩節時把她帶到我岳父家，讓她在去世前度過餘生。\n但今天早上，她似乎處於相當大的痛苦之中。\n疼痛，幾乎不能走路。今天晚上，她似乎真的...",
      "title": "有什麼辦法可以在家裏對我們的貓進行人道的安樂死嗎？"
    }
  ]
}