{
  "author": "Set1Less",
  "original_created_utc": 1648217911,
  "title": "India's regressive crypto tax laws kick in from 1st April.. Monero P2P platforms are already seeing a boom",
  "created_utc": 1648269482,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;India&amp;#39;s regressive tax laws come into effect from 1st of April.. hardly a week left for it. &lt;/p&gt;\n\n&lt;p&gt;This includes a flat 30% tax on all crypto trades.. because the govt enabled and helped you to trade right? 🤷&lt;/p&gt;\n\n&lt;p&gt;Also you cant claim capital losses, but have to pay capital gains. Lol..&lt;/p&gt;\n\n&lt;p&gt;And the worst of the lot, each time you trade, you have to remit 1% of the trade to the government as tax deducted at source. For example if you buy $100 BTC, you pay $1 right away, the seller is supposed to deduct this..so you only get $99. This will kill market makers who make hundreds of trades every day to provide liquidity. Imagine if they have to pay 1% on each trade, their capital is going to get sucked out pretty hard. As a result you will have very thin order books on CEX as market makers will exit. &lt;/p&gt;\n\n&lt;p&gt;Since the laws are kicking in soon, Monero p2p platforms have gained some popularity. &lt;/p&gt;\n\n&lt;p&gt;This is a popular Monero platform that was almost a ghost town even in January with hardly any traders,  but all of a sudden there are dozens of sellers there with hundreds if not thousands of trades. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/157b7pplfjp81.jpg?width=2726&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=ec252c8e69e6fa35fe7f24dc6fcf796f50deec7f\"&gt;Monero p2p boom&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Bisq has not seen much growth though, as it has a steeper learning curve.. &lt;/p&gt;\n\n&lt;p&gt;These laws show the government is clueless as to what crypto is and how much . As ZK tech becomes more popular, it would be much more easier trading P2P crypto with one another&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/tnmxs4/indias_regressive_crypto_tax_laws_kick_in_from/",
  "subreddit": "CryptoCurrency",
  "id": "tnmxs4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "India's regressive tax laws come into effect from 1st of April.. hardly a week\nleft for it.\n\nThis includes a flat 30% tax on all crypto trades.. because the govt enabled and\nhelped you to trade right? 🤷\n\nAlso you cant claim capital losses, but have to pay capital gains. Lol..\n\nAnd the worst of the…"
}