{
  "author": "DocPemberton",
  "the_new_excerpt": "Since Washington D.C. is only the size of a city, Why would it become its own\nstate instead of being absorbed into the bordering states of Virginia and\nMaryland?\n\nFurthermore, If Washington D.C. became a state, couldn’t this set a precedent\nfor large metropolitan areas like NYC or Chicago to become…",
  "original_created_utc": 1619122670,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ワシントンD.C.は都市の大きさしかないのに、なぜ国境のあるバージニア州やテキサス州に吸収されることなく、独自の州になったのでしょうか？\n隣接するバージニア州やメリーランド州に吸収されるのではなく、独自の州になったのでしょうか？\nメリーランド州に吸収されるのではなく、なぜ独自の州になるのか？\n\nさらに、もしワシントンD.C.が州になったら、ニューヨークやシカゴのような大都会が州になる前例にならないだろうか？\nニューヨークやシカゴのような大都会が州になる前例にならないだろうか？",
      "title": "ワシントンD.C.は都市の大きさしかないのに、なぜ隣接するバージニア州やメリーランド州に吸収されることなく、独自の州になったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "既然华盛顿特区只有一个城市那么大，为什么它要成为自己的州呢？\n而不是被并入弗吉尼亚和马里兰这两个接壤的州？\n马里兰州？\n\n此外，如果华盛顿特区成为一个州，这难道不是一个先例吗？\n像纽约市或芝加哥这样的大都市地区成为......",
      "title": "既然华盛顿特区只有一个城市那么大，为什么它要成为自己的州，而不是被并入弗吉尼亚和马里兰这两个接壤的州？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "既然華盛頓特區只有一個城市那麼大，爲什麼它要成爲自己的州呢？\n而不是被併入弗吉尼亞和馬里蘭這兩個接壤的州？\n馬里蘭州？\n\n此外，如果華盛頓特區成爲一個州，這難道不是一個先例嗎？\n像紐約市或芝加哥這樣的大都市地區成爲......",
      "title": "既然華盛頓特區只有一個城市那麼大，爲什麼它要成爲自己的州，而不是被併入弗吉尼亞和馬里蘭這兩個接壤的州？"
    }
  ],
  "title": "Since Washington D.C. is only the size of a city, why would it become its own state instead of being absorbed into the bordering states of Virginia and Maryland?",
  "created_utc": 1619178065,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since Washington D.C. is only the size of a city, Why would it become its own state instead of being absorbed into the bordering states of Virginia and Maryland?</p>\n\n<p>Furthermore, If Washington D.C. became a state, couldn’t this set a precedent for large metropolitan areas like NYC or Chicago to become their own states as well?</p>\n\n<p>I can see the benefit of major cities or extremely population dense areas operating as their own entities since urban populations sometimes seem to disagree with rural populations on select issues, but would that even work?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/Ask_Politics/comments/mwdqqp/since_washington_dc_is_only_the_size_of_a_city/",
  "subreddit": "Ask_Politics",
  "id": "mwdqqp",
  "is_self": true,
  "media": null,
  "is_video": false
}