{
  "author": "Neymar11rose",
  "original_created_utc": 1643383104,
  "title": "r/personalfinance continues to downvote any comments I make about staking stablecoins on exchanges for better returns than HYSA for banks. Some posts even lead to deletion for ‘rule breaking’",
  "created_utc": 1643409445,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve posted 2 comments on separate occasions where OP has let’s say over $10k and wants their money to earn interest over time, while also being liquid if they ever need it.&lt;/p&gt;\n\n&lt;p&gt;I suggested that they look into stablecoins, as the value is not going to be volatile, and using the stablecoins to stake on an exchange platform. Speaking as a New Yorker, I think the only platforms I can get this from an exchange are Coinbase and Gemini. Coinbase offers 4% for USDC and Gemini 8.05% GUSD. &lt;/p&gt;\n\n&lt;p&gt;I mentioned how I have used Gemini the past 6 months, getting interest compounded daily and just recently had a smooth transaction withdrawing my money from staking and coming in my bank account in what takes no longer than 2 weeks. I informed OP he should do his own research as it doesn’t come without risk, as the money is not FDIC insured so of course he should not be putting ALL his money in an account like this if he is not comfortable. &lt;/p&gt;\n\n&lt;p&gt;Every time I am met with downvotes and people spreading misinformation about cryptocurrency in general. It just pisses me off how people can be so misinformed so confidently and stifling discussions. Have do you have the ignorance to boast that a .05% ‘high savings’ bank is the best offer in the market? &lt;/p&gt;\n\n&lt;p&gt;Clearly, they need to adjust however they get their information as the times are changing. I’ll keep enjoying my stablecoins gains. :)&lt;/p&gt;\n\n&lt;p&gt;TLDR - &lt;a href=\"/r/personalfinance\"&gt;r/personalfinance&lt;/a&gt; hates crypto, as does 99% of all subs on Reddit&lt;/p&gt;\n\n&lt;p&gt;Edit: I violated the rules on &lt;a href=\"/r/personalfinance\"&gt;r/personalfinance&lt;/a&gt; and I shouldn’t be shilling people on volatile suggestions when there are risk free options. I appreciate the discussion in the comments as we only get to learn when we discuss.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/set3u1/rpersonalfinance_continues_to_downvote_any/",
  "subreddit": "CryptoCurrency",
  "id": "set3u1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve posted 2 comments on separate occasions where OP has let’s say over $10k\nand wants their money to earn interest over time, while also being liquid if\nthey ever need it.\n\nI suggested that they look into stablecoins, as the value is not going to be\nvolatile, and using the stablecoins to stake on…"
}