{
  "author": "Neymar11rose",
  "original_created_utc": 1643383104,
  "title": "r/personalfinance continues to downvote any comments I make about staking stablecoins on exchanges for better returns than HYSA for banks. Some posts even lead to deletion for ‘rule breaking’",
  "created_utc": 1643409445,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve posted 2 comments on separate occasions where OP has let’s say over $10k and wants their money to earn interest over time, while also being liquid if they ever need it.&lt;/p&gt;\n\n&lt;p&gt;I suggested that they look into stablecoins, as the value is not going to be volatile, and using the stablecoins to stake on an exchange platform. Speaking as a New Yorker, I think the only platforms I can get this from an exchange are Coinbase and Gemini. Coinbase offers 4% for USDC and Gemini 8.05% GUSD. &lt;/p&gt;\n\n&lt;p&gt;I mentioned how I have used Gemini the past 6 months, getting interest compounded daily and just recently had a smooth transaction withdrawing my money from staking and coming in my bank account in what takes no longer than 2 weeks. I informed OP he should do his own research as it doesn’t come without risk, as the money is not FDIC insured so of course he should not be putting ALL his money in an account like this if he is not comfortable. &lt;/p&gt;\n\n&lt;p&gt;Every time I am met with downvotes and people spreading misinformation about cryptocurrency in general. It just pisses me off how people can be so misinformed so confidently and stifling discussions. Have do you have the ignorance to boast that a .05% ‘high savings’ bank is the best offer in the market? &lt;/p&gt;\n\n&lt;p&gt;Clearly, they need to adjust however they get their information as the times are changing. I’ll keep enjoying my stablecoins gains. :)&lt;/p&gt;\n\n&lt;p&gt;TLDR - &lt;a href=\"/r/personalfinance\"&gt;r/personalfinance&lt;/a&gt; hates crypto, as does 99% of all subs on Reddit&lt;/p&gt;\n\n&lt;p&gt;Edit: I violated the rules on &lt;a href=\"/r/personalfinance\"&gt;r/personalfinance&lt;/a&gt; and I shouldn’t be shilling people on volatile suggestions when there are risk free options. I appreciate the discussion in the comments as we only get to learn when we discuss.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/set3u1/rpersonalfinance_continues_to_downvote_any/",
  "subreddit": "CryptoCurrency",
  "id": "set3u1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve posted 2 comments on separate occasions where OP has let’s say over $10k\nand wants their money to earn interest over time, while also being liquid if\nthey ever need it.\n\nI suggested that they look into stablecoins, as the value is not going to be\nvolatile, and using the stablecoins to stake on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、2つのコメントを別々の機会に投稿しました。\nので、長期的に利息を得ることができ、かつ流動性のある資金を望んでいます。\n必要な時に必要な分だけ\n\n私は、価値が変動しない安定したコインを検討することを提案しました。\n安定したコインで賭け事をする...。",
      "title": "r/personalfinanceは、銀行向けのHYSAよりも取引所向けの安定したコインを賭ける方が良いという私のコメントに対して、ダウンボートを続けています。いくつかの投稿は、「ルール違反」を理由に削除されることさえある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经在不同的场合发表了2条评论，比如说OP有超过1万美元的资金\n并希望他们的钱能随着时间的推移赚取利息，同时也能在他们需要时保持流动性。\n他们曾经需要它。\n\n我建议他们研究一下稳定币，因为其价值不会是\n我建议他们研究一下稳定币，因为价值不会波动，并使用稳定币作为赌注...",
      "title": "r/personalfinance继续对我关于在交易所押注稳定币以获得比银行的HYSA更好的回报的任何评论进行降权。有些帖子甚至因为 \"违反规则 \"而被删除。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經在不同的場合發表了2條評論，比如說OP有超過1萬美元的資金\n並希望他們的錢能隨着時間的推移賺取利息，同時也能在他們需要時保持流動性。\n他們曾經需要它。\n\n我建議他們研究一下穩定幣，因爲其價值不會是\n我建議他們研究一下穩定幣，因爲價值不會波動，並使用穩定幣作爲賭注...",
      "title": "r/personalfinance繼續對我關於在交易所押注穩定幣以獲得比銀行的HYSA更好的回報的任何評論進行降權。有些帖子甚至因爲 \"違反規則 \"而被刪除。"
    }
  ]
}