{
  "author": "CaliginousPickle",
  "original_created_utc": 1652166349,
  "title": "How do I stop 'mansplaining'",
  "created_utc": 1652186478,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I am 16M and I have adhd. Unfortunately that comes with info dumping on people. I genuinely do not have ill intention, I get excited about certain facts and I want to share them with everyone and I do this regardless of gender, if you got ears and will listen, I will tell you all about flamingos or what temperature neon tetras need. However that has led my sister to say that I am mansplaining all the time. I don&amp;#39;t think that its mansplaining as I am not being condescending or telling a woman about her body but she says it is. What do I do to stop doing this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/umcqwi/how_do_i_stop_mansplaining/",
  "subreddit": "NoStupidQuestions",
  "id": "umcqwi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I am 16M and I have adhd. Unfortunately that comes with info dumping on\npeople. I genuinely do not have ill intention, I get excited about certain facts\nand I want to share them with everyone and I do this regardless of gender, if\nyou got ears and will listen, I will tell you all about flamingos…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、私は16Mと私はadhdを持っています。残念なことに、それは人々に情報ダンプを付属しています。\n人。私は純粋に悪意を持っていない、私は特定の事実に興奮し、みんなと共有したいと思います。\nと私は皆とそれらを共有したいと私は性別に関係なく、これを行う場合は、悪意はありません。\nフラミンゴのことなら何でも話すよ。",
      "title": "マンスプレイニング」をやめるにはどうしたらいいか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年16岁，我有Adhd。不幸的是，这与信息倾销有关\n人。我真的没有恶意，我对某些事实感到兴奋\n我想与大家分享这些事实，我这样做是不分性别的。\n如果你有耳朵并且愿意听，我会告诉你所有关于火烈鸟的事情......",
      "title": "我怎样才能停止 \"男人说\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年16歲，我有Adhd。不幸的是，這與信息傾銷有關\n人。我真的沒有惡意，我對某些事實感到興奮\n我想與大家分享這些事實，我這樣做是不分性別的。\n如果你有耳朵並且願意聽，我會告訴你所有關於火烈鳥的事情......",
      "title": "我怎樣才能停止 \"男人說\"？"
    }
  ]
}