{
  "author": "slayerk12",
  "the_new_excerpt": "Monero is a well designed coin with inherent real world value, arguably one of\nthe best cryptocurrencies, and yet it doesn’t get talked about a whole lot. Now\nthat Monero just hit an ATH, I’m hoping that will start to change!\n\nIf you haven’t considered adding Monero to your portfolio, do yourself a…",
  "original_created_utc": 1620380530,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "モネロは、本質的な実世界の価値を持つ、よく設計されたコインで、間違いなく最高の暗号通貨の一つです。\n最高の暗号通貨の一つであるにもかかわらず、あまり話題になっていません。今\nモネロがATHになったことで、その状況が変わることを期待しています。\n\nもしあなたがまだMoneroをポートフォリオに加えることを検討していないのであれば、あなた自身のためにも...。",
      "title": "MoneroがATHに到達しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Monero是一个精心设计的硬币，具有内在的现实价值，可以说是最好的加密货币之一。\n可以说是最好的加密货币之一，但它并没有被大量谈论。现在\n我希望这种情况会开始改变\n\n如果你还没有考虑将Monero加入你的投资组合，那就为你自己做一件事吧。",
      "title": "Monero刚刚达到其ATH值!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Monero是一個精心設計的硬幣，具有內在的現實價值，可以說是最好的加密貨幣之一。\n可以說是最好的加密貨幣之一，但它並沒有被大量談論。現在\n我希望這種情況會開始改變\n\n如果你還沒有考慮將Monero加入你的投資組合，那就爲你自己做一件事吧。",
      "title": "Monero剛剛達到其ATH值!"
    }
  ],
  "title": "Monero just hit its ATH!",
  "created_utc": 1620401967,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Monero is a well designed coin with inherent real world value, arguably one of the best cryptocurrencies, and yet it doesn’t get talked about a whole lot. Now that Monero just hit an ATH, I’m hoping that will start to change! </p>\n\n<p>If you haven’t considered adding Monero to your portfolio, do yourself a favor and research it well. You will see that Monero has great potential. If you already own some xmr, spread the word and teach people about the value of Monero. Even though it just hit an ATH, many still consider Monero to be very undervalued and there’s a ton of room for growth!</p>\n</div><!-- SC_ON -->",
  "score": 522,
  "permalink": "/r/CryptoCurrency/comments/n6uq64/monero_just_hit_its_ath/",
  "subreddit": "CryptoCurrency",
  "id": "n6uq64",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988846
}