{
  "author": "commiespaceinvader",
  "the_new_excerpt": "A couple of days ago just before the United States inaugurated their new\npresident – on Martin Luther King Day no less –, the old administration\npublished a particular piece of writing: The 1776 Commission report. Partly\nconceived as a response to the New York Times’ 1619 Project, the COmmission…",
  "original_created_utc": 1611583743,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几天前，就在美国就职前，他们的新的。\n在马丁-路德-金纪念日的时候，旧政府的\n发表了某篇文章。1776年委员会的报告 部分\n作为对《纽约时报》1619计划的回应，委员会... ...",
      "title": "周一方法：历史与民族主义议程（或：为什么1776年委员会的报告是垃圾？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天前，就在美國就職前，他們的新的。\n在馬丁-路德-金紀念日的時候，舊政府的\n發表了某篇文章。1776年委員會的報告 部分\n作爲對《紐約時報》1619計劃的迴應，委員會... ...",
      "title": "週一方法：歷史與民族主義議程（或：爲什麼1776年委員會的報告是垃圾？"
    }
  ],
  "title": "Monday Methods: History and the nationalist agenda (or: why the 1776 Commission report is garbage)",
  "created_utc": 1611599702,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A couple of days ago just before the United States inaugurated their new president – on Martin Luther King Day no less –, the old administration published a particular piece of writing: The 1776 Commission report. Partly conceived as a response to the New York Times’ 1619 Project, the COmmission was to provide a rather expansive view of American history from a “patriotic perspective”.</p>\n\n<p>The report was blasted by actual historians. “This report skillfully weaves together myths, distortions, deliberate silences, and both blatant and subtle misreading of evidence to create a narrative and an argument that few respectable professional historians, even across a wide interpretive spectrum, would consider plausible, never mind convincing”, said James Grossman, Executive Director of the American Historical Association.</p>\n\n<p>While the 1776 Commission Report is a particularly blatant example of what can be best described as nationalist entrepreneurship – more on that later – and additionally one that will soon be relegated to the dustbin of history where it belongs. It is, however, far from the only such endeavor and unlike this very blatant attempt, other such abuses of history can be more subtle.</p>\n\n<p>What we are, who we are, and what we – with who that “we” is, is included in the malleable factors here – collectively stand for are things that change, indeed must change, as part of a larger political and social process. Identity is not primordial – what it means to be American, German, Chinese or Ghanian is not unchanging, eternal or predetermined.</p>\n\n<p>Reflecting on the conflicts of the 1990s, specifically Rwanda and Yugoslavia, sociologist Rogers Brubaker published his book <strong>Ethnicity without Groups</strong> in 2004. In it, Brubaker reflects on an element that is constituent to these conflicts, is driving them and plays a huge part in how they are reflected inmedia and scholarships: The idea of the group. He writes:</p>\n\n<blockquote>\n<p>&quot;Group&quot; functions as a seemingly unproblematic, taken-for-granted concept (...) As a result, we tend to take for granted not only the concept &quot;group&quot;, but also &quot;groups&quot; – the putative things-in-the-world to which the concept refers. (...) This is what I will call groupism: the tendency to take discrete, sharply differentiated, internally homogeneous and externally bounded groups as basic constituents of social conflicts, and fundamental units of social analysis. In the domain of ethnicity, nationalism, and race, I mean by &quot;groupism&quot; the tendency to treat ethnic groups, nations and races as substantial entities to which interest and agency can be attributed.</p>\n</blockquote>\n\n<p>What he argues for is that we need to understand such categories as ethnic or other groupist terms as something invoked and constructed by historical actors. It is these actors who cast ethnic, racial or national groups as the protagonists of conflict, of struggle. In fact, these categories, while essential to the actors casting them, referencing them, are in themselves a construct, a performance.</p>\n\n<p>Brubaker:</p>\n\n<blockquote>\n<p>Ethnicity, race, and nation should be conceptualized not as substances or things or entities or collective individuals – as the imagery of discrete, concrete, tangible, bounded and enduring &quot;groups&quot; encourages us to do – but rather in relational, processual, dynamic, and disaggregated terms. This means thinking of ethnicity, race, and nation not in terms of substantial groups or entities but in terms of practical categories, cultural idioms, cognitive schemas, discursive frames, organized routines, institutional forms, political projects and cognitive events. It means thinking of ethnicization, racialization and nationalization as political, social, cultural and psychological processes.</p>\n</blockquote>\n\n<p>According to Burbaker, it is not just us all as a collective society that engage in this process of defining and re-defining these practical categories, cultural idioms etc. that define our groups, whether we want to or not. There are also distinct groups of people who deliberately engage in shaping the terms and dynamics that define them. Brubaker calls them “ethnopolitical entrepreneurs”. The biggest of these “ethnopolitical entrepreneurs” as well as the biggest target of other such ethnopolitical entrepreneurs is always the state. For the state shapes the most important and popular narratives that all people come in contact with through school education, and often most importantly history education. For unlike the future, which we do not know, history we do know and it therefore becomes our reference point when we want to define who we are and how we are.</p>\n\n<p>Some time ago I have written about <a href=\"https://old.reddit.com/r/AskHistorians/comments/6v1yj5/monday_methods_collective_memory_or_lets_talk/\">collective memory</a>, which according to German historian Aleida Assmann is specifically not like individual memory. Institutions, societies, etc. have no memory akin to the individual memory because they obviously lack any sort of biological or naturally arisen base for it. Instead institutions like a state, a nation, a society, a church or even a company create their own memory using signifiers, signs, texts, symbols, rites, practices, places and monuments. These creations are not like a fragmented individual memory but are done willfully, based on thought out choice, and also unlike individual memory not subject to subconscious change but rather told with a specific story in mind that is supposed to represent an essential part of the identity of the institution and to be passed on and generalized beyond its immediate historical context. It&#39;s intentional and constructed symbolically.</p>\n\n<p>Interventions in this social and political field – and nothing else is the 1776 Commission Report – are oftentimes not exactly exercises to engage in historical scholarship – to contribute to a discussion of how to better understand the past and to analyze it. Rather, these are attempts at shaping our understanding of who we are today by portraying our collective past in a certain, intentional and constructed manner.</p>\n\n<p>While these always happen to some degree, it is noticeable that those ethnonationalist entrepreneurs with a specifically nationalist agenda tend to often completely eschew both the findings and the best practices and methodology of historical research. Unlike those who engage in these processes to be more critical of how we currently define ourselves and make who we are more inclusive, those who seek to glorify current groupist notions and to gatekeep their conceptions have a greater need for historical narratives that are neat, tidy, heroic and uncomplicated – narratives that by these very designs cannot fit with good historical scholarship that always leads to a picture that is more difficult, complicated, and less easy than it originally appears.</p>\n\n<p>Beware those who want to present you with these easy, heroic und uncomplicated narratives where an ethnicity, a group, a nation or a race has always been a bastion of freedom ro culture or progress or civilization because not only will that most likely rely on very bad history behind it, it will also most often include the unspoken follow-up “and that’s why they need to rule over and dominate others”.</p>\n</div><!-- SC_ON -->",
  "score": 1449,
  "permalink": "/r/AskHistorians/comments/l4ojme/monday_methods_history_and_the_nationalist_agenda/",
  "subreddit": "AskHistorians",
  "id": "l4ojme",
  "is_self": true,
  "media": null,
  "is_video": false
}