{
  "author": "Grace_Bedell",
  "the_new_excerpt": "Hon D Day-Lewis\n\nDear sir,\n\nI have just come from the theater, where they are showing the moving picture\nshow about Mr. Lincoln and the War. I am a little girl only 11 years old, but\nwant you should win an Academy Award very much, so I hope you won't think me\nvery bold to write to such a great man…",
  "original_created_utc": 1617278557,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "戴-刘易斯先生\n\n亲爱的先生，\n\n我刚从剧院出来，他们在那里放映动态电影\n关于林肯先生和战争的节目。我是一个只有11岁的小女孩，但是...\n我很想让你获得奥斯卡奖，所以我希望你不要把我当作\n大胆地给这样的伟人写信... ...",
      "title": "评论]丹尼尔-戴-刘易斯演林肯先生太帅了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "戴-劉易斯先生\n\n親愛的先生，\n\n我剛從劇院出來，他們在那裏放映動態電影\n關於林肯先生和戰爭的節目。我是一個只有11歲的小女孩，但是...\n我很想讓你獲得奧斯卡獎，所以我希望你不要把我當作\n大膽地給這樣的偉人寫信... ...",
      "title": "評論]丹尼爾-戴-劉易斯演林肯先生太帥了。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "Hon D Day-Lewis\n\n親愛なる皆様へ\n\n私は今、劇場でリンカーンと戦争についての映画を上映しているところです。\n私は今、劇場から来ました。私はまだ11歳の少女です。\nあなたがアカデミー賞を受賞することを強く望んでいます。\nそのような偉大な人に手紙を書くのはとても大胆なことだと思わないでほしいです...。",
      "title": "レビュー】ダニエル・デイ＝ルイスはリンカーン氏を演じるにはあまりにもハンサムすぎる。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "Hon D Day-Lewis\n\n親愛なる皆様へ\n\n私は今、劇場でリンカーンと戦争についての映画を上映しているところです。\n私は今、劇場から来ました。私はまだ11歳の少女です。\nあなたがアカデミー賞を受賞することを強く望んでいます。\nそのような偉大な人に手紙を書くのはとても大胆なことだと思わないでほしいです...。",
      "title": "レビュー】ダニエル・デイ＝ルイスはリンカーン氏を演じるにはあまりにもハンサムすぎる。"
    }
  ],
  "title": "[Review]Daniel Day-Lewis is far too handsome to play Mr. Lincoln",
  "created_utc": 1617296945,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hon D Day-Lewis</p>\n\n<p>Dear sir,</p>\n\n<p>I have just come from the theater, where they are showing the moving picture show about Mr. Lincoln and the War. I am a little girl only 11 years old, but want you should win an Academy Award very much, so I hope you won&#39;t think me very bold to write to such a great man as you are. Have you any little girls about as large as I am? If so, give them my love and tell her to write to me if you cannot answer this letter. I have yet got four brothers and part of them will go and see your moving picture anyway, and if you were to make your face more hideous, I will try and get the rest of them to see it as well. You would look a great deal more like Mr. Lincoln for your face is so grand and handsome. All the ladies like your face, and as sure as spring follows winter they can&#39;t abide Mr. Lincoln&#39;s physiognomy, with his high forehead over those sadly pathetic eyes, the angular lower face with the deep cut lines about the mouth. He would look better if he wore whiskers, for his face is so thin. All the ladies like whiskers.</p>\n\n<p>I have got a little baby sister. She is nine weeks old and is just as cunning as can be. I must not write any more. Answer this letter right off. Good bye.</p>\n\n<p>Grace Bedell</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/mhtsfx/reviewdaniel_daylewis_is_far_too_handsome_to_play/",
  "subreddit": "AskHistorians",
  "id": "mhtsfx",
  "is_self": true,
  "media": null,
  "is_video": false
}