{
  "author": "passerboi",
  "original_created_utc": 1640535470,
  "title": "Are there any other guys like me who like to watch sensual porn?",
  "created_utc": 1640557745,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of media portrays that only girls like sensual stuff with stories about how a guy approaches her and courts her etc. Well, I like that too, not the straight up &lt;em&gt;wam bam thank you mam&lt;/em&gt; bullshit. As in, I loved the fifty shades series. I mean, I would like to be such a guy who knows how to handle his partner.&lt;/p&gt;\n\n&lt;p&gt;So, is this weird?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/rp00kg/are_there_any_other_guys_like_me_who_like_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "rp00kg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of media portrays that only girls like sensual stuff with stories about\nhow a guy approaches her and courts her etc. Well, I like that too, not the\nstraight up wam bam thank you mam bullshit. As in, I loved the fifty shades\nseries. I mean, I would like to be such a guy who knows how to handle…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くのメディアは、女の子だけが官能的なものを好むというストーリーを描いています。\n男からのアプローチや求愛の仕方など。まあ、それも好きなんだけどね、じゃなくて\nワムバムサンキューマムのストレートな戯言。フィフティ・シェイズが大好きです。\nシリーズです。というか、そんな扱い方を知っている男になりたい...。",
      "title": "僕みたいに官能的なAVを見るのが好きな男って他にもいるんでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多媒体描绘的是只有女孩喜欢性感的东西，讲述的是\n一个男人如何接近她和追求她等等。好吧，我也喜欢这样，而不是那种\n我也喜欢这样的故事，而不是直截了当的 \"谢谢你，妈妈 \"的废话。就像，我喜欢《五十度阴影》系列。\n系列。我的意思是，我想成为这样的人，知道如何处理......",
      "title": "是否有其他像我这样喜欢看感官色情片的人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多媒體描繪的是隻有女孩喜歡性感的東西，講述的是\n一個男人如何接近她和追求她等等。好吧，我也喜歡這樣，而不是那種\n我也喜歡這樣的故事，而不是直截了當的 \"謝謝你，媽媽 \"的廢話。就像，我喜歡《五十度陰影》系列。\n系列。我的意思是，我想成爲這樣的人，知道如何處理......",
      "title": "是否有其他像我這樣喜歡看感官色情片的人？"
    }
  ]
}