{
  "author": "DaVirus",
  "original_created_utc": 1634638377,
  "title": "Unpopular Opinion: the NFT space is so degenerate that it risks killing the tech before any real application is adopted",
  "created_utc": 1634658225,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been watching this space with a lot of interest, even though I am not invested myself. I see the potential of Non-fungibility in things like property, deeds, debt issuing.<br/>\nBut all it is being used for right now is, realistically, proof of concept with all this art stuff. And it is spilling to the mainstream, this is bad.<br/>\nFrom the reaction people have been having to it, the majority think it&#39;s either a scam or the new Beanie Babies, without any concept of what the tech actually can do.<br/>\nI am afraid that if this growth phase ruins the image of the NFT tech, we will never see it implemented in the cases where it would be incredible.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/qb8fvo/unpopular_opinion_the_nft_space_is_so_degenerate/",
  "subreddit": "CryptoCurrency",
  "id": "qb8fvo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been watching this space with a lot of interest, even though I am not\ninvested myself. I see the potential of Non-fungibility in things like property,\ndeeds, debt issuing.\nBut all it is being used for right now is, realistically, proof of concept with\nall this art stuff. And it is spilling to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私自身は投資をしていませんが、この分野には興味を持って見ています。\n私自身は投資をしていませんが 私は、財産、証書、債務の発行などの分野で、Non-fungibilityの可能性を感じています。\n債券発行などにも可能性を感じています。\nしかし、今のところ使用されているのは、現実的には、このような芸術的なもののコンセプトの証明です。\nこの芸術的なものすべてにです。そして、それは...にも波及しています。",
      "title": "人気のない意見：NFT空間は非常に退廃的であり、実際のアプリケーションが採用される前に技術を殺してしまう危険性がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直饶有兴趣地关注着这个空间，尽管我自己并没有投资。\n自己的投资。我看到了在财产等方面的不可伪造性的潜力。\n契约，债务发行。\n但是，从现实的角度看，它现在被用于证明概念的所有这些艺术作品。\n所有这些艺术的东西。而且，它正在蔓延到...",
      "title": "不受欢迎的观点：NFT空间是如此堕落，以至于有可能在任何真正的应用被采用之前就扼杀这项技术。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直饒有興趣地關注着這個空間，儘管我自己並沒有投資。\n自己的投資。我看到了在財產等方面的不可僞造性的潛力。\n契約，債務發行。\n但是，從現實的角度看，它現在被用於證明概念的所有這些藝術作品。\n所有這些藝術的東西。而且，它正在蔓延到...",
      "title": "不受歡迎的觀點：NFT空間是如此墮落，以至於有可能在任何真正的應用被採用之前就扼殺這項技術。"
    }
  ]
}