{
  "author": "Traditional-Eagle191",
  "original_created_utc": 1647874241,
  "title": "Does anyone else find being single pretty addictive?",
  "created_utc": 1647894155,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 29 now, and for almost all of my adult life I&amp;#39;ve been in relationships, or involved with someone on some level. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m coming up on a year completely single now, no dating, no fwb, nothing. And I&amp;#39;ve never felt better emotionally. My business is thriving and I&amp;#39;ve taken huge steps forward since I decided to focus on myself. &lt;/p&gt;\n\n&lt;p&gt;Being alone has become a bit addictive for me and it makes me feel a little nauseous thinking of being close to someone and having them in my personal space again. &lt;/p&gt;\n\n&lt;p&gt;Has anyone else experienced this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/tjdjpy/does_anyone_else_find_being_single_pretty/",
  "subreddit": "NoStupidQuestions",
  "id": "tjdjpy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I'm 29 now, and for almost all of my adult life I've been in relationships, or\ninvolved with someone on some level.\n\nI'm coming up on a year completely single now, no dating, no fwb, nothing. And\nI've never felt better emotionally. My business is thriving and I've taken huge\nsteps forward since I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今29歳ですが、成人してからのほぼすべての期間、交際、または\n誰かと何らかの形で関わっている。\n\n今、完全に独身で1年が経とうとしています。デートもFWも何もありません。そして\n精神的に楽なのは初めてです。仕事も順調で、大きな成長を遂げました。\n一歩前進しました。",
      "title": "独身って結構中毒性があると思う人いる？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在29岁了，几乎在我所有的成年生活中，我都有过关系，或在某种程度上与某人有关系。\n与某人有某种程度的关系。\n\n我现在已经完全单身一年了，没有约会，没有未婚妻，什么都没有。而且\n我从来没有在情感上感觉这么好过。我的事业蒸蒸日上，我已经采取了巨大的\n自从我...",
      "title": "还有人觉得单身很容易上瘾吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在29歲了，幾乎在我所有的成年生活中，我都有過關係，或在某種程度上與某人有關係。\n與某人有某種程度的關係。\n\n我現在已經完全單身一年了，沒有約會，沒有未婚妻，什麼都沒有。而且\n我從來沒有在情感上感覺這麼好過。我的事業蒸蒸日上，我已經採取了巨大的\n自從我...",
      "title": "還有人覺得單身很容易上癮嗎？"
    }
  ]
}