{
  "author": "RefugeeDutch_Syrian",
  "original_created_utc": 1645560820,
  "title": "Bitcoin wallet maker gets order from Canada to \"freeze\" wallets",
  "created_utc": 1645587281,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The situation in Canada is interesting for the crypto community. Namely, it shows how a government deals with cryptocurrencies like bitcoin (BTC) in a situation where it is trying to seize financial resources. And in recent days it became clear that Canadian authorities are not so sure what to do with it!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Canada is on the heels of truckers and supporters&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In Canada, a large group of truckers protested for a long time by blocking cities, border crossings and bridges with their trucks. The action could count on quite some support in Canada and worldwide. The truckers received many donations, also in the form of crypto. After Prime Minister Justin Trudeau activated the controversial and draconian Emergencies Act, authorities were able to freeze bank accounts and obtain data without the intervention of a judge. This is to deal with the support and consequences of the protest.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Freezing Bitcoin Wallets&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So in recent days there have been plenty of articles in crypto news about how Canadian authorities are going after the truckers. But remarkably, they don&amp;#39;t seem to fully understand how crypto works. Nunchuk, a wallet developer recently received an order from the Ontario Superior Court of Justice to &amp;quot;freeze&amp;quot; bitcoin wallets of truckers and &amp;quot;release data.&amp;quot; Such actions are obviously impossible for a wallet developer. In a response, Nunchuk let the court know:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;We do not collect user identification information other than email addresses. We also do not have keys. Therefore, we cannot &amp;quot;freeze&amp;quot; our users&amp;#39; assets. We cannot &amp;quot;prevent&amp;quot; them from being moved. We have no knowledge of &amp;quot;the existence, nature, value and location&amp;quot; of our users&amp;#39; assets. This is by design.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/v6gyr02lzfj81.png?width=588&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2efad357efd1325441c51876beedd8ad958bbd34\"&gt;https://preview.redd.it/v6gyr02lzfj81.png?width=588&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2efad357efd1325441c51876beedd8ad958bbd34&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If one has bitcoin in one&amp;#39;s own wallet, no one can access it unless they have access to the private key. Keep this private key safe at all times and do not share it with anyone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/syx42w/bitcoin_wallet_maker_gets_order_from_canada_to/",
  "subreddit": "CryptoCurrency",
  "id": "syx42w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The situation in Canada is interesting for the crypto community. Namely, it\nshows how a government deals with cryptocurrencies like bitcoin (BTC) in a\nsituation where it is trying to seize financial resources. And in recent days it\nbecame clear that Canadian authorities are not so sure what to do…"
}