{
  "author": "Mekayv",
  "original_created_utc": 1628886478,
  "title": "My daughter is dating a douche-bag",
  "created_utc": 1628894082,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know where I messed up, I thought I taught her well on what to look for in a man.</p>\n\n<p>The guy just showed up at my house and starting rambling on about how DCAing 30 dollars in 4 months into Safemoon helped him understand finance and geopolitics. I told him he was completely oblivious about being in a ponzi, this only unchained a what I believed to be a cocaine induced speech saying that Safemoon was going to be the next Bitcoin and he was going to moon while buying <em>&quot;lambos&quot;</em> for his friends because he was no <em>&quot;Bitch-ass paperhands&quot;</em>. </p>\n\n<p>I&#39;m a bank executive, so you can only imagine what a nightmare this is for me.</p>\n\n<p>Don&#39;t know what the point of this post is, is not like my daughter is going to stop dating that idiot anyways. I&#39;m scared about my daughter&#39;s future.</p>\n\n<p>Sorry,  I needed to vent.</p>\n</div><!-- SC_ON -->",
  "score": 2971,
  "permalink": "/r/CryptoCurrency/comments/p3tff2/my_daughter_is_dating_a_douchebag/",
  "subreddit": "CryptoCurrency",
  "id": "p3tff2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know where I messed up, I thought I taught her well on what to look for\nin a man.\n\nThe guy just showed up at my house and starting rambling on about how DCAing 30\ndollars in 4 months into Safemoon helped him understand finance and geopolitics.\nI told him he was completely oblivious about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はどこで失敗したのかわかりません。私は彼女に、男性に何を求めるべきかをよく教えたつもりでした。\nよく教えたつもりだったのに\n\nその男は私の家に現れて、4ヶ月で30ドルをSafemoonに投入したことで、金融や地政学を理解できるようになったと、べらべらしゃべり始めました。\n金融と地政学を理解するために、4ヶ月で30ドルをSafemoonに投入したことについて話し始めました。\n私は彼に、彼は完全に忘れていると言った...",
      "title": "私の娘はDouche-Bagと付き合っている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道我在哪里搞砸了，我以为我把她教得很好，告诉她应该找什么样的人\n的男人。\n\n这家伙突然出现在我家里，开始喋喋不休地谈论如何在4个月内向Safemoon投资30美元的DCA\n4个月内向Safemoon投资30美元，帮助他了解金融和地缘政治。\n我告诉他，他完全无视...",
      "title": "我的女儿正在和一个傻逼约会"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道我在哪裏搞砸了，我以爲我把她教得很好，告訴她應該找什麼樣的人\n的男人。\n\n這傢伙突然出現在我家裏，開始喋喋不休地談論如何在4個月內向Safemoon投資30美元的DCA\n4個月內向Safemoon投資30美元，幫助他了解金融和地緣政治。\n我告訴他，他完全無視...",
      "title": "我的女兒正在和一個傻逼約會"
    }
  ]
}