{
  "author": "Shartin117",
  "original_created_utc": 1626271302,
  "title": "I’m a Norse Jarl. I want to raid and pillage some English villages across the sea. How many men do I need?",
  "created_utc": 1626288436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, its 867 and I’m itching to acquire some thralls, and some wealth overall for my village. I want to visit this exotic land of England. How many guys am I bringing with me to make this journey? What kind of resistance am I anticipating? (Assume I’m avoiding the Great Heathen Army and I’m not apart of that escapade).</p>\n\n<p>I’m asking because in the Amon Amarth song “Gods of War Arise”, the singer claims they only need fifty men to take a village, and very few people resist. Most of the villagers end up enthralled (literally) but some fight. On the other hand, in games like Crusader Kings you need hundreds of men to besiege a town down.</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/AskHistorians/comments/ok4yyd/im_a_norse_jarl_i_want_to_raid_and_pillage_some/",
  "subreddit": "AskHistorians",
  "id": "ok4yyd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, its 867 and I’m itching to acquire some thralls, and some wealth overall for\nmy village. I want to visit this exotic land of England. How many guys am I\nbringing with me to make this journey? What kind of resistance am I\nanticipating? (Assume I’m avoiding the Great Heathen Army and I’m not apart…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "867年、私はいくつかのスロールと村全体の富を手に入れたくてたまりません。\n私の村のために。異国の地、イギリスに行ってみたい。何人の男を連れて行けば\n何人連れて行けばいいんだ？どのような抵抗があるのか\nどんな抵抗があるだろう？(私が大異教徒の軍隊を避けていると仮定して、私は離れていない...。",
      "title": "私は北欧のジャールです。海の向こうのイギリスの村を 襲撃して略奪したいんだ 何人の兵士が必要ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，现在是867年，我迫不及待地想为我的村庄获得一些王族，和一些财富。\n我的村庄的一些财富。我想去英国这个异国他乡看看。我要带多少人\n带着多少人去旅行？我预计会遇到什么样的阻力？\n预计的阻力？(假设我避开了伟大的异教徒军队，而且我没有分开......）。",
      "title": "我是一个北欧伯爵。我想突袭和掠夺海对面的一些英国村庄。我需要多少人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，現在是867年，我迫不及待地想爲我的村莊獲得一些王族，和一些財富。\n我的村莊的一些財富。我想去英國這個異國他鄉看看。我要帶多少人\n帶着多少人去旅行？我預計會遇到什麼樣的阻力？\n預計的阻力？(假設我避開了偉大的異教徒軍隊，而且我沒有分開......）。",
      "title": "我是一個北歐伯爵。我想突襲和掠奪海對面的一些英國村莊。我需要多少人？"
    }
  ]
}