{
  "author": "Turtlesaur",
  "the_new_excerpt": "Why is energy still the play and why will it let you retire in the few years?\n\nGeneral: During a recession energy consumption always decreases relatively, and\neven more so with Covid, due to lack of office spaces, lack of recreation, and\nlack of travel / commute. You can look back at the ‘08 ‘09…",
  "original_created_utc": 1612799030,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "能源为什么还是戏，为什么几年后就能让你退休？\n\n一般情况下。在经济不景气的时候，能源的消耗总是相对减少的，而且\n科维德更是如此，由于缺乏办公场所，缺乏娱乐活动，以及。\n缺乏旅行/通勤。你可以回顾一下08年09年的... ...",
      "title": "为什么2021年清洁能源仍是高智商玩法？太阳能、氢能、核电。DD里面。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "能源爲什麼還是戲，爲什麼幾年後就能讓你退休？\n\n一般情況下。在經濟不景氣的時候，能源的消耗總是相對減少的，而且\n科維德更是如此，由於缺乏辦公場所，缺乏娛樂活動，以及。\n缺乏旅行/通勤。你可以回顧一下08年09年的... ...",
      "title": "爲什麼2021年清潔能源仍是高智商玩法？太陽能、氫能、核電。DD裏面。"
    }
  ],
  "title": "Why Clean energy is still the high IQ play in 2021. Solar, Hydrogen, Nuclear. DD Inside.",
  "created_utc": 1612819257,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why is energy still the play and why will it let you retire in the few years?</p>\n\n<p>General: \nDuring a recession energy consumption always decreases relatively, and even more so with Covid, due to lack of office spaces, lack of recreation, and lack of travel / commute. You can look back at the ‘08 ‘09 crisis and view how energy and c02 emissions skyrocketed after Michael Burry got famous. [1]</p>\n\n<p>Next, we have the catalysts, Joe Biden. According to his administration there are only 9 years left to stop the worst consequences of climate change. Biden will act quickly, and aggressively. He’s working with Congress to enact in 2021 legislation and plans that will put America on an irreversible path to economy wide net zero emissions. While also rallying the rest of the world to pursue clean action through leadership and action. Not really lastly, but also make $400bn as ONE part of a broad mobilization of public investment in clean energy and innovation (relatively old news, but relevant) All while creating 10,000,000 new jobs in clean energy. This is within his “Biden will make a $2 trillion accelerated investment” which also pertains to the auto industry such as EV gov vehicles, see WKHS as an example.[2][3]  </p>\n\n<p>Energy has already gone up alot this last 6 months. It&#39;s too late! False. So has everything, even giants like Apple are up over 100% since March lows.   Clean energy has been supressed these last 4 years, and are only going back to where they belong.</p>\n\n<p>Hydrogen: \nRecently Mercedes-Benz spins off it’s truck unit due to ever changing landscape in industrial and commercial vehicles. While premium sedans have largely been adopting the EV mantra, commercial trucking has seemed to go the way of hydrogen. “..while the truck business is investing in hydrogen fuel cell technology. [6] Recently Ballad power Systems $BLDP signed a deal to make the hydrogen fuel cell for hydrogen power boats as well. [7]</p>\n\n<p>Nuclear::\nNow, we have Solar, Wind, Hydrogen and what else? Well, reasonably speaking you also have Uranium to Nuclear energy. Did you know that The world has largely put most of their uranium mines on hold and in maintenance mode? Right now there are 442 Nuclear Reactors operating within 30 countries, primarily in US, France, China, Russia and Japan (rip) this consume 200 MILLION pounds in Uranium per year. We are currently sitting at a 20 million pound deficit and could reach as high as 50 million pounds.     </p>\n\n<p>Utilities have been underbuying Uranium since 2014 than they need to produce nuclear energy, the difference (or deficit) between what they are buying and what they need to produce Nuclear energy has been filled by drawdown of existing inventories. We also have Elon Musk talking about Nuclear Bull case <a href=\"https://www.youtube.com/watch?v=bKH-uVqg9OI\">https://www.youtube.com/watch?v=bKH-uVqg9OI</a> [4][5]</p>\n\n<h1>If I had to choose a single ticker from each, I would choose <strong>$FCEL</strong> for Hydrogen, <strong>$NXE</strong> for Nuclear, <strong>$ENPH</strong> for solar</h1>\n\n<p>The tides in energy have changed, we are seeing huge pushes globally to adopt these new technologies. If you rub your couple of brain cells together really hard, this shit is the future.    </p>\n\n<p>Tickers: $FCEL, $BLDP, $PLUG, $NXE, $ENPH or if you want ETFs, $TAN, $FAN, $PBW (shout out to $ICLN gang) </p>\n\n<p>Final: This was way longer and harder than I anticipated to put together. We still have Energy Storage, Wind, and I didn’t even address Solar reasons, Biofuels or NatGas. But these are my big bets for 2021. I&#39;m aware EV is beast, but so is everyone else, bringing new information to light that may be less represented. \nI&#39;ll do a part2: if you enjoy this expanding and adding extra details.</p>\n\n<p>Sources:<br/>\n[1] <a href=\"https://www.sciencedaily.com/releases/2011/12/111205140613.htm\">https://www.sciencedaily.com/releases/2011/12/111205140613.htm</a>  </p>\n\n<p>[2] <a href=\"https://joebiden.com/9-key-elements-of-joe-bidens-plan-for-a-clean-energy-revolution/\">https://joebiden.com/9-key-elements-of-joe-bidens-plan-for-a-clean-energy-revolution/</a>  </p>\n\n<p>[3] <a href=\"https://joebiden.com/clean-energy/\">https://joebiden.com/clean-energy/</a>  </p>\n\n<p>[4] <a href=\"https://josephcollinsul.medium.com/the-uranium-bull-thesis-ce6d49ebd219\">https://josephcollinsul.medium.com/the-uranium-bull-thesis-ce6d49ebd219</a>  </p>\n\n<p>[5] <a href=\"https://www.youtube.com/watch?v=bKH-uVqg9OI\">https://www.youtube.com/watch?v=bKH-uVqg9OI</a>  </p>\n\n<p>[6] <a href=\"https://apnews.com/article/technology-environment-germany-54b2b7629539b2fb8f1383b83b490c42\">https://apnews.com/article/technology-environment-germany-54b2b7629539b2fb8f1383b83b490c42</a>  </p>\n\n<p>[7] <a href=\"https://www.prnewswire.com/news-releases/ballard-introduces-fuel-cell-industrys-first-commercial-zero-emission-module-to-power-ships-301125226.html\">https://www.prnewswire.com/news-releases/ballard-introduces-fuel-cell-industrys-first-commercial-zero-emission-module-to-power-ships-301125226.html</a>  </p>\n\n<p>Positions: people are asking my positions, I&#39;m long on all this stuff in the boomerfolio. I don&#39;t have any active weeklys or options trying to pump. I&#39;m just trying to spread awareness that Alt Energy is still in it&#39;s younger stages and it&#39;s truly not too late.<br/>\nNXE 3000 @ $3.17, CCJ 1,000 @ $13.84, BLDP 750 @ $29, FCEL 2,250 @ $17.50, BE 400 @ 37.76, TAN 150 @ $114, ENPH 150 @ $212, PBW 150 @ $113, ICLN 1000 @ 28, QCLN 200 @ $80</p>\n</div><!-- SC_ON -->",
  "score": 9890,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/o2WmQ_-8zhC1f0EgBZuFbMzprRzIi62GZebefyACFLQ.jpg?auto=webp&s=c71b1490fc0a1b6c2b49811281bee673ad4bb978",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/o2WmQ_-8zhC1f0EgBZuFbMzprRzIi62GZebefyACFLQ.jpg?width=108&crop=smart&auto=webp&s=efb5cec3f03bdf38b316dc6b1a9a2cc3466dec30",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/o2WmQ_-8zhC1f0EgBZuFbMzprRzIi62GZebefyACFLQ.jpg?width=216&crop=smart&auto=webp&s=8c1f6ab2a7306af9d3ca77bffa1b37129719b61f",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/o2WmQ_-8zhC1f0EgBZuFbMzprRzIi62GZebefyACFLQ.jpg?width=320&crop=smart&auto=webp&s=4f56c9409c82701ff740635f28338d05eee2acb7",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "BTk7UQWZ_OEGGhRvD-DFcywv7gaQuFfLykN-THRgJfQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lfehiq/why_clean_energy_is_still_the_high_iq_play_in/",
  "subreddit": "wallstreetbets",
  "id": "lfehiq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123217895
}