{
  "author": "SlavikZeus",
  "original_created_utc": 1630672951,
  "title": "No one told me it's a fuc**** revolution!",
  "created_utc": 1630697517,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For years I was smoking weed and worrying about the fiat system seeing and understanding the fact that we are being owned by those who print </p>\n\n<p>Bread is not equal to 1hr of hard work or 30years of work to a house I could build myself in 2 years </p>\n\n<p>Inflation...</p>\n\n<p>Seeing this made me very worried especially that no one understood and everyone was fine with it </p>\n\n<p>I knew that gold was only solution but it was abandoned </p>\n\n<p>I&#39;ve heard about bitcoin long time ago:((( I remember watching a video how you could easily mine it on pc before it shot up in the space </p>\n\n<p>Then some silly documentary about those btc millionaires which only made me envy of their luck</p>\n\n<p>I remember I was day dreaming many times about being one of them just so I could &quot;sell it for millions&quot; </p>\n\n<p>Dumb motherfucker so am I... </p>\n\n<p>In the fall of 2019 when I was getting out of my Post acute withdrawal syndrome which lasted nearly two years I discovered bitcoin i had money coz I wasn&#39;t a drug addict anymore and decided to just buy in...\nI always wanted to have bitcoin even then when I didnt know what it was and after two months on this sub I finally found out... </p>\n\n<p>Thank you Satoshi!</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/Bitcoin/comments/ph4eh0/no_one_told_me_its_a_fuc_revolution/",
  "subreddit": "Bitcoin",
  "id": "ph4eh0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For years I was smoking weed and worrying about the fiat system seeing and\nunderstanding the fact that we are being owned by those who print\n\nBread is not equal to 1hr of hard work or 30years of work to a house I could\nbuild myself in 2 years\n\nInflation...\n\nSeeing this made me very worried…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何年もの間、私は大麻を吸いながら、フィアットシステムを見て心配していました。\n刷っている人たちに所有されているという事実を理解しました。\n\nパンは1時間の努力や30年かけて建てた家とは違います。\n2年で自分で建てられる家に30年かけて働いたことにはなりません。\n\nインフレ...。\n\nこれを見て、私はとても心配になりました...。",
      "title": "誰もfuc**** の革命だとは言ってくれなかった!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "多年来，我一直在吸食大麻，担心菲亚特系统看到并\n明白了我们被那些印钞机所拥有的事实。\n\n面包不等于1小时的努力工作或30年的工作，我可以在2年内建造一个房子\n自己在2年内建造的房子\n\n通货膨胀...\n\n看到这一点让我非常担心...",
      "title": "没有人告诉我这是一场fuc**** 革命！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多年來，我一直在吸食大麻，擔心菲亞特系統看到並\n明白了我們被那些印鈔機所擁有的事實。\n\n麪包不等於1小時的努力工作或30年的工作，我可以在2年內建造一個房子\n自己在2年內建造的房子\n\n通貨膨脹...\n\n看到這一點讓我非常擔心...",
      "title": "沒有人告訴我這是一場fuc**** 革命！"
    }
  ]
}