{
  "author": "woodchip69",
  "the_new_excerpt": "A little about myself and situation. Started off with $500 in my account,\nbrought it up to $950+/- in 2 months, mostly luck looking back at it, I didn't\nreally do my own DD at first and it bit me in the ass. I lost all my gains and\nthen some due to lack of knowledge. I FOMO bought and panic sold at…",
  "original_created_utc": 1614110737,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "介绍一下自己的情况和处境。一开始我的账户里有500元。\n在2个月内把它带到了950多美元，主要是运气好，回想起来，我没有\n真的做我自己的DD在第一 它咬我的屁股。我失去了所有的收益和\n然后一些由于缺乏知识。我FOMO买入，恐慌性卖出，在...",
      "title": "有什么好书（或书籍）来了解股市和交易？或者你推荐谁在Youtube或Twitch上观看？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "介紹一下自己的情況和處境。一開始我的賬戶裏有500元。\n在2個月內把它帶到了950多美元，主要是運氣好，回想起來，我沒有\n真的做我自己的DD在第一 它咬我的屁股。我失去了所有的收益和\n然後一些由於缺乏知識。我FOMO買入，恐慌性賣出，在...",
      "title": "有什麼好書（或書籍）來了解股市和交易？或者你推薦誰在Youtube或Twitch上觀看？"
    }
  ],
  "title": "What is a good book (or books) to learn about the stock market and trading? Or who do you recommend to watch on Youtube or Twitch?",
  "created_utc": 1614146291,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A little about myself and situation. Started off with $500 in my account, brought it up to $950+/- in 2 months, mostly luck looking back at it, I didn&#39;t really do my own DD at first and it bit me in the ass. I lost all my gains and then some due to lack of knowledge. I FOMO bought and panic sold at a loss instead of doing my research, or reading the charts/indicators prior to entering or exiting a position. I never really had a strategy, I bought stocks that were going up. I did stray away from the GME rally and other Reddit fueled stocks and never got caught up with it, I started back in early December prior  to all of it.</p>\n\n<p>Granted, the past couple weeks have been red for most of us, I haven’t panic sold like I&#39;ve done prior but I&#39;m trying to take this down time to learn more. I&#39;ve watched hours of videos from multiple people, but the thing I can&#39;t stand is that everyone is trying to push you to &quot;join my class or group for the small price of $xxx.xx&quot; so I don&#39;t really know who is good to follow or what is a good place to research as 90% of them are trying to sell their product. I&#39;ve been watching active traders on Twitch and YouTube live recently and honestly have learned more by just watching them and how they navigate daily. </p>\n\n<p>The past month I&#39;ve been a lot more cautious, realized that I don’t have to trade real money every day and have been paper trading with some success. I make a decent living for myself at the age of 27 with two kids and a wife, but I&#39;m sure as hell tired of this job away from my family. In 5 years I&#39;d like to be in a position to do this daily as my main source of income and work from home.</p>\n\n<p>The stock market is addicting, all I can say is that after losing my gains due to lack of knowledge it has only fueled me more to dig deep into this shit, put the work in and learn correctly, do my research, and become a full time trader one day. As stated in the title, if anyone has recommendations on individuals to watch, or books to read please pass them on.</p>\n\n<p>Also if you&#39;ve joined one of the classes or groups for the fees listed, who did you choose? And was it worth your investment? A small yes or no with reason would be appreciated.</p>\n\n<p>If you&#39;ve made it this far, thank you for your time.</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/stocks/comments/lqrn18/what_is_a_good_book_or_books_to_learn_about_the/",
  "subreddit": "stocks",
  "id": "lqrn18",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332886312
}