{
  "author": "BlackMarketMtnDew",
  "original_created_utc": 1638550904,
  "title": "Did Native Americans make it to Europe before 1492?",
  "created_utc": 1638581529,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I read an account where Christopher Columbus talked about men and women from Cathay of extraordinary appearance washing up dead (I read another account that they were alive) on two logs (probably canoes) in Galway in 1477 in the book “God’s Shadow” by Alan Mikhail. The author then goes on to casually say that this happened with some regularity across Europe and Africa but doesn’t go into detail. Did this actually happen and are there other accounts of it from Europeans or Africans?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/AskHistorians/comments/r83p5q/did_native_americans_make_it_to_europe_before_1492/",
  "subreddit": "AskHistorians",
  "id": "r83p5q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I read an account where Christopher Columbus talked about men and women from\nCathay of extraordinary appearance washing up dead (I read another account that\nthey were alive) on two logs (probably canoes) in Galway in 1477 in the book\n“God’s Shadow” by Alan Mikhail. The author then goes on to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリストファー・コロンブスから来た男女の話を聞いたことがあります。\nキャセイ島では異常な外見で死体として打ち上げられた（別の説では\n1477年、ゴールウェイで2本の丸太（おそらくカヌー）の上に乗っていた彼らは生きていた、という本がある。\n\"神の影 \"アラン・ミハイル著 そして、著者は次のように述べる。",
      "title": "ネイティブアメリカンは1492年以前にヨーロッパに渡っていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读过一篇报道，克里斯托弗-哥伦布在其中谈到了来自中国的男人和女人。\n国泰的男人和女人，他们的外貌很特别，被洗干净后就死了（我读到的另一个说法是\n他们还活着），在1477年戈尔韦的两根木头（可能是独木舟）上。\n\"阿兰-米哈伊尔的《上帝的影子》。作者接着说...",
      "title": "美国原住民在1492年之前就已经到了欧洲吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀過一篇報道，克里斯托弗-哥倫布在其中談到了來自中國的男人和女人。\n國泰的男人和女人，他們的外貌很特別，被洗乾淨後就死了（我讀到的另一個說法是\n他們還活着），在1477年戈爾韋的兩根木頭（可能是獨木舟）上。\n\"阿蘭-米哈伊爾的《上帝的影子》。作者接着說...",
      "title": "美國原住民在1492年之前就已經到了歐洲嗎？"
    }
  ]
}