{
  "author": "x0g",
  "the_new_excerpt": "Hi Crypto Friends,\n\nThe original intent of reddit moons were to tip an asset to people who posted\ngreat content. Once people realized they had real value, an influx of shitposts,\nmemes, and creative writing exercises blew up this subreddit. I personally\nshitposted a front-page meme and gained a few…",
  "original_created_utc": 1615085735,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，加密朋友。\n\nreddit moons的初衷是给发帖的人提示一个资产\n伟大的内容。一旦人们意识到他们有真正的价值，大量的狗屎帖子就会涌现。\nmemes, and creative writing exercises blew up this subreddit. 我个人\n拉屎贴了一个头版的备忘录 并获得了一些... ...",
      "title": "倾倒我的月亮栈"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，加密朋友。\n\nreddit moons的初衷是給發帖的人提示一個資產\n偉大的內容。一旦人們意識到他們有真正的價值，大量的狗屎帖子就會湧現。\nmemes, and creative writing exercises blew up this subreddit. 我個人\n拉屎貼了一個頭版的備忘錄 並獲得了一些... ...",
      "title": "傾倒我的月亮棧"
    }
  ],
  "title": "Tipping My Moon Stack",
  "created_utc": 1615105830,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Crypto Friends, </p>\n\n<p>The original intent of reddit moons were to tip an asset to people who posted great content. Once people realized they had real value, an influx of shitposts, memes, and creative writing exercises blew up this subreddit. I personally shitposted a front-page meme and gained a few hundred dollars worth of moons from it - then promptly deleted it because it had my face in it. Now that memes are banned, I honestly have zero way of obtaining them</p>\n\n<p>I’m not smart enough about crypto to post educational content, I don’t follow the latest crypto news so I’m not going to be able to cross post newsworthy content, and I’m not a good enough writer to sell a sob story that gets many upvotes.</p>\n\n<p>All of that being said, to attempt to facilitate moons to go back to their original purpose, I’m going tip the first 100-ish people (With ACTIVE accounts) who reply to my post 30 moons. This isn’t a life changing amount of money, but there are many of you who don’t have any moons at all. All I ask in return is that when you see good content on this sub - if you learned something, or if it made you laugh, tip the OP a moon or two. My goal is to run out of moons by the end of the weekend. If I receive any more moons in the next distribution, I will promptly tip them out to those who ask. </p>\n\n<p>—-</p>\n\n<p>TLDR: I’m tipping the first 100 people who reply to this thread 30 moons. I’m only tipping users with active accounts to cut down on duplicate asks. </p>\n\n<p>Use the moons to tip people who post great content. If I receive any moons in the next Reddit distribution, I will repost this and tip them out.</p>\n\n<hr/>\n\n<p>EDIT:\nHOLD UP FOLKS!</p>\n\n<h2>Can someone message me and explain how to tip moons? I can&#39;t figure it out and now im stressed because theres already 17 people commenting on this.</h2>\n\n<p>EDIT 2:\n<a href=\"/u/changestart1\">/u/changestart1</a> graciously walked my dumbass through how to tip people moons so I&#39;m on it now!!! troll his posts and throw him some upvotes / moons. Thanks yalllll</p>\n\n<p>—-\nEdit 3: nope I’m still dumb as fuck. When I try to send moons it tells me I have 3.7k balance, then when I try to send them it says “insufficient balance.” </p>\n\n<h2>Help?!</h2>\n\n<p>EDIT 4:\nOkay so when i try to send moons this happens.</p>\n\n<ol>\n<li><p>I click moons and try to send on new.reddit.com <a href=\"https://imgur.com/gallery/lJ5xjNR\">https://imgur.com/gallery/lJ5xjNR</a></p></li>\n<li><p>It asks me to verify in mobile. \n<a href=\"https://imgur.com/gallery/qO4L01S\">https://imgur.com/gallery/qO4L01S</a></p></li>\n<li><p>When i go into mboile it tells me i have an insufficient balance when i clearly have 3.7k \n<a href=\"https://imgur.com/gallery/injVinj\">https://imgur.com/gallery/injVinj</a></p></li>\n<li><p>Proof i have the coins\n<a href=\"https://imgur.com/gallery/Q8e4ATY\">https://imgur.com/gallery/Q8e4ATY</a></p></li>\n</ol>\n\n<p>Yall, i&#39;m working on it and will get you all your coins. Once I figure out my technical difficulties i&#39;m going to sort by new and get you all your coins!!!</p>\n\n<hr/>\n\n<p>EDIT 5: Thanks for waiting with my dumb ass patiently. I figured it out finally and am sorting by old, then tipping everyone who posted. Thanks again!!</p>\n\n<h2></h2>\n\n<p><em>FINAL EDIT 6 - \nAlright everyone. this unofficial moon give away is complete. 3700 moons given out to 100(ish) reddit folks. I expected some attention, but now I understand the sentiment of &#39;RIP Inbox.&#39; I&#39;m off to bed, love you all all</em></p>\n</div><!-- SC_ON -->",
  "score": 327,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/R9JMkDt8_EsIXpSJnzL3NLHrzM53NI4dAr2B8IllNQ0.jpg?auto=webp&s=cfcc8147545df294e5fbeaf3f88d52573dac7655",
          "width": 1536,
          "height": 2048
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/R9JMkDt8_EsIXpSJnzL3NLHrzM53NI4dAr2B8IllNQ0.jpg?width=108&crop=smart&auto=webp&s=572102c31819b956b9b05458ad355e998cb935d7",
            "width": 108,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/R9JMkDt8_EsIXpSJnzL3NLHrzM53NI4dAr2B8IllNQ0.jpg?width=216&crop=smart&auto=webp&s=a66da40f876dc263fe219b3202b8199dfd1639bd",
            "width": 216,
            "height": 288
          },
          {
            "url": "https://external-preview.redd.it/R9JMkDt8_EsIXpSJnzL3NLHrzM53NI4dAr2B8IllNQ0.jpg?width=320&crop=smart&auto=webp&s=24179a8d171ce2946ce3b55d39ec0538bf0bb84a",
            "width": 320,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/R9JMkDt8_EsIXpSJnzL3NLHrzM53NI4dAr2B8IllNQ0.jpg?width=640&crop=smart&auto=webp&s=37e75902a6c00375260d3c455cbcfe172a41e086",
            "width": 640,
            "height": 853
          },
          {
            "url": "https://external-preview.redd.it/R9JMkDt8_EsIXpSJnzL3NLHrzM53NI4dAr2B8IllNQ0.jpg?width=960&crop=smart&auto=webp&s=9cf85a068865dccc33fdd4d400b5fc15457e16af",
            "width": 960,
            "height": 1280
          },
          {
            "url": "https://external-preview.redd.it/R9JMkDt8_EsIXpSJnzL3NLHrzM53NI4dAr2B8IllNQ0.jpg?width=1080&crop=smart&auto=webp&s=9fb53430142539ec7c62c4496a239277a7741753",
            "width": 1080,
            "height": 1440
          }
        ],
        "variants": {},
        "id": "Lf2GFkjLSejSP_zDnd3a59mCNuBLEBYMfIGJP7mJ6_I"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/lzhkzq/tipping_my_moon_stack/",
  "subreddit": "CryptoCurrency",
  "id": "lzhkzq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542572115
}