{
  "author": "Soupapinho",
  "original_created_utc": 1627489529,
  "title": "If you're young - take advantage of your age",
  "created_utc": 1627511622,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For most of the people this is the &quot;easiest&quot; part of their lifes. While you&#39;re young you don&#39;t have to feed your family, take care of your children, pay the mortage or save money to retire...</p>\n\n<p>The older you are - the more careful you must be. I don&#39;t mean that if you are 18 u should just go and buy a lot of shitcoins to take the risk. But maybe take some extra in work and invest it? Buy one beer less and invest it? Maybe decide to stop buying things you don&#39;t really need and invest?</p>\n\n<p>I know a lot of people on their early 30s. They own nothing. No house, no savings, nothing. Not because they are poor. They prefer to spend every single penny to impress people on the street. People who dont even know them. Now they want to have kids. Now they will have to spend everything on children, mortage, car, family. THEY WONT BE ABLE TO INVEST even if they wanted to.</p>\n\n<p>And what if they decided to save and invest even a little money every month since they turned 18? </p>\n\n<p>Its 12 years of saving and gaining interest on your investment. If you invested 10 years ago in crypto, and decided to keep buying even $10 a week... You prolly would be a millionaire or at least be able to buy a house with cash or pay for your kids college.</p>\n\n<p>Just a shower thing i wanted to share, sry for bad englando, its my third language</p>\n\n<p>Have a nice day :)</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/otddj9/if_youre_young_take_advantage_of_your_age/",
  "subreddit": "CryptoCurrency",
  "id": "otddj9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For most of the people this is the \"easiest\" part of their lifes. While you're\nyoung you don't have to feed your family, take care of your children, pay the\nmortage or save money to retire...\n\nThe older you are - the more careful you must be. I don't mean that if you are\n18 u should just go and buy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほとんどの人にとって、これは人生で最も「簡単」なことです。あなたが\n若いうちは、家族を養う必要も、子供の世話をする必要も、住宅ローンを払う必要も、引退のためにお金を貯める必要もありません。\n住宅ローンを払ったり、退職金を貯めたりする必要はありません。\n\n年を取れば取るほど、より慎重にならなければなりません。18歳になったら買っていいということではありません。\n18歳になったら、ただ買いに行けばいいということではありませんよ...。",
      "title": "若ければ、年齢を活かしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于大多数人来说，这是他们生活中 \"最容易 \"的部分。当你在\n你不需要养活你的家人，照顾你的孩子，支付抵押贷款或存钱退休...。\n抵押贷款或为退休而存钱......\n\n你越老--你就必须越小心。我的意思不是说，如果你是\n18岁，就应该去买...",
      "title": "如果你年轻--利用你的年龄优势"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於大多數人來說，這是他們生活中 \"最容易 \"的部分。當你在\n你不需要養活你的家人，照顧你的孩子，支付抵押貸款或存錢退休...。\n抵押貸款或爲退休而存錢......\n\n你越老--你就必須越小心。我的意思不是說，如果你是\n18歲，就應該去買...",
      "title": "如果你年輕--利用你的年齡優勢"
    }
  ]
}