{
  "author": "glench",
  "original_created_utc": 1627292920,
  "title": "$200+ with my first side project! — browser extension payments",
  "created_utc": 1627298092,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>[ExtensionPay](<a href=\"https://extensionpay.com\">https://extensionpay.com</a>) has made over $200 to date with $100 of that in the last 30 days! And it&#39;s made over $4000 for my users! Woo! This is starting to feel like real money! There&#39;s also a new signup every couple days, so it feels like traction is starting to happen.</p>\n\n<p>ExtensionPay lets browser extension developers take payments in their extensions without needing to run their own backend. It provides a simple open-source API that developers can use right in their extensions to make a variety of payment schemes — free trial, freemium, premium, subscription, etc. And it&#39;s free to use, only taking a small fee of each sale so it really de-risks monetizing browser extensions.</p>\n\n<p>When I was just beginning to think about online businesses I brainstormed some interesting browser extensions but I was intimidated by the prospect of building a payment system — it would have taken weeks of tedious work at the minimum and I didn&#39;t want to risk spending all that time only to end up with something no one would pay for. I saw that taking payments in extensions was also a problem for people on Indie Hackers and other forums.</p>\n\n<p>When Google announced they were shutting down their Chrome Web Store payments API early in 2021, I thought there was an opportunity for a business that replaced their payment API and also worked cross-browser (unlike Chrome Store payments). I also knew that it at least had the potential to be lucrative because one of the best ways to make money is to help other people make money. The value proposition was clear — save weeks of tedious work and make money with browser extensions.</p>\n\n<p>So I made the initial MVP in about a month. I did this as a kind of hobby because I was feeling really bored and isolated during the pandemic. I had also been really struggling (and still am!) with a severe undiagnosed health issue since the summer of 2020 which prevented me from doing more than a few hours of work a week. I had to learn to prioritize my health so I went really slowly and felt okay with just not working on ExtensionPay at all for long stretches of time. It was kind of nice in a way — since my ability to work was so limited I had to get really good at cutting out everything non-essential to get my MVP out the door.</p>\n\n<p>Once I had something minimal working, I scraped the Chrome extension store for extensions that used Google&#39;s payment API and cold-emailed basically all of them because I knew they would be looking for a replacement. Of these I got a few users and was delighted when one of them released their extension with ExtensionPay and started making money! Even though it was a small amount of money at first it felt like a big success. Most online businesses probably never make any money at all so crossing this barrier felt great. It was magical to see new sales every day, especially because I had no expectations — any income was good income.</p>\n\n<p>Since then I&#39;ve been slowly adding features and marketing in more places. I have over 130 signups and a handful of extensions out in the world making money. A Youtuber also just made a video about using ExtensionPay. It still feels like early days but I&#39;m happy where ExtensionPay is going and will keep nurturing it to see what it can become.</p>\n\n<p>I still can&#39;t believe that I decided to start a business while being decimated by health issues in a global pandemic, but here we are. My blessings toward everyone&#39;s good health and happiness while making side projects. ✌️</p>\n</div><!-- SC_ON -->",
  "score": 10,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/K8JzHEHRCsP29L6W3ZoLVbVbpTznJWthdFrUz_rUC7Y.jpg?auto=webp&s=2d7bbb46e9ad43d3d8423c1aa6f7f4646c4e8e6a",
          "width": 1050,
          "height": 1574
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/K8JzHEHRCsP29L6W3ZoLVbVbpTznJWthdFrUz_rUC7Y.jpg?width=108&crop=smart&auto=webp&s=97f0cab446acb905286a0eb0488c433e1af63837",
            "width": 108,
            "height": 161
          },
          {
            "url": "https://external-preview.redd.it/K8JzHEHRCsP29L6W3ZoLVbVbpTznJWthdFrUz_rUC7Y.jpg?width=216&crop=smart&auto=webp&s=7828c93151f198fab62581760d349e3a22fa04c5",
            "width": 216,
            "height": 323
          },
          {
            "url": "https://external-preview.redd.it/K8JzHEHRCsP29L6W3ZoLVbVbpTznJWthdFrUz_rUC7Y.jpg?width=320&crop=smart&auto=webp&s=151b3365841c639c070995037ecf3a268b76b96e",
            "width": 320,
            "height": 479
          },
          {
            "url": "https://external-preview.redd.it/K8JzHEHRCsP29L6W3ZoLVbVbpTznJWthdFrUz_rUC7Y.jpg?width=640&crop=smart&auto=webp&s=de089733cfac59654d8bdbcd396ddc9e68c42690",
            "width": 640,
            "height": 959
          },
          {
            "url": "https://external-preview.redd.it/K8JzHEHRCsP29L6W3ZoLVbVbpTznJWthdFrUz_rUC7Y.jpg?width=960&crop=smart&auto=webp&s=92e494ce465064064d7b60285e3874c2ad0a9f00",
            "width": 960,
            "height": 1439
          }
        ],
        "variants": {},
        "id": "tIZGabVED-ogA-uv8Giku9cDpOOI141oxnSy_5SpIcM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/orvi9x/200_with_my_first_side_project_browser_extension/",
  "subreddit": "SideProject",
  "id": "orvi9x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "[ExtensionPay](https://extensionpay.com) has made over $200 to date with $100 of\nthat in the last 30 days! And it's made over $4000 for my users! Woo! This is\nstarting to feel like real money! There's also a new signup every couple days,\nso it feels like traction is starting to happen.\n\nExtensionPay…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "[ExtensionPay](https://extensionpay.com)は、これまでに200ドル以上を稼ぎ、そのうち100ドルは\nそのうち100ドルはこの30日間で稼いだものです。そして、私のユーザーに4000ドル以上の利益をもたらしました。ウー! これは\n本当のお金のように感じてきました。また、2、3日に一度は新規登録があります。\n牽引力が起こり始めているように感じています。\n\nExtensionPay...",
      "title": "初めてのサイドプロジェクトで200ドル超! - ブラウザ拡張機能の支払い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "[ExtensionPay](https://extensionpay.com)至今已赚取了超过200美元，其中100美元为\n其中100美元是在过去30天里赚到的! 它已经为我的用户赚取了超过4000美元! 呜呼! 这就是\n开始感觉像真正的钱了! 每隔几天就有一个新的注册者。\n所以，我感觉到牵引力已经开始出现了。\n\nExtensionPay...",
      "title": "200美元以上，我的第一个副业项目! - 浏览器扩展支付"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "[ExtensionPay](https://extensionpay.com)至今已賺取了超過200美元，其中100美元爲\n其中100美元是在過去30天裏賺到的! 它已經爲我的用戶賺取了超過4000美元! 嗚呼! 這就是\n開始感覺像真正的錢了! 每隔幾天就有一個新的註冊者。\n所以，我感覺到牽引力已經開始出現了。\n\nExtensionPay...",
      "title": "200美元以上，我的第一個副業項目! - 瀏覽器擴展支付"
    }
  ]
}