{
  "author": "aisling1199",
  "original_created_utc": 1647133460,
  "title": "Have I put him off masturbation for life?",
  "created_utc": 1647140424,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Since moving back home from university I (F23) have been sharing a room with my younger brother (M19). This is a temporary arrangement while the house is being renovated. &lt;/p&gt;\n\n&lt;p&gt;My brother and I used to share all the time whenever we visited our grandparents so it’s not a huge deal for us. We have been lucky enough to avoid any awkward encounters up until this point. And yet, with less than a month to go until I got my room back, our luck ran out!&lt;/p&gt;\n\n&lt;p&gt;I just got back from my shift at work, completely exhausted. I knew his girlfriend was supposed to be coming around this weekend while our folks are away. I heard the TV was on and didn’t want to disturb them (for obvious reasons). So I snuck upstairs and headed straight to the family bathroom to soak in the bath.&lt;/p&gt;\n\n&lt;p&gt;I was already undressed when I realised there were no towels in the cupboard. I remembered there was a fresh one in our en suite but was unsure whether I should risk making a dash for it (I was too lazy to get dressed again). I poked my head out to make sure the coast was clear. The TV was still blaring downstairs and I didn’t hear anyone on the landing so I figured I was in the clear.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I ran my naked ass self down the hall and into our room only to find my brother sat on the end of the bed with his junk out, sexting his girlfriend. Obviously a lot of confused screaming ensued.&lt;/p&gt;\n\n&lt;p&gt;It turns out his girlfriend couldn’t make it back from uni this weekend so they made the last minute decision to have their date night over FaceTime. Oh, and the TV was on downstairs because he was watching something earlier and forgot to turn it off. Go figure!&lt;/p&gt;\n\n&lt;p&gt;I mean, we managed to go months without any mishaps. Now, in the final stretch, weeks before getting my own space back, I’ve gone and singlehandedly embarrassed myself, my brother and his girlfriend in one fell swoop. &lt;/p&gt;\n\n&lt;p&gt;Will he ever recover from this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/tcvh6k/have_i_put_him_off_masturbation_for_life/",
  "subreddit": "TooAfraidToAsk",
  "id": "tcvh6k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Since moving back home from university I (F23) have been sharing a room with my\nyounger brother (M19). This is a temporary arrangement while the house is being\nrenovated.\n\nMy brother and I used to share all the time whenever we visited our grandparents\nso it’s not a huge deal for us. We have been…"
}