{
  "author": "Waaaaaaaaaasuup",
  "original_created_utc": 1660945283,
  "title": "I don’t understand the saying “If a tree falls in a forest and no one is around to hear it, does it make a sound”",
  "created_utc": 1660971255,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What is the point of the question? I assume I’m missing something, but why is it such a popular thought experiment? Why would the answer not just be an obvious yes? &lt;/p&gt;\n\n&lt;p&gt;Because from what I’m thinking, if a tree makes a sound when falling when someone IS around, wouldn’t the obvious assumption be that it wouldn’t be any different if nobody is around? Why would this be a “philosophical question?”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 133,
  "permalink": "/r/NoStupidQuestions/comments/wspsh8/i_dont_understand_the_saying_if_a_tree_falls_in_a/",
  "subreddit": "NoStupidQuestions",
  "id": "wspsh8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What is the point of the question? I assume I’m missing something, but why is it\nsuch a popular thought experiment? Why would the answer not just be an obvious\nyes?\n\nBecause from what I’m thinking, if a tree makes a sound when falling when\nsomeone IS around, wouldn’t the obvious assumption be that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "質問のポイントは何でしょうか？私が何かを見逃しているのだと思いますが、なぜこのような思考実験が\nこのような人気のある思考実験なのでしょうか？なぜ、答えは明白な「はい」ではないのでしょうか？\nなぜ、答えは明白な「イエス」ではないのでしょうか？\n\nなぜなら、私が考えるに、もし木が倒れるときに音がするのであれば、周りに誰かいるときに\nという仮定が成り立つと思うのですが......。",
      "title": "\"森で木が倒れても、周りに誰もいなければ音はしない \"ということわざは理解できない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题的意义何在？我想我错过了什么，但为什么它是\n这样一个流行的思想实验？为什么答案不只是一个明显的\n是吗？\n\n因为根据我的想法，如果一棵树在倒下的时候会发出声音，而这时有人在旁边。\n有人在附近，那么明显的假设不就是......",
      "title": "我不明白 \"如果一棵树在森林中倒下，周围没有人听到，它是否会发出声音 \"这句话。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題的意義何在？我想我錯過了什麼，但爲什麼它是\n這樣一個流行的思想實驗？爲什麼答案不只是一個明顯的\n是嗎？\n\n因爲根據我的想法，如果一棵樹在倒下的時候會發出聲音，而這時有人在旁邊。\n有人在附近，那麼明顯的假設不就是......",
      "title": "我不明白 \"如果一棵樹在森林中倒下，周圍沒有人聽到，它是否會發出聲音 \"這句話。"
    }
  ]
}