{
  "author": "BoxesAndLights",
  "the_new_excerpt": "I’ve seen a lot of people post about being wary of MSOS and YOLO because a\ncertain percentage of their holdings are in a liquidity trust. This is confusing\nand I wanted to set the record straight on why this is.\n\nA little background for those who are unfamiliar, MSOS is the only actively\nmanaged…",
  "original_created_utc": 1613048809,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人发帖说要对MSOS和YOLO保持警惕，因为a\n他们所持股份的一定比例被存放在流动资金信托中。这令人困惑\n我想说清楚为什么会这样。\n\n对于那些不熟悉的人来说，有一点背景，MSOS是唯一一个积极的\n管理...",
      "title": "MSOS------关于将其所持股份的一部分存入流动资金信托基金的问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人發帖說要對MSOS和YOLO保持警惕，因爲a\n他們所持股份的一定比例被存放在流動資金信託中。這令人困惑\n我想說清楚爲什麼會這樣。\n\n對於那些不熟悉的人來說，有一點背景，MSOS是唯一一個積極的\n管理...",
      "title": "MSOS------關於將其所持股份的一部分存入流動資金信託基金的問題"
    }
  ],
  "title": "MSOS – Regarding having a chunk of its holdings in a liquidity trust",
  "created_utc": 1613061419,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen a lot of people post about being wary of MSOS and YOLO because a certain percentage of their holdings are in a liquidity trust. This is confusing and I wanted to set the record straight on why this is.</p>\n\n<p>A little background for those who are unfamiliar, MSOS is the only actively managed cannabis fund with only US exposure. YOLO is essentially the same but includes Canadian exposure and a bit of UK. Dan Ahrens, manager of both of these funds, was a guest on “The Cannabis Investing Podcast” and spoke to this holding. I typed out what he said below. Keep in mind this was recorded in August 2019 so some of the details with companies may be a little dated, but the main concept and investment strategy is still 100% relevant. There is a TL;DR below if you’d prefer.</p>\n\n<p>“Our fund, YOLO, is really the only fund out there so far that is getting exposure to some of these MSOs (multi-state operators). A great example is Curaleaf with the acquisition that was just announced is going to be the largest cannabis company in the world by sales. We have companies operating in the US but they’re listed on the Canadian stock exchange and can’t get listed on the Toronto yet or NASDAQ or NYSE because of these very complicated murkey federal laws. In our fund, you know it’s very prominent in our principle investment strategies that we aren’t only going to invest directly in stocks that are listed as federally legal and listed on certain exchanges. We’re also going to use derivatives, futures, options, swaps, to gain exposure to stocks with similar characteristics. So we have a third party that buys the stocks, gives us back the return of those in a total return swap. Because it’s very important that we have exposure to companies like Curaleaf, and Harvest Health, and Green Thumb Industries. Very sizeable companies operating in the US, because the US market, as you said, it’s not just bigger than Canada. It’s many, many, many times bigger than Canada. Everyone got excited about Canada because that’s where the public stocks that we could invest are, and they passed recreational use, but we have to remember it’s a tiny market compared to the United States and the worldwide market.”</p>\n\n<p>When asked about these swaps appearing as trusts and funds in the holdings:</p>\n\n<p>“that’s the amount of cash to cover the swap. So we are getting into the weeds here a little bit, <strong>but I want to point out that what we’re doing is virtually the same as if you owned the stock. We aren’t going to lever it up or have leverage. That’s the amount of cash that’s being held and is always going to be equal to the amount that we own in a stock swap.</strong>”</p>\n\n<p><strong>TL;DR</strong>: the trust privately invests in certain companies that cannot legally be listed on an exchange yet, and YOLO and MSOS hold the trust. It all balances out in the end.</p>\n\n<p>Side note, at the time of this recording MSOS wasn’t in existence yet, so you can now get purely US exposure with that one. I’ve held these two for some time now, and I was admittedly getting a bit of FOMO when they underperformed some of the other weed ETFs this week, but I still think these have more upside potential as they are investing in US companies that are currently difficult to invest in. Once they get the greenlight to be on a common exchange, I think we will see a similar surge with YOLO and MSOS that we saw this week with the global weed ETFs. In fact, some of the companies mentioned above ARE listed now, and they’ve been soaring with the rest of them.</p>\n</div><!-- SC_ON -->",
  "score": 71,
  "permalink": "/r/stocks/comments/lhka7c/msos_regarding_having_a_chunk_of_its_holdings_in/",
  "subreddit": "stocks",
  "id": "lhka7c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622080
}