{
  "author": "BtcAnonymouse",
  "original_created_utc": 1629709960,
  "title": "6 reasons this Bitcoin bull run is going to be way bigger than anybody expects",
  "created_utc": 1629722134,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>1) Risk averse investors like Ray Dalio, Paul Tudor Jones, big commercial banks like JPMorgan and Wells Fargo are getting into Bitcoin and starting to see it as one of the best SoV asset.</p>\n\n<p>2) Lightning Network is growing and getting adopted rapidly. It&#39;s the main reason for El Salvador legal tender adoption which is coming in the first week of September. Twitter will have Lightning integration soon. Square is building DeFi on Bitcoin. JP Sears launched a social network on Lightning. African startup Bitnob started using Lightning to provide cheap remittance services.</p>\n\n<p>3) Countries like India and many other Asian countries are getting into Bitcoin in a major way. India is the second most populous country in the world and the second biggest market for gold. But the younger generation in India is turning to Bitcoin instead of gold. Crypto investments in India have gone up 700% in the last year.</p>\n\n<p>4) Taproot upgrade is an important evolution for Bitcoin to improve privacy and scalability. It&#39;s coming in November. This upgrade will let Bitcoin have scriptless smart contract integrations via layer 2 protocols.</p>\n\n<p>5) Infrastructure bill controversy had a Streisand effect for Bitcoin. Many politicians are publicly showing support for cryptocurrency and it has caused a spike in interest overall both in the US and abroad.</p>\n\n<p>6) Last but not least, trust in fiat currency is at an all time low. 10% annual inflation is considered to be hyperinflation. The largest economy in the world USA is currently at 6% annual inflation. Other countries holding dollar reserves will be affected even worse.</p>\n</div><!-- SC_ON -->",
  "score": 279,
  "permalink": "/r/CryptoCurrency/comments/p9w1v0/6_reasons_this_bitcoin_bull_run_is_going_to_be/",
  "subreddit": "CryptoCurrency",
  "id": "p9w1v0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "1) Risk averse investors like Ray Dalio, Paul Tudor Jones, big commercial banks\nlike JPMorgan and Wells Fargo are getting into Bitcoin and starting to see it as\none of the best SoV asset.\n\n2) Lightning Network is growing and getting adopted rapidly. It's the main\nreason for El Salvador legal tender…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "レイ・ダリオやポール・チューダー・ジョーンズ、JPモルガンやウェルズ・ファーゴなどの大手商業銀行など、リスクを嫌う投資家がビットコインに参入しています。\nJPモルガンやウェルズ・ファーゴのような大手商業銀行がビットコインに参入しており、ビットコインを最高のSoV資産の一つとして見始めている。\n最高のSoV資産の一つと見なし始めている。\n\n2）ライトニングネットワークが急速に成長し、採用されている。エルサルバドルの法定通貨の主な理由です。\nエルサルバドルの法定通貨の主な理由です。",
      "title": "ビットコインのブルランが誰の予想よりもはるかに大きいものになる6つの理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1) 厌恶风险的投资者，如Ray Dalio、Paul Tudor Jones、大型商业银行\n像摩根大通和富国银行正在进入比特币，并开始将其视为\n最好的SoV资产之一。\n\n2) 闪电网络正在增长并被迅速采用。它是萨尔瓦多法定货币的主要\n萨尔瓦多法定货币的主要原因...",
      "title": "比特币牛市运行的6个原因将比任何人预期的都要大"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1) 厭惡風險的投資者，如Ray Dalio、Paul Tudor Jones、大型商業銀行\n像摩根大通和富國銀行正在進入比特幣，並開始將其視爲\n最好的SoV資產之一。\n\n2) 閃電網絡正在增長並被迅速採用。它是薩爾瓦多法定貨幣的主要\n薩爾瓦多法定貨幣的主要原因...",
      "title": "比特幣牛市運行的6個原因將比任何人預期的都要大"
    }
  ]
}