{
  "author": "No_Equipment_3023",
  "original_created_utc": 1650335777,
  "title": "Seriously, why are ALL printers just straight up garbage?",
  "created_utc": 1650344019,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I remember inkjet printers when I was young, they were trash.  Constantly broke, never lasted more than a year or two, always issues, never connected right, driver issues... All of it.  10 years later?  Trash.  Same issues.  10 years later?  Still trash.  No matter the brand, no matter the model... I&amp;#39;ve worked on offices with professional level machines, still garbage.  Laser printers?  Refuse.  Cannon?  Brother?  Xerox?  Epson?  Doesn&amp;#39;t matter, all terrible.&lt;/p&gt;\n\n&lt;p&gt;What gives?  Seriously?  Where is the AK-47 of printers?  Where is the Energizer Bunny of multifunction machines?  Why is every interaction with anything that takes paper and puts ink or toner on it, just an absolute disappointment at best?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/NoStupidQuestions/comments/u6uhrj/seriously_why_are_all_printers_just_straight_up/",
  "subreddit": "NoStupidQuestions",
  "id": "u6uhrj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I remember inkjet printers when I was young, they were trash. Constantly broke,\nnever lasted more than a year or two, always issues, never connected right,\ndriver issues... All of it. 10 years later? Trash. Same issues. 10 years later?\nStill trash. No matter the brand, no matter the model... I've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "若い頃のインクジェットプリンターはゴミだった記憶があります。常に壊れていました\n常に問題があり、正しく接続されたことがない。\nドライバーの問題... 全部です。10年後？ゴミになった。同じ問題。10年後？\nまだゴミです。ブランド、モデルに関係なく... 私は...",
      "title": "マジでなんで全てのプリンターが真っ赤なゴミなんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得我年轻时的喷墨打印机，它们是垃圾。不断地坏掉。\n从来没有持续超过一两年的时间，总是有问题，从来没有正确的连接。\n驱动程序问题... 所有这一切。10年后呢？是垃圾。同样的问题。10年后？\n还是垃圾。不管是什么品牌，不管是什么型号... 我已经...",
      "title": "说真的，为什么所有的打印机都是直接的垃圾？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得我年輕時的噴墨打印機，它們是垃圾。不斷地壞掉。\n從來沒有持續超過一兩年的時間，總是有問題，從來沒有正確的連接。\n驅動程序問題... 所有這一切。10年後呢？是垃圾。同樣的問題。10年後？\n還是垃圾。不管是什麼品牌，不管是什麼型號... 我已經...",
      "title": "說真的，爲什麼所有的打印機都是直接的垃圾？"
    }
  ]
}