{
  "author": "orlong_",
  "the_new_excerpt": "A crypto chart is nothing more than a picture of human emotions. Painted on the\ncanvas are the emotions of greed, fear, hope, and euphoria. As a disciplined\ntrader, you capitalize on the psychological demons that plague other traders.\n\nSimply HODL. Longterm strategies are best to beat algorithm and…",
  "original_created_utc": 1621345389,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号チャートは、人間の感情を描いたものに他ならない。キャンバスに描かれているのは\nキャンバスに描かれているのは、貪欲、恐怖、希望、幸福感などの感情です。規律あるトレーダーとして\nトレーダーは、他のトレーダーを悩ませる心理的な悪魔を利用します。\n\n単純にHODLです。長期的な戦略は、アルゴリズムと...を打ち負かすのに最適です。",
      "title": "上がっても売らない。下がっても私は売らない。では、なぜ私はチャートを見つめ続けるのか？[心理学の説明]"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个加密货币图表不过是人类情感的图画。画布上画着\n贪婪、恐惧、希望和欣喜的情绪。作为一个有纪律的\n交易者，你可以利用困扰其他交易者的心理恶魔。\n\n仅仅是HODL。长期战略是最好的，以击败算法和...",
      "title": "如果它上涨，我就不卖。如果它下跌，我也不卖。那么我为什么一直盯着图表看呢？[心理学解释] 。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個加密貨幣圖表不過是人類情感的圖畫。畫布上畫着\n貪婪、恐懼、希望和欣喜的情緒。作爲一個有紀律的\n交易者，你可以利用困擾其他交易者的心理惡魔。\n\n僅僅是HODL。長期戰略是最好的，以擊敗算法和...",
      "title": "如果它上漲，我就不賣。如果它下跌，我也不賣。那麼我爲什麼一直盯着圖表看呢？[心理學解釋] 。"
    }
  ],
  "title": "If it goes up I am not selling. If it goes down I am not selling. So why do I keep staring at the chart? [psychology explained]",
  "created_utc": 1621377195,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A crypto chart is nothing more than a picture of human emotions. Painted on the canvas are the emotions of greed, fear, hope, and euphoria. As a disciplined trader, you capitalize on the psychological demons that plague other traders.</p>\n\n<p>Simply HODL. Longterm strategies are best to beat algorithm and high frequency traders. Invest money you can afford to lose or not have access to for a few years. Weekly ups and downs don’t matter anymore. And then you can stop looking at the chart entirely.</p>\n</div><!-- SC_ON -->",
  "score": 413,
  "permalink": "/r/CryptoCurrency/comments/nfb20x/if_it_goes_up_i_am_not_selling_if_it_goes_down_i/",
  "subreddit": "CryptoCurrency",
  "id": "nfb20x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801353
}