{
  "author": "Many_Scratch2269",
  "original_created_utc": 1634946403,
  "title": "Friendly reminder that unless you got a 5.4% raise, you actually got a pay cut this year.",
  "created_utc": 1634957581,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This pay cut comes at a time where billionaires&#39; wealth increased by 2.1 Trillion dollars during the pandemic and politicians received millions of dollars in lobbying. Moreover, banks are also screwing you off. If you&#39;ve deposited any amount of money for an interest rate lower than 5.4%, you are actually paying banks to keep your money and lend it to others for a higher interest rate. Crypto offers double digit interest rates, while banks will give u the bare minimum of 0.1%.</p>\n\n<p>And no matter how much they&#39;ll try to convince you that inflation is &quot;transitory&quot;, it isn&#39;t. The US for example, in the last 60 years has only had one inflationary year (-0.36%). That too in 2009 when the average person had to suffer the most. Inflation is out of control, and Crypto is the only way out.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/qdtb2f/friendly_reminder_that_unless_you_got_a_54_raise/",
  "subreddit": "CryptoCurrency",
  "id": "qdtb2f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This pay cut comes at a time where billionaires' wealth increased by 2.1\nTrillion dollars during the pandemic and politicians received millions of\ndollars in lobbying. Moreover, banks are also screwing you off. If you've\ndeposited any amount of money for an interest rate lower than 5.4%, you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この減俸は、億万長者の資産が2.1倍になった時期に行われました。\n億万長者の資産が2.1兆ドル増加し、政治家が何百万ドルものロビ\n政治家は何百万ドルものロビー活動を行っています。さらに、銀行もあなたをねじ伏せています。もし、あなたが\n5.4％以下の金利でお金を預けたことがある人は...。",
      "title": "5.4%の昇給がない限り、今年は実際には減給されているということを覚えておいてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这次减薪是在亿万富翁的财富增加了2.1％的情况下发生的。\n万亿美元，而政客们收到了数百万美元的游说费。\n美元的游说。此外，银行也在坑害你。如果你已经\n将任何数额的钱存入利率低于5.4%的银行，你就...",
      "title": "友情提醒：除非你得到5.4%的加薪，否则你今年实际上被减薪了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這次減薪是在億萬富翁的財富增加了2.1％的情況下發生的。\n萬億美元，而政客們收到了數百萬美元的遊說費。\n美元的遊說。此外，銀行也在坑害你。如果你已經\n將任何數額的錢存入利率低於5.4%的銀行，你就...",
      "title": "友情提醒：除非你得到5.4%的加薪，否則你今年實際上被減薪了。"
    }
  ]
}