{
  "author": "catifie",
  "original_created_utc": 1649828047,
  "title": "Are DNA mutations due to \"mistakes\" during cell division equally likely to occur on any human gene? Or are mutations more likely to occur on certain genes such as tumor suppressor genes?",
  "created_utc": 1649853546,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In regards to genetic mutations which occur &amp;quot;by chance&amp;quot; or &amp;quot;by mistake&amp;quot; during mitosis and disregarding the effect of carcinogens or environmental factors:&lt;/p&gt;\n\n&lt;p&gt;How do we know that genetic mutations leading to cancerous cells are &amp;quot;mistakes&amp;quot; during cell division? &lt;/p&gt;\n\n&lt;p&gt;How do we know that cells aren&amp;#39;t purposely trying to mutate certain genes? Could it be possible that each cell of our body actually has its own selfish desire for individuality and wants to escape from the enforced DNA instructions to serve a multicellular body? Could it be possible each cell carries its own desire to survive, causing it to try to break the genes which would lead to forced suicide (apoptosis)? &lt;/p&gt;\n\n&lt;p&gt;Why is cancer so common at old age? If cell aging increases the likelihood of developing genetic mutations, why is it that the DNA phenotype resulting from these mutations so commonly uncontrolled cell division (cancer)? I understand that the accumulation of mutations over time can increase the likelihood of cancer, but why don&amp;#39;t other mutations show harmful effects before the resulting effects uncontrolled cell division once the tumor suppressor genes are mutated?&lt;/p&gt;\n\n&lt;p&gt;Or could this &amp;quot;mistake&amp;quot; during mitosis resulting in genetic mutation be in line with how existence revolves around creating variation and possibilities to test with natural selection? Rather it be a &amp;quot;mistake&amp;quot;, but perhaps further another way to create variation?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 129,
  "permalink": "/r/askscience/comments/u2j597/are_dna_mutations_due_to_mistakes_during_cell/",
  "subreddit": "askscience",
  "id": "u2j597",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In regards to genetic mutations which occur \"by chance\" or \"by mistake\" during\nmitosis and disregarding the effect of carcinogens or environmental factors:\n\nHow do we know that genetic mutations leading to cancerous cells are \"mistakes\"\nduring cell division?\n\nHow do we know that cells aren't…"
}