{
  "author": "down2dream",
  "original_created_utc": 1649633092,
  "title": "What’s the safest way for an older (42) man to compliment a woman in a non-threatening way?",
  "created_utc": 1649661889,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have always been conscious and aware of the woman around me.  I typically notice new hair styles, shoes, and other things that I know boosts their self-esteem when complimented.  I’ve always loved being able to smile and offer a simple compliment.&lt;/p&gt;\n\n&lt;p&gt;However, as I am married with children, and getting more older, I don’t want to feel threatening or creepy.  I’ve never come at this with an ulterior motive, it’s driven by the same gentleman nature I was raised with to open doors and push in a cars chair.&lt;/p&gt;\n\n&lt;p&gt;Is it time to hang this habit up?  Or preface it with a question like, “can I give you a completely platonic compliment?”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/u0tvhi/whats_the_safest_way_for_an_older_42_man_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "u0tvhi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have always been conscious and aware of the woman around me. I typically\nnotice new hair styles, shoes, and other things that I know boosts their\nself-esteem when complimented. I’ve always loved being able to smile and offer a\nsimple compliment.\n\nHowever, as I am married with children, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は昔から、周りの女性を意識して、意識してきました。私は通常\n新しいヘアースタイルや靴など、その人の魅力を引き立たせるようなものばかりです。\n褒められると自尊心が高まります。私はいつも、微笑みながらほめるのが好きです。\n簡単な褒め言葉です。\n\nしかし、私は結婚して子供がおり、...",
      "title": "年上（42歳）の男性が女性を褒めるときに、威圧感を与えない無難な方法は何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直有意识地注意到我周围的女人。我通常\n我通常会注意到新的发型、鞋子和其他东西，我知道这些东西在被赞美时能提高她们的\n夸奖时的自尊心。我总是喜欢能够微笑着提供一个\n简单的赞美。\n\n然而，由于我已经结婚有了孩子，而且...",
      "title": "对于一个年长（42岁）的男人来说，以不具威胁性的方式赞美一个女人，最安全的方式是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直有意識地注意到我周圍的女人。我通常\n我通常會注意到新的髮型、鞋子和其他東西，我知道這些東西在被讚美時能提高她們的\n誇獎時的自尊心。我總是喜歡能夠微笑着提供一個\n簡單的讚美。\n\n然而，由於我已經結婚有了孩子，而且...",
      "title": "對於一個年長（42歲）的男人來說，以不具威脅性的方式讚美一個女人，最安全的方式是什麼？"
    }
  ]
}