{
  "author": "Jraywang",
  "the_new_excerpt": "This is a followup post to a recent post here:\nhttps://www.reddit.com/r/investing/comments/m61kqh/fruit_juice_and_fintech_a_prime_example_of_why/.\nShoutout to /u/JailedByKamala for sniffing this one out.\n\n--------------------------------------------------------------------------------\n\nHello, I want…",
  "original_created_utc": 1615932920,
  "localize": [
    {
      "locale": "zh",
      "title": "[DD]FTFT，一个4亿美元的中国骗局。",
      "the_new_excerpt": "这是最近这里的一篇跟帖。\nhttps://www.reddit.com/r/investing/comments/m61kqh/fruit_juice_and_fintech_a_prime_example_of_why/。\n向/u/JailedByKamala致敬，感谢他嗅到了这一点。\n\n--------------------------------------------------------------------------------\n\n你好，我想..."
    },
    {
      "locale": "zh-Hant",
      "title": "[DD]FTFT，一個4億美元的中國騙局。",
      "the_new_excerpt": "這是最近這裏的一篇跟帖。\nhttps://www.reddit.com/r/investing/comments/m61kqh/fruit_juice_and_fintech_a_prime_example_of_why/。\n向/u/JailedByKamala致敬，感謝他嗅到了這一點。\n\n--------------------------------------------------------------------------------\n\n你好，我想..."
    }
  ],
  "title": "[DD] FTFT, a $400 million Chinese scam",
  "created_utc": 1615938096,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is a followup post to a recent post here: <a href=\"https://www.reddit.com/r/investing/comments/m61kqh/fruit_juice_and_fintech_a_prime_example_of_why/\">https://www.reddit.com/r/investing/comments/m61kqh/fruit_juice_and_fintech_a_prime_example_of_why/</a>. Shoutout to <a href=\"/u/JailedByKamala\">/u/JailedByKamala</a> for sniffing this one out.</p>\n\n<hr/>\n\n<p>Hello, I want to do a DD today on a bad company which I&#39;ve purchased puts on. $FTFT (Future Fintech), a &#39;fin-tech blockchain {insert buzzword}&#39; company that I am near 100% certain is a Chinese scam.</p>\n\n<p>This is not financial advice.</p>\n\n<hr/>\n\n<h2><strong>So, what do they claim to do?</strong></h2>\n\n<p>Their website: <a href=\"http://www.ftft.top\">www.ftft.top</a></p>\n\n<p>Enter at your own risk. This website is not HTTPS secured and has a &quot;warning&quot; rating from Web of Trust.</p>\n\n<p>According to their website, they are a leading blockchain R&amp;D company incorporated in Florida, founded in 1998. They own and operate a blockchain-based online mall, a digital payment system, a cross-border e-commerce system, and a blockchain incubator.</p>\n\n<p>WOW, they do so much!</p>\n\n<h2><strong>And where do they do it?</strong></h2>\n\n<p>First thing you&#39;ll notice is that while they are incorporated in Florida by their SEC filing, the actual office address is in New York City. Specifically:</p>\n\n<p><em>Americas Tower, 1177 Avenue of The Americas, Suite 5100, New York, NY 10036</em></p>\n\n<p>Now it&#39;s interesting that they have Suite 5100 because the Americas Tower actually only has 47 floors. <strong>Suite 5100 doesn&#39;t actually exist.</strong> I called the leasing office and they confirmed that each floor&#39;s suite is named after the floor itself. Now, maybe there is some secret floors available only to high-end clientele or maybe their counting system is different than the leasing office said. Perhaps, I&#39;m just wrong here. We can give FTFT the benefit of the doubt and say this is a legitimate mailing address.</p>\n\n<p>It doesn&#39;t matter, their true operations is out of Beijing, China and this is where the fun really begins.</p>\n\n<h2><strong>A juice company turned blockchain technologist</strong></h2>\n\n<p>Sound strange? It gets stranger...</p>\n\n<p>FTFT, in 2017 (at the height of the BTC craze) wowed investors by turning to blockchain. Why was this so surprising, because before this, they were called &quot;SkyPeople Fruit Juice&quot; and they sold fruit juice (<a href=\"https://www.cnbc.com/2017/12/19/tiny-fruit-juice-company-soars-on-speculated-move-into-bitcoin-that-likely-isnt-real.html\">Source</a>).</p>\n\n<p>So, juice company into finance, a natural transition, right?</p>\n\n<p>Well, surprisingly, no. In order to make this jump, FTFT need to start acquiring companies with financial expertise like mad. According to their website, their portfolio consists of 2 companies:</p>\n\n<ul>\n<li><p>Nova Realm City: a blockchain technology value community... whatever that means. This company is based out of China and uses the NRC coin which they claim 35 million exists. First off, only 35 million? That&#39;s extremely low float for a &quot;digital asset community&quot;. Furthermore, I can find no evidence that NRC actually exists.</p></li>\n<li><p>InUnion: a blockchain-based life insurance platform. This company is also based out of China and as far as I can tell, it does not have its own website. The link provided by FTFT only goes to an information page with a shitty pamphlet screenshot: <a href=\"https://imgur.com/7YWc9OZ\">https://imgur.com/7YWc9OZ</a>. Notice in the screenshot that there are still red underlines in the names as if this was a screen grab from Microsoft Word. This is the real image they used for this company... Also notice that every customer will also be considered a staff member as well as an investor. What!? WTF does that mean?</p></li>\n</ul>\n\n<p>Okay, so these are the companies that FTFT publicizes for themselves. But what about the companies they don&#39;t put on their website?</p>\n\n<h2><strong>Their &quot;finance&quot; acquisitions</strong></h2>\n\n<p>FTFT is reportedly acquiring tons of companies to &quot;expand&quot; its business (presumably blockchain and finance business) and shore up its expertise (presumably in blockchain and finance).</p>\n\n<p>A quick Google search pulls up a number of subsidiaries by FTFT:</p>\n\n<p><a href=\"https://imgur.com/0L70WG1\">https://imgur.com/0L70WG1</a></p>\n\n<p>Now, let&#39;s first go through some of the companies:</p>\n\n<ul>\n<li><p>Christie Peterson Development Corporation: a company originally under H. B. Covey, Inc. which was later acquired by a non-operations company (they have no operations) Entech Environmental Technologies. (<a href=\"https://sec.report/Document/0001019687-04-000739/\">Source</a>) What is Entech Environmental Technologies? Well, its none other than FTFT! (<a href=\"https://edgar.sec.report/CIK/0001066923\">Source</a>) They have also gone under the name of Cyber Public Relations! (<a href=\"https://sec.report/Document/0001213900-19-005964/\">Source</a>) Neither of these companies have websites including Christie Peterson Development Corp.</p></li>\n<li><p>FT Commercial Management (Beijing): a company formed to acquire Sichuan Tema Supply Chain Management Co., Ltd. This company provides financial services to the supply chain industry. Other than that, it is impossible to find more about this company. Interestingly enough, the revenues of this company actually exceeds the <strong>market cap</strong> of FTFT yet they are purchasing it in common stock. (<a href=\"https://apnews.com/press-release/pr-newswire/financial-services-technology-corporate-news-greater-china-products-and-services-ownership-changes-6e1794f0cf96194018b5fcb3962c4c2b\">Source</a>)</p></li>\n<li><p>Asiasens Investment Holding: now this one wasn&#39;t even in Google it was so recent. But they announced the acquisition here. (<a href=\"https://www.prnewswire.com/news-releases/future-fintech-enters-into-indonesia-market-and-signs-share-exchange-agreement-to-acquire-asiasens-investment-holding-pte-ltd-301195800.html\">Source</a>) Now, if we look this one up, we get a hit from &quot;The Grid&quot;, some sort of yellowbook for corporations. (<a href=\"https://sgpgrid.com/company-details/asiasens-investment-holding-pte-ltd\">Source</a>) This company, which was purchased for <strong>$15 million</strong> of common stock, has less than 10 employees and a business address of: 195 PEARL&#39;&#39;S HILL TERRACE, #01-05, Singapore 168976. If you look up this business address, you&#39;ll be surprised to find that it&#39;s actually... <strong>a residential address for some dude working out of his apartment.</strong> <a href=\"https://imgur.com/xsUl9Hx\">https://imgur.com/xsUl9Hx</a>. Thankfully, this one was unable to get regulatory approval and has since been cancelled. (<a href=\"https://sec.report/Document/0001213900-21-012148/\">Source</a>)</p></li>\n<li><p>Blocknance Financial International SRL: This was probably the <strong>only</strong> blockchain company that I saw in their acquisition strategy. It is based out of the Dominican and was to be purchased in... drum roll... common stock. Unfortunately, it was also cancelled due to FTFT&#39;s inability to get regulatory approval in Hong Kong. (<a href=\"https://sec.report/Document/0001213900-21-012148/\">Source</a>)</p></li>\n</ul>\n\n<p>I can go through the list of acquisitions and since the cancellation of some of their more recent acquisitions, they have already announced more. You can see this on their own website. <a href=\"https://www.ftft.top/en/news.html\">https://www.ftft.top/en/news.html</a>.</p>\n\n<p>Here is the absolutely terrifying part: <strong>EVERY ACQUISITION IS PAID FOR IN COMMON STOCK.</strong> Not only this, but they are diluting their common stock as quickly as possible through direct offers where they issue more stock in exchange for cash. This is all found on their own website!</p>\n\n<p>In my personal opinion, this is a house of cards just waiting to fall.</p>\n\n<h2><strong>So, what part of their business IS legitimate?</strong></h2>\n\n<p>Well, they are rather proud of their &quot;Chain Cloud Mall&quot;, a blockchain based online retail front...</p>\n\n<p>It is true that they own an online storefront which can be found here: <a href=\"http://www.gksharedmall.com/\">http://www.gksharedmall.com/</a></p>\n\n<p>Now, right off the bat it seems like a normal online retail site. It has no mention of blockchain or any blockchain-related technology, but let&#39;s let that slide for a second. If you go on the front page and click on any of the advertised products, you&#39;ll notice one glaring problem with this site: <strong>NONE OF ITS PRODUCTS ARE AVAILABLE FOR SALE</strong>.</p>\n\n<p>What???</p>\n\n<p>Try it yourself. Change your location to Beijing or another center of commerce in China even. I tried 10+ products and could not make a single purchase no matter my location. All of it is unavailable so unless they had the most monstrous selling season in the history of ever, or these products were never available for sale in the first place. So wtf is this site then? Short answer: I have no idea.</p>\n\n<p>Okay, maybe let&#39;s try their next product, NONOGIRL, a global e-commerce platform whose trial launched about a year ago in April of 2020...</p>\n\n<p>It doesn&#39;t exist. There&#39;s no mention of it ever again. It either never went live or never existed in the first place.</p>\n\n<p>DCON, a coin touted by FTFT for blockchain incubation and technical services!</p>\n\n<p>And... it also doesn&#39;t exist: <a href=\"https://imgur.com/lq9vu2R\">https://imgur.com/lq9vu2R</a>.</p>\n\n<hr/>\n\n<p>So, wtf does FTFT even do? They are acquiring internal advertisement companies, supply chain financing companies, asset management companies, and insurance companies. The <strong>ONLY</strong> blockchain related company they sought to acquire actually failed to go through due to regulations.</p>\n\n<p>I have no idea what this company does, if it does anything. All I know is that they are liquidating their shares as quickly as humanly possible. Everything they purchase is through shares. They probably offer the baristas in Starbucks common share instead of cash. This looks like a penny stock pretending to not be a penny stock with wild acquisitions announced every week that never go through.</p>\n\n<p>Is this company a fraud designed to drain investor cash? I can&#39;t say for sure. But my findings are above and you should make your own decision.</p>\n</div><!-- SC_ON -->",
  "score": 1786,
  "permalink": "/r/investing/comments/m6kxvb/dd_ftft_a_400_million_chinese_scam/",
  "subreddit": "investing",
  "id": "m6kxvb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379968
}