{
  "author": "toldinstone",
  "the_new_excerpt": "I am Lucius Aelius Aurelius Commodus, son of the deified Marcus, master of the\ncivilized world, Emperor of Rome.\n\nYou would do well to consider me a god.\n\nRecently, under circumstances that I feel no particular inclination to share, I\nencountered this movie you call “Gladiator.”\n\nI was not…",
  "original_created_utc": 1617237251,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是卢修斯-艾利乌斯-奥勒留斯-康莫德斯 神化的马库斯之子，神灵的主人\n文明世界，罗马皇帝。\n\n你最好把我当成神。\n\n最近，在我觉得没有特别想分享的情况下，我...\n遇到了你所谓的 \"角斗士 \"这部电影。\n\n我不是...",
      "title": "[评论]不要在《角斗士》（2000）上浪费你的钱。如果你这样做，你将面对我的愤怒。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是盧修斯-艾利烏斯-奧勒留斯-康莫德斯 神化的馬庫斯之子，神靈的主人\n文明世界，羅馬皇帝。\n\n你最好把我當成神。\n\n最近，在我覺得沒有特別想分享的情況下，我...\n遇到了你所謂的 \"角鬥士 \"這部電影。\n\n我不是...",
      "title": "[評論]不要在《角鬥士》（2000）上浪費你的錢。如果你這樣做，你將面對我的憤怒。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私は神格化されたマーカスの息子、ルシウス・アウレリウス・コモドゥスである。\nローマの皇帝だ\n\n私を神と思ってください\n\n最近、特に話す気も起きない状況下で、私は\n\"グラディエーター \"という 映画に出会いました\n\n私は...",
      "title": "レビュー】『グラディエーター』(2000)でセスタスを浪費してはいけない。そんなことをしたら、私の怒りを買うことになるでしょう。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私は神格化されたマーカスの息子、ルシウス・アウレリウス・コモドゥスである。\nローマの皇帝だ\n\n私を神と思ってください\n\n最近、特に話す気も起きない状況下で、私は\n\"グラディエーター \"という 映画に出会いました\n\n私は...",
      "title": "レビュー】『グラディエーター』(2000)でセスタスを浪費してはいけない。そんなことをしたら、私の怒りを買うことになるでしょう。"
    }
  ],
  "title": "[Review] Don't squander your sesterces on Gladiator (2000). If you do, you will FACE MY WRATH.",
  "created_utc": 1617272873,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am Lucius Aelius Aurelius Commodus, son of the deified Marcus, master of the civilized world, Emperor of Rome. </p>\n\n<p>You would do well to consider me a god.</p>\n\n<p>Recently, under circumstances that I feel no particular inclination to share, I encountered this movie you call “Gladiator.” </p>\n\n<p>I was <em>not</em> entertained. </p>\n\n<p>To the baser elements of the mob, I suppose, it might seem watchable. The opening battle is impressive enough, as are the scenes set in the city of Rome (though half the buildings are out of place). Despite glaring inaccuracies, the gladiatorial combats are creative and exciting. The music is evocative, if you like that sort of thing. </p>\n\n<p>But all of this vanishes beside the grossly slanderous portrait of myself. </p>\n\n<p>Who is Joaquin Phoenix? Who is this sickly imposter, this devious incompetent, this <em>commoner</em> who dares to assume my name? What has he to do with me? Where in him is the glory of Commodus? Where is the commanding eye, the Herculean figure, the leonine hair, the luxuriant beard? </p>\n\n<p>Phoenix, I grant, has a certain degree of flair (I have ordered my artificers to copy that fetching white armor he wears in the final battle with Maximus). He has a measure of my godlike skill in the gladiatorial arts, exhibits a seemly zest for the games, and is justly disdainful of all things senatorial. In every other respect, however, his false Commodus is an abomination!</p>\n\n<p>I shall focus on the most egregious errors.</p>\n\n<p>I did not kill the deified Marcus. My father never dreamt of giving power to the Senate, and made me his co-emperor long before his death. I gained nothing from his passing.</p>\n\n<p>Although Phoenix manages to convey my loathing of the Senate – I rather liked the scene where he plays with his sword while the senators natter on about drainage – he is far too gentle with them. Nothing forestalls sedition like a timely execution or two. Much though I might like to, however, I have never attempted to disband the senate entirely. Even senators have their uses. </p>\n\n<p>I have no inappropriate urges toward my sisters (I killed Lucilla, of course, but that was nothing personal). The vicious rumors to the contrary should not be countenanced. </p>\n\n<p>Last but certainly not least, I have never heard of any general-turned-gladiator named Maximus. Who is this Maximus? Who is this unlikely hero, unstoppable in the arena, beloved by my traitorous sister Lucilla, empowered to establish the Senate – the Senate! – in control of Rome? He is nobody! He is nothing! He never existed!</p>\n\n<p>Every time “Maximus” – portrayed by a surly provincial named Russell Crowe – appeared on screen, my blood began to boil. The final fight was worst of all. I have never cheated in the arena. I have never needed to. To suggest otherwise is defamation of the basest order. And to show Commodus, Emperor of Rome, being slain in arena!</p>\n\n<p>Ridley Scott is an impertinent wretch. </p>\n\n<p>I find myself angrier than a god should be. I shall shoot ostriches until I regain my composure. Once I have recovered myself, I shall return to carousing with my companions, to dazzling displays of martial prowess, to entirely platonic relations with my sisters, and to quiet contemplation of my ineffable majesty. I shall never again trouble myself with “Gladiator.” Nor will any of my subjects, if they know what’s good for them…</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/mhjonm/review_dont_squander_your_sesterces_on_gladiator/",
  "subreddit": "AskHistorians",
  "id": "mhjonm",
  "is_self": true,
  "media": null,
  "is_video": false
}