{
  "author": "Jesse_etk",
  "original_created_utc": 1633178139,
  "title": "Why do so many people like Seinfeld (TV show) so much?",
  "created_utc": 1633214568,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t get it. All these people on reddit worshipping this series as one of the few actually hilarious sitcoms that ever existed, I&#39;m more than halfway through season one and i haven&#39;t laughed once. It&#39;s not like sitcoms aren&#39;t my type of humor, The Golden Girls for example cracks me up in nearly every episode. I know humor is subjective, but with such a high amount of people praising this series like a masterpiece i kind of expected to get at least a smirk or two off of it.</p>\n\n<p>Maybe it&#39;s just season one that&#39;s kinda lame and it gets better later on? Or is it just 90s nostalgia that makes this series look better than it really is?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/pzubx9/why_do_so_many_people_like_seinfeld_tv_show_so/",
  "subreddit": "NoStupidQuestions",
  "id": "pzubx9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't get it. All these people on reddit worshipping this series as one of the\nfew actually hilarious sitcoms that ever existed, I'm more than halfway through\nseason one and i haven't laughed once. It's not like sitcoms aren't my type of\nhumor, The Golden Girls for example cracks me up in nearly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はそれを理解していません。redditではこのシリーズを数少ない実際に面白いシットコムの一つとして崇めている人たちがいるけど\n崇拝していますが、私はこのシリーズの半分以上を見ました。\n私はシーズン1の半分以上を見ていますが、一度も笑っていません。シットコムは私の好みのタイプではありません。\n例えば、「ゴールデン・ガールズ」はほとんどの場面で私を笑わせてくれます。",
      "title": "なぜ多くの人がSeinfeld（テレビ番組）をこんなにも好きなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白。所有这些人都在reddit上崇拜这个系列，认为它是有史以来为数不多的搞笑情景喜剧之一。\n众多的人都在崇拜这部电视剧，认为它是有史以来为数不多的搞笑情景喜剧，而我已经看了一半多了\n第一季已经过半，我一次也没笑过。这并不是说情景喜剧不是我喜欢的类型。\n幽默，例如《黄金女郎》就几乎让我笑出声来......",
      "title": "为什么这么多人这么喜欢《宋飞》（电视剧）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白。所有這些人都在reddit上崇拜這個系列，認爲它是有史以來爲數不多的搞笑情景喜劇之一。\n衆多的人都在崇拜這部電視劇，認爲它是有史以來爲數不多的搞笑情景喜劇，而我已經看了一半多了\n第一季已經過半，我一次也沒笑過。這並不是說情景喜劇不是我喜歡的類型。\n幽默，例如《黃金女郎》就幾乎讓我笑出聲來......",
      "title": "爲什麼這麼多人這麼喜歡《宋飛》（電視劇）？"
    }
  ]
}