{
  "author": "Replicator2900",
  "original_created_utc": 1650912966,
  "title": "Are there any \"solved\" topics in philosophy?",
  "created_utc": 1650978633,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay. So, first, folks do forgive me if my post contains erroneous misassumptions regarding philosophy. I don&amp;#39;t know much about it, but my (possibly wrong) impression of the field is that it&amp;#39;s very, well, diverse. Lots of different viewpoints regarding different problems and questions - so not really &amp;quot;objectively&amp;quot; definable in, say, the way science can prove the speed of light is equivalent to 299 792 458 meters/second, or that humans generally take nine months to give birth. &lt;/p&gt;\n\n&lt;p&gt;Are there any philosophical topics that were once the rage of the party - debated fiercely, to the death, perhaps - that are now settled, solved questions. Of course, I suppose that calls into question whether you can &amp;quot;solve&amp;quot; a topic in any concrete sense.&lt;/p&gt;\n\n&lt;p&gt;To define it more simply, so, if we assume we can&amp;#39;t &amp;quot;solve&amp;quot; something - say, what about an supermajority-type agreed consensus on a topic that was once, say, fiercly split or contested? (I suppose, as much as there can be an agreed consensus in philosophy...)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/ubshde/are_there_any_solved_topics_in_philosophy/",
  "subreddit": "askphilosophy",
  "id": "ubshde",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Okay. So, first, folks do forgive me if my post contains erroneous\nmisassumptions regarding philosophy. I don't know much about it, but my\n(possibly wrong) impression of the field is that it's very, well, diverse. Lots\nof different viewpoints regarding different problems and questions - so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、まず最初に、私の投稿に哲学に関する誤った認識が含まれていることをお許しください。\nをお許しください。私はあまり詳しくはないのですが、私の\n(この分野は非常に多様であるというのが私の（おそらく間違った）印象です。多くの\nを、様々な問題や疑問に対して、様々な視点から見ることができます。",
      "title": "哲学に「解けた」トピックはあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，首先，如果我的帖子含有关于哲学的错误的\n关于哲学的错误推断。我对它了解不多，但我的\n(可能是错误的）对这个领域的印象是，它非常，嗯，多样化。很多\n对于不同的问题和议题有很多不同的观点--所以..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，首先，如果我的帖子含有關於哲學的錯誤的\n關於哲學的錯誤推斷。我對它瞭解不多，但我的\n(可能是錯誤的）對這個領域的印象是，它非常，嗯，多樣化。很多\n對於不同的問題和議題有很多不同的觀點--所以...",
      "title": "哲學に「解けた」トピックはあるのか？"
    }
  ]
}