{
  "author": "tcrambo",
  "original_created_utc": 1641804449,
  "title": "Owners didn’t want to give me what I deserved, now they are about to lose a $3M contract because I resigned.",
  "created_utc": 1641851267,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a young Project Manager for an unlimited commercial GC. I picked up a hammer for the first time 6 years ago (no prior experience). I was raised believing if you work hard and apply yourself you will be successful. For 2 years I learned everything that I could in the construction industry. Took my work home with me and studied on my own time to better myself. For that I was promoted to foreman. I was brought into take over a small project at a 12 building 120 unit condo complex. It started small and the Board of Directors for the HOA told me they loved my professionalism, work ethic, and ability to complete projects on time, and under budget. We won a big contract because of that small project. That was3 years ago. I have since taken over the job of foreman, superintendent, &amp;amp; project manager. I do the billing, meetings with engineers and board members, scheduling, take off, material ordering, I even train the subs on application of new products because we didn’t have enough mid management. The project just passed $2.7M. We got a bid request for another $3M job in the same complex. All the while the board of directors telling me how appreciative they are and how they’ve gone through 5 different contractors in the years before committing to my company because of my management and  quality of work. This boosted my confidence and I went to the owners asking for the raise they promised me 1 year ago for my production. They told me “the experience you’re gaining is far more valuable” I said you’re right. I put my resume on public, got contacted by a headhunter, just accepted an offer this week for $80k a year salary, full benefits, 28 days PTO including holidays, in the office now ( no more working from the field full in my own truck), Lap top, wifi in my truck for on the go billing when I visit the out of state projects, $80 per diem, 100% matching 401k for the first 3 years of my employment, quarterly bonus programs. The company I’m with now only pays me 40k and that’s it none of the above listed benefits. The final mail in the coffin was when the owners bragged about how much my project made in a company meeting and then denied me a Christmas bonus. I laid this offer on their desk Friday and watched their jaws hit the floor. I told the HoA board president of the project I’m running about my resignation when  they couldn’t match my the offer. His eyes got big and requested a meeting with the owners and expressed serious concern about moving forward with the new project without my involvement. They don’t have anyone to replace me and I’m not gonna lie, it feels good to hurt their pockets when I gave them everything I had for 6 years and only asked for the median project manager salary. Fuck those greedy bastards.&lt;/p&gt;\n\n&lt;p&gt;Edit: a lot of people seem to think I’m lying or exaggerating so let me clarify a few things. &lt;/p&gt;\n\n&lt;p&gt;I began this company as a worker ended up dating one of the owners daughters and am now engaged to marry. I’m not exaggerating about my current pay it’s $21 hourly. I fee he uses the “family” excuse as a reason to keep me underpaid. Dude is a classic narcissist. I’ve taken This to his business partner and he said that my soon to be father in law has sole control over my pay.  They gave me the position and responsibility of project manager without the pay, so after taxes it’s more like 33k a year. I stayed with them out of fear of the unknown. It was ultimately my fiancé who gave me the courage and confidence to leave. The new position I accepted is for assistant PM, not sole PM, it comes with a hefty pay increase and I am happy about that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 75254,
  "permalink": "/r/antiwork/comments/s0fgz7/owners_didnt_want_to_give_me_what_i_deserved_now/",
  "subreddit": "antiwork",
  "id": "s0fgz7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a young Project Manager for an unlimited commercial GC. I picked up a\nhammer for the first time 6 years ago (no prior experience). I was raised\nbelieving if you work hard and apply yourself you will be successful. For 2\nyears I learned everything that I could in the construction industry. Took…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、アンリミテッドコマーシャルGCの若いプロジェクトマネージャーです。私が手にしたのは\n6年前に初めてハンマーを打ちました（未経験者）。私は幼い頃から\n一生懸命に働けば、必ず成功すると信じています。2年間\n建設業界で学べることはすべて学びました。そして...",
      "title": "オーナーは私に相応の報酬を与えようとせず、私が辞職したために3百万ドルの契約を失おうとしているのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个年轻的项目经理，为一个无限商业GC工作。我在6年前第一次拿起了\n6年前第一次拿起锤子（之前没有经验）。我从小就\n相信如果你努力工作并运用自己，你就会成功。两年来\n我学习了建筑行业的所有知识。我在这两年里学习了建筑业的所有知识。",
      "title": "业主们不想给我应得的东西，现在他们即将因为我的辞职而失去一份300万美元的合同。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個年輕的項目經理，爲一個無限商業GC工作。我在6年前第一次拿起了\n6年前第一次拿起錘子（之前沒有經驗）。我從小就\n相信如果你努力工作並運用自己，你就會成功。兩年來\n我學習了建築行業的所有知識。我在這兩年裏學習了建築業的所有知識。",
      "title": "業主們不想給我應得的東西，現在他們即將因爲我的辭職而失去一份300萬美元的合同。"
    }
  ]
}