{
  "author": "bitbuggs",
  "the_new_excerpt": "Or lose you a lot of money. The choice is really up to you. For anyone who is\nnew to crypto investing, congratulations. You found something that can provide\nreturns that is almost impossible to find anywhere else in investing. At the\nsame time, you also found something that is highly volatile, and…",
  "original_created_utc": 1615350479,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "或者让你损失惨重。其实选择权在你手里。对于任何人来说\n新的加密投资，恭喜你。你找到了可以提供\n回报，是几乎不可能找到任何其他投资的地方。在\n同时，你也发现了一些高度不稳定的东西，而且... ...",
      "title": "加密技术可能会让你赚到很多钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "或者讓你損失慘重。其實選擇權在你手裏。對於任何人來說\n新的加密投資，恭喜你。你找到了可以提供\n回報，是幾乎不可能找到任何其他投資的地方。在\n同時，你也發現了一些高度不穩定的東西，而且... ...",
      "title": "加密技術可能會讓你賺到很多錢"
    }
  ],
  "title": "Crypto Will Probably Make You a Lot of Money",
  "created_utc": 1615386936,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Or lose you a lot of money. The choice is really up to you. For anyone who is new to crypto investing, congratulations. You found something that can provide returns that is almost impossible to find anywhere else in investing. At the same time, you also found something that is highly volatile, and if you are just here to make a quick buck, you will lose it even faster. </p>\n\n<p>Being a part of the community for 4-5 years now, I have seen people become millionaires and I&#39;ve seen millionaires go broke, and the same thing will happen during this bull run. If you want to make money in this market all you have to do is keep your emotions in check. There will be many people making thousands riding pump and dumps, investing in scam coins, and shilling whatever they can to make a profit. You will see people making a lot of money from this and often times you may want to join in so you can enjoy those same profits. DO NOT DO IT. Everyone from 2017 that has gotten rich that way, for the most part are all broke now. All those youtubers that showed off their millions from shilling bitconnect, scam ICOs, and every ponzi you can think of are now no where to be seen. Yes, you can make a lot of money from following what these scam gurus tell you, but you will lose it even faster. </p>\n\n<p>Those who make money in this market are those who invest in soild projects; Those who study what they are investing in, and plan to be in this for the long haul. Think of anyone who is successful from crypto; they have most likely been doing this for years. They did not get rich over night. They put in thousands of hours of research and DD to understand the ins and outs of this market. They made the decision to place their money in soild products, not hype, hope and emotion. </p>\n\n<p>Anyone can be successful in this market no matter how much money you are starting with. With crypto, you can turn $100 into $10k+ if you are smart. But those who are careless will put in thousands and lose it all. Be smart, be careful, and remember why you came here to begin with.</p>\n\n<p>Edit: TL;DR: Being patient and putting in the work to find quality investments is the only way to truly be successful in crypto in the long term. Quick easy profits in the short term usually leads to fast painful losses in the long term.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/m1pbf8/crypto_will_probably_make_you_a_lot_of_money/",
  "subreddit": "CryptoCurrency",
  "id": "m1pbf8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573524
}