{
  "author": "donemessedup123",
  "the_new_excerpt": "Hello everyone,\n\nWith the popularity of stock trading at an all-time high, I just wanted to give\na small PSA about joining stock trading groups on discord.\n\nLong story short, I have searched around a few different discords to join a\ncommunity I could learn more about stocks and trading. I can say…",
  "original_created_utc": 1614557962,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n在股票交易人气空前高涨的情况下，我只是想给\n关于在discord上加入股票交易群的一个小公益广告。\n\n长话短说，我已经在几个不同的discords上搜索加入了一个\n社区我可以学习更多的股票和交易。我可以说...",
      "title": "警惕股票与投资的矛盾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n在股票交易人氣空前高漲的情況下，我只是想給\n關於在discord上加入股票交易羣的一個小公益廣告。\n\n長話短說，我已經在幾個不同的discords上搜索加入了一個\n社區我可以學習更多的股票和交易。我可以說...",
      "title": "警惕股票與投資的矛盾"
    }
  ],
  "title": "Be Wary of Stock and Investment Discords",
  "created_utc": 1614564085,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone,</p>\n\n<p>With the popularity of stock trading at an all-time high, I just wanted to give a small PSA about joining stock trading groups on discord.</p>\n\n<p>Long story short, I have searched around a few different discords to join a community I could learn more about stocks and trading. I can say without a doubt, that the majority of them have the following scheme attached to it:</p>\n\n<ol>\n<li>Are pump and dumps where the admin, claiming to be an expert, will post a daily watchlist to encourage people to buy into stocks they already have a position in.</li>\n<li>Are setup to convince people they need to subscribe to daily video and &quot;secret advice&quot; in order to make a quick buck.</li>\n</ol>\n\n<p>Some of the people that run these discords are competent and I can see use manipulation tactics to come off as an authority on subject matters and encourage group think to forward the two objectives above. If you know what you are doing, you can tell they lack substance, but people green to investing can easily be enticed.</p>\n\n<p>Be careful and research into communities you plan on joining. A few common red flags of toxic stock discords I have found include:</p>\n\n<ol>\n<li>Stocks recommendations that constantly change on a daily basis.</li>\n<li>Cult-like praise for public figures like Elon Musk.</li>\n<li>Using words and tactics to encourage group-think (Such as &quot;stock fam&quot; and encouraging the posting of daily profits).</li>\n<li>Due diligence that amounts to &quot;This company looks dope, they have a cool product,&quot; without providing anything on technicals.</li>\n</ol>\n\n<p>This may sound silly, but I think there are people out there who are looking to capitalize hard on this craze. If you are looking for a community to join, be careful and always scrutinize people&#39;s suggestions.</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/investing/comments/luuutj/be_wary_of_stock_and_investment_discords/",
  "subreddit": "investing",
  "id": "luuutj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740756
}