{
  "author": "SlappySpankBank",
  "original_created_utc": 1628226140,
  "title": "I bragging to my friends about my crypto in 2016 and now they are asking me for money. Don't make this mistake.",
  "created_utc": 1628256767,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 2016 I turned like $500 into $4,000 and was bragging to my friends about it. The entire time I was like &quot;Look at this guys look at this!&quot; and trying to get them to get into it.  They gave me usual shit about &quot;it&#39;s a scam dude try to cash out&quot; &quot;it&#39;s going to crash&quot; &quot;yeah that sounds like bs&quot; &quot;Yeah I used that to buy drugs in 2014 it&#39;s illegal&quot;...  </p>\n\n<p>Over the years it&#39;s come up a few times and I told them I&#39;ve kept investing into it because this could be the future of finance.   </p>\n\n<p>Now in 2021 these people think I&#39;m rich as fuck. To be fair, compared to someone who owes $20k on a car and $40k in student debt, I am rich as fuck. Keep in mind, these are not my close friends, just friend that are fun to hang out with every couple weeks. They are asking to borrow money because they &quot;know I have it&quot; and they really really need it right now.   </p>\n\n<p>It&#39;s like man I have enough money to cover my own emergency, I don&#39;t have new house money and even if I did I&#39;m suppose to give it to you just because...? Now I&#39;m the asshole because everyone thinks they know how much money I have and I won&#39;t give any to them. Jesus Christ people are fucking stupid.   </p>\n\n<p>Don&#39;t tell anyone about how much you invest in crypto. Probably good to just not talk about it at all with certain people.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/oyzzrr/i_bragging_to_my_friends_about_my_crypto_in_2016/",
  "subreddit": "CryptoCurrency",
  "id": "oyzzrr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In 2016 I turned like $500 into $4,000 and was bragging to my friends about it.\nThe entire time I was like \"Look at this guys look at this!\" and trying to get\nthem to get into it. They gave me usual shit about \"it's a scam dude try to cash\nout\" \"it's going to crash\" \"yeah that sounds like bs\" \"Yeah…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2016年には500ドルを4000ドルにして、友達に自慢していました。\nその間、私は「これを見て、みんなこれを見て！」と言って、彼らをその気にさせようとしていました。\n誘っていました。彼らは私に、「これは詐欺だ、現金化しようとしている奴がいる」、「このままでは破産してしまう」などと、お決まりの文句を言った。\n詐欺だぜ、儲けようぜ」「暴落するぜ」「嘘みたいだな」「そうだな......」といつものように言われました。",
      "title": "2016年に自分の暗号を友達に自慢したら、今度はお金を要求された。このような失敗をしないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在2016年，我把500美元变成了4000美元，并向我的朋友们吹嘘这一点。\n在整个过程中，我都在说 \"看看这个，伙计们，看看这个！\"并试图让他们加入进来。\n试图让他们也加入进来。他们对我说：\"这是个骗局，伙计，试着兑现。\n\"它将会崩溃\"\"是的，这听起来像是胡说八道\"\"是的...\"。",
      "title": "我在2016年向朋友吹嘘我的加密货币，现在他们却向我要钱。不要犯这种错误。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在2016年，我把500美元變成了4000美元，並向我的朋友們吹噓這一點。\n在整個過程中，我都在說 \"看看這個，夥計們，看看這個！\"並試圖讓他們加入進來。\n試圖讓他們也加入進來。他們對我說：\"這是個騙局，夥計，試着兌現。\n\"它將會崩潰\"\"是的，這聽起來像是胡說八道\"\"是的...\"。",
      "title": "我在2016年向朋友吹噓我的加密貨幣，現在他們卻向我要錢。不要犯這種錯誤。"
    }
  ]
}