{
  "author": "thescheit",
  "the_new_excerpt": "Reminds me of the stock market when Covid got and the market crashed. For a\nmoment everyone expected another depression Era. I bought the heck out of that\ncrash. CCL, TSLA, AMC, etc. All the epicenter stocks. Within days there were\n100% gains because the market turned around and kept going up. Feels…",
  "original_created_utc": 1621778558,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コヴィッドが買収されて市場が暴落したときの株式市場を思い出すよ。一瞬\n一瞬、誰もが恐慌時代の再来を予想した。私はその大暴落の中で買いまくった。\nの暴落です。CCL、TSLA、AMCなどなど。震源地となるような銘柄ばかりです。数日後には\n市場が好転して上昇し続けたので、100％の利益を得ました。感じたこと...",
      "title": "人々が恐れているときに買い、欲張っているときに売る。今日のcrypto redditは、恐れている人でいっぱいです。買い手になるには良い時期だ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我想起了科维德得到和市场崩溃时的股票市场。一时间\n一时间，每个人都期待着另一个大萧条时代的到来。我买了那个该死的东西\n崩溃。CCL，TSLA，AMC，等等。所有的震中股票。在几天内，有\n100%的收益，因为市场转过身来，一直在上涨。感觉...",
      "title": "在人们恐惧的时候买入，在他们贪婪的时候卖出。今天的crypto reddit充满了恐惧的人。这是一个成为买家的好时机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我想起了科維德得到和市場崩潰時的股票市場。一時間\n一時間，每個人都期待着另一個大蕭條時代的到來。我買了那個該死的東西\n崩潰。CCL，TSLA，AMC，等等。所有的震中股票。在幾天內，有\n100%的收益，因爲市場轉過身來，一直在上漲。感覺...",
      "title": "在人們恐懼的時候買入，在他們貪婪的時候賣出。今天的crypto reddit充滿了恐懼的人。這是一個成爲買家的好時機。"
    }
  ],
  "title": "Buy when people are fearful, sell when they're greedy. Today's crypto reddit is filled with fearful people. It's a good time to be a buyer.",
  "created_utc": 1621821514,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reminds me of the stock market when Covid got and the market crashed. For a moment everyone expected another depression Era. I bought the heck out of that crash. CCL, TSLA, AMC, etc. All the epicenter stocks. Within days there were 100% gains because the market turned around and kept going up. Feels pretty similar.</p>\n</div><!-- SC_ON -->",
  "score": 749,
  "permalink": "/r/CryptoCurrency/comments/nj8ddk/buy_when_people_are_fearful_sell_when_theyre/",
  "subreddit": "CryptoCurrency",
  "id": "nj8ddk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385269
}