{
  "author": "notnotavirginnot",
  "the_new_excerpt": "Hi! I'm a native Spanish speaker. I can read text like \"el cantar del mio cid\"\nwith no problem (just have to read it slowly) most other Spanish speakers I know\nhave no problem with old Spanish. I'm also a Spanish speaker and a french\nspeaker. I can't read any old English I can only read starting…",
  "original_created_utc": 1610836360,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨！我是一个母语为西班牙语的人。我可以阅读 \"el cantar del mio cid \"这样的文字。\n没问题（只是要慢慢读），我认识的大多数其他西班牙语人都是这样的\n对老西班牙语没有问题。我也是一个西班牙语和法语的人。\n说话者： 我不会读任何旧英语，我只能读起... ...",
      "title": "为什么我可以看懂旧的西班牙语，却看不懂旧的英语或旧的法语？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨！我是一個母語爲西班牙語的人。我可以閱讀 \"el cantar del mio cid \"這樣的文字。\n沒問題（只是要慢慢讀），我認識的大多數其他西班牙語人都是這樣的\n對老西班牙語沒有問題。我也是一個西班牙語和法語的人。\n說話者： 我不會讀任何舊英語，我只能讀起... ...",
      "title": "爲什麼我可以看懂舊的西班牙語，卻看不懂舊的英語或舊的法語？"
    }
  ],
  "title": "Why can I read old Spanish but not old English or old french?",
  "created_utc": 1610849580,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi! I&#39;m a native Spanish speaker. I can read text like &quot;el cantar del mio cid&quot; with no problem (just have to read it slowly) most other Spanish speakers I know have no problem with old Spanish. I&#39;m also a Spanish speaker and a french speaker. I can&#39;t read any old English I can only read starting from early modern. Same with french I can only Star reading it from early modern. </p>\n\n<p>But old Spanish I can read just fine and only see very minor changes. </p>\n\n<p>Why did Spanish change relatively so little over time compared to English and french?</p>\n\n<p>P.s I&#39;ve been fluent in English since I was a kid and mostly read in English, I only read books that where originally in Spanish in Spanish. I don&#39;t read much in french I think I&#39;ve only ever read two books in french.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/kyt14w/why_can_i_read_old_spanish_but_not_old_english_or/",
  "subreddit": "AskHistorians",
  "id": "kyt14w",
  "is_self": true,
  "media": null,
  "is_video": false
}