{
  "author": "rescherach",
  "the_new_excerpt": "*For a student in philosophy rather than a student in history of philosophy or\nparticular great philosophers.\n\nThis question is asked earnestly. Because I am torn between a division between\ntwo types of philosophers: those who think philosophy is nothing more than\nhistory of philosophy and those who…",
  "original_created_utc": 1619581858,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "*哲学史や特定の偉大な哲学者ではなく、哲学を学ぶ人のための本です。\n哲学史や特定の偉大な哲学者を学ぶ人ではなく、哲学を学ぶ人のために。\n\nこの質問は切実なものです。なぜなら、私は2つのタイプの哲学者の間で悩んでいるからです。\n哲学は哲学史に過ぎないと考える人と\n哲学の歴史と、それを",
      "title": "前世紀における哲学の急激な成長と、OPPORTUNITY COSTを考えると、プラトンやカントなどの「偉大な哲学者」の一次テキストを読んで解釈することに時間を費やすことは、現代のテキストにすべての時間を費やすこととは対照的に、価値があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "*适用于研究哲学的学生，而不是研究哲学史或特定的伟大哲学家的学生。\n特别是伟大的哲学家。\n\n这个问题问得很恳切。因为我很纠结于两种类型的哲学家之间的划分\n两种类型的哲学家：那些认为哲学只不过是\n哲学史和那些...",
      "title": "考虑到上个世纪哲学的指数式增长，并考虑到机会成本，相对于把所有时间花在当代文本上，花时间阅读和解释像柏拉图、康德等 \"大哲学家 \"的主要文本是否值得？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "*適用於研究哲學的學生，而不是研究哲學史或特定的偉大哲學家的學生。\n特別是偉大的哲學家。\n\n這個問題問得很懇切。因爲我很糾結於兩種類型的哲學家之間的劃分\n兩種類型的哲學家：那些認爲哲學只不過是\n哲學史和那些...",
      "title": "考慮到上個世紀哲學的指數式增長，並考慮到機會成本，相對於把所有時間花在當代文本上，花時間閱讀和解釋像柏拉圖、康德等 \"大哲學家 \"的主要文本是否值得？"
    }
  ],
  "title": "Given the exponential growth in philosophy in the past century and given the OPPORTUNITY COST, is it worth spending time reading and interpreting primary texts in the \"great philosophers\" like Plato, Kant, etc. as opposed to spending all of one's time in contemporary texts?",
  "created_utc": 1619620052,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>*For a student in philosophy rather than a student in history of philosophy or particular great philosophers.</p>\n\n<p>This question is asked earnestly. Because I am torn between a division between two types of philosophers: those who think philosophy is nothing more than history of philosophy and those who think nothing could be further from the truth (e.g. Kant himself is of this view). Since many people here seem to emphasise history of philosophy, I understand this question might offend some people.</p>\n\n<p>On the one hand, many people seem to think it is required to read, struggle with, and interpret the primary texts of the &quot;great philosophers&quot;</p>\n\n<p>On the other hand, I (and probably many others) am primarily interested in philosophy per se, that is, the logical, conceptual space of ideas and positions and arguments and how they hang together rather than who had what idea and what motivated them in doing so. And the contemporary conceptual space in any branch of philosophy is probably far more different from and refined from those of the great philosophers and laid out by contemporary philosophers, in say, new articles and textbooks.</p>\n\n<p>Furthermore, it seems like contemporary texts are far easier (and more relevant) to read than great classical texts since they are written in contemporary language and often with far clearer logical structure. One has to spend more time in <em>interpretation</em> in the latter (which I don&#39;t consider to be a <em>primarily philosophical activity</em>, but rather a literary or historical or hermeneutic activity), with opportunity cost to primarily philosophical activities like evaluating arguments and weighing plausibilities, etc.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/n069l6/given_the_exponential_growth_in_philosophy_in_the/",
  "subreddit": "askphilosophy",
  "id": "n069l6",
  "is_self": true,
  "media": null,
  "is_video": false
}