{
  "author": "Delavan1185",
  "the_new_excerpt": "TL;DR Basics:\n\n * Latin American and Canadian subsidiary of InBev (Bud, Stella). Owns Guaraná\n   Antarctica (Brazil's #2 soft drink, after Coke) and Pepsi distribution rights\n   through at least 2027.\n * Rock-solid financials.\n * Trading at a depressed value because of COVID price drop and likely…",
  "original_created_utc": 1613939248,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR基础知识。\n\n * InBev在拉丁美洲和加拿大的子公司(Bud, Stella). 拥有瓜拉纳\n   南极洲（巴西排名第二的软饮料，仅次于可乐）和百事可乐的分销权。\n   至少到2027年。\n * 坚挺的财务状况。 * 交易价值低迷，因为COVID价格下跌，可能...\n *由于COVID价格下跌，交易价值被压低，可能...",
      "title": "$ABEV - 安全的中期宏观游戏，60-100%的上升潜力，广泛的DD和宏观解释!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR基礎知識。\n\n * InBev在拉丁美洲和加拿大的子公司(Bud, Stella). 擁有瓜拉納\n   南極洲（巴西排名第二的軟飲料，僅次於可樂）和百事可樂的分銷權。\n   至少到2027年。\n * 堅挺的財務狀況。 * 交易價值低迷，因爲COVID價格下跌，可能...\n *由於COVID價格下跌，交易價值被壓低，可能...",
      "title": "$ABEV - 安全的中期宏觀遊戲，60-100%的上升潛力，廣泛的DD和宏觀解釋!"
    }
  ],
  "title": "$ABEV - Safe Intermediate-Term Macro Play | 60-100% Upside Potential | Extensive DD and Macro Explanations!",
  "created_utc": 1613962212,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TL;DR Basics:</strong></p>\n\n<ul>\n<li>Latin American and Canadian subsidiary of InBev (Bud, Stella). Owns Guaraná Antarctica (Brazil&#39;s #2 soft drink, after Coke) and Pepsi distribution rights through at least 2027.</li>\n<li>Rock-solid financials.</li>\n<li>Trading at a depressed value because of COVID price drop and likely-reversing currency depreciation in Latin America.</li>\n<li><strong>Verdict:</strong> Stable, long-term market leader with a substantial moat in both the alcoholic and non-alcoholic beverages sector. An excellent hedge against the current bubbling market that should still show significant gains due to COVID reopening. Great place to park and protect profits.</li>\n</ul>\n\n<p><strong>Institutions, Valuation, Financials:</strong></p>\n\n<ul>\n<li>Institutional Ownership: 98.27% (Fidelity)</li>\n<li>Float: 272.2 million (Total*0.0173)</li>\n<li>Short Interest/Days to Cover: 3.0 (MarketBeat)</li>\n<li>Debt/Equity: 0.03 (Morningstar)</li>\n<li>Current Ratio: 1.3 (My calcs)</li>\n<li>Dividend Yield: 3.32% Annual (Fidelity)</li>\n<li>P/E TTM: 25.55 vs. 46.14 industry avg. (Fidelity)</li>\n<li>P/B TTM: 3.15 vs. 9.33 industry avg. (Fidelity)</li>\n</ul>\n\n<p><strong>Macro Upsides: Currency Recovery Play</strong></p>\n\n<p>In January, the Real depreciated 33% vs. USD due to COVID risks prompting a flight to safety. For newbies, a &quot;flight to safety&quot; is when USD appreciates vs. everybody and JPY/Euro appreciate to a lesser extent vs. developing world currencies. This put a short-term squeeze on developing world businesses with global supply chains.</p>\n\n<p>Why? The challenge for developing world businesses is that their <strong><em>income</em></strong> is derived from local currencies - in this case, Brazilian Real is the main one, but also CAD, Argentine peso, &amp; Chilean peso - but their <strong><em>costs</em></strong> are primarily derived from US Dollars, because international commodity contracts are denominated in US Dollars. So, if the company wants to buy sugar for soft drinks or barley for beer brewing, they pay in USD. But when they sell, they earn income in real or pesos. Currency pressure therefore puts pressure on profit margins.</p>\n\n<p>Going forward, emerging market currencies should remain stable or appreciate vs. USD as vaccine rollouts continue; the real economy stabilizes; and institutional risk appetite normalizes. Coupled with Brazil&#39;s recent pension reforms and relatively strong financial picture in the banking sector, I find it highly likely the Real has bottomed-out and will appreciate in the intermediate term.</p>\n\n<p>Note: This is my judgment, as someone who taught undergraduate development economic policy courses for a decade. There are competing opinions, which I discuss below and include in the sources.</p>\n\n<ul>\n<li>Credentials, for those who care: MA International Development 2009 (American University); PhD (ABD) @ UC San Diego).</li>\n</ul>\n\n<p>(An aside: I am curious if newbies appreciate this kind of content. If so, <strong>let me know in the comments or PM me</strong> - I&#39;m likely starting an economic policy substack to help folks understand the broader picture on regulatory issues and such.)</p>\n\n<p><strong>Monthly and Weekly Technicals:</strong></p>\n\n<p>Trading at Long-Term trend support on the monthly chart. Monthly Trend Resistance is around $2.90-3.00.</p>\n\n<p>Daily/Weekly charts have it in the middle of an upward channel trade, but still significantly below 2019 prices. Immediate support levels are at $2.77 and $2.50</p>\n\n<p>Monthly resistance levels: $4.15, $5.15, and $6.00.</p>\n\n<p>My current target is in the $4.50-$5.50 range.</p>\n\n<p><strong>Downside risks:</strong></p>\n\n<ul>\n<li><p>Slightly declining market share in Alcoholic beverages sector to Heineken and Cervejara Petropolis. A lot of this due to Heineken&#39;s previous acquisition of Kirin, aggressive marketing, and the robust craft beer market in Brazil. This has led to increased marketing costs and a slightly declining operating margin. I consider this the most relevant critique. However, I think it is mitigated by multiple factors.  </p>\n\n<ul>\n<li>The most recent filings from AmBev show expanding craft beer portfolio with solid growth in those brands.</li>\n<li>AmBev still has a substantial moat at ~60% market share. Market share erosion is likely to subside given the dominant position.</li>\n<li>Pressure from the downturn in the real and COVID will exert disproportionate pressure on smaller businesses. Given AmBev&#39;s rock-solid financial position and dominant market presence, this creates excellent brand acquisition opportunities.</li>\n</ul></li>\n<li><p>Potential currency risk from two things:  </p>\n\n<ul>\n<li>Vaccine rollouts in South America being undermined by political actors, the most likely being Jair Bolsonaro in Brazil. Given Biden is US president, support from international development institutions, and elite desires to reopen, I find this fairly unlikely.</li>\n<li>Currency risks may continue if vaccination proves a challenge or there is a new COVID surge. Again, I think fairly unlikely - the dominant likelihood is capital flows returning to emerging markets as vaccination rollouts continue.</li>\n</ul></li>\n</ul>\n\n<p><strong>Position:</strong> Long 1300 shares @ $2.85</p>\n\n<p><strong>Disclaimer:</strong> I am not a financial advisor. All investments taken at your own risk.</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/stocks/comments/lp5tew/abev_safe_intermediateterm_macro_play_60100/",
  "subreddit": "stocks",
  "id": "lp5tew",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885070
}