{
  "author": "BrotherBringTheSun",
  "the_new_excerpt": "I've often heard recommendations of keeping x% of your savings in stocks. But\nwith interest rates so low and a good 35 years ahead of me before retirement,\nwhy not keep 100% of my savings in a portfolio with a balance of conservative\nsafe stocks and some growth stocks as well? It is unlikely that…",
  "original_created_utc": 1617937369,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "貯金の○％を株にしておくという提言はよく聞きます。しかし\nこれだけの低金利で、退職までに35年もあるのだから\n貯蓄の100％を保守的で安全な銘柄と成長株のバランスのとれたポートフォリオにしてはどうだろうか？\n保守的で安全な銘柄と、成長株をバランスよく組み合わせたポートフォリオで、自分の貯金を100％維持するのはどうだろう？それはあり得ないことですが...。",
      "title": "全額を株に投資するのは、なぜダメなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常听到一些建议，把x%的存款留在股票上。但是\n在利率如此之低的情况下，在我退休前还有35年的美好时光。\n为什么不把我100%的积蓄放在一个投资组合中，平衡保守的\n安全股和一些成长股也是如此？这不太可能，...",
      "title": "为什么把钱都投资在股票上是个坏主意？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常聽到一些建議，把x%的存款留在股票上。但是\n在利率如此之低的情況下，在我退休前還有35年的美好時光。\n爲什麼不把我100%的積蓄放在一個投資組合中，平衡保守的\n安全股和一些成長股也是如此？這不太可能，...",
      "title": "爲什麼把錢都投資在股票上是個壞主意？"
    }
  ],
  "title": "Why is it a bad idea to invest all of your money in stocks?",
  "created_utc": 1617958709,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve often heard recommendations of keeping x% of your savings in stocks. But with interest rates so low and a good 35 years ahead of me before retirement, why not keep 100% of my savings in a portfolio with a balance of conservative safe stocks and some growth stocks as well? It is unlikely that the market as a whole will go down and stay down for decades so why not go all in? Note: I have enough savings to cover any emergency or large purchase regardless of the status of the market.</p>\n</div><!-- SC_ON -->",
  "score": 96,
  "permalink": "/r/stocks/comments/mn85mv/why_is_it_a_bad_idea_to_invest_all_of_your_money/",
  "subreddit": "stocks",
  "id": "mn85mv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617817
}