{
  "author": "Pammota",
  "original_created_utc": 1642350023,
  "title": "I made a game",
  "created_utc": 1642354352,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone!&lt;/p&gt;\n\n&lt;p&gt;Me and a friend of mine have been working for quite some time on a mobile game. It&amp;#39;s called The Running Knight, and it&amp;#39;s a puzzle game with over 50 levels to solve. The goal of the game is to help a knight pass all the obstacles he might come across in the dungeons. There is a catch! The knight can&amp;#39;t stop moving, so you have to help him avoid obstacles, and build pathways for him to find the exit safely. It&amp;#39;s available both on Android and iOS. Hope you&amp;#39;ll enjoy it!&lt;/p&gt;\n\n&lt;p&gt;Link here: &lt;a href=\"https://www.tofanitty.com\"&gt;https://www.tofanitty.com&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/s5f7sk/i_made_a_game/",
  "subreddit": "SideProject",
  "id": "s5f7sk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello everyone!\n\nMe and a friend of mine have been working for quite some time on a mobile game.\nIt's called The Running Knight, and it's a puzzle game with over 50 levels to\nsolve. The goal of the game is to help a knight pass all the obstacles he might\ncome across in the dungeons. There is a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みなさん、こんにちは。\n\n私と友人は、かなり長い間、携帯電話のゲームに取り組んできました。\nその名も「The Running Knight」で、50以上のレベルがあるパズルゲームです。\nを解く。このゲームのゴールは、騎士がすべての障害を乗り越えるのを助けることです。\nダンジョンで出くわす。そこには、...",
      "title": "ゲームを作ってみた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好!\n\n我和我的一个朋友已经在一个手机游戏上工作了很长时间。\n这款游戏叫 \"奔跑的骑士\"，是一款有50多个关卡的益智游戏。\n解决。游戏的目标是帮助一个骑士通过他可能遇到的所有障碍。\n在地牢中遇到的所有障碍。游戏中，有一个 \"小 \"字。",
      "title": "我做了一个游戏"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好!\n\n我和我的一個朋友已經在一個手機遊戲上工作了很長時間。\n這款遊戲叫 \"奔跑的騎士\"，是一款有50多個關卡的益智遊戲。\n解決。遊戲的目標是幫助一個騎士通過他可能遇到的所有障礙。\n在地牢中遇到的所有障礙。遊戲中，有一個 \"小 \"字。",
      "title": "我做了一個遊戲"
    }
  ]
}