{
  "author": "BushyOreo",
  "original_created_utc": 1655093508,
  "title": "Ironically, fiat has been the safest bet lately.",
  "created_utc": 1655128061,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All the doom and gloom lately with every crypto continuing to drop even after we think we finally hit the bottom for us to only find another hole to drop some more. Even stablecoins lately have been rocked by uncertainty as a fail safe to whether the storm of this winter with things like UST collapsing.&lt;/p&gt;\n\n&lt;p&gt;Now it looks like even exchanges aren&amp;#39;t safe either with many locking funds/crypto to protect themselves. &lt;/p&gt;\n\n&lt;p&gt;I haven&amp;#39;t bought any crypto recently because I instead decided to pay off my car early and after just completing that task this month I&amp;#39;m ready to start buying more stacks.&lt;/p&gt;\n\n&lt;p&gt;Through all this I thought it was funny that the fiat I have has been the best forming asset even with all this inflation lately.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 374,
  "permalink": "/r/CryptoCurrency/comments/vb3ktc/ironically_fiat_has_been_the_safest_bet_lately/",
  "subreddit": "CryptoCurrency",
  "id": "vb3ktc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "All the doom and gloom lately with every crypto continuing to drop even after we\nthink we finally hit the bottom for us to only find another hole to drop some\nmore. Even stablecoins lately have been rocked by uncertainty as a fail safe to\nwhether the storm of this winter with things like UST…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、すべての暗号が下がり続け、悲観的な状況になっています。\nにもかかわらず、どの暗号も下がり続けています。\nもっと下がる。最近、安定コインでさえも、この冬の嵐に耐えられるかどうかのフェイルセーフとして、不確実性に揺さぶられています。\nこの冬の嵐がUSTのようなものであるかどうか...",
      "title": "皮肉なことに、最近はフィアットが最も安全な賭けになっている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近所有的厄运和阴霾，每一种加密货币都在继续下跌，甚至在我们认为我们终于触底之后也是如此。\n我们认为我们终于触底了，但我们只能找到另一个洞，再跌一些\n更多。即使是稳定币最近也受到了不确定性的冲击，作为一种失败的安全保障。\n在这个冬天的风暴中，是否有像UST这样的东西......",
      "title": "讽刺的是，最近法币一直是最安全的赌注。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近所有的厄運和陰霾，每一種加密貨幣都在繼續下跌，甚至在我們認爲我們終於觸底之後也是如此。\n我們認爲我們終於觸底了，但我們只能找到另一個洞，再跌一些\n更多。即使是穩定幣最近也受到了不確定性的衝擊，作爲一種失敗的安全保障。\n在這個冬天的風暴中，是否有像UST這樣的東西......",
      "title": "諷刺的是，最近法幣一直是最安全的賭注。"
    }
  ]
}