{
  "author": "Get_Rekt_Son",
  "the_new_excerpt": "If you come here daily thinking someone will know 100% that the price will go\nback up so you should buy buy buy, or that the price will go even lower so you\nshould sell now then buy back in you are never going to know how to invest\nintelligently.\n\nCrypto is volatile as hell and nobody can predict…",
  "original_created_utc": 1621469617,
  "title": "Stop coming to this sub looking for reasons to buy or sell. Nobody here knows what's going to happen in the future so do what your comfortable with and what's best for you.",
  "created_utc": 1621506762,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you come here daily thinking someone will know 100% that the price will go back up so you should buy buy buy, or that the price will go even lower so you should sell now then buy back in you are never going to know how to invest intelligently. </p>\n\n<p>Crypto is volatile as hell and nobody can predict its future perfectly. If you haven&#39;t learned that lesson yet then you never will and you should sell whatever you have and get out. </p>\n\n<p>If you understand the volatility but maybe you invested more than you should&#39;ve and need that money then sell whatever you need and only leave in what you can afford to go to $0 tomorrow. </p>\n\n<p>If you only ever invested what you can afford then great but don&#39;t try to time the market by reading price predictions and analyzing posts predicting the future of crypto. Learn about Dollar Cost Averaging and stick to that. Timing the market with a 100% success rate is literally impossible so stop trying to do it.</p>\n\n<p>Good luck everyone with whatever you decide to do!</p>\n\n<p>EDIT: fixed some grammar and reformatted so it isn&#39;t a giant wall of text.</p>\n</div><!-- SC_ON -->",
  "score": 340,
  "permalink": "/r/CryptoCurrency/comments/nglho2/stop_coming_to_this_sub_looking_for_reasons_to/",
  "subreddit": "CryptoCurrency",
  "id": "nglho2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381651,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日ここに来て、誰かが価格が上がることを100％知っていると思っている人は\nを買うべきであるとか、もっと下がるから買うべきであるとか。\n今売って、また買えばいいのです。あなたは投資の仕方を知らないでしょう。\nを、賢く使うことができます。\n\n暗号は地獄のように不安定で、誰も予測することができません...",
      "title": "買う理由、売る理由を探してこのサブに来るのはやめてください。将来どうなるかは誰にもわからないのだから、自分が納得できること、自分にとってベストなことをすればいいのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你每天都来这里，认为有人会100%知道价格会回升，所以你应该买入买入。\n涨，所以你应该买入买入，或者价格会更低，所以你应\n现在卖掉然后再买回来，你就永远不知道如何投资了。\n聪明地投资。\n\n加密货币的波动性很大，没有人能够预测...",
      "title": "不要再来这个分会场寻找购买或出售的理由了。这里没有人知道未来会发生什么，所以做你认为舒服的事，做对你最有利的事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你每天都來這裏，認爲有人會100%知道價格會回升，所以你應該買入買入。\n漲，所以你應該買入買入，或者價格會更低，所以你應\n現在賣掉然後再買回來，你就永遠不知道如何投資了。\n聰明地投資。\n\n加密貨幣的波動性很大，沒有人能夠預測...",
      "title": "不要再來這個分會場尋找購買或出售的理由了。這裏沒有人知道未來會發生什麼，所以做你認爲舒服的事，做對你最有利的事。"
    }
  ]
}