{
  "author": "TastyBirdmeat",
  "original_created_utc": 1649205085,
  "title": "Was stealing a base in baseball a deliberate inclusion in the rules, or something that evolved from a lack of rules preventing it?",
  "created_utc": 1649217653,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What&amp;#39;s the history behind stealing a base? It seems like an strange thing to allow? Was it a deliberate inclusion and if so what does it add to the game?&lt;/p&gt;\n\n&lt;p&gt;Or did it evolve from an oversight in the rules that they decided to make an official part of the game?&lt;/p&gt;\n\n&lt;p&gt;It just seems so random to me and I&amp;#39;m not sure what it contributes to the sport and I&amp;#39;m interested in how exactly it came to be&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/tx9gwr/was_stealing_a_base_in_baseball_a_deliberate/",
  "subreddit": "AskHistorians",
  "id": "tx9gwr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What's the history behind stealing a base? It seems like an strange thing to\nallow? Was it a deliberate inclusion and if so what does it add to the game?\n\nOr did it evolve from an oversight in the rules that they decided to make an\nofficial part of the game?\n\nIt just seems so random to me and I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "盗塁の歴史は？不思議なことだと思うのですが\nを許可しますか？意図的に取り入れたのでしょうか、もしそうならゲームに何を追加するのでしょうか？\n\nそれとも、ルールの見落としから発展して、ゲームに加えることになったのでしょうか？\n公式にはどうなっているのでしょうか？\n\n私にはランダムにしか見えないのですが...。",
      "title": "野球の盗塁は、意図的にルールに盛り込まれたものなのか、それともルールで防げないから発展してきたものなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "盗垒背后有什么历史？这似乎是一个奇怪的事情\n允许吗？它是一个特意加入的项目，如果是的话，它对游戏有什么好处？\n\n还是说它是由规则中的一个疏忽演变而来的，他们决定将其作为游戏的正式组成部分？\n游戏的正式部分？\n\n这对我来说似乎很随意，我...",
      "title": "棒球中的偷垒是故意列入规则的，还是从缺乏规则防止偷垒演变而来的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "盜壘背後有什麼歷史？這似乎是一個奇怪的事情\n允許嗎？它是一個特意加入的項目，如果是的話，它對遊戲有什麼好處？\n\n還是說它是由規則中的一個疏忽演變而來的，他們決定將其作爲遊戲的正式組成部分？\n遊戲的正式部分？\n\n這對我來說似乎很隨意，我...",
      "title": "棒球中的偷壘是故意列入規則的，還是從缺乏規則防止偷壘演變而來的？"
    }
  ]
}