{
  "author": "MadMax1754",
  "original_created_utc": 1627094924,
  "title": "I’m super proud of myself.",
  "created_utc": 1627123329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m 17 and was looking on INVSTR because my friends and I all played fantasy finance. Over the latest bear run I’ve actually started thinking about how much I could gain. </p>\n\n<p>Tried all different sorts of apps, realized you had to be 18, did some research on how to avoid the age limit with all of these apps, and while I’m doing this my dad comes up behind me and asks “what have you been doing on your phone” since we were hanging out watching golf. </p>\n\n<p>I told him I wanted to start investing in crypto and he said “delete all those bullshit apps, I’ll set up a Coinbase account for you and we can do this the right way.” </p>\n\n<p>We now have a deal where I’m going to have a joint account with him and he will have his own account that we will start investing money into. </p>\n\n<p>TLDR: I got myself and my dad into crypto. Pretty proud of myself</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/oqhga9/im_super_proud_of_myself/",
  "subreddit": "CryptoCurrency",
  "id": "oqhga9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m 17 and was looking on INVSTR because my friends and I all played fantasy\nfinance. Over the latest bear run I’ve actually started thinking about how much\nI could gain.\n\nTried all different sorts of apps, realized you had to be 18, did some research\non how to avoid the age limit with all of these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は17歳で、友人と一緒にファンタジーをプレイしていたので、INVSTRを見ていました。\nファイナンスをしていました。最近のベアランでは、実際にどれくらいの利益を得られるか考え始めました。\n得ることができました。\n\nいろいろな種類のアプリを試してみて、18歳にならないといけないことに気づき、いくつかのリサーチをしました。\n年齢制限を回避する方法を調べたりして...。",
      "title": "私は自分自身を超誇りに思っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我17岁，在INVSTR上寻找，因为我的朋友和我都在玩幻想\n金融。在最近的熊市中，我实际上已经开始考虑我可以获得多少\n我可以获得多少收益。\n\n尝试了各种不同的应用程序，意识到你必须是18岁，做了一些研究\n做了一些研究，了解如何避免所有这些的年龄限制......",
      "title": "我为自己感到超级自豪。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我17歲，在INVSTR上尋找，因爲我的朋友和我都在玩幻想\n金融。在最近的熊市中，我實際上已經開始考慮我可以獲得多少\n我可以獲得多少收益。\n\n嘗試了各種不同的應用程序，意識到你必須是18歲，做了一些研究\n做了一些研究，瞭解如何避免所有這些的年齡限制......",
      "title": "我爲自己感到超級自豪。"
    }
  ]
}