{
  "author": "Thetaos",
  "the_new_excerpt": "I think this is big enough news to warrant a post even if it deals with bitcoin\nas it deals with one of the largest brokerages in the world and also would allow\npeople with normal investments accounts (IRAs) to gain easy exposure to bitcoin.\n\nTake a look at the following…",
  "original_created_utc": 1616678012,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得这是个足够大的新闻，即使它涉及到比特币，也值得发个帖子\n因为它与世界上最大的经纪公司之一打交道，同时也将使\n有普通投资账户(IRA)的人，可以轻松接触比特币。\n\n下面就来看看...",
      "title": "美国证券交易委员会（SEC）文件指出，富达公司关于创建比特币ETF"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得這是個足夠大的新聞，即使它涉及到比特幣，也值得發個帖子\n因爲它與世界上最大的經紀公司之一打交道，同時也將使\n有普通投資賬戶(IRA)的人，可以輕鬆接觸比特幣。\n\n下面就來看看...",
      "title": "美國證券交易委員會（SEC）文件指出，富達公司關於創建比特幣ETF"
    }
  ],
  "title": "SEC filing points to Fidelity on creating a bitcoin ETF",
  "created_utc": 1616701905,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think this is big enough news to warrant a post even if it deals with bitcoin as it deals with one of the largest brokerages in the world and also would allow people with normal investments accounts (IRAs) to gain easy exposure to bitcoin.</p>\n\n<p>Take a look at the following filing</p>\n\n<p><a href=\"https://www.sec.gov/Archives/edgar/data/1852317/000119312521092598/d133565ds1.htm\">https://www.sec.gov/Archives/edgar/data/1852317/000119312521092598/d133565ds1.htm</a></p>\n\n<p>FD Funds Management LLC  the sponsor of the fund; Fidelity Service Company, Inc. serving as administrator. FD Funds Management LLC  lists the Address as Fidelity&#39;s headquarters in Boston.</p>\n\n<p>From the fling</p>\n\n<p><em>&quot;The Trust&#39;s investment objective is to seek to track the performance  of bitcoin, as measured by the performance of the Fidelity Bitcoin  Index PR (the &quot;Index&quot;), adjusted for the Trust&#39;s expenses and other  liabilities,&quot; the filing notes, explaining elsewhere: &quot;The Trust  provides direct exposure to bitcoin, and the Shares of the Trust are  valued on a daily basis using the same methodology used to calculate the  Index. The Trust provides investors with the opportunity to access the  market for bitcoin through a traditional brokerage account without the  potential barriers to entry or risks involved with holding or  transferring bitcoin directly, acquiring it from a bitcoin spot market,  or mining it.&quot;</em></p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/investing/comments/mcxxm8/sec_filing_points_to_fidelity_on_creating_a/",
  "subreddit": "investing",
  "id": "mcxxm8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140052
}