{
  "author": "Mbayer92",
  "original_created_utc": 1632526950,
  "title": "I genuinely feel nothing towards my own newborn son... Is this ok?",
  "created_utc": 1632540168,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit 2; This post has been blown up and I&#39;m just going to TLDR the comments for anyone going through something similar because my questions have been answered and I feel so much better.</p>\n\n<p>1) postpartum does exist in men. If you feel this way please educated yourself. Don&#39;t be afraid to seek help, and talk to your partner.</p>\n\n<p>2) this feeling is in fact ok. It takes time. As long as you don&#39;t want to harm yourself, the child, or your partner, nor neglect any of the above, give it time and make the effort. Baby&#39;s are people. Meet them. Sometimes you have to learn to love them, it doesn&#39;t come natural to everyone in every scenario.</p>\n\n<p>Let me preface this by saying I in no way have any intent nor desire to harm nor neglect him in ANY way.</p>\n\n<p>My son was born Wednesday morning and we just got home from the hospital. From the time I&#39;ve seen him his mom (my girlfriend) has been wanting to hold him, see him, be around him etc. Same with all of her family. My family has been out of my life for quite some time. </p>\n\n<p>I&#39;ve been a &quot;stay at home step dad&quot; for the last year to her two older children, and whilst they apparently have an emotional attachment to me it feels like more of a job to watch them. A job I enjoy, but still a job. No emotional connection really. I look forward to the weekend when they go to their fathers like any other job feels..</p>\n\n<p>When my son was on the way I thought &quot;it will be different, he&#39;s mine&quot;. But it doesn&#39;t feel that way at all. Looking at him I feel no love. Nothing more than the feeling I have taking care of newborn animals or whatever. Is this normal for guys? Is this ok? Is it something I should seek help for? My best friend just had a kid and he&#39;s so infatuated and it&#39;s all he can think or speak of and I&#39;m just feeling like, meh. It&#39;s another person. Even in the delivery room I was more concerned with my girlfriend than the baby, I only really went to him because the social cues of the nurses.</p>\n\n<p>Edit; Update, I finally got the nerve up to speak with my girlfriend about this, using this post and everyone&#39;s comments as a &quot;helper&quot; for the conversation because trying to say the words &quot;I don&#39;t love him&quot; felt wrong. She is completely understanding. Tonight I&#39;m going to try and do skin to skin with him. She also let go of her own story, how with her middle child of the now three, she was wanting to leave the father and didn&#39;t find out she was pregnant until 7 months. She had the same feelings as me. Now he&#39;s with us 5 days a week, and recently had a health scare where she&#39;s almost in tears saying she will give him her kidney if he needs it. </p>\n\n<p>She also pointed out, with her having a c section with complications, my worry for her may be overshadowing any bonding I could have with him.</p>\n\n<p>I will be doing research into postpartum in father&#39;s, and if I feel it doesn&#39;t get any better or gets worse in any way, trust me I&#39;ll be the first one to get help. I genuinely do WANT to love the little guy in a traditional sense. And I will one day. Thank you everyone for the support and kind words.</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/TooAfraidToAsk/comments/puv8ik/i_genuinely_feel_nothing_towards_my_own_newborn/",
  "subreddit": "TooAfraidToAsk",
  "id": "puv8ik",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit 2; This post has been blown up and I'm just going to TLDR the comments for\nanyone going through something similar because my questions have been answered\nand I feel so much better.\n\n1) postpartum does exist in men. If you feel this way please educated yourself.\nDon't be afraid to seek help, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Edit 2; この投稿は爆破されているので、私はただコメントをTLDRするつもりです。\n同じような経験をしている人のためにコメントを書きます。\n疑問が解消されて、とても気分が良くなりました。\n\n1) 産後は男性にもあります。もしそう感じたら、自分自身を教育してください。\n恐れずに助けを求めてください。そして...",
      "title": "生まれたばかりの自分の息子に対して、純粋に何も感じない...。これでいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑2；这个帖子已经被炸毁了，我只想把评论的内容转述给\n因为我的问题已经得到了解答\n而且我感觉好多了。\n\n1）产后确实存在于男性身上。如果你有这种感觉，请对自己进行教育。\n不要害怕寻求帮助，而且...",
      "title": "我对我自己的新生儿子真的没有感觉......。这样做可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯2；這個帖子已經被炸燬了，我只想把評論的內容轉述給\n因爲我的問題已經得到了解答\n而且我感覺好多了。\n\n1）產後確實存在於男性身上。如果你有這種感覺，請對自己進行教育。\n不要害怕尋求幫助，而且...",
      "title": "我對我自己的新生兒子真的沒有感覺......。這樣做可以嗎？"
    }
  ]
}