{
  "author": "MichKOG",
  "the_new_excerpt": "There is this fund called Silver Lake Partners, which was holding AMC\nconvertible debt. Well, it’s not actually a fund, more like a PE firm. Anyway.\n\nConvertible bonds are essentially like normal bonds, except they can converted\nto stock after the stock reaches a conversion price which is specified…",
  "original_created_utc": 1612312319,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有这样一个基金叫银湖基金，它是持有AMC的。\n可转债。嗯，这其实不是一个基金，更像是一个PE公司。总之。\n\n可转债本质上和普通的债券一样，除了它们可以转换\n在股票达到指定的转换价格后，将其转换为股票... ...",
      "title": "你是如何让一只基金1.13亿财富的故事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有這樣一個基金叫銀湖基金，它是持有AMC的。\n可轉債。嗯，這其實不是一個基金，更像是一個PE公司。總之。\n\n可轉債本質上和普通的債券一樣，除了它們可以轉換\n在股票達到指定的轉換價格後，將其轉換爲股票... ...",
      "title": "你是如何讓一隻基金1.13億財富的故事。"
    }
  ],
  "title": "Story on how you made a fund 113 million dollars richer",
  "created_utc": 1612326743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is this fund called Silver Lake Partners, which was holding AMC convertible debt. Well, it’s not actually a fund, more like a PE firm. Anyway.</p>\n\n<p>Convertible bonds are essentially like normal bonds, except they can converted to stock after the stock reaches a conversion price which is specified in the bond agreement. Essentially, I own 1 bond for 1000 dollars, and if the price reaches 10 dollars per share, I can convert the bond into shares and just dip (sell or hold). Sounds fairly easy, right?</p>\n\n<p>Well, Silver Lake Partners was holding these bonds, probably super depressed knowing that they will be pretty much worthless if AMC goes bankrupt. However, here is where WSB apes come in play. They spike the price so much that the conversion price specified on the bonds is actually reached. Silver Lake can not believe their fucking luck, they convert the bonds into shares and dump it last week at the heigh of the bubble, selling shares for 713 million dollars, and making a profit of 113 million. \nThis also triggers a share dilution which eases the chances of any potential short squeeze, and lowers a potential future price per share.</p>\n\n<p>Moral of the story?\nThese people from San Francisco just got way richer and dumped their bags on retail investors. This is why it is bad to trade on emotions, you will inevitably help some of these people you hate, and be left holding the bag. </p>\n\n<p>Full story: <a href=\"https://www.google.com/amp/s/www.businessinsider.com/amc-entertainment-silver-lake-sells-shares-113-million-reddit-2021-1%3famp\">https://www.google.com/amp/s/www.businessinsider.com/amc-entertainment-silver-lake-sells-shares-113-million-reddit-2021-1%3famp</a></p>\n</div><!-- SC_ON -->",
  "score": 263,
  "permalink": "/r/stocks/comments/lbb1vg/story_on_how_you_made_a_fund_113_million_dollars/",
  "subreddit": "stocks",
  "id": "lbb1vg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541060
}