{
  "author": "Vrozini",
  "the_new_excerpt": "I am doing DD on dividend stocks as a new investor. I am a little lost starting\nout. So, let's take Lowes as an example, a company that has consistently payed\ndividends for over 50 years.\n\nRight now their cost per share is 200.30$\n\nLowe's Companies pays an annual dividend of $2.40 per share, with a…",
  "original_created_utc": 1620196367,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資初心者で配当株のDDをしています。少し迷っています。\nしています。そこで、50年以上も一貫して配当を出し続けているLowes社を例に挙げてみましょう。\n50年以上も一貫して配当を出し続けている会社です。\n\n現在、同社の一株あたりのコストは200.30ドルです。\n\nLowe's Companiesは、1株あたり2.40ドルの年間配当を行っており、その...",
      "title": "配当株でどうやってパッシブインカムを構築するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我作为一个新的投资者，正在做红利股票的DD。我在开始时有点迷茫\n绪。那么，让我们以Lowes为例，这家公司已经持续支付了50多年的\n股息超过50年。\n\n现在他们的每股成本是200.30美元\n\n洛氏公司每年派发的股息为每股2.40美元，有...",
      "title": "人们怎么可能从红利股票中建立任何形式的被动收入？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我作爲一個新的投資者，正在做紅利股票的DD。我在開始時有點迷茫\n緒。那麼，讓我們以Lowes爲例，這家公司已經持續支付了50多年的\n股息超過50年。\n\n現在他們的每股成本是200.30美元\n\n洛氏公司每年派發的股息爲每股2.40美元，有...",
      "title": "人們怎麼可能從紅利股票中建立任何形式的被動收入？"
    }
  ],
  "title": "How can people possibly build any sort of passive income from dividend stocks??",
  "created_utc": 1620228073,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am doing DD on dividend stocks as a new investor. I am a little lost starting out. So, let&#39;s take Lowes as an example, a company that has consistently payed dividends for over 50 years.</p>\n\n<p>Right now their cost per share is 200.30$</p>\n\n<p>Lowe&#39;s Companies pays an annual dividend of $2.40 per share, with a dividend yield of 1.20%. ... Lowe&#39;s Companies pays out 41.96% of its earnings out as a dividend.</p>\n\n<p>This is the information on Lowes yield % per share.</p>\n\n<p>So at a cost of 200.30$, you&#39;re only getting 2.40$ back every 3 months? You would have to own a very significant amount of shares to make this worth while, no? </p>\n\n<p>How do people make a worth while amount of money through dividend stocks when many of the reliable companies are at a very high price with typically below 2% yield? </p>\n\n<p>Are they finding not as stable companies with a higher yield? Do they diversify in someway that I would not understand? </p>\n\n<p>I&#39;m currently researching pros and cons of Dividend stocks, and this is something that has halted me in my tracks a little.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/stocks/comments/n59bno/how_can_people_possibly_build_any_sort_of_passive/",
  "subreddit": "stocks",
  "id": "n59bno",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968356
}