{
  "author": "Halfhand84",
  "the_new_excerpt": "Bought my first bitcoins at $255 in November 2013. Have held and continued to\ndollar cost average since then. In the spring, my wife and l will be moving into\na swanky Manhattan co-operative thanks to Bitcoin.\n\nMy entire life is changed thanks to that fateful decision in the fall of 2013. I\njust…",
  "original_created_utc": 1608996981,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2013年11月，我以255美元的价格购买了第一批比特币。一直坚持并继续\n从那以后的平均美元成本。春天，我妻子和l将搬进\n多亏了比特币，一个时髦的曼哈顿合作社。\n\n多亏了2013年秋天那个决定性的决定，我的整个生活都改变了。我\n就是…",
      "title": "截至目前，我从2013年11月的首次毕生储蓄投资中获得了10000%(100倍)的利润。比特币改变了我的生活。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2013年11月，我以255美元的價格購買了第一批比特幣。一直堅持並繼續\n從那以後的平均美元成本。春天，我妻子和l將搬進\n多虧了比特幣，一個時髦的曼哈頓合作社。\n\n多虧了2013年秋天那個決定性的決定，我的整個生活都改變了。我\n就是…",
      "title": "截至目前，我從2013年11月的首次畢生儲蓄投資中獲得了10000%(100倍)的利潤。比特幣改變了我的生活。"
    }
  ],
  "title": "As of this moment, I am up 10,000% (100x) profit from my initial life savings investment in Nov 2013. Bitcoin has changed my life.",
  "created_utc": 1609001775,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bought my first bitcoins at $255 in November 2013. Have held and continued to dollar cost average since then. In the spring, my wife and l will be moving into a swanky Manhattan co-operative thanks to Bitcoin.   </p>\n\n<p>My entire life is changed thanks to that fateful decision in the fall of 2013. I just wanted to celebrate this moment and to say a HUGE THANK YOU to all the hodlers, coders, memers, and believers in Bitcoin! You all rock!!! Couldn&#39;t have done it without you!</p>\n\n<p>P.S.</p>\n\n<p>For those wondering, no, I&#39;m still not selling any yet at this price.</p>\n</div><!-- SC_ON -->",
  "score": 1974,
  "permalink": "/r/Bitcoin/comments/kkkd0j/as_of_this_moment_i_am_up_10000_100x_profit_from/",
  "subreddit": "Bitcoin",
  "id": "kkkd0j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495327981
}