{
  "author": "psykikk_streams",
  "the_new_excerpt": "TLDR: this will fade out and nothing will change at all.\n\n----\n\nFirst of all, I am by no means a financial expert or claim to be one. I am\nsuccessful at doing stuff with my money (avg return / year of well over 15%) and\nthink I can handle myself.\n\nI also am 45 years old and have seen a few things…",
  "original_created_utc": 1612011005,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：这将会淡出，根本不会有任何改变。\n\n----\n\n首先，我绝不是理财专家，也不自称是专家。我是\n成功地用我的钱做一些事情（每年平均回报率超过15%），并且\n自认为可以自理。\n\n我也45岁了，也见过一些... ...",
      "title": "我对将要发生的事情的预测"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：這將會淡出，根本不會有任何改變。\n\n----\n\n首先，我絕不是理財專家，也不自稱是專家。我是\n成功地用我的錢做一些事情（每年平均回報率超過15%），並且\n自認爲可以自理。\n\n我也45歲了，也見過一些... ...",
      "title": "我對將要發生的事情的預測"
    }
  ],
  "title": "My prediciton on what will happen",
  "created_utc": 1612030081,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: this will fade out and nothing will change at all.</p>\n\n<p>----</p>\n\n<p>First of all, I am by no means a financial expert or claim to be one. I am successful at doing stuff with my money (avg return / year of well over 15%) and think I can handle myself.</p>\n\n<p>I also am 45 years old and have seen a few things here and there.</p>\n\n<p>I was also something you could call &quot;an early adopter&quot; when it comes to the internet, social media, etc etc.</p>\n\n<p>My predictions (or rather, opinions) are more or less based upon the latter two.</p>\n\n<p>&#x200B;</p>\n\n<p>So here we go.</p>\n\n<p><strong>The current situation</strong></p>\n\n<p>From what I gathered, there´s different types of people involved. And I am solely talking about the retailers here. The side of the whole thing that THINK, they got all the leverage.</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><strong>the Believers</strong></li>\n</ol>\n\n<p>those make up the people that pake part because they believe they finally have some say , some kind of leverage, some kind of power to force real change. whether it is changes to market rules, legal oversight, changes of law... you name it. those people have real conviction and are willing to see it through.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>2. the investors</strong></p>\n\n<p>there might be overlap to group 1., yet these people have actual believe , not only in the message being sent, but the company as well. you can argue all you want, but the fact is that GME brought in new, extremely committed and experienced management and was / is in the phase of a corporate change. it might take them years and it might fail, but there is a chance they might pull it off. group 2 believes in this, hence the investment into it.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>3. the traders</strong></p>\n\n<p>they see this purely as a chance of having one of the best chance of high yield return of their lifetime (which is not wrong at all). they might also believe that they help the world become a better place to justify their behavior, which is also ok. yet they are mainly in for the gains. they are rather rational about the situation and simply wait for thee right moment. the only thing that sets them apart from 4, is their actual rational response to the situation</p>\n\n<p>&#x200B;</p>\n\n<p><strong>4. the hyper.</strong></p>\n\n<p>those people jump on the bandwagon simply because it is happening. the same people will spread their money around, buying AMC, doge or even silver right now. they lack the understanding or they lack interest and patience to really try to understand the situation at all.</p>\n\n<p>they want clout, ganis, or- the best - they want both. some are even stupid enough to sell all they have, luquidate whatever available and pour everything into one stock, if the hype is big enough.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Prediction</strong></p>\n\n<p><strong>group 4:</strong></p>\n\n<p>trends change, sentiments and rationales change. they were never so easy to manipulate as well.</p>\n\n<p>most people will get bored , or simply jump on the next bandwagon. this means, 4 will skip the train as soon as the holding battle simply takes too long for their attention span. if you do not have the cashflow to actively be involved in regards to buying more when the price warrants it, you got nothing to do but wait and be patient. which is a concept very hard to grasp when you are trying to keep up with ery single hypetrain out there.</p>\n\n<p>and since they all over sudden realize that they got all their assets into one thing thats not doing anything, they will simply pull out sooner rather than later.</p>\n\n<p>at one point in the normal market fluctuation they will set their limits lower than anticipated and just jump ship.</p>\n\n<p><strong>group 3</strong></p>\n\n<p>will eventually do the same, just a little later, simply because they understand the situation better and have much smarter goals. they are in it for the returns. right now they might not be 100% sure what target that is, but they will form a decision really soon. remember, they were never in it for the long run...</p>\n\n<p><strong>group 2</strong><br/>\nremember, they are in it for the long run anyways. but as said before, patient and REAL investors that see long term potential are kinda rare these days. and not enough are in it right now.</p>\n\n<p><strong>group 1:</strong></p>\n\n<p>they are saying they will ride it out until the end. which is great.</p>\n\n<p>&#x200B;</p>\n\n<p>so what does all this mean:</p>\n\n<p>people underestimate how markets work, what strings will and can be pulled. they overestimate patience and conviction.</p>\n\n<p>also, people TOTALLY and utterly fail to understand the core principle of greed, which drives most of the groups mentioned here.</p>\n\n<p>&#x200B;</p>\n\n<p>once the price of each individual involved is reached, the cookie WILL start to crumble.</p>\n\n<p>for some its 500, for most it might be 750, 1000 dollars.</p>\n\n<p>who knows. but this is no situation that will be going on for weeks. this will fade out. simply because most people lose interest or see their chances of high returns dwindling. or they need their money for other investments. or they suddenly realize that putting all this money into something that doesnt pan out wasn´t so smart afterall.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>OVERALL</strong></p>\n\n<p>I sincerely hope changes will come- and they probably will.</p>\n\n<p>The current situation clearly exposed how markets are worked and how they operate on a level of transparency, that only happened in 2008.</p>\n\n<p>so how did things change after 2008 ? now think about the ramifications of 2008 compared to this. now try to think - rationaly - how realistic it is that actual , FUNDAMENTAL changes are being established and put into action ?</p>\n\n<p>do you really think they will make short sales illegal ? do you really think they will make naked sales illegal ? do you think they will make fundamental changes to what the SEC actually controls and how they do it ? seriously ?</p>\n\n<p>the only thing that will come from this, MIGHT be:</p>\n\n<p>- better(harsher) regulations for retail trading platforms</p>\n\n<p>&#x200B;</p>\n\n<p>- harsher regulations regarding market manupilations through means of social media</p>\n\n<p>&#x200B;</p>\n\n<p>- a wealth tax for the super rich.</p>\n\n<p>&#x200B;</p>\n\n<p>why this ? because it is easy to sell to the public, build hype and support upon it. will it change anything ? of course not. Oh wait, yes it will. it will make it harder for retail traders. it will make it harder for us.</p>\n\n<p>&#x200B;</p>\n\n<p>more regulations for trade providers means more costs at providing services means no free trading apps anymore. hard to make a buck for trading apps when you cannot sell trade information of your customers to market makers anymore.</p>\n\n<p>&#x200B;</p>\n\n<p>we already are being censored more and more. words are flagged, opinions are flagged, and sooner or later, forums, and whole platforms will be flagged. and then closed and called illegal. its already happening in regards to other platforms. Not that I really care or support anyone using sovial media for dusgusting and absurd poilitical reasons and opinions, but censoring and de-legalizing it is still censorship. thats not something that can be good any democracy.</p>\n\n<p>&#x200B;</p>\n\n<p>and a wealth tax for the super rich? that´s like revers trickle down ecomomics. instead of thinking when they have all their money it will trickle down, we just make sure they pay for it once they have it.</p>\n\n<p>it disregards the fact that simply ba having money, they also have the means to pay lawyers a few millions to find ways they do not have to pay even more millions to pay their taxes. its what´s already happening. this will not help the small , average Joe</p>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/stocks/comments/l8l1h7/my_prediciton_on_what_will_happen/",
  "subreddit": "stocks",
  "id": "l8l1h7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537974
}