{
  "author": "throwmeawaytodayclay",
  "original_created_utc": 1649736324,
  "title": "Throwaway for obvious reasons, why am I a necrophiliac?",
  "created_utc": 1649750892,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am not an actual practicing necrophiliac nor will I ever try to be. I also don’t JO to actual dead people either as it scares me. There may be another term for this but I get off to people “dying” whether it be a scene in a movie or a porn where they pretend to kill someone. I don’t really like extreme gore but I do like strangling, choking, poisoning, low blood shootings or stabbings. I’ve been like this since I was 12 and it’s kind of disgusted me that I have such a weird fetish. I’m wondering what it was that triggered this, I read an article today that brought some thought to this. It described how violence towards women has been advertised over the years and it has been a problem with objectifying women. An example of this advertising can be the “beautifully executed” ads for hitman: blood money where women are shown scantily clad with a bullet hole in there head I don’t remember ever seeing these kinds of ads as a child but subliminal messaging can be a bitch. &lt;/p&gt;\n\n&lt;p&gt;What drives me away from this theory though is that I seem to be more turned on by the concept of death. I was watching a show, “Utopia” on YouTube and there is a scene where an unattractive man is slowly killed, his throat is cut, he drags himself to a glass door and slides down with some blood and I was horny as fuck. Of course I’m not gay as men don’t really do it for me but a scene of one fully clothed man strangling another might just do it for me. While the ideal porn for me is naked women being desecrated post mortem any normal murder scene close and personal might do it for me.&lt;/p&gt;\n\n&lt;p&gt;I’m not looking for people telling me to get help I just want to know, what the fuck is wrong with me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 134,
  "permalink": "/r/TooAfraidToAsk/comments/u1q8gj/throwaway_for_obvious_reasons_why_am_i_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "u1q8gj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I am not an actual practicing necrophiliac nor will I ever try to be. I also\ndon’t JO to actual dead people either as it scares me. There may be another term\nfor this but I get off to people “dying” whether it be a scene in a movie or a\nporn where they pretend to kill someone. I don’t really like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は実際に死体愛好家ではないし、そうなろうとするつもりもない。また、私は\n実際の死者へのJOも怖くてしません。別の言葉があるかもしれませんが\n映画のワンシーンであろうと、人が「死ぬ」ことに興奮するのです。\nポルノで人を殺すふりをする。私は本当に好きではない...",
      "title": "明らかな理由で投げやり、なぜ私は死体愛好家なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是一个真正的恋尸癖者，我也不会试图成为恋尸癖者。我也\n我也不和真正的死人打交道，因为这让我感到害怕。也许有另一个术语\n但我对人们的 \"死亡 \"感到兴奋，不管是电影中的场景还是色情片中的场景。\n他们假装杀人的色情片。我不太喜欢...",
      "title": "扔掉的原因很明显，我为什么是恋尸癖？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是一個真正的戀屍癖者，我也不會試圖成爲戀屍癖者。我也\n我也不和真正的死人打交道，因爲這讓我感到害怕。也許有另一個術語\n但我對人們的 \"死亡 \"感到興奮，不管是電影中的場景還是色情片中的場景。\n他們假裝殺人的色情片。我不太喜歡...",
      "title": "扔掉的原因很明顯，我爲什麼是戀屍癖？"
    }
  ]
}