{
  "author": "JuicySpark",
  "the_new_excerpt": "Ok, I'd like to start out by stressing that this is not meant to be a shitpost.\n\nr/Bitcoin [/r/Bitcoin] had us beat. We surpassed them by 50-100K I think.\n\nObviously that means moons are the poor mans bitcoin. A place to talk about\ncrypto generates tons of traffic. Being the number 1 in that…",
  "original_created_utc": 1623983697,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OK、最初に強調しておきたいのは、これはクソポストになるようなものではないということです。\n\nr/Bitcoin [/r/Bitcoin]にやられました。5～10万ドルの差で彼らを上回っていたと思います。\n\n明らかに月は貧乏人のビットコインだということです。暗号について話す場所は\ncryptについて語る場所は大量のトラフィックを生み出します。その中で1番というのは...。",
      "title": "ついにNo.1のCrypto Subredditになりました！ムーンは貧乏人のビットコイン！モチベーションを上げよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我想先强调一下，这并不是要做一个狗屎帖。\n\nr/Bitcoin [/r/Bitcoin]把我们打败了。我们超过了他们5-10万，我想。\n\n很明显，这意味着月亮是穷人的比特币。一个谈论的地方\n谈论加密货币的地方会产生大量的流量。作为该领域的第一...",
      "title": "我们终于成为第一大加密货币子网站，月球是穷人的比特币，并得到激励"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我想先強調一下，這並不是要做一個狗屎帖。\n\nr/Bitcoin [/r/Bitcoin]把我們打敗了。我們超過了他們5-10萬，我想。\n\n很明顯，這意味着月亮是窮人的比特幣。一個談論的地方\n談論加密貨幣的地方會產生大量的流量。作爲該領域的第一...",
      "title": "我們終於成爲第一大加密貨幣子網站，月球是窮人的比特幣，並得到激勵"
    }
  ],
  "title": "We are finally the Number 1 Crypto Subreddit, and Moons are the poor man's Bitcoin, and get Motivated",
  "created_utc": 1624005313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok, I&#39;d like to start out by stressing that this is not meant to be a shitpost.</p>\n\n<p><a href=\"/r/Bitcoin\">r/Bitcoin</a> had us beat.   We surpassed them by 50-100K I think. </p>\n\n<p>Obviously that means moons are the poor mans bitcoin.   A place to talk about crypto generates tons of traffic.   Being the number 1 in that department means this subs own crypto is in it&#39;s early stages of exploding.</p>\n\n<p>Obviously.  Anyone who can&#39;t see that has 1 braincell left, and they just killed that reading this.    Moons will moon.</p>\n\n<p>I would start talking to your co workers about it, your boss , your clients, your mom, your dad, your aunt&#39;s, your friends, and even drug dealers. </p>\n\n<p>If none of them can see what you mean, then none of them deserve a piece of the pie. </p>\n\n<p>You see...  You where born to do this.  Those who have courage attract success. </p>\n\n<p>Need energy to do this? Go out and run, bench press iron.   If you don&#39;t have that, go out and pick up logs, or bags of dirt and start walking with it. Walk as far as you can. Who cares what people think they aren&#39;t moon believers ...right?  If you don&#39;t have legs then crawl.  Do whatever you can to tell people how much you believe in moons. </p>\n\n<p>People will notice.  Believe me. Probably psychiatrists.  But what do they know? They are crazy too. </p>\n\n<p>Be well</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/o2ej0o/we_are_finally_the_number_1_crypto_subreddit_and/",
  "subreddit": "CryptoCurrency",
  "id": "o2ej0o",
  "is_self": true,
  "media": null,
  "is_video": false
}