{
  "author": "Kevin3683",
  "original_created_utc": 1631405443,
  "title": "All the cryptocurrency tax information you don’t want, but need to know. (US taxes)",
  "created_utc": 1631412567,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Which transactions are taxable events and which ones aren’t? What has to reported and what doesn’t? </p>\n\n<p>Fair warning: This is going to be a long post with a lot of information. This entire post is a TL:DR of cryptocurrency taxes. </p>\n\n<p>….but I reluctantly added a TLDR at the end</p>\n\n<p>There are tax laws that absolutely apply, guidance issued by the IRS that isn’t law, and scenarios where no one knows what the hell to do. I’ve tried to sort it out. </p>\n\n<h3>I’m not a tax expert. I’m not a financial advisor. I’m literally a random Kevin. Use this post as a starting point. Do your own research.</h3>\n\n<p>One of my main sources for this post is the Internal Revenue Service’s website. I’ll list other sources at the end. </p>\n\n<p>May the wings of capital gains carry you a loft to dance on the moon.</p>\n\n<hr/>\n\n<h2>TABLE OF CONTENTS</h2>\n\n<p><strong>1) A Cryptocurrency description from the Internal Revenue Service Of The United States of America</strong></p>\n\n<p><strong>2) Types of taxes associated with crypto and their rates</strong> \n   -  2A) Income taxes and 2021 brackets \n   - 2B) Short term capital gains and 2021 brackets \n   - 2C) Long term capital gains and 2021 brackets\n   - 2D) Collectable Capital gains</p>\n\n<p><strong>3) Taxable events, corresponding tax rates, non taxable events, required reporting</strong> \n   - 3A) Purchasing\n   - 3B) Holding (HODL)\n   - 3C) Transferring between wallets\n   - 3D) Debit/credit/prepaid crypto back rewards cards\n   - 3E) Staking rewards\n   - 3F) Interest payments\n   - 3G) Airdrops\n   - 3H) Crypto to fiat sells\n   - 3I) Crypto to crypto sells\n   - 3J) Mining rewards (staking as well for the most part)\n   - 3K) Crypto received as payments for goods and services \n   - 3L) NFTs (regular and liquidity)</p>\n\n<p><strong>4) Determining your taxable profit/loss and your tax liability with examples of transactions from section 3</strong> \n- EXAMPLE 1: Determining gains and taxes owed on crypto you purchased with fiat and sold for fiat\n- EXAMPLE 2: Using the First In First Out method to determine capital gains. \n- EXAMPLE 3: Determining  tax liability on staking rewards that you did not sale. (Applies to interest, airdrops)\n- EXAMPLE 4: Determining tax liability on staking rewards that you did sale. (applies to interest, airdrops)\n- EXAMPLE 5: Crypto to crypto trades\n- Tips on minimizing taxes owed (lawfully) included </p>\n\n<p><strong>5) Glossary and Sources</strong> \n   - Important words, phrases, and abbreviations in this post that are distinguished by being both <strong><em>bold</em></strong> and <strong><em>italicized</em></strong> can be found in the glossary. </p>\n\n<p>Some words may seem self explanatory but are defined differently by the IRS for tax purposes. </p>\n\n<hr/>\n\n<h2>SECTION 1: Excerpts from the <strong><em>IRS</em></strong> description of cryptocurrency as stated on IRS. GOV</h2>\n\n<p>“Cryptocurrency is a type of virtual currency that uses cryptography to secure transactions that are digitally recorded on a distributed ledger, such as a blockchain.”\\\n“Virtual currency is a digital representation of value, other than a representation of the U.S. dollar or a foreign currency (“real currency”), that functions as a unit of account, a store of value, and a medium of exchange.”\\\n“Regardless of the label applied, if a particular asset has the characteristics of virtual currency, it will be treated as virtual currency for Federal income tax purposes.”\\\n“Virtual currency is treated as property and general tax principles applicable to property transactions apply to transactions using virtual currency.”\\</p>\n\n<hr/>\n\n<h2>SECTION 2: Types of taxes associated with crypto and their rates</h2>\n\n<h3>2A Income Tax</h3>\n\n<p>Your <strong><em>tax liability</em></strong> for certain cryptocurrency transactions (listed and explained in section 3) will be based on one of the seven tax rates that apply to you based on your <strong><em>adjusted</em></strong> <strong><em>gross</em></strong> <strong><em>income</em></strong> and filing status. </p>\n\n<p>The proceeds you receive from qualifying transactions will be taxed according to your personal income bracket along with the rest of your income. This is a different than the tax that’s levied on the sale of <strong><em>capital</em></strong> <strong><em>assets</em></strong>. </p>\n\n<p>The 2021 income tax brackets:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">RATE</th>\n<th align=\"right\">SINGLE</th>\n<th align=\"center\">MARRIED/JOINT</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">10%</td>\n<td align=\"right\">$0-$9,950</td>\n<td align=\"center\">$0-$19,000</td>\n</tr>\n<tr>\n<td align=\"left\">12%</td>\n<td align=\"right\">$9,951-$40,525</td>\n<td align=\"center\">$19,901-$81,050</td>\n</tr>\n<tr>\n<td align=\"left\">22%</td>\n<td align=\"right\">$40,526-$86,375</td>\n<td align=\"center\">$81,051-$172,750</td>\n</tr>\n<tr>\n<td align=\"left\">24%</td>\n<td align=\"right\">$86,376-$164,925</td>\n<td align=\"center\">$172,751-$329,850</td>\n</tr>\n<tr>\n<td align=\"left\">32%</td>\n<td align=\"right\">$164,296-$209,425</td>\n<td align=\"center\">$329,851-$418,850</td>\n</tr>\n<tr>\n<td align=\"left\">35%</td>\n<td align=\"right\">$209,426-$523,600</td>\n<td align=\"center\">$418,851-$628,300</td>\n</tr>\n<tr>\n<td align=\"left\">37%</td>\n<td align=\"right\">$523,601 +</td>\n<td align=\"center\">$628,301 +</td>\n</tr>\n</tbody></table>\n\n<table><thead>\n<tr>\n<th align=\"left\">RATE</th>\n<th align=\"right\">MARRIED/SEPARATE</th>\n<th align=\"center\">HEAD OF HOUSE</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">10%</td>\n<td align=\"right\">$0-$9,950</td>\n<td align=\"center\">$0-$14,200</td>\n</tr>\n<tr>\n<td align=\"left\">12%</td>\n<td align=\"right\">$9,951-$40,525</td>\n<td align=\"center\">$14,201-$54,200</td>\n</tr>\n<tr>\n<td align=\"left\">22%</td>\n<td align=\"right\">$40,526-$86,376</td>\n<td align=\"center\">$54,201-$86,350</td>\n</tr>\n<tr>\n<td align=\"left\">24%</td>\n<td align=\"right\">$86,376-$164,925</td>\n<td align=\"center\">$86,351-$164,900</td>\n</tr>\n<tr>\n<td align=\"left\">32%</td>\n<td align=\"right\">$164,926-$209,425</td>\n<td align=\"center\">$164,901-$209,400</td>\n</tr>\n<tr>\n<td align=\"left\">35%</td>\n<td align=\"right\">$209,426-$314,150</td>\n<td align=\"center\">$209,401-$523,600</td>\n</tr>\n<tr>\n<td align=\"left\">37%</td>\n<td align=\"right\">$314,151 +</td>\n<td align=\"center\">$523,601 +</td>\n</tr>\n</tbody></table>\n\n<h3>2B Capital Gains: Short Term</h3>\n\n<p>Short term capital gains tax is applied to the <strong><em>realized</em></strong> <strong><em>gains</em></strong> from the selling, trading, or <strong><em>disposal</em></strong> of cryptocurrency that you’ve held for less than one year. </p>\n\n<p>The tax rate is the same as the rate you’d pay for ordinary income, based on your personal tax bracket, the same brackets listed above in section 2A. </p>\n\n<h3>2C Capital Gains: Long Term</h3>\n\n<p>Long term capital gains tax is applied to crypto that you hold for more than one year before selling or trading. These rates are typically much lower than ordinary income. 2021 long term capital gains brackets: </p>\n\n<table><thead>\n<tr>\n<th align=\"left\">RATE</th>\n<th align=\"right\">SINGLE</th>\n<th align=\"center\">MARRIED FILING SEPARATE</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">0%</td>\n<td align=\"right\">$0-$40,000</td>\n<td align=\"center\">$0-$40,000</td>\n</tr>\n<tr>\n<td align=\"left\">15%</td>\n<td align=\"right\">$40,401-$445,850</td>\n<td align=\"center\">$40,401-$445,850</td>\n</tr>\n<tr>\n<td align=\"left\">20%</td>\n<td align=\"right\">$445,000 +</td>\n<td align=\"center\">$445,000</td>\n</tr>\n</tbody></table>\n\n<table><thead>\n<tr>\n<th align=\"left\">RATE</th>\n<th align=\"right\">MARRIED FILING JOINT</th>\n<th align=\"center\">HEAD OF HOUSEHOLD</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">0%</td>\n<td align=\"right\">$0-$80,000</td>\n<td align=\"center\">$0-$54,100</td>\n</tr>\n<tr>\n<td align=\"left\">15%</td>\n<td align=\"right\">$80,801-$501,600</td>\n<td align=\"center\">$54,101-$473,750</td>\n</tr>\n<tr>\n<td align=\"left\">20%</td>\n<td align=\"right\">$501,600 +</td>\n<td align=\"center\">$473,751 +</td>\n</tr>\n</tbody></table>\n\n<hr/>\n\n<h3>2C Collectible Capital Gains</h3>\n\n<p>The IRS has not issued a definitive guidance on how certain cryptocurrency may be taxed in this way but a growing opinion is that some tokens will fall under the IRS definition of <strong><em>collectible</em></strong> <strong><em>capital</em></strong> <strong><em>assets</em></strong>. This tax has a flat rate of 28% We’ll cover these tokens in the next section. Can you guess what’s in question?</p>\n\n<p>The IRS defines collectible assets broadly. Any work of art, most metals, gems, coins and this super general statement: Any personal property that the IRS determines a collectible under <strong><em>IRC</em></strong> <strong><em>Section</em></strong> <strong><em>408(m)</em></strong>. </p>\n\n<hr/>\n\n<h2>SECTION 3 Taxable events, corresponding tax rates, non taxable events, and required reporting</h2>\n\n<p>The part you’ve been waiting for! Which cryptocurrency transactions trigger a <strong><em>taxable</em></strong> <strong><em>event</em></strong> ? How are they taxed? Let’s explore. </p>\n\n<p>Examples in <strong>Section 4</strong> for different scenarios. </p>\n\n<h3>3A 3B 3C Purchasing, Holding and Transferring.</h3>\n\n<p>These are not taxable events. No tax liability of any kind is incurred by these actions alone and you don’t have to report crypto that you buy and transfer if you don’t sell or trade it. Even if the value of your crypto rises or falls dramatically, you own no taxes because you have not realized gains. </p>\n\n<p><strong>NOTE:</strong> Having a Record of every transaction you make, regardless of tax liability or the current reporting requirement, is very important. </p>\n\n<p>To be able to properly report when you <em>do</em> trigger a taxable event you’ll need to know either your <strong><em>cost</em></strong> <strong><em>basis</em></strong> or the <strong><em>fair</em></strong> <strong><em>market</em></strong> <strong><em>value</em></strong> (one of these apply depending on how you acquired it and what you do with it) for each transaction, the amount of fiat spent, the amount of crypto purchased, the date of purchase and any fees you paid.</p>\n\n<p>It’s also important to note that your cost basis is different than your <em>**average</em>* <strong><em>cost</em></strong>. </p>\n\n<h3>3D Crypt rewards cards: general</h3>\n\n<p>Generally, the IRS categorizes credit and debit card rewards as non-taxable. They are treated as rebates or discounts on what you purchased. </p>\n\n<p>That implies that for now, all those juicy crypto back rewards we get do not trigger any taxable event and no reporting requirements upon receipt (Capital gains, income, or otherwise). </p>\n\n<p>Selling them will trigger a taxable event though, so you’ll need to know the fair market value at the time you received the rewards and the amount received for each transaction. \nSounds like a hassle? There are multiple ways to record transactions, I do it manually through Blockfolio (now FTX) but there’s software that can track <em>almost</em> everything. </p>\n\n<p><strong>NOTE</strong> If you receive cryptocurrency through rewards, staking, interest or any means other than purchasing (using fiat or crypto) the fair market value at the time you received them becomes your cost basis for tax purposes. </p>\n\n<p>Some platforms may send you a <strong><em>1099-MISC</em></strong> if you go over a certain amount of rewards, but that doesn’t make it taxable. Whether something is listed on a 1099-MISC and whether it’s taxable are two different questions. </p>\n\n<ul>\n<li>###Crypto rewards cards: Fiat Payments</li>\n</ul>\n\n<p>Crypto rewards Cards that are pre-loaded with fiat, or that utilize fiat as the means of payment, do not trigger a taxable event when you make a purchase using the card and receive crypto back because you are paying with the US Dollar, the <strong><em>legal</em></strong> <strong><em>tender</em></strong> of The United States. </p>\n\n<ul>\n<li>###Crypto rewards cards: Crypto Payments</li>\n</ul>\n\n<p>Cards that spend your crypto, whether they are rewards cards or not, trigger a taxable event. (stable coins are no exception, but do not incur tax liabilities in <em>most</em> cases) When using a card to spend crypto, the card issuing platform is liquidating your crypto to fiat then using the fiat for the purchase via the card, this is a disposal of a capital asset. </p>\n\n<p>Even if the provider of the goods/service you purchase from accepts crypto, and you actually transfer your crypto to them via a card or any other method, you are triggering a taxable event by trading crypto for goods and services. </p>\n\n<ul>\n<li>###Crypto rewards cards: Stable coin payments </li>\n</ul>\n\n<p>Crypto Card issuing platforms that guarantee a 1:1 ratio between US Dollars and the stable coin the card utilizes, will not result in capital gains or losses, but each transaction is still required to be reported. </p>\n\n<p>Stable coins are still cryptocurrency and this means that transactions involving stable coins are disposal of capital assets. Although minimal, stable coin prices can fluctuate. If you’re not guaranteed a 1:1 ratio, you may trigger a taxable event and you’ll need to calculate your profit or loss. </p>\n\n<p>While using your crypto to pay for goods and services via a pre-loaded card triggers a taxable event, it doesn’t always result in a capital gain. If the fair market value at the time of your payment to a merchant is lower than your cost basis, you may actually incur a <strong><em>capital</em></strong> <strong><em>loss</em></strong> that can be used to offset gains. (With some exceptions)</p>\n\n<h3>3E 3F 3G Staking Rewards, Earning interest, (including Defi) and Airdrops</h3>\n\n<p>Each one of these transactions trigger a taxable event. They are viewed by the IRS in the same way as fiat interest in traditional finance. They are required to be reported and are taxed as income at your personal tax rate, not as capital gains… unless or until you sell. </p>\n\n<p>What separates these payments from traditional fiat interest is in crypto, for each individual transaction, you need to know the fair market value on the date you received the crypto because upon selling these rewards, the fair market value becomes the cost basis that you must use to calculate your profit/loss and the resulting capital gain or capital loss. </p>\n\n<h3>3H 3I Selling crypto for fiat and crypto to crypto trades/transactions</h3>\n\n<p>These are both taxable events and both result in capital gains/loss tax. Selling crypto, your property as defined by the IRS, is of course a taxable event and profit is taxed the same as stocks, gold, or any other “property”. Capital gains apply, either short or long term and according to the bracket you’re in. </p>\n\n<p>Trading one crypto to another crypto is taxed exactly the same way. You’re  disposing of one asset and purchasing another that are both valued in US dollars. </p>\n\n<h3>3J Cryptocurrency mining and (staking revisited)</h3>\n\n<p>Tax calculations based on the receiving of cryptocurrency through mining are taxed similarly to staking and there’s a lot of debate about this, especially staking rewards. </p>\n\n<p>According to the IRS, when a taxpayer successfully mines Bitcoin or other cryptocurrency he/she must include it in their gross income after determining the fair market value at the time they receive it. </p>\n\n<p>There are two ways to report mining rewards on your taxes: as a  <strong><em>hobby</em></strong> or as a <strong><em>business</em></strong> as defined by the IRS. In both, much like interest, Airdrops, and staking rewards, the fair market value (at the time you received them) of your mining rewards will be considered income and taxed at your personal tax bracket. </p>\n\n<p>As a hobby, this will be reported on <strong><em>form</em></strong> <strong><em>1040</em></strong> as “other income”. If you run a mining operation as a business, you can fully deduct expenses and the net profit is taxable and reported on <strong><em>Schedule</em></strong> <strong><em>C</em></strong>. </p>\n\n<h3>3K Crypto received as payments for goods and services, crypto received as wages and salary and using crypto to pay employees</h3>\n\n<ul>\n<li>###Crypto received as payment for goods and services </li>\n</ul>\n\n<p>Similar to mining, payments received in Cryptocurrency must be converted to their value in US dollars and included as income. Expenses can be deducted if you are a business owner. </p>\n\n<ul>\n<li>###Crypto received as a form of wage or salary payment, for employees and employers. </li>\n</ul>\n\n<p>Employers must convert  employee earnings paid in crypto to US dollars on the employees W-2 form. These wages are subject to the same withholdings as payment in US dollars. Employers also incur capital gains tax for disposing of their crypto as payment to employees. </p>\n\n<p>And again, the fair market value at the time you receive the crypto becomes your cost basis if you trade. </p>\n\n<h3>3L NFTs</h3>\n\n<p>Creating an NFT is not a taxable event, and has no value to report when you create it, however, it is considered a cryptocurrency by the IRS. Trading an NFT for another NFT, disposing of an NFT for a fungible cryptocurrency or US dollars is a taxable event subject to capital gains/losses. </p>\n\n<p>Many NFTs are considered collectibles and may fall under the IRS definition of a <strong><em>collectible</em></strong> <strong><em>capital</em></strong> <strong><em>asset</em></strong>. The IRS has not issued guidance on this so the presumption right now is to use the definition of a standard capital asset. </p>\n\n<p>Trading cards, for example, are not specifically listed by the IRS as collectible capital assets but have historically been taxed as such and this makes me think of NBA Top Shots NFT series. </p>\n\n<p>The short term rule applies to collectibles in the same way as regular capital gains tax, it’s based on your income tax bracket. However, Long term collectible capital gains tax is a flat 28%. That’s strange to me. </p>\n\n<p>There are NFTs that do not fit the definition of a collectible. Take Uniswap V3 as an example. Liquidity positions are not represented by ERC-20 tokens anymore, they are represented by NFTs and are obviously different than NFTs that represent art of any kind. </p>\n\n<hr/>\n\n<h2>SECTION 4 Determining your profit/loss from different transactions and your tax liability with examples of transactions from section 3</h2>\n\n<p>You’re going to basically need a record of every transaction that involves cryptocurrency. You can do it manually with a notes app, excel spreadsheet or a crypto tax software tool that pulls the information from all your exchanges and wallets. Some of these software programs don’t cover everything though. You’ll get reports from many exchanges and you can find a record of your transactions on these exchanges. </p>\n\n<h4>INFO YOU’ll NEED</h4>\n\n<ul>\n<li>cost basis or fair market value</li>\n<li>how you acquired the crypto (income or purchase)</li>\n<li>how much crypto you acquired or sold </li>\n<li>how much fiat you invested or how much fiat received for the sell</li>\n<li>the date you acquired or sold the crypto </li>\n</ul>\n\n<h3>EXAMPLE 1 Determining capital gain and taxes owed on crypto you bought, held, transferred then later sold.</h3>\n\n<p><strong>NOTE</strong>: Remember to deduct fees to lower your cost basis.</p>\n\n<ul>\n<li>Frank buys 10 ETH  on December 10, 2020. 1 ETH was $1000 - He spent $10,000</li>\n<li>The transaction fee was 0.5%, or $50</li>\n<li><p>$10,000 invested - $50 in fees = $9,950 / 10 ETH = <strong>$995</strong> cost basis of per ETH</p>\n\n<ul>\n<li>Frank transfers the 10 ETH to a ledger where he plans to hold it for one year. </li>\n</ul>\n\n<p><strong>NOTE</strong> No fee =  Cost basis is the exact price per coin. Fee = deduct fee, $50 in this case, from total investment ,divide total investment by total coins purchased. (If you incur other fees for transfers, those can be deducted as well.) Cost basis is now $995 for tax purposes, average cost is still $1000 for investment purposes. </p></li>\n<li><p>On December 11, 2021 (over 1 year later) Frank transfers back to an exchange and sells 5 of his 10 ETH when Ethereum his $10,000. He pays $250 in fees. Remember that he paid $950 per ETH when he made his purchase. </p></li>\n<li><p>5 ETH X $10,000 per ETH = $50,000 - $250 fee = <strong>$49,750</strong> net proceeds </p></li>\n<li><p>The next step is to deduct your cost basis from your proceeds from the sale. </p></li>\n<li><p><strong>$950</strong> cost basis X 5 ETH = <strong>$4,750</strong> total cost basis</p>\n\n<ul>\n<li>Net proceeds $49,750 - $4,750 cost basis is <strong>$45,000</strong> long term capital gain. </li>\n<li>Frank is married and they file jointly, she has a boyfriend but that doesn’t affect taxes. Their total taxable income is $90,000 which puts them in the 15% long term capital gains bracket. </li>\n<li>$45,000 capital gain X 0.15 (taxed at 15%) capital gain tax rate = <strong>$6,750</strong> owed in capital gains tax</li>\n</ul></li>\n</ul>\n\n<h3>EXAMPLE 2 Expanding on the above scenario to illustrate the FIFO (first in first out) method of tax reporting.</h3>\n\n<ul>\n<li>Frank also purchased 2 more ETH in March 2021 (we’ll assume no fees this time for simplicity). Ethereum was $2,500. His cost basis for these 2 ETH is $2,500 each. </li>\n<li>We know from the first example that Frank sold 5 ETH from the original 10 he purchased. He now has 7 ETH. 5 left with a cost basis of <strong>$950</strong> and 2 with a cost basis of <strong>$2,500</strong></li>\n<li>On January 1, 2022 Ethereum drops to $2000 and He sells 6 ETH</li>\n<li>6 ETH X $2000 = <strong>$12,000</strong> net proceeds </li>\n</ul>\n\n<p><strong>IMPORTANT NOTE</strong>: Since Frank has two different cost basis for Ethereum and his sale was for more ETH than he owns at the first cost basis of $950, the sale can be split into two transactions when figuring taxes. </p>\n\n<p>FULL TRANSACTION\n6 ETH sold at $2,000 ETH = $12,000 </p>\n\n<p>TAX TRANSACTION ONE\n  - He has 5 ETH from 2020 with a cost basis of $950 per ETH They were purchased first, they sell first. FIFO\n   - 5 ETH @ $950 cost basis = $4750 total cost sold for $2000 per ETH or $10,000 total proceeds \n   - $10,000 proceeds  - $4750 cost basis  = <strong>$5,250 LONG TERM NET GAIN</strong> on these 5 ETH</p>\n\n<p>TAX TRANSACTION TWO\n   - He has 2 ETH that he purchased for $2,500 and sold one of them (he sold 6 total, the 5 left from his original purchase plus 1 from his latest purchase = 6)\n - All 10 of the original ETH he bought have been sold. He must now use 1 of the 2 he recently purchased to determine his tax liability on this 6 ETH sale. \n   - 1 ETH @ $2,500 cost basis sold for $2,000 total\n   - $2,000 proceeds - $2,500 cost basis  = <strong>$500 SHORT TERM NET LOSS</strong></p>\n\n<ul>\n<li>Frank has two taxable situations here that resulted from one sale. A <strong>$5,250 long term capital gain</strong> that he owes 15% tax on ($787.50) and a <strong>$500 Capital loss</strong> that he can claim. </li>\n</ul>\n\n<p><strong>NOTE</strong> Capital losses are first used to offset gains of the same type. So, short term losses are first deducted from short term gains and long term against long term. Losses of either type that are higher than gains of the same type can then be used to deduct against the other kind of gain. </p>\n\n<h3>If you have an overall net capital loss for a tax year, you can deduct up to $3,000 of that loss against your income. Any capital loss in excess of $3,000 can be carried over to subsequent years and deducted against capital gains first then other kinds of income. Married filing separate is $1,500 for these scenarios.</h3>\n\n<h3>EXAMPLE 3 crypto received as staking or interest payments. Claiming them as income.</h3>\n\n<p>Karen has  10,000 ADA that she wants to stake. She staked and received rewards in February. </p>\n\n<table><thead>\n<tr>\n<th align=\"left\">REWARD/DATE</th>\n<th align=\"right\">ADA FMV</th>\n<th align=\"center\">REWARD VALUE</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">6.124 FEB 5</td>\n<td align=\"right\">$0.44</td>\n<td align=\"center\">$2.69</td>\n</tr>\n<tr>\n<td align=\"left\">6.654 FEB 10</td>\n<td align=\"right\">$0.93</td>\n<td align=\"center\">$4.26</td>\n</tr>\n<tr>\n<td align=\"left\">5.976 FEB 15</td>\n<td align=\"right\">$0.86</td>\n<td align=\"center\">$3.53</td>\n</tr>\n<tr>\n<td align=\"left\">6.612 FEB 20</td>\n<td align=\"right\">$1.12</td>\n<td align=\"center\">$7.41</td>\n</tr>\n<tr>\n<td align=\"left\">6.489 FEB 25</td>\n<td align=\"right\">$1.08</td>\n<td align=\"center\">$7.01</td>\n</tr>\n</tbody></table>\n\n<ul>\n<li>Karen earned 31.855 ADA </li>\n<li>Each of these rewards has a different fair market value( $.44 $.93 $.86 $1.12 $1.08 per ADA) and represent income of $.24 + $.64 + $.59 + $.77 + $.74 each for a total of <strong>$24.90 of income</strong>.<br/></li>\n<li>This $24.90 will be added together with the rest of Karen’s taxable income to determine her tax rate. \n\n<ul>\n<li>Karen is single and earned $35,000. Her tax rate is 12%</li>\n<li>She’ll owe an additional $2.98 on her $24.90 of staking income. </li>\n</ul></li>\n</ul>\n\n<h3>EXAMPLE 4 Expanding on staking rewards. Selling them and using FIFO</h3>\n\n<p>We know that our staking and interest rewards are considered income and taxed according to our personal tax bracket. This changes when you sell your staking reward. You’ll owe capital gains tax. </p>\n\n<ul>\n<li>Karen decides to sell some of her staking rewards as Cardano approaches $3.00 later the same year. </li>\n<li>She sells 18 ADA at $3.00. Assuming these were next on the list to be sold using FIFO, she uses ADA from her first 3 rewards dates. </li>\n<li>Karen received these ADA as rewards so she’ll have to know the fair market value at the time she received them. </li>\n<li></li>\n<li>First out of her 18 total sell is the 6.124 ADA she received on February 5th, ADA was trading at $0.44 that day, $0.44 is the fair market value and now becomes her Cost basis.<br/></li>\n<li>6.124 ADA X $0.44 Cost basis = $2.69 total cost</li>\n<li>6.124 ADA X $3.00 ADA sell price = $18.37 total proceeds</li>\n<li>$18.37 total proceeds - $2.69 total cost = <strong>$15.68 short term capital gain</strong></li>\n<li>The second part of the 18 ADA transaction will use the 6.654 ADA she received on February 10th with a fair market value, now her cost basis, of $0.93</li>\n<li>6.654 ADA X $0.93 cost basis = $5.72 total cost. </li>\n<li>6.654 ADA X $3.00 ADA sell price = $19.96 proceeds </li>\n<li>$19.96 proceeds - $5.72 = <strong>$14.24 short term capital gain.</strong> </li>\n<li>The third part of the transaction will use 5.222 (6.124 + 6.654 + 5.222 = 18) out of the 5.976 ADA she received on February 15th with a cost basis of $0.86</li>\n<li>5.222 ADA X $0.86 cost basis = $4.49 total cost</li>\n<li>5.222 ADA X $3.00 ADA sale price = $15.67 proceeds </li>\n<li>$15.67 proceeds - $4.49 total cost = <strong>$11.18 short term Capital gains.</strong> </li>\n<li>Now we add each part of the transaction. </li>\n<li>$15.68 + $14.24 + $11.18 = <strong>$41.11</strong> total short term capital gains** from the sale of 18 ADA received as staking rewards. </li>\n<li>Karen found a husband on <a href=\"/r/datingover30\">r/datingover30</a> and they had a combined income of $90,000 which puts them in the 24% tax bracket. </li>\n<li>Karen and Kevin will owe $9.87 in short term Capital gains tax on the sale of the 18 ADA at $3.00</li>\n</ul>\n\n<h3>EXAMPLE 5 Crypto to Crypto trades</h3>\n\n<ul>\n<li>Kevin wants to buy TRAC but can only find it with a BTC pair. \n\n<ul>\n<li>He buys $250 worth of Bitcoin at $50,000</li>\n</ul></li>\n<li>$250 investment / $50,000 BITCOIN = .005 BTC purchased</li>\n<li>He trades his .005 BTC for 650 TRAC at $0.40 - Bitcoin had risen to $52,000 at the time of his TRAC trade. </li>\n<li>When you trade crypto to crypto, you’re essentially selling one crypto to fiat and buying another crypto. The IRS views this as a disposal of one capital asset and the purchase of another. \n\n<ul>\n<li>.005 BTC X 52K = $260 / $.40 TRAC = 650 TRAC</li>\n</ul></li>\n<li>His cost basis for BTC was $50,000 ($250) and when he disposed of it for TRAC the price had risen to $52,000 ($260)</li>\n<li>$260 proceeds - $250 cost = $10 short term capital gain. </li>\n<li>Kevin incurred a capital gain on his BTC to TRAC trade. </li>\n</ul>\n\n<h3>Ways to minimize taxes owed.</h3>\n\n<ul>\n<li>Monitor your holding period. Try to turn short term gains into long term gains. </li>\n<li>Use losses to offset gains and wash sales are currently allowed but be careful because the IRS has a clause called <strong><em>The Economic Substance Doctrine</em></strong></li>\n<li>Keep records of all of the fees that you pay for everything</li>\n<li>Donate to charity</li>\n<li>Gift crypto to family members </li>\n<li>Consider a crypto self directed retirement account </li>\n<li>If you mine, deduct every expense possible. </li>\n<li>Use every deduction or credit available to lower your taxable income </li>\n</ul>\n\n<hr/>\n\n<hr/>\n\n<h2>GLOSSARY: Internal Revenue Service or economic/accounting definitions</h2>\n\n<ul>\n<li>1099-MISC: An Internal Revenue Services form used to report certain types of non-employee compensation. \n###A</li>\n<li>Adjusted gross income: Gross income minus all available deductions. </li>\n<li>Average cost: Total cost divided by the total number of units. \n###B</li>\n<li>Business: An activity carried on for livelihood or in good faith to make a profit. \n###C</li>\n<li>Capital asset: Significant pieces of property whether owned by a business or individual. </li>\n<li>Capital gains: Profit from the sale of property or an investment. </li>\n<li>Capital gains tax: A tax levied on profit from the sale of property or an investment. </li>\n<li>Capital loss: A loss that is incurred when a capital asset is sold for less than the price that was paid for it. </li>\n<li>Collectible capital assets: Alternative investments that include things like art, stamps, coins, cards, comics, rare items, antiques and so on. </li>\n<li>Cost basis: The original value of an item, usually the purchase price and is used to determine capital gain or loss \n###D</li>\n<li> Disposal: Asset disposal is the act of selling, trading, or removal of an asset that is no longer needed.\n###E</li>\n<li>Economic Substance Doctrine: A tax law under which a transaction must have a substantial purpose aside from reduction of tax liability in order to be considered valid. </li>\n</ul>\n\n<h3>F</h3>\n\n<ul>\n<li>Fair market value: The price that an asset would or did sell for at a given time on an open market. </li>\n<li>Form 1040: A common tax form used by US taxpayers to file an annual income tax return. \n###H</li>\n<li>Hobby: An activity that is engaged in for sport or recreation, not to make a profit. \n###I</li>\n<li>IRC section 408(m): An Internal Revenue Service document that explains and helps determine the consequences of investing in collectibles in an individually directed account. </li>\n<li>Internal Revenue Service (IRS): The revenue service of the United States federal government that is responsible for collecting taxes and administering the revenue code. \n###L</li>\n<li>Legal tender: Anything recognized by law as a means to settle public or private debt, or meet a financial obligation. \n###R</li>\n<li>Realize Gains: The difference in investment amount and proceeds when an investment is sold for a higher price than it was purchased. \n###S</li>\n<li>Schedule C: The IRS tax form used to report income or loss from a business you operated or as a profession you practiced as the sole proprietor. \n###T</li>\n<li>Taxable Event: Any action or transaction that may result in taxes owed to the government. </li>\n<li>Tax liability: The total amount of tax debt owed. </li>\n</ul>\n\n<p><em>sources for definitions and information in the post.</em> IRS. GOV • Investopedia • cryptotrader .tax • sourceforge .net • coin telegraph •  cointracking .info  • Forbes advisor • thebalance .com • bankrate • taxbit .com • </p>\n\n<hr/>\n\n<p>This post was born from my research into tax law and code due to my  disagreements with the way newly mined or minted coins are taxed. Never in the history of the United States has something been taxed at the time of creation. </p>\n\n<hr/>\n\n<p>TLDR: If you purchase crypto, you pay capital gains/loss when you sell. If it’s a reward (except from crypto back cards) from interest, staking or mining, you owe income tax on it and if you sell it then you owe capital gains tax. </p>\n\n<p>Any crypto you trade/sell/dispose of is subject to Capital gains tax.</p>\n\n<h3>Edit: There is software that can compile most of your trading, staking, etc for you. Koinly and CrytoTrader. Tax are both highly recommended.</h3>\n</div><!-- SC_ON -->",
  "score": 216,
  "permalink": "/r/CryptoCurrency/comments/pmiedi/all_the_cryptocurrency_tax_information_you_dont/",
  "subreddit": "CryptoCurrency",
  "id": "pmiedi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Which transactions are taxable events and which ones aren’t? What has to\nreported and what doesn’t?\n\nFair warning: This is going to be a long post with a lot of information. This\nentire post is a TL:DR of cryptocurrency taxes.\n\n….but I reluctantly added a TLDR at the end\n\nThere are tax laws that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どの取引が課税対象となるイベントで、どの取引がそうでないのか？報告しなければならないものと\n報告しなければならないものとそうでないものとは？\n\n注意してください。この記事は多くの情報を含んだ長い記事になります。この\nこの記事全体が、暗号通貨の税金に関するTL:DRです。\n\n.... ですが、しぶしぶ最後にTLDRを付け加えました。\n\n税法がありますので...",
      "title": "欲しくないけど知っておきたい、暗号通貨の税金情報を一挙公開。(米国の税金)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哪些交易是应税事件，哪些不是？哪些必须\n报告，哪些不需要？\n\n公平的警告。这将是一篇包含大量信息的长文。这\n整个帖子是加密货币税收的TL:DR。\n\n....，但我不情愿地在最后添加了一个TLDR\n\n有一些税法，...",
      "title": "所有你不想要，但需要知道的加密货币税收信息。(美国税收)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "哪些交易是應稅事件，哪些不是？哪些必須\n報告，哪些不需要？\n\n公平的警告。這將是一篇包含大量信息的長文。這\n整個帖子是加密貨幣稅收的TL:DR。\n\n....，但我不情願地在最後添加了一個TLDR\n\n有一些稅法，...",
      "title": "所有你不想要，但需要知道的加密貨幣稅收信息。(美國稅收)"
    }
  ]
}