{
  "author": "Rugged_Source",
  "original_created_utc": 1630375612,
  "title": "If you were as rich as Jeff Bezos, would you help others less fortunate then you?",
  "created_utc": 1630398225,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was discussing this with my friends fiancé &amp; I said that if I were as rich as Jeff Bezos that I would help homeless people, third world countries with electric and clean water, etc. As long as people wanted to be helped. I am not one for forcing people to do anything, even if you &#39;think&#39; you are helping them. My friends fiancé expressed that she wouldn&#39;t help anyone, doesn&#39;t feel sorry for people like that and it&#39;s his money he earned. I was trying to explain I get all of that but also trying to explain to her that he wouldn&#39;t be able to spend all of his money in his lifetime if he tried. So what harm would it do trying to make the world a better place? She kept ranting about why she doesn&#39;t feel sorry for the less fortunate kind and I just gave up. I was just curious on how others felt about things like this.</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/pewiy1/if_you_were_as_rich_as_jeff_bezos_would_you_help/",
  "subreddit": "NoStupidQuestions",
  "id": "pewiy1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was discussing this with my friends fiancé & I said that if I were as rich as\nJeff Bezos that I would help homeless people, third world countries with\nelectric and clean water, etc. As long as people wanted to be helped. I am not\none for forcing people to do anything, even if you 'think' you are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人の婚約者と話していて、もし自分がジェフ・ベゾスのようなお金持ちだったら\nジェフ・ベゾスほどのお金持ちだったら、ホームレスを助けたり、第三世界の国々に\n電気やきれいな水を提供するなどして。人々が助けられたいと思っている限りね。私は\n私は人に何かを強要する人間ではありません、たとえあなたがそう思っていても...。",
      "title": "もしあなたがジェフ・ベゾスのようなお金持ちだったら、自分よりも恵まれていない人を助けますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我朋友的未婚夫讨论过这个问题，我说如果我像杰夫-贝索斯那样富有，我会帮助无家可归的人，帮助第三世界国家的人。\n我说如果我像杰夫-贝索斯那样富有，我会帮助无家可归的人，为第三世界国家提供电力和清洁水。\n电和清洁水等等。只要人们愿意被帮助。我不是\n我不是一个强迫人们做任何事情的人，即使你 \"认为 \"你是......",
      "title": "如果你像杰夫-贝佐斯一样富有，你会帮助比你更不幸的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我朋友的未婚夫討論過這個問題，我說如果我像傑夫-貝索斯那樣富有，我會幫助無家可歸的人，幫助第三世界國家的人。\n我說如果我像傑夫-貝索斯那樣富有，我會幫助無家可歸的人，爲第三世界國家提供電力和清潔水。\n電和清潔水等等。只要人們願意被幫助。我不是\n我不是一個強迫人們做任何事情的人，即使你 \"認爲 \"你是......",
      "title": "如果你像傑夫-貝佐斯一樣富有，你會幫助比你更不幸的人嗎？"
    }
  ]
}