{
  "author": "SenatusSPQR",
  "original_created_utc": 1631544160,
  "title": "This fake news is why we can't have nice things",
  "created_utc": 1631558711,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Someone posts fake news. We all jump on it. Many FOMO into whatever coin is being pumped. Those setting up the pump and dump quickly jump out right after the initial FOMO.</p>\n\n<p>A few minutes later, it becomes apparant that this was fake news. Markets drop, usually even further than they went up on the news. Why? Because this hurts crypto credibility</p>\n\n<p>No one is going to take crypto serious if we&#39;re seen as moonboys, if people see crypto as being filled with scams, as being all about pump and dump schemes.</p>\n\n<p>I&#39;m not even sure where I&#39;m going with this. I&#39;m just getting really tired of all this speculative price action, rather than a true focus on what good crypto can do in the world, on fundamentals, and on true adoption.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/pngu66/this_fake_news_is_why_we_cant_have_nice_things/",
  "subreddit": "CryptoCurrency",
  "id": "pngu66",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Someone posts fake news. We all jump on it. Many FOMO into whatever coin is\nbeing pumped. Those setting up the pump and dump quickly jump out right after\nthe initial FOMO.\n\nA few minutes later, it becomes apparant that this was fake news. Markets drop,\nusually even further than they went up on the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かがフェイクニュースを投稿する。みんなでそれに飛びつきます。多くの人が、どんなコインにもFOMO\n送り込まれます。パンプ＆ダンプを仕掛ける人たちは、最初のFOMOの直後にすぐに飛び出します。\n最初のブームの直後に飛び出します。\n\n数分後、これがフェイクニュースであることが明らかになります。市場は下落する。\nたいていの場合、フェイクニュースで上昇した以上に市場は下落します。",
      "title": "こんなフェイクニュースがあるから、いいものが手に入らないのだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有人发布假新闻。我们都跳上了它。许多FOMO进入任何硬币\n被抽走。那些设置抽水和倾倒的人在被抽水和倾倒后迅速跳出。\n最初的恐惧感。\n\n几分钟后，人们发现这是个假消息。市场下跌。\n通常会比他们上涨的时候更进一步...",
      "title": "这种假新闻就是我们不能拥有美好事物的原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人發佈假新聞。我們都跳上了它。許多FOMO進入任何硬幣\n被抽走。那些設置抽水和傾倒的人在被抽水和傾倒後迅速跳出。\n最初的恐懼感。\n\n幾分鐘後，人們發現這是個假消息。市場下跌。\n通常會比他們上漲的時候更進一步...",
      "title": "這種假新聞就是我們不能擁有美好事物的原因"
    }
  ]
}