{
  "author": "silent_tongue",
  "original_created_utc": 1642439342,
  "title": "I almost got a heart attack due to CDC hack",
  "created_utc": 1642458866,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Reading all the posts about Crypto.com hack, I quickly login to my CDC app to check. Sure enough, my funds was down a few thousand dollars as compared to this morning when I last checked them! &lt;/p&gt;\n\n&lt;p&gt;I can feel my heart beat rising, knees getting weak, arms are sweaty. I took a deep breath and thought about  my next course of action. They cannot get away with this, it&amp;#39;s my hard-earned money and I was furious that they lost my money! I quickly grabbed my laptop to draft a strongly worded email to CDC and to demand compensation. How could such a thing happen! Unacceptable!  &lt;/p&gt;\n\n&lt;p&gt;Then I realised its just LRC hitting 1.20..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 365,
  "permalink": "/r/CryptoCurrency/comments/s68z2v/i_almost_got_a_heart_attack_due_to_cdc_hack/",
  "subreddit": "CryptoCurrency",
  "id": "s68z2v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Reading all the posts about Crypto.com hack, I quickly login to my CDC app to\ncheck. Sure enough, my funds was down a few thousand dollars as compared to this\nmorning when I last checked them!\n\nI can feel my heart beat rising, knees getting weak, arms are sweaty. I took a\ndeep breath and thought…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Crypto.comのハッキングに関するすべての投稿を読んで、私はすぐにCDCアプリにログインして\nを確認する。案の定、私の資金は今日と比べて数千ドル減っていました。\n朝、最後に確認したとき\n\n心臓の鼓動が高まり、膝が弱くなり、腕に汗をかくのがわかる。私は\n深呼吸して思った。",
      "title": "CDCのハッキングで心臓発作を起こしそうになった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阅读所有关于Crypto.com黑客的帖子，我迅速登录到我的CDC应用程序以\n检查。果然，我的资金比今天早上的时候减少了几千美元。\n早上我最后一次检查时，我的资金减少了几千美元!\n\n我可以感觉到我的心跳在上升，膝盖在发软，手臂在出汗。我做了一个\n深呼吸，想...",
      "title": "我差点因为CDC的黑客攻击而得了心脏病"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "閱讀所有關於Crypto.com黑客的帖子，我迅速登錄到我的CDC應用程序以\n檢查。果然，我的資金比今天早上的時候減少了幾千美元。\n早上我最後一次檢查時，我的資金減少了幾千美元!\n\n我可以感覺到我的心跳在上升，膝蓋在發軟，手臂在出汗。我做了一個\n深呼吸，想...",
      "title": "我差點因爲CDC的黑客攻擊而得了心臟病"
    }
  ]
}