{
  "author": "HyrulePotteryBarn",
  "original_created_utc": 1634720872,
  "title": "Why are people so disgusted/nauseated by the idea of their parents having sex?",
  "created_utc": 1634735120,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Specifically the people who express that they want to vomit when the idea is put forward, or that if they saw their parents engaged in sex would want to bleach their eyes. </p>\n\n<p>I certainly do not want to see my parents having sex, but I don’t understand why I should be horrified if they do. To me, it’s no different than knowing anyone else is. </p>\n\n<p>The best I can think of is that natural reflex to avoid incest</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/qbwnov/why_are_people_so_disgustednauseated_by_the_idea/",
  "subreddit": "NoStupidQuestions",
  "id": "qbwnov",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Specifically the people who express that they want to vomit when the idea is put\nforward, or that if they saw their parents engaged in sex would want to bleach\ntheir eyes.\n\nI certainly do not want to see my parents having sex, but I don’t understand why\nI should be horrified if they do. To me, it’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "具体的には、「この話をされると吐き気がする」とか「親がセックスしているのを見たら漂白したくなる」といったものです。\nたり、親がセックスしているのを見たら目を白黒させたいと思ったりする人が\nといった方々です。\n\n私は自分の親がセックスしているところを見たくありません。\n私には、両親がセックスをしているのを見たくありません。私にとってそれは...",
      "title": "なぜ人々は、自分の親がセックスをしているということに嫌悪感・無関心なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "特别是那些在提出这个想法时表示想要呕吐的人。\n或如果他们看到自己的父母在做爱，会想把他们的眼睛漂白。\n他们的眼睛。\n\n我当然不希望看到我的父母做爱，但我不明白为什么\n如果他们这样做，我应该感到害怕。对我来说，这就是...",
      "title": "为什么人们对父母做爱的想法如此反感/厌恶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特別是那些在提出這個想法時表示想要嘔吐的人。\n或如果他們看到自己的父母在做愛，會想把他們的眼睛漂白。\n他們的眼睛。\n\n我當然不希望看到我的父母做愛，但我不明白爲什麼\n如果他們這樣做，我應該感到害怕。對我來說，這就是...",
      "title": "爲什麼人們對父母做愛的想法如此反感/厭惡？"
    }
  ]
}