{
  "author": "HakunaYourTatas1234",
  "original_created_utc": 1630935603,
  "title": "Should I sell my car to buy BTC?",
  "created_utc": 1630989041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been buying Bitcoin over the past few years, but because my investment was so low, the profit was also low. </p>\n\n<p>I&#39;ve got a car worth about $6,000 that I could sell and put into BTC. I might drive it like once every fortnight, so it doesn&#39;t get much use. Most of the time I use one of my dad&#39;s cars he has standing around(nice lil fuel saver). I work for him in his real estate business so it suits me and him well. </p>\n\n<p>Would you guys recommend this plan?</p>\n\n<p>I figured the car would continue losing value anyway, and i don&#39;t have a time limit on how long I can hold. Dips won&#39;t scare me to pull out either.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/pizm4v/should_i_sell_my_car_to_buy_btc/",
  "subreddit": "Bitcoin",
  "id": "pizm4v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been buying Bitcoin over the past few years, but because my investment was\nso low, the profit was also low.\n\nI've got a car worth about $6,000 that I could sell and put into BTC. I might\ndrive it like once every fortnight, so it doesn't get much use. Most of the time\nI use one of my dad's cars…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はここ数年、ビットコインを購入していましたが、投資額が少ないので\n投資額が少ないので、利益も少ない。\n\n6,000ドルほどの価値のある車があるので、それを売ってBTCに入れようかと思っています。私は2週間に1度くらいしか\n2週間に1回くらいしか乗らないので、あまり使われていません。ほとんどの場合\n父の車を使っています。",
      "title": "BTCを買うために車を売るべきか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几年里，我一直在购买比特币，但由于我的投资是\n如此之低，利润也很低。\n\n我有一辆价值约6000美元的汽车，我可以卖掉并投入到BTC中。我可能\n每两周开一次，所以它并没有得到多少使用。大部分的时间\n我使用我父亲的一辆车...",
      "title": "我应该卖掉我的车来买BTC吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾年裏，我一直在購買比特幣，但由於我的投資是\n如此之低，利潤也很低。\n\n我有一輛價值約6000美元的汽車，我可以賣掉並投入到BTC中。我可能\n每兩週開一次，所以它並沒有得到多少使用。大部分的時間\n我使用我父親的一輛車...",
      "title": "我應該賣掉我的車來買BTC嗎？"
    }
  ]
}