{
  "author": "RagnarBoi",
  "the_new_excerpt": "I'm an 18 year old dude, this girl is the same age as me and she's been my best\nfriend since we were 3 and we are just friends. Since we met in preschool, we\njust clicked and we're going to the same college together in the fall. Our\nFriday night sleepovers have been a tradition since our friendship…",
  "original_created_utc": 1622901092,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "僕は18歳の男ですが、この女の子は僕と同い年で、3歳の頃からの親友です。\n3歳の頃からの親友で、今はただの友達です。保育園で出会って以来、僕らは\n幼稚園で出会って以来、意気投合して、秋には同じ大学に一緒に行くことになったんだ。私たちの\n金曜日の夜のお泊り会は、私たちの友情以来の伝統なの...。",
      "title": "私（18歳男性）が、女の子の親友（18歳女性）といまだにお泊り会をするのは普通のことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个18岁的男孩，这个女孩和我同龄，她是我最好的朋友，因为我们都是3岁。\n她是我最好的朋友，因为我们都是3岁，我们只是朋友。自从我们在学前班相遇，我们就一拍即合。\n我们就一拍即合，秋天我们将一起去同一所大学。我们的\n周五晚上的留宿已经成为我们友谊的传统......",
      "title": "我（18岁）还和我最好的朋友（18岁）一起过夜，她是个女孩，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個18歲的男孩，這個女孩和我同齡，她是我最好的朋友，因爲我們都是3歲。\n她是我最好的朋友，因爲我們都是3歲，我們只是朋友。自從我們在學前班相遇，我們就一拍即合。\n我們就一拍即合，秋天我們將一起去同一所大學。我們的\n週五晚上的留宿已經成爲我們友誼的傳統......",
      "title": "我（18歲）還和我最好的朋友（18歲）一起過夜，她是個女孩，這正常嗎？"
    }
  ],
  "title": "Is it normal I (18 M) still have sleepovers with my best friend who's a girl (18 F)",
  "created_utc": 1622913596,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an 18 year old dude, this girl is the same age as me and she&#39;s been my best friend since we were 3 and we are just friends.  Since we met in preschool, we just clicked and we&#39;re going to the same college together in the fall.  Our Friday night sleepovers have been a tradition since our friendship began and we still have them pretty much every week.  We put them on hold during covid, but they have since started again now our families are vaccinated.  </p>\n\n<p>We usually just stay up goofing around together until the early hours of the morning. We order a pizza, play video games, watch movies, take selfies, wrestle, play Just Dance in our PJs and last night we even built a blanket fort and told each other ghost stories (that we found on a creepypasta website).  We always have a blast together.</p>\n\n<p>We&#39;re not dating or anything like that.  While I&#39;m not totally dismissing the possibility for the future, I&#39;m certainly not going to pressure her into it, our friendship means much more to me.  And no, I&#39;m not gay.   Some of our other friends find it weird that we still have sleepovers together and make jokes about it, which we just laugh off. But very occasionally I do wonder if we should still be doing it at our age. I&#39;m just wondering what your thoughts are on this.</p>\n</div><!-- SC_ON -->",
  "score": 418,
  "permalink": "/r/NoStupidQuestions/comments/nsw6qt/is_it_normal_i_18_m_still_have_sleepovers_with_my/",
  "subreddit": "NoStupidQuestions",
  "id": "nsw6qt",
  "is_self": true,
  "media": null,
  "is_video": false
}