{
  "author": "Accomplished-Design7",
  "original_created_utc": 1624416945,
  "title": "If this is your first major dip and you still managed HODLed, then congratulations and pat yourself on the back for not paper handing your cryptos!",
  "created_utc": 1624447924,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is <strong>especially</strong> for all the newcomers to crypto during this cycle. The FUDs didn&#39;t get to you and you stood strong! Many people I know already sold their cryptos at lows fearing that it will go much lower, they have adopted the <strong>buy high sell low</strong> strategy but that ain&#39;t for me!</p>\n\n<p>It has been really hard on me too as I am one of the <strong>newcomers</strong> too! I have been in this crypto space for not too long and after I initially invested the price started to dip. However, as I am in for the long run, I did not let those FUDs sway me into paper-handing my cryptos. Although as of now my portfolio is still pretty much in red, I strongly believe in the utility of the crypts that I purchased so I ain&#39;t paper handing them! </p>\n\n<p>If you DYOR, you would be more confident with your purchases and less likely to paper-hand them. Thus, I also believe it is crucial to do all the research needed before buying into different cryptos. <strong>DCA whenever possible and remember to stake if you are in for the long run!</strong> </p>\n\n<p><strong><em>Either way, give yourself a pad on the back!</em></strong></p>\n\n<p>P.S. not financial advice</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/o6414n/if_this_is_your_first_major_dip_and_you_still/",
  "subreddit": "CryptoCurrency",
  "id": "o6414n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is especially for all the newcomers to crypto during this cycle. The FUDs\ndidn't get to you and you stood strong! Many people I know already sold their\ncryptos at lows fearing that it will go much lower, they have adopted the buy\nhigh sell low strategy but that ain't for me!\n\nIt has been really…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは特に、このサイクル中に暗号に新規参入した人たち全員に言えることです。FUDs\nに惑わされることなく、しっかりと立ち向かってくれました。私の知り合いの多くは、もっと下がるのではないかと\n私の知り合いの多くは、もっと下がるのではないかと恐れて、暗号を安値で売っています。\nハイ・セル・ロー戦略を採用していますが、それは私には向いていません!\n\n私はそうは思いません。",
      "title": "これが初めての大暴落で、それでもHODLできたのであれば、おめでとうございます！クリプトをペーパーハンドしなかった自分を褒めてあげてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这对本周期内所有加密货币的新人来说尤其如此。恐惧症\n并没有影响到你，而且你站得很稳! 我认识的许多人已经在低点卖出了他们的\n我认识的许多人已经在低点卖出了他们的加密货币，担心它将会更低，他们已经采用了购买\n他们采取了高买低卖的策略，但这不适合我!\n\n这真的是...",
      "title": "如果这是你的第一次大跌，而你仍然成功地进行了HODL，那么恭喜你，并为你没有把你的加密货币交给别人而拍手称快"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這對本週期內所有加密貨幣的新人來說尤其如此。恐懼症\n並沒有影響到你，而且你站得很穩! 我認識的許多人已經在低點賣出了他們的\n我認識的許多人已經在低點賣出了他們的加密貨幣，擔心它將會更低，他們已經採用了購買\n他們採取了高買低賣的策略，但這不適合我!\n\n這真的是...",
      "title": "如果這是你的第一次大跌，而你仍然成功地進行了HODL，那麼恭喜你，併爲你沒有把你的加密貨幣交給別人而拍手稱快"
    }
  ]
}