{
  "author": "pihkaltih",
  "the_new_excerpt": "One of the aspects of the Tienanmen Square crackdowns I've never really\nunderstood is the role of the 27th Army Group seemingly massacring police, other\nArmy groups, running over army medics and police lines in APCs and shooting\nsoldiers and executing wounded soldiers.\n\nFrom what I've read, they…",
  "original_created_utc": 1622723249,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "天安門事件で私が理解できなかったことの1つに\n第27軍団は、警察や他の軍団を虐殺したり、軍の衛生兵や警官隊をAPCで轢いたり、銃撃したりしていたようです。\n兵士を撃ったり、負傷した兵士を処刑したりしていました。\n兵士を撃ち、負傷した兵士を処刑した。\n\n私が読んだところでは、彼らは...",
      "title": "なぜ天安門広場で第27軍団が他の軍団や警察を殺していたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "天安门广场镇压事件的一个方面，我一直没有真正理解\n是第27集团军的作用，他们似乎是在屠杀警察和其他军队。\n屠杀警察和其他军队，用装甲运兵车碾压军队的医护人员和警察队伍，并开枪射击士兵和处决受伤士兵。\n士兵和处决受伤的士兵。\n\n从我所读到的内容来看，他们...",
      "title": "为什么第27集团军在天安门广场杀了其他集团军/警察？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "天安門廣場鎮壓事件的一個方面，我一直沒有真正理解\n是第27集團軍的作用，他們似乎是在屠殺警察和其他軍隊。\n屠殺警察和其他軍隊，用裝甲運兵車碾壓軍隊的醫護人員和警察隊伍，並開槍射擊士兵和處決受傷士兵。\n士兵和處決受傷的士兵。\n\n從我所讀到的內容來看，他們...",
      "title": "爲什麼第27集團軍在天安門廣場殺了其他集團軍/警察？"
    }
  ],
  "title": "Why were the 27th Army Group killing other Army Groups/Police at Tiananmen Square?",
  "created_utc": 1622735859,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the aspects of the Tienanmen Square crackdowns I&#39;ve never really understood is the role of the 27th Army Group seemingly massacring police, other Army groups, running over army medics and police lines in APCs and shooting soldiers and executing wounded soldiers.</p>\n\n<p>From what I&#39;ve read, they basically had to be cornered on a bridge by other army groups and put down.</p>\n\n<p>What I&#39;ve never seen explained is why, why did this Army Group spend so much time attacking police and other military, Government emergency services personal? Why was it left up to other Army Groups to stop them? Were they rogue?</p>\n</div><!-- SC_ON -->",
  "score": 533,
  "permalink": "/r/AskHistorians/comments/nrca05/why_were_the_27th_army_group_killing_other_army/",
  "subreddit": "AskHistorians",
  "id": "nrca05",
  "is_self": true,
  "media": null,
  "is_video": false
}