{
  "author": "Deep_Restaurant5",
  "the_new_excerpt": "I was doing a summer internship in San Francisco and my boss took me to lunch\nand started asking me about Bitcoin and what I thought of it. We both agreed on\nhow high the price is currently and that what it’s trying to accomplish is\nnothing short of amazing. However, after that conversation he said,…",
  "original_created_utc": 1622604836,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サンフランシスコでサマーインターンをしていたとき、上司がランチに連れて行ってくれて\n上司がランチに連れて行ってくれて、ビットコインについてどう思うか聞いてきました。二人とも\n現在の価格の高さと、ビットコインが成し遂げようとしていることは、素晴らしいとしか言いようがありません。\nしかし、その会話の後で、彼はこう言いました。しかし、その会話の後、彼はこう言いました...。",
      "title": "2017年の初めに上司からイーサリアムを買えと言われました。耳を傾けるべきでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我当时在旧金山做暑期实习，我的老板带我去吃午饭\n并开始问我关于比特币的问题以及我对它的看法。我们都同意\n我们都同意，目前的价格有多高，而且它所要实现的目标是\n它试图实现的东西是非常惊人的。然而，在那次谈话后，他说，...",
      "title": "早在2017年初，我的老板就告诉我购买以太坊。我应该听的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我當時在舊金山做暑期實習，我的老闆帶我去喫午飯\n並開始問我關於比特幣的問題以及我對它的看法。我們都同意\n我們都同意，目前的價格有多高，而且它所要實現的目標是\n它試圖實現的東西是非常驚人的。然而，在那次談話後，他說，...",
      "title": "早在2017年初，我的老闆就告訴我購買以太坊。我應該聽的。"
    }
  ],
  "title": "My boss told me to buy Ethereum back in early 2017. I should have listened.",
  "created_utc": 1622634747,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was doing a summer internship in San Francisco and my boss took me to lunch and started asking me about Bitcoin and what I thought of it. We both agreed on how high the price is currently and that what it’s trying to accomplish is nothing short of amazing. However, after that conversation he said, that he’s really excited about this new coin called Ethereum. He said it’s aiming to be even better than Bitcoin in almost every way and that he can’t wait to get into it soon after the upgrades were to come out that summer. I thought about it but was still too scared to get into right then and there. I’m going to guess this guy has at least a few hundred ETH by now. Maybe even way more.</p>\n\n<p>I feel kind of lucky to have had a conversation like this way back then because it opened my eyes to other Altcoins and it also gave some more insight into the crypto world and provided me with knowledge that most people are just now realizing. While I didn’t buy back then... remembering this conversation helped me in being confident when I started buying Bitcoin last year and Alts this year in January. </p>\n\n<p>Keep an open mind. Some of what you may read on here, or conversations you have with random people on this page, may stick with you and be what you remember in the next bull run in a couple years or so.</p>\n</div><!-- SC_ON -->",
  "score": 366,
  "permalink": "/r/CryptoCurrency/comments/nqcdb9/my_boss_told_me_to_buy_ethereum_back_in_early/",
  "subreddit": "CryptoCurrency",
  "id": "nqcdb9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297952
}