{
  "author": "musinfull",
  "the_new_excerpt": "I had a chance to go on a boating trip with a few of my old pals the other day.\nIt was my first time and I didn't bring my sunglasses and it was a very bright\nday. I struggled to not squint my eyes until one of my good friends offered me a\nspare sunglasses. The relief on my eyes were amazing and I…",
  "original_created_utc": 1623826978,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、昔の仲間たちとボートに乗る機会がありました。\n初めての経験だったので、サングラスを持ってこなかったのですが、とても明るい日だったので\n日でした。私は目を細めないように必死になっていたのですが、親友の一人が予備のサングラスを差し出してくれました。\nサングラスをくれました。私の目の救済は驚くべきもので、私は...",
      "title": "近世（それ以前も）の船乗りは、海上での日焼けや照り返しをどのように回避していたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前几天我有机会和我的几个老伙伴们一起去划船。\n这是我的第一次，我没有带太阳镜，而且那是一个非常明亮的\n天。我挣扎着不让自己的眼睛眯起来，直到我的一个好朋友给我一个\n备用太阳镜。我的眼睛得到的缓解是惊人的，我...",
      "title": "近代早期（甚至在此之前）的水手们在海上航行时是如何避免晒伤和阳光刺眼等事情的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天我有機會和我的幾個老夥伴們一起去划船。\n這是我的第一次，我沒有帶太陽鏡，而且那是一個非常明亮的\n天。我掙扎着不讓自己的眼睛眯起來，直到我的一個好朋友給我一個\n備用太陽鏡。我的眼睛得到的緩解是驚人的，我...",
      "title": "近代早期（甚至在此之前）的水手們在海上航行時是如何避免曬傷和陽光刺眼等事情的？"
    }
  ],
  "title": "How did the sailors of the early-modern (and even before that) avoid things such as sunburn and sun glare while at sea?",
  "created_utc": 1623842327,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had a chance to go on a boating trip with a few of my old pals the other day. It was my first time and I didn&#39;t bring my sunglasses and it was a very bright day. I struggled to not squint my eyes until one of my good friends offered me a spare sunglasses. The relief on my eyes were amazing and I must remember to personally thank the inventor of sunglasses in the afterlife.  </p>\n\n<p>But it made me wonder. How did sailors before the invention of sunglasses (and sunscreen!) dealt with the problem? I know they probably wore hats but that didn&#39;t help much in terms of helping you look across the glimmering bright sea well. I&#39;ve noted that black kohl are used by Asiatic nomads in arid areas but have no idea if Europeans or people in other places were aware of it (or if kohl did anything to help at all).  </p>\n\n<p>Thank you in advance</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/o0ywsi/how_did_the_sailors_of_the_earlymodern_and_even/",
  "subreddit": "AskHistorians",
  "id": "o0ywsi",
  "is_self": true,
  "media": null,
  "is_video": false
}