{
  "author": "RUSSELL_SHERMAN",
  "original_created_utc": 1625774357,
  "title": "What are some cutting edge or 'fashionable' ideas in contemporary philosophy today?",
  "created_utc": 1625818860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I graduated with a degree in philosophy a few years ago. I was planning on pursuing a PhD, but through strange circumstances I ended up with a music career. At the time, I was mostly interested in metaphysics and philosophy of mind, and my professor told me that panpsychism was the all-the-rage in recent years.  </p>\n\n<p>I am quite curious on what are some new ideas (or old ideas that are being given new attention) that have emerged in your area of specialization (or otherwise). I suppose you can interpret &#39;fashionable&#39; however you want, and it can be as specific or general as you want. </p>\n\n<p>Simply asking to sate my curiosity about what people are studying, reading, and discussing these days. I do plan on going back to school at some point. Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/ogf4cj/what_are_some_cutting_edge_or_fashionable_ideas/",
  "subreddit": "askphilosophy",
  "id": "ogf4cj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I graduated with a degree in philosophy a few years ago. I was planning on\npursuing a PhD, but through strange circumstances I ended up with a music\ncareer. At the time, I was mostly interested in metaphysics and philosophy of\nmind, and my professor told me that panpsychism was the all-the-rage in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数年前に哲学の学位を取得して卒業しました。私は博士号を取得するつもりでした。\nしていましたが、ひょんなことから音楽の道に進むことになりました。\nキャリアを持つことになりました。当時、私は形而上学や心の哲学に興味がありました。\n当時、私は形而上学や心の哲学に興味を持っていましたが、教授は私に、汎心論が流行っていると言っていました。",
      "title": "今日の現代哲学における最先端の、あるいは「ファッショナブルな」アイデアとは何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年前，我毕业于哲学专业。我本来打算\n攻读博士学位，但由于奇怪的情况，我最终选择了音乐事业。\n职业。当时，我主要对形而上学和心灵哲学感兴趣。\n我的教授告诉我，泛心理主义是最流行的。",
      "title": "在今天的当代哲学中，有哪些前沿或 \"时尚 \"的思想？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年前，我畢業於哲學專業。我本來打算\n攻讀博士學位，但由於奇怪的情況，我最終選擇了音樂事業。\n職業。當時，我主要對形而上學和心靈哲學感興趣。\n我的教授告訴我，泛心理主義是最流行的。",
      "title": "在今天的當代哲學中，有哪些前沿或 \"時尚 \"的思想？"
    }
  ]
}