{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "All opinions expressed in this post are our own. The statements do not constitute financial or medical advice, and please do your own DD. This post will be updated every three months with position performance information and updated due diligence. Please follow!\n\nThis post shall remain exclusive to WSB's. Please do not repost.\n\n[30 million dollar bet](https://preview.redd.it/8n77t6i5z1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=f2928dab45b19ad7ec1f4c3df7d9c8b233c6a5e7)\n\n&amp;#x200B;\n\n[Orders 1\\/5](https://preview.redd.it/gjgzgawgz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=a360505c4195c368377590d3981f7c5955c662f0)\n\n&amp;#x200B;\n\n[2\\/5](https://preview.redd.it/6rwhyvwiz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=53b7aa90fe20a6786d4e5837c3f40c53d633bedd)\n\n&amp;#x200B;\n\n[3\\/5](https://preview.redd.it/l9jtczrmz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=abf286347ad86ad233ec4561480de67ec0404136)\n\n&amp;#x200B;\n\n[4\\/5](https://preview.redd.it/i5exkmzpz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=ecb25e214c1dbb08588c0e73c116ffd365b55948)\n\n&amp;#x200B;\n\n[5\\/5](https://preview.redd.it/pf3sv1kvz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=452f38914e129d410d620b0c33ff3bc4fdb3a468)\n\n&amp;#x200B;\n\n[Simufilam is Cassava Sciences' \\($SAVA\\) Alzheimer's medication.](https://preview.redd.it/s3c7qhsa12h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=c065eca20c620d2a039339b942fd4da641904672)\n\nTLDR: The graph above represents SAVA's data (red line), and other lines represent competition and placebo. SAVA's cognitive data is not only far superior to the competition; it is the only drug that shows cognitive improvement on ADAS-cog in a US-based trial. This research report explores why this data is worth over 100 billion dollars.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ee5l2zut12h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=0d4b20153782240792f1aa6813693a26599f6dbc\n\nHow did the market value the competition's **subpar** data? The bar chart above represents SAVA's current valuation in red. The other bars ***do not*** represent the competition's market caps. They illustrate how much the market cap **increased** around announcing FDA accelerated approval (AA) or breakthrough therapy designation (BTD) for an Alzheimer's drug.\n\n&amp;#x200B;\n\nThere are many statistics I could quote to convey the market opportunity here, but my favorite is [Michael Engelsgjerd's](https://www.bizjournals.com/austin/news/2021/11/19/cassava-science-drug-trials-sec-investigation.htm) quote. He is a senior equity research analyst at Bloomberg who specializes in the biotech sector (and a third party), stated, \"If you can develop a small molecule pill for Alzheimer's disease that can definitively improve cognition, that would very likely become the most successful product in pharmaceutical history.\"\n\n\"Definitively improving cognition\" is precisely what Simufilam achieved.\n\nDavid Bredt, MD/PhD., the author of the short report against Cassava Sciences, stated, \"if this data is correct..it will result in 5 Nobel Prizes\".\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Valuation Model at maturity](https://preview.redd.it/nj3bfipk62h81.png?width=405&amp;format=png&amp;auto=webp&amp;s=3d1bad4c28f6e0f115eb5c9726cf3be3ba60e411)\n\nBefore we discuss SAVA in depth over the following 50 pages and why the market values it so wildly, I would like to introduce the team of physicians, pharmacologists, Ph.D.'s, and successful investors who wrote and edited this due diligence report.\n\n&amp;#x200B;\n\n[ Matthew Nachtrab \\(his position above\\) is a software entrepreneur. I have a family history of Alzheimer's disease which led me to my investment in Cassava Sciences.    ](https://preview.redd.it/3m6vny3x22h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=df6c386fd3deebdd9552c61242c3cbe24214e5c9)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fkb9wde432h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=cae4645643efa36eb2c539a655c4cfd4cd52d746\n\n[Watch Dr. Boyer discuss Simufilam.](https://youtu.be/h55Rio8qhy8)\n\n&amp;#x200B;\n\n[ ](https://preview.redd.it/a2dcm38642h81.png?width=250&amp;format=png&amp;auto=webp&amp;s=e5935d638c474b18407c8c047697998761579d34)\n\nImran Khan, MD. Associate Professor of Internal Medicine:\n\nFor every 1000 medicare days, 538 hospital days are associated with Alzheimer's disease. I believe this patient population represents the most significant underserved patient population. I am optimistic Cassava Sciences offers hope for my patients. The risk-benefit Analysis represents my perspective on [Simufilam.](https://www.sava-ad.com/post/citizen-s-petition-to-fda-for-expedited-approval-of-simufilam)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/s7rgk14b42h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=143928deddad3d31b7e9b42e26082756f0149309\n\nDr. Baker shares his personal experience with Simufilam [here.](https://youtu.be/UfWZZwx7rlk)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[ I am a board-certified ambulatory care pharmacist who looks forward to the day when I can recommend an Alzheimer's medication without reservation to patients and prescribers. My own research into past and present Alzheimer's medications led me to simufilam and Cassava Sciences.  ](https://preview.redd.it/zv3y45fm42h81.png?width=398&amp;format=png&amp;auto=webp&amp;s=9b2e996b4e0f8991f6d760ac0b3a851668062d9a)\n\n&amp;#x200B;\n\n[ ](https://preview.redd.it/e9ars9k252h81.png?width=408&amp;format=png&amp;auto=webp&amp;s=1391837417d4b99609fb447107a90aaa4f917b5c)\n\nFernando Trejo: Harvard University Graduate and Strategic Advisor delivering optimal business value to Executive Leadership Teams in Healthcare, High Tech, and Cloud Industries; Globetrotting Investor and Innovator Driving Philanthropy in Latin America.\n\n&amp;#x200B;\n\n[ ](https://preview.redd.it/m5wwy5s852h81.png?width=510&amp;format=png&amp;auto=webp&amp;s=c404247c5df4b27cf0d8189a9e4318ea02863930)\n\nSarah Dickerson, Ph.D. I specialized in Toxicology and Neuropharmacology. I am an Alzheimer's Advocate and learned about Cassava Sciences while researching clinical trials for a relative with Alzheimer's disease.\n\n&amp;#x200B;\n\n[ Nick DiFrancesco](https://preview.redd.it/399x61cf52h81.png?width=165&amp;format=png&amp;auto=webp&amp;s=9d095907daabdc60d9e452ada6e2bf3b191208f8)\n\nPost-masters Specialist degree in psychology. My interest and knowledge in cognition and personal experience with Alzheimer's Disease in family members have led me to Cassava Sciences.\n\n&amp;#x200B;\n\nSeveral authors/editors preferred to remain anonymous. Thank you for your contributions. The google doc is 53 pages and contains too many images to post on reddit. Here is the link to the comprehensive DD.  [ https://docs.google.com/document/d/19kRhD-f1R7XoASPyoLPcmUEQ\\_LeAryG1DZOwhxapXAE/edit?usp=sharing](https://docs.google.com/document/d/19kRhD-f1R7XoASPyoLPcmUEQ_LeAryG1DZOwhxapXAE/edit?usp=sharing).  Below is what I was able to fit into reddit minus images.\n\n&amp;#x200B;\n\n**1) Cassava Sciences - The Future of Alzheimer’s Disease Medicine**\n\nCassava Sciences (NASDAQ: SAVA) has publicly released the most promising data on Alzheimer’s treatment to date. Their revolutionary oral drug, Simufilam, as well as their rapid AD diagnostic blood test SavaDX, will potentially solve the largest unmet medical need in medicine. No other Alzheimer’s (AD) drug has been shown to be more effective in human trials (Phase 2b in 2021).In a breakthrough achievement, Cassava’s Simufilam hit the trifecta for medical treatment of Alzheimer’s Disease ─ groundbreaking effectiveness, excellent safety, and, equally important, improved patient behavior.\n\nCassava’s CEO, Remi Barbier, expressed extreme confidence by stating, “We are 100% planning on success”.Eventually, Cassava Sciences will have a binary outcome. However, the existing clinical data reveals a high probability (&gt;90%) of success which we will discuss in-depth below. Recent interest by the FDA in the AD space has led to sharp increases in the market caps of BIIB, LLY, and RHBBY (details discussed below). Simufilam can expect the same upon FDA Approval. This presents investors with a valuable asymmetric risk-benefit investment opportunity. What are asymmetrical investments?\n\n&amp;#x200B;\n\nOver ten years scientists Dr. Hoau-Yan Wang from The City College of New York (CUNY) and Cassava’s Dr. Lindsay Burns developed Simufilam. The journey began when research on postmortem brain dissections revealed the prominent role of tau deposits in Alzheimer’s Disease. They discovered Filamin A (FLNA) , when altered, plays a central role in [tau hyperphosphorylation](https://pubmed.ncbi.nlm.nih.gov/28438486/) and neuroinflammation. Based on this process, in 2011, Dr. Wang and Dr. Burns identified a binding molecule, Simufilam (PTI-125). Ten years later, SAVA’s Simufilam is in a position to revolutionize AD medicine.\n\nEssentially, by reducing tau hyperphosphorylation and inflammation, Simufilam can stop and even reverse the progression of AD to improve the function of the patient.\n\n📷\n\n**2) The Vision: Altering Alzheimer’s Progression and Improving the Lives of Millions of AD Patients and Their Families**\n\nDoctors often face the sad scenario where families bring their elderly relatives to the ER as they are unable to take care of them—not because they have become forgetful, but their agitation and aggressiveness have become unmanageable.Unfortunately, these families have already navigated a complex medical system and know AD is terminal with no efficacious treatment. While heart disease, strokes, sepsis, and other diseases have a myriad of remedies, tragically AD does not. According to the CDC, [AD ranks as the sixth leading cause of death](https://www.cdc.gov/dotw/alzheimers/index.html), and by other estimates, AD is the third leading cause of death for our elderly.\n\nThe unacceptable mortality statistics do little justice to the true scope of AD-related morbidity. Beyond death, AD has a tremendous impact on families, physicians, and society which can be assessed by its economic impact. The Overall Costs for AD are astronomical. Alzheimer's disease is projected to cost US $1.1 trillion dollars by [2050](https://www.alz.org/alzheimers-dementia/facts-figures).\n\n📷\n\nThe progression towards death in Alzheimer’s disease is heartbreaking. Out of every 1,000 Medicare hospital admissions, 538 are associated with AD. Not only are there far more hospitalizations associated with AD, but those hospitalizations are also more complex, have increased duration, and more frequently result in death when compared to non-AD patients.\n\nDecades of failure in the AD space have led to skeptics who believe AD cannot be cured or even effectively treated. However, other neurological diseases faced similar challenges in the past. In Parkinson’s, the medication Sinemet had an extraordinary impact with patients realizing dramatic and immediate improvement. The improvement facilitates decades of time to live independent lives. No such therapy exists for AD, though Simufilam has firm potential to break this paradigm.\n\nThe Amyloid hypothesis has dominated AD research which has led to over 100 failed attempts, most following the amyloid hypothesis, targeting a symptom rather than a root cause of the disease. The process for researchers to examine ADs from different [perspectives](https://www.scientificamerican.com/article/alzheimers-inc-when-a-hypothesis-becomes-too-big-to-fail/) has been slow and challenging but has begun. Simufilam has led the way. Simulfilam’s breakthrough method of targeting the root cause is a novel approach that sidesteps duplicating the missteps of the past. It is a disease-modifying therapy meant to treat Alzheimer’s Disease. Current therapies provide only symptomatic improvement.  Simufilam has the potential to slow cognitive decline, improving the quality of life and even perhaps extending the duration of life for millions of AD patients.\n\nSimufilam additionally improves activities of daily living (ADLs) for many AD patients by reducing Behavioral Disturbances. This makes it much easier for caregivers and for families to care for their loved ones.  Family members experience extreme guilt when they can no longer care for their loved one often progressing to something known as Caregiver Stress Syndrome, characterized by extreme mental, physical &amp; emotional exhaustion and strongly associated with negative health outcomes including depression and anxiety. Further downstream, Simufilam will decrease the burden on our healthcare system and its economic impact.\n\nIn summary, AD is a disease process that starts with one patient, affects a whole family,  and will snowball into a trillion-dollar problem for society, if unaddressed.  Simufilam’s never before seen trifecta of improved cognition, improved ADLs, and less behavioral disturbance is the overdue solution.\n\n**3) Massive Market Opportunity: The Future $Trillion AD Ecosystem**\n\nApple, Netflix, Tesla, and numerous other companies revolutionized their Industries with innovative technologies, creating trillions of dollars in value. Upon approval of Simufilam, Cassava will have the most successful drug in history and will enter their Prestigious ranks. [Michael Engelsgjerd](https://www.bizjournals.com/austin/news/2021/11/19/cassava-science-drug-trials-sec-investigation.htm), a senior equity research analyst at Bloomberg who specializes in the biotech sector, stated, \"If you can develop a small molecule pill for Alzheimer’s disease that can definitively improve cognition, that would very likely become the most successful product in pharmaceutical history.”\n\nThe market has yet to accurately price SAVA’s intrinsic value. Currently, it is pricing in 1-2% chance of success. In the following analysis, we will definitively show that the possibility of success (POS) is greater than 90%.  This presents an extraordinary opportunity for institutional and retail investors.\n\nHumira’s total addressable market grosses approximately $20 billion annually while being used by 1.1 million patients worldwide (65% in the US). Meanwhile, the US Alzheimer’s market is at least 5 times larger.  It is also pertinent to mention Humira has several direct competitors (Simufilam has no competition). We estimate the AD market to expand as treatment becomes available. Most physicians hesitate to diagnose AD when treatment does not exist. In such cases, a diagnosis is a prolonged death sentence. Thus when a treatment is available, the incidence of diagnosed AD will likely increase.\n\nSpecifically, there are 6 million AD patients in the US and 15 million mild cognitive impairment (pre-AD) patients. Globally there are 55 million AD patients. This represents potential revenues that can surpass $100 billion annually.\n\nWhile the market has been slow to comprehend this opportunity, it is not oblivious to it. On Monday, June 7th, $BIIB announced Accelerated Approval of its Alzheimer's medication. The market cap increased by ***$17 billion*** in one day\\*\\*.\\*\\* Similarly the day $LLY and $RHBBY announced FDA Breakthrough Therapy Designation (BTD) of their AD medication, their market cap increased by ***$15 billion and*** **$13 billion,** respectively (on the same day). All three of these medications demonstrated little to no cognitive benefit and have unsafe risk profiles resulting in brain swelling and bleeding.\n\nIn addition to Simufilam, Cassava Sciences has released data on SavaDx. Its importance can not be overstated. AD is a disease that starts decades before clinical symptoms present. Said more simply, AD damages the brain before patients develop memory loss. From a patient's perspective, by the time memory loss develops, it's already too late. This is why clinical neurologists believe preventing AD is more important than treating it. SavaDx gives us the opportunity to prevent AD. It is a simple blood test that can accurately screen AD decades before neuronal injury and death. Early diagnosis with SavaDx gives clinicians the ability to treat AD before it causes irreversible damage in the brain. We envision this patient cohort to become the largest treatable population, upwards of fifteen million, based on the rate of expansion of the AD population.\n\nOnce Simufilam enters the market, Cassava’s SavaDx will rapidly expand Alzheimer’s diagnosis and treatment. SavaDX is currently being evaluated alongside Simufilam in SAVA’s Phase 3 trials.  It is clear that the FDA understands the importance of early diagnosis. Quanterix was granted BTD by the FDA for its version of SavaDx in 2021.\n\nMarket penetration is generally slower for new medications as associated adverse events are often not fully understood by physicians. More importantly, older alternative treatments often exist. With Simufilam’s excellent safety profile and a market with no adequate or alternate treatment, we foresee Simufilam’s uptake to be relatively rapid.\n\nLastly, below we examine the plethora of medical literature supporting added indications for Simufilam. Filamin-A (FLNA), Simufilam’s target, has been implicated in multiple diseases. Yale is aggressively pursuing and has shown clinical benefit in hard-to-treat seizures. A review of medical literature has implicated FLNA in cardiovascular disease. In fact, FLNA is present throughout the body and plays a role in many disease processes including cancer, rheumatoid arthritis, strokes to name a few possibilities. The authors of this analysis believe Simufilam will balloon into a new class of medications similar to monoclonal antibodies.\n\n📷\n\n**4) The Science**\n\n📷\n\nSImufilam has two primary mechanisms. 1) Decreasing neuroinflammation 2) Decreasing Tau Hyperphosphorylation.\n\nFLNA is a complex scaffolding protein with many associated functions and associations. Work by Dr. Wang and Dr. Burns revealed when FLNA’s formation is altered it caused increased binding between AB42 and a cellular membrane protein complex setting off a cascade causing neuroinflammation (via TLR4 receptor), and Neurodegeneration (via the A7 receptor). Simufilam interacts with FLNA to decrease AB42 and the protein complex binding. This in turn stops Inflammation and neurodegeneration (secondary to decrease Tau hyperphosphorylation).  Both the degree of neuroinflammation and neurodegeneration can be gauged with biomarkers associated with the above cascades. These biomarkers include:\n\n1. Abeta42\n2. Total Tau\n3. P-tau181\n4. Neurogranin\n5. Neurofilament Light Chain\n6. YKL-40\n7. Paired Associates Learning Test\n8. Spatial Working Memory Test\n9. IL-6\n10. sTREM2\n11. HMGB1\n12. Albumin\n13. IgG\n14. Filamin A Linkages to alpha7 Nicotinic Acetylcholine Receptor\n15. Toll-like Receptor 4 in Subject Lymphocytes\n16. Plasma P-tau181\n17. SavaDx\n\nIn a randomized placebo-controlled trial, all 17 biomarkers improved in patients taking Simufilam. We will discuss these spectacular results in more detail below.\n\nTo measure both improvement and decline in AD Patients under an experimental drug, we must perform tests on memory/IQ (cognition), activities of daily living (ADLs, ie. patient independence), psychiatric problems (behavioral issues), and stress imposed on caregivers. It helps to have “hard” measures such as blood and cerebrospinal fluid tests, as well as MRIs measuring brain shrinkage.\n\n📷\n\n**Phase 2 Cognition Data Shows Incredible Improvement in AD Patients…**\n\nPer [Woodland Report](https://woodlandreport.com/2021/11/cassava-sciences-sava-alzheimers-drug-may-be-the-best-drug-in-history/):\n\n“[ADAS-Cog](https://journals.sagepub.com/doi/pdf/10.1177/1533317509350298) is the cognitive test used for SAVA’s trial. It is considered the “gold standard” test for evaluating AD drugs and how all AD drugs are ultimately evaluated by the FDA. To date, Simufilam is the only drug that has shown improvement in ADAS-cog, in a US-based trial.\n\nThe ADAS-cog is essentially an IQ/memory test, not an opinion survey. Compared to other cognitive tests such as MMSE, the ADAS-Cog is more sensitive and more comprehensive, requiring 45 minutes to complete. Below we discuss why this test is so thorough making it an accurate measure in AD.\n\n[ADAS-Cog has 11 parts](https://content.iospress.com/articles/journal-of-alzheimers-disease/jad170991) (Dimensions):\n\n* &amp;#x200B;\n\n1. Word Recall Task\n\n* 2. Naming Objects and Fingers\n* 3. Following Commands\n* 4. Constructional Praxis\n* 5. Ideational Praxis\n* 6. Orientation\n* 7. Word Recognition Task\n* 8. Remembering Test Directions\n* 9. Spoken Language\n* 10. Comprehension\n* 11. Word-Finding Difficulty\n\nBased on 70 points, a higher score implies more errors (worse cognition). Eight of the 11 parts are objective. The other 3 require some subjective judgment to score, though there are clear guidelines in how they are scored. Let’s get into some detail.\n\nDimensions 1-4, 6-7, and 11 (i.e., seven out of eleven of all dimensions in ADAS-Cog) offer little room for random error, subjectivity, or rater bias as this assessment has a clear right or wrong answer.\n\n📷\n\nFor example, consider dimension #1, Word Recall. For this, \"A list of 10 words is read by the subject, and then the subject is asked to verbally recall as many of the words as possible. This test is repeated three times. The number of words not recalled across the three trials is averaged giving a score of 0 to 10. The test administrator does not use his subjective judgment at all; instead, the patient either remembers each of the 10 words or not.\n\n📷\n\nAnother example, consider dimension #6, which assesses orientation. The subject is asked the date, month, year, day of the week, season, time of day, place, and person. The number of correct responses ranges from 0 to 8. The patient either correctly knows where he or she is or does not know; no subjective judgment is needed.\n\nTake a look at the other dimensions that have clear right-or-wrong answers (i.e., 2, 3, 4, 7, and 11).\n\n📷Across the seven dimensions, the total number of available errors a patient can show is 49 (about 70% of all errors available).\n\nDimensions #5 and #8-10 (which together constitute 30% of all errors available)? These may not have clear right-or-wrong answers, however, ADAS-Cog test administrators receive training to avoid differences in scoring due to subjectivity. For dimension #5, Ideational Praxis, \"The subject is asked to send a letter to themselves.  The instructions are:\n\n1. Fold the letter\n2. Put the letter in an envelope\n3. Seal the envelope\n4. Address the envelope\n5. Put a stamp on the envelope\n\nScored from 0 to 5 based on the difficulty of performing the five components. If the patient adequately finishes all letter-sending tasks mentioned, then they'd get a 0 (no error). Difficulty in performing the steps warrants an assignment of an error point. As the reader can see, this is straightforward to score.\n\nFor dimensions #8-10, the administrator has a 10-minute open-ended conversation with the patient, and at the end, the test giver rates the patient from 0-5 per quality of the patient's speech based on:\n\n1. How well the patient understands what the administrator is saying\n2. The difficulty the patient has in finding desired words\n\nIf the patient speaks like a typical person like you and me, they'd get a 0 for each of the three dimensions (#8-10). To a clinician, these distinctions are obvious and take little thought. All physicians, PAs, and Nurse Practitioners learn to assess orientation and conversational skills early in training. These are some of the earliest clues to cognitive impairment and are a required assessment on basic history and physical exam (H&amp;P).\n\nFurther, In psychometrics, researchers often deal with such performance or ability-based questions that do not readily offer clear right or wrong response options--and instead rely on the judgment of the rater. To mitigate this familiar issue, for decades researchers have developed rater training techniques to form a consensus on what type or degree of behavior corresponds to roughly what score. Rather than each rater using their own unique/idiosyncratic standards. An additional mitigation tactic is another party observing the test and giving their own score independently which is done at the AD trial sites. In addition, many clinical sites that perform cognitive testing for Cassava Sciences are also responsible to perform cognitive testing for LLY and BIIB via ADAS. To highlight this point, recent ADAS-cog testing showed little improvement in both LLY’s and BIIB’s medication over thousands of patients assessed. These same assessors gave Cassava Sciences’ patients scores clearly indicating improved cognition.\n\nAs these clinical test sites specialize in research trials in AD drugs (also performing studies for SAVA’s competitors, it’s what they professionally do), they would have a close familiarity with the ADAS-Cog. By definition, these physicians’ test-judging styles would form the gold standard. Notably, SAVA does not have involvement with how the sites are run; SAVA requests that the sites use ADAS-Cog per cognitive measurement and then the sites take it from there.\n\nIn (Ihl et al., 2012) the authors describe \"the collection of ADAS-Cog-11 \\[dimensions\\] with the most potential for detecting a treatment response.\" These dimensions were:\n\n1. Ideational Praxis\n2. Remembering Test Instructions\n3. Language\n4. Comprehension of Spoken Language\n5. Word Finding Difficulty\n\nDimensions #5 and 8-10 (which constitute 30% of total errors) are all included in this subset. Based on actual empirical evidence, dimensions #5 and 8-10 are \\*in practice\\* largely objective and valid. Concerns of subjectivity are hypothetical, which has not been observed over decades of ADAS-cog administration.\n\nAs it turns out, the more subjective portions of the ADAS-Cog [have very little relative contribution](https://www.page-meeting.org/pdf_assets/2921-ADAScog_IRT_Sebastian_Ueckert.pdf) amongst patients.\n\n📷\n\nInstead, it is tests 1, 6, and 7 that have the greatest impact. These are right-or-wrong Word Recall and Orientation questions, which all test short term memory. This makes sense given AD is a disease of short term memory. Placebo effect is unlikely to make a person suddenly remember the day or location, or recall a list of words.\n\nOf note, Phase 3 will use ADAS-Cog12 which adds a Delayed Recall section. This makes it more sensitive for mild cognitive impairment. Simufilam will target this larger group of people (15 million patients in the US).\n\nSkeptics can argue that due to the open-label nature of the Phase 2b trial, physicians can still score certain sections favorably for SAVA. However, the math definitely suggests this is extremely unlikely to make up for the large 8.2-9.2 point difference between the 12-month data and placebo. In addition, open-label trials of other AD drugs using the ADAS-Cog do not show these same results (discussed in the section below). Unlike with Simufilam, those patients all declined from 6 months onward in both open-label and placebo-controlled trials. We will discuss a cohort of over 40,000 patients to make this clear, below. Essentially, AD is like Rabies or cancer.  Either it is treated, or it overwhelmingly leads to death. Thus if we see AD patients improving over 12 months, it is assuredly treatment effect, not placebo.”\n\n**5) Why the data is so unique in both Biomarkers and Cognitive Data.**\n\n## Biomarker Data Predicts Efficacy Simufilam\n\n📷\n\nSimufilam’s biomarker results were groundbreaking. Previous AD medication directly targeted a single focus downstream and corresponding biomarkers showed limited benefit.   Several surrogate markers like increased inflammation and cerebral atrophy (brain shrinking) that were reported by Simufilam’s competitors foreshadow negative clinical outcomes long term.  Comparatively, Simufilam works upstream and the effect can be analyzed by 17 biomarkers monitoring neuroinflammation and neurodegeneration. The totality of all 17 biomarkers makes for a much more convincing case than the few reported by competitors. To be clear, all 17 biomarkers checked by Cassava Sciences improved in a 28-day randomized controlled trial. The two most important biomarkers include Aβ42/40 ratio and ptau181 which directly correlate with Alzheimer’s disease progression.\n\nThe utility of biomarkers in AD is to predict cognitive improvement before it happens as cognitive improvement can take many months. After reviewing the spectacular biomarker data in the 28-day trial, we anticipated cognitive data improvement would follow. The Biomarkers predicted correctly, as expected:\n\n## 📷\n\nThe above ADAS-cog scores are what make Cassava Sciences a generational opportunity. Along with the biomarker data, these ADAS-cog score improvements have never been achieved in any US-based trial over 12 months. The Chart below shows Simufilam’s data (Red Line) compared to what is expected due to the natural course of the disease. This is represented by the Placebo group (Grey Line) and  Eli Lilly’s Donanemab (Green Line) trial. Simufilam Cohort results are vastly superior to both the Placebo and Donanemab Cohorts. Though BIIBs and RHHBYs medication has not been included on the below graph, the difference between Simufilam and those medications is just as significant.\n\nThe first 50 patients in the Phase 2b trials take place at 7 clinical sites (currently expanded to 200 patients and 16 sites). The table below shows patient selection. These are mild and moderate AD patients with an average age of approximately 70.\n\n📷\n\n📷\n\nBiomarkers were followed on 25 of the 50 initial patients and continued to impress:\n\n📷\n\nAgain, the biomarker data foreshadowed continued cognitive improvement correctly.  The mechanism of action (MOA) of Biogen’s Aduhelm (and many other Alzheimer’s drugs) seeks to directly target amyloid-beta to reduce the number of plaques, while Simufilam’s MOA  is further upstream and more comprehensive. It works by decreasing tau hyperphosphorylation and plaque build-up and decreasing inflammation.  By targeting a deeper, more fundamental cause, Simufilam serves as a more powerful means to not just clear the plaques, but also prevent formation. Biogen’s Aduhelm decreased pTau-181 levels by 13-16% at 12 months, Simufilam decreased it by 18% in half the time.  \n\nPlease follow this google doc link to finish reading the DD.  [https://docs.google.com/document/d/19kRhD-f1R7XoASPyoLPcmUEQ\\_LeAryG1DZOwhxapXAE/edit?usp=sharing](https://docs.google.com/document/d/19kRhD-f1R7XoASPyoLPcmUEQ_LeAryG1DZOwhxapXAE/edit?usp=sharing),  \n\n## \n\n&amp;#x200B;\n\n&amp;#x200B;",
  "author_fullname": "t2_7k9ncq01",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 3,
  "clicked": false,
  "title": "Largest Bet In WSB History! $SAVA ($30,121,964.39)",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "DD"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "dd",
  "downs": 0,
  "thumbnail_height": 44,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "m5wwy5s852h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 108,
          "x": 108,
          "u": "https://preview.redd.it/m5wwy5s852h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=f10375de8b8faa1deddae3db6ba1afcc8aa3712a"
        },
        {
          "y": 216,
          "x": 216,
          "u": "https://preview.redd.it/m5wwy5s852h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=d65d21da1b01e8d9a94ed8bfe49ed5b99a5416b2"
        },
        {
          "y": 321,
          "x": 320,
          "u": "https://preview.redd.it/m5wwy5s852h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=1ea4ba287cde8c9603e77741c61a0a907ab1d61b"
        }
      ],
      "s": {
        "y": 512,
        "x": 510,
        "u": "https://preview.redd.it/m5wwy5s852h81.png?width=510&amp;format=png&amp;auto=webp&amp;s=c404247c5df4b27cf0d8189a9e4318ea02863930"
      },
      "id": "m5wwy5s852h81"
    },
    "a2dcm38642h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 138,
          "x": 108,
          "u": "https://preview.redd.it/a2dcm38642h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=0a082592e443afe1bb466d96dba6f192cc8bef78"
        },
        {
          "y": 276,
          "x": 216,
          "u": "https://preview.redd.it/a2dcm38642h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=23d7f317d5b1715fa06cb5a6bdd25577dfc69487"
        }
      ],
      "s": {
        "y": 320,
        "x": 250,
        "u": "https://preview.redd.it/a2dcm38642h81.png?width=250&amp;format=png&amp;auto=webp&amp;s=e5935d638c474b18407c8c047697998761579d34"
      },
      "id": "a2dcm38642h81"
    },
    "l9jtczrmz1h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 97,
          "x": 108,
          "u": "https://preview.redd.it/l9jtczrmz1h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=be09aa0daa2572ef96b7f645f9f0af30e9f0e9f6"
        },
        {
          "y": 195,
          "x": 216,
          "u": "https://preview.redd.it/l9jtczrmz1h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=ef3ad110b48a2560fd992354ce26a7a96a01fcca"
        },
        {
          "y": 290,
          "x": 320,
          "u": "https://preview.redd.it/l9jtczrmz1h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=0fd17a79882baa3662308c4152ad14bacb98e570"
        }
      ],
      "s": {
        "y": 464,
        "x": 512,
        "u": "https://preview.redd.it/l9jtczrmz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=abf286347ad86ad233ec4561480de67ec0404136"
      },
      "id": "l9jtczrmz1h81"
    },
    "pf3sv1kvz1h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 23,
          "x": 108,
          "u": "https://preview.redd.it/pf3sv1kvz1h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=769c6d61d716b70d057599c557c4741c5bcb43e3"
        },
        {
          "y": 47,
          "x": 216,
          "u": "https://preview.redd.it/pf3sv1kvz1h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=df915e4b0adc58b44c5716572ddbe63065d84bdc"
        },
        {
          "y": 70,
          "x": 320,
          "u": "https://preview.redd.it/pf3sv1kvz1h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=035f28597dfc56723758f61b980c8ddb9e436e2a"
        }
      ],
      "s": {
        "y": 113,
        "x": 512,
        "u": "https://preview.redd.it/pf3sv1kvz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=452f38914e129d410d620b0c33ff3bc4fdb3a468"
      },
      "id": "pf3sv1kvz1h81"
    },
    "gjgzgawgz1h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 96,
          "x": 108,
          "u": "https://preview.redd.it/gjgzgawgz1h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=90d0ce983c491596fe12603311eba23039e33fc1"
        },
        {
          "y": 192,
          "x": 216,
          "u": "https://preview.redd.it/gjgzgawgz1h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=64ba0d738ae4172a770e544668271f7bf9ffec4c"
        },
        {
          "y": 285,
          "x": 320,
          "u": "https://preview.redd.it/gjgzgawgz1h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=970705b1ae87380a8fe5eb0177c1dc1c16942dd7"
        }
      ],
      "s": {
        "y": 457,
        "x": 512,
        "u": "https://preview.redd.it/gjgzgawgz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=a360505c4195c368377590d3981f7c5955c662f0"
      },
      "id": "gjgzgawgz1h81"
    },
    "zv3y45fm42h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 138,
          "x": 108,
          "u": "https://preview.redd.it/zv3y45fm42h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=990d99817906b389fe29d9a6fb382d5062fc8274"
        },
        {
          "y": 277,
          "x": 216,
          "u": "https://preview.redd.it/zv3y45fm42h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=571c1c27d69c62aac792aece660bddc960f77a5a"
        },
        {
          "y": 411,
          "x": 320,
          "u": "https://preview.redd.it/zv3y45fm42h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=c1e22ede3b065995010037540b22706278a99d26"
        }
      ],
      "s": {
        "y": 512,
        "x": 398,
        "u": "https://preview.redd.it/zv3y45fm42h81.png?width=398&amp;format=png&amp;auto=webp&amp;s=9b2e996b4e0f8991f6d760ac0b3a851668062d9a"
      },
      "id": "zv3y45fm42h81"
    },
    "8n77t6i5z1h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 34,
          "x": 108,
          "u": "https://preview.redd.it/8n77t6i5z1h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=77134bb5435cf5d322c5e0a49be6f571750af329"
        },
        {
          "y": 69,
          "x": 216,
          "u": "https://preview.redd.it/8n77t6i5z1h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=a302c4552e2c9189c6849b74a9c1febcb4d288aa"
        },
        {
          "y": 102,
          "x": 320,
          "u": "https://preview.redd.it/8n77t6i5z1h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=bce9d9066f83bd69c37b255f9ae8f877d3fce38e"
        }
      ],
      "s": {
        "y": 164,
        "x": 512,
        "u": "https://preview.redd.it/8n77t6i5z1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=f2928dab45b19ad7ec1f4c3df7d9c8b233c6a5e7"
      },
      "id": "8n77t6i5z1h81"
    },
    "3m6vny3x22h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/3m6vny3x22h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=eee9b695c626ba17c9e8ccd5fc14f091673c627d"
        },
        {
          "y": 143,
          "x": 216,
          "u": "https://preview.redd.it/3m6vny3x22h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=3d4f6a976f0956aacb2800752315d882b5ad8a0a"
        },
        {
          "y": 213,
          "x": 320,
          "u": "https://preview.redd.it/3m6vny3x22h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=5bf9f927cbcbe2ddc001a0a29d7456f330923ffe"
        }
      ],
      "s": {
        "y": 341,
        "x": 512,
        "u": "https://preview.redd.it/3m6vny3x22h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=df6c386fd3deebdd9552c61242c3cbe24214e5c9"
      },
      "id": "3m6vny3x22h81"
    },
    "e9ars9k252h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 108,
          "x": 108,
          "u": "https://preview.redd.it/e9ars9k252h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=1eb9480b69589dcf6ddee4b879c2b203f81a638d"
        },
        {
          "y": 216,
          "x": 216,
          "u": "https://preview.redd.it/e9ars9k252h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=b179041b88a87b3c07a0c05676d08bd821de3387"
        },
        {
          "y": 320,
          "x": 320,
          "u": "https://preview.redd.it/e9ars9k252h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=f1649801ebc3246d69a3cdaa9dbda5d950c18f63"
        }
      ],
      "s": {
        "y": 408,
        "x": 408,
        "u": "https://preview.redd.it/e9ars9k252h81.png?width=408&amp;format=png&amp;auto=webp&amp;s=1391837417d4b99609fb447107a90aaa4f917b5c"
      },
      "id": "e9ars9k252h81"
    },
    "nj3bfipk62h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 136,
          "x": 108,
          "u": "https://preview.redd.it/nj3bfipk62h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=680c5406d0adab9988524b2b64f2f1b6a27b5fe4"
        },
        {
          "y": 273,
          "x": 216,
          "u": "https://preview.redd.it/nj3bfipk62h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=c1e268fa4a58fa22dce6e6b3ada252a3366c28c4"
        },
        {
          "y": 404,
          "x": 320,
          "u": "https://preview.redd.it/nj3bfipk62h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=15bc7c72eee0d1ad02eb475d6784aa7403a2c283"
        }
      ],
      "s": {
        "y": 512,
        "x": 405,
        "u": "https://preview.redd.it/nj3bfipk62h81.png?width=405&amp;format=png&amp;auto=webp&amp;s=3d1bad4c28f6e0f115eb5c9726cf3be3ba60e411"
      },
      "id": "nj3bfipk62h81"
    },
    "s3c7qhsa12h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/s3c7qhsa12h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=af83a8ccd548f02db11207e0dbdaa2d28f8d8432"
        },
        {
          "y": 143,
          "x": 216,
          "u": "https://preview.redd.it/s3c7qhsa12h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=b7b58736e8946c2f8bbfd468cfb5913abbe73bac"
        },
        {
          "y": 211,
          "x": 320,
          "u": "https://preview.redd.it/s3c7qhsa12h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=f74536b49351237a58563046a075cb744add1ea0"
        }
      ],
      "s": {
        "y": 339,
        "x": 512,
        "u": "https://preview.redd.it/s3c7qhsa12h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=c065eca20c620d2a039339b942fd4da641904672"
      },
      "id": "s3c7qhsa12h81"
    },
    "fkb9wde432h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 42,
          "x": 108,
          "u": "https://preview.redd.it/fkb9wde432h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=1ad6151d4d8ab297a0bae95f9416a557d457336f"
        },
        {
          "y": 84,
          "x": 216,
          "u": "https://preview.redd.it/fkb9wde432h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=45fc0ce31c9156ca3a2ce0c09a72538c9a07d27d"
        },
        {
          "y": 125,
          "x": 320,
          "u": "https://preview.redd.it/fkb9wde432h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=a976d3101bed65943ffea7cd0f5dbf1f0d5d0249"
        }
      ],
      "s": {
        "y": 200,
        "x": 512,
        "u": "https://preview.redd.it/fkb9wde432h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=cae4645643efa36eb2c539a655c4cfd4cd52d746"
      },
      "id": "fkb9wde432h81"
    },
    "ee5l2zut12h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 105,
          "x": 108,
          "u": "https://preview.redd.it/ee5l2zut12h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=10d22d60afd8eb50ca035528e8ab84d67e5546d0"
        },
        {
          "y": 210,
          "x": 216,
          "u": "https://preview.redd.it/ee5l2zut12h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=9b2bc210ba4ef95b1c5a7b431ef922d1f5232a71"
        },
        {
          "y": 311,
          "x": 320,
          "u": "https://preview.redd.it/ee5l2zut12h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=f9f9480ca452df002edd7814ac1cdef139b8024b"
        }
      ],
      "s": {
        "y": 499,
        "x": 512,
        "u": "https://preview.redd.it/ee5l2zut12h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=0d4b20153782240792f1aa6813693a26599f6dbc"
      },
      "id": "ee5l2zut12h81"
    },
    "6rwhyvwiz1h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 99,
          "x": 108,
          "u": "https://preview.redd.it/6rwhyvwiz1h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=1f158f2ae9be51a1e7e805480b15304db7abd4ef"
        },
        {
          "y": 198,
          "x": 216,
          "u": "https://preview.redd.it/6rwhyvwiz1h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=9bbdfcc45831a35062f0638d55bd7e6340175c05"
        },
        {
          "y": 294,
          "x": 320,
          "u": "https://preview.redd.it/6rwhyvwiz1h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=6bba7a2943efcd6854b1e13aba281c72ab52e447"
        }
      ],
      "s": {
        "y": 471,
        "x": 512,
        "u": "https://preview.redd.it/6rwhyvwiz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=53b7aa90fe20a6786d4e5837c3f40c53d633bedd"
      },
      "id": "6rwhyvwiz1h81"
    },
    "i5exkmzpz1h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 97,
          "x": 108,
          "u": "https://preview.redd.it/i5exkmzpz1h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=5348c6d9e3c7c668233e6ec0ca6390d2f12ab7c6"
        },
        {
          "y": 194,
          "x": 216,
          "u": "https://preview.redd.it/i5exkmzpz1h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=fb3278beee79d4b8bb9ccdf832abbd96751f7c1c"
        },
        {
          "y": 288,
          "x": 320,
          "u": "https://preview.redd.it/i5exkmzpz1h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=452309be8f2d85b4b50d6095e0edb5f44b932d77"
        }
      ],
      "s": {
        "y": 461,
        "x": 512,
        "u": "https://preview.redd.it/i5exkmzpz1h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=ecb25e214c1dbb08588c0e73c116ffd365b55948"
      },
      "id": "i5exkmzpz1h81"
    },
    "s7rgk14b42h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 62,
          "x": 108,
          "u": "https://preview.redd.it/s7rgk14b42h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=610cbe56629b77aca373b996a708e03a45efa04c"
        },
        {
          "y": 125,
          "x": 216,
          "u": "https://preview.redd.it/s7rgk14b42h81.png?width=216&amp;crop=smart&amp;auto=webp&amp;s=e3cf3b5479e309ebced4cf47d901e927b4b926a2"
        },
        {
          "y": 186,
          "x": 320,
          "u": "https://preview.redd.it/s7rgk14b42h81.png?width=320&amp;crop=smart&amp;auto=webp&amp;s=ecf450c2a49884e3947e21e465a8fdf64835cd06"
        }
      ],
      "s": {
        "y": 298,
        "x": 512,
        "u": "https://preview.redd.it/s7rgk14b42h81.png?width=512&amp;format=png&amp;auto=webp&amp;s=143928deddad3d31b7e9b42e26082756f0149309"
      },
      "id": "s7rgk14b42h81"
    },
    "399x61cf52h81": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 90,
          "x": 108,
          "u": "https://preview.redd.it/399x61cf52h81.png?width=108&amp;crop=smart&amp;auto=webp&amp;s=43ac6f69d663a074e4bc7622e5220da6f044331d"
        }
      ],
      "s": {
        "y": 138,
        "x": 165,
        "u": "https://preview.redd.it/399x61cf52h81.png?width=165&amp;format=png&amp;auto=webp&amp;s=9d095907daabdc60d9e452ada6e2bf3b191208f8"
      },
      "id": "399x61cf52h81"
    }
  },
  "name": "t3_spfed0",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.83,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1010,
  "total_awards_received": 26,
  "media_embed": {},
  "thumbnail_width": 140,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "DD",
  "can_mod_post": false,
  "score": 1010,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "https://b.thumbs.redditmedia.com/2lUEnNrVxPT4Av763F1tYorYALY3MsytQ9QceNUutJY.jpg",
  "edited": 1644525683,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 4,
    "gid_2": 3,
    "gid_3": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1644522872,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All opinions expressed in this post are our own. The statements do not constitute financial or medical advice, and please do your own DD. This post will be updated every three months with position performance information and updated due diligence. Please follow!&lt;/p&gt;\n\n&lt;p&gt;This post shall remain exclusive to WSB&amp;#39;s. Please do not repost.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/8n77t6i5z1h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=f2928dab45b19ad7ec1f4c3df7d9c8b233c6a5e7\"&gt;30 million dollar bet&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/gjgzgawgz1h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=a360505c4195c368377590d3981f7c5955c662f0\"&gt;Orders 1/5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/6rwhyvwiz1h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=53b7aa90fe20a6786d4e5837c3f40c53d633bedd\"&gt;2/5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/l9jtczrmz1h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=abf286347ad86ad233ec4561480de67ec0404136\"&gt;3/5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/i5exkmzpz1h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ecb25e214c1dbb08588c0e73c116ffd365b55948\"&gt;4/5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/pf3sv1kvz1h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=452f38914e129d410d620b0c33ff3bc4fdb3a468\"&gt;5/5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/s3c7qhsa12h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c065eca20c620d2a039339b942fd4da641904672\"&gt;Simufilam is Cassava Sciences&amp;#39; ($SAVA) Alzheimer&amp;#39;s medication.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;TLDR: The graph above represents SAVA&amp;#39;s data (red line), and other lines represent competition and placebo. SAVA&amp;#39;s cognitive data is not only far superior to the competition; it is the only drug that shows cognitive improvement on ADAS-cog in a US-based trial. This research report explores why this data is worth over 100 billion dollars.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ee5l2zut12h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0d4b20153782240792f1aa6813693a26599f6dbc\"&gt;https://preview.redd.it/ee5l2zut12h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0d4b20153782240792f1aa6813693a26599f6dbc&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;How did the market value the competition&amp;#39;s &lt;strong&gt;subpar&lt;/strong&gt; data? The bar chart above represents SAVA&amp;#39;s current valuation in red. The other bars &lt;strong&gt;&lt;em&gt;do not&lt;/em&gt;&lt;/strong&gt; represent the competition&amp;#39;s market caps. They illustrate how much the market cap &lt;strong&gt;increased&lt;/strong&gt; around announcing FDA accelerated approval (AA) or breakthrough therapy designation (BTD) for an Alzheimer&amp;#39;s drug.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;There are many statistics I could quote to convey the market opportunity here, but my favorite is &lt;a href=\"https://www.bizjournals.com/austin/news/2021/11/19/cassava-science-drug-trials-sec-investigation.htm\"&gt;Michael Engelsgjerd&amp;#39;s&lt;/a&gt; quote. He is a senior equity research analyst at Bloomberg who specializes in the biotech sector (and a third party), stated, &amp;quot;If you can develop a small molecule pill for Alzheimer&amp;#39;s disease that can definitively improve cognition, that would very likely become the most successful product in pharmaceutical history.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Definitively improving cognition&amp;quot; is precisely what Simufilam achieved.&lt;/p&gt;\n\n&lt;p&gt;David Bredt, MD/PhD., the author of the short report against Cassava Sciences, stated, &amp;quot;if this data is correct..it will result in 5 Nobel Prizes&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/nj3bfipk62h81.png?width=405&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=3d1bad4c28f6e0f115eb5c9726cf3be3ba60e411\"&gt;Valuation Model at maturity&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Before we discuss SAVA in depth over the following 50 pages and why the market values it so wildly, I would like to introduce the team of physicians, pharmacologists, Ph.D.&amp;#39;s, and successful investors who wrote and edited this due diligence report.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/3m6vny3x22h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=df6c386fd3deebdd9552c61242c3cbe24214e5c9\"&gt; Matthew Nachtrab (his position above) is a software entrepreneur. I have a family history of Alzheimer&amp;#39;s disease which led me to my investment in Cassava Sciences.    &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/fkb9wde432h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=cae4645643efa36eb2c539a655c4cfd4cd52d746\"&gt;https://preview.redd.it/fkb9wde432h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=cae4645643efa36eb2c539a655c4cfd4cd52d746&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://youtu.be/h55Rio8qhy8\"&gt;Watch Dr. Boyer discuss Simufilam.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/a2dcm38642h81.png?width=250&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e5935d638c474b18407c8c047697998761579d34\"&gt; &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Imran Khan, MD. Associate Professor of Internal Medicine:&lt;/p&gt;\n\n&lt;p&gt;For every 1000 medicare days, 538 hospital days are associated with Alzheimer&amp;#39;s disease. I believe this patient population represents the most significant underserved patient population. I am optimistic Cassava Sciences offers hope for my patients. The risk-benefit Analysis represents my perspective on &lt;a href=\"https://www.sava-ad.com/post/citizen-s-petition-to-fda-for-expedited-approval-of-simufilam\"&gt;Simufilam.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/s7rgk14b42h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=143928deddad3d31b7e9b42e26082756f0149309\"&gt;https://preview.redd.it/s7rgk14b42h81.png?width=512&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=143928deddad3d31b7e9b42e26082756f0149309&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Dr. Baker shares his personal experience with Simufilam &lt;a href=\"https://youtu.be/UfWZZwx7rlk\"&gt;here.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/zv3y45fm42h81.png?width=398&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9b2e996b4e0f8991f6d760ac0b3a851668062d9a\"&gt; I am a board-certified ambulatory care pharmacist who looks forward to the day when I can recommend an Alzheimer&amp;#39;s medication without reservation to patients and prescribers. My own research into past and present Alzheimer&amp;#39;s medications led me to simufilam and Cassava Sciences.  &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/e9ars9k252h81.png?width=408&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=1391837417d4b99609fb447107a90aaa4f917b5c\"&gt; &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Fernando Trejo: Harvard University Graduate and Strategic Advisor delivering optimal business value to Executive Leadership Teams in Healthcare, High Tech, and Cloud Industries; Globetrotting Investor and Innovator Driving Philanthropy in Latin America.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/m5wwy5s852h81.png?width=510&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c404247c5df4b27cf0d8189a9e4318ea02863930\"&gt; &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Sarah Dickerson, Ph.D. I specialized in Toxicology and Neuropharmacology. I am an Alzheimer&amp;#39;s Advocate and learned about Cassava Sciences while researching clinical trials for a relative with Alzheimer&amp;#39;s disease.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/399x61cf52h81.png?width=165&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9d095907daabdc60d9e452ada6e2bf3b191208f8\"&gt; Nick DiFrancesco&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Post-masters Specialist degree in psychology. My interest and knowledge in cognition and personal experience with Alzheimer&amp;#39;s Disease in family members have led me to Cassava Sciences.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Several authors/editors preferred to remain anonymous. Thank you for your contributions. The google doc is 53 pages and contains too many images to post on reddit. Here is the link to the comprehensive DD.  &lt;a href=\"https://docs.google.com/document/d/19kRhD-f1R7XoASPyoLPcmUEQ_LeAryG1DZOwhxapXAE/edit?usp=sharing\"&gt; https://docs.google.com/document/d/19kRhD-f1R7XoASPyoLPcmUEQ_LeAryG1DZOwhxapXAE/edit?usp=sharing&lt;/a&gt;.  Below is what I was able to fit into reddit minus images.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1) Cassava Sciences - The Future of Alzheimer’s Disease Medicine&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Cassava Sciences (NASDAQ: SAVA) has publicly released the most promising data on Alzheimer’s treatment to date. Their revolutionary oral drug, Simufilam, as well as their rapid AD diagnostic blood test SavaDX, will potentially solve the largest unmet medical need in medicine. No other Alzheimer’s (AD) drug has been shown to be more effective in human trials (Phase 2b in 2021).In a breakthrough achievement, Cassava’s Simufilam hit the trifecta for medical treatment of Alzheimer’s Disease ─ groundbreaking effectiveness, excellent safety, and, equally important, improved patient behavior.&lt;/p&gt;\n\n&lt;p&gt;Cassava’s CEO, Remi Barbier, expressed extreme confidence by stating, “We are 100% planning on success”.Eventually, Cassava Sciences will have a binary outcome. However, the existing clinical data reveals a high probability (&amp;gt;90%) of success which we will discuss in-depth below. Recent interest by the FDA in the AD space has led to sharp increases in the market caps of BIIB, LLY, and RHBBY (details discussed below). Simufilam can expect the same upon FDA Approval. This presents investors with a valuable asymmetric risk-benefit investment opportunity. What are asymmetrical investments?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Over ten years scientists Dr. Hoau-Yan Wang from The City College of New York (CUNY) and Cassava’s Dr. Lindsay Burns developed Simufilam. The journey began when research on postmortem brain dissections revealed the prominent role of tau deposits in Alzheimer’s Disease. They discovered Filamin A (FLNA) , when altered, plays a central role in &lt;a href=\"https://pubmed.ncbi.nlm.nih.gov/28438486/\"&gt;tau hyperphosphorylation&lt;/a&gt; and neuroinflammation. Based on this process, in 2011, Dr. Wang and Dr. Burns identified a binding molecule, Simufilam (PTI-125). Ten years later, SAVA’s Simufilam is in a position to revolutionize AD medicine.&lt;/p&gt;\n\n&lt;p&gt;Essentially, by reducing tau hyperphosphorylation and inflammation, Simufilam can stop and even reverse the progression of AD to improve the function of the patient.&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2) The Vision: Altering Alzheimer’s Progression and Improving the Lives of Millions of AD Patients and Their Families&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Doctors often face the sad scenario where families bring their elderly relatives to the ER as they are unable to take care of them—not because they have become forgetful, but their agitation and aggressiveness have become unmanageable.Unfortunately, these families have already navigated a complex medical system and know AD is terminal with no efficacious treatment. While heart disease, strokes, sepsis, and other diseases have a myriad of remedies, tragically AD does not. According to the CDC, &lt;a href=\"https://www.cdc.gov/dotw/alzheimers/index.html\"&gt;AD ranks as the sixth leading cause of death&lt;/a&gt;, and by other estimates, AD is the third leading cause of death for our elderly.&lt;/p&gt;\n\n&lt;p&gt;The unacceptable mortality statistics do little justice to the true scope of AD-related morbidity. Beyond death, AD has a tremendous impact on families, physicians, and society which can be assessed by its economic impact. The Overall Costs for AD are astronomical. Alzheimer&amp;#39;s disease is projected to cost US $1.1 trillion dollars by &lt;a href=\"https://www.alz.org/alzheimers-dementia/facts-figures\"&gt;2050&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;The progression towards death in Alzheimer’s disease is heartbreaking. Out of every 1,000 Medicare hospital admissions, 538 are associated with AD. Not only are there far more hospitalizations associated with AD, but those hospitalizations are also more complex, have increased duration, and more frequently result in death when compared to non-AD patients.&lt;/p&gt;\n\n&lt;p&gt;Decades of failure in the AD space have led to skeptics who believe AD cannot be cured or even effectively treated. However, other neurological diseases faced similar challenges in the past. In Parkinson’s, the medication Sinemet had an extraordinary impact with patients realizing dramatic and immediate improvement. The improvement facilitates decades of time to live independent lives. No such therapy exists for AD, though Simufilam has firm potential to break this paradigm.&lt;/p&gt;\n\n&lt;p&gt;The Amyloid hypothesis has dominated AD research which has led to over 100 failed attempts, most following the amyloid hypothesis, targeting a symptom rather than a root cause of the disease. The process for researchers to examine ADs from different &lt;a href=\"https://www.scientificamerican.com/article/alzheimers-inc-when-a-hypothesis-becomes-too-big-to-fail/\"&gt;perspectives&lt;/a&gt; has been slow and challenging but has begun. Simufilam has led the way. Simulfilam’s breakthrough method of targeting the root cause is a novel approach that sidesteps duplicating the missteps of the past. It is a disease-modifying therapy meant to treat Alzheimer’s Disease. Current therapies provide only symptomatic improvement.  Simufilam has the potential to slow cognitive decline, improving the quality of life and even perhaps extending the duration of life for millions of AD patients.&lt;/p&gt;\n\n&lt;p&gt;Simufilam additionally improves activities of daily living (ADLs) for many AD patients by reducing Behavioral Disturbances. This makes it much easier for caregivers and for families to care for their loved ones.  Family members experience extreme guilt when they can no longer care for their loved one often progressing to something known as Caregiver Stress Syndrome, characterized by extreme mental, physical &amp;amp; emotional exhaustion and strongly associated with negative health outcomes including depression and anxiety. Further downstream, Simufilam will decrease the burden on our healthcare system and its economic impact.&lt;/p&gt;\n\n&lt;p&gt;In summary, AD is a disease process that starts with one patient, affects a whole family,  and will snowball into a trillion-dollar problem for society, if unaddressed.  Simufilam’s never before seen trifecta of improved cognition, improved ADLs, and less behavioral disturbance is the overdue solution.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3) Massive Market Opportunity: The Future $Trillion AD Ecosystem&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Apple, Netflix, Tesla, and numerous other companies revolutionized their Industries with innovative technologies, creating trillions of dollars in value. Upon approval of Simufilam, Cassava will have the most successful drug in history and will enter their Prestigious ranks. &lt;a href=\"https://www.bizjournals.com/austin/news/2021/11/19/cassava-science-drug-trials-sec-investigation.htm\"&gt;Michael Engelsgjerd&lt;/a&gt;, a senior equity research analyst at Bloomberg who specializes in the biotech sector, stated, &amp;quot;If you can develop a small molecule pill for Alzheimer’s disease that can definitively improve cognition, that would very likely become the most successful product in pharmaceutical history.”&lt;/p&gt;\n\n&lt;p&gt;The market has yet to accurately price SAVA’s intrinsic value. Currently, it is pricing in 1-2% chance of success. In the following analysis, we will definitively show that the possibility of success (POS) is greater than 90%.  This presents an extraordinary opportunity for institutional and retail investors.&lt;/p&gt;\n\n&lt;p&gt;Humira’s total addressable market grosses approximately $20 billion annually while being used by 1.1 million patients worldwide (65% in the US). Meanwhile, the US Alzheimer’s market is at least 5 times larger.  It is also pertinent to mention Humira has several direct competitors (Simufilam has no competition). We estimate the AD market to expand as treatment becomes available. Most physicians hesitate to diagnose AD when treatment does not exist. In such cases, a diagnosis is a prolonged death sentence. Thus when a treatment is available, the incidence of diagnosed AD will likely increase.&lt;/p&gt;\n\n&lt;p&gt;Specifically, there are 6 million AD patients in the US and 15 million mild cognitive impairment (pre-AD) patients. Globally there are 55 million AD patients. This represents potential revenues that can surpass $100 billion annually.&lt;/p&gt;\n\n&lt;p&gt;While the market has been slow to comprehend this opportunity, it is not oblivious to it. On Monday, June 7th, $BIIB announced Accelerated Approval of its Alzheimer&amp;#39;s medication. The market cap increased by &lt;strong&gt;&lt;em&gt;$17 billion&lt;/em&gt;&lt;/strong&gt; in one day**.** Similarly the day $LLY and $RHBBY announced FDA Breakthrough Therapy Designation (BTD) of their AD medication, their market cap increased by &lt;strong&gt;&lt;em&gt;$15 billion and&lt;/em&gt;&lt;/strong&gt; &lt;strong&gt;$13 billion,&lt;/strong&gt; respectively (on the same day). All three of these medications demonstrated little to no cognitive benefit and have unsafe risk profiles resulting in brain swelling and bleeding.&lt;/p&gt;\n\n&lt;p&gt;In addition to Simufilam, Cassava Sciences has released data on SavaDx. Its importance can not be overstated. AD is a disease that starts decades before clinical symptoms present. Said more simply, AD damages the brain before patients develop memory loss. From a patient&amp;#39;s perspective, by the time memory loss develops, it&amp;#39;s already too late. This is why clinical neurologists believe preventing AD is more important than treating it. SavaDx gives us the opportunity to prevent AD. It is a simple blood test that can accurately screen AD decades before neuronal injury and death. Early diagnosis with SavaDx gives clinicians the ability to treat AD before it causes irreversible damage in the brain. We envision this patient cohort to become the largest treatable population, upwards of fifteen million, based on the rate of expansion of the AD population.&lt;/p&gt;\n\n&lt;p&gt;Once Simufilam enters the market, Cassava’s SavaDx will rapidly expand Alzheimer’s diagnosis and treatment. SavaDX is currently being evaluated alongside Simufilam in SAVA’s Phase 3 trials.  It is clear that the FDA understands the importance of early diagnosis. Quanterix was granted BTD by the FDA for its version of SavaDx in 2021.&lt;/p&gt;\n\n&lt;p&gt;Market penetration is generally slower for new medications as associated adverse events are often not fully understood by physicians. More importantly, older alternative treatments often exist. With Simufilam’s excellent safety profile and a market with no adequate or alternate treatment, we foresee Simufilam’s uptake to be relatively rapid.&lt;/p&gt;\n\n&lt;p&gt;Lastly, below we examine the plethora of medical literature supporting added indications for Simufilam. Filamin-A (FLNA), Simufilam’s target, has been implicated in multiple diseases. Yale is aggressively pursuing and has shown clinical benefit in hard-to-treat seizures. A review of medical literature has implicated FLNA in cardiovascular disease. In fact, FLNA is present throughout the body and plays a role in many disease processes including cancer, rheumatoid arthritis, strokes to name a few possibilities. The authors of this analysis believe Simufilam will balloon into a new class of medications similar to monoclonal antibodies.&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4) The Science&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;SImufilam has two primary mechanisms. 1) Decreasing neuroinflammation 2) Decreasing Tau Hyperphosphorylation.&lt;/p&gt;\n\n&lt;p&gt;FLNA is a complex scaffolding protein with many associated functions and associations. Work by Dr. Wang and Dr. Burns revealed when FLNA’s formation is altered it caused increased binding between AB42 and a cellular membrane protein complex setting off a cascade causing neuroinflammation (via TLR4 receptor), and Neurodegeneration (via the A7 receptor). Simufilam interacts with FLNA to decrease AB42 and the protein complex binding. This in turn stops Inflammation and neurodegeneration (secondary to decrease Tau hyperphosphorylation).  Both the degree of neuroinflammation and neurodegeneration can be gauged with biomarkers associated with the above cascades. These biomarkers include:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Abeta42&lt;/li&gt;\n&lt;li&gt;Total Tau&lt;/li&gt;\n&lt;li&gt;P-tau181&lt;/li&gt;\n&lt;li&gt;Neurogranin&lt;/li&gt;\n&lt;li&gt;Neurofilament Light Chain&lt;/li&gt;\n&lt;li&gt;YKL-40&lt;/li&gt;\n&lt;li&gt;Paired Associates Learning Test&lt;/li&gt;\n&lt;li&gt;Spatial Working Memory Test&lt;/li&gt;\n&lt;li&gt;IL-6&lt;/li&gt;\n&lt;li&gt;sTREM2&lt;/li&gt;\n&lt;li&gt;HMGB1&lt;/li&gt;\n&lt;li&gt;Albumin&lt;/li&gt;\n&lt;li&gt;IgG&lt;/li&gt;\n&lt;li&gt;Filamin A Linkages to alpha7 Nicotinic Acetylcholine Receptor&lt;/li&gt;\n&lt;li&gt;Toll-like Receptor 4 in Subject Lymphocytes&lt;/li&gt;\n&lt;li&gt;Plasma P-tau181&lt;/li&gt;\n&lt;li&gt;SavaDx&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;In a randomized placebo-controlled trial, all 17 biomarkers improved in patients taking Simufilam. We will discuss these spectacular results in more detail below.&lt;/p&gt;\n\n&lt;p&gt;To measure both improvement and decline in AD Patients under an experimental drug, we must perform tests on memory/IQ (cognition), activities of daily living (ADLs, ie. patient independence), psychiatric problems (behavioral issues), and stress imposed on caregivers. It helps to have “hard” measures such as blood and cerebrospinal fluid tests, as well as MRIs measuring brain shrinkage.&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Phase 2 Cognition Data Shows Incredible Improvement in AD Patients…&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Per &lt;a href=\"https://woodlandreport.com/2021/11/cassava-sciences-sava-alzheimers-drug-may-be-the-best-drug-in-history/\"&gt;Woodland Report&lt;/a&gt;:&lt;/p&gt;\n\n&lt;p&gt;“&lt;a href=\"https://journals.sagepub.com/doi/pdf/10.1177/1533317509350298\"&gt;ADAS-Cog&lt;/a&gt; is the cognitive test used for SAVA’s trial. It is considered the “gold standard” test for evaluating AD drugs and how all AD drugs are ultimately evaluated by the FDA. To date, Simufilam is the only drug that has shown improvement in ADAS-cog, in a US-based trial.&lt;/p&gt;\n\n&lt;p&gt;The ADAS-cog is essentially an IQ/memory test, not an opinion survey. Compared to other cognitive tests such as MMSE, the ADAS-Cog is more sensitive and more comprehensive, requiring 45 minutes to complete. Below we discuss why this test is so thorough making it an accurate measure in AD.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://content.iospress.com/articles/journal-of-alzheimers-disease/jad170991\"&gt;ADAS-Cog has 11 parts&lt;/a&gt; (Dimensions):&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&amp;#x200B;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Word Recall Task&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;ul&gt;\n&lt;li&gt;2. Naming Objects and Fingers&lt;/li&gt;\n&lt;li&gt;3. Following Commands&lt;/li&gt;\n&lt;li&gt;4. Constructional Praxis&lt;/li&gt;\n&lt;li&gt;5. Ideational Praxis&lt;/li&gt;\n&lt;li&gt;6. Orientation&lt;/li&gt;\n&lt;li&gt;7. Word Recognition Task&lt;/li&gt;\n&lt;li&gt;8. Remembering Test Directions&lt;/li&gt;\n&lt;li&gt;9. Spoken Language&lt;/li&gt;\n&lt;li&gt;10. Comprehension&lt;/li&gt;\n&lt;li&gt;11. Word-Finding Difficulty&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Based on 70 points, a higher score implies more errors (worse cognition). Eight of the 11 parts are objective. The other 3 require some subjective judgment to score, though there are clear guidelines in how they are scored. Let’s get into some detail.&lt;/p&gt;\n\n&lt;p&gt;Dimensions 1-4, 6-7, and 11 (i.e., seven out of eleven of all dimensions in ADAS-Cog) offer little room for random error, subjectivity, or rater bias as this assessment has a clear right or wrong answer.&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;For example, consider dimension #1, Word Recall. For this, &amp;quot;A list of 10 words is read by the subject, and then the subject is asked to verbally recall as many of the words as possible. This test is repeated three times. The number of words not recalled across the three trials is averaged giving a score of 0 to 10. The test administrator does not use his subjective judgment at all; instead, the patient either remembers each of the 10 words or not.&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;Another example, consider dimension #6, which assesses orientation. The subject is asked the date, month, year, day of the week, season, time of day, place, and person. The number of correct responses ranges from 0 to 8. The patient either correctly knows where he or she is or does not know; no subjective judgment is needed.&lt;/p&gt;\n\n&lt;p&gt;Take a look at the other dimensions that have clear right-or-wrong answers (i.e., 2, 3, 4, 7, and 11).&lt;/p&gt;\n\n&lt;p&gt;📷Across the seven dimensions, the total number of available errors a patient can show is 49 (about 70% of all errors available).&lt;/p&gt;\n\n&lt;p&gt;Dimensions #5 and #8-10 (which together constitute 30% of all errors available)? These may not have clear right-or-wrong answers, however, ADAS-Cog test administrators receive training to avoid differences in scoring due to subjectivity. For dimension #5, Ideational Praxis, &amp;quot;The subject is asked to send a letter to themselves.  The instructions are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Fold the letter&lt;/li&gt;\n&lt;li&gt;Put the letter in an envelope&lt;/li&gt;\n&lt;li&gt;Seal the envelope&lt;/li&gt;\n&lt;li&gt;Address the envelope&lt;/li&gt;\n&lt;li&gt;Put a stamp on the envelope&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Scored from 0 to 5 based on the difficulty of performing the five components. If the patient adequately finishes all letter-sending tasks mentioned, then they&amp;#39;d get a 0 (no error). Difficulty in performing the steps warrants an assignment of an error point. As the reader can see, this is straightforward to score.&lt;/p&gt;\n\n&lt;p&gt;For dimensions #8-10, the administrator has a 10-minute open-ended conversation with the patient, and at the end, the test giver rates the patient from 0-5 per quality of the patient&amp;#39;s speech based on:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;How well the patient understands what the administrator is saying&lt;/li&gt;\n&lt;li&gt;The difficulty the patient has in finding desired words&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;If the patient speaks like a typical person like you and me, they&amp;#39;d get a 0 for each of the three dimensions (#8-10). To a clinician, these distinctions are obvious and take little thought. All physicians, PAs, and Nurse Practitioners learn to assess orientation and conversational skills early in training. These are some of the earliest clues to cognitive impairment and are a required assessment on basic history and physical exam (H&amp;amp;P).&lt;/p&gt;\n\n&lt;p&gt;Further, In psychometrics, researchers often deal with such performance or ability-based questions that do not readily offer clear right or wrong response options--and instead rely on the judgment of the rater. To mitigate this familiar issue, for decades researchers have developed rater training techniques to form a consensus on what type or degree of behavior corresponds to roughly what score. Rather than each rater using their own unique/idiosyncratic standards. An additional mitigation tactic is another party observing the test and giving their own score independently which is done at the AD trial sites. In addition, many clinical sites that perform cognitive testing for Cassava Sciences are also responsible to perform cognitive testing for LLY and BIIB via ADAS. To highlight this point, recent ADAS-cog testing showed little improvement in both LLY’s and BIIB’s medication over thousands of patients assessed. These same assessors gave Cassava Sciences’ patients scores clearly indicating improved cognition.&lt;/p&gt;\n\n&lt;p&gt;As these clinical test sites specialize in research trials in AD drugs (also performing studies for SAVA’s competitors, it’s what they professionally do), they would have a close familiarity with the ADAS-Cog. By definition, these physicians’ test-judging styles would form the gold standard. Notably, SAVA does not have involvement with how the sites are run; SAVA requests that the sites use ADAS-Cog per cognitive measurement and then the sites take it from there.&lt;/p&gt;\n\n&lt;p&gt;In (Ihl et al., 2012) the authors describe &amp;quot;the collection of ADAS-Cog-11 [dimensions] with the most potential for detecting a treatment response.&amp;quot; These dimensions were:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Ideational Praxis&lt;/li&gt;\n&lt;li&gt;Remembering Test Instructions&lt;/li&gt;\n&lt;li&gt;Language&lt;/li&gt;\n&lt;li&gt;Comprehension of Spoken Language&lt;/li&gt;\n&lt;li&gt;Word Finding Difficulty&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Dimensions #5 and 8-10 (which constitute 30% of total errors) are all included in this subset. Based on actual empirical evidence, dimensions #5 and 8-10 are *in practice* largely objective and valid. Concerns of subjectivity are hypothetical, which has not been observed over decades of ADAS-cog administration.&lt;/p&gt;\n\n&lt;p&gt;As it turns out, the more subjective portions of the ADAS-Cog &lt;a href=\"https://www.page-meeting.org/pdf_assets/2921-ADAScog_IRT_Sebastian_Ueckert.pdf\"&gt;have very little relative contribution&lt;/a&gt; amongst patients.&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;Instead, it is tests 1, 6, and 7 that have the greatest impact. These are right-or-wrong Word Recall and Orientation questions, which all test short term memory. This makes sense given AD is a disease of short term memory. Placebo effect is unlikely to make a person suddenly remember the day or location, or recall a list of words.&lt;/p&gt;\n\n&lt;p&gt;Of note, Phase 3 will use ADAS-Cog12 which adds a Delayed Recall section. This makes it more sensitive for mild cognitive impairment. Simufilam will target this larger group of people (15 million patients in the US).&lt;/p&gt;\n\n&lt;p&gt;Skeptics can argue that due to the open-label nature of the Phase 2b trial, physicians can still score certain sections favorably for SAVA. However, the math definitely suggests this is extremely unlikely to make up for the large 8.2-9.2 point difference between the 12-month data and placebo. In addition, open-label trials of other AD drugs using the ADAS-Cog do not show these same results (discussed in the section below). Unlike with Simufilam, those patients all declined from 6 months onward in both open-label and placebo-controlled trials. We will discuss a cohort of over 40,000 patients to make this clear, below. Essentially, AD is like Rabies or cancer.  Either it is treated, or it overwhelmingly leads to death. Thus if we see AD patients improving over 12 months, it is assuredly treatment effect, not placebo.”&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;5) Why the data is so unique in both Biomarkers and Cognitive Data.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;h2&gt;Biomarker Data Predicts Efficacy Simufilam&lt;/h2&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;Simufilam’s biomarker results were groundbreaking. Previous AD medication directly targeted a single focus downstream and corresponding biomarkers showed limited benefit.   Several surrogate markers like increased inflammation and cerebral atrophy (brain shrinking) that were reported by Simufilam’s competitors foreshadow negative clinical outcomes long term.  Comparatively, Simufilam works upstream and the effect can be analyzed by 17 biomarkers monitoring neuroinflammation and neurodegeneration. The totality of all 17 biomarkers makes for a much more convincing case than the few reported by competitors. To be clear, all 17 biomarkers checked by Cassava Sciences improved in a 28-day randomized controlled trial. The two most important biomarkers include Aβ42/40 ratio and ptau181 which directly correlate with Alzheimer’s disease progression.&lt;/p&gt;\n\n&lt;p&gt;The utility of biomarkers in AD is to predict cognitive improvement before it happens as cognitive improvement can take many months. After reviewing the spectacular biomarker data in the 28-day trial, we anticipated cognitive data improvement would follow. The Biomarkers predicted correctly, as expected:&lt;/p&gt;\n\n&lt;h2&gt;📷&lt;/h2&gt;\n\n&lt;p&gt;The above ADAS-cog scores are what make Cassava Sciences a generational opportunity. Along with the biomarker data, these ADAS-cog score improvements have never been achieved in any US-based trial over 12 months. The Chart below shows Simufilam’s data (Red Line) compared to what is expected due to the natural course of the disease. This is represented by the Placebo group (Grey Line) and  Eli Lilly’s Donanemab (Green Line) trial. Simufilam Cohort results are vastly superior to both the Placebo and Donanemab Cohorts. Though BIIBs and RHHBYs medication has not been included on the below graph, the difference between Simufilam and those medications is just as significant.&lt;/p&gt;\n\n&lt;p&gt;The first 50 patients in the Phase 2b trials take place at 7 clinical sites (currently expanded to 200 patients and 16 sites). The table below shows patient selection. These are mild and moderate AD patients with an average age of approximately 70.&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;Biomarkers were followed on 25 of the 50 initial patients and continued to impress:&lt;/p&gt;\n\n&lt;p&gt;📷&lt;/p&gt;\n\n&lt;p&gt;Again, the biomarker data foreshadowed continued cognitive improvement correctly.  The mechanism of action (MOA) of Biogen’s Aduhelm (and many other Alzheimer’s drugs) seeks to directly target amyloid-beta to reduce the number of plaques, while Simufilam’s MOA  is further upstream and more comprehensive. It works by decreasing tau hyperphosphorylation and plaque build-up and decreasing inflammation.  By targeting a deeper, more fundamental cause, Simufilam serves as a more powerful means to not just clear the plaques, but also prevent formation. Biogen’s Aduhelm decreased pTau-181 levels by 13-16% at 12 months, Simufilam decreased it by 18% in half the time.  &lt;/p&gt;\n\n&lt;p&gt;Please follow this google doc link to finish reading the DD.  &lt;a href=\"https://docs.google.com/document/d/19kRhD-f1R7XoASPyoLPcmUEQ_LeAryG1DZOwhxapXAE/edit?usp=sharing\"&gt;https://docs.google.com/document/d/19kRhD-f1R7XoASPyoLPcmUEQ_LeAryG1DZOwhxapXAE/edit?usp=sharing&lt;/a&gt;,  &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#365b8c",
  "id": "spfed0",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Internal_Ad_1091",
  "discussion_type": null,
  "num_comments": 617,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/spfed0/largest_bet_in_wsb_history_sava_3012196439/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/spfed0/largest_bet_in_wsb_history_sava_3012196439/",
  "subreddit_subscribers": 11597091,
  "created_utc": 1644532985,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1644522872,
  "the_new_excerpt": "All opinions expressed in this post are our own. The statements do not\nconstitute financial or medical advice, and please do your own DD. This post\nwill be updated every three months with position performance information and\nupdated due diligence. Please follow!\n\nThis post shall remain exclusive to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事で述べられているすべての意見は、私たち自身のものです。その発言は\n金融や医療に関するアドバイスになりますので、ご自身でDDをお願いします。この記事\n3ヶ月に一度、ポジションのパフォーマンス情報を更新します。\nデューデリジェンスを更新しました。フォローお願いします。\n\nこの投稿は独占されるものとします...",
      "title": "WSB史上最大の賭け！？サバ ($30,121,964.39)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "本帖所表达的所有意见都是我们自己的。这些声明并不\n构成财务或医疗建议，请自己做DD。这个帖子\n将每三个月更新一次，包括仓位表现信息和\n更新尽职调查。请关注!\n\n本帖应保持独家...",
      "title": "WSB历史上最大的赌注! $sava (30,121,964.39)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本帖所表達的所有意見都是我們自己的。這些聲明並不\n構成財務或醫療建議，請自己做DD。這個帖子\n將每三個月更新一次，包括倉位表現信息和\n更新盡職調查。請關注!\n\n本帖應保持獨家...",
      "title": "WSB歷史上最大的賭注! $sava (30,121,964.39)"
    }
  ]
}