{
  "author": "hazelvelvet",
  "the_new_excerpt": "A few days ago, I made a post titled \"Rugpulls and Honeypots. What they are and\nhow you can avoid them.\" Since then I got a lot of messages from people asking\nme how they can tell the difference between a new coin with lots of potential\nand a shitcoin. For maximum protection, make sure you follow…",
  "original_created_utc": 1620671364,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数日前、私は「Rugpulls and Honeypots」というタイトルの記事を作りました。それらは何か、そして\nどうすれば避けられるのか」という記事を書きました。それ以来、多くの方からメッセージをいただきました。\n可能性を秘めた新しいコインとクソコインの違いをどうやって見分けたらいいのか？\nクソコインを見分けるにはどうしたらいいのか、という質問が多く寄せられました。最大限の防御をするために、あなたが従うべきことは...",
      "title": "すべての新しいコインがシットコインというわけではない：シットコインの海の中で本物のGEMSを見極める方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几天前，我发表了一篇题为 \"Rugpulls 和 Honeypots. 它们是什么以及\n你如何避免它们\"。从那时起，我收到了很多人的留言，问我\n问我如何区分一个具有巨大潜力的新币\n和垃圾币。为了获得最大的保护，请确保你遵循...",
      "title": "不是每个新币都是垃圾币：如何在垃圾币的海洋中发现真正的GEMS。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天前，我發表了一篇題爲 \"Rugpulls 和 Honeypots. 它們是什麼以及\n你如何避免它們\"。從那時起，我收到了很多人的留言，問我\n問我如何區分一個具有巨大潛力的新幣\n和垃圾幣。爲了獲得最大的保護，請確保你遵循...",
      "title": "不是每個新幣都是垃圾幣：如何在垃圾幣的海洋中發現真正的GEMS。"
    }
  ],
  "title": "Not every new coin is a shitcoin: How to spot the real GEMS inside the sea of shitcoins.",
  "created_utc": 1620678727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few days ago, I made a post titled <em>&quot;Rugpulls and Honeypots. What they are and how you can avoid them.&quot;</em> Since then I got a lot of messages from people asking me how they can tell the difference between a new coin with lots of potential and a shitcoin. For maximum protection, make sure you follow this guide in combination with the other guide. I will not repeat those rules here. If you don&#39;t follow the rules of the other guide as well, you will lose your money.</p>\n\n<p>Before I start, some background: I trade small coins for a living. In the beginning, while learning, I fell for all the scams just like everyone else. But with every loss I learned something new and I&#39;m now pretty good at it. Yes, I have losses like everyone else, but usually I get out with very small losses compared to my gains.</p>\n\n<p>Anyone here hating shitcoins, I agree with you. <strong>I hate shitcoins too.</strong> Part of what I want to explain here however is that not every new coin is a shitcoin. Every coin has to start with 0 holders. Everyone has to start somewhere. And every solid project deserves a chance to grow. Yes, the vast majority of new coins are shitcoins, but I want to help you tell the difference between the real gems and all the shitcoins.</p>\n\n<h1>The Golden Rules</h1>\n\n<p>If you start looking for the real gems and want to trade smaller coins, <strong>follow these rules or you will lose money</strong>. </p>\n\n<ol>\n<li>Start trading on the BSC (Binance) Smart Chain. Why? Transactions cost around $0.20 max. You can&#39;t do this on the ETH chain where you spend lots on gas fees, sorry. I know they came down, but they&#39;re still too high.</li>\n<li>For the first 1-2 months, don&#39;t invest more than $5 per coin. I am not joking. Yes, your gains will not be thousands of dollars, but if you go in with more you will end up losing a lot of money, trust me.</li>\n<li>Have a small bag of maybe $150 or $200. Be prepared to lose your small bag completely. If you can&#39;t afford this and sleep well at night, don&#39;t do it.</li>\n</ol>\n\n<p><strong>Ready? Let&#39;s start:</strong></p>\n\n<h1>Find the Coins</h1>\n\n<p>Go to the BscScan website (look up the links yourself, I don&#39;t want to link-spam this post). Then, go to &quot;View BEP-20 Transfers&quot;. If the list looks confusing, don&#39;t worry. Look at the rightmost column that says &quot;Tokens&quot;. You must look for the grey icon besides the coin names. Why? Because that means the coin is new. Established coins already have their icons listed and that means you&#39;re usually too late to make high gains. You can refresh that page for new coins every second, you will always find new ones.</p>\n\n<p>Open the new coins (with the grey icon) in separate tabs and look at them. So, now you have found a coin, it&#39;s time to investigate.</p>\n\n<h1>1. Holders</h1>\n\n<p>On the page you just opened, look at the &quot;Holders&quot; list. The biggest holders of a coin should always be the liquidity pool which is usually identified as &quot;PancakeSwap: COIN NAME&quot; and the dead coins wallet, usually identified as &quot;0x000000000000000000000000000000000000dead&quot;. Why is this important? It reduces the possibility of a rugpull to almost zero, especially if the dead coins wallet is over 50%.</p>\n\n<p>Also watch out if there are too many whales. For example, 10 wallets each holding 3% of total coins is a huge red flag. Abort immediately. A healthy new coin should also have at least 200-300 holders. If it doesn&#39;t, also abort immediately.</p>\n\n<h1>2. Liquidity Pool</h1>\n\n<p>The liquidity pool is super important. I usually don&#39;t buy any new coin unless the liquidity pool is at least $30k or more. Why? Because scammers and shitcoins rarely provide a liquidity pool of that size. Again, we&#39;re greatly reducing our risks here. A locked liquidity pool is also important. Make sure it&#39;s locked for a longer period of time. 3 months, 6 months, 1 year or longer are great. You don&#39;t want the liquidity pool to unlock tomorrow. You can copy the contract ID and then go to &quot;PooCoin&quot; (again, look up the links yourself), then enter the contract URL there, hit enter and on the next page on the left side it will show you something like &quot;COIN/BNB LP BNB Holdings:&quot;. That&#39;s where you want at least $30k or more. If it has a few hundred dollars or even only $5k or $7k, abort immediately.</p>\n\n<h1>3. Volume</h1>\n\n<p>Look at the &quot;Transfers&quot; section. If the coin has only 5 holders and no activity, skip it. If you want, bookmark it and come back to check tomorrow. You may have just been too early. If it has only a few transactions every 2-3 hours, also abort immediately. It&#39;s not taking off yet. A good number of transactions for a new coin should be about 5-10 per minute.</p>\n\n<h1>4. Website &amp; Twitter</h1>\n\n<p>Make sure the coin has a website and twitter account. If it doesn&#39;t have both of them, abort immediately. If it also has a reddit page, a Telegram channel, a Discord, an Instagram page, a YouTube channel, etc. that&#39;s even better.</p>\n\n<h1>5. Coin Name &amp; Design</h1>\n\n<p>The logo of the coin and the design of the graphics and website are very important. If it&#39;s not attractive, people will not jump in and it won&#39;t take off. If the use stock images that you&#39;ve seen a hundred times elsewhere, abort immediately. The name is also super important. If it has a catchy name like &quot;Save The World&quot; it&#39;s much more likely to take off than &quot;Funky Toilet Coin 55&quot;.</p>\n\n<h1>6. Bonus: Doxxed Team</h1>\n\n<p>This one is a HUGE bonus. If the team members publicly identify themselves, for example through YouTube videos or live AMA, it reduces the chance of a scam to almost zero. Why? Because their faces and identities are publicly known and they would almost certainly end up in prison.</p>\n\n<h1>That&#39;s it!</h1>\n\n<p>Did the coin you investigated fail in any of the first 5 steps? I cannot stress this enough, but: ABORT IMMEDIATELY. Don&#39;t invest in it. You will end up losing your money.</p>\n\n<p>Did the coin pass all of the above steps? Great! You <strong><em>might</em></strong> have found a gem. Do some more research before you jump in and make sure the coin has a real purpose. Remember, things like hodling to get more coins or &quot;to the moon!&quot; are not real purposes.</p>\n\n<p>And now we go back to the golden rules. If you are ready to invest in this coin, <strong>remember to only invest $5 for the first 1-2 months</strong> of doing this. I cannot stress this enough. You are learning and you will make mistakes. Make sure you are okay with losing that money because even if a coin matches all of the above, it can still fail for a variety of reasons. If you stick to this rule, you can still make a good amount of money in these 1-2 months. I easily made $10 to $50 with just $5. Sometimes I got out at $3.50 because a coin didn&#39;t take off and re-invested elsewhere.</p>\n\n<p>Once you&#39;ve done the above for 1-2 months and you&#39;ve noticed any potential mistakes you made, you should be ready to start trading with $10 or $20 per coin (depending on your financial situation).</p>\n\n<p>Two more important things to remember:</p>\n\n<ol>\n<li>Early coins take time to take off. It&#39;s very possible that your $5 investment will drop to $3 or $2 in that time and go up to $10 and then go back down to $4. It may just sit there doing nothing for 5-14 days. That&#39;s absolutely normal.</li>\n<li>Keep track of what the team is doing during this time. If there are no updates for 2-3 days, sell and get out. A good team should update its holders several times per day through several channels (Twitter, Discord, Telegram, etc). It&#39;s okay to get only 1 update per day, but less than that is a red flag.</li>\n</ol>\n\n<p>I <strong>always</strong> follow the above rules when trading with small coins and I currently have success with 90-95% of coins that I invest in. Trust me, <strong>I tried to skip some of the rules above and I got burned every time</strong>. Yes, it&#39;s a lot of work. Especially if you have to repeat these steps for every single coin you want to investigate, but you will get much faster at it over time. If you end up doing this for a living, you will probably be able to investigate 2-3 coins per minute.</p>\n\n<p>Now, if you excuse me, I need a coffee and relax my fingers a bit. They hurt :P</p>\n</div><!-- SC_ON -->",
  "score": 18569,
  "permalink": "/r/CryptoCurrency/comments/n9cby0/not_every_new_coin_is_a_shitcoin_how_to_spot_the/",
  "subreddit": "CryptoCurrency",
  "id": "n9cby0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992423
}