{
  "author": "Zovlo",
  "the_new_excerpt": "It just feels like religion is more of a cultural thing, like something you’re\nraised in. I remember being in middle school/high school and asking my friends\nabout religion (not in a mean way, just because I was curious about it) and they\nreally couldn’t tell me much, they even said they don’t…",
  "original_created_utc": 1621478760,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "宗教はもっと文化的なもので、自分が育てられたようなものだと感じています。\n育てられたもののように感じます。中学生や高校生の頃、友達に宗教について聞いたことがあります。\n中学・高校の頃、友達に宗教のことを聞いたことがあります（意地悪ではなく、ただ興味があったので）。\n中学・高校の頃、友達に宗教について聞いたことがあります。",
      "title": "ほとんどの宗教的な人々（少なくとも米国では）は、通常、宗教的に育てられたから宗教的になっただけで、自分の信念にあまり真剣に考えていないと考えるのが妥当でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是感觉宗教更像是一种文化的东西，就像你在其中长大的东西。\n培养出来的。我记得在初中/高中的时候，我问过我的朋友\n关于宗教的问题（不是刻意的，只是因为我对它很好奇），他们\n他们真的不能告诉我很多，他们甚至说他们不...",
      "title": "假设大多数宗教人士（至少在美国）通常只是因为他们被养成了宗教信仰而没有对他们的信仰进行过多的认真思考，这是否公平？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是感覺宗教更像是一種文化的東西，就像你在其中長大的東西。\n培養出來的。我記得在初中/高中的時候，我問過我的朋友\n關於宗教的問題（不是刻意的，只是因爲我對它很好奇），他們\n他們真的不能告訴我很多，他們甚至說他們不...",
      "title": "假設大多數宗教人士（至少在美國）通常只是因爲他們被養成了宗教信仰而沒有對他們的信仰進行過多的認真思考，這是否公平？"
    }
  ],
  "title": "Is it fair to assume most religious people (in the U.S. at least) are usually only religious because they were raised into it and don’t put too much serious thought into their beliefs?",
  "created_utc": 1621487561,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It just feels like religion is more of a cultural thing, like something you’re raised in. I remember being in middle school/high school and asking my friends about religion (not in a mean way, just because I was curious about it) and they really couldn’t tell me much, they even said they don’t really know why they’re what religion they are, just that they are.</p>\n\n<p>I feel like you can’t seriously believe in the Abrahamic religions in the year 2021 without some reservation. I feel like the most common kinds of people that are religious are either </p>\n\n<p><strong>A) depressed or mentally hindered individuals who need the comfort of religion to function and feel good in their life (people that have been through trauma or what have you)</strong></p>\n\n<p><strong>B) people who were raised into it from a young age and don’t really know any better (probably the most common)</strong></p>\n\n<p><strong>C) people who fear death and the concept of not existing forever, (similar to A. people but these people aren’t necessarily depressed or sad or anything.)</strong></p>\n\n<p>Often all three can overlap in one person.</p>\n\n<p>It’s just.. I’m sorry if this sounds disrespectful but I can’t see how anyone could seriously believe in Christianity, Islam, Mormonism, etc. in the current time period outside of being one of the people mentioned above. There are just way too many problems and contradictions. To the people that do believe, I feel like they really don’t take the time to sit down and question things, I feel like they either ignore the weak parts of their religion, or use mental gymnastics to get around them. I just want to know if I’m pretty much right in this belief of mine or if I’m just an asshole who doesn’t know what I’m talking about.</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/TooAfraidToAsk/comments/ngoo0b/is_it_fair_to_assume_most_religious_people_in_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "ngoo0b",
  "is_self": true,
  "media": null,
  "is_video": false
}