{
  "author": "Paracortex",
  "original_created_utc": 1636155830,
  "title": "The real question is not “What are people who take long showers doing,” but, “What are you who take short showers NOT doing?”",
  "created_utc": 1636198776,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can take a five-minute shower if I skip a whole lot of steps. I can take a ten-minute shower if I skip fewer, but a still significant number of steps. If I skip shaving alone I save five minutes. But a full, complete, head to toe cleaning requires about 30 minutes. I can do 25 if I skip cleaning under my fingernails.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/qnnrni/the_real_question_is_not_what_are_people_who_take/",
  "subreddit": "TooAfraidToAsk",
  "id": "qnnrni",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can take a five-minute shower if I skip a whole lot of steps. I can take a\nten-minute shower if I skip fewer, but a still significant number of steps. If I\nskip shaving alone I save five minutes. But a full, complete, head to toe\ncleaning requires about 30 minutes. I can do 25 if I skip cleaning…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5分間のシャワーを浴びるためには、一通りの手順を省略すればいい。私は10分シャワーを浴びることができます。\n10分シャワーを浴びるには、もっと少ないステップ数でも、かなりのステップ数を飛ばします。もし私が\n髭剃りだけでも5分は短縮できます。しかし、頭のてっぺんからつま先まで完全に掃除するには\n掃除には約30分かかります。掃除を省けば25分で済むのに...。",
      "title": "本当の質問は、\"長いシャワーを浴びる人は何をしているのか \"ではなく、\"短いシャワーを浴びる人は何をしていないのか \"ということです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我跳过一大堆步骤，我可以洗5分钟的澡。如果我跳过的步数较少，但仍有相当多的步数，我可以洗一个\n如果我跳过的步数较少，但仍有相当多的步数，我可以洗十分钟的澡。如果我\n仅仅跳过刮胡子，我就能节省五分钟。但是一个完整的、从头到脚的\n需要大约30分钟。如果我跳过清洁，我可以做到25分钟...",
      "title": "真正的问题不是 \"洗长澡的人在做什么\"，而是 \"洗短澡的人没有做什么\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我跳過一大堆步驟，我可以洗5分鐘的澡。如果我跳過的步數較少，但仍有相當多的步數，我可以洗一個\n如果我跳過的步數較少，但仍有相當多的步數，我可以洗十分鐘的澡。如果我\n僅僅跳過刮鬍子，我就能節省五分鐘。但是一個完整的、從頭到腳的\n需要大約30分鐘。如果我跳過清潔，我可以做到25分鐘...",
      "title": "真正的問題不是 \"洗長澡的人在做什麼\"，而是 \"洗短澡的人沒有做什麼\"。"
    }
  ]
}