{
  "author": "EndlessShovel11",
  "original_created_utc": 1631682491,
  "title": "What emerging coins of this bull run are going to be useless garbage in a few years?",
  "created_utc": 1631702519,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I jumped on the crypto train in 2017 after reading a post about someone becoming an overnight millionaire with Antshares/Neo. I knew what Bitcoin and Ethereum was, but after reading that post I spent the better part of a week researching crypto. Naturally, I thought I was an instant professional trader. Because I was new to crypto I bit on some dumb projects. Ones that I went down the wrong Twitter/Biz rabbit holes to find. I purchased Oyster Pearl not too far before the CEO rug pulled, I purchased Bitcoin Private because I was certain that a fork of a fork with the Bitcoin name would essentially be money in the bank in the private/anonymous crypto space. I purchased OmiseGo(yes I know this one is still trading somewhat upwards) because of some tenuous relationship they had with a southeast Asian branch of McD’s. I purchased Request Network because I felt like blockchain invoicing might be important someday(this one might come back around for me). Luckily, I kept some of the important stuff that held me through the dark times; ETH, LINK, small amounts of BTC. Looking back on the years, I can clearly see the projects that I invested in that were surely dogshit from the start. I have a keener eye, but that doesn’t mean we won’t buy in on something that we don’t realize yet is smoke and mirrors. Besides the obvious memecoin garbage, what does everyone think will be this bull runs useless garbage in a few years. Just lay it out there and hurt everyones feelings!</p>\n\n<p>Edit: I’m surprised with the QUICK turn on SOL. But I did watch them blow up their investors faith, so I guess not all that surprising.</p>\n</div><!-- SC_ON -->",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/pojlf7/what_emerging_coins_of_this_bull_run_are_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "pojlf7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I jumped on the crypto train in 2017 after reading a post about someone becoming\nan overnight millionaire with Antshares/Neo. I knew what Bitcoin and Ethereum\nwas, but after reading that post I spent the better part of a week researching\ncrypto. Naturally, I thought I was an instant professional…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2017年に、ある人が一夜にして億万長者になったという記事を読んで、暗号化列車に飛び乗りました。\nAntshares/Neoで一夜にして億万長者になった人の記事を読んでからです。ビットコインとイーサリアムのことは知っていました。\nは知っていましたが、その投稿を読んだ後、1週間の大半を費やして\n暗号について調べました。当然、自分は即戦力のプロだと思っていましたが...。",
      "title": "数年後には使い物にならないゴミになってしまう、このブルランのエマージングコインとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2017年跳上了加密货币列车，因为我读到了一篇关于有人通过Antshares/Neo成为一夜暴富的帖子。\n一篇关于有人通过Antshares/Neo一夜之间成为百万富翁的文章后，我在2017年跳上了加密货币列车。我知道什么是比特币和以太坊。\n但读完那篇文章后，我花了一个星期的时间来研究\n币。自然地，我认为我是一个即时的专业人员...",
      "title": "这轮牛市中的哪些新兴钱币在几年后将成为无用的垃圾？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2017年跳上了加密貨幣列車，因爲我讀到了一篇關於有人通過Antshares/Neo成爲一夜暴富的帖子。\n一篇關於有人通過Antshares/Neo一夜之間成爲百萬富翁的文章後，我在2017年跳上了加密貨幣列車。我知道什麼是比特幣和以太坊。\n但讀完那篇文章後，我花了一個星期的時間來研究\n幣。自然地，我認爲我是一個即時的專業人員...",
      "title": "這輪牛市中的哪些新興錢幣在幾年後將成爲無用的垃圾？"
    }
  ]
}