{
  "author": "CoolCoolPapaOldSkool",
  "original_created_utc": 1637931998,
  "title": "I saved money for dips like this; what are you buying during the current crypto sale?",
  "created_utc": 1637944719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I  saved money for dips like this; what are you buying during the current crypto sale?</p>\n\n<p>I know some of you are sceptical about the current market dip and some of you are hopeful.  And there is nothing new with the present market scenario; most of us have already seen this happen quite a few times over the last few months</p>\n\n<p>Everyone who wanted some cheap coins has finally gotten the opportunity to grab them cheap.</p>\n\n<p>I always keep some spare cash for market dips, and now I am just curious to know what coins you are buying?</p>\n\n<p>I hodl some BTC, ETH, ADA, MATIC and some low cap coins. Which coins are presently cheap, and should I have some for my portfolio with good future potential?</p>\n</div><!-- SC_ON -->",
  "score": 238,
  "permalink": "/r/CryptoCurrency/comments/r2n0pl/i_saved_money_for_dips_like_this_what_are_you/",
  "subreddit": "CryptoCurrency",
  "id": "r2n0pl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I saved money for dips like this; what are you buying during the current crypto\nsale?\n\nI know some of you are sceptical about the current market dip and some of you\nare hopeful. And there is nothing new with the present market scenario; most of\nus have already seen this happen quite a few times over…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこのようなディップに備えてお金を貯めていましたが、現在のクリプト・セールでは何を買いますか？\nのセールで何を買いますか？\n\n現在の市場の落ち込みに懐疑的な人もいれば、期待している人もいると思います。\n希望を持っている人もいると思います。現在の市場のシナリオに目新しいものはありません。\nそして、現在の市場のシナリオは何も新しいものではなく、私たちのほとんどが、これまでに何度も経験してきたことです。",
      "title": "私はこのようなディップに備えてお金を貯めていました。現在のcryptoセールでは何を買いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我为这样的下跌而存钱；你在目前的加密货币销售中买了什么？\n销售中买什么？\n\n我知道你们中有些人对目前的市场下跌持怀疑态度，有些人则\n是有希望的。目前的市场情况并不新鲜；我们中的大多数人已经看到了这种情况。\n我们已经看到这种情况发生过很多次了...",
      "title": "我为这样的跌势存钱；在目前的加密货币销售期间，你买了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我爲這樣的下跌而存錢；你在目前的加密貨幣銷售中買了什麼？\n銷售中買什麼？\n\n我知道你們中有些人對目前的市場下跌持懷疑態度，有些人則\n是有希望的。目前的市場情況並不新鮮；我們中的大多數人已經看到了這種情況。\n我們已經看到這種情況發生過很多次了...",
      "title": "我爲這樣的跌勢存錢；在目前的加密貨幣銷售期間，你買了什麼？"
    }
  ]
}