{
  "author": "MetalBladeX",
  "original_created_utc": 1644533698,
  "title": "Is it me or is it difficult to not look at women in gyms when they are wearing what they wear?",
  "created_utc": 1644569203,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: some of y&amp;#39;all are just mean. \nI asked this on this subreddit for s reason. \nI get that this is a very controversial, but you don&amp;#39;t gotta straight up light me up for asking a question. The world is just getting more lewd, I&amp;#39;m not trying to be a creep. I do not support any creeps. I don&amp;#39;t care what someone wears, but sometimes it&amp;#39;s just absurd.&lt;/p&gt;\n\n&lt;p&gt;Also English is my second language, stare was a poor word choice on my part, I mean glance.&lt;/p&gt;\n\n&lt;p&gt;Edit 2: I&amp;#39;m not trying to offend anyone, I&amp;#39;m sure some people also question this at some points. And it also goes both ways.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/spj11o/is_it_me_or_is_it_difficult_to_not_look_at_women/",
  "subreddit": "TooAfraidToAsk",
  "id": "spj11o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Edit: some of y'all are just mean. I asked this on this subreddit for s reason.\nI get that this is a very controversial, but you don't gotta straight up light\nme up for asking a question. The world is just getting more lewd, I'm not trying\nto be a creep. I do not support any creeps. I don't care…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：意地悪な人もいるんですね。このサブレディットで質問したのは、ある理由からです。\nこの件が非常に議論を呼ぶことは承知していますが、ストレートにライトアップする必要はありません。\nという質問に対して 世の中がより淫らになってきているのです。\nキモいから。私はキモオタを支持しない。気にしない...",
      "title": "ジムで女性が着ているものを見ないようにするのは難しいのは、私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：你们中的一些人实在是太刻薄了。我在这个subreddit上问这个问题是有原因的。\n我知道这是一个非常有争议的问题，但你不应该因为我问了一个问题就直接把我打倒。\n我问了一个问题。这个世界正变得越来越淫荡，我并不是要\n猥琐。我不支持任何猥琐者。我不关心...",
      "title": "是我的问题，还是很难不看健身房里的女人，当她们穿着她们的衣服时？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：你們中的一些人實在是太刻薄了。我在這個subreddit上問這個問題是有原因的。\n我知道這是一個非常有爭議的問題，但你不應該因爲我問了一個問題就直接把我打倒。\n我問了一個問題。這個世界正變得越來越淫蕩，我並不是要\n猥瑣。我不支持任何猥瑣者。我不關心...",
      "title": "是我的問題，還是很難不看健身房裏的女人，當她們穿着她們的衣服時？"
    }
  ]
}