{
  "author": "azneb",
  "original_created_utc": 1628010100,
  "title": "How to understand that Godel's Incompleteness theorems and his Completeness theorem don't contradict each other?",
  "created_utc": 1628077040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a layman, it seems that his Incompleteness theorems and completeness theorem seem to contradict each other, but it turns out they are both true.</p>\n\n<p>The completeness theorem seems to say &quot;anything true is provable.&quot; But the Incompleteness theorems seem to show that there are &quot;limits to provability in formal axiomatic theories.&quot; </p>\n\n<p>I feel like I&#39;m misinterpreting what these theorems say, and it turns out they don&#39;t contradict each other. Can someone help me understand why?</p>\n</div><!-- SC_ON -->",
  "score": 1891,
  "permalink": "/r/askscience/comments/ox7rvp/how_to_understand_that_godels_incompleteness/",
  "subreddit": "askscience",
  "id": "ox7rvp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a layman, it seems that his Incompleteness theorems and completeness theorem\nseem to contradict each other, but it turns out they are both true.\n\nThe completeness theorem seems to say \"anything true is provable.\" But the\nIncompleteness theorems seem to show that there are \"limits to provability…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "素人目には、彼の不完全性定理と完全性定理が矛盾しているように見えます。\n矛盾しているように見えますが、どちらも真であることがわかります。\n\n完全性定理は、\"真のものは何でも証明できる \"と言っているように見えます。しかし、その\n不完全性定理は、「証明可能性には限界がある」ということを示しているように思えますが......。",
      "title": "ゲーデルの不完全性定理と完全性定理が矛盾していないことを理解するには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个门外汉，他的不完备性定理和完备性定理似乎\n似乎相互矛盾，但事实证明它们都是真的。\n\n完备性定理似乎是说 \"任何真实的东西都是可以证明的\"。但\n不完备性定理似乎表明，有 \"可证明性的限制......",
      "title": "如何理解戈德尔的不完全性定理和他的完全性定理并不互相矛盾？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個門外漢，他的不完備性定理和完備性定理似乎\n似乎相互矛盾，但事實證明它們都是真的。\n\n完備性定理似乎是說 \"任何真實的東西都是可以證明的\"。但\n不完備性定理似乎表明，有 \"可證明性的限制......",
      "title": "如何理解戈德爾的不完全性定理和他的完全性定理並不互相矛盾？"
    }
  ]
}