{
  "author": "Inkshooter",
  "original_created_utc": 1629868269,
  "title": "Philosophy of Mind question: When we describe the relative \"intelligence\" of other animals, are we really just quantifying how human-like they are?",
  "created_utc": 1629920808,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is well-known that dolphins, chimpanzees, crows, and octopuses, to name a few, are capable of advanced reasoning and problem-solving that eludes most other animals. These kinds of behaviors are what have allowed humans to become as successful as we are. But when discussing feats that humans cannot reproduce on our own, like the complex hive behavior of bees or the navigational abilities of birds, these do not seem to usually seen as feats of mental ability, they are often conceived as &quot;adaptations&quot; or &quot;instincts&quot;. Is there a disconnect here?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askphilosophy/comments/pb4jo6/philosophy_of_mind_question_when_we_describe_the/",
  "subreddit": "askphilosophy",
  "id": "pb4jo6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It is well-known that dolphins, chimpanzees, crows, and octopuses, to name a\nfew, are capable of advanced reasoning and problem-solving that eludes most\nother animals. These kinds of behaviors are what have allowed humans to become\nas successful as we are. But when discussing feats that humans…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イルカ、チンパンジー、カラス、タコなどの動物には、これまでにない高度な推論や問題解決能力があることはよく知られています。\nイルカ、チンパンジー、カラス、タコなどは、他の動物にはない高度な推論や問題解決能力を持っています。\nイルカ、チンパンジー、カラス、タコなどは、他の動物にはない高度な推論や問題解決能力を持っていることはよく知られている。このような行動があるからこそ、人間はここまで成功したのです。\n人間はこのように成功してきました。しかし、人間の偉業を語るとき、...",
      "title": "心の哲学の質問 他の動物の相対的な「知性」を表現するとき、私たちは本当にその動物がどれだけ人間に近いかを数値化しているだけなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "众所周知，海豚、黑猩猩、乌鸦和章鱼等等。\n众所周知，海豚、黑猩猩、乌鸦和章鱼等等，都具有先进的推理和解决问题的能力，而这些能力是大多数其他动物所无法企及的。\n其他动物所不具备的。这些类型的行为使人类能够成为\n我们如此成功。但是，当讨论到人类的功绩时，我们就会发现，人类的功绩并不是那么简单。",
      "title": "心灵哲学问题。当我们描述其他动物的相对 \"智力 \"时，我们是否真的只是在量化它们有多像人类？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "衆所周知，海豚、黑猩猩、烏鴉和章魚等等。\n衆所周知，海豚、黑猩猩、烏鴉和章魚等等，都具有先進的推理和解決問題的能力，而這些能力是大多數其他動物所無法企及的。\n其他動物所不具備的。這些類型的行爲使人類能夠成爲\n我們如此成功。但是，當討論到人類的功績時，我們就會發現，人類的功績並不是那麼簡單。",
      "title": "心靈哲學問題。當我們描述其他動物的相對 \"智力 \"時，我們是否真的只是在量化它們有多像人類？"
    }
  ]
}