{
  "author": "Livid_Yam",
  "the_new_excerpt": "Hi all,\n\nTitle says most of it.\n\nWhenever things start to dip, I see a lot of people around here post the phrase\n\"buy the dip\". They're right, it's a great buying opportunity.\n\nAlways keep in mind though, it's possible for the dip to dip, and you'll want to\nhave some fiat leftover incase that…",
  "original_created_utc": 1623841922,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nタイトルがすべてを物語っています。\n\n物事が落ち込み始めると、多くの人が「ディップを買え」という言葉を投稿するのを見ます。\n\"Buy the dip \"という言葉を投稿する人をよく見かけます。その通りで、絶好の買い場です。\n\nしかし、常に心に留めておいてほしいのは、ディップがディップを呼ぶ可能性があるということであり、そのためには以下のことが必要です。\nそれに備えてフィアットを残しておきたいものです。",
      "title": "Remember: Buy the dip is smart, but there always be another dip. 準備を怠らないようにしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n标题说明了大部分内容。\n\n每当事情开始下滑时，我看到这里的很多人都会发布这样的短语\n\"买入跌势\"。他们是对的，这是一个很好的购买机会。\n\n但要始终牢记，有可能会出现下跌，你会想要\n有一些剩余的法币，以防...",
      "title": "记住：买入下跌是明智的，但总是可能有另一次下跌。请确保你做好准备。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n標題說明了大部分內容。\n\n每當事情開始下滑時，我看到這裏的很多人都會發布這樣的短語\n\"買入跌勢\"。他們是對的，這是一個很好的購買機會。\n\n但要始終牢記，有可能會出現下跌，你會想要\n有一些剩餘的法幣，以防...",
      "title": "記住：買入下跌是明智的，但總是可能有另一次下跌。請確保你做好準備。"
    }
  ],
  "title": "Remember: Buying the dip is smart, but there could always be another dip. Make sure you're prepared.",
  "created_utc": 1623861962,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>Title says most of it. </p>\n\n<p>Whenever things start to dip, I see a lot of people around here post the phrase &quot;buy the dip&quot;. They&#39;re right, it&#39;s a great buying opportunity. </p>\n\n<p>Always keep in mind though, it&#39;s possible for the dip to dip, and you&#39;ll want to have some fiat leftover incase that happens.</p>\n\n<p>TLDR: Buy the dip, but have money leftover incase the dip dips.</p>\n</div><!-- SC_ON -->",
  "score": 382,
  "permalink": "/r/CryptoCurrency/comments/o12e4p/remember_buying_the_dip_is_smart_but_there_could/",
  "subreddit": "CryptoCurrency",
  "id": "o12e4p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009740004
}