{
  "author": "Adventuringhobbit",
  "original_created_utc": 1637822082,
  "title": "What is a nice way to ask someone to be quiet because I’m over stimulated?",
  "created_utc": 1637844745,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get overstimulated with noise when I’m stressed, and when I’m around people making small noises, it gets worse. I always feel mean and unkind when I ask them to stop. How can I do this nicely?</p>\n\n<p>Example; overstimulated from a day at work and carpooling with my husband. He starts singing because he is happy and excited. It’s like nails on a chalkboard (his singing is good I just can’t handle it at that moment) and I need him to stop and be quiet for ten minutes. I don’t want to snap at him but also can’t think of a good way to say “stop your happy singing”.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/r1q5qi/what_is_a_nice_way_to_ask_someone_to_be_quiet/",
  "subreddit": "TooAfraidToAsk",
  "id": "r1q5qi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I get overstimulated with noise when I’m stressed, and when I’m around people\nmaking small noises, it gets worse. I always feel mean and unkind when I ask\nthem to stop. How can I do this nicely?\n\nExample; overstimulated from a day at work and carpooling with my husband. He\nstarts singing because he…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ストレスを感じると雑音で過敏になり、周りに人がいると\n周りに小さな音を出している人がいると、さらにひどくなります。やめてくれ」と言うと、いつも意地悪で不親切な感じがします。\nいつも意地悪な気持ちになります。どうしたら、うまくできるでしょうか？\n\n例；1日の仕事と夫との相乗りで過剰な刺激を受けている。彼は\n歌い始める。",
      "title": "刺激が強すぎるので、静かにしてほしい」とお願いする場合、どのような言い回しが良いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在压力大的时候会受到噪音的过度刺激，而当我在人们周围\n发出细微的噪音时，情况会变得更糟。当我要求他们停止时，我总是觉得自己很卑鄙，很不近人情。\n他们停止。我怎样才能很好地做到这一点呢？\n\n例子；在工作中受了一天的刺激，和我丈夫拼车。他\n开始唱歌，因为他...",
      "title": "有什么好办法可以让别人安静下来，因为我受到了过度的刺激？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在壓力大的時候會受到噪音的過度刺激，而當我在人們周圍\n發出細微的噪音時，情況會變得更糟。當我要求他們停止時，我總是覺得自己很卑鄙，很不近人情。\n他們停止。我怎樣才能很好地做到這一點呢？\n\n例子；在工作中受了一天的刺激，和我丈夫拼車。他\n開始唱歌，因爲他...",
      "title": "有什麼好辦法可以讓別人安靜下來，因爲我受到了過度的刺激？"
    }
  ]
}