{
  "author": "mrmonster459",
  "the_new_excerpt": "With high-speed rails being better for the environment and well, high-speed,\nrail is seeing a resurgence, especially as the world's governments continue to\ninvest billions into them.\n\nWhat things that we're doing away with now in the 21st century could see a\ncomeback once there's a new breakthrough…",
  "original_created_utc": 1620249786,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "高速鉄道は、環境にも良いし、何より高速。\n世界各国の政府が数十億ドルの投資を続けていることもあり、鉄道は復活しつつあります。\n特に、世界各国の政府が何十億もの投資を続けているからです。\n\n21世紀の今、私たちが廃止しているものでも、時代が変われば復活する可能性があります。\n新たなブレークスルーがあれば復活するかもしれない...。",
      "title": "20世紀に入ってからは、飛行機での移動が身近になったため、鉄道は廃れていきました。今、鉄道が復活しつつあります。私たちが廃れていくものの中で、次の世紀に復活する可能性のあるものは何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于高速铁路对环境更有利，而且，高速。\n铁路正在看到一个复苏，特别是随着世界各国政府继续对其投资数十亿美元。\n投资数十亿美元。\n\n在21世纪，我们现在正在摒弃的东西，一旦有新的突破，可能会看到一个\n一旦有了新的突破，就会卷土重来......",
      "title": "在20世纪，随着航空旅行变得更加方便，火车开始不再流行。现在，铁路旅行正在卷土重来。哪些被我们逐渐淘汰的东西可以在下个世纪卷土重来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於高速鐵路對環境更有利，而且，高速。\n鐵路正在看到一個復甦，特別是隨着世界各國政府繼續對其投資數十億美元。\n投資數十億美元。\n\n在21世紀，我們現在正在摒棄的東西，一旦有新的突破，可能會看到一個\n一旦有了新的突破，就會捲土重來......",
      "title": "在20世紀，隨着航空旅行變得更加方便，火車開始不再流行。現在，鐵路旅行正在捲土重來。哪些被我們逐漸淘汰的東西可以在下個世紀捲土重來？"
    }
  ],
  "title": "In the 20th century, trains began to go out of fashion as air travel become more accessible. Now, rail travel is making a comeback. What things that we're phasing out could make a comeback in the next century?",
  "created_utc": 1620301696,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With high-speed rails being better for the environment and well, high-speed, rail is seeing a resurgence, especially as the world&#39;s governments continue to invest billions into them. </p>\n\n<p>What things that we&#39;re doing away with now in the 21st century could see a comeback once there&#39;s a new breakthrough that makes them competitive again?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/n5qzbp/in_the_20th_century_trains_began_to_go_out_of/",
  "subreddit": "TrueAskReddit",
  "id": "n5qzbp",
  "is_self": true,
  "media": null,
  "is_video": false
}