{
  "author": "K1llerM1ke83",
  "the_new_excerpt": "My 12 year old son has been playing stock games on his phone and finally asked\nme if he can invest with real money. He had $1,000 sitting in his savings\naccount. So I asked him what he wanted to buy and he said a share in Tesla and 4\nshares of Apple. In about 2 months he’s made $150 on his…",
  "original_created_utc": 1608700257,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我12岁的儿子一直在用手机玩股票游戏，最后他问\n如果他能用真金白银投资的话。他的存款中有1,000美元。\n帐户。所以我问他想买什么，他说买一股特斯拉和4\n苹果的股票。在大约两个月的时间里，他在…上赚了15万美元",
      "title": "自豪的父亲时刻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我12歲的兒子一直在用手機玩股票遊戲，最後他問\n如果他能用真金白銀投資的話。他的存款中有1,000美元。\n帳戶。所以我問他想買什麼，他說買一股特斯拉和4\n蘋果的股票。在大約兩個月的時間裏，他在…上賺了15萬美元",
      "title": "自豪的父親時刻"
    }
  ],
  "title": "Proud Dad Moment",
  "created_utc": 1608709165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My 12 year old son has been playing stock games on his phone and finally asked me if he can invest with real money. He had $1,000 sitting in his savings account. So I asked him what he wanted to buy and he said a share in Tesla and 4 shares of Apple. In about 2 months he’s made $150 on his investment. Not a whole lot, but for a 12 year old with no job, that’s a pretty good ROI. Today he was talking to his 24 year old uncle who said he should sell it and buy something with the profits. My son responds, I just bought it and the capital gains tax is 35% if I sell it less than a year. </p>\n\n<p>Then he goes, but it’s not smart to do that. I’m going to keep it there until I’m old and then went on about Apple and it’s stock history, then he goes into explaining splits to his uncle who is just sitting there asking him all these stock questions. My sons understanding of the stock market is still pretty elementary, but he’s already way ahead of his uncle. Who is right now asking my son for stock advice as he’s opening an investment account. </p>\n\n<p>I wish someone would have taught me about stocks when I was 12 years old. I’d be doing a lot better in life than I am now, all I can do now is teach my kids.</p>\n</div><!-- SC_ON -->",
  "score": 1117,
  "permalink": "/r/investing/comments/kimrdl/proud_dad_moment/",
  "subreddit": "investing",
  "id": "kimrdl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609271715859
}