{
  "author": "Able-Fun2874",
  "original_created_utc": 1626017160,
  "title": "Why can people just record you without consent?",
  "created_utc": 1626031588,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As someone with mental issues I&#39;d rather not be shamed online if I have a panic attack on the street and seven people whip out their cameras to record and mock me. I&#39;ve seen the very negative judgements people cast on whole entire living, breathing, people over 5 seconds of footage. </p>\n\n<p>Why are people allowed to whip out their camera and nonconsensually record you as well as post that online? While it only applies to public areas, it&#39;s still incredibly invasive. </p>\n\n<p>It would be really cool if there was some law that required you to gather consent. Something that accounted for and accommodated security footage but required people to stop recording if you said &quot;I don&#39;t consent to being recorded&quot;. What happened to the whole &quot;respecting the privacy of individuals&quot; thing?</p>\n\n<p>Edits to clarify:</p>\n\n<p>• The point is to have some recourse if you get recorded and have your reputation ruined for whatever reason. Proven false narratives regarding recordings have ruined reputations and it could help  people with mental disorders that cause them to act irrationally to have recourse for their reputation damage as a result.</p>\n\n<p>• Laws like this exist in other countries such as Germany. Private residences can&#39;t even be recorded and don&#39;t show up on Google street view when zooming in.</p>\n\n<p>• We can make provisions to prevent exploitation by public officials and officers of the law so that they can still be held accountable for behavior. </p>\n\n<p>• Accommodations can be made to make sure this law still allows for security footage to be recorded, such as only being enforceable if the footage is posted online or publicly shared after consent has been withdrawn.</p>\n\n<p>• We can make provisions to allow footage of active crimes or even hate speech to be posted without consent so that those people can be held accountable.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/oi6gux/why_can_people_just_record_you_without_consent/",
  "subreddit": "NoStupidQuestions",
  "id": "oi6gux",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As someone with mental issues I'd rather not be shamed online if I have a panic\nattack on the street and seven people whip out their cameras to record and mock\nme. I've seen the very negative judgements people cast on whole entire living,\nbreathing, people over 5 seconds of footage.\n\nWhy are people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "精神的な問題を抱えている者としては、もし私が路上でパニック発作を起こして\n路上でパニック発作を起こしたときに、7人の人がカメラを取り出して、私を記録し、嘲笑したとしても、ネット上で恥をかかないようにしたいです。\n私は、精神的な問題を抱えている者として、ネット上で恥ずかしい思いをしたくありません。私は、5秒間の映像を見て、人々が生きている人間全体を否定的に判断するのを見てきました。\n5秒間の映像を見て、人々が生きている人間全体を否定的に判断するのを見たことがあります。\n\nなぜ人々は...",
      "title": "なぜ人は同意なしに録音できるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个有精神问题的人，我宁愿不在网上被羞辱，如果我在街上惊恐发作，七个人拿出相机记录和嘲笑我。\n如果我在街上恐慌症发作，七个人拿出他们的相机来记录和嘲笑我，我宁愿不在网上被羞辱。\n我。我见过人们为了5秒钟的录像而对整个活生生的人做出非常负面的判断。\n我见过人们为了5秒钟的录像而对整个活生生的人做出非常负面的判断。\n\n为什么人们...",
      "title": "为什么人们可以不经同意就给你录音？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個有精神問題的人，我寧願不在網上被羞辱，如果我在街上驚恐發作，七個人拿出相機記錄和嘲笑我。\n如果我在街上恐慌症發作，七個人拿出他們的相機來記錄和嘲笑我，我寧願不在網上被羞辱。\n我。我見過人們爲了5秒鐘的錄像而對整個活生生的人做出非常負面的判斷。\n我見過人們爲了5秒鐘的錄像而對整個活生生的人做出非常負面的判斷。\n\n爲什麼人們...",
      "title": "爲什麼人們可以不經同意就給你錄音？"
    }
  ]
}