{
  "author": "prostockadvice",
  "the_new_excerpt": "Living in Shanghai, China has really helped me stay ahead of the curve on\nChinese electric vehicle manufacturers and spotting trends. Something I have\nnoticed more over the past month is that the European automakers are selling\nmore and more EV's in the Chinese market. So much so that I am spotting…",
  "original_created_utc": 1611023453,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在中国上海的生活确实帮助我在以下方面走在了前面。\n中国电动车制造商和发现趋势。我有一些\n在过去的一个月里，人们更注意到的是，欧洲汽车制造商正在销售\n中国市场上的电动车越来越多。以至于我在发现...",
      "title": "Un Popular Opinion: NIO--小心翼翼"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在中國上海的生活確實幫助我在以下方面走在了前面。\n中國電動車製造商和發現趨勢。我有一些\n在過去的一個月裏，人們更注意到的是，歐洲汽車製造商正在銷售\n中國市場上的電動車越來越多。以至於我在發現...",
      "title": "Un Popular Opinion: NIO--小心翼翼"
    }
  ],
  "title": "Un Popular Opinion: NIO - Tread Carefully",
  "created_utc": 1611039330,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Living in Shanghai, China has really helped me stay ahead of the curve on Chinese electric vehicle manufacturers and spotting trends. Something I have noticed more over the past month is that the European automakers are selling more and more EV&#39;s in the Chinese market. So much so that I am spotting them driving daily more than what makes me comfortable being an early NIO investor. </p>\n\n<p>Let&#39;s be honest about a few things: </p>\n\n<ol>\n<li>Chinese have a lot of disposable income.</li>\n<li>Chinese love buying European things.</li>\n<li>Do you really think that NIO, LI, or XPEV&#39;s interior and design is better than Germans?</li>\n<li>NIO delayed their ET7 Sedan until the beginning of 2021 nd their 1000KM battery until the end of 2021. The German sedans are on the roads now. </li>\n</ol>\n\n<p>Yes, I get it Tesla is going for more of a minimalist interior, but there as far as a luxury vehicle goes - it is kind of lackluster.  I&#39;ve driven and owned a lot of German cars over the years, in China, and they are still more popular than anything right now in the big cities on the East coast of the Middle Kingdom. </p>\n\n<p><strong>How will this affect my NIO stocks?</strong></p>\n\n<p>By no means am I fear mongering and saying we should all sell Chinese EV stocks now. However, I do believe the Chinese EV companies will start loosing market share. NIO will still hit $100 eventually. I just want to make you aware of the changes taking place on the streets here and you can form your own opinions. Personally, I will not take as big positions any more in these companies, and I will start turning toward more of an EV infrastructure play because no matter who is selling cars they will all need to be charged. Not to mention XPEV&#39;s NGP 3.0 might be a game changer in China - more to come on that.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/stocks/comments/l0a35y/un_popular_opinion_nio_tread_carefully/",
  "subreddit": "stocks",
  "id": "l0a35y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218344
}