{
  "author": "A_Postal_Worker",
  "the_new_excerpt": "While reviewing my stocks and the 1Y charting, honestly I want to punch myself\nin the face. Obviously hindsight is 20/20, but I really wish that either I had\nthe sense or had somebody I trusted tell me to beg, borrow, or steal every\nsingle dollar I could get my hands on and slam it into the…",
  "original_created_utc": 1616186930,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在回顾我的股票和1Y图的时候，说实话，我真想揍自己一拳\n在脸上。显然，事后诸葛亮是20/20，但我真的希望，要么我有。\n或有我信任的人告诉我乞讨、借贷或偷窃的每一个。\n一块钱，我可以得到我的手，并把它砸进... ...",
      "title": "还有人对自己的COVID投资决策感到畏惧吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在回顧我的股票和1Y圖的時候，說實話，我真想揍自己一拳\n在臉上。顯然，事後諸葛亮是20/20，但我真的希望，要麼我有。\n或有我信任的人告訴我乞討、借貸或偷竊的每一個。\n一塊錢，我可以得到我的手，並把它砸進... ...",
      "title": "還有人對自己的COVID投資決策感到畏懼嗎？"
    }
  ],
  "title": "Anybody else cringe at their COVID investment decisions?",
  "created_utc": 1616209140,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While reviewing my stocks and the 1Y charting, honestly I want to punch myself in the face. Obviously hindsight is 20/20, but I really wish that either I had the sense or had somebody I trusted tell me to beg, borrow, or steal every single dollar I could get my hands on and slam it into the market.</p>\n\n<p>The potential numbers make my stomach hurt to even think about. Pretty much $10K invested across almost any random (literally dart board method) entertainment, travel, etc. stocks in late March-early April 2020 would easily be $500K+ today :(</p>\n\n<p>It&#39;s pointless to beat oneself up about the unchangeable past, but honestly f**k me what was I thinking.</p>\n\n<p>What are others thoughts on their decisions or positions?</p>\n\n<p>EDIT: Yes, I understand I exaggerated the potential gains. Gains of 3-6x are more realistic, which is still completely bonkers. Now, for the love of everything holy please stop sending me messages. I understand.</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/stocks/comments/m8qppf/anybody_else_cringe_at_their_covid_investment/",
  "subreddit": "stocks",
  "id": "m8qppf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821005
}