{
  "author": "wheelzoffortune",
  "original_created_utc": 1646766506,
  "title": "So does Elizabeth Warren lie all of the time about crypto or does she just not understand anything about it?",
  "created_utc": 1646788736,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Admittedly I don&amp;#39;t really pay much attention to her ramblings on anything, but I see stuff about her mentioned on here from time to time.&lt;/p&gt;\n\n&lt;p&gt;My aunt is visiting, though, and she loves MSNBC so we&amp;#39;ve had that on quite a bit for the past few days.&lt;/p&gt;\n\n&lt;p&gt;Liz Warren comes on this morning to talk about the war in Ukraine.  Then the topic turned to crypto and how Russia is using it to bypass sanctions, but...&lt;/p&gt;\n\n&lt;p&gt;...literally EVERY point she made was either flawed or completely false.&lt;/p&gt;\n\n&lt;p&gt;How the heck is the crypto community going to achieve true mass adoption when we have people like her in positions of power who are inhibiting progress?&lt;/p&gt;\n\n&lt;p&gt;It reminds me of Andreas Antonopoulos mentioning years ago about how people were so against electricity at first because...&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;IT&amp;quot;LL CAUSE FIRES!  EVERYONE&amp;#39;S HOUSE WILL BURN DOWN!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;or&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;WHY SHOULD WE CHANGE?  CANDLES AND OIL LAMPS WORK FINE!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The mountain of naysayers just seems insurmountable right now.&lt;/p&gt;\n\n&lt;p&gt;Give me some encouragement, /cc!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/t9oagp/so_does_elizabeth_warren_lie_all_of_the_time/",
  "subreddit": "CryptoCurrency",
  "id": "t9oagp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Admittedly I don't really pay much attention to her ramblings on anything, but I\nsee stuff about her mentioned on here from time to time.\n\nMy aunt is visiting, though, and she loves MSNBC so we've had that on quite a\nbit for the past few days.\n\nLiz Warren comes on this morning to talk about the war…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かに、私は彼女の放談にはあまり関心がないのですが、でも\n時々、ここで彼女のことが書かれているのを見ます。\n\n叔母が遊びに来ていて、彼女はMSNBCが大好きなので、かなり\nここ数日、ちょっとだけ。\n\n今朝はリズ・ウォレンが登場して、戦争について話しています...。",
      "title": "エリザベス・ウォーレンは暗号についてずっと嘘をつき続けているのか、それとも何も理解していないだけなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "诚然，我不太注意她在任何事情上的胡言乱语，但我在这里不时看到关于她的东西被提及。\n但我看到这里不时地提到关于她的东西。\n\n不过，我姨妈来了，她喜欢MSNBC，所以我们过去几天经常看这个节目。\n在过去的几天里，我们经常看这个节目。\n\n利兹-沃伦今天早上来谈战争......",
      "title": "那么，伊丽莎白-沃伦是一直在对加密货币撒谎，还是她根本就不了解加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "誠然，我不太注意她在任何事情上的胡言亂語，但我在這裏不時看到關於她的東西被提及。\n但我看到這裏不時地提到關於她的東西。\n\n不過，我姨媽來了，她喜歡MSNBC，所以我們過去幾天經常看這個節目。\n在過去的幾天裏，我們經常看這個節目。\n\n利茲-沃倫今天早上來談戰爭......",
      "title": "那麼，伊麗莎白-沃倫是一直在對加密貨幣撒謊，還是她根本就不瞭解加密貨幣？"
    }
  ]
}