{
  "author": "calcium1",
  "original_created_utc": 1640360296,
  "title": "Is it bad to think things shouldn’t be cancelled because of omicron?",
  "created_utc": 1640367488,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It genuinely doesn’t make sense to me that events in places like NYC are being cancelled where you need to be vaccinated to go. Isn’t the whole entire point of getting vaccinated to be able to live a little bit more normally after 2 years of being safe? &lt;/p&gt;\n\n&lt;p&gt;The Strokes concert on New Year’s Eve was just cancelled and I’m being honest when I say it was the only thing I was looking forward to in months. Why do I have to be punished when I did everything I was supposed to? It’s getting upsetting and feeling like it doesn’t even matter what I do anymore&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/TooAfraidToAsk/comments/rnoot3/is_it_bad_to_think_things_shouldnt_be_cancelled/",
  "subreddit": "TooAfraidToAsk",
  "id": "rnoot3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It genuinely doesn’t make sense to me that events in places like NYC are being\ncancelled where you need to be vaccinated to go. Isn’t the whole entire point of\ngetting vaccinated to be able to live a little bit more normally after 2 years\nof being safe?\n\nThe Strokes concert on New Year’s Eve was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニューヨークのような場所でイベントが行われるのは、純粋に納得がいかないのです。\n予防接種を受けないと行けない場所がキャンセルになった。予防接種を受けることが\n予防接種を受けるのは、2年後に少しでも普通に生活できるようにするためです。\n安全なのでしょうか？\n\n大晦日のストロークスのコンサートは...",
      "title": "オミクロンのせいで物事が中止になってはいけないと思うのは悪いことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对我来说，像纽约市这样的地方的活动被认为是没有意义的。\n取消了需要接种疫苗才能参加的活动。整个活动的重点不就是\n接种疫苗不就是为了在两年后能够更正常地生活吗？\n安全的生活？\n\n除夕夜的Strokes音乐会是...",
      "title": "认为不应该因为欧米茄而取消的事情不好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對我來說，像紐約市這樣的地方的活動被認爲是沒有意義的。\n取消了需要接種疫苗才能參加的活動。整個活動的重點不就是\n接種疫苗不就是爲了在兩年後能夠更正常地生活嗎？\n安全的生活？\n\n除夕夜的Strokes音樂會是...",
      "title": "認爲不應該因爲歐米茄而取消的事情不好嗎？"
    }
  ]
}