{
  "author": "BushyOreo",
  "original_created_utc": 1657542955,
  "title": "crypto.com slashes earn rates for a 5th time",
  "created_utc": 1657557439,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Crypto.com continues its saga of reducing earn rates by lowering its stablecoin earn rates today. This is the 5th time now in just a few months it has lowered its rates without giving any notice again to its customers.&lt;/p&gt;\n\n&lt;p&gt;It seems even with all the complaints of communication about these changes and not just implementing them with no notice have fallen on deaf ears.&lt;/p&gt;\n\n&lt;p&gt;I wonder how much longer this will continue to keep dropping rates are if they will just skip all this finally and remove their earn program altogether. They have already removed a dozen or so crypto coins from their earn program just a few weeks ago so it wouldn&amp;#39;t be unheard of&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 438,
  "permalink": "/r/CryptoCurrency/comments/vwhdqd/cryptocom_slashes_earn_rates_for_a_5th_time/",
  "subreddit": "CryptoCurrency",
  "id": "vwhdqd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Crypto.com continues its saga of reducing earn rates by lowering its stablecoin\nearn rates today. This is the 5th time now in just a few months it has lowered\nits rates without giving any notice again to its customers.\n\nIt seems even with all the complaints of communication about these changes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Crypto.comは、安定コインの収益率を引き下げることで、収益率の引き下げを続けています。\nのレートを引き下げました。これは、わずか数ヶ月の間に、5回目の引き下げとなります。\nこれは、わずか数ヶ月の間に5回目のことで、顧客には何の通知もなく、そのレートを下げています。\n\nこのような変更に関するコミュニケーションへの不満があるにもかかわらず...",
      "title": "crypto.comが5回目の収益率引き下げを実施"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Crypto.com继续其降低收益率的传奇，今天降低了其稳定币\n赚率。这是在短短几个月内第5次降低利率。\n它已经是第五次在短短几个月内降低利率而没有给客户任何通知。\n\n似乎即使有关于这些变化的所有投诉沟通...",
      "title": "crypto.com第五次下调收益率"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Crypto.com繼續其降低收益率的傳奇，今天降低了其穩定幣\n賺率。這是在短短几個月內第5次降低利率。\n它已經是第五次在短短几個月內降低利率而沒有給客戶任何通知。\n\n似乎即使有關於這些變化的所有投訴溝通...",
      "title": "crypto.com第五次下調收益率"
    }
  ]
}