{
  "author": "Johnnyvezai",
  "the_new_excerpt": "The reason I'm afraid to ask this is because I think I know Reddit well enough\nby now that I figure by saying something like \"It's not because I'm being\ntracked\", I have this feeling that will immediately be taken out of context, and\npeople will only focus on that and start going off saying things…",
  "original_created_utc": 1619726290,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜこのようなことを聞くのが怖いかというと、私は今までにレディを十分に知っていると思っているからです。\n追跡されているからではありません」というようなことを言うと、すぐに文脈を無視して\n追跡されているからではありません」と言えば、すぐに文脈を無視されて、人々はその点だけに注目して\n人々はそこだけに注目して、いろいろなことを言い始めるのではないかと...。",
      "title": "つまり、パーソナライズされたコンテンツを好まないのは、（主に）追跡されるからではなく、1つの製品をちょっと見ただけで、さらに10個の類似製品を押し付けられるのが嫌だからだと思うのは、私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我之所以不敢问这个问题，是因为我认为我对Reddit有足够的了解。\n现在我想，如果我说 \"这不是因为我被跟踪了 \"这样的话，我觉得会立即被断章取义。\n追踪 \"这样的话，我觉得这句话会立即被断章取义，而且\n人们只会关注这一点，并开始说一些话......",
      "title": "那么，我是不是唯一一个不喜欢个性化内容的人，不是（主要）因为被跟踪，而只是因为我不喜欢在短暂地看了一个产品之后，又有10个类似的产品塞到我面前？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我之所以不敢問這個問題，是因爲我認爲我對Reddit有足夠的瞭解。\n現在我想，如果我說 \"這不是因爲我被跟蹤了 \"這樣的話，我覺得會立即被斷章取義。\n追蹤 \"這樣的話，我覺得這句話會立即被斷章取義，而且\n人們只會關注這一點，並開始說一些話......",
      "title": "那麼，我是不是唯一一個不喜歡個性化內容的人，不是（主要）因爲被跟蹤，而只是因爲我不喜歡在短暫地看了一個產品之後，又有10個類似的產品塞到我面前？"
    }
  ],
  "title": "So am I the only person who doesn't like personalized content not (primarily) because of being tracked, but just because I don't like having 10 more similar products shoved into my face after briefly looking at one?",
  "created_utc": 1619745496,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The reason I&#39;m afraid to ask this is because I think I know Reddit well enough by now that I figure by saying something like &quot;It&#39;s not because I&#39;m being tracked&quot;, I have this feeling that will immediately be taken out of context, and people will only focus on that and start going off saying things along the lines of &quot;omfg you support big brother the chinese government and the illuminati&quot; or some shit. Make no mistake I do think internet privacy is important and should be respected, but that&#39;s not what I&#39;m getting at here. I understand that some companies do it just for market research and to try and provide content that&#39;s relevant to their consumers, but I mean come on now, just because I look at one household item, one place I like to go out to, or listen to one artist of a certain genre doesn&#39;t mean I automatically want several dozen more crammed into every corner of my browser. It&#39;s also worth mentioning sometimes I might feel a little embarrassed over my tastes and interests that I&#39;d rather not have anyone else knowing about them. Am I alone here, or are these common perspectives to have?</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/TooAfraidToAsk/comments/n1crej/so_am_i_the_only_person_who_doesnt_like/",
  "subreddit": "TooAfraidToAsk",
  "id": "n1crej",
  "is_self": true,
  "media": null,
  "is_video": false
}