{
  "author": "ragstorichespodcast",
  "the_new_excerpt": "Don't sell off any of your stocks and like everyone is saying if you can afford\nto, buy the dips! The next green day (for you new guys like me supposedly that\nmeans on days we actually get to see profits or so the stories claim) you'll be\nglad you loaded up on more stocks. If you're scared and sell…",
  "original_created_utc": 1614023339,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不要抛售任何股票，就像大家说的，如果你有能力的话\n到，买了蘸料! 第二天的绿色日子（对于你们这些像我一样的新人来说，应该就是\n意味着在我们真正能看到利润的日子里，或者说故事中所说的那样）你将会被\n很高兴你装了更多的股票。如果你害怕，卖...",
      "title": "市场必然会反弹。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要拋售任何股票，就像大家說的，如果你有能力的話\n到，買了蘸料! 第二天的綠色日子（對於你們這些像我一樣的新人來說，應該就是\n意味着在我們真正能看到利潤的日子裏，或者說故事中所說的那樣）你將會被\n很高興你裝了更多的股票。如果你害怕，賣...",
      "title": "市場必然會反彈。"
    }
  ],
  "title": "The market is bound to bounce back.",
  "created_utc": 1614029166,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don&#39;t sell off any of your stocks and like everyone is saying if you can afford to, buy the dips! The next green day (for you new guys like me supposedly that means on days we actually get to see profits or so the stories claim) you&#39;ll be glad you loaded up on more stocks. If you&#39;re scared and sell you&#39;ll be sorry you did and you&#39;ll but high again and the next red day you see you&#39;ll sell low again at will stay in a cycle losing money. </p>\n\n<p>Remember!</p>\n\n<p>&quot;The stock market is a device for transferring money from the impatient to the patient&quot;? -Buffet </p>\n\n<p>&quot;Time in the market beats timing the market&quot;</p>\n\n<p>&quot;Scared money doesn&#39;t make money&quot; </p>\n\n<p>&quot;Buy low sell high&quot; </p>\n\n<p>&quot;You haven&#39;t lost anything if you don&#39;t sell&quot; </p>\n\n<p>&quot;HODL&quot; </p>\n\n<p>Find a new hobby and stop looking at your portfolio&#39;s unless you need to sell to buy something else or because your need money. If you&#39;re not gonna buy or sell why even look at it? Go for a run, walk, build a model car, binge watch a new show, get a side hustle so you have more money to buy more stocks. </p>\n\n<p>Wish you all the best.</p>\n</div><!-- SC_ON -->",
  "score": 702,
  "permalink": "/r/stocks/comments/lpxxvi/the_market_is_bound_to_bounce_back/",
  "subreddit": "stocks",
  "id": "lpxxvi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332886256
}