{
  "author": "harleighey11",
  "original_created_utc": 1626033840,
  "title": "I own a small business and just started accepting cryptocurrency. MAKING BANK!!!!",
  "created_utc": 1626046233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all! I’ve been thinking about doing this for a while now but was hesitant because of the volatility of cryptos. I took the leap and now my local Southern restaurant accepts crypto’s!</p>\n\n<p>I have been blown away by the number of people that opt to buy with cryptocurrencys. I have been encouraging other local businesses to do the same. </p>\n\n<p>I have increased sales in the last two months by 37% from this. Some kids walked by and saw my sign out front that says I accept bitcoin and said, “ fuck Chick-fil-A let’s eat here”</p>\n\n<p>Cryptocurrency isn’t going anywhere. If you are a business owner I highly encourage you to get on the rocket</p>\n</div><!-- SC_ON -->",
  "score": 403,
  "permalink": "/r/CryptoCurrency/comments/oibjla/i_own_a_small_business_and_just_started_accepting/",
  "subreddit": "CryptoCurrency",
  "id": "oibjla",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey all! I’ve been thinking about doing this for a while now but was hesitant\nbecause of the volatility of cryptos. I took the leap and now my local Southern\nrestaurant accepts crypto’s!\n\nI have been blown away by the number of people that opt to buy with\ncryptocurrencys. I have been encouraging…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。しばらくの間、これをやろうと考えていましたが、クリプトの変動性のために躊躇していました。\n躊躇していました。思い切ってやってみたら、今では私の地元のサザン\nレストランで暗号を受け入れることができました。\n\n暗号での購入を選択する人の多さには驚かされました。\n私は、暗号通貨での購入を選ぶ人の多さに驚かされました。私はこれまで、このようなことを奨励してきました。",
      "title": "私は中小企業を経営していますが、暗号通貨の受け入れを始めたばかりです。MAKING BANK!!!!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，大家好! 我想做这件事已经有一段时间了，但一直在犹豫不决\n因为加密货币的波动性。我采取了这一举措，现在我的当地南方\n餐馆接受了加密货币!\n\n我已经被选择用加密货币购买的人的数量所震惊了。\n我被选择用加密货币购买的人数所震惊。我一直在鼓励...",
      "title": "我拥有一个小企业，刚刚开始接受加密货币。制作银行!!!!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，大家好! 我想做這件事已經有一段時間了，但一直在猶豫不決\n因爲加密貨幣的波動性。我採取了這一舉措，現在我的當地南方\n餐館接受了加密貨幣!\n\n我已經被選擇用加密貨幣購買的人的數量所震驚了。\n我被選擇用加密貨幣購買的人數所震驚。我一直在鼓勵...",
      "title": "我擁有一個小企業，剛剛開始接受加密貨幣。製作銀行!!!!"
    }
  ]
}