{
  "author": "AkenHoma",
  "original_created_utc": 1634625890,
  "title": "This liquidity aggregator might change the game in the DeFi space.",
  "created_utc": 1634661232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m on the lookout for DeFi projects lately and one of the promising projects I found is <a href=\"https://grizzly.fi/\">Grizzly</a>. Basically, it’s a liquidity aggregator that aims to make DeFi accessible to everyone through intuitive UI and features that can save us from a couple of clicks. I attended their Aug 2021 AMA, and here&#39;s what I found out.</p>\n\n<ul>\n<li>Grizzly is a liquidity mining hub. We don&#39;t invest in Grizzly per se but we invest THROUGH it. There&#39;s actually a huge difference. This means they don&#39;t necessarily have competition as the Grizzly maximizes DEX potential via smart contracts that focus on stable coin pairs.</li>\n<li>The platform has a strong emphasis on accessibility. This explains the bear, honey, etc. imagery even I got weirded with at first. Bears (investors) give their coins to bees (smartcontracts) that tap into hives (liquidity pools) and generate the Honey Token as well as other rewards. I guess the simple imagery makes it easier for DEX newcomers to join? (The whole process of investing is made much easier. “One-click investment process” is here a Keyword)</li>\n<li>Aside from images, the Grizzly smart contracts also help with accessibility. They&#39;re designed to auto-compute ideal daily reinvests which gives higher yields. </li>\n<li>If successful, their &quot;Collaterized Liquidity Mining&quot; can be a HUGE deal. We&#39;ve never seen anything like this. This can remove the risks of selling your BTC etc to do liquidity mining, since Grizzly becomes a &quot;lending platform&quot; for crypto. If you don&#39;t want to deal with your BTC directly, you can just take out a loan and work with it instead. Since the smart contract also regulates this process, theoretically we shouldn&#39;t worry about liquidation risks for the loans.</li>\n</ul>\n\n<p>Overall Grizzly seems pretty neat. Of course, it’s still essential for beginners to DYOR especially on DeFi but making it more accessible an</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/n8ucaAkr5lXLH3Czrf-uBoMC_o4rsr0OoWjyPobqAXc.jpg?auto=webp&s=63c3278469e254a4a1505ccc179b58f9b43ebdef",
          "width": 949,
          "height": 708
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/n8ucaAkr5lXLH3Czrf-uBoMC_o4rsr0OoWjyPobqAXc.jpg?width=108&crop=smart&auto=webp&s=86113f3586030cc32080581dd9f3afd024354186",
            "width": 108,
            "height": 80
          },
          {
            "url": "https://external-preview.redd.it/n8ucaAkr5lXLH3Czrf-uBoMC_o4rsr0OoWjyPobqAXc.jpg?width=216&crop=smart&auto=webp&s=71bc8a8dd7c205e0033e7e2a6d912967d1a05b70",
            "width": 216,
            "height": 161
          },
          {
            "url": "https://external-preview.redd.it/n8ucaAkr5lXLH3Czrf-uBoMC_o4rsr0OoWjyPobqAXc.jpg?width=320&crop=smart&auto=webp&s=9eae2d46b8516a42ef5840df4cf6f28b4a907fa6",
            "width": 320,
            "height": 238
          },
          {
            "url": "https://external-preview.redd.it/n8ucaAkr5lXLH3Czrf-uBoMC_o4rsr0OoWjyPobqAXc.jpg?width=640&crop=smart&auto=webp&s=80767e7c4b9e8c4245996d10fefe24a31020edbe",
            "width": 640,
            "height": 477
          }
        ],
        "variants": {},
        "id": "s65VAaffE4d0liiAjBcVH5TOG5GlDTtnyMV12KXVobA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qb5tt6/this_liquidity_aggregator_might_change_the_game/",
  "subreddit": "CryptoCurrency",
  "id": "qb5tt6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m on the lookout for DeFi projects lately and one of the promising projects I\nfound is Grizzly [https://grizzly.fi/]. Basically, it’s a liquidity aggregator\nthat aims to make DeFi accessible to everyone through intuitive UI and features\nthat can save us from a couple of clicks. I attended their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、DeFiプロジェクトを探しているのですが、有望なプロジェクトの一つとして、Grizzly []を見つけました。\n見つけたのはGrizzly [https://grizzly.fi/]です。基本的には、リクイディティ・アグリゲータです。\n直感的なUIと機能により、誰もがDeFiにアクセスできるようにすることを目的としています。\n2、3回のクリックを省くことができます。私が参加したのは、彼らの...",
      "title": "このリクイディティ・アグリゲーターは、DeFiスペースのゲームを変えるかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近在寻找DeFi项目，我发现的一个有希望的项目是Grizzly [https：／／www.com]。\n是Grizzly [https://grizzly.fi/]。基本上，它是一个流动性聚合器\n它旨在通过直观的用户界面和功能使每个人都能使用DeFi。\n可以使我们免于几次点击。我参加了他们的...",
      "title": "这个流动性聚合器可能会改变DeFi领域的游戏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近在尋找DeFi項目，我發現的一個有希望的項目是Grizzly [https：／／www.com]。\n是Grizzly [https://grizzly.fi/]。基本上，它是一個流動性聚合器\n它旨在通過直觀的用戶界面和功能使每個人都能使用DeFi。\n可以使我們免於幾次點擊。我參加了他們的...",
      "title": "這個流動性聚合器可能會改變DeFi領域的遊戲。"
    }
  ]
}