{
  "author": "polar_nopposite",
  "original_created_utc": 1641250985,
  "title": "When you successfully fight off a mutated pathogen via antibodies from a previous infection/vaccination (that have reduced effectiveness, but still get the job done), does your body create updated antibodies for the mutated pathogen?",
  "created_utc": 1641272334,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This question is geared towards the Omicron Covid-19 outbreak, but really extends to the immune system in general.&lt;/p&gt;\n\n&lt;p&gt;After receiving a booster of the Covid-19 vaccine, your body will produce antibodies targeting the original strain of the virus. Even though the potency of the antibodies against the Omicron variant is greatly diminished, this is still thought to improve your defenses against the disease.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m particularly interested in the case where your body easily defeats an exposure to Omicron due to a large abundance of antibodies from a recent booster. Will the body bother creating updated antibodies in this case? Or will subsequent exposures still carry risk of infection, especially as the level of antibodies in your system wane over time since receiving the booster?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/rvepm4/when_you_successfully_fight_off_a_mutated/",
  "subreddit": "askscience",
  "id": "rvepm4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This question is geared towards the Omicron Covid-19 outbreak, but really\nextends to the immune system in general.\n\nAfter receiving a booster of the Covid-19 vaccine, your body will produce\nantibodies targeting the original strain of the virus. Even though the potency\nof the antibodies against the…",
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题是针对Omicron Covid-19的爆发的，但是实际上\n延伸到一般的免疫系统。\n\n在接受Covid-19疫苗的强化治疗后，你的身体会产生\n针对该病毒的原始菌株的抗体。尽管这种抗体的效力\n抵抗该病毒的抗体的效力。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題是針對Omicron Covid-19的爆發的，但是實際上\n延伸到一般的免疫系統。\n\n在接受Covid-19疫苗的強化治療後，你的身體會產生\n針對該病毒的原始菌株的抗體。儘管這種抗體的效力\n抵抗該病毒的抗體的效力。"
    }
  ]
}