{
  "author": "God-bear",
  "original_created_utc": 1647766282,
  "title": "Erich von Däniken's 1968 bestselling book Chariots of the Gods infamously claimed that Ancient Egyptian society was built by extraterrestrial beings. What was the reaction at the time by Egyptians to these ideas? Were they offended by the implications? Did some think it could be true?",
  "created_utc": 1647784198,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Disclaimer to say that I&amp;#39;m not a believer in Ancient Astronauts or anything. Just curious about the reaction to these ideas when they were first receiving mainstream international attention.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/AskHistorians/comments/tigtt9/erich_von_dänikens_1968_bestselling_book_chariots/",
  "subreddit": "AskHistorians",
  "id": "tigtt9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Disclaimer to say that I'm not a believer in Ancient Astronauts or anything.\nJust curious about the reaction to these ideas when they were first receiving\nmainstream international attention.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "古代宇宙飛行士の信者でもなんでもない、というのが免責事項です。\nただ、このアイデアが最初に取り上げられたときの反応に興味があるだけです。\n国際的に注目されている。",
      "title": "1968年に出版されたエーリッヒ・フォン・デーニケンのベストセラー『神々の戦車』は、古代エジプト社会は地球外生命体によって築かれたと主張し、悪名高いものであった。当時のエジプト人は、この考え方にどのような反応を示したのだろうか。彼らはその意味合いに腹を立てたのだろうか？また、それが真実であると考える人もいたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：我不是古代宇航员或任何东西的信仰者。\n我只是好奇，在这些想法第一次受到国际主流关注时，人们对它们的反应是什么？\n主流的国际关注。",
      "title": "埃里希-冯-戴尼肯1968年的畅销书《众神的战车》声名狼藉地声称古埃及社会是由外星生物建造的。当时埃及人对这些观点的反应是什么？他们是否被这些暗示所冒犯？有些人认为这可能是真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：我不是古代宇航員或任何東西的信仰者。\n我只是好奇，在這些想法第一次受到國際主流關注時，人們對它們的反應是什麼？\n主流的國際關注。",
      "title": "埃裏希-馮-戴尼肯1968年的暢銷書《衆神的戰車》聲名狼藉地聲稱古埃及社會是由外星生物建造的。當時埃及人對這些觀點的反應是什麼？他們是否被這些暗示所冒犯？有些人認爲這可能是真的嗎？"
    }
  ]
}