{
  "author": "Dimension_Better",
  "the_new_excerpt": "Right, so I'm a 17 Y/o guy and I would say I know quite a lot of people, who I\ncan generally see anywhere and strike a conversation with, ranging from 1 minute\nto possibly even more than an hour in some cases.\n\nHowever, I may know a lot of people, but I still don't really and truly have any\nfriends…",
  "original_created_utc": 1622507651,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は17歳の男性ですが、多くの人を知っていると思います。\nどこで会っても、1分から場合によっては1時間以上も会話ができるような人たちです。\n場合によっては1時間以上になることもあります。\n\nしかし、多くの人を知っていても、本当の意味での友達はまだいません。\n友達がいない...。",
      "title": "たくさんの人を知っていても、実際には「友達」がいないという人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我是一个17岁的男孩，我想说我认识很多人，我通常可以在任何地方看到他们，并与他们交谈。\n一般来说，我可以在任何地方看到他们，并与他们进行交谈，时间从1分钟\n甚至在某些情况下可能超过一个小时。\n\n然而，我可能认识很多人，但我仍然没有真正的、真正的\n朋友......。",
      "title": "是否有人认识很多人，但实际上仍然没有任何 \"朋友\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我是一個17歲的男孩，我想說我認識很多人，我通常可以在任何地方看到他們，並與他們交談。\n一般來說，我可以在任何地方看到他們，並與他們進行交談，時間從1分鐘\n甚至在某些情況下可能超過一個小時。\n\n然而，我可能認識很多人，但我仍然沒有真正的、真正的\n朋友......。",
      "title": "是否有人認識很多人，但實際上仍然沒有任何 \"朋友\"？"
    }
  ],
  "title": "Does anyone else know a lot of people but still don't actually have any 'friends'?",
  "created_utc": 1622547620,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Right, so I&#39;m a 17 Y/o guy and I would say I know quite a lot of people, who I can generally see anywhere and strike a conversation with, ranging from 1 minute to possibly even more than an hour in some cases.</p>\n\n<p>However, I may know a lot of people, but I still don&#39;t really and truly have any friends which I could hang out with or go anywhere with. Any of those people which I know I just don&#39;t class as quite a &#39;friend&#39; rather &#39;someone I know&#39; and I have the feeling they would probably not be up to hang out. Although, I haven&#39;t tried asking any.</p>\n\n<p>I just think they will all have their own friend groups and it would be too random for me to join it. Personally, I would even class myself as a typically extroverted person, so I&#39;m not exactly shy but still don&#39;t seem to have any actual friends. Anyone else ever felt like this?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/nphila/does_anyone_else_know_a_lot_of_people_but_still/",
  "subreddit": "TooAfraidToAsk",
  "id": "nphila",
  "is_self": true,
  "media": null,
  "is_video": false
}