{
  "author": "Ryner921",
  "the_new_excerpt": "USA,CA. I live in a neighborhood with mostly street parking. My neighbor won't\nstop buying junk BMWs, I am not exaggerating the dude has like 23 of them, and\ntakes almost all of the parking on our street. They aren't nice cars at all.\nMostly \"craigslist specials\". His front yard looks like a…",
  "original_created_utc": 1622519762,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカ、カリフォルニア州 私の住んでいる地域は、ほとんどが路上駐車です。私の隣人はジャンクのBMWを買うのをやめません。\n誇張ではなく、彼は23台ものジャンクBMWを所有しています。\n誇張ではなく、彼は23台ほど持っていて、うちの通りの駐車場のほとんどを占領しています。彼らは全然いい車ではありません。\nほとんどが「クレイグリスト・スペシャル」です。彼の前庭はまるで...。",
      "title": "隣人が車を買って駐車場を占領するのをやめない場合、どうしたらいいかアドバイスをくれる人はいますか？彼は約23台の車を持っていて、それがどんどん増えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国,加利福尼亚州. 我住在一个大部分是路边停车的社区。我的邻居不愿意\n我的邻居不会停止购买垃圾宝马，我没有夸张，这家伙有23辆之多，而且几乎占用了我们街道上所有的停车位。\n几乎占据了我们街道上所有的停车位。他们根本就不是什么好车。\n大多数是 \"Craigslist specials\"。他的前院看起来像一个...",
      "title": "如果一个邻居不愿意停止购买汽车并占用所有的停车位，谁能给出建议呢？他有大约23辆车，而且还在不断增加。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國,加利福尼亞州. 我住在一個大部分是路邊停車的社區。我的鄰居不願意\n我的鄰居不會停止購買垃圾寶馬，我沒有誇張，這傢伙有23輛之多，而且幾乎佔用了我們街道上所有的停車位。\n幾乎佔據了我們街道上所有的停車位。他們根本就不是什麼好車。\n大多數是 \"Craigslist specials\"。他的前院看起來像一個...",
      "title": "如果一個鄰居不願意停止購買汽車並佔用所有的停車位，誰能給出建議呢？他有大約23輛車，而且還在不斷增加。"
    }
  ],
  "title": "Can anyone give advice on what to do if a neighbor won't stop buying cars and taking up all the parking spaces? He has about 23 cars and it's growing.",
  "created_utc": 1622563338,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>USA,CA. I live in a neighborhood with mostly street parking. My neighbor won&#39;t stop buying junk BMWs, I am not exaggerating the dude has like 23 of them, and takes almost all of the parking on our street. They aren&#39;t nice cars at all. Mostly &quot;craigslist specials&quot;. His front yard looks like a junkyard. I don&#39;t really care about how his house looks, I&#39;m not an HOA Karen. I&#39;d love it if he kept them ALL on his lawn or in front of his house. But I&#39;m annoyed that I and my family have to walk about 2 blocks away just to park(we have multiple working adults in our household and I let my elderly parents get the two driveway spots). His cars seem to have up to date tags (although I am not sure how legitimate they are) and street sweeping isn&#39;t really enforced. I tried talking to him but he&#39;s a huge narcissist and does not give a fuck. I&#39;ve tried reporting &quot;abandoned vehicle&quot; but he just shuffles them around. It&#39;s been like this for years.. what can I do if none of the legal methods work? Please help me.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/npl4k3/can_anyone_give_advice_on_what_to_do_if_a/",
  "subreddit": "NoStupidQuestions",
  "id": "npl4k3",
  "is_self": true,
  "media": null,
  "is_video": false
}