{
  "author": "gnarley_quinn",
  "original_created_utc": 1640306413,
  "title": "What are true most hated coins on this sub?",
  "created_utc": 1640321326,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m honestly not trying to start anything controversial here. Rather I want to perform an experiment. I want to see how well the market does based on what this sub hates the most. &lt;/p&gt;\n\n&lt;p&gt;I’ll buy up to ten coins and track them purely on the basis that they are despised by everyone here. The ten most popular by comments/ups at the end of the day will be the ones I invest in.  &lt;/p&gt;\n\n&lt;p&gt;To rule out just building a stack of shitcoins, I’ll put a moratorium on anything less than $300m marketcap. &lt;/p&gt;\n\n&lt;p&gt;Be advised. You don’t have to actually hate the coin yourself. It’s more likely that as a holder of a particular coin, you will notice the excess hatred more than others. &lt;/p&gt;\n\n&lt;p&gt;So shill me the most hated coins. I will create the ultimate anti-sub folio.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/rn9rel/what_are_true_most_hated_coins_on_this_sub/",
  "subreddit": "CryptoCurrency",
  "id": "rn9rel",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m honestly not trying to start anything controversial here. Rather I want to\nperform an experiment. I want to see how well the market does based on what this\nsub hates the most.\n\nI’ll buy up to ten coins and track them purely on the basis that they are\ndespised by everyone here. The ten most…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、ここで何か論争を始めようと思っているわけではありません。むしろ、私がしたいのは\n実験をしてみました。この市場のニーズに合わせて、市場がどのように動くかを見てみたいのです。\nサブが一番嫌いなんです。\n\n最大10枚のコインを購入し、純粋にそのコインを追跡します。\nみんなに嫌われている。10の最も...",
      "title": "このサブで最も嫌われている真のコインは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，我并不是想在这里引起什么争议。相反，我想\n进行一个实验。我想看看市场的表现如何，基于这个\n子最讨厌的东西。\n\n我将购买多达10个硬币，并跟踪它们，纯粹是基于它们是\n被这里的每个人所鄙视。这十个最...",
      "title": "在这个子上真正最讨厌的硬币是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，我並不是想在這裏引起什麼爭議。相反，我想\n進行一個實驗。我想看看市場的表現如何，基於這個\n子最討厭的東西。\n\n我將購買多達10個硬幣，並跟蹤它們，純粹是基於它們是\n被這裏的每個人所鄙視。這十個最...",
      "title": "在這個子上真正最討厭的硬幣是什麼？"
    }
  ]
}