{
  "author": "-boosted",
  "original_created_utc": 1632263970,
  "title": "My girlfriend never wants to do the work when we have sex, and she's been getting annoyed that I have been tired lately, is this normal?",
  "created_utc": 1632276614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Long story short, my relationship has been going on for 4+ years and I enjoy sex once or twice a week, my girlfriend would prefer daily if I was interested but I guess my libido just isn&#39;t as high as hers. I tell her to initiate something and hop on top or do the work and she is extremly adamant about not doing the work and that &quot;I should just want to do it&quot; because I&#39;m the guy. It gets tiring after a while and if she were to start initiatiating it and at least doing the work for the first half, I&#39;ll gladly do the work for the second half on my days that I&#39;m tired or just not that sexually interested (5 days out of the week). Is my libido low for being a 27 year old? She&#39;s been getting pretty upset with me lately but it&#39;s just with full time school and work I am not as energetic when it&#39;s late at night and she wants to have sex. She says I don&#39;t love her anymore or find her attractive which isn&#39;t the case, but I&#39;m not going to lie It&#39;s also a mature relationship so I&#39;m not trying to have sex daily like I did when we first started dating.</p>\n</div><!-- SC_ON -->",
  "score": 141,
  "permalink": "/r/TooAfraidToAsk/comments/pstzv8/my_girlfriend_never_wants_to_do_the_work_when_we/",
  "subreddit": "TooAfraidToAsk",
  "id": "pstzv8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Long story short, my relationship has been going on for 4+ years and I enjoy sex\nonce or twice a week, my girlfriend would prefer daily if I was interested but I\nguess my libido just isn't as high as hers. I tell her to initiate something and\nhop on top or do the work and she is extremly adamant…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長い話になりますが、私の関係は4年以上続いていて、私はセックスを楽しんでいます。\n彼女は僕が興味を持てば毎日でもいいと言っていますが、僕の性欲は彼女ほど高くないようです。\n私の性欲は彼女ほど高くないようです。私は彼女に何かを始めて欲しいと言っています。\n私は彼女に何かを始めて、上に乗ったり、仕事をしたりするように言うのですが、彼女は非常に固執します...。",
      "title": "僕の彼女は、セックスの時に仕事をしたがらないし、最近僕が疲れているとイライラしているのですが、これは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "长话短说，我的关系已经持续了4年多，我享受性生活\n每周一到两次，如果我有兴趣，我的女朋友希望每天都有，但我\n但我想我的性欲没有她那么高。我告诉她要主动一些，并且\n我告诉她要主动出击，跳到上面或做工作，但她非常坚持......",
      "title": "我的女朋友在我们做爱的时候从来不愿意做工作，而且她最近对我的疲劳感到很烦，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長話短說，我的關係已經持續了4年多，我享受性生活\n每週一到兩次，如果我有興趣，我的女朋友希望每天都有，但我\n但我想我的性慾沒有她那麼高。我告訴她要主動一些，並且\n我告訴她要主動出擊，跳到上面或做工作，但她非常堅持......",
      "title": "我的女朋友在我們做愛的時候從來不願意做工作，而且她最近對我的疲勞感到很煩，這正常嗎？"
    }
  ]
}