{
  "author": "BirdisonBird",
  "the_new_excerpt": "It may seem like everybody on this sub has money to just keep throwing at crypto\nevery single new pump, and everyone else is capitalizing on these gains while\nyou sit and watch because you don't have enough money or the means to invest\nright now. FOMO is nagging at you at an all time high right now…",
  "original_created_utc": 1620347550,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトでは、誰もがお金を持っていて、新しいポンプが出るたびにcryptoに投じ続けているように見えるかもしれません。\nこのサブのみんなはお金を持っているように見えるかもしれませんが、新しいポンプのたびに、他のみんなはこれらの利益を利用しています。\nあなたは、今すぐ投資するだけの資金や手段を持っていないので、座って見ているだけです。\n今、あなたは FOMOは今、過去最高にあなたを悩ませています...。",
      "title": "FOMOに抵抗しようとしているのは、あなただけではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看起来这个子上的每个人都有钱，可以不断地投向加密货币\n每一个新的泵，而其他人都在利用这些收益，而你却坐视不管。\n而你却坐视不理，因为你现在没有足够的钱或手段来投资\n现在。现在，FOMO正以前所未有的高度对你进行唠叨......",
      "title": "你不是唯一试图抵制FOMO的人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看起來這個子上的每個人都有錢，可以不斷地投向加密貨幣\n每一個新的泵，而其他人都在利用這些收益，而你卻坐視不管。\n而你卻坐視不理，因爲你現在沒有足夠的錢或手段來投資\n現在。現在，FOMO正以前所未有的高度對你進行嘮叨......",
      "title": "你不是唯一試圖抵制FOMO的人"
    }
  ],
  "title": "You are NOT the only one trying to resist FOMO",
  "created_utc": 1620365486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It may seem like everybody on this sub has money to just keep throwing at crypto every single new pump, and everyone else is capitalizing on these gains while you sit and watch because you don&#39;t have enough money or the means to invest right now. FOMO is nagging at you at an all time high right now and you&#39;re trying to figure out how to move money around to buy just a little more ETH, maybe finally get a whole 1 ETH before it gets too high.</p>\n\n<p>Well, you should know you are not the only one here who is fighting these temptations and I think it helps to hear from someone else who is also not buying more crypto right now. It seems to calm me down to realize that while there are a lot of people making more gains than me, there are thousands more who are also sitting on the sidelines, or holding just $100 of BTC, or putting in only what they can afford to lose. This is not WSB and you should not give into your FOMO or gambling-like thoughts.</p>\n\n<p>For me, I am trying to buy a house this summer. And you can probably imagine how tempting it is to have a pile of cash just sitting there to be used as a down payment not making gains. &quot;I&#39;ll just put it in for a few weeks and make juuuuust a little bit more to go towards the house.&quot; It hurst to think about what I could have made just within the last week, but what would hurt WAY more is losing our down payment by gambling it away. So for now, my extra cash will remain cash and I&#39;m doing what&#39;s best for my own family and being safe. You&#39;re not the only one on here who is &quot;missing out.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 660,
  "permalink": "/r/CryptoCurrency/comments/n6m3bi/you_are_not_the_only_one_trying_to_resist_fomo/",
  "subreddit": "CryptoCurrency",
  "id": "n6m3bi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988842
}