{
  "author": "cspr1980",
  "the_new_excerpt": "Statements from the media saying how inflation fears are kept in check due to\nlower interest rates, and how inflation causes growth stocks to fall make no\nsense.\n\nHere's why... Note: I'm not an economist, so I don't have all the details, but I\nbelieve the main idea is correct. I'd love to hear other…",
  "original_created_utc": 1615511024,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "来自媒体的声明称，由于通胀担忧如何被抑制，由于\n降低利率，以及通胀如何导致成长股的下跌，都没有让人感到意外。\n感。\n\n这就是为什么... 注：我不是一个经济学家，所以我没有所有的细节，但我...\n相信主旨是正确的。我很想听听其他...",
      "title": "2020年股市因通胀而暴涨，并将因此而继续增长。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來自媒體的聲明稱，由於通脹擔憂如何被抑制，由於\n降低利率，以及通脹如何導致成長股的下跌，都沒有讓人感到意外。\n感。\n\n這就是爲什麼... 注：我不是一個經濟學家，所以我沒有所有的細節，但我...\n相信主旨是正確的。我很想聽聽其他...",
      "title": "2020年股市因通脹而暴漲，並將因此而繼續增長。"
    }
  ],
  "title": "The stock market spiked up in 2020 due to inflation, and it will continue to grow because of it",
  "created_utc": 1615530469,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Statements from the media saying how inflation fears are kept in check due to lower interest rates, and how inflation causes growth stocks to fall make no sense.</p>\n\n<p>Here&#39;s why... Note: I&#39;m not an economist, so I don&#39;t have all the details, but I believe the main idea is correct. I&#39;d love to hear other perspectives.</p>\n\n<p>First, definition of <strong>inflation</strong> from Wikipedia:</p>\n\n<blockquote>\n<p>In economics, inflation (or less frequently, price inflation) is a general rise in the price level in an economy over a period of time. When the general price level rises, each unit of currency buys fewer goods and services; consequently, inflation reflects a reduction in the purchasing power per unit of money – a loss of real value in the medium of exchange and unit of account within the economy</p>\n</blockquote>\n\n<p>We experienced high inflation in 2020 due to LOW interest rates. There was high demand for money, but the supply of money was increased even more (M3 increased by almost 25% in 2020) due to increased debt at low interest rates. This increased <a href=\"https://en.wikipedia.org/wiki/Money_supply\">supply of money, or debt,</a> caused spike in prices of stocks, materials, real estates, etc. Items that don&#39;t get consumed more when people have more money weren&#39;t affected as much.</p>\n\n<p>Prices started to go down this year as interest rates rose. Now that interest rates seem to be kept down and more stimulus are coming, I believe there will be rise in inflation again and stock prices will grow. I don&#39;t know if it will be as much as 2020 though.</p>\n\n<p>On a side note, the stimulus and increased debt helped those in need in the short-term, but it made wealth building assets more out of reach to the poor, and at the expense of people saving cash. Unless interest rates rise and bring down prices, I believe the gap between asset owners and the poor will continue to increase, along with inflation and more debt. How long that will be sustainable, I have no idea.</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/stocks/comments/m35pky/the_stock_market_spiked_up_in_2020_due_to/",
  "subreddit": "stocks",
  "id": "m35pky",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381386
}