{
  "author": "GardinerAndrew",
  "the_new_excerpt": "I am one of the people that played the COIN IPO. I was so mad about how much\nmoney I lost I sold every position I had and cashed out my account. About 5\nminutes later when I cooled down I realized how stupid that was. There was no\nway I was going to give up trading but I triggered a PDT restriction…",
  "original_created_utc": 1620417849,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私もCOIN IPOをプレイした一人です。あまりの損失の大きさに頭にきて\n損失の大きさに頭にきて、持っていたポジションをすべて売って、口座を現金化しました。約5分後\n5分後、冷静になってみると、それがいかに愚かなことだったかがわかりました。私には\n取引をあきらめるつもりはなかったのですが、PDT制限を発動してしまいました...。",
      "title": "ロビンフッドがトレーディングに適していない理由は、あなたが思っている以上にたくさんあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是玩COIN IPO的人之一。我很生气，因为我输了很多钱\n我很生气，因为我输了很多钱，我卖掉了我的每一个头寸，并把我的账户兑现了。大约5\n分钟后，当我冷静下来时，我意识到这是多么愚蠢。我不可能\n我不可能放弃交易，但我触发了PDT限制......",
      "title": "Robinhood在交易方面是很糟糕的，原因比你想象的要多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是玩COIN IPO的人之一。我很生氣，因爲我輸了很多錢\n我很生氣，因爲我輸了很多錢，我賣掉了我的每一個頭寸，並把我的賬戶兌現了。大約5\n分鐘後，當我冷靜下來時，我意識到這是多麼愚蠢。我不可能\n我不可能放棄交易，但我觸發了PDT限制......",
      "title": "Robinhood在交易方面是很糟糕的，原因比你想象的要多。"
    }
  ],
  "title": "Robinhood is terrible for trading for more reasons then you think",
  "created_utc": 1620421749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am one of the people that played the COIN IPO. I was so mad about how much money I lost I sold every position I had and cashed out my account. About 5 minutes later when I cooled down I realized how stupid that was. There was no way I was going to give up trading but I triggered a PDT restriction with Robinhood so I deposited my funds into TD Ameritrade. Although, since leaving Robinhood I have noticed some positive changes in my portfolio. </p>\n\n<p>1) I don’t panic sell anymore. </p>\n\n<p>When you have Robinhood, they shove the charts in your face. Every move is very dramatic. A stock might only move a few cents but their charts make it look like the stock is up or down 30%. Since switching to TD I am able to let everything just sit without getting panicked. I think most money lost in the stock market is due to panic selling so if you can, don’t sell. Stocks pretty much always go up (with time) </p>\n\n<p>2) I don’t trade options anymore.</p>\n\n<p>Robinhood made it so easy to trade options. While I know people can make fortunes off options, more people lose their savings with them. I know I would get skinned alive for saying this at WSB but options are the devils lottery tickets. While I might not have huge swings, trading shares allows to have consistent gains. </p>\n\n<p>In conclusion, this is just what has worked for me. Who knows, maybe I have just been lucky these last couple weeks. Thanks for coming to my Ted talk, see you all behind Wendy’s.</p>\n</div><!-- SC_ON -->",
  "score": 331,
  "permalink": "/r/stocks/comments/n77ko5/robinhood_is_terrible_for_trading_for_more/",
  "subreddit": "stocks",
  "id": "n77ko5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995615
}