{
  "author": "Remy4409",
  "original_created_utc": 1627563628,
  "title": "Is it weird to not want to expose my baby online?",
  "created_utc": 1627572543,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My GF and I are gonna be parents in two months. I told her that I didn&#39;t want any pictures of our girl going online. She&#39;s okay with it, but doesn&#39;t understand why.</p>\n\n<p>Am I the one being weird here? I don&#39;t want every step of my kid growing up online, until she&#39;s at an age of deciding for herself what she wants to expose of her life.</p>\n\n<p>EDIT: I might post family pictures, but her face will always be hidden or blurried.</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/NoStupidQuestions/comments/otx0uy/is_it_weird_to_not_want_to_expose_my_baby_online/",
  "subreddit": "NoStupidQuestions",
  "id": "otx0uy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My GF and I are gonna be parents in two months. I told her that I didn't want\nany pictures of our girl going online. She's okay with it, but doesn't\nunderstand why.\n\nAm I the one being weird here? I don't want every step of my kid growing up\nonline, until she's at an age of deciding for herself what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のGFと私はあと2ヶ月で親になります。私は彼女に、娘の写真をネットに載せたくないと\n娘の写真をネットで公開したくないと伝えました。彼女はそれに同意していますが、その理由がわかりません。\n理由を理解していません。\n\n私はここで変なことをしているのでしょうか？自分の子供が成長していく過程をすべてネットで公開してほしくないのです。\n子供が自分で判断できる年齢になるまでは",
      "title": "自分の赤ちゃんをネットに晒したくないというのは変なことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的GF还有两个月就要做父母了。我告诉她，我不希望\n任何关于我们女儿的照片上网。她对此没有意见，但不明白为什么。\n不明白为什么。\n\n我是那个奇怪的人吗？我不希望我的孩子成长的每一步都在网上进行。\n直到她到了可以自己决定什么的年龄......",
      "title": "不想在网上曝光我的宝宝，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的GF還有兩個月就要做父母了。我告訴她，我不希望\n任何關於我們女兒的照片上網。她對此沒有意見，但不明白爲什麼。\n不明白爲什麼。\n\n我是那個奇怪的人嗎？我不希望我的孩子成長的每一步都在網上進行。\n直到她到了可以自己決定什麼的年齡......",
      "title": "不想在網上曝光我的寶寶，這很奇怪嗎？"
    }
  ]
}