{
  "author": "Dcarozza6",
  "the_new_excerpt": "I know that the basics of a hybrid involves using the electric motor at low\nspeeds, and the ICE at higher speeds. And when the car is using the ICE, it\ncharges the electric motors battery, so that it can be used again.\n\nBut how does this save fuel? A basic understanding of the first law…",
  "original_created_utc": 1620351284,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハイブリッドの基本は、低速時には電気モーターを使い、高速時にはICEを使うことだと知っています。\n低速域では電気モーターを、高速域ではICEを使うのが基本です。そして、ICEを使っているときは、電気モーターのバッテリーを充電して\n電気モーターのバッテリーを充電して、再び使えるようにします。\n\nでは、どのようにして燃料を節約するのでしょうか。第一法則の基本的な理解は...",
      "title": "プラグイン式ではないハイブリッドカーは、実際にどのようにして燃料を減らしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道混合动力的基本原理是在低速时使用电动马达，在高速时使用内燃机。\n我知道混合动力的基本原理是在低速时使用电动机，而在高速时使用内燃机。而当汽车使用内燃机时，它\n给电动机的电池充电，这样它就可以再次使用。\n\n但这是如何节省燃料的呢？对第一定律的基本理解...",
      "title": "非插电式混合动力汽车实际上如何使用更少的燃料？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道混合動力的基本原理是在低速時使用電動馬達，在高速時使用內燃機。\n我知道混合動力的基本原理是在低速時使用電動機，而在高速時使用內燃機。而當汽車使用內燃機時，它\n給電動機的電池充電，這樣它就可以再次使用。\n\n但這是如何節省燃料的呢？對第一定律的基本理解...",
      "title": "非插電式混合動力汽車實際上如何使用更少的燃料？"
    }
  ],
  "title": "How do non-plugin hybrid cars actually use less fuel?",
  "created_utc": 1620381559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that the basics of a hybrid involves using the electric motor at low speeds, and the ICE at higher speeds. And when the car is using the ICE, it charges the electric motors battery, so that it can be used again.</p>\n\n<p>But how does this save fuel? A basic understanding of the first law of thermodynamics is that energy cannot be created nor destroyed, only transferred. Wouldn’t this mean that the ICE would use <em>more</em> fuel while it is charging the electric engine, negating whatever gain it would have gotten? I feel like it would actually be counterintuitive, because the transfer isn’t likely to operate at perfect efficiency.</p>\n\n<p>Anyone have more insight into this?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/n6n82i/how_do_nonplugin_hybrid_cars_actually_use_less/",
  "subreddit": "askscience",
  "id": "n6n82i",
  "is_self": true,
  "media": null,
  "is_video": false
}