{
  "author": "RUGPULLS",
  "original_created_utc": 1637816891,
  "title": "Crypto.com card is better than you think!",
  "created_utc": 1637833319,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been using the crypto.com card for a while now, and I recently received my royal indigo card. It is the purple one, with a 3% cashback and an additional 10% stake reward for holding CRO. There is also free cashback for your spotify and netflix!</p>\n\n<p>I started with the ruby card because I was new to Crypto.com and wanted to try out their services. There was also a previous 12 percent cash back offer, which I made extensive use of! If there is no special event, the cashback is set at 2%, which is also quite high.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ipazbgzwco181.png?width=731&amp;format=png&amp;auto=webp&amp;s=8760e24c9b3ee5c8b3d448157ef16e5ece1f0f6d\">https://preview.redd.it/ipazbgzwco181.png?width=731&amp;format=png&amp;auto=webp&amp;s=8760e24c9b3ee5c8b3d448157ef16e5ece1f0f6d</a></p>\n\n<p>After using the ruby card for 3-4 months, I decided to upgrade to the next tier card because there was a 10% stake reward that paid out weekly. I will not be sorry if I upgrade, and hopefully, CRO will rise high enough for me to upgrade to icy white.</p>\n\n<p>I had previously encountered some issues with the card, but the customer support was extremely efficient and would respond to me within 15 minutes; I believe this is something that other platforms, such as Coinbase, do not have.</p>\n\n<p>Putting customer first is essential and I believe Crypto.com has nailed it. I believe other card holders have the same sentiment as I do.</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "permalink": "/r/CryptoCurrency/comments/r1omyn/cryptocom_card_is_better_than_you_think/",
  "subreddit": "CryptoCurrency",
  "id": "r1omyn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been using the crypto.com card for a while now, and I recently received my\nroyal indigo card. It is the purple one, with a 3% cashback and an additional\n10% stake reward for holding CRO. There is also free cashback for your spotify\nand netflix!\n\nI started with the ruby card because I was new to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前からcrypto.comのカードを使っていましたが、先日、ロイヤルインディゴのカードが届きました。\nroyal indigoカードが届きました。それは紫のもので、3％のキャッシュバックと、さらに\nCROを保有していると10％のステイク報酬があります。また、spotifyやnetflixの無料キャッシュバックもあります。\nやNetflixの無料キャッシュバックもあります。\n\n私がルビーカードで始めたのは、初心者だったから...。",
      "title": "Crypto.comカードはあなたが思っている以上に優れています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经使用crypto.com卡有一段时间了，最近我收到了我的\n皇家靛蓝卡。它是紫色的，有3%的现金返还和一个额外的\n持有CRO的10%股权奖励。还有免费的现金返还给你的Spotify\n和Netflix!\n\n我从红宝石卡开始，因为我是新手。",
      "title": "Crypto.com卡比你想象的要好!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經使用crypto.com卡有一段時間了，最近我收到了我的\n皇家靛藍卡。它是紫色的，有3%的現金返還和一個額外的\n持有CRO的10%股權獎勵。還有免費的現金返還給你的Spotify\n和Netflix!\n\n我從紅寶石卡開始，因爲我是新手。",
      "title": "Crypto.com卡比你想象的要好!"
    }
  ]
}