{
  "author": "trapsandwich",
  "the_new_excerpt": "Resolution: I proved ownership of the wallet and provided KYC to tomo to receive\nthe tokens. Ended up talking with the tomo project lead quite a bit and I don't\nthink they acted maliciously or deceptively and I think they are good people and\ntrustworthy. The internet is full of scammers, crypto…",
  "original_created_utc": 1614794697,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "决议： 我证明了钱包的所有权，并向tomo提供了KYC，以获得。\n的代币。最后和tomo项目负责人聊了不少，我不。\n我认为他们的行为是恶意的或欺骗性的，而我认为他们是好人，而且...。\n值得信赖。网络上充斥着骗子、加密...",
      "title": "TOMO走过来了，我觉得他们没有恶意，最终我觉得他们是好人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "決議： 我證明了錢包的所有權，並向tomo提供了KYC，以獲得。\n的代幣。最後和tomo項目負責人聊了不少，我不。\n我認爲他們的行爲是惡意的或欺騙性的，而我認爲他們是好人，而且...。\n值得信賴。網絡上充斥着騙子、加密...",
      "title": "TOMO走過來了，我覺得他們沒有惡意，最終我覺得他們是好人。"
    }
  ],
  "title": "TOMO came through, I don't think they meant any harm and ultimately I think they are good people",
  "created_utc": 1614828802,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Resolution: I proved ownership of the wallet and provided KYC to tomo to receive the tokens. Ended up talking with the tomo project lead quite a bit and I don&#39;t think they acted maliciously or deceptively and I think they are good people and trustworthy. The internet is full of scammers, crypto especially, and he had a right to be suspicious. I deleted the old thread on my own accord because they fulfilled their end and I dont think it was fair to continue harming their reputation. And a lot of the people in the other thread accused me of scamming and sent me some nasty messages, I really didn&#39;t feel good about making people feel that way.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Thank you to everyone who supported my endeavor and helped me with visibility. Thank you for all the kindness. I was simply overwhelmed by the magnitude of the response, thank you. I hate that I had to do this, I don&#39;t feel good about it, and I wish things were handled differently on both sides. That said, I&#39;m in very poor health with a poor outlook and couldn&#39;t afford to wait. He even commented how unwell I looked in my KYC photos in a non-insulting way, but I&#39;m well aware that I look like shit so I got a laugh out of it. </p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>To everyone who thought I was scamming: why didn&#39;t i post donation links or ask for more? why would I waste this entire situation on such a specific circumstances and not aim for a larger sum of money? Doesn&#39;t make sense to me. Regardless, I wasn&#39;t. Thanks for the negativity though, it absolutely disgusted me to be thought of that way. It&#39;s extremely difficult for me to stay positive because of my rapidly deteriorating health, whats your excuse?</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/lx089t/tomo_came_through_i_dont_think_they_meant_any/",
  "subreddit": "CryptoCurrency",
  "id": "lx089t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937739398
}