{
  "author": "cryptonalyst",
  "the_new_excerpt": "..(pretty sure this meeting wasn’t planned in one day)\n\nOnly a few days before this meeting, the market falls drastically and there is\nblood on the street. But suddenly, just one day after this meet, markets climb\nup like crazy numbers, even unheard by many people, and the public is openly\ntold…",
  "original_created_utc": 1621899847,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "...(この会議が1日で計画されたものではないことは確かです)\n\nこの会議のわずか数日前に、市場は急激に下落し、通りには血が流れている。\n血が流れている。しかし、この会議のわずか1日後、突然、市場は人々が聞いたこともないような異常な数字で上昇した。\nこの会議のわずか1日後に、市場は突如として、多くの人が聞いたこともないような異常な数字で上昇し、世間には公然と\n伝えられた...",
      "title": "非中央集権に対して、実に危険な前例が作られようとしています。整理すると、公の場で常に言葉を交わしている2人の億万長者が、北米中のビットコイン・マイナーを集めて、いわゆるビットコイン・カウンシルを結成するための会議を立ち上げ...(続きを読む)..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "...（很确定这次会议不是在一天内计划的）。\n\n就在这次会议的前几天，市场急剧下跌，大街上出现了\n鲜血横流。但突然间，就在这次会议之后的一天，市场以疯狂的数字攀升\n攀升，甚至很多人都没有听说过，公众被公开地告知\n被告知...",
      "title": "一个反对去中心化的真正危险的先例正在被树立。让我搞清楚，两个亿万富翁，经常在公共论坛上打口水仗，与北美的比特币矿工召开会议，成立所谓的比特币理事会......（完）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "...（很確定這次會議不是在一天內計劃的）。\n\n就在這次會議的前幾天，市場急劇下跌，大街上出現了\n鮮血橫流。但突然間，就在這次會議之後的一天，市場以瘋狂的數字攀升\n攀升，甚至很多人都沒有聽說過，公衆被公開地告知\n被告知...",
      "title": "一個反對去中心化的真正危險的先例正在被樹立。讓我搞清楚，兩個億萬富翁，經常在公共論壇上打口水仗，與北美的比特幣礦工召開會議，成立所謂的比特幣理事會......（完）。"
    }
  ],
  "title": "A truly dangerous precedent against decentralisation is being set. Let me get this straight, two billionaires, who constantly have war of words on a public forum, set up a meeting with Bitcoin miners across North America to form the so called Bitcoin council...(contd)...",
  "created_utc": 1621929264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>..(pretty sure this meeting wasn’t planned in one day)</p>\n\n<p>Only a few days before this meeting, the market falls drastically and there is blood on the street. But suddenly, just one day after this meet, markets climb up like crazy numbers, even unheard by many people, and the public is openly told about this meeting. Why not tell about this news on the same day? Why not stop the bloodbath if they are so in support of crypto and decentralisation? Were they upto something, say, buying the dip? To make the market in their favour, make it easier to manipulate it? Also a Goldman Sachs news was thrown in.</p>\n\n<p>No manipulation at all here folks. This is truly dangerous for decentralisation. Stop trusting these people and institutions.</p>\n\n<p>Edit: Here are the tweets that I am referring to::</p>\n\n<ol>\n<li><p><a href=\"https://twitter.com/elonmusk/status/1396914548167233537?s=21\">Musk Tweet</a> </p></li>\n<li><p><a href=\"https://twitter.com/michael_saylor/status/1396915801492439044?s=21\">Saylor Tweet</a></p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 1045,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/kXxjFTs3CwOxNLec41tqSTPHbxI-Nc9ai9zNDX1-WGU.jpg?auto=webp&s=56346bb1fd19d3b9cde7fc69b6494cd4998b85b0",
          "width": 140,
          "height": 140
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/kXxjFTs3CwOxNLec41tqSTPHbxI-Nc9ai9zNDX1-WGU.jpg?width=108&crop=smart&auto=webp&s=bdca6c396a261c22a7369dfb30c2611e68b1e1aa",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "_iMw3uBuZq4d-IurKOEcfy1Tx_qSJ1Z0_yapiJrjiRs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/nkbqys/a_truly_dangerous_precedent_against/",
  "subreddit": "CryptoCurrency",
  "id": "nkbqys",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387092
}