{
  "author": "Equivalent-Sweet-559",
  "original_created_utc": 1626974160,
  "title": "Celer officially launched the mainnet version of cBridge",
  "created_utc": 1626985864,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now that Celer Network has launched the mainnet version of cBridge, there’s going to be more progress especially when it comes to the transfer of tokens.</p>\n\n<p>This multi-chain network will give its users ability to swap assets across multiple blockchains with ease. This will definitely help DeFi users, who can influence technology to manage transfer and liquidity costs when moving their tokens. These same users were lured to the Celer Network because of the reduced transaction costs.</p>\n\n<p>With this recent development, a lot of people will be able to build, operate, and utilize highly scalable decentralized applications through upheavals in off-chain scaling techniques and incentive-aligned cryptoeconomics.</p>\n\n<p>What’s really great about this mainnet release is the fact that it is out of the box since it includes both node software and a user interface, which is something everyone needs to look forward to now that it is out there.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/opiea1/celer_officially_launched_the_mainnet_version_of/",
  "subreddit": "CryptoCurrency",
  "id": "opiea1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Now that Celer Network has launched the mainnet version of cBridge, there’s\ngoing to be more progress especially when it comes to the transfer of tokens.\n\nThis multi-chain network will give its users ability to swap assets across\nmultiple blockchains with ease. This will definitely help DeFi users,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Celer NetworkがcBridgeのメインネット版をローンチしたことで、特にトークンの送金に関しては、さらなる進展が期待されます。\nトークンの転送に関しては、より一層の進展が期待されます。\n\nこのマルチチェーンネットワークでは、ユーザーは複数のブロックチェーン間で資産を交換することができます。\n複数のブロックチェーン間で資産を交換することができるようになります。これは間違いなく、DeFiのユーザーを助けることになるでしょう...",
      "title": "Celer社がcBridgeのメインネット版を正式に発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，Celer Network已经推出了cBridge的主网版本。\n将会有更多的进展，特别是当涉及到代币的转移时。\n\n这个多链网络将为其用户提供在多个区块链上交换资产的能力。\n这个多链网络将使其用户能够轻松地在多个区块链上交换资产。这无疑将帮助DeFi用户，...",
      "title": "Celer正式推出cBridge的主网版本"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，Celer Network已經推出了cBridge的主網版本。\n將會有更多的進展，特別是當涉及到代幣的轉移時。\n\n這個多鏈網絡將爲其用戶提供在多個區塊鏈上交換資產的能力。\n這個多鏈網絡將使其用戶能夠輕鬆地在多個區塊鏈上交換資產。這無疑將幫助DeFi用戶，...",
      "title": "Celer正式推出cBridge的主網版本"
    }
  ]
}