{
  "author": "Marathons_too_short",
  "original_created_utc": 1644690838,
  "title": "I apologise. Feel like at my age I really should know this….",
  "created_utc": 1644749240,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;But what on earth are Russia and Ukraine fighting (or are about to fight) about? The news keeps telling me where troops are waiting etc but I don’t seem to be seeing why they’re arguing??&lt;/p&gt;\n\n&lt;p&gt;Edit- bloody love Reddit. Thank you for not making me feel silly and explaining things in a basic enough way that I can understand:)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/sqxz9g/i_apologise_feel_like_at_my_age_i_really_should/",
  "subreddit": "NoStupidQuestions",
  "id": "sqxz9g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "But what on earth are Russia and Ukraine fighting (or are about to fight) about?\nThe news keeps telling me where troops are waiting etc but I don’t seem to be\nseeing why they’re arguing??\n\nEdit- bloody love Reddit. Thank you for not making me feel silly and explaining\nthings in a basic enough way…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しかし、ロシアとウクライナはいったい何を争っている（あるいは争おうとしている）のだろうか。\nニュースでは軍隊が待機している場所などを伝え続けているが、私にはそうは見えない。\nなぜ口論になるのか、わかりますか？\n\nEdit-Redditが大好きです。私を馬鹿にせず、説明してくれることに感謝します。\n基本的なことですが...。",
      "title": "申し訳ございませんでした。この歳になると、本当は知っておくべきなんだろうけど......。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "但是，俄罗斯和乌克兰究竟在争夺（或即将争夺）什么？\n新闻一直在告诉我军队在哪里等待等，但我似乎没有看到他们为什么要争吵？\n但我似乎没有看到他们为什么要争吵？\n\n编辑--该死的爱Reddit。谢谢你没有让我觉得自己很傻，并以足够基本的方式解释了\n解释事情的基本方式...",
      "title": "我表示歉意。感觉在我这个年龄，我真的应该知道这个....。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "但是，俄羅斯和烏克蘭究竟在爭奪（或即將爭奪）什麼？\n新聞一直在告訴我軍隊在哪裏等待等，但我似乎沒有看到他們爲什麼要爭吵？\n但我似乎沒有看到他們爲什麼要爭吵？\n\n編輯--該死的愛Reddit。謝謝你沒有讓我覺得自己很傻，並以足夠基本的方式解釋了\n解釋事情的基本方式...",
      "title": "我表示歉意。感覺在我這個年齡，我真的應該知道這個....。"
    }
  ]
}