{
  "author": "longi11",
  "the_new_excerpt": "Corona`s main economic impact is supply chain disruptions that are\nunprecedented. Before Covid supply chain was running smooth as a glove, think of\nit as a highway full of cars flowing at exact same speed and spaced equally.\nThis supply chain was being perfected for over a decade. And then this…",
  "original_created_utc": 1613312363,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "科罗娜的主要经济影响是供应链的中断，这是它的主要原因。\n前所未有。之前科维德供应链运行得如履平地，想一想\n它就像一条高速公路，满满的汽车以完全相同的速度和相等的间隔流动。\n这条供应链被完善了十几年。然后这个...",
      "title": "为什么我认为AMD很快就会大涨？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "科羅娜的主要經濟影響是供應鏈的中斷，這是它的主要原因。\n前所未有。之前科維德供應鏈運行得如履平地，想一想\n它就像一條高速公路，滿滿的汽車以完全相同的速度和相等的間隔流動。\n這條供應鏈被完善了十幾年。然後這個...",
      "title": "爲什麼我認爲AMD很快就會大漲？"
    }
  ],
  "title": "Why I think AMD is going up a lot soon",
  "created_utc": 1613345080,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Corona`s main economic impact is supply chain disruptions that are unprecedented. Before Covid supply chain was running smooth as a glove, think of it as a highway full of cars flowing at exact same speed and spaced equally. This supply chain was being perfected for over a decade. And then this shitstorm happened. The highway is clogged, ships are standing loaded with crap they cannot effectively unload quick enough, there aren`t enough ships to move products that are needed. Including basic materials for industries and intermediate components to make a final product.</p>\n\n<p>For those who don`t know, there is an absolute chip shortage in the market right now. Spanning from AMD/NVDA CPUs and GPUs, to auto chips, to new consoles, and any kind of electronics. Even AAPL will have sales issues this quarter caused by the chip shortage.</p>\n\n<p>The main chip producer TSMC is ramping up CAPEX to $28 billion, including $12 bn for their US plant.</p>\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2021-01-14/tsmc-profit-beats-expectations-as-chipmaker-widens-tech-lead\">https://www.bloomberg.com/news/articles/2021-01-14/tsmc-profit-beats-expectations-as-chipmaker-widens-tech-lead</a> </p>\n\n<p>The perfect storm is brewing for NVDA and AMD to gain enormously from this market, but in my opinion AMD will end up with upper hand, let me explain.</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Back in 2017/2018 year old GPUs were selling over on Amazon and elsewhere for double their MSRP. These were old graphic cards! their price should have depreciated over time, but didn`t. Why? Cause of B T C. Miners were buying that shit by bulks. Guess what? We`re at the exact same situation right now, except that price of that thingy is now $50k! and with new cards being more cost effective you wouldn`t be able to buy ANY right now even if you wanted it to simply upgrade your PC and play something. As a matter of fact try to buy GTX 10xx or RTX 20xx gen on Amazon, there are NONE! So its not only the latest gen that`s unavailable, its ALL of them. And CPUs have the exact same problem, which wasn`t so bad in 2018. And soon you might find it impossible to buy even any laptop having latest chip: <a href=\"https://markets.businessinsider.com/news/stocks/chinese-gpu-miners-reportedly-bulk-buying-nvidia-laptops-to-mine-ether-9787156\">https://markets.businessinsider.com/news/stocks/chinese-gpu-miners-reportedly-bulk-buying-nvidia-laptops-to-mine-ether-9787156</a></li>\n<li>Not long ago NVDA announced $40 bn acquisition of ARM which would ensure they have access to state of the art IP which would make them future chip behemoth, and not surprisingly the largest companies in the world are now lobbying against that <a href=\"https://www.theverge.com/2021/2/12/22280262/qualcomm-microsoft-google-nvidia-arm-acquisition-investigations-concerns\">https://www.theverge.com/2021/2/12/22280262/qualcomm-microsoft-google-nvidia-arm-acquisition-investigations-concerns</a> . With this in mind, its becoming increasingly likely the acquisition wont go through. On the other hand, AMD replied with the acquisition of XLNX which seems wouldn`t be such an issue considering AMD is way smaller than NVDA or INTC.</li>\n<li>AMD and QCOM are actively lobbying US gov to address the issue, which they will. What to expect? Quite likely to remove previous trade policies regarding chips - resulting in easier access and higher/cheaper volume of chips being produced overseas. Which would mean AMD can ramp up production and meet the huge current demand of data centers and whoever needs their GPU. <a href=\"https://www.bloomberg.com/news/articles/2021-02-11/biden-team-pledges-aggressive-steps-to-address-chip-shortage\">https://www.bloomberg.com/news/articles/2021-02-11/biden-team-pledges-aggressive-steps-to-address-chip-shortage</a> . </li>\n<li>Price action - stocks follow certain pattern. They kinda wobble within some range for long period of time, 6-18 months, this is where a lot of accumulation by big players happen, and fundamentals kind of crystalize. Once the conditions are right, the stock can shoot 50% in a span of a month and then hover on new level for considerable time. Look at the chart of TSLA 2015-2019, NVDA numerous times, AMZN, GOOG, etc. Right now, NVDA is up already 20% in the last month. I believe the market will look from NVDA to AMD very soon, given points 2-3 and major holders wont be willing to sell for current price.</li>\n</ol>\n\n<p>To recap what is the perfect storm. In 2017/18 chip shortage was caused mainly by A. the thing we dont mention here, right now its also B. new consoles cant be produced fast enough, C. supply chain issues which might be resolved soon, C. simply way bigger improvement in new CPUs/GPUs hence new upgrade cycle coupled with corporate upgrade cycle due to COVID </p>\n\n<p>I have my retarded position 80x 150c mid June</p>\n</div><!-- SC_ON -->",
  "score": 1990,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/MQHd8-XoSIr5QuBWKKLwLKazyGmRfSgj7i64AlKXg64.jpg?auto=webp&s=08ebf3747291314299e5c4a79b00dbe4a2c3ca99",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/MQHd8-XoSIr5QuBWKKLwLKazyGmRfSgj7i64AlKXg64.jpg?width=108&crop=smart&auto=webp&s=bb13601e6c23722d1acfe20167d03e3560c68d1e",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/MQHd8-XoSIr5QuBWKKLwLKazyGmRfSgj7i64AlKXg64.jpg?width=216&crop=smart&auto=webp&s=59446c8b67660027a035c7bebc415953aa751a84",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/MQHd8-XoSIr5QuBWKKLwLKazyGmRfSgj7i64AlKXg64.jpg?width=320&crop=smart&auto=webp&s=cd2b3f4ba725e531d0811652e1be515bd2c8db88",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/MQHd8-XoSIr5QuBWKKLwLKazyGmRfSgj7i64AlKXg64.jpg?width=640&crop=smart&auto=webp&s=cdc4c599997a41345ed1d74f0c6cd259163261fa",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/MQHd8-XoSIr5QuBWKKLwLKazyGmRfSgj7i64AlKXg64.jpg?width=960&crop=smart&auto=webp&s=41fd4df8c252315c23a2177ddd0d411b02fd674b",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/MQHd8-XoSIr5QuBWKKLwLKazyGmRfSgj7i64AlKXg64.jpg?width=1080&crop=smart&auto=webp&s=53a185b73dfc8e27e8d917fe6ff4fd50cfd78596",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "xNr94jQRpHq2izYoT0XIOOxp3tIZ4a0LzQKwQjyo_Yo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/ljp713/why_i_think_amd_is_going_up_a_lot_soon/",
  "subreddit": "wallstreetbets",
  "id": "ljp713",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633143
}