{
  "author": "oodlepog",
  "original_created_utc": 1650197042,
  "title": "should I reconsider my reductionist beliefs?",
  "created_utc": 1650280846,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In high school, exposure to the idea that chemistry and physics produce complex phenomena in biology has basically produced in me a belief that everything can be reduced to the level of chemistry and physics. &lt;/p&gt;\n\n&lt;p&gt;As I learn more about the brain through formal study, this view has conveniently, conspicuously remained unchallenged, either because it&amp;#39;s correct or because too many scientists agree and so work from it, I suppose. &lt;/p&gt;\n\n&lt;p&gt;What philosophy of science or widely-accepted foundational works in philosophy may I have missed that might challenge my view?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/u5lo9v/should_i_reconsider_my_reductionist_beliefs/",
  "subreddit": "askphilosophy",
  "id": "u5lo9v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In high school, exposure to the idea that chemistry and physics produce complex\nphenomena in biology has basically produced in me a belief that everything can\nbe reduced to the level of chemistry and physics.\n\nAs I learn more about the brain through formal study, this view has\nconveniently,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "高校時代、化学や物理が複雑なものを作り出すという考え方に触れ\n生物学的な現象は、基本的に、すべてのことが可能であるという信念が私の中に生まれました。\n化学や物理のレベルに還元される。\n\n正式な研究を通して脳について学ぶにつれ、この見方は\n都合よく、...",
      "title": "還元主義的な信念を見直すべき？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在高中时，接触到化学和物理学产生复杂的生物现象的想法\n现象，基本上使我产生了一种信念，即一切都可以\n归结为化学和物理学的水平。\n\n随着我通过正式学习对大脑有了更多的了解，这种观点已经\n很方便，...",
      "title": "我应该重新考虑我的还原论信仰吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在高中時，接觸到化學和物理學產生複雜的生物現象的想法\n現象，基本上使我產生了一種信念，即一切都可以\n歸結爲化學和物理學的水平。\n\n隨着我通過正式學習對大腦有了更多的瞭解，這種觀點已經\n很方便，...",
      "title": "我應該重新考慮我的還原論信仰嗎？"
    }
  ]
}