{
  "author": "Many_Scratch2269",
  "original_created_utc": 1638870781,
  "title": "The worst feeling is when you have no more fiat to buy the dips right after a crash",
  "created_utc": 1638901936,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Buying after the market just crashed is an amazing way to get Crypto for insanely cheap. Unfortunately, the worst feeling is when you can&amp;#39;t buy these dips due to not having enough FIAT. You watch coins selling for a bargain and you cant get in on the action. Yeah, you will recover the losses you made from the crash eventually, but dips are very rare, and getting in one of those is probably going to give you insane returns in the future.&lt;/p&gt;\n\n&lt;p&gt;The recent crash had left many Cryptocurrencies in a massive discount. Coins like Bitcoin and Ethereum were at their lowest since late September. Buying in that crash was literally the equivalent of DCAing for the past year.&lt;/p&gt;\n\n&lt;p&gt;TLDR: Make sure you don&amp;#39;t get into the situation some of us went into. Always have some extra amount of money sitting in stablecoins with high interest rates. It is going to be extremely beneficial for you when you have money ready to buy Crypto at bargain rates in the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/ravnou/the_worst_feeling_is_when_you_have_no_more_fiat/",
  "subreddit": "CryptoCurrency",
  "id": "ravnou",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Buying after the market just crashed is an amazing way to get Crypto for\ninsanely cheap. Unfortunately, the worst feeling is when you can't buy these\ndips due to not having enough FIAT. You watch coins selling for a bargain and\nyou cant get in on the action. Yeah, you will recover the losses you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場が暴落した後に買うのは、Cryptoを手に入れるための素晴らしい方法です。\nめちゃくちゃ安い。残念なことに、最悪の気分は、このような\n十分な資金がないために、ディップス。バーゲンで売られているコインを見ることになりますが\nを、手に入れることができません。そう、あなたは失ったものを取り戻すことができるのです...",
      "title": "暴落直後のディップを買うためのフィアットが無くなった時が一番気持ち悪い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在市场刚刚崩溃后购买是一个惊人的方式，可以以极低的价格获得加密货币。\n非常便宜的方式。不幸的是，最糟糕的感觉是当你不能买到这些\n跌，因为没有足够的FIAT。你看着钱币以低廉的价格出售，而\n你却无法参与其中。是的，你会挽回你的损失。",
      "title": "最糟糕的感觉是，当你没有更多的法币来购买崩盘后的跌价。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在市場剛剛崩潰後購買是一個驚人的方式，可以以極低的價格獲得加密貨幣。\n非常便宜的方式。不幸的是，最糟糕的感覺是當你不能買到這些\n跌，因爲沒有足夠的FIAT。你看着錢幣以低廉的價格出售，而\n你卻無法參與其中。是的，你會挽回你的損失。",
      "title": "最糟糕的感覺是，當你沒有更多的法幣來購買崩盤後的跌價。"
    }
  ]
}