{
  "author": "SpeedBoostTorchic",
  "original_created_utc": 1630598356,
  "title": "Did any historical armies employ shamans, sorcerers, or other magic-users on the battlefield to actively try and harness supernatural forces to their advantage?",
  "created_utc": 1630620795,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am well aware that asking such people to divine the future, bless soldiers before a battle, or pray for victory while safely away from the fighting were common practices in many cultures of the world. (And no, I&#39;m not asking if magic is real. :P )</p>\n\n<p>However, I am <em>specifically</em> curious if there are any good examples of armies deploying dedicated magic-users <strong>on the ground, in the battlefield</strong>, in an attempt to use supernatural forces <strong>in real time</strong> against their enemies.</p>\n\n<p>In my searches prior to making this post, this is what I was able to find:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>In the <a href=\"https://en.wikipedia.org/wiki/Epic_of_Sundiata\">Epic of Sundiata</a>, a part of Malinke oral history which tells the story of the Mali empire&#39;s founding, both the hero <a href=\"https://en.wikipedia.org/wiki/Sundiata_Keita\">Sundiata Keita</a> and his enemy, the Sorcerer-King <a href=\"https://en.wikipedia.org/wiki/Soumaoro_Kant%C3%A9\">Soumaoro Kanté</a> are described as employing sorcerers on the battlefield. Soumaoro Kanté himself was also said to be performing evil magic.  </p>\n\n<p>About 8 months ago, <a href=\"https://www.reddit.com/r/AskHistorians/comments/kt3mu7/battles_in_mesoamerica_often_used_religious/\">a post on this sub</a> claimed deploying battlefield sorcerers (called &quot;Tlatlacateculo &quot; or &quot;Owl Men&quot;) was a common practice among Mesoamerican tribes, and that they had even been sent against Cortes by the Aztecs. However, the <a href=\"https://www.reddit.com/r/AskHistorians/comments/kt3mu7/battles_in_mesoamerica_often_used_religious/gikxwob?utm_source=share&amp;utm_medium=web2x&amp;context=3\">top commenter</a> indicated that our knowledge about the <em>Owl Men</em> is mostly speculative at this point. I, personally, had trouble finding good, English-language sources about them on Google.  </p>\n\n<p>One result on Google books, <a href=\"https://books.google.com/books?id=ORvUAAAAQBAJ&amp;pg=PT80&amp;lpg=PT80#v=onepage&amp;q&amp;f=false\">Shamans of the Foye Tree</a>, briefly describes <a href=\"https://en.wikipedia.org/wiki/Mapuche\">Mapuche</a> tribes as deploying shamans (called <em>Machi Weye</em>) alongside warriors to the battlefield at the end of Ch. 5. The <em>Machi Weye</em> were tasked with performing &quot;spiritual warfare&quot; from the sidelines, piercing themselves and using their own blood to call down spirits to protect their warriors.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>Obviously the first two results aren&#39;t the most reliable, and although the third result seems legit to me, I have no idea if a professional would agree.</p>\n\n<p>So I&#39;m kicking the question to you, <a href=\"/r/AskHistorians\">r/AskHistorians</a>! Find any magic-users in your armies?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pgkqs6/did_any_historical_armies_employ_shamans/",
  "subreddit": "AskHistorians",
  "id": "pgkqs6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am well aware that asking such people to divine the future, bless soldiers\nbefore a battle, or pray for victory while safely away from the fighting were\ncommon practices in many cultures of the world. (And no, I'm not asking if magic\nis real. :P )\n\nHowever, I am specifically curious if there are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そのような人たちに、未来を占ってもらったり、戦いの前に兵士を祝福してもらったり、戦いから離れた場所で勝利を祈ってもらったりすることが\n戦いの前に兵士を祝福したり、戦いから離れて安全な場所で勝利を祈ったりすることが\n世界の多くの文化では、このような人々に未来を占ってもらったり、戦いの前に兵士を祝福してもらったり、戦いから離れて安全な場所で勝利を祈ったりすることが一般的でした。(魔法があるかどうかを聞いているのではありません。\nP）。)\n\nしかし、私が特に興味を持っているのは、そのようなことが...",
      "title": "歴史上の軍隊で、シャーマンや魔術師などの魔法使いを戦場で雇い、超自然的な力を積極的に利用しようとしたところはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很清楚，要求这样的人占卜未来，在战斗前为士兵祈福\n或在远离战场的情况下为胜利祈祷，是世界上许多文化中的常见做法。\n在世界的许多文化中都是常见的做法。(不，我不是在问魔法是否真实。\n是真的。 :P)\n\n然而，我特别好奇的是，是否有...",
      "title": "历史上是否有军队在战场上雇佣萨满、巫师或其他使用魔法的人，积极尝试利用超自然的力量为他们带来好处？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很清楚，要求這樣的人占卜未來，在戰鬥前爲士兵祈福\n或在遠離戰場的情況下爲勝利祈禱，是世界上許多文化中的常見做法。\n在世界的許多文化中都是常見的做法。(不，我不是在問魔法是否真實。\n是真的。 :P)\n\n然而，我特別好奇的是，是否有...",
      "title": "歷史上是否有軍隊在戰場上僱傭薩滿、巫師或其他使用魔法的人，積極嘗試利用超自然的力量爲他們帶來好處？"
    }
  ]
}