{
  "author": "PUBLICLY-SHARED-ACC",
  "the_new_excerpt": "Example: For the weeks leading up to and around Halloween, there was an almost\nelectric energy in the air, I could smell the changing of the seasons, see the\nleaves changing color, all the spooky things on TV, Halloween decorations,\nseeing the entire neighborhood completely decked out, with…",
  "original_created_utc": 1616915892,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "例子: 万圣节前后的几个星期里，几乎有一个星期\n空气中的电能，我可以闻到四季的变化，看到了空气中的电能\n树叶变色，电视上所有的诡异事物，万圣节的装饰。\n看到整个社区 完全装饰了，与... ...",
      "title": "还有人小时候对每个节日都有强烈而独特的 \"感觉 \"吗？平安夜的 \"感觉\"、万圣节之夜的感觉等等）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例子: 萬聖節前後的幾個星期裏，幾乎有一個星期\n空氣中的電能，我可以聞到四季的變化，看到了空氣中的電能\n樹葉變色，電視上所有的詭異事物，萬聖節的裝飾。\n看到整個社區 完全裝飾了，與... ...",
      "title": "還有人小時候對每個節日都有強烈而獨特的 \"感覺 \"嗎？平安夜的 \"感覺\"、萬聖節之夜的感覺等等）。"
    }
  ],
  "title": "Did anyone else get intense and unique \"Feelings\" for each Holiday when they were a kid? (The \"feeling\" of Christmas Eve, the feeling of Halloween night, etc.)",
  "created_utc": 1616951080,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Example: For the weeks leading up to and around Halloween, there was an almost electric energy in the air, I could smell the changing of the seasons, see the leaves changing color, all the spooky things on TV, Halloween decorations, seeing the entire neighborhood completely decked out, with neighbors really going all out. Do neighborhoods like that still exist?</p>\n\n<p>Alternatiavely, for Christmas,  I would get an entirely different emotion / feeling entirely that I can only describe as the feeling of &quot;Christmas&quot; time for weeks before an after. Both excited, but calm, cozy and just so happy. I knew I would get to see all my cousins, aunts, uncles, grandmas &amp; grandpas. The cold weather, the snow, the Christmas lights glow bouncing off the snow at night. Almost each and every house decorated beautifully, with gorgeous trees in every window. People getting cozy and enjoying what nature threw at them. Waking up to see snow falling. I used to get such immense amounts of joy from things like this. I know this all still exists, but it just doesn&#39;t seem to be anywhere near the same as it used to be. I grew up in the 90s, and my parents often tell me it was even better in the 60s, 70s, &amp; 80s. What was your experience like?</p>\n\n<p>Did you get unique feelings or moods around each of the holidays when you were a kid, and feel them so much more strongly?  I still get hints of them and memories flash that will bring it back, but it&#39;s just not the same. Anyone else?</p>\n</div><!-- SC_ON -->",
  "score": 141,
  "permalink": "/r/NoStupidQuestions/comments/mewmrb/did_anyone_else_get_intense_and_unique_feelings/",
  "subreddit": "NoStupidQuestions",
  "id": "mewmrb",
  "is_self": true,
  "media": null,
  "is_video": false
}