{
  "author": "floatable_shark",
  "original_created_utc": 1625326427,
  "title": "How much of North American indigenous culture was destroyed? Are there any groups that survived with their culture totally intact?",
  "created_utc": 1625385466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve heard of tribes where none of the young generations learned to speak their native languages and had to relearn them. In parts of Canada there&#39;s native languages written on the stopsigns, are there actually people who have that as their only readable language? Are most tribes trying to fill in the holes in their knowledge about their own cultures or histories or are some of their cultures “whole&quot;? So many of questions about this</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/od0aee/how_much_of_north_american_indigenous_culture_was/",
  "subreddit": "TrueAskReddit",
  "id": "od0aee",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've heard of tribes where none of the young generations learned to speak their\nnative languages and had to relearn them. In parts of Canada there's native\nlanguages written on the stopsigns, are there actually people who have that as\ntheir only readable language? Are most tribes trying to fill in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "若い世代が誰も母国語を習得しておらず、再習得を余儀なくされた部族の話を聞いたことがあります。\n母国語を学び直さなければなりませんでした。カナダの一部では、標識に母国語が書かれています。\nカナダの一部の地域では、ストップサインに母国語が書かれていますが、それが唯一の読み物になっている人は実際にいますか？\n読むことができる唯一の言語として持っている人たちはいるのでしょうか？多くの部族は、このような状況を埋めようとしているのでしょうか？",
      "title": "北米の先住民族の文化はどれくらい破壊されたのでしょうか？文化を完全に保ったまま生き残ったグループはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听说有些部落的年轻一代没有人学会说他们的母语，不得不重新学习。\n的土著语言，不得不重新学习。在加拿大的部分地区，有的地方把母语写在停车标志上。\n在加拿大部分地区，有土著语言写在路标上，是否真的有人把这种语言作为他们唯一可读的语言？\n他们唯一可读的语言？大多数部落是否在努力填补...",
      "title": "北美土著文化有多少被破坏了？是否有任何群体在其文化完全完好的情况下幸存下来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽說有些部落的年輕一代沒有人學會說他們的母語，不得不重新學習。\n的土著語言，不得不重新學習。在加拿大的部分地區，有的地方把母語寫在停車標誌上。\n在加拿大部分地區，有土著語言寫在路標上，是否真的有人把這種語言作爲他們唯一可讀的語言？\n他們唯一可讀的語言？大多數部落是否在努力填補...",
      "title": "北美土著文化有多少被破壞了？是否有任何羣體在其文化完全完好的情況下倖存下來？"
    }
  ]
}