{
  "author": "One_2_Three",
  "original_created_utc": 1629168147,
  "title": "Just found out my wife is slowly buying BTC!",
  "created_utc": 1629203800,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few week ago I helped her put a small but decent amount in Bitcoin.  I showed her how the e-transfers work, to buy and send to her wallet.  She has been buying $30-$50 worth here and there.  She does not even check the price (the balls on her!) nor does she know what the price is (a power I need to learn). She showed me her wallet transactions and sure enough she’s stacking sats!</p>\n\n<p>Should I marry her?  I was impressed to say the least.</p>\n\n<p>Edit:  you are all are awesome, I expected no less.  Lol.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/Bitcoin/comments/p5v3ji/just_found_out_my_wife_is_slowly_buying_btc/",
  "subreddit": "Bitcoin",
  "id": "p5v3ji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A few week ago I helped her put a small but decent amount in Bitcoin. I showed\nher how the e-transfers work, to buy and send to her wallet. She has been buying\n$30-$50 worth here and there. She does not even check the price (the balls on\nher!) nor does she know what the price is (a power I need to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数週間前、私は彼女が少額だがそこそこの額をビットコインに預けるのを手伝った。私は彼女に\n購入して自分のウォレットに送るという電子送金の仕組みを教えました。彼女は30～50ドル分をあちこちで購入しています。\n30～50ドル分をあちこちで購入しています。彼女は価格をチェックすることもなく（タマには\nまた、値段も知らないようです（私の力不足ですが・・・）。",
      "title": "ただ、妻がゆっくりとBTCを買っていることがわかりました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几周前，我帮她在比特币中存入了一小笔但还算不错的金额。我向她展示了\n我向她展示了电子转账的运作方式，让她购买并发送至她的钱包。她一直在购买\n价值30-50美元，在这里和那里。她甚至不检查价格（球在\n她也不知道价格是多少（这是我需要的能力）。",
      "title": "刚发现我老婆在慢慢买BTC!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾周前，我幫她在比特幣中存入了一小筆但還算不錯的金額。我向她展示了\n我向她展示了電子轉賬的運作方式，讓她購買併發送至她的錢包。她一直在購買\n價值30-50美元，在這裏和那裏。她甚至不檢查價格（球在\n她也不知道價格是多少（這是我需要的能力）。",
      "title": "剛發現我老婆在慢慢買BTC!"
    }
  ]
}