{
  "author": "wmredditor",
  "the_new_excerpt": "Bitcoin breached $28k again today and I believe the top is not yet in.\n\nHowever, unless you're a very long-term holder, it is not wrong to take some\nmoney off the table if you're already in profit.\n\nThere's a popular saying that \"you're not really in profit until you take\nprofit.\"\n\nAlso, a small…",
  "original_created_utc": 1609322271,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "比特币今天再次突破28K美元，我相信顶部还没有进来。\n\n然而，除非你是一个非常长期的持有者，否则服用一些并不是错误的\n如果你已经盈利了，就把钱从桌上拿出来。\n\n有一句流行的谚语说：“不拿到钱，你就不会真正获利\n利润。“\n\n此外，还有一台小型…",
      "title": "如果你想从你的比特币上获利，不要让任何人让你感觉不好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣今天再次突破28K美元，我相信頂部還沒有進來。\n\n然而，除非你是一個非常長期的持有者，否則服用一些並不是錯誤的\n如果你已經盈利了，就把錢從桌上拿出來。\n\n有一句流行的諺語說：“不拿到錢，你就不會真正獲利\n利潤。“\n\n此外，還有一臺小型…",
      "title": "如果你想從你的比特幣上獲利，不要讓任何人讓你感覺不好"
    }
  ],
  "title": "Take Profits on Your Bitcoin If You Want To, Don't Let Anyone Make You Feel Bad About It",
  "created_utc": 1609364551,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin breached $28k again today and I believe the top is not yet in.</p>\n\n<p>However, unless you&#39;re a very long-term holder, it is not wrong to take some money off the table if you&#39;re already in profit.</p>\n\n<p>There&#39;s a popular saying that <strong>&quot;you&#39;re not really in profit until you take profit.&quot;</strong></p>\n\n<p>Also, a <strong>small profit is better than no profit.</strong></p>\n\n<p>Don&#39;t think that the price of Bitcoin will keep mooning forever.</p>\n\n<p>A drop will happen at some point, even though we can&#39;t say how low it will go. </p>\n\n<p>No matter how long Bitcoin defies gravity, what goes up must eventually come down.</p>\n\n<p>So, if you&#39;re already in profit, take some of it and hold on to an amount you can afford to play with going forward.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Will Bitcoin hit $50k in this bull run?</li>\n<li>Will it hit $35k?</li>\n</ul>\n\n<p>No one knows for sure.</p>\n\n<p>But all that won&#39;t matter if this epic bull run ends and you have nothing to show for it.</p>\n\n<p>Don&#39;t let anyone make you feel bad about it. </p>\n\n<p>It&#39;s your winning. </p>\n\n<p>Enjoy it!</p>\n</div><!-- SC_ON -->",
  "score": 284,
  "permalink": "/r/CryptoCurrency/comments/kmziew/take_profits_on_your_bitcoin_if_you_want_to_dont/",
  "subreddit": "CryptoCurrency",
  "id": "kmziew",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495333648
}