{
  "author": "Skagnor_Bognis",
  "the_new_excerpt": "I’ve put off purchasing ETH this month due to to the seemingly never ending\nATHs. Followed the advice here and invested into dips instead and now everything\nI’m holding is red (mostly Bitcoin and solana).\n\nThe temptation to sell at a loss and move everything to ETH is overwhelming, but\ngoes against…",
  "original_created_utc": 1620111421,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今月はETHの購入を見送っていたのですが、終わりがなさそうなATHのために\nATHです。ここでのアドバイスに従い、代わりにディップに投資し、今ではすべての\n赤色になっています（ほとんどがビットコインとソラナ）。\n\n損失を覚悟で売り、すべてをETHに移したいという誘惑に駆られますが\nしかし、それは逆効果です。",
      "title": "今、ETHに対する激しいフォモを経験している人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我这个月推迟了购买ETH，因为似乎永远不会结束的\nATHs。听从了这里的建议，转而投资于跌价，现在我持有的所有\n我持有的都是红色的（主要是比特币和索拉纳）。\n\n亏本卖出并将所有东西转移到ETH的诱惑是压倒性的，但\n违背了...",
      "title": "目前还有人在ETH上遇到了严重的fomo吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我這個月推遲了購買ETH，因爲似乎永遠不會結束的\nATHs。聽從了這裏的建議，轉而投資於跌價，現在我持有的所有\n我持有的都是紅色的（主要是比特幣和索拉納）。\n\n虧本賣出並將所有東西轉移到ETH的誘惑是壓倒性的，但\n違背了...",
      "title": "目前還有人在ETH上遇到了嚴重的fomo嗎？"
    }
  ],
  "title": "Anybody else experiencing severe fomo over ETH at the moment?",
  "created_utc": 1620142515,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve put off purchasing ETH this month due to to the seemingly never ending ATHs. Followed the advice here and invested into dips instead and now everything I’m holding is red (mostly Bitcoin and solana). </p>\n\n<p>The temptation to sell at a loss and move everything to ETH is overwhelming, but goes against everything I’ve learned. I haven’t been able to sleep because of this.</p>\n\n<p>Some reassurance or advice from you diamond handed OGs would really help me right now.</p>\n\n<p>Edit: I chose my words poorly and didn’t mean to imply that I got bad advice from this sub. It was just solid fundamentals that you’d see anywhere else and I believe in them. Just trying not to become a paper hands. Thanks so much for the support.</p>\n</div><!-- SC_ON -->",
  "score": 300,
  "permalink": "/r/CryptoCurrency/comments/n4i1jn/anybody_else_experiencing_severe_fomo_over_eth_at/",
  "subreddit": "CryptoCurrency",
  "id": "n4i1jn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964320
}