{
  "author": "Set1Less",
  "original_created_utc": 1647546808,
  "title": "Elizabeth Warren is unhinged in her anti-crypto agenda. Her new dangerous bill seeks to cut off regular Russians who have nothing to do with Putin's war from crypto, and also puts liability on developers. She is a threat to the whole space.",
  "created_utc": 1647570893,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The latest bill Warren has proposed is a dangerous one that seeks to cut regular Russians from crypto. According to the bill, exchanges, intermediaries etc should stop dealing with addresses originating from Russians. &lt;/p&gt;\n\n&lt;p&gt;She is seeking to cut off every Russian from crypto even though they have nothing to do with Putin&amp;#39;s war. What is worse is that even decentralised protocol devs could be held liable if somehow a Russian ends up using their protocol or tool. How does this make any sense? Protocol developers have no way of limiting who uses their software. &lt;/p&gt;\n\n&lt;p&gt;FBI, White House, Treasury department have all said that crypto is not being used to evade sanctions in any serious sums worth paying attention to. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.coincenter.org/new-crypto-sanctions-bill-targets-publishing-code-facilitating-transactions/\"&gt;https://www.coincenter.org/new-crypto-sanctions-bill-targets-publishing-code-facilitating-transactions/&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Bill would place sweeping restrictions on persons who build, operate, and use cryptocurrency networks even if they have no knowledge or intent to help evade sanctions though the Administration’s own experts have repeatedly said cryptocurrency evasion is not serious&lt;/p&gt;\n\n&lt;p&gt;Senator Warren and a raft of Democratic co-sponsors today introduced a bill titled the Digital Asset Sanctions Compliance Enhancement Act, which would place sweeping restrictions on the cryptocurrency ecosystem under the guise of bolstering sanctions against Russia for its unjustified invasion of Ukraine. She has done this despite the fact that there is no data suggesting that cryptocurrency has been used–or can meaningfully be used–by sanctioned parties to evade sanctions, and despite the fact that frontline officials from the White House, Treasury, and the Department of Justice have all stated that cryptocurrency is a poor tool for sanctions evasion and one that they have well under control.&lt;/p&gt;\n\n&lt;p&gt;For example, FBI Director Christopher Wray said last Thursday at a Senate Intelligence Committee hearing:&lt;/p&gt;\n\n&lt;p&gt;The Russians’ ability to circumvent the sanctions with cryptocurrency is probably highly overestimated on the part of maybe them and others. We are, as a community and with our partners overseas, far more effective on that than I think sometimes they appreciate.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;White House has also said &amp;quot;cryptocurrency is an ineffective primary tool for the state&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;It is well reported that the Russian state is planning or already using Chinese Yuan, Indian government&amp;#39;s aide to evade sanctions, not crypto. &lt;/p&gt;\n\n&lt;p&gt;Why is she so unhinged against crypto? Someone must be funding her so much that she spends her entire time talking shit about crypto and brining about senseless regulations. &lt;/p&gt;\n\n&lt;p&gt;She does not even understand crypto, yet comes up with senseless regulations that cannot be complied in good faith.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 353,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/jQzHE1lldOSSM2y06mtpzrxRdhO6c-tlEx3w4FfC73I.jpg?auto=webp&amp;s=757608620afb3b02f493da55d7f0e83508059ced",
          "width": 992,
          "height": 558
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/jQzHE1lldOSSM2y06mtpzrxRdhO6c-tlEx3w4FfC73I.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=ae18abe4587f06f1c11d0ef567842eec6c9c1b5b",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/jQzHE1lldOSSM2y06mtpzrxRdhO6c-tlEx3w4FfC73I.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=fd5f623ebf4bfbdc53851311625abb5c557624bd",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/jQzHE1lldOSSM2y06mtpzrxRdhO6c-tlEx3w4FfC73I.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=d0d089c807329cf716c2fe410dc4a8ee4bfa1620",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/jQzHE1lldOSSM2y06mtpzrxRdhO6c-tlEx3w4FfC73I.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=9f2591b5f514f3e3e3facdc8b0441fb6a09ea214",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/jQzHE1lldOSSM2y06mtpzrxRdhO6c-tlEx3w4FfC73I.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=6a67a39382851fd1042e9411084b85f93724ecf0",
            "width": 960,
            "height": 540
          }
        ],
        "variants": {},
        "id": "IeRzq_ZkpkXWqJjxrHUkjn2Gr0PNCkdG2zzbDNUcTng"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/tgiow5/elizabeth_warren_is_unhinged_in_her_anticrypto/",
  "subreddit": "CryptoCurrency",
  "id": "tgiow5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The latest bill Warren has proposed is a dangerous one that seeks to cut regular\nRussians from crypto. According to the bill, exchanges, intermediaries etc\nshould stop dealing with addresses originating from Russians.\n\nShe is seeking to cut off every Russian from crypto even though they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウォーレンが提案した最新の法案は、正規のものを削減しようとする危険なものである。\nロシア人が暗号から 法案によると、取引所、仲介業者など\nは、ロシア人発信のアドレスの取り扱いを停止する必要があります。\n\n彼女は全てのロシア人を 暗号から遮断しようとしているのです たとえ彼らが...",
      "title": "エリザベス・ウォーレンは、反暗号化政策に狂奔している。彼女の新しい危険な法案は、プーチンの戦争とは無関係の普通のロシア人を暗号から切り離そうとし、開発者にも責任を負わせようとするものです。彼女は宇宙全体に対する脅威です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "沃伦提出的最新法案是一个危险的法案，试图切断普通\n俄罗斯人与加密货币的关系。根据该法案，交易所、中介机构等\n应该停止与来自俄罗斯人的地址交易。\n\n她正在寻求切断每一个俄罗斯人与加密货币的联系，尽管他们...",
      "title": "伊丽莎白-沃伦在她的反加密议程中是不正常的。她的新的危险法案试图切断与普京的战争无关的普通俄罗斯人与加密货币的联系，还让开发商承担责任。她是对整个空间的一种威胁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沃倫提出的最新法案是一個危險的法案，試圖切斷普通\n俄羅斯人與加密貨幣的關係。根據該法案，交易所、中介機構等\n應該停止與來自俄羅斯人的地址交易。\n\n她正在尋求切斷每一個俄羅斯人與加密貨幣的聯繫，儘管他們...",
      "title": "伊麗莎白-沃倫在她的反加密議程中是不正常的。她的新的危險法案試圖切斷與普京的戰爭無關的普通俄羅斯人與加密貨幣的聯繫，還讓開發商承擔責任。她是對整個空間的一種威脅。"
    }
  ]
}