{
  "author": "naji102",
  "original_created_utc": 1638211457,
  "title": "BTC is almost up 10% in last 24 hours. If you panic sold at -23% pullback yesterday thinking it’s a “Bear Market” then you still don’t understand crypto market.",
  "created_utc": 1638217948,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>BTC crashed -55% in May 2021 still made All time high with in only 6 months.</p>\n\n<p>BTC had a pullback of -25% in September 2021 still made all time high in a month.</p>\n\n<p>Yesterday BTC had a pullback of -23% and we are going to make another all time high. <sup>high on hopium</sup></p>\n\n<p>All these pullbacks are always healthy for a long run the whales will shake you out and then take the rally up without you. </p>\n\n<p>Even we had a bigger pullback yesterday we still would have maintained a bull market like in May 2021. Extreme fear brings opportunities. Buy if you got the funds just like Michael Saylor and El Salvador did. </p>\n\n<p>Don’t believe those Journalists who call it a bear market on a 20% drop. When there’s a bear market you will see it, ALTs don’t make ATH during a bear market they actually drop 70-80%.</p>\n\n<p>Edit: <strong>I meant to say BTC had a -23% pullback until yesterday</strong></p>\n</div><!-- SC_ON -->",
  "score": 1962,
  "permalink": "/r/CryptoCurrency/comments/r52isc/btc_is_almost_up_10_in_last_24_hours_if_you_panic/",
  "subreddit": "CryptoCurrency",
  "id": "r52isc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "BTC crashed -55% in May 2021 still made All time high with in only 6 months.\n\nBTC had a pullback of -25% in September 2021 still made all time high in a\nmonth.\n\nYesterday BTC had a pullback of -23% and we are going to make another all time\nhigh. high on hopium\n\nAll these pullbacks are always healthy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCは2021年5月に-55%の暴落をしましたが、わずか6ヶ月で史上最高値を更新しました。\n\nBTCは2021年9月に-25%のプルバックがありましたが、それでも1ヶ月で史上最高値を更新しました。\nヵ月で史上最高値を更新した。\n\n昨日、BTCは-23%のプルバックがありましたが、また史上最高値を更新する予定です。\n希望に満ちた高値\n\nこのようなプルバックは常に健全です。",
      "title": "BTCはこの24時間で10％近く上昇しています。もしあなたが昨日の-23%のプルバックで「ベアマーケット」だと思ってパニックで売ったのなら、あなたはまだ暗号市場を理解していません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "BTC在2021年5月暴跌-55%，但在短短6个月内仍创下历史新高。\n\nBTC在2021年9月回落了-25%，但仍在一个月内创下历史新高。\n一个月内创下历史新高。\n\n昨天BTC回调了-23%，我们将再创历史新高。\n高的希望。\n\n所有这些回调都是健康的...",
      "title": "BTC在过去24小时内几乎上涨了10%。如果你昨天在-23%的回撤中恐慌性卖出，认为这是一个 \"熊市\"，那么你仍然不了解加密货币市场。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "BTC在2021年5月暴跌-55%，但在短短6個月內仍創下歷史新高。\n\nBTC在2021年9月回落了-25%，但仍在一個月內創下歷史新高。\n一個月內創下歷史新高。\n\n昨天BTC回調了-23%，我們將再創歷史新高。\n高的希望。\n\n所有這些回調都是健康的...",
      "title": "BTC在過去24小時內幾乎上漲了10%。如果你昨天在-23%的回撤中恐慌性賣出，認爲這是一個 \"熊市\"，那麼你仍然不瞭解加密貨幣市場。"
    }
  ]
}