{
  "author": "grylnor",
  "the_new_excerpt": "This crash started because a mining pool (F2 Pool) sold a huge amount of\nbitcoins (3633) and leveraged x100 along the selloff to maximise the gains wth\nmore sell pressure. That´s it, that is the reason. Normally you would sell these\namounts OTC. But they knew they would crash the market with that…",
  "original_created_utc": 1614151174,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这次崩盘的起因是一个矿池（F2 Pool）卖出了巨额的\n比特币(3633)和杠杆x100沿大跌，以最大限度地提高收益wth。\n更多的卖出压力。就是这样，这就是原因。通常你会卖掉这些\n金额场外交易。但他们知道这样做会让市场崩溃... But they knew they would crash market with that...",
      "title": "这不是耶伦，也与埃隆-马斯克无关!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這次崩盤的起因是一個礦池（F2 Pool）賣出了鉅額的\n比特幣(3633)和槓桿x100沿大跌，以最大限度地提高收益wth。\n更多的賣出壓力。就是這樣，這就是原因。通常你會賣掉這些\n金額場外交易。但他們知道這樣做會讓市場崩潰... But they knew they would crash market with that...",
      "title": "這不是耶倫，也與埃隆-馬斯克無關!"
    }
  ],
  "title": "It was not Yellen and it has nothing to do with Elon Musk!",
  "created_utc": 1614188662,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This crash started because a mining pool (F2 Pool) sold a huge amount of bitcoins (3633) and leveraged x100 along the selloff to maximise the gains wth more sell pressure. That´s it, that is the reason. Normally you would sell these amounts OTC. But they knew they would crash the market with that amount and shorted along.</p>\n\n<p>Stop sweeping it under the carpet.</p>\n\n<p>This and the constant delay of EIP-1559 due to miners voting against it for YEARS, so ETH fees won´t get reduced should show you, that we should start switching to blockchain technology without mining. There are enough better alternatives doing the same thing and are as decentralised or even more.</p>\n\n<p>Greedy miners could kill the blockchain tech. Change my mind.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: Clarification from blablablablabla78  in the comments:</p>\n\n<p>just a quick addition, it&#39;s not f2pool (they are a mining pool that  pools mining participants together) itself that is selling bitcoin,  rather f2pool linked mining participants that band together similar like   /wallstreetbets to maximise their  impact.</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks. I did not knew it.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/lr6kgd/it_was_not_yellen_and_it_has_nothing_to_do_with/",
  "subreddit": "CryptoCurrency",
  "id": "lr6kgd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880690
}