{
  "author": "rmsmms",
  "original_created_utc": 1644789362,
  "title": "I build this social/fun project out of curiosity",
  "created_utc": 1644802474,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone, I&amp;#39;m quite new to reddit and fell in love right away. Mostly I&amp;#39;ve been reading here and this is my first post. Kind of nervous :)&lt;br/&gt;\nI&amp;#39;m junior frontend dev and I thought I make this side project for fun/curiosity , so the idea is very simple,  I want to make stickers with a sentence &amp;quot;How do you feel?&amp;quot; and add a qr code to it, so people can go there and write anonymously how they feel, to let it out, sometimes it makes you feel better. And stick them around my city. What do you think? suggestions are welcome! thank you and have a great day :)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://howdoyoufeel-16806.web.app/\"&gt;https://howdoyoufeel-16806.web.app/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/sru4cm/i_build_this_socialfun_project_out_of_curiosity/",
  "subreddit": "SideProject",
  "id": "sru4cm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi everyone, I'm quite new to reddit and fell in love right away. Mostly I've\nbeen reading here and this is my first post. Kind of nervous :)\nI'm junior frontend dev and I thought I make this side project for fun/curiosity\n, so the idea is very simple, I want to make stickers with a sentence \"How…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私はredditにかなり新しいですし、すぐに恋に落ちました。ほとんどの場合、私は\nを読んでいて、今回が初投稿です。ちょっと緊張しています :)\n私はジュニアフロントエンド開発者です、私は楽しみ/好奇心のためにこのサイドプロジェクトを作ろうと思いました。\nという一文が入ったステッカーを作りたい、という単純なものです。",
      "title": "私は好奇心からこの社会的で楽しいプロジェクトを構築しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我是第一次来reddit，马上就爱上了。我主要是\n一直在阅读这里，这是我的第一篇帖子。有点紧张 :)\n我是一个初级的前端开发人员，我想我做这个副业是为了好玩/好奇心。\n我的想法很简单，我想做一些贴纸，上面有一句话 \"How...",
      "title": "我出于好奇心建立了这个社交/娱乐项目"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我是第一次來reddit，馬上就愛上了。我主要是\n一直在閱讀這裏，這是我的第一篇帖子。有點緊張 :)\n我是一個初級的前端開發人員，我想我做這個副業是爲了好玩/好奇心。\n我的想法很簡單，我想做一些貼紙，上面有一句話 \"How...",
      "title": "我出於好奇心建立了這個社交/娛樂項目"
    }
  ]
}