{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Hi Reddit!\n\nI'm Dr. Diwakar Davar, a physician-scientist at the UPMC Hillman Cancer Center\nand the University of Pittsburgh.\n\nDespite the success of cancer immunotherapy only about 30-40% of patients have a\npositive response. We want to know why! And, we think the gut microbiome may\nhold some of the…",
  "original_created_utc": 1617793251,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditの皆さん、こんにちは。\n\n私は、UPMCヒルマンがんセンターとピッツバーグ大学の医師科学者であるDiwakar Davar博士です。\nとピッツバーグ大学の科学者です。\n\nがん免疫療法が成功しているにもかかわらず、患者の約30～40％しか肯定的な反応を得られていません。\n肯定的な反応が得られるのは患者さんの約30～40％に過ぎません。私たちはその理由を知りたいのです。私たちは、腸内細菌叢にその理由があるのではないかと考えています。\n腸内細菌叢がその一端を担っているのではないかと考えています...",
      "title": "AskScience AMAシリーズ。私はがん専門医で、糞便マイクロバイオーム移植（ウンチ！）ががん免疫療法を促進することを研究しています。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，Reddit！我是Diwakar Davar博士，UPMC Hillman癌症中心的医生科学家。\n\n我是Diwakar Davar博士，UPMC Hillman癌症中心的医生科学家。\n和匹兹堡大学。\n\n尽管癌症免疫疗法取得了成功，但只有约30-40%的患者有了\n积极的回应。我们想知道为什么! 而且，我们认为肠道微生物组可能会。\n持有部分",
      "title": "AskScience AMA系列。我是一名癌症医生，我正在研究粪便微生物组移植（大便！）如何促进癌症免疫疗法。有问必答!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，Reddit！我是Diwakar Davar博士，UPMC Hillman癌症中心的醫生科學家。\n\n我是Diwakar Davar博士，UPMC Hillman癌症中心的醫生科學家。\n和匹茲堡大學。\n\n儘管癌症免疫療法取得了成功，但只有約30-40%的患者有了\n積極的迴應。我們想知道爲什麼! 而且，我們認爲腸道微生物組可能會。\n持有部分",
      "title": "AskScience AMA系列。我是一名癌症醫生，我正在研究糞便微生物組移植（大便！）如何促進癌症免疫療法。有問必答!"
    }
  ],
  "title": "AskScience AMA Series: I'm a cancer doc and I'm studying how fecal microbiome transplants (poop!) could boost cancer immunotherapy. Ask Me Anything!",
  "created_utc": 1617806107,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit!</p>\n\n<p>I&#39;m Dr. Diwakar Davar, a physician-scientist at the UPMC Hillman Cancer Center and the University of Pittsburgh.</p>\n\n<p>Despite the success of cancer immunotherapy only about 30-40% of patients have a positive response. We want to know why! And, we think the gut microbiome may hold some of the answers.</p>\n\n<p>There are billions of bacteria in the gut. In fact, the gut microbiome has been implicated in seemingly unconnected states, ranging from the response to cancer treatments to obesity and a host of neurological diseases, including Alzheimer&#39;s, Parkinson&#39;s disease, depression, schizophrenia and autism.</p>\n\n<p>Together with my Hillman and Pitt colleague Dr. Hassane Zarour, we looked at the success and failure of cancer immunotherapy and discovered that cancer patients who did well with anti-PD1 immunotherapy had different gut bacteria microorganisms. So, what if we could change the gut bacteria? What if we transplanted the good bacteria from those who responded to treatment into the patients who did not respond? In a small first-in-human trial, we found that this just might work! A tremendously exciting finding.</p>\n\n<p>What does this mean for the future of cancer treatment? We think altering the gut microbiome has great potential to change the impact of immunotherapy across all cancers. We still have a way to go, including getting more specific with what microbes we transfer. We also want to ultimately replace FMT with pills containing a cocktail of the most beneficial microbes for boosting immunotherapy.</p>\n\n<p>Read more about our study here - <a href=\"https://hillmanresearch.upmc.edu/fecal-transplant-boosts-cancer-immunotherapy/\">https://hillmanresearch.upmc.edu/fecal-transplant-boosts-cancer-immunotherapy/</a></p>\n\n<p>You can find me on twitter <a href=\"https://twitter.com/diwakardavar\">@diwakardavar</a> and Dr. Zarour <a href=\"https://twitter.com/HassaneZarour\">@HassaneZarour</a>. I&#39;ll be on at 1pm (ET, 17 UT), ask me anything!</p>\n\n<p>Username: <a href=\"/u/Red_Stag_07\">/u/Red_Stag_07</a></p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/askscience/comments/mlzk7n/askscience_ama_series_im_a_cancer_doc_and_im/",
  "subreddit": "askscience",
  "id": "mlzk7n",
  "is_self": true,
  "media": null,
  "is_video": false
}