{
  "author": "zeverbn",
  "the_new_excerpt": "So I was moving a bathtub into a friends house today, my friend was going off\nabout the 2008 financial crisis and makita stock or some shit I wasn’t paying\nattention. Then they said something interesting, my friend told me that they\ninvested 10 grand into Apple in 2000 and that he hasn’t touched it…",
  "original_created_utc": 1618031548,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は友達の家にバスタブを運んでいたのですが、友達は2008年の金融危機やマキタの株などについて\n2008年の金融危機やマキタの株の話などをしていて、私は気にしていなかったのですが\nしていました。その後、友人が面白いことを言っていた。\n2000年にAppleに1万ドル投資して、それから触っていないと...。",
      "title": "私の友人は、2000年にAAPLに1万ドルを投資したと言っていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我把一个浴缸搬到朋友家，我朋友要走了。\n关于2008年金融危机和Makita股票什么的，我都没在意\n注意力。然后他们说了一些有趣的事情，我的朋友告诉我，他们。\n在2000年投资了1万块钱到苹果公司，他没有碰过它... ...",
      "title": "我的朋友告诉我，他在2000年向AAPL投资了1万美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我把一個浴缸搬到朋友家，我朋友要走了。\n關於2008年金融危機和Makita股票什麼的，我都沒在意\n注意力。然後他們說了一些有趣的事情，我的朋友告訴我，他們。\n在2000年投資了1萬塊錢到蘋果公司，他沒有碰過它... ...",
      "title": "我的朋友告訴我，他在2000年向AAPL投資了1萬美元。"
    }
  ],
  "title": "Friend of mine told me he invested $10,000 into AAPL in 2000.",
  "created_utc": 1618090598,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I was moving a bathtub into a friends house today, my friend was going off about the 2008 financial crisis and makita stock or some shit I wasn’t paying attention. Then they said something interesting, my friend told me that they invested 10 grand into Apple in 2000 and that he hasn’t touched it since or even looked at how much it’s grown or what his portfolio looks like since 2001. So I’m here wondering how much is that $10,000 investment worth today?</p>\n</div><!-- SC_ON -->",
  "score": 53,
  "permalink": "/r/stocks/comments/mnylk5/friend_of_mine_told_me_he_invested_10000_into/",
  "subreddit": "stocks",
  "id": "mnylk5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617820
}