{
  "author": "CommandDry5123",
  "original_created_utc": 1635450828,
  "title": "My main reason to lose weight is so I can talk to girls. Is that a dumb reason?",
  "created_utc": 1635460433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve always been on the bigger size and I’ve started to exercise and eating healthier so I can lose weight but really the only reason why I’m losing weight is because I can talk to girls. I’ve never been in a relationship before and I feel like one the main reason why is because I’m overweight and I never really had the confidence to talk to one because of how insecure I am. Everyone has more respectable reasoning of losing weight but I’m just losing weight so I can start talking to girls. This is reasoning dumb?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/qhv4fz/my_main_reason_to_lose_weight_is_so_i_can_talk_to/",
  "subreddit": "NoStupidQuestions",
  "id": "qhv4fz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve always been on the bigger size and I’ve started to exercise and eating\nhealthier so I can lose weight but really the only reason why I’m losing weight\nis because I can talk to girls. I’ve never been in a relationship before and I\nfeel like one the main reason why is because I’m overweight and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はもともと体格がよく、痩せたいと思って運動や健康的な食事をするようになりましたが\n健康的な食事をするようになりましたが、実際に体重が減っているのは\n女の子と話せるようになったからです。僕は今まで一度も恋愛をしたことがありません。\n今まで一度も恋愛をしたことがないのですが、その主な理由は太っているからだと感じています...",
      "title": "僕がダイエットをする一番の理由は、女の子と話せるようになるためです。それは馬鹿げた理由ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的体型一直比较大，我已经开始锻炼身体，吃得更健康。\n我已经开始锻炼，吃得更健康，这样我就可以减肥了，但实际上，我减肥的唯一原因是\n是因为我可以和女孩交谈。我以前从来没有谈过恋爱，我觉得其中一个主要原因就是\n我觉得其中一个主要原因是我体重过重，我...",
      "title": "我减肥的主要原因是为了能和女孩说话。这是一个愚蠢的理由吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的體型一直比較大，我已經開始鍛鍊身體，喫得更健康。\n我已經開始鍛鍊，喫得更健康，這樣我就可以減肥了，但實際上，我減肥的唯一原因是\n是因爲我可以和女孩交談。我以前從來沒有談過戀愛，我覺得其中一個主要原因就是\n我覺得其中一個主要原因是我體重過重，我...",
      "title": "我減肥的主要原因是爲了能和女孩說話。這是一個愚蠢的理由嗎？"
    }
  ]
}