{
  "author": "Notmiefault",
  "original_created_utc": 1631497820,
  "title": "It's 1875. King Ludwig II, and by extension all of the German nobility, is obsessed with the latest Wagner opera. I'm a Hard of Hearing German noble. Do I attend the opera and pretend to follow along? Can I read a plot summary somewhere and pretend to appreciate it? How do I cope, socially?",
  "created_utc": 1631529403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For context, I&#39;m Hard of Hearing and recently went to a Broadway show. The theater gave me a set of headphones so I could listen to the singers at a much higher volume and actually understand the lyrics and generally enjoy the show. It made me wonder about life for those with hearing difficulties before modern technology, especially when art was (as I unertand it) something of a requirement for nobility. What would my life have been like in such a time?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/pn5xcy/its_1875_king_ludwig_ii_and_by_extension_all_of/",
  "subreddit": "AskHistorians",
  "id": "pn5xcy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For context, I'm Hard of Hearing and recently went to a Broadway show. The\ntheater gave me a set of headphones so I could listen to the singers at a much\nhigher volume and actually understand the lyrics and generally enjoy the show.\nIt made me wonder about life for those with hearing difficulties…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は難聴者ですが、最近ブロードウェイのショーを見に行きました。劇場では\n劇場からヘッドフォンをもらったので、歌手の声をもっと大きな音量で聞くことができました。\n実際に歌詞を理解し、ショーを楽しむことができました。\n聴覚障害者の生活について考えさせられました...。",
      "title": "1875年です。国王ルートヴィヒ2世、ひいてはドイツの貴族たちは、最新のワーグナーのオペラに夢中になっている。私は耳の不自由なドイツ貴族だ。オペラに参加して、一緒に見ているふりをするか？どこかであらすじを読んで、鑑賞しているふりをすればいいのでしょうか？社会的にどのように対処すればよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了说明情况，我是重听者，最近去看了一场百老汇演出。剧院给了我一套耳机\n剧院给了我一副耳机，这样我就可以用更高的音量听歌手的歌声，并真正理解歌词，总体上享受演出。\n剧院给了我一副耳机，这样我就可以用更高的音量听歌手唱歌，并真正理解歌词，总体上享受演出。\n这让我对那些有听力障碍的人的生活感到好奇......",
      "title": "现在是1875年。国王路德维希二世，以及所有的德国贵族，都对最新的瓦格纳歌剧着迷。我是一个有听力障碍的德国贵族。我可以去看歌剧，假装跟着看吗？我可以在某处读到剧情摘要并假装欣赏吗？我如何应对，在社交方面？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了說明情況，我是重聽者，最近去看了一場百老匯演出。劇院給了我一套耳機\n劇院給了我一副耳機，這樣我就可以用更高的音量聽歌手的歌聲，並真正理解歌詞，總體上享受演出。\n劇院給了我一副耳機，這樣我就可以用更高的音量聽歌手唱歌，並真正理解歌詞，總體上享受演出。\n這讓我對那些有聽力障礙的人的生活感到好奇......",
      "title": "現在是1875年。國王路德維希二世，以及所有的德國貴族，都對最新的瓦格納歌劇着迷。我是一個有聽力障礙的德國貴族。我可以去看歌劇，假裝跟着看嗎？我可以在某處讀到劇情摘要並假裝欣賞嗎？我如何應對，在社交方面？"
    }
  ]
}