{
  "author": "roccob7798",
  "the_new_excerpt": "What good is a car without fuel?\n\nNo good at all. That's why as gas-powered cars made their way into every home\nfrom Los Angeles to Berlin throughout the 20th Century, the world built millions\nand millions of gas pumps to keep those cars fueled.\n\nLet's extrapolate that out.\n\nWhat good is an electric…",
  "original_created_utc": 1610719925,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "没有油的车有什么用？\n\n一点用处都没有。这就是为什么当汽油车进入每家每户的时候。\n从洛杉矶到柏林，在整个20世纪，世界上建造了数百万个。\n和数以百万计的加油机来维持这些汽车的燃料。\n\n让我们来推断一下。\n\n有什么好处是一个电动...",
      "title": "电动汽车充电股已经成为巨大的赢家。在这个红火的群体中，还有一个爆炸性的名字。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有油的車有什麼用？\n\n一點用處都沒有。這就是爲什麼當汽油車進入每家每戶的時候。\n從洛杉磯到柏林，在整個20世紀，世界上建造了數百萬個。\n和數以百萬計的加油機來維持這些汽車的燃料。\n\n讓我們來推斷一下。\n\n有什麼好處是一個電動...",
      "title": "電動汽車充電股已經成爲巨大的贏家。在這個紅火的羣體中，還有一個爆炸性的名字。"
    }
  ],
  "title": "EV Charging Stocks Have Been Huge Winners. Here's Another Explosive Name in that Red-Hot Group.",
  "created_utc": 1610730170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What good is a car without fuel? </p>\n\n<p><strong>No good at all.</strong> That&#39;s why as gas-powered cars made their way into every home from Los Angeles to Berlin throughout the 20th Century, the world built millions and millions of gas pumps to keep those cars fueled. </p>\n\n<p>Let&#39;s extrapolate that out. </p>\n\n<p>What good is an electric vehicle without charge? </p>\n\n<p>Again, <em>no good at all.</em> So, as electric vehicles replace gas-powered cars and make their way into every home from LA to Berlin in the 2020s, what&#39;s going to happen to those millions and millions of gas pumps? </p>\n\n<p>They&#39;re going to be replaced by millions and millions of <strong><em>EV charging stations</em></strong>. </p>\n\n<p>To that extent, one of the best ways to play the enormous EV Revolution of the 2020s is through investing in EV charging station operators. </p>\n\n<p>These are the next Shells and Exxons of the Transportation 2.0 industry. </p>\n\n<p>I&#39;ve already purchased two of these companies: <strong>Blink Charging</strong> (<strong>BLNK</strong>) and <strong>ChargePoint</strong> (<strong>SBE</strong>). Both stocks are up more than 200% since I first purchased them. </p>\n\n<p>Here is a third name you can add to your list of &quot;EV charging station stocks to buy.&quot; It&#39;s a longtime EV charging industry leader that is well-positioned to leverage its leading tech portfolio and network effects to dominate the European EV charging market in the 2020s. </p>\n\n<h2>The Undisputed Leader of EV Charging in Europe</h2>\n\n<p>While Blink Charging and ChargePoint are battling each other for North American EV charging market supremacy, a $3.3 billion Netherlands-based company by the name of <strong>EVBox</strong> is already dominating the European EV charging market all on its own. </p>\n\n<p>The company – which is going public through a merger with blank-check company <strong>TPG Pace Beneficial Finance Corp.</strong> (<strong>TPGY</strong>) – has installed over 190,000 charging ports all across Europe, from Spain (3,000 ports delivered) to Germany (40,000 ports delivered) to the UK (7,000 ports delivered) to the Nordics (10,000 ports delivered). </p>\n\n<p>Currently, there are 72,000 active EVBox charging ports in Europe – which is a big enough base to give the company <em>over 25% share</em> of the EV charging station market in Europe. </p>\n\n<p>Make no mistake. <strong>EVBox is the undisputed leader of EV charging in Europe.</strong></p>\n\n<p>Perhaps more importantly, EVBox is in a <strong><em>position of strength</em></strong> to defend its market leadership position over the next decade. </p>\n\n<p>There are two big things here. </p>\n\n<p><strong><em>One</em></strong><strong>, EVBox&#39;s existing widespread charging infrastructure will enable network effects.</strong> </p>\n\n<p>EVBox already counts multiple big companies as customers – such as Avis, McDonald&#39;s, IKEA, and Amazon. The company should be able to leverage this huge customer base to keep winning more corporate contracts. After all, if I&#39;m a CEO and I&#39;m looking for EV charging solutions, I&#39;m most likely going to choose the service that everyone else is choosing. </p>\n\n<p>In Europe, that solution is EVBox. </p>\n\n<p><strong><em>Second</em></strong><strong>, EVBox&#39;s new line-up of ultra-fast chargers underscores the company&#39;s technology leadership.</strong> </p>\n\n<p>About a year ago, EVBox introduced its new fast charger EVBox Troniq 100 and a redesign of its ultra-fast charger Ultroniq. The EVBox Troniq provides 100 kW charging, while the Ultroniq provides 350 kW charging. Those numbers may seem intangible, but for context, most commercial and residential chargers provide a fraction of that charge. </p>\n\n<p>The result? EVBox&#39;s top-of-the-line Ultroniq chargers can fully recharge most EVs (250 miles of range) in just 15 minutes. </p>\n\n<p>Net net, EVBox isn&#39;t just Europe&#39;s leading EV charging company today. Rather, thanks to network effects and technology advantages, <strong><em>EVBox projects to remain Europe&#39;s leading EV charging company for the foreseeable future</em></strong>. </p>\n\n<p>That&#39;s a big deal, because Europe is on the cutting edge of the EV Revolution. Pretty much every major country in Europe has a national EV incentive in-place, while most plan to phase out internal combustion engine vehicles by 2025 (Norway), 2030 (Britain, Sweden, and Denmark), or 2040 (France). </p>\n\n<p>So, the EV Revolution in Europe will zoom into hypergrowth gear over the next decade. As it does, Europe&#39;s EV charging infrastructure will expand dramatically from just 250,000 charging ports in 2020, to millions of charging ports by 2030. EVBox will lean into network effects and technical advantages to similarly grow its charging network by several hundred percent. </p>\n\n<p>It should be no surprise, then, that management is targeting <em>60%-plus</em> annualized revenue growth into 2023, and <em>50%-plus</em> annualized revenue growth thereafter. </p>\n\n<p>Given the hypergrowth backdrop, those growth targets seem entirely doable. </p>\n\n<p>If the company does hit those growth targets, then my numbers suggest that this is a <strong>$10-plus billion company in the making</strong>. </p>\n\n<p>So… with the market cap down around $3 billion today… it may be worth taking a good hard look at EVBox stock.</p>\n\n<p>&#x200B;</p>\n\n<p>Company Name <strong>TPG Pace Beneficial Finance Corp.</strong></p>\n\n<p>Ticker Symbol <strong>TPGY</strong> </p>\n\n<p>Share Price <strong>$24.17</strong></p>\n\n<p>Current Market Value <strong>$1 Billion</strong></p>\n</div><!-- SC_ON -->",
  "score": 881,
  "permalink": "/r/stocks/comments/kxva76/ev_charging_stocks_have_been_huge_winners_heres/",
  "subreddit": "stocks",
  "id": "kxva76",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218320
}