{
  "author": "Brinothedino",
  "original_created_utc": 1627858673,
  "title": "Say it with me now folks: \"small corrections are healthy for growth\"",
  "created_utc": 1627893555,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After days and days of green you&#39;d think the sky was falling in the daily after a couple of red 1hr candles. We need these small corrections if we want to keep going uphill. Maybe some people have PTSD from the big crash a couple months back, or maybe you actually just bought in for the first time and aren&#39;t familiar with how this works, but if these tiny dips are shaking your faith you may want to do yourself a favour and keep the charts zoomed out a bit.</p>\n\n<p>If the bull run is actually back on, we can expect regular 25-30% dips. You will learn to love it in time.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/ow2cas/say_it_with_me_now_folks_small_corrections_are/",
  "subreddit": "CryptoCurrency",
  "id": "ow2cas",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After days and days of green you'd think the sky was falling in the daily after\na couple of red 1hr candles. We need these small corrections if we want to keep\ngoing uphill. Maybe some people have PTSD from the big crash a couple months\nback, or maybe you actually just bought in for the first time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何日にもわたって緑が続いた後、空が落ちてきたと思うような日足になりました。\n1時間足の赤いローソクが何本か出ただけで、空が落ちてきたと思うでしょう。上昇を続けたいのであれば、このような小さな修正が必要です。\n上昇し続けるためには、このような小さな修正が必要です。数ヶ月前の大暴落でPTSDになった人もいるのでは？\nもしかしたら、数ヶ月前の大暴落でPTSDになっている人もいるかもしれないし、実際に初めて買った人もいるかもしれない...。",
      "title": "皆さん、「小さな修正は成長のために健全である」と言ってみてはいかがでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在连续几天的绿色之后，你会认为日线上的天塌下来了。\n几天的红色1小时蜡烛后，你会认为天要塌下来了。我们需要这些小的修正，如果我们想继续\n进展顺利。也许有些人在几个月前的大崩盘中出现了创伤后应激障碍。\n或者你实际上是第一次买入......",
      "title": "现在和我一起说：\"小的修正对成长是健康的\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在連續幾天的綠色之後，你會認爲日線上的天塌下來了。\n幾天的紅色1小時蠟燭後，你會認爲天要塌下來了。我們需要這些小的修正，如果我們想繼續\n進展順利。也許有些人在幾個月前的大崩盤中出現了創傷後應激障礙。\n或者你實際上是第一次買入......",
      "title": "現在和我一起說：\"小的修正對成長是健康的\""
    }
  ]
}