{
  "author": "minhmax123",
  "original_created_utc": 1638454736,
  "title": "Why do so many documentaries glorifies militaristic societies and nations?",
  "created_utc": 1638491898,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nazi Germany is often portrays as an elite military machine instead of a brutal opressive regime.&lt;/p&gt;\n\n&lt;p&gt;Julius Ceasar is remembered as a great conqueror and not a tyrant&lt;/p&gt;\n\n&lt;p&gt;The Congress of Vienna and the Industrial Revolution &lt;em&gt;arguably&lt;/em&gt; have a bigger impact than the Napoleonic Wars itself but are less talked about.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/r78gm2/why_do_so_many_documentaries_glorifies/",
  "subreddit": "AskHistorians",
  "id": "r78gm2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nazi Germany is often portrays as an elite military machine instead of a brutal\nopressive regime.\n\nJulius Ceasar is remembered as a great conqueror and not a tyrant\n\nThe Congress of Vienna and the Industrial Revolution arguably have a bigger\nimpact than the Napoleonic Wars itself but are less…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナチス・ドイツはしばしば、残忍な軍隊ではなく、精鋭の軍事機械として描かれることがあります。\n圧政を敷いた。\n\nユリウス・セアザルは、暴君ではなく、偉大な征服者として記憶されている。\n\nウィーン会議と産業革命は、間違いなく、より大きな影響を及ぼしています。\nナポレオン戦争そのものよりも、インパクトは小さいが...。",
      "title": "なぜ多くのドキュメンタリーは、軍国主義の社会や国家を賛美するのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纳粹德国经常被描绘成一个精锐的军事机器，而不是一个残暴的\n残暴的政权。\n\n朱利叶斯-凯撒在人们心目中是一个伟大的征服者，而不是一个暴君。\n\n维也纳会议和工业革命的影响可以说比拿破仑战争本身更大。\n可以说，维也纳会议和工业革命的影响比拿破仑战争本身更大，但却没有那么...",
      "title": "为什么这么多的纪录片都在美化军国主义社会和国家？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "納粹德國經常被描繪成一個精銳的軍事機器，而不是一個殘暴的\n殘暴的政權。\n\n朱利葉斯-凱撒在人們心目中是一個偉大的征服者，而不是一個暴君。\n\n維也納會議和工業革命的影響可以說比拿破崙戰爭本身更大。\n可以說，維也納會議和工業革命的影響比拿破崙戰爭本身更大，但卻沒有那麼...",
      "title": "爲什麼這麼多的紀錄片都在美化軍國主義社會和國家？"
    }
  ]
}