{
  "author": "palmtreesplz",
  "original_created_utc": 1628445857,
  "title": "In 1872, Victoria Woodhull and her sister Tennie Claflin exposed the rape of two 15-year old girls after a masked ball, saying there was no road left open to them but \"the prostitute's road to hell\". Was that true? Would they have had other options?",
  "created_utc": 1628467142,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What the title says, but broadly I&#39;m interested in what options teens would have had (assuming white, working class to middle class) after rape. Was there something particular about the circumstances of this rape that doomed them to prostitution? Could they have returned home to their families?</p>\n\n<p>I&#39;m also curious how two teen girls from Baltimore likely ended up at the French Ball to start with. What can we safely assume about them from their presence there?</p>\n\n<p>I&#39;ve been transcribing the story from the Nov 2, 1872 edition of Woodhull &amp; Claflin&#39;s Weekly, here&#39;s what is described (warning, its quite disturbing):</p>\n\n<blockquote>\n<p>....two young girls not more than fifteen or sixteen years of age. These girls had come on fresh from school in Baltimore...  </p>\n\n<p>...Wine was called for, and while the men drank but little, these young girls were plied with it, until I remonstrated and begged them not to drink any more. My effort to influence them was met with an insulting request from the men to let them alone.  </p>\n\n<p>You may be sure I followed these girls up, and got the history of their connection with these men. They were seduced by them. Two other young girls, friends of theirs, were invited on from Baltimore to visit in this best society. They were taken to the house of a woman we will call Molly, a first-class house of prostitution, when they were robbed of their innocence, each of these soundrels, Challis and “Smith” taking one to himself. And this scoundrel Challis, to prove that he had seduced a maiden, <em>carried for days on his finger, exhibiting in triumph, the red trophy of her virginity</em>. After a few days, these Lotharios exchanged beds and companions, and when weary of this they brought their friends, to the number of one hundred and over, to debauch these young girls—mere children.  </p>\n\n<p>...The children he has seduced and debauched have now no way open before than the prostitute’s road to hell. The way is open for him into the very heart of good society; the way for them is the way of the pariah, out into the wilderness of sin and shame.</p>\n</blockquote>\n\n<p>A sub question is on the used of the verb and adjective &quot;debauch&quot; as in &quot;to debauch&quot; and &quot;debauched women.&quot; It seems sometimes it&#39;s used to denote rape and other times just to denote perhaps consensual but nonetheless extramarital sex, perhaps with sex workers?  e.g. from another passage:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>...The very next box to the one in which we sat was used by two men at once for the purpose fo debauching debauched women; and the trustees of the Academy know this.</p>\n</blockquote>\n\n<p>Is there nuance to be gleaned from the differing uses as commonly understood at the time? Debauched to me, now, is maybe synonymous with hedonism, doesn&#39;t necessarily imply rape or nonconsent, but retains a kind of ironic hint of moral judgement.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/p0jklw/in_1872_victoria_woodhull_and_her_sister_tennie/",
  "subreddit": "AskHistorians",
  "id": "p0jklw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What the title says, but broadly I'm interested in what options teens would have\nhad (assuming white, working class to middle class) after rape. Was there\nsomething particular about the circumstances of this rape that doomed them to\nprostitution? Could they have returned home to their families?\n\nI'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトル通りですが、大まかに言うと、レイプされた後に10代の若者がどんな選択肢を持っていたかに興味があります。\n白人で労働者階級から中産階級と仮定して）レイプされた後にどのような選択肢があったかに興味があります。このレイプの状況には\nこのレイプの状況について何か特別なことがあって、彼らは売春をする運命にあったのでしょうか？\n売春を余儀なくされたのか？家族のもとに帰ることはできたのでしょうか？\n\n私は...",
      "title": "1872年、ヴィクトリア・ウッドハルと妹のテニー・クラフリンは、仮面舞踏会の後に15歳の少女2人がレイプされたことを暴露し、「売春婦の地獄への道」以外に道は残されていないと言った。それは本当だったのか？彼女たちには他の選択肢があったのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，但广义上我感兴趣的是，青少年在被强奸后会有哪些选择？\n假设是白人，工人阶级到中产阶级）在被强奸后有哪些选择。是否有\n这起强奸案的情况有什么特别之处，使他们注定要从事\n卖淫？她们是否可以回家与家人团聚？\n\n我...",
      "title": "1872年，维多利亚-伍德霍尔和她的妹妹坦尼-克拉夫林在一次假面舞会后揭露了两名15岁女孩被强奸的事件，说除了 \"妓女的地狱之路\"，没有其他道路留给她们。那是真的吗？她们会有其他选择吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，但廣義上我感興趣的是，青少年在被強姦後會有哪些選擇？\n假設是白人，工人階級到中產階級）在被強姦後有哪些選擇。是否有\n這起強姦案的情況有什麼特別之處，使他們註定要從事\n賣淫？她們是否可以回家與家人團聚？\n\n我...",
      "title": "1872年，維多利亞-伍德霍爾和她的妹妹坦尼-克拉夫林在一次假面舞會後揭露了兩名15歲女孩被強姦的事件，說除了 \"妓女的地獄之路\"，沒有其他道路留給她們。那是真的嗎？她們會有其他選擇嗎？"
    }
  ]
}