{
  "author": "Quentin__Tarantulino",
  "original_created_utc": 1635549800,
  "title": "Vitalik’s SHIB donations look pretty generous right now",
  "created_utc": 1635572057,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As many of you may know, SHIB really kicked off it’s popularity by depositing a huge amount of it into Vitalik Buterin’s wallet. He responded by donating it to several causes, including 50 trillion SHIB to the India Covid Relief Fund. At the time it was worth about $1.14 billion, so a nice little payout, but we all knew there’s no way you can cash nearly that much without tanking the value. As of late July, $20 million worth had been cashed out, with plans for another $20 million in the works. </p>\n\n<p>Today, however, SHIB is at ATH and that 50 trillion is worth $3.35 billion. Not a bad war chest! While it’s still true that India can’t cash it all out at once, the fact that there’s so much liquidity in the SHIB market right now means that they can probably sell some more effectively than they could before. </p>\n\n<p>Excellent work as always Vitalik. It should be noted that he also made donations to life extension and AI projects that will now be able to benefit from the price spike. In a roundabout way, this crazy SHIB surge has done a lot of good for the world.</p>\n\n<p>Edit: as many people commented, this donation has been completely cashed out. Thanks for showing the block explorer <a href=\"/u/jazzlike_row\">u/jazzlike_row</a> ! They still seem to have gotten nearly half a billion out of it, so it was a great service to humanity, and probably won’t hurt with crypto adoption in India either.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/qioz5m/vitaliks_shib_donations_look_pretty_generous/",
  "subreddit": "CryptoCurrency",
  "id": "qioz5m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As many of you may know, SHIB really kicked off it’s popularity by depositing a\nhuge amount of it into Vitalik Buterin’s wallet. He responded by donating it to\nseveral causes, including 50 trillion SHIB to the India Covid Relief Fund. At\nthe time it was worth about $1.14 billion, so a nice little…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知の方も多いと思いますが、SHIBはVitalik Buterin氏のウォレットに大量に入金されたことで人気を博しました。\nVitalik Buterin氏のウォレットに大量に入金したことで人気を博しました。ブテリンはそれに応えて\n例えば、50兆円のSHIBをIndia Covid Relief Fundに寄付しました。当時\n当時は約11億4千万ドルの価値があったので、ちょっとした...",
      "title": "VitalikのSHIBの寄付は、今はかなり寛大に見えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你们中的许多人可能知道的那样，SHIB通过向Vitalik Buterin的钱包存入大量资金，真正开启了它的流行。\n巨大的金额存入Vitalik Buterin的钱包。他的回应是将其捐赠给\n一些原因，包括50万亿SHIB给印度Covid救济基金。当时\n当时它的价值约为11.4亿美元，所以一个不错的小。",
      "title": "维塔利克的SHIB捐款现在看起来很慷慨"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你們中的許多人可能知道的那樣，SHIB通過向Vitalik Buterin的錢包存入大量資金，真正開啓了它的流行。\n巨大的金額存入Vitalik Buterin的錢包。他的迴應是將其捐贈給\n一些原因，包括50萬億SHIB給印度Covid救濟基金。當時\n當時它的價值約爲11.4億美元，所以一個不錯的小。",
      "title": "維塔利克的SHIB捐款現在看起來很慷慨"
    }
  ]
}