{
  "author": "Stone-D",
  "original_created_utc": 1655542378,
  "title": "BTC broke $20k after a lot of people in the USA had gone home for the weekend, or were fast asleep.",
  "created_utc": 1655557031,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many people in the US are still in the dark as to what has happened. The last thing they saw was that trade levels had flattened off with no wild swings in sight. They thought things were good for the weekend. Perhaps they thought things were stable as people wait out the two weeks before finding out whether or not the US is officially in a recession.&lt;/p&gt;\n\n&lt;p&gt;Then they went home. Some went to party with co-workers to de-stress after a week of nonsense. Most are now in bed, dreaming.&lt;/p&gt;\n\n&lt;p&gt;Tomorrow, their time, they will wake up to a new nightmare to add to what had already happened.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t buy yet.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 436,
  "permalink": "/r/CryptoCurrency/comments/vf2386/btc_broke_20k_after_a_lot_of_people_in_the_usa/",
  "subreddit": "CryptoCurrency",
  "id": "vf2386",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Many people in the US are still in the dark as to what has happened. The last\nthing they saw was that trade levels had flattened off with no wild swings in\nsight. They thought things were good for the weekend. Perhaps they thought\nthings were stable as people wait out the two weeks before finding…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国では、まだ多くの人が何が起こったかわからない状態です。最後に見たのは\n貿易水準が平坦になり、乱高下が見られなくなったのを見たのが最後だった。\nを見ただけでした。週末はいいことがあると思ったのでしょう。おそらく、彼らは\nこの2週間は安定していると思ったのでしょう。",
      "title": "BTCが2万ドルを割ったのは、アメリカの多くの人々が週末に家に帰った後、あるいは早く寝た後でした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国的许多人对所发生的事情仍然一无所知。他们最后看到的\n他们看到的是，贸易水平已经趋于平缓，没有看到疯狂的波动。\n视觉。他们认为周末的情况很好。也许他们认为\n事情是稳定的，因为人们在等待两个星期后才发现...",
      "title": "BTC在美国很多人回家过周末，或者快睡着的时候突破了2万美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國的許多人對所發生的事情仍然一無所知。他們最後看到的\n他們看到的是，貿易水平已經趨於平緩，沒有看到瘋狂的波動。\n視覺。他們認爲週末的情況很好。也許他們認爲\n事情是穩定的，因爲人們在等待兩個星期後才發現...",
      "title": "BTC在美國很多人回家過週末，或者快睡着的時候突破了2萬美元。"
    }
  ]
}