{
  "author": "Prudent_Plum_7644",
  "original_created_utc": 1629978542,
  "title": "Good bye Bitcoin dream...life savings gone for good",
  "created_utc": 1629999559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I completely messed up guys, my life savings are gone for good, I have learned a devastating hard lesson.</p>\n\n<p>That&#39;s my story:</p>\n\n<p>I strongly believe in Bitcoin becoming the world biggest store of value, it&#39;s not an IF anymore, is just a matter of WHEN.</p>\n\n<p>During the last years me and my wife have put in Bitcoins everything we had and slowly managed to reach 1.7 BTC, our entire life savings, 10 years of grinding and accepting odd jobs trying to save every dollar possible and buying every BTC amount we could.</p>\n\n<p>When BTC started recently raising from 30k to 40k I made the biggest mistake ever: trying to earn more than just HODLING (spoiler: it doesn&#39;t end well).</p>\n\n<p>I started looking at YouTube videos explaining how to leverage, how to earn more, how to trade futures, etc.</p>\n\n<p>In matter of hours my YouTube feed was completely flooded by videos of Michael Saylor, one of the world top CEOs betting hard on BTC by doubling and tripling down his BTC holdings and claiming it would easily go to a million each BTC, I was HOOKED.</p>\n\n<p>For one time in this life I wanted to be a &quot;hero&quot; in my wife&#39;s eyes, I wanted to make a bold move and save her and us from a life of odd and low wages jobs, I saw an opportunity and I went for it without even knowing what I was doing.</p>\n\n<p>I started future trades and managed to turn the 1.7 BTCs into 2.1 BTCs, the classic beginner luck.</p>\n\n<p>I have put all ours 2.1 BTCs on a leveraged future for BTC going to 100k $ and I was already envisioning the 21 BTCs in profit. I saw this as a gateway to exit our mediocre life. It was our chance and I had to go for it. Of course she didn&#39;t know that and still doesn&#39;t know...</p>\n\n<p>Of course it didn&#39;t play out, BTC went from touching 50k $ down to 47k $ and our whole life savings have been wiped out.</p>\n\n<p>I still haven&#39;t say anything to my wife, she doesn&#39;t know that and this is killing me from the inside. I just don&#39;t know what to say to her, I&#39;m simply devastated. I barely can watch myself in the mirror. These funds were supposed to be our small treasure, something that would have help us in the future.</p>\n\n<p>Please follow my advice, don&#39;t trade guys, don&#39;t fall into these marketing traps like I did.</p>\n\n<p>Just HODL, BTC is the best thing ever happened to humanity, just HODL and don&#39;t risk your beloved BTCs like I did.</p>\n\n<p>Peace.</p>\n\n<p>EDIT: Thanks to everybody for the support, I truly appreciate your kind words.</p>\n\n<p>EDIT 2: For everybody saying is fake, unfortunately is not. These are the screenshots of the trade being liquidated little by little until the balance is zero (or almost, there were 0.0011 BTC left, about 50 $).</p>\n\n<p><a href=\"https://preview.redd.it/k2ufp4t6mqj71.png?width=2528&amp;format=png&amp;auto=webp&amp;s=e8db93e3ca220a4f66230123c6f944acd6b08be1\">https://preview.redd.it/k2ufp4t6mqj71.png?width=2528&amp;format=png&amp;auto=webp&amp;s=e8db93e3ca220a4f66230123c6f944acd6b08be1</a></p>\n\n<p><a href=\"https://preview.redd.it/2rh9x1t6mqj71.png?width=2508&amp;format=png&amp;auto=webp&amp;s=44a763a3acd3ebd3d93c566870193bf5ea1a867f\">https://preview.redd.it/2rh9x1t6mqj71.png?width=2508&amp;format=png&amp;auto=webp&amp;s=44a763a3acd3ebd3d93c566870193bf5ea1a867f</a></p>\n\n<p><a href=\"https://preview.redd.it/ge3e48t6mqj71.png?width=2526&amp;format=png&amp;auto=webp&amp;s=c729859260f0d23ea290d0996027a3039231fc7b\">https://preview.redd.it/ge3e48t6mqj71.png?width=2526&amp;format=png&amp;auto=webp&amp;s=c729859260f0d23ea290d0996027a3039231fc7b</a></p>\n\n<p><a href=\"https://preview.redd.it/c4rrz3t6mqj71.png?width=2530&amp;format=png&amp;auto=webp&amp;s=8c83919c5602cc8f6e1b4bcf909c4a6ebcb864e7\">https://preview.redd.it/c4rrz3t6mqj71.png?width=2530&amp;format=png&amp;auto=webp&amp;s=8c83919c5602cc8f6e1b4bcf909c4a6ebcb864e7</a></p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 584,
  "permalink": "/r/Bitcoin/comments/pbxvpf/good_bye_bitcoin_dreamlife_savings_gone_for_good/",
  "subreddit": "Bitcoin",
  "id": "pbxvpf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I completely messed up guys, my life savings are gone for good, I have learned a\ndevastating hard lesson.\n\nThat's my story:\n\nI strongly believe in Bitcoin becoming the world biggest store of value, it's\nnot an IF anymore, is just a matter of WHEN.\n\nDuring the last years me and my wife have put in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は完全に失敗しました。私の人生の貯金は永久になくなりました。\n壊滅的な厳しい教訓を得ました。\n\nこれが私の物語です。\n\n私は、ビットコインが世界最大の価値の貯蔵庫になると強く信じています。\nそれはもう「可能性」ではなく、「いつか」の問題です。\n\nこの数年間、私と私の妻は...",
      "title": "ビットコインの夢よさようなら...人生の貯金がなくなってしまった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我完全搞砸了，我一生的积蓄永远地消失了，我已经学到了一个\n毁灭性的惨痛教训。\n\n这就是我的故事。\n\n我坚信比特币会成为世界上最大的价值储存，这不再是一个假设，而只是一个事实。\n这不再是一个假设，只是一个时间问题。\n\n在过去的几年里，我和我的妻子已经投入了...",
      "title": "再见，比特币的梦想......一生的积蓄永远地消失了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我完全搞砸了，我一生的積蓄永遠地消失了，我已經學到了一個\n毀滅性的慘痛教訓。\n\n這就是我的故事。\n\n我堅信比特幣會成爲世界上最大的價值儲存，這不再是一個假設，而只是一個事實。\n這不再是一個假設，只是一個時間問題。\n\n在過去的幾年裏，我和我的妻子已經投入了...",
      "title": "再見，比特幣的夢想......一生的積蓄永遠地消失了"
    }
  ]
}