{
  "author": "SpeedStar12",
  "original_created_utc": 1638659770,
  "title": "Is it normal to have zero friends as an adult?",
  "created_utc": 1638675248,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in my late 20s and have no friends, and I have no idea if this is how it is for everyone or not. I haven&amp;#39;t had any friends in years, and I spend all of my time at home sleeping when I&amp;#39;m not at work. I realized recently that everyone who pretends to be interested in what someone else is talking about is just putting on an act to seem friendly, nobody actually cares about anyone else as an adult. &lt;/p&gt;\n\n&lt;p&gt;Is it normal to have no friends? Are real friends even possible as an adult?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/r91tfv/is_it_normal_to_have_zero_friends_as_an_adult/",
  "subreddit": "NoStupidQuestions",
  "id": "r91tfv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm in my late 20s and have no friends, and I have no idea if this is how it is\nfor everyone or not. I haven't had any friends in years, and I spend all of my\ntime at home sleeping when I'm not at work. I realized recently that everyone\nwho pretends to be interested in what someone else is talking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は20代後半で友達もおらず、こんなものなのかと思っていましたが\nを、みんなのために。私はもう何年も友達がいませんし、すべての時間を\n仕事以外の時間は、家で寝ている。最近気づいたのですが、みんな\n他人の話に興味があるような素振りをする人...",
      "title": "大人になっても友達がゼロというのは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经20多岁了，没有朋友，我不知道这是否是每个人的情况。\n是否每个人都是如此。我已经很多年没有朋友了，而且我在不工作的时候，所有的时间都在家里睡觉。\n当我不工作的时候，我所有的时间都在家里睡觉。我最近意识到，每个人\n假装对别人的谈话感兴趣......",
      "title": "成年后没有朋友，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經20多歲了，沒有朋友，我不知道這是否是每個人的情況。\n是否每個人都是如此。我已經很多年沒有朋友了，而且我在不工作的時候，所有的時間都在家裏睡覺。\n當我不工作的時候，我所有的時間都在家裏睡覺。我最近意識到，每個人\n假裝對別人的談話感興趣......",
      "title": "成年後沒有朋友，這正常嗎？"
    }
  ]
}