{
  "author": "jwithers93",
  "original_created_utc": 1632109869,
  "title": "This news coming to light regarding crypto in the new US Infrastructure Bill is worrying.",
  "created_utc": 1632141437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I read this post in <a href=\"/r/bitcoin\">r/bitcoin</a> and it is very scary and shocking to me. This is too important not to share and make others aware. As a lower middle class American citizen, I work hard to go to the fiat mine almost every day and DCA with dreams of breaking free in a few years. I wanted to take my major profits with the Bitcoin 2024 halving and this law (if passed) goes into effect 12/31/23. That&#39;s very convenient  timing for them I&#39;d say and directly compromises my goals. The link to the original post containing more detail is below:</p>\n\n<p><a href=\"https://np.reddit.com/r/Bitcoin/comments/pr7fow/new_shocking_us_crypto_regulation_far_more/?utm_medium=android_app&amp;utm_source=share\">https://np.reddit.com/r/Bitcoin/comments/pr7fow/new_shocking_us_crypto_regulation_far_more/?utm_medium=android_app&amp;utm_source=share</a></p>\n\n<p>We need to make as many aware as possible and fight this!</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/prn2lg/this_news_coming_to_light_regarding_crypto_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "prn2lg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I read this post in r/bitcoin [/r/bitcoin] and it is very scary and shocking to\nme. This is too important not to share and make others aware. As a lower middle\nclass American citizen, I work hard to go to the fiat mine almost every day and\nDCA with dreams of breaking free in a few years. I wanted to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/bitcoin [/r/bitcoin]でこの投稿を読みましたが、とても怖くてショックを受けています。\nのです。これはあまりにも重要なことなので、共有して他の人に気づいてもらわないといけません。中流階級のアメリカ人として\nアメリカの中流階級の市民として、私はほとんど毎日フィアット鉱山に行くために一生懸命働いています。\n数年後に自由になることを夢見てDCAに通っています。私が望んだのは...",
      "title": "今回、米国の新しいインフラ法案の中で、暗号に関するニュースが明らかになったことは心配です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在r/bitcoin [/r/bitcoin]读到这个帖子，它非常可怕，让我感到震惊。\n我。这一点太重要了，不能不分享并让其他人知道。作为一个中下层\n阶级的美国公民，我努力工作，几乎每天都去法币矿场和\nDCA，梦想着几年后能挣脱束缚。我想...",
      "title": "这个关于美国新基础设施法案中的加密货币的消息被曝光，令人担忧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在r/bitcoin [/r/bitcoin]讀到這個帖子，它非常可怕，讓我感到震驚。\n我。這一點太重要了，不能不分享並讓其他人知道。作爲一箇中下層\n階級的美國公民，我努力工作，幾乎每天都去法幣礦場和\nDCA，夢想着幾年後能掙脫束縛。我想...",
      "title": "這個關於美國新基礎設施法案中的加密貨幣的消息被曝光，令人擔憂。"
    }
  ]
}