{
  "author": "Graf_Gummiente",
  "original_created_utc": 1651406180,
  "title": "Why do people think Germans wouldn’t talk about the time under the Nazis?",
  "created_utc": 1651431749,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just watched an episode of Family Guy where, as in so many other movies and series, the joke is made that Germans won&amp;#39;t talk about their past. But where does this stupid idea come from? When you turn on the TV in Germany it is almost impossible not to see something about the Second World War, in class it is an eternal topic, almost every student was once in a memorial, mostly Buchenwald, etc. So why do people think it would be smaller than they are? So why do people think it would be minimized?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/NoStupidQuestions/comments/ufybwz/why_do_people_think_germans_wouldnt_talk_about/",
  "subreddit": "NoStupidQuestions",
  "id": "ufybwz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just watched an episode of Family Guy where, as in so many other movies and\nseries, the joke is made that Germans won't talk about their past. But where\ndoes this stupid idea come from? When you turn on the TV in Germany it is almost\nimpossible not to see something about the Second World War, in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ファミリー・ガイ」のエピソードを見たところ、他の多くの映画やシリーズと同様、ドイツ人が\nドイツ人は自分の過去について語ろうとしない」というジョークがありました。しかし\nこのバカげた考えはどこから来るのだろう？ドイツでテレビをつけると、第二次世界大戦に関するものを見ないことはほとんどない。\nドイツでテレビをつけると、第二次世界大戦に関するものが映らないことはないだろう。",
      "title": "なぜドイツ人はナチス時代のことを語らないと思われるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚看了《家有儿女》的一集，就像其他许多电影和系列片一样，其中有一个笑话，说是 \"家有儿女\"。\n在这一集里，正如许多其他电影和剧集一样，有人开玩笑说德国人不会谈论他们的过去。但是\n这个愚蠢的想法是怎么来的？在德国，当你打开电视时，几乎不可能不看到关于德国人的事情。\n在德国，当你打开电视时，几乎不可能不看到关于第二次世界大战的内容，在...",
      "title": "为什么人们认为德国人不会谈论纳粹统治时期的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛看了《家有兒女》的一集，就像其他許多電影和系列片一樣，其中有一個笑話，說是 \"家有兒女\"。\n在這一集裏，正如許多其他電影和劇集一樣，有人開玩笑說德國人不會談論他們的過去。但是\n這個愚蠢的想法是怎麼來的？在德國，當你打開電視時，幾乎不可能不看到關於德國人的事情。\n在德國，當你打開電視時，幾乎不可能不看到關於第二次世界大戰的內容，在...",
      "title": "爲什麼人們認爲德國人不會談論納粹統治時期的事情？"
    }
  ]
}