{
  "author": "RetroPenguin_",
  "the_new_excerpt": "I'm (trying) to pose a question purely from curiosity, but in the interest of\nclarity, I should say that M1 Finance is the brokerage I'm referencing. They\noffer a 2% margin rate with a $125 flat fee per year, which means for any\nfive-figure account this is probably worth it.\n\nNow my question is,…",
  "original_created_utc": 1623767670,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "純粋に好奇心から質問をしてみたのですが、分かりやすくするために\n私が参照している証券会社はM1 Financeであることを明確にしておきます。彼らは\n2%のマージン率を提供しており、年間125ドルのフラットフィーを提供しています。\nつまり、5桁台の口座であれば、これはおそらく価値のあることだと思います。\n\nさて、私の質問は...",
      "title": "マージンコストがS&P500の平均リターンよりも小さい場合、マージンを最大化すべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（试图）提出一个问题，纯粹是出于好奇心，但为了清楚起见\n我应该说，M1金融公司是我所指的经纪公司。他们\n他们提供2%的保证金利率，每年收取125美元的固定费用，这意味着对于任何\n五位数的账户，这可能是值得的。\n\n现在我的问题是，...",
      "title": "如果保证金成本低于标准普尔500指数的平均回报，你是否应该将保证金最大化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（試圖）提出一個問題，純粹是出於好奇心，但爲了清楚起見\n我應該說，M1金融公司是我所指的經紀公司。他們\n他們提供2%的保證金利率，每年收取125美元的固定費用，這意味着對於任何\n五位數的賬戶，這可能是值得的。\n\n現在我的問題是，...",
      "title": "如果保證金成本低於標準普爾500指數的平均回報，你是否應該將保證金最大化？"
    }
  ],
  "title": "If margin cost is less than the average return of the S&P500, should you maximize margin?",
  "created_utc": 1623779692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m (trying) to pose a question purely from curiosity, but in the interest of clarity, I should say that M1 Finance is the brokerage I&#39;m referencing. They offer a 2% margin rate with a $125 flat fee per year, which means for any five-figure account this is probably worth it.</p>\n\n<p>Now my question is, assuming that even fairly conservative index funds average about ~6% returns per year, does it make mathematical sense to maximize margin if the rate is lower than this return? </p>\n\n<p>Sure, in down years you&#39;re paying an extra 2% on your losses, but if we trust historical data than the down years are few and far between and returns should be in your favor over time.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/investing/comments/o0fspu/if_margin_cost_is_less_than_the_average_return_of/",
  "subreddit": "investing",
  "id": "o0fspu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742349
}