{
  "author": "EconomistAdmirable26",
  "the_new_excerpt": "Their products aren't anything special in terms of hardware but they make up for\nit in user experience and \"luxury\". They both have a cult following. Their\nproducts are desired by most people under 30. They both experience major\ncompetition from massive companies (google's android vs Apple and every…",
  "original_created_utc": 1617961874,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らの製品は、ハードウェア的には特別なものではありませんが、ユーザーエクスペリエンスや\nユーザーエクスペリエンスと \"ラグジュアリー \"で補っています。どちらもカルト的な人気を誇っています。彼らの\n30歳以下のほとんどの人が欲しがる製品である。両社ともに巨大な\n巨大な企業との競争にさらされている（グーグルのアンドロイドとアップル、その他の...",
      "title": "アップルと同じ理由でテスラが巨大化すると感じている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们的产品在硬件上并没有什么特别之处，但他们弥补了我们的不足。\n它在用户体验和 \"奢侈品\"。他们都有一批崇拜者。他们的\n产品是大多数30岁以下的人所需要的。他们都经历了重大的\n庞大公司的竞争（谷歌的安卓与苹果和每...",
      "title": "还有人觉得特斯拉会像苹果一样成为巨头吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們的產品在硬件上並沒有什麼特別之處，但他們彌補了我們的不足。\n它在用戶體驗和 \"奢侈品\"。他們都有一批崇拜者。他們的\n產品是大多數30歲以下的人所需要的。他們都經歷了重大的\n龐大公司的競爭（谷歌的安卓與蘋果和每...",
      "title": "還有人覺得特斯拉會像蘋果一樣成爲巨頭嗎？"
    }
  ],
  "title": "Anyone else feel like Tesla will become huge for the same reason Apple did?",
  "created_utc": 1617979842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Their products aren&#39;t anything special in terms of hardware but they make up for it in user experience and &quot;luxury&quot;. They both have a cult following. Their products are desired by most people under 30. They both experience major competition from massive companies (google&#39;s android vs Apple and every car manufacturer vs Tesla) yet both are seen as the height of luxury for their respective industries. Despite the stupid valuation and P/E ratio, Tesla probably will produce the best EVs in a couple decades, and they will be cheaper.</p>\n</div><!-- SC_ON -->",
  "score": 149,
  "permalink": "/r/stocks/comments/mnds27/anyone_else_feel_like_tesla_will_become_huge_for/",
  "subreddit": "stocks",
  "id": "mnds27",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617818
}