{
  "author": "Qtredit",
  "original_created_utc": 1639236452,
  "title": "What's something you don't understand about crypto but are too afraid to ask?",
  "created_utc": 1639255019,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The cryptocurrency world is a really big one. It has so many different ideas and use cases and it&amp;#39;s quite impossible to know everything. The technology is, although very progressive and efficient, quite hard to comprehend at times.&lt;/p&gt;\n\n&lt;p&gt;Sometimes we think that everyone but us knows the answer to those &amp;quot;stupid&amp;quot; questions but in reality many of us don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;For example:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;How is an NFT built? How is it stored on the Blockchain?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;How does trading futures work? Can I lose everything in my wallet or just what I&amp;#39;ve put for this trade? &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;How come a coin&amp;#39;s price is mostly the same on every exchange? (I asked this one on the sub a few days ago and got many great answers)&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h2&gt;&lt;strong&gt;So what are some questions that you have about crypto that you were too afraid to ask?&lt;/strong&gt;&lt;/h2&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/re211h/whats_something_you_dont_understand_about_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "re211h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The cryptocurrency world is a really big one. It has so many different ideas and\nuse cases and it's quite impossible to know everything. The technology is,\nalthough very progressive and efficient, quite hard to comprehend at times.\n\nSometimes we think that everyone but us knows the answer to those…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨の世界は、本当に広いです。非常に多くの異なるアイデアと\n使用事例をすべて把握することは、とても不可能です。テクノロジーは\n非常に進歩的で効率的ではありますが、時には理解するのが難しいこともあります。\n\n時には、私たち以外の誰もがその答えを知っていると思うこともあります。",
      "title": "暗号についてわからないことがあっても、怖くて聞けないことがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币世界是一个真正的大世界。它有这么多不同的想法和\n用例，要了解所有的东西是不可能的。该技术是。\n虽然非常进步和高效，但有时也很难理解。\n\n有时我们认为，除了我们之外，每个人都知道这些问题的答案...",
      "title": "你对加密货币有什么不明白的地方却不敢问？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣世界是一個真正的大世界。它有這麼多不同的想法和\n用例，要了解所有的東西是不可能的。該技術是。\n雖然非常進步和高效，但有時也很難理解。\n\n有時我們認爲，除了我們之外，每個人都知道這些問題的答案...",
      "title": "你對加密貨幣有什麼不明白的地方卻不敢問？"
    }
  ]
}