{
  "author": "cessna120",
  "original_created_utc": 1637648606,
  "title": "Can I \"average out\" water temperature by adding volumes at a specific temperature?",
  "created_utc": 1637675785,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s say I want my bath at a perfect temperature, but my water heater is busted. I have a jumbo cauldron at my fireplace, though, so I boil up 25 gallons of water, and mix it with my ice cold tap water, trying to get the temperature just right.</p>\n\n<p>Just to make the math easy, I have 25 gallons of boiling water at 100c, and I mix it with 25 gallons of 25 gallons of almost freezing water, call it 1c.  Will that give me a nice 50 gallon bath at 50c? Or do I end up with some other temperature?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/r06she/can_i_average_out_water_temperature_by_adding/",
  "subreddit": "askscience",
  "id": "r06she",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's say I want my bath at a perfect temperature, but my water heater is\nbusted. I have a jumbo cauldron at my fireplace, though, so I boil up 25 gallons\nof water, and mix it with my ice cold tap water, trying to get the temperature\njust right.\n\nJust to make the math easy, I have 25 gallons of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、お風呂の温度を最適にしたいのに、給湯器が故障しているとします。\n壊れてしまったとします。暖炉にジャンボ釜があるので、25ガロンの水を沸騰させて\n沸騰させて、氷のように冷たい水道水と混ぜて、ちょうどいい温度にしようとします。\nちょうどいい温度になるようにしています。\n\n計算を簡単にするために、25ガロンの水は...",
      "title": "特定の温度での体積を加えることで、水温を「平均化」することはできますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比方说，我想在一个完美的温度下洗澡，但我的热水器是\n坏了。不过，我的壁炉里有一个大锅，所以我烧了25加仑的水，并与我的冰冷自来水混合，试图让温度降到最低。\n的水，并将其与我的冰冷自来水混合，试图使温度\n恰到好处。\n\n为了便于计算，我有25加仑的...",
      "title": "我可以通过添加特定温度下的体积来 \"平均化 \"水温吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比方說，我想在一個完美的溫度下洗澡，但我的熱水器是\n壞了。不過，我的壁爐裏有一個大鍋，所以我燒了25加侖的水，並與我的冰冷自來水混合，試圖讓溫度降到最低。\n的水，並將其與我的冰冷自來水混合，試圖使溫度\n恰到好處。\n\n爲了便於計算，我有25加侖的...",
      "title": "我可以通過添加特定溫度下的體積來 \"平均化 \"水溫嗎？"
    }
  ]
}