{
  "author": "TrueSpins",
  "the_new_excerpt": "Honestly, I don't really mind pumping coins, particularly joke coins like Doge.\nBut if I see another post from someone saying \"but what if Doge is the next\nBitcoin\" I think I'll crack!\n\nYou can only pump a coin like Doge so far! I'm seeing people saying \"what if it\ngets to $100 or even $1000?\". Do…",
  "original_created_utc": 1612729690,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，我并不介意抽币，尤其是像Doge这样的玩笑币。\n但如果我看到有人再发帖说 \"但如果Doge是下一个......\"。\n比特币 \"我想我会破解!\n\n像Doge这样的币，你只能抽到这么多! 我看到有人在说 \"如果它\n得到100元甚至1000元？\"。做...",
      "title": "Dogecoin每个区块产生1万个币，速度大概是每分钟1个区块。那就是每天大约1400万个币。让我们看看在这些数字对你不利的情况下，你能维持多久的抽水。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，我並不介意抽幣，尤其是像Doge這樣的玩笑幣。\n但如果我看到有人再發帖說 \"但如果Doge是下一個......\"。\n比特幣 \"我想我會破解!\n\n像Doge這樣的幣，你只能抽到這麼多! 我看到有人在說 \"如果它\n得到100元甚至1000元？\"。做...",
      "title": "Dogecoin每個區塊產生1萬個幣，速度大概是每分鐘1個區塊。那就是每天大約1400萬個幣。讓我們看看在這些數字對你不利的情況下，你能維持多久的抽水。"
    }
  ],
  "title": "Dogecoin produces 10,000 coins per block at a rate of roughly 1 block per minute. That's around 14m coins per day. Let's see how long you can sustain a pump with those numbers against you.",
  "created_utc": 1612744916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly, I don&#39;t really mind pumping coins, particularly joke coins like Doge. But if I see another post from someone saying &quot;but what if Doge is the next Bitcoin&quot; I think I&#39;ll crack!</p>\n\n<p>You can only pump a coin like Doge so far! I&#39;m seeing people saying &quot;what if it gets to $100 or even $1000?&quot;. Do they have any idea how many of these coins are in circulation?! </p>\n\n<p>Part of the whole joke of Doge was its rediculous supply cap and real terms inflation, with literally billions of new coins being generated annually. You can only sustain the upwards trajectory of something like that for so long...</p>\n\n<p>If you&#39;re a newbie playing with Doge, these is a huge chance your going to lose next to everything. The actual coin is designed to lose &quot;value&quot;, the fundamental function of the coin is actively working against you!</p>\n</div><!-- SC_ON -->",
  "score": 17047,
  "permalink": "/r/CryptoCurrency/comments/leur6k/dogecoin_produces_10000_coins_per_block_at_a_rate/",
  "subreddit": "CryptoCurrency",
  "id": "leur6k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195576
}