{
  "author": "folkwoodswest",
  "the_new_excerpt": "Hello folks. Oops, I did it again ... panic sold $PLTR for a $2.5K loss\nyesterday and now just canNOT believe how dumb I was. This is easily my third if\nnot fourth time panic selling. I am just looking for others foolish mistakes and\nwhat they learned from them. What I learned is I am not good at…",
  "original_created_utc": 1609345025,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。哎呀，我又做了一次..。Panic以2.5万美元的亏损出售了潘多拉媒ltr\n昨天和现在都不敢相信我有多笨。这很容易就是我的第三个如果\n不是第四次恐慌性抛售。我只是在找别人犯的愚蠢的错误\n他们从他们身上学到了什么。我了解到的是我不擅长…",
      "title": "怜悯派对：我是如何跌入牛市的--分享你最大的“我到底为什么要那样做？！”请给我讲故事"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。哎呀，我又做了一次..。Panic以2.5萬美元的虧損出售了潘多拉媒ltr\n昨天和現在都不敢相信我有多笨。這很容易就是我的第三個如果\n不是第四次恐慌性拋售。我只是在找別人犯的愚蠢的錯誤\n他們從他們身上學到了什麼。我瞭解到的是我不擅長…",
      "title": "憐憫派對：我是如何跌入牛市的--分享你最大的“我到底爲什麼要那樣做？！”請給我講故事"
    }
  ],
  "title": "Pity Party: How I am Down in a Bull Market - share your biggest “Why the eff did I do that?!” stories please",
  "created_utc": 1609358240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello folks. Oops, I did it again ... panic sold $PLTR for a $2.5K loss yesterday and now just canNOT believe how dumb I was. This is easily my third if not fourth time panic selling. I am just looking for others foolish mistakes and what they learned from them. What I learned is I am not good at trading and from now on I will only go low and slow ... I’ve learned this lesson about four times now so I need it to stick. </p>\n\n<p>I am also hoping this post maybe helps someone else from making my same mistake. The old cliches are true ... you gotta just ride these waves and stick to your plan. My impulse plays never go well ... even if some of them do, one of them is all it takes to wipe out those sweet gains. </p>\n\n<p>Anyone care to join my pity party and share their experiences (I just want them to feel better about my stupidity!)</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/investing/comments/kn54i4/pity_party_how_i_am_down_in_a_bull_market_share/",
  "subreddit": "investing",
  "id": "kn54i4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334776
}