{
  "author": "holyshithead",
  "original_created_utc": 1624838174,
  "title": "Day 3 Of Choosing To Buy Crypto Instead Of Cigarettes! Who Wants To Join In On The Fun!?",
  "created_utc": 1624851862,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So today wasn&#39;t completely miserable. But that was probably because I spent a good portion of it unconscious. I took about 3 naps just to try to get the day over quicker. I guess it&#39;s kinda cheating, but I did manage to put off the first cigarette for a long time using the patented naps technique, and I&#39;m happy to take that as a win. Still have a few left, so I guess tomorrow will be the face-the-music day instead. Wouldn&#39;t that be something if I got down to my last cig and I just kept putting off smoking it forever? I like the idea of that.</p>\n\n<p>So I bought another $6.27 of btc today (0.00018532), which brings the total so far up to 0.00057061. Damn near a full bitcoin already! I probably won&#39;t mention specific numbers from now on just to be safe, but I am keeping track of each purchase including the price when I bought, and I&#39;ll make that into a spreadsheet for future generations to admire and save humanity with. I&#39;m really interested to see how things average out when the price has more movement. Lately with all this crab walking the price has been relatively close. I don&#39;t watch the charts much, I just go on once a day and buy at whatever the price is. We&#39;ll see how this pans out in the long run.</p>\n\n<p>So how did everybody else do? Still hanging on? What are you guys buying with your cigarette money?</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/o98nlb/day_3_of_choosing_to_buy_crypto_instead_of/",
  "subreddit": "CryptoCurrency",
  "id": "o98nlb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So today wasn't completely miserable. But that was probably because I spent a\ngood portion of it unconscious. I took about 3 naps just to try to get the day\nover quicker. I guess it's kinda cheating, but I did manage to put off the first\ncigarette for a long time using the patented naps technique,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、今日は完全に悲惨な状態ではなかった。しかし、それはおそらく、私がその大半を\n意識を失っていたからだと思います。一日を早く終わらせようと、3回ほど昼寝をしました。\n早く終わらせようと3回ほど昼寝をしました。ちょっとズルいかもしれませんが、特許を取得したタバコを使って、1本目のタバコをずっと先延ばしにしました。\n特許を取得した昼寝のテクニックを使って、最初のタバコをずっと先延ばしにしていましたよ。",
      "title": "タバコの代わりに暗号を買うことを選んで3日目! 誰か一緒に楽しみませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以今天并不完全是悲惨的。但这可能是因为我花了很长时间\n很大一部分时间是无意识的。我睡了大约3个午觉，试图让这一天\n更快结束。我想这有点像作弊，但我确实设法推迟了第一支\n使用专利的小睡技术，推迟了很长时间，...",
      "title": "选择购买加密货币而不是香烟的第三天! 谁想加入这个行列！？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以今天並不完全是悲慘的。但這可能是因爲我花了很長時間\n很大一部分時間是無意識的。我睡了大約3個午覺，試圖讓這一天\n更快結束。我想這有點像作弊，但我確實設法推遲了第一支\n使用專利的小睡技術，推遲了很長時間，...",
      "title": "選擇購買加密貨幣而不是香菸的第三天! 誰想加入這個行列！？"
    }
  ]
}