{
  "author": "prettymfthrowaway",
  "original_created_utc": 1634203741,
  "title": "Would I see significant progress from doing 100 pushups per day?",
  "created_utc": 1634219724,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay so right now I&#39;m in university and I realised I won&#39;t be able to afford a gym, there&#39;s no way its happening. </p>\n\n<p>So instead of doing gym exercises 3 times a week, I wanted to do bodyweight exercises everyday. </p>\n\n<p>If I were to do 100 pushups, 100 situps, 100 squats and 100 calf raises everday, will I still be able to put on close to a good amount of muscle as if I were actually going to the gym 3 times a week?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/q7w6ry/would_i_see_significant_progress_from_doing_100/",
  "subreddit": "NoStupidQuestions",
  "id": "q7w6ry",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay so right now I'm in university and I realised I won't be able to afford a\ngym, there's no way its happening.\n\nSo instead of doing gym exercises 3 times a week, I wanted to do bodyweight\nexercises everyday.\n\nIf I were to do 100 pushups, 100 situps, 100 squats and 100 calf raises everday,\nwill I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、私は大学に通っていますが、ジムに通う余裕がないことに気づきました。\nジムに通う余裕はありません。\n\nそこで、週3回のジムでのエクササイズの代わりに、毎日自重エクササイズをしたいと思いました。\nエクササイズをしたいと思いました。\n\n腕立て伏せ100回、腹筋100回、スクワット100回、カーフレイズ100回を毎日行うとしたら、私は..,\n果たして私は...",
      "title": "1日に100回の腕立て伏せをすることで、大きな進歩があるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，现在我在上大学，我意识到我将无法负担得起一个健身房。\n健身房，这是不可能的。\n\n因此，我不想每周做3次健身运动，而是想每天做体重练习。\n练习。\n\n如果我每天做100个俯卧撑、100个仰卧起坐、100个下蹲和100个小腿抬高。\n我是否会...",
      "title": "每天做100个俯卧撑，我会看到明显的进步吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，現在我在上大學，我意識到我將無法負擔得起一個健身房。\n健身房，這是不可能的。\n\n因此，我不想每週做3次健身運動，而是想每天做體重練習。\n練習。\n\n如果我每天做100個俯臥撐、100個仰臥起坐、100個下蹲和100個小腿擡高。\n我是否會...",
      "title": "每天做100個俯臥撐，我會看到明顯的進步嗎？"
    }
  ]
}