{
  "author": "WeenisWrinkle",
  "the_new_excerpt": "https://reut.rs/3dxM6RH\n\nU.S. employers hired more workers than expected in March, spurred by increased\nvaccinations and more pandemic relief money from the government, cementing\nexpectations that an economic boom was underway.\n\nNonfarm payrolls surged by 916,000 jobs last month, the Labor…",
  "original_created_utc": 1617367458,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://reut.rs/3dxM6RH\n\n美国雇主3月份雇佣的工人数量超过预期，受增加的刺激。\n疫苗接种和政府提供更多的疫情救援资金，巩固了。\n经济繁荣的预期。\n\n上个月非农就业岗位激增91.6万个，劳工...",
      "title": "美国3月就业增长加速；失业率降至6.0%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://reut.rs/3dxM6RH\n\n美國僱主3月份僱傭的工人數量超過預期，受增加的刺激。\n疫苗接種和政府提供更多的疫情救援資金，鞏固了。\n經濟繁榮的預期。\n\n上個月非農就業崗位激增91.6萬個，勞工...",
      "title": "美國3月就業增長加速；失業率降至6.0%。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "https://reut.rs/3dxM6RH\n\n米国の3月の雇用者数は予想を上回り、ワクチン接種の増加が追い風となる\n予防接種の増加と政府によるパンデミック対策費の増額により、米国の雇用者数は予想以上に増加し、景気回復への期待が高まった。\n米国の雇用者数は、予防接種の増加や政府によるパンデミック対策費用の増加などにより、予想を上回るペースで増加し、景気回復への期待が高まっている。\n\n非農業部門の雇用者数は916,000人増加した。",
      "title": "米国、3月の雇用増加が加速、失業率は6.0％に低下"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "https://reut.rs/3dxM6RH\n\n米国の3月の雇用者数は予想を上回り、ワクチン接種の増加が追い風となる\n予防接種の増加と政府によるパンデミック対策費の増額により、米国の雇用者数は予想以上に増加し、景気回復への期待が高まった。\n米国の雇用者数は、予防接種の増加や政府によるパンデミック対策費用の増加などにより、予想を上回るペースで増加し、景気回復への期待が高まっている。\n\n非農業部門の雇用者数は916,000人増加した。",
      "title": "米国、3月の雇用増加が加速、失業率は6.0％に低下"
    }
  ],
  "title": "U.S. job growth accelerates in March; unemployment rate falls to 6.0%",
  "created_utc": 1617370502,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://reut.rs/3dxM6RH\">https://reut.rs/3dxM6RH</a></p>\n\n<p>U.S. employers hired more workers than expected in March, spurred by increased vaccinations and more pandemic relief money from the government, cementing expectations that an economic boom was underway.</p>\n\n<p>Nonfarm payrolls surged by 916,000 jobs last month, the Labor Department said on Friday. That was be the biggest gain since last August. Data for February was revised higher to show 468,000 jobs created instead of the previously reported 379,000.</p>\n\n<p>Economists polled by Reuters had forecast payrolls increasing by 647,000 jobs in March. The unemployment rate fell to 6.0% last month from 6.2% in February. The unemployment rate has been understated by people misclassifying themselves as being “employed but absent from work.”</p>\n\n<p>Economists expect job growth will average at least 700,000 per month in the second and third quarters. That, combined with the fiscal stimulus and about $19 trillion in excess savings accumulated by households during the pandemic, is expected to unleash a powerful wave of pent-up demand.   </p>\n\n<p>First-quarter gross domestic product estimates are as high as a 10.0% annualized rate. The economy grew at a 4.3% pace in the fourth quarter. Growth this year could top 7%, which would be the fastest since 1984. The economy contracted 3.5% in 2020, the worst performance in 74 years.</p>\n</div><!-- SC_ON -->",
  "score": 2595,
  "permalink": "/r/investing/comments/mijlje/us_job_growth_accelerates_in_march_unemployment/",
  "subreddit": "investing",
  "id": "mijlje",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961877881
}