{
  "author": "possa95",
  "original_created_utc": 1627739907,
  "title": "So, honestly. I know it's an unpopular opinion, but don't you think we may just be repeating the same bounces of 2014 and 2018?",
  "created_utc": 1627756236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is not intended to be a FUD post, I swear. Yes, I may be conditioned by the fact I didn&#39;t buy as much as I wanted before this rally, I say that for full disclosure, but I am also reviewing the chart quite frequently these last weeks and I&#39;m trying to picture what was in the mind of crypto investors in 2014 and 2018 when there were these two rallies soon after the relative crashes. </p>\n\n<p><a href=\"https://preview.redd.it/67ysbr7kyje71.png?width=631&amp;format=png&amp;auto=webp&amp;s=4616f44217f8863def300c5647b01b030b1f6772\">2014</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5wwakg9ryje71.png?width=854&amp;format=png&amp;auto=webp&amp;s=4e43dee42747569ffbf7ee9fc7c55284ff5f393f\">2018</a></p>\n\n<p>They were probably saying the same things we are saying now, right?</p>\n\n<p>To me, these don&#39;t seem much different from the one we are experimenting right now:</p>\n\n<p><a href=\"https://preview.redd.it/qwnuxn7vzje71.png?width=442&amp;format=png&amp;auto=webp&amp;s=81f09bf073b6e8d5e319cd65e9fdc0d69f0516a3\">2021</a></p>\n\n<p>Yes, the context is different, there are many more whales now, many financial institutions, etc. and this is a difference that mustn&#39;t be overlooked. But really, every single time BTC goes through a bull run it gets a bounce like this. I get that everyone is really excited and I am too for my decent investment, but I have only heard/read bullish comments saying BTC is going to 100k+ no doubt and almost nobody pointing out what I wrote in this post.</p>\n\n<p>I am genuinely curious to hear your opinions on the matter - if you agree with what I am suggesting or if you disagree, and if that&#39;s the case, why I am wrong. I am totally, 100% open to the possibility that I may be wrong to say that, as I am absolutely not an expert TA.</p>\n\n<p>&#x200B;</p>\n\n<p>Now if you want to downvote you&#39;re free to do it, just not too much please!</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/ov7mbd/so_honestly_i_know_its_an_unpopular_opinion_but/",
  "subreddit": "CryptoCurrency",
  "id": "ov7mbd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is not intended to be a FUD post, I swear. Yes, I may be conditioned by the\nfact I didn't buy as much as I wanted before this rally, I say that for full\ndisclosure, but I am also reviewing the chart quite frequently these last weeks\nand I'm trying to picture what was in the mind of crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはFUDの投稿を意図したものではありません、誓います。確かに、私はこのラリーの前に欲しかったものを買わなかったという条件付きかもしれません。\n私はこのラリーの前に望んでいたほど買わなかったので、条件付きかもしれませんが、完全な開示のために言います。\nしかし、私はこの数週間、かなり頻繁にチャートを見直しています。\nそして、cryptoが何を考えていたのかを想像しようとしています...",
      "title": "だから、正直なところ 不人気な意見だとは思いますが、2014年と2018年の同じバウンドを繰り返しているだけかもしれないと思いませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发誓，这不是要做一个FUD帖子。是的，我可能受制于\n事实上，我在这次反弹前没有买到我想要的东西，我这么说是为了充分披露。\n但在过去的几周里，我也在频繁地查看图表。\n我正在努力想象加密货币的想法...",
      "title": "所以，说实话。我知道这是一个不受欢迎的观点，但你不觉得我们可能只是在重复2014年和2018年的反弹吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發誓，這不是要做一個FUD帖子。是的，我可能受制於\n事實上，我在這次反彈前沒有買到我想要的東西，我這麼說是爲了充分披露。\n但在過去的幾周裏，我也在頻繁地查看圖表。\n我正在努力想象加密貨幣的想法...",
      "title": "所以，說實話。我知道這是一個不受歡迎的觀點，但你不覺得我們可能只是在重複2014年和2018年的反彈嗎？"
    }
  ]
}