{
  "author": "SenseiRaheem",
  "original_created_utc": 1626835771,
  "title": "You need to fight the \"I need to be rich now\" mentality",
  "created_utc": 1626863478,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the strongest feelings that anyone in our modern world will experience is the overwhelming desire for a financial lightning strike that means you can wake up tomorrow and solve all of your financial problems.</p>\n\n<p>This mentality sailed in during the last big crypto bull run and crash, it got a huge boost with a few stocks back in January, but the truth is that it&#39;s always there: money solves problems and the more you have the more problems you can solve.</p>\n\n<p>This drives so many of us to feel like we have to see huge gains as soon as possible. It also drives many people to sell and take a big loss if they didn&#39;t win fast enough.</p>\n\n<p>If you can see past that, if you can say, &quot;This money I&#39;m investing in crypto isn&#39;t something I&#39;m going to touch yet. I&#39;ll buy a little bit every week for the next 2 years,&quot; then you are going to be okay. Yes, it&#39;s some Jedi-master patience shit that will get tested every now and again. But if you can keep buying, consistently, you&#39;re going to fare much better in the long run.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/ooh7mq/you_need_to_fight_the_i_need_to_be_rich_now/",
  "subreddit": "CryptoCurrency",
  "id": "ooh7mq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One of the strongest feelings that anyone in our modern world will experience is\nthe overwhelming desire for a financial lightning strike that means you can wake\nup tomorrow and solve all of your financial problems.\n\nThis mentality sailed in during the last big crypto bull run and crash, it got…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現代人が経験する最も強い感情の1つは\n明日目が覚めたら、すべての問題が解決していた」というような、経済的な稲妻を求める気持ちが強い。\n明日起きれば、経済的な問題をすべて解決できるというものです。\n\nこのような考え方は、前回の暗号の大暴騰と暴落の際にも見られましたが、その際にも...",
      "title": "今すぐ金持ちにならなければならない」という考え方と戦う必要があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我们的现代世界中，任何人都会经历的最强烈的感觉之一是\n压倒性的愿望是希望有一个金融闪电，这意味着你可以在明天醒来时解决你的所有问题。\n明天醒来，解决你所有的财务问题。\n\n这种心态在上一次大的加密货币牛市运行和崩溃期间驶入，它得到...",
      "title": "你需要与 \"我现在需要变得富有 \"的心态作斗争"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們的現代世界中，任何人都會經歷的最強烈的感覺之一是\n壓倒性的願望是希望有一個金融閃電，這意味着你可以在明天醒來時解決你的所有問題。\n明天醒來，解決你所有的財務問題。\n\n這種心態在上一次大的加密貨幣牛市運行和崩潰期間駛入，它得到...",
      "title": "你需要與 \"我現在需要變得富有 \"的心態作鬥爭"
    }
  ]
}