{
  "author": "Nervous_Sky_5167",
  "original_created_utc": 1624415129,
  "title": "Technical Analysis On Our Current Price Correction, A Case Study",
  "created_utc": 1624447924,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>ABSTRACT</strong></p>\n\n<p>Bitcoin&#39;s bull-run is long from over, current fluctuations in the market is just a result of market manipulation. We had a failure to rally, causing an ever harder bear trap, but things should clear up in the following weeks. Bullish!</p>\n\n<p>&#x200B;</p>\n\n<p><strong>A WYCKOFF METHOD</strong></p>\n\n<p>There is no doubt that Bitcoin had a distributive Wyckoff pattern when comparing historical price trends (Fig. 1) to a textbook derivative (Fig. 2). The price trend similarities are too great for even cultish doubt.</p>\n\n<p>Usually accompanying a distributive phase, however, are accumulation patterns. Comparing historical charts (Fig. 3) to textbook derivatives (Fig. 4), there is a clear resemblance between the two. However, the only noticeable discrepancy is the second major correction/ bear trap, whereas a textbook model by then has already advanced well in price. This brings us to the fundamental reasons for our current correction.</p>\n\n<p>Just before we continue, Wyckoff patterns <strong>only</strong> happen during <em>heavy</em> market manipulation. A key takeaway from here is that the market is under heavy manipulative stress. You guys wanted institutionalized interest, and you got your wish! Just remember that these companies aren&#39;t here to play charity, but are in the business of making money and only at that. These market manipulators which we will now refer to as &#39;MM&#39; are crucial to understanding Bitcoin price theory.</p>\n\n<p><a href=\"https://preview.redd.it/h0zgtyyg0x671.png?width=1488&amp;format=png&amp;auto=webp&amp;s=d2c2932af82f139383d3185e2db1f238e702f520\">Fig. 1, Bitcoin&#39;s historical price trends with Wyckoff distribution indicators.</a></p>\n\n<p><a href=\"https://preview.redd.it/jbcsj1sn0x671.png?width=975&amp;format=png&amp;auto=webp&amp;s=d806703681101a0d920551e728d52d25e85448aa\">Fig. 2, a textbook derivative of Wyckoff Distribution (StockCharts, n.d.).</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/w0aygyku1x671.png?width=1489&amp;format=png&amp;auto=webp&amp;s=85a70feb077dcd105ab212d194927e3ecfe5e55e\">Fig. 3, historical price trends with Wyckoff accumulation markers.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ik1tt49y1x671.png?width=975&amp;format=png&amp;auto=webp&amp;s=1c3f7236040abba7b5be023546368da77bcf7b9b\">Fig. 4, a textbook derivative of Wyckoff accumulation (StockCharts, n.d.). </a></p>\n\n<p><strong>PRICE TREND TECHNICAL FUNDAMENTALS</strong></p>\n\n<p>In order for a sustained upwards move in Bitcoin&#39;s price, buying and price strength potential or RSI (Relative Strength Index) must be strong. This is charted as RSI and stochastic graph lines, which show when Bitcoin is facing heavy resistance (market weakness) or support (market strength).</p>\n\n<p>During the phase when Bitcoin was expected to consolidate and make strong upwards movement via Wyckoff accumulation patterns, stochastic and RSI values were too high or <em>oversold</em>, meaning that prices were facing an imminent correction (Fig. 5). Subsequently, we crashed as expected to roughly 28.5k.</p>\n\n<p>Now as for Bitcoin&#39;s future in terms of technical fundamentals, stochastic and RSI are expected to recover from literally right now to 2 weeks at most. This is because after an expected price correction, stochastic and RSI usually lay low to accumulate (as they have for the past few days) before exploding the price again (Fig. 6).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/j59iske54x671.png?width=1439&amp;format=png&amp;auto=webp&amp;s=c9a295ec81671f72e9f8d71891c243dcaf3b20f4\">Fig. 5, a Bitcoin chart primarily based with RSI and stochastic indicators. </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/h0qzeji09x671.png?width=1440&amp;format=png&amp;auto=webp&amp;s=99c62206a60895c0e866a92de53dd743e77ef979\">Fig. 6, a Bitcoin chart with RSI/ stochastic cool-offs/ correction phase durations. Notice how accurate a high stochastic (the orange and blue lines) correlates to an immediate price correction. </a></p>\n\n<p><strong>PRICE TREND THEORY</strong></p>\n\n<p>Now why did this happen? Why did Bitcoin crash when Wyckoff accumulation said otherwise? First of all, textbook derivatives are <strong>only derivatives.</strong> They are only an attempt to model Wyckoff theorem with the path of least resistance, although in reality, anything could happen.</p>\n\n<p>Now as to why things went a specific way, in Wyckoff theory, during an accumulation phase, there usually will be price bounce&#39;s or corrections like such influenced by the MM with diminished volume in order for these manipulators to confirm that there is low circulating supply in the market. These price bounces, otherwise known as &#39;bear traps&#39;, are also traps to force uneasy investors sell or liquidate, in the process effectively shaking off any money that could otherwise interfere with price advances.</p>\n\n<p>During these phases, these shaken investors to sell at a bargain which further boost&#39;s MM&#39;s pockets. In the process, it also helps allocate more market control to MM. The more sellers willing to sell at low prices who are burnt out the market means that MM has more respective control to sell Bitcoins. This provides a strong foundation to jack up Bitcoin prices in their own profit, because controlling supply means controlling its price.</p>\n\n<p>As for current circumstances, the trading volume to massive price correction ratio is doing quite well (Fig. 7). A massive correction <em>with</em> low trading volume is certainly a good sign that this second spring did its job well. Correlated with an extremely overbought RSI/ stochastic (which is a good thing) means great times to come.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/yodbx32h9x671.png?width=736&amp;format=png&amp;auto=webp&amp;s=e0b4822a97d29059fb1efac59c71a760ad93c8de\">Fig. 7, a chart depicting Bitcoin&#39;s price to volume which are the white bar lines under the price trend.</a></p>\n\n<p><strong>LONG TERM ANALYSIS</strong></p>\n\n<p>A lot of people have wondered that our massive price correction spanning a few months is the start of a Bitcoin bear market. Although quite the controversial topic, the data suggests that Bitcoin&#39;s current bull-market still has long ways to go.</p>\n\n<p>Bitcoin has followed a certain logarithmic and lengthening cycle pattern for 12 years, quite literally since it&#39;s inception! Since nothing fundamental has changed like different block times or cancelled halvings, there is no reason for Bitcoin to break this trend. Depicted below is a graph showing these long term trends as well has the predicted time that Bitcoin will hit its peak and end the bull market (Fig. 8).</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/crmt8zzpax671.png?width=1488&amp;format=png&amp;auto=webp&amp;s=dd990efe7a0c4756be108067fb3c4b136de0ec50\">Fig. 8, a modified logarithmic function chart depicting the expected dates when Bitcoin will end its bull run which is during mid-late 2022. </a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>PUTTING IT ALL TOGETHER</strong></p>\n\n<p>Bitcoin is bullish, no doubt about it! The bear traps and dips we are currently facing are no more than minor bunny hills. They&#39;re supposed to scare you into panic selling, because that&#39;s how bear traps work. If they are not aggressive and sudden enough, they simply wouldn&#39;t be convincing enough to do its job.</p>\n\n<p>Although its extremely speculative to speak predictions in the current volatile state of the market, here&#39;s just a short-term price prediction to look up to. Dubious, dubious speculation indeed, but we all need some peace of mind, don&#39;t we?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7vayjr4bcx671.png?width=1500&amp;format=png&amp;auto=webp&amp;s=cb0963ecc05138d23e468ae0d2efc7d553a3742e\">Fig. 9, a chart putting stochastic/ RSI strength with the Wyckoff method together to form a cohesive price trend prediction. </a></p>\n\n<p>&#x200B;</p>\n\n<p><em>Disclaimer: I am not your financial advisor nor does this content attempt to replicate any of the sort. This content is listed strictly for entertainment and educational purposes. When in doubt, contact your own professional. Your money, your problem (unless you hire me). But in all seriousness, don&#39;t lol.</em></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Pictures unoriginal to me</strong></p>\n\n<p>StockCharts. (n.d.). <em>The Wyckoff Method: A Tutorial</em>. StockCharts. Retrieved from <a href=\"https://school.stockcharts.com/doku.php?id=market_analysis:the_wyckoff_method\">https://school.stockcharts.com/doku.php?id=market_analysis:the_wyckoff_method</a></p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: I don&#39;t know how to spell &#39;abstract&#39; apparently. Corrected. </p>\n</div><!-- SC_ON -->",
  "score": 157,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?auto=webp&s=5509dd0a0499ca678760506e54425f817096be79",
          "width": 975,
          "height": 857
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=108&crop=smart&auto=webp&s=9ec60faf7bbc02f087701efc72cd642c45b16b1e",
            "width": 108,
            "height": 94
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=216&crop=smart&auto=webp&s=c41270d9d5fd415364e85904d0005542b7c8123e",
            "width": 216,
            "height": 189
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=320&crop=smart&auto=webp&s=6e0f070360a643e94ff5ad765d28f8a033f269c1",
            "width": 320,
            "height": 281
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=640&crop=smart&auto=webp&s=47edc4caa731cbf75d1b803d4650941c05a1c156",
            "width": 640,
            "height": 562
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=960&crop=smart&auto=webp&s=2979c8937d42a9ae8e0a6df4b6442b4aa9393aba",
            "width": 960,
            "height": 843
          }
        ],
        "variants": {},
        "id": "ajZNWBsVks0mTqZqNwcx42a49I_8UnZLPbQinFZPyJs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/o63io9/technical_analysis_on_our_current_price/",
  "subreddit": "CryptoCurrency",
  "id": "o63io9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ABSTRACT\n\nBitcoin's bull-run is long from over, current fluctuations in the market is just\na result of market manipulation. We had a failure to rally, causing an ever\nharder bear trap, but things should clear up in the following weeks. Bullish!\n\n\n\nA WYCKOFF METHOD\n\nThere is no doubt that Bitcoin had…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "概要\n\nビットコインのブルランはまだ終わっておらず、現在の市場の変動は市場操作の結果に過ぎません。\nは市場操作の結果である。私たちはラリーに失敗し、これまで以上に厳しいベアトレンドを引き起こしました。\nしかし、次の数週間で状況は改善するだろう。Bullish!\n\n\n\nワイコフ方式\n\nビットコインには間違いなく...",
      "title": "テクニカル分析では、現在の価格修正について、ケーススタディを行っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ABSTRACT\n\n比特币的牛市还没有结束，目前市场的波动只是\n是市场操纵的结果。我们有一个失败的反弹，导致一个越来越难的\n越来越难的熊市陷阱，但在接下来的几周里，事情应该会得到澄清。看涨!\n\n\n\n维科夫法\n\n毫无疑问，比特币曾...",
      "title": "关于我们当前价格修正的技术分析，一个案例研究"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ABSTRACT\n\n比特幣的牛市還沒有結束，目前市場的波動只是\n是市場操縱的結果。我們有一個失敗的反彈，導致一個越來越難的\n越來越難的熊市陷阱，但在接下來的幾周裏，事情應該會得到澄清。看漲!\n\n\n\n維科夫法\n\n毫無疑問，比特幣曾...",
      "title": "關於我們當前價格修正的技術分析，一個案例研究"
    }
  ]
}