{
  "author": "republicj",
  "the_new_excerpt": "I have no right to complain, and I'm not looking for sympathy as such. I\ndiscovered something about myself and I wanted to share. I just started\ninvesting last year and dabbled in this and that. Made couple thousand in NIO\nand TSLA rise but nothing to write home about.\n\nI went in on GME with my life…",
  "original_created_utc": 1612509621,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我没有权利抱怨，我也不是在寻求同情。I\n发现了一些关于自己的东西，我想分享。我刚刚开始\n去年投资，涉足了这个那个。赚了几千块钱的NIO\n和TSLA的上涨，但没有什么好写的。\n\n我在GME上用我的生命... ...",
      "title": "摆脱对金钱的忧郁"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我沒有權利抱怨，我也不是在尋求同情。I\n發現了一些關於自己的東西，我想分享。我剛剛開始\n去年投資，涉足了這個那個。賺了幾千塊錢的NIO\n和TSLA的上漲，但沒有什麼好寫的。\n\n我在GME上用我的生命... ...",
      "title": "擺脫對金錢的憂鬱"
    }
  ],
  "title": "Getting over depression over money",
  "created_utc": 1612531931,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have no right to complain, and I&#39;m not looking for sympathy as such. I discovered something about myself and I wanted to share. I just started investing last year and dabbled in this and that. Made couple thousand in NIO and TSLA rise but nothing to write home about.</p>\n\n<p>I went in on GME with my life savings at around $44, and was up about 500k. I fell victim to the moving goalpost and didn&#39;t sell. I sold while it was crashing and netted about 90k profits. I have no reason to complain and I learned so many valuable lessons. The nature of man&#39;s greed, the importance to locking in profits, not counting chickens before they hatch, etc. I got lost in my vision of what I could do with that money, not when it was at 460 but at 1000 etc.</p>\n\n<p>Two weeks ago if someone told me that I was going to make about 85k post tax plus my initial investment back, I would have jumped for joy. But I&#39;m going through depression that I missed out on the 500k and I wake up from sleeping with flashing pangs of regret. I know it&#39;s just the start of my lifelong investment career, and I&#39;ll have more opportunities. Pain is all relative. </p>\n\n<p>Sometimes, money is so easy to make. Other times, it&#39;s the hardest thing to accumulate.</p>\n\n<p>Always be happy with your profits, green is green, take home what you can while you can.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/stocks/comments/ld1yva/getting_over_depression_over_money/",
  "subreddit": "stocks",
  "id": "ld1yva",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201962
}