{
  "author": "senseofphysics",
  "original_created_utc": 1638003126,
  "title": "The Phoenicians colonized the Mediterranean world, and many modern cities still bear Phoenician names. But how come their ruins are so lackluster for poor, at least compared to their Greek and Roman counterparts?",
  "created_utc": 1638034812,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Phoenicians seem to be one of the most influential people of the Mediterranean world; yet they lack a sense of art or unique architecture in my opinion (compared to the Greeks and Romans). Is it just survival bias, where what survived of their civilization isn’t great to our eyes?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/r39i7z/the_phoenicians_colonized_the_mediterranean_world/",
  "subreddit": "AskHistorians",
  "id": "r39i7z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Phoenicians seem to be one of the most influential people of the\nMediterranean world; yet they lack a sense of art or unique architecture in my\nopinion (compared to the Greeks and Romans). Is it just survival bias, where\nwhat survived of their civilization isn’t great to our eyes?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フェニキア人は、地中海で最も影響力のある人々の一人であると思われます。\nフェニキア人は地中海世界で最も影響力のある人々の一人だと思います。\nフェニキア人は、地中海世界で最も影響力のある人々の一人であると思われます。これは生存バイアスなのでしょうか。\n生き残りのバイアスなのでしょうか？",
      "title": "地中海世界を植民地化したフェニキア人は、現代でも多くの都市にフェニキア人の名前を残しています。しかし、彼らの遺跡は、少なくともギリシャやローマの遺跡に比べて、なぜこんなにも貧弱なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "腓尼基人似乎是地中海世界中最有影响力的民族之一。\n地中海世界；但在我看来，他们缺乏一种艺术感或独特的建筑。\n我认为他们缺乏艺术感或独特的建筑（与希腊人和罗马人相比）。这是否只是生存的偏见，其中\n他们的文明在我们眼中并不伟大？",
      "title": "腓尼基人对地中海世界进行了殖民统治，许多现代城市仍有腓尼基人的名字。但是，他们的遗迹怎么会如此乏善可陈，至少与希腊和罗马的遗迹相比是如此的可怜？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "腓尼基人似乎是地中海世界中最有影響力的民族之一。\n地中海世界；但在我看來，他們缺乏一種藝術感或獨特的建築。\n我認爲他們缺乏藝術感或獨特的建築（與希臘人和羅馬人相比）。這是否只是生存的偏見，其中\n他們的文明在我們眼中並不偉大？",
      "title": "腓尼基人對地中海世界進行了殖民統治，許多現代城市仍有腓尼基人的名字。但是，他們的遺蹟怎麼會如此乏善可陳，至少與希臘和羅馬的遺蹟相比是如此的可憐？"
    }
  ]
}