{
  "author": "Massive-Quarter-4156",
  "original_created_utc": 1634024444,
  "title": "What's your biggest Crypto regret?",
  "created_utc": 1634042126,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What would you guys say is your biggest regret when it comes to Crypto? It could be selling ETH at $1000, or hell you could be the guy who used Bitcoin to buy Pizza back in 2011.</p>\n\n<p>I haven&#39;t been in Crypto that long as I started beginning of the year, so probably that should be my biggest regret given I had a couple of friends who introduced me to it but I didn&#39;t pay too much attention around Covid last year.</p>\n\n<p>But since I&#39;ve been investing, I would say selling Fantom at $0.75 after buying in around $.30 would be mine. To be honest though I was pretty happy to double my money at the time coz it had been up and down a lot! If only though!</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/q6gwm4/whats_your_biggest_crypto_regret/",
  "subreddit": "CryptoCurrency",
  "id": "q6gwm4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What would you guys say is your biggest regret when it comes to Crypto? It could\nbe selling ETH at $1000, or hell you could be the guy who used Bitcoin to buy\nPizza back in 2011.\n\nI haven't been in Crypto that long as I started beginning of the year, so\nprobably that should be my biggest regret…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんは、Cryptoに関して一番後悔していることは何だと思いますか？それは\nETHを1000ドルで売ったことかもしれないし、2011年にピザを買うのにビットコインを使った人かもしれません。\n2011年にピザを買うためにビットコインを使った人かもしれません。\n\n私は今年の初めに始めたので、それほど長くCryptoに関わっていません。\nそれが私の最大の後悔になるはずです...。",
      "title": "最大のCryptoの後悔は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "谈到加密货币，你们认为自己最大的遗憾是什么？它可能是\n可能是在1000美元时卖掉ETH，或者你可能是在2011年用比特币购买\n比萨的人。\n\n我加入加密货币的时间并不长，因为我是今年年初开始的，所以\n可能这应该是我最大的遗憾......",
      "title": "你最大的Crypto遗憾是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "談到加密貨幣，你們認爲自己最大的遺憾是什麼？它可能是\n可能是在1000美元時賣掉ETH，或者你可能是在2011年用比特幣購買\n比薩的人。\n\n我加入加密貨幣的時間並不長，因爲我是今年年初開始的，所以\n可能這應該是我最大的遺憾......",
      "title": "你最大的Crypto遺憾是什麼？"
    }
  ]
}