{
  "author": "momchilandonov",
  "the_new_excerpt": "Hi guys,\n\nI gave it a little thought and to me logically, obviously, factually etc. the\nbest long term investment (at least 20-30 years) in the world is in water. I\nmight have been slightly inspired by the ending of The Big Short where it's\nrevealed that Michael Burry invests mostly in water - he is…",
  "original_created_utc": 1612641314,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我稍微想了一下，在我看来，从逻辑上、明显上、事实上等。\n世界上最好的长期投资（至少20-30年）是水。I\n可能是受到了《大空头》结局的启发，在那里，它的。\n据透露，迈克尔-伯里主要投资于水--他是...",
      "title": "世界上最好的长期投资是水（海水淡化业务）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我稍微想了一下，在我看來，從邏輯上、明顯上、事實上等。\n世界上最好的長期投資（至少20-30年）是水。I\n可能是受到了《大空頭》結局的啓發，在那裏，它的。\n據透露，邁克爾-伯裏主要投資於水--他是...",
      "title": "世界上最好的長期投資是水（海水淡化業務）。"
    }
  ],
  "title": "Best long term investment in the world is in water (desalination business)",
  "created_utc": 1612650950,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys,</p>\n\n<p>I  gave it a little thought and to me logically, obviously, factually etc.  the best long term investment (at least 20-30 years) in the world is in  water. I might have been slightly inspired by the ending of The Big  Short where it&#39;s revealed that Michael Burry invests mostly in water -  he is also short in TSLA :).</p>\n\n<p>Specifically I am talking about investing in companies dealing with the desalination of seawater business.</p>\n\n<p>Facts supporting my claim/analysis:</p>\n\n<p>Human  population doesn&#39;t stop growing and the planet is already overpopulated  with around 2-3 billions. This only means more and more water  consumption.</p>\n\n<p>Humans are 50-60%  water. 2 days without water and you die. Long term investments like  Bitcoin and Gold cannot save you from dehydration if there is no water  to buy/drink. If two commodities (not essential to keeping you alive)  have trillions of $ of market cap, imagine what market cap could the  drinkable water reach if it becomes globally scarce.</p>\n\n<p>Still  most water we use is freshwater found in nature - this water is  exponentially decreasing due to the industry demands, the pollution and  the increase in population. Global climate change probably helps as  well.</p>\n\n<p>Literally almost everything  costs thousands of liters of water to make but we don&#39;t notice it  because there is still a lot of free/cheap and easily accessible water  for use. A cup of coffee takes 150 liters to produce. A kilogram of meat  takes 5000 - 20000 liters. 1 kg of chocolate takes 17 000 liters. Sure  not all of that is drinkable water but it&#39;s not dirty water as well so  water treatment plants will benefit from the need of such water.</p>\n\n<p>Desalination  of seawater is the only efficient, fast and cheap way to turn most of  the planet&#39;s water into drinkable water. The freshwater sources took  probably thousands of years to form and we almost depleted them mostly  in the last two centuries!</p>\n\n<p>The  desalination business is growing fast and is still very small which  looks like a great investment opportunity. Market cap is just $32  billion. The global desalination capacity increased by 65% between 2010  and 2015 without any major global water events. Even in California it&#39;s  already a perpetual water crisis without an easy solution. With the fast  depletion of water everyone around the world will be forced to look for  alternatives and they will all turn to desalination plants as there is  simply no alternative.</p>\n\n<p>At present there are <strong>35 desalination plants</strong> only in the UAE. They have no other efficient ways to get potable water as there are simply no freshwater sources around.</p>\n\n<p>How to invest?</p>\n\n<p>The  only almost perfect company I managed to find is CWCO (Consolidated  Water). I have stocks in it but I cannot make a very good recommendation  as I haven&#39;t discovered alternatives and I might be misleading  potential investors. I call the company almost perfect because it deals  with everything related to the business. But one issue is that currently  it heavily relies on tourism due to the location of it&#39;s plants. Do you  know of other 100% desalination companies?</p>\n\n<p>Most  of the currently available investments in water are overall a joke -  water ETFs/indexes contain mostly water supply/utility/sewage companies  and/or companies which use a lot of water which is very non optimal if  one expects the price of water to increase in time. Think about it. If  you know that gold will increase in price would you invest in a company  which finds gold or in one which sells shovels for digging of gold (and  other minerals)...</p>\n</div><!-- SC_ON -->",
  "score": 394,
  "permalink": "/r/investing/comments/le5cth/best_long_term_investment_in_the_world_is_in/",
  "subreddit": "investing",
  "id": "le5cth",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199857
}