{
  "author": "GreatnessAwait5",
  "the_new_excerpt": "For several years like many pajama-bound investors, I have gotten up in the\nmorning and turned on CNBC while setting up for my morning trades.\n\nI've always operated under the assumption that big investors run the network and\nare the ones with access to get invited on their shows to promote their…",
  "original_created_utc": 1612074795,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几年来，和许多睡衣的投资者一样，我也曾在\n早上，我在准备早上的交易时打开了CNBC。\n\n我一直以为是大投资者在经营着这个网络，而且\n是那些有机会被邀请上他们的节目，以促进他们的... ...",
      "title": "在CNBC报道GME事件后，你对CNBC的看法是否有所改变？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年來，和許多睡衣的投資者一樣，我也曾在\n早上，我在準備早上的交易時打開了CNBC。\n\n我一直以爲是大投資者在經營着這個網絡，而且\n是那些有機會被邀請上他們的節目，以促進他們的... ...",
      "title": "在CNBC報道GME事件後，你對CNBC的看法是否有所改變？"
    }
  ],
  "title": "Has your opinion of CNBC changed after their coverage of the GME story?",
  "created_utc": 1612093599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For several years like many pajama-bound investors, I have gotten up in the morning and turned on CNBC while setting up for my morning trades. </p>\n\n<p>I&#39;ve always operated under the assumption that big investors run the network and are the ones with access to get invited on their shows to promote their plays. It comes with the territory knowing that every guest is on there to push an agenda, but generally, my general feeling was they aren&#39;t out to screw you over and wanted to be helpful to their viewers.</p>\n\n<p>When I was learning about investing, I did value a lot of the advice they give on diversification, risk, and rising trends. I&#39;ve even got some massive returns from a few ideas I got solely from watching (MSTR +132% AMZN +73%, TGT +81%, NVDA +63%).</p>\n\n<p>Which takes us to this week where CNBC has been a constant whipping boy on <a href=\"/r/wallstreetbets\">r/wallstreetbets</a>. </p>\n\n<p>Most of Reddit seems to completely reject CNBC&#39;s report that Melvin has <a href=\"https://www.cnbc.com/2021/01/27/hedge-fund-targeted-by-reddit-board-melvin-capital-closed-out-of-gamestop-short-position-tuesday.html\">closed</a> out their short positions. If CNBC is in fact making false reports to benefit hedge funds, that is a very serious violation of trust.</p>\n\n<p>I&#39;m not sure what to think at this point. Has your trust in CNBC been shaken?</p>\n</div><!-- SC_ON -->",
  "score": 498,
  "permalink": "/r/stocks/comments/l96kjr/has_your_opinion_of_cnbc_changed_after_their/",
  "subreddit": "stocks",
  "id": "l96kjr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537987
}