{
  "author": "MyrganGyrgan",
  "original_created_utc": 1640812973,
  "title": "Why do so many extroverts take introversion as a personal affront?",
  "created_utc": 1640854026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like a lot of extroverts are personally offended by people who are shy or introverted or just plain quiet. It&amp;#39;s like they take your lack of social dynamism as a tacit implication that you don&amp;#39;t like them or that you&amp;#39;re rejecting them on some level. Even when you meet them halfway, it&amp;#39;s like they&amp;#39;re not satisfied unless you&amp;#39;re matching or exceeding their energy. Is this something others have noticed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/rrj4na/why_do_so_many_extroverts_take_introversion_as_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "rrj4na",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel like a lot of extroverts are personally offended by people who are shy or\nintroverted or just plain quiet. It's like they take your lack of social\ndynamism as a tacit implication that you don't like them or that you're\nrejecting them on some level. Even when you meet them halfway, it's like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "外向的な人の多くは、内気な人、内気でない人に個人的に腹を立てているような気がします。\n内向的な人、あるいはただ単に静かな人。社交的でないことが原因だと思われます。\nダイナミックさは、暗黙の了解として、あなたが自分のことを嫌っている、もしくは\n拒絶しているようなものです。中途半端な気持ちで会うと、まるで......。",
      "title": "なぜ多くの外向的な人は、内向性を個人的な侮辱と受け取るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得很多外向的人对那些害羞或内向的人有个人的冒犯。\n内向的人或只是普通的安静。就好像他们把你缺乏社交\n就像他们认为你缺乏社交活力是默示你不喜欢他们，或者你以\n在某种程度上拒绝他们。即使你与他们半途而废，这就像...",
      "title": "为什么这么多外向的人把内向作为一种个人侮辱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得很多外向的人對那些害羞或內向的人有個人的冒犯。\n內向的人或只是普通的安靜。就好像他們把你缺乏社交\n就像他們認爲你缺乏社交活力是默示你不喜歡他們，或者你以\n在某種程度上拒絕他們。即使你與他們半途而廢，這就像...",
      "title": "爲什麼這麼多外向的人把內向作爲一種個人侮辱？"
    }
  ]
}