{
  "author": "freehouse_throwaway",
  "the_new_excerpt": " * 2021 starts off with a bang as VIX shoots up an ungodly 22%+ during intraday\n   high. During intraday low for the market, the Dow was down as much as 700 pts\n   (-2.3%), Nasdaq -345 pts (-2.6%), and S&P -94 (-2.5%). WSB reeled in horror\n   as stonk somehow doesn't always go up. Beyond renewed…",
  "original_created_utc": 1609795161,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "*2021年以一声巨响开局，波动率指数盘中飙升22%以上，令人不快\n很高。在市场盘中低点期间，道琼斯工业平均指数下跌了700点\n(-2.3%)，纳斯达克-345点(-2.6%)，标准普尔94指数(-2.5%)。WSB在恐惧中摇摇欲坠\n因为石块不知何故并不总是上升。超越续订的…",
      "title": "今天(和最近)市场驱动新闻的Reeeeeecap(2021年1月4日收盘后)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "*2021年以一聲巨響開局，波動率指數盤中飆升22%以上，令人不快\n很高。在市場盤中低點期間，道瓊斯工業平均指數下跌了700點\n(-2.3%)，納斯達克-345點(-2.6%)，標準普爾94指數(-2.5%)。WSB在恐懼中搖搖欲墜\n因爲石塊不知何故並不總是上升。超越續訂的…",
      "title": "今天(和最近)市場驅動新聞的Reeeeeecap(2021年1月4日收盤後)"
    }
  ],
  "title": "Reeeeeeeeecap of today's (and recent) market driving news (Jan 4, 2021 after market close)",
  "created_utc": 1609810774,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li><p>2021 starts off with a bang as VIX shoots up an ungodly 22%+ during intraday high. During intraday low for the market, the Dow was down as much as 700 pts (-2.3%), Nasdaq -345 pts (-2.6%), and S&amp;P -94 (-2.5%). WSB reeled in horror as stonk somehow doesn&#39;t always go up. Beyond renewed COVID fear, market sell-off accelerated in the morning after 10 AM as the market continues to keep an eye on the GA run-off election with polls increasingly being more favorable for the DNC candidates. No doubt an extra wrench was thrown to the GA GOP Senate campaigns as POTUS continues to pressure GA officials on figuring out votes - cuz that&#39;s totes normal thing for a sitting President to do.</p></li>\n<li><p>For those WSBer who failed basic HS civics class, just one GOP win in the two run-off Senate seats will keep Biden&#39;s more progressive agenda at bay (and likely the recent tax cut intact) as the GOP and McTurtle retain control of the Senate. Conversely, Dems winning both seats will secure both legislative branch for Dems, as VP Harris be the tie breaking vote in the Senate. Will this mean an eventual bigger stimulus package? A renew market-sell off? Should ANTM, UNH, and others quiver in fear? Find out later this week as results will unlikely be clear even after polls are close on Tues night.</p></li>\n<li><p>With renewed COVID fear as the UK variant likely running rampant undetected in the US, shares of travel sector are pressured today. In airlines, AAL closed down -4% to $15.13, UAL -3.75% to $41.63, and LUV -3.37% to $45.04 (similar price action across the sector for JBLU, SAVE, etc.). Cruise stocks took a bigger beating with NCLH down -6.69% to $23.73, RCL down -5.23% to $70.72, and CCL down -5.91% to $20.38. Conversely, safe plays and essential stores such as WMT, TGT, and COST are all up today at 1.65%, 0.62%, and 0.89% despite S&amp;P being red.</p></li>\n<li><p>Jack Ma, Alibaba&#39;s very public CEO has reportedly been missing in action in the past few months as speculation starts floating about his disappearance due to the CCP. While memes float about of Ma being tucked away in a Chinese state prison with Randy Marsh due to pissing off Pooh Bear, shares of BABA continues to be pressured despite a rebound last week as CCP&#39;s antitrust probe on both Alibaba and its subsidiary Ant Group chugs on. BABA closed the day -2.10% at $227.85, while competitors PDD closed -6.13% to $166.78, and JD closed the day -1.79% at $86.33. </p></li>\n<li><p>QS, the SPAC turned meme EV stock took a nice more than -40% dive today as shares sold off on... well, who the fuck knows why it sold off (PIPE shares became available and are no longer locked? I didn&#39;t look into the lockup period, someone let me know the dates). The EV battery maker took on a NKLA-like trajectory and rallied as high as $120 before steadily trimming its gains in the past week. For those who are adventurous in selling the iV, OTM Jan 15 puts such as 35p are going for $1.55 while 40p are going for $3.3. But honestly, do you really want to baghold QS at those pricing if assigned (cash secured)? Go with a spread, you dumb fuck. Shares closed the day down more than $34 (-40.84%) to $49.96. If you sold puts before today, you dun goofed.</p></li>\n<li><p>QS edit: thanks to trojanattorney1 <a href=\"https://www.reddit.com/r/wallstreetbets/comments/kqi8e8/reeeeeeeeecap_of_todays_and_recent_market_driving/gi48nvd/\">below</a>: more early investor shares were available today and millions were dumped into the market. If you&#39;re trying to catch the QS knife, be warned as there are many more dilution to go. You can check recent filing <a href=\"https://sec.report/Ticker/QS\">here</a> if you&#39;re so inclined.</p></li>\n<li><p>Haven, the AMZN + BRK + JPM venture in &quot;disrupting&quot; health care has disbanded after a 3 year attempt. Turns out having sensible health care in America is hard as fuck. Shares of healthcare companies UNH, HUM, et al. were up during pre-market and morning hours, but faded through the day as overall macro pushed the sector down.</p></li>\n<li><p>In more &quot;wait is this really America&quot; news, more than 200 GOOGL employees and contractors in both the US and Canada have decided to unionized to promote a less shitty workplace and ethical business practices (once a upon a time, Google&#39;s motto was &quot;Do No Evil.&quot;). Collectively known as the Alphabet Workers Union, the group&#39;s aim is to start small and eventually amass enough membership to actually address some of the more lofty goals: namely pay and working conditions. GOOGL closed the day down -1.51%, though more likely due to overall macro than this thus far non-material news.</p></li>\n<li><p>Elon chan and his meme stock continues to kill whatever remaining short sellers are left, as TSLA reaches new ATH after Q4 delivery report. Despite the FY number being &quot;missed&quot; by 450 vehicles, the quarterly delivery of 180,570 vehicles handily beat Wall Street&#39;s estimate of about 174k vehicles and shares are up bigly to close up 3.42% at $729.77. How did we ever doubt those WSB degens who loaded up $3,500 strike Jan 15 calls pre-split which are now ITM!? Truly, they were ahead of the times in knowing that TSLA will shoot up an additional 76% in the next 3 months.</p></li>\n<li><p>On Chinese EV side of things, NIO delivered 7k vehicles in Dec 2020 while XPEV delivered 5,700 vehicles - both numbers are record &quot;growth&quot; for the two company which shows a YoY growth of 121% for NIO and 326% for XPEV. (WSB with OTM FDs know these &quot;growth&quot; well as their FDs goes from 100% in value but are still down all-time of at -85%). NIO closed the day up 9.75% to $53.49 and XPEV trimmed their intraday high of 10%+ to close up 2.97% at $44.10.</p></li>\n<li><p>In WSB meme stock land, things are a fairly mixed bag as GME continues to fade after reaching a recent 52-week high of $22.35. The definitely-not-going-bankrupt gaming retailer closed the day down -8.44% to $17.25. PLTR, despite being up more than 2% in pre-market, closed the day relatively flat at -0.76% to $23.37. Finally, steel gang got a respite today as MT closed the day up 4.59%, though intraday high was up as much as 8%.</p></li>\n<li><p>Looking for cheap and relatively &quot;responsible&quot; WSB meme stock play? You can do GME covered call and sell April 35c for about $1.6 (though selling on a green day for $2+ is probably a better idea). This will net you 100 shares of GME for less than $15.70 per share and cap your imaginary gains at $35 if the squeeze does happen. (All those GME DDs can&#39;t be wrong?)  Conversely, you can go with GME April 20c/35c debit call spread for a &quot;low price&quot; of $2.4 per spread, or for those who prefer to sell FDs to fellow WSBer, poor man&#39;s covered call of Jan 2022 $25c and selling weeklies and/or April 35c will suffice. At the end of the day, the fact that April 35c has so much value still to it should be taken advantage if GME has a green day. For MT, June debit call spread is probably the way to go, with 25c/35c a possible spread. These are not financial advice and if you listen to a random stranger online and lose your pants on the play - then that&#39;s on you, you dumb stupid motherfucker.</p></li>\n<li><p>DJI closed down -382 pts (-1.25%), IXIC closed down -189 pts (-1.47%), SPX -55 pts (-1.48%), and RUT is down -28 pts (-1.47%). Notable numbers and ERs this week: ISM manufacturing index tomorrow at 10 AM ET, BBBY reports on Thursday before market opens while MU reports after market close. Load up on those MU 90c for 7/20 - this time it&#39;ll definitely hit!</p></li>\n</ul>\n\n<p>(Last week&#39;s recap: none cuz I was enjoying the covid yacht party).</p>\n</div><!-- SC_ON -->",
  "score": 2824,
  "permalink": "/r/wallstreetbets/comments/kqi8e8/reeeeeeeeecap_of_todays_and_recent_market_driving/",
  "subreddit": "wallstreetbets",
  "id": "kqi8e8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100753678
}