{
  "author": "Key-Page7669",
  "original_created_utc": 1628940320,
  "title": "Should I buy 1 BTC now?",
  "created_utc": 1628955867,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have around 80,000 cash saved up and was looking into purchasing my second investment property soon. Would it be wiser to purchase 1 BTC, or generally speaking diversify myself with a portfolio of cryptos? At this time, I own no Bitcoin and a small amount of eth and Ada. \nI’m having a hard time committing to dropping 60-75 thousands for down payment and closing cost. Even with cash flow, appreciation , and possible tax write offs, I’m just thinking it would take to make that money back. It seems like crypto had a bright future from what I’ve seen, heard, and read these past 6 months. </p>\n\n<p>Opinions?</p>\n</div><!-- SC_ON -->",
  "score": 272,
  "permalink": "/r/Bitcoin/comments/p46ads/should_i_buy_1_btc_now/",
  "subreddit": "Bitcoin",
  "id": "p46ads",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have around 80,000 cash saved up and was looking into purchasing my second\ninvestment property soon. Would it be wiser to purchase 1 BTC, or generally\nspeaking diversify myself with a portfolio of cryptos? At this time, I own no\nBitcoin and a small amount of eth and Ada. I’m having a hard time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は8万円ほどの貯金があり、そろそろ2つ目の投資物件の購入を検討していました。\n投資物件の購入を検討していました。1BTCを購入するのが賢明でしょうか、それとも一般的には\nクリプトのポートフォリオで分散するのが賢明でしょうか？今のところ、私は\nBitcoinと少量のethとAdaを持っています。悩んでいるのは...。",
      "title": "今、1BTCを買うべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有大约80,000美元的现金积蓄，正在考虑购买我的第二个\n投资物业。购买1个BTC是否更明智，还是一般来说\n说，用加密货币的投资组合来分散自己的投资？在这个时候，我没有拥有\n比特币和少量的乙醇和艾达。我很难...",
      "title": "我现在应该买1个BTC吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有大約80,000美元的現金積蓄，正在考慮購買我的第二個\n投資物業。購買1個BTC是否更明智，還是一般來說\n說，用加密貨幣的投資組合來分散自己的投資？在這個時候，我沒有擁有\n比特幣和少量的乙醇和艾達。我很難...",
      "title": "我現在應該買1個BTC嗎？"
    }
  ]
}