{
  "author": "Lucky_Strike-85",
  "the_new_excerpt": "I have heard it said that Health Insurance is not the same thing as healthcare\nin the U.S. Obviously, I agree but why do you think that, despite having health\ninsurance, it may not lead to the best health outcomes in the world, the best\ncare, or be the most efficient system? Why does the U.S.…",
  "original_created_utc": 1621002214,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国では、健康保険と医療は別物だと言われています。\nもちろん、私もそう思いますが、なぜ、健康保険があるにもかかわらず、それが世界で最も優れた健康上の成果、最高の医療につながらないと考えるのでしょうか。\n健康保険があるにもかかわらず、それが世界で最も優れた健康上の成果、最も優れたケア、最も効率的なシステムにつながるとは限らないと考えるのはなぜでしょうか？\n最も効率的なシステムではないとお考えですか？なぜ、米国....",
      "title": "アメリカではなぜ健康保険が医療を保証しないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听到有人说，在美国，健康保险与医疗保健不是一回事。\n显然，我同意，但为什么你认为，尽管有健康保险，但它可能不会导致世界上最好的健康结果，最好的医疗。\n但为什么你认为，尽管有健康保险，它可能不会带来世界上最好的健康结果、最好的\n护理，或成为最有效的系统？为什么美国....",
      "title": "为什么美国的健康保险不能保证医疗保健？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽到有人說，在美國，健康保險與醫療保健不是一回事。\n顯然，我同意，但爲什麼你認爲，儘管有健康保險，但它可能不會導致世界上最好的健康結果，最好的醫療。\n但爲什麼你認爲，儘管有健康保險，它可能不會帶來世界上最好的健康結果、最好的\n護理，或成爲最有效的系統？爲什麼美國....",
      "title": "爲什麼美國的健康保險不能保證醫療保健？"
    }
  ],
  "title": "Why Does Health Insurance Not Guarantee Healthcare In the U.S.?",
  "created_utc": 1621043999,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have heard it said that Health Insurance is not the same thing as healthcare in the U.S. Obviously, I agree but why do you think that, despite having health insurance, it may not lead to the best health outcomes in the world, the best care, or be the most efficient system? Why does the U.S. healthcare system have so many defenders?</p>\n\n<p>*note - I believe nothing short of single-payer will cure U.S. healthcare woes.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/Ask_Politics/comments/nc9t45/why_does_health_insurance_not_guarantee/",
  "subreddit": "Ask_Politics",
  "id": "nc9t45",
  "is_self": true,
  "media": null,
  "is_video": false
}