{
  "author": "Japanda23",
  "the_new_excerpt": "Sony had a blowout earning report which was followed by a 10% rise yesterday and\nanother 6% today and it further climbed after hours. Sony is my biggest holding\nand I am very bullish. I admit I haven't looked through the report in detail yet\nas that's my homework this weekend, but I wanted to get…",
  "original_created_utc": 1612587683,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "索尼的财报出现了井喷式的增长，继昨天上涨10%之后，又有了\n今天又涨了6%，盘后进一步攀升。索尼是我最大的持股\n而我是非常看好的。我承认我还没有详细看完这份报告\n因为这是我这个周末的功课，但我想... ...",
      "title": "索尼(SNE)财报后涨16%--初衷"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "索尼的財報出現了井噴式的增長，繼昨天上漲10%之後，又有了\n今天又漲了6%，盤後進一步攀升。索尼是我最大的持股\n而我是非常看好的。我承認我還沒有詳細看完這份報告\n因爲這是我這個週末的功課，但我想... ...",
      "title": "索尼(SNE)財報後漲16%--初衷"
    }
  ],
  "title": "Sony (SNE) up 16% after earnings - initial thoughts",
  "created_utc": 1612619042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sony had a blowout earning report which was followed by a 10% rise yesterday and another 6% today and it further climbed after hours. Sony is my biggest holding and I am very bullish. I admit I haven&#39;t looked through the report in detail yet as that&#39;s my homework this weekend, but I wanted to get ahead and post my initial thoughts incase I can&#39;t finish/post by this weekend and you want to take a look yourself.</p>\n\n<p>Recently they purchased Crunchyroll, an anime streaming service hinting that Sony Entertainment may be looking to enter the streaming game in full force. CORE is currently only be available in Bravia TVs and maybe the PS5, but it&#39;s supposed to be near loss-less 4K. I also read theatre releases of Sony Entertainment Movies will be available through the streaming service (I haven&#39;t done a deep dive to confirm yet).</p>\n\n<p>Their EV prototype is starting to look like a real project and is a strong example of how their top tech can be used in future cars and not just their sensors. Road testing and safety tests currently taking place.</p>\n\n<p>With the Huwawei ban one of their top mobile clients might suffer; based on memory I think it makes up 1/5 (could be 1/3) of their mobile clients, which is a big blow. However, the removal of Huwawei is also an opportunity as with the revamped Sony Xperia, Sony is now is a good position to solidify themselves as a top mobile phone choice besides Samsung and Apple (and OnePlus). Their take on the Pro, albeit very niche is an interesting direction for their top line and the Xperia 5 ii is in a nice direction for a consumer phone. (Random Theory: I think the Xperia 5 is called that because 5 = Go in Japanese and it&#39;s their compact version, just a random guess).</p>\n\n<p>Not to mention SonyAI, PS5, their monitors/tech being top choice for film industry/pro monitors, cameras etc.</p>\n\n<p>I plan to post a full DD this weekend if I can get around to it, but with the momentum built post earnings they could very well hit $120 Monday morning (hence why I posted now so you can do your own DD if you think it&#39;s worth it). </p>\n\n<p>Not financial advice, yada yada do your own DD.</p>\n</div><!-- SC_ON -->",
  "score": 62,
  "permalink": "/r/stocks/comments/ldqd9o/sony_sne_up_16_after_earnings_initial_thoughts/",
  "subreddit": "stocks",
  "id": "ldqd9o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201976
}