{
  "author": "SpeedoManXXL",
  "the_new_excerpt": "Across the many invest/stock subs there is a lot of meme stock posting going\naround. I am not against this by itself, as there is money to be made, but be\nsmart, especially those who are new to this.\n\nWe have all been there, bought a stock at $10 it goes up to $20 and you're like,\nit will never…",
  "original_created_utc": 1623157629,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの投資/株式サブスクリプションでは、多くのミームストックの投稿が行われています。\n行われています。これ自体に反対するわけではありませんし、儲かることもあるでしょう。\nしかし、特にこの分野に慣れていない人は、賢くなりましょう。\n\n10ドルで買った株が20ドルになって、「これは絶対に...」と思った経験は誰にでもあるでしょう。\n絶対に...",
      "title": "トレーディングに感情を持ち込まない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在许多投资/股票子网站上，有很多纪念性股票的帖子在流传。\n左右。我并不反对这样做，因为有钱可赚，但要注意\n聪明点，特别是那些新来的人。\n\n我们都有过这样的经历，在10美元的时候买了一只股票，它涨到了20美元，你就想。\n它永远不会...",
      "title": "将情感从交易中剥离出来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在許多投資/股票子網站上，有很多紀念性股票的帖子在流傳。\n左右。我並不反對這樣做，因爲有錢可賺，但要注意\n聰明點，特別是那些新來的人。\n\n我們都有過這樣的經歷，在10美元的時候買了一隻股票，它漲到了20美元，你就想。\n它永遠不會...",
      "title": "將情感從交易中剝離出來"
    }
  ],
  "title": "Take Emotion Out of Trading",
  "created_utc": 1623171589,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Across the many invest/stock subs there is a lot of meme stock posting going around.  I am not against this by itself, as there is money to be made, but be smart, especially those who are new to this.  </p>\n\n<p>We have all been there, bought a stock at $10 it goes up to $20 and you&#39;re like, it will never fall, then it goes to $15 and you say, when it is back to $20, then I&#39;ll sell.  You end up selling at $7 for a loss.  </p>\n\n<p>When stocks have these crazy runs, just &#39;stop-loss limit sell orders.  For example, I&#39;m currently in $CLOV, bought in at $11.65.  It&#39;s currently trading at $16.10 at the time of post.  I have a &#39;stop-loss limit&#39; order at $15.  Meaning, if the stock drops to that level, it sells automatically.  </p>\n\n<p>Of course, it could drop to that level, I sell, and then it rockets to $25, but ignore those.  This will guarantee I can ONLY make a profit.  I HIGHLY recommend you use these automatic sell triggers to prevent yourself from believing STONKS can ONLY go up.  Guarantee you make a profit and while you may be sad when you sell a little early, you will love it when you don&#39;t take a loss which I guarantee most of these meme stocks will turn out to be in the long run.  </p>\n\n<p>tl:dr Use stop-loss limit orders to not get screwed over when the bubble burst.  Enjoy the ride and I hope you all become super-rich one day (if you&#39;re not there already)!</p>\n</div><!-- SC_ON -->",
  "score": 1548,
  "permalink": "/r/stocks/comments/nv3m73/take_emotion_out_of_trading/",
  "subreddit": "stocks",
  "id": "nv3m73",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888031
}