{
  "author": "simplelifestyle",
  "original_created_utc": 1628819910,
  "title": "Argentina considers the use of cryptocurrencies. -12 August 2021- The President of the Nation, Alberto Fernández, said that the advancement of digital currencies is irreversible and that Argentina must evaluate how to insert itself into that ecosystem.",
  "created_utc": 1628858781,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.ambito.com/economia/criptomonedas/argentina-pone-consideracion-el-uso-n5248959\">https://www.ambito.com/economia/criptomonedas/argentina-pone-consideracion-el-uso-n5248959</a></p>\n\n<blockquote>\n<p>The president of Argentina, Alberto Fernández , considered that it is &quot;possible&quot; that there is a legal tender cryptocurrency in the country , understanding that this instrument could &quot;contain inflation.&quot;</p>\n\n<p>In an interview he gave to a local portal, the President said that the advancement of cryptocurrencies is &quot;irreversible&quot; , that it is necessary to give the debate and that Argentina must evaluate how to insert itself into that ecosystem.</p>\n\n<p>&quot;You have to get used to it, take advantage of the good and regulate it in some way because it can lead to abuse,&quot; he stressed. In addition, he made a balance on the matter. Thus, while he stressed that &quot;the advantage is that the inflationary effect would be nullified , &quot; he said that it is a system that can be unsafe.</p>\n\n<p>&quot;The discussion about the operation of cryptocurrencies is worldwide and I must confess that it is a matter of care, in my case, for the unknown. But there is no denying it, perhaps it is a good path.&quot; The president @alferdez with @juleiva in #CajaNegra of @filonewsOK . pic.twitter.com/tRCcnFA3pm</p>\n\n<ul>\n<li>Alberto Fernández Prensa (@alferdezprensa) August 12, 2021\nA day before, the president of the Central Bank of the Argentine Republic, Miguel Pesce, had expressed that cryptocurrencies &quot;are not a financial asset&quot;, and guaranteed that the monetary authority will &quot; regulate the intersection of Bitcoin with the payment system and the exchange market &quot;.</li>\n</ul>\n\n<p>He also said that these are instruments &quot;that end up having values ​​that are not referenced in any asset and lead to confusion for people with a lower level of information.&quot;</p>\n\n<p>Fernández joined the debate and assured: &quot;There is a huge discussion about the operation of cryptocurrencies, not only in Argentina, it is a global debate. And I must confess that it is a matter of care. In my case, of care for the unknown and because you don&#39;t understand exactly how that fortune materializes. &quot;</p>\n\n<p>&quot;This doubt that I have many in the world have, for that reason the project does not finish expanding in the system&quot;, affirmed the Argentine Head of State.</p>\n\n<p>For Fernández, &quot;they say that the advantage of this is that the inflationary effect is largely nullified. It is also true that insecurity is generated because there have been some scams with its use&quot; and added that they should not refuse since &quot;maybe it is a good way &quot;</p>\n\n<p>The greatest advantage for us would have that sense, to somehow contain the inflationary, because it is a hard currency in some way , &quot;he added.</p>\n\n<p>On the other hand, the Argentine President declared himself in favor of the development of the financial system.</p>\n\n<p>In that sense, he stressed: &quot;For me, everything that has to do with bankarization seems to me to be correct and that everything that has to do with the State knowing, it seems to me to be correct. The problem is not that the State knows and that the information we have. The problem is how that information is used . &quot;</p>\n\n<p>&quot;For example, when we decided to remove the IFE , we suddenly discovered that there were 9 million Argentine men and women who we had no idea where they were . They do not have CUIT, they do not have CUIL, they did not have bank accounts,&quot; he emphasized.</p>\n\n<p>And he added that technology allows the State to obtain information from the population: &quot;It helps me to know that Juan is having a bad time and needs the help of the State. And that Pedro is cheating us and is not paying the corresponding taxes.&quot;</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/Bitcoin/comments/p3e042/argentina_considers_the_use_of_cryptocurrencies/",
  "subreddit": "Bitcoin",
  "id": "p3e042",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "https://www.ambito.com/economia/criptomonedas/argentina-pone-consideracion-el-uso-n5248959\n\n> The president of Argentina, Alberto Fernández , considered that it is\n> \"possible\" that there is a legal tender cryptocurrency in the country ,\n> understanding that this instrument could \"contain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.ambito.com/economia/criptomonedas/argentina-pone-consideracion-el-uso-n5248959\n\n> アルゼンチンのアルベルト・フェルナンデス大統領は、このように考えています。\n> アルゼンチン大統領のアルベルト・フェルナンデスは、同国に法定通貨である暗号通貨が存在することは「あり得る」と考えています。\n> この通貨には「...",
      "title": "アルゼンチン、暗号通貨の利用を検討。-2021年8月12日- アルベルト・フェルナンデス国家主席は、デジタル通貨の進歩は不可逆的であり、アルゼンチンはそのエコシステムにどのように挿入するかを評価しなければならないと述べました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.ambito.com/economia/criptomonedas/argentina-pone-consideracion-el-uso-n5248959\n\n> 阿根廷总统阿尔贝托-费尔南德斯认为，有可能出现\n> \"有可能 \"在该国有一种法定货币的加密货币。\n>理解这种工具可能 \"包含...",
      "title": "阿根廷考虑使用加密货币。-2021年8月12日- 国家总统阿尔贝托-费尔南德斯说，数字货币的进步是不可逆转的，阿根廷必须评估如何将自己插入该生态系统。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.ambito.com/economia/criptomonedas/argentina-pone-consideracion-el-uso-n5248959\n\n> 阿根廷總統阿爾貝託-費爾南德斯認爲，有可能出現\n> \"有可能 \"在該國有一種法定貨幣的加密貨幣。\n>理解這種工具可能 \"包含...",
      "title": "阿根廷考慮使用加密貨幣。-2021年8月12日- 國家總統阿爾貝託-費爾南德斯說，數字貨幣的進步是不可逆轉的，阿根廷必須評估如何將自己插入該生態系統。"
    }
  ]
}