{
  "author": "unc4l1n",
  "the_new_excerpt": "This post is aimed mostly at newcomers, and is intended to prepare you for what\nhappens if and when the market takes a turn for the worse. Us vets of the 2017\ncampaign (and before) have been through the ringer, and I hope we've come out\nwiser with some key bits of advice to share.\n\nThere are…",
  "original_created_utc": 1613062097,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章主要是针对新人的，旨在为你做好准备。\n如果和市场出现转折时，会发生。我们老百姓对2017年的\n竞选活动经历了重重考验，我希望我们能走出\n更加聪明，有一些关键的建议可以分享。\n\n有...",
      "title": "随着这轮牛市的升温，了解自己是哪种投资者很重要。你在未来几个月的行动可能会对你的财务状况产生重大影响。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章主要是針對新人的，旨在爲你做好準備。\n如果和市場出現轉折時，會發生。我們老百姓對2017年的\n競選活動經歷了重重考驗，我希望我們能走出\n更加聰明，有一些關鍵的建議可以分享。\n\n有...",
      "title": "隨着這輪牛市的升溫，瞭解自己是哪種投資者很重要。你在未來幾個月的行動可能會對你的財務狀況產生重大影響。"
    }
  ],
  "title": "As this bull run heats up, it's important to understand which sort of investor you are. Your actions over the coming months could have a big impact on your financial status.",
  "created_utc": 1613144236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is aimed mostly at newcomers, and is intended to prepare you for what happens if and when the market takes a turn for the worse. Us vets of the 2017 campaign (and before) have been through the ringer, and I hope we&#39;ve come out wiser with some key bits of advice to share.</p>\n\n<p>There are different types of investors on this sub, there are those who trade, there are those who hodl, there are those who are looking for quick gains and those who don&#39;t ever plan on converting back to fiat.</p>\n\n<p>The type of investor you are impacts the decisions you need to be taking during this bull run.</p>\n\n<p><strong>Long term investors</strong></p>\n\n<p>Let&#39;s take the hodlers for starts. Well, this one is easy, there is only one decision to take: should I hodl or should I hodl. A hodler believes that there will be ups and downs, but crypto will ultimately trend upwards and so the plan is simply to accumulate, through bull runs and bear markets alike. If you are a long term hodler, it may sound obvious, but don&#39;t ever sell anything you&#39;ve bought. Just buy in small amounts regularly (DCA) to smooth out market volatility.</p>\n\n<p><strong>Medium Term Investors</strong></p>\n\n<p>Medium term investors have to be a bit more nuanced in their strategy. Ask yourself this: how would it impact your financial plans if the peak of this bull run was tomorrow (or next week or whatever), and it ultimately trended downwards for 6 months or so, ending up 80% below your current amount (I&#39;m assuming you&#39;re significantly invested in alts here. Dial down the number if you&#39;re just in BTC)? Would you be financially devastated? Would you be able to wait it out until the next bull run in several years time?</p>\n\n<p>If the answer to the above is that you cannot handle that much loss, then you have to adjust your strategy. At this point in the bull run, there is euphoria all around. Alts are going up 10, 20, 30, 50 percent in a day and everyone&#39;s making money. Many people are adding <em>more</em> money into this phase, ending up over-invested. When the crash comes they are not ready. If this is you then you need to be taking profits. When one of your coins has gone up 30% or so, take some out, and don&#39;t reinvest it in another coin. Keep taking profits occasionally until you&#39;ve at least extracted your initial outlay. This will be a massive help psychologically when the crash comes.</p>\n\n<p><strong>Traders</strong></p>\n\n<p>Traders I&#39;m sure will have their own strategies, and they&#39;re not so applicable to what happens after the crash. The only thing I would say is buy low, sell high, and may Odin look kindly upon you.</p>\n</div><!-- SC_ON -->",
  "score": 150,
  "permalink": "/r/CryptoCurrency/comments/lhos50/as_this_bull_run_heats_up_its_important_to/",
  "subreddit": "CryptoCurrency",
  "id": "lhos50",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728615768
}