{
  "author": "Agitated-Music2365",
  "original_created_utc": 1630479083,
  "title": "Proof that you can earn more money with crypto by staking than holding it in a bank.",
  "created_utc": 1630489080,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been staking for a while and now it has surpassed the same amount of interest from my bank that’s been sitting for over 12 years. Yup, you read that right! 12 friggin years!</p>\n\n<p>My crypto journey began around late 2019 with just $200. And two years later today, Bitcoin and other cryptos were shooting up and then more corporations were adopting Bitcoin. Later on, whales also endorsed and were bullish about Bitcoin from this year and forward. Although it kind of dipped by May but eventually went back up by today.</p>\n\n<p>As an <a href=\"https://i.imgur.com/F6EUw3I.jpg\">example</a>, I deposited some of my Ethereum and Litecoin with BlockFi yesterday and I already earned $1.09 in BTC in just one day. It isn&#39;t that much but it&#39;s here to show how staking can really be powerful if you play it right, it can lead you to large amounts. Here are the <a href=\"https://i.imgur.com/0mzGXhb.jpg\">three</a> other <a href=\"https://i.imgur.com/Rx8lvpj.jpg\">platforms</a> I <a href=\"https://i.imgur.com/ujyVYyf.jpg\">use</a> as well.</p>\n\n<p>My best advice is to only invest in what you can afford to lose. The easiest and less risky way to get to financial freedom is to just keep investing small amounts over a long time frame; the value should compound enough to the point that you can even quit your day job and just spend off the amounts little by little. You just need to be patient with it. There is no such thing as a quick and easy approach to becoming rich. </p>\n\n<p>In any event, though, I advise you to not put all your crypto eggs in the same basket of compounding interests. Because in a decade or so, who knows what crypto will be by then? So when it comes to investments, the answer is to always diversify, especially when the stakes are larger.</p>\n\n<p>Here’s encouraging everyone to try staking! Cheers.</p>\n\n<p>P.S. Here’s the <a href=\"https://i.imgur.com/DiTdkic.png\">picture</a> of the rest of my earnings in the bank. I just withdrew the $880 and will use it for staking instead. Remember guys, small amounts, different baskets.</p>\n</div><!-- SC_ON -->",
  "score": 238,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/0ZO0A0qkwf_MSVoEE1L5p-9Bt-q1mNPXegVBsxAtBCg.jpg?auto=webp&s=d692add263cdd1ebd0a9058a120c4378032ab2b8",
          "width": 444,
          "height": 655
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/0ZO0A0qkwf_MSVoEE1L5p-9Bt-q1mNPXegVBsxAtBCg.jpg?width=108&crop=smart&auto=webp&s=422868409ba323f3f805cd38a4418146c2740932",
            "width": 108,
            "height": 159
          },
          {
            "url": "https://external-preview.redd.it/0ZO0A0qkwf_MSVoEE1L5p-9Bt-q1mNPXegVBsxAtBCg.jpg?width=216&crop=smart&auto=webp&s=440f6fbaace7c6ccefd50b11502efa1ff44fd2bd",
            "width": 216,
            "height": 318
          },
          {
            "url": "https://external-preview.redd.it/0ZO0A0qkwf_MSVoEE1L5p-9Bt-q1mNPXegVBsxAtBCg.jpg?width=320&crop=smart&auto=webp&s=cd006776e2a00ffdd3ca874c602a3877c29cb3ab",
            "width": 320,
            "height": 472
          }
        ],
        "variants": {},
        "id": "pnOGkfm0IWbBAfRQtidjn5IeaQBrZZ_4hmp-MmzxKy0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pfof7n/proof_that_you_can_earn_more_money_with_crypto_by/",
  "subreddit": "CryptoCurrency",
  "id": "pfof7n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been staking for a while and now it has surpassed the same amount of\ninterest from my bank that’s been sitting for over 12 years. Yup, you read that\nright! 12 friggin years!\n\nMy crypto journey began around late 2019 with just $200. And two years later\ntoday, Bitcoin and other cryptos were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はしばらくの間賭けていましたが、今では同じ金額を超えてしまいました。\n12年以上も放置されていた銀行の利息を超えてしまったのです。そう、読んで字のごとく\nその通りです。12年ですよ!\n\n私の暗号化の旅は、2019年後半頃にわずか200ドルで始まりました。そして2年後\n今日、ビットコインや他の暗号は...",
      "title": "暗号を銀行で保有するよりもステーキングで稼ぐことができるという証明。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经赌了一段时间了，现在已经超过了我的银行12年来的相同数额的\n我从银行获得的利息已经超过12年了。是的，你看\n是的，你读到了! 12个该死的年头!\n\n我的加密货币之旅大约在2019年底开始，只有200美元。而两年后\n今天，比特币和其他加密货币是...",
      "title": "证明你用加密货币做赌注可以比在银行里持有更多钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經賭了一段時間了，現在已經超過了我的銀行12年來的相同數額的\n我從銀行獲得的利息已經超過12年了。是的，你看\n是的，你讀到了! 12個該死的年頭!\n\n我的加密貨幣之旅大約在2019年底開始，只有200美元。而兩年後\n今天，比特幣和其他加密貨幣是...",
      "title": "證明你用加密貨幣做賭注可以比在銀行裏持有更多錢。"
    }
  ]
}