{
  "author": "Hospitalities",
  "original_created_utc": 1629208898,
  "title": "Anyone belittling someone else for a \"google-able\" question or insulting people for asking their questions will recieve a 3 day ban. This isn't a new rule, it's been stated in the first paragraph of our sidebar since we started.",
  "created_utc": 1629213891,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wish you guys gave a shit about things that actually matter instead of coming online and, instead of assuming people are being legitimate in a sub called <strong>TOO AFRAID TO ASK</strong>, you&#39;re too busy &quot;sleuthing&quot; their post history and demanding to know why we let people farm karma here, allow questions that are google-able etc etc.</p>\n\n<p>If someone were farming karma, don’t you think we have better metrics and bots providing us data than your 20 minutes (lol nice use of time) to scour some random OPs post history? If someone is karma farming here, it’ll come out in the wash. Regardless you should always either assume someone is asking genuinely and try to answer or assume they’re not answering genuinely and IGNORE THE POST. The part where you get involved to post something nasty is when I have to get involved and let me tell you, I HATE getting involved over NOTHING.</p>\n\n<p>Considering that reading the rules prior to posting is a requirement in just about every sub on this website, from now on any user that draws attention to the fact that they&#39;ve not read our rules and engages in belittling an OP for asking a &quot;google-able&quot; question will receive a 3 day ban with a lovely reminder and link to our rules and sidebar. Belittling an OP because you think they have asked a question you deem dumb will also receive a 3 day ban.</p>\n\n<p>We would like to also take this moment to remind you that this sub utilizes strikes against accounts, repeat offenders will be permanently banned.</p>\n\n<p>No one among the mod team cares if the OP posts regularly on karma-farming subs, no one among the mod team makes assumptions regarding the circumstances a question has been asked. IF the question <em>appears genuine</em>, IF the OP is attempting to engage with people trying to educate / discuss with them, then this is the place for it. Google does not always generate discussion, and people looking up answers to things does not always lead them to a fully correct answer. Admittedly, there are many reasons why someone would not be capable of correctly googling something or leading themselves to the correct answer. Some people may just want to have a discussion.</p>\n\n<p><strong>TL;DR</strong> Regardless of the robust-ness of the question, you have <strong>no right</strong> in this sub to belittle someone for asking. We&#39;re coming down hard for it now. This serves as a sub-wide warning. No one among the mod team cares if you stopped to read it before posting your vitriol online.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/TooAfraidToAsk/comments/p64dy9/anyone_belittling_someone_else_for_a_googleable/",
  "subreddit": "TooAfraidToAsk",
  "id": "p64dy9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Wish you guys gave a shit about things that actually matter instead of coming\nonline and, instead of assuming people are being legitimate in a sub called TOO\nAFRAID TO ASK, you're too busy \"sleuthing\" their post history and demanding to\nknow why we let people farm karma here, allow questions that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなた方は、ネットに出てくるのではなく、実際に重要なことに関心を持ってほしいと思います。\nオンラインで、人々が「TOO AFRAID TO ASK」と呼ばれるサブサイトで合法的に活動していると仮定するのではなく\n質問するのが怖い」というサブメニューで人々が正当なことをしていると仮定するのではなく、彼らの投稿履歴を「調べる」ことに忙しく、なぜここでカルマを貯めさせたり、質問を許したりするのかと要求することに\nなぜここでカルマを稼がせるのか、質問を許すのか...。",
      "title": "ググればわかる」ような質問をして他人をけなしたり、質問をした人を侮辱したりした場合は、3日間の使用禁止処分を受けます。これは新しいルールではなく、開始当初からサイドバーの最初の段落に記載されているものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "希望你们能关心一下真正重要的事情，而不是到网上来。\n而不是在一个叫 \"不敢问 \"的子网站上假设人们是合法的。\n你们忙于 \"侦查 \"他们的帖子历史，并要求知道为什么我们让人们耕种卡拉OK。\n你忙于 \"调查 \"他们的帖子历史，并要求知道为什么我们让人们在这里耕种因果关系，允许提出问题......",
      "title": "任何因 \"谷歌可查 \"的问题而贬低他人或因提问而侮辱他人的人将被禁言3天。这不是一个新的规则，从我们开始就在侧边栏的第一段中说明了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希望你們能關心一下真正重要的事情，而不是到網上來。\n而不是在一個叫 \"不敢問 \"的子網站上假設人們是合法的。\n你們忙於 \"偵查 \"他們的帖子歷史，並要求知道爲什麼我們讓人們耕種卡拉OK。\n你忙於 \"調查 \"他們的帖子歷史，並要求知道爲什麼我們讓人們在這裏耕種因果關係，允許提出問題......",
      "title": "任何因 \"谷歌可查 \"的問題而貶低他人或因提問而侮辱他人的人將被禁言3天。這不是一個新的規則，從我們開始就在側邊欄的第一段中說明了。"
    }
  ]
}