{
  "author": "Competitive-Cow-8055",
  "original_created_utc": 1636812436,
  "title": "Change My Mind- “Reddit Is One Of The Best Place’s To Learn About Crypto”",
  "created_utc": 1636832152,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I personally think that reddit is one of best places for beginners to come to learn the very basics about crypto, the people are helpful, there is a wide range of news and topics, There are always post about DCA, HOLDING, DONT DAY TRADE etc and useful tips to help with you investments.</p>\n\n<p>I personally started investing into crypto by using this sub BUT i did take it with a very big grain of salt and so should any other new investor! I also don’t think I’d be in the place I am today without this subs help either.</p>\n\n<p>Now if you think I’m wrong why? Try and Change me mind.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/qt1yw7/change_my_mind_reddit_is_one_of_the_best_places/",
  "subreddit": "CryptoCurrency",
  "id": "qt1yw7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I personally think that reddit is one of best places for beginners to come to\nlearn the very basics about crypto, the people are helpful, there is a wide\nrange of news and topics, There are always post about DCA, HOLDING, DONT DAY\nTRADE etc and useful tips to help with you investments.\n\nI personally…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "個人的には、redditは初心者が暗号の基礎を学ぶのに最適な場所のひとつだと思います。\n人々は親切で、ニュースやトピックも豊富です。\nニュースやトピックが豊富で、DCAやホールド、デイトレードはやめましょうなどの投稿が常にあり、投資に役立つヒントもあります。\nDCA、HOLDING、DONT DAY、TRADEなどについての投稿が常にあり、投資に役立つヒントが得られます。\n\n私は個人的に...",
      "title": "Change My Mind- \"Redditは暗号について学ぶのに最適な場所のひとつ\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我个人认为，reddit是初学者最好的地方之一。\n学习加密货币基础知识的最佳场所之一，这里的人很有帮助，有广泛的新闻和话题。\n种类繁多的新闻和话题，总是有关于DCA、HOLDING、DONT DAY TRADE等的帖子。\n交易等，并有有用的提示来帮助你的投资。\n\n我个人...",
      "title": "改变我的想法--\"Reddit是了解加密货币的最佳场所之一\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我個人認爲，reddit是初學者最好的地方之一。\n學習加密貨幣基礎知識的最佳場所之一，這裏的人很有幫助，有廣泛的新聞和話題。\n種類繁多的新聞和話題，總是有關於DCA、HOLDING、DONT DAY TRADE等的帖子。\n交易等，並有有用的提示來幫助你的投資。\n\n我個人...",
      "title": "改變我的想法--\"Reddit是瞭解加密貨幣的最佳場所之一\""
    }
  ]
}