{
  "author": "Mallardshead",
  "original_created_utc": 1654448963,
  "title": "List of big things to forward to before the next bitcoin halving. You must accumulate now.",
  "created_utc": 1654485041,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Bi-partisan crypto bill&lt;/strong&gt; by the GOP&amp;#39;s Cynthia Lummis and the Democrat&amp;#39;s Kristen Gillinbrand (this is a person who voted against bailing out Wall Street &amp;amp; banks circa 2008). The bill should be out this month, but probably won&amp;#39;t get a vote until the 118th Congress begins next year. My belief is that after regulatory clarity, bitcoin will absorb TradFi and trust rapidly. Governments won&amp;#39;t be able to control programmable money like this and it will run wild. Anything unfavorable in any bills will get programmed around and that&amp;#39;ll be a wrap&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Taproot Support.&lt;/strong&gt; Praise the lord, because we already have 75%+ nodes supporting it, and Taproot addresses, signatures, and scripting are necessary to unleash the security and innovation we need to begin onboarding institutions, governments, and individuals en masse&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;TARO&lt;/strong&gt; (taproot asset representation overlay). This means stablecoins, products, services, NFT collectibles, tokenized securities, and anything else that you can assign value. It&amp;#39;s difficult to stress the absurd liquidity and power this can bring the Bitcoin Network. All of this stuff will ultimately get settled in bitcoin. Why? Because bitcoin is a payment network that only bitcoin travels on. Meaning anything built on or traveling above bitcoin&amp;#39;s base layer gets settled in BTC. This is how we &lt;em&gt;&amp;quot;bitcoinize the dollar&amp;quot;&lt;/em&gt; flipping the dynamic we&amp;#39;re so accustomed to on exchanges, where bitcoin is settled in US dollars. This will fire a major shot across the bow spurning a circular economy war. TARO is also cool because the upgrade to wallets is so minimal. Of course none of this is good news for centralized exchanges&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The Merge&lt;/strong&gt;. This will set that protocol rapidly on its path towards centralization and self-immolation. Liquid staking derivative platforms will within 1 year acquire the network effects and stakes necessary to capture over 50% of the network and control it forever unless hard-forked, creating several problems itself because of L2, bridges, and sidechains obviously. If it&amp;#39;s not a single platform acquiring the network, it will be two of them colluding. The decentralized autonomous organizations that run these platforms are made of TradFi and erstwhile hegemons. Expect them to utilize carry trades (low interest cash borrowing), use it to buy the crypto, stake it, and use their staking derivatives to short the crypto, creating near delta-neutral positioning. Remember, if you&amp;#39;re not staking, you&amp;#39;re being diluted by whatever the staking APY is. I suspect this inflation will match the USD&amp;#39;s traditionally (4% or so). Just another reason why fixed monetary policy (bitcoin) and PoW are important&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;SEC regulation&lt;/strong&gt;: this means securities designations for much of the space which will damage centralized exchanges as much as VC&amp;#39;s and (expletive)coins themselves. This is the s-curve adoption shakeout we bitcoiners have been warning about. It will help end the above system we talked about even faster&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Full-blown LiFi&lt;/strong&gt; (Lightning Finance). If I can send you bitcoin and you get stablecoins on the other end; or you send someone stablecoins and they get milk, then you can see how most people using the Bitcoin Network won&amp;#39;t know they&amp;#39;re using the network. They won&amp;#39;t see or understand what&amp;#39;s happening in the background anymore than they do Visa when buying a concert ticket, or HTTP when clicking through a website. You don&amp;#39;t have to price things at the store in sats people. It doesn&amp;#39;t matter what they&amp;#39;re priced in. I can see several payment processors bypassing traditional discrete payment networks (like Visa or PayPal) and leveraging the LN. I expect banks, the traditional payment networks themselves, and even governments to use it. One major chartered bank is already in talks to issue fiat (not stablecoins, but digital fiat) on the LN. It&amp;#39;s pretty cool to know the LN will connect everybody in the world, and to get started all that&amp;#39;s needed is downloading a free wallet&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hyperinflation.&lt;/strong&gt; It&amp;#39;s unavoidable. We&amp;#39;re at the end of the debt cycle. The USD is trapped. You can&amp;#39;t raise interest rates enough because the debt is too high (over $30T) making the interest paid too high. Foreign demand for Treasuries peaked years ago. Supply chains are broken, many for the rest of this decade. Energy inputs can&amp;#39;t be reigned in, not just because of sanctions which cause an immediate impact, but because even when those are gone, the chronic underinvestment in exploration/extraction will take years to fix with proper investment (even if we made a sweetheart deal with Venezuela). And lastly, inflation is high everywhere you look. This is what Robert Triffin predicted back in the 1960s for an inflationary world reserve currency--an eventual doom vortex when the currency got trapped between low rates, inflation, debt, and falling foreign demand. Several countries have currencies which are more volatile than BTC is (Turkey, Iran, Argentina, Cuba, much of Africa, etcetera). Is Japan next? What I know is it&amp;#39;s climbing the ladder, and when BTC is more stable than major currency pairs are, with longterm bias to the upside, we&amp;#39;ll see a credit market rapidly develop around bitcoin collateral globally. Point is, the capital flight release valve in a hyper event is pretty obvious: Bitcoin. The USD isn&amp;#39;t going away just yet, but stopping inflation doesn&amp;#39;t mean prices go down, it simply means prices stop going up. Thankfully BTC will be there to do whatever you need it to do: issue new assets, collateralize, lend, borrow, save, send, or spend. The new global reserve asset&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Seriously though, this shit is going to disappear into the internet stack. And the sooner we&amp;#39;re the internet of money, the sooner the price becomes apparent:&lt;/p&gt;\n\n&lt;h1&gt;∞/21M&lt;/h1&gt;\n\n&lt;p&gt;Conclusion: HODL. BUY. REPEAT.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 374,
  "permalink": "/r/Bitcoin/comments/v5hrsf/list_of_big_things_to_forward_to_before_the_next/",
  "subreddit": "Bitcoin",
  "id": "v5hrsf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": " * Bi-partisan crypto bill by the GOP's Cynthia Lummis and the Democrat's\n   Kristen Gillinbrand (this is a person who voted against bailing out Wall\n   Street & banks circa 2008). The bill should be out this month, but probably\n   won't get a vote until the 118th Congress begins next year. My…"
}