{
  "author": "AlphaHuman304",
  "original_created_utc": 1636740797,
  "title": "Friendly Reminder: Going Straight Up Is NOT Bullish Long Term, And Pullbacks Are Way More Important Than You Think.",
  "created_utc": 1636760308,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Explaining this is especially important for the new investors on this sub, those who are worried about the recent price action. So, let’s look at some numbers first.</p>\n\n<p>We will be talking about the price of BTC this year. We are focussing on BTC because it largely decides the market sentiment. Technically speaking, Bitcoin can be considered as a fairly accurate market index for crypto, just like we have S&amp;P 500 for stock markets.</p>\n\n<p>From 1st January to 14 April the price increased from $ 29,331 to $62,959 a <strong>114.65%</strong> growth in <strong>3.5 months</strong>.</p>\n\n<p>From 20th May to 11th Nov the price increased from $ 40,526 to $64,774 a <strong>59.8%</strong> growth in <strong>5.7 months</strong>.</p>\n\n<p><a href=\"https://preview.redd.it/5t3nskpfb7z71.png?width=990&amp;format=png&amp;auto=webp&amp;s=c3b8b6d82b4816644cc93d327532f26aba3d84bc\">Regression comparing the Q1 growth with May-Nov growth</a></p>\n\n<p>As we can see, Bitcoin rallies like crazy during Q1, and the growth clearly looks unsustainable. And then what happens? We eventually see a 50% crash in May and the whole market tanks.</p>\n\n<p>Now let us compare that to the rally from May to November. The angle this regression makes is 43°, which is <strong>substantially less steep</strong> than 59°. This is undeniably more organic than last time. So yes, this time <strong>it is different,</strong> not only that <strong>this time it is better.</strong></p>\n\n<p>The occasional pullbacks like the ones we are experiencing today are incredibly important, it helps in keeping the markets stable and sustainable for a long term rally. When we say it &quot;shakes off&quot; the paper hands, it also means that the capital the short-termed traders lose flows into the market, making the said asset stronger. While the +60% growth in 6 months may seem slower than +115% in 3.5 months, but remember that <strong>it&#39;s stronger.</strong> Bitcoin is far more likely to reach $100k now, than ever before. Not only that, slow and steady growth means that the market is finally maturing and hence, less volatility which means more institutional and retail adoption.</p>\n\n<p>Note: In the regression plotted in the above graph, the Pearson&#39;s R is well above 0.7 in both cases: 0.91 &amp; 0.87, which generally means that the growth can be accurately modelled by simple regression. Remember, more complex rainbow graphs ≠ better analysis.</p>\n\n<p>So, all-in-all, I would say we are definitely headed to a $100k till EOY, all we need is some patience and conviction.</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/qsh75p/friendly_reminder_going_straight_up_is_not/",
  "subreddit": "CryptoCurrency",
  "id": "qsh75p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Explaining this is especially important for the new investors on this sub, those\nwho are worried about the recent price action. So, let’s look at some numbers\nfirst.\n\nWe will be talking about the price of BTC this year. We are focussing on BTC\nbecause it largely decides the market sentiment.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これを説明することは、このサブの新しい投資家、つまり最近の値動きに不安を感じている人にとっては特に重要です。\n最近の値動きに不安を感じている人には特に重要です。では、いくつかの数字を見てみましょう\n最初に\n\n今回は今年のBTCの価格についてお話します。私たちがBTCに焦点を当てているのは\n市場のセンチメントを大きく左右するからです....",
      "title": "フレンドリー・リマインダー ストレートアップすることは長期的には強気ではなく、プルバックは思ったよりもずっと重要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "解释这一点对于本子上的新投资者尤其重要，那些\n那些对最近的价格行为感到担忧的人。因此，让我们看一下一些数字\n首先。\n\n我们将讨论今年BTC的价格。我们关注的是BTC\n因为它在很大程度上决定了市场的情绪....。",
      "title": "友好提醒。直线上升不是长期看涨，回调比你想象的要重要得多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "解釋這一點對於本子上的新投資者尤其重要，那些\n那些對最近的價格行爲感到擔憂的人。因此，讓我們看一下一些數字\n首先。\n\n我們將討論今年BTC的價格。我們關注的是BTC\n因爲它在很大程度上決定了市場的情緒....。",
      "title": "友好提醒。直線上升不是長期看漲，回調比你想象的要重要得多。"
    }
  ]
}