{
  "author": "CancerEndgame",
  "the_new_excerpt": "I’m 21 years old and I am a terminal cancer patient. I was doing well for awhile\nbut it appears my borrowed time is up. I have Ewing’s sarcoma in my lungs and I\nwas wondering if anyone here could help me understand what’s going to happen as\nthis starts to progress further. I want to know what I’m in…",
  "original_created_utc": 1623212709,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は21歳で、末期がんの患者です。しばらくは調子が良かったのですが\n借りていた時間が終わってしまったようです。私は肺にユーイング肉腫を患っています。\n肺にユーイング肉腫がありますが、これがさらに進行するとどうなるのか、誰か教えてください。\nこの病気がさらに進行し始めるとどうなるのか、誰か教えてください。私が知りたいのは、私が何をしているのかということです...",
      "title": "死ぬとはどういうことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年21岁，是一名癌症晚期患者。有一段时间，我的情况还不错\n但看来我借来的时间已经到了。我的肺部有尤文氏肉瘤，我想知道这里是否有人能帮助我了解情况。\n我想知道这里是否有人能帮助我了解当病情开始进一步发展时将会发生什么。\n这开始进一步发展。我想知道我现在的情况。",
      "title": "死亡是什么感觉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年21歲，是一名癌症晚期患者。有一段時間，我的情況還不錯\n但看來我借來的時間已經到了。我的肺部有尤文氏肉瘤，我想知道這裏是否有人能幫助我瞭解情況。\n我想知道這裏是否有人能幫助我瞭解當病情開始進一步發展時將會發生什麼。\n這開始進一步發展。我想知道我現在的情況。",
      "title": "死亡是什麼感覺？"
    }
  ],
  "title": "What does dying feel like?",
  "created_utc": 1623217932,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m 21 years old and I am a terminal cancer patient. I was doing well for awhile but it appears my borrowed time is up. I have Ewing’s sarcoma in my lungs and I was wondering if anyone here could help me understand what’s going to happen as this starts to progress further. I want to know what I’m in for. I’m not looking for a sugar coated “everything’s fine” approach. I know I’m dying, I just want to know what’s coming before the end.</p>\n\n<p>Edit: I’m not looking for the moment of death or afterlife. I’m asking about the physical decline I’m in for.</p>\n</div><!-- SC_ON -->",
  "score": 760,
  "permalink": "/r/NoStupidQuestions/comments/nvn4nx/what_does_dying_feel_like/",
  "subreddit": "NoStupidQuestions",
  "id": "nvn4nx",
  "is_self": true,
  "media": null,
  "is_video": false
}