{
  "author": "RusticBohemian",
  "original_created_utc": 1651544007,
  "title": "The great Roman general Scipio Africanus liked to dance, \"not shuffling about in the present style...but in the old-fashioned manly style in which men danced at times of games and festivals, without loss of dignity even if their enemies were watching them.\" Do we have any idea what this looked like?",
  "created_utc": 1651553613,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Modern men often look ridiculous on the dance floor. There are many memes about this, so it&amp;#39;s fun to see the topic come up in Seneca&amp;#39;s work&lt;/p&gt;\n\n&lt;p&gt;The men of Seneca&amp;#39;s day, &amp;quot;mince and wriggle with more than effeminate voluptuousness,&amp;quot; when they&amp;#39;re just walking around.&amp;quot; Dances, we must assume, were even more shameful. &lt;/p&gt;\n\n&lt;p&gt;So what was this manly style of old that Scipio indulged in to relax? I&amp;#39;d like to see a dance so manly that even one&amp;#39;s enemies would find it unmockable. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m imagining something cossack-esque. &lt;/p&gt;\n\n&lt;p&gt;Do we have any idea what this would have been in reality?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/uh5sup/the_great_roman_general_scipio_africanus_liked_to/",
  "subreddit": "AskHistorians",
  "id": "uh5sup",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Modern men often look ridiculous on the dance floor. There are many memes about\nthis, so it's fun to see the topic come up in Seneca's work\n\nThe men of Seneca's day, \"mince and wriggle with more than effeminate\nvoluptuousness,\" when they're just walking around.\" Dances, we must assume, were\neven…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現代の男性は、ダンスフロアで滑稽に見えることが多い。これについては多くのミームが存在します。\nセネカの作品にこの話題が出てくるのは楽しいことです。\n\nセネカの時代の男たちは、ただ歩いているだけなのに、「女々しさ以上に猥雑で\n女々しく蠢く」のである。ダンスは\n偶数...",
      "title": "ローマの偉大な将軍スキピオ・アフリカヌスはダンスを好んだ。\"現在のようにシャッフルして踊るのではなく、昔ながらの男らしいスタイルで、ゲームや祭りの時に、敵が見ていても威厳を失わずに踊った \"とある。これがどのようなものであったのか、私たちは知っているだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现代男人在舞池中常常显得很可笑。有许多关于\n因此，在塞涅卡的作品中看到这个话题很有趣\n\n塞涅卡时代的男人，当他们只是走来走去的时候，\"用比娘娘腔还娘娘腔的方式扭动身体\n当他们只是走来走去的时候\"。我们必须假定，舞蹈是\n甚至...",
      "title": "伟大的罗马将军西皮奥-阿非利加喜欢跳舞，\"不是用现在的方式来洗牌......而是用老式的男子汉风格来跳舞，在游戏和节日的时候，即使他们的敌人在看着他们，也不会失去尊严。\" 我们知道这看起来像什么吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現代男人在舞池中常常顯得很可笑。有許多關於\n因此，在塞涅卡的作品中看到這個話題很有趣\n\n塞涅卡時代的男人，當他們只是走來走去的時候，\"用比娘娘腔還娘娘腔的方式扭動身體\n當他們只是走來走去的時候\"。我們必須假定，舞蹈是\n甚至...",
      "title": "偉大的羅馬將軍西皮奧-阿非利加喜歡跳舞，\"不是用現在的方式來洗牌......而是用老式的男子漢風格來跳舞，在遊戲和節日的時候，即使他們的敵人在看着他們，也不會失去尊嚴。\" 我們知道這看起來像什麼嗎？"
    }
  ]
}