{
  "author": "cascading_disruption",
  "original_created_utc": 1640537250,
  "title": "THIS IS EXACTLY WHAT IT MEANS when someone says TO DO YOUR OWN RESEARCH (DYOR): a guide on HOW TO BE SMARTER THAN THE SCAMMERS! An educational post",
  "created_utc": 1640573522,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I intentionally did not want to mention just one blockchain (see source  below) cause this article is universal and applies to all blockchains  and it&amp;#39;s extremely valuable to all of us involved in crypto.&lt;/p&gt;\n\n&lt;p&gt;Your favorite blockchain is typically an open, permissionless blockchain. So  there is no  central company, or other body, exerting ownership and,  with it, responsibility. Anyone can build on this platform and engage  the  community. This is one of its superpowers. Yet because anyone can  build  DApps, users need to be judicious. As the saying goes, ‘Do your  own  research’.&lt;/p&gt;\n\n&lt;p&gt;Researching means  more than scrolling through search  results or watching your favorite  YouTuber talk about moonshots or chart  patterns. By doing your own due  diligence and taking your signal from  the right community voices (amid  the noise), you can give yourself the  best chance of navigating the  emergent landscape successfully. And with  it, play your part in helping  grow a safe, secure, and healthy  ecosystem.&lt;/p&gt;\n\n&lt;p&gt;However,  decentralization doesn’t mean we should accept a ‘wild  west’  environment. Even with the noblest intentions, some DApps will  include  design flaws, have bugs, or be poorly supported by inexperienced  devs.  These issues could leave low-quality DApps more open to being  hacked.  There will even be DApps that are outright scams or rug pulls.  Sadly  this is inevitable at some point. And of course, the detractors  will  seize on these issues and seek to amplify them to damage the community.&lt;/p&gt;\n\n&lt;p&gt;It  is the responsibility of each DApp developer to  ensure that their  application produces the correct results. Meanwhile,  every responsible  member of the community should do their own research  and help educate  others. In the end, it is up to individual users to  protect themselves  from bad actors. So be curious, even skeptical. Ask  questions. Accept  nothing at face value. Equally, be cautious in calling  out scams - with  so much FUD about, you should not add to the noise  without due  deliberation. And many of us will remember this &lt;a href=\"https://en.wikipedia.org/wiki/The_Boy_Who_Cried_Wolf\"&gt;cautionary tale&lt;/a&gt; from our childhoods…&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;A fact checklist&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Who are the developers?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Developers  proud of their product will be easy to contact and responsive to   questions. There should be a project website. Anonymity or pseudonymity  is  relatively common in crypto, but it is important to know the  developer  can be traced if money is involved. It is much easier for  anonymous  developers to disappear with your funds. Even if fully  doxxed, is this  the developer’s first project? Devs or code shops with a  reputation have  more to lose, while inexperienced developers are more  likely to make  mistakes or take shortcuts, especially if there is a  rush to launch.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What is the project’s vision?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Do   your best to ensure that the project’s values and actions align with   your values. Look at decentralization, idealism, passion, and purpose.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;FOMO is your enemy&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If   it’s a great application now, it will be a great application next week   and next month. If the developer plays on your fear of missing out,  that  is a big red flag. Due diligence takes time. Be diligent.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Is it really, really good?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The   old saying applies. If it’s too good to be true, it probably is. If  the  project offers higher than normal staking rewards, you need to be   hyper-vigilant and very thorough in your investigation.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Celebrity endorsements&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Endorsements  can be bought, and they are often an essential ingredient of a pump and  dump or rug pull. By design, retail investors first discover a dump or  rug pull when their basket of tokens is suddenly worthless. Don’t put  your trust in YouTubers, but take note of YouTubers you trust.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Is the product open source?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Not   all trustworthy DApps need to be open source. However, if the product   claims to be open source, you should check the claim. For example, the   GitHub repository should be accessible and active.  The names of people  on GitHub should match at least some of the people  on the project  website.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Project documentation&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There may be a white paper, lite paper, or other design documentation.&lt;/p&gt;\n\n&lt;p&gt;Perform   a thorough fact check: check sources, investigate authors, ensure   content is authentic and not plagiarized. Evidence of poor proofreading,   missing content, or broken links in references should all raise   concerns. If the white paper is on a ‘pay to publish’ site, you should   take that into consideration.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Token distribution&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If  the project has an  associated token, use a chain analysis tool to  check for a  concentration of token ownership. For example, it would  raise concern if  most of the project&amp;#39;s tokens were allocated to a  handful of wallets.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Is it a new project, or is it ported from another chain?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Check  its reputation in its past life, if it had one. It still takes good  developers to take full advantage of the platform.&lt;/p&gt;\n\n&lt;p&gt;If it is a new project, how new is it? Do the participants have any history in the crypto space?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Is the developer engaged on social media?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Look  for an active community of users and reviewers.  Look to see how  recently the entities associated with the project were created. Be  suspicious of new accounts with only a few tweets. Check the number of  followers, too. Tools like Sparktoro are another way you can check real v  fake followers.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How much testing has been done?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We  would  expect a good project to have been active on the testnet – and  offering  commentary in social channels – before its mainnet launch.  Promoting the testnet launch through social media to allow  end-users to  test and build their understanding.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Has an external audit been conducted?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Look for a respected organization that is independent of the developer. See below for some useful organizations.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Review the product against your requirements&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;No   matter how good the product, it must be right for you. If you are   looking to earn extra ada rewards or trade, it remains forever true –   never risk more than you can afford to lose.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Some useful organizations&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;External   organizations can help you learn more about the developer of the DApp.   Also, DApp developers can enlist external companies to help with the   development process.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;More information about developers&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Check the &lt;a href=\"https://research.binance.com/en/projects\"&gt;Binance Project Reports&lt;/a&gt; page. It aims to cover the top crypto-projects and provide unbiased information.&lt;/li&gt;\n&lt;li&gt;The &lt;a href=\"https://messari.io/research\"&gt;Messari site&lt;/a&gt; provides research reports for organizations or individuals.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.crunchbase.com/\"&gt;Crunchbase&lt;/a&gt; provides data about organizations and individuals. There is a free trial; otherwise, this is a paid service.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://pitchbook.com/\"&gt;PitchBook&lt;/a&gt; is a financial data and software company. There is a free trial option available here too.&lt;/li&gt;\n&lt;li&gt;Search &lt;a href=\"https://www.linkedin.com/feed/\"&gt;LinkedIn&lt;/a&gt; profiles of people and companies.&lt;/li&gt;\n&lt;li&gt;Use &lt;a href=\"http://www.betterwhois.com/\"&gt;BetterWhois&lt;/a&gt; or a similar registry to find out when a website was created and basic details of who is behind it.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Companies that help with DApp development&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"http://www.quviq.com/\"&gt;QuviQ&lt;/a&gt; is a Swedish company that specializes in property-based testing.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://runtimeverification.com/\"&gt;Runtime Verification&lt;/a&gt; performs security audits.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.certik.com/\"&gt;Certik&lt;/a&gt;,   founded in 2018 by Yale University and Columbia University academics,   is a pioneer in blockchain security. Certik uses best-in-class AI   technology to secure and monitor blockchain protocols and smart   contracts.&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.tweag.io/\"&gt;Tweag&lt;/a&gt;   is a software innovation lab that helps technology start-ups improve   their engineering performance and execute high-risk, high-reward   projects.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;As  intelligent, skeptical consumers, users must demand only the  best  DApps. Supporting great DApps will nourish a population of honest,   trustworthy developers. Together, we will reach our goal of becoming a   flourishing, self-governing community.&lt;/p&gt;\n\n&lt;p&gt;Source: &lt;a href=\"https://iohk.io/en/blog/posts/2021/12/09/when-it-comes-to-defi-do-your-own-research/\"&gt;https://iohk.io/en/blog/posts/2021/12/09/when-it-comes-to-defi-do-your-own-research/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/bUVSY8c_eYyxX1UWB-GYES8Sqs1_-ZAEehsX7xOgge8.jpg?auto=webp&amp;s=3d880061e6bf44ccf6ebac8a52bc0713574209ef",
          "width": 695,
          "height": 564
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/bUVSY8c_eYyxX1UWB-GYES8Sqs1_-ZAEehsX7xOgge8.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=d1ebd5a567d9843818cdd945c04235effdf83482",
            "width": 108,
            "height": 87
          },
          {
            "url": "https://external-preview.redd.it/bUVSY8c_eYyxX1UWB-GYES8Sqs1_-ZAEehsX7xOgge8.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=50d119dac76da8d5d3fcbcd99da706bac161568a",
            "width": 216,
            "height": 175
          },
          {
            "url": "https://external-preview.redd.it/bUVSY8c_eYyxX1UWB-GYES8Sqs1_-ZAEehsX7xOgge8.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=e5684dd27c7eafcab008ff83ae43929e99a8dbfb",
            "width": 320,
            "height": 259
          },
          {
            "url": "https://external-preview.redd.it/bUVSY8c_eYyxX1UWB-GYES8Sqs1_-ZAEehsX7xOgge8.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=b753bad71897717599627f8e7bc7d34b7839d525",
            "width": 640,
            "height": 519
          }
        ],
        "variants": {},
        "id": "bMFT9hsqwfrjnp2NQYHACwDD2eq7sHNAWcsqzopeScU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/rp0lpu/this_is_exactly_what_it_means_when_someone_says/",
  "subreddit": "CryptoCurrency",
  "id": "rp0lpu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I intentionally did not want to mention just one blockchain (see source below)\ncause this article is universal and applies to all blockchains and it's\nextremely valuable to all of us involved in crypto.\n\nYour favorite blockchain is typically an open, permissionless blockchain. So\nthere is no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は意図的に1つのブロックチェーンだけを言及したくなかった（下記ソース参照）\nなぜなら、この記事はすべてのブロックチェーンに適用される普遍的なものであり\n暗号に携わるすべての人にとって、非常に価値のあるものです。\n\nあなたの好きなブロックチェーンは、一般的にオープンでパーミッションレスのブロックチェーンです。つまり\nはないのですが・・・。",
      "title": "自分で調べる（DYOR）：詐欺師より賢くなる方法とは？教育的な投稿"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我故意不想只提到一个区块链（见下面的资料）。\n因为这篇文章是通用的，适用于所有的区块链，它对一个人来说是非常有价值的。\n对我们所有参与加密货币的人都非常有价值。\n\n你最喜欢的区块链通常是一个开放的、无权限的区块链。所以\n没有...",
      "title": "当有人说要做自己的研究（DYOR）时，这正是它的意思：关于如何比骗子更聪明的指南! 一个教育性的帖子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我故意不想只提到一個區塊鏈（見下面的資料）。\n因爲這篇文章是通用的，適用於所有的區塊鏈，它對一個人來說是非常有價值的。\n對我們所有參與加密貨幣的人都非常有價值。\n\n你最喜歡的區塊鏈通常是一個開放的、無權限的區塊鏈。所以\n沒有...",
      "title": "當有人說要做自己的研究（DYOR）時，這正是它的意思：關於如何比騙子更聰明的指南! 一個教育性的帖子"
    }
  ]
}