{
  "author": "WrathfulZach",
  "original_created_utc": 1626878976,
  "title": "I reluctantly bought ETH at $783 in feb of 2018. Kept telling myself I was late to the party.",
  "created_utc": 1626892706,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The best time to plant a tree is ten years ago. The next best time is today. </p>\n\n<p>Back in 2018, ETH was crashing from its ATH of $1200, and I reluctantly FOMOed in at $780, only to watch it crash to to $87 within ten months. I felt like a fool. I felt like it was too late for me to have bought in and that I missed the gravy train. I caught hell from my wife. I didn’t sell any since I only bought a couple hundred dollars worth and was at a huge loss, so I held. I remember how stupid I felt. It makes me cringe.</p>\n\n<p>Now I feel stupid for not taking profits when it was over $4k. I got greedy. Wanted to see how much gains I could make. (Take profits when your up. Makes holding easier.)</p>\n\n<p>The point is, if you believe in the future of crypto, especially blue chip crypto like BTC and ETH, then it isn’t too late, especially when the market is down like this. You don’t have to time the bottom perfectly. Nobody can. Just get in, start DCA, and hold for a few years. </p>\n\n<p>IT’S NOT TO LATE! This is a perfect time.</p>\n</div><!-- SC_ON -->",
  "score": 254,
  "permalink": "/r/CryptoCurrency/comments/ooreyk/i_reluctantly_bought_eth_at_783_in_feb_of_2018/",
  "subreddit": "CryptoCurrency",
  "id": "ooreyk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The best time to plant a tree is ten years ago. The next best time is today.\n\nBack in 2018, ETH was crashing from its ATH of $1200, and I reluctantly FOMOed\nin at $780, only to watch it crash to to $87 within ten months. I felt like a\nfool. I felt like it was too late for me to have bought in and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "木を植えるのに最適な時期は10年前。次のベストタイムは今日です。\n\n2018年当時、ETHはATHの1200ドルから暴落しており、私はしぶしぶ780ドルでFOMOしたが、10年以内に87ドルまで暴落するのを見た。\nしぶしぶ780ドルで買ったのですが、10ヶ月以内に87ドルまで暴落するのを目の当たりにして、「なんだこれ？私は自分がまるで\n愚かだと思いました。買ってからでは遅いと思ったし...。",
      "title": "2018年の2月に783ドルでETHをしぶしぶ買いました。私はパーティーに遅れたと自分に言い聞かせていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "种植一棵树的最佳时间是十年前。下一个最佳时间是今天。\n\n早在2018年，ETH从其ATH的1200美元坠落，我不情愿地在780美元时FOMO了一下\n我不情愿地以780美元的价格买入，但在10个月内却看到它崩溃到87美元。我觉得自己像个\n傻瓜。我觉得我买入的时候已经太晚了，...",
      "title": "我在2018年2月不情愿地在783美元买了ETH。一直告诉自己，我已经迟到了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "種植一棵樹的最佳時間是十年前。下一個最佳時間是今天。\n\n早在2018年，ETH從其ATH的1200美元墜落，我不情願地在780美元時FOMO了一下\n我不情願地以780美元的價格買入，但在10個月內卻看到它崩潰到87美元。我覺得自己像個\n傻瓜。我覺得我買入的時候已經太晚了，...",
      "title": "我在2018年2月不情願地在783美元買了ETH。一直告訴自己，我已經遲到了。"
    }
  ]
}