{
  "author": "The_Jean_Dixon",
  "original_created_utc": 1648805754,
  "title": "I am Jeane Dixon, famed medium, psychic and astrologer! I predicted the death of JFK, and other things which definitely ended up happening. AMA about THE FUTURE!!!!!",
  "created_utc": 1648839501,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://imgur.com/a/4yK4Px5\"&gt;Proof.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It is I - the one, the only, the incomparable Jeane Dixon, renowned psychic, author and close confidante of the 40th President of the United States, Nancy Reagan. I&amp;#39;ve written multiple best-selling books, including an autobiography, a cookbook and of course my magnum opus, &amp;#39;Horoscopes for Dogs&amp;#39;. I also predicted that the apocalypse would start in 2020 - but we can&amp;#39;t be right about &lt;em&gt;everything&lt;/em&gt;, I suppose&lt;em&gt;.&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;Do you doubt my prowess in parsing the future? Do you require &lt;em&gt;proof&lt;/em&gt; of my bona fides? Ah, what sad, closed minds you must have (not like &lt;em&gt;Nancy&lt;/em&gt;). Fine then - I predict that you, dear reader, are about to spend a small amount of time reading text on the internet! &lt;/p&gt;\n\n&lt;p&gt;This prediction is much more impressive when you consider that &lt;em&gt;I don&amp;#39;t even really know what the internet is&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;There seem to be many guests on these forums today, but they are all hacks, I assure you. For they purport to tell you only of the dingy, dreary past, like the temporally-challenged buffoons they all are. I, on the other hand, hold the keys to THE FUTURE. Ask me anything about what the future holds in store for you, your family, the world and any given president or pope of your choice!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/ttmq1h/i_am_jeane_dixon_famed_medium_psychic_and/",
  "subreddit": "AskHistorians",
  "id": "ttmq1h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Proof. [https://imgur.com/a/4yK4Px5]\n\nIt is I - the one, the only, the incomparable Jeane Dixon, renowned psychic,\nauthor and close confidante of the 40th President of the United States, Nancy\nReagan. I've written multiple best-selling books, including an autobiography, a\ncookbook and of course my…"
}