{
  "author": "ZhangtheGreat",
  "the_new_excerpt": "Are there any stocks in your portfolio right now that have been disappointing so\nfar, but they don’t frustrate you as much because you’re hopeful that they’ll\nturn it around at some point in the foreseeable future? Also, for those who’ve\ninvested for several years, have there been any stocks from…",
  "original_created_utc": 1621649359,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、あなたのポートフォリオの中で、これまでのところ失望させられている銘柄はありますか？\nこれまでのところ失望していますが、近い将来に好転することを期待しているので、それほど不満は感じていませんか？\nなぜなら、近い将来、いつかは好転するだろうと期待しているからです。また、数年前から投資している人にとって\nまた、数年前から投資している人には、これまでに...という銘柄はありますか？",
      "title": "\"期待はずれだが希望はある」と思っている保有銘柄"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你的投资组合中，现在是否有任何股票到目前为止令人失望？\n但它们并没有让你感到沮丧，因为你希望它们会在可预见的未来某个时间点扭转局面。\n在可预见的未来的某个时间点上扭转局面？另外，对于那些已经\n的人来说，是否有任何股票从......",
      "title": "你持有的 \"令人失望但有希望 \"的股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你的投資組合中，現在是否有任何股票到目前爲止令人失望？\n但它們並沒有讓你感到沮喪，因爲你希望它們會在可預見的未來某個時間點扭轉局面。\n在可預見的未來的某個時間點上扭轉局面？另外，對於那些已經\n的人來說，是否有任何股票從......",
      "title": "你持有的 \"令人失望但有希望 \"的股票"
    }
  ],
  "title": "“Disappointing but hopeful” stocks you hold",
  "created_utc": 1621688928,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Are there any stocks in your portfolio right now that have been disappointing so far, but they don’t frustrate you as much because you’re hopeful that they’ll turn it around at some point in the foreseeable future? Also, for those who’ve invested for several years, have there been any stocks from your past that fit this category? If so, what did you eventually do with those stocks?</p>\n\n<p>I’m only less than two months into my investing journey, so take what I say with a grain of salt, but my top three so far are…</p>\n\n<p>3) MA - Talk about a stock that swings wildly. At its peak, MasterCard was as high as +300 for me. At its bottom, it fell to almost -200. Right now it’s sitting at around -100. I saw MA’s chart before I bought, and I noticed the wild price swings, but I also saw the general upward trend of higher highs and lows, which is why I’m not worried about its ability to eventually recover again.</p>\n\n<p>2) SBUX - The stock was climbing from the moment I bought it…until its earnings report. Then it recovered. Then it didn’t. Yet despite its ridiculously high P/E ratio, it’s Starbucks. Its brand is as loud as Coca-Cola or Disney. I doubt it stays down for long.</p>\n\n<p>1) OPY - When I was trying to find undervalued stocks, Oppenheimer’s numbers made it an attractive buy. Then the recent panic over inflation hit, and OPY wasn’t immune from the fall. Still, all indicators point to it being undervalued, and it’s already shown the ability to recover at least once. It seems as though I just got in at a bad time.</p>\n</div><!-- SC_ON -->",
  "score": 81,
  "permalink": "/r/stocks/comments/ni8fp6/disappointing_but_hopeful_stocks_you_hold/",
  "subreddit": "stocks",
  "id": "ni8fp6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389722
}