{
  "author": "surprisedduck26",
  "the_new_excerpt": "I’m actually fairly new to this sub but I’ve been interested in crypto since the\n2017 Bitcoin bubble, which is when I first started to hear about cryptocurrency.\nI was also a broke high school kid back then—so I really couldn’t have invested\neven if I wanted to.\n\n3 years go by.\n\nI’ve been studying…",
  "original_created_utc": 1610224475,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "实际上我对这个潜艇还很陌生，但是我从一开始就对密码感兴趣。\n2017年比特币泡沫，也就是我第一次听说加密货币的时候。\n我当时也是一个破产的高中生-所以我真的不可能投资\n即使我想这么做。\n\n3年过去了。\n\n我一直在研究…",
      "title": "我是如何用加密技术使我的净资产翻了五番的--以及为什么我决定退出"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "實際上我對這個潛艇還很陌生，但是我從一開始就對密碼感興趣。\n2017年比特幣泡沫，也就是我第一次聽說加密貨幣的時候。\n我當時也是一個破產的高中生-所以我真的不可能投資\n即使我想這麼做。\n\n3年過去了。\n\n我一直在研究…",
      "title": "我是如何用加密技術使我的淨資產翻了五番的--以及爲什麼我決定退出"
    }
  ],
  "title": "How I quintupled my net worth with crypto—and why I decided to pull out",
  "created_utc": 1610255254,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m actually fairly new to this sub but I’ve been interested in crypto since the 2017 Bitcoin bubble, which is when I first started to hear about cryptocurrency. I was also a broke high school kid back then—so I really couldn’t have invested even if I wanted to. </p>\n\n<p>3 years go by. </p>\n\n<p>I’ve been studying the market, learning more about investing, and following crypto news religiously. I’m confident that I can make a lot of money really fast. I’m also no longer a broke high school kid—I’m now a broke college student. However, I did earn some scholarship money. I decide to take $500 and invest it in ETH and BTC. My parents immediately freaked out since I could have lost the entire scholarship if the organization found out I wasn’t using it for school-related costs (I’m being vague on purpose). I asked my parents if they can lend me some money so I could jump into the market. Seeing as I just almost ruined myself financially by risking my scholarship, my parents were...hesitant, to say the least. </p>\n\n<p>A few more months go by.</p>\n\n<p>The BTC and ETH bull market are in full swing. I’m on subs like this, seeing other people living  out my fantasies and making tons of money on crypto. I’m a little salty, I won’t lie. But the pandemic has hit me hard and I have literally $1.00 in the bank—I can’t afford to go all in on crypto. </p>\n\n<p>And then <a href=\"/u/420everytime\">u/420everytime</a> changed my life. I was on this subreddit, just commenting under a random post when I got a notification in my vault. I had just been tipped 250 moons! I hop on Google and went to CoinGecko to see how much they’re trading for. My 256 moons are worth $4.00256 in total, effectively quintupling my net worth! I’m glad I was able to make a killing of crypto. Unfortunately I’m up too high and I must cash out. It’s been a good run folks!</p>\n</div><!-- SC_ON -->",
  "score": 368,
  "permalink": "/r/CryptoCurrency/comments/ktytsq/how_i_quintupled_my_net_worth_with_cryptoand_why/",
  "subreddit": "CryptoCurrency",
  "id": "ktytsq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706376221
}