{
  "author": "fkuser250k",
  "the_new_excerpt": "Alright guys,\n\nI've got a solid one here and spent quite a bit of time on this. Two Words:\nXeris Pharmaceuticals. They already have two recently approved and\ncommercialized drugs(Gvoke for diabetes) that did roughly $20m in revenue in\n2020 during COVID and with only six months to market since it was…",
  "original_created_utc": 1613416156,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，伙计们。\n\n我这里有一个实实在在的，花了不少时间在这上面。两个字。\nXeris Pharmaceuticals. 他们已经有两个最近批准和\n商业化的药物(治疗糖尿病的Gvoke)，大约有2000万美元的营收，在中国市场上。\n2020年COVID期间，而自上市以来，仅用了6个月的时间，...",
      "title": "[质量DD]Xeris制药是目前市场上最可笑的被低估的医药股。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，夥計們。\n\n我這裏有一個實實在在的，花了不少時間在這上面。兩個字。\nXeris Pharmaceuticals. 他們已經有兩個最近批准和\n商業化的藥物(治療糖尿病的Gvoke)，大約有2000萬美元的營收，在中國市場上。\n2020年COVID期間，而自上市以來，僅用了6個月的時間，...",
      "title": "[質量DD]Xeris製藥是目前市場上最可笑的被低估的醫藥股。"
    }
  ],
  "title": "[Quality DD] Xeris Pharmaceuticals is the most ridiculously undervalued pharma stock in the market right now.",
  "created_utc": 1613429976,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright guys,</p>\n\n<p>I&#39;ve got a solid one here and spent quite a bit of time on this. Two Words: Xeris Pharmaceuticals. They already have two recently approved and commercialized drugs(Gvoke for diabetes) that did roughly $20m in revenue in 2020 during COVID and with only six months to market since it was launched in June 2020. For example analyst estimates for Q3 was $4m, they did $9m. They beat analyst expectations every time. Really shows strength by management, but we trading at less than the low estimate for their U.S sales estimates. Peak Global for Gvoke is $500m a year, and they recently got EU approval for 27 countries. Short manipulation and OPEX manipulation fucks this one up a lot. To put it short, my first price target is $30, and others well over $50. here is why. Xeris pharmaceuticals is a platform pharmaceutical company that has two revolutionary techs: XeriJect and XeriSol. Essentially, the technology creates the revolutionary potential to address the limitations of conventional medicines with low stability and low solubility. Many medicines require water, refrigeration, larger dosing and with an inconvenient delivery method(IV, rectal, etc). The Xeri-technology solves these problems, no other company can do this shit. Its patented too.</p>\n\n<p>My favorite part of this is CEO Daddy Paul. Management in this company is top fucking notch. All were part of the same team in selling their previous company Durata for $23 bucks/share, and many many other companies. All have connections in big pharma and lead the commercialization efforts of many drugs. Paul Edick has extensive experience in big pharma companies including lead positions as President of Asia Pacific and Latin America operations at Pharmacia(Acquired by Pfizer in 2002 for $60bn) and at Searle Pharma as President for Asia Pacific, Canada, and Latin American operations. He lead the global commercialization efforts of $3bn/yr Celebrex along with John Shannon. Then in 2006, Paul became CEO of MedPointe Healthcare, which he later sold to Meda of Sweden for roughly $820m, the deal closed in 2007. In 2008, Paul was chosen to lead Ganic Pharmaceuticals, a $1bn Warburg Pincus-backed Investment Search Vehicle, as CEO to acquire specialty pharma assets. During this time Paul acquired an asset coming out of Pfizer, an antibiotic called Dalbavancin, which he quickly turned around into a fully fledged company, taking it public as Durata Therapeutics (NASDAQ:DRTX) in 2010. After several years of commercialization of development, Paul sold Durata to Actavis(now Allergen) in 2014 for roughly $675m. After some time, Paul exited retirement for the third time at the request of his previous investors to potentially lead a variety of companies. After looking through over 30+ companies, Paul chose Xeris Pharmaceuticals, which he officially joined in 2017 as CEO and Chairman. </p>\n\n<p>John Shannon, COO and now more recently President, served as the CEO of Catheter Connections for a couple years until it was finally sold to Merit Medical in 2016. John also served alongside Paul at Durata as CCO until its acquisition. Prior to these roles, John has a extensive history in big pharma, notably as VP at Baxter Healthcare, where he commercialized and drove sales for two drugs: GAMMAGARD and ADVATE ( $1bn/yr each).</p>\n\n<p>Essentially Xeris is a BO target in the future. Also there was a recent CEO interview, Paul literally stated at like 1:40:00 something or around there that while they did do an offering at a low price, investors will be happy when Xeris will be trading at $40-$50 soon. So the link cant be posted, but search it on youtube: Tales from the Trenches: Paul Edick, CEO of Xeris.</p>\n\n<p>They have a bunch of other things in the pipeline. Excluding any licensing potential from their technology, their pipeline peak global sales is <strong>close to $2bn annually.</strong> Underfollowed and Under fucking valued. They are focusing on selling their diabetes drug and have 3 drugs for licensing, pramlintide, Diazepen, and their current Gvoke Offering in Europe. No company was ever able to combine Insulin and pramlintide together, Xeris tech did it. CEO stated at a recent conference that FDA was highly interested in that Phase 3 program and its a &quot;gamechanger&quot; in a $5bn US market. Diazepam is for seizures and currently it must be injected anally, Xeris technology fixed that with their tech, now its the first easy to use intramuscular injection. Global market for Diazepen is smaller at only $1bn. They added two more drugs to their pipeline. Guys NOTHING in this company is currently being valued in their stock price, this should be trading between $1.5bn to $3bn already. Even their current approved drug peak sales at $500m isn&#39;t valued properly! Using an average industry comp of 2-3x peak sales == $1.5bn, that&#39;s for the approved Gvoke alone. Doesn&#39;t include pipeline or tech.</p>\n\n<p>Oh yeah let me fucking casually say that Big pharma is interested in their tech, they have 3 active projects with BIG pharma (yeah big swinging dicks like Pfizer and Daddy JJ shit).</p>\n\n<p>Don&#39;t buy calls, too much manipulation. Worth $30 minimum. Buy shares, make the shorts squeeze, then ride it to $30-$50. Quality Management, quality product and tech with unlimited potential. Also their cash is $140m, and they said they have enough until cash flow .</p>\n</div><!-- SC_ON -->",
  "score": 62,
  "permalink": "/r/stocks/comments/lkklou/quality_dd_xeris_pharmaceuticals_is_the_most/",
  "subreddit": "stocks",
  "id": "lkklou",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624080
}