{
  "author": "depressedkittyfr",
  "original_created_utc": 1637496880,
  "title": "How many men would remain in love if sex was off the table due to illness or disability?",
  "created_utc": 1637518693,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Genuine question since I am feeling quite shocked witnessing two women being left by their partners as they were rendered disabled and couldn’t have sex anymore. This seems to be an extremely common pattern where men walk out more often  or cheat if there is temporary sexlessness is involved . I encountered two men in dating app who were cheating on their pregnant wives. </p>\n\n<p>In many cultures it’s acceptable for the man to seek services once his wife gets pregnant. </p>\n\n<p>Which comes to mind how many men associate sex with love</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/qytr7p/how_many_men_would_remain_in_love_if_sex_was_off/",
  "subreddit": "TooAfraidToAsk",
  "id": "qytr7p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Genuine question since I am feeling quite shocked witnessing two women being\nleft by their partners as they were rendered disabled and couldn’t have sex\nanymore. This seems to be an extremely common pattern where men walk out more\noften or cheat if there is temporary sexlessness is involved . I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2人の女性が障害者となってセックスできずにパートナーに捨てられたのを目撃して、とてもショックを受けているので、純粋な質問です。\n二人の女性がパートナーに捨てられているのを目撃し、とてもショックを受けています。\nを目撃し、とてもショックを受けています。これは、一時的にセックスレスになると、男性がより頻繁に出て行ったり、浮気をしたりする、非常によくあるパターンのようです。\n一時的にセックスレスになった場合、男性はより頻繁に出て行ったり、浮気をしたりします。I...",
      "title": "病気や障害のためにセックスができない場合、どれだけの男性が愛を貫くでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的问题是真实的，因为我目睹了两个女人被她们的伴侣抛弃，因为她们变成了残疾人，无法做爱，我感到非常震惊。\n他们的伴侣抛弃了他们，因为他们已经变成了残疾人，无法再进行性生活。\n残疾，不能再做爱了。这似乎是一个非常常见的模式，如果有临时性问题，男人会更多地离开\n如果涉及到暂时性的无性行为，男人就会经常离开或出轨。I...",
      "title": "如果由于疾病或残疾，性生活不在桌面上，有多少人还会保持爱情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的問題是真實的，因爲我目睹了兩個女人被她們的伴侶拋棄，因爲她們變成了殘疾人，無法做愛，我感到非常震驚。\n他們的伴侶拋棄了他們，因爲他們已經變成了殘疾人，無法再進行性生活。\n殘疾，不能再做愛了。這似乎是一個非常常見的模式，如果有臨時性問題，男人會更多地離開\n如果涉及到暫時性的無性行爲，男人就會經常離開或出軌。I...",
      "title": "如果由於疾病或殘疾，性生活不在桌面上，有多少人還會保持愛情？"
    }
  ]
}