{
  "author": "pineapplepiebrownie",
  "the_new_excerpt": "Procter & Gamble\n\n“The commodity cost challenges we face this year will, obviously, be larger next\nfiscal year. We will offset a portion of this impact with price increases. Our\nBaby Care, Feminine Care, and Adult Incontinence businesses have announced price\nincreases in the United States that would…",
  "original_created_utc": 1619583557,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Procter & Gamble社\n\n\"今年直面したコモディティコストの課題は、当然ながら来年度はさらに大きくなります。\n今年直面しているコモディティコストの課題は、明らかに来年度はより大きなものになるでしょう。この影響の一部を値上げで相殺します。当社の\nベビーケア事業、フェミニンケア事業、大人用失禁症事業は、米国での値上げを発表しました。\n米国での値上げを発表しました。",
      "title": "インフレに関する最近の企業幹部のコメント"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "宝洁公司\n\n\"我们今年面临的商品成本挑战，显然在下一个财政年度会更大。\n财政年度会更大。我们将通过提价来抵消这一影响的一部分。我们的\n我们的婴儿护理、女性护理和成人失禁用品业务已经宣布在美国提价。\n我们的婴儿护理、女性护理和成人失禁用品业务已经宣布在美国提价，这将使我们的产品更有竞争力。",
      "title": "最近企业高管对通货膨胀的评论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "寶潔公司\n\n\"我們今年面臨的商品成本挑戰，顯然在下一個財政年度會更大。\n財政年度會更大。我們將通過提價來抵消這一影響的一部分。我們的\n我們的嬰兒護理、女性護理和成人失禁用品業務已經宣佈在美國提價。\n我們的嬰兒護理、女性護理和成人失禁用品業務已經宣佈在美國提價，這將使我們的產品更有競爭力。",
      "title": "最近企業高管對通貨膨脹的評論"
    }
  ],
  "title": "Recent corporate executive comments on inflation",
  "created_utc": 1619602952,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Procter &amp; Gamble</p>\n\n<p>“The commodity cost challenges we face this year will, obviously, be larger next fiscal year. We will offset a portion of this impact with price increases. Our Baby Care, Feminine Care, and Adult Incontinence businesses have announced price increases in the United States that would go into effect in mid-September. The exact timing and amount of increases vary by brand and sub-brand in the range of mid-to-high single digits.”</p>\n\n<p>Honeywell</p>\n\n<p>“And for us, inflation is taking hold. There is no doubt about it. We knew it. We see it, it&#39;s real. And if you don&#39;t stay on top of it, the two areas where -- and this is not a surprise. Steel, semiconductors, copper, ethylene, those are the four elements that we saw substantial inflation in Q1…. I don&#39;t think things are going to abate. The short cycle is definitely hard. We all read the same articles around semiconductors and what&#39;s going on there. And I think we&#39;re going to have to just stay ahead of it. But we do expect that inflationary environment this year and we&#39;re going to be to stay ahead of it.”</p>\n\n<p>Kimberly Clark</p>\n\n<p>“I&#39;d like to start the call today with a few brief remarks. Our first quarter results and outlook have been impacted by supply chain disruption, faster-than-expected consumer tissue de-stocking, and a sharp rise in input costs. While I&#39;m not pleased with the results and our outlook, we&#39;re taking decisive actions to manage through the short-term challenges we face.”</p>\n\n<p>Coca-Cola</p>\n\n<p>“… we&#39;re closely monitoring upward pressure in some inputs, such as high fructose corn syrup, PET, metals and other packaging materials as they impact us, as well as our bottling partners.”</p>\n\n<p>PepsiCo</p>\n\n<p>“In terms of &#39;21, there is certainly higher input inflation, but it&#39;s been factored into the &#39;21 guidance, notably in terms of agricultural and packaging. In addition to that, we have also factored in the higher freight and transportation costs that we&#39;re experiencing out there right now.”</p>\n\n<p>Nestle</p>\n\n<p>“I would like to caution against excessive margin growth expectations based on these strong sales growth. We now see broad-based inflation across our various commodities, packaging materials and transportation costs. Not all of these items can be hedged and our hedging cover for a number of commodities will run out over time. We are raising prices where appropriate, but usually there is a time lag associated with pricing.”</p>\n\n<p>Danone</p>\n\n<p>“When it comes to inflation, you&#39;re absolutely right to say that we have seen an accelerating inflation since the start of the year, which is impacting us, I would say, across the different ingredients, which is on milk, but also other dairy ingredients, on plastics, on sugar, but also, as I said, on logistics and transport. And we are reaching now a very strong mid-single digit level when it comes to inflation.”</p>\n\n<p>Boston Beer</p>\n\n<p>“On the freight, clearly, this is -- there&#39;s a factor that you probably have heard that on other calls in the industry. There&#39;s a real shortage of drivers and of trucks. So the ratio between available trucks and loads have significantly worsened. And that&#39;s what we see in the rate. To the point that we&#39;ve broken it out really in the earnings release separately because the impact is significant. And it really depends, right. We have contracted rates, but then you don&#39;t get the truck and you have to go deeper into it. So we&#39;ve seen the impact on multiple levels. One is the input costs are going up …it&#39;s coming into are our cost and materials and that&#39;s ingredients, the packaging materials. So we see it there.”</p>\n\n<p>Celanese</p>\n\n<p>“I mean, we&#39;re certainly feeling the inflationary factor. I think, the good news is, we anticipated this coming back in fourth quarter of last year already and started moving prices in engineered materials to reflect this, and of course, that price ultimately still gets reflected more quickly. So although it is an inflationary pressure, we&#39;ve been able to push that through in our pricing and basically maintain the same level of variable margin.”</p>\n\n<p>Crown Holdings</p>\n\n<p>“…we thought it would be well to remind you that delivered aluminum in North America sits around $1.28 a pound versus $0.75 a pound last year at this time. So an increase of 70% and as we contractually pass through the LME and the delivery premium reported revenues will reflect both volume increases and the higher aluminum cost this year.”</p>\n\n<p>Steel Dynamics</p>\n\n<p>“Despite record first quarter 2021 shipments for our steel fabrication segment, first quarter operating income was $10 million compared to sequential fourth quarter earnings of $25 million. Lower earnings were the result of metal spread compression as higher average selling values were offset by significantly higher steel input costs.”</p>\n\n<p>Mattel</p>\n\n<p>“We&#39;re not going to talk about specific pricing actions or timing. But we are evaluating price adjustments for the recent increases in input costs and I would also want to point out that despite the cost inflation we&#39;re it seeing and the impact it&#39;s having on gross margin.”</p>\n\n<p>Whirlpool</p>\n\n<p>“So while the macroeconomic environment remains uncertain, we are confident that sustained strong consumer demand and our previously announced cost-based pricing actions will offset the impact of global supply constraints and rising input costs.”</p>\n\n<p>Snap-On</p>\n\n<p>“Look -- yes, well, look, we&#39;ve got material inflation in these numbers. We can&#39;t see them, can you? Right. And so part of the thing is you got -- you kind of got an interesting cocktail of reduced travel, controlled costs, material inflation floating through this. And the general managers in our businesses are balancing all these, like balls in the air. And so yes, we might see some, but we&#39;re not -- at the same time, we can also price. And I think the tools group has got another price increase going out. They just announced in April, early April, they announced the price increase, so they&#39;re going to have one coming up.”</p>\n\n<p>GATX Corporation</p>\n\n<p>“…we buy cars both on the spot market and through our supply agreements that the majority of which is through the supply agreements. So certainly, the increased price of steel is increasing the cost of a car across the board.”</p>\n\n<p>Dover Corporation</p>\n\n<p>“I get it that the Fed doesn&#39;t want to recognize inflation, but there is inflation and it&#39;s not just a raw materials because raw materials are in the subcomponents that we buy from our vendors who are trying to pass along the same kind of price increases that goes into our bill of materials and everything else. And clearly at the assembly level on labor availability is becoming a problem and that is beginning to start to move up labor costs over time. So, it&#39;s now gone from, it&#39;s a capital good size that are buying a lot of raw materials now it&#39;s moving into the assembled components portions of the business that is going to have to accommodate that over the balance of the year. On top of that, as I mentioned before, logistics costs we ship a lot of product that&#39;s FOB, so we&#39;re not, it&#39;s more inbound logistics costs then it is outbound logistics costs. But freight costs are going up because you&#39;re going to add. I mean, God forbid, you have to air freight anything right now. It&#39;s a bit of a negative.</p>\n\n<p>Sonoco</p>\n\n<p>“Our Industrial segment was hit the hardest with price/cost challenges, due to the higher OCC costs internationally as well as higher-than-expected inflation and operating costs like energy and freight.”</p>\n\n<p>TE Connectivity</p>\n\n<p>“Certainly, we&#39;re feeling the biggest inflation right now is on the freight side. The freight inflation has been significant and as we battle through there and there&#39;s a variety of reasons for that, including higher air freights and so forth in terms of that and that&#39;s not unique to TE. Certainly, I think that&#39;s been -- is well publicized across the overall supply chain. We are -- as we move towards the second half of the year, we are seeing a little bit higher input costs, particularly with the resins and some of that pretty directly attributable to the weather issues that were in Texas here earlier this past quarter. And then, the copper prices as we&#39;ve continued to monitor those, we&#39;ve seen those creep up. In some cases, we have hedges in place in terms of how we hedge our metals cost.”</p>\n\n<p>Badger Meter</p>\n\n<p>“I mean even Just in the first quarter, we saw the input cost go from $3.60 to today $4.20 and that&#39;s after March having been a relatively favorable change that obviously has been erased here in the month of April. So I think it&#39;s what we&#39;ve been saying all along in terms of the continued price focus and the opportunity and the market acceptance of being able to pass some of those increases through in today&#39;s dynamics and in today&#39;s environment. We&#39;re going to continue to do that, and we&#39;re going to do that to a degree that we&#39;re able to -- we believe we&#39;ll be able to offset the majority of the cost pressures. And I don&#39;t see that changing dramatically as we move forward.”</p>\n</div><!-- SC_ON -->",
  "score": 429,
  "permalink": "/r/investing/comments/n06qet/recent_corporate_executive_comments_on_inflation/",
  "subreddit": "investing",
  "id": "n06qet",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214683
}