{
  "author": "buddyfake",
  "original_created_utc": 1629903165,
  "title": "Why Cardano is more Popular than XLM: Marketing",
  "created_utc": 1629920051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why is Cardano more popular than XLM?</p>\n\n<p>The answer is simple: marketing.</p>\n\n<p>Many people dont even know that XLM already has smart contracts and NFTs for some time.</p>\n\n<p>At the same time most people know that Cardano will have smart contracts in the future.</p>\n\n<p>Cardanos strength is not its features, it is marketing, Charles Hoskinsons biggest strength is advertising upcoming promises and features.</p>\n\n<p>At the same time the Stellar (XLM) Foundation is very quiet about promises and advertising their crypto, while actually delivering on these features. Did you know that the literal country of Ukraine has picked them to help build their national digital currency?</p>\n\n<p>If it would have been Cardano, you would hear that being hyped up for the next two years, while most people are not even aware of XLMs international partnerships.</p>\n\n<p>I have nothing against Cardano or XLM and am bullish on both, but this hypocrisy needs to be mentioned.</p>\n</div><!-- SC_ON -->",
  "score": 255,
  "permalink": "/r/CryptoCurrency/comments/pbcunc/why_cardano_is_more_popular_than_xlm_marketing/",
  "subreddit": "CryptoCurrency",
  "id": "pbcunc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Why is Cardano more popular than XLM?\n\nThe answer is simple: marketing.\n\nMany people dont even know that XLM already has smart contracts and NFTs for\nsome time.\n\nAt the same time most people know that Cardano will have smart contracts in the\nfuture.\n\nCardanos strength is not its features, it is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜカルダノはXLMよりも人気があるのか？\n\n答えは簡単で、マーケティングです。\n\n多くの人は、XLMが以前からスマートコントラクトやNFTを持っていることさえ知らない。\n知っている人は少ないでしょう。\n\n同時に、ほとんどの人は、Cardanoが将来的にスマートコントラクトを持つことを知っている。\n将来的には。\n\nカルダノの強みはその機能ではなく、...",
      "title": "カルダノがXLMよりも人気がある理由：マーケティング"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么Cardano比XLM更受欢迎？\n\n答案很简单：营销。\n\n很多人甚至不知道XLM已经有了智能合约和NFTs，用于\n一段时间了。\n\n同时，大多数人知道Cardano在未来会有智能合约。\n未来。\n\n卡达诺的优势不在于其功能，而在于...",
      "title": "为什么Cardano比XLM更受欢迎：市场营销"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼Cardano比XLM更受歡迎？\n\n答案很簡單：營銷。\n\n很多人甚至不知道XLM已經有了智能合約和NFTs，用於\n一段時間了。\n\n同時，大多數人知道Cardano在未來會有智能合約。\n未來。\n\n卡達諾的優勢不在於其功能，而在於...",
      "title": "爲什麼Cardano比XLM更受歡迎：市場營銷"
    }
  ]
}