{
  "author": "danieljhamer",
  "original_created_utc": 1644574076,
  "title": "My boyfriend wants to tie ribbon round my dick and balls?!",
  "created_utc": 1644595626,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last night when we were… getting frisky he said he wanted to do bondage and I was down for it. Then he pulled my boxers down and got some ribbon out of the drawer and tried to tie it round my dick. I didn’t know what the fuck was going on and pretended like I had explosive diarrhoea to get out of it. &lt;/p&gt;\n\n&lt;p&gt;He tried texting me this morning to ask if my bowels are ok now. What do I do next???&lt;/p&gt;\n\n&lt;p&gt;If anyone has had similar experiences Please reach out !&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/spw0kw/my_boyfriend_wants_to_tie_ribbon_round_my_dick/",
  "subreddit": "TooAfraidToAsk",
  "id": "spw0kw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Last night when we were… getting frisky he said he wanted to do bondage and I\nwas down for it. Then he pulled my boxers down and got some ribbon out of the\ndrawer and tried to tie it round my dick. I didn’t know what the fuck was going\non and pretended like I had explosive diarrhoea to get out of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨夜は...盛り上がった時に...彼が緊縛をしたいと言ったので\nは、そのためにダウンしていた。そして、彼は私のボクサーを下ろし、リボンを取り出しました。\n引き出しの中で、私のペニスに巻き付けようとしたんだ。私は何が起こっているのかわかりませんでした。\n爆発的な下痢をしたようなふりをして、その場をやりすごしました。",
      "title": "彼氏が私のチンコとタマタマにリボンを結びたいって!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨晚，当我们......玩得很开心时，他说他想做捆绑，而我\n我很乐意。然后他把我的内裤拉下来，从抽屉里拿出一些丝带。\n抽屉里拿出一些丝带，想把它绑在我的阴茎上。我不知道这到底是怎么回事\n我不知道他妈的发生了什么事，就假装我有爆炸性腹泻，以摆脱......",
      "title": "我的男朋友想把丝带绑在我的阴茎和蛋蛋上？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨晚，當我們......玩得很開心時，他說他想做捆綁，而我\n我很樂意。然後他把我的內褲拉下來，從抽屜裏拿出一些絲帶。\n抽屜裏拿出一些絲帶，想把它綁在我的陰莖上。我不知道這到底是怎麼回事\n我不知道他媽的發生了什麼事，就假裝我有爆炸性腹瀉，以擺脫......",
      "title": "我的男朋友想把絲帶綁在我的陰莖和蛋蛋上？"
    }
  ]
}