{
  "author": "hi_im_tryingmybest",
  "original_created_utc": 1626509662,
  "title": "Does anyone know why Peppa Pig’s little brother’s name is George? And not a name that follows the same format as every other character on the show?",
  "created_utc": 1626518509,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Peppa Pig. \nSuzy Sheep. \nCandy Cat. \nZoë Zebra. \nPedro Pony.\nGerald Giraffe. \nEmily Elephant. \nDanny Dog. </p>\n\n<p>And then you have: George Pig. </p>\n\n<p>With the exception of the parents and grandparents, as well as the animals with careers, why does George not follow the same alliterative format? This is a genuine question that bothers me. In any other universe, this might make George the main character.</p>\n\n<p>ETA: just looked up the fandom wiki and Mummy Pig’s name is Rachel. Mummy Pig and George live in a simulation confirmed.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/om089o/does_anyone_know_why_peppa_pigs_little_brothers/",
  "subreddit": "NoStupidQuestions",
  "id": "om089o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Peppa Pig. Suzy Sheep. Candy Cat. Zoë Zebra. Pedro Pony. Gerald Giraffe. Emily\nElephant. Danny Dog.\n\nAnd then you have: George Pig.\n\nWith the exception of the parents and grandparents, as well as the animals with\ncareers, why does George not follow the same alliterative format? This is a\ngenuine…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Peppa Pigです。スージー・シープ キャンディ・キャット Zoë Zebra. ペドロ・ポニー ジェラルド・ジラフ（Gerald Giraffe）。エミリー\nエレファント Danny Dog.\n\nそして、あなたには George Pigです。\n\n両親や祖父母、仕事を持っている動物たちは例外ですが\nなぜGeorgeは同じ叙述的なフォーマットに従わないのでしょうか？これは\n本物の...",
      "title": "ペッパピッグの弟の名前がなぜジョージなのか知っている人はいますか？この番組の他のキャラクターと同じ形式の名前ではなく？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Peppa Pig. Suzy Sheep. 糖果猫 Zoë Zebra. 佩德罗小马 Gerald Giraffe. 艾米丽\n大象. 丹尼狗。\n\n然后你有。乔治猪。\n\n除了父母和祖父母，以及那些有职业的动物之外，为什么乔治不跟着他们一起生活呢？\n职业，为什么乔治没有遵循同样的典故格式？这是个\n真正的...",
      "title": "有谁知道为什么小猪佩奇的小兄弟叫乔治？而不是一个与剧中其他角色相同格式的名字？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Peppa Pig. Suzy Sheep. 糖果貓 Zoë Zebra. 佩德羅小馬 Gerald Giraffe. 艾米麗\n大象. 丹尼狗。\n\n然後你有。喬治豬。\n\n除了父母和祖父母，以及那些有職業的動物之外，爲什麼喬治不跟着他們一起生活呢？\n職業，爲什麼喬治沒有遵循同樣的典故格式？這是個\n真正的...",
      "title": "有誰知道爲什麼小豬佩奇的小兄弟叫喬治？而不是一個與劇中其他角色相同格式的名字？"
    }
  ]
}