{
  "author": "Siamak71",
  "the_new_excerpt": "I'm from a 3rd world country with a very unstable economy and hyper inflated\ncurrency. I got into cryptocurrency at the beginning of COVID because I lost my\njob and there were no other jobs available, so I did some research and saw how\nfiat and will of governments are the major reason my people…",
  "original_created_utc": 1616250480,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我来自第三世界国家，经济很不稳定，通货膨胀得厉害\n货币。我在COVID之初进入加密货币，是因为我失去了我的\n工作，而且没有其他工作可做，所以我做了一些研究，看到了如何。\n法令和政府的意志是我国人民...",
      "title": "低收入投资加密技术。我是如何做到的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我來自第三世界國家，經濟很不穩定，通貨膨脹得厲害\n貨幣。我在COVID之初進入加密貨幣，是因爲我失去了我的\n工作，而且沒有其他工作可做，所以我做了一些研究，看到了如何。\n法令和政府的意志是我國人民...",
      "title": "低收入投資加密技術。我是如何做到的"
    }
  ],
  "title": "Investing in Crypto with Low Income: How I've been doing it",
  "created_utc": 1616258087,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m from a 3rd world country with a very unstable economy and hyper inflated currency. I got into cryptocurrency at the beginning of COVID because I lost my job and there were no other jobs available, so I did some research and saw how fiat and will of governments are the major reason my people suffer this much and also how crypto can help bypass these restrictions.</p>\n\n<p>So, after doing research and calculating electricity costs and gains, I invested most of my savings into a small mining rig which ended up earning me more money per month than my previous job because the price of ETH got better. For reference I was making 110$ per month from my job, but I was earning roughly 160$ from mining every month. I found another job recently, but for quite some time, mining was my primary source of income. Now I roughly earn 300$ per month, mining + my job.</p>\n\n<p>Anyway the reason I brought this up was to show how little I was earning and how I still managed to invest in crypto. Usually investing requires a large amount of initial capital (Such as stocks and property), which many people don&#39;t have, but crypto doesn&#39;t have any such barrier. I started spending less and less on things I didn&#39;t really need. Smoking, drinking, occasional drug use (marijuana) and ordering food all the time. These can be anything, for me it was these things. Some people spend excessive money on collectible, games, clothing etc... So its up to each individual to find out what is their needless spending.</p>\n\n<p>I quit smoking, drugs and alcohol and started cooking more. This allowed me to invest around 1$ per day in BTC or coin of my choice. Sometimes I simply held onto my ETH instead of selling it, and sometimes I bought another coin. But as I said, it was around 30$ a month. It&#39;s basically nothing in terms of international value, but it was decent amount of money for me (inflation is a bitch) and now depending on the coin I invested in, I have profits in almost all of them. Even though I convert most of my mining into fiat to spend on bills and costs of living, every investment I made I&#39;ve been hodling ever since. It didn&#39;t make me rich or anything, but now I have basically tripled my investments and have more in savings than I ever did.</p>\n\n<p>Which one are you more likely to regret more:<br/>\n1. I could have spent the whole year smoking and drinking, and eating bad food, but I didn&#39;t</p>\n\n<ol>\n<li>I could have spent the whole year investing in crypto and living a healthier life, but I didn&#39;t</li>\n</ol>\n\n<p>In fact, with my savings, I would feel less terrible for indulging in things I quit now and then, because its no longer a big economic drain like it used to be and we are all human, so we do deserve some leisure spending. Its all thanks to that crucial year of investing. </p>\n\n<p>I recommend everyone to do their own research, but I still believe it&#39;s early enough to invest a small amount of your income in crypto every month, hodl and see profits long term. My mother thinks I am some kind of genius for tripling our savings, but she simply doesn&#39;t understand the concept of crypto. In reality, I was just following crypto info on my 2nd monitor while gaming and not spending money on things I didn&#39;t need. I am no genius. Crypto simply provides investment opportunities to people who don&#39;t have large initial capital to invest in traditional investment avenues.</p>\n\n<p>I hope this has been helpful to other people with low income, specially others who are also from countries that have unstable economy and inflated currencies. Even 1%-5% of your monthly income in crypto is a good long term investment, but as always do your own research and pick your coins. I didn&#39;t do &quot;day trading&quot; or try to invest in new coins, hoping they would go up. I mainly invested in coins that were solid already. I would suggest the same for fellow low income investors. In the end this has been my experience, and I thought I should share it. And don&#39;t forget, this is just for one year. The more we hold, the better. Finally, even if we don&#39;t make it, we have merely sacrificed unnecessary things in our lives, we still have the friends and connections we made along the way.</p>\n\n<p>P.S: Happy new year and Nowruz to everyone who follow Iranian/Zoroastrian solar calendar around the world! The equinox is upon us and spring has sprung! Happy first day of spring.</p>\n</div><!-- SC_ON -->",
  "score": 6027,
  "permalink": "/r/CryptoCurrency/comments/m983wv/investing_in_crypto_with_low_income_how_ive_been/",
  "subreddit": "CryptoCurrency",
  "id": "m983wv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815290
}