{
  "author": "FMCTandP",
  "the_new_excerpt": "We’ve recently had demographic surveys on the sub about age and investment\nexperience, so I’m curious about the other end of the spectrum: people’s long\nterm plans for their investments.\n\nAnd while the Boglehead investment philosophy isn’t specifically geared toward\nretirement per se, that’s one of…",
  "original_created_utc": 1620731444,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、サブで年齢や投資経験などの人口統計調査を行っています。\n投資経験についての調査を行いましたが、もう一方では、投資に関する長期的な計画についても興味があります。\n投資に関する長期的な計画について興味があります。\n\nボーグルヘッドの投資哲学は、特に老後を意識したものではありませんが\n老後の生活を考えている人もいるかもしれませんが、それは...",
      "title": "退職後の目標日"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们最近在子上进行了关于年龄和投资经验的人口统计调查。\n经验，所以我对光谱的另一端感到好奇：人们的长期\n他们对投资的长期计划。\n\n虽然Boglehead的投资理念并不是特别针对\n退休本身，但这是一个...",
      "title": "退休目标日期"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們最近在子上進行了關於年齡和投資經驗的人口統計調查。\n經驗，所以我對光譜的另一端感到好奇：人們的長期\n他們對投資的長期計劃。\n\n雖然Boglehead的投資理念並不是特別針對\n退休本身，但這是一個...",
      "title": "退休目標日期"
    }
  ],
  "title": "Retirement Target Date",
  "created_utc": 1620754153,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’ve recently had demographic surveys on the sub about age and investment experience, so I’m curious about the other end of the spectrum: people’s long term plans for their investments.</p>\n\n<p>And while the Boglehead investment philosophy isn’t specifically geared toward retirement per se, that’s one of the bigger investment goals anyone can have.</p>\n\n<p>Vote below to indicate the age at which you expect to be able to retire based on your current plan, whether you intend to retire at that age or not. </p>\n\n<p>(Leave a comment if this poll isn’t quite applicable to you, e.g. if you are primarily saving for a goal other than retirement, you are pursuing Financial Independence but don’t intend to Retire Early, etc)</p>\n\n<p><a href=\"https://www.reddit.com/poll/n9ujit\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 22,
  "permalink": "/r/Bogleheads/comments/n9ujit/retirement_target_date/",
  "subreddit": "Bogleheads",
  "id": "n9ujit",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994589
}