{
  "author": "FaithInGovernance",
  "the_new_excerpt": "As the Trump administration leaves, certain agencies have been passing many last\nsecond rules and regulations. I just received an alert saying the following:\n\n\"The incoming Biden administration will be blocked from increasing energy\nefficiency requirements for furnaces, water heaters and boilers…",
  "original_created_utc": 1610636528,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "随着特朗普政府的离开，某些机构已经通过许多最后的\n第二条规章制度。我刚刚收到一个提示，说是这样的。\n\n\"即将上任的拜登政府将被阻止增加能源\n炉子、热水器和锅炉的效率要求...。",
      "title": "拜登政府为何被某些管理法规 \"封杀\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着特朗普政府的離開，某些機構已經通過許多最後的\n第二條規章制度。我剛剛收到一個提示，說是這樣的。\n\n\"即將上任的拜登政府將被阻止增加能源\n爐子、熱水器和鍋爐的效率要求...。",
      "title": "拜登政府爲何被某些管理法規 \"封殺\""
    }
  ],
  "title": "Why is the Biden Administration \"Blocked\" from certain governing rules and regulations",
  "created_utc": 1610665059,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the Trump administration leaves, certain agencies have been passing many last second rules and regulations. I just received an alert saying the following:</p>\n\n<p>&quot;The incoming Biden administration will be blocked from increasing energy efficiency requirements for furnaces, water heaters and boilers under a final Energy Department rule made public Thursday.&quot;</p>\n\n<p>Why would their administration be blocked? Why can&#39;t they just roll back the rule or put a new one in effect once they are in power? I have seen multiple headlines like this, dealing with Environmental, Banking, and many other industries regulations. </p>\n\n<p>Another headline example from this morning:</p>\n\n<p>&quot;  Wall Street lenders will face new orders barring them from refusing to work with businesses solely because of perceived reputational risk under a final rule issued Thursday by the Office of the Comptroller of the Currency.&quot;</p>\n\n<p>Why do these articles make it seem like the Biden administration will have their hands tied, especially now that they won the senate.</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/Ask_Politics/comments/kx7a1d/why_is_the_biden_administration_blocked_from/",
  "subreddit": "Ask_Politics",
  "id": "kx7a1d",
  "is_self": true,
  "media": null,
  "is_video": false
}