{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "All About Asset Allocation\n\n- Realistic expectations are important to investment planning\n- Market volatility is more predictable than market return\n- Investments with expected positive investment return and higher volatility have higher expected return\n- All investments have risk. Even T-Bills which is inflation risk. There is no risk-free investment\n- No more than 12 funds because it gets too complex with higher fees and diminishing returns\n- Do not change your percentage of equity/bond based on what you think the market will do. Once you select a ratio stick with it.\n- Most people can&amp;#39;t stomach a 100% equity portfolio\n- A well-developed plan works only when the investor sticks to the plan through good and bad times\n- A sensible investment plan never fails an investor, the investor fails the plan\n- People tend to more optimistic about stocks after the market goes up and less after it goes down\n- Investors give too much weight to recent information\n- People tend to buy investments that have had a recent run-up in performance\n- Investors label investments good or bad depending of the price relative to where they bought it\n- People are reluctant to admit errors\n- Overconfident investors generally believe they have more knowledge and information than they actually do. Therefore, they tend to trade too much and underperform\n- Males tend to be overconfident\n- Females tend to do better at sticking to a long-term plan and usually perform better\n- Do not change your investment strategy during a bear market\n- If you can rebalance without hesitation even during bad markets, your risk tolerance is good\n- Many portfolio failures occur when investors take on too much risk\n\nThe Investors Manifesto\n\n-\tA study of investors in 1998 determined that the average investor expects a higher return when buying at high prices than when buying at low prices\n-\tInvestors&amp;#39; expectations moved in the same direction as stock prices, which is opposite of what it should be\n-\t3 main points\n  - Don&amp;#39;t be too greedy\n  - Diversify as widely as possible\n  - Always be wary of the investment industry\n-\tDuring times of extreme economic or political turbulence, risks will seem high. This will depress the prices of both stock and bonds and thus raise their future returns. Stock and bonds bought at such times generally earn the highest long-term returns; stock and bonds bought in times of calm and optimism generally earn the lowest long-term returns\n-\tNothing is more likely to make you poor than your own emotions\n-\tThe brain responds more to the anticipation of a reward than to the reward itself. And it responds identically to the prospect of food, sex, social contact, cocaine, or financial gain\n-\tYou brain is particularly sensitive to the pattern of stimuli.\n-\tNearly every time we invest, our cortex (calculating part of our brain) fights with our limbic (emotional part of our brain)\n-\tLearn to automatically mistrust simple narrative explanations of complex economic or financial events\n-\tDo not seek excitement in your investment portfolio. It is a quick way to end up poor. Your investments should be dull and boring\n\n4 Pillars\n\n-\tInvesting in young tech companies yields low returns.\n-\tReturns on IPO&amp;#39;s are a bad deal for everyone but the underwriters\n-\tNecessary conditions for a bubble are\n  - A major technological revolution or shift in financial practice\n  - Easy credit\n  - Amnesia of the last bubble. Usually takes a generation (30 years)\n  - Abandonment of time-honored methods of security valuation\n-\tBubbles occur whenever investors simply begin buying shares simply because they have been going up\n-\tThe four most expensive words in the English language are &amp;quot;This time, it&amp;#39;s different.&amp;quot;\n-\tSevere bear markets are usually followed by powerful bull markets\n-\tIt is human nature to be unduly influenced by the last 10-20 years. Don&amp;#39;t do this.\n-\tWhen recent returns for a given asset class have been very high or low, put your faith in the longest data series you can find, not just the most recent\n-\tBuying assets that everyone else has been running from take fortitude\n-\tBen Graham said there were no intrinsically &amp;quot;good&amp;quot; or &amp;quot;bad&amp;quot; stocks. At a high enough price, even the best companies were highly speculative. And at a low enough price, even the worst companies were a sound investment\n-\tAfter the great depression, they were practically giving away stocks. Dividend yields were 10% and stocks were selling for less than book value\n-\tWhen the inevitable crash occurs, do not panic and sell out. Simply stand pat and stay the course with your asset allocation\n-\tIdeally, when prices of stocks fall dramatically, you should go even further and actually increase your percentage equity allocation. This requires nerves of steel\n-\tHumans are social creatures and enjoy associating with others. It is a good thing in general but a terrible one in investing\n-\tOverconfidence is probably the most important of financial behavior errors\n-\tIf history did repeat itself, the wealthiest investors would be librarians\n-\tThere are some pieces of data that have worth. Like housing starts or the length of the average industrial working week. The problem is that everyone knows this information too and it is already being factored into the stock and bond prices. Something that everyone knows isn&amp;#39;t worth knowing yourself.\n-\tAn investment that has become the topic of widespread conversation is likely to be overpriced. When everyone owns a particular asset class, many of those investors will be inexperienced &amp;quot;weak hands&amp;quot; who will panic and sell at the first sign of trouble\n - Strategy for above\n    - Identify the era&amp;#39;s conventional wisdom and assume it is wrong\n      - At present that is that stock returns are higher than bonds-2010\n    - Asset classes with the highest future returns tend to be the ones that are currently the most unpopular. This means you will get disapproval from friends and neighbors who are buying what is popular\n-\tDon&amp;#39;t be overconfident. Do you really think you are smarter than those people on the other side of the trade? They are usually professionals with more resources than you can dream of.\n-\tTell yourself a couple times per year, &amp;quot;The market is smarter than I ever will be. There are millions of other investors who are much better equipped than me. If I can&amp;#39;t beat the markets, then the very best I can hope to do is join in as cheaply and efficiently as possible.&amp;quot;\n-\tIgnore the last 10 years and don&amp;#39;t buy the hot sector/market. In reality a better strategy is to buy what has done the worst the last 10 years. Markets tend to RTM (Revision to the mean)\n-\tThe most exciting tend to have the lowest returns\n-\tA superior portfolio strategy should be boring\n-\tMyopic risk aversions – humans tend to focus on short term losses and is detrimental to your portfolio\n  - Check your portfolio as infrequently as possible\n  - Hold enough cash so you have dry powder to take advantage of low prices.\n-\tThe intelligent investor tells himself each time he takes a hit, that low prices mean higher future returns\n-\tAll apparent stock market patterns are just coincidence. There are NO patterns. Ignore them\n-\tAvoid the herd\n-\tAvoid overconfidence\n-\tDon&amp;#39;t be impressed with an asset&amp;#39;s performance over the last 5 or 10 years\n-\tExciting investments are usually a bad deal\n-\tTry not to worry about short term losses\n-\tBeware of forecasts\n-\tFocus on the whole portfolio\n\nSkating Where the Puck Was\n\n- If looking into the past revealed mean variance characteristics that stood the test of time, librarians would be the best investors\n- You have to move on when you get too much company, the first people to invest in an asset class get high expected returns and low correlation. Later investors get lower returns and higher correlation to a broad index\n- Diversification opportunities available to ordinary investors were never as good as they appeared in hindsight\n- Is there hope for superior returns?\n  - Be early\n  - Be far-sighted\n  - Be patient\n- Being early in the hardest. David Swenson of the Yale Endowment was first to the alternative strategies area and did well, then everyone copied him. His returns have sense been lower\n- Being far sighted is a bit easier. Resign yourself to the fact that during most bear markets, easily tradable, risk assets move up and down nearly in sync. Everyone loses money during those periods\n- Credit derived collapses occur about once every 9 years\n- When credit contracts during a crisis, investors reevaluate their risk tolerance, seek the comfort of government secured vehicles, and dump all their risky assets - ALL OF THEM\n- Short term crashes can be painful, but long-term returns are far more important to wealth creation and destruction\n- Resign yourself that diversifying among risky assets provides scant shelter from bad days or bad years, but that it does help protect against bad decades and generations. Which can be far more destructive to wealth\n- When everyone owns the same set of risky asset classes, the correlation among them will inevitably trend toward 1\n- But the inverse is true as well; when an asset class falls out of favor, its ownership transfers from weak hands into stronger and more independent minded ones, and correlations should fall along with rising future returns\n- Don&amp;#39;t chase returns by investing in asset classes with &amp;quot;weak hands&amp;quot;. They will bail at the first sign of trouble\n- It is difficult to invest in risky asset classes that are both liquid and short-term non-correlating\n- In the digital age, any asset class you can buy with a keystroke can and likely will bite you when things head south\n- The prime directive of adequate diversification can be stated as follows: Your portfolio should not look like everyone else.\n- When everyone owns the same portfolio, a lot of those owners, are going to have weak hands, and when the storm comes, they are going to sell their risky assets indiscriminately and send correlations higher and returns lower\n- Therefore, it is useful to estimate the strength of the hands of your fellow owners. You don&amp;#39;t want to be in an asset class with a bunch of weak hands that sell at the first sign of trouble. When a risky asset class becomes too popular, the fact that it is over owned by weak hands means that it will simultaneously have both low expected returns and high correlations\n- Even hedge fund managers have trouble with this because their customers demand payment during bad times, which forces them to sell risk assets even if they don&amp;#39;t want to\n- High correlations and low expected returns go together\n- But if an asset class is new or out of favor, it will tend to be owned by strong hands and have lower correlations and higher expected returns\n- JP Morgan said &amp;quot;During a bear market, stocks return to their rightful owners.&amp;quot;\n- Early adopters reap the initial high returns and low correlations of a novel asset class; then one or more academic and trade journal articles will describe them. Then correlations increase and future returns decrease\n- Rekenthaler&amp;#39;s Rule – If the bozos know about it, it doesn&amp;#39;t work anymore\n- Your long-term investing results are less the result of how well you pick assets than how well you stay the course during bad periods, especially if they occur late in your career\n\nRational Expectations\n\n- Tell yourself every day &amp;quot;I cannot predict the future therefore I must diversify&amp;quot;\n- We all have a tendency toward recency biases. That means in the current state (2020) that bond yields will always be low and high long-term equity returns with low inflation. None of this will be permanent\n\nIAA\n\n- Experienced investors understand risk and reward are intertwined\n  - One of the easiest ways to spot investment fraud is the promise of excessive returns with low risk\n- Stock are to be held for the long term.\n- Individual investors are drawn into stocks during powerful bull markets\n  - They don&amp;#39;t appreciate the risks with stocks. And after they have suffered the inevitable loss, they sell.\n    - No investor ever avoids loses at times, no matter how skilled\n- Investors suffer from recency bias.\n  - When prices fall, investors estimate of future returns goes lower too. This is irrational.\n  - Investors tend to overweight more recent data and underweight older data\n    - Most investors are &amp;quot;convex&amp;quot; traders in which they buy equities as they are rising and sell as they are falling.\n    - The opposite is a &amp;quot;concave&amp;quot; investor who buys as prices fall and sells as they rise\n      - In a world dominated by convex traders, it is an advantage to be a concave trader, and vice versa.\n- Human beings experience risk in the short term. This is because in nature, our ancestors had to focus on short term risks to survive.\n\nAsset Allocation\n\n- Generally, people believe that higher returns are possible with less volatility than is actually the case\n- A person who understands inflation risk, interest rate risks, credit risk, and equity risk is in a much better position to make intelligent investment decisions\n- You should be concerned not only about an asset class historical return but also about the dispersion of those returns and the likelihood that future returns will be higher or lower than past returns\n  - People often anchor their return expectation to an investments long term historical return. The average return could be an unlikely result\n- Most people do not think in terms of expected returns and standard deviation.\n  - They think in terms of the chance of loss\n\nA Random Walk Down Wall Street\n\n- Sir Isaac Newton &amp;quot;I can calculate the motions of heavenly bodies, but not the madness of people.&amp;quot;\n- Styles and fashions in investors evaluations of securities can and often do play a critical role in the pricing of securities. The stock market at times conforms well to the castle in the air theory, for this reason, it can be very dangerous\n- Do not purchase today&amp;#39;s hot new issue. Most IPO&amp;#39;s are bad for retail investors. But good for underwriters\n- Most bubbles have been associated with some new technology or with some new business opportunity.\n- Bubbles are a positive feedback loop. A bubble starts when a group of stocks begin to rise. The updraft encourages more people to buy, which causes more TV/Print coverage, which causes more people to buy, which creates big profits for early investors. The successful investors talk about how easy it is to get rich, which causes more people to buy. The whole idea is a kind of Ponzi scheme needing more and more greater fools to buy. But eventually they run out of fools and the stock plummets.\n- God Almighty does not know the proper P/E multiple for a common stock\n- The history of stock price movement contains no useful information that will enable an investor to consistently to outperform a buy and hold strategy\n- Behavioral Finance\n  - Investors are generally overconfident in their ability and convinced they can beat the market. A study showed that the more a person traded, the worse they did. Males traded more than females and did worse. Over optimism in forecasting the growth of existing companies could be one reason growth stocks tend to underperform value stocks.\n  - Biased Judgments – Investors tend to think they can control their investment results even though they can&amp;#39;t.\n  - Herding – research shows that groups tend to make better decisions than individuals. But this can cause &amp;quot;group think&amp;quot; where individuals will reinforce one another into believing that some incorrect view is the correct one\n  - Loss aversion – A study concluded that losses were 2 ½ times as undesirable as equivalent gain were desirable\n  - Pride and Regret – Investors find it very difficult to admit that they have made a bad stock market decision. But are quite proud to tell of their gains. Many investors therefore will hold onto losing positions hoping it recovers.\n- The problem with trying to &amp;quot;trade&amp;quot; with these ideas is that the market can remain irrational longer than you can remain solvent.\n- What are the lessons for the individual investor on behavioral finance?\n  - In investing, we are often our own worst enemy\n  - Avoid herd behavior. Any investment that has become a topic of widespread conversation is likely to be especially hazardous. But the same behavior leads investors to throw in the towel when pessimism is rampant – a good time to buy\n  - Avoid overtrading – this incurs more taxes and trading costs which decrease returns\n  - Be wary of new issues or IPO&amp;#39;s\n  - Stay cool to Hot Tips\n  - Never buy anything from someone who is out of breath\n  - Distrust foolproof schemes\n\nWinning the Loser's Game\n\n- Investors essential truth &amp;quot;We have met the enemy and he is us.&amp;quot;\n- Behavioral Economics\n  - We fail to appreciate the power of regression to the mean\n  - We ignore the normal pattern of experience\n  - We believe in &amp;quot;hot hands&amp;quot;\n  - We overreact to first impressions and then anchor to those views\n  - We suffer from illusion of control\n  - We rely on expert opinions and are overconfident in those opinions\n  - We overestimate out own skill and knowledge\n  - We respond to the &amp;quot;halo effect&amp;quot; of a recommendation of someone we admire, like a celebrity or athlete\n  - We are overly impressed by short term results\n  - We are &amp;quot;confirmation biased&amp;quot; looking for and then overweighting the data that supports our conclusion\n  - We anchor too much to our initial opinion\n  - We confuse familiarity with knowledge and understanding\n  - We overreact to both good and bad news\n  - We think we know more relative to what others know than we really do\n- Investors risks to avoid\n  - Trying too hard and taking too much risk\n  - Not trying hard enough, usually by having too much cash or money market accounts\n  - Being Impatient\n  - Changing mutual funds too much (holding less than 10 years)\n  - Borrowing too much\n    - 3 out of 4 fortunes that are lost got lost because borrowed money was used\n  - Being naively optimistic\n  - Being proud\n    - We overestimate our own ability\n  - Being emotional\n    - We are happy when our stocks go up and sad when they go down. And the feelings are stronger the faster the change in prices\n\n# **Irrational Exuberance**\n\n- Irrational Exuberance has occurred throughout history many times when markets have been bid up to unusually high and unsustainable levels under the influence of market psychology\n- Irrational exuberance is the psychological basis of a speculative bubble\n  - Speculative bubble is a situation in which news of price increases spurs investor enthusiasm, which spreads by psychological contagion from person to person, and, in the process, amplifies stories that might justify the price increase and brings in larger and larger class of investors, who despite doubts about the real value of the investment, are drawn to it partly through envy of others success, and party through a gambler&amp;#39;s mentality.\n- Cyclically Adjusted Price-Earnings Ratio (CAPE 10) – real (inflation adjusted) S+P Index divided by the 10-year moving average of real earnings on the index\n  - As a rule, and on average, years with low CAPEs have been followed by high returns, and years with high CAPEs have been followed by low or even negative returns\n- Analyst are reluctant to make sell recommendations near the peak of a market for many reasons\n  - James Grant &amp;quot;Honesty was never a profit center on Wall Street, but the brokers used to keep up appearances. Now they have stopped pretending. More than ever, securities research, as it is called, is a branch of sales. Investor, beware.&amp;quot;\n- Short term interest rates have been driven down to almost 0%. And with the fed offering &amp;quot;forward guidance&amp;quot; which has the effect to lower long-term yields too.\n  - This has caused investors to be disappointed in bond yields and need to &amp;quot;reach for yield&amp;quot; for various reasons. Even though the stock market was still perceived as risky, many investors think it has real upside potential, encouraging them to purchase stocks at higher and higher multiples.\n- The inequality gap increased during the 1920&amp;#39;s during the bull market and peaked around the market high in 1929\n  - The inequality gap sometimes coincides with an increase in nationalistic and xenophobic political parties\n- There is an incorrect notion in investors thinking that stocks are the &amp;quot;best investment&amp;quot; and investors cannot go wrong with them over the long run\n  - You find a striking correlation between prices and &amp;quot;best investment&amp;quot;: generally, when prices are going up, the percentage who think stocks are the best investment go up too.\n- The UBS Index of Consumer Optimism reported much more optimistic average expectations among individual investors around the peak of the stock market\n- Speculative bubbles are feedback loops where price increases lead to further price increases through increased investor demand\n  - Adaptive expectations – feedback takes place because past price increases generate expectations of further price increases\n  - Price to GDP – as the value of the stock market or housing market increases, the resulting wealth effect and optimism encourage expenditures\n  - Speculative bubbles cannot last forever and when demand stops, prices will too.\n    - This bursting of the bubble doesn&amp;#39;t necessarily have to be sudden. It can take place over years as did the 1929-1932 crash.\n- Large stock market moves do not always coincide with exceptionally important news\n- The media actively shape public attention and categories of thought, and they create the environment in which the speculative market events we see are played out\n  - The media can foster stronger feedback loops\n- There appears a pervasive human tendency toward overconfidence in one&amp;#39;s beliefs\n  - People tend to think they know more than they do\n  - People tend to make judgements in uncertain situations by looking for familiar patterns and assuming that future patterns will resemble past ones, often without sufficient consideration of the reasons for the pattern or the probability of the pattern repeating\n- Even completely rational people can participate in herb behavior when they take into account the judgments of others, even if they know that everyone else is behaving in a herd-like manner\n\n    - The behavior, although individually rational, produces group behavior that is irrational\n- There is ample systematic evidence that firms or markets that are &amp;quot;overpriced&amp;quot; by conventional measures have indeed tended to do poorly afterword\n- Stocks tend to have a regression to the mean: what goes up a lot tends to come back down, and what goes down a lot tends to come back up\n- Times of low dividend yields relative to stock prices in the stock market as a whole tend to be followed by price decreases or smaller than usual increases over long horizons.\n  - When one is not getting much in dividends relative to the price one pays for stocks, it is not a good time to buy stocks historically\n- If long term interest rates are very low (as they are in 2020) then investors in bonds need to have some doubts as to their worthiness as alternatives to the stock market, even if the CAPE ratio is high.\n  - Since the CAPE negatively predicts long term returns, the excess real return between stocks and bonds would be influenced negatively by both the CAPE and by the low long term interest rate.\n- The evidence that stocks will _ALWAYS_ out perform bonds over long term intervals simply does not exist.\n  - The so called &amp;quot;fact&amp;quot; of superiority of stocks over bonds is not a fact at all. Stocks are residual claims on corporate cash flow, available to stockholders after everyone else has been paid. Stock are therefore, by their very definition, risky. Stocks are not guaranteed to do well\n- The pubic is said to have learned that stocks always go right back up after they go down. We have seen evidence that people do think this, but they are wrong. Stock can and do go down and stay down for long periods (Decades). They can become overpriced and underperform for long periods of time\n- The pubic is said to have leaned that stocks must always outperform other investments like bonds over the long run. This too is false.\n- The public is also said to have learned about the wisdom of investing in stocks via active mutual funds whose management teams have proven track records, and once again they are wrong.\n- After the 2001 collapse, the public is said to have learned that housing is the &amp;quot;best&amp;quot; investment. They were wrong again\n  - The public must relearn all these &amp;quot;facts&amp;quot; again and again over time\n- At the time of this writing (2014) After the financial crisis, economies in many places are still weak. But these low interest rates may continue to support excessively high valuations in these markets. These problems will occur again in the future.\n\n# **Jason Zweig Your Money and Your Brain**\n\n-\tNeuroeconomics\n  - A monetary loss or gain causes a biological change that has profound physical effects on the body\n  - Neural activity of someone making money in investments are indistinguishable from someone high on cocaine\n  - After 2 repetitions of a stimulus, the human brain automatically, unconsciously, and uncontrollably expects a 3 repetition\n  - Once people conclude that an investment return is predictable, their brains respond with alarm if the pattern is broken\n  - Financial loss is processed in the same areas where we respond to mortal danger\n  - Anticipating a gain and actually receiving it are expressed in different areas. Helps explain why money does not buy happiness\n  - Expecting both good and bad events is often more intense than experiencing them\n-\tGreed\n  - There is only one sure thing on Wall Street. And this is there are NO sure things\n  - Lightning seldom strikes twice\n  - Lock up your &amp;quot;Mad Money&amp;quot; and throw away the key. If you can&amp;#39;t stop yourself from gambling in the market, then limit the amount\n  - Control your cues. Turn off CNBC\n  - Think twice before making any decisions. Calm yourself down\n-\tPrediction\n  - Our incorrigible search for patterns leads us to assume that order exists where there is non\n  - Whenever you are confronted with anything random, you WILL search for patterns in it\n  - People hate randomness\n  - If a reward is big enough, it will carry a long-lasting memory that is difficult to break. This is why chart analysts get into trouble because they think they &amp;quot;got it&amp;quot;\n  - Investors have a recency bias – what has happened they think will continue to happen, even if it is unpredictable. This causes investors to think that a bull market will continue and a bear market will also. This also causes them to buy the hottest mutual funds\n  - Control what you can in the market – don&amp;#39;t look for the next Google\n    - Expectations – set realistic goals\n    - Risk – ask not how much you can gain, but also how much you can lose\n    - Readiness – think twice\n    - Expenses – keep them low\n    - Commissions – keep them low too\n    - Taxes – don&amp;#39;t day trade, you get hit with short term taxes\n    - Yourself – don&amp;#39;t try to predict\n  - Don&amp;#39;t try to predict the market – DCA is a good strategy to prevent this\n  - Most mutual fund managers fail to beat the market. Answer to this is to DCA into index mutual funds\n  - Correlation is not causation\n  - Take a break – if you take a break, it resets your &amp;quot;gamblers fallacy&amp;quot; IE – a coin is flipped 7 times and comes up heads 7 times in a row, the next flip is &amp;quot;due&amp;quot; for a tail.\n  - Don&amp;#39;t obsess – if owning stocks is a long-term project for you, then following changes constantly is a very, very bad idea.\n-\tConfidence\n  - Create a &amp;quot;too hard&amp;quot; pile. Know what you don&amp;#39;t know.\n  - Measure 2x cut 1x. Have an overconfidence discount of 25% so if a stock according to your valuation is worth between $40-60. Make it $30-45.\n  - Don&amp;#39;t get stuck on your own companies&amp;#39; stock\n  - Diversification is the best defense\n-\tRisk\n  - Take a time out. Do not buy or sell an investment on the spur of the moment\n  - When the price drops, so does risk.\n  - Try to prove yourself wrong. Listen to another person&amp;#39;s opinion\n  - Know yourself and your risk tolerance\n-\tSurprise\n  - If everyone knows something. It is already embedded in the price of the stock\n  - High hopes can cause big trouble\n-\tRegret\n  - Expecting regret often hurts worse than experiencing it\n  - The more you can automate your investing, the better\n  - Face your loss.\n  - If you have a truly diversified portfolio, then you will guarantee yourself, by definition, that some of your assets will do well while some will do badly. You have to look at the whole portfolio\n  - Don&amp;#39;t chase hot sectors or stocks. The cure for chasing is to rebalance. Decide on a number and stick with it\n  - Rebalancing over the long-term increases returns and lowers risks. It is buying low and selling high\n-\tHappiness\n  - If you earn enough cash to live on. Then more money won&amp;#39;t make you happier\n  - Know that money is a means, not an end in itself\n-\tSummary\n  - Take a global view. Look at total net worth, not changes in each holding\n  - Hope for the best but expect the worst. Diversifying can keep you from panicking during bad times which will occur\n  - Investigate before you invest. A stock isn&amp;#39;t just a price. It is a company\n  - Never say always. Never put more than 10% of your investments into a single stock\n  - Know what you don&amp;#39;t know.\n  - The past is not the prologue. What goes up must come down and what goes way up usually comes down with a crunch. Never buy an investment because it is going up. Smart investors buy low and sell high\n  - If it sounds too good to be true, it probably is. Anyone who offers a high return at low risk is probably a fraud\n  - Costs are killers. Trading costs eat up your profits\n  - Don&amp;#39;t put all your eggs in one basket. Spread out between US, foreign, bonds, and cash. It is not a good idea to invest heavily in industries that your job is tied too. If you lose your job, your stock would be likely to fall also.\n\nThe Delusions of Crowds\n\n4 Signs of a bubble\n\n1. Everyone around you is talking about it. And you should start worrying when people talking about getting rich in certain areas of the market don&amp;#39;t have a background in finance\n2. When people begin to quit their jobs to speculate in the markets\n3. When someone exhibits skepticism about the prospects and people don&amp;#39;t just disagree with them, but they do so vehemently. They usually say &amp;quot;You just don&amp;#39;t get it.&amp;quot; &amp;quot;New Era&amp;quot; &amp;quot;It is different this time&amp;quot;\n4. When you start to see extreme predictions.\n\n- Human beings intuitively seek out outcomes with very high but very rare payoffs, such as lottery tickets, that on average lose money but tantalize their buyers with the chimera of unimaginable wealth\n- Researchers have found that our brains fire not only with reward, but even more intensely with its anticipation.\n  - There is nothing so disturbing to one&amp;#39;s well-being and judgement as to see a friend get rich\n- When presented with facts and data that contradict our deeply held beliefs, we generally do not reconsider and alter those beliefs appropriately. More often, we avoid contrary facts and data, and when we cannot avoid them, our erroneous assessments will even harden and make us more likely to proselytize them.\n- People respond more to narratives than to facts and data. And the more compelling the story, the more it erodes our critical thinking skills\n- We have 2 different types of thought process\n  - System 1 or &amp;quot;reptilian brain&amp;quot; that is fast moving emotional response\n  - System 2 or &amp;quot;evolutionary brain&amp;quot; that is much slower conscious reasoning\n    - Our faster emotional machinery leads, and our slower &amp;quot;reason&amp;quot; follows\n    - In a state of nature, the advantages of system 1 are obvious (IE - hissing snake at your feet). But in a relatively safe post-industrial world where dangers have a longer time horizon, system 1 dominance often occurs at great costs\n- Bank supplied leverage is the fuel that powers modern financial manias and it has brought with it a roller coaster of bubbles and busts\n  - Over the last 4 centuries, financial innovation has yielded a dizzying variety of investment vehicles: each, in its turn, was often simply leverage in a slightly different disguise and would prove the tinder that would set alight successive waves of speculative excess\n- Bubbles typically end with a seemingly small disturbance, followed by a swift collapse\n- Throughout history, property prices have ranged between five and twenty times annual rental values.\n- When investors are unhappy with ultra-low interest rates offered on safe assets, they bid up the prices of risk assets with rosier potential income.\n  - The allure of the hypnotic new technology (early 1800&amp;#39;s railroads) was amplified, as is almost always the case with bubbles, by falling interest rates, which makes investment capital more plentiful\n- Every bubble carry within it the seeds of its own destruction\n- When compelling narrative and objective fact collide, the former often survives.\n- Human beings suffer from confirmation bias, in which once they have settled on a hypothesis or belief system, pay attention only to data that supports their beliefs and avoid data that contradicts it.\n- Hyman Minsky thought bubbles needed 2 conditions\n  - Easy credit via low interest rates\n  - Advent of new technology\n- Investors excited about new technologies, or financial products, etc. begin to pour money into them. Since these assets can also be used as collateral for loans, rising prices mean that speculators can borrow even more to pour into these assets. A self-reinforcing cycle develops. But only on the way up\n- Minsky developed the &amp;quot;instability hypothesis&amp;quot; which states that in a safe and stable financial environment, money inevitably migrates away from safe borrowers and toward risky ones. Eventually, things get out of hand, resulting in a blowup, which makes lenders and investors more prudent, and the cycle begins anew. Usually about once per decade\n  - Amnesia is implicit in the instability hypothesis. After a crisis, investors shy away from risk. As markets recover and the unpleasant memories fade, participants become more open to risk and the instability cycle begins anew.\n  - We all like a good story; in the grip of a bubble, when faced with the unpleasant or difficult calculation, a compelling narrative provides easy escape from the effort of rigorous analysis.\n- Abandonment of hardheaded financial calculations in favor of compelling narratives is another factor that precipitates financial manias\n  - Rather than attempt the nearly impossible estimation of the value of a stock with high projected future earnings (South Sea in 1720, RCA in 1928, Pets.com in 1999, or Tesla today) investors default back to the simple heuristic: &amp;quot;X is a great company and it is going to change the world, and its worth paying almost any price for it.&amp;quot;\n- Humans have a recency bias: If stock prices have been rising for the past several years, they will come to believe that equity levels will continue to do so forever; as prices climb, shares become more attractive, which drives up prices even more. The reverse also happens during bear markets\n- John Templeton &amp;quot;The four most expensive words in the English language are &amp;#39;This time it&amp;#39;s different.&amp;#39;&amp;quot;\n- Max Winkler observed after the 1920 crash and discovery of the Dividend Discount Model that the market discounted not only the future, but the hereafter as well\n- Debt can grow faster than the rest of the economy for so long before they implode\n  - This is particularly true of private debt\n- During bubbles, people become intoxicated by the pursuit of effortless wealth\n- Even if we can&amp;#39;t model bubbles, we know what they look like\n- Minsky&amp;#39;s amnesia requirement usually reveals a generational divide during bubbles; only participants old enough to recall the last boom and bust are likely to be skeptical. Their younger and more enthusiastic colleagues will deride them as old fogies\n  - Bubbles are the province of young people with short memories\n- Market Bubbles require 4 necessary conditions\n  - Technological and financial displacement\n  - Credit loosening\n  - Amnesia of the past\n  - Abandonment of time-honored valuation principles\n- Under most circumstances, the Federal Reserve cares about 2 things\n  - Overall state of the economy (as measured by GDP growth and unemployment)\n  - Keeping inflation under control\n    - Stock prices are of lesser concern and often wind up a bystander of the other 2 policies\n- The Fed primary operates via the federal funds rate (interest rate at which member banks lend to each other overnight)\n  - When interest rates on these are high, they attract investors. Which pulls investment from risk assets (stocks) and lowers their prices. The opposite is true\n- We are apes who tell stories. When our remote ancestors needed to communicate with each other to survive, they did not do so with syllogisms, numerical data, or mathematics. The primary mode of that communication was and still is narration.\n- Humans are narrative animals, no matter how misleading the narrative, if it is compelling enough it will nearly always trump the facts, at least until those facts cause great pain.\n  - The more compelling the narrative, the more it erodes are analytical thinking\n  - We also mold the facts to fit our preexisting opinion\n    - We cling to facts that fit our narrative and ignore those that disconfirm them\n    - We intentionally avoid exposing ourselves to contrary data\n  - A compelling narrative can spread through a population just like a virus would and can even acquire critical mass\n    - As more and more people share the same delusion, the more likely we are to believe in it, and so the more likely those around us will do so as well, a vicious cycle ensues, gaining more and more momentum until they finally smash into the brick wall of reality.\n\nMarket History Book Summaries\n\nWhere are the Customers Yachts?  (Fun Book)\n\nhttps://old.reddit.com/r/stocks/comments/otlv6k/fred_schwed_where_are_the_customers_yachts/\n\nDevil Take the Hindmost\n\nhttps://old.reddit.com/r/stocks/comments/otlokh/devil_take_the_hindmost_a_history_of_financial/\n\nhttps://old.reddit.com/r/Bogleheads/comments/r4cb1a/devil_take_the_hindmost_a_history_of_financial/\n\nAll my book summaries and FAQ's I have done\n\nhttps://www.reddit.com/user/captmorgan50/comments/rnftyk/book_summaries/",
  "author_fullname": "t2_6ucr2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Psychology and Market History",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_tou79c",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 18,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Articles &amp; Resources",
  "can_mod_post": false,
  "score": 18,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1648311587,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1648310095,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All About Asset Allocation&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Realistic expectations are important to investment planning&lt;/li&gt;\n&lt;li&gt;Market volatility is more predictable than market return&lt;/li&gt;\n&lt;li&gt;Investments with expected positive investment return and higher volatility have higher expected return&lt;/li&gt;\n&lt;li&gt;All investments have risk. Even T-Bills which is inflation risk. There is no risk-free investment&lt;/li&gt;\n&lt;li&gt;No more than 12 funds because it gets too complex with higher fees and diminishing returns&lt;/li&gt;\n&lt;li&gt;Do not change your percentage of equity/bond based on what you think the market will do. Once you select a ratio stick with it.&lt;/li&gt;\n&lt;li&gt;Most people can&amp;#39;t stomach a 100% equity portfolio&lt;/li&gt;\n&lt;li&gt;A well-developed plan works only when the investor sticks to the plan through good and bad times&lt;/li&gt;\n&lt;li&gt;A sensible investment plan never fails an investor, the investor fails the plan&lt;/li&gt;\n&lt;li&gt;People tend to more optimistic about stocks after the market goes up and less after it goes down&lt;/li&gt;\n&lt;li&gt;Investors give too much weight to recent information&lt;/li&gt;\n&lt;li&gt;People tend to buy investments that have had a recent run-up in performance&lt;/li&gt;\n&lt;li&gt;Investors label investments good or bad depending of the price relative to where they bought it&lt;/li&gt;\n&lt;li&gt;People are reluctant to admit errors&lt;/li&gt;\n&lt;li&gt;Overconfident investors generally believe they have more knowledge and information than they actually do. Therefore, they tend to trade too much and underperform&lt;/li&gt;\n&lt;li&gt;Males tend to be overconfident&lt;/li&gt;\n&lt;li&gt;Females tend to do better at sticking to a long-term plan and usually perform better&lt;/li&gt;\n&lt;li&gt;Do not change your investment strategy during a bear market&lt;/li&gt;\n&lt;li&gt;If you can rebalance without hesitation even during bad markets, your risk tolerance is good&lt;/li&gt;\n&lt;li&gt;Many portfolio failures occur when investors take on too much risk&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The Investors Manifesto&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;  A study of investors in 1998 determined that the average investor expects a higher return when buying at high prices than when buying at low prices&lt;/li&gt;\n&lt;li&gt;  Investors&amp;#39; expectations moved in the same direction as stock prices, which is opposite of what it should be&lt;/li&gt;\n&lt;li&gt;  3 main points\n\n&lt;ul&gt;\n&lt;li&gt;Don&amp;#39;t be too greedy&lt;/li&gt;\n&lt;li&gt;Diversify as widely as possible&lt;/li&gt;\n&lt;li&gt;Always be wary of the investment industry&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  During times of extreme economic or political turbulence, risks will seem high. This will depress the prices of both stock and bonds and thus raise their future returns. Stock and bonds bought at such times generally earn the highest long-term returns; stock and bonds bought in times of calm and optimism generally earn the lowest long-term returns&lt;/li&gt;\n&lt;li&gt;  Nothing is more likely to make you poor than your own emotions&lt;/li&gt;\n&lt;li&gt;  The brain responds more to the anticipation of a reward than to the reward itself. And it responds identically to the prospect of food, sex, social contact, cocaine, or financial gain&lt;/li&gt;\n&lt;li&gt;  You brain is particularly sensitive to the pattern of stimuli.&lt;/li&gt;\n&lt;li&gt;  Nearly every time we invest, our cortex (calculating part of our brain) fights with our limbic (emotional part of our brain)&lt;/li&gt;\n&lt;li&gt;  Learn to automatically mistrust simple narrative explanations of complex economic or financial events&lt;/li&gt;\n&lt;li&gt;  Do not seek excitement in your investment portfolio. It is a quick way to end up poor. Your investments should be dull and boring&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;4 Pillars&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;  Investing in young tech companies yields low returns.&lt;/li&gt;\n&lt;li&gt;  Returns on IPO&amp;#39;s are a bad deal for everyone but the underwriters&lt;/li&gt;\n&lt;li&gt;  Necessary conditions for a bubble are\n\n&lt;ul&gt;\n&lt;li&gt;A major technological revolution or shift in financial practice&lt;/li&gt;\n&lt;li&gt;Easy credit&lt;/li&gt;\n&lt;li&gt;Amnesia of the last bubble. Usually takes a generation (30 years)&lt;/li&gt;\n&lt;li&gt;Abandonment of time-honored methods of security valuation&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Bubbles occur whenever investors simply begin buying shares simply because they have been going up&lt;/li&gt;\n&lt;li&gt;  The four most expensive words in the English language are &amp;quot;This time, it&amp;#39;s different.&amp;quot;&lt;/li&gt;\n&lt;li&gt;  Severe bear markets are usually followed by powerful bull markets&lt;/li&gt;\n&lt;li&gt;  It is human nature to be unduly influenced by the last 10-20 years. Don&amp;#39;t do this.&lt;/li&gt;\n&lt;li&gt;  When recent returns for a given asset class have been very high or low, put your faith in the longest data series you can find, not just the most recent&lt;/li&gt;\n&lt;li&gt;  Buying assets that everyone else has been running from take fortitude&lt;/li&gt;\n&lt;li&gt;  Ben Graham said there were no intrinsically &amp;quot;good&amp;quot; or &amp;quot;bad&amp;quot; stocks. At a high enough price, even the best companies were highly speculative. And at a low enough price, even the worst companies were a sound investment&lt;/li&gt;\n&lt;li&gt;  After the great depression, they were practically giving away stocks. Dividend yields were 10% and stocks were selling for less than book value&lt;/li&gt;\n&lt;li&gt;  When the inevitable crash occurs, do not panic and sell out. Simply stand pat and stay the course with your asset allocation&lt;/li&gt;\n&lt;li&gt;  Ideally, when prices of stocks fall dramatically, you should go even further and actually increase your percentage equity allocation. This requires nerves of steel&lt;/li&gt;\n&lt;li&gt;  Humans are social creatures and enjoy associating with others. It is a good thing in general but a terrible one in investing&lt;/li&gt;\n&lt;li&gt;  Overconfidence is probably the most important of financial behavior errors&lt;/li&gt;\n&lt;li&gt;  If history did repeat itself, the wealthiest investors would be librarians&lt;/li&gt;\n&lt;li&gt;  There are some pieces of data that have worth. Like housing starts or the length of the average industrial working week. The problem is that everyone knows this information too and it is already being factored into the stock and bond prices. Something that everyone knows isn&amp;#39;t worth knowing yourself.&lt;/li&gt;\n&lt;li&gt;  An investment that has become the topic of widespread conversation is likely to be overpriced. When everyone owns a particular asset class, many of those investors will be inexperienced &amp;quot;weak hands&amp;quot; who will panic and sell at the first sign of trouble\n\n&lt;ul&gt;\n&lt;li&gt;Strategy for above&lt;/li&gt;\n&lt;li&gt;Identify the era&amp;#39;s conventional wisdom and assume it is wrong\n\n&lt;ul&gt;\n&lt;li&gt;At present that is that stock returns are higher than bonds-2010&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Asset classes with the highest future returns tend to be the ones that are currently the most unpopular. This means you will get disapproval from friends and neighbors who are buying what is popular&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Don&amp;#39;t be overconfident. Do you really think you are smarter than those people on the other side of the trade? They are usually professionals with more resources than you can dream of.&lt;/li&gt;\n&lt;li&gt;  Tell yourself a couple times per year, &amp;quot;The market is smarter than I ever will be. There are millions of other investors who are much better equipped than me. If I can&amp;#39;t beat the markets, then the very best I can hope to do is join in as cheaply and efficiently as possible.&amp;quot;&lt;/li&gt;\n&lt;li&gt;  Ignore the last 10 years and don&amp;#39;t buy the hot sector/market. In reality a better strategy is to buy what has done the worst the last 10 years. Markets tend to RTM (Revision to the mean)&lt;/li&gt;\n&lt;li&gt;  The most exciting tend to have the lowest returns&lt;/li&gt;\n&lt;li&gt;  A superior portfolio strategy should be boring&lt;/li&gt;\n&lt;li&gt;  Myopic risk aversions – humans tend to focus on short term losses and is detrimental to your portfolio\n\n&lt;ul&gt;\n&lt;li&gt;Check your portfolio as infrequently as possible&lt;/li&gt;\n&lt;li&gt;Hold enough cash so you have dry powder to take advantage of low prices.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  The intelligent investor tells himself each time he takes a hit, that low prices mean higher future returns&lt;/li&gt;\n&lt;li&gt;  All apparent stock market patterns are just coincidence. There are NO patterns. Ignore them&lt;/li&gt;\n&lt;li&gt;  Avoid the herd&lt;/li&gt;\n&lt;li&gt;  Avoid overconfidence&lt;/li&gt;\n&lt;li&gt;  Don&amp;#39;t be impressed with an asset&amp;#39;s performance over the last 5 or 10 years&lt;/li&gt;\n&lt;li&gt;  Exciting investments are usually a bad deal&lt;/li&gt;\n&lt;li&gt;  Try not to worry about short term losses&lt;/li&gt;\n&lt;li&gt;  Beware of forecasts&lt;/li&gt;\n&lt;li&gt;  Focus on the whole portfolio&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Skating Where the Puck Was&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;If looking into the past revealed mean variance characteristics that stood the test of time, librarians would be the best investors&lt;/li&gt;\n&lt;li&gt;You have to move on when you get too much company, the first people to invest in an asset class get high expected returns and low correlation. Later investors get lower returns and higher correlation to a broad index&lt;/li&gt;\n&lt;li&gt;Diversification opportunities available to ordinary investors were never as good as they appeared in hindsight&lt;/li&gt;\n&lt;li&gt;Is there hope for superior returns?\n\n&lt;ul&gt;\n&lt;li&gt;Be early&lt;/li&gt;\n&lt;li&gt;Be far-sighted&lt;/li&gt;\n&lt;li&gt;Be patient&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Being early in the hardest. David Swenson of the Yale Endowment was first to the alternative strategies area and did well, then everyone copied him. His returns have sense been lower&lt;/li&gt;\n&lt;li&gt;Being far sighted is a bit easier. Resign yourself to the fact that during most bear markets, easily tradable, risk assets move up and down nearly in sync. Everyone loses money during those periods&lt;/li&gt;\n&lt;li&gt;Credit derived collapses occur about once every 9 years&lt;/li&gt;\n&lt;li&gt;When credit contracts during a crisis, investors reevaluate their risk tolerance, seek the comfort of government secured vehicles, and dump all their risky assets - ALL OF THEM&lt;/li&gt;\n&lt;li&gt;Short term crashes can be painful, but long-term returns are far more important to wealth creation and destruction&lt;/li&gt;\n&lt;li&gt;Resign yourself that diversifying among risky assets provides scant shelter from bad days or bad years, but that it does help protect against bad decades and generations. Which can be far more destructive to wealth&lt;/li&gt;\n&lt;li&gt;When everyone owns the same set of risky asset classes, the correlation among them will inevitably trend toward 1&lt;/li&gt;\n&lt;li&gt;But the inverse is true as well; when an asset class falls out of favor, its ownership transfers from weak hands into stronger and more independent minded ones, and correlations should fall along with rising future returns&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t chase returns by investing in asset classes with &amp;quot;weak hands&amp;quot;. They will bail at the first sign of trouble&lt;/li&gt;\n&lt;li&gt;It is difficult to invest in risky asset classes that are both liquid and short-term non-correlating&lt;/li&gt;\n&lt;li&gt;In the digital age, any asset class you can buy with a keystroke can and likely will bite you when things head south&lt;/li&gt;\n&lt;li&gt;The prime directive of adequate diversification can be stated as follows: Your portfolio should not look like everyone else.&lt;/li&gt;\n&lt;li&gt;When everyone owns the same portfolio, a lot of those owners, are going to have weak hands, and when the storm comes, they are going to sell their risky assets indiscriminately and send correlations higher and returns lower&lt;/li&gt;\n&lt;li&gt;Therefore, it is useful to estimate the strength of the hands of your fellow owners. You don&amp;#39;t want to be in an asset class with a bunch of weak hands that sell at the first sign of trouble. When a risky asset class becomes too popular, the fact that it is over owned by weak hands means that it will simultaneously have both low expected returns and high correlations&lt;/li&gt;\n&lt;li&gt;Even hedge fund managers have trouble with this because their customers demand payment during bad times, which forces them to sell risk assets even if they don&amp;#39;t want to&lt;/li&gt;\n&lt;li&gt;High correlations and low expected returns go together&lt;/li&gt;\n&lt;li&gt;But if an asset class is new or out of favor, it will tend to be owned by strong hands and have lower correlations and higher expected returns&lt;/li&gt;\n&lt;li&gt;JP Morgan said &amp;quot;During a bear market, stocks return to their rightful owners.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Early adopters reap the initial high returns and low correlations of a novel asset class; then one or more academic and trade journal articles will describe them. Then correlations increase and future returns decrease&lt;/li&gt;\n&lt;li&gt;Rekenthaler&amp;#39;s Rule – If the bozos know about it, it doesn&amp;#39;t work anymore&lt;/li&gt;\n&lt;li&gt;Your long-term investing results are less the result of how well you pick assets than how well you stay the course during bad periods, especially if they occur late in your career&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Rational Expectations&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Tell yourself every day &amp;quot;I cannot predict the future therefore I must diversify&amp;quot;&lt;/li&gt;\n&lt;li&gt;We all have a tendency toward recency biases. That means in the current state (2020) that bond yields will always be low and high long-term equity returns with low inflation. None of this will be permanent&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;IAA&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Experienced investors understand risk and reward are intertwined\n\n&lt;ul&gt;\n&lt;li&gt;One of the easiest ways to spot investment fraud is the promise of excessive returns with low risk&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Stock are to be held for the long term.&lt;/li&gt;\n&lt;li&gt;Individual investors are drawn into stocks during powerful bull markets\n\n&lt;ul&gt;\n&lt;li&gt;They don&amp;#39;t appreciate the risks with stocks. And after they have suffered the inevitable loss, they sell.&lt;/li&gt;\n&lt;li&gt;No investor ever avoids loses at times, no matter how skilled&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investors suffer from recency bias.\n\n&lt;ul&gt;\n&lt;li&gt;When prices fall, investors estimate of future returns goes lower too. This is irrational.&lt;/li&gt;\n&lt;li&gt;Investors tend to overweight more recent data and underweight older data&lt;/li&gt;\n&lt;li&gt;Most investors are &amp;quot;convex&amp;quot; traders in which they buy equities as they are rising and sell as they are falling.&lt;/li&gt;\n&lt;li&gt;The opposite is a &amp;quot;concave&amp;quot; investor who buys as prices fall and sells as they rise\n\n&lt;ul&gt;\n&lt;li&gt;In a world dominated by convex traders, it is an advantage to be a concave trader, and vice versa.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Human beings experience risk in the short term. This is because in nature, our ancestors had to focus on short term risks to survive.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Asset Allocation&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Generally, people believe that higher returns are possible with less volatility than is actually the case&lt;/li&gt;\n&lt;li&gt;A person who understands inflation risk, interest rate risks, credit risk, and equity risk is in a much better position to make intelligent investment decisions&lt;/li&gt;\n&lt;li&gt;You should be concerned not only about an asset class historical return but also about the dispersion of those returns and the likelihood that future returns will be higher or lower than past returns\n\n&lt;ul&gt;\n&lt;li&gt;People often anchor their return expectation to an investments long term historical return. The average return could be an unlikely result&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Most people do not think in terms of expected returns and standard deviation.\n\n&lt;ul&gt;\n&lt;li&gt;They think in terms of the chance of loss&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;A Random Walk Down Wall Street&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Sir Isaac Newton &amp;quot;I can calculate the motions of heavenly bodies, but not the madness of people.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Styles and fashions in investors evaluations of securities can and often do play a critical role in the pricing of securities. The stock market at times conforms well to the castle in the air theory, for this reason, it can be very dangerous&lt;/li&gt;\n&lt;li&gt;Do not purchase today&amp;#39;s hot new issue. Most IPO&amp;#39;s are bad for retail investors. But good for underwriters&lt;/li&gt;\n&lt;li&gt;Most bubbles have been associated with some new technology or with some new business opportunity.&lt;/li&gt;\n&lt;li&gt;Bubbles are a positive feedback loop. A bubble starts when a group of stocks begin to rise. The updraft encourages more people to buy, which causes more TV/Print coverage, which causes more people to buy, which creates big profits for early investors. The successful investors talk about how easy it is to get rich, which causes more people to buy. The whole idea is a kind of Ponzi scheme needing more and more greater fools to buy. But eventually they run out of fools and the stock plummets.&lt;/li&gt;\n&lt;li&gt;God Almighty does not know the proper P/E multiple for a common stock&lt;/li&gt;\n&lt;li&gt;The history of stock price movement contains no useful information that will enable an investor to consistently to outperform a buy and hold strategy&lt;/li&gt;\n&lt;li&gt;Behavioral Finance\n\n&lt;ul&gt;\n&lt;li&gt;Investors are generally overconfident in their ability and convinced they can beat the market. A study showed that the more a person traded, the worse they did. Males traded more than females and did worse. Over optimism in forecasting the growth of existing companies could be one reason growth stocks tend to underperform value stocks.&lt;/li&gt;\n&lt;li&gt;Biased Judgments – Investors tend to think they can control their investment results even though they can&amp;#39;t.&lt;/li&gt;\n&lt;li&gt;Herding – research shows that groups tend to make better decisions than individuals. But this can cause &amp;quot;group think&amp;quot; where individuals will reinforce one another into believing that some incorrect view is the correct one&lt;/li&gt;\n&lt;li&gt;Loss aversion – A study concluded that losses were 2 ½ times as undesirable as equivalent gain were desirable&lt;/li&gt;\n&lt;li&gt;Pride and Regret – Investors find it very difficult to admit that they have made a bad stock market decision. But are quite proud to tell of their gains. Many investors therefore will hold onto losing positions hoping it recovers.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The problem with trying to &amp;quot;trade&amp;quot; with these ideas is that the market can remain irrational longer than you can remain solvent.&lt;/li&gt;\n&lt;li&gt;What are the lessons for the individual investor on behavioral finance?\n\n&lt;ul&gt;\n&lt;li&gt;In investing, we are often our own worst enemy&lt;/li&gt;\n&lt;li&gt;Avoid herd behavior. Any investment that has become a topic of widespread conversation is likely to be especially hazardous. But the same behavior leads investors to throw in the towel when pessimism is rampant – a good time to buy&lt;/li&gt;\n&lt;li&gt;Avoid overtrading – this incurs more taxes and trading costs which decrease returns&lt;/li&gt;\n&lt;li&gt;Be wary of new issues or IPO&amp;#39;s&lt;/li&gt;\n&lt;li&gt;Stay cool to Hot Tips&lt;/li&gt;\n&lt;li&gt;Never buy anything from someone who is out of breath&lt;/li&gt;\n&lt;li&gt;Distrust foolproof schemes&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Winning the Loser&amp;#39;s Game&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Investors essential truth &amp;quot;We have met the enemy and he is us.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Behavioral Economics\n\n&lt;ul&gt;\n&lt;li&gt;We fail to appreciate the power of regression to the mean&lt;/li&gt;\n&lt;li&gt;We ignore the normal pattern of experience&lt;/li&gt;\n&lt;li&gt;We believe in &amp;quot;hot hands&amp;quot;&lt;/li&gt;\n&lt;li&gt;We overreact to first impressions and then anchor to those views&lt;/li&gt;\n&lt;li&gt;We suffer from illusion of control&lt;/li&gt;\n&lt;li&gt;We rely on expert opinions and are overconfident in those opinions&lt;/li&gt;\n&lt;li&gt;We overestimate out own skill and knowledge&lt;/li&gt;\n&lt;li&gt;We respond to the &amp;quot;halo effect&amp;quot; of a recommendation of someone we admire, like a celebrity or athlete&lt;/li&gt;\n&lt;li&gt;We are overly impressed by short term results&lt;/li&gt;\n&lt;li&gt;We are &amp;quot;confirmation biased&amp;quot; looking for and then overweighting the data that supports our conclusion&lt;/li&gt;\n&lt;li&gt;We anchor too much to our initial opinion&lt;/li&gt;\n&lt;li&gt;We confuse familiarity with knowledge and understanding&lt;/li&gt;\n&lt;li&gt;We overreact to both good and bad news&lt;/li&gt;\n&lt;li&gt;We think we know more relative to what others know than we really do&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investors risks to avoid\n\n&lt;ul&gt;\n&lt;li&gt;Trying too hard and taking too much risk&lt;/li&gt;\n&lt;li&gt;Not trying hard enough, usually by having too much cash or money market accounts&lt;/li&gt;\n&lt;li&gt;Being Impatient&lt;/li&gt;\n&lt;li&gt;Changing mutual funds too much (holding less than 10 years)&lt;/li&gt;\n&lt;li&gt;Borrowing too much&lt;/li&gt;\n&lt;li&gt;3 out of 4 fortunes that are lost got lost because borrowed money was used&lt;/li&gt;\n&lt;li&gt;Being naively optimistic&lt;/li&gt;\n&lt;li&gt;Being proud&lt;/li&gt;\n&lt;li&gt;We overestimate our own ability&lt;/li&gt;\n&lt;li&gt;Being emotional&lt;/li&gt;\n&lt;li&gt;We are happy when our stocks go up and sad when they go down. And the feelings are stronger the faster the change in prices&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;&lt;strong&gt;Irrational Exuberance&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Irrational Exuberance has occurred throughout history many times when markets have been bid up to unusually high and unsustainable levels under the influence of market psychology&lt;/li&gt;\n&lt;li&gt;Irrational exuberance is the psychological basis of a speculative bubble\n\n&lt;ul&gt;\n&lt;li&gt;Speculative bubble is a situation in which news of price increases spurs investor enthusiasm, which spreads by psychological contagion from person to person, and, in the process, amplifies stories that might justify the price increase and brings in larger and larger class of investors, who despite doubts about the real value of the investment, are drawn to it partly through envy of others success, and party through a gambler&amp;#39;s mentality.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Cyclically Adjusted Price-Earnings Ratio (CAPE 10) – real (inflation adjusted) S+P Index divided by the 10-year moving average of real earnings on the index\n\n&lt;ul&gt;\n&lt;li&gt;As a rule, and on average, years with low CAPEs have been followed by high returns, and years with high CAPEs have been followed by low or even negative returns&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Analyst are reluctant to make sell recommendations near the peak of a market for many reasons\n\n&lt;ul&gt;\n&lt;li&gt;James Grant &amp;quot;Honesty was never a profit center on Wall Street, but the brokers used to keep up appearances. Now they have stopped pretending. More than ever, securities research, as it is called, is a branch of sales. Investor, beware.&amp;quot;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Short term interest rates have been driven down to almost 0%. And with the fed offering &amp;quot;forward guidance&amp;quot; which has the effect to lower long-term yields too.\n\n&lt;ul&gt;\n&lt;li&gt;This has caused investors to be disappointed in bond yields and need to &amp;quot;reach for yield&amp;quot; for various reasons. Even though the stock market was still perceived as risky, many investors think it has real upside potential, encouraging them to purchase stocks at higher and higher multiples.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The inequality gap increased during the 1920&amp;#39;s during the bull market and peaked around the market high in 1929\n\n&lt;ul&gt;\n&lt;li&gt;The inequality gap sometimes coincides with an increase in nationalistic and xenophobic political parties&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;There is an incorrect notion in investors thinking that stocks are the &amp;quot;best investment&amp;quot; and investors cannot go wrong with them over the long run\n\n&lt;ul&gt;\n&lt;li&gt;You find a striking correlation between prices and &amp;quot;best investment&amp;quot;: generally, when prices are going up, the percentage who think stocks are the best investment go up too.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The UBS Index of Consumer Optimism reported much more optimistic average expectations among individual investors around the peak of the stock market&lt;/li&gt;\n&lt;li&gt;Speculative bubbles are feedback loops where price increases lead to further price increases through increased investor demand\n\n&lt;ul&gt;\n&lt;li&gt;Adaptive expectations – feedback takes place because past price increases generate expectations of further price increases&lt;/li&gt;\n&lt;li&gt;Price to GDP – as the value of the stock market or housing market increases, the resulting wealth effect and optimism encourage expenditures&lt;/li&gt;\n&lt;li&gt;Speculative bubbles cannot last forever and when demand stops, prices will too.&lt;/li&gt;\n&lt;li&gt;This bursting of the bubble doesn&amp;#39;t necessarily have to be sudden. It can take place over years as did the 1929-1932 crash.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Large stock market moves do not always coincide with exceptionally important news&lt;/li&gt;\n&lt;li&gt;The media actively shape public attention and categories of thought, and they create the environment in which the speculative market events we see are played out\n\n&lt;ul&gt;\n&lt;li&gt;The media can foster stronger feedback loops&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;There appears a pervasive human tendency toward overconfidence in one&amp;#39;s beliefs\n\n&lt;ul&gt;\n&lt;li&gt;People tend to think they know more than they do&lt;/li&gt;\n&lt;li&gt;People tend to make judgements in uncertain situations by looking for familiar patterns and assuming that future patterns will resemble past ones, often without sufficient consideration of the reasons for the pattern or the probability of the pattern repeating&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Even completely rational people can participate in herb behavior when they take into account the judgments of others, even if they know that everyone else is behaving in a herd-like manner&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The behavior, although individually rational, produces group behavior that is irrational&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There is ample systematic evidence that firms or markets that are &amp;quot;overpriced&amp;quot; by conventional measures have indeed tended to do poorly afterword&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Stocks tend to have a regression to the mean: what goes up a lot tends to come back down, and what goes down a lot tends to come back up&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Times of low dividend yields relative to stock prices in the stock market as a whole tend to be followed by price decreases or smaller than usual increases over long horizons.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;When one is not getting much in dividends relative to the price one pays for stocks, it is not a good time to buy stocks historically&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If long term interest rates are very low (as they are in 2020) then investors in bonds need to have some doubts as to their worthiness as alternatives to the stock market, even if the CAPE ratio is high.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Since the CAPE negatively predicts long term returns, the excess real return between stocks and bonds would be influenced negatively by both the CAPE and by the low long term interest rate.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The evidence that stocks will &lt;em&gt;ALWAYS&lt;/em&gt; out perform bonds over long term intervals simply does not exist.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The so called &amp;quot;fact&amp;quot; of superiority of stocks over bonds is not a fact at all. Stocks are residual claims on corporate cash flow, available to stockholders after everyone else has been paid. Stock are therefore, by their very definition, risky. Stocks are not guaranteed to do well&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The pubic is said to have learned that stocks always go right back up after they go down. We have seen evidence that people do think this, but they are wrong. Stock can and do go down and stay down for long periods (Decades). They can become overpriced and underperform for long periods of time&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The pubic is said to have leaned that stocks must always outperform other investments like bonds over the long run. This too is false.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The public is also said to have learned about the wisdom of investing in stocks via active mutual funds whose management teams have proven track records, and once again they are wrong.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;After the 2001 collapse, the public is said to have learned that housing is the &amp;quot;best&amp;quot; investment. They were wrong again&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The public must relearn all these &amp;quot;facts&amp;quot; again and again over time&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;At the time of this writing (2014) After the financial crisis, economies in many places are still weak. But these low interest rates may continue to support excessively high valuations in these markets. These problems will occur again in the future.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;&lt;strong&gt;Jason Zweig Your Money and Your Brain&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;  Neuroeconomics\n\n&lt;ul&gt;\n&lt;li&gt;A monetary loss or gain causes a biological change that has profound physical effects on the body&lt;/li&gt;\n&lt;li&gt;Neural activity of someone making money in investments are indistinguishable from someone high on cocaine&lt;/li&gt;\n&lt;li&gt;After 2 repetitions of a stimulus, the human brain automatically, unconsciously, and uncontrollably expects a 3 repetition&lt;/li&gt;\n&lt;li&gt;Once people conclude that an investment return is predictable, their brains respond with alarm if the pattern is broken&lt;/li&gt;\n&lt;li&gt;Financial loss is processed in the same areas where we respond to mortal danger&lt;/li&gt;\n&lt;li&gt;Anticipating a gain and actually receiving it are expressed in different areas. Helps explain why money does not buy happiness&lt;/li&gt;\n&lt;li&gt;Expecting both good and bad events is often more intense than experiencing them&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Greed\n\n&lt;ul&gt;\n&lt;li&gt;There is only one sure thing on Wall Street. And this is there are NO sure things&lt;/li&gt;\n&lt;li&gt;Lightning seldom strikes twice&lt;/li&gt;\n&lt;li&gt;Lock up your &amp;quot;Mad Money&amp;quot; and throw away the key. If you can&amp;#39;t stop yourself from gambling in the market, then limit the amount&lt;/li&gt;\n&lt;li&gt;Control your cues. Turn off CNBC&lt;/li&gt;\n&lt;li&gt;Think twice before making any decisions. Calm yourself down&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Prediction\n\n&lt;ul&gt;\n&lt;li&gt;Our incorrigible search for patterns leads us to assume that order exists where there is non&lt;/li&gt;\n&lt;li&gt;Whenever you are confronted with anything random, you WILL search for patterns in it&lt;/li&gt;\n&lt;li&gt;People hate randomness&lt;/li&gt;\n&lt;li&gt;If a reward is big enough, it will carry a long-lasting memory that is difficult to break. This is why chart analysts get into trouble because they think they &amp;quot;got it&amp;quot;&lt;/li&gt;\n&lt;li&gt;Investors have a recency bias – what has happened they think will continue to happen, even if it is unpredictable. This causes investors to think that a bull market will continue and a bear market will also. This also causes them to buy the hottest mutual funds&lt;/li&gt;\n&lt;li&gt;Control what you can in the market – don&amp;#39;t look for the next Google&lt;/li&gt;\n&lt;li&gt;Expectations – set realistic goals&lt;/li&gt;\n&lt;li&gt;Risk – ask not how much you can gain, but also how much you can lose&lt;/li&gt;\n&lt;li&gt;Readiness – think twice&lt;/li&gt;\n&lt;li&gt;Expenses – keep them low&lt;/li&gt;\n&lt;li&gt;Commissions – keep them low too&lt;/li&gt;\n&lt;li&gt;Taxes – don&amp;#39;t day trade, you get hit with short term taxes&lt;/li&gt;\n&lt;li&gt;Yourself – don&amp;#39;t try to predict&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t try to predict the market – DCA is a good strategy to prevent this&lt;/li&gt;\n&lt;li&gt;Most mutual fund managers fail to beat the market. Answer to this is to DCA into index mutual funds&lt;/li&gt;\n&lt;li&gt;Correlation is not causation&lt;/li&gt;\n&lt;li&gt;Take a break – if you take a break, it resets your &amp;quot;gamblers fallacy&amp;quot; IE – a coin is flipped 7 times and comes up heads 7 times in a row, the next flip is &amp;quot;due&amp;quot; for a tail.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t obsess – if owning stocks is a long-term project for you, then following changes constantly is a very, very bad idea.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Confidence\n\n&lt;ul&gt;\n&lt;li&gt;Create a &amp;quot;too hard&amp;quot; pile. Know what you don&amp;#39;t know.&lt;/li&gt;\n&lt;li&gt;Measure 2x cut 1x. Have an overconfidence discount of 25% so if a stock according to your valuation is worth between $40-60. Make it $30-45.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t get stuck on your own companies&amp;#39; stock&lt;/li&gt;\n&lt;li&gt;Diversification is the best defense&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Risk\n\n&lt;ul&gt;\n&lt;li&gt;Take a time out. Do not buy or sell an investment on the spur of the moment&lt;/li&gt;\n&lt;li&gt;When the price drops, so does risk.&lt;/li&gt;\n&lt;li&gt;Try to prove yourself wrong. Listen to another person&amp;#39;s opinion&lt;/li&gt;\n&lt;li&gt;Know yourself and your risk tolerance&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Surprise\n\n&lt;ul&gt;\n&lt;li&gt;If everyone knows something. It is already embedded in the price of the stock&lt;/li&gt;\n&lt;li&gt;High hopes can cause big trouble&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Regret\n\n&lt;ul&gt;\n&lt;li&gt;Expecting regret often hurts worse than experiencing it&lt;/li&gt;\n&lt;li&gt;The more you can automate your investing, the better&lt;/li&gt;\n&lt;li&gt;Face your loss.&lt;/li&gt;\n&lt;li&gt;If you have a truly diversified portfolio, then you will guarantee yourself, by definition, that some of your assets will do well while some will do badly. You have to look at the whole portfolio&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t chase hot sectors or stocks. The cure for chasing is to rebalance. Decide on a number and stick with it&lt;/li&gt;\n&lt;li&gt;Rebalancing over the long-term increases returns and lowers risks. It is buying low and selling high&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Happiness\n\n&lt;ul&gt;\n&lt;li&gt;If you earn enough cash to live on. Then more money won&amp;#39;t make you happier&lt;/li&gt;\n&lt;li&gt;Know that money is a means, not an end in itself&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Summary\n\n&lt;ul&gt;\n&lt;li&gt;Take a global view. Look at total net worth, not changes in each holding&lt;/li&gt;\n&lt;li&gt;Hope for the best but expect the worst. Diversifying can keep you from panicking during bad times which will occur&lt;/li&gt;\n&lt;li&gt;Investigate before you invest. A stock isn&amp;#39;t just a price. It is a company&lt;/li&gt;\n&lt;li&gt;Never say always. Never put more than 10% of your investments into a single stock&lt;/li&gt;\n&lt;li&gt;Know what you don&amp;#39;t know.&lt;/li&gt;\n&lt;li&gt;The past is not the prologue. What goes up must come down and what goes way up usually comes down with a crunch. Never buy an investment because it is going up. Smart investors buy low and sell high&lt;/li&gt;\n&lt;li&gt;If it sounds too good to be true, it probably is. Anyone who offers a high return at low risk is probably a fraud&lt;/li&gt;\n&lt;li&gt;Costs are killers. Trading costs eat up your profits&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t put all your eggs in one basket. Spread out between US, foreign, bonds, and cash. It is not a good idea to invest heavily in industries that your job is tied too. If you lose your job, your stock would be likely to fall also.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The Delusions of Crowds&lt;/p&gt;\n\n&lt;p&gt;4 Signs of a bubble&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Everyone around you is talking about it. And you should start worrying when people talking about getting rich in certain areas of the market don&amp;#39;t have a background in finance&lt;/li&gt;\n&lt;li&gt;When people begin to quit their jobs to speculate in the markets&lt;/li&gt;\n&lt;li&gt;When someone exhibits skepticism about the prospects and people don&amp;#39;t just disagree with them, but they do so vehemently. They usually say &amp;quot;You just don&amp;#39;t get it.&amp;quot; &amp;quot;New Era&amp;quot; &amp;quot;It is different this time&amp;quot;&lt;/li&gt;\n&lt;li&gt;When you start to see extreme predictions.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Human beings intuitively seek out outcomes with very high but very rare payoffs, such as lottery tickets, that on average lose money but tantalize their buyers with the chimera of unimaginable wealth&lt;/li&gt;\n&lt;li&gt;Researchers have found that our brains fire not only with reward, but even more intensely with its anticipation.\n\n&lt;ul&gt;\n&lt;li&gt;There is nothing so disturbing to one&amp;#39;s well-being and judgement as to see a friend get rich&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;When presented with facts and data that contradict our deeply held beliefs, we generally do not reconsider and alter those beliefs appropriately. More often, we avoid contrary facts and data, and when we cannot avoid them, our erroneous assessments will even harden and make us more likely to proselytize them.&lt;/li&gt;\n&lt;li&gt;People respond more to narratives than to facts and data. And the more compelling the story, the more it erodes our critical thinking skills&lt;/li&gt;\n&lt;li&gt;We have 2 different types of thought process\n\n&lt;ul&gt;\n&lt;li&gt;System 1 or &amp;quot;reptilian brain&amp;quot; that is fast moving emotional response&lt;/li&gt;\n&lt;li&gt;System 2 or &amp;quot;evolutionary brain&amp;quot; that is much slower conscious reasoning&lt;/li&gt;\n&lt;li&gt;Our faster emotional machinery leads, and our slower &amp;quot;reason&amp;quot; follows&lt;/li&gt;\n&lt;li&gt;In a state of nature, the advantages of system 1 are obvious (IE - hissing snake at your feet). But in a relatively safe post-industrial world where dangers have a longer time horizon, system 1 dominance often occurs at great costs&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Bank supplied leverage is the fuel that powers modern financial manias and it has brought with it a roller coaster of bubbles and busts\n\n&lt;ul&gt;\n&lt;li&gt;Over the last 4 centuries, financial innovation has yielded a dizzying variety of investment vehicles: each, in its turn, was often simply leverage in a slightly different disguise and would prove the tinder that would set alight successive waves of speculative excess&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Bubbles typically end with a seemingly small disturbance, followed by a swift collapse&lt;/li&gt;\n&lt;li&gt;Throughout history, property prices have ranged between five and twenty times annual rental values.&lt;/li&gt;\n&lt;li&gt;When investors are unhappy with ultra-low interest rates offered on safe assets, they bid up the prices of risk assets with rosier potential income.\n\n&lt;ul&gt;\n&lt;li&gt;The allure of the hypnotic new technology (early 1800&amp;#39;s railroads) was amplified, as is almost always the case with bubbles, by falling interest rates, which makes investment capital more plentiful&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Every bubble carry within it the seeds of its own destruction&lt;/li&gt;\n&lt;li&gt;When compelling narrative and objective fact collide, the former often survives.&lt;/li&gt;\n&lt;li&gt;Human beings suffer from confirmation bias, in which once they have settled on a hypothesis or belief system, pay attention only to data that supports their beliefs and avoid data that contradicts it.&lt;/li&gt;\n&lt;li&gt;Hyman Minsky thought bubbles needed 2 conditions\n\n&lt;ul&gt;\n&lt;li&gt;Easy credit via low interest rates&lt;/li&gt;\n&lt;li&gt;Advent of new technology&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investors excited about new technologies, or financial products, etc. begin to pour money into them. Since these assets can also be used as collateral for loans, rising prices mean that speculators can borrow even more to pour into these assets. A self-reinforcing cycle develops. But only on the way up&lt;/li&gt;\n&lt;li&gt;Minsky developed the &amp;quot;instability hypothesis&amp;quot; which states that in a safe and stable financial environment, money inevitably migrates away from safe borrowers and toward risky ones. Eventually, things get out of hand, resulting in a blowup, which makes lenders and investors more prudent, and the cycle begins anew. Usually about once per decade\n\n&lt;ul&gt;\n&lt;li&gt;Amnesia is implicit in the instability hypothesis. After a crisis, investors shy away from risk. As markets recover and the unpleasant memories fade, participants become more open to risk and the instability cycle begins anew.&lt;/li&gt;\n&lt;li&gt;We all like a good story; in the grip of a bubble, when faced with the unpleasant or difficult calculation, a compelling narrative provides easy escape from the effort of rigorous analysis.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Abandonment of hardheaded financial calculations in favor of compelling narratives is another factor that precipitates financial manias\n\n&lt;ul&gt;\n&lt;li&gt;Rather than attempt the nearly impossible estimation of the value of a stock with high projected future earnings (South Sea in 1720, RCA in 1928, Pets.com in 1999, or Tesla today) investors default back to the simple heuristic: &amp;quot;X is a great company and it is going to change the world, and its worth paying almost any price for it.&amp;quot;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Humans have a recency bias: If stock prices have been rising for the past several years, they will come to believe that equity levels will continue to do so forever; as prices climb, shares become more attractive, which drives up prices even more. The reverse also happens during bear markets&lt;/li&gt;\n&lt;li&gt;John Templeton &amp;quot;The four most expensive words in the English language are &amp;#39;This time it&amp;#39;s different.&amp;#39;&amp;quot;&lt;/li&gt;\n&lt;li&gt;Max Winkler observed after the 1920 crash and discovery of the Dividend Discount Model that the market discounted not only the future, but the hereafter as well&lt;/li&gt;\n&lt;li&gt;Debt can grow faster than the rest of the economy for so long before they implode\n\n&lt;ul&gt;\n&lt;li&gt;This is particularly true of private debt&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;During bubbles, people become intoxicated by the pursuit of effortless wealth&lt;/li&gt;\n&lt;li&gt;Even if we can&amp;#39;t model bubbles, we know what they look like&lt;/li&gt;\n&lt;li&gt;Minsky&amp;#39;s amnesia requirement usually reveals a generational divide during bubbles; only participants old enough to recall the last boom and bust are likely to be skeptical. Their younger and more enthusiastic colleagues will deride them as old fogies\n\n&lt;ul&gt;\n&lt;li&gt;Bubbles are the province of young people with short memories&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Market Bubbles require 4 necessary conditions\n\n&lt;ul&gt;\n&lt;li&gt;Technological and financial displacement&lt;/li&gt;\n&lt;li&gt;Credit loosening&lt;/li&gt;\n&lt;li&gt;Amnesia of the past&lt;/li&gt;\n&lt;li&gt;Abandonment of time-honored valuation principles&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Under most circumstances, the Federal Reserve cares about 2 things\n\n&lt;ul&gt;\n&lt;li&gt;Overall state of the economy (as measured by GDP growth and unemployment)&lt;/li&gt;\n&lt;li&gt;Keeping inflation under control&lt;/li&gt;\n&lt;li&gt;Stock prices are of lesser concern and often wind up a bystander of the other 2 policies&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The Fed primary operates via the federal funds rate (interest rate at which member banks lend to each other overnight)\n\n&lt;ul&gt;\n&lt;li&gt;When interest rates on these are high, they attract investors. Which pulls investment from risk assets (stocks) and lowers their prices. The opposite is true&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;We are apes who tell stories. When our remote ancestors needed to communicate with each other to survive, they did not do so with syllogisms, numerical data, or mathematics. The primary mode of that communication was and still is narration.&lt;/li&gt;\n&lt;li&gt;Humans are narrative animals, no matter how misleading the narrative, if it is compelling enough it will nearly always trump the facts, at least until those facts cause great pain.\n\n&lt;ul&gt;\n&lt;li&gt;The more compelling the narrative, the more it erodes are analytical thinking&lt;/li&gt;\n&lt;li&gt;We also mold the facts to fit our preexisting opinion&lt;/li&gt;\n&lt;li&gt;We cling to facts that fit our narrative and ignore those that disconfirm them&lt;/li&gt;\n&lt;li&gt;We intentionally avoid exposing ourselves to contrary data&lt;/li&gt;\n&lt;li&gt;A compelling narrative can spread through a population just like a virus would and can even acquire critical mass&lt;/li&gt;\n&lt;li&gt;As more and more people share the same delusion, the more likely we are to believe in it, and so the more likely those around us will do so as well, a vicious cycle ensues, gaining more and more momentum until they finally smash into the brick wall of reality.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Market History Book Summaries&lt;/p&gt;\n\n&lt;p&gt;Where are the Customers Yachts?  (Fun Book)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://old.reddit.com/r/stocks/comments/otlv6k/fred_schwed_where_are_the_customers_yachts/\"&gt;https://old.reddit.com/r/stocks/comments/otlv6k/fred_schwed_where_are_the_customers_yachts/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Devil Take the Hindmost&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://old.reddit.com/r/stocks/comments/otlokh/devil_take_the_hindmost_a_history_of_financial/\"&gt;https://old.reddit.com/r/stocks/comments/otlokh/devil_take_the_hindmost_a_history_of_financial/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://old.reddit.com/r/Bogleheads/comments/r4cb1a/devil_take_the_hindmost_a_history_of_financial/\"&gt;https://old.reddit.com/r/Bogleheads/comments/r4cb1a/devil_take_the_hindmost_a_history_of_financial/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;All my book summaries and FAQ&amp;#39;s I have done&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/user/captmorgan50/comments/rnftyk/book_summaries/\"&gt;https://www.reddit.com/user/captmorgan50/comments/rnftyk/book_summaries/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "cc31739e-6c0e-11ec-a019-9eae049f0f7d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ff4500",
  "id": "tou79c",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "captmorgan50",
  "discussion_type": null,
  "num_comments": 2,
  "send_replies": false,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/tou79c/psychology_and_market_history/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/tou79c/psychology_and_market_history/",
  "subreddit_subscribers": 150579,
  "created_utc": 1648344205,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1648310095,
  "the_new_excerpt": "All About Asset Allocation\n\n * Realistic expectations are important to investment planning\n * Market volatility is more predictable than market return\n * Investments with expected positive investment return and higher volatility\n   have higher expected return\n * All investments have risk. Even T…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アセットアロケーションのすべて\n\n * 投資計画には現実的な期待が重要\n * 市場のボラティリティは、市場のリターンよりも予測しやすい。\n * 期待運用収益がプラスでボラティリティが高い投資先\n   期待収益率が高い\n * すべての投資にはリスクがある たとえト...",
      "title": "心理学と市場の歴史"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于资产配置的一切\n\n *现实的期望对投资规划很重要\n * 市场波动比市场回报更可预测\n * 具有预期正投资回报和较高波动性的投资\n   有更高的预期收益\n * 所有投资都有风险。即使是T...",
      "title": "心理学和市场历史"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於資產配置的一切\n\n *現實的期望對投資規劃很重要\n * 市場波動比市場回報更可預測\n * 具有預期正投資回報和較高波動性的投資\n   有更高的預期收益\n * 所有投資都有風險。即使是T...",
      "title": "心理學和市場歷史"
    }
  ]
}