{
  "author": "Trevigol",
  "original_created_utc": 1645037016,
  "title": "No, Canada didn't block any Bitcoin wallet simply because it's impossible",
  "created_utc": 1645075940,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m seeing to many people sharing the news that Canadian government blocked 40 Bitcoin wallets because they&amp;#39;re related to the convoy protest.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s really happened is that the government told every exchange in Canada to block any deposit coming from those 40 wallets. That&amp;#39;s totally different than blocking a wallet.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin is free and always will be.&lt;/p&gt;\n\n&lt;p&gt;Nobody can stop those people to use their BTC how they want. They can pay anyone they want and no government can block a transaction in the blockchain. What they can&amp;#39;t do is to send btc to a Canadian exchange and to convert it to fiat. &lt;/p&gt;\n\n&lt;p&gt;I think most people forgot that Bitcoin was created in order to be an international currency free from any government control, and nothing changed. If people use btc just to make a profit and then convert it to fiat, that&amp;#39;s not Satoshi&amp;#39;s fault and not his original idea. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t sympathize with the convoy protest, I don&amp;#39;t really care about it, I just don&amp;#39;t like the idea that governments can control or block anyone&amp;#39;s money. &lt;/p&gt;\n\n&lt;p&gt;If everyone would start accepting payments on btc (or any other crypto) no government could block or control the economy.&lt;/p&gt;\n\n&lt;p&gt;By the way, any exchange not located in Canada could easily accept those btc because they&amp;#39;re not under Canadian jurisdiction. I&amp;#39;m sure Gate, Coinex, Kucoin and similar have no problems about it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/su32l5/no_canada_didnt_block_any_bitcoin_wallet_simply/",
  "subreddit": "CryptoCurrency",
  "id": "su32l5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm seeing to many people sharing the news that Canadian government blocked 40\nBitcoin wallets because they're related to the convoy protest.\n\nWhat's really happened is that the government told every exchange in Canada to\nblock any deposit coming from those 40 wallets. That's totally different…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カナダ政府が40の国・地域を封鎖したというニュースを多くの人が見ています。\nビットコインのウォレットは、護送船団の抗議行動に関連しているという理由です。\n\n実際に起こったことは、政府がカナダのすべての取引所に、以下のように伝えたということです。\nその40のウォレットからの預金をすべてブロックします。それは全く違う...",
      "title": "いいえ、カナダは、それが不可能であるため、単に任意のビットコインの財布をブロックしていない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人在分享加拿大政府封锁了40个比特币钱包的消息。\n比特币钱包，因为他们与车队的抗议有关。\n\n真正发生的情况是，政府告诉加拿大的每一个交易所要\n阻止来自这40个钱包的任何存款。这完全不同...",
      "title": "不，加拿大没有封锁任何比特币钱包，只是因为这是不可能的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人在分享加拿大政府封鎖了40個比特幣錢包的消息。\n比特幣錢包，因爲他們與車隊的抗議有關。\n\n真正發生的情況是，政府告訴加拿大的每一個交易所要\n阻止來自這40個錢包的任何存款。這完全不同...",
      "title": "不，加拿大沒有封鎖任何比特幣錢包，只是因爲這是不可能的。"
    }
  ]
}