{
  "author": "Trevigol",
  "original_created_utc": 1645037016,
  "title": "No, Canada didn't block any Bitcoin wallet simply because it's impossible",
  "created_utc": 1645075940,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m seeing to many people sharing the news that Canadian government blocked 40 Bitcoin wallets because they&amp;#39;re related to the convoy protest.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s really happened is that the government told every exchange in Canada to block any deposit coming from those 40 wallets. That&amp;#39;s totally different than blocking a wallet.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin is free and always will be.&lt;/p&gt;\n\n&lt;p&gt;Nobody can stop those people to use their BTC how they want. They can pay anyone they want and no government can block a transaction in the blockchain. What they can&amp;#39;t do is to send btc to a Canadian exchange and to convert it to fiat. &lt;/p&gt;\n\n&lt;p&gt;I think most people forgot that Bitcoin was created in order to be an international currency free from any government control, and nothing changed. If people use btc just to make a profit and then convert it to fiat, that&amp;#39;s not Satoshi&amp;#39;s fault and not his original idea. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t sympathize with the convoy protest, I don&amp;#39;t really care about it, I just don&amp;#39;t like the idea that governments can control or block anyone&amp;#39;s money. &lt;/p&gt;\n\n&lt;p&gt;If everyone would start accepting payments on btc (or any other crypto) no government could block or control the economy.&lt;/p&gt;\n\n&lt;p&gt;By the way, any exchange not located in Canada could easily accept those btc because they&amp;#39;re not under Canadian jurisdiction. I&amp;#39;m sure Gate, Coinex, Kucoin and similar have no problems about it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/su32l5/no_canada_didnt_block_any_bitcoin_wallet_simply/",
  "subreddit": "CryptoCurrency",
  "id": "su32l5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm seeing to many people sharing the news that Canadian government blocked 40\nBitcoin wallets because they're related to the convoy protest.\n\nWhat's really happened is that the government told every exchange in Canada to\nblock any deposit coming from those 40 wallets. That's totally different…"
}