{
  "author": "SpecificAd3444",
  "original_created_utc": 1634876177,
  "title": "Low-cost brain computer interface for everyday use - Open Source",
  "created_utc": 1634894979,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I spent 2 years, but finally paper with explanation was published.</p>\n\n<p>Here we describe a compact, low-cost EEG device suitable for daily use. The data are transferred from the device to a personal server using the TCP-IP protocol, allowing for wireless operation and a decent range of motion for the user. The device is compact, having a circular shape with a radius of only 25 mm, which would allow for comfortable daily use during both daytime and nighttime. Our solution is also very cost effective, approximately $350 for 24 electrodes. The built-in noise suppression capability improves the accuracy of recordings with a peak input noise below 0.35 μV. Here, we provide the results of the tests for the developed device. On our GitHub page, we provide detailed specification of the steps involved in building this EEG device which should be helpful to readers designing similar devices for their needs https:// github. com/ Ildar on/ ironb ci<br/>\n<em>(PDF) Low-cost brain computer interface for everyday use</em>. Available from: <a href=\"https://www.researchgate.net/publication/354935534_Low-cost_brain_computer_interface_for_everyday_use\">https://www.researchgate.net/publication/354935534_Low-cost_brain_computer_interface_for_everyday_use</a> [accessed Oct 22 2021].</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qd92mz/lowcost_brain_computer_interface_for_everyday_use/",
  "subreddit": "SideProject",
  "id": "qd92mz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I spent 2 years, but finally paper with explanation was published.\n\nHere we describe a compact, low-cost EEG device suitable for daily use. The data\nare transferred from the device to a personal server using the TCP-IP protocol,\nallowing for wireless operation and a decent range of motion for the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2年の歳月をかけて、ようやく解説付きの論文が発表されました。\n\nここでは、日常的に使用できるコンパクトで低価格な脳波計について述べる。データは\nデータはTCP-IPプロトコルを使って装置から個人のサーバーに転送される。\nこれにより、無線での操作が可能となり、また、装置の可動範囲も十分に確保されています。",
      "title": "日常的に使える低コストのブレインコンピュータインターフェース - Open Source"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我花了两年时间，但最终发表了带有解释的论文。\n\n这里我们描述了一种适合日常使用的紧凑、低成本的脑电图设备。这些数据\n使用TCP-IP协议从该设备传输到个人服务器。\n允许无线操作和适当的运动范围。",
      "title": "日常使用的低成本脑计算机接口 - 开放源代码"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我花了兩年時間，但最終發表了帶有解釋的論文。\n\n這裏我們描述了一種適合日常使用的緊湊、低成本的腦電圖設備。這些數據\n使用TCP-IP協議從該設備傳輸到個人服務器。\n允許無線操作和適當的運動範圍。",
      "title": "日常使用的低成本腦計算機接口 - 開放源代碼"
    }
  ]
}