{
  "author": "crrpit",
  "original_created_utc": 1644336779,
  "title": "META: In September 2020, AskHistorians hosted its first conference, hoping to bring scholarly conversations to the public like never before. Today, a peer-reviewed article about the conference has been published in ‘History’ – and it’s available to read now for free!",
  "created_utc": 1644346800,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As most of us remember all too well, the spring of 2020 was a difficult time, as we dealt simultaneously with the impact of a new and deadly disease upon ourselves and loved ones, as well as the sudden shock of having to live most of our lives in virtual environments.&lt;/p&gt;\n\n&lt;p&gt;Historians, like most other people, cancelled their planned gatherings in 2020, or shifted them online as best they could as we all hurriedly got to grips with Zoom and other online meeting platforms, and loudly wished for the return of business as usual. Yet for those of us involved in helping run AskHistorians, the moment seemed opportune to make the case for the advantages of digital platforms. The whole project, after all, is predicated on the notion that high-quality history has an audience beyond academia. As such, we set out to organise a conference that broke the mould, not just in terms of format, but also in terms of who gets to attend and participate.&lt;/p&gt;\n\n&lt;p&gt;With the generous support of you all, we’ve since hosted &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/qcod0w/megathread_day_three_final_day_of_the/\"&gt;two&lt;/a&gt; &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/iugiah/megathread_its_the_final_day_of_the_askhistorians/\"&gt;digital&lt;/a&gt; conferences, and you can still &lt;a href=\"https://www.youtube.com/c/AskHistoriansPod\"&gt;watch the talks&lt;/a&gt; and read the AMAs from the amazing scholars who joined us. But we also wanted to share our intentions and lessons with other historians, and help shape what history conferences will look like in a post-pandemic world. As such, in late 2020, three of us (myself, &lt;a href=\"https://www.reddit.com/user/Historiagrephour\"&gt;u/Historiagrephour&lt;/a&gt; and &lt;a href=\"https://www.reddit.com/user/Soviet_Ghosts\"&gt;u/Soviet_Ghosts&lt;/a&gt;) pitched an article to a special issue of &lt;em&gt;History&lt;/em&gt; on digital public history. Over the course of 2021, we received peer reviews, made revisions, and waited. And, at last, our article ‘Out of the Ivory Tower, into the Digital World? Democratising Scholarly Exchange’ has now been published and is available here:&lt;/p&gt;\n\n&lt;h1&gt;&lt;a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/1468-229X.13259\"&gt;https://onlinelibrary.wiley.com/doi/full/10.1111/1468-229X.13259&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;Due to an agreement with my own employer, the University of Sheffield, the article is completely open access, and can be viewed for free in perpetuity. We are very grateful for this, as breaking down barriers to knowledge was such an important part of our motivation to begin with, and we’re very excited that everyone here will be able to read it.&lt;/p&gt;\n\n&lt;p&gt;We’re all immensely proud to have been part of the AskHistorians Digital Conferences, and to be able to represent this community in a journal such as &lt;em&gt;History&lt;/em&gt;. We hope you enjoy the read!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/snnwed/meta_in_september_2020_askhistorians_hosted_its/",
  "subreddit": "AskHistorians",
  "id": "snnwed",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As most of us remember all too well, the spring of 2020 was a difficult time, as\nwe dealt simultaneously with the impact of a new and deadly disease upon\nourselves and loved ones, as well as the sudden shock of having to live most of\nour lives in virtual environments.\n\nHistorians, like most other…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2020年の春は、多くの人がよく覚えているように、大変な時期でした。\n私たちは、新しい致命的な病気の影響に同時に対処しています。\n自分自身や大切な人のために、また、ほとんどの時間を生きなければならないという突然のショック。\nバーチャル環境での生活\n\n歴史家は、他の多くの人々と同様に...",
      "title": "META：2020年9月、AskHistoriansは、これまでにないほど学術的な会話を一般の人々に提供したいと考え、最初のカンファレンスを開催しました。本日、このカンファレンスに関する査読付き論文が『History』に掲載されました！ しかも、今なら無料で読むことができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们大多数人都记得很清楚，2020年的春天是一个困难时期，因为\n我们同时要处理一种新的致命疾病对我们自己和所爱的人的影响。\n我们同时要处理一种新的致命疾病对我们自己和所爱的人的影响，以及不得不在虚拟环境中生活的大部分时间的突然冲击。\n我们不得不在虚拟环境中生活的突然冲击。\n\n历史学家，像大多数其他...",
      "title": "META: 2020年9月，AskHistorians举办了第一次会议，希望以前所未有的方式将学术对话带给公众。今天，一篇关于这次会议的同行评议文章已经发表在《历史》杂志上--而且现在可以免费阅读!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們大多數人都記得很清楚，2020年的春天是一個困難時期，因爲\n我們同時要處理一種新的致命疾病對我們自己和所愛的人的影響。\n我們同時要處理一種新的致命疾病對我們自己和所愛的人的影響，以及不得不在虛擬環境中生活的大部分時間的突然衝擊。\n我們不得不在虛擬環境中生活的突然衝擊。\n\n歷史學家，像大多數其他...",
      "title": "META: 2020年9月，AskHistorians舉辦了第一次會議，希望以前所未有的方式將學術對話帶給公衆。今天，一篇關於這次會議的同行評議文章已經發表在《歷史》雜誌上--而且現在可以免費閱讀!"
    }
  ]
}