{
  "author": "Mandrake_m2",
  "original_created_utc": 1635522513,
  "title": "MATIC broke the $2 barrier with 95% of HODLers in profit now and plans on achieving new ATH. MATIC supporters unite!",
  "created_utc": 1635546668,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is some very bullish news especially considering that less than a month ago MATIC was $1. Literally doubled in price in less than a month and it’s not stopping here.</p>\n\n<p>MATIC has been recently in a growth pattern independent from that if the bull run. Sure the bull run definitely boosted MATIC’s price but it wasn’t the main reason for that increase. MATIC has been working on collaborations recently with some very high profile projects the likes of Coinbase and as we’re seeing its all paying off now.</p>\n\n<p>Being a MATIC enthusiast, I’m also very glad to see so much support for MATIC especially on this subreddit. HODL guys!!!</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/qifsth/matic_broke_the_2_barrier_with_95_of_hodlers_in/",
  "subreddit": "CryptoCurrency",
  "id": "qifsth",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is some very bullish news especially considering that less than a month ago\nMATIC was $1. Literally doubled in price in less than a month and it’s not\nstopping here.\n\nMATIC has been recently in a growth pattern independent from that if the bull\nrun. Sure the bull run definitely boosted MATIC’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1ヶ月前にMATICが1ドルだったことを考えると、これは非常に強気なニュースです。\n文字通り1ヶ月以内に価格が2倍になり、その勢いはとどまるところを知りません。\nここで止まらない。\n\nMATICは最近、ブルランの場合とは独立した成長パターンをとっている。\nとは無関係です。確かにブルランはMATICの...",
      "title": "MATICは2ドルの壁を破り、現在HODLerの95%が利益を得ており、新たなATHの達成を予定しています。MATICサポーターズユナイト!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一些非常看涨的消息，特别是考虑到不到一个月前\n在不到一个月的时间里，MATIC的价格翻了一番，而且还没有停止。\n在这里停止了。\n\nMATIC最近一直处于独立于牛市的增长模式中。\n运行。当然，牛市运行肯定推动了MATIC的发展。",
      "title": "MATIC打破了2美元的障碍，95%的HODLers现在都在盈利，并计划实现新的ATH。MATIC的支持者们团结起来!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一些非常看漲的消息，特別是考慮到不到一個月前\n在不到一個月的時間裏，MATIC的價格翻了一番，而且還沒有停止。\n在這裏停止了。\n\nMATIC最近一直處於獨立於牛市的增長模式中。\n運行。當然，牛市運行肯定推動了MATIC的發展。",
      "title": "MATIC打破了2美元的障礙，95%的HODLers現在都在盈利，並計劃實現新的ATH。MATIC的支持者們團結起來!"
    }
  ]
}