{
  "author": "Ayn_Otori",
  "original_created_utc": 1626554631,
  "title": "I am genuinely hesitant about getting the vaccine. Can we discuss?",
  "created_utc": 1626583309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am not an anti vaccer. I am not against the old way of vaccinating. I am worried about the fact that this is a new/experimental vaccine that uses RNA this time. It&#39;s new and we can&#39;t be sure about the long term effects. We were wrong before about certain medicines being safe. I&#39;m just scared that in 5 or ten years, people who have the vaccine become infertile or worse. Please don&#39;t call me crazy or a anti vaccer. I&#39;m just.. apprehensive. Can we discuss?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/omccs1/i_am_genuinely_hesitant_about_getting_the_vaccine/",
  "subreddit": "TooAfraidToAsk",
  "id": "omccs1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am not an anti vaccer. I am not against the old way of vaccinating. I am\nworried about the fact that this is a new/experimental vaccine that uses RNA\nthis time. It's new and we can't be sure about the long term effects. We were\nwrong before about certain medicines being safe. I'm just scared that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアンチヴァカンス派ではありません。昔のワクチン接種のやり方に反対しているわけではありません。私は\n今回はRNAを使った新しい、実験的なワクチンであることが心配です。\n今回のワクチンは 新しいものなので、長期的な影響については確信が持てません。私たちは以前\n以前、ある種の薬が安全であるということについて間違っていました。怖いのは...",
      "title": "ワクチンを接種することに純粋に躊躇しています。相談できますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是一个反疫苗的人。我并不反对老式的疫苗接种方式。我所担心的是\n我担心的是，这是一种新的/实验性的疫苗，使用RNA\n这一次。它是新的，我们不能确定其长期影响。我们是\n我们以前对某些药物是否安全的看法是错误的。我只是害怕...",
      "title": "我真的对接种疫苗感到犹豫不决。我们可以讨论一下吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是一個反疫苗的人。我並不反對老式的疫苗接種方式。我所擔心的是\n我擔心的是，這是一種新的/實驗性的疫苗，使用RNA\n這一次。它是新的，我們不能確定其長期影響。我們是\n我們以前對某些藥物是否安全的看法是錯誤的。我只是害怕...",
      "title": "我真的對接種疫苗感到猶豫不決。我們可以討論一下嗎？"
    }
  ]
}