{
  "author": "tfren99",
  "the_new_excerpt": "I wasn't around for the creation of the internet or the \"dot com bubble\", but\nI've spoken to enough people that were to know that when the world wide web was\nfirst introduced, it wasn't adopted overnight. People were skeptical,\nindifferent, they laughed at the idea of it... A lot of the same…",
  "original_created_utc": 1622556327,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はインターネットの誕生や「ドットコム・バブル」の頃にはいませんでした。\nしかし、インターネットが初めて導入されたとき、それが一夜にして採用されたわけではなかったことを、当時の人々と十分に話したことがあります。\nしかし、インターネットが初めて導入されたとき、一夜にして採用されたわけではありませんでした。人々は懐疑的でした。\n懐疑的だったり、無関心だったり、そのアイデアを笑っていたり......。多くの人が同じように...",
      "title": "30年前は、ほとんどの人がインターネットに懐疑的でした。しかし今では、インターネットによって革命が起きていない社会の部分はないと言っても過言ではありません。それと同じことが、暗号・ブロックチェーンにも起こるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不在互联网或 \"网络泡沫 \"的创建时期，但是\n我已经和足够多的人谈过，知道当世界范围内的网络被首次引入时，它并不是在一夜之间被采用的。\n联网的时候，它并不是在一夜之间被采用的。人们持怀疑态度。\n漠不关心，他们对它的想法嗤之以鼻...... 很多同样的...",
      "title": "30年前，大多数人对互联网持怀疑态度。今天，社会中没有一个部分没有被它彻底改变。同样的事情也会发生在加密货币/区块链上，这只是一个时间问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不在互聯網或 \"網絡泡沫 \"的創建時期，但是\n我已經和足夠多的人談過，知道當世界範圍內的網絡被首次引入時，它並不是在一夜之間被採用的。\n聯網的時候，它並不是在一夜之間被採用的。人們持懷疑態度。\n漠不關心，他們對它的想法嗤之以鼻...... 很多同樣的...",
      "title": "30年前，大多數人對互聯網持懷疑態度。今天，社會中沒有一個部分沒有被它徹底改變。同樣的事情也會發生在加密貨幣/區塊鏈上，這只是一個時間問題。"
    }
  ],
  "title": "30 years ago most people were skeptical of the internet. Today, there isn't a part of society that hasn't been revolutionized by it. The same thing will happen will crypto/blockchain, it's only a matter of time.",
  "created_utc": 1622637704,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wasn&#39;t around for the creation of the internet or the &quot;dot com bubble&quot;, but I&#39;ve spoken to enough people that were to know that when the world wide web was first introduced, it wasn&#39;t adopted overnight. People were skeptical, indifferent, they laughed at the idea of it... A lot of the same reactions we see towards crypto/blockchain today.</p>\n\n<p>Nowadays, the internet has completely changed the way our society works. Every aspect of our lives depends on the internet in one way or another. Needless to say, the web has come a long way from it&#39;s 1990s existence, and it continues to evolve in ways people back then would have never imagined.</p>\n\n<p>The same thing will be true of crypto and blockchain technology. This space is so new and full of untapped potential. The use cases that already exist are just the beginning. 30 years from now crypto and blockchain will have changed our society for the better, just like the internet did.</p>\n\n<p><strong>It&#39;s a matter of when, not if.</strong></p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/CryptoCurrency/comments/nput35/30_years_ago_most_people_were_skeptical_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "nput35",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297938
}