{
  "author": "Maetness",
  "original_created_utc": 1644842966,
  "title": "I just read Marc Aurelius' Meditations. What other significant works exist that give such a personal insight into the life and thoughts of historical figures?",
  "created_utc": 1644851773,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if this is not allowed. I realize it&amp;#39;s not the usual format of &amp;quot;I am x around year y ... &amp;quot; I&amp;#39;m sorry if I broke any rules. &lt;/p&gt;\n\n&lt;p&gt;So as the title says I just finished the meditations and I&amp;#39;m in absolute awe .. it was like a window into the past and it just made the person and age so real for me ... Like I could stretch out and touch something long gone from this world. &lt;/p&gt;\n\n&lt;p&gt;Are there any other works that are similar in the sense that they are written in a personal style? &lt;/p&gt;\n\n&lt;p&gt;Thank you :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 146,
  "permalink": "/r/AskHistorians/comments/ss9u4z/i_just_read_marc_aurelius_meditations_what_other/",
  "subreddit": "AskHistorians",
  "id": "ss9u4z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sorry if this is not allowed. I realize it's not the usual format of \"I am x\naround year y ... \" I'm sorry if I broke any rules.\n\nSo as the title says I just finished the meditations and I'm in absolute awe ..\nit was like a window into the past and it just made the person and age so real\nfor me ...…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "禁止事項だったらごめんなさい。通常の「私は××です」という形式ではないことは承知しています。\n年頃 \" ルール違反があったらごめんなさい。\n\nタイトルにあるように、私はちょうど瞑想を終えて、絶対的な畏敬の念を抱いています...。\n過去への窓のようで、人物や年齢がリアルに伝わってきました。\n私にとっての............。",
      "title": "マルク・アウレリウスの「瞑想録」を読んだところです。歴史上の人物の人生や思想をこれほどまでに個人的に洞察した重要な著作が他にあるだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这是不允许的，请原谅。我知道这不是通常的格式，即 \"我是X\n年左右...... \"如果我违反了任何规则，我很抱歉。\n\n正如标题所说，我刚刚完成了冥想，我感到非常敬畏。\n它就像一扇通往过去的窗户，它使人和年龄变得如此真实。\n对我来说......",
      "title": "我刚刚读了马克-奥勒留的《沉思录》。还有什么重要的作品能让人对历史人物的生活和思想有如此深入的了解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這是不允許的，請原諒。我知道這不是通常的格式，即 \"我是X\n年左右...... \"如果我違反了任何規則，我很抱歉。\n\n正如標題所說，我剛剛完成了冥想，我感到非常敬畏。\n它就像一扇通往過去的窗戶，它使人和年齡變得如此真實。\n對我來說......",
      "title": "我剛剛讀了馬克-奧勒留的《沉思錄》。還有什麼重要的作品能讓人對歷史人物的生活和思想有如此深入的瞭解？"
    }
  ]
}