{
  "author": "melanchohol",
  "original_created_utc": 1636453048,
  "title": "If you're in it for the memes and laughs, don't buy memecoins. Buy Bitcoin for $69,420.",
  "created_utc": 1636471854,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before you downvote me for asking you to buy at ATH, let me tell you that I think BTC nowhere out of gas this bull run.</p>\n\n<p>This is a perfect win imo. In five years, you&#39;ll be telling your friends how cheap you bought BTC for. Then you&#39;ll follow it up with the actual price - 69,420. Absolute gigachad move. </p>\n\n<p>Not financial advice. Do this only if you have money you can totally afford to lose, and if you can&#39;t HODL, do it with a stop-loss. </p>\n\n<p>If anything, shifting your DCA dates a bit to match $69,420 would be the smartest move. Good luck!</p>\n</div><!-- SC_ON -->",
  "score": 300,
  "permalink": "/r/CryptoCurrency/comments/qq0oeb/if_youre_in_it_for_the_memes_and_laughs_dont_buy/",
  "subreddit": "CryptoCurrency",
  "id": "qq0oeb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Before you downvote me for asking you to buy at ATH, let me tell you that I\nthink BTC nowhere out of gas this bull run.\n\nThis is a perfect win imo. In five years, you'll be telling your friends how\ncheap you bought BTC for. Then you'll follow it up with the actual price -\n69,420. Absolute gigachad…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ATHで買えというのはおかしいとお叱りを受ける前に言っておきますが、私は\nBTCは今回のブルランでガス欠になったと思う。\n\nこれは完璧な勝利だと思います。5年後、あなたは友人にいかに安くBTCを買ったかを話すことになるでしょう。\n5年後、あなたは友人にBTCをどれだけ安く買ったかを話しているでしょう。そして、実際の価格でそれをフォローするでしょう。\n69,420. 絶対的なギガチャド...。",
      "title": "ミームや笑いが目的なら、memecoinは買わない方がいい。ビットコインを69,420円で買いましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你因为我要求你在ATH买入而给我降权之前，让我告诉你，我\n我认为BTC在这一轮牛市中无处可去。\n\n这是一个完美的胜利，我想。五年后，你会告诉你的朋友你买的BTC有多便宜。\n你买BTC有多便宜。然后你会用实际价格来跟进--69,420。\n69,420. 绝对是个好主意......",
      "title": "如果你是为了回忆和笑料，不要买memeco币。用69,420美元购买比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你因爲我要求你在ATH買入而給我降權之前，讓我告訴你，我\n我認爲BTC在這一輪牛市中無處可去。\n\n這是一個完美的勝利，我想。五年後，你會告訴你的朋友你買的BTC有多便宜。\n你買BTC有多便宜。然後你會用實際價格來跟進--69,420。\n69,420. 絕對是個好主意......",
      "title": "如果你是爲了回憶和笑料，不要買memeco幣。用69,420美元購買比特幣。"
    }
  ]
}