{
  "author": "Frigorifico",
  "original_created_utc": 1626098808,
  "title": "Sometimes when I read about aztec people they have names like Netzahualcoyotl or Cuautemoc, but other times they have names with numbers in it like 2 Rabbit or 15 Water, why?",
  "created_utc": 1626109882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve heard that sometimes people had the name of the day they were born, for example 15 Water would have been born in the 15th day of the month called Water</p>\n\n<p>But then why did some people have names based on the calendar and others didn&#39;t?</p>\n\n<p>Today in Mexico there are many people with aztec names like Xochitl, Tonatihu, Atzin... but no one uses those calendar names</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/oiryai/sometimes_when_i_read_about_aztec_people_they/",
  "subreddit": "AskHistorians",
  "id": "oiryai",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've heard that sometimes people had the name of the day they were born, for\nexample 15 Water would have been born in the 15th day of the month called Water\n\nBut then why did some people have names based on the calendar and others didn't?\n\nToday in Mexico there are many people with aztec names like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時には生まれた日の名前を持つ人もいると聞いたことがあります。\n例えば、15歳の水は、水という月の15日に生まれたことになる。\n\nしかし、なぜ暦に基づいた名前を持つ人と持たない人がいたのでしょうか？\n\n現在のメキシコには、アステカ人の名前を持つ人がたくさんいます...。",
      "title": "アステカの人々についての本を読むと、NetzahualcoyotlやCuautemocのような名前を持つことがありますが、2 Rabbitや15 Waterのように数字が入った名前を持つこともありますが、なぜでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听说有时人们会用他们出生那天的名字来命名，例如\n例如，15岁的Water就出生在名为Water的月份的第15天。\n\n但是，为什么有些人的名字是基于日历的，而有些人却没有？\n\n今天在墨西哥，有很多人都有阿兹特克人的名字，如...",
      "title": "有时，当我读到关于阿兹特克人的资料时，他们的名字是Netzahualcoyotl或Cuautemoc，但其他时候他们的名字中却有数字，如2 Rabbit或15 Water，为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽說有時人們會用他們出生那天的名字來命名，例如\n例如，15歲的Water就出生在名爲Water的月份的第15天。\n\n但是，爲什麼有些人的名字是基於日曆的，而有些人卻沒有？\n\n今天在墨西哥，有很多人都有阿茲特克人的名字，如...",
      "title": "有時，當我讀到關於阿茲特克人的資料時，他們的名字是Netzahualcoyotl或Cuautemoc，但其他時候他們的名字中卻有數字，如2 Rabbit或15 Water，爲什麼？"
    }
  ]
}