{
  "author": "yann848",
  "original_created_utc": 1632244304,
  "title": "Rant : can we just shut the f**k up when the market is down ?",
  "created_utc": 1632252670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sub becomes &quot;unbearable&quot; when the market is down and it&#39;s the same thing every fucking time. Here is a summary of 99% of what people post : </p>\n\n<p>People whining about losses and freaking out</p>\n\n<p>People asking to stop whining about losses and freaking out</p>\n\n<p>People pretending that they knew the market will go down</p>\n\n<p>People giving the same health advices every damn time</p>\n\n<p>Hodl type posts</p>\n\n<p>People reminding us how hard it is to recover after 10% losses (thanks)</p>\n\n<p>People giving the same statements that we already know</p>\n\n<p>People giving friendly reminder about pretty much everything we already know</p>\n\n<p>And the deeper it goes, the worst it becomes.</p>\n\n<p>Can we just pretend it&#39;s normal for a cycle to go up and down and talk about something else ?</p>\n\n<p>Thank you.</p>\n\n<p>Edit : by posting this, I don&#39;t expect people to shut up, don&#39;t be dumb. All I&#39;m trying to make you aware of is that we need to post better content and not repetitive shit. Y&#39;all need to shill the fuck up and learn to read before hurrying up to your keyboard and comment.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/CryptoCurrency/comments/psn7wp/rant_can_we_just_shut_the_fk_up_when_the_market/",
  "subreddit": "CryptoCurrency",
  "id": "psn7wp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This sub becomes \"unbearable\" when the market is down and it's the same thing\nevery fucking time. Here is a summary of 99% of what people post :\n\nPeople whining about losses and freaking out\n\nPeople asking to stop whining about losses and freaking out\n\nPeople pretending that they knew the market…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブは相場が下がると「耐えられない」となり、同じことの繰り返しです。\n毎回同じことを繰り返しています。人々が投稿する内容の99％を要約すると次のようになります。\n\n損失について泣き言を言っている人、パニックになっている人\n\n損失について泣き言を言うのはやめてくれと言っている人、パニックになっている人\n\n市場を知っているふりをしている人...",
      "title": "Rant : 相場が下がっているときは、黙っていてもいいのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当市场下跌时，这个子变得 \"难以忍受\"，而且是同样的事情\n每一次都他妈是这样。以下是人们发布的99%的内容的摘要。\n\n人们在抱怨损失和惊慌失措\n\n人们要求停止对损失的抱怨和惊慌失措\n\n人们假装他们了解市场...",
      "title": "咆哮：我们能不能在市场下跌时闭上嘴巴？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當市場下跌時，這個子變得 \"難以忍受\"，而且是同樣的事情\n每一次都他媽是這樣。以下是人們發佈的99%的內容的摘要。\n\n人們在抱怨損失和驚慌失措\n\n人們要求停止對損失的抱怨和驚慌失措\n\n人們假裝他們瞭解市場...",
      "title": "咆哮：我們能不能在市場下跌時閉上嘴巴？"
    }
  ]
}