{
  "author": "jesperbj",
  "the_new_excerpt": "Xiaomi (HK: 1810) is a mere 11 years old and didn't go public until 2018 - the\nsame year they turned profitable, yet the are a well known brand and already\nthird in global smartphone sales.\n\nA few days ago the company delivered a pretty wicked earnings…",
  "original_created_utc": 1622293363,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シャオミ（香港：1810）はわずか11年の会社で、上場したのは2018年、つまり黒字化した年でした。\nしかし、Xiaomiはよく知られたブランドであり、すでに世界のスマートフォン販売台数で3位になっています。\n世界のスマートフォン販売台数で3位となっています。\n\n数日前、同社はかなり悪い業績を発表しました...",
      "title": "シャオミはIoT分野で長期的に大きな可能性を秘めていると思う - 時価総額わずか850億ドルのハイテク企業"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "小米（HK: 1810）仅有11年历史，直到2018年才上市--同年实现盈利。\n同年，他们实现了盈利，但是他们是一个知名的品牌，已经在全球智能手机销量中排名第三。\n在全球智能手机销售中排名第三。\n\n几天前，该公司发布了一份相当邪恶的财报...",
      "title": "我认为小米在物联网领域有巨大的长期潜力--市值仅850亿美元的科技巨头"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "小米（HK: 1810）僅有11年曆史，直到2018年才上市--同年實現盈利。\n同年，他們實現了盈利，但是他們是一個知名的品牌，已經在全球智能手機銷量中排名第三。\n在全球智能手機銷售中排名第三。\n\n幾天前，該公司發佈了一份相當邪惡的財報...",
      "title": "我認爲小米在物聯網領域有巨大的長期潛力--市值僅850億美元的科技巨頭"
    }
  ],
  "title": "I think Xiaomi has huge long term potential in IoT - tech giant at a market cap of just $85 billion",
  "created_utc": 1622303054,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Xiaomi (HK: 1810) is a mere 11 years old and didn&#39;t go public until 2018 - the same year they turned profitable, yet the are a well known brand and already third in global smartphone sales.</p>\n\n<p>A few days ago the company delivered a pretty wicked <a href=\"https://blog.mi.com/en/2021/05/26/xiaomi-posts-record-results-as-2021-q1-revenue-and-profit-hit-historical-high-levels/\">earnings report</a> with an adjusted net profit increase of 163%. </p>\n\n<p>Two days prior I wrote a <a href=\"https://jesbaek.com/2021/05/23/xiaomis-future/\">piece</a> of how their unique &#39;AIoT&#39; and &#39;Internet Services&#39; strategy will eventually allow the company to make much larger profits on revenue in the future.</p>\n\n<p>Xiaomi commands one of the largest product portfolios with smart enabled devices of every category. In the West we don&#39;t yet see their smartphones too often - but their robo vacuum cleaners and electric scooters (They own Ninebot and Segway) and other smart home equipment is everywhere. They are basically taking the opposite route of Google and Apple in providing the hardware before the software - which also means they currently have higher costs and lower return on revenue.</p>\n\n<p>Yet they are already profitable and sit on a cash pile of 5.6 billion. About 60% of their revenue right now is however attributed to their smartphones - which are doing extremely well. Their phones receive high praise (though their Android fork is not liked by all) and offer unbeatable performance for the price. They do well in every price category and own several well known sub brands like Redmi, Poco and Blackshark. As an example Mrwhosetheboss (huge tech YT channel) picked Xiaomi brands for all top 3 spots for his best phones of 2021 out of 22.</p>\n\n<p>Xiaomi holds the top spot in market share in several emerging markets: India, Russia and most of Eastern Europe and soon South America. In Scandinavia where I live, they just recently entered local carrier stores, began advertising actively and opened a local <a href=\"http://www.mistore.dk\">official webshop</a>. The ban on Huawei left a HUGE gap in the European market for Xiaomi to just freely gobble up and it seems like they are doing it. Xiaomi themselves have been <a href=\"https://www.google.com/amp/s/www.androidauthority.com/xiaomi-us-remove-blacklist-1224721/\">removed</a> from a similar (but much less severe) blacklist by the US government this week as well. They do not pose the same threat as Huawei did, as they do not build infrastructure telecom equipment</p>\n\n<p>There are rumors of the company designing their own SoCs (chips) in collaboration with OPPO and just last month they <a href=\"https://www.cnbc.com/2021/03/30/chinas-xiaomi-to-launch-electric-car-business-and-invest-10-billion.html\">invested $10 billion</a> into the Electric vehicle space. They already financially back Xpeng too and I think with the insane growth in the Chinese EV market they really have an opportunity to add even more value to their ecosystem integration.</p>\n\n<p>The company is founded by Lei Jun and former Vice President of Google China and Zhou Gaungping then Senior Director at Motorola’s Beijing R&amp;D Center. All three still lead the company today with Lei Jun as CEO. Xiaomi and their CEO has a huge following in China and a very dedicated loyal fan base. </p>\n\n<p>The company trades at a P/E of 23 and a share price of 28.6 HKD (~3.69 USD). The price to earnings is pretty typical for a tech stock but I think the benefits in profit of Xiaomi&#39;s strategy and investments are yet to be seen. I began buying up a few months ago and just doubled my investment after the earnings report. I will continue to buy in over atleast the next year and truly think this is a case of a company working hard for the future and with the right strategy. I saw the same patterns in Microsoft 6 years ago when Sadya Nedella took over and that position I&#39;m up over 500%.</p>\n\n<p>Please let me know what you think and if you feel like there is anything you feel like I need to address. I&#39;m really bullish on this company and it helps balance my portfolio with exposure towards Asia. I know Chinese stocks can be effy and at least for me it was also quite the challenge to find a brokage where I could buy them.</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/stocks/comments/nnn1og/i_think_xiaomi_has_huge_long_term_potential_in/",
  "subreddit": "stocks",
  "id": "nnn1og",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300250
}