{
  "author": "MammathMoobies",
  "original_created_utc": 1629726199,
  "title": "Setting the record straight: The US is nowhere near hyperinflation",
  "created_utc": 1629743477,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im big on crypto like the rest of you but this needs to be addressed. I feel the more we push misinformation on this sub in order to push our agenda the less credible crypto as a whole will be.</p>\n\n<p>The US hitting a 5-6% inflation in a year isnt good, there is fear and uncertainty to be had by this. This does promote the idea that crypto is a great hedge. However, claiming this is hyperinflation is insane.</p>\n\n<p>Most experts will define hyperinflation as 25-50% price level increase in a MONTHLY basis. That&#39;s a minimum of 1,297% in a given year. Lets not spread fake information to spread fear in the system.</p>\n\n<p>So many posts are either pushing this montra and if theyre not, they send the whole &quot;if you kept cash in the last 12 years youd lose x but if you put it in BTC youd gain y&quot;. The false equivalencies are gross and are going to get people screwed when they think throwing everything into crypto will save them or make them rich.</p>\n\n<p>Let the downvotes begin</p>\n\n<p>EDIT: referenced it in the comments but to set the record straight, another common definition of hyperinflation is a 100% increase in price levels over a 3 year period. This doesnt disprove my statement but good to have all data in one place!</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/pa03f9/setting_the_record_straight_the_us_is_nowhere/",
  "subreddit": "CryptoCurrency",
  "id": "pa03f9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im big on crypto like the rest of you but this needs to be addressed. I feel the\nmore we push misinformation on this sub in order to push our agenda the less\ncredible crypto as a whole will be.\n\nThe US hitting a 5-6% inflation in a year isnt good, there is fear and\nuncertainty to be had by this.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は他の皆さんと同じように暗号化を重視していますが、これには対処する必要があります。私は以下のように感じています。\nこのサブサイトでは、自分たちのアジェンダを推し進めるために誤った情報を流せば流すほどに\n暗号全体の信頼性が低下すると感じています。\n\n米国が1年で5～6％のインフレになったことは良いことではなく、恐怖と不確実性があります。\n恐怖と不確実性があります。....",
      "title": "誤解を恐れずに言えば 米国はハイパーインフレとは無縁である"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和你们其他人一样，对加密货币很感兴趣，但这个问题需要得到解决。我觉得\n为了推动我们的议程，我们越是在这个子上推送错误的信息，整个加密货币的可信度就越低。\n整个加密货币的可信度就会降低。\n\n美国在一年内达到5-6%的通货膨胀率并不是好事，这里面有恐惧和\n....，有不确定性。",
      "title": "澄清事实真相。美国远未接近恶性通货膨胀"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和你們其他人一樣，對加密貨幣很感興趣，但這個問題需要得到解決。我覺得\n爲了推動我們的議程，我們越是在這個子上推送錯誤的信息，整個加密貨幣的可信度就越低。\n整個加密貨幣的可信度就會降低。\n\n美國在一年內達到5-6%的通貨膨脹率並不是好事，這裏面有恐懼和\n....，有不確定性。",
      "title": "澄清事實真相。美國遠未接近惡性通貨膨脹"
    }
  ]
}