{
  "author": "RegretfullyForgetful",
  "original_created_utc": 1637511825,
  "title": "Dan Jones' upcoming novel will give the \"D-Day in Saving Private Ryan\" treatment to Edward III's landing on Omaha Beach during the 100 years war. What sort of opposition did medieval armies face when landing?",
  "created_utc": 1637596437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On a recent episode of <em>&quot;Tides of History&quot;</em> Dan Jones talks about writing his upcoming book about the 100 Years War with all the style and clichés of modern war films (e.g. Jarhead, Apocalypse Now). He talked about how Edward III faced opposition when landing on what we now know as Omaha Beach (e.g. crossbows and trebuchets). I&#39;ve been wondering if most armies faced in this time.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qyyf9g/dan_jones_upcoming_novel_will_give_the_dday_in/",
  "subreddit": "AskHistorians",
  "id": "qyyf9g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On a recent episode of \"Tides of History\" Dan Jones talks about writing his\nupcoming book about the 100 Years War with all the style and clichés of modern\nwar films (e.g. Jarhead, Apocalypse Now). He talked about how Edward III faced\nopposition when landing on what we now know as Omaha Beach (e.g.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近放送された「Tides of History」では、ダン・ジョーンズ氏が、100年戦争に関する近刊の執筆について\n現代の戦争映画（例：『ジャーヘッド』『アポカリプス ナウ』）のようなスタイルと決まり文句で、100年戦争についての本を書こうとしている。\n戦争映画（例：Jarhead, Apocalypse Now）のスタイルと決まり文句で100年戦争についての本を書こうとしていることについて語っています。エドワード3世が現在の日本の国土に上陸した際、どのように反対に遭ったのかを語っています。\n現在のオマハ・ビーチに上陸する際、エドワード3世がいかに反対に遭ったかを語っています（例：....",
      "title": "ダン・ジョーンズが今度発表する小説では、100年戦争中のエドワード3世のオマハ・ビーチへの上陸を「セービング・プライベート・ライアンのD-Day」のように扱っている。中世の軍隊は上陸の際にどのような抵抗を受けたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在最近一期的 \"历史的潮流 \"节目中，丹-琼斯谈到了他的写作。\n他即将出版的关于百年战争的书，采用了现代战争电影的所有风格和陈词滥调。\n战争电影（如《虎口脱险》、《现代启示录》）的风格和陈词滥调。他谈到了爱德华三世如何面对\n在我们现在所知的奥马哈海滩登陆时面临的反对（例如....",
      "title": "丹-琼斯即将出版的小说将对百年战争期间爱德华三世在奥马哈海滩的登陆进行 \"拯救大兵瑞恩的D日 \"处理。中世纪的军队在登陆时面临什么样的反对？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近一期的 \"歷史的潮流 \"節目中，丹-瓊斯談到了他的寫作。\n他即將出版的關於百年戰爭的書，採用了現代戰爭電影的所有風格和陳詞濫調。\n戰爭電影（如《虎口脫險》、《現代啓示錄》）的風格和陳詞濫調。他談到了愛德華三世如何面對\n在我們現在所知的奧馬哈海灘登陸時面臨的反對（例如....",
      "title": "丹-瓊斯即將出版的小說將對百年戰爭期間愛德華三世在奧馬哈海灘的登陸進行 \"拯救大兵瑞恩的D日 \"處理。中世紀的軍隊在登陸時面臨什麼樣的反對？"
    }
  ]
}