{
  "author": "robertrydefalk",
  "the_new_excerpt": "Nvidia might be a bit expensive today, but looking at the future and their\ncompetitors, I’m still long on Nvidia and this is why:\n\n 1. In the last 6 months, their webpage traffic has almost doubled. From 22M in\n    September to 36M in February. More visitors to their webpage tells me that\n    more…",
  "original_created_utc": 1616002290,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Nvidia今天的价格可能有点贵，但从未来和他们的。\n竞争对手，我还是看多英伟达，这是为什么。\n\n 1. 在过去的6个月里，他们的网页流量几乎翻了一番。从22M在\n    9月到2月的36M。更多的访问者告诉我，他们的网页\n    更多...",
      "title": "长于Nvidia - 替代数据点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Nvidia今天的價格可能有點貴，但從未來和他們的。\n競爭對手，我還是看多英偉達，這是爲什麼。\n\n 1. 在過去的6個月裏，他們的網頁流量幾乎翻了一番。從22M在\n    9月到2月的36M。更多的訪問者告訴我，他們的網頁\n    更多...",
      "title": "長於Nvidia - 替代數據點"
    }
  ],
  "title": "Long on Nvidia - Alternative data points",
  "created_utc": 1616083128,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nvidia might be a bit expensive today, but looking at the future and their competitors, I’m still long on Nvidia and this is why:</p>\n\n<ol>\n<li>In the last 6 months, their webpage traffic has almost doubled. From 22M in September to 36M in February. More visitors to their webpage tells me that more people are interested in their products.</li>\n<li>They are looking to hire more people than their competitors. Nvidia has currently around 1000 open positions, compared to 700 for AMD and 650 for Intel. This tells me that the company is growing. But it’s also interesting to see what kind of people they are hiring. I like that they are looking to hire people for their Autonomous Vehicles Platform - huge future opportunity.</li>\n<li>Highest employee rating in the industry. People like working for Nvidia (if we should trust sites like Glassdoor and Indeed), more so than their competitors. The CEO approval is at an all time high and I believe that this will help them attract even more great people in the future.</li>\n</ol>\n\n<p>On top of this, financials looks rock solid with increasing revenue year over year.</p>\n\n<p>Source: <a href=\"https://dillibits.com/index.php?t=NVDA\">https://dillibits.com/index.php?t=NVDA</a></p>\n\n<p>Your thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/investing/comments/m75qs5/long_on_nvidia_alternative_data_points/",
  "subreddit": "investing",
  "id": "m75qs5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752818321
}