{
  "author": "drhuehue",
  "original_created_utc": 1643159749,
  "title": "Time Wonderland, an ohm fork that promised 80,000%+ APY returns, has fallen 95% in value from 10,000+ to 500 and is collapsing as I type this.",
  "created_utc": 1643189481,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Daniele&amp;#39;s wonderland project is in full blown collapse, falling 50% today after already plummeting over 90% from its highs. Color me shocked that a project that promised 80,000% apr turned out to be a complete rugpull. The cherry on top is that after falling so much, the creator, Daniele, decided to airdrop huge quantities of this token to a bunch of FTM holders as part of his ve(3,3) promotion, whomst immediately sold and is part of the reason of this current freefall.&lt;/p&gt;\n\n&lt;p&gt;@danielesesta has gone private on twitter and word is he backdoor sold all his holdings in the last few days by putting his shares into Abra, borrowed MIM against it, transferring it to eth, swapping it for USDT, and exiting via bitfinex.&lt;/p&gt;\n\n&lt;p&gt;Complete rug LOL&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/sctds1/time_wonderland_an_ohm_fork_that_promised_80000/",
  "subreddit": "CryptoCurrency",
  "id": "sctds1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Daniele's wonderland project is in full blown collapse, falling 50% today after\nalready plummeting over 90% from its highs. Color me shocked that a project that\npromised 80,000% apr turned out to be a complete rugpull. The cherry on top is\nthat after falling so much, the creator, Daniele, decided…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Danieleのワンダーランドプロジェクトが本格的に崩壊し、今日も50％下落した。\n高値からすでに90％以上急落している。私は、このプロジェクトが\n80,000%の利益を約束したのに、完全に失敗した。極めつけは\n制作者のDanieleは、あまりの落ち込みに、こう決意したそうです...。",
      "title": "80,000%以上のAPYリターンを約束したΩフォーク「Time Wonderland」は、1万円以上から500円まで95%も値下がりし、これを打っている間にも崩れている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Daniele的仙境项目正在全面崩溃，在从高点暴跌超过90%之后，今天又下跌了50%。\n已经从高点暴跌了90%以上。让我感到震惊的是，一个承诺80000%收益的项目\n承诺的80,000%的收益率变成了一个完整的地毯式下跌。最重要的是\n在下跌了这么多之后，创建者丹尼尔决定...",
      "title": "时间仙境，一个承诺80000%以上年利率回报的欧姆叉，价值已经从10000+跌至500，在我打字的时候，已经崩溃了95%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Daniele的仙境項目正在全面崩潰，在從高點暴跌超過90%之後，今天又下跌了50%。\n已經從高點暴跌了90%以上。讓我感到震驚的是，一個承諾80000%收益的項目\n承諾的80,000%的收益率變成了一個完整的地毯式下跌。最重要的是\n在下跌了這麼多之後，創建者丹尼爾決定...",
      "title": "時間仙境，一個承諾80000%以上年利率回報的歐姆叉，價值已經從10000+跌至500，在我打字的時候，已經崩潰了95%。"
    }
  ]
}