{
  "author": "XyraxAlaria",
  "the_new_excerpt": "Reading about all this Crypto stuff (known about it for a long time now, never\nreally appreciated it, but my interest is being re-kindled due to all the steam\nit's generating)\n\nReading about Ethereum (the network) on their site - it seems... big. Like game\nchanging big (if it's adopted) - I know…",
  "original_created_utc": 1612189639,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "读到这些Crypto的东西（早就知道了，从来没有过）。\n真的很感激，但我的兴趣被重新点燃，由于所有的蒸汽。\n它产生的)\n\n在他们的网站上读到了Ethereum（网络）--似乎......很大。像游戏\n变化大（如果是采用）--我知道...",
      "title": "Ethereum是像看起来那么大，还是我在买通营销？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讀到這些Crypto的東西（早就知道了，從來沒有過）。\n真的很感激，但我的興趣被重新點燃，由於所有的蒸汽。\n它產生的)\n\n在他們的網站上讀到了Ethereum（網絡）--似乎......很大。像遊戲\n變化大（如果是採用）--我知道...",
      "title": "Ethereum是像看起來那麼大，還是我在買通營銷？"
    }
  ],
  "title": "Is Ethereum as big as it seems or am I buying into marketing?",
  "created_utc": 1612223184,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reading about all this Crypto stuff (known about it for a long time now, never really appreciated it, but my interest is being re-kindled due to all the steam it&#39;s generating)</p>\n\n<p>Reading about Ethereum (the network) on their site - it seems... big. Like game changing big (if it&#39;s adopted) - I know right now most eyes are on Ether but what really interests me is the network around it.</p>\n\n<p>I know all the &quot;alt-coins(?)&quot; that surround it like Compound and Uniswap, at their core, rely on the Ethereum network - that&#39;s all good. But the apps that also run on the network are interesting - seems like there is big potential there. It seems like a &quot;new internet&#39; from reading it since it has something to do with being decentralized and running on nodes (I guess?), but at the same time I start to wonder if it&#39;s ACTUALLY different or if it&#39;s just marketing jargon. They describe it as a P2P thing (similar to torrents? I guess? is that accurate?) I just wonder how the network would scale if it suddenly sees a ton of adoption.</p>\n\n<p>The website (and Ethereum shills) make it seem like this is the next big thing - their interest in moving to the staking model sounds like (if it works) that it could be great (though the potential downfalls could be a massive hit on Ethereum as a whole) - a huge reduction in energy usage is a +1 from me, seeing as how I work in the energy industry.</p>\n\n<p>Also people always compare Bitcoin to it - I know Bitcoin is the &quot;mother&quot; of Crypto as we know it - but in general I feel like I either see mostly negative things about Bitcoin (aside from it&#39;s monetary value), or no talk about it&#39;s future plans are. Seems like more of a volatile &quot;stock&quot; than a currency with a big plan. Why are most eyes still on it? People always complain about the energy usage of Bitcoin and it&#39;s energy impact on the global grid. I know that there are a bunch of ETH network coins that make changes based on people who earn tokens from staking into it the coins? How does Bitcoin make changes (if at all), or was it basically deployed the the mysterious Satoshi and left to fend for itself.</p>\n\n<p>Sorry for all the questions here - this stuff seems really interesting and I am most definitely excited to be a part of it all but it still feels really &quot;uncharted&quot;. I think Reddit Moons may help to get more people interested in the network though.</p>\n\n<p>So what do you think? Is Ethereum&#39;s network going to be the big thing? Lots of people think that way - wondering how others feel. I hardly see anything that paints a promising future for Bitcoin besides how much money it makes.</p>\n</div><!-- SC_ON -->",
  "score": 255,
  "permalink": "/r/CryptoCurrency/comments/la47zw/is_ethereum_as_big_as_it_seems_or_am_i_buying/",
  "subreddit": "CryptoCurrency",
  "id": "la47zw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530871
}