{
  "author": "DaddySkates",
  "original_created_utc": 1636500273,
  "title": "\"People are up 10x, WHAT AM I DOING WRONG?!\"",
  "created_utc": 1636536663,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This kind of questions are common during bull market like we are experiencing now. Many people are posting about their assets in crypto going up 5, 10x and keep rising. </p>\n\n<p>If you are new to crypto space, and you entered during bull market, a good chance is that you won&#39;t be seeing these kind of returns on investment just yet. People who are up 10x or similar have likely invested their money during when fear levels in crypto market were extreme.</p>\n\n<p>Keep in mind that bulls market makes profits but bear market makes millionaires. And the saying is true. Solana for 3$ in January? Hell yes. DOT for 9$. TASTY.  ETH 700$. Dayum! And list goes on.</p>\n\n<p>Do not expect Lambos in 3 seconds after buying in during Bullmarket. Be patient and be brave when others are fearful. <strong>Be a bargain hunter and search for projects with good fundamentals</strong>. That&#39;s where the real profits are.  </p>\n\n<p>Now let me get back to my ramen and tap water.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qqg81e/people_are_up_10x_what_am_i_doing_wrong/",
  "subreddit": "CryptoCurrency",
  "id": "qqg81e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This kind of questions are common during bull market like we are experiencing\nnow. Many people are posting about their assets in crypto going up 5, 10x and\nkeep rising.\n\nIf you are new to crypto space, and you entered during bull market, a good\nchance is that you won't be seeing these kind of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような質問は、現在のような強気の市場ではよくあることです。\n今のような強気の相場ではよくあることです。多くの人が、暗号の資産が5倍、10倍と上がり続けていることを投稿しています。\n上昇し続けています。\n\nもしあなたが暗号の世界に入ったばかりで、強気の市場の時に入ったのであれば、良いチャンスです。\nこのようなことはないでしょう。",
      "title": "\"人が10倍になっている、何か間違ったことをしているのか？\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这种问题在像我们现在所经历的牛市中很常见。\n现在。许多人在帖子中说他们的加密货币资产上涨了5倍、10倍，并且\n持续上涨。\n\n如果你是加密货币领域的新手，并且是在牛市期间进入的，那么很有可能你不会看到这种情况。\n机会是，你不会看到这种...",
      "title": "\"人们都涨了10倍，我做错了什么？\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這種問題在像我們現在所經歷的牛市中很常見。\n現在。許多人在帖子中說他們的加密貨幣資產上漲了5倍、10倍，並且\n持續上漲。\n\n如果你是加密貨幣領域的新手，並且是在牛市期間進入的，那麼很有可能你不會看到這種情況。\n機會是，你不會看到這種...",
      "title": "\"人們都漲了10倍，我做錯了什麼？\""
    }
  ]
}