{
  "author": "SaltNVinegarNips",
  "original_created_utc": 1659752415,
  "title": "Why did the Ottomans wait until 1453 to conquer Constantinople when they already had it under their thumb by the 1390s?",
  "created_utc": 1659768035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;By 1391 the Ottomans had the run of Thrace and, increasingly, the Balkans. They helped Manuel II depose John V and were able to order both Manuel and John VII to take part in the siege of Philadelphia. By the sounds of it the Empire had no army, no money, and no allies at that point. So why didn&amp;#39;t Murad, Bayezit, or their successors take Constantinople until 1453?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/whd1ap/why_did_the_ottomans_wait_until_1453_to_conquer/",
  "subreddit": "AskHistorians",
  "id": "whd1ap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "By 1391 the Ottomans had the run of Thrace and, increasingly, the Balkans. They\nhelped Manuel II depose John V and were able to order both Manuel and John VII\nto take part in the siege of Philadelphia. By the sounds of it the Empire had no\narmy, no money, and no allies at that point. So why didn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1391年、オスマン帝国はトラキアを支配し、バルカン半島を支配するようになった。彼らは\nマヌエル2世がヨハネ5世を退位させるのを助け、マヌエルとヨハネ7世にフィラドの包囲に参加させることができた。\nフィラデルフィアの包囲に参加するよう命じた。聞けば、帝国には軍隊も資金も同盟国もない。\n軍隊も資金もなく、同盟国もなかった。それなのに、なぜ...",
      "title": "1390年代にはすでにコンスタンティノープルを手中に収めていたオスマン帝国は、なぜ1453年まで征服を待ったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "到1391年，奥斯曼人占领了色雷斯，并且越来越多地占领了巴尔干地区。他们\n他们帮助曼努埃尔二世废黜了约翰五世，并能够命令曼努埃尔和约翰七世\n参加了对费城的围攻。听起来，帝国已经没有\n军队，没有钱，也没有盟友，在这一点上。那么，为什么不...",
      "title": "为什么奥斯曼人要等到1453年才征服君士坦丁堡，而他们在1390年代就已经把君士坦丁堡置于他们的控制之下？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "到1391年，奧斯曼人佔領了色雷斯，並且越來越多地佔領了巴爾幹地區。他們\n他們幫助曼努埃爾二世廢黜了約翰五世，並能夠命令曼努埃爾和約翰七世\n參加了對費城的圍攻。聽起來，帝國已經沒有\n軍隊，沒有錢，也沒有盟友，在這一點上。那麼，爲什麼不...",
      "title": "爲什麼奧斯曼人要等到1453年才征服君士坦丁堡，而他們在1390年代就已經把君士坦丁堡置於他們的控制之下？"
    }
  ]
}