{
  "author": "Daegoba",
  "the_new_excerpt": "So this is the method I’ve come up with for doing DD on a company I consider\ninvesting in. I know and understand this is not a fool proof method, but it’s\nworked very well for me, and I think it could help some people to try and be\ncritical and balanced, without pumping or cheerleading. It’s a two…",
  "original_created_utc": 1613308566,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，这是我想出的方法，对我认为的公司进行DD\n的投资。我知道并理解这不是一个万能的方法，但它是\n对我来说非常好，我认为它可以帮助一些人尝试和成为\n批判性和平衡性，不打气也不拉拉队。这是一个两...",
      "title": "我如何对一家公司进行尽职调查。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，這是我想出的方法，對我認爲的公司進行DD\n的投資。我知道並理解這不是一個萬能的方法，但它是\n對我來說非常好，我認爲它可以幫助一些人嘗試和成爲\n批判性和平衡性，不打氣也不拉拉隊。這是一個兩...",
      "title": "我如何對一家公司進行盡職調查。"
    }
  ],
  "title": "How I Do Due Diligence On A Company.",
  "created_utc": 1613313737,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So this is the method I’ve come up with for doing DD on a company I consider investing in. I know and understand this is not a fool proof method, but it’s worked very well for me, and I think it could help some people to try and be critical and balanced, without pumping or cheerleading. It’s a two tiered system, and seems to provide all the necessary questions I need answering when I’m trying to decide to throw money at someone. </p>\n\n<p><strong>CORE</strong></p>\n\n<blockquote>\n<p>Product</p>\n</blockquote>\n\n<p>-Is it something people have/find value in? Beneficial? Desirable? etc. You gotta have a good product.</p>\n\n<blockquote>\n<p>Management Focus</p>\n</blockquote>\n\n<p>-Are the managers clowns, or industry pro&#39;s? Do they have a plan? Are they focused? Got vision? Will they take the company in a direction I think is profitable?</p>\n\n<blockquote>\n<p>Revenue</p>\n</blockquote>\n\n<p>-How much revenue do they generate? Where does the spending money come from? How are sales? Service?</p>\n\n<blockquote>\n<p>Debt vs Assets</p>\n</blockquote>\n\n<p>-Are they in the black or upside down like Stranger Things? Do they owe more than they make? What do they own that makes them money, vs what they have borrowed on that costs them money? How&#39;s the overhead?</p>\n\n<blockquote>\n<p>Risk</p>\n</blockquote>\n\n<p>-Is it a pretty safe bet short term/long term? Does it seem feasible that they will grow or prosper, vs fall and break their own teeth out?</p>\n\n<p><strong>Shell</strong></p>\n\n<blockquote>\n<p>Hype</p>\n</blockquote>\n\n<p>-Are people taking about them? In the news? Is fucking reddit jerking off about them?</p>\n\n<blockquote>\n<p>Price</p>\n</blockquote>\n\n<p>-Do I have to take a 2nd mortgage out to afford a good position? Can I pick up enough to make a fair profit with money I already have, or do I gotta clear some other holdings out to be where I want share wise?</p>\n\n<blockquote>\n<p>Potential</p>\n</blockquote>\n\n<p>-Is the product, sector, industry, or climate even receptive to the business model? Is this some Beannie Babies shit, or the best thing since sliced bread?</p>\n\n<blockquote>\n<p>Activity</p>\n</blockquote>\n\n<p>-Has the company even active? Are they enthusiastically pursuing success? Taking steps to be better? More efficient? Relevant? Innovative? Or, are they coasting along like a fat guy in Lazy River?</p>\n\n<p>EDIT; Refined the Debt vs Assets category to include expenses.</p>\n</div><!-- SC_ON -->",
  "score": 3029,
  "permalink": "/r/stocks/comments/ljo7d3/how_i_do_due_diligence_on_a_company/",
  "subreddit": "stocks",
  "id": "ljo7d3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623062
}