{
  "author": "Amelie007",
  "original_created_utc": 1641692609,
  "title": "This sub 2 months ago: You will never see Bitcoin below $50k ever again",
  "created_utc": 1641704002,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Two months ago when Bitcoin hit its all time high of $69k, pretty much all you would hear from people around here was that the days of Bitcoin below $50k was a thing of the past--with members posting all these &lt;del&gt;astrological&lt;/del&gt; TA charts proclaiming how the &amp;#39;maximum pain&amp;#39; from here on forward was around the $55k mark. &lt;/p&gt;\n\n&lt;p&gt;But what caught my attention more than anything was all the people whining and complaining how they &amp;#39;wished&amp;#39; they had bought in when BTC was in the low 40s and how they had missed that glorious opportunity. &lt;/p&gt;\n\n&lt;p&gt;Well fellas... its time to put up or STFU cause that time is today. But judging by things around here I am guessing the modus operandi is going to be more and more whining, this time about how they &amp;#39;wished&amp;#39; they had sold. And then a couple of weeks or months from now when the market recovers (as it always does) we&amp;#39;ll have the same people whining about how they missed that golden opportunity of buying low yet again.. no wonder we have that prophetic joke about buying high and selling low. &lt;/p&gt;\n\n&lt;p&gt;I think its about time to disrupt that problematic pattern of behavior.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 480,
  "permalink": "/r/CryptoCurrency/comments/rzg6i1/this_sub_2_months_ago_you_will_never_see_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "rzg6i1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Two months ago when Bitcoin hit its all time high of $69k, pretty much all you\nwould hear from people around here was that the days of Bitcoin below $50k was a\nthing of the past--with members posting all these astrological TA charts\nproclaiming how the 'maximum pain' from here on forward was around…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2ヶ月前、ビットコインが史上最高値の69,000ドルを記録したとき、ほとんどの人が\nこのあたりでは、ビットコインが5万ドル以下になる時代は終わったという声が聞かれました。\nメンバーたちは、このような占星術のTAチャートを投稿しています。\nこれから先の「最大限の痛み」は...と宣言している。",
      "title": "このサブ2ヶ月前。あなたは二度と50kドル以下のビットコインを見ることはありません"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "两个月前，当比特币创下6.9万美元的历史新高时，你所听到的几乎是\n你会听到这里的人说，比特币低于5万美元的日子已经成为过去。\n\n宣称从现在开始的 \"最大痛苦 \"是在......",
      "title": "这个子2个月前。你不会再看到比特币低于5万美元了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "兩個月前，當比特幣創下6.9萬美元的歷史新高時，你所聽到的幾乎是\n你會聽到這裏的人說，比特幣低於5萬美元的日子已經成爲過去。\n\n宣稱從現在開始的 \"最大痛苦 \"是在......",
      "title": "這個子2個月前。你不會再看到比特幣低於5萬美元了"
    }
  ]
}