{
  "author": "DecentralizedLaw",
  "original_created_utc": 1624363353,
  "title": "Governments Planning a Global Coordinated Attack on Bitcoin from Next Month Onwards [Due Diligence]",
  "created_utc": 1624397845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>The worlds’ wealthiest nations are aiming for cryptos, restricting, amongst others, the following:</h1>\n\n<ul>\n<li>Peer-to-Peer Transactions;</li>\n<li>Stablecoins;</li>\n<li>Private wallets (cold storage, phone and desktop apps);</li>\n<li>Privacy (privacy coins, mixers, Decentralized exchanges, use of TOR and I2P);</li>\n<li>Former ICOs and Future Projects (DeFi, NFT, smart contacts, second layer solutions, and much more).</li>\n</ul>\n\n<p><strong>In addition, these new regulations intend to:</strong></p>\n\n<ul>\n<li>Force those active in crypto to be licensed and regulated as banks (responsible for KYC and transaction tracking);</li>\n<li>Create full transparency for ALL transactions;</li>\n<li>Exclude and freeze assets of persons, activities, and countries labeled a “risk;”</li>\n<li>Force the inclusion of user information with all transactions;</li>\n<li>Revoke the license of those who don’t comply.</li>\n</ul>\n\n<p>In short: they want to change the way the space can operate. As you’ll discover, the regulation rolled out aim to create a system of complete transparency and control.</p>\n\n<p>At the same time, regulatory clarity could pave the way for the next stage of adoption.</p>\n\n<p>&#x200B;</p>\n\n<h2>What Can You Get from This Due Diligence</h2>\n\n<p>For years, we wondered if governments would “ban Bitcoin.” As it turns out, they will not. Instead, they intent to simply absorb cryptos into the existing regulated financial system.</p>\n\n<p>This due diligence is based on new international regulations. This DD reveals exactly what the coming regulations mean for cryptos, who is behind them, and how they will be implemented. Next, this DD highlights the most revealing and stunning clauses. And finally, it summarizes which activities are likely to thrive and which are bound to suffer and what you can do next to protect yourself.</p>\n\n<p>&#x200B;</p>\n\n<h2>Why Now?</h2>\n\n<p>In 2018, the news that Facebook was creating a crypto currency shocked international regulators. Until then, they didn’t see cryptos as a risk to the stability of the global financial system. However, Libra, the coin Facebook proposed, was a so-called stablecoin; it maintains its value relative to the USD. They quickly realized what would happen when a company with a billion users creates an instant payment system that is cheaper, faster and more user-friendly than the current financial system.</p>\n\n<p>This topic was discussed at the highest levels of government; the G20, an international forum for the governments and central bank governors from 19 countries and the European Union. They engaged an organization called the Financial Action Task Force (<strong>FATF</strong>).</p>\n\n<p>This organization has passed similar legislation for banking and financial service providers around the world. They are responsible for the fact that all crypto-currency exchanges where fiat is exchanged for cryptos have the same KYC and anti-money laundering requirements as banks. Now, they are going to use this framework to focus on the elements of the industry currently outside their control, and declare what is, and isn’t acceptable.</p>\n\n<p>&#x200B;</p>\n\n<h3>New Guidance on Bitcoin and Cryptos</h3>\n\n<p>The latest draft guidance of the FATF, to be implemented in July 2021, is called <em>“Guidance for a risk-based approach to virtual assets and VASPs”</em> (<strong>GVA</strong>) [1]. This DD is based on this GVA.</p>\n\n<p>As you will learn, they have a deep understanding of what is happening in the space. Moreover, they take the expansive view that <em>“most arrangements currently in operation,”</em> including <em>“self-categorized P2P platforms”</em> may have a <em>“party involved at some stage of the product’s development and launch”</em> who will be covered by this new legislation. (GVA, p29)</p>\n\n<p>&#x200B;</p>\n\n<h3>Why do the FATF regulations have global reach?</h3>\n\n<p>Since FATF isn’t an official government agency of any country, they cannot create law. They issue what is known as “soft-laws”: recommendations and guidance. Only when this guidance is implemented in the laws of the countries, they become “hard-laws” with real power.</p>\n\n<p>In theory, they are thus subjected to the formal law-making process of law-giving countries. However, countries that don’t participate are placed on a list of “non-cooperative jurisdictions.” They then face restricted access to the financial system and ostracism from the international community. For this reason, almost all nations implement these recommendations.</p>\n\n<p>It also must be said that national governments, especially in the Western world, highly value this kind of international cooperation and the power it gives them. Many such treaties are passed into law with little opposition or delay.</p>\n\n<p>Once these treaties are accepted, they become part of a body of law called international law, a type of law in many cases superseding national laws. Unknown to the general public, international law is increasingly being used as a backdoor for passing invasive regulations such as these.</p>\n\n<p>It must be noted that people working for this Paris-based organization are faceless bureaucrats who have not been elected, their procedures and budget are not subjected to democratic oversight, and they are almost impossible to remove from power. Like most international organizations, they fall under the Vienna Conference on Diplomatic Intercourse and Immunities.[2] As such, they enjoy immunity for their actions, are exempt from administrative burdens in the countries they are active, such as taxes, and free from most COVID travel restrictions.</p>\n\n<p>&#x200B;</p>\n\n<h3>When will this “Guidance” be Implemented?</h3>\n\n<p>The GVA was published in March to be subjected to public consultation. This gives it the appearance of the public having a say in the implementation of it, but when you read it carefully they will consider feedback only on “relevant issues” they themselves selected. Other feedback might be considered in the next review in 12 months (by then, most current recommendations will likely have been passed into law). In other words, this will be it, with minor adjustments.</p>\n\n<p>June 2021 FATF reviews all feedback and after the July 2021 meeting these new “recommendations” will become official. There are no fixed days yet. However, from July 2021 onwards, we can expect these recommendations to start being implemented in the national legal systems, and as such, start affecting our lives.</p>\n\n<p>This process has been successfully used in the banking system and tax systems―it is now coming for crypto. It is worth noting that individual countries might decide on even more specific or explicit prohibitions on top of this. It is also worth noting that these regulations do not apply to central bank-issued digital currencies.</p>\n\n<p>&#x200B;</p>\n\n<h2>How Will Cryptos Be Regulated?</h2>\n\n<p>Before we can understand how FATF proposes to regulate cryptos, we must learn what they mean when they talk about a Virtual Asset:</p>\n\n<p>“<em>A virtual asset is a digital representation of value that can be digitally traded, or transferred, and can be used for payment or investment purposes. Virtual assets do not include digital representations of fiat currencies, securities and other financial assets that are already covered elsewhere in the FATF Recommendations.”</em> (GVA, p98)</p>\n\n<p>Cryptos will not be outright banned. They will be regulated via an indirect method; those who facilitate virtual asset transactions, are designated as a Virtual Asset Service Provider, or VASP.</p>\n\n<p>Next, all VASPs will be subjected to similar regulation as banks. The definition of VASP is so wide that most current projects in the crypto space are covered by it.</p>\n\n<p>&#x200B;</p>\n\n<h3>Definition of a VASP:</h3>\n\n<p><em>“</em><strong><em>VASP: Virtual asset service provider</em></strong> <em>means any natural or legal person who</em> [...] <em>as a business conducts one or more of the following activities or operations for or on behalf of another natural or legal person:</em></p>\n\n<ol>\n<li><em>exchange between virtual assets and fiat currencies;</em></li>\n<li><em>exchange between one or more forms of virtual assets;</em></li>\n<li><em>transfer of virtual assets (In this context of virtual assets, transfer means to conduct a transaction on behalf of another natural or legal person that moves a virtual asset from one virtual asset address or account to another.);</em></li>\n<li><em>safekeeping and/or administration of virtual assets or instruments enabling control over virtual assets; and</em></li>\n<li><em>participation in and provision of financial services related to an issuer’s offer and/or sale of a virtual asset.”</em> (GVA, p18)</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<h3>Many Organizations and Individuals Will Be Designated as VASPs:</h3>\n\n<p>A VASP is <strong>any natural or legal person</strong>, and <em>“the obligations in the FATF Standards stem from the underlying financial services offered without regard to an entity’s operational model, technological tools, ledger design, or any other operating feature.”</em> (GVA, p21)</p>\n\n<p>The expansiveness of these definitions represents a conscious choice by the FATF. <em>“Despite changing terminology and innovative business models developed in this sector, the FATF envisions very few VA arrangements will form and operate without a VASP involved at some stage.”</em> (GVA, p29)</p>\n\n<p>For those wondering if they are a VASP, the following general questions can help guide the answer:</p>\n\n<ul>\n<li>“<em>who profits from the use of the service or asset;</em></li>\n<li><em>who established and can change the rules;</em></li>\n<li><em>who can make decisions affecting operations;</em></li>\n<li><em>who generated and drove the creation and launch of a product or service;</em></li>\n<li><em>who possesses and controls the data on its operations; and</em></li>\n<li><em>who could shut down the product or service.</em></li>\n</ul>\n\n<p><em>Individual situations will vary and this list offers only some examples.”</em> (GVA, p30)</p>\n\n<p>&#x200B;</p>\n\n<h3>What Are VASPs Obliged to Do?</h3>\n\n<p>All VASPs will be forced to implement KYC legislation and monitor transactions. They become fully regulated entities who need to obtain a license. Individuals can also be labeled a VASP.</p>\n\n<p>The real kicker is that all activities not part of the regulated system are labeled as “high-risk.” And as such, those performing such activities become high-risk persons, which could have repercussions for accessing the wider financial system.</p>\n\n<p>It is important to understand that most peer-to-peer activities themselves will not be banned (although individual countries may do so on their own accord).</p>\n\n<p>However, transactions with a “high-risk” background will be tainted and scrutinized. Exchanges risk losing their license if they deal with them, and many will simply choose not to allow them. It might get to a point where proceeds from certain peer-to-peer transactions or private wallets are no longer usable in the financial system, at least not without extensive due diligence.</p>\n\n<p>&#x200B;</p>\n\n<h3>New Government Organizations for Overseeing the Crypto Market</h3>\n\n<p>Every country should assign a “competent authority” to monitor the crypto space and communicate with competent authorities in other countries: <em>“VASPs should be supervised or monitored by a competent authority, not a self-regulatory body (SRB), which should conduct risk-based supervision or monitoring.”</em> (GVA, p45)</p>\n\n<p>This can be an existing regulatory body, such as a central bank or a tax authority, or a specialist VASP supervisor. (GVA, p91)</p>\n\n<p>&#x200B;</p>\n\n<h2>What Activities Will Be Regulated?</h2>\n\n<p>This chapter highlights crypto activities, currently considered completely normal, and details how they are to be regulated.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Peer-to-Peer transactions:</strong> transactions without the involvement of a VASP. They are not subjected to regulation, but are a “risk.” That’s why the FATF recommends increased monitoring and restriction of this kind of activity, and possibly reject licensing VASPs that engage in it.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Stablecoins:</strong> are considered a major risk because they think they are more likely to reach mass adoption. They may be targeted at the level of the central developer or governance body, which will be held accountable for the implementation of these recommendations across their ecosystem.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Unhosted Wallets:</strong> Commonly used private wallets are called: “unhosted wallets.” As mentioned, the FATF suggests denying licensing VASPs <em>“if they allow transactions to/from non-obliged entities (i.e., private / unhosted wallets).”</em> (GVA, p37) VASPS should also <em>“treat such VA transfers as higher risk transactions that require enhanced scrutiny and limitations.”</em> (GVA, p60)</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Client Information to Collect by VASPs:</strong> all VASPs should collect information on their clients such as the customer’s name and further identifiers such as physical address, date of birth, and a unique national identifier number (e.g., national identity number or passport number). VASPs should conduct ongoing due diligence on the business relationship and the customer’s financial activities.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Travel Rule:</strong> FATF recommends applying traditional bank wire transfer requirements on crypto currency transactions; this is called the travel rule.</p>\n\n<p>It includes the obligation to obtain, hold, and transmit required originator and beneficiary information associated with VA transfers in order to identify and report suspicious transactions, take freezing actions, and prohibit transactions with designated persons and entities.</p>\n\n<p>Information accompanying all qualifying transfers should always contain:</p>\n\n<ul>\n<li>“<em>the name of the originator;</em></li>\n<li><em>the originator account number where such an account is used to process the transaction;</em></li>\n<li><em>the originator’s address, or national identity number, or customer identification number, or date and place of birth;</em></li>\n<li><em>the name of the beneficiary; and</em></li>\n<li><em>the beneficiary account number where such an account is used to process the transaction.”</em> (GVA, p53)</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Instant transfer of ID information tied to transactions:</strong> Obliged entities should submit the required information simultaneously with the batch VA transfer, although the required information need not be recorded on the blockchain or other Distributed Ledged Technology (DLT) platform itself.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Categorize Clients and Activities According to their level of Risk:</strong> VA and VASP activity will be subject to a “Risk-Based Approach.” In practice, this means that each client and activity is categorized by their risk level. Risk levels are determined based on a variety of factors. Persons or activities considered a risk can see enhanced due diligence and even their ability to use VASPs reduced.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Ongoing Transaction Monitoring:</strong> Every customer is assigned a risk profile. Based on this profile, customer transactions will be monitored <em>to det</em>ermine whether those transactions are consistent with the VASP’s information about the customer and the nature and purpose of the business relationship.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Transactions tight to Digital IDs:</strong> In the future, VA transactions might need to be subject to digital identity regulations, also being developed by the FATF.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Freezing of Assets:</strong> Cryptos can be frozen when the holder is suspect of a crime, as part of other investigations, when the VA is related to terrorist financing, and when related to financial sanctions. The freezing of VAs will happen regardless of the property laws of national legal frameworks, and it will not be necessary that a person be convicted of a crime.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Anonymity-Enhanced Cryptocurrencies (AECs) and Privacy Tools:</strong> The GVA specifically targets tools intended to improve privacy, such as: anonymity-enhanced cryptocurrencies (AECs) such as Monero, mixers and tumblers, decentralized platforms and exchanges, use of the Internet Protocol (IP) anonymizers such as The Onion Router (TOR), the Invisible Internet Project (I2P) and other darknets, which may further obfuscate transactions or activities.</p>\n\n<p>This includes <em>“new illicit financing typologies”</em> [Author: DeFI?]<em>,</em> and the <em>increasing use of virtual-to-virtual layering schemes that attempt to further obfuscate transactions in a comparatively easy, cheap, and secure manner”</em> [Author: Lighting, Schnorr, Taproot?]<em>. (GVA, p6)</em> </p>\n\n<p>And if a VASP <em>“cannot manage and mitigate the risks posed by engaging in such activities, then the VASP should not be permitted to engage in such activities.”</em> (GVA, p51) </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Obligations to get a License for all VASPs:</strong> The GVA intends to subject all VASPs to a licensing scheme: <em>“at a minimum, VASPs should be required to be licensed or registered in the jurisdiction(s) where they are created.”</em> (GVA, p40) </p>\n\n<p>Moreover, each jurisdiction might require licensing for those servicing clients in their jurisdiction.</p>\n\n<p>It bears repeating that a natural person can also be designated as being a VASP and be required to obtain a license to work on a crypto project. Moreover, the competent authorities get to determine who can and cannot become a VASP, and monitor the Internet for unlicensed activities by engaging in <em>“chain analysis, webscraping for advertising and solicitations, feedback from the general public, information from reporting institutions (STRs), non public information such as applications, law enforcement and intelligence reports.” (GVA, p41)</em> </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Bitcoin ATMs:</strong> “Providers of kiosks—often called “ATMs,” bitcoin teller machines,” “bitcoin ATMs,” or “vending machines”—may also fall into the above definitions.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Decentralized Exchanges:</strong> According to the GVA, the concept of a decentralized exchange doesn’t exist, since these regulations are technology neutral. As such, those running the exchange can be held liable for implementing these regulations.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Multisig Contracts:</strong> In case of partial control of keys, like a multisig or any kind of shared transaction, the providers of such services could be subjected to this regulation as well.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Regulation of Future Developments:</strong> Countries should identify and assess the money laundering and terrorist financing risks relating to the development of new products and business practices. The result might be that the development of new projects need some sort of approval process.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>International Cooperation of Competent Authorities:</strong> And finally, the FATF Recommendations encourages competent authorities to provide the fullest range of international co-operation with other competent authorities.</p>\n\n<p>&#x200B;</p>\n\n<h2>What Will Not Be Regulated?</h2>\n\n<p>Some good news is that what makes crypto, crypto, remains unregulated; peer-to-peer transactions themselves, small transactions and ecommerce, open source development, and cold storage will remain lawful.</p>\n\n<p>Specifically exempt are persons facilitating the technical process, such as miners and nodes (called validators), and those that host, facilitate and develop the network. In addition, small transactions under 1.000 USD/EUR are exempt, although basic identity information will be recorded when done through a VASP.</p>\n\n<p>&#x200B;</p>\n\n<h2>What Will Be the Outcome of These Regulations?</h2>\n\n<p>This regulation, like many of its kind, will have (un)intended consequences. The stated goal of increased transparency in the space might very well be achieved, reveling the proceeds of certain crimes.</p>\n\n<p>However, a secondary goal is clear for those understanding these kinds of open-ended legislation; controlling what can and cannot be done with crypto in the real world by labeling certain activities and undesired persons as “high risk.”</p>\n\n<p>It will be increasingly difficult to deal with proceeds from the “wrong” activities, especially for people from high-risk countries, engaged in high-risk activities, or just being considered a high-risk person.</p>\n\n<p>In addition, it will become expensive and technologically challenging to comply with this legislation. Small companies with unique business models might find it impossible to survive. Only the large regulated entities might remain in existence. This is a common result of regulation that is welcomed by regulators; a few large companies are easier to regulate than one thousand small ones. In some cases, the large participants welcome regulations as well, as it reduces competition. The same happened in the banking sector, for example.</p>\n\n<p>Other downsides are that such regulations smother many otherwise beneficial technological projects in the crib and criminalize perfectly legal activities and the innocent citizen performing them. The loss of privacy will also increase security risks, especially for those living in dangerous countries.</p>\n\n<p>&#x200B;</p>\n\n<h2>The Crypto World at a Crossroads:</h2>\n\n<p>It is hard to determine how specific projects and the crypto space in general are going to be affected; especially since this is not the final guidance. Each national government will have a slightly different interpretation of these regulations, as well as existing laws and precedent in their own country. In addition, individual VASPs will interpret these regulations according to the viewpoint of their legal departments, as well. Cryptos will become a regulatory minefield.</p>\n\n<p>A natural consequence of these regulations is that projects and participants in the crypto space will be divided into two categories: those who do/can meet these regulations, and those who do/cannot.</p>\n\n<p>&#x200B;</p>\n\n<h3>Potential Winners</h3>\n\n<p>First will be those that will fully comply with these regulations. In terms of participants, these will be the big exchanges and onramps, banks, and institutional investors. A lot of participants exclusively use exchanges (VASPs) already for their coins anyway, and for them nothing changes. In fact, additional regulations might help institutional adoption, an idea supported by the fact that the Bank of International Settlements issued new guidance for banks on the prudential treatment of crypto assets.[3]</p>\n\n<p>Crypto assets which might succeed in such an environment are projects that have focused on transparency and KYC from the start, or those who are already established too decentralized and operate without any historic VASPs.</p>\n\n<p>&#x200B;</p>\n\n<h3>Potential Losers:</h3>\n\n<p>Next, there are the activities that are specifically targeted by this regulation; peer-to-peer transactions, privacy coins, decentralized exchanges, decentralized finance, and other peer-to-peer systems. It appears that such projects have only one option and that is to go fully decentralized. Which could actually make them attractive for some.</p>\n\n<p>It is worth repeating that in principle, peer-to-peer systems are not against the law. Those participating in them should however accept that part of their assets and proceeds exist outside the regulated financial system, and that by engaging in them they might be labeled a “risk.”</p>\n\n<p>Finally, there will be projects that fall in between: they are either too centralized to become fully decentralized and considered too “high-risk” to be licensed. Such projects will experience significant headwind. Think about the aforementioned stablecoins, certain decentralized finance applications, certain self-hosted wallets (especially when facilitating exchange functions), and future ICOs.</p>\n\n<p>Current projects that are still too centralized are a big question mark. Especially those who have leading individuals still in control of “road-maps,” or those relying on “governing councils.” Those persons might suddenly be designated a VASP and forced to monitor the individuals and transactions on their network (a big downside as compared to the projects already decentralized).</p>\n\n<p>&#x200B;</p>\n\n<h2>TLDR;</h2>\n\n<p><strong>Governments at the highest levels (G20) commissioned an organization called FATF to come up with international regulations for cryptos. They are using international law frameworks that supersede national legislation and will force every country in the world to comply.</strong></p>\n\n<p><strong>Their main goal is to keep crypto activity restricted to licensed and regulated service providers. A long list of ordinary crypto activities are now labeled a “risk.” Engaging in them will result in increased scrutiny and possible difficulties accessing the wider financial system.</strong></p>\n\n<p><strong>It remains to be seen how this will affect the crypto world. Over time, it could likely split the crypto space in fully regulated (semi) centralized, and unregulated decentralized projects. The winners will be the projects that thrive in either of those. The losers are those fitting in neither.</strong></p>\n\n<p>&#x200B;</p>\n\n<h1>Sources:</h1>\n\n<p><strong>PDF Version</strong>, with exact explanations of how the different activities will be regulated: <a href=\"https://decentralizedlegalsystem.com/wp-content/uploads/2021/06/FATF-Global-Crypto-Regulations-Summary-June-2021.pdf\">https://decentralizedlegalsystem.com/wp-content/uploads/2021/06/FATF-Global-Crypto-Regulations-Summary-June-2021.pdf</a></p>\n\n<p>Feel free to forward this PDF to whomever you think should read this information.</p>\n\n<p>&#x200B;</p>\n\n<p>[1] FATF, <em>“Draft updated Guidance for a risk-based approach to virtual assets and VASPs,”</em> (Paris, March 2021), <a href=\"http://www.fatf-gafi.org/media/fatf/documents/recommendations/March%202021%20-%20VA%20Guidance%20update%20-%20Sixth%20draft%20-%20Public%20consultation.pdf\">http://www.fatf-gafi.org/media/fatf/documents/recommendations/March%202021%20-%20VA%20Guidance%20update%20-%20Sixth%20draft%20-%20Public%20consultation.pdf</a></p>\n\n<p>[2] UN, <em>“United Nations Conference on Diplomatic Intercourse and Immunities,”</em> (Vienna, 2 March - 14 April 1961), accessed on June 10, 2021, <a href=\"https://legal.un.org/ilc/texts/instruments/english/conventions/9_1_1961.pdf\">https://legal.un.org/ilc/texts/instruments/english/conventions/9_1_1961.pdf</a></p>\n\n<p>[3] BIS, <em>“Consultative Document - Prudential treatment of cryptoasset exposures,”</em> (Basel Committee on Banking Supervision, Basel, June 2021), <a href=\"https://www.bis.org/bcbs/publ/d519.pdf\">https://www.bis.org/bcbs/publ/d519.pdf</a></p>\n</div><!-- SC_ON -->",
  "score": 283,
  "permalink": "/r/Bitcoin/comments/o5lhmu/governments_planning_a_global_coordinated_attack/",
  "subreddit": "Bitcoin",
  "id": "o5lhmu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "THE WORLDS’ WEALTHIEST NATIONS ARE AIMING FOR CRYPTOS, RESTRICTING, AMONGST\nOTHERS, THE FOLLOWING:\n\n * Peer-to-Peer Transactions;\n * Stablecoins;\n * Private wallets (cold storage, phone and desktop apps);\n * Privacy (privacy coins, mixers, Decentralized exchanges, use of TOR and I2P);\n * Former ICOs…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界で最も裕福な国がクリプトに狙いを定め、特に以下を制限しています。\n次のようなことが制限されています。\n\n * Peer-to-Peer Transaction（ピアツーピア取引）。\n * ステーブルコイン（Stablecoins）。\n * プライベート・ウォレット（コールド・ストレージ、携帯電話やデスクトップ・アプリ）。\n * プライバシー（プライバシーコイン、ミキサー、分散型取引所、TORとI2Pの使用）。\n * かつてのICO...",
      "title": "来月以降、ビットコインへの世界的な協調攻撃を計画する各国政府【デューデリジェンス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "世界上最富有的国家都以加密货币为目标，限制，其中包括\n其他方面的限制。\n\n *点对点交易。\n * 稳定币。\n * 私人钱包（冷存储，手机和桌面应用程序）。\n * 隐私（隐私币、混合器、去中心化交易所、使用TOR和I2P）。\n * 前ICOs...",
      "title": "各国政府计划从下个月起对比特币进行全球协调攻击[尽职调查] 。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "世界上最富有的國家都以加密貨幣爲目標，限制，其中包括\n其他方面的限制。\n\n *點對點交易。\n * 穩定幣。\n * 私人錢包（冷存儲，手機和桌面應用程序）。\n * 隱私（隱私幣、混合器、去中心化交易所、使用TOR和I2P）。\n * 前ICOs...",
      "title": "各國政府計劃從下個月起對比特幣進行全球協調攻擊[盡職調查] 。"
    }
  ]
}