{
  "author": "hatheaded",
  "original_created_utc": 1638772804,
  "title": "When Joe Medicine Crow joined the U.S. Army at the beginning of World War II, he had earned a masters degree and nearly competed a Ph.D in anthropology. He was enlisted as a private, not a 2nd Lieutenant. I thought most people who had completed a college degree were selected for officer training?",
  "created_utc": 1638797686,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I would want to guess with no facts that is was prejudice against native americans at the time, but I&amp;#39;d like to know more about how draftees were selected for officer school to become 2nd Lt&amp;#39;s\n. It seems a college degree was a strong indicator for becoming an officer. Why wasn&amp;#39;t Joe Medicine crow sent to OCS, with a completed masters degree (anthropology) and his Ph.D. in that subject nearly complete? There was at least one Naval Officer will full Native American blood, Commander Ernest E. Evans, USN, who fought valiantly against an overwhelming Japanese naval force commanding his Fletcher class destroyer USS Johnston. The Johnston was sunk, and Cmdr. Evans was posthumously awarded the Medal of Honor.&lt;/p&gt;\n\n&lt;p&gt;I know Joe Medicine Crow received other high honors, like the Presidential Medal of Freedom, French Legion of Honor, and perhaps most satisfying for him personally, he competed all the achievements in his engagements with the enemy (The German Army) to be a Crow War Chief.&lt;/p&gt;\n\n&lt;p&gt;Why didn&amp;#39;t a man with a master&amp;#39;s degree, a voluneer become an officer, then?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/ra0t4h/when_joe_medicine_crow_joined_the_us_army_at_the/",
  "subreddit": "AskHistorians",
  "id": "ra0t4h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I would want to guess with no facts that is was prejudice against native\namericans at the time, but I'd like to know more about how draftees were\nselected for officer school to become 2nd Lt's . It seems a college degree was a\nstrong indicator for becoming an officer. Why wasn't Joe Medicine crow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "事実無根の推測ですが、先住民に対する偏見があったのではと思います。\nしかし、徴兵制がどのように行われたのか、もっと詳しく知りたいですね。\n2尉になるための士官学校への選抜は、大卒であることが重要だったようです。\n将校になるための強い指標になる。なぜジョー・メディシンはカラスにならなかったのか...。",
      "title": "ジョー・メディスン・クロウが第二次世界大戦の初期にアメリカ陸軍に入隊したとき、彼は修士号を取得し、人類学の博士号をほぼ取得していた。彼は少尉ではなく二等兵として入隊した。大学を卒業した人は、ほとんどが将校訓練に選ばれるのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想在没有事实的情况下猜测，当时对原住民有偏见\n但我想知道更多关于被征召者是如何被选入军官学校的。\n似乎大学学位是成为军官的一个重要指标。\n成为军官的有力指标。为什么Joe Medicine crow...",
      "title": "二战开始时，乔-药鸦加入了美国陆军，他已经获得了硕士学位，并几乎竞争上了人类学的博士学位。他是以二等兵身份入伍的，而不是少尉。我以为大多数完成了大学学位的人都被选入军官培训？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想在沒有事實的情況下猜測，當時對原住民有偏見\n但我想知道更多關於被徵召者是如何被選入軍官學校的。\n似乎大學學位是成爲軍官的一個重要指標。\n成爲軍官的有力指標。爲什麼Joe Medicine crow...",
      "title": "二戰開始時，喬-藥鴉加入了美國陸軍，他已經獲得了碩士學位，並幾乎競爭上了人類學的博士學位。他是以二等兵身份入伍的，而不是少尉。我以爲大多數完成了大學學位的人都被選入軍官培訓？"
    }
  ]
}