{
  "author": "reddito321",
  "the_new_excerpt": "TL;DR: do not stop working/studying when/if you get rich through crypto (or by\nany other means). Set up your own business, study something you love or\nwhatever. Just make sure your brain will keep doing some exercise and that\nyou'll be part of some group/society.\n\nSeeing so many posts about when…",
  "original_created_utc": 1615047457,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：不要停止工作/学习，当/如果你通过加密技术（或通过加密技术）致富。\n任何其他方式）。) 自立门户，学习自己喜欢的东西，或\n不管是什么，只要确保你的大脑会继续做一些运动。只要保证你的大脑会不断地做一些运动，那\n你会成为某个团体/社会的一部分。\n\n看到这么多的帖子，当... ...",
      "title": "我已经退休了，多亏了加密技术，但有一件事很少有人想到，也很少有人告诉你：无聊的时候很难受。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：不要停止工作/學習，當/如果你通過加密技術（或通過加密技術）致富。\n任何其他方式）。) 自立門戶，學習自己喜歡的東西，或\n不管是什麼，只要確保你的大腦會繼續做一些運動。只要保證你的大腦會不斷地做一些運動，那\n你會成爲某個團體/社會的一部分。\n\n看到這麼多的帖子，當... ...",
      "title": "我已經退休了，多虧了加密技術，但有一件事很少有人想到，也很少有人告訴你：無聊的時候很難受。"
    }
  ],
  "title": "I've retired thanks to crypto, but there's something very few people think about or tell you: boredom hits hard",
  "created_utc": 1615052899,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR: do not stop working/studying when/if you get rich through crypto (or by any other means). Set up your own business, study something you love or whatever. Just make sure your brain will keep doing some exercise and that you&#39;ll be part of some group/society.</p>\n\n<p>Seeing so many posts about when lambo, when moon etc., I see myself a few years ago discovering that I could finally hasten by ~10 years my retirement (I&#39;m in my 60&#39;s now). Damn, was I happy about that. I could finally erase all my debt, travel without worrying about days off being discounted of my paycheck, spend lots of time with my family and buy some of the stuff I&#39;ve always wanted. In ~6 months my life changed really hard, and for the better! I gave my grand kids a nice trip do Disney and paid the wedding of my youngest daughter. Suddenly everything fit perfectly.</p>\n\n<p>After 7-8 months, then, I got myself thinking like &quot;so... is this it?&quot;. I was not happy anymore. Don&#39;t get me wrong: I wasn&#39;t <em>unhappy</em>, but I wasn&#39;t happy either. I would wake up everyday, go for a walk, pass by some bakery and buy some stuff, and get back home to surf on the web. I could of course travel to wherever I wanted, but what for? </p>\n\n<p>Friends came in asking for money and I never heard from them again. Some relatives thought I&#39;d won the lottery and suddenly became extremely friendly and helpful, even though literally no one but my daughter and her husband were here at my wife&#39;s funeral. </p>\n\n<p>At the end, I&#39;ve decided to go back to studying and finally entered college. It changed my way of perceiving the world and now I&#39;m quite happy. I&#39;ve also volunteered at some NGOs in my city and it helped me to keep my pace with society.</p>\n\n<p>So my advice is that you need to get prepared to deal with boredom. We grow up with our parents telling us to go to school, have a job, a car, a house and that this is life. But when you suddenly have the car, the house and everything else, what&#39;s left? Do something for yourself and have this in mind. </p>\n\n<p>Boredom hits hard and you need to get prepared to deal with it.</p>\n\n<p>Godspeed to you all!</p>\n</div><!-- SC_ON -->",
  "score": 15717,
  "permalink": "/r/CryptoCurrency/comments/lz4x37/ive_retired_thanks_to_crypto_but_theres_something/",
  "subreddit": "CryptoCurrency",
  "id": "lz4x37",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542572112
}