{
  "author": "Mallardshead",
  "original_created_utc": 1653132776,
  "title": "Regulation: two birds, one stone. My dark maximalism.",
  "created_utc": 1653188146,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Regulation is coming for altcoins. Most of the 17,000 will disappear. This is the s-curve adoption shakeout we as bitcoiners have been warning about for years. SEC Chair Gary Gensler met with the FTC on Wednesday, and again reiterated that bitcoin is NOT a security, but that &amp;quot;&lt;em&gt;Many, I&amp;#39;d say most of the others are securities&lt;/em&gt;.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://twitter.com/hodlerforlife/status/1527705100059258880?s=20&amp;amp;t=BVRnn-2FkOVJ37GwM7CtAw\"&gt;https://twitter.com/hodlerforlife/status/1527705100059258880?s=20&amp;amp;t=BVRnn-2FkOVJ37GwM7CtAw&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Some folks have suggested that getting designated a security won&amp;#39;t affect their coin or protocol. They are terribly mistaken. This designation means you have to follow the established legal framework for securities:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;You can&amp;#39;t transfer a security to someone that is not registered to receive securities. If you do, in order to redeem it they must register. Otherwise you can transfer them freely as they are a property, but only to persons or institutions registered. International sales have their own sets of rules.&lt;/li&gt;\n&lt;li&gt;You cannot issue coins or tokens. This requires form S-3. &lt;/li&gt;\n&lt;li&gt;Insiders/Devs/DAO&amp;#39;s cannot sell their securities without a form S-4. More importantly, they can no longer trade on material action before the public knows, which is an enormous problem currently, especially amongst exchanges. This is a crime if you are trading securities.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;And so on. There is no effort to rewrite American securities laws to accommodate the unique properties of crypto, which instead will meet the burden by complying with the rigor and legal framework everything else does.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/jvu60wzyct091.jpg?width=1074&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=1e38929d5113fe526747b1a7c054527a3c402d0f\"&gt;https://preview.redd.it/jvu60wzyct091.jpg?width=1074&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=1e38929d5113fe526747b1a7c054527a3c402d0f&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The coins-tokens-protocols that get designated securities don&amp;#39;t have to comply of course. If they don&amp;#39;t want to change their protocol, register their brass, and create a hierarchical chain of command for reporting, then:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;They&amp;#39;ll be delisted by every centralized exchange within 90 days&lt;/li&gt;\n&lt;li&gt;All their wallets/apps will be deleted from Apple and Google Play&lt;/li&gt;\n&lt;li&gt;No taxpaying company will accept them as payment&lt;/li&gt;\n&lt;li&gt;Promoting the ticker or coin in any way will be a crime&lt;/li&gt;\n&lt;li&gt;All major stablecoins will cease to operate within their protocols--and this might be the most insurmountable obstacle, because 85% of ALL altcoin volume is from stablecoins. That means nothing inside an alt protocol has established itself as money--except for stablecoins&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/36jdgpibdt091.jpg?width=1125&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3b3b04861391c022dd8c7af932637cbdd4d7d8ea\"&gt;Web3&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;If these projects were decentralized and impairment resistant to begin with, none of this would be happening. They just couldn&amp;#39;t avoid those pre-mines for money though. Their founders loved the spotlight too. If they at least had fixed issuance, they could mitigate some of their problems. But besides BTC, few projects come to mind that can circumvent all these travails; the leading privacy coin certainly can; but even the coin beginning with &lt;em&gt;Lite&lt;/em&gt; and the one represented by a dog symbol could be in danger of getting this black securities label. If delisted, the only real way to acquire these zombified things would be to take something that isn&amp;#39;t a security (like BTC), transfer it to a DEX, then swap into it. Point is, getting designated a security is effectively a date with gravity from the 50th floor, because you are now in the sandbox with the same rules real public companies, real bonds, and real products must adhere to. Can your vaporware compete? Because if you&amp;#39;re not money, what are you exactly? Nothing. You&amp;#39;re an orgy of swaps, wraps, burns, mints, and stakes run by centralized dapps that do nothing but optimize token interactions to keep the orgy going. Here&amp;#39;s a better way to say this: If your dapp is a centralized registered security with full KYC, why does it need a blockchain exactly? To shill its speculative token. There&amp;#39;s no real business or service there. &lt;/p&gt;\n\n&lt;p&gt;Exchanges don&amp;#39;t have profitable business models without a robust (expletive)coin market. Bitcoin isn&amp;#39;t something they can control and the open source tech around it is a race to zero. Add in the fact that BTC has established itself as money, and you&amp;#39;ll see a nascent circular economy already growing around BTC. When it gets big enough (goods services sold in BTC), then exchanges are really no longer necessary. So maybe they&amp;#39;ll spin-off the bitcoin business, miners might acquire them, exchanges might consolidate, who knows. I do know the days of easy money are gone. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ycsy7yblct091.jpg?width=1884&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=6a30d46068016095e2677e693d4243158fd43a88\"&gt;https://preview.redd.it/ycsy7yblct091.jpg?width=1884&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=6a30d46068016095e2677e693d4243158fd43a88&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I think Gary Gensler is a bit naive on what these security designations will do to these protocols that heretofore have been hiding behind the word &lt;em&gt;decentralization&lt;/em&gt; and acting like they&amp;#39;re going to do something of value someday. He also doesn&amp;#39;t understand fully what impact it will have on exchanges either. Bitcoiners are smiling of course, because two birds are getting hit with one stone. Centralized bitcoin-only exchanges (and apps) like Block&amp;#39;s CashApp, Strike, Swan, etcetera won&amp;#39;t be burdened with any of this extra paperwork, insurance costs, lawsuits, lawyers, or blockchain forensic add-ons. &lt;/p&gt;\n\n&lt;p&gt;My dark maximalism really starts sweating through my shirt thinking about the bloody mess of red ink  we&amp;#39;ll be mopping up though.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/bqs5urelet091.jpg?width=311&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=669278e4ef4aaaf8d40995792a3cf227efa66d14\"&gt;https://preview.redd.it/bqs5urelet091.jpg?width=311&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=669278e4ef4aaaf8d40995792a3cf227efa66d14&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/qe8y9RiDvCPN91d1zNhD9ouKNl7sAJoDO2Jd_bVo144.jpg?auto=webp&amp;s=8a2b493a907da05ca6c34709312fa8fe7c55dcce",
          "width": 140,
          "height": 140
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/qe8y9RiDvCPN91d1zNhD9ouKNl7sAJoDO2Jd_bVo144.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=aa2795918b84d01e25ec3e9781075b7d54553ef0",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "7qlA-aPG-3JP6tfRpCu5ycCTjMxK0M82IEh4LL46Ic4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/uul8o3/regulation_two_birds_one_stone_my_dark_maximalism/",
  "subreddit": "Bitcoin",
  "id": "uul8o3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Regulation is coming for altcoins. Most of the 17,000 will disappear. This is\nthe s-curve adoption shakeout we as bitcoiners have been warning about for\nyears. SEC Chair Gary Gensler met with the FTC on Wednesday, and again\nreiterated that bitcoin is NOT a security, but that \"Many, I'd say most of…"
}