{
  "author": "vrgkrly",
  "original_created_utc": 1629437067,
  "title": "Do men only enjoy rapid sex?",
  "created_utc": 1629460363,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a woman, I love to make love slowly, passionately. I enjoy taking it slow as if it would be cuddling with our whole naked bodeis that are melting into each another.</p>\n\n<p>But this exprerience is mostly only in my head with a few tastings I got because men I&#39;ve been with tend to get rapid, they move too fast.</p>\n\n<p>I tried to talk about this with a few of them and I gathered:\n- if they lost their virginity in a long term relationship, it&#39;s basically impossible to overwrite the things they learned with that partner. No matter how many times I tell them I like things this or that way, they keep doing things the way their exes (first girlfriends) liked.\n- their goal isn&#39;t to enjoy sex and have a great time during but to cum. They cannot comprehend that mine is the opposite or both.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/p7vszr/do_men_only_enjoy_rapid_sex/",
  "subreddit": "TooAfraidToAsk",
  "id": "p7vszr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a woman, I love to make love slowly, passionately. I enjoy taking it slow as\nif it would be cuddling with our whole naked bodeis that are melting into each\nanother.\n\nBut this exprerience is mostly only in my head with a few tastings I got because\nmen I've been with tend to get rapid, they move…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "女性としては、ゆっくりと情熱的に愛し合うことが好きです。抱き合うようにゆっくりとした時間を楽しみます。\n全身裸でお互いに溶け合うように寄り添うように\n寄り添うようにゆっくりと。\n\nしかし、この経験は、ほとんどが私の頭の中だけのものであり、以下のような理由で得られたいくつかの試練でもあります。\n私が今まで付き合ってきた男性は、急に動き出す傾向があるからです。",
      "title": "男性は急速なセックスしか楽しめないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个女人，我喜欢慢慢地、热情地做爱。我喜欢慢慢地做，就像\n仿佛是与我们整个赤裸的身体融为一体的拥抱。\n另一个。\n\n但这种体验主要是在我的脑海中，我得到了一些尝鲜的机会，因为\n和我在一起的男人往往会变得很快，他们的动作......",
      "title": "男人只享受快速的性爱吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個女人，我喜歡慢慢地、熱情地做愛。我喜歡慢慢地做，就像\n彷彿是與我們整個赤裸的身體融爲一體的擁抱。\n另一個。\n\n但這種體驗主要是在我的腦海中，我得到了一些嚐鮮的機會，因爲\n和我在一起的男人往往會變得很快，他們的動作......",
      "title": "男人只享受快速的性愛嗎？"
    }
  ]
}