{
  "author": "Ellikichi",
  "original_created_utc": 1626185058,
  "title": "A four year term as President of the United States seems pretty short today, and that's with jet planes and highways and cell phones and various other technological innovations. How did Presidents get anything done in the days when a diplomatic sea voyage could take weeks?",
  "created_utc": 1626209439,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Did Presidents do less back then?  Delegate more?  Did they have unique sources of information or lines of communication?  I realize I&#39;m talking about a really broad swath of time here, so I&#39;ll take what I can get.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/ojg8ys/a_four_year_term_as_president_of_the_united/",
  "subreddit": "AskHistorians",
  "id": "ojg8ys",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Did Presidents do less back then? Delegate more? Did they have unique sources of\ninformation or lines of communication? I realize I'm talking about a really\nbroad swath of time here, so I'll take what I can get.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "当時の大統領は何をしていたのか？より多くのことを委任していたのか？彼らは独自の情報源を持っていたか？\n独自の情報源やコミュニケーションラインを持っていたか？私は、ここでは本当に広い範囲の時間について話していることを理解しています。\n私はここで本当に幅広い時間について話していることを理解しているので、得られるものは得ておきます。",
      "title": "ジェット機や高速道路、携帯電話など、さまざまな技術革新が進む今日、アメリカの大統領の任期が4年というのは、かなり短いようです。外交のための船旅に何週間もかかっていた時代に、大統領はどうやって何かを成し遂げていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那时的总统们做得少吗？授权更多？他们是否有独特的信息来源\n信息或沟通渠道？我意识到我在谈论的是一个非常广泛的\n我意识到我在谈论的是一个非常广泛的时间段，所以我将采取我所能得到的。",
      "title": "今天，作为美国总统的四年任期似乎很短，而这是在喷气式飞机、高速公路、手机和其他各种技术创新的情况下。在一个外交海运可能需要数周时间的时代，总统们是如何完成任何事情的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那時的總統們做得少嗎？授權更多？他們是否有獨特的信息來源\n信息或溝通渠道？我意識到我在談論的是一個非常廣泛的\n我意識到我在談論的是一個非常廣泛的時間段，所以我將採取我所能得到的。",
      "title": "今天，作爲美國總統的四年任期似乎很短，而這是在噴氣式飛機、高速公路、手機和其他各種技術創新的情況下。在一個外交海運可能需要數週時間的時代，總統們是如何完成任何事情的？"
    }
  ]
}