{
  "author": "Supercharmeleon",
  "original_created_utc": 1634252556,
  "title": "What has crypto given you that you couldn't have gotten otherwise?",
  "created_utc": 1634297827,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In my case, the answer would be easy. I live in Argentina, where the economy is pure shit and our minimum wage is nothing compared to that of other countries. Aditionally, even if you were to make money, you can only buy a very limited amount of foreign currency per month, meaning you&#39;re stuck with your own constantly failing currency.</p>\n\n<p>And thanks to crypto, I was able to escape that.</p>\n\n<p>I also was only able to move out of my family&#39;s home and rent an apartment because of crypto. Without it, it would&#39;ve taken me years to get to this point. I&#39;m so grateful for crypto, and I expect it&#39;ll only continue to bless me in years to come.</p>\n\n<p>So what has crypto gotten you that you&#39;d never have gotten without it?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/q8avxs/what_has_crypto_given_you_that_you_couldnt_have/",
  "subreddit": "CryptoCurrency",
  "id": "q8avxs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In my case, the answer would be easy. I live in Argentina, where the economy is\npure shit and our minimum wage is nothing compared to that of other countries.\nAditionally, even if you were to make money, you can only buy a very limited\namount of foreign currency per month, meaning you're stuck with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の場合、その答えは簡単です。私はアルゼンチンに住んでいますが、経済は全くのクソで\nまた、仮にお金を稼いだとしても、買えるものは限られています。\nさらに、仮にお金を稼げたとしても、1ヶ月に買える外貨の量は非常に限られています。\nまた、仮にお金を稼いだとしても、1ヶ月に買える外貨の量は非常に限られていて、つまり...",
      "title": "暗号によって、他では得られないものを手に入れたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就我而言，答案很简单。我住在阿根廷，那里的经济是\n我们的最低工资与其他国家相比简直就是小巫见大巫。\n此外，即使你赚了钱，你每月只能购买非常有限的\n币，这意味着你只能用......。",
      "title": "加密货币给了你什么，而你在其他方面无法得到的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就我而言，答案很簡單。我住在阿根廷，那裏的經濟是\n我們的最低工資與其他國家相比簡直就是小巫見大巫。\n此外，即使你賺了錢，你每月只能購買非常有限的\n幣，這意味着你只能用......。",
      "title": "加密貨幣給了你什麼，而你在其他方面無法得到的？"
    }
  ]
}