{
  "author": "Layneeeee",
  "the_new_excerpt": "The following list contains every possible way I know to earn some actual, free\ncryptocurrencies. I avoided shady websites, apps that I didn't try personally,\nand those services that make you download shitty games and malwares. This list\ncontains only trusted services, without any referral…",
  "original_created_utc": 1613580263,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "以下列表包含了我知道的所有可能的方法来赚取一些实际的，免费的。\n加密货币。我避开了那些我没有亲自尝试过的黑幕网站、应用。\n以及那些让你下载低劣游戏和恶意软件的服务。这个列表\n只包含值得信赖的服务，没有任何推荐...",
      "title": "赚取免费Crypto的所有可能方法的集合。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下列表包含了我知道的所有可能的方法來賺取一些實際的，免費的。\n加密貨幣。我避開了那些我沒有親自嘗試過的黑幕網站、應用。\n以及那些讓你下載低劣遊戲和惡意軟件的服務。這個列表\n只包含值得信賴的服務，沒有任何推薦...",
      "title": "賺取免費Crypto的所有可能方法的集合。"
    }
  ],
  "title": "A collection of all the possible ways to earn free Crypto",
  "created_utc": 1613587428,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The following list contains every possible way I know to earn some actual, free cryptocurrencies. I avoided shady websites, apps that I didn&#39;t try personally, and those services that make you download shitty games and malwares. This list contains only trusted services, without any referral codes.</p>\n\n<p>If you think I missed something, please share it in the comments so that people can check that out as well!</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Coinbase Earn</strong> <strong>[about $30 in different cryptocurrencies]:</strong></p>\n\n<p>This is one of the most popular ways, although it is not really the quickest. You need a Coinbase account and to complete verification (so photo + document). Once you are verified, you will be put on a waiting list that usually lasts a couple of days. </p>\n\n<p>Once you get accepted, all you have to do is watch a video explaining how a project works, and answer some questions about it. It is not anything hard and you can find the answers online.</p>\n\n<p>Right now, you can earn XLM, COMP, CGLD, GRT, NU, but they often update it with a new project so definitely keep the account once verified.</p>\n\n<p><a href=\"https://www.coinbase.com/earn\">LINK</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>CoinMarketCap Earn</strong> <strong>[various cryptocurrencies]:</strong></p>\n\n<p>Basically the same as Coinbase Earn, but hosted by CoinMarketCap. For this, you&#39;ll need a CoinMarketCap account (just needs e-mail and password) and a verified Binance account (which requires verification, but there&#39;s no waiting list once verified). </p>\n\n<p>The payouts are slower than Coinbase Earn, since they are distributed after weeks and not immediately.</p>\n\n<p><a href=\"https://coinmarketcap.com/earn/\">LINK</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Faucets [various cryptocurrencies]:</strong></p>\n\n<p>This is one of the easiest and most immediate ways to get a small amount of crypto. You just need a wallet that can hold the coin and the relative address, and you&#39;re good to go.</p>\n\n<p>They&#39;re basically websites that distribute small amounts of cryptos to the users asking for it, and they&#39;re supported by donations/ads and stuff like that.</p>\n\n<p>There are a lot and you can often find them just by searching on Google &quot;&lt;name of the coin&gt; + faucet&quot;.</p>\n\n<p>A <a href=\"https://coinmarketcap.com/alexandria/article/what-is-a-crypto-faucet\">good read</a> about them and some examples: <a href=\"https://www.freenanofaucet.com/\">freenanofaucet</a> and <a href=\"https://www.dogefaucet.com/en\">Doge Faucet</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Airdrops [various cryptocurrencies]:</strong></p>\n\n<p>An airdrop, in the cryptocurrency business, is a marketing stunt that involves sending coins or tokens to wallet addresses in order to promote awareness of a new virtual currency. </p>\n\n<p>They can be free or they might require holding certain tokens or doing small tasks.</p>\n\n<p>Airdrops happen on many different platforms and for many different coins, so it&#39;s often hard to find them if you aren&#39;t familiar with the community or the platform. Anyway, <a href=\"https://Airdrops.io\">Airdrops.io</a> is a good website that gathers the best airdrops happening.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Bounties [various cryptocurrencies]:</strong></p>\n\n<p>In the crypto world, it is a marketing strategy where an ICO allocates a percentage of their tokens for “bounties”. These are tasks that are open to the public to complete and their reward is the new token that is launching. Once the token is launched, participants of the bounty will receive their tokens. </p>\n\n<p>As you may have noticed, they&#39;re similar to airdrops. As airdrops, it is often difficult to find them. <a href=\"https://beta.bounty0x.io/explore\">This</a> is a good website that gathers some bounties that are currently active.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>WeNano [NANO]:</strong></p>\n\n<p>This is one of my favorites, so I encourage you to check them out since the project is awesome.</p>\n\n<p>Have you ever played Pokémon Go? Well, this is a similar app, but instead of capturing Pokémon, spots are created by users around the world, and by visiting them you can earn NANO and chat with other users. The payouts are actually really good, especially in large cities, and the community around it is awesome.</p>\n\n<p><a href=\"https://www.wenano.net/\">This</a> is the official website (it&#39;s available both for Android and iOS)</p>\n\n<p>&#x200B;</p>\n\n<p><strong>NanoQuakeJs [NANO]:</strong></p>\n\n<p>Another favorite of mine. It&#39;s literally just Quake 3, on your browser, and for each kill you get some NANO. I challenge you to find something cooler.</p>\n\n<p><a href=\"https://nanoquakejs.com/\">This</a> is the website, you just need a nickname and a NANO address and you&#39;re good to go!</p>\n\n<p>There are some other similar projects, one of which is <a href=\"http://playerkillers.exchange/\">PlayerKillers</a>, but I mean, Quake is Quake.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Reddit [MOON, DOGE, NANO]:</strong></p>\n\n<p>Yeah, Reddit. There are actually a couple of ways to earn crypto on Reddit.</p>\n\n<p>First, our favorite, MOONs. You just need to set up your vault (on the app) and you&#39;re ready to receive moons next distribution! They happen once a month, and a fixed amount of moons are distributed to the <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> community, based on the Karma you gained that month. So start shitposting!</p>\n\n<p>Other subreddits, like Dogecoin&#39;s and Nano&#39;s have bots that allow you to tip users, so if you make a good submission there you&#39;ll probably receive some coins from kind redditors. </p>\n\n<p>Also, subs like <a href=\"/r/dogecoinbeg\">r/dogecoinbeg</a> exist, where you can... Well... Beg for dogecoins.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Publish0x [ETH]:</strong></p>\n\n<p>This is a really cool project that I personally love. It is basically a website like Medium, where users can post blog entries.</p>\n\n<p>The best thing about this is that the website provides the coins. You will literally earn crypto just by reading content on the website (which is crypto-related), sharing content and writing it (although you&#39;ll need to apply as an author to do so).</p>\n\n<p><a href=\"https://www.publish0x.com/\">LINK</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>SteemIt [STEEM]:</strong></p>\n\n<p>Steemit is a blogging and social media platform that uses blockchain technology and a cryptocurrency to reward its users for creating content, commenting, and upvoting other posts.  </p>\n\n<p>It is really similar to Reddit, <a href=\"https://steemit.com/\">here</a>&#39;s the link</p>\n\n<p><a href=\"https://beta.cent.co/%7Ediscover/\">Cent</a> is another similar social network built on top of Ethereum, worth checking out.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>NFT marketplaces [various cryptocurrencies]:</strong></p>\n\n<p>Many websites offer the possibility to sell artworks, collectibles and in general NFTs. NFT, for the newcomers, stands for Non-Fungible Token, and means a token representing something unique. </p>\n\n<p>You can think of it as an art piece: although you can copy it, scan it and print it, there will only be one original copy. NFTs are used to verify and confirm the uniqueness of something and its ownership. So, let&#39;s say I make a beautiful digital painting, I can &quot;link&quot; it to this token and whoever owns the token, owns the digital painting and can therefore sell it or trade it.</p>\n\n<p><a href=\"https://knownorigin.io/\">KnownOrigin</a>, <a href=\"https://mintable.app/\">Mintable</a>, <a href=\"https://rarible.com/\">Rarible</a> and <a href=\"https://opensea.io/\">OpenSea</a> are all great example of such marketplaces. If you&#39;re a creative person and want to sell some of your works, those are great places to do so. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Games and Collectibles [various cryptocurrencies]:</strong></p>\n\n<p>Many games run on a blockchain, using NFTs to create unique and rare in-game assets. Think of a card game like HeartStone: on the blockchain, it is possible to create only 10 cards of a specific type (using NFTs), so only 10 users in the world can own that card, so that card would extremely rare and therefore valuable.</p>\n\n<p>Usually, it is not easy to earn crypto this way, you&#39;ll need to play a bit before getting some good stuff that you can sell, but if you find a game that you like you can surely earn while having fun!</p>\n\n<p>Examples of games are <a href=\"https://www.mycryptoheroes.net/home\">MyCryptoHeroes</a>, <a href=\"https://everdragons.com/\">EverDragons</a>, <a href=\"https://axieinfinity.com/\">Axie Infinity</a>, <a href=\"https://decentraland.org/\">Decentraland</a> and <a href=\"https://bravefrontierheroes.com/\">Brave Frontier Heroes</a>.</p>\n\n<p>Some aren&#39;t even games at all, just collectibles that you can buy, trade and earn. Examples are <a href=\"https://www.cryptokitties.co/catalogue\">CryptoKitties</a> and <a href=\"https://clovers.network/\">Clovers</a></p>\n\n<p>&#x200B;</p>\n\n<p>Endnote: especially services using NFTs on top of Ethereum are, right now, subject to really high fees that make it often impossible to trade these tokens effectively. Be careful when doing a transaction.</p>\n\n<p>&#x200B;\n&#x200B;</p>\n\n<p>EDIT:\nSome I forgot or didn&#39;t know about:</p>\n\n<ul>\n<li><strong>Brave browser</strong>: allows you to earn BAT just by browsing and seeing ads. Both on PC and mobile.</li>\n<li><strong>ethtrader and fortniteBR</strong>: they&#39;re also subreddits with a governance tokens (like moons), so you can earn some money shitposting there too.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 4539,
  "permalink": "/r/CryptoCurrency/comments/llyq6e/a_collection_of_all_the_possible_ways_to_earn/",
  "subreddit": "CryptoCurrency",
  "id": "llyq6e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620220
}