{
  "author": "cscaggs",
  "the_new_excerpt": "As the title suggests, I read that central banks want to make their own coin.\n\nIt obviously angers me and we should all not only refuse to adopt the coin\nshould they create it, but we should demand they not be allowed to make one.\n\nThey’ve been getting by making free money every time they print fiat…",
  "original_created_utc": 1613110714,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所示，我读到央行要制造自己的硬币。\n\n这显然让我很愤怒，我们不仅要拒绝采用币种\n他们应该创造它，但我们应该要求他们 不允许制造一个。\n\n他们每次印钞票都是在赚免费的钱... ...",
      "title": "中央银行想要制造自己的加密货币。他们就是当初发明加密货币的该死的原因。为了结束暴政和BD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所示，我讀到央行要製造自己的硬幣。\n\n這顯然讓我很憤怒，我們不僅要拒絕採用幣種\n他們應該創造它，但我們應該要求他們 不允許製造一個。\n\n他們每次印鈔票都是在賺免費的錢... ...",
      "title": "中央銀行想要製造自己的加密貨幣。他們就是當初發明加密貨幣的該死的原因。爲了結束暴政和BD"
    }
  ],
  "title": "Central Banks Want to make their own crypto. They’re the f*cking reason crypto was invented in the first place. To end the tyranny and BD",
  "created_utc": 1613136722,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title suggests, I read that central banks want to make their own coin. </p>\n\n<p>It obviously angers me and we should all not only refuse to adopt the coin should they create it, but we should demand they not be allowed to make one. </p>\n\n<p>They’ve been getting by making free money every time they print fiat currency for any nation.  Ever since people stop trading shit for other shit and started trading money for things central banks have been ripping everyone off.</p>\n\n<p>It’s funny because at first they acted like crypto was never going to be a thing, then they wanted a piece of the action, and now they want to control it again. I say hell no.</p>\n\n<p>I’m sure somebody’s gonna tell me to calm down, and they’ll be right, but i’m passionate about stuff like this when it comes to putting the power back in the peoples hands</p>\n</div><!-- SC_ON -->",
  "score": 903,
  "permalink": "/r/CryptoCurrency/comments/li5ad6/central_banks_want_to_make_their_own_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "li5ad6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728615773
}