{
  "author": "superkewlnamebro",
  "the_new_excerpt": "Look into this yourself and then please go ask them about these issues in their\ntelegram channel. Ask enough questions and you will get banned.\n\nEarlier today i was told to purchase Cook.Finance [https://cook.finance/], that\nis about to \"take off\" to the moon. I googled it and went to their…",
  "original_created_utc": 1617329508,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "自己看看，然后请去问他们这些问题，在他们的。\n电报频道。问够了问题，你会被禁止。\n\n今天早些时候，我被告知要购买Cook.Finance[https://cook.finance/]，那就是\n即将 \"起飞 \"到月球。我上网查了一下，去他们的...。",
      "title": "注意：Cook.Finance是100%的骗局。这些都是简单的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自己看看，然後請去問他們這些問題，在他們的。\n電報頻道。問夠了問題，你會被禁止。\n\n今天早些時候，我被告知要購買Cook.Finance[https://cook.finance/]，那就是\n即將 \"起飛 \"到月球。我上網查了一下，去他們的...。",
      "title": "注意：Cook.Finance是100%的騙局。這些都是簡單的原因。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "自分で調べてから、その問題点を彼らに聞いてみてください。\nテレグラムチャンネルで聞いてみてください。十分な質問をすれば、あなたは禁止されます。\n\n今日の午前中、私はCook.Finance [https://cook.finance/]を購入するように言われました。\n月に向かって \"飛び立とうとしている \"Cook.Financeを購入するように言われました。私はそれをグーグルで検索し、彼らの...",
      "title": "ご注意：Cook.Financeは100％詐欺です。その理由は以下の通りです。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "自分で調べてから、その問題点を彼らに聞いてみてください。\nテレグラムチャンネルで聞いてみてください。十分な質問をすれば、あなたは禁止されます。\n\n今日の午前中、私はCook.Finance [https://cook.finance/]を購入するように言われました。\n月に向かって \"飛び立とうとしている \"Cook.Financeを購入するように言われました。私はそれをグーグルで検索し、彼らの...",
      "title": "ご注意：Cook.Financeは100％詐欺です。その理由は以下の通りです。"
    }
  ],
  "title": "BEWARE: Cook.Finance is 100% a scam. These are the simple reasons why.",
  "created_utc": 1617353282,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look into this yourself and then please go ask them about these issues in their telegram channel.  Ask enough questions and you will get banned.</p>\n\n<p>Earlier today i was told to purchase <a href=\"https://cook.finance/\">Cook.Finance</a>, that is about to &quot;take off&quot; to the moon. I googled it and went to their website mainly to view the team. The entire team went to great schools and show great careers on linkedin. So i decided to google them to see if I could get any more information about them. You cant. They do not exist. After the second or third person bringing back nothing i decided to check and see if any of them had actually graduated from the University they claimed to have attended. None. Not a single person on this <a href=\"https://cook.finance/\">Cook.Finance</a> team had graduated from the University on their linkedin profile page. I assume they never attended because again they do not exist.</p>\n\n<p>The next thing to do was to reverse image search their linkedin profile to see what social media website it came from. Guess what? The reverse image search for every single team member returned nothing. It did not even return the linkedin profile picture i was searching. This almost certainly means the profiles were created recently and the crawler has not gotten to it yet. Either that or its a massive coincidence that not a single person on the team has had the crawler hit them over many years and every single one of them used a picture that has never existed before on a social media website.</p>\n\n<p>Those first two things alone are pretty damning themselves but I wanted to see what people directly tied to this coin would say about that so i visited the telegram channel which is by far the most active &quot;community&quot; for this coin. I went in and told them that i had reverse searched the profile pictures and gotten zero hits and also that it appeared that not a single one of them had actually graduated from the university they had on their profiles.</p>\n\n<p>I WAS BANNED.</p>\n\n<p>They banned me for asking those two questions. Someone responded to me &quot;let me check&quot; and a couple minutes after that i was banned. I can post the screen shots of the questions as well the account no longer able to access the channel.</p>\n\n<p>This coin is 100% a pump and dump scam.</p>\n\n<p>EDIT: very minimal edit.  i noticed that a couple of the teams linkedin pictures return their profile link to linkedin.  However, there are still a number that do not return anything.  This does not change my view</p>\n</div><!-- SC_ON -->",
  "score": 442,
  "permalink": "/r/CryptoCurrency/comments/miaoct/beware_cookfinance_is_100_a_scam_these_are_the/",
  "subreddit": "CryptoCurrency",
  "id": "miaoct",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875615
}