{
  "author": "123uga",
  "original_created_utc": 1637012517,
  "title": "Are You Still Following The \"Only Invest In Crypto What You Can Lose\" Rule?",
  "created_utc": 1637076650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyone knows the first rule of crypto is &quot;only invest what you feel comfortable completely losing.&quot; I certainly started out following that rule and was terrified of putting in too much money (or telling my wife I had anything invested in crypto for that matter). Over the past few months I&#39;ve noticed that I seem to only apply that to investments in non-blue chips. Don&#39;t get me wrong, I won&#39;t have to sell my house if the market crashes and I don&#39;t mess with leverage, but I just don&#39;t feel like BTC/ETH/LINK and a few others (probably ALGO, maybe Moons) are at a very high risk of going to zero.</p>\n\n<p>It may be stupid or naïve of me, but it feels like there&#39;s so much more institutional support and news coverage for the big names than there used to be that a 100% loss on those couple of coins feels unlikely. I&#39;m still following the old rule for ERG/MATIC/ONE/TIME/etc. though. Is anybody else doing this too? Am I just an idiot who&#39;s on a path that leads to selling both kidneys? I understand the audience that&#39;s going to read this, but I&#39;m here for the confirmation bias, not sound financial advice.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/qur83l/are_you_still_following_the_only_invest_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qur83l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyone knows the first rule of crypto is \"only invest what you feel\ncomfortable completely losing.\" I certainly started out following that rule and\nwas terrified of putting in too much money (or telling my wife I had anything\ninvested in crypto for that matter). Over the past few months I've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが知っている暗号の最初のルールは、\"完全に失ってもいいと思うものだけを投資する \"ことです。\n投資すること \"です。私も最初はこのルールに従っていましたし\n大金を投入すること（あるいは妻に暗号に投資していることを告げること）を恐れていました。\n恐れていました。） この数ヶ月間、私は...",
      "title": "あなたはまだ「失う可能性のあるものだけをCryptoに投資する」というルールを守っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个人都知道加密货币的第一条规则是 \"只投资你觉得可以完全失去的东西。\n完全失去的东西\"。我一开始当然是遵循这条规则，并且\n害怕投入太多资金（或告诉我妻子我有任何投资在加密货币上）。\n或告诉我的妻子我有投资于加密货币的东西）。在过去的几个月里，我已经...",
      "title": "你还在遵循 \"只投资于你可能失去的东西 \"的规则吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人都知道加密貨幣的第一條規則是 \"只投資你覺得可以完全失去的東西。\n完全失去的東西\"。我一開始當然是遵循這條規則，並且\n害怕投入太多資金（或告訴我妻子我有任何投資在加密貨幣上）。\n或告訴我的妻子我有投資於加密貨幣的東西）。在過去的幾個月裏，我已經...",
      "title": "你還在遵循 \"只投資於你可能失去的東西 \"的規則嗎？"
    }
  ]
}