{
  "author": "KwizicalKiwi",
  "the_new_excerpt": "I originally only knew of the one and I thought it was maybe catching her in a\nmoment of thought. But then I saw a couple more of two other ladies holding the\nstylus to their mouths in the exact same way. Is there a reason they are posing\nthis way? Does it have some kind d of meaning? Or was it just…",
  "original_created_utc": 1619313731,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は元々1つしか知らないので、もしかしたら彼女の考えている瞬間を捉えているのかもしれないと思いました。\nと思っていました。しかし、その後、他の2人の女性が全く同じようにタッチペンを口に当てているのを見たのです。\n全く同じようにタッチペンを口に当てている女性が何人かいました。このポーズには何か理由があるのでしょうか？\n理由があるのだろうか？何か意味があるのだろうか？それとも、ただの...",
      "title": "ポンペイのフレスコ画に描かれた数人の女性が、なぜスタイラスを口に当てているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我原来只知道一个，我想这可能是抓住了她的一个想法。\n思考的时刻。但后来我又看到了另外两位女士用完全相同的方式将触笔放在嘴边。\n以完全相同的方式将触笔放在嘴边。她们摆出这样的姿势有什么原因吗？\n这种方式？这是否有某种意义？还是说这只是...",
      "title": "为什么庞贝城壁画中的几位女士将钢笔放在嘴边？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我原來只知道一個，我想這可能是抓住了她的一個想法。\n思考的時刻。但後來我又看到了另外兩位女士用完全相同的方式將觸筆放在嘴邊。\n以完全相同的方式將觸筆放在嘴邊。她們擺出這樣的姿勢有什麼原因嗎？\n這種方式？這是否有某種意義？還是說這只是...",
      "title": "爲什麼龐貝城壁畫中的幾位女士將鋼筆放在嘴邊？"
    }
  ],
  "title": "Why are a few of the ladies in the frescoes of Pompeii holding the styluses to their mouths?",
  "created_utc": 1619372136,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I originally only knew of the one and I thought it was maybe catching her in a moment of thought. But then I saw a couple more of two other ladies holding the stylus to their mouths in the exact same way. Is there a reason they are posing this way? Does it have some kind d of meaning? Or was it just a popular way to pose for a portrait? Stylus to mouth <a href=\"https://imgur.com/gallery/bNdSAd6\">https://imgur.com/gallery/bNdSAd6</a></p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/mxxpmb/why_are_a_few_of_the_ladies_in_the_frescoes_of/",
  "subreddit": "AskHistorians",
  "id": "mxxpmb",
  "is_self": true,
  "media": null,
  "is_video": false
}