{
  "author": "Jhtpo",
  "original_created_utc": 1634585452,
  "title": "How would I give directions to earth?",
  "created_utc": 1634622851,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hypothetical. I wake up on an alien space station. We can communicate fine, and I judge them to be good people, no threat to humanity. But I need to get home. </p>\n\n<p>I know I&#39;m in the Milky Way. I don&#39;t know how long I&#39;ve been asleep. \nThey know most of the galaxy by documentation of it&#39;s visable properties at minimum, but given specifics they can narrow their search. </p>\n\n<p>What information could I provide them, if any, to point them back to Sol? Or are things too much in motion to use anything as a reference?</p>\n\n<p>Thanks,</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askscience/comments/qau2u6/how_would_i_give_directions_to_earth/",
  "subreddit": "askscience",
  "id": "qau2u6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hypothetical. I wake up on an alien space station. We can communicate fine, and\nI judge them to be good people, no threat to humanity. But I need to get home.\n\nI know I'm in the Milky Way. I don't know how long I've been asleep. They know\nmost of the galaxy by documentation of it's visable…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仮定の話。目覚めたらエイリアンの宇宙ステーションにいた。意思疎通は問題なくできていて\n彼らは善良な人々であり、人類にとって脅威ではないと判断した。しかし、私は家に帰らなければならない。\n\n自分が天の川の中にいることはわかっている。どれくらい眠っていたのかはわからない。彼らは\n銀河系のほとんどは、目に見えるドキュメントで...",
      "title": "地球への道案内はどうすればいいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设性的。我在一个外星空间站醒来。我们可以很好地交流，而且\n我判断他们是好人，对人类没有威胁。但是我需要回家。\n\n我知道我在银河系中。我不知道我已经睡了多久。他们知道\n他们知道大部分的银河系都是以文件形式存在的... ...",
      "title": "我将如何给地球指路？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設性的。我在一個外星空間站醒來。我們可以很好地交流，而且\n我判斷他們是好人，對人類沒有威脅。但是我需要回家。\n\n我知道我在銀河系中。我不知道我已經睡了多久。他們知道\n他們知道大部分的銀河系都是以文件形式存在的... ...",
      "title": "我將如何給地球指路？"
    }
  ]
}