{
  "author": "Smoked-939",
  "original_created_utc": 1630809682,
  "title": "I’ve heard about it, but what exactly *is* fascism?",
  "created_utc": 1630824860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now, before you kill me for not knowing I want to say I know that fascism is bad, but not why. Obviously, Hitler, but I don’t recall any particularly bad things from Mussolini or Franco’s regime, not like the Holocaust at least, so what exactly is it? What does it entail, like policies, freedoms etc. how was Mussolini’s regime different from Franco’s and that from Hitler’s?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pi4x8r/ive_heard_about_it_but_what_exactly_is_fascism/",
  "subreddit": "AskHistorians",
  "id": "pi4x8r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Now, before you kill me for not knowing I want to say I know that fascism is\nbad, but not why. Obviously, Hitler, but I don’t recall any particularly bad\nthings from Mussolini or Franco’s regime, not like the Holocaust at least, so\nwhat exactly is it? What does it entail, like policies, freedoms…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、知らないからといって殺される前に言っておくと、私はファシズムが\n悪いものだということは知っていますが、その理由は知りません。ヒトラーはもちろんですが、ムッソリーニやフランコの政権で特に悪いことをしたという記憶はありません。\nムッソリーニやフランコの政権で特に悪いことをした記憶はないし、少なくともホロコーストのようなものではない。\nそれは一体何なのか？政策や自由など、何を必要としているのか。",
      "title": "聞いたことはありますが、ファシズムとは一体何なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，在你因为我不知道而杀了我之前，我想说我知道法西斯主义是\n坏，但不知道为什么。很明显，希特勒，但我不记得墨索里尼或佛朗哥政权有什么特别糟糕的事情。\n但我不记得墨索里尼或佛朗哥政权有什么特别糟糕的事情，至少不像大屠杀那样，所以\n它到底是什么？它带来了什么，比如政策、自由......",
      "title": "我听说过它，但究竟什么是*法西斯主义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，在你因爲我不知道而殺了我之前，我想說我知道法西斯主義是\n壞，但不知道爲什麼。很明顯，希特勒，但我不記得墨索里尼或佛朗哥政權有什麼特別糟糕的事情。\n但我不記得墨索里尼或佛朗哥政權有什麼特別糟糕的事情，至少不像大屠殺那樣，所以\n它到底是什麼？它帶來了什麼，比如政策、自由......",
      "title": "我聽說過它，但究竟什麼是*法西斯主義？"
    }
  ]
}