{
  "author": "Alert32",
  "original_created_utc": 1636781055,
  "title": "Was it legal for a British newspaper or person to openly and publically support the Patriots/Americans during the Revolutionary War in Great Britain? Or was this considered treason?",
  "created_utc": 1636814564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Could I, as a random person on the street, go to a public area or pub and openly say the colonists should be independent (disregarding how well-received that would be by my peers)? Could I criticize the British Army&#39;s deployment overseas? Would I get censored by the government if I tried to publish my support for the colonists or disdain for the Loyalists?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qsu7h5/was_it_legal_for_a_british_newspaper_or_person_to/",
  "subreddit": "AskHistorians",
  "id": "qsu7h5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Could I, as a random person on the street, go to a public area or pub and openly\nsay the colonists should be independent (disregarding how well-received that\nwould be by my peers)? Could I criticize the British Army's deployment overseas?\nWould I get censored by the government if I tried to publish…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、道行く無関係な人として、公共の場所やパブに行って、公然と\n植民地人は独立すべきだと言えるでしょうか（それが同業者にどれだけ受け入れられるかは別として\n周りの評判はともかく）。イギリス軍の海外派遣を批判することはできますか？\n私が出版しようとしたら、政府の検閲を受けるだろうか？",
      "title": "英国での独立戦争中に、英国の新聞社や個人が公然と愛国者／アメリカ人を支援することは合法でしたか？それとも、それは反逆罪とみなされたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可以作为街上的一个普通人，到公共场所或酒馆里公开说\n说殖民者应该独立（不考虑这句话在同龄人中会有多大的反响）？\n不考虑我的同龄人会怎么看）？我可以批评英国军队的海外部署吗？\n如果我试图发表......我会不会被政府审查？",
      "title": "大不列颠革命战争期间，英国报纸或个人公开支持爱国者/美国人的行为是否合法？或者这被认为是叛国？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以作爲街上的一個普通人，到公共場所或酒館裏公開說\n說殖民者應該獨立（不考慮這句話在同齡人中會有多大的反響）？\n不考慮我的同齡人會怎麼看）？我可以批評英國軍隊的海外部署嗎？\n如果我試圖發表......我會不會被政府審查？",
      "title": "大不列顛革命戰爭期間，英國報紙或個人公開支持愛國者/美國人的行爲是否合法？或者這被認爲是叛國？"
    }
  ]
}