{
  "author": "throwaway48593582",
  "original_created_utc": 1633010124,
  "title": "[NSFW] Is it bad for me, as an adult man, to be crying in my GF's arms after sex?",
  "created_utc": 1633029473,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 31/M, before this week I was a virgin. Lots of history of anxiety and depression. I&#39;ve been dating this girl [29/F] for about a month, I&#39;ve been open with her from the beginning about where I&#39;m coming from and she&#39;s been super great and patient with me getting more comfortable going further. I started giving her oral last week, and she said I was the best oral giver she&#39;s ever been with before. I know she&#39;s just saying that to boost my ego (I&#39;ve read books on sex and giving good head to a girl, but there&#39;s no way a virgin guy beat out her previous partners with vastly more sexual experience) but it still felt great that my gf cared about me enough to try to boost my ego.</p>\n\n<p>I lost my virginity with her last night. I initially felt absolutely ridiculous and humiliated as we were thrusting in missionary position, but eventually I got myself into the mode of &quot;I&#39;m with a girl I care deeply for, it&#39;s ok to be vulnerable around her&quot; and was able to finish. As I cuddled with her after, a wave of emotion came over me and I cried. I apologized for crying but she held me close and told me no to worry, placed my head on her chest, and to &quot;let it all out&quot;. So I did as she said, I didn&#39;t hold back the tears and cried for several minutes. We talked about it after and she tried to (gently) pry into my emotions a bit, I had difficulty putting things in words other than &quot;I&#39;ve never felt more happy, loved, vulnerable, and accepted before&quot;. She smiled and we fell asleep together.</p>\n\n<p>Is this... normal? Is it bad for me to cry like this in front of my girlfriend? I worry she&#39;s just being polite, but that this is weird shit to be throwing on her.</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/pyka52/nsfw_is_it_bad_for_me_as_an_adult_man_to_be/",
  "subreddit": "NoStupidQuestions",
  "id": "pyka52",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm 31/M, before this week I was a virgin. Lots of history of anxiety and\ndepression. I've been dating this girl [29/F] for about a month, I've been open\nwith her from the beginning about where I'm coming from and she's been super\ngreat and patient with me getting more comfortable going further. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は31/Mで、今週までは童貞でした。不安や鬱の経験が多い\nうつ病を患っています。この子（29/F）とは1ヶ月ほど前から付き合っていますが、私はオープンにしています。\n彼女は僕がどこから来たのかを最初からオープンにしていて、僕がより快適に過ごせるように、とても素晴らしく、忍耐強くサポートしてくれました。\n彼女はとても素晴らしく、僕がもっと快適に過ごせるように辛抱強くサポートしてくれています。I...",
      "title": "[NSFW】大人の男として、セックスの後にGFの腕の中で泣いているのは悪いことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是31/M，在这周之前我还是个处女。有很多焦虑和抑郁的历史。\n抑郁症。我和这个女孩[29/F]约会了大约一个月，我从一开始就对她公开了我的想法。\n我从一开始就对她公开了我的来历，她对我超级好，很有耐心，让我越来越舒服。\n她对我很好，而且很有耐心，让我越来越舒服，越走越远。I...",
      "title": "[NSFW]作为一个成年男人，我在做爱后在GF的怀里哭泣，这对我来说不好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是31/M，在這周之前我還是個處女。有很多焦慮和抑鬱的歷史。\n抑鬱症。我和這個女孩[29/F]約會了大約一個月，我從一開始就對她公開了我的想法。\n我從一開始就對她公開了我的來歷，她對我超級好，很有耐心，讓我越來越舒服。\n她對我很好，而且很有耐心，讓我越來越舒服，越走越遠。I...",
      "title": "[NSFW]作爲一個成年男人，我在做愛後在GF的懷裏哭泣，這對我來說不好嗎？"
    }
  ]
}