{
  "author": "da_f3nix",
  "the_new_excerpt": "At the moment in which I'm writing the global crypto market cap is $\n957,181,215,280. Another 4,473% increase will make us reach the TRILLION. We\nshould all celebrate, no matter what are our bags and flags. We are witnessing\nthe rise of something that will go beyond the economical aspect, which…",
  "original_created_utc": 1609944249,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在我写这篇文章的时候，全球密码市值是$\n957,181,215,280.再增加4473%将使我们达到万亿。我们\n不管我们的袋子和旗帜是什么，都应该庆祝。我们正在见证\n超越经济层面的东西的兴起，这就是…",
      "title": "万亿就快到了！让我们准备庆祝即将到来的整体加密货币市值目标。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我寫這篇文章的時候，全球密碼市值是$\n957,181,215,280.再增加4473%將使我們達到萬億。我們\n不管我們的袋子和旗幟是什麼，都應該慶祝。我們正在見證\n超越經濟層面的東西的興起，這就是…",
      "title": "萬億就快到了！讓我們準備慶祝即將到來的整體加密貨幣市值目標。"
    }
  ],
  "title": "The TRILLION is near! Let's prepare to celebrate the approaching goal for the overall cryptocurrencies' market cap.",
  "created_utc": 1609962824,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At the moment in which I&#39;m writing the global crypto market cap is $ 957,181,215,280.\nAnother 4,473% increase will make us reach the TRILLION.\nWe should all celebrate, no matter what are our bags and flags. We are witnessing the rise of something that will go beyond the economical aspect, which is obviously important for us and out dear ones. Something that -hopefully- will help reshape this society. \nIn my family, I feel that my parents and me missed several trains (where I live there was an awesome period for buying land), but we didn&#39;t miss this crypto revolution: we are on this train and nothing will make us jump out of it, no matter how nice the next station could look. It&#39;s a great moment to be alive, my friends. Congrats to all for the incoming trillion.</p>\n</div><!-- SC_ON -->",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/krp68i/the_trillion_is_near_lets_prepare_to_celebrate/",
  "subreddit": "CryptoCurrency",
  "id": "krp68i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100746085
}