{
  "author": "th3empirial",
  "original_created_utc": 1635155824,
  "title": "Why do girls on dating apps mention not liking pics of guys holding fish?",
  "created_utc": 1635167062,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seems like a pretty nice hobby, whats wrong with fishing? Is it just about not liking anything related to catching/hunting animals? I doubt they are all vegan or something. Or is it that guys that do that are perceived as conservative? In either case, feels like girls wouldn’t mind if their boyfriend owned a boat, and fishing is one of the things you can do on it. Just seems like an odd hobby to single out, only one I’ve seen consistently get mentioned</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/qfda9q/why_do_girls_on_dating_apps_mention_not_liking/",
  "subreddit": "TooAfraidToAsk",
  "id": "qfda9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seems like a pretty nice hobby, whats wrong with fishing? Is it just about not\nliking anything related to catching/hunting animals? I doubt they are all vegan\nor something. Or is it that guys that do that are perceived as conservative? In\neither case, feels like girls wouldn’t mind if their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いい趣味だと思いますが、釣りのどこが悪いのでしょうか？単に動物を捕まえる/狩ることに関連したものが好きではないということでしょうか？\n動物を捕まえること、狩ることが好きではないということでしょうか？菜食主義者ばかりではないでしょう。\nだろうか？それとも、そういうことをする人は保守的だと思われているのでしょうか？どちらにしても\nどちらにしても、女の子は自分の...を気にしないような気がします。",
      "title": "デートアプリの女の子は、なぜ魚を持っている男の写真を好まないと言うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎是一个相当不错的爱好，钓鱼有什么问题吗？难道只是因为不\n喜欢任何与捕捉/狩猎动物有关的东西？我怀疑他们都是素食主义者\n或其他什么。或者是这样做的人被认为是保守的？在\n无论是哪种情况，感觉女孩都不会介意他们的...",
      "title": "为什么约会软件上的女孩会提到不喜欢男人拿着鱼的照片？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎是一個相當不錯的愛好，釣魚有什麼問題嗎？難道只是因爲不\n喜歡任何與捕捉/狩獵動物有關的東西？我懷疑他們都是素食主義者\n或其他什麼。或者是這樣做的人被認爲是保守的？在\n無論是哪種情況，感覺女孩都不會介意他們的...",
      "title": "爲什麼約會軟件上的女孩會提到不喜歡男人拿着魚的照片？"
    }
  ]
}