{
  "author": "doomslothx",
  "original_created_utc": 1638838029,
  "title": "Why is the market green!? What’s going on!?",
  "created_utc": 1638852189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry couldn’t help posting an irony post about green markets. So much panic over the last week and a bit due to red but you never see any panic posts about green markets (/s). &lt;/p&gt;\n\n&lt;p&gt;I wonder how many of you who panicked during the red have relaxed? How are you feeling now, are you calmer? How are you going to try and handle the next 20-25% “crash/dip” and are you going to try and learn from our recent experience? Genuinely curious because this sub was littered with freak out posts so wondering what people took away from it retrospectively.&lt;/p&gt;\n\n&lt;p&gt;Those that sold in the correction - how are you feeling?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 275,
  "permalink": "/r/CryptoCurrency/comments/ramfg5/why_is_the_market_green_whats_going_on/",
  "subreddit": "CryptoCurrency",
  "id": "ramfg5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sorry couldn’t help posting an irony post about green markets. So much panic\nover the last week and a bit due to red but you never see any panic posts about\ngreen markets (/s).\n\nI wonder how many of you who panicked during the red have relaxed? How are you\nfeeling now, are you calmer? How are you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "グリーンマーケットについての皮肉な投稿をせずにはいられなかったのが残念です。多くのパニック\nこの1週間と少し、赤のせいでパニックになったが、パニックに関する書き込みは全く見かけない。\nグリーンマーケット(/s)。\n\n赤の時にパニックになった人の中で、落ち着いた人はどれくらいいるんだろう？どうなんでしょう？\n今の気分は、落ち着いているのでしょうか？どうですか...",
      "title": "なぜマーケットはグリーンなのか！？どうなっているんだ！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，忍不住发了一个关于绿色市场的讽刺帖子。如此多的恐慌\n但你从来没有看到过关于绿色市场的任何恐慌性帖子。\n绿色市场(/s)。\n\n我想知道有多少在红色期间恐慌的人已经放松了？你是如何\n现在感觉如何，你平静了吗？你是如何...",
      "title": "为什么市场是绿色的！？发生了什么事！？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，忍不住發了一個關於綠色市場的諷刺帖子。如此多的恐慌\n但你從來沒有看到過關於綠色市場的任何恐慌性帖子。\n綠色市場(/s)。\n\n我想知道有多少在紅色期間恐慌的人已經放鬆了？你是如何\n現在感覺如何，你平靜了嗎？你是如何...",
      "title": "爲什麼市場是綠色的！？發生了什麼事！？"
    }
  ]
}