{
  "author": "7LayerMagikCookieBar",
  "original_created_utc": 1641312014,
  "title": "Solana did not go down yesterday. It was still processing more than Ethereum and Bitcoin.",
  "created_utc": 1641324734,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure what is up with the modding here but it allows completely incorrect FUD to persist here. Solana never went down yesterday but did suffer from being a lot slower than normal, with bot spam of high compute transactions crowding blockspace. Blocks included votes as usual and less transactions than normal but tps also doesn&amp;#39;t have much nuance since a Raydium transaction requires over 100x the compute of many Serum transactions, which means bots spamming Raydium transaction take up a lot of compute. The transaction fee model that they are moving to will take into account compute which will hopefully disincentivize spamming better. There are inefficiencies related to processing these more complex transactions which Solana Labs and contributors are working on addressing. Solana still does nearly 100k tps on testnet ddos tests but with transfer type transactions. &lt;/p&gt;\n\n&lt;p&gt;If you want to explore the actual blocks during the supposed outage yesterday you can use Solana Explorer to do so. Blocks included votes and a lesser amount of transactions -- &amp;quot;failed&amp;quot; transactions are not transactions which are in Solana&amp;#39;s version of a mempool, which sometimes has over a million transactions waiting. A failed transaction can occur due a person not having required balance for example -- and failed transactions still pay a fee. &lt;a href=\"https://explorer.solana.com/block/114782725\"&gt;https://explorer.solana.com/block/114782725&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Lastly, Solana never &amp;quot;turned off&amp;quot; the network in September. If you think so you have been badly misinformed.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://jumpcrypto.com/reflections-on-the-sept-14-solana-outage/\"&gt;https://jumpcrypto.com/reflections-on-the-sept-14-solana-outage/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/rvxoyk/solana_did_not_go_down_yesterday_it_was_still/",
  "subreddit": "CryptoCurrency",
  "id": "rvxoyk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm not sure what is up with the modding here but it allows completely incorrect\nFUD to persist here. Solana never went down yesterday but did suffer from being\na lot slower than normal, with bot spam of high compute transactions crowding\nblockspace. Blocks included votes as usual and less…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここの改造はどうなっているのかわからないが、完全に不正解を許してしまう\nここでFUDが続くのは 昨日はSolanaがダウンすることはありませんでした。\n通常よりかなり遅く、高コンピュートトランザクションのボットスパムが混雑して\nブロックスペース。ブロックには通常通り投票が含まれており、少ない...",
      "title": "昨日はソラナが降りなかった。まだイーサリアムやビットコイン以上の処理をしていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道这里的修改是怎么回事，但它允许完全不正确的\n谣言在这里持续存在。昨天Solana没有瘫痪，但确实遭受了\n比正常情况下慢得多，高计算交易的机器人垃圾邮件挤满了\n区块空间。区块包括像往常一样的投票和较少的...",
      "title": "索拉纳昨天没有下场。它的处理量仍然超过了以太坊和比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道這裏的修改是怎麼回事，但它允許完全不正確的\n謠言在這裏持續存在。昨天Solana沒有癱瘓，但確實遭受了\n比正常情況下慢得多，高計算交易的機器人垃圾郵件擠滿了\n區塊空間。區塊包括像往常一樣的投票和較少的...",
      "title": "索拉納昨天沒有下場。它的處理量仍然超過了以太坊和比特幣。"
    }
  ]
}