{
  "author": "jelvinjs7",
  "original_created_utc": 1635963682,
  "title": "Medieval Christian scholars believed that each of the \"three\" continents were populated by the descendants of Noah's sons after the Flood (Japheth's in Europe, Shem's in Asia, Ham's in Africa). When they realized there were more populated continents, how did they modify this theory?",
  "created_utc": 1636010537,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can&#39;t seem to find anything on where indigenous Australians fit into this genealogy. It seems Native Americans were placed under the line of Shem, but I&#39;m unclear of what the basis for that is?</p>\n\n<p>Tangential side-question: did Jewish or Islamic scholars have the same theories and reactions, or were they notably different?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qm0ovo/medieval_christian_scholars_believed_that_each_of/",
  "subreddit": "AskHistorians",
  "id": "qm0ovo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can't seem to find anything on where indigenous Australians fit into this\ngenealogy. It seems Native Americans were placed under the line of Shem, but I'm\nunclear of what the basis for that is?\n\nTangential side-question: did Jewish or Islamic scholars have the same theories\nand reactions, or were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オーストラリアの先住民がこの系図のどこに当てはまるのか、何も見つけられないようです。\nこの系譜の中で、オーストラリアの先住民がどのような位置を占めているのか、ということがわかりません。ネイティブアメリカンはセムの系譜の下に置かれたようですが\nその根拠は何なのでしょうか？\n\n余談ですが、ユダヤ人やイスラム人の学者も同じような理論や反応をしていたのでしょうか？\n反応していたのでしょうか、、、。",
      "title": "中世のキリスト教学者たちは、大洪水後のノアの息子たちの子孫（ヨーロッパのヤペテ、アジアのセム、アフリカのハム）が、それぞれの「3」大陸に住んでいると考えていた。しかし、もっと多くの人が住んでいる大陸があることに気づいた彼らは、この説をどのように修正したのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我似乎找不到任何关于澳大利亚土著人在这一领域的地位的资料。\n族谱。似乎美国原住民被置于闪一脉之下，但我不清楚其依据是什么？\n但我不清楚这种说法的依据是什么？\n\n题外话：犹太或伊斯兰学者是否也有同样的理论和反应？\n和反应，或者是...",
      "title": "中世纪的基督教学者认为，\"三块 \"大陆中的每一块都是由诺亚的儿子们在大洪水后的后代居住的（雅弗的在欧洲，闪的在亚洲，含的在非洲）。当他们意识到还有更多人口居住的大陆时，他们是如何修改这一理论的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我似乎找不到任何關於澳大利亞土著人在這一領域的地位的資料。\n族譜。似乎美國原住民被置於閃一脈之下，但我不清楚其依據是什麼？\n但我不清楚這種說法的依據是什麼？\n\n題外話：猶太或伊斯蘭學者是否也有同樣的理論和反應？\n和反應，或者是...",
      "title": "中世紀的基督教學者認爲，\"三塊 \"大陸中的每一塊都是由諾亞的兒子們在大洪水後的後代居住的（雅弗的在歐洲，閃的在亞洲，含的在非洲）。當他們意識到還有更多人口居住的大陸時，他們是如何修改這一理論的？"
    }
  ]
}