{
  "author": "epsilonal",
  "original_created_utc": 1645361220,
  "title": "Since the sun's upper atmosphere is hotter than the surface, and we've already sent spacecraft through the upper atmosphere - what is stopping us from sending a spacecraft close to the surface of the sun?",
  "created_utc": 1645373133,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I assume there are more limiting factors than temperature here - signal interference, high radiation levels, etc. &lt;/p&gt;\n\n&lt;p&gt;The parker solar probe has travelled into the upper atmosphere of the sun which is, (to my knowledge) even hotter than the surface.&lt;/p&gt;\n\n&lt;p&gt;Could we theoretically create a probe that would make very close passes to the sun&amp;#39;s surface and obtain ultra high-resolution imagery of it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/askscience/comments/sx0iva/since_the_suns_upper_atmosphere_is_hotter_than/",
  "subreddit": "askscience",
  "id": "sx0iva",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I assume there are more limiting factors than temperature here - signal\ninterference, high radiation levels, etc.\n\nThe parker solar probe has travelled into the upper atmosphere of the sun which\nis, (to my knowledge) even hotter than the surface.\n\nCould we theoretically create a probe that would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この場合、温度以外の制限要因もあると思われます。\n干渉、高放射線レベルなど。\n\nパーカー・ソーラー・プローブは、太陽の上層大気圏に突入しました。\n私の知る限りでは、地表よりもさらに高温です。\n\n理論的には、そのような探査機を作ることは可能でしょうか？",
      "title": "太陽の上層大気は表面よりも高温で、すでに上層大気を通過する宇宙船を送り出しているのですから、太陽の表面に近い場所に宇宙船を送り込むことを阻むものは何でしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这里有比温度更多的限制性因素--信号\n信号干扰、高辐射水平，等等。\n\n帕克的太阳探测器已经进入了太阳的上层大气，（据我所知）其温度甚至高于表面。\n据我所知）比表面还要热。\n\n理论上，我们是否可以创造一个探测器，使其...",
      "title": "既然太阳的上层大气比表面更热，而且我们已经将航天器送过上层大气--是什么阻止了我们将航天器送至太阳表面附近？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這裏有比溫度更多的限制性因素--信號\n信號干擾、高輻射水平，等等。\n\n帕克的太陽探測器已經進入了太陽的上層大氣，（據我所知）其溫度甚至高於表面。\n據我所知）比表面還要熱。\n\n理論上，我們是否可以創造一個探測器，使其...",
      "title": "既然太陽的上層大氣比表面更熱，而且我們已經將航天器送過上層大氣--是什麼阻止了我們將航天器送至太陽表面附近？"
    }
  ]
}