{
  "author": "greensymbiote",
  "the_new_excerpt": "JP Morgan CEO, Jamie Dimon, recently noted that fintechs pose \"enormous\ncompetitive threats\" to banks and SF Federal Reserve board member, Jackie Reses,\nsees them “taking over and revolutionizing banking” with “a wholesale\ntransition” of “a $16 trillion market cap”.\n\nIn this context, fintech Paysafe…",
  "original_created_utc": 1619425918,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "JPモルガンのCEOであるジェイミー・ダイモンは、フィンテックが銀行にとって「巨大な競争上の脅威」になると指摘しました。\nまた、SF連邦準備制度理事のJackie Resesは、フィンテックが銀行を「支配し、銀行に革命をもたらす」と述べています。\nSF連邦準備制度理事のJackie Resesは、フィンテックが「銀行を買収し、革命を起こす」と考えています。\n16兆ドルの時価総額になる」という「移行」を考えています。\n\nこのような状況の中、フィンテックのPaysafe...",
      "title": "ペイセーフ（PSFE）のベアケースを見直す"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "摩根大通首席执行官杰米-戴蒙最近指出，金融科技对银行构成了 \"巨大的竞争威胁\"。\n竞争威胁\"，三藩市联邦储备委员会成员杰基-雷塞斯。\n认为他们会 \"接管并彻底改变银行业\"，并 \"全面过渡到\"\"16万亿美元的市值\"。\n16万亿美元市值 \"的过渡。\n\n在这种情况下，金融科技公司Paysafe...",
      "title": "回顾关于Paysafe（PSFE）的熊市案例"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摩根大通首席執行官傑米-戴蒙最近指出，金融科技對銀行構成了 \"巨大的競爭威脅\"。\n競爭威脅\"，三藩市聯邦儲備委員會成員傑基-雷塞斯。\n認爲他們會 \"接管並徹底改變銀行業\"，並 \"全面過渡到\"\"16萬億美元的市值\"。\n16萬億美元市值 \"的過渡。\n\n在這種情況下，金融科技公司Paysafe...",
      "title": "回顧關於Paysafe（PSFE）的熊市案例"
    }
  ],
  "title": "Reviewing the Bear Case on Paysafe (PSFE)",
  "created_utc": 1619437860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>JP Morgan CEO, Jamie Dimon, recently noted that fintechs pose &quot;enormous competitive threats&quot; to banks and SF Federal Reserve board member, Jackie Reses, sees them “taking over and revolutionizing banking” with “a wholesale transition” of “a $16 trillion market cap”.</p>\n\n<p>In this context, fintech Paysafe (PSFE) is newly listed on the NYSE and introduced to the US market. Already well known in Europe, Paysafe reports a substantial $362 million in free cash flow, projects $100 billion in transactional volume, $1.5 billion in revenue, healthy double-digit growth and expanding $30%+ EBITDA margins, but, despite absolutely no negative news, the stock has taken a pounding which, in turn, has brought the bears out in force with some dubious arguments. Sorry for the long post, but I thought I&#39;d address all of these arguments in one post:</p>\n\n<p>&#x200B;</p>\n\n<p>Common bear arguments:</p>\n\n<p>#1 Old business</p>\n\n<p>#2 Complex regulatory landscape / no moat</p>\n\n<p>#3 Growth by acquisition is risky and difficult</p>\n\n<p>#4 No growth</p>\n\n<p>#5 Slow growth</p>\n\n<p>#6 Too much debt / they are going to dilute by borrowing more.</p>\n\n<p>#7 Not profitable</p>\n\n<p>#8 Blackstone made 3X and will sell</p>\n\n<p>#9 Founder share and warrant dilution.</p>\n\n<p>&#x200B;</p>\n\n<p>#1) Old business. </p>\n\n<p>Paysafe’s extensive experience in risk management and its time-tested regulatory expertise over many regions globally is one of its greatest strengths. This is the reason that Paysafe is the #1 global leader in iGaming payment processing, a rapidly moving space that is anticipated to grow 10X. “At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”</p>\n\n<p>Much of Paysafe’s business is in back-end payment processing so most don’t even know they are using it, but Paysafe is considered to be at the forefront in its field: Winner “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method” and they are rapidly expanding in the US with new partnerships (just last 3 months: Coinbase, Microsoft, Luckbox, Amelco, Pointsbet, Virginia Lotto)</p>\n\n<p>In Europe, where Paysafe is more known and used, Trustpilot (1) rates Paysafe as “Excellent” (4.7/5 stars) with over 25,000 reviews, and Skrill as “great” (4.2/5 stars) with over 17,000 reviews, while PayPal is rated &quot;bad&quot; (1.2/5 stars) with over 17,000 reviews.</p>\n\n<p>Paysafe has the No. 2 global digital wallet with presence in 120 countries. They’ve just integrated their digital wallet platforms, Neteller and Skrill, recently voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”</p>\n\n<p>Aside from Coinbase, Luckbox and Microsoft, they are partnered with Roblox, Draftkings, Spotify, Fortnight, Amazon, Twitch, bet365, ApplePay, Youtube, Visa, Betfair, PayLease, ESL Gaming, BetMGM, among many others. They are currently moving quickly to integrate their services to offer easier migration of eCash, integration of payment methods, cross-border payments and expansion into global banking as a service. </p>\n\n<p>In preparation for their plans, Paysafe&#39;s newly announced Board of Directors includes a former Morgan Stanley CEO, a former Chairman of the American Gaming Association and CEO of MGM Resorts International, a legal and regulatory expert in the multi-jurisdictional online and retail gambling industries, two senior Managing Directors from Blackstone, two from CVC, the CEO of Dun &amp; Bradstreet and CEO of Black Knight, and the Chairman of the Board of Fidelity.</p>\n\n<p>As Chairman Bill Foley says, &quot;It’s going to be a land grab…I have a vision that we should be THE digital wallet… It’s our job to be there first and to make sure we dominate.&quot; This doesn&#39;t sound like an old company resting on its laurels. </p>\n\n<p>&#x200B;</p>\n\n<p>#2) Complex regulatory landscape / no moat. </p>\n\n<p>Bill Foley, Chairman of Fidelity and now also Paysafe’s Chairman of the Board, calls Paysafe,“a fortress. It’s got a moat… We have a proven strategy of winning as new global markets open. And most importantly, we have unrivaled regulatory risk and technical expertise.&quot; Their regulatory acumen is the reason they currently dominate globally in sports betting/iGaming and are integrating their global platforms to expand into banking as a service. There are 1.7 billion &quot;unbanked&quot; because so many in the world who have mobile devices, still don&#39;t have access to the essential ID metrics that most banks and credit cards require to open accounts. Paysafe&#39;s risk management and cross boarder regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant to go. Leaning into this strength, they&#39;ve brought on PayPal&#39;s former CRO and added a multi-jurisdictional regulatory expert to their Board of Directors</p>\n\n<p>From SEC filed transcript (2) - Paysafe CEO, Philip McHugh: “To be a true global player in the iGaming space, the level of payments regulation, of gaming regulation and certification is very, very complex. When we talk about a deep and a wide moat, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”</p>\n\n<p>“To be a winner in this space, you’re catering to some incredibly demanding clients. They want to be global, they want multiple APMs, but they want you to understand payment regulation in hundreds of countries in gaming and gambling regulation in hundreds of countries. That’s something that Paysafe has developed very, very successfully in every market we’ve entered.”</p>\n\n<p>&#x200B;</p>\n\n<p>#3) Growth by acquisition is hard. </p>\n\n<p>Synergistic inorganic growth through M&amp;A is a key pillar of Paysafe’s forward growth strategy. Bill Foley&#39;s proven track record in quickly generating this kind of growth speaks for itself. Over the last five years Foley has grown Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS from $2.5 billion to over $91 billion (36.4X). Foley says, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” (2, 4)</p>\n\n<p>&#x200B;</p>\n\n<p>#4) No growth. </p>\n\n<p>It’s true that Paysafe’s revenue stagnated in 2020 resulting from business closures during Covid, but prior to that they reported a strong 27% CAGR (4,5), which is on par with high profile competitors:</p>\n\n<p>2017: $864 million rev</p>\n\n<p>2018 : $1.14 billion rev (+32%)</p>\n\n<p>2019 : $1.418 billion rev (+24%).</p>\n\n<p>2020 : $1.426 billion. (+0.5%)</p>\n\n<p>Unlike many fintechs, Paysafe has heavy exposure in brick-and-mortar retail and live sporting events, both of which were absolutely crushed in 2020 due to Covid. During this market dislocation, they pivoted, “exited low value referral channels” and made up revenue by expanding in the digital wallets and e-commmerce spaces, positioning themselves better going forward.</p>\n\n<p>Looking at other brick-and-mortar payment processors hard-hit during the same period, like Visa and Mastercard, Paysafe performed very well by comparison:</p>\n\n<p>—Visa: negative y-o-y revenue growth (-8.7%) and negative EBITDA growth (-10.2%)</p>\n\n<p>— Mastercard: negative y-o-y revenue growth (-9.4%) and negative EBITDA growth (-14.20%)</p>\n\n<p>Not claiming that Paysafe should be valued according to these two traditional payment processors but, given their commensurate slow down during Covid, it is interesting to note that their their averaged EV/Revenue multiples would put Paysafe at $46, which is very much in line with the valuation comps cited below.</p>\n\n<p>&#x200B;</p>\n\n<p>#5) Slow growth. </p>\n\n<p>Going forward, Paysafe conservatively projects $10-13% annual growth over the next two years but they are careful so say that those growth projections exclude M&amp;A plans and expansion in iGaming which is expected to grow at 55% CAGR over the next several years. iGaming accounts for over a third of Paysafe’s revenue so this growth is a significant exclusion.</p>\n\n<p>Analyst Michael Del Grosso, who recently initiated coverage with a $19 price target (6) said, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.”</p>\n\n<p>In the short time since he wrote that, here are some of the headlines signaling a price target upgrade:</p>\n\n<p>1 &quot;New York State Legalizes Online Sports Wagering&quot;</p>\n\n<p>2 &quot;Maryland Online Sports Betting Bill Passes Legislature&quot;</p>\n\n<p>3 New Hampshire: &quot;Sports betting deal approved overwhelmingly; Hogan likely to sign&quot;</p>\n\n<p>4 &quot;Arizona governor signs bill legalizing sports betting&quot;</p>\n\n<p>5 &quot;Wyoming Legalizes Sports Betting&quot;</p>\n\n<p>6 ”Delaware igaming revenue up 74.3% year-on-year in March&quot;</p>\n\n<p>7 &quot;Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%&quot;</p>\n\n<p>8 “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL&quot;</p>\n\n<p>9 “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”</p>\n\n<p>10 “Ohio legislators doubling down on legalized sports gambling”</p>\n\n<p>11 “Louisiana Begins The Process of Legalized Sports Betting”</p>\n\n<p>12 “Path to legalized Texas sports betting becomes more clear”</p>\n\n<p>13 “NC lawmakers make push to legalize sports gambling to generate funding for schools”</p>\n\n<p>14 &quot;Single-sports betting in Canada wins House vote, nears legalization&quot;</p>\n\n<p>15 “Florida poised to offer sports betting under major gambling deal”</p>\n\n<p>16 “Legal Sports Betting Could Get To California Sooner Than You Think“</p>\n\n<p>&#x200B;</p>\n\n<p>Looking at a larger basket of comps with a collective growth rate of ~12.5% (not far from Paysafe’s minimum 10.6% projection) here are valuations based on PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, bill, GPN, and Paysign among others:</p>\n\n<p>&#x200B;</p>\n\n<p>Paysafe’s share price with average of sector peer multiples:</p>\n\n<p>EV/EBITDA ratio : $122.09</p>\n\n<p>EV/Rev ratio : $83.91</p>\n\n<p>EV/FCF ratio : $87.86</p>\n\n<p>Average: $97.95</p>\n\n<p>&#x200B;</p>\n\n<p>After eliminating outliers with highest multiples:</p>\n\n<p>EV/EBITDA ratio :$50.75</p>\n\n<p>EV/Rev ratio : $44.64</p>\n\n<p>EV/FCF ratio : $44.18</p>\n\n<p>Average :$46.52</p>\n\n<p>&#x200B;</p>\n\n<p>Notes:</p>\n\n<p>1 Unlike Paysafe, around half of these competitors report negative EBITDA growth and a third report negative EBITDA and negative free cash flow.</p>\n\n<p>2 Used low end of Paysafe&#39;s projections and factored in debt and high-end of potential dilution.</p>\n\n<p>3 As noted Paysafe’s 10.6% rev growth projection excludes planned inorganic M&amp;A growth and projected 55% CAGR iGaming growth, which constitutes a third of their revenue.</p>\n\n<p>4 The above comps were taken during a sector-wide pull-back and do not reflect recent fintech gains since Jamie Dimon’s &quot;enormous competitive threats&quot; comment.</p>\n\n<p>&#x200B;</p>\n\n<p>#6) Too much debt / they are going to dilute by borrowing more. </p>\n\n<p>Paysafe just paid down $1.1 billion in debt. Why would they turn around and borrow again? As Fidelity’s Chairman of the Board, Bill Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”</p>\n\n<p>Their 3.6X Debt/EBITDA ratio is better than most fintech peers. Investopedia: “Debt/EBITDA measures a company&#39;s ability to pay off its incurred debt. A high ratio result could indicate a company has a too-heavy debt load.” Of the 11 fintech competitors I looked at, all but three (PYPL, ADYEY, NUVCF), have worse Debt/EBITDA ratios than Paysafe and many have negative EBITDA, making debt service that much more difficult:</p>\n\n<p>Square: 77.8X</p>\n\n<p>Repay : 8.7X</p>\n\n<p>Fiserv : $21.2B / $4.7B : 4.5X</p>\n\n<p>GPN : $10.27B / $2.8B : 3.67X</p>\n\n<p>Shift4 : $1.8B / -$8M : negative EBITDA</p>\n\n<p>Affirm : $1.67B / -77.6M negative EBITDA</p>\n\n<p>Paysign : $4.3M / -$5.79M : negative EBITDA</p>\n\n<p>Bill : $947M / -43.85M : negative EBITDA</p>\n\n<p>Depending on whether you include SQ and AFRM, the combined multiples of the above competitors (by EV/EBITDA, EV/free cash flow or EV/revenue) puts Paysafe’s share price in the $45 to $90 range. Point being, their debt position is better than most and hardly a red flag. Further, management has said they’ll be able to fund M&amp;A plans with expanding 32-35%+ EBITDA margins ($500 - 560 million, 21% CAGR) and $362 million in free cash flow.</p>\n\n<p>&#x200B;</p>\n\n<p>#7) Not profitable. </p>\n\n<p>Paysafe expects $900 million in gross profit with healthy 30-32% EBITDA margin. As one recent article pointed out, “Paysafe has shown some intriguing projections in terms of its profitability. The company’s projected gross margin is 63%, an impressive number compared to competitors like Square with a gross margin under 30%.”</p>\n\n<p>These fintech competitors are trading at much higher multiples but have worse EPS than Paysafe:</p>\n\n<p>Repay: -0.67,</p>\n\n<p>Affirm : -2.18,</p>\n\n<p>Nuvei : -1.08,</p>\n\n<p>Paysign : -0.19.</p>\n\n<p>Bill : -0.62,</p>\n\n<p>Shift4 : -0.43</p>\n\n<p>Average EV/EBITDA multiples of the above companies would put Paysafe&#39;s SP at $69</p>\n\n<p>If you read their transcripts and presentations, you’ll see that profit is being utilized to grow the business and integrate their global platforms into what they call Paysafe Unity. They’ve recently completed the integration of Skrill and Neteller digital wallets into a single code. Foley has indicated further elimination of redundancies to create new efficiencies and increase margins to enhance M&amp;A activities. From what I can tell, Foley is all about the long game.</p>\n\n<p>&#x200B;</p>\n\n<p>#8) Blackstone made 3X and will sell. </p>\n\n<p>The common myth is that Blackstone/CVC made 300% by paying $3 billion to take Paysafe private and receiving $9 billion in the recent deal to bring it public. The reality, as reported by the Wall Street Journal (8), is that Blackstone/CVC took Paysafe private in 2017 for $3.9 Billion and they received about $5.6 billion in cash and shares on the recent deal. Adjusted for inflation, they paid $4.2 billion so it’s more like a 33% return on a 4 year hold.</p>\n\n<p>Importantly, this came AFTER they grew revenue 65% ($864B to $1.426B), stewarded a billion in investments to grow the business, and the deal included paying down over $1.1 billion in debt. This suggests Foley cut a great deal for shareholders. It also explains why private equity has signaled that they&#39;ll stay on long term to reap much bigger gains through Foley’s time-tested M&amp;A playbook.</p>\n\n<p>Blackstone itself says (9), “The term of private equity funds can be upwards of 7-10 years.” With so much runway and comps pointing to a 3-4X valuation, why would Blackstone leave so much money on the table?</p>\n\n<p>Blackstone Senior Managing Director Eli Nagler signals an ongoing interest in staying on: “We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.”</p>\n\n<p>In a recent interview Foley said, private equity’s plan to stay on was part of what encouraged PIPE to invest $2 billion: “They rolled a significant amount of their investment which is a confidence builder. They didn’t take all their money off the table…All of these things put together really created the confidence among the investor base to invest in the PIPE and then support the stock.”</p>\n\n<p>This trust was reiterated in the SEC filed FTAC’s Board of Directors’ Reasons for the Approval of the Business Combination: “Commitment of Paysafe’s Owners. The FTAC Board believes that the CVC Investors, the Blackstone Investors and other current indirect stockholders of PGHL continuing to own a substantial percentage of the post-combination company on a pro forma basis reflects such stockholders’ belief in and commitment to the continued growth prospects of Paysafe going forward.”</p>\n\n<p>The PIPE investors are even less of a concern because they are title and life insurance companies known for long-term investment strategies, they are closely aligned with Foley and understand his both his M&amp;A track record and his ability to create mutually beneficial synergistic deals through what Bloomberg called the “The Foley Network” (perhaps, for example, Paysafe will handle Fidelity’s massive transactional volume). In a recent Bloomberg interview, Bill Foley said, “The thing that was different about our transaction is that we brought capital to the table. The companies that I’m affiliated with actually invested roughly a billion dollars in the PIPE and forward purchase agreements so Paysafe was always a really protected asset besides the fact that it’s a great asset.”</p>\n\n<p>But, let&#39;s assume these funds do eventually sell a portion of their shares which, given Paysafe&#39;s $100B market share (similar to Square’s, but more profitable), would allow index funds to accumulate larger positions. Just as large funds often drive price down to accumulate shares, they also can drive price up to sell into strength and do so via off-market trades, avoiding price slippage. This question is less about real risk than it is about short-term fear, which is ultimately why understanding the context and fundamentals is so critical.</p>\n\n<p>&#x200B;</p>\n\n<p>#9) Founder share and warrant dilution. </p>\n\n<p>According to the 20F recently filed, roughly 53 million warrants pose potential dilution at a maximum of 7.5% (movement we&#39;ve seen in a day), but the cashless conversion option, generally exchanging 3 warrants for a single share, can reduce that dilution by 2/3 to around 2.5%. It is very likely that many will use this option since most warrant holders do not have the extra cash to pay an additional $11.50 for each warrant conversion. It will probably be somewhere in the middle of the two scenarios (~5%) but this is not a major concern in the scheme of things.</p>\n\n<p>Importantly, the 20F also shows that all founder shares are already included in the current outstanding share count so there is no risk of dilution there.</p>\n\n<p>Total FTAC Founder shares 175,292,458 24.2 % </p>\n\n<p>Blackstone Investors 123,734,571 17.1 % </p>\n\n<p>CVC Investors 156,006,433 21.6 % </p>\n\n<p>Other Pre-Business Combination Paysafe Shareholders 53,701,074 7.4 % </p>\n\n<p>Cannae (excluding amounts included in Founder) 50,000,000 6.9 % </p>\n\n<p>PIPE Investors (excluding Cannae) 165,000,000 22.8 % </p>\n\n<p>723,734,536 100.0 % </p>\n\n<p>Below are some examples of the warrant cashless conversion rates per the chart in the S1 (7). Cash redemption is more profitable when commons trade above $18. </p>\n\n<p>$18 : $6.50</p>\n\n<p>$17 : $6.08 </p>\n\n<p>$16 : $5.57</p>\n\n<p>$15 : $5.05</p>\n\n<p>$14 : $4.54</p>\n\n<p>$13 : $4.04 </p>\n\n<p>&#x200B;</p>\n\n<p>Despite a lack of negative news, short sellers and bashers have been able to exploit a perfect storm of doubt created by seemingly unrelated events ranging from forced selling pressure coming from widely reported changes in margin requirements without prior notice, to simultaneous limits on buying resulting from excessive delays in the new PSFE ticker being available on many platforms, to things in the media that this sub will not allowed to be discussed.  In this context, it is hard not to see a month&#39;s worth of “fake sell walls” and HFS “short ladder attacks” as anything other than opportunistic price manipulation but, speculation can only get you so far. </p>\n\n<p>I think Paysafe is undervalued and, very likely, a 3X from here. Given Paysafe&#39;s healthy fundamentals, large market share in a fintech space known for “sticky” customers, and exposure to high growth verticals like iGaming, it seems inevitable that large funds are poised to benefit from these low prices, especially once the first audited quarterly numbers are available on May 11th.</p>\n\n<p>&#x200B;</p>\n\n<p>Per their analyst presentation, here is Paysafe’s minimum Q1 guidance to meet or beat:</p>\n\n<p>$360 million revenue</p>\n\n<p>$220 million gross profit</p>\n\n<p>$105 million EBITDA</p>\n\n<p>&#x200B;</p>\n\n<p>Disclosure: I hold $600K in commons and warrants</p>\n\n<p>Disclaimer: I am not a financial advisor. All users should complete their own due diligence.</p>\n\n<p>&#x200B;</p>\n\n<p>Sources:</p>\n\n<p>(1) Trustpilot <a href=\"https://uk.trustpilot.com/review/www.paysafecard.com\">https://uk.trustpilot.com/review/www.paysafecard.com</a></p>\n\n<p>(2) Transcript: <a href=\"https://www.sec.gov/Archives/edgar/data/0001818355/000119312520311318/d91054d425.htm\">https://www.sec.gov/Archives/edgar/data/0001818355/000119312520311318/d91054d425.htm</a></p>\n\n<p>(3) 20F <a href=\"https://www.sec.gov/Archives/edgar/data/1833835/000119312521104105/d159702d20f.htm#toc\">https://www.sec.gov/Archives/edgar/data/1833835/000119312521104105/d159702d20f.htm#toc</a></p>\n\n<p>(4) Investor Presentation: <a href=\"https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm\">https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm</a></p>\n\n<p>(5) Analyst Presentation: <a href=\"https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf\">https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf</a></p>\n\n<p>(6) Analyst $19 <a href=\"https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html\">https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html</a></p>\n\n<p>(7) S1: <a href=\"https://sec.report/Document/0001104659-20-089252/\">https://sec.report/Document/0001104659-20-089252/</a></p>\n\n<p>(8) WSJ: <a href=\"https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827\">https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827</a></p>\n\n<p>(9) Blackstone: <a href=\"https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf\">https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf</a></p>\n\n<p>(10) Q1 earnings call: <a href=\"https://ir.paysafe.com/news-events/events/detail/9758/first-quarter-2021-earnings-call\">https://ir.paysafe.com/news-events/events/detail/9758/first-quarter-2021-earnings-call</a></p>\n</div><!-- SC_ON -->",
  "score": 393,
  "permalink": "/r/stocks/comments/mysz54/reviewing_the_bear_case_on_paysafe_psfe/",
  "subreddit": "stocks",
  "id": "mysz54",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776215991
}