{
  "author": "Eluchel",
  "original_created_utc": 1629767048,
  "title": "I don't think Bitboy is credible, am I wrong?",
  "created_utc": 1629780653,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Y&#39;all,</p>\n\n<p>The title says it all, I have gathered the impression that Bitboy isn&#39;t credible from what I have read on this subreddit but got someone replying to a comment I made on a youtube video related to him saying that he is <em>obviously</em> credible. I still don&#39;t feel like he is credible, but since I don&#39;t have any personal experience with bitboy could y&#39;all explain to me why the community generally doesn’t like him?</p>\n\n<p>What is the general consensus here about his credibility, and if you feel he is or isn&#39;t credible why do you feel that way?</p>\n\n<p>Looking forward to reading the comments!</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/pad2o5/i_dont_think_bitboy_is_credible_am_i_wrong/",
  "subreddit": "CryptoCurrency",
  "id": "pad2o5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi Y'all,\n\nThe title says it all, I have gathered the impression that Bitboy isn't credible\nfrom what I have read on this subreddit but got someone replying to a comment I\nmade on a youtube video related to him saying that he is obviously credible. I\nstill don't feel like he is credible, but since I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nタイトルが全てを物語っています。このsubredditで読んだ限りでは、Bitboyは信用できないという印象を受けました。\nこのサブレディットで読んだことから、Bitboyは信用できないという印象を持っていました。\nしかし、彼に関連したyoutubeのビデオに私がコメントしたことに対して、彼は明らかに信用できると返信した人がいました。I\n私はまだ彼が信用できるとは思っていませんが、せっかくなので...。",
      "title": "ビットボーイは信用できないと思うのですが、私は間違っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n标题说明了一切，我从这个分论坛上读到的内容中得到的印象是，Bitboy并不可靠。\n从我在这个分论坛上读到的内容，但有人回复了我的评论\n的评论，说他显然是可信的。I\n我仍然不觉得他是可信的，但由于我...",
      "title": "我不认为Bitboy是可信的，我错了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n標題說明了一切，我從這個分論壇上讀到的內容中得到的印象是，Bitboy並不可靠。\n從我在這個分論壇上讀到的內容，但有人回覆了我的評論\n的評論，說他顯然是可信的。I\n我仍然不覺得他是可信的，但由於我...",
      "title": "我不認爲Bitboy是可信的，我錯了嗎？"
    }
  ]
}