{
  "author": "GroundbreakingLack78",
  "original_created_utc": 1645385663,
  "title": "Nobody blames FIAT when criminals launder money, but when they use Crypto, it’s a Crypto problem.",
  "created_utc": 1645403751,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The same thing was happening during the beginnings of the internet era. If someone was kidnapped or murdered by someone they met on the internet, media blamed the internet.&lt;/p&gt;\n\n&lt;p&gt;Decades later, people are over it because internet is a necessary part of their lives.&lt;/p&gt;\n\n&lt;p&gt;The world’s ‘regulated’ banks are laundering more than $2 trillion every year. &lt;/p&gt;\n\n&lt;p&gt;If that was a case of Cryptocurrency, there would be numerous “BREAKING NEWS” topics, posts, titles about how Crypto is ruining the whole world financial system, helping the criminals and all kinds of panic stories.&lt;/p&gt;\n\n&lt;p&gt;Will we ever get importial news? Did you know that terrorists sometimes drive in cars and are drinking bottled water? Did you know that when you don’t breathe you die? And also that every 60 seconds in Africa, a minute passes?? Wow.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 363,
  "permalink": "/r/CryptoCurrency/comments/sx9agt/nobody_blames_fiat_when_criminals_launder_money/",
  "subreddit": "CryptoCurrency",
  "id": "sx9agt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The same thing was happening during the beginnings of the internet era. If\nsomeone was kidnapped or murdered by someone they met on the internet, media\nblamed the internet.\n\nDecades later, people are over it because internet is a necessary part of their\nlives.\n\nThe world’s ‘regulated’ banks are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インターネット時代の始まりの頃も、同じようなことが起こっていました。もし\nネットで知り合った人に誘拐されたり、殺されたりすると、メディアはこぞって\nネットのせいにした。\n\n数十年後、人々はインターネットが必要な部分であるため、それを乗り越えています。\n生活しています。\n\n世界の「規制」された銀行が...",
      "title": "犯罪者がマネーロンダリングをしても、誰もFIATを非難しませんが、彼らがCryptoを使用すると、Cryptoの問題になってしまうのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在互联网时代的初期，同样的事情也在发生。如果\n如果有人被他们在互联网上认识的人绑架或谋杀，媒体就会指责互联网。\n归咎于互联网。\n\n几十年后，人们已经习惯了，因为互联网是他们生活中的一个必要部分。\n生活的必要组成部分。\n\n世界上的 \"受管制 \"银行是...",
      "title": "当犯罪分子洗钱时，没有人指责FIAT，但当他们使用加密货币时，这就是加密货币的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在互聯網時代的初期，同樣的事情也在發生。如果\n如果有人被他們在互聯網上認識的人綁架或謀殺，媒體就會指責互聯網。\n歸咎於互聯網。\n\n幾十年後，人們已經習慣了，因爲互聯網是他們生活中的一個必要部分。\n生活的必要組成部分。\n\n世界上的 \"受管制 \"銀行是...",
      "title": "當犯罪分子洗錢時，沒有人指責FIAT，但當他們使用加密貨幣時，這就是加密貨幣的問題。"
    }
  ]
}