{
  "author": "drfloydch",
  "the_new_excerpt": "(IT guy views):\n\nMaybe, I don't have the full picture but it seems their products are only \"put a\ncool UI and automate some data tasks\".\n\nAll the things I saw in their presentation are perfectly manageable if you hire\nproper IT people. We don't need UI to prepare data from different sources,…",
  "original_created_utc": 1618417509,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(ITマンの見解)。\n\n全体像を把握しているわけではありませんが、彼らの製品は「かっこいいUIをつけて、データ処理を自動化する」だけのように思えます。\nクールなUIを搭載し、いくつかのデータタスクを自動化する」だけのようです。\n\n私が彼らのプレゼンテーションで見たものは、適切なITスタッフを雇えば完全に管理可能です。\nきちんとしたITスタッフを雇えば、管理できるものばかりです。異なるソースからのデータを準備するのにUIは必要ありませんし、...",
      "title": "Palantir (PLTR) : 今日のプレゼンテーションはちょっと変だな"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(IT男观点)。\n\n也许吧，我没有掌握全貌，但他们的产品似乎只是 \"把一个\"。\n炫酷的UI和自动化的一些数据任务\"。\n\n我在他们的演示中看到的所有东西都是完全可以管理的，如果你雇佣了\n适当的IT人员。我们不需要UI来准备来自不同来源的数据，...",
      "title": "Palantir (PLTR)：今天的表现有点怪异"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(IT男觀點)。\n\n也許吧，我沒有掌握全貌，但他們的產品似乎只是 \"把一個\"。\n炫酷的UI和自動化的一些數據任務\"。\n\n我在他們的演示中看到的所有東西都是完全可以管理的，如果你僱傭了\n適當的IT人員。我們不需要UI來準備來自不同來源的數據，...",
      "title": "Palantir (PLTR)：今天的表現有點怪異"
    }
  ],
  "title": "Palantir (PLTR) : today presentation is a bit weird",
  "created_utc": 1618432031,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(IT guy views):</p>\n\n<p>Maybe, I don&#39;t have the full picture but it seems their products are only &quot;put a cool UI and automate some data tasks&quot;.</p>\n\n<p>All  the things I saw in their presentation are perfectly manageable if you  hire proper IT people. We don&#39;t need UI to prepare data from different  sources, link the data, run IA models etc. We can do it in days or weeks  not years like they are trying to sell you.</p>\n\n<p>Maybe they will faciliate some tasks for companies without good sized or skilled IT teams, I dont&#39; know...</p>\n\n<p>Their  UI seems very interesting and well designed, I can give that. But I m  sure we will be quicker with a simple linux terminal (joke) :)</p>\n\n<p>I  see their products like &quot;Channable&quot; for data flow management but with  all the IA Hype (**Channable is a small tool to prepare data to be sent  to shopping marketplaces).</p>\n\n<p>Like I  said, maybe I don&#39;t have the full picture based on their presentation  and I don&#39;t know any figures related to their valuation etc. But for a  pure technical point, I don&#39;t see anything in the core plateform that is  a big whaooo effect (except their UI).</p>\n\n<p>If  I need to think about a road : they maybe will be a 3d engine like  Unreal Engine or Unity but for data linking, preparation, and IA models  (the tool that groups up the techs in a simpler way).. but I have a  doubt.</p>\n\n<p>Can be cool if someone has complete different views on that.</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/investing/comments/mqu5r0/palantir_pltr_today_presentation_is_a_bit_weird/",
  "subreddit": "investing",
  "id": "mqu5r0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617808
}