{
  "author": "Ofekino12",
  "original_created_utc": 1631476664,
  "title": "It’s absolutely mind boggling and disgusting how those rich influencers STILL feel the need to scam people for money",
  "created_utc": 1631511145,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Kim kardashian and floyd mayweather just to namedrop a couple, OBVIOUSLY they don’t need more money but they WANT more, and they don’t care how they get it. \nIt’s absolutely abhorrent how these people feel like what they did is O.K and we should definitely NOT be silent about this. I know people are already talking about this but im asking u - do not forget! \nThey not only leech off of their fans but they are making the whole space look like a joke, bringing in more scumfluencers  who want to do the same.\nit’s hurting adoption it’s hurting innocent people who don’t know better and it’s honestly just sad. They need to know what they did was wrong from the community, and hopefully enough uproar will actually get the authorities involved. </p>\n\n<p>I’m honestly disgusted. U R RICH ENOUGH ASSHOLES. Holy fuck!</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/pmzvkc/its_absolutely_mind_boggling_and_disgusting_how/",
  "subreddit": "CryptoCurrency",
  "id": "pmzvkc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Kim kardashian and floyd mayweather just to namedrop a couple, OBVIOUSLY they\ndon’t need more money but they WANT more, and they don’t care how they get it.\nIt’s absolutely abhorrent how these people feel like what they did is O.K and we\nshould definitely NOT be silent about this. I know people are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "キム・カーダシアンとフロイド・メイウェザーのカップルの名前を挙げただけで、明らかに彼らは\n彼らはお金を必要としていませんが、もっと欲しいと思っています。\nこのような人たちが、自分たちのしたことを問題ないように感じていることは、とても恐ろしいことです。\n私たちはこのことについて絶対に黙っているべきではありません。沈黙してはいけません。",
      "title": "金持ちのインフルエンサーたちが、いまだに人を騙してお金を稼ぐ必要性を感じているなんて、まったくもって呆れてしまいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "金-卡戴珊和弗洛伊德-梅威瑟只是点名批评一对夫妇，显然，他们不需要更多的钱，但他们想要更多的钱，他们不在乎如何获得。\n他们不需要更多的钱，但他们想要更多的钱，而且他们不在乎如何得到它。\n这些人觉得他们的所作所为是好的，这绝对是令人憎恶的，我们绝对不应该对此保持沉默。\n我们绝对不应该对此保持沉默。我知道人们是...",
      "title": "那些富有的影响者仍然觉得有必要骗取人们的钱财，这绝对是令人匪夷所思和恶心的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "金-卡戴珊和弗洛伊德-梅威瑟只是點名批評一對夫婦，顯然，他們不需要更多的錢，但他們想要更多的錢，他們不在乎如何獲得。\n他們不需要更多的錢，但他們想要更多的錢，而且他們不在乎如何得到它。\n這些人覺得他們的所作所爲是好的，這絕對是令人憎惡的，我們絕對不應該對此保持沉默。\n我們絕對不應該對此保持沉默。我知道人們是...",
      "title": "那些富有的影響者仍然覺得有必要騙取人們的錢財，這絕對是令人匪夷所思和噁心的。"
    }
  ]
}