{
  "author": "Puppy_Coated_In_Beer",
  "original_created_utc": 1631481534,
  "title": "ERG (Ergo) is getting popular. Don't miss out just because you \"don't know how to buy it\"",
  "created_utc": 1631500973,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The general consensus from this subreddit appears to be that ERG is one of the new favorites here.</p>\n\n<p>And for good reasons:</p>\n\n<ul>\n<li><p>Probably the most closest cryptocurrency to Cardano in terms of partnerships, ties and ideologies</p></li>\n<li><p>Ergo&#39;s core dev being Alex Chepurnoy (yes, <strong>THAT</strong> <a href=\"https://twitter.com/chepurnoy?lang=en\">Alex Chepurnoy</a>)</p></li>\n<li><p>It doesn&#39;t allow mining farms, limits PoW nodes</p></li>\n<li><p>Utilizes Oracle Pools (UTXO-based) and smart contracts</p></li>\n<li><p>ErgoDEX&#39;s beta was a flawless success with Cardano according to dev testers (despite the amount of recent FUD with the UTXO model)</p></li>\n<li><p>Market Cap is nearing $1B USD (up <strong>x60</strong> since January 1st, 2021)</p></li>\n<li><p>ERG&#39;s amazing tokenomics (no pre-mined coins exist, eventually the Ergo Treasury will cease to receive a percentage of mining rewards to better decentralization)</p></li>\n<li><p>ERG has a very healthy supply of 97 million tokens, the treasury is only expected to hold 4% at the end of the distribution</p></li>\n</ul>\n\n<p>And so forth. So yes, this is the most early point for ERG investors.</p>\n\n<p>But the same concerning statements keep coming up here:</p>\n\n<blockquote>\n<p>&quot;I don&#39;t want to open a KuCoin/CoinEx/Bitcoin.com exchange account&quot;</p>\n\n<p>&quot;I&#39;m going to wait for Binance/Coinbase to list it. That&#39;s the exchange I use&quot;</p>\n\n<p>&quot;I don&#39;t know how to buy it&quot;</p>\n</blockquote>\n\n<p>I&#39;m sorry, but these are terrible, terrible excuses. I understand the concerns for investing on an exchange you&#39;re not familiar with, but these are all reputable exchanges (KuCoin being one of the top 5 right now in terms of volume).</p>\n\n<p>And by the way, <strong>you can mine ERG</strong> with any GPU that has more than 3GB of VRAM</p>\n\n<p>Imagine having the same thought process for Bitcoin back in say 2012. Buying Bitcoin back then was not exactly easy as it is today. No one really understood anything about wallets, deposits were harder through banks, etc. But it was possible. And it&#39;s even easier today for coins like ERG.</p>\n\n<p>I can say first hand that KuCoin is a reputable exchange. Yes, you can deposit USDT. Yes, you can trade ERG for USDT. Yes, you can withdraw your ERG to another wallet. It works just like any other exchange.</p>\n\n<p>And yes, some of them use KYC. <strong>It&#39;s not a big deal.</strong></p>\n\n<p>And <em>yes</em>, it is without question getting listed on Coinbase and Binance. No, that is not confirmed, nor can it be as the developers literally aren&#39;t allowed to even speak about new exchange listings until they&#39;re given approval.</p>\n\n<p><strong>TL;DR</strong> Don&#39;t be lazy. Search how to buy ERG if you&#39;re interested in it. KuCoin is one way and is a decent way to buy it currently. Just sign up, verify yourself, deposit USDT, trade for ERG, and you&#39;re done.</p>\n\n<p><strong>EDIT:</strong> Christ. Yes, DYOR. That should be common sense at this point. Don&#39;t listen to me, actually <a href=\"https://ergoplatform.org/en/faq/\">read up about the project</a>.</p>\n\n<p>I don&#39;t work for Ergo. I don&#39;t work for Cardano/IOHK. I don&#39;t care if you choose to buy it or not. I&#39;m not telling you it&#39;s going to explode or implode. But if you <em>are</em> interested and have done sufficient research, the whole point of this post is to not let a dumb excuse get in the way of investing in it early.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/AWew9i1s5cU7DTE7LmhIZI4a6N2iTz0SNfik6vEECWg.jpg?auto=webp&s=b7cbdfa396e3953d34151a26e129a58268d00be0",
          "width": 400,
          "height": 400
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/AWew9i1s5cU7DTE7LmhIZI4a6N2iTz0SNfik6vEECWg.jpg?width=108&crop=smart&auto=webp&s=43154572918157ea318b37b81a8350f7d9be03f8",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/AWew9i1s5cU7DTE7LmhIZI4a6N2iTz0SNfik6vEECWg.jpg?width=216&crop=smart&auto=webp&s=26d931f29b4fd5300326c1784107a527e3ad1849",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/AWew9i1s5cU7DTE7LmhIZI4a6N2iTz0SNfik6vEECWg.jpg?width=320&crop=smart&auto=webp&s=6e40bc4ba6dcaa7ab8910119c4b0af8dd6d6f4a9",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "AwMaX3eN5yjHj3PpuMaleJKsIJZ0IzHME41la9bagy0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pn1drc/erg_ergo_is_getting_popular_dont_miss_out_just/",
  "subreddit": "CryptoCurrency",
  "id": "pn1drc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The general consensus from this subreddit appears to be that ERG is one of the\nnew favorites here.\n\nAnd for good reasons:\n\n * Probably the most closest cryptocurrency to Cardano in terms of partnerships,\n   ties and ideologies\n\n * Ergo's core dev being Alex Chepurnoy (yes, THAT Alex Chepurnoy\n  …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットでの一般的な意見は、ERGがここでの新しいお気に入りの一つであるということのようです。\n新しいお気に入りの一つです。\n\nそれには理由があります。\n\n * おそらく、パートナーシップの面では、Cardanoに最も近い暗号通貨です。\n   イデオロギー\n\n * Ergoのコア開発者がAlex Chepurnoy（そう、あのAlex Chepurnoyです。\n  ...",
      "title": "ERG（エルゴ）が人気です。\"買い方がわからない \"というだけで見逃してはいけない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个分论坛的普遍共识似乎是，ERG是这里的一个\n这里的新宠。\n\n这是有原因的。\n\n * 可能是在伙伴关系方面最接近Cardano的加密货币。\n   联系和意识形态方面最接近Cardano\n\n * Ergo的核心开发人员是Alex Chepurnoy（是的，那个Alex Chepurnoy）。\n  ...",
      "title": "ERG（Ergo）正在变得流行。不要因为你 \"不知道怎么买 \"而错过了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個分論壇的普遍共識似乎是，ERG是這裏的一個\n這裏的新寵。\n\n這是有原因的。\n\n * 可能是在夥伴關係方面最接近Cardano的加密貨幣。\n   聯繫和意識形態方面最接近Cardano\n\n * Ergo的核心開發人員是Alex Chepurnoy（是的，那個Alex Chepurnoy）。\n  ...",
      "title": "ERG（Ergo）正在變得流行。不要因爲你 \"不知道怎麼買 \"而錯過了。"
    }
  ]
}