{
  "author": "DrRobThompson",
  "the_new_excerpt": "Hello everyone! I'm a historian with the Films Team at Army University Press.\nI'm here to chat about my new book Clear, Hold, and Destroy: Pacification in Phú\nYên and the American War in Vietnam [https://t.co/NWmSHbWZi1].\n\nWhat I cover in the book:\n\n> By the end of the American War in Vietnam, the…",
  "original_created_utc": 1620305923,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はArmy University Pressのフィルムチームに所属する歴史学者です。\n今回は、私の新刊『Clear, Hold, and Destroy』についてお話したいと思います。Pacification in Phú\nYênのPacification and the American War in Vietnam [https://t.co/NWmSHbWZi1]についてお話します。\n\nこの本で私が扱っている内容は。\n\n> アメリカのベトナム戦争が終わる頃には、...",
      "title": "私はロバート・トンプソン博士で、私の新著『Clear, Hold, and Destroy: Phú Yênにおける平和化とアメリカのベトナム戦争」についてお話します。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 我是陆军大学出版社电影组的一名历史学家。\n我在这里谈一谈我的新书《清除、保持和摧毁》。在Phú\nYên和美国在越南的战争[https://t.co/NWmSHbWZi1]。\n\n我在书中的内容。\n\n> 美国在越南的战争结束时，美国的军队已经开始了对中国的军事行动。",
      "title": "我是罗伯特-汤普森博士，在此讨论我的新书《清除、保持和摧毁》。在福延的绥靖和美国在越南的战争_。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 我是陸軍大學出版社電影組的一名歷史學家。\n我在這裏談一談我的新書《清除、保持和摧毀》。在Phú\nYên和美國在越南的戰爭[https://t.co/NWmSHbWZi1]。\n\n我在書中的內容。\n\n> 美國在越南的戰爭結束時，美國的軍隊已經開始了對中國的軍事行動。",
      "title": "我是羅伯特-湯普森博士，在此討論我的新書《清除、保持和摧毀》。在福延的綏靖和美國在越南的戰爭_。AMA!"
    }
  ],
  "title": "I'm Dr. Robert Thompson, here to discuss my new book _Clear, Hold, and Destroy: Pacification in Phú Yên and the American War in Vietnam_. AMA!",
  "created_utc": 1620314358,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone! I&#39;m a historian with the Films Team at Army University Press. I&#39;m here to chat about my new book <a href=\"https://t.co/NWmSHbWZi1\"><em>Clear, Hold, and Destroy: Pacification in Phú Yên and the American War in Vietnam</em></a>.</p>\n\n<p>What I cover in the book:</p>\n\n<blockquote>\n<p>By the end of the American War in Vietnam, the coastal province of Phú Yên was one of the least-secure provinces in the Republic of Vietnam. It was also a prominent target of the American strategy of pacification—an effort, purportedly separate and distinct from conventional warfare, to win the “hearts and minds” of the Vietnamese. In Robert J. Thompson III’s analysis, the consistent, and consistently unsuccessful, struggle to place Phú Yên under Saigon’s banner makes the province particularly fertile ground for studying how the Americans advanced pacification and why this effort ultimately failed.  </p>\n\n<p>In March 1970 a disastrous military engagement began in Phú Yên, revealing the enemy’s continued presence after more than three years of pacification. <em>Clear, Hold, and Destroy</em> provides a fresh perspective on the war across multiple levels, from those making and implementing policy to those affected by it. Most pointedly, Thompson contends that pacification, far from existing apart from conventional warfare, actu- ally depended on conventional military forces for its application. His study reaches back into Phú Yên’s storied history with pacification before and during the French colonial period, then focuses on the province from the onset of the American War in 1965 to its conclusion in 1975.  </p>\n\n<p>A sharply focused, fine-grained analysis of one critical province during the Vietnam War, Thompson’s work demonstrates how pacification is better understood as the foundation of U.S. fighting in Vietnam.</p>\n</blockquote>\n\n<p>I&#39;ll start responding to questions at 10am EST. I look forward to answering your questions related to the book!</p>\n</div><!-- SC_ON -->",
  "score": 140,
  "permalink": "/r/AskHistorians/comments/n66oiq/im_dr_robert_thompson_here_to_discuss_my_new_book/",
  "subreddit": "AskHistorians",
  "id": "n66oiq",
  "is_self": true,
  "media": null,
  "is_video": false
}