{
  "author": "Raiwist",
  "original_created_utc": 1632514353,
  "title": "Ok, we've established we don't like, China, banks and the SEC. What else don't we like?",
  "created_utc": 1632522741,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, China today announced for the 458th time that they&#39;re outright banning the use of crypto within the country - fair enough, I think they&#39;ve got their point across.</p>\n\n<p>Banks, well, I think it&#39;s obvious why they&#39;re bound to rub crypto advocates the wrong way - limiting access to and use of their customers&#39; funds arbitrarily, condemning crypto for doing what they&#39;ve been doing for 100 years and to a much greater degree; charging excessive fees, laughable interest rates and, by christ, it&#39;s difficult to find a decent parking spot close by.</p>\n\n<p>The SEC...hmmm...give me a sec...oh, yeah! They help the banks and maintain the status quo - would probably advocate for feudalism if their overlords requested it of them. Oh, but wait, they&#39;ve got Gary Gensler now - the old Genny boy MIT graduate crypto aficionado - he&#39;s going to turn it all around, finally bring the public to see crypto for what it is...What&#39;s that, Gary? No more staking? Well, fuck!</p>\n\n<p>&#x200B;</p>\n\n<p>What else gets your goat, cryptoland?</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/purm7b/ok_weve_established_we_dont_like_china_banks_and/",
  "subreddit": "CryptoCurrency",
  "id": "purm7b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, China today announced for the 458th time that they're outright banning the\nuse of crypto within the country - fair enough, I think they've got their point\nacross.\n\nBanks, well, I think it's obvious why they're bound to rub crypto advocates the\nwrong way - limiting access to and use of their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国は本日、458回目の発表として、国内での暗号の使用を全面的に禁止すると発表しました。\n国内での暗号の使用を全面的に禁止すると発表しました。\nその通りだと思います。\n\n銀行はというと、暗号擁護派を怒らせてしまうのは明らかだと思います。\n自分たちの...へのアクセスと使用を制限することは、暗号擁護者を怒らせるに決まっています。",
      "title": "さて、中国、銀行、証券取引委員会が嫌いなことはわかった。他に何が嫌いなんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，中国今天第458次宣布，他们将彻底禁止\n在国内使用加密货币--足够公平，我认为他们已经得到了他们的观点。\n跨越。\n\n银行方面，我认为很明显的是，为什么他们一定会让加密货币倡导者感到不满\n限制访问和使用他们的...",
      "title": "好吧，我们已经确定我们不喜欢中国、银行和证监会。还有什么是我们不喜欢的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，中國今天第458次宣佈，他們將徹底禁止\n在國內使用加密貨幣--足夠公平，我認爲他們已經得到了他們的觀點。\n跨越。\n\n銀行方面，我認爲很明顯的是，爲什麼他們一定會讓加密貨幣倡導者感到不滿\n限制訪問和使用他們的...",
      "title": "好吧，我們已經確定我們不喜歡中國、銀行和證監會。還有什麼是我們不喜歡的？"
    }
  ]
}