{
  "author": "thedonp420",
  "the_new_excerpt": "Most investors that have recently joined crypto are sitting on some pretty big\nlosses atm but be patient my friends Rome wasn’t built in a day and lambos might\nnot be in store for 2021 but with time and hodling, a trip to the moon is in the\ncards. Don’t sell mis amigos never sell. You have to die to…",
  "original_created_utc": 1623521919,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近暗号に参加した投資家の多くは、現在かなり大きな損失を抱えています。\nしかし、我慢してください。 ローマは一日にして成らず、ランボは2021年にはないかもしれません。\n2021年にランボが登場することはないかもしれませんが、時間と努力があれば月への旅は可能です。\nカードです。Don't sell mis amigos never sell. あなたは死ななければならない...",
      "title": "2017年以前のcrypto hodlerの95%は、ある時点で赤字になっており、今日の太い利益に座ることができるように、鋼のボールを持っていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数最近加入加密货币的投资者目前正坐在一些相当大的损失上。\n但要有耐心，我的朋友们，罗马不是一天建成的，羔羊可能不会在2021年出现。\n2021年可能不会有，但随着时间的推移，上月球的旅行就在眼前。\n卡。不要卖，朋友们，永远不要卖。你必须死在...",
      "title": "95%的2017年和更早的加密货币霍德勒在某些时候深陷亏损，他们有钢铁般的胆量，为了能够坐在今天的肥沃收益上而持有。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數最近加入加密貨幣的投資者目前正坐在一些相當大的損失上。\n但要有耐心，我的朋友們，羅馬不是一天建成的，羔羊可能不會在2021年出現。\n2021年可能不會有，但隨着時間的推移，上月球的旅行就在眼前。\n卡。不要賣，朋友們，永遠不要賣。你必須死在...",
      "title": "95%的2017年和更早的加密貨幣霍德勒在某些時候深陷虧損，他們有鋼鐵般的膽量，爲了能夠坐在今天的肥沃收益上而持有。"
    }
  ],
  "title": "95% of 2017 and earlier crypto hodler were deep in the red at some point(s) and had balls of steel and held in order to be able to sit on fat gains today.",
  "created_utc": 1623540956,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most investors that have recently joined crypto are sitting on some pretty big losses atm but be patient my friends Rome wasn’t built in a day and lambos might not be in store for 2021 but with time and hodling, a trip to the moon is in the cards. Don’t sell mis amigos never sell. You have to die to reach Valhalla.</p>\n\n<p>Edit: some are pointing out the balls of steel point so im going to clear this up, diamond hands is a wsb thing. Balls of steel isn’t very inclusive so I suggest this sub coin the term reproductory organs of steel. Idk sounded better in my head.</p>\n</div><!-- SC_ON -->",
  "score": 853,
  "permalink": "/r/CryptoCurrency/comments/nyctu9/95_of_2017_and_earlier_crypto_hodler_were_deep_in/",
  "subreddit": "CryptoCurrency",
  "id": "nyctu9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009737359
}