{
  "author": "thorvoodam300",
  "original_created_utc": 1634955489,
  "title": "Why do some women have the audacity to hit/slap/punch a man and then get surprised when the man defends himself?",
  "created_utc": 1635000350,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is something we&#39;ve all seen on subreddits like <a href=\"/r/ActualPublicFreakouts\">r/ActualPublicFreakouts</a> and others like it. When a man and a woman are arguing about whatever it is they&#39;re arguing about (regardless of whatever the circumstances are), the woman would try to escalate and physically assaults him when it is proven that he did absolutely nothing wrong beforehand... and then they get surprised and even more pissed and call him out for hitting her when all he did was defend himself (which is a perfectly natural response). This is just something I never, ever, ever, ever, ever, ever understood. I mean, y&#39;all women know this is very much not legal, yet some of you do it anyway. I just don&#39;t understand this logic.</p>\n\n<p>And of course, I don&#39;t endorse men being the aggressor against a woman in any way just like how I don&#39;t endorse the other way around. Even if a woman hits you first, and what you do in response is send her to the hospital, then that makes you the aggressor by default. So if they try to start a fight with you, it only makes sense, and it is perfectly legal that you only treat them accordingly. I know some of y&#39;all are going to say &quot;Oh just be the bigger man and walk away!&quot; Yeah no. That doesn&#39;t work 100 percent of the time. </p>\n\n<p>So in general, this is just something that I never understood, and I&#39;m hoping that some of you could shed some light on this and help me alongside others understand. And if there are some tips about situations like this that you feel we should know about, then please feel free to share.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/qdvsd8/why_do_some_women_have_the_audacity_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "qdvsd8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is something we've all seen on subreddits like r/ActualPublicFreakouts\n[/r/ActualPublicFreakouts] and others like it. When a man and a woman are\narguing about whatever it is they're arguing about (regardless of whatever the\ncircumstances are), the woman would try to escalate and physically…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、r/ActualPublicFreakoutsのようなサブレディットで誰もが見たことがあるものです。\n[/r/ActualPublicFreakouts]などで紹介されています。男と女が\n男と女が何かについて言い争っているとき、（どんな状況であっても\n男と女が口論をしていると、女はエスカレートして物理的に...",
      "title": "なぜ一部の女性は大胆にも男性を殴り、叩き、殴り、そして男性が自分の身を守ると驚くのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这一点我们都在r/ActualPublicFreakouts等子版块上看到过。\n[/r/ActualPublicFreakouts]和其他类似的网站。当一个男人和一个女人在\n当一个男人和一个女人在争论他们正在争论的任何问题时（无论情况如何\n情况是什么），女人会试图升级并在身体上...",
      "title": "为什么有些女人胆敢打/拍/冲男人，然后在男人为自己辩护时感到惊讶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這一點我們都在r/ActualPublicFreakouts等子版塊上看到過。\n[/r/ActualPublicFreakouts]和其他類似的網站。當一個男人和一個女人在\n當一個男人和一個女人在爭論他們正在爭論的任何問題時（無論情況如何\n情況是什麼），女人會試圖升級並在身體上...",
      "title": "爲什麼有些女人膽敢打/拍/衝男人，然後在男人爲自己辯護時感到驚訝？"
    }
  ]
}