{
  "author": "ChossyStudebaker",
  "original_created_utc": 1640797157,
  "title": "High paying soul sucking job Vs. Emotionally great, but half the pay job.",
  "created_utc": 1640807164,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello internet, I’m in a fortunate situation, but could use the advice of strangers to decide what to do. After months and months of trying I finally have heard back from some job offers.&lt;/p&gt;\n\n&lt;p&gt;Job A pays a lot more than I’ve ever made over 100k. No health insurance, contractor work, lots of OT.  It would suck but I have a lot of debt and it’d help get rid of a big chunk fast. It’s also help me save for a house.&lt;/p&gt;\n\n&lt;p&gt;Job B is one I emotionally really care about. The pay is 55k, but with insurance and benefits. &lt;/p&gt;\n\n&lt;p&gt;I’ve weighed the pros and cons, but for some reason I am still going in a circle. The idea of getting rid of my debt and being able to save for a house for the first time in my life seems amazing. However I know it’ll be soul sucking and I won’t have much free time. On the other hand I know I would like job B but I’m so anxious with over 70k of debt from school and no savings to start a house fund it’s a burden. However I’m sure I’d be happier and feel like I’m contributing to society.&lt;/p&gt;\n\n&lt;p&gt;Both of these can be temporary or longer. However both rarely have openings and have made it clear if I say no now there will not be another chance with either for a long time.&lt;/p&gt;\n\n&lt;p&gt;Thank you for any input or advice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/rrcsk4/high_paying_soul_sucking_job_vs_emotionally_great/",
  "subreddit": "NoStupidQuestions",
  "id": "rrcsk4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello internet, I’m in a fortunate situation, but could use the advice of\nstrangers to decide what to do. After months and months of trying I finally have\nheard back from some job offers.\n\nJob A pays a lot more than I’ve ever made over 100k. No health insurance,\ncontractor work, lots of OT. It…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハローインターネット、私は幸運な状況にあるが、アドバイスの使用することができます。\nを決めるために、見知らぬ人が 何ヶ月も何ヶ月も試行錯誤の末に、ついに私は\nいくつかの仕事のオファーから返事が来ました。\n\nAの仕事は、私が今まで10万円以上稼いだことのある仕事よりもずっと高い給料です。健康保険はない。\n契約社員で、OTが多い。それは...",
      "title": "高給で魂を吸い取られる仕事Vs.感情的には最高だが給料は半分の仕事。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，互联网，我正处于一个幸运的境地，但可以利用陌生人的建议来决定做什么。\n陌生人的建议来决定该怎么做。经过几个月的努力，我终于有\n收到了一些工作机会的回复。\n\n工作A的工资比我曾经赚过的10万多很多。没有健康保险。\n承包工作，大量加班。它...",
      "title": "高薪吸人魂魄的工作与情感上很好，但薪水只有一半的工作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，互聯網，我正處於一個幸運的境地，但可以利用陌生人的建議來決定做什麼。\n陌生人的建議來決定該怎麼做。經過幾個月的努力，我終於有\n收到了一些工作機會的回覆。\n\n工作A的工資比我曾經賺過的10萬多很多。沒有健康保險。\n承包工作，大量加班。它...",
      "title": "高薪吸人魂魄的工作與情感上很好，但薪水只有一半的工作。"
    }
  ]
}