{
  "author": "zedsunn",
  "the_new_excerpt": "I'm Middle Eastern so I am unsure if this is a Western thing. Whenever I get\ndishes dirty I put them in the sink and run a little water over it so it doesn't\ndry out. When I'm ready to do the dishes, I will scrub each dish with a soapy\nsponge, put it on the bench top next to the sink (or a second…",
  "original_created_utc": 1617878733,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は中東人なので、これが西洋のものなのかどうかは不明です。食器が汚れたときは\n食器が汚れると、シンクに入れて少し水をかけて乾かないようにしています。\n乾燥しないようにしています。お皿を洗う準備ができたら、石けんを含んだスポンジでお皿をこすります。\nスポンジでこすり、シンクの横のベンチトップに置きます。",
      "title": "映画のように、水の入ったシンクで食器を洗う人は本当にいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是中东人，所以我不确定这是不是西方人的东西。每当我得到\n碗碟脏了，我就把它们放进水槽里，然后浇点水，这样就不会了\n晾干。当我准备好洗碗的时候，我会用肥皂擦洗每一个盘子。\n海绵，把它放在水槽旁边的台面上（或第二... ...",
      "title": "人们真的会像电影里那样在满是水的水槽里洗碗吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是中東人，所以我不確定這是不是西方人的東西。每當我得到\n碗碟髒了，我就把它們放進水槽裏，然後澆點水，這樣就不會了\n晾乾。當我準備好洗碗的時候，我會用肥皂擦洗每一個盤子。\n海綿，把它放在水槽旁邊的檯面上（或第二... ...",
      "title": "人們真的會像電影裏那樣在滿是水的水槽裏洗碗嗎？"
    }
  ],
  "title": "Do people really wash dishes in a sink full of water like in movies?",
  "created_utc": 1617887666,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m Middle Eastern so I am unsure if this is a Western thing. Whenever I get dishes dirty I put them in the sink and run a little water over it so it doesn&#39;t dry out. When I&#39;m ready to do the dishes, I will scrub each dish with a soapy sponge, put it on the bench top next to the sink (or a second sink if there is one), and when they&#39;re all soapy I quickly rinse them all and put them on the rack. I&#39;ve lived in Australia my whole life but a lot of my close friends/family are Asian/Middle Eastern and they all do the same. This feels like the best way to save water and get the dishes nice and clean. </p>\n\n<p>But in movies I always see a sink full of gross grey soapy water and people just pull scrubbed dishes out of it and put them on the rack !!!! Thought this was a weird movie thing but was cleaning up with my partner (white Australian), and he picked up my soapy unrinsed bowl to dry it!! I was grossed out that he&#39;d just do that but he told me it&#39;s normal???? Do you put your soapy dishes on the rack ? What if they have food grease on them ???? Is this normal ????????</p>\n</div><!-- SC_ON -->",
  "score": 361,
  "permalink": "/r/NoStupidQuestions/comments/mmp2ni/do_people_really_wash_dishes_in_a_sink_full_of/",
  "subreddit": "NoStupidQuestions",
  "id": "mmp2ni",
  "is_self": true,
  "media": null,
  "is_video": false
}