{
  "author": "UnexperiencedIT",
  "original_created_utc": 1640199817,
  "title": "Are BTC and ETH only \"Blue chips\" we have in cryptocurrencies?",
  "created_utc": 1640212568,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For all those who don&amp;#39;t know, blue chip is considered a financially stable company, in this case we are talking about cryptocurrencies where blue chip is considered to be every coin that has a market capital of over $ 2 billion. &lt;/p&gt;\n\n&lt;p&gt;Is that true in practice? I wouldn’t say, and before the coins had over $2 billion in market capital so they did good they are doing good but...&lt;/p&gt;\n\n&lt;p&gt;Their prices have dropped and market capital went down. People who invested in ATH waiting for that &amp;quot;forget and earn&amp;quot; burned themselves. Not saying that the projects are dead, but for someone who invested in ATH they could look dead.&lt;/p&gt;\n\n&lt;p&gt;So, apart from Bitcoin and Ethereum, what else do you consider a blue chip in cryptocurrencies?&lt;/p&gt;\n\n&lt;p&gt;Edit: wrote trillion on second paragraph instead of billion&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 230,
  "permalink": "/r/CryptoCurrency/comments/rmc7wa/are_btc_and_eth_only_blue_chips_we_have_in/",
  "subreddit": "CryptoCurrency",
  "id": "rmc7wa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For all those who don't know, blue chip is considered a financially stable\ncompany, in this case we are talking about cryptocurrencies where blue chip is\nconsidered to be every coin that has a market capital of over $ 2 billion.\n\nIs that true in practice? I wouldn’t say, and before the coins had…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルーチップとは、財務的に安定した企業であることを意味します。\nこの場合、暗号通貨について話しているのですが、ブルーチップというのは\n時価総額が20億ドル以上のコインはすべてそうだと考えられています。\n\n実際にそうなのでしょうか？私はそうは思いませんし、以前はコインが...",
      "title": "暗号通貨はBTCとETHだけが \"ブルーチップ \"なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于所有不知道的人来说，蓝筹股被认为是一个财务稳定的公司。\n公司，在这种情况下，我们谈论的是加密货币，其中蓝筹股被视为\n被认为是每一个市场资本超过20亿美元的硬币。\n\n在实践中是这样吗？我不会说，而在硬币有...",
      "title": "BTC和ETH是我们在加密货币中唯一的 \"蓝筹股 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於所有不知道的人來說，藍籌股被認爲是一個財務穩定的公司。\n公司，在這種情況下，我們談論的是加密貨幣，其中藍籌股被視爲\n被認爲是每一個市場資本超過20億美元的硬幣。\n\n在實踐中是這樣嗎？我不會說，而在硬幣有...",
      "title": "BTC和ETH是我們在加密貨幣中唯一的 \"藍籌股 \"嗎？"
    }
  ]
}