{
  "author": "bannercoin",
  "the_new_excerpt": "First, check https://istheshipstillstuck.com/ and if the answer is \"Yes\" on\nMonday morning, watch the action on oil tanker stocks.\n\nLast April, oil futures went negative which created the \"Tanker Gang.\" Shooting\nto meme status was one tanker stock, $NAT and the stock ran from under $3/share\nto…",
  "original_created_utc": 1616881482,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，查看https://istheshipstillstuck.com/，如果答案是 \"是\"，在\n周一上午，看油轮股的走势。\n\n去年4月，石油期货出现阴跌，这造就了 \"油轮帮\"。射击\n到备忘录的状态是一个油轮股票，$ NAT和股票从3元/股以下运行\n到...",
      "title": "坦克帮崛起；2020年重演？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，查看https://istheshipstillstuck.com/，如果答案是 \"是\"，在\n週一上午，看油輪股的走勢。\n\n去年4月，石油期貨出現陰跌，這造就了 \"油輪幫\"。射擊\n到備忘錄的狀態是一個油輪股票，$ NAT和股票從3元/股以下運行\n到...",
      "title": "坦克幫崛起；2020年重演？"
    }
  ],
  "title": "Tanker Gang Rise Up; a Repeat of 2020?",
  "created_utc": 1616900049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First, check <a href=\"https://istheshipstillstuck.com/\">https://istheshipstillstuck.com/</a> and if the answer is &quot;Yes&quot; on Monday morning, watch the action on oil tanker stocks.</p>\n\n<p>Last April, oil futures went negative which created the &quot;Tanker Gang.&quot; Shooting to meme status was one tanker stock, $NAT and the stock ran from under $3/share to $9/share in weeks.</p>\n\n<p>Most longtime tanker investors hate on $NAT because their CEO is a promoter and goes on Cramer. They don&#39;t like the fact their Suezmax ships are old and think their book value is overstated due to the age of their ships. Book value doesn&#39;t mean much for an operating company that&#39;s not in danger of bankruptcy. It&#39;s profits, cashflow and ability to service debt that really counts. They&#39;re able to keep these old ships running, even using the latest low sulphur fuels and pay most profits earned as dividends. They&#39;re basically the slumlords of tankers and if you&#39;ve ever been involved in real estate, you know those slums cash flow much better than Trump level properties.</p>\n\n<p>Nevertheless, tanker stocks generally suck and tanker gang got burned after oil futures trading returned to normal.</p>\n\n<p>We like short dated options plays on the tanker with the greatest meme power.</p>\n\n<p>Do what you will with this information. This is gambling, not investing and we don&#39;t provide financial advice.</p>\n</div><!-- SC_ON -->",
  "score": 142,
  "permalink": "/r/stocks/comments/menfzk/tanker_gang_rise_up_a_repeat_of_2020/",
  "subreddit": "stocks",
  "id": "menfzk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141540
}