{
  "author": "PunPryde",
  "original_created_utc": 1629011329,
  "title": "The Bitcoin golden cross is forming and will take place in mid-September, the first time in 1.5 years. This time it may ignite the bull cycle which takes us to $100,000 BTC.",
  "created_utc": 1629020036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So you&#39;ve probably heard a bunch already about the Bitcoin golden cross, this is when the 50 day moving average (DMA) crosses above the 200 day moving average. Others are calling for it in just days or hours but this is incorrect because the 50 DMA is crossing the 100 DMA right now, not 200 DMA. However, Bitcoin is on track to have the 50 DMA cross the 200 DMA in mid-September.    </p>\n\n<p>The last time this happened was in May 2020 which led to the price of BTC going from $8,000 to a peak of $64,800 (a +700% bull cycle). That bull cycle recently ended with the big crash a couple of months ago in May 2021. We also saw a death cross (bearish opposite of golden cross) in June 2021 which led to the price dropping from $41,300 to the low of $28,800 (-30% bear cycle).  </p>\n\n<p>That bear cycle is ending as we speak and a new golden cross should form in mid-September which could propel BTC&#39;s price to the $80,000+ range and finally hit the big $100,000 price point people have been yearning for awhile now. It should happen around late Late January 2022 to early March 2022. So if you&#39;re feeling bullish on Bitcoin&#39;s recent history-making rally and upcoming golden cross you should still buy now and HODL, not in Sept or Oct when the new bull cycle is well underway. Let&#39;s keep this train rolling!   </p>\n\n<p>PS. I just noticed it&#39;s my 12th Cake Day! Shared with automod who is only 9, I&#39;m older than auto mod haha. To celebrate my 12th Cake Day I bought some Bitcoin for the upcoming golden cross!</p>\n</div><!-- SC_ON -->",
  "score": 211,
  "permalink": "/r/CryptoCurrency/comments/p4ovix/the_bitcoin_golden_cross_is_forming_and_will_take/",
  "subreddit": "CryptoCurrency",
  "id": "p4ovix",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So you've probably heard a bunch already about the Bitcoin golden cross, this is\nwhen the 50 day moving average (DMA) crosses above the 200 day moving average.\nOthers are calling for it in just days or hours but this is incorrect because\nthe 50 DMA is crossing the 100 DMA right now, not 200 DMA.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインのゴールデンクロスについては、もう何度も耳にしていると思います。\nこれは、50日移動平均（DMA）が200日移動平均の上にクロスすることです。\nこれは50日移動平均線（DMA）が200日移動平均線を超えることです。\n50DMAは現在、200DMAではなく100DMAを越えています....",
      "title": "ビットコインのゴールデンクロスが形成されており、9月中旬に1.5年ぶりに行われます。今回は、BTC10万ドルを目指すブルサイクルに火をつけるかもしれない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，你可能已经听说了很多关于比特币金叉的事情，这就是\n当50天移动平均线（DMA）穿过200天移动平均线。\n其他人呼吁在短短几天或几个小时内实现，但这是不正确的，因为\n50DMA现在正穿过100DMA，而不是200DMA ....",
      "title": "比特币金叉正在形成，并将在9月中旬发生，这是1.5年来的第一次。这一次它可能会点燃牛市周期，使我们达到10万美元的BTC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，你可能已經聽說了很多關於比特幣金叉的事情，這就是\n當50天移動平均線（DMA）穿過200天移動平均線。\n其他人呼籲在短短几天或幾個小時內實現，但這是不正確的，因爲\n50DMA現在正穿過100DMA，而不是200DMA ....",
      "title": "比特幣金叉正在形成，並將在9月中旬發生，這是1.5年來的第一次。這一次它可能會點燃牛市週期，使我們達到10萬美元的BTC。"
    }
  ]
}