{
  "author": "OPINION_IS_UNPOPULAR",
  "the_new_excerpt": "Wallstreetbets is unique on reddit because of its... \"culture\". We are all here\nfor a single reason: To make money on high risk plays.\n\nGains made overnight, or by holding through hell and high water, are to be\nequally celebrated.\n\nLosses should be mocked, derided, and if unique enough, given the…",
  "original_created_utc": 1613010168,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Wallstreetbets在reddit上是独一无二的，因为它的... ... \"文化\"。我们都在这里\n只有一个原因。赚取高风险游戏的钱。\n\n一夜之间获得的收益，或通过地狱和高水位的持有，是为了让你的生活更美好。\n同样值得庆祝。\n\n失败应该被嘲笑，被贬低，如果足够独特，给... ...",
      "title": "Wallstreetbets状态的subreddit(华尔街日报)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Wallstreetbets在reddit上是獨一無二的，因爲它的... ... \"文化\"。我們都在這裏\n只有一個原因。賺取高風險遊戲的錢。\n\n一夜之間獲得的收益，或通過地獄和高水位的持有，是爲了讓你的生活更美好。\n同樣值得慶祝。\n\n失敗應該被嘲笑，被貶低，如果足夠獨特，給... ...",
      "title": "Wallstreetbets狀態的subreddit(華爾街日報)"
    }
  ],
  "title": "Wallstreetbets State of the Subreddit",
  "created_utc": 1613021278,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wallstreetbets is unique on reddit because of its... &quot;culture&quot;. We are all here for a single reason: To make money on high risk plays.</p>\n\n<p>Gains made overnight, or by holding through hell and high water, are to be equally celebrated. </p>\n\n<p>Losses should be mocked, derided, and if unique enough, given the high honor of being put into automod.</p>\n\n<p>At all costs, if we are to remain different than the rest of reddit, we must avoid the following:</p>\n\n<ul>\n<li><p>Politics, we&#39;re not here to change the world (sorry) - we just like the stock.</p></li>\n<li><p>Divisiveness, calling people bots and shills because they disagree with you only reduces diversity of thought, and drives away our best members.</p></li>\n<li><p>Repetitive content, we have just barely enough IQ points to focus on multiple stocks at once, not everything has to be GME or Weedstocks.</p></li>\n<li><p>Know it alls, remember rule 7 - &quot;No Bullshitting&quot;. Stay humble and ask about what you don&#39;t know. After being insulted a few times, someone will help you out.</p></li>\n</ul>\n\n<hr/>\n\n<h1>What you can do to keep this place great</h1>\n\n<ul>\n<li><p>Upvote new and interesting ideas. No one wants to see the front page filled with threads on the same stock or sector.</p></li>\n<li><p>Mock people for not understanding something and doing their research, and don&#39;t speak beyond your knowledge.</p></li>\n<li><p>Bring your own creative ideas to the table! Pick the dumbest company (over $1B market cap) and really read into their filings and let us know what you find!</p></li>\n<li><p>Keep content related to megathread topics in the megathread.</p></li>\n<li><p>Don&#39;t ask &quot;what the next move is&quot; - WSB is not your personal army, there is no agenda, no one speaks for WSB, and we don&#39;t &quot;pump and dump&quot; anything. Simply, we are a watering hole for risk loving individuals.</p></li>\n</ul>\n\n<hr/>\n\n<h1>What we&#39;re doing to keep this place great</h1>\n\n<ul>\n<li><p>The whole mod team has been working overtime, clearing out low quality content and keeping things fresh. Less than 1% of threads make it out of /new.</p></li>\n<li><p>In the absence of <a href=\"/u/zjz\">u/zjz</a>&#39;s incredible bots, we&#39;re building new tools to assist with moderation efforts, but remain hopeful that zjz can return soon.</p></li>\n<li><p>We&#39;re planning some fun community events. Can&#39;t say too much, but those of you who have been around will know. Guess we&#39;ll have to wait and see.</p></li>\n<li><p>We will be reintroducing stickied DD threads. These will be automatically stickied based on flair, with high account age restrictions.</p></li>\n</ul>\n\n<hr/>\n\n<h1>Why was my post/comment removed? CORRUPT!</h1>\n\n<p>Over the past week, there were multiple <em>really good</em> DDs and YOLOs on PRPL, FNKO, SNDL, and many other stocks. The kind of stuff that gives you hope that the old WSB is very much alive.</p>\n\n<p>But you may have missed them because the front page was dominated with GME related talk. </p>\n\n<p>Don&#39;t let the bandwagoners steal your fresh DD. Downvote spam and low effort posts, upvote innovative posts.</p>\n\n<hr/>\n\n<h1>A note on the moderation team:</h1>\n\n<p>The team we currently have (missing you <a href=\"/u/zjz\">u/zjz</a>) is the best we&#39;ve ever had. Everyone on this team is entirely committed to keeping the subreddit stable and top notch.</p>\n\n<p>This mod team is a completely different beast than the two mod teams evicted over the past year. They are the ones who have actually put work into the subreddit over the years, and aren&#39;t just inactive. They have poured their souls into this sub for years. Yes, some are using throwaways because they&#39;d rather not get doxxed (again), but if my vouch isn&#39;t enough, <a href=\"/u/zjz\">u/zjz</a> vouched for them as well.</p>\n\n<p>Making everyone a mod for a week, paper trading competitions, automod responses, the discord and plenty of other fun facets of the subreddit were done by this very team. If you don&#39;t know what I&#39;m talking about at this point, stick around. You&#39;ll have a blast.</p>\n\n<p>P.S. Dear SEC Intern: We don&#39;t endorse any tickers or movements. We&#39;re just here to trade and make dick jokes.</p>\n</div><!-- SC_ON -->",
  "score": 18568,
  "permalink": "/r/wallstreetbets/comments/lhal3x/wallstreetbets_state_of_the_subreddit/",
  "subreddit": "wallstreetbets",
  "id": "lhal3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123222513
}