{
  "author": "George4Mayor86",
  "original_created_utc": 1652901049,
  "title": "As an English speaker, it is generally much easier to learn Indo-European North Indian languages like Hindi and Bengali than Dravidian South Indian languages like Tamil and Telugu. Did the British Raj notice or comment on this? How did it effect imperial language policy?",
  "created_utc": 1652918459,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I lived in Sri Lanka for a while, and studied both Sinhalese (a North Indian language) and Tamil (South Indian). By the end of a year I could carry on a decent conversation in Sinhalese, but had barely gotten past the Tamil equivalent of &lt;em&gt;good morning.&lt;/em&gt; Did the officers of the British Raj notice this phenomenon? How, if at all, did it reflect British attitudes toward Indian languages?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/uskcay/as_an_english_speaker_it_is_generally_much_easier/",
  "subreddit": "AskHistorians",
  "id": "uskcay",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I lived in Sri Lanka for a while, and studied both Sinhalese (a North Indian\nlanguage) and Tamil (South Indian). By the end of a year I could carry on a\ndecent conversation in Sinhalese, but had barely gotten past the Tamil\nequivalent of good morning. Did the officers of the British Raj notice…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は一時期スリランカに住んでいたことがあり、シンハラ語（北インドの\nとタミル語（南インド語）を勉強しました。） 1年後には、シンハラ語でまともな会話ができるようになりました。\nシンハラ語でまともな会話ができるようになりましたが、タミール語では「おはようございます」くらいしか話せませんでした。\nタミール語で「おはようございます」と言うのがやっとでした。英国王立軍の将校は気づいていたのだろうか...。",
      "title": "英語圏の人間にとって、ヒンディー語やベンガル語などの印欧語は、タミル語やテルグ語などのドラヴィダ系南インド言語よりも、一般的にはるかに習得しやすいと言われています。このことに英国ラージは気づいたのか、あるいはコメントしたのか。また、このことは帝国の言語政策にどのような影響を与えたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾在斯里兰卡生活过一段时间，并学习了僧伽罗语（一种北印度语\n语言）和泰米尔语（南印度语）。一年结束时，我可以用僧伽罗语进行体面的对话。\n僧伽罗语进行体面的对话，但对泰米尔语几乎没有任何了解。\n僧伽罗语中的 \"早上好\"。大英帝国的官员们是否注意到...",
      "title": "作为一个讲英语的人，学习印欧语系的北印度语言如印地语和孟加拉语一般要比学习德拉维德系的南印度语言如泰米尔语和泰卢固语容易得多。大英帝国是否注意到或评论到这一点？它是如何影响帝国的语言政策的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾在斯里蘭卡生活過一段時間，並學習了僧伽羅語（一種北印度語\n語言）和泰米爾語（南印度語）。一年結束時，我可以用僧伽羅語進行體面的對話。\n僧伽羅語進行體面的對話，但對泰米爾語幾乎沒有任何瞭解。\n僧伽羅語中的 \"早上好\"。大英帝國的官員們是否注意到...",
      "title": "作爲一個講英語的人，學習印歐語系的北印度語言如印地語和孟加拉語一般要比學習德拉維德系的南印度語言如泰米爾語和泰盧固語容易得多。大英帝國是否注意到或評論到這一點？它是如何影響帝國的語言政策的？"
    }
  ]
}