{
  "author": "mushroommaggie",
  "original_created_utc": 1647537877,
  "title": "Would it be irresponsible of me to visit my parents 40 minutes away while my son is at school?",
  "created_utc": 1647554676,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My son is 6 and in Kindergarten. We&amp;#39;re very lucky to live about a 4 minute drive from his school. My dad is currently home recovering from his second stroke in 6 weeks, and I&amp;#39;d like to bring my daughter (who&amp;#39;s 2 and not in school or daycare yet) to visit them during the day, but I worry about being too far from the school in case of an emergency. My husband works about 30 minutes away, but is occasionally much farther away, depending on where his job sends him that day. In case of a serious emergency, my best friend lives/works in the next town over, about 10-15 minutes away, and she does have pick-up/emergency contact priveleges with the school. Am I unnecessarily limiting myself, or is it sensible to stay closer?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/tgfdrs/would_it_be_irresponsible_of_me_to_visit_my/",
  "subreddit": "NoStupidQuestions",
  "id": "tgfdrs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My son is 6 and in Kindergarten. We're very lucky to live about a 4 minute drive\nfrom his school. My dad is currently home recovering from his second stroke in 6\nweeks, and I'd like to bring my daughter (who's 2 and not in school or daycare\nyet) to visit them during the day, but I worry about being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の息子は6歳で、幼稚園児です。車で4分のところに住んでいて、とてもラッキーです。\n学校から 父は今、6年ぶり2回目の脳梗塞で自宅療養中です。\n2歳の娘（学校にも保育園にも行っていない）を連れて行きたいと思います。\n日中お見舞いに行きたいと思うのですが、どうしたらいいのか...。",
      "title": "息子が学校に行っている間に、40分離れた実家を訪れるのは無責任でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的儿子今年6岁，正在上幼儿园。我们很幸运，住在离他的学校只有4分钟车程的地方。\n他的学校。我父亲目前正在家中恢复他6周内的第二次中风。\n我想带我的女儿（她才2岁，还没有上学或入托）白天去看他们。\n我想在白天带我的女儿（她才2岁，还没有上学或入托）去看他们，但我担心会被...",
      "title": "当我的儿子在学校时，我去看望40分钟外的父母，这是否是不负责任的行为？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的兒子今年6歲，正在上幼兒園。我們很幸運，住在離他的學校只有4分鐘車程的地方。\n他的學校。我父親目前正在家中恢復他6周內的第二次中風。\n我想帶我的女兒（她才2歲，還沒有上學或入托）白天去看他們。\n我想在白天帶我的女兒（她才2歲，還沒有上學或入托）去看他們，但我擔心會被...",
      "title": "當我的兒子在學校時，我去看望40分鐘外的父母，這是否是不負責任的行爲？"
    }
  ]
}