{
  "author": "Amichateur",
  "original_created_utc": 1635088404,
  "title": "[Awareness/Proposal] The multitude of different \"derivation paths\" in BIP32 Bitcoin wallets causes incompatibility all around when it comes to wallet seed restore operation for non-tech-savy users.",
  "created_utc": 1635111313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>NOTE: Purpose of this post is to draw attention to a possibility for improving Bitcoin and its wallet ecosystem constructively, so please do not blindly hate and downvote based on a false understanding that this is harmful criticisms. It is not. Negating a fruitful constructive dialogue would be harmful.</em></p>\n\n<hr/>\n\n<p>Nowadays different BIP32 wallets use different derivation paths. This means that even with a properly backupped seed a non-tech-savy user may see zero balance when restoring this seed with another wallet even if that wallet advertises to use the same BIP32-based hierarchical deterministic wallet.</p>\n\n<p>Reason for this &quot;mess&quot; is partly historical, partly programmer lazyness, partly proprietariness:<br/>\nBIP32 and hierarchical wallet methods have evolved over time, and depending when the wallet came out, different derivation paths were used. Some wallet programmers seem to prefer short derivation paths not following BIP32 recommendations apparently to save some lines of code in implementation efforts. Again other wallets find special reasons for using proprietary non-standard derivation paths for special purposes (e.g. Samourai).</p>\n\n<p>See <a href=\"https://walletsrecovery.org\">https://walletsrecovery.org</a> for details.</p>\n\n<p>Nowadays, derivation paths most common and recommended by BIP32 are</p>\n\n<ul>\n<li>m/44&#39;/0&#39;/0&#39;</li>\n<li>m/49&#39;/0&#39;/0&#39;</li>\n<li>m/84&#39;/0&#39;/0&#39;</li>\n</ul>\n\n<p>for the three bitcoin address formats, respectively.</p>\n\n<p>But others still exist for legacy reasons, like     </p>\n\n<ul>\n<li>m/0&#39; (e.g. BRD wallet, Multibit HD wallet)</li>\n<li>m/0&#39;/0&#39; (bitcoin core, historically)</li>\n<li>m/44&#39;/0&#39;/n&#39; (blockchain.com proprietary)</li>\n<li>m/44&#39;/n&#39;/0&#39; (n=0, 1, 133, 145)</li>\n<li>m/84&#39;/0&#39;/n&#39;</li>\n<li>m/49/0/X (note the missing &#39; everywhere!)</li>\n<li>m/47&#39;/0&#39;/0&#39;</li>\n<li>m/45&#39;/...</li>\n<li>m/48&#39;/...</li>\n</ul>\n\n<p>Note that n and X above denote variables from 0 to 2147483647, whereas m is a fixed letter that stands for &quot;master&quot;. The &#39; stands for &quot;hardened&quot; and is also written as h or H is some implementations.</p>\n\n<p>Since the number on each derivation path level can go from 0 to 2147483647 and can be with or without the &#39; , and since there can be an (almost?) arbitrary number of levels, the number of derivation paths is practically endless, and checking all of them would take an astronomical amount of times longer than the age of the universe even with all computer power on earth. Therefore it is not possible for any wallet to check all possible derivation paths when the user restores a wallet seed.</p>\n\n<p>Therefore we can assume that wallets only check for &quot;their own&quot; derivation path(s) when a wallet seed is restored, and this means that they might be missing bitcoins if the seed was formerly used in another wallet SW/HW.</p>\n\n<p>We do not know how BIP32 will evolve in the future. Maybe in 10 years from now today&#39;s mainstream derivation paths will be obsolete and not checked any more by default by standard wallets.</p>\n\n<p>Therefore, everybody making a wallet seed backup is also strongly advised to back up the derivation path and the algorithm. Or at least noting next to the seed which wallet SW and which wallet version this seed was used with.</p>\n\n<p>From wallet SW and BIP standardisation point of view it is desirable that</p>\n\n<ul>\n<li>(a) A new &quot;BIP nnn&quot; is created that defines sets of derivation paths (like the ones listed above) that are used/checked for a given wallet seed, and</li>\n<li>(b1) A wallet SW that calls itself &quot;BIP nnn version R compliant for restore&quot; must check for all these derivation paths upon wallet seed restore, such that no funds are lost or missed, and</li>\n<li>(b2) A wallet SW that calls itself &quot;BIP nnn version U compliant for own seed usage&quot; must guarantee not to use other derivation paths than those listed in &quot;BIP nnn ver. U when operating on a self generated seed.</li>\n<li>(b3) A wallet SW should also display the BIP nnn version U for every wallet in use such that the user knows that for a later restore he needs a wallet SW whose BIP nnn version R for restore is at least &gt;= U.</li>\n</ul>\n\n<p>W.r.t. (a), this BIP nnn should be updated (i.e. the list of derivation paths extended) whenever a wallet wants to use derivation paths not yet in this list. Then this wallet should apply for a new BIP nnn version.</p>\n\n<p>Then the BIP nnn should be versioned every time the set of seeds is enhanced.</p>\n\n<p>Then, w.r.t. (b), a wallet SW/HW can advertise to be &quot;compliant to BIP nnn version R for seed restoration&quot; (higher R = better for compatibility) and &quot;compliant to BIP nnn version U&quot; w.r.t. derivation path usage for self-generated seeds (lower U = better for compatibility).</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/Bitcoin/comments/qeu3j7/awarenessproposal_the_multitude_of_different/",
  "subreddit": "Bitcoin",
  "id": "qeu3j7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "NOTE: Purpose of this post is to draw attention to a possibility for improving\nBitcoin and its wallet ecosystem constructively, so please do not blindly hate\nand downvote based on a false understanding that this is harmful criticisms. It\nis not. Negating a fruitful constructive dialogue would be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "注：この記事の目的は、ビットコインとそのウォレットのエコシステムを建設的に改善する可能性に注意を喚起することです。\nこの投稿の目的は、ビットコインとそのウォレットのエコシステムを建設的に改善する可能性に注目することです。\nしたり、有害な批判であるという誤った理解に基づいてダウンボートしたりしないでください。そうではありません。\nそうではありません。実りある建設的な対話を否定することは...",
      "title": "[啓発・提案】 BIP32ビットコインウォレットの「導出経路」が多数存在するため、技術に詳しくないユーザーがウォレットの種の復元操作をする際に、あらゆる面で互換性がない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "注意：这篇文章的目的是提请注意一个可以改善\n的可能性，所以请不要盲目地讨厌\n并基于错误的理解，认为这是有害的批评，而进行降票。它\n并非如此。否定一个富有成效的建设性对话将是...",
      "title": "[认识/建议] BIP32比特币钱包中众多不同的 \"派生路径\"，在涉及到钱包种子恢复操作时，对不懂技术的用户来说，会造成不兼容。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "注意：這篇文章的目的是提請注意一個可以改善\n的可能性，所以請不要盲目地討厭\n並基於錯誤的理解，認爲這是有害的批評，而進行降票。它\n並非如此。否定一個富有成效的建設性對話將是...",
      "title": "[認識/建議] BIP32比特幣錢包中衆多不同的 \"派生路徑\"，在涉及到錢包種子恢復操作時，對不懂技術的用戶來說，會造成不兼容。"
    }
  ]
}