{
  "author": "bardooneness",
  "the_new_excerpt": "Please Delete Robinhood!\n\nDon’t wait for the next disaster.\n\nIt’s a scam broker! You don’t own your crypto on Robinhood.\n\nRobinhood makes millions selling your pre-market order info stock trades to the\nCitadel and Wall Street.\n\nThey will do same to BTC as they are doing now to the people holding…",
  "original_created_utc": 1617389495,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "请删除Robinhood！\n\n不要等待下一个灾难。\n\n这是个骗子经纪商! 在Robinhood上你并不拥有你的加密货币。\n\nRobinhood把您的市场前订单信息股票交易卖给市场，赚取数百万美元。\nCitadel和华尔街。\n\n他们会对BTC做同样的事情，就像现在对持有BTC的人做的一样... ...",
      "title": "删除Robinhood(如果你还没有删除)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請刪除Robinhood！\n\n不要等待下一個災難。\n\n這是個騙子經紀商! 在Robinhood上你並不擁有你的加密貨幣。\n\nRobinhood把您的市場前訂單信息股票交易賣給市場，賺取數百萬美元。\nCitadel和華爾街。\n\n他們會對BTC做同樣的事情，就像現在對持有BTC的人做的一樣... ...",
      "title": "刪除Robinhood(如果你還沒有刪除)"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "ロビンフッドを削除してください。\n\n次の災害を待つ必要はありません。\n\nそれは詐欺のブローカーです! ロビンフッドでは自分の暗号を所有していません。\n\nRobinhoodはあなたの市場前注文情報の株式取引をシタデルやウォールストリートに売って数百万を稼いでいます。\nシタデルとウォール街に\n\n彼らはBTCにも同じことをするだろう、彼らが今、保有している人々にしているように...",
      "title": "Robinhoodを削除する（まだ削除していない場合）。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "ロビンフッドを削除してください。\n\n次の災害を待つ必要はありません。\n\nそれは詐欺のブローカーです! ロビンフッドでは自分の暗号を所有していません。\n\nRobinhoodはあなたの市場前注文情報の株式取引をシタデルやウォールストリートに売って数百万を稼いでいます。\nシタデルとウォール街に\n\n彼らはBTCにも同じことをするだろう、彼らが今、保有している人々にしているように...",
      "title": "Robinhoodを削除する（まだ削除していない場合）。"
    }
  ],
  "title": "Delete Robinhood (if you still haven’t)",
  "created_utc": 1617402901,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Please Delete Robinhood!</p>\n\n<p>Don’t wait for the next disaster.</p>\n\n<p>It’s a scam broker! You don’t own your crypto on Robinhood.</p>\n\n<p>Robinhood makes millions selling your pre-market order info stock trades to the Citadel and Wall Street.</p>\n\n<p>They will do same to BTC as they are doing now to the people holding stock shares... Citadel hedge funds CEO is a shadow owner/member of the Robinhood broker.\nLead trader at Citadel is Jeffrey Psaki, portfolio manager Citadel LLC is Jen Psaki White House Press Secretary brother.\nUse Degiro for EU, Fidelity for the USA or any other safe platform.\nYou can imagine how many years they scammed ordinary people whose call for help nobody has noticed until now, if it wasn’t for the voice of 6 million Redditors we would probably never know about it and Robinhood would continue to cheat and scam people.</p>\n\n<p>Wall Street corporations cannot limit public access to the free market, nor should they censor discussion surrounding it, particularly for their own benefit. This apparent coordination between hedge funds, trading platforms, and web servers to shut down threats to their market dominance is shockingly unprecedented and wrong. It stinks of corruption! Multiple brokerages blocked the ability of small investors to buy more GameStop and other stocks..., is it Bitcoin next?!</p>\n\n<p>Robinhood even restricted trading in cryptocurrencies, citing “extraordinary market conditions”</p>\n\n<p>Report and Request from iTunes and Android to remove the scam application from their store after you leave a bad review.</p>\n\n<p>*** Angry traders swarmed the app’s Google reviews page, only for Google to remove hundreds thousands of negative ratings on Friday the 29/01/21. A class action lawsuit against Robinhood was filed with the Securities and Exchange Commission on Thursday. Attorneys-general of New York and Texas are reportedly looking into Robinhood and other companies over their conduct in limiting stock buys.***</p>\n\n<p>Bankrupt Robinhood!</p>\n\n<p>Give a lesson to the future Scammer to be Brokers.\nWhen Robinhood goes IPO, don’t buy. Don’t even buy Coinbase for that matter.</p>\n\n<p>I should note that if you have a Robinhood Crypto account, crypto is not included under their SIPC protection. This means that 100% of whatever balances you might haven in the crypto account could potentially be lost and not recovered during a bankruptcy. You can also not move your crypto off of Robinhood of PayPal. They are rehypothicating the assets and you don’t own them, just a paper copy.</p>\n\n<p>Not your keys, not your crypto!</p>\n\n<p>Power to the people!</p>\n\n<p>Sorry for the repost, but we need to remind people before the next disaster. This group is over 2 million members and it is our responsibility to help the noobs.</p>\n</div><!-- SC_ON -->",
  "score": 1153,
  "permalink": "/r/CryptoCurrency/comments/miqurh/delete_robinhood_if_you_still_havent/",
  "subreddit": "CryptoCurrency",
  "id": "miqurh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875620
}