{
  "author": "badlybarding",
  "original_created_utc": 1637506748,
  "title": "How much of the smallpox fatality rate was due to poor healthcare, nutrition and limited disease knowledge vs. actual deadliness of the virus?",
  "created_utc": 1637531049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Smallpox killed about 30% of those it infected and the numbers were even higher among populations with no exposure. If small pox returned, most of the population would have no exposure or vaccination history. But with more knowledge of viruses and better healthcare today, do we have a sense of how deadly it would actually be?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/qywo6p/how_much_of_the_smallpox_fatality_rate_was_due_to/",
  "subreddit": "askscience",
  "id": "qywo6p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Smallpox killed about 30% of those it infected and the numbers were even higher\namong populations with no exposure. If small pox returned, most of the\npopulation would have no exposure or vaccination history. But with more\nknowledge of viruses and better healthcare today, do we have a sense of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "天然痘では感染者の約30％が死亡し、感染していない集団ではさらに高い死亡率を示した。\n天然痘に感染していない人々の死亡率はさらに高かった。もし、天然痘が再発したら、ほとんどの人は\n集団のほとんどは、天然痘にかかったこともワクチンを接種したこともないでしょう。しかし、ウイルスに関する知識が深まり\nしかし、ウイルスに関する知識が増え、医療水準が向上した現在、私たちはそのような感覚を持っているでしょうか？",
      "title": "天然痘の致死率は、医療や栄養状態の悪さや病気に関する知識の少なさと、ウイルスの実際の致死率とでは、どれくらいの差があるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "天花使大约30%的受感染者死亡，在没有接触过天花的人群中，这一数字甚至更高。\n在没有接触过的人群中，这个数字甚至更高。如果天花再次出现，大多数人\n人口将没有接触或接种疫苗的历史。但随着\n今天对病毒有了更多的了解，也有了更好的医疗保健，我们是否有一种感觉？",
      "title": "在天花的死亡率中，有多少是由于医疗条件差、营养不良和疾病知识有限与病毒的实际致命性造成的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "天花使大約30%的受感染者死亡，在沒有接觸過天花的人羣中，這一數字甚至更高。\n在沒有接觸過的人羣中，這個數字甚至更高。如果天花再次出現，大多數人\n人口將沒有接觸或接種疫苗的歷史。但隨着\n今天對病毒有了更多的瞭解，也有了更好的醫療保健，我們是否有一種感覺？",
      "title": "在天花的死亡率中，有多少是由於醫療條件差、營養不良和疾病知識有限與病毒的實際致命性造成的？"
    }
  ]
}