{
  "author": "TicklingTentacles",
  "original_created_utc": 1632301280,
  "title": "Marco Polo claimed human flesh was sold for food in the meat markets in Fujian. Is there any evidence that cannibalism was this commonplace or even tolerated in 13th century China?",
  "created_utc": 1632379819,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The description Marco Polo gave (or rather, the description that <em>Rustichello</em> gave) suggests human flesh was sold as a food commodity alongside other types of meat in Fujian.  This city was not under siege when this description was made, so this instance(s) of cannibalism was not caused by extreme pressure or people starving and resorting to extreme measure to survive. I thought it was a very peculiar detail and I’ve never heard it before and to be honest, it doesn’t seem factual. </p>\n\n<p>If any historians know the answer, I would be delighted to know the truth.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pt3hoq/marco_polo_claimed_human_flesh_was_sold_for_food/",
  "subreddit": "AskHistorians",
  "id": "pt3hoq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The description Marco Polo gave (or rather, the description that Rustichello\ngave) suggests human flesh was sold as a food commodity alongside other types of\nmeat in Fujian. This city was not under siege when this description was made, so\nthis instance(s) of cannibalism was not caused by extreme…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マルコポーロが書いた記述（というか、ラスティケロが書いた記述）を見ると\n福建省では人肉が他の肉と一緒に食用として売られていたことを示唆している。\n福建省では人肉が他の種類の肉と一緒に食用として売られていた。この記述がなされた時、この都市は包囲されていなかったので\nこのカニバリズムの事例は、極端な...が原因ではない。",
      "title": "マルコポーロは、福建省の肉市場で人肉が食用として売られていたと言っている。13世紀の中国でカニバリズムがこれほど日常的に行われていた、あるいは許容されていたという証拠はあるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "马可-波罗的描述（或者说，Rustichello的描述\n的描述）表明，在福建，人肉是作为一种食品与其他类型的肉一起出售的。\n在福建，人肉被当作食品与其他类型的肉一起出售。这段描述的时候，这座城市并没有被围困，所以\n这起吃人事件不是由极端的......引起的。",
      "title": "马可-波罗声称，在福建的肉食市场上，人肉被卖作食物。有任何证据表明，在13世纪的中国，吃人是如此普遍，甚至被容忍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "馬可-波羅的描述（或者說，Rustichello的描述\n的描述）表明，在福建，人肉是作爲一種食品與其他類型的肉一起出售的。\n在福建，人肉被當作食品與其他類型的肉一起出售。這段描述的時候，這座城市並沒有被圍困，所以\n這起喫人事件不是由極端的......引起的。",
      "title": "馬可-波羅聲稱，在福建的肉食市場上，人肉被賣作食物。有任何證據表明，在13世紀的中國，喫人是如此普遍，甚至被容忍？"
    }
  ]
}