{
  "author": "evDev84",
  "original_created_utc": 1641422526,
  "title": "\"Anybody else excited!?\" No. I'm not. This sucks and I have no problem saying it.",
  "created_utc": 1641443641,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It takes weeks upon weeks to slowly climb in the charts, then within a few hours it we&amp;#39;re right back to where we were months ago?  Yeah, that blows.  The fact that crypto is just some game for rich people to dip out of the microsecond something threatening from the Fed happens sucks.  The fact that people bought only to see things dip like crazy sucks.  &lt;/p&gt;\n\n&lt;p&gt;And most importantly - all the people who are curious about crypto, and want to learn more and get in, but then see the prospect of losing 15% of their investment in a couple of hours and avoid crypto like the plague, THAT FUCKIN SUCKS.&lt;/p&gt;\n\n&lt;p&gt;Sure, buy the dip if you&amp;#39;ve got money, make your trades, come here and make your post assuring everyone everything will be ok and act like we&amp;#39;re all idiots who can&amp;#39;t see you&amp;#39;re just assuring yourself more than anyone.  I&amp;#39;m not impressed anymore.  It&amp;#39;s fine for all of us to be bummed about this, and it would be great if this subreddit was a place that didn&amp;#39;t make anyone who felt that way feel like some kind of stupid investor for having those feelings.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit&lt;/strong&gt;:  alright I&amp;#39;m disabling inbox replies now.  Nothing new being said, my responses are clear, and there&amp;#39;s now countless comments doing exactly the very thing I called out.  All I&amp;#39;ll say is if you&amp;#39;re feeling bummed today, you&amp;#39;re not stupid, you&amp;#39;re not a bad investor, and it &lt;strong&gt;absolutely does not mean you should leave crypto.&lt;/strong&gt;  It&amp;#39;s a normal reaction and having that feeling isn&amp;#39;t the same as throwing in the towel and giving up.  Peace&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 466,
  "permalink": "/r/CryptoCurrency/comments/rwywij/anybody_else_excited_no_im_not_this_sucks_and_i/",
  "subreddit": "CryptoCurrency",
  "id": "rwywij",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It takes weeks upon weeks to slowly climb in the charts, then within a few hours\nit we're right back to where we were months ago? Yeah, that blows. The fact that\ncrypto is just some game for rich people to dip out of the microsecond something\nthreatening from the Fed happens sucks. The fact that…"
}