{
  "author": "curiously_clueless",
  "original_created_utc": 1644591413,
  "title": "What's the most common unattractive feature you've come across in an otherwise good person",
  "created_utc": 1644611797,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I say &amp;#39;good person&amp;#39; let&amp;#39;s set the bar. Someone who isn&amp;#39;t racist, sexist, homophobic, rude, etc. Someone you&amp;#39;d actually be friends with. Someone responsible enough you&amp;#39;d let them watch your dog, cat, goldfish, etc.&lt;/p&gt;\n\n&lt;p&gt;Despite all of this there are some qualities which people find unattractive in an otherwise decent person. What&amp;#39;s the most common thing you&amp;#39;ve come across?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Edit: &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve gotten a lot of people providing examples of rudeness, homophobia, etc.  As I said in my original post&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Someone who isn&amp;#39;t racist, sexist, homophobic, rude, etc.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I do not see this as the behavior of a &amp;#39;good&amp;#39; person.  I feel I need to stress this, as pointing this out in a comment is considered &amp;#39;derailing&amp;#39; by the mods.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskWomen/comments/sq1a2a/whats_the_most_common_unattractive_feature_youve/",
  "subreddit": "AskWomen",
  "id": "sq1a2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I say 'good person' let's set the bar. Someone who isn't racist, sexist,\nhomophobic, rude, etc. Someone you'd actually be friends with. Someone\nresponsible enough you'd let them watch your dog, cat, goldfish, etc.\n\nDespite all of this there are some qualities which people find unattractive…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いい人」と言ったら、ハードルを上げよう。人種差別や性差別をしない人。\n同性愛嫌悪、無礼など 実際に友達になれるような人 誰か\n犬、猫、金魚などを見てもらえるような責任感のある人。\n\nそれでも、人が魅力を感じない資質もある...。",
      "title": "あなたが今まで出会った良い人の中で、最も多い非モテポイントは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我说 \"好人 \"时，让我们设定一个标准。一个没有种族主义者、性别歧视者、同性恋者、粗鲁等等的人。\n恐同症、粗鲁等等。一个你真正愿意和他做朋友的人。有责任心的人\n足够负责任的人，你会让他们照看你的狗、猫、金鱼等。\n\n尽管如此，还是有一些人们认为不具吸引力的品质......",
      "title": "你在一个优秀的人身上遇到的最常见的不吸引人的特征是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我說 \"好人 \"時，讓我們設定一個標準。一個沒有種族主義者、性別歧視者、同性戀者、粗魯等等的人。\n恐同症、粗魯等等。一個你真正願意和他做朋友的人。有責任心的人\n足夠負責任的人，你會讓他們照看你的狗、貓、金魚等。\n\n儘管如此，還是有一些人們認爲不具吸引力的品質......",
      "title": "你在一個優秀的人身上遇到的最常見的不吸引人的特徵是什麼？"
    }
  ]
}