{
  "author": "UnrulySasquatch1",
  "original_created_utc": 1629904096,
  "title": "You are wrong about ETH2. It won't solve fees",
  "created_utc": 1629960076,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>ETH2 will immediately solve all the fee issues right??</p>\n\n<p>Short answer, it doesn&#39;t. That is, assuming you are referring to the merge as ETH2.</p>\n\n<p>ETH2 refers to the merge, but the sentiment that the merge will solve scaling issues is old and now outdated. Originally the PoS chain was intended to get sharding before the merge occurs, putting the merge date most likely in 2023 sometime. However, due to pressure from miners, especially around EIP1559, it was decided to do a minimum viable merge without sharding. </p>\n\n<p>Sharding is the piece that significantly increases throughout and drops transaction fees. So originally, yes, ETH2 would drop fees significantly. But now that the merge was pushed up ahead of sharding, the merge itself won&#39;t solve the scaling issues.</p>\n\n<p>ETH2 was intended to be a big update that solves all the issues, but it has been split up and re-arranged. For some reason the name ETH2 stuck and some people use it to refer to the merge and some people use it (more appropriately) to refer to after the merge when sharding is added.</p>\n\n<p>The PoS merge will not solve the scaling issues. There is a 9% throughput increase, but that will be hardly noticable in day to day. Sharding will solve these issues, but it that isnt coming until around 2023 and layer 2s/side chains will help with this. These are here now.</p>\n\n<p>So please, if you see people posting that the merge will solve the scaling issues, politely inform them that sharding and layer 2s will do this, not the merge.</p>\n\n<p>People had a similar misconception that EIP1559 would significantly decrease fees and I want to avoid that for the merge.</p>\n\n<p>EDIT: For more info on Sharding, see my write-up here:</p>\n\n<p><a href=\"https://np.reddit.com/r/ethereum/comments/p0dpws/Burning_30%25_of_coins_minted_daily_on_average/h874ipe/?utm_medium=android_app&amp;utm_source=share&amp;context=3\">https://np.reddit.com/r/ethereum/comments/p0dpws/Burning_30%25_of_coins_minted_daily_on_average/h874ipe/?utm_medium=android_app&amp;utm_source=share&amp;context=3</a></p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pbd5su/you_are_wrong_about_eth2_it_wont_solve_fees/",
  "subreddit": "CryptoCurrency",
  "id": "pbd5su",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ETH2 will immediately solve all the fee issues right??\n\nShort answer, it doesn't. That is, assuming you are referring to the merge as\nETH2.\n\nETH2 refers to the merge, but the sentiment that the merge will solve scaling\nissues is old and now outdated. Originally the PoS chain was intended to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETH2は、すべての手数料の問題を即座に解決してくれるのでしょうか？\n\n短い答えですが、それはありません。つまり、あなたが合併をETH2と呼んでいると仮定すると\nETH2です。\n\nETH2は合併のことを指していますが、合併によってスケーリングの問題が解決されるという感情は古く、今や時代遅れです。\n問題を解決するという感情は古く、今では時代遅れになっています。もともとPoSチェーンの目的は...",
      "title": "ETH2については間違っている。手数料の解決にはならない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ETH2会立即解决所有的费用问题吧？\n\n简短的回答，它不会。也就是说，假设你指的是合并后的\nETH2。\n\nETH2指的是合并，但认为合并将解决规模问题的看法\n问题是老生常谈，现在已经过时了。最初，PoS链的目的是为了...",
      "title": "你对ETH2的看法是错误的。它不会解决费用问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ETH2會立即解決所有的費用問題吧？\n\n簡短的回答，它不會。也就是說，假設你指的是合併後的\nETH2。\n\nETH2指的是合併，但認爲合併將解決規模問題的看法\n問題是老生常談，現在已經過時了。最初，PoS鏈的目的是爲了...",
      "title": "你對ETH2的看法是錯誤的。它不會解決費用問題"
    }
  ]
}