{
  "author": "xXAudacityXx",
  "the_new_excerpt": "So I’ll try to make a long story short but back in the summer time, I was turned\non to the DEX hype and all the defi jazz. Played around on Uniswap and didn’t\nreally make much and spent more on gas prices than I made profit. Things got\nrough financially and I had to pull everything. Soon after, the…",
  "original_created_utc": 1612259131,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我想长话短说，但在夏天的时候，我被转成了\n在DEX的炒作和所有defi爵士。在Uniswap上玩了一圈，并没有。\n真的赚了很多，花在油价上的钱比我赚的利润还多。事情变得\n艰难的经济，我不得不拉的一切。不久之后，...",
      "title": ""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我想長話短說，但在夏天的時候，我被轉成了\n在DEX的炒作和所有defi爵士。在Uniswap上玩了一圈，並沒有。\n真的賺了很多，花在油價上的錢比我賺的利潤還多。事情變得\n艱難的經濟，我不得不拉的一切。不久之後，...",
      "title": ""
    }
  ],
  "title": "OMG! I found out I was sitting on 8K worth of UNI!!",
  "created_utc": 1612301513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’ll try to make a long story short but back in the summer time, I was turned on to the DEX hype and all the defi jazz. Played around on Uniswap and didn’t really make much and spent more on gas prices than I made profit. Things got rough financially and I had to pull everything. Soon after, the market took off without me. And I watched as everybody enjoyed their gains. I kept an eye on crypto for the most part but I never had any extra funds to contribute. </p>\n\n<p>Well, last night I was watching ChicoCrypto and he mentioned an app called Zerion which is basically a one stop shop for to track your defi portfolio. I connected my wallet and then to my surprise, it said I had $7900?? 400 UNI unclaimed. I thought it was too good to be true but I logged into UniSwap and sure enough, 400 tokens I never claimed. </p>\n\n<p>I know if I’d known this before I wouldn’t have had the balls to Hodl but blessing come in many different ways. </p>\n\n<p>So if you used UniSwap prior to September 2020 and had no idea about the airdrop then go link the wallet you used and claim your 8k!!</p>\n</div><!-- SC_ON -->",
  "score": 211,
  "permalink": "/r/CryptoCurrency/comments/las3zg/omg_i_found_out_i_was_sitting_on_8k_worth_of_uni/",
  "subreddit": "CryptoCurrency",
  "id": "las3zg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530883
}