{
  "author": "just-the-guy",
  "original_created_utc": 1638036632,
  "title": "Found someone's wallet and did the best thing with the outcome.",
  "created_utc": 1638070887,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I was sitting on the porcelain throne at work doing my business when I noticed someone&#39;s wallet sitting next to me. Good noodle me I decide to find the owner of it and return it. I managed to find him and I could clearly tell how grateful he was that I found it. Well fast forward 2 hours and he walks up to me and hands all the cash inside and I told him &quot;not to worry about it.&quot;I initially refused but  he insisted and continued to walk back to his area. I decided to take that money and bought $116 worth of bitcoin. That little bit helped me breach into the 1%er of a bitcoin. Thanks Ricky for helping me especially with this black Friday sale going on.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/r3j783/found_someones_wallet_and_did_the_best_thing_with/",
  "subreddit": "Bitcoin",
  "id": "r3j783",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I was sitting on the porcelain throne at work doing my business when I\nnoticed someone's wallet sitting next to me. Good noodle me I decide to find the\nowner of it and return it. I managed to find him and I could clearly tell how\ngrateful he was that I found it. Well fast forward 2 hours and he…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仕事場の磁器の玉座に座って仕事をしていたときに\n誰かの財布が隣に置いてあるのに気づいた。いい加減な私は、その人を探すことにしました。\n返しに行くことにしました。私は彼を見つけることができ、私がそれを見つけたことに彼がどれほど感謝しているかをはっきりと知ることができました。\n私が見つけたことに感謝しているのがよくわかりました。さて、2時間後、彼は...",
      "title": "誰かの財布を見つけて、その結果で最善のことをした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我坐在工作的瓷器宝座上做我的事，当我注意到有人的钱包坐在我旁边时。\n注意到有人的钱包坐在我旁边。好在我决定找到\n归还给它的主人。我设法找到了他，我可以清楚地知道\n他很感激我找到了它。好了，快进了2个小时，他...",
      "title": "找到了某人的钱包，并对结果做了最好的处理。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我坐在工作的瓷器寶座上做我的事，當我注意到有人的錢包坐在我旁邊時。\n注意到有人的錢包坐在我旁邊。好在我決定找到\n歸還給它的主人。我設法找到了他，我可以清楚地知道\n他很感激我找到了它。好了，快進了2個小時，他...",
      "title": "找到了某人的錢包，並對結果做了最好的處理。"
    }
  ]
}