{
  "author": "shemmjr",
  "original_created_utc": 1654717151,
  "title": "I built a Free property management SaaS for landlords and property managers",
  "created_utc": 1654756003,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello folks&lt;/p&gt;\n\n&lt;p&gt;I have built a free SaaS for property managers and landlords to help them manage and keep track of their properties, leases and expenses, furthermore Invoices can be generated and get notifications via mobile phone (Yes we have a mobile app too), email or WhatsApp on critical dates such as near ending leases date.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;So you may be wondering why is it Free?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As you know the market is saturated with many property management tools and some of them are really expensive and bloated with many features which you pay for but never use, so to some of who are small landlords or mid-sized company tend to pay more than what you need. So I have tweaked my business model and I&amp;#39;ll explain it below how I generate revenues.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How do I generate revenues?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This tool has an inbuilt lease contract generator where you just insert your template and each of the next contracts will be auto-made based on the template you provided. This spares you much time you will use to make contracts using MS Word. (Currently this is also free, therefore you can use it limitless). &lt;/p&gt;\n\n&lt;p&gt;You can check and try it on &lt;a href=\"https://steara.com\"&gt;https://steara.com&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I am open to any feedback, bug report or feature suggestions.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/v7y1nc/i_built_a_free_property_management_saas_for/",
  "subreddit": "SideProject",
  "id": "v7y1nc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello folks\n\nI have built a free SaaS for property managers and landlords to help them manage\nand keep track of their properties, leases and expenses, furthermore Invoices\ncan be generated and get notifications via mobile phone (Yes we have a mobile\napp too), email or WhatsApp on critical dates…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は、不動産管理者と大家さんのための無料のSaaSを作りました。\nを管理し、物件、リース、経費を把握することができます。\nを作成し、携帯電話（モバイルアプリもあります）、Eメール、WhatsApp経由で通知を受けることができます。\n携帯アプリもあります）、Eメール、WhatsAppで重要な日に通知を受けることができます。",
      "title": "大家さんや不動産管理者向けの無料不動産管理SaaSを作りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "各位朋友，大家好\n\n我为物业经理和业主建立了一个免费的SaaS，以帮助他们管理\n和跟踪他们的财产、租约和支出，此外，发票\n可以生成并通过手机（是的，我们也有一个手机应用程序）、电子邮件或WhatsApp在关键日期获得通知。\n应用程序）、电子邮件或WhatsApp在关键日期获得通知......",
      "title": "我为业主和物业经理建立了一个免费的物业管理SaaS系统"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "各位朋友，大家好\n\n我爲物業經理和業主建立了一個免費的SaaS，以幫助他們管理\n和跟蹤他們的財產、租約和支出，此外，發票\n可以生成並通過手機（是的，我們也有一個手機應用程序）、電子郵件或WhatsApp在關鍵日期獲得通知。\n應用程序）、電子郵件或WhatsApp在關鍵日期獲得通知......",
      "title": "我爲業主和物業經理建立了一個免費的物業管理SaaS系統"
    }
  ]
}