{
  "author": "AdhesivenessOk9106",
  "original_created_utc": 1636687028,
  "title": "0.1 BTC is a significant milestone for accumulation",
  "created_utc": 1636706700,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I will have accumulated 0.1 BTC this month and I just want to say that it was no small feat and in the years to come it become harder to own that amount as the price continues to rise.</p>\n\n<p>The only thing to do after this is to keep buying and HODL. But what ever your goals our for buying Bitcoin, I only hope it enriches yours and/or your families. My personal goal is to only ever use to buy other assets and never back to fiat, whether that be in 5 years or 10 years it doesn&#39;t matter... But I know it will happen.</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/Bitcoin/comments/qs23wf/01_btc_is_a_significant_milestone_for_accumulation/",
  "subreddit": "Bitcoin",
  "id": "qs23wf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I will have accumulated 0.1 BTC this month and I just want to say that it was no\nsmall feat and in the years to come it become harder to own that amount as the\nprice continues to rise.\n\nThe only thing to do after this is to keep buying and HODL. But what ever your\ngoals our for buying Bitcoin, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今月は0.1BTCを獲得しましたが、これは決して小さなことではありませんでした。\n今後、価格が上昇していくにつれて、その金額を所有することは難しくなります。\n今後、価格が上昇し続けると、その金額を所有することは難しくなります。\n\nこの後にすべきことは、買い続けてHODLすることです。しかし、あなたがビットコインを買う目的が何であれ\nビットコインを購入する目的は何であれ、私は...",
      "title": "0.1BTCは蓄財のための重要なマイルストーン"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个月我将积累0.1个BTC，我只想说，这不是一个小成就。\n我只想说，这不是一个小的壮举，在未来的几年里，随着价格的不断上涨，要想拥有这一数额的货币会变得更加困难。\n价格继续上涨。\n\n在这之后唯一要做的就是继续购买和HODL。但是，无论你\n购买比特币的目标，我...",
      "title": "0.1 BTC是一个重要的积累里程碑"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個月我將積累0.1個BTC，我只想說，這不是一個小成就。\n我只想說，這不是一個小的壯舉，在未來的幾年裏，隨着價格的不斷上漲，要想擁有這一數額的貨幣會變得更加困難。\n價格繼續上漲。\n\n在這之後唯一要做的就是繼續購買和HODL。但是，無論你\n購買比特幣的目標，我...",
      "title": "0.1 BTC是一個重要的積累里程碑"
    }
  ]
}