{
  "author": "No_Weather682",
  "original_created_utc": 1634933139,
  "title": "Unpopular Opinion: The reason NFT’s games are not mainstream is because they focus on earning nft’s rather than the gameplay itself, making them boring to play.",
  "created_utc": 1634978466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Despite the “success” of some play-to-earn video games like Axie Infinity, there is still a long way to go for NFT’s games to be mainstream. The main problem I see is they are “NFT’s Games” instead of “Cool games with NFT’s”. Companies should focus on achieving a fun gameplay to get more people to play it rather than rewarding more crypto. Most people think that we won’t have this until some “AAA” company does it. However, I strongly disagree, since there are a lot of “Indee” companies that are more than capable to do so. What do you think?</p>\n\n<p>( I don’t care if this gets downvoted for being an “unpopular opinion that’s actually popular”. I think this is a big problem for NFT’s games that most people won’t admit).</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/qdp32k/unpopular_opinion_the_reason_nfts_games_are_not/",
  "subreddit": "CryptoCurrency",
  "id": "qdp32k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Despite the “success” of some play-to-earn video games like Axie Infinity, there\nis still a long way to go for NFT’s games to be mainstream. The main problem I\nsee is they are “NFT’s Games” instead of “Cool games with NFT’s”. Companies\nshould focus on achieving a fun gameplay to get more people to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アクシー・インフィニティ」のような「稼げるゲーム」が「成功」しているにもかかわらず\nNFTのゲームが主流になるには、まだ長い道のりがあります。私が考える主な問題点は\nNFTを使ったクールなゲーム」ではなく、「NFTのゲーム」であることです。企業は\nより多くの人にゲームを楽しんでもらうために、ゲームの面白さを追求すべきだと思います。",
      "title": "不人気な意見。NFTのゲームが主流ではないのは、ゲーム性よりもNFTを稼ぐことに重点を置いているため、プレイしていてつまらないからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "尽管像《Axie Infinity》这样的一些玩耍赚钱的视频游戏取得了 \"成功\"，但要使NFT的游戏成为主流，还有很长的路要走。\n要使NFT的游戏成为主流，还有很长的路要走。我看到的主要问题是\n我看到的主要问题是它们是 \"NFT的游戏\"，而不是 \"有NFT的酷游戏\"。公司\n公司应该专注于实现有趣的游戏玩法，让更多的人参与进来。",
      "title": "不受欢迎的意见。NFT的游戏之所以不是主流，是因为它们专注于赚取NFT，而不是游戏本身，使得它们玩起来很无聊。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "儘管像《Axie Infinity》這樣的一些玩耍賺錢的視頻遊戲取得了 \"成功\"，但要使NFT的遊戲成爲主流，還有很長的路要走。\n要使NFT的遊戲成爲主流，還有很長的路要走。我看到的主要問題是\n我看到的主要問題是它們是 \"NFT的遊戲\"，而不是 \"有NFT的酷遊戲\"。公司\n公司應該專注於實現有趣的遊戲玩法，讓更多的人蔘與進來。",
      "title": "不受歡迎的意見。NFT的遊戲之所以不是主流，是因爲它們專注於賺取NFT，而不是遊戲本身，使得它們玩起來很無聊。"
    }
  ]
}