{
  "author": "Balapala",
  "original_created_utc": 1641443313,
  "title": "why tf is my bed shaking?",
  "created_utc": 1641460216,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For the past couple of weeks or so I&amp;#39;ve started feeling my bed shake as I&amp;#39;m lying in it, I can&amp;#39;t think of anything to explain it. I live alone so it&amp;#39;s not someone else, I live in England so it&amp;#39;s not earthquakes and I&amp;#39;m pretty cynical so I&amp;#39;m going to rule out spirits too, it 100% feels like someone is grabbing the bottom of my mattress and pulling it around though.&lt;/p&gt;\n\n&lt;p&gt;If it helps my bed is a flat wooden frame with a spring mattress that is less than a year old, which makes me doubt it&amp;#39;s that.&lt;/p&gt;\n\n&lt;p&gt;I can literally feel it as I type this so I&amp;#39;m fully awake and aware, this is honestly starting to stress me out and it&amp;#39;s 4.30am and I just want to sleep without my fucking bed vibrating, please help me solve this reddit&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/rx5iv3/why_tf_is_my_bed_shaking/",
  "subreddit": "NoStupidQuestions",
  "id": "rx5iv3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For the past couple of weeks or so I've started feeling my bed shake as I'm\nlying in it, I can't think of anything to explain it. I live alone so it's not\nsomeone else, I live in England so it's not earthquakes and I'm pretty cynical\nso I'm going to rule out spirits too, it 100% feels like someone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ2週間ほど、ベッドに寝ていると揺れを感じるようになった。\nこの現象について、どう説明したらよいのでしょうか。私は一人暮らしなので、この現象は\n私はひねくれ者なので、地震でもありません。\nということで、霊も除外して、100％誰かのような気がする...。",
      "title": "なんでベッドが揺れてるんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几周左右，我开始感觉到我的床在摇晃，因为我躺在床上。\n躺在里面，我想不出有什么可以解释的。我一个人住，所以这不是\n我一个人住，所以不是别人，我住在英国，所以不是地震，而且我很愤世嫉俗\n所以我也要排除鬼魂的可能性，这百分之百感觉是有人......",
      "title": "为什么我的床在摇晃？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾周左右，我開始感覺到我的牀在搖晃，因爲我躺在牀上。\n躺在裏面，我想不出有什麼可以解釋的。我一個人住，所以這不是\n我一個人住，所以不是別人，我住在英國，所以不是地震，而且我很憤世嫉俗\n所以我也要排除鬼魂的可能性，這百分之百感覺是有人......",
      "title": "爲什麼我的牀在搖晃？"
    }
  ]
}