{
  "author": "Soapy_Illusion_13",
  "original_created_utc": 1656584611,
  "title": "Are healthy people just okay with feeling hungry all the time?",
  "created_utc": 1656595436,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been trying to work on my diet.  I&amp;#39;ve started counting the calories I eat, and am trying to bring it down to a reasonable level.  The only thing is that I feel hungry all the time.  It&amp;#39;s almost an irresistible urge to go and snack when I am hungry/bored.  I want to do  better, but I just need to know if I just need to be okay with being hungry all the time.  Is that how they do it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/NoStupidQuestions/comments/vo52vi/are_healthy_people_just_okay_with_feeling_hungry/",
  "subreddit": "NoStupidQuestions",
  "id": "vo52vi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been trying to work on my diet. I've started counting the calories I eat,\nand am trying to bring it down to a reasonable level. The only thing is that I\nfeel hungry all the time. It's almost an irresistible urge to go and snack when\nI am hungry/bored. I want to do better, but I just need to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ダイエットに励んでいます。食べたカロリーを数えるようになったんだ。\n合理的なレベルまで下げようとしています。ただ一つ言えることは、私は\n常に空腹を感じていることです。お腹が空くと、無性におやつを食べたくなるんです。\nお腹が空いているとき、退屈なとき。もっと頑張りたいのですが、どうしても...。",
      "title": "健康な人は、常に空腹を感じていても大丈夫なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在努力改善我的饮食。我已经开始计算我吃的卡路里。\n并试图将其降低到一个合理的水平。唯一的问题是，我\n我一直感到饥饿。当我饥饿/烦躁时，几乎有一种不可抗拒的冲动要去吃零食。\n我饿了/烦了。我想做得更好，但我只是需要...",
      "title": "健康的人就是可以一直感到饥饿吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在努力改善我的飲食。我已經開始計算我喫的卡路里。\n並試圖將其降低到一個合理的水平。唯一的問題是，我\n我一直感到飢餓。當我飢餓/煩躁時，幾乎有一種不可抗拒的衝動要去喫零食。\n我餓了/煩了。我想做得更好，但我只是需要...",
      "title": "健康的人就是可以一直感到飢餓嗎？"
    }
  ]
}