{
  "author": "plantThroway",
  "original_created_utc": 1626555965,
  "title": "Is there an formula that can measure the 'popularity' of ratings?",
  "created_utc": 1626580250,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, 1,000 upvotes and 10 downvotes would be considered much more popular than 5 upvotes and 0 downvotes despite the fact that the first case has more downvotes.</p>\n\n<p>On the other hand, 200 upvotes and 800 downvotes would be considered much less popular than the original 5 upvotes and 0 downvotes despite the fact that the first case has more upvotes.</p>\n\n<p>Is there a methodology that can be used to objectively measure how &#39;good&#39; certain ratings are?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/askscience/comments/omcrl6/is_there_an_formula_that_can_measure_the/",
  "subreddit": "askscience",
  "id": "omcrl6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For example, 1,000 upvotes and 10 downvotes would be considered much more\npopular than 5 upvotes and 0 downvotes despite the fact that the first case has\nmore downvotes.\n\nOn the other hand, 200 upvotes and 800 downvotes would be considered much less\npopular than the original 5 upvotes and 0…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、1,000件のアップボットと10件のダウンボットは、5件のアップボットと0件のダウンボットよりもはるかに人気があると考えられます。\n5 upvotes and 0 downvotesよりも、1,000 upvotes and 10 downvotesの方が人気があるとみなされます。\nにもかかわらず、人気があるとみなされます。\n\n一方で、200のアップヴォートと800のダウンヴォートは、元々の5のアップヴォートよりも\n一方で、200件のupvotesと800件のdownnvotesは、5件のupvotesと0件のdownnvotesよりも人気がないとみなされます。",
      "title": "視聴率の「人気」を測ることができる計算式はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，1,000个上调和10个下调会被认为比5个上调和0个下调更受欢迎。\n尽管第一种情况下有更多的下拉票，但比起5个上拉票和0个下拉票，更受欢迎。\n更多的下引。\n\n另一方面，200个上引和800个下引将被认为比原来的5个上引和0个下引要少得多。\n比原来的5个上引和0个下引要少得多......",
      "title": "是否有一个公式可以衡量收视率的 \"人气\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，1,000個上調和10個下調會被認爲比5個上調和0個下調更受歡迎。\n儘管第一種情況下有更多的下拉票，但比起5個上拉票和0個下拉票，更受歡迎。\n更多的下引。\n\n另一方面，200個上引和800個下引將被認爲比原來的5個上引和0個下引要少得多。\n比原來的5個上引和0個下引要少得多......",
      "title": "是否有一個公式可以衡量收視率的 \"人氣\"？"
    }
  ]
}