{
  "author": "Gekko2001",
  "original_created_utc": 1639644055,
  "title": "How reddit going public, will affect (existing and future) community tokens",
  "created_utc": 1639680022,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;This morning (16-12 CET) Reddit confidentially submitted a draft registration to go public.&lt;/strong&gt;&lt;br/&gt;\nWhat got my attention is that on this sub, it seemed like it caused a lot bullish thoughts on community tokens like the one we&amp;#39;ve got. It made me wonder: &amp;quot;What is this assumption based off? Are there any arguments or examples that point towards this conclusion?&amp;quot; So I deeply thought about it, so you don&amp;#39;t have to: &lt;em&gt;(TL;DR at the bottom)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Community Tokens:&lt;/strong&gt;&lt;br/&gt;\nBefore we get into anything, let’s take a look at what a community token is. &lt;/p&gt;\n\n&lt;p&gt;Community tokens, at the heart of it, are created as a means to gain access to a community. They’re a type of cryptocurrency specifically designed to open the door to a particular digital group. You can think of them like membership cards, but based on the blockchain. &lt;/p&gt;\n\n&lt;p&gt;What the token can do, and what sort of access it offers, fully depends on the project behind it. Each social token represents a community and each community has a different value offer.&lt;/p&gt;\n\n&lt;p&gt;So for example Bricks on the Fortnite subreddit or ours.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Reddit going public:&lt;/strong&gt;&lt;br/&gt;\nWith Reddit going public, a few things are going to happen:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;It&amp;#39;s going to get a lot more focused on making profits (Think ads and sponsorships etc)&lt;/li&gt;\n&lt;li&gt;It will have more funds to promote and grow its user base&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;This will result in a lot more active members of subreddits. Now Reddit has already pointed out that it will embrace other subreddits who want to make their own community token so more subreddits will get their own community token and at the same time grow their community with new people joining in as a result of the promoting done with the funds of the IPO. &lt;/p&gt;\n\n&lt;p&gt;With this the first contribution to the community tokens will be made: The Supply and demand basic model. By growing the number of users and only having a set number of tokens will increase the demand. This will result in a growth of the price of these tokens. &lt;/p&gt;\n\n&lt;p&gt;Further more, if more people start earning these community tokens, people who don&amp;#39;t use reddit but are into crypto will start looking into these coins as well.&lt;br/&gt;\nLook at yourself for example; Most of you don&amp;#39;t actually make use of the DOT or ADA blockchain yourself, but because you believe in the project you invest in it anyway. This will be the same with the community coins. &lt;/p&gt;\n\n&lt;p&gt;Now here is the part where I start speculating so don&amp;#39;t quote me on this, but:&lt;br/&gt;\nIf there are going to be substantially more users that are going to engage with community coins, and non reddit users wanting to profit from these projects, it won&amp;#39;t stay unnoticed: Big exchanges will pick up on these trends and start looking how they can profit from this, with the answer being: Listing these coins on your exchange. Now if this happens, and I am saying IF, this will be very bullish for the reddit community tokens. It will enable everyone on earth with acces to the exchange to trade our community coins, and it will cause an astronomic rise demand with supply staying the same. This obviously is the most bullish case.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR / conclusion:&lt;/strong&gt;&lt;br/&gt;\n&lt;strong&gt;In the end it all comes down to supply and demand; going public will substantially increase the user base of reddit (because of all the promotion and branding that is gonna be done with the raised money by the IPO). This in turn will increase demand without raising supply, causing a rise in the value of the community tokens. This high demand and low supply will be picked up by big exchanges as an opportunity to profit from it. They will try to list these coins on their exchange. If the succeed to do so, this will be the most bullish case for the community coins, now being available to be easily traded by everyone.&lt;/strong&gt;   &lt;/p&gt;\n\n&lt;p&gt;Interested how you guys see this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/rhmjuw/how_reddit_going_public_will_affect_existing_and/",
  "subreddit": "CryptoCurrency",
  "id": "rhmjuw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This morning (16-12 CET) Reddit confidentially submitted a draft registration to\ngo public.\nWhat got my attention is that on this sub, it seemed like it caused a lot\nbullish thoughts on community tokens like the one we've got. It made me wonder:\n\"What is this assumption based off? Are there any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今朝（中央ヨーロッパ時間16-12）、Redditは秘密裏に登録のドラフトを提出しました。\n公開する\n私が注目したのは、このサブで、多くの人が引き起こしたように思えたことです。\nのようなコミュニティ・トークンに強気な考えを持つ。不思議な気持ちにさせられました。\n「この仮説は何に基づいているのだろう？と疑問に思いました。",
      "title": "Redditの株式公開が（既存および将来の）コミュニティ・トークンに与える影響"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天上午（欧洲中部时间16-12日），Reddit秘密地提交了一份注册草案，以便\n公开。\n引起我注意的是，在这个子上，似乎引起了很多\n对像我们这样的社区代币看涨的想法。这让我很好奇。\n\"这种假设是基于什么？是否有任何...",
      "title": "reddit上市，将如何影响（现有和未来的）社区代币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天上午（歐洲中部時間16-12日），Reddit祕密地提交了一份註冊草案，以便\n公開。\n引起我注意的是，在這個子上，似乎引起了很多\n對像我們這樣的社區代幣看漲的想法。這讓我很好奇。\n\"這種假設是基於什麼？是否有任何...",
      "title": "reddit上市，將如何影響（現有和未來的）社區代幣"
    }
  ]
}