{
  "author": "LetsMakeSomeMoneyGuy",
  "original_created_utc": 1631125091,
  "title": "So if Starbucks and McDonalds accepts crypto in El Salvador, why not in the USA, UK and rest of the world?",
  "created_utc": 1631147496,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The title pretty much sums up my question. What’s holding big companies like Starbucks and McDonalds from accepting crypto in other countries  like the USA, UK and rest of the world?</p>\n\n<p>Is this a local government thing? From\n My understanding anyone in the US can accept any crypto for services/products if they chose to do so.</p>\n\n<p>Or is it that because the government says it’s a legal tender in El Salvador that this companies are forced to accept crypto as payment?</p>\n\n<p>Another thought does the government have to accept each crypto as legal tender to make these companies accept it?</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/pkg284/so_if_starbucks_and_mcdonalds_accepts_crypto_in/",
  "subreddit": "CryptoCurrency",
  "id": "pkg284",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The title pretty much sums up my question. What’s holding big companies like\nStarbucks and McDonalds from accepting crypto in other countries like the USA,\nUK and rest of the world?\n\nIs this a local government thing? From My understanding anyone in the US can\naccept any crypto for services/products…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルは私の質問を要約しています。スターバックスやマクドナルドのような大企業が\nスターバックスやマクドナルドのような大企業が、アメリカやイギリスなどの他の国で暗号を受け入れないのはなぜでしょうか？\nイギリスなどの他の国で、スターバックスやマクドナルドのような大企業が暗号を受け入れられないのはなぜでしょうか？\n\nこれは地方自治体の問題なのでしょうか？私の理解では、アメリカでは誰もが\nサービスや製品のために、どんな暗号でも受け入れることができます...",
      "title": "スターバックスやマクドナルドがエルサルバドルで暗号を受け付けているのに、なぜアメリカやイギリス、その他の国では受け付けないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题几乎概括了我的问题。是什么阻碍了大公司如\n星巴克和麦当劳等大公司不接受美国、英国和其他国家的加密货币。\n英国和世界其他地区？\n\n这是地方政府的事吗？根据我的理解，在美国，任何人都可以\n接受任何加密货币的服务/产品......",
      "title": "因此，如果星巴克和麦当劳在萨尔瓦多接受加密货币，为什么在美国、英国和世界其他地区不接受呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題幾乎概括了我的問題。是什麼阻礙了大公司如\n星巴克和麥當勞等大公司不接受美國、英國和其他國家的加密貨幣。\n英國和世界其他地區？\n\n這是地方政府的事嗎？根據我的理解，在美國，任何人都可以\n接受任何加密貨幣的服務/產品......",
      "title": "因此，如果星巴克和麥當勞在薩爾瓦多接受加密貨幣，爲什麼在美國、英國和世界其他地區不接受呢？"
    }
  ]
}