{
  "author": "mirza1h",
  "the_new_excerpt": "My last post regarding Vechain got removed. I am posting again because I'm\nreally excited about this project. I think it's still incredibly undervalued at\nthe price of 8 cents and 5.2b$ market cap. The most important info I want to\nshare with you is that over 30 of the Fortune 500 companies…",
  "original_created_utc": 1616188579,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的上一篇关于Vechain的帖子被删除了。我再次发帖是因为我\n真的很兴奋这个项目。我认为它的价值仍然被难以置信地低估了，在。\n8美分的价格和52亿美元的市值。最重要的信息，我想\n与大家分享的是，超过30家财富500强企业...",
      "title": "VeChain（VET）使用案例"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的上一篇關於Vechain的帖子被刪除了。我再次發帖是因爲我\n真的很興奮這個項目。我認爲它的價值仍然被難以置信地低估了，在。\n8美分的價格和52億美元的市值。最重要的信息，我想\n與大家分享的是，超過30家財富500強企業...",
      "title": "VeChain（VET）使用案例"
    }
  ],
  "title": "VeChain (VET) use cases",
  "created_utc": 1616207886,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My last post regarding Vechain got removed. I am posting again because I&#39;m really excited about this project. I think it&#39;s still incredibly undervalued at the price of 8 cents and 5.2b$ market cap. The most important info I want to share with you is that over 30 of the Fortune 500 companies including Walmart, BMW, LVMH, Renault and PwC have live solutions running on VeChain, with another 250+ clients currently being onboarded. I recently found <a href=\"https://academy.binance.com/en/articles/what-is-vechain-vet\">this article</a> that fairly simple explains the use cases of VET, so I wanted to share them with you.</p>\n\n<h3>Food safety</h3>\n\n<p>Blockchain-based solutions could lead to a more transparent food economy around the world.</p>\n\n<p>VeChain-enabled Internet of Things (IoT) devices can be deployed across the supply chain, including on products, vehicles, and warehouses. Then, environmental and location-based data from these devices can be uploaded, verified, and stored in a tamper-proof, decentralized manner on the VeChainThor blockchain. Solutions like this are already in effect for several companies, including Shenzhen Yuhongtai Foods.</p>\n\n<h3>Anti-counterfeiting</h3>\n\n<p>Counterfeiting in the luxury goods market is a serious problem. By attaching an encrypted chip and then using the chip to log and trace logistics, warehousing, maintenance, and resale, owners can be assured of authenticity. This has been used for luxury wine tracing for Shanghai Waigaoqiao Direct Imported Goods, and in testing for Renault luxury vehicle components.</p>\n\n<h3>Health records</h3>\n\n<p>Healthcare records systems are notoriously archaic. Instead of using inefficient and insecure record systems for lab results, this valuable data can be stored on the blockchain, with only patients and other authorized parties having access. A VeChain-based E-HCert App will be rolled out to patients of both the Mediterranean Hospital of Cyprus and Aretaeio Hospital in 2021.</p>\n\n<h3>Tracking carbon emissions</h3>\n\n<p>By driving carbon reduction by tracking carbon-emitting activities, this solution allows consumers to be involved in a carbon-saving scheme. </p>\n\n<p>When smart devices, such as cars or appliances show that a consumer is generating less carbon, they can then receive credits to be used on energy services. BYD, a Chinese electric car brand, already uses a Vechain solution.</p>\n</div><!-- SC_ON -->",
  "score": 650,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/kFqxVgjLFLu9JmLwXUJYyQs4kSpqlHczeMuEBurVTBM.jpg?auto=webp&s=3530aa5a51db45f206c1e32090d7a0d718a91262",
          "width": 752,
          "height": 423
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/kFqxVgjLFLu9JmLwXUJYyQs4kSpqlHczeMuEBurVTBM.jpg?width=108&crop=smart&auto=webp&s=8d8a022d1f3cde7da4b1055f18fc42fc7512359e",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/kFqxVgjLFLu9JmLwXUJYyQs4kSpqlHczeMuEBurVTBM.jpg?width=216&crop=smart&auto=webp&s=79e6fd7952680edee1b9f49e8c6841ff073412e4",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/kFqxVgjLFLu9JmLwXUJYyQs4kSpqlHczeMuEBurVTBM.jpg?width=320&crop=smart&auto=webp&s=131720de068ec84671027626fd3add17bbf0e0fe",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/kFqxVgjLFLu9JmLwXUJYyQs4kSpqlHczeMuEBurVTBM.jpg?width=640&crop=smart&auto=webp&s=d22b17968236fe4a581861fb04ccf5912a7adc6b",
            "width": 640,
            "height": 360
          }
        ],
        "variants": {},
        "id": "HM64QHtYM63cZ-m02qb_hEOSXlrA-eCBzDzt0j8i6Ks"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/m8rb0o/vechain_vet_use_cases/",
  "subreddit": "CryptoCurrency",
  "id": "m8rb0o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815288
}