{
  "author": "deathtolucky",
  "original_created_utc": 1641134568,
  "title": "What’s the most profit you’ve made from a single coin or token?",
  "created_utc": 1641152841,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Which coin or token was it and how much profit did you make? Was it a memecoin? Was it an airdrop that you forgot about and found years later?How long did you hold it in your portfolio and what made you take profits at the time that you did? &lt;/p&gt;\n\n&lt;p&gt;Obviously the folks who have been in for years and years will have a story about buying BTC or ETH at a crazy price. For those people, I’m most interested in what made you take profits at the time that you did? Hopefully it was for something positive and not a case where you needed the money for an emergency. If you didn’t &lt;em&gt;need&lt;/em&gt; the money, did you just not want to tempt fate any longer and you already had made a 10-15x?&lt;/p&gt;\n\n&lt;p&gt;What allowed you to HODL through the dips and crashes and how did you achieve your conviction in the project? Was it blind optimism? Did you actually DYOR and nobody could convince you that you were wrong? Or was it pure luck and you bought on a whim and it rocketed up so fast you just rode the quick wave, took the money and ran? &lt;/p&gt;\n\n&lt;p&gt;Let’s hear it folks!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/ruaynz/whats_the_most_profit_youve_made_from_a_single/",
  "subreddit": "CryptoCurrency",
  "id": "ruaynz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Which coin or token was it and how much profit did you make? Was it a memecoin?\nWas it an airdrop that you forgot about and found years later?How long did you\nhold it in your portfolio and what made you take profits at the time that you\ndid?\n\nObviously the folks who have been in for years and years…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どのコインやトークンで、どれくらいの利益が出たのでしょうか？それはメメコインでしたか？\n忘れていたのに何年か経ってから見つけたエアドロップですか？\nまた、その時点で利益を得た理由は何ですか？\nということです。\n\n明らかに何年も何年も続けている人たち...",
      "title": "1枚のコインやトークンから得た最も大きな利益は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是哪种硬币或代币，你赚了多少钱？它是一个memecoin吗？\n你在你的投资组合中持有多长时间？\n你在你的投资组合中持有多久，是什么让你在那个时候获利？\n你在你的投资组合中持有多长时间？\n\n很显然，那些已经在里面呆了很多年的人......",
      "title": "你从一个硬币或代币中获得的最大利润是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是哪種硬幣或代幣，你賺了多少錢？它是一個memecoin嗎？\n你在你的投資組合中持有多長時間？\n你在你的投資組合中持有多久，是什麼讓你在那個時候獲利？\n你在你的投資組合中持有多長時間？\n\n很顯然，那些已經在裏面呆了很多年的人......",
      "title": "你從一個硬幣或代幣中獲得的最大利潤是什麼？"
    }
  ]
}