{
  "author": "Tangerine_Kitchen",
  "the_new_excerpt": "My mum passed away from Covid on the 13th of this month. We lived together by\nourselves, and whilst we are classed as \"poor\" we've always managed to get by.\nNow she's gone and I have no other family members to look after me, I have no\nmoney, no food and nowhere to go. I've literally just turned 18,…",
  "original_created_utc": 1614078427,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我妈妈是本月13日从科维德去世的。我们一起生活在\n虽然我们被归为 \"穷人\"，但我们一直都能过得很好。\n现在她走了，我也没有其他家人来照顾我，我也没有...\n钱，没有食物，无处可去。我真的刚满18岁，... ...",
      "title": "我18岁刚刚无家可归，有什么技巧或诀窍可以帮助我靠仅有的一点收入生存吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我媽媽是本月13日從科維德去世的。我們一起生活在\n雖然我們被歸爲 \"窮人\"，但我們一直都能過得很好。\n現在她走了，我也沒有其他家人來照顧我，我也沒有...\n錢，沒有食物，無處可去。我真的剛滿18歲，... ...",
      "title": "我18歲剛剛無家可歸，有什麼技巧或訣竅可以幫助我靠僅有的一點收入生存嗎？"
    }
  ],
  "title": "I've just been made homeless at 18, are there any tips or tricks to help me survive on what little income I have?",
  "created_utc": 1614087302,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My mum passed away from Covid on the 13th of this month. We lived together by ourselves, and whilst we are classed as &quot;poor&quot; we&#39;ve always managed to get by. Now she&#39;s gone and I have no other family members to look after me, I have no money, no food and nowhere to go. \nI&#39;ve literally just turned 18, so I now have to fend for myself with minimal knowledge about the &quot;real world.&quot;\nI&#39;m in a youth homeless hostal for the time being whilst finance officers sort out benefits for me (I&#39;m in the UK and still in full-time education thank God, otherwise my situation would be much worse).\nMy question is: how can I stretch my income as far as possible? Any tips or tricks I need to know about buying stuff? Are there any ways I can get support?\nThank you for reading.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/lqfvhv/ive_just_been_made_homeless_at_18_are_there_any/",
  "subreddit": "NoStupidQuestions",
  "id": "lqfvhv",
  "is_self": true,
  "media": null,
  "is_video": false
}