{
  "author": "leonl07",
  "the_new_excerpt": "ATTENTION!!!\n\nDear clients, we ask you to stop using our service in all meanings: don't\ndeposit funds, don't trade, don't use API. We are under a carefully planned\nattack, which has been prepared, as we assume, over the last few months. We lost\ncontrol of all of our servers, backend and nodes. Thus,…",
  "original_created_utc": 1608832799,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "注意！\n\n尊敬的客户，我们要求您停止一切意义上的使用我们的服务：请不要\n存款资金，不要交易，不要使用API。我们正在精心策划一项\n攻击，正如我们假设的那样，在过去的几个月里已经做好了准备。我们输了\n控制我们所有的服务器、后端和节点。因此，…",
      "title": "Liveoin.net被黑了！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "注意！\n\n尊敬的客戶，我們要求您停止一切意義上的使用我們的服務：請不要\n存款資金，不要交易，不要使用API。我們正在精心策劃一項\n攻擊，正如我們假設的那樣，在過去的幾個月裏已經做好了準備。我們輸了\n控制我們所有的服務器、後端和節點。因此，…",
      "title": "Liveoin.net被黑了！"
    }
  ],
  "title": "Livecoin.net hacked!",
  "created_utc": 1608871064,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>ATTENTION!!!</p>\n\n<p>Dear clients, we ask you to stop using our service in all meanings: don&#39;t deposit funds, don&#39;t trade, don&#39;t use API. We are under a carefully planned attack, which has been prepared, as we assume, over the last few months. We lost control of all of our servers, backend and nodes. Thus, we were not able to stop our service in time. Our news channels were compromised as well. At the moment, we partially control frontend, and so we&#39;re able to place this announcement. We&#39;re fighting hard to get back our servers, nodes and funds, we&#39;re working 24/7. News and next update will come up in the next few days. We&#39;re working in contact with local police authorities. We really do our best to overcome this issue.</p>\n\n<p>Disclaimer: I have no association with the exchange and merely trying to alert people using the announcement on the website.</p>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/CryptoCurrency/comments/kjjpdc/livecoinnet_hacked/",
  "subreddit": "CryptoCurrency",
  "id": "kjjpdc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495331374
}