{
  "author": "JuicySpark",
  "the_new_excerpt": "Thought this would be a cool story to share.\n\nI do service work for air conditioning, this new customer of mine needs to\nreplace these Old hack and slash AC units. Pretty decent size business. He\nscraps electronics. Phones. Computers, separates them for the metals etc.\n\nHes been in business for 11…",
  "original_created_utc": 1621035189,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはクールな話だと思い、共有することにしました。\n\n私はエアコンのサービスをしているのですが、新しいお客さんがこの古いエアコンを交換したいと言ってきました。\nこの古いエアコンを交換する必要があります。そこそこの規模のビジネスです。彼は\n電子機器を廃棄しています。電話。コンピュータ、金属のためにそれらを分離するなど。\n\nビジネスを始めて11年...",
      "title": "今日、私はコンピュータのスクラップビジネスを所有している人に会いました 彼はそれをしている間、古い暗号財布のためにハードドライブをスキャンしています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这将是一个很酷的故事，可以分享。\n\n我做空调的服务工作，我的这个新客户需要\n替换这些老式的砍伐式空调设备。规模相当大的生意。他\n废弃的电子产品。电话。电脑，把它们分离成金属等。\n\n他已经做了11年的生意...",
      "title": "今天，我遇到了一个拥有电脑报废业务的人，他在做这件事的时候，会扫描硬盘中的旧加密货币钱包。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這將是一個很酷的故事，可以分享。\n\n我做空調的服務工作，我的這個新客戶需要\n替換這些老式的砍伐式空調設備。規模相當大的生意。他\n廢棄的電子產品。電話。電腦，把它們分離成金屬等。\n\n他已經做了11年的生意...",
      "title": "今天，我遇到了一個擁有電腦報廢業務的人，他在做這件事的時候，會掃描硬盤中的舊加密貨幣錢包。"
    }
  ],
  "title": "Today, I met Someone who owns a computer scrapping business , and while he's at it, he scans hard drives for old Crypto Wallets",
  "created_utc": 1621057318,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Thought this would be a cool story to share.</p>\n\n<p>I do service work for air conditioning, this new customer of mine needs to replace these Old hack and slash AC units.    Pretty decent size business.   He scraps electronics. Phones. Computers, separates them for the metals etc. </p>\n\n<p>Hes been in business for 11 years and as of 2018 when the market crashed he decided it was a good idea to tear the mother boards out of comps and save them. As a hobby he scans them for possibly old forgotten wallets or private keys.     </p>\n\n<p>I saw his office he works out if.  It&#39;s just piles of hard drives everywhere and some equipment he can insert hard rives and scan them.     </p>\n\n<p>So far he&#39;s found a total of 4.1 Bitcoins on 3 different computers and some ETH and other shitcoins.  and currently has a wallet he doesn&#39;t have the keys too that contains an unknown number of btc.  </p>\n\n<p>He said it&#39;s pure hobby because the efforts it took to get those bitcoins he barely broke even.  Also he doest have the time to scan all of them as so many come in so he showed me this back room that is packed like sardines with hard drives and mother boards .</p>\n\n<p>Probably take him forever and it&#39;s getting to the point he&#39;s running out of room. That&#39;s how much scrap he hauls in but he has this wacky idea of some automated self learning  machine that can read hard drives for him. </p>\n\n<p>But who knows. He might stumble across one PK that has $$millions$$ in BTC.</p>\n</div><!-- SC_ON -->",
  "score": 598,
  "permalink": "/r/CryptoCurrency/comments/nclxyc/today_i_met_someone_who_owns_a_computer_scrapping/",
  "subreddit": "CryptoCurrency",
  "id": "nclxyc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798337
}