{
  "author": "anon8496847385",
  "the_new_excerpt": "I see more and more comments in the daily from clearly new investors in this\nspace who have invested in (insert random shitcoin) earlier that day and are\nmoaning in the daily that it’s dipped 0.4% and should they sell and what the\nfuck is going on?!?\n\nLike what the fuck is happening? This isn’t free…",
  "original_created_utc": 1620159756,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のように、この分野の明らかに新しい投資家からのコメントを目にします。\nその日のうちに（ランダムなクソコインを挿入して）投資して、0.4%下がったと日刊紙に嘆いています。\nその日のうちに（ランダムなクソコインを挿入して）投資して、デイリーで0.4%下がったから売るべきだとか、何が起こっているんだとか、文句を言っています。\n一体何が起こっているんだ？\n\n何が起こっているんだ？これは無料ではありません...。",
      "title": "いったい何が起こっているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每天看到越来越多的评论，显然是这个领域的新投资者。\n他们在当天早些时候投资了(插入随机的狗屎币)，并在日报上抱怨说，它下跌了0.4%，他们应该卖掉吗？\n他们在日报上抱怨说，它下降了0.4%，他们应该卖掉，这到底是怎么回事？\n这他妈的是怎么回事？\n\n像他妈的发生了什么？这不是免费的...",
      "title": "发生了什么该死的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每天看到越來越多的評論，顯然是這個領域的新投資者。\n他們在當天早些時候投資了(插入隨機的狗屎幣)，並在日報上抱怨說，它下跌了0.4%，他們應該賣掉嗎？\n他們在日報上抱怨說，它下降了0.4%，他們應該賣掉，這到底是怎麼回事？\n這他媽的是怎麼回事？\n\n像他媽的發生了什麼？這不是免費的...",
      "title": "發生了什麼該死的事情？"
    }
  ],
  "title": "What the bloody hell is happening?",
  "created_utc": 1620167530,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see more and more comments in the daily from clearly new investors in this space who have invested in (insert random shitcoin) earlier that day and are moaning in the daily that it’s dipped 0.4% and should they sell and what the fuck is going on?!?</p>\n\n<p>Like what the fuck is happening? This isn’t free money and this is a real risk of investing and ultimately losing your investment, especially if you’re going to shit your pants after 30 minutes and a baby dip. This space is volatile as fuck. So either get used to this and educate yourself. Actually read 1 of about 8368 guides for newbies in the subreddit from aspiring moon farmers with actual good content. Don’t listen to your friends cousins boyfriend who 18x his money in safemoons or got a tip about a crypto called fuckmyapplepie and it’s surely going to 10000x and take over BTC.</p>\n\n<p>I’m not going to feel sorry for you if you are naive enough to think you can throw money at shit and grow more money. Stop moaning and start learning.</p>\n</div><!-- SC_ON -->",
  "score": 2790,
  "permalink": "/r/CryptoCurrency/comments/n4x7pg/what_the_bloody_hell_is_happening/",
  "subreddit": "CryptoCurrency",
  "id": "n4x7pg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964324
}