{
  "author": "Northern-star1458",
  "original_created_utc": 1650287978,
  "title": "why are there never questions about how should women approach men without being seen as annoying or weird ? why are all relationship advice, social skills and other subs filled with anxious or creepy guys not knowing how to talk and then \"having success\" for talking to \"a hot girl?\"",
  "created_utc": 1650312045,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of men on here are horrible and frustrated and agressive and constantly say that women have it easier when it comes to friendships and sex and relationships which is not true. A lot of women struggle but if I ask on advice of relationships for advice I will be downvoted ( had an older account where I asked for flirting advice as a woman) I struggle because I was heavily abused and bullied by male peers so men seem like alien creepy intimidating entities to me, being hyper sexual and fearing sex and being creeped out by guys due to harassment and them whining about their penises and having no one to have sex with just makes me extremely sad. The only question I know is girls of reddit how do you flirt but the problem is that people in general think women have it easy which is not true. Some people, regardless of gender come off as too strong and due to mental illness, severe abuse in school and social isolation I did as a result to cope, which made me feel even more lonely and isolated, resulted in me never learning how to flirt.&lt;/p&gt;\n\n&lt;p&gt;The only confident girls I know are horrible and mean, reminiscent of worse versions of the Regina George type, they are sassy and over use make up. I am not insecure but I am too used to these types lashing out and causing scenes and I avoid conflicts like the plague since I don&amp;#39;t like being degraded/shouted at which makes me be seen as weak. Telling someone who is frustrated and probably horny and lonely, that no one owes them love, while much more toxic people do get love and attention, is about to make them explode and become angry, so don&amp;#39;t go telling people that no one owes them love, it is just that some of us crave more sex, and some of us crave more cuddles, while others crave deep talks. When all of your life you have been told you are ugly and have been asked what is wrong with you and constantly lived in self doubt and depression and blamed your self and can&amp;#39;t find a reason as to why you are not liked sexually and romantically, sentences like&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;you are young, you have time, will make me retaliate and reject or be mean to anyone who doesn&amp;#39;t have interest in me, but is nice due to my abuse, since being depressed is better than having hope that someone will like you. Also calling someone incel is offensive because real incels go around insulting women and all they do is fap, and I don&amp;#39;t masturbate at all since I have been todl all of my life by classmates that I am disgusting and boys eswed at me. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I guess that is why I don&amp;#39;t experiment, I am that tumor that must die and is always bullied. I feel ugly and horrible beyond repair by people who constantly antagonized me for their own personal pleasure. I know I must be ashamed and insecure but I am, and if I ever try to verbalize what I feel online, I am attacked and downvoted. I don&amp;#39;t know what to do anymore but seeing horrible people who don&amp;#39;t even have self awareness or responsibility, have lovers makes me want to puke. Why is there never women complaining about their love problems but always guys talking about their crazy ex, or shaming women they had sex with by leaking their nudes, or talking about women as If they are cows that owe them sex (not love) because some guys think it is okay to touch you just because they are fake nice to you. Soem guys are even so delusional that they think a woman is in relationship with them even though they have rarely even talked (those are usually older and married guys ) is having a sex drive, being lonely and not having anyone concider you hot - a male problem? &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;because I never see women go around asking this, it is usually girls asking how to get out of abusive boyfriend situation, it seems some girls have like 5-6 exes in college already and have dated since 6th grade while I never had anyone treat me goodly, the best I have been treated by guys was being ignored, and that is not positive or romantic, no kisses, no flowers, no nothing like the other girls, so it is clear why i felt wary and afraid and always feel like the guy will hit me or tell me I am ugly if he gets close to me. I both want someone and feel like I am not enough and will be jealous of them if they are smarter or prettier than me, because I am insecure after the bullying, I do work on my self and exercise and meditate but still struggle emotionally because I repressed my emotions for years and guys scare me, so I read a lot of fanfiction and hugged pillows to cope.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/u6czp8/why_are_there_never_questions_about_how_should/",
  "subreddit": "TooAfraidToAsk",
  "id": "u6czp8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "A lot of men on here are horrible and frustrated and agressive and constantly\nsay that women have it easier when it comes to friendships and sex and\nrelationships which is not true. A lot of women struggle but if I ask on advice\nof relationships for advice I will be downvoted ( had an older account…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいる多くの男性は、恐ろしくて、イライラして、攻撃的で、常に\n友人関係やセックス、そして人生において、女性の方が楽だと言っている。\nそれは真実ではありません。多くの女性が苦労していますが、私がアドバイスを求めたら\n",
      "title": "なぜ、女性はどのように男性にアプローチすれば迷惑や変人だと思われないかという質問がないのでしょうか？ なぜ、恋愛相談やソーシャルスキルなどのサブはすべて、不安や気持ち悪い男が話し方を知らずに、「ホットガール」と話して「成功」していることで満たされているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里的很多男人都是可怕的、沮丧的、咄咄逼人的，并不断地\n说女人在处理友谊、性和关系时更容易。\n这是不正确的。很多女人都在挣扎，但如果我向人际关系方面的建议\n的建议，我就会被降权（有一个旧的账户......",
      "title": "为什么从来没有人问过女人应该如何接近男人而不被视为讨厌或奇怪的问题？ 为什么所有的关系建议、社交技巧和其他子都充满了焦虑或令人毛骨悚然的家伙不知道如何说话，然后 \"成功 \"地与 \"一个热女孩 \"交谈？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏的很多男人都是可怕的、沮喪的、咄咄逼人的，並不斷地\n說女人在處理友誼、性和關係時更容易。\n這是不正確的。很多女人都在掙扎，但如果我向人際關係方面的建議\n的建議，我就會被降權（有一箇舊的賬戶......",
      "title": "爲什麼從來沒有人問過女人應該如何接近男人而不被視爲討厭或奇怪的問題？ 爲什麼所有的關係建議、社交技巧和其他子都充滿了焦慮或令人毛骨悚然的傢伙不知道如何說話，然後 \"成功 \"地與 \"一個熱女孩 \"交談？"
    }
  ]
}