{
  "author": "winvesting",
  "original_created_utc": 1624673443,
  "title": "Would you invest in Bitcoin if it crashed to $1.00?",
  "created_utc": 1624685549,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s say tomorrow you wake up and decide to check the crypto charts. You have sleep still in your eyes and your vision is blurred, but you notice something odd. You rub your eyes and OH FUCK Bitcoin is down to $1! The news coming out is obviously terrible. Everyone is saying to not touch Bitcoin with a 10 foot stick.</p>\n\n<p>Do you say fuck it Bitcoin is dead, twas a nice run. Or do you buy a couple hundred and say Viva la Bitcoin! I would buy some, even if it just meant holding on to some history.</p>\n\n<p>Edit: I&#39;m glad to see 99.99% of this community would still buy Bitcoin after a 99.99% crash in value. It almost brings a tear to my eye, we must really believe in the future of crypto.</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/o81pcp/would_you_invest_in_bitcoin_if_it_crashed_to_100/",
  "subreddit": "CryptoCurrency",
  "id": "o81pcp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's say tomorrow you wake up and decide to check the crypto charts. You have\nsleep still in your eyes and your vision is blurred, but you notice something\nodd. You rub your eyes and OH FUCK Bitcoin is down to $1! The news coming out is\nobviously terrible. Everyone is saying to not touch Bitcoin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明日、目が覚めて、暗号のチャートをチェックしようと思ったとします。あなたの目には\n目にはまだ眠気が残っていて、視界がぼやけていますが、何か変なことに気付きます。\nいことに気づきます。目をこすってみると、ビットコインが1ドルになっているではありませんか。ニュースを見てみると\n明らかにひどい。誰もがビットコインに手を出すなと言っているのに・・・。",
      "title": "ビットコインが1ドルに暴落したら、あなたは投資しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设明天你醒来，决定查看加密货币的图表。你的眼睛里还有睡意\n你的眼睛里还有睡意，视线模糊，但你注意到一些\n奇怪的事情。你揉了揉眼睛，OH FUCK 比特币跌到了1美元！？传出的消息是\n显然很糟糕。每个人都在说不要碰比特币...",
      "title": "如果比特币崩溃到1美元，你会投资它吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設明天你醒來，決定查看加密貨幣的圖表。你的眼睛裏還有睡意\n你的眼睛裏還有睡意，視線模糊，但你注意到一些\n奇怪的事情。你揉了揉眼睛，OH FUCK 比特幣跌到了1美元！？傳出的消息是\n顯然很糟糕。每個人都在說不要碰比特幣...",
      "title": "如果比特幣崩潰到1美元，你會投資它嗎？"
    }
  ]
}