{
  "author": "ShorterThanTallll",
  "original_created_utc": 1637763020,
  "title": "Anyone notice something strange about the Cardano ADA posts recently?",
  "created_utc": 1637773262,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Cardano is launching today on bitstamp (in about an hour). Also, the small exchange etoro decided to stop hosting ADA.</p>\n\n<p>All yesterday and last night posts all over Reddit were spreading FUD about the etoro delisting of ADA and the price was falling. </p>\n\n<p>A large amount of the ADA etoro FUD posts were made by users with new accounts. After a while, regular users started to repost the FUD so not all the posts are questionable.</p>\n\n<p>Could folks be spamming FUD about ADA hoping the price drops more before it jumps back up today when it launches on bitstamp?</p>\n\n<p>Check out the user accounts on the new ADA posts about FUD, let’s make sure we aren’t allowing trolls to manipulate anything!</p>\n\n<p>Just a heads up, I already saw a couple Cardano FUD posts spreading false and speculative information, which I commented on and corrected… the posts and accounts were deleted soon after… saw a few other questionable FUD posts too</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/r161q5/anyone_notice_something_strange_about_the_cardano/",
  "subreddit": "CryptoCurrency",
  "id": "r161q5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Cardano is launching today on bitstamp (in about an hour). Also, the small\nexchange etoro decided to stop hosting ADA.\n\nAll yesterday and last night posts all over Reddit were spreading FUD about the\netoro delisting of ADA and the price was falling.\n\nA large amount of the ADA etoro FUD posts were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cardanoは今日、bitstampで発売されます（約1時間後）。また、小さな\n取引所のetoroはADAのホスティングをやめることを決めました。\n\n昨日から昨夜にかけて、Redditのあちこちの投稿がFUDを広めていましたが、それは\netoroがADAを上場廃止にしたことについてFUDを広め、価格が下落していました。\n\nADA etoroのFUD投稿の大部分は...",
      "title": "最近のカルダノADAの投稿に異変を感じた方はいらっしゃいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Cardano今天在bitstamp上推出（大约一个小时后）。另外，小型\n交易所etoro决定停止托管ADA。\n\n昨天和昨天晚上，整个Reddit的帖子都在散布关于\netoro取消ADA的上市，价格也在下跌。\n\n大量的ADA etoro FUD帖子是...",
      "title": "有没有人注意到最近Cardano ADA的帖子有些奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Cardano今天在bitstamp上推出（大約一個小時後）。另外，小型\n交易所etoro決定停止託管ADA。\n\n昨天和昨天晚上，整個Reddit的帖子都在散佈關於\netoro取消ADA的上市，價格也在下跌。\n\n大量的ADA etoro FUD帖子是...",
      "title": "有沒有人注意到最近Cardano ADA的帖子有些奇怪？"
    }
  ]
}