{
  "author": "aFungible",
  "original_created_utc": 1644902777,
  "title": "BIG threat looming over Monero blockchain! MineXMR mining pool now owns 52%+ of network hashrate!",
  "created_utc": 1644943578,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You would see that this has been doing rounds now since recently. MineXmr (a supposedly infamous) mining pool, now owns &lt;a href=\"https://pools.xmr.wiki/\"&gt;52% or more of network&amp;#39;s hashrate&lt;/a&gt;. Know that Monero mining is special and has been touted to be more decentralized as it supports CPU mining, which has been the case so far. Even China&amp;#39;s infamous ban, did not bring down network hashrate, just like it did to Bitcoin&amp;#39;s 50% dip in hashrate.&lt;/p&gt;\n\n&lt;p&gt;However, in the past 24 hours alone, there has been close to 15% jump in the hashrate from 44% to 52% odd at mineXmr. This does not seem normal and has now become a major point of discussion that it could be seen as a deliberate attack on the network to double-spend.&lt;/p&gt;\n\n&lt;p&gt;The major problem is, the amounts spend/received cannot be deciphered, given it remains hidden on the Monero blockchain. Once hashrate has crossed 50%, anything is probable.&lt;/p&gt;\n\n&lt;p&gt;The ONLY trust factor is MineXmr owner remains loyal to the blockchain. Trustless has now become - trustful. And he is not willing to bog down, and he does not care and is willing to keep adding more hash power to his pool&amp;#39;s throughput.&lt;/p&gt;\n\n&lt;p&gt;Really Sad!&lt;/p&gt;\n\n&lt;p&gt;More more info, read here:&lt;a href=\"https://www.investopedia.com/terms/1/51-attack.asp\"&gt;https://www.investopedia.com/terms/1/51-attack.asp&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;EDIT1: &lt;strong&gt;51% Attack Real-World Examples&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Krypton and Shift, two blockchains based on &lt;a href=\"https://www.investopedia.com/terms/e/ethereum.asp\"&gt;Ethereum&lt;/a&gt;, suffered 51% attacks in August 2016.&lt;/p&gt;\n\n&lt;p&gt;In May of 2018, Bitcoin Gold, at the time the 26th-largest  cryptocurrency, suffered a 51% attack. The malicious actor or actors  controlled a vast amount of Bitcoin Gold&amp;#39;s hash power, such that even with Bitcoin Gold repeatedly attempting to raise the exchange thresholds, the attackers were able to double-spend for several days, eventually stealing more than $18 million worth of Bitcoin Gold. Bitcoin Gold was hit again in 2020.&lt;/p&gt;\n\n&lt;p&gt;Recently, the Bitcoin SV (BSV) network suffered an attack in August 2021.&lt;/p&gt;\n\n&lt;h1&gt;EDIT2: An important comment by &lt;a href=\"https://www.reddit.com/user/MaZZeL3L/\"&gt;MaZZeL3L&lt;/a&gt;:&lt;/h1&gt;\n\n&lt;p&gt;Yeah 51% attack is not a healthy thing and I wouldn&amp;#39;t accept any payments as  final until a few blocks of confirmation but right now there&amp;#39;s no real threat to the anonymity of transactions, nor the amount of coins in existence. they can&amp;#39;t change consensus either.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;EDIT3: BEST explanation by &lt;a href=\"/u/cndvcndv\"&gt;u/cndvcndv&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;If the miners keep that going, it&amp;#39;s not gonna be great for them at all. No one will accept to get paid by XMR even for trades. That would cause the price to drop and reduce their profits. That&amp;#39;s really reckless.&lt;/p&gt;\n\n&lt;p&gt;From the perspective of other miners, they might feel scared that their blocks will be kicked out of the chain. I hope that doesn&amp;#39;t cause them to move into mineXMR. I don&amp;#39;t know how one would break that positive feedback loop unless the price hits bottom.&lt;/p&gt;\n\n&lt;p&gt;I love XMR; it&amp;#39;s sad to see that happening.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 439,
  "permalink": "/r/CryptoCurrency/comments/ssvdug/big_threat_looming_over_monero_blockchain_minexmr/",
  "subreddit": "CryptoCurrency",
  "id": "ssvdug",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You would see that this has been doing rounds now since recently. MineXmr (a\nsupposedly infamous) mining pool, now owns 52% or more of network's hashrate\n[https://pools.xmr.wiki/]. Know that Monero mining is special and has been\ntouted to be more decentralized as it supports CPU mining, which has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近になって、このことが話題になっているのがわかると思います。MineXmr（ある\n悪名高い）マイニングプールは、現在、ネットワークのハッシュレートの52％以上を所有しています。\n[https://pools.xmr.wiki/】。］ Moneroの採掘は特別であり、これまで\nCPUマイニングに対応しているため、より分散化が進んでいると言われていますが、これは...",
      "title": "Moneroブロックチェーンに迫るBIGな脅威! MineXMRマイニングプールがネットワークハッシュレートの52%以上を所有!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你会看到，从最近开始，这个问题就一直在做。MineXmr（一个\n据称是臭名昭著的）矿池，现在拥有52%或更多的网络hashrate\n[https://pools.xmr.wiki/]。要知道，Monero挖矿是很特别的，而且被称为\n被吹捧为更加分散，因为它支持CPU挖矿，这已经...",
      "title": "Monero区块链面临巨大的威胁! MineXMR矿池现在拥有52%以上的网络哈希值!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你會看到，從最近開始，這個問題就一直在做。MineXmr（一個\n據稱是臭名昭著的）礦池，現在擁有52%或更多的網絡hashrate\n[https://pools.xmr.wiki/]。要知道，Monero挖礦是很特別的，而且被稱爲\n被吹捧爲更加分散，因爲它支持CPU挖礦，這已經...",
      "title": "Monero區塊鏈面臨巨大的威脅! MineXMR礦池現在擁有52%以上的網絡哈希值!"
    }
  ]
}