{
  "author": "muchadoaboutnotmuch",
  "original_created_utc": 1658583888,
  "title": "What kinds of people would have filled Titanic's third class on the return trip to England?",
  "created_utc": 1658646293,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The 1997 movie depicts the third class passengers as being European immigrants to America.   Had the Titanic gone on to make a return voyage, is there any evidence of who was buying those third class tickets?   Was there an equivalent number of people emigrating back to Europe at that time?  Lower class persons traveling for business or pleasure?   Or would those bunks have remained empty or filled with cargo?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/w64drg/what_kinds_of_people_would_have_filled_titanics/",
  "subreddit": "AskHistorians",
  "id": "w64drg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The 1997 movie depicts the third class passengers as being European immigrants\nto America. Had the Titanic gone on to make a return voyage, is there any\nevidence of who was buying those third class tickets? Was there an equivalent\nnumber of people emigrating back to Europe at that time? Lower class…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1997年の映画では、3等席の乗客がヨーロッパからの移民であることが描かれている\nとして描かれています。もしタイタニック号が再航していたら、3等船客を誰が買っていたのか、その証拠はあるのでしょうか。\nその3等席のチケットを買っていたのは誰なのか、その証拠はあるのか。また、それに見合うだけの\nその時、ヨーロッパに移民していた人数は同じだったのでしょうか？下級...",
      "title": "イギリスへの帰路、タイタニックの3等船室にはどんな人たちが乗っていたのだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1997年的电影将三等舱的乘客描述为欧洲移民\n到美国。如果泰坦尼克号继续返航，是否有任何证据表明谁在购买这些三等舱的票？\n有证据表明谁在购买这些三等舱的票？是否有同等数量的\n当时有同等数量的人移民回欧洲吗？低级别的...",
      "title": "在返回英国的旅程中，泰坦尼克号的三等舱会有哪些人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1997年的電影將三等艙的乘客描述爲歐洲移民\n到美國。如果泰坦尼克號繼續返航，是否有任何證據表明誰在購買這些三等艙的票？\n有證據表明誰在購買這些三等艙的票？是否有同等數量的\n當時有同等數量的人移民回歐洲嗎？低級別的...",
      "title": "在返回英國的旅程中，泰坦尼克號的三等艙會有哪些人？"
    }
  ]
}