{
  "author": "cornh_",
  "the_new_excerpt": "I did expect a wild ride this alt season but I did not expect that we would have\ndoge season where there would be tribes of people holding different dog coins\narguing with each other. Today I saw a discussion between a doge holder and a\nshib inu holder about which coin is the better store of value,…",
  "original_created_utc": 1620831482,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年のアルトシーズンは大荒れになると予想していましたが、まさかこんなことになるとは\n異なる犬のコインを持った人たちが部族になって、お互いに言い争うようなDOGEシーズンになるとは思いませんでした。\n互いに議論している。今日、私はdogeホルダーとshib inuホルダーの間で、どちらのコインが良いかという議論を見ました。\nどちらのコインが優れた価値を持っているのか、という議論を見ました。",
      "title": "ドージェ・マニアの中でも特に面白いのは、さまざまな「ドージェコイン」の保有者がファンダメンタルズについて議論している様子です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我确实期待着这个祭祀季节的狂欢，但我没有想到，我们会有\n在这个季节，会有很多人拿着不同的狗币的部落\n互相争论。今天我看到一个持有狗币的人和一个持有什叶派的人在讨论\n的讨论，讨论哪种硬币是更好的价值储存，...",
      "title": "在狗仔队的狂热中，最搞笑的事情之一是看到不同的 \"狗仔币 \"持有者互相争论基本面。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我確實期待着這個祭祀季節的狂歡，但我沒有想到，我們會有\n在這個季節，會有很多人拿着不同的狗幣的部落\n互相爭論。今天我看到一個持有狗幣的人和一個持有什葉派的人在討論\n的討論，討論哪種硬幣是更好的價值儲存，...",
      "title": "在狗仔隊的狂熱中，最搞笑的事情之一是看到不同的 \"狗仔幣 \"持有者互相爭論基本面。"
    }
  ],
  "title": "One of the most hilarious things coming out of the doge mania is seeing different “dog coin” holders arguing with each other about fundamentals",
  "created_utc": 1620842601,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I did expect a wild ride this alt season but I did not expect that we would have doge season where there would be tribes of people holding different dog coins arguing with each other. Today I saw a discussion between a doge holder and a shib inu holder about which coin is the better store of value, both very serious.</p>\n\n<p>I understand if people buy these coins to speculate on a quick buck, or buy it for fun, but someone turning into a hardcore cultist for a dog meme coin is really mind boggling to me.</p>\n\n<p>I love crypto</p>\n</div><!-- SC_ON -->",
  "score": 1649,
  "permalink": "/r/CryptoCurrency/comments/naqp3c/one_of_the_most_hilarious_things_coming_out_of/",
  "subreddit": "CryptoCurrency",
  "id": "naqp3c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993623
}