{
  "author": "kodaa43",
  "original_created_utc": 1660049372,
  "title": "Why would a restaurant charge me for “waste”?",
  "created_utc": 1660056661,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I went to a sushi restaurant and had 2 pieces left over. I got a box and brought them home. I was charged 50¢ each for waste. I have heard of charges for leftovers when it is all you can eat but this time I just paid for each sushi roll at the beginning. I asked about it and they didn’t have a good explanation. &lt;/p&gt;\n\n&lt;p&gt;Does anyone know why they would charge me again when I paid at the start? I also thought it could’ve been for the box but it was like a paper box and my friend got one too and wasn’t charged.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/wk2his/why_would_a_restaurant_charge_me_for_waste/",
  "subreddit": "NoStupidQuestions",
  "id": "wk2his",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I went to a sushi restaurant and had 2 pieces left over. I got a box and brought\nthem home. I was charged 50¢ each for waste. I have heard of charges for\nleftovers when it is all you can eat but this time I just paid for each sushi\nroll at the beginning. I asked about it and they didn’t have a good…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お寿司屋さんに行って、2貫残りました。箱で買って帰りました。\n家に持ち帰りました。ゴミとして1個50¢を請求された。残り物には福がある。\n食べ放題の場合、食べ残しに料金がかかると聞いたことがありますが、今回は寿司の代金だけで済みました。\n巻き寿司の場合は、最初に1本ずつ払いました。それについて尋ねると、彼らは良い...",
      "title": "なぜ、レストランで「もったいない」と料金を取られるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我去了一家寿司店，剩下了两块。我买了一盒并带回家\n它们带回家。我被收取了每块50美分的垃圾费。我听说过在你能吃完的情况下，对剩饭剩菜收费。\n但这次我只是在开始时为每个寿司\n卷的费用。我问了一下，他们没有很好的回答。",
      "title": "餐馆为什么要向我收取 \"废物 \"的费用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我去了一家壽司店，剩下了兩塊。我買了一盒並帶回家\n它們帶回家。我被收取了每塊50美分的垃圾費。我聽說過在你能喫完的情況下，對剩飯剩菜收費。\n但這次我只是在開始時爲每個壽司\n卷的費用。我問了一下，他們沒有很好的回答。",
      "title": "餐館爲什麼要向我收取 \"廢物 \"的費用？"
    }
  ]
}