{
  "author": "PunPryde",
  "original_created_utc": 1628384087,
  "title": "Don't fully understand what is going on with the US infrastructure bill everyone is talking about? I took a shot at an ELI5 for you.",
  "created_utc": 1628419324,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of people have been asking questions about this US bill that is being proposed this weekend in the US. Some have also asked for an ELI5. I took a shot at it below to explain it as simply as possible (TL;DR at bottom). </p>\n\n<p>Hidden within the larger $1.2 trillion US infrastructure legation bill is a clause on crypto. This clause wants anyone who is providing <strong>any</strong> crypto service to record and report the value of the service and who received the service to the IRS (taxation institution in the US) so that they can tax them. This includes development, mining, defi, cefi, you name it.    </p>\n\n<p>This is obviously impossible due to the very decentralized nature of crypto, which then would make providing those crypto services illegal in the US.     </p>\n\n<p>On top of this the language is very confusing and makes no sense because some of it applies to Bitcoin but not ETH 2.0 for example. It just shows these US lawmakers have little understanding of crypto but are trying to regulate and tax it. There are already amendments (proposed adjustments) filed to help clear language around crypto tax up or even remove it completely.      </p>\n\n<p>Today, the senate debated the bill but was not able to reach a conclusion yet. On Sunday, the senate will reconvene again to resume consideration of the bill and vote. Ted Cruz said he filed a separate amendment to strike the whole thing, in the event a bipartisan deal can’t be reached.  </p>\n\n<p>Even if this bill passes the senate it still needs to pass the house as well, 2 separate chambers of legislation in the US, must pass both.    </p>\n\n<p>TL;DR: US lawmakers are trying to sneakingly pass overarching crypto taxation laws in a huge infrastructure bill but they have little idea what they are talking about and it&#39;s a mess so now a bunch of politicians are trying to debate and fix it.</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "permalink": "/r/CryptoCurrency/comments/p053lg/dont_fully_understand_what_is_going_on_with_the/",
  "subreddit": "CryptoCurrency",
  "id": "p053lg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of people have been asking questions about this US bill that is being\nproposed this weekend in the US. Some have also asked for an ELI5. I took a shot\nat it below to explain it as simply as possible (TL;DR at bottom).\n\nHidden within the larger $1.2 trillion US infrastructure legation bill is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が、この米国の法案について質問しています。\n今週末に米国で提案される また、ELI5を求めている人もいます。私は以下のようにして\nなるべく簡単に説明するために、以下に挑戦してみました（下部にTL;DRを記載）。\n\n1.2兆ドル規模の米国インフラ整備法案の中に隠されているのは...",
      "title": "みんなが言っている米国のインフラ法案の内容がよくわからない？そんなあなたのために、私はELI5に挑戦しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人一直在问关于这个美国法案的问题。\n本周末在美国提出的法案。有些人还要求提供ELI5。我拍了一下\n尽可能简单地解释如下（TL;DR在底部）。\n\n隐藏在更大的1.2万亿美元的美国基础建设法案中的是...",
      "title": "不完全了解大家都在谈论的美国基础设施法案是怎么回事？我为你拍了一张ELI5。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人一直在問關於這個美國法案的問題。\n本週末在美國提出的法案。有些人還要求提供ELI5。我拍了一下\n儘可能簡單地解釋如下（TL;DR在底部）。\n\n隱藏在更大的1.2萬億美元的美國基礎建設法案中的是...",
      "title": "不完全瞭解大家都在談論的美國基礎設施法案是怎麼回事？我爲你拍了一張ELI5。"
    }
  ]
}