{
  "author": "paulkanyamucanary",
  "original_created_utc": 1653600888,
  "title": "Do you think Homophobia will ever end in Africa?",
  "created_utc": 1653634552,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I  am a human rights defender, and refugee rights advocate living in Kakuma refugee camp Kenya.\nI&amp;#39;m facing extreme persecutions and Homophobia. My parents chased me away from home after they discovered that am Lgbti. I have gone through the worst. I was pushed into a long ditch by Homophobic Refugees and my bones got broken and dislocated...\nWe need more advocacy dear Friends.\nI&amp;#39;m threatened on daily, denied services some times and they want to poison me.\n I need a safe place I can stay. \nIs being who you are a crime?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/uyi4ti/do_you_think_homophobia_will_ever_end_in_africa/",
  "subreddit": "TooAfraidToAsk",
  "id": "uyi4ti",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a human rights defender, and refugee rights advocate living in Kakuma\nrefugee camp Kenya. I'm facing extreme persecutions and Homophobia. My parents\nchased me away from home after they discovered that am Lgbti. I have gone\nthrough the worst. I was pushed into a long ditch by Homophobic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ケニアのカクマ難民キャンプに住む人権擁護者であり、難民の権利擁護者です。\nケニアのカクマ難民キャンプに住んでいます。私は極度の迫害と同性愛嫌悪に直面しています。私の両親は\nは、私が同性愛者であることを知ってから、私を家から追い出しました。私は\n最悪の事態を経験しました。私はホモフォビアによって長い溝に押し込まれた...。",
      "title": "アフリカでホモフォビアがなくなると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名人权捍卫者，也是一名难民权利倡导者，居住在肯尼亚卡库马\n肯尼亚难民营。我正面临着极端的迫害和对同性恋的恐惧。我的父母\n在发现我是同性恋后，把我赶出了家门。我已经去了\n经历了最糟糕的情况。我被仇视同性恋的人推到一个长长的沟里。",
      "title": "你认为非洲的恐同症会结束吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名人權捍衛者，也是一名難民權利倡導者，居住在肯尼亞卡庫馬\n肯尼亞難民營。我正面臨着極端的迫害和對同性戀的恐懼。我的父母\n在發現我是同性戀後，把我趕出了家門。我已經去了\n經歷了最糟糕的情況。我被仇視同性戀的人推到一個長長的溝裏。",
      "title": "你認爲非洲的恐同症會結束嗎？"
    }
  ]
}