{
  "author": "jumbeldor",
  "original_created_utc": 1639122252,
  "title": "Just because a coin's value is $0.00001 doesn't mean it has room to reach $1",
  "created_utc": 1639135898,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This post is particularly for those who have little to no idea about Market Cap.&lt;/p&gt;\n\n&lt;p&gt;People new to crypto often fall prey to the shillers offering millions of tokens at just $10 or so. The boom of dogecoin and it&amp;#39;s peers have just added fuel to the sale of memecoins which are often scams or rugpulls. Even if they aren&amp;#39;t, that doesn&amp;#39;t mean it&amp;#39;s a good investment.&lt;/p&gt;\n\n&lt;p&gt;The value and room for growth of any Cryptocurrency is determined by it&amp;#39;s Marketcap. The market cap of a token is calculated by multiplying the value of one coin into the total supply of the coin.&lt;/p&gt;\n\n&lt;p&gt;If a coin has the value of $0.0001 a piece and the market cap of $100 billion and you buy a million tokens thinking it&amp;#39;ll make you a millionaire someday, you are WRONG!\nThis token will NEVER go to $1. For it to reach $1 the market cap of the crypto would have to be $1 Quadrillion Which is IMPOSSIBLE! Even Bitcoin, the OG, doesn&amp;#39;t have that marketcap. &lt;/p&gt;\n\n&lt;p&gt;That being said, while checking the marketcap is important,if the token is deflationary you should check the minimum supply it will have in the future and then calculate it&amp;#39;s highest possible growth.&lt;/p&gt;\n\n&lt;p&gt;If there is something I need to add or correct, please comment it.&lt;/p&gt;\n\n&lt;p&gt;Edit: Market capitalisation is obviously not the only criteria which can help us determine how much a coin&amp;#39;s value can grow, but it is a good place to start. There are plenty other things such as total supply and max supply of tokens, fully diluted market cap, volume etc. \nOne should always read the token&amp;#39;s whitepaper to find all the details, check social media handles of the dev team and the official handle of the token (if they have any).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 412,
  "permalink": "/r/CryptoCurrency/comments/rd3hkt/just_because_a_coins_value_is_000001_doesnt_mean/",
  "subreddit": "CryptoCurrency",
  "id": "rd3hkt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This post is particularly for those who have little to no idea about Market Cap.\n\nPeople new to crypto often fall prey to the shillers offering millions of tokens\nat just $10 or so. The boom of dogecoin and it's peers have just added fuel to\nthe sale of memecoins which are often scams or rugpulls.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事は、特にMarket Capについてほとんど知らない人のために書かれたものです。\n\n暗号を初めて使う人は、何百万ものトークンを提供する詐欺師の餌食になることがよくあります。\nをわずか10ドル程度で購入することができます。ドージコインのブームや同業者のブームが、さらに拍車をかけました。\nメメコインが売られているが、それは詐欺かラグパルであることが多い...。",
      "title": "コインの価値が0.00001ドルだからといって、1ドルに到達する余地があるとは限らない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章特别针对那些对市值几乎没有概念的人。\n\n刚接触加密货币的人经常会被那些以10美元左右的价格提供数百万个代币的欺诈者所欺骗。\n沦为骗子的牺牲品，因为他们的价格仅有10美元左右。dogecoin和它的同行们的繁荣，只是为memecoins的销售添加了燃料。\n销售的memecoins往往是骗局或地毯式的....",
      "title": "一个硬币的价值是0.00001美元，并不意味着它有达到1美元的空间"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章特別針對那些對市值幾乎沒有概念的人。\n\n剛接觸加密貨幣的人經常會被那些以10美元左右的價格提供數百萬個代幣的欺詐者所欺騙。\n淪爲騙子的犧牲品，因爲他們的價格僅有10美元左右。dogecoin和它的同行們的繁榮，只是爲memecoins的銷售添加了燃料。\n銷售的memecoins往往是騙局或地毯式的....",
      "title": "一個硬幣的價值是0.00001美元，並不意味着它有達到1美元的空間"
    }
  ]
}