{
  "author": "Nysnodrop",
  "the_new_excerpt": "I like that it covers half my face. I know I look fine but I still feel more\nconfident when i don't have to show my entire face. Such a small difference in\nhow i present myself in public has actually done very positive things for my\nmental health.\n\n& anyway I get that's an unpopular opinion to say…",
  "original_created_utc": 1617325405,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢它能遮住我的半边脸。我知道我看起来很好，但我还是觉得更多的\n自信，当我不需要展示我的整个脸。这么小的差别\n我如何在公众面前展示自己实际上已经做了非常积极的事情，为我的。\n心理健康。\n\n反正我知道这是一个不受欢迎的意见说... ...",
      "title": "我喜欢戴口罩，继续戴口罩能接受吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡它能遮住我的半邊臉。我知道我看起來很好，但我還是覺得更多的\n自信，當我不需要展示我的整個臉。這麼小的差別\n我如何在公衆面前展示自己實際上已經做了非常積極的事情，爲我的。\n心理健康。\n\n反正我知道這是一個不受歡迎的意見說... ...",
      "title": "我喜歡戴口罩，繼續戴口罩能接受嗎？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "顔の半分をカバーしてくれるのがいいですね。自分では問題ないと思っているのですが、やはり顔全体を見せない方が\n顔全体を見せる必要がない方が自信が持てます。人前での自分の見せ方を変えるだけの\n人前での自分の見せ方が変わることで、精神的にもとても良い影響を受けています。\n心の健康にとても良い影響を与えています。\n\nとにかく、これは人気のない意見だと思いますが...。",
      "title": "私はマスクをするのが好きなのですが、このままマスクをしていても大丈夫でしょうか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "顔の半分をカバーしてくれるのがいいですね。自分では問題ないと思っているのですが、やはり顔全体を見せない方が\n顔全体を見せる必要がない方が自信が持てます。人前での自分の見せ方を変えるだけの\n人前での自分の見せ方が変わることで、精神的にもとても良い影響を受けています。\n心の健康にとても良い影響を与えています。\n\nとにかく、これは人気のない意見だと思いますが...。",
      "title": "私はマスクをするのが好きなのですが、このままマスクをしていても大丈夫でしょうか？"
    }
  ],
  "title": "I like wearing a mask, Will it be acceptable to continue to wear one?",
  "created_utc": 1617342169,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I like that it covers half my face. I know I look fine but I still feel more confident when i don&#39;t have to show my entire face. Such a small difference in how i present myself in public has actually done very positive things for my mental health.</p>\n\n<p>&amp; anyway I get that&#39;s an unpopular opinion to say the least. There has been antimasker problem here in the US for a long time. But now that the year has passed and things are easing a bit, seems like much MORE people are against masks now. Like, it really seems like the average person is against it. I just don&#39;t want people to think of me badly or act like im trying to make a statement when I wear one when I&#39;m not. Just because everyone else is making a big deal and statement over it doesn&#39;t mean I am.. I just want to wear a mask.</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/mi9j7x/i_like_wearing_a_mask_will_it_be_acceptable_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "mi9j7x",
  "is_self": true,
  "media": null,
  "is_video": false
}