{
  "author": "cryptosp",
  "the_new_excerpt": "To paraphrase, this is what he said: \"We were looking for a place to store cash\ntrying to get good returns while also trying to preserve liquidity. The\ntraditional options we looked into had low yields and involved taking some risks\nor sacrifice liquidity. Whereas with Bitcoin, we are pleased with…",
  "original_created_utc": 1619479811,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "言い換えれば、こんなことを言っていました。\"私たちは、現金を保管する場所を探していました。\n流動性を維持しつつ、良いリターンを得ようとしていた。従来の\n私たちが検討した従来の選択肢は、利回りが低く、多少のリスクを伴うものでした。\nまた、流動性を犠牲にしなければなりませんでした。一方、ビットコインについては、私たちは満足しています。",
      "title": "今日のTeslaの決算説明会で、Teslaの幹部がビットコインについて非常に強気な発言をしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "转述一下，他是这样说的。\"我们正在寻找一个储存现金的地方\n试图获得良好的回报，同时也试图保持流动性。我们所研究的传统方案的收益率很低，而且涉及到一些风险。\n我们研究的传统方案收益率低，而且涉及到承担一些风险\n或牺牲流动性。而对于比特币，我们很满意...",
      "title": "在今天的特斯拉收益电话会议上，一位特斯拉高管对比特币的看法非常看好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "轉述一下，他是這樣說的。\"我們正在尋找一個儲存現金的地方\n試圖獲得良好的回報，同時也試圖保持流動性。我們所研究的傳統方案的收益率很低，而且涉及到一些風險。\n我們研究的傳統方案收益率低，而且涉及到承擔一些風險\n或犧牲流動性。而對於比特幣，我們很滿意...",
      "title": "在今天的特斯拉收益電話會議上，一位特斯拉高管對比特幣的看法非常看好"
    }
  ],
  "title": "A very bullish note from a Tesla executive on Bitcoin during today's Tesla earnings call",
  "created_utc": 1619508637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To paraphrase, this is what he said: <strong>&quot;We were looking for a place to store cash trying to get good returns while also trying to preserve liquidity. The traditional options we looked into had low yields and involved taking some risks or sacrifice liquidity. Whereas with Bitcoin, we are pleased with the liquidity in the market and it was a good decision to buy Bitcoins. We are optimistic about Bitcoin for many reasons and it is out intent to hold our current Bitcoin position and continue to accumulate Bitcoins from customer transactions as they purchase vehicles.&quot;</strong></p>\n</div><!-- SC_ON -->",
  "score": 309,
  "permalink": "/r/Bitcoin/comments/mzb3o9/a_very_bullish_note_from_a_tesla_executive_on/",
  "subreddit": "Bitcoin",
  "id": "mzb3o9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776205693
}