{
  "author": "Nilla_Tree",
  "original_created_utc": 1633546990,
  "title": "What do ‘adults’ do at work?",
  "created_utc": 1633572577,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hope I don’t get a lot of hate asking such a silly question, but I just started my first full time, post-graduation desk job after years of being a student and working different retail/food service jobs and I don’t know what to do with my time. This is my first job where every minute isn’t filled with something to do. </p>\n\n<p>In previous jobs, when I wasn’t serving customers or prepping food, there was always cleaning to do, food safety/temperature checks  and restocking. In my current role some days are just not busy and I can complete all my tasks and don’t have any additional work scheduled. I feel guilty for not working and still being paid. I’m just wondering if this is common, and if so, what do others do to fill the work day? Am I supposed to ask for more work? I know I probably come across as very naive, but I genuinely have no idea if this is normal, and would really appreciate others’ insight.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/q2r3jn/what_do_adults_do_at_work/",
  "subreddit": "TooAfraidToAsk",
  "id": "q2r3jn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I hope I don’t get a lot of hate asking such a silly question, but I just\nstarted my first full time, post-graduation desk job after years of being a\nstudent and working different retail/food service jobs and I don’t know what to\ndo with my time. This is my first job where every minute isn’t filled…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなくだらない質問をして嫌われないようにしたいのですが、私はちょうど\n卒業後、初めてフルタイムのデスクワークを始めました。\n何年も学生生活を送り、様々な小売店やフードサービスの仕事をしてきましたが、自分の時間を何に使ったらいいのかわかりません。\n自分の時間をどう使えばいいのかわかりません。この仕事は、1分1秒を争うような初めての仕事です...。",
      "title": "大人」は仕事で何をしているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我希望我问这样一个愚蠢的问题不会引起很多人的厌恶，但我刚刚\n我刚刚开始了我的第一份全职工作，毕业后的文职工作，在做了多年的学生和工作后\n几年来，我一直是个学生，做着不同的零售/食品服务工作，我不知道该如何处理我的时间。\n我不知道该如何处理我的时间。这是我的第一份工作，每一分钟都没有被填满...",
      "title": "成人 \"在工作中做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望我問這樣一個愚蠢的問題不會引起很多人的厭惡，但我剛剛\n我剛剛開始了我的第一份全職工作，畢業後的文職工作，在做了多年的學生和工作後\n幾年來，我一直是個學生，做着不同的零售/食品服務工作，我不知道該如何處理我的時間。\n我不知道該如何處理我的時間。這是我的第一份工作，每一分鐘都沒有被填滿...",
      "title": "成人 \"在工作中做什麼？"
    }
  ]
}