{
  "author": "dowhatsimonsayz",
  "original_created_utc": 1632124176,
  "title": "Happy Dip day Crypto family.",
  "created_utc": 1632137574,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure you&#39;ve all seen the market is down today. I guess it&#39;s to be expected after such a nice last few weeks. I&#39;ve prepared for this dip by saving some money to the side. My question for the community today is what are your favorite projects that you&#39;re looking into getting into today? I see some really nice discounts on crypto today and I&#39;m trying to get a community consensus on what we think is a good buy right now? My personal picks are Luna, Algo, maybe some ADA. Do we still think Dot is a good buy at current prices?</p>\n\n<p>Edit: Ok, I&#39;ve made some moves. My picks were Algorand, Harmony One, Cardano &amp; Polkadot. </p>\n\n<p>Edit2: If I didn&#39;t already have a bag I&#39;d also pick up XTZ, LUNA, MATIC, CAKE, SOL, Ergo, Elrond.</p>\n\n<p>Edit: Thanks for all the great suggestions, also thanks for being such a cool community. Much love people ❤️</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/prq4w7/happy_dip_day_crypto_family/",
  "subreddit": "CryptoCurrency",
  "id": "prq4w7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm sure you've all seen the market is down today. I guess it's to be expected\nafter such a nice last few weeks. I've prepared for this dip by saving some\nmoney to the side. My question for the community today is what are your favorite\nprojects that you're looking into getting into today? I see some…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は市場が下がっているのを皆さんもご覧になったと思います。ここ数週間は好調だっただけに、当然の結果と言えるでしょう。\n予想されることだと思います。私はこの下落に備えて、いくつかのお金を貯めておきました。\n私はこの下落に備えて、お金を貯めています。今日のコミュニティへの質問は、あなたのお気に入りのプロジェクトは何ですか？\n今日、あなたが参加したいと思っているプロジェクトは何ですか？私が見ているのは、いくつかの...",
      "title": "Happy Dip day Crypto family."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信你们都看到了今天的市场在下跌。我想这是可以预期的\n在过去几周如此美好的日子里。我已经为这次下跌做了准备，存了一些\n钱。我今天要问大家的问题是，你们最喜欢的\n的项目？我看到一些...",
      "title": "快乐的浸礼日 Crypto家庭。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信你們都看到了今天的市場在下跌。我想這是可以預期的\n在過去幾周如此美好的日子裏。我已經爲這次下跌做了準備，存了一些\n錢。我今天要問大家的問題是，你們最喜歡的\n的項目？我看到一些...",
      "title": "快樂的浸禮日 Crypto家庭。"
    }
  ]
}