{
  "author": "throwaway_68892188",
  "the_new_excerpt": "Edit: for all of the raging feminists, the title should've been \"sex doesn't\nmake me happy\", not \"women don't make me happy\".\n\nI (25m) spent years hooking up and have had dozens of partners. What I\npreviously thought would manifest into an insatiable hole of sexual conquest has\nactually turned into…",
  "original_created_utc": 1611362782,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我(25米)勾心斗角多年，有过几十个伴侣。我的\n以前认为会表现为贪得无厌的性征服的洞，现在已\n居然变成了反面教材。\n\n我已经逐渐意识到，性在我的幸福中是那么一小部分。I\n以前经常找胳膊糖，现在... ...",
      "title": "男人们，你们有没有到了一个地步，发现女人其实并不能让你们幸福？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我(25米)勾心鬥角多年，有過幾十個伴侶。我的\n以前認爲會表現爲貪得無厭的性徵服的洞，現在已\n居然變成了反面教材。\n\n我已經逐漸意識到，性在我的幸福中是那麼一小部分。I\n以前經常找胳膊糖，現在... ...",
      "title": "男人們，你們有沒有到了一個地步，發現女人其實並不能讓你們幸福？"
    }
  ],
  "title": "Men, did you ever reach a point where you realized women don't actually make you happy?",
  "created_utc": 1611374670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: for all of the raging feminists, the title should&#39;ve been &quot;sex doesn&#39;t make me happy&quot;, not &quot;women don&#39;t make me happy&quot;.</p>\n\n<p>I (25m) spent years hooking up and have had dozens of partners. What I previously thought would manifest into an insatiable hole of sexual conquest has actually turned into the opposite.</p>\n\n<p>I have grown to realize that sex is such a small fraction of my happiness. I used to seek out arm candy and now I don&#39;t even bother. What I realized matters is in the heart... beauty is in the eye of the beholder. It&#39;s mostly on the inside of us, in our brains and hearts. Pussy has grown to possess no value to me whatsoever.</p>\n\n<p>I actually enjoy friendships with women in my life. I&#39;m thankful for the heartaches and the romances that have passed. Trying to objectify women for years has actually done the complete opposite- the more I met and slept with women, the more I realized that it doesn&#39;t matter.</p>\n\n<p>Sex is as desirable as eating, sleeping, or shitting. It&#39;s great for a few moments and then it ends. It&#39;s the life you live before and after that matters. There are many more satisfying things in life, filled with much more substance.</p>\n\n<p>So now I am 25 and see that I am a man I would never thought I&#39;d be. Still kinda horny, but with a different perspective.</p>\n\n<p>And I&#39;m wondering if anybody can relate.</p>\n\n<p>Edit: thank you for the awards. Lots of great replies and some judgemental ones too. Thank you all for coming together in a civil way to discuss something that I think a lot of men think about! God bless you all.</p>\n</div><!-- SC_ON -->",
  "score": 10436,
  "permalink": "/r/AskMen/comments/l31dum/men_did_you_ever_reach_a_point_where_you_realized/",
  "subreddit": "AskMen",
  "id": "l31dum",
  "is_self": true,
  "media": null,
  "is_video": false
}