{
  "author": "hello-world-foo-bar",
  "the_new_excerpt": "This post will describe the behaviour of an infinite short squeeze using Blue\nAppron as a case study. On March 16, 2020. Blue Appron stock priced moved from\n2.30 to 28.00 in ONE DAY. That's an 1100% gain in one day with the stock price.\nOptions moved over 100000% that day. The reason was an infinite…",
  "original_created_utc": 1611245539,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "本篇文章将介绍使用Blue进行无限短线挤压的行为。\n以Appron为案例。2020年3月16日，。蓝色阿普朗股票价格从\n一天之内2.30到28.00。这一天的股价涨幅高达1100%。\n当天期权变动超过100000%。原因是无限的...",
      "title": "无限短压讲解｜蓝艾普隆案例分析｜GME无限短压讲解。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本篇文章將介紹使用Blue進行無限短線擠壓的行爲。\n以Appron爲案例。2020年3月16日，。藍色阿普朗股票價格從\n一天之內2.30到28.00。這一天的股價漲幅高達1100%。\n當天期權變動超過100000%。原因是無限的...",
      "title": "無限短壓講解｜藍艾普隆案例分析｜GME無限短壓講解。"
    }
  ],
  "title": "Infinite Short Squeeze Explained | Blue Appron Case Study | GME Infinite Short Squueze",
  "created_utc": 1611254103,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post will describe the behaviour of an infinite short squeeze using Blue Appron as a case study.  On March 16, 2020.  Blue Appron stock priced moved from 2.30 to 28.00 in ONE DAY.   <strong><em>That&#39;s an 1100% gain in one day with the stock price.  Options moved over 100000% that day.</em></strong> The reason was an infinite short squeeze similar to the one that is happening with GME.</p>\n\n<p>&#x200B;</p>\n\n<h1>Blue Appron Short Interest (SI)</h1>\n\n<p>During that period Blue Apron&#39;s short interest was 50%.  Blue Apron was running out of cash and shorts piled on.  Then the pandemic happened an people started ordering meal kits en mass, infusing Blue Apron with large inflows of cash.  Fearing, meal kits had become a secular trend like ride sharing, shorts started to cover.  But they soon discovered shares were limited.  So the infinite squeeze happened.  <em>They had to cover at any price to balance their books when Market makers started to sell off their other positions.</em></p>\n\n<p>&#x200B;</p>\n\n<h1>GME Short Interest</h1>\n\n<p>Currently GME Short Interest is rumored to be above 100% [1].  Thus the environment is similar to the Blue Appron infinite short squeeze.  Namely, there are no shares for GME shorts to cover, once the infinite squeeze occurs and MM forces them to balance their books.</p>\n\n<p>Moreover, the squeeze hasn&#39;t happened yet, given that the Short Interest hasn&#39;t moved lower.  In fact, it has been rumored short interest has increased as shorts make a last ditch effort to scare off the bulls.  But the markets is aware how the conditions are there for an infinite short squeeze.</p>\n\n<p>&#x200B;</p>\n\n<h1>Behaviour of an Infinite Short Squeeze</h1>\n\n<p>The behaviour of an infinite short squeeze (ISS) are violent.  In financial history, the two widely cited cases are the VW infinite squeeze of &#39;08 and the Blue Appron one of &#39;20.  As you can see, infinite short squeezes have been rare because most rational agents would never get themselves into a situation which would lead to an ISS.</p>\n\n<p>When shares can&#39;t be covered and stock price increases, shorts are forced to cover by Market Makers.  But because of the huge supply/demand imbalance, shorts have to cover at prices that would seem irrational on a cursory glance but are rational based on the supply/demand equilibrium of available shares.  <strong><em>Consequently, it is normal to see 1000% increases in one day.  And 100000% gains in 0dte options.</em></strong></p>\n\n<p>As more market player realize the infinite short squeeze is inevitable, the tripping point of the squeeze collapses from months to days to hours.   <em>The only way shorts can alleviate the narrative of inevitably is to spread fear, uncertainty and doubt (FUD).  So as long as GME stock positions are maintained, and more shares are bought, the short squeeze is inevitable.</em></p>\n\n<p>Owning stock or options are better than a lottery ticket because the odds are in your favor.</p>\n\n<p>[1] <a href=\"https://www.marketbeat.com/stocks/NYSE/GME/short-interest/\">https://www.marketbeat.com/stocks/NYSE/GME/short-interest/</a></p>\n</div><!-- SC_ON -->",
  "score": 1726,
  "permalink": "/r/stocks/comments/l21gpz/infinite_short_squeeze_explained_blue_appron_case/",
  "subreddit": "stocks",
  "id": "l21gpz",
  "is_self": true,
  "media": null,
  "is_video": false
}