{
  "author": "AloneDay8829",
  "original_created_utc": 1626653373,
  "title": "I think I get it after a few drinks",
  "created_utc": 1626677288,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>Bitcoin is the first digital object that can&#39;t be duplicated or forged</p></li>\n<li><p>The way Bitcoin was created is almost as important as Bitcoin. Anonymous creator, no financial incentive, open-source for anyone to use, had $0 value for a year. It&#39;s like humans discovering gold for the first time</p></li>\n<li><p>Any Bitcoin fork is a waste of time. Imagine if the creator of the universe could create a knock off gold at any time and put it in the ground for us. For value, we seek items that have rare properties. meanwhile Satoshi created the scarcest asset known to mankind.</p></li>\n<li><p>Not even one of the largest countries could cripple Bitcoin. </p></li>\n<li><p>There&#39;s <strong>way</strong> smarter people than me that already understand this and are doing everything they can to accumulate as much as possible via manupulation. And they know there is a small time window to do this.  It feels like just yesterday I bought the dip at $3,000. This thing is going into the millions.</p></li>\n<li><p>People that make fun of or disregard Bitcoin are completely wrong. There is no &quot;opinion&quot; on Bitcoin, it just exists as it was created to be.</p></li>\n<li><p>Imagine being trapped in a reality where Infinite money printing exists and there is no way out. Utterly terrifying. Something like Bitcoin was inevitable.</p></li>\n</ol>\n\n<p>P.S. I&#39;m drunk</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/Bitcoin/comments/on2ptp/i_think_i_get_it_after_a_few_drinks/",
  "subreddit": "Bitcoin",
  "id": "on2ptp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": " 1. Bitcoin is the first digital object that can't be duplicated or forged\n\n 2. The way Bitcoin was created is almost as important as Bitcoin. Anonymous\n    creator, no financial incentive, open-source for anyone to use, had $0 value\n    for a year. It's like humans discovering gold for the first…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1. ビットコインは、複製や偽造ができない最初のデジタルオブジェクトである\n\n 2. ビットコインが作られた方法は、ビットコインとほぼ同じくらい重要である。匿名\n    作成者、金銭的なインセンティブがない、誰でも使えるオープンソース、価値が0ドルだった\n    が1年間続いた。人類が初めて金を発見したようなものです。",
      "title": "お酒を飲んだ後は、それが分かるような気がします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1. 比特币是第一个不能被复制或伪造的数字物品\n\n 2. 比特币的创建方式几乎和比特币一样重要。匿名的\n    创造者，没有经济激励，任何人都可以使用的开放源码，一年内价值为零\n    一年的时间。这就像人类第一次发现黄金...",
      "title": "我想我在喝了几杯之后就会明白的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1. 比特幣是第一個不能被複制或僞造的數字物品\n\n 2. 比特幣的創建方式幾乎和比特幣一樣重要。匿名的\n    創造者，沒有經濟激勵，任何人都可以使用的開放源碼，一年內價值爲零\n    一年的時間。這就像人類第一次發現黃金...",
      "title": "我想我在喝了幾杯之後就會明白的"
    }
  ]
}