{
  "author": "FlightOfTheAlbatross",
  "original_created_utc": 1629136539,
  "title": "What is the level of continuity between the Soviet invasion-era mujahideen and the Taliban of the 1990s?",
  "created_utc": 1629164541,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Congresswoman Rashida Tlaib had <a href=\"https://twitter.com/RepRashida/status/1427028625774284802\">this tweet</a> today, in which she drew a direct line between the mujahideen that the US backed against the Soviets and the Taliban now taking over Afganistan. As counterpoint, someone on Twitter said that the Taliban were founded &quot;five years after the Soviets left Afghanistan&quot; and linked to <a href=\"https://newlinesmag.com/argument/what-the-cia-did-and-didnt-do-in-soviet-occupied-afghanistan/\">this article</a>, in response to what they saw as an exaggeration of how the US&#39; backing for the mujahideen empowered and armed the Taliban.</p>\n\n<p>Is one or the other side closer to reality here? What happened within the anti-PDPA camp during the gap between the Soviet withdrawal and the Taliban coming to power? Which of the active mujahideen groups during the Soviet period actually became Taliban?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/p5lbve/what_is_the_level_of_continuity_between_the/",
  "subreddit": "AskHistorians",
  "id": "p5lbve",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Congresswoman Rashida Tlaib had this tweet\n[https://twitter.com/RepRashida/status/1427028625774284802] today, in which she\ndrew a direct line between the mujahideen that the US backed against the Soviets\nand the Taliban now taking over Afganistan. As counterpoint, someone on Twitter\nsaid that the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Rashida Tlaib議員がこんなツイートをしていました。\n[https://twitter.com/RepRashida/status/1427028625774284802] 今日の彼女のツイートでは\nアメリカがソビエトに対抗して支援したムジャヒディーンと、現在アフガニスタンを支配しているタリバンとを直接結びつけています。\n現在アフガニスタンを支配しているタリバンとの間に直接的な関係があるとしています。反論として、ツイッターで誰かが\nは、「...",
      "title": "ソ連侵攻時代のムジャヒディーンと90年代のタリバンの連続性はどの程度のものなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "国会议员拉希达-特莱布有这样一条推文\n[https://twitter.com/RepRashida/status/1427028625774284802] 今天，她在其中\n她将美国支持的反对苏联的圣战者组织与现在占领阿富汗的塔利班直接联系起来\n和现在占领阿富汗的塔利班之间划清界限。作为反驳，有人在推特上说\n说，...",
      "title": "苏联入侵时期的圣战者和1990年代的塔利班之间的延续性有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "國會議員拉希達-特萊布有這樣一條推文\n[https://twitter.com/RepRashida/status/1427028625774284802] 今天，她在其中\n她將美國支持的反對蘇聯的聖戰者組織與現在佔領阿富汗的塔利班直接聯繫起來\n和現在佔領阿富汗的塔利班之間劃清界限。作爲反駁，有人在推特上說\n說，...",
      "title": "蘇聯入侵時期的聖戰者和1990年代的塔利班之間的延續性有多大？"
    }
  ]
}