{
  "author": "foyerhead",
  "the_new_excerpt": "Still a decently new trader, I’ve been getting into more serious fundamental\nanalysis to determine the stocks I want to hold in my portfolio.\n\nI mainly look at companies from a free cash flow perspective and compare\nEV/EBITA to the industry to look for undervalued stocks.\n\nBut how about growth…",
  "original_created_utc": 1623561024,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まだまだ駆け出しのトレーダーですが、最近はより本格的にファンダメンタルズ分析に取り組んでいます。\n自分のポートフォリオで保有したい銘柄を決定するために、より本格的なファンダメンタル分析に取り組んでいます。\n\n私は主にフリーキャッシュフローの観点から企業を見て、EV/EBITAを業界と比較し、割安な銘柄を探しています。\nEV/EBITAを業界と比較して、割安な銘柄を探しています。\n\nしかし、成長性についてはどうでしょう...。",
      "title": "成長株をどのように分析していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我仍然是一个体面的新交易员，我已经开始更认真地进行基本面分析，以确定我想在投资组合中持有的股票。\n分析，以确定我想在我的投资组合中持有的股票。\n\n我主要从自由现金流的角度看公司，并将EV/EBITA与行业进行比较。\nEV/EBITA与行业进行比较，以寻找被低估的股票。\n\n但是，成长性如何...",
      "title": "你如何分析成长型股票？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我仍然是一個體面的新交易員，我已經開始更認真地進行基本面分析，以確定我想在投資組合中持有的股票。\n分析，以確定我想在我的投資組合中持有的股票。\n\n我主要從自由現金流的角度看公司，並將EV/EBITA與行業進行比較。\nEV/EBITA與行業進行比較，以尋找被低估的股票。\n\n但是，成長性如何...",
      "title": "你如何分析成長型股票？"
    }
  ],
  "title": "How do you analyze growth stocks?",
  "created_utc": 1623585058,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Still a decently new trader, I’ve been getting into more serious fundamental analysis to determine the stocks I want to hold in my portfolio.</p>\n\n<p>I mainly look at companies from a free cash flow perspective and compare EV/EBITA to the industry to look for undervalued stocks.</p>\n\n<p>But how about growth companies? Most of these companies are trading at much higher multiples, a lot of them are not profitable and have negative EBITA. For example, RBLX jumped from 60 to 90 a few weeks ago, while having a EV/Revenue multiple of 36x. How do you even go about figuring out a good entry price for some of these stocks?</p>\n\n<p>I want to know because I’m young and can take on riskier investments into some of these high growth companies, but being the logical person that I am, I at least want some way to mathematical reason a fair point of entry!</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/stocks/comments/nypa4a/how_do_you_analyze_growth_stocks/",
  "subreddit": "stocks",
  "id": "nypa4a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743473
}