{
  "author": "roberthonker",
  "the_new_excerpt": "Not to belittle countries that aren’t developed, but most people would consider\ncountries like El Salvador not very technologically advanced.\n\nThe fact that countries like El Salvador are adopting crypto is amazing, and it\nshows the benefits when younger people are in power, as opposed to the…",
  "original_created_utc": 1623618564,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先進国ではない国を軽視するわけではありませんが、エルサルバドルのような国は、ほとんどの人が技術的にあまり進んでいないと考えるでしょう。\nエルサルバドルのような国は、あまり技術的に進んでいないと考える人が多いでしょう。\n\nエルサルバドルのような国が暗号を採用していることは驚くべきことです。\n若い人たちが権力を握っていることのメリットを示しています。",
      "title": "第三世界の国々での暗号の採用は、我々の政府が恐竜でいっぱいであることを示しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不是要贬低那些不发达的国家，但大多数人认为像萨尔瓦多这样的国家在技术上不是很先进。\n像萨尔瓦多这样的国家在技术上不是很先进。\n\n像萨尔瓦多这样的国家正在采用加密货币的事实是惊人的，它显示了当年轻人掌权时的好处，而不是像现在这样。\n它显示了年轻人掌权时的好处，而不是......",
      "title": "第三世界国家采用加密货币表明，我们的政府充满了恐龙。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是要貶低那些不發達的國家，但大多數人認爲像薩爾瓦多這樣的國家在技術上不是很先進。\n像薩爾瓦多這樣的國家在技術上不是很先進。\n\n像薩爾瓦多這樣的國家正在採用加密貨幣的事實是驚人的，它顯示了當年輕人掌權時的好處，而不是像現在這樣。\n它顯示了年輕人掌權時的好處，而不是......",
      "title": "第三世界國家採用加密貨幣表明，我們的政府充滿了恐龍。"
    }
  ],
  "title": "Crypto adoption in third world countries shows that our governments are full of dinosaurs.",
  "created_utc": 1623636963,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not to belittle countries that aren’t developed, but most people would consider countries like El Salvador not very technologically advanced.</p>\n\n<p>The fact that countries like El Salvador are adopting crypto is amazing, and it shows the benefits when younger people are in power, as opposed to the vast majority of our government officials who are tech illiterate. </p>\n\n<p>Unfortunately many of them have become complacent, and think that our financial systems are perfect.</p>\n\n<p><strong>I tip my hat to you, El Salvador.</strong></p>\n</div><!-- SC_ON -->",
  "score": 1035,
  "permalink": "/r/CryptoCurrency/comments/nz62ef/crypto_adoption_in_third_world_countries_shows/",
  "subreddit": "CryptoCurrency",
  "id": "nz62ef",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738586
}