{
  "author": "aarpeggioo",
  "original_created_utc": 1637956269,
  "title": "Why is the female rap music championed as 'empowering' when it also profits off of hypersexualization of women?",
  "created_utc": 1637966264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There has always been a huge problem of misogyny, which mainly stems from the view that women are nothing more than objects of sexual desire. In such a scenario, the lyrics and music videos of many female rappers, even if done with the purpose of reclaiming their sexuality, seem to embrace this objective view on women. The music videos in this genre are also  made specifically to cater to the male gaze. \nThen why is it that even a mere criticism of such music is met with extreme backlash and categorised as an attack on female empowerment?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/r2vau4/why_is_the_female_rap_music_championed_as/",
  "subreddit": "TooAfraidToAsk",
  "id": "r2vau4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There has always been a huge problem of misogyny, which mainly stems from the\nview that women are nothing more than objects of sexual desire. In such a\nscenario, the lyrics and music videos of many female rappers, even if done with\nthe purpose of reclaiming their sexuality, seem to embrace this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "女性は性欲の対象でしかない」という考え方に起因する女性差別は、常に大きな問題となっています。\n女性は性欲の対象でしかないという考え方からくるものです。このような状況では\nこのような状況では、多くの女性ラッパーの歌詞やミュージック・ビデオは、たとえそれが女性の魅力を表現するためであっても\nこのような状況の中で、多くの女性ラッパーの歌詞やミュージックビデオは、たとえ自分のセクシュアリティを取り戻すためであったとしても、このような考え方を受け入れているように思えます。",
      "title": "なぜ女性のラップミュージックは、女性を過剰に性的に表現することで利益を得ているにもかかわらず、「エンパワーメント」として支持されているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一直以来都存在着巨大的厌女症问题，这主要源于以下观点\n这种观点认为妇女只不过是性欲的对象。在这样一个\n在这种情况下，许多女性说唱歌手的歌词和音乐视频，即使是为了恢复她们的性能力而做的\n在这种情况下，许多女性说唱歌手的歌词和音乐视频，即使是为了找回她们的性能力，似乎也在接受这种观点。",
      "title": "为什么女性说唱音乐被拥护为 \"赋权\"，而它也通过对女性的过度性感而获利？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一直以來都存在着巨大的厭女症問題，這主要源於以下觀點\n這種觀點認爲婦女只不過是性慾的對象。在這樣一個\n在這種情況下，許多女性說唱歌手的歌詞和音樂視頻，即使是爲了恢復她們的性能力而做的\n在這種情況下，許多女性說唱歌手的歌詞和音樂視頻，即使是爲了找回她們的性能力，似乎也在接受這種觀點。",
      "title": "爲什麼女性說唱音樂被擁護爲 \"賦權\"，而它也通過對女性的過度性感而獲利？"
    }
  ]
}