{
  "author": "GladCricket",
  "original_created_utc": 1639267680,
  "title": "Is r/femaledatingstrategy satire?",
  "created_utc": 1639285049,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;No disrespect, at all, just a legit question. Are they being serious with the posts?&lt;/p&gt;\n\n&lt;p&gt;I saw something posted on another sub making fun of the FDS sub and have now been there reading for a bit. I laughed pretty good at the top 2 or 3 posts, then my wife came over to see what I had been giggling at. She LOST it over a couple posts and then asked me if the women here are serious. I don&amp;#39;t know... are they?&lt;/p&gt;\n\n&lt;p&gt;My wife and I both agree that it HAS to be satire. Again, no disrespect to any of the women there who ARE taking it seriously, I wish you the best of luck... I guess.&lt;/p&gt;\n\n&lt;p&gt;Edit/update: I just tried to make a post in the sub, you have to wait for approval so I think &amp;quot;serious&amp;quot; is an understatement. Follow up question though, how is this allowed on reddit? Isn&amp;#39;t it hate speech against a specific group?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/recc96/is_rfemaledatingstrategy_satire/",
  "subreddit": "TooAfraidToAsk",
  "id": "recc96",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "No disrespect, at all, just a legit question. Are they being serious with the\nposts?\n\nI saw something posted on another sub making fun of the FDS sub and have now\nbeen there reading for a bit. I laughed pretty good at the top 2 or 3 posts,\nthen my wife came over to see what I had been giggling at.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "失礼のないよう、きちんとした質問をお願いします。彼らは真面目にやっているのでしょうか？\nの投稿は？\n\n他のサブでFDSのサブをバカにするような投稿を見て、今更ながら\nそこで少し読んでみました。上位2～3件の投稿でかなり笑いました。\nと言っていたら、妻が何を笑っていたのか見に来ました...。",
      "title": "r/femaledatingstrategyは風刺ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没有任何不敬的意思，只是一个合法的问题。他们是在认真对待这些\n帖子？\n\n我在另一个子网站上看到一些取笑FDS子网站的帖子，现在已经\n在那里看了一会儿。我在前两三个帖子里笑得很开心。\n然后我妻子过来看我在笑什么....。",
      "title": "r/femaledatingstrategy是讽刺吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有任何不敬的意思，只是一個合法的問題。他們是在認真對待這些\n帖子？\n\n我在另一個子網站上看到一些取笑FDS子網站的帖子，現在已經\n在那裏看了一會兒。我在前兩三個帖子裏笑得很開心。\n然後我妻子過來看我在笑什麼....。",
      "title": "r/femaledatingstrategy是諷刺嗎？"
    }
  ]
}