{
  "author": "dragondude4",
  "the_new_excerpt": "There’s a huge inflation tsunami heading towards us. The April CPI reading comes\nout tomorrow at 8:30 AM. Good thing official inflation measures exclude food,\nhousing, gas, education and healthcare. We don't need to be able to afford those\nthings.\n\nLet’s look past the bullshit CPI which registered…",
  "original_created_utc": 1620776635,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "巨大なインフレの津波が我々に向かってきている。4月の消費者物価指数の発表は\n明日の午前8時30分に発表される。公式のインフレ指標に食品が含まれていないのは幸いだ。\n食費、住宅費、ガス代、教育費、医療費は含まれていません。私たちはそれらを買えなくてもいいのです。\n買う必要はない。\n\n登録されているデタラメなCPIは過去のものとしよう。",
      "title": "すべてがインフレを叫んでいる、公式数値がBSである理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一个巨大的通胀海啸正在向我们走来。4月份的CPI读数将在明天上午8:30公布。\n明天上午8:30出来。好在官方通胀措施不包括食品。\n住房、天然气、教育和医疗保健。我们不需要能够负担得起这些\n的东西。\n\n让我们看一看那些登记在册的狗屁CPI...",
      "title": "一切都在叫嚣着通货膨胀，以及为什么官方数字是BS。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一個巨大的通脹海嘯正在向我們走來。4月份的CPI讀數將在明天上午8:30公佈。\n明天上午8:30出來。好在官方通脹措施不包括食品。\n住房、天然氣、教育和醫療保健。我們不需要能夠負擔得起這些\n的東西。\n\n讓我們看一看那些登記在冊的狗屁CPI...",
      "title": "一切都在叫囂着通貨膨脹，以及爲什麼官方數字是BS。"
    }
  ],
  "title": "Everything is Screaming Inflation, and why the Official Numbers are BS.",
  "created_utc": 1620829836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There’s a huge inflation tsunami heading towards us. The April CPI reading comes out tomorrow at 8:30 AM. Good thing official inflation measures exclude food, housing, gas, education and healthcare. We don&#39;t need to be able to afford those things.</p>\n\n<p>Let’s look past the bullshit CPI which registered 2.6% for the March reading. The everyday items you and I consume are going up by much larger amounts than the FEDs favorite inflation gauge. Take housing prices for example, which everyone knows are going up at a crazy rate. February year over year increase was 12% nationally and shows no sign of slowing down. But the CPI doesn’t reflect this. The CPI tries to estimate housing inflation using “owner equivalent rent” which is what a homeowner would pay to rent their own house. The cost of the house is ignored in this equation, the focus being on the cost of the shelter it provides instead. That’s great, unless you want to buy a house. </p>\n\n<p>The prices of just about everything that it takes to build that house are going up too. The price of a new lot to build on is up 11% YOY and will likely continue to climb as supply of new lots is down 20% in that same period. The materials that make up the home are up as follows:</p>\n\n<p>Lumber: +67% YTD</p>\n\n<p>Copper: +27% YTD</p>\n\n<p>Gypsum: +7% YOY</p>\n\n<p>Steel Mill Products: +18% YOY</p>\n\n<p>Add in a shortage of construction workers, a national push for higher wages and ultra-low interest rates and housing shows no signs of becoming more affordable anytime soon. Fulfilment costs are going up across the board as well, due to numerous factors. Disruptions in the global shipping markets have led to price increases of 25-50% on shipping containers.</p>\n\n<p>To compound the aforementioned issues, the prices of the commodities and inputs used to produce a broad range of goods are also increasing rapidly. Look at these increases in just the last month alone:</p>\n\n<p>Cocoa: +2.5%</p>\n\n<p>Coffee: +12.7%</p>\n\n<p>Sugar: +13.6%</p>\n\n<p>Lean Hogs: +6.3%</p>\n\n<p>Rough Rice: +3.6%</p>\n\n<p>Oats: +7.4%</p>\n\n<p>Soybeans: +7.7%</p>\n\n<p>Wheat: +18%</p>\n\n<p>Corn: +18.5%</p>\n\n<p>Farmers are now substituting wheat grown for human consumption as animal feed due to the huge increase in the price of corn. This feedstock inflation can trickle thru the butcher block and dairy isle and potentially increase prices of meat, chicken, milk, eggs and cheese, just to name a few. </p>\n\n<p>In the recent earnings calls of several multi-national corporations the topic of pricing and supply chain issues was highlighted. Coke and Pepsi are both going to raise prices, and if you look at the price of sugar, the reason is obvious. P&amp;G and Mondelez both announced intentions to do the same, and Kraft spoke about rising costs across it supply chains. Selling a smaller amount for the same price isn’t gonna cut it this time anymore. Prices are going up. </p>\n\n<p>So, inflation appears to be working its way thru commodities markets and supply chains and will soon be knocking on the door. Could it be that the inevitable hangover from the money printer going BRRRRR is approaching? I have no idea, but the numbers are staggering. Don’t worry though, you likely won’t be affected. Unless you live inside, drive, eat, drink coffee or pop, shop online or have anything to do with those industries, you’ll be just fine!</p>\n\n<p>It’s prime time for ₿itcoin.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/nab64e/everything_is_screaming_inflation_and_why_the/",
  "subreddit": "CryptoCurrency",
  "id": "nab64e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992431
}