{
  "author": "pixelstacker",
  "original_created_utc": 1632852123,
  "title": "Is this the final shakeout before the parabolic move?",
  "created_utc": 1632875475,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Does anyone else feel this could be the final shakeout before the typical end of cycle parabolic move?</p>\n\n<p>I  feel everyone was waiting for September to close with a slow turn to  the upside for the coming months. Which makes me think that whales and  those with a controlling interest, would want to bleed the market a little further. Also, the uncertainty in China and uncertainty with the  Fed tapering is causing a risk off mindset.</p>\n\n<p>What do you think is the main factor?</p>\n\n<p>Obviously, we don&#39;t know shit about fuck.</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/CryptoCurrency/comments/pxc1h2/is_this_the_final_shakeout_before_the_parabolic/",
  "subreddit": "CryptoCurrency",
  "id": "pxc1h2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Does anyone else feel this could be the final shakeout before the typical end of\ncycle parabolic move?\n\nI feel everyone was waiting for September to close with a slow turn to the\nupside for the coming months. Which makes me think that whales and those with a\ncontrolling interest, would want to bleed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "典型的なサイクル終盤のパラボリックな動きの前の最後の揺り戻しではないかと感じている人はいませんか？\nサイクルの終わりの典型的なパラボリックな動きの前の最後のシェイクアウトではないかと感じる人はいますか？\n\n誰もが9月の終わりを待っていたと思います。\nみんな9月の終わりを待っていたようです。そうすると、クジラや支配的な利益を持っている人たちは\nクジラや支配権を持っている人たちは、血を流したいと思っているのでは...。",
      "title": "放物線を描く前の最後の揺り戻しなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还有人觉得这可能是典型的周期结束前的最后一次震荡吗？\n周期的抛物线运动之前的最后一次震荡？\n\n我觉得每个人都在等待9月份的收盘，缓慢转向\n未来几个月的上升趋势。这让我觉得鲸鱼和那些拥有控制权的人\n控股权的人，会想要放血......",
      "title": "这是抛物线运动之前的最后一次震荡吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還有人覺得這可能是典型的週期結束前的最後一次震盪嗎？\n週期的拋物線運動之前的最後一次震盪？\n\n我覺得每個人都在等待9月份的收盤，緩慢轉向\n未來幾個月的上升趨勢。這讓我覺得鯨魚和那些擁有控制權的人\n控股權的人，會想要放血......",
      "title": "這是拋物線運動之前的最後一次震盪嗎？"
    }
  ]
}