{
  "author": "Wiardv",
  "original_created_utc": 1647094653,
  "title": "Lump sum investing outperforms DCA 81% of the time",
  "created_utc": 1647110772,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;People always say: &amp;quot;DCA is the best strategy, because what if you buy the top?&amp;quot; as if the market is making a top every day. And they say other stuff like: &amp;quot;Time in the market beats timing the market.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Well, if that is true, you still want to lump sum,  so that you have as much time as possible in the market. On average, for Bitcoin, you want to buy as early as possible. And with DCA you don&amp;#39;t buy as early as possible.&lt;/p&gt;\n\n&lt;p&gt;Then you have to consider, if DCA were such an amazing strategy, then everyone on Reddit should be really rich by now. &lt;strong&gt;But DCA&amp;#39;ing during the bull market only makes your average cost higher.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;But don&amp;#39;t take it up with me, take it up with the data:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/q468okd5oym81.png?width=1229&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0f5938fae7696a27eb0220776090031d6d84299b\"&gt;DCA underperforms lump sum 81&amp;#37; of the time.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I expect that everyone will disagree with this post, because all Reddit can say is &amp;quot;DCA and hold&amp;quot;, but that&amp;#39;s whatever. If it works for you, it&amp;#39;s fine.&lt;/p&gt;\n\n&lt;p&gt;Just know that you underperform everyone who just invests as much as possible as early as possible.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 442,
  "permalink": "/r/CryptoCurrency/comments/tchayt/lump_sum_investing_outperforms_dca_81_of_the_time/",
  "subreddit": "CryptoCurrency",
  "id": "tchayt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "People always say: \"DCA is the best strategy, because what if you buy the top?\"\nas if the market is making a top every day. And they say other stuff like: \"Time\nin the market beats timing the market.\"\n\nWell, if that is true, you still want to lump sum, so that you have as much time\nas possible in…"
}