{
  "author": "MrDionWaiters",
  "the_new_excerpt": "TLDR (posting at the top since this is a long post and I am occasionally a nice\nguy): FNKO sees the future of the collectibles market and is preparing for it.\nThe company will see much better margins and likely a higher multiple as they\nbecome more tech-driven, which should make the stock go up to…",
  "original_created_utc": 1616683320,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR（在顶部发帖，因为这是一个长帖，我偶尔是一个很好的。\n的家伙）。) FNKO看到了收藏品市场的未来，并正在为此做准备。\n该公司将看到更好的利润率，并可能获得更高的倍数，因为他们的\n成为更多的技术驱动，这应该使股价上升到... ...",
      "title": "$FNKO--他们未来的利润率和收入扩展"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR（在頂部發帖，因爲這是一個長帖，我偶爾是一個很好的。\n的傢伙）。) FNKO看到了收藏品市場的未來，並正在爲此做準備。\n該公司將看到更好的利潤率，並可能獲得更高的倍數，因爲他們的\n成爲更多的技術驅動，這應該使股價上升到... ...",
      "title": "$FNKO--他們未來的利潤率和收入擴展"
    }
  ],
  "title": "$FNKO – Their Future of Margin and Revenue Expansion",
  "created_utc": 1616694588,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR</strong> (posting at the top since this is a long post and I am occasionally a nice guy): FNKO sees the future of the collectibles market and is preparing for it. The company will see much better margins and likely a higher multiple as they become more tech-driven, which should make the stock go up to reflect their pivot. I believe the margin of safety is solid while the potential upside is very high, thus giving this an excellent risk/reward profile.</p>\n\n<p>If you have ventured into your local GME store or visited their website then you are likely aware of or even potentially a fan of Funko’s products. FNKO obtains licenses from well-known franchises including movies, sports teams, comics and more in order to make their very recognizable and unique collectibles as well as apparel, games, and accessories.</p>\n\n<p>Before talking about the future, let us look at the present. Their last quarter was fantastic, here are some of what I consider are the key things to be aware of:</p>\n\n<ul>\n<li>Net sales increased 6% to $226.5 million</li>\n<li>Gross margin increased to 37.2%</li>\n<li>Cash flow from operations increased 69% to $46.9 million</li>\n<li>Net sales of non-figure products grew 30% compared to 2019, primarily driven by strength within its Loungefly branded products which increased 51% in the quarter</li>\n<li>Funko&#39;s direct-to-consumer sales nearly doubled compared to prior year driven by continued strong demand on its e-commerce sites</li>\n<li>68% of sales were attributable to evergreen content</li>\n</ul>\n\n<p><strong>Here is my interpretation of the points above:</strong> Sales are up and direct-to-consumer is a growing share of their sales as well as ‘evergreen’ content which essentially represents their products that are not tied to fleeting events. Additionally, they are growing revenues in product areas outside of the collectible figurines that they are known best for. The business as it exists today is healthy, which gives us a positive outlook for the future as it is as well as a good margin of safety for the stock price because of this since it appears to have a trajectory towards continued success and stockholder returns.</p>\n\n<p><strong>But we are here for the big wins, now aren’t we? Let me pose a few questions:</strong></p>\n\n<p><em>If you wanted to take a healthy company with a loyal fanbase and have it earn more money without straying from what makes the company successful in the first place, what would you do?</em></p>\n\n<p>I would say that you would try to delight your customer base with new options to choose from to keep them happy and boost revenues while also doing what you can to not let those new options turn inventory management into a nightmare.</p>\n\n<p><em>If you had a company that made its money from physical products, what would you do?</em></p>\n\n<p>The way to make more money from physical products is to increase margins by cutting manufacturing and/or selling costs or by increasing prices.</p>\n\n<p><em>Who are FNKO’s primary customer types and what are some key characteristics of those customers?</em></p>\n\n<p>FNKO has a mix of customer types from people who like specific products that relate to a specific license to collectors who build complete collections of products to either keep or sell for a higher price. For either type of customer, I’d say FNKO is quite able to encourage multiple purchases over time (seriously, I haven’t seen an owner of a FNKO product only own one FNKO product) but the collectors are who I want to focus on for this post. Collectors want to build and complete collections, so if they are passionate about doing so with FNKO products, it would behoove FNKO to provide new ways of doing so in a way that makes it easier to verify and trade those collections if desired.</p>\n\n<p><em>Bro, what the fuck. Are you ever going to get to the fucking point?</em></p>\n\n<p>Now that I have shared the key things that I think is important to the environment FNKO is in today, I can now share what I believe will make FNKO rapidly grow their earnings: <strong>NFTs</strong></p>\n\n<p><em>The fuck is a NFT?</em></p>\n\n<p>I think of NFTs as digital collectibles with built-in verification systems. These verification systems are essentially digital receipts that use blockchain technology to make forgeries more difficult and reduces the time it takes to check the legitimacy of a collectible when exchanges are desired. These are built into the collectibles themselves. For collectors, this is big. NFTs are still not very mainstream but amongst the collector community, I think these will be the future and will become extremely relevant. I personally do not collect things myself but it doesn’t take more than a couple brain cells to realize that collectors would want it to be as easy as possible to know that what they are buying is legit and as easy as possible to show people that what they are selling is legit. NFTs enable this to be done much more easily and quickly, leading to less fraud and a less painful experience for those who are into building/trading collections.</p>\n\n<p><em>How would NFTs help FNKO?</em></p>\n\n<p>As briefly discussed above I would say that if you want to improve upon an already-successful business, you would want to keep your customers happy while expanding margins and opening new revenue possibilities.</p>\n\n<p>If FNKO begins to tie NFTs to limited-run physical items or sells limited numbers of the NFTs themselves, they could create a win-win for both themselves and the segment of their customer base that likes to collect, while also pulling in new customers who see a well-known company with well-known licenses creating content to collect and trade. With NFTs, FNKO can delight customers with new ways to collect while also streamlining the experience and solving some of the issues that make collecting difficult (verifying goods and trading them).</p>\n\n<p>For FNKO, items tied to NFTs can be sold for more money which increases their margins since digital goods do not cost as much to build and scale (that is why tech companies trade at high P/S and P/E multiples). Because items are digital, it becomes easier for FNKO to react to trends in what customers want and can create limited release items and sell the NFTs right away and build/ship the physical items at a later date. Hell, they could also become a middleman between collectors and hold the physical items on behalf of whoever owns the NFTs and deliver at the request of the NFT owner (while picking up storage fees along the way for saving the NFT owners the trouble of holding/shipping the physical product while they wait to trade the NFT to a buyer. I do not know exactly how FNKO will implement NFTs into their business but you can see that some massive potential for fantastic customer/business win-win scenarios exists.</p>\n\n<p><strong>Conclusion:</strong> Because FNKO has a healthy business today, I believe that it has an excellent risk/reward profile because even if they totally botched the NFT rollout their existing business will be fine. I think NFTs provide a very enticing opportunity for the business to keep current customers happy, bring in new collector-customers, and increase margins while increasing revenues which would logically make the stock price go up due to both better earnings per share and a more tech-related multiple on those earnings.</p>\n\n<p><em>Is FNKO even planning on using NFTs?</em></p>\n\n<p>You’re damn right they are: <a href=\"https://finance.yahoo.com/video/funko-ceo-ability-disrupt-nft-151936943.html\">https://finance.yahoo.com/video/funko-ceo-ability-disrupt-nft-151936943.html</a></p>\n\n<p><em>Are there other NFT-related stocks?</em></p>\n\n<p>Yes, but most of them are just penny-stock garbage and none of them to date have a combination of track record plus logical business sense anywhere close to FNKO.</p>\n\n<p><strong>Disclosures:</strong> I am not a financial advisor, I’m just an everyday idiot like everyone else here. The only difference is that I drink so much coffee that I occasionally become a functioning human. I am long shares, 4/16 20c and 25c as well as some 11/19 20c. I personally consider $50 my minimum target (both because I firmly believe it plus it is a lucky number for me since I had the same minimum PT for GME back when it was below $20). I have no idea what the ceiling is, but I just know that NFTs have way too much synergy with the existing business for me to ignore. I like this stock, my opinions are my own and I should probably be ignored because I ran out of coffee halfway through writing this.</p>\n\n<p>Good luck to all, please have some semblance of logic with your plays if you decide to pick up some FNKO positions.</p>\n</div><!-- SC_ON -->",
  "score": 81,
  "permalink": "/r/stocks/comments/mczt4d/fnko_their_future_of_margin_and_revenue_expansion/",
  "subreddit": "stocks",
  "id": "mczt4d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141509
}