{
  "author": "moneytobemade8",
  "the_new_excerpt": "If you see any news headline from Yahoo Finance or GlobalNewswire about a stock,\nthe current stock price has most likely taken that information into account.\nThat being said, it is not necessarily efficient to buy on the news of the\nstock. This is why big firms pay 20k on Bloomberg Terminals. They…",
  "original_created_utc": 1618867583,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヤフーファイナンスやグローバルニュースワイヤーなどで、ある銘柄に関するニュースの見出しを目にしたら、その情報が現在の株価に反映されている可能性があります。\n現在の株価はその情報を考慮したものである可能性が高い。\nとはいえ、その銘柄のニュースを見て買うのは必ずしも効率的ではありません。\n株のニュースで買うのは必ずしも効率的ではありません。大企業がブルームバーグ・ターミナルに2万円も払うのはそのためです。彼らは...",
      "title": "企業の \"新しい \"ニュースは、おそらく株価に反映されています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你从雅虎财经或环球网看到任何关于股票的新闻标题。\n目前的股价很可能已经考虑到了这些信息。\n也就是说，根据消息买入并不一定有效。\n股票。这就是为什么大公司要在彭博终端支付2万的原因。他们...",
      "title": "如果你看到一家公司的 \"新 \"消息，股价可能已经反映出来了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你從雅虎財經或環球網看到任何關於股票的新聞標題。\n目前的股價很可能已經考慮到了這些信息。\n也就是說，根據消息買入並不一定有效。\n股票。這就是爲什麼大公司要在彭博終端支付2萬的原因。他們...",
      "title": "如果你看到一家公司的 \"新 \"消息，股價可能已經反映出來了。"
    }
  ],
  "title": "If You See \"new\" News From a Company, The Stock Price Probably Already Reflects It",
  "created_utc": 1618876650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you see any news headline from Yahoo Finance or GlobalNewswire about a stock, the current stock price has most likely taken that information into account. That being said, it is not necessarily efficient to buy on the news of the stock. This is why big firms pay 20k on Bloomberg Terminals. They get the info first before anyone else!</p>\n\n<p>Don&#39;t FOMO when you see exciting news <strong>to make a quick gain</strong>. However, if you are investing in the long term and the new news updates your analysis of the company and makes it a better company and you think it is undervalued, then investing in the company isn&#39;t FOMO.</p>\n</div><!-- SC_ON -->",
  "score": 571,
  "permalink": "/r/stocks/comments/muazwb/if_you_see_new_news_from_a_company_the_stock/",
  "subreddit": "stocks",
  "id": "muazwb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527436
}