{
  "author": "Cueshark29",
  "original_created_utc": 1631834465,
  "title": "As a VeChain holder it was so great when my evening was interupted by my phone notifying me that Shiba Inu has been listed on Coinbase.",
  "created_utc": 1631849634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was just going about my life without a care in the world.  Enjoying my evening just like any other VET holder would.  In fact, I was actually doing some research into VeChain and why it&#39;s so great.  See, the problem with VeChain is there&#39;s so many new developments it&#39;s hard to keep track of them all.  </p>\n\n<p>Oh, you helped track ocean waste?  Brilliant. </p>\n\n<p>Shrimps?  Why the hell not? </p>\n\n<p>Tracking parcels with major courier companies?  Cheeky.</p>\n\n<p>Authenticating vape products.  VeChain is doing it. </p>\n\n<p>Car manufacturers, transport and logistics, telecommunications, vape companies.  It doesn&#39;t matter what industry.  Vechain has got partnerships coming out of its arse.</p>\n\n<p>So then my phone beeped.  That&#39;s weird I thought.  I wonder what that could be.</p>\n\n<p>It&#39;s probably some news about Vechain.  Yeah it simply has to be about VET.</p>\n\n<p>I mean, it&#39;s Thursday.  It really has to be??!!</p>\n\n<p>&quot;Shibu Inu (SHIB) is now on Coinbase.  You can trade, send, receive, or store Shiba Inu (SHIB) today on Coinbase.&quot;</p>\n\n<p>Sometimes crypto defies logic and reason and you just gotta love it for what it is.</p>\n\n<p>Although I am honestly surprised that Shib is listed before VET.</p>\n\n<p>I really think all those partnerships will mean so much in the long run.  When the market isn&#39;t so dictated by hype, utility will prevail and VeChain has that covered.</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/CryptoCurrency/comments/ppohwh/as_a_vechain_holder_it_was_so_great_when_my/",
  "subreddit": "CryptoCurrency",
  "id": "ppohwh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was just going about my life without a care in the world. Enjoying my evening\njust like any other VET holder would. In fact, I was actually doing some\nresearch into VeChain and why it's so great. See, the problem with VeChain is\nthere's so many new developments it's hard to keep track of them…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は何の気なしに生活をしていました。他のVETホルダーと同じように、自分の夜を楽しみ\n他のVETホルダーと同じように。実際、私はVeChainのことを調べていました。\nVeChainについて調べていました。ほら、VeChainの問題点は\nあまりにも多くの新しい開発がなされていて、それらを追跡するのが難しいことです...",
      "title": "VeChainホルダーとしては、携帯電話が「Shiba Inu」がCoinbaseに上場したことを知らせてくれた時は、とても嬉しかったです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是在无忧无虑地进行我的生活。享受着我的夜晚\n就像任何其他职业教育培训机构的人一样。事实上，我实际上是在做一些\n研究VeChain以及它为什么这么棒。看，VeChain的问题是\n有这么多新的发展，很难跟踪它们......",
      "title": "作为VeChain的持有者，当我的手机通知我Shiba Inu已经在Coinbase上市时，我的夜晚被打断了，真是太好了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是在無憂無慮地進行我的生活。享受着我的夜晚\n就像任何其他職業教育培訓機構的人一樣。事實上，我實際上是在做一些\n研究VeChain以及它爲什麼這麼棒。看，VeChain的問題是\n有這麼多新的發展，很難跟蹤它們......",
      "title": "作爲VeChain的持有者，當我的手機通知我Shiba Inu已經在Coinbase上市時，我的夜晚被打斷了，真是太好了。"
    }
  ]
}