{
  "author": "nycbay",
  "the_new_excerpt": "OP for this post is https://www.reddit.com/user/infinitelimits00/ and he posted\nthis on r/options [/r/options]\n\nLet’s talk about the reverse gamma squeeze (should also really be known as a\ncharm-gamma squeeze)...plus this is an r/options [/r/options] sub anyways so\nmight as well introduce charm.\n\nSo…",
  "original_created_utc": 1611536324,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个帖子的上级是https://www.reddit.com/user/infinitelimits00/，他发布了\n这在r/options[/r/options]上。\n\n让我们来谈谈反向伽马压榨（其实也应该叫作\ncharm-gamma squeeze）......再加上这是一个r/options [/r/options]子，无论如何，所以。\n还不如介绍一下魅力。\n\n所以...",
      "title": "由于每个人似乎都是伽马压榨的专家... ..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個帖子的上級是https://www.reddit.com/user/infinitelimits00/，他發佈了\n這在r/options[/r/options]上。\n\n讓我們來談談反向伽馬壓榨（其實也應該叫作\ncharm-gamma squeeze）......再加上這是一個r/options [/r/options]子，無論如何，所以。\n還不如介紹一下魅力。\n\n所以...",
      "title": "由於每個人似乎都是伽馬壓榨的專家... ..."
    }
  ],
  "title": "Since everyone seems to be an expert on gamma squeezes...",
  "created_utc": 1611569404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OP for this post is <a href=\"https://www.reddit.com/user/infinitelimits00/\">https://www.reddit.com/user/infinitelimits00/</a> and he posted this on <a href=\"/r/options\">r/options</a></p>\n\n<p>Let’s talk about the reverse gamma squeeze (should also really be known as a charm-gamma squeeze)...plus this is an <a href=\"/r/options\">r/options</a> sub anyways so might as well introduce charm.</p>\n\n<p>So I see a lot of people think they know what a gamma squeeze is lately from GME. And yea what most people are saying is correct, but what they don’t understand is gamma works in two directions. The defining feature of any stock that has undergone a “true” gamma + short combo squeeze is that when it drops, it NEVER makes a V-shape recovery. See KODK, QS, HTZ, NKLA, TLRY from years ago, even BYND from years ago. I mostly like to go long stocks since stocks usually go up anyways, but I do like calling tops of stocks for fun (see my post history - I got QS exactly right and HTZ by 1 day, also got ZM and SNOW perfectly right in my comments history). I’m not calling the top for GME, but I just want to introduce the concept of what happens when a gamma squeeze fails, since the reverse is nasty.</p>\n\n<p>So the gamma squeeze idea that most people have is say the next week the 100 GME call is like 20 delta (just estimating to make it easier). If some random person bought a 20 delta call from a MM, the MM will buy 20 shares to stay delta neutral and this happens over and over again over the course of the day, and the idea is this will cause the stock to skyrocket if enough people buy these calls. However, here’s the part that’s important. If some news came out or if just GME never moves much, those calls decay in delta, called charm. So those 20 delta calls -&gt; 0 delta and the MM has to then SELL back those 20 shares, suppressing the stock. The delta of options change with time too, not only with underlying price.</p>\n\n<p>That is one problem people never mention when they think gamma squeezes or an infinite cycle. But the other real issue is MM are already short ITM calls which they have like close to +100 shares hedged agains those short nearly 100 delta calls per option. If the stock ever dropped through these long call strikes, those calls go from nearly 100 delta at one point to &lt; 50 delta, which means MM need to sell 50+ shares/options to keep delta neutral. They would keep selling more and more if it continues to drop and stays below those previously long strikes. That’s often times why the downside puts are so expensive on these names because MM also can’t blindly sell those, known a reverse gamma squeeze would cause these stocks to potentially go down 20% in a day.</p>\n\n<p>Anyhow, I wanted to explain the reverse gamma squeeze since gamma is bidirectional. This is why when stocks that undergo this gamma + short squeeze rise and then suddenly drop, they NEVER recover. How many zig-zag recoveries have you seen in these stocks? That’s actually the defining feature of a stock that has undergone a gamma squeeze. It’s when it reverse gamma squeezes, it’s over. Good luck with your GME plays. Like I said, I like calling tops just for fun since it’s more interesting anyways. I’ve done it with a bunch of names in the past. I don’t really have a feel for GME, but the only thing I know is if it ever has a big down day, it’s most likely over and you’ll actually rather sell that day then baghold or buy the dip (which goes against the conventional thinking, but is actually the defining characteristic for true gamma squeeze stocks).</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/investing/comments/l4c6si/since_everyone_seems_to_be_an_expert_on_gamma/",
  "subreddit": "investing",
  "id": "l4c6si",
  "is_self": true,
  "media": null,
  "is_video": false
}