{
  "author": "emergent_convergence",
  "the_new_excerpt": "I was looking at various analytics on my website and blog, essentially all the\nspying that my CMS provides me. Low viewership, low retention, poor sales\nfunnel, few subscribers and so on.\n\nMy website kind of started as a passion project for me. It was a way to express\nmy freedom and took the biggest…",
  "original_created_utc": 1614013297,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在看我的网站和博客上的各种分析，基本上都是以\n我的CMS提供给我的监视。低浏览量、低留存率、低销售量。\n漏斗，订阅者少等等。\n\n我的网站有点开始作为我的激情项目。它是一种方式来表达\n我的自由，并采取了最大的...",
      "title": "为什么我们会有这么强的动力去普及？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在看我的網站和博客上的各種分析，基本上都是以\n我的CMS提供給我的監視。低瀏覽量、低留存率、低銷售量。\n漏斗，訂閱者少等等。\n\n我的網站有點開始作爲我的激情項目。它是一種方式來表達\n我的自由，並採取了最大的...",
      "title": "爲什麼我們會有這麼強的動力去普及？"
    }
  ],
  "title": "Why do we have such a strong drive to become popular?",
  "created_utc": 1614048593,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was looking at various analytics on my website and blog, essentially all the spying that my CMS provides me. Low viewership, low retention, poor sales funnel, few subscribers and so on. </p>\n\n<p>My website kind of started as a passion project for me. It was a way to express my freedom and took the biggest risk of actually putting my real name on it. There&#39;s was something liberating about showing the world what was inside my head.</p>\n\n<p>Every once in a while, I write a blog post that in my mind secretly thinking it will go viral and increase my viewership dramatically but it gets ignored like everything else.</p>\n\n<p>Within myself, my own gut, I don&#39;t care if I become famous or not. My blog is my sandbox and whatever I&#39;m doing there is out my love for the content on it.</p>\n\n<p>However, I always find myself with an incredibly strong drive to become popular. I want thousands of people to read my articles and make a ton of money from selling my products. Where does it come from?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/lptk7r/why_do_we_have_such_a_strong_drive_to_become/",
  "subreddit": "TrueAskReddit",
  "id": "lptk7r",
  "is_self": true,
  "media": null,
  "is_video": false
}