{
  "author": "sggts04",
  "the_new_excerpt": "You receive ads to earn BAT in Brave Rewards ONLY on the latest most updated\nversion of Brave browser.\n\nSometimes when a new update comes through, many people do not get the update\nbutton on the triple dash menu for 1-2 days, and during that time you stop\nreceiving ads from Brave Rewards, which is a…",
  "original_created_utc": 1618669177,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブレイブリワードでBATを獲得するための広告は、最新版のブレイブブラウザでのみ受け取ることができます。\nブレイブブラウザの最新バージョンに限ります。\n\n時々、新しいアップデートが行われると、多くの人が1～2日の間、トリプルダッシュメニューのアップデートボタンが表示されないことがあります。\n1～2日の間、トリプルダッシュメニューのアップデートボタンが表示されないことがあり、その間は\nその間、ブレイブリワードからの広告が表示されなくなります。",
      "title": "PSA: BraveでBATを獲得するための広告が突然表示されなくなった場合、最新のバージョンに更新されているか確認してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "您收到的广告，以赚取BAT在勇敢的奖励ONLY上最新的更新\n版本的Brave浏览器。\n\n有时，当新的更新通过时，很多人没有得到更新\n按钮上的三折线菜单1-2天，在此期间，你停止了\n接收广告从勇敢奖励，这是一个... ...",
      "title": "PSA: 如果你在Brave上突然停止接收广告赚取BAT，请确保你已经更新到了最新的版本"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "您收到的廣告，以賺取BAT在勇敢的獎勵ONLY上最新的更新\n版本的Brave瀏覽器。\n\n有時，當新的更新通過時，很多人沒有得到更新\n按鈕上的三折線菜單1-2天，在此期間，你停止了\n接收廣告從勇敢獎勵，這是一個... ...",
      "title": "PSA: 如果你在Brave上突然停止接收廣告賺取BAT，請確保你已經更新到了最新的版本"
    }
  ],
  "title": "PSA: If you suddenly stop recieving ads to earn BAT on Brave, make sure you are updated to the latest version",
  "created_utc": 1618702476,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You receive ads to earn BAT in Brave Rewards ONLY on the latest most updated version of Brave browser.</p>\n\n<p>Sometimes when a new update comes through, many people do not get the update button on the triple dash menu for 1-2 days, and during that time you stop receiving ads from Brave Rewards, which is a common reported issue by many people here. However you can always just go to <code>brave://settings/help</code> and manually update it if there&#39;s an update available.</p>\n\n<p>So if you suddenly stop getting ads for a day, go to the settings and make sure you update to the latest version!</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/msrl5k/psa_if_you_suddenly_stop_recieving_ads_to_earn/",
  "subreddit": "CryptoCurrency",
  "id": "msrl5k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519543
}