{
  "author": "DelphiCapital",
  "the_new_excerpt": "Note: this post has been expanded from the 5 companies in the title to 11\ncompanies also including Snowflake, Airbnb, Qualtrics, Affirm, Deliveroo and\nOpendoor.\n\n11 of the biggest COVID tech IPOs in 7 different categories (cloud, crypto, gig\neconomy, app economy, e-commerce, fintech, and real…",
  "original_created_utc": 1620956413,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スノーフレーク、エアビーアンドビー、オープンドアなど、6つのカテゴリーで最大のCOVIDテクノロジーIPOの8つを紹介します。\nクラウド、暗号、ギグ・エコノミー、アプリ・エコノミー、eコマース、不動産の6つのカテゴリーで\n不動産）で、すべてステラパブリックオファリングに続いて墜落しました。価格は四捨五入して\n価格は小数点以下を四捨五入。\n\n * SNOWは、430ドルのATHから下...",
      "title": "テック業界の試練：2020-21年のIPO Coinbase、DoorDash、Bumble、Wish、Coupangが今週、史上最低の株価を記録"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "8个最大的COVID科技IPO，包括Snowflake、Airbnb和Opendoor，共6个\n包括Snowflake、Airbnb和Opendoor在内的8个最大的COVID科技IPO，涉及6个不同的类别（云计算、加密货币、演出经济、应用经济、电子商务和房地产）。\n房地产），都是在明星级的公开募股之后崩溃的。价格四舍五入到\n最接近的数字。\n\n * SNOW从其430美元的ATH中下跌。",
      "title": "科技界的清算：2020-21年IPO Coinbase、DoorDash、Bumble、Wish和Coupang本周创下历史最低股价"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "8個最大的COVID科技IPO，包括Snowflake、Airbnb和Opendoor，共6個\n包括Snowflake、Airbnb和Opendoor在內的8個最大的COVID科技IPO，涉及6個不同的類別（雲計算、加密貨幣、演出經濟、應用經濟、電子商務和房地產）。\n房地產），都是在明星級的公開募股之後崩潰的。價格四捨五入到\n最接近的數字。\n\n * SNOW從其430美元的ATH中下跌。",
      "title": "科技界的清算：2020-21年IPO Coinbase、DoorDash、Bumble、Wish和Coupang本週創下歷史最低股價"
    }
  ],
  "title": "A reckoning for tech: 2020-21 IPOs Coinbase, DoorDash, Bumble, Wish, and Coupang record all-time low stock prices this week",
  "created_utc": 1620961951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Note: this post has been expanded from the 5 companies in the title to 11 companies also including Snowflake, Airbnb, Qualtrics, Affirm, Deliveroo and Opendoor.</p>\n\n<p>11 of the biggest COVID tech IPOs in 7 different categories (cloud, crypto, gig economy, app economy, e-commerce, fintech, and real estate), all crashed following stellar public offerings. Prices rounded to the nearest digit.</p>\n\n<ul>\n<li>SNOW went down from $430 ATH in Dec to 314 in Feb to 232 on Apr 30 and 185 today.</li>\n<li>COIN sunk from ATH of 429 to 250 after narrowly missing earnings expectations today. At one point on the day of its IPO, retail traders were lapping up COIN for as much as $<strong>429</strong>. I will note though that BTC crashed yday for those unaware. As if ARKK bagholders weren&#39;t hurting enough!</li>\n<li>DASH crashed from ATH of $256 in late Feb to $110 yday before reporting a bigger-than-expected loss today. They&#39;re up 8% in after-hours.</li>\n<li>BMBL halved from $85 ATH to $39 after beating expectations yday.</li>\n<li>WISH crashed from ATH of 33 to 8 after earnings yday.</li>\n<li>CPNG is down from ATH of 69 to 31 after reporting a higher than expected adjusted loss yday.</li>\n<li>Qualtrics (XM) crashed from ATH of $57 to 29 today.</li>\n<li>SPAC merger OPEN crashed from $39 in Feb to its all-time low of 11 today after Tuesday earnings.</li>\n<li>ABNB crashed from $220 on Apr 28 to $133 after-hours today, down from its ATH of $217 on Feb 11 and up from its ATL of $125. The company announced today that their net loss tripled.</li>\n<li>AFRM is down from ATH of $147 in Feb to 47 today.</li>\n<li>Deliveroo (LON: ROO) crashed from ATH of $390 on IPO day to 228 on Apr 26 and trades at 238 today.</li>\n</ul>\n\n<p>The one newly public tech company that seems to have weathered the storm is Roblox, which reported great earnings on Monday.</p>\n\n<p>But it&#39;s not just tech companies that IPOd in 2020-2021. 2019 IPOs Lyft, Uber, Pinterest, and Snap - which - except for Lyft, all reached their ATHs during COVID - saw significant gains during the pandemic, have also crashed since the end of April.</p>\n\n<ul>\n<li>LYFT tanked from $63 on Apr 28 to 46 today. Previously, Lyft dipped below $23 (ATH is close to $80) three times during COVID, most recently in Oct.</li>\n<li>In the same time period, UBER crashed from $58 to $44.</li>\n<li>PINS is down from 78 to 55 since Apr 27.</li>\n<li>SNAP dipped below $50 from 70 from Feb 23 to Mar 29 and is trading at 50 again today.</li>\n</ul>\n\n<p>These companies aren&#39;t just sliding in after-hours or on the day after reporting earnings, we&#39;re looking at a prolonged downward trend over weeks either preceding or following earnings.</p>\n</div><!-- SC_ON -->",
  "score": 1313,
  "permalink": "/r/investing/comments/nbxa4m/a_reckoning_for_tech_202021_ipos_coinbase/",
  "subreddit": "investing",
  "id": "nbxa4m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802236
}