{
  "author": "EffectiveWar",
  "the_new_excerpt": "All you people saying things like 'the squeeze happened, you missed it', 'don't\ngamble on stocks', 'the bagholders were the greedy ones', 'people with no\nexperience trading shouldn't have bought gme', 'GME was a stupid play from the\nbeginning', 'I was wrong to buy GME', 'I should have sold GME'. Are…",
  "original_created_utc": 1612771331,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你们这些人都在说'挤压发生了，你错过了'、'不要'等话。\n赌股票'、'袋主是贪婪的人'、'没有的人'。\n有交易经验的人不应该买入GME\"，\"GME是一个愚蠢的游戏，从。\n开始\"，\"我买GME是错误的\"，\"我应该卖掉GME\"。是...",
      "title": "提醒大家注意GME实际发生的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們這些人都在說'擠壓發生了，你錯過了'、'不要'等話。\n賭股票'、'袋主是貪婪的人'、'沒有的人'。\n有交易經驗的人不應該買入GME\"，\"GME是一個愚蠢的遊戲，從。\n開始\"，\"我買GME是錯誤的\"，\"我應該賣掉GME\"。是...",
      "title": "提醒大家注意GME實際發生的事情。"
    }
  ],
  "title": "Reminder of what ACTUALLY happened with GME.",
  "created_utc": 1612783352,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All you people saying things like &#39;the squeeze happened, you missed it&#39;, &#39;don&#39;t gamble on stocks&#39;, &#39;the bagholders were the greedy ones&#39;, &#39;people with no experience trading shouldn&#39;t have bought gme&#39;, &#39;GME was a stupid play from the beginning&#39;, &#39;I was wrong to buy GME&#39;, &#39;I should have sold GME&#39;. Are all talking complete fucking bullshit and are twisting the truth and recollection of what actually happened, in reality, for actual fact. I don&#39;t know if they are bots, people who missed out or bitter bag holders but they are just fucking dead wrong about what the GME play was attempting and came within a few hours of accomplishing. </p>\n\n<p>GME went from $40 to a peak of $483 within a WEEK. The biggest shorter got bailed out for $2.75BN because of how bad their position was. WSB was getting national fucking coverage. This sub went from 2 million to 8 million subscribers. There were 60 million shares shorted going into thursday and at its all time high, would of cost a staggering £29BN dollars to buy back less whatever they were shorted at and that is not even counting the price going up by doing so. </p>\n\n<p>So no the squeeze didn&#39;t fucking happen, no you weren&#39;t wrong for buying in at 200 or 300 or even 400. The play worked and it got within hours of paying out. </p>\n\n<p>I know this because the brokers got margin called by the clearing houses for fuck sake. Now RH and other brokers might say it was liquidity issues but I can tell you for a fact that all those shorters got their shares from somewhere and if you think a few million people buying shares with CASH deposits in any way compares to the ALMOST CERTAIN losses that the brokers were facing due to likely defaults by shorters was the reason they turned off buying, you are dead fucking wrong. </p>\n\n<p>The brokers got margin called any way you look at it and they should have margin called the shorters. But they didn&#39;t. They pussied out and did something criminal. They affected one side of a trade and not the other, that is an unprecedented manipulation if ever I have seen one. But I ain&#39;t suprised by it and neither should anyone else and that is not the point of this post anyway.</p>\n\n<p>Stop saying it didn&#39;t work, it was never going to work, we got greedy, we got stupid and all the other hind sight self delusions to make yourself feel better. The play worked because it went by the rules these people had set and you can&#39;t blame yourself or anyone else or redicule people for getting involved, when those rules get changed at the last second. The GME play was solid and made history, never forget that you fucking pussies.</p>\n\n<p>Edit: I sold at 420.69 the other week and put it all back in on friday just gone, make of that whatever you want</p>\n</div><!-- SC_ON -->",
  "score": 33801,
  "permalink": "/r/wallstreetbets/comments/lf75c4/reminder_of_what_actually_happened_with_gme/",
  "subreddit": "wallstreetbets",
  "id": "lf75c4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123217880
}