{
  "author": "vwayoor",
  "original_created_utc": 1639265671,
  "title": "Why do older accounts of epidemics often talk about stench?",
  "created_utc": 1639313559,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In some accounts of certain epidemics, the usual symptoms are mentioned : fever, chills, coughing and so on (but nothing about sores or pustules). But these accounts often talk about a stench associated with the disease : a fetid sweating, or just a general foul smell about the sick person. We have Covid and flus today but stench is not associated with those diseases unless personal hygiene is a question. The epidemics I am referring to did not involve symptoms that often involve stench, such as open sores or pustules. So what accounts for this stench that accounts from the 1800s often mention? Besides personal hygiene issues, what other explanation is there?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/rebpnf/why_do_older_accounts_of_epidemics_often_talk/",
  "subreddit": "AskHistorians",
  "id": "rebpnf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In some accounts of certain epidemics, the usual symptoms are mentioned : fever,\nchills, coughing and so on (but nothing about sores or pustules). But these\naccounts often talk about a stench associated with the disease : a fetid\nsweating, or just a general foul smell about the sick person. We have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある種の伝染病に関する記述の中には、通常の症状、すなわち発熱が記されているものもある。\n悪寒、咳など（ただし、ただれや膿疱については何もない）。しかし、これらの\nこの病気は、しばしば悪臭を伴うと言われています。\n汗をかいたり、病人から悪臭がしたりする。私たちは...",
      "title": "昔の伝染病の記録には、なぜ悪臭の話が多いのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一些关于某些流行病的描述中，提到了通常的症状：发烧。\n寒战、咳嗽等等（但没有提到溃疡或脓疱）。但这些\n叙述中经常提到与疾病有关的恶臭：发臭、出汗或只是一般的恶臭。\n汗水，或只是病人身上的一般恶臭。我们有...",
      "title": "为什么旧时关于流行病的描述经常谈到臭味？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一些關於某些流行病的描述中，提到了通常的症狀：發燒。\n寒戰、咳嗽等等（但沒有提到潰瘍或膿皰）。但這些\n敘述中經常提到與疾病有關的惡臭：發臭、出汗或只是一般的惡臭。\n汗水，或只是病人身上的一般惡臭。我們有...",
      "title": "爲什麼舊時關於流行病的描述經常談到臭味？"
    }
  ]
}