{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "# Introduction\n\nLet me just preface this by saying this post is for those who take trading seriously, who harbor real hopes of earning a steady income in the market. This post is going to be long, and it is going to demand work from you to both understand and attempt to emulate. But that work will be worth the effort. I recommend you read it several times through, and keep as a reference. If you are just here looking for entertainment and gambling, that is fine, but this is probably a thread to skip.\n\n&#x200B;\n\nFour weeks ago I began a challenge to turn $4k into $1M. I began this to help educate others on the professional trading process, and to prove several points that are often in contention:\n\n**1) That it can be done,** \n\n**2) That good trading is actually simple,** \n\n**3) That technical analysis is real and effective,**\n\n**4) That small accounts have a huge edge.**\n\n&#x200B;\n\n**Here are my results from the FIRST WEEK of that challenge.**\n\nhttps://preview.redd.it/92wrzgrcasb71.png?width=1080&format=png&auto=webp&s=a54c7e3379996adcd60332889212470246af7a4e\n\n**Return first week: $658 (+16.5%)**\n\nThe question you should be asking yourself is: **How did I find so many sudden, big winners in a single week?** I will teach you exactly how below.\n\n&#x200B;\n\nFirst, let's just get a bit of a rant off my chest. Hard words to follow, and a lot of you will disagree with these points, but some of you will benefit a lot from hearing it. These are some of the reasons you aren't making money, in my not so humble opinion.\n\n&#x200B;\n\n**1) Stop chasing stupid memes and \"hot\" stocks. Create your own opportunities.**\n\nWhen I read the daily chat in subs, including this one, it gets really depressing quick. All I see are the same tickers posted over and over and over again, and usually total dogshit stocks. Everyone just copying what others tell them to trade, so few actually thinking for themselves or finding their own trades and opportunities. Like, why is half this sub bagholding SOFI and mentioning it nonstop? Was some recent DD posted on it and you all just hopped in blindly? Why the obsession with the other same tickers, like CLNE, that get posted again and again? Because others were posting about it? Look, I won't deny you can sometimes, potentially make money in meme stocks or reading DDs. But chasing memes or pump and dumps is not going to make you money long term.\n\nMaybe you looked at the fundamentals and you thought it was a great company with long term prospects. Ok, sure. But if you are trading on fundamentals, why the hell are you buying short term options? If you are a fundamental trader then you are a buy and hold investor with a year plus timeline. If you are buying weeklies or looking for a quick pop, fundamentals don't mean shit, technicals are what matter. Stop mixing long term strategy with short term trading, it just doesn't make any sense.\n\nSet up your own scanners. Do your own research. Find your own opportunities.\n\n**2) Stop trading slow as fuck megacap stocks with a small account.**\n\nWhen I see people with sub-million dollar accounts trading stocks like Ford or even Apple, I can't help but cringe. The one HUGE advantage that small accounts have is that they can trade the fast, explosive, hard moving small cap stocks without having to worry about issues like liquidity and wicking the price upward. *The reason you can beat the market hard with a small account is because you can trade the highest beta stocks that guys like Buffett can't.* But only if you focus on them.\n\nTrade the fast stocks. The stocks that really move hard. Those are the stocks that will get you rich quickly, not fucking BABA on a 2% move.\n\nThere is an acronym you need to learn, and become obsessive about. That acronym is ADR. Average Daily Range. If your account is less than a million, you should not even be looking at stocks with an ADR less than 5%. They are too slow. When someone asks me to judge a stock or setup for them, the very first thing I look at is the ADR. If it is less than 4 or 5 ADR, I tell them it is dog shit, whether I'm bullish on it or not.\n\nAAPL has an ADR of 1.6 at the moment. Garbage stock for small accounts. Is it rallying? Sure. It is rallying in 1.6% increments. Can you make money in that? Sure, even more with options. But you won't double your account in a month with Apple unless you YOLO everything into short dated options. It works until you go broke, which let's be honest, most people here have or will.\n\nTSLA has an ADR of 3.5. Not terrible, but you can do much better.\n\nSPCE has an ADR of 12.5. THAT is what you want to see. I made a 42% return on SPCE in 3 days last week, with SHARES. And I will show you exactly why I bought SPCE and many others before they exploded last week. It wasn't simple luck.\n\n**3) If you want to gamble with options, then go for it. But if you want to be an actual professional trader, you probably shouldn't touch options until you've shown consistency with shares first.**\n\nLook, if you just want to gamble and hope to get lucky, knowing you will probably go broke, that's fine with me. That's the WSB way. At least you are being honest with yourself. But if you want to get serious about trading, to make so much money so consistently you never have to work again, you should not be touching options until you've proven you can be consistently profitable trading shares.\n\nLeverage and margin is something that ought to be earned, not used just because it is there.\n\nOptions are extremely unforgiving. Let's say you buy a stock at 10, it rallies up to 12, then tanks back to 10 again, and you sell. With shares, you've just broken even. Not good, but obviously not bad either. Breakeven is fine for a trade. But do the same exact trade with options instead of shares, and you could be down 20% on it. Good luck overcoming that downward pressure as a noobie trader long term. Trading is hard enough without adding theta and vega rape to the mix.\n\n**4) If you want to be a professional, then think and act like a professional.**\n\nProfessional traders are process oriented. They are focused on improving their trading process more than they are on chasing the hot next trade.\n\nThat means having a method or system to your trading. Something you can repeat again, and again, and gradually improve. It means using scanners and finding YOUR OWN stocks and trades, finding tickers neither you nor most anyone else has even heard of before, and making tons of money on them. Browsing WSB for DD or the next hot stock is not a system, and likely won't lead to any lasting success as a trader.\n\nIt also means you have to work fucking hard. Success is rarely easy, much less in something as competitive as the stock market. If you are lazy, or don't want it enough, be honest with yourself.\n\n&#x200B;\n\n**Now, on to making money.**\n\nWhat follows is one simple setup that will make you money if traded correctly. I will teach you a process you can follow and repeat and improve upon. This obviously isn't the only way to trade, but I can promise you it beats the market significantly if done correctly. So learn it, and practice it, and start making money. From there, the rest is improvement, and branching out, and finding new strategies to test and perfect on your way to becoming an independent, professional trader. In other words, the rest is gravy.\n\n&#x200B;\n\n# Breakout Swing Trading Strategy: The Setup.\n\nhttps://preview.redd.it/0nnm1qztasb71.png?width=1620&format=png&auto=webp&s=c3ab34210cd7953656a75129b29af399ed08331a\n\nThis is a purely technical trading system. A lot of people will tell you technical analysis is nonsense and doesn't work. Those people do not know what they are talking about. I've made my living as a purely technical trader, and I assure you I am not the only one. Over my career I've picked far too many huge short term winners using nothing but charts for it to be simple luck.\n\nTo put it in one sentence: **We are going to look for strong, volatile momentum stocks that are breaking out of a consolidation pattern.**\n\nSounds easy, and it is, but the details are what really matter. So let's go in depth.\n\nWe will start by analyzing five of the trades I've made as part of my $1M challenge, so you can see exactly what I saw on the charts when I entered my positions. I drew two red lines on each chart to show the \"flagging\" pattern I was watching. The chart on the left is daily candles, chart on the right is hourly candles. Proof of these entries and exits can be found in both text and screenshot format in my history.\n\n&#x200B;\n\n**Example #1: IDT**\n\nBought @ 37.70 on 7/1\n\nSold partial @ 47.00 on 7/2\n\nReturn: 25% gain in 1 day\n\nhttps://preview.redd.it/dxwixuarbsb71.png?width=1619&format=png&auto=webp&s=403e77830fe05e1e0d8c38f76cb2098656af8abf\n\n**Example #2: SPCE**\n\nBought @ 37.25 on 6/22\n\nSold partial @ 52.8 on 6/25\n\nReturn: 42% gain in 3 days\n\nhttps://preview.redd.it/zvlqevnsbsb71.png?width=1619&format=png&auto=webp&s=e4f7d04aafb25e4a43700eb223b3b011f6fd652d\n\n**Example #3: \\[redacted small cap\\]**\n\nBought @ 3.81 on 6/24\n\nSold partial @ 4.44 on 6/25\n\nReturn: 17% gain in 1 day\n\nhttps://preview.redd.it/23rk1b4ubsb71.png?width=1620&format=png&auto=webp&s=2cb4eb4f83154b4d992cc6b6b3bc882e60d0ea43\n\n**Example #4: LPI**\n\nBought @ 68.86 on 6/21\n\nSold partial @ 91.39 on 6/25\n\nReturn: 33% gain in 4 days\n\nhttps://preview.redd.it/jiiuwlevbsb71.png?width=1621&format=png&auto=webp&s=fa4d81b417b665324f1fca54f18995f361bfe5d5\n\n**Example #5: CRCT**\n\nBought @ 35.74 on 6/25\n\nSold partial @ 41.85 on 6/28\n\nReturn: 17% gain in 3 days\n\nhttps://preview.redd.it/gpuatviwbsb71.png?width=1617&format=png&auto=webp&s=9b2dded0bca2a31dda00d5c4f94b3550a5a5f5cc\n\n**What do these charts all have in common?**\n\n**1) Strong momentum stocks.** Every one of these (except CRCT which was a recent IPO) had doubled or more in the past six months. None of this buy low, sell high stuff here. We want to buy high and sell higher.\n\n**2) High ADR (Average Daily Range).** You want to trade the fast stocks, the truly explosive stocks, and a high ADR is one of the best ways to find them. The average ADR on these five stocks was above 8%. Our minimum ADR will be 5%.\n\n**3) Consolidation.** The stock made a big move upward, and then began trading sideways with a tightening range. Forming higher lows and lower highs. The ideal flagging pattern we are looking for is technically referred to as a \"pennant.\"\n\n**4) Moving Averages.** Every one of these stocks was either riding or bouncing off of their 20 day simple moving average. There is something truly magical about that yellow line on my charts, and I don't know what or why it is, but it simply works. This is absolutely key to remember, to avoid stocks that are either too slow or over-extended, focus on those at or near the 20 SMA. Occasionally you can find good breakouts above the 20 SMA that are riding the 10 SMA, but these have a higher failure rate in my experience.\n\n**5) Strong breakout from their range on high volume.** A \"breakout\" refers to a stock punching through the top of the consolidation flag you drew. Ideally you want to see fast rising price action on large volume. This is your entry point.\n\n&#x200B;\n\nIf you want to see more charts and examples of this strategy, [**this four hour video**](https://www.youtube.com/watch?v=xx8GvtAxilk) should give you plenty. If you are going to employ this strategy, I highly recommend investing those four hours.\n\n&#x200B;\n\n# The Trading Process\n\n**STEP 1:** Set up a scanner and run it the night before your trading day. I will give you all of my scanner settings below to get you started. Your welcome.\n\n**STEP 2:** Go through every single stock in your scanner. Look for the most promising stocks. In other words, the stocks that have the five criteria I listed above. If you spot a good stock, do three things: 1) Draw a flag around the consolidating price action. 2) Set an alert to the top of the range, to notify you when a breakout from that range occurs. 3) Add the stock to a breakout watchlist. I don't know if you can do any of this with Robinhood, but you ought to have a real broker and charting software by now. I use ThinkorSwim, but there's plenty of good software options out there, like TC2000. Don't be afraid to pay a bit for good software, if you have to.\n\n**STEP 3:** Before market open, you should now have a solid watchlist of breakout candidates. Go through the list and see which setups look the closest to breaking out, or which have already broken out in the premarket action. Also look carefully for anything that may bounce hard off the 20 SMA. These will be your primary focus, but you should also have alerts to all other stocks in your watchlist to notify you of a breakout.\n\n**STEP 4:** If a strong breakout from the range occurs, meaning good rising action on good volume, you want to buy quickly. I would recommend a minimum of 10% of your account, to a maximum of 25%, but follow your own personal risk tolerance. Set a stop loss order just below the low price of the day. You should always be using a stop loss, especially as a beginner and especially with these volatile stocks.\n\n**STEP 5:** If the stock has stayed above your entry price by the next day, you can raise your stop to the entry price if you wish, to limit your loss to breakeven. After 3-5 days, or after very strong price gain, you should take some profits. Anywhere from a quarter to a half of your position. The rest we will let ride.\n\n**STEP 6:** Use the 10 day simple moving average as a trailing \"soft\" stop for the remaining shares. If it looks like the price action is going to close below the 10 SMA, then close out the entire position. The reason I emphasize close is because intraday price action can be volatile, and you don't want to get stopped out from a small dip just below the 10 SMA, if possible. If you don't have the time to watch the market during the day, feel free to use a hard stop.\n\n# Scanner Settings\n\n**ADR (Average Daily Range) above 5%**\n\n**Price X% greater than Y days ago (1 month, 3 month, 6 month scanners)**\n\n**Price within 15% of 6 day high**\n\n**Price within 15% of 6 day low**\n\n**$Volume (close \\* volume) greater than 3,000,000**\n\n**Listed Stocks Only (No OTC, etc.)**\n\n&#x200B;\n\n1 Month: 25% Greater than 22 Days ago\n\n3 Month: 50% Greater than 67 Days ago\n\n6 Month: 150% Greater than 126 Days ago\n\n&#x200B;\n\nFeel free to adjust these settings to get more or fewer results.\n\n&#x200B;\n\n**ADR code for ThinkorSwim:**\n\n`#Hint: ADR`\n\n`def len = 1;`\n\n`def dayHigh = DailyHighLow(`[`AggregationPeriod.DAY`](https://AggregationPeriod.DAY)`, len, 0, no).DailyHigh;`\n\n`def dayLow = DailyHighLow(`[`AggregationPeriod.DAY`](https://AggregationPeriod.DAY)`, len, 0, no).DailyLow;`\n\n`def ADR_highlow = (dayHigh/dayLow + dayHigh[1]/dayLow[1] + dayHigh[2]/dayLow[2] + dayHigh[3]/dayLow[3] + dayHigh[4]/dayLow[4] + dayHigh[5]/dayLow[5] + dayHigh[6]/dayLow[6] + dayHigh[7]/dayLow[7] + dayHigh[8]/dayLow[8] + dayHigh[9]/dayLow[9] + dayHigh[10]/dayLow[10] +dayHigh[11]/dayLow[11] + dayHigh[12]/dayLow[12] + dayHigh[13]/dayLow[13]) / 14;`\n\n`plot ADR_perc = 100*(ADR_highlow-1);`\n\n**Screenshot (all scanners combined)**\n\nhttps://preview.redd.it/334oc34jbsb71.png?width=1646&format=png&auto=webp&s=ac5aa76d696358d6f2ad15ababe6045bf139a158\n\n# The Other Side of Breakouts: Break Downs\n\nI'm going to recommend that you don't anticipate breakouts. In other words, don't buy a stock simply because it is trading in a good consolidation pattern. Wait for the price to break upward from the range before you buy. The reason for this is that consolidation flags don't only break up, they can also break down. I'll just mention that this can actually be used as a profitable shorting strategy, but I won't go into depth on that in this guide. And I don't recommend shorting for a beginner trader either. Let's take a look at a few examples of recent break downs.\n\n&#x200B;\n\n**SOFI**\n\nSOFI formed a decent flag in June, but then broke down from that range on 6/24. This day on 6/24 would have been a clear signal to either exit a position, or to short the stock. The price simply collapsed hard after this point.\n\nhttps://preview.redd.it/9fk1wrn0csb71.png?width=1623&format=png&auto=webp&s=2cf5299e56581d562e7ed71f80bf42b78886cdde\n\n**AMC**\n\nAMC formed a very strong looking flag in June. I actually broke my own rules and bought this in anticipation on 6/29. But I exited the position quickly on 7/1 when it became clear the price was breaking down from its range. After that, the price collapsed.\n\nhttps://preview.redd.it/y91p2tj1csb71.png?width=1625&format=png&auto=webp&s=86bf88d5c3acfd4253ae31424396d0c187c444ca\n\n# Putting it all together. More complex charts.\n\nLet's take a look at a couple little more complicated, tricky charts. We need to stretch your brain a bit with less simple examples.\n\n**\\[redacted small cap\\]**\n\nHere you can see three consolidation flags back to back, with differing follow through. Flag, breakout, flag, breakout, flag, break down on the 20 SMA. You will frequently see hard rising stocks following this \"stair-stepping\" sort of pattern. Still pretty simple, so let's try something a little harder to see.\n\nhttps://preview.redd.it/rve956djisb71.png?width=1623&format=png&auto=webp&s=94584a68a32c9ada4cd5494af413ae41833feead\n\n**PLBY**\n\nhttps://preview.redd.it/qbkvm3m4csb71.png?width=1609&format=png&auto=webp&s=c145defa11d2a47b4097e23b8374acc32d543c2e\n\nStudy this chart carefully, and you can see everything discussed so far. PLBY formed a nice flag in May. It broke down from this flag on 5/11. But then it seemed to trade sideways for a bit and form another, larger flag again.\n\nNote that the breakout/breakdown point for the first flag was the 20 SMA, and the breakout/breakdown point for the second flag was the 50 SMA. This is no coincidence, and will be seen often. Some stocks will move based on the 50 SMA rather than the 20 SMA, and these can be traded as well, but they are slower moving stocks, and I recommend for smaller accounts to just focus on those stocks near the 20 day.\n\nThe failure point for the second flag was on 6/14. After that the price has collapsed.\n\nOne more thing to note on this chart. There are two points where the price on PLBY broke hard upward from it's range, but then quickly fell back down into the range. These are referred to as \"false breakouts,\" and will happen to you often. Note that the first false breakout occurred well above the 20 SMA, which is one reason to avoid breakouts well above the 20 SMA. They just haven't consolidated enough and have a higher failure rate. Patience is king.\n\n&#x200B;\n\n# Frequently Asked Questions\n\n**When is the best time to employ this strategy?**\n\nThis strategy should only be employed during a rising bull market, or possibly during a sideways market. Breakouts will not work well in a declining market, and some other strategy must be employed.\n\nThe absolute best time for breakouts is shortly after a pullback in the market, when stocks begin to recover quickly. You can see some explosive moves during these periods.\n\n**How do you deal with breakouts that have gapped up in premarket?**\n\nThose are more difficult. It all depends on the price action. If something has gapped up huge in premarket, I will generally just pass on it. But if something is just starting to break out in premarket, I will look to enter. The exact percentage is difficult to say unfortunately, but anything up more than 10% is usually a pass for me.\n\nIf I do enter premarket gappers, I won't enter immediately on open. I'll give it one to five minutes to watch the price action. If the price is stalling or dropping at open I won't buy it. But if it is showing strong volume and rising, that is what I want to see for a buy.\n\n**Can this strategy be done with options instead of shares?**\n\nIt is possible, but I wouldn't recommend it, especially to start. Breakouts have a high failure rate, and options are very unforgiving to failed trades. If you do decide to use options, I would suggest being much more aggressive with your profit taking, perhaps even selling same day on a breakout. Since this is a swing trading strategy, you can go quite short dated on the expiration, around one month dated should be fine unless you want to try for a bigger move or gamble with even shorter expiry.\n\n**What do you set your stop losses at?**\n\nAlready explained above. First day, the lows of the day. Second day, cost basis. After that, use 10 day SMA as a trailing soft stop.\n\n**When do you take profits?**\n\nAlready explained above. Take quarter to half profits after first big run up, usually around 3 to 5 days. Then use the 10 SMA as a soft trailing stop.\n\n**What if the stock gaps down hard overnight? My stop won't protect me from that!**\n\nThis is true. The only way to avoid overnight risk is to be a pure day trader and to never hold overnight. Personally I find swing trading to be far more profitable, since the big moves take days to play out. Swing trading also gives you much more time and freedom to live your life, since you can simply hold a winning position for days or even weeks, and don't have to sit and stare at a screen all day long to make money.\n\nStocks gapping down big overnight is actually quite rare, but eventually you will experience it. But, let's do the math. Let's say you put 10% of your account into a stock, and some news comes out and it tanks a whopping 30% overnight. As a percentage of your account, that is 10% \\* 30%, or 3% of your account. Definitely not good, of course. But you aren't going to go broke losing 3% of your account. It can be overcome with time and good trading. This is just part of the risk of being a trader.\n\n**I am curious if you handle \"memestocks\" or other very popular stocks differently. I hear a lot of people say these stocks don't act rationally. Do you take more/less risk with stocks like this?**\n\nYes, meme stocks often have much more support and move stronger than most other stocks. For this reason I usually have more conviction to trade them, so I will put on a bit more size or even slightly anticipate the breakouts. But I don't trade meme stocks just because they are meme stocks, they must fit the criteria and patterns described above.\n\nMeme stocks represent opportunities for massive gains and so you should take a bit more risk with them. If you got in GME early, which I did, you can make life changing money.\n\nUnfortunately today you've got too many people trying to pump too many names and everybody ends up diluting each other. It's not like a few months back when the names were much more consolidated.\n\n**Do you use any fundamentals in your trading?**\n\nNone. My trading horizon is too short for fundamentals to make any difference in the price action. Fundamentals only make a difference for long term investors. If you are a short term trader, you don't need to worry about fundamentals at all imo.\n\n&#x200B;\n\n# Additional Resources\n\nI was going to offer several links here, but don't want to break any rules... Educational Material, Screenshots and Charts, and a Live Trade Log can all be found in my submission history.\n\nThanks for reading, and good luck in the market.",
  "author_fullname": "t2_b77kzbqs",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 1,
  "clicked": false,
  "title": "Trade Like a Professional: Breakout Swing Trading Guide. The $4k to $1M challenge.",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "23rk1b4ubsb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 63,
          "x": 108,
          "u": "https://preview.redd.it/23rk1b4ubsb71.png?width=108&crop=smart&auto=webp&s=29cc3f0ec10e3328daa9572f58ef032d12b394b1"
        },
        {
          "y": 127,
          "x": 216,
          "u": "https://preview.redd.it/23rk1b4ubsb71.png?width=216&crop=smart&auto=webp&s=2bfc1259415cfbe6475267cc972fc729d4f7501a"
        },
        {
          "y": 189,
          "x": 320,
          "u": "https://preview.redd.it/23rk1b4ubsb71.png?width=320&crop=smart&auto=webp&s=b8a7b6a09d7e70db7bfb36bd3c8da54a327fa0c2"
        },
        {
          "y": 378,
          "x": 640,
          "u": "https://preview.redd.it/23rk1b4ubsb71.png?width=640&crop=smart&auto=webp&s=9b407e65bf4deb1833c1a284b83a8fdc628bf441"
        },
        {
          "y": 568,
          "x": 960,
          "u": "https://preview.redd.it/23rk1b4ubsb71.png?width=960&crop=smart&auto=webp&s=4df1073327f775ae30badcb094f0c216725653fc"
        },
        {
          "y": 639,
          "x": 1080,
          "u": "https://preview.redd.it/23rk1b4ubsb71.png?width=1080&crop=smart&auto=webp&s=7a47a71aef53187e6f863facbc9b1604a7a7e4c0"
        }
      ],
      "s": {
        "y": 959,
        "x": 1620,
        "u": "https://preview.redd.it/23rk1b4ubsb71.png?width=1620&format=png&auto=webp&s=2cb4eb4f83154b4d992cc6b6b3bc882e60d0ea43"
      },
      "id": "23rk1b4ubsb71"
    },
    "gpuatviwbsb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 64,
          "x": 108,
          "u": "https://preview.redd.it/gpuatviwbsb71.png?width=108&crop=smart&auto=webp&s=a10c1b4e06a5e524076a550646a933b128a17d36"
        },
        {
          "y": 129,
          "x": 216,
          "u": "https://preview.redd.it/gpuatviwbsb71.png?width=216&crop=smart&auto=webp&s=06017476871aaef0ba9ae71293f704965e6d3f3e"
        },
        {
          "y": 192,
          "x": 320,
          "u": "https://preview.redd.it/gpuatviwbsb71.png?width=320&crop=smart&auto=webp&s=3a986e92c3773c6bb7e1fb6593ef65337ff0d89e"
        },
        {
          "y": 384,
          "x": 640,
          "u": "https://preview.redd.it/gpuatviwbsb71.png?width=640&crop=smart&auto=webp&s=0d1e22a343a3b372f96b97fd9d05296e4fce0103"
        },
        {
          "y": 577,
          "x": 960,
          "u": "https://preview.redd.it/gpuatviwbsb71.png?width=960&crop=smart&auto=webp&s=fe8bb2ae611207a7f604384ba1016b76dcbcc0ac"
        },
        {
          "y": 649,
          "x": 1080,
          "u": "https://preview.redd.it/gpuatviwbsb71.png?width=1080&crop=smart&auto=webp&s=77a9303e8d38ba1663663aa651dd276366c0c22e"
        }
      ],
      "s": {
        "y": 972,
        "x": 1617,
        "u": "https://preview.redd.it/gpuatviwbsb71.png?width=1617&format=png&auto=webp&s=9b2dded0bca2a31dda00d5c4f94b3550a5a5f5cc"
      },
      "id": "gpuatviwbsb71"
    },
    "dxwixuarbsb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 63,
          "x": 108,
          "u": "https://preview.redd.it/dxwixuarbsb71.png?width=108&crop=smart&auto=webp&s=b2a8ae46d393de3f3ea481ba906c84a77d6080ec"
        },
        {
          "y": 127,
          "x": 216,
          "u": "https://preview.redd.it/dxwixuarbsb71.png?width=216&crop=smart&auto=webp&s=a5289670feafda2b39fa5fb33f35ac8d4cf41db0"
        },
        {
          "y": 188,
          "x": 320,
          "u": "https://preview.redd.it/dxwixuarbsb71.png?width=320&crop=smart&auto=webp&s=fa2ff5815106892bbd8da371a496790606277ed0"
        },
        {
          "y": 376,
          "x": 640,
          "u": "https://preview.redd.it/dxwixuarbsb71.png?width=640&crop=smart&auto=webp&s=32bac054c79d22a655167273e4bbbae8b588e0e2"
        },
        {
          "y": 565,
          "x": 960,
          "u": "https://preview.redd.it/dxwixuarbsb71.png?width=960&crop=smart&auto=webp&s=4eafb7ae845e5ce0c9ea14c1367b222e87b98cbc"
        },
        {
          "y": 635,
          "x": 1080,
          "u": "https://preview.redd.it/dxwixuarbsb71.png?width=1080&crop=smart&auto=webp&s=7d5b75a7f036453fa1187902c53c4713133be54a"
        }
      ],
      "s": {
        "y": 953,
        "x": 1619,
        "u": "https://preview.redd.it/dxwixuarbsb71.png?width=1619&format=png&auto=webp&s=403e77830fe05e1e0d8c38f76cb2098656af8abf"
      },
      "id": "dxwixuarbsb71"
    },
    "9fk1wrn0csb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 63,
          "x": 108,
          "u": "https://preview.redd.it/9fk1wrn0csb71.png?width=108&crop=smart&auto=webp&s=cb59d6e874e1e09df31ad39a4fc5da4da184c78f"
        },
        {
          "y": 127,
          "x": 216,
          "u": "https://preview.redd.it/9fk1wrn0csb71.png?width=216&crop=smart&auto=webp&s=aaf8c6d2ba47df3a943633903e2913a03cfeab55"
        },
        {
          "y": 188,
          "x": 320,
          "u": "https://preview.redd.it/9fk1wrn0csb71.png?width=320&crop=smart&auto=webp&s=f8448e8fc1c9ca5dc4bae4b24ebfa7697b536837"
        },
        {
          "y": 377,
          "x": 640,
          "u": "https://preview.redd.it/9fk1wrn0csb71.png?width=640&crop=smart&auto=webp&s=0aa1405c2c4e1fc0c1f9c26ce2ad838d425be37f"
        },
        {
          "y": 566,
          "x": 960,
          "u": "https://preview.redd.it/9fk1wrn0csb71.png?width=960&crop=smart&auto=webp&s=4a244a536da122675c1d805624cd457429153546"
        },
        {
          "y": 636,
          "x": 1080,
          "u": "https://preview.redd.it/9fk1wrn0csb71.png?width=1080&crop=smart&auto=webp&s=9d5d036b48520087471392a8b9283cc3486c0dd1"
        }
      ],
      "s": {
        "y": 957,
        "x": 1623,
        "u": "https://preview.redd.it/9fk1wrn0csb71.png?width=1623&format=png&auto=webp&s=2cf5299e56581d562e7ed71f80bf42b78886cdde"
      },
      "id": "9fk1wrn0csb71"
    },
    "qbkvm3m4csb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 64,
          "x": 108,
          "u": "https://preview.redd.it/qbkvm3m4csb71.png?width=108&crop=smart&auto=webp&s=bca191f65f2cc28c4ec98f9d307f9a8b0bfade4a"
        },
        {
          "y": 128,
          "x": 216,
          "u": "https://preview.redd.it/qbkvm3m4csb71.png?width=216&crop=smart&auto=webp&s=e1009eb829f786f0adae0916b049b6417b3434be"
        },
        {
          "y": 190,
          "x": 320,
          "u": "https://preview.redd.it/qbkvm3m4csb71.png?width=320&crop=smart&auto=webp&s=998c412d9ab989be737067ac575fbf4bbb22ad6f"
        },
        {
          "y": 381,
          "x": 640,
          "u": "https://preview.redd.it/qbkvm3m4csb71.png?width=640&crop=smart&auto=webp&s=80cd9cfca01d4778ee4b68dce22666ade46608b4"
        },
        {
          "y": 571,
          "x": 960,
          "u": "https://preview.redd.it/qbkvm3m4csb71.png?width=960&crop=smart&auto=webp&s=36efb927127c93755c380ef28795d4b58bec69d0"
        },
        {
          "y": 643,
          "x": 1080,
          "u": "https://preview.redd.it/qbkvm3m4csb71.png?width=1080&crop=smart&auto=webp&s=09bcea2078f027bb3638922f84a1c7a620789049"
        }
      ],
      "s": {
        "y": 958,
        "x": 1609,
        "u": "https://preview.redd.it/qbkvm3m4csb71.png?width=1609&format=png&auto=webp&s=c145defa11d2a47b4097e23b8374acc32d543c2e"
      },
      "id": "qbkvm3m4csb71"
    },
    "rve956djisb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 60,
          "x": 108,
          "u": "https://preview.redd.it/rve956djisb71.png?width=108&crop=smart&auto=webp&s=db685f88da51cdbaf1cb71ecfc0920c535623833"
        },
        {
          "y": 121,
          "x": 216,
          "u": "https://preview.redd.it/rve956djisb71.png?width=216&crop=smart&auto=webp&s=43bb463a5850dc2f3f3d2e89efb590e7c8a799d3"
        },
        {
          "y": 179,
          "x": 320,
          "u": "https://preview.redd.it/rve956djisb71.png?width=320&crop=smart&auto=webp&s=d1415ae61f0dbe82fd45717f0e4c58b147c19f89"
        },
        {
          "y": 359,
          "x": 640,
          "u": "https://preview.redd.it/rve956djisb71.png?width=640&crop=smart&auto=webp&s=a0cc97cd006605d3a023e6fcaebbfb6d3a5110e7"
        },
        {
          "y": 538,
          "x": 960,
          "u": "https://preview.redd.it/rve956djisb71.png?width=960&crop=smart&auto=webp&s=4ad98995d93dc81023d22c4d0e86408aa2fbf2ed"
        },
        {
          "y": 606,
          "x": 1080,
          "u": "https://preview.redd.it/rve956djisb71.png?width=1080&crop=smart&auto=webp&s=c9677f42c0e25ea76a2f4d3de166cc7e108ba1a5"
        }
      ],
      "s": {
        "y": 911,
        "x": 1623,
        "u": "https://preview.redd.it/rve956djisb71.png?width=1623&format=png&auto=webp&s=94584a68a32c9ada4cd5494af413ae41833feead"
      },
      "id": "rve956djisb71"
    },
    "jiiuwlevbsb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 64,
          "x": 108,
          "u": "https://preview.redd.it/jiiuwlevbsb71.png?width=108&crop=smart&auto=webp&s=663c5f0e6b68c1047d896cb49728a71aaa7cbc7d"
        },
        {
          "y": 129,
          "x": 216,
          "u": "https://preview.redd.it/jiiuwlevbsb71.png?width=216&crop=smart&auto=webp&s=4676b15b9860ad4fc5ed7d1f9c2584ca2bd6e177"
        },
        {
          "y": 191,
          "x": 320,
          "u": "https://preview.redd.it/jiiuwlevbsb71.png?width=320&crop=smart&auto=webp&s=1a4fd645fa2dc7f35bdcd38c7896ba0a3752624e"
        },
        {
          "y": 383,
          "x": 640,
          "u": "https://preview.redd.it/jiiuwlevbsb71.png?width=640&crop=smart&auto=webp&s=4bd7c71b362b9ae33a10c6974df8f9a4df432c66"
        },
        {
          "y": 575,
          "x": 960,
          "u": "https://preview.redd.it/jiiuwlevbsb71.png?width=960&crop=smart&auto=webp&s=2886ee897898d8bc00af7235d0bebd17c20df5d6"
        },
        {
          "y": 646,
          "x": 1080,
          "u": "https://preview.redd.it/jiiuwlevbsb71.png?width=1080&crop=smart&auto=webp&s=a8bc4d86e2f41d5eb1beff59910cc60870d80617"
        }
      ],
      "s": {
        "y": 971,
        "x": 1621,
        "u": "https://preview.redd.it/jiiuwlevbsb71.png?width=1621&format=png&auto=webp&s=fa4d81b417b665324f1fca54f18995f361bfe5d5"
      },
      "id": "jiiuwlevbsb71"
    },
    "92wrzgrcasb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 135,
          "x": 108,
          "u": "https://preview.redd.it/92wrzgrcasb71.png?width=108&crop=smart&auto=webp&s=1acc728a08750d2bac054f6cd6851263a44bb73b"
        },
        {
          "y": 270,
          "x": 216,
          "u": "https://preview.redd.it/92wrzgrcasb71.png?width=216&crop=smart&auto=webp&s=debcf81b3a6f030feda4046f57af0541c189c561"
        },
        {
          "y": 401,
          "x": 320,
          "u": "https://preview.redd.it/92wrzgrcasb71.png?width=320&crop=smart&auto=webp&s=46d19a06dcf8365da7dd50c6bc4e58f3eaf53e19"
        },
        {
          "y": 802,
          "x": 640,
          "u": "https://preview.redd.it/92wrzgrcasb71.png?width=640&crop=smart&auto=webp&s=264f116bd92866f45f71c1496eb1f5f86bb5e117"
        },
        {
          "y": 1203,
          "x": 960,
          "u": "https://preview.redd.it/92wrzgrcasb71.png?width=960&crop=smart&auto=webp&s=344fbc2c196a6c59c0e10f1980bad2202529434f"
        },
        {
          "y": 1354,
          "x": 1080,
          "u": "https://preview.redd.it/92wrzgrcasb71.png?width=1080&crop=smart&auto=webp&s=11997d49a71b9ae2a4f2f0b8b93bf5724c74a912"
        }
      ],
      "s": {
        "y": 1354,
        "x": 1080,
        "u": "https://preview.redd.it/92wrzgrcasb71.png?width=1080&format=png&auto=webp&s=a54c7e3379996adcd60332889212470246af7a4e"
      },
      "id": "92wrzgrcasb71"
    },
    "334oc34jbsb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 63,
          "x": 108,
          "u": "https://preview.redd.it/334oc34jbsb71.png?width=108&crop=smart&auto=webp&s=4f2fae974f73f3819e2c274d434f7ddc03ce65de"
        },
        {
          "y": 127,
          "x": 216,
          "u": "https://preview.redd.it/334oc34jbsb71.png?width=216&crop=smart&auto=webp&s=c7b405846bcf23218cb8d4f214dbab7c4f93d3a2"
        },
        {
          "y": 188,
          "x": 320,
          "u": "https://preview.redd.it/334oc34jbsb71.png?width=320&crop=smart&auto=webp&s=c33b04ec3694891300e366d42cbaa4726dfbfee3"
        },
        {
          "y": 376,
          "x": 640,
          "u": "https://preview.redd.it/334oc34jbsb71.png?width=640&crop=smart&auto=webp&s=9ddf8f89f649e6fd24094c3b19584901abaf2c2c"
        },
        {
          "y": 565,
          "x": 960,
          "u": "https://preview.redd.it/334oc34jbsb71.png?width=960&crop=smart&auto=webp&s=3eb80fa325f3f54d21c4d124082c9a430e921633"
        },
        {
          "y": 635,
          "x": 1080,
          "u": "https://preview.redd.it/334oc34jbsb71.png?width=1080&crop=smart&auto=webp&s=f7b790e8ef89ba6824130ae3363fb104948565fe"
        }
      ],
      "s": {
        "y": 969,
        "x": 1646,
        "u": "https://preview.redd.it/334oc34jbsb71.png?width=1646&format=png&auto=webp&s=ac5aa76d696358d6f2ad15ababe6045bf139a158"
      },
      "id": "334oc34jbsb71"
    },
    "zvlqevnsbsb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 64,
          "x": 108,
          "u": "https://preview.redd.it/zvlqevnsbsb71.png?width=108&crop=smart&auto=webp&s=75e2ecf4644b2abb076ef6175c7d17ad2142e92b"
        },
        {
          "y": 129,
          "x": 216,
          "u": "https://preview.redd.it/zvlqevnsbsb71.png?width=216&crop=smart&auto=webp&s=bcadb26ed80e1b5340f3a32127065176817570aa"
        },
        {
          "y": 192,
          "x": 320,
          "u": "https://preview.redd.it/zvlqevnsbsb71.png?width=320&crop=smart&auto=webp&s=44c6065378c6103c814db92594d3a6119ccba2f7"
        },
        {
          "y": 384,
          "x": 640,
          "u": "https://preview.redd.it/zvlqevnsbsb71.png?width=640&crop=smart&auto=webp&s=56bfe7297a4f17dbe70d980bf419b0d76426d367"
        },
        {
          "y": 576,
          "x": 960,
          "u": "https://preview.redd.it/zvlqevnsbsb71.png?width=960&crop=smart&auto=webp&s=90cdfb1cb5678e400252492371f7d0460d31a277"
        },
        {
          "y": 648,
          "x": 1080,
          "u": "https://preview.redd.it/zvlqevnsbsb71.png?width=1080&crop=smart&auto=webp&s=e6e30b561d55a9e0444a50eb77c44bbc38c8e3b5"
        }
      ],
      "s": {
        "y": 972,
        "x": 1619,
        "u": "https://preview.redd.it/zvlqevnsbsb71.png?width=1619&format=png&auto=webp&s=e4f7d04aafb25e4a43700eb223b3b011f6fd652d"
      },
      "id": "zvlqevnsbsb71"
    },
    "0nnm1qztasb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 64,
          "x": 108,
          "u": "https://preview.redd.it/0nnm1qztasb71.png?width=108&crop=smart&auto=webp&s=24793c2c2c6c35c3e3666a9ec46e7da11fdaff2f"
        },
        {
          "y": 129,
          "x": 216,
          "u": "https://preview.redd.it/0nnm1qztasb71.png?width=216&crop=smart&auto=webp&s=436651affaa73a2d05591757e56c7b82d75f75d4"
        },
        {
          "y": 192,
          "x": 320,
          "u": "https://preview.redd.it/0nnm1qztasb71.png?width=320&crop=smart&auto=webp&s=df9a725d722f43f8c1ea432fd680ab0bac8211b3"
        },
        {
          "y": 384,
          "x": 640,
          "u": "https://preview.redd.it/0nnm1qztasb71.png?width=640&crop=smart&auto=webp&s=4a4e166decaf87f948965f346b91702f5865affc"
        },
        {
          "y": 577,
          "x": 960,
          "u": "https://preview.redd.it/0nnm1qztasb71.png?width=960&crop=smart&auto=webp&s=e777e122d51ac96fb1e1516a16f7d99f730863b7"
        },
        {
          "y": 649,
          "x": 1080,
          "u": "https://preview.redd.it/0nnm1qztasb71.png?width=1080&crop=smart&auto=webp&s=542289433057cf26903fa3f7d7596364d9cf9316"
        }
      ],
      "s": {
        "y": 974,
        "x": 1620,
        "u": "https://preview.redd.it/0nnm1qztasb71.png?width=1620&format=png&auto=webp&s=c3ab34210cd7953656a75129b29af399ed08331a"
      },
      "id": "0nnm1qztasb71"
    },
    "y91p2tj1csb71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 63,
          "x": 108,
          "u": "https://preview.redd.it/y91p2tj1csb71.png?width=108&crop=smart&auto=webp&s=f192a7d786b8f93fb01e7c6a3a1c6965066e8681"
        },
        {
          "y": 127,
          "x": 216,
          "u": "https://preview.redd.it/y91p2tj1csb71.png?width=216&crop=smart&auto=webp&s=302261af3ed463cafbd7bd509a7b961f89d9f8ab"
        },
        {
          "y": 188,
          "x": 320,
          "u": "https://preview.redd.it/y91p2tj1csb71.png?width=320&crop=smart&auto=webp&s=ea7a186a1d9597205f3858854e8e29abfb0fe432"
        },
        {
          "y": 376,
          "x": 640,
          "u": "https://preview.redd.it/y91p2tj1csb71.png?width=640&crop=smart&auto=webp&s=092be53bcf77bd446c1e8d64ad8dd788a872bd4f"
        },
        {
          "y": 565,
          "x": 960,
          "u": "https://preview.redd.it/y91p2tj1csb71.png?width=960&crop=smart&auto=webp&s=c8eebbad633495d70f274c358d293c28de69563f"
        },
        {
          "y": 636,
          "x": 1080,
          "u": "https://preview.redd.it/y91p2tj1csb71.png?width=1080&crop=smart&auto=webp&s=00fc76fcf745002ddb9dd092ccd9c6a5564b5e55"
        }
      ],
      "s": {
        "y": 957,
        "x": 1625,
        "u": "https://preview.redd.it/y91p2tj1csb71.png?width=1625&format=png&auto=webp&s=86bf88d5c3acfd4253ae31424396d0c187c444ca"
      },
      "id": "y91p2tj1csb71"
    }
  },
  "name": "t3_om6fsb",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.86,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1507,
  "total_awards_received": 13,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 1507,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 4,
    "gid_2": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1626564645,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Introduction</h1>\n\n<p>Let me just preface this by saying this post is for those who take trading seriously, who harbor real hopes of earning a steady income in the market. This post is going to be long, and it is going to demand work from you to both understand and attempt to emulate. But that work will be worth the effort. I recommend you read it several times through, and keep as a reference. If you are just here looking for entertainment and gambling, that is fine, but this is probably a thread to skip.</p>\n\n<p>&#x200B;</p>\n\n<p>Four weeks ago I began a challenge to turn $4k into $1M. I began this to help educate others on the professional trading process, and to prove several points that are often in contention:</p>\n\n<p><strong>1) That it can be done,</strong> </p>\n\n<p><strong>2) That good trading is actually simple,</strong> </p>\n\n<p><strong>3) That technical analysis is real and effective,</strong></p>\n\n<p><strong>4) That small accounts have a huge edge.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Here are my results from the FIRST WEEK of that challenge.</strong></p>\n\n<p><a href=\"https://preview.redd.it/92wrzgrcasb71.png?width=1080&amp;format=png&amp;auto=webp&amp;s=a54c7e3379996adcd60332889212470246af7a4e\">https://preview.redd.it/92wrzgrcasb71.png?width=1080&amp;format=png&amp;auto=webp&amp;s=a54c7e3379996adcd60332889212470246af7a4e</a></p>\n\n<p><strong>Return first week: $658 (+16.5%)</strong></p>\n\n<p>The question you should be asking yourself is: <strong>How did I find so many sudden, big winners in a single week?</strong> I will teach you exactly how below.</p>\n\n<p>&#x200B;</p>\n\n<p>First, let&#39;s just get a bit of a rant off my chest. Hard words to follow, and a lot of you will disagree with these points, but some of you will benefit a lot from hearing it. These are some of the reasons you aren&#39;t making money, in my not so humble opinion.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>1) Stop chasing stupid memes and &quot;hot&quot; stocks. Create your own opportunities.</strong></p>\n\n<p>When I read the daily chat in subs, including this one, it gets really depressing quick. All I see are the same tickers posted over and over and over again, and usually total dogshit stocks. Everyone just copying what others tell them to trade, so few actually thinking for themselves or finding their own trades and opportunities. Like, why is half this sub bagholding SOFI and mentioning it nonstop? Was some recent DD posted on it and you all just hopped in blindly? Why the obsession with the other same tickers, like CLNE, that get posted again and again? Because others were posting about it? Look, I won&#39;t deny you can sometimes, potentially make money in meme stocks or reading DDs. But chasing memes or pump and dumps is not going to make you money long term.</p>\n\n<p>Maybe you looked at the fundamentals and you thought it was a great company with long term prospects. Ok, sure. But if you are trading on fundamentals, why the hell are you buying short term options? If you are a fundamental trader then you are a buy and hold investor with a year plus timeline. If you are buying weeklies or looking for a quick pop, fundamentals don&#39;t mean shit, technicals are what matter. Stop mixing long term strategy with short term trading, it just doesn&#39;t make any sense.</p>\n\n<p>Set up your own scanners. Do your own research. Find your own opportunities.</p>\n\n<p><strong>2) Stop trading slow as fuck megacap stocks with a small account.</strong></p>\n\n<p>When I see people with sub-million dollar accounts trading stocks like Ford or even Apple, I can&#39;t help but cringe. The one HUGE advantage that small accounts have is that they can trade the fast, explosive, hard moving small cap stocks without having to worry about issues like liquidity and wicking the price upward. <em>The reason you can beat the market hard with a small account is because you can trade the highest beta stocks that guys like Buffett can&#39;t.</em> But only if you focus on them.</p>\n\n<p>Trade the fast stocks. The stocks that really move hard. Those are the stocks that will get you rich quickly, not fucking BABA on a 2% move.</p>\n\n<p>There is an acronym you need to learn, and become obsessive about. That acronym is ADR. Average Daily Range. If your account is less than a million, you should not even be looking at stocks with an ADR less than 5%. They are too slow. When someone asks me to judge a stock or setup for them, the very first thing I look at is the ADR. If it is less than 4 or 5 ADR, I tell them it is dog shit, whether I&#39;m bullish on it or not.</p>\n\n<p>AAPL has an ADR of 1.6 at the moment. Garbage stock for small accounts. Is it rallying? Sure. It is rallying in 1.6% increments. Can you make money in that? Sure, even more with options. But you won&#39;t double your account in a month with Apple unless you YOLO everything into short dated options. It works until you go broke, which let&#39;s be honest, most people here have or will.</p>\n\n<p>TSLA has an ADR of 3.5. Not terrible, but you can do much better.</p>\n\n<p>SPCE has an ADR of 12.5. THAT is what you want to see. I made a 42% return on SPCE in 3 days last week, with SHARES. And I will show you exactly why I bought SPCE and many others before they exploded last week. It wasn&#39;t simple luck.</p>\n\n<p><strong>3) If you want to gamble with options, then go for it. But if you want to be an actual professional trader, you probably shouldn&#39;t touch options until you&#39;ve shown consistency with shares first.</strong></p>\n\n<p>Look, if you just want to gamble and hope to get lucky, knowing you will probably go broke, that&#39;s fine with me. That&#39;s the WSB way. At least you are being honest with yourself. But if you want to get serious about trading, to make so much money so consistently you never have to work again, you should not be touching options until you&#39;ve proven you can be consistently profitable trading shares.</p>\n\n<p>Leverage and margin is something that ought to be earned, not used just because it is there.</p>\n\n<p>Options are extremely unforgiving. Let&#39;s say you buy a stock at 10, it rallies up to 12, then tanks back to 10 again, and you sell. With shares, you&#39;ve just broken even. Not good, but obviously not bad either. Breakeven is fine for a trade. But do the same exact trade with options instead of shares, and you could be down 20% on it. Good luck overcoming that downward pressure as a noobie trader long term. Trading is hard enough without adding theta and vega rape to the mix.</p>\n\n<p><strong>4) If you want to be a professional, then think and act like a professional.</strong></p>\n\n<p>Professional traders are process oriented. They are focused on improving their trading process more than they are on chasing the hot next trade.</p>\n\n<p>That means having a method or system to your trading. Something you can repeat again, and again, and gradually improve. It means using scanners and finding YOUR OWN stocks and trades, finding tickers neither you nor most anyone else has even heard of before, and making tons of money on them. Browsing WSB for DD or the next hot stock is not a system, and likely won&#39;t lead to any lasting success as a trader.</p>\n\n<p>It also means you have to work fucking hard. Success is rarely easy, much less in something as competitive as the stock market. If you are lazy, or don&#39;t want it enough, be honest with yourself.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Now, on to making money.</strong></p>\n\n<p>What follows is one simple setup that will make you money if traded correctly. I will teach you a process you can follow and repeat and improve upon. This obviously isn&#39;t the only way to trade, but I can promise you it beats the market significantly if done correctly. So learn it, and practice it, and start making money. From there, the rest is improvement, and branching out, and finding new strategies to test and perfect on your way to becoming an independent, professional trader. In other words, the rest is gravy.</p>\n\n<p>&#x200B;</p>\n\n<h1>Breakout Swing Trading Strategy: The Setup.</h1>\n\n<p><a href=\"https://preview.redd.it/0nnm1qztasb71.png?width=1620&amp;format=png&amp;auto=webp&amp;s=c3ab34210cd7953656a75129b29af399ed08331a\">https://preview.redd.it/0nnm1qztasb71.png?width=1620&amp;format=png&amp;auto=webp&amp;s=c3ab34210cd7953656a75129b29af399ed08331a</a></p>\n\n<p>This is a purely technical trading system. A lot of people will tell you technical analysis is nonsense and doesn&#39;t work. Those people do not know what they are talking about. I&#39;ve made my living as a purely technical trader, and I assure you I am not the only one. Over my career I&#39;ve picked far too many huge short term winners using nothing but charts for it to be simple luck.</p>\n\n<p>To put it in one sentence: <strong>We are going to look for strong, volatile momentum stocks that are breaking out of a consolidation pattern.</strong></p>\n\n<p>Sounds easy, and it is, but the details are what really matter. So let&#39;s go in depth.</p>\n\n<p>We will start by analyzing five of the trades I&#39;ve made as part of my $1M challenge, so you can see exactly what I saw on the charts when I entered my positions. I drew two red lines on each chart to show the &quot;flagging&quot; pattern I was watching. The chart on the left is daily candles, chart on the right is hourly candles. Proof of these entries and exits can be found in both text and screenshot format in my history.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Example #1: IDT</strong></p>\n\n<p>Bought @ 37.70 on 7/1</p>\n\n<p>Sold partial @ 47.00 on 7/2</p>\n\n<p>Return: 25% gain in 1 day</p>\n\n<p><a href=\"https://preview.redd.it/dxwixuarbsb71.png?width=1619&amp;format=png&amp;auto=webp&amp;s=403e77830fe05e1e0d8c38f76cb2098656af8abf\">https://preview.redd.it/dxwixuarbsb71.png?width=1619&amp;format=png&amp;auto=webp&amp;s=403e77830fe05e1e0d8c38f76cb2098656af8abf</a></p>\n\n<p><strong>Example #2: SPCE</strong></p>\n\n<p>Bought @ 37.25 on 6/22</p>\n\n<p>Sold partial @ 52.8 on 6/25</p>\n\n<p>Return: 42% gain in 3 days</p>\n\n<p><a href=\"https://preview.redd.it/zvlqevnsbsb71.png?width=1619&amp;format=png&amp;auto=webp&amp;s=e4f7d04aafb25e4a43700eb223b3b011f6fd652d\">https://preview.redd.it/zvlqevnsbsb71.png?width=1619&amp;format=png&amp;auto=webp&amp;s=e4f7d04aafb25e4a43700eb223b3b011f6fd652d</a></p>\n\n<p><strong>Example #3: [redacted small cap]</strong></p>\n\n<p>Bought @ 3.81 on 6/24</p>\n\n<p>Sold partial @ 4.44 on 6/25</p>\n\n<p>Return: 17% gain in 1 day</p>\n\n<p><a href=\"https://preview.redd.it/23rk1b4ubsb71.png?width=1620&amp;format=png&amp;auto=webp&amp;s=2cb4eb4f83154b4d992cc6b6b3bc882e60d0ea43\">https://preview.redd.it/23rk1b4ubsb71.png?width=1620&amp;format=png&amp;auto=webp&amp;s=2cb4eb4f83154b4d992cc6b6b3bc882e60d0ea43</a></p>\n\n<p><strong>Example #4: LPI</strong></p>\n\n<p>Bought @ 68.86 on 6/21</p>\n\n<p>Sold partial @ 91.39 on 6/25</p>\n\n<p>Return: 33% gain in 4 days</p>\n\n<p><a href=\"https://preview.redd.it/jiiuwlevbsb71.png?width=1621&amp;format=png&amp;auto=webp&amp;s=fa4d81b417b665324f1fca54f18995f361bfe5d5\">https://preview.redd.it/jiiuwlevbsb71.png?width=1621&amp;format=png&amp;auto=webp&amp;s=fa4d81b417b665324f1fca54f18995f361bfe5d5</a></p>\n\n<p><strong>Example #5: CRCT</strong></p>\n\n<p>Bought @ 35.74 on 6/25</p>\n\n<p>Sold partial @ 41.85 on 6/28</p>\n\n<p>Return: 17% gain in 3 days</p>\n\n<p><a href=\"https://preview.redd.it/gpuatviwbsb71.png?width=1617&amp;format=png&amp;auto=webp&amp;s=9b2dded0bca2a31dda00d5c4f94b3550a5a5f5cc\">https://preview.redd.it/gpuatviwbsb71.png?width=1617&amp;format=png&amp;auto=webp&amp;s=9b2dded0bca2a31dda00d5c4f94b3550a5a5f5cc</a></p>\n\n<p><strong>What do these charts all have in common?</strong></p>\n\n<p><strong>1) Strong momentum stocks.</strong> Every one of these (except CRCT which was a recent IPO) had doubled or more in the past six months. None of this buy low, sell high stuff here. We want to buy high and sell higher.</p>\n\n<p><strong>2) High ADR (Average Daily Range).</strong> You want to trade the fast stocks, the truly explosive stocks, and a high ADR is one of the best ways to find them. The average ADR on these five stocks was above 8%. Our minimum ADR will be 5%.</p>\n\n<p><strong>3) Consolidation.</strong> The stock made a big move upward, and then began trading sideways with a tightening range. Forming higher lows and lower highs. The ideal flagging pattern we are looking for is technically referred to as a &quot;pennant.&quot;</p>\n\n<p><strong>4) Moving Averages.</strong> Every one of these stocks was either riding or bouncing off of their 20 day simple moving average. There is something truly magical about that yellow line on my charts, and I don&#39;t know what or why it is, but it simply works. This is absolutely key to remember, to avoid stocks that are either too slow or over-extended, focus on those at or near the 20 SMA. Occasionally you can find good breakouts above the 20 SMA that are riding the 10 SMA, but these have a higher failure rate in my experience.</p>\n\n<p><strong>5) Strong breakout from their range on high volume.</strong> A &quot;breakout&quot; refers to a stock punching through the top of the consolidation flag you drew. Ideally you want to see fast rising price action on large volume. This is your entry point.</p>\n\n<p>&#x200B;</p>\n\n<p>If you want to see more charts and examples of this strategy, <a href=\"https://www.youtube.com/watch?v=xx8GvtAxilk\"><strong>this four hour video</strong></a> should give you plenty. If you are going to employ this strategy, I highly recommend investing those four hours.</p>\n\n<p>&#x200B;</p>\n\n<h1>The Trading Process</h1>\n\n<p><strong>STEP 1:</strong> Set up a scanner and run it the night before your trading day. I will give you all of my scanner settings below to get you started. Your welcome.</p>\n\n<p><strong>STEP 2:</strong> Go through every single stock in your scanner. Look for the most promising stocks. In other words, the stocks that have the five criteria I listed above. If you spot a good stock, do three things: 1) Draw a flag around the consolidating price action. 2) Set an alert to the top of the range, to notify you when a breakout from that range occurs. 3) Add the stock to a breakout watchlist. I don&#39;t know if you can do any of this with Robinhood, but you ought to have a real broker and charting software by now. I use ThinkorSwim, but there&#39;s plenty of good software options out there, like TC2000. Don&#39;t be afraid to pay a bit for good software, if you have to.</p>\n\n<p><strong>STEP 3:</strong> Before market open, you should now have a solid watchlist of breakout candidates. Go through the list and see which setups look the closest to breaking out, or which have already broken out in the premarket action. Also look carefully for anything that may bounce hard off the 20 SMA. These will be your primary focus, but you should also have alerts to all other stocks in your watchlist to notify you of a breakout.</p>\n\n<p><strong>STEP 4:</strong> If a strong breakout from the range occurs, meaning good rising action on good volume, you want to buy quickly. I would recommend a minimum of 10% of your account, to a maximum of 25%, but follow your own personal risk tolerance. Set a stop loss order just below the low price of the day. You should always be using a stop loss, especially as a beginner and especially with these volatile stocks.</p>\n\n<p><strong>STEP 5:</strong> If the stock has stayed above your entry price by the next day, you can raise your stop to the entry price if you wish, to limit your loss to breakeven. After 3-5 days, or after very strong price gain, you should take some profits. Anywhere from a quarter to a half of your position. The rest we will let ride.</p>\n\n<p><strong>STEP 6:</strong> Use the 10 day simple moving average as a trailing &quot;soft&quot; stop for the remaining shares. If it looks like the price action is going to close below the 10 SMA, then close out the entire position. The reason I emphasize close is because intraday price action can be volatile, and you don&#39;t want to get stopped out from a small dip just below the 10 SMA, if possible. If you don&#39;t have the time to watch the market during the day, feel free to use a hard stop.</p>\n\n<h1>Scanner Settings</h1>\n\n<p><strong>ADR (Average Daily Range) above 5%</strong></p>\n\n<p><strong>Price X% greater than Y days ago (1 month, 3 month, 6 month scanners)</strong></p>\n\n<p><strong>Price within 15% of 6 day high</strong></p>\n\n<p><strong>Price within 15% of 6 day low</strong></p>\n\n<p><strong>$Volume (close * volume) greater than 3,000,000</strong></p>\n\n<p><strong>Listed Stocks Only (No OTC, etc.)</strong></p>\n\n<p>&#x200B;</p>\n\n<p>1 Month: 25% Greater than 22 Days ago</p>\n\n<p>3 Month: 50% Greater than 67 Days ago</p>\n\n<p>6 Month: 150% Greater than 126 Days ago</p>\n\n<p>&#x200B;</p>\n\n<p>Feel free to adjust these settings to get more or fewer results.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>ADR code for ThinkorSwim:</strong></p>\n\n<p><code>#Hint: ADR</code></p>\n\n<p><code>def len = 1;</code></p>\n\n<p><code>def dayHigh = DailyHighLow(</code><a href=\"https://AggregationPeriod.DAY\"><code>AggregationPeriod.DAY</code></a><code>, len, 0, no).DailyHigh;</code></p>\n\n<p><code>def dayLow = DailyHighLow(</code><a href=\"https://AggregationPeriod.DAY\"><code>AggregationPeriod.DAY</code></a><code>, len, 0, no).DailyLow;</code></p>\n\n<p><code>def ADR_highlow = (dayHigh/dayLow + dayHigh[1]/dayLow[1] + dayHigh[2]/dayLow[2] + dayHigh[3]/dayLow[3] + dayHigh[4]/dayLow[4] + dayHigh[5]/dayLow[5] + dayHigh[6]/dayLow[6] + dayHigh[7]/dayLow[7] + dayHigh[8]/dayLow[8] + dayHigh[9]/dayLow[9] + dayHigh[10]/dayLow[10] +dayHigh[11]/dayLow[11] + dayHigh[12]/dayLow[12] + dayHigh[13]/dayLow[13]) / 14;</code></p>\n\n<p><code>plot ADR_perc = 100*(ADR_highlow-1);</code></p>\n\n<p><strong>Screenshot (all scanners combined)</strong></p>\n\n<p><a href=\"https://preview.redd.it/334oc34jbsb71.png?width=1646&amp;format=png&amp;auto=webp&amp;s=ac5aa76d696358d6f2ad15ababe6045bf139a158\">https://preview.redd.it/334oc34jbsb71.png?width=1646&amp;format=png&amp;auto=webp&amp;s=ac5aa76d696358d6f2ad15ababe6045bf139a158</a></p>\n\n<h1>The Other Side of Breakouts: Break Downs</h1>\n\n<p>I&#39;m going to recommend that you don&#39;t anticipate breakouts. In other words, don&#39;t buy a stock simply because it is trading in a good consolidation pattern. Wait for the price to break upward from the range before you buy. The reason for this is that consolidation flags don&#39;t only break up, they can also break down. I&#39;ll just mention that this can actually be used as a profitable shorting strategy, but I won&#39;t go into depth on that in this guide. And I don&#39;t recommend shorting for a beginner trader either. Let&#39;s take a look at a few examples of recent break downs.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>SOFI</strong></p>\n\n<p>SOFI formed a decent flag in June, but then broke down from that range on 6/24. This day on 6/24 would have been a clear signal to either exit a position, or to short the stock. The price simply collapsed hard after this point.</p>\n\n<p><a href=\"https://preview.redd.it/9fk1wrn0csb71.png?width=1623&amp;format=png&amp;auto=webp&amp;s=2cf5299e56581d562e7ed71f80bf42b78886cdde\">https://preview.redd.it/9fk1wrn0csb71.png?width=1623&amp;format=png&amp;auto=webp&amp;s=2cf5299e56581d562e7ed71f80bf42b78886cdde</a></p>\n\n<p><strong>AMC</strong></p>\n\n<p>AMC formed a very strong looking flag in June. I actually broke my own rules and bought this in anticipation on 6/29. But I exited the position quickly on 7/1 when it became clear the price was breaking down from its range. After that, the price collapsed.</p>\n\n<p><a href=\"https://preview.redd.it/y91p2tj1csb71.png?width=1625&amp;format=png&amp;auto=webp&amp;s=86bf88d5c3acfd4253ae31424396d0c187c444ca\">https://preview.redd.it/y91p2tj1csb71.png?width=1625&amp;format=png&amp;auto=webp&amp;s=86bf88d5c3acfd4253ae31424396d0c187c444ca</a></p>\n\n<h1>Putting it all together. More complex charts.</h1>\n\n<p>Let&#39;s take a look at a couple little more complicated, tricky charts. We need to stretch your brain a bit with less simple examples.</p>\n\n<p><strong>[redacted small cap]</strong></p>\n\n<p>Here you can see three consolidation flags back to back, with differing follow through. Flag, breakout, flag, breakout, flag, break down on the 20 SMA. You will frequently see hard rising stocks following this &quot;stair-stepping&quot; sort of pattern. Still pretty simple, so let&#39;s try something a little harder to see.</p>\n\n<p><a href=\"https://preview.redd.it/rve956djisb71.png?width=1623&amp;format=png&amp;auto=webp&amp;s=94584a68a32c9ada4cd5494af413ae41833feead\">https://preview.redd.it/rve956djisb71.png?width=1623&amp;format=png&amp;auto=webp&amp;s=94584a68a32c9ada4cd5494af413ae41833feead</a></p>\n\n<p><strong>PLBY</strong></p>\n\n<p><a href=\"https://preview.redd.it/qbkvm3m4csb71.png?width=1609&amp;format=png&amp;auto=webp&amp;s=c145defa11d2a47b4097e23b8374acc32d543c2e\">https://preview.redd.it/qbkvm3m4csb71.png?width=1609&amp;format=png&amp;auto=webp&amp;s=c145defa11d2a47b4097e23b8374acc32d543c2e</a></p>\n\n<p>Study this chart carefully, and you can see everything discussed so far. PLBY formed a nice flag in May. It broke down from this flag on 5/11. But then it seemed to trade sideways for a bit and form another, larger flag again.</p>\n\n<p>Note that the breakout/breakdown point for the first flag was the 20 SMA, and the breakout/breakdown point for the second flag was the 50 SMA. This is no coincidence, and will be seen often. Some stocks will move based on the 50 SMA rather than the 20 SMA, and these can be traded as well, but they are slower moving stocks, and I recommend for smaller accounts to just focus on those stocks near the 20 day.</p>\n\n<p>The failure point for the second flag was on 6/14. After that the price has collapsed.</p>\n\n<p>One more thing to note on this chart. There are two points where the price on PLBY broke hard upward from it&#39;s range, but then quickly fell back down into the range. These are referred to as &quot;false breakouts,&quot; and will happen to you often. Note that the first false breakout occurred well above the 20 SMA, which is one reason to avoid breakouts well above the 20 SMA. They just haven&#39;t consolidated enough and have a higher failure rate. Patience is king.</p>\n\n<p>&#x200B;</p>\n\n<h1>Frequently Asked Questions</h1>\n\n<p><strong>When is the best time to employ this strategy?</strong></p>\n\n<p>This strategy should only be employed during a rising bull market, or possibly during a sideways market. Breakouts will not work well in a declining market, and some other strategy must be employed.</p>\n\n<p>The absolute best time for breakouts is shortly after a pullback in the market, when stocks begin to recover quickly. You can see some explosive moves during these periods.</p>\n\n<p><strong>How do you deal with breakouts that have gapped up in premarket?</strong></p>\n\n<p>Those are more difficult. It all depends on the price action. If something has gapped up huge in premarket, I will generally just pass on it. But if something is just starting to break out in premarket, I will look to enter. The exact percentage is difficult to say unfortunately, but anything up more than 10% is usually a pass for me.</p>\n\n<p>If I do enter premarket gappers, I won&#39;t enter immediately on open. I&#39;ll give it one to five minutes to watch the price action. If the price is stalling or dropping at open I won&#39;t buy it. But if it is showing strong volume and rising, that is what I want to see for a buy.</p>\n\n<p><strong>Can this strategy be done with options instead of shares?</strong></p>\n\n<p>It is possible, but I wouldn&#39;t recommend it, especially to start. Breakouts have a high failure rate, and options are very unforgiving to failed trades. If you do decide to use options, I would suggest being much more aggressive with your profit taking, perhaps even selling same day on a breakout. Since this is a swing trading strategy, you can go quite short dated on the expiration, around one month dated should be fine unless you want to try for a bigger move or gamble with even shorter expiry.</p>\n\n<p><strong>What do you set your stop losses at?</strong></p>\n\n<p>Already explained above. First day, the lows of the day. Second day, cost basis. After that, use 10 day SMA as a trailing soft stop.</p>\n\n<p><strong>When do you take profits?</strong></p>\n\n<p>Already explained above. Take quarter to half profits after first big run up, usually around 3 to 5 days. Then use the 10 SMA as a soft trailing stop.</p>\n\n<p><strong>What if the stock gaps down hard overnight? My stop won&#39;t protect me from that!</strong></p>\n\n<p>This is true. The only way to avoid overnight risk is to be a pure day trader and to never hold overnight. Personally I find swing trading to be far more profitable, since the big moves take days to play out. Swing trading also gives you much more time and freedom to live your life, since you can simply hold a winning position for days or even weeks, and don&#39;t have to sit and stare at a screen all day long to make money.</p>\n\n<p>Stocks gapping down big overnight is actually quite rare, but eventually you will experience it. But, let&#39;s do the math. Let&#39;s say you put 10% of your account into a stock, and some news comes out and it tanks a whopping 30% overnight. As a percentage of your account, that is 10% * 30%, or 3% of your account. Definitely not good, of course. But you aren&#39;t going to go broke losing 3% of your account. It can be overcome with time and good trading. This is just part of the risk of being a trader.</p>\n\n<p><strong>I am curious if you handle &quot;memestocks&quot; or other very popular stocks differently. I hear a lot of people say these stocks don&#39;t act rationally. Do you take more/less risk with stocks like this?</strong></p>\n\n<p>Yes, meme stocks often have much more support and move stronger than most other stocks. For this reason I usually have more conviction to trade them, so I will put on a bit more size or even slightly anticipate the breakouts. But I don&#39;t trade meme stocks just because they are meme stocks, they must fit the criteria and patterns described above.</p>\n\n<p>Meme stocks represent opportunities for massive gains and so you should take a bit more risk with them. If you got in GME early, which I did, you can make life changing money.</p>\n\n<p>Unfortunately today you&#39;ve got too many people trying to pump too many names and everybody ends up diluting each other. It&#39;s not like a few months back when the names were much more consolidated.</p>\n\n<p><strong>Do you use any fundamentals in your trading?</strong></p>\n\n<p>None. My trading horizon is too short for fundamentals to make any difference in the price action. Fundamentals only make a difference for long term investors. If you are a short term trader, you don&#39;t need to worry about fundamentals at all imo.</p>\n\n<p>&#x200B;</p>\n\n<h1>Additional Resources</h1>\n\n<p>I was going to offer several links here, but don&#39;t want to break any rules... Educational Material, Screenshots and Charts, and a Live Trade Log can all be found in my submission history.</p>\n\n<p>Thanks for reading, and good luck in the market.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "om6fsb",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "OptionsTrader14",
  "discussion_type": null,
  "num_comments": 334,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/om6fsb/trade_like_a_professional_breakout_swing_trading/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/om6fsb/trade_like_a_professional_breakout_swing_trading/",
  "subreddit_subscribers": 10675119,
  "created_utc": 1626558102,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1626535845,
  "the_new_excerpt": "INTRODUCTION\n\nLet me just preface this by saying this post is for those who take trading\nseriously, who harbor real hopes of earning a steady income in the market. This\npost is going to be long, and it is going to demand work from you to both\nunderstand and attempt to emulate. But that work will be",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\n\n\n\n\n...",
      "title": " 4k100"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\n\n\n\n\n...",
      "title": "4100"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\n\n\n\n\n...",
      "title": "4100"
    }
  ],
  "source_updated_at": 1627033383239
}