{
  "author": "badbicth06",
  "original_created_utc": 1651260064,
  "title": "Is my art project offensive?",
  "created_utc": 1651269995,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I will absolutely die if anyone from my class sees this but here it goes.&lt;/p&gt;\n\n&lt;p&gt;I’m making an art project for class. I’m making these fake cakes (using spackle, foam, and cardboard) that spell out the word “starve”. It looks like a vintage cake and it’s pink and red.&lt;/p&gt;\n\n&lt;p&gt;A person in my class said that it might be offensive to those with eating disorders and maybe I should change it.&lt;/p&gt;\n\n&lt;p&gt;However, my art project is satire. I’m not telling anybody to starve. It’s actually based off of Marie Antoinettes rumored-to-be-said-quote, “Let them eat cake”, during the French Revolution. So my project is essentially about starving the lower class. It looks very opulent, I have jewels and “rich” looking fabrics in the background to get that message across.&lt;/p&gt;\n\n&lt;p&gt;Also, I have an eating disorder. It’s binge eating disorder so I’m a fat and struggle to lose weight without going on binging sprees. So I feel like even if my project was about eating disorders, my perspective with binge eating could give context to the project regardless.&lt;/p&gt;\n\n&lt;p&gt;But idk as I don’t want to offend anyone in my class or build bad blood between them. They could also be my potential coworkers one day and don’t want to start off on the wrong foot so soon!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 146,
  "permalink": "/r/TooAfraidToAsk/comments/uetdyy/is_my_art_project_offensive/",
  "subreddit": "TooAfraidToAsk",
  "id": "uetdyy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I will absolutely die if anyone from my class sees this but here it goes.\n\nI’m making an art project for class. I’m making these fake cakes (using spackle,\nfoam, and cardboard) that spell out the word “starve”. It looks like a vintage\ncake and it’s pink and red.\n\nA person in my class said that it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "同級生に見られたら絶対死ぬけど、まあいいや。\n\n私は授業でアートプロジェクトを作成しています。フェイクケーキを作ってるんだ（スパックル、発泡スチロール、厚紙を使って）。\n\"starve \"と書かれたケーキを作りました。ヴィンテージケーキのようで\nピンクと赤のケーキです。\n\nクラスの人が言うには、それは...",
      "title": "私のアートプロジェクトは不快ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我班上的人看到这个，我绝对会死的，但在这里。\n\n我正在为班级做一个艺术项目。我在做这些假的蛋糕（用胶水、泡沫和纸板）。\n泡沫和纸板），拼出 \"饥饿 \"一词。它看起来像一个古老的\n蛋糕，而且是粉红色和红色。\n\n我班上的一个人说，它...",
      "title": "我的艺术项目是否具有攻击性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我班上的人看到這個，我絕對會死的，但在這裏。\n\n我正在爲班級做一個藝術項目。我在做這些假的蛋糕（用膠水、泡沫和紙板）。\n泡沫和紙板），拼出 \"飢餓 \"一詞。它看起來像一個古老的\n蛋糕，而且是粉紅色和紅色。\n\n我班上的一個人說，它...",
      "title": "我的藝術項目是否具有攻擊性？"
    }
  ]
}