{
  "author": "busterrulezzz",
  "original_created_utc": 1637958960,
  "title": "Markets are almost certainly overreacting to the new virus strain, here's why.",
  "created_utc": 1637966269,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today wasn&#39;t good, I&#39;m not gonna lie. But I absolutely think that the markets are overreacting right now, so I am buying the dip.</p>\n\n<p>Why do I stay bullish? I am convinced that this new virus strain will fade away just like all the others did before. Here&#39;s an excerpt from <em>The New York Times</em> :</p>\n\n<blockquote>\n<p>Still, even epidemiologists who have been the most outspoken in supporting precautions against the virus urged calm on Friday, noting that little is known about the variant and that <strong>several seemingly threatening variants have come and gone in recent months</strong>.  </p>\n\n<p>“Substantively NOTHING is known about the new variant,” Roberto Burioni, a leading Italian virologist, wrote on Twitter, adding that people should not panic.</p>\n</blockquote>\n\n<p>So, here you go, you don&#39;t have to believe me. Experts are saying not to panic, so I don&#39;t panic.</p>\n\n<p>We also have to remember where we are coming from. In March 2020, the whole world economy basically shut down for a month. We had no vaccines, no treatment pills, nothing. And yet, markets recovered so quickly that a lot of investors couldn&#39;t believe it. Why would a new strain be any different? Almost everyone is vaccinated, deaths are plunging, and the economy is in really, really good shape.</p>\n\n<p>That&#39;s why I think this dip is a major buying opportunity. In all likelihood, we will be back at 60k and 4.4k in the coming weeks. If you are a long-term holder, this is a very good entry point.</p>\n</div><!-- SC_ON -->",
  "score": 599,
  "permalink": "/r/CryptoCurrency/comments/r2w7lc/markets_are_almost_certainly_overreacting_to_the/",
  "subreddit": "CryptoCurrency",
  "id": "r2w7lc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Today wasn't good, I'm not gonna lie. But I absolutely think that the markets\nare overreacting right now, so I am buying the dip.\n\nWhy do I stay bullish? I am convinced that this new virus strain will fade away\njust like all the others did before. Here's an excerpt from The New York Times :\n\n>…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は正直言って良くなかった。しかし、市場は今、過剰反応していると思います。\n今の市場は過剰反応していると思うので、私はディップを買います。\n\nなぜ私が強気でいられるのか？この新種のウイルスは、これまでの他のウイルスと同様に消えていくと確信しています。\n確信しているからです。ニューヨーク・タイムズ紙からの抜粋です。\n\n>...",
      "title": "市場は新種のウイルスに過剰反応していると思われますが、その理由は以下の通りです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天不是很好，我不会撒谎。但我绝对认为，市场\n现在反应过度，所以我买入了下跌的股票。\n\n我为什么保持看涨？我相信这种新的病毒株会逐渐消失\n就像以前所有其他的病毒一样。以下是《纽约时报》的一段摘录。\n\n>...",
      "title": "市场几乎肯定对新的病毒株反应过度了，原因就在这里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天不是很好，我不會撒謊。但我絕對認爲，市場\n現在反應過度，所以我買入了下跌的股票。\n\n我爲什麼保持看漲？我相信這種新的病毒株會逐漸消失\n就像以前所有其他的病毒一樣。以下是《紐約時報》的一段摘錄。\n\n>...",
      "title": "市場幾乎肯定對新的病毒株反應過度了，原因就在這裏。"
    }
  ]
}