{
  "author": "schenk1414",
  "original_created_utc": 1625537557,
  "title": "Can I hire somebody to be my parents?",
  "created_utc": 1625549526,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Long story short I was orphaned at 12 and I’m now 18 and getting absolutely fucked by adulting stuff. What occupation would be able to help me with all this? All I know how to do is make money on the internet so how can I use that to pay someone to help me get a state ID/drivers school/drivers license/sign up for college/bank account/credit card/deal with drug problems/therapy/and a bunch of other bullshit that I don’t know how to deal with. Sorry for the rant I’m just getting fucked by adult life right now and have nobody to get help from.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/oell3q/can_i_hire_somebody_to_be_my_parents/",
  "subreddit": "NoStupidQuestions",
  "id": "oell3q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Long story short I was orphaned at 12 and I’m now 18 and getting absolutely\nfucked by adulting stuff. What occupation would be able to help me with all\nthis? All I know how to do is make money on the internet so how can I use that\nto pay someone to help me get a state ID/drivers school/drivers…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単に言うと、僕は12歳で孤児になり、今は18歳で、大人の事情で完全にやられています。\n大人の事情に翻弄されています。このような場合、どのような職業が私を助けてくれるのでしょうか？\nのか？私が知っているのはインターネットでお金を稼ぐ方法だけです。\n誰かにお金を払って身分証明書や運転免許証の取得を手伝ってもらうには...。",
      "title": "誰かを雇って自分の親になってもらうことはできますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "长话短说，我12岁就成了孤儿，现在18岁了，完全被成人化的东西搞得一团糟。\n被成人化的东西搞得一团糟。什么职业能够帮助我解决这些问题？\n这一切？我所知道的就是在互联网上赚钱，所以我怎么能用这些钱\n付钱给别人帮我办理州身份证/驾驶学校/驾驶......",
      "title": "我可以雇佣别人来做我的父母吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長話短說，我12歲就成了孤兒，現在18歲了，完全被成人化的東西搞得一團糟。\n被成人化的東西搞得一團糟。什麼職業能夠幫助我解決這些問題？\n這一切？我所知道的就是在互聯網上賺錢，所以我怎麼能用這些錢\n付錢給別人幫我辦理州身份證/駕駛學校/駕駛......",
      "title": "我可以僱傭別人來做我的父母嗎？"
    }
  ]
}