{
  "author": "i_got_banned_by_hhcj",
  "original_created_utc": 1635711700,
  "title": "How did we as a society decide that toilet paper is the best solution to cleaning your butt?",
  "created_utc": 1635781660,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know this is somewhat specific to the U.S., but In my opinion, it’s one of the most disgusting and archaic things we collectively do. </p>\n\n<p>Personally, I usually just go straight to the shower after I shit to because I think it’s a lot more hygienic. I know that it’s not like the most disgusting thing ever, but I think it’s kind of weird that we have shit on our asses,  and then use a piece of paper to clean it off. That’s like accidentally getting dog shit on your hand and then using a paper towel to wipe it off. A wet wipe is a far more elegant solution, but that’s almost never seen, and they can’t even be flushed. I know bidets exist, but they’re not really prevalent in America.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/qjxvhr/how_did_we_as_a_society_decide_that_toilet_paper/",
  "subreddit": "NoStupidQuestions",
  "id": "qjxvhr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know this is somewhat specific to the U.S., but In my opinion, it’s one of the\nmost disgusting and archaic things we collectively do.\n\nPersonally, I usually just go straight to the shower after I shit to because I\nthink it’s a lot more hygienic. I know that it’s not like the most disgusting\nthing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは米国に限ったことではありますが、私の考えでは、私たちが集団で行っていることの中で、最も嫌で古臭いことのひとつです。\n私たちが一般的に行っていることの中で、最も嫌悪感を抱く古風なもののひとつです。\n\n個人的には、糞をした後はシャワーに直行します。\nその方がより衛生的だと思うからです。最も嫌なことではないことはわかっています。\nことではないと思いますが...。",
      "title": "なぜ、トイレットペーパーがお尻をきれいにするのに最適なソリューションだと社会が判断したのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这在某种程度上是针对美国的，但在我看来，这是一个最令人厌恶的问题。\n但在我看来，这是我们集体做的最恶心、最陈旧的事情之一。\n\n就我个人而言，我通常在拉完屎后就直接去洗澡，因为我认为这样做更卫生。\n因为我认为这样做更卫生。我知道这不是最令人厌恶的事。\n的事情......。",
      "title": "我们这个社会是如何决定卫生纸是清洁屁股的最佳解决方案的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這在某種程度上是針對美國的，但在我看來，這是一個最令人厭惡的問題。\n但在我看來，這是我們集體做的最噁心、最陳舊的事情之一。\n\n就我個人而言，我通常在拉完屎後就直接去洗澡，因爲我認爲這樣做更衛生。\n因爲我認爲這樣做更衛生。我知道這不是最令人厭惡的事。\n的事情......。",
      "title": "我們這個社會是如何決定衛生紙是清潔屁股的最佳解決方案的？"
    }
  ]
}