{
  "author": "Cryptorealmoneyman",
  "original_created_utc": 1634805634,
  "title": "Had a no-coiner tell me that BTC is not \"real money\" and to \"enjoy the bitcoin stuff while it lasts, because the US Government will ban bitcoin soon and you'll be out a fortune wishing you would have cashed your BTC in to USD.\"",
  "created_utc": 1634826900,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Had a no-coiner tell me that BTC is not &quot;real money&quot; and &quot;you need to get your Bitcoin turned in to real money before it&#39;s too late,&quot; oh...and to &quot;enjoy the bitcoin stuff while it lasts, because the US Government will ban bitcoin soon and you&#39;ll be out a fortune wishing you would have cashed your BTC in to USD.&quot; Of course, I&#39;m hodling and ignoring the no-coiner advice like always lol. </p>\n\n<p>Still, I think it&#39;s good to understand the opponents of BTC in order to help them. This specific no-coiner just will not buy BTC because they insist it&#39;s not &quot;real money.&quot; Maybe they shouldn&#39;t? It really seems the saying is true &quot;you buy bitcoin at the price you deserve&quot; basically lol. </p>\n\n<p>I know the US talks about &quot;regulating&quot; bitcoin, but do we really think they can ban it? </p>\n\n<p>When they have different opinions than you do about BTC, how do you deal with no-coiners and how do you deal with the people who say &quot;bitcoin is not real money?&quot; </p>\n\n<p>Bitcoin is real money! Surely other bitcoiners understand lol.</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/Bitcoin/comments/qcnbe0/had_a_nocoiner_tell_me_that_btc_is_not_real_money/",
  "subreddit": "Bitcoin",
  "id": "qcnbe0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Had a no-coiner tell me that BTC is not \"real money\" and \"you need to get your\nBitcoin turned in to real money before it's too late,\" oh...and to \"enjoy the\nbitcoin stuff while it lasts, because the US Government will ban bitcoin soon\nand you'll be out a fortune wishing you would have cashed your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCは「本当のお金」ではないとノーコイナーに言われ、「あなたは自分の\n手遅れになる前に、ビットコインを本物のお金に変えなければならない」と言われました。\nアメリカ政府はすぐにビットコインを禁止するだろうから、今のうちにビットコインを楽しんでおけ。\nそして、「今のうちにビットコインを楽しんでおけば、アメリカ政府はすぐにビットコインを禁止し、あなたは大金を手にすることになるだろう。",
      "title": "BTCは「本当のお金」ではないので、「今のうちにビットコインを楽しんでおけば、アメリカ政府がすぐにビットコインを禁止して、BTCを米ドルに換金しておけばよかったと思って大損することになるから」と言っていた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一个没有钱的人告诉我，BTC不是 \"真钱\"，\"你需要把你的\n你需要把你的比特币变成真正的钱，否则就太晚了，\"哦......还有 \"趁着比特币还在，享受一下\n因为美国政府很快就会禁止比特币。\n你将会失去一大笔钱，希望你能兑现你的...",
      "title": "有一个没有钱的人告诉我，BTC不是 \"真正的钱\"，并且 \"在它持续的时候享受比特币的东西，因为美国政府很快就会禁止比特币，你会失去一大笔钱，希望你把BTC兑现成美元。\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一個沒有錢的人告訴我，BTC不是 \"真錢\"，\"你需要把你的\n你需要把你的比特幣變成真正的錢，否則就太晚了，\"哦......還有 \"趁着比特幣還在，享受一下\n因爲美國政府很快就會禁止比特幣。\n你將會失去一大筆錢，希望你能兌現你的...",
      "title": "有一個沒有錢的人告訴我，BTC不是 \"真正的錢\"，並且 \"在它持續的時候享受比特幣的東西，因爲美國政府很快就會禁止比特幣，你會失去一大筆錢，希望你把BTC兌現成美元。\""
    }
  ]
}