{
  "author": "TNGSystems",
  "original_created_utc": 1638407618,
  "title": "History repeats itself: Another high-ranking Safemoon official slinks out the back door, price goes through the floor.",
  "created_utc": 1638423060,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is becoming cyclical. Scummy tactics from Safemoon Developer revealed, Safemoon Developer leaves, price dumps. My schadenfreude of this is finite and it seems like the remaining Safemoon faithful are just exhausted investors, desperately waiting for the drama to end. In a sense I&amp;#39;ve had quite the journey myself - having gone from disinterest, to skepticism, to opposition, to derision and now here, to pity. Now I just want people who have invested to not lose everything.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;So what drama are Safemooners wishing was behind them?&lt;/em&gt; I&amp;#39;ve happily logged the version of events as I understand them in several exciting posts here:  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;///////Part 1:&lt;/strong&gt; &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p0i6kr/safemoons_performance_of_mental_gymnastics_in_the/\"&gt;Safemoon&amp;#39;s performance of Mental Gymnastics in the Tokyo 2020 Olympics has been simply stunning. They deserve every Gold they&amp;#39;ve been given.&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;///////Part 2 &amp;amp;&lt;sup&gt;1/2:&lt;/sup&gt;&lt;/strong&gt; &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pdjxnb/safemoon_has_been_exploited_from_day_1_and/\"&gt;Safemoon has been exploited from day 1 and $68,460,000 have been siphoned out of the liquidity pool. This gets auto-deleted from their sub. Explanation in comments&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;///////Part 33 &amp;amp;&lt;sup&gt;1/3:&lt;/sup&gt;&lt;/strong&gt; &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/plait6/last_call_for_safemoon_the_curtains_are_drawing/\"&gt;Last call for Safemoon. The curtains are drawing on this omnishambles of a project.&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;///////Part 44 &amp;amp;&lt;sup&gt;1/4:&lt;/sup&gt;&lt;/strong&gt; &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pridd2/like_rats_fleeing_a_sinking_ship_safemoons_core/\"&gt;Like rats fleeing a sinking ship, Safemoon&amp;#39;s core developers peel away one by one as the price plummets and one single question remains unanswered - WHERE IS THE MONEY GOING?&lt;/a&gt;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;I&amp;#39;d like to start this chapter off with probably one of the more powerful quotes the legend Carl Sagan has ever uttered  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;“One of the saddest lessons of history is this: If we’ve been bamboozled long enough, we tend to reject any evidence of the bamboozle. We’re no longer interested in finding out the truth. The bamboozle has captured us. It’s simply too painful to acknowledge, even to ourselves, that we’ve been taken. Once you give a charlatan power over you, you almost never get it back.”&lt;/strong&gt;  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;And now I&amp;#39;d like to introduce Thomas Smith. The man they call &amp;quot;Papa&amp;quot;. I wish I was making that up.  &lt;/p&gt;\n\n&lt;p&gt;He is a self-proclaimed Wizard. A blockchain guru. A master of the arts. And what is his body of work? According to his LinkedIn, it&amp;#39;s about a decade of dead or defunct companies where he is listed as CTO or Chief Blockchain Officer. Despite such an... &lt;em&gt;impressive&lt;/em&gt;... resume, he doesn&amp;#39;t ever have the ability to point to anything and say &amp;quot;I made that, this is evidence of my work&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;Yet that did not stop the community elevating him to cult-leader status. Hero worshipping him. One of his claims to fame was that he had a hand in building Dogecoin. His adoration amongst Safemooners was almost unanimous if not for a couple slip ups here and there...  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Despite claims of helping to &amp;quot;build Doge&amp;quot; (i.e, helping to develop it) it turns out that Thomas was nothing more than a &lt;em&gt;Facebook moderator&lt;/em&gt; for a Dogecoin fan page.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It was found that Thomas was responsible for the &amp;#39;mysterious&amp;#39; hints and secret messages played out over Twitter for months. &amp;quot;Hoot hoot!&amp;quot; &amp;quot;Yeet yeet!&amp;quot; owl emojis, etc. Lots of people speculated on all the wondrous things it could be, in the end, it was revealed by a former disgruntled member of the moderation team that it was all an inside joke - because Thomas saw two Owls mating on the tree outside his window. He was happy to string along one million Safemooners on Twitter for a private joke amongst himself and some other Safemoon officials. When this came out, some of the Safemoon community certainly felt disrespected and I don&amp;#39;t blame them. Two Owls fucking is hilarious to Thomas and a good opportunity to convince 1 million Safemoon followers something big was coming. Pun intended.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;On Discord, someone stated that Thomas turned down a $2,000,000 job offer from Ripple. &lt;a href=\"https://preview.redd.it/4exo3so9ujl71.jpg?width=640&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=cd19d844a76a7c0bcb95eb941f6053b79b25e1a8\"&gt;Thomas responded &amp;quot;Truth&amp;quot;&lt;/a&gt; - I don&amp;#39;t know about you, but to me that implies that Ripple wanted Thomas to work for them so badly, they offered him $2,000,000 - and he&amp;#39;s so cool, like the James Bond of coding, that he turned it down. As they say, truth is stranger than fiction. &lt;a href=\"https://np.reddit.com/r/SafeMoonInvesting/comments/pi160q/papa_just_got_destroyed_on_twitter_by_the_xrps/\"&gt;Follow this link to get all the juicy details written up by an excellent Safemoon commentator Elias.&lt;/a&gt; - In summary though, Thomas received a generic headhunter mass-email letter, where he replied and stated it didn&amp;#39;t go further. The director of technology at Ripple stated that not only had he never heard of Thomas Smith, but finds it odd that he would claim Ripple offered him a job (let alone $2m) &lt;strong&gt;when he doesn&amp;#39;t even use the same programming language that Ripple uses&lt;/strong&gt;.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Those three events caused quite a sizable chink in Thomas&amp;#39; impenetrable fanboy armour, which laid the foundation of what&amp;#39;s to come. &lt;/p&gt;\n\n&lt;p&gt;For the past few months, some excellent blockchain analysts as well as a former Discord moderator by the name of Ginger have been picking up the shady dealings within the Safemoon sphere of influence. Don&amp;#39;t get me wrong - this post doesn&amp;#39;t endorse or give Ginger a free pass as he has his own share of bullshit drama. But the long and short of it is, Thomas was supposed to be working hard on the Safemoon wallet (subject of a couple of my posts) - instead, he was working on his own token called &lt;strong&gt;Piggy&lt;/strong&gt;, &lt;strong&gt;Nobility&lt;/strong&gt;, and &lt;strong&gt;NFA - (Not Financial Advice)&lt;/strong&gt; which, in a leaked Discord audio, one of the former Safemoon developers claimed:  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But yeah ah, so the goal is: Piggy will make you wealthy. Our next project will make all of you and all of your families filthy rich  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The wallet was released and clearly some kind of clone of Trust Wallet made by a bunch of idiots on Fiverr. Disaster, so Thomas was responsible, but couldn&amp;#39;t be fired because of his cult-leader status amongst the community. What happens? Well, he&amp;#39;s relegated to the background, to &amp;quot;Work on the new Blockchain&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;Apparently he couldn&amp;#39;t help himself, and was on Twitter a couple weeks ago shilling &lt;strong&gt;&lt;em&gt;YET ANOTHER&lt;/em&gt;&lt;/strong&gt; token and I reckon it&amp;#39;s that which got him booted from the team.  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/z8uw8zp5xc181.jpg?width=768&amp;amp;auto=webp&amp;amp;s=bed2b3147094221efcf5623d4c50c4a0961379c5\"&gt;Safemoon put out some garbage statement saying &amp;quot;His work is done&amp;quot;&lt;/a&gt; and Thomas left. Well well well.  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h1&gt;NOW THINGS GET JUICY&lt;/h1&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Safemoon price has been in stasis for a while, kinda floundering, not much going on.  &lt;/p&gt;\n\n&lt;p&gt;Thomas left and it had a minimal impact on price. He then has a live debate with that former disgruntled Mod, Ginger, on Twitter Spaces. He came out considerably worse for wear, spluttering, chuckling to himself and generally unable to back up any of his points nor refute Ginger&amp;#39;s arguments. And the next day?  &lt;/p&gt;\n\n&lt;p&gt;All of a sudden, a pre-sale wallet wakes up with $60,000,000 in tokens stored in them, &lt;a href=\"https://bscscan.com/token/0x8076c74c5e3f5852037f31ff0093eeb8c8add8d3?a=0xeb783789280a2c4c1940f8755aeccb558a4ff581\"&gt;and immediately market sells $10,000,000 worth&lt;/a&gt;, sending the price down 24% and still dropping.  &lt;/p&gt;\n\n&lt;p&gt;For me, it&amp;#39;s just too coincidental. From insider developers already operational in &amp;quot;Sell early tokens to friends and families to make them rich off everyone else&amp;quot;, Thomas&amp;#39; links to these developers, his contributions to their project, and now a Safemoon early sale wallet, long speculated to belong to Safemoon devs, friends and families&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;It does feel like I&amp;#39;m going round in circles, and for everyone else observing. I have absolutely no doubt this dip will be gladly eaten up by the poor community, desperate for it to be &amp;quot;The last one before the ship rockets off to the Moon&amp;quot; but when I look out at the Safemoon community I see a sea of exhausted bagholders, not starry-eyed investors. Another charlatan has been removed, but his power sadly remains.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/QYRf58b_kJKpojnPN3kgxR9jlaGu8_ZU4b_J-1fhzlc.jpg?auto=webp&amp;s=7fb7a6ba5265dc4aaf5272d6c66ce17291402d6d",
          "width": 640,
          "height": 546
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/QYRf58b_kJKpojnPN3kgxR9jlaGu8_ZU4b_J-1fhzlc.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=4bf497dc7f7468a836a543ca6b9a00f036ebb87b",
            "width": 108,
            "height": 92
          },
          {
            "url": "https://external-preview.redd.it/QYRf58b_kJKpojnPN3kgxR9jlaGu8_ZU4b_J-1fhzlc.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=55906ea881231370d9fca1a44777531b8e522357",
            "width": 216,
            "height": 184
          },
          {
            "url": "https://external-preview.redd.it/QYRf58b_kJKpojnPN3kgxR9jlaGu8_ZU4b_J-1fhzlc.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=da22e67463e8bd54657be258700e9fb42d6ec2a0",
            "width": 320,
            "height": 273
          },
          {
            "url": "https://external-preview.redd.it/QYRf58b_kJKpojnPN3kgxR9jlaGu8_ZU4b_J-1fhzlc.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=cab518c44fc3a7c6ad791f3c5dff3ec10674c1ee",
            "width": 640,
            "height": 546
          }
        ],
        "variants": {},
        "id": "ePbKiAdPITzRyv6JcINk4dbcRh4MdlV7uMTCkanmNlY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r6utx4/history_repeats_itself_another_highranking/",
  "subreddit": "CryptoCurrency",
  "id": "r6utx4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is becoming cyclical. Scummy tactics from Safemoon Developer revealed,\nSafemoon Developer leaves, price dumps. My schadenfreude of this is finite and\nit seems like the remaining Safemoon faithful are just exhausted investors,\ndesperately waiting for the drama to end. In a sense I've had quite…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは周期的になってきています。Safemoonデベロッパーの卑劣な手口が明らかに。\nSafemoon開発者退社、価格ダダ下がり。これに対する私の悲喜こもごもは限りなく、そして\n残ったSafemoon信者は、疲れ果てた投資家という感じです。\nドラマが終わるのを必死で待っている。ある意味、私はかなり...",
      "title": "歴史は繰り返す。また、Safemoonの高官が裏口から出てきて、値段が床を突き破ってしまう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这正在成为一种周期性的现象。揭露了Safemoon开发者的卑劣手段。\nSafemoon开发者离开，价格下跌。我对这种情况的幸灾乐祸是有限的，而且\n似乎剩下的Safemoon的忠实用户只是疲惫的投资者。\n绝望地等待着这场戏的结束。从某种意义上说，我已经有了相当...",
      "title": "历史会重演。另一位高级Safemoon官员从后门溜走，价格穿过地板。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這正在成爲一種週期性的現象。揭露了Safemoon開發者的卑劣手段。\nSafemoon開發者離開，價格下跌。我對這種情況的幸災樂禍是有限的，而且\n似乎剩下的Safemoon的忠實用戶只是疲憊的投資者。\n絕望地等待着這場戲的結束。從某種意義上說，我已經有了相當...",
      "title": "歷史會重演。另一位高級Safemoon官員從後門溜走，價格穿過地板。"
    }
  ]
}