{
  "author": "tellg1291",
  "the_new_excerpt": "SANTA CLARA, Calif., April 20, 2021  Marvell Technology, Inc. (NASDAQ: MRVL), a\nleader in data infrastructure semiconductor solutions today announced the\ncompletion of its acquisition of Inphi Corporation. The combination creates a\nU.S. semiconductor powerhouse positioned for end-to-end technology…",
  "original_created_utc": 1619016636,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カリフォルニア州サンタクララ、2021年4月20日 マーベル・テクノロジー社（Marvell Technology, Inc. (NASDAQ: MRVL)は\nデータインフラ半導体ソリューションのリーダーであるマーベル・テクノロジー社（NASDAQ：MRVL）は本日、Inphi Corporationの買収完了を発表しました。\n買収を完了しました。この統合により\n今回の買収により、米国の半導体企業は、エンド・ツー・エンドの技術を提供することができるようになります。",
      "title": "Marvell社がInphi社を100億ドルで買収し、米国の半導体セクターが強化される"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加利福尼亚州圣克拉拉市，2021年4月20日 Marvell Technology, Inc. (NASDAQ: MRVL)，数据基础设施半导体解决方案的领导者，今天宣布\n今天宣布完成对Inphi公司的收购。\n今天宣布完成了对Inphi公司的收购。此次合并创造了一个\n美国半导体强国，定位于端到端技术...",
      "title": "美国半导体行业得到加强，Marvell公司以100亿美元完成了对Inphi的收购。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加利福尼亞州聖克拉拉市，2021年4月20日 Marvell Technology, Inc. (NASDAQ: MRVL)，數據基礎設施半導體解決方案的領導者，今天宣佈\n今天宣佈完成對Inphi公司的收購。\n今天宣佈完成了對Inphi公司的收購。此次合併創造了一個\n美國半導體強國，定位於端到端技術...",
      "title": "美國半導體行業得到加強，Marvell公司以100億美元完成了對Inphi的收購。"
    }
  ],
  "title": "The US semiconductor sector gets reinforced with Marvell completing the acquisition of Inphi for $10B",
  "created_utc": 1619044321,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>SANTA CLARA, Calif., April 20, 2021 \nMarvell Technology, Inc. (NASDAQ: MRVL), a leader in data infrastructure semiconductor solutions today announced the completion of its acquisition of Inphi Corporation. The combination creates a U.S. semiconductor powerhouse positioned for end-to-end technology leadership in data infrastructure.</p>\n\n<p>The combined company, Marvell Technology, Inc. (&quot;Marvell&quot;), is a Delaware corporation domiciled in the United States.\n&quot;I am excited to welcome the Inphi team to Marvell and look forward to realizing the tremendous value creation potential of this combination for our customers, employees and shareholders. Together we will have the portfolio, capabilities, and scale to expand Marvell&#39;s leadership in its key growth end markets of 5G, Cloud and Automotive,&quot; said Matt Murphy, president and CEO of Marvell. &quot;I am also pleased that we are now organized as a U.S. company and we look forward to continuing to drive innovation in semiconductor technology critical to the nation&#39;s data economy.&quot;</p>\n\n<p>Appointment of New Director to Marvell&#39;s Board of Directors\nMarvell also announced that Dr. Ford Tamer has been appointed to the Board of Directors of Marvell, effective immediately upon close of the acquisition.\nDr. Ford Tamer served as Inphi&#39;s President and Chief Executive Officer for more than nine years. Under Dr. Tamer&#39;s stewardship, Inphi became the trusted market leader for electro-optics solutions for cloud and telecom operators, increasing revenue from these customers more than 20 times during his tenure, to a run rate of about $750 million.</p>\n\n<p>Prior to Inphi, Dr. Tamer served as CEO of Telegent Systems. Previous to this, he was Senior Vice President and General Manager of Broadcom&#39;s Infrastructure Networking Group, which he grew 5-fold to $1.2 billion in revenue within five years, making that business the uncontested leader in infrastructure silicon solutions. He also served as co-founder and CEO of Agere Inc., which pioneered Network Processors (now at Intel as the Ixia product line). After Agere was acquired by Lucent Microelectronics, Dr. Tamer became Vice President at Agere Systems, a spin-off from Lucent. Earlier in his career, Dr. Tamer co-founded, operated and assisted in the growth of system management software, artificial intelligence, and renewable energy businesses.\nDr. Tamer holds an M.S. and Ph.D. in Engineering from MIT.</p>\n\n<p>Contribution from Inphi to Marvell&#39;s First Quarter of Fiscal 2022\nDuring its fiscal first quarter 2022 earnings conference call, Marvell will provide an update on Inphi&#39;s contribution to its first fiscal quarter results.\nFirst Fiscal Quarter 2022 Earnings Conference Call\nMarvell will conduct a conference call on Monday, June 7, 2021 at 1:45 p.m. Pacific Time to discuss results for the first quarter of fiscal 2022. Interested parties may join the conference call by dialing 1-888-317-6003 or 1-412-317-6061, pass-code 9153389. The call will be webcast and can be accessed at the Marvell Investor Relations website at <a href=\"http://investor.marvell.com/%C2%A0with\">http://investor.marvell.com/ with</a> a replay available following the call until Monday, June 14, 2021.</p>\n\n<p>About Marvell\nTo deliver the data infrastructure technology that connects the world, we&#39;re building solutions on the most powerful foundation: our partnerships with our customers. Trusted by the world&#39;s leading technology companies for 25 years, we move, store, process and secure the world&#39;s data with semiconductor solutions designed for our customers&#39; current needs and future ambitions. Through a process of deep collaboration and transparency, we&#39;re ultimately changing the way tomorrow&#39;s enterprise, cloud, automotive, and carrier architectures transform—for the better.\nMarvell and the M logo are registered trademarks of Marvell and/or its affiliates in the United States and/or elsewhere. Other names and brands may be claimed as the property of others.</p>\n\n<p>Source:\n<a href=\"https://finance.yahoo.com/news/marvell-completes-acquisition-inphi-200300389.html\">https://finance.yahoo.com/news/marvell-completes-acquisition-inphi-200300389.html</a></p>\n</div><!-- SC_ON -->",
  "score": 76,
  "permalink": "/r/investing/comments/mvhbxg/the_us_semiconductor_sector_gets_reinforced_with/",
  "subreddit": "investing",
  "id": "mvhbxg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526061
}