{
  "author": "Jxntb733",
  "original_created_utc": 1642603675,
  "title": "Why Wall Street Attempts to Suppress Bitcoin Price will Ultimately Backfire and Favor Diamond Handed Hodlers (I tried to simplify it - this is important!)",
  "created_utc": 1642646266,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;WallStreet owns, operates, and controls all the clearing houses that trade gold (&lt;em&gt;financial institutions that exchange payments, securities, or derivatives&lt;/em&gt;). There are more WallStreet paper claims to gold (&lt;em&gt;future contacts and whatnot&lt;/em&gt;) than actual gold, so WallStreet and central banks just &amp;#39;&lt;em&gt;trade/swap&lt;/em&gt;&amp;#39; these claims back and forth with each other all buddy buddy. WallStreet controls most of the actual gold in the world, not individuals with the paper claims.&lt;/p&gt;\n\n&lt;p&gt;Similarly, &lt;strong&gt;there are more paper claims to Bitcoin than actually Bitcoin thanks to leverage, margins, futures trading, and ETFs; WallStreet is applying their same debt-based paper system to the equity based (real value) crypto asset Bitcoin as they do to suppress gold price.&lt;/strong&gt; So for every Bitcoin on the block chain, 10, 50, 100 people could have a &amp;#39;claim&amp;#39; to that Bitcoin. Legit the 0.01btc I look at on my CoinBase could be the &amp;#39;same&amp;#39; one you look at due to lack of CEX transparency and oversight of their lending practices! This means there is an artificially larger supply of Bitcoin in circulation; and we all know &lt;strong&gt;price is a supply and demand equation!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This means if there is truly that real demand in those 50-100 people who bought and are hodling that 0.01, if all that real demand is being met and satisfied with an artificially large supply, then &lt;strong&gt;the TRUE PRICE of Bitcoin should be much much higher!&lt;/strong&gt; If there is a &amp;#39;run&amp;#39; on Bitcoin (consumers increase purchasing in fear of a shortage) there will not be enough Bitcoin on exchanges to fulfil demand, because most Bitcoin is stored in cold-wallets off of exchanges.&lt;/p&gt;\n\n&lt;p&gt;When someone creates an artificial supply of something like WallStreet has done with gold and is now doing with Bitcoin, &lt;strong&gt;THAT LEADS TO PRICE SUPPRESSION!&lt;/strong&gt; Imagine a run, we all sell our 0.01 btc, the CEXs will not have enough fiat to deliver and would desperately be trying to find collateral - that they couldn&amp;#39;t get - because it does not exist - and the price would skyrocket!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Let me explain again because it&amp;#39;s weird to wrap your head around.&lt;/strong&gt; When we take fiat to the spot market and bid at a suppressed price, at some point there will be no more Bitcoin left to bid on. So we bid higher and higher for this heavily demanded asset! As we bid higher, other HODLers become tempted to sell (wen Lambo? Now!) Bitcoin gets transferred from weak hands to diamond hands and spot price is driven up by the people who want real Bitcoin! If WallStreet wants to drive the price back down to the futures price, they&amp;#39;d have to initiate an arbitrage strategy with Bitcoin in reserve - but &lt;strong&gt;THEY HAVE NO BITCOIN LEFT!&lt;/strong&gt; They will only hold future paper contracts or fiat - causing the price to continuously get bid up higher!&lt;/p&gt;\n\n&lt;p&gt;This is why it&amp;#39;s so important to transfer your Bitcoin off of exchanges and into a cold storage wallet. The more Bitcoin is off exchanges the larger the short squeeze will be and the less fractional reserve practice bullshit can occur. They will not own the actual Bitcoin like they do the gold, &lt;strong&gt;WE WILL OWN IT.&lt;/strong&gt; &lt;strong&gt;Therefore this type of suppression is unsustainable, so buckle up.&lt;/strong&gt; Such activity also contributes to fiat inflation, which strengthens both the demand and awareness of Bitcoin itself!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/s7rq0f/why_wall_street_attempts_to_suppress_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "s7rq0f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "WallStreet owns, operates, and controls all the clearing houses that trade gold\n(financial institutions that exchange payments, securities, or derivatives).\nThere are more WallStreet paper claims to gold (future contacts and whatnot)\nthan actual gold, so WallStreet and central banks just…"
}