{
  "author": "mic_droo",
  "original_created_utc": 1645197139,
  "title": "You guys are sometimes doing the adult (?) version of \"if I can't see it, it doesn't exist\" about negative aspects of crypto and I think that kinda sucks",
  "created_utc": 1645209802,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Less than an hour ago, someone on here &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/svj6wk/bitcoin_miners_revived_a_dying_coal_plant_then/\"&gt;posted a story&lt;/a&gt; from the Guardian titled &amp;quot;Bitcoin miners revived a dying coal plant – then CO2 emissions soared&amp;quot;. It&amp;#39;s an interesting story, you should read it. Factual, well-informed reporting, as most articles are in the Guardian. Honestly, that article is more informative and interesting than 99% of the articles that usually get posted.&lt;/p&gt;\n\n&lt;p&gt;However: it highlights a negative aspect of crypto, or more specifically PoW/ Bitcoin, and shows that this &amp;quot;they exclusively use renewable energies, BTC is good for the environment!!&amp;quot; narrative is, of course, not true. For that reason, it received negative karma, with the first comments being stuff like &amp;quot;Typical crap to come out of the guardian&amp;quot; and just &amp;quot;Ffs&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;At the same time, &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/sviv3o/recent_survey_shows_83_of_millennial_millionaires/\"&gt;a post re-warming a dodgy survey from 2 months ago&lt;/a&gt; that was already posted 1000 times back then but is &amp;quot;bullish&amp;quot; for crypto gets 90% upvotes and voted to &amp;quot;hot&amp;quot; and nobody questions whether those numbers are true.&lt;/p&gt;\n\n&lt;p&gt;Come on guys. You can do better.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 697,
  "permalink": "/r/CryptoCurrency/comments/svk9r4/you_guys_are_sometimes_doing_the_adult_version_of/",
  "subreddit": "CryptoCurrency",
  "id": "svk9r4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Less than an hour ago, someone on here posted a story\n[https://np.reddit.com/r/CryptoCurrency/comments/svj6wk/bitcoin_miners_revived_a_dying_coal_plant_then/]\nfrom the Guardian titled \"Bitcoin miners revived a dying coal plant – then CO2\nemissions soared\". It's an interesting story, you should read…"
}