{
  "author": "tghGaz",
  "the_new_excerpt": "Yesterday you would get rained with downvotes for spreading FUD if you said\nanything negative. Today you get downvoted to hell for saying something\npositive. The sentiment here has switched overnight but it will pivot back again\nin an instant if things change direction again. Newbies should know…",
  "original_created_utc": 1614071573,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "昨天你要是说了，会被下注雨，因为你散布FUD。\n任何负面的东西。今天你说了一些话，就会被降权到地狱里去\n积极的。这里的情绪在一夜之间发生了转换，但它将再次回调\n如果事情再次改变方向，瞬间。新手应该知道...",
      "title": "这里的情绪变化太快了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天你要是說了，會被下注雨，因爲你散佈FUD。\n任何負面的東西。今天你說了一些話，就會被降權到地獄裏去\n積極的。這裏的情緒在一夜之間發生了轉換，但它將再次回調\n如果事情再次改變方向，瞬間。新手應該知道...",
      "title": "這裏的情緒變化太快了"
    }
  ],
  "title": "Crazy how fast the sentiment here can change",
  "created_utc": 1614094647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday you would get rained with downvotes for spreading FUD if you said anything negative.  Today you get downvoted to hell for saying something positive.  The sentiment here has switched overnight but it will pivot back again in an instant if things change direction again.  Newbies should know that upvoted comments/posts here are not a good basis for decisions as they tend to just reflect what is happening right now.</p>\n\n<p>There are clearly a lot of people selling right now and I feel for anybody who bought at the top.  That shit is stressful.  The way I see it there are 2 possibilities:</p>\n\n<ol>\n<li>The market is completely overextended and is crashing.  Say hello to a bear market for a few more years.</li>\n<li>People have been saying for over a month we need to retrace atleast 20% to find some stability.  Well this is it and a large dip like this right now is necessary for the bull market to continue.</li>\n</ol>\n\n<p>Nobody here knows for sure which of these is playing out and it is up to you personally to decide if you are comfortable with this.  Personally I planned to invest for 10+ years anyway and I&#39;ve made peace with either outcome right now.</p>\n</div><!-- SC_ON -->",
  "score": 277,
  "permalink": "/r/CryptoCurrency/comments/lqe3x2/crazy_how_fast_the_sentiment_here_can_change/",
  "subreddit": "CryptoCurrency",
  "id": "lqe3x2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880677
}