{
  "author": "Monster-Zero",
  "original_created_utc": 1630601810,
  "title": "How do lungs heal after quitting smoking, especially with regards to timelines and partial-quit?",
  "created_utc": 1630609358,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, just trying to get a sense of something here. If I&#39;m a smoker and I quit, the Internet tells me it takes 1 month for my lungs to start healing if I totally quit. I assume the lungs are healing bit by bit every day after quitting and it takes a month to rebuild lung health enough to categorize the lung as in-recovery. My question is, is my understanding correct?</p>\n\n<p>If that understanding is correct, if I reduce smoking to once a week will the cumulative effects of lung regeneration overcome smoke inhalation? To further explain my thought, let&#39;s assume I&#39;m starting with 0% lung health. If I don&#39;t smoke, the next day maybe my lung health is at 1%. After a week, I&#39;m at 7%. If I smoke on the last day, let&#39;s say I take an impact of 5%. Next day I&#39;m starting at 2%, then by the end of the week I&#39;m at 9%. Of course these numbers are made up nonsense, just trying to get a more concrete understanding (preferably gamified :)) .</p>\n\n<p>I&#39;m actually not a smoker, but I&#39;m just curious to how this whole process works. I assume it&#39;s akin to getting a wound, but maybe organ health works differently? I&#39;ve never been very good at biology or chemistry, so I&#39;m turning to you <a href=\"/r/askscience\">/r/askscience</a>!</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/askscience/comments/pglvry/how_do_lungs_heal_after_quitting_smoking/",
  "subreddit": "askscience",
  "id": "pglvry",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi all, just trying to get a sense of something here. If I'm a smoker and I\nquit, the Internet tells me it takes 1 month for my lungs to start healing if I\ntotally quit. I assume the lungs are healing bit by bit every day after quitting\nand it takes a month to rebuild lung health enough to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。ここで何かを感じ取ろうと思っています。もし私が喫煙者で、禁煙した場合\n肺が回復するには1ヶ月かかると言われています。\n完全に禁煙した場合、肺が回復し始めるまでに1ヶ月かかるとインターネットでは言われています。肺は禁煙後、毎日少しずつ回復していると思うのですが\n肺の健康を取り戻すのに1ヶ月かかるというのは...",
      "title": "禁煙後、肺はどのように回復するのか、特にタイムラインと部分禁煙について教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我只是想了解一下这里的情况。如果我是一个吸烟者，我\n戒烟，互联网告诉我，如果我完全戒掉，我的肺部需要1个月的时间才能开始愈合。\n完全戒掉。我想肺部在戒烟后每天都在一点一点地愈合。\n并且需要一个月的时间来重建肺部健康，足以...",
      "title": "戒烟后的肺部如何愈合，特别是在时间安排和部分戒烟方面？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我只是想了解一下這裏的情況。如果我是一個吸菸者，我\n戒菸，互聯網告訴我，如果我完全戒掉，我的肺部需要1個月的時間才能開始癒合。\n完全戒掉。我想肺部在戒菸後每天都在一點一點地癒合。\n並且需要一個月的時間來重建肺部健康，足以...",
      "title": "戒菸後的肺部如何癒合，特別是在時間安排和部分戒菸方面？"
    }
  ]
}