{
  "author": "mrmonster459",
  "original_created_utc": 1651062865,
  "title": "As a kid, I used to hear \"If you think teachers suck, just wait till you have a boss\" all the time. I'm 25 and never had a boss who'd even make my top 5 worst middle/high school teachers. Have I been lucky, or is that expression a load of bs?",
  "created_utc": 1651067270,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 25, been working since I was 19, and yet despite hearing that phrase repeatedly during my school years, I&amp;#39;ve never had a boss who would even come close to being as bad as my worst middle and high school teachers.&lt;/p&gt;\n\n&lt;p&gt;What gives? Have I just been very lucky, or is that phrase part of the &amp;quot;Lies adults tell kids&amp;quot; club?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/ud2ijh/as_a_kid_i_used_to_hear_if_you_think_teachers/",
  "subreddit": "NoStupidQuestions",
  "id": "ud2ijh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm 25, been working since I was 19, and yet despite hearing that phrase\nrepeatedly during my school years, I've never had a boss who would even come\nclose to being as bad as my worst middle and high school teachers.\n\nWhat gives? Have I just been very lucky, or is that phrase part of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は25歳で、19歳から働いていますが、その言葉を聞いているにもかかわらず\n学生時代に何度も聞いた言葉ですが、中学・高校の時の最悪な教師のような上司には\nこの言葉を学生時代に何度も聞いたにもかかわらず、中学・高校時代の最悪な教師に匹敵するような上司に出会ったことがないのです。\n\nなぜだろう？それとも、このフレーズは、私が幸運だっただけなのだろうか？",
      "title": "子供の頃、「教師が最低だと思うなら、上司を持つまで待て」とよく言われたものです。私は25歳ですが、中学・高校の教師でワースト5に入るような上司には一度もあったことがありません。私は幸運だったのだろうか、それともその表現はでたらめなのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年25岁，从19岁起就开始工作，尽管在上学期间反复听到这句话\n但是，尽管在我的学生时代反复听到这句话，我从来没有遇到过一个老板，他甚至接近于像我最糟糕的初中和高中老师那样糟糕。\n我从来没有遇到过像我最糟糕的初中和高中老师那样糟糕的老板。\n\n这是为什么呢？难道我只是非常幸运，还是这句话是我人生中的一部分？",
      "title": "小时候，我经常听到 \"如果你觉得老师很烂，那就等着当老板吧\"。我已经25岁了，从来没有一个老板，甚至可以列入我的前5名最差的初中/高中老师。是我运气好，还是这句话是一派胡言？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年25歲，從19歲起就開始工作，儘管在上學期間反覆聽到這句話\n但是，儘管在我的學生時代反覆聽到這句話，我從來沒有遇到過一個老闆，他甚至接近於像我最糟糕的初中和高中老師那樣糟糕。\n我從來沒有遇到過像我最糟糕的初中和高中老師那樣糟糕的老闆。\n\n這是爲什麼呢？難道我只是非常幸運，還是這句話是我人生中的一部分？",
      "title": "小時候，我經常聽到 \"如果你覺得老師很爛，那就等着當老闆吧\"。我已經25歲了，從來沒有一個老闆，甚至可以列入我的前5名最差的初中/高中老師。是我運氣好，還是這句話是一派胡言？"
    }
  ]
}