{
  "author": "Acceptable_Novel8200",
  "original_created_utc": 1640692226,
  "title": "If politicians failed to comply with a law,then $200 fine (which can be waived off) but if you failed to comply with new Crypto related provisions in Infrastructure bill then prison and fines for you!",
  "created_utc": 1640701999,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It came to light that 52 lawmakers failed to comply with the Stock Act, which aim to prohibit lawmakers insider trading,\nOn being asked, most of them citied clerical errors,oversights,inattentive accountants to report those trades.&lt;/p&gt;\n\n&lt;p&gt;The lawmakers who violate the Stock Act would have to pay fine of $200,which can be waived by House or Senate ethics officials.&lt;/p&gt;\n\n&lt;p&gt;In short, they are *making *millions by accessing the information they receive because of their position,which they got because of people and trade stocks based on that.&lt;/p&gt;\n\n&lt;p&gt;More importantly they are breaking a law and the consequences of doing that is just a fine of $200 and which can be easily waived off. &lt;/p&gt;\n\n&lt;p&gt;In Senate Proved infrastructure bill, &lt;/p&gt;\n\n&lt;p&gt;The Section 6050I &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Recipent of BTC (or other Cryptocurrencies) report the social, security number, sender&amp;#39;s name, birth date, address and profession for total \namounts &amp;gt;$10k from one entity.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Failure to do this would be a Felony, Also subject to fines.\nIf you failed to comply with it, then it&amp;#39;s your fault and nothing can justify that, you have to face the consequences. &lt;/p&gt;\n\n&lt;p&gt;Basically, they made a law to send you prison if you don&amp;#39;t comply with it but if they don&amp;#39;t comply with the law then they have more than enough reasons to justify that and it&amp;#39;s not a big deal because they are &amp;quot;lawmakers&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 328,
  "permalink": "/r/CryptoCurrency/comments/rqe4ew/if_politicians_failed_to_comply_with_a_lawthen/",
  "subreddit": "CryptoCurrency",
  "id": "rqe4ew",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It came to light that 52 lawmakers failed to comply with the Stock Act, which\naim to prohibit lawmakers insider trading, On being asked, most of them citied\nclerical errors,oversights,inattentive accountants to report those trades.\n\nThe lawmakers who violate the Stock Act would have to pay fine of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "52人の国会議員が株式法を遵守していなかったことが明らかになった。\n議員のインサイダー取引を禁止することを目的としている。\n事務的なミス、見落とし、会計士の不注意などで、これらの取引を報告することができない。\n\n株式法に違反した議員は罰金を払わなければならないが、その額は...。",
      "title": "政治家が法律に従わなかった場合は200ドルの罰金（免除可能）だが、インフラ法案の暗号関連の新条項に従わなかった場合は、刑務所と罰金になるぞ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据了解，有52名立法者没有遵守《股票法》，该法的目的是禁止立法者以任何方式向公众传播信息。\n在被问及这个问题时，他们中的大多数人都提到了以下几点\n文书错误、疏忽、会计人员不注意报告这些交易。\n\n违反《股票法》的立法者将不得不支付罚款。",
      "title": "如果政治家没有遵守法律，那么就会被罚款200美元（可以免除），但如果你没有遵守基础设施法案中与加密货币有关的新规定，那么你就会被关进监狱和罚款。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據瞭解，有52名立法者沒有遵守《股票法》，該法的目的是禁止立法者以任何方式向公衆傳播信息。\n在被問及這個問題時，他們中的大多數人都提到了以下幾點\n文書錯誤、疏忽、會計人員不注意報告這些交易。\n\n違反《股票法》的立法者將不得不支付罰款。",
      "title": "如果政治家沒有遵守法律，那麼就會被罰款200美元（可以免除），但如果你沒有遵守基礎設施法案中與加密貨幣有關的新規定，那麼你就會被關進監獄和罰款。"
    }
  ]
}