{
  "author": "diggbabe",
  "original_created_utc": 1648718543,
  "title": "Are certain bodies just generally better at producing… slime? (NSFW)",
  "created_utc": 1648743909,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throwaway account because this is gonna get kind of weird. This is something I’ve been wondering about forever. &lt;/p&gt;\n\n&lt;p&gt;So, it seems like my body just produces a lot of slime in general. Like, whenever I have a cold, it’s cold outside, or I’m allergic, I just get an insane amount of snot. If I blow my nose there will sometimes be like more than two large spoonfuls of snot on the paper. But that’s not all. My dentist said they’d never seen anyone produce so much saliva. I also produce a… LOT if precum, and will get huge wet spots in my underpants during foreplay.  I can also shoot pretty huge amounts of semen.&lt;/p&gt;\n\n&lt;p&gt;So, I’ve been wondering about whether the fact that my body produces so much of these three types of slime is somehow connected, or if it’s just a coincidence?&lt;/p&gt;\n\n&lt;p&gt;Sorry for this disgusting post &amp;lt;3&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/tsvvzd/are_certain_bodies_just_generally_better_at/",
  "subreddit": "NoStupidQuestions",
  "id": "tsvvzd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Throwaway account because this is gonna get kind of weird. This is something\nI’ve been wondering about forever.\n\nSo, it seems like my body just produces a lot of slime in general. Like,\nwhenever I have a cold, it’s cold outside, or I’m allergic, I just get an insane\namount of snot. If I blow my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょっと変なことになりそうなので、捨てアカウント。これは\nずっと気になっていたんです。\n\n私の身体は一般的にスライムを大量に生産しているようなのです。みたいなんです。\n風邪をひいたり、外が寒かったり、アレルギーがあったりすると、必ずといっていいほど\n鼻水が大量に出る。鼻をかんだら...",
      "title": "ある種の身体は、一般にスライムを作るのに適しているのだろうか？(NSFW)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扔掉的账户，因为这将会变得有点奇怪。这是一件\n我一直在想这个问题。\n\n所以，似乎我的身体在平时就会产生大量的粘液。比如说。\n每当我感冒了，外面很冷，或者我过敏了，我就会有大量的鼻涕。\n鼻涕的数量。如果我吹我的...",
      "title": "某些身体通常更善于生产......粘液吗？(NSFW)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扔掉的賬戶，因爲這將會變得有點奇怪。這是一件\n我一直在想這個問題。\n\n所以，似乎我的身體在平時就會產生大量的粘液。比如說。\n每當我感冒了，外面很冷，或者我過敏了，我就會有大量的鼻涕。\n鼻涕的數量。如果我吹我的...",
      "title": "某些身體通常更善於生產......粘液嗎？(NSFW)"
    }
  ]
}