{
  "author": "notmuchtoknow",
  "original_created_utc": 1637502658,
  "title": "Would you get an abortion if you knew your child would have life-long depression?",
  "created_utc": 1637521807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s say for the sake of the question:\nThe depression is treatment-resistant and chronic\nThey are capable of brief moments of joy, but it is very fleeting\nThere is nothing else particularly wrong with them\nThe depression is moderate-to-severe for the majority of their life\nThey will never achieve true long-term happiness\nIf you decide to keep, they wouldn&#39;t blame/hate you for it\nThere is this void inside them that just cannot be filled, unfortunately</p>\n\n<p>I thought this might be an interesting question. Most people would abort if the baby would be severely disabled, but I don&#39;t think this one is so clear-cut for most people. Guys are welcome to answer too. Would you want her to get an abortion?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/qyvdqf/would_you_get_an_abortion_if_you_knew_your_child/",
  "subreddit": "TooAfraidToAsk",
  "id": "qyvdqf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's say for the sake of the question: The depression is treatment-resistant\nand chronic They are capable of brief moments of joy, but it is very fleeting\nThere is nothing else particularly wrong with them The depression is\nmoderate-to-severe for the majority of their life They will never achieve…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "質問のために言いましょう。うつ病は治療抵抗性で\nうつ病は治療抵抗性であり、慢性的である 彼らは短い瞬間に喜びを感じることができるが、それは非常に短いものである\n他に特に悪いところはない うつ病は\n人生の大半を中程度から重度で過ごす 彼らは決して達成できない...",
      "title": "自分の子供が生涯うつ病になると知ったら、中絶しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了这个问题，我们就说。抑郁症对治疗有抵抗力\n并且是慢性的 他们能够有短暂的快乐，但那是非常短暂的。\n他们没有其他特别的问题 抑郁症是\n他们一生中大部分时间都是中度至重度 抑郁症患者永远无法实现......",
      "title": "如果你知道你的孩子会有终身的抑郁症，你会去堕胎吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了這個問題，我們就說。抑鬱症對治療有抵抗力\n並且是慢性的 他們能夠有短暫的快樂，但那是非常短暫的。\n他們沒有其他特別的問題 抑鬱症是\n他們一生中大部分時間都是中度至重度 抑鬱症患者永遠無法實現......",
      "title": "如果你知道你的孩子會有終身的抑鬱症，你會去墮胎嗎？"
    }
  ]
}