{
  "author": "Many_Arm7466",
  "original_created_utc": 1636142536,
  "title": "To all the Cardano Holders hang in there, I’m here if you need a shoulder to cry on",
  "created_utc": 1636155615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Us Cardano holders have been having a hard time as ADA continues to crab while every other Crypto seems to be moving. </p>\n\n<p>Then lately this sub has been having a great time poking jokes at us and the general sentiment of this sub is that ADA is done. Well I still think long term there is a lot to look forward with with the Cardano ecosystem. We just need to be patient and continue to accumulate. </p>\n\n<p>Anyways yeah just wanted to check in with any other ADA holders in this sub our time is coming don’t worry guys. And I’m here if you need a shoulder to cry on. And also if other member of <a href=\"/r/CC\">r/CC</a> could stop bullying us that would be great.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/CryptoCurrency/comments/qnjcmb/to_all_the_cardano_holders_hang_in_there_im_here/",
  "subreddit": "CryptoCurrency",
  "id": "qnjcmb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Us Cardano holders have been having a hard time as ADA continues to crab while\nevery other Crypto seems to be moving.\n\nThen lately this sub has been having a great time poking jokes at us and the\ngeneral sentiment of this sub is that ADA is done. Well I still think long term\nthere is a lot to look…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他のCryptoが動いているように見えるのに、ADAはカニを食べ続けているので、我々Cardanoホルダーは苦労している。\n他の暗号が動いているように見えます。\n\nそして最近、このサブは私たちをからかって楽しんでいます。\nこのサブの一般的な感情はADAは終わったというものです。しかし、私はまだ長期的には\n見るべきものがたくさんあります...。",
      "title": "カルダノホルダーの皆さん、頑張ってください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们Cardano持有者的日子一直不好过，因为ADA继续吃螃蟹，而其他的加密货币似乎都在移动。\n所有其他加密货币似乎都在移动。\n\n最近，这个子系统一直在嘲笑我们，而且这个子系统的普遍看法是，ADA已经完蛋了。\n这个子的普遍情绪是，ADA已经完蛋了。我仍然认为长期来看\n有很多东西可以看...",
      "title": "对于所有的卡达诺持有者，请坚持下去，如果你需要一个肩膀来哭泣，我就在这里。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們Cardano持有者的日子一直不好過，因爲ADA繼續喫螃蟹，而其他的加密貨幣似乎都在移動。\n所有其他加密貨幣似乎都在移動。\n\n最近，這個子系統一直在嘲笑我們，而且這個子系統的普遍看法是，ADA已經完蛋了。\n這個子的普遍情緒是，ADA已經完蛋了。我仍然認爲長期來看\n有很多東西可以看...",
      "title": "對於所有的卡達諾持有者，請堅持下去，如果你需要一個肩膀來哭泣，我就在這裏。"
    }
  ]
}