{
  "author": "Fine_Temperature_432",
  "original_created_utc": 1647187748,
  "title": "If “essential workers” are so essential why do most of those workers get paid so little?",
  "created_utc": 1647196204,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know capitalism supply and demand blah, blah, blah, but if fast food jobs are meant for high schoolers why are they open during school hours and why are they open late at night?? EMT’s(in my area) get paid garage. Same with librarians and teachers. So if all those important jobs get paid terribly then everyone should just chase money right?? Just study S.T.E.M or learn a trade(sarcasm)?? That’s the recommendation for 350 million people(assuming you’re in the U.S)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/tda360/if_essential_workers_are_so_essential_why_do_most/",
  "subreddit": "TooAfraidToAsk",
  "id": "tda360",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know capitalism supply and demand blah, blah, blah, but if fast food jobs are\nmeant for high schoolers why are they open during school hours and why are they\nopen late at night?? EMT’s(in my area) get paid garage. Same with librarians and\nteachers. So if all those important jobs get paid terribly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "資本主義の需要と供給は分かっているが、ファストフードの仕事が、もし\n高校生のために、なぜ学校の時間帯に営業しているのか、なぜ\n夜遅くまでやっているんですか？救急救命士は（私の住む地域では）車庫証明をもらっている。司書もそうだし\n先生方。だから、もしそれらの重要な仕事がすべてひどい給料をもらっているとしたら・・・。",
      "title": "もし、「必要不可欠な労働者」がそれほど必要不可欠であるならば、なぜ、その労働者のほとんどが低賃金なのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道资本主义的供应和需求等等，但如果快餐工作是为高中生准备的\n为什么他们在上课时间开放，为什么他们在晚上开放？\n深夜营业？急救人员（在我所在的地区）得到了车库的报酬。图书馆员和\n教师也一样。因此，如果所有这些重要的工作都能得到很好的报酬......",
      "title": "如果 \"必要的工人 \"是如此重要，为什么这些工人中的大多数人得到的报酬这么少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道資本主義的供應和需求等等，但如果快餐工作是爲高中生準備的\n爲什麼他們在上課時間開放，爲什麼他們在晚上開放？\n深夜營業？急救人員（在我所在的地區）得到了車庫的報酬。圖書館員和\n教師也一樣。因此，如果所有這些重要的工作都能得到很好的報酬......",
      "title": "如果 \"必要的工人 \"是如此重要，爲什麼這些工人中的大多數人得到的報酬這麼少？"
    }
  ]
}