{
  "author": "AquaSea_Squirrel",
  "the_new_excerpt": "First of all... *clap clap clap* if you've made it this far. To all the older\ninvesters who their wives got angery for them loosing all their money, and the\nyounger ones whos moms got mad at the for \"throwing money away\" I just wanna\ncongratulate you. You held on, you stuck with it. And now, we're…",
  "original_created_utc": 1614207637,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先... *如果你走到这一步，就拍拍手吧。敬所有的老人\n投资人，他们的妻子为他们失去所有的钱而感到愤怒，而他们的妻子为他们失去所有的钱而感到愤怒。\n年轻人的妈妈因为 \"乱花钱 \"而生气，我只想... ...\n祝贺你。你坚持了下来，你坚持了下来。而现在，我们...",
      "title": "致所有倒下的人，抱着... ..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先... *如果你走到這一步，就拍拍手吧。敬所有的老人\n投資人，他們的妻子爲他們失去所有的錢而感到憤怒，而他們的妻子爲他們失去所有的錢而感到憤怒。\n年輕人的媽媽因爲 \"亂花錢 \"而生氣，我只想... ...\n祝賀你。你堅持了下來，你堅持了下來。而現在，我們...",
      "title": "致所有倒下的人，抱着... ..."
    }
  ],
  "title": "To all the people who were down and held...",
  "created_utc": 1614220345,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all... *clap clap clap* if you&#39;ve made it this far. To all the older investers who their wives got angery for them loosing all their money, and the younger ones whos moms got mad at the for &quot;throwing money away&quot; I just wanna congratulate you. You held on, you stuck with it. And now, we&#39;re going back up baby.</p>\n\n<p>Obviously no road trip runs without bumps, sometimes you even get a flat tire. But you generally get where you&#39;re going. And today my fellow retards, we&#39;re going to the moon. It&#39;s just the beginning, and I&#39;m not a financial advisor, but gosh, you&#39;re not really looking for financial advisors on wallstreetbets are you?</p>\n\n<p>So please, regardless of the outcome in the next few days, smile now. Because now, we can be happy, for the first time in a while, some of us are seeing that pretty color of green. SO WHO IS HOLDING??? I love this game some call gambling, and maybe I have an addiction, but even if my ape hands are tiny, I shall hold as many dimonds as the opportunity presents.</p>\n\n<p>&#x200B;</p>\n\n<p>My goodness I&#39;m honnored of all the upvotes and awards, thank you so much!</p>\n</div><!-- SC_ON -->",
  "score": 34097,
  "permalink": "/r/wallstreetbets/comments/lrpmx4/to_all_the_people_who_were_down_and_held/",
  "subreddit": "wallstreetbets",
  "id": "lrpmx4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332901582
}