{
  "author": "Ifrezznew",
  "the_new_excerpt": "I am new to investing as well. I started about 1.5 years ago but before i put\nmoney into the stock market i read 3 books and played with paper money\nbeforehand.\n\nNow, I absolutely love going to reddit for stock information. I visit about 7\nsubs daily and i also watch YouTube videos daily. So by no…",
  "original_created_utc": 1613917390,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我也是投资新手。我开始大约1.5年前，但之前我把我的投资。\n钱进入股市，我读了3本书，玩纸币\n事先。\n\n现在，我绝对喜欢去reddit查询股票信息。我访问约7\n子每天，我也看YouTube视频每天。所以，由不...",
      "title": "很多新股民都要重新评估网上股票论坛是干什么的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我也是投資新手。我開始大約1.5年前，但之前我把我的投資。\n錢進入股市，我讀了3本書，玩紙幣\n事先。\n\n現在，我絕對喜歡去reddit查詢股票信息。我訪問約7\n子每天，我也看YouTube視頻每天。所以，由不...",
      "title": "很多新股民都要重新評估網上股票論壇是幹什麼的。"
    }
  ],
  "title": "Many of you new investors have to reevaluate what online stock forums are for.",
  "created_utc": 1613920977,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am new to investing as well. I started about 1.5 years ago but before i put money into the stock market i read 3 books and played with paper money beforehand. </p>\n\n<p>Now, I absolutely love going to reddit for stock information. I visit about 7 subs daily and i also watch YouTube videos daily. So by no means am I saying you shouldn’t do that. </p>\n\n<p>But in my opinion the reasons to visit these forums is to: \n1.  Get ideas for stocks to &lt;research yourself&gt;.\n2.  Engage socially with people that share your interest in investing. For example, i have no people in my real life circle that even know what stocks are. So i use reddit to engage socially with likeminded individuals.</p>\n\n<p>But in no way should you visit these forums  for sound advice that you trust and don’t have the ability to fact check with your own DD. \nSometimes people give amazing insight and ideas on these forums but if you don’t know to read a balance sheet and in general, research the company yourself- you are using these resources wrong. </p>\n\n<p>Just my two cents, if anyone feels like what I’ve said applies to them. I can send you online free book links and help with any questions you have, just PM me.</p>\n</div><!-- SC_ON -->",
  "score": 1050,
  "permalink": "/r/stocks/comments/loy1qg/many_of_you_new_investors_have_to_reevaluate_what/",
  "subreddit": "stocks",
  "id": "loy1qg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885069
}