{
  "author": "HeapingBagOfRichards",
  "the_new_excerpt": "Congrats you degenerates, you finally beat The Man and you're swimming in\ntendies. This was a fun ride and it's probably not over yet, but I'm hopping off\nthe train with over a million dollar gain.\n\nHere's the fun part - while I never thought I'd make this much on the trade,\nwhen I entered it I…",
  "original_created_utc": 1611356114,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "恭喜你们这些堕落的人，你们终于打败了 \"人\"，你们在游泳了\ntendies。这是一个有趣的旅程，它可能还没有结束，但我跳了下来\n火车上有超过一百万美元的收益。\n\n下面是有趣的部分--虽然我从来没有想过自己会在交易中赚这么多。\n当我进入它，我...",
      "title": ""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "恭喜你們這些墮落的人，你們終於打敗了 \"人\"，你們在游泳了\ntendies。這是一個有趣的旅程，它可能還沒有結束，但我跳了下來\n火車上有超過一百萬美元的收益。\n\n下面是有趣的部分--雖然我從來沒有想過自己會在交易中賺這麼多。\n當我進入它，我...",
      "title": ""
    }
  ],
  "title": "GME winners - remember to give back, I'll start",
  "created_utc": 1611381582,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Congrats you degenerates, you finally beat The Man and you&#39;re swimming in tendies. This was a fun ride and it&#39;s probably not over yet, but I&#39;m hopping off the train with over a million dollar gain. </p>\n\n<p>Here&#39;s the fun part - while I never thought I&#39;d make this much on the trade, when I entered it I promised my Maker I&#39;d give 20% of whatever gains I had to charity and folks affected by the pandemic. I thought maybe it would be $10k or maybe $20k - who knows, $50k if shit got wild. </p>\n\n<p>So far, post taxes it&#39;s around $150k. Wow. We researched charities in our area and I found one that focuses on preventing evictions and helping kids in crisis. We called them this week to tell them what we plan to drop by next week and they were shocked. It costs a lot less to keep a family in their current home than to find them a new one, and in a lot of places, the average eviction is over less than a thousand bucks. They estimate this will keep 100 families in their homes - the majority of whom have kids under 5.</p>\n\n<p>I don&#39;t want give up privacy or too many details here and you can ban me for that if you want ( you can see I mentioned this plan in an earlier comment a few weeks ago) , but there are a ton of eyes on this sub and this community right now - let&#39;s show the world that we&#39;re not the &#39;dumb money&#39; and we do good when we do well.</p>\n\n<p>I encourage everyone who made bank on this to make a donation to a local charity as there&#39;s a lot of need right now.</p>\n</div><!-- SC_ON -->",
  "score": 7871,
  "permalink": "/r/wallstreetbets/comments/l2z98c/gme_winners_remember_to_give_back_ill_start/",
  "subreddit": "wallstreetbets",
  "id": "l2z98c",
  "is_self": true,
  "media": null,
  "is_video": false
}