{
  "author": "its_all_pointless",
  "the_new_excerpt": "When I look at the graph of ICLN in the last 10 years, the there's been barely\nany growth in it until the pandemic hit and suddenly after April 2020, it\nstarted growing and kept growing until the beginning of January 2020.\n\nPerhaps this sudden growth is down to the optimism that Biden will…",
  "original_created_utc": 1621171287,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ICLNの過去10年間のグラフを見ると、ほとんど成長していないことがわかります。\nパンデミックが起こるまでは、ほとんど成長していませんでしたが、2020年4月以降、突然成長し始め、2020年1月初めまで成長し続けました。\n2020年4月以降、急に伸び始め、2020年1月初めまで伸び続けています。\n\nこの急激な成長は、バイデンが...という楽観的な見方をしているからかもしれません。",
      "title": "1月以降、ICLNが徐々に下落している原因は何ですか？今後、回復すると思われますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我看到ICLN在过去10年的图表时，几乎没有任何增长。\n它几乎没有任何增长，直到大流行的到来，突然在2020年4月之后，它开始增长\n2020年4月后，它突然开始增长，并一直增长到2020年1月初。\n\n也许这种突然的增长是由于人们对拜登将...",
      "title": "是什么原因导致ICLN自1月份以来逐渐下滑？你认为它将会恢复吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我看到ICLN在過去10年的圖表時，幾乎沒有任何增長。\n它幾乎沒有任何增長，直到大流行的到來，突然在2020年4月之後，它開始增長\n2020年4月後，它突然開始增長，並一直增長到2020年1月初。\n\n也許這種突然的增長是由於人們對拜登將...",
      "title": "是什麼原因導致ICLN自1月份以來逐漸下滑？你認爲它將會恢復嗎？"
    }
  ],
  "title": "What's causing ICLN to gradually decline since the January? Do you reckon it will recover?",
  "created_utc": 1621191437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I look at the graph of ICLN in the last 10 years, the there&#39;s been barely any growth in it until the pandemic hit and suddenly after April 2020, it started growing and kept growing until the beginning of January 2020. </p>\n\n<p>Perhaps this sudden growth is down to the optimism that Biden will promote renewable energy, along with the US government&#39;s cash injection to boost the economy during the pandemic.</p>\n\n<p>However, now that ICLN is back to its normal trend (4/2011 - 3/2020), do you reckon it will come back to north trending graph any time soon? I bought ICLN at the end of February and now it&#39;s more than 27% down. Do you reckon it will grow back any time soon? Or should I give up on it?</p>\n</div><!-- SC_ON -->",
  "score": 654,
  "permalink": "/r/stocks/comments/ndo7u3/whats_causing_icln_to_gradually_decline_since_the/",
  "subreddit": "stocks",
  "id": "ndo7u3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804456
}