{
  "author": "ChewieWins",
  "the_new_excerpt": "So, cynical people about crypto often say to me that if I believe in crypto so\nmuch, why am I still doing a normal job and earning 'useless fiat'. Well,\nactually it's simple, I work so my savings all go into crypto. And with crypto,\nI am seeking my financial freedom (No lambo!) so that one day I…",
  "original_created_utc": 1623368983,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そのため、暗号について冷笑的な人からは、「そんなに暗号を信じているなら、なぜ普通の仕事をして『役に立たないフィアット』を稼いでいるのか」とよく言われます。\nなぜ私はまだ普通の仕事をして、「役に立たない不換紙」を稼いでいるのか、とよく言われます。そうですね。\n実際には簡単で、私は働いているので、貯金はすべて暗号に回しています。そして、暗号で。\n私は経済的な自由を求めています（ランボはありません！）ので、いつか...",
      "title": "私はCryptoを得るために働きます。働かなくてもいいようにCryptoを手に入れています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，对加密货币持怀疑态度的人经常对我说，如果我这么相信加密货币\n为什么我还在做一份正常的工作，赚取 \"无用的法币\"。好吧。\n其实很简单，我工作了，所以我的储蓄都进入了加密货币。而有了加密货币。\n我正在寻求我的财务自由（没有兰博！），以便有一天我...",
      "title": "我工作是为了获得加密货币。我得到加密货币，所以我不需要工作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，對加密貨幣持懷疑態度的人經常對我說，如果我這麼相信加密貨幣\n爲什麼我還在做一份正常的工作，賺取 \"無用的法幣\"。好吧。\n其實很簡單，我工作了，所以我的儲蓄都進入了加密貨幣。而有了加密貨幣。\n我正在尋求我的財務自由（沒有蘭博！），以便有一天我...",
      "title": "我工作是爲了獲得加密貨幣。我得到加密貨幣，所以我不需要工作。"
    }
  ],
  "title": "I work to get Crypto. I get Crypto so I don't have to work.",
  "created_utc": 1623411226,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, cynical people about crypto often say to me that if I believe in crypto so much, why am I still doing a normal job and earning &#39;useless fiat&#39;. Well, actually it&#39;s simple, I work so my savings all go into crypto. And with crypto, I am seeking my financial freedom (No lambo!) so that one day I will not need to work! I know, it&#39;s a silly obvious statement but it is my life motto since discovering Crypto, way too late in my life, but hey, better late than never!</p>\n\n<p>Now I need to make a T-shirt with that statement! Any suggestions on what to put on it? I was thinking falling Fiat on top of logo, and falling coins below? Put my favourite coins (BEAD and others!)</p>\n</div><!-- SC_ON -->",
  "score": 224,
  "permalink": "/r/CryptoCurrency/comments/nx23m4/i_work_to_get_crypto_i_get_crypto_so_i_dont_have/",
  "subreddit": "CryptoCurrency",
  "id": "nx23m4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009736015
}