{
  "author": "Gracchus__Babeuf",
  "the_new_excerpt": "I have attempted to find the scene in question on Youtube but alas I am\nunsuccessful.\n\nNevertheless, I am aware that up until the middle of the 20th Century, the\nFrench language occupied a role similar to the one English plays today. French\nwas the language of academia, diplomacy and trade. However,…",
  "original_created_utc": 1615595205,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我曾试图在Youtube上找到有关场景，但可惜我是\n不成功。\n\n然而，我知道，直到20世纪中叶。\n法语占据了类似于今天英语的作用。法文\n是学术界、外交界和贸易界的语言。然而，...",
      "title": "在HBO的迷你剧 \"约翰-亚当斯 \"中，路易十六被描述为起初对亚当斯不会说法语感到惊讶，然后完全被逗乐了。像亚当斯这样的社会地位或政治地位重要的人不会说法语，真的会是这样的怪事吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾試圖在Youtube上找到有關場景，但可惜我是\n不成功。\n\n然而，我知道，直到20世紀中葉。\n法語佔據了類似於今天英語的作用。法文\n是學術界、外交界和貿易界的語言。然而，...",
      "title": "在HBO的迷你劇 \"約翰-亞當斯 \"中，路易十六被描述爲起初對亞當斯不會說法語感到驚訝，然後完全被逗樂了。像亞當斯這樣的社會地位或政治地位重要的人不會說法語，真的會是這樣的怪事嗎？"
    }
  ],
  "title": "In the HBO miniseries \"John Adams\", Louis XVI is portrayed as at first being surprised and then completely amused by the fact that Adams could not speak French. Would the prospect of someone of Adams' social status or political importance not speaking French really be such an oddity?",
  "created_utc": 1615643220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have attempted to find the scene in question on Youtube but alas I am unsuccessful. </p>\n\n<p>Nevertheless, I am aware that up until the middle of the 20th Century, the French language occupied a role similar to the one English plays today. French was the language of academia, diplomacy and trade. However, the rise of English was aided by the concurrent rise of widely available media like movies and television. Needless to say, this was not the case in the 18th Century. </p>\n\n<p>So would it really be all that strange for someone like John Adams to be unable to speak French? Perhaps Louis&#39; reaction comes from the fact that it was specifically strange for someone sent to France as a diplomat to be unable to speak French but not necessarily people in Adams&#39; position generally? Or maybe Louis never really interacted with people that couldn&#39;t speak French?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/m3v3r2/in_the_hbo_miniseries_john_adams_louis_xvi_is/",
  "subreddit": "AskHistorians",
  "id": "m3v3r2",
  "is_self": true,
  "media": null,
  "is_video": false
}