{
  "author": "xXJarjar69Xx",
  "original_created_utc": 1631899033,
  "title": "What exactly was Nazi Germany holding out for? What was the “plan” from 1943-1945",
  "created_utc": 1631954892,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot has been discussed on what German plans for the first half of the war of the war was, and stuff like Generalplan OST, but what about for the later half of the war, when they started loosing? Stuff like the volkstrumm and the battle of the bulge seem like they were trying to buy time, but buy time for what? Were there any crazy plans thought up on how they’d be able to turn the tide again?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/pq4g46/what_exactly_was_nazi_germany_holding_out_for/",
  "subreddit": "AskHistorians",
  "id": "pq4g46",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot has been discussed on what German plans for the first half of the war of\nthe war was, and stuff like Generalplan OST, but what about for the later half\nof the war, when they started loosing? Stuff like the volkstrumm and the battle\nof the bulge seem like they were trying to buy time, but buy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第二次世界大戦の前半におけるドイツの計画がどのようなものであったかについては、これまでも多くの議論がなされてきました。\n戦争前半のドイツの計画については多くの議論がなされてきました。\n負け始めた戦争後半はどうだったのでしょうか？ヴォルクシュトゥルムやバルカンの戦いなどの\nバルジの戦いなどは、時間を稼ごうとしていたように見えますが、その稼ぎ方は...。",
      "title": "ナチスドイツは一体何を目指していたのか？1943年から1945年までの「計画」とは"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们已经讨论了很多关于德国在战争前半段的计划，以及诸如《总计划》之类的东西。\n战争的前半部分的计划，以及像《总计划》这样的东西，但对于战争的后半部分，当他们开始失败时，又是怎样的呢？\n但在战争的后半段，当他们开始失败的时候呢？像 \"伏尔加河 \"和 \"突击战 \"这样的计划\n看起来他们在努力争取时间，但争取...",
      "title": "纳粹德国到底在坚持什么？1943-1945年的 \"计划 \"是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們已經討論了很多關於德國在戰爭前半段的計劃，以及諸如《總計劃》之類的東西。\n戰爭的前半部分的計劃，以及像《總計劃》這樣的東西，但對於戰爭的後半部分，當他們開始失敗時，又是怎樣的呢？\n但在戰爭的後半段，當他們開始失敗的時候呢？像 \"伏爾加河 \"和 \"突擊戰 \"這樣的計劃\n看起來他們在努力爭取時間，但爭取...",
      "title": "納粹德國到底在堅持什麼？1943-1945年的 \"計劃 \"是什麼？"
    }
  ]
}