{
  "author": "throwaway92715",
  "original_created_utc": 1647277102,
  "title": "Public outrage in the United States over rising gas prices. Is this it? Has Ethereum truly gone THAT mainstream?!",
  "created_utc": 1647300897,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I checked the news today for the first time in months, and on the front page was an article on public outrage over gas prices.  Since I&amp;#39;d been browsing almost exclusively crypto-related news sources for the last year and a half, I thought this was nothing out of the ordinary.  Then I realized, it was on the front page of the New York Times!&lt;/p&gt;\n\n&lt;p&gt;Has crypto really gone so mainstream now that people in Alabama are lining up to protest increases in gas prices?!  Haven&amp;#39;t they heard about Layer 2 sidechains like Polygon?  Why aren&amp;#39;t those guys up there making a statement?  This is a golden opportunity!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 850,
  "permalink": "/r/CryptoCurrency/comments/te25a5/public_outrage_in_the_united_states_over_rising/",
  "subreddit": "CryptoCurrency",
  "id": "te25a5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I checked the news today for the first time in months, and on the front page was\nan article on public outrage over gas prices. Since I'd been browsing almost\nexclusively crypto-related news sources for the last year and a half, I thought\nthis was nothing out of the ordinary. Then I realized, it was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、数ヶ月ぶりにニュースをチェックしたら、一面は\nガソリン価格に対する国民の怒りの記事。今までほとんど\nこの1年半、暗号関連のニュースソースしかなかったから、私はこう思った。\nということです。そして、これは...",
      "title": "米国ではガソリン価格の高騰に国民の怒りが爆発。これがそうなのか？イーサリアムは本当にそんなに主流になったのか！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天查看了几个月来的第一次新闻，头版头条是\n一篇关于公众对汽油价格的愤怒的文章。因为我几乎只浏览了\n在过去的一年半里，我几乎只浏览与加密货币有关的新闻来源，所以我认为\n这并没有什么不寻常的地方。然后我意识到，这是...",
      "title": "美国公众对油价上涨感到愤怒。是这样吗？以太坊真的已经成为主流了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天查看了幾個月來的第一次新聞，頭版頭條是\n一篇關於公衆對汽油價格的憤怒的文章。因爲我幾乎只瀏覽了\n在過去的一年半里，我幾乎只瀏覽與加密貨幣有關的新聞來源，所以我認爲\n這並沒有什麼不尋常的地方。然後我意識到，這是...",
      "title": "美國公衆對油價上漲感到憤怒。是這樣嗎？以太坊真的已經成爲主流了嗎？"
    }
  ]
}