{
  "author": "Ayudante_semianonimo",
  "the_new_excerpt": "WELCOME FELLOW APES TO MY LAST BLOOMBERG UPDATE ON 03/18/21 !\n\nI hope you're all doing great and have popcorn nearby for tomorrow.\n\nLike last time, I am going to explain you what you can see on the different\npictures step by step, or picture by picture in this case.\n\nPICTURE…",
  "original_created_utc": 1616096293,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "欢迎亲爱的APES们来到我的最后一次BLOOMBERG更新03/18/21 !\n\n我希望你们都做得很好，并为明天准备好爆米花。\n\n像上次一样，我将向你解释你可以看到的不同的\n图片一步一步的，或者说这里的图片一步一步的。\n\nPICTURE...",
      "title": "GME彭博终端更新 03/18/21 | 终极游戏即将到来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歡迎親愛的APES們來到我的最後一次BLOOMBERG更新03/18/21 !\n\n我希望你們都做得很好，併爲明天準備好爆米花。\n\n像上次一樣，我將向你解釋你可以看到的不同的\n圖片一步一步的，或者說這裏的圖片一步一步的。\n\nPICTURE...",
      "title": "GME彭博終端更新 03/18/21 | 終極遊戲即將到來。"
    }
  ],
  "title": "GME Bloomberg Terminal Update 03/18/21 | THE ENDGAME IS NEAR",
  "created_utc": 1616131692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>WELCOME FELLOW APES TO MY LAST BLOOMBERG UPDATE ON 03/18/21 !</p>\n\n<p>I hope you&#39;re all doing great and have popcorn nearby for tomorrow.</p>\n\n<p>Like last time, I am going to explain you what you can see on the different pictures step by step, or picture by picture in this case.</p>\n\n<p>PICTURE 1:</p>\n\n<p><a href=\"https://preview.redd.it/wgfpkk1s4tn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=9bf17c0c0a7c6164dbd996fadbb783719340a079\">https://preview.redd.it/wgfpkk1s4tn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=9bf17c0c0a7c6164dbd996fadbb783719340a079</a></p>\n\n<p>In the first picture, we don&#39;t really see a difference compared to my last screenshots. We see a decline in sellers, which is obviously good, and a small increase of institutional involvement, also good. No negative data.</p>\n\n<p>PICTURE 2:</p>\n\n<p><a href=\"https://preview.redd.it/hzvspcs66tn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=ed4244b5cd2bcc90c1140300a0a0b9de9d3ac0ef\">https://preview.redd.it/hzvspcs66tn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=ed4244b5cd2bcc90c1140300a0a0b9de9d3ac0ef</a></p>\n\n<p>I find it quite funny, that we can see a spanish asset manager buying call options which also expire tomorrow. Just like the idea, that some of the hedgies want other hedgies to be smashed. They don&#39;t really have a huge position and won&#39;t have any big impact on the price of GME. All other options you can see are outdated and the accuracy of these options cannot be granted. Don&#39;t try to speculate, since you cannot tell whether they&#39;re still in or not.</p>\n\n<p>For all of you who don&#39;t know what call options are, the spanish asset manager bets that the price of GME will be above 200$ tomorrow, which would definitely be amazing for us apes. I am explaining in the following pictures why exactly.</p>\n\n<p>PICTURE 3:</p>\n\n<p><a href=\"https://preview.redd.it/opnh5k177tn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=bede88f52d218976b6f0cff114ba4ce8fa52d1b1\">https://preview.redd.it/opnh5k177tn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=bede88f52d218976b6f0cff114ba4ce8fa52d1b1</a></p>\n\n<p>Okay so, this is where the important stuff is displayed. We can see that 11,681 options are expiring tomorrow if the price hits 250$, which is currently not the case. (GME at 211$ while I&#39;m writing this DD). This would mean at this point over 2509 call options COULD, not have to, execute tomorrow ~ 250k shares COULD be bought. Keep in mind, that most people don&#39;t execute their calls, but rather just sell them.</p>\n\n<p>Important info: I am only taking into account call options from 160$ - 250$ as you can see, since I didnt want to add all the amounts from 100$ to idk where. So you can expect that there are at least over 1000 options expiring aswell at the strike price of 100$. But I know some would argue about this, and this is why I am just calculating with the options shown in the screenshot.</p>\n\n<p>SO: If GME hits 250$ by tomorrow over 1,2 mio shares COULD be bought, assuming that all people execute the calls, but this doesn&#39;t really has a huge importance since marketmakers begin to buy shares already in case of someone executes his options. 1,2 mio shares being bought at the same point, or even half of it -&gt; huge price jump. But also 100k or 200k shares would create a price jump and therefore COULD lead to the so-called gamma squeeze (hitting higher stock prices, causing other options to be in the money, and so on). I don&#39;t say that it for sure will cause a gamma squeeze. It just could end up in the situation we&#39;re all striving for.</p>\n\n<p>PICTURE 4:</p>\n\n<p><a href=\"https://preview.redd.it/t7m7flh59tn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=f98da6a0969261cbe0dc220bc4a1ef24ffb4b21b\">https://preview.redd.it/t7m7flh59tn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=f98da6a0969261cbe0dc220bc4a1ef24ffb4b21b</a></p>\n\n<p>Okay so, now we come to the point where you can clearly see why it&#39;s kind of important for GME to be over 200$ by tomorrow. If GME is UNDER 200$ TOMORROW, over 12k put options (1,2 mio shares) CAN be executed, which would cause a price drop. That doesn&#39;t automatically mean that the gamma squeeze possibility is non-existent anymore, but it would definitely mean that we would have to wait for the next expiration date to let it happen. It also doesn&#39;t mean that everyone really executes his options, since like I said, most of them never get executed.</p>\n\n<p>Now we come to the huge BUT part:</p>\n\n<p>IF GME IS ABOVE 200$ TOMORROW, WE HAVE NEARLY NO PUT OPTIONS THAT ARE OF ANY IMPORTANCE ANYMORE. This means, that there would really be no huge downward pressure on the price, outgoing from options, if it starts to rise. You can check this by yourself on other platforms. There are not a lot put calls on GME over the strike price of 200$.</p>\n\n<p>Picture 5:</p>\n\n<p><a href=\"https://preview.redd.it/ofxur2biatn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=681866a6b46249f775ac5ddefd2c900cb4135d64\">https://preview.redd.it/ofxur2biatn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=681866a6b46249f775ac5ddefd2c900cb4135d64</a></p>\n\n<p>This is again very interesting imo, since we can clearly see, that the ETF objectives increased their positions by over 10%. OVER 10% !!! Since Blackrock owns almost 10mio shares which are mostly in ETFs (I KNOW THIS FROM MY OWN BLOOMBERG RESEARCH BUT YOU CAN OFC JUST DONT TRUST ME. THEN IGNORE THE FOLLOWING SENTENCE) , I ASSUME that BLACKROCK (LARGEST ASSET MANAGER IN THE WORLD) is on our side and wants GME to skyrocket. Very good information, so do I think. We also see an overall increase in positions, except from one fund objective, the value fund objective (betting on stocks that are in their opinion undervalued). I know there were a lot of posts about Blackrock being on Citadels site. Which is just as likely. I don&#39;t have more information than you have. But Blackrock is the biggest shareholder of GME and has most of its stocks in ETFS.</p>\n\n<p>The ETF increase could also just mean that another Hedgefund, not called Blackrock, increased their position in ETFs. Everything is possible.</p>\n\n<p>Last picture:</p>\n\n<p><a href=\"https://preview.redd.it/7mlji2q9btn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=947b90a1993cf426da98ee679e8732a10dfd82e7\">https://preview.redd.it/7mlji2q9btn61.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=947b90a1993cf426da98ee679e8732a10dfd82e7</a></p>\n\n<p>This really contains no helpful information, but I just want to show you that all short sellers stopped reporting short interest since the 02/26/2021 (When GME started to rise from 40$ on february 22nd to 265$ on march 10th.). Although short interest usually got reported on the 15th each month, we still have no recent reports. Seems a bit sketchy, imo. But this could also just mean nothing.</p>\n\n<p>I don&#39;t want to get anybody buy GME due to my posts, since I am mostly making assumptions here and personally just find it really suspicious. I know we all find the situation really suspicious.</p>\n\n<p>I THANK EVERYBODY FOR READING THIS AND WHICH ALL OF US GOOD LUCK IN THE WAR! I AM HYPED FOR POWER HOUR AND IF GME IS ABLE TO STAY ABOVE 200$. but keep in mind, we have many evidences, that other HFs are on our side, besides from my assumptions that Blackrock wants GME to skyrocket. Please read other DD&#39;s if you want to have more info about this topic particularly. I can recommend DD&#39;s by <a href=\"/u/HeyItsPixel\">u/HeyItsPixel</a> about this topic.</p>\n\n<p>HAVE A NICE EVENING EVERYBODY. I LOVE YOU ALL.</p>\n\n<p>PS: Holy shit this really took me an hour to make.</p>\n\n<p>EDIT: GME DOES NOT HAVE TO CLOSE ABOVE 200$ TOMORROW! THIS ALSO DOESNT MEAN THAT &quot;GME IS OVER&quot; OR SOME SH** IF IT CLOSES UNDER 200. I WILL HOLD MY SHARES UNTIL GME HITS 1 MIL. I DONT CARE IF IT IS TOMORROW, NEXT WEEK, NEXT MONTH OR NEXT YEAR. PLEASE DONT GET THE IMPRESSION THAT I SAID THAT GME HAS TO CLOSE ABOVE A SPECIFIC RANGE<strong>. I WANTED TO SAY THE GAMMA SQUEEZE IS MOST LIKELY TO EXPECT TOMORROW OR MONDAY WHEN GME IS ABOVE 200$ TOMORROW SINCE MOST OPTIONS EXPIRE ON MARCH 19th which is information we already had a long time ago. I held my shares while being at -90% and I will hold them until they&#39;re at +69,420%. My personal opinion.</strong></p>\n\n<p>EDIT 2 : My main goal is not to motivate you, promise you anything or predict anything. My intention of my every two-day Bloomberg updates are to show you how the market does and if retail is selling or anything. That’s all. If you’re not interested in my text, don’t read it and just look at the screenshots and make your own opinions. I know, that not all options have to be executed and most of them probably are not being executed.</p>\n\n<p>EDIT 3: I also did not say that Blackrock IS FOR SURE ON OUR SIDE, but Blackrock is the one having most shares embedded in ETFs. And as you can see, the positions in ETFs increased by 10%. This also COULD MEAN THAT ANOTHER HEDGEFUND OR ASSET MANAGER JUST INCREASED THEIR POSITION!! Don&#39;t get me wrong, PLEASE!</p>\n\n<p>For real, it just makes me sad that so many people misunderstand me and think &quot;I am one of them&quot;, &quot;trying to say that GME HAS TO CLOSE ABOVE 200$ tomorrow or it crashes&quot; or say that I said &quot;all options are for sure being exectued&quot;. I never said such things and that was never my intention. I am not going to make any more updates.</p>\n\n<p>TL;DR:</p>\n\n<p>IF GME ABOVE 200$ PREPARE FOR LIFTOFF. IF UNDER: GET YOUR MONEY TOGETHER CUZ ITS A FIRE SALE</p>\n\n<p>All the credit goes to <a href=\"/u/Bullmarket_chaser\">u/Bullmarket_chaser</a> who couldn&#39;t post the original DD on <a href=\"/r/wallstreebets\">r/wallstreebets</a>.</p>\n\n<p>Check the original DD here: <a href=\"https://www.reddit.com/r/GME/comments/m7usgx/final_bloomberg_update_on_031821_the_endgame_is/\">https://www.reddit.com/r/GME/comments/m7usgx/final_bloomberg_update_on_031821_the_endgame_is/</a></p>\n</div><!-- SC_ON -->",
  "score": 2587,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/4mGFk3txr5ZieUV2xuyyr2peWdPWDMOWN7qlqTW7nG4.jpg?auto=webp&s=7e8b3f4d4db93cf6dac50f427c998b427e2efd78",
          "width": 4032,
          "height": 3024
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/4mGFk3txr5ZieUV2xuyyr2peWdPWDMOWN7qlqTW7nG4.jpg?width=108&crop=smart&auto=webp&s=2c1cfcc93b79dfe6aab6e6c67acea1068988fca2",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/4mGFk3txr5ZieUV2xuyyr2peWdPWDMOWN7qlqTW7nG4.jpg?width=216&crop=smart&auto=webp&s=ec2d61a4c57dadb986e77cfb7a5f34b54cbfd1f8",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/4mGFk3txr5ZieUV2xuyyr2peWdPWDMOWN7qlqTW7nG4.jpg?width=320&crop=smart&auto=webp&s=7e63d0ce2cae31c2d7597c5fbcb3aa7b147662a6",
            "width": 320,
            "height": 240
          },
          {
            "url": "https://external-preview.redd.it/4mGFk3txr5ZieUV2xuyyr2peWdPWDMOWN7qlqTW7nG4.jpg?width=640&crop=smart&auto=webp&s=18055e371e4a90f6512c0ad03a698ad86189f888",
            "width": 640,
            "height": 480
          },
          {
            "url": "https://external-preview.redd.it/4mGFk3txr5ZieUV2xuyyr2peWdPWDMOWN7qlqTW7nG4.jpg?width=960&crop=smart&auto=webp&s=1122b04dec83c30dbc282a238e7ec4fae1dc09b5",
            "width": 960,
            "height": 720
          },
          {
            "url": "https://external-preview.redd.it/4mGFk3txr5ZieUV2xuyyr2peWdPWDMOWN7qlqTW7nG4.jpg?width=1080&crop=smart&auto=webp&s=e04e1f9ab5721ec81972fbfdd79495bad46026c1",
            "width": 1080,
            "height": 810
          }
        ],
        "variants": {},
        "id": "vfEVVXsXubBwlauK9ambx3GUObeUy_d5Nb8qyRmHxU4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/m7yw5z/gme_bloomberg_terminal_update_031821_the_endgame/",
  "subreddit": "wallstreetbets",
  "id": "m7yw5z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752824360
}