{
  "author": "reggieoninvesting",
  "the_new_excerpt": "Long post but easily readable. TLDR at the bottom.\n\nAs of right now, Biden is speaking about the huge infrastructure plan. This plan\nis spread out over 8 years and will be paid for in new tax hikes. The tax plan\nis expected to raise the corporate tax rate from 21 percent to 28 percent, end\nfederal…",
  "original_created_utc": 1617224710,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "帖子很长，但很容易读懂。TLDR在底部。\n\n就目前而言，拜登正在讲庞大的基建计划。这个计划\n分8年实施，并将以新的税收增长来支付。该税收计划\n预计将把企业税率从21%提高到28%，完\n联邦...",
      "title": "拜登的基建计划，谁受益？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "帖子很長，但很容易讀懂。TLDR在底部。\n\n就目前而言，拜登正在講龐大的基建計劃。這個計劃\n分8年實施，並將以新的稅收增長來支付。該稅收計劃\n預計將把企業稅率從21%提高到28%，完\n聯邦...",
      "title": "拜登的基建計劃，誰受益？"
    }
  ],
  "title": "Biden's Infrastructure plan and who benefits?",
  "created_utc": 1617228940,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Long post but easily readable. TLDR at the bottom.</p>\n\n<p>As of right now, Biden is speaking about the huge infrastructure plan. This plan is spread out over 8 years and will be paid for in new tax hikes. The tax plan is expected to raise the corporate tax rate from 21 percent to 28 percent, end federal subsidies for fossil fuel companies and increase the global minimum tax paid from about 13 percent to 21 percent, as well as other measures aimed at taxing corporations that shelter profits offshore to avoid taxes.</p>\n\n<p>More details about this plan are here: <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/\">https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>$650B to rebuild the country’s infrastructure, such as its roads, bridges, highways and ports\n\n<ul>\n<li>U.S. Stocks:\n\n<ul>\n<li>ROAD (Construction partners) - engineering and construction industry - engages in the construction and maintenance of highways, roads, bridges, airports, and commercial and residential developments. across Alabama, Florida, Georgia, North Carolina, and South Carolina.</li>\n<li>VMC (Vulcan materials),</li>\n<li>NUE (Nucor) - sells steel and steel products</li>\n<li>CLF (Cleveland cliffs) - steel industry - Iron ore mining company based in the US - three ore mines - one in Michigan, and two in Minnesota,</li>\n<li>CMCO - (Columbus Mckinnon corp) - trucks/construction/farm machinery industry -</li>\n</ul></li>\n<li>ETFs:\n\n<ul>\n<li>PAVE - US Infrastructure ETF - no utility companies</li>\n<li>IFRA - US Infrastructure ETF with 20 electric utility companies and four water companies.</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>$400B toward home care for the elderly and the disabled - A few senior living facilities were hit with COVID and unfortunately took the lives of many of these elderly. I&#39;m not too sure on the outlook of senior living in the short term due to COVID. I&#39;m sure families are hesitant about putting their elderly ones in assisted living facilities in the short term.\n\n<ul>\n<li>Stocks:\n\n<ul>\n<li>CSU (Capital senior living)</li>\n<li>WELL (Welltower inc)</li>\n<li>VTR (Ventas inc)</li>\n<li>BKD (Brookdale senior living)</li>\n<li>FVE (Five star senior living)</li>\n<li>CTRE (CareTrust REIT) - 72% skill nursing facilities, 18% assisted and independent living facilities, 9% campuses (SNF + ALF)</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>$300B for housing infrastructure\n\n<ul>\n<li>Stocks:\n\n<ul>\n<li>DHI (D.R. Horton) - largest US homebuilder (58,434 closings in 2019)</li>\n<li>LEN (Lennar corp) - 2nd largest homebuilder (51,491 closing in 2019)</li>\n<li>PHM (Pulte group) - 3rd largest homebuilder (23,232 closings in 2019)</li>\n<li>NVR (NVR inc) - 4th (19,668 closings in 2019)</li>\n<li>KBH (KB home) - 5th (11,871 closings in 2019)</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>$300B to revive U.S. manufacturing\n\n<ul>\n<li>ETFS: XLI, BOTZ</li>\n<li>CPSH (CPS technologies) - provide materials for transportation, automotive, energy, computing/internet, telecommunication, aerospace, defense, and oil and gas markets</li>\n<li>ABB - (ABB) - Swedish company that provides robotics and automation technologies in manufacturing industry</li>\n<li>ROK (Rockwell automation) - provider of industrial automation</li>\n<li>FANUY (Fanuc) - Japanese automation company</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>$180B to research and development</li>\n<li>$100s of billions of dollars to bolster the\n\n<ul>\n<li>Nation’s electric grid (stocks listed under clean energy),</li>\n<li>High-speed broadband, and\n\n<ul>\n<li>ARKX</li>\n<li>T, CMCSA, VZ, TMUS</li>\n<li>IRDM (Iridium communications) - 66 active satellites used for worldwide voice and data communication from hand-held satellite phones and other transceiver units.</li>\n<li>VSAT (ViaSat) - 4 satellites providing of high-speed satellite broadband services and secure networking systems covering military and commercial markets</li>\n</ul></li>\n<li>Water systems to ensure clean drinking water\n\n<ul>\n<li>ETFS: FIW, PHO</li>\n<li>AWT (American water works) - public utility company</li>\n<li>PNR (Pentair) - water treatment company based in UK, main office in US in Minnesota</li>\n<li>WMS (Advanced drainage systems) - provider of draining products</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>$100B towards workforce development and job retraining</li>\n<li>$400B in clean-energy credits\n\n<ul>\n<li>Electric Vehicles: TSLA, NIO, XPEV, LI, Luc1d, GM, F, all other legacy autos EVs</li>\n<li>Chargers: BEEM, PLUG, CHPT, BLNK</li>\n<li>Solar: SEDG, ENPH, FSLR, SPWR, NEE</li>\n<li>Cell producers: PLUG and more stocks I can&#39;t list, check the spreadsheet below</li>\n<li>Energy storage: stocks I can&#39;t list here sorry check the spreadsheet below</li>\n<li>Natural resources:  MP, UUUU</li>\n</ul></li>\n</ul>\n\n<p>IMO, the rare earth elements (REE) space is going to grow at a fast past over the next few years and decades. If you don&#39;t know what REE is, it&#39;s a group of 17 metals (lanthanum, cerium, praseodymium, neodymium, promethium, samarium, europium, gadolinium, terbium, dysprosium, holmium, erbium, thulium, ytterbium, lutetium, scandium, yttrium) that appear in low concentrations in the ground. The popular ones used in mainstream commodities (such as electric vehicles, batteries, and energy storage) are lithium, graphite, cobalt, nickel, and copper.</p>\n\n<p>There was a Global Metals &amp; Mining Live Virtual Investor Conference yesterday and today that saw several companies pitch their companies and talked about what they do and the how the mining business will see a lot of growth for the next several years.</p>\n\n<p>There&#39;s two US based companies that I would recommend and that&#39;s MP Materials, ticker symbol, MP and Energy fuels, UUUU. The reason mining rare earth metals is so important for the US is because we have to become independent from other countries to mine, specifically China. China supplied 80% of the rare earth metals to the US from 2014 to 2017 and they supply 75% of the rare earth materials to manufacturers. There is only one US based rare earth mine and that&#39;s California&#39;s mountain pass mine. Guess who owns it? MP Materials.</p>\n\n<p>I made a spreadsheet list of stocks and ETFs that may see some benefit from this plan. Tabs on the bottom so its divided by each category.</p>\n\n<p><a href=\"https://docs.google.com/spreadsheets/d/1AmtSD9Bcg_BwcdOxSwR_li5uL3Omfa1SAFlcAMa7KJQ/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1AmtSD9Bcg_BwcdOxSwR_li5uL3Omfa1SAFlcAMa7KJQ/edit?usp=sharing</a></p>\n\n<p>If you&#39;re still reading here, thanks for taking the time to read this. If you have any suggestions for stocks that will benefit, discuss here!</p>\n\n<p>TLDR: Long TSLA, MP, LIT, ARKX, clean energy stocks. Do your own research.</p>\n\n<p>Edit: Forgot to mention that this infrastructure plan is just a proposal! I think they will vote on it sometime in August/September AFAIK. </p>\n</div><!-- SC_ON -->",
  "score": 390,
  "permalink": "/r/stocks/comments/mhfqc0/bidens_infrastructure_plan_and_who_benefits/",
  "subreddit": "stocks",
  "id": "mhfqc0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357144817
}