{
  "author": "Jxntb733",
  "original_created_utc": 1649611758,
  "title": "The SilkRoad led to safer drug use, partially thanks to crypto",
  "created_utc": 1649622945,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In contrast to the government’s portrayal of the Silk Road website as a more dangerous version of a traditional drug marketplace, it was in many respects the most responsible drug marketplace in history.          &lt;/p&gt;\n\n&lt;p&gt;By giving users cleaner drugs, off the dangerous streets, and by using anonymized money, it was largely a peaceable alternative to the often deadly violence so commonly associated with the global drug war, and street drug transactions!               &lt;/p&gt;\n\n&lt;p&gt;Furthermore, the website had safe usage forums with information mechanisms for safer and more responsible forms of recreational drug use; something you certainly won’t get on the streets or from Google.           &lt;/p&gt;\n\n&lt;p&gt;Silk Road showed us an (imperfect yet forward thinking) way to overcome issues involved with drug use, but lawmakers only want to focus on punishment while casting crypto as this dirty tool for dirty people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "permalink": "/r/CryptoCurrency/comments/u0mfkb/the_silkroad_led_to_safer_drug_use_partially/",
  "subreddit": "CryptoCurrency",
  "id": "u0mfkb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In contrast to the government’s portrayal of the Silk Road website as a more\ndangerous version of a traditional drug marketplace, it was in many respects the\nmost responsible drug marketplace in history.\n\nBy giving users cleaner drugs, off the dangerous streets, and by using\nanonymized money, it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シルクロードのウェブサイトを、政府がより多くの人に知ってもらいたいと考えているのとは対照的です。\n従来の麻薬市場を危険なものにしたもので、多くの点で\n歴史上、最も責任感のある薬物市場です。\n\n危険なストリートから離れた、よりクリーンなドラッグを利用者に提供し、そして\n匿名化されたお金、それは...",
      "title": "シルクロードはより安全な薬物使用につながった、一部は暗号のおかげである"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "与政府将丝绸之路网站描述为更危险的贸易网站不同的是\n与政府将丝绸之路网站描述为一个更危险的传统毒品市场相比，它在许多方面都是历史上最负责任的毒品市场。\n历史上最负责任的毒品市场。\n\n通过向用户提供更干净的毒品，远离危险的街道，并通过使用\n匿名的钱，它是一个非常好的平台。",
      "title": "丝绸之路导致了更安全的毒品使用，部分归功于加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與政府將絲綢之路網站描述爲更危險的貿易網站不同的是\n與政府將絲綢之路網站描述爲一個更危險的傳統毒品市場相比，它在許多方面都是歷史上最負責任的毒品市場。\n歷史上最負責任的毒品市場。\n\n通過向用戶提供更乾淨的毒品，遠離危險的街道，並通過使用\n匿名的錢，它是一個非常好的平臺。",
      "title": "絲綢之路導致了更安全的毒品使用，部分歸功於加密貨幣"
    }
  ]
}