{
  "author": "jawanda",
  "original_created_utc": 1630629551,
  "title": "Coinbase just sent $1k in btc to everyone who received a false \"2fa changed\" message and then immediately sold crypto",
  "created_utc": 1630636894,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I guess because some people panic sold. Imagine a bank doing that! I&#39;m pretty blown away. Only in the crypto world does &quot;bank error in your favor, receive $1000&quot; actually exist (well, where you can legally keep it anyway!) </p>\n\n<p>The email:</p>\n\n<blockquote>\n<blockquote>\n<p>We’re contacting you to follow up on a recent issue Coinbase experienced that resulted in an erroneous 2-step verification notification sent to you on August 27, 2021. We want to assure you that at no point was the security of your account compromised.</p>\n\n<p>Based on your trade activity after receiving that notification, it looks like you sold or withdrew some or all of your crypto. We recognize that this issue may have resulted in a poor experience for you.</p>\n\n<p>We want to make this right by issuing a one-time credit to your account $1000 USD worth of BTC. This credit will be issued to your Coinbase.com account within the next 24 hours. There is no action you need to take in order to receive this credit.</p>\n\n<p>Our goal is to be the most trusted crypto platform, and our work is never done when it comes to the security and support of our customers.</p>\n\n<p>If you need any additional assistance, please don’t hesitate to contact us! </p>\n</blockquote>\n</blockquote>\n\n<p>Two hours later .02 btc hit my account. What a time to be alive.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/pgufeb/coinbase_just_sent_1k_in_btc_to_everyone_who/",
  "subreddit": "CryptoCurrency",
  "id": "pgufeb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I guess because some people panic sold. Imagine a bank doing that! I'm pretty\nblown away. Only in the crypto world does \"bank error in your favor, receive\n$1000\" actually exist (well, where you can legally keep it anyway!)\n\nThe email:\n\n> > We’re contacting you to follow up on a recent issue Coinbase…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パニック的に売れる人がいるからだろう。銀行がそんなことをするとは想像もつかない。私はかなり\n驚いています。銀行のエラーがあなたに有利に働き、1000ドルを受け取る」ということが実際に存在するのは、暗号の世界だけです。\n1000ドル」が実際に存在するのは、暗号の世界だけです（まあ、法的に保管できる場所ではありますが\n\nメールの内容\n\n> > Coinbaseの最近の問題についてフォローアップするために連絡しています...",
      "title": "Coinbaseは、偽の「2fa changed」メッセージを受信し、すぐに暗号を売却した人全員に1kドルのbtcを送信しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我猜是因为有些人恐慌性地卖了。想象一下，银行会这么做吗？我很\n惊呆了。只有在加密货币世界里，\"银行错误对你有利，收到\n1000美元 \"实际上是存在的（好吧，反正你可以合法地保存它！）。\n\n这封电子邮件。\n\n> > 我们联系你是为了跟进最近的一个问题，Coinbase...",
      "title": "Coinbase刚刚向所有收到虚假的 \"2fa改变 \"信息，然后立即卖出加密货币的人发送了1千美元的btc。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我猜是因爲有些人恐慌性地賣了。想象一下，銀行會這麼做嗎？我很\n驚呆了。只有在加密貨幣世界裏，\"銀行錯誤對你有利，收到\n1000美元 \"實際上是存在的（好吧，反正你可以合法地保存它！）。\n\n這封電子郵件。\n\n> > 我們聯繫你是爲了跟進最近的一個問題，Coinbase...",
      "title": "Coinbase剛剛向所有收到虛假的 \"2fa改變 \"信息，然後立即賣出加密貨幣的人發送了1千美元的btc。"
    }
  ]
}