{
  "author": "spacej3di",
  "the_new_excerpt": "Dow (0.29%), S&P 500 (0.10%), Nasdaq (0.05%), Russell 2000 (0.25%)\n\n\n\n * Synopsis\n   * US equities finished lower in fairly uneventful Tuesday trading, selling\n     off through the afternoon to end a bit off worst levels. Followed a Monday\n     rally that saw the Dow, S&P and Nasdaq all up more than…",
  "original_created_utc": 1617741829,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ダウ(0.29%)、S&P500(0.10%)、ナスダック(0.05%)、ラッセル2000(0.25%)\n\n\n\n * あらすじ\n   * 米国の株式は、かなり平穏な火曜日の取引で低く終わりました。\n     午後には、最悪の水準から少し離れたところで売られて終わりました。月曜に行われた\n     月曜には、ダウ、S&P、ナスダックの株価が上昇しましたが、それに続いて...",
      "title": "米国市場の総括 - 2021年4月6日（火"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "道指(0.29%)、标普500(0.10%)、纳斯达克(0.05%)、罗素2000(0.25%)\n\n\n\n * 概要\n   * 美国股市在周二的交易中相当平淡地收盘下跌，卖出了大量的股票\n     关到下午结束一点最差的水平。继周一\n     涨幅，道指、标普和纳斯达克指数均上涨超过...",
      "title": "美国市场回顾--2021年4月6日，星期二"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "道指(0.29%)、標普500(0.10%)、納斯達克(0.05%)、羅素2000(0.25%)\n\n\n\n * 概要\n   * 美國股市在週二的交易中相當平淡地收盤下跌，賣出了大量的股票\n     關到下午結束一點最差的水平。繼週一\n     漲幅，道指、標普和納斯達克指數均上漲超過...",
      "title": "美國市場回顧--2021年4月6日，星期二"
    }
  ],
  "title": "U.S. Market Recap - Tuesday, April 6, 2021",
  "created_utc": 1617762678,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Dow (0.29%), S&amp;P 500 (0.10%), Nasdaq (0.05%), Russell 2000 (0.25%)</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Synopsis</strong>\n\n<ul>\n<li>US equities finished lower in fairly uneventful Tuesday trading, selling off through the afternoon to end a bit off worst levels. Followed a Monday rally that saw the Dow, S&amp;P and Nasdaq all up more than 1%. Sector performance was mixed and fairly bunched. Tech trailed with some weakness in semis and networking. Financials lagged on bank weakness. Consumer sectors outperformed. Utilities led the market. Treasuries were firmer with the curve flattening (10s back below 1.70%). Some discussion about very elevated short position in TLT. Dollar was weaker vs yen and euro. Gold finished up 0.8%. WTI crude ended up 1.2%, though off best levels, after falling more than 4.5% in the prior session.</li>\n<li>A very quiet day with few notable headlines. Bullish narrative remains underpinned by the same constellation of themes including reopening momentum, accelerating vaccinations, potential for $4T+ in new fiscal stimulus later this year, and Fed&#39;s high bar for tapering and liftoff. Some commentary as well about market growing more comfortable with higher rate backdrop. Earnings season shaping up as another potential tailwind for risk sentiment amid upward revision activity. Multiple compression from higher yields, taper tantrum, central bank policy mistake, new coronavirus variants, higher taxes, and margin pressure from higher input costs some of the more widely discussed risks.</li>\n<li>Major shift on the fiscal policy front was Monday&#39;s ruling by the Senate parliamentarian that <strong>Democrats can use reconciliation additional times this year</strong> to bypass GOP filibuster threats. However, Democrats still facing challenge of crafting a plan to appease its whole caucus (settling on a corporate tax rate an early challenge). Elsewhere, <strong>JOLTS job openings for February well ahead of expectations</strong>, while reports continue to highlight worker shortages. <strong>IMF raised global growth estimate</strong> by 50 bp to 6.0%. <strong>White House announced accelerated vaccination timeline</strong> while US vaccination rate nearly 5x faster than global average. Bloomberg had latest on <strong>China tightening credit</strong>.</li>\n<li><strong>BP</strong> expects to hit net debt target sooner than expected. <strong>ILMN</strong> positively preannounced and said most customers at or above pre-COVID levels. <strong>LUV</strong> latest airline to call pilots back to work. <strong>PSX</strong> negatively preannounced, partly due to headwinds from winter storm. <strong>PAYX</strong> down despite slightly better results and positive client retention comments. <strong>CS</strong> reported $4.7B hit from Archegos Capital saga, along buyback suspension, dividend reduction and management turnover. <strong>NCLH</strong> announced two-prong plan for returning to cruising outside US. <strong>DCT</strong> beat but guidance mixed. <strong>SIG</strong> announced acquisition of Rocksbox. <strong>Topps</strong> coming public via merger with SP@C MUDS.</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Digest</strong>\n\n<ul>\n<li><strong>Sector performance mixed with healthcare, tech trailing:</strong>\n\n<ul>\n<li><strong>Tech</strong> trailed the market with semis and networking/communication some of the drags. <strong>Healthcare</strong> underperformed amid weakness in pharma and managed care. <strong>Energy</strong> was weaker, with integrateds mixed and oil-services names largely lower. Road/rail names lagged in <strong>industrials</strong>, though airlines were better. <strong>Financials</strong> lagged the tape with banks generally lower alongside the pullback in Treasury yields. Media, entertainment, telecom were mostly better in <strong>communication services</strong>, thought the megacap internets were down. <strong>Materials</strong> was a relative outperformer, helped by precious metals and paper/packaging but seeing some drag from steel names. <strong>Consumer discretionary</strong> being boosted by retailers, restaurants, and leisure groups. <strong>Consumer staples</strong> saw strength in beverages and food-products stocks. <strong>Utilities</strong> led the market.</li>\n</ul></li>\n<li><strong>Senate parliamentarian allows Democrats to make another reconciliation push:</strong>\n\n<ul>\n<li>Democrats scored a key procedural win yesterday when Senate Parliamentarian MacDonough ruled they can pass additional measures for the current fiscal year through reconciliation, the simple-majority method allowing them to bypass an expected GOP filibuster (<a href=\"https://www.nytimes.com/2021/04/05/us/politics/democrats-senate-reconciliation-infrastructure.html\">NY Times</a>, <a href=\"https://thehill.com/homenews/senate/546215-senate-parliamentarian-to-let-democrats-bypass-filibuster-with-third-bill\">The Hill</a>). Majority Leader Schumer (D-NY) had argued a 1974 law allows budget resolutions to be revised, with which the parliamentarian concurred. Ruling opens key legislative pathway for Biden&#39;s expected two-phase infrastructure and stimulus plan but process still likely to be challenging as Democrats need to prevent any defections from their caucus, and more moderate Sens. Manchin and Sinema have argued against using reconciliation again this year. Reconciliation can also eat up large amounts of legislative floor time as both parties can offer multiple amendments. And not all bills can be passed through reconciliation (recall a minimum-wage component was stripped from Biden&#39;s $1.9T American Rescue Plan).</li>\n</ul></li>\n<li><strong>February job openings higher than expected, companies need workers:</strong>\n\n<ul>\n<li>Job openings increased by 268K, or 3.8% in February to just under 7.4M, well ahead of the 6.9M consensus. JPMorgan noted that the 615K increase in January and February represented the largest two-month gain for the series going back to 2000, apart from the sharp recovery in the early stages of the pandemic. Job openings rate increased by 0.2pp to 4.9%, and the hiring rate increased by 0.2pp to 4.0%. The quits rate was unchanged at 2.3%. Fits with heightened focus on labor market recovery following blowout March payrolls data last Friday. <a href=\"https://www.bloomberg.com/news/articles/2021-04-05/u-s-airlines-step-up-pilot-recalls-as-travel-demand-rebounds?sref=L75TRUmI\">Bloomberg</a> discussed how airlines are bringing back more pilots as travel demand rebounds. Delta was recently forced to cancel flights due to staffing shortages. <a href=\"https://www.reuters.com/article/us-usa-fast-food-labor/fast-food-struggles-to-hire-as-demand-soars-u-s-economy-roars-idUSKBN2BT1GB\">Reuters</a> highlighted the struggles the fast-food industry is having in trying to hire enough workers to keep up with a surge in sales. Noted that worker shortfall is hardly limited to hospitality.</li>\n</ul></li>\n<li><strong>Credit Suisse discloses $4.7B hit from Archegos fallout:</strong>\n\n<ul>\n<li>Credit Suisse said today it will take a $4.7B writedown related to the forced liquidations of positions held by Archegos Capital, the ~$10B family office of Bill Hwang, who founded and ran Tiger Asia. The bank said the charge will result in a pretax loss of 900M francs for Q1, cut its dividend by two-thirds and suspended share buybacks to protect its balance sheet. It also announced that the head of its investment bank and chief risk officer are both leaving the firm, though its CEO will stay on. In addition, it unloaded another $2.3B worth of stocks tied to Archegos on Monday. While analysts have been fairly quick to dismiss the systemic risks from the Archegos implosion, there have been concerns that the episode could ultimately lead prime brokers to implement more stringent capital requirements and dial back on credit availability, exacerbating thin liquidity conditions.</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Afternoon headlines:</strong></p>\n\n<ul>\n<li><strong>Economy:</strong>\n\n<ul>\n<li>Businesses struggling to hire enough workers as economic reopening gains momentum (<a href=\"https://www.reuters.com/article/us-usa-fast-food-labor/fast-food-struggles-to-hire-as-demand-soars-u-s-economy-roars-idUSKBN2BT1GB\">Reuters</a>, <a href=\"https://www.bloomberg.com/news/articles/2021-04-06/u-s-jobs-come-roaring-back-surprising-employers-and-economists?sref=L75TRUmI\">Bloomberg</a>, <a href=\"https://www.bloomberg.com/news/articles/2021-04-06/u-s-jobs-come-roaring-back-surprising-employers-and-economists?sref=J9GPLx1B\">WSJ</a>)</li>\n</ul></li>\n<li><strong>Economic policy/stimulus:</strong>\n\n<ul>\n<li>FL Rep. Hastings&#39; death leaves Pelosi with a very thin Democratic margin in the House (<a href=\"https://www.politico.com/news/2021/04/06/hastings-death-democratic-majority-479261\">Politico</a>)</li>\n</ul></li>\n<li><strong>Market:</strong>\n\n<ul>\n<li>Short interest in iShares 20+ Year Treasury Bond ETF hits highest level since early 2017 (<a href=\"https://www.bloomberg.com/news/articles/2021-04-06/short-bets-in-14-billion-treasury-etf-say-yield-calm-will-break?sref=L75TRUmI\">Bloomberg</a>)</li>\n</ul></li>\n<li><strong>Covid:</strong>\n\n<ul>\n<li>Youth sports may be driving a surge in coronavirus cases (<a href=\"https://www.washingtonpost.com/health/2021/04/06/youth-sports-outbreaks-covid-testing/\">Washington Post</a>)</li>\n</ul></li>\n<li><strong>World:</strong>\n\n<ul>\n<li>Iran said nuclear talks in Vienna were &#39;constructive&#39;, reiterates it won suspend enrichment push given US sanctions (<a href=\"https://www.reuters.com/article/us-iran-nuclear-usa-araqchi/iran-says-nuclear-talks-in-vienna-were-constructive-next-meeting-on-friday-idUSKBN2BT27V\">Reuters</a>)</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Notable Gainers:</strong>\n\n<ul>\n<li>+16.2% <strong>MUDS</strong> (Mudrick Capital Acquisition Corp. II): Announced merger with Topps; deal implies EV of ~$1.3B, or 12.5x projected 2021 EBITDA; Topps had record sales of $567M in 2020; former Disney Chairman and CEO Michael Eisner will become Chairman of Topps.</li>\n<li>+14.0% <strong>CARA</strong> (Cara Therapeutics): Company will be included in the S&amp;P SmallCap 600, effective prior to open on 8-Apr.</li>\n<li>+12.3% <strong>GNOG</strong> (Golden Nugget Online Gaming): Initiated buy at Jefferies; cited momentum following last year&#39;s New Jersey launch, which should provide framework for buildout through additional markets; also cited breadth of product with more than 870 titles, CRM capabilities.</li>\n<li>+7.9% <strong>ILMN</strong> (Illumina): Preliminary Q1 revenue ahead of consensus; highlighted record orders and strong sequencing consumables/instrument growth; said most consumables customers now at or above pre-Covid activity levels; raised FY21 revenue growth guidance.</li>\n<li>+5.1% <strong>SNAP</strong> (Snap): Upgraded to overweight from neutral at Atlantic Equities; cited recent pullback and shift toward more monetizable spent on the service.</li>\n<li>+4.6% <strong>NCLH</strong> (Norwegian Cruise Line Holdings): Announced two-pronged plan for returning to cruising within and outside US; includes phased resumption of sailings originating in Jamaica, Dominican Republic, Greece beginning in Jul-21; plan also includes restarting Us originations starting 4-Jul.</li>\n<li>+4.0% <strong>MILE</strong> (Metromile): Initiated at overweight at Piper Sandler; positive on innovative pay-per-mile insurance offering and AI-infused approach to underwriting and claims management; noted low penetration in an expansive market.</li>\n<li>+3.9% <strong>HBM</strong> (HudBay Minerals): Announced preliminary economic assessment of Mason copper project in Nevada with twice the copper resource of its existing deposits; double upgrade to buy from underperform by Bank of America, upgraded at other shops as well; also noted improved life of mine plans for Snow Lake and Constancia sites.</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Notable Decliners:</strong>\n\n<ul>\n<li>-12.9% <strong>EBON</strong> (Ebang International Holdings): Short-seller Hindenburg Research out with a cautious report; pushed back against company&#39;s claims that it is a &quot;leading bitc0in mining machine producer&quot;.</li>\n<li>-4.9% <strong>PAYX</strong> (Paychex): FQ3 earnings were slightly ahead with revenue down, as expected, though guidance worse; PEO and Insurance Services segment missed on sales while Management Solutions beat; interest earnings were light as well; noted record client retention amidst continued Covid uncertainties; analysts cited underperformance vs peers with a software model.</li>\n<li>-4.7% <strong>GBX</strong> (Greenbrier Cos.): FQ2 revenue and GM missed; earnings beat with help from taxes; flagged weak Manufacturing demand environment and winter-weather closures as well as continued decreased Repair volumes.</li>\n<li>-2.6% <strong>ACAD</strong> (Acadia Pharmaceuticals): Downgraded to hold from buy at Jefferies following yesterday&#39;s FDA decision on its dementia-related psychosis candidate; noted likely additional research means launch may be pushed out to 2024; also downgraded at Canaccord Genuity.</li>\n<li>-1.5% <strong>AB</strong> (AllianceBernstein): Downgraded to market perform from outperform at Keefe, Bruyette &amp; Woods; cited valuation as share prices have reached their target after outperforming the market by 14% ytd and 55% over the past year.</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>S&amp;P 500 Sector Performance</strong>\n\n<ul>\n<li><strong>Outperformers:</strong> Utilities +0.53%, Consumer Spls. +0.33%, Consumer Disc. +0.33%, REITs +0.24%, Materials +0.23%, Communication Svcs. +0.07%</li>\n<li><strong>Underperformers:</strong> Tech (0.38%), Healthcare (0.36%), Industrials (0.26%), Energy (0.26%), Financials (0.11%)</li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Data</strong>\n\n<ul>\n<li>DXY: 92.34, (0.28)</li>\n<li>€-$ +0.0058 or +0.49% to 1.1872</li>\n<li>£-$ (0.0069) or (0.50%) to 1.3828</li>\n<li>$-¥ (0.40) or (0.36%) to 109.79</li>\n<li>€-¥ +0.22 or +0.17% to 130.38</li>\n<li>2-year yield (1) bps to 0.16%</li>\n<li>10-year yield (5) bps to 1.65%</li>\n<li>30-year yield (5) bps to 2.32%</li>\n<li>WTI Crude (May 21): +$0.73 or +1.24% to $59.38</li>\n<li>Gold (Jun 21): +$14.10 or +0.82% to $1742.9</li>\n<li>Breadth on the NYSE is positive 1.55:1; breadth on the Nasdaq is negative 1.09:1</li>\n<li>Index Performance\n\n<ul>\n<li>Month/Quarter-to-date: Dow +1.36%, S&amp;P +2.54%, Nasdaq +3.41%, Russell +1.74%</li>\n<li>Year-to-date: Dow +9.23%, S&amp;P +8.46%, Nasdaq +6.29%, Russell +14.40%</li>\n</ul></li>\n</ul></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 69,
  "permalink": "/r/stocks/comments/mll9l4/us_market_recap_tuesday_april_6_2021/",
  "subreddit": "stocks",
  "id": "mll9l4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961880355
}