{
  "author": "Ghostserpent",
  "the_new_excerpt": "The Basics of NANO\n\nNANO's entire purpose is to be the most efficient currency possible. It is\ninstant, feeless, and decentralized. NANO uses a unique type of blockchain\ncalled a block lattice, where each account is its own blockchain. This is what\nallows it to be so efficient.\n\nNANO vs. Fiat…",
  "original_created_utc": 1611886487,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "NANO的基础知识\n\nNANO的全部目的是成为最有效的货币。它是\n即时、无感、去中心化。NANO使用的是一种独特的区块链类型\n称为区块格，每个账户都是自己的区块链。这就是\n让它能够如此高效。\n\n纳诺与菲亚特...",
      "title": "NANO的牛市案例--去中心化货币的未来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "NANO的基礎知識\n\nNANO的全部目的是成爲最有效的貨幣。它是\n即時、無感、去中心化。NANO使用的是一種獨特的區塊鏈類型\n稱爲區塊格，每個賬戶都是自己的區塊鏈。這就是\n讓它能夠如此高效。\n\n納諾與菲亞特...",
      "title": "NANO的牛市案例--去中心化貨幣的未來。"
    }
  ],
  "title": "The Bull Case for NANO - The Future of Decentralized Money",
  "created_utc": 1611919935,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>The Basics of NANO</strong></p>\n\n<p>NANO&#39;s entire purpose is to be the most efficient currency possible. It is instant, feeless, and decentralized. NANO uses a unique type of blockchain called a <em>block lattice,</em> where each account is its own blockchain. This is what allows it to be so efficient.</p>\n\n<p><strong>NANO vs. Fiat Currency and Stable Coins</strong></p>\n\n<p>A currency should not only be a medium of exchange, but a store of value as well. The US dollar lost 12% of its value in 2020. That is because 22% of all US dollars to ever exist were printed in 2020. Unlike the dollar, NANO has a capped supply of 133,248,297. It is impossible to create more. Another problem with fiat currency is that it has boundaries. If you want to pay someone in another country, you have to send them your native currency. They must take this currency and convert it to their own; which costs fees and wasted time. NANO has no boundaries. You can send it anywhere on the planet instantly without fees. </p>\n\n<p>While we are on the topic of fiat, many people like to argue that stable coins are a better alternative to nano; main reason being their lack of volatility. Stable coins defeat the entire purpose of cryptocurrency. They are the exact same thing as fiat. They suffer from inflation and government control because they are pegged to the same dollars that are printed every year. </p>\n\n<p>Outside of the United States, countries like Venezuela are in need of something like NANO to save them from economic collapse. They have gone through hyperinflation, which has devalued the Venezuelan bolívar by over 10,000% in just a few years. </p>\n\n<p><strong>Why Would Businesses Accept NANO?</strong></p>\n\n<p>Businesses of all sizes benefit from accepting NANO. The average credit card fee generally ranges from 1% to 3%. That is about 2% of revenue that every single company is losing in transaction fees every year. In 2019, Amazon&#39;s revenue was 280 billion dollars. They lost around 5.6 billion to transaction fees alone. Had they used a feeless alternative like NANO, they would have paid $0 in fees. </p>\n\n<p><strong>Community</strong></p>\n\n<p>NANO has one of the most enthusiastic communities out there. They are constantly creating new ways to use NANO. For example, one of the community members created an app called WeNano. This app allows you to set up a spot anywhere in the world, and people can go to that location to collect NANO (Similar to pokemon go, but with NANO instead). </p>\n\n<p>NANO also has one of the most active communities. Nano is almost always a top 10 mention coin on Twitter. The community is so passionate that they will tell everyone they know about it. </p>\n\n<p><strong>Energy Use</strong></p>\n\n<p>As the world moves towards being more environmentally friendly, NANO is the perfect currency. It uses millions of times less energy to run the network than bitcoin. That is not an exaggeration either. </p>\n\n<p>Here is an article that explains how efficient nano is. The network could be run on just one wind turbine. <a href=\"https://medium.com/@brunoerg/nano-is-green-d2f5cbf0e1d9\">https://medium.com/@brunoerg/nano-is-green-d2f5cbf0e1d9</a></p>\n</div><!-- SC_ON -->",
  "score": 437,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/sgenn7OLQbOy252RPvC-5NUnabRHqqkeLiskIz-OKeA.jpg?auto=webp&s=21d07e6f3755ba8e44ddd41c9ec458c447e28fdd",
          "width": 768,
          "height": 432
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/sgenn7OLQbOy252RPvC-5NUnabRHqqkeLiskIz-OKeA.jpg?width=108&crop=smart&auto=webp&s=814bcf47ed8bbabb9a4c3c2bba4c79a27f56df62",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/sgenn7OLQbOy252RPvC-5NUnabRHqqkeLiskIz-OKeA.jpg?width=216&crop=smart&auto=webp&s=2846ec574d3736b2744dd42311ad6b77b7458de8",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/sgenn7OLQbOy252RPvC-5NUnabRHqqkeLiskIz-OKeA.jpg?width=320&crop=smart&auto=webp&s=785506295d9540f383b2d7f61a6abb84ac73595b",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/sgenn7OLQbOy252RPvC-5NUnabRHqqkeLiskIz-OKeA.jpg?width=640&crop=smart&auto=webp&s=9e2e043e16c5b0daf3f2e55070974b475753973c",
            "width": 640,
            "height": 360
          }
        ],
        "variants": {},
        "id": "Wv5cgbsHkWwtdBUgiAZ-yaYhwtHvQ3JtIuSlfvo_un0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/l7g9ib/the_bull_case_for_nano_the_future_of/",
  "subreddit": "CryptoCurrency",
  "id": "l7g9ib",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518527081
}