{
  "author": "xcupcakekitten",
  "the_new_excerpt": "I sleep 12-14 hours a night. And sometimes a 2-3 hour nap during the day. I love\nbeing asleep and always have super vivid dreams. I can’t explain the feeling.\nIt’s what I imagine being high feels like since I’ve never been high. I’m\naddicted.\n\nMy alarm went off today at 10:30 because I wanted to…",
  "original_created_utc": 1611508680,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我每晚睡12-14小时。有时候白天也会睡2-3个小时的午觉。我爱\n正在睡梦中，总是做着超级生动的梦。我无法解释这种感觉。\n这就是我想象中的嗑药的感觉，因为我从来没有嗑过药。我是...\n上瘾了\n\n我的闹钟今天10点半响了，因为我想... ...",
      "title": "有人睡觉会上瘾吗？[严肃]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每晚睡12-14小時。有時候白天也會睡2-3個小時的午覺。我愛\n正在睡夢中，總是做着超級生動的夢。我無法解釋這種感覺。\n這就是我想象中的嗑藥的感覺，因爲我從來沒有嗑過藥。我是...\n上癮了\n\n我的鬧鐘今天10點半響了，因爲我想... ...",
      "title": "有人睡覺會上癮嗎？[嚴肅]"
    }
  ],
  "title": "Can someone be addicted to sleep? [serious]",
  "created_utc": 1611524473,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I sleep 12-14 hours a night. And sometimes a 2-3 hour nap during the day. I love being asleep and always have super vivid dreams. I can’t explain the feeling. It’s what I imagine being high feels like since I’ve never been high. I’m addicted. </p>\n\n<p>My alarm went off today at 10:30 because I wanted to wake up at a decent hour but I don’t have to be anywhere until 2 today so I turned off my alarm and slept till 12. Ugh I wish I could’ve slept more it felt so good but I need to start getting ready. </p>\n\n<p>When I don’t have work I sleep all day. I just love how it feels. It makes me feel so warm and happy and wonderful. It’s like a drug. </p>\n\n<p>I’m 27 and have been like this since high school. </p>\n\n<p>I’d rather just sleep all day and enjoy myself than do anything productive. This can’t be healthy and I don’t know how to break it. </p>\n\n<p>It doesn’t help that whenever I wake up I’m usually tired. No matter how many hours I get. 5, 8, 10, 12. All tired. So I always opt for more sleep unless I have to go somewhere. Some days I even call out of work because of how painfully tired I am just to sleep. </p>\n\n<p>I try to wake up earlier and I just always hit snooze. </p>\n\n<p>I know this is bad for me but at the same time I don’t want to give it up. It feels so good.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/NoStupidQuestions/comments/l43iyu/can_someone_be_addicted_to_sleep_serious/",
  "subreddit": "NoStupidQuestions",
  "id": "l43iyu",
  "is_self": true,
  "media": null,
  "is_video": false
}