{
  "author": "nodirector011",
  "original_created_utc": 1654594907,
  "title": "Women of Reddit, what do you think of being roommates with a woman who likes girls?",
  "created_utc": 1654611507,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a queer woman, I&amp;#39;m curious as to how other women perceive this situation. Also, would you change infront of them?&lt;/p&gt;\n\n&lt;p&gt;Edit: I was asking because my past roommate had no problem changing in front of me even if we were not that close, I discussed this to my female friends and some said it was weird and some said they don&amp;#39;t particularly care abt changing in front of others as long as theyre not fully naked so i asked the internet about their stand on this bcos ive gotten mixed opinions&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/AskWomen/comments/v6r97t/women_of_reddit_what_do_you_think_of_being/",
  "subreddit": "AskWomen",
  "id": "v6r97t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a queer woman, I'm curious as to how other women perceive this situation.\nAlso, would you change infront of them?\n\nEdit: I was asking because my past roommate had no problem changing in front of\nme even if we were not that close, I discussed this to my female friends and\nsome said it was weird…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クィアな女性として、他の女性がこの状況をどのように受け止めているのか気になります。\nまた、あなたは彼らの前で着替えますか？\n\n編集部：私がこの質問をしたのは、過去のルームメイトが、それほど親しくなくても、私の前で着替えることに問題がなかったからです。\nこのことを女友達に話したら、変だと言われました。\n変だと言われましたが...。",
      "title": "Redditの女性たち、女の子好きな女性とルームメイトになることをどう思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一名同性恋女性，我很好奇其他女性如何看待这种情况。\n另外，你会在他们面前换衣服吗？\n\n编辑：我问这个问题是因为我过去的室友在我面前换衣服是没有问题的，即使我们不是那么亲密。\n我和我的女性朋友讨论过这个问题，有些人说这很奇怪。\n有些人说这很奇怪...",
      "title": "Reddit的女性朋友们，你们对与喜欢女孩的女人做室友有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一名同性戀女性，我很好奇其他女性如何看待這種情況。\n另外，你會在他們面前換衣服嗎？\n\n編輯：我問這個問題是因爲我過去的室友在我面前換衣服是沒有問題的，即使我們不是那麼親密。\n我和我的女性朋友討論過這個問題，有些人說這很奇怪。\n有些人說這很奇怪...",
      "title": "Reddit的女性朋友們，你們對與喜歡女孩的女人做室友有什麼看法？"
    }
  ]
}