{
  "author": "mehoymegoy",
  "original_created_utc": 1629121109,
  "title": "What was the US actually doing in Afghanistan the last two decades?",
  "created_utc": 1629132486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay I’ve done as much research on this that I possibly can, but I’m not a military person so I don’t really fully understand. I read that the US signed a peace agreement with the Taliban in February of 2020 agreeing to remove troops in 14 months (if the Taliban upheld the terms). Then Biden decided to pull troops early. I also read that the Afghan government and the Taliban had set up a peace agreement but it never came to fruition or was signed. </p>\n\n<p>Also, I have seen many people on Reddit saying once the US left, the Taliban taking over was inevitable, whether it happened in 2003 or 2010 or 2021 or even later. If that’s the case, what was the US even doing for 20 years? Why did the US stay as long as we did? </p>\n\n<p>I know a lot of people have asked about the current situation…. But I haven’t found an answer to my question. If anyone knows of one elsewhere please link!!</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/TooAfraidToAsk/comments/p5g8n4/what_was_the_us_actually_doing_in_afghanistan_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "p5g8n4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay I’ve done as much research on this that I possibly can, but I’m not a\nmilitary person so I don’t really fully understand. I read that the US signed a\npeace agreement with the Taliban in February of 2020 agreeing to remove troops\nin 14 months (if the Taliban upheld the terms). Then Biden decided…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "できるだけ多くのことを調べましたが、私は軍人ではありません。\n私は軍人ではないので、完全には理解できません。アメリカがタリバンと和平協定を結んだという記事を読みました。\nアメリカは2020年2月にタリバンと和平協定を結び、14ヶ月で軍隊を撤退させることに合意したと読みました。\nアメリカは2020年2月にタリバンと和平協定を結び、14ヶ月後に軍隊を撤退させることに同意したと読みました。その後、バイデンは...",
      "title": "この20年間、アメリカはアフガニスタンで実際に何をしていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我已经尽可能多地做了这方面的研究，但我不是一个军事人员，所以我不太了解。\n但我不是军人，所以我并不完全了解。我读到，美国在2020年2月与塔利班签署了一项\n2020年2月，美国与塔利班签署了一项和平协议，同意在14个月内撤走军队。\n在14个月内撤军（如果塔利班坚持这些条款）。然后拜登决定...",
      "title": "在过去的二十年里，美国在阿富汗究竟在做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我已經儘可能多地做了這方面的研究，但我不是一個軍事人員，所以我不太瞭解。\n但我不是軍人，所以我並不完全瞭解。我讀到，美國在2020年2月與塔利班簽署了一項\n2020年2月，美國與塔利班簽署了一項和平協議，同意在14個月內撤走軍隊。\n在14個月內撤軍（如果塔利班堅持這些條款）。然後拜登決定...",
      "title": "在過去的二十年裏，美國在阿富汗究竟在做什麼？"
    }
  ]
}