{
  "author": "martinvandepas",
  "the_new_excerpt": "I found this in the fine print of one of my Robinhood trade confirmations:\n\n>  1. Upon written request and where available, further details of items herein\n>     will be provided including: the execution date and time, the counterparty\n>     when acting as agent, the detailed breakdown of fees and…",
  "original_created_utc": 1613266092,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在我的一份Robinhood交易确认书中发现了这个。\n\n> 1. 根据书面要求，如果有的话，这里的项目的进一步细节。\n> 将提供包括：执行日期和时间、交易对手。\n>代理时，详细的费用明细和...",
      "title": "如果我们问，Robinhood必须告诉我们，他们每做一笔交易，到底卖出订单流赚了多少钱。我很想知道 你想知道吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在我的一份Robinhood交易確認書中發現了這個。\n\n> 1. 根據書面要求，如果有的話，這裏的項目的進一步細節。\n> 將提供包括：執行日期和時間、交易對手。\n>代理時，詳細的費用明細和...",
      "title": "如果我們問，Robinhood必須告訴我們，他們每做一筆交易，到底賣出訂單流賺了多少錢。我很想知道 你想知道嗎？"
    }
  ],
  "title": "If we ask, Robinhood has to tell us exactly how much they made selling order flow for every single trade we made. I would like to know. Would you?",
  "created_utc": 1613278573,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I found this in the fine print of one of my Robinhood trade confirmations:</p>\n\n<blockquote>\n<ol>\n<li><p>Upon written request and where available, further details of items herein will be provided including: the execution date and time, the counterparty when acting as agent, <strong>the detailed breakdown of fees and the remuneration details</strong>, if any, to RHS, or RHF for directing orders to select market participants and details of provisions that may cause a call or prepayment.  </p></li>\n<li><p>RHS receives remuneration for directing orders to particular brokerdealers or market centers for execution. Such remuneration is considered compensation to the firm. <strong>The source and nature in connection with your transactions are available upon written request.</strong> RHF, when clearing through RHS, may share in such payments or may directly receive payment for order flow for certain transactions. Details are available upon written request.</p></li>\n</ol>\n</blockquote>\n\n<p>Yes! Actually I very much would like to know who they sold my order flow to and how much they got for it!</p>\n\n<p>So I went to Account -&gt; Contact Us -&gt; &quot;I have a different question&quot; -&gt; &quot;Documents and Taxes&quot; -&gt; &quot;Trade Confirmations&quot; -&gt; &quot;Contact Us&quot; and I asked them this:</p>\n\n<pre><code>Please send me all information available about my trades from Jan 7th 2021\nthrough Feb 12th 2021. Please include: &quot;the execution date and time, the\ncounterparty when acting as agent, the detailed breakdown of fees and the\nremuneration details, if any, to RHS, or RHF for directing orders to select\nmarket participants and details of provisions that may cause a call or\nprepayment.&quot; Thank you.\n</code></pre>\n\n<p>You can ask for whatever dates are of interest to you. <em>This may take Robinhood some time to research.</em> Their system was so easily overwhelmed a few weeks ago I wonder if they are equipped to scale up and provide this information to all of <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a>. I, for one, would like to see how much they made from frontrunning my trades. I would like to know.</p>\n</div><!-- SC_ON -->",
  "score": 8620,
  "permalink": "/r/wallstreetbets/comments/lje81e/if_we_ask_robinhood_has_to_tell_us_exactly_how/",
  "subreddit": "wallstreetbets",
  "id": "lje81e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728630687
}