{
  "author": "Many_Arm7466",
  "original_created_utc": 1633089688,
  "title": "How Do You Guys Still have money to buy the Dip?",
  "created_utc": 1633113941,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every time I am on this sub all I see is “buy”, “buy now you will never see this low of prices again”... “Wow what a discount you will never get BTC below 40K again”. So I follow the advice on this sub and buy but then it ends up being a multilayer dip or there is an even bigger dip a couple days later and I am out of funds to buy.</p>\n\n<p>Which raises my question of how are you guys not broke yet buying all these dips??? Is there a certain strategy you guys use or is there something I’m doing wrong? Or does the average person on this sub just have an unlimited amount of money to keep putting into Crypto?</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/pz6ikr/how_do_you_guys_still_have_money_to_buy_the_dip/",
  "subreddit": "CryptoCurrency",
  "id": "pz6ikr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every time I am on this sub all I see is “buy”, “buy now you will never see this\nlow of prices again”... “Wow what a discount you will never get BTC below 40K\nagain”. So I follow the advice on this sub and buy but then it ends up being a\nmultilayer dip or there is an even bigger dip a couple days…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトを見るたびに、「買え」「今買え」ばかりが目につきますが、このようなことは決してありません。\nこんなに安い価格は二度と見られない」... \"Wow what a discount you will never get BTC below 40K\"...\nといったものです。私はこのサブサイトのアドバイスに従って購入しましたが、その後、それは多層のディップになったり\n数日後にはさらに大きなディップがあったりして...。",
      "title": "あなた方はまだディップを買うお金があるのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每次我在这个网站上看到的都是 \"购买\"，\"现在购买，你将永远不会看到这么低的价格\"。\n币的价格\"...... \"哇，好大的折扣，你将永远不会得到低于40K的BTC\n再也买不到BTC了\"。所以我听从了这个子网站上的建议，买入了，但最后却成了一个\n多层下跌或几天后有一个更大的下跌......",
      "title": "你们这些人怎么还有钱去买蘸酱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每次我在這個網站上看到的都是 \"購買\"，\"現在購買，你將永遠不會看到這麼低的價格\"。\n幣的價格\"...... \"哇，好大的折扣，你將永遠不會得到低於40K的BTC\n再也買不到BTC了\"。所以我聽從了這個子網站上的建議，買入了，但最後卻成了一個\n多層下跌或幾天後有一個更大的下跌......",
      "title": "你們這些人怎麼還有錢去買蘸醬？"
    }
  ]
}