{
  "author": "BTC_Hadzija",
  "the_new_excerpt": "PSA for anybody in here, especially people who compare their gains to others,\ngive in to FOMO and are hitting their heads due to thinking in hindsight.\n\nThe vast majority of people do not invest any kind of money into their future,\nall they think about is how to spend it on material stuff - as long…",
  "original_created_utc": 1620773628,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいる人、特に自分の利益を他人と比較してしまう人への警告です。\n特に、自分の利益を他人と比較したり、FOMOに屈したり、後知恵で考えて頭を抱えている人には注意が必要です。\n\n大多数の人は、自分の将来にどんなお金も投資しません。\n彼らが考えているのは、いかにして物質的なものにお金を使うかということだけです。",
      "title": "100ドルの投資でも10万ドルの投資でも、この領域にいるならば、あなたはずっと先を行っていることになる...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为这里的任何人提供PSA，特别是那些将自己的收益与他人进行比较的人。\n屈服于FOMO，并且由于事后诸葛亮的思考而撞得头破血流。\n\n绝大多数人都没有为自己的未来投资任何形式的钱。\n他们所想的是如何把钱花在物质方面--只要...",
      "title": "无论你是投资了100美元还是10万美元，如果你在这个空间，你就会领先于行..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲這裏的任何人提供PSA，特別是那些將自己的收益與他人進行比較的人。\n屈服於FOMO，並且由於事後諸葛亮的思考而撞得頭破血流。\n\n絕大多數人都沒有爲自己的未來投資任何形式的錢。\n他們所想的是如何把錢花在物質方面--只要...",
      "title": "無論你是投資了100美元還是10萬美元，如果你在這個空間，你就會領先於行..."
    }
  ],
  "title": "Whether you've invested 100$ or 100k, if you're in this space, you're way ahead of the line...",
  "created_utc": 1620782583,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>PSA for anybody in here, especially people who compare their gains to others, give in to FOMO and are hitting their heads due to thinking in hindsight.</p>\n\n<p>The vast majority of people do not invest any kind of money into their future, all they think about is how to spend it on material stuff - as long as you&#39;re intrigued by the idea of holding a bunch of currencies that could potentially bring you financial freedom in the future - you&#39;re doing really great!</p>\n\n<p>You really don&#39;t have to catch the next big thing or every single moonshot opportunity, as long as you&#39;re in crypto and chipping in funds every now and then, you&#39;re setting yourself up for great success in the future.</p>\n\n<p>Once you&#39;ve made substantial gains is also isn&#39;t a bad idea to diversify your investments, but that&#39;s on you. Getting out of debt is an investment too. Taking the time to understand projects and learn new things is an investment in yourself.  </p>\n\n<p>Edit: Pressed enter too early.   </p>\n\n<p>Anyways, props to you for being here and keep up being part of a global change for the better. You&#39;re killing it!   </p>\n</div><!-- SC_ON -->",
  "score": 11234,
  "permalink": "/r/CryptoCurrency/comments/naa4sq/whether_youve_invested_100_or_100k_if_youre_in/",
  "subreddit": "CryptoCurrency",
  "id": "naa4sq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992431
}