{
  "author": "ChubbyHistorian",
  "original_created_utc": 1636041758,
  "title": "The First World War was a politically radicalizing event for many German soldiers. Has there ever been a demonstrated link between the kind of combat experienced and the direction of political radicalization? (e.g., Right-wing Freikorps from the frontlines, or Communists from Eastern Front POWs)",
  "created_utc": 1636086420,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had a professor claim soldiers who were captured by the Russians were often successfully radicalized to Communism, and I am curious how well this notion is supported. It would obviously be hard to disentangle cause and effect, for example: the rank-and-file Navy was a consistent hard-left force, but that was probably as much to do with the urban milieu many seamen came from as the conditions onboard the ships.</p>\n\n<p>The broad variables I am interested in is: where they fought, how much combat they saw, POW status, and branch of service. The stereotype I&#39;ve heard is that soldiers behind the lines, captured, or waiting to be deployed tended to form councils to resist further involvement (which on average pushed them to the Left), seeing the war as pointless, while those who experienced lots of horrific trench warfare saw others betraying their sacrifice by not adequately supporting victory (on average pushing them Right). But no one has pointed to me to any actual data on this, beyond anecdotes and stereotypes.</p>\n\n<p>I hope this question makes sense.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qmnur4/the_first_world_war_was_a_politically/",
  "subreddit": "AskHistorians",
  "id": "qmnur4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had a professor claim soldiers who were captured by the Russians were often\nsuccessfully radicalized to Communism, and I am curious how well this notion is\nsupported. It would obviously be hard to disentangle cause and effect, for\nexample: the rank-and-file Navy was a consistent hard-left force,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシア軍に捕らえられた兵士は、しばしば共産主義に過激化すると主張する教授がいました。\n共産主義への急進化に成功したと主張する教授がいましたが、この考えがどれほど支持されているのか気になります。\nこの考えがどの程度支持されているのか気になります。原因と結果を切り離すのは難しいでしょう。\n例えば、海軍の隊員は一貫して左翼強硬派であり、...。",
      "title": "第一次世界大戦は、多くのドイツ兵にとって政治的に過激な出来事でした。どのような戦闘を経験したかということと、政治的に先鋭化する方向性との間には、これまでに実証された関連性があるのでしょうか？(例：前線の右翼フライコルプ、東部戦線の捕虜の共産主義者など)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个教授声称，被俄国人俘虏的士兵往往会成功地激进到共产主义。\n我很好奇这种说法有多大的支持率。\n支持。显然，很难区分因果关系。\n例如：海军官兵是一支稳定的硬左派力量，......。",
      "title": "第一次世界大战对许多德国士兵来说是一个政治上的激进事件。在所经历的战斗种类和政治激进化的方向之间，是否曾有明显的联系？(例如，来自前线的右翼自由军，或来自东线战俘的共产党员)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個教授聲稱，被俄國人俘虜的士兵往往會成功地激進到共產主義。\n我很好奇這種說法有多大的支持率。\n支持。顯然，很難區分因果關係。\n例如：海軍官兵是一支穩定的硬左派力量，......。",
      "title": "第一次世界大戰對許多德國士兵來說是一個政治上的激進事件。在所經歷的戰鬥種類和政治激進化的方向之間，是否曾有明顯的聯繫？(例如，來自前線的右翼自由軍，或來自東線戰俘的共產黨員)"
    }
  ]
}