{
  "author": "PrestigiousCommand85",
  "original_created_utc": 1655014805,
  "title": "Is there a way to tell if a product is made from BPA plastics over say, another plastic like ABS, if there are no recycling symbols given?",
  "created_utc": 1655053218,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Asking because I have fake nails I glue onto my fingers, which means I’m in skin contact with plastic for weeks and through hot showers. I’ve heard BPA is a big issue in both these situations so I’m a bit concerned. Is there any way to test this at home? For example, through their reaction with alcohol or through testing their melting point?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/askscience/comments/vafu59/is_there_a_way_to_tell_if_a_product_is_made_from/",
  "subreddit": "askscience",
  "id": "vafu59",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Asking because I have fake nails I glue onto my fingers, which means I’m in skin\ncontact with plastic for weeks and through hot showers. I’ve heard BPA is a big\nissue in both these situations so I’m a bit concerned. Is there any way to test\nthis at home? For example, through their reaction with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "指に接着剤でつけるつけ爪があるので、肌身離さずということでお願いします。\n何週間もプラスチックに触れ、熱いシャワーを浴びています。BPAが大きな問題だと聞いたことがあります。\nと聞いたことがあるので、ちょっと心配です。自宅で検査する方法はありますか？\n家庭で検査する方法はありますか？例えば、...",
      "title": "リサイクルマークがない製品で、BPAプラスチックが使われているか、ABSなどの他のプラスチックが使われているか、見分ける方法はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "问这个问题是因为我的假指甲是用胶水粘在手指上的，这意味着我在皮肤上。\n与塑料接触了好几个星期，还洗过热水澡。我听说在这两种情况下，双酚A是一个大问题，所以我有点担心。\n在这两种情况下都是一个大问题，所以我有点担心。有什么方法可以测试\n这一点？例如，通过他们的反应与...",
      "title": "如果没有给出回收标志，是否有办法判断产品是由双酚A塑料制成，而不是像ABS这样的其他塑料？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "問這個問題是因爲我的假指甲是用膠水粘在手指上的，這意味着我在皮膚上。\n與塑料接觸了好幾個星期，還洗過熱水澡。我聽說在這兩種情況下，雙酚A是一個大問題，所以我有點擔心。\n在這兩種情況下都是一個大問題，所以我有點擔心。有什麼方法可以測試\n這一點？例如，通過他們的反應與...",
      "title": "如果沒有給出回收標誌，是否有辦法判斷產品是由雙酚A塑料製成，而不是像ABS這樣的其他塑料？"
    }
  ]
}