{
  "author": "ok-nw",
  "original_created_utc": 1655882127,
  "title": "The girl (20F) I have a crush on invited me(27M) on a walk, but she is in a relationship with a very difficult man. Should I go?",
  "created_utc": 1655913360,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I have a crush on her but she is with someone and that someone is much older than both of us. Maybe 10 years older than me. I know he is bad to her and even hits and pushes her, while she is very fragile and sweet. We work at the same place, me and her. She is just for summer here while I am employed as an engineer. We got along very well, she is a very beautiful inside and out girl. A few days ago she got sick at work, very sick. She needed to go to hospital. Obviously she called him to pick her up with the car and he told her is busy and she should find someone else. I took her to the hospital and waited until she was better. They actually told her that she feels that way because of stress. She was also crying and at the end of the check up that lasted like 2 hours, she got an appointment with the hospitals clinical psychologists. I dared to ask her why she feels bad and she told me her mother died a few weeks ago. But I know for sure from a co-worker, both of her parents died 4 years ago.&lt;/p&gt;\n\n&lt;p&gt;Yesterday morning I went to see her at our work place to ask if she feels better. She was indeed better and her very pale face finally got some colour. She was very nice to me and thanked me for everything. Then she insisted we go for a walk after job tomorrow He works just a few buildings apart, as this is a corporate complex. I told her it would not be OK, given the fact she is in a relationship and she told me he will not know and anyway he wouldn&amp;#39;t mind at all, that he is very chill. I asked her... then why he should not know? And she said it might be better for me to feel more comfortable. She put her hands on my shoulders and even kissed me on cheek when we parted ways. Today she came to me and told me he will be out of town and we can go out. It is just a &amp;quot;thank you walk&amp;quot;, nothing else. Should I go?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/vhz6ht/the_girl_20f_i_have_a_crush_on_invited_me27m_on_a/",
  "subreddit": "NoStupidQuestions",
  "id": "vhz6ht",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have a crush on her but she is with someone and that someone is much older\nthan both of us. Maybe 10 years older than me. I know he is bad to her and even\nhits and pushes her, while she is very fragile and sweet. We work at the same\nplace, me and her. She is just for summer here while I am…"
}