{
  "author": "UniversityOfPain",
  "original_created_utc": 1656221145,
  "title": "Why is breastfeeding offensive?",
  "created_utc": 1656236928,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know its kinda a cliche topic among feminists but I witnessed someone vocalize their grievances toward a breastfeeding mother in public for the first time today. I never heard someone actually be upset about that before, I thought it was something only ppl in like, the deep south or some fundamentalist country would care about. I thought he was joking to be honest.&lt;/p&gt;\n\n&lt;p&gt;I dont want this post to be a circlejerk for progressives, I actually want to know what about the human breast is offensive? Whats the rationale?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/vkxdzi/why_is_breastfeeding_offensive/",
  "subreddit": "TooAfraidToAsk",
  "id": "vkxdzi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know its kinda a cliche topic among feminists but I witnessed someone vocalize\ntheir grievances toward a breastfeeding mother in public for the first time\ntoday. I never heard someone actually be upset about that before, I thought it\nwas something only ppl in like, the deep south or some…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フェミニストの間では陳腐な話題ですが、ある人がこう言うのを目撃しました。\nを声高に主張するのを目撃した。\n今日、初めて目撃しました。今までそんなことで、誰かが怒っているのを聞いたことがありません。\nそんなの南部に住む人たちだけだと思ってた。",
      "title": "なぜ母乳育児は不快なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这在女权主义者中是个老生常谈的话题，但我目睹了有人第一次在公共场合对一位母乳喂养的母亲表达不满。\n他们对一位母乳喂养的母亲的不满，这还是第一次。\n今天。我从来没有听说过有人真的为此感到不安，我以为\n我还以为只有南方的人才会这样。",
      "title": "为什么母乳喂养会令人反感？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這在女權主義者中是個老生常談的話題，但我目睹了有人第一次在公共場合對一位母乳餵養的母親表達不滿。\n他們對一位母乳餵養的母親的不滿，這還是第一次。\n今天。我從來沒有聽說過有人真的爲此感到不安，我以爲\n我還以爲只有南方的人才會這樣。",
      "title": "爲什麼母乳餵養會令人反感？"
    }
  ]
}