{
  "author": "FakeAaronRogers",
  "original_created_utc": 1632638236,
  "title": "[23 M] A woman I've never met is offering me $5000 weekly to be her \"sugar baby\". I desperately need the money but I don't want to take advantage of her. What should I do?",
  "created_utc": 1632647929,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: It was a scam. She pretended to send me $5000 on PayPal and said I&#39;d have to pay $50 to &quot;her agent&quot; before I could receive it. I knew she was lying since I didn&#39;t receive a notification from PayPal about needing to do anything of the sort, and because her only proof was a fake screenshot with some fabricated message in broken English. Stay woke, my dudes.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/pvogxr/23_m_a_woman_ive_never_met_is_offering_me_5000/",
  "subreddit": "TooAfraidToAsk",
  "id": "pvogxr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EDIT: It was a scam. She pretended to send me $5000 on PayPal and said I'd have\nto pay $50 to \"her agent\" before I could receive it. I knew she was lying since\nI didn't receive a notification from PayPal about needing to do anything of the\nsort, and because her only proof was a fake screenshot with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: 詐欺でした。彼女はPayPalで5000ドルを送るふりをして、受け取る前に「彼女の代理人」に50ドル払わなければならないと言いました。\n受け取る前に「彼女の代理人」に50ドル払わなければならないと言っていました。彼女が嘘をついていることはわかっていました。\nそのようなことをしなければならないという通知をPayPalから受け取っていなかったので、彼女が嘘をついていることはわかりました。\nまた、彼女の唯一の証拠は、偽のスクリーンショットで...。",
      "title": "[一度も会ったことのない女性から、毎週5000ドルの \"シュガーベイビー \"になってほしいと言われています。私はどうしてもお金が必要ですが、彼女を利用したくはありません。どうすればいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：这是个骗局。她假装在贝宝上给我寄了5000美元，并说我必须\n要付50美元给 \"她的代理人\"，我才能收到。我知道她在撒谎，因为\n因为我没有收到PayPal的通知，说需要做任何事情。\n我知道她在撒谎，因为我没有收到PayPal关于需要做任何事情的通知，而且因为她唯一的证据是一张假的屏幕截图，上面有...",
      "title": "[23 M] 一个我从未见过的女人每周向我提供5000美元，让我做她的 \"糖宝宝\"。我非常需要这笔钱，但我不想占她的便宜。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：這是個騙局。她假裝在貝寶上給我寄了5000美元，並說我必須\n要付50美元給 \"她的代理人\"，我才能收到。我知道她在撒謊，因爲\n因爲我沒有收到PayPal的通知，說需要做任何事情。\n我知道她在撒謊，因爲我沒有收到PayPal關於需要做任何事情的通知，而且因爲她唯一的證據是一張假的屏幕截圖，上面有...",
      "title": "[23 M] 一個我從未見過的女人每週向我提供5000美元，讓我做她的 \"糖寶寶\"。我非常需要這筆錢，但我不想佔她的便宜。我應該怎麼做？"
    }
  ]
}