{
  "author": "partymsl",
  "original_created_utc": 1644182534,
  "title": "Seeing so many anti-crypto people not having any idea of what crypto actually is, that's the most bullish thing.",
  "created_utc": 1644208344,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just looking over a few Subreddits here like &lt;a href=\"/r/technology\"&gt;r/technology&lt;/a&gt; or even better twitter, you can very fastly see the mutual hatred for Crypto there. Posts about crypto usually get bombed with the most classic argument after its all a scam: &amp;quot;crypto is killing the environment due to mining&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I mean it&amp;#39;s right to some extent that crypto is using electricity that is unsustainable for mining. With that dancing the environment. But those people are onto some other stuff. Many thinking that all 5k cryptos use mining that is 100% unsustainable.&lt;/p&gt;\n\n&lt;p&gt;So let&amp;#39;s be clear very few cryptos nowadays use pow and even then the energy for mining is getting more and more sustainable. At least already more than their beloved banks.&lt;/p&gt;\n\n&lt;p&gt;Seeing so many people uneducated about crypto but spreading hate shows how much growing room we still have left.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 408,
  "permalink": "/r/CryptoCurrency/comments/sm7ynk/seeing_so_many_anticrypto_people_not_having_any/",
  "subreddit": "CryptoCurrency",
  "id": "sm7ynk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just looking over a few Subreddits here like r/technology [/r/technology] or\neven better twitter, you can very fastly see the mutual hatred for Crypto there.\nPosts about crypto usually get bombed with the most classic argument after its\nall a scam: \"crypto is killing the environment due to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/technology [/r/technology]などのSubredditsをいくつか見てみるか、あるいは\nツイッターを見れば、暗号に対する憎悪が一目瞭然です。\n暗号に関する投稿は、通常、その後に最も古典的な議論と一緒に爆撃されます。\nすべて詐欺です。「暗号は環境を破壊している...",
      "title": "暗号が何であるかを知らない多くのアンチ暗号の人々を見ると、それが最も強気なことだと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只要看一下这里的几个Subreddits，如r/technology [/r/technology]或\n甚至更好的twitter，你就可以很快看到那里对加密货币的相互憎恨。\n关于加密货币的帖子通常会被最经典的论点轰炸，在其\n都是一个骗局。\"加密货币正在扼杀环境，因为......",
      "title": "看到这么多反加密货币的人对加密货币实际上是什么没有任何概念，这是最看好的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只要看一下這裏的幾個Subreddits，如r/technology [/r/technology]或\n甚至更好的twitter，你就可以很快看到那裏對加密貨幣的相互憎恨。\n關於加密貨幣的帖子通常會被最經典的論點轟炸，在其\n都是一個騙局。\"加密貨幣正在扼殺環境，因爲......",
      "title": "看到這麼多反加密貨幣的人對加密貨幣實際上是什麼沒有任何概念，這是最看好的事情。"
    }
  ]
}