{
  "author": "chomskian1",
  "the_new_excerpt": "Hi!\n\nIt's not much what I hold, just a couple dozen XRP, ADA and a couple of dollars\nin ETH. If something happens to me, it may help them in the long term, I hope.\n\nBut I've actually come to this situation where I don't know how to explain to\nthem what to do with it. I plan to create a crypto wallet…",
  "original_created_utc": 1620316840,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Hi!\n\n私が保有しているのは、数十XRP、ADA、数ドルのETHだけで、それほど多くはありません。\nのETHを保有しています。私に何かあっても、それが長期的には彼らの助けになるかもしれない、と思っています。\n\nでも、実際には、どう説明したらいいのかわからないという状況になってしまっています。\nそれをどうすればいいのか、彼らにどう説明すればいいのかわからないという状況になっています。暗号ウォレットを作ろうと思っているのですが...。",
      "title": "私が殺されたときのために、暗号化されたパスワードを両親に残しておきたい（コロンビアでは警官が私たちデモ参加者を殺している）。どうやって両親にわかりやすく説明すればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好!\n\n我持有的东西不多，只有几十个XRP、ADA和几美元的\nETH。如果我出了事，可能对他们有长期的帮助，我希望。\n\n但我实际上已经到了这种情况，我不知道如何向他们解释\n他们该怎么做。我打算创建一个加密货币钱包...",
      "title": "把加密密码留给我的父母，以防我被杀（哥伦比亚的警察正在杀害我们这些抗议者）。我如何用一种简单的方式向他们解释他们应该如何处理？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好!\n\n我持有的東西不多，只有幾十個XRP、ADA和幾美元的\nETH。如果我出了事，可能對他們有長期的幫助，我希望。\n\n但我實際上已經到了這種情況，我不知道如何向他們解釋\n他們該怎麼做。我打算創建一個加密貨幣錢包...",
      "title": "把加密密碼留給我的父母，以防我被殺（哥倫比亞的警察正在殺害我們這些抗議者）。我如何用一種簡單的方式向他們解釋他們應該如何處理？"
    }
  ],
  "title": "Leaving crypto passwords to my parents in case I get killed (cops in Colombia are killing us protesters). How do I explain to them in a simple way what they should do with it?",
  "created_utc": 1620337043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi!</p>\n\n<p>It&#39;s not much what I hold, just a couple dozen XRP, ADA and a couple of dollars in ETH. If something happens to me, it may help them in the long term, I hope.</p>\n\n<p>But I&#39;ve actually come to this situation where I don&#39;t know how to explain to them what to do with it. I plan to create a crypto wallet in Metamask and leaving them the pass phrase in a letter. Sadly I can&#39;t talk to them about this because they  usually think I&#39;m going to my GFs and not the streets to protest (it&#39;s my duty) I don&#39;t want to leave them worried so I never tell them...</p>\n\n<p>Is there any resource that can explain older people the\nbasics of crypto, its potencial value and the basics for handling a wallet?</p>\n\n<p>Thanks a lot.</p>\n\n<p>Edit: to those saying people here shouldn&#39;t go out and &quot;commit crimes&quot; to not get killed, police is literally shooting students in the street for simply lighting candles in honor of those that have been killed by them. Get your facts straight please, and I really hope you never get to see this kind of human suffering In your country.</p>\n</div><!-- SC_ON -->",
  "score": 1744,
  "permalink": "/r/CryptoCurrency/comments/n6amsg/leaving_crypto_passwords_to_my_parents_in_case_i/",
  "subreddit": "CryptoCurrency",
  "id": "n6amsg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988838
}