{
  "author": "JCrago",
  "the_new_excerpt": "I hate work. Always have. I find it, frankly, tyrannical. Forced to wake before\nI'm ready; forced to rush when I just want to sit and enjoy a coffee; forced to\nsit when all I want is to walk; forced to be inside when I want to be in the\nsunshine; forced to spend time and energy on activities I do…",
  "original_created_utc": 1619170386,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仕事は嫌いです。いつもそうだ。率直に言って、横暴だと思います。準備ができる前に起きることを強いられたり\n座ってコーヒーを楽しみたいときに急ぐことを強いられたり、歩きたいときに座ることを強いられたり\n歩きたいときに座らされたり、太陽の下で過ごしたいときに室内にいることを強いられたり。\n日光を浴びたいときに室内にいることを強いられたり、自分がしたい活動に時間とエネルギーを費やすことを強いられたり...。",
      "title": "仕事に否定的な哲学者は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我讨厌工作。一直如此。坦率地说，我发现它是一种暴政。被迫在我准备好之前醒来\n被迫在我准备好之前醒来；在我只想坐下来享受咖啡的时候被迫匆匆忙忙；在我只想走路的时候被迫坐下；在我想在屋里的时候被迫进去。\n坐着，而我只想走走；当我想在阳光下的时候，却被迫呆在屋里；当我想花时间和精力去做一件事的时候，却被迫去做一件事。\n阳光；被迫把时间和精力花在我所做的活动上......",
      "title": "有没有对工作持否定态度的哲学家？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我討厭工作。一直如此。坦率地說，我發現它是一種暴政。被迫在我準備好之前醒來\n被迫在我準備好之前醒來；在我只想坐下來享受咖啡的時候被迫匆匆忙忙；在我只想走路的時候被迫坐下；在我想在屋裏的時候被迫進去。\n坐着，而我只想走走；當我想在陽光下的時候，卻被迫呆在屋裏；當我想花時間和精力去做一件事的時候，卻被迫去做一件事。\n陽光；被迫把時間和精力花在我所做的活動上......",
      "title": "有沒有對工作持否定態度的哲學家？"
    }
  ],
  "title": "Any philosophers who are negative about work?",
  "created_utc": 1619192007,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hate work. Always have. I find it, frankly, tyrannical. Forced to wake before I&#39;m ready; forced to rush when I just want to sit and enjoy a coffee; forced to sit when all I want is to walk; forced to be inside when I want to be in the sunshine; forced to spend time and energy on activities I do not care about at the expense of activities I do care about -- playing music, reading, hiking, visiting loved ones, etc. And this lasts for ten hours each workday if you include the commute (for which I don&#39;t get paid). But that doesn&#39;t seem accurate, because often the tiredness I acquire throughout the workday spills over into my leisure time, so that -- because of work -- I don&#39;t have the energy to play music, read, etc. Not to mention the time I have to spend on job applications, career consultations, etc. so I can get paid better for this crap. And this happens nearly every day, nearly every week, every month, every year. It feels like a form of servitude, and yet everyone around me thinks it&#39;s great and in fact boast about doing overtime or devoting their leisure time to work-related stuff. I have the very powerful sense that all this is deeply, deeply wrong. I would love to get recommendations for philosophers who have criticised work so I can understand better why I have this powerful feeling against work.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/askphilosophy/comments/mwri70/any_philosophers_who_are_negative_about_work/",
  "subreddit": "askphilosophy",
  "id": "mwri70",
  "is_self": true,
  "media": null,
  "is_video": false
}