{
  "author": "Socialinfluencing",
  "original_created_utc": 1636705486,
  "title": "What's the REAL reason you got into crypto for?",
  "created_utc": 1636735082,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all joke about lambos and theme parks in the backyard of our newly built crypto sponsored mansion, but why are you really here? </p>\n\n<p>The reason I ask is because the reason people seek wealth is often a great predictor of how likely they are to attain it. Consider this, people more likely to play the lottery are mainly from lower income backgrounds, this is not a dig at anyone, just an observable phenomenon. </p>\n\n<p>Do you have debt or a family crises of some kind and are already making rational calculations? Or are you the gambling kind that just wants to see where this thing goes if you toss in some money.</p>\n\n<p>You don&#39;t need to explain in great detail, but what is the biggest need beyond &#39; I need more money &#39; for you? For me it is student debt and family welfare, as well the freedom to be able to live life for once instead of surviving it.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qs6sp4/whats_the_real_reason_you_got_into_crypto_for/",
  "subreddit": "CryptoCurrency",
  "id": "qs6sp4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all joke about lambos and theme parks in the backyard of our newly built\ncrypto sponsored mansion, but why are you really here?\n\nThe reason I ask is because the reason people seek wealth is often a great\npredictor of how likely they are to attain it. Consider this, people more likely\nto play the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、ランボーやテーマパークについて冗談を言いながら、新しく建てた\nしかし、なぜあなたはここにいるのでしょうか？\n\nなぜこのような質問をしたかというと、人が富を求める理由は、富を手に入れる可能性を大きく左右することが多いからです。\n人が富を求める理由は、富を手に入れる可能性を大きく左右するからです。考えてみてください、より多くの人が\nしている人は",
      "title": "あなたが暗号化を始めた本当の理由は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都在开玩笑，说在我们新建的后院里有兰博基尼和主题公园。\n我们都开玩笑说，在我们新建的加密货币赞助的豪宅的后院里，有小羊羔和主题公园，但你为什么真的在这里？\n\n我问的原因是，人们寻求财富的原因往往是一个很好的\n预示着他们有多大可能获得财富。考虑到这一点，人们更有可能\n扮演的角色......",
      "title": "你进入加密货币的真正原因是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都在開玩笑，說在我們新建的後院裏有蘭博基尼和主題公園。\n我們都開玩笑說，在我們新建的加密貨幣贊助的豪宅的後院裏，有小羊羔和主題公園，但你爲什麼真的在這裏？\n\n我問的原因是，人們尋求財富的原因往往是一個很好的\n預示着他們有多大可能獲得財富。考慮到這一點，人們更有可能\n扮演的角色......",
      "title": "你進入加密貨幣的真正原因是什麼？"
    }
  ]
}