{
  "author": "dailyidea",
  "original_created_utc": 1649852588,
  "title": "You Should Make Github for Recipes",
  "created_utc": 1649857031,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recipes evolve and change over time. People add their own twists and find small improvements. So where is version control for recipes?&lt;/p&gt;\n\n&lt;h1&gt;Today&amp;#39;s Idea: The Spark Notes Version&lt;/h1&gt;\n\n&lt;p&gt;Everyone loves recipes. But there are 10s of millions on the internet. No one is able to verify which are best and you can&amp;#39;t save your own changes.&lt;/p&gt;\n\n&lt;p&gt;This is Github for recipes. Search for the right recipes, and find the most referenced / contributed to. If you find a way to improve it, you can fork your own branch, or request to change the original. You can see all the past variations.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re a company working on a food product, you can keep all of your recipes in one repository. You can see all the past versions, and keep track of changes.&lt;/p&gt;\n\n&lt;h2&gt;The Long Version&lt;/h2&gt;\n\n&lt;p&gt;Recipes are some of the most shared things on the internet. Whenever any of us want to cook something new, we Google for the best recipes. Some of us have favorite chefs or influencers who we go to for their concoctions.&lt;/p&gt;\n\n&lt;p&gt;But the thing is, recipes really don&amp;#39;t have a great internet infrastructure. They&amp;#39;re all overly optimized for SEO. It&amp;#39;s a cliché at this point to mention it, but no one wants to read your life story to finally get to your recipe for banana bread. &lt;/p&gt;\n\n&lt;p&gt;There also isn&amp;#39;t a great way to find recipes, evaluate their quality, or get a sense of the community reaction to the recipe. Of course you can try to parse blog comments, but good luck with that.&lt;/p&gt;\n\n&lt;p&gt;This idea fundamentally changes the way that recipes work on the internet, for the better. Let&amp;#39;s first go over what it is.&lt;/p&gt;\n\n&lt;p&gt;The idea is Github for recipes. If you don&amp;#39;t know what Github is, it&amp;#39;s a website where programmers can upload their code. Any time they make any changes, it is saved as a version. Anyone can go back and see every previous version. This means you don&amp;#39;t lose your work, and if you make a mistake you can always revert to a previous version.&lt;/p&gt;\n\n&lt;p&gt;Github also provides what are called repositories. These are folders where a programmer can upload a whole bunch of different pieces of code, to organize them.&lt;/p&gt;\n\n&lt;p&gt;Finally, Github is built for community collaboration. Anyone can take a piece of code in a Github library, and either fork it (where they create their own copy and can make changes), or create a pull request (where their changes are adopted into the main code).&lt;/p&gt;\n\n&lt;p&gt;We would implement each of these features into recipes. Companies who make food products would be able to keep their recipes in one central repository. Their chefs would be able to update them and see all previous versions. &lt;/p&gt;\n\n&lt;p&gt;Communities could collaborate on the best chocolate chip cookie recipe. Anyone can then fork the recipe and make their own changes. &lt;/p&gt;\n\n&lt;p&gt;There would be a robust search where people could find the best recipe for a given food product, based on number of contributors, age, upvotes, etc. &lt;/p&gt;\n\n&lt;p&gt;This product would fundamentally change the way we cook. I hope you make it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/u2p3p6/you_should_make_github_for_recipes/",
  "subreddit": "SideProject",
  "id": "u2p3p6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Recipes evolve and change over time. People add their own twists and find small\nimprovements. So where is version control for recipes?\n\n\nTODAY'S IDEA: THE SPARK NOTES VERSION\n\nEveryone loves recipes. But there are 10s of millions on the internet. No one is\nable to verify which are best and you…"
}