{
  "author": "RIOT_DO_SOMETHING",
  "original_created_utc": 1625322190,
  "title": "The Moneyfest Hypothesis on I O T A",
  "created_utc": 1625361156,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><sup>Beforehand, I apologize for this long analysis. I cannot provide a tl;dr because I wouldn&#39;t know how. Too much information.</sup> </p>\n\n<p>Hi friends, it looks like the storm is slowing down. Crypto is not dead yet. Who would have thought /s.</p>\n\n<p>I have written three posts so far.</p>\n\n<p>First, my &quot;prediction&quot; on SBS about the incentivized test network that is coming in I O T A . Unfortunately, my estimate of 3 weeks was way off. I think it&#39;s due to technical difficulties and the big total cap crash. My mistake. Should have listened to Hofstadter&#39;s law.<br/>\n<em>It always takes longer than you expect, even when you take into account Hofstadter&#39;s Law.</em></p>\n\n<p>But from my POV the plan remains a reality.</p>\n\n<p>I expect an announcement from the I O T A Foundation on this subject in the short or medium term.</p>\n\n<p>Anyone who then owns I O T A will get test-network tokens, so effectively an <em>airdrop</em>. The suspense continues.</p>\n\n<p>My other post was here in this sub, describing I O T A from my perspective as a data analyst. (If you have no idea about I O T A, you should probably read this first, just click on my name and see my posts. I don&#39;t link directly due to the automoderator that is a bit harsh today)</p>\n\n<p>My last contribution has been a comparison between ADA and I O T A. Great projects, both of them.</p>\n\n<p>I am very pleased that my views have been so well received and I thank everyone for the mostly positive reactions and great discussions that we have seen.</p>\n\n<p>That&#39;s crypto for me: progress, cooperation, friendly competition, and huge returns for the patient people.</p>\n\n<p>As the title suggests, I will describe here today why I O T A will increase in value in the long term, away from the market, away from whims and emotions, market cycles, or Musk&#39;ian tweetstorms.</p>\n\n<p><strong>The Moneyfesto Hypothesis.</strong> <strong><sup>(Just a play on words</sup>)</strong></p>\n\n<p>I&#39;ll start by explaining why I O T A is not being hyped at the moment, i.e. why it is not subject to twitter-supported hype phases or the focus of YouTubers and TikTok-influencers.</p>\n\n<p>And why that will change.</p>\n\n<p><strong>Reason 1)</strong></p>\n\n<p>I O T A is a charitable non-profit in Germany.</p>\n\n<p>Apart from the fact that Germans have no sense of humor, so they say, they are also very precise with their statutes and laws.</p>\n\n<p>The I O T A Foundation is not allowed to do speculation-based advertising, to spend money on it, or to hire companies with the sole aim of raising the token price. They are solely here to work in favor of the people. Legally bound to do good.</p>\n\n<p>This comment is without judgment:</p>\n\n<p><em>Other projects hire large advertising companies and are very active in terms of hype and monetary incentives.</em></p>\n\n<p><em>I think there is hardly a founder who does not leave weekly speculation-focused comments, of course as a self-purpose. That&#39;s how the world works, that&#39;s how crypto works. I O T A, however, cannot use this strategy for itself.</em></p>\n\n<p>It is what it is. Capitalism works.</p>\n\n<p><strong>Reason 2)</strong></p>\n\n<p>The past is still shaping public opinions, even though the technology has changed, the people responsible have left the stage, and I O T A has taken the criticism as an opportunity to implement the recommendations in such a way that it now works and that it can be integrated into a meaningful way.</p>\n\n<p>I O T A has learned from this, but it takes a while to get the smell off the coat.</p>\n\n<p><strong>Reason 3)</strong></p>\n\n<p>The previous point may have put I O T A in a position where it has to deliver before the crypto establishment around Kraken, Coinbase, Bitstamp, et al, will consider I O T A sustainably trustworthy and let the past be the past.</p>\n\n<p>This barrier means that the majority of US investors have only a few or poor gateways into I O T A.</p>\n\n<p><strong>Reason 4)</strong></p>\n\n<p>I O T A has a single point of failure: the coordinator.</p>\n\n<p>The crypto mainstream establishment is ideological. It will not negotiate on some issues.</p>\n\n<p>Without I O T A 2.0, this is unlikely to change much. Time and effort have shown that.</p>\n\n<p><strong>Reason 5)</strong></p>\n\n<p>I O T A is more or less European centristic and has most of its supporters based in German-speaking countries. Influencers and spokespersons for I O T A are largely based in these countries. <em>Google Trends</em> is pretty clear on that.</p>\n\n<p><strong>Reason 6)</strong></p>\n\n<p>As a non-profit, no influencers can be paid.</p>\n\n<p>As we all know, advertising in Cryptoland mostly works by giving large amounts of money to Youtubers, Twitter personalities, or TikTok influencers, who then write reviews, record videos, and direct their audience towards their clients.</p>\n\n<p>Since I O T A does not have legal access here either, the entire influencer market remains closed.</p>\n\n<p><strong>Reason 7)</strong></p>\n\n<p>The hype advantage of other projects may mean that investor capacities are exhausted in a way that there is nothing left for I O T A under these conditions, for now.</p>\n\n<p>----------------------------------------------------------------</p>\n\n<p>Those who have read this far know that these are all good reasons to give I O T A little chance on the market, but there are decisive reasons and mechanisms that will nevertheless put I O T A in an excellent position.</p>\n\n<p>Reasons that lie outside of crypto, but will also play a role in crypto through a positive feedback- loop and make I O T A one of the great projects.</p>\n\n<p>-----------------------------------------------------------------</p>\n\n<p><strong>The Moneyfesto Hypothesis:</strong></p>\n\n<p>In order to form this idea into a hypothesis, I would first like to explain the working principle of a feedback loop.</p>\n\n<p>It is a self-reinforcing effect that increases in strength to, again, reinforce itself.</p>\n\n<p>The classic example is a startled herd of cattle that is further startled by the panic of the individual cows and thus develops even more panic.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cox4c6nrb0971.png?width=360&amp;format=png&amp;auto=webp&amp;s=60e0d555fdfdb1774e088e1588d4b2b3456d8f71\">positive feedback loop</a></p>\n\n<p>Feedback loops can also be negative, such as the effects of bad press on the price of an asset, which in turn gets even more bad press and ultimately ruins the asset altogether.</p>\n\n<p>Feedback loops are natural processes that have more or less predictable end results due to causal reactions.</p>\n\n<p>Nevertheless, we must treat the following example as a hypothesis rather than a thesis, because no one has a crystal ball and causal chains can never be predicted in a complex reality, especially not in an endlessly interconnected and inherently chaotic landscape like Cryptoland.</p>\n\n<p>------------------------------------------------------------------</p>\n\n<p><strong>I O T A has a unique way of working and, with I O T A 2.0, a new way of generating monetary incentives.</strong></p>\n\n<p><em>Bitcoin incentives, as a reference, work like this:</em></p>\n\n<p><em>Bitcoin miners provide computing power that secures the network.</em></p>\n\n<p><em>In return for this service, the fastest miners find blocks filled with Bitcoins in a race against other Bitcoin miners.</em></p>\n\n<p><em>These bitcoins can be sold at a high price and complete the security circle through incentives.</em></p>\n\n<p><em>Of course, this explanation is incorrect in the sense that essential peculiarities are not explained by me, but it is valid as a basic rule:</em></p>\n\n<p><em>Those who help the network are compensated.</em></p>\n\n<p><em>Since this technology is decentralized, and there is little that can be done against participation in the mining process other than regulation and laws, these incentives are extremely strong, and inevitably lead to the Bitcoin network being extremely secure.</em></p>\n\n<p>I O T A incentives work differently because there is no mining, none or negligible proof of work, and no network fees that can be paid to miners. It&#39;s free to use and full nodes ( as a replacement for miners) don&#39;t earn money directly.</p>\n\n<p><strong>I O T A&#39;s incentives are completely novel and, at first glance, incomplete:</strong></p>\n\n<p>It&#39;s really just about:</p>\n\n<p>-trust</p>\n\n<p>and</p>\n\n<p>-industrial competition</p>\n\n<p>As I explained in the second of my Reddit posts, I O T A is trying to offer a so-called <em>global web of trust</em> that offers data transactions in addition to monetary transactions, at zero cost.</p>\n\n<p>This means that digital identities can be created within the machine economy -free of charge- via the T a n g l e, giving the issuer, i.e. the company with a specific use case, a cost-efficient competitive advantage, because proprietary solutions, centralized solutions, stand in the way of a global, open and trustworthy machine-to-machine economy to such an extent that <em>they don&#39;t even make it past the planning stage in today&#39;s world.</em></p>\n\n<p>Large companies have realized that the competitive advantage can only be fully realized if they are allowed to be part of an open, decentralized network that provides their machines and sensors with trust that they cannot provide as a central entity.</p>\n\n<p><em>The power of trust lies in the common interest to offer and to leverage on data that is verified by the many, and the I O T A protocol allows the efficiency of entire systems to be maxed out within a zero-margin economy without relying on third-party vendors who charge horrendous costs and lack trust in return.</em></p>\n\n<p><strong>What exactly does that mean?</strong></p>\n\n<p>It means that millions of companies want to and will use I O T A as a web of trust, and as proof, industry leaders like Dell, Intel, Zebra, and the Linux foundation are already building I O T A-based solutions, categorically ruling out proprietary solutions. (I believe google provides sources if needed)</p>\n\n<p>The result is that in the game-theoretic milieu of the industry, the big players are providing solutions that can offer, from the very beginning, an unattainable cost-efficiency that can never be achieved by proprietary solutions.</p>\n\n<p>Why does this matter when we look at positive feedback loops and incentives?</p>\n\n<p>This is good and easy to explain and the absolute main point of hypothesizing.</p>\n\n<p>Because I O T A works differently.</p>\n\n<p>I O T A 2.0 will offer a higher bandwidth of message-based transactions when tokens are parked on an address of an associated node, giving it a computational counterpart: Mana for behaving well.</p>\n\n<p>Mana is a value that generally cannot be sent individually and is tied to the tokens, allowing for more transactions.</p>\n\n<p>Mana is divided into two values, access Mana and consensus Mana, which make it practically impossible for attackers to collect Mana and perform 31% or even 51% attacks, but I&#39;ll leave the technical nuances aside.</p>\n\n<p>If you are interested, you are welcome to read and evaluate the updated information directly from the source. Just google &quot;I O T A 2.0 specifications 5.3 Mana&quot;</p>\n\n<p>Though, it seems like there will be a way to pledge earned Mana to nodes people do trust, effectively give some players the option to not own tokens, which comes in handy if a company is not in a position to buy tokens by law.</p>\n\n<p>But regarding Mana, the only point to remember in this discussion is the following:</p>\n\n<p>Most use-cases work without tokens, so companies don&#39;t buy them to send messages. Token-based services will be used in other parts of the industry, especially in e-commerce where minimal transactions, even sub-cent amounts, enable new applications (token streaming, fair subscription models, etc). Another huge field that will eventually raise the price, but it&#39;s not a unique characteristic because some other projects offer zero fees as well.</p>\n\n<p>Most use-cases are based on the message function, which is directly dependent on the number of tokens parked at an address in terms of bandwidth and the number of transactions they can conduct. Considering how most of these applications are planned, we have to assume that even a handful of companies will have to conduct thousands of transactions a second, in order to provide a reliable backbone for eg. self-sovereign identities in the realm of automation and digital identities.</p>\n\n<p>This means that companies will still need tokens unless they just need a few transactions per hour.</p>\n\n<p>So the positive feedback loop within an unrivaled industrial landscape looks like this:</p>\n\n<p><strong>Companies want the best positioning to grow their service and beat competitors.</strong></p>\n\n<p><strong>For this position, they need to take the most cost-efficient solution. In the field of M2M, this is without a doubt I O T A. No ledger can offer these services cheaper unless it is centralized or permissioned.</strong></p>\n\n<p><strong>This results in a paradoxical situation: a race for tokens that are not actually used directly, but which have to be owned for &quot;message transactions&quot;.</strong></p>\n\n<p><strong>In other words, the feedback loop and the hypothesis look like this:</strong></p>\n\n<p><strong>I O T A offers the best platform for messages and companies buy tokens.</strong></p>\n\n<p><strong>Companies see the competitive advantage of competitors and in turn buy tokens as well.</strong></p>\n\n<p><strong>The I O T A Foundation built I O T A to be non-inflationary, so there is a finite number (only 2 of the top 100 projects on Coingecko did it like this).</strong></p>\n\n<p><strong>If I O T A works and the test projects (there are hundreds) grow to production maturity, there will be a tech bubble just around I O T A.</strong></p>\n\n<p><strong>This tech bubble will behave like any other bubble, except that token holders will not have bought a worthless asset with questionable intrinsic value, but the permission to participate in the market.</strong></p>\n\n<p><strong>The latter describes the real incentive of I O T A.</strong></p>\n\n<p><strong>A company wants to participate in the global web of trust, so it needs to own tokens in order to offer large and expanding applications where millions of transactions are needed on a daily basis.</strong></p>\n\n<p><em>Unique platform -&gt; companies want to use it -&gt; token purchases -&gt; competing companies cannot keep up -&gt; more token purchases-&gt; global web of trust established -&gt; rinse and repeat.</em></p>\n\n<p>This circumstance negates reasons 1-7 and offers an investment reason apart from Crypto, which is supported by the standardization efforts of the Object Management Group and Ecl@ss.</p>\n\n<p>Both standardization institutions are in the advanced stages of defining I O T A as an official standard and providing a regulated, global, secure alternative to the world&#39;s centralized and non-scaling information networks.</p>\n\n<p>With this in mind, it&#39;s my personal opinion that the positive feedback loop will only be strengthened by Crypto because, at some point, Crypto influencers realize what I realized:</p>\n\n<p>I O T A adoption means increasing token purchases with no end unless there is an unexpected change of events like an alternating version of I O T A&#39;s and Manas functionality.</p>\n\n<p>I would sell snake oil if I claimed to know when a critical mass of adoption is reached, but strategic companies and global players tend to act quickly when the facts are clear, and the confirmation of the Moneyfesto hypothesis seems to be linked to defining a global standard for I O T A 2.0 that will allow the industry to get in in clear regulatory and practical terms.</p>\n\n<p>I expect the first reaction within months and a confirmation of the hypothesis within 2 years when I O T A 2.0 is integrated into the mainnet without major detours.</p>\n\n<p>There is no ETA on I O T A 2.0, but there is a rough timeframe of Q4 21&#39; or Q1 22&#39;.</p>\n\n<p>As a next step, I will try to work with a statistician to develop a model that will attempt to calculate a possible critical mass moment in time, based on metrics such as maximum token count, current test projects, outlined developments in the I o T, and facts such as standardization dates.</p>\n\n<p>This model will be just another piece of the hypothesis-puzzle, and will not be binding or causal, but it will provide another clue to the future of I O T A&#39;s adoption curve.</p>\n\n<p>The main take-away information is that the entire feedback loop can only work with I O T A because it&#39;s the one and only project that offers this tokenization at zero fees, with a (&quot;zero token / zero value&quot;) message function that doesn&#39;t rely on mining or fees.</p>\n\n<p>This is my personal analysis and no advice on anything. I look forward to fruitful discussions. This is what it&#39;s all about.</p>\n\n<p>Thank you for your attention and have a great weekend.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/ocz07h/the_moneyfest_hypothesis_on_i_o_t_a/",
  "subreddit": "CryptoCurrency",
  "id": "ocz07h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Beforehand, I apologize for this long analysis. I cannot provide a tl;dr because\nI wouldn't know how. Too much information.\n\nHi friends, it looks like the storm is slowing down. Crypto is not dead yet. Who\nwould have thought /s.\n\nI have written three posts so far.\n\nFirst, my \"prediction\" on SBS…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、このような長い分析をしたことをお詫びします。私はTl;drを提供することができません。\n方法がわからないからです。情報が多すぎます。\n\nこんにちは、友人たち、嵐は減速しているように見えます。Cryptoはまだ死んでいません。誰が\nwould have thought /s.\n\n私はこれまでに3つの記事を書きました。\n\nまず、SBSに関する私の「予測」...",
      "title": "I O T A に お け る「 マ ネ ー フ ェ ス ト 仮 説 」に つ い て"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这之前，我为这漫长的分析表示歉意。我不能提供一个简要的说明，因为\n我不知道怎么做。太多信息了。\n\n朋友们好，看起来风暴正在放缓。Crypto还没有死。谁\n会想到/s。\n\n到目前为止，我已经写了三个帖子。\n\n首先，我对SBS的 \"预测\"...",
      "title": "关于I O T A的 \"金钱风暴 \"假说"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這之前，我爲這漫長的分析表示歉意。我不能提供一個簡要的說明，因爲\n我不知道怎麼做。太多信息了。\n\n朋友們好，看起來風暴正在放緩。Crypto還沒有死。誰\n會想到/s。\n\n到目前爲止，我已經寫了三個帖子。\n\n首先，我對SBS的 \"預測\"...",
      "title": "關於I O T A的 \"金錢風暴 \"假說"
    }
  ]
}