{
  "author": "kaicuul",
  "original_created_utc": 1630750569,
  "title": "Why is masturbation so heavily frowned upon in religion?",
  "created_utc": 1630756588,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While I am a Christian (female), I never fully understood what was wrong with masturbation if i wasn’t actively engaging in sexual intercourse with someone else before marriage. I remember asking my mom when I was 12 when I could masturbate (not fully knowing what it was at the time) and she said NEVER. She’s not even a strict Christian. </p>\n\n<p>So female sexuality is already looked down on when it comes to masturbation (which is still a mystery to me as to why,) but what is wrong with masturbation if it works as an effective form of birth control, you’re not creating any soul ties with anyone(spiritual bonds/ties formed through sexual intercourse) and you’re not getting into trouble assuming that it’s not an addiction?</p>\n\n<p>I thoroughly enjoy masturbating and I feel no guilt afterwards like I used to when I was younger and new to it.</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/NoStupidQuestions/comments/phoy3t/why_is_masturbation_so_heavily_frowned_upon_in/",
  "subreddit": "NoStupidQuestions",
  "id": "phoy3t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "While I am a Christian (female), I never fully understood what was wrong with\nmasturbation if i wasn’t actively engaging in sexual intercourse with someone\nelse before marriage. I remember asking my mom when I was 12 when I could\nmasturbate (not fully knowing what it was at the time) and she said…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はクリスチャン（女性）ですが、誰かと積極的に性交渉をしていないのに、自慰行為をして何が悪いのか完全には理解できませんでした。\n結婚前に誰かと積極的に性交渉をしていないのに、自慰行為をして何が悪いのかよくわかりませんでした。\n私は、結婚前に誰かと積極的に性交渉をしていないのに、自慰をして何が悪いのかよくわかりませんでした。12歳の時、母にいつオナニーしていいか聞いたのを覚えています。\n12歳の時、母にいつ自慰行為をしていいか聞いたことがあります。",
      "title": "なぜ宗教では自慰行為がこれほどまでに嫌われているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然我是一个基督徒（女性），但我从来没有完全理解，如果我不主动与人性交，手淫有什么错？\n如果我没有积极地与别人发生性关系，手淫有什么错？\n么有问题。我记得我12岁的时候问过我妈妈，我什么时候可以\n手淫（当时并不完全了解它是什么），她说......",
      "title": "为什么手淫在宗教中受到如此严重的反对？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然我是一個基督徒（女性），但我從來沒有完全理解，如果我不主動與人性交，手淫有什麼錯？\n如果我沒有積極地與別人發生性關係，手淫有什麼錯？\n麼有問題。我記得我12歲的時候問過我媽媽，我什麼時候可以\n手淫（當時並不完全瞭解它是什麼），她說......",
      "title": "爲什麼手淫在宗教中受到如此嚴重的反對？"
    }
  ]
}