{
  "author": "jankis2020",
  "the_new_excerpt": "It may have seemed like a crazy bet then, but it would have paid off for your\ngrandkids.\n\nAnd while it would have cost more and wouldn’t have nearly as much upside,\nbuying the same land in 1890 or 1990 was still a really smart investment.\n\nIf you disagree with the “digital land grab” thesis, you’re…",
  "original_created_utc": 1624121526,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "当時は無謀な賭けに思えたかもしれませんが、お孫さんのためには十分な利益になります。\nお孫さんのためにもなります。\n\nそして、コストは高くなり、アップサイドもほとんどありませんでしたが\n1890年や1990年に同じ土地を購入することは、非常に賢い投資だったと言えるでしょう。\n\nもしあなたが「デジタルランドグラブ」というテーゼに同意しないのであれば、あなたは...。",
      "title": "今、ビットコインを買うことは、1790年にニューヨークで土地を買うようなものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这在当时看来可能是一个疯狂的赌注，但它会为你的\n孙子们。\n\n虽然它的成本会更高，而且没有那么多的上升空间。\n在1890年或1990年购买同样的土地仍然是一项非常明智的投资。\n\n如果你不同意 \"数字抢地 \"的理论，你就...",
      "title": "今天购买比特币就像在1790年的纽约市购买土地。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這在當時看來可能是一個瘋狂的賭注，但它會爲你的\n孫子們。\n\n雖然它的成本會更高，而且沒有那麼多的上升空間。\n在1890年或1990年購買同樣的土地仍然是一項非常明智的投資。\n\n如果你不同意 \"數字搶地 \"的理論，你就...",
      "title": "今天購買比特幣就像在1790年的紐約市購買土地。"
    }
  ],
  "title": "Buying Bitcoin today is like buying land in the New York City in 1790.",
  "created_utc": 1624134743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It may have seemed like a crazy bet then, but it would have paid off for your grandkids. </p>\n\n<p>And while it would have cost more and wouldn’t have nearly as much upside, buying the same land in 1890 or 1990 was still a really smart investment. </p>\n\n<p>If you disagree with the “digital land grab” thesis, you’re basically shorting the success of the internet. Who would seriously bet against the future of the internet?</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/Bitcoin/comments/o3kd8c/buying_bitcoin_today_is_like_buying_land_in_the/",
  "subreddit": "Bitcoin",
  "id": "o3kd8c",
  "is_self": true,
  "media": null,
  "is_video": false
}