{
  "author": "Sinzari",
  "original_created_utc": 1656039371,
  "title": "How does lemon juice turn your urine alkaline?",
  "created_utc": 1656054292,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had heard that lemon juice makes your body alkaline, which made no sense to me, so I did some googling. I found that it was not true, as I anticipated (since your body regulates your blood&amp;#39;s pH level), but what I couldn&amp;#39;t find a solid conclusion for in either direction was whether or not lemon juice creates alkaline byproducts in digestion. &lt;/p&gt;\n\n&lt;p&gt;I found many semi-reputable sources (&lt;a href=\"https://www.healthline.com/nutrition/lemon-juice-acidic-or-alkaline\"&gt;https://www.healthline.com/nutrition/lemon-juice-acidic-or-alkaline&lt;/a&gt; for example) that seemed to agree with that, and say that while it doesn&amp;#39;t affect your body or blood&amp;#39;s pH level, it can make your urine more alkaline. Most of the people I&amp;#39;d seen refuting it where simply saying that lemon juice can&amp;#39;t turn your body alkaline and that it&amp;#39;s pseudoscience hogwash, rather than specifically talking to the point that it does or doesn&amp;#39;t make alkaline byproducts during digestion.&lt;/p&gt;\n\n&lt;p&gt;So my question is: Does lemon juice produce alkaline byproducts during digestion and make your urine more alkaline, and if it does, what&amp;#39;s the process that occurs to make this happen and what is happening to all the acid? Where are the extra Hydrogen ions going?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/askscience/comments/vje6n1/how_does_lemon_juice_turn_your_urine_alkaline/",
  "subreddit": "askscience",
  "id": "vje6n1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I had heard that lemon juice makes your body alkaline, which made no sense to\nme, so I did some googling. I found that it was not true, as I anticipated\n(since your body regulates your blood's pH level), but what I couldn't find a\nsolid conclusion for in either direction was whether or not lemon…"
}