{
  "author": "forthemotherrussia",
  "original_created_utc": 1626695116,
  "title": "Why the fuck r/CryptoMoonShots hasn't been banned yet? Isn't it too obvious it's a sub with full of scammers?",
  "created_utc": 1626705074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It has 660K members! WHAT THE FUCK?</p>\n\n<p>They launch a shit token and then post it on that sub. The posts get tons of awards and thousands of upvotes. It&#39;s too obvious that those upvotes and awards are spam because the fucking token just launched and nobody knows about it yet. It is too obvious 99% of those cryptos/token are scam. Why does Reddit allow such a subreddit that clearly scam people?</p>\n</div><!-- SC_ON -->",
  "score": 359,
  "permalink": "/r/CryptoCurrency/comments/oncex7/why_the_fuck_rcryptomoonshots_hasnt_been_banned/",
  "subreddit": "CryptoCurrency",
  "id": "oncex7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It has 660K members! WHAT THE FUCK?\n\nThey launch a shit token and then post it on that sub. The posts get tons of\nawards and thousands of upvotes. It's too obvious that those upvotes and awards\nare spam because the fucking token just launched and nobody knows about it yet.\nIt is too obvious 99% of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "会員数は660K! 何が起こっているんだ？\n\n彼らはくだらないトークンを発表して、そのサブに投稿します。その投稿は大量の賞を獲得し\nたくさんの賞と何千ものアップヴォートを獲得します。そのアップヴォートや賞が、あまりにも明らかに\nクソトークンが発売されたばかりでまだ誰も知らないので、それらのupvoteや賞がスパムであることはあまりにも明白です。\nあまりにも明らかなのは、99％の...",
      "title": "なぜr/CryptoMoonShotsはまだ禁止されていないんだ？詐欺師だらけのサブ垢であることは明白すぎるのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它有66万名成员! 这他妈是什么？\n\n他们推出了一个狗屎令牌，然后把它发布在那个子上。这些帖子得到了大量的\n奖项和数以千计的支持率。太明显了，这些支持和奖项\n都是垃圾信息，因为这个该死的代币刚刚推出，还没有人知道它。\n太明显了，99%的...",
      "title": "为什么他妈的r/CryptoMoonShots还没有被禁止？这不是很明显的，它是一个充满骗子的子网站吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它有66萬名成員! 這他媽是什麼？\n\n他們推出了一個狗屎令牌，然後把它發佈在那個子上。這些帖子得到了大量的\n獎項和數以千計的支持率。太明顯了，這些支持和獎項\n都是垃圾信息，因爲這個該死的代幣剛剛推出，還沒有人知道它。\n太明顯了，99%的...",
      "title": "爲什麼他媽的r/CryptoMoonShots還沒有被禁止？這不是很明顯的，它是一個充滿騙子的子網站嗎？"
    }
  ]
}