{
  "author": "LLMcCoolJ",
  "original_created_utc": 1635872837,
  "title": "Seriously fuck ethereum",
  "created_utc": 1635943746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I will continue holding ethereum coin and possibly buy more,  but its literally so fucking ridiculous how much the fees are to do anything on the blockchain.  Every &quot;smart contract call&quot; is at least $80 and its just to change one little thing on my ENS, or to swap a coin, or any other little thing.</p>\n\n<p>How are we supposed to make anything if we have to pay at least double for everything we do.   </p>\n\n<p>I know nobody cares at all about one person not using ethereum anymore.  But i just spent like 2 hours and $200 to come out empty handed.  Now i have $100 in a token that I cant even convert without $80 in ethereum.  Fucking pissed.</p>\n\n<p>Bullshit</p>\n\n<p>Queue hate comments.  Helpful ones are accepted too.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/ql8xjv/seriously_fuck_ethereum/",
  "subreddit": "CryptoCurrency",
  "id": "ql8xjv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I will continue holding ethereum coin and possibly buy more, but its literally\nso fucking ridiculous how much the fees are to do anything on the blockchain.\nEvery \"smart contract call\" is at least $80 and its just to change one little\nthing on my ENS, or to swap a coin, or any other little…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はイーサリアムコインを持ち続け、さらに購入する可能性もありますが、ブロックチェーン上で何かをするための手数料が文字通り\nブロックチェーン上で何かをするための手数料がどれだけ高いか、とても馬鹿げています。\nすべての「スマートコントラクトコール」は最低でも80ドルで、それは私のENS上のちょっとしたことを変更したり、コインを交換したり、その他のちょっとしたことにすぎません。\n私のENSでちょっとしたことを変更したり、コインを交換したり、その他ちょっとした...",
      "title": "真面目にイーサリアムを潰す"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我将继续持有以太币，并可能购买更多的以太币，但它的字面意思是\n在区块链上做任何事情的费用都是如此他妈的可笑。\n每一次 \"智能合约调用 \"都至少要80美元，而这只是为了改变我的ENS上的一件小事，或者交换一个币，或者是换一个币。\n我的ENS上的东西，或交换一个硬币，或任何其他小的...",
      "title": "说真的，去他妈的以太坊"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我將繼續持有以太幣，並可能購買更多的以太幣，但它的字面意思是\n在區塊鏈上做任何事情的費用都是如此他媽的可笑。\n每一次 \"智能合約調用 \"都至少要80美元，而這只是爲了改變我的ENS上的一件小事，或者交換一個幣，或者是換一個幣。\n我的ENS上的東西，或交換一個硬幣，或任何其他小的...",
      "title": "說真的，去他媽的以太坊"
    }
  ]
}