{
  "author": "savage-dragon",
  "original_created_utc": 1632835957,
  "title": "The Bitfinex $22 million 'error' and this sub's reaction & expressed desire to keep all the money just show what a bunch of hypocrites all crypto investors are.",
  "created_utc": 1632868481,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is the kind of subreddit that loves to call out Binance&#39;s greed and Robinhood&#39;s manipulating the market and other exchanges trying to &#39;scam&#39; people out of a few hundred bucks.</p>\n\n<p>This is the sub where you can see posts like &#39;fuck the greedy bankers&#39; and &#39;fuck this rigged greedy system&#39; on a daily basis from some sob self-story.</p>\n\n<p>This is the sub where you hear these people with $1000 to their name whining about whales &#39;acting too greedy&#39; and how all the whales &#39;cheat the system&#39; and how the &#39;rich only get richer&#39;.</p>\n\n<p>This is the sub that thinks they have a higher moral grounds and better integrity than those &#39;filthy rich whales&#39; just because they&#39;re poor. </p>\n\n<p>But evidence points towards the contrary.</p>\n\n<p>There are 2 topics talking about the same thing today. One post asks &#39;What would you do if someone accidentally sent you $22 million?&#39;. And the most upvoted answers? See for yourself:</p>\n\n<p><a href=\"https://imgur.com/a/oKdnsFJ\">https://imgur.com/a/oKdnsFJ</a></p>\n\n<p>Most of them would never return those funds. Some redditor even claim &#39;finders keepers law&#39;.</p>\n\n<p>Some guy says &#39;honest miners would return. I wouldn&#39;t&#39;.</p>\n\n<p>In a regulated financial world, keeping that money would amount to an illegal activity at best. Yet this is apparently the commonly accepted behavior of these poor, downtrodden &#39;crypto investors&#39; with moral integrity so high they think they&#39;re cleaner than &#39;those filthy billionaires&#39; they love to whine about.</p>\n\n<p>The funny part is that the miner who mined those $22 million actually returned the money. There&#39;s another post about it. And in it, there are also a bunch of upvoted comments about how they wouldn&#39;t return the money:</p>\n\n<p><a href=\"https://imgur.com/a/EGV7WNc\">https://imgur.com/a/EGV7WNc</a></p>\n\n<p><em>&quot;I’m sorry but I definitely would not return it. That’s the freedom to live my life how I actually want to.&quot;</em></p>\n\n<p><em>&quot;The whole reason Bitcoin exists is because rich folks have created and gamed the system throughout history and ripped us off along the way. Transaction fee in your error, collect your millions and go back to start :)&quot;</em> </p>\n\n<p>The absolute hypocrisy of the 2nd comment is actually something to behold. If the OP of that 2nd comment were in any position of power, you bet your hairy crypto ass he&#39;s going to abuses it as much as he can and plunder from whoever he can. He is whining about &#39;rich folk&#39;s gaming the system but he himself has no integrity either and is willing to commit a crime to become &#39;rich folks&#39; anyway.</p>\n\n<p>So the point of the story is this: None of us have any right to whine about the way the current system is fucked. None of us has any right to complain about how crypto only makes the rich richer. Because guess what? Given the chance, 99% of us would have done those some despicable things we love to whine about like a bunch of hypocrites. None of us actually has the moral integrity and goodness in us to do the same thing the miner did when he returned the funds honestly.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/mo_HRDqsW8T65mFm8LqBEofdtFkNihLBvB2ZPKiiunE.jpg?auto=webp&s=4368a6d53272db36ea51a88169422090a7ac3e64",
          "width": 737,
          "height": 1171
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/mo_HRDqsW8T65mFm8LqBEofdtFkNihLBvB2ZPKiiunE.jpg?width=108&crop=smart&auto=webp&s=ca9db12e1aef5c94b678986652ce7c6d0fc5afeb",
            "width": 108,
            "height": 171
          },
          {
            "url": "https://external-preview.redd.it/mo_HRDqsW8T65mFm8LqBEofdtFkNihLBvB2ZPKiiunE.jpg?width=216&crop=smart&auto=webp&s=0096917d7ad157fac073e8721ad077a20251afea",
            "width": 216,
            "height": 343
          },
          {
            "url": "https://external-preview.redd.it/mo_HRDqsW8T65mFm8LqBEofdtFkNihLBvB2ZPKiiunE.jpg?width=320&crop=smart&auto=webp&s=9ea674cf1122135abf9b87a9c72e5e2f67cec1a1",
            "width": 320,
            "height": 508
          },
          {
            "url": "https://external-preview.redd.it/mo_HRDqsW8T65mFm8LqBEofdtFkNihLBvB2ZPKiiunE.jpg?width=640&crop=smart&auto=webp&s=cc39870233c2a8b186547370a704cb788a71719a",
            "width": 640,
            "height": 1016
          }
        ],
        "variants": {},
        "id": "mTXjw5svxp-y3HNoG8xora5uwDhdnM3H1xnkKFSfk9k"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/px6hck/the_bitfinex_22_million_error_and_this_subs/",
  "subreddit": "CryptoCurrency",
  "id": "px6hck",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is the kind of subreddit that loves to call out Binance's greed and\nRobinhood's manipulating the market and other exchanges trying to 'scam' people\nout of a few hundred bucks.\n\nThis is the sub where you can see posts like 'fuck the greedy bankers' and 'fuck\nthis rigged greedy system' on a daily…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このようなsubredditでは、Binanceの強欲さを訴えることが大好きであり\nロビンフッドが市場を操作したり、他の取引所が人々から数百ドルを「詐欺」ようとしていることを非難するのが好きなサブレディです。\n数百ドルを巻き上げようとする他の取引所を非難するのが好きなサブレディです。\n\nこのサブレディットでは、「fuck the greedy bankers」や「fuck this rigged greedy system」といった投稿を見ることができます。\n貪欲な銀行家はくそくらえ」「この不正な貪欲なシステムはくそくらえ」などの投稿を毎日見ることができるサブチャンネルです...",
      "title": "Bitfinexの2,200万ドルの「エラー」と、このサブスクライバの反応と全資金を保持したいという表明は、すべての暗号投資家がいかに偽善者の集まりであるかを示している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个喜欢指责Binance的贪婪和Robinhood的操纵的子Reddit。\nRobinhood操纵市场，以及其他交易所试图 \"诈骗 \"人们的行为。\n骗取几百块钱。\n\n在这个分站，你可以看到 \"去他妈的贪婪的银行家 \"和 \"去他妈的\n这个被操纵的贪婪的系统 \"这样的帖子。",
      "title": "Bitfinex 2200万美元的 \"错误 \"和这个子的反应和表示希望保留所有的钱，只是表明所有加密货币投资者都是一群虚伪的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個喜歡指責Binance的貪婪和Robinhood的操縱的子Reddit。\nRobinhood操縱市場，以及其他交易所試圖 \"詐騙 \"人們的行爲。\n騙取幾百塊錢。\n\n在這個分站，你可以看到 \"去他媽的貪婪的銀行家 \"和 \"去他媽的\n這個被操縱的貪婪的系統 \"這樣的帖子。",
      "title": "Bitfinex 2200萬美元的 \"錯誤 \"和這個子的反應和表示希望保留所有的錢，只是表明所有加密貨幣投資者都是一羣虛僞的人。"
    }
  ]
}