{
  "author": "NPRjunkieDC",
  "the_new_excerpt": "https://nyti.ms/2QZBxiN\n\nPeloton is recalling its Tread+ and Tread treadmills, the at-home fitness\ncompany said on Wednesday, less than a month after it fought the U.S. Consumer\nProduct Safety Commission as it warned that dozens of injuries and one death of\na child had been linked to the…",
  "original_created_utc": 1620228446,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://nyti.ms/2QZBxiN\n\nペロトン社は、家庭用フィットネス機器「Tread+」および「Tread」をリコールします。\nこれは、米国消費者製品安全委員会と争ってから1ヶ月も経たないうちに発表されたものです。\n米国消費者製品安全委員会が、この製品に関連して数十人の負傷者と1人の子供の死亡者が出たと警告してから1ヶ月も経たないうちに、Pelotonは水曜日に発表しました。\nこれは、米国消費者製品安全委員会が、「Tread+」と「Treadmill」に関連して数十人の負傷者と1人の子供の死亡者が出たことを警告してから1ヶ月後のことです。",
      "title": "ペロトン社、安全警告後にトレッドミルをリコール"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://nyti.ms/2QZBxiN\n\nPeloton正在召回其Tread+和Tread跑步机。\n该公司周三表示，在与美国消费者产品安全委员会(U.S. Consumer Product Safety Commission)交涉后不到一个月，该公司就召回了Tread+和Tread跑步机。\n产品安全委员会警告说，几十起受伤事件和一起儿童死亡事件与该产品有关。\n该委员会警告说，数十起受伤事件和一起儿童死亡事件都与该产品有关...",
      "title": "Peloton在发出安全警告后召回跑步机"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://nyti.ms/2QZBxiN\n\nPeloton正在召回其Tread+和Tread跑步機。\n該公司週三表示，在與美國消費者產品安全委員會(U.S. Consumer Product Safety Commission)交涉後不到一個月，該公司就召回了Tread+和Tread跑步機。\n產品安全委員會警告說，幾十起受傷事件和一起兒童死亡事件與該產品有關。\n該委員會警告說，數十起受傷事件和一起兒童死亡事件都與該產品有關...",
      "title": "Peloton在發出安全警告後召回跑步機"
    }
  ],
  "title": "Peloton Recalls Treadmills After Safety Warnings",
  "created_utc": 1620233430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://nyti.ms/2QZBxiN\">https://nyti.ms/2QZBxiN</a></p>\n\n<p>Peloton is recalling its Tread+ and Tread treadmills, the at-home fitness company said on Wednesday, less than a month after it fought the U.S. Consumer Product Safety Commission as it warned that dozens of injuries and one death of a child had been linked to the machines.</p>\n\n<p>The commission, which issued an “urgent warning” for the machines in April, urged people who own the treadmills to immediately stop using them. Peloton is offering a full refund for the $4,295 machine with a 32-inch touch screen that allows runners to work out with the aid of instructors.</p>\n\n<p>John Foley, the chief executive of Peloton, said in a statement Wednesday that the company had “made a mistake” by fighting the agency’s request to recall the treadmills, and apologized for not engaging “more productively with them from the outset.”</p>\n\n<p>“The decision to recall both products was the right thing to do for Peloton’s members and their families,” he said in the statement.</p>\n\n<p>The machines were sold in the United States from November to March. The company is working on a repair to be offered to customers “in the coming weeks,” the commission said in a statement. The software improvements will automatically lock the Tread+ after use and require a four-digit passcode to unlock it, the commission said.</p>\n\n<p>“Today we have taken steps to prevent further harm from these two products,” Robert S. Adler, the acting chairman of the commission, said in the statement.</p>\n\n<p>The commission said it had received 72 reports of adults, children, pets and objects being pulled under the rear of the treadmill. Twenty-nine involved children, including a 6-year-old boy who died.</p>\n\n<p>After the death of the child in March, the company urged users to keep Peloton products where children can’t get to them and store safety keys away from children</p>\n</div><!-- SC_ON -->",
  "score": 2786,
  "permalink": "/r/stocks/comments/n5ikkk/peloton_recalls_treadmills_after_safety_warnings/",
  "subreddit": "stocks",
  "id": "n5ikkk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968360
}