{
  "author": "ChannelLivid",
  "original_created_utc": 1646125387,
  "title": "Ukraine crisis - We open our small platform for Ukrainians to use",
  "created_utc": 1646147208,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi all,&lt;br/&gt;\nWe are two product builders - Lisa and Damian. Lisa&amp;#39;s from Ukraine, I&amp;#39;m in Poland. We observe the crisis with dread, watching friends and relatives under attack. We need to get active.&lt;br/&gt;\nTherefore we decided to contribute with our small freelancing platform - &lt;a href=\"https://ramen.network\"&gt;ramen.network&lt;/a&gt;.&lt;br/&gt;\nWe will help regular people like Lisa&amp;#39;s relatives - lucky to be alive, but lost their jobs and are isolated from the world.&lt;br/&gt;\nWe will use our platform ramen and try to get as many Ukrainians jobs through this as possible with our small team and currently manual operations.&lt;/p&gt;\n\n&lt;p&gt;How can you help?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;If you know Ukrainians in need for a remote job, send their profiles. Our small team will try to find remote work for them as fast as possible in our network.&lt;/li&gt;\n&lt;li&gt;Or if you are a developer, you can help us automate this process.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;We won&amp;#39;t charge any user on this marketplace until foreseeable future. Our mission: Get Ukrainians back into jobs to feed their families fast and without bureaucracy.&lt;/p&gt;\n\n&lt;p&gt;Want to contribute? Join the discussion on slack or DM me.&lt;br/&gt;\n&lt;a href=\"https://ramennetworkgroup.slack.com/archives/C031P59UNHF\"&gt;https://ramennetworkgroup.slack.com/archives/C031P59UNHF&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Have other burning problems WE can help with for Ukraine? - Let us know.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/t43pma/ukraine_crisis_we_open_our_small_platform_for/",
  "subreddit": "SideProject",
  "id": "t43pma",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi all,\nWe are two product builders - Lisa and Damian. Lisa's from Ukraine, I'm in\nPoland. We observe the crisis with dread, watching friends and relatives under\nattack. We need to get active.\nTherefore we decided to contribute with our small freelancing platform -\nramen.network…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n私たちは、LisaとDamianという2人のプロダクトビルダーです。Lisaはウクライナ出身で、僕は\nポーランド 私たちは、友人や親戚が危機にさらされているのを目の当たりにし、恐怖を感じながら危機を観察しています。\n攻撃される。私たちは活動的になる必要があります。\nしたがって、我々は我々の小さなフリーランスのプラットフォームで貢献することを決めた - 。\nラーメン.network...",
      "title": "ウクライナ危機 - 私たちはウクライナ人のために小さなプラットフォームを開きます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n我们是两个产品建造者--丽莎和达米安。丽莎来自乌克兰，我在\n波兰。我们恐惧地观察着这场危机，看着朋友和亲戚受到攻击。\n攻击。我们需要积极行动起来。\n因此，我们决定用我们的小型自由职业者平台--\nramen.network...",
      "title": "乌克兰危机--我们为乌克兰人开放小平台，供其使用"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n我們是兩個產品建造者--麗莎和達米安。麗莎來自烏克蘭，我在\n波蘭。我們恐懼地觀察着這場危機，看着朋友和親戚受到攻擊。\n攻擊。我們需要積極行動起來。\n因此，我們決定用我們的小型自由職業者平臺--\nramen.network...",
      "title": "烏克蘭危機--我們爲烏克蘭人開放小平臺，供其使用"
    }
  ]
}