{
  "author": "Spaceisveryhard",
  "original_created_utc": 1633712130,
  "title": "How did the Indonesian islands go from Hinduisim to Islam to go on to become the largest population of Muslims in the world, and why did bali stay Hindu? And where does buddhism fit in?",
  "created_utc": 1633730312,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some sources say it was traders others say it was also invaded. They say the hindus fled to bali, why not just finish them off? Why let them stay for hundreds of years? And yet buddhism plays small but significant role as well. There are some buddhist temples all the way up in nothern thailand that utilize balinesian styles so clearly balinesian buddhism was also immensely relevant itself. Theres so much to unpack.... i think i need an answer from the hindu/muslim perspective and then a different one for buddhism if possible. I live in Thailand so the buddhism angle is a very curious one.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/q41swl/how_did_the_indonesian_islands_go_from_hinduisim/",
  "subreddit": "AskHistorians",
  "id": "q41swl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some sources say it was traders others say it was also invaded. They say the\nhindus fled to bali, why not just finish them off? Why let them stay for\nhundreds of years? And yet buddhism plays small but significant role as well.\nThere are some buddhist temples all the way up in nothern thailand that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある情報筋は、それはトレーダーだったと言い、またある情報筋は、それはまた侵略されたと言う。ヒンドゥー教徒は\nヒンドゥー教徒はバリに逃げたそうですが、なぜ彼らを殺してしまわないのでしょうか？なぜ何百年も滞在させたのか？\n何百年も滞在させたのか？しかし、仏教は小さいながらも重要な役割を果たしています。\nタイの北部には仏教寺院がいくつかあり、そこには...",
      "title": "インドネシアの島々は、ヒンドゥー教からイスラム教になり、世界最大のイスラム教徒の人口を持つようになりましたが、バリはなぜヒンドゥー教のままだったのでしょうか？また、バリはなぜヒンドゥー教のままだったのでしょうか。また、ブディズムはどこにあるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一些消息来源说它是商人，另一些消息来源说它也被入侵了。他们说\n印度教徒逃到了巴厘岛，为什么不直接把他们干掉？为什么让他们呆了\n几百年的时间？然而，佛教也扮演着小而重要的角色。\n在泰国北部有一些佛教寺庙，这些寺庙都是由佛教徒组成的。",
      "title": "印度尼西亚群岛是如何从印度教转为伊斯兰教，进而成为世界上最大的穆斯林人口，以及为什么巴厘岛保持印度教？佛教又是如何融入其中的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一些消息來源說它是商人，另一些消息來源說它也被入侵了。他們說\n印度教徒逃到了巴厘島，爲什麼不直接把他們幹掉？爲什麼讓他們呆了\n幾百年的時間？然而，佛教也扮演着小而重要的角色。\n在泰國北部有一些佛教寺廟，這些寺廟都是由佛教徒組成的。",
      "title": "印度尼西亞羣島是如何從印度教轉爲伊斯蘭教，進而成爲世界上最大的穆斯林人口，以及爲什麼巴厘島保持印度教？佛教又是如何融入其中的？"
    }
  ]
}