{
  "author": "Tron_Passant",
  "original_created_utc": 1631430692,
  "title": "Let's say Satoshi is still out there. Watching... waiting... sitting on a million BTC. What are some things he could someday do with those coins (good or evil) that would change the world?",
  "created_utc": 1631467925,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like for example he could gift a million sats to 100M poor families or something. Lift a bunch of people out of poverty in a strategic place at a strategic time to shift the balance of power somewhere.</p>\n\n<p>Or he could wait until bitcoin becomes global reserve currency and just start dumping his stash. Practically tank the world economy or bankrupt panicky nations.</p>\n\n<p>I&#39;m curious to hear some outside-the-box ideas. Imagine he&#39;s playing the long game...</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/Bitcoin/comments/pmo2mh/lets_say_satoshi_is_still_out_there_watching/",
  "subreddit": "Bitcoin",
  "id": "pmo2mh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like for example he could gift a million sats to 100M poor families or\nsomething. Lift a bunch of people out of poverty in a strategic place at a\nstrategic time to shift the balance of power somewhere.\n\nOr he could wait until bitcoin becomes global reserve currency and just start\ndumping his stash.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、100万枚のサットを1億人の貧しい家庭に贈るとか、そういうことです。\n例えば、100万台の衛星を1億人の貧困家庭にプレゼントするとか、そういうことです。戦略的な場所で、戦略的なタイミングで、多くの人々を貧困から救い出す。\n戦略的な時期に戦略的な場所で大勢の人々を貧困から救い、どこかでパワーバランスを変える。\n\nあるいは、ビットコインが世界の基軸通貨になるまで待って、自分の隠し金を捨て始めることもできます。\n捨ててしまうかもしれません。....",
      "title": "サトシがまだいるとしよう。見ている...待っている...100万BTCに座っている。彼がいつかそのコインを使って（善か悪かは別にして）世界を変えるようなことをするとしたら？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，他可以向1亿个贫困家庭赠送100万个卫星。\n诸如此类。在一个战略要地，在一个战略时机，让一群人摆脱贫困。\n来改变某个地方的权力平衡。\n\n或者他可以等到比特币成为全球储备货币，然后就开始\n抛出他的藏品....",
      "title": "比方说聪聪还在外面。观察......等待......坐在一百万个BTC上。有一天，他可以用这些硬币做哪些事情（无论善恶），从而改变世界？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，他可以向1億個貧困家庭贈送100萬個衛星。\n諸如此類。在一個戰略要地，在一個戰略時機，讓一羣人擺脫貧困。\n來改變某個地方的權力平衡。\n\n或者他可以等到比特幣成爲全球儲備貨幣，然後就開始\n拋出他的藏品....",
      "title": "比方說聰聰還在外面。觀察......等待......坐在一百萬個BTC上。有一天，他可以用這些硬幣做哪些事情（無論善惡），從而改變世界？"
    }
  ]
}