{
  "author": "tadgy1999",
  "original_created_utc": 1627665301,
  "title": "BitBoy banned again!",
  "created_utc": 1627680641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In yet another twist to the shady history of BitBoy’s channel it appears that he has yet again been banned from YouTube for the second time this week!.</p>\n\n<p>YouTube do not just terminate crypto channels without evidence that the channel is in violation of the rules. </p>\n\n<p>Another reminder that this guy is a piece of shit who preys on the very people who support him, he makes baseless claims about projects to shill his bags and you should always take whatever crypto YouTubers say with a pinch of salt. Coin Bureau is the only source of crypto YouTube that I would recommend to people.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/CryptoCurrency/comments/ououww/bitboy_banned_again/",
  "subreddit": "CryptoCurrency",
  "id": "ououww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In yet another twist to the shady history of BitBoy’s channel it appears that he\nhas yet again been banned from YouTube for the second time this week!.\n\nYouTube do not just terminate crypto channels without evidence that the channel\nis in violation of the rules.\n\nAnother reminder that this guy is a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BitBoyのチャンネルの歴史に新たな展開があったようです。\n今週2回目のYouTube禁止令が出されました。\n\nYouTubeは、チャンネルがルールに違反しているという証拠なしに、暗号チャンネルを終了させることはありません。\nYouTubeは、チャンネルがルールに違反しているという証拠がなければ、暗号チャンネルを終了させません。\n\nまた、この男が...",
      "title": "BitBoyがまたもやBANされてしまった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在BitBoy频道的黑历史的另一个转折中，似乎他\n本周第二次被禁止进入YouTube！。\n\nYouTube不会在没有证据的情况下就终止加密货币频道\n违反了规则。\n\n另一个提醒，这家伙是一个...",
      "title": "BitBoy又被禁了！？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在BitBoy頻道的黑歷史的另一個轉折中，似乎他\n本週第二次被禁止進入YouTube！。\n\nYouTube不會在沒有證據的情況下就終止加密貨幣頻道\n違反了規則。\n\n另一個提醒，這傢伙是一個...",
      "title": "BitBoy又被禁了！？"
    }
  ]
}