{
  "author": "King_Vercingetorix",
  "original_created_utc": 1646580016,
  "title": "Former Chief Justice Warren Burger in 1991 described the NRA’s lobbying in support of an expansive interpretation of the Second Amendment as: “One of the greatest pieces of fraud he has ever seen.\" Just how influential was the NRA in changing American public opinions on the 2nd Amendment?",
  "created_utc": 1646588100,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Full quote in question:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;He declared on PBS that the Second Amendment &amp;quot;This has been the subject of one of the greatest pieces of fraud, I repeat the word fraud, on the American public by special interest groups that I have ever seen in my lifetime.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And if you look at Gallup polls, there does seem to be a drastic decline between Americans in 1991 (there doesn&amp;#39;t seem to be any polls before 1991) until 2002 on those who want stricter gun control (78% down to 50% or so) and those who want less gun control (17% to 35% or so).&lt;/p&gt;\n\n&lt;p&gt;How much of this can be attributed to the NRA&amp;#39;s lobbying? If a lot, how was the NRA able to so effectively convince large parts of the US population on a more expansive interpretation of the 2nd Amendment beyond US v Miller?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/t80wiq/former_chief_justice_warren_burger_in_1991/",
  "subreddit": "AskHistorians",
  "id": "t80wiq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Full quote in question:\n\n> He declared on PBS that the Second Amendment \"This has been the subject of one\n> of the greatest pieces of fraud, I repeat the word fraud, on the American\n> public by special interest groups that I have ever seen in my lifetime.\"\n\nAnd if you look at Gallup polls, there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "問題の全文引用\n\n> 彼はPBSで、憲法修正第二条について「これは、ある種の\n> アメリカ人に対する最大の詐欺の一つであり、詐欺という言葉を繰り返す。\n> 私の生涯で見た中で、特別な利益団体による一般大衆のためのものです。\n\nそして、ギャラップ社の世論調査を見ると、そこには...",
      "title": "ウォーレン・バーガー元最高裁判事は1991年、憲法修正第2条の拡大解釈を支持するNRAのロビー活動を次のように評した。「彼がこれまで見た中で最大の詐欺行為の一つである。憲法修正第2条に関するアメリカの世論を変えるのに、NRAはどれほど影響力があったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "问题中的全文引用。\n\n> 他在公共广播公司宣称，第二修正案 \"是美国最大的欺诈行为之一，我重复这个词。\n> 我重复这个词，是我所见过的特殊利益集团对美国公众最大的欺诈行为之一。\n> 我一生中见过的特殊利益集团对美国公众的最大欺诈之一\"。\n\n如果你看一下盖洛普民意调查，有...",
      "title": "前首席大法官沃伦-伯格在1991年描述了NRA为支持对第二修正案的扩张性解释而进行的游说。\"他所见过的最大的欺诈行为之一\"。在改变美国公众对第二修正案的看法方面，NRA的影响力到底有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "問題中的全文引用。\n\n> 他在公共廣播公司宣稱，第二修正案 \"是美國最大的欺詐行爲之一，我重複這個詞。\n> 我重複這個詞，是我所見過的特殊利益集團對美國公衆最大的欺詐行爲之一。\n> 我一生中見過的特殊利益集團對美國公衆的最大欺詐之一\"。\n\n如果你看一下蓋洛普民意調查，有...",
      "title": "前首席大法官沃倫-伯格在1991年描述了NRA爲支持對第二修正案的擴張性解釋而進行的遊說。\"他所見過的最大的欺詐行爲之一\"。在改變美國公衆對第二修正案的看法方面，NRA的影響力到底有多大？"
    }
  ]
}