{
  "author": "pieisgiood876",
  "original_created_utc": 1624962977,
  "title": "How seriously did the Imperial Japanese Navy actually take the threat of Allied submarines during the Pacific War?",
  "created_utc": 1625008587,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have read a great deal about the Pacific War my whole life, and I have often come across the statement that commerce raiding by submarine was instrumental in weakening Japan&#39;s ability to wage war. I have read that the tactics used by the United States were greatly influenced by Nazi Germany&#39;s wolf pack strategies, and that the Japanese failed to implement effective countermeasures for the entire war, unlike the Allies in the Atlantic, who were able to turn back the U-boat threat from 1943 onwards.   </p>\n\n<p>So I wonder, were the Japanese aware of the grave nature of the threat? Were submarines not taken seriously or the effects of commerce raiding not taken seriously? Was it a technological and production issue where they had a plan but not enough resources to implement it? Did the IJN study German tactics and if so, did they themselves implement them with their submarines or try to develop countermeasures?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/oa5nlw/how_seriously_did_the_imperial_japanese_navy/",
  "subreddit": "AskHistorians",
  "id": "oa5nlw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have read a great deal about the Pacific War my whole life, and I have often\ncome across the statement that commerce raiding by submarine was instrumental in\nweakening Japan's ability to wage war. I have read that the tactics used by the\nUnited States were greatly influenced by Nazi Germany's wolf…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は人生の中で太平洋戦争について多くの本を読んできましたが、その中でよく\n潜水艦による商取引は、日本の戦争能力を低下させるのに役立った」という記述をよく目にしました。\n日本の戦争能力を弱めるのに役立ったという記述をよく目にしました。アメリカが使った戦術は、ナチス・ドイツの影響を大きく受けているという記事を読んだことがあります。\nアメリカの戦術は、ナチスドイツの狼煙に大きな影響を受けていたと読んだことがあります。",
      "title": "太平洋戦争中、日本海軍は連合軍の潜水艦の脅威をどのくらい真剣に受け止めていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一生中阅读了大量关于太平洋战争的书籍，我经常看到这样的说法：潜艇的商业袭击对美国来说是非常重要的。\n我经常看到这样的说法：潜艇的商业袭击在削弱日本的战争能力方面发挥了作用。\n削弱了日本发动战争的能力。我在书中读到，美国使用的战术在很大程度上受到纳粹的影响。\n美国使用的战术在很大程度上受到纳粹德国 \"狼性 \"的影响。",
      "title": "在太平洋战争期间，日本帝国海军对盟军潜艇的威胁究竟有多认真？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一生中閱讀了大量關於太平洋戰爭的書籍，我經常看到這樣的說法：潛艇的商業襲擊對美國來說是非常重要的。\n我經常看到這樣的說法：潛艇的商業襲擊在削弱日本的戰爭能力方面發揮了作用。\n削弱了日本發動戰爭的能力。我在書中讀到，美國使用的戰術在很大程度上受到納粹的影響。\n美國使用的戰術在很大程度上受到納粹德國 \"狼性 \"的影響。",
      "title": "在太平洋戰爭期間，日本帝國海軍對盟軍潛艇的威脅究竟有多認真？"
    }
  ]
}