{
  "author": "learningandearning2",
  "original_created_utc": 1626739110,
  "title": "Am I, as a man, not supposed to respond to children when they address me in public?",
  "created_utc": 1626760464,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In my leisure time I wear almost exclusively Marvel, wrestling, and Disney graphic tees. Children will often complement them when I’m grocery shopping. I will thank them and continue on my way and their mothers will sometimes will give me dirty looks. I feel like it’s rude to not respond to them, but I’m not aware if I’m mistakenly committing a social faux pas that I’ve never been made aware of.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/onqgxo/am_i_as_a_man_not_supposed_to_respond_to_children/",
  "subreddit": "NoStupidQuestions",
  "id": "onqgxo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In my leisure time I wear almost exclusively Marvel, wrestling, and Disney\ngraphic tees. Children will often complement them when I’m grocery shopping. I\nwill thank them and continue on my way and their mothers will sometimes will\ngive me dirty looks. I feel like it’s rude to not respond to them,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "余暇にはほとんどマーベル、プロレス、ディズニーのグラフィックTシャツを着ています。\nグラフィックTを着ています。スーパーで買い物をしていると、子どもたちがよくそれを褒めてくれます。I\nお礼を言って買い物を続けると、その子供たちの母親がたまに\n汚い目で見られることがあります。このままでは失礼な気がするのですが...。",
      "title": "男性である私は、公共の場で子どもたちに声をかけられても、それに応えてはいけないのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在闲暇时间，我几乎只穿漫威、摔跤和迪士尼的\n图案T恤。在我买菜的时候，孩子们经常会补充他们。I\n我会感谢他们，然后继续我的方式，他们的母亲有时会给我一个肮脏的眼神。\n他们的母亲有时会向我投来鄙夷的目光。我觉得不回应他们是不礼貌的，...",
      "title": "作为一个男人，当孩子们在公共场合称呼我时，我是不是不应该回应他们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在閒暇時間，我幾乎只穿漫威、摔跤和迪士尼的\n圖案T恤。在我買菜的時候，孩子們經常會補充他們。I\n我會感謝他們，然後繼續我的方式，他們的母親有時會給我一個骯髒的眼神。\n他們的母親有時會向我投來鄙夷的目光。我覺得不迴應他們是不禮貌的，...",
      "title": "作爲一個男人，當孩子們在公共場合稱呼我時，我是不是不應該回應他們？"
    }
  ]
}