{
  "author": "Blendzi0r",
  "original_created_utc": 1628446529,
  "title": "I analyzed top 16 contributors in the latest Moon distribution. What did they get their Moons for?",
  "created_utc": 1628454937,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Triggered by the case of <a href=\"/u/safelyoptimized\">u/safelyoptimized</a>, I decided to analyze top contributors of this month. First of all, you might want to vote in the poll linked below to remove <a href=\"/u/safelyoptimized\">u/safelyoptimized</a> from Moon distribution if you haven’t done so yet:</p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p07v03/emergency_proposal_exclude_user_from_moon/\">https://www.reddit.com/r/CryptoCurrency/comments/p07v03/emergency_proposal_exclude_user_from_moon/</a></p>\n\n<p><strong>As many as 16 redditors reached the limit of 15 000 karma in the last cycle (July 7 – August 4):</strong></p>\n\n<p><a href=\"/u/ultron290196\">u/ultron290196</a></p>\n\n<p>Reddit allows to check only the last 1000 comments. And since ultron290196 has written more than 1000 comments, the last one I could check was from July 24. I guess we can safely assume ultron290196 wrote more than 2k comments.</p>\n\n<p>One of those comments was: BTC dumps to 30k in one day: Manipulation! BTC pumps to 40k in one hour: Natural Progression!  Which earned him 112 upvotes (<a href=\"https://www.reddit.com/r/CryptoCurrency/comments/oro9dv/bitcoin_just_touched_40k_from_the_mid_35k_range/h6jehdo/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/CryptoCurrency/comments/oro9dv/bitcoin_just_touched_40k_from_the_mid_35k_range/h6jehdo/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3</a> )</p>\n\n<p>Ultron was so proud of this comment that he repeated it once more, adding a sentence from another user:(<a href=\"https://www.reddit.com/r/CryptoCurrency/comments/oro9dv/bitcoin_just_touched_40k_from_the_mid_35k_range/h6jejn4/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/CryptoCurrency/comments/oro9dv/bitcoin_just_touched_40k_from_the_mid_35k_range/h6jejn4/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3</a> )</p>\n\n<p>and also made it into his most successful post with almost 3k upvotes (<a href=\"https://www.reddit.com/r/CryptoCurrency/comments/orrp9c/btc_dumps_to_30k_in_one_day_manipulation_btc/\">https://www.reddit.com/r/CryptoCurrency/comments/orrp9c/btc_dumps_to_30k_in_one_day_manipulation_btc/</a> )</p>\n\n<p>99.9% of ultron’s comments are on <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> or connected subs (memes, meta) and the great majority of them are very short comments trying to be funny or fit in with subreddit’s sentiment (this is characteristic also for all the other redditors who managed to reach the karma limit). What I have to admit is that ultron, although his comments aren’t groundbreaking or controversial in any way, is rather creative and - except for the example above - he doesn’t repeat his comments. He also doesn’t hide the fact he’s an Indian moon farmer.</p>\n\n<p>His highest comment score was 364. 9 of his comments managed to get more than 100 upvotes. Haven’t seen him going below -1. Most of the comments are in 1-2 range (this is also characteristic for all the others).</p>\n\n<p>As for the posts – it’s similar. Most of them are his opinions in which he tries to relate to other members of the community and get those upvotes – most of the time he fails but there are a couple of posts that were pretty successful. But Ultron, as a professional moon farmer, knows that money is made in the comment section.</p>\n\n<p><a href=\"/u/WackyMister\">u/WackyMister</a></p>\n\n<p>WackyMister is also aware that Moons are made in the comment section so he didn’t bother with creating any posts.</p>\n\n<p>Unfortunately, as in the case of Ultron, WackyMister has written so many comments, that the oldest comment I could check is from… August 4. Yes, he wrote more than 1k comments in 4 days.</p>\n\n<p>This is moon farming at its purest/dirtiest. The comments longer than a couple of words are as rare as people who are “in it for the tech, not for the money”. This is best illustrated by the fact that only 3 of Wacky’s comments managed to receive more than 100 upvotes (top score: 348).</p>\n\n<p><a href=\"/u/Too_raw90\">u/Too_raw90</a></p>\n\n<p>Created 3 posts, got only 4-11 upvotes, so went all in into comments.</p>\n\n<p>He&#39;s just like Wacky: full moon farming mode is enabled. Massive number of very short comments of rather low quality and only 4 of them managed to receive more than 100 upvotes (top score: 226).</p>\n\n<p><a href=\"/u/jasonluxton\">u/jasonluxton</a></p>\n\n<p>He started the month by posting a lot but probably later realized that it pays better to focus on comments. Out of 26 posts, which are mostly news or pretty useful tips/reminders (how) to stay safe, 7 were successful and received more than 100 upvotes (1 of them even broke the barrier of 1000 and another one was pretty close).</p>\n\n<p>Unfortunately, when it comes to the quality of jasonluxton’s comments, it doesn’t look as good (most of the comments in 1-2 upvotes range, top score of only 168). Again, these are short, rather low effort, plenty of GIFs. But at least he doesn’t seem to be spamming as much as the two guys above (which, of course, doesn&#39;t mean he isn&#39;t a spammer ;-).</p>\n\n<p>What I like about this guy is the fact that he seems to have a life outside of <a href=\"/r/cc\">r/cc</a> on Reddit – he’s active in psx and amiga subreddits.</p>\n\n<p><a href=\"/u/HanditoSupreme\">u/HanditoSupreme</a></p>\n\n<p>Only two (unsuccessful) posts. But plenty of comments. Most of them short and low effort (and unsuccessful). But there are some exceptions. The comment history looks pretty good compared to WackyMsiter or Too-raw90. But it’s still 99% moon farming. 7 comments managed to receive 100 upvotes or more with the top one scoring 321 points.</p>\n\n<p><a href=\"/u/Soupapinho\">u/Soupapinho</a></p>\n\n<p>When it comes to posts, it’s (surprise!) quality over quantity – 3 posts and 2 of them very successful. But when it comes to comments it’s (no surprise) the other way around. It’s enough to say that Soupapinho highest rated comment, despite all the spam, got only 28 upvotes. He likes to post lots of GIFs.</p>\n\n<p><strong>Accomplished-Design7</strong></p>\n\n<p>This guy is a full time farmer it seems – he’s not only active in <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>, but also in <a href=\"/r/FortNiteBR\">r/FortNiteBR</a> (that’s where you can farm Bricks, right?).</p>\n\n<p>When it come to posts, he made around 50 of them, including 8 with more than 100 upvotes (2 of them extremely successful – 900+ and 1 800+ upvotes and plenty of awards) .</p>\n\n<p>When it comes to comments, he struck gold with commenting on the mistake made in the title of one of the most upvoted posts in the history of the subreddit and received more than 1.1k upvotes for this comment (and 318 for another in the same post). Other than that, it’s typical moon farming but 6 other comments of his received more than 100 upvotes.</p>\n\n<p><a href=\"/u/pmbuttsonly\">u/pmbuttsonly</a></p>\n\n<p>20 posts, mostly news, 3 of them reached more than 100 upvotes (145-403 points).</p>\n\n<p>Comments? No surprise – spam of mostly short, one-sentence (or even word word/letter) comments. But probably not as severe as in the case of some other farmers. Also – many successful comments which scored 1.3k, 657, 572, 422, 368 and 143 points. Definitely the most impressive “portfolio” so far.</p>\n\n<p><a href=\"/u/Ndivided132\">u/Ndivided132</a></p>\n\n<p>Now, here we have a guy who did something useful – he’s the one responsible for the governance poll that allows us to tip up to 100 Moons without losing the 20% bonus. So, maybe he&#39;s the first guy who managed to reach the limit without farming? Let’s see the comments.</p>\n\n<p>Nope, he IS a farmer – spam, GIFs, short replies. Top comment with only 31 upvotes (and it’s a GIF).</p>\n\n<p><a href=\"/u/Tenma_Hito\">u/Tenma_Hito</a></p>\n\n<p>Only 3 posts, none of them successful.</p>\n\n<p>When it comes to comments, Tenma isn’t different from all the others – lots of them. And still – only 3 with a count above 100 upvotes.</p>\n\n<p><a href=\"/u/Norbit11\">u/Norbit11</a></p>\n\n<p>Calls herself a “degenerate Moon farmer”. Aptly so?</p>\n\n<p>Let’s see – only one post in <a href=\"/r/cc\">r/cc</a> (didn’t catch on) but very active in other subs (F1 fan). Doesn&#39;t look like a degenerate moon farmer so far. Let’s see the comments.</p>\n\n<p>Oh, yes. A truly degenerated moon farmer. And a Daily Discussion one. Therefore, her top comment earned her as few as 18 points.</p>\n\n<p>Pretty active in <a href=\"/r/ccmeta\">r/ccmeta</a> but still the title of a degenerate moon farmer seems to be apt.</p>\n\n<p><a href=\"/u/step11234\">u/step11234</a></p>\n\n<p>3 posts, 2 of them of comedic nature. Only one with more than 100 upvotes. Seems to be active in many other subs, at least when it comes to posting. Because when it comes to commenting, it’s no surprise that step11234 floods the <a href=\"/r/cc\">r/cc</a> sub. 9 comments above the 100 upvotes mark. Top one with 403 points.</p>\n\n<p><a href=\"/u/bobloblawTheFirst\">u/bobloblawTheFirst</a></p>\n\n<p>Joined in the beginning of May 2021. Hasn’t posted anything. And also when it comes to comments, Bob didn’t spam as much as the others – I was able to go back as far as the beginning of the distribution cycle (July 7) in his comment history! This was impossible in the case of other users. This, of course, doesn’t mean bob didn’t farm. He did. But with more moderation, it seems. His 1.2k+ upvotes comment on July 17, followed shortly by three 200+ comments, made him hit the jackpot and probably allowed to relax and cut the spam. Or maybe he’s the perfect shitposters you should look up to if you want to become one? He made 6 more comments which scored more than 100 points.</p>\n\n<p><a href=\"/u/fitbhai\">u/fitbhai</a></p>\n\n<p>Posts a loooot. But mostly for Donuts(?) on <a href=\"/r/ethtrader\">r/ethtrader</a>. From 31 posts he made on <a href=\"/r/cc\">r/cc</a>, only 3 were able to get circa 100 upvotes. 3 comments with more than 200 points (267 being the top one), 5 with more than 100. Short, even very short comemnts, lots of GIFs, lots of spam. 100% farmer, like all the others.</p>\n\n<p><strong>The conclusion</strong> is something we already knew: the best way to farm Moons is to be funny (quality shitposting/commenting). But if you’re not that funny you still have a chance – spam the hell out of the sub and keep trying. Even if 1 in 100 of your comments catches on, if you write more than 1000 of them, you still have a chance to be handsomely rewarded.</p>\n\n<p>PS. Yes, this is what I spent my Sunday on.</p>\n\n<p>EDIT: I know that most of you guys are adults and don&#39;t need this edit but I just wanted to say that this post was meant to be light-hearted and as much as we might not like the fact that someone writes so many comments - as long as those comments aren&#39;t copied/stolen/recycled over and over - we should also appreciate the creativity and devotion of those guys. They also showed good humor about the whole thing in the comments (well, how could they pass up this opportunity ;-) ) so kudos to them and the most important thing is - <strong>they don&#39;t break any rules</strong>.</p>\n\n<p>Thanks for all the nice comments!</p>\n</div><!-- SC_ON -->",
  "score": 352,
  "permalink": "/r/CryptoCurrency/comments/p0jsd8/i_analyzed_top_16_contributors_in_the_latest_moon/",
  "subreddit": "CryptoCurrency",
  "id": "p0jsd8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Triggered by the case of u/safelyoptimized [/u/safelyoptimized], I decided to\nanalyze top contributors of this month. First of all, you might want to vote in\nthe poll linked below to remove u/safelyoptimized [/u/safelyoptimized] from Moon\ndistribution if you haven’t done so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "u/safelyoptimized [/u/safelyoptimized]のケースをきっかけに、今月のトップコントリビューターを分析することにしました。\n今月のトップコントリビューターを分析することにしました。まず最初に、下記のリンク先にある投票に参加してみてください。\n月の配布物からu/safelyoptimized [/u/safelyoptimized]を削除するには、以下のリンク先のポールに投票するといいでしょう。\nディストリビューションに参加していない場合は...",
      "title": "最新のMoon配布で、トップ16の貢献者を分析しました。彼らは何のためにMoonを手に入れたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在u/safelyoptimized [/u/safelyoptimized]案例的触发下，我决定\n分析一下这个月的最佳贡献者。首先，你可能想在以下投票中投票\n首先，你可能想在下面的投票中投票，将u/safelyoptimized [/u/safelyoptimized]从Moon\n分发，如果你还没有这么做的话...",
      "title": "我分析了最新月球分布中的前16个贡献者。他们的月球是怎么得来的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在u/safelyoptimized [/u/safelyoptimized]案例的觸發下，我決定\n分析一下這個月的最佳貢獻者。首先，你可能想在以下投票中投票\n首先，你可能想在下面的投票中投票，將u/safelyoptimized [/u/safelyoptimized]從Moon\n分發，如果你還沒有這麼做的話...",
      "title": "我分析了最新月球分佈中的前16個貢獻者。他們的月球是怎麼得來的？"
    }
  ]
}