{
  "author": "throwaway29801A",
  "original_created_utc": 1630429223,
  "title": "Weimar?",
  "created_utc": 1630452607,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a person that sees &quot;worst case&quot;...so I want to know if I&#39;m being paranoid or not. I&#39;m seeing things that make me very, very uncomfortable.</p>\n\n<ol>\n<li>The rapid rise of real estate, especially luxury real estate. In California, it is NOT uncommon to see nice track homes that are 3,000 sq foot going for around 1.8-2 mill. These are not mansions, these are not architecturally significant. These are track homes where engineers, software sales people, and a lot of white collar lives.</li>\n<li>Social unrest-a few of my friends see this, most don&#39;t comment. Have we forgotten the riots? The political scene is turning uglier and uglier...and I think things are becoming more socialist. Being labeled xyz if you don&#39;t agree with a topic. I&#39;m finding myself just not talking anymore...seems conversation doesn&#39;t exist, anger/agree with us does.</li>\n<li>A lot of people making a lot of money-since the pandemic began, I know many people who have gotten raises. These are normal people. I see a lot of people making well over $10,000 a month. I know people saying $2,500 rent is normal.</li>\n<li>Ignoring what&#39;s going on/a tale of two cities. I see this primarily in older (50+) people I know. They live in nice suburbs and their equity is up $500,000. They have no concern for homelessness. It seems it&#39;s not on their radar, or at least they are hiding this. Los Angeles is rapidly reminding me of terminator 2 yet it&#39;s ignored.</li>\n<li>The winners and losers from digitization. I know a lot of college grads who are on the other side of #3-they did what society told them, they went to college. They are between 26-32-they have NO assets. They rent rooms yet they have normal jobs...not rent apartments, they rent rooms. What happens as they get close to 40s?</li>\n</ol>\n\n<p>I don&#39;t want agreement. I want to know-am I being melodramatic? Are things much different than I imagine or is society shifting, fast, and these are actually happening?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/pf9zox/weimar/",
  "subreddit": "Bitcoin",
  "id": "pf9zox",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a person that sees \"worst case\"...so I want to know if I'm being paranoid\nor not. I'm seeing things that make me very, very uncomfortable.\n\n 1. The rapid rise of real estate, especially luxury real estate. In California,\n    it is NOT uncommon to see nice track homes that are 3,000 sq foot…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は \"最悪の事態 \"を想定する人間なので、自分が被害妄想に陥っていないかどうかを知りたいのです。\nかどうかを知りたいのです。私は非常に、非常に不快にさせるものを見ています。\n\n 1. 不動産、特に高級不動産の急上昇。カリフォルニアで。\n    カリフォルニアでは、3,000平方フィートの素敵なトラックハウスを見ることは珍しいことではありません...",
      "title": "ワイマール？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个能看到 \"最坏情况 \"的人......所以我想知道我是否是偏执狂\n或不是。我看到的事情让我非常、非常不舒服。\n\n 1. 房地产的迅速崛起，尤其是豪华房地产。在加州。\n    在加州，看到3000平方英尺的漂亮轨道住宅并不罕见......",
      "title": "魏玛？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個能看到 \"最壞情況 \"的人......所以我想知道我是否是偏執狂\n或不是。我看到的事情讓我非常、非常不舒服。\n\n 1. 房地產的迅速崛起，尤其是豪華房地產。在加州。\n    在加州，看到3000平方英尺的漂亮軌道住宅並不罕見......",
      "title": "魏瑪？"
    }
  ]
}