{
  "author": "Ch1koz",
  "the_new_excerpt": "So as the title states, why is Alibaba so undervalued?\n\nIs it out of fear for Chinese regulation and the risk it carries. I have been\nlooking into their finances and doing my calculations and perhaps I’m missing\nsomething, their cloud computing growth which is looking to be a future gold\nmine, based…",
  "original_created_utc": 1618779242,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では、タイトルにあるように、なぜアリババはこれほどまでに過小評価されているのでしょうか？\n\nそれは、中国の規制とそれに伴うリスクを恐れてのことでしょうか。私はこれまで\n私は彼らの財務を調べて計算してみましたが、もしかしたら何か見逃しているかもしれません。\n彼らのクラウドコンピューティングの成長は将来の金鉱になると思われます。\n根拠は...",
      "title": "なぜアリババはこんなにも割安なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那么正如标题所说，为什么阿里巴巴的价值如此被低估？\n\n是出于对中国监管的恐惧，以及它所带来的风险。我一直\n审视他们的财务状况，做我的计算，也许我漏掉了\n的东西，他们的云计算发展，这在未来看来是一个黄金的\n我的，基于...",
      "title": "为什么阿里巴巴的价值如此被低估？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼正如標題所說，爲什麼阿里巴巴的價值如此被低估？\n\n是出於對中國監管的恐懼，以及它所帶來的風險。我一直\n審視他們的財務狀況，做我的計算，也許我漏掉了\n的東西，他們的雲計算髮展，這在未來看來是一個黃金的\n我的，基於...",
      "title": "爲什麼阿里巴巴的價值如此被低估？"
    }
  ],
  "title": "Why is Alibaba so undervalued?",
  "created_utc": 1618815535,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So as the title states, why is Alibaba so undervalued? </p>\n\n<p>Is it out of fear for Chinese regulation and the risk it carries. I have been looking into their finances and doing my calculations and perhaps I’m missing something, their cloud computing growth which is looking to be a future gold mine, based on current growth it will be their biggest department and also taking into account similar companies like Amazon and Microsoft, it’s obvious it will be their biggest department or one of their biggest departments, even with conservative growth, this is taking into account the fact that they have a massive Chinese market. That’s not taking into account that their current valuation which is already undervalued from their many e-commerce businesses.</p>\n\n<p>So are there other issues at play or is the Chinese regulation the biggest issue?</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/stocks/comments/mtl95o/why_is_alibaba_so_undervalued/",
  "subreddit": "stocks",
  "id": "mtl95o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527429
}