{
  "author": "IndependentPassage52",
  "original_created_utc": 1628666181,
  "title": "That Shelby b*tch is exactly why and how empires fall",
  "created_utc": 1628696757,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>US has lost its production capabilities, now it is starting to lose its innovation talent. All is left is the ability to counterfeit money. Soon it will end up like a Rome. An empty shell tangled with web of stupid laws which prevents everyone from doing anything. Mostly lazy, fat citizenry used to get its checks from the government left with a huge military which sucks the last productive outcome and in the end will turn against its own citizens. Like a clockwork.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/Bitcoin/comments/p282xl/that_shelby_btch_is_exactly_why_and_how_empires/",
  "subreddit": "Bitcoin",
  "id": "p282xl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "US has lost its production capabilities, now it is starting to lose its\ninnovation talent. All is left is the ability to counterfeit money. Soon it will\nend up like a Rome. An empty shell tangled with web of stupid laws which\nprevents everyone from doing anything. Mostly lazy, fat citizenry used to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国は生産能力を失い、今度はイノベーションの才能を失い始めています。\nイノベーションの才能を失い始めています。残っているのは、お金を偽造する能力だけです。もうすぐ、ローマのように\nローマのように終わるでしょう。愚かな法律の網に絡め取られた空っぽの殻で、誰もが何もできない。\n誰もが何もできなくなってしまいます。怠惰で太った市民のほとんどは、かつて...",
      "title": "そのシェルビービッチこそが、まさに帝国が滅びる理由であり、方法なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国已经失去了它的生产能力，现在它开始失去它的\n创新人才。剩下的就是造假币的能力。很快，它将\n就会像罗马一样灭亡。一个被愚蠢的法律之网纠缠着的空壳\n阻止每个人做任何事情。大部分懒惰、肥胖的公民习惯于...",
      "title": "这个谢尔比婊子正是帝国衰落的原因和方式。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國已經失去了它的生產能力，現在它開始失去它的\n創新人才。剩下的就是造假幣的能力。很快，它將\n就會像羅馬一樣滅亡。一個被愚蠢的法律之網糾纏着的空殼\n阻止每個人做任何事情。大部分懶惰、肥胖的公民習慣於...",
      "title": "這個謝爾比婊子正是帝國衰落的原因和方式。"
    }
  ]
}