{
  "author": "Henry2Curtmantle",
  "original_created_utc": 1648833555,
  "title": "I am Henry Curtmantle, King of England, Duke of Normandy and Aquitaine, and Count of Anjou. In light of recent controversies in my reign, I have been advised by the brothers of Canterbury Cathedral to participate in this AMA as part of my penance for the slaying of Archbishop Thomas Becket. AMA?",
  "created_utc": 1648859639,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am Henry, by the grace of God, King of England, Duke of Normandy and Aquitaine, Count of Anjou and Maine. Son of Empress Matilda, and Geoffrey Plantagenet, Count of Anjou. &lt;/p&gt;\n\n&lt;p&gt;In light of my connection with the murder of Archbishop Thomas Becket, my former chancellor and friend, and the recent rebellion of my sons, with the aid of the King of the Franks, I have been advised to allow my subjects this once-in-a-lifetime opportunity to ask me anything. &lt;/p&gt;\n\n&lt;p&gt;At present, my amanuensis is managing the most important business of the realm, and may only be able to answer inquiries as their other duties allow. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/4LSyQiv\"&gt;My proof&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit: My amanuensis is overwhelmed with petitioners at the moment but has seen all of your questions and will be taking my dictation when time allows.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ttw68k/i_am_henry_curtmantle_king_of_england_duke_of/",
  "subreddit": "AskHistorians",
  "id": "ttw68k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am Henry, by the grace of God, King of England, Duke of Normandy and\nAquitaine, Count of Anjou and Maine. Son of Empress Matilda, and Geoffrey\nPlantagenet, Count of Anjou.\n\nIn light of my connection with the murder of Archbishop Thomas Becket, my former\nchancellor and friend, and the recent…"
}