{
  "author": "Henry2Curtmantle",
  "original_created_utc": 1648833555,
  "title": "I am Henry Curtmantle, King of England, Duke of Normandy and Aquitaine, and Count of Anjou. In light of recent controversies in my reign, I have been advised by the brothers of Canterbury Cathedral to participate in this AMA as part of my penance for the slaying of Archbishop Thomas Becket. AMA?",
  "created_utc": 1648859639,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am Henry, by the grace of God, King of England, Duke of Normandy and Aquitaine, Count of Anjou and Maine. Son of Empress Matilda, and Geoffrey Plantagenet, Count of Anjou. &lt;/p&gt;\n\n&lt;p&gt;In light of my connection with the murder of Archbishop Thomas Becket, my former chancellor and friend, and the recent rebellion of my sons, with the aid of the King of the Franks, I have been advised to allow my subjects this once-in-a-lifetime opportunity to ask me anything. &lt;/p&gt;\n\n&lt;p&gt;At present, my amanuensis is managing the most important business of the realm, and may only be able to answer inquiries as their other duties allow. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://imgur.com/4LSyQiv\"&gt;My proof&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit: My amanuensis is overwhelmed with petitioners at the moment but has seen all of your questions and will be taking my dictation when time allows.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ttw68k/i_am_henry_curtmantle_king_of_england_duke_of/",
  "subreddit": "AskHistorians",
  "id": "ttw68k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am Henry, by the grace of God, King of England, Duke of Normandy and\nAquitaine, Count of Anjou and Maine. Son of Empress Matilda, and Geoffrey\nPlantagenet, Count of Anjou.\n\nIn light of my connection with the murder of Archbishop Thomas Becket, my former\nchancellor and friend, and the recent…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はヘンリー、神の恩寵により、イングランド王、ノルマンディー公、そして\nアキテーヌ、アンジュー、メインの各伯爵。女帝マチルダとジェフリーの息子であり\nプランタジネット、アンジュー伯爵。\n\nトーマス・ベケット大司教の殺害に私が関係していることを考慮し、私の前任者である\n宰相であり友人であり最近の...",
      "title": "私はイングランド王、ノルマンディーおよびアキテーヌ公、アンジュー伯のヘンリー・カートマントルである。私の治世における最近の論争を考慮して、カンタベリー大聖堂の兄弟から、大司教トマス・ベケット殺害の懺悔の一環として、このAMAに参加するよう忠告された。AMA？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是亨利，受上帝的恩典，英格兰国王，诺曼底和阿基坦公爵，安茹和缅因伯爵。\n阿基坦，安茹和缅因伯爵。玛蒂尔达皇后和杰弗里的儿子\n普兰塔戈内特，安茹伯爵的儿子。\n\n鉴于我与我的前任大主教托马斯-贝克特的谋杀案有关\n宰相和朋友，以及最近的...",
      "title": "我是亨利-库特曼特尔，英格兰国王，诺曼底和阿基坦公爵，以及安茹伯爵。鉴于最近在我的统治中出现的争议，坎特伯雷大教堂的兄弟们建议我参加这次AMA，作为我对托马斯-贝克特大主教被杀的忏悔的一部分。AMA？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是亨利，受上帝的恩典，英格蘭國王，諾曼底和阿基坦公爵，安茹和緬因伯爵。\n阿基坦，安茹和緬因伯爵。瑪蒂爾達皇后和傑弗裏的兒子\n普蘭塔戈內特，安茹伯爵的兒子。\n\n鑑於我與我的前任大主教托馬斯-貝克特的謀殺案有關\n宰相和朋友，以及最近的...",
      "title": "我是亨利-庫特曼特爾，英格蘭國王，諾曼底和阿基坦公爵，以及安茹伯爵。鑑於最近在我的統治中出現的爭議，坎特伯雷大教堂的兄弟們建議我參加這次AMA，作爲我對托馬斯-貝克特大主教被殺的懺悔的一部分。AMA？"
    }
  ]
}