{
  "author": "MoodSoggy",
  "original_created_utc": 1637444664,
  "title": "Why you should stake? Because of The power of compound interest",
  "created_utc": 1637469043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys,</p>\n\n<p>I&#39;ve recently found out that a lot of ppl do not understand to compound interest, so something like 5% from staking may look like nothing to them. At first - still better than saving accounts in most of countries (in some countries they have negative interest on saving accounts above certain amount, which is ridiculous) and also if you understand to it, than you will also understand how to slowly build wealth:). So let&#39;s look at it...</p>\n\n<p><strong>What is Compound interest?</strong></p>\n\n<p>Simply said - it&#39;s interest on interest. Basically when you put some money to saving account, you get some APY (appreciation per year) and after certain amount of time (usually a month), you get back your money + something extra. Simple, right? And if you take that sum of money INCLUDING money you gained last time, put it again to that saving account with same APY you will get more, because you are now saving your initial investment + money you&#39;ve gained during first time. That&#39;s all...and it&#39;s an amazing snowball effect, because this interest is slowly getting bigger and bigger. Let&#39;s have a look at numbers.</p>\n\n<p>This is a &quot;basic example&quot; - you are putting ito your savings 100 dollars every month and APY 5%, so 1 200 a year, every year. As you can see on table bellow, after 15 years you will have enough, to start withdrawing 100 bucks every month FOR THE REST OF YOUR LIFE, because you will already have there enough, to generate you passive income of almost 1 300 dollars per year. I know, it takes years, but it´s not that much and actually when you think about it...because you were saving these 100 bucks every month, you got used to it, so now, when you will start withdrawing 100 every month and stop saving another 100, that means you have extra 200 bucks every month:) (as long as you are still working...)</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/e8lykbxplt081.png?width=368&amp;format=png&amp;auto=webp&amp;s=9b4bdaab95d1f3e4c17bde3c92ba8454cf981849\">https://preview.redd.it/e8lykbxplt081.png?width=368&amp;format=png&amp;auto=webp&amp;s=9b4bdaab95d1f3e4c17bde3c92ba8454cf981849</a></p>\n\n<p>Hope you get it a bit. Now let´s have a look at average APY 10%, which is more less average return of stock index S&amp;P 500. As you can see, you are already at the same point in something like 7,5 years.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/v20scs0rlt081.png?width=340&amp;format=png&amp;auto=webp&amp;s=caf0ab4d759bcd0be6bab2cebecf19f75b80bf8d\">https://preview.redd.it/v20scs0rlt081.png?width=340&amp;format=png&amp;auto=webp&amp;s=caf0ab4d759bcd0be6bab2cebecf19f75b80bf8d</a></p>\n\n<p>And now to put it into crypto perspective, which is a main point of this post. We have staking rewards, which in some cases does not look like a lot (mainly when we consider these regular moonshots). Initially I´ve wanted to make a table with number of coins instead of value, but there is a catch - since markets are moving so fast, it´s almost impossible to predict price movements, so I´ve just left it in FIAT and did not even counted in price growth (which, as we know, is a huuuge factor). So consider for a while that crypto markets are frozen for next 10 years and that you are just staking with APY from specific projects. I would say it´s pretty impressive:). You won´t be a milionaire over night, but still you can make quite a bit along the way and the most important thing - It´s passive income, so you´ve made it while you were sitting on couch and shitposting on Reddit:).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/mcvw2hnslt081.png?width=1063&amp;format=png&amp;auto=webp&amp;s=e0efde463fe410cdacf9ff7d6deb41e00518d456\">https://preview.redd.it/mcvw2hnslt081.png?width=1063&amp;format=png&amp;auto=webp&amp;s=e0efde463fe410cdacf9ff7d6deb41e00518d456</a></p>\n\n<p><strong>Conclusion:</strong></p>\n\n<p>Hope it does not offend anyone, but since I found recently, that most of young guys around don´t know a thing about this (we recently hired two young guys to work at our construction site and I was quite amazed that they don´t know basic things like this...but they are both throwing money into Doge since it reached top, full of hopium that it will one day reach 1000 bucks (already explained them, that it won´t happen:D ). It´s just a snowball effect - more you have, more you earn. That´s it...simple as that and if you want to build real wealth, you just have to work on your passive income:).</p>\n\n<p>&#x200B;</p>\n\n<p>P.S.: <em>This is a repost. I wrote this post some time ago, but since there was quite a few posts related to staking, I&#39;ve thought it might be a good idea to repost it just to show, that staking has a sense:).</em></p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/qyfkgu/why_you_should_stake_because_of_the_power_of/",
  "subreddit": "CryptoCurrency",
  "id": "qyfkgu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys,\n\nI've recently found out that a lot of ppl do not understand to compound\ninterest, so something like 5% from staking may look like nothing to them. At\nfirst - still better than saving accounts in most of countries (in some\ncountries they have negative interest on saving accounts above…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は最近、多くの人々が複利を理解していないことを知りました。\nなので、5%の賭け金は彼らにとって何でもないことのように見えるかもしれません。まず\n最初のうちは、ほとんどの国の貯蓄口座よりも優れています（いくつかの国では\nいくつかの国では、普通預金にマイナスの利子がついていますが...。",
      "title": "なぜ賭けなければならないのか？なぜなら、複利の力"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们。\n\n我最近发现，很多人都不了解复利。\n利息，所以像5%这样的赌注对他们来说可能看起来没什么。在\n乍一看--还是比大多数国家的储蓄账户要好（在一些国家\n在一些国家，储蓄账户的利息为负数......",
      "title": "你为什么要入股？因为复利的力量"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們。\n\n我最近發現，很多人都不瞭解複利。\n利息，所以像5%這樣的賭注對他們來說可能看起來沒什麼。在\n乍一看--還是比大多數國家的儲蓄賬戶要好（在一些國家\n在一些國家，儲蓄賬戶的利息爲負數......",
      "title": "你爲什麼要入股？因爲複利的力量"
    }
  ]
}