{
  "author": "nannerooni",
  "original_created_utc": 1653416852,
  "title": "Mom doubled her salary by getting a new job and her old boss is losing his mind",
  "created_utc": 1653461007,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My mom has worked for a small construction company for like 10 years and hasn’t gotten any raise other than the occasional large bonus. She asked and her boss said no even though he’s personally filthy rich and she keeps the company afloat.&lt;/p&gt;\n\n&lt;p&gt;She just applied to a larger construction company and with her amazing experience, even though she lacked the educational prerequisites, she blew through all 3 interviews and already has a job offer within a couple weeks of beginning her search.&lt;/p&gt;\n\n&lt;p&gt;The new company offered her much more than she even asked for: twice her current salary. 50k to 100k in two weeks. Including great benefits.&lt;/p&gt;\n\n&lt;p&gt;She broke the news to her old boss and he started acting so desperate, panicked, and crazy that it emotionally disturbed her. He tried to make her a bunch of offers and promises she knew he wouldn’t keep. &lt;/p&gt;\n\n&lt;p&gt;He offered to pay her more than the new company offered her. He point blank told her “I haven’t been paying you the value you are worth to me.” &lt;/p&gt;\n\n&lt;p&gt;What a fuckin slap in the face. I’m so glad she’s leaving and said no to old boy’s offer. After all these years of loyalty and struggling financially as a single mom right in front of him he admits he was doing it on purpose. Fuck him. Small businesses don’t automatically equal better businesses, folks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 75219,
  "permalink": "/r/antiwork/comments/uwxhvl/mom_doubled_her_salary_by_getting_a_new_job_and/",
  "subreddit": "antiwork",
  "id": "uwxhvl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My mom has worked for a small construction company for like 10 years and hasn’t\ngotten any raise other than the occasional large bonus. She asked and her boss\nsaid no even though he’s personally filthy rich and she keeps the company\nafloat.\n\nShe just applied to a larger construction company and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の母は小さな建設会社で10年ほど働いていますが、たまに大きなボーナスが出る以外、昇給したことがありません。\nたまに大きなボーナスが出るくらいで、昇給はありません。彼女が尋ねたところ、上司は\n上司は個人的に大金持ちで、母が会社を支えているにもかかわらず、ノーと言った。\nを支えているのに。\n\n彼女はより大きな建設会社に応募したところ...",
      "title": "母さんは転職して給料が倍になったのに、昔の上司は気が狂っている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我妈妈在一家小型建筑公司工作了大约10年，除了偶尔的大额奖金外，没有得到任何加薪。\n除了偶尔的大额奖金外，没有得到任何加薪。她问，她的老板\n她问，她的老板说没有，尽管他个人非常富有，而她却在维持公司的正常运转。\n她问，她的老板说没有，尽管他个人非常富有，而她却在维持公司的正常运转。\n\n她刚刚申请了一家较大的建筑公司，并...",
      "title": "妈妈找了份新工作，工资翻了一番，而她的旧老板却失去了理智"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我媽媽在一家小型建築公司工作了大約10年，除了偶爾的大額獎金外，沒有得到任何加薪。\n除了偶爾的大額獎金外，沒有得到任何加薪。她問，她的老闆\n她問，她的老闆說沒有，儘管他個人非常富有，而她卻在維持公司的正常運轉。\n她問，她的老闆說沒有，儘管他個人非常富有，而她卻在維持公司的正常運轉。\n\n她剛剛申請了一家較大的建築公司，並...",
      "title": "媽媽找了份新工作，工資翻了一番，而她的舊老闆卻失去了理智"
    }
  ]
}