{
  "author": "nannerooni",
  "original_created_utc": 1653416852,
  "title": "Mom doubled her salary by getting a new job and her old boss is losing his mind",
  "created_utc": 1653461007,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My mom has worked for a small construction company for like 10 years and hasn’t gotten any raise other than the occasional large bonus. She asked and her boss said no even though he’s personally filthy rich and she keeps the company afloat.&lt;/p&gt;\n\n&lt;p&gt;She just applied to a larger construction company and with her amazing experience, even though she lacked the educational prerequisites, she blew through all 3 interviews and already has a job offer within a couple weeks of beginning her search.&lt;/p&gt;\n\n&lt;p&gt;The new company offered her much more than she even asked for: twice her current salary. 50k to 100k in two weeks. Including great benefits.&lt;/p&gt;\n\n&lt;p&gt;She broke the news to her old boss and he started acting so desperate, panicked, and crazy that it emotionally disturbed her. He tried to make her a bunch of offers and promises she knew he wouldn’t keep. &lt;/p&gt;\n\n&lt;p&gt;He offered to pay her more than the new company offered her. He point blank told her “I haven’t been paying you the value you are worth to me.” &lt;/p&gt;\n\n&lt;p&gt;What a fuckin slap in the face. I’m so glad she’s leaving and said no to old boy’s offer. After all these years of loyalty and struggling financially as a single mom right in front of him he admits he was doing it on purpose. Fuck him. Small businesses don’t automatically equal better businesses, folks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 75219,
  "permalink": "/r/antiwork/comments/uwxhvl/mom_doubled_her_salary_by_getting_a_new_job_and/",
  "subreddit": "antiwork",
  "id": "uwxhvl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My mom has worked for a small construction company for like 10 years and hasn’t\ngotten any raise other than the occasional large bonus. She asked and her boss\nsaid no even though he’s personally filthy rich and she keeps the company\nafloat.\n\nShe just applied to a larger construction company and…"
}