{
  "author": "Lingweenie2",
  "the_new_excerpt": "I own stock in these major players so maybe I’m partly biased, but I genuinely\nthink this area has been beaten down too much and has a lot of upside no one\nseems to really talk about.\n\nThe companies/stocks i’m getting at are the tobacco giants. I own stock in the\nfour major tobacco companies. And…",
  "original_created_utc": 1614190497,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我拥有这些大公司的股票，所以也许我有部分偏见，但我真正的。\n认为这个地区已经被打得太惨了，有很多上升的空间，但没有人知道\n似乎真的在谈论。\n\n我说的公司/股票是烟草巨头。我拥有的股票在\n四大烟草公司。还有...",
      "title": "最近似乎没有人谈论的好行业/股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我擁有這些大公司的股票，所以也許我有部分偏見，但我真正的。\n認爲這個地區已經被打得太慘了，有很多上升的空間，但沒有人知道\n似乎真的在談論。\n\n我說的公司/股票是菸草巨頭。我擁有的股票在\n四大煙草公司。還有...",
      "title": "最近似乎沒有人談論的好行業/股票。"
    }
  ],
  "title": "Good sector/stocks no one seems to talk about lately.",
  "created_utc": 1614273632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I own stock in these major players so maybe I’m partly biased, but I genuinely think this area has been beaten down too much and has a lot of upside no one seems to really talk about. </p>\n\n<p>The companies/stocks i’m getting at are the tobacco giants. I own stock in the four major tobacco companies. And have for quite some time now. Low valuations and humongous dividends? What more could you ask for? </p>\n\n<p>These companies don’t get much love simply because they’re regarded as “sin stocks” which is fair I suppose, but there seems to be opportunity. </p>\n\n<p>Despite that, a lot of people are bracing for cannabis reforms which will unlock a new market. At least further advance it. No one really talks about the effect it will have on tobacco companies. This would drive their growth incredibly. You’d have to imagine if cannabis became legal in the US and available for retail sale, these guys would dive in head first. They have cash and infrastructure already at their disposal. Most, if not all, already have part ownership or at least partnerships going on. </p>\n\n<p>I think cannabis companies are great potential investments themselves, but no one points out tobacco companies much. It seems like they’ll be some of the biggest beneficiaries of policies like that. And less risky at that.</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/investing/comments/lrjfzx/good_sectorstocks_no_one_seems_to_talk_about/",
  "subreddit": "investing",
  "id": "lrjfzx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937739417
}