{
  "author": "mrjohnmay",
  "original_created_utc": 1625151686,
  "title": "Do countries outside the US have \"new-age names\" that make people groan?",
  "created_utc": 1625165068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With apologies to anyone named Braxtyn, Brinley, Aidyn, Brentlee, Kaydence, etc. there are names in the US where people go &quot;You named your child what?  How is that spelled?  Huh.&quot;</p>\n\n<p>Usually they have too many Y&#39;s or X&#39;s, or are some weird spelling of a different word.  I recognize that this is likely more an English-language thing than a US thing.</p>\n\n<p>Does that happen in other countries?  Other languages?</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/NoStupidQuestions/comments/obnnlc/do_countries_outside_the_us_have_newage_names/",
  "subreddit": "NoStupidQuestions",
  "id": "obnnlc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "With apologies to anyone named Braxtyn, Brinley, Aidyn, Brentlee, Kaydence, etc.\nthere are names in the US where people go \"You named your child what? How is\nthat spelled? Huh.\"\n\nUsually they have too many Y's or X's, or are some weird spelling of a different\nword. I recognize that this is likely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Braxtyn、Brinley、Aidyn、Brentlee、Kaydenceなどの名前の方には申し訳ないのですが。\nアメリカでは、「自分の子供に何て名前をつけたんだ」と言われるような名前があります。どうやってつけたの？\n綴りは？と言われる名前があります。\n\nたいていはYやXが多すぎたり、別の単語の奇妙な綴りだったりします。\nと言われます。私は、このようなことがありそうだと認識しています...。",
      "title": "アメリカ以外の国にも、人々を唸らせる「新時代の名前」があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在此向任何名叫Braxtyn、Brinley、Aidyn、Brentlee、Kaydence等的人表示歉意。\n在美国，有些名字会让人觉得 \"你给你的孩子取了什么名字？那是怎么\n怎么拼的？嗯。\"\n\n通常他们有太多的Y或X，或者是一些不同的单词的奇怪拼写。\n字。我认识到，这很可能是...",
      "title": "美国以外的国家是否有让人吐槽的 \"新时代名字\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在此向任何名叫Braxtyn、Brinley、Aidyn、Brentlee、Kaydence等的人表示歉意。\n在美國，有些名字會讓人覺得 \"你給你的孩子取了什麼名字？那是怎麼\n怎麼拼的？嗯。\"\n\n通常他們有太多的Y或X，或者是一些不同的單詞的奇怪拼寫。\n字。我認識到，這很可能是...",
      "title": "美國以外的國家是否有讓人吐槽的 \"新時代名字\"？"
    }
  ]
}