{
  "author": "ssjx7squall",
  "original_created_utc": 1656468709,
  "title": "What steps should a person take if they find themselves in a country slowly going the way of Nazi Germany.",
  "created_utc": 1656496763,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This person is a member of a historically oppressed group and their government is showing signs of beginning to oppress this group (more than they currently are). &lt;/p&gt;\n\n&lt;p&gt;Also assume they live in a first world country. I feel like the obvious answer of “just leave” doesn’t work because no one really has money to just get up and leave a country. Even if that were possible in the long run what would be actionable steps people could take? &lt;/p&gt;\n\n&lt;p&gt;What are the nearing warning signs that it’s time to leave no matter how much money one has? &lt;/p&gt;\n\n&lt;p&gt;The first world country aspect is an important addition because when things like this have happened in the past extreme poverty (like in Germany and other places) seems to have been the norm.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/vn49ce/what_steps_should_a_person_take_if_they_find/",
  "subreddit": "TrueAskReddit",
  "id": "vn49ce",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This person is a member of a historically oppressed group and their government\nis showing signs of beginning to oppress this group (more than they currently\nare).\n\nAlso assume they live in a first world country. I feel like the obvious answer\nof “just leave” doesn’t work because no one really has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この人は、歴史的に抑圧された集団の一員であり、その政府は\nは、このグループを（現在以上に）抑圧し始める兆しを見せている。\nを抑圧し始める兆しを見せている。）\n\nまた、彼らが第一世界の国に住んでいると仮定します。私は、「ただ去ればいい」という明白な答えのような気がします。\nというのは、誰も本当にそうしていないからです。",
      "title": "ナチス・ドイツのようにゆっくりとした道を歩んでいる国にいることを知ったとき、人はどのような行動をとるべきだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个人是历史上受压迫群体的成员，而他们的政府\n显示出开始压迫这个群体的迹象（比他们现在更多\n更多）。\n\n同时假设他们生活在一个第一世界国家。我觉得明显的答案是\n我觉得 \"离开 \"这个明显的答案并不奏效，因为没有人真正...",
      "title": "如果一个人发现自己所在的国家正在慢慢走向纳粹德国的道路，他应该采取什么措施。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個人是歷史上受壓迫羣體的成員，而他們的政府\n顯示出開始壓迫這個羣體的跡象（比他們現在更多\n更多）。\n\n同時假設他們生活在一個第一世界國家。我覺得明顯的答案是\n我覺得 \"離開 \"這個明顯的答案並不奏效，因爲沒有人真正...",
      "title": "如果一個人發現自己所在的國家正在慢慢走向納粹德國的道路，他應該採取什麼措施。"
    }
  ]
}