{
  "author": "ShibaZmilez",
  "original_created_utc": 1628408741,
  "title": "Yesterday i got a call from the Bank",
  "created_utc": 1628440535,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So on friday  as per usual i went to work drank my coffe and got on my laptop, then my bank called me up.And told me they had frozen my bank account, since i have been buying to many concert tickets?</p>\n\n<p>At first i was like oh my god who is buying concert tickets that&#39;s not me?! They procceded to tell me yes its this CRO, a german rapper, who dont know. </p>\n\n<p>So to not make the story to long i use Crypto.com exchange to buy my crypto and it shows up as CRO in my bank account, last month i put in more than the usual ammount. And the bank lady thought i was crazy, for buying crypto funny enough. </p>\n\n<p>Edit: My mom works at the bank and her colleague was just concerned for me, its just meant as a funny story, my bank only meant it good! </p>\n\n<p>Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/p0aicl/yesterday_i_got_a_call_from_the_bank/",
  "subreddit": "CryptoCurrency",
  "id": "p0aicl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So on friday as per usual i went to work drank my coffe and got on my laptop,\nthen my bank called me up.And told me they had frozen my bank account, since i\nhave been buying to many concert tickets?\n\nAt first i was like oh my god who is buying concert tickets that's not me?! They\nprocceded to tell…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "金曜日、いつものように会社に行き、コーヒーを飲み、ノートパソコンを立ち上げた。\nすると銀行から電話がかかってきて、銀行口座を凍結したと言われた。\nコンサートのチケットを買いすぎたからだそうです。\n\n最初は、コンサートチケットを買っているのは誰なのか、私じゃないのかと思ったよ。彼らは\n続いて...",
      "title": "昨日、銀行から電話がありました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "星期五，我像往常一样去上班，喝了咖啡，打开了我的笔记本电脑。\n然后我的银行打电话给我，告诉我他们已经冻结了我的银行账户，因为我一直在给人买东西。\n因为我买了太多的音乐会门票？\n\n一开始我想，哦，我的上帝，谁在买音乐会门票，而不是我？他们\n他们接着告诉我...",
      "title": "昨天我接到银行的电话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "星期五，我像往常一樣去上班，喝了咖啡，打開了我的筆記本電腦。\n然後我的銀行打電話給我，告訴我他們已經凍結了我的銀行賬戶，因爲我一直在給人買東西。\n因爲我買了太多的音樂會門票？\n\n一開始我想，哦，我的上帝，誰在買音樂會門票，而不是我？他們\n他們接着告訴我...",
      "title": "昨天我接到銀行的電話"
    }
  ]
}