{
  "author": "xcryptogurux",
  "original_created_utc": 1627211023,
  "title": "Answered: If the goal of Bitcoin is to replace fiat money, but Bitcoin is expected to increase in value in the long term, wouldn't it be prohibitive to use Bitcoin for paying for things?",
  "created_utc": 1627227037,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This question was posted in <a href=\"/r/bitcoin\">r/bitcoin</a> by <a href=\"/u/madferret96\">u/madferret96</a>.</p>\n\n<p>I&#39;d like to answer the question here since this is a fairly common and important subject of discussion. How can a good SoV also be a good MoE and UoA? Seems too perfect, right?</p>\n\n<p><a href=\"/u/madferret96\">u/madferret96</a>&#39;s perspective comes from measuring value in a depreciating asset, dollars. This is relative, not inherent, value, while Bitcoin is still in the process of discovering its true value to humanity as a means of democratically creating, distributing and exchanging money/wealth.</p>\n\n<p>When you purchase goods and services now, the question you ask yourself is whether what you&#39;re purchasing is more valuable to you than the dollars you have in hand. Everything being denominated in dollars/fiat lends this the perspective of dollar just represents money which can buy me things I need in life.</p>\n\n<p>When we get to a place where sats replace cents as UoA (unit-of-account), it would be a question of whether the good/service you&#39;re purchasing is worth more to you than the sats you have in your wallet.</p>\n\n<p>Further, the UoA on Lightning Network is not sats but millisats, 1/1000th of a sat. Mill is 1/1000th of a dollar and the unit-of-account in dollar-denominated accounting.</p>\n\n<p>1 Bitcoin = 100 million sats</p>\n\n<p>21 million Bitcoin = 2.1 quadrillion sats = 2.1 quintillion millisats</p>\n\n<p>Infinite divisibility, but not infinite supply, is an important property of money. The best scarce money in history, gold, does not have this property. Bitcoin does.</p>\n\n<p>What a Bitcoin Standard would do is immediately eliminate the moral hazards that inhere within a monetary paradigm predicated on arbitrary, whimsical, unscrupulous and flagrantly unmoderated expansionary policies founded upon nothing more than the existence of a lender of last resort with access to an infinite supply of money created without any effort out of thin air to bail out those at the top of the pyramid. It would restore rigor and sustainability to credit lines without frequent intervention at the cost of rampant inflation, and cultivate better spending habits.</p>\n\n<p>The current system of credit constantly incentivizes, or even forces you to keep spending money from tomorrow&#39;s labor, but then the new injection of money from your tomorrow&#39;s labor ends up being concentrated at the top, with the ultimate consequence of inequitably destroying your own purchasing power and continually enriching those at the top of the pyramid.</p>\n\n<p>In short, the money you borrow ends up destroying your purchasing power while the lender profits from your future labor.</p>\n\n<p>This system is &quot;sustainable&quot; for a reasonably long period of time, until hyperinflation becomes untenable, only because it enables infinite, unmoderated expansion of the money supply. Fiat monetary systems have never in history survived beyond a few generations.</p>\n\n<p><a href=\"https://preview.redd.it/3node7rw9cd71.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=22c9ef9cdf119cbb4ebe1bf972a516d5ad353901\">We&#39;ve had 3800 fiat currencies in history. They&#39;ve all failed</a></p>\n\n<p><em>“I am a most unhappy man. I have unwittingly ruined my country. A great industrial nation is controlled by its system of credit. Our system of credit is concentrated. The growth of the nation, therefore, and all our activities are in the hands of a few men. We have come to be one of the worst ruled, one of the most completely controlled and dominated governments in the civilized world. No longer a government by free opinion, no longer a government by conviction and the vote of the majority, but a government by the opinion and duress of a small group of dominant men.</em>” - Woodrow Wilson in 1919, in reference to the Federal Reserve act of 1913, which he signed into law.</p>\n\n<p><a href=\"https://preview.redd.it/q9ysh8vm5cd71.jpg?width=4800&amp;format=pjpg&amp;auto=webp&amp;s=e590f673a21ba1ca628a10af6e6e55f4f805461f\">Anatomy of a 100-year pyramid scheme</a></p>\n\n<p>I view Bitcoin to be the culmination of humanity&#39;s 7000-year quest to perfect the representation of value by democratizing its creation, distribution and exchange. There has never been a money in history with all the necessary properties of money. All previous forms of money had compromises.</p>\n\n<p>Scarce money has always been sound money but previous iterations of scarce money lacked the other properties required for a viable MoE and UoA - fungible, readily portable, infinitely divisible, incorruptible, indestructible, provably finite and objectively verifiable.</p>\n\n<p>Bitcoin ticks all the boxes.</p>\n\n<p><a href=\"https://preview.redd.it/gcx60eljbcd71.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=fbd940f4a0c8b07ca752e72ed41b95e8bb075926\">Sound money fulfills all three functions of money - SoV, MoE, UoA</a></p>\n</div><!-- SC_ON -->",
  "score": 237,
  "permalink": "/r/CryptoCurrency/comments/or9lqu/answered_if_the_goal_of_bitcoin_is_to_replace/",
  "subreddit": "CryptoCurrency",
  "id": "or9lqu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This question was posted in r/bitcoin [/r/bitcoin] by u/madferret96\n[/u/madferret96].\n\nI'd like to answer the question here since this is a fairly common and important\nsubject of discussion. How can a good SoV also be a good MoE and UoA? Seems too\nperfect, right?\n\nu/madferret96 [/u/madferret96]'s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、u/madferret96がr/bitcoin[/r/bitcoin]に投稿したものです。\n[/u/madferret96]です。\n\nこの質問はかなり一般的で重要なものなので、ここでお答えしたいと思います。\n議論されています。良いSoVが良いMoEとUoAにもなるには？あまりにも完璧に思えます。\n完璧すぎると思いませんか？\n\nu/madferret96 [/u/madferret96]さんの...",
      "title": "回答済みです。ビットコインの目的が不換紙幣に取って代わることであっても、長期的にはビットコインの価値が上がることが予想されるのであれば、ビットコインを物の支払いに使うことは禁止されているのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题是由u/madferret96发布在r/bitcoin [/r/bitcoin]的。\n[/u/madferret96].\n\n我想在这里回答这个问题，因为这是一个相当普遍和重要的\n讨论的主题。一个好的SoV怎么可能同时是一个好的MoE和UoA？看上去太\n完美，对吗？\n\nu/madferret96 [/u/madferret96]的...",
      "title": "已回答。如果比特币的目标是取代法定货币，但从长远来看，比特币有望升值，那么用比特币来支付东西岂不是让人望而却步？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題是由u/madferret96發佈在r/bitcoin [/r/bitcoin]的。\n[/u/madferret96].\n\n我想在這裏回答這個問題，因爲這是一個相當普遍和重要的\n討論的主題。一個好的SoV怎麼可能同時是一個好的MoE和UoA？看上去太\n完美，對嗎？\n\nu/madferret96 [/u/madferret96]的...",
      "title": "已回答。如果比特幣的目標是取代法定貨幣，但從長遠來看，比特幣有望升值，那麼用比特幣來支付東西豈不是讓人望而卻步？"
    }
  ]
}