{
  "author": "Cynicusme",
  "original_created_utc": 1636779527,
  "title": "My 5-year getting paid for doing nothing is over. I'm heartbroken.",
  "created_utc": 1636827122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got a night-shift job doing data entry back in 2015. I quit and needed something fast at night while I look for something better during the day. </p>\n\n<p>It was a data entry position, meaning I get an email containing the details of an order and proceeding to input the information into our system. </p>\n\n<p>Right after my training I knew this is something Autohotkey can do, I don&#39;t know to code that well, so I went to a freelancer website to hire a guy to develop the code, it cost me a two-month salary....</p>\n\n<p>I just had to input how many orders I want to process per hour, since day 1 I was working from home because the company did not want to pay for transport or cleaning during the graveyard shift. </p>\n\n<p>For the first 2 years, I would check if there was something the code cannot do (usually took me less than 5 minutes) and then I would let the computer running and watch movies, go to bed, sometimes I&#39;d even go out. Then I added those functions to the code as well. </p>\n\n<p>I was doing such a remarkable job I was offered promotions a few times, new positions during the daytime that I&#39;d reject stating I&#39;m a very introverted person that enjoys this type of position.  </p>\n\n<p>Eventually, I got another job, better paid, but there was no reason for me to quit where I was working. For my data entry job, I could spend months without having anybody reach out to me. </p>\n\n<p>Sometimes some co-workers will try to match my order entry quota, which would make me open the code, and change an 8 to 9 to increase my production and keep myself on top. I&#39;d change the numbers regularly &quot;just in case&quot; but nobody even noticed. </p>\n\n<p>I even got 2 salary raises at some point for never missing a day, and being the top producer in my 3 people department, to which I corresponded by changing the 9 and switching it to an 11 or 10 on some days. </p>\n\n<p>My end. </p>\n\n<p>It took them 4 years to develop new software that will replace my data entry position. Since clients were granted access to our new system. A few weeks ago I got my severance check, I was told I could keep the laptop and office equipment and that I&#39;m welcome to apply for any position I want.</p>\n\n<p>I never talked about that with anybody IRL, not even my family, even my wife wasn&#39;t sure what my job was about with that other company. </p>\n\n<p>Now that it is over. There you go, my darkest work secret.</p>\n\n<p>I did try to schedule a demonstration of &quot;my code&quot;, I think that was back in 2017. The regional manager told me they&#39;re very busy dealing with the important stuff, just to keep doing the good work I was doing.... which I fucking did until the day I was let go.</p>\n</div><!-- SC_ON -->",
  "score": 76370,
  "permalink": "/r/antiwork/comments/qstsdp/my_5year_getting_paid_for_doing_nothing_is_over/",
  "subreddit": "antiwork",
  "id": "qstsdp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I got a night-shift job doing data entry back in 2015. I quit and needed\nsomething fast at night while I look for something better during the day.\n\nIt was a data entry position, meaning I get an email containing the details of\nan order and proceeding to input the information into our system.\n\nRight…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2015年にデータ入力の夜勤の仕事に就きました。辞めてしまったので\n辞めてしまったので、昼間に何か良いものを探している間に、夜に何か早いものを\n\nデータ入力の仕事は、注文の詳細が記載されたメールを受け取り、その情報をシステムに入力するというものでした。\n注文の詳細が記載されたメールを受け取り、その情報をシステムに入力していくというものでした。\n\nそうですね...。",
      "title": "何もしないでお金をもらう5年間が終わりました。心が折れそうです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早在2015年，我就找到了一份夜班工作，做数据输入。我辞职了，需要\n我需要在白天寻找更好的工作时，在晚上做些快速的工作。\n\n那是一个数据输入的职位，意思是我收到一封电子邮件，里面有一个订单的细节。\n意思是我收到一封包含订单细节的电子邮件，然后将信息输入到我们的系统中。\n\n对...",
      "title": "我5年来因无所事事而得到的报酬已经结束。我心碎了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2015年，我就找到了一份夜班工作，做數據輸入。我辭職了，需要\n我需要在白天尋找更好的工作時，在晚上做些快速的工作。\n\n那是一個數據輸入的職位，意思是我收到一封電子郵件，裏面有一個訂單的細節。\n意思是我收到一封包含訂單細節的電子郵件，然後將信息輸入到我們的系統中。\n\n對...",
      "title": "我5年來因無所事事而得到的報酬已經結束。我心碎了。"
    }
  ]
}