{
  "author": "ExcellentNoThankYou",
  "the_new_excerpt": "Robinhood Markets Inc., the trading platform behind the boom-and-bust swing in\nGameStop Corp.’s shares, plans to file confidentially for an initial public\noffering as soon as March, according to people familiar with the matter.\n\nThe company has held talks in the past week with underwriters about…",
  "original_created_utc": 1614403181,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Robinhood Markets Inc.\nGameStop公司的股票，计划秘密申请首次公开发行。\n据知情人士透露，最快将于3月发行。\n\n该公司在过去一周与承销商举行了有关...",
      "title": "Robinhood计划最快3月秘密提交IPO申请。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Robinhood Markets Inc.\nGameStop公司的股票，計劃祕密申請首次公開發行。\n據知情人士透露，最快將於3月發行。\n\n該公司在過去一週與承銷商舉行了有關...",
      "title": "Robinhood計劃最快3月祕密提交IPO申請。"
    }
  ],
  "title": "Robinhood to plan confidential IPO filing as soon as March",
  "created_utc": 1614436431,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Robinhood Markets Inc., the trading platform behind the boom-and-bust swing in GameStop Corp.’s shares, plans to file confidentially for an initial public offering as soon as March, according to people familiar with the matter.</p>\n\n<p>The company has held talks in the past week with underwriters about moving forward with a filing within weeks, said the people, who asked to not be identified because the matter isn’t public. No final decision has been made and the timing could change, the people said.</p>\n\n<p>A representative for Robinhood, based in Menlo Park, California, declined to comment.</p>\n\n<p>Robinhood exploded in popularity during the pandemic as homebound young people turned to its trading app to make money and pass the time. The company, which has been targeting a 2021 IPO since at least last year, faced a cash crunch when it ran into regulatory trouble three weeks ago.</p>\n\n<p>Robinhood had to draw down its credit lines and raise $3.4 billion from its backers to post more collateral with the Depository Trust &amp; Clearing Corp., the industry’s clearinghouse. The DTCC wanted members to post more cash to ensure they could clear trades, given wild swings in stocks including video game retailer GameStop and movie theater chain AMC Entertainment Holdings Inc.</p>\n\n<p>Robinhood is also facing political and customer backlash because it temporarily curbed trading in GameStop and movie theater chain AMC Entertainment Holdings Inc.</p>\n\n<p>Robinhood is also facing political and customer backlash because it temporarily curbed trading in GameStop and other stocks.</p>\n\n<p>Robinhood was valued at $11.7 billion in a funding round last year. That company has been considering selling some of its shares in its IPO directly to its own users, Bloomberg News reported. Such a move would be striking because retail investors usually don’t get to buy into new listings at the offering price. Instead, they typically have to invest on the first day of trading in a rush that can drive up the stock price.</p>\n\n<p><a href=\"https://economictimes.indiatimes.com/markets/ipos/fpos/robinhood-to-plan-confidential-ipo-filing-as-soon-as-march/articleshow/81239789.cms\">https://economictimes.indiatimes.com/markets/ipos/fpos/robinhood-to-plan-confidential-ipo-filing-as-soon-as-march/articleshow/81239789.cms</a></p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/lth29r/robinhood_to_plan_confidential_ipo_filing_as_soon/",
  "subreddit": "stocks",
  "id": "lth29r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742118
}