{
  "author": "Tucuxi995",
  "the_new_excerpt": "I was looking at the the list of the public companies with the highest market\ncaps, and was really surprised to see that Home Depot is the 22nd most valuable\ncompany in the world right now. It's bigger than Target, Goldman Sachs, BP, and\nHP combined at a value of over 1/3 of a trillion USD. I…",
  "original_created_utc": 1619576741,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時価総額の高い上場企業のリストを見ていて、ホームデポが22位であることにとても驚きました。\nホームデポが世界で22番目に価値のある企業であることを知って、とても驚きました。\nホームデポは世界で22番目に価値のある企業です。これは、ターゲット、ゴールドマン・サックス、BP、その他の企業よりも大きいのです。\nHPよりも大きく、その価値は1/3兆ドルを超えています。I...",
      "title": "なぜホームデポが評価されているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在看市值最高的上市公司名单。\n我在看市值最高的上市公司名单时，非常惊讶地看到家得宝是目前世界上第22个最有价值的\n的公司。它比目标公司、高盛、英国石油公司和\n惠普的总和，价值超过1/3万亿美元。I...",
      "title": "为什么家得宝公司受到如此高的重视？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在看市值最高的上市公司名單。\n我在看市值最高的上市公司名單時，非常驚訝地看到家得寶是目前世界上第22個最有價值的\n的公司。它比目標公司、高盛、英國石油公司和\n惠普的總和，價值超過1/3萬億美元。I...",
      "title": "爲什麼家得寶公司受到如此高的重視？"
    }
  ],
  "title": "Why is Home Depot so highly valued?",
  "created_utc": 1619620058,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was looking at the the list of the public companies with the highest market caps, and was really surprised to see that Home Depot is the 22nd most valuable company in the world right now. It&#39;s bigger than Target, Goldman Sachs, BP, and HP combined at a value of over 1/3 of a trillion USD. I suppose they&#39;re doing good business but that good? I guess really only think of them as the retail chain - is that only a small part of their business model? What explains their market cap? Or are they just overvalued</p>\n</div><!-- SC_ON -->",
  "score": 62,
  "permalink": "/r/stocks/comments/n04s7y/why_is_home_depot_so_highly_valued/",
  "subreddit": "stocks",
  "id": "n04s7y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216018
}