{
  "author": "SharkerAC",
  "original_created_utc": 1629679666,
  "title": "Why is the American southeast the worst at.. basically everything?",
  "created_utc": 1629686399,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For context, I live in the American southeast, more specifically, Alabama. I constantly read the jokes online about how Mississippi and Alabama are basically the worst at everything, and they often really ring true. Alabama and Mississippi often place dead last or next to last in all kinds of things: life expectancy, obesity, quality of education, quality of life, air quality and so on. Birmingham, Alabama for instance has very high crime rates proportional to population. It’s not just Alabama and Mississippi, however, basically all of the southeast places lower than almost anywhere else in the developed world when it comes to progressive ideas such as support for lgbtq rights, clean energy, climate change etc. We also have some of the lowest understanding of basic scientific methodology; the southeast has some of the lowest vaccination rates for example. In addition, the governments of the southeast are often inefficient and teetering on theocracy. Alabama has the longest and most convoluted constitution of any state in the United States, and Jefferson County, AL has mismanaged money worse than almost any county in the country. Considering all this really makes me wonder if there is a historical explanation for this? What happened to the American southeast over the course of history that led to it basically being the bottom of the barrel of the developed world? At what point did the southeast diverge from the rest of the United States?</p>\n</div><!-- SC_ON -->",
  "score": 149,
  "permalink": "/r/AskHistorians/comments/p9ou6h/why_is_the_american_southeast_the_worst_at/",
  "subreddit": "AskHistorians",
  "id": "p9ou6h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For context, I live in the American southeast, more specifically, Alabama. I\nconstantly read the jokes online about how Mississippi and Alabama are basically\nthe worst at everything, and they often really ring true. Alabama and\nMississippi often place dead last or next to last in all kinds of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカの南東部、特にアラバマ州に住んでいます。I\nミシシッピ州とアラバマ州は基本的に何をするにも最悪だというジョークをネットでよく読みます。\nというジョークをよく読みますが、本当にその通りだと思います。アラバマ州と\nアラバマ州とミシシッピ州は、あらゆる分野で最下位かそれに次ぐ位置にあります。",
      "title": "なぜアメリカの南東部は、基本的にすべてにおいて最悪なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了说明情况，我住在美国东南部，更确切地说，住在阿拉巴马州。I\n我经常在网上看到一些笑话，说密西西比州和阿拉巴马州基本上是\n最糟糕的事情，而且这些笑话常常是真实的。阿拉巴马州和\n密西西比州经常在所有种类中排在最后或倒数第二位。",
      "title": "为什么美国东南部在......基本上所有方面都是最差的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了說明情況，我住在美國東南部，更確切地說，住在阿拉巴馬州。I\n我經常在網上看到一些笑話，說密西西比州和阿拉巴馬州基本上是\n最糟糕的事情，而且這些笑話常常是真實的。阿拉巴馬州和\n密西西比州經常在所有種類中排在最後或倒數第二位。",
      "title": "爲什麼美國東南部在......基本上所有方面都是最差的？"
    }
  ]
}