{
  "author": "DaddySkates",
  "original_created_utc": 1632559220,
  "title": "Thank you China for turning me into a impenetrable diamond holder who knows no fear",
  "created_utc": 1632574382,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After the Chinese announcement yesterday that they&#39;re AGAIN (for the 6th or 7th time now) banning the use of crypto I didn&#39;t even flinch. Evergrande FUD? It barely tickled me.  I dislike China in every way possible, but damn I do have to thank them for making me into a man that I would never have become, if it wasn&#39;t for their hilarious attempts at banning crypto and spreading fud. </p>\n\n<p>I went from &quot;OMG DROPPING 3% BETTER SELL&quot; guy to a diamond built, molten metal running through my veins, obsidian covered guy with two rubies instead of eyes and balls made out of gold plated latinum, breathing in pure hopium in a concentrated form. </p>\n\n<p>Nothing gets to me anymore. No FUD from China or from SEC for that matter.</p>\n\n<p>From the exchange my crypto goes directly to the wallet and it stays there. Keep doing your stuff China, it just makes me believe in crypto so much more.</p>\n\n<p>They did the exact opposite of what they wanted. With every FUD they spread, the community grows stronger. With every banning of the crypto they do, we rise even more. </p>\n\n<p>They really should look up &quot;<strong>Reverse</strong> <strong>psychology</strong>&quot;</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/pv2vkb/thank_you_china_for_turning_me_into_a/",
  "subreddit": "CryptoCurrency",
  "id": "pv2vkb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After the Chinese announcement yesterday that they're AGAIN (for the 6th or 7th\ntime now) banning the use of crypto I didn't even flinch. Evergrande FUD? It\nbarely tickled me. I dislike China in every way possible, but damn I do have to\nthank them for making me into a man that I would never have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日の中国の発表では、またしても（6回目か7回目か）O2Oの使用が禁止されました。\n暗号の使用を禁止すると発表しましたが、私はひるみませんでした。EvergrandeのFUD？それは\nかろうじてくすぐったかっただけです。私はあらゆる意味で中国が嫌いですが、私を男にしてくれた中国には感謝しなければなりません。\n中国には感謝しなければなりません。",
      "title": "私を恐れを知らない難攻不落のダイヤモンド・ホルダーにしてくれた中国に感謝します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在中国昨天宣布他们又一次（现在是第六或第七次）禁止使用加密货币后，我没有想到会有这样的结果。\n在中国昨天宣布再次（现在是第六或第七次）禁止使用加密货币后，我甚至没有退缩。恒大FUD？它\n它几乎没有让我发痒。我在所有方面都不喜欢中国，但该死的是我不得不\n感谢他们让我成为一个我永远不会有的人......",
      "title": "感谢中国把我变成一个坚不可摧的钻石持有者，让我无所畏惧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在中國昨天宣佈他們又一次（現在是第六或第七次）禁止使用加密貨幣後，我沒有想到會有這樣的結果。\n在中國昨天宣佈再次（現在是第六或第七次）禁止使用加密貨幣後，我甚至沒有退縮。恆大FUD？它\n它幾乎沒有讓我發癢。我在所有方面都不喜歡中國，但該死的是我不得不\n感謝他們讓我成爲一個我永遠不會有的人......",
      "title": "感謝中國把我變成一個堅不可摧的鑽石持有者，讓我無所畏懼。"
    }
  ]
}