{
  "author": "UpgradeNotSure",
  "the_new_excerpt": "I’ve never been a gambler, or so I thought . Always been risk averse. However,\nin the last year I’ve gotten really into swing trading because of the bull\nmarket (always afraid to let my money sit in an ETF for fear of a major\ncorrection). Ive justified it as being something controllable as I can…",
  "original_created_utc": 1614647829,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从来都不是一个赌徒，或者说我是这么认为的。一直以来，我都不喜欢冒险。不过\n在过去的一年里，我已经得到了真正进入波段交易，因为牛市\n市场（总是不敢让我的钱坐在ETF里，怕发生重大的。\n纠正）。) Ive正当是可控的东西，因为我可以...",
      "title": "我有赌博问题吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來都不是一個賭徒，或者說我是這麼認爲的。一直以來，我都不喜歡冒險。不過\n在過去的一年裏，我已經得到了真正進入波段交易，因爲牛市\n市場（總是不敢讓我的錢坐在ETF裏，怕發生重大的。\n糾正）。) Ive正當是可控的東西，因爲我可以...",
      "title": "我有賭博問題嗎？"
    }
  ],
  "title": "Do I have a gambling problem?",
  "created_utc": 1614659333,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve never been a gambler, or so I thought . Always been risk averse. However, in the last year I’ve gotten really into swing trading because of the bull market (always afraid to let my money sit in an ETF for fear of a major correction). Ive justified it as being something controllable as I can make educated decisions based on charts/financials/news and not a pure gamble that’s out of my hands.</p>\n\n<p>However, trading has consumed my life. I spend all my time reading charts and news. It has really started to impact my family and work life. I can step away from trading but I hate the thought of having my money sit and do nothing or the risk aversion in me is afraid of letting my funds sit in an ETF with an impending crash/correction. So I’m in this position where I know it’s affecting my life but I can’t step away from potential gains. That’s when I started questioning- do I have a gambling problem?</p>\n\n<p>Does anyone else have this experience? How do you deal with it?</p>\n</div><!-- SC_ON -->",
  "score": 333,
  "permalink": "/r/stocks/comments/lvqcaa/do_i_have_a_gambling_problem/",
  "subreddit": "stocks",
  "id": "lvqcaa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937743393
}