{
  "author": "OutcomeisIncome",
  "original_created_utc": 1659897877,
  "title": "AMA - I was arrested as a buyer off of dark web (marijuana) - Co-defendant went to prison (Both first time offenders)",
  "created_utc": 1659931061,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I’m doing this AMA as a way to bring closure to a bad period in my life. Me and co-defendants sold marijuana bought off of Alphabay (dark web marketplace). It’s rare for LE to go after buyers rather than vendors. I was the leader so to speak that orchestrated the whole thing. We live in the US in states with extremely strict laws regarding marijuana (South). We operated around 3 years.&lt;/p&gt;\n\n&lt;p&gt;Due to lack of evidence, I got probation for 5 years but got off the first week. (No that’s not a typo) One co-defendant got 5 years prison but only served 2 years because of good behavior. No other arrests was made with crew I was over: We were not in the same state. The states neighbored each other and wasn’t a far drive from each other. We both refused to cooperate with investigation so they “threw the book at us”.&lt;/p&gt;\n\n&lt;p&gt;I’d be happy to answer any questions. I can provide proof to mods in private. This all got me into bitcoin is why I chose to post this here. &lt;/p&gt;\n\n&lt;p&gt;TL; DR&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Sold marijuana bought off darkweb &lt;/li&gt;\n&lt;li&gt;Arrested for drug conspiracy &lt;/li&gt;\n&lt;li&gt;Co-defendant got prison. I got probation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/Bitcoin/comments/wimu3f/ama_i_was_arrested_as_a_buyer_off_of_dark_web/",
  "subreddit": "Bitcoin",
  "id": "wimu3f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi, I’m doing this AMA as a way to bring closure to a bad period in my life. Me\nand co-defendants sold marijuana bought off of Alphabay (dark web marketplace).\nIt’s rare for LE to go after buyers rather than vendors. I was the leader so to\nspeak that orchestrated the whole thing. We live in the US…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私は人生の悪い時期に区切りをつけるために、このAMAをやっています。私\nと共同被告人はAlphabay（ダークウェブマーケットプレイス）で買った大麻を売りました。\nLEがベンダーではなく、バイヤーを狙うのは珍しいことです。私はいわばリーダーで\nいわば、全体を指揮したリーダーです。我々は米国に住んでいる...",
      "title": "AMA - 私はダークウェブ（大麻）の買い手として逮捕され、共同被告人は刑務所へ（ともに初犯）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我做这个AMA是为了给我生命中的一段糟糕时期画上句号。我\n我和共同被告人出售从Alphabay（暗网市场）上购买的大麻。\n执法部门对买家而非卖家进行调查是很罕见的。我是一个领导者，可以这么说\n可以说是策划了整个事件。我们住在美国...",
      "title": "AMA - 我作为暗网买家被逮捕（大麻） - 共同被告人入狱（都是初犯）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我做這個AMA是爲了給我生命中的一段糟糕時期畫上句號。我\n我和共同被告人出售從Alphabay（暗網市場）上購買的大麻。\n執法部門對買家而非賣家進行調查是很罕見的。我是一個領導者，可以這麼說\n可以說是策劃了整個事件。我們住在美國...",
      "title": "AMA - 我作爲暗網買家被逮捕（大麻） - 共同被告人入獄（都是初犯）。"
    }
  ]
}