{
  "author": "KatheyBoss",
  "original_created_utc": 1635457676,
  "title": "Poker Wisdom for Crypto Investors: Avoiding Traps and Finding an Edge",
  "created_utc": 1635496927,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TL;DR: If you&#39;re looking for</strong> <a href=\"https://cryptopragmatist.com/sign-up/\">an edge in altcoin investing</a><strong>, take a look at poker to teach you some fundamental skills:</strong></p>\n\n<ul>\n<li><strong>Avoid results-based thinking</strong></li>\n<li><strong>Understand expected value</strong></li>\n<li><strong>Learn about how to size your bets</strong></li>\n<li><strong>Avoid chasing losses</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>-</p>\n\n<h1>Why are there so Many Successful Poker Players in Crypto?</h1>\n\n<p>In the last few weeks, I’ve begun to realize how many of the sharpest and most successful minds in crypto have poker-playing backgrounds. Here’s a non-comprehensive list:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>CEO of Three Arrows Capital, investor <strong>Su Zhu</strong></li>\n<li>Cofounder of Ethereum, <strong>Mihai Alisie</strong></li>\n<li>Macro trader and game theorist  <strong>Jordi Alexander</strong></li>\n<li>Pseudonymous legendary prop trader <strong>Light</strong></li>\n<li>Poker player-turned Crypto advocated <strong>Daniel Cates</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Those are just five prominent names that have experience with poker, or more importantly, experience with game theory, the study of strategic interactions.</p>\n\n<p>What concepts from poker can we take to crypto? There are definitely some mutual concepts right off the bat: expected value, results-oriented thinking, strategic decisions, how to find an edge, risk management.</p>\n\n<p>Let me make one thing clear: these are very different disciplines with very different skill sets, and smart people tend to float to the top in whatever industry they participate in. But it&#39;s still worth taking a look at.</p>\n\n<p>&#x200B;</p>\n\n<h1>1. The Perils of Results-Oriented Thinking</h1>\n\n<p><strong>In Poker Terms:</strong> Say you’re playing poker and based on your opponent’s early play, you think he has pocket kings or aces. You’ve got a pair of tens. The flop and the river turn up nothing for either of you. Your opponent goes all-in before the river, and you decide to test your luck and call him. The last card turns up a ten and you’ve suddenly got three-of-a-kind. You win the pot and conclude you’re a genius. </p>\n\n<p>Odds say that you had a 9% chance of winning before that last card turns up, meaning that you were a fool for going all-in—you just got lucky. You concluded you’re a genius based on results, not any fundamental truths, value calculations, or probabilities. This is called results-oriented thinking, and it’s not only mathematically wrong, it’s a perspective that will make you lose money over time. </p>\n\n<p><strong>Applying the Knowledge to Crypto:</strong> Making this bet is equivalent to being the guy who bet $8000 on Shiba Inu and is now a billionaire. Sure he’s got $5 billion dollars now, but he’s held onto a fundamentally worthless investment for over 400 days. Just about any stock or crypto has more real-world value than his. His investment was much more likely to go to zero than 5 billion. And frankly, the fact that he didn’t sell his investment earlier proves that he’s an even worse investor than we thought!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/pu8u5oj1f9w71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=01dc2874aea1b5808d703ab16a3ac062a7e9b290\">https://preview.redd.it/pu8u5oj1f9w71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=01dc2874aea1b5808d703ab16a3ac062a7e9b290</a></p>\n\n<p>FOMO (fear of missing out) is a great example of results-oriented thinking. It makes us disregard rationality and focus on a single outcome: upward price movement. Results-oriented thinking works the other way as well: perhaps you did your fundamental research and took a look at technical analysis for a perfect entry point, but nonetheless, your investment went down. </p>\n\n<p>That loss isn’t worth beating yourself up about. The goal is to make a sound investing decision on a sound thesis with a sound plan. If you can do that, you’ll make money in crypto over time. If you rely on results-based thinking, you’ll probably end up losing (or only win when you get lucky).</p>\n\n<p><strong>Lessons:</strong></p>\n\n<ul>\n<li><strong>A winning investment isn’t always a good investment</strong></li>\n<li><strong>FOMO is results-oriented thinking</strong></li>\n<li><strong>Losing money on a sound decision is nothing to be ashamed of</strong></li>\n<li><strong>Making money on a bad decision is a bad thing</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h1>2. The Bad Beat: Understanding Expected Value</h1>\n\n<p><strong>In Poker Terms:</strong> Have you ever heard the team ‘bad beat’? It’s the poker term for when you have a good hand that’s mathematically likely to win, but your opponent gets lucky or misplays and you end up on the losing side. Look at it another way: even with 90% odds, you’ll still lose 10% of the time. The ‘expected value’ is positive, but any given hand could put you in the red.</p>\n\n<p><a href=\"https://preview.redd.it/hukbfrapg9w71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=84a1f690b1ceb9d7b18d2296aaa84d03d78225d9\">https://preview.redd.it/hukbfrapg9w71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=84a1f690b1ceb9d7b18d2296aaa84d03d78225d9</a></p>\n\n<p><strong>Applying the Knowledge to Crypto:</strong> Let’s say you found a great small-cap alt that has a ton of value locked and the market cap is minuscule compared to its competitors that do the same thing. Even if the TVL / Market Cap ratio increases to the level of its competitors, the coin will do a 3x. </p>\n\n<p>While it looks like you found an undervalued gem, it’s still possible that your altcoin gets hacked or rug-pulled or there’s a horrible market downturn the day after you buy. If you would’ve but all of your money in, you’d be totally out of luck.</p>\n\n<p>But if you diversified across ten altcoins with these same characteristics across time periods, you’d probably do really well. You understood that time and chance happen to them all, never made a single bet too big, and that in the long term, these bets will pay off. Understand the expected value of a given investment and you will make better investing decisions long term.</p>\n\n<p><strong>Lessons:</strong></p>\n\n<ul>\n<li><strong>Bad luck happens</strong></li>\n<li><strong>Make lots of high-expected-value decisions and you will make money over time</strong></li>\n<li><strong>Understand the probability of price increases</strong>  </li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h1>3. Position Sizing: Invest the Right Amount</h1>\n\n<p><strong>In Poker Terms:</strong> Let&#39;s say your odds of winning the hand were 75% three hands in a row, but you bet a third of your original bankroll every time. You&#39;ve run into some bad luck on some high expected-value bets, and now you’re totally out of money.</p>\n\n<p>Remember: your bankroll must be preserved! As you grow your stack, you can enter riskier positions with larger amounts of capital. As your bankroll dips, it’s time to scale back.</p>\n\n<p><strong>Applying the Knowledge to Crypto:</strong> There is one thing more important than anything else in crypto investing: preservation of capital. The only way you can’t get up to fight another day is if you don’t have any money to invest. If you wish to participate in crypto markets, making strong returns on your capital is optional. But having capital? That’s 100% necessary. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wfo5el27f9w71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=75006a29b8dc3f11ab926444586f0a81465ab9f3\">https://preview.redd.it/wfo5el27f9w71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=75006a29b8dc3f11ab926444586f0a81465ab9f3</a></p>\n\n<p>The point of position sizing is to use expected payoff in tandem with your available balance to maximize returns. When you start off, it’s tempting to make big bets to grow quickly, but that’s the wrong approach. Start small and build up your stack by making money bit by bit. As you scale, you can start ramping up your position size to take advantage of your newfound leverage (sometimes people don’t invest enough as well). If your portfolio ends up shrinking a bit, it’s time to scale back again. </p>\n\n<p><strong>Lessons:</strong></p>\n\n<ul>\n<li><strong>Don’t let bad luck wipe you out</strong></li>\n<li><strong>Don’t be tempted by big bets with a small portfolio</strong></li>\n<li><strong>Scale your position sizes up and down as your portfolio grows</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h1>4. Irrational Mistakes: Chasing Losses</h1>\n\n<p><strong>In Poker Terms:</strong> Many novice poker players come off of a big loss and try to ‘make that money back’ immediately, often by moving up in stakes. This involves playing poker games that have higher minimum bet/average pot sizes. You end up playing against more skilled players and thus losing more money, more quickly. It’s a vicious cycle. </p>\n\n<p><strong>Applying the Knowledge to Crypto:</strong> In crypto, when people take big losses they often make one of three mistakes:</p>\n\n<ol>\n<li>Sell everything and leave the space forever</li>\n<li>Start playing with riskier assets</li>\n<li>Use leverage to make try to make their money back</li>\n</ol>\n\n<p>All of these decisions are silly and based on sunk costs. That money is gone, there’s no way to make it back. Every day, you’re starting from zero and your investment decisions should be valued freshly. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8x08l53df9w71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=2c6582d4a5340bfec132c04a14a3756fe67205e6\">https://preview.redd.it/8x08l53df9w71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=2c6582d4a5340bfec132c04a14a3756fe67205e6</a></p>\n\n<p>Keep in mind that humans are loss-averse by nature: losing $100 is more painful to us than gaining $100 is pleasant. There are some theories for why this is the case, but it’s almost universally true. Remember your first big drawdown? It hurt a lot more than your first run-up, didn’t it?</p>\n\n<p>The graph above helps illustrate my point. Losses and gains are not linear on a pain scale: a $1 loss hurts more than a $1 gain feels good, and so on. This is another bias to avoid. To make effective risk/reward calculations, we should try to avoid this loss aversion, as it can lead us to make distorted risk-reward calculations.</p>\n\n<p><strong>Lessons:</strong></p>\n\n<ul>\n<li><strong>We should avoid having our opinions changed by new gains or losses</strong></li>\n<li><strong>Sunk costs are already gone and are irrelevant for future decision-making.</strong></li>\n<li><strong>Be aware of and resistant to loss-aversion</strong></li>\n</ul>\n\n<h1>Positive-Sum Games: Crypto’s Trump Card</h1>\n\n<p>If all of these comparisons have you thinking that crypto is more gambling than investing, I’ve got some good news.</p>\n\n<p>Poker is what economists call a zero-sum game: there is no money created or destroyed in a game of poker, only redistributed. For every $100 you lose, someone else makes it. These are competitive games, in which someone having an advantage (edge) will win over time and create positive value for themselves. </p>\n\n<p>Interestingly enough, <strong>trading</strong> cryptos is zero-sum as well: when gains are weighed against the market average. It only involves players trying to eke out an advantage, with some successful and others losing out. </p>\n\n<p>Investing in crypto, and nearly all types of investing (except with options and futures) are <strong>positive-sum games:</strong> the total sum of the gains and losses is greater than zero. So if we all buy the same altcoin, a rising tide lifts all boats, and we can all win together. That’s not to say you can’t lose, but when the average crypto investment trends up, it’s possible for everyone to win.</p>\n\n<h1>Conclusion</h1>\n\n<p>Positive-value games are the best types of games to play because they add value for everyone. Buy understanding how to play them, and how to avoid the common pitfalls and biases that sometimes trap us, we can carve out above-average returns for our portfolios. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>EDIT: Thanks for the upvotes! I know Reddit hates self-promo, but if you liked this, you&#39;ll love my email newsletter on altcoin investing and altcoin analysis. Check it out here:</strong> <a href=\"https://cryptopragmatist.com/sign-up/\">CryptoPragmatist.com/sign-up/</a>. <strong>If it&#39;s not your thing, please ignore. Thanks!</strong></p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/qhxg50/poker_wisdom_for_crypto_investors_avoiding_traps/",
  "subreddit": "CryptoCurrency",
  "id": "qhxg50",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL;DR: If you're looking for an edge in altcoin investing\n[https://cryptopragmatist.com/sign-up/], take a look at poker to teach you some\nfundamental skills:\n\n * Avoid results-based thinking\n * Understand expected value\n * Learn about how to size your bets\n * Avoid chasing losses\n\n\n\n-\n\n\nWHY ARE…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR：アルトコイン投資で優位に立ちたいなら\n[https://cryptopragmatist.com/sign-up/] ポーカーを見て、基本的なスキルを学びましょう。\n基本的なスキルを学ぶことができます。\n\n * 結果ありきの思考を避ける\n * 期待値を理解する\n * 賭け金の大きさを決める方法を学ぶ\n *損失を追うことを避ける\n\n\n\n-\n\n\nWHY ARE...",
      "title": "Crypto投資家のためのポーカーの知恵。トラップを回避し、エッジを見つける"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR: 如果你正在寻找altcoin投资的优势\n[https://cryptopragmatist.com/sign-up/]，请看一下扑克牌，教你一些\n基本技能。\n\n *避免基于结果的思考\n * 理解预期价值\n * 了解如何确定你的赌注大小\n * 避免追逐损失\n\n\n\n-\n\n\n为什么要...",
      "title": "针对加密货币投资者的扑克智慧。避开陷阱，寻找优势"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR: 如果你正在尋找altcoin投資的優勢\n[https://cryptopragmatist.com/sign-up/]，請看一下撲克牌，教你一些\n基本技能。\n\n *避免基於結果的思考\n * 理解預期價值\n * 瞭解如何確定你的賭注大小\n * 避免追逐損失\n\n\n\n-\n\n\n爲什麼要...",
      "title": "針對加密貨幣投資者的撲克智慧。避開陷阱，尋找優勢"
    }
  ]
}