{
  "author": "3seatyeet",
  "original_created_utc": 1624840530,
  "title": "Anybody else genuinely prefer rain/overcast over sunshine?",
  "created_utc": 1624850620,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don’t get me wrong, the sun is great and absolutely essential but.. does anybody else get genuinely excited for rain? Or enjoy days with overcast (dark gray clouds above) more than those bright sunshine days?</p>\n\n<p>I feel like everybody always talks about how great the weather is and then you look outside to see a blazing sun at 2pm, not a cloud in site and extremely dry?  </p>\n\n<p>I love being outdoors and hiking but 100% if it’s raining or heavy overcast it’s going to be a far better day than a day full of sun.</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "permalink": "/r/NoStupidQuestions/comments/o99ao0/anybody_else_genuinely_prefer_rainovercast_over/",
  "subreddit": "NoStupidQuestions",
  "id": "o99ao0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Don’t get me wrong, the sun is great and absolutely essential but.. does anybody\nelse get genuinely excited for rain? Or enjoy days with overcast (dark gray\nclouds above) more than those bright sunshine days?\n\nI feel like everybody always talks about how great the weather is and then you\nlook…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解を恐れずに言えば、太陽は素晴らしく、絶対に必要なものですが...。\n雨が降ると純粋にワクワクする人はいませんか？晴れの日よりも曇りの日の方が楽しいという人はいませんか？\n暗い灰色の雲）の日の方が、明るい日差しの日よりも楽しいという人はいませんか？\n\n誰もがいつも天気の良さを語っているような気がしますが、それにしても\n見てみると...",
      "title": "純粋に、太陽よりも雨や曇りが好きな人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要误会我的意思，太阳是伟大的，而且绝对是必要的，但是......有谁会因为下雨而真正感到兴奋？\n还有人对下雨天感到真正的兴奋吗？或者喜欢阴天（上面有深灰色的\n云）比那些阳光明媚的日子更喜欢？\n\n我觉得每个人都在谈论天气有多好，然后你会发现\n看看...",
      "title": "还有人真正喜欢下雨/阴天而不是阳光吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要誤會我的意思，太陽是偉大的，而且絕對是必要的，但是......有誰會因爲下雨而真正感到興奮？\n還有人對下雨天感到真正的興奮嗎？或者喜歡陰天（上面有深灰色的\n雲）比那些陽光明媚的日子更喜歡？\n\n我覺得每個人都在談論天氣有多好，然後你會發現\n看看...",
      "title": "還有人真正喜歡下雨/陰天而不是陽光嗎？"
    }
  ]
}