{
  "author": "CitrusBowl_88",
  "the_new_excerpt": "Very curious about how the federal MW actually works and who it applies to in\ngeneral. Also curious about individual state rights here since I once heard that\nif Republicans for instance overturned Roe vs Wade and made abortions illegal,\nindividual states could still choose to allow them if they…",
  "original_created_utc": 1612370195,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "非常好奇联邦MW到底是如何运作的，以及它适用于谁。\n一般。同时也对这里的国家个人权利感到好奇，因为我曾经听说过\n比如说，如果共和党人推翻了罗伊与韦德法案，将堕胎定为非法。\n各个州仍然可以选择允许他们，如果他们... ...",
      "title": "如果联邦最低工资提高到15美元或其他什么标准，它将直接适用于谁，又不适用于谁？另外，如果各州愿意的话，他们是否还可以将自己的最低工资标准定得高于或低于联邦最低工资标准？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "非常好奇聯邦MW到底是如何運作的，以及它適用於誰。\n一般。同時也對這裏的國家個人權利感到好奇，因爲我曾經聽說過\n比如說，如果共和黨人推翻了羅伊與韋德法案，將墮胎定爲非法。\n各個州仍然可以選擇允許他們，如果他們... ...",
      "title": "如果聯邦最低工資提高到15美元或其他什麼標準，它將直接適用於誰，又不適用於誰？另外，如果各州願意的話，他們是否還可以將自己的最低工資標準定得高於或低於聯邦最低工資標準？"
    }
  ],
  "title": "If the federal minimum wage were raised to $15 or anything else, who would it directly apply to and who wouldn't it apply to? Also, could individual states still set their own minimum wage higher or lower than the federal one if they wanted to?",
  "created_utc": 1612414472,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Very curious about how the federal MW actually works and who it applies to in general. Also curious about individual state rights here since I once heard that if Republicans for instance overturned Roe vs Wade and made abortions illegal, individual states could still choose to allow them if they wanted to, so would a similar case apply to the MW where states that dont feel ready or dont want to move up to $15 be free and able to move it to say $11 or $12 or even not move it at all?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/Ask_Politics/comments/lbrlgl/if_the_federal_minimum_wage_were_raised_to_15_or/",
  "subreddit": "Ask_Politics",
  "id": "lbrlgl",
  "is_self": true,
  "media": null,
  "is_video": false
}