{
  "author": "Godzilla453",
  "the_new_excerpt": "Since the whole MOONS thing started I’ve noticed people making posts here.\nThankfully we got rid of memes but I still see posts about news, personal\nstories & anecdotes, crypto adoption and dozens of other topics. CAN WE JUST\nSTOP ALREADY?! Almost every one of these ‘posts’ ends up receiving…",
  "original_created_utc": 1618491358,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "MOONSの活動が始まってから、ここに書き込みをしている人がいることに気づきました。\nありがたいことにミームは廃止されましたが、ニュース、個人的な話や逸話、暗号採用やその他多くのトピックについての投稿を目にします。\nニュース、個人的な話や逸話、暗号の採用、その他多くのトピックについての投稿が見られます。私たちはただ\nもうやめませんか？このような「投稿」のほとんどすべてが、結局は...",
      "title": "投稿やコメントをSTOPすることができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从MOONS的事情开始，我注意到有人在这里发帖。\n幸好我们摆脱了memes，但我仍然看到关于新闻，个人的帖子。\n故事和轶事，加密采用和其他几十个主题。我们能不能\n停止？几乎每一个这样的 \"帖子 \"最后都会收到... ...",
      "title": "我们能不能不要再发帖子和评论了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從MOONS的事情開始，我注意到有人在這裏發帖。\n幸好我們擺脫了memes，但我仍然看到關於新聞，個人的帖子。\n故事和軼事，加密採用和其他幾十個主題。我們能不能\n停止？幾乎每一個這樣的 \"帖子 \"最後都會收到... ...",
      "title": "我們能不能不要再發帖子和評論了？"
    }
  ],
  "title": "Can we STOP with the posts and comments?",
  "created_utc": 1618525893,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since the whole MOONS thing started I’ve noticed people making posts here. Thankfully we got rid of memes but I still see posts about news, personal stories &amp; anecdotes, crypto adoption and dozens of other topics. CAN WE JUST STOP ALREADY?! Almost every one of these ‘posts’ ends up receiving comments and I feel like it’s destroying this place.  Got something important to say about crypto-related subjects? Go tell your neighbour. Whisper it softly to the post man. Write it down on a little piece of paper and give it to your mum to keep in her purse. But ffs stop treating <a href=\"/r/cc\">r/cc</a> like it’s some sort of bulletin board for exchanging thoughts and communicating with others.    </p>\n\n<p>Just had to get that off my chest.</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/CryptoCurrency/comments/mre2pb/can_we_stop_with_the_posts_and_comments/",
  "subreddit": "CryptoCurrency",
  "id": "mre2pb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171517793
}