{
  "author": "ares_abi",
  "original_created_utc": 1636381073,
  "title": "A 40% Gain Doesn't Make You 40% Smarter",
  "created_utc": 1636450355,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Please always keep that in mind. It&#39;s not hard to make money during a bull market that is going on for mutiple months now and hasn&#39;t even peaked yet.</p>\n\n<p>You can basically invest your money in any coin without any reasonable fundamentals and you&#39;ll make money. That doesn&#39;t make you a pro-trader or a crypto entrepreneur.</p>\n\n<p>As someone who went through the two year bear market from 2017 to 2019 - let me tell you that your &quot;skills&quot; won&#39;t help you when everything is dipping day by day, no matter how good the fundamentals are.</p>\n\n<p>This is a speculative market. Enjoy the ride and use your spare time to educate yourself about risk-management. This will help you in the near future.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/qpeka8/a_40_gain_doesnt_make_you_40_smarter/",
  "subreddit": "CryptoCurrency",
  "id": "qpeka8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Please always keep that in mind. It's not hard to make money during a bull\nmarket that is going on for mutiple months now and hasn't even peaked yet.\n\nYou can basically invest your money in any coin without any reasonable\nfundamentals and you'll make money. That doesn't make you a pro-trader or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そのことを常に念頭に置いてください。強気の相場が続いているときにお金を稼ぐのは難しくありません。\n数ヶ月前から続いていて、まだピークにも達していない強気の市場でお金を稼ぐのは難しいことではありません。\n\n基本的には、合理的なファンダメンタルズのないどんなコインにもお金を投資することができます。\n儲けることができます。だからといって、あなたがプロトレーダーになるわけではありませんし...。",
      "title": "40％の利益で40％賢くなるわけではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请始终牢记这一点。在一个持续数年的牛市中赚钱并不难。\n赚钱并不难，因为现在的牛市已经持续了几个月，甚至还没有达到顶峰。\n\n你基本上可以把你的钱投资在任何没有任何合理的\n基本面，你就可以赚钱了。这并不意味着你是一个专业的交易员或...",
      "title": "40%的收益并不能使你变得更聪明"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請始終牢記這一點。在一個持續數年的牛市中賺錢並不難。\n賺錢並不難，因爲現在的牛市已經持續了幾個月，甚至還沒有達到頂峯。\n\n你基本上可以把你的錢投資在任何沒有任何合理的\n基本面，你就可以賺錢了。這並不意味着你是一個專業的交易員或...",
      "title": "40%的收益並不能使你變得更聰明"
    }
  ]
}