{
  "author": "hononononoh",
  "original_created_utc": 1627140909,
  "title": "What were the major problems in pre-Islamic Arab society, to which Islam was, ostensibly, a solution?",
  "created_utc": 1627215690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What I find striking about the rise and spread of Islam in the Arabian Peninsula, and to a lesser degree in the rest of the Middle East and North Africa, is how incredibly fast and thorough it was. Historical commentary from Westerners post-9/11 would have me believe that this was due to a relentless and merciless show of brute force on the part of Muhammad, his close allies, and his heirs, and like many swift and brutal conquests, was entirely self-serving for the conquerors.</p>\n\n<p>I question this narrative. I have a hard time believing Islam would have achieved such thorough and lasting penetration — almost homogeneous in large swaths of the MENA — among the common people, had Islam not been highly attractive to commoners in its promise to solve some pressing social, economic, and political issues which affected them directly, and for which there were no other clear solutions apparent. By way of analogy, I see the Call to Islam as the bump that knocked over a long string of standing dominoes that were just waiting to fall.</p>\n\n<p>If my supposition is at least partially correct, how effective was the widespread conversion (or <em>re</em>version, if you prefer) to Islam in ameliorating these problems, at least until the colonial age and the dawn of modernity?</p>\n\n<p>If Islam had never arisen, would a different (but politically and economically similar) religious movement have likely arisen and had the same effect?</p>\n\n<p>Edit: One day after posting, and 100 upvotes but no replies. I’m not frustrated — this lack of response <em>is</em> a very telling response. What I suspect is that this is a difficult question to answer objectively, and a socially and professionally dangerous topic for a scholar to engage with at all.</p>\n\n<p>Also, for an example of what I mean, Islam bans the loaning and borrowing of money for a fee. This has arguably hindered development, industrialization, and wealth redistribution / poverty eradication in the Muslim world in modern times. But I bet that at the time of its introduction, this ban on usury was revolutionary, and stopped a lot of predation by rich gangsters on the poor. It’s not easy for a civilization to enshrine a practice as so-helpful-it’s-a-godsend, only to be told centuries later that it’s no longer helpful at all.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/oqsbbn/what_were_the_major_problems_in_preislamic_arab/",
  "subreddit": "AskHistorians",
  "id": "oqsbbn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What I find striking about the rise and spread of Islam in the Arabian\nPeninsula, and to a lesser degree in the rest of the Middle East and North\nAfrica, is how incredibly fast and thorough it was. Historical commentary from\nWesterners post-9/11 would have me believe that this was due to a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アラビア半島やその他の中東・北アフリカ地域でのイスラム教の勃興と広がりについて、私が印象的だと思うのは\nアラビア半島やその他の中東・北アフリカ地域でのイスラム教の勃興と普及について、私が驚くのは、そのスピードと徹底ぶりです。\n驚くべきは、そのスピードと徹底ぶりである。9.11以降の欧米人による歴史的な解説では\n9.11以降の欧米人による歴史的な解説では、これは「イスラム国」のせいだと思われているようです。",
      "title": "イスラム教が表向きの解決策となった、イスラム教以前のアラブ社会の主要な問題は何だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于伊斯兰教在阿拉伯半岛的兴起和传播，我发现引人注目的是\n我发现伊斯兰教在阿拉伯半岛的兴起和传播，以及在中东和北非其他地区较小的程度上的兴起和传播，令人震惊的是它是如此快速和彻底。\n程度上，伊斯兰教的崛起和传播是如此之快和彻底。9.11之后西方人的历史评论\n西方人在 \"9-11 \"事件后发表的历史评论会让我相信，这是由于...。",
      "title": "伊斯兰教前的阿拉伯社会有哪些主要问题，而伊斯兰教表面上是一种解决方案？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於伊斯蘭教在阿拉伯半島的興起和傳播，我發現引人注目的是\n我發現伊斯蘭教在阿拉伯半島的興起和傳播，以及在中東和北非其他地區較小的程度上的興起和傳播，令人震驚的是它是如此快速和徹底。\n程度上，伊斯蘭教的崛起和傳播是如此之快和徹底。9.11之後西方人的歷史評論\n西方人在 \"9-11 \"事件後發表的歷史評論會讓我相信，這是由於...。",
      "title": "伊斯蘭教前的阿拉伯社會有哪些主要問題，而伊斯蘭教表面上是一種解決方案？"
    }
  ]
}