{
  "author": "PBRent",
  "original_created_utc": 1628445800,
  "title": "The American public is being hustled by the oldest trick in the negotiations playbook.",
  "created_utc": 1628458755,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Exactly what the title says. For the purpose of this post, I will refer to the Wyden-Toomey-Lummis amendment as &quot;Proposal 1&quot; and the  Portman-Warner-Sinema amendment as &quot;Proposal 2&quot;. Here we go.</p>\n\n<p>&#x200B;</p>\n\n<p>Proposal 1 is introduced on 8/4, and there is an immediate public reaction. Thousands of citizens call their representatives in protest of this clearly last minute, shady amendment that will fast-track removing anonymity from the crypto space.</p>\n\n<p>Proposal 2 is introduced one day later on 8/5, and again there is an immediate public reaction. This reaction even stronger than the last because this amendment is so much worse than the other one (I won&#39;t get into why in this post). Suddenly everyone is suggesting that we call our representatives and ask for Proposal 1. Look at the most recent posts about the amendments from before Proposal 2 was released and then after.</p>\n\n<p>HUSTLED. Congress quite obviously created Proposal 2 as an <em>anchor,</em> in order to get the public on board with Proposal 1. Keep in mind, not many people were a fan of Proposal 1 before Proposal 2 came out, and now people have accepted Proposal 1. This is negotiations 101, and you just got served.</p>\n\n<p>It took our government 24 hours to create an anchor point and immediate shift the mood on Proposal 1, which was their goal to pass in the first place. If you think that Congress is not aware of what they are doing, I suggest you pay closer attention to how our legislative branch works.</p>\n\n<p>It is not too late, call your representatives. Vote NO on Proposal 1 &amp; 2. Don&#39;t let our <em>elected leaders</em> hustle their constituents.</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/p0jjy7/the_american_public_is_being_hustled_by_the/",
  "subreddit": "CryptoCurrency",
  "id": "p0jjy7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Exactly what the title says. For the purpose of this post, I will refer to the\nWyden-Toomey-Lummis amendment as \"Proposal 1\" and the Portman-Warner-Sinema\namendment as \"Proposal 2\". Here we go.\n\n\n\nProposal 1 is introduced on 8/4, and there is an immediate public reaction.\nThousands of citizens call…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まさにタイトル通りですね。この記事では、ワイデン・トミー・ラムミス修正案を「第1案」と呼ぶことにします。\nワイデン、トゥーミー、ルーミス両氏の修正案を「第1案」、ポートマン、ワーナー、シネマ両氏の修正案を「第2案」と呼ぶことにします。\nの修正案を「第2案」と呼ぶことにします。さて、ここからが本題です。\n\n\n\n案1は8月4日に提出され、すぐに世論の反応がありました。\n何千人もの市民が...",
      "title": "アメリカ国民は、交渉の教科書に載っている古い手口に騙されているのだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说。在这篇文章中，我将指的是\nWyden-Toomey-Lummis修正案为 \"提案1\"，Portman-Warner-Sinema修正案为 \"提案2\n修正案为 \"提案2\"。我们开始吧。\n\n\n\n提案1于8月4日推出，公众立即作出反应。\n数以千计的公民呼吁...",
      "title": "美国公众正被谈判手册中最古老的伎俩所蒙骗。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說。在這篇文章中，我將指的是\nWyden-Toomey-Lummis修正案爲 \"提案1\"，Portman-Warner-Sinema修正案爲 \"提案2\n修正案爲 \"提案2\"。我們開始吧。\n\n\n\n提案1於8月4日推出，公衆立即作出反應。\n數以千計的公民呼籲...",
      "title": "美國公衆正被談判手冊中最古老的伎倆所矇騙。"
    }
  ]
}