{
  "author": "imadumbshit69",
  "original_created_utc": 1659802997,
  "title": "We are stuck in a bear market until you guys start having babies.",
  "created_utc": 1659854189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s investing 101. When everyone is having babies, the market is in a bull run and the opposite is true. Look at the markets, they&amp;#39;re all not doing too hot and neither is the political and socioeconomic enviroment of the world or something smart. Then look at your social media, people have switched to a different type of pump and dumps. &lt;/p&gt;\n\n&lt;p&gt;But if you look at the times after big wars, there&amp;#39;s always lots of babies and some good bull markets for their time. So go get your hair did, wear some smelly goods, and put on your best crocs. Go out and manipulate the market. Don&amp;#39;t call her baby, call her SEC and spank her to show her who&amp;#39;s in charge (or him, whatever your type is). Hodl some boobies.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m rooting for you. We&amp;#39;ll be Gucci soon enough.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/whs5pn/we_are_stuck_in_a_bear_market_until_you_guys/",
  "subreddit": "CryptoCurrency",
  "id": "whs5pn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's investing 101. When everyone is having babies, the market is in a bull run\nand the opposite is true. Look at the markets, they're all not doing too hot and\nneither is the political and socioeconomic enviroment of the world or something\nsmart. Then look at your social media, people have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それは、投資の101です。みんなが赤ちゃんを産んでいるとき、市場は強気であり\nであり、その逆は真である。市場を見てください、みんなあまり調子がよくありませんし\n世界の政治的、社会経済的な環境もそうだし、何か賢くない。\nスマートだ。そして、あなたのソーシャルメディアを見てください、人々は持っています...",
      "title": "お前らが子供を産むまで弱気相場から抜け出せない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这就是投资101。当每个人都在生孩子的时候，市场就会处于牛市运行状态\n反之亦然。看看市场，他们都没有做得太好，而且\n世界的政治和社会经济环境也是如此。\n聪明。然后看看你的社交媒体，人们有...",
      "title": "我们陷入了熊市，直到你们开始生孩子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這就是投資101。當每個人都在生孩子的時候，市場就會處於牛市運行狀態\n反之亦然。看看市場，他們都沒有做得太好，而且\n世界的政治和社會經濟環境也是如此。\n聰明。然後看看你的社交媒體，人們有...",
      "title": "我們陷入了熊市，直到你們開始生孩子。"
    }
  ]
}