{
  "author": "IknowGoodThings",
  "original_created_utc": 1629825786,
  "title": "The Dawning of the Age of Utility : How the Blockchain is About to Disrupt the World",
  "created_utc": 1629869437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>This is a two-part piece exploring the future of the utilization of blockchain technology, if you don’t like long reads and want to know what exciting blockchain utility projects to keep an eye on, please stay tuned for PT.II which will be released within the next week or two)</em></p>\n\n<p><strong><em>TLDR: We can predict mass adoption of the blockchain within the next decade.  It&#39;s already well underway.</em></strong></p>\n\n<p>The blockchain is an often misunderstood, miscategorized and misrepresented technology.  Often this misrepresentation is completed deliberately in the media as a form of straw man arguments in order to discredit the blockchain as an umbrella term for cryptocurrency.  My parents still don’t understand what the blockchain is despite my best efforts to explain it to them.  They will likely die not fully grasping the concept.  To them, Bitcoin is the blockchain.  It represents a rupture in the core of their beliefs and everything they think they know. It stokes fear in their Forbes/Bloomberg reading hearts. It represents a pyramid scheme of epic, the greatest scam in the history of scams.  The blockchain to them is simply a wild west casino:  As Chuck Palahniuk once penned, “What we don’t understand we can make mean anything.”  This phrase has always stayed close to me.</p>\n\n<p>We, the enlightened ones, know better.  We understand the full potential of the blockchain.  The ones who should be scared are not our boomer parents - it is the financial institutions: the lenders and bankers, it is the signing authorities (we’re coming for you, notaries!), the insurance companies, real estate brokers etc.  They are ones who should be shaking in their boots.  If they do not embrace the blockchain, they are primed to become a cassette deck in the world of digital media.  The clock is ticking. Tick, tick tick.</p>\n\n<p>Up until recently, the primary utility of blockchain technology has been relegated to recording transactions of cryptocurrencies.  This is likely how you use the technology when you purchase your cockapoo coins or plutovault tokens.  The blockchain records the transaction of ownership and creates a record, or block, which contains a cryptographic hash of the previous block, a timestamp, and transactional data.  This ensures that your cockapoo coin will forever (until you find a buyer) be yours.  You can pass that plutovault token to your kids as a generational reminder of your investing failures; so that they will not make the same mistake you did.  </p>\n\n<p>Recently however, there has been a revolution in the utilization of blockchain technology. In the next decade we are primed to start seeing this technology break through the cryptocurrency barrier to be used widespread in any industry where there is a transaction of, or proof of ownership.  You should take notice, because predicting this shift will potentially be very profitable, and you won’t need a crystal ball to see why:  the more people understand the blockchain, the less scared they will be of it.  The less scared they are of it the more likely they are to trust it.  The more likely they are to trust it the more likely they are to put their money into it.  We are still at the beginning phases of this exciting new development - the blockchain, cryptocurrency, utility tokens - all still in their infancies.  This is still a new frontier, and there’s lots of high quality staking grounds to go around.</p>\n\n<p>We need to recall that the blockchain was invented to solve a problem - to solve the double spending problem of a digital currency.  <strong>It was invented to cut out the requirement of a trusted authority or central server.</strong>  This is discussed in this The Economist <a href=\"https://www.economist.com/briefing/2015/10/31/the-great-chain-of-being-sure-about-things\">article</a> back on Halloween in the year 2015. Now, If we were to remove the paywall you would see that they use an example of a woman in Honduras who, despite having ownership records and deed of their property, was visited by police to be evicted from the home she had lived in for three decades.  How could this happen? Unfortunately this act of neo-colonialism by the state is common in certain parts of the world.  Paper deeds and titles can either be mismanaged, or worse; forged.  In this case, the woman&#39;s home was demolished - as requested by the person “registered” as the owner.  The woman, despite holding a copy of the deed, was left homeless. She could not prove to Government authorities or the court that the house was hers.  The trusted authority or central server, in this case the Government, completely failed her. At its core, the blockchain was invented to solve this problem. Had the title of property been stored in a secure blockchain database - this wouldn’t have happened. <strong>It couldn’t have happened.</strong> </p>\n\n<p>Blockchain technology is about to erupt and disrupt many different industries. If you’re still following, I’m going to take some time to dive into five of the more exciting use cases below and why they are important below.  If you’re fading - please keep an eye out for my next piece, to be released in the next week or two, which will detail a few of the exciting projects within these industries:</p>\n\n<p><strong>I) SMART CONTRACTS</strong></p>\n\n<p>We will start with Smart contracts since they are the the foundation of utility of the blockchain within most industries. They have been described as contract <a href=\"https://ethereum.org/en/developers/docs/smart-contracts/\">vending machines</a>, but really they are simply programs stored on a blockchain database that will run when a predetermined condition is met (ibm.com/topics/smart-contracts).  This technology will allow performance of credible transactions without third parties essentially making the requirement of a witnessing by a notary or lawyer, non existent. <strong><em>It removes the middle-man from the equation.</em></strong>  This is a real, tangible solution that offers improved security, improved accuracy,  time savings, and financial benefits.  Smart contracts <a href=\"https://www.forbes.com/sites/oliverherzfeld/2016/02/22/smart-contracts-may-create-significant-innovative-disruption/?sh=67875b7c396a\"><strong>are</strong></a> going to disrupt the entire world, and in some ways they already are.  </p>\n\n<p>Currently, one of the primary hurdles to smart contracts is that they are unregulated by many leading governments, but you can hedge your bets that this is going to change in the not so distant future.  We can be sure that some legal professionals will fight tooth and nail to combat this threat to their livelihood and stay relevant - but make no mistake <strong>their time is running out.</strong></p>\n\n<p><strong>II) INSURANCE</strong></p>\n\n<p>Insurance is a multi-trillion dollar industry - and the blockchain is about to completely turn it on its heels. Underwriters everywhere are beginning to take notice. Deloitte, the largest multinational professional services network in the world - recently issued a <a href=\"https://www2.deloitte.com/ca/en/pages/financial-services/articles/blockchain-in-insurance.html\">lovely infographic </a>which clearly outlines why the industry and consumers alike should care.  This infographic concludes that <strong><em>the technology can fundamentally alter claims submission processes to reduce fraud and improve customer experience</em></strong><em>.</em> If Deloitte is making this kind of statement, you can be rest assured that you should be taking notice too. </p>\n\n<p>What Deloitte understands is simple:  the blockchain looks to solve many of the fundamental problems in the industry, including but not limited to; inefficiency, fraud, human error and cyber threats.  The insurance industry loses approximately <a href=\"https://www.subex.com/blog/the-true-cost-of-insurance-fraud/#:%7E:text=The%20Coalition%20Against%20Insurance%20Fraud,fraud%20at%20USD%2080%20billion.\">$80 billion dollars</a> per year according to The Coalition Against Insurance Fraud.  That’s not including health insurance fraud. We’ve already  talked about how smart contracts essentially remove the middle-man requirement, and this will be true in the insurance industry -  but perhaps more importantly, smart contracts would be able to track insurance claims and then dissolve if false or fraudulent claims were made - transferring premium payments back from the individual to the insurance provider.  Pretty exciting stuff.</p>\n\n<p><strong>III)  DIGITAL ASSETS/DIGITAL SECURITIES</strong></p>\n\n<p>This is one that really excites me.  Have you ever wanted to own a digital representation of the Empire State Building?  In the not so distant future, this could easily become reality as a digital asset. The blockchain will also theoretically make it possible to own fractional shares of property or asset in the form of security tokens.</p>\n\n<p>So what is the difference between a digital asset and digital security?  A digital asset is a digital representation of value of something that has value.  It is commonly regulated as currency (see BTC) or property (see NFTs).   Remember when our money used to be a representation of a store of value (gold) which we hoarded (and still do) at<a href=\"https://en.wikipedia.org/wiki/United_States_Bullion_Depository\"> Fort Knox?</a>, in theory, it’s kind of like that. Currently, the value of our currency is tied only to the demand for it.  The federal reserve keeps <a href=\"https://brrr.money/\"><strong>pumping</strong></a> out cash in an attempt to manage inflation.  Having a store of value tied to a real asset is much safer in times of high inflation. </p>\n\n<p>A digital security on the other hand is a representation of an asset that happens to be a <a href=\"https://www.fdic.gov/regulations/laws/rules/8000-6200.html#:%7E:text=(1\">security</a>%20The%20term%20%22security,certificate%20or%20subscription%2C%20transferable%20share%2C) or, something deposited or pledged as a guarantee of the fulfillment of an undertaking or the repayment of a loan, to be forfeited in case of default. For example, a tokenized share of a building - or a tokenized share of a company.  </p>\n\n<p>The United States currently has strict laws that forbid digital securities, but this is very likely to <a href=\"https://www.coindesk.com/new-crypto-bill-in-us-congress-is-the-most-comprehensive-yet\">change</a> within the next couple of years. The ripple effect of defining and regulating digital securities will be massive because it will unlock equity and liquidity in financial markets that were previously locked in place.  If you are able to purchase fractional ownership of the Empire State Building in the form of a security token you will be entitled to the equity that is generated year after year as the value increases.  This is a big deal, and I personally believe this is the next big gold rush - so get ready, and keep your ears and eyes open for federal regulation.  </p>\n\n<p><strong>IV) SUPPLY CHAIN</strong></p>\n\n<p>The supply chain is <a href=\"https://www.investopedia.com/terms/s/supplychain.asp#:%7E:text=A%20supply%20chain%20is%20a,product%20to%20the%20final%20buyer.&amp;text=The%20supply%20chain%20also%20represents,original%20state%20to%20the%20customer.\">defined </a>as a network between a company and its suppliers to produce and distribute a specific product to the final buyer. Blockchain technology is a complete game changer in supply chain management because it effectively eliminates execution errors, mistakes in data processing, missing shipments, duplicate payments and also solves the problem of tracking complicated supply chain activities where orders are split up into separate shipments with multiple invoices etc.  Supply chain management is a nightmare.  It gives me anxiety.</p>\n\n<p>Since the blockchain solves this issue of record keeping, it also reduces auditing processes and costs associated with audits.  The blockchain and supply chain management is a match made in heaven.  Many of the largest distributors are currently <a href=\"https://www.forbes.com/sites/biserdimitrov/2019/12/05/how-walmart-and-others-are-riding-a-blockchain-wave-to-supply-chain-paradise/?sh=2724e9297791\">experimenting</a> with this technology.  If the big guys are doing it, the rest of the industry is sure to follow.  </p>\n\n<p><strong>V) VOTING/GOVERNMENT</strong></p>\n\n<p>Imagine a time when voting fraud will be completely eliminated from the electoral process.  This is the future that is currently being envisioned by many governments and policy makers around the world.  The blockchain will make it <a href=\"https://www.investopedia.com/news/how-blockchain-technology-can-prevent-voter-fraud/\">possible</a>.  The U.S. has had massive issues with voter fraud and challenges with collecting and counting votes - however since the blockchain creates a tamper proof electronic record, with extreme accuracy,  it only makes sense that governments start looking toward the blockchain to solve these issues.  It could also serve to alleviate voter suppression and provide more accessibility to people who are disabled, sick, or located overseas. The hesitancy is primarily based around the fear of a risk of hacking the results - which is completely valid, but also not without bias.  A phone with malware could potentially be tampered to cast a vote - which means the code will need to be extremely tight and secure.  Certainly very possible.  I’m excited to see how this technology develops.</p>\n\n<p>To conclude, the future of the blockchain is bright - and we are well on our way to see mass adoption within the decade. The blockchain solves too many problems for most industries to ignore, and we are due for a gold rush as regulations evolve to keep up with the technology.  There are too many great projects to mention but I will try to outline a few that I find personally exciting in a follow up post within the next two weeks.  <strong>Please feel free to drop some projects that relate to blockchain utility and mass adoption below and remember to always DYOR!</strong></p>\n</div><!-- SC_ON -->",
  "score": 156,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/QW7aoHuZbN5IkBEThz30UApf7u8zEAvXd-2EGVo8L0Q.jpg?auto=webp&s=db58f33aafa405d33771fd31b9c8bf6cac22ed14",
          "width": 595,
          "height": 335
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/QW7aoHuZbN5IkBEThz30UApf7u8zEAvXd-2EGVo8L0Q.jpg?width=108&crop=smart&auto=webp&s=730de53d8461a5ac777dfa23fe53621e1360a38e",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/QW7aoHuZbN5IkBEThz30UApf7u8zEAvXd-2EGVo8L0Q.jpg?width=216&crop=smart&auto=webp&s=43e62c896fb60006f91569c6183392134f4c5acb",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/QW7aoHuZbN5IkBEThz30UApf7u8zEAvXd-2EGVo8L0Q.jpg?width=320&crop=smart&auto=webp&s=b8ae0090de6e39188094e407711e67c63f691905",
            "width": 320,
            "height": 180
          }
        ],
        "variants": {},
        "id": "vVuo_lWystYEAMfF0FBOa4JiqFZov6ZmYIReWVcyZks"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/parux6/the_dawning_of_the_age_of_utility_how_the/",
  "subreddit": "CryptoCurrency",
  "id": "parux6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is a two-part piece exploring the future of the utilization of blockchain\ntechnology, if you don’t like long reads and want to know what exciting\nblockchain utility projects to keep an eye on, please stay tuned for PT.II which\nwill be released within the next week or two)\n\nTLDR: We can predict…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、ブロックチェーンの活用の未来を探る2部構成の作品です\n長文が苦手な方、注目すべきエキサイティングなブロックチェーン・ユーティリティー・プロジェクトを知りたい方は、PT.Iにご期待ください。\n長文が苦手な方や、注目すべきエキサイティングなブロックチェーン・ユーティリティ・プロジェクトを知りたい方は、来週か再来週中に公開されるPT.IIにご期待ください。\nにご期待ください（来週か再来週に公開予定）。)\n\nTLDR: 私たちは予測できる...",
      "title": "ユーティリティ時代の幕開け：ブロックチェーンが世界を変える"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一篇由两部分组成的文章，探讨了利用区块链的未来。\n技术的未来，如果你不喜欢长篇大论，想知道有哪些令人兴奋的\n区块链实用项目，请继续关注PT.II，它将在未来一两周内发布。\n将在未来一两个星期内发布)\n\nTLDR：我们可以预测...",
      "title": "公用事业时代的到来：区块链将如何颠覆世界"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一篇由兩部分組成的文章，探討了利用區塊鏈的未來。\n技術的未來，如果你不喜歡長篇大論，想知道有哪些令人興奮的\n區塊鏈實用項目，請繼續關注PT.II，它將在未來一兩週內發佈。\n將在未來一兩個星期內發佈)\n\nTLDR：我們可以預測...",
      "title": "公用事業時代的到來：區塊鏈將如何顛覆世界"
    }
  ]
}