{
  "author": "dondurmalikazandibi",
  "original_created_utc": 1651574258,
  "title": "Why shirtless Chris Hemsworth full of sexy masculinity is fine but Scarlett Johansson in close-fitting dress full of sexy femininity is \"sexualising\" \"objectification\" and a negative thing?",
  "created_utc": 1651586883,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I really can not grasp my head around this extremely popular things. I mean people want to see most attractive things on screen. And anytime I mention this I get a massive backlash with 0 explanation of &amp;quot;how and why&amp;quot; that involves both sides.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 136,
  "permalink": "/r/TooAfraidToAsk/comments/uhd6vt/why_shirtless_chris_hemsworth_full_of_sexy/",
  "subreddit": "TooAfraidToAsk",
  "id": "uhd6vt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I really can not grasp my head around this extremely popular things. I mean\npeople want to see most attractive things on screen. And anytime I mention this\nI get a massive backlash with 0 explanation of \"how and why\" that involves both\nsides.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この超人気商品には、本当に頭が上がりません。つまり\n人々はスクリーン上で最も魅力的なものを見たいと思うのです。そして、私がこのことを話すと、いつでも\nという説明もなく、大反発を食らいます。\nの両側から。",
      "title": "なぜ、シャツを着ていないクリス・ヘムズワースのセクシーな男らしさは良くて、ぴったりしたドレスを着たスカーレット・ヨハンソンのセクシーな女らしさは「セクシュアル」「オブジェクト化」とネガティブなことなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的无法掌握我对这个极其流行的东西的看法。我的意思是\n人们希望在屏幕上看到最有吸引力的东西。而无论何时我提到这个\n我都会得到一个巨大的反击，对 \"如何和为什么 \"没有任何解释，这涉及到双方。\n双方。",
      "title": "为什么不穿衣服的克里斯-海姆斯沃斯充满了性感的阳刚之气，而穿着贴身衣服的斯嘉丽-约翰逊充满了性感的阴柔之气，是 \"性化\"\"物化\"，是负面的东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的無法掌握我對這個極其流行的東西的看法。我的意思是\n人們希望在屏幕上看到最有吸引力的東西。而無論何時我提到這個\n我都會得到一個巨大的反擊，對 \"如何和爲什麼 \"沒有任何解釋，這涉及到雙方。\n雙方。",
      "title": "爲什麼不穿衣服的克里斯-海姆斯沃斯充滿了性感的陽剛之氣，而穿着貼身衣服的斯嘉麗-約翰遜充滿了性感的陰柔之氣，是 \"性化\"\"物化\"，是負面的東西？"
    }
  ]
}