{
  "author": "Supercharmeleon",
  "original_created_utc": 1637605107,
  "title": "Don't get your family/friends into crypto unless they specifically asked you without your prompting.",
  "created_utc": 1637613056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s not worth it, trust me. Any gains they make will be their own accomplishment and any losses will be all your fault. Moreover, I&#39;m of the opinion that you definitely don&#39;t want to be the &quot;crypto guy&quot; in your family or friend group, for many reasons. First, you probably won&#39;t endear yourself to anyone unless they&#39;re greedy, and second I feel like crypto isn&#39;t that great a topic to talk about all the time, but that&#39;s just me.</p>\n\n<p>Overall this is just a warning. I&#39;ve had it happen to me, and I&#39;m sure a lot of other people have as well.</p>\n\n<p>Keep your crypto a secret unless people ask for it. Just go on with your life and do your thing and secretly keep earning that magic internet money we all love so much.</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/CryptoCurrency/comments/qzrvkq/dont_get_your_familyfriends_into_crypto_unless/",
  "subreddit": "CryptoCurrency",
  "id": "qzrvkq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's not worth it, trust me. Any gains they make will be their own\naccomplishment and any losses will be all your fault. Moreover, I'm of the\nopinion that you definitely don't want to be the \"crypto guy\" in your family or\nfriend group, for many reasons. First, you probably won't endear yourself…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その価値はありません、信じてください。彼らが得た利益は彼ら自身の功績となり\n達成され、損失はすべてあなたの責任になります。さらに、私の考えでは\n家族や友人の中で「暗号男」になるのは絶対に避けた方がいいと思います。\n理由はいくつかあります。第一に、あなたはおそらく、自分自身に愛着を持てないでしょう...",
      "title": "家族や友人を暗号化に参加させるのは、彼らが特にあなたに促されない限りやめておきましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是不值得的，相信我。他们的任何收益都是他们自己的\n的成就，任何损失都是你的错。此外，我认为\n我认为，你绝对不想成为你家庭或朋友圈中的 \"加密人\"。\n朋友圈里的 \"加密人\"，原因有很多。首先，你可能不会让自己喜欢上...",
      "title": "不要让你的家人/朋友进入加密货币，除非他们在没有你的提示下特别问你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是不值得的，相信我。他們的任何收益都是他們自己的\n的成就，任何損失都是你的錯。此外，我認爲\n我認爲，你絕對不想成爲你家庭或朋友圈中的 \"加密人\"。\n朋友圈裏的 \"加密人\"，原因有很多。首先，你可能不會讓自己喜歡上...",
      "title": "不要讓你的家人/朋友進入加密貨幣，除非他們在沒有你的提示下特別問你。"
    }
  ]
}