{
  "author": "SusanaChavarin",
  "original_created_utc": 1637248815,
  "title": "Getting crypto advice from Reddit doesn’t really help noobs",
  "created_utc": 1637260253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am new to investing in cryptocurrency and I have been searching the internet for advice. I don’t really have people I know that are into this thing so I don’t really have anyone to ask about it. Facebook is hopeless. There’s no real advice or anything. Sometimes I feel like I might get scammed if I try to interact with the posts.</p>\n\n<p>There’s a lot on Youtube, but some of them are kind of hard to digest imo. Or maybe I am just searching for videos the wrong way that’s why I’m not getting anything. They provide detailed explanations, sure. But they’re using complicated terms and some of them don’t even explain what those words mean. Also I’ve seen a post here before about avoiding getting advice from crypto youtubers.</p>\n\n<p>There’s a lot of advice here on Reddit, but that’s exactly what my problem is. There’s just so much that I don’t know how to process them because I am not that knowledgeable about it. It’s hard to understand because the terms are new to me. It’s like I’m reading something in a different language lol</p>\n\n<p>I tried going for the subs that are related to the apps that I installed or websites that I recently checked out to buy or trade. There’s <a href=\"/r/Bybit\">r/Bybit</a>, <a href=\"/r/binance\">r/binance</a>, and the likes. But most of the posts there are just people having issues and the experiences from other people makes me anxious and feel discouraged.</p>\n\n<p>Most posts from noobs seeking advice or help have comments that aren’t really helpful and just confuses me even more. I really want to start investing in crypto to diversify my portfolio but I feel like Reddit isn’t the place for me to find the answers that I need.</p>\n</div><!-- SC_ON -->",
  "score": 285,
  "permalink": "/r/CryptoCurrency/comments/qws02b/getting_crypto_advice_from_reddit_doesnt_really/",
  "subreddit": "CryptoCurrency",
  "id": "qws02b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am new to investing in cryptocurrency and I have been searching the internet\nfor advice. I don’t really have people I know that are into this thing so I\ndon’t really have anyone to ask about it. Facebook is hopeless. There’s no real\nadvice or anything. Sometimes I feel like I might get scammed if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号通貨に投資するのは初めてで、インターネットで検索していると\nアドバイスを求めています。私の知り合いには、このことに夢中になっている人がいないので\n相談する相手がいないんだ。Facebookは絶望的です。アドバイスも何もありません。\nアドバイスも何もない。時々、詐欺に遭ったのではないかと思うことがあります...。",
      "title": "Redditで暗号化のアドバイスを受けても、初心者には役に立たない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是投资加密货币的新手，我一直在网上搜索\n征求意见。我没有真正认识的人进入这个领域，所以我\n所以我真的没有人可以问它。Facebook是没有希望的。没有真正的\n建议或任何东西。有时我觉得我可能被骗了，如果...",
      "title": "从Reddit获得加密建议并不能真正帮助新手"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是投資加密貨幣的新手，我一直在網上搜索\n徵求意見。我沒有真正認識的人進入這個領域，所以我\n所以我真的沒有人可以問它。Facebook是沒有希望的。沒有真正的\n建議或任何東西。有時我覺得我可能被騙了，如果...",
      "title": "從Reddit獲得加密建議並不能真正幫助新手"
    }
  ]
}