{
  "author": "Porkadi110",
  "original_created_utc": 1639456276,
  "title": "Was Nancy Reagan really renown for performing oral sex in her days as a film actress?",
  "created_utc": 1639462252,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand that this question is rather uncouth, but in light of current events I have become curious as to the validity of rumors of Nancy Reagan&amp;#39;s past sexual exploits that have been recently floating around Twitter and beyond. To my knowledge most of these rumors have their roots in Kitty Kelly&amp;#39;s 1991 book &lt;em&gt;Nancy Reagan: The Unauthorized Biography&lt;/em&gt;, but how much verifiable truth is there to the claims made in this book?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/rfz7ek/was_nancy_reagan_really_renown_for_performing/",
  "subreddit": "AskHistorians",
  "id": "rfz7ek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that this question is rather uncouth, but in light of current\nevents I have become curious as to the validity of rumors of Nancy Reagan's past\nsexual exploits that have been recently floating around Twitter and beyond. To\nmy knowledge most of these rumors have their roots in Kitty…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような質問は野暮なのは承知しておりますが、現在の状況を鑑みると\nナンシー・レーガンの過去の噂の真偽が気になるところです。\n最近、ツイッターなどで話題になっている、性的搾取について。最近\n私の知る限り、これらの噂のほとんどは、キティちゃんをルーツとしています。",
      "title": "ナンシー・レーガンは、映画女優時代にオーラル・セックスをしていたことで有名だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这个问题相当不礼貌，但鉴于当前的事件\n我很好奇关于南希-里根过去的传言是否属实。\n最近在推特和其他地方流传的关于南希-里根过去的性行为的传言是否属实。据我所知\n据我所知，这些传言的根源在于小鹰......",
      "title": "南希-里根在当电影演员的时候真的是以口交闻名吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這個問題相當不禮貌，但鑑於當前的事件\n我很好奇關於南希-里根過去的傳言是否屬實。\n最近在推特和其他地方流傳的關於南希-里根過去的性行爲的傳言是否屬實。據我所知\n據我所知，這些傳言的根源在於小鷹......",
      "title": "南希-里根在當電影演員的時候真的是以口交聞名嗎？"
    }
  ]
}