{
  "author": "gnarley_quinn",
  "original_created_utc": 1639131788,
  "title": "How would you react if you discovered that you profited directly from another user here? And that user was now ruined.",
  "created_utc": 1639171981,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Suspend belief and probability for a moment, and imagine a scenario. &lt;/p&gt;\n\n&lt;p&gt;You have invested into a coin, lets call it WET coin, so people don&amp;#39;t think I&amp;#39;m shilling. &lt;/p&gt;\n\n&lt;p&gt;WET has been cruising along for a few weeks when suddenly a major announcement sends the price soaring. You thought there was a possibility of a good gain, say, 5X. But the price is moving past 30x right now, and still climbing. Momentum builds and more investors pile in. The subreddit sees thousands of new users - some of them new to crypto. As a veteran of the coin you even offer some opinions of your own.&lt;/p&gt;\n\n&lt;p&gt;Buy-ins and FOMO continue and now you are looking at a more than 500x on your investment. &lt;/p&gt;\n\n&lt;p&gt;But then, tragedy. The announcement was fake. Nothing is happening, and there is no possibility that it will ever happen. The price drops. And it continues to drop. &lt;/p&gt;\n\n&lt;p&gt;Screams of HODL and Buy the Dip echo across multiple subs, but staring down the possibility of losing a major gain, you decide to sell. You sell it all and take pride in your massive gain - roughly 350x your initial investment. You have done nothing wrong, you did your DD on a project and timed the market reasonably well. &lt;/p&gt;\n\n&lt;p&gt;A few days pass and the price is still falling its now back to around the 10x from your original investment - a drop of 98% from its ATH. You feel justified and calm buy your decision making. You also still have some faith in the project, so you decide to put your original investment back in at the new price. The price appears to stabilise now and you seem to have done well, ready for a new pump in several years, if it ever happens. &lt;/p&gt;\n\n&lt;p&gt;Then one thing happens that completely floors you. A post from a user on reddit catches your eye. Its a new investor who has lost big on WET. Down 97% on his original investment. He appears to have legitimately lost most of his life savings, and his family doesn&amp;#39;t yet know about it. Users are hounding him about being so reckless. But something else startles you particularly. You recognise the name. It is a user that you have previously provided advice to - bad advice. More than that, the price he bought into WET at was exactly the same price you sold it for. &lt;/p&gt;\n\n&lt;p&gt;It strikes you that, that the exact amount of this users loss is the same amount as your profit. You have done nothing wrong, and even that user likely knows that. &lt;/p&gt;\n\n&lt;p&gt;WET has made you rich, but at the cost of another family&amp;#39;s wellbeing. So, what do you do? Do you reveal the connection? Do you reach out? Do you smile and laugh maniacally? &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;TLDR: You get rich of a coin, and then discover another redditor here has lost everything by the same amount. What do you do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/rd5ptk/how_would_you_react_if_you_discovered_that_you/",
  "subreddit": "CryptoCurrency",
  "id": "rd5ptk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Suspend belief and probability for a moment, and imagine a scenario.\n\nYou have invested into a coin, lets call it WET coin, so people don't think I'm\nshilling.\n\nWET has been cruising along for a few weeks when suddenly a major announcement\nsends the price soaring. You thought there was a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "信念と確率をいったん保留して、あるシナリオを想像してみてください。\n\nあなたは、あるコインに投資しています。\nシリングする。\n\nWETは数週間、順調に推移していましたが、突然、重大な発表があり\n価格が高騰している。あなたは、「これは...」と思いました。",
      "title": "もし、あなたがここで他のユーザーから直接利益を得ていたことを発見したら、どのように反応しますか？そして、そのユーザーは今、破滅した。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "暂时搁置信仰和概率，想象一个场景。\n\n你投资了一个硬币，我们称之为WET硬币，这样人们就不会认为我在\n骗人的。\n\nWET已经运行了几周，突然一个重大的消息宣布\n使得价格飙升。你认为有一个...",
      "title": "如果你发现你直接从这里的另一个用户那里获利，你会如何反应？而那个用户现在被毁了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "暫時擱置信仰和概率，想象一個場景。\n\n你投資了一個硬幣，我們稱之爲WET硬幣，這樣人們就不會認爲我在\n騙人的。\n\nWET已經運行了幾周，突然一個重大的消息宣佈\n使得價格飆升。你認爲有一個...",
      "title": "如果你發現你直接從這裏的另一個用戶那裏獲利，你會如何反應？而那個用戶現在被毀了。"
    }
  ]
}