{
  "author": "FredrickandNeval",
  "original_created_utc": 1645978066,
  "title": "Bitcoin pools should NOT block Russian users. The entire point of the network is to be decentralized regardless of current situation.",
  "created_utc": 1645997694,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Miners are what keep the network alive. Regardless of the current situation the network should not be degraded or disconnected for Russian users.&lt;/p&gt;\n\n&lt;p&gt;Russian civilian&amp;#39;s don&amp;#39;t want a war. It&amp;#39;s unlikely Russia government is using the BTC network anyway.&lt;/p&gt;\n\n&lt;p&gt;I too take Ukraine side in this disgusting act by Putin but we must maintain integrity of the Bitcoin network.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Edit&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;To clarify it has been reported that some cryptocurrency pools are blocking access to Russia. This is not solely limited to just BTC.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Edit 2&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Just to be clear. I know exactly how the network works. I&amp;#39;m stating freely and clearly that all pools should remain online and active for everyone and not to impose any restrictions as to retain the integrity of crypto currency.&lt;/p&gt;\n\n&lt;p&gt;As a pool owner you should NOT be making choices based of political decisions that may deliberately prevent end users from using the service.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/Bitcoin/comments/t2rdpx/bitcoin_pools_should_not_block_russian_users_the/",
  "subreddit": "Bitcoin",
  "id": "t2rdpx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Miners are what keep the network alive. Regardless of the current situation the\nnetwork should not be degraded or disconnected for Russian users.\n\nRussian civilian's don't want a war. It's unlikely Russia government is using\nthe BTC network anyway.\n\nI too take Ukraine side in this disgusting act by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マイナーは、ネットワークを維持するための存在です。現状がどうであれ\nロシアのユーザーにとって、ネットワークが低下したり、切断されたりすることはあってはならないことです。\n\nロシアの市民は戦争を望んでいない。ロシア政府が利用することはないだろう。\nBTCのネットワークは、いずれにせよ\n\n私もウクライナ側の人間として、この嫌な行為に...",
      "title": "ビットコインプールはロシア人ユーザーをブロックすべきではない。ネットワークの全体的なポイントは、現在の状況に関係なく、分散化されることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "矿工是维持网络活力的因素。无论目前的情况如何\n网络都不应该对俄罗斯用户进行降级或断开连接。\n\n俄罗斯平民不希望发生战争。俄罗斯政府不太可能使用\nBTC网络。\n\n在这种令人厌恶的行为中，我也站在乌克兰一边。",
      "title": "比特币池不应该阻止俄罗斯用户。无论目前的情况如何，网络的全部意义在于去中心化。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "礦工是維持網絡活力的因素。無論目前的情況如何\n網絡都不應該對俄羅斯用戶進行降級或斷開連接。\n\n俄羅斯平民不希望發生戰爭。俄羅斯政府不太可能使用\nBTC網絡。\n\n在這種令人厭惡的行爲中，我也站在烏克蘭一邊。",
      "title": "比特幣池不應該阻止俄羅斯用戶。無論目前的情況如何，網絡的全部意義在於去中心化。"
    }
  ]
}