{
  "author": "FredrickandNeval",
  "original_created_utc": 1645978066,
  "title": "Bitcoin pools should NOT block Russian users. The entire point of the network is to be decentralized regardless of current situation.",
  "created_utc": 1645997694,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Miners are what keep the network alive. Regardless of the current situation the network should not be degraded or disconnected for Russian users.&lt;/p&gt;\n\n&lt;p&gt;Russian civilian&amp;#39;s don&amp;#39;t want a war. It&amp;#39;s unlikely Russia government is using the BTC network anyway.&lt;/p&gt;\n\n&lt;p&gt;I too take Ukraine side in this disgusting act by Putin but we must maintain integrity of the Bitcoin network.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Edit&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;To clarify it has been reported that some cryptocurrency pools are blocking access to Russia. This is not solely limited to just BTC.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Edit 2&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Just to be clear. I know exactly how the network works. I&amp;#39;m stating freely and clearly that all pools should remain online and active for everyone and not to impose any restrictions as to retain the integrity of crypto currency.&lt;/p&gt;\n\n&lt;p&gt;As a pool owner you should NOT be making choices based of political decisions that may deliberately prevent end users from using the service.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/Bitcoin/comments/t2rdpx/bitcoin_pools_should_not_block_russian_users_the/",
  "subreddit": "Bitcoin",
  "id": "t2rdpx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Miners are what keep the network alive. Regardless of the current situation the\nnetwork should not be degraded or disconnected for Russian users.\n\nRussian civilian's don't want a war. It's unlikely Russia government is using\nthe BTC network anyway.\n\nI too take Ukraine side in this disgusting act by…"
}