{
  "author": "Krystle00",
  "original_created_utc": 1636851045,
  "title": "I’m freaking stoked",
  "created_utc": 1636879396,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I very recently got into crypto. I just started reading about it after my cousin lost a chunk on SHIB. I read words like decentralized and got hooked into wanting to know how it all works. I can’t stop reading and learning and though I’ll never understand the actual process and technology, the ideals and vision are just genuinely freaking awesome. Im sitting here on a Saturday night watching Matt Firestone lectures and texting my mom friends they need to check out Marketcap. </p>\n\n<p>So thank you for this space to learn little bread crumbs that lead to other things. Wishing you all lots of luck!</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/qtea8y/im_freaking_stoked/",
  "subreddit": "CryptoCurrency",
  "id": "qtea8y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I very recently got into crypto. I just started reading about it after my cousin\nlost a chunk on SHIB. I read words like decentralized and got hooked into\nwanting to know how it all works. I can’t stop reading and learning and though\nI’ll never understand the actual process and technology, the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はごく最近、暗号に興味を持ちました。いとこがSHIBで大損した後に読み始めたんです。\n読んだのは、いとこがSHIBで大損した後です。非中央集権的な言葉を読んで、その仕組みを知りたいと思うようになりました。\nその仕組みを知りたいと思うようになりました。読むのと学ぶのをやめられません。\n実際のプロセスや技術を理解することはできませんが・・・。",
      "title": "私はとても興奮しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近才开始接触加密货币。我刚刚开始阅读它，因为我的表弟\n在SHIB上损失了一大笔钱。我读到了去中心化这样的字眼，然后就被迷住了。\n想知道这一切是如何运作的。我无法停止阅读和学习，虽然\n我永远不会理解实际的过程和技术，但...",
      "title": "我被吓坏了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近纔開始接觸加密貨幣。我剛剛開始閱讀它，因爲我的表弟\n在SHIB上損失了一大筆錢。我讀到了去中心化這樣的字眼，然後就被迷住了。\n想知道這一切是如何運作的。我無法停止閱讀和學習，雖然\n我永遠不會理解實際的過程和技術，但...",
      "title": "我被嚇壞了"
    }
  ]
}