{
  "author": "orientsoul",
  "the_new_excerpt": "I have read eastern philosophy and to some extent it has always made me feel\nthat the major difference between EP and WP is about the goal of life and the\nideal life. EP is not bothered with material developments at all. It just wants\npeople to live simple lives with very less needs. Whereas WP…",
  "original_created_utc": 1618460092,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は東洋哲学を読んだことがありますが、ある程度はいつも感じていました。\nEPとWPの大きな違いは、人生のゴールと理想の人生についてだと感じています。\n理想的な人生です。EPは、物質的な発展にはまったく関心がありません。ただ、人々に\n必要最小限のシンプルな生活をしてほしいと思っています。一方、WPは...",
      "title": "西洋哲学と東洋哲学の違いを和解／融合させ、図式化した本を読みたい場合、どのような本を読めばよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读过东方哲学，在某种程度上，它总是让我觉得\nEP和WP的主要区别是关于生活目标和。\n理想的生活。EP对物质的发展根本不屑一顾。它只想\n人们过着简单的生活，需求非常少。而WP...",
      "title": "如果我想读调和/融合并勾勒出中西哲学差异的书，应该读什么书？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀過東方哲學，在某種程度上，它總是讓我覺得\nEP和WP的主要區別是關於生活目標和。\n理想的生活。EP對物質的發展根本不屑一顧。它只想\n人們過着簡單的生活，需求非常少。而WP...",
      "title": "如果我想讀調和/融合並勾勒出中西哲學差異的書，應該讀什麼書？"
    }
  ],
  "title": "What books should I read if I want to read books that reconciles/combines and charts out the differences between western and eastern philosophy?",
  "created_utc": 1618523495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have read eastern philosophy and to some extent it has always made me feel that the major difference between EP and WP is about the goal of life and the ideal life. EP is not bothered with material developments at all. It just wants people to live simple lives with very less needs. Whereas WP tries to advance mankind. This difference might also have to do with the the role of religions in respective regions. Eastern religions like Hinduism, Buddhism were/are extremely liberal and did not have insitutional control at all. Ideas freely flourished. But in West people had to break themselves from the shackles of Christian institutions and the religion itself. This is my current idea of it I might be wrong, but I would love to explore this thought more deeply.</p>\n\n<p>The books should not be about history of western or eastern thought. Rather it should work a bit on conclusions and universals. </p>\n\n<p>I would also love if you guys provide books by both Western and Eastern philosophers. As it would help me see the point from many angles and perspectives.</p>\n\n<p>Thanks in advance.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/mr7cde/what_books_should_i_read_if_i_want_to_read_books/",
  "subreddit": "askphilosophy",
  "id": "mr7cde",
  "is_self": true,
  "media": null,
  "is_video": false
}