{
  "author": "ipetgoat1984",
  "original_created_utc": 1654734618,
  "title": "I’m sick of hearing “climate change” and “Bitcoin” in the same sentence.",
  "created_utc": 1654757309,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The powers that be are just making BTC a patsy for their agenda. There are a lot of other issues they could focus on that have a way larger impact on climate change than BTC. &lt;/p&gt;\n\n&lt;p&gt;Did you see the private jet fleet that flew all the billionaires to Davos? The same people telling you to eat bugs and ban mining are flying around on private jets. Private jet flights produce around 33.7 million metric tons of carbon dioxide a year. Whereas Bitcoin production is estimated to generate between 22 and 22.9 million metric tons of carbon dioxide emissions a year.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/3h2i3qriph491.png?width=1744&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=1945404b910c96980fda8c2695d4f676b1cf61b7\"&gt;The actual fleet of jets at Davos 2022&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So all these people preaching about the impact of mining, better start rolling up on bicycles if they want us to listen. Get off your carbon emission-filled soap boxes, billionaires. In actuality, 100 companies have been the source of more than 70% of the world’s greenhouse gas emissions since 1988.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.businessinsider.com/davos-guests-private-jets-climate-crisis-2020-1\"&gt;Source&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://peri.umass.edu/greenhouse-100-polluters-index-current\"&gt;Source&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 336,
  "permalink": "/r/CryptoCurrency/comments/v8478d/im_sick_of_hearing_climate_change_and_bitcoin_in/",
  "subreddit": "CryptoCurrency",
  "id": "v8478d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The powers that be are just making BTC a patsy for their agenda. There are a lot\nof other issues they could focus on that have a way larger impact on climate\nchange than BTC.\n\nDid you see the private jet fleet that flew all the billionaires to Davos? The\nsame people telling you to eat bugs and ban…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "権力者はBTCを自分たちの思惑通りにしているだけだ。もっと他に\nBTCよりももっと大きな気候変動への影響を持つ、他の問題に焦点を当てることができるはずです。\nBTCよりはるかに大きな影響を与える他の問題がたくさんあります。\n\nダボス会議に参加した億万長者たちを乗せたプライベートジェット機を見たことがありますか？あれは\n虫を食べろとか、禁止しろとか言ってるのと同じ...",
      "title": "気候変動」と「ビットコイン」を同じ文章で聞くのはうんざりです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当权者只是让BTC成为他们议程的替罪羊。有很多\n他们可以关注其他问题，这些问题对气候变化的影响远远大于BTC。\n变化的影响比BTC更大。\n\n你看到所有亿万富翁飞往达沃斯的私人飞机队了吗？这些人\n这些人告诉你要吃虫子和禁止...",
      "title": "我已经厌倦了在同一个句子中听到 \"气候变化 \"和 \"比特币\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當權者只是讓BTC成爲他們議程的替罪羊。有很多\n他們可以關注其他問題，這些問題對氣候變化的影響遠遠大於BTC。\n變化的影響比BTC更大。\n\n你看到所有億萬富翁飛往達沃斯的私人飛機隊了嗎？這些人\n這些人告訴你要喫蟲子和禁止...",
      "title": "我已經厭倦了在同一個句子中聽到 \"氣候變化 \"和 \"比特幣\"。"
    }
  ]
}