{
  "author": "polloponzi",
  "original_created_utc": 1642125084,
  "title": "Fidelity is one of the largest asset managers in the world with $4.9 trillion in assets under management. They wrote this:",
  "created_utc": 1642135759,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;We also think there is very high stakes game theory at play here, whereby if bitcoin adoption increases, the countries that secure some bitcoin today will be better off competitively than their peers. Therefore, even if other countries do not believe in the investment thesis or adoption of bitcoin, they will be forced to acquire some as a form of insurance. In other words, a small cost can be paid today as a hedge compared to a potentially much larger cost years in the future. &lt;strong&gt;We therefore wouldn&amp;#39;t be surprised to see other sovereign nation states acquire bitcoin in 2022 and perhaps even see a central bank make an acquisition.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Source: &lt;a href=\"https://www.fidelitydigitalassets.com/articles/2021-trends-impact\"&gt;https://www.fidelitydigitalassets.com/articles/2021-trends-impact&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 358,
  "permalink": "/r/CryptoCurrency/comments/s3fzes/fidelity_is_one_of_the_largest_asset_managers_in/",
  "subreddit": "CryptoCurrency",
  "id": "s3fzes",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "> We also think there is very high stakes game theory at play here, whereby if\n> bitcoin adoption increases, the countries that secure some bitcoin today will\n> be better off competitively than their peers. Therefore, even if other\n> countries do not believe in the investment thesis or adoption of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> また、非常に高い確率でゲーム理論が作用していると考えています。\n> ビットコインの普及が進むと、現在ビットコインをある程度確保している国々が\n> 競争上、同業他社より有利になる。そのため、たとえ他の\n> 投資論や採用を信じない国...",
      "title": "フィデリティは、運用資産4.9兆ドルという世界最大級の資産運用会社です。彼らはこう書いている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 我们也认为这里有非常高风险的博弈理论在起作用，即如果\n> 比特币的应用增加，今天确保一些比特币的国家将\n> 在竞争中会比他们的同行更有优势。因此，即使其他\n> 国家不相信这个投资理论或采用...",
      "title": "富达公司是世界上最大的资产管理公司之一，管理着4.9万亿美元的资产。他们这样写道。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 我們也認爲這裏有非常高風險的博弈理論在起作用，即如果\n> 比特幣的應用增加，今天確保一些比特幣的國家將\n> 在競爭中會比他們的同行更有優勢。因此，即使其他\n> 國家不相信這個投資理論或採用...",
      "title": "富達公司是世界上最大的資產管理公司之一，管理着4.9萬億美元的資產。他們這樣寫道。"
    }
  ]
}