{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "We all know that trying to time the market is a losing game. However, ironically, I often see the advice to \"DCA your investment into the market over X period.\" This is irrational advice. The example below illustrates why using DCA is illogical.\n\n[EDIT]: In the context of this post, I'm talking about the scenario of deciding how to handle a windfall (cash bonus, home sale, inheritance, etc). When I say\" DCA\" I mean the concept of investing that windfall slowly over time. I am NOT talking about a regular contribution from a monthly paycheck, etc. I am certainly not suggesting building up a lump sum prior to investing - quite the opposite - I'm advocating to get cash in the market as early as possible so that you maximize the time for growth.\n[/EDIT]\n\nDCA is inherently trying to time the market, and missing out on returns because of it. The key mental exercise to realize this is to understand that (ignoring taxes) a \"cash\" position and a \"fully invested\" position are equavlent starting positions. With a button click, cash and stocks are instantly interchangeable. Let's look at an example. Sam has $100k in his 401k, fully invested. Joe has $100k cash in his 401k, and is trying to decide what to do with it. Let's start with Sam. Sam says, \"I'm nervous about the market. Should I sell my whole portfolio and then DCA it back in over the next 12 months to reduce my risk?\" The answer is no. We have a pretty good understanding that panic selling and sitting on cash tends to result in missing out on returns. It's better to ride the market out. Nobody know if it will go up or down, but we're confident it will go up in the long run, so ride it out.\n\nNow let's talk about Joe. For some strange reason, some people change their philosophy when it comes to Joe, just because his funds are currently cash. However, we know with a simple button click Joe could instantly be in the same position as Sam, and Sam could instantly be in the same position as Joe. So, why should their strategies be different? Their risk exposure, risk/reward tolerance, and investment goals are identical. Therefore, they shouldn't be constrained by their \"starting position\" because they each have their CHOICE of starting position. Logically, their strategies should be the same. Therefore, if it's best for Sam to stay invested and not pull out trying to time the market, then it's also best for Joe to lump sum into the market. \n\nDCA is just as much of a \"timing the market\" startegy as selling during a downturn. Anyone who advises Sam to \"hold\" and Joe to \"DCA\" is giving irrational advice. Sam and Joe each have the ability to copy each other's positions by simply selling or buying, respectively. Therfore, whichever position is \"better\" should be the position they both choose. And we know that to achieve returns, it's better to be invested than not invested. Therefore, both Sam and Joe should choose to be fully (and stay fully invested) to achieve their goals. Trying to time the market is a losing proposition for both of them, even though we sometimes disguise it under the term \"dollar cost averaging\".",
  "author_fullname": "t2_9xjajdq5",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "A mental exercise to realize the folly of dollar cost averaging (DCA)",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_ttpjz7",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.63,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 23,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": "",
  "secure_media_embed": {},
  "link_flair_text": "Investment Theory",
  "can_mod_post": false,
  "score": 23,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1648843334,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1648816340,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We all know that trying to time the market is a losing game. However, ironically, I often see the advice to &amp;quot;DCA your investment into the market over X period.&amp;quot; This is irrational advice. The example below illustrates why using DCA is illogical.&lt;/p&gt;\n\n&lt;p&gt;[EDIT]: In the context of this post, I&amp;#39;m talking about the scenario of deciding how to handle a windfall (cash bonus, home sale, inheritance, etc). When I say&amp;quot; DCA&amp;quot; I mean the concept of investing that windfall slowly over time. I am NOT talking about a regular contribution from a monthly paycheck, etc. I am certainly not suggesting building up a lump sum prior to investing - quite the opposite - I&amp;#39;m advocating to get cash in the market as early as possible so that you maximize the time for growth.\n[/EDIT]&lt;/p&gt;\n\n&lt;p&gt;DCA is inherently trying to time the market, and missing out on returns because of it. The key mental exercise to realize this is to understand that (ignoring taxes) a &amp;quot;cash&amp;quot; position and a &amp;quot;fully invested&amp;quot; position are equavlent starting positions. With a button click, cash and stocks are instantly interchangeable. Let&amp;#39;s look at an example. Sam has $100k in his 401k, fully invested. Joe has $100k cash in his 401k, and is trying to decide what to do with it. Let&amp;#39;s start with Sam. Sam says, &amp;quot;I&amp;#39;m nervous about the market. Should I sell my whole portfolio and then DCA it back in over the next 12 months to reduce my risk?&amp;quot; The answer is no. We have a pretty good understanding that panic selling and sitting on cash tends to result in missing out on returns. It&amp;#39;s better to ride the market out. Nobody know if it will go up or down, but we&amp;#39;re confident it will go up in the long run, so ride it out.&lt;/p&gt;\n\n&lt;p&gt;Now let&amp;#39;s talk about Joe. For some strange reason, some people change their philosophy when it comes to Joe, just because his funds are currently cash. However, we know with a simple button click Joe could instantly be in the same position as Sam, and Sam could instantly be in the same position as Joe. So, why should their strategies be different? Their risk exposure, risk/reward tolerance, and investment goals are identical. Therefore, they shouldn&amp;#39;t be constrained by their &amp;quot;starting position&amp;quot; because they each have their CHOICE of starting position. Logically, their strategies should be the same. Therefore, if it&amp;#39;s best for Sam to stay invested and not pull out trying to time the market, then it&amp;#39;s also best for Joe to lump sum into the market. &lt;/p&gt;\n\n&lt;p&gt;DCA is just as much of a &amp;quot;timing the market&amp;quot; startegy as selling during a downturn. Anyone who advises Sam to &amp;quot;hold&amp;quot; and Joe to &amp;quot;DCA&amp;quot; is giving irrational advice. Sam and Joe each have the ability to copy each other&amp;#39;s positions by simply selling or buying, respectively. Therfore, whichever position is &amp;quot;better&amp;quot; should be the position they both choose. And we know that to achieve returns, it&amp;#39;s better to be invested than not invested. Therefore, both Sam and Joe should choose to be fully (and stay fully invested) to achieve their goals. Trying to time the market is a losing proposition for both of them, even though we sometimes disguise it under the term &amp;quot;dollar cost averaging&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "039ac088-6c0f-11ec-9e3f-2294c5b4c8da",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "call_to_action": "",
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ffd635",
  "id": "ttpjz7",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Dubs13151",
  "discussion_type": null,
  "num_comments": 74,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/",
  "subreddit_subscribers": 151688,
  "created_utc": 1648850642,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1648816340,
  "the_new_excerpt": "We all know that trying to time the market is a losing game. However,\nironically, I often see the advice to \"DCA your investment into the market over\nX period.\" This is irrational advice. The example below illustrates why using\nDCA is illogical.\n\n[EDIT]: In the context of this post, I'm talking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、市場のタイミングを計ろうとすることが負けゲームであることを知っています。しかし\n皮肉なことに、「DCAで市場に投資しなさい」というアドバイスをよく見かけます。\nX期間\" これは非合理的なアドバイスです。以下の例は、なぜ\nDCAは非論理的である。\n\n[編集]: この記事の文脈では、私は...",
      "title": "ドルコスト平均法(DCA)の愚かさを実感する頭の体操"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道，试图把握市场时机是一个失败的游戏。然而。\n具有讽刺意味的是，我经常看到这样的建议：\"在X年的时间里，将你的投资投向市场的DCA\nX期间\"。这是不理性的建议。下面的例子说明了为什么使用\nDCA是不符合逻辑的。\n\n[编辑]。在这个帖子的上下文中，我在说...",
      "title": "认识美元成本平均法（DCA）的愚蠢的心理练习"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道，試圖把握市場時機是一個失敗的遊戲。然而。\n具有諷刺意味的是，我經常看到這樣的建議：\"在X年的時間裏，將你的投資投向市場的DCA\nX期間\"。這是不理性的建議。下面的例子說明了爲什麼使用\nDCA是不符合邏輯的。\n\n[編輯]。在這個帖子的上下文中，我在說...",
      "title": "認識美元成本平均法（DCA）的愚蠢的心理練習"
    }
  ],
  "source_updated_at": 1649410974693
}