{
  "author": "AverageStudent1",
  "original_created_utc": 1630699820,
  "title": "Crypto will be bigger than what we've ever witnessed. There's a reason huge financial institutions and other big players are loading their bags. IT'S. NOT. TOO. LATE",
  "created_utc": 1630719185,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a lot of FUD regarding crypto recently, especially during the dip where you could get that spicy ETH for 1700$. Are you forgetting that the big players are loading their bags this time around? We&#39;ve seen a massive increase of financial institutions investing an insane amount in crypto just THIS YEAR ALONE, do you think they would&#39;ve done that if this shit was a scam, according to mr. Trump? </p>\n\n<p>There should be no doubt that crypto is set up for a gigantic explosion in price, so don&#39;t give me that &quot;it&#39;s too late&quot; type of shit. We don&#39;t know when it will happen, but with so many big players in the game now, it will be bigger than what we&#39;ve ever seen before.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/phcurv/crypto_will_be_bigger_than_what_weve_ever/",
  "subreddit": "CryptoCurrency",
  "id": "phcurv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen a lot of FUD regarding crypto recently, especially during the dip\nwhere you could get that spicy ETH for 1700$. Are you forgetting that the big\nplayers are loading their bags this time around? We've seen a massive increase\nof financial institutions investing an insane amount in crypto just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、特にディップ時には、暗号に関するFUDを多く目にしました。\n1700ドルでスパイシーなETHを手に入れることができました。あなたは、大規模な\n今回は、大手のプレイヤーが荷物を積んでいることを忘れていませんか？膨大な量の投資をする金融機関が増えています。\n金融機関が非常に多くの額を暗号に投資しているのを見て...",
      "title": "暗号は、これまでに目撃したことがないほど大きくなるでしょう。巨大な金融機関やその他の大手企業が荷物を積んでいるのには理由があります。それは not。TOO. 遅い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近看到了很多关于加密货币的恐惧症，尤其是在下跌的时候\n你可以用1700美元买到辛辣的ETH。你是不是忘了，大公司这次\n你是否忘记了大玩家们这次是在装袋？我们已经看到了一个巨大的增长\n金融机构对加密货币的投资大量增加，只是...",
      "title": "加密货币将比我们所见过的更大。巨大的金融机构和其他大公司正在装入他们的袋子，这是一个原因。它是。不是。太晚了。晚了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近看到了很多關於加密貨幣的恐懼症，尤其是在下跌的時候\n你可以用1700美元買到辛辣的ETH。你是不是忘了，大公司這次\n你是否忘記了大玩家們這次是在裝袋？我們已經看到了一個巨大的增長\n金融機構對加密貨幣的投資大量增加，只是...",
      "title": "加密貨幣將比我們所見過的更大。巨大的金融機構和其他大公司正在裝入他們的袋子，這是一個原因。它是。不是。太晚了。晚了"
    }
  ]
}