{
  "author": "Psychological-Ad1433",
  "original_created_utc": 1639518363,
  "title": "Someone burned a bridge today",
  "created_utc": 1639583557,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Most people likely turned to the interwebs immediately today to see what was happening with their crypto investments suddenly spiking in price. These people are like many of us. Humanity however, is a spectrum. &lt;/p&gt;\n\n&lt;p&gt;There has to be at least one true believer among the millions of crypto holders who believes so devoutly in his investment that the dopamine hit fired right past reason and manifested itself as rage. &lt;/p&gt;\n\n&lt;p&gt;A text message was sent or maybe even a phone call was made telling their employer how they really feel. &lt;/p&gt;\n\n&lt;p&gt;As the fog fades they probably thought about seeing how others were celebrating and finally opened a social media app to check. In the following moments a feeling of shock sets in. &lt;/p&gt;\n\n&lt;p&gt;Double checking occurs. A realization is born and in the afterglow one of us out there is currently contemplating some heavy thoughts. &lt;/p&gt;\n\n&lt;p&gt;This is for them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/rgi621/someone_burned_a_bridge_today/",
  "subreddit": "CryptoCurrency",
  "id": "rgi621",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Most people likely turned to the interwebs immediately today to see what was\nhappening with their crypto investments suddenly spiking in price. These people\nare like many of us. Humanity however, is a spectrum.\n\nThere has to be at least one true believer among the millions of crypto holders\nwho…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、ほとんどの人がすぐにインターネットにアクセスして、何が起こっているのかを確認したことでしょう。\n投資していた暗号通貨が突然の価格高騰に見舞われました。これらの人々は\nは、私たちの多くと同じです。しかし、人類はスペクトラムである。\n\n数百万人の暗号保有者の中に、少なくとも一人は真の信奉者がいるはずです。\n誰が...",
      "title": "今日、誰かが橋を燃やした"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数人今天可能立即转向互联网，看看他们的加密货币投资价格突然飙升是怎么回事。\n他们的加密货币投资价格突然飙升，发生了什么。这些人\n就像我们中的许多人一样。然而，人类是一个光谱。\n\n在数以百万计的加密货币持有者中，至少有一个真正的信仰者\n他们...",
      "title": "今天有人烧了一座桥"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數人今天可能立即轉向互聯網，看看他們的加密貨幣投資價格突然飆升是怎麼回事。\n他們的加密貨幣投資價格突然飆升，發生了什麼。這些人\n就像我們中的許多人一樣。然而，人類是一個光譜。\n\n在數以百萬計的加密貨幣持有者中，至少有一個真正的信仰者\n他們...",
      "title": "今天有人燒了一座橋"
    }
  ]
}