{
  "author": "PlasticStructure166",
  "original_created_utc": 1644191383,
  "title": "How can we trust therapists' to help us if their job depends on us needing help?",
  "created_utc": 1644205505,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s too risky to just assume all therapists have pure intentions&lt;/p&gt;\n\n&lt;p&gt;It only makes sense therapists don&amp;#39;t give you solutions right away, but tip toe around it to prolong sessions as long as possible, and keep you coming back. And it doesn&amp;#39;t help that all the therapists I&amp;#39;ve spoken appear to confirm my suspicion.&lt;/p&gt;\n\n&lt;p&gt;Or is everyone already aware of this, but just accept it because waiting a long time for a solution is better than never finding a solution at all? If so, that&amp;#39;s messed up&lt;/p&gt;\n\n&lt;p&gt;Also, I know there isn&amp;#39;t one clear cut solution for mental issues. But there are usually always small solutions for specific issues you&amp;#39;re facing at the moment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/smbfxc/how_can_we_trust_therapists_to_help_us_if_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "smbfxc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's too risky to just assume all therapists have pure intentions\n\nIt only makes sense therapists don't give you solutions right away, but tip toe\naround it to prolong sessions as long as possible, and keep you coming back. And\nit doesn't help that all the therapists I've spoken appear to confirm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべてのセラピストが純粋な意思を持っていると考えるのは、あまりにも危険なことです。\n\nセラピストがすぐに解決策を与えず、小細工をするのは理にかなっています。\nセッションをできるだけ長引かせ、リピーターになってもらうためです。そして\n私が話したすべてのセラピストが確認するようであることは助けにならない...",
      "title": "もしセラピストの仕事が、私たちが助けを必要としているかどうかにかかっているとしたら、私たちはどうやってセラピストを信頼することができるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设所有治疗师都有纯洁的意图，这太冒险了。\n\n治疗师不马上给你解决方案，而是在你的问题上蹑手蹑脚，这才有意义。\n绕过它，尽可能延长治疗时间，并让你继续回来。而且\n所有与我交谈过的治疗师似乎都确认......这一点也没有帮助。",
      "title": "如果治疗师的工作取决于我们是否需要帮助，我们怎么能相信他们会帮助我们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設所有治療師都有純潔的意圖，這太冒險了。\n\n治療師不馬上給你解決方案，而是在你的問題上躡手躡腳，這纔有意義。\n繞過它，儘可能延長治療時間，並讓你繼續回來。而且\n所有與我交談過的治療師似乎都確認......這一點也沒有幫助。",
      "title": "如果治療師的工作取決於我們是否需要幫助，我們怎麼能相信他們會幫助我們？"
    }
  ]
}