{
  "author": "KAX1107",
  "original_created_utc": 1631543837,
  "title": "CNBC, Reuters, Newswire, Yahoo reported fake news with fake quote from Walmart without doing any verification",
  "created_utc": 1631551041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>All these media outlets instantly pounced on the fake story. None of them cared to verify the source.</p>\n\n<p>News media has become utter trash. Not just crypto news media. There is not a single reputable source anymore. Nobody has an ounce of reputation. Let this be a good reminder to never buy the news.</p>\n\n<p>The need to farm clicks by getting out the story first has turned every news media organization unreliable.</p>\n\n<p>I thought it was very odd Walmart would pick Litecoin for payments instead of BTC lightning. It didn&#39;t make any sense. This could easily be some Litecoin insider pump and dump. If you think whether regulations are needed or not it&#39;s definitely coming now.</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/pngqj2/cnbc_reuters_newswire_yahoo_reported_fake_news/",
  "subreddit": "CryptoCurrency",
  "id": "pngqj2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "All these media outlets instantly pounced on the fake story. None of them cared\nto verify the source.\n\nNews media has become utter trash. Not just crypto news media. There is not a\nsingle reputable source anymore. Nobody has an ounce of reputation. Let this be\na good reminder to never buy the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらのメディアは、即座にフェイクストーリーに飛びつきました。誰も気にせず\nソースを確認しようともしなかった。\n\nニュースメディアは全くのゴミと化している。暗号のニュースメディアだけではない。評判の良いソースは一つもありません。\n評判の良いソースはもう一つもありません。誰も評判のかけらもありません。これを機会に\n買ってはいけないということを思い知らされました...",
      "title": "CNBC、Reuters、Newswire、Yahooは、Walmartからの偽の引用を含むフェイクニュースを、何の検証も行わずに報道しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有这些媒体都立即扑向了这个假新闻。他们中没有人关心\n去核实消息来源。\n\n新闻媒体已经成为彻底的垃圾。不仅仅是加密货币新闻媒体。没有一个\n享有声誉的消息来源了。没有人有一丝一毫的声誉。让这成为\n一个很好的提醒，永远不要购买...",
      "title": "CNBC、路透社、新闻网、雅虎在没有做任何核实的情况下，用沃尔玛的假话报道了假新闻。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有這些媒體都立即撲向了這個假新聞。他們中沒有人關心\n去核實消息來源。\n\n新聞媒體已經成爲徹底的垃圾。不僅僅是加密貨幣新聞媒體。沒有一個\n享有聲譽的消息來源了。沒有人有一絲一毫的聲譽。讓這成爲\n一個很好的提醒，永遠不要購買...",
      "title": "CNBC、路透社、新聞網、雅虎在沒有做任何覈實的情況下，用沃爾瑪的假話報道了假新聞。"
    }
  ]
}