{
  "author": "fredean01",
  "the_new_excerpt": "Massachusetts securities regulators are expected to file a complaint Wednesday\nagainst the wildly popular trading platform operated by Robinhood Financial LLC,\nalleging the company aggressively marketed to inexperienced investors and failed\nto implement controls to protect them.\n\nIn a final draft of…",
  "original_created_utc": 1608121031,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "马萨诸塞州证券监管机构预计将于周三提出申诉。\n面对罗宾汉金融有限责任公司(Robinhood Financial LLC)运营的广受欢迎的交易平台，\n指控该公司积极向缺乏经验的投资者推销，但失败了\n来实施控制措施来保护他们。\n\n在…的最终草案中",
      "title": "马萨诸塞州监管机构将对罗宾汉提起诉讼"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "馬薩諸塞州證券監管機構預計將於週三提出申訴。\n面對羅賓漢金融有限責任公司(Robinhood Financial LLC)運營的廣受歡迎的交易平臺，\n指控該公司積極向缺乏經驗的投資者推銷，但失敗了\n來實施控制措施來保護他們。\n\n在…的最終草案中",
      "title": "馬薩諸塞州監管機構將對羅賓漢提起訴訟"
    }
  ],
  "title": "Massachusetts Regulators to File Complaint Against Robinhood",
  "created_utc": 1608141032,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Massachusetts securities regulators are expected to file a complaint Wednesday against the wildly popular trading platform operated by Robinhood Financial LLC, alleging the company aggressively marketed to inexperienced investors and failed to implement controls to protect them. </p>\n\n<p>In a final draft of a more than 20-page administrative complaint reviewed by The Wall Street Journal, the enforcement arm of the Massachusetts Securities Division said Robinhood failed to protect its customers and their assets, violating state laws and regulations. Robinhood exposed Massachusetts investors to “unnecessary trading risks” by “falling far short of the fiduciary standard” adopted this year that requires broker-dealers to act in their clients’ best interest, the state said.</p>\n\n<p><a href=\"https://www.google.com/amp/s/www.wsj.com/amp/articles/massachusetts-regulators-to-file-complaint-against-robinhood-11608120003\">https://www.google.com/amp/s/www.wsj.com/amp/articles/massachusetts-regulators-to-file-complaint-against-robinhood-11608120003</a></p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/investing/comments/ke85t9/massachusetts_regulators_to_file_complaint/",
  "subreddit": "investing",
  "id": "ke85t9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493066
}