{
  "author": "Jailey0504",
  "the_new_excerpt": "My dog has slept with me ever since the very first night we brought him home , 5\nyears ago. Every night, he snuggles up against my chest... and pushes his way\nunder my arm, so that it is wrapped around him.\n\nHe is a small dog, who somehow consumes most of the bed. By the end of the\nnight, I am…",
  "original_created_utc": 1615531356,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的狗从我们带它回家的第一晚起就和我一起睡了，5个月了。\n几年前。每天晚上，他都会依偎在我的胸前... ...然后用他的方式... ...\n在我的胳膊下，这样就把它包住了。\n\n它是一只小狗，不知怎么就把大部分的床给占了。到了最后\n晚上，我是...",
      "title": "还有人晚上牺牲自己的舒适度，来保证宠物继续安睡吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的狗從我們帶它回家的第一晚起就和我一起睡了，5個月了。\n幾年前。每天晚上，他都會依偎在我的胸前... ...然後用他的方式... ...\n在我的胳膊下，這樣就把它包住了。\n\n它是一隻小狗，不知怎麼就把大部分的牀給佔了。到了最後\n晚上，我是...",
      "title": "還有人晚上犧牲自己的舒適度，來保證寵物繼續安睡嗎？"
    }
  ],
  "title": "Does anyone else sacrifice their own comfort at night, to ensure their pet continues sleeping peacefully?",
  "created_utc": 1615539174,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My dog has slept with me ever since the very first night we brought him home , 5 years ago. Every night, he snuggles up against my chest... and pushes his way under my arm, so that it is wrapped around him. </p>\n\n<p>He is a small dog, who somehow consumes most of the bed. By the end of the night, I am practically falling off.... I even sometimes find myself scooting closer to the edge so he has more room.</p>\n\n<p>During the day, he is extremely timid and easily frightened. He has been this way since he was a puppy. </p>\n\n<p>When he’s sleeping, he just looks so peaceful and content. I do everything in my power to ensure he keeps that peace. Even if that means Im wrapped up like a pretzel, while hanging half way off the bed.</p>\n\n<p>Does anyone else experience this with their fur children? Or am I officially a crazy person?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/TooAfraidToAsk/comments/m3bx5w/does_anyone_else_sacrifice_their_own_comfort_at/",
  "subreddit": "TooAfraidToAsk",
  "id": "m3bx5w",
  "is_self": true,
  "media": null,
  "is_video": false
}