{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Monday, May 17, 2021\n\nThe market fell modestly on Monday, as concerns over rising inflation, marked by\na higher than expected print in the April Consumer Price Index (CPI), continued.\nTechnology stocks continued their volatility, with the Nasdaq (QQQ) going as low\nas 1.42% down…",
  "original_created_utc": 1621284571,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月17日（月\n\n月曜の市場は、4月の消費者物価指数（CPI）が予想を上回ったことによるインフレ進行への懸念が続いたため、小幅に下落した。\n4月の消費者物価指数(CPI)が予想を上回ったことにより、インフレ上昇への懸念が続いたためです。\nテクノロジー株の乱高下が続き、ナスダック(QQQ)は1.42%の下落となりました。\n1.42％の下落となりました...",
      "title": "本日2021年5月17日（月）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年5月17日，星期一\n\n周一市场小幅下跌，因为对通胀上升的担忧继续存在。\n4月消费者物价指数（CPI）高于预期，对通货膨胀的担忧继续存在。\n科技股继续波动，纳斯达克指数（QQQ）最低跌至\n跌幅达1.42%...",
      "title": "以下是今天的市场回顾，2021年5月17日，星期一"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年5月17日，星期一\n\n週一市場小幅下跌，因爲對通脹上升的擔憂繼續存在。\n4月消費者物價指數（CPI）高於預期，對通貨膨脹的擔憂繼續存在。\n科技股繼續波動，納斯達克指數（QQQ）最低跌至\n跌幅達1.42%...",
      "title": "以下是今天的市場回顧，2021年5月17日，星期一"
    }
  ],
  "title": "Here is a Market Recap for today Monday, May 17, 2021",
  "created_utc": 1621309585,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Monday, May 17, 2021</strong></p>\n\n<p>The market fell modestly on Monday, as concerns over rising inflation, marked by a higher than expected print in the April Consumer Price Index (CPI), continued. Technology stocks continued their volatility, with the Nasdaq (QQQ) going as low as 1.42% down intraday before recovering and closing 0.59% down. The S&amp;P 500 (SPY) closed 0.26% down and the Dow Jones (DIA) closed.</p>\n\n<p>Stocks are coming into this week on the heels of an extremely choppy trading period recently, which saw the SPY pulling back 4% before recovering Thursday and Friday of last week after the April CPI and Producer Price Index (PPI) came in higher than expected. The CPI, which measures a basket of goods as well as energy and housing costs, rose 4.2% from a year ago, compared to the Dow Jones estimate for a 3.6% increase. The monthly gain was 0.8%, against the expected 0.2%. Excluding the volatile food and energy prices, the core CPI (this is the main measure of inflation) increased 3% compared to the same period in 2020 and 0.9% on a monthly basis. The respective estimates were 2.3% and 0.3%. </p>\n\n<p>The PPI, which measures the average changes in prices received by domestic producers for their output, rose 6.2% compared to April 2020 and 0.6% monthly increase. The core PPI, which excludes volatile items like food and energy rose 4.6% year over year and 0.7% in April. Economists polled by FactSet were expecting a 0.3% monthly increase in April and 3.8% year over year. This is the biggest jump since 2014. In tandem with the CPI report, this shows prices for both consumers and producers have increased more than expected. Market participants are concerned that high levels of inflation may cause the Federal Reserve to tighten monetary policy sooner than expected. </p>\n\n<p>While the readings in inflation definitely are not good, it is important to note that Federal Reserve Chair Jerome Powell has consistently reiterated he expects any rise in inflation to be “transitory” as the economy continues to recover from the March and bottom and want to see a “string” of strong labor reports totaling 1 million before. Talking about the March Job report, Powell said, “We want to see a string of months like that [like in March] so we can really begin to show progress toward our goals. We just need to keep reminding ourselves that even though some parts of the economy are starting just great, there’s a very large group of people who are not.” The April Job Report bolsters Powell’s argument that large segments that the Federal Reserve will move slowly in changing policy. </p>\n\n<p>In addition, at a separate event in April, Powell said that quantitative easing would likely taper “well before” the interest rate is increased. He said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.” In short, while the inflationary readings are not great, I’m fairly confident fears that the Federal Reserve will tighten policy sooner-than-expected are overblown. Just my two cents. </p>\n\n<p>There are several factors, in my opinion, contributing to the rise of inflation. First, after the collapse in prices during the height of the pandemic and lockdowns, it is not surprising to see prices comparatively much higher than last year as demand and consumer spending surges as the US economy reopens. </p>\n\n<p>Second are widespread supply shortages and manufacturing bottlenecks in key materials, limiting production capability and driving up delivery time, and as a result, driving up prices. One prominent example you may be familiar with is the global shortage in semiconductors, which is causing automobile manufacturers across the industry to limit production. A similar situation is happening across an array of consumer goods. As the economy in the US reopens thanks to effective distribution of the vaccine, supply is having a hard time catching up to rising demand, which of course, causes a rise in prices. As the economic reopening continues and supply in various consumer industries is able to catch up, inflation is expected to slow down. In a nutshell, this is why Jerome Powell and other monetary officials consistently refer to current inflationary pressures as expected and transitory. In an April 28 meeting, Jerome Powell said, “Amid progress on vaccinations and strong policy support, indicators of economic activity and employment have strengthened. Inflation has risen, largely reflecting transitory factors. Overall financial conditions remain accommodative, in part reflecting policy measures to support the economy and the flow of credit to U.S. households and businesses.” </p>\n\n<p>Third are historic levels of fiscal spending by the Federal Government in the form of stimulus and other benefits. Federal debt—incurred when the government sells Treasury bonds, bills, notes, and other securities to cover its costs—recently hit an all-time high. However, policymakers are not concerned with the debt at current levels. Jerome Powell said, “Given the low level of interest rates, there&#39;s no issue about the United States being able to service its debt at this time or in the foreseeable future.” Treasury Secretary Janet Yellen echoed a similar sentiment in a recent interview, saying “Even with inflation data coming in hotter than economists expected, long-term bond yields declined, indicating the market has been anticipating inflationary pressures for a while and are reassured by the Federal Reserve’s commitment to move slowly when raising rates.</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>On Monday morning AT&amp;T (T) and Discovery, Inc. (DISCA) announced a deal under which AT&amp;T&#39;s WarnerMedia will be spun off and combined with Discovery in a new standalone media company. The new Discovery-WarnerMedia combination will hit the ground with a huge library of programming and a budget of $20B, more than even Netflix spends on TV shows and movies, according to Discovery Chief Executive David Zaslav. </li>\n<li>Some restaurant chains, notably Starbucks (SBUX) and Chipotle (CMG) have begun waiving their mask requirement for customers that are fully vaccinated against Covid-19, though will maintain them for staff. This comes a few days after the White House loosened restriction on fully vaccinated individuals. The exact quote by the CDC is “Fully vaccinated people can resume activities without wearing a mask or physically distancing, except where required by federal, state, local, tribal, or territorial laws, rules, and regulations, including local business and workplace guidance.”</li>\n<li>Alibaba’s cloud service business has lost TikTok as its client, another blow to the eCommerce giant that has been pummeled by an anti-monopoly investigation by the Chinese Communist Party (CCP).</li>\n<li>JD.com’s logistic subsidiary is planning an IPO in the Hong Kong stock exchange. </li>\n<li>Billionaire George Soros&#39; investment firm, Soros Fund Management bought shares of ViacomCBS Inc, Discovery Inc and Baidu Inc as they were being sold off during the meltdown of Bill Hwang&#39;s Archegos Capital Management, Bloomberg News reported on Saturday.</li>\n<li><strong>**Please note that the current stock price was written mid-day and in many cases does not reflect closing prices of the stocks.*\\</strong>*</li>\n<li>First Majestic Silver (AG) target raised by HC Wainwright from $20 to $23.50 at Buy. Stock currently around $17.40. Precious metals have been staging a rally as of late, due to inflationary fears.</li>\n<li>Aptiv (APTV) with two target raises. Stock currently around $62.50\n\n<ul>\n<li>Raymond James from $160 to $200 at Outperform</li>\n<li>Deutsche Bank from $162 to $165 at Buy. </li>\n</ul></li>\n<li>Activision-Blizzard (ATVI) target raised by Deutshce Bannk from $115 to $118 at Buy. Stock currently around $92</li>\n<li>Brooks Automation (BRKS) with a host of target raises. Average price target $115 at Buy. Stock currently around $87</li>\n<li>Floor &amp; Decor (FND) with two target raises. Stock currently around $101\n\n<ul>\n<li>Morgan Stanley (MS) from $100 to $115 at Equal-Weight</li>\n<li>Telsey Advisory Group from $135 to $140 at Outperform</li>\n</ul></li>\n<li>Installed Building Products (IBP) target raised by Truist Securities from $130 to $144 at Buy. Stock currently around $121</li>\n<li>Roblox (RBLX) target raised by Morgan Stanley from $80 to $87 at Overweight. Stock currently around $77</li>\n<li>Restoration Hardware (RH) target raised by Loop Capital from $600 to $800 at Buy. Stock currently around $633</li>\n<li>Square (SQ) target raised by BMO Capital Markets from $237 to $269 at Market Perform. Stock currently around $202</li>\n</ul>\n\n<p>&quot;The future belongs to those who believe in the beauty of their dreams.&quot; -Eleanor Roosevelt</p>\n</div><!-- SC_ON -->",
  "score": 69,
  "permalink": "/r/stocks/comments/nerh13/here_is_a_market_recap_for_today_monday_may_17/",
  "subreddit": "stocks",
  "id": "nerh13",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804458
}