{
  "author": "hawonkafuckit",
  "original_created_utc": 1655122217,
  "title": "Truth in claims of medieval male mini-tunics?",
  "created_utc": 1655146829,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Years ago in high school, our eccentric English teacher told the class about a trend in medieval England men wore short tunics that would expose their genitals. He said some noblemen would even paint their scrotum different colours so that, when they bowed, onlookers would see something different and, uh, stylish. &lt;/p&gt;\n\n&lt;p&gt;Yesterday, I read the below in an Uncle John&amp;#39;s Bathroom Reader, and in my search for evidence, could only find links with the same text (below). &lt;/p&gt;\n\n&lt;p&gt;Can anyone provide more information/evidence? It seems so odd, but it&amp;#39;s twice in 25 years I&amp;#39;ve heard this so I wonder what the deal is!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Crotchless Tunics&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;In medieval England, wealthy gentlemen often wore clothing that left their “assets” exposed—by way of short-fitting tunics with no pants. (If the genitals didn’t hang low enough, padded, flesh-coated prosthetics called briquettes would be used.)&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Source: &lt;a href=\"https://www.portablepress.com/blog/2016/09/three-strange-fads/\"&gt;https://www.portablepress.com/blog/2016/09/three-strange-fads/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/vbaq8v/truth_in_claims_of_medieval_male_minitunics/",
  "subreddit": "AskHistorians",
  "id": "vbaq8v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Years ago in high school, our eccentric English teacher told the class about a\ntrend in medieval England men wore short tunics that would expose their\ngenitals. He said some noblemen would even paint their scrotum different colours\nso that, when they bowed, onlookers would see something different…"
}