{
  "author": "gae12345",
  "original_created_utc": 1645518396,
  "title": "Why do many anglo american \"analytic philosophers\" often say they don't understand \"continental\" philosphy instead of just saying they don't believe its claims to be true? It almost makes you think the analytic/continental split is due to a reading comprehension problem",
  "created_utc": 1645554659,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Are they in goid faith like they genuinely don&amp;#39;t understand it? It&amp;#39;s weird that philosophers of all people almost take pride in their inability to comprehend ideas\n Why not studying it harder then until they get it? Or do they just refuse to engage seriously with it because they believe its premises to be flawed? But that still wouldn&amp;#39;t excuse them from understanding its points&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/syigsh/why_do_many_anglo_american_analytic_philosophers/",
  "subreddit": "askphilosophy",
  "id": "syigsh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Are they in goid faith like they genuinely don't understand it? It's weird that\nphilosophers of all people almost take pride in their inability to comprehend\nideas Why not studying it harder then until they get it? Or do they just refuse\nto engage seriously with it because they believe its premises…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "純粋に理解していないようなガチガチの信仰状態なのか？変な話ですが\n哲学者は、自分が理解できないことを誇りにしているようなところがある。\nなぜ、理解できるまで勉強しないのか？それとも、ただ拒否しているのか？\nその前提を信じるからこそ、真剣に取り組むことができる......。",
      "title": "なぜ、英米の「分析哲学者」の多くは、「大陸」哲学の主張が真実であるとは思えないと言う代わりに、「大陸」哲学を理解できないと言うことが多いのでしょうか？分析哲学と大陸哲学の分裂は、読解力の問題によるものだと思わせるようなものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们是在愚蠢的信仰中，就像他们真的不理解一样？很奇怪的是\n哲学家们几乎以他们无法理解的思想为荣\n为什么不更努力地研究它，直到他们得到它？还是他们只是拒绝\n拒绝认真研究它，因为他们相信它的前提......",
      "title": "为什么许多英美的 \"分析哲学家 \"经常说他们不理解 \"大陆 \"哲学，而不是仅仅说他们不相信它的主张是真的？这几乎让你觉得分析/大陆的分裂是由于阅读理解的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們是在愚蠢的信仰中，就像他們真的不理解一樣？很奇怪的是\n哲學家們幾乎以他們無法理解的思想爲榮\n爲什麼不更努力地研究它，直到他們得到它？還是他們只是拒絕\n拒絕認真研究它，因爲他們相信它的前提......",
      "title": "爲什麼許多英美的 \"分析哲學家 \"經常說他們不理解 \"大陸 \"哲學，而不是僅僅說他們不相信它的主張是真的？這幾乎讓你覺得分析/大陸的分裂是由於閱讀理解的問題。"
    }
  ]
}