{
  "author": "ThrowThisAway701",
  "original_created_utc": 1659487924,
  "title": "How do I get rid of a gun that I don't want?",
  "created_utc": 1659500712,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Trigger Warning: Suicide&lt;/p&gt;\n\n&lt;p&gt;Hi. I was gifted a 12 gage shotgun by my dad a few years ago. I&amp;#39;ve kept it for the sake of making him feel better, but I&amp;#39;m going through a serious bout of depression at the moment and have many times considered using it on myself. I know it is loaded, and in a gun case in my closet. &lt;/p&gt;\n\n&lt;p&gt;I do not want to give myself the option to hurt myself with it. Every day it becomes a bit harder to resist and I would like to get rid of it so that the temptation isn&amp;#39;t there. &lt;/p&gt;\n\n&lt;p&gt;The gun is not registered to me in any way. I don&amp;#39;t want my dad or myself to get in trouble for turning it in. I lived in GA when he gave it to me. Moved to SC a few years later. Who do I hand it to, and how would I go about it? &lt;/p&gt;\n\n&lt;p&gt;I do apologize if this is triggering for any of you or if this isn&amp;#39;t the appropriate sub for this question. I&amp;#39;m also sorry if this seems attention seeking. Google wasn&amp;#39;t very clear regarding the state laws so I&amp;#39;m seeking clarification here. I will remove my post if it&amp;#39;s deemed inappropriate for this sub.&lt;/p&gt;\n\n&lt;p&gt;Thank you for your help in advance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 217,
  "permalink": "/r/TooAfraidToAsk/comments/wese9h/how_do_i_get_rid_of_a_gun_that_i_dont_want/",
  "subreddit": "TooAfraidToAsk",
  "id": "wese9h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Trigger Warning: Suicide\n\nHi. I was gifted a 12 gage shotgun by my dad a few years ago. I've kept it for\nthe sake of making him feel better, but I'm going through a serious bout of\ndepression at the moment and have many times considered using it on myself. I\nknow it is loaded, and in a gun case in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トリガー警告 自殺\n\nこんにちは。私は数年前、父から12ゲージの散弾銃を贈られました。私はそれを\nっていたのですが、今、私は深刻なうつ病を患っています。\n何度も自分自身に使おうと思いました。I\n弾は入っているし、ガンケースにも入っているのだが...。",
      "title": "不要な銃を処分するには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "触发警告。自杀\n\n几年前，我父亲送了我一把12口径的猎枪。我一直保留着它，因为\n为了让他感觉好些，但我现在正经历一场严重的\n抑郁症，并多次考虑用它来对付自己。I\n我知道它已经上了膛，而且放在一个枪盒里，在...",
      "title": "我怎样才能摆脱我不想要的枪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "觸發警告。自殺\n\n幾年前，我父親送了我一把12口徑的獵槍。我一直保留着它，因爲\n爲了讓他感覺好些，但我現在正經歷一場嚴重的\n抑鬱症，並多次考慮用它來對付自己。I\n我知道它已經上了膛，而且放在一個槍盒裏，在...",
      "title": "我怎樣才能擺脫我不想要的槍？"
    }
  ]
}