{
  "author": "Voldemoron",
  "original_created_utc": 1644064199,
  "title": "Did people not care about adults dating minors years ago?",
  "created_utc": 1644073490,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My grandfather started dating my grandmother when he was like 24 and she was 14 and nobody cared. Even now my family don&amp;#39;t like, see how weird that is and my grandmother even jokes about it. My dad even started dating my mom when he was 24 and she was 17 and nobody cared either. &lt;/p&gt;\n\n&lt;p&gt;Now, if I (21) was to date a 17 year old (I&amp;#39;m not and I wouldn&amp;#39;t), I&amp;#39;d be called all sorts of names and I&amp;#39;d probably be hated by everyone.&lt;/p&gt;\n\n&lt;p&gt;Edit: My grandmother is 80 so this would&amp;#39;ve been about  66 years ago.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also from ireland.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/sl5vgc/did_people_not_care_about_adults_dating_minors/",
  "subreddit": "TooAfraidToAsk",
  "id": "sl5vgc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My grandfather started dating my grandmother when he was like 24 and she was 14\nand nobody cared. Even now my family don't like, see how weird that is and my\ngrandmother even jokes about it. My dad even started dating my mom when he was\n24 and she was 17 and nobody cared either.\n\nNow, if I (21) was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "祖父が24歳、祖母が14歳の時に祖母と付き合い始めた。\n誰も気にしない。今でも私の家族は、それがいかに奇妙なことであるかということを嫌っています。\n祖母はそのことを冗談交じりに話していました。父も母と付き合い始めたのは、父が\n24歳の彼女が17歳でも、誰も気にしない。\n\n今、私(21)がそうだったら...",
      "title": "何年も前に大人が未成年とデートすることを気にしない人たちがいたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的祖父开始与我的祖母约会，当时他好像是24岁，她是14岁\n没有人关心。即使是现在，我的家人也不喜欢，认为这有多奇怪，我的祖母甚至还拿这个开玩笑。\n我的祖母甚至拿这个开玩笑。我爸爸甚至在他24岁的时候就开始和我妈妈约会，而她只有17岁。\n24岁，她17岁，也没有人关心。\n\n现在，如果我（21岁）是...",
      "title": "难道几年前人们就不关心成年人与未成年人约会的问题吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的祖父開始與我的祖母約會，當時他好像是24歲，她是14歲\n沒有人關心。即使是現在，我的家人也不喜歡，認爲這有多奇怪，我的祖母甚至還拿這個開玩笑。\n我的祖母甚至拿這個開玩笑。我爸爸甚至在他24歲的時候就開始和我媽媽約會，而她只有17歲。\n24歲，她17歲，也沒有人關心。\n\n現在，如果我（21歲）是...",
      "title": "難道幾年前人們就不關心成年人與未成年人約會的問題嗎？"
    }
  ]
}