{
  "author": "Taylan_K",
  "original_created_utc": 1643632444,
  "title": "Most plausible road to flee Sibirian prison camp via river near China?",
  "created_utc": 1643639054,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello fellow history interested!&lt;/p&gt;\n\n&lt;p&gt;My greatgrandfather, born 1839 in Dagestan, is said to have murdered a Russian commander during his duty because he tried to rape a woman. He was then sent to a Sibirian prison. (This prison has to be older than the Gulags from the Second World War) He spent 7 years there but because he learned to swim as a kid he somehow managed to flee this camp through a river nearby. It is said that it took him 3 days and 3 nights of swimming and diving to get out of sight from his persecutors. He then continued his way back via China, Buchara, India and Iran. His 3 year long journey ended when he reached the Ottoman Empire.  I&amp;#39;m wondering where he was imprisoned and wanted to ask if any of you might know of some camps &amp;quot;near&amp;quot; China with access to a river. We don&amp;#39;t know how long it took him to get to China but I guess he took the shortest route he found.&lt;/p&gt;\n\n&lt;p&gt;I hope this is the right subreddit to ask, I browsed through some other subs but found this suitable. Sorry if it&amp;#39;s not.&lt;/p&gt;\n\n&lt;p&gt;Thanks in advance!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 181,
  "permalink": "/r/AskHistorians/comments/sh08gt/most_plausible_road_to_flee_sibirian_prison_camp/",
  "subreddit": "AskHistorians",
  "id": "sh08gt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Hello fellow history interested!\n\nMy greatgrandfather, born 1839 in Dagestan, is said to have murdered a Russian\ncommander during his duty because he tried to rape a woman. He was then sent to\na Sibirian prison. (This prison has to be older than the Gulags from the Second\nWorld War) He spent 7…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史に興味のある皆さん、こんにちは。\n\n私の曽祖父は1839年にダゲスタンで生まれ、ロシア人を殺害したと言われています。\n職務中に女性を強姦しようとしたため、司令官が その後、彼は\nシビリアの牢獄 (この刑務所は、第二次世界大戦中の収容所よりも古いはずだ。\n彼は7年間を過ごしました。",
      "title": "シビリアの収容所から中国近くの川を経由して脱出するための最も妥当な道？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对历史感兴趣的朋友们，你们好!\n\n我的曾祖父，1839年出生在达吉斯坦，据说他在执勤期间谋杀了一名俄罗斯指挥官，因为他试图强奸妇女。\n据说他在执勤期间谋杀了一名俄罗斯指挥官，因为他试图强奸一名妇女。然后他被送入\n一个西伯利亚的监狱。(这座监狱比第二次世界大战时的古拉格监狱还要古老。\n他在西伯利亚监狱度过了7年。",
      "title": "通过中国附近的河流逃离西伯利亚监狱营的最合理的道路？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對歷史感興趣的朋友們，你們好!\n\n我的曾祖父，1839年出生在達吉斯坦，據說他在執勤期間謀殺了一名俄羅斯指揮官，因爲他試圖強姦婦女。\n據說他在執勤期間謀殺了一名俄羅斯指揮官，因爲他試圖強姦一名婦女。然後他被送入\n一個西伯利亞的監獄。(這座監獄比第二次世界大戰時的古拉格監獄還要古老。\n他在西伯利亞監獄度過了7年。",
      "title": "通過中國附近的河流逃離西伯利亞監獄營的最合理的道路？"
    }
  ]
}