{
  "author": "retiredcrayon11",
  "original_created_utc": 1647243582,
  "title": "Why do people think it’s so wrong to check out cleavage or butt when they seem obviously displayed?",
  "created_utc": 1647248961,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a female college teaching assistant and caught a student doing a quick glance down my shirt the other day. Not blatant. More like a “woh boobs” and quickly then looked away. &lt;/p&gt;\n\n&lt;p&gt;I mentioned it to a friend and she was like “that’s messed up, men are gross.”  But here’s the thing, I glance all the time at boobs and butt. Not in a lascivious manner, more of a wow that person is super fit or that shirt really shows off her assets. When it happens to me I always have the thought “if I didn’t want them to see my boobs I wouldn’t wear a v-neck shirt”. &lt;/p&gt;\n\n&lt;p&gt;I consider myself a feminist. But I guess I’m missing something. Please explain&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 181,
  "permalink": "/r/TooAfraidToAsk/comments/tdrz0c/why_do_people_think_its_so_wrong_to_check_out/",
  "subreddit": "TooAfraidToAsk",
  "id": "tdrz0c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m a female college teaching assistant and caught a student doing a quick\nglance down my shirt the other day. Not blatant. More like a “woh boobs” and\nquickly then looked away.\n\nI mentioned it to a friend and she was like “that’s messed up, men are gross.”\nBut here’s the thing, I glance all the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は女子大生のティーチングアシスタントですが、ある生徒がパッと見て\n先日、私のシャツの下をちらっと見たんです。あからさまではありません。どちらかというと、「うわっ、おっぱい」みたいな感じで\nすぐに目をそらしました。\n\n友人にその話をしたら、\"メチャクチャだな、男ってキモい \"と言われました。\nでもね、私はいつも...",
      "title": "胸の谷間やお尻が明らかに出ているように見えるのに、なぜみんなチェックするのが悪いと思うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名大学女助教，有一天我发现一个学生在快速浏览我的衬衫。\n瞥了一眼我的衬衫，有一天。并非明目张胆。更像是 \"哦，胸部 \"和\n然后迅速转过头去。\n\n我跟一个朋友说起这件事，她说：\"这太糟糕了，男人真恶心。\"\n但事情是这样的，我瞥了一眼所有...",
      "title": "为什么人们认为检查乳沟或屁股是如此错误的，因为它们似乎明显地展示了出来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名大學女助教，有一天我發現一個學生在快速瀏覽我的襯衫。\n瞥了一眼我的襯衫，有一天。並非明目張膽。更像是 \"哦，胸部 \"和\n然後迅速轉過頭去。\n\n我跟一個朋友說起這件事，她說：\"這太糟糕了，男人真噁心。\"\n但事情是這樣的，我瞥了一眼所有...",
      "title": "爲什麼人們認爲檢查乳溝或屁股是如此錯誤的，因爲它們似乎明顯地展示了出來？"
    }
  ]
}