{
  "author": "MasterCookSwag",
  "the_new_excerpt": "https://www.bloomberg.com/news/articles/2020-12-18/citadel-trading-chief-says-tesla-is-risk-to-other-s-p-500-stocks?srnd=premium\n\n> Funds that mimic the benchmark are set to buy more than $70 billion of the\n> carmaker’s shares and dump an equal amount of stock in existing members,\n> producing…",
  "original_created_utc": 1608300762,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.bloomberg.com/news/articles/2020-12-18/citadel-trading-chief-says-tesla-is-risk-to-other-s-p-500-stocks?srnd=premium\n\n>模仿基准的基金将购买超过700亿美元的\n>汽车制造商的股票，并在现有成员中抛售同等数量的股票，\n>生产…",
      "title": "Citadel交易首席执行官表示，特斯拉对其他标准普尔500指数成份股构成风险"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.bloomberg.com/news/articles/2020-12-18/citadel-trading-chief-says-tesla-is-risk-to-other-s-p-500-stocks?srnd=premium\n\n>模仿基準的基金將購買超過700億美元的\n>汽車製造商的股票，並在現有成員中拋售同等數量的股票，\n>生產…",
      "title": "Citadel交易首席執行官表示，特斯拉對其他標準普爾500指數成份股構成風險"
    }
  ],
  "title": "Citadel Trading Chief Says Tesla Is Risk to Other S&P 500 Stocks",
  "created_utc": 1608338866,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.bloomberg.com/news/articles/2020-12-18/citadel-trading-chief-says-tesla-is-risk-to-other-s-p-500-stocks?srnd=premium\">https://www.bloomberg.com/news/articles/2020-12-18/citadel-trading-chief-says-tesla-is-risk-to-other-s-p-500-stocks?srnd=premium</a></p>\n\n<blockquote>\n<p>Funds that mimic the benchmark are set to buy more than $70 billion of the carmaker’s shares and dump an equal amount of stock in existing members, producing intense selling pressure that could lead to dislocations, warned Greg Sutton, head of portfolio trading at Citadel Securities, one of the most active traders of U.S. stocks.</p>\n\n<p>The potential funding stress is one factor that had prompted the index’s overseers to consider implementing the addition in two tranches. After consulting with the financial community, S&amp;P Dow Jones Indices decided that Tesla will join the traditional way: in one shot, before markets open on Monday. The danger is that trading in many stocks may not be active enough to absorb the sudden deluge of supply.</p>\n\n<p>“Adding it all at once creates more stock that needs to be sold for the funding trade, which potentially creates more impact -- especially in less-liquid components of the S&amp;P 500,” Sutton said by phone. “The market can digest it, but there is the potential for liquidity impact.”</p>\n\n<p>While S&amp;P 500 members get shuffled frequently, Tesla’s enormous size adds an unusual layer of uncertainty this time. Boasting a market capitalization of more than $600 billion, Elon Musk’s company is joining as the sixth-largest company in the index. Since the stock it’s replacing -- Apartment Investment and Management Co. -- is only a tiny fraction of Tesla’s size, all other constituents are at risk of feeling the pinch.</p>\n</blockquote>\n\n<p>/</p>\n\n<blockquote>\n<p>To be sure, mammoth additions like this have happened before. Tesla is the biggest entrant by market value in history. However, when measured as a percentage of the S&amp;P 500, its weighting is similar to Berkshire Hathaway’s in 2010, when Warren Buffett’s firm was picked to join, data compiled by Sanford C. Bernstein showed. Yet with passive investing now accounting for roughly half of equity funds, up from 30% a decade ago, the funding requirement this time will be much higher, warned analysts including Toni Sacconaghi and Ann Larson.</p>\n\n<p>Since S&amp;P Dow Jones announced the news of Tesla’s addition on Nov. 16, the stock has rallied more than 60%. Over the stretch, about 52 million shares changed hands each day on average, 77% more than the previous month. During the past decade, the 10 biggest new entrants climbed an average 10% from the announcement until the actual inclusion, Bernstein’s analysis showed.</p>\n\n<p>Money managers may have already started adjusting portfolios in anticipation of the changes, with Tesla’s share offering earlier this month providing an opportunity to build positions. Some may opt to carry out part of the trade in the days leading up to the event, leaving some residual amount to work out around Friday’s close. To minimize tracking errors, or deviation from the benchmark, some may choose to use market-on-close orders or turn to options to help performance.</p>\n</blockquote>\n\n<p>/</p>\n</div><!-- SC_ON -->",
  "score": 88,
  "permalink": "/r/investing/comments/kfltn1/citadel_trading_chief_says_tesla_is_risk_to_other/",
  "subreddit": "investing",
  "id": "kfltn1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493085
}