{
  "author": "Captainwelfare2",
  "original_created_utc": 1629637374,
  "title": "I became a moon whale in 4 months without buying and you can too! Here’s some steps, and AMA!",
  "created_utc": 1629653440,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>For reference before anyone asks about my account being 21 days old</strong></p>\n\n<p>I lost my original account, <a href=\"/u/captainwelfare\">u/captainwelfare</a> because of some archaic nonsense, where if you sign up for an account on Reddit on the phone, it doesn’t require an email back up.  Of course, after 6 months of being auto logged in, I randomly got logged out, couldn’t remember my password, and had no retrieval option.  Here’s my post about it, and how I retrieved my vault:</p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/oxatno/stop_whatever_you_are_doing_and_review_the/\">https://www.reddit.com/r/CryptoCurrency/comments/oxatno/stop_whatever_you_are_doing_and_review_the/</a></p>\n\n<h1>Now then, what you are really here for:</h1>\n\n<p>Yup, whale hello there!  While my old account was about 6 months old, I didn’t start posting in <a href=\"/r/cc\">r/cc</a> until about 4 months ago.  The first month I earned 555 moons.  Was pretty exciting.  So I thought to myself, how can I make more moons?  </p>\n\n<p><strong>Note :This post is -not- about the math of how moons are made.  For that, you should check out <a href=\"/u/amandamichelle90\">u/amandamichelle90</a> ‘s post on topic</strong></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p8ptnv/the_confusing_karma_calculation_explained_with/\">https://www.reddit.com/r/CryptoCurrency/comments/p8ptnv/the_confusing_karma_calculation_explained_with/</a></p>\n\n<p>Bring a towel, it’s super hawt.</p>\n\n<p>Apparently only 2% of <a href=\"/r/cc\">r/cc</a> users have an open vault.  And less than 1% of them have more than 1k moons.  So that makes me a whale! Who knew?  Well, I wasn’t trying to become one, but become one I did,so, without further ado:</p>\n\n<h1>Here are the steps of how to become a moon whale</h1>\n\n<p><strong>1.  Don’t be a dick</strong></p>\n\n<p>Yeah, there’s having disagreements, and sometimes people will support a contrarion belief, but we are <em>all</em> people here. Nobody has time for pieces of crap.  Also, check out <a href=\"/r/lazymoons\">r/lazymoons</a> for sniping moonbots</p>\n\n<p><strong>2.  Post early, post often, and post *quality</strong>*</p>\n\n<p>Spam bots don’t do as well as you might think.  The easiest and most surefire way to raise karma on here is to comment early on people’s posts with something either supportive or humorous. Also if you see someone getting a lot of upvotes, might be a good idea to say something positive about their comment.</p>\n\n<p><strong>3.  Speaking of spam bots, downvote and report the fuckers</strong></p>\n\n<p>If something is clearly spam, there is a report button for a reason.</p>\n\n<p><strong>4.  Dig deep you cheap bastard and buy the $5 sub support</strong></p>\n\n<p>You get access to nifty tags for yourself, support this awesome sub, and get access to all sorts of nifty gifs.  People love gifs.  $5 to possibly get a few hundred extra moons? Hell yes.</p>\n\n<p><strong>5. Post 3 quality posts a day.</strong></p>\n\n<p>More than 3 and you get a spam warning.  Not sure what the threshold is that gets your posts removed, but try to stay within the rules.  Sooner or later you’ll hit pay dirt.  I average 1-2 posts a month that get north of 500 upvotes.  I’m going to guess this will be my one for this month, lol.</p>\n\n<p><strong>6. Don’t waste your time being a serial downvoted piece of shit</strong></p>\n\n<p>It’s serious a huge waste of time and probably helps your moon count by less than .0001 moons a month, if that.  AND it hurts people who are working hard.</p>\n\n<p><strong>7. Make friends and allies.</strong></p>\n\n<p>Gaining moons isn’t a lone venture.  Whether it’s calling each other to quality posts, shout outs in the daily, or a short love fest between your crew, moons will add up.  Just don’t start an upvote part.  No.  Stoppit</p>\n\n<p><strong>8. Give swank awards</strong></p>\n\n<p>It’s just a nice thing to do, and it will bring attention to people who are trying hard too.</p>\n\n<p><strong>9. HODL.</strong></p>\n\n<p>You get a 20% HODL bonus for your distribution if you hold your moons from prior round.  NOTE: You <em>can</em> give out up to 100 moons a month as tips that do NOT affect your hodl bonus</p>\n\n<h1>10. BACK UP YOUR ACCOUNT AND SEED PHRASE.</h1>\n\n<p>Seriously, I almost lost 13k moons because of losing my main.  This is the price of crypto and being your own bank.  Have backups people.  And have backups of your backup.</p>\n\n<p>Welp, that’s pretty much it.  If you have any useful moonfarming that <strong>isnt</strong> being douchey, then feel free to post below.  Happy farming fellow mooners!</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/p9c35v/i_became_a_moon_whale_in_4_months_without_buying/",
  "subreddit": "CryptoCurrency",
  "id": "p9c35v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For reference before anyone asks about my account being 21 days old\n\nI lost my original account, u/captainwelfare [/u/captainwelfare] because of some\narchaic nonsense, where if you sign up for an account on Reddit on the phone, it\ndoesn’t require an email back up. Of course, after 6 months of being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のアカウントが21日前のものであるという質問を受ける前に参考までに\n\n私は元のアカウント、u/captainwelfare [/u/captainwelfare]を失いました。\n携帯電話でRedditのアカウントにサインアップしても\nメールでのバックアップは必要ありません。もちろん、6ヶ月後には...",
      "title": "私は買わずに4ヶ月で月のクジラになりましたが、あなたもそうできます。ここでは、いくつかの手順とAMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在有人问及我的账户已满21天之前，请参考一下\n\n我失去了我原来的账户，u/captainwelfare [/u/captainwelfare] 因为一些\n如果你用手机在Reddit上注册一个账户，它不需要电子邮箱。\n如果你在手机上注册Reddit账户，就不需要电子邮件备份。当然，经过6个月的...",
      "title": "我在4个月内不买东西就成了月鲸，你也可以！\"。这里有一些步骤，还有AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在有人問及我的賬戶已滿21天之前，請參考一下\n\n我失去了我原來的賬戶，u/captainwelfare [/u/captainwelfare] 因爲一些\n如果你用手機在Reddit上註冊一個賬戶，它不需要電子郵箱。\n如果你在手機上註冊Reddit賬戶，就不需要電子郵件備份。當然，經過6個月的...",
      "title": "我在4個月內不買東西就成了月鯨，你也可以！\"。這裏有一些步驟，還有AMA!"
    }
  ]
}