{
  "author": "Bentresh",
  "original_created_utc": 1641848429,
  "title": "Who ruled when? Reconstructing a relative chronology of Bronze Age rulers",
  "created_utc": 1641891798,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today I&amp;#39;m going to discuss the relative chronology of Egypt and Ḫatti, two of the most powerful kingdoms of the Bronze Age. Ḫatti (1650-1180 BCE), also known as the Hittite kingdom/empire, was located in what is now central and southern Turkey and northern Syria. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Periodization&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Historians typically divide early Egypt into three periods of centralized rule (Old Kingdom, Middle Kingdom, New Kingdom) and two periods of decentralized rule and competing polities (First and Second Intermediate Periods).&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Old Kingdom (ca. 2650-2150 BCE)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;First Intermediate Period (ca. 2150-2030 BCE)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Middle Kingdom (ca. 2030-1650 BCE)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Second Intermediate Period (ca. 1700-1550 BCE)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;New Kingdom (ca. 1550-1070 BCE) &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Additionally, each of these periods consists of one or more dynasties. The New Kingdom consists of the 18th, 19th, and 20th Dynasties, for example. &amp;quot;Dynasty&amp;quot; is a bit of a misnomer since there are instances of a dynastic break despite the same family staying in power (e.g. the 17th/18th Dynasty transition) as well as dynastic continuity despite a ruler from another family ascending to the throne (e.g. Horemheb in the 18th Dynasty), but the term has been in use for so long that I fear we&amp;#39;re stuck with it. &lt;/p&gt;\n\n&lt;p&gt;Similarly, modern historians have divided the history of the Hittites into two periods. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Old Kingdom (ca. 1650-1400 BCE) &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;New Kingdom, or Hittite empire period (ca. 1400-1200 BCE)&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Thanks to the efforts of early Egyptologists, we have a fairly complete relative chronology of the most prominent Egyptian kings. In other words, we know that Khufu (4th Dynasty) reigned earlier than Amenemhat I (12th Dynasty), who in turn reigned earlier than Ramesses II (19th Dynasty). &lt;/p&gt;\n\n&lt;p&gt;We also have a relative chronology of Hittite rulers. For example, the New Kingdom consists of the following kings:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Šuppiluliuma I&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Arnuwanda II (son of Šuppiluliuma I)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Muršili II (son of Šuppiluliuma I and brother of Arnuwanda II)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Muwatalli II (son of Muršili II)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Muršili III (son of Muwatalli II)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Ḫattušili III (uncle of Muršili III and brother of Muwatalli II; seized the throne in a coup)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Tudḫaliya IV (son of Ḫattušili III), &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Arnuwanda III (son of Tudḫaliya IV)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Šuppiluliuma II (son of Tudḫaliya IV and brother of Arnuwanda III)&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;So how did scholars reconstruct this sequence of rulers? How do we know which kings ruled when? &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;King lists&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Scribes in ancient Egypt dated texts according to the regnal year of a king. An example from a scarab of Amenhotep III of the 18th Dynasty (14th century BCE):&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;Year 11, third month of Akhet, day 1, under (the reign of)... the King of Upper and Lower Egypt, Nebmaatre, son of Re, Amenhotep, the ruler of Thebes, given life, and the Great Royal Wife Tiye, may she live.&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Of course, you need to keep a chronological list of rulers for such a system to work. Knowing that an event took place in Year 3 of the reign of Senusret III doesn&amp;#39;t help you very much if you have no idea when Senusret III ruled. There are several surviving king lists from ancient Egypt, including but not limited to the following:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Royal Annals, including the Palermo Stone (Dynasties 1-5)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Turin King List (Dynasties 1-17)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Abydos King List (Dynasties 1-19) &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Saqqara Tablet (Dynasties 1-19)&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Most of these lists are monumental inscriptions from temples and tombs, but the Turin King List was written on papyrus. The dry desert of southern Egypt has excellent preservation conditions, but papyrus is nonetheless a delicate material, and the Turin papyrus allegedly crumbled to bits shortly after its discovery. As Barbara Mertz put it in &lt;a href=\"https://books.google.com/books?id=9oAZEyiyvT0C\"&gt;&lt;em&gt;Temples, Tombs, and Hieroglyphs&lt;/em&gt;&lt;/a&gt;,&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The papyrus was complete when it was discovered in 1823 by a gentleman named Bernardino Drovetti, who stuck it into a jar that he tied around his waist. He then rode off to town on his donkey. The gait of a donkey being what it is, Egyptologists have been pushing the pieces of the papyrus around ever since, and cursing Drovetti as they do so. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Though these king lists are an invaluable source of information about the relative chronology of Egyptian kings, there are several problems and limitations. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Most are quite fragmentary. Although the Turin list originally included the names of more than 300 kings, less than half of the names have survived and are at least partially legible. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Kings viewed as problematic were intentionally excluded. This includes female kings such as Hatshepsut, the kings of the Amarna period, and kings of foreign origins such as the Hyksos kings of the Second Intermediate Period. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Some kings were contemporary rather than consecutive, particularly in periods in which centralized rule was breaking down. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Seals and offering lists&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;No such king lists have survived from the Hittite empire, but there are a couple of texts that include the names of several successive kings. One of these inscriptions is the &lt;a href=\"https://upload.wikimedia.org/wikipedia/commons/4/45/Hittite_Old_Kingdom_-_%28Dincol%2C_Hawkins%2C_Wilhelm_1993%29_-_The_Cruciform_Seal_from_Bogazk%C3%B6y-Hattusa_%28Drawing_2%29.png\"&gt;cruciform seal&lt;/a&gt; found at the Hittite capital of Ḫattuša. As the name suggests, the seal impression takes the form of a cross, with the names of kings and queens written in the central portion of the seal and each of the four wings. &lt;/p&gt;\n\n&lt;p&gt;Five kings are named on the obverse of the seal, and another five are listed on the reverse. Šuppiluliuma, the first king of the New Kingdom, is in the center of the reverse side of the seal, and his son Muršili II is in the center of the obverse side. Šuppiluliuma&amp;#39;s name is surrounded by the names of the earliest kings of the Hittite kingdom (Labarna, Ḫattušili I, and Muršili I), whereas Muršili&amp;#39;s name is surrounded by the names of the predecessors of his father Šuppiluliuma – Tudḫaliya I, Arnuwanda I, Tudḫaliya III, and another Tudḫaliya probably to be identified as Tudḫaliya the Younger since he is the only king without an accompanying queen. (Tudḫaliya the Younger was murdered so that Šuppiluliuma could ascend to the throne. The familial relationship between them remains unclear.) &lt;/p&gt;\n\n&lt;p&gt;Strangely, there is a considerable gap in time between the most recent king of the reverse (Muršili I) and the oldest king of the obverse (Tudḫaliya I). This was a period of weakness for the Hittite kingdom, however, so Muršili II may have intentionally focused exclusively on the kings who founded the Old Kingdom and New Kingdom, when the Hittite kingdom was at the height of its power. &lt;/p&gt;\n\n&lt;p&gt;Additionally, Hittite festival texts occasionally list kings in chronological order while outlining the offerings made to deceased ancestors. For example, tablet KUB 11.8+9, which describes the events of day 32 of the &lt;em&gt;nuntarriyašḫaš&lt;/em&gt; festival, mentions offerings made to early kings such as Alluwamna, Ḫantili, Zidanta, Ḫuzzia, Tudḫaliya I, and Arnuwanda I.   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Biographical statements&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Royal inscriptions such as annals and chronicles sometimes list a king&amp;#39;s ancestors. For example, the Apology of king Ḫattušili III (13th century BCE) begins as follows:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;Thus (speaks the) Tabarna Ḫattušili (III), Great King, King of Ḫatti, the son of Muršili (II), Great King, King of Ḫatti, the grandson of Šuppiluliuma (I), Great King, King of Ḫatti, descendant of Ḫattušili I, king of Kuššar.&lt;/em&gt; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Unfortunately, while such statements are helpful for establishing genealogies, they often omit rulers and are therefore not as helpful as they appear for establishing sequences of kings. Here Ḫattušili is omitting three kings: Arnuwanda II (his uncle), Muwatalli II (his brother), and Muršili III (his nephew and predessor). &lt;/p&gt;\n\n&lt;p&gt;Such biographical statements could be rather lengthy and go back multiple generations, as in the case of the hieroglyphic inscription Maraş 1 of the late 9th century BCE. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;I am Halparuntiya the ruler, Gurgumean king, the son of the governor Laramas, the grandson of the hero Halparuntiya, the great-grandson of the brave Muwatalli, the great-great-grandson of the ruler Halparuntiya, the great-great-great-grandson of the hero Muwizi, the descendant of the governor Laramas...&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Historical and diplomatic texts&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;Hittite treaties often begin with a historical prologue that provides the context for the treaties. These are invaluable not only for establishing the sequence of rulers of a kingdom but also for linking the chronologies of contemporary kingdoms. For example, the treaty between Šattiwaza of Mitanni and Šuppiluliuma I of Ḫatti mentions several kings who preceded Šattiwaza on the Mitannian throne. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;[Thus says] Šattiwaza, son of Tušratta, king of Mitanni: Before Šuttarna, son of Artatama... of the land of Mitanni, King Artatama, his father, did wrong. He used up the palace of the kings, together with its treasures. He exhausted them in payment to the land of Assyria and to the land of Alši. King Tušratta, my father, built a palace and filled it with riches, but Šuttarna destroyed it, and it became impoverished. And he broke the [ . . . ] of the kings, of silver and gold, and the caldrons of silver from the bath house. And [from the wealth(?)] of his father and his brother he did not give anyone (in Mitanni) anything, but he threw himself down before the Assyrian, the subject of his father, who no longer pays tribute, and gave him his riches as a gift.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Thus says Šattiwaza, son of King Tušratta: The door of silver and gold which King Šauštatar, my (great-)great-grandfather, took by force from the land of Assyria as a token of his glory and set up in his palace in the city of Waššukanni —to his shame Šuttarna has now returned it to the land of Assyria&lt;/em&gt;...&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Diplomatic correspondence is similarly useful for linking the chronologies of contemporary states like ancient Egypt and Ḫatti. Thanks to the Amarna letters found in Egypt, for example, we know that the Egyptian kings Amenhotep III and Akhenaten were contemporary with Kadašman-Enlil I and Burna-buriaš II of Babylonia, Šuppiluliuma I of Ḫatti, Aššur-uballit I of Assyria, and Tušratta of Mitanni. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Lingering issues: Kings sharing names and the difficulties of dating texts and inscriptions&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Although we have made great progress in reconstructing the sequences of ancient kings, there are still aspects of Egyptian and Hittite history that remain poorly understood. As an example, let&amp;#39;s look at the Hittite kings named Tudḫaliya.  &lt;/p&gt;\n\n&lt;p&gt;As you&amp;#39;ve probably noticed, Bronze Age rulers liked to repeat names, particularly the names of powerful or prominent kings of the past. Egyptologists refer to 1300-1100 BCE as the Ramesside period because there were no fewer than 11 kings named Ramesses in this period. The numbering system we use today is a modern convention used for convenience, and unfortunately the Egyptians did not provide numbers to distinguish one Ramesses from another. Egyptian kings of the New Kingdom had five names, however, which does allow us to distinguish between them. For example, Ramesses II and Ramesses III had different throne names – Usermaatre-Setepenre and Usermaatre-Meryamun, respectively. &lt;/p&gt;\n\n&lt;p&gt;Unfortunately, while a few Hittite kings had both a Hittite name and a secondary Hurrian name – Hittite Muršili III and Hurrian Urḫi-Teššub, for example – most Hittite kings were content with only a single name. Since several names were shared by kings, it can be difficult to tell whether a text referring to &amp;quot;King Tudḫaliya&amp;quot; dates to, say, the reign of Tudḫaliya I (14th century BCE) or the reign of Tudḫaliya IV (late 13th century BCE).  &lt;/p&gt;\n\n&lt;p&gt;As an example, let&amp;#39;s take a look at the &lt;a href=\"https://commons.wikimedia.org/wiki/File:Museum_of_Anatolian_Civilizations054_kopie1.jpg\"&gt;Ankara silver bowl&lt;/a&gt;, which has elicited more controversy than any other Anatolian hieroglyphic inscription. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;zi/a-wa/i-ti CAELUM-pi sa-ma-i(a)-*a REGIO.HATTI VIR2 *273-i(a)-sa5-zi/a-tá REX ma-zi/a-kar-hu-ha REX PRAE-na&lt;/p&gt;\n\n&lt;p&gt;tara/i-wa/i-zi/a-wa/i(REGIO) REL+ra/i MONS[.tu] LABARNA+la hu-la-i(a)-tá&lt;/p&gt;\n\n&lt;p&gt;wa/i-na-*a pa-ti-i(a)-*a ANNUS-i(a) i(a)-zi/a-tà&lt;/p&gt;\n\n&lt;p&gt;This bowl Asamaya, the man of Ḫatti, made in the time of King Mazi-Karḫuḫa.&lt;/p&gt;\n\n&lt;p&gt;When the labarna Tudḫaliya smote Tarwiza, &lt;/p&gt;\n\n&lt;p&gt;in that year he (i.e. Asamaya) made it. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The key question is which &amp;quot;labarna Tudḫaliya&amp;quot; is being referred to here. Scholars are divided as to whether the bowl dates to the Bronze Age or Iron Age, and if it does date to the Bronze Age, whether it should be dated to the reign of Tudḫaliya I (14th century BCE) or Tudḫaliya IV (13th century BCE). &lt;/p&gt;\n\n&lt;p&gt;There are a few grammatical features that suggest a dating to the Bronze Age, such as an undifferentiated za/i (&lt;em&gt;za&lt;/em&gt; and &lt;em&gt;zi&lt;/em&gt; were separate signs in later inscriptions), a-initial-final (the &lt;em&gt;a&lt;/em&gt; glyph is moved to the end of the word, as in Asamaya&amp;#39;s name, marked here with an asterisk), and relatively few inflected nouns. On the other hand, the pervasiveness of syllabic writing and conjugated verbs points to a much later Iron Age dating, as does the theophoric name Mazi-Karḫuḫa. Several sign forms, particularly the glyph &lt;em&gt;ma&lt;/em&gt; (a ram&amp;#39;s head) strongly resemble those of Carchemish, home to the god Karḫuḫa. While it is most likely that the bowl is an Iron Age artifact from Carchemish written in an archaizing style, the dating of the bowl remains an unsettled issue. &lt;/p&gt;\n\n&lt;p&gt;As another example, the Museum of Fine Arts has a &lt;a href=\"https://collections.mfa.org/objects/322343/drinking-vessel-in-the-shape-of-a-fist;jsessionid=7527C5D8C33C9415AF5A65EC964E77C1\"&gt;silver drinking vessel&lt;/a&gt; in the shape of a fist inscribed with the name of King Tudḫaliya (written as MONS-&lt;em&gt;tu&lt;/em&gt; MAGNUS.REX). The MFA has identified this Tudḫaliya as Tudḫaliya III, primarily on the basis of the work of the Hittitologist Hans Güterbock, who compared the artistic style with the reliefs from the Hittite town of Alaca Höyük, which at the time were dated to the 15th/14th century BCE. Since the reliefs are now believed to date to the latter part of the 13th century BCE, as outlined in Piotr Taracha&amp;#39;s article &lt;a href=\"https://brill.com/view/journals/jane/11/2/article-p132_3.xml?language=en\"&gt;&amp;quot;The Iconographic Program of the Sculptures of Alacahöyük,&amp;quot;&lt;/a&gt; an identification with Tudḫaliya III is almost certainly incorrect. It is more likely that the rhyton is referring to Tudḫaliya IV of the late 13th century BCE. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Further reading on relative chronology and king lists&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://books.google.com/books?id=Gux5DwAAQBAJ\"&gt;&lt;em&gt;Ancient Egyptian Chronology&lt;/em&gt;&lt;/a&gt; edited by Erik Hornung, Rolf Krauss, and David Warburton&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://books.google.com/books?id=ha6fAAAAMAAJ\"&gt;&lt;em&gt;Pharaonic King-lists, Annals, and Day-books: A Contribution to the Study of the Egyptian Sense of History&lt;/em&gt;&lt;/a&gt; by Donald Redford&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://books.google.com/books?id=DdCmjYhsD1cC\"&gt;&lt;em&gt;Royal Annals of Ancient Egypt: The Palermo Stone and Its Associated Fragments&lt;/em&gt;&lt;/a&gt; by Toby Wilkinson&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://www.jstor.org/stable/601880\"&gt;&amp;quot;History as Charter: Some Observations on the Sumerian King List&amp;quot;&lt;/a&gt; by Piotr Michalowski&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;a href=\"https://opus.bibliothek.uni-wuerzburg.de/opus4-wuerzburg/frontdoor/deliver/index/docId/7130/file/Wilhelm_OPUS_7130.pdf\"&gt;&amp;quot;The &amp;#39;Cruciform Seal&amp;#39; from Boğazköy-Hattusa&amp;quot;&lt;/a&gt; by Gernot Wilhelm, Ali Dinçol, Belkis Dinçol, and David Hawkins&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/s0uf55/who_ruled_when_reconstructing_a_relative/",
  "subreddit": "AskHistorians",
  "id": "s0uf55",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today I'm going to discuss the relative chronology of Egypt and Ḫatti, two of\nthe most powerful kingdoms of the Bronze Age. Ḫatti (1650-1180 BCE), also known\nas the Hittite kingdom/empire, was located in what is now central and southern\nTurkey and northern Syria.\n\nPeriodization\n\nHistorians…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本日は、エジプトとアフガニスタンという2つの国の相対的な年代についてお話します。\n青銅器時代で最も強力な王国。Ḫatti (前1650-1180)は、またの名を\nヒッタイト王国/帝国として、現在の中央から南にかけての地域に位置していました。\nトルコ、シリア北部\n\n時代区分\n\n歴史家は...",
      "title": "誰がいつ統治したのか？青銅器時代の支配者の相対的な年表を再構築する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我将讨论埃及和Ḫatti的相对年表，这是青铜时代最强大的两个王国。\n青铜时代最强大的王国。Ḫatti（公元前1650-1180年），也被称为赫梯王国/帝国。\n又称赫梯王国/帝国，位于现在的土耳其中部和南部以及叙利亚北部。\n土耳其和叙利亚北部。\n\n年代划分\n\n历史学家...",
      "title": "谁统治了什么时候？重建青铜时代统治者的相对年表"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我將討論埃及和Ḫatti的相對年表，這是青銅時代最強大的兩個王國。\n青銅時代最強大的王國。Ḫatti（公元前1650-1180年），也被稱爲赫梯王國/帝國。\n又稱赫梯王國/帝國，位於現在的土耳其中部和南部以及敘利亞北部。\n土耳其和敘利亞北部。\n\n年代劃分\n\n歷史學家...",
      "title": "誰統治了什麼時候？重建青銅時代統治者的相對年表"
    }
  ]
}