{
  "author": "Boomtown626",
  "the_new_excerpt": "tl;dr takeaways:\n\n\"Whether or not an investment is a \"good investment\" or a \"bad investment\" has\nnothing at all to do with whether or not you end up turning a profit.\"\n\n\"Spend some time this long weekend consciously and deliberately assigning a date\nand a dollar value to your investment goals. Write…",
  "original_created_utc": 1610750599,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "tl;dr的心得。\n\n\"一项投资是 \"好的投资 \"还是 \"坏的投资\"？\n与你最终是否盈利毫无关系。\"\n\n\"在这个长周末花点时间，有意识、有目的地指定一个日期\n并为您的投资目标设定一个美元值。写...",
      "title": "哲学星期五。对抗FOMO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "tl;dr的心得。\n\n\"一項投資是 \"好的投資 \"還是 \"壞的投資\"？\n與你最終是否盈利毫無關係。\"\n\n\"在這個長週末花點時間，有意識、有目的地指定一個日期\n併爲您的投資目標設定一個美元值。寫...",
      "title": "哲學星期五。對抗FOMO"
    }
  ],
  "title": "Philosophy Friday: Fighting FOMO",
  "created_utc": 1610806331,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>tl;dr takeaways:  </p>\n\n<p><em>&quot;Whether or not an investment is a &quot;good investment&quot; or a &quot;bad investment&quot; has nothing at all to do with whether or not you end up turning a profit.&quot;</em></p>\n\n<p>&quot;<em>Spend some time this long weekend consciously and deliberately assigning a date and a dollar value to your investment goals. Write it down.</em>&quot;  </p>\n\n<p>---------------------------------------------------------------------------------------------</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Within an hour after selling Bio Nano for a handsome profit this morning at $7.75/share ($0.72 CB), it spiked to $8.75 and threatened to break $9. I missed out on nearly $1,400 by selling 98 minutes too soon. </li>\n<li>MSFT, which has reliably doubled every two years since Lincoln was in office, picked the exact time I bought it last year to finally break that pattern and start trading sideways for six months. </li>\n<li>A friend IRL told me in Nov 2019 that he was YOLO&#39;ing into NIO with $35K, at less than $2/share, but I didn&#39;t get in until $21, after he had already cashed out and written a check to buy his new, giant house. </li>\n</ul>\n\n<p>We all have similar stories, and as long as we invest, we&#39;ll keep piling them up. My secret to not having any FOMO or regrets is a concept that&#39;s important enough, I think it&#39;s fair to call it the investing secret of life:</p>\n\n<p><em>Whether or not an investment is a &quot;good investment&quot; or a &quot;bad investment&quot; has nothing at all to do with whether or not you end up turning a profit.</em> &lt;-- Re-read that sentence.</p>\n\n<p>A good investment is one that helps your personal portfolio align with your personal financial goals, risk tolerance, and investment time line. (This includes another key lesson - when setting goals, &quot;make money&quot; is not a valid goal, because it&#39;s not specific, measurable, or attached to a timeframe.) If an investment is truly good and it properly fits your strategy, you&#39;ll never have to sweat over whether or not it&#39;s time to sell GME, and the bad week ICLN* and AMD just had wouldn&#39;t stress you out. </p>\n\n<p><em>Spend some time this long weekend consciously and deliberately assigning a date and a dollar value to your investment goals. Write it down.</em> What kind of strategy will it take to get there? What kind of risk will it involve? If the worst feasible and realistic outcome happens, where will that leave you? With markets closed, look at your portfolio. How much do you know about the companies you hold? Are you being honest with yourself about the risk level you&#39;ve taken on and what you&#39;re comfortable with? </p>\n\n<p>I hope everyone bought some dips today. I feel a rebound coming on next week. Happy Friday and Green Numbers to everyone! </p>\n\n<p>* Yes, this is politely directed at a number of you</p>\n\n<p>** If news breaks that substantially and materially alters the outlook for a holding (glares motherfuckerly at BABA), then the risk equation has changed and you&#39;ll have to start making difficult re-assessments about how much risk you now know to be involved and adjust accordingly.</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/stocks/comments/ky5ufc/philosophy_friday_fighting_fomo/",
  "subreddit": "stocks",
  "id": "ky5ufc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218325
}