{
  "author": "deltamental",
  "the_new_excerpt": "I've heard some historians argue that we should not evaluate pederasty according\nto our contemporary morals, current understanding of healthy childhood\ndevelopment, etc, because the cultural context was entirely different. Some have\neven gone so far to say that pederasty was fundamental to education…",
  "original_created_utc": 1611359342,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我听到一些历史学家认为，我们不应该评价鸡奸，根据\n对我们当代人的道德观、当前对健康儿童的理解。\n发展等，因为文化背景完全不同。有些人有\n甚至说鸡奸是教育的根本... ...",
      "title": "NSFW]古希腊的恋童癖对男孩有什么心理影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽到一些歷史學家認爲，我們不應該評價雞姦，根據\n對我們當代人的道德觀、當前對健康兒童的理解。\n發展等，因爲文化背景完全不同。有些人有\n甚至說雞姦是教育的根本... ...",
      "title": "NSFW]古希臘的戀童癖對男孩有什麼心理影響？"
    }
  ],
  "title": "[NSFW] What psychological impact did pederasty have on boys in ancient Greece?",
  "created_utc": 1611374670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve heard some historians argue that we should not evaluate pederasty according to our contemporary morals, current understanding of healthy childhood development, etc, because the cultural context was entirely different. Some have even gone so far to say that pederasty was fundamental to education of the youth in Athens, and responsible for its success. However, others argue that basic human psychology cannot have changed much over the last few millennia, and the consensus among contemporary psychologists is that sexual contact between adolescent boys and much older men causes lasting trauma, including PTSD. I even read an anecdote of an ancient boy driven to suicide when his &quot;mentor&quot; publicly called attention to sexual acts he did to him.</p>\n\n<p>So my question is: what was the psychological impact of pederasty on boys in ancient Greece?</p>\n\n<p>Note: ideally we&#39;d be able to reference hard facts like x% of boys in the pederastic system suffered from PTSD as adults, the suicide rate increased by y% over boys who were not part of it, etc. Since social sciences were not developed back then, I recognize it is impossible to make such claims. However, I would prefer an answer that at least attempts to answer this question about the population as a whole while taking into account the bias of writers at the time and the bias in what was written down at all, rather than an answer which merely collects a few anecdotes about individuals who did well/poorly later in life. I welcome discussions of methodology!</p>\n</div><!-- SC_ON -->",
  "score": 396,
  "permalink": "/r/AskHistorians/comments/l30bpe/nsfw_what_psychological_impact_did_pederasty_have/",
  "subreddit": "AskHistorians",
  "id": "l30bpe",
  "is_self": true,
  "media": null,
  "is_video": false
}