{
  "author": "Nostalg33k",
  "original_created_utc": 1635098337,
  "title": "We Should Push Facebook and Amazon Towards Crypto Adoption and not Creation",
  "created_utc": 1635124520,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Clearly, we are here because we believe in this technology to life people, bring more liberty, and redistribute wealth and power.   </p>\n\n<p>If centralized coins from companies are starting to pop left and right they will be worse than fiat. I&#39;m scared of Amazon and Facebook gaining one of the powers of a state =&gt; Minting money. After that we&#39;ll have companies with their own armies and police ?   </p>\n\n<p>I&#39;d say this is a slippery slope. I don&#39;t believe Bezos would do good for the people nor zucc nor musk. I know we thrash talk government as a front for private interests but private interests taking the place directly would not be in most people&#39;s interest.   </p>\n\n<p>Multinational companies have already far too much geopolitical power and I wish there was a serious push to stop these two companies from minting their own money. </p>\n\n<p>I prefer to live in the US or France than in Amazon land even if Bezos own parts of the government right now, there is more limit to his power when they need to pretend we have power. </p>\n\n<p>Yes to crypto adoption for big companies. No to crypto creation.</p>\n</div><!-- SC_ON -->",
  "score": 190,
  "permalink": "/r/CryptoCurrency/comments/qexdod/we_should_push_facebook_and_amazon_towards_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qexdod",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Clearly, we are here because we believe in this technology to life people, bring\nmore liberty, and redistribute wealth and power.\n\nIf centralized coins from companies are starting to pop left and right they will\nbe worse than fiat. I'm scared of Amazon and Facebook gaining one of the powers\nof a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかに、私たちがここにいるのは、この技術が人々を生かし、より多くの自由をもたらし、富と権力を再分配すると信じているからです。\n人々に自由をもたらし、富と権力を再分配してくれると信じているからです。\n\nもし、企業による中央集権的なコインが右往左往し始めているなら、それは不換紙幣よりも悪いものになるでしょう。\n不換紙幣よりも悪くなるでしょう。アマゾンやフェイスブックが、日本の企業の力の一つを手に入れるのが怖いです。\nの力を得るのが怖い。",
      "title": "フェイスブックやアマゾンに、暗号の採用と作成を働きかけるべきだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很明显，我们在这里是因为我们相信这项技术能给人们带来生命，带来\n更多的自由，并重新分配财富和权力。\n\n如果公司的集中式硬币开始左右开弓，它们将比法币更糟糕。\n会比法币更糟糕。我很害怕亚马逊和Facebook获得其中的权力\n的一个...",
      "title": "我们应该推动Facebook和亚马逊采用加密货币而不是创造加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很明顯，我們在這裏是因爲我們相信這項技術能給人們帶來生命，帶來\n更多的自由，並重新分配財富和權力。\n\n如果公司的集中式硬幣開始左右開弓，它們將比法幣更糟糕。\n會比法幣更糟糕。我很害怕亞馬遜和Facebook獲得其中的權力\n的一個...",
      "title": "我們應該推動Facebook和亞馬遜採用加密貨幣而不是創造加密貨幣"
    }
  ]
}