{
  "author": "Mattelambo",
  "original_created_utc": 1634900091,
  "title": "Citizens of El Salvador are up 43% on their Bitcoin!",
  "created_utc": 1634913126,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>El Salvador&#39;s best investment was president Bukele buying the dip this year!</p>\n\n<p>I know the amount of controversy surrounding the situation in El Salvador and their adoption of Bitcoin!</p>\n\n<p>But it’s just been over 1 month since it took place and it’s already 43% up, I really hope the people didn’t spend the 30$ they got from the chivo app! Because btc is now up 43% which is huge percentage for any kind of investment!</p>\n\n<p>I really do hope they also get the education because now I don’t want them to keep on buying with all their savings and then later in the dip they lose them all.. so yeah education is key and I hope El Salvador educated it’s citizens properly!</p>\n\n<p>Countries slowly shall adopt crypto so better keep stacking before they buy it all ! :)</p>\n</div><!-- SC_ON -->",
  "score": 409,
  "permalink": "/r/CryptoCurrency/comments/qdedak/citizens_of_el_salvador_are_up_43_on_their_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "qdedak",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "El Salvador's best investment was president Bukele buying the dip this year!\n\nI know the amount of controversy surrounding the situation in El Salvador and\ntheir adoption of Bitcoin!\n\nBut it’s just been over 1 month since it took place and it’s already 43% up, I\nreally hope the people didn’t spend…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルの最高の投資先は、今年のディップを買ったブケレ大統領だった!\n\nエルサルバドルの状況とビットコインの採用をめぐる論争の大きさを知っています。\nビットコインを採用していることを知っています。\n\nでも、あれから1ヶ月以上経っているのに、もう43％も上がっているんですよ。\n人々が使っていないことを祈るばかりです。",
      "title": "エルサルバドルの市民は、ビットコインで43％も上昇しています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "萨尔瓦多最好的投资是布克尔总统今年买入了跌停板!\n\n我知道围绕着萨尔瓦多的情况和他们采用比特币的情况有很多争议!\n他们对比特币的采用!\n\n但是，它刚刚发生了1个多月，它已经上涨了43%，我\n我真的希望人们没有花...",
      "title": "萨尔瓦多公民的比特币上涨了43%!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "薩爾瓦多最好的投資是布克爾總統今年買入了跌停板!\n\n我知道圍繞着薩爾瓦多的情況和他們採用比特幣的情況有很多爭議!\n他們對比特幣的採用!\n\n但是，它剛剛發生了1個多月，它已經上漲了43%，我\n我真的希望人們沒有花...",
      "title": "薩爾瓦多公民的比特幣上漲了43%!"
    }
  ]
}