{
  "author": "tfren99",
  "the_new_excerpt": "TLDR: Netflix portrayed crypto as pump and dumps and Ponzi schemes, without\nshowing the legit side or even explaining what crypto is.\n\nToday I watched Netflix's \"Money Explained\" docu-series. The Bitcoin logo was on\nthe thumbnail so I was intrigued. Turns out that was just clever…",
  "original_created_utc": 1621340691,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR: Netflixは、合法的な側面を示すことなく、またcryptoとは何かを説明することもなく、cryptoをパンプアンドダンプやネズミ講のように描いている。\n合法的な側面を見せず、暗号とは何かを説明することもなかった。\n\n今日、私はNetflixの「Money Explained」というドキュメントシリーズを見ました。サムネイルにBitcoinのロゴがあったので\nサムネイルにBitcoinのロゴがあったので、興味を持ちました。しかし、それは単に巧妙なだけだったことがわかりました。",
      "title": "Netflixの「Money Explained」シリーズでは、暗号とは何かという基本的な説明をすることなく、「暗号は詐欺だ」という物語に貢献しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简要记录：Netflix将加密货币描绘成抽水和倾倒以及庞氏骗局，而没有\n没有展示合法的一面，甚至没有解释加密货币是什么。\n\n今天我看了Netflix的 \"货币解释 \"系列纪录片。比特币的标志出现在\n缩略图，所以我很感兴趣。结果发现这只是聪明的...",
      "title": "在他们的 \"Money Explained \"系列中，Netflix助长了 \"加密货币是一个骗局 \"的说法，而不屑于对加密货币实际上是什么作出基本解释。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡要記錄：Netflix將加密貨幣描繪成抽水和傾倒以及龐氏騙局，而沒有\n沒有展示合法的一面，甚至沒有解釋加密貨幣是什麼。\n\n今天我看了Netflix的 \"貨幣解釋 \"系列紀錄片。比特幣的標誌出現在\n縮略圖，所以我很感興趣。結果發現這只是聰明的...",
      "title": "在他們的 \"Money Explained \"系列中，Netflix助長了 \"加密貨幣是一個騙局 \"的說法，而不屑於對加密貨幣實際上是什麼作出基本解釋。"
    }
  ],
  "title": "In their \"Money Explained\" series, Netflix contributes to the \"crypto is a scam\" narrative, without bothering to give a basic explanation of what crypto actually is.",
  "created_utc": 1621353194,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR: Netflix portrayed crypto as pump and dumps and Ponzi schemes, without showing the legit side or even explaining what crypto is.</strong></p>\n\n<p>Today I watched Netflix&#39;s &quot;Money Explained&quot; docu-series. The Bitcoin logo was on the thumbnail so I was intrigued. Turns out that was just clever targeted advertising.</p>\n\n<p>Of the five episodes in the series, crypto was only mentioned in one, &quot;Get Rich Quick&quot;. The episode covered various types of scams and mentioned crypto on two occasions:</p>\n\n<p>The first was as an example for a pump and dump. They introduced the concept of a pump and dump, then said something like &quot;this happens a lot with cryptocurrencies&quot;. Then they displayed two newspaper articles with the words &quot;Cryptocurrency&quot; and &quot;Bitcoin&quot; highlighted. I thought this was laughable for two reasons: first of all, pump and dumps existed well before cryptocurrency. I remember watching Jerry Orbach talk about a pump and dump in a 1990s Law and Order episode. Secondly, if you&#39;re going to try and disgrace crypto as a giant pump and dump, why would you use Bitcoin as an example? Fools.</p>\n\n<p>Then they covered Ponzi Schemes. To be fair, the scope of Ponzi schemes that they covered was a bit broader, but they still zeroed in on Bitconnect and Onecoin to really drive the point home. The only positive thing I can say about the episode was that they included Carlos Matos&#39; &quot;BITCONNNNEEEECCCCTTTTTT&quot;, so that was cool I guess. I&#39;m not denying that these are scams, I&#39;m just saying they didn&#39;t make any effort to show the legit side of crypto.</p>\n\n<p>All told, they portrayed crypto in a very negative light, and didn&#39;t bother to explain crypto at all. They just used it as an example for various scams. In fact, for a series that was supposed to be about money, they didn&#39;t talk about actually money all that much.</p>\n</div><!-- SC_ON -->",
  "score": 2463,
  "permalink": "/r/CryptoCurrency/comments/nf9ctt/in_their_money_explained_series_netflix/",
  "subreddit": "CryptoCurrency",
  "id": "nf9ctt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801352
}