{
  "author": "Idntwnt2choseusrnme",
  "original_created_utc": 1655292849,
  "title": "Why do we have to have a same sex kiss in a children’s / family movie?",
  "created_utc": 1655300646,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a liberal atheist and I have nothing against the LGBTQ+ community. I have gay friends and I completely believe that being gay is not a choice. \nI’ve actually been always on the side of the community in any arguments from conservative family or friends. &lt;/p&gt;\n\n&lt;p&gt;The controversy surrounding Lightyear’s same sex kiss doesn’t make any sense. To me it’s fine I can watch the movie with my 4 year old daughter and I’m sure she won’t make anything of it. As she grows older she will be asking questions and I’m 100% ready to answer it. I don’t believe any kid will turn gay by watching this and I’m not afraid of it. &lt;/p&gt;\n\n&lt;p&gt;My question is why does Hollywood have to go that way anyways. I feel that all productions are going out of their way to include LGBTQ+ content in it. Even though we don’t go out of our way to include handicapped characters, people with Down syndrome.. etc&lt;/p&gt;\n\n&lt;p&gt;I’m not arguing I’m genuinely asking what do we gain with including such content in productions and specially in a family movie?&lt;/p&gt;\n\n&lt;p&gt;Thanks&lt;/p&gt;\n\n&lt;p&gt;(I’m gonna get downvoted as hell 😂)&lt;/p&gt;\n\n&lt;p&gt;EDIT: Thanks for all the amazing comments, I respect your arguments and im trying to make sense of life around me just like everyone else. In some way those arguments could help me more in my discussions with conservative people specially the prospective of gays and queers growing up without representation. That’s mainly why i asked this question and it’s great to have wonderful minds like yourselves give me their points of view.\nThanks again&lt;/p&gt;\n\n&lt;p&gt;EDIT 2: I didn’t mean to be offensive to anyone and i apologize if anyone got the wrong impression from this. On the other hand I’m also seeing a major problem in our society now that anyone with an opposing view is immediately marked as a troll or a homophobic conservative pretending to have no issues with gay people. I’m getting great comments and help from civilized people but some are just plainly aggressive and i don’t see this as a civilized way to have a liberal discussion. The very definition of liberalism is to be open to other people’s points of view and have healthy discussions on topics without labeling people.&lt;/p&gt;\n\n&lt;p&gt;EDIT 3: apparently im a troll and i never knew it. Everyone here is absolutely sure of it&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 231,
  "permalink": "/r/TooAfraidToAsk/comments/vcsfm8/why_do_we_have_to_have_a_same_sex_kiss_in_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "vcsfm8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m a liberal atheist and I have nothing against the LGBTQ+ community. I have\ngay friends and I completely believe that being gay is not a choice. I’ve\nactually been always on the side of the community in any arguments from\nconservative family or friends.\n\nThe controversy surrounding Lightyear’s…"
}