{
  "author": "justopolis-city",
  "the_new_excerpt": "I don't know where I can really go for advice on this. My brother is 13 and\ncan't read, like at all. When I to try and find resources for help I don't find\nmuch. Could anyone point me in the right direction to help?\n\nFor context we're in Texas, and my parents \"unschool\" my siblings. Talking…",
  "original_created_utc": 1618512180,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当にどこに相談していいのかわかりません。私の弟は13歳で\n弟は13歳で、文字が全く読めません。助けを求めてリソースを探しても、あまり見つからないんです。\nあまり見つかりません。どなたか適切なアドバイスをいただけませんか？\n\n参考までに、私たちはテキサスに住んでいて、私の両親は私の兄弟を「アンスクール」しています。話す...",
      "title": "弟は13歳で読み書きができない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道我到底能去哪里咨询一下。我的弟弟是13岁，\n不能读，喜欢在所有。当我试图找到资源的帮助，我没有找到。\n多。谁能帮我指点一下？\n\n我们在德克萨斯州，我的父母对我的兄弟姐妹实行 \"无师自通\"。说到...",
      "title": "我弟弟13岁，不识字"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道我到底能去哪裏諮詢一下。我的弟弟是13歲，\n不能讀，喜歡在所有。當我試圖找到資源的幫助，我沒有找到。\n多。誰能幫我指點一下？\n\n我們在德克薩斯州，我的父母對我的兄弟姐妹實行 \"無師自通\"。說到...",
      "title": "我弟弟13歲，不識字"
    }
  ],
  "title": "My Brother is 13 and Illiterate",
  "created_utc": 1618516647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know where I can really go for advice on this. My brother is 13 and can&#39;t read, like at all. When I to try and find resources for help I don&#39;t find much. Could anyone point me in the right direction to help? </p>\n\n<p>For context we&#39;re in Texas, and my parents &quot;unschool&quot; my siblings. Talking with them is impossible on this subject, and they refuse to send my brother to school. They are currently putting him through a program called &quot;Brain Balance&quot;, and as far as I can research BrainBalance is a scam and doesn&#39;t have any evidence to support their claims. </p>\n\n<p>If nothing else if anyone knows who or where I can reach out for help that would be fantstic!</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/NoStupidQuestions/comments/mrl59h/my_brother_is_13_and_illiterate/",
  "subreddit": "NoStupidQuestions",
  "id": "mrl59h",
  "is_self": true,
  "media": null,
  "is_video": false
}