{
  "author": "pizzapicnic",
  "original_created_utc": 1655231494,
  "title": "it's okay to be happy you didn't get caught in the line of fire",
  "created_utc": 1655261792,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You didn&amp;#39;t hold Terra and you used coinbase instead of celsius. This doesn&amp;#39;t give you the right to run around calling people idiots saying &amp;quot;I told you so&amp;quot;. We&amp;#39;re supposed to be a community.  &lt;/p&gt;\n\n&lt;p&gt;This kind of behavior is why everyone thinks crypto people are a bunch of punk ass kids who are not to be taken seriously.  Its one thing to say &amp;quot;lessons learned, etc&amp;quot; and completely another to call someone r***** and tell them how much they deserve to lose their entire portfolio (even if it was only a %, that&amp;#39;s beside the point).&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s be nice to eachother. Some of us are going thru a pretty hard time right now. What benefit does it bring you to attack an innocent (probably a noob) crypto enthusiast? You really need the minor ego boost THAT badly? Were not eachothers enemies.&lt;/p&gt;\n\n&lt;p&gt;The same ones calling banks and hedge funds evil are probably a lot of the same ones laughing as they kick the fallen while they&amp;#39;re down.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/vca5sc/its_okay_to_be_happy_you_didnt_get_caught_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "vca5sc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You didn't hold Terra and you used coinbase instead of celsius. This doesn't\ngive you the right to run around calling people idiots saying \"I told you so\".\nWe're supposed to be a community.\n\nThis kind of behavior is why everyone thinks crypto people are a bunch of punk\nass kids who are not to be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テラを持たず、セルシオではなくcoinbaseを使ったんですね。だからといって\nだから言っただろう」と人を馬鹿にする権利はない。\n我々はコミュニティであるべきなんだ。\n\nこのような振る舞いをするから、暗号関係者はチンピラの集まりだと思われるのです。\nって思われてるんだよ...",
      "title": "ひのめにあたらなくてよかった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你没有持有Terra，你用coinbase而不是celsius。这并不意味着\n这并不意味着你有权利到处说别人是白痴，说 \"我告诉过你\"。\n我们应该是一个社区。\n\n这种行为就是为什么每个人都认为加密货币的人是一群朋克\n屁股的孩子，他们不应该...",
      "title": "庆幸自己没有被卷入火线也无妨"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你沒有持有Terra，你用coinbase而不是celsius。這並不意味着\n這並不意味着你有權利到處說別人是白癡，說 \"我告訴過你\"。\n我們應該是一個社區。\n\n這種行爲就是爲什麼每個人都認爲加密貨幣的人是一羣朋克\n屁股的孩子，他們不應該...",
      "title": "慶幸自己沒有被捲入火線也無妨"
    }
  ]
}