{
  "author": "ContributionNarrow88",
  "the_new_excerpt": "The following is from a Harvard Business School neuroscience based behavioural\ncourse I did.\n\nYour brain is your hype man, and tries very hard to prove you right using\nemotions as feedback. Once you decide on your goal, emotions are the hints your\nbrain uses to help you decide whether a certain…",
  "original_created_utc": 1606690119,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "以下内容摘自哈佛商学院神经科学基础上的行为学\n我当然这么做了。\n\n你的大脑是你的炒作对象，它会非常努力地用它来证明你是正确的。\n情绪作为反馈。一旦你决定了你的目标，情绪就是你\n大脑用来帮助你决定某个…是否",
      "title": "LPT：害怕什么？回避会让你变得更加困难，因为它会让你完全丧失力量。当唯一的出路是通过时，转身面对不适，深呼吸，向它走去。这是神经科学支持的，参见全文。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下內容摘自哈佛商學院神經科學基礎上的行為學\n我當然這麽做了。\n\n妳的大腦是妳的炒作對象，它會非常努力地用它來證明妳是正確的。\n情緒作為反饋。壹旦妳決定了妳的目標，情緒就是妳\n大腦用來幫助妳決定某個…是否",
      "title": "LPT：害怕什麽？回避會讓妳變得更加困難，因為它會讓妳完全喪失力量。當唯壹的出路是通過時，轉身面對不適，深呼吸，向它走去。這是神經科學支持的，參見全文。"
    }
  ],
  "title": "LPT: Dreading something? Avoidance makes it 100x harder because it completely disempowers you. When the only way out is through, turn and face the discomfort, take a deep breath and walk towards it. This is neuroscience-backed, see full post.",
  "created_utc": 1606762986,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The following is from a Harvard Business School neuroscience based behavioural course I did.</p>\n\n<p>Your brain is your hype man, and tries very hard to prove you right using emotions as feedback. Once you decide on your goal, emotions are the hints your brain uses to help you decide whether a certain situation HELPS or HINDERS your progression towards that goal. In turn, this influences your behaviour. Thoughts - Feelings - Behaviour. Nothing is inherently good or bad, it is all relative to what you are trying to achieve. Read that sentence again.</p>\n\n<p>If your goal is avoidance, then any progression or confrontation is going to feel very uncomfortable because your brain will be going &quot;nope, this is bad. This is not what you wanted. Sending bad feedback.&quot; You can just as easily shift your goal (this is what mindset is, and it IS up to you) and in turn, change your brain&#39;s response to the stimulus around you (emotions). Even if it is an uncomfortable situation, your brain will recognise that it&#39;s helping you achieve your goal, so the feedback it gives you (emotions) will be much more positive. It all starts with what you want to achieve and if you don&#39;t know, then spend some time figuring that out. Goal clarity is like giving your brain a quest marker.</p>\n\n<p>You are hardwired for struggle, go forth in courage my comrades!</p>\n</div><!-- SC_ON -->",
  "score": 67136,
  "permalink": "/r/LifeProTips/comments/k3j7g7/lpt_dreading_something_avoidance_makes_it_100x/",
  "subreddit": "LifeProTips",
  "id": "k3j7g7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260389667
}