{
  "author": "subcow",
  "the_new_excerpt": "I've been contemplating posting here for some time, since I've been primarily a\nlurker for years, but I see that there are a lot of new people here who are in\nthe same boat I was a few years ago.\n\nDuring the last run there was a ton of shilling for a lot of crap coins. I\ndidn't know what to do so I…",
  "original_created_utc": 1613689136,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我考虑在这里发帖已经有一段时间了，因为我主要是一个。\n潜伏多年，但我看到这里有很多新的人，他们在\n几年前我也是同一条船。\n\n在上一次的运行中，有大量的先令换了很多垃圾币。I\n不知道该怎么办，所以我... ...",
      "title": "在2018年最后一次跑牛过程中，我学到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我考慮在這裏發帖已經有一段時間了，因爲我主要是一個。\n潛伏多年，但我看到這裏有很多新的人，他們在\n幾年前我也是同一條船。\n\n在上一次的運行中，有大量的先令換了很多垃圾幣。I\n不知道該怎麼辦，所以我... ...",
      "title": "在2018年最後一次跑牛過程中，我學到了什麼？"
    }
  ],
  "title": "What I learned during the last Bull run in 2018",
  "created_utc": 1613739271,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been contemplating posting here for some time, since I&#39;ve been primarily a lurker for years, but I see that there are a lot of new people here who are in the same boat I was a few years ago.  </p>\n\n<p>During the last run there was a ton of shilling for a lot of crap coins. I didn&#39;t know what to do so I bet on a lot of horses. In total, I bought about 25 different coins. About 2/3rds of those bets were terrible bets and those coins are practically worthless now. Make sure you do research, and don&#39;t impulse buy because someone or some other subreddit is hyping a coin.  </p>\n\n<p>During the last run, in just a few months time, my portfolio was worth 3x my initial investment. The problem is, I thought it was just going to keep going up. It did not. Until the last few weeks, I&#39;ve been in the red. So this time, I&#39;ve taken out some profits, and I plan to conservatively take out more profits over the next few weeks. But for the projects I think will work long term I am making sure to hodl at least a portion of my coins. If I take out profits, I plan on reinvesting back in them if there is a major dip. The coins I hold that are in the green now are all ones that I think have long term potential.  </p>\n\n<p>So my basic advice for any noobs are<br/>\n1) Obviously don&#39;t invest money you can&#39;t afford to lose.<br/>\n2) Don&#39;t impulse buy.<br/>\n3) Have an exit plan, and take out some profits when you can. When you take out profits don&#39;t be upset if that coin continues to pump after you sell. Just be happy you made a profit.<br/>\n4) Have a long term investment plan, and be realistic about potential profits.<br/>\n5) Keep track of your transactions. The tax man will come after you.<br/>\n6) Don&#39;t keep your coins in the exchange. I got burned by the BitGrail scam. Put your coins in a wallet.  </p>\n\n<p>I hope this is helpful, and I hope the crypto pros here agree that this advice is useful for those new to the space.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/lmzw0k/what_i_learned_during_the_last_bull_run_in_2018/",
  "subreddit": "CryptoCurrency",
  "id": "lmzw0k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332875933
}