{
  "author": "GrilledSoap",
  "original_created_utc": 1653408024,
  "title": "If Tsar Nicholas II was so desperate for an heir but kept having daughters, what was stopping him from just changing the rule to allow his oldest daughter to inherit?",
  "created_utc": 1653423129,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A female Tsar of Russia wasn&amp;#39;t unheard of before and the Tsar was second only to God in Russia from an authority standpoint. So if he just one day decided to make his eldest daughter his official heir, could anyone even question him?&lt;/p&gt;\n\n&lt;p&gt;After seeing the turmoil the quest for a male heir, and the subsequent issues with Alexei which played a part in the crumbling of the Royal family with the whole Rasputin thing, it seems like he could have avoided a lot of trouble if he just changed the rule.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/uwu6av/if_tsar_nicholas_ii_was_so_desperate_for_an_heir/",
  "subreddit": "AskHistorians",
  "id": "uwu6av",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A female Tsar of Russia wasn't unheard of before and the Tsar was second only to\nGod in Russia from an authority standpoint. So if he just one day decided to\nmake his eldest daughter his official heir, could anyone even question him?\n\nAfter seeing the turmoil the quest for a male heir, and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシアの女性ツァーリは以前から前代未聞ではなく、ツァーリに次いで\nロシアでは神に次ぐ権威でした。だから、もし彼がある日突然\nある日突然、長女を正式な後継者にすると決めたら、誰も疑わないのでしょうか？\n\n跡継ぎ男子をめぐる騒動、そして......。",
      "title": "もし、ニコライ2世が跡継ぎを切望していたのに娘を産み続けたのなら、長女に相続させるというルールを変えることをなぜ止めなかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "俄罗斯的女沙皇以前也不是没有听说过，在俄罗斯，沙皇的地位仅次于上帝。\n从权威的角度看，沙皇在俄国仅次于上帝。因此，如果他有一天决定\n让他的长女成为他的正式继承人，有人会质疑他吗？\n\n在看到寻求男性继承人的动荡局面，以及对他来说，这是个很好的机会。",
      "title": "如果沙皇尼古拉二世如此迫切地想要一个继承人，却一直在生女儿，那么是什么阻止了他直接改变规则，让他的大女儿继承遗产？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "俄羅斯的女沙皇以前也不是沒有聽說過，在俄羅斯，沙皇的地位僅次於上帝。\n從權威的角度看，沙皇在俄國僅次於上帝。因此，如果他有一天決定\n讓他的長女成爲他的正式繼承人，有人會質疑他嗎？\n\n在看到尋求男性繼承人的動盪局面，以及對他來說，這是個很好的機會。",
      "title": "如果沙皇尼古拉二世如此迫切地想要一個繼承人，卻一直在生女兒，那麼是什麼阻止了他直接改變規則，讓他的大女兒繼承遺產？"
    }
  ]
}