{
  "author": "dragondude4",
  "original_created_utc": 1626191890,
  "title": "No, the US Dollar is Not on the Verge of Collapse, Nor Will it Be Replaced by your favorite Cryptocurrency.",
  "created_utc": 1626201038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The U.S. is one of the world’s two largest economies and the center of the English-speaking world. It has the power to tax, the strongest network of alliances and the most powerful military. Yes, it has printed a lot of dollars since 2008, but it also has <a href=\"https://www.frbsf.org/education/publications/doctor-econ/2013/march/federal-reserve-interest-balances-reserves/\">taken steps</a> to lower the speed at which those dollars circulate.</p>\n\n<p>Yes, rates of price inflation are likely to be higher for the next two years or so, but already some of the immediate inflationary pressures are abating; lumber prices, for instance, are now <a href=\"https://www.bloomberg.com/news/articles/2021-06-11/lumber-prices-post-biggest-ever-weekly-drop-with-buyers-balking?sref=EP6bV7CS\">plummeting</a>. Over a 10-year time horizon, the U.S. government can <a href=\"https://www.bloomberg.com/markets/rates-bonds/government-bonds/us\">borrow</a> at a near-zero real rate of interest, hardly a sign of a doomed empire.</p>\n\n<p>Nor is the U.S. government about to go broke or on the brink of resorting to hyperinflation. The U.S. debt-to-GDP ratio may well hit 200%, but the poorer and smaller nation of Japan is doing OK with similar debt levels. Keep in mind that national wealth, while difficult to estimate, may run as much as six to eight times higher than GDP. So a 200% debt-to-income ratio could mean a debt-to-wealth ratio as low as 25%. That’s hardly the end of the world. Think of how comfortable you’d be if you paid off “only” 75% of your mortgage.</p>\n\n<p>If anything, crypto is more likely to hurt the currencies of countries that are doing very poorly, <a href=\"https://www.coindesk.com/bitcoin-adoption-venezuela-research\">such as Venezuela</a>. Fiat currency won’t just go away, so over the long run crypto could actually boost the value of the dollar by stifling the rise of potential competitors. Don&#39;t downvote this just because it doesn&#39;t fuel the confirmation bias, just think rationally.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/tomY2QWBqWmoK7uRguJfIp7C6KJUu58UCDOzLnR0N0I.jpg?auto=webp&s=78d531f6250ccb30f9a91d9dc6cfadb95eb71405",
          "width": 100,
          "height": 100
        },
        "resolutions": [],
        "variants": {},
        "id": "LcgCbweP8ZI6IVqxSaIUzgqbPnHD3K7rRQOSWpbuBwU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ojikfn/no_the_us_dollar_is_not_on_the_verge_of_collapse/",
  "subreddit": "CryptoCurrency",
  "id": "ojikfn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The U.S. is one of the world’s two largest economies and the center of the\nEnglish-speaking world. It has the power to tax, the strongest network of\nalliances and the most powerful military. Yes, it has printed a lot of dollars\nsince 2008, but it also has taken…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国は、世界の二大経済大国の一つであり、英語圏の中心地でもあります。\nアメリカは世界の二大経済大国であり、英語圏の中心です。課税権を持ち、最強の同盟ネットワークと最強の軍事力を持っています。\n最強の同盟ネットワークと最強の軍隊を持っている。確かに、2008年以降、大量のドルを発行しました。\n2008年以降、大量のドルを刷ったが、それだけではなく...",
      "title": "いいえ、米ドルは崩壊寸前でもなければ、お気に入りの暗号通貨に取って代わられることもありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国是世界上最大的两个经济体之一，也是英语世界的中心。\n英语世界的中心。它有征税的权力，有最强大的联盟网络和最强大的军队。\n联盟和最强大的军队。是的，自2008年以来，它印制了大量的美元\n自2008年以来，它已经印制了大量美元，但它也采取了...",
      "title": "不，美元没有处于崩溃的边缘，也不会被你最喜欢的加密货币所取代。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國是世界上最大的兩個經濟體之一，也是英語世界的中心。\n英語世界的中心。它有徵稅的權力，有最強大的聯盟網絡和最強大的軍隊。\n聯盟和最強大的軍隊。是的，自2008年以來，它印製了大量的美元\n自2008年以來，它已經印製了大量美元，但它也採取了...",
      "title": "不，美元沒有處於崩潰的邊緣，也不會被你最喜歡的加密貨幣所取代。"
    }
  ]
}