{
  "author": "AcidArchitect",
  "original_created_utc": 1635276372,
  "title": "I want to sell some of my crypto to buy a land and plant trees",
  "created_utc": 1635288095,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Guys, I want to withdraw some of my crypto.  After a long period, I am finally in the green, even in a small profit.  </p>\n\n<p>I live in one of the poorest and most polluted countries in Europe.<br/>\nNear the city where I live, a fellow citizen bought a large plot of land a few years ago and now wants to afforest it.  </p>\n\n<p>My goal is to sell some crypto and buy some land next to his, to revitalize the depleted soil by planting trees, save some animals and introduce diverse plant and insect life in the area.  </p>\n\n<p>I think this is the smartest thing I can do with my money.  I can always DCA back my portfolio.  </p>\n\n<p>This project is ment to stay in the heretage of my city and the Earth for the future generations and the community.  I will be ready to start the forestation in February if things go according to plan.  </p>\n\n<p>I will call it Crypto Forest.  </p>\n\n<p>Wish me luck.</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/qge36p/i_want_to_sell_some_of_my_crypto_to_buy_a_land/",
  "subreddit": "CryptoCurrency",
  "id": "qge36p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Guys, I want to withdraw some of my crypto. After a long period, I am finally in\nthe green, even in a small profit.\n\nI live in one of the poorest and most polluted countries in Europe.\nNear the city where I live, a fellow citizen bought a large plot of land a few\nyears ago and now wants to afforest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんな、自分の暗号の一部を引き出したいんだけど。長い期間を経て、ようやく私は\n僅かながらも利益が出ています。\n\n私はヨーロッパで最も貧しく、最も汚染された国の一つに住んでいます。\n私が住んでいる街の近くに、ある市民が数年前に大きな土地を購入しました。\n数年前に大きな土地を購入し、今では森林保護をしたいと考えています。",
      "title": "暗号の一部を売って土地を買い、木を植えたい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "伙计们，我想提取一些我的加密货币。经过很长一段时间，我终于有了\n绿色的，甚至是小的利润。\n\n我住在欧洲最贫穷、污染最严重的国家之一。\n在我居住的城市附近，一个同胞买了一大块地，几\n几年前买了一大片土地，现在想要造林......",
      "title": "我想卖掉我的一些加密货币，买一块地，种上树。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "夥計們，我想提取一些我的加密貨幣。經過很長一段時間，我終於有了\n綠色的，甚至是小的利潤。\n\n我住在歐洲最貧窮、污染最嚴重的國家之一。\n在我居住的城市附近，一個同胞買了一大塊地，幾\n幾年前買了一大片土地，現在想要造林......",
      "title": "我想賣掉我的一些加密貨幣，買一塊地，種上樹。"
    }
  ]
}