{
  "author": "WilfredCoinfomania",
  "the_new_excerpt": "Earlier today, the US Federal Reserve's payment system that allows banks to send\nmoney went down for several hours, despite the millions of dollars spent on\nmaintaining it.\n\nOn the other hand, the Bitcoin network never goes down and still maintains a\n99.9% uptime since launching.\n\nIf has continued…",
  "original_created_utc": 1614218877,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天早些时候，美国联邦储备委员会的支付系统，允许银行发\n钱下降了几个小时，尽管花了几百万美元在\n维护它。\n\n另一方面，比特币网络永远不会宕机，仍然保持着一个\n自上线以来，99.9%的正常运行时间。\n\n如果已经继续...",
      "title": "美国联储未能与比特币的正常运行时间相匹配。游戏开始"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早些時候，美國聯邦儲備委員會的支付系統，允許銀行發\n錢下降了幾個小時，儘管花了幾百萬美元在\n維護它。\n\n另一方面，比特幣網絡永遠不會宕機，仍然保持着一個\n自上線以來，99.9%的正常運行時間。\n\n如果已經繼續...",
      "title": "美國聯儲未能與比特幣的正常運行時間相匹配。遊戲開始"
    }
  ],
  "title": "U.S Federal Reserve Fails to Match Bitcoin's Uptime: Game On",
  "created_utc": 1614257335,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earlier today, the US Federal Reserve&#39;s payment system that allows banks to send money went down for several hours, despite the millions of dollars spent on maintaining it.</p>\n\n<p>On the other hand, the Bitcoin network never goes down and still maintains a 99.9% uptime since launching.</p>\n\n<p>If has continued mining block after block and working as designed. </p>\n\n<p>No breaks, no holidays and yet Yellen calls it an inefficient &quot;payment system.&quot;</p>\n\n<p>Can you imagine what the media reports would have looked like if it was Bitcoin that went offline for even an hour?</p>\n\n<p>If you can&#39;t imagine it, then you will definitely agree this win is worth celebrating.</p>\n\n<p>Decentralization is the future!</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/lruqrc/us_federal_reserve_fails_to_match_bitcoins_uptime/",
  "subreddit": "CryptoCurrency",
  "id": "lruqrc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937733631
}