{
  "author": "Hsiang7",
  "original_created_utc": 1626004920,
  "title": "Does anyone else feel like they need at LEAST one full Bitcoin and ETH before they're satisfied with their portfolio?",
  "created_utc": 1626017693,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seeing not even a full number for my position on BTC and ETH just bothers me somewhere deep inside, and I feel like I need at least one full coin of both BTC and ETH before I can relax and let my portfolio grow. Just having a fraction of a coin isn&#39;t enough for my OCD I guess lol.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/oi37sj/does_anyone_else_feel_like_they_need_at_least_one/",
  "subreddit": "CryptoCurrency",
  "id": "oi37sj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seeing not even a full number for my position on BTC and ETH just bothers me\nsomewhere deep inside, and I feel like I need at least one full coin of both BTC\nand ETH before I can relax and let my portfolio grow. Just having a fraction of\na coin isn't enough for my OCD I guess lol.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCやETHの自分のポジションの数が一杯になっていないのを見ると、心のどこかで気になります。\n心のどこかで気になっていて、リラックスしてポートフォリオを成長させるためには、BTCとETHの両方で少なくとも1コインが必要だと感じています。\nとETHの両方を最低でも1コインずつ持っていないと、リラックスしてポートフォリオを増やすことができないと感じています。コインの何分の一かを持っているだけで\n私の強迫性障害にとっては、コインの端数を持っているだけでは十分ではないようです(笑)。",
      "title": "自分のポートフォリオに満足するまでに、LEAST1回分のビットコインとETHが必要だと感じる人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看到我在BTC和ETH上的头寸连一个完整的数字都没有，这让我很烦恼\n我觉得我至少需要一个完整的BTC\n和ETH，然后我才能放松，让我的投资组合增长。只是拥有一小部分的\n我想，对于我的强迫症来说，仅仅拥有一个硬币是不够的。",
      "title": "还有人觉得他们至少需要一个完整的比特币和ETH才能对他们的投资组合感到满意吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到我在BTC和ETH上的頭寸連一個完整的數字都沒有，這讓我很煩惱\n我覺得我至少需要一個完整的BTC\n和ETH，然後我才能放鬆，讓我的投資組合增長。只是擁有一小部分的\n我想，對於我的強迫症來說，僅僅擁有一個硬幣是不夠的。",
      "title": "還有人覺得他們至少需要一個完整的比特幣和ETH才能對他們的投資組合感到滿意嗎？"
    }
  ]
}