{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1637673248,
  "title": "Over 60% of investors borrow money to fund highly volatile cryptocurrency purchases",
  "created_utc": 1637685554,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a recent <a href=\"https://www.kisbridgingloans.co.uk/finance-news/cryptocurrency-consumer-research-and-data-autumn-2021/\">study by KIS Finance</a>, it was revealed that over two thirds of cryptocurrency investors borrowed money to make their purchase, rather than using income and/or savings.  </p>\n\n<p>Overall, more than two thirds (64%) of those who have invested in cryptos, used one or more credit facilities to do so.  </p>\n\n<p>Cryptocurrencies are highly volatile and a risky way to invest large sums of money. Bitcoin, for example, has been in the news in recent weeks as it reached a value of over $64,000 (approx.. £47,800). This would have undoubtedly brought in new investors as they try to take advantage of the price increase. However, in just seven days, the value has dropped by over $7,000 (approx. £5,200) to a value of just over $56,000 (approx. £41,800) per coin.  </p>\n\n<p>Percentage of crypto investors who used one or more credit facilities to fund purchase, by age  </p>\n\n<p>18 - 24: 70%<br/>\n25 - 34: 64%<br/>\n35 - 44: 68.9%<br/>\n45 - 54: 62.5%<br/>\n55 - 64: 45%<br/>\n65+: 25%  </p>\n\n<p>As the data shows, those aged between 18 and 24 were the age group most likely to use borrowed funds to make their investment, with a significant drop of borrowers in the two highest age groups.  </p>\n\n<p>What type of credit facilities have people used to fund cryptocurrency investments?  </p>\n\n<p>When we break down what kinds of credit facilities people have used to purchase cryptocurrencies, over a third (35.5%) made their investment using a credit card. Almost a fifth (19.3%) funded the purchase out of their overdraft.  </p>\n\n<p>Credit card: 35.5%<br/>\nOverdraft: 19.3%<br/>\nPersonal loan: 14.6%<br/>\nSecured loan: 9%<br/>\nPayday loan: 7.6%<br/>\nRe-mortgage: 3.3%  </p>\n\n<p>Holly Andrews, Managing Director at <a href=\"https://www.kisbridgingloans.co.uk/\">KIS Finance</a>, comments on the findings.  </p>\n\n<p>“In recent years, cryptocurrencies have become far more mainstream with tech giant PayPal now offering a cryptocurrency trading platform.  </p>\n\n<p>Although cryptos, and specifically Bitcoin, have seen people make thousands or even millions in profit; the last week or so has shown that they are incredibly volatile and can see investors losing massive percentages of what they put in very quickly.  </p>\n\n<p>It’s concerning that so many people have turned to borrowed funds to purchase cryptocurrencies as they are extremely unpredictable and offer no guarantees that the money invested will be returned. So, if people are spending money that they don’t have, and losing it, this could cause some serious financial challenges later down the line.  </p>\n\n<p>The biggest concern is whether people will have the ability to pay the money back. With a very strong possibility of losing the money for good, people may be left severely out of pocket and racking up interest on their credit cards and overdrafts. Also, some credit card providers will view this type of transaction as a cash advance, meaning a cash advance fee and higher interest rate will be applied.  </p>\n\n<p>So, if you are thinking of making an investment into cryptocurrencies, you should only invest an amount of money that you can afford to lose and it should be funded through income and/or savings rather than a credit facility.  </p>\n\n<p>Borrowing money to invest in cryptos can become a very vicious cycle that’s difficult to break. Once you start losing money, it can be very tempting to invest more to make the money back; especially if you don’t have other means of repaying the funds.  </p>\n\n<p>Great care should be taken when you invest money anywhere, but especially when it’s something as volatile as cryptocurrencies. If you can, seek some professional financial advice first and never invest more than you can afford. Buying cryptocurrencies should also not be your only form of investment or savings as there is very little stability – spread your investments out and treat cryptocurrencies as a smaller, fun investment.”</p>\n</div><!-- SC_ON -->",
  "score": 225,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/dnHh0vNF6cVh-62MhVzkcliFl6lA2TCPyTfLGnf4QQU.jpg?auto=webp&s=b2965c7f972cb3189e2f027266fcf874a79f9b9f",
          "width": 800,
          "height": 400
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/dnHh0vNF6cVh-62MhVzkcliFl6lA2TCPyTfLGnf4QQU.jpg?width=108&crop=smart&auto=webp&s=eddb518ee40f11793a916491c6a503704f38a429",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/dnHh0vNF6cVh-62MhVzkcliFl6lA2TCPyTfLGnf4QQU.jpg?width=216&crop=smart&auto=webp&s=88d6ff0b8b4edd9c6048f10e7d6b598c1308f723",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/dnHh0vNF6cVh-62MhVzkcliFl6lA2TCPyTfLGnf4QQU.jpg?width=320&crop=smart&auto=webp&s=66622f89ccac10de6f309c9099396a8e10fcde21",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/dnHh0vNF6cVh-62MhVzkcliFl6lA2TCPyTfLGnf4QQU.jpg?width=640&crop=smart&auto=webp&s=307e7f4d1ff237168bb6e163e12d3364f8d563b8",
            "width": 640,
            "height": 320
          }
        ],
        "variants": {},
        "id": "h-GmUgk4bO4vUGS74yZ_Be03T50l9GnRck_raYMX9iY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r0cz13/over_60_of_investors_borrow_money_to_fund_highly/",
  "subreddit": "CryptoCurrency",
  "id": "r0cz13",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In a recent study by KIS Finance\n[https://www.kisbridgingloans.co.uk/finance-news/cryptocurrency-consumer-research-and-data-autumn-2021/],\nit was revealed that over two thirds of cryptocurrency investors borrowed money\nto make their purchase, rather than using income and/or savings.\n\nOverall, more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "KISファイナンスの最近の調査では\n[https://www.kisbridgingloans.co.uk/finance-news/cryptocurrency-consumer-research-and-data-autumn-2021/]を参照してください。\n暗号通貨の投資家の3分の2以上が借金をしていることが明らかになりました。\n収入や貯蓄ではなく、お金を借りて購入したことが明らかになりました。\n\n全体として、より多くの...",
      "title": "60%以上の投資家が、ボラティリティの高い暗号通貨の購入資金としてお金を借りています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在KIS金融公司最近的一项研究中\n[https://www.kisbridgingloans.co.uk/finance-news/cryptocurrency-consumer-research-and-data-autumn-2021/]。\n它显示，超过三分之二的加密货币投资者借钱\n来进行购买，而不是使用收入和/或储蓄。\n\n总体而言，更多...",
      "title": "超过60%的投资者借钱为购买高度波动的加密货币提供资金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在KIS金融公司最近的一項研究中\n[https://www.kisbridgingloans.co.uk/finance-news/cryptocurrency-consumer-research-and-data-autumn-2021/]。\n它顯示，超過三分之二的加密貨幣投資者借錢\n來進行購買，而不是使用收入和/或儲蓄。\n\n總體而言，更多...",
      "title": "超過60%的投資者借錢爲購買高度波動的加密貨幣提供資金"
    }
  ]
}