{
  "author": "Alwaysonlearnin",
  "original_created_utc": 1636613320,
  "title": "Why is everyone so sure about crypto “cycles”?",
  "created_utc": 1636637660,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto is literally barely a decade old and the whole four year cycle thing could easily be a coincidence. Why is everyone just waiting for the prices to dump instead of focusing on industry growth.</p>\n\n<p>I just think with how volatile and reactive the market is how can that be a “cycle,” where would btc be right now if mt gox or Silk Road never happened? Would shitcoins or even bitcoin have the same momentum they have now without Elon’s hype of Tesla’s purchase+talk of using bitcoin for payment or Dogecoin’s initial massive pump?</p>\n\n<p>Crypto is creating entirely new tech, use cases, and really creating value out of thin air, how is that predictable or follow a cycle?</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/qrf7po/why_is_everyone_so_sure_about_crypto_cycles/",
  "subreddit": "CryptoCurrency",
  "id": "qrf7po",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto is literally barely a decade old and the whole four year cycle thing\ncould easily be a coincidence. Why is everyone just waiting for the prices to\ndump instead of focusing on industry growth.\n\nI just think with how volatile and reactive the market is how can that be a\n“cycle,” where would btc…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は文字通りわずか10年の歴史しかなく、4年周期というのは偶然の産物かもしれません。\nは偶然の産物である可能性があります。なぜ皆、業界の成長に注目せず、価格が下がるのを待っているのか\nなぜ皆、業界の成長に焦点を当てずに、価格が下がるのを待つのでしょうか。\n\n市場がいかに不安定で反応しやすいかを考えると、これが「サイクル」であるはずがないと思うのです。\n「サイクル」とは言えないのではないでしょうか。",
      "title": "なぜ皆、暗号の「サイクル」を確信しているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "隐性货币几乎没有十年的历史，整个四年周期的事情\n很可能是一个巧合。为什么每个人都在等待价格下跌，而不是关注行业增长。\n而不是专注于行业增长。\n\n我只是认为，市场的波动性和反应性如此之大，这怎么可能是一个\n\"周期\"，BTC在哪里...",
      "title": "为什么每个人都对加密货币的 \"周期 \"如此肯定？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隱性貨幣幾乎沒有十年的歷史，整個四年週期的事情\n很可能是一個巧合。爲什麼每個人都在等待價格下跌，而不是關注行業增長。\n而不是專注於行業增長。\n\n我只是認爲，市場的波動性和反應性如此之大，這怎麼可能是一個\n\"週期\"，BTC在哪裏...",
      "title": "爲什麼每個人都對加密貨幣的 \"週期 \"如此肯定？"
    }
  ]
}