{
  "author": "isaac_horstmeier",
  "original_created_utc": 1632253760,
  "title": "Reasons on why we're still early.",
  "created_utc": 1632325398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those of you who&#39;re worried about your investment, or maybe you&#39;re thinking on buying more, or you bought at a certain price point, and you&#39;re not having the profits that Bitboy was promising, you might be interested on looking at some of this information.</p>\n\n<p>First, let&#39;s take a look at this graphic on the Adoption (expected) curve on blockchain technology by the industry.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/demakbjpnwo71.png?width=1201&amp;format=png&amp;auto=webp&amp;s=f2f6919fe9348af2386a138d5b6ccd25472c8048\">Adoption curve (made in 2017).</a></p>\n\n<p>As you can see, we&#39;re about to hit the halfway point of adoption, and I believe this graph it&#39;s being very modest, after all it was made on 2017, and the technology has grown bigger and better since then, now we have more and more uses for crypto, new projects comming with new and better ideas to help on a lot of real life problems, or real life already existing business.</p>\n\n<p>Now, if we take a look at other past technologies adoption curves, with real life data, we get something like this, the so called Technology S-Curves.</p>\n\n<p><a href=\"https://preview.redd.it/9r7j15uumwo71.png?width=875&amp;format=png&amp;auto=webp&amp;s=8508e6385cd16634228a78e94a1efad079b045a0\">&#37; Penetration of Technologies on the US market.</a></p>\n\n<p>We get a type of S shape curve, with almost every technology.  It took half a century for electricity to be widely adopted in the US, a quarter of a century for half the population to get TVs, but mobile phone adoption took only half that time. </p>\n\n<p>Now let&#39;s compare one of the fastest adopted technologies of all time, The Internet adoption rate vs Bitcoin price. But before that, you must know that as of January 2021 there were 4.66 billion active internet users worldwide - <strong>59.5 percent</strong> of the global population. Of this total, 92.6 percent (4.32 billion) accessed the internet via mobile devices.</p>\n\n<p>A fun fact, computers and internet goes back to 1,960. A computer cost was 700,000 usd (4,6m on todays price). And the first message ever sent was the word “lo;” the researchers were trying to type the word “login” and the system crashed after two letters. Crypto will have his errors, bugs, trial and dumps, but this is expected on a new technology.</p>\n\n<p><a href=\"https://preview.redd.it/m6567fd0owo71.png?width=1501&amp;format=png&amp;auto=webp&amp;s=ffaa795aa6bb8073f2abac5b4a4d34f720b7a8e9\">Internet adoption vs Bitcoin price.</a></p>\n\n<p>According to this graph, we are yet to see, the real price of BTC, and it is quite accurate on the price point we&#39;re seeing today. </p>\n\n<p>What about the offline people, those who have never used the internet before?</p>\n\n<p><a href=\"https://preview.redd.it/ont7ve40qwo71.png?width=1200&amp;format=png&amp;auto=webp&amp;s=bec34a70b6c32236a70d22862f780f29dd1c643f\">US offline population.</a></p>\n\n<p>On the US there&#39;s only 7% of people that have never ever used the internet. That&#39;s a little bit mindblowing for me, at this day and age.</p>\n\n<p>Now, let&#39;s see how it&#39;s BTC beating the adoption speed of the Internet, and not according to me, but from Michael Levin, a former Google employee.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hugi9ltnqwo71.png?width=875&amp;format=png&amp;auto=webp&amp;s=ca97566f588ff86eb397f76d104f1a6483a3e6ac\">Internet vs BTC adoption, via Michael Levin.</a></p>\n\n<p>&quot;In only 12 years, Levin estimates that BTC reached 135 million users today with projections to have 1 billion users by 2025. It’s possible to distinguish that when the Internet was at the same point in its adoption curve, it took 7.5 years to reach 1 billion users. BTC will do the same in almost half the time. And can you imagine that, BTC reaching a 1 billion users? That would be huge for the entire ecosystem&quot;. </p>\n\n<p>Now, what about the new adresses, and the creation of wallets.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/shitxaijtwo71.png?width=1800&amp;format=png&amp;auto=webp&amp;s=3bb29e436ce14cb797907a6005ceef3a91da45b4\"> Bitcoin network growth.</a></p>\n\n<p>We had a massive peak on 2017-2018, that was when we had a massive dump, and also one of the biggest if not the biggest bull run of all time.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5myu5dcirwo71.png?width=680&amp;format=png&amp;auto=webp&amp;s=e1dab17e5ebadb281acf1d38acde13a3e202f621\">Bitcoin goes Omnipresent.</a></p>\n\n<p>Now I know, that sounds like a God (Omnipresent), but let&#39;s face it, based on all the facts, and a little bit of speculation, we can see that Bitcoin and the whole crypto community will take a huge adoption speed rate, and we&#39;re seeing it right now, most of all this present year, with even countries like El Salvador, making bitcoin part of the entire financial system.</p>\n\n<p>I&#39;m not worried about a dip, a red day, or anything like that. I believe on this new technology, and the present power that it has to change the world. </p>\n\n<p>Anyhow, hope this post was helpful, and made you get a better perspective on the entire ecosystem.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/psqgsh/reasons_on_why_were_still_early/",
  "subreddit": "CryptoCurrency",
  "id": "psqgsh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For those of you who're worried about your investment, or maybe you're thinking\non buying more, or you bought at a certain price point, and you're not having\nthe profits that Bitboy was promising, you might be interested on looking at\nsome of this information.\n\nFirst, let's take a look at this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資に不安を感じている方、買い足しを考えている方、一定の価格帯で購入したのに\n買い足そうと思っている方、ある価格帯で購入したが利益が出ていない方\nビットボーイが約束していたような利益を得られていない人は、この情報を見て興味を持つかもしれません。\nこれらの情報を見てみましょう。\n\nまず、これを見てみましょう。",
      "title": "なぜまだ早いのか、その理由。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些担心你的投资的人，或者你正在考虑\n买更多的东西，或者你在某个价位上买了，但你没有得到\n的利润，你可能有兴趣看一下\n这些信息的一部分。\n\n首先，让我们看一下这个...",
      "title": "关于为什么我们还在早期的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些擔心你的投資的人，或者你正在考慮\n買更多的東西，或者你在某個價位上買了，但你沒有得到\n的利潤，你可能有興趣看一下\n這些信息的一部分。\n\n首先，讓我們看一下這個...",
      "title": "關於爲什麼我們還在早期的原因。"
    }
  ]
}