{
  "author": "3STmotivation",
  "the_new_excerpt": "I wanted to bring you all another post on the uranium sector after the massive\nrun up we have seen in equity prices over the past few weeks. A lot of people\nhave been worried about this run being unsustainable, because of a lack of\nmovement in spot price. Others have pointed to it being blind…",
  "original_created_utc": 1616266438,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想给大家再带来一篇关于铀板块的文章，在大量的\n在过去的几周里，我们看到股票价格的上涨。很多人\n一直担心这种运行是不可持续的，因为缺乏。\n现货价格的变动。也有人指出是盲目...",
      "title": "铀，周期已经转折，下一阶段即将到来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想給大家再帶來一篇關於鈾板塊的文章，在大量的\n在過去的幾周裏，我們看到股票價格的上漲。很多人\n一直擔心這種運行是不可持續的，因爲缺乏。\n現貨價格的變動。也有人指出是盲目...",
      "title": "鈾，週期已經轉折，下一階段即將到來。"
    }
  ],
  "title": "Uranium, the cycle has turned and the next phase is on the horizon",
  "created_utc": 1616277006,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanted to bring you all another post on the uranium sector after the massive run up we have seen in equity prices over the past few weeks. A lot of people have been worried about this run being unsustainable, because of a lack of movement in spot price. Others have pointed to it being blind speculation that will come to an end soon. Neither of those things are necessarily true in my view and these will be addressed in this post, together with a host of other things.</p>\n\n<p>Recently an interview came out by Smithweekly on YT where he spoke to perhaps the two brightest minds in the uranium investing space, Mike Alkin and Timothy Chilleri, in a two hour long gem of information on the uranium sector. After watching the video and talking about it with a lot of different investors, several of them found it to be relatively hard to follow and take in because of the duration of the video and technical terms in it. Because of this, I have written a summary of this interview that is found below, which is a lot less than 2 hours and hopefully it can help people pick out the most important aspects of it. I would most definitely advise you to watch the entire video even after reading this though, as it can be a great help in such an opaque market. Without further ado, here is the summary:</p>\n\n<p><strong>First and foremost, fears of the financial markets today:</strong></p>\n\n<p>It’s a very interesting time. The view on the market is the case for a potentially weaker dollar, which would square with where we are in terms of commodity prices. The prices are moving up, but the valuation between the two asset classes is stretched, with equities being extremely high. Play in the things you are comfortable with, the markets might feel ‘toppy’ right now due to all the tech fueled growth, it might continue but no one knows. Sometimes it is better to be in the parts of the market with less eyeballs on it and where things are less priced in. Timothy, who likes his coffee the same as Mike (and Andrew, important detail), focuses on cyclical industries/commodities currently. Things like gold miners who are now paying back debt and have a lot of free cash flow, again, with less eyeballs on it. If you go to plays where others won’t be, it is easier to have an informational edge and gain value, because the moment other retail investors and especially institutions come in, a lot of the potential upside won’t be there anymore.</p>\n\n<p><strong>The view of a long runway in the bulk of the commodities:</strong></p>\n\n<p>This is certainly the case. Uranium doesn’t have real price discovery on a regular basis. There is a terrible futures market that is out there, which is so small it is insignificant. You have a cohort of buyers, which is the electric utilities, and there are ~60 of them around the world. Lastly you have a few traders who trade some pounds back and forth, which don’t really influence the market. Right now, nuclear is catching an ESG feel to it, the fact that we are more focused on fighting climate change and we need nuclear power for that. Uranium mining gets swept up in that as well. Some people also look back and watch the commodities, especially with a weaker dollar. Once they have their eyes on the market, those people will likely see the opportunity so many of the people already investing into uranium have. Although this is all attractive, it doesn’t play a part in the base thesis of Mike and Tim. In their view, in terms of the best performance profile, there is nothing that comes close to uranium. Should we see a March like crash? It will be a like a gift. Having said that, the commodities market as a whole is very interesting. We need all the basic resources and after years of underinvestment, these cyclical commodities are coming back into favor. Markets will prove to be cyclical, as they have always been.</p>\n\n<p><strong>Let’s talk uranium:</strong></p>\n\n<p>First off, the supply side risk. Certainly one year ago, late January 2020, all focus was on the spreading of the COVID-19 virus. Because of that we saw several C&amp;M decisions to go down, both from Cameco as well as closures in other jurisdictions and the pause of wellfield development in Kazakhstan. Very few people expected it to ‘drag on and drag on’, but today with Cigar Lake on care and maintenance, the risks remain out there. This has been highlighted for a few years now. It might not be fires and floods that take a mine offline this time, but who knows what might happen tomorrow. There are also mines closing permanently, like Ranger and COMINAK this year after some 50 years of mining (taking approximately 7 million pounds off of the market). This is already factored into the market, but those are still real pounds coming off of the market that will need to be replaced and with Olympic Dam not expanding for now, it is not clear where those might come from.</p>\n\n<p>These pounds will need to be replaced. Why? Because demand is inelastic and there is no substitute. These utilities need uranium. In the last bull market these utilities had drawn down their inventories and if you look back to that period of time, you had much higher supplier and producer inventories, with lower utility inventories. These are, when all put together, lower today than they were back then. You can’t exclusively look at utility inventories and come to a conclusion purely based on that. The prevailing sentiment at that time, was that buyers didn’t believe there was a need to buy, they had been burned before and wouldn’t move based on merely the promise of the market improving. The ingredients for a massive bull run were in place: low inventories and underinvestment by suppliers. Exactly what we see today, but the difference is that we have a better demand story now and no new mine supply coming online.</p>\n\n<p>This supply deficit can be seen when one would try to buy pounds off of the spot market in any given month several years ago. You would probably be able to find 15 million pounds, but today if you want to find more than 1 million free flowing pounds, you would drive the price up. Traders know this as well, the fact they can’t secure a large amount of pounds. Talks for security of supply are happening right now. The stage is set for a tug of war. Producers are not blinking and it is all part of the cat and mouse game, but this can’t go on. If utilities don’t start contracting like yesterday, they are hosed. They are going to be paying prices significantly higher than they need to be paying. It doesn’t matter how long it takes, supply is low, demand has improved and no new mine supply is coming online. Since 2013, on average 35% of supply was contracted and they are sitting there with enormous uncovered needs over the next couple of years. Don’t pay attention to day-to-day fluctuations, do the math, the opportunity is there and the horse has left the barn because utilities overplayed their hand. Some are playing it smart, like the smaller more nimble utilities, but the bigger ones are taking their time and will need to wake up soon. When one or two do so, it will likely be a stampede.</p>\n\n<p>You know what is not going to make a difference? US producers tagging an extra million on maximum production capacity or Brazil opening a 4 million pounds a year uranium mine is not going to make a difference. We need more price discovery and if we don’t go to 50-60 dollars a pound, those mines won’t come and those pounds won’t be available.</p>\n\n<p><strong>View from inside the industry:</strong></p>\n\n<p>What does one see after 20,000 hours of research? Consensus is inconsistent. Most buy and sell side models are not up to date, causing inconsistencies in the views of the market. What also doesn’t help utilities get ‘ahead of the curve’, is that the fuel buyers in question don’t have any financial incentive to go ahead and lock in supply at certain prices. They don’t get anything extra for timing the bottom perfectly, nor do they participate in the financial upside. With no rewards for saving a fortune, you often see that most fuel buyers follow a herd like mentality. They won’t get penalized if they pay more than what they could have, as long as the peers are doing it. They won’t get fired for paying more to secure pounds, they might just get fired if they fail to secure any security of pounds for the utilities.</p>\n\n<p>One of the big mistakes people make in this sector. Is being so focused on ‘uranium’, U3O8, without really understanding conversion, enrichment and the broad fuel cycle. There are bottlenecks in this fuel cycle and we are finally coming to a point where we can move into the U3O8 market, because all this stuff further down the fuel cycle has been sucked out. Activity is going to pick up and this will result in a reaction in the prices of U3O8. Being well passed peak underfeeding, the next stage is coming over the next 6/12/18 months.</p>\n\n<p>What about mobile inventory? Something so many are worried about? At the moment, bottlenecks in the conversion market are still being solved. Questions like: Is there available UF6 stock? Can I convert my U3O8?, are common and these bottlenecks will need to be worked through. U3O8 is the last place they will go, but underneath the surface a lot of things are happening. Don’t keep staring at the price, the fundamentals are there, stop worrying about day to day noises in a broken, dysfunctional and inefficient physical uranium market and trying to make sense of it. If we really had all this excess supply, prices would be dropping like a rock.</p>\n\n<p><strong>China’s role in the thesis:</strong></p>\n\n<p>They do not have a lot of indigenous uranium production, which is why they search for it elsewhere and make investments to secure supply for all the reactors they need to construct in order to meet the carbon neutral goals by 2060. They think in terms of decades and all these inventories that they have will never see the light of day. They are strategic and necessary for them. They are playing the long game and want security for every single reactor and a 400 million pounds stockpile, over the long term, is not a lot for them in the grand scheme of things. They are buying up all sorts of commodities and this should not be underestimated, so don’t stand on the sidelines looking in while the commodities macro thesis is playing out in front of everyone.</p>\n\n<p><strong>Mistakes and unexpected events:</strong></p>\n\n<p>It is hard to realize how reliant the sector is on third party consultants. Having to spend so much time analyzing other people’s work, is an area that wasn’t really forecast. As facts change, consensus numbers change as well. But this doesn’t necessarily happen in this sector and it wasn’t until a deep dive into the sector, that a ‘wow’ moment came. The math is extremely compelling and it cannot be outrun. When will this happen? Could be tomorrow, but it also could be the end of this year. Point is that the math is in place and human nature doesn’t change in these cyclical industries, they will chase the price when it starts moving.</p>\n\n<p>When Converdyn went down back in 2017/2018 and they were out securing conversion, to do that they would go and buy UF6. Converdyn would have U3O8 laying around and the amount of U3O8 equivalent in that UF6 is returned to the seller. Some of the people that took this U3O8 back in, don’t need it, so they blow it into the market. In this period there was more supply and it was just a ‘ricochet event’ in the form of people getting U3O8 to lock in conversion and blowing it back into the market, which brought some supply. It was never forecasted, but we have worked through those inventories and now we are on the other side of this. Headwinds are turning into tailwinds.</p>\n\n<p>Don’t make the mistake holding on to your shares too long. It’s part math and part art. You will see a lot of things happen, including crazy multiples and FOMO. Keep your eyes on the goal and keep evaluating and re-evaluating your investment thesis and put the puzzle together when situations change that might alter the outlook. There will be a time to sell, as you will always see with cyclical industries.</p>\n\n<p><strong>Proper analysis and projections:</strong></p>\n\n<p>Let’s talk about the difference sort of companies in the sector, the exploration, development and production companies. Exploration is hard, the success rate is not great, but there are possibilities to be had there. There can be monster returns to be made here, but it is a lot more risky, so keep that in mind as it can be a tricky part of the market. This is however not what has priority, the priority is in finding the mismatch in the macro. This is where you can look at some of the producers who can get back into production and will have cash flow, which can attract new investors to these companies. Then there are some development companies with world class assets where the market will probably just pay a premium when the cycle turns, because the asset is just too good.</p>\n\n<p>For projects to come online, a lot of things have to go very well in the macro market. When this happens, the stocks of the underlying equities will probably have already re-rated and the current opportunities that are available today, are likely not going to be the same risk/reward proposition at that point. It pays to be early.</p>\n\n<p>--------------------------------------------------------</p>\n\n<p>That marks the end of the summary of this great interview. I wholeheartedly agree with Mike, Tim and Andrew on this one. The math is in place and the thesis looks to be playing out just like it was expected. It is still relatively early in this bull run so for those worried about missing the entire run up, we have not been anywhere near a top in this market in my view. Can we see a correction after such a massive run up? Of course, but in my opinion these corrections and dips are useful buying opportunities. Make sure to do your own research and build conviction. Have a great weekend as always people!</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/stocks/comments/m9djig/uranium_the_cycle_has_turned_and_the_next_phase/",
  "subreddit": "stocks",
  "id": "m9djig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821009
}