{
  "author": "JazzyJayKarr",
  "original_created_utc": 1624322536,
  "title": "Everyone needs to be careful!!!",
  "created_utc": 1624347704,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen so many posts about buying the dip, that this dip will be over tomorrow, about how this is a fire sale, etc. </p>\n\n<p>Just be careful buying crypto. Nobody knows if this is the bottom or not. Bear markets usually last longer than a month. And it seems like it goes down, goes up, goes down more, goes up, and goes down even more. </p>\n\n<p>I’ve been buying the dip and I bought a bunch of ethereum today at $1900, doubled my position. I’m very careful though in case it does dip lower. </p>\n\n<p>Think about how low prices will be if bitcoin hits 20k. Now think about if you’re willing to wait that out. Who knows if we could ever see bitcoin at 60k again. I think we will but who really knows. </p>\n\n<p>Just be careful and make sure you don’t invest more than you can handle. Try not to listen to everyone on Reddit. A lot of these posts are just people trying to get validation about their holdings. Most people on here know nothing.</p>\n</div><!-- SC_ON -->",
  "score": 985,
  "permalink": "/r/CryptoCurrency/comments/o5a2cy/everyone_needs_to_be_careful/",
  "subreddit": "CryptoCurrency",
  "id": "o5a2cy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have seen so many posts about buying the dip, that this dip will be over\ntomorrow, about how this is a fire sale, etc.\n\nJust be careful buying crypto. Nobody knows if this is the bottom or not. Bear\nmarkets usually last longer than a month. And it seems like it goes down, goes\nup, goes down more,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ディップを買えとか、このディップは明日には終わるとか、今はファイアーセールだとか、たくさんの書き込みを見ました。\nこのディップは明日には終わるだろう」「これは特売セールだ」などの書き込みをたくさん見ました。\n\nただ、暗号の購入には注意が必要です。これが底なのかどうかは誰にもわかりません。ベア\n市場は通常、1ヶ月以上続きます。そして、下がるようで、上がるようで\n上がったり、もっと下がったり...。",
      "title": "みんなも気をつけてね!!!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经看到了很多关于购买下跌的帖子，这种下跌明天就会结束。\n明天就会结束，说这是一场大甩卖，等等。\n\n只是要小心购买加密货币。没有人知道这是否是底部。熊市\n熊市通常持续一个月以上。而且，它似乎是下降，上升\n上升，下降更多，...",
      "title": "每个人都需要小心！！！。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經看到了很多關於購買下跌的帖子，這種下跌明天就會結束。\n明天就會結束，說這是一場大甩賣，等等。\n\n只是要小心購買加密貨幣。沒有人知道這是否是底部。熊市\n熊市通常持續一個月以上。而且，它似乎是下降，上升\n上升，下降更多，...",
      "title": "每個人都需要小心！！！。"
    }
  ]
}