{
  "author": "Set1Less",
  "original_created_utc": 1644733556,
  "title": "The 2000 Super Bowl had 21 DotCom Advertisements including Pets.com. Many of those companies died, and it marked the multi-decade top for the DotCom cycle.",
  "created_utc": 1644756660,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There are some posts going around that the SuperBowl ads will start the next bull run. So here is some history.&lt;/p&gt;\n\n&lt;p&gt;The 2000 SuperBowl was known as the DotCom SuperBowl - it marked the spectacular top and was followed by the crash of the entire dotcom market, sinking many of the companies that advertised there. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/List_of_Super_Bowl_commercials#2000_(XXXIV)\"&gt;https://en.wikipedia.org/wiki/List_of_Super_Bowl_commercials#2000_(XXXIV)&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Some of the infamous companies to advertise in 2000 SuperBowl include AutoTrader dot com, Britannica, Computer dot com, epidemic dot com, hotjobs dot com, MicroStrategy, OnMoney dot com, pets dot com etc. &lt;/p&gt;\n\n&lt;p&gt;Many of these companies died or ended up being acquired on the cheap by bigger entities. Even the ones that survived like MicroStrategy went through a 90% correction in asset price and had multiple decades before even beginning to recover in price. MSTR is still below its 2000 highs. &lt;/p&gt;\n\n&lt;p&gt;The Nasdaq took 14 years, from 2000 to 2014 to recover to the same levels as the 2000 tops. &lt;/p&gt;\n\n&lt;p&gt;SuperBowl advertisements dont mean jack shit. &lt;/p&gt;\n\n&lt;p&gt;“History Doesn&amp;#39;t Repeat Itself, but It Often Rhymes” – Mark Twain.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 362,
  "permalink": "/r/CryptoCurrency/comments/src30m/the_2000_super_bowl_had_21_dotcom_advertisements/",
  "subreddit": "CryptoCurrency",
  "id": "src30m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There are some posts going around that the SuperBowl ads will start the next\nbull run. So here is some history.\n\nThe 2000 SuperBowl was known as the DotCom SuperBowl - it marked the spectacular\ntop and was followed by the crash of the entire dotcom market, sinking many of\nthe companies that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スーパーボウルの広告で次の相場が始まるという書き込みが散見されます。\nブルラン そこで、少し歴史を振り返ってみましょう。\n\n2000年のスーパーボウルはドットコムスーパーボウルとして知られ、華々しい\nドットコム市場全体が大暴落し、多くの企業が倒産しました。\nその企業は",
      "title": "2000年のスーパーボウルでは、Pets.comを含む21のDotCom広告が登場した。これらの企業の多くは死亡し、ドットコム・サイクルは数十年の頂点に達しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一些帖子说，超级碗的广告将开始下一个\n牛市运行。因此，这里有一些历史。\n\n2000年的超级碗被称为DotCom SuperBowl - 它标志着壮观的\n它标志着壮观的顶部，随后是整个网络市场的崩溃，使许多\n的公司沉没。",
      "title": "2000年的超级碗有21个DotCom广告，包括Pets.com。这些公司中的许多都死了，这标志着DotCom周期达到了几十年的顶峰。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一些帖子說，超級碗的廣告將開始下一個\n牛市運行。因此，這裏有一些歷史。\n\n2000年的超級碗被稱爲DotCom SuperBowl - 它標誌着壯觀的\n它標誌着壯觀的頂部，隨後是整個網絡市場的崩潰，使許多\n的公司沉沒。",
      "title": "2000年的超級碗有21個DotCom廣告，包括Pets.com。這些公司中的許多都死了，這標誌着DotCom週期達到了幾十年的頂峯。"
    }
  ]
}