{
  "author": "LisHere321",
  "original_created_utc": 1635686610,
  "title": "November will bring us the biggest bullrun in the decade!",
  "created_utc": 1635695011,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all can be very happy to have invested in crypto before November 2021.</p>\n\n<p>Once November starts, the bullrun will be so overwhelming that it will be a mark in human history. This will start a golden decade for us all. People in the future who hasn&#39;t invested in crypto yet, will all be jealous and envy us who have bought crypto before November. We all will be very fortunate, rich and wealthy.</p>\n\n<p>I told you guys and gals last month already that October was just the start. Some doubt that because they were naive and were shocked by the post-El-Salvador crash, but the market recovered very fast. Anyone who bought when I told them about &quot;Uptober&quot; made a lot of profit.</p>\n\n<p>Tldr...in November: biggest bullrun humanity have ever seen</p>\n\n<hr/>\n\n<p>EDIT 1: Caution: This post could lead to hopium overdose. thanks goes to <a href=\"/u/xXxQUICKSILVERxXx\">u/xXxQUICKSILVERxXx</a> for this advice</p>\n\n<p>EDIT 2: thank you all for the awards!!! Let&#39;s us all be happy and have a lot of gains together! crypto community strong together! I wish all of your coins to shoot up in price, it will happen!</p>\n\n<p>EDIT 3: quoting <a href=\"/u/InfoTechLawyer\">u/InfoTechLawyer</a> : <em>Considering the historical price action of BTC during Novembers, there will be some large degree of speculation on a high value of Bitcoin at the end of the month.</em> <em>This will be glorious!</em></p>\n</div><!-- SC_ON -->",
  "score": 219,
  "permalink": "/r/CryptoCurrency/comments/qjpf39/november_will_bring_us_the_biggest_bullrun_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "qjpf39",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all can be very happy to have invested in crypto before November 2021.\n\nOnce November starts, the bullrun will be so overwhelming that it will be a mark\nin human history. This will start a golden decade for us all. People in the\nfuture who hasn't invested in crypto yet, will all be jealous and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年11月以前に暗号に投資していたことは、誰もがとても幸せになれる。\n\n11月が始まれば、ブルランは人類の歴史に残るほどの圧倒的なものになるでしょう。\n人類の歴史に残ることになるでしょう。私たち全員にとって黄金の10年が始まるでしょう。未来の人々は\nまだ暗号に投資していない未来の人たちは、みんな嫉妬して......。",
      "title": "11月には10年に一度の大規模なブルランが開催されます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都可以非常高兴地在2021年11月之前投资于加密货币。\n\n一旦11月开始，牛市将是压倒性的，它将成为人类历史上的一个里程碑。\n在人类历史上。这将为我们所有人开启一个黄金十年。人们在\n未来还没有投资加密货币的人，都会感到嫉妒和...",
      "title": "11月将为我们带来十年来最大的牛市!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都可以非常高興地在2021年11月之前投資於加密貨幣。\n\n一旦11月開始，牛市將是壓倒性的，它將成爲人類歷史上的一個里程碑。\n在人類歷史上。這將爲我們所有人開啓一個黃金十年。人們在\n未來還沒有投資加密貨幣的人，都會感到嫉妒和...",
      "title": "11月將爲我們帶來十年來最大的牛市!"
    }
  ]
}