{
  "author": "Mean-Traffic-2140",
  "original_created_utc": 1648133407,
  "title": "Why are people repulsed by armpit hair on women but not on men?",
  "created_utc": 1648146253,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many people seem to find it repulsive and disgusting when a woman has armpit hair. That&amp;#39;s the whole reason why women shave the hair off. Heck, I even know a few women that gag when they see a woman with armpit hair. But then on men, people like armpit hair on them. In fact, it would be repulsive if men shaved their armpits. I consider this very ironic because men, in general, sweat more than women. &lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s with the double standard?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/tmf0pu/why_are_people_repulsed_by_armpit_hair_on_women/",
  "subreddit": "NoStupidQuestions",
  "id": "tmf0pu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Many people seem to find it repulsive and disgusting when a woman has armpit\nhair. That's the whole reason why women shave the hair off. Heck, I even know a\nfew women that gag when they see a woman with armpit hair. But then on men,\npeople like armpit hair on them. In fact, it would be repulsive if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "女性がわきがになると、嫌悪感を抱く人が多いようです。\n毛がある。女性が毛を剃るのはそのためです。私の知人にも\n腋毛の生えた女性を見るとゲンナリする女性が何人もいる。しかし、その後、男性に。\nワキ毛が好きな人は多いですね。実際、嫌悪感を抱かれるのは...",
      "title": "なぜ、女性のわき毛には反発するのに、男性のわき毛には反発しないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多人似乎认为，当一个女人有腋窝时，是令人厌恶和恶心的。\n毛。这就是妇女要剃掉毛发的全部原因。见鬼，我甚至认识一些\n有几个女人看到有腋毛的女人就会咽口水。但是，在男人身上。\n人们喜欢他们身上的腋毛。事实上，这将是令人厌恶的，如果...",
      "title": "为什么人们对女性的腋毛感到厌恶，而对男性的腋毛却不厌恶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多人似乎認爲，當一個女人有腋窩時，是令人厭惡和噁心的。\n毛。這就是婦女要剃掉毛髮的全部原因。見鬼，我甚至認識一些\n有幾個女人看到有腋毛的女人就會咽口水。但是，在男人身上。\n人們喜歡他們身上的腋毛。事實上，這將是令人厭惡的，如果...",
      "title": "爲什麼人們對女性的腋毛感到厭惡，而對男性的腋毛卻不厭惡？"
    }
  ]
}