{
  "author": "Justwanttosellmynips",
  "original_created_utc": 1659532659,
  "title": "Is it a cultural thing or should I be concerned?",
  "created_utc": 1659546141,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my wife goes on morning walks everyday and takes our 2 sons with her (3YO and 9Months) and she had an odd encounter with a neighbor.  We live in a suburb with many different people of a surprising amount of backgrounds.  My wife likes to be a good neighbor and say hi to people as she walks and engage in some polite conversation here and there and today she met a woman and her young son in their front yard. The family is of Asian decent and has always been really friendly. As they talk my 3YO wanted to get out of the wagon so the woman goes up and picks him up then takes him by the hand to go in her house. Here&amp;#39;s how it goes.&lt;/p&gt;\n\n&lt;p&gt;Wife: &amp;quot;Excuse me, what are doing?&amp;quot;\nWoman:&amp;quot;Oh its ok he can play inside while we talk.&amp;quot;\nWife: &amp;quot;No, we have to go he can&amp;#39;t stay.&amp;quot;\nWoman: &amp;quot;it&amp;#39;s ok, let me get you a chair so you can rest.&amp;quot;\n&lt;em&gt;Wife gets son back and proceeds to rush back home.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Is it a cultural thing in Asan cultures or are we right to be concerned about the interaction?&lt;/p&gt;\n\n&lt;p&gt;Edit: All a misunderstanding! We asked our neighbor who is Vietnamese and he is actually friends with them and said that they haven&amp;#39;t been in the U.S. long and was just trying to be friendly.  It is a normal thing over there. Thanks for the comments guys!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/NoStupidQuestions/comments/wf6eff/is_it_a_cultural_thing_or_should_i_be_concerned/",
  "subreddit": "NoStupidQuestions",
  "id": "wf6eff",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So my wife goes on morning walks everyday and takes our 2 sons with her (3YO and\n9Months) and she had an odd encounter with a neighbor. We live in a suburb with\nmany different people of a surprising amount of backgrounds. My wife likes to be\na good neighbor and say hi to people as she walks and…"
}