{
  "author": "memes_420",
  "the_new_excerpt": "We have all been setting Tesla skyrocket. I'm not here to argue that Tesla is\ncorrectly valued, it's not, but the company is going to remain one of the\nbiggest automakers by market cap even after the bubble bursts. You could almost\ncall it a new normal.\n\nGM has seen a huge uptick in growth thanks to…",
  "original_created_utc": 1611204549,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们都在给特斯拉定天价。我在这里并不是要论证特斯拉是\n正确的估值，它不是，但该公司将仍然是一个。\n即使在泡沫破灭后，按市值计算的最大汽车制造商。你几乎可以\n称之为新常态。\n\n通用汽车的增长出现了巨大的起色，这得益于...",
      "title": "你认为特斯拉和通用/克鲁斯正在引领福特和其他汽车行业的价值重估吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都在給特斯拉定天價。我在這裏並不是要論證特斯拉是\n正確的估值，它不是，但該公司將仍然是一個。\n即使在泡沫破滅後，按市值計算的最大汽車製造商。你幾乎可以\n稱之爲新常態。\n\n通用汽車的增長出現了巨大的起色，這得益於...",
      "title": "你認爲特斯拉和通用/克魯斯正在引領福特和其他汽車行業的價值重估嗎？"
    }
  ],
  "title": "Do you think that Tesla and GM/Cruise are leading the revaluation of Ford and the rest of the auto industry?",
  "created_utc": 1611241177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We have all been setting Tesla skyrocket. I&#39;m not here to argue that Tesla is correctly valued, it&#39;s not, but the company is going to remain one of the biggest automakers by market cap even after the bubble bursts. You could almost call it a new normal.</p>\n\n<p>GM has seen a huge uptick in growth thanks to their investment in Cruise. Cruise brings a lot of things to the GM company portfolio but the biggest one is a chance for them to actually survive and compete in a 21st century car market. I think it makes sense for the recent growth in gm because it this.</p>\n\n<p>Similarly, Ford is beginning to get revalued too. I think a lot of that is due to their stake in rivian. Rivian has been growing at a fast pace and already has contracts with companies like amazon.</p>\n\n<p>What other auto or manufacturing companies do you think are going to get revalued by the market soon?</p>\n</div><!-- SC_ON -->",
  "score": 100,
  "permalink": "/r/investing/comments/l1raze/do_you_think_that_tesla_and_gmcruise_are_leading/",
  "subreddit": "investing",
  "id": "l1raze",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217236
}