{
  "author": "Kingkong_smoldong",
  "original_created_utc": 1632887734,
  "title": "The #1 reason we won’t be entering a bear market",
  "created_utc": 1632904948,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay so I see speculation that we’re entering a bear market, but I also see “analysts” saying we’re still in the Bull. \n- Here’s my analysis, it’s probably the best one yet. Here’s why we’re not entering a bear market. \n- Winter is coming, yes. Winter will be here shortly, therefore it’s bullish. Why is it bullish? Bears hibernate during winter. \n- Therefore they cannot short anything during hibernation, therefore only bulls can long and pump everything. \n- Therefore, winter is going to be the most bullish time for us. Sometimes you need to take a step back from “golden crosses” and “death crosses” and just do some studies on nature bruh.</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/pxnbxu/the_1_reason_we_wont_be_entering_a_bear_market/",
  "subreddit": "CryptoCurrency",
  "id": "pxnbxu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay so I see speculation that we’re entering a bear market, but I also see\n“analysts” saying we’re still in the Bull. - Here’s my analysis, it’s probably\nthe best one yet. Here’s why we’re not entering a bear market. - Winter is\ncoming, yes. Winter will be here shortly, therefore it’s bullish. Why…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、弱気相場に入ったという憶測が流れていますが、同時に\n「アナリスト」はまだ強気だと言っています。- これが私の分析で、おそらくこれまでで最高のものです。\nこれまでで最高のものだと思います。弱気市場に突入していない理由は以下の通りです。- 冬が来る\n冬が来る、そうです。冬はまもなくやってくる、だから強気だ。なぜ...",
      "title": "弱気市場に入らない1つの理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我看到有人猜测我们正在进入一个熊市，但我也看到了\n\"分析师 \"说我们仍在牛市中。- 这是我的分析，它可能是\n迄今为止最好的一次。以下是我们没有进入熊市的原因。- 冬天是\n来了，是的。冬天很快就会到来，因此它是看涨的。为什么...",
      "title": "我们不会进入熊市的第一大原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我看到有人猜測我們正在進入一個熊市，但我也看到了\n\"分析師 \"說我們仍在牛市中。- 這是我的分析，它可能是\n迄今爲止最好的一次。以下是我們沒有進入熊市的原因。- 冬天是\n來了，是的。冬天很快就會到來，因此它是看漲的。爲什麼...",
      "title": "我們不會進入熊市的第一大原因"
    }
  ]
}