{
  "author": "Familiar_Leather",
  "original_created_utc": 1643145735,
  "title": "Why do people answer questions with “I don’t know” on online forums and comment sections?",
  "created_utc": 1643151440,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see it all the time. Maybe someone posts a video on Instagram that has music in it and someone will comment “what is this song?” Then someone else, who is not OP, replies “I don’t know.” &lt;/p&gt;\n\n&lt;p&gt;Or maybe someone will be asking a question about a product. Like does it have XYZ feature. Someone who isn’t the seller will respond saying “I don’t know”&lt;/p&gt;\n\n&lt;p&gt;Why do people do this? It’s pointless. It serves nothing. It gets on my nerves to be honest. I don’t understand. It would be way more different if it was in person, because then the question is directed at a specific person, but the fact that random people that don’t hold the answer to the question will do this confuses me. &lt;/p&gt;\n\n&lt;p&gt;And before you do it, because I know some of you are thinking about....&lt;/p&gt;\n\n&lt;p&gt;Har har so funny of you to comment I don’t know.&lt;/p&gt;\n\n&lt;p&gt;Edit: the comment section is filled with unfunny and unoriginal people&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/NoStupidQuestions/comments/scoapp/why_do_people_answer_questions_with_i_dont_know/",
  "subreddit": "NoStupidQuestions",
  "id": "scoapp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see it all the time. Maybe someone posts a video on Instagram that has music\nin it and someone will comment “what is this song?” Then someone else, who is\nnot OP, replies “I don’t know.”\n\nOr maybe someone will be asking a question about a product. Like does it have\nXYZ feature. Someone who isn’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いつも見ていますよ。誰かがInstagramに音楽を使った動画を投稿しているかもしれません。\nこの曲は何だろう？すると、他の誰かが、その人は\nOPでなく、\"I don't know \"と答える。\n\nあるいは、誰かが製品について質問しているのかもしれません。例えば\nXYZの機能。そうでない人が...",
      "title": "ネットの掲示板やコメント欄で、質問に「わからない」と答える人がいるのはなぜか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常看到这种情况。也许有人在Instagram上发布一个有音乐的视频\n有人会评论说 \"这是什么歌？\" 然后另一个人，也就是\n不是OP，回答说 \"我不知道\"。\n\n或者也许有人会问一个关于产品的问题。比如它是否有\nXYZ功能。有些人并不是...",
      "title": "为什么人们在网上论坛和评论区用 \"我不知道 \"来回答问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常看到這種情況。也許有人在Instagram上發佈一個有音樂的視頻\n有人會評論說 \"這是什麼歌？\" 然後另一個人，也就是\n不是OP，回答說 \"我不知道\"。\n\n或者也許有人會問一個關於產品的問題。比如它是否有\nXYZ功能。有些人並不是...",
      "title": "爲什麼人們在網上論壇和評論區用 \"我不知道 \"來回答問題？"
    }
  ]
}