{
  "author": "TrueSpins",
  "original_created_utc": 1637916983,
  "title": "Stock market and Crypto is tanking due to COVID variant concerns. Unless this is actually the end of the world, we'll see an eventual bounce back. And if it is the end of the world, you've got nothing to lose.",
  "created_utc": 1637930348,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is potentially a repeat of what we saw in 2020, when markets crashed and then recovered as we got vaccine programmes in place. </p>\n\n<p>Unless this is literally the end of the world, life will go on in one way or another, and markets will adapt and continue to do their thing. I suspect crypto markets will do exactly the same. And if we are watching the end times, well what have you got to lose?</p>\n\n<p>This could present a great buying opportunity if the same pattern occurs again.</p>\n\n<p>The challenge is of course trying to get in at the best price. But if you work on the basis it&#39;s a flash crash, timing is probably not hugely important.</p>\n</div><!-- SC_ON -->",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/r2izhc/stock_market_and_crypto_is_tanking_due_to_covid/",
  "subreddit": "CryptoCurrency",
  "id": "r2izhc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is potentially a repeat of what we saw in 2020, when markets crashed and\nthen recovered as we got vaccine programmes in place.\n\nUnless this is literally the end of the world, life will go on in one way or\nanother, and markets will adapt and continue to do their thing. I suspect crypto\nmarkets…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、2020年に見られたように、市場が暴落し、その後、ワクチンプログラムを導入することで回復したことの繰り返しになる可能性があります。\n2020年に市場が暴落し、その後、ワクチンプログラムの導入により回復した時のようなことが起こる可能性があります。\n\nこれが文字通り世界の終わりでない限り、何らかの形で生活は続き、市場は適応し、それぞれの活動を続けるでしょう。\n市場は適応し、それぞれの活動を続けるでしょう。私は、暗号\n市場は",
      "title": "COVIDバリアント懸念で株式市場とCryptoが暴落している。これが実際に世界の終わりでない限り、最終的には立ち直りが見られるでしょう。そして、もしそれが世界の終わりであれば、失うものは何もありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这有可能是我们在2020年看到的情况的重演，当时市场崩溃，然后随着我们的疫苗计划到位而恢复。\n然后随着我们的疫苗计划的实施而恢复。\n\n除非这真的是世界末日，否则生活将以这样或那样的方式继续下去。\n市场将适应并继续做他们的事情。我怀疑加密货币\n市场...",
      "title": "由于对COVID变体的担忧，股市和加密货币正在下跌。除非这实际上是世界末日，否则我们将看到最终的反弹。如果它是世界末日，你也没有什么损失。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這有可能是我們在2020年看到的情況的重演，當時市場崩潰，然後隨着我們的疫苗計劃到位而恢復。\n然後隨着我們的疫苗計劃的實施而恢復。\n\n除非這真的是世界末日，否則生活將以這樣或那樣的方式繼續下去。\n市場將適應並繼續做他們的事情。我懷疑加密貨幣\n市場...",
      "title": "由於對COVID變體的擔憂，股市和加密貨幣正在下跌。除非這實際上是世界末日，否則我們將看到最終的反彈。如果它是世界末日，你也沒有什麼損失。"
    }
  ]
}