{
  "author": "jcbk1373",
  "the_new_excerpt": "title edit: 1 in 3.5 million? Billion? Quadrillion? Whatever.\n\nVlad has often cited this 3rd party analyst claim, calling it a black swan\nevent. Here's why that's a total crock.\n\nThis is not the first ever short squeeze. Nor was it the largest by any measure.\nThe volatility of equities being…",
  "original_created_utc": 1613747562,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "标题编辑：350万分之一？十亿分之一？四万亿分之一？管他呢。\n\nVlad经常引用这个第三方分析师的说法，称其为黑天鹅。\n事件。这就是为什么这是一个完全的废话。\n\n这不是有史以来第一次短线挤压。也不是最大的一次\n股票的波动性被...",
      "title": "为什么Robinhood的30亿美元保证金追缴不是 \"3.5万亿分之一 \"的事件，应该在意料之中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題編輯：350萬分之一？十億分之一？四萬億分之一？管他呢。\n\nVlad經常引用這個第三方分析師的說法，稱其爲黑天鵝。\n事件。這就是爲什麼這是一個完全的廢話。\n\n這不是有史以來第一次短線擠壓。也不是最大的一次\n股票的波動性被...",
      "title": "爲什麼Robinhood的30億美元保證金追繳不是 \"3.5萬億分之一 \"的事件，應該在意料之中。"
    }
  ],
  "title": "Why Robinhood's $3bil margin call was NOT a \"1 in 3.5 trillion\" event, and should have been expected",
  "created_utc": 1613766340,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>title edit: 1 in 3.5 million? Billion? Quadrillion? Whatever.</p>\n\n<p>Vlad has often cited this 3rd party analyst claim, calling it a black swan event. Here&#39;s why that&#39;s a total crock.</p>\n\n<p>This is not the first ever short squeeze. Nor was it the largest by any measure. The volatility of equities being squeezed is common knowledge and expected. GME <strong>doubled</strong> in price the 2 weeks leading up to the squeeze, on astronomical short interest. We all knew it was squeezing, why didn&#39;t Robinhood?</p>\n\n<p><em>&quot;Yeah, but RH had so much more exposure than expected because so many retail buyers were buying it on their platform.&quot;</em> Well, duh. Why do you think stocks squeeze? Because of retail hype. And not only did Robinhood have the data to know and expect their user base to be in big on the squeeze, <strong>it&#39;s their freaking business model.</strong> They actively highlight popular stocks to attract new users and entice trading activity.</p>\n\n<p>So WTF was Robinhood expecting? They just fell asleep and are entirely culpable.</p>\n</div><!-- SC_ON -->",
  "score": 8934,
  "permalink": "/r/wallstreetbets/comments/lni5mm/why_robinhoods_3bil_margin_call_was_not_a_1_in_35/",
  "subreddit": "wallstreetbets",
  "id": "lni5mm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332892219
}