{
  "author": "kissmekatebush",
  "original_created_utc": 1637278945,
  "title": "Does anyone feel like they can't get back to being their 'pre-pandemic' self?",
  "created_utc": 1637287694,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I spent all of the lockdowns thinking that now I knew what it was like to be trapped, I would never let anything hold me back again.  When lockdown ended I was going to go backpacking round the world or some shit, I can&#39;t even remember.  But I was raring to go, waiting for my freedom, for nearly two years now.</p>\n\n<p>Somehow I just don&#39;t feel like I can do anything anymore.  I don&#39;t feel like I can just get up and go to a bar like I used to, it feels difficult psychologically even to just go out for a walk like I used to.  I can&#39;t do my travel plans because it looks like there&#39;s a fourth wave coming.  It&#39;s like I left my brain in the garage too long and now I can&#39;t start it up again.  I also think it&#39;s harder at meet up groups and stuff, because other people have also changed in the pandemic and socialising and making real friendships just seems beyond people&#39;s capability now, like everyone just wants to complain and then go home early.</p>\n\n<p>Does anyone else feel like this?  Are there any big or small ways to get going again?  (Please don&#39;t say volunteering, I&#39;m a full time carer and I&#39;m burned tf out.)</p>\n</div><!-- SC_ON -->",
  "score": 147,
  "permalink": "/r/NoStupidQuestions/comments/qx2vp0/does_anyone_feel_like_they_cant_get_back_to_being/",
  "subreddit": "NoStupidQuestions",
  "id": "qx2vp0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I spent all of the lockdowns thinking that now I knew what it was like to be\ntrapped, I would never let anything hold me back again. When lockdown ended I\nwas going to go backpacking round the world or some shit, I can't even remember.\nBut I was raring to go, waiting for my freedom, for nearly two…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はロックダウンの間、閉じ込められることがどんなことなのかを知ったので\nもう何があっても挫折しないぞ、と思っていました。ロックダウンが終わったとき、私は\nバックパッカーとして世界一周に行くつもりだったのですが、覚えていません。\nしかし、私は行く気満々で、2年近くも自由を待っていたのです。",
      "title": "パンデミック前」の自分には戻れないと感じている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我花了所有的时间去想，现在我知道了被锁住的感觉\n我不会再让任何东西束缚我了。禁闭结束后，我\n我打算背着背包环游世界，或者其他什么东西，我甚至都不记得了。\n但我急着要走，等待我的自由，近两年来...。",
      "title": "是否有人觉得他们无法恢复到 \"大流行前 \"的自己？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我花了所有的時間去想，現在我知道了被鎖住的感覺\n我不會再讓任何東西束縛我了。禁閉結束後，我\n我打算揹着揹包環遊世界，或者其他什麼東西，我甚至都不記得了。\n但我急着要走，等待我的自由，近兩年來...。",
      "title": "是否有人覺得他們無法恢復到 \"大流行前 \"的自己？"
    }
  ]
}