{
  "author": "SweetPie123",
  "the_new_excerpt": "“Buy the dip” or “This is just a correction” is something I keep seeing over and\nover again on the frontpage. In 2018 there were hundreds of posts like this all\nthe way down to 3.2K Bitcoin. By the time people realise we’re in a bearmarket\nit’s already too late, some will hold till the next bullrun,…",
  "original_created_utc": 1621413858,
  "title": "Just like in 2018 herd mentality is stronger than ever.",
  "created_utc": 1621431357,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“Buy the dip” or “This is just a correction” is something I keep seeing over and over again on the frontpage. In 2018 there were hundreds of posts like this all the way down to 3.2K Bitcoin. By the time people realise we’re in a bearmarket it’s already too late, some will hold till the next bullrun, most will panic sell on the way down.</p>\n\n<p>These posts with unsolicited trading advice give a false sense of safety and security. The OP’s obviously have an interest in you holding your coins, but in the end it doesn’t even matter with the billions flowing through crypto daily. </p>\n\n<p>Stay safe, stay sane. In the end it’s just money, life has more to offer.</p>\n</div><!-- SC_ON -->",
  "score": 3079,
  "permalink": "/r/CryptoCurrency/comments/ng0e2b/just_like_in_2018_herd_mentality_is_stronger_than/",
  "subreddit": "CryptoCurrency",
  "id": "ng0e2b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801364,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"Buy the dip\" とか \"This is just a correction\" とかは、何度も目にする言葉です。\nフロントページで何度も何度も 2018年はこのような投稿が数百件もあり、すべて\nビットコイン3.2Kまで下がった。人々が私たちがくまモン市場にいることに気づくころには\nもう手遅れで、次のブルランまで持つ人もいるだろうし...。",
      "title": "2018年同様、群集心理が強くなっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"买入下跌 \"或 \"这只是一次修正 \"是我一直在头版上看到的东西。\n我一直在头版上看到这些话。在2018年，有数百个这样的帖子，所有\n一路下跌到3.2K比特币。当人们意识到我们正处于一个蜂箱市场时\n已经太晚了，有些人将持有到下一次牛市，...",
      "title": "就像在2018年，羊群心态比以往任何时候都强。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"買入下跌 \"或 \"這只是一次修正 \"是我一直在頭版上看到的東西。\n我一直在頭版上看到這些話。在2018年，有數百個這樣的帖子，所有\n一路下跌到3.2K比特幣。當人們意識到我們正處於一個蜂箱市場時\n已經太晚了，有些人將持有到下一次牛市，...",
      "title": "就像在2018年，羊羣心態比以往任何時候都強。"
    }
  ]
}