{
  "author": "hype_cycle",
  "original_created_utc": 1632117892,
  "title": "I built a service that summarizes the most popular content from your favorite subreddits. It's like Blinkist but for online communities.",
  "created_utc": 1632123558,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reddit is such a goldmine for authentic content and advice. But I&#39;m either missing some cool posts or I don&#39;t have the time to read through it. </p>\n\n<p>Wouldn&#39;t it be great to have a service that summarizes the best Reddit content for me? That&#39;s why I&#39;m building <a href=\"https://recapper.io/\">https://recapper.io</a>.</p>\n\n<p>It uses GPT-3 to write a short bullet-point summary of the most popular posts in a subreddit. You&#39;ll then get a regular newsletter with the most relevant recaps for you. </p>\n\n<p>Let me know what you think!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/proup9/i_built_a_service_that_summarizes_the_most/",
  "subreddit": "SideProject",
  "id": "proup9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Reddit is such a goldmine for authentic content and advice. But I'm either\nmissing some cool posts or I don't have the time to read through it.\n\nWouldn't it be great to have a service that summarizes the best Reddit content\nfor me? That's why I'm building https://recapper.io…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditは、本物のコンテンツやアドバイスの宝庫です。しかし、私はいくつかの\n見逃しているか、目を通す時間がないのが現状です。\n\n最高のRedditコンテンツをまとめてくれるサービスがあったらいいと思いませんか？\nまとめてくれるサービスがあったらいいと思いませんか？それが、私がhttps://recapper.io...を作った理由です。",
      "title": "私は、お気に入りのサブレディットから最も人気のあるコンテンツを要約するサービスを作りました。これはBlinkistのようなものですが、オンラインコミュニティのためのものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Reddit是这样一个提供真实内容和建议的金矿。但我要么是\n错过了一些很酷的帖子，或者我没有时间去阅读它。\n\n如果有一项服务能为我总结出最好的Reddit内容，那不是很好吗？\n为我总结最好的Reddit内容，不是很好吗？这就是为什么我在建立https://recapper.io...",
      "title": "我建立了一个服务，总结了你最喜欢的子版块的最热门内容。它就像Blinkist，但针对在线社区。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Reddit是這樣一個提供真實內容和建議的金礦。但我要麼是\n錯過了一些很酷的帖子，或者我沒有時間去閱讀它。\n\n如果有一項服務能爲我總結出最好的Reddit內容，那不是很好嗎？\n爲我總結最好的Reddit內容，不是很好嗎？這就是爲什麼我在建立https://recapper.io...",
      "title": "我建立了一個服務，總結了你最喜歡的子版塊的最熱門內容。它就像Blinkist，但針對在線社區。"
    }
  ]
}