{
  "author": "liveaskings",
  "original_created_utc": 1646063212,
  "title": "Imagine being so privileged during a time of war that you complain about how donations are being given...",
  "created_utc": 1646101836,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title says, it must be nice being so far removed from immediate danger that you have the time to complain on the internet about how donations are being given to help the Ukrainian government and it&amp;#39;s people. &lt;/p&gt;\n\n&lt;p&gt;Yes I am talking about the sudden burst of anger from many of you about how Gavin Wood, head of Polkadot, and Sunny Lu, head of VeChain, have asked for Ukraine to post an address for them to donate. &lt;/p&gt;\n\n&lt;p&gt;To be clear... Donate their OWN FUCKING MONEY. Ukraine has asked for donations in any way that they can. Food, ammunition, guns, resources, food and water, fighters, and any assistance possible to fight a much larger force. The only reason they initially posted the addresses to BTC and ETH is because those are the two biggest currencies. They will take whatever funds they can possibly get and that is EXACTLY what these two are doing. &lt;/p&gt;\n\n&lt;p&gt;If I hear one more person say, oh well they could have converted it to BTC or ETH first and then sent it... Why should they have to? They have a large portion of their own individual wealth in the coin they created, they should be able to send that to help out and not get ridiculed by internet trolls thousands of miles away. &lt;/p&gt;\n\n&lt;p&gt;Not like they would give a shit anyway if you disagree about how they have donated because lets me real, they are trying to make a difference.... What have you done?&lt;/p&gt;\n\n&lt;p&gt;Two more things, these are both respected projects! It&amp;#39;s not like someone is asking them to set up a wallet for elonspermshitfuckidontcare coin. These are coins that have a lot of backing and are known. &lt;/p&gt;\n\n&lt;p&gt;Leads me into the follow up, now you know what address to send those coins to if you want to donate! Honestly, I hope Ukraine eventually posts address to lots of coins so that countless people can band together and donate what they have in order to help. &lt;/p&gt;\n\n&lt;p&gt;We are better than this people, show the world that crypto is united and what we can really do to help. Last time I checked, Ukraine is getting close to 40 million in crypto donations, I hope to see that number reach 100 million and beyond very soon.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/t3ijwg/imagine_being_so_privileged_during_a_time_of_war/",
  "subreddit": "CryptoCurrency",
  "id": "t3ijwg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As the title says, it must be nice being so far removed from immediate danger\nthat you have the time to complain on the internet about how donations are being\ngiven to help the Ukrainian government and it's people.\n\nYes I am talking about the sudden burst of anger from many of you about how\nGavin…"
}