{
  "author": "coopeygfvv",
  "original_created_utc": 1635217716,
  "title": "How do you take profits in crypto?",
  "created_utc": 1635237563,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Me along with many others in this sub are new to crypto within the last few months. Everything moves much faster than stocks and I’ve seen many posts in the daily about how to take profits. </p>\n\n<p>I know many people say to DCA in and when you’ve reached your goal DCA. So far I’m up over 100-250% on multiple coins in the last 2 months and taking profits is the hardest part, due to the fact that I’m worrying about missing out on more gains. </p>\n\n<p>So what are some recommendations for me and others about taking profits. What types of goals do you set for when you want to cash out, do you wait till your up X% amount and then take out your initial investment or do you take out 20% for example and then as it continues to rise X amount more you take out another 20% or so?</p>\n\n<p>Please share some helpful tips.</p>\n</div><!-- SC_ON -->",
  "score": 190,
  "permalink": "/r/CryptoCurrency/comments/qfx9r7/how_do_you_take_profits_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qfx9r7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Me along with many others in this sub are new to crypto within the last few\nmonths. Everything moves much faster than stocks and I’ve seen many posts in the\ndaily about how to take profits.\n\nI know many people say to DCA in and when you’ve reached your goal DCA. So far\nI’m up over 100-250% on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私をはじめ、このサブにいる多くの人は、ここ数ヶ月の間にcryptoに出会ったばかりです。\nしています。すべてが株よりはるかに速く動き、利益を得る方法についての多くの投稿を日刊紙で見ました。\nどうやって利益を取るかという投稿を毎日見ています。\n\n多くの人がDCAを導入し、目標に到達したらDCAを導入しろと言っているのは知っています。今のところ\n私は100～250％以上の上昇をしています...",
      "title": "クリプトではどのように利益を取るのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和这个子里的许多人都是过去几个月里刚接触加密货币的人。\n个月。一切都比股票快得多，我在日报上看到很多关于如何获利的帖子。\n每天都有很多关于如何获利的帖子。\n\n我知道很多人说，要在DCA中，当你达到你的目标时，DCA。到目前为止\n我已经上涨了超过100-250%，在...",
      "title": "你如何在加密货币中获利？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和這個子裏的許多人都是過去幾個月裏剛接觸加密貨幣的人。\n個月。一切都比股票快得多，我在日報上看到很多關於如何獲利的帖子。\n每天都有很多關於如何獲利的帖子。\n\n我知道很多人說，要在DCA中，當你達到你的目標時，DCA。到目前爲止\n我已經上漲了超過100-250%，在...",
      "title": "你如何在加密貨幣中獲利？"
    }
  ]
}