{
  "author": "AdministrationNew369",
  "original_created_utc": 1636855311,
  "title": "Market Movers are seeking the next Low-cap Gem, Here's why I think its Loopring and were all early.",
  "created_utc": 1636882607,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR / Summary :</p>\n\n<p>A quick dive into a series of similarities evidently shown between Loopring and the Infamous Shiba Inu coin and a strong belief that Market movers are seeking the next JAWDROPPER that will perform similar to Shiba Inu (parabolically) if a number of factors and similiarities more then exist. If it hasn&#39;t been made blatantly obvious enough for you were undergoing an irrational market that moves based off feelings and much historical data, applying this knowledge can allow us to invest before everyone else.</p>\n\n<p>Loopring is gaining a lot of attraction from investors lately!!! </p>\n\n<p>if theirs anything we&#39;ve learned this year from experience is that the market is extremely irrational and Market movers are speculating on the next big pump, basically everyone who missed out on Doge and Shiba are letting the market slowly determine what the next JAWDROPPER will be, and I Strongly believe that it needs many similiarities of Shiba Inu to perform parabolically.</p>\n\n<p>Lets take a moment to see how Similar these coins really are based off Popularity patterns, Volume, DDos Fudders, and community growth speed.</p>\n\n<p>We have to ask ourselves a series of questions and our ideal outcome is to have both the same answers for Shiba Inu as we do for Loopring for the market to potentially deem it as the next big thing</p>\n\n<p>Is this Investment heavily associated with a meme?</p>\n\n<p>Shiba : Much yes. (correlation being Doge Meme)</p>\n\n<p>Loopring : Cant stop, wont stop, Gamestop! (heavily tied to GameStop amidst partnership speculation/rumours)</p>\n\n<p>Checkmark, Next question.</p>\n\n<p>Is there a strong market demand for Memes?</p>\n\n<p>We&#39;ve witnessed Well over 200Billion dollars contributed to Meme stocks and meme coins Marketcaps throughout the year and its more then reasonable to assume that the demand for Meme culture investments is here to stay. This is a strong yes from both Shiba and Loopring</p>\n\n<p>Checkmark, Next question</p>\n\n<p>Has the Volume exceeded the market cap greater then a 2 fold demonstrating a clear market interest?</p>\n\n<p>Shiba inu : had a market cap of 9 billion dollars and we saw the volume hit 18Billlion (Volume peaked at 41billion) A clear yes</p>\n\n<p>Loopring : had a market cap of 3.8 Billion dollars with a whopping 9.8Billion dollars in volume, Another clear yes</p>\n\n<p>is there a major problem that everyone complains about that this product can potentially solve?</p>\n\n<p>Shiba inu : I lost a shit ton of money in doge coin so I need to ape into something else with a cute themed puppy to make up for my losses. (the market wanted to give people a second chance with Shib (IMO) )</p>\n\n<p>Loopring : no more gas fees until lambo.</p>\n\n<p>Is this strongly related to another crypto/security previous parabolic performance?</p>\n\n<p>Shiba Inu : Yes dogecoin paved the way and basically spoon-fed Shiba inu holders with a perfect time to interrupt the market with a new dog themed token, the mid stages of Shiba chart behaviour were arguably indenticle to dogecoin by the minute, doge goes up so did shiva, vice versa. Another strong yes.</p>\n\n<p>Loopring : a shit ton of apes throwing in their 10-30x returns they made off GameStop because of a few tweets on twitter, now when/if GameStop announces something related to looping were likely going to skyrocket the same way GME did back in febuary 2021. Another yes.</p>\n\n<p>is there a very influential person shilling or giving exposure to this crypto?</p>\n\n<p>Shiba : it doesn&#39;t matter what Elon Musk tweets, we gain exposure and green dildos!</p>\n\n<p>Loopring : Not really, but if and when a partnership is announced with GameStop we should all be well aware that Ryan Cohen will indeed play a huge role in the potential exposure Loopring will receive.</p>\n\n<p>Are whales Accumulating this coin?</p>\n\n<p>Shiba inu : I can&#39;t find the article atm (found a vague one linked below) but I read that out of the top 100 Eth whale wallets a whopping 25% of them hold a position in Shiba inu.</p>\n\n<p><a href=\"https://thecryptobasic.com/2021/10/04/crypto-whales-purchasing-large-amounts-of-shiba-inu-as-single-anonymous-whale-bought-6-trillion-shib-coins-and-then-adds-276-billion-more-after-two-days/\">Post 3</a></p>\n\n<p>Loopring : no, not evidently as a group at that moment but their have been mentions of the top 9th Largest etheruem whale (billion plus in ether) is starting to accumulate Loopring.</p>\n\n<p>Is it un-hackable?</p>\n\n<p>Shiba inu and Loopring are extremly secure as there Erc20 Tokens and reap the benefits of Etheruem security and efficiency, A Strong yes.</p>\n\n<p>Are they both in a growing industry?</p>\n\n<p>Shiba/Lrc : I wont be as vague to state the obvious that crypto adoptions is increasing exponentially but I will specify the recent parabolic interest the market is showing towards projects build on top of the open source Etheruem network, both coin are Erc20 tokens and the popularity in these coins more then exist. A strong yes for both.</p>\n\n<p>Yes I admit some of my questions were structured to fit my narrative, being to assume that Loopring and Shiba Inu have more then enough similarities to have similar growth performance, denying that these similarities exist will lead many to missing out on gains, the market is heavily based on feelings and based off things mentioned above this probability of a continued breakout is more then likely.</p>\n\n<p>many have heard of looping and will argue that if you read about it on reddit then you&#39;re far too late but they said the same about so many, Shiba, Solano, Doge, Binance and many others always DYOR so you feel content with your portfolio, listening a combination of rudders and chillers will just leave you delayed and confused. Be early and be informed.</p>\n\n<p>For anyone curious my average cost is 2.80USD I&#39;m fairly new to looping and have less knowledge then many OG holders here. this is mainly speculation and much different for many of the DD Posts on this sub.</p>\n\n<p>Best of luck to all.</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/urzy5gTKkzTKjvZrQdSZaSO1b96_Z3qYf4KZDQsKI4I.jpg?auto=webp&s=71dde3d2113b51976ba5a3503d876dd23c1503ed",
          "width": 671,
          "height": 499
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/urzy5gTKkzTKjvZrQdSZaSO1b96_Z3qYf4KZDQsKI4I.jpg?width=108&crop=smart&auto=webp&s=3c1a5bb87193f6bf5179342bd80b08ce61c4ecbe",
            "width": 108,
            "height": 80
          },
          {
            "url": "https://external-preview.redd.it/urzy5gTKkzTKjvZrQdSZaSO1b96_Z3qYf4KZDQsKI4I.jpg?width=216&crop=smart&auto=webp&s=22b72dc21c3fcdccf8de6630f66e8335fb822a33",
            "width": 216,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/urzy5gTKkzTKjvZrQdSZaSO1b96_Z3qYf4KZDQsKI4I.jpg?width=320&crop=smart&auto=webp&s=c93dad55474658801c447e4893456df545db2565",
            "width": 320,
            "height": 237
          },
          {
            "url": "https://external-preview.redd.it/urzy5gTKkzTKjvZrQdSZaSO1b96_Z3qYf4KZDQsKI4I.jpg?width=640&crop=smart&auto=webp&s=4348d5083e2133ec49ef01bcd28ea20a6f8d4b49",
            "width": 640,
            "height": 475
          }
        ],
        "variants": {},
        "id": "4FuhCyPuMlnqfCNwmRWT6UVORmVLfl-yFWTwpP4f7yI"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qtfj3t/market_movers_are_seeking_the_next_lowcap_gem/",
  "subreddit": "CryptoCurrency",
  "id": "qtfj3t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TLDR / Summary :\n\nA quick dive into a series of similarities evidently shown between Loopring and\nthe Infamous Shiba Inu coin and a strong belief that Market movers are seeking\nthe next JAWDROPPER that will perform similar to Shiba Inu (parabolically) if a\nnumber of factors and similiarities more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR / 概要 :\n\nLoopringと悪名高いShiba Inuコインとの間に明らかに見られる一連の類似性について簡単に説明します。\nそして、市場関係者は柴犬に似たパフォーマンスをする次のジョードロッパーを探していると確信しています。\nまた、市場関係者は、いくつかの要因が重なった場合に、柴犬と同じようなパフォーマンスをする次のジョードロッパーを探していると考えられます。\nいくつかの要因と類似性があれば...",
      "title": "市場の動きは、次の低資本の宝石を探しています。私がループリングと考えている理由は、すべてが早かったからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR / 摘要 :\n\n快速深入了解Loopring和Infamous Shiba Inu硬币之间明显的一系列相似之处。\n币之间的一系列相似之处，并强烈认为市场推动者正在寻求下一个与Shiba Inu相似的爪牙币。\n如果有一些因素和相似之处，市场参与者正在寻找下一个与芝华仕相似的JAWDROPPER(parabolically)。\n一些因素和相似之处更多...",
      "title": "市场推动者正在寻找下一个低市值宝石，以下是我认为Loopring的原因，而且都是早期。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR / 摘要 :\n\n快速深入瞭解Loopring和Infamous Shiba Inu硬幣之間明顯的一系列相似之處。\n幣之間的一系列相似之處，並強烈認爲市場推動者正在尋求下一個與Shiba Inu相似的爪牙幣。\n如果有一些因素和相似之處，市場參與者正在尋找下一個與芝華仕相似的JAWDROPPER(parabolically)。\n一些因素和相似之處更多...",
      "title": "市場推動者正在尋找下一個低市值寶石，以下是我認爲Loopring的原因，而且都是早期。"
    }
  ]
}