{
  "author": "BrokenParachutes",
  "original_created_utc": 1652111476,
  "title": "There will come a point when most people, including many here, will be convinced that crypto is actually dead and will never recover. That is the best time to buy.",
  "created_utc": 1652175309,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sentiment is a difficult thing to judge. People may seem negative about crypto now, but I think most of us would agree that we are still bullish on crypto in general for the mid to long term future.&lt;/p&gt;\n\n&lt;p&gt;While this is not the worst time to buy, there will probably be a years long period relatively soon where the sentiment around crypto is that it is dead and will legitimately never recover.&lt;/p&gt;\n\n&lt;p&gt;It wont just be normal people saying this, that will be the sentiment on this sub for many as well. You yourself will start to wonder if crypto can recover, and will probably start to think that crypto could actually just be dead. &lt;/p&gt;\n\n&lt;p&gt;As strange as it may seem now, it will be really really difficult to convince yourself to buy at that point. While the prices will be incredibly low, the overall sentiment will be that crypto will never see ATH ever again, and you won&amp;#39;t want to buy.&lt;/p&gt;\n\n&lt;p&gt;That will be the best time to buy, as it has been in the past, and we aren’t close to that point yet. We still have many more months, maybe even a year or more before that point. A good barometer for the bottom will be when you yourself start to think that crypto could be dead and will not recover. Those who have the conviction to buy at that point will make out the best in the next bull run, just like they have in the past.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/uluae3/there_will_come_a_point_when_most_people/",
  "subreddit": "CryptoCurrency",
  "id": "uluae3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sentiment is a difficult thing to judge. People may seem negative about crypto\nnow, but I think most of us would agree that we are still bullish on crypto in\ngeneral for the mid to long term future.\n\nWhile this is not the worst time to buy, there will probably be a years long\nperiod relatively soon…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "センチメントは判断が難しいものです。人々は暗号について否定的に見えるかもしれません。\nが、私たちの多くは、中長期的には暗号に対して強気であることに同意すると思います。\nに対して強気であることに同意すると思います。\n\n今が最悪の買い時というわけではありませんが、おそらく数年の長い期間が比較的早く訪れるでしょう。\n比較的早い時期に...",
      "title": "ここにいる多くの人を含め、ほとんどの人が暗号は実は死んでいて、二度と回復しないと確信するときが来るでしょう。それが購入のベストタイミングです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "情绪是一个很难判断的东西。现在人们可能看起来对加密货币持否定态度\n但我认为我们中的大多数人都会同意，我们仍然看好加密货币的中长期发展。\n一般来说，我们仍然看好中长期的未来。\n\n虽然现在不是买入的最坏时机，但可能很快会有几年的时间\n阶段，相对而言...",
      "title": "将来有一天，大多数人，包括这里的许多人，都会相信加密货币实际上已经死了，永远不会恢复。那是购买的最佳时机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "情緒是一個很難判斷的東西。現在人們可能看起來對加密貨幣持否定態度\n但我認爲我們中的大多數人都會同意，我們仍然看好加密貨幣的中長期發展。\n一般來說，我們仍然看好中長期的未來。\n\n雖然現在不是買入的最壞時機，但可能很快會有幾年的時間\n階段，相對而言...",
      "title": "將來有一天，大多數人，包括這裏的許多人，都會相信加密貨幣實際上已經死了，永遠不會恢復。那是購買的最佳時機。"
    }
  ]
}