{
  "author": "Silverjakk",
  "original_created_utc": 1652994625,
  "title": "I finally have wife changing money",
  "created_utc": 1653006981,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It finally happened.  I know it’s what we all dream about, but I finally have wife changing money!  And it’s all thanks to this glorious dip and my investment strategies!  I do remember they always said that the bear market is where the true riches are made.  They were right.&lt;/p&gt;\n\n&lt;p&gt;They say I’m one in a million.  That it can’t happen to just anyone.  But I’m here to remind you to not give up hope, it’s never too late! We are still young.  So much life to live.  We are still early!&lt;/p&gt;\n\n&lt;p&gt;Yep, I did it.  I made it.  I lost all my money from this bear market and the Luna crash.  My wife said it was the last straw and left me, divorce papers are in, and I am now free to change my wife.  Just think, someday you could be as lucky as me.  I have achieved the crypto dream within a dream.  Wife changing money.&lt;/p&gt;\n\n&lt;p&gt;TL:DR - Dreams do come true.  I have wife changing money.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 353,
  "permalink": "/r/CryptoCurrency/comments/utd5se/i_finally_have_wife_changing_money/",
  "subreddit": "CryptoCurrency",
  "id": "utd5se",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It finally happened. I know it’s what we all dream about, but I finally have\nwife changing money! And it’s all thanks to this glorious dip and my investment\nstrategies! I do remember they always said that the bear market is where the\ntrue riches are made. They were right.\n\nThey say I’m one in a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ついに実現しました。誰もが夢見ることだと思いますが、私はついに\n妻を変えるお金を手に入れました！そして、それはすべてこの素晴らしいディップと私の投資戦略のおかげです。\n投資戦略のおかげだ そういえば、弱気相場は真の富が生まれる場所だと言われていましたね。\n真の富が生まれる場所だと 彼らは正しかった。\n\n彼らは、私が...",
      "title": "ついに嫁入り道具を手に入れた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它终于发生了。我知道这是我们所有人的梦想，但我终于有了\n妻子的钱了！这一切都要归功于这次辉煌的下跌和我的投资。而这一切都要归功于这次辉煌的下跌和我的投资\n策略！我记得他们总是说，熊市是一个很重要的市场。我记得他们总是说，熊市才是真正的财富所在。\n真正的富人是在这里产生的。他们是对的。\n\n他们说我是一个在...",
      "title": "我终于有了换老婆的钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它終於發生了。我知道這是我們所有人的夢想，但我終於有了\n妻子的錢了！這一切都要歸功於這次輝煌的下跌和我的投資。而這一切都要歸功於這次輝煌的下跌和我的投資\n策略！我記得他們總是說，熊市是一個很重要的市場。我記得他們總是說，熊市纔是真正的財富所在。\n真正的富人是在這裏產生的。他們是對的。\n\n他們說我是一個在...",
      "title": "我終於有了換老婆的錢"
    }
  ]
}