{
  "author": "Uberguuy",
  "original_created_utc": 1639624274,
  "title": "Everything I've read about sieges of castles has said that once the walls were breached, defeat was inevitable. Were any sieges defeated at a castle's secondary defensive positions?",
  "created_utc": 1639648486,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read a few answers about sieges on the sub, and they&amp;#39;re always fantastic! Something I&amp;#39;ve noted is that every answer has said that a breach of the walls meant sure defeat, but also mention the besieged party preparing secondary defensive positions inside the walls to continue the defense. Did these ever work?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/rhgz41/everything_ive_read_about_sieges_of_castles_has/",
  "subreddit": "AskHistorians",
  "id": "rhgz41",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've read a few answers about sieges on the sub, and they're always fantastic!\nSomething I've noted is that every answer has said that a breach of the walls\nmeant sure defeat, but also mention the besieged party preparing secondary\ndefensive positions inside the walls to continue the defense. Did…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サブで攻城戦に関する回答をいくつか読みましたが、いつも素晴らしいですね。\n私が注目したのは、どの回答も、城壁が破られることは\nしかし、包囲された側が二次的な準備をすることにも触れています。\n城壁の内側に防御陣地を設けて、防御を継続した。そうですか...",
      "title": "私がこれまで読んだ城の攻防に関する本には、城壁を突破されたら敗北は必至と書かれていました。城の二次防御拠点で敗れた包囲網はあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读过一些关于围攻子的答案，它们总是很精彩！我注意到的是，每一个答案都说攻破城墙是一个很好的办法。\n我注意到的是，每个答案都说，攻破城墙\n意味着必败无疑，但也提到被围困的一方在城墙内准备第二道防御阵地以继续防御。\n但也提到被围困的一方在城墙内准备二级防御阵地以继续防御。难道...",
      "title": "我读到的关于围攻城堡的所有资料都说，一旦城墙被攻破，失败是不可避免的。是否有围攻者在城堡的次要防御位置被击败？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀過一些關於圍攻子的答案，它們總是很精彩！我注意到的是，每一個答案都說攻破城牆是一個很好的辦法。\n我注意到的是，每個答案都說，攻破城牆\n意味着必敗無疑，但也提到被圍困的一方在城牆內準備第二道防禦陣地以繼續防禦。\n但也提到被圍困的一方在城牆內準備二級防禦陣地以繼續防禦。難道...",
      "title": "我讀到的關於圍攻城堡的所有資料都說，一旦城牆被攻破，失敗是不可避免的。是否有圍攻者在城堡的次要防禦位置被擊敗？"
    }
  ]
}