{
  "author": "Successful-Scar5688",
  "the_new_excerpt": "I see the situation as being this:\n\nHedge funds band together and manipulate the market, in a “legal” way, they’ve\nbeen doing it since 1999,\n\nNow with social media, a bunch of redditors can get together and and form their\nown democratized hedge fund, to get in on the action basically\n\nAnd we are…",
  "original_created_utc": 1614610208,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我认为情况是这样的：\"对冲基金 \"联合起来，以 \"合法 \"的方式操纵市场。\n\n对冲基金联合起来操纵市场 以一种 \"合法 \"的方式，他们已经...\n从1999年开始就一直在做。\n\n现在有了社交媒体，一群红人可以聚集在一起，组成他们的。\n自己的民主化对冲基金，以获得在行动基本上\n\n而我们是...",
      "title": "你所拥有的最有价值的股票就是你自己的大脑。不要因为赌博上瘾而毁了它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲情況是這樣的：\"對沖基金 \"聯合起來，以 \"合法 \"的方式操縱市場。\n\n對沖基金聯合起來操縱市場 以一種 \"合法 \"的方式，他們已經...\n從1999年開始就一直在做。\n\n現在有了社交媒體，一羣紅人可以聚集在一起，組成他們的。\n自己的民主化對沖基金，以獲得在行動基本上\n\n而我們是...",
      "title": "你所擁有的最有價值的股票就是你自己的大腦。不要因爲賭博上癮而毀了它。"
    }
  ],
  "title": "The most valuable stock you’ll ever own is your own brain. Don’t ruin it with a gambling addiction.",
  "created_utc": 1614630706,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see the situation as being this: </p>\n\n<p>Hedge funds band together and manipulate the market, in a “legal” way, they’ve been doing it since 1999,</p>\n\n<p>Now with social media, a bunch of redditors can get together and and form their own democratized hedge fund, to get in on the action basically</p>\n\n<p>And we are winning.</p>\n\n<p>HOWEVER,</p>\n\n<p>I see a problem in that unlike the hedge fund managers, we are personally invested in our portfolios.  This is not just a number on a spreadsheet to many of us, it’s a house, it’s a car payment, it’s insurance...  We have a lot riding on this.</p>\n\n<p>I am very fortunate that I am only investing in this as a game and I don’t need to win money to pay off debts or feed myself, but I still found that when my $220 turned into $4k, it was a very very visceral experience.  It was well all I could think about that entire day and night, even into the next morning.  </p>\n\n<p>Maybe you see where this is going.  I believe the truth is that we are doing a good thing, we are swindling the swindlers, and it feels damn good, BUT, and I don’t mean to poop on everyone’s party, I can only see this as having a bad ending, where people put lots and lots of money in and they eventually change the rules so that we can’t win anymore and we’d have to move onto the next thing, and the hedge funds will be fine and go back to scamming America while a lot of us who can’t afford to lose much lose all their money and now have an expectation that the stock market will spit out crazy returns, which it won’t.</p>\n\n<p>The big institutions have always made the majority of their money by preying on everyday Americans instincts to buy and sell, they make money off of the activity, it doesn’t matter if it goes up or down really, they just try to sucker as many people as possible into putting as much money into stocks so they can make money off commissions, fees etc.</p>\n\n<p>Heed this warning please, don’t get caught up in the dopamine loop, don’t get left with an addiction in the stock market.  In the long term your mental health is much more important than any returns, the money is just the points in the game, your brain is your seat of consciousness through which you interpret everything, it’s a shitty shitty trade to trade one ounce of mental well-being for any amount of money really.</p>\n</div><!-- SC_ON -->",
  "score": 7175,
  "permalink": "/r/wallstreetbets/comments/lvb20g/the_most_valuable_stock_youll_ever_own_is_your/",
  "subreddit": "wallstreetbets",
  "id": "lvb20g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937755483
}