{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Thursday, May 6, 2021\n\nRemarkably, despite many individual companies pulling back steeply today, the\nthree major indexes finished the day positive, driven by gains in financial\nstocks and stability in mega-caps. Growth stocks and more speculative plays have\nbeen hit hard by a…",
  "original_created_utc": 1620333190,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サイコ・マーケット・レビュー - 2021年5月6日（木\n\n驚くべきことに、今日は多くの個別企業が急に後退したにもかかわらず、主要3指数は\n主要3指数は、金融株の上昇やメガバンクの堅調な推移により、プラスで終了した。\n金融株の上昇とメガキャップの安定により、主要3指数はプラスで終了しました。成長株や投機的な銘柄は、世界的な金融危機の影響を受けています。\n成長株や投機的な銘柄は、世界的な金融危機の影響を強く受けています。",
      "title": "本日2021年5月6日（木）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾 - 2021年5月6日，星期四\n\n值得注意的是，尽管许多个别公司今天急剧回落，但三大指数在金融股上涨的推动下，完成了一天的上涨。\n三大指数在金融股上涨的推动下，完成了一天的正值。\n涨和巨型股的稳定。成长股和更具投机性的股票已经\n遭到了严重的打击。",
      "title": "以下是今天的市场回顾，2021年5月6日，星期四"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧 - 2021年5月6日，星期四\n\n值得注意的是，儘管許多個別公司今天急劇回落，但三大指數在金融股上漲的推動下，完成了一天的上漲。\n三大指數在金融股上漲的推動下，完成了一天的正值。\n漲和巨型股的穩定。成長股和更具投機性的股票已經\n遭到了嚴重的打擊。",
      "title": "以下是今天的市場回顧，2021年5月6日，星期四"
    }
  ],
  "title": "Here is a Market Recap for today Thursday, May 6, 2021",
  "created_utc": 1620344247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Thursday, May 6, 2021</strong></p>\n\n<p>Remarkably, despite many individual companies pulling back steeply today, the three major indexes finished the day positive, driven by gains in financial stocks and stability in mega-caps. Growth stocks and more speculative plays have been hit hard by a combination of inflationary fears and recent suggestions by monetary officials that the interest rate should be raised. The S&amp;P 500 (SPY) closed the day 0.81%, less than 1% below it’s record high. The Dow Jones (DIA) recorded a new intraday record while the Nasdaq (QQQ) closed 0.76%. Market participants continue to monitor commentary from monetary officials, ongoing earnings season, and new economic data, particularly the April Jobs Report set for release tomorrow morning.</p>\n\n<p>After reclaiming the leadership in April as the best performing sector in the SPY, so far in May we have seen investors rotate out of big tech stocks and into financial stocks, with many big banks pushing all-time highs today. Market participants are worried that a suggested raise in interest would affect the already stretched valuation of some companies. Given the rally the market saw in April, some analysts are worried that positive catalysts for equities are getting harder to achieve and may be running out. The economy in the US is recovering faster than initially predicted by analysts, with this earnings season seeing 86% of companies in the S&amp;P 500 that have reported earnings  beat estimates, according to data from FactSet. </p>\n\n<p>Treasury Secretary Janet Yellen suggested that interest rates may need to rise in the near-term to prevent the economy from overheating, with the recent economic data and corporate earnings showing economic activity recovering much faster than expected as effective distribution of the vaccine in the US allows states to gradually reopen. Yellen said, “It may be that interest rates will have to rise somewhat to make sure that our economy doesn&#39;t overheat, even though the additional spending is relatively small relative to the size of the economy. It could cause some very modest increases in interest rates to get that reallocation, but these are investments our economy needs to be competitive and to be productive. I think our economy will grow faster because of them.&quot; In later remarks, she added that raising rates was not something she was predicting or recommending and that the decision ultimately rests with the Federal Reserve. She said, “Let me be clear, that’s not something I’m predicting or recommending. If anybody appreciates the independence of the Fed, I think that person is me.”</p>\n\n<p>The Labor Department will release its April jobs report on Friday, which is expected to show a staggering nearly 1 million payrolls came back last month, accelerating March’s gain. As a reminder, in March, the Department of Labor reported nonfarm payrolls increased by 916,000 for the month while the unemployment rate fell to 6% (unemployment rate was 14.6% in April 2020). Economists surveyed by Dow Jones had been looking for an increase of 675,000 and an unemployment rate of 6%.</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Weekly unemployment claims fell to 498,000 last week—a new low since the Covid-19 pandemic began more than a year ago. The four-week average of initial claims is also at the lowest point since the pandemic began. Read more <a href=\"https://www.wsj.com/articles/weekly-jobless-claims-coronavirus-05-06-2021-11620247798\">here</a>.</li>\n<li>The Bank of England upped their growth estimates for the economy of the UK, anticipating GDP will grow 7.25% in the country, up from its forecast for 5% growth in February. The BOE also now sees inflation averaging 2.5% in 2021, up from its prior forecast for 2%, but said the rise in price pressures will likely be &quot;temporary.&quot; </li>\n<li>NIO announced the company will expand into Norway, with the group’s first service and delivery center set to open in the capital Oslo in September.</li>\n<li>A lot of stocks pulled back despite posting better than expected earnings. The market is very narrow right now, with gains concentrated in the financials, energy, and mega-caps.</li>\n<li>IBM introduced what it says is the world&#39;s first 2-nanometer chip making technology. The technology could be as much as 45% faster than the mainstream 7-nanometer chips in many of today&#39;s laptops and phones and up to 75% more power efficient, the company said. Read more<a href=\"https://www.reuters.com/technology/ibm-unveils-2-nanometer-chip-technology-faster-computing-2021-05-06/\"> here. </a></li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday changes.*\\</strong>*</li>\n<li>Agio Pharmaceuticals (AGIO) target raised by Canaccord Genuity from $57 to $65 at Buy. Stock currently around $53</li>\n<li>Allegro MicroSystems (ALGM) target raised by Mizuho from $35 to $38 at Buy. Stock currently around  $25.</li>\n<li>Amazon (AMZN) with a host of target raises. Consensus price target $4150 at Buy. Stock currently around $3270</li>\n<li>Booking (BKNG) with two target raises. Stock currently around $2338\n\n<ul>\n<li>Deutsche Bank from $2600 to $2665 at Buy</li>\n<li>Barclays from $2710 to $2740 at Buy</li>\n</ul></li>\n<li>Burlington Stores (BURL) target raised by Morgan Stanley (MS) from $317 to $385 at Overweight. Stock currently around $327</li>\n<li>CareDX (CDNA) target raised by Piper Sandler from $93 to $100 at Overweight. Stock currently around $73</li>\n<li>Comcast (CMCSA) with two target raises. Stock currently around $56\n\n<ul>\n<li>Goldman Sachs from $62 to $64 at Buy</li>\n<li>Raymond James from $61 to $63 at Outperform</li>\n</ul></li>\n<li>Caesars Entertainment (CZR) target raised by KeyCorp from $110 to $125 at Overweight. Stock currently around $102</li>\n<li>Dell Technologies (DELL) target raised by Morgan Stanley from $120 to $127 at Overweight. Stock currently around $103</li>\n<li>DexCom (DXCM) with three target raises. Stock currently around $366\n\n<ul>\n<li>Raymond James from $449 to $466 </li>\n<li>Canaccord Genuity from $445 to $455</li>\n<li>Citigroup from $480 to $488</li>\n</ul></li>\n<li>Equitable (EQH) target raised by Morgan Stanley from $44 to $45 at Overweight. Stock currently around $35</li>\n<li>Floor &amp; Decor (FND) target raised by Wedbush from $110 to $130 at Outperform. Stock currently around $113</li>\n<li>Gilead Sciences (GILD) target raised by SVB Leerink from $72 to $74 at Outperform. Stock currently around $66.5</li>\n<li>General Motors (GM) with three target raises. Stock currently around $57.5\n\n<ul>\n<li>Barclays from $64 to $66 </li>\n<li>Royal Bank of Canada from $67 to $72 </li>\n<li>Deutsche Bank from $67 to $70 </li>\n</ul></li>\n<li>HubSpot (HUBS) with four target raises. Stock currently around $503\n\n<ul>\n<li>Needham &amp; Co from $520 to $600 </li>\n<li>Piper Sandler from $600 to $615</li>\n<li>Morgan Stanley from $567 to $605</li>\n<li>BMO Capital Markets from $565 to $585</li>\n</ul></li>\n<li>InMode (INMD) with two target raises. Stock currently around $81\n\n<ul>\n<li>Canaccord Genuity from $80 to $95 at Buy</li>\n<li>Robert W Baird from $84 to $104 at Outperform</li>\n</ul></li>\n<li>JP Morgan (JPM) target raised by Wells Fargo from $190 to $195 at Overweight. Stock currently around $157</li>\n<li>Mastercard (MA) with two target raises. Stock currently around $369\n\n<ul>\n<li>Mizuho from $430 to $435 at Buy</li>\n<li>Jefferies from $440 to $450 at Buy</li>\n</ul></li>\n<li>McDonald&#39;s (MCD) with a host of target raises. Consensus price target $260 at Outperform. Stock currently around $235</li>\n<li>NuVasive (NUVA) with two target raises. Stock currently around $70\n\n<ul>\n<li>Piper Sandler from $75 to $80 at Overweight</li>\n<li>Needham &amp; Co from $70 to $80 at Buy</li>\n</ul></li>\n<li>OSI Systems (OSIS) with two target raises. Stock currently around $95\n\n<ul>\n<li>B. Riley from $104 to $118 at Buy</li>\n<li>Roth Capital from $108 to $122 at Buy</li>\n</ul></li>\n<li>Paypal (PYPL) with a host of target raises. Consensus price target at $320 at Overweight. Stock currently around $247</li>\n<li>UBER target raised by Deutsche Bank from $82 to $85 at Buy. Stock currently around $48. Gig-economy stock has been hammered by recent talks from the Secretary of Labor in the US</li>\n</ul>\n\n<p>“Patience is not simply the ability to wait – it’s how we behave while we’re waiting.” – Joyce Meyer</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/stocks/comments/n6gx5p/here_is_a_market_recap_for_today_thursday_may_6/",
  "subreddit": "stocks",
  "id": "n6gx5p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995611
}