{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "A few weeks ago, I hit a savings milestone and realized I needed to ensure I was making the most of the money in my portfolio, which led me here. As of this morning, I've finished moving (what I can) into a Boglehead-approved portfolio, and it feels great. \n\nMy old portfolio:\n\n* **60% FASIX**, which made no sense for someone in my situation (33 years old with a healthy emergency fund). I guess I initially chose it years ago because I wanted something very low risk that would still outpace inflation slightly?\n* **20% in FCNTX**, which I bought after Googling \"best mutual funds.\"\n* **15% in GOOG**, which I bought in the early 2010s because of reasons?\n* **5% in AAPL**, which I bought this year I guess because my GOOG had done so well? Whatever. It was dumb.\n\nAll in all, not the best portfolio but not the worst. My decision making was... flawed, but I almost certainly did better than most people who go all-in on individual stocks that friends/uncles/random Redditors *swear* will be the next Amazon. I definitely paid at least $10k in opportunity cost plus what I'll have to pay in capital gains tax on the funds I sold. I'm kicking myself for this but I'm really glad I pivoted now rather than later.\n\nNew portfolio:\n\n* **80% VTI/FZROX**. VTI in taxable and FZROX in tax-advantaged. I have no plans to leave Fidelity, but I don't know what the future holds and wanted to take advantage of the zero expense ratio without boxing myself in completely.\n* **20% VXUS/FTIHX**. VXUS in taxable and FTIHX in tax-advantaged. I ultimately chose FTIHX over FZILX because FZILX excludes small caps. That said, u/[**UmmQastal**](https://www.reddit.com/user/UmmQastal/) explains [here](https://www.reddit.com/r/Bogleheads/comments/p6t2fc/fzrox_and_fzilx_for_roth/h9gnwpa/?context=3) that it probably won't matter. I just wanted to start my Boglehead journey completely diversified but may simply use FZILX moving forward.\n* **I have not sold my GOOG/AAPL** and consider those separate. I will sell AAPL after one year but GOOG has appreciated enough that selling gives me pause even though it's long-term gains at this point. I welcome thoughts on the matter.\n\nSome notes:\n\n* This is the first time I've ever had to truly commit to a belief system. I know this won't work unless I have complete faith during hard times. As a lifelong atheist, the only thing I've ever believed was that nothing good comes from devotion to an ideology. I get that an evidence-based approach to investing isn't the same as religious fundamentalism, but in practice... it kind of is. **As such, I made sure to do enough reading and didn't set anything up until I was utterly convinced by the compelling body of evidence supporting this approach.** This way, I'll \"keep the faith\" in downturns.\n* To this end, I did not end up doing anything beyond a simple US/ex-US split. I was not sufficiently convinced by the evidence supporting a \"tilt.\" That doesn't mean the approach is wrong, it just means that I don't have enough of a background in finance to understand the potential benefits of tilting. **Therefore, I don't trust myself not to sell during the periods of underperformance we can expect from, for example, small cap value**. But I'm not done learning (I never am!), so I haven't ruled out a tilt for the future.\n* I chose an 80%/20% split because it's what I feel most comfortable with. As I mentioned, I'm still learning and expect to become more comfortable with allocating more towards international in the near future. \n* I decided against bond funds at this time because 1) I am young(ish) and a downturn will not affect my near and long-term plans and 2) I'm still pretty confused by bond funds. I will be adding bond funds over the coming years as I learn more. I *did* purchase 10k in I-bonds to serve as both a future emergency fund *and* a bond fund that will be guaranteed not to dip below its initial investment. I may add another 10k next year. \n* **I have enabled the \"hide balances\" feature on Fidelity as an additional behavioral failsafe.** This will help me not to peek during downturns, which is especially useful because I can't auto invest ETFs so I *will* still need to be logging in. I've also found a place on the Fidelity site where I can view allocation percentages without viewing balances, so I can still rebalance every year or so without peeking. \n\nAnyway, I wanted to share how happy and relived I am and explain my thought process for anyone considering the Boglehead method. As always, I welcome any thoughts/opinions on anything I've written out.",
  "author_fullname": "t2_2vlkg0ma",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Officially a Boglehead!",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_pawyle",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 59,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 59,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1629841118,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A few weeks ago, I hit a savings milestone and realized I needed to ensure I was making the most of the money in my portfolio, which led me here. As of this morning, I&#39;ve finished moving (what I can) into a Boglehead-approved portfolio, and it feels great. </p>\n\n<p>My old portfolio:</p>\n\n<ul>\n<li><strong>60% FASIX</strong>, which made no sense for someone in my situation (33 years old with a healthy emergency fund). I guess I initially chose it years ago because I wanted something very low risk that would still outpace inflation slightly?</li>\n<li><strong>20% in FCNTX</strong>, which I bought after Googling &quot;best mutual funds.&quot;</li>\n<li><strong>15% in GOOG</strong>, which I bought in the early 2010s because of reasons?</li>\n<li><strong>5% in AAPL</strong>, which I bought this year I guess because my GOOG had done so well? Whatever. It was dumb.</li>\n</ul>\n\n<p>All in all, not the best portfolio but not the worst. My decision making was... flawed, but I almost certainly did better than most people who go all-in on individual stocks that friends/uncles/random Redditors <em>swear</em> will be the next Amazon. I definitely paid at least $10k in opportunity cost plus what I&#39;ll have to pay in capital gains tax on the funds I sold. I&#39;m kicking myself for this but I&#39;m really glad I pivoted now rather than later.</p>\n\n<p>New portfolio:</p>\n\n<ul>\n<li><strong>80% VTI/FZROX</strong>. VTI in taxable and FZROX in tax-advantaged. I have no plans to leave Fidelity, but I don&#39;t know what the future holds and wanted to take advantage of the zero expense ratio without boxing myself in completely.</li>\n<li><strong>20% VXUS/FTIHX</strong>. VXUS in taxable and FTIHX in tax-advantaged. I ultimately chose FTIHX over FZILX because FZILX excludes small caps. That said, u/<a href=\"https://www.reddit.com/user/UmmQastal/\"><strong>UmmQastal</strong></a> explains <a href=\"https://www.reddit.com/r/Bogleheads/comments/p6t2fc/fzrox_and_fzilx_for_roth/h9gnwpa/?context=3\">here</a> that it probably won&#39;t matter. I just wanted to start my Boglehead journey completely diversified but may simply use FZILX moving forward.</li>\n<li><strong>I have not sold my GOOG/AAPL</strong> and consider those separate. I will sell AAPL after one year but GOOG has appreciated enough that selling gives me pause even though it&#39;s long-term gains at this point. I welcome thoughts on the matter.</li>\n</ul>\n\n<p>Some notes:</p>\n\n<ul>\n<li>This is the first time I&#39;ve ever had to truly commit to a belief system. I know this won&#39;t work unless I have complete faith during hard times. As a lifelong atheist, the only thing I&#39;ve ever believed was that nothing good comes from devotion to an ideology. I get that an evidence-based approach to investing isn&#39;t the same as religious fundamentalism, but in practice... it kind of is. <strong>As such, I made sure to do enough reading and didn&#39;t set anything up until I was utterly convinced by the compelling body of evidence supporting this approach.</strong> This way, I&#39;ll &quot;keep the faith&quot; in downturns.</li>\n<li>To this end, I did not end up doing anything beyond a simple US/ex-US split. I was not sufficiently convinced by the evidence supporting a &quot;tilt.&quot; That doesn&#39;t mean the approach is wrong, it just means that I don&#39;t have enough of a background in finance to understand the potential benefits of tilting. <strong>Therefore, I don&#39;t trust myself not to sell during the periods of underperformance we can expect from, for example, small cap value</strong>. But I&#39;m not done learning (I never am!), so I haven&#39;t ruled out a tilt for the future.</li>\n<li>I chose an 80%/20% split because it&#39;s what I feel most comfortable with. As I mentioned, I&#39;m still learning and expect to become more comfortable with allocating more towards international in the near future. </li>\n<li>I decided against bond funds at this time because 1) I am young(ish) and a downturn will not affect my near and long-term plans and 2) I&#39;m still pretty confused by bond funds. I will be adding bond funds over the coming years as I learn more. I <em>did</em> purchase 10k in I-bonds to serve as both a future emergency fund <em>and</em> a bond fund that will be guaranteed not to dip below its initial investment. I may add another 10k next year. </li>\n<li><strong>I have enabled the &quot;hide balances&quot; feature on Fidelity as an additional behavioral failsafe.</strong> This will help me not to peek during downturns, which is especially useful because I can&#39;t auto invest ETFs so I <em>will</em> still need to be logging in. I&#39;ve also found a place on the Fidelity site where I can view allocation percentages without viewing balances, so I can still rebalance every year or so without peeking. </li>\n</ul>\n\n<p>Anyway, I wanted to share how happy and relived I am and explain my thought process for anyone considering the Boglehead method. As always, I welcome any thoughts/opinions on anything I&#39;ve written out.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "pawyle",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "marvelousmrsmuffin",
  "discussion_type": null,
  "num_comments": 8,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/pawyle/officially_a_boglehead/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/pawyle/officially_a_boglehead/",
  "subreddit_subscribers": 89052,
  "created_utc": 1629848641,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1629841118,
  "the_new_excerpt": "A few weeks ago, I hit a savings milestone and realized I needed to ensure I was\nmaking the most of the money in my portfolio, which led me here. As of this\nmorning, I've finished moving (what I can) into a Boglehead-approved portfolio,\nand it feels great.\n\nMy old portfolio:\n\n * 60% FASIX, which…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数週間前、私は貯金額の節目を迎え、自分のポートフォリオの中でお金を最大限に活用しているかどうかを確認する必要があることに気づきました。\nその結果、ここにたどり着きました。今日の朝の時点で\n今朝の時点で、ボーグルヘッドが承認したポートフォリオに（できる限り）移行し終えました。\nとてもいい気分です。\n\n私の古いポートフォリオ。\n\n * 60%のFASIX、これは...",
      "title": "正式にボーグルヘッドになりました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几周前，我达到了一个储蓄的里程碑，并意识到我需要确保我在投资组合中的资金得到充分利用。\n充分利用我的投资组合中的资金，这使我来到这里。截止到今天\n上午，我已经完成了将（我所能做的）转移到一个Boglehead批准的投资组合中。\n而且感觉很好。\n\n我以前的投资组合。\n\n * 60%的FASIX，这...",
      "title": "正式成为Boglehead!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾周前，我達到了一個儲蓄的里程碑，並意識到我需要確保我在投資組合中的資金得到充分利用。\n充分利用我的投資組合中的資金，這使我來到這裏。截止到今天\n上午，我已經完成了將（我所能做的）轉移到一個Boglehead批准的投資組合中。\n而且感覺很好。\n\n我以前的投資組合。\n\n * 60%的FASIX，這...",
      "title": "正式成爲Boglehead!"
    }
  ],
  "source_updated_at": 1630057190967
}