{
  "author": "MoreBend",
  "the_new_excerpt": "A little backstory. I come from an ex-USSR country and recently I had a zoom\ncall with my grandfather and I said something along the lines \"How nice that\ntechnology allows us to see each other while talking\". And then he responded\nwith: \" You know, we had video call possibilities a long time…",
  "original_created_utc": 1611737459,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说点背景故事。我来自一个前苏联国家，最近我有一个变焦。\n与我的祖父和我说的东西沿线 \"多好，\n技术让我们在交谈时可以看到对方\"。然后他回应道\n与。\"你知道，我们有视频通话的可能性 很长一段时间... ...",
      "title": "我的祖父告诉我，在70-80年代，苏联有一种 \"视频通话 \"的可能性。苏联人拥有所需的技术并会向公众提供这种可能性的可能性有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說點背景故事。我來自一個前蘇聯國家，最近我有一個變焦。\n與我的祖父和我說的東西沿線 \"多好，\n技術讓我們在交談時可以看到對方\"。然後他迴應道\n與。\"你知道，我們有視頻通話的可能性 很長一段時間... ...",
      "title": "我的祖父告訴我，在70-80年代，蘇聯有一種 \"視頻通話 \"的可能性。蘇聯人擁有所需的技術並會向公衆提供這種可能性的可能性有多大？"
    }
  ],
  "title": "My grandfather told me about a \"video call\" possibility in the Soviet Union during the 70s-80s. How likely is that the Soviets had the technology needed and would offer the possibility to the public?",
  "created_utc": 1611763940,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A little backstory. I come from an ex-USSR country and recently I had a zoom call with my grandfather and I said something along the lines &quot;How nice that technology allows us to see each other while talking&quot;. And then he responded with: &quot; You know, we had video call possibilities a long time ago.&quot;</p>\n\n<p>According to him, the procedure was like this: Like any long-distance call, you had to go to the post office. At the post office, you could pick an option to call through a &quot;videocall&quot;, he said that the option was only offered to major cities like Moscow or Leningrad. So, when you got your opportunity to make the video call, you had to go into this little booth, that had a small tv like screen and you could see the person you were talking to. He didn&#39;t remember the exact time when this was but said late 70s early 80s.  </p>\n\n<p>While my grandfather is old, he is surprisingly comprehensive, but I still seem to be skeptical of this possibility. Could this be true and would they even offer this to the general public?</p>\n</div><!-- SC_ON -->",
  "score": 3188,
  "permalink": "/r/AskHistorians/comments/l60b44/my_grandfather_told_me_about_a_video_call/",
  "subreddit": "AskHistorians",
  "id": "l60b44",
  "is_self": true,
  "media": null,
  "is_video": false
}