{
  "author": "jjcs83",
  "original_created_utc": 1631448251,
  "title": "Leaked audio of Safemoon's CTO discussing setting up a rival scam token",
  "created_utc": 1631482331,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Audio has leaked of Safemoon&#39;s former CTO Hank Wyatt discussing releasing a rival scam token. Wyatt quit 2 days ago after the wallet fiasco, although this audio indicates that he has been planning to leave for months and was trying to extract $3m by holding the twitter, discord and website to ransom. </p>\n\n<p><a href=\"https://twitter.com/de_crypto_mole/status/1436952213335707649?s=21\">https://twitter.com/de_crypto_mole/status/1436952213335707649?s=21</a></p>\n\n<p>Notable quotes: </p>\n\n<p>&quot;Piggy will make you wealthy. The next project will make you all flithy rich&quot; </p>\n\n<p>&quot;In the Contract, we&#39;ll be able to give up Contract owernship but maintain it, so we won&#39;t be able to rug the liquidity... but we&#39;ll be able to exempt exchanges so we can put it everywhere. And we already have an inside guy too. So we already have a guarantee we&#39;ll be on kucoin with the first two months...&quot;</p>\n\n<p>&quot;And Thomas only works 15 hours a week&quot;</p>\n\n<p>&quot;So we&#39;ll have every milestone video already done&quot; </p>\n\n<p>While this doesn&#39;t directly implicate Safemoon, any reasonable person can conclude the Safemoon was set up in exactly the same manner. Basically a scam token which siphons off liquidity by exempting certain wallets.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/8h6kE-5d2aGQGIhjJwAfLZhmSVizzPnTc6B5OMOEf-M.jpg?auto=webp&s=17a26198776d9374ec4a5b271e56570eca4f5787",
          "width": 140,
          "height": 78
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/8h6kE-5d2aGQGIhjJwAfLZhmSVizzPnTc6B5OMOEf-M.jpg?width=108&crop=smart&auto=webp&s=2560ead20bafe24ea42ca2926b77a739e8638449",
            "width": 108,
            "height": 60
          }
        ],
        "variants": {},
        "id": "zKBEOZYDmGfafaQwA17Xq70pRZviGVkjaq_BTyg7-i8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pmrgwz/leaked_audio_of_safemoons_cto_discussing_setting/",
  "subreddit": "CryptoCurrency",
  "id": "pmrgwz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Audio has leaked of Safemoon's former CTO Hank Wyatt discussing releasing a\nrival scam token. Wyatt quit 2 days ago after the wallet fiasco, although this\naudio indicates that he has been planning to leave for months and was trying to\nextract $3m by holding the twitter, discord and website to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Safemoonの元CTOであるHank Wyattが、ライバルの詐欺トークンをリリースすることについて話している音声が流出しました。\nライバルの詐欺トークンのリリースについて話している音声がリークされました。ワイアットはウォレット騒動の後、2日前に辞めましたが、今回の音声では\nこの音声は、彼が何ヶ月も前から辞めることを計画していたことを示しています。\nこの音声は、彼が何ヶ月も前から辞めることを計画していたことを示しています。",
      "title": "SafemoonのCTOがライバルの詐欺トークンの設定について話している音声がリークされた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Safemoon的前首席技术官Hank Wyatt讨论发布一个竞争对手的诈骗代币的音频已经泄露。\n竞争对手的欺诈性代币。怀亚特两天前在钱包惨败后辞职，尽管这个\n录音显示，他已经计划离开几个月了，并试图通过持有代币来获取300万美元。\n试图通过把持微博、讨论区和网站来套取300万美元。",
      "title": "泄露的Safemoon公司首席技术官讨论建立一个竞争对手的诈骗代币的音频"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Safemoon的前首席技術官Hank Wyatt討論發佈一個競爭對手的詐騙代幣的音頻已經泄露。\n競爭對手的欺詐性代幣。懷亞特兩天前在錢包慘敗後辭職，儘管這個\n錄音顯示，他已經計劃離開幾個月了，並試圖通過持有代幣來獲取300萬美元。\n試圖通過把持微博、討論區和網站來套取300萬美元。",
      "title": "泄露的Safemoon公司首席技術官討論建立一個競爭對手的詐騙代幣的音頻"
    }
  ]
}