{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Hi Reddit! We're Dr. Christopher Bell, Associate Professor and Director of the\nIntegrative Biology Lab at Colorado State University, and Keith Woelfel,\nDirector of R&D at Caliper Foods, and we just published the first peer-reviewed\ninvestigation of consumer CBD product pharmacokinetics. The study…",
  "original_created_utc": 1615978831,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Hi Reddit! 我们是克里斯托弗-贝尔博士，副教授，也是该学院的院长。\n科罗拉多州立大学的综合生物学实验室，以及Keith Woelfel。\n卡利伯食品公司的研发总监，我们刚刚发表了第一篇同行评议的文章。\n消费者CBD产品药代动力学的调查。该研究...",
      "title": "AskScience AMA系列。科罗拉多州立大学公布了第一个测量和比较CBD吸收率的人体临床研究，通过食品和补充产品的形式，问我们任何东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Hi Reddit! 我們是克里斯托弗-貝爾博士，副教授，也是該學院的院長。\n科羅拉多州立大學的綜合生物學實驗室，以及Keith Woelfel。\n卡利伯食品公司的研發總監，我們剛剛發表了第一篇同行評議的文章。\n消費者CBD產品藥代動力學的調查。該研究...",
      "title": "AskScience AMA系列。科羅拉多州立大學公佈了第一個測量和比較CBD吸收率的人體臨牀研究，通過食品和補充產品的形式，問我們任何東西"
    }
  ],
  "title": "AskScience AMA Series: Colorado State University Unveils The First Human Clinical Study Measuring and Comparing the Absorption Rate of CBD Delivered Through Food & Supplement Product Formats, Ask Us Anything!",
  "created_utc": 1615998905,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Reddit! We&#39;re Dr. Christopher Bell, Associate Professor and Director of the Integrative Biology Lab at Colorado State University, and Keith Woelfel, Director of R&amp;D at Caliper Foods, and we just published the first peer-reviewed investigation of consumer CBD product pharmacokinetics. The study was <a href=\"https://www.mdpi.com/1424-8247/14/1/35\">published</a> in a special edition of the Medical Journal <a href=\"https://www.mdpi.com/journal/pharmaceuticals\">Pharmaceuticals</a> entitled <a href=\"https://www.mdpi.com/journal/pharmaceuticals/special_issues/cannabidiol\">Cannabidiol: Advances in Therapeutic Applications and Future Perspectives</a>, and was approved by Colorado State University&#39;s Institutional Review Board (IRB) in compliance with the requirements of <a href=\"https://www.ecfr.gov/cgi-bin/retrieveECFR?gp=&amp;SID=83cd09e1c0f5c6937cd9d7513160fc3f&amp;pitd=20180719&amp;n=pt45.1.46&amp;r=PART&amp;ty=HTML\">45 CFR 46</a> for human clinical research.</p>\n\n<p>Pharmacokinetics (PK) is the science of how bioactives diffuse through the body, and it reveals the difference between what we consume and what we absorb (vs. what we excrete), as well the rate and efficiency of absorption. PK studies are critical to understanding the efficacy of any bioactive compound, including CBD, since a bioactive&#39;s effect is a function of its presence. In other words, you can&#39;t feel what you don&#39;t absorb. PK studies provide the scientific foundation for claims such as &quot;fast acting,&quot; &quot;long lasting,&quot; and &quot;superior bioavailability.&quot;</p>\n\n<p>To date, when CBD product manufacturers have claimed fast action or superior absorption, they have generally based those claims - to the extent they&#39;ve predicated them at all - on mouse studies or analogies to non-cannabinoid bioactives (often curcumin). Caliper&#39;s study represents the first human clinical substantiation of such claims, as well as the first to do so using commercially available products and an IRB-approved study design. Moreover, with the CBD industry generally mired in fraud and mistrust enabled by the prominent absence of Food &amp; Drug Administration (FDA) oversight or enforcement over the past four years, this study is unique in its academic integrity. Although Caliper provided funding for the study, Colorado State University exercised complete and independent authority over the collection, analysis, and publication of these results.</p>\n\n<p>Conducted by Colorado State University researchers, this study compared the pharmacokinetic\nprofiles of three proprietary soluble CBD formats - Caliper Powder, Caliper Quillaia-based Liquid Concentrate, and Caliper Gum Arabic-based Liquid Concentrate - against two control formats: oil-based CBD tincture and unemulsified CBD isolate, which together power the <a href=\"https://cdn2.hubspot.net/hubfs/3324860/NFD-TheCBDReport-ES-092018.pdf\">majority (pdf)</a> of available consumer CBD products in use today. The blinded, randomized, <a href=\"https://en.wikipedia.org/wiki/Crossover_study\">crossover</a> study design involved 15 healthy men and women, ages 21-62, each consuming 30 mg of CBD in each product format. Participants provided venous blood samples prior to ingestion, and then at regular intervals over the ensuing four hours. Blood analysis revealed that all of Caliper&#39;s product formats were absorbed significantly faster than either control:</p>\n\n<ul>\n<li>Caliper Powder, which is used in Caliper&#39;s flagship consumer offerings, <a href=\"https://trycaliper.com/product/caliper-cbd/\">Caliper CBD</a> and <a href=\"https://trycaliper.com/product/caliper-swiftsticks/\">Caliper Swiftswticks</a>, delivered CBD into the bloodstream 142 times faster than isolate, and 22 times faster than tincture, in the 30 minutes following ingestion, based on a comparison of observed circulating blood levels of CBD.</li>\n<li>Caliper Gum Arabic-based Liquid Concentrate (SKU: T-L-A-5), which is used by <a href=\"https://caliperingredients.life/\">Caliper\nIngredients</a>&#39; customers to power a variety of beverage, food, and supplement products, delivered CBD into the bloodstream 424 times faster than isolate, and 64 times faster than tincture, in the 30 minutes following ingestion, based on a comparison of observed circulating blood levels of CBD.</li>\n<li>Caliper Quillaia-based Liquid Concentrate (SKU: T-L-Q-20), which is used by Caliper Ingredients&#39; customers to power a variety of beverage, food, and supplement products in the natural foods channel, delivered CBD into the bloodstream 218 times faster than isolate, and 33 times faster than tincture, in the 30 minutes following ingestion, based on a comparison of observed circulating blood levels of CBD.</li>\n</ul>\n\n<p>We welcome any and all questions related to the study! Keith&#39;s handle is <a href=\"/u/TryCaliper\">/u/TryCaliper</a> and Dr. Bell&#39;s handle is <a href=\"/u/DrBellCSU\">/u/DrBellCSU</a>. AUA! We&#39;ll be available today (3/15/2021) until 5pm MT (7pm ET, 23 UT), but will be checking in after that to make sure everything is answered!</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/askscience/comments/m6xv5b/askscience_ama_series_colorado_state_university/",
  "subreddit": "askscience",
  "id": "m6xv5b",
  "is_self": true,
  "media": null,
  "is_video": false
}