{
  "author": "Soap_MacLavish",
  "original_created_utc": 1627694648,
  "title": "Why is it common to hear older people from former Soviet states proclaim that \"things were better during the USSR\"? In what ways, and for whom, were things objectively \"better\" under the USSR?",
  "created_utc": 1627719966,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I suppose the former Soviet states turned EU member states are generally excluded from this as their standard of living has reached a sufficient level post-Soviet, but as someone with many friends and acquaintances from countries like Russia, Ukraine, Kazakhstan, I have heard this being expressed countless times from people old enough to remember living in the USSR.</p>\n\n<p>For large groups of people, is it accurate to say that their living conditions were in fact objectively better under the USSR? Can we settle this with facts and figures? Or is it merely a case of nostalgia, remembering things being cleaner, more efficient, safer than they actually were? Or was it perhaps that the conditions were as bad, the difference being that the citizens of the USSR felt a greater purpose and belonging, and thus were more content even amid poorer standards of living?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ouy4hh/why_is_it_common_to_hear_older_people_from_former/",
  "subreddit": "AskHistorians",
  "id": "ouy4hh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I suppose the former Soviet states turned EU member states are generally\nexcluded from this as their standard of living has reached a sufficient level\npost-Soviet, but as someone with many friends and acquaintances from countries\nlike Russia, Ukraine, Kazakhstan, I have heard this being expressed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "旧ソ連からEU加盟国になった国々は、生活水準が十分なレベルに達しているので、一般的には除外されるのではないでしょうか。\n生活水準が十分なレベルに達していることから、除外されています。\nしかし、ロシア、ウクライナ、カザフスタンなどの友人・知人が多い私にとっては、このような意見を聞くことがあります。\nしかし、ロシア、ウクライナ、カザフスタンなどの友人・知人が多い私は、このような意見を耳にしたことがあります...。",
      "title": "旧ソ連のお年寄りが「ソ連時代はよかった」と言うのはなぜでしょうか。どのような点で、誰にとって、客観的に「良かった」のでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想，前苏联国家变成了欧盟成员国，一般不在此列，因为它们的生活水平已经达到了足够的水平。\n因为他们的生活水平在苏联解体后已经达到了足够的水平。\n但作为一个有许多来自俄罗斯、乌克兰、哈萨克斯坦等国家的朋友和熟人的人来说\n但作为一个有很多来自俄罗斯、乌克兰、哈萨克斯坦等国家的朋友和熟人的人，我听到了这样的表达......",
      "title": "为什么经常听到前苏联国家的老年人宣称 \"苏联时期的情况更好\"？在苏联时期，事情在哪些方面，以及对谁来说，客观上 \"更好\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想，前蘇聯國家變成了歐盟成員國，一般不在此列，因爲它們的生活水平已經達到了足夠的水平。\n因爲他們的生活水平在蘇聯解體後已經達到了足夠的水平。\n但作爲一個有許多來自俄羅斯、烏克蘭、哈薩克斯坦等國家的朋友和熟人的人來說\n但作爲一個有很多來自俄羅斯、烏克蘭、哈薩克斯坦等國家的朋友和熟人的人，我聽到了這樣的表達......",
      "title": "爲什麼經常聽到前蘇聯國家的老年人宣稱 \"蘇聯時期的情況更好\"？在蘇聯時期，事情在哪些方面，以及對誰來說，客觀上 \"更好\"？"
    }
  ]
}