{
  "author": "Davanne89",
  "original_created_utc": 1632448922,
  "title": "Why do we tend to censor sex/nudity more strictly than violence?",
  "created_utc": 1632460395,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was watching the TV show &quot;Supernatural&quot; the other day and saw an episode with a beheading. I noticed that the age rating for this particular show is TV-14.</p>\n\n<p>So this made me wonder, why is something like this, with decapitation and somewhat clear acts of violence only rated TV-14, but something like &quot;Californication&quot; which has nudity and sexual themes rated TV-MA?</p>\n\n<p>Is it that we see a need to protect our kids from exposure to sex more than violence?</p>\n\n<p>Edit:</p>\n\n<p>I&#39;m not American. I&#39;m a Jamaican living in Jamaica where sex and nudity is not as strictly censored/frowned upon. </p>\n\n<p>American culture is however, very popular here and we&#39;re exposed to a lot of American programs. This is what lead to my question.</p>\n</div><!-- SC_ON -->",
  "score": 806,
  "permalink": "/r/TooAfraidToAsk/comments/pu9z4y/why_do_we_tend_to_censor_sexnudity_more_strictly/",
  "subreddit": "TooAfraidToAsk",
  "id": "pu9z4y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was watching the TV show \"Supernatural\" the other day and saw an episode with\na beheading. I noticed that the age rating for this particular show is TV-14.\n\nSo this made me wonder, why is something like this, with decapitation and\nsomewhat clear acts of violence only rated TV-14, but something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、テレビ番組「スーパーナチュラル」を見ていたら、斬首のエピソードがありました。\n斬首されたエピソードを見ました。この番組の年齢区分はTV-14です。\n\nこれを見て不思議に思ったのですが、なぜこのような、首を切り落とすような、ある程度明確な暴力行為を伴うものが\n暴力行為がはっきりしているのに、なぜTV-14になっているのでしょうか？",
      "title": "なぜ、暴力よりもセックスやヌードを厳しく検閲する傾向があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天我在看电视节目 \"超自然\"，看到一集有一个\n一个斩首的情节。我注意到这个特定节目的年龄分级是TV-14。\n\n因此，这让我很好奇，为什么像这样有斩首和一些明显的暴力行为的节目只被定为电视级别？\n某种程度上明确的暴力行为只被评为TV-14级，但一些...",
      "title": "为什么我们对性/裸体的审查往往比对暴力更严格？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天我在看電視節目 \"超自然\"，看到一集有一個\n一個斬首的情節。我注意到這個特定節目的年齡分級是TV-14。\n\n因此，這讓我很好奇，爲什麼像這樣有斬首和一些明顯的暴力行爲的節目只被定爲電視級別？\n某種程度上明確的暴力行爲只被評爲TV-14級，但一些...",
      "title": "爲什麼我們對性/裸體的審查往往比對暴力更嚴格？"
    }
  ]
}