{
  "author": "orlong_",
  "the_new_excerpt": "Elon’s company called X.com was an online bank, which merged with Thiel's\nConfinity in 2000. He was named CEO of PayPal shortly after.\n\nWhen we say Elon please stop tweeting about crypto or pumping dogecoin, please\nunderstand he fully knows what he is doing. He knows more about money and\ncurrency…",
  "original_created_utc": 1619316433,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーロンのX.comという会社はオンラインバンクで、2000年にティールのConfinityと合併しました。\n2000年にコンフィニティと合併しました。その後、すぐにPayPalのCEOに就任しました。\n\nElonが暗号についてツイートしたり、dogecoinを持ち上げたりするのをやめてください、と言っても\n彼は自分のしていることを十分に理解しています。彼はお金と通貨についてもっと知っています。\n通貨のことをよく知っています...",
      "title": "イーロン・マスクをバカだと見下してはいけない。彼はPayPalの共同設立者であり、私たちの誰よりもお金や通貨についてよく知っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "埃隆的公司叫X.com，是一家网上银行，2000年与泰尔的\nConfinity在2000年合并。不久之后，他被任命为PayPal的CEO。\n\n当我们说埃隆请停止在推特上发表关于加密货币或抽水的文章时，请理解他完全知道自己在做什么。\n请理解他完全知道自己在做什么。他更了解金钱和\n货币...",
      "title": "不要把埃隆-马斯克当作傻瓜来看待。他是PayPal的创始人之一，对金钱和货币的了解比我们大多数人都要多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "埃隆的公司叫X.com，是一家網上銀行，2000年與泰爾的\nConfinity在2000年合併。不久之後，他被任命爲PayPal的CEO。\n\n當我們說埃隆請停止在推特上發表關於加密貨幣或抽水的文章時，請理解他完全知道自己在做什麼。\n請理解他完全知道自己在做什麼。他更瞭解金錢和\n貨幣...",
      "title": "不要把埃隆-馬斯克當作傻瓜來看待。他是PayPal的創始人之一，對金錢和貨幣的瞭解比我們大多數人都要多。"
    }
  ],
  "title": "Don’t dismiss Elon Musk as stupid. He cofounded PayPal and knows more about money and currency than most of us.",
  "created_utc": 1619333325,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Elon’s company called X.com was an online bank, which merged with Thiel&#39;s Confinity in 2000. He was named CEO of PayPal shortly after.</p>\n\n<p>When we say Elon please stop tweeting about crypto or pumping dogecoin, please understand he fully knows what he is doing. He knows more about money and currency than any of us. He was at one point the worlds richest inhabitant.</p>\n\n<p>He’s raising awareness for crypto. Better than bashing and calling crypto rat poison like Warren Buffett and Bill Gates have. So my point is, let’s have some respect for someone that has founded multiple successful companies who also has a good idea of what money and currency should be like.</p>\n</div><!-- SC_ON -->",
  "score": 438,
  "permalink": "/r/CryptoCurrency/comments/mxyihb/dont_dismiss_elon_musk_as_stupid_he_cofounded/",
  "subreddit": "CryptoCurrency",
  "id": "mxyihb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208826
}