{
  "author": "electricp0ww0w",
  "the_new_excerpt": "I was watching some Bloomberg at 5am because I couldnt sleep and noticed that\nOil really took off this last day or so, probably in line with the S&P.\n\nAnyway, I got looking at pretty much most of the big oil companies, BP, Shell\netc and they are all hovering around 50% of where they were 12 months…",
  "original_created_utc": 1613226797,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在凌晨5点看了一些彭博社，因为我无法入睡，并注意到。\n石油这几天真的起飞了，可能和标普一致。\n\n总之，我看了一下几乎大部分的大石油公司，BP，壳牌\n等，它们都在12个月前的50%左右徘徊... ...",
      "title": "让我们来谈谈(非常)长的石油剧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在凌晨5點看了一些彭博社，因爲我無法入睡，並注意到。\n石油這幾天真的起飛了，可能和標普一致。\n\n總之，我看了一下幾乎大部分的大石油公司，BP，殼牌\n等，它們都在12個月前的50%左右徘徊... ...",
      "title": "讓我們來談談(非常)長的石油劇。"
    }
  ],
  "title": "Let's talk about (very) long Oil plays.",
  "created_utc": 1613242254,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was watching some Bloomberg at 5am because I couldnt sleep and noticed that Oil really took off this last day or so, probably in line with the S&amp;P.</p>\n\n<p>Anyway, I got looking at pretty much most of the big oil companies, BP, Shell etc and they are all hovering around 50% of where they were 12 months ago. My understanding is that this is down to the pandemic.</p>\n\n<p>Other small oil companies are down about 20-40% of where they were 12 months ago. </p>\n\n<p>OPEC are meeting next month and are likely to maintain production output at its current level, according to the Iraqi Oil Minister a few days ago, possibly into April before they reassess it.</p>\n\n<p>I&#39;m just looking at Oil as a very long term play... </p>\n\n<p>Surely in 12-18 (maybe 24) months time, you&#39;d expect at least a 20 or 30% recovery when the Pandemic starts to subside.</p>\n\n<p>I appreciate all the sentiment about Green Energy at the moment, but we need to accept that we&#39;re not all going to be driving Tesla and Nio vehicles anytime before 2025. Its another 9 years (minimum) before petrol cars are banned in most Euro countries. </p>\n\n<p>Airlines, cruise ships, big industry... It&#39;s all going to pick up one day and they all need the black gold to function. I see demand increasing, dollar per barrel increasing, thus stonks go up.</p>\n\n<p>is there any reason I shouldnt be investing very long in oil? And are there any oil tickers anyone could recommend aside from the obvious bp, shell, chevron, exxon etc.</p>\n</div><!-- SC_ON -->",
  "score": 84,
  "permalink": "/r/stocks/comments/lj1kth/lets_talk_about_very_long_oil_plays/",
  "subreddit": "stocks",
  "id": "lj1kth",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623040
}