{
  "author": "ECatPlay",
  "original_created_utc": 1642131430,
  "title": "Why can I see the wheel spokes on a car as it goes by if I'm not looking directly at it, but if I try to follow the wheels with my eyest hey are all blurred together ? Does the the brain only sample vision outside the center periodically so I get a strobe type affect?",
  "created_utc": 1642135745,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Waiting at a stoplight and seeing the cars go by, if I just look at the intersection I can tell that the wheels of cars going by have spokes.  But if I look at a car&amp;#39;s wheels themselves and follow them as they go by, the spokes are just a blur.  Does the the brain only sample vision outside the center periodically, so I get a strobe type affect?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/askscience/comments/s3i7wt/why_can_i_see_the_wheel_spokes_on_a_car_as_it/",
  "subreddit": "askscience",
  "id": "s3i7wt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Waiting at a stoplight and seeing the cars go by, if I just look at the\nintersection I can tell that the wheels of cars going by have spokes. But if I\nlook at a car's wheels themselves and follow them as they go by, the spokes are\njust a blur. Does the the brain only sample vision outside the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "信号待ちをしているときに、通り過ぎる車を見ていると、ただ見ているだけでは\n交差点を通る車の車輪には、スポークがあることがわかるんです。しかし、もし私が\n車の車輪そのものを見て、通り過ぎるのを追うと、スポークが\nがぼんやりと見えるだけです。脳は外側の視覚だけをサンプリングしているのだろうか？",
      "title": "車の車輪のスポークは直視しなければ見えるのに、車輪を目で追おうとすると全部ぼやけてしまうのはなぜでしょうか？脳が定期的に中心以外の視界をサンプリングしているから、ストロボのような効果が得られるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在红绿灯前等待，看到汽车驶过，如果我只是看着路口\n如果我只看十字路口，我可以知道经过的汽车的车轮有辐条。但如果我\n如果我看着汽车的轮子本身，并在它们经过时跟踪它们，辐条只是一个模糊的概念。\n只是一个模糊的概念。大脑是否只取样视觉以外的东西？",
      "title": "为什么我可以看到汽车经过时的轮辐，如果我不直视它，但如果我试图用我的眼睛跟踪车轮，它们都是模糊的？大脑是否只周期性地对中心以外的视觉进行采样，所以我得到了一种频闪式的影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在紅綠燈前等待，看到汽車駛過，如果我只是看着路口\n如果我只看十字路口，我可以知道經過的汽車的車輪有輻條。但如果我\n如果我看着汽車的輪子本身，並在它們經過時跟蹤它們，輻條只是一個模糊的概念。\n只是一個模糊的概念。大腦是否只取樣視覺以外的東西？",
      "title": "爲什麼我可以看到汽車經過時的輪輻，如果我不直視它，但如果我試圖用我的眼睛跟蹤車輪，它們都是模糊的？大腦是否只週期性地對中心以外的視覺進行採樣，所以我得到了一種頻閃式的影響？"
    }
  ]
}