{
  "author": "Username_Pending101",
  "original_created_utc": 1646171443,
  "title": "I just went in for a job interview and got hired on the spot... but I just realized I went to the wrong restaurant. What should I do?",
  "created_utc": 1646179379,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was called in for an interview over the phone. I went to the restaunt I thought I was supposed to be at. Told them I was there for my interview and got hired on the spot. Realized after the interview that it wasn&amp;#39;t even the location I applied to. &lt;/p&gt;\n\n&lt;p&gt;Should I pretend it never happened and try to go into work as normal? Or should I risk admitting my mistake and potentially losing the job due to negligence?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 142,
  "permalink": "/r/NoStupidQuestions/comments/t4jdhg/i_just_went_in_for_a_job_interview_and_got_hired/",
  "subreddit": "NoStupidQuestions",
  "id": "t4jdhg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was called in for an interview over the phone. I went to the restaunt I\nthought I was supposed to be at. Told them I was there for my interview and got\nhired on the spot. Realized after the interview that it wasn't even the location\nI applied to.\n\nShould I pretend it never happened and try to go…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "電話で面接に呼ばれました。その時、私が行ったレストランは\n自分がいるべき場所だと思っていた。面接に来たことを伝えると、無事合格しました。\nその場で採用されました。面接の後、その場所でないことに気がつきました。\n応募したのは私です。\n\nなかったことにして、行ってみるべきでしょうか...。",
      "title": "面接に行って、その場で採用されたのですが...お店を間違えたことに今気づきました。どうしたらいいんでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我被叫去参加电话面试。我去了我认为应该去的餐馆\n我以为我应该在那里。我告诉他们我是去参加面试的，并当场被录用。\n当场就被录用了。面试结束后，我意识到它甚至不是我申请的那个地方。\n我申请的地点。\n\n我是否应该假装它从未发生过，并尝试去...",
      "title": "我刚刚去面试，当场就被录用了......但我刚刚意识到我去错了餐厅。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我被叫去參加電話面試。我去了我認爲應該去的餐館\n我以爲我應該在那裏。我告訴他們我是去參加面試的，並當場被錄用。\n當場就被錄用了。面試結束後，我意識到它甚至不是我申請的那個地方。\n我申請的地點。\n\n我是否應該假裝它從未發生過，並嘗試去...",
      "title": "我剛剛去面試，當場就被錄用了......但我剛剛意識到我去錯了餐廳。我應該怎麼做？"
    }
  ]
}