{
  "author": "breakboyzz",
  "original_created_utc": 1647947627,
  "title": "When there are no suckers left to buy your NFT for more than you bought it for, you are the ultimate sucker.",
  "created_utc": 1647981035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The NFT game is not a game you want to play. It is easy to mint MILLIONS of these apes with cigars, money etc…&lt;/p&gt;\n\n&lt;p&gt;If I minted 1,000,000 of them then sold them all for a dollar… I win.&lt;/p&gt;\n\n&lt;p&gt;If you bought it for a dollar, and no one else is willing to buy it from you for more than that, you lose. It’s gambling, but you’re going to lose because you are not smarter than the fox. The reason why you hear celebrities buying expensive NFTS, is because that is called “marketing” and they were probably paid to say they bought it for $$$$$$ and were given a free NFT.&lt;/p&gt;\n\n&lt;p&gt;Don’t fall for this crap. There are more shit apes out there than ever. This is how you lose money. If you do happen to have a sucker on the line SELL IT. No one ever lost taking profits.&lt;/p&gt;\n\n&lt;p&gt;This is not financial advice, only opinion.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 405,
  "permalink": "/r/CryptoCurrency/comments/tk0kvk/when_there_are_no_suckers_left_to_buy_your_nft/",
  "subreddit": "CryptoCurrency",
  "id": "tk0kvk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The NFT game is not a game you want to play. It is easy to mint MILLIONS of\nthese apes with cigars, money etc…\n\nIf I minted 1,000,000 of them then sold them all for a dollar… I win.\n\nIf you bought it for a dollar, and no one else is willing to buy it from you for\nmore than that, you lose. It’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NFTのゲームは、あなたがやりたいゲームではありません。簡単に何百万人もを鋳造することができます。\nこれらの猿は葉巻やお金などで...\n\n100万個鋳造して、それを全部1ドルで売ったら...私の勝ちです。\n\nもし、あなたが1ドルで買ったものを、誰もあなたから買おうとしなければ\nそれ以上だと負けです。それは...",
      "title": "NFTを買った以上の値段で買ってくれるカモがいなくなったら、究極のカモです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "NFT游戏不是一个你想玩的游戏。很容易用雪茄、钱等物品给这些猿人制造数百万个硬币。\n用雪茄、钱等来铸造这些猿人是很容易的。\n\n如果我铸造了1,000,000个，然后以1美元的价格全部卖掉......我就赢了。\n\n如果你以一美元的价格买了它，而没有人愿意以超过这个价格向你购买它，你就输了。\n而没有人愿意以更高的价格向你购买，你就输了。这就是...",
      "title": "当没有吸血者以比你买的价格更高的价格购买你的NFT时，你就是最终的吸血者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "NFT遊戲不是一個你想玩的遊戲。很容易用雪茄、錢等物品給這些猿人制造數百萬個硬幣。\n用雪茄、錢等來鑄造這些猿人是很容易的。\n\n如果我鑄造了1,000,000個，然後以1美元的價格全部賣掉......我就贏了。\n\n如果你以一美元的價格買了它，而沒有人願意以超過這個價格向你購買它，你就輸了。\n而沒有人願意以更高的價格向你購買，你就輸了。這就是...",
      "title": "當沒有吸血者以比你買的價格更高的價格購買你的NFT時，你就是最終的吸血者。"
    }
  ]
}