{
  "author": "LookAtMeImAName",
  "the_new_excerpt": "I hear it all the time - That first-time day traders are most likely going to\nlose money. Getting good at trading takes tons of research, practice and\nmistakes to learn. BUT, what if, you did the exact opposite of what you think\nyou should do?\n\nSay you think a company will do well, so you think you…",
  "original_created_utc": 1614701086,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直都在听，第一次做日间交易的人很有可能会被骗。\n赔钱。做好交易需要大量的研究、实践和经验。\n的错误来学习。但是，如果，你做了与你所想的完全相反的事情呢？\n你应该做什么？\n\n说你认为一家公司会做得很好，所以你认为你... ...",
      "title": "严肃的问题。如果99%的首次日交易者都失败了 为什么人们不做他们认为应该做的事情呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直都在聽，第一次做日間交易的人很有可能會被騙。\n賠錢。做好交易需要大量的研究、實踐和經驗。\n的錯誤來學習。但是，如果，你做了與你所想的完全相反的事情呢？\n你應該做什麼？\n\n說你認爲一家公司會做得很好，所以你認爲你... ...",
      "title": "嚴肅的問題。如果99%的首次日交易者都失敗了 爲什麼人們不做他們認爲應該做的事情呢？"
    }
  ],
  "title": "Serious Question: If 99% of first-time day traders fail, why don't people do the exact opposite of what they think they should do?",
  "created_utc": 1614709713,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hear it all the time - That first-time day traders are most likely going to lose money. Getting good at trading takes tons of research, practice and mistakes to learn. BUT, what if, you did the exact opposite of what you think you should do?</p>\n\n<p>Say you think a company will do well, so you think you should buy shares thinking you&#39;ll make money. However, instead of buying shares, with the knowledge that most first-time traders will end up losing money, what if you shorted the stock instead? Then, theoretically, the odds flip, and you have a 99% chance of making money.</p>\n\n<p>What am I missing, because obviously I am missing something, otherwise more people would have tried this already.</p>\n\n<p>Please explain to me how dumb I am and follow it up with why this would never work (I&#39;m a new trader trying to learn).</p>\n</div><!-- SC_ON -->",
  "score": 6194,
  "permalink": "/r/stocks/comments/lw5fn3/serious_question_if_99_of_firsttime_day_traders/",
  "subreddit": "stocks",
  "id": "lw5fn3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744906
}