{
  "author": "Specialist_Ebb5555",
  "original_created_utc": 1634548827,
  "title": "SucceedSmart - Connecting corporations with the world’s best executive talent",
  "created_utc": 1634619221,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.facebook.com/SucceedSmartUS/\">SucceedSmart</a> revolutionizes the traditional executive search industry, restoring control of the process back to corporations and executives. With AI-powered solutions, including rich algorithms and proprietary matchmaking processes, SucceedSmart is poised to change the way impactful and influential corporations and executives maneuver to the forefront of their respective fields. Corporations benefit from direct access to pre-screened and diverse executive candidates, speed-to-hire, affordability, transparency, and predictability. Executives benefit from a free, lifelong career platform and peer network, built with a community of vetted leaders.</p>\n\n<p><a href=\"https://succeedsmart.com/\">SucceedSmart</a> represents an “invite-only” executive talent network that’s dedicated to confidentially connecting members with their next growth opportunity. Members benefit from direct access to corporations and a robust peer-to-peer network that creates a diverse and inclusive community of like-minded executives. Members choose which companies and peers to connect with, providing the ultimate “control” over their profile. Additionally, SucceedSmart delivers a success bonus after an executive accepts a role through the platform.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qaj2r8/succeedsmart_connecting_corporations_with_the/",
  "subreddit": "SideProject",
  "id": "qaj2r8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "SucceedSmart [https://www.facebook.com/SucceedSmartUS/] revolutionizes the\ntraditional executive search industry, restoring control of the process back to\ncorporations and executives. With AI-powered solutions, including rich\nalgorithms and proprietary matchmaking processes, SucceedSmart is poised…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SucceedSmart [https://www.facebook.com/SucceedSmartUS/] は、従来のエグゼクティブサーチ業界に革命を起こします。\n従来のエグゼクティブ・サーチ業界に革命を起こし、プロセスのコントロールを企業に戻します。\n企業と経営者の間に取り戻すことができます。豊かなアルゴリズムと独自のマッチメイキングプロセスを含む、AIを搭載したソリューションにより\n豊かなアルゴリズムと独自のマッチメイキングプロセスを含むAIを活用したソリューションにより、SucceedSmartは...",
      "title": "SucceedSmart - 企業と世界の優秀なエグゼクティブ人材をつなぐ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "SucceedSmart [https://www.facebook.com/SucceedSmartUS/] 彻底改变了\n彻底改变了传统的猎头行业，将过程的控制权交还给企业和高管。\n企业和高管。以人工智能为动力的解决方案，包括丰富的\n算法和专有的匹配过程，SucceedSmart已经准备好...",
      "title": "SucceedSmart - 将企业与世界上最好的高管人才联系起来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "SucceedSmart [https://www.facebook.com/SucceedSmartUS/] 徹底改變了\n徹底改變了傳統的獵頭行業，將過程的控制權交還給企業和高管。\n企業和高管。以人工智能爲動力的解決方案，包括豐富的\n算法和專有的匹配過程，SucceedSmart已經準備好...",
      "title": "SucceedSmart - 將企業與世界上最好的高管人才聯繫起來"
    }
  ]
}