{
  "author": "Killertimme",
  "the_new_excerpt": "For the past 3 months I have been pretty much doing nothing else but crypto.\nDuring this time I have been constantly looking for new ways to save fiat which\nI then can add to my crypto portfolio. In comparison to the rest of this sub I\ndont have any bad habits such as smoking or drinking.\n\nSo I…",
  "original_created_utc": 1617866795,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この3ヶ月間、私はほとんど暗号化以外のことをしていませんでした。\nこの間、私はフィアットを節約するための新しい方法を常に探していました。\n自分の暗号ポートフォリオに追加することができます。このサブの残りの部分と比較して、私は\n喫煙や飲酒などの悪い習慣はありません。\n\nだから...",
      "title": "暗号のおかげで食べるのをやめました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的3个月里，除了加密货币，我几乎没有做其他的事情。\n在这段时间里，我一直在不断地寻找新的方法来保存法币，其中包括\n我就可以将其添加到我的加密投资组合中。与其他的子相比，我\n不要有任何不良的习惯，如吸烟或喝酒。\n\n所以我...",
      "title": "多亏了加密技术，我已经不吃东西了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的3個月裏，除了加密貨幣，我幾乎沒有做其他的事情。\n在這段時間裏，我一直在不斷地尋找新的方法來保存法幣，其中包括\n我就可以將其添加到我的加密投資組合中。與其他的子相比，我\n不要有任何不良的習慣，如吸菸或喝酒。\n\n所以我...",
      "title": "多虧了加密技術，我已經不喫東西了"
    }
  ],
  "title": "Thanks to crypto I have stopped eating",
  "created_utc": 1617881999,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the past 3 months I have been pretty much doing nothing else but crypto. During this time I have been constantly looking for new ways to save fiat which I then can add to my crypto portfolio. In comparison to the rest of this sub I dont have any bad habits such as smoking or drinking.</p>\n\n<p>So I thought to myself what do I spend the most money on per month? Rent and food. Just stopping to eat would save me 300$ per month and save a lot of time which can be spent looking at charts. During my research I came across breatharianism. Living by only consuming sunlight. I started right away. Now I save a lot of money which I put right into crypto. I lost 40kg, only have energy left for sitting in my chair and watching the charts. I will be doing this for the rest of my albeit short life.</p>\n\n<p>Next step is to move to the south where the sun shines all day and to live in a field with 5G to save rent. </p>\n\n<p>If you have any questions I will try to answer them.</p>\n\n<p>This is not financial advise</p>\n</div><!-- SC_ON -->",
  "score": 4047,
  "permalink": "/r/CryptoCurrency/comments/mmmgui/thanks_to_crypto_i_have_stopped_eating/",
  "subreddit": "CryptoCurrency",
  "id": "mmmgui",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566612878
}