{
  "author": "phan_ngt",
  "original_created_utc": 1629561276,
  "title": "Good day for Crypto - Marvel comics on Tezos NFTs - World Class",
  "created_utc": 1629594724,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The launch of the highly anticipated NFT Trading Card Game “Emergents” will be preceded by a comic book series that introduces characters from the game. After the first comic book was released a few weeks ago, the second volume of the Emergents comic book series has been released.</p>\n\n<p>Both the storyline and drawings in the series are world-class and created by a team of artists and writers that have built a great reputation creating comics for Marvel. They previously have created both art and stories for Marvel comic books like X-Men, Iron Man, The Hulk, Spiderman, Crimson Dynamo, Spider Woman, Darkstar, Ultraverse, and much more. </p>\n\n<p>(See for reference marvel.fandom.com/wiki/Marvel_Database the writers and artists that have contributed to the first two editions of the series: Steve Ellis, Will Pfeifer, John Rozum, Christy Marx, Sholly Fisch, Cliff Richards, Freddie E Williams II, Scott Kolins, Cover Artist, and Julian Lopez)</p>\n\n<p>Three comic book series\nThere will be three comic book series launched that will form the Emergents Universe comic book line: “The Nine”, ” Emergents Presents” and a stand-alone version that will follow the character “ZoeMG”.</p>\n\n<p>The comics will be free-to-read on the InterPopComics.com platform, but in the first week, after they are released, they can only be read if you buy the NFT version, which is priced under $10 USD. Buying the NFT version of the comic will allow you to read the comic right away. </p>\n\n<p>Certain decisions in the future storyline or artwork of the comics will be in the hands of the fans through a governance system. Owning an NFT of the comic will allow you to participate in a vote specific to that issue of the comic. </p>\n\n<p>Wednesday, August 25th will mark the date of the beginning of the release of the first free-to-read content. One of the three stories each week. There will also be offerings of Limited Edition variant cover versions of the comic for sale with covers tied to the story that is being featured that week.</p>\n\n<p><a href=\"https://images.app.goo.gl/XN7pze2YHcxjpSFS7\">Thumbnail </a></p>\n</div><!-- SC_ON -->",
  "score": 159,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/xTTkLbimUOzlRC9EZHbXrV8UiFbch2ZpmoS90gjFkP8.jpg?auto=webp&s=1379a6a5d9de2a980c1a63604c1e4190298380d6",
          "width": 616,
          "height": 353
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/xTTkLbimUOzlRC9EZHbXrV8UiFbch2ZpmoS90gjFkP8.jpg?width=108&crop=smart&auto=webp&s=af330cfa60ad602cd0848a8f8ff966a935445d52",
            "width": 108,
            "height": 61
          },
          {
            "url": "https://external-preview.redd.it/xTTkLbimUOzlRC9EZHbXrV8UiFbch2ZpmoS90gjFkP8.jpg?width=216&crop=smart&auto=webp&s=96645696018893b1d8ba86631cb40a23b1f27789",
            "width": 216,
            "height": 123
          },
          {
            "url": "https://external-preview.redd.it/xTTkLbimUOzlRC9EZHbXrV8UiFbch2ZpmoS90gjFkP8.jpg?width=320&crop=smart&auto=webp&s=8d8b26f77eb9fb96fa33ed51bab38f2bfa77dc4b",
            "width": 320,
            "height": 183
          }
        ],
        "variants": {},
        "id": "E-UvwkqsBOd6ypa3OGtSVLeHvWNn-JG3N5JeEhtMOjo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p8tvvb/good_day_for_crypto_marvel_comics_on_tezos_nfts/",
  "subreddit": "CryptoCurrency",
  "id": "p8tvvb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The launch of the highly anticipated NFT Trading Card Game “Emergents” will be\npreceded by a comic book series that introduces characters from the game. After\nthe first comic book was released a few weeks ago, the second volume of the\nEmergents comic book series has been released.\n\nBoth the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "待望のNFTトレーディングカードゲーム「Emergents」の発売に先駆けて\nそれに先立ち、ゲームに登場するキャラクターを紹介するコミックシリーズが発売されます。を発売しました。\nコミックブックの第1巻が発売された後、第2巻が発売されました。\nコミックブックシリーズの第2巻が発売されました。\n\nどちらも...",
      "title": "Good day for Crypto - Marvel comics on Tezos NFTs - World Class"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "备受期待的NFT交易卡游戏 \"Emergents \"的推出将由一个漫画系列来介绍。\n在推出之前，会有一个介绍游戏中人物的漫画系列。在\n第一本漫画书在几周前发布后，第二卷的\nEmergents系列漫画书已经发布。\n\n这两本...",
      "title": "Crypto的好日子--Tezos NFTs上的Marvel漫画--世界级的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "備受期待的NFT交易卡遊戲 \"Emergents \"的推出將由一個漫畫系列來介紹。\n在推出之前，會有一個介紹遊戲中人物的漫畫系列。在\n第一本漫畫書在幾周前發佈後，第二卷的\nEmergents系列漫畫書已經發布。\n\n這兩本...",
      "title": "Crypto的好日子--Tezos NFTs上的Marvel漫畫--世界級的"
    }
  ]
}