{
  "author": "instaxboi",
  "the_new_excerpt": "I'm 24 years old and will begin dental school in a few months, which means I'll\nhave ~$400,000 in debt after I graduate (US private school, fml). As a way to\nhopefully reduce my upcoming financial burden, I've been learning more about\nfinance and investing and retirement accounts.\n\nI currently have…",
  "original_created_utc": 1613873412,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我今年24岁，再过几个月就要开始上牙科学校了，这意味着我将...\n我毕业后有约40万的债务（美国私立学校，fml）。作为一种方式来\n希望能减轻我即将到来的经济负担，我一直在学习更多的知识。\n理财和投资以及退休账户。\n\n我目前有...",
      "title": ""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年24歲，再過幾個月就要開始上牙科學校了，這意味着我將...\n我畢業後有約40萬的債務（美國私立學校，fml）。作爲一種方式來\n希望能減輕我即將到來的經濟負擔，我一直在學習更多的知識。\n理財和投資以及退休賬戶。\n\n我目前有...",
      "title": ""
    }
  ],
  "title": "Getting started with ETFs - how would you allocate $2000 using the following list?",
  "created_utc": 1613888620,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 24 years old and will begin dental school in a few months, which means I&#39;ll have ~$400,000 in debt after I graduate (US private school, fml). As a way to hopefully reduce my upcoming financial burden, I&#39;ve been learning more about finance and investing and retirement accounts. </p>\n\n<p>I currently have about $2000 in a Roth IRA through Fidelity and want to put that money into some good ETFs. Ideally I&#39;d like to maximize my returns via a mix of high and low risk investments, but based on my understanding, it&#39;s more beneficial for me to go for high risk because I have several decades until retirement. Please correct me if I&#39;m wrong. </p>\n\n<p>I&#39;ve selected 14 ETFs that have interested me and now need help deciding which to actually invest in. I understand 14 investments would lower my risk, which is why I want to simplify my portfolio to maybe 5 or more ETFs. </p>\n\n<p>Thank you in advance! </p>\n\n<p>List of ETFs: <a href=\"https://imgur.com/a/OwwaCvB\">https://imgur.com/a/OwwaCvB</a></p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/stocks/comments/loml90/getting_started_with_etfs_how_would_you_allocate/",
  "subreddit": "stocks",
  "id": "loml90",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885068
}