{
  "author": "cazlan",
  "original_created_utc": 1653141065,
  "title": "Why did we stop inoculating against smallpox?",
  "created_utc": 1653157142,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand the amazing human achievement that the disease was eradicated. That said, we have an effective method against keeping people from getting sick from any possible accidental or other recurrence of the disease, so why don’t we continue using it widely just in case? I’ve also seen that it is/was effective in suppressing other “pox” diseases (eg, monkeypox), which seems like a big benefit.&lt;/p&gt;\n\n&lt;p&gt;So why did we just…stop? Were there major costs and/or side effects that made it not worth it? Or is it kinda just a big victory lap that we might regret?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/uunjjn/why_did_we_stop_inoculating_against_smallpox/",
  "subreddit": "askscience",
  "id": "uunjjn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand the amazing human achievement that the disease was eradicated. That\nsaid, we have an effective method against keeping people from getting sick from\nany possible accidental or other recurrence of the disease, so why don’t we\ncontinue using it widely just in case? I’ve also seen that it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "病気が根絶されたという人類の快挙は理解できる。しかし\nしかし、私たちは、偶発的または他の方法で病気を再発させないようにするための効果的な方法を知っています。\n偶発的な再発を防ぐ有効な方法があるのだから、万が一に備えて広く使い続けてはどうだろうか。\n念のため、広く使い続けてはどうか？というのも見たことがあるのですが...。",
      "title": "なぜ、天然痘の予防接種をやめたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解这一疾病被根除的惊人的人类成就。这一点\n尽管如此，我们有一个有效的方法来防止人们因任何姿势而生病。\n任何可能的意外或其他疾病的复发，所以我们为什么不\n继续广泛使用，以防万一？我还看到，它...",
      "title": "我们为什么停止接种天花疫苗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解這一疾病被根除的驚人的人類成就。這一點\n儘管如此，我們有一個有效的方法來防止人們因任何姿勢而生病。\n任何可能的意外或其他疾病的復發，所以我們爲什麼不\n繼續廣泛使用，以防萬一？我還看到，它...",
      "title": "我們爲什麼停止接種天花疫苗？"
    }
  ]
}