{
  "author": "theepicone111",
  "the_new_excerpt": "I’m young (19). I have no debt to pay for at least 4 years. After that I will\nlikely have a decent paid job and I will be stuck in the eat, sleep, work, pay\ntax, pay debt cycle. I’ve saved up 10k. At the moment I’ve put 2k in apple, 1k\nin index etfs, 1.5k in ARK, 1k in NIO. 0.5k in PLTR. I plan to…",
  "original_created_utc": 1613222528,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我还年轻（19岁）。我至少在4年内没有债务需要偿还。之后，我将\n可能会有一个体面的收入工作，我将停留在吃，睡，工作，支付。\n税，还债循环。我已经攒了1万块钱。目前我已经把两千块钱放在苹果，一千块钱。\n在指数ETF，1.5千在ARK，1千在NIO。0. 5k在PLTR。我打算...",
      "title": "积极的投资/交易"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我還年輕（19歲）。我至少在4年內沒有債務需要償還。之後，我將\n可能會有一個體面的收入工作，我將停留在喫，睡，工作，支付。\n稅，還債循環。我已經攢了1萬塊錢。目前我已經把兩千塊錢放在蘋果，一千塊錢。\n在指數ETF，1.5千在ARK，1千在NIO。0. 5k在PLTR。我打算...",
      "title": "積極的投資/交易"
    }
  ],
  "title": "Aggressive investing / trading",
  "created_utc": 1613284460,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m young (19). I have no debt to pay for at least 4 years. After that I will likely have a decent paid job and I will be stuck in the eat, sleep, work, pay tax, pay debt cycle. \nI’ve saved up 10k. At the moment I’ve put 2k in apple, 1k in index etfs, 1.5k in ARK, 1k in NIO. 0.5k in PLTR.  I plan to keep on investing any more money that comes in. That leaves me 4k (which I’m willing to risk for high returns)\nI’m looking to grow this as much as possible within 4 years to reduce my student debt. Now yes, I know time in the market beats timing the market. But the stock market has become a hobby of mine. I look forward to the market opening every day - whether it’s up or down. I’m always looking for opportunities. \nAs of now, the majority of my money is invested in relatively safe equities. With the rest I really want to 2/3x my money. Being in the UK, I can do spreads - massive potential for gains and losses. I was thinking of doing spreads but in a swing trade kind of time frame. I would go big, but only on a decent dip on a well structured, stable stock (keeping a safe margin of course). I have made my fair share of mistakes with spreads, ranging from taking oversized bets on meme stocks, to cutting my losses early on stable stocks only for them to rocket to all time highs instantly after. </p>\n\n<p>Im just a little unsure on deciding between spreads or swing trading by buying actual shares. Spreads allows me to choose my potential gains and losses based on my risk. I would only have to deposit a fraction of the actual underlying stock price. It’s also tax free (though that doesn’t affect me right now). \nWhat would the benefits of swing trades be compared to spreads? At the moment I don’t see any, other than the tiny amount in dividends I may get. With just 4k I wouldn’t be able to make many trades at all and the shares I buy would need to be growth stocks to make a decent return. </p>\n\n<p>Am I going about this the right way? Assuming my risk management is good, would spreads be the way to go?</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/lj0gkr/aggressive_investing_trading/",
  "subreddit": "stocks",
  "id": "lj0gkr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623039
}