{
  "author": "mbgornto",
  "original_created_utc": 1640642642,
  "title": "What is your honest opinion on pregnant women, especially those further along, wearing bikinis?",
  "created_utc": 1640670424,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Currently pregnant and heading to the beach next week at 7 months along; as I was packing today, I realized I pulled all two-piece bikinis (no coverage on stomach whatsoever I.e. “tankinis”) and was genuinely curious if it bothers some individuals seeing pregnant women wear them! It’s something I’ve never thought twice about having seen it before becoming pregnant myself, but some comments were made (not by my SO who says I shouldn’t worry about it) about the possibility it might make some people uncomfortable! I’m nervously curious to hear your honest but still civil opinions on it!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/rpymhw/what_is_your_honest_opinion_on_pregnant_women/",
  "subreddit": "TooAfraidToAsk",
  "id": "rpymhw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Currently pregnant and heading to the beach next week at 7 months along; as I\nwas packing today, I realized I pulled all two-piece bikinis (no coverage on\nstomach whatsoever I.e. “tankinis”) and was genuinely curious if it bothers some\nindividuals seeing pregnant women wear them! It’s something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在妊娠中で、来週7ヶ月でビーチに行く予定です。\n今日、荷造りをしていて、ツーピースのビキニを全部引っ張り出してきたことに気づきました。\nタンキニと呼ばれるお腹の部分が全くないものです。\n妊婦さんが着ているのを見るのは、個人差があります なんかね...。",
      "title": "妊婦さん、特に妊娠が進んでいる方がビキニを着ることについて、率直な感想はいかがでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在怀孕了，下周要去海滩，已经7个月了。\n今天在收拾行李时，我意识到我把所有的两件式比基尼（没有覆盖腹部的\n肚子上没有任何覆盖物，即 \"背心\"），我真的很好奇，如果有些人看到孕妇穿这些衣服会不会感到困扰？\n我真的很好奇，是否有些人看到孕妇穿这样的衣服会感到困扰？这是个问题...",
      "title": "你对孕妇，特别是那些怀孕时间较长的孕妇，穿比基尼有什么诚实的看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在懷孕了，下週要去海灘，已經7個月了。\n今天在收拾行李時，我意識到我把所有的兩件式比基尼（沒有覆蓋腹部的\n肚子上沒有任何覆蓋物，即 \"背心\"），我真的很好奇，如果有些人看到孕婦穿這些衣服會不會感到困擾？\n我真的很好奇，是否有些人看到孕婦穿這樣的衣服會感到困擾？這是個問題...",
      "title": "你對孕婦，特別是那些懷孕時間較長的孕婦，穿比基尼有什麼誠實的看法？"
    }
  ]
}