{
  "author": "Vaginosis-Psychosis",
  "original_created_utc": 1649027398,
  "title": "Idgaf... I'm leaving my coins on an exchange where it is insured... Too many scams out there that even crypto vets are falling for.",
  "created_utc": 1649036703,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last night several threads warned about Trezor phishing scam and almost on queue, today I read a post by 7 year crypto veteran that he fell for it and lost everything, about $72,000 in Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;It can happen to anyone. You&amp;#39;re tired, arguing with your gf, distracted, etc... nobody is perfect. He lost everything. I can&amp;#39;t afford that. Shit gives me nightmares.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been intending to buy a Trezor for some time now, but I keep hesitating. I&amp;#39;ve been so nervous about the whole thing. What if I lose my seed phrase? I live n NYC, someone breaks into my apartment, a fire, collapse, etc.. call me paranoid.&lt;/p&gt;\n\n&lt;p&gt;Now that Coinbase One offers insurance, I&amp;#39;m not even going to worry about cold storage. I sleep better this way. I don&amp;#39;t care about all the &amp;quot;not your keys not your coins&amp;quot; arguments. I have a legally enforceable contract with Coinbase now that I pay for.&lt;/p&gt;\n\n&lt;p&gt;True, it&amp;#39;s price is kinda steep at $30 a month, but to me it&amp;#39;s worth it. It comes with no trading fees which sweetens the pie. Also comes with &amp;quot;priority&amp;quot; customer support, which I tested and only had to wait 2 minutes before I was speaking to a live agent.&lt;/p&gt;\n\n&lt;p&gt;So yeah, fuck that. I&amp;#39;m just too paranoid. If US gov ever looks like it&amp;#39;s on the verge of collapse, then yeah, I might put it in cold storage before I bounce out of the country. Until them I rest easy with my coins insured on an exchange.&lt;/p&gt;\n\n&lt;p&gt;Let the hate begin...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 371,
  "permalink": "/r/CryptoCurrency/comments/tvmtda/idgaf_im_leaving_my_coins_on_an_exchange_where_it/",
  "subreddit": "CryptoCurrency",
  "id": "tvmtda",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Last night several threads warned about Trezor phishing scam and almost on\nqueue, today I read a post by 7 year crypto veteran that he fell for it and lost\neverything, about $72,000 in Bitcoin.\n\nIt can happen to anyone. You're tired, arguing with your gf, distracted, etc...\nnobody is perfect. He…"
}