{
  "author": "Peakh23",
  "the_new_excerpt": "Whether you think the bears are coming or you're convinced that the cycle peak\nhas yet to come...\n\nThose prices are a good entry point - PERIOD.\n\nIf you bought VeChain at 0.07$ yesterday, you just got yourself a stack 4 times\nas big as you would have gotten just a month ago.\n\nIf you bought ADA at…",
  "original_created_utc": 1621840647,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ベアが来ると思っている人も、サイクルのピークがまだ来ていないと確信している人も\n確信していても\n\nこの価格は良いエントリーポイントです。\n\n昨日、VeChainを0.07$で買った人は、4倍のスタックを手に入れたことになります。\n1ヶ月前の4倍のスタックを手に入れたことになります。\n\nもしあなたがADAを0.07$で買ったとしたら...",
      "title": "今、買うかどうか迷っている人のために"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "无论你是认为熊市即将到来，还是相信周期的峰值\n都是如此...\n\n这些价格是一个很好的切入点--根本上。\n\n如果你昨天以0.07美元的价格买入VeChain，你刚刚得到了一叠4倍于一个月前的\n是一个月前的四倍。\n\n如果你以0.07美元的价格买入ADA",
      "title": "如果你现在还没有决定是否购买的话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "無論你是認爲熊市即將到來，還是相信週期的峯值\n都是如此...\n\n這些價格是一個很好的切入點--根本上。\n\n如果你昨天以0.07美元的價格買入VeChain，你剛剛得到了一疊4倍於一個月前的\n是一個月前的四倍。\n\n如果你以0.07美元的價格買入ADA",
      "title": "如果你現在還沒有決定是否購買的話"
    }
  ],
  "title": "In case you're undecided about buying right now",
  "created_utc": 1621864579,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Whether you think the bears are coming or you&#39;re convinced that the cycle peak has yet to come...</p>\n\n<p>Those prices are a good entry point - PERIOD.</p>\n\n<p>If you bought VeChain at 0.07$ yesterday, you just got yourself a stack 4 times as big as you would have gotten just a month ago. </p>\n\n<p>If you bought ADA at 1.20$, you bought at a &gt;50% discount from last month&#39;s price when a lot of people were FOMOing in at 2.40$.</p>\n\n<p>ETH was off to the races, looking to smash through all the way to 5k and people were still looking to invest big money. Now you can get in at around 2k. </p>\n\n<p>NOTHING HAS CHANGED ABOUT THOSE PROJECTS </p>\n\n<p>If you are confident about a project surviving a bear market, you should be celebrating dips like these. </p>\n\n<p>It&#39;s not a matter of IF we&#39;re gonna reach those prices again it&#39;s a matter of WHEN. </p>\n\n<p>Don&#39;t shit your pants about further dips after you finally convinced yourself to buy. \nNow is a great entry point, even if we crash another 50%. </p>\n\n<p>Don&#39;t try to time the perfect bottom.</p>\n\n<p>Don&#39;t let unrealized losses bother you.</p>\n\n<p>Don&#39;t dump all your fiat into crypto.</p>\n\n<p>Invest in projects you believe in, zoom out and thank yourself in a couple years for being patient and seizing the opportunity.</p>\n\n<p>This right here is what &#39;Be greedy when everyone else is fearful&#39; means.</p>\n\n<p>Take care ❤</p>\n</div><!-- SC_ON -->",
  "score": 565,
  "permalink": "/r/CryptoCurrency/comments/njs16e/in_case_youre_undecided_about_buying_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "njs16e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385280
}