{
  "author": "redwinterberries",
  "original_created_utc": 1639864144,
  "title": "Did every person with red hair come from the same mutated person, or did the mutation happen multiple times?",
  "created_utc": 1639871616,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I first posted this in &lt;a href=\"/r/askhistorians\"&gt;r/askhistorians&lt;/a&gt; hoping for a sort of time line, but it was removed for being a science question. I am no expert but I&amp;#39;d appreciate any insight someone could give here! &lt;/p&gt;\n\n&lt;p&gt;I was reading that the people in England originate from the same group as the Celts. But the Celts have a higher percentage of red hair. But the red hair gene I thought originated 30 000 + years ago in Asia. So was it that one person in Asia who&amp;#39;s descendents ended up being Celts but somehow not English? Or did the mutation happen again independently of being passed down from them? &lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/askscience/comments/rjhgud/did_every_person_with_red_hair_come_from_the_same/",
  "subreddit": "askscience",
  "id": "rjhgud",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I first posted this in r/askhistorians [/r/askhistorians] hoping for a sort of\ntime line, but it was removed for being a science question. I am no expert but\nI'd appreciate any insight someone could give here!\n\nI was reading that the people in England originate from the same group as the\nCelts. But…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最初、r/askhistorians [/r/askhistorians]に、ある種のものを期待して、これを投稿しました。\n時系列で表示されるのですが、理系の質問ということで削除されました。私は専門家ではありませんが\nどなたか洞察力をお持ちの方がいらっしゃいましたら、ぜひ教えてください。\n\n私が読んでいたのは、イギリスの人々の起源は、同じグループの\nケルト人。でも...",
      "title": "赤毛の人はみんな同じ突然変異の人から生まれたのか、それとも突然変異が何度も起こったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我第一次在r/askhistorians [/r/askhistorians]发帖，希望得到一种\n时间线，但因为是科学问题而被删除。我不是专家，但\n我很感激有人能在这里提供任何见解!\n\n我在书中读到，英国人与凯尔特人来自同一个群体。\n凯尔特人。但是...",
      "title": "每个拥有红发的人都来自同一个变异者，还是变异发生了多次？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我第一次在r/askhistorians [/r/askhistorians]發帖，希望得到一種\n時間線，但因爲是科學問題而被刪除。我不是專家，但\n我很感激有人能在這裏提供任何見解!\n\n我在書中讀到，英國人與凱爾特人來自同一個羣體。\n凱爾特人。但是...",
      "title": "每個擁有紅髮的人都來自同一個變異者，還是變異發生了多次？"
    }
  ]
}