{
  "author": "tanmay1010",
  "original_created_utc": 1641153216,
  "title": "Happy 13th Birthday Bitcoin.",
  "created_utc": 1641209625,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It was on this day, 13 years ago, that the genesis block was minted by Satoshi Nakamoto and the rest is history. &lt;/p&gt;\n\n&lt;p&gt;He understood the corrupt state of our financial ecosystem and foresaw that decentralisation and internationality could solve this pervasive corruptness which had besieged us here.&lt;/p&gt;\n\n&lt;p&gt;It takes so much time and effort to learn about how Bitcoin (blockchain) works- just to think that someone had the acumen to actually invent a technology like blockchain from scratch is unfathomable.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s a toast to the revolution that came about through Bitcoin and the ecosystem it birthed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/ruhs3r/happy_13th_birthday_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "ruhs3r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It was on this day, 13 years ago, that the genesis block was minted by Satoshi\nNakamoto and the rest is history.\n\nHe understood the corrupt state of our financial ecosystem and foresaw that\ndecentralisation and internationality could solve this pervasive corruptness\nwhich had besieged us here.\n\nIt…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "13年前のこの日、サトシによって創世記のブロックが鋳造されました。\nナカモトと、あとは歴史です。\n\n彼は金融エコシステムの腐敗を理解し、次のことを予見していました。\n分散化と国際化によって、この腐敗の蔓延を解決することができる。\n私たちを包囲していたのです。\n\nそれは...",
      "title": "ビットコイン13歳の誕生日おめでとうございます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在13年前的这一天，中本聪铸造了创世区块。\n中本聪铸造的，剩下的就是历史了。\n\n他了解我们的金融生态系统的腐败状态，并预见到了\n去中心化和国际化可以解决这种普遍的腐败现象。\n困扰着我们的问题。\n\n它...",
      "title": "比特币13岁生日快乐。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在13年前的這一天，中本聰鑄造了創世區塊。\n中本聰鑄造的，剩下的就是歷史了。\n\n他了解我們的金融生態系統的腐敗狀態，並預見到了\n去中心化和國際化可以解決這種普遍的腐敗現象。\n困擾着我們的問題。\n\n它...",
      "title": "比特幣13歲生日快樂。"
    }
  ]
}