{
  "author": "Ok_Upstairs7832",
  "original_created_utc": 1626471879,
  "title": "A wallet is not what you think it is",
  "created_utc": 1626503440,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re new to the space, here is a quick 101 on wallets.</p>\n\n<p>Metamask, Electrum, MEW, Trust, Coinomi, Atomic or whatever other application you call a wallet is not really a wallet.</p>\n\n<p>They are <strong>wallet applications</strong> that allow you to access and manage your cryptocurrency, NFTs or whatever blockchain asset you have stored in your wallet.</p>\n\n<p><strong>Your wallet is your private key or seed phrase.</strong></p>\n\n<p>For example:</p>\n\n<ul>\n<li>You download Metamask</li>\n<li>It gives you the option to create a seed phrase/private key</li>\n<li>The same seed phrase you can import to other applications like Trust, MEW, Atomic and your ETH will be accessible on both Metamask and those applications.</li>\n</ul>\n\n<p>So next time you download a new wallet application, you don&#39;t have to create a new seed phrase, you can just import the one you already have to manage your existing funds in both applications.</p>\n\n<p>Just thought I&#39;d share this since I work in crypto and I noticed that a lot of users don&#39;t know this.</p>\n\n<p>EDIT: I felt obliged to add that this is the reason you should never ever share your private keys with anyone. Your keys are your sole access to your assets on the blockchain so keep them secure.</p>\n\n<p>Happy Friday!</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/olqrm9/a_wallet_is_not_what_you_think_it_is/",
  "subreddit": "CryptoCurrency",
  "id": "olqrm9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you're new to the space, here is a quick 101 on wallets.\n\nMetamask, Electrum, MEW, Trust, Coinomi, Atomic or whatever other application\nyou call a wallet is not really a wallet.\n\nThey are wallet applications that allow you to access and manage your\ncryptocurrency, NFTs or whatever blockchain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この分野に初めて触れる方のために、ウォレットに関する簡単な101を紹介します。\n\nMetamask、Electrum、MEW、Trust、Coinomi、Atomic、その他どんなアプリケーションでも\nウォレットと呼ばれているものは、実際にはウォレットではありません。\n\nそれらはウォレットアプリケーションであり、あなたの\n暗号通貨やNFTなどのブロックチェーンにアクセスして管理するためのアプリケーションです。",
      "title": "財布は自分が思っているものとは違う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是这个领域的新手，这里有一个关于钱包的快速101。\n\nMetamask、Electrum、MEW、Trust、Coinomi、Atomic或任何其他你称之为钱包的应用\n你称之为钱包的任何其他应用程序都不是真正的钱包。\n\n它们是钱包应用程序，允许你访问和管理你的\n加密货币、NFTs或任何区块链...",
      "title": "钱包不是你想的那样"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是這個領域的新手，這裏有一個關於錢包的快速101。\n\nMetamask、Electrum、MEW、Trust、Coinomi、Atomic或任何其他你稱之爲錢包的應用\n你稱之爲錢包的任何其他應用程序都不是真正的錢包。\n\n它們是錢包應用程序，允許你訪問和管理你的\n加密貨幣、NFTs或任何區塊鏈...",
      "title": "錢包不是你想的那樣"
    }
  ]
}