{
  "author": "TrollishDesires",
  "original_created_utc": 1635373092,
  "title": "Why are so many people on Reddit unable to recognize blatant satire?",
  "created_utc": 1635398152,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As an avid troll and shitposter who&#39;s been doing this for decades across multiple sites and boards I&#39;ve honestly never run into site where satire is so readily accepted as gospel truth no matter how ridiculous it is. I could (and have) voiced the most absurd and ridiculous opinions or stories and the vast majority of people believe it&#39;s real judging by their responses. I&#39;m talking pure absurdity.</p>\n\n<p>I could go right now and write a few paragraphs expressing a ridiculous yet controversial opinion full of contradicting statements, logical fallacies, blatant untruths and downright absurdity to the point where you would think most people would see right through it, comment &quot;fake and gay&quot; then move on. Believe me I&#39;ve tested this. On one of my &quot;character&quot; accounts where the username is a meme related to the opinions I share I purposely have written my posts to be increasingly ridiculous and yet so many people STILL look at the obvious troll that is the username, the absurdity posted and seemingly see it as authentic.</p>\n\n<p>To further support my claim go look at subs like <a href=\"/r/cringetopia\">r/cringetopia</a> where a large portion of the &quot;cringe&quot; is clearly satire and the posters in that sub cannot recognize it.</p>\n\n<p>After several years on this site I&#39;ve noticed this and it&#39;s really odd because as someone who&#39;s also spent a lot of time on other places I can say that while the inability to recognize satire is not unique to Reddit it is definitely more common here. Now before we start making assumptions about my intentions on this matter I&#39;m not trying to imply anyone on this site is inherently dumb or naive.</p>\n\n<p>I&#39;m coming here posing this as a legitimate question as to why anyone would take the absurd shit I post seriously and why that seems to happen more on Reddit than other sites.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/qh84g3/why_are_so_many_people_on_reddit_unable_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "qh84g3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As an avid troll and shitposter who's been doing this for decades across\nmultiple sites and boards I've honestly never run into site where satire is so\nreadily accepted as gospel truth no matter how ridiculous it is. I could (and\nhave) voiced the most absurd and ridiculous opinions or stories and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "複数のサイトや掲示板で何十年もやっている熱心な荒らしやクソ投稿者としては\n複数のサイトや掲示板で何十年もやっていますが、正直なところ、風刺がこれほど読まれているサイトに出会ったことはありません。\n風刺がどれほど馬鹿げていても福音的な真実として受け入れられるサイトに出会ったことはありません。私は\n私は最も不条理で馬鹿げた意見や話をすることができました（してきました）。",
      "title": "なぜRedditには、露骨な風刺を見抜けない人が多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个狂热的巨魔和屎壳郎，他已经在多个网站和论坛上做了几十年的工作。\n我从来没有遇到过这样的网站，在那里，讽刺是如此的容易被接受。\n不管它有多荒唐，都能轻易接受为福音真理。我可以（而且\n我可以（而且已经）发表最荒唐和最荒谬的意见或故事，并且...",
      "title": "为什么Reddit上有那么多人无法识别公然的讽刺？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個狂熱的巨魔和屎殼郎，他已經在多個網站和論壇上做了幾十年的工作。\n我從來沒有遇到過這樣的網站，在那裏，諷刺是如此的容易被接受。\n不管它有多荒唐，都能輕易接受爲福音真理。我可以（而且\n我可以（而且已經）發表最荒唐和最荒謬的意見或故事，並且...",
      "title": "爲什麼Reddit上有那麼多人無法識別公然的諷刺？"
    }
  ]
}