{
  "author": "broodjee",
  "the_new_excerpt": "Hello everybody, long time lurker here. I just wanted to tell a quick story on\nhow cryptocurrency helped me improve my relationship with my dad.\n\nWhen I was about 3 years old my parents got divorced. I never thought much of it\nbut obviously it left a lot to be desired surrounding my relationship…",
  "original_created_utc": 1615075679,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，好久没来了。我只想讲一个关于\n加密货币如何帮助我改善与父亲的关系。\n\n当我3岁的时候，我的父母离婚了。我从来没有想过太多\n但很明显，它留下了很多需要 围绕我的关系... ...",
      "title": "加密货币是如何帮助我和爸爸建立关系的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，好久沒來了。我只想講一個關於\n加密貨幣如何幫助我改善與父親的關係。\n\n當我3歲的時候，我的父母離婚了。我從來沒有想過太多\n但很明顯，它留下了很多需要 圍繞我的關係... ...",
      "title": "加密貨幣是如何幫助我和爸爸建立關係的？"
    }
  ],
  "title": "How Cryptocurrency helped me build a relationship with my dad",
  "created_utc": 1615113038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everybody, long time lurker here. I just wanted to tell a quick story on how cryptocurrency helped me improve my relationship with my dad.</p>\n\n<p>When I was about 3 years old my parents got divorced. I never thought much of it but obviously it left a lot to be desired surrounding my relationship with my dad since I only got to see him about once a week after the divorce. I noticed how I had never been able to have deep conversations with my father. We had been getting closer for the past 2 or 3 years by watching Formula 1 together and going on vacations. It definitely made me happier as a person to finally spend quality time with my dad.</p>\n\n<p>My dad had always been into Crypto, I remember him mining back in like 2014 on a few old Radeon cards. I had no clue what any of it meant but at least I got in contact with Crypto early on and I feel like it planted a seed in my brain. </p>\n\n<p>I turned 18 last year and one of the first things I did was open a Kraken account and buy some crypto (a small amount). As time went on me and my dad started to talk more and more about what coins to buy, which projects are technologically interesting and stuff like that. This past month I finally felt like I was able to have deep conversations with my dad about finance, politics and my future all because of cryptocurrency. </p>\n\n<p>So I want to thank this whole community for embracing people like me who didn&#39;t know a lot about crypto and teaching us, because without you all I probably would not have been as interested in crypto as I am now, and it has really improved my life.</p>\n</div><!-- SC_ON -->",
  "score": 245,
  "permalink": "/r/CryptoCurrency/comments/lzep0v/how_cryptocurrency_helped_me_build_a_relationship/",
  "subreddit": "CryptoCurrency",
  "id": "lzep0v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542572114
}