{
  "author": "Prof_F_",
  "original_created_utc": 1660251365,
  "title": "Why did Telegrams use the word STOP instead of a Period?",
  "created_utc": 1660273570,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone, first time posting a question. I&amp;#39;m a telegraph historian and I&amp;#39;m struggling to find a reliable and good source to answer this question. Specifically I&amp;#39;m looking for American or Canadian sources that might provide an answer to its origins. A lot of answers I&amp;#39;ve heard from people online don&amp;#39;t make sense to me either and I&amp;#39;ll show some of the common answers I&amp;#39;ve heard and why they don&amp;#39;t make sense to me. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;&amp;quot;It was more work/more disruptive for the operator to use punctuation than words.&amp;quot;&lt;br/&gt;\nTo me this seems incorrect when you realize that the American Morse code for a period was &amp;quot;. . - - . .&amp;quot; and the code for &amp;quot;stop&amp;quot; would have been &amp;quot;. . .   -   -  -   . . . .&amp;quot; one requires more physical effort and concentration than the other. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Taken directly from the nbc &lt;a href=\"https://www.nbcnews.com/id/wbna11147506\"&gt;https://www.nbcnews.com/id/wbna11147506&lt;/a&gt;, &amp;quot; People would save money by using the word “stop” instead of periods to  end sentences because punctuation was extra while the four character  word was free.&amp;quot;&lt;br/&gt;\nThis also seems false, though in a less obvious way. For Western Union telegrams rates were somewhat fixed. Telegrams that were 10 words or less were all charged the same, with rate changes based on distance and office location. Any word over that 10 was then charged extra based on the office and distance. While there was seemingly never any hard company rules about how to count punctuation for charging telegrams (in the 1866, 1870, and 1884 Western Union company rulebooks.) The 1884 Western Union rulebook provides a useful example where it states that the figure &amp;quot;44.42&amp;quot; should be counted as 5 words. Meaning every numeral and the &amp;quot;.&amp;quot; is counted as a word, the same way &amp;quot;stop&amp;quot; would be. Therefore, so long as you used the &amp;quot;.&amp;quot; within your ten words it would be just as &amp;quot;free&amp;quot; as using the word &amp;quot;stop.&amp;quot; &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&amp;quot;Because the telegraph lacked the ability to use punctuation&amp;quot; or &amp;quot;punctuation code was not invented yet.&amp;quot;&lt;br/&gt;\nAs I have already demonstrated in point 1, this is not true, there was code for punctuation. But, it did get me thinking, when was the code for punctuation introduced into American Morse code? Punctuation was not present in Morse&amp;#39;s first patent for his code and telegraph in 1840. The full text of his patent only mentions letters and numerals &lt;a href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fpatents.google.com%2Fpatent%2FUS1647A%2Fen%3Ffbclid%3DIwAR064P7-rx_QmOgCItxmY4IqsLrzqcy0jn0DuB4WKCbtZWH34laGoBMBsgY&amp;amp;h=AT10KFOPloSIrSc8zidUUcEKiv9h6pXWZCrtiy_VAMxmA3vWtDdklsZD61Be07pLM92TpGTIHbo27nFxILXHKhYVKN4qJBrmCoBuV_pUDtvm9fm2_AYY5s1AibLXQQqKUmK3&amp;amp;__tn__=-UK-R&amp;amp;c%5B0%5D=AT1cNyUZNwcsP95lkkQqrKNd_dFh56oGEfRkuGWeij2ka4Nm1t7xBOtiDjcionpia20KNC_4hpcRFK_NovH3CsUOTo9-WdwEFE5AeXEYc_-Kq_lbq25K6_VPEVlTBpfT9HeN8T6rrgzOn7lvovO5HTIx0vDdRYTOCwcE6PDgMMAatA8ukcv7\"&gt;https://patents.google.com/patent/US1647A/en&lt;/a&gt; . Sadly, this is where my research got stonewalled. I could not find a complete and accurate history of the evolution of American Morse code that included any mention of the addition of punctuation past Morse&amp;#39;s original patent. However, I am quite sure that for most of the telegraph&amp;#39;s history punctuation was an option. I have a telegraph textbook from 1883 that includes code for punctuation, the book &amp;quot;The Telegraph in America&amp;quot; from 1879 also includes code for punctuation, and a Canadian telegram from 1847 has what to me looks like a period at the end of the first line. I also think what looks like the capitalization of the &amp;quot;S&amp;quot; in &amp;quot;She&amp;quot; at the beginning of the second line also supports my reading (&lt;a href=\"https://tinyurl.com/mthwdcax\"&gt;https://tinyurl.com/mthwdcax&lt;/a&gt;). &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&amp;quot;Because during WW1 governments and militaries wanted greater clarity and security in sending, so they used STOP instead of periods to avoid ambiguity.&amp;quot;&lt;br/&gt;\nI don&amp;#39;t know where exactly the originator of this is from, but again this explanation kind of admits that code for punctuation had already existed. I find a lot of people citing a booklet &amp;quot;How to Write Telegrams Properly&amp;quot; from 1928, and it is the earliest example I&amp;#39;ve found for this explanation&amp;#39;s origins. I haven&amp;#39;t found any sources making similar claims. Still, this explanation does not make sense to me. The code for STOP (&amp;quot;. . .   -   -  -   . . . .&amp;quot;) is just as likely to be misinterpreted as the code for a period, if not more so as the American Morse code for &amp;quot;O&amp;quot; was a confusing &amp;quot;-  -&amp;quot; essentially two dashes with a space between them that&amp;#39;s smaller than the space between words. Giving this explanation the benefit of the doubt, let&amp;#39;s say militaries preferred having STOP written out because it was harder to miss than a period? That still leaves the question of how and why it would be adopted popularly by people after the war. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;In short, I don&amp;#39;t know what the origins of using STOP is for telegrams. I think it&amp;#39;s likely a form of telegraphese that originally spread through popular culture and public ignorance about the telegraph after wider use of the technology in the 1920s and 30s and it did not come from the telegraph industry. Or, it could have come from the telegraph industry with the introduction of new printing telegraph machines in the early twentieth-century and perhaps they had a technical limitation requiring the use of STOP which previous Morse telegrams that were typed or handwritten did not need to do. However, I cannot find sources to strongly support either claim. It does seem to me like the origin of STOP is from the twentieth-century, post-WW1 specifically, and not from the nineteenth-century, though I&amp;#39;m open to being proven wrong.   &lt;/p&gt;\n\n&lt;p&gt;If any military historian knows anything about the use of the word STOP in war telegrams and has any evidence to point towards its use in confidential or government business I&amp;#39;d be interested to see it. If any other historians know of STOP&amp;#39;s wider use in telegrams or think I may have made a mistake or error in my assessments of these common explanations I&amp;#39;d be happy to hear them out. I would prefer sources for any answers provided if possible. Thank you very much.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/AskHistorians/comments/wm2152/why_did_telegrams_use_the_word_stop_instead_of_a/",
  "subreddit": "AskHistorians",
  "id": "wm2152",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello everyone, first time posting a question. I'm a telegraph historian and I'm\nstruggling to find a reliable and good source to answer this question.\nSpecifically I'm looking for American or Canadian sources that might provide an\nanswer to its origins. A lot of answers I've heard from people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんこんにちは、初めて質問を投稿します。私は電信の歴史家なのですが、信頼性が高く、かつ良質な電信機を見つけるのに苦労しています。\nこの質問に答えるために、信頼できる良いソースを見つけるのに苦労しています。\n具体的には、アメリカかカナダの資料で、電信の起源について答えられるようなものを探しています。\nその起源についての答えを探しています。このような場合、どのようにすればよいのでしょうか？",
      "title": "なぜ、電報にはピリオドではなく、「STOP」という言葉が使われたのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，第一次发问题。我是一个电报历史学家，我正在努力寻找一个可靠和良好的来源来回答这个问题。\n在努力寻找一个可靠的、好的资料来回答这个问题。\n具体来说，我在寻找美国或加拿大的资料，这些资料可能会提供一个\n的答案。我从人们那里听到的很多答案都是...",
      "title": "为什么Telegrams使用STOP这个词而不是句号？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，第一次發問題。我是一個電報歷史學家，我正在努力尋找一個可靠和良好的來源來回答這個問題。\n在努力尋找一個可靠的、好的資料來回答這個問題。\n具體來說，我在尋找美國或加拿大的資料，這些資料可能會提供一個\n的答案。我從人們那裏聽到的很多答案都是...",
      "title": "爲什麼Telegrams使用STOP這個詞而不是句號？"
    }
  ]
}