{
  "author": "TangoBunny",
  "original_created_utc": 1627056009,
  "title": "What are men's honest feelings about blue balls?",
  "created_utc": 1627077578,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright, to get the preface out of the way so we&#39;re all on the same wavelength and people don&#39;t regurgitate the things we all know:</p>\n\n<p>- Yes, ladies have the right to stop any time they want<br/>\n- No, us gals don&#39;t owe guys anything<br/>\n- Yes, blue balls is a real thing (there&#39;s a whole pain kink over it!),<br/>\n- and yes, guys can simply relieve it by jacking off.</p>\n\n<p>Now that&#39;s out of the way...</p>\n\n<p>Guys.  Men.  Burly Blokes.<br/>\nI want to know, <strong>honestly,</strong></p>\n\n<p>If a girl gave you blue balls--  that is, to say, built you up only to suddenly decide to stop, leaving you with an unexpected Free Cock &amp; Ball Torture Session that you never signed up for,</p>\n\n<p>Do you just figure &quot;Ah well, I&#39;ll deal with the pain, I didn&#39;t expect to come out of this hurting but men don&#39;t cry about it&quot;?</p>\n\n<p>or &quot;Jesus Christ this hurts like heck, does she realise this?! Fuck fuck fuck. I&#39;m going to put on a brave face and smile and say it&#39;s okay, but I can&#39;t believe she went that far only to decide genital torture was better than a climax&quot;?</p>\n\n<p>or something else?  How do you <strong>honestly</strong> feel between the moment the crotch pain hits and before you&#39;ve had an angry wank to ease it?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/oq5ecn/what_are_mens_honest_feelings_about_blue_balls/",
  "subreddit": "TooAfraidToAsk",
  "id": "oq5ecn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Alright, to get the preface out of the way so we're all on the same wavelength\nand people don't regurgitate the things we all know:\n\n- Yes, ladies have the right to stop any time they want\n- No, us gals don't owe guys anything\n- Yes, blue balls is a real thing (there's a whole pain kink over it!),\n-…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、前置きが長くなりましたが、私たちは同じ波長を持っています。\nそして、みんなが知っていることを蒸し返さないように。\n\n- はい、女性はいつでも好きな時に止める権利があります。\n- いいえ、私たちギャルは男に何の義務もありません\n- はい、私たちギャルは男に何の義務もありません はい、青いボールは実在します（そのために痛みを伴うキンクがあるのです！）。\n-...",
      "title": "青いボールに対する男性の本音は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，先把前言说清楚，这样我们就会有相同的想法了\n大家不要再重复我们都知道的事情了。\n\n- 是的，女士们有权利在任何时候停止她们想要的东西。\n- 不，我们女人不欠男人什么\n- 是的，蓝球是一个真实的东西（有一个完整的痛苦怪癖！）。\n-...",
      "title": "男人对蓝球的真实感受是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，先把前言說清楚，這樣我們就會有相同的想法了\n大家不要再重複我們都知道的事情了。\n\n- 是的，女士們有權利在任何時候停止她們想要的東西。\n- 不，我們女人不欠男人什麼\n- 是的，藍球是一個真實的東西（有一個完整的痛苦怪癖！）。\n-...",
      "title": "男人對藍球的真實感受是什麼？"
    }
  ]
}