{
  "author": "Aggressivestonk",
  "the_new_excerpt": "I'm sure that you all are aware of this phenomenon, it seems that whenever ARK\nfund manager Cathie Wood invests in something, the individual ticker will always\ntake off upon the release of daily trade notification reports.\n\nOne recent example would be PLTR - when PLTR was down about 2.27% on 14…",
  "original_created_utc": 1610892066,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "相信大家都知道这个现象，似乎每当ARK\n基金经理凯西-伍德投资的东西，个人的股票永远是\n每天的交易通知报告发布后，就会有新的起色。\n\n最近的一个例子是PLTR--当PLTR在14日下跌约2.27%......",
      "title": "ARK ETF--自我实现的预言？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "相信大家都知道這個現象，似乎每當ARK\n基金經理凱西-伍德投資的東西，個人的股票永遠是\n每天的交易通知報告發布後，就會有新的起色。\n\n最近的一個例子是PLTR--當PLTR在14日下跌約2.27%......",
      "title": "ARK ETF--自我實現的預言？"
    }
  ],
  "title": "ARK ETFs - A Self Fulfilling Prophecy?",
  "created_utc": 1610905322,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sure that you all are aware of this phenomenon, it seems that whenever ARK fund manager Cathie Wood invests in something, the individual ticker will always take off upon the release of daily trade notification reports.</p>\n\n<p>One recent example would be PLTR - when PLTR was down about 2.27% on 14 Jan. After the trade notification report of ARKW&#39;s 497k shares purchase in PLTR was released after trading hours, reddit/stocktwit community immediately started to share about the news and it further amplified the news to a huge extent, where it popped 11% the next day after opening before inching back down.</p>\n\n<p>Or another one would be the recent announcement to start a ARK Space ETF - and space related stocks were soaring on the very next day.</p>\n\n<p>This phenomenon almost seems like the Midas Touch, where she has the ability to touch (or invest) anything into gold due to her almighty influence. Honestly, the best play I would reckon would be just to invest in her ETFs given the self-fulfilling nature and you never know when she will dump the stock (since a sell-off will inevitably follow thereafter).</p>\n\n<p>Any thoughts about this?</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/investing/comments/kz6x9s/ark_etfs_a_self_fulfilling_prophecy/",
  "subreddit": "investing",
  "id": "kz6x9s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217225
}