{
  "author": "TheBoyWhoCriedTapir",
  "original_created_utc": 1648314181,
  "title": "How would I go about identifying a CD that I bought off the street corner?",
  "created_utc": 1648351848,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I paid a man $4 for his mixtape thinking “ok this is probably going to be shit but this man looks like he’s struggling and I get a CD in return…. Fuck it.” Then I put it in my disc drive…&lt;/p&gt;\n\n&lt;p&gt;Its an absolute BANGER of a mixtape.&lt;/p&gt;\n\n&lt;p&gt;I don’t know how to find this man, I can’t find any of his music online, I’ve been back to the street corner because i pass it every day on my way to work and never see him.&lt;/p&gt;\n\n&lt;p&gt;I just want a link to his SoundCloud or something man, he’s actually great and id love to donate to the cause because this man DESERVES some studio time.&lt;/p&gt;\n\n&lt;p&gt;Any response is appreciated.&lt;/p&gt;\n\n&lt;p&gt;Edit: thank you for silver.&lt;/p&gt;\n\n&lt;p&gt;I just remembered some of the lyrics if anyone wants to do some digging.&lt;/p&gt;\n\n&lt;p&gt;“(This is a Headknocker Production)&lt;/p&gt;\n\n&lt;p&gt;I show much love straight to the thugs, &lt;/p&gt;\n\n&lt;p&gt;Pimps and the motherfuckin hustlers in the club…”&lt;/p&gt;\n\n&lt;p&gt;I’ll definitely be following up on this later.&lt;/p&gt;\n\n&lt;p&gt;Also do you think &lt;a href=\"/r/RBI\"&gt;r/RBI&lt;/a&gt; would be interested if I crossposted?&lt;/p&gt;\n\n&lt;p&gt;Edit 2: Thanks for the other award! Almost out of work and ill be posting some mixtape clips soon!&lt;/p&gt;\n\n&lt;p&gt;Edit 3: &lt;strong&gt;THE YOUTUBE VIDEO IS HERE&lt;/strong&gt; please help me identify this man. &lt;a href=\"https://youtu.be/Kgr-Bp0sWwk\"&gt;https://youtu.be/Kgr-Bp0sWwk&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/toxxb0/how_would_i_go_about_identifying_a_cd_that_i/",
  "subreddit": "NoStupidQuestions",
  "id": "toxxb0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I paid a man $4 for his mixtape thinking “ok this is probably going to be shit\nbut this man looks like he’s struggling and I get a CD in return…. Fuck it.”\nThen I put it in my disc drive…\n\nIts an absolute BANGER of a mixtape.\n\nI don’t know how to find this man, I can’t find any of his music online,…"
}