{
  "author": "imadumbshit69",
  "original_created_utc": 1651495130,
  "title": "The longer I'm in crypto, the more of a BTC maxi I become.",
  "created_utc": 1651509511,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get me wrong, I&amp;#39;m a slut for some altcoins. There&amp;#39;s some that I am very excited about and could see or are doing great things.&lt;/p&gt;\n\n&lt;p&gt;But there&amp;#39;s one big problem with each of these altcoins: you can&amp;#39;t fully trust them anymore. Stuff like the recent crypto dot com ordeal, SOL, and the constant rugpulls. It&amp;#39;s becoming more clear that you can&amp;#39;t trust a project. There is always the thought in the back of my mind now that the developers could one day pull a CDC and just fuck over their investors. Neglect the attention ot to cover all their bases. Or just say fuck it and dip out.&lt;/p&gt;\n\n&lt;p&gt;The only project I seem to fully trust is Bitcoin now. I&amp;#39;m not worried about the developers deciding, &amp;quot;oh, we&amp;#39;re actually going to make the max supply 100m now instead of 21m.&amp;quot; Everything is set. It&amp;#39;s all Gucci. &lt;/p&gt;\n\n&lt;p&gt;Will I only invest in BTC now? Heck nah. I&amp;#39;ll still keep my eyes peeled and sink some beer money into alts. But now I will be extra, extra careful. Chasing gains is over. I&amp;#39;m only interested in things I can trust for now on. CDC taught me a lesson. So thanks for that, I guess.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/ugops5/the_longer_im_in_crypto_the_more_of_a_btc_maxi_i/",
  "subreddit": "CryptoCurrency",
  "id": "ugops5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Don't get me wrong, I'm a slut for some altcoins. There's some that I am very\nexcited about and could see or are doing great things.\n\nBut there's one big problem with each of these altcoins: you can't fully trust\nthem anymore. Stuff like the recent crypto dot com ordeal, SOL, and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解しないでください、私はいくつかのアルトコインにだらしないのです。私がとても楽しみにしているものもあります。\nとても楽しみで、素晴らしいことをやっていると思えるものもあります。\n\nしかし、これらのアルトコインには1つの大きな問題があります：あなたはもう完全にそれらを信頼することはできません。\nもう信用できないのです。最近の暗号ドットコム試練、SOL、そして...のようなスタッフ。",
      "title": "クリプトを長くやっていると、BTCマキシになるんです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要误会我的意思，我对一些altcoins来说是个荡妇。有一些是我非常\n兴奋，可以看到或正在做伟大的事情。\n\n但这些替代币都有一个大问题：你不能完全相信\n他们了。像最近的加密货币点com事件，SOL，和...",
      "title": "我在加密货币中的时间越长，我就越是一个BTC大户。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要誤會我的意思，我對一些altcoins來說是個蕩婦。有一些是我非常\n興奮，可以看到或正在做偉大的事情。\n\n但這些替代幣都有一個大問題：你不能完全相信\n他們了。像最近的加密貨幣點com事件，SOL，和...",
      "title": "我在加密貨幣中的時間越長，我就越是一個BTC大戶。"
    }
  ]
}