{
  "author": "rufrufmeow",
  "the_new_excerpt": "I appreciate all answers. 2 weeks ago my dog was given 2-3 weeks to live. All\nalong we thought he was a healthy/energetic older dog. About 3-4 months before\nthis shocking news, he starts lightly digging in our yard. He has never been a\ndigger. It took 2-3 weeks to complete his project. Which is now…",
  "original_created_utc": 1611203675,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "感谢大家的回答。2周前，我的狗被赋予了2-3周的生命。所有\n一直以来，我们认为他是一只健康/精力充沛的老狗。大约3-4个月前\n这个令人震惊的消息，他开始在我们的院子里轻而易举地挖掘。他从来不是一个\n挖掘机。花了两三个星期才完成他的项目。现在是...",
      "title": "狗知道自己什么时候死吗？我的狗挖了个洞"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "感謝大家的回答。2周前，我的狗被賦予了2-3周的生命。所有\n一直以來，我們認爲他是一隻健康/精力充沛的老狗。大約3-4個月前\n這個令人震驚的消息，他開始在我們的院子裏輕而易舉地挖掘。他從來不是一個\n挖掘機。花了兩三個星期才完成他的項目。現在是...",
      "title": "狗知道自己什麼時候死嗎？我的狗挖了個洞"
    }
  ],
  "title": "Do dogs know when they are dying? Mine dug a hole",
  "created_utc": 1611241148,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I appreciate all answers. 2 weeks ago my dog was given 2-3 weeks to live. All along we thought he was a healthy/energetic older dog. About 3-4 months before this shocking news, he starts lightly digging in our yard. He has never been a digger. It took 2-3 weeks to complete his project. Which is now a perfectly oval hole, 3-4 inches deep. We would randomly find him in his home made hole, just hanging. We joked about him digging his own grave. Now, I feel like it all makes sense. He is hanging in there, some days worse than others. I’m grateful that he is not in pain. He will still go lay in his hole and I’m at peace with this. When he is ready, I will be there. \nDo you believe dogs know way before we are known of their diagnosis? </p>\n\n<p>My pup is suffering from a ruptured tumor on his spleen. Surgery was not recommended.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/NoStupidQuestions/comments/l1r2p6/do_dogs_know_when_they_are_dying_mine_dug_a_hole/",
  "subreddit": "NoStupidQuestions",
  "id": "l1r2p6",
  "is_self": true,
  "media": null,
  "is_video": false
}