{
  "author": "AskScienceModerator",
  "original_created_utc": 1655118049,
  "title": "AskScience AMA Series: I am Dr. Helen Okoye. As an attending physician and thrombosis specialist at the University of Nigeria Teaching Hospital, I am passionate about women's health and helping to overcome barriers to health care here in Nigeria. AMA!",
  "created_utc": 1655128048,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am Dr. Helen Okoye, MBBS, FMCPath, FWACP. I am a haematologist currently working as an Attending Physician and Thrombosis Specialist at the University of Nigeria Teaching Hospital in Enugu, Nigeria. My clinical work focuses on thrombosis and haemostasis with a special interest in women&amp;#39;s health. I see all kinds of patients with thrombotic disorders including obstetric and cancer patients. I am passionate about women&amp;#39;s health and helping my patients to overcome barriers to health care here in Nigeria, many of which are due to cost and/or lack of resources. I am here to answer your questions about what it is like to work as a female clinician in Nigeria. I will be here at 12 p.m. noon US ET (16 UT), AMA!&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/WorldThrombosisDay\"&gt;/u/WorldThrombosisDay&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 474,
  "permalink": "/r/askscience/comments/vb9isb/askscience_ama_series_i_am_dr_helen_okoye_as_an/",
  "subreddit": "askscience",
  "id": "vb9isb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am Dr. Helen Okoye, MBBS, FMCPath, FWACP. I am a haematologist currently\nworking as an Attending Physician and Thrombosis Specialist at the University of\nNigeria Teaching Hospital in Enugu, Nigeria. My clinical work focuses on\nthrombosis and haemostasis with a special interest in women's health.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はDr. Helen Okoye, MBBS, FMCPath, FWACPです。私は血液学者で、現在\n現在、ナイジェリアのエヌグにあるナイジェリア大学付属病院で、血栓症の専門医として勤務しています。\nNigeria Teaching Hospitalで、血栓症専門医として勤務しています。私の臨床の中心は\n血栓症や止血、特に女性の健康に関心を持っています。",
      "title": "AskScienceのAMAシリーズ。私は、ヘレン・オコエ博士です。ナイジェリア大学付属病院の主治医で血栓症の専門家である私は、女性の健康と、ここナイジェリアでの医療への障壁を克服するための支援に情熱を注いでいます。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是Helen Okoye医生，医学学士，FMCPath，FWACP。我是一名血液学专家，目前\n在尼日利亚埃努古的尼日利亚大学教学医院担任主治医生和血栓专家。\n尼日利亚大学教学医院担任主治医师和血栓专家。我的临床工作重点是\n血栓形成和止血，对妇女健康有特别的兴趣....",
      "title": "AskScience AMA系列。我是Helen Okoye博士。作为尼日利亚大学教学医院的主治医生和血栓专家，我热衷于妇女健康和帮助克服尼日利亚的医疗保健障碍。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是Helen Okoye醫生，醫學學士，FMCPath，FWACP。我是一名血液學專家，目前\n在尼日利亞埃努古的尼日利亞大學教學醫院擔任主治醫生和血栓專家。\n尼日利亞大學教學醫院擔任主治醫師和血栓專家。我的臨牀工作重點是\n血栓形成和止血，對婦女健康有特別的興趣....",
      "title": "AskScience AMA系列。我是Helen Okoye博士。作爲尼日利亞大學教學醫院的主治醫生和血栓專家，我熱衷於婦女健康和幫助克服尼日利亞的醫療保健障礙。AMA!"
    }
  ]
}