{
  "author": "kazzar2020",
  "the_new_excerpt": "I was born and raised in El Salvador for a part of my childhood until I moved to\nthe US. My parents have lived through a civil war, jumping over dead bodies to\ngo visit family or friends. The country has been through so much since its\ninception. Losing the native currency was also disheartening to…",
  "original_created_utc": 1623099221,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は幼少期の一部をエルサルバドルで過ごし、その後アメリカに移住しました。\nアメリカに引っ越すまでの間、エルサルバドルで生まれ育ちました。私の両親は内戦を経験しており、家族や友人に会いに行くために死体を飛び越えたりしていました。\n家族や友人に会いに行くために死体を飛び越えていました。この国は建国以来、多くのことを経験してきました。\nこの国は設立以来、本当に多くのことを経験してきました。自国の通貨を失ったことも、心を痛めました...。",
      "title": "エルサルバドル出身"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在萨尔瓦多出生并长大，在我的部分童年时期，直到我搬到美国。\n美国。我的父母经历了一场内战，跳过尸体去探望家人或朋友。\n去拜访家人或朋友。这个国家自成立以来经历了太多\n开始的时候。失去本土货币也让人心灰意冷，...",
      "title": "来自萨尔瓦多的本地人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在薩爾瓦多出生並長大，在我的部分童年時期，直到我搬到美國。\n美國。我的父母經歷了一場內戰，跳過屍體去探望家人或朋友。\n去拜訪家人或朋友。這個國家自成立以來經歷了太多\n開始的時候。失去本土貨幣也讓人心灰意冷，...",
      "title": "來自薩爾瓦多的本地人"
    }
  ],
  "title": "Native from El Salvador",
  "created_utc": 1623121746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was born and raised in El Salvador for a part of my childhood until I moved to the US. My parents have lived through a civil war, jumping over dead bodies to go visit family or friends. The country has been through so much since its inception. Losing the native currency was also disheartening to see when the USD was adopted. Crime has been relatively rampant but the new president has done much to curb this. I sincerely hope crypto can bring a bright future to my small country. Both surfing and crypto seem to be bringing lots of international people over and making headlines. I used to have to show people on a map where El Salvador is and what language I speak. Looking forward to the future for all of us and I hope El Salvador leads the way!!</p>\n</div><!-- SC_ON -->",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/nunaih/native_from_el_salvador/",
  "subreddit": "CryptoCurrency",
  "id": "nunaih",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882873
}