{
  "author": "simonkesterlian",
  "the_new_excerpt": "Hi everyone, a thought just crossed my mind: with the increasing attention on\nReddit, especially specific sub-reddits which shall not be named, as well as\nincreasing number of fake posts and bots, do you think this is a way for hedge\nfunds to start a pump anonymously on Reddit and then dump their…",
  "original_created_utc": 1623307578,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、ふと思ったことがあります。それは、Redditが注目を集めていることです。\nReddit、特に名前をつけてはいけない特定のサブリットが注目されていること、そして\nヘッジファンドがRedditで匿名でパンプを始めて、そのパンプを捨てて...という方法があると思いますか？\nこれは、ヘッジファンドがRedditで匿名でポンプを始めて、そのポンプを捨てて...",
      "title": "ミームストックを装ったヘッジファンドによるパンプ＆ダンプ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我刚刚想到一个想法：随着人们对\n越来越多的人关注Reddit，特别是一些不应该被命名的子目录，以及\n越来越多的虚假帖子和机器人，你认为这是一个对冲\n你认为这是否是对冲基金在Reddit上匿名开泵，然后抛出其...",
      "title": "对冲基金伪装成备忘录股票进行抽水和倾倒的行为"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我剛剛想到一個想法：隨着人們對\n越來越多的人關注Reddit，特別是一些不應該被命名的子目錄，以及\n越來越多的虛假帖子和機器人，你認爲這是一個對沖\n你認爲這是否是對沖基金在Reddit上匿名開泵，然後拋出其...",
      "title": "對沖基金僞裝成備忘錄股票進行抽水和傾倒的行爲"
    }
  ],
  "title": "Pump&dumps by hedge funds disguised as meme stocks",
  "created_utc": 1623311720,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, a thought just crossed my mind: with the increasing attention on Reddit, especially specific sub-reddits which shall not be named, as well as increasing number of fake posts and bots, do you think this is a way for hedge funds to start a pump anonymously on Reddit and then dump their shares? This way they can avoid the regulatory scrutiny and pretty much stay hidden from the media as well (I watch to Bloomberg a lot and all they mention is meme stocks that gained traction on Reddit). I just don&#39;t think retail investors have enough capital; every day there are at least two new stocks that run up significantly (coined meme stocks by media).</p>\n</div><!-- SC_ON -->",
  "score": 261,
  "permalink": "/r/investing/comments/nwh3nr/pumpdumps_by_hedge_funds_disguised_as_meme_stocks/",
  "subreddit": "investing",
  "id": "nwh3nr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886628
}