{
  "author": "bakerwasthere",
  "original_created_utc": 1636487254,
  "title": "How am I supposed to feel/react to my transgender child?",
  "created_utc": 1636500723,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok, so long story short my 14 year old was born a girl and last night he said that he is trans and his name is Eugene and his pronouns are He/him. My kid came out to me a few months earlier as gay. My wife and I have been supportive and encouraging that if that is what makes them happy, we support it. BUT, now he’s trans and I know it’s only been a day but I feel like it’s a lot to process. I mean they’re only 14. Are they old enough to know that? Is this likely a teenage thing to seem cool with friends? I honestly am not sure I like it. I truly am trying to be supportive but I don’t really believe in the trans movement.  Though I don’t believe in it, I also don’t force my opinion on anyone else. I’m of the mindset do whatever you want as long as you don’t harm or violate others, so I’ve never considered myself against it or for it, just that it’s out there. Biggest stupid question is shouldn’t his mother and I get to chose his new name? Since we named him in the first place? But I suppose it doesn’t matter. Just part of these fleeting thoughts as I process all of this.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/qqbnas/how_am_i_supposed_to_feelreact_to_my_transgender/",
  "subreddit": "NoStupidQuestions",
  "id": "qqbnas",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ok, so long story short my 14 year old was born a girl and last night he said\nthat he is trans and his name is Eugene and his pronouns are He/him. My kid came\nout to me a few months earlier as gay. My wife and I have been supportive and\nencouraging that if that is what makes them happy, we support…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、話は長くなりますが、私の14歳の子供は女の子として生まれましたが、昨夜彼は\n自分はトランスジェンダーで、名前はEugene、代名詞はHe/Himだと言いました。うちの子は\n数ヶ月前に私にゲイであることをカミングアウトしました。私と妻は、それを支持し、励ましてきました。\nそれが彼らの幸せであるならば、私たちはそれを支持します。",
      "title": "トランスジェンダーの子供に対して、私はどのように感じ、反応すればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，长话短说，我14岁的孩子出生时是个女孩，昨天晚上他说\n他说他是变性人，他的名字是尤金，他的代名词是他/他。我的孩子\n几个月前，我的孩子向我坦白了他是同性恋。我的妻子和我一直在支持和鼓励他。\n如果这是他们的幸福，我们支持...。",
      "title": "我应该对我的变性孩子有什么感觉/反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，長話短說，我14歲的孩子出生時是個女孩，昨天晚上他說\n他說他是變性人，他的名字是尤金，他的代名詞是他/他。我的孩子\n幾個月前，我的孩子向我坦白了他是同性戀。我的妻子和我一直在支持和鼓勵他。\n如果這是他們的幸福，我們支持...。",
      "title": "我應該對我的變性孩子有什麼感覺/反應？"
    }
  ]
}