{
  "author": "Bright-Shop-7928",
  "original_created_utc": 1639316701,
  "title": "How long until your bank snitched on you?",
  "created_utc": 1639334117,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was using cashapp to make purchases of BTC 2021. And after about 4K in purchases my mother in law tells my wife I was buying drugs or seeing other women.  &lt;/p&gt;\n\n&lt;p&gt;I asked her where all this came from as we have had a decent marriage, two children even.  She then tells me, her mom has friends at our bank. And they thought because I was losing weight and buying crypto, I was doing coke and meth.&lt;/p&gt;\n\n&lt;p&gt;First off, how can I prosecute this overreach ?? Second what the fuck in totalitarianism is this !!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 263,
  "permalink": "/r/Bitcoin/comments/repaym/how_long_until_your_bank_snitched_on_you/",
  "subreddit": "Bitcoin",
  "id": "repaym",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was using cashapp to make purchases of BTC 2021. And after about 4K in\npurchases my mother in law tells my wife I was buying drugs or seeing other\nwomen.\n\nI asked her where all this came from as we have had a decent marriage, two\nchildren even. She then tells me, her mom has friends at our bank.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTC2021の購入にcashappを使用していました。そして4Kほど購入した後\n義理の母が妻に、私がドラッグを買っていたとか、他の人と会っていたとか言っています。\n女性です。\n\n私たちは結婚して、2人の女性がいます。\n子供まで。すると彼女は、彼女のお母さんはうちの銀行に友達がいるから......と言うのです。",
      "title": "銀行に密告されるまでの期間は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在使用cashapp进行BTC 2021的购买。在购买了大约4千美元的\n我的岳母告诉我妻子，我在购买毒品或与其他女人约会。\n妇人。\n\n我问她这一切是怎么来的，因为我们有一个体面的婚姻，甚至有两个孩子。\n甚至还有两个孩子。然后她告诉我，她妈妈有朋友在我们银行....。",
      "title": "要到什么时候你的银行才会告发你？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在使用cashapp進行BTC 2021的購買。在購買了大約4千美元的\n我的岳母告訴我妻子，我在購買毒品或與其他女人約會。\n婦人。\n\n我問她這一切是怎麼來的，因爲我們有一個體面的婚姻，甚至有兩個孩子。\n甚至還有兩個孩子。然後她告訴我，她媽媽有朋友在我們銀行....。",
      "title": "要到什麼時候你的銀行纔會告發你？"
    }
  ]
}