{
  "author": "cfg17291",
  "original_created_utc": 1625574707,
  "title": "I'm leaving Barclays. Looking for crypto-compatible bank suggestions!",
  "created_utc": 1625600058,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday a lot of us in the UK got a text from Barclays bank, saying they were no longer allowing us to send money to Binance. The pathetic excuse that they gave is: &quot;This is to help keep your money safe.&quot;</p>\n\n<p>This is obviously a lie. They&#39;re taking any excuse they can to hold on to their centralised power. It would take them 5 minutes to write a small legal document with a &quot;Click to Agree&quot; button before sending money to certain flagged companies. But of course this is personal for them. </p>\n\n<p>Now I&#39;m looking to move whatever fiat I have left to another bank, so I&#39;m asking for suggestions to my UK friends! Thanks in advance :)</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/oetz11/im_leaving_barclays_looking_for_cryptocompatible/",
  "subreddit": "CryptoCurrency",
  "id": "oetz11",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday a lot of us in the UK got a text from Barclays bank, saying they were\nno longer allowing us to send money to Binance. The pathetic excuse that they\ngave is: \"This is to help keep your money safe.\"\n\nThis is obviously a lie. They're taking any excuse they can to hold on to their\ncentralised…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、イギリスの多くの人がBarclays銀行からテキストを受け取りました。\nBinanceへの送金ができなくなったというメールが届きました。彼らの哀れな言い訳は\n哀れな言い訳は \"これはあなたのお金を安全に保つためです。\"\n\nこれは明らかに嘘です。彼らは自分たちの中央集権的なシステムを維持するためにどんな言い訳もしています。\n中央集権的な...",
      "title": "バークレイズを辞めます。暗号互換性のある銀行の提案を探しています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天，我们很多英国人收到巴克莱银行的短信，说他们不再允许我们向Binance汇款。\n不再允许我们向Binance汇款。他们给出的可怜的借口是\n他们给出的可怜的借口是。\"这是为了帮助保持你的资金安全\"。\n\n这显然是一个谎言。他们正在利用任何借口来坚持他们的\n集中管理...",
      "title": "我正在离开巴克莱银行。寻找与加密货币兼容的银行建议!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天，我們很多英國人收到巴克萊銀行的短信，說他們不再允許我們向Binance匯款。\n不再允許我們向Binance匯款。他們給出的可憐的藉口是\n他們給出的可憐的藉口是。\"這是爲了幫助保持你的資金安全\"。\n\n這顯然是一個謊言。他們正在利用任何藉口來堅持他們的\n集中管理...",
      "title": "我正在離開巴克萊銀行。尋找與加密貨幣兼容的銀行建議!"
    }
  ]
}