{
  "author": "ismirschlecht",
  "original_created_utc": 1654072696,
  "title": "A fact ignored by most crypto investors: profits in crypto are (still) other investor's losses.",
  "created_utc": 1654094215,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;How often did I read something like &amp;quot;crypto can help the little men to escape poverty&amp;quot; or &amp;quot;it could make us all financially independent&amp;quot;. Yesterday (I believe) someone posted a study claiming that the average crypto investor knows a lot about crypto, but a lot less about our financial system than the average stock investor and this comes as no surprise.&lt;/p&gt;\n\n&lt;p&gt;You can roast me for this one, but I&amp;#39;ve just made a graph showing what&amp;#39;s happening:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/o4hlqoafuy291.png?width=472&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c533be63c07d0a13c03f7ef1396f5a8163ad6999\"&gt; zero-sum situation, crypto style&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Investor A makes a quick buck, the early adopter got his big gains for free and investor B... well, he&amp;#39;s paying for it the moment he&amp;#39;s buying his investment and holding his bag.&lt;/p&gt;\n\n&lt;p&gt;A lot of people thought they&amp;#39;ve lost their money in Luna and it just got burnt. No, it isn&amp;#39;t. Your money now belongs to those who became rich or at least had gains selling LUNA in the right moment.&lt;/p&gt;\n\n&lt;p&gt;As long as we don&amp;#39;t have a real product connected to the real world (where other people are willing to pay money for), we do not have more than a zero-sum game.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/v2c9h5/a_fact_ignored_by_most_crypto_investors_profits/",
  "subreddit": "CryptoCurrency",
  "id": "v2c9h5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "How often did I read something like \"crypto can help the little men to escape\npoverty\" or \"it could make us all financially independent\". Yesterday (I\nbelieve) someone posted a study claiming that the average crypto investor knows\na lot about crypto, but a lot less about our financial system than…"
}