{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "This is a response to a multitude of posts I've seen attempting to waive away the current Fed path as no big deal. This is not a doom post. The economy is unlikely to face a major recession any time soon. The pain in stocks on the other hand, is almost certain to continue for a while and may be pretty bad before it's all over. Not all rate hike cycles are the same. The total increase in rates matters, the speed of hikes matter, what is happening in the broader economy matters. But many of these posts leave all of that context out. A lot of you I think are relying on misleading, overly simplistic, devoid of context arguments to inform your thinking and it will probably result in losing money.  \n\nMany people on this board seem to have little knowledge of markets before 2020. Hopefully this provides some education, and convinces you to proceed with caution. The last three years (yes, I'm intentionally including 2019, pre-pandemic) are highly abnormal and almost certainly will not continue. So if your frame of reference for what's normal is the last three years, read on, and seriously consider reducing your risk exposure.\n\nYou've probably seen a number of posts like this, implying monetary tightening is no big deal and you should just shrug it off:\n\n*Market returns during Fed rate hike cycles:*\n\n*Aug 1954 - Oct 1957: 14%*  \n*Jun 1958 - Nov 1959: 24%*  \n*Aug 1961 - Nov 1966: 7%*  \n*Aug 1967 - Aug 1969: 4%*  \n*Mar 1972 - Jul 1974: -9%*  \n*Feb 1977 - Jun 1981: 11%*  \n*Mar 1983 - Aug 1984: 13%*  \n*Jan 1987 - May 1989: 16%*  \n*Feb 1994 - Feb 1995: 4%*  \n*Jun 1999 - May 2000: 10%*  \n*Jun 2004 - Jun 2006: 8%*  \n*Dec 2015 - Dec 2018: 8%* \n\nThe implication is that what the Fed does is no big deal, and a lot of people seem to believe that. Or more likely, nervously convince themselves it's true, because they want it to be. \n\n**TLDR:** \n\n1. Monetary tightening is bad for stocks. This is indisputably true. That doesn't necessarily mean stocks will decline during monetary tightening. If they rise, it will be less than they would if monetary policy were eased. Stocks often decline soon after a rate hike cycle or at some point during the cycle, but the numbers above don't show you that. Conveniently.\n2. Quantitative easing has completely changed the picture. Pre-QE references are not comparable. The combination of high inflation, QT and rapidly rising rates happening simultaneously has no historical comparison. And it is likely to cause a significant bear market.\n3. Don't fight the Fed.\n\n**Refer to:**\n\nS&amp;P 500 P/E: [https://www.multpl.com/s-p-500-pe-ratio](https://www.multpl.com/s-p-500-pe-ratio)\n\nShiller P/E Ratio (CAPE): [https://www.multpl.com/shiller-pe](https://www.multpl.com/shiller-pe)\n\nFed Balance Sheet: [https://www.federalreserve.gov/monetarypolicy/bst\\_recenttrends.htm#:\\~:text=Charts%20are%20generally%20updated%20at,4%3A30%20ET%20on%20Thursdays](https://www.federalreserve.gov/monetarypolicy/bst_recenttrends.htm#:~:text=Charts%20are%20generally%20updated%20at,4%3A30%20ET%20on%20Thursdays).\n\nFed Funds Rate: [https://www.macrotrends.net/2015/fed-funds-rate-historical-chart](https://www.macrotrends.net/2015/fed-funds-rate-historical-chart)\n\nS&amp;P 500 Chart: [https://www.macrotrends.net/2324/sp-500-historical-chart-data](https://www.macrotrends.net/2324/sp-500-historical-chart-data)\n\n**Why is this different than other rate hike cycles?**\n\nQT and rate hikes have only occurred once, at a much smaller scale than what we're facing now, and it caused a bear market. During any of the previous rate hike cycles, QE/QT did not exist.\n\nShrugging off the current path of  the Fed is I think going to result in a lot of pain for anyone who tries to do it. Arguments like the above ignore an awful lot of context. Such as: \n\n* Many of these rate hike cycles did in fact cause bear markets. Just not immediately. Bear markets did occur during the rate hike cycles or soon after. Some of them were quite painful.\n* What was happening with the economy? Generally the Fed has, and should, raise rates at the start of economic expansion, and lower rates as growth slows or contracts. That is the path many previous rate hike cycles followed. Is that where we are now? No it isn't. The Fed is tightening as growth has peaked and is about to slow. Facing headwinds from inflation and supply disruptions. The economy, and stock markets, are better able to withstand tightening when an expansion phase is ramping up than when peaked and is facing many headwinds to growth.\n* Quantitative tightening is a much bigger bomb than the Fed funds rate. QT is almost entirely unstudied because it has not happened on a meaningful scale. **The only example of QT we have, caused a bear market that did not reverse until the Fed reversed.**\n* Stock valuations by any measure are extreme by historical standards. Previous monetary tightening cycles generally began with more historically normal valuations.\n\nStocks valuations are in bubble territory by historical valuation metrics. This isn't disputable, so if you're thinking of trying, don't. You might have convinced yourself that something is different now and the new, much higher than historical valuations are justified for reasons. It's possible you're right, but probably not. High valuations can generally only be supported by low interest rates and QE. Both of these are ending. \n\nValuation using CAPE, we are at a multi decade high, only the dot com bubble has exceeded current valuations. Even during the roaring 20s, which preceded the great depression, valuations did not reach the levels they are at now.\n\nValuation by S&amp;P 500 P/E, we were in the mid 20s at the start of the year. Which is higher than nearly any point in history, other than dot com. Estimated now at around 21 thanks to this little correction. Which is still very high by historical standards. S&amp;P 500 P/E over 20 has never been sustained for long outside of bubbles or when propelled by QE.\n\nMost Fed tightening cycles did include significant periods of pain in stock markets. Or were followed soon after. Though the no big dealers present it in a way that you don't see that. \n\nRight now, we have a stock market bubble, an over heated economy, high inflation, and an aggressively tightening Fed. This combination of factors has no precedent in post-WW2 US history.\n\n**Extreme Valuation Peaks:**\n\n*Roaring 20s - September 1929*\n\nCAPE: 32.56\n\nS&amp;P 500 P/E: 20.17\n\n*Dot Com - Mid 2020*\n\nCAPE: 42.87\n\nS&amp;P 500 P/E: 28.50\n\n*November 2021*\n\nCAPE: 38.58\n\nS&amp;P 500 P/E: 24.5\n\nThe previous two peaks were followed by massive losses in stocks that did not recover for more than a decade.\n\n**Rate hikes plus QT**\n\nBulls are dramatically underestimating the impact of simultaneous rate hikes and QT, at a time the economy has already peaked and growth is going to slow. There is no historical precedent for this.\n\nQE first happened in the US in 2009. QE continued through November 2017. At that point the Fed began a slow QT process. The Fed had previously begun raising rates in 2015. This was a slow rate hike cycle at a rate of about 25bp every 3-6 months. In November 2017, the Fed announce QT. This started fairly slow, and progressed to a moderate pace. All told, QT lasted from November 2017 to August 2019. The Fed balance sheet contracted from 4.45 trillion to 3.76 trillion. A rate of about 31 billion a month.\n\nThe combination of rising rates and QT caused a bear market in the fall of 2018. It ended when the Fed pledged to stop raising rates in December 2018. Then, even though the economy was fine, the Fed started cutting rates in 2019 and resumed QE. The resumption of QE astonished many analysts. The Fed in fact didn't call it QE, though it clearly was. So what was this? This was the Fed put. Stock and bond markets ballooned in 2019, the beginning of the Fed induced acceleration of one of the largest asset bubbles in US history. All because of printed money from the Fed, at a time it was not needed to support the economy. It's important to note, risk assets were not exactly cheap by historical measures before 2019.\n\n**Where are we now**\n\nLet's compare now to 2018, the only other time QT has happened, alongside rate hikes. \n\nFrom 2015-2018, the Fed hiked rates around 25bp a quarter. Today, we're looking at 50bp a month, for probably 3 months, followed by 25bp a month. A rate of increase around 5 times faster than 2015-2018. \n\nFrom November 2017 through August 2019, the Fed reduced its balance sheet by an average of 31 billion a month. Today, we're looking at 95 billion a month. A rate 3 times faster.\n\nA bear market began in September 2018 in response to QT and rising rates. The bear market of 2018 did not stop until the Fed stopped raising rates. QT ended soon after, and was followed by more QE. What happened? In 2018, inflation was not a problem. So the Fed Put was able to kick in. The Fed came to the rescue of the stock and bond markets. Can this happen now? No, not any time soon. The Fed has to fight inflation. There will be no Fed put to save stocks this time, not soon anyway.\n\nValuations were less extreme at the start of the 2018 bear market.\n\n*September 2018*\n\nCAPE: 32.62\n\nS&amp;P 500 P/E: 22.52\n\n*November 2021*\n\nCAPE: 38.58\n\nS&amp;P 500 P/E: 24.52\n\n**Previous Rate Hike Cycles:**\n\nYou don't really need to continue reading if you don't want to. But important context is provided for each rate hike cycle. Most of these were not exactly raging bull markets, and in many ways were not remotely comparable to where we are now.\n\nAug 1954 - Oct 1957: 14%\n\n* The US exited a recession in May 1954. \n* The Fed raised rates into an economic expansion from around 1.5% to 3% over the course of about a year and a half. Briefly touching 3.5%, upon which a recession immediately followed. \n* Bear market from 1956 to 1957\n* CAPE and S&amp;P 500 P/E in the mid teens\n\nJun 1958 - Nov 1959: 24%\n\n* The US exited a recession in April 1958. \n* The Fed raised rates into an economic expansion from around 1.5% to 4% over the course of about a year. A recession followed in April 1960.\n* Stocks dropped from 1959 to 1960 but did not officially enter a bear market\n* CAPE and S&amp;P 500 P/E in the mid teens\n\nAug 1961 - Nov 1966: 7%\n\n* The US exited a recession in January 1961. \n* The Fed raised rates into an economic expansion to 6% over about 4 years. Worth noting this coincided with one of the longest and strongest US economic expansions. It included the Vietnam war and expansive fiscal policy.\n* Bear markets in '61 and '66\n* CAPE and S&amp;P 500 P/E in the high teens to low 20s\n\nThe inflation era from the late 60s to early 80s. I'm going to talk about this qualitatively  because looking at the numbers above is meaningless. You might look at the numbers above and think, oh look, 1977-1981, those were pretty good years in the market. No, it absolutely wasn't. Inflation outpaced market gains. \n\nOn an inflation adjusted basis, the S&amp;P 500 was in nearly a 15 year bear market from 1968-1982. On an inflation adjusted basis, the market declined 65% over 15 years. This does not account for dividends. It was absolutely brutal. P/E on the S&amp;P 500 declined deep into single digits. Yes, that's right, for all you who think a P/E of 20 is cheap, single digits. I believe it bottomed around 6-7. CAPE also declined into the single digits. Why? Stagflation. Interestingly, now is the first time since then that any serious person is seriously suggesting we may enter a period of stagflation.\n\nMar 1983 - Aug 1984: 13%\n\n* The US exited a brutal recession in December 1982. The recession was caused by, you guessed it, The Volcker Fed fighting inflation. Sound familiar? As a reminder (see above) stock valuations were at rock bottom before this rate hike cycle due to a brutal recession. In March 1983, when this rate hike cycle began, P/E was 12.23. A year earlier, it was 7.5. CAPE was at 9.23, a year earlier it was 6.95. This doesn't sound much like where we are today does it?\n* The Fed raised rates into an economic expansion\n* Remember, stocks were exiting a period where P/E had been driven down to single digits. By the end of 1984, S&amp;P 500 P/E and CAPE had risen to 10. When valuations are low enough, stocks can rise even in the face of rising rates. But we don't have low valuations now do we?\n\nJan 1987 - May 1989: 16%\n\n* This period included Black Monday\n* The phrase Greenspan put is born (which would later become the Fed put) following Black Monday. In other words, calling this a rate hike cycle leaves out important context. There was an enormous market crash, and the Fed responded immediately by cutting rates. Only raising rates again once the market had stabilized. Without the Fed put when the market crashed, this period would likely not have been so great.\n* CAPE low 20s. S&amp;P 500 P/E had risen to low 20s before Black Monday, collapsing to low double digits.\n\nFeb 1994 - Feb 1995: 4%\n\n* The Fed raised rates from about 3% to about 6%\n* Stocks went pretty much nowhere. Declining overall on an inflation adjusted basis. There were a couple of significant corrections in this period. At no point was there a rally above the 1994 highs until the fed stopped raising rates.\n* CAPE low 20s, S&amp;P 500 P/E declines from low 20s to mid teens\n\nJun 1999 - May 2000: 10%\n\n* Fed raises rates from around 4.5% to around  6.5%\n* It's hilarious to suggest stocks did fine here, as the Fed rate hikes, among other events, popped the dot com bubble. Which was one of the most brutal multi year periods in market history. Stocks would not recover to the 2000 highs for almost 15 years.\n\nJun 2004 - Jun 2006: 8%\n\n* Another bubble is forming, this time in housing and synthetic mortgage securities. These Fed rate hikes are one reason for that bubble popping, which caused a 60% draw down in the S&amp;P 500.\n\nDec 2015 - Dec 2018: 8%\n\n* We are now in a QE world\n* As a result of slow rate hikes and modest QT beginning in late 2017, a bear market forms in the fall of 2018.\n* The bear market stops only when the Fed reverses course. Cuts rates and resumes QE.",
  "author_fullname": "t2_55vb4r4j",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Don't Be Fooled. This Environment has no Historical Precedent",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_ub2onv",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.89,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 45,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 45,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1650829704,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a response to a multitude of posts I&amp;#39;ve seen attempting to waive away the current Fed path as no big deal. This is not a doom post. The economy is unlikely to face a major recession any time soon. The pain in stocks on the other hand, is almost certain to continue for a while and may be pretty bad before it&amp;#39;s all over. Not all rate hike cycles are the same. The total increase in rates matters, the speed of hikes matter, what is happening in the broader economy matters. But many of these posts leave all of that context out. A lot of you I think are relying on misleading, overly simplistic, devoid of context arguments to inform your thinking and it will probably result in losing money.  &lt;/p&gt;\n\n&lt;p&gt;Many people on this board seem to have little knowledge of markets before 2020. Hopefully this provides some education, and convinces you to proceed with caution. The last three years (yes, I&amp;#39;m intentionally including 2019, pre-pandemic) are highly abnormal and almost certainly will not continue. So if your frame of reference for what&amp;#39;s normal is the last three years, read on, and seriously consider reducing your risk exposure.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve probably seen a number of posts like this, implying monetary tightening is no big deal and you should just shrug it off:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Market returns during Fed rate hike cycles:&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Aug 1954 - Oct 1957: 14%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Jun 1958 - Nov 1959: 24%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Aug 1961 - Nov 1966: 7%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Aug 1967 - Aug 1969: 4%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Mar 1972 - Jul 1974: -9%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Feb 1977 - Jun 1981: 11%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Mar 1983 - Aug 1984: 13%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Jan 1987 - May 1989: 16%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Feb 1994 - Feb 1995: 4%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Jun 1999 - May 2000: 10%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Jun 2004 - Jun 2006: 8%&lt;/em&gt;&lt;br/&gt;\n&lt;em&gt;Dec 2015 - Dec 2018: 8%&lt;/em&gt; &lt;/p&gt;\n\n&lt;p&gt;The implication is that what the Fed does is no big deal, and a lot of people seem to believe that. Or more likely, nervously convince themselves it&amp;#39;s true, because they want it to be. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR:&lt;/strong&gt; &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Monetary tightening is bad for stocks. This is indisputably true. That doesn&amp;#39;t necessarily mean stocks will decline during monetary tightening. If they rise, it will be less than they would if monetary policy were eased. Stocks often decline soon after a rate hike cycle or at some point during the cycle, but the numbers above don&amp;#39;t show you that. Conveniently.&lt;/li&gt;\n&lt;li&gt;Quantitative easing has completely changed the picture. Pre-QE references are not comparable. The combination of high inflation, QT and rapidly rising rates happening simultaneously has no historical comparison. And it is likely to cause a significant bear market.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t fight the Fed.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;Refer to:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;S&amp;amp;P 500 P/E: &lt;a href=\"https://www.multpl.com/s-p-500-pe-ratio\"&gt;https://www.multpl.com/s-p-500-pe-ratio&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Shiller P/E Ratio (CAPE): &lt;a href=\"https://www.multpl.com/shiller-pe\"&gt;https://www.multpl.com/shiller-pe&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Fed Balance Sheet: &lt;a href=\"https://www.federalreserve.gov/monetarypolicy/bst_recenttrends.htm#:%7E:text=Charts%20are%20generally%20updated%20at,4%3A30%20ET%20on%20Thursdays\"&gt;https://www.federalreserve.gov/monetarypolicy/bst_recenttrends.htm#:~:text=Charts%20are%20generally%20updated%20at,4%3A30%20ET%20on%20Thursdays&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Fed Funds Rate: &lt;a href=\"https://www.macrotrends.net/2015/fed-funds-rate-historical-chart\"&gt;https://www.macrotrends.net/2015/fed-funds-rate-historical-chart&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;S&amp;amp;P 500 Chart: &lt;a href=\"https://www.macrotrends.net/2324/sp-500-historical-chart-data\"&gt;https://www.macrotrends.net/2324/sp-500-historical-chart-data&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Why is this different than other rate hike cycles?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;QT and rate hikes have only occurred once, at a much smaller scale than what we&amp;#39;re facing now, and it caused a bear market. During any of the previous rate hike cycles, QE/QT did not exist.&lt;/p&gt;\n\n&lt;p&gt;Shrugging off the current path of  the Fed is I think going to result in a lot of pain for anyone who tries to do it. Arguments like the above ignore an awful lot of context. Such as: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Many of these rate hike cycles did in fact cause bear markets. Just not immediately. Bear markets did occur during the rate hike cycles or soon after. Some of them were quite painful.&lt;/li&gt;\n&lt;li&gt;What was happening with the economy? Generally the Fed has, and should, raise rates at the start of economic expansion, and lower rates as growth slows or contracts. That is the path many previous rate hike cycles followed. Is that where we are now? No it isn&amp;#39;t. The Fed is tightening as growth has peaked and is about to slow. Facing headwinds from inflation and supply disruptions. The economy, and stock markets, are better able to withstand tightening when an expansion phase is ramping up than when peaked and is facing many headwinds to growth.&lt;/li&gt;\n&lt;li&gt;Quantitative tightening is a much bigger bomb than the Fed funds rate. QT is almost entirely unstudied because it has not happened on a meaningful scale. &lt;strong&gt;The only example of QT we have, caused a bear market that did not reverse until the Fed reversed.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Stock valuations by any measure are extreme by historical standards. Previous monetary tightening cycles generally began with more historically normal valuations.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Stocks valuations are in bubble territory by historical valuation metrics. This isn&amp;#39;t disputable, so if you&amp;#39;re thinking of trying, don&amp;#39;t. You might have convinced yourself that something is different now and the new, much higher than historical valuations are justified for reasons. It&amp;#39;s possible you&amp;#39;re right, but probably not. High valuations can generally only be supported by low interest rates and QE. Both of these are ending. &lt;/p&gt;\n\n&lt;p&gt;Valuation using CAPE, we are at a multi decade high, only the dot com bubble has exceeded current valuations. Even during the roaring 20s, which preceded the great depression, valuations did not reach the levels they are at now.&lt;/p&gt;\n\n&lt;p&gt;Valuation by S&amp;amp;P 500 P/E, we were in the mid 20s at the start of the year. Which is higher than nearly any point in history, other than dot com. Estimated now at around 21 thanks to this little correction. Which is still very high by historical standards. S&amp;amp;P 500 P/E over 20 has never been sustained for long outside of bubbles or when propelled by QE.&lt;/p&gt;\n\n&lt;p&gt;Most Fed tightening cycles did include significant periods of pain in stock markets. Or were followed soon after. Though the no big dealers present it in a way that you don&amp;#39;t see that. &lt;/p&gt;\n\n&lt;p&gt;Right now, we have a stock market bubble, an over heated economy, high inflation, and an aggressively tightening Fed. This combination of factors has no precedent in post-WW2 US history.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Extreme Valuation Peaks:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Roaring 20s - September 1929&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;CAPE: 32.56&lt;/p&gt;\n\n&lt;p&gt;S&amp;amp;P 500 P/E: 20.17&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Dot Com - Mid 2020&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;CAPE: 42.87&lt;/p&gt;\n\n&lt;p&gt;S&amp;amp;P 500 P/E: 28.50&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;November 2021&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;CAPE: 38.58&lt;/p&gt;\n\n&lt;p&gt;S&amp;amp;P 500 P/E: 24.5&lt;/p&gt;\n\n&lt;p&gt;The previous two peaks were followed by massive losses in stocks that did not recover for more than a decade.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Rate hikes plus QT&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Bulls are dramatically underestimating the impact of simultaneous rate hikes and QT, at a time the economy has already peaked and growth is going to slow. There is no historical precedent for this.&lt;/p&gt;\n\n&lt;p&gt;QE first happened in the US in 2009. QE continued through November 2017. At that point the Fed began a slow QT process. The Fed had previously begun raising rates in 2015. This was a slow rate hike cycle at a rate of about 25bp every 3-6 months. In November 2017, the Fed announce QT. This started fairly slow, and progressed to a moderate pace. All told, QT lasted from November 2017 to August 2019. The Fed balance sheet contracted from 4.45 trillion to 3.76 trillion. A rate of about 31 billion a month.&lt;/p&gt;\n\n&lt;p&gt;The combination of rising rates and QT caused a bear market in the fall of 2018. It ended when the Fed pledged to stop raising rates in December 2018. Then, even though the economy was fine, the Fed started cutting rates in 2019 and resumed QE. The resumption of QE astonished many analysts. The Fed in fact didn&amp;#39;t call it QE, though it clearly was. So what was this? This was the Fed put. Stock and bond markets ballooned in 2019, the beginning of the Fed induced acceleration of one of the largest asset bubbles in US history. All because of printed money from the Fed, at a time it was not needed to support the economy. It&amp;#39;s important to note, risk assets were not exactly cheap by historical measures before 2019.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Where are we now&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s compare now to 2018, the only other time QT has happened, alongside rate hikes. &lt;/p&gt;\n\n&lt;p&gt;From 2015-2018, the Fed hiked rates around 25bp a quarter. Today, we&amp;#39;re looking at 50bp a month, for probably 3 months, followed by 25bp a month. A rate of increase around 5 times faster than 2015-2018. &lt;/p&gt;\n\n&lt;p&gt;From November 2017 through August 2019, the Fed reduced its balance sheet by an average of 31 billion a month. Today, we&amp;#39;re looking at 95 billion a month. A rate 3 times faster.&lt;/p&gt;\n\n&lt;p&gt;A bear market began in September 2018 in response to QT and rising rates. The bear market of 2018 did not stop until the Fed stopped raising rates. QT ended soon after, and was followed by more QE. What happened? In 2018, inflation was not a problem. So the Fed Put was able to kick in. The Fed came to the rescue of the stock and bond markets. Can this happen now? No, not any time soon. The Fed has to fight inflation. There will be no Fed put to save stocks this time, not soon anyway.&lt;/p&gt;\n\n&lt;p&gt;Valuations were less extreme at the start of the 2018 bear market.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;September 2018&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;CAPE: 32.62&lt;/p&gt;\n\n&lt;p&gt;S&amp;amp;P 500 P/E: 22.52&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;November 2021&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;CAPE: 38.58&lt;/p&gt;\n\n&lt;p&gt;S&amp;amp;P 500 P/E: 24.52&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Previous Rate Hike Cycles:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t really need to continue reading if you don&amp;#39;t want to. But important context is provided for each rate hike cycle. Most of these were not exactly raging bull markets, and in many ways were not remotely comparable to where we are now.&lt;/p&gt;\n\n&lt;p&gt;Aug 1954 - Oct 1957: 14%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The US exited a recession in May 1954. &lt;/li&gt;\n&lt;li&gt;The Fed raised rates into an economic expansion from around 1.5% to 3% over the course of about a year and a half. Briefly touching 3.5%, upon which a recession immediately followed. &lt;/li&gt;\n&lt;li&gt;Bear market from 1956 to 1957&lt;/li&gt;\n&lt;li&gt;CAPE and S&amp;amp;P 500 P/E in the mid teens&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Jun 1958 - Nov 1959: 24%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The US exited a recession in April 1958. &lt;/li&gt;\n&lt;li&gt;The Fed raised rates into an economic expansion from around 1.5% to 4% over the course of about a year. A recession followed in April 1960.&lt;/li&gt;\n&lt;li&gt;Stocks dropped from 1959 to 1960 but did not officially enter a bear market&lt;/li&gt;\n&lt;li&gt;CAPE and S&amp;amp;P 500 P/E in the mid teens&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Aug 1961 - Nov 1966: 7%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The US exited a recession in January 1961. &lt;/li&gt;\n&lt;li&gt;The Fed raised rates into an economic expansion to 6% over about 4 years. Worth noting this coincided with one of the longest and strongest US economic expansions. It included the Vietnam war and expansive fiscal policy.&lt;/li&gt;\n&lt;li&gt;Bear markets in &amp;#39;61 and &amp;#39;66&lt;/li&gt;\n&lt;li&gt;CAPE and S&amp;amp;P 500 P/E in the high teens to low 20s&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The inflation era from the late 60s to early 80s. I&amp;#39;m going to talk about this qualitatively  because looking at the numbers above is meaningless. You might look at the numbers above and think, oh look, 1977-1981, those were pretty good years in the market. No, it absolutely wasn&amp;#39;t. Inflation outpaced market gains. &lt;/p&gt;\n\n&lt;p&gt;On an inflation adjusted basis, the S&amp;amp;P 500 was in nearly a 15 year bear market from 1968-1982. On an inflation adjusted basis, the market declined 65% over 15 years. This does not account for dividends. It was absolutely brutal. P/E on the S&amp;amp;P 500 declined deep into single digits. Yes, that&amp;#39;s right, for all you who think a P/E of 20 is cheap, single digits. I believe it bottomed around 6-7. CAPE also declined into the single digits. Why? Stagflation. Interestingly, now is the first time since then that any serious person is seriously suggesting we may enter a period of stagflation.&lt;/p&gt;\n\n&lt;p&gt;Mar 1983 - Aug 1984: 13%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The US exited a brutal recession in December 1982. The recession was caused by, you guessed it, The Volcker Fed fighting inflation. Sound familiar? As a reminder (see above) stock valuations were at rock bottom before this rate hike cycle due to a brutal recession. In March 1983, when this rate hike cycle began, P/E was 12.23. A year earlier, it was 7.5. CAPE was at 9.23, a year earlier it was 6.95. This doesn&amp;#39;t sound much like where we are today does it?&lt;/li&gt;\n&lt;li&gt;The Fed raised rates into an economic expansion&lt;/li&gt;\n&lt;li&gt;Remember, stocks were exiting a period where P/E had been driven down to single digits. By the end of 1984, S&amp;amp;P 500 P/E and CAPE had risen to 10. When valuations are low enough, stocks can rise even in the face of rising rates. But we don&amp;#39;t have low valuations now do we?&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Jan 1987 - May 1989: 16%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;This period included Black Monday&lt;/li&gt;\n&lt;li&gt;The phrase Greenspan put is born (which would later become the Fed put) following Black Monday. In other words, calling this a rate hike cycle leaves out important context. There was an enormous market crash, and the Fed responded immediately by cutting rates. Only raising rates again once the market had stabilized. Without the Fed put when the market crashed, this period would likely not have been so great.&lt;/li&gt;\n&lt;li&gt;CAPE low 20s. S&amp;amp;P 500 P/E had risen to low 20s before Black Monday, collapsing to low double digits.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Feb 1994 - Feb 1995: 4%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The Fed raised rates from about 3% to about 6%&lt;/li&gt;\n&lt;li&gt;Stocks went pretty much nowhere. Declining overall on an inflation adjusted basis. There were a couple of significant corrections in this period. At no point was there a rally above the 1994 highs until the fed stopped raising rates.&lt;/li&gt;\n&lt;li&gt;CAPE low 20s, S&amp;amp;P 500 P/E declines from low 20s to mid teens&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Jun 1999 - May 2000: 10%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Fed raises rates from around 4.5% to around  6.5%&lt;/li&gt;\n&lt;li&gt;It&amp;#39;s hilarious to suggest stocks did fine here, as the Fed rate hikes, among other events, popped the dot com bubble. Which was one of the most brutal multi year periods in market history. Stocks would not recover to the 2000 highs for almost 15 years.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Jun 2004 - Jun 2006: 8%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Another bubble is forming, this time in housing and synthetic mortgage securities. These Fed rate hikes are one reason for that bubble popping, which caused a 60% draw down in the S&amp;amp;P 500.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Dec 2015 - Dec 2018: 8%&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;We are now in a QE world&lt;/li&gt;\n&lt;li&gt;As a result of slow rate hikes and modest QT beginning in late 2017, a bear market forms in the fall of 2018.&lt;/li&gt;\n&lt;li&gt;The bear market stops only when the Fed reverses course. Cuts rates and resumes QE.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "ub2onv",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "MrRikleman",
  "discussion_type": null,
  "num_comments": 27,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/ub2onv/dont_be_fooled_this_environment_has_no_historical/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/ub2onv/dont_be_fooled_this_environment_has_no_historical/",
  "subreddit_subscribers": 3939429,
  "created_utc": 1650833823,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1650829704,
  "the_new_excerpt": "This is a response to a multitude of posts I've seen attempting to waive away\nthe current Fed path as no big deal. This is not a doom post. The economy is\nunlikely to face a major recession any time soon. The pain in stocks on the\nother hand, is almost certain to continue for a while and may be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、現在のFRBの動きを大したことないとして放棄しようとする多くの投稿を目にしたことへの返答です。\nへの反論です。これは悲観的な投稿ではありません。経済は\nすぐに大きな景気後退に直面することはないだろう。しかし、株価の下落は今後も続くだろう。\n一方、株の痛みはしばらく続くことがほぼ確実で、その可能性もある。",
      "title": "Don't Be Fooled. この環境には歴史的な前例がない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是对我所看到的许多帖子的回应，这些帖子试图放弃\n目前的美联储路径没有什么大不了的。这不是一个厄运的帖子。经济是\n经济不太可能在短期内面临重大衰退。另一方面，股票的痛苦\n另一方面，几乎可以肯定会持续一段时间，而且可能是...",
      "title": "不要被愚弄。这种环境没有历史先例"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是對我所看到的許多帖子的回應，這些帖子試圖放棄\n目前的美聯儲路徑沒有什麼大不了的。這不是一個厄運的帖子。經濟是\n經濟不太可能在短期內面臨重大衰退。另一方面，股票的痛苦\n另一方面，幾乎可以肯定會持續一段時間，而且可能是...",
      "title": "不要被愚弄。這種環境沒有歷史先例"
    }
  ]
}