{
  "author": "CorpoCat",
  "the_new_excerpt": "I just realized I'm not sure what she actually said to cause this cancellation\nof her, so I went to google to see the tweets. I found nothing transphobic in\nthem, or maybe I read the wrong articles?\n\nI'm not defending her, but neither am I condemning her for anything - I'm\nassuming I don't have the…",
  "original_created_utc": 1622629652,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今気づいたのですが、彼女が実際に何を言ってこのようなキャンセルをしたのかよくわからないので\nで、そのツイートを見るためにgoogleにアクセスしました。トランスフォビア的なものは見当たりませんでした。\nそれとも私が間違った記事を読んでしまったのでしょうか？\n\n私は彼女を擁護しているわけではありませんが、非難しているわけでもありません。\n私が持っていないと仮定して...",
      "title": "なぜ人々はJKローリングがトランスフォビックだと考えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚意识到，我不确定她究竟说了什么，导致这种取消的情况\n的，所以我去谷歌看了一下这些推文。我发现其中没有任何变性人的成分\n他们，或者也许我读错了文章？\n\n我不是在为她辩护，但也不是在谴责她什么--我在\n假设我没有...",
      "title": "为什么人们认为JK罗琳有恐高症？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛意識到，我不確定她究竟說了什麼，導致這種取消的情況\n的，所以我去谷歌看了一下這些推文。我發現其中沒有任何變性人的成分\n他們，或者也許我讀錯了文章？\n\n我不是在爲她辯護，但也不是在譴責她什麼--我在\n假設我沒有...",
      "title": "爲什麼人們認爲JK羅琳有恐高症？"
    }
  ],
  "title": "Why do people consider JK Rowling transphobic?",
  "created_utc": 1622643708,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just realized I&#39;m not sure what she actually said to cause this cancellation of her, so I went to google to see the tweets. I found nothing transphobic in them, or maybe I read the wrong articles?</p>\n\n<p>I&#39;m not defending her, but neither am I condemning her for anything - I&#39;m assuming I don&#39;t have the whole picture. I simply do not see any transphobia in her comments that I&#39;ve seen... Has she been cancelled simply by saying (and explaining why she thinks that) sex is a real concept? That doesn&#39;t sound right, am I missing some crucial part of the discussion, some tweets that are not being quoted in the articles that I have read?</p>\n</div><!-- SC_ON -->",
  "score": 231,
  "permalink": "/r/TooAfraidToAsk/comments/nqio9m/why_do_people_consider_jk_rowling_transphobic/",
  "subreddit": "TooAfraidToAsk",
  "id": "nqio9m",
  "is_self": true,
  "media": null,
  "is_video": false
}