{
  "author": "CryptoMaximalist",
  "original_created_utc": 1635428965,
  "title": "Moon Week 19 - New Governance Polls, the State of the Subreddit, and a Moons Enhancement Prioritization Poll",
  "created_utc": 1635478895,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone and welcome to Moon Week for round 19 of Moons!  </p>\n\n<p>Moon Week began yesterday with <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qh88gy/new_moons_distribution_round_19_proposal/\">the snapshot post by the admins</a>.  Check out the post and comments to see how many moons you&#39;ll be getting next Wednesday at the end of Moon Week.  </p>\n\n<p>To give exposure to our governance polls for the month, this Moon Week post will remain pinned to the top of the subreddit until the distribution post next Wednesday.  <strong>Please review the following important information and frequently asked questions first.  Each month we have dozens of questions about these things even though they are answered right here</strong>:</p>\n\n<ul>\n<li><strong>If you can&#39;t see polls or vote</strong>, or have any other issue, try again later or from a different platform (different browser, app, mobile, or desktop).  These glitches usually resolve themselves within a few hours, but let us know if it hasn&#39;t after a day or two.</li>\n<li><strong>You can&#39;t change your vote</strong> so make sure you read the full post and discussions, and ask any questions you have before you vote.  There are people wishing they voted differently every month and you have several days to vote so there is no need to rush it.</li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/m7ehzz/proposal_5_bonus_moons_for_anyone_who_votes_on/\">You get a 5% bonus for voting in at least 1 poll</a>, plus <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pffoe7/incentivize_voting_in_multiple_polls/\">an additional 1.25% for each additional approved governance poll due to CCIP-014</a></li>\n<li>You will also get a special badge for a week after voting in a governance poll.  These are visible in the reddit app and new.reddit on desktop.  If you have voted and yours is not showing, you may need to enable it manually by clicking your badges and looking at the Achievements tab.</li>\n<li>Successful polls are implemented whenever the mods or admins have a chance to do it.  Usually this is within days or weeks of the poll passing, but depends on workload, priorities, and complexity of implementation</li>\n</ul>\n\n<p>Finally, here are your polls for round 19 of Moons.  Each poll has been given a designated CCIP number, as per <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pxyhhg/implement_numbering_of_proposals_ccips/\">CCIP-017</a> last month.  You can now view <a href=\"https://www.reddit.com/r/CryptoCurrency/wiki/ccip_list\">the full CCIP list here</a>. </p>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qh2l1z/ccip019_disable_live_posts/\">CCIP-019 - Disable Live Posts</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qh7ywl/ccip20_reduce_contribution_points_gained_from/\">CCIP-020 - Reduce Contribution Points Gained From Link Posts by 35%</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qhc2k1/ccip021_temporarily_sort_comments_by_newest_first/\">CCIP-021 - Temporarily sort comments by newest first after a post is submitted</a></li>\n</ul>\n\n<p>And this month we have a bonus non-governance poll for users to express their preferences on which features the admins should prioritize implementing:</p>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qhbo2f/moons_enhancement_prioritization_poll/\">Moons Enhancement Prioritization Poll</a><br/></li>\n</ul>\n\n<p>For more information about Moons, please <a href=\"https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki\">see our wiki page here</a>.</p>\n\n<p>Happy voting!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qhnhf2/moon_week_19_new_governance_polls_the_state_of/",
  "subreddit": "CryptoCurrency",
  "id": "qhnhf2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone and welcome to Moon Week for round 19 of Moons!\n\nMoon Week began yesterday with the snapshot post by the admins\n[https://www.reddit.com/r/CryptoCurrency/comments/qh88gy/new_moons_distribution_round_19_proposal/].\nCheck out the post and comments to see how many moons you'll be getting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは！ムーンウィークでは、ラウンド19のムーンをご紹介します。\n\n昨日、管理人によるスナップショットの投稿でムーンウィークが始まりました。\n[https://www.reddit.com/r/CryptoCurrency/comments/qh88gy/new_moons_distribution_round_19_proposal/]をご覧ください。\nこの投稿とコメントをチェックして、何個のムーンがもらえるか確認してみてくださいね。",
      "title": "Moon Week 19 - 新しいガバナンスの投票、Subredditの状況、そしてMoon強化の優先順位の投票"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，欢迎来到月亮周的第19轮月亮!\n\n月亮周从昨天开始，管理员发布了快照。\n[https://www.reddit.com/r/CryptoCurrency/comments/qh88gy/new_moons_distribution_round_19_proposal/]。\n请看帖子和评论，看看你会得到多少个月亮...",
      "title": "月亮第19周--新的治理民意调查、子论坛的状况和月亮增强的优先次序调查"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，歡迎來到月亮周的第19輪月亮!\n\n月亮周從昨天開始，管理員發佈了快照。\n[https://www.reddit.com/r/CryptoCurrency/comments/qh88gy/new_moons_distribution_round_19_proposal/]。\n請看帖子和評論，看看你會得到多少個月亮...",
      "title": "月亮第19周--新的治理民意調查、子論壇的狀況和月亮增強的優先次序調查"
    }
  ]
}