{
  "author": "Socialinfluencing",
  "original_created_utc": 1655119429,
  "title": "If USDT also collapsed now, the whole crypto market would collapse almost entirely.",
  "created_utc": 1655141971,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s something I just thought about. Everyone and their mother knows Tether isn&amp;#39;t backed by USD 1:1 as they have never been properly audited. &lt;/p&gt;\n\n&lt;p&gt;Everything in the crypto market is propped up by this shady stablecoin, yes even Btc. I think if it somehow collapsed then all things considered, we maybe actually have a scenario where crypto very briefly hits pre 2017-2018 bull market prices.&lt;/p&gt;\n\n&lt;p&gt;In that sense it would truly be a once in a lifetime to get many alts like Eth, Monero and perhaps even super cheap Btc. Since Btc has pretty much taken a Olympic swimming pool sized dump and the market along with it, thought I&amp;#39;d try to speculate a bit positively, well sorta.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/vb9wp6/if_usdt_also_collapsed_now_the_whole_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "vb9wp6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Here's something I just thought about. Everyone and their mother knows Tether\nisn't backed by USD 1:1 as they have never been properly audited.\n\nEverything in the crypto market is propped up by this shady stablecoin, yes even\nBtc. I think if it somehow collapsed then all things considered, we…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで、ふと思ったことがあります。誰もが、そしてその母親も知っているように、Tetherは\nが1:1のドルの裏付けを持っていないことは、誰もが知っています。\n\n暗号市場のすべてが、この怪しげな安定コインによって支えられています。\nBtcもです。もし、テザーが崩壊したら、私たちは...",
      "title": "今、USDTも崩壊したら、暗号市場全体がほとんど崩壊してしまう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我刚刚想到的事情。每个人和他们的母亲都知道Tether\n并不是由美元1:1支持的，因为他们从来没有被适当地审计过。\n\n加密货币市场上的所有东西都是由这个不光彩的稳定币支撑起来的，是的，甚至包括\nBtc。我认为，如果它以某种方式崩溃，那么考虑到所有事情，我们...",
      "title": "如果USDT现在也崩溃了，整个加密货币市场将几乎完全崩溃。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我剛剛想到的事情。每個人和他們的母親都知道Tether\n並不是由美元1:1支持的，因爲他們從來沒有被適當地審計過。\n\n加密貨幣市場上的所有東西都是由這個不光彩的穩定幣支撐起來的，是的，甚至包括\nBtc。我認爲，如果它以某種方式崩潰，那麼考慮到所有事情，我們...",
      "title": "如果USDT現在也崩潰了，整個加密貨幣市場將幾乎完全崩潰。"
    }
  ]
}