{
  "author": "ChuErDHM",
  "the_new_excerpt": "Hi guys. I was told to come here to get a better response. I am too lazy to type\nout my scenario, so I'll just link the old post where I asked the…",
  "original_created_utc": 1623010439,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、皆さん。ここに来ればもっといい返事がもらえると言われました。私は、自分のシナリオをタイプするのが面倒なので\n私のシナリオを入力するのが面倒なので、私が質問した古い記事をリンクしておきます...",
      "title": "余分な資金を課税対象の証券口座に投資するのは賢明なことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，伙计们。有人告诉我，来这里可以得到更好的答复。我太懒了，不能把我的方案打出来\n懒得打出我的方案，所以我就把我问这个问题的旧帖子链接到这里。",
      "title": "将额外的钱投资到应税经纪账户中是明智的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，夥計們。有人告訴我，來這裏可以得到更好的答覆。我太懶了，不能把我的方案打出來\n懶得打出我的方案，所以我就把我問這個問題的舊帖子鏈接到這裏。",
      "title": "將額外的錢投資到應稅經紀賬戶中是明智的嗎？"
    }
  ],
  "title": "Is it wise to invest extra money into a taxable brokerage account?",
  "created_utc": 1623025415,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys. I was told to come here to get a better response. I am too lazy to type out my scenario, so I&#39;ll just link the old post where I asked the question.</p>\n\n<p><a href=\"https://www.reddit.com/r/financialindependence/comments/ntu7z7/how_to_invest_some_extra_money_in_a_savings/?utm_source=share&amp;amp;utm_medium=web2x&amp;amp;context=3\">https://www.reddit.com/r/financialindependence/comments/ntu7z7/how_to_invest_some_extra_money_in_a_savings/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n\n<p>ps: old post was removed so I copy pasta’ed it’s here⬇️⬇️⬇️⬇️⬇️⬇️</p>\n\n<p>How to invest some extra money in a savings account?</p>\n\n<p>Hi guys. I have some extra money in a savings account that I want to invest. I am thinking of dumping these cash into a taxable brokerage account and buying index funds (like swppx)</p>\n\n<p>Is this a good idea? And should I dump my money all at once, or invest it only a monthly basis slowly?</p>\n\n<p>As you can probably tell, I am a complete noob, so bare with me lol :)</p>\n\n<p>ps: I recently moved back with parents and don&#39;t have to pay rent, which is why I am thinking of investing my money rather than saving it for future rent, etc.</p>\n</div><!-- SC_ON -->",
  "score": 31,
  "permalink": "/r/Bogleheads/comments/ntui1w/is_it_wise_to_invest_extra_money_into_a_taxable/",
  "subreddit": "Bogleheads",
  "id": "ntui1w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885445
}