{
  "author": "Set1Less",
  "original_created_utc": 1631026096,
  "title": "The top post is a damn lie. Salvadorians arent being \"forced to accept\" Bitcoin. The truth is that we all are being FORCED to accept devaluing fiat as a currency, across the world. When someone tries to change this status quo, there will be a lot of opposition to it.",
  "created_utc": 1631036493,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Salvadorians arent being forced to accept anything, definitely not forced to accept BTC as the top post guy claims. His whole post is nothing but a lie. Salvadorians now have the option to accept bitcoin as legal tender, not pay capital gain taxes on it, use LN as a payment rails in a country that is without any instant settlement online banking layer. </p>\n\n<p>Forget El Salvador, people across the world are being forced to accept fiat that is rampantly being devalued by central banks. Consider a person who has meagre savings in fiat (even in USD if you consider a Salvadorian), the purchasing power of their savings is losing value all the time. While the US can afford to give its citizens bailouts and relief packages, the governments of other countries that rely on USD cannot do the same. For instance, the El Salvador central bank cannot print a trillion dollars and give all its citizens any package. They are forced to silently suffer while their savings are being devalued. </p>\n\n<p>That whole post smacks of political agenda. When anyone big or small tries to change the status quo from fiat currency that can be manipulated anytime by central bank to a non-sovereign asset backed by power of computing, there is going to be a lot of political backlash, mind games and narratives. Someone who is fiat rich (the ones at the top of the tree right now) is just not going to accept the new paradigm without putting up a fight.</p>\n\n<p>EDIT:</p>\n\n<p>Sources - Just read the bitcoin law text, instead of reading its interpretation from websites or elsewhere. I am linking it for you:</p>\n\n<p><a href=\"https://freopp.org/el-salvadors-bitcoin-law-full-proposed-english-text-9a2153ad1d19\">https://freopp.org/el-salvadors-bitcoin-law-full-proposed-english-text-9a2153ad1d19</a></p>\n\n<blockquote>\n<p>Art. 5. Exchanges in bitcoin will not be subject to capital gains tax, just like any legal tender.</p>\n\n<p>Art. 3. Prices may be expressed in bitcoin.</p>\n\n<p>Art. 4. Tax contributions can be paid in bitcoin.</p>\n</blockquote>\n\n<p>All the above provisions shed regulatory light to people who have BTC and want to spend them. They need not worry about capital gains. This is one of the biggest roadblocks in using BTC or any crypto as currency - even if you want to buy $10 worth meal with crypto, you have to calculate and pay capital gains on that. This makes it silly to use crypto for transactions, and as a result most people dont use crypto for transactions even if they are holding crypto. \nThe El Salvador law directly seeks to remove these obstacles in real crypto adoption. They can even pay state taxes with Bitcoin now. \nThis is the one rule change or law change if every country adopted, will result in exponential adoption of crypto for daily transactions. Currently most countries of the world treat crypto as some form of asset or commodity, and make it impossible to do daily transactions at scale with crypto, because an average user isnt interested in calculating their capital gains on a daily basis </p>\n\n<h1>About accepting Bitcoin not being FORCED on anyone:</h1>\n\n<blockquote>\n<p>Art. 8. Without prejudice to the actions of the private sector, the State shall provide alternatives that allow the user to carry out transactions in bitcoin and have automatic and instant convertibility from bitcoin to USD if they wish. Furthermore, the State will promote the necessary training and mechanisms so that the population can access bitcoin transactions.</p>\n</blockquote>\n\n<p>This means if someone doesn&#39;t want to accept BTC but the customer wants to spend their BTC, the state shall provide alternative to automatically convert it to USD.</p>\n\n<blockquote>\n<p>Art. 12. Those who, by evident and notorious fact, do not have access to the technologies that allow them to carry out transactions in bitcoin are excluded from the obligation expressed in Art. 7 of this law. The State will promote the necessary training and mechanisms so that the population can access bitcoin transactions.</p>\n\n<p>Art. 7. Every economic agent must accept bitcoin as payment when offered to him by whoever acquires a good or service.</p>\n</blockquote>\n\n<p>Article 12 clearly makes it very clear that those who dont have the technology to use BTC are excluded from BTC. However the state will push for education and making the technology accessible for users over time.</p>\n</div><!-- SC_ON -->",
  "score": 454,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/4z_jCQqXhIJNFD6ioVgs6VfoKbe_IwSCtYy54CDhfaA.jpg?auto=webp&s=c210e7baa9df15e97fa70dae0716ac9c2a193faa",
          "width": 1200,
          "height": 799
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/4z_jCQqXhIJNFD6ioVgs6VfoKbe_IwSCtYy54CDhfaA.jpg?width=108&crop=smart&auto=webp&s=b2d340c9c623c1546df97829c132ad40a9a77a33",
            "width": 108,
            "height": 71
          },
          {
            "url": "https://external-preview.redd.it/4z_jCQqXhIJNFD6ioVgs6VfoKbe_IwSCtYy54CDhfaA.jpg?width=216&crop=smart&auto=webp&s=bff4038f235e615ad79f47076b1762e479ddde63",
            "width": 216,
            "height": 143
          },
          {
            "url": "https://external-preview.redd.it/4z_jCQqXhIJNFD6ioVgs6VfoKbe_IwSCtYy54CDhfaA.jpg?width=320&crop=smart&auto=webp&s=4957dfb0dc6caf9fe9d937ab39de9e8afd034ccf",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/4z_jCQqXhIJNFD6ioVgs6VfoKbe_IwSCtYy54CDhfaA.jpg?width=640&crop=smart&auto=webp&s=f00cba4dd945a1052071bd94c69509b96e4f3aff",
            "width": 640,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/4z_jCQqXhIJNFD6ioVgs6VfoKbe_IwSCtYy54CDhfaA.jpg?width=960&crop=smart&auto=webp&s=e13e2f16062ec19df79da1d279cd7199ffacf5d1",
            "width": 960,
            "height": 639
          },
          {
            "url": "https://external-preview.redd.it/4z_jCQqXhIJNFD6ioVgs6VfoKbe_IwSCtYy54CDhfaA.jpg?width=1080&crop=smart&auto=webp&s=1a29e79ddb4923c85985d5c20ab120098fb381ec",
            "width": 1080,
            "height": 719
          }
        ],
        "variants": {},
        "id": "MUsrbqN1SfklFzsFZyzyYsr-bjA0dHkmXuK1bzF76-E"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pjoibb/the_top_post_is_a_damn_lie_salvadorians_arent/",
  "subreddit": "CryptoCurrency",
  "id": "pjoibb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Salvadorians arent being forced to accept anything, definitely not forced to\naccept BTC as the top post guy claims. His whole post is nothing but a lie.\nSalvadorians now have the option to accept bitcoin as legal tender, not pay\ncapital gain taxes on it, use LN as a payment rails in a country that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サルバドルの人々は何かを受け入れることを強制されているわけではありません。\nトップ記事の人が主張しているように、BTCの受け入れを強制されているわけではありません。彼の投稿は全て嘘でしかありません。\nサルバドルの人々は、ビットコインを法定通貨として受け入れ、キャピタルゲイン税を払わず、LNを国の決済手段として利用するという選択肢を持つことになりました。\nサルバドルの人々は、ビットコインを法定通貨として受け入れ、キャピタルゲイン税を払わず、LNを支払い手段として使うことができるようになりました。",
      "title": "一番上の記事は、いまいましい嘘です。サルバドルの人々はビットコインを「受け入れざるを得ない」状況にあります。真実は、世界中で通貨として切り下げられた不換紙を受け入れることを強制されているということです。誰かがこの現状を変えようとすると、多くの反対意見が出てきます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "萨尔瓦多人没有被强迫接受任何东西，绝对没有被强迫接受\n接受BTC，就像那个发帖人所说的那样。他的整个帖子不过是一个谎言。\n萨尔瓦多人现在可以选择接受比特币作为法定货币，不支付\n资本收益税，在一个国家使用LN作为支付手段。",
      "title": "最上面的帖子是一个该死的谎言。萨尔瓦多人没有被 \"强迫接受 \"比特币。事实是，我们都被强迫接受贬值的法币，在全世界范围内都是如此。当有人试图改变这种现状时，会有很多人反对。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "薩爾瓦多人沒有被強迫接受任何東西，絕對沒有被強迫接受\n接受BTC，就像那個發帖人所說的那樣。他的整個帖子不過是一個謊言。\n薩爾瓦多人現在可以選擇接受比特幣作爲法定貨幣，不支付\n資本收益稅，在一個國家使用LN作爲支付手段。",
      "title": "最上面的帖子是一個該死的謊言。薩爾瓦多人沒有被 \"強迫接受 \"比特幣。事實是，我們都被強迫接受貶值的法幣，在全世界範圍內都是如此。當有人試圖改變這種現狀時，會有很多人反對。"
    }
  ]
}