{
  "author": "zqwu8391",
  "original_created_utc": 1655689408,
  "title": "Would my great-great grandfather have ever eaten a banana?",
  "created_utc": 1655697321,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My great-great grandfather was born in 1843 in the Russian Empire’s Pale of Settlement, in what is now Belarus. He was Jewish, and ran a mill on property belonging to nobility (so goes family lore). He emigrated with his many children and grandchildren in the 1890s to Chicago. He lived there for 25 years, and could read/write/speak English according to the census. &lt;/p&gt;\n\n&lt;p&gt;Would he have ever eaten a banana? Either in Russia or in Chicago. Follow-up: what about a mango?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/AskHistorians/comments/vga00u/would_my_greatgreat_grandfather_have_ever_eaten_a/",
  "subreddit": "AskHistorians",
  "id": "vga00u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My great-great grandfather was born in 1843 in the Russian Empire’s Pale of\nSettlement, in what is now Belarus. He was Jewish, and ran a mill on property\nbelonging to nobility (so goes family lore). He emigrated with his many children\nand grandchildren in the 1890s to Chicago. He lived there for 25…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の高祖父は、1843年にロシア帝国の「入植地」（現在のベラルーシ）で生まれました。\n私の高祖父は、1843年にロシア帝国の「入植地」（現在のベラルーシ）で生まれました。彼はユダヤ人で、貴族の所有する土地で製粉所を営んでいました。\nユダヤ人であり、貴族が所有していた土地で製粉所を経営していた（という家伝がある）。彼は多くの子供たちや孫たちとともに1890年代に移住してきました。\n1890年代にシカゴに移住した。そこで25年間を過ごした。",
      "title": "私の曾祖父はバナナを食べたことがあるだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的曾曾祖父于1843年出生在俄罗斯帝国的萨勒地区。\n定居点，在现在的白俄罗斯。他是犹太人，在属于贵族的财产上经营一家磨坊。\n属于贵族的财产上经营一家磨坊（家族传说如此）。1890年，他和他的许多孩子一起移民\n在19世纪90年代移民到芝加哥。他在那里生活了25年。",
      "title": "我的曾曾祖父会不会吃过香蕉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的曾曾祖父於1843年出生在俄羅斯帝國的薩勒地區。\n定居點，在現在的白俄羅斯。他是猶太人，在屬於貴族的財產上經營一家磨坊。\n屬於貴族的財產上經營一家磨坊（家族傳說如此）。1890年，他和他的許多孩子一起移民\n在19世紀90年代移民到芝加哥。他在那裏生活了25年。",
      "title": "我的曾曾祖父會不會喫過香蕉？"
    }
  ]
}