{
  "author": "ixikei",
  "the_new_excerpt": "I was really surprised to see how my TIPS (\"Treasury inflation protected\nsecurities\") ETF (SCHP, in particular) is performing. Not well! Which really\nconfuses me. It did great all year until the market started getting scared about\ninflation this month.\n\nWhy are TIPS selling off!? Shouldn't demand…",
  "original_created_utc": 1614353451,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我真的很惊讶地看到我的TIPS（\"国债通胀保值\"）是怎样的。\n证券\"）ETF（尤其是SCHP）的表现。不怎么样! 这真是\n让我感到困惑。它做了伟大的一年，直到市场开始害怕的\n这个月的通货膨胀。\n\n为什么TIPS会被抛售！？不是应该要求...",
      "title": "我很惊讶地看到TIPS ETF本月下跌，因为市场承认预期会有更多的通胀。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的很驚訝地看到我的TIPS（\"國債通脹保值\"）是怎樣的。\n證券\"）ETF（尤其是SCHP）的表現。不怎麼樣! 這真是\n讓我感到困惑。它做了偉大的一年，直到市場開始害怕的\n這個月的通貨膨脹。\n\n爲什麼TIPS會被拋售！？不是應該要求...",
      "title": "我很驚訝地看到TIPS ETF本月下跌，因爲市場承認預期會有更多的通脹。"
    }
  ],
  "title": "I'm surprised to see TIPS ETFs dropping this month as the market admits to expecting more inflation.",
  "created_utc": 1614408353,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was really surprised to see how my TIPS (&quot;Treasury inflation protected securities&quot;) ETF (SCHP, in particular) is performing. Not well! Which really confuses me. It did great all year until the market started getting scared about inflation this month. </p>\n\n<p>Why are TIPS selling off!? Shouldn&#39;t demand for TIPS grow as inflation expectations grow? I had thought that, unlike treasuries, the nominal value can grow in line with the nominal yield (which is indexed to CPI.) But I must not be understanding them correctly. </p>\n\n<p>Why aren&#39;t more people buying TIPS in response to increased inflation expectations? It&#39;s not cause they&#39;re buying standard treasuries... those are also being dumped.</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/investing/comments/lt01jm/im_surprised_to_see_tips_etfs_dropping_this_month/",
  "subreddit": "investing",
  "id": "lt01jm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740747
}