{
  "author": "Born-Sea-4942",
  "the_new_excerpt": "I never had more than 6000 in my bank account at one time before this year. I\njust started investing about 5 months ago and after reading about btc for a long\ntime i decided about a month and a half ago to throw 3500 into btc when it was\nat around 15000. Now it's valued at over 7000 dollars worth of…",
  "original_created_utc": 1609915448,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在今年之前，我的银行账户里从来没有超过6000个存款。我\n大约5个月前才开始投资，在阅读了很长一段时间的BTC后\n大约一个半月前，我决定向BTC投入3500英镑，当时它是\n在15000左右。现在它的价值超过7,000美元的…",
      "title": "比特币的崛起几乎让我落泪。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在今年之前，我的銀行賬戶裏從來沒有超過6000個存款。我\n大約5個月前纔開始投資，在閱讀了很長一段時間的BTC後\n大約一個半月前，我決定向BTC投入3500英鎊，當時它是\n在15000左右。現在它的價值超過7,000美元的…",
      "title": "比特幣的崛起幾乎讓我落淚。"
    }
  ],
  "title": "The rise of btc has been bringing me almost to tears",
  "created_utc": 1609941136,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I never had more than 6000 in my bank account at one time before this year. I just started investing about 5 months ago and after reading about btc for a long time i decided about a month and a half ago to throw 3500 into btc when it was at around 15000. Now it&#39;s valued at over 7000 dollars worth of btc. I don&#39;t really know what else to say but I&#39;m in awe and it&#39;s got me deep in my emotions. I&#39;ve always done manual labor for work and lived off of my meager wages. I has a btc back in 2011 when wallets weren&#39;t secure to buy stuff with and it was hacked. I don&#39;t regret any of that though. I am just thankful for the modest 4 thousand dollars this has given me. And if it hits 50k I&#39;m gonna cry. If it hits 100k I&#39;m gonna get a btc tattoo. Most of you guys have made more than me but i cant tell u how hard I&#39;ve worked for 4000 dollars over months in my life and this is a blessing. Thanks to everyone for making this possible.</p>\n</div><!-- SC_ON -->",
  "score": 475,
  "permalink": "/r/Bitcoin/comments/krieb1/the_rise_of_btc_has_been_bringing_me_almost_to/",
  "subreddit": "Bitcoin",
  "id": "krieb1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100742431
}