{
  "author": "seafoodboiler",
  "original_created_utc": 1636722911,
  "title": "Many people seem to instinctively fear spiders, snakes, centipedes, and other 'creepy-crawlies'. Is this fear a survival mechanism hardwired into our DNA like fearing heights and the dark, or does it come from somewhere else?",
  "created_utc": 1636740041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not sure whether to put this in anthropology or psychology, but here goes:</p>\n\n<p>I remember seeing some write-up somewhere that described something called &#39;primal fears&#39;. It said that while many fears are products of personal and social experience, there&#39;s a handful of fears that all humans are (usually) born with due to evolutionary reasons. Roughly speaking, these were: </p>\n\n<ul>\n<li>heights </li>\n<li>darkness, </li>\n<li>very loud noises </li>\n<li>signs of carnivory (think sharp teeth and claws) </li>\n<li>signs of decay (worms, bones) </li>\n<li>signs of disease (physical disfigurement and malformation) </li>\n</ul>\n\n<p>and rounding off the list were the aforementioned creepy-crawlies. </p>\n\n<p>Most of these make a lot of sense - heights, disease, darkness, etc. are things that most animals are exposed to all the time. What I was fascinated by was the idea that our ancestors had enough negative experience with snakes, spiders, and similar creatures to be instinctively off-put by them.</p>\n\n<p>I started to think about it even more, and I realized that there are lots of things that have <em>similar</em> physical traits to the creepy-crawlies that are nonetheless NOT as feared by people. For example: </p>\n\n<ul>\n<li><p>Caterpillars, inchworms and millipedes do not illicit the kind of response that centipedes do, despite having a similar body type</p></li>\n<li><p>A spider shares many traits with other insect-like invertebrates, but seeing a big spider is much more alarming than seeing a big beetle or cricket</p></li>\n<li><p>Except for the legs, snakes are just like any other reptile, but we don&#39;t seem to be freaked out by most lizards</p></li>\n</ul>\n\n<p>So, what gives? Is all of the above just habituated fear response, or is it something deeper and more primal? Would love any clarity on this.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/qsaxk0/many_people_seem_to_instinctively_fear_spiders/",
  "subreddit": "askscience",
  "id": "qsaxk0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not sure whether to put this in anthropology or psychology, but here goes:\n\nI remember seeing some write-up somewhere that described something called\n'primal fears'. It said that while many fears are products of personal and\nsocial experience, there's a handful of fears that all humans are (usually)…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人類学と心理学のどちらに入れるべきか迷いましたが、ここに書いておきます。\n\nどこかで「原始的な恐怖」というものについて書かれた記事を見た覚えがあります。\n原始的な恐怖心」。それによると、多くの恐怖は個人的、社会的経験の産物であるが、一握りの恐怖があるという。\n多くの恐怖は個人的、社会的経験の産物であるが、一握りの恐怖はすべての人間が（通常）...",
      "title": "多くの人は、クモやヘビ、ムカデなどの「ゾッとする生き物」を本能的に怖がるようです。この恐怖は、高所恐怖症や暗闇恐怖症のようにDNAに組み込まれた生存メカニズムなのでしょうか、それとも別のところから来ているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不知道该把这个问题放在人类学还是心理学里，但还是要说一下。\n\n我记得在某处看到一些文章，描述了一种叫做\n'原始恐惧'。它说，虽然许多恐惧是个人和社会经验的产物\n社会经验的产物，但有少数恐惧是所有人类（通常）都有的...",
      "title": "许多人似乎本能地害怕蜘蛛、蛇、蜈蚣和其他 \"恐怖的爬虫\"。这种恐惧是像惧怕高处和黑暗一样硬性植入我们的DNA的生存机制，还是来自其他地方？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不知道該把這個問題放在人類學還是心理學裏，但還是要說一下。\n\n我記得在某處看到一些文章，描述了一種叫做\n'原始恐懼'。它說，雖然許多恐懼是個人和社會經驗的產物\n社會經驗的產物，但有少數恐懼是所有人類（通常）都有的...",
      "title": "許多人似乎本能地害怕蜘蛛、蛇、蜈蚣和其他 \"恐怖的爬蟲\"。這種恐懼是像懼怕高處和黑暗一樣硬性植入我們的DNA的生存機制，還是來自其他地方？"
    }
  ]
}