{
  "author": "KeeperofQueensCorgis",
  "original_created_utc": 1631698857,
  "title": "As the captain of a Royal Navy frigate during the Napoleonic Wars, to what extent can I modify my ship?",
  "created_utc": 1631713322,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that frigate captains could usually paint their ship whatever colours they liked and that they could even add a few more guns abroad, if Patrick O&#39;Brian is to be believed. </p>\n\n<p>How else did Royal Navy captains modify their ships to make it more like their own? Could they also say, add extra men to the complement of marines? Hire another surgeon&#39;s mate or carpenter? To what extent were shipboard positions hired by the captain themselves or assigned to the ship by the navy?</p>\n\n<p>In the appendix of <em>Nelson&#39;s Navy</em>, Brian Lavery has a list of shipboard positions and he gives figures for how many of these positions there were abroad a ship of a certain size. But I have no idea whether the list is intended to be prescriptive or descriptive. If this list is based on standing orders given by the Admiralty or whatever, could the captain deviate from it?</p>\n</div><!-- SC_ON -->",
  "score": 149,
  "permalink": "/r/AskHistorians/comments/pomvdr/as_the_captain_of_a_royal_navy_frigate_during_the/",
  "subreddit": "AskHistorians",
  "id": "pomvdr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know that frigate captains could usually paint their ship whatever colours\nthey liked and that they could even add a few more guns abroad, if Patrick\nO'Brian is to be believed.\n\nHow else did Royal Navy captains modify their ships to make it more like their\nown? Could they also say, add extra men…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フリゲート艦の艦長は通常、自分の船を好きな色に塗ることができた。\nパトリック・オブ・ブライアンが信じているように、フリゲート艦の艦長は通常、自分の船を好きな色に塗ることができ、海外で銃を数門追加することもできた。\nO'Brianが信じるところでは\n\n英国海軍の艦長たちは、自分たちの船をより自分たちのものにするために、他にどのような改造をしたのでしょうか？\n他には？例えば、人を増やしたり...。",
      "title": "ナポレオン戦争時の英国海軍フリゲート艦の艦長として、自分の船をどこまで改造できるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道护卫舰舰长通常可以把船涂成他们喜欢的任何颜色。\n他们喜欢的颜色，甚至可以在国外多加几门炮，如果帕特里克-奥布赖恩的话。\nO'Brian是可信的。\n\n皇家海军舰长们还如何改装他们的舰艇，使之更像他们自己的舰艇？\n自己的船？他们是否也可以说，增加额外的人......",
      "title": "作为拿破仑战争期间皇家海军护卫舰的舰长，我可以在多大程度上改装我的船？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道護衛艦艦長通常可以把船塗成他們喜歡的任何顏色。\n他們喜歡的顏色，甚至可以在國外多加幾門炮，如果帕特里克-奧布賴恩的話。\nO'Brian是可信的。\n\n皇家海軍艦長們還如何改裝他們的艦艇，使之更像他們自己的艦艇？\n自己的船？他們是否也可以說，增加額外的人......",
      "title": "作爲拿破崙戰爭期間皇家海軍護衛艦的艦長，我可以在多大程度上改裝我的船？"
    }
  ]
}