{
  "author": "Snoo65810",
  "original_created_utc": 1634799658,
  "title": "If you could give ONE advice to Crypto beginners, what would it be?",
  "created_utc": 1634826900,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Another green pasture means yet another batch of newcomers to Crypto. </p>\n\n<p>First off all, welcome to the promise land! </p>\n\n<p>Crypto is my cult and should soon be yours too. We believe in various Crypto with Bitcoin parting the waters as we follow into the unknown. </p>\n\n<p>We are nice but quick to be triggered if you speak bad about sensitive coins such as <em>ahem</em> Ada etc </p>\n\n<p>My advice to all newcomers would be to take it slow and not jump in the wave until you know what you are doing or <em>think you do</em></p>\n\n<p>Observe for a while, you don’t want to be an ATH bag holder nor do you want to miss out. This is an eternal tug of war that you will experience, master this and your prosperity shall follow. </p>\n\n<p>If you could also give one advice to Crypto beginners, what would it be?</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/qclwo1/if_you_could_give_one_advice_to_crypto_beginners/",
  "subreddit": "CryptoCurrency",
  "id": "qclwo1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Another green pasture means yet another batch of newcomers to Crypto.\n\nFirst off all, welcome to the promise land!\n\nCrypto is my cult and should soon be yours too. We believe in various Crypto\nwith Bitcoin parting the waters as we follow into the unknown.\n\nWe are nice but quick to be triggered if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "緑の牧場が増えたということは、Cryptoの新参者が増えたということでもあります。\n\nまず最初に、約束の地へようこそ。\n\nCryptoは私のカルトであり、すぐにあなたのカルトにもなるはずです。我々は様々なCryptoを信じています。\nBitcoinは、私たちが未知の世界に入っていくときに水を分けてくれます。\n\n私たちは親切ですが、もしも...という時にはすぐに引き金を引いてしまいます。",
      "title": "暗号の初心者に一つだけアドバイスするとしたら、何をしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "另一个绿色的牧场意味着又有一批新人加入了加密货币。\n\n首先，欢迎来到承诺之地!\n\nCrypto是我的邪教，很快也应该是你的。我们相信各种加密货币\n与比特币分庭抗礼，因为我们也跟着进入未知领域。\n\n我们很好，但很快就会被触发，如果...",
      "title": "如果你能给加密货币初学者一个建议，会是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "另一個綠色的牧場意味着又有一批新人加入了加密貨幣。\n\n首先，歡迎來到承諾之地!\n\nCrypto是我的邪教，很快也應該是你的。我們相信各種加密貨幣\n與比特幣分庭抗禮，因爲我們也跟着進入未知領域。\n\n我們很好，但很快就會被觸發，如果...",
      "title": "如果你能給加密貨幣初學者一個建議，會是什麼？"
    }
  ]
}