{
  "author": "cedenof10",
  "original_created_utc": 1629145643,
  "title": "Are we really going to pretend like the US didn’t just waste two decades, $1 trillion, and thousands of lives for absolutely nothing in Afghanistan?",
  "created_utc": 1629160910,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like no one is talking about this. Is there anything we can do to prevent this from happening again? A petition or something? </p>\n\n<p>Seems unfair to Americans and Afghani people alike that trillions of American tax payers’ money went to killing innocent people for a cause that we have known for years would never work in the long term. The US gov’t continues to pull stunts like this when we could give shelter and mental health resources to homeless veterans, increase educational spending, and invest in American infrastructure. </p>\n\n<p>Are we just destined to wait until the US government chooses what country they will screw over using our taxes, or is there something we can do to prevent this in the future?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/p5odab/are_we_really_going_to_pretend_like_the_us_didnt/",
  "subreddit": "TooAfraidToAsk",
  "id": "p5odab",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel like no one is talking about this. Is there anything we can do to prevent\nthis from happening again? A petition or something?\n\nSeems unfair to Americans and Afghani people alike that trillions of American\ntax payers’ money went to killing innocent people for a cause that we have known\nfor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もこのことについて話していないような気がします。このようなことが起こらないようにするには\nこのようなことが起こらないようにするために 嘆願書か何か？\n\nアメリカ人にとってもアフガニスタン人にとっても、何兆円ものアメリカの税金が罪のない人々の殺害に使われるのは不公平だと思います。\nアメリカの納税者のお金が、私たちが知っている目的のために罪のない人々を殺すために使われたことは、アメリカ人にとってもアフガニスタンの人々にとっても不公平に思えます。\nこれは不公平だと思います。",
      "title": "私たちは、アメリカがアフガニスタンで20年、1兆ドル、何千人もの命を全くの無意味に浪費していなかったかのようなふりをするつもりなのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得没有人在谈论这个问题。我们能做些什么来防止\n这种情况再次发生？请愿书还是什么？\n\n似乎对美国人和阿富汗人都不公平，数万亿美国纳税人的钱被用于杀害无辜的人。\n美国纳税人的钱被用于杀害无辜的人，而我们已经知道\n的事业......。",
      "title": "我们真的要假装美国没有在阿富汗浪费20年、1万亿美元和成千上万的生命，而完全没有任何意义吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得沒有人在談論這個問題。我們能做些什麼來防止\n這種情況再次發生？請願書還是什麼？\n\n似乎對美國人和阿富汗人都不公平，數萬億美國納稅人的錢被用於殺害無辜的人。\n美國納稅人的錢被用於殺害無辜的人，而我們已經知道\n的事業......。",
      "title": "我們真的要假裝美國沒有在阿富汗浪費20年、1萬億美元和成千上萬的生命，而完全沒有任何意義嗎？"
    }
  ]
}