{
  "author": "Zijdehoen",
  "original_created_utc": 1630962386,
  "title": "Please Check if You Have This Virus Stealing your Crypto",
  "created_utc": 1630985441,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I had to move some Monero between exchanges but since i&#39;m paranoid as sh*t i always send a low transaction first to check <em>if it works.</em> </p>\n\n<p>However after 30 minutes it was still not there. Me thinking it was probably some network congestion, I go to sleep. Day after, <strong>still not there</strong>. </p>\n\n<p>So I perform the same transaction again but this time I really check everything carefully and what&#39;s odd is that <strong>everytime i copy/pasta the address, a different address is pasted</strong>... </p>\n\n<p>After some <em>googlin&#39;</em> i instantly bought premium anti-virus and let it remove everything. There was malware on my pc that changed your clipboard whenever an address was copied, so your XMR is sent to some other person&#39;s account. </p>\n\n<p><strong>Please check</strong> your address carefully before you send and do <strong>invest in decent anti-virus software</strong>.</p>\n\n<p>Stay safe friends!</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/pj8j0w/please_check_if_you_have_this_virus_stealing_your/",
  "subreddit": "CryptoCurrency",
  "id": "pj8j0w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I had to move some Monero between exchanges but since i'm paranoid as sh*t i\nalways send a low transaction first to check if it works.\n\nHowever after 30 minutes it was still not there. Me thinking it was probably\nsome network congestion, I go to sleep. Day after, still not there.\n\nSo I perform…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、いくつかのMoneroを取引所間で移動させなければなりませんでしたが、私はクソのように疑い深いので\nいつも最初に低額の取引をして、それが機能するかどうかを確認していました。\n\nしかし、30分経ってもモネロは存在しませんでした。おそらくネットワークの混雑だと思った私は\nネットワークの混雑のせいだろうと思い、私は眠りにつきました。翌日になってもまだ存在しません。\n\nそこで私は...",
      "title": "このウイルスがあなたの暗号を盗んでいないかどうか確認してください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我不得不在各交易所之间转移一些Monero，但由于我是个偏执狂，我\n总是先发送一个低价交易，以检查它是否有效。\n\n然而，30分钟后，它仍然没有出现。我想这可能是\n一些网络拥堵，我就去睡觉了。过了一天，仍然没有出现。\n\n于是我进行...",
      "title": "请检查你是否有这种病毒在窃取你的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我不得不在各交易所之間轉移一些Monero，但由於我是個偏執狂，我\n總是先發送一個低價交易，以檢查它是否有效。\n\n然而，30分鐘後，它仍然沒有出現。我想這可能是\n一些網絡擁堵，我就去睡覺了。過了一天，仍然沒有出現。\n\n於是我進行...",
      "title": "請檢查你是否有這種病毒在竊取你的加密貨幣"
    }
  ]
}