{
  "author": "Wooden-Profession-71",
  "original_created_utc": 1657180835,
  "title": "Is it too forward if I as a woman ask a man out?",
  "created_utc": 1657202458,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know the old school way was the opposite but I wonder if it’s acceptable &lt;/p&gt;\n\n&lt;p&gt;I saw another post about guys complimenting women so how about the reverse. If I told a guy I find him attractive is that making me appear desperate or is that creepy?&lt;/p&gt;\n\n&lt;p&gt;Sometimes I do this and I don’t realize how it may come across especially since I said it in the beginning&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 128,
  "permalink": "/r/TooAfraidToAsk/comments/vtd9t7/is_it_too_forward_if_i_as_a_woman_ask_a_man_out/",
  "subreddit": "TooAfraidToAsk",
  "id": "vtd9t7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know the old school way was the opposite but I wonder if it’s acceptable\n\nI saw another post about guys complimenting women so how about the reverse. If I\ntold a guy I find him attractive is that making me appear desperate or is that\ncreepy?\n\nSometimes I do this and I don’t realize how it may…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔のやり方は逆だったけれど、受け入れられるのだろうか\n\n他の投稿で、男が女を褒めるというのを見たので、逆はどうなんだろう。もし私が\n魅力的だと言ったら、それは私が必死なように見えるのでしょうか？\n気持ち悪いですか？\n\n時々、私はこれをやって、私はそれがどのように可能性があります気づいていない...",
      "title": "女性から男性を誘うのは手前味噌でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道老派的方式是相反的，但我想知道这是否可以接受。\n\n我看到另一个关于男人恭维女人的帖子，那么反过来呢。如果我\n如果我告诉一个人我觉得他很有吸引力，这是否会让我显得很绝望，或者说这是否是\n令人毛骨悚然？\n\n有时我这样做，但我没有意识到这可能...",
      "title": "如果我作为一个女人约一个男人出来，是不是太过前卫？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道老派的方式是相反的，但我想知道這是否可以接受。\n\n我看到另一個關於男人恭維女人的帖子，那麼反過來呢。如果我\n如果我告訴一個人我覺得他很有吸引力，這是否會讓我顯得很絕望，或者說這是否是\n令人毛骨悚然？\n\n有時我這樣做，但我沒有意識到這可能...",
      "title": "如果我作爲一個女人約一個男人出來，是不是太過前衛？"
    }
  ]
}