{
  "author": "sandygws",
  "original_created_utc": 1643224552,
  "title": "The Fed decision was EXTREMELY encouraging and there were no nasty surprises. The only major threat to a bullish market right now is the situation in Ukraine ... but I believe there will be NO WAR and that we're back on track for an extremely bullish 2022. This is why ...",
  "created_utc": 1643248723,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;COVID. All the predictions of OMICRON disaster were wildly overstated. Here in the UK, ALL restrictions will be permanently abolished from this Saturday. The same in several other European countries.&lt;/li&gt;\n&lt;li&gt;Ukraine. Despite the chest thumping, there will be no major conflagration in Ukraine. Russia cannot afford to lose face and will back down - whilst making a small, grandiose gesture.&lt;/li&gt;\n&lt;li&gt;Putin has confirmed that Russia will NOT be banning crypto. That was obvious, but it&amp;#39;s still bullish news.&lt;/li&gt;\n&lt;li&gt;BTC Futures are currently at 0.93 - the highest for some time. The markets have fully priced in the gradual phasing out of tapering and up to 4 x 0.25% rate increase this year.&lt;/li&gt;\n&lt;li&gt;Global supply chains are recovering faster than governments expected. Again, this is due to Covid becoming less menacing.&lt;/li&gt;\n&lt;li&gt;The US Labor Market is now officially &amp;#39;Strong&amp;#39;.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;There will be serious profit taking in the next few hours, but that&amp;#39;s to be expected. But we&amp;#39;re now back on firm ground until the Spring.&lt;/p&gt;\n\n&lt;p&gt;NFA/DYOR&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/sddv41/the_fed_decision_was_extremely_encouraging_and/",
  "subreddit": "CryptoCurrency",
  "id": "sddv41",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": " * COVID. All the predictions of OMICRON disaster were wildly overstated. Here\n   in the UK, ALL restrictions will be permanently abolished from this Saturday.\n   The same in several other European countries.\n * Ukraine. Despite the chest thumping, there will be no major conflagration in\n  …",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " * COVID. オミクロンの災難の予測は、すべて荒唐無稽に誇張されたものでした。ここ\n   英国では、今週土曜日からすべての規制が永久に撤廃されます。\n   他のいくつかのヨーロッパ諸国でも同様です。\n * ウクライナ。胸騒ぎがするにもかかわらず、ウクライナで大火災が起こることはないでしょう。\n  ...",
      "title": "FRBの決定は非常に心強いもので、嫌なサプライズはなかった。今、強気な市場に対する唯一の大きな脅威はウクライナ情勢だが、私は戦争は起こらないし、2022年の極めて強気な軌道に戻ると信じている。というわけで・・・。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " *COVID。所有关于OMICRON灾难的预测都被严重夸大了。在这里\n   在英国，所有的限制将从本周六起永久废除。\n   在其他几个欧洲国家也是如此。\n * 乌克兰。尽管有人捶胸顿足，但在乌克兰不会发生大的冲突。\n  ...",
      "title": "美联储的决定是非常令人鼓舞的，没有令人讨厌的意外。现在对看涨市场的唯一主要威胁是乌克兰局势......但我相信不会有战争，我们将回到一个极其看涨的2022年的轨道上。这就是为什么..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " *COVID。所有關於OMICRON災難的預測都被嚴重誇大了。在這裏\n   在英國，所有的限制將從本週六起永久廢除。\n   在其他幾個歐洲國家也是如此。\n * 烏克蘭。儘管有人捶胸頓足，但在烏克蘭不會發生大的衝突。\n  ...",
      "title": "美聯儲的決定是非常令人鼓舞的，沒有令人討厭的意外。現在對看漲市場的唯一主要威脅是烏克蘭局勢......但我相信不會有戰爭，我們將回到一個極其看漲的2022年的軌道上。這就是爲什麼..."
    }
  ]
}