{
  "author": "MissMatriarch",
  "original_created_utc": 1635324585,
  "title": "Paid off my crippling student debt after 3 hard years of HODLing crypto!",
  "created_utc": 1635334689,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I graduated 3 years ago, I had a student debt of just short of 27K dollars. At that time, without much knowledge of the crypto market and its trends, I threw some money (about 100 dollars) into coins like BTC, ETH and BNB. </p>\n\n<p>Today marks the 3 year anniversary of my investment, and I’ve made a profit of just short of 43K over these past three years. This morning, I paid off the last remaining sum of my debt, and I’m officially free of debt!</p>\n\n<p>You don’t need to be a market analysis expert, or throw gigantuous amounts of money in crypto for good things to happen.</p>\n\n<p>Just have faith! Keep on HODLing!</p>\n</div><!-- SC_ON -->",
  "score": 378,
  "permalink": "/r/CryptoCurrency/comments/qgs6qs/paid_off_my_crippling_student_debt_after_3_hard/",
  "subreddit": "CryptoCurrency",
  "id": "qgs6qs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When I graduated 3 years ago, I had a student debt of just short of 27K dollars.\nAt that time, without much knowledge of the crypto market and its trends, I\nthrew some money (about 100 dollars) into coins like BTC, ETH and BNB.\n\nToday marks the 3 year anniversary of my investment, and I’ve made a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3年前に卒業したとき、私は27Kドル弱の学生借金を抱えていました。\n当時、暗号市場やその動向についてあまり知識のない私は、BTC、ETH、BNBなどのコインにいくらかのお金（約100ドル）を投じました。\nBTC、ETH、BNBなどのコインに100ドルほどのお金を投じました。\n\n今日で投資から3年が経ちましたが、私はこれまでに...",
      "title": "暗号のHODLを3年間続けた結果、多額の学生借金を完済しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "3年前我毕业时，我的学生债务只有不到2.7万美元。\n当时，在对加密货币市场及其趋势没有太多了解的情况下，我\n扔了一些钱（大约100美元）到BTC、ETH和BNB等币上。\n\n今天是我投资的三周年，我已经赚了不少钱。",
      "title": "经过3年艰苦的加密货币学习，我还清了沉重的学生债务!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "3年前我畢業時，我的學生債務只有不到2.7萬美元。\n當時，在對加密貨幣市場及其趨勢沒有太多瞭解的情況下，我\n扔了一些錢（大約100美元）到BTC、ETH和BNB等幣上。\n\n今天是我投資的三週年，我已經賺了不少錢。",
      "title": "經過3年艱苦的加密貨幣學習，我還清了沉重的學生債務!"
    }
  ]
}