{
  "author": "unclekarl_",
  "original_created_utc": 1638815042,
  "title": "It’s insane how people can complain about crypto price action when “grandpa BTC” the past year is up more than the S&amp;P 500 the past 5 years…",
  "created_utc": 1638830202,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;People are WAY too focused on getting rich quick, it’s so frustrating to watch.&lt;/p&gt;\n\n&lt;p&gt;It seems like most people here don’t realize how they’re participating in a once in a lifetime type of investment opportunity.&lt;/p&gt;\n\n&lt;p&gt;To my knowledge there has never been a greater vehicle to perpetuate the transfer of global wealth. There are 56.1 million millionaires in the world according to a recent survey by Credit Suisse. (There’s probably many more that aren’t accounted for)&lt;/p&gt;\n\n&lt;p&gt;There will only ever be 21 million BTC created. (The actual accessible supply number is probably closer to 17-18 million cause there’s an estimated 3-4 million BTC lost forever from the early days). Just doing the basic math and you can see that not even every millionaire will ever be able to own a full BTC in the future. That’s insane when you think about it. &lt;/p&gt;\n\n&lt;p&gt;That’s just BTC, crypto as an asset class is designed to be scarce. ETH is now deflationary for example (it’s not far fetched to assume that others will follow ETH’s lead if the burn is proven successful), and most other top projects have max supplies that will be reached in our lifetime. &lt;/p&gt;\n\n&lt;p&gt;This is only discussing crypto from a supply and demand aspect. When we start getting into the technical aspect and how it’s in the forefront of the next technological revolutions (DeFi, NFTs, Metaverses) it’s obvious how early we are in crypto.&lt;/p&gt;\n\n&lt;p&gt;So stop staring at the charts and trying to time the market. All you need to do is stack sats and you’ll be more than okay in the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/radyqh/its_insane_how_people_can_complain_about_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "radyqh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People are WAY too focused on getting rich quick, it’s so frustrating to watch.\n\nIt seems like most people here don’t realize how they’re participating in a once\nin a lifetime type of investment opportunity.\n\nTo my knowledge there has never been a greater vehicle to perpetuate the\ntransfer of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一攫千金を狙う人が多すぎて、見ていてイライラする。\n\nここにいるほとんどの人は、自分が一攫千金を狙って参加していることに気づいていないようです。\n一生に一度の投資機会ですからね。\n\n私の知る限り、これほど永続性のある手段はありません。\nの転送...",
      "title": "過去1年間の「BTCおじいちゃん」が過去5年間のS&amp;P500よりも上昇しているのに、人々が暗号の値動きに文句を言うのは正気の沙汰ではありません...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们太专注于快速致富了，这让人看了很沮丧。\n\n似乎这里的大多数人都没有意识到他们是如何参与到一次\n一生一次的投资机会。\n\n据我所知，从来没有一个更大的工具来延续\n转移...",
      "title": "当 \"爷爷的BTC \"在过去一年中的涨幅超过了S&amp;P 500过去5年的涨幅时，人们怎么能抱怨加密货币的价格走势呢，这太疯狂了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們太專注於快速致富了，這讓人看了很沮喪。\n\n似乎這裏的大多數人都沒有意識到他們是如何參與到一次\n一生一次的投資機會。\n\n據我所知，從來沒有一個更大的工具來延續\n轉移...",
      "title": "當 \"爺爺的BTC \"在過去一年中的漲幅超過了S&amp;P 500過去5年的漲幅時，人們怎麼能抱怨加密貨幣的價格走勢呢，這太瘋狂了。"
    }
  ]
}