{
  "author": "oh_uh_ok",
  "original_created_utc": 1626753141,
  "title": "Is it really quitting porn if you start an Only Fans?",
  "created_utc": 1626764495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just read an interview with llana Rhoades about how she wishes she never did porn, wishes people didn&#39;t see her that way, maintained her dignity and said she only had about 100k when she quit but is now a multimillionaire. I was wondering how she became so wealthy if she wasn&#39;t rich after quitting porn, but then she said she makes about a 1.5 million from OF.</p>\n\n<p>I think we can all agree that the porn industry is garbage for women and Only Fans gives sex workers the space to create content on their own terms, but isn&#39;t Only Fans still porn? Are we removing OF creators from Porn actresses?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/onubkd/is_it_really_quitting_porn_if_you_start_an_only/",
  "subreddit": "TooAfraidToAsk",
  "id": "onubkd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just read an interview with llana Rhoades about how she wishes she never did\nporn, wishes people didn't see her that way, maintained her dignity and said she\nonly had about 100k when she quit but is now a multimillionaire. I was wondering\nhow she became so wealthy if she wasn't rich after quitting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "llana Rhoadesのインタビューを読みましたが、ポルノをやらなければよかったと思っています。\nポルノをやらなければよかった、そういう目で見られなければよかった、尊厳を保っていた、と語っています。\n辞めた時は10万円しかなかったけど、今は億万長者になったと言っていました。私は不思議に思いました。\nどうやって裕福になったんだろう？",
      "title": "オンリーファンを始めれば、本当にAVをやめることになるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚读了一篇对伊莲娜-罗德斯的采访，说她希望自己从未做过\n色情，希望人们不这样看她，保持她的尊严，并说她退出时只有10万左右，但现在是千万富翁。\n她说她退出时只有10万美元，但现在已经是千万富翁了。我在想\n如果她在退出后并不富有，她是如何变得如此富有的......",
      "title": "如果你开始做Only Fans，真的是在戒掉色情吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛讀了一篇對伊蓮娜-羅德斯的採訪，說她希望自己從未做過\n色情，希望人們不這樣看她，保持她的尊嚴，並說她退出時只有10萬左右，但現在是千萬富翁。\n她說她退出時只有10萬美元，但現在已經是千萬富翁了。我在想\n如果她在退出後並不富有，她是如何變得如此富有的......",
      "title": "如果你開始做Only Fans，真的是在戒掉色情嗎？"
    }
  ]
}