{
  "author": "CosmoBarber",
  "the_new_excerpt": "I think the average Joe is tired. They’ve been told their businesses are closed\nby guys with tailored suits and $300 haircuts. They get charged $35 by the bank\nif they’re $0.25 short. They see the price of gas go up from more taxes and\ntheir suspension is shot from the potholes. They see their…",
  "original_created_utc": 1620181704,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一般の人たちは疲れていると思います。テーラーメイドのスーツを着て300ドルのヘアカットをした男たちに\nテーラーメイドのスーツを着て、300ドルのヘアカットをした男たちに。0.25ドル足りないだけで、銀行から35ドル請求されます。\n0.25ドル足りないだけで、銀行から35ドル請求される。税金が増えてガソリン代が上がり、道路の舗装化でサスペンションが壊れる。\n舗装されていない道路ではサスペンションが壊れる。彼らは、自分の...",
      "title": "単なる強欲ではないと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为普通的乔人已经厌倦了。他们已经被告知他们的企业已经关闭\n他们被告知，他们的生意被那些穿着合身西装、理发300美元的人关闭了。他们被银行收取35美元\n如果他们少了0.25美元。他们看到汽油的价格因更多的税收而上涨，而他们的悬架因坑洼不平而被击碎。\n他们的悬架被坑坑洼洼的路面击中。他们看到自己的...",
      "title": "我不认为这只是普通的贪婪"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲普通的喬人已經厭倦了。他們已經被告知他們的企業已經關閉\n他們被告知，他們的生意被那些穿着合身西裝、理髮300美元的人關閉了。他們被銀行收取35美元\n如果他們少了0.25美元。他們看到汽油的價格因更多的稅收而上漲，而他們的懸架因坑窪不平而被擊碎。\n他們的懸架被坑坑窪窪的路面擊中。他們看到自己的...",
      "title": "我不認爲這只是普通的貪婪"
    }
  ],
  "title": "I Don’t Think it’s Just Plain Old Greed",
  "created_utc": 1620199835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think the average Joe is tired. They’ve been told their businesses are closed by guys with tailored suits and $300 haircuts. They get charged $35 by the bank if they’re $0.25 short. They see the price of gas go up from more taxes and their suspension is shot from the potholes. They see their elected officials making six figures and taking another month of vacation. They see the angry old rich guy saying they don’t deserve it. They see their kids’ swing sets get padlocked at the local park. They see another billionaire claiming zero income. They see the price of housing skyrocket farther out of reach. They see another rich guy buy a judge for a lesser sentence. They see a constant barrage of ads for things they can’t afford. They avoid the hospitals for fear of bankruptcy. They pay for college for half their life. They live in third-world countries with little chance out. They wonder what kind of life their kids will have. They see the homeless dying of OD’s on the streets. </p>\n\n<p>They’ve been taking to the streets all year. They’re pent up. They finally see a chance. They have a glimmer of hope, a way out of the mud. They see a lotto ticket with a real chance of payout. They don’t know the rules. They don’t know the consequences. They just want a taste. They just want a piece. They want to feel like they finally won one just this once. They’re begging and praying for it, please, just this once. </p>\n\n<p>This is so much more than good and bad tokenomics. This is so much more than with or without utility. This is a reflection of the current state. This is a dream, a chance, their one big shot. This is an uprising. </p>\n\n<p>I think there’s a real good chance a lot of them are gonna get burned and that’s sad. But there’s no stopping it now. I hope they get some. I hope they get to enjoy the taste of that dream. I hope they see the green and it lights a fire in them. I hope if they lose it, they get determined to go get it back. I’m rooting for the average Joe. I hope they get theirs.</p>\n</div><!-- SC_ON -->",
  "score": 724,
  "permalink": "/r/CryptoCurrency/comments/n552t5/i_dont_think_its_just_plain_old_greed/",
  "subreddit": "CryptoCurrency",
  "id": "n552t5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964327
}