{
  "author": "caroline_xplr",
  "original_created_utc": 1627911949,
  "title": "Am I becoming a millenni-boomer, or is modern music really turning to trash?",
  "created_utc": 1627922425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think the 2020’s will be a decade of lost music. Maybe it’s just me, but I’d much rather listen to my 2000s throwbacks than turn on the radio. I’ve talked to a few of my friends about this, and they agree. At a certain point, I think songwriters will start running out of ideas. I was wondering if I’m just bitter, or if anybody else feels the same way.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/oweu98/am_i_becoming_a_millenniboomer_or_is_modern_music/",
  "subreddit": "TooAfraidToAsk",
  "id": "oweu98",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think the 2020’s will be a decade of lost music. Maybe it’s just me, but I’d\nmuch rather listen to my 2000s throwbacks than turn on the radio. I’ve talked to\na few of my friends about this, and they agree. At a certain point, I think\nsongwriters will start running out of ideas. I was wondering if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2020年代は、失われた音楽の10年になると思います。私だけかもしれませんが、私はラジオをつけるよりも\nラジオを聴くよりも、2000年代のスローバックを聴きたいと思っています。このことを何人かの友人に話してみました。\nこのことを何人かの友人に話したところ、彼らも同じ意見でした。ある時点で、私は\nソングライターはアイデアが尽きてくると思うんです。疑問に思ったのですが...",
      "title": "私はミレニブーマーになりつつあるのか、それとも現代の音楽は本当にゴミになってしまうのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为2020年将是一个失去音乐的十年。也许这只是我的想法，但我更愿意听我的2000年代复古音乐，而不是打开收音机。\n我更愿意听我的2000年代的回放，而不是打开收音机。我曾与\n我和我的一些朋友谈过这个问题，他们也同意。在某种程度上，我认为\n词曲作者会开始没有想法。我在想，如果...",
      "title": "是我变成了千禧一代，还是现代音乐真的变成了垃圾？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲2020年將是一個失去音樂的十年。也許這只是我的想法，但我更願意聽我的2000年代復古音樂，而不是打開收音機。\n我更願意聽我的2000年代的回放，而不是打開收音機。我曾與\n我和我的一些朋友談過這個問題，他們也同意。在某種程度上，我認爲\n詞曲作者會開始沒有想法。我在想，如果...",
      "title": "是我變成了千禧一代，還是現代音樂真的變成了垃圾？"
    }
  ]
}