{
  "author": "jazzhands1",
  "the_new_excerpt": "Bitcoin Treasuries tracks corporate and institutional investments in bitcoin.\nLast weekend they reported that institutions have accumulated 215,000 bitcoin in\nthe last 30 days. That's valued at almost $10 billion right now. (data\n[https://bitcointreasuries.org/])\n\nIf you're considering your next…",
  "original_created_utc": 1621308140,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Bitcoin Treasuriesは、企業や機関投資家のビットコインへの投資を追跡しています。\n先週末には、機関投資家が過去30日間で215,000ビットコインを蓄積したと報告しています。\nこの30日間で215,000ビットコインを集めたと報告しています。これは今、ほぼ100億ドルの価値がある。(データ\n[https://bitcointreasuries.org/])\n\nもしあなたが次のことを考えているなら...",
      "title": "大企業はこの30日間で215,000BTC（数十億ドル）を取得しました。今、これらの大企業は、深い割引価格で購入しています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币国债追踪企业和机构对比特币的投资。\n上周末，他们报告说机构在过去30天里积累了215,000个比特币\n在过去的30天里。那现在的价值差不多是100亿美元。(数据\n[https://bitcointreasuries.org/])\n\n如果你正在考虑你的下一个...",
      "title": "在过去30天里，大公司已经收购了215,000个BTC（数十亿美元）。现在，这些巨头正在以极低的折扣购买"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣國債追蹤企業和機構對比特幣的投資。\n上週末，他們報告說機構在過去30天裏積累了215,000個比特幣\n在過去的30天裏。那現在的價值差不多是100億美元。(數據\n[https://bitcointreasuries.org/])\n\n如果你正在考慮你的下一個...",
      "title": "在過去30天裏，大公司已經收購了215,000個BTC（數十億美元）。現在，這些巨頭正在以極低的折扣購買"
    }
  ],
  "title": "Big corporations have acquired 215,000 BTC (billions of $$$) in the last 30 days. Right now, these giants are buying at deep discounts",
  "created_utc": 1621337624,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin Treasuries tracks corporate and institutional investments in bitcoin. Last weekend they reported that institutions have accumulated 215,000 bitcoin in the last 30 days. That&#39;s valued at almost $10 billion right now. (<a href=\"https://bitcointreasuries.org/\">data</a>)</p>\n\n<p>If you&#39;re considering your next move, think about this: There&#39;s always someone with deeper pockets and more cash who will buy the crypto you sell. Selling now means you&#39;re giving up your hard-earned crypto for a fraction of what it&#39;s worth.</p>\n\n<p>They&#39;ll buy your bitcoin at a huge discount today and use it to either drive up or drive down the price in the future. The more they buy, the more they can control the market.</p>\n\n<p>Bottom line: Institutions and corporations will take full advantage of your panic sales now, then they&#39;ll drive the price back up and make you FOMO back in at the high.</p>\n</div><!-- SC_ON -->",
  "score": 381,
  "permalink": "/r/CryptoCurrency/comments/nezwp7/big_corporations_have_acquired_215000_btc/",
  "subreddit": "CryptoCurrency",
  "id": "nezwp7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799681
}