{
  "author": "wagslane",
  "the_new_excerpt": "This community is god damn amazing. When Vlad the impaler decided to lock down\nbuying for $GME and others, I immediately went to leave a negative review on the\nGoogle playstore. Robinhood had a 4.8-star rating. After doing my duty, I came\nback here to check Reddit and saw that others were doing the…",
  "original_created_utc": 1613846840,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个社区真他妈的神奇。当刽子手弗拉德决定封锁 When Vlad the impaler decided to lock down\n为$GME等人买单，我马上就去留了一个负面的评价。\n谷歌Playstore。Robinhood的评分为4.8星。做完我的职责，我来到\n回到这里检查Reddit，看到其他人做的... ...",
      "title": "头版没有一张Robinhood的截图。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個社區真他媽的神奇。當劊子手弗拉德決定封鎖 When Vlad the impaler decided to lock down\n爲$GME等人買單，我馬上就去留了一個負面的評價。\n谷歌Playstore。Robinhood的評分爲4.8星。做完我的職責，我來到\n回到這裏檢查Reddit，看到其他人做的... ...",
      "title": "頭版沒有一張Robinhood的截圖。"
    }
  ],
  "title": "Not a single Robinhood screenshot on the front page",
  "created_utc": 1613860828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This community is god damn amazing. When Vlad the impaler decided to lock down buying for $GME and others, I immediately went to leave a negative review on the Google playstore. Robinhood had a 4.8-star rating. After doing my duty, I came back here to check Reddit and saw that others were doing the same. I refreshed the screen and Robinhood&#39;s average rating had <em>fallen from 4.8 to 1.0 in a matter of minutes.</em></p>\n\n<h2>You guys fucking rock</h2>\n\n<p>By today, I&#39;ve transitioned all my positions out of Robinhood and will soon be closing my account. It is so Goddamn encouraging to scoll the frontpage of this sub and see the usual number of charts <em>but not a single screenshot of Robinhood</em>.</p>\n\n<p>If you haven&#39;t voted with your orderflow, do so now.</p>\n</div><!-- SC_ON -->",
  "score": 31432,
  "permalink": "/r/wallstreetbets/comments/lodpnu/not_a_single_robinhood_screenshot_on_the_front/",
  "subreddit": "wallstreetbets",
  "id": "lodpnu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332892240
}