{
  "author": "manzare",
  "original_created_utc": 1638515690,
  "title": "Why is it that anyone can birth/father a child with virtually no questions asked, but those who want to adopt one has to go through tough screenings, long waiting times and lots of bureaucracy?",
  "created_utc": 1638541711,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Anyone (including irresponsible, financially unstable abusive people) can birth/father a child with virtually no questions asked.&lt;/p&gt;\n\n&lt;p&gt;If we really are concerned with child welfare shouldn&amp;#39;t we put people who want to birth/father a child through the same tough screening process, or lower the bars for adoption? People who enter an adoption process are likely dedicated an responsible adults - which is true for many of the ones having their own children, though often not. The point is that we put zero effort in screening one group and enormous efforts to screening the other.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/r7tbfg/why_is_it_that_anyone_can_birthfather_a_child/",
  "subreddit": "NoStupidQuestions",
  "id": "r7tbfg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Anyone (including irresponsible, financially unstable abusive people) can\nbirth/father a child with virtually no questions asked.\n\nIf we really are concerned with child welfare shouldn't we put people who want\nto birth/father a child through the same tough screening process, or lower the\nbars for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰でも（無責任で経済的に不安定な虐待者を含む）可能な\n事実上、何の疑問も持たずに子供を産んだり、父親にしたりすることができる。\n\nもし、本当に児童福祉を考えるのであれば、子供を産みたいと思う人たちに\n子供を産むこと、父親となることも、同じように厳しい審査を受けるか、または、審査基準を低くする。\nハードルが高い...",
      "title": "誰もが何の疑問も持たずに子供を産み、育てることができるのに、養子を迎えたい人は厳しい審査や長い待機時間、多くの官僚主義を経なければならないのはなぜでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何人（包括不负责任的、经济上不稳定的虐待者）都可以\n生育/养育一个孩子，几乎没有任何问题。\n\n如果我们真的关心儿童福利，难道我们不应该把那些想要\n想生孩子/做父亲的人进行同样严格的筛选过程，或者降低对他们的要求。\n或降低门槛...",
      "title": "为什么任何人都可以在几乎没有问题的情况下生下/养育一个孩子，而那些想收养孩子的人却要经过严格的筛选，漫长的等待时间和大量的官僚主义。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何人（包括不負責任的、經濟上不穩定的虐待者）都可以\n生育/養育一個孩子，幾乎沒有任何問題。\n\n如果我們真的關心兒童福利，難道我們不應該把那些想要\n想生孩子/做父親的人進行同樣嚴格的篩選過程，或者降低對他們的要求。\n或降低門檻...",
      "title": "爲什麼任何人都可以在幾乎沒有問題的情況下生下/養育一個孩子，而那些想收養孩子的人卻要經過嚴格的篩選，漫長的等待時間和大量的官僚主義。"
    }
  ]
}