{
  "author": "hom6872",
  "the_new_excerpt": "link\n[https://www.cnbc.com/2020/12/20/mcconnell-says-congress-has-agreed-to-900-billion-coronavirus-stimulus-deal.html?utm_content=Main&utm_medium=Social&utm_source=Facebook&fbclid=IwAR2uRFFTS_C1F32Pn2swO-ha4pde1W0MUJWq8RZywN_54slLZ-vuG98R7no#Echobox=1608504254]\n\nKEY POINTS Congress reached a deal…",
  "original_created_utc": 1608505210,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "链接\n[https://www.cnbc.com/2020/12/20/mcconnell-says-congress-has-agreed-to-900-billion-coronavirus-stimulus-deal.html?utm_content=Main&utm_medium=Social&utm_source=Facebook&fbclid=IwAR2uRFFTS_C1F32Pn2swO-ha4pde1W0MUJWq8RZywN_54slLZ-vuG98R7no#Echobox=1608504254]\n\n国会达成协议的关键点…",
      "title": "麦康奈尔说，国会同意9000亿美元的冠状病毒刺激协议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鏈接\n[https://www.cnbc.com/2020/12/20/mcconnell-says-congress-has-agreed-to-900-billion-coronavirus-stimulus-deal.html?utm_content=Main&utm_medium=Social&utm_source=Facebook&fbclid=IwAR2uRFFTS_C1F32Pn2swO-ha4pde1W0MUJWq8RZywN_54slLZ-vuG98R7no#Echobox=1608504254]\n\n國會達成協議的關鍵點…",
      "title": "麥康奈爾說，國會同意9000億美元的冠狀病毒刺激協議"
    }
  ],
  "title": "Congress agrees to $900 billion coronavirus stimulus deal, McConnell says",
  "created_utc": 1608510625,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.cnbc.com/2020/12/20/mcconnell-says-congress-has-agreed-to-900-billion-coronavirus-stimulus-deal.html?utm_content=Main&amp;utm_medium=Social&amp;utm_source=Facebook&amp;fbclid=IwAR2uRFFTS_C1F32Pn2swO-ha4pde1W0MUJWq8RZywN_54slLZ-vuG98R7no#Echobox=1608504254\">link</a></p>\n\n<p>KEY POINTS\nCongress reached a deal Sunday on a $900 billion coronavirus relief package, according to Senate Majority Leader Mitch McConnell.\nLawmakers will move to vote on the proposal, along with a full-year government spending bill, as soon as Sunday night.\nMillions of Americans have awaited aid for months as Congress failed to agree on another plan to boost a health-care system and economy buckling under the weight of the pandemic.</p>\n\n<p>Congress reached a deal Sunday on a $900 billion coronavirus relief package, a long-delayed effort to boost an American health-care system and economy buckling under the weight of the pandemic.</p>\n\n<p>Senate Majority Leader Mitch McConnell, R-Ky., announced the agreement on a pandemic aid and full-year government spending bill. He did not delve into many details. Congressional leaders have not yet released text of the more than $2 trillion legislation, which they hope to pass in the coming hours.</p>\n\n<p>The agreement follows months of sniping on Capitol Hill over how best to fight a once-in-a-century crisis. A new round of aid cannot come soon enough for the millions of Americans who have tried to scrape together enough money to afford food and housing.</p>\n\n<p>The $900 billion coronavirus relief plan under negotiation on Capitol Hill was set to include direct payments of $600 to many adults. Some families were also expected to get $600 per child.</p>\n\n<p>The proposal was set to put at least $300 billion into small business assistance including Paycheck Protection Program loans. It would also add a $300 federal unemployment supplement and temporarily keep in place pandemic-era programs that expanded unemployment insurance eligibility.</p>\n\n<p>If those provisions expire the day after Christmas, 12 million people will lose unemployment benefits.</p>\n\n<p>The measure was also set to put critical funding into the distribution of the two FDA-approved Covid-19 vaccines. Health-care workers and top government officials have started to receive shots, and widespread inoculation in the coming months will help the world to emerge from the pandemic’s shadow.</p>\n\n<p>The rescue package was also set to send relief to hospitals, many of which have struggled to keep up with a flood of Covid-19 patients. It was also expected to put new money into education and transportation.</p>\n\n<p>As lawmakers finally reach a deal, the help comes too late for the nearly 8 million people estimated to have fallen into poverty since June. Many in Congress say the proposal will not go nearly far enough to address the scope of the health and economic crisis.</p>\n\n<p>Progressives and some Republicans have pushed for larger direct payments and retroactive federal unemployment payments. A $600 weekly supplement that buoyed millions of jobless Americans in the early months of the pandemic expired over the summer, and it took Congress months to agree to reinstate it.</p>\n</div><!-- SC_ON -->",
  "score": 1393,
  "permalink": "/r/investing/comments/kh4fza/congress_agrees_to_900_billion_coronavirus/",
  "subreddit": "investing",
  "id": "kh4fza",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609183318255
}