{
  "author": "futuraprime",
  "original_created_utc": 1657718255,
  "title": "Milan famously avoided the worst of the Black Death in the 14th century. What were the consequences of its success?",
  "created_utc": 1657752361,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know there’s debate about &lt;em&gt;how&lt;/em&gt; Milan managed this, but it’s generally accepted that for whatever reason, Milan’s death rate during the plague was, though shocking (12-15%, I think?), quite small compared to other northern Italian cities that lost 30-50% of their populations in a few years.&lt;/p&gt;\n\n&lt;p&gt;What were the long term effects of this? Were they suddenly in a position to dominate Lombardy and pressure powerful, more distant neighbours like Venice, Florence, and Savoy? Did it just confirm their own hegemony, and still leave them weakened since their vassals and hinterland were still hard hit? Did Milan become more culturally or economically dominant? Did it help to cement Visconti rule?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vy318a/milan_famously_avoided_the_worst_of_the_black/",
  "subreddit": "AskHistorians",
  "id": "vy318a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know there’s debate about how Milan managed this, but it’s generally accepted\nthat for whatever reason, Milan’s death rate during the plague was, though\nshocking (12-15%, I think?), quite small compared to other northern Italian\ncities that lost 30-50% of their populations in a few years.\n\nWhat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ミランがどのように管理したかについては議論があると思いますが、一般的にはこう言われています。\nミラノのペストによる死亡率は、12〜15％と他の北イタリアのペストと比べると、かなり低いということです。\n他の北イタリアの都市が数年で30〜50％の人口を失ったのに比べれば、かなり少なかった。\n数年で人口の30〜50％を失った他の北イタリアの都市に比べれば、かなり少ないものでした。\n\nなんだ...",
      "title": "ミラノは、14世紀の黒死病の被害を免れたことで有名です。その成功はどのような結果をもたらしたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道对米兰如何管理这个问题有争论，但人们普遍认为\n不管是什么原因，米兰在瘟疫期间的死亡率虽然令人震惊（我想是12-15%吧？\n虽然令人震惊（我想是12-15%），但与意大利北部其他城市相比，米兰的死亡率相当低。\n其他意大利北部城市在几年内损失了30-50%的人口。\n\n什么...",
      "title": "米兰在14世纪避开了最严重的黑死病，这一点非常有名。其成功的后果是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道對米蘭如何管理這個問題有爭論，但人們普遍認爲\n不管是什麼原因，米蘭在瘟疫期間的死亡率雖然令人震驚（我想是12-15%吧？\n雖然令人震驚（我想是12-15%），但與意大利北部其他城市相比，米蘭的死亡率相當低。\n其他意大利北部城市在幾年內損失了30-50%的人口。\n\n什麼...",
      "title": "米蘭在14世紀避開了最嚴重的黑死病，這一點非常有名。其成功的後果是什麼？"
    }
  ]
}