{
  "author": "TridentFH01",
  "the_new_excerpt": "I spent $50,000 on surefire Egyptian bunny rabbit futures. This was money that\nwas supposed to be saved for buying a new house and was mainly accrued from\ndumping pay checks into SPY over the years.\n\nOn the 27th of February , I got tipped off from a buddy that works in the bunny\nbreeding industry.…",
  "original_created_utc": 1616767847,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我花了5万块钱买了肯定的埃及兔子期货。这笔钱\n本来是为了买新房而积攒的，主要是来自于以下几个方面的积累： 1.\n这些年把工资支票倒入SPY公司。\n\n在2月27日，我从一个在兔子公司工作的朋友那里得到了消息\n养殖业....",
      "title": "我已经失去了一切，因为苏伊士运河的惨败对埃及/欧洲复活节兔子未来的运行。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我花了5萬塊錢買了肯定的埃及兔子期貨。這筆錢\n本來是爲了買新房而積攢的，主要是來自於以下幾個方面的積累： 1.\n這些年把工資支票倒入SPY公司。\n\n在2月27日，我從一個在兔子公司工作的朋友那裏得到了消息\n養殖業....",
      "title": "我已經失去了一切，因爲蘇伊士運河的慘敗對埃及/歐洲復活節兔子未來的運行。"
    }
  ],
  "title": "I’ve lost everything because of the Suez Canal fiasco on the Egyptian/ European Easter bunny future run up",
  "created_utc": 1616782830,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I spent $50,000 on surefire Egyptian bunny rabbit futures. This was money that was supposed to be saved for buying a new house and was mainly accrued from dumping pay checks into SPY over the years. </p>\n\n<p>On the 27th of February , I got tipped off from a buddy that works in the bunny breeding industry. He said that due to the pandemic, Europeans were buying pets like crazy, and one animal in particular... bunny rabbits. </p>\n\n<p>Now this made me look into Egyptian bunny futures as they produce the most bunnies in the world. The premiums were amazing, this was like buying fucking apple at IPO. On top of all of this, Easter was just a couple months around the corner and a massive shipment of bunnies was meant to leave Egypt and make its way to a port in France. I’m talking a fucking boat load of carrot munching, sex hungry, “what’s up doc” mother fuckers, not just a container. </p>\n\n<p>So I placed my bet, expiring the week of Easter, for when the shipment would come. Since there were barely any bunnies in France/ all of Europe, there was no supply to meet demand. However, I had it on good authority that prices would barely drop since so many Europeans wanted the little fluffy fucks. </p>\n\n<p>All was going well, my money was going up and it was the most euphoric feeling ever...</p>\n\n<p>Until on Wednesday at 10am, I wake up to check how many unrealized tendies I have. To my horror I was down 48%. I frantically called my aforementioned buddy in the industry and he tells me to look up the Suez canal. </p>\n\n<p>It turns out the shipment was delayed by a day out of Egypt and right after they left port, some big fucking ship decided to block the whole canal. Since Egypt shipped out essentially every last bunny in the damn country, they didn’t need any more bunny food. So every single one of them is going to run out of food over the next week and die on that ship (no point in bringing them back to port cause there’s no food to feed them). Once they arrive in France they will dump the dead bunnies, pick up the next shipment and move on. </p>\n\n<p>Idk how I’m going to tell my wife this, probably gonna need some protection from her boyfriend for a while too. </p>\n\n<p>Wish me luck</p>\n</div><!-- SC_ON -->",
  "score": 19169,
  "permalink": "/r/wallstreetbets/comments/mdpi46/ive_lost_everything_because_of_the_suez_canal/",
  "subreddit": "wallstreetbets",
  "id": "mdpi46",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357147045
}