{
  "author": "Many_Scratch2269",
  "original_created_utc": 1637144987,
  "title": "If you are buying the dip, don't go in all at once.",
  "created_utc": 1637199857,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is extremely unlikely that the market will stop dipping the moment you buy in. You should never expect to perfectly time the market, especially if you are investing in Crypto. Not only that, you&#39;re also not going to have any leverage or control once the market dips more. </p>\n\n<p>I started DCAing from June-August with little amounts of money, I never went all in with a lump sum at the start. I&#39;m currently +260% up with that strategy. If I went all in, I wouldn&#39;t be up this much. There&#39;s always the risk of the market dipping more when you go in, you should never risk it.</p>\n\n<p>TLDR: DCA the dip instead of going in all at once. Trust me, it&#39;s going to give you much less anxiety and much more control over the market.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/qvwequ/if_you_are_buying_the_dip_dont_go_in_all_at_once/",
  "subreddit": "CryptoCurrency",
  "id": "qvwequ",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It is extremely unlikely that the market will stop dipping the moment you buy\nin. You should never expect to perfectly time the market, especially if you are\ninvesting in Crypto. Not only that, you're also not going to have any leverage\nor control once the market dips more.\n\nI started DCAing from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "買った瞬間に相場の下落が止まることは極めて少ない\nのです。特に暗号通貨に投資している場合は、市場のタイミングを完璧に計れると思ってはいけません。\n特に暗号に投資する場合は。それだけでなく、市場がさらに下落した場合には、レバレッジやコントロールが効かなくなります。\nコントロールもできません。\n\nDCAを始めたのは...",
      "title": "ディップを購入する場合は、一気に入らないようにしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你买入的那一刻，市场停止下跌的可能性极小。\n在。你不应该期望完美地把握市场时机，特别是如果你是\n投资于加密货币。不仅如此，你也不会有任何杠杆作用。\n或控制，一旦市场下跌更多。\n\n我开始做DCA，从...",
      "title": "如果你买的是蘸水，不要一下子就进去了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你買入的那一刻，市場停止下跌的可能性極小。\n在。你不應該期望完美地把握市場時機，特別是如果你是\n投資於加密貨幣。不僅如此，你也不會有任何槓桿作用。\n或控制，一旦市場下跌更多。\n\n我開始做DCA，從...",
      "title": "如果你買的是蘸水，不要一下子就進去了。"
    }
  ]
}