{
  "author": "spiritual_pizza630",
  "original_created_utc": 1628097018,
  "title": "Those of you who are homemakers by profession what is your experience doing so?",
  "created_utc": 1628125834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>edit: why on earth am I getting downvoted for asking what it&#39;s like to be a homemaker? </p>\n\n<p>When you made the decision to take on the role of homemaker what if anything did you put aside or have to leave behind?</p>\n\n<p>If you were financial making/career-motivated before making the decision of being a homemaker how has that affected that aspect of your life?</p>\n\n<p>If possible to the women answering to say whether they have a single-income household or a dual-income household and how they think that affects their life/experience as a homemaker.</p>\n</div><!-- SC_ON -->",
  "score": 264,
  "permalink": "/r/AskWomen/comments/oxxavj/those_of_you_who_are_homemakers_by_profession/",
  "subreddit": "AskWomen",
  "id": "oxxavj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "edit: why on earth am I getting downvoted for asking what it's like to be a\nhomemaker?\n\nWhen you made the decision to take on the role of homemaker what if anything did\nyou put aside or have to leave behind?\n\nIf you were financial making/career-motivated before making the decision of\nbeing a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "edit: 「主婦とはどんなものか」と聞いただけでマイナス評価を受けるとは\n尋ねただけで、なぜダウンボットされるのでしょうか？\n\n主婦をやると決めたときに、何かを捨てたり、残したりしたものはありますか？\n捨てたもの、残さなければならないものはありますか？\n\nもし、あなたが主婦になる決断をする前に、経済的にもキャリア的にもやる気があったとしたら、あなたは...\n主婦になることを決める前に",
      "title": "職業として主婦をされている方は、どのような経験をされていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：为什么我问做家庭主妇是什么样子的，会被降权？\n家庭主妇？\n\n当你决定扮演家庭主妇的角色时，如果有什么事情发生，你会怎么做？\n抛开或不得不抛开的东西？\n\n如果你在决定做家庭主妇之前，是以财务/事业为动机的\n成为一名家庭主妇。",
      "title": "那些以家庭主妇为职业的人，你们在这方面有什么经验？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：爲什麼我問做家庭主婦是什麼樣子的，會被降權？\n家庭主婦？\n\n當你決定扮演家庭主婦的角色時，如果有什麼事情發生，你會怎麼做？\n拋開或不得不拋開的東西？\n\n如果你在決定做家庭主婦之前，是以財務/事業爲動機的\n成爲一名家庭主婦。",
      "title": "那些以家庭主婦爲職業的人，你們在這方面有什麼經驗？"
    }
  ]
}