{
  "author": "theluckyowl",
  "the_new_excerpt": "  There's a lot of new people to this page and I see the same question a lot. \"Should I buy Bitcoin now?\". If you're debating, the answer should always be yes. People have this preconceived notion that everyone who posts here have millions invested into Bitcoin and everytime they buy they're…",
  "original_created_utc": 1612834965,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "  这个页面有很多新人，我经常看到同样的问题. \"我现在应该购买比特币吗？\"。如果你在辩论，答案应该永远是 \"是\"。人们有这样一个先入为主的观念，认为每个在这里发帖的人都有几百万的资金投入到比特币中，每次他们买入的时候都是...",
      "title": "如果你正在犹豫要不要买，就买吧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "  這個頁面有很多新人，我經常看到同樣的問題. \"我現在應該購買比特幣嗎？\"。如果你在辯論，答案應該永遠是 \"是\"。人們有這樣一個先入爲主的觀念，認爲每個在這裏發帖的人都有幾百萬的資金投入到比特幣中，每次他們買入的時候都是...",
      "title": "如果你正在猶豫要不要買，就買吧"
    }
  ],
  "title": "If you're debating on buying, just buy",
  "created_utc": 1612885248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><pre><code>  There&#39;s a lot of new people to this page and I see the same question a lot. &quot;Should I buy Bitcoin now?&quot;. If you&#39;re debating, the answer should always be yes. People have this preconceived notion that everyone who posts here have millions invested into Bitcoin and everytime they buy they&#39;re throwing down 10s of thousands of dollars, which just isn&#39;t true. Buying 25 dollars is perfectly fine..Hell, even buying 5 dollars is fine. It&#39;s getting your foot in the door and becoming part of the 1% of the population that owns Bitcoin.\n For myself, I buy every two weeks on pay day. I don&#39;t care about the price because I&#39;m not worried about the price tomorrow, next week or even next year, because I know in 10 to 15 years Bitcoin could easily be worth 500k to 1m. People are so caught up trying to &quot;buy the dip&quot; and get the best price possible, when its almost impossible. If you wanted to get in last night and thought it was to expensive, you woke up to a big surprise when checking the prices this morning. Telsa buying Bitcoin won&#39;t be the first or the last major company to get in on Bitcoin. It&#39;s the future. \n If you&#39;re questioning &quot;where do I even buy bitcoin?!&quot;. I  would recommend using Shakepay if you live in Canada like myself. It&#39;s one of the safest and most trust here. \n If anyone has any questions or is hesitant on buying, please send me a DM and I&#39;ll try my best to help you!\n</code></pre>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/Bitcoin/comments/lfrkdq/if_youre_debating_on_buying_just_buy/",
  "subreddit": "Bitcoin",
  "id": "lfrkdq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123191932
}