{
  "author": "Manualham",
  "original_created_utc": 1642768797,
  "title": "Is being flamboyant a trait that is inherited through birth like being gay? Or learned through media and society?",
  "created_utc": 1642787370,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ok I know this is a weird question, but I don&amp;#39;t know how or who to ask it. Nowadays everything is everywhere, but before the 90s I feel like there wasn&amp;#39;t much to be shown of LGBTQ lifestyles to be able to pick up on the trait. This is pure curiosity, no bigotry or hidden agendas here&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/NoStupidQuestions/comments/s99u6w/is_being_flamboyant_a_trait_that_is_inherited/",
  "subreddit": "NoStupidQuestions",
  "id": "s99u6w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Ok I know this is a weird question, but I don't know how or who to ask it.\nNowadays everything is everywhere, but before the 90s I feel like there wasn't\nmuch to be shown of LGBTQ lifestyles to be able to pick up on the trait. This is\npure curiosity, no bigotry or hidden agendas here",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OK 変な質問なのは分かっているのですが、誰にどう聞けばいいのか分からないのです。\n今でこそ、あらゆるものがあふれていますが、90年代以前は何もなかったような気がします。\nLGBTQのライフスタイルを見せられると、その特徴を拾い上げることができるようになります。これは\n純粋な好奇心であり、偏見や隠れた意図はありません。",
      "title": "派手であることは、ゲイと同じように生まれながらにして受け継がれる特性なのでしょうか？それとも、メディアや社会を通して学ぶものなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我知道这是一个奇怪的问题，但我不知道怎么问，也不知道该问谁。\n现在，一切都无处不在，但在90年代之前，我觉得没有什么\n我觉得在90年代之前，没有多少关于LGBTQ生活方式的资料可以让人了解其特征。这就是\n纯粹的好奇心，这里没有偏执或隐藏的目的。",
      "title": "浮夸是一种像同性恋一样通过出生遗传的特质吗？还是通过媒体和社会学会的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我知道這是一個奇怪的問題，但我不知道怎麼問，也不知道該問誰。\n現在，一切都無處不在，但在90年代之前，我覺得沒有什麼\n我覺得在90年代之前，沒有多少關於LGBTQ生活方式的資料可以讓人瞭解其特徵。這就是\n純粹的好奇心，這裏沒有偏執或隱藏的目的。",
      "title": "浮誇是一種像同性戀一樣通過出生遺傳的特質嗎？還是通過媒體和社會學會的？"
    }
  ]
}