{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "There have been a lot of opinions offered on when we might see the selling stop, but it really all comes down to one issue: inflation.  \n\nInflation is a blank check against the US economy.  It gives the Fed complete power to slow the economy until it can get inflation controlled.  Until investors know what that looks like, they can't possibly make any confident forecasts about the future earnings of companies.  \n\nLet me use an analogy.  You're about to click buy on a big fat engagement ring when your girlfriend texts you at 11 PM on a Monday night and says she wants to talk.  It sounds serious.  Do you buy the ring?  Of course not!  Maybe she wants to talk about something totally unrelated to you, but maybe she met someone else or maybe she has finally thought it over and realized you don't really look that much like Ryan Reynolds.  Who knows, but you can't possibly commit to a big purchase when you don't even know if the relationship is on solid ground.\n\nHow can investors possibly know how to discount future earnings if they don't know whether the terminal rate is going to be 2% or 5% or 8%?  Those three numbers would mean very, very different things for the US economy.  It's the difference between Powell's soft-ish landing and a full-on canned tuna and reusable toilet paper recession.  \n\nCompanies would make vastly different amounts of money in those three scenarios, and until investors have some idea about what will be needed in order to control inflation, things are very unlikely to turn around.  And from where I'm sitting, we have no clue whatsoever what kind of terminal rate will be needed.  Significant portions of inflation are driven by artifical forces, like oil disruption due to Ukraine or supply chain disruption due to Covid.  This makes predicting the effects of higher rates very hard.  \n\n\nMy less-convicted, armchair guess:   I think we see these 1-2% weekly bleeds until the market is given clarity one way or the other.  I don't think we see any huge one-day selloffs in the near-term unless some drastic comments from Powell drop.  The next CPI report isn't until June 10, so it's hard for me to see how we have much to make big moves on for a few weeks.  If the 1-2% bleeds continue long enough, we could end up in crash territory.  We're only several months of 1-2% weekly drops away from the S&amp;P being down 40%.  So it's conceivable, and I honestly think we need some good news from actual inflation data to prevent this.",
  "author_fullname": "t2_lembv4rl",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Inflation is a blank check against the economy. There can be no turnaround until it's controlled.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_urf49y",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.82,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1652764437,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There have been a lot of opinions offered on when we might see the selling stop, but it really all comes down to one issue: inflation.  &lt;/p&gt;\n\n&lt;p&gt;Inflation is a blank check against the US economy.  It gives the Fed complete power to slow the economy until it can get inflation controlled.  Until investors know what that looks like, they can&amp;#39;t possibly make any confident forecasts about the future earnings of companies.  &lt;/p&gt;\n\n&lt;p&gt;Let me use an analogy.  You&amp;#39;re about to click buy on a big fat engagement ring when your girlfriend texts you at 11 PM on a Monday night and says she wants to talk.  It sounds serious.  Do you buy the ring?  Of course not!  Maybe she wants to talk about something totally unrelated to you, but maybe she met someone else or maybe she has finally thought it over and realized you don&amp;#39;t really look that much like Ryan Reynolds.  Who knows, but you can&amp;#39;t possibly commit to a big purchase when you don&amp;#39;t even know if the relationship is on solid ground.&lt;/p&gt;\n\n&lt;p&gt;How can investors possibly know how to discount future earnings if they don&amp;#39;t know whether the terminal rate is going to be 2% or 5% or 8%?  Those three numbers would mean very, very different things for the US economy.  It&amp;#39;s the difference between Powell&amp;#39;s soft-ish landing and a full-on canned tuna and reusable toilet paper recession.  &lt;/p&gt;\n\n&lt;p&gt;Companies would make vastly different amounts of money in those three scenarios, and until investors have some idea about what will be needed in order to control inflation, things are very unlikely to turn around.  And from where I&amp;#39;m sitting, we have no clue whatsoever what kind of terminal rate will be needed.  Significant portions of inflation are driven by artifical forces, like oil disruption due to Ukraine or supply chain disruption due to Covid.  This makes predicting the effects of higher rates very hard.  &lt;/p&gt;\n\n&lt;p&gt;My less-convicted, armchair guess:   I think we see these 1-2% weekly bleeds until the market is given clarity one way or the other.  I don&amp;#39;t think we see any huge one-day selloffs in the near-term unless some drastic comments from Powell drop.  The next CPI report isn&amp;#39;t until June 10, so it&amp;#39;s hard for me to see how we have much to make big moves on for a few weeks.  If the 1-2% bleeds continue long enough, we could end up in crash territory.  We&amp;#39;re only several months of 1-2% weekly drops away from the S&amp;amp;P being down 40%.  So it&amp;#39;s conceivable, and I honestly think we need some good news from actual inflation data to prevent this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "urf49y",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "gravcycrunnow",
  "discussion_type": null,
  "num_comments": 42,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/urf49y/inflation_is_a_blank_check_against_the_economy/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/urf49y/inflation_is_a_blank_check_against_the_economy/",
  "subreddit_subscribers": 4057514,
  "created_utc": 1652779400,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1652764437,
  "the_new_excerpt": "There have been a lot of opinions offered on when we might see the selling stop,\nbut it really all comes down to one issue: inflation.\n\nInflation is a blank check against the US economy. It gives the Fed complete\npower to slow the economy until it can get inflation controlled. Until investors\nknow…"
}