{
  "author": "itsjustwizhere",
  "the_new_excerpt": "I’ve been seeing a lot of people build different tools in stocks and wsb that\ntrack social mentions and sentiment analysis for different stocks.\n\nSome of the good ones I’ve used include marketstream, quiverquant, unbiastock,\ngambiste etc\n\nNone of them are perfect though. You still need to filter…",
  "original_created_utc": 1614581283,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经看到很多人在股票和wsb中建立了不同的工具。\n追踪不同股票的社交提及和情绪分析。\n\n我用过的好的包括marketstream、quiverquant、unbiastock。\n赌博等\n\n不过他们都不完美。你还是需要过滤...",
      "title": "我分析了我发现的3只合法股票，使用不同的工具，跟踪社交提及和情感数据。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經看到很多人在股票和wsb中建立了不同的工具。\n追蹤不同股票的社交提及和情緒分析。\n\n我用過的好的包括marketstream、quiverquant、unbiastock。\n賭博等\n\n不過他們都不完美。你還是需要過濾...",
      "title": "我分析了我發現的3只合法股票，使用不同的工具，跟蹤社交提及和情感數據。"
    }
  ],
  "title": "I analyzed 3 legit stocks that I found using different tools that track social mentions and sentiment data",
  "created_utc": 1614594813,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been seeing a lot of people build different tools in stocks and wsb that track social mentions and sentiment analysis for different stocks.</p>\n\n<p>Some of the good ones I’ve used include marketstream, quiverquant, unbiastock, gambiste etc</p>\n\n<p>None of them are perfect though. You still need to filter through the pump &amp; dump/meme stocks to find companies that are actually worth paying attention to.</p>\n\n<p>So I spent most of the past week doing DD on a handful of stocks that these tools found that I thought were interesting.</p>\n\n<p>Here’s what I found:</p>\n\n<p>P.S. Stonks don’t always go up</p>\n\n<p>P.P.S. Always DYOR</p>\n\n<p>P.P.P.S. If you find this useful I write similar reports every week at TickerNerd</p>\n\n<p><strong>Mohawk Group Holdings ($MWK)</strong></p>\n\n<p>Summary:</p>\n\n<ul>\n<li>Mohawk uses AI and machine learning to identify and acquire DTC brands.</li>\n<li>They recently acquired Healing Solutions, an essential oils brand that is expected to increase their revenue by $20-$50 million.</li>\n<li>They&#39;ve already made several strategic acquisitions like this and plan to continue this approach to scale their revenue.</li>\n<li>Their software gives them a unique advantage over competitors plus allows them to make more profit from the brands they acquire.</li>\n</ul>\n\n<p><strong>What they do:</strong></p>\n\n<p>Mohawk Group taps into 2 major trends that aren’t going away anytime soon: e-commerce and artificial intelligence.</p>\n\n<p>Their Artificial Intelligence Mohawk E-commerce Engine (AIMEE), Mohawk uses huge amounts of data and machine learning to research and identify which consumer products sell online then either launch or acquire brands in these niches.</p>\n\n<p>This has allowed Mohawk to build a mini-conglomerate of consumer packaged goods (CPG) brands that sell mainly through Amazon.</p>\n\n<p><strong>Why they’re getting hype:</strong></p>\n\n<p>According to Unbiastock.com total Reddit mentions of Mohawk Group increased by more than 2500% from 02/19/21 to 02/21/21. This was most likely due to Mohawk’s strategic acquisition of Healing Solutions, a leading online seller of essential oils.</p>\n\n<p>The acquisition is expected to bump MWK’s revenue upwards to around $340 million to $370 million, as indicated by Mohawk’s adjusted outlook for the 2021 financial year.</p>\n\n<p><strong>Why MWK could be valuable:</strong></p>\n\n<p>Mohawk has already made a number of acquisitions and plans to continue making more in the future.</p>\n\n<p>Mohawk’s management never explained exactly why they acquired these brands but you can bet it was because AIMEE identified something in the company or the market that made Mohawk pull the trigger.</p>\n\n<p>Mohawk’s acquisitions can become profitable fairly quickly too.</p>\n\n<p>For example they acquired Healing Solutions at 3.8 times operating income, a surprisingly cheap multiple, but one that is normal when dealing with smaller CPG companies. If profits stay at these levels or grow, Mohawk will recoup all of its acquisition cost in just a few years.</p>\n\n<p>Once they acquire these brands Mohawk also uses AIMEE to optimize sales and marketing in a more efficient manner to hit bigger revenue targets than what the company would do on its own.</p>\n\n<p>Mohawk is able to rinse and repeat this strategy to keep boosting their net income.</p>\n\n<p>Mohawk also sells its AIMEE software to other online sellers through a software-as-a-service (SaaS) model.</p>\n\n<p>Revenue from the segment is currently only a tiny portion of Mohawk&#39;s overall business, but it has high margins and a huge market opportunity. For reference, there are over 2.5 million active sellers on Amazon alone that Mohawk can target with this software.</p>\n\n<p><strong>What the risks are:</strong></p>\n\n<p>Mohawk’s model relies heavily on Amazon’s platform to reach their customers. For now this isn’t an issue but there can be risks relying on one main source of traffic to their stores. If Amazon decides to make major changes to their algorithm or seller rules this could hurt Mohawk’s brands.</p>\n\n<p>Their market cap is around $840 million and the stock has a price-to-sales ratio of 3.9, making the valuation a bit rich, but not overblown when considering what management believes long-term profit margins can get to.</p>\n\n<p>If you believe in the growth of third-party sellers on Amazon and other e-commerce platforms and want to put your money behind it, Mohawk Group could be the best way to do that. The stock might be up over 400% in the past three months, but it is still early innings for this tech-enabled CPG conglomerate.</p>\n\n<p><strong>Hims &amp; Hers Health ($HIMS)</strong></p>\n\n<p>Summary:</p>\n\n<ul>\n<li>Hims makes it easy to order health products as well as speak to doctor&#39;s remotely using their platform.</li>\n<li>In late January 2021 Cathie Wood&#39;s ARK bought around 461 thousand shares in Hims giving investors a huge boost in optimism for the company.</li>\n<li>Hims was founded in 2017 and quickly hit $27 million in sales in their first year and are now on track to generate $179 million in 2021.</li>\n<li>They now have plans to expand into other &quot;telehealth friendly&quot; services as well as international markets.</li>\n</ul>\n\n<p><strong>What they do:</strong></p>\n\n<p>Hims is an internet pharmacy and telemedicine startup that went public via a S.P.AC  in late January 2021.<strong>I analyzed 3 legit stocks that I found using different tools that track social mentions and sentiment data</strong></p>\n\n<p>The company aims to help men (and women, thanks to a new expansion) save time, money, and the potential embarrassment of a doctor&#39;s appointment by delivering health products to customers&#39; doorsteps, with no shipping costs.</p>\n\n<p>These include prescriptions for erectile dysfunction, hair loss, skincare and anti-aging solutions, mental health services and even COVID-19 testing kits.</p>\n\n<p><strong>Why they’re getting hype:</strong></p>\n\n<p>According to Unbiastock.com, Reddit interest in Hims increased by 7244% when comparing February 2021 to the previous month.</p>\n\n<p>This spike happened around the same time Cathie Wood’s ARK Investment Management disclosed an ownership position in the company adding ~461k shares to their portfolio.</p>\n\n<p>For those who don’t know Cathie Wood a.k.a Aunt Cathie grew ARK’s assets by 11x in 2020 to $34.5b with their focus on innovative, high growth tech stocks. Her investment in Hims is a huge vote of confidence in the long term prospects of the company.</p>\n\n<p><strong>Why HIMS could be valuable:</strong></p>\n\n<p>The rise of the telehealth industry is one of the biggest megatrends that benefited from the global pandemic.</p>\n\n<p>That’s not the only thing Hims has going for them. Their primary target market is millennials.</p>\n\n<p>They’re well positioned to continue building up their market share in this still-young demographic, with the oldest millennials turning 40 this year and the youngest ones at 25 years old.</p>\n\n<p>As millennials get older, they aren’t going to be satisfied with the “old school” healthcare model. So, Hims has the potential to capture the market now and hold onto it in the coming decades.</p>\n\n<p>They’re also growing fast. After starting in 2017 they managed to hit $27 million in sales in their first year. They’re now projected to generate $179 million this year and $233 million in 2022.</p>\n\n<p>Hims estimates that the telehealth industry could reach a $500 billion total addressable market. They also have plans to expand into other “telehealth friendly” markets with international expansion on the table as well.</p>\n\n<p><strong>What the risks are:</strong></p>\n\n<p>Healthcare startups including Hims and their competitor Roman have been criticized for making getting a prescription for hair loss treatments, ED pills, and beta blockers a little too cool — and possibly too easy.</p>\n\n<p>They have been the subject of reports from Bloomberg, The New York Times, and other outlets questioning the ethics and legal implications of pushing prescription medication with very little (or no) oversight.</p>\n\n<p>It’s possible Hims could find themselves in a regulatory battle similar to Uber or Airbnb as they continue to grow.</p>\n\n<p><strong>Vuzix ($VUZI)</strong></p>\n\n<p>Summary:</p>\n\n<ul>\n<li>Vuzix creates wearable VR/AR technology for consumers and businesses.</li>\n<li>Vuzix was another stock picked up by ARK who bought 292 thousand shares on 02/19/21.</li>\n<li>Vuzix already has several big name customers including Verizon and Clorox Co. Their technology is being used in industries such as manufacturing, healthcare and telemedicine.</li>\n<li>Wall Street analysts are still bullish Vuzix has room to run despite surging over 500% during the past 12 months.</li>\n</ul>\n\n<p><strong>What they do:</strong></p>\n\n<p>Vuzix Corp is a supplier of smart glasses, AR technologies, and products for consumer and enterprise markets. Founded in 1997, Vuzix is one of the pioneers of AR, wearable computing, optics, and display engines.</p>\n\n<p>While AR—alongside virtual reality (VR)—only became buzzwords in recent years, Vuzix has been delivering tech solutions to customers for more than 20 years.</p>\n\n<p><strong>Why they’re getting hype:</strong></p>\n\n<p>Reddit interest in Vuzix has surged by more than 17000% in February alone according to Unbiastock.com.</p>\n\n<p>Vuzix was also recently snapped up by ARK who added 292k shares to their ARK Autonomous Technology &amp; Robotics ETF ($ARKQ) on 02/19/21.</p>\n\n<p>Even though they’ve already surged over 500% in the past 12 months, analysts are bullish Vuzix still has more room to run as the adoption of AR technology becomes more mainstream.</p>\n\n<p><strong>Why VUZI could be valuable:</strong></p>\n\n<p>AR and VR are usually associated with gaming.</p>\n\n<p>But you won’t find a Vuzix-branded gaming headset. Instead, the company is mostly known for providing AR head-mounted displays in the form of smart glasses. These products have enjoyed increasing adoption in the enterprise and health-care world.</p>\n\n<p>For example, smart glasses can help with barcode scanning, order picking, and fulfillment in warehouses. In the manufacturing industry, they can facilitate work instructions, step confirmation, and quality assurance.</p>\n\n<p>For field services, smart glasses enable remote support. Thanks to their lightweight design and flexible hardware, Vuzix’s smart glasses are ideal for use in health care and telemedicine.</p>\n\n<p>Although Vuzix is not a big-name company, they already have many big-name customers.</p>\n\n<p>Some notable examples include Verizon ($VZ) who are working with Vuzix to co-develop a 5G-enabled smart glasses emergency medical service (EMS) solution and Clorox Co ($CLX) have started using “Vuzix M400” smart glasses to address the operational challenges brought upon by COVID-19.</p>\n\n<p><strong>What the risks are:</strong></p>\n\n<p>It’s still early days for Vuzix. Their current share price has already priced in big expectations on their future profits.</p>\n\n<p>Five-star rated Wall Street analyst Jack Vander Aarde still thinks they have a lot of room to run “we believe it would be reasonable for VUZI to trade at a premium to peers, based on our view that VUZI is well-positioned for multi-year revenue growth of 100%+ (which we consider rare).&quot;</p>\n\n<p>“We believe its commercially ready technology and product portfolio is ahead of competitors, which we expect to result in VUZI having a dominant share of the nascent and rapidly expanding AR/VR wearables market.”</p>\n\n<p>If you want to bet on the future of AR and VR technology Vuzix could be a great opp.</p>\n\n<p>Let me know what you think :)</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/stocks/comments/lv2c57/i_analyzed_3_legit_stocks_that_i_found_using/",
  "subreddit": "stocks",
  "id": "lv2c57",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937743326
}