{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "As a disclaimer, I am not trying to ''educate'' anyone or act like I know it all. I am far from an expert, and I will never consider myself as such out of respect for the complexity of stock-picking, but after reading the major works of Howard Marks, Graham, Buffet, Munger, and having observed my own behavior and others around me during good and bad times, my major approach sums up to the following sentence:\n\n\"You're neither right nor wrong because people agree with you or disagree with you. In other words, being contrarian has no special virtue over being a trend follower. You’re right because your facts and reasoning are right.\"\n\n(Not sure if Buffet or Graham said it, but anyways)\n\nIt might seem like an obvious statement, but in my experience it's far from it...\n\nI think there is a reason why Munger states knowledge in psychology and human nature is of immense importance when it comes to investment decisions, likewise, I also understand now why they are so critical of some business schools and their way of approaching the market; as if it was a robotic machine with predictable outcomes with no interference of human emotions.\n\nI read news a lot and like to I listen to people, and I have noticed that when times are good, people will always rationalize over why a stock will continue increasing. Not too long ago, if we take Meta as an example, you wouldn't hear too many bad things being said about it. A safe blue chip stock, has monopolized all social media, and what not... But now that it has taken a major nose-dive (in stock price, very unproportional to corresponding loss of the company itself) you will hear everywhere, from analysts, people, news outlets that it's ''over'', the future looks ''hazy'', ''TkTok is rising'', ''Metaverse won't work out'' Whatever... I am not into that stuff, they might be right, and they might be wrong. I don't know. But the point is, if people truly had the conviction they had previous to the nose-dive, now would be the perfect time to invest a huge chunk in such a company. But most don't, this just proves it was all a bluff. They never truly believed in it, it was all emotions. Once again, psychology... Human emotions... Just like when times are good, they only saw the strengths of the company and no weaknesses, now that times are bad, they can only see the weakness of the company and no strengths, and they can only come up with reasons why it might go to shit.\n\nSame thing with Tesla right now, I look around me and the majority can only see what's fantastic about the company. They have the best production rate, the best factories, the best batteries, the best engineers, branding power, whatever... I don't even know whether it's true, I'm not into this sector, this is just what I hear all the time around me. How would the opinions of majority of these people change if say Tesla nose-drived like Meta or Alibaba did right now? Say 50-60% because of just one missed quarter? I am willing to bet people will start saying ''the automobile industry is tough'', ''VW's catching up, their engineers are better...''.\n\nNow those are just generalized examples to get my point across, but bottom line is, behavior like this is not surprising to me anymore, and there is a reason only a selected few will achieve desirable outcomes long-term, because as the quote in the beginning states, it's not about being a contrarian for the sake of being contrarian, or just following the flow. It's about making rational decisions and having this ''temperament'' that is often talked about, so that you're not dragged down by the panic and mania around you.",
  "author_fullname": "t2_12saip",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "What is ONE idea or mindset you hold onto with dear life when making investment decisions? Here is mine:",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_u0fw0u",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.85,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 49,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 49,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1649591182,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1649590954,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a disclaimer, I am not trying to &amp;#39;&amp;#39;educate&amp;#39;&amp;#39; anyone or act like I know it all. I am far from an expert, and I will never consider myself as such out of respect for the complexity of stock-picking, but after reading the major works of Howard Marks, Graham, Buffet, Munger, and having observed my own behavior and others around me during good and bad times, my major approach sums up to the following sentence:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;You&amp;#39;re neither right nor wrong because people agree with you or disagree with you. In other words, being contrarian has no special virtue over being a trend follower. You’re right because your facts and reasoning are right.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;(Not sure if Buffet or Graham said it, but anyways)&lt;/p&gt;\n\n&lt;p&gt;It might seem like an obvious statement, but in my experience it&amp;#39;s far from it...&lt;/p&gt;\n\n&lt;p&gt;I think there is a reason why Munger states knowledge in psychology and human nature is of immense importance when it comes to investment decisions, likewise, I also understand now why they are so critical of some business schools and their way of approaching the market; as if it was a robotic machine with predictable outcomes with no interference of human emotions.&lt;/p&gt;\n\n&lt;p&gt;I read news a lot and like to I listen to people, and I have noticed that when times are good, people will always rationalize over why a stock will continue increasing. Not too long ago, if we take Meta as an example, you wouldn&amp;#39;t hear too many bad things being said about it. A safe blue chip stock, has monopolized all social media, and what not... But now that it has taken a major nose-dive (in stock price, very unproportional to corresponding loss of the company itself) you will hear everywhere, from analysts, people, news outlets that it&amp;#39;s &amp;#39;&amp;#39;over&amp;#39;&amp;#39;, the future looks &amp;#39;&amp;#39;hazy&amp;#39;&amp;#39;, &amp;#39;&amp;#39;TkTok is rising&amp;#39;&amp;#39;, &amp;#39;&amp;#39;Metaverse won&amp;#39;t work out&amp;#39;&amp;#39; Whatever... I am not into that stuff, they might be right, and they might be wrong. I don&amp;#39;t know. But the point is, if people truly had the conviction they had previous to the nose-dive, now would be the perfect time to invest a huge chunk in such a company. But most don&amp;#39;t, this just proves it was all a bluff. They never truly believed in it, it was all emotions. Once again, psychology... Human emotions... Just like when times are good, they only saw the strengths of the company and no weaknesses, now that times are bad, they can only see the weakness of the company and no strengths, and they can only come up with reasons why it might go to shit.&lt;/p&gt;\n\n&lt;p&gt;Same thing with Tesla right now, I look around me and the majority can only see what&amp;#39;s fantastic about the company. They have the best production rate, the best factories, the best batteries, the best engineers, branding power, whatever... I don&amp;#39;t even know whether it&amp;#39;s true, I&amp;#39;m not into this sector, this is just what I hear all the time around me. How would the opinions of majority of these people change if say Tesla nose-drived like Meta or Alibaba did right now? Say 50-60% because of just one missed quarter? I am willing to bet people will start saying &amp;#39;&amp;#39;the automobile industry is tough&amp;#39;&amp;#39;, &amp;#39;&amp;#39;VW&amp;#39;s catching up, their engineers are better...&amp;#39;&amp;#39;.&lt;/p&gt;\n\n&lt;p&gt;Now those are just generalized examples to get my point across, but bottom line is, behavior like this is not surprising to me anymore, and there is a reason only a selected few will achieve desirable outcomes long-term, because as the quote in the beginning states, it&amp;#39;s not about being a contrarian for the sake of being contrarian, or just following the flow. It&amp;#39;s about making rational decisions and having this &amp;#39;&amp;#39;temperament&amp;#39;&amp;#39; that is often talked about, so that you&amp;#39;re not dragged down by the panic and mania around you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "u0fw0u",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "SamWrestling",
  "discussion_type": null,
  "num_comments": 26,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/u0fw0u/what_is_one_idea_or_mindset_you_hold_onto_with/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/u0fw0u/what_is_one_idea_or_mindset_you_hold_onto_with/",
  "subreddit_subscribers": 3873433,
  "created_utc": 1649597382,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1649590954,
  "the_new_excerpt": "As a disclaimer, I am not trying to ''educate'' anyone or act like I know it\nall. I am far from an expert, and I will never consider myself as such out of\nrespect for the complexity of stock-picking, but after reading the major works\nof Howard Marks, Graham, Buffet, Munger, and having observed my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、誰かを「教育」しようとか、自分が知っているかのように振舞おうとは思っていません。\nすべてです。私は専門家とは程遠く、また専門家であると考えることはありません。\nしかし、このような株選びの複雑さに対して敬意を表し、主要な著作を読んでみたところ\nハワード・マークス、グレアム、バフェット、マンガー、そして私の...",
      "title": "投資判断の際に大切にしている考え方やマインドセットは何ですか？私の場合はこうです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为免责声明，我不是要''教育''任何人，也不是要表现得像我知道这一切\n所有。我远不是专家，而且我永远不会认为自己是专家。\n尊重选股的复杂性，但在阅读了霍华德-马克斯（Howard Marks）、格雷厄姆（Graham）、马萨诸位的主要作品之后\n霍华德-马克斯、格雷厄姆、巴菲特、芒格的主要作品，并观察了我的...",
      "title": "在做投资决定时，你所坚持的一个想法或思维方式是什么？这是我的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲免責聲明，我不是要''教育''任何人，也不是要表現得像我知道這一切\n所有。我遠不是專家，而且我永遠不會認爲自己是專家。\n尊重選股的複雜性，但在閱讀了霍華德-馬克斯（Howard Marks）、格雷厄姆（Graham）、馬薩諸位的主要作品之後\n霍華德-馬克斯、格雷厄姆、巴菲特、芒格的主要作品，並觀察了我的...",
      "title": "在做投資決定時，你所堅持的一個想法或思維方式是什麼？這是我的。"
    }
  ]
}