{
  "author": "a-tiberius",
  "original_created_utc": 1640547405,
  "title": "For everyone wondering if it's \"too late to invest in Bitcoin\"",
  "created_utc": 1640586812,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Stocks have statistically returned 8-11% every single year since the 1940s. Crypto has been soaring to higher lows every year, and it&amp;#39;s showing no signs of stopping now. All time highs are nice, and everyone loves when a coin moons, but the real value with crypto investments is yearly returns. The technology that powers crypto gives it it&amp;#39;s value, and it&amp;#39;s only becoming more streamlined, mainstream, and &lt;em&gt;stable&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;Crypto.com is getting their own &lt;em&gt;stadium&lt;/em&gt; named after them. If this doesn&amp;#39;t scream &amp;quot;invest now before it hits the banks&amp;quot; then I don&amp;#39;t know what does.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s coming, the future of crypto is coming and it&amp;#39;s certainly not too early.&lt;/p&gt;\n\n&lt;p&gt;To put things into perspective, would you go to a financial advisor and ask if it was too early to invest in stocks? Of course not, because the answer would always be &amp;quot;no&amp;quot;. It&amp;#39;s all about &lt;em&gt;how long you plan to invest&lt;/em&gt;. 1 year in stocks won&amp;#39;t get you much, but 40 years in a 401(k) will leave you with an amazing retirement fund if invested properly. Time is your friend in stocks, and also in crypto.&lt;/p&gt;\n\n&lt;p&gt;Is it too late to invest in Tesla? Nope. Apple? Nope. Bitcoin? Nope. Ethereum? Nope. We&amp;#39;re just getting started, and even after the future is shaped by crypto it still won&amp;#39;t be too late.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s never too late, ever. &lt;em&gt;Time in the market beats timing the market. Always&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/rp43uy/for_everyone_wondering_if_its_too_late_to_invest/",
  "subreddit": "CryptoCurrency",
  "id": "rp43uy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Stocks have statistically returned 8-11% every single year since the 1940s.\nCrypto has been soaring to higher lows every year, and it's showing no signs of\nstopping now. All time highs are nice, and everyone loves when a coin moons, but\nthe real value with crypto investments is yearly returns. The…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "株式は1940年代以降、統計的に毎年8～11％のリターンを記録しています。\n暗号は毎年安値を更新しており、その兆候は全くありません。\n今、その勢いは止まりません。史上最高値もいいし、コインが満月になるのは誰でも好きですが\n暗号投資の真価は年単位のリターンにあります。その...",
      "title": "\"ビットコインに投資するのはもう遅い \"と思っている皆さんへ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据统计，自1940年代以来，股票每年都有8-11%的回报。\n而加密货币每年都在飙升到更高的低点，而且现在没有迹象表明\n现在还没有停止的迹象。所有时间的高点是好的，每个人都喜欢硬币的月亮，但\n但加密货币投资的真正价值在于每年的回报。这是我的观点。",
      "title": "对于每个想知道是否 \"投资比特币太晚 \"的人来说"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據統計，自1940年代以來，股票每年都有8-11%的回報。\n而加密貨幣每年都在飆升到更高的低點，而且現在沒有跡象表明\n現在還沒有停止的跡象。所有時間的高點是好的，每個人都喜歡硬幣的月亮，但\n但加密貨幣投資的真正價值在於每年的回報。這是我的觀點。",
      "title": "對於每個想知道是否 \"投資比特幣太晚 \"的人來說"
    }
  ]
}