{
  "author": "WonderfulIngenuity95",
  "the_new_excerpt": "I was thinking about this the other day and I remember seeing people in this sub\nthat have portfolios that hold more than 30 stocks. I've seen upwards to 50+\nstocks in one portfolio.\n\nPersonally, my portfolio has roughly 15 stocks and in the New Years I made a few\nrotations and now currently have 12…",
  "original_created_utc": 1617909354,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、このことについて考えていたのですが、このサブの方で30銘柄以上のポートフォリオを持っている方を見た記憶があります。\n30銘柄以上のポートフォリオを持っている人を見たことがあります。1つのポートフォリオに50以上の銘柄が入っているのを見たことがあります。\n銘柄以上のポートフォリオを見たことがあります。\n\n個人的には、私のポートフォリオはおよそ15銘柄で、新年にいくつかのローテーションをして\n新年にいくつかの銘柄を入れ替えて、現在は12銘柄を持っています。",
      "title": "30以上の株を持っている方へ-なぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前几天我在想这个问题，我记得在这个子上看到有人\n有投资组合，持有超过30只股票。我已经看到了高达50+\n股票在一个投资组合中。\n\n就我个人而言，我的投资组合中大概有15只股票，在新年里我做了几只\n轮换，目前有12...",
      "title": "对于拥有30只以上股票的人来说--为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天我在想這個問題，我記得在這個子上看到有人\n有投資組合，持有超過30只股票。我已經看到了高達50+\n股票在一個投資組合中。\n\n就我個人而言，我的投資組合中大概有15只股票，在新年裏我做了幾隻\n輪換，目前有12...",
      "title": "對於擁有30只以上股票的人來說--爲什麼？"
    }
  ],
  "title": "For Those Owning 30+ Stocks - Why?",
  "created_utc": 1617921719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was thinking about this the other day and I remember seeing people in this sub that have portfolios that hold more than 30 stocks. I&#39;ve seen upwards to 50+ stocks in one portfolio.</p>\n\n<p>Personally, my portfolio has roughly 15 stocks and in the New Years I made a few rotations and now currently have 12 individual companies. I have a goal to analyze one company a week. I would gather up news articles, etc. throughout the week and read the annual/ quarterly reports throughout the week and do all the financial analysis and modelling on the weekend. This is typically enough work for me to keep me busy, along with keeping up to date with the ER for the current holdings. </p>\n\n<p>Which brings me to a few questions in your massive portfolio: how are you keeping up to date with them and how are you selecting them? If you are investing to &quot;diversify&quot; your portfolio, why don&#39;t you just use an ETF to diversify instead?</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/stocks/comments/mmz6hl/for_those_owning_30_stocks_why/",
  "subreddit": "stocks",
  "id": "mmz6hl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617816
}