{
  "author": "upremus",
  "original_created_utc": 1634465563,
  "title": "Which coin/token will be the winner of the upcoming altseason?",
  "created_utc": 1634506451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As you know and it looks like it could be altseason soon. \nAltseason the part of the cryptocurrency market cycle when many altcoins are rapidly rising in price against the dollar and bitcoin at the same time (for example, late 2017 - early 2018). \nThe time in which so altcoins are gaining value against bitcoin.\nIt&#39;s pretty much Christmas for crypto traders. </p>\n\n<p>As the last years/cycles have shown it comes to strong gains of the alts. For many, these levels reached then remain and do not go below.</p>\n\n<p>What do you think which coin/token will be the winner of the upcoming alt season and why? \nWhich ones will reach new levels and stay there?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/q9vzhm/which_cointoken_will_be_the_winner_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "q9vzhm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As you know and it looks like it could be altseason soon. Altseason the part of\nthe cryptocurrency market cycle when many altcoins are rapidly rising in price\nagainst the dollar and bitcoin at the same time (for example, late 2017 - early\n2018). The time in which so altcoins are gaining value…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知の通りで、もうすぐアルツハイマー病の季節になりそうです。Altseasonとは、暗号通貨市場のサイクルの中で\n暗号通貨市場のサイクルの中で、多くのアルトコインが急激に価格を上昇させている時のことです。\nドルやビットコインに対して同時に上昇することです（例えば、2017年後半～2018年前半\n2018). そうアルトコインが価値を高めている時期...",
      "title": "次のアルトシーズンでは、どのコイン／トークンが優勝するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如你所知道的那样，而且看起来很快就会进入淡季。涨价季是加密货币市场周期的一部分\n加密货币市场周期的一部分，当许多替代币的价格迅速上升时\n对美元和比特币的价格同时快速上涨（例如，2017年底至2017年初）。\n2018). 在如此altcoins获得价值的时间...",
      "title": "哪种钱币/代币将成为即将到来的altseason的赢家？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如你所知道的那樣，而且看起來很快就會進入淡季。漲價季是加密貨幣市場週期的一部分\n加密貨幣市場週期的一部分，當許多替代幣的價格迅速上升時\n對美元和比特幣的價格同時快速上漲（例如，2017年底至2017年初）。\n2018). 在如此altcoins獲得價值的時間...",
      "title": "哪種錢幣/代幣將成爲即將到來的altseason的贏家？"
    }
  ]
}