{
  "author": "Brybro07",
  "the_new_excerpt": "Wasn’t that exciting of a race as it was a very clean race with only 2 minor\ncautions. Either way, it was super exciting to watch and the end was thrilling!\n\nAs for the reason for this post, I think it needs to be emphasized how big of a\ndeal it was to see Bitcoin sponsor an Indy car. On top of…",
  "original_created_utc": 1622410257,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2回のマイナーコーションがあっただけで、非常にクリーンなレースだったため、それほどエキサイティングなレースではありませんでした。\n興奮するようなレースではありませんでした。いずれにしても、見ていてとても興奮しましたし、最後はスリリングでした\n\nこの記事を書いた理由としては、私は、このレースを見たことがどれほど大きな出来事だったかを強調する必要があると思います。\nこの記事を書く理由は、ビットコインがインディカーのスポンサーになったことがいかに大きな意味を持つかを強調する必要があると思います。それに加えて...",
      "title": "ビットコイン・カーが13万5千人の観衆の前で20～30周をリードしていた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这场比赛并不令人兴奋，因为这是一场非常干净的比赛，只有两个小的警告。\n警告。不管怎么说，这都是一场超级激动人心的比赛，最后的结局也很惊心动魄。\n\n至于发这个帖子的原因，我认为需要强调的是，这是多大的一件事？\n我认为需要强调的是，看到比特币赞助印第赛车是一件多么大的事情。除此之外...",
      "title": "刚从印第500大奖赛离开--比特币车在13.5万观众面前领先20-30圈"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這場比賽並不令人興奮，因爲這是一場非常乾淨的比賽，只有兩個小的警告。\n警告。不管怎麼說，這都是一場超級激動人心的比賽，最後的結局也很驚心動魄。\n\n至於發這個帖子的原因，我認爲需要強調的是，這是多大的一件事？\n我認爲需要強調的是，看到比特幣贊助印第賽車是一件多麼大的事情。除此之外...",
      "title": "剛從印第500大獎賽離開--比特幣車在13.5萬觀衆面前領先20-30圈"
    }
  ],
  "title": "Just Left From The Indy 500 - The Bitcoin Car Lead Around 20-30 Laps In Front Of 135k People",
  "created_utc": 1622431418,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wasn’t that exciting of a race as it was a very clean race with only 2 minor cautions. Either way, it was super exciting to watch and the end was thrilling! </p>\n\n<p>As for the reason for this post, I think it needs to be emphasized how big of a deal it was to see Bitcoin sponsor an Indy car. On top of that, the driver of the Bitcoin car, Rinus Veekay, started in 3rd place and lead around 20-30 laps of the total 200 laps. </p>\n\n<p>What that means is that 135k in person, saw Bitcoin leading the pack. That doesn’t include the hundreds of thousands watching it on TV too.</p>\n\n<p>Exposure is the first step, adoption is next.</p>\n</div><!-- SC_ON -->",
  "score": 505,
  "permalink": "/r/CryptoCurrency/comments/nol3yr/just_left_from_the_indy_500_the_bitcoin_car_lead/",
  "subreddit": "CryptoCurrency",
  "id": "nol3yr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297915
}