{
  "author": "Sebanimation",
  "original_created_utc": 1627825126,
  "title": "You should read the \"Crypto Anarchist Manifesto\" from 1988",
  "created_utc": 1627853908,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This text was distributed by Timothy C. May and in it he describes to possibilites the new cryptography technology brings.  (It is only 0.5 pages long)</p>\n\n<p>Communication without statecontrol. The beginning of crypto: Against the state, against regulations and against the incapacitation of the people.</p>\n\n<p>Of course, anarchism is a critical theory. But reading this manifesto from 1988 (!) is really interesting. Over 30 years ago, people were already debating about the possibilites of cryptography. Individuals can communicate and trade without the need of a 3rd party. Already back then, people realised what possible threat crypto can be to the predominant structure.</p>\n\n<p>The very basic idea of crypto is already embodied in this text: Communication without the need of a third party. </p>\n\n<p>Here is a link to the text. It is very short but well worth the read. </p>\n\n<p><a href=\"https://groups.csail.mit.edu/mac/classes/6.805/articles/crypto/cypherpunks/may-crypto-manifesto.html\">https://groups.csail.mit.edu/mac/classes/6.805/articles/crypto/cypherpunks/may-crypto-manifesto.html</a></p>\n\n<p>You will see how many trends of today correlate with trends from the past.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/ovsaa2/you_should_read_the_crypto_anarchist_manifesto/",
  "subreddit": "CryptoCurrency",
  "id": "ovsaa2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This text was distributed by Timothy C. May and in it he describes to\npossibilites the new cryptography technology brings. (It is only 0.5 pages long)\n\nCommunication without statecontrol. The beginning of crypto: Against the state,\nagainst regulations and against the incapacitation of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このテキストはTimothy C. Mayが配布したもので、その中で彼は次のように述べています。\n新しい暗号技術がもたらす可能性について述べています。(わずか0.5ページの文章です)\n\n国家管理のないコミュニケーション。暗号の始まりである。国家に対抗して。\n国家に抗し、規制に抗し、人の無力化に抗し...",
      "title": "1988年の \"Crypto Anarchist Manifesto \"を読むべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这篇文章是由Timothy C. May发布的，他在文中描述了\n新的密码学技术带来的可能性。(它只有0.5页长)\n\n没有状态控制的通信。密码学的开始。反对国家。\n反对法规和反对无能力的人。",
      "title": "你应该阅读1988年的 \"加密无政府主义宣言\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇文章是由Timothy C. May發佈的，他在文中描述了\n新的密碼學技術帶來的可能性。(它只有0.5頁長)\n\n沒有狀態控制的通信。密碼學的開始。反對國家。\n反對法規和反對無能力的人。",
      "title": "你應該閱讀1988年的 \"加密無政府主義宣言\"。"
    }
  ]
}