{
  "author": "MasterCookSwag",
  "the_new_excerpt": "Hi All,\n\nSo far most of the threads in the modqueue are just people asking about GME,\nshorting, or hedge funds. Honestly these should all just be comments in existing\nthreads and us mods can't spend all day deleting repetitive posts so we'll keep\nthings locked for a bit.\n\nAs always, if you make a…",
  "original_created_utc": 1611842501,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n到目前为止，modqueue中的大部分帖子都是人们在询问GME的情况。\n做空，或者对冲基金。老实说，这些都应该只是现有的评论。\n线程，而我们版主不可能整天都在删除重复的帖子，所以我们会继续保留\n事情锁定了一下。\n\n一如既往，如果你做了... ...",
      "title": "更新：过滤方式仍然是 \"所有帖子\"，我们很可能会保持这种方式一段时间--内部公告。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n到目前爲止，modqueue中的大部分帖子都是人們在詢問GME的情況。\n做空，或者對沖基金。老實說，這些都應該只是現有的評論。\n線程，而我們版主不可能整天都在刪除重複的帖子，所以我們會繼續保留\n事情鎖定了一下。\n\n一如既往，如果你做了... ...",
      "title": "更新：過濾方式仍然是 \"所有帖子\"，我們很可能會保持這種方式一段時間--內部公告。"
    }
  ],
  "title": "Update: filtering is still at \"all posts\", we will likely keep things that way for a bit - announcement inside",
  "created_utc": 1611892961,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi All, </p>\n\n<p>So far most of the threads in the modqueue are just people asking about GME, shorting, or hedge funds.  Honestly these should all just be comments in existing threads and us mods can&#39;t spend all day deleting repetitive posts so we&#39;ll keep things locked for a bit.</p>\n\n<p>As always, if you make a post that you think is worthwhile, or is on another topic worth discussing please message us and we can approve. </p>\n\n<p>Side note: obviously we don&#39;t have the mod bandwith for this sort of stuff, in every &quot;meta&quot; post I&#39;ve made in the last year I&#39;ve asked for mod volunteers and have gotten zero.  Reddit sent us an automated message yesterday because our traffic spiked so much (automated, because admins don&#39;t give a fuck).  I&#39;m going to leave a comment with some additional thoughts on that below.</p>\n\n<p>With regard to GME, we&#39;ll have a thread coming soon, <a href=\"/u/jn_ku\">/u/jn_ku</a>&#39;s posts have been popular so far so his 3rd installment will be allowed shortly. - and that&#39;s the thread for today unless there&#39;s some MAJOR news item.  We&#39;re still gonna keep the posts filtered because nobody pays attention to megathreads anyway. </p>\n\n<p><strong>For this thread - please feel free to have meta discussion on the subreddit and traffic, offer up suggestions, call the mods assholes, etc.  Please do not discuss GME or anything related here - that goes in the follow up megathrad</strong></p>\n\n<p>And for the love of christ please stop asking us for access to WSB.  That&#39;s not how Reddit works.</p>\n</div><!-- SC_ON -->",
  "score": 58,
  "permalink": "/r/investing/comments/l6xblc/update_filtering_is_still_at_all_posts_we_will/",
  "subreddit": "investing",
  "id": "l6xblc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532614
}