{
  "author": "gorays21",
  "the_new_excerpt": "When I went to high school there was no education on economy, let alone classes\non how the stock market operates. Instead I learned the basics of economy when I\nwent to college. I know teens don't have much money to invest and it's not even\nlegal to invest at their age but teaching the importance of…",
  "original_created_utc": 1624249646,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が高校に通っていた頃は、経済についての教育はおろか、株式市場の仕組みについての授業も\n株式市場がどのように動いているのかという授業はおろか その代わり、大学に入ってから経済の基礎を学びました。\n大学に行ってから経済の基礎を学びました。10代の人たちは投資するお金があまりないし、その年齢で投資することは法的にも認められていませんよね。\nしかし、その重要性を教えることは、私たちの生活をより豊かにしてくれます。",
      "title": "なぜ高校では株の授業をしないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我上高中的时候，没有经济教育，更没有关于股票市场如何运作的课程。\n课堂，更不用说股票市场如何运作了。相反，我在上大学时学到了经济方面的基本知识\n上了大学。我知道青少年没有太多的钱来投资，甚至没有合法的投资。\n但在他们这个年龄段投资是不合法的，但教给他们投资的重要性...。",
      "title": "为什么高中没有关于股票市场的课程？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我上高中的時候，沒有經濟教育，更沒有關於股票市場如何運作的課程。\n課堂，更不用說股票市場如何運作了。相反，我在上大學時學到了經濟方面的基本知識\n上了大學。我知道青少年沒有太多的錢來投資，甚至沒有合法的投資。\n但在他們這個年齡段投資是不合法的，但教給他們投資的重要性...。",
      "title": "爲什麼高中沒有關於股票市場的課程？"
    }
  ],
  "title": "Why don't high schools have classes on stock market?",
  "created_utc": 1624254487,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I went to high school there was no education on economy, let alone classes on how the stock market operates. Instead I learned the basics of economy when I went to college. I know teens don&#39;t have much money to invest and it&#39;s not even legal to invest at their age but teaching the importance of saving money and basics of compound interest would be beyond beneficial at their age.</p>\n\n<p>Instead of nonsense classes like jrotc or French(which is completely useless for a teen), high schools across the world should be teaching the basics of economy. If there was economy or a market class back when I went to high school, I would of invested at an earlier age rather than waiting later in life.</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/o4n02o/why_dont_high_schools_have_classes_on_stock_market/",
  "subreddit": "stocks",
  "id": "o4n02o",
  "is_self": true,
  "media": null,
  "is_video": false
}