{
  "author": "envoythrowaway",
  "original_created_utc": 1656951925,
  "title": "What's your best advice to get a girlfriend as a fairly shy guy?",
  "created_utc": 1656987232,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 22M. Not gonna throw a pity party but I&amp;#39;ve never dated anyone in high school or college and the loneliness is honestly getting to me whether I admit it or not. I&amp;#39;ve always been a fairly busy person, and my generally reserved personality doesn&amp;#39;t help. I was never in a fraternity at my University because my schedule between athletics and academics never allowed it, so I&amp;#39;ve never truly come out of my shell. Now I&amp;#39;ve got loads of free time and I don&amp;#39;t know where to begin with the girls.&lt;/p&gt;\n\n&lt;p&gt;But it&amp;#39;s not like I&amp;#39;ve got nothing to work with. I&amp;#39;ve been told I&amp;#39;m a fairly good-looking guy (I&amp;#39;m aware that at some level beauty is in the eye of the beholder), I&amp;#39;ve got a good-paying job lined up, I&amp;#39;ve got a variety of interests (mainly outdoor activities), and I&amp;#39;m completely capable of conversation, I just need to get past my deep-rooted fear of initiating. I had some bad experiences in grade school and my childhood in general, so I think that&amp;#39;s where my fear of initiation comes from (I dunno, I&amp;#39;m no shrink).&lt;/p&gt;\n\n&lt;p&gt;Advice from shy men who came out of their shell would be particularly helpful as would advice of women who have dated shy men.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/vrb7fn/whats_your_best_advice_to_get_a_girlfriend_as_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "vrb7fn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm 22M. Not gonna throw a pity party but I've never dated anyone in high school\nor college and the loneliness is honestly getting to me whether I admit it or\nnot. I've always been a fairly busy person, and my generally reserved\npersonality doesn't help. I was never in a fraternity at my University…"
}