{
  "author": "Comprehensive-Cow835",
  "original_created_utc": 1650444610,
  "title": "How can I stop wetting the bed at night?",
  "created_utc": 1650466006,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (F19) have occasionally wet the bed my whole life. It has come to the point where I cannot drink any liquid after 7pm or I will 100% have an accident. I do not drink much during the day at all and feel that I cannot even fully hydrate myself in fear of peeing myself. When I do wet myself at night, I either wake up in the middle of a dream to myself currently in the act of wetting myself, or I absolutely do not feel it at all until I wake up the next morning soiled. &lt;/p&gt;\n\n&lt;p&gt;For some reason, my body never wakes me up before the act like everyone else. I cannot remember the last time I have woken up in the middle of the night to use to bathroom before it was too late. This is becoming a big problems as I quite often share beds on trips and I sleep with my boyfriend every single night and it’s too embarrassing to have to explain to anyone that I have incontinence at night. &lt;/p&gt;\n\n&lt;p&gt;Does anyone have any suggestions? Is something seriously wrong with me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/u7s0le/how_can_i_stop_wetting_the_bed_at_night/",
  "subreddit": "TooAfraidToAsk",
  "id": "u7s0le",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (F19) have occasionally wet the bed my whole life. It has come to the point\nwhere I cannot drink any liquid after 7pm or I will 100% have an accident. I do\nnot drink much during the day at all and feel that I cannot even fully hydrate\nmyself in fear of peeing myself. When I do wet myself at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（F19）は生まれてこの方、時々おねしょをすることがありました。今では\n夜7時以降は一切液体を飲めなくなり、100％事故が起こるようになった。日中\n日中はあまり飲まず、水分補給も十分にできない状態です。\nお漏らしをするのが怖くて、水分補給もままならない。おねしょをすると...",
      "title": "どうしたら夜のおねしょがなくなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（F19）一生中偶尔会尿床。现在已经到了这样的地步\n晚上7点后我不能喝任何液体，否则我100%会发生意外。我\n白天根本不怎么喝水，我觉得我甚至不能充分补充水分，因为我害怕尿床。\n担心自己会撒尿。当我真的尿湿自己的时候，我就会觉得不舒服。",
      "title": "我怎样才能不在晚上尿床呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（F19）一生中偶爾會尿牀。現在已經到了這樣的地步\n晚上7點後我不能喝任何液體，否則我100%會發生意外。我\n白天根本不怎麼喝水，我覺得我甚至不能充分補充水分，因爲我害怕尿牀。\n擔心自己會撒尿。當我真的尿溼自己的時候，我就會覺得不舒服。",
      "title": "我怎樣才能不在晚上尿牀呢？"
    }
  ]
}