{
  "author": "futureisbright2031",
  "original_created_utc": 1654093394,
  "title": "Bitcoin is hope.",
  "created_utc": 1654116648,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a guy in my late 20&amp;#39;s from Germany. Growing up I never forgot how they gave us the Euro when I was a kid in the early 2000s. Initially for every &amp;#39;deutsche mark&amp;#39; we got 0.5 Euros, but I was super confused when my parents told me that their salary got divided by 2 (x0.5), but consumer prices went back to the &amp;quot;old&amp;quot; deutsche mark prices within one year - meaning as an end result they didn&amp;#39;t get divided, but salaries stagnated. I was ~8 years old at the time, didn&amp;#39;t understand what was going on, but felt that something super strange happened. &lt;/p&gt;\n\n&lt;p&gt;In 2008 the financial crisis/euro crisis hit, people where afraid, the media went crazy and when I was ~14 years old I needed to learn that I can&amp;#39;t get interest at the bank when I want to save my money for hard times in the future.&lt;/p&gt;\n\n&lt;p&gt;I finished school, went to university, studied medicine, did my PhD and looked at the world: House prices doubled!\nI realized that even as a physician in Germany I will not be able to buy a house in my home town without being indebted until the rest of my life, will not have the financial freedom to pursue projects which might take time.&lt;/p&gt;\n\n&lt;p&gt;I got depressed, I questioned everything, why do I even get up in the morning? My whole life I tried to do everything right, I saved for my future family, I studied, did research, but there was no chance of getting out of the debt-machinery.&lt;/p&gt;\n\n&lt;p&gt;Then I discovered Bitcoin. &lt;/p&gt;\n\n&lt;p&gt;I learned about austrian economics, time preference and how fiat is affecting every single aspect of our lives, including morals, and the general perspective we look at our life&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;I pray to God that Bitcoin will continue to transform the life&amp;#39;s of people on the globe, like it did mine.&lt;/p&gt;\n\n&lt;p&gt;I was lost, but now I&amp;#39;m found.&lt;/p&gt;\n\n&lt;p&gt;Thanks to everybody building and supporting the Bitcoin network.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 367,
  "permalink": "/r/Bitcoin/comments/v2i64h/bitcoin_is_hope/",
  "subreddit": "Bitcoin",
  "id": "v2i64h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a guy in my late 20's from Germany. Growing up I never forgot how they gave\nus the Euro when I was a kid in the early 2000s. Initially for every 'deutsche\nmark' we got 0.5 Euros, but I was super confused when my parents told me that\ntheir salary got divided by 2 (x0.5), but consumer prices went…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドイツから来た20代後半の男です。子供の頃、ドイツがどのようにユーロを導入してくれたか、忘れられ\n2000年代初頭、私が子供だった頃、彼らは私たちにユーロを与えました。当初は「ドイツ・マルク」1枚につき0.5ユーロ\nユーロだったのですが、親から「給料が2倍になっている」と聞かされ、超困惑しました。\n給料は2倍（0.5倍）になったのに、消費者物価は......」と言われ、超困惑しました。",
      "title": "ビットコインは希望です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个20多岁的男人，来自德国。在我的成长过程中，我从未忘记他们是如何在我还是个孩子的时候给了我们欧元。\n2000年代初我还是个孩子的时候，他们给了我们欧元。起初，每一个'德国马克'我们得到0.5欧元。\n马克\"，我们得到0.5欧元，但当我的父母告诉我，他们的工资被除以2（x）时，我感到非常困惑。\n他们的工资被除以2（x0.5），但消费价格却上升了......",
      "title": "比特币是希望。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個20多歲的男人，來自德國。在我的成長過程中，我從未忘記他們是如何在我還是個孩子的時候給了我們歐元。\n2000年代初我還是個孩子的時候，他們給了我們歐元。起初，每一個'德國馬克'我們得到0.5歐元。\n馬克\"，我們得到0.5歐元，但當我的父母告訴我，他們的工資被除以2（x）時，我感到非常困惑。\n他們的工資被除以2（x0.5），但消費價格卻上升了......",
      "title": "比特幣是希望。"
    }
  ]
}