{
  "author": "moneytobemade8",
  "the_new_excerpt": "I have seen many people not buy stocks due to the price being too high or vice\nversa. I have also seen many people think that stocks will go up a lot because\nthe price is \"relatively\" cheap and has room to grow. For example, I recently\nread a Reddit Post where the author said that they believe TSM…",
  "original_created_utc": 1614566651,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我见过很多人因为价格太高而不买股票，或者反之。\n反之亦然。我也看到很多人认为股票会涨很多，因为......。\n价格 \"相对 \"便宜，且有发展空间。例如，我最近\n读到一个Reddit帖子，作者说他们相信TSM... ...",
      "title": "价格不是万能的--看市值。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我見過很多人因爲價格太高而不買股票，或者反之。\n反之亦然。我也看到很多人認爲股票會漲很多，因爲......。\n價格 \"相對 \"便宜，且有發展空間。例如，我最近\n讀到一個Reddit帖子，作者說他們相信TSM... ...",
      "title": "價格不是萬能的--看市值。"
    }
  ],
  "title": "Price Isn't Everything- Look at Market Cap",
  "created_utc": 1614571531,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen many people not buy stocks due to the price being too high or vice versa. I have also seen many people think that stocks will go up a lot because the price is &quot;relatively&quot; cheap and has room to grow. For example, I recently read a Reddit Post where the author said that they believe TSM will easily go to a price of $500-600. However, the market cap is already 591 billion meaning they expect they will be more valuable than Amazon or Apple. I am not saying this is not true, but market cap is extremely important to take into consideration.</p>\n\n<p>Apple&#39;s current price is $121.26 and Enphase&#39;s price is $176.06. Does this mean Enphase is the more valuable company? No. </p>\n\n<p>A company with a smaller cap has more room to grow than companies with bigger market caps regardless of the price they trade at. For example, it is more feasible that a 1 billion dollar company grows 10X than a company with a market cap of 50 billion to grow to 500 billion. </p>\n\n<p>If you think a stock is a good buy, don&#39;t become too fixated on the price and buy it. On the other hand, don&#39; think a stock is a good deal because it is a low price. There could have been massive dilution.</p>\n\n<p>Good luck in picking your next winners!</p>\n</div><!-- SC_ON -->",
  "score": 930,
  "permalink": "/r/stocks/comments/luxx2q/price_isnt_everything_look_at_market_cap/",
  "subreddit": "stocks",
  "id": "luxx2q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937743322
}