{
  "author": "KAX1107",
  "original_created_utc": 1633248370,
  "title": "Bitcoin hashrate is on fire after El Salvador started geothermal volcano mining, almost back to all time high hashrate. Hashrate and price usually go hand in hand. We could be in for some fireworks soon",
  "created_utc": 1633267851,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The latest one day average hashrate is 170 EH/s. Both 7 day average and 14 day average are above 140 EH/s for the first time since China ban.</p>\n\n<p>The current one day average hashrate is equal to the 7 day average hashrate from April when the price was 65k. The current live hashrate online at this time is 177 EH/s. This is only 20 EH/s from ATH of 198 EH/s.</p>\n\n<p>The best part about this is all the hashrate that went offline in China just 3 months ago has now been almost fully replaced by hashrate using renewables in many other parts of the world like Canada, USA, Australia, Iceland, Middle East and Latin America. Even Iran lifted its mining ban this week so we can expect more hashrate to keep coming online and from many different countries.</p>\n\n<p><a href=\"https://btc.com/btc/insights-difficulty\">BTC difficulty insights</a></p>\n\n<p><a href=\"https://btc.com/btc/insights-hashrate\">BTC hashrate chart</a></p>\n\n<p>Everyone was expecting that the recovery would take 6 to 12 months. It took just 3 months!</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/q0di44/bitcoin_hashrate_is_on_fire_after_el_salvador/",
  "subreddit": "CryptoCurrency",
  "id": "q0di44",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The latest one day average hashrate is 170 EH/s. Both 7 day average and 14 day\naverage are above 140 EH/s for the first time since China ban.\n\nThe current one day average hashrate is equal to the 7 day average hashrate from\nApril when the price was 65k. The current live hashrate online at this time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最新の1日の平均ハッシュレートは170EH/s。7日間の平均値と14日間の平均値は\n共に140 EH/sを超えており、中国での禁止措置以来、初めてのことです。\n\n現在の1日平均のハシュレートは、価格が高騰した4月の7日平均のハシュレートと同じです。\n価格が65kであった4月の7日間の平均ハシュレートと同じです。現時点でのオンラインのライブハッシュレートは...",
      "title": "エルサルバドルが地熱火山のマイニングを開始したことで、ビットコインのハッシュレートが火を噴き、ほぼ過去最高のハッシュレートに戻った。ハシュレートと価格は通常連動している。もうすぐ花火が上がるかもしれない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最新的一天的平均哈希拉速度是170EH/s。7天平均和14天\n都超过了140 EH/s，这是中国禁令以来的第一次。\n\n目前的单日平均哈希值与4月份的7日平均哈希值相当。\n4月，当价格为65K。目前在线的实时hashrate...",
      "title": "萨尔瓦多开始地热火山开采后，比特币的哈斯勒特火了，几乎回到了有史以来最高的哈斯勒特。Hashrate和价格通常是齐头并进的。我们可能很快就会看到一些烟花"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最新的一天的平均哈希拉速度是170EH/s。7天平均和14天\n都超過了140 EH/s，這是中國禁令以來的第一次。\n\n目前的單日平均哈希值與4月份的7日平均哈希值相當。\n4月，當價格爲65K。目前在線的實時hashrate...",
      "title": "薩爾瓦多開始地熱火山開採後，比特幣的哈斯勒特火了，幾乎回到了有史以來最高的哈斯勒特。Hashrate和價格通常是齊頭並進的。我們可能很快就會看到一些煙花"
    }
  ]
}