{
  "author": "achocolatemilkcow",
  "original_created_utc": 1634780874,
  "title": "Have you ever had a feeling that somebody was dead and it turned out that they were?",
  "created_utc": 1634792385,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My roommate that lived downstairs had been quarantining due to Covid. He said he had been having mild symptoms and I had seen him up cooking and doing dishes. He pushed our trash to the end of the driveway yesterday morning, but later that evening his Facebook said he hadn’t been active in 10 hours and the house just felt awfully quiet. My brain told me he might be dead... but I brushed it off as he had probably been laid up because of the virus. This morning we checked on him and he was sitting in the living room dead. I feel awful that I didn’t check yesterday because I figured it was nothing and he was just resting up. We just went about our entire day while he was probably laying down there dead.... My house feels scary and empty now and my friend is dead. I have never experienced worrying that someone might be dead and then it turns out they are actually dead... I feel so awful.</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/TooAfraidToAsk/comments/qcgldt/have_you_ever_had_a_feeling_that_somebody_was/",
  "subreddit": "TooAfraidToAsk",
  "id": "qcgldt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My roommate that lived downstairs had been quarantining due to Covid. He said he\nhad been having mild symptoms and I had seen him up cooking and doing dishes. He\npushed our trash to the end of the driveway yesterday morning, but later that\nevening his Facebook said he hadn’t been active in 10 hours…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "階下に住んでいたルームメイトは、コヴィドの影響で隔離されていました。彼が言うには\n軽い症状が出ていて、料理や皿洗いをしているのを見たことがあります。彼は\n昨日の朝、私たちのゴミを車道の端まで運んでくれましたが、その日の夜、彼のFacebookには\nその日の夜、彼のFacebookには10時間も活動していないと書かれていました...。",
      "title": "誰かが死んでいるような気がして、実際に死んでいたことがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在楼下的室友因为科维德而被隔离。他说他\n一直有轻微的症状，我看到他在做饭和洗碗。他\n昨天早上，他把我们的垃圾推到了车道的尽头，但后来\n晚上，他的Facebook说他已经10个小时没有活动了......",
      "title": "你是否曾有过一种感觉，认为某人已经死了，结果却发现他们已经死了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在樓下的室友因爲科維德而被隔離。他說他\n一直有輕微的症狀，我看到他在做飯和洗碗。他\n昨天早上，他把我們的垃圾推到了車道的盡頭，但後來\n晚上，他的Facebook說他已經10個小時沒有活動了......",
      "title": "你是否曾有過一種感覺，認爲某人已經死了，結果卻發現他們已經死了？"
    }
  ]
}