{
  "author": "IIIIIIIIIIIIIIlIIl",
  "original_created_utc": 1638379502,
  "title": "Why do governments cry so much about crypto?",
  "created_utc": 1638397987,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have had this question since I live in a country with no Crypto taxes. Considering what the Politicians, the SEC and the bankers say about Cryptocurrencies, it should be pretty clear that Cryptocurrencies hold NO value whatsoever. They consider it to be a worthless and useless asset.&lt;/p&gt;\n\n&lt;p&gt;If that&amp;#39;s true, then why do people have to pay taxes on Crypto? People should not be paying any taxes for holding a useless asset. The same politicians and government bankers who call Crypto worthless receive a part of their paycheck from taxes collected from Crypto. It is clearly hypocritical to tax Cryptocurrencies and profit from it while calling it worthless at the same time.  &lt;/p&gt;\n\n&lt;p&gt;Thanks&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/r6jzlx/why_do_governments_cry_so_much_about_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r6jzlx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have had this question since I live in a country with no Crypto taxes.\nConsidering what the Politicians, the SEC and the bankers say about\nCryptocurrencies, it should be pretty clear that Cryptocurrencies hold NO value\nwhatsoever. They consider it to be a worthless and useless asset.\n\nIf that's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はCrypto税がない国に住んでいるので、この疑問を持っていました。\n政治家、SEC、銀行家の言うことを考慮すると\n暗号通貨は何の価値もないことは明らかです。\nということです。彼らはそれを無価値で役に立たない資産とみなしています。\n\nもしそれが...",
      "title": "なぜ政府は暗号についてそんなに泣くのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直有这个问题，因为我住在一个没有加密货币税的国家。\n考虑到政治家、美国证券交易委员会和银行家们对加密货币的看法\n加密货币，应该很清楚，加密货币不具备任何价值\n什么都没有。他们认为这是一种毫无价值和无用的资产。\n\n如果那是...",
      "title": "为什么政府对加密货币哭得那么厉害？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直有這個問題，因爲我住在一個沒有加密貨幣稅的國家。\n考慮到政治家、美國證券交易委員會和銀行家們對加密貨幣的看法\n加密貨幣，應該很清楚，加密貨幣不具備任何價值\n什麼都沒有。他們認爲這是一種毫無價值和無用的資產。\n\n如果那是...",
      "title": "爲什麼政府對加密貨幣哭得那麼厲害？"
    }
  ]
}