{
  "author": "shortyafter",
  "the_new_excerpt": "I posted this in the thread but got no response. :( Maybe if I post it here and\nelaborate it might be worthy of feedback and discussion. Here it goes.\n\nSo firstly, this wasn't exactly my main inspiration, but retroactively I did\nrealize that my portfolio was, in a way, similar to Ray Dalio's All…",
  "original_created_utc": 1619819886,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このスレッドに投稿したのですが、何の反応もありませんでした。\nを詳しく説明すれば、フィードバックと議論に値するかもしれません。さあ、どうぞ。\n\nまず、これは私の主なインスピレーションではありませんが、過去にさかのぼって、私は次のことをしました。\n私のポートフォリオは、ある意味、Ray DalioのAll...に似ていることに気づきました。",
      "title": "この狂った市場のための、私の全天候型ポートフォリオ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我把这个问题贴到了主题里，但没有得到任何回应。 :( 也许如果我把它贴到这里，并详细说明\n阐述一下，可能值得反馈和讨论。就这样吧。\n\n首先，这并不完全是我的主要灵感，但回想起来我确实\n意识到我的投资组合在某种程度上类似于Ray Dalio的《All...",
      "title": "我对这个疯狂市场的全天候投资组合。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我把這個問題貼到了主題裏，但沒有得到任何回應。 :( 也許如果我把它貼到這裏，並詳細說明\n闡述一下，可能值得反饋和討論。就這樣吧。\n\n首先，這並不完全是我的主要靈感，但回想起來我確實\n意識到我的投資組合在某種程度上類似於Ray Dalio的《All...",
      "title": "我對這個瘋狂市場的全天候投資組合。"
    }
  ],
  "title": "My all-weather portfolio for this crazy market.",
  "created_utc": 1619861380,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I posted this in the thread but got no response.  :(  Maybe if I post it here and elaborate it might be worthy of feedback and discussion.  Here it goes.</p>\n\n<p>So firstly, this wasn&#39;t exactly my main inspiration, but retroactively I did realize that my portfolio was, in a way, similar to <a href=\"https://www.listenmoneymatters.com/all-weather-golden-butterfly/\">Ray Dalio&#39;s All-Weather portfolio and also the Golden Butterfly portfolio</a>.  The asset allocations are not really the same but I do feel there&#39;s some resemblance in the approach.</p>\n\n<p>The All-Weather portfolio provides less return than VTI/VTSAX (total stock market index), but it also promises to perform in all scenarios.  Ray Dalio said it also protects you from any black swan events... theoretically you should never be able to lose.  The Golden Butterfly is the same idea. Take a look at these awesome stats from the link above:</p>\n\n<p><strong>Vanguard’s Total Stock Market Fund</strong></p>\n\n<ul>\n<li>Average Annual Return +9.4%</li>\n<li>Deepest Drawdown (2008) <strong>-49.3%</strong></li>\n</ul>\n\n<p><strong>Golden Butterfly</strong></p>\n\n<ul>\n<li>Average Annual Return +7.94%</li>\n<li>Deepest Drawdown (2008) <strong>-10.8%</strong></li>\n</ul>\n\n<p>The Golden Butterfly has an average annual return that&#39;s about 1.5% lower compared to VTI/VTSAX, but with a proven track record of much less volatility: 5 times less during the 2008 crash, in fact.</p>\n\n<p>Anyway, I can already tell I&#39;m probably going to get flamed because &quot;my portfolio has nothing to do with the Golden Butterfly or Ray Dalio&#39;s idea&quot; (note: he did say that the percentages were not exact).  But whatever, hope I was able to share something cool with y&#39;all and just note that my investment thesis isn&#39;t to completely replicate either of these two ideas, but rather create a portfolio that may perform in a similar way.  So, here goes:</p>\n\n<p><strong>My all-weather portfolio for this crazy market</strong></p>\n\n<p><em>Like Ray Dalio, my percentages are not entirely exact, either.</em></p>\n\n<p>Roth IRA: <strong>45% Target Retirement Fund</strong> (90% stocks, 10% bonds, automatically rebalances as I approach retirement)</p>\n\n<p>Taxable Account: (I use a taxable account as well because I may need to pull out some gains in the mid-term pre-retirement)</p>\n\n<p><strong>VTI:</strong> 15% (Total Stock Market)</p>\n\n<p><strong>VXUS:</strong> 7.5% (Total International Stock Market)</p>\n\n<p><strong>MSFT</strong>: 8%</p>\n\n<p><strong>AAPL:</strong> 6%</p>\n\n<p><strong>Dividend Stocks:</strong> 15% (I like tobacco: I hold BTI, PM, IMBBY)</p>\n\n<p><strong>Various commodities and alt. assets:</strong> 5% (mining stocks, bullion, I bought a small position in an ETF that tracks an asset which shall not be named here)</p>\n\n<p>---</p>\n\n<p>If you run the math you could say this comes to about <strong>75% growth</strong> (index funds, MSFT, AAPL) and <strong>25% defensive</strong> (dividend stocks, commodities, bonds, etc.).</p>\n\n<p>My only bond exposure is in my target retirement fund, and that&#39;s because they buy them for me.  Ray Dalio himself says bonds are trash right now, and I agree.  They are expensive and real yields are negative.  Thus, my dividend paying stocks act as a bond proxy.</p>\n\n<p>I chose tobacco stocks because I think it&#39;s good business no matter what&#39;s going on.  All 3 of my companies are international players who have exposure to slower declines or even increases in smoking rates via global markets.  IMBBY is an absolute killer bang for your buck, but of all 3 of my companies it&#39;s the one that could be in danger of failing.  BTI and PM look like they could continue to see growth in their new product categories (heat-not-burn, vaping, cannabis).  Anyway, these could be sold and switched as needed, but in the medium-term they are holds.</p>\n\n<p>My commodities, etc. act as an inflation hedge.  Also a crisis hedge for whatever may come.</p>\n\n<p>VTI and VXUS act as the primary drivers of growth.</p>\n\n<p>MSFT and AAPL I chose to hold on to because I already owned them, and didn&#39;t think it would be worth selling them just to buy more index funds.  The idea is that they will A. outperform index funds, B. do about the same as index funds, C. do slightly worse than index funds, but only slightly.  They may also survive a drawdown better than the entire market.  What&#39;s unlikely is that they severely underperform at any point.</p>\n\n<p>One reason for this new portfolio is because I tried my hand at individual stock picking and confirmed the age-old wisdom that most stock pickers don&#39;t beat the market.  The market was killing me, so I decided to sell most of my individual picks. I &quot;sinned&quot; a bit by holding on to my sin stocks, but I think I make a good case for them as bond proxies.  I also don&#39;t think MSFT and AAPL are really big brain picks.  I&#39;ll be OK there.</p>\n\n<p>The overall idea, however, is to stick with the index funds.</p>\n\n<p>The other idea is that I don&#39;t like uncertainty and I feel more comfortable with this allocation than with 100% equities.</p>\n\n<p>One final note: I&#39;m keeping my second-tier emergency fund in series I bonds.  They have a fixed yield for their lifetime, and also an adjustable yield that changes with inflation every 6 months.  The current fixed yield is 0%, but I own them anyway because it&#39;s still better than a money market fund.  Tomorrow new yields are released, it&#39;s highly likely that they will be 0% again, but it may be worth taking a look at.</p>\n\n<p>----</p>\n\n<p>Ok Reddit, do your worst!</p>\n</div><!-- SC_ON -->",
  "score": 52,
  "permalink": "/r/stocks/comments/n24gpf/my_allweather_portfolio_for_this_crazy_market/",
  "subreddit": "stocks",
  "id": "n24gpf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380967000
}