{
  "author": "arandom_econstudent",
  "original_created_utc": 1631887504,
  "title": "How I became a Crypto Millionaire",
  "created_utc": 1631918349,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I only did it with around 5.000 dollars. I started trading, went all in on doge at 1 cent and... Just kidding, no chance that happened. What actually happened was that I went all in on 20x leveraged long at 31k, nope a joke again.</p>\n\n<p>But what did indeed happen was that I entered crypto on May but I did not go all in but rather DCA during the dip my whole savings, now I&#39;m up around 30%. Many people will be like &quot;oh but that means you have only 6.5k&quot; which is true, BUT in my country we have HUGE inflation (60%+ this year alone) and 9.100%+ in the last 20 years. So basically our currency went from 1 peso = 1 dollar to 1 dollar = 184.5 pesos from 2000 to 2021 (imagine that it&#39;s also offsetting dollar inflation). </p>\n\n<p>So basically 6500 dollars are worth 1.199.250 pesos ATM - making me a crypto made millionaire from a starting 250.000 pesos (bought the dollars like two-three years ago when 1 dollar = 20 pesos and then 45 pesos). So I literally obtained my millionaire status at the young age of 22 by living in a country with hyperinflation and holding crypto - nice.</p>\n\n<p>To put into perspective: I used to make 50.000 a month, which most of you would be like &quot;oh it&#39;s a crazy salary, 600k a year&quot;. Well, it&#39;s only 271 dollars a month lol.</p>\n\n<p>This numbers may vary a little if you look at our currency in Google because we have HUGE fluctuations. For example, some weeks ago the exchange rate was 170, then went up to 190 and now back down.</p>\n\n<p>All in all the lessons I think we should take from this is that fiat and the goverment sucks and to DCA into solid projects like BTC and ETH in order to shelter from inflation.</p>\n\n<p>If you have a portfolio of 5.5K or more and want to become a millionaire like me go to binance&gt;settings&gt;currency&gt;ARS (Argentine Peso) and that&#39;s it! You&#39;ve 184x&#39;ed your money!</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/pq0sla/how_i_became_a_crypto_millionaire/",
  "subreddit": "CryptoCurrency",
  "id": "pq0sla",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I only did it with around 5.000 dollars. I started trading, went all in on doge\nat 1 cent and... Just kidding, no chance that happened. What actually happened\nwas that I went all in on 20x leveraged long at 31k, nope a joke again.\n\nBut what did indeed happen was that I entered crypto on May but I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は約5,000ドルでやっただけです。取引を始めて、1セントでdogeにオールインしました。\nを1セントで買って... 冗談だよ、そんなことはありえない。実際に起こったことは\n実際に起こったのは、20倍のレバレッジをかけたロングを31Kで全力投球したことですが、これも冗談です。\n\nしかし、実際に起こったことは、5月に暗号化に参入しましたが、私は...",
      "title": "私が暗号ミリオネアになるまで"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只用了大约5,000美元。我开始交易，以1美分的价格全身心投入到Doge上。\n1美分，然后... 开玩笑，这不可能发生。实际发生的情况是\n是我在3.1万的时候全押了20倍的杠杆长线，不，又是一个笑话。\n\n但确实发生的是，我在5月进入加密货币，但我...",
      "title": "我是如何成为加密货币百万富翁的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只用了大約5,000美元。我開始交易，以1美分的價格全身心投入到Doge上。\n1美分，然後... 開玩笑，這不可能發生。實際發生的情況是\n是我在3.1萬的時候全押了20倍的槓桿長線，不，又是一個笑話。\n\n但確實發生的是，我在5月進入加密貨幣，但我...",
      "title": "我是如何成爲加密貨幣百萬富翁的"
    }
  ]
}