{
  "author": "greenguy97",
  "original_created_utc": 1631409791,
  "title": "Is there any way to stop my abusive mother claiming me as a dependent on her taxes?",
  "created_utc": 1631423622,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My mom, horrible abusive, still claims me on her taxes as a dependent despite throwing me out 6ish years ago. I&#39;m a petty person, I don&#39;t want to help her in any way possible. Is there any way I can either</p>\n\n<p>A) Stop her from claiming me as a dependent.</p>\n\n<p>B) Even better, get her in trouble for fraud. I mean I haven&#39;t lived under her roof in ~6 years. She&#39;s commiting fraud by claiming I&#39;m a dependent while I had to live on the streets from 16 to 18 because she threw me out for being gay.</p>\n\n<p>I&#39;m just really upset that my name is being used to give her tax breaks to save the cunt money. She isn&#39;t my mother, she&#39;s my abuser, and I do not want my abuser benefitting from me in any way possible.</p>\n\n<p>Thanks in advance.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/pmjgfx/is_there_any_way_to_stop_my_abusive_mother/",
  "subreddit": "TooAfraidToAsk",
  "id": "pmjgfx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My mom, horrible abusive, still claims me on her taxes as a dependent despite\nthrowing me out 6ish years ago. I'm a petty person, I don't want to help her in\nany way possible. Is there any way I can either\n\nA) Stop her from claiming me as a dependent.\n\nB) Even better, get her in trouble for fraud. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の母はひどい虐待を受けていて、6年ほど前に私を捨てたにもかかわらず、いまだに私を扶養家族として税金を請求しています。\n6年ほど前に私を追い出したにもかかわらず、まだ私を扶養家族として税金を請求しています。私は小心者なので、どんなことがあっても母を助けたくはありません。\n可能な限り助けたくありません。以下のような方法はありませんか？\n\nA) 彼女が私を扶養家族として請求するのを止める。\n\nB)もっと良い方法は、彼女を詐欺罪で捕まえることです。I...",
      "title": "虐待を受けている母親が、私を扶養家族として税金を請求するのを阻止する方法はありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的母亲，可怕的虐待者，尽管6年多前把我赶出家门，但仍在她的税单上把我列为受抚养人。\n6年多前就把我赶走了。我是个小气的人，我不想以任何方式帮助她。\n任何可能的方式。有什么办法可以让我\n\nA) 阻止她将我列为受抚养人。\n\nB）甚至更好，让她陷入欺诈的麻烦。I...",
      "title": "有什么办法可以阻止虐待我的母亲将我作为受抚养人报税？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的母親，可怕的虐待者，儘管6年多前把我趕出家門，但仍在她的稅單上把我列爲受撫養人。\n6年多前就把我趕走了。我是個小氣的人，我不想以任何方式幫助她。\n任何可能的方式。有什麼辦法可以讓我\n\nA) 阻止她將我列爲受撫養人。\n\nB）甚至更好，讓她陷入欺詐的麻煩。I...",
      "title": "有什麼辦法可以阻止虐待我的母親將我作爲受撫養人報稅？"
    }
  ]
}