{
  "author": "not-clever-at-all",
  "the_new_excerpt": "It’s been a rough few years. I got cancer, then COVID, then found a job but now\nI’m being forced to return to South America after 10 years of schooling and\nworking in the US as a health professional because of my visa.\n\nHowever, today I was finally able to acquire a total of 1 ETH through…",
  "original_created_utc": 1623704057,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数年、荒れていました。癌になって、COVIDになって、仕事を見つけて、でも今は\n10年間学校に通い、アメリカで医療従事者として働いていましたが、ビザの関係で南アメリカに戻ることになりました。\nアメリカで医療従事者として働いていましたが、ビザの関係で南米に戻ることになりました。\n\nしかし、今日、私はようやく、合計1ETHを取得することができました...",
      "title": "ただ、ここにいる皆さんが、他の人々（私のような潜伏者）に情報を与え、教育を受けさせるために投稿し続け、議論し続けたことに感謝したいと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这几年过得很艰难。我得了癌症，然后是COVID，然后找到了一份工作，但现在\n但现在我被迫在接受了10年的学校教育和在美国作为卫生专业人员工作后返回南美。\n因为我的签证问题，我在美国作为卫生专业人员工作了10年之后，现在被迫返回南美。\n\n然而，今天我终于能够通过以下方式获得总共1个ETH...",
      "title": "我只想说，感谢这里的每个人，他们不断发帖、讨论和辩论，让其他人（像我这样的潜伏者）了解和接受教育。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這幾年過得很艱難。我得了癌症，然後是COVID，然後找到了一份工作，但現在\n但現在我被迫在接受了10年的學校教育和在美國作爲衛生專業人員工作後返回南美。\n因爲我的簽證問題，我在美國作爲衛生專業人員工作了10年之後，現在被迫返回南美。\n\n然而，今天我終於能夠通過以下方式獲得總共1個ETH...",
      "title": "我只想說，感謝這裏的每個人，他們不斷髮帖、討論和辯論，讓其他人（像我這樣的潛伏者）瞭解和接受教育。"
    }
  ],
  "title": "Just wanted to say thanks to everyone here who kept posting and discussing and debating to keep everyone else (lurkers like me) informed and educated.",
  "created_utc": 1623719932,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s been a rough few years. I got cancer, then COVID, then found a job but now I’m being forced to return to South America after 10 years of schooling and working in the US as a health professional because of my visa. </p>\n\n<p>However, today I was finally able to acquire a total of 1 ETH through multiple smaller buys since last October. I’m quite proud.</p>\n\n<p>HODL and be good to one another!</p>\n</div><!-- SC_ON -->",
  "score": 677,
  "permalink": "/r/CryptoCurrency/comments/nzwr30/just_wanted_to_say_thanks_to_everyone_here_who/",
  "subreddit": "CryptoCurrency",
  "id": "nzwr30",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738595
}