{
  "author": "BellaLi1989619",
  "original_created_utc": 1637172847,
  "title": "Grayscale CEO: Bitcoin ETF \"has become a political issue\"",
  "created_utc": 1637260253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Michael Sonnenshein, CEO of digital asset management company Grayscale, stated that the ongoing question of whether U.S. regulators will approve Bitcoin spot exchange-traded funds has transcended the “investment world” and attracted politicians, and has “become a political issues&quot;. Last week, we saw the support of Representatives Tom Emmer and Darren Soto for the Bitcoin Spot ETF. Sonnenshein referred to the two&#39;s arguments and pointed out that the US Securities and Exchange Commission &quot;is actually only worried about the potential Bitcoin market.&quot; According to Sonnenshein, the cryptocurrency industry and now politicians are demonstrating that &quot;if you are satisfied with derivatives and the pricing of these futures contracts comes from the spot market itself, then you are essentially satisfied with the spot market.&quot;</strong></p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/qw5bnz/grayscale_ceo_bitcoin_etf_has_become_a_political/",
  "subreddit": "Bitcoin",
  "id": "qw5bnz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Michael Sonnenshein, CEO of digital asset management company Grayscale, stated\nthat the ongoing question of whether U.S. regulators will approve Bitcoin spot\nexchange-traded funds has transcended the “investment world” and attracted\npoliticians, and has “become a political issues\". Last week, we saw…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "デジタルアセットマネジメント企業であるグレイスケール社のCEO、マイケル・ソネンシャイン氏は、次のように述べています。\n米国の規制当局がビットコインのスポット型上場投資信託を承認するかどうかという現在の問題は、「投資の世界」を超えて、人々の関心を集めています。\n米国の規制当局がビットコインのスポット型上場投資信託を承認するかどうかという問題は、\"投資の世界 \"を超えて注目されています。\n政治家を惹きつけ、「政治的な問題になっている」と述べています。先週、私たちは...",
      "title": "グレイスケールCEO：ビットコインETFは \"政治的な問題になっている\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "数字资产管理公司Grayscale的首席执行官Michael Sonnenshein表示\n美国监管机构是否会批准比特币现货交易基金，这个问题一直在进行。\n交易所交易基金的问题已经超越了 \"投资领域\"，并吸引了政治家。\n政治家，并且已经 \"成为一个政治问题\"。上周，我们看到...",
      "title": "灰度CEO：比特币ETF \"已经成为一个政治问题\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "數字資產管理公司Grayscale的首席執行官Michael Sonnenshein表示\n美國監管機構是否會批准比特幣現貨交易基金，這個問題一直在進行。\n交易所交易基金的問題已經超越了 \"投資領域\"，並吸引了政治家。\n政治家，並且已經 \"成爲一個政治問題\"。上週，我們看到...",
      "title": "灰度CEO：比特幣ETF \"已經成爲一個政治問題\""
    }
  ]
}