{
  "author": "Many_Scratch2269",
  "original_created_utc": 1644002971,
  "title": "A Crypto short squeeze might be happening right now, and it can completely reverse the current trajectory of the market.",
  "created_utc": 1644023917,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin seems to have shot past its $40k barrier in a matter of hours, and it is likely to continue considering how many people are shorting the market right now. Crypto hasn&amp;#39;t yet lost its steam and it was dragged down by the stock market for the past few days. This has accumulated A LOT of shorters.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/lx6hz6ct4vf81.jpg?width=1525&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3a4eec27f4f445c3f55ba4977521da9c6237463b\"&gt;Short positions are extremely high&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Just looking at this alone should give you a picture of what has been happening. There are a lot of people that are shorting the market right now, and a Bitcoin short squeeze is likely considering that whales have been eating up the weeks long selling pressure with huge purchases. &lt;/p&gt;\n\n&lt;h1&gt;Short  Squeeze Indications&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt; &lt;strong&gt;Substantial amount of buying pressure.&lt;/strong&gt;  ✅ &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;RSI below 30 for an unnatural amount of time.&lt;/strong&gt; ✅ &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Short interest way above 20%.&lt;/strong&gt;  ✅ &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Huge sudden uptick in price.&lt;/strong&gt; ✅ &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The market indications are suggesting a textbook short squeeze scenario for Bitcoin, and that might potentially reverse the Crypto market&amp;#39;s trajectory. Remember, Bitcoin is already 10% up in a matter of a few hours. This means people shorting are at a loss and they will either have to sell at a loss or borrow more shares, driving up the price. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR:&lt;/strong&gt; Bitcoin closed one of the biggest green candles in over a year, and it is most likely the beginning of a short squeeze due to an unusually large amount of people shorting the market. Moreover, surpassing 40k in a matter of  hours just invalidated weeks of FUD. If this continues, investors will be looking at a bullish Crypto market and a bearish stock market which is possibly the best environment for another huge bull run.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 482,
  "permalink": "/r/CryptoCurrency/comments/skm0fa/a_crypto_short_squeeze_might_be_happening_right/",
  "subreddit": "CryptoCurrency",
  "id": "skm0fa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin seems to have shot past its $40k barrier in a matter of hours, and it is\nlikely to continue considering how many people are shorting the market right\nnow. Crypto hasn't yet lost its steam and it was dragged down by the stock\nmarket for the past few days. This has accumulated A LOT of…"
}