{
  "author": "Asafetoonix",
  "original_created_utc": 1636691531,
  "title": "I REALLY don't like being around people and in public. Is that my personality or a mental problem?",
  "created_utc": 1636714896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>- Since I was very little, I didn&#39;t like meeting new people. Not even going to their houses.<br/>\n- In the church (religious family), I didn&#39;t stay with the other kids and preferred being with the adults.<br/>\n- At school, I spoke to a maximum of 4 people.<br/>\n- To this day I don&#39;t feel any interest in being with people around me, not even cousins or acquaintances.<br/>\n- I don&#39;t hate anyone in particular, although I can&#39;t trust them very much.<br/>\n- I never had any girlfriend/boyfriend, and even when I feel lonely, I don&#39;t keep this &quot;urge to find someone&quot; for too long. Normally, after some minutes I think: &quot;Nah, better being alone&quot;. </p>\n\n<p><strong>Is it possible that this is my personality?</strong></p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/qs3e66/i_really_dont_like_being_around_people_and_in/",
  "subreddit": "TooAfraidToAsk",
  "id": "qs3e66",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "- Since I was very little, I didn't like meeting new people. Not even going to\ntheir houses.\n- In the church (religious family), I didn't stay with the other kids and\npreferred being with the adults.\n- At school, I spoke to a maximum of 4 people.\n- To this day I don't feel any interest in being with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "- 私は幼い頃から人と会うのが苦手でした。人の家に行くのも\n人の家にも行かない。\n- 教会（宗教的な家族）では、他の子供たちと一緒にいないで、大人と一緒にいるのが好きでした。\n大人と一緒にいるのが好きでした。\n- 学校では、最大でも4人としか話しませんでした。\n- 今日に至るまで、私は一緒にいることに何の興味も感じていません...",
      "title": "人と一緒にいたり、人前に出るのが本当に苦手です。それは私の性格なのか、精神的な問題なのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "- 从我很小的时候起，我就不喜欢认识新朋友。甚至不喜欢去\n他们的家。\n- 在教堂里（宗教家庭），我不和其他孩子呆在一起，而\n更喜欢和成年人在一起。\n- 在学校，我最多只和4个人说话。\n- 时至今日，我已经感觉不到对与...",
      "title": "我真的不喜欢与人打交道，也不喜欢在公共场合。这是我的性格还是心理问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "- 從我很小的時候起，我就不喜歡認識新朋友。甚至不喜歡去\n他們的家。\n- 在教堂裏（宗教家庭），我不和其他孩子呆在一起，而\n更喜歡和成年人在一起。\n- 在學校，我最多隻和4個人說話。\n- 時至今日，我已經感覺不到對與...",
      "title": "我真的不喜歡與人打交道，也不喜歡在公共場合。這是我的性格還是心理問題？"
    }
  ]
}