{
  "author": "ample_suite",
  "the_new_excerpt": "I don't know much about this sub but it seemed like a decent non-judgmental\nplace to put a random thought and I was wondering if anyone else has similar\nthoughts.\n\nI was just browsing the front page of xvideos and it seemed like every video was\nsomething demeaning to women or extremely dominant or…",
  "original_created_utc": 1618726582,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこのサブについてあまり知らないのですが、ランダムな考えを置くための適切な判断力のある場所のように思えました。\n誰か同じようなことを考えている人がいないかなと思っています。\n考えています。\n\nxvideosのフロントページを見ていたら、すべてのビデオが女性を卑下するようなものだったり\n女性を卑下するようなものだったり、極端に支配的だったり...。",
      "title": "発見。私は、（少なくとも）気遣いがあるように見えるポルノを楽しみます。これを理解している人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对这个子不太了解，但它似乎是一个体面的非判断性的。\n地方把一个随机的想法，我想知道，如果其他人有类似的。\n思想。\n\n我只是在浏览xvideos的首页，似乎每一个视频都是。\n损人不利己的东西，或者说是霸道的东西，或者说是",
      "title": "发现。我喜欢有（至少）关怀假象的色情片。还有人明白这个道理吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對這個子不太瞭解，但它似乎是一個體面的非判斷性的。\n地方把一個隨機的想法，我想知道，如果其他人有類似的。\n思想。\n\n我只是在瀏覽xvideos的首頁，似乎每一個視頻都是。\n損人不利己的東西，或者說是霸道的東西，或者說是",
      "title": "發現。我喜歡有（至少）關懷假象的色情片。還有人明白這個道理嗎？"
    }
  ],
  "title": "Discovery: I enjoy pornography where there is (at least) the illusion of care. Does anyone else understand this?",
  "created_utc": 1618779998,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know much about this sub but it seemed like a decent non-judgmental place to put a random thought and I was wondering if anyone else has similar thoughts. </p>\n\n<p>I was just browsing the front page of xvideos and it seemed like every video was something demeaning to women or extremely dominant or submissive or aggressive. Not sure why pornography can&#39;t be complicit and a celebration of what makes sex amazing--the connection. Do you think that&#39;s a necessary part of porn?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/mt7g4t/discovery_i_enjoy_pornography_where_there_is_at/",
  "subreddit": "TooAfraidToAsk",
  "id": "mt7g4t",
  "is_self": true,
  "media": null,
  "is_video": false
}