{
  "author": "MyPenisRapedMe",
  "original_created_utc": 1639312973,
  "title": "How does one go about finding lonely elderly people to hang out with?",
  "created_utc": 1639330635,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I remember when I was 8 years old, every week I&amp;#39;d go to my neighbors house, she was an elderly lady who never had any visitors, all the years I lived by her, I never saw a single car at her house. I remember how happy she&amp;#39;d be when I stopped by, she&amp;#39;d give me some candy, or make me some toast, she&amp;#39;d want to hear all about my life and activities. She was always eager to tell me stories aswell. I&amp;#39;d often bring my friends to her house too, which she really enjoyed. &lt;/p&gt;\n\n&lt;p&gt;Then when I&amp;#39;d leave, she&amp;#39;d always tell me how much of a delight it is for me to come over and give her company, and every time she would always tell me to be back soon. Recently, I&amp;#39;ve been thinking about her, and nowbI realize how much it meant for her to have some company. At the time, I didn&amp;#39;t realize how lonely she was. It makes me sad to think that there&amp;#39;s lots of people like her, spending the last of their days alone, feeling as though they don&amp;#39;t exist to anyone, desperate to interact with people, but having no one ever come over.&lt;/p&gt;\n\n&lt;p&gt;Also, both of my parents and grandparents are dead, I don&amp;#39;t know anyone with any wisdom to offer. Every young person would benefit from talking to old people. How do I find lonely old people?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/NoStupidQuestions/comments/reoagu/how_does_one_go_about_finding_lonely_elderly/",
  "subreddit": "NoStupidQuestions",
  "id": "reoagu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I remember when I was 8 years old, every week I'd go to my neighbors house, she\nwas an elderly lady who never had any visitors, all the years I lived by her, I\nnever saw a single car at her house. I remember how happy she'd be when I\nstopped by, she'd give me some candy, or make me some toast,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "8歳の頃、毎週近所の家に遊びに行っていたのを覚えています。\nそのおばあさんは来客のない人で、私が住んでいた頃は、ずっとそのおばあさんの家にいました。\n車一台見たことがない。私が来ると、彼女はとても喜んでくれたのを覚えています。\nお菓子をくれたり、トーストを作ってくれたり...。",
      "title": "孤独なお年寄りと付き合うにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得在我8岁的时候，每个星期我都会去邻居家，她是一位年长的女士，从来没有访客。\n她是一位年长的女士，从来没有任何访客，在我住在她身边的这些年里，我从未在她家看到过一辆车。\n我在她家住了这么多年，从来没有见过一辆车在她家。我记得当我去拜访她时，她是多么高兴。\n她会给我一些糖果，或者给我做一些吐司......。",
      "title": "如何去寻找孤独的老人来一起玩？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得在我8歲的時候，每個星期我都會去鄰居家，她是一位年長的女士，從來沒有訪客。\n她是一位年長的女士，從來沒有任何訪客，在我住在她身邊的這些年裏，我從未在她家看到過一輛車。\n我在她家住了這麼多年，從來沒有見過一輛車在她家。我記得當我去拜訪她時，她是多麼高興。\n她會給我一些糖果，或者給我做一些吐司......。",
      "title": "如何去尋找孤獨的老人來一起玩？"
    }
  ]
}