{
  "author": "ChaoticNeutralNephew",
  "original_created_utc": 1636906176,
  "title": "Buy the Dip day week 3- what's looking good?",
  "created_utc": 1636915046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello my fellow crypto freaks, I am continuing with my Sunday experiment of finding a gem in the noise that is the crypto world. Week 1 had me buying the One Ring to rule them all (LRC) and week 2 lead me to buying CRO. I am holding both and they are doing great. So my friends, what shall I add to the bags this week? I will make my buy at the magic hour of 420pm cst. I am not interested in the old Blue chip gang, I want something that&#39;s not a meme and has serious tech behind it. Help me get the Camry of my dreams.</p>\n\n<p>Edit 1 I may reply with gifs as I have 2 addictions</p>\n\n<p>edit 2 my first HOT post-thanks y&#39;all. I will keep you in the loop about what i buy.</p>\n</div><!-- SC_ON -->",
  "score": 298,
  "permalink": "/r/CryptoCurrency/comments/qtszkb/buy_the_dip_day_week_3_whats_looking_good/",
  "subreddit": "CryptoCurrency",
  "id": "qtszkb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello my fellow crypto freaks, I am continuing with my Sunday experiment of\nfinding a gem in the noise that is the crypto world. Week 1 had me buying the\nOne Ring to rule them all (LRC) and week 2 lead me to buying CRO. I am holding\nboth and they are doing great. So my friends, what shall I add to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、暗号フリークの皆さん、私は日曜日の実験を続けています。\n日曜実験の続きです。第1週は「すべてを支配する一つの指輪（LRC）」を購入しました。\n第1週はOne Ring to rule them all (LRC)を買い、第2週はCROを買いました。私は両方を保有しています。\n両方を保有していますが、とても好調です。さて、私の友人たちよ、私は何を追加しようか...",
      "title": "ディップ・デイ・ウィーク3-を購入すると、何か良いことがありそうですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我的加密货币同胞们，我正在继续我的周日实验，即在加密货币世界的噪音中寻找一块宝石。\n我将继续进行我的周日实验，在加密世界的噪音中寻找一块宝石。第一周，我买了\n一环套一环（LRC），第二周我又买了CRO。我现在持有\n两者都做得很好。因此，我的朋友们，我应该在这两只股票中加入什么呢？",
      "title": "买入Dip日周3-什么看起来不错？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我的加密貨幣同胞們，我正在繼續我的週日實驗，即在加密貨幣世界的噪音中尋找一塊寶石。\n我將繼續進行我的週日實驗，在加密世界的噪音中尋找一塊寶石。第一週，我買了\n一環套一環（LRC），第二週我又買了CRO。我現在持有\n兩者都做得很好。因此，我的朋友們，我應該在這兩隻股票中加入什麼呢？",
      "title": "買入Dip日周3-什麼看起來不錯？"
    }
  ]
}