{
  "author": "dadasad2125",
  "original_created_utc": 1634248764,
  "title": "Is anyone else basically an idiot because of very bad memory? I've spent my life watching thousands of movies, videos, tv shows, anime, reading books and comics etc... And yet I remember 0 of them, can't even say anything if you ask me what's my favorite.",
  "created_utc": 1634273295,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And it&#39;s biting me in the ass too, cause I&#39;d love to make money by making youtube videos or writing novels, but I&#39;m like a blank slate, it&#39;s like staring at a brick wall, my mind is empty cause everything I&#39;ve experienced is mostly forgotten.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/q89lsp/is_anyone_else_basically_an_idiot_because_of_very/",
  "subreddit": "NoStupidQuestions",
  "id": "q89lsp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And it's biting me in the ass too, cause I'd love to make money by making\nyoutube videos or writing novels, but I'm like a blank slate, it's like staring\nat a brick wall, my mind is empty cause everything I've experienced is mostly\nforgotten.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それが私を苦しめています。というのも、私はyoutubeで動画を作ったり、小説を書いたりしてお金を稼ぎたいのですが\nyoutubeの動画を作ったり、小説を書いたりしてお金を稼ぎたいと思っているのですが、私はまるで白紙の状態で、まるでレンガの壁を見つめているようです。\n頭の中は空っぽで、今まで経験したことはほとんど忘れてしまっている。\n忘れてしまいました。",
      "title": "記憶力が非常に悪いため、基本的にバカになっている人はいませんか？私は人生で何千もの映画、ビデオ、テレビ番組、アニメを見たり、本や漫画を読んだりしてきました...。それなのに、私はその中の何も覚えていないし、何が一番好きかと聞かれても何も答えられません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它也在咬我的屁股，因为我很想通过制作YouTube视频或写小说来赚钱。\nyoutube视频或写小说来赚钱，但我就像一块白板，这就像盯着一块砖头一样\n我的大脑是空的，因为我所经历的一切大多被\n忘记了。",
      "title": "还有人因为记忆力很差而基本上是个白痴吗？我一生都在看成千上万的电影、录像、电视节目、动漫，阅读书籍和漫画等等。但我却完全不记得了，如果你问我最喜欢什么，我甚至什么都说不出来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它也在咬我的屁股，因爲我很想通過製作YouTube視頻或寫小說來賺錢。\nyoutube視頻或寫小說來賺錢，但我就像一塊白板，這就像盯着一塊磚頭一樣\n我的大腦是空的，因爲我所經歷的一切大多被\n忘記了。",
      "title": "還有人因爲記憶力很差而基本上是個白癡嗎？我一生都在看成千上萬的電影、錄像、電視節目、動漫，閱讀書籍和漫畫等等。但我卻完全不記得了，如果你問我最喜歡什麼，我甚至什麼都說不出來。"
    }
  ]
}