{
  "author": "anon8496847385",
  "the_new_excerpt": "It started in 2017, I started investing in the summer and watched my portfolio\nrise and rise to the sky’s. Riches beyond my wildest expectations. This started\nthe addiction. I now am forever a victim of addiction during bull markets.\nHowever, this cycle is worse. The crypto gods mock me with the…",
  "original_created_utc": 1613952687,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从2017年开始，我从夏天开始投资，看着自己的投资组合\n涨，涨到了天上的。财富，超出我的想象。这开始\n瘾。我现在永远是牛市时上瘾的受害者。\n然而，这个周期更糟糕。加密之神嘲笑我的... ...",
      "title": "我的名字是克里斯，我是一个加密货币上瘾者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從2017年開始，我從夏天開始投資，看着自己的投資組合\n漲，漲到了天上的。財富，超出我的想象。這開始\n癮。我現在永遠是牛市時上癮的受害者。\n然而，這個週期更糟糕。加密之神嘲笑我的... ...",
      "title": "我的名字是克里斯，我是一個加密貨幣上癮者。"
    }
  ],
  "title": "My name is Chris and I am a cryptocurrency addict",
  "created_utc": 1613975978,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It started in 2017, I started investing in the summer and watched my portfolio rise and rise to the sky’s. Riches beyond my wildest expectations. This started the addiction. I now am forever a victim of addiction during bull markets. However, this cycle is worse. The crypto gods mock me with the creation of moons. Now not only do I check my portfolio every 2-5 minutes, check this subreddit every second of my waking hour, and watch price predictions (the most meaningless trash). I now spend my time trying to conjure up funny and unique memes to gain karma and thus more crypto in the form of moons. I am ashamed to admit, I will also repost utter shit and hope no one realises. </p>\n\n<p>I have a problem, I need your help. My existence is chained to crypto. In the bear I would check my portfolio once a month and just accept it was down another few thousand. I almost look back at these times fondly. Pray for me. Pray for my ability to find unique memes. Pray that I find some meaning beyond this endless Groundhog Day.</p>\n</div><!-- SC_ON -->",
  "score": 381,
  "permalink": "/r/CryptoCurrency/comments/lpadw9/my_name_is_chris_and_i_am_a_cryptocurrency_addict/",
  "subreddit": "CryptoCurrency",
  "id": "lpadw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332879173
}