{
  "author": "Kartoffelkamm",
  "original_created_utc": 1660729669,
  "title": "What animals would be most likely to survive in a zoo without humans?",
  "created_utc": 1660800627,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically title. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m writing a fanfiction, and at one point, both in canon and the fic, a large city was destroyed and overrun by monsters. However, the monsters only fight animals in territorial disputes, so they would largely ignore zoo animals. &lt;/p&gt;\n\n&lt;p&gt;Now the question is, what zoo animals would be most likely to survive even without humans to care for them? &lt;/p&gt;\n\n&lt;p&gt;It isn&amp;#39;t really necessary for any animals to survive, I mostly just want the main character to go there and find everything dead, but it would be interesting if something could reasonably have survived. &lt;/p&gt;\n\n&lt;p&gt;Thanks in advance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/wqks6k/what_animals_would_be_most_likely_to_survive_in_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "wqks6k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Basically title.\n\nI'm writing a fanfiction, and at one point, both in canon and the fic, a large\ncity was destroyed and overrun by monsters. However, the monsters only fight\nanimals in territorial disputes, so they would largely ignore zoo animals.\n\nNow the question is, what zoo animals would be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的にタイトル。\n\n私はファンフィクションを書いているのですが、ある時、カノンでもフィクションでも、ある大きな都市が破壊され、モンスターに蹂躙されました。\n都市が破壊され、モンスターに蹂躙された。しかし、モンスターは戦うだけで\n動物園の動物はほとんど無視されます。\n\nそこで問題は、どの動物園の動物が...",
      "title": "人間のいない動物園で、最も生き残りやすい動物は何でしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上是标题。\n\n我在写一本粉丝小说，而在某一时刻，无论是在正统的还是在小说中，一个大型的\n城市被摧毁，被怪物占领。然而，这些怪物只在领土争端中与\n领土争端中的动物，所以它们基本上不理会动物园里的动物。\n\n现在的问题是，哪些动物园的动物会...",
      "title": "在没有人类的动物园里，哪些动物最有可能生存？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上是標題。\n\n我在寫一本粉絲小說，而在某一時刻，無論是在正統的還是在小說中，一個大型的\n城市被摧毀，被怪物佔領。然而，這些怪物只在領土爭端中與\n領土爭端中的動物，所以它們基本上不理會動物園裏的動物。\n\n現在的問題是，哪些動物園的動物會...",
      "title": "在沒有人類的動物園裏，哪些動物最有可能生存？"
    }
  ]
}