{
  "author": "PIX-T3",
  "original_created_utc": 1640262753,
  "title": "Would you consider this weird?",
  "created_utc": 1640291415,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For reference, I am a 23 year old male. I will sometimes say things like &amp;quot;thank you sweetheart&amp;quot; or &amp;quot;thanks doll&amp;quot; and such to female staff at a checkout line, gas station, etc... I never put much thought into it until I was with my friend the other day and he told me I was weird for saying that because I am so young. Is this a thing only old people do? Am I wrong for doing this?&lt;/p&gt;\n\n&lt;p&gt;Edit: to add to this I grew up in a very, and I mean very small town in North Carolina. This is something I grew up saying and my friends and family back home all do the same. I live in Virginia now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/rmuqbf/would_you_consider_this_weird/",
  "subreddit": "TooAfraidToAsk",
  "id": "rmuqbf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For reference, I am a 23 year old male. I will sometimes say things like \"thank\nyou sweetheart\" or \"thanks doll\" and such to female staff at a checkout line,\ngas station, etc... I never put much thought into it until I was with my friend\nthe other day and he told me I was weird for saying that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "参考までに、私は23歳の男性です。私は時々、「ありがとう」などと言うことがあります。\nレジの女性店員さんには「you sweetheart」「thanks doll」等々。\nガソリンスタンドなど... 友人と一緒にいるときまで、あまり気にしたことがありませんでした。\n先日、「そんなことを言うのは変だ」と言われました...。",
      "title": "これを変だと思うか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为参考，我是一个23岁的男性。我有时会说 \"谢谢你，亲爱的 \"或 \"谢谢你 \"之类的话。\n我有时会对排队结账的女性工作人员说 \"谢谢你，亲爱的 \"或 \"谢谢你，宝贝 \"之类的话。\n加油站，等等。我从来没有考虑过这个问题，直到有一天我和我的朋友在一起。\n有一天，他告诉我，我这样说很奇怪......",
      "title": "你会认为这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲參考，我是一個23歲的男性。我有時會說 \"謝謝你，親愛的 \"或 \"謝謝你 \"之類的話。\n我有時會對排隊結賬的女性工作人員說 \"謝謝你，親愛的 \"或 \"謝謝你，寶貝 \"之類的話。\n加油站，等等。我從來沒有考慮過這個問題，直到有一天我和我的朋友在一起。\n有一天，他告訴我，我這樣說很奇怪......",
      "title": "你會認爲這很奇怪嗎？"
    }
  ]
}