{
  "author": "ligmaballz696969",
  "the_new_excerpt": "Right now we literally will try to keep humans alive no matter what, and we\ndon’t put humans down even if they ask usually.\n\nThis has happened to a couple of my friends. Literally crippled and in pain but\nmodern medicine kept them alive for weeks before death.\n\nI guess you can “pull the plug” but…",
  "original_created_utc": 1621609882,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、私たちは文字通り、何があっても人間を生かそうとしています。\n人間が頼み込んできても絶対に降ろさない。\n\nこれは私の友人の何人かに起こったことです。文字通り、体が不自由で痛みに苦しんでいましたが\n現代の医学では、死ぬまでの数週間は生きています。\n\n栓を抜く」ことはできると思いますが...。",
      "title": "不自由で苦痛を伴う動物を処分することは倫理的に許されるのに、なぜ人間は許されないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，无论如何，我们都会努力让人类活着，而且即使人类提出要求，我们也不会把它们放下。\n即使人类通常提出要求，我们也不会把他们放下。\n\n这已经发生在我的几个朋友身上。从字面上看，他们被打成了残废，而且很痛苦，但是\n现代医学使他们在死亡前的几个星期都活着。\n\n我想你可以 \"拔掉插头\"，但是...",
      "title": "为什么杀死一个残废和痛苦的动物是符合道德的，而杀死一个人却不符合道德？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，無論如何，我們都會努力讓人類活着，而且即使人類提出要求，我們也不會把它們放下。\n即使人類通常提出要求，我們也不會把他們放下。\n\n這已經發生在我的幾個朋友身上。從字面上看，他們被打成了殘廢，而且很痛苦，但是\n現代醫學使他們在死亡前的幾個星期都活着。\n\n我想你可以 \"拔掉插頭\"，但是...",
      "title": "爲什麼殺死一個殘廢和痛苦的動物是符合道德的，而殺死一個人卻不符合道德？"
    }
  ],
  "title": "Why is it ethical to put down a animal who’s crippled and in pain but not a human?",
  "created_utc": 1621620461,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Right now we literally will try to keep humans alive no matter what, and we don’t put humans down even if they ask usually. </p>\n\n<p>This has happened to a couple of my friends. Literally crippled and in pain but modern medicine kept them alive for weeks before death.</p>\n\n<p>I guess you can “pull the plug” but they won’t give you a syringe like they do for animals for a peaceful and easy death.</p>\n</div><!-- SC_ON -->",
  "score": 277,
  "permalink": "/r/TooAfraidToAsk/comments/nhutvd/why_is_it_ethical_to_put_down_a_animal_whos/",
  "subreddit": "TooAfraidToAsk",
  "id": "nhutvd",
  "is_self": true,
  "media": null,
  "is_video": false
}