{
  "author": "ninety3_til_infinity",
  "original_created_utc": 1639026554,
  "title": "I read that the Mongols were mass producing texts in the 13th century using a moveable block type printing method. Why was Gutenberg's press so revolutionary in the 15th century if similar technology already existed in the interconnected Eastern hemisphere?",
  "created_utc": 1639047311,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title basically says it all, came across this reading &amp;quot;Genghis Kahn&amp;quot; and it made me scratch my head. I was always taught Gutenberg took Europe from labor intensive manual transcription to modular type. But it appears similar technologies already existed at least among the huge and widely influential Mongol Empire. Was there printing in Europe before Gutenberg? If so what was it like? If not... Why not?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/rcacjf/i_read_that_the_mongols_were_mass_producing_texts/",
  "subreddit": "AskHistorians",
  "id": "rcacjf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Title basically says it all, came across this reading \"Genghis Kahn\" and it made\nme scratch my head. I was always taught Gutenberg took Europe from labor\nintensive manual transcription to modular type. But it appears similar\ntechnologies already existed at least among the huge and widely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っています。「チンギス・カーン」を読んでいて、この本に出会いました。\n私は頭を掻きむしりました。私はいつも、グーテンベルクがヨーロッパを労働力から脱却させたと教えられてきました。\nモジュール化された活字へ。しかし、どうやら似たような\n少なくとも巨大な、そして広く普及している技術はすでに存在していたのです。",
      "title": "13世紀のモンゴルでは、可動式のブロックタイプの印刷方法で文章を量産していたと読みました。同じような技術が、相互につながっていた東欧諸国にすでに存在していたとしたら、なぜ15世紀にグーテンベルクの印刷機が革命的だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题基本上说明了一切，在阅读《成吉思汗》时发现了这个问题，这让我不禁挠头。\n我挠了挠头。我一直被教导说，古腾堡把欧洲从劳动密集型的手工抄写带到了模块化的字体。\n劳动密集型的手工抄写到模块化打字。但似乎类似的\n的技术至少在庞大而广泛的民族中已经存在了...",
      "title": "我读到，蒙古人在13世纪使用可移动的楷书印刷方法大量生产文本。如果类似的技术在相互联系的东半球已经存在，为什么古腾堡的印刷机在15世纪会如此具有革命性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題基本上說明了一切，在閱讀《成吉思汗》時發現了這個問題，這讓我不禁撓頭。\n我撓了撓頭。我一直被教導說，古騰堡把歐洲從勞動密集型的手工抄寫帶到了模塊化的字體。\n勞動密集型的手工抄寫到模塊化打字。但似乎類似的\n的技術至少在龐大而廣泛的民族中已經存在了...",
      "title": "我讀到，蒙古人在13世紀使用可移動的楷書印刷方法大量生產文本。如果類似的技術在相互聯繫的東半球已經存在，爲什麼古騰堡的印刷機在15世紀會如此具有革命性？"
    }
  ]
}