{
  "author": "TheRealRolex",
  "original_created_utc": 1636273020,
  "title": "Launching a sustainable investment platform to counter greenwashing of investment funds",
  "created_utc": 1636318098,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, </p>\n\n<p>I’m currently researching if it would make sense to launch an investment platform to counter greenwashing of normal investment funds. I’ve wrote down a thesis for the business and would like to get some feedback if this would interest you and what is missing. </p>\n\n<p>Thesis:</p>\n\n<p>I’ve been frustrated for a while now that banks are starting to call all their funds SRI or sustainable while the allocation of the funds are in normal non-sustainable companies. This tricks people into thinking that they’re investing in to saving the planet from global warming, but actually isnt.</p>\n\n<p>My investment platform would offer a curated offer of real sustainable investment funds to counter global warming. You can invest in one of our investment plans or choose which funds you invest in. </p>\n\n<p>You will have access to a dashboard which will show the amount of CO2 you have saved by doing the investment and other KPIs who contribute to battling climate change. </p>\n\n<p>——</p>\n\n<p>Looking forward to your feedback!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qok7rw/launching_a_sustainable_investment_platform_to/",
  "subreddit": "SideProject",
  "id": "qok7rw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone,\n\nI’m currently researching if it would make sense to launch an investment\nplatform to counter greenwashing of normal investment funds. I’ve wrote down a\nthesis for the business and would like to get some feedback if this would\ninterest you and what is missing.\n\nThesis:\n\nI’ve been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は現在、通常の投資ファンドのグリーンウォッシュに対抗するために、投資プラットフォームを立ち上げることに意味があるかどうかを研究しています。\n通常の投資ファンドのグリーンウォッシュに対抗するために、投資プラットフォームを立ち上げることに意味があるかどうかを研究しています。私はビジネスのための論文を書きました。\n私はこのビジネスのための論文を書きました。\n何が足りないのか、ご意見をお聞かせください。\n\nテーゼです。\n\n私はこれまで...",
      "title": "投資ファンドのグリーンウォッシュに対抗するためのサステナブル投資プラットフォームの立ち上げ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我目前正在研究推出一个投资平台是否有意义？\n平台，以抵制普通投资基金的洗绿行为。我已经写下了一个\n希望得到一些反馈，如果你对此感兴趣的话。\n你是否感兴趣，以及有什么不足之处。\n\n论文。\n\n我一直在...",
      "title": "推出可持续投资平台，反对投资基金的绿化行为"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我目前正在研究推出一個投資平臺是否有意義？\n平臺，以抵制普通投資基金的洗綠行爲。我已經寫下了一個\n希望得到一些反饋，如果你對此感興趣的話。\n你是否感興趣，以及有什麼不足之處。\n\n論文。\n\n我一直在...",
      "title": "推出可持續投資平臺，反對投資基金的綠化行爲"
    }
  ]
}