{
  "author": "dragondude4",
  "original_created_utc": 1628630520,
  "title": "Stop saying this infrastructure bill has “killed crypto”. The world doesn’t just comprise of America. Nothing can kill crypto.",
  "created_utc": 1628645566,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen so many posts on the front page about this bill that “killed crypto”. Killed? Lol what are we talking about. Last time I checked all my crypto is in the green, and everything is working just the way it’s supposed to. </p>\n\n<p>Yes the bill is bad for adoption in the US but as many American entrepreneurs have themselves said, “innovation will move outside the US”. That’s the beauty of decentralization. No central entity, even if it’s as powerful as the US government can kill it. All you need is an internet connection. </p>\n\n<p>There’s a whole thriving world out there. Nothing can kill crypto.</p>\n</div><!-- SC_ON -->",
  "score": 344,
  "permalink": "/r/CryptoCurrency/comments/p1ymdo/stop_saying_this_infrastructure_bill_has_killed/",
  "subreddit": "CryptoCurrency",
  "id": "p1ymdo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have seen so many posts on the front page about this bill that “killed\ncrypto”. Killed? Lol what are we talking about. Last time I checked all my\ncrypto is in the green, and everything is working just the way it’s supposed to.\n\nYes the bill is bad for adoption in the US but as many American…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、この法案が「死んだ」ということについて、フロントページで非常に多くの投稿を見ました。\ncrypto」です。殺された？何の話をしているのでしょうか。前回チェックしたときは、私の\n私の暗号はすべて緑で、すべてが想定通りに動いています。\n\n確かにこの法案はアメリカでの採用には不利ですが、多くのアメリカ人は...",
      "title": "このインフラ法案が「cryptoを殺した」と言うのはやめてください。世界はアメリカだけで構成されているわけではありません。暗号を殺すことはできません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在头版看到很多关于这个 \"杀死 \"加密货币的法案的帖子。\n哭了\"。杀了？笑话，我们在谈论什么。我上次检查的时候，我所有的\n的加密货币都是绿色的，而且一切都在按照它应该有的方式工作。\n\n是的，该法案对美国的采用是不利的，但正如许多美国人...",
      "title": "不要再说这个基础设施法案已经 \"杀死了加密货币\"。世界并不只是由美国组成。没有什么能杀死加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在頭版看到很多關於這個 \"殺死 \"加密貨幣的法案的帖子。\n哭了\"。殺了？笑話，我們在談論什麼。我上次檢查的時候，我所有的\n的加密貨幣都是綠色的，而且一切都在按照它應該有的方式工作。\n\n是的，該法案對美國的採用是不利的，但正如許多美國人...",
      "title": "不要再說這個基礎設施法案已經 \"殺死了加密貨幣\"。世界並不只是由美國組成。沒有什麼能殺死加密貨幣。"
    }
  ]
}