{
  "author": "MooseTitz",
  "original_created_utc": 1632275403,
  "title": "Why is Gabby Petito such a big deal when there are so many other similar cases that never even come close to breaking news headlines?",
  "created_utc": 1632285048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t mean to be rude, but I honestly don&#39;t know why her case is getting national attention when thousands of other similar cases never get brought up. Is there something particularly special about this case? </p>\n\n<p>It&#39;s no doubt a very tragic series of events, but I&#39;m trying to understand what warrants national (maybe even international?) Attention to this case but not the thousands of other missing persons/homicide cases? </p>\n\n<p>Again, I don&#39;t mean to be mean or say she doesn&#39;t matter I just can&#39;t understand this.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/psxbjo/why_is_gabby_petito_such_a_big_deal_when_there/",
  "subreddit": "TooAfraidToAsk",
  "id": "psxbjo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't mean to be rude, but I honestly don't know why her case is getting\nnational attention when thousands of other similar cases never get brought up.\nIs there something particularly special about this case?\n\nIt's no doubt a very tragic series of events, but I'm trying to understand what\nwarrants…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "失礼な言い方かもしれませんが、なぜ彼女のケースが全国的に注目されているのか、正直わかりません。\n他の何千もの同じようなケースが話題にならないのに、なぜ彼女のケースが全国的に注目されているのか、正直わかりません。\n何か特別な理由でもあるのでしょうか？\n\n非常に悲劇的な出来事であることは間違いありませんが、私が理解しようとしているのは、何が...\nワラント...",
      "title": "他にも似たようなケースがたくさんあるのに、なぜギャビー・プティートはこんなにも大きな問題になっているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我无意冒犯，但我真的不知道为什么她的案子会得到全国的关注\n全国关注，而其他成千上万的类似案件却从未被提起过。\n这个案子有什么特别之处吗？\n\n这无疑是一连串非常悲惨的事件，但我想了解什么是\n逮捕令...",
      "title": "为什么加比-佩蒂托如此大张旗鼓，而有那么多其他类似的案件甚至从未接近过爆炸性新闻头条？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我無意冒犯，但我真的不知道爲什麼她的案子會得到全國的關注\n全國關注，而其他成千上萬的類似案件卻從未被提起過。\n這個案子有什麼特別之處嗎？\n\n這無疑是一連串非常悲慘的事件，但我想了解什麼是\n逮捕令...",
      "title": "爲什麼加比-佩蒂託如此大張旗鼓，而有那麼多其他類似的案件甚至從未接近過爆炸性新聞頭條？"
    }
  ]
}