{
  "author": "shootermgavin_crypto",
  "the_new_excerpt": "Hi all,\n\nI was inspired by the choppy market action to do a write up on losing control\nwhen you trade. It's extracted from my blog (no self promote, no links or sneaky\nsheet), maybe it resonates with you:\n\nIt's about losing and regaining control on the holy grail of trading YOUR\ntrading plan:\n\nWhat…",
  "original_created_utc": 1614772169,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我受到波涛汹涌的市场行动的启发，做了一篇关于失去控制的文章。\n当你交易时。这是从我的博客中摘录出来的（没有自我宣传，没有链接，也没有偷偷摸摸的。\n表），也许它能引起你的共鸣。\n\n这是关于失去和重新获得控制 在神圣的圣杯交易你的。\n交易计划。\n\n什么...",
      "title": "重新控制您的交易计划"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我受到波濤洶湧的市場行動的啓發，做了一篇關於失去控制的文章。\n當你交易時。這是從我的博客中摘錄出來的（沒有自我宣傳，沒有鏈接，也沒有偷偷摸摸的。\n表），也許它能引起你的共鳴。\n\n這是關於失去和重新獲得控制 在神聖的聖盃交易你的。\n交易計劃。\n\n什麼...",
      "title": "重新控制您的交易計劃"
    }
  ],
  "title": "Regaining Control of Your Trading Plan",
  "created_utc": 1614781565,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>I was inspired by the choppy market action to do a write up on losing control when you trade. It&#39;s extracted from my blog (no self promote, no links or sneaky sheet), maybe it resonates with you:</p>\n\n<p>It&#39;s about losing and regaining control on the holy grail of trading YOUR trading plan:</p>\n\n<p>What Happens When we Lose Control.</p>\n\n<p>I posted this in Daytrading but the exact same applies for investors or long term traders.</p>\n\n<p>Many destructive emotions or situations stir up feelings associated with loss of control. <strong>Some examples of what&#39;s happened to me in the past:</strong></p>\n\n<p><em>You buy a stock, it goes down, you sell it to avoid losing money and it literally goes back up the next second, so you jump back in and it goes down again!</em></p>\n\n<p>Essentially, you are trying to control whether or not you make money. The obvious problem here - <strong>you don&#39;t control price.</strong></p>\n\n<p>This is probably one of the most common root causes of over-trading. And comes down to a few things:</p>\n\n<ol>\n<li>You do not have a trading plan that you understand</li>\n<li>Emotions are acted on instantly</li>\n<li>Fear is in the passenger seat and you are trying to gain control of your emotions</li>\n<li>Your current system doesn&#39;t suit your personality</li>\n</ol>\n\n<p>Trading is so full of paradoxes it would make you sick to your stomach, in fact, it does make some people literally sick to their stomach. The very need for control and our primitive brain  is basically wired to stop us from making money. Admitting we don&#39;t know where a stock will go is the first step to recovery, and a long road it is.</p>\n\n<p><strong>Example 2 (Based on the above):</strong></p>\n\n<p><em>Holding onto losses in order to avoid the pain of &quot;loss&quot;. There are many terms for this, for more info you can look into the disposition effect. Here we have the metamorphosis of a &quot;trader&quot;, someone who always tells you when they are winning to an &quot;investor&quot;, someone who holds shit stocks while they tank.</em></p>\n\n<p>Again, this ties into control (and ego) which quite frankly are like peas in a pod and feed from one another.</p>\n\n<p>By trying to control the outcome of a trade, we find all sorts of ways to really fuck up our trading strategy in all sorts of creative ways. The very things we try to avoid, which in &quot;normal life can be easy&quot;, in the stock market, are impossible. If your wife/husband asks you if you look fat, you can tell a white lie. If a stock goes down and you own it, no lie will bail you out.</p>\n\n<p>The stock market doesn&#39;t give a shit about how much money we make or lose, it&#39;s totally objective. Therefore, saying it&#39;s &quot;rigged&quot; or &quot;manipulated&quot; is totally irrelevant because it is rigged for all of us with few exceptions.</p>\n\n<p>What we Can&#39;t Control</p>\n\n<p>The reality of trading in terms of control is simple. It&#39;s much better to avoid things we can&#39;t control as the energy expended in this way removes focus from what we can control.</p>\n\n<p>Very easy to say but the long term impact will be successful trading or mediocre trading. As it turns out, we can&#39;t actually control the entire world - who would have thought! Some examples:</p>\n\n<ol>\n<li>If a stock goes up or down</li>\n<li>Black Swan events #Rona-19, 2008</li>\n<li>How much the central bank prints or doesn&#39;t print</li>\n<li>How governments will react to certain situations</li>\n<li>Anything to do with the news</li>\n<li>If country A decides to bomb country B</li>\n<li>People (long term)</li>\n<li>Interest rates</li>\n</ol>\n\n<p>Ironically, the things outside of our control are what freak us out of positions, push us into making rash buying or selling decisions and trigger our fight or flight reactions and derail any half-decent trading plan.</p>\n\n<p>I will openly admit I spend too much time on what I can&#39;t control. When it comes to people, stressful situations and even macro-economics. It is very hard to drown out the inputs from social media, friends, family and others. Even worse still is to avoid holding strong opinions on all of the</p>\n\n<p><strong>So What Can we Control</strong></p>\n\n<p>All is not lost though. If we could not control any variables in our stock market endeavors it would be pretty damn pointless to trade. The ingredients for success are truly found in the decisions we make in relation to:</p>\n\n<ol>\n<li>When we buy a stock</li>\n<li>When we sell a stock</li>\n<li>What strategy we decide upon</li>\n<li>Our environment</li>\n<li>How much of whatever we buy or sell</li>\n<li>The types of things we decide to watch, listen to and or read</li>\n<li>The people we surround ourselves with</li>\n<li>The daily habits we create around trading</li>\n<li>Keeping a trading journal</li>\n<li>Trading reviews</li>\n</ol>\n\n<p>The significant difference between what we can and can&#39;t control is this little thing called <strong>effort</strong>.</p>\n\n<p>It takes <strong>significant effort</strong> to find, test, understand and lose money when we start trading, the learning curve really can&#39;t be understated. Even worse, those who do well initially end up getting ruined because the precedent is set that &quot;this is easy&quot;. That lack of experience always catches up, be it in stocks or any other pursuit. This is the Dunning Kruger effect in action.</p>\n\n<p>Having logged my trades for a number of years, many patterns show up and repeat themselves most notably in times of duress. For me personally this included the following  - for which I now am 100% accountable.</p>\n\n<ol>\n<li>Buying too soon, usually due to FOMO</li>\n<li>Selling too soon, usually due to fear</li>\n<li>Buying on tips from Twitter and friends - the worst of the worst, I still fall for this one</li>\n<li>Not taking trades out of fear</li>\n</ol>\n\n<p>These are just a few which were underpinned by one major theme: <strong>not following my trading plan.</strong></p>\n\n<p>Sure, I still have my days and even months where I have lost control of my process and am tired, sick of everything and slip up. Yes of course, it costs me money every time and if you think I have down days because of it - you are absolutely correct. The real difference now is I know where I am going wrong, that I can improve it and make serious money trading stocks in the long run. <strong>I know what I can and can not control.</strong></p>\n\n<p>It all starts with having a clear plan, a very understandable unambiguous trading system, tons of real trades and a meticulous journal to keep track of where you are winning and losing.</p>\n\n<p>Over time, taking these lessons and reshaping habits, patterns and hang-ups to eventually become consistent and eventually have it down to a performance art.</p>\n\n<p>The apex of these points is total control over what you do during the trading day, how you can manage your emotion and execute that trading plan. The ability to follow this plan and learn from will either create or destroy potential traders, especially in the long run.</p>\n\n<p>Very long post, sorry - I hope it helps!</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/stocks/comments/lws1vf/regaining_control_of_your_trading_plan/",
  "subreddit": "stocks",
  "id": "lws1vf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744955
}