{
  "author": "IcyFirefighter10",
  "original_created_utc": 1658479287,
  "title": "What is the difference between \"This heatwave is proof of global warming\" and \"this snowstorm is proof there is no global warming\"?",
  "created_utc": 1658518300,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The reply I&amp;#39;ve always heard when people say there&amp;#39;s no global warming because of a particularly nasty snowstorm is that you have to look at the average temperatures. What&amp;#39;s the difference now with the heatwave in Europe? How can that be used as an argument for global warming, but not the reverse?&lt;/p&gt;\n\n&lt;p&gt;Just to be clear, I believe in global warming and I&amp;#39;m all for a green shift, but I don&amp;#39;t know how to reconcile those two arguments.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/w55gjl/what_is_the_difference_between_this_heatwave_is/",
  "subreddit": "NoStupidQuestions",
  "id": "w55gjl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The reply I've always heard when people say there's no global warming because of\na particularly nasty snowstorm is that you have to look at the average\ntemperatures. What's the difference now with the heatwave in Europe? How can\nthat be used as an argument for global warming, but not the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "地球温暖化がないのは、以下の理由からだと言われたときに、私がいつも聞いている返事です。\n特にひどい吹雪のために、地球温暖化ではないと言う人がいるとき、いつもこう言います。\n平均気温を見るべきだということです。ヨーロッパの熱波と何が違うのでしょうか？どうして\n温暖化の議論には使えるのに、どうして...",
      "title": "この熱波は地球温暖化の証拠だ」と「この吹雪は地球温暖化がない証拠だ」の違いは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当人们说没有全球变暖时，我总是听到这样的回答，因为\n当人们因为一场特别恶劣的暴风雪而说没有全球变暖时，我总是听到这样的回答：你必须看一下平均温度。\n温度。现在欧洲的热浪有什么不同呢？这怎么能\n这可以作为全球变暖的论据，但不能作为全球变暖的论据。",
      "title": "\"这场热浪证明了全球变暖 \"和 \"这场暴雪证明了没有全球变暖 \"之间有什么区别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當人們說沒有全球變暖時，我總是聽到這樣的回答，因爲\n當人們因爲一場特別惡劣的暴風雪而說沒有全球變暖時，我總是聽到這樣的回答：你必須看一下平均溫度。\n溫度。現在歐洲的熱浪有什麼不同呢？這怎麼能\n這可以作爲全球變暖的論據，但不能作爲全球變暖的論據。",
      "title": "\"這場熱浪證明了全球變暖 \"和 \"這場暴雪證明了沒有全球變暖 \"之間有什麼區別？"
    }
  ]
}