{
  "author": "Kashnaru",
  "original_created_utc": 1636536975,
  "title": "What's your hidden gem?",
  "created_utc": 1636547772,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The post about Reddit being or not being the right place to find out about the next big thing inspired this, as I actually found out about some of my best buys here on <a href=\"/r/cc\">r/cc</a>. That being said, I&#39;m not looking for advice to buy LRC or SHIB, as those have been talked about plenty even though they might still go up more.</p>\n\n<p>What are some projects you have barely seen mentioned here on Reddit that you believe in, and are planning to hold for the next 1-3 years? What is your MANA currently in the phase that no one knows or cares about but has potential?</p>\n\n<p>I realise this post will probably be a self fulfilling prophecy, but honestly looking for people to share their hidden gems, not shill this week&#39;s favorites.</p>\n\n<p>May the bull be with you!</p>\n</div><!-- SC_ON -->",
  "score": 251,
  "permalink": "/r/CryptoCurrency/comments/qqqo6x/whats_your_hidden_gem/",
  "subreddit": "CryptoCurrency",
  "id": "qqqo6x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The post about Reddit being or not being the right place to find out about the\nnext big thing inspired this, as I actually found out about some of my best buys\nhere on r/cc [/r/cc]. That being said, I'm not looking for advice to buy LRC or\nSHIB, as those have been talked about plenty even though…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditが次の大物について知るのに適した場所かどうかについての投稿が、この記事のきっかけとなりました。\n次の大物を探すのにRedditが適しているかどうかという投稿に触発されて、実際に自分のベストバイのいくつかをrcc\nここr/cc [/r/cc]で。とはいえ、私はLRCやSHIBを買うためのアドバイスを求めているわけではありません。\nSHIBを買えというアドバイスを求めているわけではありません、なぜならそれらはすでにたくさん語られているからです。",
      "title": "あなたの隠れた名品は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于Reddit是或不是发现下一个大事件的正确地方的帖子激发了我的想法。\n这篇文章的灵感来自于此，因为我实际上是在r/cc [/r/cc]上发现了我的一些最佳买点。\n因为我实际上是在r/cc[/r/cc]上发现了我的一些最佳购买。也就是说，我不是在寻找购买LRC或SHIB的建议。\nSHIB，因为这些已经被谈论了很多，尽管......",
      "title": "你有什么隐藏的宝藏？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於Reddit是或不是發現下一個大事件的正確地方的帖子激發了我的想法。\n這篇文章的靈感來自於此，因爲我實際上是在r/cc [/r/cc]上發現了我的一些最佳買點。\n因爲我實際上是在r/cc[/r/cc]上發現了我的一些最佳購買。也就是說，我不是在尋找購買LRC或SHIB的建議。\nSHIB，因爲這些已經被談論了很多，儘管......",
      "title": "你有什麼隱藏的寶藏？"
    }
  ]
}