{
  "author": "bsmith149810",
  "the_new_excerpt": "Not saying we count our nuggies before they're cooked. Not saying the squeeze is\nanywhere close to it's beginning much less ending. An idea crossed my mind ,\nhowever, and thought I'd throw it out there to the \"mob\" as we're being\npresented in msm and on CNBS.\n\nI've seen some awesome acts of kindness…",
  "original_created_utc": 1611360285,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "并不是说我们的金丝雀还没熟就先算好了。不是说挤压是\n任何地方接近它的开始，更不用说结束了。我有个想法..,\n然而，我想我应该把它扔给 \"暴民\"，因为我们正在被\n在MSM和CNBS上呈现。\n\n我见过一些令人敬畏的善举... ...",
      "title": "对全球环境监测系统提出质疑的动议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "並不是說我們的金絲雀還沒熟就先算好了。不是說擠壓是\n任何地方接近它的開始，更不用說結束了。我有個想法..,\n然而，我想我應該把它扔給 \"暴民\"，因爲我們正在被\n在MSM和CNBS上呈現。\n\n我見過一些令人敬畏的善舉... ...",
      "title": "對全球環境監測系統提出質疑的動議"
    }
  ],
  "title": "Motion for GME challenge",
  "created_utc": 1611393306,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not saying we count our nuggies before they&#39;re cooked. \nNot saying the squeeze is anywhere close to it&#39;s beginning much less ending. \nAn idea crossed my mind , however, and thought I&#39;d throw it out there to the &quot;mob&quot; as we&#39;re being presented in msm and on CNBS. </p>\n\n<p>I&#39;ve seen some awesome acts of kindness from the fellow autists during exceptional times of growth. I remember PLTR rocketing around Thanksgiving and all those who donated to food banks and charities. </p>\n\n<p>I propose this go round we splurge on GameStop gift cards this weekend and drop them off to places helping children in need. There is a children&#39;s hospital near me I myself have in mind. </p>\n\n<p>Just something I plan on doing this weekend, and would love to hear any better ideas or thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 3015,
  "permalink": "/r/wallstreetbets/comments/l30mmt/motion_for_gme_challenge/",
  "subreddit": "wallstreetbets",
  "id": "l30mmt",
  "is_self": true,
  "media": null,
  "is_video": false
}