{
  "author": "petite_goblingirl",
  "original_created_utc": 1640890490,
  "title": "My father-in-law keeps telling me to get a boob job. How am I supposed to react?",
  "created_utc": 1640900511,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title says, my father in law has suggested twice now in a joking fashion that I should get a boob job. He will then turn to my husband and say things like &amp;quot;Sorry, I tried to help you out but she won&amp;#39;t go for it&amp;quot;. This man is not my husband&amp;#39;s father, just a guy his mom married who happens to only be about 8 years older than myself. Him and my husband don&amp;#39;t really talk and my husband just tells me to ignore it. When he makes these suggestions I tell him I like myself the way I am and am not a fan of fake anything. He laughs it off and drops it but I can help feel gross when I have to interact with him now during holidays and whatnot. He also tries to initiate conversations with me almost daily through text or phone calls despite the fact I don&amp;#39;t reply. This is a super inappropriate thing to talk about with your daughter-in-law and I&amp;#39;m not really sure why he is so focused on it. What can I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/rs94vc/my_fatherinlaw_keeps_telling_me_to_get_a_boob_job/",
  "subreddit": "TooAfraidToAsk",
  "id": "rs94vc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says, my father in law has suggested twice now in a joking fashion\nthat I should get a boob job. He will then turn to my husband and say things\nlike \"Sorry, I tried to help you out but she won't go for it\". This man is not\nmy husband's father, just a guy his mom married who happens to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、義父が今まで2回ほど冗談で勧めてきました。\nおっぱいの整形をした方がいいと言われました。そして、夫に向かってこう言うのです。\n申し訳ない、助けてあげようと思ったんだけど、彼女は賛成してくれないんだ」みたいな。この人は\n夫の父親で、彼の母親が結婚した相手で、たまたま...",
      "title": "義父に「おっぱいを整形しろ」と言われ続けています。どう反応したらいいんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，我的岳父已经两次以开玩笑的方式建议我\n说我应该去做隆胸手术。然后他就会转向我丈夫，说什么\n\"对不起，我想帮你，但她不同意 \"之类的话。这个人不是\n我丈夫的父亲，只是他妈妈嫁给的一个人，而这个人正好...",
      "title": "我的岳父一直叫我去做隆胸手术。我应该如何反应呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，我的岳父已經兩次以開玩笑的方式建議我\n說我應該去做隆胸手術。然後他就會轉向我丈夫，說什麼\n\"對不起，我想幫你，但她不同意 \"之類的話。這個人不是\n我丈夫的父親，只是他媽媽嫁給的一個人，而這個人正好...",
      "title": "我的岳父一直叫我去做隆胸手術。我應該如何反應呢？"
    }
  ]
}