{
  "author": "Karnes",
  "the_new_excerpt": "'Amazon.com Inc (NASDAQ: AMZN) will employ 75,000 logistics and fulfillment\nworkers in North America at an average starting wage of $17 an hour.\n\nMost of the hires will be placed at the company fulfillment locations and\nnetwork of local delivery centers after positioning its final-mile…",
  "original_created_utc": 1621018076,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "「Amazon.com Inc（NASDAQ：AMZN）は、75,000人の物流・フルフィルメントの\nは、北米で75,000人の物流・フルフィルメント部門の従業員を、平均時給17ドルで雇用します。\n\nこの雇用の大半は、同社のフルフィルメント拠点とローカル配送センターのネットワークに配置されます。\nまた、ファイナルマイル（最終配送地点）に位置する配送センターのネットワークにも配置されます。",
      "title": "アマゾン、75,000人のフルフィルメント・ワーカーを採用、初任時給17ドル、ボーナスは最大1,000ドル"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "亚马逊公司（NASDAQ: AMZN）将在北美雇佣7.5万名物流和执行人员，平均起薪为每小时17美元。\n的工人，平均起薪为每小时17美元。\n\n大部分员工将被安置在公司的执行地点和当地的配送中心网络。\n在定位其最后一英里后，大部分员工将被安置在公司的履行地点和当地的交付中心网络。",
      "title": "亚马逊将招聘7.5万名配送员，起薪为每小时17美元，奖金高达1千美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "亞馬遜公司（NASDAQ: AMZN）將在北美僱傭7.5萬名物流和執行人員，平均起薪爲每小時17美元。\n的工人，平均起薪爲每小時17美元。\n\n大部分員工將被安置在公司的執行地點和當地的配送中心網絡。\n在定位其最後一英里後，大部分員工將被安置在公司的履行地點和當地的交付中心網絡。",
      "title": "亞馬遜將招聘7.5萬名配送員，起薪爲每小時17美元，獎金高達1千美元"
    }
  ],
  "title": "Amazon To Hire 75K Fulfillment Workers With Starting Hourly Pay Of $17, Bonuses Up To $1K",
  "created_utc": 1621036430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#39;Amazon.com Inc (NASDAQ: AMZN) will employ 75,000 logistics and fulfillment workers in North America at an average starting wage of $17 an hour.</p>\n\n<p>Most of the hires will be placed at the company fulfillment locations and network of local delivery centers after positioning its final-mile delivery network at the closest range of the end customers.</p>\n\n<p>Amazon has 409 delivery stations in the U.S., out of which 344 support package deliveries and the rest support heavy, bulky items that are typically non-conveyable.</p>\n\n<p>Amazon plans to build 229 additional delivery stations, out of which 193 are meant for packages. Amazon has 16 delivery stations in Canada, with seven more on the drawing board.</p>\n\n<p>Amazon will offer several new employees a $1,000 signing bonus and an additional $100 to the vaccinated ones. Amazon offers on-site vaccinations at over 250 locations in the U.S. and Canada.</p>\n\n<p>In April, Amazon announced an investment of over $1 billion for a wage hike of over 500,000 hourly employees by between 50 cents and $3 an hour.</p>\n\n<p>Last year Amazon added over 500,000 workers globally, the Wall Street Journal reports.</p>\n\n<p>The hiring comes just before the annual Prime Day shopping event, which was preponed from July to June.</p>\n\n<p>Amazon continues to face employee flak for difficult work conditions in their warehouses including Alabama, and Chicago. The company has refuted the allegations and assured necessary efforts for improved working conditions.&#39;</p>\n\n<p>Source:  <a href=\"https://www.benzinga.com/news/21/05/21108100/amazon-to-hire-75k-workers-for-north-american-logistics-fulfillment\">https://www.benzinga.com/news/21/05/21108100/amazon-to-hire-75k-workers-for-north-american-logistics-fulfillment</a></p>\n</div><!-- SC_ON -->",
  "score": 2173,
  "permalink": "/r/stocks/comments/ncfwmz/amazon_to_hire_75k_fulfillment_workers_with/",
  "subreddit": "stocks",
  "id": "ncfwmz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803295
}