{
  "author": "C111tla",
  "original_created_utc": 1628000656,
  "title": "Why does reading old comments/posts/videos on the Internet feel so weird? It's as if people back then had a completely different approach to life, a certain \"obliviousness\". I am reading a post from 2005 now and it feels incredibly weird. Why?",
  "created_utc": 1628077040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit after 6hrs: </p>\n\n<p>Since people are asking, well the one post I was talking about in the title of this post was about controller support for a PC videogame that&#39;s now 23 years old. So that would not be a good example for many reasons (I see that now, it was just the first that came to my mind).</p>\n\n<p>The best (or maybe the most convenient, at least) example would be Youtube. There&#39;s just this aura about the comments and videos uploaded many years ago that immediately gives away it&#39;s not a recent one. It&#39;s hard to describe it, but the content back then seems to have been more &quot;innocent&quot; and more &quot;spontaneous&quot;.</p>\n\n<p>Seeing them makes me think that we&#39;ve passed some period of &quot;innonence&quot; when everybody was just enjoying themselves and didn&#39;t really stop to think about that. Therefore, some of those comments/videos (like &quot;Numa Numa&quot; by Dork Daily or &quot;Me at the Zoo&quot; by jawed) just feel weird.</p>\n\n<p>I don&#39;t know, maybe it&#39;s just me, but I get the impression that the Internet has become more &quot;direct&quot; and less &quot;spontaneous&quot;. In some ways that makes it less infantile, but in others, it loses some of its charm.</p>\n\n<p>Hope I am making sense here.</p>\n\n<p>Edit nr 2: <a href=\"https://youtu.be/qtAWgPGxo5w\">https://youtu.be/qtAWgPGxo5w</a></p>\n\n<p>And check the 11-year old comment by Jared Viazanko.</p>\n\n<p>Edit 3 <a href=\"https://youtu.be/YersIyzsOpc\">https://youtu.be/YersIyzsOpc</a></p>\n</div><!-- SC_ON -->",
  "score": 291,
  "permalink": "/r/NoStupidQuestions/comments/ox4jq9/why_does_reading_old_commentspostsvideos_on_the/",
  "subreddit": "NoStupidQuestions",
  "id": "ox4jq9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit after 6hrs:\n\nSince people are asking, well the one post I was talking about in the title of\nthis post was about controller support for a PC videogame that's now 23 years\nold. So that would not be a good example for many reasons (I see that now, it\nwas just the first that came to my mind).\n\nThe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "6時間後に編集。\n\n尋ねられているので、この記事のタイトルで私が話していた1つの記事は\n23年前のPCゲームのコントローラーサポートについてです。\n歳のPCゲームのコントローラーサポートについてでした。そのため、多くの理由から良い例とは言えません（今になってわかりました。\n最初に思い浮かんだだけです）。)\n\nその...",
      "title": "インターネット上の古いコメントや投稿、動画を読むと、なぜか不思議な気分になります。昔の人は人生に対する考え方が全く違っていて、ある種の「忘却」をしていたような気がするのです。私は今、2005年の投稿を読んでいますが、信じられないほど奇妙に感じます。なぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "6小时后编辑。\n\n既然大家都在问，那么我在标题中所说的那个帖子就是\n这个帖子是关于一个已经有23年历史的PC电子游戏的控制器支持问题。\n的PC电子游戏的控制器支持。所以这不是一个很好的例子，原因有很多（我现在明白了，它只是\n这只是我想到的第一个例子）。)\n\n我想说的是...",
      "title": "为什么在互联网上阅读旧的评论/帖子/视频感觉如此奇怪？仿佛那时的人对生活有完全不同的态度，有某种 \"遗忘\"。我现在正在读一个2005年的帖子，感觉非常奇怪。为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "6小時後編輯。\n\n既然大家都在問，那麼我在標題中所說的那個帖子就是\n這個帖子是關於一個已經有23年曆史的PC電子遊戲的控制器支持問題。\n的PC電子遊戲的控制器支持。所以這不是一個很好的例子，原因有很多（我現在明白了，它只是\n這只是我想到的第一個例子）。)\n\n我想說的是...",
      "title": "爲什麼在互聯網上閱讀舊的評論/帖子/視頻感覺如此奇怪？彷彿那時的人對生活有完全不同的態度，有某種 \"遺忘\"。我現在正在讀一個2005年的帖子，感覺非常奇怪。爲什麼呢？"
    }
  ]
}