{
  "author": "trustissuesx",
  "the_new_excerpt": "Look I'm not here to argue about electric vehicles, but my point is if I bought\na Tesla TODAY and plugged it in to charge TODAY, based on the power sources in\nmy state it would be more than 40% powered by coal and another 30% by natural\ngas. These are not Green power sources.\n\nMeanwhile I keep…",
  "original_created_utc": 1614618573,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "听着，我不是来争论电动车的，但我的观点是，如果我买了\n一辆特斯拉TODAY，并插上电源为TODAY充电，根据电源中。\n在我的国家，它将超过40％的煤炭和另外30％的天然动力。\n气。这些都不是绿色能源。\n\n同时我一直...",
      "title": "如果电动车被认为是绿色环保的，那么比特币挖矿也是如此。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着，我不是來爭論電動車的，但我的觀點是，如果我買了\n一輛特斯拉TODAY，並插上電源爲TODAY充電，根據電源中。\n在我的國家，它將超過40％的煤炭和另外30％的天然動力。\n氣。這些都不是綠色能源。\n\n同時我一直...",
      "title": "如果電動車被認爲是綠色環保的，那麼比特幣挖礦也是如此。"
    }
  ],
  "title": "If an electric vehicle is considered green then so is bitcoin mining",
  "created_utc": 1614637834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look I&#39;m not here to argue about electric vehicles, but my point is if I bought a Tesla TODAY and plugged it in to charge TODAY, based on the power sources in my state it would be more than 40% powered by coal and another 30% by natural gas. These are not Green power sources.</p>\n\n<p>Meanwhile I keep seeing FUD about how much energy bitcoin uses and how it&#39;s not green, when a Miner would be plugged into the exact same power supply as that Tesla. Same with whatever smart phone that the FUD was tweeted with, also powered by fucking coal in pretty much any US state. </p>\n\n<p>If a Tesla can be powered by Solar, so can a Bitcoin miner.</p>\n\n<p>Bitcoin is only as green as the grid, just like anything else. It shouldn&#39;t be &#39;ban bitcoin&#39; or &#39;ban Tesla&#39; or &#39;ban smartphones&#39; because of energy usage, it should be <em>fix the fucking grid</em>.</p>\n</div><!-- SC_ON -->",
  "score": 335,
  "permalink": "/r/Bitcoin/comments/lvehz0/if_an_electric_vehicle_is_considered_green_then/",
  "subreddit": "Bitcoin",
  "id": "lvehz0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937732201
}