{
  "author": "attentionspanltd",
  "the_new_excerpt": "I just don't get it... A couple of months ago, I was getting killed in tech, so\nI started moving out of tech and into ETFs - industrials, materials, the defense\nsector, oil and gold miners as hedges against inflation, and a bet on reopening.\nYesterday, the market got all worried about inflation and…",
  "original_created_utc": 1623946731,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どうしてもわからないことがあります...。数ヶ月前、私はハイテクに殺されそうになっていました、それで\n産業、素材、防衛セクター、原油、金鉱などのETFに投資を始めました。\n工業、素材、防衛セクター、石油、金鉱などのETFに投資して、インフレに対するヘッジと再開への賭けをしました。\n昨日、市場はインフレを心配して、...",
      "title": "Can't Win for Losing."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是不明白...... 几个月前，我在科技领域被杀，所以\n我开始从科技股中撤出，转而投资ETF--工业、材料、国防\n工业、材料、国防部门、石油和黄金矿工，作为对冲通货膨胀的工具，并押注于重新开张。\n昨天，市场对通货膨胀的担忧和...",
      "title": "不能因输而赢。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是不明白...... 幾個月前，我在科技領域被殺，所以\n我開始從科技股中撤出，轉而投資ETF--工業、材料、國防\n工業、材料、國防部門、石油和黃金礦工，作爲對沖通貨膨脹的工具，並押注於重新開張。\n昨天，市場對通貨膨脹的擔憂和...",
      "title": "不能因輸而贏。"
    }
  ],
  "title": "Can't Win for Losing.",
  "created_utc": 1623978967,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just don&#39;t get it... A couple of months ago, I was getting killed in tech, so I started moving out of tech and into ETFs -  industrials, materials, the defense sector, oil and gold miners as hedges against inflation, and a bet on reopening. Yesterday, the market got all worried about inflation and tapering, and today (and for the last few days, really) all of those sectors are getting destroyed. And guess what is all in the green? Tech. Even the ARK stocks. The very things that are supposed to sell off with higher inflation and higher interest rates. I have an airline stock - Spirit Airlines - that has been getting upgrade after upgrade into the mid $40s and low $50s, but has been sinking like a stone for 2 months now, and is now at $33. They said it was because oil was going up. But today oil&#39;s down, and airlines are still taking it on the chin - hard.</p>\n\n<p>I guess I&#39;m just venting... But it doesn&#39;t make any sense to me. No wonder people just throw their money into AMC and GME these days. What am I doing wrong?</p>\n</div><!-- SC_ON -->",
  "score": 62,
  "permalink": "/r/stocks/comments/o212za/cant_win_for_losing/",
  "subreddit": "stocks",
  "id": "o212za",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745349
}