{
  "author": "Expensive_Ad_31",
  "original_created_utc": 1641067323,
  "title": "Can bitcoin held in a hardware wallet be garnished if you lose a civil suit?",
  "created_utc": 1641145588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in legal services and this question has often occurred to me while watching proceedings. Say I hold a substantial portion of my net worth in bitcoin, I lose a civil suit, and the amount I owe in damages exceeds the amount I hold in checking accounts, physical assets, etc. Is there a way I can be forced to turn over my bitcoin?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 457,
  "permalink": "/r/Bitcoin/comments/rtr68p/can_bitcoin_held_in_a_hardware_wallet_be/",
  "subreddit": "Bitcoin",
  "id": "rtr68p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work in legal services and this question has often occurred to me while\nwatching proceedings. Say I hold a substantial portion of my net worth in\nbitcoin, I lose a civil suit, and the amount I owe in damages exceeds the amount\nI hold in checking accounts, physical assets, etc. Is there a way I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "<!-- SC_OFF --><div class=\"md\"><p>I work in legal services and this question has been selected in the legal services.\n訴訟手続きを見ていて、よく思いました。例えば、私がかなりの\n純資産の一部をビットコインで運用し、民事訴訟で敗訴し、その負債額をビットコインで運用する。\n当座預金や現物で持っている金額よりも、損害賠償の方が多いのですが...。",
      "title": "ハードウェアウォレットで保有しているビットコインは、民事訴訟で負けた場合、差し押さえられるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "<! -- SC_OFF --><div class=\"md\"><p>我在法律服务部门工作，这个问题在观看诉讼过程中经常出现。\n我在观看诉讼程序时经常想到这个问题。假设我持有相当大一部分\n我的净资产中有很大一部分是比特币，我在民事诉讼中败诉，而我所欠的赔偿金额\n损害赔偿金超过了我在支票账户中持有的金额，物理...",
      "title": "如果你在民事诉讼中败诉，存放在硬件钱包中的比特币会被扣押吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "<! -- SC_OFF --><div class=\"md\"><p>我在法律服務部門工作，這個問題在觀看訴訟過程中經常出現。\n我在觀看訴訟程序時經常想到這個問題。假設我持有相當大一部分\n我的淨資產中有很大一部分是比特幣，我在民事訴訟中敗訴，而我所欠的賠償金額\n損害賠償金超過了我在支票賬戶中持有的金額，物理...",
      "title": "如果你在民事訴訟中敗訴，存放在硬件錢包中的比特幣會被扣押嗎？"
    }
  ]
}