{
  "author": "Cubelock",
  "original_created_utc": 1646809664,
  "title": "Why do people that clearly can’t afford it (yet) have children?",
  "created_utc": 1646822988,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t mean by ‘accident’, but by choice. When it’s clear beforehand that you don’t have the financial means to afford it and you still go through with it.&lt;/p&gt;\n\n&lt;p&gt;These days, having children can put you in permanent poverty. In some (Western) countries it’s so expensive that you could possibly never financially recover from having children. &lt;/p&gt;\n\n&lt;p&gt;Asking here because I notice people get angry quite fast when this question is asked.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 158,
  "permalink": "/r/TooAfraidToAsk/comments/ta26aw/why_do_people_that_clearly_cant_afford_it_yet/",
  "subreddit": "TooAfraidToAsk",
  "id": "ta26aw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don’t mean by ‘accident’, but by choice. When it’s clear beforehand that you\ndon’t have the financial means to afford it and you still go through with it.\n\nThese days, having children can put you in permanent poverty. In some (Western)\ncountries it’s so expensive that you could possibly never…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "偶然」ではなく、「選択」によってという意味です。あらかじめ明らかに\n経済的な余裕がないにもかかわらず、それを実行に移す。\n\n最近では、子供を産むと永久に貧困に陥る可能性があります。ある（欧米の）国々では\nお金がかかるから、一生できないかも......。",
      "title": "明らかに余裕のない（まだ）人がなぜ子供を産むのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是指 \"意外\"，而是指选择。当你事先清楚地知道你\n你没有经济能力去负担，但你还是去做了。\n\n如今，生孩子可以让你陷入永久的贫困。在一些（西方）国家\n国家，它是如此昂贵，以至于你可能永远不会...",
      "title": "为什么那些明显负担不起的人（还）要生孩子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是指 \"意外\"，而是指選擇。當你事先清楚地知道你\n你沒有經濟能力去負擔，但你還是去做了。\n\n如今，生孩子可以讓你陷入永久的貧困。在一些（西方）國家\n國家，它是如此昂貴，以至於你可能永遠不會...",
      "title": "爲什麼那些明顯負擔不起的人（還）要生孩子？"
    }
  ]
}