{
  "author": "3STmotivation",
  "the_new_excerpt": "“That one Reddit uranum guy” here, I decided to set up a list of informational\nsources one can use to make sure they get up to speed on the uranium sector and\nthe asymmetrical risk/reward proposition it presents to anyone that participates\nin it. We have seen a major recent price run up of the…",
  "original_created_utc": 1612295620,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\"那一个红网尿素男 \"在这里，我决定建立一个信息列表。\n可以用来确保自己了解铀行业的最新情况，并能利用这些资源。\n它向任何参与的人提出了不对称的风险/回报建议。\n中。我们看到，近期价格大幅上涨的...",
      "title": "指导你走过铀业牛市的有用资源清单（+一个小行业的最新情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"那一個紅網尿素男 \"在這裏，我決定建立一個信息列表。\n可以用來確保自己瞭解鈾行業的最新情況，並能利用這些資源。\n它向任何參與的人提出了不對稱的風險/回報建議。\n中。我們看到，近期價格大幅上漲的...",
      "title": "指導你走過鈾業牛市的有用資源清單（+一個小行業的最新情況"
    }
  ],
  "title": "A list of useful sources to guide you through the uranium bull market (+ a small sector update)",
  "created_utc": 1612361640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“That one Reddit uranum guy” here, I decided to set up a list of informational sources one can use to make sure they get up to speed on the uranium sector and the asymmetrical risk/reward proposition it presents to anyone that participates in it. We have seen a major recent price run up of the underlying equities and an increase in spot price of uranium should follow soon to justify the narrative. I have mentioned the following sentence in my previous post, but I will do so again just in case some people have no read that one: “This rally was built on historic seasonality, bipartisan support from the US government and their strategic reserve bill, geopolitical backing of nuclear power, the closing of Cigar Lake (one of the world’s largest uranium mines) and the covering of uranium investing by some of the more mainstream investment outlets”.</p>\n\n<p>The uranium market is opaque, lots of information is not available to the public and it can be hard to navigate a sector like this. Knowing this, I have made a list of some of the most important and useful sources of information one needs to get a good foundation for this investment thesis (disclaimer: I am not receiving any financial or other sort of compensation for this, the picks on this list are chosen purely based on quality and usefulness to investors of the uranium sector. There are many other options, which you will surely find via the below mentioned suggestions).</p>\n\n<p>Before I share it though, I wanted to mention that I have been accused time and again of pumping the uranium market or being a snake oil salesman who wants to profit off of the people on here, on the merit that I can’t possibly be sharing all this information with good intentions in mind. This is blatantly false, I write these posts so that fellow retail investors may possibly enjoy outsized returns that can allow them to do things that might otherwise not have been possible. If I get even one message saying that because of something I wrote, someone was able to put themselves or their kid through college, was able to pay down bad debt, go on that long awaited vacation or buy their dream house, every letter I wrote and every one of my hundreds of replies under each one of my posts on here, all of that, will have been worth it. Now that I got that out of the way, here is the list:</p>\n\n<p>Sector data:</p>\n\n<p><a href=\"https://www.uxc.com/\">https://www.uxc.com/</a></p>\n\n<p><a href=\"https://numerco.com/\">https://numerco.com</a></p>\n\n<p><a href=\"https://www.oecd-nea.org/jcms/pl_14100\">https://www.oecd-nea.org/jcms/pl_14100</a></p>\n\n<p>Sector coverage:</p>\n\n<p><a href=\"https://www.haywood.com/what-we-offer/research\">https://www.haywood.com/what-we-offer/research</a></p>\n\n<p><a href=\"https://www.cameco.com/\">https://www.cameco.com/</a></p>\n\n<p><a href=\"https://www.urnmetf.com/about\">https://www.urnmetf.com/about</a></p>\n\n<p>Twitter:</p>\n\n<p><a href=\"https://www.reddit.com/user/uraniuminsider\">u/uraniuminsider</a></p>\n\n<p><a href=\"https://www.reddit.com/user/quakes99\">u/quakes99</a></p>\n\n<p><a href=\"https://www.reddit.com/user/Yellowbull11\">u/Yellowbull11</a></p>\n\n<p><a href=\"https://www.reddit.com/user/Uraniumsir\">u/Uraniumsir</a></p>\n\n<p><a href=\"https://www.reddit.com/user/808sandU3O8\">u/808sandU3O8</a></p>\n\n<p>Must watch/read:</p>\n\n<p><a href=\"https://www.macrovoices.com/podcast-transcripts/899-mike-alkin-guy-keller-uranium-special\">https://www.macrovoices.com/podcast-transcripts/899-mike-alkin-guy-keller-uranium-special</a></p>\n\n<p><a href=\"https://investingnews.com/category/daily/resource-investing/energy-investing/uranium-investing/\">https://investingnews.com/category/daily/resource-investing/energy-investing/uranium-investing/</a></p>\n\n<p><a href=\"https://thetideoffortune.com/would-you-have-made-a-fortune-in-uranium-part-1/\">https://thetideoffortune.com/would-you-have-made-a-fortune-in-uranium-part-1/</a></p>\n\n<p>&#x200B;</p>\n\n<p>I hope this list helps anyone invested in or looking to invest in the uranium sector. Remember that this sector is extremely volatile and you need both great patience and conviction to stick to the trade and reap the rewards at the end of it. Setting tight stop losses or taking early profits will almost certainly result in losing out on significant upside (nothing wrong with taking a profit, this is just my view). Trying to trade in and out of this bull market trying to time the cycles is also nearly impossible so unless you know exactly what to do (and even that is debatable), it is advised to buy and hold for the duration of this bull cycle, which I think will be around 5 years, give or take 2 years on either side of that. </p>\n\n<p>As always, make sure to do your own research and only use my posts as a platform for further research into this sector. Most of my posts, or the hundreds of comments that have been placed below it, will answer any question you may have so please make sure to read those first to get up to speed. Lastly I will not be giving any company/ticker suggestions, in order to not violate any of the rules of this subrerddit. Best of luck in this investment and thank you all for the support, it has been a real pleasure receiving so many positive messages amongst all the critics and naysayers. Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 58,
  "permalink": "/r/stocks/comments/lb4ppe/a_list_of_useful_sources_to_guide_you_through_the/",
  "subreddit": "stocks",
  "id": "lb4ppe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541054
}