{
  "author": "Serraph105",
  "the_new_excerpt": "So I had a conversation with a coworker yesterday. According to him, the only\nway to get anything done around our place of work is to work through your lunch\nhour. I did the math on how much time you are giving for free and I found that\nit added up to 32.5 work days, assuming you work 8 hour days…",
  "original_created_utc": 1608310522,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我昨天和一位同事进行了一次谈话。据他说，唯一的\n在我们工作的地方做任何事情的方法就是在午餐时间工作。\n小时。我计算了一下你免费提供的时间，我发现\n假设你每天工作8小时(…)，那么加起来就是32.5个工作日",
      "title": "LPT：不要在午餐时间工作。每天一个小时相当于一年工作32.5天(8小时/天)。每年不要给你的企业一个月的免费劳动力。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我昨天和一位同事進行了一次談話。據他說，唯一的\n在我們工作的地方做任何事情的方法就是在午餐時間工作。\n小時。我計算了一下你免費提供的時間，我發現\n假設你每天工作8小時(…)，那麼加起來就是32.5個工作日",
      "title": "LPT：不要在午餐時間工作。每天一個小時相當於一年工作32.5天(8小時/天)。每年不要給你的企業一個月的免費勞動力。"
    }
  ],
  "title": "LPT: Do not work through your lunch hour. An hour a day adds up to 32.5 days (8hrs/day) of work a year. Do not give your business a month of free labor each year.",
  "created_utc": 1608353679,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I had a conversation with a coworker yesterday. According to him, the only way to get anything done around our place of work is to work through your lunch hour. I did the math on how much time you are giving for free and I found that it added up to 32.5 work days, assuming you work 8 hour days that is, which is just over a month of free labor you are providing to your place of business. So my recommendation is to not do that, and if you do, at least understand the cumulative total of what you are doing for free to people who should be paying you.</p>\n\n<p>Edit thanks for all the awards guys, makes me smile.</p>\n\n<p>I&#39;m seeing continued posts about my map being wrong, and I thought I&#39;d clears up some initial confusion. 24 hours is not a work day, you need to divide 260 hours by 8 hours because 8 hours is a standard workday.</p>\n</div><!-- SC_ON -->",
  "score": 87630,
  "permalink": "/r/LifeProTips/comments/kfottr/lpt_do_not_work_through_your_lunch_hour_an_hour_a/",
  "subreddit": "LifeProTips",
  "id": "kfottr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260395761
}