{
  "author": "herbal_healer",
  "the_new_excerpt": "When I dont want to have sex and my bf is \"worked up\" already he doesnt like it\nat all and makes a big scene of how he will have to go masturbated alone and it\nmakes me feel so bad. Is this him being an insecure little bitch or is this more\nserious because I end up feeling so bad I just let it…",
  "original_created_utc": 1614281447,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当我不想做爱，而我男朋友已经 \"兴奋 \"起来的时候，他就不喜欢这样。\n并大肆宣扬他将不得不独自去自慰，而且它\n让我感觉很不好。这是他作为一个缺乏安全感的小婊子，还是这更。\n严重的是，我最终感觉如此糟糕，我只是让它... ...",
      "title": "一旦一个男人勃起，他是否必须射精？就像我的意思是必须的，否则会伤害或影响他们在某些方面？认真的回答，只是因为我的男朋友让我感觉很糟糕，当我不想做爱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我不想做愛，而我男朋友已經 \"興奮 \"起來的時候，他就不喜歡這樣。\n並大肆宣揚他將不得不獨自去自慰，而且它\n讓我感覺很不好。這是他作爲一個缺乏安全感的小婊子，還是這更。\n嚴重的是，我最終感覺如此糟糕，我只是讓它... ...",
      "title": "一旦一個男人勃起，他是否必須射精？就像我的意思是必須的，否則會傷害或影響他們在某些方面？認真的回答，只是因爲我的男朋友讓我感覺很糟糕，當我不想做愛。"
    }
  ],
  "title": "Once a man gets a boner does he have to cum ? Like I mean HAVE too or else it hurts or effects them in some way ? Serious answers only because my bf makes me feel bad when I don't want sex.",
  "created_utc": 1614293079,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I dont want to have sex and my bf is &quot;worked up&quot; already he doesnt like it at all and makes a big scene of how he will have to go masturbated alone and it makes me feel so bad. Is this him being an insecure little bitch or is this more serious because I end up feeling so bad I just let it happen. I dont not enjoy it but I&#39;m not that up for it and find it hurts sometimes and if it hurts to much and I let him know and he makes me feel bad about it saying he feels like a rapist and I dont ever know what to do.</p>\n\n<p>It&#39;s like he acts like he has to cum it else it will kill him. I hate this about him it&#39;s like it effects his self esteem and hes 28 a fucking adult man I dont understand him,</p>\n\n<p>men is it like 100% necessary to cum ? Like does it effect your self esteem when your girlfriend just wants to cuddle for a night? </p>\n\n<p>Do you say&quot;  do you think I&#39;m unattractive? &quot; in response to  &quot; can we just cuddle and watch stuff tonight&quot;  or am I in a horrible relationship and need to get away.</p>\n</div><!-- SC_ON -->",
  "score": 136,
  "permalink": "/r/TooAfraidToAsk/comments/lseq3m/once_a_man_gets_a_boner_does_he_have_to_cum_like/",
  "subreddit": "TooAfraidToAsk",
  "id": "lseq3m",
  "is_self": true,
  "media": null,
  "is_video": false
}