{
  "author": "GroundbreakingLack78",
  "original_created_utc": 1660905906,
  "title": "How to Quit Cryptocurrency ( step by step guide )",
  "created_utc": 1660926870,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Step 1: Sell everything. For real go for panic sell. Quickly stop doing anything that you’re doing, open your exchange or call your local dealer that you want to sell everything right now. Don’t even try to own a fraction of a coin. You got to minimize the risks. If you really want to quit, you got to give it a 100% from you.&lt;/p&gt;\n\n&lt;p&gt;Step 2: Seek validation here on Reddit. It’s just simply not enough to sell everything. You have to post about it, tell everyone.. You have to prevent a “change of heart”, it is needed to announce your departure, that you have weak hands etc.. We really care about who is leaving us, it’s important to us, so don’t forget to post with &lt;strong&gt;BOLD&lt;/strong&gt; font and tons of hands emojis. You won’t believe how much the internet friends care about you!&lt;/p&gt;\n\n&lt;p&gt;Step 3: Have some impenetrable talking points. Remember, people that are leaving cryptosphere, need to have reasons for it why. Make sure, that you’re well prepared with some of the most used ones ( *crypto bought me a new friend on batteries, cured my dog from eating shit in our local park etc.. ). If you’re not that creative you can use some basics ( Price volatility, Centralizing, GOV wants to ban it..(again), China is banning it…, Tesla just sold BTC.. etc.. ) there’s plenty of reasons which you can use. Make sure to have one during the Step 2 too.&lt;/p&gt;\n\n&lt;p&gt;Step 4: You can sleep without having those cryptocurrency shackle on your arms. &lt;/p&gt;\n\n&lt;p&gt;Step 5: Cry, and FOMO back when everyone starts talking about crypto again, even the granny in the grocery shop.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/wsasdj/how_to_quit_cryptocurrency_step_by_step_guide/",
  "subreddit": "CryptoCurrency",
  "id": "wsasdj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Step 1: Sell everything. For real go for panic sell. Quickly stop doing anything\nthat you’re doing, open your exchange or call your local dealer that you want to\nsell everything right now. Don’t even try to own a fraction of a coin. You got\nto minimize the risks. If you really want to quit, you got…"
}