{
  "author": "QuantumShot",
  "original_created_utc": 1640421241,
  "title": "Crypto just changed my life!",
  "created_utc": 1640431923,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After so many years I finally made it! I am officially debt-free! &lt;/p&gt;\n\n&lt;p&gt;Because of university and other personal troubles (aka kids) I struggled to keep my finances in a solid state. So when months and years went by, my debts rose. And as a person who always needs an organised lifestyle and plain surroundings my fear of the future climbed in correlation with my financial situation. \nAs I reflected how to regulate my problem, I stumbled across the world of magic internet money. And as soon as I started to read more about this topic I got more and more excited. For me this seemed to be my only chance to ‚survive‘. And against my actual attitude, I went all in. I put 85% of my investment in MATIC, that was around February, when the price was at 0,05$. And yesterday I sold everything! And you know what? I am fucking debt-free now! There are no more people who are allowed to claim money from me! I am finally free! All the dust, all the tears are gone! &lt;/p&gt;\n\n&lt;p&gt;I understand if someone criticise, that it’s the tech that counts and people who are in for the money are just crazy apes who want to get as rich as possible. But try to wear my shoes for a second. I can breath again, without this pain in my chest of failing my life.\nAnd I know what some of you might think. And yes, I could‘ve HODL until I was filthy rich but that doesn’t matter for me. Finally I feel like a human being again! Without the chains of debt. And I want to share this experience and celebrate with you! \nFeel free to tell me your stories! &lt;/p&gt;\n\n&lt;p&gt;Merry fucking Christmas to everyone!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 291,
  "permalink": "/r/CryptoCurrency/comments/ro5xaz/crypto_just_changed_my_life/",
  "subreddit": "CryptoCurrency",
  "id": "ro5xaz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After so many years I finally made it! I am officially debt-free!\n\nBecause of university and other personal troubles (aka kids) I struggled to keep\nmy finances in a solid state. So when months and years went by, my debts rose.\nAnd as a person who always needs an organised lifestyle and plain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長い年月を経て、ついに成功したのです 正式に無借金となりました!\n\n大学や他の個人的な問題（つまり子供たち）のために、私は、このような\nを、しっかりとした状態で維持することができました。そのため、数ヶ月、数年と経つと、借金が増えていきました。\nそして、常に整理されたライフスタイルと平凡さを必要とする人間として...。",
      "title": "クリプトが私の人生を変えた!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经过这么多年，我终于成功了! 我正式实现了无债一身轻!\n\n由于大学和其他个人问题（也就是孩子），我一直在努力保持\n我的财务状况处于稳定状态。因此，当几个月和几年过去后，我的债务就上升了。\n而作为一个总是需要有组织的生活方式和朴素的人...",
      "title": "Crypto刚刚改变了我的生活!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經過這麼多年，我終於成功了! 我正式實現了無債一身輕!\n\n由於大學和其他個人問題（也就是孩子），我一直在努力保持\n我的財務狀況處於穩定狀態。因此，當幾個月和幾年過去後，我的債務就上升了。\n而作爲一個總是需要有組織的生活方式和樸素的人...",
      "title": "Crypto剛剛改變了我的生活!"
    }
  ]
}