{
  "author": "vucar",
  "the_new_excerpt": "I'm an amateur investor about 2 years into investing and learning and reading as\nmuch as I can. So far I've read A Walk Down Wallstreet and a couple other\nsimilar books that have convinced me that, outside of changing careers and\ncommitting my life to understanding investment finance, the best I can…",
  "original_created_utc": 1616349889,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个业余投资者，进入投资领域2年左右，边学习边看书。\n尽可能多的。到目前为止，我已经读了《漫步华尔街》和其他几本。\n类似的书，让我相信，在转行之外和\n致力了解投资理财，尽我所能... ...",
      "title": "个人投资者 \"估值 \"VS指数基金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個業餘投資者，進入投資領域2年左右，邊學習邊看書。\n儘可能多的。到目前爲止，我已經讀了《漫步華爾街》和其他幾本。\n類似的書，讓我相信，在轉行之外和\n致力瞭解投資理財，盡我所能... ...",
      "title": "個人投資者 \"估值 \"VS指數基金"
    }
  ],
  "title": "Personal investor \"Valuation\" vs. Index funds",
  "created_utc": 1616419829,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an amateur investor about 2 years into investing and learning and reading as much as I can. So far I&#39;ve read A Walk Down Wallstreet and a couple other similar books that have convinced me that, outside of changing careers and committing my life to understanding investment finance, the best I can do is a broad market index fund. I&#39;m <strong><em>not</em></strong> a day trader -- I am a buy-and-hold for decades type, probably best described as a Boglehead in my strategy, and I&#39;m content with that ... mostly. </p>\n\n<p>I often read people commenting &quot;X is undervalued&quot; or &quot;Y is overvalued&quot; and this drives their decision making in picking stocks. From what I&#39;ve researched, learning how to properly value a company and the value its stock ought to have is complex; furthermore, everything I&#39;ve read so far has suggested that if there were a way to &quot;beat the market&quot; with some understanding of market evaluations, everyone would have already done it and it should be priced in.  Even if you can correctly identify a stock that is worth more than its market price, a thousand unrelated and unpredictable variables could make that valuation effectively meaningless and non-actionable. </p>\n\n<p>So I&#39;m left conflicted: obviously, big investment firms make billions and they&#39;re not all just index funds - decisions are being made on large scales that are extremely profitable, but I intuit that these are not the same strategies or decisions that scale down to individual investors, and yet individual investors continue to make these comments on &quot;valuation&quot;. </p>\n\n<p>Is it really possible for an individual to know enough to actually identify undervalued stocks, and does that consistently work for anyone?  Is there any book I could read that would be educational in learning how to evaluate companies/stocks for the individual investor?</p>\n</div><!-- SC_ON -->",
  "score": 69,
  "permalink": "/r/investing/comments/ma29dn/personal_investor_valuation_vs_index_funds/",
  "subreddit": "investing",
  "id": "ma29dn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819532
}