{
  "author": "wonder-toast",
  "original_created_utc": 1660715639,
  "title": "Is it common for men to have really bad Hygiene in general or is just a thing that happens in my country?",
  "created_utc": 1660748443,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve (27f) heard a ton of &amp;quot;scary&amp;quot; stories from my girlfriends of men not washing their penises or butts properly and them finding out before having sex and all that, is that a thing that happens everywhere or just here in Mexico?&lt;/p&gt;\n\n&lt;p&gt;Edit: If this has happened to you please share the story if you&amp;#39;re comfortable&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/wqh008/is_it_common_for_men_to_have_really_bad_hygiene/",
  "subreddit": "TooAfraidToAsk",
  "id": "wqh008",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I've (27f) heard a ton of \"scary\" stories from my girlfriends of men not washing\ntheir penises or butts properly and them finding out before having sex and all\nthat, is that a thing that happens everywhere or just here in Mexico?\n\nEdit: If this has happened to you please share the story if you're…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は（27歳）、女友達から、ペニスやお尻をきちんと洗わない男性の「怖い」話をたくさん聞いてきました。\nペニスやお尻をきちんと洗わず、セックスする前にバレてしまったとか、そういう「怖い話」を女友達からたくさん聞いたから。\nそれはどこでもあることなのでしょうか、それともここメキシコだけなのでしょうか？\n\n編集部：もし、このようなことがあったのなら、その話をシェアしてください。",
      "title": "男性の衛生観念は一般的なものなのでしょうか、それとも私の国で起こっていることなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（27岁）从我的女朋友那里听到了一大堆 \"可怕 \"的故事，说男人没有正确地清洗他们的阴茎或屁股。\n他们的阴茎或屁股没洗干净，他们在做爱前发现了这些问题。\n这是在任何地方都会发生的事情，还是只是在墨西哥？\n\n编辑：如果这种情况发生在你身上，请分享故事，如果你是...",
      "title": "一般来说，男人的卫生状况很差，这很常见，还是只是发生在我们国家的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（27歲）從我的女朋友那裏聽到了一大堆 \"可怕 \"的故事，說男人沒有正確地清洗他們的陰莖或屁股。\n他們的陰莖或屁股沒洗乾淨，他們在做愛前發現了這些問題。\n這是在任何地方都會發生的事情，還是隻是在墨西哥？\n\n編輯：如果這種情況發生在你身上，請分享故事，如果你是...",
      "title": "一般來說，男人的衛生狀況很差，這很常見，還是隻是發生在我們國家的事情？"
    }
  ]
}