{
  "author": "dmack080288",
  "original_created_utc": 1638489645,
  "title": "Recent MATIC price pump.",
  "created_utc": 1638502620,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;MATIC is up over 75% in less that a month, hitting $2.20 today.&lt;/p&gt;\n\n&lt;p&gt;But why the increase? There are 3 factors that could be influencing this recent rally. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;On December 9th it will be hosting the zk Summit. The event is a forum for discussion of zk scaling, a proofing algorithm that promises to be the future of blockchain computing.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The zk proofing mechanism stands for &amp;#39;zero knowledge&amp;#39;. With this consensus mechanism, transactions are sent to a third party for verification. However, the third party doesn’t have access to the exact information it is verifying. It combines the benefits of third-party validation with an added layer of security, seeing as the third party doesn’t have full access to the data.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;An increase in active users and wallets. MATIC had seen a steady increases of users on the network, currently at an all time high of 282,760.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Ecosystem Expansion and the addition of new protocols to the polygon network, most notably Idex, who recently announced Idex v3 will launch on the polygon network. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;In recent times project launches from NFT projects like OpenBeSea and gaming and DeFi projects like Rainmaker games, harvest finance and jarvis network. &lt;/p&gt;\n\n&lt;p&gt;What are tour thoughts on MATIC? Are you bullish, do you hold a bag? &lt;/p&gt;\n\n&lt;p&gt;Be good to see what you guys think as I don&amp;#39;t see it often in this sub&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/r7l0fg/recent_matic_price_pump/",
  "subreddit": "CryptoCurrency",
  "id": "r7l0fg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "MATIC is up over 75% in less that a month, hitting $2.20 today.\n\nBut why the increase? There are 3 factors that could be influencing this recent\nrally.\n\n 1. On December 9th it will be hosting the zk Summit. The event is a forum for\n    discussion of zk scaling, a proofing algorithm that promises to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "MATICは1ヶ月足らずで75％以上上昇し、本日2.20ドルを記録しています。\n\nしかし、なぜ上昇したのだろうか？この上昇には3つの要因があると思われる。\nを上昇させる。\n\n 1. 12月9日にzkサミットを開催する。このイベントは\n    zkスケーリングについて議論しています。このアルゴリズムは、...",
      "title": "最近のMATICのプライスポンプ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "MATIC在不到一个月的时间里上涨了75%以上，今天达到了2.20美元。\n\n但是为什么会有这样的增长呢？有三个因素可能影响到最近的这一\n涨势。\n\n 1. 12月9日，它将举办zk峰会。该活动是一个讨论\n    讨论zk的缩放，这是一种证明算法，承诺将...",
      "title": "最近的MATIC价格泵。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "MATIC在不到一個月的時間裏上漲了75%以上，今天達到了2.20美元。\n\n但是爲什麼會有這樣的增長呢？有三個因素可能影響到最近的這一\n漲勢。\n\n 1. 12月9日，它將舉辦zk峯會。該活動是一個討論\n    討論zk的縮放，這是一種證明算法，承諾將...",
      "title": "最近的MATIC價格泵。"
    }
  ]
}