{
  "author": "ZidaneLoire",
  "original_created_utc": 1624944999,
  "title": "Secure your accounts, secure your investments",
  "created_utc": 1624977572,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys,</p>\n\n<p>I&#39;m going to leave this post up for a couple of days and afterwards I am going to delete it. Take notes. (EDIT: The reason why I want to delete this after a few days is to protect my own security habits. At some commenters&#39; request I will leave it up for longer than a couple of days. Perhaps a couple of weeks then. Do know that this will be deleted eventually. Do not save this post, copy and paste it to your own notes.) </p>\n\n<p>So a lot of you are losing money by using poor cybersecurity practices. Most of my friends and people online say I&#39;m a bit overkill and paranoid. I think everyone should be overkill and paranoid about their online security. Cybersecurity isn&#39;t &quot;for the nerds&quot; anymore. A lot of companies, governments and black hats are after your stuff for one reason or another and you need to wise up. &quot;but i don&#39;t have anything to hide...&quot; &lt;- Zip it! Your computer and your phone hold more info than your closest friends. Believe me, you do have something to hide. That information can and will be used against you by anyone who can get to it.</p>\n\n<p>I decided to write a quick post giving you a layman&#39;s introduction to protecting your stuff and where you can further educate yourself. Without further ado, here&#39;s the paranoia guide to internet privacy and security, volume I:</p>\n\n<p>Passwords: </p>\n\n<p>Passwords are the keys to your stuff. You should never reuse passwords. You should only have one password, that is, the password of your password manager. That&#39;s it. Password managers are encrypted databases that hold your passwords and usernames, plus some extra notes if you wish. You use them by copying and pasting the info from the database to your login forms. They have specific security features for this purpose, therefore they&#39;re the right tool for this job (for instance, they clear your clipboard 15 seconds after you copied your login/password to prevent clipboard leak).</p>\n\n<p>You program your manager to create as complex of a password as you want, but I find that 15 characters long with numbers and special characters in the mix are the best, as in case you need to use an external computer, you don&#39;t wanna be spending too much time typing in a password manually.</p>\n\n<p>There are two types, offline and online. I prefer offline because I&#39;m paranoid. Whatever is not in the cloud or accessible online is safer. If someone manages to hijack your browser or phish you, they may get access to your online manager. If someone manages to hack your account, they may get access to your online manager. Most people that use an online manager are fine. They have good programmers taking care of security. Still...</p>\n\n<p>My recommendations are: For online Bitwarden. It&#39;s open source and endorsed by the best cybersecurity nerds here on reddit. For offline, Keepass. Works with windows, you can put it in a flash drive and also works with android. Do put it in a dedicated flashdrive or two, because if your computer breaks, there goes all your passwords.</p>\n\n<p>&quot;But wasn&#39;t Keepass hacked?&quot; &lt;- No. The machine where they hacked keypass, using a program called keyfarse, was compromised. That brings me to:</p>\n\n<p>Machine security:</p>\n\n<p>A lot of you use windows. Linux is much safer, but also can be a PITA to use sometimes. If you&#39;re gonna use windows (which I also do), make sure to use an antivirus and run regular scans (at least once a month). Which ones? Avast, karspersky, bitdefender, eset are the most recommended ones. Pair it up with malware bytes for a beefed up malware defense as well. ccleaner is great to tune up your machine, but I also use it to remove start up programs easily, in order to kill bloatware or infection vectors.</p>\n\n<p><strong>However</strong> like my cybersecurity teacher once told me, an antivirus is something that will protect you after you already messed up. It&#39;s a cure, not a defense. Someone has to get infected in order for the programmers to create a defense for it. So your true line of defense are your internet habits. Make sure your machine is updated. A lot of security holes are constantly being patched around the clock and delivered to you via updates. Updating is a slog, but it is important. </p>\n\n<p>Also, a lot of infection vectors come from pirated software and games. DYOR on the best piracy practices here on reddit (I shall say no more, nor link any more websites because I know some mods are touchy with it).</p>\n\n<p>Browser:</p>\n\n<p>A lot of people use chrome. Some people are into brave. I personally recommend Firefox. Firefox is the tried and true staple of anonymity and cyber security. It might not give you tokens, but hey it&#39;s pretty good at what it does. The default firefox is pretty good, but using extensions makes it perfect. Go into security settings, set up Do not track, HTTPS everywhere and jack up browser security to strict. Disable autofill, disable save passwords and logins (that&#39;s what the manager&#39;s for). I use the same on my android phone. For your phone you&#39;ll have to copy your keepass database manually using a cable every time you update it.  PROTIP: You can save your address/cc card as a login info for easy form filling. You can also save your cc card expiration date and emergency numbers too, in case your card gets stolen you can cancel it quickly.</p>\n\n<p>Extensions:</p>\n\n<p>I recommend you install ublock origin (I know, I know, support websites. However, ads are a massive vector of malware. You can always unblock your favorite sites), privacy badger, privacy possum (anti trackers), multiaccount containers and descentraleyes. On android there&#39;s no option for HTTPS everywhere, so you should use the extension HTTPS everywhere. Every extension has an explanation page, but if you wanna know more, I can give you the quick version. Just ask.</p>\n\n<p>If you&#39;re good with computers, noscript and cleanlinks are good choices. The reason I say &quot;if you&#39;re good with computers&quot; is because these two extensions will break everything. Malware runs on scripts and trackers track you on tracking links, but so do normal website operations.</p>\n\n<p>2FA:</p>\n\n<p><strong>Do not use sms 2FA</strong>. Several people have come here and to other cybersecurity subreddits because they were hacked this way. Your sim card can be cloned and someone else can get the same sms as you. In a pinch, you can use google authenticator, but what you should actually be using is yubikeys. Yubikeys are 2FA devices that will unlock your account via USB or via NFC. They&#39;re great, unhackable (so far), portable, offline, safe and only cost 50 bucks. Have more than one, because if your single yubikey breaks, then you have another.  Yes, you can attach more than one key to your account. They work with most of the popular services (google, microsoft, amazon, facebook, instagram, etc...) and, best of all, they work with keepass.</p>\n\n<p>E-mail:</p>\n\n<p>Have a secret e-mail that no one knows about and use it as a recovery e-mail in case all else fails. I personally use protonmail for my secret recovery e-mail. It also gets the e-mails in case my main e-mails gets an unauthorized access.</p>\n\n<p>Likewise have a crap e-mail that you give to everyone who gatekeeps you from accessing what you want in exchange for an e-mail. I check that one once per give away, to confirm the link they send me. You can set up filters to forward the stuff you need easily.</p>\n\n<p>Never click on links on your e-mail. Got an e-mail from Netflix? Manually use your browser to get to Netflix.</p>\n\n<p>Reduce social engineering sources:</p>\n\n<p>I don&#39;t know how you feel about social media, however I hacked my first account at 13 using info I got from social media of a friend. How did I do that? Well his security question was &quot;what color is my house&quot; and his profile pic was in front of his house. I didn&#39;t mess (too much) with his account, but it shows how easy it is to gather info from your social media and use it against you. Be careful with what you put on social media. Another way I can easily steal your info is if you use my computer and I change the save login and password settings to save yours. <em>Check the browser you are using and make sure your info isn&#39;t being stolen</em>. Nevertheless a keylogger can be running in the background, so better yet, do not put your credentials in a computer that you yourself aren&#39;t managing. Do not open, under any circumstances, your keepass database in a computer that you aren&#39;t managing. Also be aware of running your mouth on social media, particularly on reddit. Your post history is not private. You only need so many crumbs to pull off social engineering hacks. Loose lips sink ships!</p>\n\n<p>Crypto:</p>\n\n<p>Ok now onto crypto. As you are well aware, the best crypto storage device is a hardware wallet, like a Ledger or a Trezor. Do use a passphrase. As for your security key, keep it in a steel wallet. They are impervious to fires, floods and kind of secure but also super obvious to who&#39;s in crypto. If you&#39;re a digital nomad and you&#39;re roaming around, perhaps writing it in somewhere clever, say, a book, might be better to get through airport security. If you wanna store your mnemonic extra securely, I recommend several steel wallets and using Shamir&#39;s secret sharing technique using slip-0039. In short, it allows you to spread your seed over, say, 3 cards and you need all 3 to reset your hardware wallet. That means you can entrust those cards to someone (responsible, so they don&#39;t lose it) and they can&#39;t do anything with it. Or you can have 5 cards and need 3 out of 5 to get to your mnemonic. DYOR about SSS using Slip-0039.</p>\n\n<p>What you should not do is invent your own cryptographic scheme (unless you&#39;re some sort of cryptographic genius) because you will create something that&#39;s less secure than what&#39;s out there, easier to crack and, worse even, you might forget what was your scheme.</p>\n\n<p>VPN:</p>\n\n<p>Tom Scott published a video saying VPNs were less useful than you might think and mocking adverts of VPNs. I recommend you watch it on Youtube for impartiality&#39;s sake. I honestly don&#39;t agree with it. I mean, he has many good points, browser security is pretty good nowadays and VPNs can be redundant. However, governments can still know which websites you&#39;re visiting and can keep you from accessing certain websites you want to access. Corporations will also have a harder time pinning you down with a VPN. I recommend a VPN. Personally i use wevpn, because it&#39;s super cheap. It costs money, but it removes internet gatekeepers and gives you that extra privacy bump. Do remember to rotate servers to try and mitigate the risk of landing on a compromised VPN server.</p>\n\n<p>There&#39;s so much more that I&#39;d love to tell you but it&#39;s getting pretty long. I didn&#39;t cover cloud services and hard drive encryption. Some other time perhaps.</p>\n\n<p>More info:\n<a href=\"/r/privacy\">r/privacy</a>\n<a href=\"/r/europrivacy\">r/europrivacy</a>\n<a href=\"/r/cybersecurity\">r/cybersecurity</a>\n<a href=\"/r/privacytoolsio\">r/privacytoolsio</a></p>\n\n<p>Keep yourself safe and anonymous. I&#39;m open to suggestions and criticisms, so if your method is better than my method, please share your method so I can use it too. Feel free to copy and paste it, even if you do not credit me. It&#39;s not a paranoia guide that&#39;s gonna make me famous.</p>\n\n<p>PS: This is advice for accessing the clear web. This is inadequate advice to access the darknet (because it&#39;s not relevant for this sub).</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/oa1y35/secure_your_accounts_secure_your_investments/",
  "subreddit": "CryptoCurrency",
  "id": "oa1y35",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys,\n\nI'm going to leave this post up for a couple of days and afterwards I am going\nto delete it. Take notes. (EDIT: The reason why I want to delete this after a\nfew days is to protect my own security habits. At some commenters' request I\nwill leave it up for longer than a couple of days.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "やあ、みんな。\n\nこの記事は2、3日放置して、その後は削除します。\n削除するよ。メモしておいてね。(EDIT: 数日後にこの記事を削除したい理由は、私自身のセキュリティ習慣を守るためです。\n数日後に削除したい理由は、私自身のセキュリティ習慣を守るためです。何人かのコメンターからの要望で\n数日以上放置します....",
      "title": "あなたの口座を守る、あなたの投資を守る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们。\n\n我打算把这个帖子保留几天，然后我将\n删除它。请注意。(编辑：我之所以要在几天后删除它，是为了保护我自己的安全习惯。\n是为了保护我自己的安全习惯。应一些评论者的要求，我\n会把它放在上面超过几天的时间....",
      "title": "保护你的账户，保护你的投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們。\n\n我打算把這個帖子保留幾天，然後我將\n刪除它。請注意。(編輯：我之所以要在幾天後刪除它，是爲了保護我自己的安全習慣。\n是爲了保護我自己的安全習慣。應一些評論者的要求，我\n會把它放在上面超過幾天的時間....",
      "title": "保護你的賬戶，保護你的投資"
    }
  ]
}