{
  "author": "Fell0w_traveller",
  "original_created_utc": 1659787140,
  "title": "How bad was opium addiction that it led to China's downfall?",
  "created_utc": 1659807055,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Oftentimes when we read about a drug crisis (eg. the eighties crack era), the facts had been greatly exaggerated, sometimes for political reasons, or the drugs were a scapegoat for other problems. So I&amp;#39;ve always been somewhat sceptical of the official (i.e. CCP-approved) version of the Opium Wars and how they led to China&amp;#39;s downfall. Considering everything that&amp;#39;s been written about opioid addiction from a modern, clinical perspective, it&amp;#39;s hard to imagine something as relatively mild as opium weakening China to such an extent that it led to mass narco-mania and the Century of Humiliation.&lt;/p&gt;\n\n&lt;p&gt;Are there any reliable reports or data on how bad opium addiction was in 18th-early 20th century China, versus merely casual use (not everyone who takes opium will slip into a dysfunctional spiral)? How much of China&amp;#39;s problems can be directly pinned on corruption and foreign meddling, consequences of the opium &lt;em&gt;trade&lt;/em&gt;, versus the effects of opium itself? Could it be said the Opium Wars were really about other interests (i.e. the British wanted to get in China for trade/empire, the Chinese wouldn&amp;#39;t let them) but telling this horrible story of addiction was an easier way to rile up the masses?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/whmngx/how_bad_was_opium_addiction_that_it_led_to_chinas/",
  "subreddit": "AskHistorians",
  "id": "whmngx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Oftentimes when we read about a drug crisis (eg. the eighties crack era), the\nfacts had been greatly exaggerated, sometimes for political reasons, or the\ndrugs were a scapegoat for other problems. So I've always been somewhat\nsceptical of the official (i.e. CCP-approved) version of the Opium Wars…"
}