{
  "author": "Fell0w_traveller",
  "original_created_utc": 1659787140,
  "title": "How bad was opium addiction that it led to China's downfall?",
  "created_utc": 1659807055,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Oftentimes when we read about a drug crisis (eg. the eighties crack era), the facts had been greatly exaggerated, sometimes for political reasons, or the drugs were a scapegoat for other problems. So I&amp;#39;ve always been somewhat sceptical of the official (i.e. CCP-approved) version of the Opium Wars and how they led to China&amp;#39;s downfall. Considering everything that&amp;#39;s been written about opioid addiction from a modern, clinical perspective, it&amp;#39;s hard to imagine something as relatively mild as opium weakening China to such an extent that it led to mass narco-mania and the Century of Humiliation.&lt;/p&gt;\n\n&lt;p&gt;Are there any reliable reports or data on how bad opium addiction was in 18th-early 20th century China, versus merely casual use (not everyone who takes opium will slip into a dysfunctional spiral)? How much of China&amp;#39;s problems can be directly pinned on corruption and foreign meddling, consequences of the opium &lt;em&gt;trade&lt;/em&gt;, versus the effects of opium itself? Could it be said the Opium Wars were really about other interests (i.e. the British wanted to get in China for trade/empire, the Chinese wouldn&amp;#39;t let them) but telling this horrible story of addiction was an easier way to rile up the masses?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/whmngx/how_bad_was_opium_addiction_that_it_led_to_chinas/",
  "subreddit": "AskHistorians",
  "id": "whmngx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Oftentimes when we read about a drug crisis (eg. the eighties crack era), the\nfacts had been greatly exaggerated, sometimes for political reasons, or the\ndrugs were a scapegoat for other problems. So I've always been somewhat\nsceptical of the official (i.e. CCP-approved) version of the Opium Wars…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちが薬物危機（例えば80年代のクラック時代）について読むとき、しばしばその事実は大きく誇張されています。\n政治的な理由で事実が大きく誇張されたり、薬物が他の問題のスケープゴートにされたりしていました。\n薬物は他の問題のスケープゴートだったのです。だから、私はいつも\nアヘン戦争についての公式な（つまり中国共産党が承認した）バージョンには懐疑的でした。",
      "title": "アヘン中毒は、中国を滅亡に導くほどひどいものだったのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多时候，当我们读到一场毒品危机（例如八十年代的快克时代）时，事实被大大夸大了。\n事实被大大地夸大了，有时是出于政治原因，或者毒品是其他问题的替罪羊。\n或者毒品是其他问题的替罪羊。因此，我一直都有点\n对官方（即中共批准的）版本的鸦片战争持怀疑态度......",
      "title": "鸦片瘾有多严重，以至于导致了中国的衰落？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多時候，當我們讀到一場毒品危機（例如八十年代的快克時代）時，事實被大大誇大了。\n事實被大大地誇大了，有時是出於政治原因，或者毒品是其他問題的替罪羊。\n或者毒品是其他問題的替罪羊。因此，我一直都有點\n對官方（即中共批准的）版本的鴉片戰爭持懷疑態度......",
      "title": "鴉片癮有多嚴重，以至於導致了中國的衰落？"
    }
  ]
}