{
  "author": "vjeva",
  "original_created_utc": 1637230599,
  "title": "Almost all Metaverse and Gaming Crypto projects are crap, we are all buying the hype and not the technology and capability behind it, because most of these \"revolutionary projects\" have a bad or non-existing development team capable to push these projects live.",
  "created_utc": 1637284401,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Facebook triggered a certain action in the crypto space, and a lot of projects used this weird Zuckerberg announcement to promote and create hype around their own Metaverse or Gaming projects.</p>\n\n<p>I have also noticed that a lot of projects are adding a Metaverse and Gaming tag into their main description and roadmaps, even though a couple of months ago there was no plan or intention to go that route.</p>\n\n<p>I think we all need to be careful, most of these hyped metaverse projects are having a shady development team behind the curtains who are not capable to create something in that scale.</p>\n\n<p>Why?</p>\n\n<p>Because it takes years and years of development and funding to get these projects running, and right now, all I can see are some wild ideas about it with some big promises, and I don&#39;t believe any project will deliver anything close to a decent metaverse world.</p>\n\n<p>The same goes with gaming, a lot of you are talking about gaming crypto gems, but did you actually try to play one?</p>\n\n<p>The graphics, game plays and monetization is so bad and years and years behind the games that we used to play, that it just won&#39;t attract any newcomers to the gaming cryptospace.</p>\n\n<p>IMO the entire market is just jumping on that &quot;whats the technology trend right now&quot; train, trying to make as much profits out of that hype as possible. When the next bear market hits, and it will hit hard, I am sure that it will wipe out 90% of all the new created gaming and metaverse projects  out there.</p>\n\n<p>In the 2018 crash we saw a lot of memecoins disappear, in this one we will certainly add a lot of Metaverse and Gaming coins into the &quot;shitcoin bin&quot; during the next bear market.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/qwmqh3/almost_all_metaverse_and_gaming_crypto_projects/",
  "subreddit": "CryptoCurrency",
  "id": "qwmqh3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Facebook triggered a certain action in the crypto space, and a lot of projects\nused this weird Zuckerberg announcement to promote and create hype around their\nown Metaverse or Gaming projects.\n\nI have also noticed that a lot of projects are adding a Metaverse and Gaming tag\ninto their main…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Facebookがきっかけとなって、多くのプロジェクトが、この奇妙なZuckerbergの発表を利用して\n多くのプロジェクトが、この奇妙なザッカーバーグの発表を利用して、自分たちのメタバースやゲームのプロジェクトを宣伝し、宣伝効果を生み出しました。\n多くのプロジェクトが、この奇妙なザッカーバーグの発表を利用して、自分たちのメタバースやゲームのプロジェクトを宣伝し、宣伝効果を上げました。\n\nまた、多くのプロジェクトが、メタバースやゲーミングのタグを\nを追加しています。",
      "title": "ほとんどすべてのメタバースやゲーム暗号のプロジェクトはくだらないものです。私たちは皆、誇大広告を買っているのであって、その背後にある技術や能力を買っているわけではありません。なぜなら、これらの「革新的なプロジェクト」のほとんどは、これらのプロジェクトを推進する能力のある開発チームがいないか、存在していないからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Facebook引发了加密货币领域的某种行动，很多项目\n利用这个奇怪的扎克伯格公告来宣传和炒作他们的\n自己的Metaverse或游戏项目进行炒作。\n\n我还注意到，很多项目都在他们的主页面上添加了Metaverse和Gaming标签。\n在他们的主要项目中。",
      "title": "几乎所有的Metaverse和游戏加密项目都是垃圾，我们都在购买炒作，而不是背后的技术和能力，因为大多数这些 \"革命性的项目 \"有一个糟糕的或不存在的开发团队，能够推动这些项目。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Facebook引發了加密貨幣領域的某種行動，很多項目\n利用這個奇怪的扎克伯格公告來宣傳和炒作他們的\n自己的Metaverse或遊戲項目進行炒作。\n\n我還注意到，很多項目都在他們的主頁面上添加了Metaverse和Gaming標籤。\n在他們的主要項目中。",
      "title": "幾乎所有的Metaverse和遊戲加密項目都是垃圾，我們都在購買炒作，而不是背後的技術和能力，因爲大多數這些 \"革命性的項目 \"有一個糟糕的或不存在的開發團隊，能夠推動這些項目。"
    }
  ]
}