{
  "author": "BrokenandBratty",
  "original_created_utc": 1656045081,
  "title": "Why is it that men are shamed for pursuing younger women but it's totally fine when women pursue older men?",
  "created_utc": 1656082720,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And even in that, the man is always accused of some type of grooming when the woman is the one who pursued.&lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;m talking about adults. Not minors. &lt;/p&gt;\n\n&lt;p&gt;Ps. Im female and its just interesting to think about that  type of double standard. I like older men and so many other girls aren&amp;#39;t afraid to say it either so it&amp;#39;s kind of insulting when society believes that because im younger than my man I&amp;#39;m somehow being abused or was groomed and not an adult who made the conscious choice to pursue and date this man. &lt;/p&gt;\n\n&lt;p&gt;Or when there is a small problem in the relationship and the guy is more than 5 years older. He automatically groomed her and is abusive just because of the age gap. &lt;/p&gt;\n\n&lt;p&gt;However when the elder in a relationship is a women its smiled on or completely overlooked.&lt;/p&gt;\n\n&lt;p&gt;Edit: not looking for any hate. It&amp;#39;s just an interesting observation for me that I wanted opinions on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/vjfwft/why_is_it_that_men_are_shamed_for_pursuing/",
  "subreddit": "TooAfraidToAsk",
  "id": "vjfwft",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And even in that, the man is always accused of some type of grooming when the\nwoman is the one who pursued.\n\nAnd I'm talking about adults. Not minors.\n\nPs. Im female and its just interesting to think about that type of double\nstandard. I like older men and so many other girls aren't afraid to say…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "その中でも、男は必ず何らかの身だしなみで非難されるのは、その時に\n女性が追求したのです\n\nしかも、大人の話です。未成年者ではありません。\n\n追伸：私は女性です。私は女性ですが、このようなダブルスタンダードについて考えるのは興味深いことです。\nを考えるのは面白いですね。私は年上の男性が好きなのですが、他の多くの女の子たちは、年上の男性が好きだと言うことを恐れていません...。",
      "title": "なぜ、男性が若い女性を追いかけるのは恥ずかしくても、女性が年上の男性を追いかけるのは全く問題ないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "即使在这种情况下，男人也总是被指责为某种类型的引诱，而女人才是追求者。\n女人才是追求者。\n\n而且我说的是成年人。而不是未成年人。\n\nPs. 我是女性，思考这种双重标准很有意思。\n标准。我喜欢年长的男人，而其他许多女孩并不害怕说...",
      "title": "为什么男人追求年轻女人会被羞辱，而女人追求年长男人却完全没有问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "即使在這種情況下，男人也總是被指責爲某種類型的引誘，而女人才是追求者。\n女人才是追求者。\n\n而且我說的是成年人。而不是未成年人。\n\nPs. 我是女性，思考這種雙重標準很有意思。\n標準。我喜歡年長的男人，而其他許多女孩並不害怕說...",
      "title": "爲什麼男人追求年輕女人會被羞辱，而女人追求年長男人卻完全沒有問題？"
    }
  ]
}