{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1628184582,
  "title": "Proposal for governance: Increase karma by 25% for text posts",
  "created_utc": 1628191834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This proposal is to increase the karma multiplier for text posts, eligible towards moons, by an additional 25% for text posts, in other words the posts created in the &quot;text&quot; tab, which require people to type up their own original posts with a word count minimum.</p>\n\n<p>Currently comments are doubled, and comedy posts count for only 10%. The rest has no multiplier.</p>\n\n<p>This will mean that text posts that people type up will be worth 25% more than polls or link to articles.</p>\n\n<p>Text posts will still be bound by the 1K limit. The 25% will not increase that limit.</p>\n\n<p>This may also reduce the gap between text posts and daily comments, without needing the proposal that reduces daily posts by 50%.</p>\n\n<p>I&#39;m not going to get into the details of pros and cons, or give you a full sales pitch, I&#39;ll leave that to discussion below in the comments. Feel free to discuss it, and even propose better alternatives if you don&#39;t like this proposal. If you don&#39;t like it, I&#39;ll gladly hear your views, and encourage you to vote against it if you find it problematic.</p>\n\n<p><a href=\"https://www.reddit.com/poll/oynbtt\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 281,
  "permalink": "/r/CryptoCurrency/comments/oynbtt/proposal_for_governance_increase_karma_by_25_for/",
  "subreddit": "CryptoCurrency",
  "id": "oynbtt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This proposal is to increase the karma multiplier for text posts, eligible\ntowards moons, by an additional 25% for text posts, in other words the posts\ncreated in the \"text\" tab, which require people to type up their own original\nposts with a word count minimum.\n\nCurrently comments are doubled, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回の提案は、月に向けてのテキスト投稿の対象となるカルマの倍率を\n月の対象となるテキスト投稿のカルマ倍率をさらに25％増加させることを提案します。\nつまり、\"text \"タブで作成された、自分で入力したオリジナルの投稿には\nテキスト投稿とは、「テキスト」タブで作成される投稿のことです。\n\n現在、コメントは2倍になっており、...",
      "title": "ガバナンスの提案 テキスト投稿のカルマを25％増やす"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个建议是为了提高文字帖子的业力倍数，有资格获得\n额外的25%，换句话说，就是在 \"月球 \"上发表的帖子。\n换句话说，在 \"文本 \"选项卡中创建的帖子，需要人们打出自己的原始\n帖的最低字数。\n\n目前评论是双倍的，而...",
      "title": "治理的建议。将文字帖子的因果关系提高25%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個建議是爲了提高文字帖子的業力倍數，有資格獲得\n額外的25%，換句話說，就是在 \"月球 \"上發表的帖子。\n換句話說，在 \"文本 \"選項卡中創建的帖子，需要人們打出自己的原始\n帖的最低字數。\n\n目前評論是雙倍的，而...",
      "title": "治理的建議。將文字帖子的因果關係提高25%。"
    }
  ]
}