{
  "author": "Ramses_IV",
  "original_created_utc": 1655904201,
  "title": "Hernan Cortes' conquest of Mexico relied heavily on alliances with native peoples, which he somewhat downplayed in his own accounts, did Julius Caesar's conquest of Gaul similarly depend on allied Gallic tribes doing much of the fighting?",
  "created_utc": 1655910195,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I only have a layman&amp;#39;s knowledge of both the Spanish conquest of the Americas and the Roman conquest of Gaul, but it is my understanding that in the former, most of the heavy lifting when it came to actually fighting the Aztec Empire was done by native Mesoamerican people who had allied with the Spanish, and the extent to which Cortes&amp;#39; conquests were only possibly with a large amount of native help was traditionally underestimated (and still is in popular perception), partly because Spanish accounts tried to marginalise it in order to exaggerate the impressiveness of their own military achievements. &lt;/p&gt;\n\n&lt;p&gt;Given that pretty much all our sources for the Gallic Wars are classical Roman writers, with Caesar himself chief among them, is it possible that the same was true for Gaul? It is well established that Caesar greatly exaggerated the sizes of the forces opposing him in his Commentaries, so he had no qualms with playing fast and loose with the truth to accentuate his own brilliance. Is it likely then that he omitted a lot of decisive action on the part of the Gauls in his retelling of the conquest?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/vi56ue/hernan_cortes_conquest_of_mexico_relied_heavily/",
  "subreddit": "AskHistorians",
  "id": "vi56ue",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I only have a layman's knowledge of both the Spanish conquest of the Americas\nand the Roman conquest of Gaul, but it is my understanding that in the former,\nmost of the heavy lifting when it came to actually fighting the Aztec Empire was\ndone by native Mesoamerican people who had allied with the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スペインのアメリカ大陸征服についても、素人程度の知識しかありません\nとローマ帝国のガリア征服の両方について素人の知識しかありませんが、私の理解では前者では\nアステカ帝国と実際に戦ったのは、同盟を結んだメソアメリカの先住民たちだった。\nアステカ帝国と同盟を結んでいたメソアメリカの先住民によって行われたと理解しています。",
      "title": "エルナン・コルテスのメキシコ征服は、先住民との同盟に大きく依存しており、コルテス自身の記録ではそれをやや軽視している。ユリウス・カエサルのガリア征服も同様に、ガリアの同盟部族に戦闘の多くを依存していたのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对西班牙对美洲的征服都只有外行的了解。\n和罗马对高卢的征服，但我的理解是，在前者中。\n在实际与阿兹特克帝国作战时，大部分繁重的工作都是由与阿兹特克帝国结盟的中美洲本地人完成的。\n是由与西班牙人结盟的中美洲本地人完成的。",
      "title": "埃尔南-科尔特斯对墨西哥的征服在很大程度上依赖于与当地人的联盟，他在自己的记述中有些淡化了这一点，朱利叶斯-凯撒对高卢的征服是否也同样依赖于高卢部落的联盟来完成大部分的战斗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對西班牙對美洲的征服都只有外行的瞭解。\n和羅馬對高盧的征服，但我的理解是，在前者中。\n在實際與阿茲特克帝國作戰時，大部分繁重的工作都是由與阿茲特克帝國結盟的中美洲本地人完成的。\n是由與西班牙人結盟的中美洲本地人完成的。",
      "title": "埃爾南-科爾特斯對墨西哥的征服在很大程度上依賴於與當地人的聯盟，他在自己的記述中有些淡化了這一點，朱利葉斯-凱撒對高盧的征服是否也同樣依賴於高盧部落的聯盟來完成大部分的戰鬥？"
    }
  ]
}