{
  "author": "AlucardSX",
  "original_created_utc": 1658883778,
  "title": "Is there any historical basis for the colloquial title/nickname Onion Knight?",
  "created_utc": 1658914494,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Obviously the most famous Onion Knight in popular culture today, especially in the west, is Ser Davos Seaworth from George R.R. Martin&amp;#39;s fantasy series A Song of Ice and Fire, as well as its HBO adaption. That character, at least within the context of the story, got his name after being knighted for smuggling a boatload of onions into a castle under siege.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s interesting though is that this isn&amp;#39;t the first time the term onion knight showed up in pop culture. Eight years before Ser Davos first appeared in 1998&amp;#39;s A Clash of Kings, there was a job class called Onion Knight (&amp;quot;Tamanegi Kenshi&amp;quot; in Japanese, more or less a literal translation as far as I can tell) in the SquareSoft JRPG Final Fantasy III. Other Japanese fantasy games have them as well, most notably Dark Souls, but those may well be direct nods to Final Fantasy&amp;#39;s use of the term. I can&amp;#39;t see any such connection to Martin&amp;#39;s work though. I doubt he had played the game when he created Ser Davos, especially since Final Fantasy III was only officially released in the west in 2006, and even the first fully playable fan translation post-dates ACoK.&lt;/p&gt;\n\n&lt;p&gt;Now Onion Knight is a pretty weird term, so I was wondering whether the developers at SquareSoft and George R.R. Martin really came up with it independently, or whether they could both be referencing an earlier use of the term.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/w90od0/is_there_any_historical_basis_for_the_colloquial/",
  "subreddit": "AskHistorians",
  "id": "w90od0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Obviously the most famous Onion Knight in popular culture today, especially in\nthe west, is Ser Davos Seaworth from George R.R. Martin's fantasy series A Song\nof Ice and Fire, as well as its HBO adaption. That character, at least within\nthe context of the story, got his name after being knighted…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日のポピュラーカルチャーにおいて、明らかに最も有名なオニオンナイトは、特に\n特に西洋では、ジョージ・R・R・マーティンのファンタジーシリーズ「氷と炎の歌」に登場するダヴォス・シーワース卿が有名である。\nジョージ・R・R・マーティンのファンタジーシリーズ「氷と炎の歌」とそのHBO版に出てくるダヴォス・シーワース卿である。あのキャラクターは、少なくとも物語の中では\nあのキャラクターは、少なくとも物語の文脈の中では、騎士の称号を与えられてからその名を得たのだが......。",
      "title": "オニオンナイトという口語的なタイトル・ニックネームには、歴史的な根拠があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，当今流行文化中最著名的洋葱头骑士，尤其是在\n在西方，最著名的洋葱头骑士是乔治-R-R-马丁（George R.R. Martin）的奇幻系列小说《冰与火之歌》（A Song of Ice and Fire）中的戴沃斯爵士（Ser Davos Seaworth）。\n冰与火之歌》，以及HBO的改编作品。这个人物，至少在\n至少在故事的背景下，他的名字是在被封为骑士之后得到的......",
      "title": "洋葱骑士这个俗称/绰号有什么历史依据吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，當今流行文化中最著名的洋蔥頭騎士，尤其是在\n在西方，最著名的洋蔥頭騎士是喬治-R-R-馬丁（George R.R. Martin）的奇幻系列小說《冰與火之歌》（A Song of Ice and Fire）中的戴沃斯爵士（Ser Davos Seaworth）。\n冰與火之歌》，以及HBO的改編作品。這個人物，至少在\n至少在故事的背景下，他的名字是在被封爲騎士之後得到的......",
      "title": "洋蔥騎士這個俗稱/綽號有什麼歷史依據嗎？"
    }
  ]
}