{
  "author": "Brave_is_Great",
  "original_created_utc": 1640604900,
  "title": "What's the most overpriced token?",
  "created_utc": 1640644354,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When you start dabbling into crypto (and markets, and the economy in general, probably), it&amp;#39;s not always easy to make sense of it all.&lt;/p&gt;\n\n&lt;p&gt;For example: why are some coins priced so highly?&lt;/p&gt;\n\n&lt;p&gt;I know I can sound naive, but...&lt;/p&gt;\n\n&lt;p&gt;...let&amp;#39;s put it this way: Bitcoin has been the first player, Ethereum has tech and ambition, privacy coins are big on, well, privacy, other tokens are tied to useful products or services such as browsers, exchanges, others still want to be more eco-friendly, and so on.&lt;/p&gt;\n\n&lt;p&gt;In short, many coins do have a unique selling point of some sort, some added value which in their creators&amp;#39; mind can make the crypto environment a bit better.&lt;/p&gt;\n\n&lt;p&gt;But why isn&amp;#39;t it always the case? What&amp;#39;s the deal about the so-called meme-coins, or those tokens which don&amp;#39;t seem to have any interesting peculiarity in general?&lt;/p&gt;\n\n&lt;p&gt;I know that fads are a thing, and that if enough people buy (literally) into it, a coin value gets to sustain itself... but why should investors risk money on something useless?&lt;/p&gt;\n\n&lt;p&gt;Am I crazy?&lt;/p&gt;\n\n&lt;p&gt;Am I right?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Is there one coin whose value you can&amp;#39;t make sense of? And if it is, which one?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;EDIT: as some of you has highlighted, &amp;quot;token&amp;quot; and &amp;quot;coin&amp;quot; aren&amp;#39;t exactly synonymous; just rest assured I meant both of them, I wanted the discussion to be as inclusive as possible.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/rplnax/whats_the_most_overpriced_token/",
  "subreddit": "CryptoCurrency",
  "id": "rplnax",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When you start dabbling into crypto (and markets, and the economy in general,\nprobably), it's not always easy to make sense of it all.\n\nFor example: why are some coins priced so highly?\n\nI know I can sound naive, but...\n\n...let's put it this way: Bitcoin has been the first player, Ethereum has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に手を出し始めると、（市場や経済全般も。\nおそらく）、すべてを理解するのは簡単なことではありません。\n\n例えば、なぜあるコインが高い値段で取引されているのか？\n\n素朴に聞こえるかもしれませんが...。\n\n...このように言ってみましょう。ビットコインは最初のプレーヤーであり、イーサリアムは...",
      "title": "最も高値で取引されるトークンは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你开始涉足加密货币（和市场，以及一般的经济。\n可能），要理解这一切并不总是容易的。\n\n例如：为什么有些币的价格这么高？\n\n我知道我可能听起来很天真，但是...\n\n...让我们这样说吧。比特币一直是第一个参与者，以太坊已经...",
      "title": "什么是价格最贵的代币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你開始涉足加密貨幣（和市場，以及一般的經濟。\n可能），要理解這一切並不總是容易的。\n\n例如：爲什麼有些幣的價格這麼高？\n\n我知道我可能聽起來很天真，但是...\n\n...讓我們這樣說吧。比特幣一直是第一個參與者，以太坊已經...",
      "title": "什麼是價格最貴的代幣？"
    }
  ]
}