{
  "author": "ActuallyIAmIncorrect",
  "original_created_utc": 1640528844,
  "title": "The best time to plant a tree was 20 years ago. The second best time is now.",
  "created_utc": 1640537048,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve seen a lot of posts recently asking which coins to invest in and whether this is a good or bad time to buy. There’s also a ton of pseudo-technical posts explaining how every little dip means the next big bear winter is coming and how each tiny pump means the parabolic moonshot is finally here. &lt;/p&gt;\n\n&lt;p&gt;The reality is nobody knows what will happen next, and your guess is probably about as good as most other people’s. The other reality is that most of us missed getting in early enough to become a millionaire on small investments. That doesn’t mean that you can’t still make money and be involved with interesting projects with room to grow.&lt;/p&gt;\n\n&lt;p&gt;If you believe that crypto has a place in the future, then buy projects that make sense to you, turn off your phone, and go outside or do something fun. If you really think ETH will hit $10k eventually, then buying it at any price under that is a great investment in the long term.&lt;/p&gt;\n\n&lt;p&gt;The one thing most folks who have profited off crypto have in common is that they were patient when others weren’t and they bought things that, through some combination of luck and foresight, were built to last. &lt;/p&gt;\n\n&lt;p&gt;You didn’t plant trees when crypto was first on the scene, but if you think the future is a forest, you can still plant now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 230,
  "permalink": "/r/CryptoCurrency/comments/roxxyk/the_best_time_to_plant_a_tree_was_20_years_ago/",
  "subreddit": "CryptoCurrency",
  "id": "roxxyk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve seen a lot of posts recently asking which coins to invest in and whether\nthis is a good or bad time to buy. There’s also a ton of pseudo-technical posts\nexplaining how every little dip means the next big bear winter is coming and how\neach tiny pump means the parabolic moonshot is finally…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、どのコインに投資したらいいか、といった投稿をよく見かけます。\n今が買い時なのか、買い時ではないのか。また、似非テクニカルな記事もたくさんあります。\n小さな落ち込みは次の大きな熊の冬が来ることを意味し、どのように\n小さなパンプは、パラボリックムーンショットがついに...という意味です。",
      "title": "木を植えるのに最適な時期は、20年前。2番目に良いのは今です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近看到很多帖子，问该投资哪些硬币，以及现在是买入的好时机还是坏时机。\n现在是购买的好时机还是坏时机。也有大量的伪技术性帖子\n解释每一次小的下跌都意味着下一个大熊市的冬天即将到来，以及每一次小的回升都意味着抛物线式的下跌。\n每一次微小的回升都意味着抛物线式的月球运动终于开始了。",
      "title": "种树的最佳时机是20年前。第二个最佳时间是现在。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近看到很多帖子，問該投資哪些硬幣，以及現在是買入的好時機還是壞時機。\n現在是購買的好時機還是壞時機。也有大量的僞技術性帖子\n解釋每一次小的下跌都意味着下一個大熊市的冬天即將到來，以及每一次小的回升都意味着拋物線式的下跌。\n每一次微小的回升都意味着拋物線式的月球運動終於開始了。",
      "title": "種樹的最佳時機是20年前。第二個最佳時間是現在。"
    }
  ]
}