{
  "author": "_civilised_",
  "the_new_excerpt": "As a person from a developing country who couldn't afford buying these books (or\naren't available in the first place), this website has proven to be a gem in my\nself-education journey and I have no other option. However, on the other hand,\npiracy is piracy.\n\nSometimes, I plan on buying the read…",
  "original_created_utc": 1616567649,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个来自发展中国家的人，买不起这些书（或者说买不起这些书）。\n在一开始就没有），这个网站已经被证明是我的一个宝贝。\n自我教育之旅，我没有其他选择。然而，在另一方面。\n盗版就是盗版。\n\n有时候，我打算买读...",
      "title": "图书馆创世纪下载免费盗版pdf书籍有多道德？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個來自發展中國家的人，買不起這些書（或者說買不起這些書）。\n在一開始就沒有），這個網站已經被證明是我的一個寶貝。\n自我教育之旅，我沒有其他選擇。然而，在另一方面。\n盜版就是盜版。\n\n有時候，我打算買讀...",
      "title": "圖書館創世紀下載免費盜版pdf書籍有多道德？"
    }
  ],
  "title": "How moral is it to download free pirated pdf books from Library Genesis?",
  "created_utc": 1616628756,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a person from a developing country who couldn&#39;t afford buying these books (or aren&#39;t available in the first place), this website has proven to be a gem in my self-education journey and I have no other option. However, on the other hand, piracy is piracy.</p>\n\n<p>Sometimes, I plan on buying the read books in the future (the ones by living authors, not by someone like Descartes). Is this the right compensation? Will buying the read books really help the author. Doesn&#39;t it mostly go to the publisher?  </p>\n\n<p>Should that website be supported? On one hand, it steals an intellectual property, and on the other hand, it helps educate broke people like me.</p>\n\n<p>Please give some insights.</p>\n\n<p>Edit: Corrected some grammatical mistakes.</p>\n</div><!-- SC_ON -->",
  "score": 136,
  "permalink": "/r/askphilosophy/comments/mbz9qk/how_moral_is_it_to_download_free_pirated_pdf/",
  "subreddit": "askphilosophy",
  "id": "mbz9qk",
  "is_self": true,
  "media": null,
  "is_video": false
}