{
  "author": "Alextherude_Senpai",
  "original_created_utc": 1634419265,
  "title": "How do I get rid of this unwanted dog without killing it?",
  "created_utc": 1634434658,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been living with this nightmare for a year now. It was introduced into our home after I was a question without any context: &quot;Hey, do you like dogs?&quot; and my dumbass answered, &quot;Yeah, I guess.&quot;</p>\n\n<p>Next day, we have a Border Collie. I didn&#39;t want to raise, train, or care for the damn thing because I DIDN&#39;T AGREE TO THIS SHIT.</p>\n\n<p>It has infinite energy, tears up shit if given a millisecond of freedom, and has no fucking limits on HOW THE FUCK LONG IT CAN BARK.</p>\n\n<p>I&#39;ve considered just &quot;letting it accidentally run away&quot;, but it&#39;s chipped, and the pound will just call us up.</p>\n\n<p>I&#39;ve considered calling up animal control or rescues... whoever, and saying that &quot;I found a dog.&quot; But it&#39;s chipped.</p>\n\n<p>I&#39;ve tried harassing friends, family, and emailing god knows how many rescues, but I&#39;ve been ghosted by two already. The rest of the rescues are full because oh... I don&#39;t know, people are irresponsible fucks who adopt because their furry decorations look oh-so-cute without a lick of responsibility in their bones for anything that isn&#39;t human or otherwise.</p>\n\n<p>I&#39;m truly at my wit&#39;s end. The dog is extremely friendly, but training this shit is not a task I ever want to undertake because aint nobody got time, patience, or money for that in this house. I really don&#39;t want to have to euthanize this annoying fucker, even if I hate it to the very core. It didn&#39;t ask to be adopted on the whim of a fucking moronic family member into a house where nobody gives half a shit about it. It&#39;s just a dog. But whatever morality I have left in me is about to fucking snap after a year with this furry monster. Please, if anyone has a better solution other than euthanization, please give me some advice.  </p>\n\n<p>Edit: Thank you to everyone who answered. I didn&#39;t consider selling the dog because I thought it&#39;d be an even bigger pain in the ass to do so with paperwork or whatever. Guess that isn&#39;t the case. Thank you all for solving the source of 1 year&#39;s worth of stress.</p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/NoStupidQuestions/comments/q9kvv3/how_do_i_get_rid_of_this_unwanted_dog_without/",
  "subreddit": "NoStupidQuestions",
  "id": "q9kvv3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been living with this nightmare for a year now. It was introduced into\nour home after I was a question without any context: \"Hey, do you like dogs?\"\nand my dumbass answered, \"Yeah, I guess.\"\n\nNext day, we have a Border Collie. I didn't want to raise, train, or care for\nthe damn thing because…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この悪夢を見続けて1年が経ちました。それが我が家に持ち込まれたのは\n何の脈絡もなく質問されてから、我が家に持ち込まれました。\"ねえ、あなたは犬が好き？\"\nと聞かれ、私の間抜けが \"うん、そうだね \"と答えたことがきっかけです。\n\n次の日、ボーダーコリーを飼うことになりました。私は犬を育てたり、訓練したり、世話をしたりすることを望んでいませんでした。\nなぜなら...",
      "title": "この不要な犬を殺さずに処分するにはどうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经在这个噩梦中生活了一年了。它被引入到\n在我被问到一个没有任何背景的问题后，它被引入我们的家。\"嘿，你喜欢狗吗？\"\n而我的蠢货回答说：\"是的，我想是的。\"\n\n第二天，我们有一只边境牧羊犬。我不想养，不想训练，不想照顾\n这该死的东西，因为...",
      "title": "我如何摆脱这只不受欢迎的狗而不杀它？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經在這個噩夢中生活了一年了。它被引入到\n在我被問到一個沒有任何背景的問題後，它被引入我們的家。\"嘿，你喜歡狗嗎？\"\n而我的蠢貨回答說：\"是的，我想是的。\"\n\n第二天，我們有一隻邊境牧羊犬。我不想養，不想訓練，不想照顧\n這該死的東西，因爲...",
      "title": "我如何擺脫這只不受歡迎的狗而不殺它？"
    }
  ]
}