{
  "author": "darkvothe",
  "original_created_utc": 1624991989,
  "title": "I am pissed.",
  "created_utc": 1625041835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am pissed because I have a strong opinion on favor of Bitcoin. And... I&#39;m really not a person of strong opinions. I dislike having strong opinions. I had learned earlier in life that if you have a strong opinion on something, you are already losing. There must be something you did not understand yet.</p>\n\n<p>Yet, I am pissed, because I want to find good and convincing contrarian views on Bitcoin. I have the feeling that all of the economists writing against Bitcoin are weak and mostly doing it just out of the blue: none really give signs of understanding the protocol. Arguments such &quot;naturally formed ponzi&quot;, &quot;tulip mania v2.0&quot;, &quot;deflationary=bad&quot;, &quot;infinite value? = scam&quot; and other analogies tend to be incomplete and always lack data or evidence. It just does not make the cut for me that you are a Nobel Prize if your text does not show that you invested the minimum time to understand the protocol.</p>\n\n<p>Krugman, Roubini, the dude of <a href=\"/r/CryptoReality\">r/CryptoReality</a>, they only have partially sensible arguments that they oversell as pure truth. And I need to be convinced it is better to be in the middle ground, I want go to the next page in my life. Aren&#39;t there better thinkers? C&#39;mon there must be provable facts against Bitcoin&#39;s monetization, right? Does anyone have any excellent contrarian texts to share?  I need to become a regular human again and stop thinking 24/7 about this unstoppable force.</p>\n\n<p>I am really pissed.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/oaefo9/i_am_pissed/",
  "subreddit": "Bitcoin",
  "id": "oaefo9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am pissed because I have a strong opinion on favor of Bitcoin. And... I'm\nreally not a person of strong opinions. I dislike having strong opinions. I had\nlearned earlier in life that if you have a strong opinion on something, you are\nalready losing. There must be something you did not understand…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はビットコインを支持する強い意見を持っているので、腹を立てています。そして... 私は\n私は強い意見を持つ人間ではありません。強い意見を持つことが嫌いです。私は\n何かに強い意見を持っているということは、すでに負けているということだと人生の早い段階で学びました。\n負けているということを学んだ。何かわからないことがあったのでしょうか...。",
      "title": "怒られました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很生气，因为我对支持比特币有强烈的看法。而且... 我\n真的不是一个有强烈意见的人。我不喜欢有强烈的意见。我在生活的早期就知道\n我在生命的早期学到，如果你对某事有强烈的意见，你就已经\n就已经输了。一定有什么东西是你不明白的......",
      "title": "我很生气。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很生氣，因爲我對支持比特幣有強烈的看法。而且... 我\n真的不是一個有強烈意見的人。我不喜歡有強烈的意見。我在生活的早期就知道\n我在生命的早期學到，如果你對某事有強烈的意見，你就已經\n就已經輸了。一定有什麼東西是你不明白的......",
      "title": "我很生氣。"
    }
  ]
}