{
  "author": "Coelrom",
  "original_created_utc": 1630446456,
  "title": "Incentivize Voting in Multiple Polls",
  "created_utc": 1630485038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Summary</h1>\n\n<p>Voter turnout has definitely improved since the institution of Moon Week. However, there is still quite a disparity in number of votes across the polls. Despite there being enough votes cast in at least one popular poll, less popular good proposals with majority voter support don&#39;t pass, and bad proposals with majority rejection are not definitively voted down, leaving the door open for those proposals to return. In order to incentivize voting further, I suggest a 1.25% karma bonus per additional poll in which a vote is cast.</p>\n\n<h1>Problem Statement</h1>\n\n<p>In the last round, there was a high of 13258 votes, a low of 4934 votes, and an average of 8040 votes. In the round before that, there was a high of 9542 votes, a low of 4116 votes, and an average of 6524 votes (<a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p3s1il/moon_voting_data_from_round_14_to_round_16/\">Source</a>). It&#39;s undeniable, based on the numbers, that there is a significant disparity in voter turnout across the polls, despite overall voter turnout improving compared with the institution of Moon Week. It&#39;s almost a certainty that many are only voting in one or two polls, while ignoring the others. This results in those other polls suffering the same low voter turnouts that were so frustrating in the past. The possible negative consequences of low voter turnout on a poll are 1) good proposals don&#39;t pass despite majority voter support, 2) bad proposals are not definitively rejected despite majority voter denial, which leaves the door open for them to be reintroduced, and 3) whales have significantly greater influence in such a poll.</p>\n\n<h1>Solution</h1>\n\n<p>My proposed solution is to institute a 1.25% karma bonus per additional poll in which a vote is cast.  This means that the first time that someone votes, they will earn the base voting bonus (currently 5%), and all subsequent times that person votes during Moon Week will earn an additional 1.25%. So if someone votes in 2 polls, they will get a 6.25% bonus.  If they vote in 3 polls, they will get a 7.5% bonus.</p>\n\n<h1>Concerns</h1>\n\n<p>A concern that was brought up is that this may pressure indifferent voters that would rather opt to abstain. In my opinion, the 1.25% additional bonus is small enough to not significantly impact those who truly wish to abstain from a particular poll so the pressure would be minimal, while also being a nice incentive to get more potential voters to pay attention to more of the polls. For this concern, I think the impact would more positive than negative.</p>\n\n<p>Another concern that was put forth is that some may just vote blindly/randomly just to secure the extra bonus. In my opinion, it is more than likely that such voting already occurs but is currently isolated to one or two polls, and while implementing this proposal would not really improve blind/random voting, it would also not significantly make the issue worse. For this concern, I think the impact would be neutral to slightly negative.</p>\n\n<p>&#x200B;</p>\n\n<p>To see the evolution of this proposal in <a href=\"/r/CryptoCurrencyMeta\">r/CryptoCurrencyMeta</a>, follow this link: <a href=\"https://np.reddit.com/r/CryptoCurrencyMeta/comments/pc027s/proposal_incentivize_voting_in_multiple_polls/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Proposal: Incentivize Voting in Multiple Polls (Final Version)</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>TLDR: Vote more, earn more.</strong></p>\n\n<p><a href=\"https://www.reddit.com/poll/pffoe7\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/pffoe7/incentivize_voting_in_multiple_polls/",
  "subreddit": "CryptoCurrency",
  "id": "pffoe7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "SUMMARY\n\nVoter turnout has definitely improved since the institution of Moon Week.\nHowever, there is still quite a disparity in number of votes across the polls.\nDespite there being enough votes cast in at least one popular poll, less popular\ngood proposals with majority voter support don't pass,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "概要\n\nムーンウィークが制定されて以来、投票率は確実に向上している。\nしかし、各投票所での得票数にはまだかなりの格差がある。\n少なくとも1つの人気投票では十分な投票数があるにもかかわらず、あまり人気のない投票では投票数が少ない。\n多数の有権者の支持を得た良案が通らない、、、。",
      "title": "複数投票への動機づけ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "摘要\n\n自从设立月球周以来，选民投票率肯定有所提高。\n然而，各投票站的票数仍有相当大的差距。\n尽管至少有一个热门投票有足够的票数，但不太受欢迎的\n有多数选民支持的好提案却没有通过，...",
      "title": "鼓励在多个投票站投票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摘要\n\n自從設立月球周以來，選民投票率肯定有所提高。\n然而，各投票站的票數仍有相當大的差距。\n儘管至少有一個熱門投票有足夠的票數，但不太受歡迎的\n有多數選民支持的好提案卻沒有通過，...",
      "title": "鼓勵在多個投票站投票"
    }
  ]
}