{
  "author": "AnOddEgg",
  "original_created_utc": 1651839349,
  "title": "Are lobsters' lives limited only by their ability to moult, and could they theoretically reach any size or age?",
  "created_utc": 1651898638,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, what I&amp;#39;ve heard is that lobsters keep growing throughout their life, getting bigger with each moult. I&amp;#39;ve also heard that the reason lobsters will die at a certain age is not because of internal processes, but because they are unable to effectively moult and die as a result.&lt;/p&gt;\n\n&lt;p&gt;Firstly, is this correct? And if this is correct, is it therefore theoretically possible that a lobster could be aided in moulting, and we could just pass this lobster through generations as it just gets bigger and bigger? I severely doubt this is the case, but without having contrary information on lobster biology, I&amp;#39;m just going to have this at the back of my mind&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/askscience/comments/ujm4z3/are_lobsters_lives_limited_only_by_their_ability/",
  "subreddit": "askscience",
  "id": "ujm4z3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, what I've heard is that lobsters keep growing throughout their life, getting\nbigger with each moult. I've also heard that the reason lobsters will die at a\ncertain age is not because of internal processes, but because they are unable to\neffectively moult and die as a result.\n\nFirstly, is this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、ロブスターは一生成長し続けるということですね。\n脱皮するたびに大きくなる。また、ロブスターがある年齢で死んでしまうのは、イオンのせいではないそうです。\nある年齢で死んでしまうのは、体内プロセスではなく、脱皮がうまくできずに死んでしまうからだそうです。\n脱皮がうまくいかず、死んでしまうのだそうです。\n\nまず、これは...。",
      "title": "ロブスターの寿命は脱皮能力によってのみ制限され、理論的にはどんなサイズや年齢にもなりうるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我所听说的是，龙虾在其一生中不断成长，变得\n每次蜕皮都会变大。我还听说，龙虾之所以会在某个年龄段死亡\n不是因为内部过程，而是因为它们不能有效地蜕皮，因此而死亡。\n有效地蜕皮并因此而死亡。\n\n首先，这是否...",
      "title": "龙虾的生命是否仅受其蜕皮能力的限制，理论上它们可以达到任何大小或年龄？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我所聽說的是，龍蝦在其一生中不斷成長，變得\n每次蛻皮都會變大。我還聽說，龍蝦之所以會在某個年齡段死亡\n不是因爲內部過程，而是因爲它們不能有效地蛻皮，因此而死亡。\n有效地蛻皮並因此而死亡。\n\n首先，這是否...",
      "title": "龍蝦的生命是否僅受其蛻皮能力的限制，理論上它們可以達到任何大小或年齡？"
    }
  ]
}