{
  "author": "tayezz",
  "original_created_utc": 1635973478,
  "title": "Are we saying that we've outsmarted the institutions?",
  "created_utc": 1636032859,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of talk about being &quot;early&quot; and references to massive institutions (banks, tech companies, retail giants, etc) that are reluctant or adverse to getting into BTC, and it really confuses me. </p>\n\n<p>These institutions are operated by some of the most consistently successful, experienced, educated, resourceful, and resource rich people who have ever lived. They are advised by boards who have access to valuable sensitive information that some of us can only dream of. Critically, they have access to many of us who work in those capacities as advisors, engineers, programmers, analysts, etc. </p>\n\n<p>I find it incredibly difficult to believe that I&#39;ve managed to identify a once in a generation opportunity to secure myself financially and make a lasting impact on the world, but Apple, Amazon, Alphabet, and Chase haven&#39;t. Or alternately, they&#39;ve identified the opportunity but are so adverse to the subsequent order consequences that they actively attempt to bury the opportunity, even though it&#39;s supposedly inevitable. </p>\n\n<p>Help me understand how any of this makes sense please, because at this point I&#39;m just up to my eyeballs in my own hubris.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/qm485f/are_we_saying_that_weve_outsmarted_the/",
  "subreddit": "Bitcoin",
  "id": "qm485f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see a lot of talk about being \"early\" and references to massive institutions\n(banks, tech companies, retail giants, etc) that are reluctant or adverse to\ngetting into BTC, and it really confuses me.\n\nThese institutions are operated by some of the most consistently successful,\nexperienced,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、\"早期 \"という言葉をよく耳にします。\n(BTCへの参入に消極的な、あるいは反対している巨大な機関（銀行、ハイテク企業、小売大手など）の話をよく目にします。\nBTCへの参入に消極的な巨大な機関（銀行、ハイテク企業、小売大手など）の話をよく目にします。\n\nこれらの機関は、最も安定した成功を収めている人たちによって運営されています。\n経験豊富な...",
      "title": "組織を出し抜いたということでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多关于 \"早期 \"的讨论，以及对大规模机构的提及。\n(银行、科技公司、零售业巨头等）不愿意或不利于进入BTC。\n进入BTC，这真的让我感到困惑。\n\n这些机构是由一些最持续成功的人经营的。\n有经验的，...",
      "title": "我们是说我们已经超越了机构吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多關於 \"早期 \"的討論，以及對大規模機構的提及。\n(銀行、科技公司、零售業巨頭等）不願意或不利於進入BTC。\n進入BTC，這真的讓我感到困惑。\n\n這些機構是由一些最持續成功的人經營的。\n有經驗的，...",
      "title": "我們是說我們已經超越了機構嗎？"
    }
  ]
}