{
  "author": "RookieRamen",
  "original_created_utc": 1639534803,
  "title": "Stop getting milked like cows.",
  "created_utc": 1639583557,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There are some aspects of crypto I think are absolutely necessary and can&amp;#39;t wait to be using them in a mainstream way. And yes I am also talking about metaverses. But not the kind of crap I see pushed here everyday. The real projects we want and need are probably just being thought of today and will take several more years to be developed. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;During a gold rush, sell shovels&amp;quot;. So my best advice to you is to not buy every single shovel that is being sold here. Hoping it will help you find gold. It&amp;#39;s not. You&amp;#39;re being milked like a cow. When Axie Infinity took off dozens of low effort crypto games were mass produced trying to play in on the hype, trying to be the next big crypto game. Same with buying &amp;quot;land&amp;quot;. It was suddenly everywhere. &lt;/p&gt;\n\n&lt;p&gt;And you see this in all ways possible. First: the next Bitcoin or &amp;#39;Bitcoin killer&amp;#39; same with all the &amp;#39;Eth killers&amp;#39;.\nEvery single day I&amp;#39;m on here I see 15 new DEX AMM orderbook DAO&amp;#39;S that&amp;#39;ll be the last DeFi platform you&amp;#39;ll ever need. STOP. They don&amp;#39;t add anything. They are only trying to sell you their &amp;quot;magic gold finding shovel&amp;quot;.\nWe don&amp;#39;t need 1200 yield farms, 1500 lending/borrow services and especially not the millions of wallets. I use exactly two wallets. One for cold storage and one for my day to day use. Sure it can be different for staking but this has been sufficient for all of my DeFi needs. &lt;/p&gt;\n\n&lt;p&gt;Be weary in this place. Silver tongues making you believe you&amp;#39;re the first to hear of this amazing new project that&amp;#39;s absolutely going to blow up are everywhere. I see people hyping their shills but upon closer inspection it&amp;#39;s made up of empty promises, vague descriptions of changing the entire industry and for that whole the world. But they don&amp;#39;t add any value to the space and don&amp;#39;t bring anything new to the table. &lt;/p&gt;\n\n&lt;p&gt;There are projects out there I absolutely love and see a bright future for them. There are ideas I can&amp;#39;t wait to see developed one day. But if we want this to succeed we need to stop being milked every step of the way.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/rgnxow/stop_getting_milked_like_cows/",
  "subreddit": "CryptoCurrency",
  "id": "rgnxow",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are some aspects of crypto I think are absolutely necessary and can't wait\nto be using them in a mainstream way. And yes I am also talking about\nmetaverses. But not the kind of crap I see pushed here everyday. The real\nprojects we want and need are probably just being thought of today and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は絶対に必要なものだと思うし、待ちきれない面もある。\nメインストリームで使用するために そして、そう、私は次のようなことも話しています。\nメタバーズ しかし、私がここで毎日見ているようなたわごとではありません。本当の\n私たちが欲しい、必要としているプロジェクトは、おそらく今日も考えられているところでしょうし......。",
      "title": "牛のように乳を搾られるのはやめよう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为加密货币的某些方面是绝对必要的，并且迫不及待地想以主流方式使用它们。\n以主流方式使用它们。是的，我也在谈论\nmetaverses。但不是我每天在这里看到的那种废话。真正的\n我们想要和需要的项目可能只是在今天被想到了，而且...",
      "title": "不要再像牛一样被挤奶了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲加密貨幣的某些方面是絕對必要的，並且迫不及待地想以主流方式使用它們。\n以主流方式使用它們。是的，我也在談論\nmetaverses。但不是我每天在這裏看到的那種廢話。真正的\n我們想要和需要的項目可能只是在今天被想到了，而且...",
      "title": "不要再像牛一樣被擠奶了。"
    }
  ]
}