{
  "author": "Fantastic-Cucumber-1",
  "the_new_excerpt": "You might have come across the term “wrapped Bitcoin” in the DeFi space. How is\nit possible that (wrapped) Bitcoin is available on Ethereum, even though Bitcoin\nis on another block chain? And why would you use wrapped Bitcoins in the first\nplace? In this post I’ll try to answer these…",
  "original_created_utc": 1617184335,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在DeFi领域，你可能会遇到 \"被包裹的比特币 \"这个词。如何是\n有可能在Ethereum上可以使用（包装的）比特币，即使比特币\n是在另一个区块链上？那你为什么要在第一条区块链上使用包裹的比特币呢？\n的地方？在这篇文章中，我将尝试回答这些...",
      "title": "德菲解释道。包装好的比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在DeFi領域，你可能會遇到 \"被包裹的比特幣 \"這個詞。如何是\n有可能在Ethereum上可以使用（包裝的）比特幣，即使比特幣\n是在另一個區塊鏈上？那你爲什麼要在第一條區塊鏈上使用包裹的比特幣呢？\n的地方？在這篇文章中，我將嘗試回答這些...",
      "title": "德菲解釋道。包裝好的比特幣"
    }
  ],
  "title": "DeFi explained: Wrapped Bitcoin",
  "created_utc": 1617215430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You might have come across the term “wrapped Bitcoin” in the DeFi space. How is it possible that (wrapped) Bitcoin is available on Ethereum, even though Bitcoin is on another block chain? And why would you use wrapped Bitcoins in the first place? In this post I’ll try to answer these questions.</p>\n\n<h2>Wrapped bitcoin explained</h2>\n\n<p>Wrapped Bitcoin (WBTC) is an ERC-20 token, linked to bitcoin 1:1, launched on the Ethereum network on January 30th, 2019. As a result, bitcoin can be used in the largely Ethereum-powered DeFi market.</p>\n\n<h2>How wrapped Bitcoin works</h2>\n\n<p>There are three main players in the process of obtaining WBTC: the user, the merchant, and the custodian.</p>\n\n<p>To exchange Bitcoin for Wrapped Bitcoin, a user submits a request to a WBTC merchant. Traders distribute WBTC in exchange for bitcoin - or vice versa. They have also included a KYC step in the process. The traders act as an intermediary between the user and the custodians, who form the network&#39;s liquidity pool.</p>\n\n<p>When the trader submits the transaction request to the custodian, the custodian chooses to allow or deny the request for WBTC. The minting and burning is done through an exchange, directly between the merchant and the custodian.</p>\n\n<p>The process starts when a merchant submits a coin request through an Ethereum smart contract while sending Bitcoin to the custodian. At that point, the custodian waits for confirmation on the Bitcoin block chain, approves the request on the Ethereum network, and releases the WBTC to the merchant.</p>\n\n<p>In order for the user to get their tokens, they must enter into a trusted exchange with the merchant. Once the user has his WBTC, his Bitcoin is essentially &quot;wrapped&quot; in an Ethereum wrapper. Hence the name &quot;Wrapped Bitcoin.&quot;</p>\n\n<h2>How wrapped Bitcoin benefits the DeFi space</h2>\n\n<p>Liquidity is the foundation of all finance. Lenders have no value without money to borrow. In addition, limited liquidity could kill a fast-growing financial movement. If investors rushed to DeFi and encountered one platform after another that didn&#39;t have enough liquidity, DeFi would quickly be slapped with crippling labels like &#39;unsustainable&#39; and others by DeFi doubters.</p>\n\n<p>Since the Bitcoin and Ethereum blockchain don&#39;t go well together, and DeFi is largely powered by Ethereum, there has been a thick brick wall between DeFi and Bitcoin investors. Wrapped Bitcoin is a sledgehammer trying to tear down that wall. If investors keep accumulating via this way, a flood of liquidity can flush into the DeFi space.</p>\n\n<h2>How to add WBTC to your portfolio</h2>\n\n<p>Investors can go through the &quot;wrapping&quot; process with a trader, or they can buy WBTC on one of the several DeFi exchanges such as Uniswap. WBTC follows the price of BTC. Once obtained, you can use it to invest in DeFi protocols.</p>\n\n<h2>WBTC Wrapping Fees</h2>\n\n<p>As with most financial services, wrapping BTC comes at a cost. These are the fees you must pay to the following entities:</p>\n\n<ul>\n<li>Custody fee. These are collected by the custodian when the trader chooses to mint or burn wrapped tokens.</li>\n<li>Merchant Fees. The merchant takes a fee from the user as payment to help him convert his BTC into WBTC.</li>\n<li>Sidechain transaction fees. To help prevent spam on the sidechain, there is a fee shared by all entities using a sidechain node.</li>\n</ul>\n\n<h2>Other types of BTC</h2>\n\n<p>Although WBTC might publicly be the most known of BTC tokens, there are a few other ones which I would like to elaborate on:</p>\n\n<ul>\n<li>renBTC: REN works via a smart contract on Ethereum and a HTLC transaction on Bitcoin. When engaging with this smart contract, a balance blocking operation in BTC and the minting of RenBTC on Ethereum is carried out, and all in a decentralized way, without intermediaries.</li>\n<li>tBTC: A user can obtain tBTC by depositing BTC into a wallet through the tBTC Dapp within the Bitcoin blockchain. The custody method performed by a decentralized pool of custodians who each have to supply a collateral in Ether.</li>\n<li>sBTC: Created by Synthetix, It provides access to the value of Bitcoin without the friction of owning a Bitcoin wallet or holding it. This allows Ethereum users to gain non-custodial exposure to Bitcoin, which means they don’t need to trust an institution or protocol to hold the underlying asset. This also enables it to be used within the Ethereum ecosystem, for such purposes as trading or any one of the many others available on the blockchain.</li>\n</ul>\n\n<h2>Final words</h2>\n\n<p>Wrapped Bitcoin, as well as the other variants, may be just what DeFi needs. Since it is linked to BTC and users can obtain it through a fairly simple process, it can rise. As bitcoin players, big or small, increasingly move to WBTC, renBTC, tBTC and sBTC, the liquidity boost can help DeFi soar to new heights.</p>\n\n<p>For investors, this offers a new way to earn interest on bitcoin holdings by depositing the token in yield farming DeFi protocols.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Do you know what Oracles are? Find out in my <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mgak48/defi_explained_oracles/\">previous post</a>.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 209,
  "permalink": "/r/CryptoCurrency/comments/mh2oc7/defi_explained_wrapped_bitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "mh2oc7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138674
}