{
  "author": "Many_Scratch2269",
  "original_created_utc": 1634076769,
  "title": "This scam coin is being advertised all over Reddit by multiple users. Please DO NOT buy this coin.",
  "created_utc": 1634096295,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s a coin launched in September just a month ago called &quot;Evergrow&quot; coin. This coin is currently the 8th most viewed on Coinmarketcap (probably due to spam by its makers). The coin already has a market cap of $230 million. </p>\n\n<p>If you go to their website, the entire coin &quot;team&quot; is just made up of Indian scammers and possibly a few hacked accounts. Also, <a href=\"https://twitter.com/safearnBSC/status/1447634182784487429\">these scammers cant even bother to write their own code</a>. I tried to trace all these people and absolutely none of them have any real social media from their LinkedIn pages. </p>\n\n<p>Their lead developer &quot;Ajit Singh&quot; does not exist. His liked Twitter profile doesn&#39;t exist.</p>\n\n<p>Their marketing manager &quot;Praveen Rai&quot; doesn&#39;t have any socials, and his LinkedIn experience shows a company that leads me to an open field in Tennessee.</p>\n\n<p>Their chairman of the board &quot;Sam Kelly&quot; is most likely a hacked LinkedIn account. All his information is stolen from <a href=\"https://www.theolivepress.es/spain-news/author/s-kellychorusfinancial-es/\">this website</a> where he clearly is shown as an author without any Crypto experience.</p>\n\n<p>Their subreddit is also managed by one moderator who spams posts every few minutes and deletes everything negative.</p>\n\n<p>You can already see where this is going. $230 Million is a huge amount of money that is being scammed from the people. It&#39;s unfortunate that people don&#39;t bother doing their share of research before buying coins like these. This is a massive scam that&#39;s being pushed everywhere. Please DO NOT invest in this coin, 8th viewed in CMC is not a small deal. Many people are going to lose their hard-earned money to these scammers.</p>\n\n<p>Edit: Evergrow shillers can gtfo with their AMAs. Not only does that guy look barely similar to Sam, why is he lying about his qualifications? And most importantly, their entire code is fucking copied from another project. Most of the socials the people working on this are fake, even companies where they previously claimed to have worked don&#39;t exist </p>\n\n<p>A bunch of faces on zoom without any identity won&#39;t change anything. Evergrow is a copycat scam project.</p>\n</div><!-- SC_ON -->",
  "score": 216,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/vW-MUaTGyfDru0zaJv1T4sVf0H2iqAnvYYhOxAPHsuA.jpg?auto=webp&s=f603e2661a549f7e6bf4cef5054dd2cb4bc050de",
          "width": 140,
          "height": 64
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/vW-MUaTGyfDru0zaJv1T4sVf0H2iqAnvYYhOxAPHsuA.jpg?width=108&crop=smart&auto=webp&s=cbf0fdccc17639a913021240e2af12ad6c5ad9f2",
            "width": 108,
            "height": 49
          }
        ],
        "variants": {},
        "id": "78l5ttJbxbL6FhT_jfNJ_84rRWCduxBBNif-oskST1c"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/q6x058/this_scam_coin_is_being_advertised_all_over/",
  "subreddit": "CryptoCurrency",
  "id": "q6x058",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There's a coin launched in September just a month ago called \"Evergrow\" coin.\nThis coin is currently the 8th most viewed on Coinmarketcap (probably due to\nspam by its makers). The coin already has a market cap of $230 million.\n\nIf you go to their website, the entire coin \"team\" is just made up of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど1ヶ月前の9月に発売された「Evergrow」というコインがあります。\nこのコインはCoinmarketcapで現在8番目に閲覧されています。\nメーカーのスパムによるものでしょう）。) このコインは、すでに2億3000万ドルのマーケットキャップを持っています。\n\nこのコインのウェブサイトを見ると、コインの「チーム」はすべて、ただ...で構成されています。",
      "title": "この詐欺コインは、複数のユーザーによってRedditの至る所で宣伝されています。このコインは絶対に買わないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一个在9月刚推出的币叫 \"Evergrow \"币。\n这个币目前在Coinmarketcap上的浏览量排名第八（可能是由于\n可能是由于其制造者的垃圾邮件）。) 该币的市值已经达到了2.3亿美元。\n\n如果你去看他们的网站，整个币的 \"团队 \"只是由...",
      "title": "多个用户在Reddit上到处宣传这种诈骗币。请不要购买这种硬币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一個在9月剛推出的幣叫 \"Evergrow \"幣。\n這個幣目前在Coinmarketcap上的瀏覽量排名第八（可能是由於\n可能是由於其製造者的垃圾郵件）。) 該幣的市值已經達到了2.3億美元。\n\n如果你去看他們的網站，整個幣的 \"團隊 \"只是由...",
      "title": "多個用戶在Reddit上到處宣傳這種詐騙幣。請不要購買這種硬幣。"
    }
  ]
}