{
  "author": "ChocolateTsar",
  "the_new_excerpt": "I was surprised this wasn't posted as it seems pretty newsworthy, so a couple\ndays late is better than never I guess.\n\n> SHANGHAI (Reuters) - PayPal Holding Inc has become the first foreign operator\n> with 100% control of a payment platform in China, according to Chinese\n> government data, as the…",
  "original_created_utc": 1610768363,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我很惊讶这个没有发布，因为它似乎很有新闻价值，所以几个\n我想，晚几天总比不晚好。\n\n> 上海（路透社）--PayPal Holding Inc已成为第一家外国运营商。\n>拥有中国支付平台100%的控制权，据中国的。\n>政府数据，作为...",
      "title": "PayPal成为中国首家拥有支付业务全部所有权的外资企业"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很驚訝這個沒有發佈，因爲它似乎很有新聞價值，所以幾個\n我想，晚幾天總比不晚好。\n\n> 上海（路透社）--PayPal Holding Inc已成爲第一家外國運營商。\n>擁有中國支付平臺100%的控制權，據中國的。\n>政府數據，作爲...",
      "title": "PayPal成爲中國首家擁有支付業務全部所有權的外資企業"
    }
  ],
  "title": "PayPal becomes first foreign firm in China with full ownership of payments business",
  "created_utc": 1610791693,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was surprised this wasn&#39;t posted as it seems pretty newsworthy, so a couple days late is better than never I guess.</p>\n\n<blockquote>\n<p>SHANGHAI (Reuters) - <strong>PayPal Holding Inc has become the first foreign operator with 100% control of a payment platform in China, according to Chinese government data, as the U.S. fintech giant eyes a bigger foothold in a booming market for online payments.</strong>  </p>\n\n<p><a href=\"https://www.google.com/finance/quote/PYPL:NASDAQ\"><strong>PayPal</strong></a> <strong>acquired the 30% stake it doesn’t already own in China’s GoPay, formally known as Guofubao Information Technology Co., on Dec. 31, 2020</strong>, according to shareholder data from the National Enterprise Credit Information Publicity System.  </p>\n\n<p><strong>Financial details weren’t disclosed in the data. The stake purchase came a year after PayPal bought a 70% stake in GoPay for an undisclosed amount，then becoming the first foreign company licensed to provide online payment services in China.</strong>  </p>\n\n<p>PayPal declined to comment.  </p>\n\n<p><strong>In taking full control of one of the smaller players in the world’s largest payment market, PayPal will compete with domestic payments giants Alipay, owned by Alibaba-affiliated Ant Group, and WeChat Pay, owned by Tencent Holdings Ltd, as China fully opens up its financial sector.</strong>  </p>\n\n<p>The stake purchase also comes amid Beijing’s antimonopoly campaign against Alibaba Group Holding Ltd and other Internet companies.  </p>\n\n<p>Last August, PayPal appointed Hannah Qiu as head of China business, responsible for formulating long-term strategy in the world’s second-biggest economy. Qiu was a former executive at insurer Ping An Group’s fintech unit OneConnect, according to PayPal’s website.</p>\n</blockquote>\n\n<p><a href=\"https://www.reuters.com/article/china-paypal-stake/paypal-becomes-first-foreign-firm-in-china-with-full-ownership-of-payments-business-idUSL4N2JP14M\">Reuters</a></p>\n</div><!-- SC_ON -->",
  "score": 803,
  "permalink": "/r/investing/comments/kyb53b/paypal_becomes_first_foreign_firm_in_china_with/",
  "subreddit": "investing",
  "id": "kyb53b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311216188
}