{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "I've seen a lot of speculation on whether it's worth buying the dip on FB.  Maybe it will bounce this week or next, but nobody, under any circumstances, should be long on FB.\n\nI work in tech, and my best estimation is that the Metaverse announcement was literally *because* FB could see the writing on the wall internally, and knew they were going to miss on earnings, so they had to create *some* narrative which would justify holding FB.\n\nSocial networks have a couple important properties:\n\n1. They're generational - people tend to use the network which their age cohort is using.  The younger generation flocks to a new network during high-school age to avoid their parents, and then gradually the older generation starts to pile in.\n\n2. They rely on network effects.  There's always going to be at most a couple \"winners\" and everyone will move to those because a social network is worthless once people feel like that's not where the activity is.\n\nFB managed to stave off disaster and hold on to millennials buy buying Instagram, while keeping facebook.com as a high-profit environment where they could just bombard vulnerable old people and conspiracy theorists with high margin advertising (kind of like cable news).  But they have failed to capture the younger generation who've moved to TikTok.  And since there is only room for one mainstream social network for every generation, that leaves them with no real avenue for growth.\n\nSo the metaverse is a totally impractical hail-marry.  Basically what FB wants to convince you of is that they will be able to construct a compelling virtual reality and productize it faster than TikTok can eat their lunch.\n\nThis is an extreme challenge for a number of reasons.  The main one being: what they're describing is *incredibly* capital intensive.  The amount of compute required to create a persistent interactive virtual reality for the entire world to play in is *orders of magnitude* higher than what's required to host images, videos and comments as they do now.  Who's going to pay for that?  Are advertisers going to pay 100x higher ad-rates to put up a billboard in a totally un-tested platform when they can just buy ads on TikTok instead?\n\nMaybe we'll get a metaverse someday, but at best it's decades away, and it's going to happen bottom-up from the expansion of MMO's and platforms like Roblox.  It's not going to happen because a failing social network, with zero competency in the space, needs it to prop up their share price.\n\nedit: full disclosure: I own 10 shares of FB @ $350",
  "author_fullname": "t2_5imxo",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "FB is over, Metaverse won't save it",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_sjdk9t",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.9,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 7605,
  "total_awards_received": 4,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 7605,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "self",
  "edited": 1643882418,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1643875012,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen a lot of speculation on whether it&amp;#39;s worth buying the dip on FB.  Maybe it will bounce this week or next, but nobody, under any circumstances, should be long on FB.&lt;/p&gt;\n\n&lt;p&gt;I work in tech, and my best estimation is that the Metaverse announcement was literally &lt;em&gt;because&lt;/em&gt; FB could see the writing on the wall internally, and knew they were going to miss on earnings, so they had to create &lt;em&gt;some&lt;/em&gt; narrative which would justify holding FB.&lt;/p&gt;\n\n&lt;p&gt;Social networks have a couple important properties:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;They&amp;#39;re generational - people tend to use the network which their age cohort is using.  The younger generation flocks to a new network during high-school age to avoid their parents, and then gradually the older generation starts to pile in.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;They rely on network effects.  There&amp;#39;s always going to be at most a couple &amp;quot;winners&amp;quot; and everyone will move to those because a social network is worthless once people feel like that&amp;#39;s not where the activity is.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;FB managed to stave off disaster and hold on to millennials buy buying Instagram, while keeping facebook.com as a high-profit environment where they could just bombard vulnerable old people and conspiracy theorists with high margin advertising (kind of like cable news).  But they have failed to capture the younger generation who&amp;#39;ve moved to TikTok.  And since there is only room for one mainstream social network for every generation, that leaves them with no real avenue for growth.&lt;/p&gt;\n\n&lt;p&gt;So the metaverse is a totally impractical hail-marry.  Basically what FB wants to convince you of is that they will be able to construct a compelling virtual reality and productize it faster than TikTok can eat their lunch.&lt;/p&gt;\n\n&lt;p&gt;This is an extreme challenge for a number of reasons.  The main one being: what they&amp;#39;re describing is &lt;em&gt;incredibly&lt;/em&gt; capital intensive.  The amount of compute required to create a persistent interactive virtual reality for the entire world to play in is &lt;em&gt;orders of magnitude&lt;/em&gt; higher than what&amp;#39;s required to host images, videos and comments as they do now.  Who&amp;#39;s going to pay for that?  Are advertisers going to pay 100x higher ad-rates to put up a billboard in a totally un-tested platform when they can just buy ads on TikTok instead?&lt;/p&gt;\n\n&lt;p&gt;Maybe we&amp;#39;ll get a metaverse someday, but at best it&amp;#39;s decades away, and it&amp;#39;s going to happen bottom-up from the expansion of MMO&amp;#39;s and platforms like Roblox.  It&amp;#39;s not going to happen because a failing social network, with zero competency in the space, needs it to prop up their share price.&lt;/p&gt;\n\n&lt;p&gt;edit: full disclosure: I own 10 shares of FB @ $350&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "sjdk9t",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "pragmojo",
  "discussion_type": null,
  "num_comments": 425,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/sjdk9t/fb_is_over_metaverse_wont_save_it/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/sjdk9t/fb_is_over_metaverse_wont_save_it/",
  "subreddit_subscribers": 11572712,
  "created_utc": 1643892184,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1643875012,
  "the_new_excerpt": "I've seen a lot of speculation on whether it's worth buying the dip on FB. Maybe\nit will bounce this week or next, but nobody, under any circumstances, should be\nlong on FB.\n\nI work in tech, and my best estimation is that the Metaverse announcement was\nliterally because FB could see the writing on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "FBでdipを買う価値があるかどうか、いろいろな憶測が飛び交っていますね。もしかしたら\n今週か来週にはバウンドするでしょうが、どんなことがあっても誰も\nFBをロングで。\n\n私は技術系の仕事をしていますが、私の予想では、メタバースの発表が\nFBは、文字通り、\"書く \"ことが見えたからです。",
      "title": "FBは終わり、メタバースは救われない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多关于是否值得在FB上买跌的猜测。也许\n也许本周或下周会反弹，但在任何情况下，都不应该在FB上做多。\n在FB上做多。\n\n我在科技领域工作，我最好的估计是，Metaverse的公告是\n因为FB可以看到上面的字样...",
      "title": "FB已经结束了，Metaverse不会拯救它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多關於是否值得在FB上買跌的猜測。也許\n也許本週或下週會反彈，但在任何情況下，都不應該在FB上做多。\n在FB上做多。\n\n我在科技領域工作，我最好的估計是，Metaverse的公告是\n因爲FB可以看到上面的字樣...",
      "title": "FB已經結束了，Metaverse不會拯救它"
    }
  ],
  "source_updated_at": 1644572439291
}