{
  "author": "Asleep_Cup_1337",
  "the_new_excerpt": "I am pretty much torn over SPOT. I have used Spotify, Apple Music, and YouTube\nMusic. I have to say that playlists and recommendations from Spotify are the\nbest. Even though I love using Spotify, I am not sure whether I should put any\nmoney into the stock.\n\nThe main issue I have with SPOT is it is…",
  "original_created_utc": 1623040285,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SPOTについてはかなり悩んでいます。今まで使ってきたのは、Spotify、Apple Music、YouTube\n音楽を利用しています。やはりSpotifyのプレイリストやレコメンドは最高ですね。\n最高です。Spotifyを愛用していても、株に資金を投入すべきかどうか迷っています。\nこの株にお金を入れるべきかどうか迷っています。\n\n私がSPOTに抱いている最大の問題は、それが...",
      "title": "Spotifyは、株式ポートフォリオの中で重要な位置を占めるべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对SPOT很是纠结。我曾使用过Spotify、苹果音乐和YouTube\n音乐。我不得不说，Spotify的播放列表和推荐是最好的。\n最好的。尽管我喜欢使用Spotify，但我不确定我是否应该把任何\n钱投入该股票。\n\n我对SPOT的主要问题是它是...",
      "title": "Spotify应该在股票组合中占有一席之地吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對SPOT很是糾結。我曾使用過Spotify、蘋果音樂和YouTube\n音樂。我不得不說，Spotify的播放列表和推薦是最好的。\n最好的。儘管我喜歡使用Spotify，但我不確定我是否應該把任何\n錢投入該股票。\n\n我對SPOT的主要問題是它是...",
      "title": "Spotify應該在股票組合中佔有一席之地嗎？"
    }
  ],
  "title": "Should Spotify be given a spot in a stock portfolio?",
  "created_utc": 1623059162,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am pretty much torn over SPOT. I have used Spotify, Apple Music, and YouTube Music. I have to say that playlists and recommendations from Spotify are the best. Even though I love using Spotify, I am not sure whether I should put any money into the stock.</p>\n\n<p>The main issue I have with SPOT is it is the only company in the music streaming game that needs to make money off of music streaming. All the other companies (AAPL, AMZN, GOOG) don&#39;t have to make a penny from their music streaming services because all of these companies have way more profitable lines of businesses. Besides, music streaming does not have any economy of scale to speak of. The more users you have, the more music is getting streamed, the more royalties you have to pay out.</p>\n\n<p>Any thoughts on why SPOT should have a spot in a stock portfolio?</p>\n</div><!-- SC_ON -->",
  "score": 409,
  "permalink": "/r/investing/comments/nu3wrs/should_spotify_be_given_a_spot_in_a_stock/",
  "subreddit": "investing",
  "id": "nu3wrs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886625
}