{
  "author": "BannerlordAdmirer",
  "the_new_excerpt": "I thought it would be beneficial to take a look at technical analysis from an\nintuitive standpoint. I would say having read a number of materials, things like\nstockcharts.com [https://stockcharts.com], even books that proprietary trading\nfirms advocate like Jane Street, various websites, people on…",
  "original_created_utc": 1614494615,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想，从技术分析的角度来看，会有好处。\n直观的立场。我想说的是，看了一些资料，像\nstockcharts.com [https://stockcharts.com]，甚至是自营交易的书籍。\n公司主张像简街、各网站、人上...",
      "title": "讨论技术分析背后的直觉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想，從技術分析的角度來看，會有好處。\n直觀的立場。我想說的是，看了一些資料，像\nstockcharts.com [https://stockcharts.com]，甚至是自營交易的書籍。\n公司主張像簡街、各網站、人上...",
      "title": "討論技術分析背後的直覺。"
    }
  ],
  "title": "A Discussion of the Intuition behind Technical Analysis",
  "created_utc": 1614520557,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I thought it would be beneficial to take a look at technical analysis from an intuitive standpoint. I would say having read a number of materials, things like <a href=\"https://stockcharts.com\">stockcharts.com</a>, even books that proprietary trading firms advocate like Jane Street, various websites, people on youtube, even the CMT coursebooks; the one commonality is that no one starts from a first-principles, axiomatic approach.</p>\n\n<p>We all have some instinct that elements of technical analysis are valid. I can prove this because we all reference one TA tool or another to gauge sentiment or the strength of prevailing trends. A big one that comes to mind is CNN&#39;s Fear and Greed Index. Well, what actually is it? It looks at moving averages of the SPY and VIX to gauge sentiment. My own firm, one of the largest research and i-bank companies that has done some of the biggest recent IPOs in recent years, does a weekly positioning report that does this moving average and relative strength breakdown on a sector-by-sector basis: the very same RSI indicator you can throw on any stock or index on your own.</p>\n\n<p>I start from the premise that <strong>1.</strong> emotions influence trading and investing decisions. <strong>2.</strong> price cannot move up until sell orders have been absorbed. If you can agree with me here, let&#39;s proceed.</p>\n\n<p>Now, let&#39;s apply this to a concept that everyone has heard of and maybe uses but may not fully understand and from there we&#39;ll take a tour through the next extensions of it.</p>\n\n<p><em>Why are</em> <strong><em>moving averages</em></strong> <em>significant?</em></p>\n\n<p>How do you feel when you are 50% up on a stock vs. 50% down on a stock? Here it is: they serve as proxies or composite for the <strong>cost basis</strong> of the most recent participants in the stock and give insight into their fragility or strength. We draw that strength or weakness from the other holders. Are people chilling at their entry or is their pain tolerance being tested? If the major moving averages (often the 8, 20, 50, 100, 200, but most critically the 20, 50, and 200) are close together, all that is saying the newest and intermediate entrants&#39; are close together.</p>\n\n<p>You can take any stock (with long enough price history) and characterize the trend or lack of it by the relations of the moving averages to each other and current price: uptrend (longer-term MAs are trailing the other ones on the way up), obvious downtrend (same thing, but to the downside), or accumulation/consolidation (range-bound. getting close together), or chop (after a volatile move that throws everything off).</p>\n\n<p>Each configuration of MAs paints a different picture of a stock. Say the 20 and 50 are close and you think is poised to run up: but what if the 200 MA is above your entrypoint? That tells you there are still many bagholders waiting to unload on you as soon as they&#39;ve gone back to breakeven.</p>\n\n<p>Compare that situation to when the 200MA is right down with the 20 and 50: this is meaningfully different because enough time has passed for most of the weaker holders to cry uncle and bow out.</p>\n\n<p><strong>So in that sense, a bagholder down 50% who has demonstrated unwillingness to sell over many months enduring multiple legs down (aka diamond-handing), is actually identical to a long who got in at the absolute bottom, when the float has been cornered and rally is preparing, in that they are both locking down supply.</strong></p>\n\n<p>What about when the rally occurs? Now when that bagholder sees price hits his entrypoint after a year of seeing paper losses of 50%, what is he going to do? Many of them will sell. You see this rage and anguish everywhere, people eviscerating the stock and praying to get out at breakeven. You&#39;ve ever experienced this yourself or, if you&#39;re brand new to the market, you will soon.</p>\n\n<p>This is turn influences the long who anticipates this and will at least begin scaling out at that first price target. Again, just look at common threads showing up over and over again. How many times have you seen &quot;I took some shares off the table, now I&#39;m just letting it ride and playing with house money?&quot; Again making the point that these common psychological and emotional things affect all of us and these get expressed in relation to key prices.</p>\n\n<p>So if you accept that bagholders are likely to sell at a sniff of being breakeven again, we can segment the price the stock has traded at into levels. <strong>Hence we naturally arrive at the concepts of support and resistance.</strong></p>\n\n<p><em>Do you believe in mean reversion theory?</em> Well,  guess what <strong>Bollinger Bands</strong> are premised on. A stock is less likely to sustain a full standard deviation move on nothing. And this is where I want to interject my own personal opinion: these indicators and tools mean nothing without at least paying attention to the big picture. You <strong>contextualize the drop or rise against the catalyst or fundamental change that sparked the move</strong>. Blindly buying on &quot;Oh Bollinger Band was breached&quot; or &quot;RSI is oversold&quot; is a recipe for disaster. There is no such thing as &quot;Yeah I just look at the charts, that tells me the news&quot;.</p>\n\n<p>If we can learn anything from GME, Volkswagen, Sears, JC Penny, <strong>it proves that stocks (the units themselves) are a commodity subject to the law of supply and demand.</strong> So much of TA can be summarized as attempting to characterize the ownership of the float (again stemming from the axiom that price literally cannot move up until the sellers have at least temporarily been absorbed).</p>\n\n<p>The times where TA will fly out of the window is most often when <strong>float turnover is extremely high (during or several days after some 10x volume day or just extreme moves) and you have no idea how idea where people stand on the stock.</strong> Again, we can relate this to the strength of the longs: the longs that were positioned beforehand have sold and we no longer have clarity into the collective longs&#39; cost basis.  Why? Because this is a completely new batch of longs and weakness has been introduced because people have bought at the top and now the process starts over again. In this confusion the stock gaps up 15% one day, then gaps down 15% the next, then gaps up 20%, like ATOS now for one example of many. All we know is that extreme volatility is here, but we don&#39;t need to look at any indicator to tell us that.</p>\n\n<p>And I believe technical analysis is <strong>not great for penny stocks.</strong> Not because they lack analytical power or that you can&#39;t pinpoint entrypoints, but because they cannot predict the random targeting or so-called bear raids by either proprietary trading firms, hedge funds or private syndicates. All they need to do is determine the company is not a buyout candidate, is not close to securing major contracts or going to market with their developing product, that&#39;s literally all they need to decide to short the stock. And they&#39;ll do it even if it&#39;s a decorated group of C-level execs with contacts that you would think makes it risky because of the potential for some partnership or contract, because they just want to ride it down for a couple weeks or months. Even if institutions hold 20% of the float and people take reassurance in this, 20% of say 300M or even 500M is nothing. And when you look at the average daily volume on some for these thinner stocks, even one individual trader or group of them can have enough capital to mess with the stock if he wants to and paint the entire day, much less just the close. I also do not like to apply TA to <strong>SPACs</strong> when they are just out of the gate as they are vulnerable to short reports by hedge funds like Citron, Point72, Hindenberg, who want to hit the stock before institutional holders have taken positions. We also have little price history to work with.</p>\n\n<p>Some of my personal advice: <strong>you should never rely on an indicator blindly, and you should always understand how they are formulated.</strong> A MACD cross below and above the zero-line are two completely different things. A lot of them are formulated off of the open, day, and close, of a particular day, and some like Accumulation/Distribution may give a false impression because they don&#39;t account for gap downs or gap ups. So you have to take the time to understand the tools you are using. I personally stopped using volume indicators because we do not have dark pool information and I just never got in touch with someone who could explain it to me.</p>\n\n<p><strong>Get a big picture of what&#39;s going on beyond the TA.</strong> I&#39;m choosing to end on this opinion because it&#39;s important to me. Don&#39;t play a penny stock and hold it after it jumps 100% overnight expecting it to continue running, and then get diluted on because you didn&#39;t realize they only had cash on hand for three more quarters, is -a billion EPS, and they have an open shelf registration, or you held a stock into the strike price of warrants, that you didn&#39;t know about because you didn&#39;t spend 1 minute glancing at finviz (current ratio will you give a quick idea they likely the company is to do a secondary offering; just using common sense, they&#39;re not going to wait till the very last day before issuing shares for more cash, right?) or the shareholder&#39;s equity section of the balance sheet (to know if warrants will be at play).</p>\n\n<p>This happened specifically multiple times to me before I got tired of seeing 100% overnighters dump down to 20% gain before I finally decided &quot;You know what, I&#39;m going to spend literally 1 minute to save myself thousand of dollars.&quot; Another way of saying this is to &quot;<strong>Have a plan</strong>&quot;, and be educated enough to have one.</p>\n\n<p>Those are two concrete examples of things that take 1 minute to look up, that I didn&#39;t do and lost thousands in paper gains because of it. I still have those trade confirmations saved (OPTT, TRXC, a couple more), and will never delete them because of how painful, at a time where as a new college grad making not a lot it would have meaningfully changed my life. And so they can serve me as reminders  that there is no such thing as a free lunch: anytime you try and be lazy, the market will expose and punish you. Actually <strong>write down</strong> your entry and exit conditions. None of any of this matters is if you don&#39;t do that. It does not matter if you get 80% of all your trades right if that 5th trade undoes everything you did right.</p>\n</div><!-- SC_ON -->",
  "score": 74,
  "permalink": "/r/stocks/comments/lu9dcu/a_discussion_of_the_intuition_behind_technical/",
  "subreddit": "stocks",
  "id": "lu9dcu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937743282
}