{
  "author": "bluewave84",
  "original_created_utc": 1628667337,
  "title": "Tired of Google Analytics? - Here is your simplified alternative.",
  "created_utc": 1628714086,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all,</p>\n\n<p>I have been working on this concept for a while since I have grown to literally hate Google Analytics.</p>\n\n<p>I recently wrapped up and launched <a href=\"https://NETSTATS.ONLINE\">NETSTATS.ONLINE</a> which is light weight, easy, and in my biased opinion superior to the big website statistics players out there. Not from it outweighing the features of the  heavy-hitting analytics platforms but because of its  simplistic approach to the visitor data that it provides.</p>\n\n<p>In a nutshell, NETSTATS allows free accounts with unlimited websites, serves up incredibly  straightforward data that is precisely the visitor data you want to see;  seriously, it&#39;s beautiful. Not to mention, you can toggle to real-time  mode and literally watch your traffic performance rolling by which is  great when running ad campaigns.</p>\n\n<p>While the free accounts are always welcome, paid upgrades are available based on your website traffic. The upgrades are reasonable and are not forced on  you. The overall platform is a breath of fresh air considering the  complex and bulky visitor statistic programs I have used and found all  over the web.</p>\n\n<p>Would love to know your feedback!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/p28b23/tired_of_google_analytics_here_is_your_simplified/",
  "subreddit": "SideProject",
  "id": "p28b23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey all,\n\nI have been working on this concept for a while since I have grown to literally\nhate Google Analytics.\n\nI recently wrapped up and launched NETSTATS.ONLINE [https://NETSTATS.ONLINE]\nwhich is light weight, easy, and in my biased opinion superior to the big\nwebsite statistics players out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nこのコンセプトは、私が文字通り「Goog」を憎むようになってから、しばらくの間取り組んできたものです。\nGoogle Analyticsが大嫌いになったからです。\n\n私は最近、NETSTATS.ONLINE [https://NETSTATS.ONLINE]を立ち上げました。\nこれは、軽量で簡単で、私の偏った意見では、大規模な分析システムよりも優れています。\n軽くて簡単で、私の偏った意見では、ウェブサイト統計の大手企業よりも優れています。",
      "title": "Google Analyticsに飽きた？- ここにあなたのシンプルな代替手段があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我已经在这个概念上工作了一段时间，因为我已经变得非常讨厌\n讨厌谷歌分析。\n\n我最近完成并推出了NETSTATS.ONLINE [https://NETSTATS.ONLINE]\n它是轻量级的，简单的，而且在我的偏见看来比大的\n网站统计的玩家。",
      "title": "厌倦了谷歌分析？- 这里是你的简化替代方案。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我已經在這個概念上工作了一段時間，因爲我已經變得非常討厭\n討厭谷歌分析。\n\n我最近完成並推出了NETSTATS.ONLINE [https://NETSTATS.ONLINE]\n它是輕量級的，簡單的，而且在我的偏見看來比大的\n網站統計的玩家。",
      "title": "厭倦了谷歌分析？- 這裏是你的簡化替代方案。"
    }
  ]
}