{
  "author": "LegendLarrynumero1",
  "the_new_excerpt": "\"It can't go any lower.\" Never make such an assumption. A bad company can and\nwill go lower.\n\n\"How much higher can it go?\" Selling too early just because a stock goes up.\n\n\"They always come back\" Don't assume a stock price will rebound, look at the\nfundamentals not the price.\n\n\"How much can I lose?\"…",
  "original_created_utc": 1623106217,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"これ以上は下がらない\"。そんな思い込みは絶対にしないでください。悪い会社はもっと下がるし\n下がることもあるでしょう。\n\n\"どこまで上がるのか？\" 株価が上がったからといって、早々に売ってはいけない。\n\n\"They always come back\" 株価が反発すると仮定しないで、価格ではなくファンダメンタルズを見る。\n価格ではなくファンダメンタルズを見よう。\n\n\"How much can I lose?\"...",
      "title": "ピーター・リンチが語る、投資家が陥る10の間違い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"它不可能再低了\"。永远不要做这样的假设。一个糟糕的公司可以而且\n将会更低。\n\n\"它能涨到多少？\" 仅仅因为一只股票上涨就过早地卖出。\n\n\"他们总是会回来的\"，不要假设股票价格会反弹，要看基本面而不是价格。\n看基本面，而不是看价格。\n\n\"我可以损失多少？\"...",
      "title": "彼得-林奇的每个投资者都会犯的10个错误"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"它不可能再低了\"。永遠不要做這樣的假設。一個糟糕的公司可以而且\n將會更低。\n\n\"它能漲到多少？\" 僅僅因爲一隻股票上漲就過早地賣出。\n\n\"他們總是會回來的\"，不要假設股票價格會反彈，要看基本面而不是價格。\n看基本面，而不是看價格。\n\n\"我可以損失多少？\"...",
      "title": "彼得-林奇的每個投資者都會犯的10個錯誤"
    }
  ],
  "title": "Peter Lynch's 10 mistakes every investor makes",
  "created_utc": 1623116987,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;It can&#39;t go any lower.&quot; Never make such an assumption. A bad company can and will go lower.</p>\n\n<p>&quot;How much higher can it go?&quot; Selling too early just because a stock goes up.</p>\n\n<p>&quot;They always come back&quot; Don&#39;t assume a stock price will rebound, look at the fundamentals not the price.</p>\n\n<p>&quot;How much can I lose?&quot; A cheap stock price doesn&#39;t = a good value. You can lose % at any price.</p>\n\n<p>&quot;It&#39;s always darkest before dawn.&quot; It&#39;s a terrible business but it&#39;s down 80%! Buy at a discount? no, it still has room to drop.</p>\n\n<p>&quot;I will sell after rebound&quot; Buy at $10, it falls to $6, and you think &quot;If it goes back to $10 I&#39;ll sell. Well if you think that you should buy more! A key to remember, the stock doesn&#39;t know you own it. It may never get to $10 again as well. Don&#39;t take it personal. Make decisions based on fundamentals.</p>\n\n<p>&quot;Don&#39;t worry, I own conservative stocks&quot; (utilities...)</p>\n\n<p>&quot;Look at the money I lost because I didn&#39;t buy&quot; FOMO? Hundreds of stocks go up double digits. Don&#39;t worry about other stocks. Focus on ones you know. You can&#39;t lose money on a stock you don&#39;t own.</p>\n\n<p>&quot;Stock is up I must be right / Stock is down I must be wrong.&quot; Stocks go up and down a lot each year. The ups and downs don&#39;t mean much in the short term.</p>\n\n<p>Avoid longshots. Investing based on rumors, comments, anything other than sound financial analysis and valuation.</p>\n\n<p>Peter Lynch worked at Fidelity and is has great wisdom.</p>\n</div><!-- SC_ON -->",
  "score": 2899,
  "permalink": "/r/stocks/comments/nupy68/peter_lynchs_10_mistakes_every_investor_makes/",
  "subreddit": "stocks",
  "id": "nupy68",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888029
}