{
  "author": "AskRedditAccount808",
  "original_created_utc": 1659948538,
  "title": "How do I politely tell my friends that telling me to “eat more” and “stop wasting food” isn’t going to magically help me gain weight?",
  "created_utc": 1659975289,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Background: I’m a 5’6” 118 lbs male. I started trying to gain weight about a month ago and I started at 112 lbs. The hardest part isn’t really going to the gym, it’s just trying to eat more than 2 small meals a day. I have a VERY small appetite and I will often leave food unfinished. I’ve just been eating smaller and smaller meals to not waste food.&lt;/p&gt;\n\n&lt;p&gt;I started hanging out with my friends more often and we hang out at one of their houses to chill. They’ve been pressuring me to eat way more than I can handle and it got to the point where I almost ended up throwing up for the first time in the last like 10 years.  Just today, I got yelled at because I didn’t completely finish my food. I managed to eat like half my bowl but “paused” my meal because I physically could not eat anymore. After about 15 min passed, I just barely managed to wolf down most, but not all of my food. I was honestly proud of myself for actually almost cleaning my plate, but then got yelled at for leaving just a little bit of food left. I just can’t anymore and it’s honestly putting me off my weight gain journey.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/wj3u5a/how_do_i_politely_tell_my_friends_that_telling_me/",
  "subreddit": "NoStupidQuestions",
  "id": "wj3u5a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Background: I’m a 5’6” 118 lbs male. I started trying to gain weight about a\nmonth ago and I started at 112 lbs. The hardest part isn’t really going to the\ngym, it’s just trying to eat more than 2 small meals a day. I have a VERY small\nappetite and I will often leave food unfinished. I’ve just been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "背景 私は 5'6\" 118 ポンドの男性です。私は約1ヶ月前に体重を増やそうとし始め\nヶ月前、私は112ポンドで開始しました。最も困難な部分は、実際にジムに行くではありません。\nジム、それはちょうど2以上の小さな食事をしようとすることです。私は非常に小さい\n食欲は非常に少なく、私はしばしば未完成の食品を残します。私はちょうどされている...",
      "title": "もっと食べなさい」「食べ物を粗末にするのはやめなさい」と言っても、魔法のように体重が増えるわけではないことを、友人に丁寧に伝えるにはどうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "背景。我是一个5英尺6英寸118磅的男性。我开始尝试增加体重，大约在一个月前\n一个月前，我从112磅开始。最困难的部分并不是去健身房，而是去健身房。\n健身房，只是想每天吃两顿以上的小餐。我的胃口非常小\n我的胃口很小，而且我经常不吃饭。我刚刚...",
      "title": "我如何礼貌地告诉我的朋友，告诉我 \"多吃 \"和 \"停止浪费食物 \"并不能神奇地帮助我增重？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景。我是一個5英尺6英寸118磅的男性。我開始嘗試增加體重，大約在一個月前\n一個月前，我從112磅開始。最困難的部分並不是去健身房，而是去健身房。\n健身房，只是想每天喫兩頓以上的小餐。我的胃口非常小\n我的胃口很小，而且我經常不喫飯。我剛剛...",
      "title": "我如何禮貌地告訴我的朋友，告訴我 \"多喫 \"和 \"停止浪費食物 \"並不能神奇地幫助我增重？"
    }
  ]
}