{
  "author": "AskRedditAccount808",
  "original_created_utc": 1659948538,
  "title": "How do I politely tell my friends that telling me to “eat more” and “stop wasting food” isn’t going to magically help me gain weight?",
  "created_utc": 1659975289,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Background: I’m a 5’6” 118 lbs male. I started trying to gain weight about a month ago and I started at 112 lbs. The hardest part isn’t really going to the gym, it’s just trying to eat more than 2 small meals a day. I have a VERY small appetite and I will often leave food unfinished. I’ve just been eating smaller and smaller meals to not waste food.&lt;/p&gt;\n\n&lt;p&gt;I started hanging out with my friends more often and we hang out at one of their houses to chill. They’ve been pressuring me to eat way more than I can handle and it got to the point where I almost ended up throwing up for the first time in the last like 10 years.  Just today, I got yelled at because I didn’t completely finish my food. I managed to eat like half my bowl but “paused” my meal because I physically could not eat anymore. After about 15 min passed, I just barely managed to wolf down most, but not all of my food. I was honestly proud of myself for actually almost cleaning my plate, but then got yelled at for leaving just a little bit of food left. I just can’t anymore and it’s honestly putting me off my weight gain journey.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/wj3u5a/how_do_i_politely_tell_my_friends_that_telling_me/",
  "subreddit": "NoStupidQuestions",
  "id": "wj3u5a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Background: I’m a 5’6” 118 lbs male. I started trying to gain weight about a\nmonth ago and I started at 112 lbs. The hardest part isn’t really going to the\ngym, it’s just trying to eat more than 2 small meals a day. I have a VERY small\nappetite and I will often leave food unfinished. I’ve just been…"
}