{
  "author": "kojinnie",
  "original_created_utc": 1653076404,
  "title": "Dads of Reddit, why do you act differently to your daughters once they hit puberty?",
  "created_utc": 1653102010,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Note: I&amp;#39;m Asian (this could probably be a cultural thing, or not, I don&amp;#39;t know).&lt;/p&gt;\n\n&lt;p&gt;I remember feeling loved by my Dad so much, until I hit puberty. I remember the vivid look of disappointment on my Dad&amp;#39;s face the first time my Mum told him I&amp;#39;ve gotten my first period. To remember it still breaks my heart until today. A lot of my friends experienced having their Dads distancing themselves too from their daughters after they hit puberty.&lt;/p&gt;\n\n&lt;p&gt;Dads of Reddit, we miss you. What happened?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/uu67vx/dads_of_reddit_why_do_you_act_differently_to_your/",
  "subreddit": "TooAfraidToAsk",
  "id": "uu67vx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Note: I'm Asian (this could probably be a cultural thing, or not, I don't know).\n\nI remember feeling loved by my Dad so much, until I hit puberty. I remember the\nvivid look of disappointment on my Dad's face the first time my Mum told him\nI've gotten my first period. To remember it still breaks my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "注：私はアジア人です（これはおそらく文化的なものかもしれないし、そうでないかもしれない、わからない）。\n\n思春期を迎えるまでは、父にとても愛されていると感じていたのを覚えています。そのとき\n初めて母が父に生理が来たことを告げたときの、父の失望した表情を鮮明に覚えています。\n初めて生理が来たんだ。思い出すと、今でも胸が痛む。",
      "title": "Redditのお父さん、なぜ娘が思春期を迎えると、いつもと違う行動をするのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "注：我是亚洲人（这可能是一个文化问题，也可能不是，我不知道）。\n\n我记得我觉得自己很受爸爸的爱，直到我进入青春期。我记得\n我记得当我妈第一次告诉我爸时，他脸上的失望神情历历在目。\n我有了第一次月经。我还记得，这让我很伤心...",
      "title": "红尘中的爸爸们，为什么你们在女儿进入青春期后，对她们的行为会有所不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "注：我是亞洲人（這可能是一個文化問題，也可能不是，我不知道）。\n\n我記得我覺得自己很受爸爸的愛，直到我進入青春期。我記得\n我記得當我媽第一次告訴我爸時，他臉上的失望神情歷歷在目。\n我有了第一次月經。我還記得，這讓我很傷心...",
      "title": "紅塵中的爸爸們，爲什麼你們在女兒進入青春期後，對她們的行爲會有所不同？"
    }
  ]
}