{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Thursday, May 20, 2021\n\nStocks snapped their modest three-day losing streak and jumped higher today,\nwith market participants encouraged by the Weekly Unemployment Report and\ninflationary fears tempering. As I said yesterday, I was encouraged to see\nvolatility decreasing this…",
  "original_created_utc": 1621544618,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - Thursday, May 20, 2021\n\n5月20日(木)の東京株式市場は、3日連続で下落していた株価が上昇に転じた。\n市場参加者は、週間失業率レポートに勇気づけられ、インフレ懸念が和らいだ。\nインフレ懸念が和らいだ。昨日述べたように、私は、この時期にボラティリティーが低下していることに勇気づけられました。\nボラティリティーが減少していることは、昨日述べたとおりです。",
      "title": "本日、2021年5月20日（木）のMarket Recapをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月20日星期四\n\n股市结束了三天的小幅连跌，今天跳空高开。\n市场参与者受到每周失业报告的鼓舞，通胀担忧有所缓解。\n通货膨胀的担忧有所缓解。正如我昨天所说，我很高兴地看到\n波动性减少，这让我很受鼓舞...",
      "title": "以下是今天的市场回顾，2021年5月20日，星期四"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月20日星期四\n\n股市結束了三天的小幅連跌，今天跳空高開。\n市場參與者受到每週失業報告的鼓舞，通脹擔憂有所緩解。\n通貨膨脹的擔憂有所緩解。正如我昨天所說，我很高興地看到\n波動性減少，這讓我很受鼓舞...",
      "title": "以下是今天的市場回顧，2021年5月20日，星期四"
    }
  ],
  "title": "Here is a Market Recap for today Thursday, May 20, 2021",
  "created_utc": 1621564585,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Thursday, May 20, 2021</strong></p>\n\n<p>Stocks snapped their modest three-day losing streak and jumped higher today, with market participants encouraged by the Weekly Unemployment Report and inflationary fears tempering. As I said yesterday, I was encouraged to see volatility decreasing this week after the wild swing the market experienced recently and am even more encouraged by today’s movement that the sharp sell-off was overdone. </p>\n\n<p>The Department of Labor released their Weekly Unemployment Report, which showed 444,000 new jobless claims filed, a fresh pandemic low and marginally better than the 450,000 expected by economists. To put this into context, in April of last year, more than 6 million individuals filed jobless claims in one week. While the improvement in the labor market has been extremely encouraging, in the Federal Reserve’s April meeting minutes (basically notes about what was discussed in the meeting) noted “participants generally noted that the economy remained far from the Committee’s maximum-employment and price-stability goals”.  </p>\n\n<p>However, it is important to note, the minutes covered the meeting before the release of the April Jobs Report, which came in much weaker than expected (which bolsters the Fed’s argument that employment remains far from their goal) and the Consumer Price Index, which showed a greater-than-expected increase in consumer prices. That said, the recent reports are extremely unlikely to change the Fed’s view given Powell and other monetary officials have said they expect any inflation to be “transitory” and want to see a “string” of strong labor reports before adjustments to the current policy are considered.</p>\n\n<p>On a slightly sour note, the meeting minutes also noted “a number of participants suggested” that as the economy continues to quickly, “it might be appropriate at some point in upcoming meetings to begin discussing a plan for adjusting the pace of asset purchase”, which have currently been going at a rate of $120 billion per month. However, this is not a surprising statement and one Powell himself has said before. Back in an April 14 meeting, Powell said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.” As a reminder, quantitative easing is a process in which the Fed buys government bonds in order to inject money into the economy. It is only natural that as the economy recovers, less money needs to be injected into the economy in this manner. The Federal Reserve gave absolutely no signal it was even considering beginning discussion on raising interest rates, which is what market participants are really concerned about. <a href=\"https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210428.pdf\">Read the entire meeting minutes here</a></p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Robinhood said it is starting to roll out a new service that will users of its platform to invest into initial public offerings at the same time as Wall Street. Basically, this service will let people buy the IPO at the offering price rather than have to wait for the stock to begin trading at mid-day. We have all seen stocks skyrocket between their offering and opening price before. </li>\n<li>Ford Motor (F) has struck a deal with South Korean firm SK Innovation Co. to form a joint venture to build electric-car batteries in the U.S.</li>\n<li>Snap (SNAP) stock surged after the company reported more than 500 million monthly active users and said nearly half of all smartphone users in the US have the SnapChat app and unveiled new artificial reality glasses.</li>\n<li>Google will open its first-ever permanent retail store in New York City in coming weeks, a bet that a physical retail presence can help showcase and sell its products as the pandemic eases.</li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday movement.*\\</strong>*</li>\n<li>John Deere (DE) target raised by Citigroup from $400 to $415 at Buy. Stock currently around $358</li>\n<li>Fedex (FDX) target raised by Wells Fargo from $336 to $351 at Overweight. Stock Acurrently around $308</li>\n<li>Home Depot (HD) target raised by Jefferies Financial from $325 to $374 at Buy. Stock currently around $314</li>\n<li>L Brands (LB) target raised by Wells Fargo from $84 to $90 at Overweight. Stock currently around $65</li>\n<li>Lowe&#39;s (LOW) with two target raises. Stock currently around $191\n\n<ul>\n<li>Robert W Baird from $230 to $235 at Outperform</li>\n<li>Jefferies Financial Group from $200 to $247 at Buy</li>\n</ul></li>\n<li>Target (TGT) with two price target increases. Stock currently around $219. \n\n<ul>\n<li>Raymond James from $215 to $255 at Strong-Buy</li>\n<li>Telsey Advisory Group from $25 to $265 at Outperform</li>\n</ul></li>\n<li>TJX Companies (TJX) with two target raises. Stock currently around $67\n\n<ul>\n<li>Barclays from $82 to $87 at Overweight</li>\n<li>Deutsche Bank from $80 to $84 at Buy</li>\n</ul></li>\n</ul>\n\n<p>““The secret of getting ahead is getting started.” - Mark Twain</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/stocks/comments/nhbg63/here_is_a_market_recap_for_today_thursday_may_20/",
  "subreddit": "stocks",
  "id": "nhbg63",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388319
}