{
  "author": "partymsl",
  "original_created_utc": 1655746959,
  "title": "People calling for a reversal now are calling for the shortest bear market for Crypto ever in the midst of a recession and very bad macro-economy. That simply won't happen.",
  "created_utc": 1655761273,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin just made a 31% off its lowest wick of about 17.5k while ETH went up 18% too and some alts also made massive gains in the past days and hours. Soany very quick enough to call this the bottom. But literally everything higher than the 4 hour Charts are looking bearish as hell right now. With the stock market too looking even more bearish than Crypto right now.&lt;/p&gt;\n\n&lt;p&gt;Also if you just think logically of we reverse now this would be the shortest bear marjet Crypto has ever had. And all that in the midst of probably the worst macro-economic outlook since 2008 or even way further down. Also while we are on the brink of a recession that every politician is denying just like they denied inflation a year ago.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t wanna be bearish or so, I&amp;#39;m just trying to remain realistic and obviously we can&amp;#39;t predict the next word events or so. But right now it&amp;#39;s woukd be a way safer bet to go with the trend and not oppose it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 416,
  "permalink": "/r/CryptoCurrency/comments/vgr7f4/people_calling_for_a_reversal_now_are_calling_for/",
  "subreddit": "CryptoCurrency",
  "id": "vgr7f4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin just made a 31% off its lowest wick of about 17.5k while ETH went up 18%\ntoo and some alts also made massive gains in the past days and hours. Soany very\nquick enough to call this the bottom. But literally everything higher than the 4\nhour Charts are looking bearish as hell right now. With…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは17.5kの最安値から31%上昇し、ETHも18%上昇しました。\nまた、いくつかのアルトも過去数日間で大きな利益を得ました。そのため、多くの人が\nこれが底と呼ぶに十分な速さです。しかし、文字通り、4時間足より上のチャートはすべて弱気になっています。\n時間足チャートは今、地獄のように弱気に見える。それで...",
      "title": "今、反転を求める人々は、不況と非常に悪いマクロ経済の中で、Cryptoの史上最短の弱気市場を求めているのです。そんなことは起こりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币刚刚从最低的17.5千块钱赚了31%，而ETH涨了18%。\n在过去的几天和几个小时里，一些代币也取得了巨大的收益。因此，任何\n足够快地将此称为底部。但从字面上看，所有高于4\n小时的图表现在看起来都是看跌的。随着...",
      "title": "现在呼吁反转的人是在呼吁在经济衰退和宏观经济非常糟糕的情况下，为加密货币带来最短的熊市。这根本不会发生。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣剛剛從最低的17.5千塊錢賺了31%，而ETH漲了18%。\n在過去的幾天和幾個小時裏，一些代幣也取得了巨大的收益。因此，任何\n足夠快地將此稱爲底部。但從字面上看，所有高於4\n小時的圖表現在看起來都是看跌的。隨着...",
      "title": "現在呼籲反轉的人是在呼籲在經濟衰退和宏觀經濟非常糟糕的情況下，爲加密貨幣帶來最短的熊市。這根本不會發生。"
    }
  ]
}