{
  "author": "Ragnaroknight",
  "the_new_excerpt": "If you're up 100s or 1,000s of percent on something FFS, take some fucking\nprofits. There's nothing wrong with it, you don't have to sell your entire bag,\nbut God damn don't be an idiot. All of this \"hodling\" meme crap is going to\nscrew you over.\n\nHolding is inarguably the best long term strategy…",
  "original_created_utc": 1612281995,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你在某件事情上涨了100%或1000%，那就他妈的吃点东西吧\n的利润。没有错，你不必把整个包包都卖掉。\n但该死的不要成为一个白痴。所有这些 \"杂乱无章 \"的追忆废话都将会是\n骗你的。\n\n持有无疑是最好的长期策略...",
      "title": "今天看了 \"纪念股\"，经历了2018年的加密暴跌。我被提醒了一些非常宝贵的经验，不要贪婪，千万不要FOMO。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你在某件事情上漲了100%或1000%，那就他媽的喫點東西吧\n的利潤。沒有錯，你不必把整個包包都賣掉。\n但該死的不要成爲一個白癡。所有這些 \"雜亂無章 \"的追憶廢話都將會是\n騙你的。\n\n持有無疑是最好的長期策略...",
      "title": "今天看了 \"紀念股\"，經歷了2018年的加密暴跌。我被提醒了一些非常寶貴的經驗，不要貪婪，千萬不要FOMO。"
    }
  ],
  "title": "Watching the \"meme stocks\" today and having suffered through the 2018 crypto crash. I was reminded of some very valuable lessons, don't get greedy, and never FOMO.",
  "created_utc": 1612320443,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re up 100s or 1,000s of percent on something FFS, take some fucking profits. There&#39;s nothing wrong with it, you don&#39;t have to sell your entire bag, but God damn don&#39;t be an idiot. All of this &quot;hodling&quot; meme crap is going to screw you over.</p>\n\n<p>Holding is inarguably the best long term strategy for crypto, but there&#39;s nothing wrong with cashing out a bit along the way. Never worry about the &quot;but what if it goes up to ____ amount&quot;. Just worry about what you DID make. Just knowing you&#39;re up from your initial investment, will bring you so much peace of mind. Then whatever happens along the way won&#39;t matter as much. </p>\n\n<p>Next alt-season we have, for the love of God. Don&#39;t hold into the ground, if you&#39;re way ahead, enjoy the fruits of your Investment. Don&#39;t live in denial when you&#39;re 90% down that the rocket ship is still coming.</p>\n\n<p>Maybe I&#39;ll eat my words in the next few weeks. But I still don&#39;t see literally any harm in quitting while you&#39;re ahead.</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/laz4eq/watching_the_meme_stocks_today_and_having/",
  "subreddit": "CryptoCurrency",
  "id": "laz4eq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530885
}