{
  "author": "gdj11",
  "the_new_excerpt": "When there’s big dumps in the markets, you always hear things like, “a whale\njust dumped $XXX million dollars of bitcoin in 10 minutes!” That is almost never\nthe case. It’s true there are usually large events that trigger it, but you need\nto understand how trading bots and stop losses work. A stop…",
  "original_created_utc": 1613371782,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当市场上出现大甩卖的时候，你总会听到这样的话：\"一条鲸鱼\"。\n刚刚在10分钟内抛售了XXX万美元的比特币！\" 这几乎是不可能的\n的情况。诚然通常会有大型事件触发，但你需要\n来了解交易机器人和止损的工作原理。止损...",
      "title": "为什么加密市场会出现瞬间抛盘--机器人和止损的简单解释"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當市場上出現大甩賣的時候，你總會聽到這樣的話：\"一條鯨魚\"。\n剛剛在10分鐘內拋售了XXX萬美元的比特幣！\" 這幾乎是不可能的\n的情況。誠然通常會有大型事件觸發，但你需要\n來了解交易機器人和止損的工作原理。止損...",
      "title": "爲什麼加密市場會出現瞬間拋盤--機器人和止損的簡單解釋"
    }
  ],
  "title": "Why crypto markets appear to dump instantly - a simple explanation of bots and stop losses",
  "created_utc": 1613385692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When there’s big dumps in the markets, you always hear things like, “a whale just dumped $XXX million dollars of bitcoin in 10 minutes!” That is almost never the case. It’s true there are usually large events that trigger it, but you need to understand how trading bots and stop losses work. A stop loss is a certain price at which a trader, usually with the assistance of a bot, will decide their losses are too much and will sell their crypto to prevent even greater losses.</p>\n\n<p>For example let’s say bitcoin is at $45k, and a bot has a very conservative stop loss set for $43k. Then say there’s some price swings that bring the price down to $43k. The bot will now instantly dump its crypto to prevent further loss before the market goes down even further.</p>\n\n<p>Now, let’s say there’s not just one bot, but thousands. And let’s say some bots have stop losses in the $44.9k range, and some in the $44.8k range, and so on, and so on. That small market swing which brought the price down to $43k just triggered hundreds or thousands of stop losses. So what happens if there’s not enough buyers to support all these bots selling? The price continues to drop, and it will drop until it finds enough buyers to support all of these sellers.</p>\n\n<p>Remember these are bots. They are software programs that can trade instantly, so this massive sell-off and dump in the market happened in the span of just a few minutes. To untrained eyes it will look like an instant drop, which they conclude could only happen from a single massive sell, but that’s not he case.</p>\n\n<p>Traders love times like this. They’re able to watch the buy and sell volume and estimate when the buying support will sustain the sellers, and that’s when they start buying. A lot of noobs see a giant red line in the charts and assume it’s a good time to buy. Don’t. Traders say, “don’t catch falling knives” because if the buyers aren’t yet supporting sellers, that red line is going to get a lot longer.</p>\n\n<p>This is a super simple explanation, but you should at least be familiar with the concept if you’re going to dabble in crypto.</p>\n\n<p>Good luck!</p>\n</div><!-- SC_ON -->",
  "score": 792,
  "permalink": "/r/CryptoCurrency/comments/lk7wpp/why_crypto_markets_appear_to_dump_instantly_a/",
  "subreddit": "CryptoCurrency",
  "id": "lk7wpp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728617847
}