{
  "author": "Less-Lengthiness114",
  "original_created_utc": 1640272351,
  "title": "If I HODL, and have no income, what should I live on?",
  "created_utc": 1640356376,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is yield something you might consider as income?&lt;/p&gt;\n\n&lt;p&gt;Edit 8 hours later: Am surprised at the amount of people assuming I&amp;#39;m a man. Also, assuming I don&amp;#39;t work. I&amp;#39;m an artist, which means I do nothing of any value to anyone all day, but it does meet the vague definition of work. Our house is fully paid off, and I have enough capital to live modestly on, but in the Bitcoin spirit of &amp;quot;never sell&amp;quot;, I was just wondering how everyone else is taking advantage of their growth in value. If you wake up one day with $10m in Bitcoin, and you&amp;#39;re making $1 a year as an artist, what are going to do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/rmxq0q/if_i_hodl_and_have_no_income_what_should_i_live_on/",
  "subreddit": "Bitcoin",
  "id": "rmxq0q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is yield something you might consider as income?\n\nEdit 8 hours later: Am surprised at the amount of people assuming I'm a man.\nAlso, assuming I don't work. I'm an artist, which means I do nothing of any\nvalue to anyone all day, but it does meet the vague definition of work. Our\nhouse is fully paid…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歩留まりは収入として考えてもいいものなのでしょうか？\n\n8時間後に編集 私が男性だと思い込んでいる人の多さに驚いています。\nまた、私が働いていないと思い込んでいる人もいます。私はアーティストで、何もしていません。\nしかし、それは漠然とした仕事の定義に合致しています。私たちの\n家は完済している...",
      "title": "HODLで、収入がない場合、何を食べて生きていけばいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "产量是你可能考虑的收入吗？\n\n8小时后编辑。我对很多人认为我是个男人感到惊讶。\n还有，假设我不工作。我是一个艺术家，这意味着我整天不做任何对人有价值的事。\n对任何人都没有价值，但这确实符合工作的模糊定义。我们的\n房子是全额支付的...",
      "title": "如果我是HODL，而且没有收入，我应该靠什么生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "產量是你可能考慮的收入嗎？\n\n8小時後編輯。我對很多人認爲我是個男人感到驚訝。\n還有，假設我不工作。我是一個藝術家，這意味着我整天不做任何對人有價值的事。\n對任何人都沒有價值，但這確實符合工作的模糊定義。我們的\n房子是全額支付的...",
      "title": "如果我是HODL，而且沒有收入，我應該靠什麼生活？"
    }
  ]
}