{
  "author": "Acceptable_Novel8200",
  "original_created_utc": 1637574824,
  "title": "Remember The Israeli lady who made fortune in her crypto investment ($3k into $320k) now her bank refusing to deposit her money because Bank says the source of funds might have related to money laundering or terrorist financing!",
  "created_utc": 1637585597,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is another level of customer discrimination by the one of the largest bank in Israel,Hapoalim Bank.\n8 years ago,A retired lady, Esther Freeman deposited her $3k to a Crypto-fiat platform,from her only bank account,to buy Bitcoin. \nShe holded her Bitcoin strong for 8 years made huge fortune out of her $3k, the 3k is now $320k.</p>\n\n<p>She cashed out her Crypto and wanting to transfer the fiat the same way she did 8 years ago,from Crypto-fiat platform to her bank account, she thought it would be smooth but to her surprise the same bank she has account with from years refusing to deposit her money because Bank says </p>\n\n<blockquote>\n<p>the source of funds might have related to money laundering or terrorist financing </p>\n\n<p>The characteristics of virtual (i.e., digital) currencies allow them to be transferred anonymously and unsupervised, often bypassing the need to use the financial factors that apply to the anti-money laundering and terrorist financing regime</p>\n</blockquote>\n\n<p>She has been a loyal customer to the bank, never had any suspicious activity in her bank account still her bank is harassing her like she did some crime.\nNow she have to fight a legal battle with her bank to get her own money.She needs her money to help her one of the kid, but bank is not letting her to do that because bank thinks the funds came from some illegal activities.</p>\n\n<p>Can you imagine that one of the largest bank of a country is doing that because she made huge gains via Crypto the only reason bank denying the deposit.</p>\n\n<p>Are banks not aware of the Crypto markets, or just pretending that they don&#39;t know how Crypto works? </p>\n\n<p>I think Bank denying the deposit because they just cant digest the fact that it is very possible to turn $3k into $320k in Crypto.</p>\n\n<p>She hired a lawyer to fight this case to get her money back ! </p>\n\n<p>Back in May, A Bank call the police on a senior citizen because he wanted to withdraw all his money to invest in Crypto! </p>\n\n<p>Incidents like these are going to increase,this could happen with you and me because it is getting very hard for banks to digest the facts that there are decentralized platforms where an average person can deposit the money and earn more interest as compared to the banks.,make more profits than Bank&#39;s investment products! </p>\n\n<p>This is just clear discrimination by a financial institution because the customer is invested in Crypto and made huge gains.</p>\n\n<p>In case anyone wants to read the news\n<a href=\"https://cryptopotato.com/israeli-bank-refuses-to-deposit-over-300000-earned-from-a-bitcoin-investment-report/\">https://cryptopotato.com/israeli-bank-refuses-to-deposit-over-300000-earned-from-a-bitcoin-investment-report/</a></p>\n</div><!-- SC_ON -->",
  "score": 905,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/bbsETV7uRGj6dJTBXEwVSvgIHrShQ1MJFmlNpiggdvY.jpg?auto=webp&s=b74f69d6e251447b6243d47409e3cbf59d0a2953",
          "width": 798,
          "height": 446
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/bbsETV7uRGj6dJTBXEwVSvgIHrShQ1MJFmlNpiggdvY.jpg?width=108&crop=smart&auto=webp&s=426d57cfdb7a66a497ae73fef52d1f71f3342a0a",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/bbsETV7uRGj6dJTBXEwVSvgIHrShQ1MJFmlNpiggdvY.jpg?width=216&crop=smart&auto=webp&s=0de1de88077d48990a34418f5d6153b2bcf88fe3",
            "width": 216,
            "height": 120
          },
          {
            "url": "https://external-preview.redd.it/bbsETV7uRGj6dJTBXEwVSvgIHrShQ1MJFmlNpiggdvY.jpg?width=320&crop=smart&auto=webp&s=9d7cba45a7b0dcc91ba5eb3099c65193df359bfc",
            "width": 320,
            "height": 178
          },
          {
            "url": "https://external-preview.redd.it/bbsETV7uRGj6dJTBXEwVSvgIHrShQ1MJFmlNpiggdvY.jpg?width=640&crop=smart&auto=webp&s=06a55a94e04c332821a58eed521ce1b39b2813ca",
            "width": 640,
            "height": 357
          }
        ],
        "variants": {},
        "id": "eBoThTgVkli4uB2AWvINYjtXq9c2RG2D9oCFtr5pgEY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qzi051/remember_the_israeli_lady_who_made_fortune_in_her/",
  "subreddit": "CryptoCurrency",
  "id": "qzi051",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is another level of customer discrimination by the one of the largest bank\nin Israel,Hapoalim Bank. 8 years ago,A retired lady, Esther Freeman deposited\nher $3k to a Crypto-fiat platform,from her only bank account,to buy Bitcoin. She\nholded her Bitcoin strong for 8 years made huge fortune out…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、イスラエル最大の銀行の一つであるハポアリム銀行による、顧客差別の一つです。\nハポアリム銀行による顧客差別です。8年前、退職した女性、Esther Freemanは、ビットコインを買うために\nビットコインを購入するために、彼女の唯一の銀行口座から3,000ドルを暗号化プラットフォームに預けました。彼女は\nビットコインを8年間保持し続け、巨額の富を得た...",
      "title": "暗号投資で大儲けしたイスラエル人女性（3,000ドルが320,000ドルに）が、資金源がマネーロンダリングやテロリストの資金調達に関係している可能性があるとして、銀行から入金を拒否されたことを思い出してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是以色列最大的银行之一Hapoalim银行对客户的另一层面的歧视。\n之一，Hapoalim银行。8年前，一位名叫Esther Freeman的退休女士将她的3千美元存入银行。\n从她唯一的银行账户中拿出3千美元存入一个加密火币平台，以购买比特币。她\n她把她的比特币坚守了8年，赚取了巨大的财富...。",
      "title": "还记得那位在加密货币投资中发财的以色列女士（3千美元变成32万美元），现在她的银行拒绝给她存钱，因为银行说资金来源可能与洗钱或恐怖主义融资有关。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是以色列最大的銀行之一Hapoalim銀行對客戶的另一層面的歧視。\n之一，Hapoalim銀行。8年前，一位名叫Esther Freeman的退休女士將她的3千美元存入銀行。\n從她唯一的銀行賬戶中拿出3千美元存入一個加密火幣平臺，以購買比特幣。她\n她把她的比特幣堅守了8年，賺取了巨大的財富...。",
      "title": "還記得那位在加密貨幣投資中發財的以色列女士（3千美元變成32萬美元），現在她的銀行拒絕給她存錢，因爲銀行說資金來源可能與洗錢或恐怖主義融資有關。"
    }
  ]
}