{
  "author": "BigBootyBear",
  "original_created_utc": 1639230718,
  "title": "Why did the aristocracy bother themselves with so much war when their life was already comfortable?",
  "created_utc": 1639241731,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One could understand why a lowly baron might eye a duchy or why a duke might covert a throne. But why do kings wage war?  If you are a French nobleman in the late middle ages, your estate already provides you with plenty of food, entertainment, luxury, and the opportunity for a mistress or two or even a harem. Why wage war?&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s such a pain in the backside. Some rulers spent most of their lives on the road going from one campaign to the next. Always managing quarreling commanders, military logistics, arduous terrain and various diseases one might get in army camps. Then you endure the stress of desertions, mutiny, and the actual combat part where you and some of your brothers and cousins might die, or you might get captured.&lt;/p&gt;\n\n&lt;p&gt;Why? Why bother? Especially easily defensible countries like Spain or England. Why bother yourself in terrible military campaigns in the pursuit of land gains your dumb ass heirs will probably squander in the future, when you can just lay back in your comfy castle with some wench washing your feet, quelling a peasant rebellion every once in a while and managing court drama.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 229,
  "permalink": "/r/AskHistorians/comments/re07ah/why_did_the_aristocracy_bother_themselves_with_so/",
  "subreddit": "AskHistorians",
  "id": "re07ah",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One could understand why a lowly baron might eye a duchy or why a duke might\ncovert a throne. But why do kings wage war? If you are a French nobleman in the\nlate middle ages, your estate already provides you with plenty of food,\nentertainment, luxury, and the opportunity for a mistress or two or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "下級男爵が公国を狙うのも、公爵が狙うのも理解できる。\n王位を隠蔽する。しかし、なぜ王は戦争をするのだろうか。もしあなたがフランスの貴族で\n中世後期、あなたの領地はすでに十分な食料を供給しています。\n娯楽、贅沢、そして愛人の一人や二人、あるいは......。",
      "title": "貴族の生活は快適だったのに、なぜわざわざ戦争をする必要があったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们可以理解为什么一个卑微的男爵可能会盯上一个公国，或者为什么一个公爵可能会\n隐瞒王位。但为什么国王要发动战争？如果你是中世纪后期的法国贵族\n如果你是中世纪晚期的法国贵族，你的庄园已经为你提供了大量的食物。\n娱乐、奢华，以及拥有一两个情妇的机会，或者......",
      "title": "贵族们的生活已经很舒适了，为什么还要为这么多的战争而烦恼呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們可以理解爲什麼一個卑微的男爵可能會盯上一個公國，或者爲什麼一個公爵可能會\n隱瞞王位。但爲什麼國王要發動戰爭？如果你是中世紀後期的法國貴族\n如果你是中世紀晚期的法國貴族，你的莊園已經爲你提供了大量的食物。\n娛樂、奢華，以及擁有一兩個情婦的機會，或者......",
      "title": "貴族們的生活已經很舒適了，爲什麼還要爲這麼多的戰爭而煩惱呢？"
    }
  ]
}