{
  "author": "ScarWarda",
  "original_created_utc": 1636478948,
  "title": "LRC and Grayscale Consideration from June 17, 2021",
  "created_utc": 1636500728,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So everyone has been excited with Loopring, whether it&#39;s the tech behind the team or the potential partnership that may be coming into play!</p>\n\n<p>Recently it looks like Grayscale investments added LRC as a asset they are considering to add to their investments on June 17, 2021.</p>\n\n<p>We are hitting new ATHs as we speak $2.6, getting more and more visibility from investments funds, retail and institution investors. </p>\n\n<p>Soon enough it will be discussed on more &amp; more business channels, as it is trending in the top searches.</p>\n\n<p>Top cryptos are surging ATH, once that slows down a bit, some people will be taking out profits and reinvesting into different projects, then hopefully we will have even more of a Alt season.</p>\n\n<p>LRC at 3.1 Billion Market cap right now. So definitely room for it to catch up to some of the other coins in the top 10. Especially when the partnership get announced and it will have real use Utility!</p>\n\n<p>Let&#39;s gooooo guys!</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/qq8oxx/lrc_and_grayscale_consideration_from_june_17_2021/",
  "subreddit": "CryptoCurrency",
  "id": "qq8oxx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So everyone has been excited with Loopring, whether it's the tech behind the\nteam or the potential partnership that may be coming into play!\n\nRecently it looks like Grayscale investments added LRC as a asset they are\nconsidering to add to their investments on June 17, 2021.\n\nWe are hitting new ATHs…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "チームの背後にある技術であれ、パートナーシップの可能性であれ、誰もがLoopringに期待を寄せています。\nチームの背後にある技術であろうと、パートナーシップの可能性であろうと\n\n最近では、グレースケール投資が2021年6月17日にLRCを投資対象に加えることを検討しているようです。\n2021年6月17日に投資対象に加えることを検討しています。\n\n私たちは新たなATHを打ち出しています...",
      "title": "2021年6月17日からのLRCとグレースケールに関する考察"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，每个人都对Loopring感到兴奋，无论是该团队背后的技术还是其潜力。\n团队，还是潜在的合作关系，都让人兴奋不已。\n\n最近，看起来灰度投资将LRC作为他们考虑在2021年6月17日加入其投资的一项资产。\n考虑在2021年6月17日添加到他们的投资中。\n\n我们正在冲击新的ATHs...",
      "title": "2021年6月17日的LRC和灰度审议情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，每個人都對Loopring感到興奮，無論是該團隊背後的技術還是其潛力。\n團隊，還是潛在的合作關係，都讓人興奮不已。\n\n最近，看起來灰度投資將LRC作爲他們考慮在2021年6月17日加入其投資的一項資產。\n考慮在2021年6月17日添加到他們的投資中。\n\n我們正在衝擊新的ATHs...",
      "title": "2021年6月17日的LRC和灰度審議情況"
    }
  ]
}