{
  "author": "zutrasimlo",
  "original_created_utc": 1634181330,
  "title": "Thanks to crypto, I must now live in poverty until I die",
  "created_utc": 1634211115,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Normally, I would put money away into a savings plan every month. However I had a strong feeling that crypto will be the next great investment, so every month I put the rest of my paycheck into crypto. The only problem is I can never sell my crypto, only buy. </p>\n\n<p>Unfortunately, I must now live in poverty until until I die because of crypto. I have ramen for breakfast, ramen for lunch, and for dinner I photosynthesize for 30 minutes. I can do whatever I want as long as it doesn’t cost money, and it is all thanks to cryptocurrency.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/q7r7gu/thanks_to_crypto_i_must_now_live_in_poverty_until/",
  "subreddit": "CryptoCurrency",
  "id": "q7r7gu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Normally, I would put money away into a savings plan every month. However I had\na strong feeling that crypto will be the next great investment, so every month I\nput the rest of my paycheck into crypto. The only problem is I can never sell my\ncrypto, only buy.\n\nUnfortunately, I must now live in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "普段は、毎月貯金に回していたお金を しかし、私は\nるような気がしたので、毎月、給料の残りを暗号に投入していました。\n給料の残りを暗号に投入しています。唯一の問題は、自分の暗号を売ることができず、買うことしかできないことです。\n買うことしかできません。\n\n残念ながら、私は今、生活しなければなりません。",
      "title": "暗号のおかげで、私は死ぬまで貧乏暮らしをしなければならない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "通常情况下，我每个月都会把钱存入储蓄计划。然而，我有\n有一种强烈的感觉，加密货币将是下一个伟大的投资，所以每个月我都会把工资的剩余部分投入加密货币。\n把我工资的其余部分投入加密货币。唯一的问题是我永远不能卖掉我的\n的加密货币，只能购买。\n\n不幸的是，我现在必须生活在...",
      "title": "多亏了加密货币，我现在必须生活在贫困中，直到我死。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通常情況下，我每個月都會把錢存入儲蓄計劃。然而，我有\n有一種強烈的感覺，加密貨幣將是下一個偉大的投資，所以每個月我都會把工資的剩餘部分投入加密貨幣。\n把我工資的其餘部分投入加密貨幣。唯一的問題是我永遠不能賣掉我的\n的加密貨幣，只能購買。\n\n不幸的是，我現在必鬚生活在...",
      "title": "多虧了加密貨幣，我現在必鬚生活在貧困中，直到我死。"
    }
  ]
}