{
  "author": "AskScienceModerator",
  "original_created_utc": 1648724405,
  "title": "AskScience AMA Series: We're Hayden Reeve, Steve Widergren, and Robert Pratt from Pacific Northwest National Laboratory, and we study the power grid. We recently found using a transactive energy system could save U.S. consumers over $50 billion annually on their electrical bills. Ask us anything!",
  "created_utc": 1648738982,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello Reddit, Hayden Reeve, Steve Widergren, and Robert Pratt here. Our team of energy experts study the U.S. power grid, looking at ways to modernize it and make it more stable and reliable. We&amp;#39;re not fans of brownouts. Recently, we conducted the largest simulation of its kind to determine how a transactive energy approach would affect the grid, operators, utilities, and consumers. In a transactive energy system, the power grid, homes, commercial buildings, etc. are in constant contact. Smart devices receive a forecast of energy prices at various times of day and develop a strategy to meet consumer preferences while reducing cost and overall electricity demand. Our study concluded consumers stand to save about 15 percent on their annual electric bill and peak loads would be reduced by 9 to 15 percent. We&amp;#39;ll be on at 2:00 PM Pacific (5 PM ET, 21:00 UT) to answer your questions.&lt;/p&gt;\n\n&lt;p&gt;You can read our full report on our &lt;a href=\"https://www.pnnl.gov/projects/transactive-systems-program/dsot-study\"&gt;Transactive Systems website&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/PNNL\"&gt;/u/PNNL&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/askscience/comments/tsx7w9/askscience_ama_series_were_hayden_reeve_steve/",
  "subreddit": "askscience",
  "id": "tsx7w9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello Reddit, Hayden Reeve, Steve Widergren, and Robert Pratt here. Our team of\nenergy experts study the U.S. power grid, looking at ways to modernize it and\nmake it more stable and reliable. We're not fans of brownouts. Recently, we\nconducted the largest simulation of its kind to determine how a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、RedditのHayden Reeve、Steve Widergren、そしてRobert Prattです。私たちのチームは\nエネルギーの専門家は、米国の電力網を研究し、近代化するための方法を検討しています。\nより安定した信頼性の高いものにするためです。私たちは、ブラウンアウト（電圧低下）を好みません。最近、私たちは\nこの種のものとしては最大規模のシミュレーションを実施し、...",
      "title": "AskScience AMAシリーズ。私たちはパシフィック・ノースウエスト国立研究所のヘイデン・リーヴ、スティーブ・ウィダーグレン、ロバート・プラットで、送電網を研究しています。私たちは最近、トランザクティブ・エネルギー・システムを使用することで、米国の消費者の電気料金を年間500億ドル以上節約できることを発見しました。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好Reddit，我是Hayden Reeve，Steve Widergren和Robert Pratt。我们的团队\n我们的能源专家团队研究美国的电网，研究如何使其现代化并使其更加稳定和可靠。\n使其更加稳定和可靠。我们不喜欢断电。最近，我们\n我们进行了最大规模的模拟，以确定如何使电网更加稳定。",
      "title": "AskScience AMA系列。我们是来自太平洋西北国家实验室的Hayden Reeve, Steve Widergren和Robert Pratt，我们研究电网。我们最近发现使用交互式能源系统可以为美国消费者每年节省超过500亿美元的电费。向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好Reddit，我是Hayden Reeve，Steve Widergren和Robert Pratt。我們的團隊\n我們的能源專家團隊研究美國的電網，研究如何使其現代化並使其更加穩定和可靠。\n使其更加穩定和可靠。我們不喜歡斷電。最近，我們\n我們進行了最大規模的模擬，以確定如何使電網更加穩定。",
      "title": "AskScience AMA系列。我們是來自太平洋西北國家實驗室的Hayden Reeve, Steve Widergren和Robert Pratt，我們研究電網。我們最近發現使用交互式能源系統可以爲美國消費者每年節省超過500億美元的電費。向我們提出任何問題!"
    }
  ]
}