{
  "author": "AskScienceModerator",
  "original_created_utc": 1648724405,
  "title": "AskScience AMA Series: We're Hayden Reeve, Steve Widergren, and Robert Pratt from Pacific Northwest National Laboratory, and we study the power grid. We recently found using a transactive energy system could save U.S. consumers over $50 billion annually on their electrical bills. Ask us anything!",
  "created_utc": 1648738982,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello Reddit, Hayden Reeve, Steve Widergren, and Robert Pratt here. Our team of energy experts study the U.S. power grid, looking at ways to modernize it and make it more stable and reliable. We&amp;#39;re not fans of brownouts. Recently, we conducted the largest simulation of its kind to determine how a transactive energy approach would affect the grid, operators, utilities, and consumers. In a transactive energy system, the power grid, homes, commercial buildings, etc. are in constant contact. Smart devices receive a forecast of energy prices at various times of day and develop a strategy to meet consumer preferences while reducing cost and overall electricity demand. Our study concluded consumers stand to save about 15 percent on their annual electric bill and peak loads would be reduced by 9 to 15 percent. We&amp;#39;ll be on at 2:00 PM Pacific (5 PM ET, 21:00 UT) to answer your questions.&lt;/p&gt;\n\n&lt;p&gt;You can read our full report on our &lt;a href=\"https://www.pnnl.gov/projects/transactive-systems-program/dsot-study\"&gt;Transactive Systems website&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/PNNL\"&gt;/u/PNNL&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/askscience/comments/tsx7w9/askscience_ama_series_were_hayden_reeve_steve/",
  "subreddit": "askscience",
  "id": "tsx7w9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello Reddit, Hayden Reeve, Steve Widergren, and Robert Pratt here. Our team of\nenergy experts study the U.S. power grid, looking at ways to modernize it and\nmake it more stable and reliable. We're not fans of brownouts. Recently, we\nconducted the largest simulation of its kind to determine how a…"
}