{
  "author": "gintdm",
  "the_new_excerpt": "Hello Traders and Investors! An exciting week ahead of us, here is my weekly\nnewsletter which I share every Monday to help prepare you for the week! Feel\nfree to DM me and happy trades!\n\nWeek of 4/26/21\n\nThe S&P500 opened Monday 4/26/21 at 4185.03, above the previous close of 4180.05\non Friday…",
  "original_created_utc": 1619450615,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トレーダーと投資家の皆様、こんにちは。今週はエキサイティングな一週間になりそうですね！私の週刊ニュースレターをご紹介します。\n毎週月曜日にお届けしているニュースレターで、今週の準備をしてみませんか？お気軽に\nお気軽にご連絡ください。\n\n4/26/21の週\n\n4/26/21（月）のS&P500は4185.03で始まり、前回の終値である4180.05を上回りました。\n金曜日の",
      "title": "What's Happening in the Markets: 2021年4月26日の週"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "交易员和投资者大家好! 激动人心的一周即将到来，这里是我的每周\n通讯，我每周一都会分享，以帮助您为本周做好准备! 欢迎\n欢迎给我发邮件，祝你交易愉快!\n\n4/26/21周\n\n周一4/26/21，标准普尔500指数以4185.03点开盘，高于上周五4180.05点的收盘价。\n上周五...",
      "title": "市场上正在发生的事情。2021年4月26日的一周"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "交易員和投資者大家好! 激動人心的一週即將到來，這裏是我的每週\n通訊，我每週一都會分享，以幫助您爲本週做好準備! 歡迎\n歡迎給我發郵件，祝你交易愉快!\n\n4/26/21周\n\n週一4/26/21，標準普爾500指數以4185.03點開盤，高於上週五4180.05點的收盤價。\n上週五...",
      "title": "市場上正在發生的事情。2021年4月26日的一週"
    }
  ],
  "title": "What's Happening in the Markets: Week of 4/26/2021",
  "created_utc": 1619499599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello Traders and Investors! An exciting week ahead of us, here is my weekly newsletter which I share every Monday to help prepare you for the week! Feel free to DM me and happy trades!</p>\n\n<p><strong>Week of 4/26/21</strong></p>\n\n<p>The S&amp;P500 opened Monday 4/26/21 at 4185.03, above the previous close of 4180.05 on Friday 4/23/21.</p>\n\n<p>Chip manufacturers have been inundated with demand following 2020’s COVID shutdowns and the, undoubtedly correlated, increase in demand for consumer electronics. Cisco, one of the world’s largest chip manufacturers, is struggling to keep up with demand.</p>\n\n<p>Cisco revealed several steps it is taking to alleviate the imbalance in supply and demand including a $4.5 billion acquisition of Acacia Communications and a $20 billion plan to build two new manufacturing plants in Arizona. Cisco CEO Chuck Robbins commented extensively on the situation, and estimates it could “...[take] another six months…” for the company to resume normal operation. Around 85% of all internet traffic passes through Cisco hardware.</p>\n\n<p>The effects of the shortage can be seen across industries. Among companies affected by the shortage are car manufacturers. Wayne Griffiths, head of VW’s Spanish brand, spoke on the issue, stating that the company will, “...need to face considerable challenges in the second quarter…” So far the shortage has prevented the company from building over 100,000 vehicles.</p>\n\n<p>The United States Government has also expressed concern regarding the chip shortage. United States President Joe Biden held a conference with business leaders earlier this month to address the issue. During the conference the President expressed a desire to move more chip manufacturing into American plants, citing 75% of global manufacturing as being based in East Asia.<br/>\nMeanwhile Taiwan-based chip manufacturing giant TSMC has announced a plan worth $100 billion USD to expand their companies manufacturing capacity. The announcement comes in tandem with company founder Morris Chang’s plea to the Taiwanese government for increased support, citing a fear that if the Taiwan-based manufacturer fails to meet demand US or Chinese manufacturers will fill the gap.</p>\n\n<p>The increase in demand for electronics caused by the pandemic has boded well for Apple, who reports earnings on Wednesday. Analysts are looking for the technology giant to post earnings of $0.98 on revenue of $77 billion after a strong Q2 for sales. The earnings call comes on the heels of Apple’s first product showcase of the year last Wednesday, and the company’s announcement that it will be taking steps to increase its footing in the instant messaging market. Apple stated it plans to increase the amount of features provided by it’s iMessage app, with the objective being to bring it more in line with popular messengers offered by Facebook, WhatsApp, and Snapchat.</p>\n\n<p>Microsoft will report earnings Tuesday. Analyst estimates place earnings around $1.78 per share over $43 billion in revenue. Microsoft, who also saw an increase in demand for its technology as a result of the pandemic, has greatly benefitted from an increased demand for cloud-services. Microsoft’s cloud-based service hub, Azure, posted 2020 growth of 43%. The company expects to post great earnings despite the current chip-shortage, having generated much of its growth from the pandemic in the software-as-a-service sector.</p>\n\n<p>Executives from Facebook, Twitter, and Youtube will testify before a U.S. Senate Judiciary hearing committee on Tuesday. The executives have been called to testify on the use of algorithms to dictate what consumers watch and read on the popular platforms. The hearing comes amid concerns that manipulative practices have led to massive distribution of misinformation, with repercussions that reverberate throughout society. The practice of purposefully serving consumers misinformation has been dubbed “algorithmic amplification,” and the results of the hearings could have a significant impact on the social media industry. All three companies will report earnings this week.</p>\n\n<p>OPEC will hold its opening session Wednesday. The conference will take place over the course of the day, and will include remarks from prominent Russian and Saudi chairman. The conference is meant to be informative and expected to feature little remark on policy. However speculation that additional information on a potential NOPEC bill could have an impact on U.S. trading. The conference comes one day before North American oil giants Exxon and Shell report earnings.</p>\n\n<p>Federal Reserve Chairman Jerome Powell will hold a press conference at 2:30PM Wednesday. Powell’s recent statements at press conferences have highlighted an economy which although largely recovered, still faces a degree of risk in the face of the pandemic. Powell stated in an April 11th CBS interview, “The principal risk to our economy right now really is that the disease would spread again more quickly.” Powell’s comments come a day before advanced release of the Q1 U.S. GDP, which Bank of America analysts predict will show a real growth rate of 6.5%.</p>\n\n<p><strong>Some of the Companies with Earnings this Week</strong></p>\n\n<p><strong>Monday, April 26th:</strong><br/>\nAmong others, Tesla (TSLA) will hold earnings calls today. Tesla looks to top analyst estimates of $0.75 EPS on $10.5 billion in revenue after a successful quarter for delivery numbers in the face of the ongoing chip shortage.</p>\n\n<p><strong>Tuesday, April 27th:</strong><br/>\nMicrosoft<br/>\nGoogle<br/>\nStarbucks<br/>\nGeneral Electric<br/>\nVisa<br/>\nAMD<br/>\nCapital One<br/>\nUBS<br/>\nHasbro<br/>\n<strong>Wednesday, April 28th:</strong><br/>\nApple<br/>\nSony<br/>\nFacebook<br/>\nShopify<br/>\nEbay<br/>\nFord<br/>\nQualcomm<br/>\nBoeing<br/>\nGeneral Dynamics<br/>\nRockwell Automation<br/>\nRaymond James Financial Inc</p>\n\n<p><strong>Thursday, April 29th:</strong><br/>\nAmazon<br/>\nSamsung<br/>\nMastercard<br/>\nComcast<br/>\nMcDonald&#39;s<br/>\nShell<br/>\nCaterpillar<br/>\nNorthrop Grumman Corp<br/>\nTwitter<br/>\nNewmont Mining Corp<br/>\nDr. Pepper Snapple Group<br/>\nThe Hershey Co<br/>\nWestern Digital<br/>\nLogitech</p>\n\n<p><strong>Friday, April 30th:</strong><br/>\nAlibaba<br/>\nExxon<br/>\nChevron<br/>\nCharter Communications</p>\n</div><!-- SC_ON -->",
  "score": 39,
  "permalink": "/r/stocks/comments/mz05wl/whats_happening_in_the_markets_week_of_4262021/",
  "subreddit": "stocks",
  "id": "mz05wl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216001
}