{
  "author": "AskScienceModerator",
  "original_created_utc": 1636977651,
  "title": "AskScience AMA Series: I'm a wildlife ecologist who's spent 15 years studying threatened mammals all around the world - AMA!",
  "created_utc": 1636983516,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, I&#39;m Dr. Rae-Wynn Grant, a wildlife ecologist with an expertise in uncovering how human activity influences carnivore behavior and ecology. I have been studying the world&#39;s most threatened mammals for more than 15 years across six of the seven continents.</p>\n\n<p>I received a B.S. in Environmental Studies from <a href=\"http://envs.emory.edu/home/\">Emory University</a>, a M.S. in Environmental Studies from <a href=\"http://environment.yale.edu/\">Yale University</a>, and a Ph.D. in Ecology and Evolution from <a href=\"http://e3b.columbia.edu/\">Columbia University</a>. I am currently a Research Faculty member at the <a href=\"https://bren.ucsb.edu/\">Bren School of Environmental Science and Management</a> leading carnivore research on the <a href=\"https://www.nature.org/en-us/about-us/where-we-work/united-states/california/stories-in-california/dangermond-preserve/\">Jack and Laura Dangermond Preserve</a>. I am also a <a href=\"https://www.nationalgeographic.org/projects/explorers/rae-wynn-grant/\">National Geographic Explorer</a>, and a Visiting Scientist at the <a href=\"http://amnh.org/\">American Museum of Natural History</a>.</p>\n\n<p>My latest venture is a podcast from PBS Nature called &quot;<a href=\"https://www.pbs.org/wnet/nature/podcast/\">Going Wild with Dr. Rae Wynn-Grant</a>.&quot; In it I tell my stories from the field, from encountering giraffe poachers while tracking lion cubs in Tanzania, to discovering never-before-seen population of the world&#39;s most endangered lemur in Madagascar, to giving CPR to a hibernating black bear in Minnesota. My hope is to encourage the next generation of wildlife ecologists. Listen <a href=\"https://podcasts.apple.com/us/podcast/going-wild-with-dr-rae-wynn-grant/id1583296781\">here</a> or wherever you get your podcasts.</p>\n\n<p>I&#39;ll be on at 11 am PST/2 pm EST/19 UT to answer your questions. Ask me anything!</p>\n\n<p>Username: <a href=\"/u/Hrae_wg21\">/u/Hrae_wg21</a></p>\n</div><!-- SC_ON -->",
  "score": 122,
  "permalink": "/r/askscience/comments/quev3l/askscience_ama_series_im_a_wildlife_ecologist/",
  "subreddit": "askscience",
  "id": "quev3l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone, I'm Dr. Rae-Wynn Grant, a wildlife ecologist with an expertise in\nuncovering how human activity influences carnivore behavior and ecology. I have\nbeen studying the world's most threatened mammals for more than 15 years across\nsix of the seven continents.\n\nI received a B.S. in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はレイ・ウィン・グラント博士と申します。\n人間の活動が肉食動物の行動や生態にどのような影響を与えているかを明らかにしています。私は\n世界で最も絶滅の危機に瀕している哺乳類を15年以上にわたり、七つの大陸のうち6つの大陸で研究してきました。\n世界で最も絶滅の危機に瀕している哺乳類を15年以上にわたり、7大陸のうち6大陸で研究しています。\n\n学士号は...",
      "title": "AskScience AMAシリーズ。私は野生動物の生態学者で、15年かけて世界中の絶滅危惧種の哺乳類を調査しています - AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我是Rae-Wynn Grant博士，是一名野生动物生态学家，擅长于\n揭示人类活动如何影响食肉动物的行为和生态学。我已经\n15年来，我一直在研究世界上最受威胁的哺乳动物。\n15年来，我一直在研究世界上最受威胁的哺乳动物，遍及七大洲中的六大洲。\n\n我在美国获得学士学位。",
      "title": "AskScience AMA系列。我是一名野生动物生态学家，花了15年时间研究世界各地受威胁的哺乳动物 - AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我是Rae-Wynn Grant博士，是一名野生動物生態學家，擅長於\n揭示人類活動如何影響食肉動物的行爲和生態學。我已經\n15年來，我一直在研究世界上最受威脅的哺乳動物。\n15年來，我一直在研究世界上最受威脅的哺乳動物，遍及七大洲中的六大洲。\n\n我在美國獲得學士學位。",
      "title": "AskScience AMA系列。我是一名野生動物生態學家，花了15年時間研究世界各地受威脅的哺乳動物 - AMA!"
    }
  ]
}