{
  "author": "0_0singulariTy",
  "the_new_excerpt": ".... I've been diagnosed with a terminal illness last year (around march i\nguess) ..only my parents and few family members know about this.... I would die\nin a year or sooner (according to my recent medical reports)\n\nNone of my friends know about this... And these are the guys i went college\nwith.…",
  "original_created_utc": 1623852418,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": ".... 私は去年の3月頃に末期の病気と診断されました。\nこのことを知っているのは、私の両親と数人の家族だけです.... 私が死ぬのは\n1年以内に死ぬと思います（最近の診断書によると）。\n\n友達は誰もこのことを知りません...。そして、これは私の大学時代の友人たちです。\nでした。....",
      "title": "自分が死ぬことを友人にどうやって伝えればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": ".... 我去年被诊断出患有绝症（大约在3月）。\n...只有我的父母和少数家人知道这件事.... 我将在\n在一年内或更快（根据我最近的医疗报告）。\n\n我的朋友们都不知道这件事...。这些人是我的大学同学\n与....",
      "title": "我如何告诉我的朋友我已经死了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": ".... 我去年被診斷出患有絕症（大約在3月）。\n...只有我的父母和少數家人知道這件事.... 我將在\n在一年內或更快（根據我最近的醫療報告）。\n\n我的朋友們都不知道這件事...。這些人是我的大學同學\n與....",
      "title": "我如何告訴我的朋友我已經死了？"
    }
  ],
  "title": "How do i tell my friends that am dieing?",
  "created_utc": 1623872635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>.... I&#39;ve been diagnosed with a terminal illness last year (around march i guess) ..only my parents and few family members know about this.... I would die in a year or sooner (according to my recent medical reports)</p>\n\n<p>None of my friends know about this... And these are the guys i went college with. For the past 4 years All my beautiful and good memories are with them. But for some reason i couldn&#39;t get my self to telling them that am dying... This is the last month of our college... Shld i tell them? ... If yes how.. Idk how... Like &quot;hey guys... I know we thought we would be frnds forever... Too bad am dying&quot;... Or shld i just keep it a secret and they&#39;ll know when am dead.</p>\n\n<p>I don&#39;t even know what flair to add to this post.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/o15puc/how_do_i_tell_my_friends_that_am_dieing/",
  "subreddit": "TooAfraidToAsk",
  "id": "o15puc",
  "is_self": true,
  "media": null,
  "is_video": false
}