{
  "author": "CommunicationNo3845",
  "original_created_utc": 1646933073,
  "title": "The fact that Cardano was in 3rd place without smart contracts proves how much this market is driven by hype.",
  "created_utc": 1646944774,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;No I’m not here to sh#t on Cardano, I’m just trying to show how much hype is important in this market.&lt;/p&gt;\n\n&lt;p&gt;At some point in time, Cardano was 3rd place in market capitalization behind Ethereum and Bitcoin, yet it still didn’t even have smart contracts compared to Ethereum which already had them perfected a long beforehand.&lt;/p&gt;\n\n&lt;p&gt;I like Cardano a lot don’t get me wrong, butI just feel like they’re very slow with development especially compared to other chains like Polygon for example.&lt;/p&gt;\n\n&lt;p&gt;If anything, Polygon is WAY younger than Cardano yet it still managed to get 7000+ fully functioning dApps on board a lot of which are of very high quality actually. And quiet honestly, I think a project like Polygon is more deserving of slot at the top.&lt;/p&gt;\n\n&lt;p&gt;Cardano has &lt;strong&gt;A LOT&lt;/strong&gt; of potential if only they improve their development timing. But for the current performance, I just think they’re very overhyped. That’s just my personal take though.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 357,
  "permalink": "/r/CryptoCurrency/comments/tb3s3n/the_fact_that_cardano_was_in_3rd_place_without/",
  "subreddit": "CryptoCurrency",
  "id": "tb3s3n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "No I’m not here to sh#t on Cardano, I’m just trying to show how much hype is\nimportant in this market.\n\nAt some point in time, Cardano was 3rd place in market capitalization behind\nEthereum and Bitcoin, yet it still didn’t even have smart contracts compared to\nEthereum which already had them…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いや、私はカルダノを非難するためにここにいるわけではありません。\nこの市場では重要です。\n\nある時期には カルダノは時価総額で 3位になりました\nイーサリアムとビットコインに比べ、スマートコントラクトもまだ搭載されていない。\nイーサリアムはすでに持っていたのに...。",
      "title": "スマートコントラクトなしでカルダノが3位になったことは、この市場がいかに誇大広告で動いているかを証明している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不，我不是要在这里诋毁Cardano，我只是想表明，在这个市场上，炒作是多么的重要\n在这个市场的重要性。\n\n在某个时间点上，Cardano的市值排在第三位，仅次于以太坊和比特币。\n以太坊和比特币，但它甚至还没有智能合约，相比之下\n以太坊已经有了智能合约......",
      "title": "Cardano在没有智能合约的情况下排在第三位，这证明了这个市场在多大程度上被炒作所驱动。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不，我不是要在這裏詆譭Cardano，我只是想表明，在這個市場上，炒作是多麼的重要\n在這個市場的重要性。\n\n在某個時間點上，Cardano的市值排在第三位，僅次於以太坊和比特幣。\n以太坊和比特幣，但它甚至還沒有智能合約，相比之下\n以太坊已經有了智能合約......",
      "title": "Cardano在沒有智能合約的情況下排在第三位，這證明了這個市場在多大程度上被炒作所驅動。"
    }
  ]
}