{
  "author": "DM_ur_Hairy_Beaver",
  "the_new_excerpt": "2020 was an unprecedented year. New investors (of which there are tens of\nmillions now) need to know that on average the return of the market is around\n10% (it ranges from 7%-11% depending on your metric, but for simplicities sake\nwe'll average it to 10%).\n\nIf you have gone beyond that 10%, that is…",
  "original_created_utc": 1620324579,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2020年は空前絶後の年でした。新しい投資家（今は何千万人もいる）は、市場の平均的なリターンが約1億円であることを知る必要があります。\n新しい投資家（今は何千万人もいる）は、市場の平均的なリターンが約10％であることを知る必要がある。\n10％であることを知る必要があります（指標によって7～11％の幅がありますが、単純化のために\nここでは平均して10％とします）。)\n\nもし、その10％を超えてしまったら、それは...。",
      "title": "新しい投資家の方へ 株式市場の平均的なリターンは、長期的には年率10％です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2020年是史无前例的一年。新的投资者（现在有数千万的\n新投资者（现在有数千万人）需要知道，市场的平均回报率约为\n10%（根据你的衡量标准，它的范围是7%-11%，但为了简单起见\n我们将其平均为10%）。)\n\n如果你已经超过了这个10%，那就是...",
      "title": "新的投资者。随着时间的推移，股票市场的平均回报率为每年10%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2020年是史無前例的一年。新的投資者（現在有數千萬的\n新投資者（現在有數千萬人）需要知道，市場的平均回報率約爲\n10%（根據你的衡量標準，它的範圍是7%-11%，但爲了簡單起見\n我們將其平均爲10%）。)\n\n如果你已經超過了這個10%，那就是...",
      "title": "新的投資者。隨着時間的推移，股票市場的平均回報率爲每年10%。"
    }
  ],
  "title": "New Investors: The average return of the stock market is 10% per year over time.",
  "created_utc": 1620335826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>2020 was an unprecedented year. New investors (of which there are tens of millions now) need to know that on average the return of the market is around 10% (it ranges from 7%-11% depending on your metric, but for simplicities sake we&#39;ll average it to 10%).</p>\n\n<p>If you have gone beyond that 10%, that is a good thing, but it is not the average, and in the long term few investors beat the market as time goes on. Generally, beating the market is an anomaly and hard to replicate over 10 and 20 year periods.</p>\n\n<p>I think as a whole investors have been spoiled by the last year. The market was so awash with cash (and continues to be) from FED action that a monkey could throw darts at a board and make a lot of money.</p>\n\n<p>I make this post only to say that for newer investors, those who have been investing just in the last few years, don&#39;t be disappointed when your performance doesn&#39;t match that of 2020. As far as statistical returns show us, that was far and away an anomaly.</p>\n\n<p>I think it&#39;s prudent to temper your expectations. I don&#39;t mean sell, I don&#39;t mean you won&#39;t beat the market in the future, I just mean to say temper your expectations so that you don&#39;t become disenchanted with investing as time goes on. If you beat 10% in your portfolio it is a GOOD thing. However, expecting 30%-500% growth in less than a year is only going to make you feel disappointed when your stocks don&#39;t meet that expectation.</p>\n\n<p>Keep your head high, stay invested, let your investments compound, just don&#39;t be saddened when your returns are at or slightly below average moving forward. You&#39;re still doing better than those that don&#39;t invest at all.</p>\n</div><!-- SC_ON -->",
  "score": 2808,
  "permalink": "/r/stocks/comments/n6dl5x/new_investors_the_average_return_of_the_stock/",
  "subreddit": "stocks",
  "id": "n6dl5x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995610
}