{
  "author": "Loose-Imagination781",
  "original_created_utc": 1629762469,
  "title": "Top 3 Undervalued Cryptos: XLM, Nano, Monero",
  "created_utc": 1629797562,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>XLM is efficient, makes more transactions a day than Bitcoin or Ethereum and is used widely to move funds at an extremely low transaction cost in a matter of seconds. Also has smart contracts and NFTs.</p>\n\n<p>Nano is also very efficient, has an innovative voting system, can move funds for free nearly instantly and has a cool community.</p>\n\n<p>Monero might not be as efficient as XLM or Nano, but has an encrypted blockchain, meaning that no one can see who you send Monero or how much you hold. An absolutist privacy solution where it leads in.</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/pabsxd/top_3_undervalued_cryptos_xlm_nano_monero/",
  "subreddit": "CryptoCurrency",
  "id": "pabsxd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "XLM is efficient, makes more transactions a day than Bitcoin or Ethereum and is\nused widely to move funds at an extremely low transaction cost in a matter of\nseconds. Also has smart contracts and NFTs.\n\nNano is also very efficient, has an innovative voting system, can move funds for\nfree nearly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "XLMは効率的で、ビットコインやイーサリアムよりも1日に多くの取引が行われます。\n極めて低い取引コストで数秒のうちに資金を移動させるために広く使用されています。\n数秒で極めて低い取引コストで資金を移動させるために広く使用されています。また、スマートコントラクトやNFTも備えています。\n\nNanoも非常に効率的で、革新的な投票システムを持ち、以下のようなコストで資金を動かすことができます。\nほとんど無料で...",
      "title": "過小評価されている暗号のトップ3。XLM、Nano、Monero"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "XLM效率高，每天的交易量比比特币或以太坊还多，而且被广泛使用。\n被广泛用于在几秒钟内以极低的交易成本转移资金。\n秒内完成资金转移。也有智能合约和NFTs。\n\nNano也非常高效，有一个创新的投票系统，可以免费移动资金。\n免费的，几乎...",
      "title": "价值被低估的三大加密货币。XLM, Nano, Monero"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "XLM效率高，每天的交易量比比特幣或以太坊還多，而且被廣泛使用。\n被廣泛用於在幾秒鐘內以極低的交易成本轉移資金。\n秒內完成資金轉移。也有智能合約和NFTs。\n\nNano也非常高效，有一個創新的投票系統，可以免費移動資金。\n免費的，幾乎...",
      "title": "價值被低估的三大加密貨幣。XLM, Nano, Monero"
    }
  ]
}