{
  "author": "tinyflyinggiraffe",
  "original_created_utc": 1645470416,
  "title": "Why do some consider it not racist for a black person on a dating app to express race-based preferences when it is patently racist for a white person to do so?",
  "created_utc": 1645519791,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Mid-30s, white, liberal, gay male living in a US east coast city here. I ask this knowing full well how controversial and fraught conversations like this can be but I ask earnestly wishing to understand and hear what you all have to say. &lt;/p&gt;\n\n&lt;p&gt;I have seen a surprising number of gay dating app profiles with racial preferences listed. Some white men (mostly in more rural settings) will say things like &amp;#39;no blacks or latinos&amp;#39; or &amp;#39;only attracted to white men.&amp;#39; Some black men will say &amp;#39;black men only&amp;#39; or &amp;#39;no whites.&amp;#39; On one sad level, it is not all that shocking since the gay community has a tragic habit of carving up or fetishizing all sorts of physical attributes. On the other hand, the likelihood that these expressed interests have more to do with biases/preconceptions based on race rather than aesthetic preference alone is so obvious and unfortunate to me. I don&amp;#39;t understand why anyone would feel the need to include something so inflammatory on their profile. I recently brought this up with a black friend of mine in a conversation about racism in the US and I was surprised to hear him say that it wasn&amp;#39;t racist for a black man to express race-based preferences because it wasn&amp;#39;t possible to be racist as a victim of systemic oppression (or something to this effect - I may be muddling his argument). More recently, I got into a conversation with a black man on a dating app who, after a pleasant and neutral conversation, told me he wasn&amp;#39;t interested in white men and that I should stick to my own race. After a few more comments from him (e.g. &amp;quot;I have no reason to trust white people,&amp;quot; &amp;quot;some of you say X but then treat us like Y,&amp;quot; &amp;quot;half of you fetishize us and the other half ignore us,&amp;quot; &amp;quot;most black men don&amp;#39;t want white guys,&amp;quot; etc.) I told him he seemed to be making sweeping, race-based assumptions about people likely based on bad past experiences and he got furious with me.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m posting this because this most recent exchange has stuck with me. Why would judgements about an individual&amp;#39;s attractiveness, intelligence, experiences, motives, opinions, etc based on their race not be equally racist regardless of the race of the person making them? At the end of the day, I just want to be a compassionate, open-minded, open-hearted individual who treats everyone with equal respect. So please, help me to better understand this situation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/sy1jji/why_do_some_consider_it_not_racist_for_a_black/",
  "subreddit": "TooAfraidToAsk",
  "id": "sy1jji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Mid-30s, white, liberal, gay male living in a US east coast city here. I ask\nthis knowing full well how controversial and fraught conversations like this can\nbe but I ask earnestly wishing to understand and hear what you all have to say.\n\nI have seen a surprising number of gay dating app profiles…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "30代半ば、白人、リベラル、ゲイ男性、アメリカ東海岸の都市に住んでいるのはここ。質問\nこのような会話がいかに物議をかもし出しやすいか、十分承知しています。\nしかし、皆さんの意見を理解し、聞きたいと思い、真剣に質問します。\n\nゲイの出会い系アプリのプロフィールを見ていると、意外と多いのが...。",
      "title": "白人がそうするのは明らかに人種差別的なのに、なぜ出会い系アプリで黒人が人種に基づく嗜好を表明するのは人種差別的ではないと考える人がいるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "30多岁，白人，自由主义者，男同性恋者，住在美国东海岸的一个城市。我问\n清楚地知道这样的对话有多大的争议性，有多大的问题。\n但我恳切地问，希望能理解并听到大家的意见。\n\n我看到了数量惊人的同性恋约会应用程序配置文件...",
      "title": "为什么有些人认为一个黑人在约会软件上表达基于种族的偏好不是种族主义，而一个白人这样做显然是种族主义的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "30多歲，白人，自由主義者，男同性戀者，住在美國東海岸的一個城市。我問\n清楚地知道這樣的對話有多大的爭議性，有多大的問題。\n但我懇切地問，希望能理解並聽到大家的意見。\n\n我看到了數量驚人的同性戀約會應用程序配置文件...",
      "title": "爲什麼有些人認爲一個黑人在約會軟件上表達基於種族的偏好不是種族主義，而一個白人這樣做顯然是種族主義的？"
    }
  ]
}