{
  "author": "Gapplesauce37",
  "original_created_utc": 1648020971,
  "title": "Why were ancient Greek philosophers so deeply concerned about virtue, wisdom and ethics?",
  "created_utc": 1648059331,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Lately I have been reading about Stoicism and &amp;quot;life according to nature&amp;quot; in the context of Ancient Greek and Roman philosophers. A great deal of classical philosophy regarding reason and ethics was written by ancient Greeks, but why were they obsessed with virtue, wisdom and ethics? From the way some describe it, it seems as though ancient thinkers had a deathly fear of being idle, indulgent and bestial. Why did these philosophers strain to live as virtuously as possible? Why were they so afraid of being unethical? Surely virtuous actions would serve fellow citizens in a civilized society, but why did they think it mattered if they didn&amp;#39;t believe in an explicitly rewarding/punishing afterlife such as heaven/hell in the midst of reason? Why not then indulge and be unethical if the result is non-existence in death?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/tkomhy/why_were_ancient_greek_philosophers_so_deeply/",
  "subreddit": "AskHistorians",
  "id": "tkomhy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Lately I have been reading about Stoicism and \"life according to nature\" in the\ncontext of Ancient Greek and Roman philosophers. A great deal of classical\nphilosophy regarding reason and ethics was written by ancient Greeks, but why\nwere they obsessed with virtue, wisdom and ethics? From the way…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ストイシズムと「自然に従う生き方」について読んでいます。\n古代ギリシャ・ローマの哲学者たちの文脈で。古典の多くは\n理性や倫理に関する哲学は、古代ギリシャ人によって書かれました。\n彼らは美徳、知恵、倫理にこだわっていたのでしょうか？その方法から...",
      "title": "古代ギリシャの哲学者たちは、なぜ美徳や知恵、倫理について深く考えていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我一直在阅读关于斯多葛主义和 \"顺应自然的生活 \"的文章。\n古希腊和罗马哲学家的背景。大量的古典\n关于理性和伦理的大量古典哲学是由古希腊人写的，但为什么\n他们为什么对美德、智慧和道德如此痴迷？来自于...",
      "title": "为什么古希腊哲学家对美德、智慧和道德有如此深刻的关注？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我一直在閱讀關於斯多葛主義和 \"順應自然的生活 \"的文章。\n古希臘和羅馬哲學家的背景。大量的古典\n關於理性和倫理的大量古典哲學是由古希臘人寫的，但爲什麼\n他們爲什麼對美德、智慧和道德如此癡迷？來自於...",
      "title": "爲什麼古希臘哲學家對美德、智慧和道德有如此深刻的關注？"
    }
  ]
}