{
  "author": "blorl03848",
  "the_new_excerpt": "And not just “in love” like love at first sight or the norm of kissing someone\nwithin 3 weeks of dating. Is it normal to not even have the desire to kiss\nsomeone you like until you know them for a long time (maybe even a year atleast)\nand trust them fully? I don’t feel any desire to do anything…",
  "original_created_utc": 1610601898,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "而不是像一见钟情那样的 \"恋爱\"，也不是亲吻别人的标准\n在约会的3周内。是正常的，甚至没有欲望亲吻。\n相识多年的人儿\n并完全信任他们？我不觉得有任何欲望去做任何事情... ...",
      "title": "在没有爱上一个人，没有真正了解他之前，不渴望身体/性的亲密关系是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而不是像一見鍾情那樣的 \"戀愛\"，也不是親吻別人的標準\n在約會的3周內。是正常的，甚至沒有慾望親吻。\n相識多年的人兒\n並完全信任他們？我不覺得有任何慾望去做任何事情... ...",
      "title": "在沒有愛上一個人，沒有真正瞭解他之前，不渴望身體/性的親密關係是正常的嗎？"
    }
  ],
  "title": "Is it normal not to desire physical/sexual intimacy until you’re in love with someone and know them really well?",
  "created_utc": 1610658043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And not just “in love” like love at first sight or the norm of kissing someone within 3 weeks of dating. Is it normal to not even have the desire to kiss someone you like until you know them for a long time (maybe even a year atleast) and trust them fully? I don’t feel any desire to do anything sexual with someone even if I like them unless I know them very very well and am certain they love me and wouldn’t leave. Is this normal? I’ve read the average time for a couple to make a relationship “physical” in terms of kissing can be 1-3 weeks and in terms of sex can be 1 month but I wouldn’t want to do it until atleast a year but does that mean no one would want to be with me long enough to wait or am I just pressuring myself for no reason? Thanks in advance for any advice.</p>\n</div><!-- SC_ON -->",
  "score": 8960,
  "permalink": "/r/NoStupidQuestions/comments/kwz7ff/is_it_normal_not_to_desire_physicalsexual/",
  "subreddit": "NoStupidQuestions",
  "id": "kwz7ff",
  "is_self": true,
  "media": null,
  "is_video": false
}