{
  "author": "MightyCaseyStruckOut",
  "the_new_excerpt": "Personally, I am to a point where I am treating the dip as an opportunity.\nBillionaires and banks own crypto. They have the financial means to not only\nwait out dips, but to continue to accumulate during them. I am in a position\nwhere I can afford to do the same, so I am.\n\nAlso, everyone's…",
  "original_created_utc": 1624196879,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "個人的には、このディップをチャンスと捉えるところまできています。\n億万長者や銀行が暗号を所有しています。彼らには、ディップを待つだけでなく\nディップを待つだけでなく、ディップの間も蓄積し続けることができる資金力があります。私は、同じことをする余裕がある立場にいます。\n私も同じことをする余裕があるので、そうしています。\n\nまた、みんなの...",
      "title": "2010年から暗号に関わってきた者の一般的な考えです。私はこれらに車輪の再発明をしているわけではありませんが、誰かがそのうちの1つまたは2つを参考にするかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就我个人而言，我已经到了把下跌当作一个机会的地步了。\n亿万富翁和银行拥有加密货币。他们有足够的财政手段，不仅可以\n等待下跌，而且在下跌中继续积累。我现在的状况是\n我有能力做同样的事情，所以我在做。\n\n此外，每个人的...",
      "title": "从2010年起就参与加密货币的人的一些一般想法。我不是在重新发明轮子，但有人可能会发现其中的一两个有帮助。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就我個人而言，我已經到了把下跌當作一個機會的地步了。\n億萬富翁和銀行擁有加密貨幣。他們有足夠的財政手段，不僅可以\n等待下跌，而且在下跌中繼續積累。我現在的狀況是\n我有能力做同樣的事情，所以我在做。\n\n此外，每個人的...",
      "title": "從2010年起就參與加密貨幣的人的一些一般想法。我不是在重新發明輪子，但有人可能會發現其中的一兩個有幫助。"
    }
  ],
  "title": "Some general thoughts from someone who's been involved with crypto since 2010. I'm not reinventing the wheel with them, but someone may find one or two of them helpful.",
  "created_utc": 1624217789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Personally, I am to a point where I am treating the dip as an opportunity. Billionaires and banks own crypto. They have the financial means to not only wait out dips, but to continue to accumulate during them. I am in a position where I can afford to do the same, so I am.</p>\n\n<p>Also, everyone&#39;s financial, emotional and mental positions are different. If you&#39;ve got too much skin in the game and need to sell, then you&#39;ve gotta do what you&#39;ve gotta do to get by. Most of us have been there and had to do the same thing. People should understand that and, if they don&#39;t, that&#39;s on them, not you. Don&#39;t worry about the naysayers and do what is necessary for you financially. </p>\n\n<p>If you are too worried by the drop and selling is the option you need to take to dissociate yourself from that emotional turmoil, then do that. I&#39;ve been through many big drops myself and sold 625 BTC in early 2011 for the same reason. I originally bought them in 2010 for $0.83/coin. There was a run-up to $9 and I was on cloud nine. Then, there was a big dip and during it, I sold at $2.50. Now, I obviously regret that, but at the time, it was necessary for me to decouple myself because I was too emotionally attached and was spending most of my waking moments obsessing with Bitcoin price and speculation about its future. It was negatively affecting my work life, my social life and, most importantly, my relationship with my wife and kids. Getting out temporarily and hitting that reset button was necessary to allow me to rebuild and focus on those other aspects of my life. </p>\n\n<p>And, I know this gets thrown around a lot and people have tons of opinions regarding this subject, but if you&#39;re in a position where you are seriously thinking about ending it all, like a friend of mine did just before Christmas of 2018 after investing more than she could afford to lose and watching her investment drop 80%, please seek help. What is happening right now is very concerning to many people, especially those who haven&#39;t personally experienced a drop like this before, and there are people out there who can help you get through your mental turmoil if you let them. Focusing on you and your mental health is the single most important thing if you are in that position.</p>\n\n<p>Be well, everyone.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/o460uy/some_general_thoughts_from_someone_whos_been/",
  "subreddit": "CryptoCurrency",
  "id": "o460uy",
  "is_self": true,
  "media": null,
  "is_video": false
}