{
  "author": "Awesk",
  "original_created_utc": 1660531440,
  "title": "The Ottomans were one of the largest empires of all time, yet Turkish is not spoken as much around the world as many other languages. Was their influence not as significant over time as, let’s say, the British Empire?",
  "created_utc": 1660557184,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was recently reading an article talking about Turkish may be a dying language. While that article was not supported by much of anything besides a few dialects that are difficult to maintain anyways, it got me curious as to why Turkish is not as popular of a language around the world compared to other nations, native tongues with their empires.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/AskHistorians/comments/woo3fb/the_ottomans_were_one_of_the_largest_empires_of/",
  "subreddit": "AskHistorians",
  "id": "woo3fb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was recently reading an article talking about Turkish may be a dying language.\nWhile that article was not supported by much of anything besides a few dialects\nthat are difficult to maintain anyways, it got me curious as to why Turkish is\nnot as popular of a language around the world compared to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、トルコ語は滅びゆく言語かもしれない、という記事を読みました。\nその記事は、いくつかの方言のほかにはあまり根拠がありませんでしたが\nその記事を読んで、なぜトルコ語はそれほど人気がないのか、興味を持ちました。\nなぜトルコ語は世界中でそれほど人気がある言語ではないのでしょうか。",
      "title": "オスマン帝国は史上最大の帝国の一つであったが、トルコ語は他の多くの言語に比べ、世界的にあまり話されていない。彼らの影響力は、例えば大英帝国のように時間をかけても大きくはなかったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近读了一篇文章，谈到土耳其语可能是一种即将消失的语言。\n虽然这篇文章除了几个方言外，没有太多的东西可以证明\n语，但它让我很好奇，为什么土耳其语不像其他语言那样流行？\n为什么土耳其语在世界范围内不像其他语言那样流行？",
      "title": "奥斯曼人是有史以来最大的帝国之一，但土耳其语在世界各地的使用却不如许多其他语言那样多。难道随着时间的推移，他们的影响还不如比方说大英帝国那么重要吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近讀了一篇文章，談到土耳其語可能是一種即將消失的語言。\n雖然這篇文章除了幾個方言外，沒有太多的東西可以證明\n語，但它讓我很好奇，爲什麼土耳其語不像其他語言那樣流行？\n爲什麼土耳其語在世界範圍內不像其他語言那樣流行？",
      "title": "奧斯曼人是有史以來最大的帝國之一，但土耳其語在世界各地的使用卻不如許多其他語言那樣多。難道隨着時間的推移，他們的影響還不如比方說大英帝國那麼重要嗎？"
    }
  ]
}