{
  "author": "BioFrosted",
  "the_new_excerpt": "I don't see this spoken often enough so I'll say it myself - two important\nthings you must know:\n\n\nIF THE VIDEO CAME OUT, IT'S TOO LATE TO FOLLOW IN THE CREATOR'S FOOTSTEPS\n\nThat video about a newly developed, unknown, guaranteed, Teenage Mutant Ninja\nTurtles strategy will not bring you money. That…",
  "original_created_utc": 1619868040,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あまり語られることがないので、自分で言うのもなんですが、2つの重要なことがあります。\nつのことを知っておいてください。\n\n\nビデオが公開されてからでは、クリエイターの足跡をたどるには遅すぎます\n\n新しく開発された、未知の、保証された、ティーンエイジ・ミュータント・ニンジャ・タートルズの戦略についてのそのビデオは\nタートルズの戦略はあなたにお金をもたらしません。その...",
      "title": "PSA: YouTubeやTikTokの動画で、何かのコインに投資しろと言われても、そのコインに投資するのは遅すぎます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我没有经常看到这样的说法，所以我自己来说--两个重要的事情\n你必须知道的两件事。\n\n\n如果视频出来了，现在追随创作者的脚步已经太晚了\n\n那个关于新开发的、未知的、有保障的、忍者神龟的视频\n龟战略不会给你带来钱。那...",
      "title": "PSA：如果你看到YouTube或TikTok视频告诉你投资某种硬币，那么现在投资这种硬币已经太晚了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我沒有經常看到這樣的說法，所以我自己來說--兩個重要的事情\n你必須知道的兩件事。\n\n\n如果視頻出來了，現在追隨創作者的腳步已經太晚了\n\n那個關於新開發的、未知的、有保障的、忍者神龜的視頻\n龜戰略不會給你帶來錢。那...",
      "title": "PSA：如果你看到YouTube或TikTok視頻告訴你投資某種硬幣，那麼現在投資這種硬幣已經太晚了。"
    }
  ],
  "title": "PSA: If you see a YouTube or TikTok video telling you to invest in some coin, it's too late to invest in that coin.",
  "created_utc": 1619887970,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t see this spoken often enough so I&#39;ll say it myself - <strong>two</strong> important things you must know:</p>\n\n<h1>If the video came out, it&#39;s too late to follow in the creator&#39;s footsteps</h1>\n\n<p>That video about a newly developed, unknown, guaranteed, Teenage Mutant Ninja Turtles strategy <strong>will not bring you money.</strong> That person is there for views with which he will make even more money - he sure as hell is not about to give everyone a state of the art technique. Moreover, he probably doesn&#39;t even know such a technique but got lucky.</p>\n\n<h1>If no video was released and you&#39;re in some &quot;elitist&quot; circle you pay a fee to be in, you still won&#39;t get the technique</h1>\n\n<p>I&#39;ve seen this a million times. Investors claiming that for $10 per month, they&#39;ll give you their Snapchat on which they post &quot;advice&quot; on how to get rich. You must understand that whatever happens, no matter how much you pay them, <strong>NOBODY</strong> will ever give you their investing strategy.</p>\n\n<p><strong><em>RICH PEOPLE DON&#39;T PLAN ON MAKING YOU RICH.</em></strong></p>\n\n<p>What you can do, however, is read, read, read, get a better understanding about Crypto, read some more and develop your own knowledge without being biased from people profiting off your back. I should also mention that you shouldn&#39;t forget to <strong>R E A D</strong>.</p>\n</div><!-- SC_ON -->",
  "score": 906,
  "permalink": "/r/CryptoCurrency/comments/n2gegv/psa_if_you_see_a_youtube_or_tiktok_video_telling/",
  "subreddit": "CryptoCurrency",
  "id": "n2gegv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961469
}