{
  "author": "sandygws",
  "original_created_utc": 1646761359,
  "title": "Just a week after the ‘Earn’ debacle, Crypto.com fucks up again by announcing that anyone with a Crypto Loan needs to repay it within 7 days – or be forcibly liquidated via funds in their Spot Wallet. What planet are these idiots living on?",
  "created_utc": 1646788736,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EDIT: This post went straight to the top of the CDC sub - then the Mods removed it. So not only are CDC untrustworthy, but they&amp;#39;re now censoring (accurately) critical posts on their own sub:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0s83zfynw8m81.png?width=1057&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=dfcfbdf7f17dd829bb9554f2e114b109d9b8e8eb\"&gt;https://preview.redd.it/0s83zfynw8m81.png?width=1057&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=dfcfbdf7f17dd829bb9554f2e114b109d9b8e8eb&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Disclaimer: I’ve been a serious cheerleader for CDC for almost two years (check my post history). Until the past week, they could literally do no wrong in my eyes. But I’m starting to see that they are sneaky and becoming more untrustworthy by the day.&lt;/p&gt;\n\n&lt;p&gt;As per the title of this thread - Yes, you read that right. Forced Liquidations from your Spot Wallet. Yesterday CDC were happily handing out Crypto loans on their Exchange at a balmy 8% APY. Yet today, they decided they’d rather not – and gave any borrower 7 days to repay their loan(s).&lt;/p&gt;\n\n&lt;p&gt;e.g. if someone had taken out a 10K loan last week (at 8%) and then placed it straight into Earn (USDC 14%) with a three-month stake, they would be absolutely fucked right now because of CDC&amp;#39;s incompetent and ridiculous communication. 7 days to repay a loan that THEY were happy to make just 24 hours ago.&lt;/p&gt;\n\n&lt;p&gt;Yes, most us know that they trading on leverage is a bad idea, but it seems many were happy to borrow at 8% and then stake in Earn at 14%. I’m the opposite luckily – USDC staked in Earn and (currently) no borrowing as the market is a mess right now.&lt;/p&gt;\n\n&lt;p&gt;I think it’s important that we draw as much attention to this as possible as ANY exchange which decides to treat loyal users in this way deserves to be called out and publicly shamed.&lt;/p&gt;\n\n&lt;p&gt;Crypto.com do a LOT of things right (Cards, Marketing, Sponsorships, Partnerships, PR, etc). But they are starting to seriously wrong foot users and making some very penny-pinching, illogical decisions which make them look shady as fuck.&lt;/p&gt;\n\n&lt;p&gt;End of rant : ))&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Proof (+ it&amp;#39;s all over the CDC sub)&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/f2mp7h5q87m81.png?width=813&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=520647f7c1d8b2628efdd54db972aaa5bdd745dc\"&gt;https://preview.redd.it/f2mp7h5q87m81.png?width=813&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=520647f7c1d8b2628efdd54db972aaa5bdd745dc&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 383,
  "permalink": "/r/CryptoCurrency/comments/t9mcfj/just_a_week_after_the_earn_debacle_cryptocom/",
  "subreddit": "CryptoCurrency",
  "id": "t9mcfj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "EDIT: This post went straight to the top of the CDC sub - then the Mods removed\nit. So not only are CDC untrustworthy, but they're now censoring (accurately)\ncritical posts on their own…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: この投稿はCDCサブのトップに直行しました - その後、Modsは削除しました。\nです。つまり、CDCは信用できないだけでなく、今、検閲している（正確には）\n批判的な投稿を、自分たちの手で...",
      "title": "Crypto.comは、「Earn」騒動からわずか1週間後に、Crypto Loanを利用する人は7日以内に返済する必要があること、またはSpot Walletの資金を通じて強制的に清算されることを発表して、再び大失態を犯してしまった。このバカどもは一体どこの惑星に住んでいるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：这个帖子直接到了CDC分站的顶部--然后被管理员删除了\n它。因此，CDC不仅不值得信任，而且他们现在还在审查（准确地说）\n他们自己的批评帖子...",
      "title": "就在'Earn'失败的一周后，Crypto.com再次搞砸了，宣布任何拥有加密货币贷款的人需要在7天内偿还 - 或者通过其Spot Wallet中的资金被强行清算。这些白痴生活在什么星球上？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：這個帖子直接到了CDC分站的頂部--然後被管理員刪除了\n它。因此，CDC不僅不值得信任，而且他們現在還在審查（準確地說）\n他們自己的批評帖子...",
      "title": "就在'Earn'失敗的一週後，Crypto.com再次搞砸了，宣佈任何擁有加密貨幣貸款的人需要在7天內償還 - 或者通過其Spot Wallet中的資金被強行清算。這些白癡生活在什麼星球上？"
    }
  ]
}