{
  "author": "MVIVN",
  "original_created_utc": 1652495993,
  "title": "We are ready to listen. This is a maximum FUD thread. Tell us which coins you think are not going to work out long term despite what everyone else is saying.",
  "created_utc": 1652517797,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the post title says, we keep seeing all these people crawling out of the woodwork to say “see? I told you 3 months ago that LUNA/UST was going to crash, but no one listened”. They say hindsight is 20/20, so maybe all the signs are easier for people to see when it&amp;#39;s already happened, but as we&amp;#39;ve seen in the past week, it&amp;#39;s often far too late for some. There are too many echo chambers and general denial in crypto, not to mention greed. Maybe you&amp;#39;ve been trying to warn people about another crypto project and people just aren&amp;#39;t listening. Well, we’re listening now. What have you been screaming from the rooftops that no one seems willing to hear? What are you predicting is going to go up in flames sooner than everyone thinks? Maybe someday someone will be quoting something you said in this thread as evidence that we were warned.&lt;/p&gt;\n\n&lt;p&gt;Where you can, please provide reasons, or even evidence (if you have any) of why you are certain a project won’t work out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 362,
  "permalink": "/r/CryptoCurrency/comments/up7o9q/we_are_ready_to_listen_this_is_a_maximum_fud/",
  "subreddit": "CryptoCurrency",
  "id": "up7o9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As the post title says, we keep seeing all these people crawling out of the\nwoodwork to say “see? I told you 3 months ago that LUNA/UST was going to crash,\nbut no one listened”. They say hindsight is 20/20, so maybe all the signs are\neasier for people to see when it's already happened, but as we've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投稿タイトルにあるように、這い上がってくる人たちを見続けています。\n3ヶ月前にLUNA/USTがクラッシュすると言ったのに、誰も耳を貸さなかった」と言うために、木っ端微塵になるのを見続けています。\nしかし、誰も耳を貸さなかった」と言うのです。後知恵は20/20と言いますから、もしかしたら、すべての兆候は\nすでに起きてしまったことなので、すべての兆候が見えやすいのかもしれませんが、私たちが...",
      "title": "聴く準備はできています。これは最大限のFUDスレッドです。みんなが言っているにもかかわらず、長期的にうまくいかないと思うコインを教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如帖子标题所言，我们不断看到所有这些人从以下方面爬出来\n我3个月前就告诉过你，LUNA/UST将崩溃。\n但是没有人听\"。他们说事后诸葛亮是20/20，所以也许所有的迹象是\n当它已经发生时，人们更容易看到，但正如我们...",
      "title": "我们已经准备好倾听。这是一个最大的FUD主题。告诉我们，尽管其他人都在说，但你认为哪种硬币不会有长期的效果。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如帖子標題所言，我們不斷看到所有這些人從以下方面爬出來\n我3個月前就告訴過你，LUNA/UST將崩潰。\n但是沒有人聽\"。他們說事後諸葛亮是20/20，所以也許所有的跡象是\n當它已經發生時，人們更容易看到，但正如我們...",
      "title": "我們已經準備好傾聽。這是一個最大的FUD主題。告訴我們，儘管其他人都在說，但你認爲哪種硬幣不會有長期的效果。"
    }
  ]
}