{
  "author": "LunarChickadee",
  "original_created_utc": 1653754634,
  "title": "This is just the beginning. We're a few months from feeling the full brunt of global food shortages, climate crises, and major issues that we aren't being told. Don't go all in right now.",
  "created_utc": 1653781211,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Will crypto last through all of it? &lt;/p&gt;\n\n&lt;p&gt;More than likely. Crypto price runs on hype and hope and there&amp;#39;s gonna be both during a major downturn. &lt;/p&gt;\n\n&lt;p&gt;That being said, it&amp;#39;s still speculative, and will continue to be until/if there&amp;#39;s good reason for everyone to interact with it. And speculative investments are NOT where the money stays during major downturns.&lt;/p&gt;\n\n&lt;p&gt;You know what does go to the moon? Layoffs, interest rates, political and social strife, corruption, disease, death. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what to prepare for. Have a safety net of some kind. Do you have savings for if you or your partner(s) get laid off? &lt;/p&gt;\n\n&lt;p&gt;What do you do if the place you&amp;#39;re renting gets sold off to cover some landlord&amp;#39;s margin, and the new buyer raises your rents past what you can afford?&lt;/p&gt;\n\n&lt;p&gt;Do you have skills and network and savings to survive if suddenly your luck goes worse for 3-6 months?&lt;/p&gt;\n\n&lt;p&gt;If not, that&amp;#39;s where to focus. &lt;/p&gt;\n\n&lt;p&gt;Learn from the past. &lt;/p&gt;\n\n&lt;p&gt;P.S. some of the biggest false rallies happen during downturns, so try to stick to whatever DCA/plan you have and try to avoid fomoing in more.&lt;/p&gt;\n\n&lt;p&gt;Edit: This was such a nice conversation about horrible things. Thanks &lt;a href=\"/r/cc\"&gt;r/cc&lt;/a&gt;!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 343,
  "permalink": "/r/CryptoCurrency/comments/uzqmc9/this_is_just_the_beginning_were_a_few_months_from/",
  "subreddit": "CryptoCurrency",
  "id": "uzqmc9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Will crypto last through all of it?\n\nMore than likely. Crypto price runs on hype and hope and there's gonna be both\nduring a major downturn.\n\nThat being said, it's still speculative, and will continue to be until/if\nthere's good reason for everyone to interact with it. And speculative\ninvestments…"
}