{
  "author": "LunarChickadee",
  "original_created_utc": 1653754634,
  "title": "This is just the beginning. We're a few months from feeling the full brunt of global food shortages, climate crises, and major issues that we aren't being told. Don't go all in right now.",
  "created_utc": 1653781211,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Will crypto last through all of it? &lt;/p&gt;\n\n&lt;p&gt;More than likely. Crypto price runs on hype and hope and there&amp;#39;s gonna be both during a major downturn. &lt;/p&gt;\n\n&lt;p&gt;That being said, it&amp;#39;s still speculative, and will continue to be until/if there&amp;#39;s good reason for everyone to interact with it. And speculative investments are NOT where the money stays during major downturns.&lt;/p&gt;\n\n&lt;p&gt;You know what does go to the moon? Layoffs, interest rates, political and social strife, corruption, disease, death. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what to prepare for. Have a safety net of some kind. Do you have savings for if you or your partner(s) get laid off? &lt;/p&gt;\n\n&lt;p&gt;What do you do if the place you&amp;#39;re renting gets sold off to cover some landlord&amp;#39;s margin, and the new buyer raises your rents past what you can afford?&lt;/p&gt;\n\n&lt;p&gt;Do you have skills and network and savings to survive if suddenly your luck goes worse for 3-6 months?&lt;/p&gt;\n\n&lt;p&gt;If not, that&amp;#39;s where to focus. &lt;/p&gt;\n\n&lt;p&gt;Learn from the past. &lt;/p&gt;\n\n&lt;p&gt;P.S. some of the biggest false rallies happen during downturns, so try to stick to whatever DCA/plan you have and try to avoid fomoing in more.&lt;/p&gt;\n\n&lt;p&gt;Edit: This was such a nice conversation about horrible things. Thanks &lt;a href=\"/r/cc\"&gt;r/cc&lt;/a&gt;!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 343,
  "permalink": "/r/CryptoCurrency/comments/uzqmc9/this_is_just_the_beginning_were_a_few_months_from/",
  "subreddit": "CryptoCurrency",
  "id": "uzqmc9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Will crypto last through all of it?\n\nMore than likely. Crypto price runs on hype and hope and there's gonna be both\nduring a major downturn.\n\nThat being said, it's still speculative, and will continue to be until/if\nthere's good reason for everyone to interact with it. And speculative\ninvestments…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は最後まで持つか？\n\n可能性は高いです。暗号の価格は誇大広告と希望で動いており、大きな落ち込みの際にはその両方が発生します。\nがあるはずです。\n\nとはいえ、暗号はまだ投機的なものであり、次のことが起きるまで、あるいは起きたとしても、投機的なものであり続けるでしょう。\nこれからも投機的なものであり、誰もがそれを利用する正当な理由ができるまで、あるいはできる限りそうあり続けるでしょう。そして、投機的な\n投資...",
      "title": "これはまだ始まりに過ぎない。世界的な食糧不足、気候変動、そして私たちが知らされていない重大な問題の全容を感じるまで、あと数カ月です。今すぐには手を出さないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币能撑过这一切吗？\n\n更有可能。加密货币的价格是靠炒作和希望来运行的，而在重大的衰退期，这两种情况都会出现。\n在一个重大的衰退期。\n\n也就是说，它仍然是投机性的，并将继续下去，直到/如果\n有很好的理由让每个人与之互动。而投机性\n投资...",
      "title": "这只是一个开始。我们还有几个月就会感受到全球粮食短缺、气候危机以及没有被告知的重大问题的全面冲击。不要现在就全身心投入。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣能撐過這一切嗎？\n\n更有可能。加密貨幣的價格是靠炒作和希望來運行的，而在重大的衰退期，這兩種情況都會出現。\n在一個重大的衰退期。\n\n也就是說，它仍然是投機性的，並將繼續下去，直到/如果\n有很好的理由讓每個人與之互動。而投機性\n投資...",
      "title": "這只是一個開始。我們還有幾個月就會感受到全球糧食短缺、氣候危機以及沒有被告知的重大問題的全面衝擊。不要現在就全身心投入。"
    }
  ]
}