{
  "author": "Tiltnes",
  "the_new_excerpt": "I might've become a grumpy old dude, but /crypto has become an orgy of people\nspewing the same post (stricly speaking), trying to either validate their\nbuy/sell choices or mental health doctrines, or share their \"I did good/ I did\nwrong\" of the same issue for 100th time. And of course the same…",
  "original_created_utc": 1614023112,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我可能已经成了一个脾气暴躁的老家伙，但/crypto已经成了人们的狂欢。\n吐槽同一篇文章（严格意义上说），试图验证他们的\n买卖选择或心理健康学说，或分享他们的 \"我做了好事/我做了\"。\n错 \"的同一问题100次。当然，同样的...",
      "title": "成员时，我们在这个子里有实际的内容？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可能已經成了一個脾氣暴躁的老傢伙，但/crypto已經成了人們的狂歡。\n吐槽同一篇文章（嚴格意義上說），試圖驗證他們的\n買賣選擇或心理健康學說，或分享他們的 \"我做了好事/我做了\"。\n錯 \"的同一問題100次。當然，同樣的...",
      "title": "成員時，我們在這個子裏有實際的內容？"
    }
  ],
  "title": "Member when we had actual content in this sub?",
  "created_utc": 1614044617,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I might&#39;ve become a grumpy old dude, but /crypto has become an <strong>orgy of people spewing the same post</strong> (stricly speaking), trying to either validate their buy/sell choices or mental health doctrines, or share their &quot;I did good/ I did wrong&quot; of the same issue for 100th time. \nAnd of course the same utterly basic tips, which somehow still are slightly unaccurate as far as Im concerned.\nJust look at the top 10 posts today <em>&quot;DoNt PaNiC seLL tHe DIP&quot;</em> <em>&quot;StAY strOnG and DonT cHecK porTifOlio&quot;</em> <em>&quot;bUhU ElOn mUsk&quot;</em>.\nAnd people love it. Upvotes in the 100s and even 1000s.</p>\n\n<p>Before all this I used to be <strong>somewhat excited checking for new posts in the evening</strong>.  Finding exciting and important news. Educational discussions on projects, blockchain tech, adoption, protocol differences etc. Of course now and then a cringe nano shill or repost doge memes, to add some color. </p>\n\n<p>I just miss actually learning something new, and not reading what random people feel. \nThe <em>irony</em> of me making the very same kind of post is high; I know. However, I know this is a rising sentiment. Mods and redditors, please...lets try to bring forth inellectual content  with news, tech discussion, original thoughts and implications etc. SO MUCH IS HAPPENING.\nIm not here for bad stories from your personal life. Write a diary or call your mom. </p>\n\n<p>EDIT: Apologies to all you dang kids who might&#39;ve been offended, now get off my lawn! ;)</p>\n</div><!-- SC_ON -->",
  "score": 880,
  "permalink": "/r/CryptoCurrency/comments/lpxuh6/member_when_we_had_actual_content_in_this_sub/",
  "subreddit": "CryptoCurrency",
  "id": "lpxuh6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332879187
}