{
  "author": "Karmaa",
  "original_created_utc": 1633101355,
  "title": "This will likely be the last time you be able to buy Bitcoin at 40k.",
  "created_utc": 1633124067,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s unbelievable where we are at with Bitcoin, where even the might of a powerful nation like China can&#39;t break the momentum of the evolution.</p>\n\n<p>Never before in the history of humanity, has a decentralized currency been adopted on a national level, like Bitcoin has. Let that settle in, a sovereign nation has not only accepted Bitcoin, but also implemented it into their entire economy. That should be mind-blowing!</p>\n\n<p>The chain of events that will likely lead to a dozen counties to follow suit by end of 2022 has already been set in motion. By 2025 it will likely be adopted by most countries.</p>\n\n<p>Unbelievable, what we are witnessing. I continue to buy $20 of Bitcoin every week, not only for the imminent return, but because I want to be part of that revolution.</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/Bitcoin/comments/pza49q/this_will_likely_be_the_last_time_you_be_able_to/",
  "subreddit": "Bitcoin",
  "id": "pza49q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's unbelievable where we are at with Bitcoin, where even the might of a\npowerful nation like China can't break the momentum of the evolution.\n\nNever before in the history of humanity, has a decentralized currency been\nadopted on a national level, like Bitcoin has. Let that settle in, a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインでは信じられないことですが、電力の力でも\n中国のような強大な国の力をもってしても、進化の勢いを止めることはできません。\n\n人類の歴史上、ビットコインのように分散型の通貨が国家レベルで採用されたことはありません。\nビットコインのように、国家レベルで採用されたことは、人類の歴史上一度もありません。それを落ち着かせて、...",
      "title": "ビットコインを40kで買えるのは、これが最後になるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们在比特币方面所处的位置令人难以置信，即使是像中国这样强大的国家也无法打破比特币的发展势头。\n即使像中国这样强大的国家也无法打破演变的势头。\n\n在人类历史上，从来没有一种去中心化的货币像比特币这样被国家采纳。\n像比特币这样在国家层面上被采用。让这一消息沉淀下来，一个...",
      "title": "这可能是你最后一次能够以40K的价格购买比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們在比特幣方面所處的位置令人難以置信，即使是像中國這樣強大的國家也無法打破比特幣的發展勢頭。\n即使像中國這樣強大的國家也無法打破演變的勢頭。\n\n在人類歷史上，從來沒有一種去中心化的貨幣像比特幣這樣被國家採納。\n像比特幣這樣在國家層面上被採用。讓這一消息沉澱下來，一個...",
      "title": "這可能是你最後一次能夠以40K的價格購買比特幣。"
    }
  ]
}