{
  "author": "hausdorffdim",
  "the_new_excerpt": "I'm a physics grad student and I enjoy looking up peoples dissertations online.\nThey tend to be a lot easier to read than other texts.\n\nThat being said, I think Heraclitus is fascinating. I don't really want to read\nhis fragments right now, but I'm looking for any good dissertations on him.\nOswald…",
  "original_created_utc": 1617713551,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は物理学の大学院生ですが、オンラインで人の論文を調べるのが好きです。\n他のテキストよりもずっと読みやすいですからね。\n\nとはいえ、ヘラクレイトスは魅力的だと思います。今はあまり読みたくないのですが\n今は彼の断片を読みたいとは思いませんが、彼に関する良い論文がないか探しています。\nオズワルド...",
      "title": "ヘラクレイトスに関する良い論文はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名物理学研究生，我喜欢在网上查找别人的论文。\n它们往往比其他文本更容易阅读。\n\n也就是说，我觉得赫拉克利特很迷人。我并不是真的想读\n他的碎片，现在， 但我在寻找任何好的论文 关于他。\n奥斯瓦尔德...",
      "title": "有关于赫拉克利特的好论文吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名物理學研究生，我喜歡在網上查找別人的論文。\n它們往往比其他文本更容易閱讀。\n\n也就是說，我覺得赫拉克利特很迷人。我並不是真的想讀\n他的碎片，現在， 但我在尋找任何好的論文 關於他。\n奧斯瓦爾德...",
      "title": "有關於赫拉克利特的好論文嗎？"
    }
  ],
  "title": "Any good dissertations on Heraclitus?",
  "created_utc": 1617796458,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a physics grad student and I enjoy looking up peoples dissertations online. They tend to be a lot easier to read than other texts.</p>\n\n<p>That being said, I think Heraclitus is fascinating. I don&#39;t really want to read his fragments right now, but I&#39;m looking for any good dissertations on him. Oswald Spengler for example, did his PhD on Heraclitus (unfortunately I can&#39;t find his dissertation online).</p>\n\n<p>I&#39;m not sure if publishing philosophy dissertations on Google is a thing, but was anyone here a grad student on Heraclitus and wants to share their texts?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/mlaxwe/any_good_dissertations_on_heraclitus/",
  "subreddit": "askphilosophy",
  "id": "mlaxwe",
  "is_self": true,
  "media": null,
  "is_video": false
}