{
  "author": "The_Texidian",
  "the_new_excerpt": "Honestly I grew without any friends. In childhood, I never went over to someone\nelse’s home before, I never had a sleep over, I never have been to a birthday\nparty before. In high school I never went to the dances, never texted anyone,\nnever met up with people after school, never had a girlfriend.…",
  "original_created_utc": 1624067230,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、私は友達がいないまま成長しました。子供の頃は、誰かの家に行ったこともなく\n他人の家に行ったこともないし、お泊りしたこともないし、誕生日会に行ったこともない。\nパーティーに行ったこともありませんでした。高校時代は、ダンスに行ったこともなければ、誰にもメールしたこともありません。\n放課後に人と会ったこともないし、彼女を作ったこともない....",
      "title": "私は一人でいることが好きなのか、それとも一人でいることが慣れているのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，我在没有任何朋友的情况下成长。在童年时期，我从来没有去过别人家\n我从来没有去过别人家，也没有过过夜，更没有参加过别人的生日聚会。\n派对。在高中，我从未参加过舞会，从未给任何人发过短信。\n从未在放学后与人见面，从未交过女朋友....。",
      "title": "我喜欢独处，还是独处是我所习惯的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，我在沒有任何朋友的情況下成長。在童年時期，我從來沒有去過別人家\n我從來沒有去過別人家，也沒有過過夜，更沒有參加過別人的生日聚會。\n派對。在高中，我從未參加過舞會，從未給任何人發過短信。\n從未在放學後與人見面，從未交過女朋友....。",
      "title": "我喜歡獨處，還是獨處是我所習慣的？"
    }
  ],
  "title": "Do I like being alone, or is being alone what I’m used to?",
  "created_utc": 1624120614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly I grew without any friends. In childhood, I never went over to someone else’s home before, I never had a sleep over, I never have been to a birthday party before. In high school I never went to the dances, never texted anyone, never met up with people after school, never had a girlfriend. In college I never went out, I never went to a party, I never really did anything. </p>\n\n<p>I like to tell myself I enjoy being alone. I like peace and quiet, I like just being with my cat. I don’t enjoy being around other people because I find it awkward and tiring. </p>\n\n<p>Now my question is. Do I actually enjoy being alone, or is it what I’ve grown accustomed to and therefore I prefer it?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/o35hm4/do_i_like_being_alone_or_is_being_alone_what_im/",
  "subreddit": "NoStupidQuestions",
  "id": "o35hm4",
  "is_self": true,
  "media": null,
  "is_video": false
}