{
  "author": "jam-hay",
  "original_created_utc": 1632535573,
  "title": "Have made a personal decision to stop buying or using Chinese goods and services until the government removes the ban on Bitcoin and Crypto. Have also sold my shares in Chinese companies.",
  "created_utc": 1632547934,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>300 million global crypto users can impose their own individual economic sanctions if they choose to make a stand. </p>\n\n<p>Bitcoin is the personification and crystallisation of the liberty and freedoms of humanity. </p>\n\n<p>The peaceful exchange of harmless cryptographic code should be a fundamental god given right if its the expressed will of a people.</p>\n\n<p>Yes crypto can&#39;t and will not ultimately be stopped.</p>\n\n<p>However any government taking a forceful action to ban it&#39;s population from participating in an open and decentralised global network, needs to be sent a clear and united message from the rest of civilization that this beach of human rights will not be tolerated.</p>\n\n<p>Holding or transacting in cryptographic code should never be considered a crime. The real crime is against.humanity when an authoritarian dictatorship attempts to forcefully block humans from participating.in the greatest financial liberation in history.</p>\n\n<p>Bitcoin is proof that every individual counts and when we collaborate and cooperate together we are force to be reckoned.with.</p>\n\n<p>It just takes handful of people with belief to start a revolution and make voices heard and actions felt.</p>\n\n<p>On behalf of the human rights of my fellow global citizens in China... I&#39;m banning myself from funding the government of the People&#39;s Republic of China.</p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/Bitcoin/comments/puxgxq/have_made_a_personal_decision_to_stop_buying_or/",
  "subreddit": "Bitcoin",
  "id": "puxgxq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "300 million global crypto users can impose their own individual economic\nsanctions if they choose to make a stand.\n\nBitcoin is the personification and crystallisation of the liberty and freedoms\nof humanity.\n\nThe peaceful exchange of harmless cryptographic code should be a fundamental god\ngiven…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界の3億人の暗号化ユーザーは、それぞれの経済制裁を課すことができます。\n制裁を受けることができます。\n\nビットコインは、人類の自由を擬人化し、結晶化したものです。\nの結晶です。\n\n無害な暗号コードを平和的に交換することは、神から与えられた基本的なことであるべきです。\n与えられた...",
      "title": "政府がビットコインや暗号の禁止を解除するまで、中国の商品やサービスの購入や使用をやめるという個人的な決断をしました。また、中国企業の株式も売却しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "全球3亿加密货币用户可以对他们自己的个人经济进行制裁。\n如果他们选择表态，就可以实施自己的经济制裁。\n\n比特币是人类自由的化身和结晶。\n的化身和结晶。\n\n和平交换无害的加密代码应该是一个基本的神\n赋予...",
      "title": "已经做出个人决定，停止购买或使用中国商品和服务，直到政府取消对比特币和加密货币的禁令。我还出售了我在中国公司的股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "全球3億加密貨幣用戶可以對他們自己的個人經濟進行制裁。\n如果他們選擇表態，就可以實施自己的經濟制裁。\n\n比特幣是人類自由的化身和結晶。\n的化身和結晶。\n\n和平交換無害的加密代碼應該是一個基本的神\n賦予...",
      "title": "已經做出個人決定，停止購買或使用中國商品和服務，直到政府取消對比特幣和加密貨幣的禁令。我還出售了我在中國公司的股票。"
    }
  ]
}