{
  "author": "Ferakin",
  "original_created_utc": 1658800393,
  "title": "What are good reasons to have children?",
  "created_utc": 1658819895,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen posts that some mothers end up regretting having children and expanding on how hard it can be. I&amp;#39;ve also heard there are plenty reasons not to have children; that they should not be representing a mini you that you give everything to that you yourself wanted as a child (so don&amp;#39;t live via your child). &lt;/p&gt;\n\n&lt;p&gt;But when I try to come up with actual good reasons to have children I come up blank. I&amp;#39;m considering having some (25yo woman) with my partner (28yo man) and we have been hesitating a lot. I feel like I would regret it if I didn&amp;#39;t have kids. But I feel just having some coz you might regret it if you don&amp;#39;t is not at all a valid reason to have some. So, help?&lt;/p&gt;\n\n&lt;p&gt;Tl-dr: I&amp;#39;m hesitating om having kids, any actual good reasons to have some? I reasons why not, but not reasons why you should.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/w86upf/what_are_good_reasons_to_have_children/",
  "subreddit": "TooAfraidToAsk",
  "id": "w86upf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've seen posts that some mothers end up regretting having children and\nexpanding on how hard it can be. I've also heard there are plenty reasons not to\nhave children; that they should not be representing a mini you that you give\neverything to that you yourself wanted as a child (so don't live via…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "子供を産んだことを後悔することになる母親がいるという書き込みを見たことがあり\n大変なんだと広げています。また、子供を持たない理由もたくさんあるそうです。\nまた、子供を産まない理由もたくさんあるそうです。\nまた、子どもは、自分が子どもの頃に望んでいた、すべてを捧げるミニ自分の象徴であってはならない（だから、生きてはいけない...）。",
      "title": "子供を持つ良い理由とは何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到一些帖子说，一些母亲最终会后悔生孩子，而\n我看到一些帖子说，一些母亲最终会后悔生孩子，并说这是多么困难的事情。我也听说有很多理由不生孩子。\n我也听说有很多理由不生孩子；他们不应该代表一个迷你的你，你把所有的东西都给了他们。\n你自己小时候想要的一切（所以不要通过...）。",
      "title": "什么是生孩子的好理由？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到一些帖子說，一些母親最終會後悔生孩子，而\n我看到一些帖子說，一些母親最終會後悔生孩子，並說這是多麼困難的事情。我也聽說有很多理由不生孩子。\n我也聽說有很多理由不生孩子；他們不應該代表一個迷你的你，你把所有的東西都給了他們。\n你自己小時候想要的一切（所以不要通過...）。",
      "title": "什麼是生孩子的好理由？"
    }
  ]
}