{
  "author": "RichieNRich",
  "the_new_excerpt": "After a great day yesterday, I decided to hop on today. It went up over 90%\n(with 35% of that after trading hours)! What are the chances of this going up\nanother 50-75% tomorrow?\n\nThis company has 9 employees and just released a study that indicates a drug\nthey're working on has positive effects for…",
  "original_created_utc": 1612395227,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "昨天大赚了一天，今天决定跳槽。涨了九成多\n(其中35%是在交易时间后)! 涨的机会有多大\n明天再涨50-75%？\n\n这家公司有9名员工，刚刚发布的一项研究表明，一种药物\n他们的工作有积极的影响... ...",
      "title": "今天还有人跳槽到木薯科学吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天大賺了一天，今天決定跳槽。漲了九成多\n(其中35%是在交易時間後)! 漲的機會有多大\n明天再漲50-75%？\n\n這家公司有9名員工，剛剛發佈的一項研究表明，一種藥物\n他們的工作有積極的影響... ...",
      "title": "今天還有人跳槽到木薯科學嗎？"
    }
  ],
  "title": "Anyone else jump on Cassava Sciences today?",
  "created_utc": 1612428446,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After a great day yesterday, I decided to hop on today.  It went up over 90% (with 35% of that after trading hours)!   What are the chances of this going up another 50-75% tomorrow? </p>\n\n<p>This company has 9 employees and just released a study that indicates a drug they&#39;re working on has positive effects for alzheimer&#39;s.</p>\n\n<p>If this thing is the real deal, what would be the upper limit of a stock like this?  Should I buy more after this massive pop?  How much more massive can this get?</p>\n\n<p>I suspect that there are other opportunities awaiting just like this.  I found this stock by looking at the &quot;Daily mover&quot;, and there it was. A stock with a 60% gain. Then I read about the drug it was developing.  </p>\n\n<p>Is this a good investing strategy to take, or did I just get lucky?</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/stocks/comments/lc1mjl/anyone_else_jump_on_cassava_sciences_today/",
  "subreddit": "stocks",
  "id": "lc1mjl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518543324
}