{
  "author": "SkepticalCryptoDude",
  "original_created_utc": 1651626836,
  "title": "Is Ethereum actually good or does it just have first mover advantage?",
  "created_utc": 1651657255,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After doing a plethora of research, I’m finding out that Ethereum might not be the best blockchain tech wise. Blockchains such as Cardano, Algorand, Cosmos etc all seem to have various advantages over Ethereum.&lt;/p&gt;\n\n&lt;p&gt;These advantages include lower fees, speed, scalability, decentralization and already being proof of stake. (It’s debatable whether proof of stake is superior or proof of work but I won’t go into that). &lt;/p&gt;\n\n&lt;p&gt;Other than being the most adopted smart contract platform and being “first to market,” is Ethereum actually technically better than most other Layer 1s out there?&lt;/p&gt;\n\n&lt;p&gt;Don’t get me wrong I’m bullish on Ethereum, but I’m even more bullish on other Layer 1s.&lt;/p&gt;\n\n&lt;p&gt;What are your thoughts on this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/uhv1fu/is_ethereum_actually_good_or_does_it_just_have/",
  "subreddit": "CryptoCurrency",
  "id": "uhv1fu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After doing a plethora of research, I’m finding out that Ethereum might not be\nthe best blockchain tech wise. Blockchains such as Cardano, Algorand, Cosmos etc\nall seem to have various advantages over Ethereum.\n\nThese advantages include lower fees, speed, scalability, decentralization and\nalready…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いろいろと調べた結果、イーサリアムは技術的に最高のブロックチェーンではないかもしれないことがわかりました。\n技術的に最高のブロックチェーンではないことがわかりました。Cardano、Algorand、Cosmosなどのブロックチェーンは、どれもイーサリアムより様々な利点があるようです。\nなどのブロックチェーンは、イーサリアムよりも様々な利点があるようです。\n\nこれらの利点は、低料金、スピード、スケーラビリティ、非中央集権、そして\nすでに...",
      "title": "イーサリアムは実際に良いものなのか、それとも先行者利益を得ているだけなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在做了大量的研究后，我发现以太坊可能不是\n是技术上最好的区块链。区块链如Cardano、Algorand、Cosmos等\n似乎都比以太坊有各种优势。\n\n这些优势包括较低的费用、速度、可扩展性、去中心化和\n已经...",
      "title": "以太坊究竟是好还是只是有先发优势？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在做了大量的研究後，我發現以太坊可能不是\n是技術上最好的區塊鏈。區塊鏈如Cardano、Algorand、Cosmos等\n似乎都比以太坊有各種優勢。\n\n這些優勢包括較低的費用、速度、可擴展性、去中心化和\n已經...",
      "title": "以太坊究竟是好還是隻是有先發優勢？"
    }
  ]
}