{
  "author": "see-the-whole-board",
  "the_new_excerpt": "Perhaps the biggest narrative on CNBC in the past few months has that the\nmarkets wanted divided government. This has been supported by nearly every\nanchor. This didn't happen and the market is booming. Be wary of what you hear\nin the financial news.\n\n\n\n\nI'm not saying I know for certain why the…",
  "original_created_utc": 1609949883,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "也许过去几个月CNBC上最大的叙述是\n市场想要分裂的政府。几乎每个人都支持这一点\n锚。这并没有发生，市场正在蓬勃发展。对你所听到的保持警惕\n财经新闻。\n\n\n\n\n我不是说我确定为什么…",
      "title": "也许过去几个月CNBC上最大的叙事是市场希望分裂的政府。这并没有发生，市场正在蓬勃发展。警惕你在财经新闻中听到的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許過去幾個月CNBC上最大的敘述是\n市場想要分裂的政府。幾乎每個人都支持這一點\n錨。這並沒有發生，市場正在蓬勃發展。對你所聽到的保持警惕\n財經新聞。\n\n\n\n\n我不是說我確定爲什麼…",
      "title": "也許過去幾個月CNBC上最大的敘事是市場希望分裂的政府。這並沒有發生，市場正在蓬勃發展。警惕你在財經新聞中聽到的東西。"
    }
  ],
  "title": "Perhaps the biggest narrative on CNBC in the past few months has that the markets wanted divided government. This didn't happen and the market is booming. Be wary of what you hear in the financial news.",
  "created_utc": 1609956750,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Perhaps the biggest narrative on CNBC in the past few months has that the markets wanted divided government. This has been supported by nearly every anchor. This didn&#39;t happen and the market is booming. Be wary of what you hear in the financial news.</p>\n\n<h2></h2>\n\n<p>I&#39;m not saying I know for certain why the market is going up today. I&#39;m saying that CNBC was so sure it would go down on a democratic sweep and that&#39;s clearly not happening. Be careful about agendas in financial news, especially CNBC. It&#39;s all just confirmation bias day after day. (Not saying it doesn&#39;t have entertainment value; just be careful.)</p>\n</div><!-- SC_ON -->",
  "score": 2027,
  "permalink": "/r/investing/comments/krr06j/perhaps_the_biggest_narrative_on_cnbc_in_the_past/",
  "subreddit": "investing",
  "id": "krr06j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748512
}