{
  "author": "KingNanoBunny",
  "the_new_excerpt": "For those who don't know, there was a telegram group with over 100k members all\ntelling people to buy XRP and hold on feb 1st. This spread like crazy, I had\nfamily members asking me if they should buy XRP and hold on monday.\n\nProof of…",
  "original_created_utc": 1612188315,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些不知道的人来说，有一个电报群，有超过10万的成员，都是。\n告诉人们在2月1日买入XRP并持有。这个消息传得很疯狂，我有\n家人问我是否应该买入XRP并在周一持有。\n\n证明...",
      "title": "给最近的XRP抽水和倾销计划的每一个受害者的信息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些不知道的人來說，有一個電報羣，有超過10萬的成員，都是。\n告訴人們在2月1日買入XRP並持有。這個消息傳得很瘋狂，我有\n家人問我是否應該買入XRP並在週一持有。\n\n證明...",
      "title": "給最近的XRP抽水和傾銷計劃的每一個受害者的信息。"
    }
  ],
  "title": "Message to everyone who was a victim to the recent XRP pump and dump scheme.",
  "created_utc": 1612198626,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those who don&#39;t know, there was a telegram group with over 100k members all telling people to buy XRP and hold on feb 1st. This spread like crazy, I had family members asking me if they should buy XRP and hold on monday.</p>\n\n<p><a href=\"https://preview.redd.it/dfe8q79phve61.png?width=647&amp;format=png&amp;auto=webp&amp;s=d51630f806ab068caafa7d1f02c6c1b0d25a71e4\">Proof of group</a></p>\n\n<p>&#x200B;</p>\n\n<p>Heres the result... 40% dump in a few hours leading up to the time the group was telling people to hold till.</p>\n\n<p><a href=\"https://preview.redd.it/6yxhr097gve61.png?width=1973&amp;format=png&amp;auto=webp&amp;s=17ef678668fc318108348f1e5b2e7a128726a6ca\">https://preview.redd.it/6yxhr097gve61.png?width=1973&amp;format=png&amp;auto=webp&amp;s=17ef678668fc318108348f1e5b2e7a128726a6ca</a></p>\n\n<p>If you were a victim to this pump and dump, I&#39;m sorry for your losses. This is a tough life lesson for anyone new to investing. I don&#39;t mean to rub salt in the wound but this could be seen from a mile away, pump telegram channels ALWAYS have the exact same outcome. It&#39;s important you understand this to avoid getting burned in the future.</p>\n\n<p>How did this get so big?</p>\n\n<p>The GME movement has set off a chain reaction throughout all global markets and this pump and dump was perfectly timed to disguise itself as another revolution.</p>\n\n<p>Unfortunately the XRP pump and dump is almost the exact opposite, XRP is given out for free to huge businesses and celebrities who agree to a public partnership. Instead of screwing over the rich. You just pumped their bangs and gave them a decent amount of volume to dump into before the lawsuit.</p>\n</div><!-- SC_ON -->",
  "score": 521,
  "permalink": "/r/CryptoCurrency/comments/la3rkd/message_to_everyone_who_was_a_victim_to_the/",
  "subreddit": "CryptoCurrency",
  "id": "la3rkd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530870
}