{
  "author": "Frigorifico",
  "original_created_utc": 1636998930,
  "title": "Were the Sumerians a \"sex positive culture\"?",
  "created_utc": 1637009071,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a book called &quot;The first cities&quot; by Dora Jane Hamblin. In chapter five, page 104 in my edition, it includes a sumerian love song, and I&#39;struck by how sex positive it sounds.</p>\n\n<p>I can&#39;t write the whole thing here, but I&#39;ll include a couple of notable passages:</p>\n\n<blockquote>\n<p>Husband, the loved one of my heart,</p>\n\n<p>your beauty is large, sweet like honey</p>\n</blockquote>\n\n<p>I think it&#39;s quite clear this passage refers to a penis and semen, and in case you had any doubts there&#39;s also this passage:</p>\n\n<blockquote>\n<p>You have captivated me, please leave me trembling before you</p>\n\n<p>husband, I want you to take me to the nuptial chamber</p>\n</blockquote>\n\n<p>Here she clearly wants her husband to give her an orgasm</p>\n\n<p>But I think the most sex positive passage in the whole song is this one:</p>\n\n<blockquote>\n<p>Husband, you have enjoyed me</p>\n\n<p>tell this to my mother, she will give you many rewards,</p>\n\n<p>and my father, he will give you good gifts</p>\n</blockquote>\n\n<p>Today in most cultures telling a couple you &quot;enjoyed&quot; their daughter would be almost unthinkable. The notion they would you give you rewards or gifts for having sex with their daughter is completely absurd</p>\n\n<p>And the poem goes on with several other lines about how horny the author is and how much she wants to have sex with her husband</p>\n\n<p>Does this song really reflects how Sumerian people thought about sex?, or is this song an outlier?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/qum797/were_the_sumerians_a_sex_positive_culture/",
  "subreddit": "AskHistorians",
  "id": "qum797",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a book called \"The first cities\" by Dora Jane Hamblin. In chapter five,\npage 104 in my edition, it includes a sumerian love song, and I'struck by how\nsex positive it sounds.\n\nI can't write the whole thing here, but I'll include a couple of notable\npassages:\n\n> Husband, the loved one of my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドラ・ジェーン・ハンブリンの「The first cities」という本を持っています。第5章に\n第5章（私の版では104ページ）には、シュメールのラブソングが載っています。\nセックス・ポジティブな歌だと思いました。\n\n全部は書けませんが、いくつかの注目すべき箇所を紹介します。\nの一節を紹介します。\n\n> 夫よ、私の愛する人よ...",
      "title": "シュメール人は「セックス・ポジティブ・カルチャー」だった？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一本书叫《第一批城市》，作者是多拉-简-汉布林。在第五章。\n第104页，其中包括一首苏美尔人的情歌。\n我被它听起来多么积极的性行为所震惊。\n\n我不能在这里写下全部内容，但我将包括几个值得注意的\n段落。\n\n> 丈夫，我所爱的人...",
      "title": "苏美尔人是一种 \"性积极文化 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一本書叫《第一批城市》，作者是多拉-簡-漢布林。在第五章。\n第104頁，其中包括一首蘇美爾人的情歌。\n我被它聽起來多麼積極的性行爲所震驚。\n\n我不能在這裏寫下全部內容，但我將包括幾個值得注意的\n段落。\n\n> 丈夫，我所愛的人...",
      "title": "蘇美爾人是一種 \"性積極文化 \"嗎？"
    }
  ]
}