{
  "author": "bravequeer",
  "original_created_utc": 1639568519,
  "title": "when talking about the spread of misinformation on health and politics, why do media outlets only talk about online cults and social media, but not the fact that many reputable news sources and online papers are paywalled?",
  "created_utc": 1639583539,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;the above text.  my state is implementing new covid19 guidelines due to concerns around omicron, but when I try to read the LA times or NY times, vital information is paywalled.  The articles provided on some topics have a variety of useful links grouped together for anyone trying to learn more about the pandemic + how to best stay safe, but it&amp;#39;s relatively inaccessible.  If people are so concerned about misinformation spreading, why are articles with life saving info paywalled?  Wouldn&amp;#39;t removing the paywall from at least, only topics regarding really urgent info help fight this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/rgx7hk/when_talking_about_the_spread_of_misinformation/",
  "subreddit": "TooAfraidToAsk",
  "id": "rgx7hk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "the above text. my state is implementing new covid19 guidelines due to concerns\naround omicron, but when I try to read the LA times or NY times, vital\ninformation is paywalled. The articles provided on some topics have a variety of\nuseful links grouped together for anyone trying to learn more about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の住んでいる州では、懸念されたため、新しいCovid19ガイドラインを導入しています。\nしかし、LAタイムズやNYタイムズを読もうとすると、肝心なところで\nの情報は有料です。一部のトピックで提供されている記事には、さまざまな\nもっと詳しく知りたい人には、便利なリンクがまとめられている...",
      "title": "健康や政治に関する誤った情報の拡散について語るとき、なぜメディアはネットカルトやソーシャルメディアの話ばかりで、多くの信頼できるニュースソースやオンラインペーパーが有料であることを語らないのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所在的州正在实施新的covid19准则，因为对omicron的担忧。\n但当我试图阅读《洛杉矶时报》或《纽约时报》时，重要的是\n重要信息都被封锁了。在一些主题上提供的文章有各种\n试图了解更多信息的人，把各种有用的链接放在一起......",
      "title": "在谈论有关健康和政治的错误信息的传播时，为什么媒体只谈论在线邪教和社交媒体，而不谈论许多有信誉的新闻来源和在线报纸都是付费的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所在的州正在實施新的covid19準則，因爲對omicron的擔憂。\n但當我試圖閱讀《洛杉磯時報》或《紐約時報》時，重要的是\n重要信息都被封鎖了。在一些主題上提供的文章有各種\n試圖瞭解更多信息的人，把各種有用的鏈接放在一起......",
      "title": "在談論有關健康和政治的錯誤信息的傳播時，爲什麼媒體只談論在線邪教和社交媒體，而不談論許多有信譽的新聞來源和在線報紙都是付費的？"
    }
  ]
}