{
  "author": "LongLiveTheCrown",
  "the_new_excerpt": "AMC holds sentimental value to me. I grew up going to movie theaters with\nfriends, and I think it holds sentimental value with plenty of you as well. It’s\none thing for a company to fail due to bad business, and it's another for it to\nfail due to a random, unexpected, unpreventable pandemic.\n\nThese…",
  "original_created_utc": 1612191931,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "AMC对我来说有感情价值。我从小到大都是和\n朋友们，我想这对你们很多人也有感情价值。它的\n一家公司因经营不善而倒闭是一回事，而它是另一回事。\n由于随机的、意外的、不可预防的大流行病而失败。\n\n这些...",
      "title": "AMC。不同的投资方式"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "AMC對我來說有感情價值。我從小到大都是和\n朋友們，我想這對你們很多人也有感情價值。它的\n一家公司因經營不善而倒閉是一回事，而它是另一回事。\n由於隨機的、意外的、不可預防的大流行病而失敗。\n\n這些...",
      "title": "AMC。不同的投資方式"
    }
  ],
  "title": "AMC: A Different Kind of Investing",
  "created_utc": 1612213187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>AMC holds sentimental value to me. I grew up going to movie theaters with friends, and I think it holds sentimental value with plenty of you as well. It’s one thing for a company to fail due to bad business, and it&#39;s another for it to fail due to a random, unexpected, unpreventable pandemic.</p>\n\n<p>These last few weeks have taught the retail investor, and everyone, a valuable lesson. It was really only a matter of time until something like this occurred: that the internet would form a substantial community of ongoing communication large enough to eventually take on larger financial institutions. The retail investor has never had this much buying power ever before, and because of the nature of the internet, I see that as being unlikely to change. Thus the stock market has become, and will become, more reflective of a democracy. Middle class individuals, when working together, have the power to make the changes we want to see in the stock market. We can save the companies we want to save.</p>\n\n<p>Now, none of this is to say that fundamentals don&#39;t matter. Fundamentals matter. But, not only do fundamentals affect stock prices, but stock prices (can) affect fundamentals. A projected growth for a corporation can be self fulfilling. An increasing stock price (which has been suppressed by short sellers), can open many new opportunities for AMC and truly be a game changer for their business.</p>\n\n<p>America’s entertainment industry is the largest in the world and an integral piece of our economy. Do we the people want to allow movie theaters to become a thing of the past? I don&#39;t. And with a Democratic Spirit, I will vote with my money for a future I&#39;d like to see.</p>\n\n<p>I&#39;d love to hear your thoughts on this. Of course, this strategy, of creating value vs finding value, is not for every investor. But I think there is a paradigm shift occurring, where there is a new possibility of helping companies we like. Feel free to disagree with any of this, I&#39;d just like to hear your thoughts.</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/stocks/comments/la53ak/amc_a_different_kind_of_investing/",
  "subreddit": "stocks",
  "id": "la53ak",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518539379
}