{
  "author": "tycho_bruhe",
  "the_new_excerpt": "According to an article posted on the Chinese Ministry of Commerce website on\nThursday, Wang Weidong, commercial counselor of the Chinese Embassy in Germany,\nmet with Zhang by video on December 9 to exchange views on NIO's current\nsituation and development plans.\n\nThe meeting means that NIO seems to…",
  "original_created_utc": 1607767514,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "根据中国商务部网站上发布的一篇文章，\n星期四，中国驻德国大使馆商务参赞王卫东，\n12月9日通过视频会见了张，就NIO目前的情况交换了意见\n形势和发展规划。\n\n这次会议意味着NIO对…来说似乎",
      "title": "最近，NIO德国公司总经理会见了中国驻这个欧洲国家的外交官，并介绍了NIO的海外发展计划。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據中國商務部網站上發佈的一篇文章，\n星期四，中國駐德國大使館商務參贊王衛東，\n12月9日通過視頻會見了張，就NIO目前的情況交換了意見\n形勢和發展規劃。\n\n這次會議意味着NIO對…來說似乎",
      "title": "最近，NIO德國公司總經理會見了中國駐這個歐洲國家的外交官，並介紹了NIO的海外發展計劃。"
    }
  ],
  "title": "General manager of NIO Germany, recently met with a Chinese diplomat in the European country and introduced NIO's overseas development plans.",
  "created_utc": 1607945298,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>According to an article posted on the Chinese Ministry of Commerce website on Thursday, Wang Weidong, commercial counselor of the Chinese Embassy in Germany, met with Zhang by video on December 9 to exchange views on NIO&#39;s current situation and development plans.</p>\n\n<p>The meeting means that NIO seems to be not far from entering the European market.</p>\n\n<p>On July 24 this year, William Li Bin, founder of NIO, said in response to a question about whether the company planned to enter the overseas market, &quot;I should say that we are now close to thinking it through and have started to gradually enter the execution state, which means we are starting to prepare our products and personnel.&quot;</p>\n\n<p><a href=\"https://cntechpost.com/2020/12/12/nio-is-closer-to-entering-overseas-markets/\">https://cntechpost.com/2020/12/12/nio-is-closer-to-entering-overseas-markets/</a></p>\n</div><!-- SC_ON -->",
  "score": 943,
  "permalink": "/r/stocks/comments/kbmqmq/general_manager_of_nio_germany_recently_met_with/",
  "subreddit": "stocks",
  "id": "kbmqmq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493104
}