{
  "author": "SilentRhetoric",
  "the_new_excerpt": "Long-time lurker, first-time poster here. I saw some complaints about the\nbalance of meme posts, so I thought I’d write up a few things I’ve learned as\nsomeone new to crypto in the last month or so. The market is down almost across\nthe board right now, so let’s take a moment to reflect!\n\nMostly…",
  "original_created_utc": 1616628978,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "长期潜伏者，第一次在这里发帖。我看到一些关于\nmeme帖子的平衡，所以我想我会写出一些东西，我已经学会了作为\n在过去的一个多月里，一个刚接触加密技术的人。市场的下跌几乎贯穿\n现在的董事会，所以让我们花点时间来反思！\n\n主要是...",
      "title": "趁着市场下跌，一个加密入门者的几点思考"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長期潛伏者，第一次在這裏發帖。我看到一些關於\nmeme帖子的平衡，所以我想我會寫出一些東西，我已經學會了作爲\n在過去的一個多月裏，一個剛接觸加密技術的人。市場的下跌幾乎貫穿\n現在的董事會，所以讓我們花點時間來反思！\n\n主要是...",
      "title": "趁着市場下跌，一個加密入門者的幾點思考"
    }
  ],
  "title": "A few thoughts from a crypto-beginner while the market is down",
  "created_utc": 1616644459,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Long-time lurker, first-time poster here.  I saw some complaints about the balance of meme posts, so I thought I’d write up a few things I’ve learned as someone new to crypto in the last month or so.  The market is down almost across the board right now, so let’s take a moment to reflect!</p>\n\n<p>Mostly-unstructured thoughts, in no particular order:</p>\n\n<ol>\n<li><p>Background: I studied finance and have some relevant professional experience.  I’ve read about crypto projects for years out of interest, but never took the step of actually buying any until recently.  I regarded cryptocurrency as a bit too inviting of a facility for illicit activity for my taste, and I didn’t want to be complicit in that.  I am actually glad to see that there are now KYC steps in the US to set up crypto accounts, and the process actually gives some comfort in the sense that it feels like a traditional banking interaction, not like you’re doing something in the shadows.  I think there are amazing possibilities with DeFi, but there is also a balance to be struck when it comes to integrating with traditional institutions and markets, which will remain dominant for the foreseeable future.</p></li>\n<li><p>First steps: I started with Coinbase because I wanted to see what the IPO was about.  I researched some other exchanges but never funded them.  Coinbase seems to be trying to achieve “Cash app” levels of simplicity around crypto, to a fault in my view.  If someone just wanted to do a one-off trade or a specific purpose or sit on it, it does make it easy and intuitive to get started.  The trading fees are absurd, though, and you quickly run into a wall of limited functionality.  However, I enjoyed the learning videos you can do for a small pile of altcoins, even if some of them are below the minimum trade size, and thus require buying more if you want to sell them for fiat (which is a bit of a racket).</p></li>\n<li><p>Better tools: Coinbase Pro improves significantly on the fee structure and trading dashboard.  This is where I’d recommend someone start to cut their teeth on basic trading tools and charts, as the designers have done a good job of conveying a lot of information in a dense but uncluttered way.  You can also utilize some different order types to make your trading experience easier.  Anyone familiar with trading stocks, for example, will find this interface familiar, if a bit sparse on labeling.  </p></li>\n<li><p>Diversification: I’ve been working over the past month to set up a small but broadly diversified portfolio across the vast majority of assets available in fiat and stablecoin markets.  The goal is to be allocated nearly evenly across everything with a slight bias toward anything that has broken into mainstream markets, which is just Bitcoin and Ether for now with CME futures trading.  In the long run, I want to be able to ride a rising tide without worrying too much about specific assets, and I am too risk averse for concentrated investments.</p></li>\n<li><p>Volatility: I definitely believe in efficient markets theory and the random walk, so I’m trying not to fret too much about the swings and just try to make sound decisions.  I’ve dabbled a bit in trying to trade around the volatility with more advanced order setups, and sometimes that works!  But sometimes the whole market is just down, hard, and I try to go do something else and not worry about it too much.  I’m not a gambler by nature—it just doesn’t light up my neurons the way it does for some people—but I can see how having a crypto trading app on your phone could become a serious problem for people who are unprepared for the emotional roller coaster and the temptations it brings.  As I am building out a portfolio in buy mode, I’m mostly just setting buy limits well below the market and letting the dips get me filled.  </p></li>\n<li><p>Doing homework: In the process of diversifying, I’ve gotten to learn a bit about dozens of different assets and technologies which are trying to achieve different things.  There are coins from hard forks (BCH), coins that are recorded on a non-native blockchain (Wrapped BTC), coins with unique angles (COMP), and coins intended to facilitate transactions instead of appreciation (XLM).  There are also notices about token conversions This is all deeply fascinating to me, and the Stellar network stands out as something with serious potential to be more functionally useful, with which many crypto assets have major impediments.</p></li>\n<li><p>New launches:  You win some, and you lose some.  I caught one on the up by pure luck—being in the right place at the right time—and then not long after bought ADA essentially at its peak.  Whoops—now I know what pump and dump means!  I’ll definitely be digging a bit deeper before the next time I participate in launch-day trading.  It was fun to spend an hour really watching the order book, though.  </p></li>\n<li><p>NFTs: This was a fun rabbit hole to go down and see what’s happening in the digital art space.  I think the concept could have a ton of potential in the future, and the silly things like tweets and gifs are just early pioneers of an emerging technology, not unlike porn has been for advances in media formats and the internet, itself.  I do think that people paying millions for meaningless NFTs during this bubble will certainly be memorialized alongside tulip bulbs and other famous crazes in which many winners and losers are created but ultimately become a household joke.</p></li>\n<li><p>Areas of further study: Another hobby of mine is learning more about computing, so I may try to set up a Stellar node or maybe learn how to plug into the Coinbase API through Python.  When I was in college, I considered but ultimately did not pursue computer science, and I sort of regret that now.  Nonetheless, I believe that it is increasingly important to be technically capable alongside other skills, and so I am working in my spare time to learn some programming languages and related tools.  I’ve done some basic API integrations so far, but I definitely need to push myself into more intermediate stuff like concurrency, data structures, and setting up more complex environments.</p></li>\n<li><p>Community: The crypto community can be refreshingly clear-eyed about the experience of being involved with crypto.  From Elon’s Twitter hype to the environmental impact of Bitcoin mining to the psychology of following such a crazy asset class, I enjoy reading the discourse here and in other forums.  Many thanks as well to people who create guides and open-source tools, including the assets themselves!  The world could be a better place if the FOSS ethos was applied to more aspects of life.  And finally, I might just go out on a limb and say that the crypto community makes the best memes I have ever seen on the ‘net.  Gauntlet thrown!</p></li>\n</ol>\n\n<p>Thanks for reading my ramblings!  May your buys align with the dips!</p>\n\n<p>By request, TL;DR:</p>\n\n<p>Jumped in after 10 yrs of watching.  Getting started was easy.  Coinbase Pro &gt;&gt;&gt; regular.  I’m diversified.  Volatility is wild; beware.  Homework is (not) fun.  ADA was a pump-and-dump at Coinbase.  NFTs are a fad.  I want to run a Stellar node.  Y’all are cool.</p>\n</div><!-- SC_ON -->",
  "score": 384,
  "permalink": "/r/CryptoCurrency/comments/mck3bh/a_few_thoughts_from_a_cryptobeginner_while_the/",
  "subreddit": "CryptoCurrency",
  "id": "mck3bh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752818308
}