{
  "author": "Some1fromReddit",
  "original_created_utc": 1626406849,
  "title": "My crypto goal is to be rich enough where I can live the rest of my life only needing a robe, and boots.",
  "created_utc": 1626420618,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You might say I can do that now by just being a bum but it&#39;s not the same.   I will be rich, so I can just stay in hotels.    I will shower but I will never groom.   </p>\n\n<p>Just want to be a big beard, tons of chest hair growing out so it sticks out, and small gold chain buried in a pile of curls. Free balling </p>\n\n<p>Just walk around the rest of my life passing out on random beautiful beaches....and getting kicked out.    Everyone will treat me like a bum...    Just like now. </p>\n\n<p>But at least I will be crypto rich. Nobody will know it. I won&#39;t buy anyone drinks at a bar, I won&#39;t hold the door for anyone.   Just a stingy person.   and I won&#39;t speak to anyone who talks to me.  I will only speak to them.  </p>\n\n<p>I only need about $2000 a month to travel. </p>\n\n<p>I figured I&#39;m as good as dead in 40 years from now. So $24K a year x 40.    I need one mill after taxes to do this.   </p>\n\n<p>I&#39;m ready.  My body is ready.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/ol8s3j/my_crypto_goal_is_to_be_rich_enough_where_i_can/",
  "subreddit": "CryptoCurrency",
  "id": "ol8s3j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You might say I can do that now by just being a bum but it's not the same. I\nwill be rich, so I can just stay in hotels. I will shower but I will never\ngroom.\n\nJust want to be a big beard, tons of chest hair growing out so it sticks out,\nand small gold chain buried in a pile of curls. Free…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今では、ただのクズでもそれができると言われるかもしれませんが、それとは違うのです。I\n金持ちになるから、ホテルに泊まればいいんだ。シャワーを浴びることはあっても、手入れをすることは\n新郎。\n\nただ、大きなヒゲを生やし、胸毛を大量に生やして突き出すようになりたい。\nそして、小さな金の鎖を巻き毛の山に埋めている。無料で...",
      "title": "私の暗号化の目標は、ローブとブーツだけで残りの人生を過ごせるくらいのお金持ちになることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可能会说我现在只要做一个流浪汉就可以了，但这是不一样的。I\n我将变得富有，所以我可以只住在酒店里。我可以洗澡，但我永远不会\n新郎。\n\n只想成为一个大胡子，成吨的胸毛长出来，这样就可以突出来了。\n埋在一堆卷发里的小金链。自由...",
      "title": "我的加密货币目标是变得足够富有，使我的余生只需要一件长袍和靴子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能會說我現在只要做一個流浪漢就可以了，但這是不一樣的。I\n我將變得富有，所以我可以只住在酒店裏。我可以洗澡，但我永遠不會\n新郎。\n\n只想成爲一個大鬍子，成噸的胸毛長出來，這樣就可以突出來了。\n埋在一堆捲髮裏的小金鍊。自由...",
      "title": "我的加密貨幣目標是變得足夠富有，使我的餘生只需要一件長袍和靴子。"
    }
  ]
}