{
  "author": "Dr_Talon",
  "original_created_utc": 1638944187,
  "title": "How did high rates of parental PTSD impact the baby-boomer generation?",
  "created_utc": 1639019517,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many baby boomers were raised by fathers who were part of the greatest generation that fought in World War II or the silent generation that fought in the Korean War.  &lt;/p&gt;\n\n&lt;p&gt;Given that so many men of these generations saw combat, it is likely that many of them had PTSD.  How did this impact the upbringing of their children, the baby boomers?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/rbkjsk/how_did_high_rates_of_parental_ptsd_impact_the/",
  "subreddit": "AskHistorians",
  "id": "rbkjsk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Many baby boomers were raised by fathers who were part of the greatest\ngeneration that fought in World War II or the silent generation that fought in\nthe Korean War.\n\nGiven that so many men of these generations saw combat, it is likely that many\nof them had PTSD. How did this impact the upbringing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "団塊の世代は、父親が偉大な人たちばかりであったので、その人たちに育てられた。\n第二次世界大戦を戦った世代、サイレントジェネレーションを戦った世代\n朝鮮戦争\n\nこれらの世代で戦闘に参加した男性は非常に多いので、おそらく多くの人が\nを発症していた。そのことがどのように生い立ちに影響を与えたのか...。",
      "title": "親のPTSD率の高さは、団塊の世代にどのような影響を与えたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多婴儿潮一代的父亲都是参加过二战的最伟大的一代人或沉默的一代人。\n属于参加第二次世界大战的最伟大的一代或参加朝鲜战争的沉默的一代。\n朝鲜战争。\n\n鉴于这几代人中有如此多的人参加过战斗，很可能他们中的许多人都有创伤后应激障碍。\n他们中的许多人有创伤后应激障碍。这对他们的成长有何影响？",
      "title": "父母创伤后应激障碍的高发病率是如何影响婴儿潮一代的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多嬰兒潮一代的父親都是參加過二戰的最偉大的一代人或沉默的一代人。\n屬於參加第二次世界大戰的最偉大的一代或參加朝鮮戰爭的沉默的一代。\n朝鮮戰爭。\n\n鑑於這幾代人中有如此多的人蔘加過戰鬥，很可能他們中的許多人都有創傷後應激障礙。\n他們中的許多人有創傷後應激障礙。這對他們的成長有何影響？",
      "title": "父母創傷後應激障礙的高發病率是如何影響嬰兒潮一代的？"
    }
  ]
}