{
  "author": "Bored_Schoolgirl",
  "original_created_utc": 1636284527,
  "title": "In the Bible, Moses and an Egyptian Pharaoh Were Involved in a Bitter Dispute. Were the Events like the “Angel of Death” and Various Plagues by “Yahweh” Recorded by Egyptians?",
  "created_utc": 1636307092,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I couldn’t find any sources that didn’t involve using the Bible as proof of these series of events. I’m curious if the Egyptians ever recorded some or all of these events in their perspective. In my eyes, any source outside the Bible makes the story of Moses more credible. Is the story of Moses, specifically in reference to his dispute with an Egyptian pharaoh for the freedom of his people, have any evidence of it happening? Does it have any historical basis outside of the Bible?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/qomodk/in_the_bible_moses_and_an_egyptian_pharaoh_were/",
  "subreddit": "AskHistorians",
  "id": "qomodk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I couldn’t find any sources that didn’t involve using the Bible as proof of\nthese series of events. I’m curious if the Egyptians ever recorded some or all\nof these events in their perspective. In my eyes, any source outside the Bible\nmakes the story of Moses more credible. Is the story of Moses,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、これらの証拠として聖書を使っていないソースを見つけることができませんでした。\nこれらの一連の出来事の証拠として聖書を使わない資料は見つかりませんでした。エジプト人がこれらの出来事の一部または全部を彼らの視点で記録したことがあるかどうか興味があります。\nエジプト人がこれらの出来事の一部または全部を彼らの視点で記録したかどうか気になります。私の目には、聖書以外の資料があれば\nモーゼの話の信憑性を高めています。モーゼの物語は、...",
      "title": "聖書の中で、モーセとエジプトのファラオは険悪な争いをしていました。死の天使」や「ヤハウェ」による様々な災いなどの出来事を、エジプト人は記録していたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我找不到任何不涉及使用《圣经》作为证据的资料。\n这一系列的事件。我很好奇，埃及人是否曾经在他们的观点中记录了一些或全部的\n这些事件在他们的视角中。在我眼里，《圣经》以外的任何来源\n使得摩西的故事更加可信。摩西的故事，是...",
      "title": "在《圣经》中，摩西和埃及法老被卷入了一场痛苦的争执。埃及人是否记录了 \"死亡天使 \"和 \"耶和华 \"的各种灾难等事件？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我找不到任何不涉及使用《聖經》作爲證據的資料。\n這一系列的事件。我很好奇，埃及人是否曾經在他們的觀點中記錄了一些或全部的\n這些事件在他們的視角中。在我眼裏，《聖經》以外的任何來源\n使得摩西的故事更加可信。摩西的故事，是...",
      "title": "在《聖經》中，摩西和埃及法老被捲入了一場痛苦的爭執。埃及人是否記錄了 \"死亡天使 \"和 \"耶和華 \"的各種災難等事件？"
    }
  ]
}