{
  "author": "staz5",
  "the_new_excerpt": "If you bought at the ATH, then re evaluate your investing strategy because\nclearly you chase hype and buy when the hype is almost over.\n\nBTC and the whole crypto space isn’t going anywhere. If you are upset you didn’t\nbecome a millionaire in two months, then stop what you’re doing; and go to…",
  "original_created_utc": 1621626723,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ATHで購入したのであれば、自分の投資戦略を見直してみてください。\n明らかにあなたは誇大広告を追いかけ、誇大広告がほとんど終わってから買っている。\n\nBTCと暗号空間全体はどこにも行きません。もしあなたが2ヶ月で億万長者になれなかったことに腹を立てているなら\n2ヶ月で億万長者になれなかったことに腹を立てているのであれば、今やっていることをやめて、...",
      "title": "いい加減な「終わった投稿」.... 何も終わっていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你在ATH买入，那就重新评估你的投资策略，因为\n很明显，你在追逐炒作，在炒作快结束时买入。\n\nBTC和整个加密货币领域不会有任何发展。如果你不高兴你没有在两个月内\n两个月内成为百万富翁，那么请停止你正在做的事情；并去...",
      "title": "够了，这些蹩脚的 \"结束了的帖子\"....，没有什么是结束的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你在ATH買入，那就重新評估你的投資策略，因爲\n很明顯，你在追逐炒作，在炒作快結束時買入。\n\nBTC和整個加密貨幣領域不會有任何發展。如果你不高興你沒有在兩個月內\n兩個月內成爲百萬富翁，那麼請停止你正在做的事情；並去...",
      "title": "夠了，這些蹩腳的 \"結束了的帖子\"....，沒有什麼是結束的。"
    }
  ],
  "title": "Enough with these lame “it’s over post”.... nothing is over.",
  "created_utc": 1621655655,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you bought at the ATH, then re evaluate your investing strategy because clearly you chase hype and buy when the hype is almost over. </p>\n\n<p>BTC and the whole crypto space isn’t going anywhere. If you are upset you didn’t become a <em>millionaire</em> in two months, then stop what you’re doing; and go to the <em>casino</em> and feed your gambling addiction. </p>\n\n<p>If you believe in the future of block chain and what this ecosystem can bring to real world projects and problems, then you know what is about to happen. </p>\n\n<p>It’s very sad to come on here and see people just flat out complaint that BTC isn’t <em>pumping</em> every single day, 365. </p>\n\n<p>Realize what the wealthy are doing, they are buying up all your coins that you are panic selling because you want a <em>lambo</em> or for some weird ass reason you want to go to the <em>moon</em> </p>\n\n<p>Enjoy your <em>time</em> on earth and stfu. </p>\n\n<p>TL;DR you all are acting like dweebs. Well the new <em>traders</em> or we should call them gamblers.</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "permalink": "/r/CryptoCurrency/comments/ni19am/enough_with_these_lame_its_over_post_nothing_is/",
  "subreddit": "CryptoCurrency",
  "id": "ni19am",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383344
}