{
  "author": "ProgrammerChance8844",
  "original_created_utc": 1631990505,
  "title": "I researched VeChain (VET), here's what I found!",
  "created_utc": 1632036640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is the fourth post of this style that I made, if you&#39;re interested I&#39;ve made similar posts on <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pqdzv4/i_researched_ergo_erg_heres_what_i_found/\">Ergo</a>, <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/poypm0/i_researched_xinfin_network_xdc_heres_what_i/\">XDC</a> &amp; <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/po94kv/i_researched_stellar_lumens_xlm_heres_what_i_found/\">XLM</a>.</p>\n\n<p>Disclaimer: VET makes up about 5% of my portfolio</p>\n\n<h1>What is VeChain?</h1>\n\n<p><a href=\"https://preview.redd.it/8izc6k5no9o71.jpg?width=780&amp;format=pjpg&amp;auto=webp&amp;s=71a06e828445813bb5cbcd31bb1ad44e597c12da\">https://preview.redd.it/8izc6k5no9o71.jpg?width=780&amp;format=pjpg&amp;auto=webp&amp;s=71a06e828445813bb5cbcd31bb1ad44e597c12da</a></p>\n\n<p>Counterfeiting, supply chain management, food safety, parcel tracing, certificates. </p>\n\n<p>All of these have something in common; They can all benefit from Blockchain technology.</p>\n\n<p>VeChain uses blockchain technology to tackle the growing issues of supply chains. The digital identification of the assets on their blockchain will allow for transparent production lines, asset traceability &amp; authenticity of said assets.</p>\n\n<p>Started in 2015, it is focused on business applications, primarily in the logistics field through supply chain management that provides tracking, quality control, inventory management, and much more.</p>\n\n<p>VeChain is a blockchain-as-a-service company that has supply chain management solutions for companies. They will use a wide variety of devices (IoT, RFID, NFC) to store data about a supply chain on their blockchain. </p>\n\n<p>How this works is simple; Goods &amp; products will get their own &quot;tag&quot;. During the products&#39; journey from point A to point B the data that is gathered from prior mentioned devices will be uploaded to the blockchain for everyone to see. </p>\n\n<p>This might still be a bit confusing so let&#39;s use a real life example to further illustrate this:</p>\n\n<p><em>VeChain and I-Dante Co-developed E-HCert, A Blockchain-based Covid-19 Records App For Mediterranean Hospital of Cyprus.</em> </p>\n\n<p>Everyone that got a covid-19 certificate will have an identifier of their certificate stored on the blockchain (let&#39;s say your <strong>Certificate ID</strong>). This allows anyone to check the authenticity of the certificate by seeing if your certificate ID has been published to the blockchain by the hospital&#39;s VeChain account.</p>\n\n<p>&#x200B;</p>\n\n<p>By using blockchain the data gathered from digital assets becomes trustless and tamperproof, enabling valuable information to be shared between manufacturers, suppliers, transporters and customers.  However, the methodology of this is unclear because VeChain have failed to release a whitepaper. This leaves the general public in the dark regarding how blockchain is actually utilised.</p>\n\n<p>In short: VeChain&#39;s blockchain is a hub for people to put data on the blockchain, the VeChain company sets up infrastructure with other enterprises that will then utilise the VeChain blockchain</p>\n\n<h1>Proof of Authority</h1>\n\n<p>VeChain runs on a Proof of Authority (PoA) consensus model that requires nodes by authorized before they can participate in blockchain consensus. Once a node becomes authorized it joins the pool of other authorized nodes and each has an equal chance of publishing new blocks and receiving rewards. Under this system the rich nodes have no advantages, and there is no requirement for nodes to compete with one another and use vast amounts of resources. </p>\n\n<p>Authority masternodes are the network maintainers of the VeChain blockchain.  Each Authority Masternode or AM must hold at least 25 million VET tokens to become eligible. These nodes are the only ones that can pack new blocks on the blockchain and are rewarded by 30% of the transaction fee in each block.  While anyone can become an AM, a person or organization must go through an ID verification and background check and be approved by the VeChain Foundation beforehand.</p>\n\n<p>Because all authority master nodes can be trusted, blocks can be packed much faster and is more cost-efficient than PoW or PoS.  AM nodes disclose their identity and stake their money and reputation for the right to produce new blocks. </p>\n\n<p>&#x200B;</p>\n\n<p><em>Processing img xplnn6ga1bo71...</em></p>\n\n<p>Although PoA has obvious advantages, and the VeChainThor blockchain continues to operate efficiently and securely, there are remaining limitations to this consensus method. One of these limitations is an inability to prevent a node from manipulating the entire system when it has the right to add a new block. </p>\n\n<p>Because of these limitations the VeChain Foundation is working on the next generation of Proof of Authority, which they are calling PoA 2.0. This new version of PoA will give the network the stability and security needed to support the growing number of business use cases on-chain. According to the VeChain Whitepaper 2.0 the new PoA 2.0 will deliver: </p>\n\n<ol>\n<li>Complete finality on blocks &amp; transactions</li>\n<li>Better stability for their Blockchain as a Service model</li>\n<li>Faster-converging probabilistic finality, which will result in faster transaction confirmation for applications </li>\n</ol>\n\n<h1>Partnerships</h1>\n\n<p>Probably VeChain&#39;s strongest selling point is the heaps of partnerships it has.</p>\n\n<p>&#x200B;</p>\n\n<p><em>Processing img bcgxr6vh3bo71...</em></p>\n\n<p><a href=\"https://preview.redd.it/1r415sal3bo71.jpg?width=670&amp;format=pjpg&amp;auto=webp&amp;s=cd232c6bdd2946e33a25b251e0ef333a6f5673a2\">https://preview.redd.it/1r415sal3bo71.jpg?width=670&amp;format=pjpg&amp;auto=webp&amp;s=cd232c6bdd2946e33a25b251e0ef333a6f5673a2</a></p>\n\n<p>With LVMH, VeChain is developing a system that tracks limited edition luxury goods. Pirating of these types of products is widespread, especially in China and Southeast Asia. With LVHM’s broad offerings of luxury goods, this is a perfect partnership. </p>\n\n<p>VeChain has also been working with DNV GL to increase the transparency of products from the factory or farm to the consumer. In this partnership, VeChain has developed a blockchain-powered digital assurance solution they’ve called MyStory.</p>\n\n<p>Using this dApp consumers are able to learn about the story behind a bottle of wine from the vineyard, to the bottler, through distribution, and to their store’s shelves. All this is accomplished by simply scanning a QR code on the wine bottle.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/21q34o4u3bo71.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=3ba42ddb03396155a30dffd62da237514ff369a2\">VeChain depicted on wine bottles</a></p>\n\n<h1>The Team</h1>\n\n<p>The primary driving force behind the adoption of VeChain and the VET token is the <strong>VeChain Foundation</strong>, an organization founded in Singapore which governs and maintains the project, its development, and promotion. The Foundation is governed by the Steering Committee, which is elected every two years and is currently represented by the project founders.</p>\n\n<p><strong>Sunny Lu</strong> is the CEO of VeChain and one of the founding members of VeChain. Prior to founding VeChain, he was CIO at Louis Vuitton China. He has over a decade of experience working for Fortune 500 companies in executive IT positions.</p>\n\n<p><strong>Jay (Jie) Zhang</strong> was the CFO at VeChain, and is also a co-founder of the project. Due to the hack that occurred in December 2019, which he accepted full responsibility for, he has reportedly stepped down from his role as CFO, although the VeChain website still lists him as the project’s CFO. Prior to working at VeChain he was employed at Deloitte and prior to that he spent more than a dozen years with PwC. He was responsible for the design of the VeChain governance framework. </p>\n\n<p><strong>Kevin Feng</strong> is a partner at VeChain and acts as the COO of the project. He came to VeChain with over 12 years of experience working at PwC. His expertise is in risk assurance and cybersecurity, and he was a driving force behind the development of PwC’s blockchain services. </p>\n\n<p><strong>Jianliang Gu</strong> is the CTO at VeChain, coming from TCL &amp; Alcatel’s R&amp;D center he has more than 16 years of experience developing mobile hardware and software. He has amassed over 100 patents in the mobile communication field.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pqrzim/i_researched_vechain_vet_heres_what_i_found/",
  "subreddit": "CryptoCurrency",
  "id": "pqrzim",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is the fourth post of this style that I made, if you're interested I've\nmade similar posts on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私が作ったこのスタイルの4回目の投稿です。\n似たような投稿は...",
      "title": "VeChain(VET)について調べてみました！こんな感じです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我做的第四个关于这种风格的帖子，如果你有兴趣，我已经在\n上发表过类似的帖子...",
      "title": "我研究了VeChain(VET)，这是我的发现!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我做的第四個關於這種風格的帖子，如果你有興趣，我已經在\n上發表過類似的帖子...",
      "title": "我研究了VeChain(VET)，這是我的發現!"
    }
  ]
}