{
  "author": "Mrbighock",
  "the_new_excerpt": "This man is probably among the humans with the largest carbon footprint on the\nplanet. This man flies private jets around the world, mines lithium for car\nbatteries ( may be the worst thing humans are doing to the environment period)\nand literally shoots rockets into space which use ridiculously…",
  "original_created_utc": 1621023348,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この男は、地球上で最も多くの二酸化炭素を排出している人間の一人だろう。\nこの男は 世界中でプライベートジェットを飛ばし、車のバッテリー用のリチウムを採掘しています。\n車のバッテリー用にリチウムを採掘しています（人間が環境に与えている最悪の事態かもしれません）。\nそして、文字通りロケットを宇宙に打ち上げていますが、その際に使用するのは、とんでもなく...",
      "title": "イーロン・マスクは完全に無視されるべき"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个人可能是地球上碳足迹最大的人之一。\n地球上碳足迹最大的人之一。这个人在世界各地驾驶私人飞机，为汽车电池开采锂矿。\n电池（这可能是人类对环境所做的最糟糕的事情）。\n并将火箭射入太空，这些火箭使用了令人发指的......",
      "title": "埃隆-马斯克应该被彻底忽视"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個人可能是地球上碳足跡最大的人之一。\n地球上碳足跡最大的人之一。這個人在世界各地駕駛私人飛機，爲汽車電池開採鋰礦。\n電池（這可能是人類對環境所做的最糟糕的事情）。\n並將火箭射入太空，這些火箭使用了令人髮指的......",
      "title": "埃隆-馬斯克應該被徹底忽視"
    }
  ],
  "title": "Elon Musk should be ignored completely",
  "created_utc": 1621054135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This man is probably among the humans with the largest carbon footprint on the planet. This man flies private jets around the world, mines lithium for car batteries ( may be the worst thing humans are doing to the environment period) and literally shoots rockets into space which use ridiculously large amounts of jet fuel, and hes now launching thousands and thousands of satellites into space. This man is polluting the earth and now outer space and were supposed to listen to him talk about bitcoins consumption? Its absurd how hypocritical he is. If we are alone in the universe he might be the most polluting thing that exists in our reality...</p>\n</div><!-- SC_ON -->",
  "score": 476,
  "permalink": "/r/CryptoCurrency/comments/nchvrs/elon_musk_should_be_ignored_completely/",
  "subreddit": "CryptoCurrency",
  "id": "nchvrs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798336
}