{
  "author": "cefpodoxime",
  "the_new_excerpt": "https://www.barrons.com/articles/the-great-chinese-rebound-not-so-fast-51611622798\n\nChina has officially become the world’s only major economy to expand\nyear-over-year in 2020, with 2.3% real GDP growth. That’s an especially bright\nfigure against the backdrop of an estimated 4.3% contraction in the…",
  "original_created_utc": 1611720810,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.barrons.com/articles/the-great-chinese-rebound-not-so-fast-51611622798\n\n中国正式成为世界上唯一一个扩大的主要经济体。\n2020年同比，实际GDP增长2.3%。这是一个特别亮眼的\n在估计中国经济萎缩4.3%的背景下，这个数字也是一个很高的数字。",
      "title": "巴伦斯。中国自己的数字以及独立收集的经济数据并没有讲述大规模反弹的故事。相反，它们显示的是一个隐藏在众目睽睽之下的全年衰退\"，经济数字被 \"疯狂夸大\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.barrons.com/articles/the-great-chinese-rebound-not-so-fast-51611622798\n\n中國正式成爲世界上唯一一個擴大的主要經濟體。\n2020年同比，實際GDP增長2.3%。這是一個特別亮眼的\n在估計中國經濟萎縮4.3%的背景下，這個數字也是一個很高的數字。",
      "title": "巴倫斯。中國自己的數字以及獨立收集的經濟數據並沒有講述大規模反彈的故事。相反，它們顯示的是一個隱藏在衆目睽睽之下的全年衰退\"，經濟數字被 \"瘋狂誇大\""
    }
  ],
  "title": "Barrons: China’s own numbers as well as independently collected economic data do not tell the story of a blockbuster rebound. Instead, they show a full-year recession hiding in plain sight,” with economic numbers being “wildly inflated”",
  "created_utc": 1611771519,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.barrons.com/articles/the-great-chinese-rebound-not-so-fast-51611622798\">https://www.barrons.com/articles/the-great-chinese-rebound-not-so-fast-51611622798</a></p>\n\n<p>China has officially become the world’s only major economy to expand year-over-year in 2020, with 2.3% real GDP growth. That’s an especially bright figure against the backdrop of an estimated 4.3% contraction in the overall global economy, pulled down by severe recessions in the U.S. and the euro zone. Investors, expecting this outcome for months, have been pouring into Chinese equities and commodities, boosting assets to record levels while also fueling a self-reinforcing China comeback narrative.</p>\n\n<p>The problem? The People’s Republic of China’s own numbers as well as independently collected economic data do not tell the story of a blockbuster rebound. Instead, they show a full-year recession hiding in plain sight.</p>\n\n<p>A close look at official Chinese statistics reveals that key economic numbers have been wildly inflated. Downward revisions to their 2019 baselines created the appearance of growth, when in fact the economy continued to struggle in 2020.</p>\n\n<p>Let’s begin with the all-important numbers for fixed asset investment, which counts total purchases of capital goods and land. Published at a high frequency, this metric is seen as a leading indicator of the health of the Chinese economy. In a series of revisions over the course of 2020, China’s statistics bureau cut the aggregate amount of 2019 FAI down by over 4.7 trillion yuan (equivalent to about $720 billion). The largest revisions came in the fall, raising immediate analyst concerns.</p>\n\n<p>These revisions helped Beijing create the illusion of a V-shaped recovery in investment spending. The revised 2020 FAI figures show investment cratering in the wake of the pandemic but then recovering rapidly and surreptitiously expanding above the previous year’s levels in the final four months of 2020. By quietly changing the baseline, China masked what was in fact a year-long contraction in investment spending. When aggregated over the full year, the unadjusted data show FAI shrinking roughly 5.9% compared to 2019.</p>\n\n<p>The baseline for another critical metric, total retail sales, which gauges consumer strength, was also revised down, showing positive on-year growth each month since August 2020. The original figures indicated positive growth starting a month later, in September, and at a slower rate for the remainder of the year. More importantly, they show that in aggregate total retail sales contracted year-over-year by 4.8% or approximately 1.97 trillion yuan. Even based on the retroactively revised data, accumulated retail sales fell by 3.9% in 2020 compared to the previous year.</p>\n\n<p>No matter how you slice the official numbers, they reject the idea of China seeing a broad-based recovery that includes Chinese consumers.</p>\n\n<p>That said, official economic statistics are routinely revised. So why should revisions by China be treated skeptically?</p>\n\n<p>First, the methods of China’s National Bureau of Statistics have long been questionable. A central problem is a practice by which firms surveyed in a given year are dropped in future years if their revenue falls below a certain threshold. Their prior data is then stripped out of historical records. This cherry-picking approach can produce trillions of yuan worth of adjustments. The resulting figures are no longer representative of the entire economy.</p>\n\n<p>Second, transparency is lacking. The NBS did not provide a meaningful explanation of why numbers for FAI or total retail sales were adjusted down for 2019, nor did it publish a revised series openly acknowledging the revisions. Third, and relatedly, the bureau has now removed all nominal FAI data for 2019 and 2020 from its online database, making it cumbersome for analysts to decode these changes in the first place. It’s difficult but to conclude that these revisions are aimed at distorting reality rather than giving a more accurate read on the economy.</p>\n\n<p>Reliability of official statistics is not the only reason to question if China’s economy actually grew in 2020. Private data also do not show an economy running at pre-Covid levels.</p>\n\n<p>My firm, China Beige Book, surveys over 3,000 Chinese executives every quarter. These proprietary surveys show the economy continuing to recover into the fourth quarter. But each of our key performance metrics, every sector, and all regions posted a fourth consecutive quarter of on-year contraction, a first in a decade of surveying the Chinese economy.</p>\n\n<p>Our data show that China’s recovery over 2020 has been less robust than official numbers portray. Chinese consumption remains weak. The fourth quarter brought a services sector recovery, but one driven by businesses not consumers. Consumer-facing sectors like travel, hospitality, and restaurants lagged behind business-to-business industries. Retailing fared even worse, becoming the only sector with slower growth in the fourth quarter.</p>\n\n<p>Even Chinese executives do not say their businesses have fully recovered. Last quarter we asked C-level executives when they expected their companies’ sales, profitability, and hiring to return to 2019 levels. On each metric, approximately two-thirds said that recovery was still more than three months away. Beijing has declared victory prematurely.</p>\n\n<p>By claiming growth in several key metrics, Beijing signaled to markets that it would eventually report year-on-year expansion in the economy and achieve the mythical V-shaped recovery. Many investors and market commentators latched on to that narrative with little interest in looking under the hood. And herein lies the problem. Not only does a forensic review of official data show a weaker economy than officially acknowledged, but both government statistics and independent data show lackluster consumption.</p>\n\n<p>Rising investment flows into China and a rally in Chinese stocks may very well be justified by virtue of China’s recovery over the past 9 months, which is no doubt impressive compared to most of the rest of the still-suffering world. But these investments should not be driven by official GDP growth or a belief that China’s economy has returned to normal. The evidence simply does not bear that out.</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/investing/comments/l5w2yw/barrons_chinas_own_numbers_as_well_as/",
  "subreddit": "investing",
  "id": "l5w2yw",
  "is_self": true,
  "media": null,
  "is_video": false
}