{
  "author": "ScubaSteve00S",
  "the_new_excerpt": "GME is me. I am GME. This is a serious post. *THIS IS NOT FINANCIAL ADVICE*\n\nI bought GME to make money. There is no way around it. No need to lie or fake it\nlike most the people on here. I held to make a statement. I got in at $300 for\n100 shares hoping it would go to the moon. I didn't sell at…",
  "original_created_utc": 1613291334,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "GME就是我。我就是GME。这是个严肃的帖子。*这不是财务建议*。\n\n我买GME是为了赚钱。这是没办法的事。不需要说谎，也不需要作假\n像大多数人在这里。我举行了声明。我在300元的时候进了\n100股，希望它能去月球。我没有卖在...",
      "title": "为什么我是GME"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "GME就是我。我就是GME。這是個嚴肅的帖子。*這不是財務建議*。\n\n我買GME是爲了賺錢。這是沒辦法的事。不需要說謊，也不需要作假\n像大多數人在這裏。我舉行了聲明。我在300元的時候進了\n100股，希望它能去月球。我沒有賣在...",
      "title": "爲什麼我是GME"
    }
  ],
  "title": "Why I am GME",
  "created_utc": 1613313737,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>GME is me. I am GME. This is a serious post. *THIS IS NOT FINANCIAL ADVICE*</p>\n\n<p>I bought GME to make money. There is no way around it. No need to lie or fake it like most the people on here. I held to make a statement. I got in at $300 for 100 shares hoping it would go to the moon. I didn&#39;t sell at $375. $470. I held. And now, even at $50...I am holding. This is no longer about money. This is about Good VS Evil. The average man vs the 1%. This is the fight of a lifetime.</p>\n\n<p>I didn&#39;t grow up rich. Every penny I made and invested I bled for. No excuses. So I write this message of hope. HOLD. HOLD THE LINE. I&#39;ve seen so many post with no context. HOLD your positions because you think it&#39;s bullshit that Robinhood sold out. Melvin can manipulate the market. That the SEC continues to turn a blind eye to all that is happening. I don&#39;t even want to win back my money. I want to stick it to Melvin and every other hedge fund that rips people off. I survived 2008. I saw tons of 401ks turn into dust. And then the government bailed out the Big Banks and all the shady brokers that helped make this happen. They didn&#39;t pay for anything. They just got away with it and got even bolder.</p>\n\n<p>To all the people who threw in their HARD EARNED MONEY, don&#39;t despair. KARMA happens to us all. The Hedgies will get what is coming to them. Stay strong. This is no longer about riding the rocket to the moon. Paper vs Diamond hands. This is working blue collar, working white collar vs the ELITE. The establishment. If you read this and I&#39;m still alive, then I am still holding. I refuse to give in to them.</p>\n\n<p>MURICA.</p>\n\n<p>&#x200B;</p>\n\n<p>*EDIT Portion*</p>\n\n<p>Omgahhh my first Gold! Thanks y’all. </p>\n\n<p>Thanks for the silver award. First one ever!</p>\n\n<p>To all the haters and negative people. Why? What do you gain? Are you pro hedge funds? Are you pro 1%? Because unless you have 8-9 figures sitting in your bank account and you don&#39;t care about all the little people, you aren&#39;t one of them so stop acting like it.</p>\n\n<p>I’m not forcing or trying to convince anyone to hold. I’m simply giving my logic to why I haven’t sold yet. It’s an opinion. You either agree or disagree. The button goes up or down. Pretty simple. </p>\n\n<p>To all the people who understand, we in this together. Much &lt;3</p>\n</div><!-- SC_ON -->",
  "score": 1726,
  "permalink": "/r/wallstreetbets/comments/ljkpgj/why_i_am_gme/",
  "subreddit": "wallstreetbets",
  "id": "ljkpgj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633141
}