{
  "author": "karto2287",
  "original_created_utc": 1642025341,
  "title": "Is a billionaire allowed to buy a company and then close it down just cause he hates it?",
  "created_utc": 1642047946,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Say in the US right Jeff Bezos see a coffee shop he doesn&amp;#39;t like cause a waitress spilled coffee on his shirt. So the next month he buys the entire coffee shop and has full legal ownership but then when he is the ceo of that coffee shop he goes in the first day and says &amp;quot;You&amp;#39;re all fking fired. Get out. I&amp;#39;m tearing this store down.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Can Jeff do this cause he legally bought the shop or does this go against labor laws? Assuming he buys a company that doesn&amp;#39;t violate antitrust laws and closes it just from sheer spite&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/s2ieww/is_a_billionaire_allowed_to_buy_a_company_and/",
  "subreddit": "NoStupidQuestions",
  "id": "s2ieww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Say in the US right Jeff Bezos see a coffee shop he doesn't like cause a\nwaitress spilled coffee on his shirt. So the next month he buys the entire\ncoffee shop and has full legal ownership but then when he is the ceo of that\ncoffee shop he goes in the first day and says \"You're all fking fired. Get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、アメリカのジェフ・ベゾスが、気に入らないコーヒーショップで\nウェイトレスが彼のシャツにコーヒーをこぼした。そこで翌月にはその店を丸ごと買い取り\nしかし、そのコーヒーショップのCEOになった時、そのコーヒーショップの完全な法的所有権を持っています。\nコーヒーショップに初日から行って、「お前ら全員クビだ。と言われた。",
      "title": "億万長者が会社を買収して、それが嫌だからといって閉鎖することは許されるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比如在美国，杰夫-贝佐斯看到一家他不喜欢的咖啡店，因为一个女服务员把咖啡洒在他的衣服上。\n服务员把咖啡洒在他的衬衫上。所以在下个月他买下了整个\n所以下个月他买下了整个咖啡店，并拥有完全合法的所有权，但当他成为该咖啡店的首席执行官时，他第一天进去就说：\"你的咖啡店在哪里？\n但当他成为该咖啡店的首席执行官时，他第一天进去就说：\"你们都被解雇了。你们都被解雇了。",
      "title": "一个亿万富翁被允许购买一家公司，然后仅仅因为他讨厌它而关闭它吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如在美國，傑夫-貝佐斯看到一家他不喜歡的咖啡店，因爲一個女服務員把咖啡灑在他的衣服上。\n服務員把咖啡灑在他的襯衫上。所以在下個月他買下了整個\n所以下個月他買下了整個咖啡店，並擁有完全合法的所有權，但當他成爲該咖啡店的首席執行官時，他第一天進去就說：\"你的咖啡店在哪裏？\n但當他成爲該咖啡店的首席執行官時，他第一天進去就說：\"你們都被解僱了。你們都被解僱了。",
      "title": "一個億萬富翁被允許購買一家公司，然後僅僅因爲他討厭它而關閉它嗎？"
    }
  ]
}