{
  "author": "Craigbrand97",
  "the_new_excerpt": "(From the UK) I’ve noticed that a lot of people in the US seem to be hung up on\nthe idea that their “freedom of speech” is being ripped from them by the\n“radical left”.\n\nIt’s a similar kind of story over here. Basically, people don’t seem to like it\nwhen they get called out for spewing bullshit and…",
  "original_created_utc": 1616845832,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "(来自英国)我注意到，在美国，很多人似乎都在纠结于\n他们的 \"言论自由 \"被剥夺的想法。\n\"激进左派\"。\n\n这是个类似的故事在这里。基本上，人们似乎不喜欢它。\n当他们被称为喷出废话和... ...",
      "title": "为什么有些人执着于 \"言论自由 \"意味着他们可以不受他们所说的话的影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(來自英國)我注意到，在美國，很多人似乎都在糾結於\n他們的 \"言論自由 \"被剝奪的想法。\n\"激進左派\"。\n\n這是個類似的故事在這裏。基本上，人們似乎不喜歡它。\n當他們被稱爲噴出廢話和... ...",
      "title": "爲什麼有些人執着於 \"言論自由 \"意味着他們可以不受他們所說的話的影響？"
    }
  ],
  "title": "Why are some people obsessed with the idea that “freedom of speech” means they are somehow free from the repercussions of what they say?",
  "created_utc": 1616866489,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(From the UK) I’ve noticed that a lot of people in the US seem to be hung up on the idea that their “freedom of speech” is being ripped from them by the “radical left”.</p>\n\n<p>It’s a similar kind of story over here. Basically, people don’t seem to like it when they get called out for spewing bullshit and hateful things, they claim they aren’t allowed to say anything anymore and that they aren’t allowed to have freedom of speech. The recent situation with Piers Morgan and Sharon Osbourne springs to mind. </p>\n\n<p>I mean, If you walk up to someone, call their mother all kinds of slurs, and get punched in the face for it, would they still claim that they are having their freedom of speech taken away? What’s the obsession with people victimising themselves when they are the ones clearly attacking others?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/meca67/why_are_some_people_obsessed_with_the_idea_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "meca67",
  "is_self": true,
  "media": null,
  "is_video": false
}