{
  "author": "TheCommonKoala",
  "the_new_excerpt": "Marijuana Banking Bill Expected To Get A House Floor Vote Next Week, Sponsor’s\nOffice Says\n[https://www.marijuanamoment.net/marijuana-banking-bill-expected-to-get-a-house-floor-vote-next-week-sponsors-office-says/]\n\nThe last time I posted about weed stocks, I explained how US cannabis stocks…",
  "original_created_utc": 1618600826,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マリファナ銀行法案、来週にも下院で採決される見込み。\n事務所の見解\n[https://www.marijuanamoment.net/marijuana-banking-bill-expected-to-get-a-house-floor-vote-next-week-sponsors-office-says/]\n\n前回、大麻銘柄について投稿した際には、米国の大麻銘柄の...",
      "title": "来週、米国の大麻業界は、今年最初の大きな連邦法の節目を迎えようとしています。SAFE法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大麻银行法案有望下周获得众议院投票，提案人的\n办公室说\n[https://www.marijuanamoment.net/marijuana-banking-bill-expected-to-get-a-house-floor-vote-next-week-sponsors-office-says/]\n\n上次我发了关于杂草股的帖子，我解释了美国大麻股是如何... ...",
      "title": "下周，美国大麻行业即将迎来今年第一个重要的联邦立法里程碑。SAFE法案"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大麻銀行法案有望下週獲得衆議院投票，提案人的\n辦公室說\n[https://www.marijuanamoment.net/marijuana-banking-bill-expected-to-get-a-house-floor-vote-next-week-sponsors-office-says/]\n\n上次我發了關於雜草股的帖子，我解釋了美國大麻股是如何... ...",
      "title": "下週，美國大麻行業即將迎來今年第一個重要的聯邦立法里程碑。SAFE法案"
    }
  ],
  "title": "Next week, the US cannabis industry is nearing its first major federal legislation milestone of the year. SAFE Act",
  "created_utc": 1618604781,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.marijuanamoment.net/marijuana-banking-bill-expected-to-get-a-house-floor-vote-next-week-sponsors-office-says/\"><strong>Marijuana Banking Bill Expected To Get A House Floor Vote Next Week, Sponsor’s Office Says</strong></a></p>\n\n<p>The last time I posted about weed stocks, I explained how US cannabis stocks (ie Trulieve/Cresco/Greenthumb/Curaleaf) are all awaiting big legislative changes throughout the year.</p>\n\n<p>I&#39;m posting now, because the first big piece of legislation, the SAFE act, is finally being introduced to Congress next week.</p>\n\n<blockquote>\n<p>The message, which was sent to stakeholders on Friday by a staffer for Rep. Ed Perlmutter (D-CO), the bill’s sponsor, says that while the office is still awaiting scheduling confirmation, they “think the bill will be on the House floor for a vote early next week,” and that will be confirmed when the full calendar is released by House Majority Leader Steny Hoyer (D-MD) “later today.”</p>\n</blockquote>\n\n<p>SAFE act is a game-changer US MSOs that currently bleed absurd amounts of money and resources because of harsh federal banking restrictions.</p>\n\n<blockquote>\n<p>The legislation would ensure that financial institutions could take on cannabis business clients without facing federal penalties. Fear of sanctions has kept many banks and credit unions from working with the industry, forcing marijuana firms to operate on a cash basis that makes them targets of crime and creates complications for financial regulators.</p>\n</blockquote>\n\n<p>As this news has been confirmed by a fresh leak (that was only published within the hour I&#39;m making this post) there is an opportunity to buy the <em>&quot;rumour&quot;</em> in sense as the market has yet to react today. Noone knew when exactly this bill was coming until now so I would act fast if you&#39;re interested in beating the hype storm that will come next week once this bill is officially revealed and passed by the House.</p>\n</div><!-- SC_ON -->",
  "score": 1043,
  "permalink": "/r/investing/comments/msaeih/next_week_the_us_cannabis_industry_is_nearing_its/",
  "subreddit": "investing",
  "id": "msaeih",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524767
}