{
  "author": "khaste",
  "original_created_utc": 1654980584,
  "title": "This is one of the best times for crypto, whether you like it or not",
  "created_utc": 1655048457,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Temporarily gone, are the scammers constantly posting discord, telegram links asking you to message them on facebook, giveaway scams, MLM crypto scams. Its a good time to see where the real hodlers are at, and how many people actually believe in crypto when its a bear market.&lt;/p&gt;\n\n&lt;p&gt;Of course, everyone knows the  best time for crypto is when we are in a bull run but that has its cons ( see above), but at least in these bear times the community is more quiet and focused on the real things behind crypto and not full of shitcoin advertising and promoting. This is the time to accumulate and DCA or whatever investment plan you have.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/va69l1/this_is_one_of_the_best_times_for_crypto_whether/",
  "subreddit": "CryptoCurrency",
  "id": "va69l1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Temporarily gone, are the scammers constantly posting discord, telegram links\nasking you to message them on facebook, giveaway scams, MLM crypto scams. Its a\ngood time to see where the real hodlers are at, and how many people actually\nbelieve in crypto when its a bear market.\n\nOf course, everyone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一時的にいなくなったのは、詐欺師たちが常にディスコードやテレグラムのリンクを投稿し、フェイスブックでメッセージを送るように要求することです。\nFacebookでメッセージを送るように要求する、景品詐欺、MLM暗号詐欺です。そのため\n本当のホドラーがどこにいるのか、そして何人の人が実際にその弱気市場の暗号を信じるのかを見るには良い時間です。\nその弱気市場のときに暗号を信じる。\n\nもちろん、誰もが...",
      "title": "これは、あなたが好むと好まざるとにかかわらず、暗号にとって最良の時期の一つです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "暂时没有了，是那些不断发布不和谐、电报链接的骗子们\n要求你在facebook上给他们留言，赠品骗局，MLM加密货币骗局。这是一个\n它是一个很好的时间来看看真正的猎人在哪里，以及有多少人在熊市时真正\n在熊市中，有多少人相信加密货币。\n\n当然，每个人都...",
      "title": "无论你喜欢与否，这都是加密货币的最佳时期之一"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "暫時沒有了，是那些不斷髮布不和諧、電報鏈接的騙子們\n要求你在facebook上給他們留言，贈品騙局，MLM加密貨幣騙局。這是一個\n它是一個很好的時間來看看真正的獵人在哪裏，以及有多少人在熊市時真正\n在熊市中，有多少人相信加密貨幣。\n\n當然，每個人都...",
      "title": "無論你喜歡與否，這都是加密貨幣的最佳時期之一"
    }
  ]
}