{
  "author": "letmetellyouastry",
  "the_new_excerpt": "Back in 2013, I saw a once in a lifetime opportunity in Bitcoin.\n\nSo I wired $3000 to Mt Gox, bought at $125 at the peak of the bull market (like\na sucker!). I day traded and learned exactly why you shouldn’t day trade before\nwithdrawing what remained 1 month before Mt Gox collapsed. Then I decided…",
  "original_created_utc": 1613439720,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早在2013年，我就看到了比特币千载难逢的机会。\n\n于是我向Mt Gox汇了3000美元，在牛市的高峰期以125美元的价格买入（如\n一个傻瓜！）。) 我当日交易，确切地了解到为什么你不应该当日交易前。\n在Mt Gox倒闭前一个月，我把剩下的钱提了出来。然后我决定...",
      "title": "我在过去8年里学到的经验。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2013年，我就看到了比特幣千載難逢的機會。\n\n於是我向Mt Gox匯了3000美元，在牛市的高峯期以125美元的價格買入（如\n一個傻瓜！）。) 我當日交易，確切地瞭解到爲什麼你不應該當日交易前。\n在Mt Gox倒閉前一個月，我把剩下的錢提了出來。然後我決定...",
      "title": "我在過去8年裏學到的經驗。"
    }
  ],
  "title": "Lessons I have learned in the last 8 years.",
  "created_utc": 1613449970,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Back in 2013, I saw a once in a lifetime opportunity in Bitcoin.</p>\n\n<p>So I wired $3000 to Mt Gox, bought at $125 at the peak of the bull market (like a sucker!). I day traded and learned exactly why you shouldn’t day trade before withdrawing what remained 1 month before Mt Gox collapsed. Then I decided to HODL, because I knew I was so far ahead of the adoption curve.</p>\n\n<p>Then I suffered my first bear market. I had bought at the peak and my $3000 was now worth a fraction of that, but thankfully for me I had only invested an amount that I was prepared to lose. That’s lesson #1 in investing.</p>\n\n<p>Later that year, the price exploded to $1000, I had suddenly made multiples of what I initially invested. But lucky for me I had a stable job and didn’t feel the need to cash out anything. I was in it for the long term and still saw an extremely asymmetric upside. I didn’t want to sell until it could make a meaningful impact on my life. The HODL mentality started to make sense.</p>\n\n<p>Then we went through a long bear market. Bitcoin was “dead” but I still held a strong belief that it was still a once in a generation opportunity.</p>\n\n<p>In 2017 things started to pick up, forks started to happen. I immediately sold all of the shitforks for BTC, and strengthened my overall position. Then watched as the price started to really take off.</p>\n\n<p>I sold a small amount to recover my initial $3000 investment as the price rose, this was a strong psychological barrier for me as now I was purely playing with house money, I literally cannot lose as long as I don&#39;t go chasing losses.</p>\n\n<p>Then the price went up to $25k AU. Suddenly my portfolio was worth hundreds of thousands of dollars. Enough to make a difference in my life. I sold about $30k worth just to make sure that, no matter what happens I will walk away with a 10x profit on my initial investment. But the opportunity was too great to ever sell all of what I have. I stayed up at night agonising over my decision not to take big profits, it was a very stressful time for me despite my financial situation being better than ever. This was a stress that I was not prepared for. Getting rich is supposed to be all smooth sailing, right? I was still in a fortunate enough position to be in a well paid stable job, so was still able to hodl despite the stress it was causing me.</p>\n\n<p>Then the price crashed, Bitcoin was “dead” for the 100th time. I went from having hundreds of thousands on paper, to only having tens of thousands. This time it hurt.</p>\n\n<p>I had been through enough bull cycles by this time to know that if/when the next one would eventually came it would dwarf all others. And by the time that happened, what I had learned was that I needed to have a solid plan in place so I could execute it without making irrational decisions.</p>\n\n<p>2020 was a bad year for all of us, but a few months ago things started to stir……</p>\n\n<p>Yesterday I passed $1 million (AU) in hodlings. This was one personal milestone for me, and while I was targeting a profit taking price of $71k AU, I started getting that creeping sense of dread that this could all evaporate again like it did in 2017. I had spent the last week not sleeping, watching charts, watching videos, trying to guess where the price was going. I had my plan, but the price stalled just below the $50k(US) level which correlated to about $63k AU. At this point I had an honest discussion with my amazing fiancé as the stress was starting to affect my quality of life, I decided to take some decisive action.</p>\n\n<p>I cashed out $200k yesterday, enough to make an impact in my life while still holding onto a majority of my hodlings. This was literally minutes before yesterdays dip happened so the sense of relief that came over me was only further reinforced by the dip that soon followed.</p>\n\n<p>I am now in a position where I have more cash at hand than I ever thought I would, in addition to still hodling onto ~$800k in Bitcoin. Even tho I sold a lot yesterday I still feel like this Bull run has a long way to go. But I took profits that made sense to me in the context of my overall financial position and feel great about my decision. Sure one day that $200k could become $2million eventually, but that is why I still hold a majority of what I initially bought. I will never sell it all. EVER.</p>\n\n<p>My learnings from this whole thing are that the key to realising the upside requires patience and a balanced temperament. If you are a later adopter than me then just know that when the price starts getting into the kind of territory where it can meaningfully shift your life, BE PREPARED FOR THE STRESS THAT IT WILL INDUCE, and have a plan in place to handle it accordingly. Stress makes people make bad decisions and you need to be prepared for this.</p>\n\n<p>I see way too many people in this place who sell everything they have, but the alternative that I suggest is if you start getting uncomfortable then there is no shame in taking profits on the way up. Never EVER sell everything you have, just sell enough to make the creeping sense of dread go away while holding enough to continue riding the revolution that Bitcoin is.</p>\n\n<p>TL:DR;</p>\n\n<ol>\n<li>Don&#39;t put more than you can afford to lose on the line</li>\n<li>Don&#39;t Day Trade. Most people who read charts are con artists. Just buy, Hodl and be patient.</li>\n<li>Be prepared for the stress that rising prices will induce</li>\n<li>Take profits that make sense to your financial position to alleviate the stress on the way up</li>\n<li>Never, EVER sell everything. The opportunity is far too great to miss.</li>\n<li>If we enter another bear market, HODL on harder than ever. You will be rewarded eventually.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 858,
  "permalink": "/r/Bitcoin/comments/lksplm/lessons_i_have_learned_in_the_last_8_years/",
  "subreddit": "Bitcoin",
  "id": "lksplm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728613350
}