{
  "author": "Jxntb733",
  "original_created_utc": 1647369157,
  "title": "I’m going to apply to as many crypto jobs as possible and will report back in a months time",
  "created_utc": 1647383468,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last year LinkedIn saw a flood of job postings involving cryptocurrency, start ups, and Blockchain technology. I &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/s61tdr/we_all_heard_that_demand_for/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf\"&gt;wrote a post about the weirdest crypto jobs available&lt;/a&gt;.             &lt;/p&gt;\n\n&lt;p&gt;I am finally going to dedicate a few hours each day applying to as many as possible. I am only looking for ones that can be done remotely and pay actual wages, be it in fiat or crypto.            &lt;/p&gt;\n\n&lt;p&gt;I will be systematic about it, like I am for all of my job hunts, Excel sheets and all, reporting date applied and the type of replies I get back. I plan to report back in a month or so. Wish me luck, and I’m open to advice from anyone who’s worked in the sector before!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 562,
  "permalink": "/r/CryptoCurrency/comments/tew8ga/im_going_to_apply_to_as_many_crypto_jobs_as/",
  "subreddit": "CryptoCurrency",
  "id": "tew8ga",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Last year LinkedIn saw a flood of job postings involving cryptocurrency, start\nups, and Blockchain technology. I wrote a post about the weirdest crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨年、LinkedInには暗号通貨やスタートアップに関わる求人情報が殺到しました。\nブロックチェーン技術 私は、奇妙な暗号...についての記事を書きました。",
      "title": "できるだけ多くの暗号関連の仕事に応募して、1ヶ月後に報告するつもりです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "去年，LinkedIn出现了大量涉及加密货币、创业和区块链技术的招聘信息。\n和区块链技术。我写了一篇关于最奇怪的加密货币的文章。",
      "title": "我打算尽可能多地申请加密货币工作，并将在几个月后汇报。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去年，LinkedIn出現了大量涉及加密貨幣、創業和區塊鏈技術的招聘信息。\n和區塊鏈技術。我寫了一篇關於最奇怪的加密貨幣的文章。",
      "title": "我打算儘可能多地申請加密貨幣工作，並將在幾個月後彙報。"
    }
  ]
}