{
  "author": "Accomplished-Design7",
  "the_new_excerpt": "This is especially for all the newcomers to crypto during this cycle. The FUDs\ndidn't get to you and you stood strong! It has been really hard on me too as I\nam one of the newcomers too! I have been in this crypto space for not too long\nand after I initially invested the price started to dip.…",
  "original_created_utc": 1623369864,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは特に、このサイクル中に暗号に新規参入した人たち全員に言えることです。FUDs\nに惑わされず、強く立ち向かってください。私も新参者の一人なので、本当に辛かったです。\n私も新参者の一人なので、本当に大変でした。私も新参者の一人なので、本当に辛かったです！私はこの暗号空間にあまり長くいませんでした。\n私が最初に投資した後、価格が下がり始めました....",
      "title": "これが初めての50%以上のディップで、それでもHODLedに成功したのなら、おめでとうございます！そして、ダイヤモンドハンドクラブへようこそ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这对本周期内所有加密货币的新人来说尤其如此。恐惧症\n没有影响到你们，而且你们站得很稳! 这对我来说也非常困难，因为我是\n我也是新来的人之一! 我进入这个加密货币领域的时间并不长\n在我最初投资后，价格开始下跌....",
      "title": "如果这是你的第一次>50%的下跌，而你仍然成功地进行了HODL，那么恭喜你，欢迎你加入钻石手俱乐部。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這對本週期內所有加密貨幣的新人來說尤其如此。恐懼症\n沒有影響到你們，而且你們站得很穩! 這對我來說也非常困難，因爲我是\n我也是新來的人之一! 我進入這個加密貨幣領域的時間並不長\n在我最初投資後，價格開始下跌....",
      "title": "如果這是你的第一次>50%的下跌，而你仍然成功地進行了HODL，那麼恭喜你，歡迎你加入鑽石手俱樂部。"
    }
  ],
  "title": "If this is your first >50% dip and you still managed HODLed, then congrats and welcome to the diamond hands club!",
  "created_utc": 1623378247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is especially for all the newcomers to crypto during this cycle. The FUDs didn&#39;t get to you and you stood strong! It has been really hard on me too as I am one of the newcomers too! I have been in this crypto space for not too long and after I initially invested the price started to dip. However, as I am in for the long run, I did not let those FUDs sway me into paper-handing my cryptos. Although as of now my portfolio is still pretty much in red, I strongly believe in the utility of the crypts that I purchased.</p>\n\n<p>If you DYOR, you would be more confident with your purchases and less likely to paper-hand them. Thus, I also believe it is crucial to do all the research needed before buying into different cryptos. Either way, give yourself a pad on the back!</p>\n</div><!-- SC_ON -->",
  "score": 2900,
  "permalink": "/r/CryptoCurrency/comments/nx2edm/if_this_is_your_first_50_dip_and_you_still/",
  "subreddit": "CryptoCurrency",
  "id": "nx2edm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009736016
}