{
  "author": "lavndr3ssnc",
  "original_created_utc": 1634603545,
  "title": "Is this abusive?",
  "created_utc": 1634611910,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Idk how to ask this. But my mom thinks she has rights to my body. This includes making me try on bras in front of her when I don’t want to and after surgery, she made me let her give me a shower for at least a week even though I was capable of doing it myself. She will grab me and pinch me if I’m doing something to make her mad and it just makes me feel so angry. I don’t like being touched and she’s so controlling. She also had me and my brother sleep in bed with her when my dad was traveling for work until my sophomore year of high school. Some of this stuff still happened after I turned 18 and I’m just confused.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/TooAfraidToAsk/comments/qazwxc/is_this_abusive/",
  "subreddit": "TooAfraidToAsk",
  "id": "qazwxc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Idk how to ask this. But my mom thinks she has rights to my body. This includes\nmaking me try on bras in front of her when I don’t want to and after surgery,\nshe made me let her give me a shower for at least a week even though I was\ncapable of doing it myself. She will grab me and pinch me if I’m…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どうやって聞いたらいいのかわからない。しかし、私の母は私の体に権利があると思っています。これには\nブラジャーを着けたくないのに、手術後に母の目の前でブラジャーを着けさせられたこと。\n自分でシャワーを浴びることができたのに、少なくとも1週間はシャワーを浴びさせられました。\n自分でシャワーを浴びることができるのに、少なくとも1週間はシャワーを浴びさせられました。彼女は、私が...と思っていると、私を掴んでつねったりします。",
      "title": "これは虐待なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道该怎么问这个问题。但是我妈妈认为她对我的身体有权利。这包括\n在我不愿意的情况下，让我在她面前试穿胸罩，以及在手术后。\n手术后，她让我让她给我洗澡，至少一个星期，尽管我有能力自己洗。\n即使我有能力自己做。她会抓住我，掐我，如果我...",
      "title": "这是虐待吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道該怎麼問這個問題。但是我媽媽認爲她對我的身體有權利。這包括\n在我不願意的情況下，讓我在她面前試穿胸罩，以及在手術後。\n手術後，她讓我讓她給我洗澡，至少一個星期，儘管我有能力自己洗。\n即使我有能力自己做。她會抓住我，掐我，如果我...",
      "title": "這是虐待嗎？"
    }
  ]
}