{
  "author": "Ticojohnny",
  "the_new_excerpt": "Lots of folks around here been asking about quality fundamentals posts now that\nthe memes are in their own sub. Thought i'd write something up about $ATOM.\nDISCLAIMER: I've got some $ATOM, no I don't work for Cosmos, though it would be\ncool.\n\nI've been quite immersed into the Cosmos Atom community…",
  "original_created_utc": 1617528632,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "周围很多人都在问关于质量基本面的帖子，现\nmemes是在他们自己的子。我想我会写一些关于$ATOM的东西。\n声明：我已经得到了一些$ATOM，不，我不工作的大同，虽然这将是。\n酷。\n\n我一直沉浸在宇宙原子的社区中... ...",
      "title": "大同$ATOM洞察力，我做了一些研究，觉得可以分享一下。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "周圍很多人都在問關於質量基本面的帖子，現\nmemes是在他們自己的子。我想我會寫一些關於$ATOM的東西。\n聲明：我已經得到了一些$ATOM，不，我不工作的大同，雖然這將是。\n酷。\n\n我一直沉浸在宇宙原子的社區中... ...",
      "title": "大同$ATOM洞察力，我做了一些研究，覺得可以分享一下。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "多くの人が、基本的な投稿の質について質問しています。\nミームが独自のサブになったことで 私は$ATOMについて何か書いてみようと思いました。\n免責事項：私はいくつかの$ATOMを持っていますが、私はCosmosのために働いていません。\nかっこいいですよね。\n\n私はCosmosのAtomコミュニティにかなり入り込んでいます...",
      "title": "Cosmos $ATOM Insight, I did some research, thought I'd share"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が、基本的な投稿の質について質問しています。\nミームが独自のサブになったことで 私は$ATOMについて何か書いてみようと思いました。\n免責事項：私はいくつかの$ATOMを持っていますが、私はCosmosのために働いていません。\nかっこいいですよね。\n\n私はCosmosのAtomコミュニティにかなり入り込んでいます...",
      "title": "Cosmos $ATOM Insight, I did some research, thought I'd share"
    }
  ],
  "title": "Cosmos $ATOM Insight, I did some research, thought I'd share",
  "created_utc": 1617550227,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lots of folks around here been asking about quality fundamentals posts now that the memes are in their own sub. Thought i&#39;d write something up about $ATOM. DISCLAIMER: I&#39;ve got some $ATOM, no I don&#39;t work for Cosmos, though it would be cool.</p>\n\n<p>I&#39;ve been quite immersed into the Cosmos Atom community and might have some insight that I thought I could share with you all. I&#39;ve been listening to all of the Citizen Cosmos Podcasts and taking notes, going back and reading old Cosmos blogs, posts and articles, accumulating information on the Telegram groups, following along on the developers&#39; twitter pages and have started to initiate and moderate some AMA&#39;s with some key people in the ecosystem. I recently attended a public Club House meeting with Sunny Aggarwal, Brent Xu, Ethan Buchman and a few other key speakers, and it left me inspired to do a little write up on why I personally believe the Cosmos Hub will stand out from the rest, this year.</p>\n\n<p>First off, I wanted to point to this speculated roadmap of goals the Cosmos Hub has for the year.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p><strong><em>Q1</em></strong>  </p>\n\n<p><em>Stargate Launch (Inter Blockchain Communication)</em>  </p>\n\n<p><strong><em>Q2</em></strong>  </p>\n\n<p>B-Harvest <em>Gravity Dex (AMM, Pools &amp; Swap)</em>  </p>\n\n<p><em>Juno (Smart Contract Platform)</em>  </p>\n\n<p><em>Gravity Bridge (Ethereum)</em>  </p>\n\n<p><em>Inter Chain Accounts  (ICS27 - Chain Naming Standard)</em>  </p>\n\n<p><strong><em>Q3</em></strong>  </p>\n\n<p><em>Osmosis (</em> Next-Gen AMM sandbox with customizable curves, fees and other parameters)  </p>\n\n<p><strong><em>Q4</em></strong>  </p>\n\n<p><em>Shared Security (Cross Chain Staking)</em>  </p>\n\n<p><em>Bitcoin Bridge</em></p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>Main Source: cosmos.network/features</p>\n\n<p>Secondly, here&#39;s a chart of all the chains that have confirmed that they will be <strong>connecting with the Cosmos Hub via IBC this year:</strong></p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><em>Terra</em></th>\n<th align=\"left\"><em>Thorchain</em></th>\n<th align=\"left\"><em>Althea</em></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><em>Akash</em></td>\n<td align=\"left\"><em>Kava</em></td>\n<td align=\"left\"><em>LikeCoin</em></td>\n</tr>\n<tr>\n<td align=\"left\"><em>Sentinel</em></td>\n<td align=\"left\"><em>IRISNet</em></td>\n<td align=\"left\"><em>Crypto.com</em></td>\n</tr>\n<tr>\n<td align=\"left\"><em>Regen</em></td>\n<td align=\"left\"><em>Starname</em></td>\n<td align=\"left\"><em>Microtick</em></td>\n</tr>\n<tr>\n<td align=\"left\"><em>Cyber</em></td>\n<td align=\"left\"><em>Band</em></td>\n<td align=\"left\"><em>Commercio</em></td>\n</tr>\n</tbody></table>\n\n<p>Source: wenmainnet.com</p>\n\n<p>Now, I want to share why I think the <strong>Cosmos Gravity Dex</strong> will be powerful.</p>\n\n<blockquote>\n<p>Generally, only people that are well off can interact with DeXes on Ethereum. If you take a look at Uniswap, it&#39;s easy to come to the conclusion that people that want to invest $10-100 will more than likely choose to not make the trade because they&#39;ll be burning half their investment in Ethereum fees.  You can immediately conclude that that is why Pancake Swap and the Binance Coin has gained so much adoption. Slippage and tolerance are also big issues! Especially if you’re trying to trade on short time frames. The Cosmos Gravity DeX coming from B-Harvest is an Equivalent Swap Price Model (ESPM) that will swap tokens with usual AMM interface, give you the ability to invest in pools for high yields and submit limit orders into the orderbooks. The DeX is showing alot of promise with a couple innovations: Batch Execution and the Equivalent Swap Price Model.  </p>\n\n<p><strong>Batch Execution</strong> is an interesting take because it will help sort out the issue we see on Uniswap with arbitrageurs manipulating the system to make their profits. Uniswap orders are executed &quot;sequentially,&quot; but the sorting of the &quot;sequence&quot; is not fair. Skilled arbitrageurs and HFT send more gas to miners so that their txs can be located in front of other orders. With Batch Execution every order is treated fairly in a batch.</p>\n</blockquote>\n\n<pre><code>With the Equivalent Swap Price Model we are knocking out inefficient price discovery on day one of liquidity pools on the Cosmos Hub. The pool price lands &quot;exactly&quot; at the latest swap price. Fair for the trader who executed latest swap, fair for the pool, and fair for the potential traders who will swap immediately after.  What has been pointed out in CPMM (Constant Product Market Maker) is that the latest &quot;swap price&quot; and current &quot;pool price&quot; is inconsistent(different). For example, in CPMM, if last pool price is 100, and a trader swap 1% amount of pool, swap price is 101, and pool price after swap is little bit higher than &quot;102&quot;. With ESPM there is not much room for arbitrage.\n</code></pre>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>The Ethereum environment is not a good place for innovated AMM implementation because on their network blocks are slow, calculation is expensive, and has no endblock calculation ability and so we are lucky to have the Cosmos Hub with it&#39;s fair, efficient, stable, and reliable decentralized infrastructure for the landing of a fair, efficient, stable, and reliable decentralized DeX!  </p>\n\n<p>I&#39;d like to note that there is no one answer to any DeX. Part of the multi-chain vision approach,is that everything is a valid approach. Some use cases will ask for different priorities: security vs ease of use, scalability vs specific use, there are lots of varying use cases and it&#39;s probable that all existing AMM’s and DeXes are currently under-developed and still have plenty of room for experimentation.  AMMs are the most important tech in the blockchain space since permission-less value transfer, and so we are about to witness an explosion of innovation on our network!</p>\n</blockquote>\n\n<p>Source: twitter.com/b__harvest</p>\n\n<p>Next, I&#39;d like to talk about why <strong>Shared Securities</strong> will be powerful on Cosmos.</p>\n\n<blockquote>\n<p>Simply put, different applications need different levels of securities. Some applications will need tons of active security, others will only need it when a transaction happens. With the shared security model they are working on, they want to make a system where you can just pay as you go. Not everything needs 24/7 security and because of this, the shared security system on the Cosmos has a probability of being more tangible, more scalable and more mature than other shared security systems. Allowing different security levels means more diversity of dApps, for example if your project doesn’t require it&#39;s own para chain, use a para thread. (Para-threads are like ‘lite’ block chains, you don’t always have to make an entire new chain for specific apps. If you only offer parachains anyone wanting to build on there will be paying similarly even if they do not need the same level of security)</p>\n</blockquote>\n\n<p>Almost done! Want to talk about <strong>the numbers:</strong></p>\n\n<blockquote>\n<p>68,000+ User delegates  </p>\n\n<p>210,000+ Individual wallet accounts  </p>\n\n<p>125+ Current Validators, 230 Total  </p>\n\n<p>70,000+ Weekly transactions  </p>\n\n<p>~ .0003% of Atoms currently unbonding VS Bonded rate ( 59, 817 / 193,682,669 ) - No-one is selling anytime soon!  </p>\n\n<p>~ 64% Supply already being staked / delegated already. (This lowers liquidity in the open market and also inherently promotes holding coins as opposed to actively trading them. People CAN still move the ATOM if they wish with a 21 day unbonding period but many may choose to just collect the ROI from the rewards as it is risk free. )  </p>\n\n<p>661, 208 ATOM in the Community Pool - Community voting for funding projects from the built in treasury. This creates incentives for developers to work and pitch their idea to the community to receiving funding. System is an inherent venture capital incubator because of this - over 1.28 billion dollars in the ATOM treasury to fund developers and entrepreneurs currently. Eth does not have this at all and so is not as self-sustaining as ATOM.</p>\n</blockquote>\n\n<p>Source: Mintscan.io</p>\n\n<p>Last but not least, some <strong>Cosmos Surface-Level Highlights:</strong></p>\n\n<ul>\n<li>Impressively decentralized</li>\n<li>BFT Consensus Tendermint is incredibly fast and secure</li>\n<li>Fast, robust, built to scale with liquid democracy governance for on chain voting, open to all.</li>\n<li>The entire network is fully operated and owned by the community with 100% of all block production being handled by community stake pools.</li>\n<li>Entire protocol to be community driven and able to make choices in a more robust manner compared to the industry standard.</li>\n<li>Built on solid foundations by some of the best people in the industry, who have been working/planning this for over half a decade.</li>\n<li>Will enable direct and decentralized chain-to-chain interoperability without any centralized custodials or middlemen protocols.</li>\n<li>DEFI will no longer have the very high fees associated with it.</li>\n<li>Decentralized voting through the network wallets, that provides rewards as an incentive to participate and use your voting rights.</li>\n<li>All projects on the Cosmos Network have to the choice to have their own treasury system and voting system built right in for their own projects and communities. This is inherent to the system and allows other developers to take advantage of the same benefits that the base Cosmos protocol does.</li>\n<li>Largest decentralized PoS network with no downsides to staking and no minimums. You just put it in your wallet and pick a validator. It takes about 3 clicks and you begin to earn ATOM. No special hardware or electricity demand needed with no lockup. Your ATOM can be unstaked and sold with a 21-day wait period which is like child-proofing crypto for people that will panic in a sell. The huge staking incentives leaves us with almost ¾ of all atoms staked on the network.</li>\n<li>But Atom has no smart contract functionality yet? Cosmos has built in Smart Contracts CosmWasm, but the community is developing Juno Smart Contracts to be launching off-chain sometime in April in order to keep the congestion off the hub!</li>\n<li>But Atom has no shared security yet? Atom will have shared security, likely even before endo f this year whether that&#39;s an incubator chain or on-chain is yet to be decided but anyone who doesn&#39;t want to make their own sovereign chain on the Cosmos Network will be able to use smart contracts and Shared Security to develop on the platform without needing to find their own validator set. Good to note is the fact that Cosmos Ecosystem projects have found it quite easy to find a validator set if they choose to build a sovereign chain.</li>\n<li>Prop 34 (Luna Mission) is only 2 months in progress with most of the focus being on YouTube and Twitter, we have already started to see the effects of the first movements and soon we will see what will happen with the allocated ATOMS going to the PR Agency and other initiatives very soon.</li>\n</ul>\n\n<p><strong>Wrapping up here,</strong></p>\n\n<p>Cosmos pioneered adversarial test-net model.</p>\n\n<p>Cosmos pioneered Inter-Chain model.</p>\n\n<p>Cosmos continues pioneering,</p>\n\n<p>Cosmos is not about selling a story, the technology exists. The plan was to bring value to its users, and then to bring more utility to it&#39;s users. From there, we see where the value flows from utility. It&#39;s a pretty straight forward game plan, for a very long game: focus on building things that are useful, if the network has utility, value will come. Cosmos specializes in offering IBC value propositions, we found what the hub specializes in the next step is to utilize every ounce of what that specialization is about! Get more blockchains to connect via IBC, build bridges, create tools for them to communicate and trade. The Hub is a place where parties in the Interchain can “stay awhile and listen.”</p>\n\n<p><strong>The Whitepaper is shipped, development is just beginning.</strong></p>\n</div><!-- SC_ON -->",
  "score": 596,
  "permalink": "/r/CryptoCurrency/comments/mjt12g/cosmos_atom_insight_i_did_some_research_thought/",
  "subreddit": "CryptoCurrency",
  "id": "mjt12g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875627
}