{
  "author": "Almondust-000",
  "original_created_utc": 1637435502,
  "title": "Is it a typical experience to have little to no votes or replies to your posts and comments?",
  "created_utc": 1637452309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not too concerned with karma, but more so interesting discussion. However, I have neither. Even my last post was dismissed and locked after 3 minutes. What&#39;s the key to finding intellectual stimulation on Reddit?</p>\n\n<p>Contrary to the tone of this post, I am fairly outgoing and engage with people very easily in the real world, but failing at creating interesting interactions on Reddit.</p>\n\n<p>Also I preemptively recognize the irony of this post that no one will read.</p>\n\n<p>EDIT: At 50 upvotes and 38 comments. I think it&#39;s safe to say, gladly, that the last paragraph didn&#39;t age well. Thanks all!</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/qychcz/is_it_a_typical_experience_to_have_little_to_no/",
  "subreddit": "TooAfraidToAsk",
  "id": "qychcz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not too concerned with karma, but more so interesting discussion. However, I\nhave neither. Even my last post was dismissed and locked after 3 minutes. What's\nthe key to finding intellectual stimulation on Reddit?\n\nContrary to the tone of this post, I am fairly outgoing and engage with people\nvery…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カルマはあまり気にしていませんが、むしろ興味深い議論です。しかし、私には\nどちらでもない。私の最後の投稿でさえ、3分後には却下され、ロックされました。Redditで\nRedditで知的な刺激を得るための秘訣は何でしょうか？\n\nこの投稿のトーンとは逆に、私はかなり外向的で、人との関わりを大切にしています。\nとても...",
      "title": "自分の投稿やコメントに対する投票や返信がほとんどないのは、一般的な経験ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不太关心因果报应，但更多的是这样有趣的讨论。然而，我\n都没有。甚至我的最后一个帖子在3分钟后就被驳回并锁定。什么是\n在Reddit上找到智力刺激的关键？\n\n与这个帖子的语气相反，我相当外向，与人交往\n非常...",
      "title": "对你的帖子和评论几乎没有投票或回复，这是不是一种典型的经历？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不太關心因果報應，但更多的是這樣有趣的討論。然而，我\n都沒有。甚至我的最後一個帖子在3分鐘後就被駁回並鎖定。什麼是\n在Reddit上找到智力刺激的關鍵？\n\n與這個帖子的語氣相反，我相當外向，與人交往\n非常...",
      "title": "對你的帖子和評論幾乎沒有投票或回覆，這是不是一種典型的經歷？"
    }
  ]
}