{
  "author": "Apps4Life",
  "original_created_utc": 1628578300,
  "title": "If you live in Alabama do not forget that today Senator Richard Shelby single-handedly killed the crypto industry in the US by blocking the infrastructure bill amendment. He has held this office for THIRTY-FOUR years, he is corrupt, VOTE HIM OUT.",
  "created_utc": 1628588358,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He is funded by banks. He is almost 90 years old. He has no clue what he is voting on, he voted against his own base, he is compromised, he is corrupt, he has single-handedly jeopardized a multi-trillion dollar industry. He has been in office so long he thinks he can do whatever he wants, do not let your Alabama friends and family vote this man back in for the 35th year in a row, do not forget his name. Senator Richard Shelby</p>\n</div><!-- SC_ON -->",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/p1jy84/if_you_live_in_alabama_do_not_forget_that_today/",
  "subreddit": "CryptoCurrency",
  "id": "p1jy84",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "He is funded by banks. He is almost 90 years old. He has no clue what he is\nvoting on, he voted against his own base, he is compromised, he is corrupt, he\nhas single-handedly jeopardized a multi-trillion dollar industry. He has been in\noffice so long he thinks he can do whatever he wants, do not let…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼は銀行から資金提供を受けています。彼はもうすぐ90歳になる。彼は自分が何をしているのか全く理解していません。\n自分の支持層に逆らって投票し、妥協し、堕落していて\n数兆ドル規模の産業をたった一人で危険にさらしてしまったのです。彼は就任してから\n彼は長い間オフィスにいて、何をしてもいいと思っている。",
      "title": "アラバマ州にお住まいの方は、今日、Richard Shelby上院議員がインフラ法案の修正案を阻止することで、米国の暗号産業を単独で潰したことを忘れないでください。彼は34年間この職に就いていますが、彼は腐敗しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他是由银行资助的。他已经快90岁了。他根本不知道自己在做什么\n他不知道自己在投票什么，他投票反对自己的基础，他妥协了，他腐败了。\n他单枪匹马地危害了一个几万亿美元的产业。他已经在\n执政时间太长，他认为自己可以为所欲为，不要让...",
      "title": "如果你住在阿拉巴马州，不要忘记，今天参议员理查德-谢尔比通过阻止基础设施法案修正案，一手扼杀了美国的加密货币行业。他担任这个职务已经34年了，他是个腐败分子，请把他投出去。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他是由銀行資助的。他已經快90歲了。他根本不知道自己在做什麼\n他不知道自己在投票什麼，他投票反對自己的基礎，他妥協了，他腐敗了。\n他單槍匹馬地危害了一個幾萬億美元的產業。他已經在\n執政時間太長，他認爲自己可以爲所欲爲，不要讓...",
      "title": "如果你住在阿拉巴馬州，不要忘記，今天參議員理查德-謝爾比通過阻止基礎設施法案修正案，一手扼殺了美國的加密貨幣行業。他擔任這個職務已經34年了，他是個腐敗分子，請把他投出去。"
    }
  ]
}