{
  "author": "Qtredit",
  "original_created_utc": 1650272363,
  "title": "If someone found a way to get rich, he'd never expose it and would just keep getting rich",
  "created_utc": 1650299959,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m talking about crypto YouTubers promising to teach you the techniques to become a crypto millionaire or about people selling entire courses teaching you all the ways to find the best Shitcoins.&lt;/p&gt;\n\n&lt;p&gt;To me it sounds like a paradox.&lt;/p&gt;\n\n&lt;p&gt;If I&amp;#39;d found a way to make easy money I&amp;#39;d never share it, and I&amp;#39;d definitely wouldn&amp;#39;t need the money from YouTube or from selling courses or books.&lt;/p&gt;\n\n&lt;p&gt;Just because someone on the internet says he&amp;#39;s now filthy rich, doesn&amp;#39;t mean it&amp;#39;s true.&lt;/p&gt;\n\n&lt;p&gt;If there&amp;#39;s a way to become rich easily with crypto you&amp;#39;d have to find it yourself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 334,
  "permalink": "/r/CryptoCurrency/comments/u68m55/if_someone_found_a_way_to_get_rich_hed_never/",
  "subreddit": "CryptoCurrency",
  "id": "u68m55",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm talking about crypto YouTubers promising to teach you the techniques to\nbecome a crypto millionaire or about people selling entire courses teaching you\nall the ways to find the best Shitcoins.\n\nTo me it sounds like a paradox.\n\nIf I'd found a way to make easy money I'd never share it, and I'd…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号のYouTuberが、そのテクニックを教えると約束していることについて話しています。\n暗号億万長者や、暗号を教えるコースを販売する人々について。\n最高のクソコインを見つけるためのすべての方法。\n\n私にはパラドックスに聞こえます。\n\nもし私が簡単にお金を稼ぐ方法を見つけたとしても、それを共有することはないだろうし、...",
      "title": "もし誰かが金持ちになる方法を見つけたとしても、それを暴露することはなく、ひたすら金持ちになり続けるだろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的是加密货币优酷网友承诺教你成为加密货币百万富翁的技术。\n或者有人出售整个课程，教你如何找到最好的狗屎币。\n所有的方法来找到最好的狗屎币。\n\n对我来说，这听起来像是一个悖论。\n\n如果我找到了轻松赚钱的方法，我永远不会分享它，而且我也会...",
      "title": "如果有人找到了致富的方法，他永远不会曝光，只会继续致富。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的是加密貨幣優酷網友承諾教你成爲加密貨幣百萬富翁的技術。\n或者有人出售整個課程，教你如何找到最好的狗屎幣。\n所有的方法來找到最好的狗屎幣。\n\n對我來說，這聽起來像是一個悖論。\n\n如果我找到了輕鬆賺錢的方法，我永遠不會分享它，而且我也會...",
      "title": "如果有人找到了致富的方法，他永遠不會曝光，只會繼續致富。"
    }
  ]
}