{
  "author": "Arbsbuhpuh",
  "the_new_excerpt": "Buy the dip, for sure. Surprise crypto sale, yay! However, whenever I was\nconsidering transferring another chunk of money to put intro crypto after seeing\na coin I believe in 15%-30% down, I started imagining my wife's face a few\nmonths or years when I tell her my student loans are paid off, or that…",
  "original_created_utc": 1619186504,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ディップは絶対に買い。サプライズ・クリプト・セール、イェーイ！」。しかし、私が\n自分が信じているコインが15%～30%下がっているのを見て、別のお金を送金して暗号を導入しようと考えるたびに\n信じているコインが15～30%下落しているのを見て、別の資金を移そうと考えるたびに、数ヶ月後、数年後に学生ローンを完済したと言ったときの妻の顔を想像するようになった。\n数ヶ月後、数年後に学生ローンが完済されたと言ったときの妻の顔を想像するようになりました...。",
      "title": "このディップは要注意"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "买跌停，肯定的。惊喜的加密货币销售，耶! 然而，每当我\n考虑再转移一大笔钱来投资加密货币时，看到我相信的一个硬币下跌15%-30%，我就开始想象我妻子的脸。\n的时候，我就开始想象几个月或几年后我告诉我妻子我的学生贷款已经还清的时候她的表情。\n几个月或几年后，当我告诉她我的学生贷款已经还清了，或者......。",
      "title": "小心这个浸泡"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "買跌停，肯定的。驚喜的加密貨幣銷售，耶! 然而，每當我\n考慮再轉移一大筆錢來投資加密貨幣時，看到我相信的一個硬幣下跌15%-30%，我就開始想象我妻子的臉。\n的時候，我就開始想象幾個月或幾年後我告訴我妻子我的學生貸款已經還清的時候她的表情。\n幾個月或幾年後，當我告訴她我的學生貸款已經還清了，或者......。",
      "title": "小心這個浸泡"
    }
  ],
  "title": "Be careful this dip",
  "created_utc": 1619210335,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Buy the dip, for sure. Surprise crypto sale, yay! However, whenever I was considering transferring another chunk of money to put intro crypto after seeing a coin I believe in 15%-30% down, I started imagining my wife&#39;s face a few months or years when I tell her my student loans are paid off, or that we have a down payment for a house she wasn&#39;t aware of, or that we can buy a Tesla cash.</p>\n\n<p>Beware! I started thinking of the Wolf of Wall Street, or any pump and dump movie about stocks... Those are the EXACT same lines the guys on the phone feed the mark. &quot;You&#39;ll be a hero to your wife, think about it! She&#39;ll think she married a genius, etc.etc.&quot;</p>\n\n<p>Well, my wife already respects me. She already loves me. Don&#39;t let it FOMO you, one small chunk at a time, into over investing. No one needs to say that crypto is a volatile market. Y&#39;all know that. Just a reminder to stick with your strategy. I&#39;ve already been weak and thrown in several times what I initially expected I would. It isn&#39;t hurting me yet, but I needed a self check, and the lines I was feeding myself were it.</p>\n\n<p>Here&#39;s wishing you all lambos and mansions... But there&#39;s absolutely NOTHING wrong with paid-off toyotas and a modest 3-bedroom.</p>\n</div><!-- SC_ON -->",
  "score": 434,
  "permalink": "/r/CryptoCurrency/comments/mwvxwb/be_careful_this_dip/",
  "subreddit": "CryptoCurrency",
  "id": "mwvxwb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208793
}