{
  "author": "mrquib",
  "the_new_excerpt": "If you're basing your investing decisions on the reassurance of random people on\nthe internet you probably:\n\na) don't actually understand what you're putting your money into, so don't have\nfaith in the investment long-term\n\nor b) have more invested than you're able to lose, so are panicking and…",
  "original_created_utc": 1619227931,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが、インターネット上の不特定多数の人の安心感に基づいて投資判断をしているなら、おそらく次のようなことが考えられます。\nあなたはおそらく\n\na) 自分が何にお金をつぎ込んでいるのか実際には理解していないので、長期的な投資に対する信頼性がない。\n長期的な投資を信じていない\n\nb) 失う可能性がある以上の金額を投資していて、パニックになっていて...。",
      "title": "インターネット上で見知らぬ人に、暗号を売るべきかどうかを尋ねているのなら、おそらく暗号を売るべきでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你把你的投资决定建立在互联网上随机的人的保证上，你可能会\n的保证，你可能。\n\na) 并不真正了解你把钱放在什么地方，所以对投资没有信心。\n对长期投资有信心\n\n或者b)你的投资超过了你能承受的损失，所以感到恐慌和...",
      "title": "如果你在互联网上问陌生人是否应该出售你的加密货币，你可能应该出售你的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你把你的投資決定建立在互聯網上隨機的人的保證上，你可能會\n的保證，你可能。\n\na) 並不真正瞭解你把錢放在什麼地方，所以對投資沒有信心。\n對長期投資有信心\n\n或者b)你的投資超過了你能承受的損失，所以感到恐慌和...",
      "title": "如果你在互聯網上問陌生人是否應該出售你的加密貨幣，你可能應該出售你的加密貨幣"
    }
  ],
  "title": "If you're asking strangers on the internet whether or not you should sell you crypto, you should probably sell your crypto",
  "created_utc": 1619242414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re basing your investing decisions on the reassurance of random people on the internet you probably:</p>\n\n<p>a) don&#39;t actually understand what you&#39;re putting your money into, so don&#39;t have faith in the investment long-term</p>\n\n<p>or b) have more invested than you&#39;re able to lose, so are panicking and looking for answers (PS. nobody has the answer).</p>\n\n<p>In either case, you should probably downsize your position</p>\n</div><!-- SC_ON -->",
  "score": 730,
  "permalink": "/r/CryptoCurrency/comments/mx9xtk/if_youre_asking_strangers_on_the_internet_whether/",
  "subreddit": "CryptoCurrency",
  "id": "mx9xtk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208810
}