{
  "author": "rageagainstbedtime",
  "original_created_utc": 1649383924,
  "title": "Why is the oversexualization/fetishization of female characters so rampant, normalized, and even overlooked in anime?",
  "created_utc": 1649393362,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just what the title says. The fanservice in so much anime is just so unapologetically in your face. I understand that it&amp;#39;s a largely male-dominated form of media, but you could say that about practically &lt;em&gt;any&lt;/em&gt; form of media from music to art to video games to movies/tv. As far as I can tell, pretty much the only media where women are even more sexualized than anime is straight up porn (which of course includes hentai).&lt;/p&gt;\n\n&lt;p&gt;One example from an all-time great anime: Faye from Cowboy Bebop. Her backstory and character arch had so much potential, but instead half of her screen time is basically just her tits bouncing around in her skimpy outfit and/or using her sexuality to try to get what she wants.&lt;/p&gt;\n\n&lt;p&gt;And then you have these really disturbing dynamics like in Mezzo Forte or Elfen Lied. Both have this jarring juxtaposition within their female main characters where the female can be this absolutely killer badass, but only as long as they have another counter-personality where they are completely helpless, hyper-sexualizations of themselves.&lt;/p&gt;\n\n&lt;p&gt;In the case of Mezzo Forte, Mikura Suzuki has violent &lt;span class=\"md-spoiler-text\"&gt;rape&lt;/span&gt; fantasies/dreams that are implied to be secretly enjoyable to her. In Elfen Lied the strong female characters (Kaede/Nyu, etc.) can only exist as long as they also have this helpless, infantilized, and sexualized counter-personality to somehow appease the idea that the male characters are somehow still dominant.&lt;/p&gt;\n\n&lt;p&gt;And of course there&amp;#39;s Master Roshi and Meliodas/Wrath and countless other examples of male characters just constantly engaging in blatant sexual assault and harassment of female characters only to be written off as &amp;quot;innocent&amp;quot; or &amp;quot;harmless old pervert&amp;quot; or a &amp;quot;joke&amp;quot; or &amp;quot;boys will be boys&amp;quot; behavior.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s fucked up.&lt;/p&gt;\n\n&lt;p&gt;This is a trend in anime where it is just so much easier to find examples of the rule, rather than exceptions to it.&lt;/p&gt;\n\n&lt;p&gt;As a final note: part of the reason why I love Studio Ghibli so much is that it is so consistently an exception to that standard that has become so obnoxiously common in anime. Every female character in their stories has agency, strength, motivation, and purpose other than just being there for the male characters/audience to ogle and fantasize over.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/tysx2y/why_is_the_oversexualizationfetishization_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "tysx2y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Just what the title says. The fanservice in so much anime is just so\nunapologetically in your face. I understand that it's a largely male-dominated\nform of media, but you could say that about practically any form of media from\nmusic to art to video games to movies/tv. As far as I can tell, pretty…"
}