{
  "author": "fortifier22",
  "the_new_excerpt": "We've already seen how badly the markets did as GME suddenly did incredibly well\nlast week. Hedge Funds and shorters of GME had to liquidate other investments in\norder to do their aggressive short ladder attacks on GME.\n\nYet with all the action around GME, and with the current state of the world,…",
  "original_created_utc": 1614557439,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们已经看到了市场的表现有多糟糕，因为GME突然表现得非常好。\n上周，对冲基金和GME的做空者不得不清算o 对冲基金和做空GME的人不得不清算其他投资，在。\n以便对GME进行积极的短梯攻击。\n\n然而围绕着GME的行动，以及目前的世界现状，......",
      "title": "在GME火箭准备发射的同时，对冲基金可能正在做空其他股票，并对GME进行看涨。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們已經看到了市場的表現有多糟糕，因爲GME突然表現得非常好。\n上週，對沖基金和GME的做空者不得不清算o 對沖基金和做空GME的人不得不清算其他投資，在。\n以便對GME進行積極的短梯攻擊。\n\n然而圍繞着GME的行動，以及目前的世界現狀，......",
      "title": "在GME火箭準備發射的同時，對沖基金可能正在做空其他股票，並對GME進行看漲。"
    }
  ],
  "title": "While the GME rocket is preparing for launch, hedge funds are likely shorting other stocks and placing calls on GME",
  "created_utc": 1614613170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;ve already seen how badly the markets did as GME suddenly did incredibly well last week. Hedge Funds and shorters of GME had to liquidate other investments in order to do their aggressive short ladder attacks on GME.</p>\n\n<p>Yet with all the action around GME, and with the current state of the world, if GME does moon, many other stocks will come crashing down as shorters are forced to cover their positions.</p>\n\n<p>And this is how hedge funds will win no matter what happens;</p>\n\n<p>They&#39;ve already set up GME to take off with how much aggressive shorting has been happening.</p>\n\n<p>When the GME rocket takes off, they&#39;ll hold shorts on other stocks while holding calls on GME and make huge money off all market activity.</p>\n\n<p>And while GME moons, retail traders and other hedge funds/investors that got on the GME rocket will win BIG TIME.</p>\n\n<p>Yet at the same time, many of the rest of the stocks will crash and cause many to lose big time.</p>\n\n<p>I wouldn&#39;t be surprised if enough insider trading is happening to have a planned date for when GME will take off so that they can time the markets perfectly and make sure as few retail traders are on the rocket as possible.</p>\n\n<p><strong>TL:DR; It&#39;s just like the movie 2012, but hedge funds will benefit whether the world ends or not.</strong></p>\n</div><!-- SC_ON -->",
  "score": 1457,
  "permalink": "/r/wallstreetbets/comments/luunvc/while_the_gme_rocket_is_preparing_for_launch/",
  "subreddit": "wallstreetbets",
  "id": "luunvc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937755471
}