{
  "author": "Ryanyu10",
  "original_created_utc": 1660558284,
  "title": "According to Wikipedia, there was a Chinese famine in 1906-1907 that resulted in the death of 20-25 million people, rivaling the casualties of the Great Leap Forward. However, it also notes that the sourcing for this claim is dubious. In reality, how significant was this famine, if at all?",
  "created_utc": 1660585787,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For reference, &lt;a href=\"https://en.wikipedia.org/wiki/Chinese_famine_of_1906%E2%80%931907\"&gt;this is the Wikipedia article&lt;/a&gt;. The page seems to have been created quite recently, in December of 2019, and with rather thin sourcing, which I find somewhat questionable for such a supposedly significant event. As it notes, &amp;quot;two modern commentaries estimate the total famine deaths in the range of 20–25 million, implying that most of the population of northern Anhui and northern Jiangsu population were wiped out, but offering no explanation on how the calculation is made.&amp;quot; The article&amp;#39;s associated &amp;quot;Talk&amp;quot; page even includes discussion about whether it should be deleted for being too factually shaky, or whether there even was a famine in the first place. But based on edits since then, it seems like the famine did at least happen: there are two accessible sources in Chinese, one from the archives of &lt;em&gt;Shen Bao&lt;/em&gt; and one from &lt;em&gt;The Qing History Journal&lt;/em&gt;, that at least mention a famine in that time period, though they don&amp;#39;t detail exactly how catastrophic the famine was.&lt;/p&gt;\n\n&lt;p&gt;Still, it baffles me that a famine of this (alleged) magnitude has gone more or less completely omitted from English scholarship, as far as I can find, which leads me to wonder if the famine was in fact significantly less consequential than the estimated deaths make it out to be. I also couldn&amp;#39;t find anything about it on Chinese Wikipedia or Baidu Baike, which leads me to tentatively believe that theory. That said, I also found &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/5i6weg/wikipedia_claims_that_in_china_in_1907_there_was/\"&gt;previous discussion of this topic&lt;/a&gt; on this subreddit six years ago, which seems to suggest that 25 million deaths could in fact be an accurate estimate, but the sole response there (by &lt;a href=\"/u/keyilan\"&gt;/u/keyilan&lt;/a&gt;) only explicitly mentions one source, which was the same source criticized by Wikipedia editors for being unreliable. All of which leads me to ask: is the magnitude of this event a hoax caused by bad academic or editorial practices, or is it true and simply a historical blind spot among English-language scholars? (Or perhaps it&amp;#39;s something else entirely?)&lt;/p&gt;\n\n&lt;p&gt;Edit: I did a bit more searching, which led me to &lt;a href=\"https://digitalrepository.trincoll.edu/cgi/viewcontent.cgi?referer=&amp;amp;httpsredir=1&amp;amp;article=1024&amp;amp;context=moore\"&gt;this 1907 manuscript&lt;/a&gt; by an English correspondent in Jiangsu, which speaks about the conditions of the famine and the failures of the Qing government response. It also, however, pegs the numbers for the famine at around 10 million affected, which seems like a far cry from the 20-25 million dead asserted elsewhere. But perhaps that&amp;#39;s a thread that could provide a more definite number?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/wovupk/according_to_wikipedia_there_was_a_chinese_famine/",
  "subreddit": "AskHistorians",
  "id": "wovupk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For reference, this is the Wikipedia article\n[https://en.wikipedia.org/wiki/Chinese_famine_of_1906%E2%80%931907]. The page\nseems to have been created quite recently, in December of 2019, and with rather\nthin sourcing, which I find somewhat questionable for such a supposedly\nsignificant event. As it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "参考までに、Wikipediaの記事です。\n[https://en.wikipedia.org/wiki/Chinese_famine_of_1906%E2%80%931907]. このページ\nは、2019年12月とかなり最近に作成されたようで、しかも、割と\nソースが薄く、このような想定される出来事としてはやや疑問が残る。\n重要な出来事である。それはそれとして...",
      "title": "Wikipediaによると、1906年から1907年にかけて、大躍進の犠牲者に匹敵する2000万人から2500万人が死亡した中国大飢饉があったという。しかし、この主張のソースは疑わしいと書いてある。では、この大飢饉はどの程度の規模だったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为参考，这是维基百科的文章\n[https://en.wikipedia.org/wiki/Chinese_famine_of_1906%E2%80%931907]. 该页面\n似乎是最近创建的，在2019年12月，并且有相当的\n的来源，我认为对于这样一个所谓的重大事件来说，这有点值得怀疑。\n重要的事件来说，我觉得有点可疑。因为它...",
      "title": "根据维基百科，1906-1907年中国发生了一场饥荒，导致2000-2500万人死亡，与大跃进的伤亡人数相当。然而，它也指出，这一说法的来源是可疑的。实际上，这场饥荒有多大意义，如果有的话？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲參考，這是維基百科的文章\n[https://en.wikipedia.org/wiki/Chinese_famine_of_1906%E2%80%931907]. 該頁面\n似乎是最近創建的，在2019年12月，並且有相當的\n的來源，我認爲對於這樣一個所謂的重大事件來說，這有點值得懷疑。\n重要的事件來說，我覺得有點可疑。因爲它...",
      "title": "根據維基百科，1906-1907年中國發生了一場饑荒，導致2000-2500萬人死亡，與大躍進的傷亡人數相當。然而，它也指出，這一說法的來源是可疑的。實際上，這場饑荒有多大意義，如果有的話？"
    }
  ]
}