{
  "author": "Ryanyu10",
  "original_created_utc": 1660558284,
  "title": "According to Wikipedia, there was a Chinese famine in 1906-1907 that resulted in the death of 20-25 million people, rivaling the casualties of the Great Leap Forward. However, it also notes that the sourcing for this claim is dubious. In reality, how significant was this famine, if at all?",
  "created_utc": 1660585787,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For reference, &lt;a href=\"https://en.wikipedia.org/wiki/Chinese_famine_of_1906%E2%80%931907\"&gt;this is the Wikipedia article&lt;/a&gt;. The page seems to have been created quite recently, in December of 2019, and with rather thin sourcing, which I find somewhat questionable for such a supposedly significant event. As it notes, &amp;quot;two modern commentaries estimate the total famine deaths in the range of 20–25 million, implying that most of the population of northern Anhui and northern Jiangsu population were wiped out, but offering no explanation on how the calculation is made.&amp;quot; The article&amp;#39;s associated &amp;quot;Talk&amp;quot; page even includes discussion about whether it should be deleted for being too factually shaky, or whether there even was a famine in the first place. But based on edits since then, it seems like the famine did at least happen: there are two accessible sources in Chinese, one from the archives of &lt;em&gt;Shen Bao&lt;/em&gt; and one from &lt;em&gt;The Qing History Journal&lt;/em&gt;, that at least mention a famine in that time period, though they don&amp;#39;t detail exactly how catastrophic the famine was.&lt;/p&gt;\n\n&lt;p&gt;Still, it baffles me that a famine of this (alleged) magnitude has gone more or less completely omitted from English scholarship, as far as I can find, which leads me to wonder if the famine was in fact significantly less consequential than the estimated deaths make it out to be. I also couldn&amp;#39;t find anything about it on Chinese Wikipedia or Baidu Baike, which leads me to tentatively believe that theory. That said, I also found &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/5i6weg/wikipedia_claims_that_in_china_in_1907_there_was/\"&gt;previous discussion of this topic&lt;/a&gt; on this subreddit six years ago, which seems to suggest that 25 million deaths could in fact be an accurate estimate, but the sole response there (by &lt;a href=\"/u/keyilan\"&gt;/u/keyilan&lt;/a&gt;) only explicitly mentions one source, which was the same source criticized by Wikipedia editors for being unreliable. All of which leads me to ask: is the magnitude of this event a hoax caused by bad academic or editorial practices, or is it true and simply a historical blind spot among English-language scholars? (Or perhaps it&amp;#39;s something else entirely?)&lt;/p&gt;\n\n&lt;p&gt;Edit: I did a bit more searching, which led me to &lt;a href=\"https://digitalrepository.trincoll.edu/cgi/viewcontent.cgi?referer=&amp;amp;httpsredir=1&amp;amp;article=1024&amp;amp;context=moore\"&gt;this 1907 manuscript&lt;/a&gt; by an English correspondent in Jiangsu, which speaks about the conditions of the famine and the failures of the Qing government response. It also, however, pegs the numbers for the famine at around 10 million affected, which seems like a far cry from the 20-25 million dead asserted elsewhere. But perhaps that&amp;#39;s a thread that could provide a more definite number?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/wovupk/according_to_wikipedia_there_was_a_chinese_famine/",
  "subreddit": "AskHistorians",
  "id": "wovupk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For reference, this is the Wikipedia article\n[https://en.wikipedia.org/wiki/Chinese_famine_of_1906%E2%80%931907]. The page\nseems to have been created quite recently, in December of 2019, and with rather\nthin sourcing, which I find somewhat questionable for such a supposedly\nsignificant event. As it…"
}