{
  "author": "DetroitMotorShow",
  "original_created_utc": 1635321282,
  "title": "Last time a dog coin shitcoin entered top 10, the entire market fell off a cliff. History Doesn't Repeat Itself, but It Often Rhymes.",
  "created_utc": 1635334689,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Currently a dog coin is #4 in terms of volume, and has more volume than all except 2 &quot;legit&quot; coins in top 100. There is more capital trading and putting their money into this meme than there is in several other altcoins that have better technology, or innovation or actual adoption and use cases. </p>\n\n<p>Many prominent alts are quite low or crushed in terms of their crypto trading pair. Many Defi / dex coins are faring poorly, many are below their ATH. Obviously, a lot of interest and money has gone towards trading these dog coin scraps over other projects. As a result, alts havent really taken off. </p>\n\n<p>Last time a dog coin barged its way into the top 10, the entire market crashed 20-30% in a matter of days. The parallels are just too obvious with May. Back then, the entire market was lifted by a rising tide from December to Feb, but as soon as a dog coin entered top 10, things became frothy and sure enough, we saw -10%/-15% days and volatile corrections as many big whales started seeking the exit door.</p>\n\n<p>Of course, past is not indicative of future performance, but often rhymes. A shitcoin entering top 10 with massive volume can easily be seen by big money investors as a sign of a frothy and unhealthy market, and they may choose to play it safe by taking out their profits.</p>\n</div><!-- SC_ON -->",
  "score": 379,
  "permalink": "/r/CryptoCurrency/comments/qgrfg3/last_time_a_dog_coin_shitcoin_entered_top_10_the/",
  "subreddit": "CryptoCurrency",
  "id": "qgrfg3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Currently a dog coin is #4 in terms of volume, and has more volume than all\nexcept 2 \"legit\" coins in top 100. There is more capital trading and putting\ntheir money into this meme than there is in several other altcoins that have\nbetter technology, or innovation or actual adoption and use…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、犬のコインは数量的には第4位で、2つの「L」を除くすべてのコインよりも数量が多い。\n100位以内の2つの \"legit \"コインを除くすべてのコインよりも多い。他のアルトコインよりも多くの資本がこのミームに資金を投じています。\nこのミームに資金を投入している資本が、より優れた技術やイノベーションを持つ他のアルトコインよりも多く存在しています。\nこのミームに資金を投じる資本は、他のいくつかのアルトコインよりも多くあります。",
      "title": "前回、犬のコインshitcoinがトップ10に入ったとき、市場全体が崖から落ちました。History Doesn't Repeat Itself, but It Often Rhymes."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，狗币在体积上排名第四，比所有的\n除了前100名中的2个 \"合法 \"币之外。有更多的资本在交易，并将他们的资金投入到这个纪念品中，而不是在其他几个已经有的替代币中。\n比其他几个有更好的技术、创新或实际采用和使用的替代币都要多。\n更好的技术，或创新或实际采用和使用......",
      "title": "上一次狗币屎币进入前十名，整个市场跌落悬崖。历史不会重演，但往往是押韵的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，狗幣在體積上排名第四，比所有的\n除了前100名中的2個 \"合法 \"幣之外。有更多的資本在交易，並將他們的資金投入到這個紀念品中，而不是在其他幾個已經有的替代幣中。\n比其他幾個有更好的技術、創新或實際採用和使用的替代幣都要多。\n更好的技術，或創新或實際採用和使用......",
      "title": "上一次狗幣屎幣進入前十名，整個市場跌落懸崖。歷史不會重演，但往往是押韻的。"
    }
  ]
}