{
  "author": "Paulie_Gatto",
  "original_created_utc": 1624733508,
  "title": "George Washington Carver said he, his sister and his mother were \"Ku Klucked\" when he was very young. He says it was a band of outlaws who abducted them, and sold them in Arkansas - though he was found on the road, he never saw his other family again. How common were these acts in the Missouri area?",
  "created_utc": 1624756162,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And is the term &quot;Ku Klucked&quot; mean the outlaws were part of the first Klan? I should add he was born as the Civil War came to an end, so this would be in the post-war era - though details on his early story are said to be rather murky with a lack of records.</p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/AskHistorians/comments/o8gpfc/george_washington_carver_said_he_his_sister_and/",
  "subreddit": "AskHistorians",
  "id": "o8gpfc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And is the term \"Ku Klucked\" mean the outlaws were part of the first Klan? I\nshould add he was born as the Civil War came to an end, so this would be in the\npost-war era - though details on his early story are said to be rather murky\nwith a lack of records.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "また、「Ku Klucked」という言葉は、無法者たちが最初のクランに属していたということでしょうか？I\n彼が生まれたのは南北戦争が終結した頃だから、これは戦後の話になる。\n戦後ということになりますが、彼の生い立ちについては記録が残っていないために\nしかし、彼の初期の話については、記録がないので詳細は不明と言われている。",
      "title": "ジョージ・ワシントン・カーヴァーは、幼い頃、自分と妹と母親が「Ku Klucked」されたと言っている。誘拐したのは無法者の一団で、アーカンソーで売られていたという。道中で発見されたものの、他の家族とは二度と会うことはなかった。このような行為は、ミズーリ州ではどれほど一般的だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "而 \"Ku Klucked \"一词是否意味着这些亡命之徒是第一个三K党的一部分？I\n我应该补充说，他是在内战结束时出生的，所以这应该是在战后时代。\n尽管关于他早期故事的细节据说是相当模糊的\n缺乏记录。",
      "title": "乔治-华盛顿-卡弗说，他、他的妹妹和他的母亲在他很小的时候就被 \"库鲁克 \"了。他说是一伙亡命之徒绑架了他们，并把他们卖到了阿肯色州--虽然他在路上被发现，但他再也没有见过其他家人。这些行为在密苏里地区有多普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而 \"Ku Klucked \"一詞是否意味着這些亡命之徒是第一個三K黨的一部分？I\n我應該補充說，他是在內戰結束時出生的，所以這應該是在戰後時代。\n儘管關於他早期故事的細節據說是相當模糊的\n缺乏記錄。",
      "title": "喬治-華盛頓-卡弗說，他、他的妹妹和他的母親在他很小的時候就被 \"庫魯克 \"了。他說是一夥亡命之徒綁架了他們，並把他們賣到了阿肯色州--雖然他在路上被發現，但他再也沒有見過其他家人。這些行爲在密蘇里地區有多普遍？"
    }
  ]
}