{
  "author": "SpokenWorder",
  "original_created_utc": 1656081101,
  "title": "Can today's Roe v Wade ruling be reversed in the future?",
  "created_utc": 1656148805,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m Canadian and unclear how the Supreme Court works. So in the future, can the justices reverse today&amp;#39;s ruling on Roe V Wade, or is what was decided today irreversible? Obviously, new justices need to be installed to make sense for this reverse ruling to take place, so I&amp;#39;m thinking years down the line. Unless any of these justices have a change in the heart during their stint in the Supreme Court.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/Ask_Politics/comments/vjpt35/can_todays_roe_v_wade_ruling_be_reversed_in_the/",
  "subreddit": "Ask_Politics",
  "id": "vjpt35",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm Canadian and unclear how the Supreme Court works. So in the future, can the\njustices reverse today's ruling on Roe V Wade, or is what was decided today\nirreversible? Obviously, new justices need to be installed to make sense for\nthis reverse ruling to take place, so I'm thinking years down the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はカナダ人ですが、最高裁の仕組みが不明です。今後、最高裁は今日の判決を覆すことができるのでしょうか？\nそれとも今日決定されたことは\n不可逆的なのでしょうか？明らかに、新しい裁判官が就任しなければ、この逆転判決が行われる意味がありません。\nこの逆転判決が行われるためには、新しい判事が設置される必要があるのは明らかなので、私は何年も先のことを考えています...",
      "title": "今日のRoe v Wade判決を将来覆すことはできるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是加拿大人，不清楚最高法院如何运作。那么在未来，大法官们是否可以\n大法官能否推翻今天对罗伊-韦德案的裁决，还是说今天的裁决是\n判决是不可逆转的吗？很明显，新的大法官需要被安置，以使这种逆转的裁决发生。\n这种反向裁决的发生，所以我认为在几年后......",
      "title": "今天的 \"罗伊诉韦德 \"案的裁决在未来能否被推翻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是加拿大人，不清楚最高法院如何運作。那麼在未來，大法官們是否可以\n大法官能否推翻今天對羅伊-韋德案的裁決，還是說今天的裁決是\n判決是不可逆轉的嗎？很明顯，新的大法官需要被安置，以使這種逆轉的裁決發生。\n這種反向裁決的發生，所以我認爲在幾年後......",
      "title": "今天的 \"羅伊訴韋德 \"案的裁決在未來能否被推翻？"
    }
  ]
}