{
  "author": "coalpo",
  "original_created_utc": 1643451831,
  "title": "I dont get the whole, bitcoin is the future of money.",
  "created_utc": 1643470545,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You all guys keeps saying this, but in reality, nobody uses it. You always scold everyone for spending it and not keeping it. The only advice is hodl and get more. I can see the point of the technology but what is the point of buying more and hodlin but never using it and waiting for it to reach millions? Unless you start using it, its just a risky get rich making scheme, nothing else. And has nothing to do with decentralized finance and all the big words you like to use.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 371,
  "permalink": "/r/Bitcoin/comments/sffc3x/i_dont_get_the_whole_bitcoin_is_the_future_of/",
  "subreddit": "Bitcoin",
  "id": "sffc3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You all guys keeps saying this, but in reality, nobody uses it. You always scold\neveryone for spending it and not keeping it. The only advice is hodl and get\nmore. I can see the point of the technology but what is the point of buying more\nand hodlin but never using it and waiting for it to reach…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、そうおっしゃいますが、実際には誰も使っていないんですよ。いつも叱られる。\n使ってしまったり、持っていなかったり。唯一のアドバイスは、ホドルで\nもっと 技術的なことはわかりますが、もっと買ってどうするんですか？\nとホドホドにしながらも、使わず届くのを待つ...。",
      "title": "ビットコインは未来のお金だ、というのは理解できない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们这些人一直在说这个，但实际上，没有人使用它。你们总是责备\n每个人都花了钱却没有留住它。唯一的建议是，要多花钱，要\n更多。我可以看到技术的意义，但买更多的东西有什么意义呢？\n和买更多的东西，但从来没有使用它，并等待它达到......",
      "title": "我不明白整个，比特币是货币的未来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們這些人一直在說這個，但實際上，沒有人使用它。你們總是責備\n每個人都花了錢卻沒有留住它。唯一的建議是，要多花錢，要\n更多。我可以看到技術的意義，但買更多的東西有什麼意義呢？\n和買更多的東西，但從來沒有使用它，並等待它達到......",
      "title": "我不明白整個，比特幣是貨幣的未來。"
    }
  ]
}