{
  "author": "Recolance",
  "the_new_excerpt": "I've pulled the trigger, after thinking over it for a few weeks.\n\nI'm a software engineer who has spent the last 6 months developing payment\nprocessing services for Bitcoin and other crypto assets. I've had the pleasure\nof exploring and learning about how blockchain works, how transactions work,…",
  "original_created_utc": 1623903208,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数週間考えた末に、引き金を引きました。\n\n私はソフトウェアエンジニアで、この6ヶ月間、ビットコインやその他の暗号資産のための決済処理サービスを開発してきました。\nビットコインやその他の暗号資産の決済処理サービスを開発してきました。ブロックチェーンがどのように機能しているかを知り、学ぶことができました。\nブロックチェーンがどのように機能するか、トランザクションがどのように機能するか、などを探求し、学ぶことができました...",
      "title": "私は貯金2万円をすべてビットコインに投入しました。自分の貯金をフィアットではなくビットコインで保有するつもりで"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在考虑了几周之后，我已经扣下了扳机。\n\n我是一名软件工程师，在过去的6个月里，我一直在为比特币和其他加密资产开发支付\n为比特币和其他加密资产开发支付处理服务。我曾有幸\n探索和学习了区块链的工作原理，交易的工作原理，...",
      "title": "我把我的全部积蓄20,000美元投入比特币。目的是用比特币而不是法币来持有我的储蓄。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在考慮了幾周之後，我已經扣下了扳機。\n\n我是一名軟件工程師，在過去的6個月裏，我一直在爲比特幣和其他加密資產開發支付\n爲比特幣和其他加密資產開發支付處理服務。我曾有幸\n探索和學習了區塊鏈的工作原理，交易的工作原理，...",
      "title": "我把我的全部積蓄20,000美元投入比特幣。目的是用比特幣而不是法幣來持有我的儲蓄。"
    }
  ],
  "title": "I put my entire savings 20,000$ into Bitcoin. With the intent to hold my savings in Bitcoin instead of fiat.",
  "created_utc": 1623908642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve pulled the trigger, after thinking over it for a few weeks. </p>\n\n<p>I&#39;m a software engineer who has spent the last 6 months developing payment processing services for Bitcoin and other crypto assets. I&#39;ve had the pleasure of exploring and learning about how blockchain works, how transactions work, and its security at a deep level. Most importantly I&#39;ve learned about just how much utility Bitcoin has to offer.</p>\n\n<p>As I hear about more services, companies, and now countries are adopting Bitcoin, it&#39;s very clear that it&#39;s here to stay. But most importantly it&#39;s already started to begin reaching the &quot;soccer mom&quot; audience. People &quot;use&quot; Bitcoin, not just as an investment, or a get rich quick scheme. They use it to barter, pay bills, trade, and as a means of exchange for goods and services.</p>\n\n<p>I don&#39;t just see Bitcoin as a chart in an app. I don&#39;t see Bitcoin as something you buy with USD. I see Bitcoin as Bitcoin. It&#39;s a currency in its own right, with value dictinct from USD and others. And given a decade, or two. I see it as the global currency for the future of all transactions.</p>\n\n<p>Thanks for hearing my points.</p>\n</div><!-- SC_ON -->",
  "score": 3733,
  "permalink": "/r/Bitcoin/comments/o1o61e/i_put_my_entire_savings_20000_into_bitcoin_with/",
  "subreddit": "Bitcoin",
  "id": "o1o61e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009736005
}