{
  "author": "ImaFreemason",
  "original_created_utc": 1640446756,
  "title": "Who received crypto for Christmas?",
  "created_utc": 1640518301,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Merry Christmas and Happy Holidays to everyone.  I hope all are having a wonderful day with their family and/or friends and are ready to fill up on some delicious food. Hopefully everyone received something that you weren&amp;#39;t expecting, that made you happy as hell!   &lt;/p&gt;\n\n&lt;p&gt;I got my brother $100 worth of Bitcoin to start him out. He was excited as hell, so that made my day. He decided to make an account last night when I told him to, and bought $200 more (I actually got it and sent it to him because his account wasn&amp;#39;t verified yet). I&amp;#39;m excited to see him on his journey! \nHas anyone  else bought crypto for family members or friends,  and if so, what was their reaction?\nWhich one gift made your day? I&amp;#39;d love to know. Mine was Jordan V golf shoes. \nOnce again,  everyone have a great day and hopefully see you on the moon next year!\nMerry Christmas to all and keep on hodling.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/robv2k/who_received_crypto_for_christmas/",
  "subreddit": "CryptoCurrency",
  "id": "robv2k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Merry Christmas and Happy Holidays to everyone. I hope all are having a\nwonderful day with their family and/or friends and are ready to fill up on some\ndelicious food. Hopefully everyone received something that you weren't\nexpecting, that made you happy as hell!\n\nI got my brother $100 worth of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メリークリスマス、そしてハッピーホリデーを皆さんへ。皆様が楽しい時間を過ごされることを願っております。\n家族や友人と素敵な一日を過ごし、お腹を満たす準備はできています。\n美味しいものを食べてください。皆さん、何か思いがけないものを受け取られたでしょうか？\nということです。\n\n私は弟に100ドル相当のものをプレゼントしました...",
      "title": "クリスマスに暗号を受け取った人は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝大家圣诞快乐，假期愉快。我希望所有人都有一个\n和他们的家人和/或朋友度过美好的一天，并准备好填饱一些\n美味的食物。希望每个人都能收到一些你意想不到的东西\n的东西，让你高兴得不得了。\n\n我给我弟弟买了价值100美元的...",
      "title": "谁在圣诞节收到了加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝大家聖誕快樂，假期愉快。我希望所有人都有一個\n和他們的家人和/或朋友度過美好的一天，並準備好填飽一些\n美味的食物。希望每個人都能收到一些你意想不到的東西\n的東西，讓你高興得不得了。\n\n我給我弟弟買了價值100美元的...",
      "title": "誰在聖誕節收到了加密貨幣？"
    }
  ]
}