{
  "author": "Figfogey",
  "the_new_excerpt": "I bought Bitcoin when I was 16 on Coinbase, and almost immediately after they\nchanged their policy so you had to be 18 to use the exchange. They locked my\naccount, so I was forced to hold. I'm sure they would have let me withdraw my\nfunds if I contacted them but I figured I would just come back when…",
  "original_created_utc": 1623785143,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は16歳のときにCoinbaseでビットコインを購入しましたが、その直後にCoinbaseがポリシーを変更し、電子マネーの使用を18歳までとしました。\n18歳にならないと取引ができないように変更されました。アカウントがロックされてしまいました。\nアカウントがロックされてしまったので、仕方なくホールドしていました。連絡すれば引き出してもらえたと思いますが\n連絡すれば引き出してくれると思いますが、また戻ってくればいいやと思って......。",
      "title": "コインベースは16歳の時に無理やり握らされた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我16岁时在Coinbase上购买了比特币，几乎是在他们改变了政策之后\n他们立即改变了政策，所以你必须年满18岁才能使用该交易所。他们锁定了我的\n帐户，所以我被迫持有。我确信他们会让我提取我的\n如果我联系他们，他们肯定会让我提取我的资金，但我想我只是想回来，当...",
      "title": "Coinbase在我16岁时强迫我持有"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我16歲時在Coinbase上購買了比特幣，幾乎是在他們改變了政策之後\n他們立即改變了政策，所以你必須年滿18歲才能使用該交易所。他們鎖定了我的\n帳戶，所以我被迫持有。我確信他們會讓我提取我的\n如果我聯繫他們，他們肯定會讓我提取我的資金，但我想我只是想回來，當...",
      "title": "Coinbase在我16歲時強迫我持有"
    }
  ],
  "title": "Coinbase forced me to hold when I was 16",
  "created_utc": 1623792891,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I bought Bitcoin when I was 16 on Coinbase, and almost immediately after they changed their policy so you had to be 18 to use the exchange. They locked my account, so I was forced to hold. I&#39;m sure they would have let me withdraw my funds if I contacted them but I figured I would just come back when I&#39;m 18. Well I forgot about it until I noticed the bull run in february, I logged on and damn... 1,000 percent gains on my 20 dollars. Best investment of my life. Since then I emailed them, they unlocked my account, and I&#39;ve been DCAing weekly.</p>\n</div><!-- SC_ON -->",
  "score": 9878,
  "permalink": "/r/CryptoCurrency/comments/o0mezb/coinbase_forced_me_to_hold_when_i_was_16/",
  "subreddit": "CryptoCurrency",
  "id": "o0mezb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009739998
}