{
  "author": "Sav707",
  "original_created_utc": 1635910586,
  "title": "Anyone else out there who has zero plans to sell?",
  "created_utc": 1635932524,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been lurking in reddit-land for years, but have never posted anything; figured I&#39;d start here since Blockchain tech has been my main interest for many years.</p>\n\n<p>Anyways, most of the posts i see talk about selling into fiat and getting new cars, houses etc... i personally see a shift on the horizon where crypto currencies ARE the currency and i have, from day one, never planned to sell into fiat. (Not saying there is something wrong with that, because there isn&#39;t. Especially if it gets you more crypto. Situations vary.)</p>\n\n<p>Aside from a massive mistake i made in 2011/12, i have been hanging on. I do want to have a seperate porfolio for day trading soon. But this is to slurp up more crypto, not fiat.</p>\n\n<p>Anyone else out there on board with this mindset? Genuinely curious how many people out here are floating the same raft as me.</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/qlluyb/anyone_else_out_there_who_has_zero_plans_to_sell/",
  "subreddit": "CryptoCurrency",
  "id": "qlluyb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been lurking in reddit-land for years, but have never posted anything;\nfigured I'd start here since Blockchain tech has been my main interest for many\nyears.\n\nAnyways, most of the posts i see talk about selling into fiat and getting new\ncars, houses etc... i personally see a shift on the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は何年もreddit-landに潜んでいましたが、何も投稿したことがありませんでした。\nブロックチェーン技術は私が長年興味を持っている分野なので、ここから始めようと思いました。\nここから始めようと思いました。\n\nとにかく、私が目にするほとんどの投稿は、フィアットに売却して新しい車や家などを手に入れることについてです。\n私は個人的には、このような変化が...",
      "title": "売る予定がゼロの人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在reddit-land潜伏了多年，但从未发过任何帖子。\n我想我应该从这里开始，因为区块链技术是我多年来的主要兴趣。\n年来的主要兴趣。\n\n总之，我看到的大多数帖子都在谈论卖掉法币并获得新的\n我个人认为，在区块链技术方面有一个转变。",
      "title": "还有谁是零计划出售的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在reddit-land潛伏了多年，但從未發過任何帖子。\n我想我應該從這裏開始，因爲區塊鏈技術是我多年來的主要興趣。\n年來的主要興趣。\n\n總之，我看到的大多數帖子都在談論賣掉法幣並獲得新的\n我個人認爲，在區塊鏈技術方面有一個轉變。",
      "title": "還有誰是零計劃出售的嗎？"
    }
  ]
}