{
  "author": "Awkward-wood",
  "original_created_utc": 1659504020,
  "title": "did I just get permission to have an affair or girlfriend?",
  "created_utc": 1659534598,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A bit of backstory. (37m &amp;amp; 37f) Married five years this year. Had two kids And since they were born it has been uncomfortable for her to be intimate. Because of that we have only been intimate a handful of times in the 3 and 1/2 years since she got pregnant. She knows that intimacy is important for me as it is my love language (physical touch) (hers is acts of service) Tonight we were having an argument as she was expounding on how painful it was for her and somehow came out with &amp;quot;just go find it somewhere else&amp;quot; I asked her &amp;quot;Are you telling me to go f*** somebody else?&amp;quot; She said yes since that&amp;#39;s what you need....&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;  I had to pick up my jaw off the floor, I was so very shocked. All I want is for her to touch me hold my hand shoulder etc. All she wants is help her on the house My problem is things don&amp;#39;t exist for me unless they are pointed out or it becomes a routine for me. ADD or ADHD (I&amp;#39;m not diagnosed but the signs are there) whatever it is causes me to not think about it for weeks at a time. I only do my laundry because I&amp;#39;ve run out of shirts or pants. \n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Married folks out there wtf am I supposed to do? ADHD ADD etc folks out there how do I cope with this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/wexuqx/did_i_just_get_permission_to_have_an_affair_or/",
  "subreddit": "TooAfraidToAsk",
  "id": "wexuqx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "A bit of backstory. (37m & 37f) Married five years this year. Had two kids And\nsince they were born it has been uncomfortable for her to be intimate. Because\nof that we have only been intimate a handful of times in the 3 and 1/2 years\nsince she got pregnant. She knows that intimacy is important for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょっと裏話を。(37m＆37f)結婚して今年で5年目。子供が2人生まれました。\n子供が生まれてから、親密な関係になるのが嫌になった。そのため\nそのため、妊娠してから3年半の間に親密になったのはほんの数回です。\n彼女が妊娠して以来。彼女は親密さが重要であることを知っている...",
      "title": "は、不倫や恋人の許可を得ただけなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一点背景故事。(37岁和37岁）今年结婚5年了。有两个孩子\n自从他们出生后，对她来说，亲热是不舒服的。因为\n因此，在她怀孕后的三年半时间里，我们只亲密接触过少数几次。\n自从她怀孕以来。她知道亲密关系对她来说是很重要的。",
      "title": "我是否刚刚得到允许有外遇或女朋友？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一點背景故事。(37歲和37歲）今年結婚5年了。有兩個孩子\n自從他們出生後，對她來說，親熱是不舒服的。因爲\n因此，在她懷孕後的三年半時間裏，我們只親密接觸過少數幾次。\n自從她懷孕以來。她知道親密關係對她來說是很重要的。",
      "title": "我是否剛剛得到允許有外遇或女朋友？"
    }
  ]
}