{
  "author": "ImSomebodyNow",
  "original_created_utc": 1653482487,
  "title": "When it became clear that Bismarck and Scharnhorst couldn't escape, why didn't the Germans surrender and scuttle the ships?",
  "created_utc": 1653510255,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Both ships found themselves in situations where they couldn&amp;#39;t outmaneuver, outrun, or fight off their pursuers, yet they both seemed to fight until they went under, with terrible loss of life.&lt;/p&gt;\n\n&lt;p&gt;Wouldn&amp;#39;t the British have allowed them to surrender, and possibly save the crew?  Why wouldn&amp;#39;t that have been a preferable outcome for their commanders?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/uxghz4/when_it_became_clear_that_bismarck_and/",
  "subreddit": "AskHistorians",
  "id": "uxghz4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Both ships found themselves in situations where they couldn't outmaneuver,\noutrun, or fight off their pursuers, yet they both seemed to fight until they\nwent under, with terrible loss of life.\n\nWouldn't the British have allowed them to surrender, and possibly save the crew?\nWhy wouldn't that have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "両艦とも出し抜けない状況に陥った。\nしかし、両船とも、沈むまで戦い続けました。\nしかし、両者とも、命が失われるまで戦い続けたようです。\n\nイギリスは降伏を認め、乗組員を救うことはできなかったのでしょうか？\nなぜそうしなかったのか...",
      "title": "ビスマルクとシャルンホルストが逃げられないとわかったとき、なぜドイツ軍は降伏して船を廃棄しなかったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "两艘船都发现自己处于无法超越的境地。\n在这种情况下，两艘船都无法摆脱追捕者，但它们似乎都在战斗，直到它们沉入海底。\n但它们似乎都在战斗，直到它们沉入海底，造成了可怕的生命损失。\n\n难道英国人不会允许他们投降，并可能拯救船员吗？\n为什么不可以...",
      "title": "当俾斯麦和沙恩霍斯特显然无法逃脱时，德国人为什么不投降并将船只炸毁？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "兩艘船都發現自己處於無法超越的境地。\n在這種情況下，兩艘船都無法擺脫追捕者，但它們似乎都在戰鬥，直到它們沉入海底。\n但它們似乎都在戰鬥，直到它們沉入海底，造成了可怕的生命損失。\n\n難道英國人不會允許他們投降，並可能拯救船員嗎？\n爲什麼不可以...",
      "title": "當俾斯麥和沙恩霍斯特顯然無法逃脫時，德國人爲什麼不投降並將船隻炸燬？"
    }
  ]
}