{
  "author": "MugwumpJuice",
  "original_created_utc": 1650321703,
  "title": "Do people actually check their toilet paper after wiping?",
  "created_utc": 1650333669,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was just randomly discussing this with my family during the holiday visit. Apparently it&amp;#39;s very odd to not look at your toilet paper after taking a dump, it&amp;#39;s just never occurred to me to do that. Honestly the idea of it grosses me out, why would I want to bring a ball of shit paper up close enough to me so I can take a look? I just wipe once and that&amp;#39;s that. Never had issues with skid marks or anything unless I actually shit myself which only happens every few months tops.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 206,
  "permalink": "/r/NoStupidQuestions/comments/u6po22/do_people_actually_check_their_toilet_paper_after/",
  "subreddit": "NoStupidQuestions",
  "id": "u6po22",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was just randomly discussing this with my family during the holiday visit.\nApparently it's very odd to not look at your toilet paper after taking a dump,\nit's just never occurred to me to do that. Honestly the idea of it grosses me\nout, why would I want to bring a ball of shit paper up close…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "休日の面会で家族と適当に話していたのですが\nどうやら、ウンコをした後にトイレットペーパーを見ないのはとても奇妙なことらしい。\nというのは、今まで思いつきませんでした。正直なところ、その発想が気持ち悪いです。\nなぜ、糞のついた紙を近くに持ってくるのか...。",
      "title": "実際、みんなは拭いた後のトイレットペーパーをチェックしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是在假期访问期间随机与家人讨论了这个问题。\n显然，拉完屎后不看卫生纸是非常奇怪的。\n只是我从来没有想过要这么做。说实话，这个想法让我感到恶心。\n我为什么要把一团屎纸带到近处......",
      "title": "人们在擦拭后真的会检查他们的卫生纸吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是在假期訪問期間隨機與家人討論了這個問題。\n顯然，拉完屎後不看衛生紙是非常奇怪的。\n只是我從來沒有想過要這麼做。說實話，這個想法讓我感到噁心。\n我爲什麼要把一團屎紙帶到近處......",
      "title": "人們在擦拭後真的會檢查他們的衛生紙嗎？"
    }
  ]
}