{
  "author": "Hsiang7",
  "original_created_utc": 1638579118,
  "title": "What happened to the $100k BTC by the end of the year prediction everyone was saying?",
  "created_utc": 1638586037,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few months ago it seemed like everyone influential in crypto was predicting $100k BTC by the end of the year. However, it doesn&amp;#39;t look like that&amp;#39;s going to happen with the state of the market at the moment. It would take something absolutely miraculous to essentially double BTC&amp;#39;s market cap by the end of the year. This confirms three things to me:&lt;/p&gt;\n\n&lt;p&gt;1.) It seems like many crypto investors, especially the influential onces are still way too optimistic and everything they say should be taken with a grain of salt. &lt;/p&gt;\n\n&lt;p&gt;2.) The &amp;quot;so called&amp;quot; experts that keep being asked for predictions have no idea what they&amp;#39;re talking about, just pulling random predictions out of their behind.&lt;/p&gt;\n\n&lt;p&gt;3.) Technical analysis in crypto can only tell you so much. Essentially, everybody (including the &amp;quot;experts&amp;quot;) knows shit about fuck, and you&amp;#39;re much better doing your own research than investing based on what these bozos say. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR:&lt;/strong&gt; DYOR&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 661,
  "permalink": "/r/CryptoCurrency/comments/r8djp9/what_happened_to_the_100k_btc_by_the_end_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "r8djp9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A few months ago it seemed like everyone influential in crypto was predicting\n$100k BTC by the end of the year. However, it doesn't look like that's going to\nhappen with the state of the market at the moment. It would take something\nabsolutely miraculous to essentially double BTC's market cap by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前、暗号に影響力のある人は皆、次のように予測していたように思います。\n年末までに10万ドルBTC。しかし、それはなさそうです。\n今の市場の状態だとそうなる。何か\nBTCの時価総額が2倍になるのは、奇跡的なことなのです。",
      "title": "みんなが言っていた年末までに100k BTCという予想はどうなったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，似乎每个对加密货币有影响力的人都在预测\n10万美元的BTC，到今年年底。然而，从目前的市场状况来看，这似乎并不可能发生。\n从目前的市场状况来看，这似乎不会发生。这将需要一些\n绝对的奇迹才能使BTC的市值翻倍。",
      "title": "大家说的年底前10万美元BTC的预测是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，似乎每個對加密貨幣有影響力的人都在預測\n10萬美元的BTC，到今年年底。然而，從目前的市場狀況來看，這似乎並不可能發生。\n從目前的市場狀況來看，這似乎不會發生。這將需要一些\n絕對的奇蹟才能使BTC的市值翻倍。",
      "title": "大家說的年底前10萬美元BTC的預測是怎麼回事？"
    }
  ]
}