{
  "author": "fantastiqos",
  "the_new_excerpt": "The more I read into Blackberry the more I'm starting to believe Blackberry is\nactually a great investment for the longer term and it looks to me like they're\n(still) quite undervalued (maybe even really undervalued) and have a great\nfuture ahead at this point.\n\nI also noticed they have never been…",
  "original_created_utc": 1611094019,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我越是读到黑莓，越是开始相信黑莓是。\n实际上，从长远来看，这是一项伟大的投资，而且在我看来，他们是。\n(仍然)相当被低估(甚至可能真的被低估)，并且有很大的\n未来的未来在这一点上。\n\n我还注意到他们从来没有... ...",
      "title": "黑莓巴恩斯B到底有没有被低估？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我越是讀到黑莓，越是開始相信黑莓是。\n實際上，從長遠來看，這是一項偉大的投資，而且在我看來，他們是。\n(仍然)相當被低估(甚至可能真的被低估)，並且有很大的\n未來的未來在這一點上。\n\n我還注意到他們從來沒有... ...",
      "title": "黑莓巴恩斯B到底有沒有被低估？"
    }
  ],
  "title": "Is Blackberry $BB actually undervalued?",
  "created_utc": 1611101068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The more I read into Blackberry the more I&#39;m starting to believe Blackberry is actually a great investment for the longer term and it looks to me like they&#39;re (still) quite undervalued (maybe even really undervalued) and have a great future ahead at this point. </p>\n\n<p>I also noticed they have never been mentioned in any of the countless &quot;EV threads&quot; while they&#39;re actually quite heavily involved in EV?</p>\n\n<p>Might their reputation of &quot;failed phone company&quot; be a reason for them barely getting any attention? (Until the last couple of days of course).\nAll people I started talking to about investing $BB started laughing immediately, even people who have been into stocks for quite a time.</p>\n\n<p>I&#39;m really interested in your opinions about this company!</p>\n</div><!-- SC_ON -->",
  "score": 368,
  "permalink": "/r/stocks/comments/l0ujm0/is_blackberry_bb_actually_undervalued/",
  "subreddit": "stocks",
  "id": "l0ujm0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311219653
}