{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "**First, shorting the market**\n\nWant to \"short\" the stock market when you think it will keep falling? There are a few trading platforms where you can short stocks or short the S&amp;P 500 - ProShares ETF ($SH ) is an option, a simple and liquid tool that allows retail investors to see their stocks as the stock market declines. Invest in growth and profit. The roughly $2 billion ETF has moved in the opposite direction of the S&amp;P 500's daily moves.\n\nIn the long run, it's not exactly a 1:1 inverse relationship with the S&amp;P 500, but it's very close. For example, the ETF has gained 7.2% over the past month; the S&amp;P 500 has fallen 7.4% over the same period through Thursday's close.\n\nThere are other types of \"inverse\" funds that can short the market as well. For example, if an investor wants a more tech-focused fund to bet on the decline of this particular sector, consider the Tuttle Capital Short Innovation ETF ($SARK).\n\nThe roughly $350 million ETF has performed in stark contrast to ark Innovations ETF ($ARKK). ARKK was once all the rage and is now in trouble, and the \"inverse\" fund has gained 27.7% in the past month.\n\nAs a reminder, when the stock market goes up, these inverse funds go down.\n\n**Second, tail risk \"insurance\"**\n\nThe Cambria Tail Risk ETF ($TAIL) is more of an insurance policy, a unique investment vehicle focused on buying \"out of the money (or out of the money)\" puts on the U.S. stock market while heavily under-allocated Risky U.S. Treasuries.\n\nWhen the market is stable, these long-term options don't cost much, but they are an insurance tool that investors pay to protect against \"catastrophes.\" Just like car insurance, when a crash occurs, people are compensated to cover the loss. When the Dow fell more than 1,000 points on Thursday, the ETF gained 2.2%.\n\nOver the past year, though, the ETF has lost more than 11%, far outpacing the S&amp;P 500's 4% drop over the same period; that's the price you pay when this \"insurance\" isn't needed— But in turbulent times like the current one, that protection can come in handy.\n\n**Third, the covered call option strategy**\n\nMany investors use options to reduce risk or achieve higher returns, but if investors aren't interested in doing options trading themselves, a fund like the JPMorgan Equity Premium Income ETF ($JEPI ) might be worth a look. The $9 billion ETF invests in the S&amp;P 500, but its managers also sell options on large-cap U.S. stocks using a strategy known as a \"covered call.\"\n\nSimply put, selling these options contracts limits your upside if the market is skyrocketing, but guarantees cash flow if the market moves sideways or falls. With that in mind, the ETF has yielded about 8.0% over the past 12 months -- and while it's down 5.5% over the past month, it's not as bad as the S&amp;P 500 (down 7.5%) over the same period .\n\nIf investors prefer to deploy this strategy on a tech-intensive benchmark, the Nasdaq 100 Covered Call ETF ($QYLD ) might be worth a look. The ETF is about $7 billion in size and is tied to the Nasdaq 100 index.\n\n**Fourth, low volatility ETFs**\n\nUnlike traditional investment strategies, low-volatility funds exclude the fastest-moving stock picks. This naturally means that they may underperform when markets are booming, but they tend to be \"not so bad\" when markets are turbulent.\n\nTake the $9 billion-plus S&amp;P 500 Low Volatility ETF ($SPLV), which has underperformed for three or five years as volatility has been rising due to a generally benign stock market environment. In 2022, it's down 5.2%, but that's well below the S&amp;P 500's 13% drop over the same period.\n\nOther \"low volatility\" funds worth checking out: the global-focused iShares Minimal Volatility ETF ($EFAV), which invests in low-volatility stocks in Europe, Oceania, and the Far East.\n\n**Fifth, (nearly) immediate maturity bonds**\n\nThe interest rate environment is unstable. But by shortening the bond's maturity to almost immediate maturity, you can get a little bit of a gain and largely avoid the risk of rising interest rates.\n\nThe popular iShares 20+ Year Treasury Bond ETF ($TLT ) is down more than 22% in 2022 on rising interest rates, but its sister fund, the iShares 1-3 Year Treasury Bond ETF SHY, is down just 3.1% -- yielding around 2%, helping to offset the decline.\n\nIf investors want to shift their sights from solid U.S. Treasuries to short-term corporate bonds, the Pimco Enhanced Short-Maturity Active ETF ($MINT ) is worth a look, which is down just 1.85% this year and has a similar annual return; Saying this is \"walking in place\".\n\nAs a reminder, neither of these short-term bond funds will significantly increase people's wealth, but these types of funds are worth a look if you want to earn a little income while preserving your principal.\n\n**Sixth,interest rate hedged bonds**\n\nAnother way to enter the fixed income market is to opt for bonds but add a strategy designed to offset the headwinds of rising interest rates. Such funds might look at the roughly $379 million WisdomTree Interest Rate Hedged U.S. Aggregate Bond Fund ($AGZD ), which attempts to achieve this by holding investment-grade corporate bonds and U.S. Treasuries — but also has a short position against U.S. Treasuries. The fund is provided income from corporate bonds, while short positions offset potential declines in the value of principal.\n\nAs counterintuitive as it may sound, in theory, short positions are offset by these long positions to offset potential declines in the value of principal. Theoretically it means that not all will work, but so far this approach seems to be working. The fund is down 1.45% in 2022 while the rest of the bond market has been in turmoil -- giving shareholders about 2% at current annualized yields.\n\n**Seventh, face the strategy of raising interest rates**\n\nWhat if investors were less inclined to hedge with current interest rate volatility? Then consider paying attention to the Simplify Interest Rate Hedging ETF ($PFIX ), which is about $200 million in size.\n\nThe fund holds a large position in over-the-counter rate options whose value will rise as long-term interest rates rise. Given the Fed's recent moves, this strategy has paid off considerably.\n\nThe ETF surged 5.4% on Thursday as Wall Street digested the Fed's move and other developments. Year-to-date, the ETF is up 63% as bond yields rise steadily.\n\n**Eighth, commodities**\n\nWhile stocks and bonds play an important role in diversifying a portfolio (regardless of the broader economic situation), it is increasingly important to acknowledge that they are not the only two types of assets.\n\nOne of the easiest ways to get diversified, easy access to commodities investing through exchange-traded products is the Commodity Optimized Income Fund ($PDBC). The $9 billion fund is made up of some of the world's most popular commodity-related futures contracts, including aluminum, crude oil, corn, gold, wheat and more. Best of all, it's structured in a way that protects investors from annoying paperwork and the dreaded K-1 tax form that comes with some commodity-related investment strategies.\n\nOf course, if you want a special style, there are also dedicated commodity funds to consider — like the $68 billion gold ETF-SPDR (GLD), or the red-hot U.S. Natural Gas Fund ($UNG) — which this year Soaring 140% year to date.\n\nDiversified funds like PDBC are a better option if investors want to play more defensively than trading based on a single commodity.\n\n**Ninth, Standard Index Fund**\n\nAre these choices confusing to you? Keep in mind then - over the long term, stocks are up; at least during the Great Recession, stocks' 10-year rolling returns have been positive...so the real cure for a losing portfolio might just be be patient.\n\nThe bear market low of the S&amp;P 500 at the time of the financial crisis was 666 on March 6, 2009, and the benchmark stock index is now above 4,000. Even though investors had the worst of times before the crisis, putting all their investments into pre-Lehman highs; investors still made money by comparison considering the index's 2007 closing peak of 1,565 of.\n\nWith this in mind, investors may consider long-term purchases like S&amp;P 500 ETFs ($SPY ) or other index funds, as well as the other tactical options mentioned above.\n\n**Do you have any better suggestions?**",
  "author_fullname": "t2_g9dxttcs",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "How to protect the purse during the stock market crash?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "discussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_ujnnck",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Industry Discussion",
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1651844195,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;First, shorting the market&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Want to &amp;quot;short&amp;quot; the stock market when you think it will keep falling? There are a few trading platforms where you can short stocks or short the S&amp;amp;P 500 - ProShares ETF ($SH ) is an option, a simple and liquid tool that allows retail investors to see their stocks as the stock market declines. Invest in growth and profit. The roughly $2 billion ETF has moved in the opposite direction of the S&amp;amp;P 500&amp;#39;s daily moves.&lt;/p&gt;\n\n&lt;p&gt;In the long run, it&amp;#39;s not exactly a 1:1 inverse relationship with the S&amp;amp;P 500, but it&amp;#39;s very close. For example, the ETF has gained 7.2% over the past month; the S&amp;amp;P 500 has fallen 7.4% over the same period through Thursday&amp;#39;s close.&lt;/p&gt;\n\n&lt;p&gt;There are other types of &amp;quot;inverse&amp;quot; funds that can short the market as well. For example, if an investor wants a more tech-focused fund to bet on the decline of this particular sector, consider the Tuttle Capital Short Innovation ETF ($SARK).&lt;/p&gt;\n\n&lt;p&gt;The roughly $350 million ETF has performed in stark contrast to ark Innovations ETF ($ARKK). ARKK was once all the rage and is now in trouble, and the &amp;quot;inverse&amp;quot; fund has gained 27.7% in the past month.&lt;/p&gt;\n\n&lt;p&gt;As a reminder, when the stock market goes up, these inverse funds go down.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Second, tail risk &amp;quot;insurance&amp;quot;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The Cambria Tail Risk ETF ($TAIL) is more of an insurance policy, a unique investment vehicle focused on buying &amp;quot;out of the money (or out of the money)&amp;quot; puts on the U.S. stock market while heavily under-allocated Risky U.S. Treasuries.&lt;/p&gt;\n\n&lt;p&gt;When the market is stable, these long-term options don&amp;#39;t cost much, but they are an insurance tool that investors pay to protect against &amp;quot;catastrophes.&amp;quot; Just like car insurance, when a crash occurs, people are compensated to cover the loss. When the Dow fell more than 1,000 points on Thursday, the ETF gained 2.2%.&lt;/p&gt;\n\n&lt;p&gt;Over the past year, though, the ETF has lost more than 11%, far outpacing the S&amp;amp;P 500&amp;#39;s 4% drop over the same period; that&amp;#39;s the price you pay when this &amp;quot;insurance&amp;quot; isn&amp;#39;t needed— But in turbulent times like the current one, that protection can come in handy.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Third, the covered call option strategy&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Many investors use options to reduce risk or achieve higher returns, but if investors aren&amp;#39;t interested in doing options trading themselves, a fund like the JPMorgan Equity Premium Income ETF ($JEPI ) might be worth a look. The $9 billion ETF invests in the S&amp;amp;P 500, but its managers also sell options on large-cap U.S. stocks using a strategy known as a &amp;quot;covered call.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Simply put, selling these options contracts limits your upside if the market is skyrocketing, but guarantees cash flow if the market moves sideways or falls. With that in mind, the ETF has yielded about 8.0% over the past 12 months -- and while it&amp;#39;s down 5.5% over the past month, it&amp;#39;s not as bad as the S&amp;amp;P 500 (down 7.5%) over the same period .&lt;/p&gt;\n\n&lt;p&gt;If investors prefer to deploy this strategy on a tech-intensive benchmark, the Nasdaq 100 Covered Call ETF ($QYLD ) might be worth a look. The ETF is about $7 billion in size and is tied to the Nasdaq 100 index.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Fourth, low volatility ETFs&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Unlike traditional investment strategies, low-volatility funds exclude the fastest-moving stock picks. This naturally means that they may underperform when markets are booming, but they tend to be &amp;quot;not so bad&amp;quot; when markets are turbulent.&lt;/p&gt;\n\n&lt;p&gt;Take the $9 billion-plus S&amp;amp;P 500 Low Volatility ETF ($SPLV), which has underperformed for three or five years as volatility has been rising due to a generally benign stock market environment. In 2022, it&amp;#39;s down 5.2%, but that&amp;#39;s well below the S&amp;amp;P 500&amp;#39;s 13% drop over the same period.&lt;/p&gt;\n\n&lt;p&gt;Other &amp;quot;low volatility&amp;quot; funds worth checking out: the global-focused iShares Minimal Volatility ETF ($EFAV), which invests in low-volatility stocks in Europe, Oceania, and the Far East.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Fifth, (nearly) immediate maturity bonds&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The interest rate environment is unstable. But by shortening the bond&amp;#39;s maturity to almost immediate maturity, you can get a little bit of a gain and largely avoid the risk of rising interest rates.&lt;/p&gt;\n\n&lt;p&gt;The popular iShares 20+ Year Treasury Bond ETF ($TLT ) is down more than 22% in 2022 on rising interest rates, but its sister fund, the iShares 1-3 Year Treasury Bond ETF SHY, is down just 3.1% -- yielding around 2%, helping to offset the decline.&lt;/p&gt;\n\n&lt;p&gt;If investors want to shift their sights from solid U.S. Treasuries to short-term corporate bonds, the Pimco Enhanced Short-Maturity Active ETF ($MINT ) is worth a look, which is down just 1.85% this year and has a similar annual return; Saying this is &amp;quot;walking in place&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;As a reminder, neither of these short-term bond funds will significantly increase people&amp;#39;s wealth, but these types of funds are worth a look if you want to earn a little income while preserving your principal.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sixth,interest rate hedged bonds&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Another way to enter the fixed income market is to opt for bonds but add a strategy designed to offset the headwinds of rising interest rates. Such funds might look at the roughly $379 million WisdomTree Interest Rate Hedged U.S. Aggregate Bond Fund ($AGZD ), which attempts to achieve this by holding investment-grade corporate bonds and U.S. Treasuries — but also has a short position against U.S. Treasuries. The fund is provided income from corporate bonds, while short positions offset potential declines in the value of principal.&lt;/p&gt;\n\n&lt;p&gt;As counterintuitive as it may sound, in theory, short positions are offset by these long positions to offset potential declines in the value of principal. Theoretically it means that not all will work, but so far this approach seems to be working. The fund is down 1.45% in 2022 while the rest of the bond market has been in turmoil -- giving shareholders about 2% at current annualized yields.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Seventh, face the strategy of raising interest rates&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;What if investors were less inclined to hedge with current interest rate volatility? Then consider paying attention to the Simplify Interest Rate Hedging ETF ($PFIX ), which is about $200 million in size.&lt;/p&gt;\n\n&lt;p&gt;The fund holds a large position in over-the-counter rate options whose value will rise as long-term interest rates rise. Given the Fed&amp;#39;s recent moves, this strategy has paid off considerably.&lt;/p&gt;\n\n&lt;p&gt;The ETF surged 5.4% on Thursday as Wall Street digested the Fed&amp;#39;s move and other developments. Year-to-date, the ETF is up 63% as bond yields rise steadily.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Eighth, commodities&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;While stocks and bonds play an important role in diversifying a portfolio (regardless of the broader economic situation), it is increasingly important to acknowledge that they are not the only two types of assets.&lt;/p&gt;\n\n&lt;p&gt;One of the easiest ways to get diversified, easy access to commodities investing through exchange-traded products is the Commodity Optimized Income Fund ($PDBC). The $9 billion fund is made up of some of the world&amp;#39;s most popular commodity-related futures contracts, including aluminum, crude oil, corn, gold, wheat and more. Best of all, it&amp;#39;s structured in a way that protects investors from annoying paperwork and the dreaded K-1 tax form that comes with some commodity-related investment strategies.&lt;/p&gt;\n\n&lt;p&gt;Of course, if you want a special style, there are also dedicated commodity funds to consider — like the $68 billion gold ETF-SPDR (GLD), or the red-hot U.S. Natural Gas Fund ($UNG) — which this year Soaring 140% year to date.&lt;/p&gt;\n\n&lt;p&gt;Diversified funds like PDBC are a better option if investors want to play more defensively than trading based on a single commodity.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Ninth, Standard Index Fund&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Are these choices confusing to you? Keep in mind then - over the long term, stocks are up; at least during the Great Recession, stocks&amp;#39; 10-year rolling returns have been positive...so the real cure for a losing portfolio might just be be patient.&lt;/p&gt;\n\n&lt;p&gt;The bear market low of the S&amp;amp;P 500 at the time of the financial crisis was 666 on March 6, 2009, and the benchmark stock index is now above 4,000. Even though investors had the worst of times before the crisis, putting all their investments into pre-Lehman highs; investors still made money by comparison considering the index&amp;#39;s 2007 closing peak of 1,565 of.&lt;/p&gt;\n\n&lt;p&gt;With this in mind, investors may consider long-term purchases like S&amp;amp;P 500 ETFs ($SPY ) or other index funds, as well as the other tactical options mentioned above.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Do you have any better suggestions?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#4f8ef7",
  "id": "ujnnck",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Celinasoso",
  "discussion_type": null,
  "num_comments": 13,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/ujnnck/how_to_protect_the_purse_during_the_stock_market/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/ujnnck/how_to_protect_the_purse_during_the_stock_market/",
  "subreddit_subscribers": 3995266,
  "created_utc": 1651858448,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1651844195,
  "the_new_excerpt": "First, shorting the market\n\nWant to \"short\" the stock market when you think it will keep falling? There are\na few trading platforms where you can short stocks or short the S&P 500 -\nProShares ETF ($SH ) is an option, a simple and liquid tool that allows retail\ninvestors to see their stocks as the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まずは空売り\n\n株式市場が下がり続けると思った時に「空売り」してみませんか？そこで\n株を空売りしたり、S&P500を空売りしたりできるトレーディング・プラットフォームがいくつかあります。\nプロシェアーズETF（$SH ）もその一つで、シンプルで流動性のあるツールで、個人投資家が自分の株を...\n個人投資家は、自分の銘柄を...",
      "title": "株式市場の暴落時に財布を守るには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "第一，做空市场\n\n当你认为股市会持续下跌时，想 \"做空 \"吗？有\n有几个交易平台，你可以做空股票或做空标准普尔500指数------。\nProShares ETF ($SH )是一个选择，这是一个简单且流动性强的工具，可以让散户\n投资者可以看到他们的股票作为...",
      "title": "如何在股灾期间保护钱包？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "第一，做空市場\n\n當你認爲股市會持續下跌時，想 \"做空 \"嗎？有\n有幾個交易平臺，你可以做空股票或做空標準普爾500指數------。\nProShares ETF ($SH )是一個選擇，這是一個簡單且流動性強的工具，可以讓散戶\n投資者可以看到他們的股票作爲...",
      "title": "如何在股災期間保護錢包？"
    }
  ]
}