{
  "author": "savage-dragon",
  "original_created_utc": 1635076227,
  "title": "Whether you 'win' from crypto or not, crypto has taught a generation valuable financial skills that neither school nor 9-5 jobs would have managed to. It doesn't take much for the average crypto newbie to realize how fucked up the governmental money printing process is.",
  "created_utc": 1635096925,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Alright lemme shill you a real solid coin:</strong></p>\n\n<p>- 30% of supply minted this year alone</p>\n\n<p>- Loses 99% of value since the genesis block</p>\n\n<p>- Minted by 1 single node</p>\n\n<p>- Node controlled by anon dev team</p>\n\n<p>- Currency can be mined in toxic mines with shitty ethics and pretty shitty fellow miners</p>\n\n<p>The joke here is that what I&#39;m shilling you is simply the US dollar, or any fiat currency for that matter. All the skills that have come intuitively to you while researching a cryptocurrency, stuff like max supply, market cap, issuance rate, issuance proofs, hash functions, token burns, etc.? These are the sorts of skills that fiat dev teams wish you never learnt, because they know if you ever did, you&#39;d be up in arms.</p>\n\n<p><em>It is well enough that the people of the nation do not understand our banking and monetary system, for if they did, I believe there would be a revolution before tomorrow morning.</em></p>\n\n<p><em>--- Henry Ford</em></p>\n\n<p>Those are just the skills you learned intuitively the first day into crypto. Those are just skills related to fiscal policies.</p>\n\n<p>If you never studied economics or business or finances in university, don&#39;t worry, because when it comes to fiscal policies, most university only shove basic stuff down your throats and regurgitate the same bullshit that&#39;s been going on since the Nixon era. They simply tell you that this Keynesian method is the norm nowadays without telling you its flaws. They never explain to you why only 1 single node gets to control the amount of fiat mined. They never explain to you why dev team is mostly anon. They simply want you to accept things as they are and as they will always be.</p>\n\n<p>Cryptocurrency gives you the firsthand experience as to why things are bad the ways they were and that things don&#39;t always have to be this way.</p>\n\n<p><strong>But what about other skills? Aside from fiscal policies, what else have you learned that you take for granted in crypto?</strong></p>\n\n<p>Keep in mind that the majority of adult Americans are basically financially illiterate, and believe it or not, Americans already represent the peak of humanity&#39;s education. (In coming hurr durr dumb American jokes from Europeans for sure) But let&#39;s move on.</p>\n\n<p>How many people do you know are dumb as rocks when it comes to money management? How many constantly take on debts, live way above their means, have no savings or safety nets, waste money on drug addiction, gambling and poor decisions?</p>\n\n<p>Now let&#39;s see what crypto has taught us during the bootcamp courses:</p>\n\n<p>DCA. Sacrifice today for a 1000x better future. Don&#39;t let banks steal your yields, take charge of your yields. Research into each crypto&#39;s portfolio.</p>\n\n<p>Plus other financial tools and concepts like: reading charts, margins, leverages, future contracts, intellectual property ownerships, cryptography, safe online hygiene, macroeconomics models, technical analyses, etc.</p>\n\n<p>Unless you had been already in stock before crypto, these concepts would have been completely foreign to you. The stock market has a higher barrier to entry than crypto, and the majority crypto people in their early 20s without any prior financial experience had to learn all these concepts themselves. Were it not for crypto, many of these people would have been stuck working a normal job, not giving a shit about the global money market or any of these financial concepts.</p>\n\n<p><strong>So yes winning in crypto is awesome. But keep in mind that crypto has already armed you with an extremely powerful knowledge. Remind yourselves that this knowledge had been hidden to 99% of the public prior to the advent of crypto. By being so transparent with its monetary policies, crypto has exposed how non-transparent and corrupt the fiat world is.</strong></p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qeqmn2/whether_you_win_from_crypto_or_not_crypto_has/",
  "subreddit": "CryptoCurrency",
  "id": "qeqmn2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Alright lemme shill you a real solid coin:\n\n- 30% of supply minted this year alone\n\n- Loses 99% of value since the genesis block\n\n- Minted by 1 single node\n\n- Node controlled by anon dev team\n\n- Currency can be mined in toxic mines with shitty ethics and pretty shitty\nfellow miners\n\nThe joke here is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、私はあなたに本物の固体コインを教えてあげましょう。\n\n- 今年だけで供給量の30%が鋳造された\n\n- ジェネシスブロック以降、99%の価値が失われています。\n\n- 1つのノードで鋳造されている\n\n- ノードは無名の開発チームによって管理されている\n\n- 倫理観のない有毒な鉱山で採掘されることもありますし、クソみたいな仲間もいます。\nマイナーな鉱山で採掘される\n\nここでのジョークは...",
      "title": "暗号から「勝つ」かどうかは別にして、暗号は、学校でも9時から5時までの仕事でもできなかったような貴重な金融スキルを世代に教えてくれました。平均的な暗号の初心者が、政府のお金の印刷プロセスがどれほどめちゃくちゃかを理解するのに、それほど時間はかかりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，让我向你推销一种真正可靠的硬币。\n\n- 仅今年就有30%的供应量被铸造出来\n\n- 自创世区块以来损失了99%的价值\n\n- 由一个单一的节点铸造的\n\n- 节点由匿名的开发团队控制\n\n- 货币可以在有毒的矿场开采，道德水平低下，矿工也相当低劣\n矿工同伴\n\n这里的笑话是...",
      "title": "无论你是否从加密货币中 \"获胜\"，加密货币已经教会了一代人宝贵的金融技能，这是学校和朝九晚五的工作都无法做到的。对于普通的加密货币新手来说，不需要花太多时间就能意识到政府的印钞过程是多么的糟糕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，讓我向你推銷一種真正可靠的硬幣。\n\n- 僅今年就有30%的供應量被鑄造出來\n\n- 自創世區塊以來損失了99%的價值\n\n- 由一個單一的節點鑄造的\n\n- 節點由匿名的開發團隊控制\n\n- 貨幣可以在有毒的礦場開採，道德水平低下，礦工也相當低劣\n礦工同伴\n\n這裏的笑話是...",
      "title": "無論你是否從加密貨幣中 \"獲勝\"，加密貨幣已經教會了一代人寶貴的金融技能，這是學校和朝九晚五的工作都無法做到的。對於普通的加密貨幣新手來說，不需要花太多時間就能意識到政府的印鈔過程是多麼的糟糕。"
    }
  ]
}