{
  "author": "_rerun984",
  "the_new_excerpt": "$GME - Option flow by the numbersAftermarket close yesterday I was feeling fried\n- not so much because of GME (-15k on tsla options woof). So I unplugged, and\nhung out with my family. I’m an Old Ape. I’m an ape with wife ape, a child ape.\nI’m an ape that owns a few businesses, and properties. But…",
  "original_created_utc": 1615647515,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$GME - 期权流的数字昨天市场收盘后，我感觉炒了起来\n- 并不是因为GME（-1.5万的tsla选项汪）。所以我拔掉了插头，并且\n和我的家人一起出去玩。我是一只老猿。我是一个有老婆猿，有孩子猿的猿人。\n我是一个拥有一些生意，和房产的猿人。但是...",
      "title": ""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$GME - 期權流的數字昨天市場收盤後，我感覺炒了起來\n- 並不是因爲GME（-1.5萬的tsla選項汪）。所以我拔掉了插頭，並且\n和我的家人一起出去玩。我是一隻老猿。我是一個有老婆猿，有孩子猿的猿人。\n我是一個擁有一些生意，和房產的猿人。但是...",
      "title": ""
    }
  ],
  "title": "GME - option flow by the number - JUST HODL SMOOTH BRAINS",
  "created_utc": 1615671316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>$GME - Option flow by the numbers</strong>Aftermarket close yesterday I was feeling fried - not so much because of GME (-15k on tsla options woof). So I unplugged, and hung out with my family. I’m an Old  Ape. I’m an ape with wife ape, a child ape. I’m an ape that owns a few businesses, and properties. But most importantly - I’m an ape that is completely over the looseness of regulations in securities exchanges, and this ape isn’t fucking selling.Feeling recharged this morning, with a couple cups of coffee - I decided to jump into Option order flow from Cheddar Flow.</p>\n\n<p>&#x200B;</p>\n\n<p>I used the following parameters:3/1 to 3/15 OrdersRemoved everything that has expired and decided to do what gives me comfort as a wrinkle brain ape and just look at the concrete data.</p>\n\n<p>&#x200B;</p>\n\n<p>The Excel sheet I provided shows many things, is it accurate? No - probably not. This ape may have some wrinkles, but is too smooth calculate IV.The bulleted point of the sheet is this (NOT BANANA ADVICE, JUST WRINKLE BRAIN APE LOOKING FOR ANSWERS)</p>\n\n<p>There are: 111,204 Volume picked up in options that have yet to expire - between calls &amp; putsThere is: 538,434 Current option interest on the strikes in this sheet The Average strike price divided by the total number of contracts purchased is 18,665 (this accounts for puts as well as calls)</p>\n\n<p>.Because ape only has some wrinkles, not all the wrinkles I can’t account for IV - but I can account for a banana to banana value at volatility less cost. So ape decided to account for that, to give himself a bigger view of the overall picture.</p>\n\n<p>There was: $24million in buys in deep ITM and slightly OOTM options picked up on 3/4 (ape things hedges for hedges (double fuck you scumbag funds if you’re reading this btw)</p>\n\n<p>On a banana for banana basis ape determined total value of all options right now is 94,854,461 bananas.</p>\n\n<p>So wrinkle brain ape took out the value of the puts, and hedges - and determined that the actual value is 140,017,514 Bananas in value. That’s a lot of bananas. Like a lot.  </p>\n\n<p><strong>(( EDIT: $99,965,839 spent on these options. // Shorts/Hedge removed is 116,463,553 ))</strong>  </p>\n\n<p>With ape baseless speculation - I value The shorts/hedge (fuck you again btw) as -45,163,053 bananas. That’s quite a banana deficit before you account for IV and Theta.  </p>\n\n<p><strong>(( EDIT: -16,497,714 with adjustments to formula  still not sure how to account for IV / Vega / Theta in all of this))</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Other information I like:65.2 million outstanding sharesshort float is 54.16 million cccording to whale wisdom q4 filings there are 74.474 million shares held (LOL what? More shares than available - keep this in mind),short interest according to Morningstar is 52% . (<strong>EDIT: updated to 26.22%)</strong></p>\n\n<p>There are currently 8.2 million more shares than outstanding (before apes and dfv of course).Short total should be around 28million shares.<strong>Meaning 36.437 million shares need to be bought in order to cover.</strong>  </p>\n\n<p><strong>(( EDIT: -22,474,752 total shares to be covered after adjusting SI -))</strong></p>\n\n<p><strong>TLDR:</strong> Just fucking holding your shares, they bring bananas.Stop bitching about gamma, stop bitching about options, stop bitching about the day to day - wrinkle brain ape says this. Shit is going to hit the fan. Be apart of history apes.</p>\n\n<p>Go long, and stay strong</p>\n\n<p>**Positions:**Was holding 365 shares, told wife i&#39;d withdraw more money this weekend because she&#39;s sketched out as fuck about all of this (bigly bananas up for the year), down to 265 shares now.  with $30k in bananas to continue to add</p>\n\n<p>Excel Sheet attached.<a href=\"https://drive.google.com/file/d/1xV1iz8mq-srWhjQCZmZQvowXm8L3SEgk/view?usp=sharing\">https://drive.google.com/file/d/1xV1iz8mq-srWhjQCZmZQvowXm8L3SEgk/view?usp=sharing</a></p>\n\n<p>If there are errors i&#39;ll adjust later. need more coffee.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>EDIT 1:</strong>there are errors, please don&#39;t down vote people for pointing them out. We should want accurate information, not just information that makes us feel good.</p>\n\n<p><a href=\"/u/Verb0182\">u/Verb0182</a> and <a href=\"/u/auspiciousham\">u/auspiciousham</a> specifically pointing our correct inaccuracies.Adjusting and will re-upload my boomer excel sheet.  </p>\n\n<p><strong>EDIT 2:</strong> After correcting formula in P column (my bad, good eye auspiciousham) and adjusting the short interest to 26.22 (good eyes verb)  updated totals are:  </p>\n\n<p>22,474,752 million shares to cover  </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 2691,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/IQAWXD6DnUtB3P2wAb1NPMqVar--QWb_8rLWW0oYoDs.jpg?auto=webp&s=ffc09b5346d713c7cabebf3da84e5bbde9503329",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/IQAWXD6DnUtB3P2wAb1NPMqVar--QWb_8rLWW0oYoDs.jpg?width=108&crop=smart&auto=webp&s=0137294c7fb1e3cfbaac83b54c3ec567cd8c8d71",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/IQAWXD6DnUtB3P2wAb1NPMqVar--QWb_8rLWW0oYoDs.jpg?width=216&crop=smart&auto=webp&s=89f2b80a8ee27a87e97292650da1bf9de0da3857",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/IQAWXD6DnUtB3P2wAb1NPMqVar--QWb_8rLWW0oYoDs.jpg?width=320&crop=smart&auto=webp&s=128b68f723c10e0b394769814131a403b8fcc2b3",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/IQAWXD6DnUtB3P2wAb1NPMqVar--QWb_8rLWW0oYoDs.jpg?width=640&crop=smart&auto=webp&s=e1b2c3f5f7ac30d53d49669f795cf402a223c560",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/IQAWXD6DnUtB3P2wAb1NPMqVar--QWb_8rLWW0oYoDs.jpg?width=960&crop=smart&auto=webp&s=f0a5d1f570cc4b28b7419ec63d41087b302049b5",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/IQAWXD6DnUtB3P2wAb1NPMqVar--QWb_8rLWW0oYoDs.jpg?width=1080&crop=smart&auto=webp&s=6cd91725e4d1d470c34f94d5ba486bbb3e6808d2",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "-Ycg6QzWXiwYFP88Ky2OyXlGhSMBIzW-oXoOROE2k0c"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/m47vi8/gme_option_flow_by_the_number_just_hodl_smooth/",
  "subreddit": "wallstreetbets",
  "id": "m47vi8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147389888
}