{
  "author": "waitinonit",
  "the_new_excerpt": "I've been looking into selling covered calls as well as investing further in\ncovered call ETFs. I currently have positions in QYLD and NUSI.\n\nI understand the basic components of a call option - intrinsic value and time\nvalue.\n\nHowever in reading about and listening to comments regarding the growth…",
  "original_created_utc": 1623178967,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はカバードコールの販売と、カバードコールETFへのさらなる投資を検討してきました。\nカバードコールETFへの投資も検討しています。現在、私はQYLDとNUSIのポジションを持っています。\n\n私は、コール・オプションの基本的な構成要素である本源的価値と時間的価値を理解しています。\n価値です。\n\nしかし、成長に関する記事を読んだり、コメントを聞いたりすると...",
      "title": "オプション価格とカバードコールの販売"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在研究卖出备兑看涨期权，以及进一步投资于\n补仓ETF。我目前有QYLD和NUSI的头寸。\n\n我了解看涨期权的基本组成部分--内在价值和时间价值。\n价值。\n\n然而，在阅读和听取有关增长的评论时，我发现，这些评论中的一些内容是不准确的。",
      "title": "期权价格和卖出套利看涨期权"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在研究賣出備兌看漲期權，以及進一步投資於\n補倉ETF。我目前有QYLD和NUSI的頭寸。\n\n我瞭解看漲期權的基本組成部分--內在價值和時間價值。\n價值。\n\n然而，在閱讀和聽取有關增長的評論時，我發現，這些評論中的一些內容是不準確的。",
      "title": "期權價格和賣出套利看漲期權"
    }
  ],
  "title": "Option prices and selling covered calls",
  "created_utc": 1623238227,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been looking into selling covered calls as well as investing further in covered call ETFs.   I currently have positions in QYLD and NUSI.</p>\n\n<p>I understand the basic components of a call option - intrinsic value and time value.</p>\n\n<p>However in reading about and listening to comments regarding the growth in the number of retail traders and what seems like a movement towards trading options something else struck me.</p>\n\n<p><strong>Could the price of call options  also rise due to an increase in demand (i.e. more traders are asking for them) for options?</strong>  </p>\n\n<p>It seems this is similar to a situation where an ETF&#39;s share price becomes greater than the NAV price.  I know there are mechanisms in place to address that when it occurs. </p>\n\n<p>I guess the increasing price of a call option could at some point make purchasing the stock a better bargain but that would introduce you to more downside potential. </p>\n\n<p>I hope this question makes sense  but let me know if I&#39;m missing something.</p>\n\n<p>Thanks</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/investing/comments/nvbmbi/option_prices_and_selling_covered_calls/",
  "subreddit": "investing",
  "id": "nvbmbi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886626
}