{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Friday, June 4, 2021\n\nStocks rose today as investors digested the May Job Report, which showed\nnon-farm payrolls rise by less than expected for the second straight month.\nMarket participants seem to be interpreting the back-to-back miss in job gains\nfor two consecutive months as…",
  "original_created_utc": 1622839986,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年6月4日(金)\n\n非農業部門雇用者数が2ヶ月連続で予想を下回る結果となった5月の雇用統計を受けて、今日の株価は上昇した。\n非農業部門雇用者数は2ヶ月連続で予想を下回った。\n市場関係者は、2ヶ月連続で雇用者数の増加が見られなかったことを解釈しているようです。\n市場関係者は、2ヶ月連続で雇用者数が増加しなかったことを...",
      "title": "本日2021年6月4日（金）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年6月4日，星期五\n\n今天股市上涨，因为投资者消化了5月份的就业报告，该报告显示非农就业人数连续第二个月增长低于预期。\n非农就业人数连续第二个月低于预期。\n市场参与者似乎将连续两个月的就业增长不及预期的情况解释为\n连续两个月的就业增长不及预期，市场参与者似乎将其解读为...",
      "title": "以下是今天（2021年6月4日，星期五）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年6月4日，星期五\n\n今天股市上漲，因爲投資者消化了5月份的就業報告，該報告顯示非農就業人數連續第二個月增長低於預期。\n非農就業人數連續第二個月低於預期。\n市場參與者似乎將連續兩個月的就業增長不及預期的情況解釋爲\n連續兩個月的就業增長不及預期，市場參與者似乎將其解讀爲...",
      "title": "以下是今天（2021年6月4日，星期五）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Friday, June 4, 2021",
  "created_utc": 1622870431,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Friday, June 4, 2021</strong></p>\n\n<p>Stocks rose today as investors digested the May Job Report, which showed non-farm payrolls rise by less than expected for the second straight month. Market participants seem to be interpreting the back-to-back miss in job gains for two consecutive months as meaning the Federal Reserve will keep the current accommodative monetary policy in place until the labor market shows robust signs of improvement.</p>\n\n<p>The Labor Department’s May Job Report showed the economy gained 559,000 non-farm payrolls, a substantial increase compared to April but still below estimates of 650,000. For months, the Federal Reserve has consistently reiterated it wants to see a “string” of strong labor reports, like the one in March, before policy adjustments are seriously considered. This is why technology and growth stocks, which would be affected the most by potential adjustments in policy, outperformed today. Former Chase Chief Economist Anthony Chan said, “What I see here is somewhat of a ‘goldilocks’ overall economy. I see that employment is increasing. With regard to the reason why the market is excited, it&#39;s because it&#39;s telling us that the economy is not blistering hot, that it&#39;s actually going to be opening up pretty gradually. I think that&#39;s important.&quot; </p>\n\n<p>Recent economic data has been good overall. A stronger-than-expected ADP private payrolls report and weekly jobless claims report released Thursday each underscored firming rehiring trends across the economy, with a smaller share of individuals becoming newly unemployed for pandemic-related reasons. Another wave of vaccinations has taken place, reopenings have picked up, and businesses have been scrambling to bring back workers to keep pace with surging demand. </p>\n\n<p>Federal Reserve Bank of New York President John Williams said that the economy was &quot;still quite a ways off from maintaining the substantial further progress we’re really looking for in terms of adjustments to our asset purchase program.&quot;</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Marqeta Inc. (MQ), plans on IPOing soon at a valuation of $12 billion offers card-issuing technology that lets businesses build out these functions. The company’s largest client is Square (SQ), which accounted for roughly 70% of revenue last year.</li>\n<li>Square (SQ) is considering making a hardware wallet for bitcoin, CEO Jack Dorsey, said in a tweet. (Jack Dorsey is also the CEO and co-founder of Twitter)</li>\n<li>GE CEO Larry Culp says the deal to combine its jet-leasing unit and GE Capital Aviation Services with rival AerCap (AER) remains on track to close later this year or early next year. </li>\n<li>Twitter (TWTR) on Thursday said it will roll out a new subscription product initially in Australia and Canada called Twitter Blue, which will let paying users edit their tweets before posting and change the color theme of their app. Twitter has recently been making big pushes trying to raise revenue</li>\n<li>Taiwan Semiconductor (TSM) is moving ahead with $12 billion plans to build a new semiconductor factory in Arizona. The US government has been aggressively pursuing semiconductor companies for investments, looking to secure its supply of semiconductors. Intel (INTC) also recently showed plans to also build new factories in Arizona. </li>\n<li>Sorry, no price target upgrades today</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/nsf89v/here_is_a_market_recap_for_today_friday_june_4/",
  "subreddit": "stocks",
  "id": "nsf89v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886631
}