{
  "author": "OwNii",
  "the_new_excerpt": "I've been investing in crypto since 2017, and with this cycle I've been using\nBlockfolio to track my portfolio. All things considered, Blockfolio has been\ngreat, but it doesn't give you full portfolio information (see below), and it's\nterrible for your sanity (who else refreshes their portfolio 20…",
  "original_created_utc": 1620767520,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2017年からクリプトに投資していますが、このサイクルで私は\nBlockfolioで自分のポートフォリオを追跡しています。すべてのことを考えると、Blockfolioは素晴らしいものでした。\n素晴らしいですが、完全なポートフォリオ情報を提供してくれませんし（下記参照）、それは\nまた、正気を保つには最悪です（他にポートフォリオを20回も更新する人はいないでしょう...）。",
      "title": "長期投資家からのアドバイス：携帯電話からポートフォリオを削除し、Googleシートを使う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2017年开始投资加密货币，随着这个周期，我一直在使用\nBlockfolio来跟踪我的投资组合。从所有方面来看，Blockfolio一直是\n很好，但它不能给你提供完整的投资组合信息（见下文），而且它\n对你的理智来说是很糟糕的（还有谁会刷新他们的投资组合20...",
      "title": "一位长期投资者的建议：从手机上删除你的投资组合，并使用谷歌表格"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2017年開始投資加密貨幣，隨着這個週期，我一直在使用\nBlockfolio來跟蹤我的投資組合。從所有方面來看，Blockfolio一直是\n很好，但它不能給你提供完整的投資組合信息（見下文），而且它\n對你的理智來說是很糟糕的（還有誰會刷新他們的投資組合20...",
      "title": "一位長期投資者的建議：從手機上刪除你的投資組合，並使用谷歌表格"
    }
  ],
  "title": "Advice from a long term investor: delete your portfolio off your phone and use Google Sheets",
  "created_utc": 1620815438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been investing in crypto since 2017, and with this cycle I&#39;ve been using Blockfolio to track my portfolio. All things considered, Blockfolio has been great, but it doesn&#39;t give you full portfolio information (see below), and it&#39;s terrible for your sanity (who else refreshes their portfolio 20 times in a day? That shit&#39;s not good for you. </p>\n\n<p>&nbsp;</p>\n\n<p>I made Google sheet portfolio template that tracks realtime prices for the top 1000 coins, and it&#39;s way better, both for tracking and your mental health. </p>\n\n<p>&nbsp;</p>\n\n<p><strong>Missing numbers on Blockfolio:</strong></p>\n\n<p>&nbsp;</p>\n\n<ol>\n<li>Checking how much fiat you invested in total</li>\n<li>Your total portfolio ROI % (with all your shitcoins, is your portfolio up 50% or down? Blockfolio doesn’t tell you).</li>\n<li>Purchasing crypto with crypto profits: When you purchase crypto with other crypto profits, your portfolio on Blockfolio will either double count this or, you have to delete transactions from the coin you sold (it’s super messy). </li>\n</ol>\n\n<p>&nbsp;</p>\n\n<p>The template I made accounts for all of the above. It works with the Cryptowat.ch API and can track the top 1000 coins in real-time. </p>\n\n<p>&nbsp;</p>\n\n<p>The full instructions to get the cryptowat.ch API set-up and how to read the Google sheet can be found <a href=\"https://www.cryptoprinciples.co/resources/crypto-portfolio-google-sheets\">here</a>.</p>\n\n<p>&nbsp;</p>\n\n<p>The link to the Google sheet template is <a href=\"https://docs.google.com/spreadsheets/d/18qDQ1c57u_saBRDMJvAsFNFlGCHYnKfp5y-hvCB6s8w/edit#gid=192891870\">here</a></p>\n\n<p>&nbsp;</p>\n\n<p><strong>Secondary benefits I noticed a week after ditching Blockfolio for my portfolio:</strong>\n&nbsp;</p>\n\n<p>Besides having access to more information about your portfolio (Total fiat invested, total ROI etc). I also noticed secondary benefits that’s really helped my mental health and psychology with investing on this rollercoaster:</p>\n\n<p>&nbsp;</p>\n\n<p><strong>1) You’ll check your portfolio less</strong></p>\n\n<p>You’ll check your portfolio less because it’s harder to check your portfolio (an app on your phone vs. Gdrive on your laptop/desktop). So you won’t idly refresh your portfolio on your phone multiple times a day like people do Instagram.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>2) Your mood won’t depend on red or green days</strong>\n&nbsp;</p>\n\n<p>When the price of Bitcoin falls, so does everything else (usually). I&#39;ve noticed that &quot;red&quot; numbers on Blockfolio can affect your mood and outlook on that day. Since you’re checking your portfolio less, market fluctuations don’t affect you as much (because you won’t know). </p>\n\n<p>&nbsp;</p>\n\n<p>If you don&#39;t think that affects your mood, think about how you feel on &quot;green&quot; days. If your mood is better on green days, then it’s definitely impacted when the crypto markets crash. </p>\n\n<p>&nbsp;</p>\n\n<p><strong>3) It’s easier to HODL the less you check</strong>\n&nbsp;</p>\n\n<p>If you’re HODLing crypto for the long term, it doesn’t make sense for you to always know the price everyday - your portfolio on sheets makes your HODL journey way easier</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/7w50BwaZNgheYtxXfbRy_IhHgzKiZghXacDrI7bVJYU.jpg?auto=webp&s=1ebb405daf2a3b4ed0896701f74cd1157e1aafed",
          "width": 2000,
          "height": 1419
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/7w50BwaZNgheYtxXfbRy_IhHgzKiZghXacDrI7bVJYU.jpg?width=108&crop=smart&auto=webp&s=beb0f42cdbce74722f1a0acebeda7307ff2192e2",
            "width": 108,
            "height": 76
          },
          {
            "url": "https://external-preview.redd.it/7w50BwaZNgheYtxXfbRy_IhHgzKiZghXacDrI7bVJYU.jpg?width=216&crop=smart&auto=webp&s=80b45d7505f58348d73e5a0fa45b82f3355fcf09",
            "width": 216,
            "height": 153
          },
          {
            "url": "https://external-preview.redd.it/7w50BwaZNgheYtxXfbRy_IhHgzKiZghXacDrI7bVJYU.jpg?width=320&crop=smart&auto=webp&s=89b6881b98add3cfea73fd5deed8cc802352208f",
            "width": 320,
            "height": 227
          },
          {
            "url": "https://external-preview.redd.it/7w50BwaZNgheYtxXfbRy_IhHgzKiZghXacDrI7bVJYU.jpg?width=640&crop=smart&auto=webp&s=c44c0020cef58e80c6da61c75fa043c2d2e51503",
            "width": 640,
            "height": 454
          },
          {
            "url": "https://external-preview.redd.it/7w50BwaZNgheYtxXfbRy_IhHgzKiZghXacDrI7bVJYU.jpg?width=960&crop=smart&auto=webp&s=d01130b56d29f050dece93178957589c1456b892",
            "width": 960,
            "height": 681
          },
          {
            "url": "https://external-preview.redd.it/7w50BwaZNgheYtxXfbRy_IhHgzKiZghXacDrI7bVJYU.jpg?width=1080&crop=smart&auto=webp&s=6f64b96a3c7903bd6851e71842f0847008e0cf1e",
            "width": 1080,
            "height": 766
          }
        ],
        "variants": {},
        "id": "MoSqAZtw_wCuGh_URCMWNTXQ32jhxKtD8WVsTVpv5vk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/na7v99/advice_from_a_long_term_investor_delete_your/",
  "subreddit": "CryptoCurrency",
  "id": "na7v99",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992430
}