{
  "author": "Many_Arm7466",
  "original_created_utc": 1635003523,
  "title": "Is it normal to feel bad for profiting of other’s stupidity?",
  "created_utc": 1635024641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Originally I was going to go out for dinner and drinks with some friends but plans ended up being cancelled. </p>\n\n<p>Later that evening I ended up coming across the most ludicrous new released shitcoin I had ever seen on Binance Scam Chain. And figured I’d throw a $100 as that’s what I would have spent on the night out. </p>\n\n<p>This was just purely for shits and giggles and I forgot about it a week later I checked the charts of the shitcoin just to see how much it would be down only to find out it had gone on an insane run and I was in profit to the tune of thousands of dollars. </p>\n\n<p>Of course I took out 40x my investment and let the rest ride as a clown market shit happens insurance. But as I was cashing out in increments as I had enough to completely tank the price.</p>\n\n<p>I joined the Telegram just to see if there was any news. And nope zero news whatsoever... just a ton of shilling and hype and getting new suckers to buy into the shitcoin with zero usecase. Someone new would ask if they are still early and how to buy and all the shillers would say “it’s the next Shib” and “hop in don’t miss the 1000x”. </p>\n\n<p>And seeing all the buy orders with some people throwing in thousands I just felt bad. As I was dumping my bags to the next lineup of idiots while making a killing. And the pump is unsustainable so they will likely be left holding their bags.</p>\n\n<p>So I don’t know is it morally wrong to profit off idiots buying bottom of the barrel shitcoins?</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qe759w/is_it_normal_to_feel_bad_for_profiting_of_others/",
  "subreddit": "CryptoCurrency",
  "id": "qe759w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Originally I was going to go out for dinner and drinks with some friends but\nplans ended up being cancelled.\n\nLater that evening I ended up coming across the most ludicrous new released\nshitcoin I had ever seen on Binance Scam Chain. And figured I’d throw a $100 as\nthat’s what I would have spent on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本来ならば、友人たちと食事やお酒を飲みに行く予定だったのですが\n予定がキャンセルになってしまいました。\n\nその日の夜、私はBinance Scam Chainで今まで見たこともないような\nBinance Scam Chainで今まで見たこともないようなおかしな新発売のクソコインを見つけました。そして、100ドルを投げようと思いました。\n使っていたかもしれません...",
      "title": "人の愚かさで利益を得ることに悪意を感じるのは普通のことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "原本我打算和一些朋友出去吃饭喝酒，但\n计划最终被取消了。\n\n当天晚上，我最终遇到了最可笑的新发布的\n我在Binance诈骗链上见过的最可笑的新发布的狗屎币。我想我应该抛出100美元，因为\n这就是我本来要花在......",
      "title": "从别人的愚蠢行为中获利而感到难过是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "原本我打算和一些朋友出去喫飯喝酒，但\n計劃最終被取消了。\n\n當天晚上，我最終遇到了最可笑的新發布的\n我在Binance詐騙鏈上見過的最可笑的新發布的狗屎幣。我想我應該拋出100美元，因爲\n這就是我本來要花在......",
      "title": "從別人的愚蠢行爲中獲利而感到難過是正常的嗎？"
    }
  ]
}