{
  "author": "phlorida92",
  "original_created_utc": 1638937142,
  "title": "Would it be wise to stake 7 or 8 figures in a stablecoin?",
  "created_utc": 1638970560,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If I hypothetically came across like 5 to 10 million dollars, and turned it into a stablecoin like USDC would it be wise to just leave it all staked for 10%? &lt;/p&gt;\n\n&lt;p&gt;Or do most exchanges not let you stake that much money in the first place? Sorry if I sound stupid, I&amp;#39;m just a bit new to all this stuff on crypto! I also don&amp;#39;t have that much to invest, but I always wondered what&amp;#39;s stopping millionaires from just leaving millions of dollars and getting a massive return on it by staking into a stablecoin.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s always sat in the back of my mind as to how come I don&amp;#39;t hear more about this. It just seems like a reasonable way to consistently gain a lot of money without really losing anything, unless somehow USDC and crypto overall just disappears the next day.&lt;/p&gt;\n\n&lt;p&gt;Edit: Genuinely not a whale, it was something my friends and I were talking about for fun. It just made me wonder why more well off people just don&amp;#39;t stake into stablecoins, since they said they wanted to stake it into other coins that isn&amp;#39;t a stablecoin to stake for a higher APY.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/rbigon/would_it_be_wise_to_stake_7_or_8_figures_in_a/",
  "subreddit": "CryptoCurrency",
  "id": "rbigon",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If I hypothetically came across like 5 to 10 million dollars, and turned it into\na stablecoin like USDC would it be wise to just leave it all staked for 10%?\n\nOr do most exchanges not let you stake that much money in the first place? Sorry\nif I sound stupid, I'm just a bit new to all this stuff on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし仮に、500万円から1000万円くらいのお金を手に入れ、それを\nUSDCのような安定したコインは、10%で全部張っておくのが賢明なのでしょうか？\n\nそれとも、ほとんどの取引所では、そもそもそんな大金を賭けられないのでしょうか？すみません\nもし私がバカに聞こえるなら、私はこのようなことに少し慣れていないだけです...",
      "title": "安定したコインに7、8桁の金額を賭けるのは賢明でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我假设遇到了500万到1000万美元，并把它变成了像USDC这样的稳定币。\n像USDC这样的稳定币，把它全部押在10%的地方是否明智？\n\n还是说大多数交易所一开始就不允许你押那么多钱？抱歉\n如果我听起来很蠢，我只是对所有这些东西有点陌生......",
      "title": "将7或8位数的资金押在一个稳定币上是否明智？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我假設遇到了500萬到1000萬美元，並把它變成了像USDC這樣的穩定幣。\n像USDC這樣的穩定幣，把它全部押在10%的地方是否明智？\n\n還是說大多數交易所一開始就不允許你押那麼多錢？抱歉\n如果我聽起來很蠢，我只是對所有這些東西有點陌生......",
      "title": "將7或8位數的資金押在一個穩定幣上是否明智？"
    }
  ]
}