{
  "author": "TheOldAngryAnus",
  "original_created_utc": 1641909207,
  "title": "I made my boss over $1.5 million in commission over two years, while I made $45k/year. For Christmas he got me a $25 gift card to a movie theater chain that I would have to drive to another state to even use. When I put in my two week notice, he called legal on me while I sat in his office.",
  "created_utc": 1641931089,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I worked my ass off for this man, essentially running his entire book of business for him. For Christmas he got me a $25 AMC gift card. The closest AMC theater is 1.5hrs away in another state. That pissed me off and made me start looking for other jobs. I genuinely cared about my job and the account, so I waited to accept a job offer until I had trained someone else to do my job. When the time came, I met him in his office and told him that I had accepted another job and that I was putting in my notice, but to not worry because I have someone already trained. When I told him that I had accepted a position with another company in our field but would not be doing the same thing so it wouldn’t violate my non-compete, he called our chief legal office on speaker phone while I sat there. The CLO tells me that “I cannot even mop floors at a company in our field for at least a year”. The CLO adds HR to the call and HR tells me that since I won’t be pursuing my new job, they are going to let me work 2 more weeks to make sure the handoff goes smoothly and then I will be fired for looking for other jobs. &lt;/p&gt;\n\n&lt;p&gt;They asked me for more details as to what I would be doing at my new job, and I told them I wasn’t going to discuss it. After I left, the CLO of this company (a company who brings in $6 BILLION/year in revenue) called me randomly for the next few weeks trying to intimidate me. They even started contacting my new employer. Luckily, I don’t work for a shitty company now and the CEO got involved and told them that they would be ready to fight this in court. They stopped contacting me after that, which meant they never even planed in taking me to court. They just wanted to scare me into quitting my new job. &lt;/p&gt;\n\n&lt;p&gt;Fuck companies like this. We don’t have to put up with this shit anymore.&lt;/p&gt;\n\n&lt;p&gt;Edit: this was 3 years ago. I’m with the same company that I left my previous job for, and they have given me the budget to start a division of the company that directly competes with my previous employer 🤗 I still have that AMC gift card too.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 77174,
  "permalink": "/r/antiwork/comments/s1deoh/i_made_my_boss_over_15_million_in_commission_over/",
  "subreddit": "antiwork",
  "id": "s1deoh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I worked my ass off for this man, essentially running his entire book of\nbusiness for him. For Christmas he got me a $25 AMC gift card. The closest AMC\ntheater is 1.5hrs away in another state. That pissed me off and made me start\nlooking for other jobs. I genuinely cared about my job and the…"
}