{
  "author": "Resident_Piccolo_866",
  "original_created_utc": 1630337265,
  "title": "Unpopular opinion: Moon coins are a shit coin and most of you are hypocrites if you enjoy them.",
  "created_utc": 1630348488,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sure its free money for making a comment or post but they have zero utility just like the coins that are blasted to no end in here and down voted to oblivion such as Doge coin and Shiba. People are literally making post and comments now trying to just get likes to earn a few more moons and its obvious sometimes. This in turn is making this group less enjoyable for myself. I don&#39;t blame any of you for enjoy moons, I do also, its free money and who doesn&#39;t like that. I guess my main point is if you enjoy a coin that has no utility its unfair and makes no sense for you to bash other coins that other people enjoy and also have no real life utility. Even if Moons bring more people you <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> are these really the kind of people we want on this page? Maybe some of you can enlighten me on how this coin is actually different from the coins that are hated in here besides the fact that its free to people who make a post. I do realize you can buy this coin, which is exactly like buying a shit coin.  I wouldn&#39;t be surprised if this post gets downvoted a lot but this is making a lot of sense to me.</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/pekchd/unpopular_opinion_moon_coins_are_a_shit_coin_and/",
  "subreddit": "CryptoCurrency",
  "id": "pekchd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sure its free money for making a comment or post but they have zero utility just\nlike the coins that are blasted to no end in here and down voted to oblivion\nsuch as Doge coin and Shiba. People are literally making post and comments now\ntrying to just get likes to earn a few more moons and its…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かにコメントや投稿をするための無料のお金ではありますが、実用性はゼロです。\nここで散々叩かれて忘却の彼方に落とされたコインのように\n例えばDoge coinやShibaのように。人々は今、文字通り投稿やコメントをしています\nただ「いいね！」をもらって少しでも多くの月を稼ごうとしていますが、その...",
      "title": "不評の声 月のコインはクソコインで、それを楽しんでいる人はほとんどが偽善者です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当然，发表评论或帖子是免费的，但它们的效用是零。\n就像那些在这里被炒得沸沸扬扬的硬币一样，而且被投到了遗忘的地方。\n如Doge币和Shiba。人们现在实际上是在发帖和评论\n试图获得喜欢，以赚取更多的月亮，其...",
      "title": "不受欢迎的意见。月亮币是一种垃圾币，如果你们喜欢它们，你们中的大多数人都是伪君子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當然，發表評論或帖子是免費的，但它們的效用是零。\n就像那些在這裏被炒得沸沸揚揚的硬幣一樣，而且被投到了遺忘的地方。\n如Doge幣和Shiba。人們現在實際上是在發帖和評論\n試圖獲得喜歡，以賺取更多的月亮，其...",
      "title": "不受歡迎的意見。月亮幣是一種垃圾幣，如果你們喜歡它們，你們中的大多數人都是僞君子。"
    }
  ]
}