{
  "author": "repagator8",
  "the_new_excerpt": "https://www.bbc.com/news/business-55540901\n\n\n\nThe New York Stock Exchange (NYSE) has scrapped its decision to delist three\nChinese telecoms companies.\n\nPresident Donald Trump signed an executive order in November barring American\ninvestments in Chinese firms owned or controlled by the military.\n\nThe…",
  "original_created_utc": 1609826411,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.bbc.com/news/business-55540901\n\n\n\n纽约证券交易所(NYSE)已经放弃了三家公司退市的决定。\n中国电信公司。\n\n唐纳德·特朗普(Donald Trump)总统在11月签署了一项行政命令，禁止美国人\n对军方拥有或控制的中国公司的投资。\n\nThe…",
      "title": "纽约证交所放弃中国电信巨头退市计划"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.bbc.com/news/business-55540901\n\n\n\n紐約證券交易所(NYSE)已經放棄了三家公司退市的決定。\n中國電信公司。\n\n唐納德·特朗普(Donald Trump)總統在11月簽署了一項行政命令，禁止美國人\n對軍方擁有或控制的中國公司的投資。\n\nThe…",
      "title": "紐約證交所放棄中國電信巨頭退市計劃"
    }
  ],
  "title": "NYSE scraps plans to delist Chinese telecoms giants",
  "created_utc": 1609854692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.bbc.com/news/business-55540901\">https://www.bbc.com/news/business-55540901</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>The New York Stock Exchange (NYSE) has scrapped its decision to delist three Chinese telecoms companies.</strong></p>\n\n<p>President Donald Trump signed an executive order in November barring American investments in Chinese firms owned or controlled by the military.</p>\n\n<p>The NYSE announced on 31 December that it would delist China Mobile, China Telecom and China Unicom as a result.</p>\n\n<p>Now, it has U-turned its decision based on &quot;further consultation&quot; with regulatory authorities.</p>\n\n<ul>\n<li><a href=\"https://www.bbc.co.uk/news/business-55504881\"><strong>Wall Street to kick out Chinese telecom giants</strong></a></li>\n<li><a href=\"https://www.bbc.co.uk/news/business-55269879\"><strong>US telcos to &#39;rip and replace&#39; Huawei components</strong></a></li>\n<li><a href=\"https://www.bbc.co.uk/news/business-55132425\"><strong>China escalates tit-for-tat trade war with US</strong></a></li>\n</ul>\n\n<p>&quot;I suspect that the NYSE never wanted to delist these stocks in the first place. They acted on guidance regarding the executive order,&quot; Jeffrey Halley, a senior market analyst from Oanda told the BBC.</p>\n\n<p>&quot;That interpretation has clearly changed and the NYSE has moved quickly to change course,&quot; he added.</p>\n\n<p>The US exchange had planned to delist all three companies as early as this week.</p>\n\n<p>Shares of all three companies surged on the Hong Kong stock market - where the companies are also listed - bouncing back after from punishing sessions in both New York and Hong Kong.</p>\n\n<p>China Unicom rose by 8.5%, while China Telecom jumped 8% and China Mobile rebounded by 7% on the news.</p>\n\n<p>The NYSE indicated that it might revisit the decision, saying it would continue to evaluate the applicability of Mr Trump&#39;s Executive Order to the three companies and their continued listing status.</p>\n\n<h2>Dual listings</h2>\n\n<p>The three companies earn all of their revenue in China and have no significant presence in the US</p>\n\n<p>Like many other large Chinese companies, they have a dual listing in the US and Hong Kong.</p>\n\n<p>There are currently more than 200 Chinese companies listed on US stock markets with a total market capitalization of $2.2tn (£1.6tn).</p>\n\n<p>In some cases, however, their share listings have became tangled in ongoing diplomatic and trade friction between the US and China.</p>\n\n<p>Mr Trump has not only pushed for companies to be delisted, but has targeted a number of Chinese companies including TikTok, Huawei and Tencent on the grounds of national security.</p>\n\n<p>China responded with its own blacklist of US companies as tensions between the economic giants escalate.</p>\n\n<p>On Monday a spokeswoman for China&#39;s foreign ministry Hua Chunying had criticised the initial decision to delist the companies as &quot;unwise&quot; and reflective of how &quot;random, arbitrary and uncertain&quot; US rules can be.</p>\n\n<p>Some analysts expect the end of the Trump administration might lead to a lull in the trade dispute, as the Chinese government waits to see what approach incoming President Joe Biden might take to US-Chinese relations.</p>\n\n<p>&quot;These are the acts of a dying administration and China will probably be content to await President Biden, and more clarity then over the general path of US China relations from the new administration,&quot; said Mr Halley.</p>\n</div><!-- SC_ON -->",
  "score": 77,
  "permalink": "/r/stocks/comments/kqs0ig/nyse_scraps_plans_to_delist_chinese_telecoms/",
  "subreddit": "stocks",
  "id": "kqs0ig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100749670
}