{
  "author": "free_my_mind",
  "original_created_utc": 1635711457,
  "title": "Frustrated and tired with memecoins ? Here are 4 tokens with an actual use-case and/or brilliant technology.",
  "created_utc": 1635730475,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I. <strong>Algorand</strong></p>\n\n<p>Algorand is a public blockchain combining great speed (transactions are validated within 4-5 seconds), scalability with huge TPS (currently, Algorand can process over 1’200 transactions per second, <a href=\"https://www.algorand.com/resources/blog/algorand-building-scalable-sustainable-blockchain-ecosystem/\">soon to become 3’000 tps</a>, but aims to reach eventually 46’000 tps!), decentralisation and security, characteristics that are typically difficult to assemble in a single cryptocurrency. The entire team behind the project is made up of illustrious scientists, such as its creator Silvio Micali, an MIT professor and winner of the 2012 Turing Award (a sort of Nobel Prize in computing). The non-profit Algorand Foundation oversees and funds the development of the protocol. A governance program allows users to vote regarding the future of the blockchain and obtain rewards if they do so.</p>\n\n<p>The Algorand ecosystem is very young and is starting to grow; many dApps are appearing and with those many new ASA (“Algorand Standard Assets”, the equivalent of the ERC-20 token on ETH). There are many absolutely unknown coins that are so far down the marketcap ranks that they are not even shilled on this subreddit. One of those is Yieldly, a new staking platform providing users with nice APY and a bridge function to Ethereum.</p>\n\n<hr/>\n\n<p>II. <strong>Terra (Luna)</strong></p>\n\n<p>Terra is a blockchain protocol that offers decentralized stablecoins pegged to different currencies. Stablecoins attempt to follow the price of the asset they&#39;re connected to. For example, U.S. dollar stablecoins are designed to have a price of $1.</p>\n\n<p>The Terra token (Luna) is the native cryptocurrency of the protocol. It is a governance token, which means holders have voting rights on what happens with the project. Holders can stake their tokens to earn a portion of Terra&#39;s stablecoin transaction fees. And Luna is used to manage the prices of those stablecoins.</p>\n\n<p>Luna stablecoins keeps its one-to-one peg through an algorithm that automatically adjusts stablecoin supply based on its demand. It does so by incentivizing LUNA holders to swap LUNA and stablecoins at profitable exchange rates, as needed, to either expand or contract the stablecoin supply to match demand.</p>\n\n<p>Stable coins are very useful. Every investor should have, at all time, a position in fiat. This is 101. Stable coins allow investor to “stay” in the crypto-world even when holding fiat, without exiting the blockchain ecosystem. However, some stable coins are considered shady (looking at you USDT) and they are usually not decentralized, so it’s much more complicated to make sure they are actually backed up by fiat. With Terra, the stable coins themselves are decentralized ; this system is, in my opinion, much more reliable and transparent.</p>\n\n<hr/>\n\n<p>III. <strong>DyDx</strong></p>\n\n<p>dYdX is a decentralized Layer 2 trading platform built on the Ethereum blockchain. It’s an autonomous trading platform that provides financial products to its users, including margin trading, derivatives and perpetual contracts, which is very innovative in my opinion. </p>\n\n<p>dYdX also allows you to borrow, lend and make predictions on the future prices of popular cryptocurrencies.</p>\n\n<p>Abandoning the concept of having a central order book, where buyers and sellers can place orders, dYdX functions through a collection of liquidity pools. \ndYdX’s native cryptocurrency, DYDX, acts as the platform’s governance token and enables participants to vote on protocol upgrades to the network. </p>\n\n<p>If you believe in decentralization even for complex financial protocol, keep an eye of dYdX.</p>\n\n<hr/>\n\n<p>IV. <strong>Nano</strong></p>\n\n<p>According to their website, Nano is “fee-less, eco-friendly and instant”.</p>\n\n<p>Nano is a coin designed to be a highly energy-efficient, frictionless medium of exchange, with no transaction fees. Nano accomplishes this by utilizing a radically different design than traditional blockchains such as bitcoin or ethereum. The goal of Nano is to accelerate mainstream adoption of crypto payments by creating a system that is user-friendly, affordable, and scalable.</p>\n\n<p>We can think whatever we want about the Nano crowd, one thing is certain is that Nano is an amazing coin from the technological point of view. It doesn’t have smart contracts and therefore dApps, swaps, DeFi, etc. It does only one thing, which is transferring tokens from one address to the other, but it does it perfectly.</p>\n\n<p>If you’re not into DeFi and want a literal “cryptocurrency”, Nano might be for you.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/qjxslx/frustrated_and_tired_with_memecoins_here_are_4/",
  "subreddit": "CryptoCurrency",
  "id": "qjxslx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I. Algorand\n\nAlgorand is a public blockchain combining great speed (transactions are\nvalidated within 4-5 seconds), scalability with huge TPS (currently, Algorand\ncan process over 1’200 transactions per second, soon to become 3’000 tps\n[https://www.algorand.com/resources/blog/algorand-building…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "I. Algorand\n\nAlgorandは、高速性（トランザクションは1分以内に完了）を兼ね備えたパブリックブロックチェーンです。\n4-5秒以内に検証される）、巨大なTPSによるスケーラビリティ（現在、Algorandは\nは1秒間に1,200件以上の取引を処理することができ、まもなく3,000tpsになる予定です。\n[https://www.algorand.com/resources/blog/algorand-building...",
      "title": "メモコインに不満や疲れを感じていますか？ここでは、実際のユースケースや優れた技術を持つ4つのトークンを紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "I. Algorand\n\nAlgorand是一个公共区块链，结合了巨大的速度（交易在4-5秒内得到验证）和巨大的TPS的可扩展性（目前Algorand\n4-5秒内得到验证），具有巨大TPS的可扩展性（目前，Algorand\n可以每秒处理超过1'200个交易，很快就会达到3'000 tps\n[https://www.algorand.com/resources/blog/algorand-building...",
      "title": "感到沮丧和厌倦的memecoins？这里有4种具有实际用途和/或杰出技术的代币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "I. Algorand\n\nAlgorand是一個公共區塊鏈，結合了巨大的速度（交易在4-5秒內得到驗證）和巨大的TPS的可擴展性（目前Algorand\n4-5秒內得到驗證），具有巨大TPS的可擴展性（目前，Algorand\n可以每秒處理超過1'200個交易，很快就會達到3'000 tps\n[https://www.algorand.com/resources/blog/algorand-building...",
      "title": "感到沮喪和厭倦的memecoins？這裏有4種具有實際用途和/或傑出技術的代幣。"
    }
  ]
}