{
  "author": "CandidTurnover",
  "original_created_utc": 1624913366,
  "title": "I officially only look at my wallets on Mondays and Fridays. My stress level has dropped dramatically.",
  "created_utc": 1624937949,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s been a rough start to the summer, family. I, as most Americans now, have a phone in my hand at all times. That means constantly staring at my wallet, waiting for that first million.</p>\n\n<p>My family was frustrated by my frustration. I knew I needed something to change so I started with something simple- stop looking at the damn charts. And holy shit, all I see is green now. Sure, sometimes it’s a little red but it feels like crypto used to feel- exciting, fun, and like I made the right decision. </p>\n\n<p>Give yourself a break. You made the right investment as long as you’re still paying your bills. I believe in crypto, so why would I question it?</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/o9t41f/i_officially_only_look_at_my_wallets_on_mondays/",
  "subreddit": "CryptoCurrency",
  "id": "o9t41f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s been a rough start to the summer, family. I, as most Americans now, have a\nphone in my hand at all times. That means constantly staring at my wallet,\nwaiting for that first million.\n\nMy family was frustrated by my frustration. I knew I needed something to change\nso I started with something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "夏の始まりは荒れ模様でしたね、家族。今やほとんどのアメリカ人がそうであるように、私も常に携帯電話を手にしています。\n常に携帯電話を手にしています。つまり、常に財布とにらめっこです。\n最初の100万円を待っているのです。\n\n家族は私のイライラに苛立っていました。何かを変えなければならないと思いました。\n何かを変えなければならないと思い、まず始めたことは...",
      "title": "私は公式に月曜と金曜にしか財布を見ません。私のストレスレベルは劇的に下がりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个夏天的开始很不顺利，家人。我，和大多数美国人一样，现在有一个\n手机一直在我手中。这意味着不断盯着我的钱包。\n等待那第一笔钱。\n\n我的家人对我的挫折感感到很沮丧。我知道我需要做些什么来改变\n所以我从一些事情开始...",
      "title": "我正式地只在周一和周五看我的钱包。我的压力水平急剧下降。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個夏天的開始很不順利，家人。我，和大多數美國人一樣，現在有一個\n手機一直在我手中。這意味着不斷盯着我的錢包。\n等待那第一筆錢。\n\n我的家人對我的挫折感感到很沮喪。我知道我需要做些什麼來改變\n所以我從一些事情開始...",
      "title": "我正式地只在週一和週五看我的錢包。我的壓力水平急劇下降。"
    }
  ]
}