{
  "author": "MarioTheMojoMan",
  "original_created_utc": 1642509546,
  "title": "China's first university, the Imperial University of Peking, was founded in 1898, but it surely had much older educational institutions. What distinguishes a \"university\" in the Western understanding from these older academies, and why did China find it necessary to establish one?",
  "created_utc": 1642517400,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Was it a question of subject matter, organization, affiliation, or other factors? Was the establishment of a Western-style university a major or minor adjustment for China as a whole? And why establish new institutions rather than reform existing ones?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve noticed similar dynamics at play in other Asian countries (e.g. Thailand and Japan), where education had a strong tradition and legacy but the &amp;quot;first university&amp;quot; dates to no earlier than the late 19th century, so info from Asian countries outside China would also be appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/s6wkwl/chinas_first_university_the_imperial_university/",
  "subreddit": "AskHistorians",
  "id": "s6wkwl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Was it a question of subject matter, organization, affiliation, or other\nfactors? Was the establishment of a Western-style university a major or minor\nadjustment for China as a whole? And why establish new institutions rather than\nreform existing ones?\n\nI've noticed similar dynamics at play in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テーマ、組織、所属などの問題だったのでしょうか。\nの要因を教えてください。西洋式の大学の設立は、大きなものだったのか、それとも小さなものだったのか。\n中国全体の調整？また、なぜ新しい機関を設立するのではなく\n既存のものを改革する？\n\n私は、同じような力学が働いていることに気づいた...",
      "title": "中国初の大学である北京帝国大学は1898年に設立されたが、中国にはもっと古い教育機関があったことは確かである。欧米でいうところの「大学」は、こうした古い学問の場とどこが違うのか、なぜ中国は大学を設立する必要があったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个主题、组织、隶属关系或其他因素的问题吗？\n的因素？建立一所西式大学是一个主要的还是次要的\n对整个中国来说是大是小的调整？为什么要建立新的机构而不是\n改革现有的机构？\n\n我注意到，类似的动力在中国也在发挥作用。",
      "title": "中国的第一所大学，北京帝国大学，成立于1898年，但它肯定有更早的教育机构。在西方的理解中，\"大学 \"与这些更古老的学院有什么区别，为什么中国觉得有必要建立一个大学？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個主題、組織、隸屬關係或其他因素的問題嗎？\n的因素？建立一所西式大學是一個主要的還是次要的\n對整個中國來說是大是小的調整？爲什麼要建立新的機構而不是\n改革現有的機構？\n\n我注意到，類似的動力在中國也在發揮作用。",
      "title": "中國的第一所大學，北京帝國大學，成立於1898年，但它肯定有更早的教育機構。在西方的理解中，\"大學 \"與這些更古老的學院有什麼區別，爲什麼中國覺得有必要建立一個大學？"
    }
  ]
}