{
  "author": "partymsl",
  "original_created_utc": 1648232511,
  "title": "Is there actually any other bluechip coins than BTC and ETH? Everything else seems to have a certain possibility of just disappearing.",
  "created_utc": 1648269482,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bluechip coins are meant to be those cryptocurrencies that are DEFINITELY surviving anything the market has to deal with, no matter what no matter for how long. From the current market situation it seem like BTC and ETH may be the only ones that would overcome anything even if they fall 99%, due to a nuclear war or some alien invasion or some other worst case shit, they will recover as long as humanity does.&lt;/p&gt;\n\n&lt;p&gt;I mean literally every other top 10 crypto has flaws (also BTC and ETH have those) and especially some uncertainty. Tether is obviously doomed, XRP is battling in court, SOL is going out every month, LUNA is too new to tell, ADA is more buzz than actual stuff, and the list goes like that for every crypto according to me.&lt;/p&gt;\n\n&lt;p&gt;We have seen a couple of top 10 cryptos over the past few years loose out completely. So what do you think? Is there any coin that actually has capability to survive anything and always stay where it is today?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/tnv7w3/is_there_actually_any_other_bluechip_coins_than/",
  "subreddit": "CryptoCurrency",
  "id": "tnv7w3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bluechip coins are meant to be those cryptocurrencies that are DEFINITELY\nsurviving anything the market has to deal with, no matter what no matter for how\nlong. From the current market situation it seem like BTC and ETH may be the only\nones that would overcome anything even if they fall 99%, due to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルーチップコインとは、暗号通貨の中で「間違いない」とされるものを指します。\n市場がどのような事態になろうとも、何があろうと、いつまで経っても生き残る。\n長くなります。現在の市場状況を見ると、BTCとETHが唯一かもしれません。\n99%下落しても乗り越えられると思う。",
      "title": "実はBTCとETH以外のブルーチップコインはないのでしょうか？それ以外のものは、ただ消えていく可能性があるように思えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "蓝筹币是指那些肯定能在市场上幸存下来的加密货币。\n在市场必须处理的任何事情中幸存下来，不管是什么，不管有多长时间\n长时间。从目前的市场情况来看，似乎只有BTC和ETH可能是唯一的\n的，即使它们下跌99%也能克服任何问题，因为...",
      "title": "除了BTC和ETH，究竟还有没有其他蓝筹币？其他的东西似乎都有一定的可能会直接消失。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "藍籌幣是指那些肯定能在市場上倖存下來的加密貨幣。\n在市場必須處理的任何事情中倖存下來，不管是什麼，不管有多長時間\n長時間。從目前的市場情況來看，似乎只有BTC和ETH可能是唯一的\n的，即使它們下跌99%也能克服任何問題，因爲...",
      "title": "除了BTC和ETH，究竟還有沒有其他藍籌幣？其他的東西似乎都有一定的可能會直接消失。"
    }
  ]
}