{
  "author": "Kontikulus",
  "original_created_utc": 1638878123,
  "title": "The dreaded bear market will not start when everyone is talking about the coming crypto winter. It will start when everyone is talking about quitting their jobs and buying lambos.",
  "created_utc": 1638909128,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In crypto there is only one thing that is absolutely true: &lt;strong&gt;nothing will play out as most people expect&lt;/strong&gt;. The whole crypto asset class only went down to about 2.2 Trillion and we where in &lt;strong&gt;extreme fear.&lt;/strong&gt; In January of this year 2 Trillion was considered THE MOON. That shows how pessimistic the market already is and it is exactly the reason why a multi year bear market will probably not happen now.  &lt;/p&gt;\n\n&lt;p&gt;I would be much more worried when people start posting &amp;quot;should I leave my job and start trading?&amp;quot; or &amp;quot;I made 10x in one month, so I will be a billionaire in six&amp;quot; and so on. This will be the time when people who bought in extreme fear start dumping on the moon boys and the dreamers will scoop it all up and then realise that no one wants to buy now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/raxj4d/the_dreaded_bear_market_will_not_start_when/",
  "subreddit": "CryptoCurrency",
  "id": "raxj4d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In crypto there is only one thing that is absolutely true: nothing will play out\nas most people expect. The whole crypto asset class only went down to about 2.2\nTrillion and we where in extreme fear. In January of this year 2 Trillion was\nconsidered THE MOON. That shows how pessimistic the market…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の世界では、絶対に正しいことは一つしかありません。\n多くの人が予想するように 暗号資産クラス全体が 約2.2%まで落ち込んだだけです\n兆円まで下がり、私たちは極度の恐怖に襲われました。今年の1月には2兆円は\n月と見なされています。これは市場がいかに悲観的であるかを示しています...",
      "title": "誰もが来るべき暗号の冬について話しているときに、恐ろしい弱気市場が始まることはありません。誰もが仕事を辞めてランボを買おうと話しているときに始まるだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在加密货币中，只有一件事是绝对正确的：没有任何事情会像大多数人预期的那样发展。\n正如大多数人所期望的那样。整个加密货币资产类别只下降到约2.2\n万亿，我们就处于极度恐惧之中。在今年一月，2万亿被认为是\n被认为是 \"月亮\"。这表明市场是多么悲观...",
      "title": "可怕的熊市不会在所有人都在谈论即将到来的加密货币冬天时开始。它将在每个人都在谈论辞去工作和购买兰博时开始。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在加密貨幣中，只有一件事是絕對正確的：沒有任何事情會像大多數人預期的那樣發展。\n正如大多數人所期望的那樣。整個加密貨幣資產類別只下降到約2.2\n萬億，我們就處於極度恐懼之中。在今年一月，2萬億被認爲是\n被認爲是 \"月亮\"。這表明市場是多麼悲觀...",
      "title": "可怕的熊市不會在所有人都在談論即將到來的加密貨幣冬天時開始。它將在每個人都在談論辭去工作和購買蘭博時開始。"
    }
  ]
}