{
  "author": "J2quared",
  "original_created_utc": 1636464870,
  "title": "It's the middle of the night and the Ku Klux Klan has just arrived at my house and looking to do harm. I have right to bear arms and a right to self-defense, so I start blastin'. Do I have any type of protection under the law in the Jim Crow South? Am I arrested the following morning?",
  "created_utc": 1636489810,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: To add more details:</p>\n\n<p>Let&#39;s assume 3 different scenarios:</p>\n\n<p>1) I fire into the air to let them know I am armed. </p>\n\n<p>2) I fire and injure someone. Do I now have evidence for self-defense? Bob just coincidently got shot in the shoulder last night . . .</p>\n\n<p>3) I fire and kill a Klan member. I just pissed off the entire town, but I was well within my rights to defend myself and family. Am I arrested?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/qq3sj8/its_the_middle_of_the_night_and_the_ku_klux_klan/",
  "subreddit": "AskHistorians",
  "id": "qq3sj8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EDIT: To add more details:\n\nLet's assume 3 different scenarios:\n\n1) I fire into the air to let them know I am armed.\n\n2) I fire and injure someone. Do I now have evidence for self-defense? Bob just\ncoincidently got shot in the shoulder last night . . .\n\n3) I fire and kill a Klan member. I just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: もう少し詳しく説明します。\n\n3つの異なるシナリオを想定してみましょう。\n\n1) 自分が武装していることを知らせるために空に向かって発砲する。\n\n2) 発砲して誰かを負傷させた。これで正当防衛の証拠ができたことになりますか？ボブは\n偶然にも昨日の夜、肩を撃たれました。\n\n3) 発砲してクランのメンバーを殺してしまった。私はただ...",
      "title": "夜中にクー・クラックス・クランが私の家にやってきて、危害を加えようとしています。私には武器を持つ権利と自衛権があるので、銃を撃ち始めました。ジム・クロウ・サウスでは、私は法の下で何らかの保護を受けられますか？翌朝、私は逮捕されるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：为了补充更多细节。\n\n让我们假设3种不同的情况。\n\n1）我向空中开枪，让他们知道我有武器。\n\n2）我开枪并打伤了某人。我现在有自卫的证据吗？鲍勃只是\n巧合的是，昨天晚上我的肩膀中了一枪......。\n\n3）我开枪打死了一个三K党成员。我只是...",
      "title": "现在是半夜，三K党刚到我家，想搞破坏。我有携带武器的权利和自卫的权利，所以我开始爆炸。在吉姆-克劳南方，我有任何类型的法律保护吗？我是否会在第二天早上被捕？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：爲了補充更多細節。\n\n讓我們假設3種不同的情況。\n\n1）我向空中開槍，讓他們知道我有武器。\n\n2）我開槍並打傷了某人。我現在有自衛的證據嗎？鮑勃只是\n巧合的是，昨天晚上我的肩膀中了一槍......。\n\n3）我開槍打死了一個三K黨成員。我只是...",
      "title": "現在是半夜，三K黨剛到我家，想搞破壞。我有攜帶武器的權利和自衛的權利，所以我開始爆炸。在吉姆-克勞南方，我有任何類型的法律保護嗎？我是否會在第二天早上被捕？"
    }
  ]
}