{
  "author": "pseeena",
  "original_created_utc": 1638361460,
  "title": "Completely lost and devastated thinkinh i lost 2k usd somehow",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im feeling super bad and lost now and really need someone to help me find out where i did wrong or what is exactly happened to half of my assets during last couple of days events:\nSo i had 3050 CRO and 6.2mil VVS on my crypto com waller (basically all i have and couldn&amp;#39;t afford to lost it, simce im from 3rd world country. i know its the biggest mistake) , so then after some reading i decided to try mining with Cro-VVS liquidity pair on DeFi wallet\nSo i withdrawed all cro and vvs to cryptocom defi wallet\nAnd then put 1100cro and all 6.2mil VVS to farm with VVS finance on defi wallet, and left  like 1900cro on defi wallet. Everything was nice and clear at that point. \nSo after 2 days of farming i eraned like 45usd and decided to move everything back to my crypto com wallet because i was afraid something would go wrong with farming and it would be safer just sitting on crypto com wallet watching CRO go up\nSo what i did is unpair liquidity token cro-vvs and transferred all vvs to cro right there, and ended up with about 1950CRO  on VVS finance\nSo since this 1950cro was on cronos chain i swapped it back to crypto org on DeFi wallet, and should have ended up with (1900+1950) 3850 CRO on my DeFi wallet, instead it was 1976 CRO total on my wallet, i assumed something just didnt transferred yet or it is some bug, so i transferred all 1976 to crypto com app successfuly and started to wait for remaining CRO to drop on defi wallet\n7 hours past and i still have only  1976 cro on crypto com and nothing else anywhere else. So i left with half of all my money and i dont know how that could happened, dont know where i did wrong and where i fucked up so much, please guys i need your help&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/r6dl49/completely_lost_and_devastated_thinkinh_i_lost_2k/",
  "subreddit": "CryptoCurrency",
  "id": "r6dl49",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im feeling super bad and lost now and really need someone to help me find out\nwhere i did wrong or what is exactly happened to half of my assets during last\ncouple of days events: So i had 3050 CRO and 6.2mil VVS on my crypto com waller\n(basically all i have and couldn't afford to lost it, simce im…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は今超悪い感じと失われた、本当に私を見つけるために誰かの助けを必要としています。\nどこで間違ったのか、私の資産の半分に何が起こったのか、この間\n数日前の出来事です。crypto com wallerに3050 CROと620万VVSがありました。\n(基本的に私の全財産で、それを失うわけにはいかなかったので、私は...)",
      "title": "2,000米ドルを失ったことを考えると、完全に失われ、ショックを受けています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在感觉非常糟糕和迷茫，真的需要有人帮助我找出\n我在哪里做错了，或者我的一半资产在去年的时候到底发生了什么？\n几天的事件。因此，我的加密货币网络壁垒上有3050个CRO和6.2百万VVS\n(我有3050个CRO和6.2百万VVS（基本上是我所有的，我不能失去它，因为我...",
      "title": "完全迷失了方向，觉得自己莫名其妙地损失了2千美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在感覺非常糟糕和迷茫，真的需要有人幫助我找出\n我在哪裏做錯了，或者我的一半資產在去年的時候到底發生了什麼？\n幾天的事件。因此，我的加密貨幣網絡壁壘上有3050個CRO和6.2百萬VVS\n(我有3050個CRO和6.2百萬VVS（基本上是我所有的，我不能失去它，因爲我...",
      "title": "完全迷失了方向，覺得自己莫名其妙地損失了2千美元。"
    }
  ]
}