{
  "author": "donemessedup123",
  "the_new_excerpt": "Hello everyone,\n\nI am posting here since it was removed from r/investing\n[https://www.reddit.com/r/investing/]. I apologize to the mods if this is the\nright content for this sub.\n\nWith the popularity of stock trading at an all-time high, I just wanted to give\na small PSA and a note about my…",
  "original_created_utc": 1622218745,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんこんにちは。\n\nr/investingから削除されたので、こちらに投稿します。\n[https://www.reddit.com/r/investing/]から削除されました。もしこれがこのサブにふさわしい内容であれば、モデレーターの方にお詫びします。\nこれがこのサブにふさわしい内容であれば、modsに謝罪します。\n\n株取引の人気がかつてないほど高まっている中で、私はただ、小さなPSAと、私の...\n私はただ、小さなPSAと私の...についてのメモをしたかったのです。",
      "title": "株のディスコードに要注意"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我在这里发帖，因为它被从r/investing删除了\n[https://www.reddit.com/r/investing/]。如果这是在这个子目录下的正确内容，我向管理员表示歉意。\n的内容。\n\n随着股票交易的普及，我只是想给\n小小的公益广告，并说明我的...",
      "title": "警惕股票的不和谐因素"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我在這裏發帖，因爲它被從r/investing刪除了\n[https://www.reddit.com/r/investing/]。如果這是在這個子目錄下的正確內容，我向管理員表示歉意。\n的內容。\n\n隨着股票交易的普及，我只是想給\n小小的公益廣告，並說明我的...",
      "title": "警惕股票的不和諧因素"
    }
  ],
  "title": "Be wary of stock discords",
  "created_utc": 1622233705,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone,</p>\n\n<p>I am posting here since it was removed from <a href=\"https://www.reddit.com/r/investing/\">r/investing</a>. I apologize to the mods if this is the right content for this sub.</p>\n\n<p>With the popularity of stock trading at an all-time high, I just wanted to give a small PSA and a note about my experience joining stock trading groups on discord.</p>\n\n<p>Long story short, I have searched around a few different discords to join a community I could learn more about stocks and trading. I can say without a doubt, that the vast majority of them have the following scheme attached to it:</p>\n\n<ol>\n<li>Are pump and dumps where the admin, claiming to be an expert, will post a daily watchlist to encourage people to buy into stocks they already have a position in.</li>\n<li>Are setup to convince people they need to subscribe to daily video and &quot;secret advice&quot; in order to make a quick buck.</li>\n</ol>\n\n<p>Some of the people that run these discords are competent and I can see use manipulation tactics to come off as an authority on subject matters and encourage group think to forward the two objectives above. If you understand and learn the fundamentals of investing, you can tell they lack substance, but people green to investing can easily be enticed.</p>\n\n<p>Be careful and research into communities you plan on joining. A few common red flags of toxic stock discords I have found include:</p>\n\n<ol>\n<li>Stocks recommendations that constantly change on a daily basis.</li>\n<li>Cult-like praise for public figures like Elon Musk.</li>\n<li>Using words and tactics to encourage group-think (Such as &quot;stock fam&quot; and encouraging the posting of daily profits).</li>\n<li>Due diligence that amounts to &quot;This company looks dope, they have a cool product,&quot; or &quot;Their product is the future&quot; without providing any knowledge of fundamentals, such as finance and balance sheet.</li>\n</ol>\n\n<p>This may sound silly, but there are people out there who are looking to capitalize hard on this craze. Some will come off as smart and can be charismatic. If you haven&#39;t read into the fundamentals of finance and investing, their advice looks very enticing.</p>\n\n<p>If you are looking for a community to join, be careful and always scrutinize people&#39;s suggestions.</p>\n</div><!-- SC_ON -->",
  "score": 250,
  "permalink": "/r/stocks/comments/nn1f5a/be_wary_of_stock_discords/",
  "subreddit": "stocks",
  "id": "nn1f5a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300248
}