{
  "author": "xBeliscao",
  "original_created_utc": 1631684511,
  "title": "Its normal to cry when you dont understand the class on college?",
  "created_utc": 1631712424,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My teacher gave to us a exercise to do and i was stuck on the second problem for 50 mins and couldn&#39;t solve it. Only solved the first question because a friend helped me.</p>\n\n<p>After i realized 50 mins has passed and i didnt made any progress. i just got really angry and started crying because the exams are coming soon.</p>\n\n<p>Its normal to cry or get really Angry for something like this? Or i am just a weak minded person?</p>\n\n<p>Sorry for the bad english. Dont know some words translated to english from my first language</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/pok1ei/its_normal_to_cry_when_you_dont_understand_the/",
  "subreddit": "NoStupidQuestions",
  "id": "pok1ei",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My teacher gave to us a exercise to do and i was stuck on the second problem for\n50 mins and couldn't solve it. Only solved the first question because a friend\nhelped me.\n\nAfter i realized 50 mins has passed and i didnt made any progress. i just got\nreally angry and started crying because the exams…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先生が問題を出してくれたのですが、私は2つ目の問題で50分も悩んでしまい、解けませんでした。\n50分ほど悩んだのですが、解けませんでした。友達が助けてくれたので、1つ目の問題だけは解けました。\n友達が助けてくれたからです。\n\n気がついたら50分経っていて、何も進んでいませんでした。\n本当に腹が立って、泣き出してしまいました。",
      "title": "大学の授業で理解できないときに泣くのは当たり前？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的老师给我们布置了一道练习题，我在第二道题上卡了50分钟。\n50分钟，都没能解决。只解决了第一个问题，因为一个朋友\n帮助了我。\n\n当我意识到50分钟已经过去了，我却没有任何进展。\n我非常生气并开始哭，因为考试...",
      "title": "当你不明白大学的课程时，哭是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的老師給我們佈置了一道練習題，我在第二道題上卡了50分鐘。\n50分鐘，都沒能解決。只解決了第一個問題，因爲一個朋友\n幫助了我。\n\n當我意識到50分鐘已經過去了，我卻沒有任何進展。\n我非常生氣並開始哭，因爲考試...",
      "title": "當你不明白大學的課程時，哭是正常的嗎？"
    }
  ]
}