{
  "author": "TheGreenAlchemist",
  "original_created_utc": 1649455812,
  "title": "When and why did Zoroastrianism stop accepting converts?",
  "created_utc": 1649493497,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a religion started by a charismatic founder, one would assume it was originally vigorously proselytized and spread mainly through conversion. Nowadays, there is a policy that not only are converts not accepted, but &lt;em&gt;both&lt;/em&gt; parents have to Zoroastrian for their children to be raised as such. This is causing inevitable dwindling of the community. How did what seems like such a counterproductive state of affairs come to be?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/tzeojd/when_and_why_did_zoroastrianism_stop_accepting/",
  "subreddit": "AskHistorians",
  "id": "tzeojd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a religion started by a charismatic founder, one would assume it was\noriginally vigorously proselytized and spread mainly through conversion.\nNowadays, there is a policy that not only are converts not accepted, but both\nparents have to Zoroastrian for their children to be raised as such. This…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カリスマ的な創始者によって始められた宗教であることから、そのような宗教であったと推測されます。\n元々は精力的な布教活動で、主に改宗によって広まっていった。\n現在では、改宗者を受け入れないだけでなく、両者とも改宗する方針がある。\n子供をゾロアスター教徒として育てるには、両親がゾロアスター教徒でなければなりません。これは...",
      "title": "ゾロアスター教はいつから、なぜ改宗者を受け入れなくなったのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个由有魅力的创始人发起的宗教，人们会认为它是\n最初是大力宣传，主要通过改变信仰来传播。\n如今，有一项政策，不仅不接受皈依者，而且父母双方都要\n父母都必须是拜火教徒，他们的孩子才能以拜火教徒的身份长大。这...",
      "title": "琐罗亚斯德教何时以及为何停止接受皈依者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個由有魅力的創始人發起的宗教，人們會認爲它是\n最初是大力宣傳，主要通過改變信仰來傳播。\n如今，有一項政策，不僅不接受皈依者，而且父母雙方都要\n父母都必須是拜火教徒，他們的孩子才能以拜火教徒的身份長大。這...",
      "title": "瑣羅亞斯德教何時以及爲何停止接受皈依者？"
    }
  ]
}