{
  "author": "BADMANIV",
  "original_created_utc": 1625660181,
  "title": "Is a feeling of loss of freedom normal in a relationship?",
  "created_utc": 1625679602,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently moved in with my partner. I feel like I lost a huge amount of freedom in my life. I don’t even mean freedom in terms of sleeping with other people (that wasn’t happening anyway), but just little things. Her parents are in town? Better drop everything and go out to dinner with them. Her show is on? We gotta watch it. We have to agree on a time to sleep, when to clean, when to cook, my weekends aren’t free time any more it’s stuff we -have- to do together. Is this normal? Am I with the wrong person? Or does everyone just suck it up and this is part of being an adult and I’ll get used to it?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/ofhpwc/is_a_feeling_of_loss_of_freedom_normal_in_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "ofhpwc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently moved in with my partner. I feel like I lost a huge amount of freedom\nin my life. I don’t even mean freedom in terms of sleeping with other people\n(that wasn’t happening anyway), but just little things. Her parents are in town?\nBetter drop everything and go out to dinner with them. Her show…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、パートナーと一緒に住み始めました。人生の中で大きな自由を失ったような気がします。\n感じます。他の人と寝るという意味での自由ではありません。\n些細なことですが。彼女の両親が町にいる？\n何もかも捨てて、彼らと一緒に食事に行ったほうがいい。彼女のショー...",
      "title": "自由を失う感覚は、恋愛においては普通のことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近和我的伙伴搬到了一起。我觉得我失去了大量的自由\n在我的生活中。我甚至不是指与其他人睡觉方面的自由\n反正也没有发生），而只是一些小事。她的父母在城里？\n最好放下一切，和他们一起出去吃饭。她的节目...",
      "title": "在一段关系中，失去自由的感觉是否正常？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近和我的夥伴搬到了一起。我覺得我失去了大量的自由\n在我的生活中。我甚至不是指與其他人睡覺方面的自由\n反正也沒有發生），而只是一些小事。她的父母在城裏？\n最好放下一切，和他們一起出去喫飯。她的節目...",
      "title": "在一段關係中，失去自由的感覺是否正常？"
    }
  ]
}