{
  "author": "Rude-Combination3500",
  "original_created_utc": 1625122838,
  "title": "I've a Fiat Mining Job and I absolutely hate it",
  "created_utc": 1625132467,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m a Computer Science Student in a third world country and for paying my tution fees, I have to do a internship which is my fiat mining job and I absolutely hate it. \nFew days ago, I found out that 5 Moons per hour is minimum wage in my country and I can get the moons just by interacting with the community which is amazing and I absolutely love it. </p>\n\n<p>From now on I&#39;m gonna start posting content and start this new job farming moons. \nI promise I won&#39;t shitpost or just put the same stories and links again and again but I would post something meaningful and beneficial to the community. </p>\n\n<p>Thanks for hearing my self-story. </p>\n\n<p>TLDR; I&#39;m gonna start posting and earning moons to pay my tution fees.</p>\n\n<p>Edit: Don&#39;t worry I won&#39;t be leaving my current job and will continue posting.</p>\n</div><!-- SC_ON -->",
  "score": 427,
  "permalink": "/r/CryptoCurrency/comments/obg99h/ive_a_fiat_mining_job_and_i_absolutely_hate_it/",
  "subreddit": "CryptoCurrency",
  "id": "obg99h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I'm a Computer Science Student in a third world country and for paying my\ntution fees, I have to do a internship which is my fiat mining job and I\nabsolutely hate it. Few days ago, I found out that 5 Moons per hour is minimum\nwage in my country and I can get the moons just by interacting with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は第三世界の国でコンピューターサイエンスを専攻しています。\nフィアットマイニングの仕事であるインターンシップをしなければなりません。\n絶対に嫌なんです。数日前、私の国では時給5ムーンが最低賃金だということがわかりました。\n私の国では時給5ムーンが最低賃金であり、私はそのムーンを人と交流するだけで手に入れることができます...",
      "title": "私はフィアットマイニングの仕事をしていますが、絶対に嫌です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个第三世界国家的计算机科学学生，为了支付我的学费，我必须做一份实习，也就是我的法币开采工作。\n为了支付学费，我必须做一份实习，这是我的法币挖矿工作，我绝对讨厌它。\n我绝对讨厌它。几天前，我发现每小时5个月是我们国家的最低工资标准。\n在我的国家，每小时5个月的工资是最低的，而且我可以通过与人打交道来获得这些月的工资......",
      "title": "我有一份菲亚特采矿工作，我绝对讨厌它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個第三世界國家的計算機科學學生，爲了支付我的學費，我必須做一份實習，也就是我的法幣開採工作。\n爲了支付學費，我必須做一份實習，這是我的法幣挖礦工作，我絕對討厭它。\n我絕對討厭它。幾天前，我發現每小時5個月是我們國家的最低工資標準。\n在我的國家，每小時5個月的工資是最低的，而且我可以通過與人打交道來獲得這些月的工資......",
      "title": "我有一份菲亞特採礦工作，我絕對討厭它"
    }
  ]
}