{
  "author": "LZ_OtHaFA",
  "the_new_excerpt": "I've been saying \"Thank You\" for now, not sure how much longer that is going to\nfly. She is 19 years younger than me, I am not sure if it is age, I just know I\ndo not share the same feelings. When we go out she orders a lot of shots and\nthen the I love you's start flying. I am trying to help her not…",
  "original_created_utc": 1610972354,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我现在一直在说 \"谢谢\"，不知道还要说多久。\n飞。她比我小19岁，我不知道是不是年龄的问题，我只知道我。\n不一样的感觉。当我们出去的时候，她点了很多酒，而且。\n然后，我爱你的开始飞。我是想帮她，而不是... ...",
      "title": "当这种感觉不是相互的，你会如何回应/反应 \"我爱你\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在一直在說 \"謝謝\"，不知道還要說多久。\n飛。她比我小19歲，我不知道是不是年齡的問題，我只知道我。\n不一樣的感覺。當我們出去的時候，她點了很多酒，而且。\n然後，我愛你的開始飛。我是想幫她，而不是... ...",
      "title": "當這種感覺不是相互的，你會如何迴應/反應 \"我愛你\"？"
    }
  ],
  "title": "How do you respond/react to \"I love you\" when the feeling is not mutual?",
  "created_utc": 1610985205,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been saying &quot;Thank You&quot; for now, not sure how much longer that is going to fly. She is 19 years younger than me, I am not sure if it is age, I just know I do not share the same feelings. When we go out she orders a lot of shots and then the I love you&#39;s start flying. I am trying to help her not drink as much, getting her to drink some water before doing her 3rd shot but she is stubborn. She does not drink that much otherwise, only when we seem to go out.</p>\n\n<p>-------</p>\n\n<p>Adding a little more context from one of my replies:</p>\n\n<p>She&#39;s always drunk when she says it. I don&#39;t see a problem dating people with the end goal not being married, I have no interest in getting married or having kids. To add a little more clarity, she splits rent with her ex-boyfriend who no longer lives in the apartment. I told her to move out since he has been known to show up there causing her to couch surf, she wants nothing to do with him. Until she sorts that part of her life out, she won&#39;t be hearing those 3 little words from me. </p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/AskMen/comments/kztm7d/how_do_you_respondreact_to_i_love_you_when_the/",
  "subreddit": "AskMen",
  "id": "kztm7d",
  "is_self": true,
  "media": null,
  "is_video": false
}