{
  "author": "Welpe",
  "original_created_utc": 1633591973,
  "title": "What drugs would've been available to Jesus of Nazareth?",
  "created_utc": 1633627017,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got distracted in the recent post here about Hippies and one of the linked articles quoting a Bishop who compared Hippies to the early Christians, and among other things that made me wonder about drug use in the levant around the 1st century CE.</p>\n\n<p>For the sake of argument, lets say the comparison to hippies was far more accurate than we expected and Jesus and his disciples were looking for an altered state of mind.  What drugs would they have access to?  Alcohol is obvious, and opium seems likely given the proximity to modern day poppy-growing areas, but what else would be available?</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/AskHistorians/comments/q33w6f/what_drugs_wouldve_been_available_to_jesus_of/",
  "subreddit": "AskHistorians",
  "id": "q33w6f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I got distracted in the recent post here about Hippies and one of the linked\narticles quoting a Bishop who compared Hippies to the early Christians, and\namong other things that made me wonder about drug use in the levant around the\n1st century CE.\n\nFor the sake of argument, lets say the comparison…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヒッピーについての最近の投稿に気を取られ、リンクされている記事の一つである\nヒッピーを初期のキリスト教徒と比較した司教の記事を引用していました。\nその中で、紀元1世紀頃のレバントでの薬物使用について考えさせられました。\n1世紀頃のレバントでの薬物使用について考えてみました。\n\n議論のために、仮にその比較が...",
      "title": "ナザレのイエスにはどんな薬があっただろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在最近关于嬉皮士的帖子中走神了，其中一篇链接\n有一篇文章引用了一位主教的话，他把嬉皮士比作早期的基督徒，而\n在其他一些事情中，这让我想知道在公元前后的levant地区使用毒品的情况。\n西元1世纪左右的levant的毒品使用情况。\n\n为了便于讨论，我们假设这个比较...",
      "title": "拿撒勒人耶稣能得到什么药物？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在最近關於嬉皮士的帖子中走神了，其中一篇鏈接\n有一篇文章引用了一位主教的話，他把嬉皮士比作早期的基督徒，而\n在其他一些事情中，這讓我想知道在公元前後的levant地區使用毒品的情況。\n西元1世紀左右的levant的毒品使用情況。\n\n爲了便於討論，我們假設這個比較...",
      "title": "拿撒勒人耶穌能得到什麼藥物？"
    }
  ]
}