{
  "author": "sgtslaughterTV",
  "original_created_utc": 1636387225,
  "title": "Reminder guys: This sub is not wallstreetbets or cryptomoonshots. We are doing our best to maintain peace, stability, and quality discussion.",
  "created_utc": 1636400300,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not going to lie, these past 12 hours have been pretty crazy. I think a conservative estimate of how many posts I had to moderate, remove, or approve manually has surpassed 300. However, that might be because I am also a moderator of <a href=\"/r/NFT\">/r/NFT</a>.               </p>\n\n<p>Reminder: Please be civil to one another. It is mentally taxing to think to one self, &quot;alright, let&#39;s try to play a game of hearthstone and hope things don&#39;t go crazy.&quot; and then 20 minutes later see my modque full of 50-something items for me to clean up some of which are users at each other&#39;s throats, figuratively speaking, in a thread.                </p>\n\n<p>As far as political topics are concerned, we think that so long as the topic at hand is being discussed is crypto related, then that&#39;s just fine.               </p>\n\n<p>We do not need the sub being flooded with discussion of one and only one coin, or a circle jerk of attacks towards another. My own personal thoughts are that if you an owner of any coin, any coin at all, then you are subject to centralization, on one level or another, to that coin. Using bitcoin as an example, for the longest time 60% of the hashrate was all in one province in China at one point and while the present situation is not ideal, it&#39;s better than before.                </p>\n\n<p>Be kind to one another, guys. Thanks.              </p>\n\n<p>-Sarge.</p>\n</div><!-- SC_ON -->",
  "score": 251,
  "permalink": "/r/CryptoCurrency/comments/qpgm00/reminder_guys_this_sub_is_not_wallstreetbets_or/",
  "subreddit": "CryptoCurrency",
  "id": "qpgm00",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not going to lie, these past 12 hours have been pretty crazy. I think a\nconservative estimate of how many posts I had to moderate, remove, or approve\nmanually has surpassed 300. However, that might be because I am also a moderator\nof /r/NFT.\n\nReminder: Please be civil to one another. It is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直に言うと、この12時間はかなりクレイジーな時間でした。控えめに見積もっても\n控えめに見積もっても、手動でモデレート、削除、承認しなければならなかった投稿の数は\n300件を超えたと思います。しかし、それは私が/r/NFTのモデレーターでもあるからかもしれません。\nのモデレーターでもあるからかもしれません。\n\n思い出してください。お互いに礼儀正しくしてください。それは...",
      "title": "リマインダーの皆さん このサブはwallstreetbetsやcryptomoonshotsではありません。私たちは、平和、安定、そして質の高い議論を維持するために最善を尽くしています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不打算撒谎，过去的12个小时是非常疯狂的。我想\n保守估计，有多少帖子是我不得不手动调节、删除或批准的？\n人工操作的帖子已经超过了300个。然而，这可能是因为我也是/r/NFT的版主。\n/r/NFT的版主。\n\n提醒一下。请大家彼此文明相处。它是...",
      "title": "提醒各位。这个子项目不是华尔街赌城或加密月球射击。我们正在尽最大努力维持和平、稳定和高质量的讨论。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不打算撒謊，過去的12個小時是非常瘋狂的。我想\n保守估計，有多少帖子是我不得不手動調節、刪除或批准的？\n人工操作的帖子已經超過了300個。然而，這可能是因爲我也是/r/NFT的版主。\n/r/NFT的版主。\n\n提醒一下。請大家彼此文明相處。它是...",
      "title": "提醒各位。這個子項目不是華爾街賭城或加密月球射擊。我們正在盡最大努力維持和平、穩定和高質量的討論。"
    }
  ]
}