{
  "author": "throwawaymeplease45",
  "original_created_utc": 1646286975,
  "title": "I don’t want to die, I just want to disappear for awhile How would I do that?",
  "created_utc": 1646311750,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m about to turn 25 on Saturday and I want to turn and run and be on my own with no contact with anyone I know. When I say run I mean run like overnight without saying a word to anybody. I’d obviously send out reassurance letters to my parents so they are not worried but that’s as far as I want it to go. I’m child/ spouse free. I have a full time retail job that I could get anywhere if I just up and quit just to leave. I’m tired of people not giving a damn about me only when they need something from me. I won’t lie, my mental health is lacking lately and I feel this urge that if I turn and run I’ll feel happier. Travel has been in my hindsight for awhile now and it feels like it’s time. No this is not a suicidal thing, I do not want to kill myself, harm myself if any way shape or form. I just feel caught in this constant cycle of shit and life’s just a ritual. Same shit different day and I need something more. This life is too short to waste it living this way. How would I go about it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/t5kn65/i_dont_want_to_die_i_just_want_to_disappear_for/",
  "subreddit": "TooAfraidToAsk",
  "id": "t5kn65",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m about to turn 25 on Saturday and I want to turn and run and be on my own\nwith no contact with anyone I know. When I say run I mean run like overnight\nwithout saying a word to anybody. I’d obviously send out reassurance letters to\nmy parents so they are not worried but that’s as far as I want it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "土曜日に25歳になるんだけど、もうそろそろ一人前になりたいんだ。\n誰とも接触することなく 走るというのは、一晩中走るということです\n誰にも何も言わずに。もちろん、安心させるための手紙は出しますよ。\n親が心配しないように、そこまではいいのですが......。",
      "title": "死にたくない、しばらく消えていたい......どうしたらいいんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我周六就要满25岁了，我想转身就跑，自己一个人呆着。\n与我认识的任何人都不联系。当我说跑步时，我的意思是像通宵一样跑步\n不跟任何人说一句话。我显然会向我的父母发出保证信。\n这样他们就不会担心了，但这是我最想做的事情......",
      "title": "我不想死，我只想消失一段时间，我怎么做呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我週六就要滿25歲了，我想轉身就跑，自己一個人待著。\n與我認識的任何人都不聯繫。當我說跑步時，我的意思是像通宵一樣跑步\n不跟任何人說一句話。我顯然會向我的父母發出保證信。\n這樣他們就不會擔心了，但這是我最想做的事情......",
      "title": "我不想死，我只想消失一段時間，我怎麼做呢？"
    }
  ]
}