{
  "author": "OmeletteDuMeme",
  "original_created_utc": 1634553385,
  "title": "Which is more environmentally worst? Throwing my Mayo jar in the thrash OR use a ton of water to rinse it up?",
  "created_utc": 1634565339,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mean sure putting it in the recycle bin after being rinsed seems better but think of all that water you use just for ONE jar. If you do that for ketchup, peanut butter etc. How much water we wasting on that and how to be sure we rinsed it enough for the guy at Triage to not throw it away anyway...</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/qak1a8/which_is_more_environmentally_worst_throwing_my/",
  "subreddit": "NoStupidQuestions",
  "id": "qak1a8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I mean sure putting it in the recycle bin after being rinsed seems better but\nthink of all that water you use just for ONE jar. If you do that for ketchup,\npeanut butter etc. How much water we wasting on that and how to be sure we\nrinsed it enough for the guy at Triage to not throw it away anyway...",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "洗い流した後にゴミ箱に入れる方が良いとは思いますが\n1つの瓶のために使う水の量を考えてみてください。ケチャップやピーナッツバターなどにも同じことをしていたら\nケチャップやピーナッツバターなど そのためにどれだけの水を無駄にしているのか、どうやって十分にすすぎを行ったのかを確認してみましょう。\nトリアージの人が捨てないようにするには、どうすればいいんだろう...。",
      "title": "どちらがより環境に悪いでしょうか？マイヨ・ジョーヌの瓶をゴミ箱に捨てるのと、大量の水を使ってすすぐのとでは、どちらが環境に悪いでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，在冲洗后把它放进回收箱似乎更好，但是\n想想你为一个罐子用了那么多水。如果你对番茄酱、花生酱等也这样做的话。\n花生酱等。我们在这上面浪费了多少水，如何确保我们\n我们在这上面浪费了多少水，以及如何确保我们的冲洗足以让Triage的人不把它扔掉......",
      "title": "哪一个更不利于环保？把我的梅奥罐子扔进垃圾桶，还是用一吨水来冲洗它？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，在沖洗後把它放進回收箱似乎更好，但是\n想想你爲一個罐子用了那麼多水。如果你對番茄醬、花生醬等也這樣做的話。\n花生醬等。我們在這上面浪費了多少水，如何確保我們\n我們在這上面浪費了多少水，以及如何確保我們的沖洗足以讓Triage的人不把它扔掉......",
      "title": "哪一個更不利於環保？把我的梅奧罐子扔進垃圾桶，還是用一噸水來沖洗它？"
    }
  ]
}