{
  "author": "UnexperiencedIT",
  "original_created_utc": 1647938886,
  "title": "I am glad that Satoshi Nakamoto is anonymous and that suits the crypto world",
  "created_utc": 1647952928,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It has been seen and repeated many times here that we all saw some &amp;quot;cultish&amp;quot; behavior in the crypto world. &lt;/p&gt;\n\n&lt;p&gt;People who buy a certain coin or token, act as if it is the best thing in the world after Bitcoin, and their developers are worshipes more than the Gods.&lt;/p&gt;\n\n&lt;p&gt;Satoshi might be able to reveal himself, to let us all know who he/she/they is/are, but even if that happens, the legacy Satoshi created is indestructible even by him. &lt;/p&gt;\n\n&lt;p&gt;He realized that if he went public, he would be the target of many media attacks. Media is sometimes attacking Bitcoin but if they could they would find out every piece of detail in Satoshis life.&lt;/p&gt;\n\n&lt;p&gt;Satoshi being aware that this movement is bigger than one or a couple of people, Satoshi decided to remain anonymous, which is ingenious in itself.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin is the definition of complete decentralization. &lt;/p&gt;\n\n&lt;p&gt;Leader who made it left it to the people, there is no one in charge, the code works and can be upgraded if people decide so.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 401,
  "permalink": "/r/CryptoCurrency/comments/tjyii4/i_am_glad_that_satoshi_nakamoto_is_anonymous_and/",
  "subreddit": "CryptoCurrency",
  "id": "tjyii4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It has been seen and repeated many times here that we all saw some \"cultish\"\nbehavior in the crypto world.\n\nPeople who buy a certain coin or token, act as if it is the best thing in the\nworld after Bitcoin, and their developers are worshipes more than the Gods.\n\nSatoshi might be able to reveal…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで何度も繰り返されてきたことだが、私たちは皆、いくつかの \"カルト的 \"なものを見てきたのである。\n暗号の世界での行動。\n\nあるコインやトークンを購入した人々は、それがあたかも世界で最高のものであるかのように行動します。\nビットコインに次ぐ世界で、その開発者は神よりも崇拝される。\n\nサトシが明かすかもしれない...。",
      "title": "サトシ・ナカモトが匿名であることが暗号の世界に合っていて嬉しい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这里已经看到并重复了很多次，我们都看到了一些 \"邪教 \"的\n在加密世界的行为。\n\n购买某种硬币或代币的人，表现得好像它是继比特币之后世界上最好的东西。\n而他们的开发者比神还受人崇拜。\n\n中本聪也许能揭示...",
      "title": "我很高兴中本聪是匿名的，这很适合加密货币世界"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這裏已經看到並重復了很多次，我們都看到了一些 \"邪教 \"的\n在加密世界的行爲。\n\n購買某種硬幣或代幣的人，表現得好像它是繼比特幣之後世界上最好的東西。\n而他們的開發者比神還受人崇拜。\n\n中本聰也許能揭示...",
      "title": "我很高興中本聰是匿名的，這很適合加密貨幣世界"
    }
  ]
}