{
  "author": "DecoyReceptor",
  "original_created_utc": 1649797911,
  "title": "Fun pranks to do after getting brain surgery?",
  "created_utc": 1649826839,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m getting brain surgery soon, it&amp;#39;s pretty low risk and I&amp;#39;m not particularly worried, but some of my friends and family are making a bigger deal out of it than they need to. Of course I&amp;#39;m grateful that they care about me but sometimes it gets annoying to deal with their constant nervousness.&lt;/p&gt;\n\n&lt;p&gt;What are some fun ways to mess with them afterwards? Things like pretending not to know who they are, pretending to only speak a foreign language, etc&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/u29lj0/fun_pranks_to_do_after_getting_brain_surgery/",
  "subreddit": "NoStupidQuestions",
  "id": "u29lj0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm getting brain surgery soon, it's pretty low risk and I'm not particularly\nworried, but some of my friends and family are making a bigger deal out of it\nthan they need to. Of course I'm grateful that they care about me but sometimes\nit gets annoying to deal with their constant nervousness.\n\nWhat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "近々、脳の手術を受けるのですが、かなりリスクが低く、特に\nしかし、私の友人や家族の中には、このことを大きく取り上げている人がいます。\n必要以上に もちろん、心配してくれるのはありがたいのですが、ときどき\n常に神経質な彼らの相手をするのは、迷惑な話だ。\n\n何...",
      "title": "脳の手術を受けた後にする楽しいイタズラ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很快就要做脑部手术了，风险很低，我也不是特别担心。\n但我的一些朋友和家人却把它看得很重。\n比他们需要的要大。当然，我很感激他们对我的关心，但有时\n处理他们持续的紧张情绪会让人很烦。\n\n什么...",
      "title": "做完脑外科手术后的有趣恶作剧？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很快就要做腦部手術了，風險很低，我也不是特別擔心。\n但我的一些朋友和家人卻把它看得很重。\n比他們需要的要大。當然，我很感激他們對我的關心，但有時\n處理他們持續的緊張情緒會讓人很煩。\n\n什麼...",
      "title": "做完腦外科手術後的有趣惡作劇？"
    }
  ]
}