{
  "author": "mybed54",
  "the_new_excerpt": "I strongly believe ADA is over-hyped. Over the many years there were many\n\"Ethereum-killers\" that came out from NEO to EOS to Tezos. Each time people were\nsaying the same things like \"Yes, now this is definitely the one that will\nreplace Ethereum and I haven't missed the boat on it\" and guess what…",
  "original_created_utc": 1615425621,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我坚信ADA被过分夸大了。多年来，有许多\n从NEO到EOS再到Tezos的 \"Ethereum杀手\"，层出不穷。每次人们都\n说着同样的话，比如 \"是的，现在这绝对是一个将\n取代Ethereum，我没有错过它\"，你猜怎么着... ...",
      "title": "想知道真正的非议？ADA被夸大了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我堅信ADA被過分誇大了。多年來，有許多\n從NEO到EOS再到Tezos的 \"Ethereum殺手\"，層出不窮。每次人們都\n說着同樣的話，比如 \"是的，現在這絕對是一個將\n取代Ethereum，我沒有錯過它\"，你猜怎麼着... ...",
      "title": "想知道真正的非議？ADA被誇大了"
    }
  ],
  "title": "Want a real unpopular opinion? ADA is over-hyped",
  "created_utc": 1615433886,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I strongly believe ADA is over-hyped. Over the many years there were many &quot;Ethereum-killers&quot; that came out from NEO to EOS to Tezos. Each time people were saying the same things like &quot;Yes, now this is definitely the one that will replace Ethereum and I haven&#39;t missed the boat on it&quot; and guess what they never did. This is the boat I believe ADA is in. It isn&#39;t all just about the tech. Smart contracts are currently not as big in the world to the point where superior tech makes that big of a difference (hence why all the other &quot;Ethereum killers failed&quot; even with better tech). Ethereum has such a huge network effect as well as first-mover advantage where I can&#39;t see it getting flipped any time soon, especially with EIP 1559 coming out in July and ETH 2.0 being fully released (within a year?). At this point, most people/whales that are buying ETH are not in it for the tech but for what it is - the second most valued crypto (and generally more stable than the altcoins). Do I see ADA raising in value in the short-term or mid-term? Probably (assuming they deliver on what they say). Do I see it ever competing with ETH in the long term? Definitely not. Let the downvotes and hate comments commence, but hey you guys wanted a real unpopular opinion lol.</p>\n</div><!-- SC_ON -->",
  "score": 4041,
  "permalink": "/r/CryptoCurrency/comments/m2eg95/want_a_real_unpopular_opinion_ada_is_overhyped/",
  "subreddit": "CryptoCurrency",
  "id": "m2eg95",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574770
}