{
  "author": "MikeDaviesYo",
  "original_created_utc": 1649675800,
  "title": "I built a mobile app that allows developers, designers and data scientists to browse highly relevant tech jobs and companies without being spammed by recruiters",
  "created_utc": 1649683420,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Looking for a job as a tech professional is a nightmare. Constant LinkedIn spam, irrelevant job listings with zero context and shady recruiters at every turn.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve built a mobile app that matches you to UK tech jobs and companies based on your interests, values and tech stack.&lt;/p&gt;\n\n&lt;p&gt;You can check it out here: &lt;a href=\"https://haystack.app.link/haystack-app\"&gt;https://haystack.app.link/haystack-app&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Would love to hear any feedback!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/u15cit/i_built_a_mobile_app_that_allows_developers/",
  "subreddit": "SideProject",
  "id": "u15cit",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Looking for a job as a tech professional is a nightmare. Constant LinkedIn spam,\nirrelevant job listings with zero context and shady recruiters at every turn.\n\nI've built a mobile app that matches you to UK tech jobs and companies based on\nyour interests, values and tech stack.\n\nYou can check it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "技術職の職探しは悪夢です。LinkedInのスパムが絶えない。\n無関係な求人情報には脈絡がなく、怪しげなリクルーターも後を絶ちません。\n\n私は、英国の技術職と企業をマッチングさせるモバイルアプリを作りました。\nあなたの興味、価値観、技術スタック。\n\n確認することができます...",
      "title": "開発者、デザイナー、データサイエンティストが、リクルーターからスパムを受けることなく、関連性の高い技術職や企業を閲覧できるモバイルアプリを作りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个技术专业人员寻找工作是一场噩梦。不断的LinkedIn垃圾邮件。\n不相关的工作列表，没有任何背景，而且每次都有黑心的招聘人员。\n\n我已经建立了一个移动应用程序，根据你的兴趣、价值观和技术堆栈，为你匹配英国的技术工作和公司。\n你的兴趣、价值观和技术栈。\n\n你可以查看...",
      "title": "我建立了一个移动应用程序，使开发人员、设计师和数据科学家能够浏览高度相关的技术工作和公司，而不会被招聘人员的垃圾邮件所困扰。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個技術專業人員尋找工作是一場噩夢。不斷的LinkedIn垃圾郵件。\n不相關的工作列表，沒有任何背景，而且每次都有黑心的招聘人員。\n\n我已經建立了一個移動應用程序，根據你的興趣、價值觀和技術堆棧，爲你匹配英國的技術工作和公司。\n你的興趣、價值觀和技術棧。\n\n你可以查看...",
      "title": "我建立了一個移動應用程序，使開發人員、設計師和數據科學家能夠瀏覽高度相關的技術工作和公司，而不會被招聘人員的垃圾郵件所困擾。"
    }
  ]
}