{
  "author": "turnsyouon22",
  "original_created_utc": 1624978009,
  "title": "I (24F) feel like a bad b*tch compared to my boyfriend",
  "created_utc": 1624986271,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My boyfriend got into crypto around December of 2020, and he decided to put a large sum of his money in during the huuuuge run we had earlier in the year. His strategy was to put a few thousand in and watch the charts meticulously every few seconds. I even saw him swing trading and swapping coins, so I decided to learn everything I could about crypto and see if he was getting &quot;scammed.&quot; </p>\n\n<p>I learned a lot. I convinced him to not buy tether, watched him tell our friends to buy doge coin, and saw him put lump sums into BTC and BITCOIN CASH and I tried to hold my breath. </p>\n\n<p>At this point (around April) I thought, hey, I know a little bit now, time to start my portfolio. I did something different than him, and put 25 dollars in each week. He kind of made a little fun of me, said it was &quot;cute&quot; that I was investing and trying, and also said it was kinda pointless to put that little amount of money in. </p>\n\n<p>Then came the &quot;crash&quot; that I was completely prepared for and mentally ready to see, and I just ... continued to put in my money weekly. He &quot;no longer wanted to talk crypto as much&quot; and stopped putting in money because all of his was already invested. </p>\n\n<p>I am proud to say that as of today (because I started building with one coin vs. His 10-15) ...</p>\n\n<p>MY BITCOIN IS WORTH MORE THAN HIS!</p>\n\n<p>Edit: for you weirdos saying I&#39;m in a toxic relationship .... have a drink</p>\n</div><!-- SC_ON -->",
  "score": 1456,
  "permalink": "/r/CryptoCurrency/comments/oa9qvt/i_24f_feel_like_a_bad_btch_compared_to_my/",
  "subreddit": "CryptoCurrency",
  "id": "oa9qvt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My boyfriend got into crypto around December of 2020, and he decided to put a\nlarge sum of his money in during the huuuuge run we had earlier in the year. His\nstrategy was to put a few thousand in and watch the charts meticulously every\nfew seconds. I even saw him swing trading and swapping coins,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の彼氏は、2020年の12月頃に暗号に興味を持ち、年初の大暴落時に大金を投入することを決めました。\nその年の初めに起きた大暴落の時に大金を投入することにしました。彼の\n彼の戦略は、数千ドルを投入して、数秒ごとにチャートを注意深く観察することでした。\nでした。スイングトレードをしたり、コインを入れ替えたりしているのを見たこともありますが...。",
      "title": "私（24F）は、彼氏と比べて悪い女だと感じています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的男朋友在2020年12月左右开始接触加密货币，他决定在年初的大涨中投入一大笔资金。\n他决定在今年早些时候的大涨中投入一大笔钱。他的\n他的策略是投入几千美元，每隔几秒钟就仔细观察图表。\n几秒钟。我甚至看到他进行波段交易和交换硬币，...",
      "title": "与我的男朋友相比，我（24F）觉得自己是个坏女人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的男朋友在2020年12月左右開始接觸加密貨幣，他決定在年初的大漲中投入一大筆資金。\n他決定在今年早些時候的大漲中投入一大筆錢。他的\n他的策略是投入幾千美元，每隔幾秒鐘就仔細觀察圖表。\n幾秒鐘。我甚至看到他進行波段交易和交換硬幣，...",
      "title": "與我的男朋友相比，我（24F）覺得自己是個壞女人"
    }
  ]
}