{
  "author": "TeddyousGreg",
  "original_created_utc": 1628675838,
  "title": "An example of why we buy when there's blood in the streets",
  "created_utc": 1628699772,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve previously posted a strategy of a weighted DCA approach and thought I&#39;d share how it&#39;s been over the past two months. I&#39;ve modified it a little bit since but the general overview is</p>\n\n<p>- I have a minimum purchase amount each time I buy</p>\n\n<p>- The closer ETH price is to my predicted floor, the more I buy</p>\n\n<p>- Don&#39;t buy after two consecutive green days.</p>\n\n<p>- Put in a few optimistic buy orders that you think could be filled during a flash crash.</p>\n\n<p>Here&#39;s what my purchases looked like: (I&#39;ll convert prices to USD for our brothers over the pond)</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rhrjvpt18pg71.png?width=1920&amp;format=png&amp;auto=webp&amp;s=dc79763db4582d3b41dcbbd8724bce28f92e2f2d\">ETH Purchases</a></p>\n\n<p>Purchases were made between 16th June and 19th July.</p>\n\n<p>I made a few large purchases on 16/17/18th June to get the ball rolling on the portfolio. This was just in case ETH made a bull run and I had no skin in the game. I&#39;ll include these buys (even though they don&#39;t come from the strategy I&#39;ve employed) in the calculations.</p>\n\n<p>19 buy orders were made and filled, one of those being a larger optimistic order at £1359/$1876 which was filled on the 25th of June.</p>\n\n<p><strong>The average purchase price of my ETH holdings is £1451.73/$2004.55, which at a current price of $3235, is a 61.4% gain.</strong></p>\n\n<p><strong>Without the three large initial purchases that didn&#39;t come from my strategy, the average purchase price is £1390/$1919 and gave a gain of 68.58% at the current price of ETH.</strong></p>\n\n<p>There are a few reasons why this strategy works for me:</p>\n\n<p>- It removes emotion from the equation;</p>\n\n<p>- I can stick to it;</p>\n\n<p>- It is a strategy I have based on my past 4 years of experience in the markets.</p>\n\n<p>- It allows me to treat my investment like a business, not a hobby. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>TLDR;</strong></p>\n\n<p>- <strong>buy the dip</strong></p>\n\n<p>- <strong>buy more if it dip dips</strong></p>\n\n<p>- <strong>don’t FOMO in when prices are going up</strong></p>\n\n<p>- <strong>chill out and act methodically.</strong></p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/p29yoq/an_example_of_why_we_buy_when_theres_blood_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "p29yoq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've previously posted a strategy of a weighted DCA approach and thought I'd\nshare how it's been over the past two months. I've modified it a little bit\nsince but the general overview is\n\n- I have a minimum purchase amount each time I buy\n\n- The closer ETH price is to my predicted floor, the more I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前、重み付けされたDCAアプローチの戦略を投稿しました。\nこの2ヶ月間の様子をお伝えします。その後、少しずつ修正していますが\nしていますが、概要は以下の通りです。\n\n- 毎回、最低購入額を設定している\n\n- ETHの価格が私の予測した下限に近づけば近づくほど、私は...",
      "title": "血が流れている時に買う理由の一例"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我之前发布过一个加权DCA方法的策略，我想我应该分享一下过去两个月的情况。\n分享一下它在过去两个月的情况。我对它进行了一些修改\n但总体情况是\n\n- 我每次购买时都有一个最低购买量\n\n- ETH价格越接近我预测的底线，我就越...",
      "title": "一个例子说明为什么我们在街头流血的时候会买东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我之前發佈過一個加權DCA方法的策略，我想我應該分享一下過去兩個月的情況。\n分享一下它在過去兩個月的情況。我對它進行了一些修改\n但總體情況是\n\n- 我每次購買時都有一個最低購買量\n\n- ETH價格越接近我預測的底線，我就越...",
      "title": "一個例子說明爲什麼我們在街頭流血的時候會買東西"
    }
  ]
}