{
  "author": "homrqt",
  "original_created_utc": 1633268330,
  "title": "Monero is so completely private, the IRS has a $625,000 cash bounty out for anyone that can crack it",
  "created_utc": 1633275278,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you really value privacy, you may want to be holding some Monero (XMR). This token allows for completely private transactions, so much so that the federal government&#39;s IRS is convinced people are avoiding taxes with it and has issued a cash bounty of $625,000 for anyone that can hack the token to reveal any information on who uses it. So far, no one has claimed the prize. Other government agencies are also convinced that other illegal activities are being carried out with the token due to its anonynous nature. Do you believe a completely anonymous token has a valid place in the world?</p>\n</div><!-- SC_ON -->",
  "score": 484,
  "permalink": "/r/CryptoCurrency/comments/q0hx4v/monero_is_so_completely_private_the_irs_has_a/",
  "subreddit": "CryptoCurrency",
  "id": "q0hx4v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you really value privacy, you may want to be holding some Monero (XMR). This\ntoken allows for completely private transactions, so much so that the federal\ngovernment's IRS is convinced people are avoiding taxes with it and has issued a\ncash bounty of $625,000 for anyone that can hack the token to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、あなたが本当にプライバシーを重視するなら、Monero（XMR）を保有した方がいいかもしれません。この\nこのトークンは、完全にプライベートな取引を可能にします。\n連邦政府のIRSは、人々がこのトークンを使って租税回避をしていると確信しており、このトークンをハッキングできる人に62万5000ドルの賞金を出しています。\nトークンをハッキングして...62万5000ドルの賞金を出しています。",
      "title": "Moneroは完全に非公開なので、IRSはMoneroを解読できる人に62万5000ドルの賞金を出しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你真的重视隐私，你可能想持有一些Monero（XMR）。这种\n这种代币允许完全的私人交易，以至于联邦政府的国税局认为人们在用它来避税，并发布了一项禁令。\n以至于联邦政府的国税局确信人们在用它来避税，并发布了一个\n悬赏625,000美元给任何能够入侵该代币的人。",
      "title": "Monero是如此完全保密，美国国税局为能够破解它的人开出了62.5万美元的现金悬赏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你真的重視隱私，你可能想持有一些Monero（XMR）。這種\n這種代幣允許完全的私人交易，以至於聯邦政府的國稅局認爲人們在用它來避稅，併發布了一項禁令。\n以至於聯邦政府的國稅局確信人們在用它來避稅，併發布了一個\n懸賞625,000美元給任何能夠入侵該代幣的人。",
      "title": "Monero是如此完全保密，美國國稅局爲能夠破解它的人開出了62.5萬美元的現金懸賞。"
    }
  ]
}