{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "# With these rules as a foundation, I've personally made enough to live well off trading.\n\nDisclaimer: I am primarily focused on the volatility space because of a number of reasons, the most important being that I think there's lots of edge there for retail traders. \n\nThese are the beliefs I was lucky enough to learn from truly profitable traders. Ones who know how to go out there, find an edge and monetize it.\n\nI thought about the most important beliefs that I've seen held by successful retail and professional traders and used those to compile this list.\n\nAs you read, ask yourself if the way you approach trading embodies these principles.\n\nAlso, Some of you here will certainly disagree with me, and I invite discussion in the comments.\n\nI hope you enjoy!\n\n&#x200B;\n\n# 1) Know who’s lunch your eating\n\n\"***If you don't know whose lunch you're eating, you might just bite into a rock\".***\n\n&#x200B;\n\nA good trader always remembers that he is in a competition. For each dollar he earns, his competitor loses the equivalent amount. When he says cheap, his competitor says expensive.\n\nThere is no free lunch, so understand the motivation of your competitor.\n\nAn easy way to think about this: When you sell, someone buys.\n\nWho could it be? Why have they taken the opposite trade to you?\n\nJust as you have a reason for being in the trade, so do they. Knowing their motivations makes it clear if you are on the right side of the trade.\n\n&#x200B;\n\n# 2) Evidence over faith\n\n***\"If you think the math is unimportant, then you don't know the right math\".***\n\n&#x200B;\n\nWhen it comes to the building of wealth we must have confidence in the ideas we back with our capital. The Path to riches is not linear. Even the best strategies have drawdowns. Without a concrete plan it is easy to get lost.\n\nThis is why when you talk to the top traders in the world, they all look at trading as almost a science. They start by using their intuition + experiences to come up with an idea. They treat each idea as a hypothesis, and then they look for evidence to prove whether or not the idea is valid. Our strategy and trades need to be airtight, because once both are set we put a lot of trust and capital behind them.\n\nThis is not to say that evidence alone, or data alone will make you rich (or any money at all). Money is made by developing good ideas.\n\nBut it is hard to distinguish good or bad ideas without evidence.\n\nThink about it. *Why do most traders do the things they do?*\n\nUsually they either saw someone make money doing it, read it in a book, or made some money doing it themselves. *They have faith that it will work.*\n\nThe danger with this is that you could be on a hot streak in a losing game, or doing extra work for no extra reward. Casinos would not have a business if people never won.\n\nJust remember: Extraordinary claims require extraordinary evidence.\n\n&#x200B;\n\n# 3) Strategy over psychology\n\n***\"Often times, poor psychology is a symptom of poor strategy, not the other way around\"***\n\n&#x200B;\n\nIf you took the average NBA player and gave them the best sports psychologist in the world, there is a good chance that player could go on to become the best player in the league. But if you took that same sports psychologist and gave him to a random person, they wouldn’t even make the local high school team.\n\nThe reason? They don’t know how to play basketball. They can’t shoot, pass, dribble, etc.\n\nThe moral of the story is that without skill, psychology of this nature is useless. No amount of psychology can make up for a lack of skill.\n\nHere's an example:\n\nWho would win? A drunk roulette table dealer, or the most disciplined roulette player?\n\nI hope the answer is obvious, the roulette table dealer will win in the long run. It's because psychology doesn't change the fact that the dealer has an inherent edge over the gambler.\n\nThe gambler focuses on psychology because it is really all that is within his control. Fortunately as traders, that is not the case for us.\n\nAs a trader, our focus needs to be on strategy.\n\nThe most important thing to do as a trader is make sure you are playing a winning game.\n\n&#x200B;\n\n# 4) Methodology over outcome\n\n***\"Not every profitable trade is a good trade, and not every good trade is profitable\".***\n\n&#x200B;\n\nIf we put our entire focus on outcomes instead of methodology, we are destined for long term unprofitability.\n\nA good night at the casino does not make it a good source of income. A career has never been built at the roulette table. As we build our wealth, we need to pay attention to the means by which we are accumulating it. Is it sustainable?\n\nWise investors know why they make money. They understand their risks, rewards and long term payoff. They are confident in their trades because they know the possible outcomes before entering the position.\n\nYou'll know you are getting somewhere when you can look back at a losing trade and say to yourself \"I would have taken than trade again if I were in the same spot\".\n\nLike the casino, the games they play have positive expected value. They are in control.\n\n&#x200B;\n\n# 5) Live to see another day\n\n***\"Money comes to those who are skilled in handling it. Prove to yourself that you are responsible enough to grow it\".***\n\n&#x200B;\n\nMy friend asked a very successful portfolio manager what the secret sauce to profitable trading is. Here is the response he got:\n\n*“Most of the time, play tight to the vest. Make enough to live well, pay the overhead and keep the lights on. Then when a golden trade, an arbitrage or quasi arb comes around.. step on the gas. Borrow money if you can. Capitalize on it until the edge is gone. Because they always go away. Then go back to playing tight to the vest, and spend the rest of you time looking for the next arb. That's it. No secret sauce.”*\n\nMost of the time, our edge in the market is really small, and we need to play with that in mind. There will be variance (green days and red days), and by playing tight to the vest (not being loose with our money) make enough to do OK and preserve our capital for when a serious edge comes around.\n\nAnd when that serious edge comes around, we need to hit it. This is actually a mistake I sometimes see amongst very smart people who are too risk averse. But to reiterate, you need to know you have the edge to begin with.\n\nNow in your early days of trading, theres a lot to learn. A part of the learning process is making mistakes.\n\nBut in the market, mistakes are expensive. We know we are going to make mistakes along the way, so learn for the cheapest price. Play tight, trade small. Give yourself some margin for error.\n\nThe learning stops if you are out of the game.\n\nSide note: We need to trade according to our account size. The rules for managing a $5,000 account and a $50,000 account are the same. Account size is not an excuse for over leveraging.\n\n# \n\n# 6) Know your product\n\n**\"*****Money leaves the man who invests it in businesses or purposes with which he is not familiar or which are not approved by those skilled in its keep*****.\"**\n\n&#x200B;\n\n“I don’t know” is an acceptable starting point, but it is not an acceptable destination.\n\nTrading is a career. Doctors know how the human body works, mechanics know how cars work, electricians know how currents work. As option traders we need to know how options work.\n\nTop traders specialize in a specific product because they need to know it inside and out. They need to know exactly what their PnL will be given certain outcomes. That way, they can use the appropriate tool to take the bet.\n\n&#x200B;\n\n# 7) Know your edge\n\n**\"*****Businesses that know their edge, thrive. Those who don’t, die.*****\"**\n\n&#x200B;\n\nEvery good business has a competitive advantage. Something that separates them from their competitors and protects their slice of the market.\n\nThis is the same in trading. Knowing why you get paid is how you sleep well at night, trade through down swings, and come out on top. It is the most important metric to evaluate your business on.\n\nAs a trader, you are your own portfolio manager. You manage your fund. You should manage your money in the same way that you would manage the money of others, or in the same way that you would expect someone else to manage yours.\n\nWhen you know your edge, you know that you aren’t getting lucky. You can be confident, and forecast your returns into the future.\n\nYou can build a life off of it.\n\n&#x200B;\n\n# 8) The magic you’ve been looking for is in the work you’ve been avoiding\n\n**\"*****Success flees the man who follows the alluring advice of tricksters and schemers or who trusts it to his own inexperience and romantic desires in investment*****\".**\n\n&#x200B;\n\nA lot of us know what it takes to win, but we don’t want to do it.\n\nWe know what the winners are doing, but it’s not easy. So we look for a quick fix, a hack, a way to pull one over on the winners and come out on top.\n\nEveryone has dreams, and it is those who can still hold onto their dreams while confronting the challenges of their current reality that turn their dreams into reality.\n\nLearn the hard stuff. Look at what is happening outside of the retail world and understand why it's happening. As previously stated.. trading is a profession. You will have to learn things outside of your comfort zone. It will be frustrating and difficult at times.\n\nSuccess is only found by taking on the challenges that everyone else avoids. It’s by doing these things that you stand apart from the crowd.\n\nEveryone wants to win. Not everyone wants to become a winner.\n\nBe deserving.\n\n&#x200B;\n\n# 9) Respect yourself\n\n***\"Money can afford you the time. But it’s what you do with that time that dictates the quality of your life\".***\n\n&#x200B;\n\nWe trade so we can live better, not so we can sit around all doing nothing. We work hard so we can afford to spend time in the gym, cook good meals, being with our families, helping others.\n\nTake care of your body and mind. Become your own role model so that you can live well and inspire others.\n\nMoney won’t manifest these things.\n\n&#x200B;\n\n# 10) Love the game\n\n***\"Find something you love, and dedicate yourself to it\".***\n\n&#x200B;\n\nThere’s no shortcut to becoming a trader of Jim Simon’s caliber. It takes hard work and dedication. But more importantly, you have to love trading. And this is one thing you’ll find in common with all the best traders in the world. They just love the game.\n\nTop traders love the game, and will do nearly anything and everything to get better and achieve their goals.\n\n# \n\n# Conclusion\n\nIf you have questions or disagreements with any of these rules, I encourage discussion in the comments below. Just as with the other sections of this guide, I will be there to answer questions and join the discussion.\n\nHappy Trading\n\n\\~ AG",
  "author_fullname": "t2_bjb5f1tl",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "10 Rules for Trading Excellency From a Successful Retail Trader",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_q7fz6h",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.79,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 133,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 133,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1634145615,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>With these rules as a foundation, I&#39;ve personally made enough to live well off trading.</h1>\n\n<p>Disclaimer: I am primarily focused on the volatility space because of a number of reasons, the most important being that I think there&#39;s lots of edge there for retail traders. </p>\n\n<p>These are the beliefs I was lucky enough to learn from truly profitable traders. Ones who know how to go out there, find an edge and monetize it.</p>\n\n<p>I thought about the most important beliefs that I&#39;ve seen held by successful retail and professional traders and used those to compile this list.</p>\n\n<p>As you read, ask yourself if the way you approach trading embodies these principles.</p>\n\n<p>Also, Some of you here will certainly disagree with me, and I invite discussion in the comments.</p>\n\n<p>I hope you enjoy!</p>\n\n<p>&#x200B;</p>\n\n<h1>1) Know who’s lunch your eating</h1>\n\n<p>&quot;<strong><em>If you don&#39;t know whose lunch you&#39;re eating, you might just bite into a rock&quot;.</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>A good trader always remembers that he is in a competition. For each dollar he earns, his competitor loses the equivalent amount. When he says cheap, his competitor says expensive.</p>\n\n<p>There is no free lunch, so understand the motivation of your competitor.</p>\n\n<p>An easy way to think about this: When you sell, someone buys.</p>\n\n<p>Who could it be? Why have they taken the opposite trade to you?</p>\n\n<p>Just as you have a reason for being in the trade, so do they. Knowing their motivations makes it clear if you are on the right side of the trade.</p>\n\n<p>&#x200B;</p>\n\n<h1>2) Evidence over faith</h1>\n\n<p><strong><em>&quot;If you think the math is unimportant, then you don&#39;t know the right math&quot;.</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>When it comes to the building of wealth we must have confidence in the ideas we back with our capital. The Path to riches is not linear. Even the best strategies have drawdowns. Without a concrete plan it is easy to get lost.</p>\n\n<p>This is why when you talk to the top traders in the world, they all look at trading as almost a science. They start by using their intuition + experiences to come up with an idea. They treat each idea as a hypothesis, and then they look for evidence to prove whether or not the idea is valid. Our strategy and trades need to be airtight, because once both are set we put a lot of trust and capital behind them.</p>\n\n<p>This is not to say that evidence alone, or data alone will make you rich (or any money at all). Money is made by developing good ideas.</p>\n\n<p>But it is hard to distinguish good or bad ideas without evidence.</p>\n\n<p>Think about it. <em>Why do most traders do the things they do?</em></p>\n\n<p>Usually they either saw someone make money doing it, read it in a book, or made some money doing it themselves. <em>They have faith that it will work.</em></p>\n\n<p>The danger with this is that you could be on a hot streak in a losing game, or doing extra work for no extra reward. Casinos would not have a business if people never won.</p>\n\n<p>Just remember: Extraordinary claims require extraordinary evidence.</p>\n\n<p>&#x200B;</p>\n\n<h1>3) Strategy over psychology</h1>\n\n<p><strong><em>&quot;Often times, poor psychology is a symptom of poor strategy, not the other way around&quot;</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>If you took the average NBA player and gave them the best sports psychologist in the world, there is a good chance that player could go on to become the best player in the league. But if you took that same sports psychologist and gave him to a random person, they wouldn’t even make the local high school team.</p>\n\n<p>The reason? They don’t know how to play basketball. They can’t shoot, pass, dribble, etc.</p>\n\n<p>The moral of the story is that without skill, psychology of this nature is useless. No amount of psychology can make up for a lack of skill.</p>\n\n<p>Here&#39;s an example:</p>\n\n<p>Who would win? A drunk roulette table dealer, or the most disciplined roulette player?</p>\n\n<p>I hope the answer is obvious, the roulette table dealer will win in the long run. It&#39;s because psychology doesn&#39;t change the fact that the dealer has an inherent edge over the gambler.</p>\n\n<p>The gambler focuses on psychology because it is really all that is within his control. Fortunately as traders, that is not the case for us.</p>\n\n<p>As a trader, our focus needs to be on strategy.</p>\n\n<p>The most important thing to do as a trader is make sure you are playing a winning game.</p>\n\n<p>&#x200B;</p>\n\n<h1>4) Methodology over outcome</h1>\n\n<p><strong><em>&quot;Not every profitable trade is a good trade, and not every good trade is profitable&quot;.</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>If we put our entire focus on outcomes instead of methodology, we are destined for long term unprofitability.</p>\n\n<p>A good night at the casino does not make it a good source of income. A career has never been built at the roulette table. As we build our wealth, we need to pay attention to the means by which we are accumulating it. Is it sustainable?</p>\n\n<p>Wise investors know why they make money. They understand their risks, rewards and long term payoff. They are confident in their trades because they know the possible outcomes before entering the position.</p>\n\n<p>You&#39;ll know you are getting somewhere when you can look back at a losing trade and say to yourself &quot;I would have taken than trade again if I were in the same spot&quot;.</p>\n\n<p>Like the casino, the games they play have positive expected value. They are in control.</p>\n\n<p>&#x200B;</p>\n\n<h1>5) Live to see another day</h1>\n\n<p><strong><em>&quot;Money comes to those who are skilled in handling it. Prove to yourself that you are responsible enough to grow it&quot;.</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>My friend asked a very successful portfolio manager what the secret sauce to profitable trading is. Here is the response he got:</p>\n\n<p><em>“Most of the time, play tight to the vest. Make enough to live well, pay the overhead and keep the lights on. Then when a golden trade, an arbitrage or quasi arb comes around.. step on the gas. Borrow money if you can. Capitalize on it until the edge is gone. Because they always go away. Then go back to playing tight to the vest, and spend the rest of you time looking for the next arb. That&#39;s it. No secret sauce.”</em></p>\n\n<p>Most of the time, our edge in the market is really small, and we need to play with that in mind. There will be variance (green days and red days), and by playing tight to the vest (not being loose with our money) make enough to do OK and preserve our capital for when a serious edge comes around.</p>\n\n<p>And when that serious edge comes around, we need to hit it. This is actually a mistake I sometimes see amongst very smart people who are too risk averse. But to reiterate, you need to know you have the edge to begin with.</p>\n\n<p>Now in your early days of trading, theres a lot to learn. A part of the learning process is making mistakes.</p>\n\n<p>But in the market, mistakes are expensive. We know we are going to make mistakes along the way, so learn for the cheapest price. Play tight, trade small. Give yourself some margin for error.</p>\n\n<p>The learning stops if you are out of the game.</p>\n\n<p>Side note: We need to trade according to our account size. The rules for managing a $5,000 account and a $50,000 account are the same. Account size is not an excuse for over leveraging.</p>\n\n<h1>6) Know your product</h1>\n\n<p><strong>&quot;</strong><strong><em>Money leaves the man who invests it in businesses or purposes with which he is not familiar or which are not approved by those skilled in its keep</em></strong><strong>.&quot;</strong></p>\n\n<p>&#x200B;</p>\n\n<p>“I don’t know” is an acceptable starting point, but it is not an acceptable destination.</p>\n\n<p>Trading is a career. Doctors know how the human body works, mechanics know how cars work, electricians know how currents work. As option traders we need to know how options work.</p>\n\n<p>Top traders specialize in a specific product because they need to know it inside and out. They need to know exactly what their PnL will be given certain outcomes. That way, they can use the appropriate tool to take the bet.</p>\n\n<p>&#x200B;</p>\n\n<h1>7) Know your edge</h1>\n\n<p><strong>&quot;</strong><strong><em>Businesses that know their edge, thrive. Those who don’t, die.</em></strong><strong>&quot;</strong></p>\n\n<p>&#x200B;</p>\n\n<p>Every good business has a competitive advantage. Something that separates them from their competitors and protects their slice of the market.</p>\n\n<p>This is the same in trading. Knowing why you get paid is how you sleep well at night, trade through down swings, and come out on top. It is the most important metric to evaluate your business on.</p>\n\n<p>As a trader, you are your own portfolio manager. You manage your fund. You should manage your money in the same way that you would manage the money of others, or in the same way that you would expect someone else to manage yours.</p>\n\n<p>When you know your edge, you know that you aren’t getting lucky. You can be confident, and forecast your returns into the future.</p>\n\n<p>You can build a life off of it.</p>\n\n<p>&#x200B;</p>\n\n<h1>8) The magic you’ve been looking for is in the work you’ve been avoiding</h1>\n\n<p><strong>&quot;</strong><strong><em>Success flees the man who follows the alluring advice of tricksters and schemers or who trusts it to his own inexperience and romantic desires in investment</em></strong><strong>&quot;.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>A lot of us know what it takes to win, but we don’t want to do it.</p>\n\n<p>We know what the winners are doing, but it’s not easy. So we look for a quick fix, a hack, a way to pull one over on the winners and come out on top.</p>\n\n<p>Everyone has dreams, and it is those who can still hold onto their dreams while confronting the challenges of their current reality that turn their dreams into reality.</p>\n\n<p>Learn the hard stuff. Look at what is happening outside of the retail world and understand why it&#39;s happening. As previously stated.. trading is a profession. You will have to learn things outside of your comfort zone. It will be frustrating and difficult at times.</p>\n\n<p>Success is only found by taking on the challenges that everyone else avoids. It’s by doing these things that you stand apart from the crowd.</p>\n\n<p>Everyone wants to win. Not everyone wants to become a winner.</p>\n\n<p>Be deserving.</p>\n\n<p>&#x200B;</p>\n\n<h1>9) Respect yourself</h1>\n\n<p><strong><em>&quot;Money can afford you the time. But it’s what you do with that time that dictates the quality of your life&quot;.</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>We trade so we can live better, not so we can sit around all doing nothing. We work hard so we can afford to spend time in the gym, cook good meals, being with our families, helping others.</p>\n\n<p>Take care of your body and mind. Become your own role model so that you can live well and inspire others.</p>\n\n<p>Money won’t manifest these things.</p>\n\n<p>&#x200B;</p>\n\n<h1>10) Love the game</h1>\n\n<p><strong><em>&quot;Find something you love, and dedicate yourself to it&quot;.</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p>There’s no shortcut to becoming a trader of Jim Simon’s caliber. It takes hard work and dedication. But more importantly, you have to love trading. And this is one thing you’ll find in common with all the best traders in the world. They just love the game.</p>\n\n<p>Top traders love the game, and will do nearly anything and everything to get better and achieve their goals.</p>\n\n<h1>Conclusion</h1>\n\n<p>If you have questions or disagreements with any of these rules, I encourage discussion in the comments below. Just as with the other sections of this guide, I will be there to answer questions and join the discussion.</p>\n\n<p>Happy Trading</p>\n\n<p>~ AG</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "q7fz6h",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "AlphaGiveth",
  "discussion_type": null,
  "num_comments": 8,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/q7fz6h/10_rules_for_trading_excellency_from_a_successful/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/q7fz6h/10_rules_for_trading_excellency_from_a_successful/",
  "subreddit_subscribers": 3119592,
  "created_utc": 1634174119,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1634145615,
  "the_new_excerpt": "WITH THESE RULES AS A FOUNDATION, I'VE PERSONALLY MADE ENOUGH TO LIVE WELL OFF\nTRADING.\n\nDisclaimer: I am primarily focused on the volatility space because of a number\nof reasons, the most important being that I think there's lots of edge there for\nretail traders.\n\nThese are the beliefs I was lucky…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このルールを基本として、個人的には十分な生活費を稼いできました。\n取引をしています。\n\n免責事項：私が主にボラティリティーの分野に注目しているのは、いくつかの理由があります。\n最も重要な理由は、リテール・トレーダーにとってボラティリティには多くの利点があると考えているからです。\n最も重要な理由は、リテール・トレーダーのためのエッジがたくさんあると思うからです。\n\nこれらは、私が幸運にも手に入れた信念である。",
      "title": "成功したリテール・トレーダーが語る、卓越したトレーディングのための10のルール"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以这些规则为基础，我个人已经赚够了生活费。\n交易。\n\n免责声明：我主要关注的是波动性空间，原因有很多。\n的原因，最重要的是，我认为那里有很多优势，适合\n散户交易者的优势。\n\n这些是我的信念，我很幸运...",
      "title": "一个成功的零售交易员的10条卓越的交易规则"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以這些規則爲基礎，我個人已經賺夠了生活費。\n交易。\n\n免責聲明：我主要關注的是波動性空間，原因有很多。\n的原因，最重要的是，我認爲那裏有很多優勢，適合\n散戶交易者的優勢。\n\n這些是我的信念，我很幸運...",
      "title": "一個成功的零售交易員的10條卓越的交易規則"
    }
  ],
  "source_updated_at": 1634290793043
}