{
  "author": "JElba1987",
  "original_created_utc": 1634291932,
  "title": "NuCypher up 900%",
  "created_utc": 1634322638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Is there a predictable way of predicting these rises? I’m sick of waking up every morning and thinking FS.like that’s a ridiculous rise and it’s always the random coins. I know the crypto market is volatile and far from predictable, but if anyone has any insights they use to try and predict these massive daily rises please feel free to share. 900% is just ridiculous and would have been life changing even with a couple of thousand invested. I don’t know ruins my morning seeing it, going to be kicking myself all morning even though it’s something I could have never known.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/q8l6lx/nucypher_up_900/",
  "subreddit": "CryptoCurrency",
  "id": "q8l6lx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is there a predictable way of predicting these rises? I’m sick of waking up\nevery morning and thinking FS.like that’s a ridiculous rise and it’s always the\nrandom coins. I know the crypto market is volatile and far from predictable, but\nif anyone has any insights they use to try and predict these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この上昇を予測する方法はありますか？毎朝起きるのが嫌になるほど\n毎朝起きて、FS.これはとんでもない上昇だと思うし、それはいつも\nいつもランダムなコインです。暗号市場は変動が激しく、予測不可能なことはわかっています。\nもし誰かがこれらを予測するために使っている洞察力があれば...",
      "title": "NuCypherは900%増"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是否有一种可预测的方法来预测这些上涨？我已经厌倦了每次醒来时\n我厌倦了每天早上醒来，想着FS.like那是一个可笑的上涨，而且总是那些\n随机币。我知道加密货币市场很不稳定，远不能预测，但\n如果有人有任何见解，他们用来尝试和预测这些...",
      "title": "NuCypher上升900%"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是否有一種可預測的方法來預測這些上漲？我已經厭倦了每次醒來時\n我厭倦了每天早上醒來，想着FS.like那是一個可笑的上漲，而且總是那些\n隨機幣。我知道加密貨幣市場很不穩定，遠不能預測，但\n如果有人有任何見解，他們用來嘗試和預測這些...",
      "title": "NuCypher上升900%"
    }
  ]
}