{
  "author": "viet_huynh",
  "original_created_utc": 1625448279,
  "title": "How were languages translated for the first time, especially for purposes beyond basic conversation? Did some civilizations or nations have a particular method?",
  "created_utc": 1625463812,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Throughout history, especially during the Age of Exploration, there must have been plenty of times when two peoples met each other for the first time, and whose languages had never been translated to each other. How did scholars or ordinary citizens from both peoples go about understanding each other?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/odx656/how_were_languages_translated_for_the_first_time/",
  "subreddit": "AskHistorians",
  "id": "odx656",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Throughout history, especially during the Age of Exploration, there must have\nbeen plenty of times when two peoples met each other for the first time, and\nwhose languages had never been translated to each other. How did scholars or\nordinary citizens from both peoples go about understanding each…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史の中で、特に大航海時代には、二つの民族が初めて出会うことがたくさんあったはずです。\n互いに翻訳されていない言語を持つ2つの民族が初めて出会うことは、歴史上、特に大航海時代にはたくさんあったはずです。\n互いに翻訳されたことのない言語を持つ2つの民族が初めて出会うことは、歴史上たくさんあったはずです。両国の学者や一般市民は、どのようにして\n両国の学者や一般市民は、どのようにしてお互いを理解していったのでしょうか。",
      "title": "初めての言語は、特に基本的な会話以上の目的のために、どのように翻訳されたのでしょうか？文明や国家によっては、特定の方法があったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纵观历史，特别是在探索时代，一定有很多时候两个民族第一次相遇\n有很多时候，两个民族第一次相遇，而他们的语言从未被翻译给对方。\n他们的语言从来没有被翻译给对方。两个民族的学者或普通公民是如何\n两国人民的学者或普通公民如何去了解对方？",
      "title": "语言首次被翻译，特别是为了超出基本对话的目的，是如何被翻译的？一些文明或国家是否有特定的方法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "縱觀歷史，特別是在探索時代，一定有很多時候兩個民族第一次相遇\n有很多時候，兩個民族第一次相遇，而他們的語言從未被翻譯給對方。\n他們的語言從來沒有被翻譯給對方。兩個民族的學者或普通公民是如何\n兩國人民的學者或普通公民如何去了解對方？",
      "title": "語言首次被翻譯，特別是爲了超出基本對話的目的，是如何被翻譯的？一些文明或國家是否有特定的方法？"
    }
  ]
}