{
  "author": "RusticBohemian",
  "original_created_utc": 1655851356,
  "title": "How great of a blow to historians is the migration of letters and journals to the digital realm, where most of them are inaccessible to historians (locked email accounts, hard drives, etc)?",
  "created_utc": 1655869152,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just finished &amp;quot;Lincoln in the Bardo,&amp;quot; of which, probably about 1/3rd is historical written accounts from contemporaries of Lincoln. &lt;/p&gt;\n\n&lt;p&gt;Although many of these accounts disagree on particulars, I was blown away by the quality and quantity of the testimony. Many of these men and women wrote as well as modern journalists/novelists, giving rich descriptions of what things looked and felt like, what people said, etc. &lt;/p&gt;\n\n&lt;p&gt;I wonder to what extent many of these personal accounts have vanished from the modern era, and to what extent they&amp;#39;ve been replaced by accessible material that&amp;#39;s equally or more valuable.  &lt;/p&gt;\n\n&lt;p&gt;People rarely write letters today, and journaling isn&amp;#39;t as common as it once was. Emails are certainly a thing, and people write things and leave them on hard drives. But email accounts have passwords that heirs might not know, and hard drives get scrapped when computers are thrown out. Someone is unlikely to find their great grandfather&amp;#39;s emails like they once found his letters in the attic. &lt;/p&gt;\n\n&lt;p&gt;On the other hand, the proliferation of photos and videos must be giving historians a lot to work with, and that people might leave accounts in public places on the internet. &lt;/p&gt;\n\n&lt;p&gt;So what&amp;#39;s the consensus on how grievous a blow the digitization of material has been to historians?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/AskHistorians/comments/vhpqhh/how_great_of_a_blow_to_historians_is_the/",
  "subreddit": "AskHistorians",
  "id": "vhpqhh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just finished \"Lincoln in the Bardo,\" of which, probably about 1/3rd is\nhistorical written accounts from contemporaries of Lincoln.\n\nAlthough many of these accounts disagree on particulars, I was blown away by the\nquality and quantity of the testimony. Many of these men and women wrote as well\nas…"
}