{
  "author": "CalzerMalzer",
  "original_created_utc": 1629139316,
  "title": "The Ethereum triple halving and why ETH will easily overtake BTC in marketcap",
  "created_utc": 1629149584,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>So, why do I make such a confident claim as to why Ethereum will easily surpass BTC as the largest cryptocurrency by almost every metric including market cap? Simply put, its because the Ethereum selling pressure is going to reduce by as much as 90% – the equivalent of three Bitcoin halvenings in the span of 12 months. ETH will experience what is known as a triple halving, yes you read that right, a triple halving. To understand the triple halving of ETH we need to first understand what the BTC halving is:</p>\n\n<ul>\n<li>A Bitcoin halving event is when the reward for mining bitcoin transactions is cut in half.</li>\n<li>This event also cuts in half Bitcoin&#39;s inflation rate and the rate at which new bitcoins enter circulation.</li>\n<li>It is widely thought that all previous halvenings are closely correlated to the initiation of bull market cycles leading to much higher prices than previous cycles.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ya4ccg2yuqh71.png?width=1070&amp;format=png&amp;auto=webp&amp;s=cb05471edf3ba58045ef2534d2b377c4f5413c91\">https://preview.redd.it/ya4ccg2yuqh71.png?width=1070&amp;format=png&amp;auto=webp&amp;s=cb05471edf3ba58045ef2534d2b377c4f5413c91</a></p>\n\n<p>Ethereum will undergo a triple halving, or in other words, 50% * 50% * 50% = 12.5%, i.e. a 87.5% reduction in issuance which is the equivalent to 3 consecutive Bitcoin halving events. The upcoming Triple Halving will likely lead to a price explosion that I believe will allow ETH to easily overtake BTC in market cap. In this post I will discuss **two** key events that lead to the triple halving and why ETH will then easily overtake BTC as the most dominant crypto currency.</p>\n\n<ul>\n<li>The first event, and likely the least impactful of the three events will be caused by EIP-1559. On August 5th, EIP-1559 was passed, which means that 70% of the transaction fees in Ethereum will continually be burned. The more the network is used, the more fees will be burned. It is expected that with the deployment of EIP-1559, Ethereum would become net deflationary and stand at 2% negative annual issuance. In just one week over $100M of ETH was burned, this is insane. The drop in sell pressure represents a 30% reduction with the release of EIP-1559 which represent just over half of one BTC halving</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/cneo5zbzuqh71.png?width=853&amp;format=png&amp;auto=webp&amp;s=636dc44bcedbadf71323f6e2ba73c5e23ced28f1\">https://preview.redd.it/cneo5zbzuqh71.png?width=853&amp;format=png&amp;auto=webp&amp;s=636dc44bcedbadf71323f6e2ba73c5e23ced28f1</a></p>\n\n<ul>\n<li>The second (and very significant) cause would be the transition to Proof of Stake (POS) from Proof of Work (POW). To understand what this means we firstly need to understand Ethereum mining. As it stands, approximately 12,800 ETH (equivalent to $39,000,000) is rewarded to miners for running the Ethereum network and keeping it secure every day. Since ETH is still in a Proof of Work system most of this ETH is immediately dumped and sold into the market. Since the miners run a cash business, they need cash for electricity, equipment, paying investors etc. So everyday there is **at least** $39,000,000 worth of selling pressure for ETH each and every day. The implications for this transition means that ETH will go from a mine and dump economy (POW) to a stake and restake economy (POS). POS encourages saving as the more ETH you have the bigger your monetary benefit; this will not be for true all people as of course people will still sell a lot of ETH but most people will hold and restake their rewards as time goes by, enormously reducing sell pressure.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/2y8ue7j0vqh71.png?width=885&amp;format=png&amp;auto=webp&amp;s=c5767436475c53af3d23266a2edb01c4cfde5998\">https://preview.redd.it/2y8ue7j0vqh71.png?width=885&amp;format=png&amp;auto=webp&amp;s=c5767436475c53af3d23266a2edb01c4cfde5998</a></p>\n\n<p>So now you know what the ETH triple halving will lead to ETH being deflationary and have a ~90% reduction in sell pressure, we will discuss why ETH will overtake BTC in market dominance. Firstly, price leads narrative. A narrative by itself potentially creates a price increase. A narrative with a significant price increase validates the narrative and induces a price explosion. The following events will convince any investor that ETH is ultra sound money:</p>\n\n<ol>\n<li>Exploding active accounts and transaction volume</li>\n<li>Low fees - The most significant problem with Ethereum is scalability and is about to be solved, once and for all. The Layer 2 deployment is in full swing and the transaction fees will come down in the future</li>\n<li>Powerful DeFi &amp; staking yields</li>\n<li>An environmentally-friendly Ethereum 2.0. ETH 2.0 will require 99% less energy to run and this is required to break into mainstream adoption. This is an obstacle where BTC failed. BTC is currently using up 0.7% of the world’s electricity while only serving 50 million people and you would likely need to use 70% to serve 5B (Full global adoption). Climate protection is the number one agenda in many developed countries and simply for this reason is why BTC will never truly be able to become mainstream</li>\n</ol>\n\n<p>Another likely scenario is sooner rather than later Elon Musk will ride the ETH bandwagon, the news of Elon Musk praising Ethereum’s soon upcoming launch of energy-friendly Ethereum 2.0 POS will be enough to propel ETH to 5 digits alone whether this is a good or bad thing is another debate in of itself.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wcamms32vqh71.png?width=1881&amp;format=png&amp;auto=webp&amp;s=c1e0b067bcaae94c80fb6c4c3a8b63c7052a4816\">https://preview.redd.it/wcamms32vqh71.png?width=1881&amp;format=png&amp;auto=webp&amp;s=c1e0b067bcaae94c80fb6c4c3a8b63c7052a4816</a></p>\n\n<p><a href=\"https://preview.redd.it/74zr1o32vqh71.png?width=1895&amp;format=png&amp;auto=webp&amp;s=f3b0a8f4b22364743a50e007bdfa4a5552df4548\">https://preview.redd.it/74zr1o32vqh71.png?width=1895&amp;format=png&amp;auto=webp&amp;s=f3b0a8f4b22364743a50e007bdfa4a5552df4548</a></p>\n\n<p><a href=\"https://preview.redd.it/lh1arw32vqh71.png?width=877&amp;format=png&amp;auto=webp&amp;s=4248e6bd0ba1a270e655816f5034e4c04f67a42f\">https://preview.redd.it/lh1arw32vqh71.png?width=877&amp;format=png&amp;auto=webp&amp;s=4248e6bd0ba1a270e655816f5034e4c04f67a42f</a></p>\n\n<p>Now, we must also take into account that all this will be happening when there is record demand for access to the Ethereum blockchain for DeFi and NFT&#39;s. ETH is simply too important relative to BTC. Ethereum has flipped Bitcoin in every important metric, the last remaining metric is the market cap and that is only one 2.5x of Ethereum away.</p>\n\n<p>But now you may ask, isn&#39;t this narrative already priced in? Well no, I don&#39;t believe so. The Triple Halving narrative only came into existence on April 27th (A 79 page investment report on why ETH could hit $150,000 by 2023 can be found on this link <a href=\"https://drive.google.com/file/d/1bECqgijhgjdS782AB620gFjK5qx-vA99/view?usp=sharing\">https://drive.google.com/file/d/1bECqgijhgjdS782AB620gFjK5qx-vA99/view?usp=sharing</a> ) how many of you had even heard of the ETH triple halving before reading this post? The average person will have no clue what even an Ethereum is but almost everyone has heard of BTC. In the last cycle the world discovered BTC not ETH, this cycle the world will discover ETH. BTC&#39;s first mover advantage will only take it so far and over time will begin to mean less and less. The shifting narrative of BTC to ETH will come as a result of BTC failing to be environmentally friendly and BTC will always fail at this hurdle as well as the very limited utility of BTC. Another reason why its unlikely this has been priced in yet is the Bitcoin halving was never priced in even though people knew about it 4 years in advance and it always led to a 100x price increase.</p>\n\n<p>Now we must also discuss some major reasons why this laid out foundation for the price of ETH to explode could be hindered. The journey for ETH will not be straight forward by any means and will likely be plagued by delays and many other unforeseen events.</p>\n\n<ul>\n<li>Scaling could fail to reduce fees - Adoption can be too fast or Optimism is delayed or not adopted quickly enough by the main gas consumers (Uniswap and Tether).</li>\n<li>POS is delayed - This is ETH we are talking about and this scenario is very likely to happen. POS is scheduled for late 2021 but will more likely come in early 2022</li>\n<li>Transaction fees end up being so low that due to scaling or lack of usage (bear market) - If Ethereum scales too well, fee burns would not have such a big impact on price.</li>\n</ul>\n\n<p>There are also some other issues that are less likely to occur such as a $10 Trillion market cap ETH could cause a regulatory risk as an unregulated decentralized entity being worth so much is a scary prospect for many governments to deal with.</p>\n\n<p>TLDR: ETH is already beating BTC in almost every important metric except market cap, with the EIP-1559 update and upcoming transition to POS ETH will loses 90% of its sell pressure or the equivalent of three BTC halvings in the timespan of 12 months leading to a price explosion that some predict could hit $150,000 by 2023 (<a href=\"https://drive.google.com/file/d/1bECqgijhgjdS782AB620gFjK5qx-vA99/view?usp=sharing\">https://drive.google.com/file/d/1bECqgijhgjdS782AB620gFjK5qx-vA99/view?usp=sharing</a>).</p>\n\n<p>This is the gwei.</p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/CryptoCurrency/comments/p5m9eq/the_ethereum_triple_halving_and_why_eth_will/",
  "subreddit": "CryptoCurrency",
  "id": "p5m9eq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, why do I make such a confident claim as to why Ethereum will easily surpass\nBTC as the largest cryptocurrency by almost every metric including market cap?\nSimply put, its because the Ethereum selling pressure is going to reduce by as\nmuch as 90% – the equivalent of three Bitcoin halvenings in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では、なぜ私がこのように自信を持って主張するのかというと、イーサリアムが、市場を含むほぼすべての指標において、最大の暗号通貨であるBTCを簡単に超えるだろうからです。\nBTCを上回り、時価総額を含むほぼすべての指標で最大の暗号通貨となるからです。\n簡単に言うと、イーサリアムの売り圧力が90％も減少するからです。\nイーサリアムの売り圧力が90％も減少するからです。これはビットコインの半値戻し3回分に相当します...",
      "title": "イーサリアムのトリプルハーフ化と、ETHがBTCを簡単に追い越すマーケットキャップの理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那么，为什么我如此自信地宣称，以太坊将轻松超过\nBTC作为最大的加密货币，几乎所有的衡量标准，包括市值？\n简单地说，这是因为以太坊的销售压力将减少多达\n高达90%--相当于三个比特币的半价。",
      "title": "以太坊三次减半，为什么ETH的市值会轻松超过BTC？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼，爲什麼我如此自信地宣稱，以太坊將輕鬆超過\nBTC作爲最大的加密貨幣，幾乎所有的衡量標準，包括市值？\n簡單地說，這是因爲以太坊的銷售壓力將減少多達\n高達90%--相當於三個比特幣的半價。",
      "title": "以太坊三次減半，爲什麼ETH的市值會輕鬆超過BTC？"
    }
  ]
}