{
  "author": "CryptoDealerrrr",
  "the_new_excerpt": "I’m 19, going to College for my bachelors in Economics. I’m working at a small\npizza joint as an assistant manager making okay money but I only work 25-30\nhours a week due to school.\n\nRight now I have essentially convinced myself to INVEST, INVEST, and oh yea...\nINVEST. I live with my parents and…",
  "original_created_utc": 1621176989,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は19歳で、大学で経済学の学士号を取得しています。私は小さなピザ屋でアシスタント・マネージャーとして働いています。\n収入はまあまあですが、学校の関係で週に25〜30時間しか働けません。\n働いています。\n\n今、私は基本的に自分自身を納得させていますが、それは投資、投資、そしてそう...。\n投資する。私は私の両親と一緒に住んでいると...",
      "title": "私の調子はどうですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年19岁，正在上大学，攻读经济学学士学位。我在一家小型\n披萨店担任经理助理，收入尚可，但由于要上学，我每周只工作25-30小时。\n但由于要上学，我每周只工作25-30小时。\n\n现在，我已经基本上说服了自己去投资，投资，哦耶......。\n投资。我和我的父母住在一起。",
      "title": "我做得怎么样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年19歲，正在上大學，攻讀經濟學學士學位。我在一家小型\n披薩店擔任經理助理，收入尚可，但由於要上學，我每週只工作25-30小時。\n但由於要上學，我每週只工作25-30小時。\n\n現在，我已經基本上說服了自己去投資，投資，哦耶......。\n投資。我和我的父母住在一起。",
      "title": "我做得怎麼樣？"
    }
  ],
  "title": "How am I doing?",
  "created_utc": 1621200719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m 19, going to College for my bachelors in Economics. I’m working at a small pizza joint as an assistant manager making okay money but I only work 25-30 hours a week due to school. </p>\n\n<p>Right now I have essentially convinced myself to INVEST, INVEST, and oh yea... INVEST. I live with my parents and since i’m going to school they pay mostly everything for me, all but gas. </p>\n\n<p>Every time I am about to buy anything, if it’s Mcdonald’s, chips, or a PS5, I convince myself that I would look back in 10 years and know that it was a waist of money. </p>\n\n<p>Currently I have a Roth IRA GO acc with Fidelity that is 20% of my portfolio, then about 5% in Crypto and the other 75% is in  individual stock like $TSLA, $LMND, $APPL, $Z, $SQ, and more. </p>\n\n<p>I decided to have my portfolio set up like this because I wanted to be extremely aggressive, not to mention this dip helped me buy in at prices that are impossible to buy up. </p>\n\n<p>My question is this; Should I re-arrange my portfolio for a safer option? What are your thoughts and thanks for any help / constructive criticism!</p>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/stocks/comments/ndq2ig/how_am_i_doing/",
  "subreddit": "stocks",
  "id": "ndq2ig",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804456
}