{
  "author": "partymsl",
  "original_created_utc": 1647725279,
  "title": "I do celebrate a 5% pump and why should I not? Every human will be happy to see some progress, that's natural in today's world.",
  "created_utc": 1647768686,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As many here are critizising people that are celebrating on every 2% pump, which I can understand if the person says something like &amp;quot;bull market back! ATH Next month&amp;quot; or so. That would be trying to use one light particle to predict the site of the sun.&lt;/p&gt;\n\n&lt;p&gt;But some people as me are just celebrating it because its naturally making us happy. We already know that in the long term there done day will be a new ATH and till then we will celebrate every step that brings us there. That does not mean that we are unaware of the current bearish situation.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s is nothing bad about having fun to see even the smallest pump as long as you don&amp;#39;t become illusive and use that pump to justify a moon shot.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/ti5bxt/i_do_celebrate_a_5_pump_and_why_should_i_not/",
  "subreddit": "CryptoCurrency",
  "id": "ti5bxt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As many here are critizising people that are celebrating on every 2% pump, which\nI can understand if the person says something like \"bull market back! ATH Next\nmonth\" or so. That would be trying to use one light particle to predict the site\nof the sun.\n\nBut some people as me are just celebrating it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで多くの人が、2％のポンプごとに祝っている人々を批判しているように、それは\nその人が「強気相場復活！」とか言うならわかるんだけど。ATH Next\n月」とか。それは、一つの光の粒子で、その場所を予測しようとすることです。\n太陽の\n\nでも、私のようにお祭り騒ぎをする人もいるわけで...。",
      "title": "私は5％のポンプを祝うが、なぜそうしてはいけないのか？人間なら誰でも進歩があれば嬉しいものです、今の世の中それが当たり前です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如这里的许多人批评那些在每个2%的泵上庆祝的人，这\n我可以理解，如果这个人说 \"牛市回来了！\"之类的话。ATH下个月\n月 \"之类的话。这将是试图用一个光粒子来预测太阳的位置\n太阳的位置。\n\n但有些人像我一样只是在庆祝...",
      "title": "我确实在庆祝一个5%的泵，我为什么不呢？每个人都会为看到一些进步而高兴，这在今天的世界上是很自然的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如這裏的許多人批評那些在每個2%的泵上慶祝的人，這\n我可以理解，如果這個人說 \"牛市回來了！\"之類的話。ATH下個月\n月 \"之類的話。這將是試圖用一個光粒子來預測太陽的位置\n太陽的位置。\n\n但有些人像我一樣只是在慶祝...",
      "title": "我確實在慶祝一個5%的泵，我爲什麼不呢？每個人都會爲看到一些進步而高興，這在今天的世界上是很自然的。"
    }
  ]
}