{
  "author": "throwawaymeplease45",
  "original_created_utc": 1630894827,
  "title": "How do I tell a friend she needs to shower often?",
  "created_utc": 1630910768,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a best friend who down right stinks. Her hygiene is horrible. She won’t brush her teeth or hair or put on clean clothes. She’s the most fun person to be around and I love talking to her but she STINKS. I’ve been slightly telling her some of my hygiene tips and what I do along with breaking his down like showering everyday, flossing, using mouthwash and washing your work clothes everyday. So that hopefully it will rub off on her and she’ll get the hint that she needs to shower more but it’s not working. We have sleepovers at my house and that seems like the only way I can get her to shower. She didn’t one time and I could smell straight butt and vagina the whole night. I even offer to do her hair and at least brush it for her. We got to talking and she straight up told me that she wont shower for 5 days because she gets lazy. I bluntly told her how gross it is and she just brushed it off. I love her to death but she smells and looks filthy all the time and it’s quite embarrassing when we go out. Can someone give me some tips as to how I can tell her in a sensitive way without hurting her feelings that she needs to take showers??</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/piqe53/how_do_i_tell_a_friend_she_needs_to_shower_often/",
  "subreddit": "TooAfraidToAsk",
  "id": "piqe53",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a best friend who down right stinks. Her hygiene is horrible. She won’t\nbrush her teeth or hair or put on clean clothes. She’s the most fun person to be\naround and I love talking to her but she STINKS. I’ve been slightly telling her\nsome of my hygiene tips and what I do along with breaking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の親友には、本当に臭い人がいます。彼女の衛生状態は最悪です。彼女は\n歯も髪も磨かないし、きれいな服も着ない。彼女は一緒にいて一番楽しい人です。\n一緒にいて一番楽しい人だし、話すのも好きだけど、彼女は臭い。私は、彼女に少しだけ\n私がしている衛生管理の秘訣を少し話してみたのですが、それに加えて歯磨きもしない...。",
      "title": "頻繁にシャワーを浴びる必要があることを友人に伝えるには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个最好的朋友，他很臭屁。她的卫生状况很糟糕。她不愿意\n刷牙、梳头或穿上干净的衣服。她是最有趣的人\n我喜欢和她聊天，但她很臭。我一直在告诉她\n我一直在告诉她我的一些卫生提示和我所做的事情，同时打破...",
      "title": "我如何告诉一个朋友她需要经常洗澡？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個最好的朋友，他很臭屁。她的衛生狀況很糟糕。她不願意\n刷牙、梳頭或穿上乾淨的衣服。她是最有趣的人\n我喜歡和她聊天，但她很臭。我一直在告訴她\n我一直在告訴她我的一些衛生提示和我所做的事情，同時打破...",
      "title": "我如何告訴一個朋友她需要經常洗澡？"
    }
  ]
}