{
  "author": "starlightgirl493",
  "original_created_utc": 1646612605,
  "title": "Can my neighbor legally do this??",
  "created_utc": 1646627849,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi everyone! Last night was my 27th birthday and I had a group of friends over at my house. This afternoon my neighbor across the street came over and complained to me about cars parked in front of his house last night. He told me that he doesn&amp;#39;t want anyone parking in front of his house especially late at night when his daughter gets home from work. I explained to him that the streets are considered public unless you live on private property. He then gets angry and says &amp;quot; well I pay taxes on my house so I feel I should have a right to not have anyone park there&amp;quot;. He also said he will get the police involved if he sees it again lmao. Can my neighbor legally reserve a parking spot in front of his house? My neighborhood is pretty busy and cars park in front of my house all the time and I don&amp;#39;t complain. Thanks&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 127,
  "permalink": "/r/NoStupidQuestions/comments/t8cj38/can_my_neighbor_legally_do_this/",
  "subreddit": "NoStupidQuestions",
  "id": "t8cj38",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi everyone! Last night was my 27th birthday and I had a group of friends over\nat my house. This afternoon my neighbor across the street came over and\ncomplained to me about cars parked in front of his house last night. He told me\nthat he doesn't want anyone parking in front of his house especially…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みなさん、こんにちは。昨夜は私の27歳の誕生日で、友人たちを招きました。\n私の家で 今日の午後、通りの向こうの隣人がやってきて、「この人、何してるの？\n昨夜、家の前に車が止まっていたことについて、私に苦情を言ってきました。彼は私にこう言いました。\n特に家の前に駐車されるのが嫌だと...。",
      "title": "隣人は合法的にこんなことができるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 昨晚是我的27岁生日，我有一群朋友在我家\n在我家里。今天下午，我对面的邻居过来跟我抱怨说\n向我抱怨昨晚在他家门口停放的汽车。他告诉我\n他不希望任何人在他家门口停车，尤其是...",
      "title": "我的邻居可以合法地这样做吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 昨晚是我的27歲生日，我有一羣朋友在我家\n在我家裏。今天下午，我對面的鄰居過來跟我抱怨說\n向我抱怨昨晚在他家門口停放的汽車。他告訴我\n他不希望任何人在他家門口停車，尤其是...",
      "title": "我的鄰居可以合法地這樣做嗎？"
    }
  ]
}