{
  "author": "amandamichelle90",
  "original_created_utc": 1635077569,
  "title": "Unless you read yesterday’s lotto numbers and sulk everyday for not picking them - don’t worry about coins that pumped without you",
  "created_utc": 1635089842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the past year, the sentiment around memecoin holders has been <em>”I feel bad for them — pouring their life savings into this and will lose it all”</em> but anyone still holding is likely into large profits on a few of them. They didn’t take your advice, they didn’t apply your logic and it worked out for them.</p>\n\n<p>If you truly felt bad for them before, be happy that it worked out. If you’re upset for not doing what they did, that’s kinda silly.. coins pump everyday without us on board some of us just have a less chaotic strategy. </p>\n\n<p>This isn’t unique to crypto, people invest their time, energy and money into risky things that pan out all the time. In life there will be daily choices you make and don’t make that land you more or less money — it’s just less measurable than it is in Crypto, you’re less aware of the exact decision and what the alternative would have gained you.</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/CryptoCurrency/comments/qeqywp/unless_you_read_yesterdays_lotto_numbers_and_sulk/",
  "subreddit": "CryptoCurrency",
  "id": "qeqywp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For the past year, the sentiment around memecoin holders has been ”I feel bad\nfor them — pouring their life savings into this and will lose it all” but anyone\nstill holding is likely into large profits on a few of them. They didn’t take\nyour advice, they didn’t apply your logic and it worked out for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この1年、memecoinを持つ人たちの気持ちは、「気分が悪い」でした。\n貯金をつぎ込んで、すべてを失ってしまうのはかわいそうだ」というものでしたが、まだ持っている人は\nしかし、まだ保有している人は、いくつかの作品で大きな利益を得ているようです。彼らはあなたのアドバイスを受けなかった。\n彼らはあなたのアドバイスを受けず、あなたの論理を適用せず、そしてそれがうまくいった...。",
      "title": "昨日のロトの番号を読んで、それを選ばなかったことを毎日嘆いているのでなければ、自分のいないところで揚がったコインのことは気にしなくていい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一年里，围绕着美钞持有人的情绪一直是 \"我为他们感到难过\n我为他们感到难过--他们把一生的积蓄都倾注在这上面，但会失去这一切。\n仍然持有的人很可能在其中一些上获得了大量的利润。他们没有接受\n你的建议，他们没有运用你的逻辑，结果是......",
      "title": "除非你看了昨天的乐透号码，并为没有选到它们而每天生闷气--不要担心没有你就抽到的硬币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一年裏，圍繞着美鈔持有人的情緒一直是 \"我爲他們感到難過\n我爲他們感到難過--他們把一生的積蓄都傾注在這上面，但會失去這一切。\n仍然持有的人很可能在其中一些上獲得了大量的利潤。他們沒有接受\n你的建議，他們沒有運用你的邏輯，結果是......",
      "title": "除非你看了昨天的樂透號碼，併爲沒有選到它們而每天生悶氣--不要擔心沒有你就抽到的硬幣。"
    }
  ]
}