{
  "author": "Wolf9574",
  "original_created_utc": 1627336187,
  "title": "Amazon is not your friend and an Amazon coin will be just as centralised as FIAT.",
  "created_utc": 1627353966,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Amazon is a massive corporation with no incentive beyond their own profit. If they create an Amazon token they&#39;ll also incentivize using that token over any other crypto as much as possible, removing any semblance of decentralization from the payment process. Everyone loves a big green candle in the morning but don&#39;t let it cloud your perspective.</p>\n</div><!-- SC_ON -->",
  "score": 433,
  "permalink": "/r/CryptoCurrency/comments/os8zz6/amazon_is_not_your_friend_and_an_amazon_coin_will/",
  "subreddit": "CryptoCurrency",
  "id": "os8zz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Amazon is a massive corporation with no incentive beyond their own profit. If\nthey create an Amazon token they'll also incentivize using that token over any\nother crypto as much as possible, removing any semblance of decentralization\nfrom the payment process. Everyone loves a big green candle in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アマゾンは巨大な企業であり、自分たちの利益以上のインセンティブはありません。もし\nAmazonトークンを作成した場合、他の暗号よりもそのトークンを使用することを可能な限り奨励します。\n他の暗号よりもそのトークンを使うように煽り、決済プロセスから分散性の名残をなくします。\n決済プロセスから分散性を排除することになります。誰もが、大きな緑色のロウソクが大好きです...",
      "title": "アマゾンはあなたの友人ではありませんし、アマゾン・コインはFIATと同じように中央集権的になります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "亚马逊是一个巨大的公司，除了他们自己的利润之外，没有任何动机。如果\n如果他们创造了一个亚马逊代币，他们也会激励使用该代币而不是任何其他加密货币。\n尽可能多地使用其他加密货币，消除任何分散化的迹象。\n从支付过程中消除任何分散性。每个人都喜欢一个大的绿色蜡烛，在...",
      "title": "亚马逊不是你的朋友，亚马逊的硬币将和FIAT一样集中化。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "亞馬遜是一個巨大的公司，除了他們自己的利潤之外，沒有任何動機。如果\n如果他們創造了一個亞馬遜代幣，他們也會激勵使用該代幣而不是任何其他加密貨幣。\n儘可能多地使用其他加密貨幣，消除任何分散化的跡象。\n從支付過程中消除任何分散性。每個人都喜歡一個大的綠色蠟燭，在...",
      "title": "亞馬遜不是你的朋友，亞馬遜的硬幣將和FIAT一樣集中化。"
    }
  ]
}