{
  "author": "flurbino",
  "the_new_excerpt": "Have you ever been in a debate where the other person made you say \"hey, you\nknow what, you're right and I was completely wrong. Whoops.\" Maybe once, twice\nmost. How often have you seen it though? Not often, right?\n\nForgive the abomination of the title, but I wanted to emphasize arguments where\none…",
  "original_created_utc": 1621308407,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "議論をしているときに、相手から「あのさぁ......」と言われたことはありませんか？\nあなたの言っていることは正しくて、私は完全に間違っていた。おっと。\" たぶん1回、2回\nほとんどがそうです。しかし、あなたはそれをどのくらいの頻度で見たことがありますか？あまりないですよね？\n\nタイトルがおかしなことになってしまいましたが、私が強調したかったのは、このような議論です。\n1...",
      "title": "人はなぜ、根拠のある説得力のある論拠を示されても、考えを変えようとしないし、非を認めようともしないのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你是否曾经在一场辩论中，对方让你说 \"嘿，你知道吗？\n知道吗，你是对的，我完全错了。哎呀。\" 也许有一次，两次\n最多。但你有多少次看到这种情况？不经常，对吗？\n\n请原谅这个可恶的标题，但我想强调的是争论，其中\n一...",
      "title": "为什么人们如此不愿意改变他们的想法，甚至只是承认错误，即使有令人信服的、有来源的论据。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你是否曾經在一場辯論中，對方讓你說 \"嘿，你知道嗎？\n知道嗎，你是對的，我完全錯了。哎呀。\" 也許有一次，兩次\n最多。但你有多少次看到這種情況？不經常，對嗎？\n\n請原諒這個可惡的標題，但我想強調的是爭論，其中\n一...",
      "title": "爲什麼人們如此不願意改變他們的想法，甚至只是承認錯誤，即使有令人信服的、有來源的論據。"
    }
  ],
  "title": "Why are people so reluctant to change their minds, or even just admit fault, even when presented with compelling, sourced arguments?",
  "created_utc": 1621343714,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Have you ever been in a debate where the other person made you say &quot;hey, you know what, you&#39;re right and I was completely wrong. Whoops.&quot; Maybe once, twice most. How often have you seen it though? Not often, right?</p>\n\n<p>Forgive the abomination of the title, but I wanted to emphasize arguments where one side is clearly right (studies on their side), and the other side is clearly wrong (e.g. no sources sans a youtube video from some suspicious channel, at best). Yet, in this case, the person so clearly in the wrong refuses to admit it. They flee the discussion without a word, double down with fallacies, or just resort to outright insults, conspiracy accusations or more.</p>\n\n<p>Don&#39;t get me wrong, I&#39;m probably not perfect here either. Logically speaking though, wouldn&#39;t someone want to learn they are wrong? If you figure out a belief you held was incorrect, and learn the correct one via debate, then you&#39;ve kind of improved yourself, right?</p>\n\n<p>Yet, the vast majority of people don&#39;t. I&#39;ve probably been in an argument or two where I was destroyed by a counter argument, but still walked away feeling I was right. You see this day after day on reddit.</p>\n\n<p>Why is this? I don&#39;t think it&#39;s based on a sense of shame, because this happens even on anonymous forums without even usernames. This makes me think it&#39;s some sort of evolutionary quirk about saving face, never backing down maybe? I&#39;m not sure, which is why I&#39;m asking to look for insight.</p>\n\n<p>Of course, not all arguments are so clear-cut, but I&#39;m mostly concerned with those that are. Think positions like &quot;the sky isn&#39;t blue, it&#39;s always green!&quot;, denial of obvious technologies working, and other such ridiculous things like that.</p>\n\n<p>EDIT: Not sure how to edit titles, but &quot;admit they were wrong&quot; is probably better than &quot;admit fault&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TrueAskReddit/comments/nezzpd/why_are_people_so_reluctant_to_change_their_minds/",
  "subreddit": "TrueAskReddit",
  "id": "nezzpd",
  "is_self": true,
  "media": null,
  "is_video": false
}