{
  "author": "scicoolgamique-_-",
  "original_created_utc": 1647700166,
  "title": "if all parents were kids and teens themselves when they were younger, why is it so hard for them to understand their children?",
  "created_utc": 1647707987,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Depressed? Blame it on the phone. Their child expressing their feelings? They&amp;#39;re talking back and rebelling. The list goes on. Haven&amp;#39;t they had the same experiences? Why is it so hard for them to understand? They always act like they&amp;#39;re right and even when they mess up, they start lecturing the children to forgive them or somehow blame the child.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 148,
  "permalink": "/r/TooAfraidToAsk/comments/thwd3e/if_all_parents_were_kids_and_teens_themselves/",
  "subreddit": "TooAfraidToAsk",
  "id": "thwd3e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Depressed? Blame it on the phone. Their child expressing their feelings? They're\ntalking back and rebelling. The list goes on. Haven't they had the same\nexperiences? Why is it so hard for them to understand? They always act like\nthey're right and even when they mess up, they start lecturing the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "うつ病？電話のせいにしてください。子供が自分の気持ちを表現している？彼らは\n言い返し、反抗する。数え上げればきりがない。同じようなことをしたことがないでしょうか？\nを経験したことがありますか？なぜ彼らにとっては理解しがたいことなのでしょうか？彼らはいつも\n自分が正しいと思い込んでいて、失敗しても、その失敗を叱りつける......。",
      "title": "親がみんな若い頃、自分も子どもや10代だったなら、なぜ子どものことを理解するのは難しいのだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "抑郁症？把它归咎于电话。他们的孩子在表达自己的感受？他们是\n回嘴和反叛。这样的例子不胜枚举。他们难道没有同样的\n经验吗？为什么他们这么难理解？他们总是表现得好像\n他们是对的，即使他们搞砸了，他们也开始教训......",
      "title": "如果所有的父母在年轻时都是孩子和青少年，为什么他们就很难理解自己的孩子呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "抑鬱症？把它歸咎於電話。他們的孩子在表達自己的感受？他們是\n回嘴和反叛。這樣的例子不勝枚舉。他們難道沒有同樣的\n經驗嗎？爲什麼他們這麼難理解？他們總是表現得好像\n他們是對的，即使他們搞砸了，他們也開始教訓......",
      "title": "如果所有的父母在年輕時都是孩子和青少年，爲什麼他們就很難理解自己的孩子呢？"
    }
  ]
}