{
  "author": "starskeeponcalling",
  "the_new_excerpt": "While I know there might be many non Americans retards here, I'm sure the\ncurrent political turmoil in the US has piqued the curiosities of many. Of\ncourse for Americans it's a surreal time.\n\n/r/wallstreetbets is proudly a non political sub, as made very evident by Rule\n#5 :\n\n> \" If you choose to…",
  "original_created_utc": 1610308808,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "虽然我知道这里可能有很多非美国人的智障，但我相信\n美国当前的政治动荡激起了许多人的好奇心。的\n对于美国人来说，这是一个超现实的时刻。\n\n/r/正如Rule非常清楚的那样，wallstreetbets自豪地是一个非政治性的SUB\n#5：\n\n>“如果您选择…",
      "title": "我为这个社会感到骄傲，尤其是国防部对当前政治格局的讨论。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然我知道這裏可能有很多非美國人的智障，但我相信\n美國當前的政治動盪激起了許多人的好奇心。的\n對於美國人來說，這是一個超現實的時刻。\n\n/r/正如Rule非常清楚的那樣，wallstreetbets自豪地是一個非政治性的SUB\n#5：\n\n>“如果您選擇…",
      "title": "我爲這個社會感到驕傲，尤其是國防部對當前政治格局的討論。"
    }
  ],
  "title": "I am so proud of this community and especially the mods with regards to the discussions around the current political landscape.",
  "created_utc": 1610335970,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While I know there might be many non Americans retards here, I&#39;m sure the current political turmoil in the US has piqued the curiosities of many. Of course for Americans it&#39;s a surreal time.</p>\n\n<p><a href=\"/r/wallstreetbets\">/r/wallstreetbets</a> is proudly a non political sub, as made very evident by Rule #5 :</p>\n\n<blockquote>\n<p>&quot; If you choose to start arguments about libtards or Nazis instead of making fun of their bad SPY long then you&#39;re in the wrong place and we&#39;ll show you the door. &quot;</p>\n</blockquote>\n\n<p>Still, during the peak of the political shithousery, the mods created that thread to allow political discussions made me believe that the mods are not just robotic overlords that don&#39;t understand the needs of the average retard. I believe this demonstrated better leadership than many of our political overlords, and any <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a> mod running for office will have a vote from this retard.</p>\n\n<p>Also looking at the discussion happening on that thread and even in other threads (such as the Daily Discussion ones), I was amazed at how civil, absolutely hilarious, and particularly autistic the discussion was. This reflects the values of our community, and I&#39;m proud of each and every one of you.</p>\n\n<p>I just wanted to make a post to congratulate the mods for doing an amazing work at managing a bunch of retards who sniff more crayons than an Elementary school teacher, and show my appreciation for my fellow retards who managed to find humor in the crazy times we live in.</p>\n\n<p>I am proud to call myself a <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a> retard.</p>\n\n<p>That&#39;s all I got.</p>\n\n<p>Obligatory Positions:</p>\n\n<p>APHA 1/15 10c - loooooking good.</p>\n\n<p>GOEV 1/15 25c - got ass fucked</p>\n\n<p>ZM 1/15 410c - got ass fucked and had to ride a bicycle home</p>\n\n<p>DKNG 1/21/22 70c - loooooking good</p>\n\n<p>DKNG 1/20/23 90c - loooooking good.</p>\n\n<p>Edit :</p>\n\n<p>Forgot to add 300 shares in GME.To the moon babyyyyyyyyyyyyyy, we&#39;re gonna squeeze the fuck out of Melvin.</p>\n\n<p>Edit #2 :</p>\n\n<p>Thanks for the Gold! Using all those coins to appreciate all the commenters here. Never change you autists!</p>\n</div><!-- SC_ON -->",
  "score": 1814,
  "permalink": "/r/wallstreetbets/comments/kulmrq/i_am_so_proud_of_this_community_and_especially/",
  "subreddit": "wallstreetbets",
  "id": "kulmrq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706385298
}