{
  "author": "SleazeTownThrowRA56",
  "original_created_utc": 1633926649,
  "title": "Why does my crotch throb when I think about fucked up horrible things? Am I insane?",
  "created_utc": 1633947734,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Warning: this will be very troubling to read. Viewer discretion advised. This is your only warning.</p>\n\n<p>So rarely I get aroused (not really arousal, more like a groinal response) by horrible messed up things. And it’s not even the thing itself that arouses me, it’s the sheer fuckedupedness, horror and grossness of the scenario that makes me have a groinal response. I won’t go into detail (if I did, this account would get reported/banned for sure) but it happens every once in a while. I worry greatly about being a pedophile. The only reason I know I’m not is that when I try to imagine doing...things...with a kid it does nothing for me. But then other times I’m unsure. Like i got a little turned on by Bill from F is for Family witnessing the fucked up, usually sexual things he witnessed in that show. I don’t know why, I think it’s the sheer taboo. I know I’m messed up, I didn’t ask to be this way, I really want to be fixed. I like guys my own age as well, but sometimes I get these thought that I don’t want. I’m horrified by the idea of adults hurting children in such a manner, but sometimes it pops into my mind and my crotch throbs a little. I hate it. I want to die. Is it POCD? or am I genuinely fucked up?</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/TooAfraidToAsk/comments/q5o6ft/why_does_my_crotch_throb_when_i_think_about/",
  "subreddit": "TooAfraidToAsk",
  "id": "q5o6ft",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Warning: this will be very troubling to read. Viewer discretion advised. This is\nyour only warning.\n\nSo rarely I get aroused (not really arousal, more like a groinal response) by\nhorrible messed up things. And it’s not even the thing itself that arouses me,\nit’s the sheer fuckedupedness, horror and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "警告：これは読むと非常に困ったことになります。視聴者の判断をお願いします。これは\n唯一の警告です。\n\n私はめったにないことですが、私は恐ろしい混乱したものに興奮します（本当の興奮ではなく、むしろ股間の反応のようです）。\n興奮することはほとんどありません。興奮するのはその物自体ではない。\nそれは、本当にめちゃくちゃで、恐ろしくて...",
      "title": "なぜ、めちゃくちゃ恐ろしいことを考えると、股間がズキズキするのか？私は狂っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "警告：这将是非常令人不安的阅读。建议观众谨慎阅读。这就是\n你的唯一警告。\n\n我很少会因为一些可怕的、混乱的事情而感到兴奋（不是真正的兴奋，更像是一种腹股沟反应）。\n可怕的乱七八糟的东西。甚至不是事情本身让我兴奋。\n而是那种纯粹的混乱、恐怖和...",
      "title": "为什么我一想到该死的可怕的事情，我的胯下就会跳动？我是不是疯了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "警告：這將是非常令人不安的閱讀。建議觀衆謹慎閱讀。這就是\n你的唯一警告。\n\n我很少會因爲一些可怕的、混亂的事情而感到興奮（不是真正的興奮，更像是一種腹股溝反應）。\n可怕的亂七八糟的東西。甚至不是事情本身讓我興奮。\n而是那種純粹的混亂、恐怖和...",
      "title": "爲什麼我一想到該死的可怕的事情，我的胯下就會跳動？我是不是瘋了？"
    }
  ]
}