{
  "author": "Throwaway6666669420",
  "original_created_utc": 1657415610,
  "title": "Can men tell when their genitals are exposed?",
  "created_utc": 1657432197,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(20F)My (56)dad refuses to wear pants and only wears boxers around the house and his genitals are always hanging out of his underwear when he sits on the couch which directly faces my bedroom door. Anytime I walk into the living room I’m afraid I’m going to see his genitals on accident. I’m so uncomfortable and I’ve tried addressing it multiple times since 2016 and he will only wear actual shorts around the house for a day and then go back to wearing underwear. Does he not feel his genitals exposed to open air or does he do this on purpose?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/vvg1hv/can_men_tell_when_their_genitals_are_exposed/",
  "subreddit": "TooAfraidToAsk",
  "id": "vvg1hv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "(20F)My (56)dad refuses to wear pants and only wears boxers around the house and\nhis genitals are always hanging out of his underwear when he sits on the couch\nwhich directly faces my bedroom door. Anytime I walk into the living room I’m\nafraid I’m going to see his genitals on accident. I’m so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(20F)私の(56)父はズボンを履くのを拒否して、家の中ではボクサーしか履いていませんし\n私の寝室のドアに面したソファに座ると、いつも下着から性器が出ています。\n私の寝室のドアに直接面しているソファに座ると、いつも下着から性器が出ています。私がリビングルームに入るときはいつも\n偶然に彼の性器を見てしまうのではないかと心配になります。私はとても...",
      "title": "男性は性器の露出を見分けることができるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(20F)我的(56)爸爸拒绝穿裤子，只在家里穿四角裤，并且\n当他坐在沙发上时，他的生殖器总是挂在内裤外面。\n当他坐在直接面对我的卧室门的沙发上时，他的生殖器总是挂在内衣外面。每当我走进客厅时，我都会担心会看到他的生殖器。\n我就担心会不小心看到他的生殖器。我是如此...",
      "title": "男人能分辨出他们的生殖器是什么时候暴露的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(20F)我的(56)爸爸拒絕穿褲子，只在家裏穿四角褲，並且\n當他坐在沙發上時，他的生殖器總是掛在內褲外面。\n當他坐在直接面對我的臥室門的沙發上時，他的生殖器總是掛在內衣外面。每當我走進客廳時，我都會擔心會看到他的生殖器。\n我就擔心會不小心看到他的生殖器。我是如此...",
      "title": "男人能分辨出他們的生殖器是什麼時候暴露的嗎？"
    }
  ]
}