{
  "author": "justanothercollegesf",
  "original_created_utc": 1643780727,
  "title": "As a girl,do you ever get sad that you have never been gifted flowers?",
  "created_utc": 1643788969,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For context I’m a 20 year old female. Today as I was checking out my groceries I saw a guy around my age buy roses and candies. The first things that went to my mind was how lucky the girl who will received them be. It’s not really jealousy but more sadness. I’m not really crazy into the romantic stuff anymore. But must be nice to get gifted flowers :) &lt;/p&gt;\n\n&lt;p&gt;I guess that’s how it goes for some people&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/sigvad/as_a_girldo_you_ever_get_sad_that_you_have_never/",
  "subreddit": "NoStupidQuestions",
  "id": "sigvad",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For context I’m a 20 year old female. Today as I was checking out my groceries I\nsaw a guy around my age buy roses and candies. The first things that went to my\nmind was how lucky the girl who will received them be. It’s not really jealousy\nbut more sadness. I’m not really crazy into the romantic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちなみに私は20歳の女性です。今日、食料品をチェックしているとき、私は\n同年代の男性がバラとキャンディーを買っているのを見た。まず最初に頭によぎったのは\nそれを受け取る女の子はなんて幸せなんだろうと思いました。嫉妬というより\nというより、悲しい。私はロマンチックなことに夢中になっているわけではないのですが...。",
      "title": "女の子なら、花を贈られたことがなくて悲しい思いをしたことはないだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了说明情况，我是一个20岁的女性。今天我在结账的时候\n看到一个和我年龄相仿的人买了玫瑰花和糖果。我首先想到的\n心里想的是，将收到这些东西的女孩是多么幸运。这并不是真正的妒忌\n而是更多的悲伤。我并不是真的疯狂地喜欢浪漫...",
      "title": "作为一个女孩，你是否曾为自己从未得到过鲜花的馈赠而难过？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了說明情況，我是一個20歲的女性。今天我在結賬的時候\n看到一個和我年齡相仿的人買了玫瑰花和糖果。我首先想到的\n心裏想的是，將收到這些東西的女孩是多麼幸運。這並不是真正的妒忌\n而是更多的悲傷。我並不是真的瘋狂地喜歡浪漫...",
      "title": "作爲一個女孩，你是否曾爲自己從未得到過鮮花的饋贈而難過？"
    }
  ]
}