{
  "author": "Sukh6",
  "the_new_excerpt": "As we all know AWS has entered a multi-year, global agreement with BlackBerry\n(BB) QNX to develop BB IVY. Following is a deep dive into that partnership in\nanticipation of the AWS and IVY webinar on Feb 23rd 2PM EST.\n\nIvy benefits the whole value-chain\n\n * IVY enables automakers to create…",
  "original_created_utc": 1613956333,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "众所周知，AWS已经与黑莓达成了一项多年的、全球性的协议。\n(BB)QNX开发BB IVY。以下是对这一合作关系的深入探讨。\n期待美国东部时间2月23日下午2点举行的AWS和IVY网络研讨会。\n\n常春藤惠及整个价值链\n\n * IVY使汽车制造商能够创建......。",
      "title": "黑莓常春藤+AWS。Deepdive"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "衆所周知，AWS已經與黑莓達成了一項多年的、全球性的協議。\n(BB)QNX開發BB IVY。以下是對這一合作關係的深入探討。\n期待美國東部時間2月23日下午2點舉行的AWS和IVY網絡研討會。\n\n常春藤惠及整個價值鏈\n\n * IVY使汽車製造商能夠創建......。",
      "title": "黑莓常春藤+AWS。Deepdive"
    }
  ],
  "title": "Blackberry Ivy + AWS: Deepdive",
  "created_utc": 1613963901,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As we all know AWS has entered a multi-year, global agreement with BlackBerry (BB) QNX to develop BB IVY. <em>Following is a deep dive into that partnership</em> in anticipation of the AWS and IVY webinar on Feb 23rd 2PM EST.</p>\n\n<p>Ivy benefits the whole value-chain</p>\n\n<ul>\n<li>IVY enables <strong>automakers</strong> to create personalized driver and passenger experiences by allowing for a consistent and secure way to read vehicle sensor data, normalize it, and create actionable insights. <strong>AKA feed</strong> <strong>OEMs MORE DATA that is actionable</strong>.</li>\n<li>The <strong>developers</strong> won’t need specialized or automotive software skills.</li>\n</ul>\n\n<p>Modern cars and trucks are built with thousands of parts from many different suppliers, with each vehicle model comprising a unique set of proprietary hardware and software components. These components, which include an increasing variety of vehicle sensors, produce data in unique and specialized formats. The highly specific skills required to interact with this data. With BB IVY there is no need to worry about special automotive programming languages, hardware variations, or proprietary sensor data formats.</p>\n\n<ul>\n<li>The <strong>consumer (driver)</strong> gets more frequent feature updates allowing for better performance/experience along with safety of their data</li>\n</ul>\n\n<p>Data is the new Gold/Oil</p>\n\n<p>BB has had a vision to build a data analytics platform for years which they showcased at CES 2 years ago.</p>\n\n<p>In a Bloomberg interview, John Chen says the following in regards to BB Ivy “By the way this project, we’ve <strong>been working with Amazon</strong> has taken us probably about <strong>2 years</strong>..we started this whole program 2 years ago at CES. We demonstrated a little piece of technology at that time, <strong>obviously not as elaborative as today</strong>..”.</p>\n\n<p>He goes on to say that this <strong>creates a recuring data business for BB</strong>. This point should not be overlooked! As a Mckensey&amp;Co report outlined (see my summary) connected cars (the new iPhone) will <strong>allow for the OEMs to monetize data from connected cars</strong>. We all know that 7/10 most valuable companies in the world generate billions in profits from data-based services.</p>\n\n<p><strong>Chen explains that Amazon is interested in BB for 2 reasons:</strong></p>\n\n<ol>\n<li>QNX provides Amazon with a secure, safety certified OS (aka the “plumbing” or ecosystem Ivy will be built on)</li>\n<li>BB secures all endpoints in the Internet of Things</li>\n</ol>\n\n<p>Per Frost &amp; Sulliven report, a comprehensive endpoint-based security platform should be able to protect against 97% of cyberthreats (attacks). Per F&amp;S, BB can currently protect up to 96% of all cyberthreats <strong>and secure ALL IoTs endpoints.</strong> Possible endpoints (Cars, Phones, Computers, Smart-Appliances, Drones, Smart cities, etc). Its easy to see why Amazon would partner with BB, as another reddit user pointed out, Drones being the most interesting one. By the way, John Chen also mentions Drones in a different interview.</p>\n\n<p><strong>What does Amazon provide BB:</strong></p>\n\n<ol>\n<li>AWS experience with user interfaces</li>\n<li>AWS Cloud</li>\n<li>Machine learning models from AWS Management Console</li>\n</ol>\n\n<p>Competition</p>\n\n<p>Chen points out that he is not worried about <strong>Apple and Google</strong> entering the space as they also only have experience with user interfaces and <strong>lack experience in the OEM space with the ecosystems</strong>.</p>\n\n<p>Another important distinction is that <strong>Ivy allows</strong> OEMs to “own their customer,” Google/Apple may not allow that to happen as they want to own the data. <strong>“BB is only transporting the data”</strong> <strong>to the OEMs</strong>. If you’re an OEM and you understand the value of data, would you choose an OS that lets you own the data or an OS that keeps it for itself..</p>\n\n<p>BB really has a unique opportunity in front of them, the <strong>automotive space is rapidly changing</strong> and 2023-2025 is going to look a lot different than it does now. BB already is in 175 million cars and 61% of the EV market already use QNX. Side note, Lucid motors is also using QNX, they are currently hiring a QNX developer for what that is worth. Let’s hope BB executes, I trust that under John Chen’s leadership BB will.</p>\n\n<p><strong>Disclosure</strong>: Holding 400 shares at ~$12/share. Initiated position Feb 12th after GME Fiasco, not bag-holding.</p>\n\n<p>_______________________________________________________________________</p>\n\n<p><a href=\"https://aws.amazon.com/blogs/industries/aws-and-blackberry-qnx-join-forces-to-accelerate-auto-innovation-with-blackberry-ivy-a-new-intelligent-vehicle-data-platform/\">https://aws.amazon.com/blogs/industries/aws-and-blackberry-qnx-join-forces-to-accelerate-auto-innovation-with-blackberry-ivy-a-new-intelligent-vehicle-data-platform/</a></p>\n\n<p><strong>Next-Gen Vehicle Architectures Unlock Unprecedented Opportunities for Automakers Webinar:</strong> <a href=\"https://onlinexperiences.com/scripts/Server.nxp?LASCmd=AI:4;F:QS!10100&amp;ShowUUID=44A51ADB-0425-420D-8A06-6ACABFCF98FF&amp;LangLocaleID=1033&amp;Referrer=https%3A%2F%2Fwww.autonews.com%2Fevents%3Fevent_type%3D64571\">https://onlinexperiences.com/scripts/Server.nxp?LASCmd=AI:4;F:QS!10100&amp;ShowUUID=44A51ADB-0425-420D-8A06-6ACABFCF98FF&amp;LangLocaleID=1033&amp;Referrer=https%3A%2F%2Fwww.autonews.com%2Fevents%3Fevent_type%3D64571</a></p>\n\n<p><strong>Bloomberg Technology Interview (December 2nd 2020):</strong> cannot post link per Mod rules, but you&#39;ll find the interview on youtube</p>\n\n<p><strong>Blackberry IVY &amp; Connected Cars (McKensey&amp;Co Report):</strong></p>\n\n<p><a href=\"https://www.reddit.com/r/stocks/comments/llis41/blackberry_ivy_connected_cars_mckenseyco_report/\">https://www.reddit.com/r/stocks/comments/llis41/blackberry_ivy_connected_cars_mckenseyco_report/</a></p>\n</div><!-- SC_ON -->",
  "score": 559,
  "permalink": "/r/stocks/comments/lpbit2/blackberry_ivy_aws_deepdive/",
  "subreddit": "stocks",
  "id": "lpbit2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885072
}