{
  "author": "nobaboon",
  "the_new_excerpt": "I generally trade (mostly buy and hold/accumulate) stocks based on experience\nwith the company in the real world. When I become a fanatic is when I buy. I\nalso LOVE outsourcing tasks I can't or don't want to do.\n\nI saw someone post in here about fvrr the other day, read about it more, and\nposted a…",
  "original_created_utc": 1611017857,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一般交易（主要是买入和持有/积累） 股票根据经验\n与公司在现实世界中。当我成为一个狂热者的时候，就是我购买的时候。I\n也喜欢把自己做不了或不想做的任务外包。\n\n前几天在这里看到有人发了关于fvrr的帖子，看多了，也就\n发布了一个...",
      "title": "之前的fvrr帖子让我尝试Fiverr--这是一场小丑秀。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一般交易（主要是買入和持有/積累） 股票根據經驗\n與公司在現實世界中。當我成爲一個狂熱者的時候，就是我購買的時候。I\n也喜歡把自己做不了或不想做的任務外包。\n\n前幾天在這裏看到有人發了關於fvrr的帖子，看多了，也就\n發佈了一個...",
      "title": "之前的fvrr帖子讓我嘗試Fiverr--這是一場小丑秀。"
    }
  ],
  "title": "previous fvrr post made me try Fiverr - it was a clown show.",
  "created_utc": 1611039330,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I generally trade (mostly buy and hold/accumulate) stocks based on experience with the company in the real world. When I become a fanatic is when I buy. I also LOVE outsourcing tasks I can&#39;t or don&#39;t want to do. </p>\n\n<p>I saw someone post in here about fvrr the other day, read about it more, and posted a small job with $100 budget. </p>\n\n<p>I got 137 &quot;offers&quot; within a couple hours. I read *every single one* of these offers, and zero of them were contextual, meaning nobody read, or at least understood, the request. All but several mentioned designing a business card and logo. </p>\n\n<p>The &quot;examples&quot; in all of the profiles were abhorrent. The talent, at least (even?) for this silly request, is truly awful. About 20% of them addressed me with &quot;hello dear&quot; in the response for some reason - the platform is an offshore spam factory pumping out cringeworthy product. </p>\n\n<p>Anyone (that&#39;s used it or not) believe this thing has medium or long term viability?</p>\n</div><!-- SC_ON -->",
  "score": 75,
  "permalink": "/r/stocks/comments/l08czz/previous_fvrr_post_made_me_try_fiverr_it_was_a/",
  "subreddit": "stocks",
  "id": "l08czz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218343
}