{
  "author": "daj0412",
  "original_created_utc": 1625407825,
  "title": "How do academics feel about Tom Holland and his assertions that the morality of the western world was shaped by Christianity?",
  "created_utc": 1625427249,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Firstly, for those wondering, not Spiderman, <a href=\"https://en.wikipedia.org/wiki/Tom_Holland_(author\">this guy</a>).  </p>\n\n<p>Secondly, someone I know sent me some of his stuff. He basically argues (as an atheist) that Christianity shaped the morality of the western world and has become what we <em>generally</em> find it to be today, since the Greeks and Romans. I&#39;m wondering if anything this guy says holds water or if this is religious grasping at straws (even though Holland himself isn&#39;t Christian)</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/odl72c/how_do_academics_feel_about_tom_holland_and_his/",
  "subreddit": "AskHistorians",
  "id": "odl72c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Firstly, for those wondering, not Spiderman, this guy\n[https://en.wikipedia.org/wiki/Tom_Holland_(author]).\n\nSecondly, someone I know sent me some of his stuff. He basically argues (as an\natheist) that Christianity shaped the morality of the western world and has\nbecome what we generally find it to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、気になる人のために、スパイダーマンではなく、この人\n[https://en.wikipedia.org/wiki/Tom_Holland_(author)] です。\n\n第二に、私の知り合いが彼の作品を送ってくれました。彼は基本的に（無神論者として）以下のことを主張します。\n彼は（無神論者として）キリスト教が西欧世界の道徳を形成し、我々が一般的に見ているものになったと主張しています。\n私たちが一般的に感じるようなものになったと（無神論者として）主張しています。",
      "title": "トム・ホランドが「西洋の道徳はキリスト教によって形成された」と主張していることについて、学者たちはどう感じているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，对于那些想知道的人，不是蜘蛛侠，这个人\n[https://en.wikipedia.org/wiki/Tom_Holland_(作者)]。\n\n其次，我认识的人给我寄了一些他的东西。他基本上论证了（作为一个\n无神论者）认为基督教塑造了西方世界的道德，并成为我们普遍认为的道德。\n变成了我们普遍认为的那样......",
      "title": "学者们对汤姆-霍兰和他关于西方世界的道德是由基督教塑造的论断有何看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，對於那些想知道的人，不是蜘蛛俠，這個人\n[https://en.wikipedia.org/wiki/Tom_Holland_(作者)]。\n\n其次，我認識的人給我寄了一些他的東西。他基本上論證了（作爲一個\n無神論者）認爲基督教塑造了西方世界的道德，併成爲我們普遍認爲的道德。\n變成了我們普遍認爲的那樣......",
      "title": "學者們對湯姆-霍蘭和他關於西方世界的道德是由基督教塑造的論斷有何看法？"
    }
  ]
}