{
  "author": "_s79",
  "original_created_utc": 1636446792,
  "title": "Crypto.com introduces new way to get free crypto “Missions” where you can earn and redeem diamonds with daily tasks up to $8k",
  "created_utc": 1636468555,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve just updated to the latest version of the app and noticed that they have introduced a new feature called “missions”. </p>\n\n<p>It appears to be a cross between the Coinbase earn and the coin market cap / coin gecko daily tasks since it also involves collecting “diamonds”. You can do simple tasks or reach milestones to collect these free diamonds. They’re stored in your “diamond vault” within the app, and once you hit 25 you can then redeem them for a mystery box CRO gift. </p>\n\n<p>Each Mystery Box costs 25 Diamonds, and contains up to USD 8,000 worth of CRO!</p>\n\n<p>I already use the app daily so I’ll be doing this for sure.</p>\n\n<p>//edit 1: Looks like they updated their blog post 15mins ago and the value is now $1,100 and not $8,000</p>\n\n<p>“Each Mystery Box costs 25 Diamonds, and contains up to USD 1,100 worth of CRO!”</p>\n\n<p>//edit 2: Opening the diamonds mission centre each day will earn you 1 free diamond</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/qpzbpm/cryptocom_introduces_new_way_to_get_free_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qpzbpm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve just updated to the latest version of the app and noticed that they have\nintroduced a new feature called “missions”.\n\nIt appears to be a cross between the Coinbase earn and the coin market cap /\ncoin gecko daily tasks since it also involves collecting “diamonds”. You can do\nsimple tasks or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、最新版のアプリにアップデートしたところ、「ミッション」という新機能が導入されていることに気づきました。\nミッション」と呼ばれる新機能を導入していることに気づきました。\n\nこれは、Coinbase earnとcoin market cap / を掛け合わせたもののようです。\nCoinbase earnとcoin market cap / coin geckoのデイリータスクを掛け合わせたもののようです。あなたができること\n簡単なタスクや...",
      "title": "Crypto.com、無料でクリプトを入手する新しい方法を導入 「Missions」では毎日のタスクで最大8kのダイヤモンドを獲得・交換可能"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚更新到最新版本的应用程序，并注意到他们已经\n引入了一个名为 \"任务 \"的新功能。\n\n它似乎是Coinbase赚取和硬币市值之间的一个交叉。\n币圈每日任务之间的交叉，因为它也涉及收集 \"钻石\"。你可以做\n简单的任务或...",
      "title": "Crypto.com推出新的方式来获得免费的加密货币 \"任务\"，你可以通过日常任务赚取和兑换钻石，最高可达8千美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛更新到最新版本的應用程序，並注意到他們已經\n引入了一個名爲 \"任務 \"的新功能。\n\n它似乎是Coinbase賺取和硬幣市值之間的一個交叉。\n幣圈每日任務之間的交叉，因爲它也涉及收集 \"鑽石\"。你可以做\n簡單的任務或...",
      "title": "Crypto.com推出新的方式來獲得免費的加密貨幣 \"任務\"，你可以通過日常任務賺取和兌換鑽石，最高可達8千美元"
    }
  ]
}