{
  "author": "AMasterfulWriter",
  "original_created_utc": 1651194520,
  "title": "Does life actually get any better?",
  "created_utc": 1651212976,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically what the title says. I’m 30-years-old in the United States and I can’t honestly convince myself life is worth living. I work 50 hours a week just to barely afford an apartment, I spend the little free time I do have to try to get housework done and &lt;em&gt;maybe&lt;/em&gt; recoup enough to feel better than half-dead come Monday. Most weeks I feel completely drained…like I can’t keep up, let alone get ahead. Is this all I have to look forward to? 40-60 more years of this until I die?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/uea5fe/does_life_actually_get_any_better/",
  "subreddit": "TooAfraidToAsk",
  "id": "uea5fe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Basically what the title says. I’m 30-years-old in the United States and I can’t\nhonestly convince myself life is worth living. I work 50 hours a week just to\nbarely afford an apartment, I spend the little free time I do have to try to get\nhousework done and maybe recoup enough to feel better than…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的にはタイトルの通りです。私は米国に住む30歳ですが、正直言って、生きる価値があるとは思えません。\n正直言って、生きる価値があるとは思えません。週50時間働いて、アパートを買うのがやっと。\n家事をこなし、少しでも回復させるために、わずかな自由な時間を使っています。\n家事をこなし、気分転換を図り...",
      "title": "人生は本当に良くなるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上如标题所述。我在美国已经30岁了，但我无法说服自己\n诚实地说服自己，生活是值得的。我每周工作50个小时只是为了\n我把我仅有的一点空闲时间花在了做家务上，也许还能收回成本。\n我把仅有的一点空闲时间花在做家务上，也许能恢复到比......更好的状态。",
      "title": "生活真的会变得更好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上如標題所述。我在美國已經30歲了，但我無法說服自己\n誠實地說服自己，生活是值得的。我每週工作50個小時只是爲了\n我把我僅有的一點空閒時間花在了做家務上，也許還能收回成本。\n我把僅有的一點空閒時間花在做家務上，也許能恢復到比......更好的狀態。",
      "title": "生活真的會變得更好嗎？"
    }
  ]
}