{
  "author": "PeacefullyFighting",
  "original_created_utc": 1640481715,
  "title": "With only 6% of supply being available what happens to Bitcoin as exchanges dry up?",
  "created_utc": 1640500662,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s something I&amp;#39;ve wondered for a while but what will really happen to bitcoins price as the supply dries up? Yes the scarcity should drive the price up but there are so many other coins out there will people really get into a bidding war for the original coin? It&amp;#39;s even more concerning when so few (not actually that few) control such a large amount of the supply. Will it become more of a collector item? Will the whales start unloading if the price starts to drop? If they do does the price go up or down as people react to it? &lt;/p&gt;\n\n&lt;p&gt;I honestly didn&amp;#39;t thing this would be an issue for another ~50 years but with adoption accelerating maybe it will happen sooner.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/rom13j/with_only_6_of_supply_being_available_what/",
  "subreddit": "CryptoCurrency",
  "id": "rom13j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's something I've wondered for a while but what will really happen to bitcoins\nprice as the supply dries up? Yes the scarcity should drive the price up but\nthere are so many other coins out there will people really get into a bidding\nwar for the original coin? It's even more concerning when so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前から不思議に思っていたことですが、ビットコインは果たしてどうなるのでしょうか。\n供給がなくなると、価格はどうなるのでしょうか？確かに希少性は価格を押し上げるはずですが\n他のコインがたくさんある中で、人々は本当に入札に参加するのだろうか？\nオリジナルコインの争奪戦？そうなると、なおさら気になるのが...。",
      "title": "供給量の6％しかないビットコインは、取引所が枯渇してどうなるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我想了很久的事情，但是随着供应的减少，比特币到底会发生什么？\n价格会发生什么变化？是的，稀缺性应该推动价格上涨，但\n但有那么多其他的硬币在那里，人们真的会陷入对原始硬币的竞价战吗？\n争夺原始币？更令人担忧的是，当这么多...",
      "title": "由于只有6%的供应量，当交易所枯竭时，比特币会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我想了很久的事情，但是隨着供應的減少，比特幣到底會發生什麼？\n價格會發生什麼變化？是的，稀缺性應該推動價格上漲，但\n但有那麼多其他的硬幣在那裏，人們真的會陷入對原始硬幣的競價戰嗎？\n爭奪原始幣？更令人擔憂的是，當這麼多...",
      "title": "由於只有6%的供應量，當交易所枯竭時，比特幣會發生什麼？"
    }
  ]
}