{
  "author": "Alternative_Survey96",
  "original_created_utc": 1644022890,
  "title": "Girls keep stop talking to me because I collect bottles, is it that big of a turn off?",
  "created_utc": 1644030255,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in Michigan where there is a 10 cent bot return on beer and carbonated drinks in a bottle or can. I collect bottles at work, everyone gives them to me, and if I see them sitting on top of the trash I take them, to clarify I do not dig thru the garbage. Then whenever I walk outside which is twice a day I bring around a bag with me everytime and pick up bottles along the way. The last girl I as talking to said she didn&amp;#39;t want to be with some bum who has to go across the street to pick up 10 cents. People get the idea that I am cheap but I most certainly am not. My way of thinking is it is easy pocket cash and I barely have to work for it. I see a bottle there, I take it and it adds up, the only thing it takes is time and two minutes of gas. I usually make 10$ a week. Girls don&amp;#39;t like it but I don&amp;#39;t think I can give it up.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/sktvvo/girls_keep_stop_talking_to_me_because_i_collect/",
  "subreddit": "TooAfraidToAsk",
  "id": "sktvvo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I live in Michigan where there is a 10 cent bot return on beer and carbonated\ndrinks in a bottle or can. I collect bottles at work, everyone gives them to me,\nand if I see them sitting on top of the trash I take them, to clarify I do not\ndig thru the garbage. Then whenever I walk outside which is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の住むミシガン州では、ビールや炭酸飲料に10セントのボットリターンがあります。\n瓶や缶の飲み物 私は職場で瓶を集めていて、みんなからもらいます。\nゴミ箱の上に置いてあるのを見かけたら、取っています。\nゴミを掘り起こす。そして、外を歩くたびに...。",
      "title": "ボトルを集めていると、女の子から話しかけられなくなることが多いのですが、そんなに嫌なんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在密歇根州，那里的啤酒和碳酸饮料有10美分的回扣。\n饮料有10美分的回报。我在工作中收集瓶子，每个人都把它们交给我。\n如果我看到它们被放在垃圾桶上，我就把它们拿走，说明一下我没有\n澄清一下，我没有挖垃圾。然后，每当我走到外面，也就是...",
      "title": "女孩们一直不跟我说话，因为我收集瓶子，这有那么大的反感吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在密歇根州，那裏的啤酒和碳酸飲料有10美分的回扣。\n飲料有10美分的回報。我在工作中收集瓶子，每個人都把它們交給我。\n如果我看到它們被放在垃圾桶上，我就把它們拿走，說明一下我沒有\n澄清一下，我沒有挖垃圾。然後，每當我走到外面，也就是...",
      "title": "女孩們一直不跟我說話，因爲我收集瓶子，這有那麼大的反感嗎？"
    }
  ]
}