{
  "author": "the_random_korean",
  "the_new_excerpt": "My son, the other day, opened his Christmas present and wasn’t happy to see a\nPS5. “Where did you get this money Dad?” “Well, frankly,” I said, “I invested in\nstocks this past year.” “Yeah? Well, I can’t take this,” he goes, “everyone is a\ngenius in a bull market.”\n\nTo be frank with you, I don’t…",
  "original_created_utc": 1610242839,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "前几天，我儿子打开了他的圣诞礼物，不高兴地看到一个\nPS5。“爸爸，你从哪里弄到这笔钱的？”“嗯，坦率地说，”我说，“我投资了\n过去一年的股票。““”是吗？我受不了了，“他说，”每个人都是\n牛市中的天才。“\n\n坦率地说，我不…",
      "title": "我是牛市中的天才。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天，我兒子打開了他的聖誕禮物，不高興地看到一個\nPS5。“爸爸，你從哪裏弄到這筆錢的？”“嗯，坦率地說，”我說，“我投資了\n過去一年的股票。““”是嗎？我受不了了，“他說，”每個人都是\n牛市中的天才。“\n\n坦率地說，我不…",
      "title": "我是牛市中的天才。"
    }
  ],
  "title": "I’m a genius in a bull market.",
  "created_utc": 1610287105,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My son, the other day, opened his Christmas present and wasn’t happy to see a PS5. “Where did you get this money Dad?” “Well, frankly,” I said, “I invested in stocks this past year.”  “Yeah? Well, I can’t take this,” he goes, “everyone is a genius in a bull market.”   </p>\n\n<p>To be frank with you, I don’t celebrate Christmas, and I also don’t have a son, at least, to my knowledge.  </p>\n\n<p>I was just debating the importance of it all. Does it really matter if you’re a genius because of your profits? Or that your profits make you a genius?  I think the adage &quot;everyone is a genius in a bull market&quot; is facetious and it’s unnecessarily so. </p>\n\n<p>You may have heard of the Fidelity manager Peter Lynch and his incredible 12 or 13 year run with 30 percent returns. Did you know his customers on average had only 8 percent gains? That discrepancy is both mind-boggling and not surprising at the same time. People buy high and sell low and pull out all the time since psychology and FOLIA (Fear of Losing It All) plays a big factor even in a bull market.   </p>\n\n<p>So, you’ve made your gains. You deserve it. Give yourselves (and others) more credit. You made an account, continued to pour in your hard earned cash, and bought and held shares with conviction. You are the bull in the market. So pat yourselves on the back and repeat after me:</p>\n\n<p>“I AM a genius because I chose to and continue to participate in this market.”</p>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/stocks/comments/ku4jxr/im_a_genius_in_a_bull_market/",
  "subreddit": "stocks",
  "id": "ku4jxr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381128
}