{
  "author": "Curiosity-Sailor",
  "original_created_utc": 1637766694,
  "title": "Do guys actually tease each other for prioritizing their woman?",
  "created_utc": 1637779750,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like it’s a common media trope where guy friends make fun of/shame their guy friends when they prioritize their girlfriend in any way (such as leaving a hangout cause they scheduled a date or buying them flowers or saying “I love you” when other people are around) and it seems like some guys I have known have felt embarrassed to do these things publicly. Personally I’ve never actually known any people (male or female) to do this to friends. It seems mean-spirited imo, but are there people out there who actually do this? Obviously if you are treating your friends badly they may say something about how you always choose the gf or whatever, but besides that, do you actually know anyone who makes comments like “dude you are so whipped” or “woooow *snicker *snicker” ?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/r17dhk/do_guys_actually_tease_each_other_for/",
  "subreddit": "TooAfraidToAsk",
  "id": "r17dhk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel like it’s a common media trope where guy friends make fun of/shame their\nguy friends when they prioritize their girlfriend in any way (such as leaving a\nhangout cause they scheduled a date or buying them flowers or saying “I love\nyou” when other people are around) and it seems like some guys…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "男友達が自分の彼女を優先していると、その男友達を馬鹿にしたり、恥ずかしいと思ったりするのは、メディアによくある話のような気がします。\n男友達が自分の彼女を優先したときに、男友達を馬鹿にしたり、恥ずかしいと思ったりするメディアの常套手段のように感じます。\n他の人がいるときに「愛してる」と言ったり、花を買ってあげたりするなど\n他の人がいるときに「愛してる」と言うなど）、一部の男が...",
      "title": "実際に男同士で、女を優先していることをからかったりしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得这是一个常见的媒体套路，男人朋友取笑/羞辱他们的\n当他们以任何方式优先考虑他们的女朋友时（例如，因为他们安排了聚会而离开\n因为他们安排了一个约会，或给他们买花，或在其他人在身边时说 \"我爱你\n你\"），而且似乎有些家伙...",
      "title": "男人们真的会因为优先考虑他们的女人而互相取笑吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得這是一個常見的媒體套路，男人朋友取笑/羞辱他們的\n當他們以任何方式優先考慮他們的女朋友時（例如，因爲他們安排了聚會而離開\n因爲他們安排了一個約會，或給他們買花，或在其他人在身邊時說 \"我愛你\n你\"），而且似乎有些傢伙...",
      "title": "男人們真的會因爲優先考慮他們的女人而互相取笑嗎？"
    }
  ]
}