{
  "author": "buuhhu1",
  "original_created_utc": 1637002774,
  "title": "Which is the lowest market cap Project you're bullish on?",
  "created_utc": 1637008295,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>These kind of posts are always useful, maybe we could find some hidden gems we couldn&#39;t otherwise and that&#39;s great, my choice will probably be Altura (ALU) seems like a solid project that tries to make easier to develop NFT games on the BSC and we all know how fast that area is growing as of right now, It was only launched this year and has a market cap of 179M.  </p>\n\n<p>What about you guys, if you only had to choose one which would it be? let&#39;s try to be rational over here and recommend projects that you really did research on...  <del>so please no babyelon</del>  </p>\n\n<p>Edit 1: Just bought some DCIP lol</p>\n</div><!-- SC_ON -->",
  "score": 281,
  "permalink": "/r/CryptoCurrency/comments/qunmx0/which_is_the_lowest_market_cap_project_youre/",
  "subreddit": "CryptoCurrency",
  "id": "qunmx0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These kind of posts are always useful, maybe we could find some hidden gems we\ncouldn't otherwise and that's great, my choice will probably be Altura (ALU)\nseems like a solid project that tries to make easier to develop NFT games on the\nBSC and we all know how fast that area is growing as of right…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この種の投稿は常に有用で、もしかしたら他では見つけられなかった隠れた名品を見つけられるかもしれません。\n私の選択はおそらくAltura (ALU)になるでしょう。\nは、BSCでのNFTゲームの開発を容易にしようとする堅実なプロジェクトのようです。\nBSCでのNFTゲームの開発を容易にしようとする堅実なプロジェクトのようです。",
      "title": "あなたが強気になっている時価総額の低いプロジェクトはどれですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这类帖子总是很有用，也许我们可以找到一些隐藏的宝石，否则我们就无法找到。\n这很好，我的选择可能是Altura（ALU）。\n看起来是一个可靠的项目，它试图使在BSC上开发NFT游戏变得更容易。\n我们都知道这个领域的发展有多快...。",
      "title": "你看好的最低市值项目是哪个？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這類帖子總是很有用，也許我們可以找到一些隱藏的寶石，否則我們就無法找到。\n這很好，我的選擇可能是Altura（ALU）。\n看起來是一個可靠的項目，它試圖使在BSC上開發NFT遊戲變得更容易。\n我們都知道這個領域的發展有多快...。",
      "title": "你看好的最低市值項目是哪個？"
    }
  ]
}