{
  "author": "mironawire",
  "original_created_utc": 1630853793,
  "title": "Crypto is providing supplies for my students",
  "created_utc": 1630881540,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’re all tired of hearing life stories, but this story isn’t about my life; it’s about the lives of my students.</p>\n\n<p>A little background: I am a science and technology teacher in a rural part of a developing country. This job is extremely rewarding, but almost equally as frustrating, especially when it comes to budgeting for our students’ education. This hits my classes particularly hard, being that they are technology-focused and require hardware and software that eats away at the school’s budget. When I ask for something as simple as new mice for the computers, it’s often met with a sigh of exasperation from the administration.</p>\n\n<p>No teacher wants their students to be at a disadvantage just because their classroom doesn’t include the latest gadgets and technology. Paying for supplies and equipment with my own salary was not practical (fellow educators, you know what I’m talking about).</p>\n\n<p>That’s when I decided to do something. I’ve been taking gains off the top of my own crypto earnings during the March/April runup and, if the market stops crabbing, I’ll take some more.</p>\n\n<p>These profits will be used for buying some much-needed equipment to be used in the classroom. Some things that I’ve already been able to procure are electronics/robotics kits! This is so very exciting, because we have been doing either virtual circuits (thank jeebus for Tinkercad!) or cobbling robots together with literal shoestrings and cardboard (which also has its charms).</p>\n\n<p>Here are the new kits ready for the students when we go back to onsite learning:</p>\n\n<p><a href=\"https://preview.redd.it/yg0xlbnv7pl71.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=9b7f570c8cea32879b89f437d06dfd42507cbe0e\">Left: electronics kits with Arduino microcontrollers Right: finished robotic car with ultrasonic sensor / Arduino and breadboard</a></p>\n\n<p>Next on the list are mice/keyboards, a 3D printer, and hopefully some new GPUs. If Moons moon, I know what we’re getting!</p>\n\n<p>We return to school in October and I can’t wait to show the students what we’re going to be working with, all thanks to cryptocurrency!</p>\n\n<p>These kids might not have much, but I hope that I can at least give them the knowledge and experience to go out and be competitive in this world.</p>\n\n<p>And before you ask; yes, I do also teach a little about cryptocurrency/blockchain technology in one of my general computing classes. In addition, we have been using [a certain crypto] as class rewards and doing activities like virtual marketplaces.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/pieju2/crypto_is_providing_supplies_for_my_students/",
  "subreddit": "CryptoCurrency",
  "id": "pieju2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We’re all tired of hearing life stories, but this story isn’t about my life;\nit’s about the lives of my students.\n\nA little background: I am a science and technology teacher in a rural part of a\ndeveloping country. This job is extremely rewarding, but almost equally as\nfrustrating, especially when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人生の話は聞き飽きたものですが、この話は私の人生の話ではありません。\n私の人生ではなく、生徒たちの人生の話です。\n\n少し背景を説明しましょう。私は発展途上国の農村部で科学技術の教師をしています。\n途上国の農村部で科学技術の教師をしています。この仕事は非常にやりがいがありますが、それと同じくらいイライラすることもあります。\n特に...",
      "title": "Cryptoは私の生徒に物資を提供している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都听腻了人生故事，但这个故事不是关于我的人生。\n它是关于我的学生的生活。\n\n一点背景。我是一名科学和技术教师，在一个发展中国家的农村地区。\n发展中国家的农村地区担任科技教师。这份工作非常有意义，但几乎同样令人沮丧。\n挫折感，尤其是当...",
      "title": "Crypto正在为我的学生提供用品"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都聽膩了人生故事，但這個故事不是關於我的人生。\n它是關於我的學生的生活。\n\n一點背景。我是一名科學和技術教師，在一個發展中國家的農村地區。\n發展中國家的農村地區擔任科技教師。這份工作非常有意義，但幾乎同樣令人沮喪。\n挫折感，尤其是當...",
      "title": "Crypto正在爲我的學生提供用品"
    }
  ]
}