{
  "author": "electricp0ww0w",
  "the_new_excerpt": "When it comes to shorting stocks, we know that bad news is often a catalyst for\na price drop.\n\nWhere do you guys go for the most accurate and instant news? I monitor the news\nticker on finviz which updates in real time but there's a lot of guff in there\ntoo. Like it just posts all articles, and…",
  "original_created_utc": 1615728665,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在做空股票的时候，我们知道坏消息往往是一个催化剂。\n一降价。\n\n你们去哪里看最准确的即时新闻？我是看新闻的\n在finviz上的ticker，实时更新，但有很多的废话在里面。\n太。像它只是把所有的文章都贴出来，而且... ...",
      "title": "你在哪里监测最新的突发公司新闻，不是垃圾，就是胡言乱语？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在做空股票的時候，我們知道壞消息往往是一個催化劑。\n一降價。\n\n你們去哪裏看最準確的即時新聞？我是看新聞的\n在finviz上的ticker，實時更新，但有很多的廢話在裏面。\n太。像它只是把所有的文章都貼出來，而且... ...",
      "title": "你在哪裏監測最新的突發公司新聞，不是垃圾，就是胡言亂語？"
    }
  ],
  "title": "Where do you monitor for the latest breaking company news, that isn't either garbage, or waffle?",
  "created_utc": 1615749553,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When it comes to shorting stocks, we know that bad news is often a catalyst for a price drop.</p>\n\n<p>Where do you guys go for the most accurate and instant news? I monitor the news ticker on finviz which updates in real time but there&#39;s a lot of guff in there too. Like it just posts all articles, and around half are just nonsense.</p>\n\n<p>What is considered a good media source for business news, and ideally one that springs news on companies that people don&#39;t keep an eye on.</p>\n\n<p>Every media outlet going posts an article when Tesla do something, but I want news relating to the kind of stocks that only see interest when they start crashing or mooning.</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/stocks/comments/m4v276/where_do_you_monitor_for_the_latest_breaking/",
  "subreddit": "stocks",
  "id": "m4v276",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382525
}