{
  "author": "cefpodoxime",
  "the_new_excerpt": "https://ir.citi.com/_tpHpW8MfaZ1QXwGmP1JGMGXXI95qXm3IMJzUJScLMb6XIjtOls6EbDehXMR3B_o9Opi7mdc5tQ%3D\n\nUS banking giant Citi has authored a new report which suggests bitcoin could\nbecome “an international trade currency” as it evolves.\n\nThe report, entitled “Bitcoin: At the Tipping Point”, charts the…",
  "original_created_utc": 1614599226,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://ir.citi.com/_tpHpW8MfaZ1QXwGmP1JGMGXXI95qXm3IMJzUJScLMb6XIjtOls6EbDehXMR3B_o9Opi7mdc5tQ%3D\n\n美国银行业巨头花旗银行撰写了一份新的报告，该报告指出比特币可能会\n成为 \"一种国际贸易货币\"，随着它的发展。\n\n这份题为 \"比特币：在临界点 \"的报告，描绘了...",
      "title": "花旗分析师称，比特币可能成为 \"国际贸易的首选货币\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://ir.citi.com/_tpHpW8MfaZ1QXwGmP1JGMGXXI95qXm3IMJzUJScLMb6XIjtOls6EbDehXMR3B_o9Opi7mdc5tQ%3D\n\n美國銀行業巨頭花旗銀行撰寫了一份新的報告，該報告指出比特幣可能會\n成爲 \"一種國際貿易貨幣\"，隨着它的發展。\n\n這份題爲 \"比特幣：在臨界點 \"的報告，描繪了...",
      "title": "花旗分析師稱，比特幣可能成爲 \"國際貿易的首選貨幣\""
    }
  ],
  "title": "Bitcoin could become the “currency of choice for international trade”, says Citi analysts",
  "created_utc": 1614608668,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://ir.citi.com/_tpHpW8MfaZ1QXwGmP1JGMGXXI95qXm3IMJzUJScLMb6XIjtOls6EbDehXMR3B_o9Opi7mdc5tQ%3D\">https://ir.citi.com/_tpHpW8MfaZ1QXwGmP1JGMGXXI95qXm3IMJzUJScLMb6XIjtOls6EbDehXMR3B_o9Opi7mdc5tQ%3D</a></p>\n\n<p>US banking giant Citi has authored a new report which suggests bitcoin could become “an international trade currency” as it evolves.</p>\n\n<p>The report, entitled “Bitcoin: At the Tipping Point”, charts the evolution of bitcoin from a form of payment to its current status as a store of value. The authors forecast that bitcoin’s core properties combined with its global reach and neutrality could see it morph into the “currency of choice” for international trade in around seven years.</p>\n\n<p>“Perceptions about what makes bitcoin important continue to evolve and create new opportunities while increasing its perception towards becoming mainstream,” the report states.</p>\n\n<p>“A focus on global reach and neutrality could see bitcoin become an international trade currency. This would take advantage of bitcoin’s decentralized and borderless design, its lack of foreign exchange exposure, its speed and cost advantage in moving money, the security of its payments, and its traceability.”</p>\n\n<p>Citi’s report explain that bitcoin, in the role of a global trade currency, could be used by importers and exporters to pay for goods and services directly – simplifying the process of international trade. A decentralized cryptocurrency may be preferred to a Central Bank Digital Currency, it argues, because “no government or outside entity can take steps that might affect the supply of the trade currency, helping to decouple trade from political considerations.”</p>\n</div><!-- SC_ON -->",
  "score": 2477,
  "permalink": "/r/investing/comments/lv77hg/bitcoin_could_become_the_currency_of_choice_for/",
  "subreddit": "investing",
  "id": "lv77hg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740757
}