{
  "author": "ihasanemail",
  "the_new_excerpt": "This isn't legal or financial advice. I'm just a dumbass with some life\nexperience to share.\n\nFirst, buy some goddamn personal umbrella insurance. It's cheap af, like I pay\n$400 a year for mine. And it's easy af to buy. What is umbrella insurance? It's\nsomething poor people will never have to worry…",
  "original_created_utc": 1611622318,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这不是法律或财务建议。我只是个有一些生活经验的蠢货而已\n的经验来分享。\n\n首先，买一些该死的个人雨伞保险。这很便宜，就像我付\n我的一年400元 而且很容易买 什么是伞形保险？就是...\n穷人永远不用担心的东西... ...",
      "title": "这里是千禧年老人。如果你马上要预订高6或7、8位数的收益，请帮我这两个忙，这样我就可以放心了，知道你的小弟弟会很安全。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是法律或財務建議。我只是個有一些生活經驗的蠢貨而已\n的經驗來分享。\n\n首先，買一些該死的個人雨傘保險。這很便宜，就像我付\n我的一年400元 而且很容易買 什麼是傘形保險？就是...\n窮人永遠不用擔心的東西... ...",
      "title": "這裏是千禧年老人。如果你馬上要預訂高6或7、8位數的收益，請幫我這兩個忙，這樣我就可以放心了，知道你的小弟弟會很安全。"
    }
  ],
  "title": "Elder millennial here. If you're booking a high-6 or 7 or 8 digit gain soon, do me these two favors so I can rest easy knowing your tendies will be safe.",
  "created_utc": 1611651946,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This isn&#39;t legal or financial advice. I&#39;m just a dumbass with some life experience to share.</p>\n\n<p><strong>First, buy some goddamn personal umbrella insurance.</strong> It&#39;s cheap af, like I pay $400 a year for mine. And it&#39;s easy af to buy. What is umbrella insurance? It&#39;s something poor people will never have to worry about, so be glad it&#39;s in your life now. <strong>It protects you from lawsuits by parasites by adding million(s) of dollars in personal liability coverage above and beyond the policy limits of your auto, renters or homeowners insurance.</strong></p>\n\n<p>Your shitty auto/renter/homeowners policies have limits of a couple hundred thousand bucks max. If you hit somebody&#39;s car, if someone slips and falls in your house, if someone accuses you of sexual assault, odds are there they will want to sue you. Any plaintiff&#39;s attorney worth half a fuck that they hire is going to do their research on you and when they do their DD and find out you have tons of assets now, they are going to come after way more than what they wanted thinking you were just some broke nobody. Umbrella insurance protects you from the unlikely but ever present threat of bankruptcy through lawsuits now that you are rich target. I&#39;ve seen way too many idiot doctors and successful small business owners lose their life&#39;s work through negligence lawsuits and not having umbrella policies in place that would have stopped it.</p>\n\n<p>Which brings me to my second request of you. Don&#39;t make yourself an obvious target. <strong>Keep your goddamn mouth shut about your tendies and tell no one the particulars. Don&#39;t even fucking hint at it.</strong> Don&#39;t tell dad to make him proud, don&#39;t tell strangers to impress them and feel good, don&#39;t tell some girl to get her to fuck you. I don&#39;t care if you shower the people you love with gifts, it&#39;s none of my business. If they ask, just say you had a good year trading and leave it at that.</p>\n\n<p>Neither of my parents know about my trading profits, nor that I&#39;m a millionaire. None of my friends know. I&#39;ll go to my grave not telling a soul. Because I see how people treat the people I know IRL who do flaunt it and I&#39;m disgusted how some people (not all) no longer view you as a person, just something to exploit. </p>\n\n<p><strong>Why tf should you listen to me? Maybe you shouldn&#39;t. I was wrong af about GME.</strong> I posted how I thought it was trash from $10 to $30 and while I thought <a href=\"/u/DeepFuckingValue\">u/DeepFuckingValue</a> deserved props for eating shit all year and holding strong, I thought the rest of you were FOMO sheep chasing it in the $20s. Mea culpa. I&#39;m glad I was wrong. I&#39;ve never seen so many rattled old white men before in my life before this week and it&#39;s great. I&#39;m genuinely happy for you guys that hit it big and hope the squeeze isn&#39;t over. Please consider what I&#39;ve said. Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 10524,
  "permalink": "/r/wallstreetbets/comments/l5289p/elder_millennial_here_if_youre_booking_a_high6_or/",
  "subreddit": "wallstreetbets",
  "id": "l5289p",
  "is_self": true,
  "media": null,
  "is_video": false
}