{
  "author": "Mallardshead",
  "original_created_utc": 1645899825,
  "title": "Runs on Russian banks likely to start on Monday morning if SWIFT sanctions pass.",
  "created_utc": 1645943468,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The solvency of most Russian banks will be at grave risk. The Ruble is in a historic collapse, and their MOEX stocks can&amp;#39;t sustain a drop further; it&amp;#39;s down 60% in 90-days, all while Brent tops $100, which is crazy considering most of the exchange is made of gas giants. Gold is acting counterintuitively as well, retreating from a feel-good faux spike. Russia&amp;#39;s largest bank limited withdrawals to $20 yesterday. Apple Pay doesn&amp;#39;t work after Apple removed banking support in Russia. Reports on the ground that most debit cards have been suspended. Reports credit cards have had their limits slashed 50% or more. And it&amp;#39;s only been 24 hours...&lt;/p&gt;\n\n&lt;p&gt;What happens in the next 72-hours will in my opinion lay the groundwork for bitcoin&amp;#39;s next violent uptrend.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/Bitcoin/comments/t23jum/runs_on_russian_banks_likely_to_start_on_monday/",
  "subreddit": "Bitcoin",
  "id": "t23jum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The solvency of most Russian banks will be at grave risk. The Ruble is in a\nhistoric collapse, and their MOEX stocks can't sustain a drop further; it's down\n60% in 90-days, all while Brent tops $100, which is crazy considering most of\nthe exchange is made of gas giants. Gold is acting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシアのほとんどの銀行の支払能力は、重大なリスクにさらされることになる。ルーブルは\n歴史的な大暴落で、MOEXの株価はこれ以上の下落に耐えられない。\nブレントが100ドルを超える中、90日間で60％。\n取引所はガスの巨大企業で構成されています。金の挙動は...",
      "title": "SWIFT制裁が可決されれば、月曜日の朝にロシアの銀行への融資が開始される可能性が高い。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数俄罗斯银行的偿付能力将面临严重风险。卢布正处于历史性的崩溃之中。\n历史性的崩溃，他们的MOEX股票不能再继续下跌了；它已经下跌了\n在90天内下降了60%，而布伦特原油则达到了100美元的高位，这太疯狂了，因为大部分的\n考虑到该交易所的大部分都是天然气巨头，这很疯狂。黄金的表现...",
      "title": "如果SWIFT制裁通过，俄罗斯银行可能在周一早上开始出现挤兑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數俄羅斯銀行的償付能力將面臨嚴重風險。盧布正處於歷史性的崩潰之中。\n歷史性的崩潰，他們的MOEX股票不能再繼續下跌了；它已經下跌了\n在90天內下降了60%，而布倫特原油則達到了100美元的高位，這太瘋狂了，因爲大部分的\n考慮到該交易所的大部分都是天然氣巨頭，這很瘋狂。黃金的表現...",
      "title": "如果SWIFT制裁通過，俄羅斯銀行可能在週一早上開始出現擠兌。"
    }
  ]
}