{
  "author": "Forward-Fuel-4134",
  "original_created_utc": 1656669645,
  "title": "Are working conditions in the USA really that bad?",
  "created_utc": 1656687603,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Having worked in Germany, the UK and Australia, I have always been relatively lucky with my line of work and the benefits associated with it, regardless of my employer. However, I keep reading about these atrocious working conditions in the US with people claiming they get less than 2 weeks holiday (or as I just learned: PTO) per year, no health benefits, etc… is working in the US really that bad? How do people on reality TV shows take time of work? What do you do if you’re ill - do you still go in? Sorry, might seem like a silly question but just curious.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/vox6n5/are_working_conditions_in_the_usa_really_that_bad/",
  "subreddit": "TooAfraidToAsk",
  "id": "vox6n5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Having worked in Germany, the UK and Australia, I have always been relatively\nlucky with my line of work and the benefits associated with it, regardless of my\nemployer. However, I keep reading about these atrocious working conditions in\nthe US with people claiming they get less than 2 weeks holiday…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドイツ、イギリス、オーストラリアで仕事をした経験から、私はいつも比較的\nにかかわらず、自分の仕事とそれに関連する福利厚生に比較的恵まれています。\n比較的恵まれていた。しかし、アメリカでの劣悪な労働条件については、いつも読んでいます。\nアメリカでは、2週間も休みがないと言っている人がいるそうです...。",
      "title": "アメリカの労働環境は本当に悪いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾在德国、英国和澳大利亚工作过，我一直都是比较\n在德国、英国和澳大利亚工作过，我一直对自己的工作和相关的福利比较幸运，不管我的雇主是谁。\n雇主。然而，我一直在阅读关于美国这些残暴的工作条件的报道。\n美国人声称他们得到的假期不到2周......",
      "title": "美国的工作条件真的那么糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾在德國、英國和澳大利亞工作過，我一直都是比較\n在德國、英國和澳大利亞工作過，我一直對自己的工作和相關的福利比較幸運，不管我的僱主是誰。\n僱主。然而，我一直在閱讀關於美國這些殘暴的工作條件的報道。\n美國人聲稱他們得到的假期不到2周......",
      "title": "美國的工作條件真的那麼糟糕嗎？"
    }
  ]
}