{
  "author": "Joeman720",
  "the_new_excerpt": "Hey all. I plan on using this summer to deepen my knowledge on philosophy. I am\ngonna be a little personal so look for the main point in the last sentence of\nthis paragraph if you dont care. Sadly, I am currently in a bad situation were\nmy ADHD is unmedicated so reading advanced writings is VERY…",
  "original_created_utc": 1619747985,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私はこの夏、哲学の知識を深めるために利用しようと考えています。私は\n少し個人的な話になるので、この段落の最後の文にある主旨を探してください。\n気にならなければ、この段落の最後の文で要点を探してみてください。悲しいことに、私は現在、以下のような悪い状況にあります。\n私のADHDは薬を飲んでいないので、高度な文章を読むことはとても...",
      "title": "最も影響力のある哲学者について、有名な大学の無料講義を紹介してくれませんか？例えば、プラトンやカントについてのコーラスや特別な講義などです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我打算利用这个夏天来加深我的哲学知识。我将\n会有点个人化，所以请在本段的最后一句话中寻找主要观点。\n如果你不关心的话，请在本段的最后一句话中寻找重点。可悲的是，我目前的情况很糟糕，因为\n我的多动症没有得到治疗，所以阅读高级著作是非常...",
      "title": "你们能推荐知名学院关于最有影响力的哲学家的免费讲座吗？比如关于柏拉图或康德的讲座，或者专门的讲座。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我打算利用這個夏天來加深我的哲學知識。我將\n會有點個人化，所以請在本段的最後一句話中尋找主要觀點。\n如果你不關心的話，請在本段的最後一句話中尋找重點。可悲的是，我目前的情況很糟糕，因爲\n我的多動症沒有得到治療，所以閱讀高級著作是非常...",
      "title": "你們能推薦知名學院關於最有影響力的哲學家的免費講座嗎？比如關於柏拉圖或康德的講座，或者專門的講座。"
    }
  ],
  "title": "Can you guys recommend free lectures from well known colleges about the most influential philosophers? Such as coruses or specfic lectures about Plato or Kant.",
  "created_utc": 1619788302,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all. I plan on using this summer to deepen my knowledge on philosophy. I am gonna be a little personal so look for the main point in the last sentence of this paragraph if you dont care. Sadly, I am currently in a bad situation were my ADHD is unmedicated so reading advanced writings is VERY difficult. I do plan on working on developing my reading skills with my situtuation, but with fictional stories that are easy to follow. While I get my reading skills into shape to be prepared for the real deal, I would like to learn from video lectures as much context for the famous philosophers and then learn about their ideas as I feel its much easier for me to learn subjects in a class like setting.</p>\n\n<p>&#x200B;</p>\n\n<p>I found an old reddit post from this sub recommending <a href=\"https://oyc.yale.edu/philosophy\">these</a> 2 lectures, and while skimming through it does show bits and pieces of what I want, its not exactly what I would like. Thanks for all the help and never stop learning philosophy!</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/askphilosophy/comments/n1juzr/can_you_guys_recommend_free_lectures_from_well/",
  "subreddit": "askphilosophy",
  "id": "n1juzr",
  "is_self": true,
  "media": null,
  "is_video": false
}