{
  "author": "shavin_high",
  "original_created_utc": 1625076017,
  "title": "What are some of the simpler changes the United States government could do to help better the quality of life for the Middle and Lower Class?",
  "created_utc": 1625128968,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m really really hoping the mods see this as a good faith question. As someone who finds politics extremely complicated and confusing, but always strives for more  knowledge, I&#39;d like here some thoughts on things that would simply help people be happier and better off.</p>\n\n<p>I get that the problems this country faces are complicated, but if Dems and the GOP could actually come together and work side by side, I&#39;d be curious of the first things that the government could implement that would benefit all sides of the political spectrum and start healing this nation.</p>\n\n<p>I feel like this is reasonable question to ask this sub because it&#39;s a tough problem to tackle and I bet there will be a lot of opinions on something so broad. I hope this question can lead to some thought provoking ideas.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/Ask_Politics/comments/ob2rrl/what_are_some_of_the_simpler_changes_the_united/",
  "subreddit": "Ask_Politics",
  "id": "ob2rrl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm really really hoping the mods see this as a good faith question. As someone\nwho finds politics extremely complicated and confusing, but always strives for\nmore knowledge, I'd like here some thoughts on things that would simply help\npeople be happier and better off.\n\nI get that the problems this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "司会者がこれを誠意ある質問として見てくれることを本当に心から願っています。誰かとして\n政治は非常に複雑で分かりにくいと思いつつも、常に努力している。\nより多くの知識を得るために、単純に役立つことについての考えをここに述べたいと思います。\nを、より幸せに、より良くするために。\n\n私は、この問題が...",
      "title": "中流・下流階級の人々の生活の質を向上させるために、米国政府ができる簡単な改革にはどのようなものがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的非常希望版主把这看作是一个善意的问题。作为一个\n发现政治非常复杂和混乱，但总是努力争取更多的知识。\n的人，我想在这里提出一些想法，这些想法可以简单地帮助\n人们更快乐和更好地生活。\n\n我明白，这个问题...",
      "title": "美国政府可以做哪些比较简单的改变来帮助改善中产阶级和下层阶级的生活质量？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的非常希望版主把這看作是一個善意的問題。作爲一個\n發現政治非常複雜和混亂，但總是努力爭取更多的知識。\n的人，我想在這裏提出一些想法，這些想法可以簡單地幫助\n人們更快樂和更好地生活。\n\n我明白，這個問題...",
      "title": "美國政府可以做哪些比較簡單的改變來幫助改善中產階級和下層階級的生活質量？"
    }
  ]
}