{
  "author": "steavus",
  "the_new_excerpt": "Its been almost a year sinds the bitcoin halving. The halving has always been\nthe start of the bullrun and this time, it wasnt any different. Technical\nanalyst Rekt Capital looks at when the bull run might reach its peak.\n\nTo look when bitcoin will have his peak in this bullrun, we have to look back…",
  "original_created_utc": 1620645128,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインが半額になってから約1年が経ちました。半分になることはいつも\n半分になることがブルランの始まりであり、今回もそうであった。テクニカル\nアナリストのRekt Capital氏は、ブルランがいつピークに達するかを考察しています。\n\n今回のブルランでビットコインがいつピークを迎えるかを考えるには、過去を振り返る必要があります...",
      "title": "ブルランはいつまで続くのか？過去を利用して未来を予測しよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币减半已经过去快一年了。减半一直是\n的开始，这一次，它没有任何不同。技术分析师\n分析师Rekt Capital研究了牛市运行何时可能达到顶峰。\n\n要想知道比特币何时会在这轮牛市中达到顶峰，我们必须回顾一下...",
      "title": "牛市运行将持续多久？让我们用过去来预测未来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣減半已經過去快一年了。減半一直是\n的開始，這一次，它沒有任何不同。技術分析師\n分析師Rekt Capital研究了牛市運行何時可能達到頂峯。\n\n要想知道比特幣何時會在這輪牛市中達到頂峯，我們必須回顧一下...",
      "title": "牛市運行將持續多久？讓我們用過去來預測未來"
    }
  ],
  "title": "How long will the bullrun last? Lets use the past to predict the future",
  "created_utc": 1620657219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Its been almost a year sinds the bitcoin halving. The halving has always been the start of the bullrun and this time, it wasnt any different. Technical analyst Rekt Capital looks at when the bull run might reach its peak.</p>\n\n<p>To look when bitcoin will have his peak in this bullrun, we have to look back to see what happend the last couple of times. Important dates are the BTC halvings. The analysis uses the bottom before the bullrun and the peak in the bullrun. Based on these two dates, Rekt Capital try&#39;s to predict the future. Here is the anaylsis:</p>\n\n<p><strong>Bitcoin halving 1; 28 november 2012:</strong></p>\n\n<p><a href=\"https://preview.redd.it/4efcrj80c9y61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=ae9bc3b938a98fb0cbf74d38b2a99bbf459c5f0b\">https://preview.redd.it/4efcrj80c9y61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=ae9bc3b938a98fb0cbf74d38b2a99bbf459c5f0b</a></p>\n\n<p>How many days did Bitcoin bottom before its first-ever halving? <strong>378 days.</strong></p>\n\n<p>How many days did Bitcoin top out after its first-ever halving?  <strong>364 days.</strong></p>\n\n<p>It took roughly the same amount of time for Bitcoin to bottom prior to halving #1 (378 days) as it took for Bitcoin to rally before topping out after its second post-Halving #1 Market Cycle (364 days).</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Bitcoin halving 2; July 9 2016:</strong></p>\n\n<p><a href=\"https://preview.redd.it/l8v5rxixc9y61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=ba0eaf0cdb3786c12742226fb13f40d1186615cb\">https://preview.redd.it/l8v5rxixc9y61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=ba0eaf0cdb3786c12742226fb13f40d1186615cb</a></p>\n\n<p>How many days did Bitcoin bottom before its first-ever halving? <strong>546 days.</strong></p>\n\n<p>How many days did Bitcoin top out after its second halving? <strong>518 days.</strong></p>\n\n<p>It took  the same amount of time for Bitcoin to bottom prior to halving (546 days) as it took for Bitcoin to rally before topping out after its second post-halving market cycle (518 days).</p>\n\n<p><strong>This means based on the last 2 bullruns:</strong></p>\n\n<p>It takes approximately the same amount of time for Bitcoin to bottom prior to the halving event as it takes to peak after the halving event.</p>\n\n<p><strong>Bitcoin halving 3; 18 may 2020:</strong></p>\n\n<p><a href=\"https://preview.redd.it/fq97v9scd9y61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=ef6c36ed017341762dd24415b97d9aabed89ad69\">https://preview.redd.it/fq97v9scd9y61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=ef6c36ed017341762dd24415b97d9aabed89ad69</a></p>\n\n<p><strong>Conclusion:</strong></p>\n\n<p>Bitcoin bottomed 511 days before halving 3.</p>\n\n<p>So if it takes BTC 511 days after the halving to peak: that means that Bitcoin is likely to top out in early Q4, 2021. <strong>Specifically: October 2021.</strong></p>\n\n<p>Ofcourse every bullrun is a bit different. Based on the analysis we still have a major peak to get in the next couple of months. But it wont last till the end of the year.</p>\n\n<p>Stay safe :)</p>\n</div><!-- SC_ON -->",
  "score": 1623,
  "permalink": "/r/CryptoCurrency/comments/n91xq3/how_long_will_the_bullrun_last_lets_use_the_past/",
  "subreddit": "CryptoCurrency",
  "id": "n91xq3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992419
}