{
  "author": "ManunitedRedDevil",
  "the_new_excerpt": "Hello everyone,\n\nI’m a 24 year old student who started investing a few months ago and would like\nto talk a bit about Nano Dimensions. The sources for the information below has\nbeen taken from Yahoo Finance, Interviews with the CEO, Videos that the company\nhas made, other DD’s that had info I found…",
  "original_created_utc": 1616014291,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我是一名24岁的学生，几个月前开始投资，想。\n来谈一谈纳米尺寸。以下信息的来源有\n已从雅虎财经、CEO访谈、视频，该公司的\n已经做出了，其他DD的信息，我发现... ...",
      "title": "关于纳米尺寸的基本丈量，以及为什么它具有重大的长期潜力。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我是一名24歲的學生，幾個月前開始投資，想。\n來談一談納米尺寸。以下信息的來源有\n已從雅虎財經、CEO訪談、視頻，該公司的\n已經做出了，其他DD的信息，我發現... ...",
      "title": "關於納米尺寸的基本丈量，以及爲什麼它具有重大的長期潛力。"
    }
  ],
  "title": "Basic DD on Nano Dimensions and why it has major long term potential",
  "created_utc": 1616079316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone, </p>\n\n<p>I’m a 24 year old student who started investing a few months ago and would like to talk a bit about Nano Dimensions. \nThe sources for the information below has been taken from Yahoo Finance, Interviews with the CEO, Videos that the company has made, other DD’s that had info I found to be usefull. Hope y’all like it. </p>\n\n<p><strong>What does Nano Dimensions do?</strong></p>\n\n<p>First off. They sell 3D printers that can print all kinds of complex electric components like circuit boards, capacitators, antennes, sensors and SEMI CONDUCTURS.  Which Biden signed the executive order for because of the shortage of those at the end of last month. The CEO has a good track record. This ain’t his first Rodeo. Been involved in Aerospace, Security etc. Eli David is on the Board of Directors.</p>\n\n<p><strong>Now why would anyone buy those printers?\nWell a bunch of reasons.</strong></p>\n\n<ol>\n<li><p>No outsourcing of production which saves them money. </p></li>\n<li><p>Increases confidentiality cause customers build their own IP. (E.g: Important for Defense/Medical)</p></li>\n<li><p>Time saving since customers are able to get their prototypes within hours instead of days-weeks. </p></li>\n<li><p>Eco Friendly cause less waste compared to current manufacturing process</p></li>\n<li><p>Automated printer = less operator maintenace</p></li>\n<li><p>Able to be used 24/7</p></li>\n<li><p>Their machines are just so much more efficient. E.g; The more layers a circuit board has, the more complex the manufacturing is right? Not for these printers. Nano Dimension&#39;s printers can print up to 30 layers at the same cost and ease as one with 2 layers. </p></li>\n<li><p>Will become able to be used in space. Whole lot cheaper to have some electronic component manufactured right there instead of having to send something into space. <em>CEO said that they will test the materials in Space and plan to manufacture Products for the use in Space. But for now they don&#39;t play to produce in space, that would contradict their plans for the automatic factory.</em></p></li>\n</ol>\n\n<p><strong>Financials:</strong></p>\n\n<p>They did a bunch of offerings. Any shareholder might know that it’s been a bumpy ride. But it’s been worth it. \nCurrently they’re sitting at little below $1.5 Billion cash and zero debt.\nMarket cap: $2.81B</p>\n\n<p><strong>Revenue:</strong></p>\n\n<p>2019 4thQ: $1.977.000</p>\n\n<p>2020 3rdQ: $438.000</p>\n\n<p>2020 4th Q: $1.971.000</p>\n\n<p>This is a $6k YoY decrease from their 2019 4thQ Revenue. \nNow why isn’t this really that bad of a signal? Most of their revenue comes from selling these printers. These go for hundreds of thousands. Due to covid a lot of entities decided to hold off on capital expenses causing a major dip in revenue. But even tho covid is for the most part still around; we have seen a major spike compared to the previous quarter as capital expenses have started to open up for some of them. They were expected to have a lot less revenue and managed to hold pretty strong under the current circumstances.</p>\n\n<p><strong>What about competition?</strong>\nWell tbh. Atm there ain’t no competition. Literally no one. These guys secured the patents. If this pops off they taking it all. </p>\n\n<p><strong>So where&#39;s the money coming from?</strong>\nThey sell to Defense, Research Institutions, Automotive, Medical, fucking everywhere. I mean its electrical products they&#39;re making. What industry doesn’t use them? </p>\n\n<p><strong>Revenue streams:</strong></p>\n\n<p><strong>1. Printer Sales</strong>\nAs I said, these machines go for hundreds of thousands.  70% of customers renews their machine every time a new one comes out. They like the tech. So big chance that any new customer will buy more than 1 printer. Which ofc. also means years of recurring revenue and maintenance contracts.</p>\n\n<p><strong>2. Recurring Revenue</strong>\nThe blades and material need to be replaced.</p>\n\n<p><strong>3. Nanoservices</strong>\nThis is an interesting one. Last year they barely sold machines since companies atm lack the budget for these printers. However revenue was better than expected since customers who are currently lacking the budget come and pay for Nano Dimensions to print their project for them. Can be anywhere from $5-20k per project. \nThe thing thats good here is, its a great opportunity for them to build a relationship with their customers and make them more familiar with the tech. CEO expects many of these customers to start buying the machines when their budgets open up post covid, causing a sling shot effect in sales. </p>\n\n<p><strong>4. Maintenance contracts</strong>\nSpeaks for itself</p>\n\n<p>So where is their potential growth? </p>\n\n<ol>\n<li> They will release a new printer this year. <em>New Printer-Generation will be announced early summer, shipping will be possible eoy</em></li>\n<li> They are still looking for more new types of electrical components to manufacture. <em>They are looking into nano-mechanical devices as well</em></li>\n<li>They are looking for acquisitions in 2 types of companies. I&#39;ll explain more on that below</li>\n<li> They are planning on making printers that will be able to be used for production instead of prototyping/testing. Some defense companies already use this as production because the projects they require aren’t possible to manufacture without these printers.\nNow I don’t think I gotta explain why that’s a good thing.\nOnce their machines are able to be used for production that will open a completely new door to them  I believe 2022 is what the CEO said IIRC. </li>\n</ol>\n\n<p><strong>Acquisitions</strong></p>\n\n<p>Now this $1.5B is gonna come in handy. It will be shares and cash for these acquisitions tho.  However the CEO refuses to enter the “rat race” where private companies have become overvalued and is taking his time to decide, refusing to overpay. Says he is in talks with multiple companies atm. </p>\n\n<p>Now the 2 types of companies they are looking to acquire are:</p>\n\n<p><strong>Type A</strong>: Companies that can help them with distribution and are working in the pcb industry. Market cap of $50-200M. </p>\n\n<p><strong>Type B</strong>: Companies that have tech that they want to own and/or think is going to be big in 2-3 years.</p>\n\n<p>Note: <em>One of the european ones will be a producer of machines, prop. central or eastern europe, to help them reducing their time to market for Dragonfly NG</em></p>\n\n<p><strong>Risks</strong></p>\n\n<p>There is always a chance of them doing more offerings, although I don’t see that happening personally. <em>CEO made clear that they did not plan it in the near future.</em>\nThis is right now a niche market but with years will become huge imo. If you want something to daytrade this stock might not be it for you. It can be very volatile so if that’s not your thing stay away too. Also if they don’t spend this $1.5B wisely, investors may lose trust after having shares diluted a bunch of times. Personally I trust the CEO because of his track record with acquiring companies and taking his time, refusing to overpay for companies. </p>\n\n<p>That’s all I’ve got. \nWould like to hear some feedback. Anyone else invest in Nano Dimensions? What’s ya’ll opinions on the company and the future share price? Good investment or waste of time?</p>\n\n<p><strong>TLDR; GOOD STOCK. BUY WHEN RED. CHECK BACK IN 5 YEARS.</strong></p>\n\n<p>Edit: added some points made by <a href=\"/u/KhanUlrik\">u/KhanUlrik</a>. See Italic text</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/m7ac50/basic_dd_on_nano_dimensions_and_why_it_has_major/",
  "subreddit": "stocks",
  "id": "m7ac50",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819544
}