{
  "author": "laurabug92",
  "original_created_utc": 1633669004,
  "title": "Longtime guy friend sent me a dick pic…why am I SO upset about it?",
  "created_utc": 1633683429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A brief background…I’ve known this guy for about 11 years. We didn’t talk a ton while I was married, but I’m newly divorced (do not congratulate me, I am devastated), so he and I have been chatting more lately. He’s in another state. I have no attraction to him at all, and I’ve said I’m not interested in dating…especially not now….\nSo yesterday, I open up his message on Snapchat and there it is. His dick. And not just a picture…oh no. It was a video.\nI was so shocked and pissed that he would just do that. Then I just had the overwhelming urge to cry. I felt violated somehow.\nI feel like I’m majorly overreacting…but now I don’t even want to talk to him. I don’t understand why he thought something like that would be okay. Especially with the situation I’m in with being newly divorced. I feel violated and completely disrespected.\nAm I overreacting?\nBut also, why do guys do this shit?!</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/q3qr1e/longtime_guy_friend_sent_me_a_dick_picwhy_am_i_so/",
  "subreddit": "TooAfraidToAsk",
  "id": "q3qr1e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A brief background…I’ve known this guy for about 11 years. We didn’t talk a ton\nwhile I was married, but I’m newly divorced (do not congratulate me, I am\ndevastated), so he and I have been chatting more lately. He’s in another state.\nI have no attraction to him at all, and I’ve said I’m not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単な背景を説明すると...この人とは11年くらいの付き合いになります。私たちは結婚している間はあまり話しませんでした。\n私が結婚している間はあまり話しませんでしたが、私は新たに離婚しました（祝福しないでくださ\nお祝いしないでください。私はとてもショックを受けています）。彼は別の州にいます。\n私は彼に全く魅力を感じていませんし、私はそうではないと言っています...。",
      "title": "長年の男友達がチンポの写真を送ってきた......なんで私はこんなに動揺しているんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简单介绍一下背景......我认识这个人大约有11年了。我们没有聊过很多\n但我刚离婚（不要祝贺我，我很伤心），所以最近他和我聊得比较多。\n所以他和我最近聊得比较多。他在另一个州。\n我对他一点吸引力都没有，我也说过我不...",
      "title": "长期以来的男性朋友给我发了一张鸡巴照片......为什么我对它如此不安？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡單介紹一下背景......我認識這個人大約有11年了。我們沒有聊過很多\n但我剛離婚（不要祝賀我，我很傷心），所以最近他和我聊得比較多。\n所以他和我最近聊得比較多。他在另一個州。\n我對他一點吸引力都沒有，我也說過我不...",
      "title": "長期以來的男性朋友給我發了一張雞巴照片......爲什麼我對它如此不安？"
    }
  ]
}