{
  "author": "borgorop",
  "the_new_excerpt": "Bisexuality is ironically stigmatized not just amongst some straight people but\nin LGBT circles. It's common for people to believe \"bi woman are really just\nstraight and bi men are just gay\".\n\nBut when it comes to males and being attracted to both genders, many people\ndoubt it. I recently thought…",
  "original_created_utc": 1623702681,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バイセクシャルは皮肉なことに、一部のストレートの人たちだけでなく、LGBTの世界でも汚名を着せられています。\n皮肉なことに、バイセクシャルは一部のストレートの人々だけでなく、LGBTの世界でも汚名を着せられています。一般的には、「バイの女性は、本当は\n男性の場合は、両方の性に惹かれていることになります。\n\nしかし、男性の場合、両方の性別に惹かれるということになると、多くの人が疑っています。\n疑ってしまいます。私が最近思ったのは...。",
      "title": "なぜ男性のバイセクシャルが女性のバイセクシャルよりも疑われるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "具有讽刺意味的是，双性恋不仅在一些异性恋者中被污名化，而且在LGBT圈子里也被污名化。\n在LGBT圈子里。人们普遍认为 \"双性恋女人其实只是异性恋，双性恋男人只是同性恋\"。\n直人，而双性恋男人只是同性恋\"。\n\n但是当涉及到男性和被两种性别吸引时，许多人\n怀疑它。我最近想...",
      "title": "为什么男性双性恋比女性双性恋更受怀疑？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "具有諷刺意味的是，雙性戀不僅在一些異性戀者中被污名化，而且在LGBT圈子裏也被污名化。\n在LGBT圈子裏。人們普遍認爲 \"雙性戀女人其實只是異性戀，雙性戀男人只是同性戀\"。\n直人，而雙性戀男人只是同性戀\"。\n\n但是當涉及到男性和被兩種性別吸引時，許多人\n懷疑它。我最近想...",
      "title": "爲什麼男性雙性戀比女性雙性戀更受懷疑？"
    }
  ],
  "title": "Why is male bisexuality doubted more than female bisexuality?",
  "created_utc": 1623730983,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bisexuality is ironically stigmatized not just amongst some straight people but in LGBT circles. It&#39;s common for people to believe &quot;bi woman are really just straight and bi men are just gay&quot;.</p>\n\n<p>But when it comes to males and being attracted to both genders, many people doubt it. I recently thought about this as my workmate has a boyfriend who she was discussing is bi and she was a bit wary of that but accepted it. Most other girls said that he&#39;s deluding himself and it&#39;s only a matter of time before he starts shagging other guys/looking for them on Grindr.</p>\n\n<p>I think that the reason why there are less bisexual men anecdotally and by statistics isn&#39;t because it&#39;s less common but rather the stigma.In actual fact, I would have thought that bisexuality would be more common in males, the reason being is that men have a higher sex drive and are overrepresented in paraphilias and fetishes compared to women. So wouldn&#39;t men be more likely to have sex with their gender than women?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/nzw8k6/why_is_male_bisexuality_doubted_more_than_female/",
  "subreddit": "TrueAskReddit",
  "id": "nzw8k6",
  "is_self": true,
  "media": null,
  "is_video": false
}