{
  "author": "WowItsAShark",
  "original_created_utc": 1637717748,
  "title": "How bad is it to be 23 and never kissed?",
  "created_utc": 1637780615,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>23F. I was always sheltered. Homeschooled. Small town. Overprotective parents. I also have OCD and a fear of germs among other things. I used to model so I know it’s not my looks, when I go on dating sites I never have trouble finding a match. Being in such a small town though it’s hard to click with “the right one” because there’s not much to chose from. I’ve been on dates but never held hands with a boy let alone kissed.</p>\n\n<p>This gives me severe anxiety and sometimes panic attacks. I feel like a failure. I know I have good reasons for not having accomplished it yet, but it still <em>really</em> hurts. I was supposed to move out but the pandemic ruined my plans. My parents are still overprotective and toxic despite my age. Hopefully soon I’ll be able to try to leave again. To a big city.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/r0szix/how_bad_is_it_to_be_23_and_never_kissed/",
  "subreddit": "TooAfraidToAsk",
  "id": "r0szix",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "23F. I was always sheltered. Homeschooled. Small town. Overprotective parents. I\nalso have OCD and a fear of germs among other things. I used to model so I know\nit’s not my looks, when I go on dating sites I never have trouble finding a\nmatch. Being in such a small town though it’s hard to click…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "23F. 私はいつも保護されていました。ホームスクールに通っていました。小さな町で。過保護な両親。I\nまた、強迫性障害や細菌に対する恐怖心などもあります。私はモデルをしていたので、容姿ではないことはわかっています。\n出会い系サイトに行っても、相手を見つけるのに苦労したことはありません。\n相手を見つけるのに苦労したことはありません。こんなに小さな町にいると、クリックするのも大変ですが...。",
      "title": "23歳でキスをしたことがないというのは、どれくらい悪いことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "23F. 我总是受到庇护。在家上学。小城镇。父母过度保护。I\n我也有强迫症和对细菌的恐惧，以及其他一些事情。我曾经做过模特，所以我知道\n这不是我的长相，当我上约会网站时，我从来没有遇到过困难，找到一个\n匹配。在这样一个小镇上，虽然很难点击...",
      "title": "23岁且从未接过吻有多糟？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "23F. 我總是受到庇護。在家上學。小城鎮。父母過度保護。I\n我也有強迫症和對細菌的恐懼，以及其他一些事情。我曾經做過模特，所以我知道\n這不是我的長相，當我上約會網站時，我從來沒有遇到過困難，找到一個\n匹配。在這樣一個小鎮上，雖然很難點擊...",
      "title": "23歲且從未接過吻有多糟？"
    }
  ]
}