{
  "author": "SoupSpiller69",
  "original_created_utc": 1626267602,
  "title": "When, how, and why did people in Portugal start speaking a different language than the rest of the Iberian peninsula?",
  "created_utc": 1626288436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’m going off an assumption that in the 12th century, cousins Alfonso VII of Leon and Alfonso I of Portugal both spoke the same language and general dialect, and that the language divide happened later over time.  And my question I guess is kind of just “why?” </p>\n\n<p>Seemingly they wouldn’t have been that isolated from the rest of Castile/Spain for them to unintentionally drift away into a new language by accident.  Was there ever any explicit policies or leadership decisions ever made that set out to differentiate or define the differences in their languages?  Or was it more of a situation where the dialect just shifted over generations until it was considered an entirely new language?  </p>\n\n<p>Like when Ceuta went from Portugal to Spain in the 17th century, at the time would there have been a significant language barrier between the Portuguese residents and their new Spanish overlords?</p>\n\n<p>And was the Portuguese language’s evolution connected to their colonization efforts?  Like would the language mutate and shift even faster in Brazilian isolation away from Spanish influence, and then make its way back to influence Portugal?</p>\n\n<p>Edit: and after reading a bit more about it, was my original assumption that it was Portuguese that did the heavy lifting with the shifting even accurate?  Is Portuguese actually closer to the “Vulgar Latin” they were speaking 1000 years ago, and could it actually be that the rest of Spain did most of the big fluid language shifting?</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/AskHistorians/comments/ok3u29/when_how_and_why_did_people_in_portugal_start/",
  "subreddit": "AskHistorians",
  "id": "ok3u29",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I’m going off an assumption that in the 12th century, cousins Alfonso VII of\nLeon and Alfonso I of Portugal both spoke the same language and general dialect,\nand that the language divide happened later over time. And my question I guess\nis kind of just “why?”\n\nSeemingly they wouldn’t have been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は、12世紀に従兄弟のレオンのアルフォンソ7世とアルフォンスの2人が\nレオンのアルフォンソ7世とポルトガルのアルフォンソ1世は、同じ言語、同じ方言を話していた。\nそして、言語の分裂は時間の経過とともに後に起こったと考えています。そして、私が疑問に思うのは\n疑問は「なぜ？\n\n一見すると、彼らはそうではなかったように思えるのですが...。",
      "title": "ポルトガルの人々は、いつ、どのようにして、イベリア半島の他の地域とは異なる言語を話すようになったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我的假设是，在12世纪，莱昂的表兄弟阿方索七世和波尔图的阿方索一世的表兄弟\n莱昂的阿方索七世和葡萄牙的阿方索一世都说同样的语言和一般方言。\n而语言上的分歧是随着时间的推移而发生的。我想我的问题是\n就是 \"为什么？\"\n\n似乎他们不会被...",
      "title": "葡萄牙人何时、如何以及为何开始说一种与伊比利亚半岛其他地方不同的语言？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我的假設是，在12世紀，萊昂的表兄弟阿方索七世和波爾圖的阿方索一世的表兄弟\n萊昂的阿方索七世和葡萄牙的阿方索一世都說同樣的語言和一般方言。\n而語言上的分歧是隨着時間的推移而發生的。我想我的問題是\n就是 \"爲什麼？\"\n\n似乎他們不會被...",
      "title": "葡萄牙人何時、如何以及爲何開始說一種與伊比利亞半島其他地方不同的語言？"
    }
  ]
}