{
  "author": "KingOfTheRiverlands",
  "original_created_utc": 1660516122,
  "title": "Why did Sir William Hamilton allow Horatio Nelson, his wife’s extra-marital lover, to cohabit with them?",
  "created_utc": 1660557184,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In September 1802, Lady Emma Hamilton purchased Merton Place in Surrey. Surprisingly to me, not only she and her Husband moved in, but also Nelson, with whom she’d been having an affair for many years. &lt;/p&gt;\n\n&lt;p&gt;I understand that Sir William must have known, the affair had not only been going on for years but the three had that same Summer embarked on a tour of Wales together.&lt;/p&gt;\n\n&lt;p&gt;My question is, in such a conservative society, obsessed with standing and honour, why was Sir William so at ease being cuckolded by Nelson, to the point of quite peaceably cohabiting with him? &lt;/p&gt;\n\n&lt;p&gt;Has this been written about anywhere? It seems so bizarre to me and yet totally unelaborated upon, like everyone already knows the answer. &lt;/p&gt;\n\n&lt;p&gt;Any explanation or suggestion would be appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 283,
  "permalink": "/r/AskHistorians/comments/woimsg/why_did_sir_william_hamilton_allow_horatio_nelson/",
  "subreddit": "AskHistorians",
  "id": "woimsg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In September 1802, Lady Emma Hamilton purchased Merton Place in Surrey.\nSurprisingly to me, not only she and her Husband moved in, but also Nelson, with\nwhom she’d been having an affair for many years.\n\nI understand that Sir William must have known, the affair had not only been\ngoing on for years…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1802年9月、エマ・ハミルトン女史がサリー州のマートン・プレイスを購入した。\n驚いたことに、彼女とその夫だけでなく、彼女が交際していたネルソンも入居していたのです。\nネルソンも入居した。\n\nウィリアム卿は知っていたんでしょうね、不倫が何年も続いていたことを......。\n知っていたはずです",
      "title": "ウィリアム・ハミルトン卿は、なぜ妻の婚外恋人のホレイショ・ネルソンに同棲を許したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1802年9月，艾玛-汉密尔顿夫人购买了萨里郡的默顿广场。\n令我惊讶的是，不仅她和她的丈夫搬进来了，而且纳尔逊也搬进来了。\n她与纳尔逊有多年的婚外情。\n\n我知道，威廉爵士肯定知道，这段恋情不仅已经\n多年来一直如此......",
      "title": "为什么威廉-汉密尔顿爵士允许他妻子的婚外恋人霍雷肖-纳尔逊与他们同居？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1802年9月，艾瑪-漢密爾頓夫人購買了薩里郡的默頓廣場。\n令我驚訝的是，不僅她和她的丈夫搬進來了，而且納爾遜也搬進來了。\n她與納爾遜有多年的婚外情。\n\n我知道，威廉爵士肯定知道，這段戀情不僅已經\n多年來一直如此......",
      "title": "爲什麼威廉-漢密爾頓爵士允許他妻子的婚外戀人霍雷肖-納爾遜與他們同居？"
    }
  ]
}