{
  "author": "Kreagerrr",
  "the_new_excerpt": "Like, I can´t do proper pushup, so I´m doing them against the wall, I started to\ndo squats but I can do like 10 in a row, 2 sets. Is this going to help me move\nfurther?\n\n\n\nEdit: I did NOT thought so many of you would comment...I´m really glad for the\nnice words. (almost tearing up lol) I will try my…",
  "original_created_utc": 1621257085,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、腕立て伏せはまともにできないので、壁に向かってやっています。\nスクワットを始めましたが、10回連続で2セットくらいしかできません。これは、私がさらに前進するのに役立つでしょうか？\nこのままでいいのでしょうか？\n\n\n\n編集部：こんなにたくさんの方にコメントをいただけるとは思っていませんでした...。\n嬉しいお言葉です。涙が出そうになりました(笑)私も頑張ります。",
      "title": "運動から始めたいのですが、毎日少量の運動をしても大丈夫ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，我不能做正确的俯卧撑，所以我靠着墙做，我开始做深蹲，但我可以连续做10个，两组。\n我开始做深蹲，但我可以连续做10个，两组。这能帮助我进一步发展吗？\n更进一步？\n\n\n\n编辑：我没有想到你们会有这么多评论......我真的很高兴听到你们的好话。\n好话。(几乎要流泪了)我将尝试我的...",
      "title": "如果我想开始做运动，每天做少量的运动可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，我不能做正確的俯臥撐，所以我靠着牆做，我開始做深蹲，但我可以連續做10個，兩組。\n我開始做深蹲，但我可以連續做10個，兩組。這能幫助我進一步發展嗎？\n更進一步？\n\n\n\n編輯：我沒有想到你們會有這麼多評論......我真的很高興聽到你們的好話。\n好話。(幾乎要流淚了)我將嘗試我的...",
      "title": "如果我想開始做運動，每天做少量的運動可以嗎？"
    }
  ],
  "title": "Is it ok to do small amount of exercise each day if I want to start with exercise?",
  "created_utc": 1621277654,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like, I can´t do proper pushup, so I´m doing them against the wall, I started to do squats but I can do like 10 in a row, 2 sets. Is this going to help me move further?</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: I did <strong>NOT</strong> thought so many of you would comment...I´m really glad for the nice words. (almost tearing up lol) I will try my best to keep going on regular (daily if possible) basis and hopefully it will have the positive change I hope for.</p>\n</div><!-- SC_ON -->",
  "score": 145,
  "permalink": "/r/TooAfraidToAsk/comments/nefvjp/is_it_ok_to_do_small_amount_of_exercise_each_day/",
  "subreddit": "TooAfraidToAsk",
  "id": "nefvjp",
  "is_self": true,
  "media": null,
  "is_video": false
}