{
  "author": "littleboy0k",
  "the_new_excerpt": "This post is a gentle introduction to new cryptocurrency users about\ncryptocurrency price swings. Many of you may have brought Bitcoin when it went\nup above 20000$ or higher. At the time of writing this post, 1 Bitcoin = 46200$.\n\nYou may have seen your cryptocurrency balance go up 20%, 30% or even…",
  "original_created_utc": 1614085263,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "本篇文章是向新币种用户温和介绍关于\n加密货币价格波动。很多人可能在比特币走红的时候，带着\n涨到20000美元以上或更高。在写这篇文章的时候，1比特币=46200美元。\n\n你可能已经看到你的加密货币余额上涨了20%、30%甚至...",
      "title": "加密货币101：如果它能涨500%，也能跌80%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本篇文章是向新幣種用戶溫和介紹關於\n加密貨幣價格波動。很多人可能在比特幣走紅的時候，帶着\n漲到20000美元以上或更高。在寫這篇文章的時候，1比特幣=46200美元。\n\n你可能已經看到你的加密貨幣餘額上漲了20%、30%甚至...",
      "title": "加密貨幣101：如果它能漲500%，也能跌80%。"
    }
  ],
  "title": "Cryptocurrency 101: If it can go up 500%, it can also go down 80%",
  "created_utc": 1614105228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is a gentle introduction to new cryptocurrency users about cryptocurrency price swings. Many of you may have brought Bitcoin when it went up above 20000$ or higher. At the time of writing this post, 1 Bitcoin = 46200$.</p>\n\n<p>You may have seen your cryptocurrency balance go up 20%, 30% or even 100%. This may have made you interested in buying even more Bitcoin. &quot;It keeps going up and up, I should buy even more to maximize my profits&quot;, this is the thought I had when I entered the cryptocurrency market in 2017. You may get similar greedy thoughts in your head.  </p>\n\n<p>This is a perfectly expected behavior considering all the positive news you have heard recently about Bitcoin. You have heard Elon Musk talk about Bitcoin. You have seen his tweets promoting Bitcoin. You trust him and think that other large billionaires will probably buy more Bitcoin, which will send it to 100k by July!!!</p>\n\n<p>You may have seen BitBoy and other youtubers say Ethereum is going to 2500$, Bitcoin to 75K or 80K or even 250K!!! To be honest, I was exactly like you on January 2018. I was really hyped about this, though I was smart enough to sell my Ethereum at 1200$ which was my largest holding. I than brought some stupid useless altcoins and you may have done the same recently after selling some of your Bitcoin to buy other smallar coins.  </p>\n\n<p>But you need to understand that something that can go up 40% a day can also dump 40% a day. Let me give you and example with the price of petrol or gasoline. You may have observed that the price of gasoline doesn&#39;t always stay the same. Sometimes it goes up, sometimes it goes down. But the price generally doesn&#39;t fluctuate too much.</p>\n\n<p>Here, cryptocurrencies also work exactly in a similar way. Though the price swing is much higher because crypto trades 24 hours a day, 7 days a week. Because it can be transferred instantly, it has a higher price volatility.   </p>\n\n<p>So, if you think it can only go up, you are naïve. Higher price volatility means that when it goes up, it goes up really high, but <strong>when it goes down, it goes down really high as well</strong>.</p>\n\n<p>One strategy to protect yourself against such price movements is to average your costs. That is instead of buying crypto at once, you split that into 12 (for example) chunks and buy every month. If you check the price of Bitcoin for the last 12 months, you will realize that if you brought BTC this way, your average price per Bitcoin would be around 15000$ - 20000$ (I didn&#39;t do the exact math).</p>\n\n<p>Hence, now that BTC is 46k, you are up over 240%. This is a much safer strategy for new investors. Also, Bitcoin in 2018, went up to 19k and then went down to around 4k, which is about a dump of 80%.</p>\n\n<p>So, it wouldn&#39;t be impossible for it to go down back to 10k by going down 80%. I am writing this because I don&#39;t want you to make the same mistakes I made though you will still make some mistakes and loss money xD, I know it. After losing a lot of money did I learn to manage my risks. I hope you have a much better experience with your crypto journey.</p>\n\n<p>And <strong>enjoy the memes</strong> and the fun community around here.</p>\n</div><!-- SC_ON -->",
  "score": 811,
  "permalink": "/r/CryptoCurrency/comments/lqhw7v/cryptocurrency_101_if_it_can_go_up_500_it_can/",
  "subreddit": "CryptoCurrency",
  "id": "lqhw7v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880678
}