{
  "author": "InfiniteDeathsticks",
  "the_new_excerpt": "I hope this is the right place to post this question.\n\nWith the recent exposure that hedge funds have gotten with the GME situation\n(for what I can only describe as a coordinated short-selling effort by hedge\nfunds against a targeted company), I have the following question: If there's\nsome threshold…",
  "original_created_utc": 1611497502,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我希望这个问题在这里发布是正确的。\n\n随着最近对冲基金被曝出与GME的情况下\n(我只能把它描述为对冲基金的协调卖空努力。)\n资金针对目标公司），我有以下问题。如果有...\n某个门槛...",
      "title": "\"大规模协调 \"的卖空操作与抽水倒卖计划有什么本质区别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望這個問題在這裏發佈是正確的。\n\n隨着最近對沖基金被曝出與GME的情況下\n(我只能把它描述爲對沖基金的協調賣空努力。)\n資金針對目標公司），我有以下問題。如果有...\n某個門檻...",
      "title": "\"大規模協調 \"的賣空操作與抽水倒賣計劃有什麼本質區別？"
    }
  ],
  "title": "How is a \"massively-coordinated\" short-sale operation different, fundamentally, from a pump and dump scheme?",
  "created_utc": 1611524484,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hope this is the right place to post this question.</p>\n\n<p>With the recent exposure that hedge funds have gotten with the GME situation (for what I can only describe as a coordinated short-selling effort by hedge funds against a targeted company), I have the following question: If there&#39;s some threshold quantity of short sales that, when met, correlates strongly with a drop in price of said targeted company&#39;s stock, such that the profitability of the short sales are guaranteed, then how can such an action not be considered a form of market manipulation nor be actionable against by law enforcement? Both the situation I describe and the well known pump-and-dump scheme both rely on generating the kind of &quot;mass transaction&quot; that leads to a self-fulfilling goal (the pump and dump by way of driving prices up with high volume buys, and coordinated short-selling by driving prices down with high volume shorts / stock sales).</p>\n\n<p>If either my assessment of large-scale short selling OR hedge fun involvement in said endeavor is inaccurate, please help me fill in the gaps. My perception so far of hedge fund involvement in the market in this capacity is that of foul play to the extent that it hurts U.S. business, investors, and those employed by the companies they allegedly prey on. Alternatively if my assessment is accurate, how is this not illegal / not viewed differently from pump-and-dumps?</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/investing/comments/l405i7/how_is_a_massivelycoordinated_shortsale_operation/",
  "subreddit": "investing",
  "id": "l405i7",
  "is_self": true,
  "media": null,
  "is_video": false
}