{
  "author": "_martinshkreli_",
  "original_created_utc": 1626685773,
  "title": "If someone offered you \"free money\" you would assume it's a scam, right? You should do the same for crypto. Most ways to earn free crypto are scams or give you cents for hours of effort. Here are the only three I think are worth your time.",
  "created_utc": 1626701438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every day, there are threads presenting either <a href=\"https://np.reddit.com/r/CryptoCurrency/comments/ok4ldw/one_of_the_most_fun_ways_of_earning_free_crypto/\">specific new ways</a> of earning free crypto or <a href=\"https://np.reddit.com/r/CryptoCurrency/comments/oioluu/earn_some_crypto/\">endless</a> <a href=\"https://np.reddit.com/r/CryptoCurrency/comments/oke3y6/a_writeup_of_my_favourite_methods_for_passive/\">lists</a> of different ways to do so. Everyone likes free money, but here&#39;s the thing: most of these are scams, and most of the others are not worth it.</p>\n\n<p>Sure, you can use Brave browser or a few months and see thousands of ads to earn a dollar in BAT, or you could exploit a faucet and get free crypto from there every day for a few weeks, to end up with something like a dollar once again (this is not what faucets are for, please don&#39;t do this). You could spam all your social media feeds promoting some scam coin because they promised you you would get an airdrop if you did. I would argue, however, that this is not the best way to spend your time. Not considering stuff like staking that can definitely pay off, but that requires that you already own crypto, there are three ways of earning free crypto for beginners without crypto who want to start out with crypto but don&#39;t want to invest yet that, in my opinion, are worth your time:</p>\n\n<p>1) <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> Moons. You get moons every 28 days if you participate on this sub, if you have opened your vault, depending on the amount of karma you collect. You can get a ton of free crypto here - not as much as a year ago, but i only posted here for the past like 4 months and have over 10k moons, currently worth about $1,000 - and it absolutely is possible that they will be worth much more in the future. If you are interested in crypto and would post here anyway, this is a great way to earn free tokens. See the <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/gj96lb/introducing_rcryptocurrency_moons/?utm_source=reddit&amp;utm_medium=usertext&amp;utm_name=CryptoCurrency&amp;utm_content=t3_okgzix\">Introduction to Moons</a> and the <a href=\"https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki/?utm_source=reddit&amp;utm_medium=usertext&amp;utm_name=CryptoCurrency&amp;utm_content=t3_okgzix\">Moons wiki</a> for more info.</p>\n\n<p>2) <a href=\"https://help.coinbase.com/en/coinbase/getting-started/getting-started-with-coinbase/coinbase-earn-faq-and-terms\">Coinbase Earn</a>. You need an account on Coinbase, have it verified, and you need to live in an eligible country.<sup>A</sup> They show you some information about specific crypto and then ask really easy question, you get a small amount of that crypto if you get them right (you can retry them), you get the money immediately. I personally never spent money on Coinbase and got a lot of money on there (probably around $250 - I originally got less, but many coins went up in value a lot since I did the respective quizzes). <strong>Con: I&#39;ve read many times that people were stuck in a queue and could not participate in the quizzes, I personally never had that problem.</strong></p>\n\n<p>3) <a href=\"https://coinmarketcap.com/earn/\">Coinmarketcap Earn</a>. It&#39;s similar, but a bit worse. You need a verified account on Binance, some countries are excluded from participating (one of them being the US).<sup>B</sup> Again, you can answer a few questions about some crypto and you get small amounts (usually a bit bigger than on Coinbase Earn) if you get them right - but, in this case, you only have one chance and need to get all of them right. If you get them right, and if you are quick enough, the coins usually get sent to your Binance account after a few weeks. <strong>Con: I&#39;ve seen many people state that they never got any coins even though they got everything right, even calling it a scam. It is definitely not a scam, I got coins multiple times, but the quizzes often run longer than they should and only the first few thousand participants receive coins. You can always</strong> <a href=\"https://coinmarketcap.com/earn/token-distribution-status\"><strong>check the status</strong></a> <strong>of your coins or why you will not get them on their page.</strong></p>\n\n<p>All in all, I got much more than $1,000 with these three methods - earning moons just hanging out and having fun on this sub, and only spending a few minutes with the quizzes (they are really not long). While there might be other ways of earning free crypto for beginners, I haven&#39;t found any others that are worth your time - but I am looking forwardto you proving me wrong!</p>\n\n<p>&#x200B;</p>\n\n<p><sup>A: currently Austria, Australia, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czech  Republic, Denmark, Estonia, Finland, France, Greece, Hong Kong, Hungary,  Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg,  Malta, The Netherlands, Norway, New Zealand, Poland, Portugal, Romania,  Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Taiwan, The United Kingdom, and the United States.</sup> </p>\n\n<p><sup>B: currently Belarus, Democratic Republic of Congo, Cuba, Iraq, Iran, Mainland China,  North Korea, Sudan, South Sudan, Syria, United States of America and its territories United States, Guam, Northern Mariana  Islands, Puerto Rico, Virgin Islands US, American Samoa, United States Minor Outlying Islands, Zimbabwe.</sup></p>\n</div><!-- SC_ON -->",
  "score": 160,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2pmsCo5kbKqbR3ejGHyErS51RhYZM3ReVYbgel-V6p0.jpg?auto=webp&s=72d5a2eb5aa9a9369227aa7d45ff57f9e5021155",
          "width": 180,
          "height": 180
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2pmsCo5kbKqbR3ejGHyErS51RhYZM3ReVYbgel-V6p0.jpg?width=108&crop=smart&auto=webp&s=221d34fd7e2fd1e0a301bb54f8ccf8c1fa7db96e",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "UX7q_tdteJIxyQ8plTAYJ7qHpDJ4Z8efPvp5yNDomeI"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/onadn7/if_someone_offered_you_free_money_you_would/",
  "subreddit": "CryptoCurrency",
  "id": "onadn7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every day, there are threads presenting either specific new ways\n[https://np.reddit.com/r/CryptoCurrency/comments/ok4ldw/one_of_the_most_fun_ways_of_earning_free_crypto/]\nof earning free crypto or endless\n[https://np.reddit.com/r/CryptoCurrency/comments/oioluu/earn_some_crypto/]…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のように、特定の新しい方法を紹介するスレッドがあります。\n[https://np.reddit.com/r/CryptoCurrency/comments/ok4ldw/one_of_the_most_fun_ways_of_earning_free_crypto/]\n無料で暗号を獲得するための新しい方法を紹介するスレッドや、無限の\n[https://np.reddit.com/r/CryptoCurrency/comments/oioluu/earn_some_crypto/]...",
      "title": "もし誰かがあなたに「無料のお金」を提供したとしたら、それは詐欺だと思うでしょう？cryptoについても同じことをすべきです。無料でcryptoを獲得する方法のほとんどは、詐欺であったり、何時間もかけて努力しても数セントしか得られないものです。ここでは、私が時間をかける価値があると思う3つの方法を紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每天都有一些主题提出了一些具体的新方法\n[https://np.reddit.com/r/CryptoCurrency/comments/ok4ldw/one_of_the_most_fun_ways_of_earning_free_crypto/]\n赚取免费加密货币的具体方法，或无休止的\n[https://np.reddit.com/r/CryptoCurrency/comments/oioluu/earn_some_crypto/]...",
      "title": "如果有人向你提供 \"免费的钱\"，你会认为这是个骗局，对吗？你对加密货币也应该这样做。大多数赚取免费加密货币的方法都是骗局，或者给你几分钱的努力。以下是我认为唯一值得你花时间的三种方法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每天都有一些主題提出了一些具體的新方法\n[https://np.reddit.com/r/CryptoCurrency/comments/ok4ldw/one_of_the_most_fun_ways_of_earning_free_crypto/]\n賺取免費加密貨幣的具體方法，或無休止的\n[https://np.reddit.com/r/CryptoCurrency/comments/oioluu/earn_some_crypto/]...",
      "title": "如果有人向你提供 \"免費的錢\"，你會認爲這是個騙局，對嗎？你對加密貨幣也應該這樣做。大多數賺取免費加密貨幣的方法都是騙局，或者給你幾分錢的努力。以下是我認爲唯一值得你花時間的三種方法。"
    }
  ]
}