{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "# Post too long, here is TLDR:\n\nEfficient market hypothesis sucks balls because GME is being traded around it's SI rather than it's performance. Overall market go poo poo if theory is true once dividends populate. You go homeless.  I go homeless. Death from starvation.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nGameStop's share price is **completely void of the company's performance.**\n\nThere is no mathematical financial model for measuring (let alone forecasting) this motive fueling GME's price-movement. I can't think of a stock to-date that has ever been valued this way.  Meaning, value found in the stock pertains to new information about it's speculated SI let alone it's SI borrow rate.\n\nRemember all those important ratios that tell us about a companies performance? *Useless*. Even better are option prices--which for most days, are *hysterical*. The average cost for call options usually equal the cost for puts with rarely ever a one-sided sentiment because too many people are assigning value to it's SI rather than the company's performance. BIG PICTURE, nobody knows where the hell this thing will go each day. If people by the dozens are buying this stock based on speculation around information not just separate from GameStop's performance, but a whole other company's activities, doesn't this make CAPM and other models around return obsolete? *I mean, this is speculation on a massive scale.*  Speculation around private information that is no less private than it has been since day one.\n\nTo narrow this, EMH doesn't account for **any other alternative motive besides the company's performance** and or actions tied the federal reserve.  *This is how the market SHOULD work. This is the market structure assumed to be in place not just for EMH, but for most investors/traders.* Price instead is valued around SI populated daily from [iborrow.com](https://iborrow.com) where, once the price drops to a certain point and borrow rates go up, institutions + retail will unload the buying turning returns (eventually) into a cyclical time trend.\n\nThis isn't to say EMH doesn't account for short-selling (ss) or that ss is bad, but instead, *how out of control abusive naked short selling can get which for GME, if true,* ***is VERY bad***.  We'll find out come June 2022 once dividends are official. If it's true, a cancerous bubble might pop bringing the whole market down with it. Mass-wide margin calls will be made to keep banks up afloat which will end in liquidation equal too (maybe greater) than 2008. This would literally justify why wall street was having a melt-down from what spawned in this sub. A years worth of shorting the stock plus more all because Citadel refused to take the L that came from Melvin's doings by shorting the stock a 140%. That and nobody is buying the reported SI from FINRA.  Not when $50k for \"egregious behavior\" are assigned for misreporting data. It's like the equivalent of stepping on Legos for punishment of destroying the economy.\n\nThe markets crashing in the event this bubble pops will likely be the ***least of anyone's concerns anyways.*** This is because *not a damn soul* will be dumb enough to give wall street their hard-earned money again. Not when market makers have the leverage they do to bring down the economy and everyone else's money over fucking GAMESTOP! Markets will become vastly illiquid simply because regulation doesn't regulation shit and putting your money into the markets is now a suckers game--just like playing slots. Everyone from the SEC, CFTC, market-makers and even institutions not involved will all lose the needed trust of the American people which as of now, is equivalent to nicking a main artery. Not a single American will accept \"more regulation\" as an answer for soundly regulating the markets. If the government cares to have a functioning market, functioning economy, you'll need the trust of the middle-class which likely means one thing: Prison for everyone complicit or nothing.\n\nAnyways, this is my ted talk, I appreciate ya if you took the time to read this. I will be presenting this (plus more) next week in front of 2,000+ people downtown Chicago 10 minutes away from Citadel.\n\n(gonna be kinda awkward)",
  "author_fullname": "t2_ann1evta",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "I still don't understand how GME doesn't defy the efficient market hypothesis.",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_u6pp8i",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.9,
  "author_flair_background_color": "",
  "subreddit_type": "public",
  "ups": 1013,
  "total_awards_received": 13,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 1013,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "self",
  "edited": 1650327251,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 3
  },
  "post_hint": "self",
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1650321804,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Post too long, here is TLDR:&lt;/h1&gt;\n\n&lt;p&gt;Efficient market hypothesis sucks balls because GME is being traded around it&amp;#39;s SI rather than it&amp;#39;s performance. Overall market go poo poo if theory is true once dividends populate. You go homeless.  I go homeless. Death from starvation.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;GameStop&amp;#39;s share price is &lt;strong&gt;completely void of the company&amp;#39;s performance.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;There is no mathematical financial model for measuring (let alone forecasting) this motive fueling GME&amp;#39;s price-movement. I can&amp;#39;t think of a stock to-date that has ever been valued this way.  Meaning, value found in the stock pertains to new information about it&amp;#39;s speculated SI let alone it&amp;#39;s SI borrow rate.&lt;/p&gt;\n\n&lt;p&gt;Remember all those important ratios that tell us about a companies performance? &lt;em&gt;Useless&lt;/em&gt;. Even better are option prices--which for most days, are &lt;em&gt;hysterical&lt;/em&gt;. The average cost for call options usually equal the cost for puts with rarely ever a one-sided sentiment because too many people are assigning value to it&amp;#39;s SI rather than the company&amp;#39;s performance. BIG PICTURE, nobody knows where the hell this thing will go each day. If people by the dozens are buying this stock based on speculation around information not just separate from GameStop&amp;#39;s performance, but a whole other company&amp;#39;s activities, doesn&amp;#39;t this make CAPM and other models around return obsolete? &lt;em&gt;I mean, this is speculation on a massive scale.&lt;/em&gt;  Speculation around private information that is no less private than it has been since day one.&lt;/p&gt;\n\n&lt;p&gt;To narrow this, EMH doesn&amp;#39;t account for &lt;strong&gt;any other alternative motive besides the company&amp;#39;s performance&lt;/strong&gt; and or actions tied the federal reserve.  &lt;em&gt;This is how the market SHOULD work. This is the market structure assumed to be in place not just for EMH, but for most investors/traders.&lt;/em&gt; Price instead is valued around SI populated daily from &lt;a href=\"https://iborrow.com\"&gt;iborrow.com&lt;/a&gt; where, once the price drops to a certain point and borrow rates go up, institutions + retail will unload the buying turning returns (eventually) into a cyclical time trend.&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t to say EMH doesn&amp;#39;t account for short-selling (ss) or that ss is bad, but instead, &lt;em&gt;how out of control abusive naked short selling can get which for GME, if true,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;is VERY bad&lt;/em&gt;&lt;/strong&gt;.  We&amp;#39;ll find out come June 2022 once dividends are official. If it&amp;#39;s true, a cancerous bubble might pop bringing the whole market down with it. Mass-wide margin calls will be made to keep banks up afloat which will end in liquidation equal too (maybe greater) than 2008. This would literally justify why wall street was having a melt-down from what spawned in this sub. A years worth of shorting the stock plus more all because Citadel refused to take the L that came from Melvin&amp;#39;s doings by shorting the stock a 140%. That and nobody is buying the reported SI from FINRA.  Not when $50k for &amp;quot;egregious behavior&amp;quot; are assigned for misreporting data. It&amp;#39;s like the equivalent of stepping on Legos for punishment of destroying the economy.&lt;/p&gt;\n\n&lt;p&gt;The markets crashing in the event this bubble pops will likely be the &lt;strong&gt;&lt;em&gt;least of anyone&amp;#39;s concerns anyways.&lt;/em&gt;&lt;/strong&gt; This is because &lt;em&gt;not a damn soul&lt;/em&gt; will be dumb enough to give wall street their hard-earned money again. Not when market makers have the leverage they do to bring down the economy and everyone else&amp;#39;s money over fucking GAMESTOP! Markets will become vastly illiquid simply because regulation doesn&amp;#39;t regulation shit and putting your money into the markets is now a suckers game--just like playing slots. Everyone from the SEC, CFTC, market-makers and even institutions not involved will all lose the needed trust of the American people which as of now, is equivalent to nicking a main artery. Not a single American will accept &amp;quot;more regulation&amp;quot; as an answer for soundly regulating the markets. If the government cares to have a functioning market, functioning economy, you&amp;#39;ll need the trust of the middle-class which likely means one thing: Prison for everyone complicit or nothing.&lt;/p&gt;\n\n&lt;p&gt;Anyways, this is my ted talk, I appreciate ya if you took the time to read this. I will be presenting this (plus more) next week in front of 2,000+ people downtown Chicago 10 minutes away from Citadel.&lt;/p&gt;\n\n&lt;p&gt;(gonna be kinda awkward)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/TlIQh7Ra4c9iUmfa_qfu9SwyDIogP2u4kkiek_a02l0.jpg?auto=webp&amp;s=65f7d7b0cf786be076e23e1d7d64350aa508a1aa",
          "width": 300,
          "height": 54
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/TlIQh7Ra4c9iUmfa_qfu9SwyDIogP2u4kkiek_a02l0.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=04b478b1ffc010cab95303ed4627f24b4f57b3da",
            "width": 108,
            "height": 19
          },
          {
            "url": "https://external-preview.redd.it/TlIQh7Ra4c9iUmfa_qfu9SwyDIogP2u4kkiek_a02l0.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=9234111a15cdce850293305c4600c01cd3811122",
            "width": 216,
            "height": 38
          }
        ],
        "variants": {},
        "id": "GehwZ-4zQ0_N0ron0ifd5wG-UnTPnJB9tWkWDC0YzkY"
      }
    ],
    "enabled": false
  },
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": "",
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "u6pp8i",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "girthygirthmonster",
  "discussion_type": null,
  "num_comments": 335,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": "",
  "permalink": "/r/wallstreetbets/comments/u6pp8i/i_still_dont_understand_how_gme_doesnt_defy_the/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/u6pp8i/i_still_dont_understand_how_gme_doesnt_defy_the/",
  "subreddit_subscribers": 11967653,
  "created_utc": 1650368624,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1650321804,
  "the_new_excerpt": "POST TOO LONG, HERE IS TLDR:\n\nEfficient market hypothesis sucks balls because GME is being traded around it's\nSI rather than it's performance. Overall market go poo poo if theory is true\nonce dividends populate. You go homeless. I go homeless. Death from starvation.\n\n\n\n\n\nGameStop's share price is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長すぎる投稿なので、以下はtldrです。\n\n効率的市場仮説は、GMEの株価が、その株価の前後で取引されているため、最悪です。\nSIは業績ではなく 理論が正しければ、市場全体がうんぬんかんぬん\n配当金が入ると ホームレスになってください。私はホームレスになる。餓死する。\n\n\n\n\n\nGameStopの株価は...",
      "title": "GMEが効率的市場仮説に反しないというのは、いまだに理解できない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "帖子太长了，这里是tldr。\n\n有效市场假说糟糕透顶，因为GME的交易是围绕它的\nSI，而不是它的表现。如果理论是真的，整体市场会变得很糟糕。\n一旦红利涌现。你会无家可归。我也会无家可归。饿死了。\n\n\n\n\n\nGameStop的股价是...",
      "title": "我还是不明白，GME如何不违背有效市场假说。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "帖子太長了，這裏是tldr。\n\n有效市場假說糟糕透頂，因爲GME的交易是圍繞它的\nSI，而不是它的表現。如果理論是真的，整體市場會變得很糟糕。\n一旦紅利湧現。你會無家可歸。我也會無家可歸。餓死了。\n\n\n\n\n\nGameStop的股價是...",
      "title": "我還是不明白，GME如何不違背有效市場假說。"
    }
  ]
}