{
  "author": "GeoffreyTaucer",
  "original_created_utc": 1649418300,
  "title": "When and why was it decided that formal wear must be uncomfortable and expensive?",
  "created_utc": 1649432722,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why, for formal events and meetings and such, do men wear stiff, uncomfortable, impractical suits and ties? Why do women wear dresses with no pockets that are so tight around the legs they can barely walk, along with high heels?&lt;/p&gt;\n\n&lt;p&gt;Why does formal attire have to be expensive, impractical, and uncomfortable?&lt;/p&gt;\n\n&lt;p&gt;Is there some reason we all couldn&amp;#39;t just collectively decide that a t-shirt and sweatpants are now considered formal attire, and never have to wear shit like that again?&lt;/p&gt;\n\n&lt;p&gt;EDIT: If your answer is &amp;quot;spend a thousand dollars to get it tailored for you and it won&amp;#39;t be uncomfortable anymore,&amp;quot; you&amp;#39;re proving my point. Why should I need to spend a thousand dollars to make my clothes as comfortable as sweats and a t-shirt when I could spend less than a tenth of that on sweats and a t-shirt?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 136,
  "permalink": "/r/TooAfraidToAsk/comments/tz1nr7/when_and_why_was_it_decided_that_formal_wear_must/",
  "subreddit": "TooAfraidToAsk",
  "id": "tz1nr7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Why, for formal events and meetings and such, do men wear stiff, uncomfortable,\nimpractical suits and ties? Why do women wear dresses with no pockets that are\nso tight around the legs they can barely walk, along with high heels?\n\nWhy does formal attire have to be expensive, impractical, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ、男性はフォーマルなイベントや会議などで、硬くて着心地の悪い服を着ているのでしょう。\n実用的でないスーツとネクタイ。なぜ女性はポケットのないドレスを着るのでしょう？\nハイヒールを履いて、歩くのもやっとの状態です。\n\nなぜ正装は高価で、実用的でなく、そして...。",
      "title": "フォーマルウェアは着心地が悪く、高価なものでなければならないと、いつ、なぜ決められたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么在正式活动和会议等场合，男人要穿上僵硬的、不舒服的。\n不实用的西装和领带？为什么女人要穿没有口袋的裙子？\n腿部太紧，几乎无法行走，再加上高跟鞋？\n\n为什么正式的服装必须是昂贵的、不实用的和...",
      "title": "什么时候以及为什么决定正装必须是不舒服的和昂贵的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼在正式活動和會議等場合，男人要穿上僵硬的、不舒服的。\n不實用的西裝和領帶？爲什麼女人要穿沒有口袋的裙子？\n腿部太緊，幾乎無法行走，再加上高跟鞋？\n\n爲什麼正式的服裝必須是昂貴的、不實用的和...",
      "title": "什麼時候以及爲什麼決定正裝必須是不舒服的和昂貴的？"
    }
  ]
}