{
  "author": "Haxzors",
  "the_new_excerpt": "With the Chinese Central Bank ending stimulus and the Holding Foreign Companies\nAccountable Act going into effect we have seen a mass selloff of Chinese\nsecurities as of late. This selloff has affected almost all Chinese companies\nonly sparing a few that are involved in NFT and Bitcoin plays. This…",
  "original_created_utc": 1616824950,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "随着中国央行结束刺激政策，以及控股外资公司\n问责法》生效后，我们看到了大量抛售中国的\n证券，因为最近。这场大跌几乎影响了所有的中国公司。\n只放过少数参与NFT和比特币玩法的人。这...",
      "title": "结束中国经济刺激政策/证监会颁布法律为中国公司提供独特的购买机会（高风险、高回报）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着中國央行結束刺激政策，以及控股外資公司\n問責法》生效後，我們看到了大量拋售中國的\n證券，因爲最近。這場大跌幾乎影響了所有的中國公司。\n只放過少數參與NFT和比特幣玩法的人。這...",
      "title": "結束中國經濟刺激政策/證監會頒佈法律爲中國公司提供獨特的購買機會（高風險、高回報）。"
    }
  ],
  "title": "Ending China Stimulus / SEC Law Enacted Provide Unique Buying Opportunity For Chinese Companies (High Risk, High Reward)",
  "created_utc": 1616852463,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the Chinese Central Bank ending stimulus and the Holding Foreign Companies Accountable Act going into effect we have seen a mass selloff of Chinese securities as of late. This selloff has affected almost all Chinese companies only sparing a few that are involved in NFT and Bitcoin plays. This week alone $BIDU is down 22%, $BABA is down 6%, TIGR is down 22%, and FUTU is down 16%. These companies have shown strong growth and some even had amazing Q4 for 2020 during a pandemic (FUTU had a 281.6% increase of total revenue YoY for Q4). Below I am going to explain the two main reasons I see this sell off happening and why I believe it gives a unique buying opportunity.</p>\n\n<p><strong>· China Central Bank And Government Ending Pandemic Stimulus, Tighter Liquidity Market (1)(2)</strong></p>\n\n<p>With China being the first major country to come out the other end of the pandemic the China Central Bank and government announced they will be ending the stimulus stance taken during the pandemic to prop up the economy. China is the first major country to emerge on the other side of the pandemic and has returned to normal even in places like Wuhan. With this returning to normal the china central bank has stopped stimulus measures as the worry of inflation creeps in causing stocks of Chinese companies to sink due to more restrictions on flow of money. Additionally, china has continued to crack down on credit use and ease lending worrying about high default rates and companies being over leveraged. This is one of the many reasons ANT was blocked (as well as internal country politics). While many would see this as a sign to be worried it is in fact quite the opposite. China is now positioned to grow rapidly while the rest of the world continues to be weigh down by Covid all the while doing its best to control inflation and risky lending ensuring a bright future for the Chinese economy. No longer having a need for stimulus is a bullish sign not a bearish and should be celebrated.</p>\n\n<p><strong>· Risk Of Mass Chinese Delisting, Holding Foreign Companies Accountable Act (3)(4)</strong></p>\n\n<p>On Wednesday March 24th the SEC moved to enact the Holding Foreign Companies Accountable Act (HFCA) which requires foreign companies to allow regulators to review financial audits of overseas companies as well as requires companies to submit documents to prove they are not owned by a government entity and list any board members who are government officials. Anyone who has dabbled in foreign companies will know that the vast majority report unaudited results. Doing so going forward could mean ejection from the NYSE or Nasdaq. China itself restricts what information companies can provide to foreign auditors so even if a company wanted to abide by this new rule it may be difficult. Additionally, the Chinese government is heavily involved in many of the major corporations that operate within China. This spells potential doom for a fast majority of Chinese companies currently listed. To be clear I am 100% for financials being audited and I would love for this to be a thing. I think the fear of government influence in companies is overblown and the US itself heavily plays with the scales of companies that operate in the US, think the bail outs as well as tax breaks for major manufacturers (Boeing). I see all of this as sabre rattling by both sides and since this is a Trump law it is unlikely to continue as is without some tweaks under the Biden admin. It is very unlikely that the us government is just going to mass delist so many companies wiping out trillions in us dollars (big banks invest in these companies!) as the firesale happens before they are ejected from the exchanges. A likely compromise will be reached quietly and both sides will claim victory.</p>\n\n<p><strong>TLDR:</strong> Chinese dual listed and ADR stocks are taking a beating due to a new us law, Holding Foreign Companies Accountable Act, as well as China central bank and government ending pandemic stimulus. This has created a unique opportunity where many Chinese companies, ones with healthy books and set for expansion, are selling off. I believe the fear around US mass delisting Chinese companies is overblown and that the Chinese economy is set to continue its expansion in the coming years and that the end of stimulus was due. I see this as a great buying opportunity to get on great companies well below price. This sell off may continue for a few weeks but will come to a halt once the SEC law is changed / rescinded and good economic numbers come out of China. In the coming weeks I will be looking to expand my current holdings in TIGR, FINV, QD, and open new positions in FUTU, CLPS, BABA. Remember: “Be greedy when others are fearful” - Warren Buffett.</p>\n\n<p>News Article Links:</p>\n\n<p>(1) <a href=\"https://www.bloomberg.com/news/articles/2021-03-24/chinese-stocks-15-plunge-shows-what-happens-when-stimulus-ends\">https://www.bloomberg.com/news/articles/2021-03-24/chinese-stocks-15-plunge-shows-what-happens-when-stimulus-ends</a></p>\n\n<p>(2) <a href=\"https://www.ft.com/content/a508addb-fbad-4708-b533-8180e60a1528\">https://www.ft.com/content/a508addb-fbad-4708-b533-8180e60a1528</a></p>\n\n<p>(3) <a href=\"https://www.cnbc.com/2021/03/25/chinese-tech-stocks-fall-as-us-sec-begins-law-aimed-at-delisting.html\">https://www.cnbc.com/2021/03/25/chinese-tech-stocks-fall-as-us-sec-begins-law-aimed-at-delisting.html</a></p>\n\n<p>(4) <a href=\"https://www.scmp.com/business/markets/article/3126866/hong-kong-stocks-enter-correction-us-implements-law-audit-putting\">https://www.scmp.com/business/markets/article/3126866/hong-kong-stocks-enter-correction-us-implements-law-audit-putting</a></p>\n\n<p>P.S. The above is my opinion, make sure to do your own DD folks.</p>\n</div><!-- SC_ON -->",
  "score": 505,
  "permalink": "/r/investing/comments/me7ymc/ending_china_stimulus_sec_law_enacted_provide/",
  "subreddit": "investing",
  "id": "me7ymc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140056
}