{
  "author": "wakeupitsadream",
  "original_created_utc": 1634449147,
  "title": "Do you need a crypto tax software? I'm considering writing an open source desktop app to sift through the reports that exchanges provide and comparing it to market history data to generate usable gain/loss summary documents",
  "created_utc": 1634463413,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title says it all really. This sub has been good to my gains this year so I&#39;d like to give back by providing this service if its useful to people. I know solutions currently exist but have heard pretty poor things about them. So I&#39;m trying to gauge how many people might be interested in something that takes the documents the exchanges give you and generates actual useable data by going back and looking at market history and determining US dollar value at time of transaction.</p>\n\n<p>I could write this pretty quick but won&#39;t waist my time if there is no need. Feel free to give suggestions on what you would like to see included in the product. If no one needs this then I won&#39;t bother developing it for the public. Your call reddit.</p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/CryptoCurrency/comments/q9snj3/do_you_need_a_crypto_tax_software_im_considering/",
  "subreddit": "CryptoCurrency",
  "id": "q9snj3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Title says it all really. This sub has been good to my gains this year so I'd\nlike to give back by providing this service if its useful to people. I know\nsolutions currently exist but have heard pretty poor things about them. So I'm\ntrying to gauge how many people might be interested in something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っています。このサブは今年の私の利益に貢献してくれました。\nこのサービスを提供することでお返ししたいと思います。私は\nソリューションが存在することは知っていますが、かなり悪いことを聞いています。だから、私は\nどれくらいの人が興味を持ってくれるのかを測りたいのですが...。",
      "title": "クリプトタックスソフトウェアは必要ですか？取引所が提供するレポートを選別し、市場の履歴データと比較して、使用可能な利益/損失の要約文書を生成するために、オープンソースのデスクトップアプリを書くことを検討しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切，真的。今年这个子项目对我的收益很好，所以我想通过提供这个服务来回报，如果它对人们有用的话。\n我想通过提供这项服务来回报，如果它对人们有用的话。我知道\n目前有一些解决方案，但我听说它们的情况很糟糕。所以我在\n试图衡量有多少人可能对某些东西感兴趣......",
      "title": "你需要一个加密货币税务软件吗？我正在考虑编写一个开源的桌面应用程序，以筛选交易所提供的报告，并将其与市场历史数据进行比较，以生成可用的收益/损失摘要文件"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切，真的。今年這個子項目對我的收益很好，所以我想通過提供這個服務來回報，如果它對人們有用的話。\n我想通過提供這項服務來回報，如果它對人們有用的話。我知道\n目前有一些解決方案，但我聽說它們的情況很糟糕。所以我在\n試圖衡量有多少人可能對某些東西感興趣......",
      "title": "你需要一個加密貨幣稅務軟件嗎？我正在考慮編寫一個開源的桌面應用程序，以篩選交易所提供的報告，並將其與市場歷史數據進行比較，以生成可用的收益/損失摘要文件"
    }
  ]
}