{
  "author": "NorthBalance",
  "the_new_excerpt": "TL;DR: Citadel is naked shorting ETFs (Operational Shorting) containing GME to\ndrive down the price, in the first drop in Feb they shorted XRT, and in the past\nweek they have shorted the entire Russell 2000 (IWM). Read the whole thing to\nlearn why this irresponsible action may lead to the crash of…",
  "original_created_utc": 1616700233,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：Citadel正在赤裸裸地做空含有GME的ETF（操作性做空），以\n推动价格下跌，在2月的第一次下跌中，他们做空了XRT，在过去的\n本周他们已经做空了整个罗素2000指数（IWM）。阅读全文\n了解为什么这种不负责任的行为可能会导致崩溃的...",
      "title": "为什么GME今天上涨，以及CITADEL如何通过ETF裸露做空GME，从而使整个市场崩溃。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：Citadel正在赤裸裸地做空含有GME的ETF（操作性做空），以\n推動價格下跌，在2月的第一次下跌中，他們做空了XRT，在過去的\n本週他們已經做空了整個羅素2000指數（IWM）。閱讀全文\n瞭解爲什麼這種不負責任的行爲可能會導致崩潰的...",
      "title": "爲什麼GME今天上漲，以及CITADEL如何通過ETF裸露做空GME，從而使整個市場崩潰。"
    }
  ],
  "title": "WHY GME WENT UP TODAY AND HOW CITADEL MAY CRASH THE ENTIRE MARKET BY NAKED SHORTING GME THROUGH ETFS",
  "created_utc": 1616774952,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TL;DR: Citadel is naked shorting ETFs (Operational Shorting) containing GME to drive down the price, in the first drop in Feb they shorted XRT, and in the past week they have shorted the entire Russell 2000 (IWM). Read the whole thing to learn why this irresponsible action may lead to the crash of the ENTIRE MARKET.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Anatomy of a ETF Short Attack in Feb</strong></p>\n\n<p><a href=\"https://preview.redd.it/aa8yz17o28p61.png?width=1645&amp;format=png&amp;auto=webp&amp;s=a8f0ce189dc395497e1b90366b9190d57e2fd824\">https://preview.redd.it/aa8yz17o28p61.png?width=1645&amp;format=png&amp;auto=webp&amp;s=a8f0ce189dc395497e1b90366b9190d57e2fd824</a></p>\n\n<p><strong>Proof of Citadel naked shorting since they are required to buy back NAKED ETF SHORTS TODAY driving up the price</strong></p>\n\n<p><a href=\"https://preview.redd.it/aot4bm0s28p61.png?width=968&amp;format=png&amp;auto=webp&amp;s=5ee49b7abf9fb1a82b1c8d1c45d79c1f4e1105ce\">https://preview.redd.it/aot4bm0s28p61.png?width=968&amp;format=png&amp;auto=webp&amp;s=5ee49b7abf9fb1a82b1c8d1c45d79c1f4e1105ce</a></p>\n\n<h1>--------------------------------------------------------------------------------</h1>\n\n<h1>CLASS IS IN SESSION</h1>\n\n<p><strong>Have you wondered recently with reported Short Interest of GME so low (26% of float according to MarketBeat), how has GME gone down more than 100% in the past 5 days with relatively low volume?</strong></p>\n\n<p><strong>Are fellow apes and long whales selling?</strong> Answer: NO, look at the OBV</p>\n\n<p><a href=\"https://preview.redd.it/1j1j1o5z28p61.png?width=991&amp;format=png&amp;auto=webp&amp;s=5716e84a0827912b0573db1fac8b46ab48876677\">https://preview.redd.it/1j1j1o5z28p61.png?width=991&amp;format=png&amp;auto=webp&amp;s=5716e84a0827912b0573db1fac8b46ab48876677</a></p>\n\n<p><strong>Are Citadel and Friends shorting GME directly?</strong> <em>YES</em>, but that alone is not enough to drive down GME price drastically without significant increase in reported short interest.</p>\n\n<p><strong>Are Citadel and Friends hiding short interest thorough OTC (dark pools) and other shady options mechanisms?</strong> <em>Likely yes</em>, but will not explore in this post.</p>\n\n<p><strong>Are Citadel and Friends shorting ETFs directly that contain GME?</strong> <em>YES</em>, but that’s not the entire picture</p>\n\n<p><strong>Isn’t shorting an ETF that only contains 1-5% GME expensive and cost prohibitive?</strong> </p>\n\n<p><em>NO</em><strong>,</strong> and here’s why.</p>\n\n<h1>Operational Shorting – Naked Shorting ETFs at a PROFIT for Citadel</h1>\n\n<p><strong>What Is an ETF?</strong> An exchange traded fund (ETF) is like a basket of stocks that can be purchased or sold on an exchange like a single regular stock.</p>\n\n<p><strong>Rise of ETFs</strong> are concerning since they constitute a disproportionately high amount of US trading volume. 25% of all US equity trading volume, but only constitute 5% market cap.</p>\n\n<p><strong>Why is there such a high ETF trading volume?</strong> Answer: Its profitable for the APs</p>\n\n<p><strong>What is an AP?</strong> An authorized participant is an organization that has the right to create and redeem shares of an exchange traded fund (ETF) like big banks or market makers like Citadel</p>\n\n<p><strong>How does Citadel make money on selling / buying ETFs?</strong></p>\n\n<p><strong>Arbitrage</strong>. The buying and selling of securities in different markets or forms in order to take advantage of the differing prices of the same asset.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Arbitrage Analogy:</strong></p>\n\n<p>Think of ETFs like XRT as a fruit basket, and the stocks they contain fruits. Say the XRT fruit basket was $6 and contained a banana (GME), orange, and apple. And individual bananas are $1, oranges are $2, and apples are $3.  The total cost of buying the fruits individually is the NAV (net asset value) which in this case is also $6. Citadel can make their own fruit baskets by buying individual fruits but they wouldn’t make too much money since the price of the fruit basket are usually similar to the NAV. In recent years Citadel and other APs have found a much more profitable strategy – Operational Shorting.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xbgahbnu38p61.png?width=512&amp;format=png&amp;auto=webp&amp;s=d2a85ef438ab5b7535f10e981b6787f5ffea2a40\">https://preview.redd.it/xbgahbnu38p61.png?width=512&amp;format=png&amp;auto=webp&amp;s=d2a85ef438ab5b7535f10e981b6787f5ffea2a40</a></p>\n\n<p><strong>Operational Shorting Analogy:</strong></p>\n\n<p>Citadel has the ability to NAKED SELL nonexistent fruit baskets (XRT / IWM) at $6 but not deliver on them until 6 days later. Flooding the market with tons of promised fruit baskets can drive down the price of individual fruits (bananas went from $1 -&gt; $0.5, oranges to $1.8, apples to $2.7), only to buy back the individual fruits 6 days later at a CHEAPER NAV and deliver those fruit baskets to you. That fruit basket that was delivered to buyers only cost Citadel (0.5 + 1.8 + 2.7 = $5) to make, netting them a cool $1 while also driving down the price of bananas by 50%.</p>\n\n<p>&#x200B;</p>\n\n<h1>Operational Shorting by Citadel</h1>\n\n<p>When faced with “excess buying” pressure for ETF shares, <strong>the AP/MM can sell shares “naked” and then locate or create the shares at a later time (up to T+6 for “bona fide” market making)</strong></p>\n\n<p>Market makers, often commercial banks or hedge funds, create ETFs for their issuers by buying the securities that the funds are supposed to represent. <strong><em>But they&#39;ve discovered that they can make a predictable return by delaying the purchases and selling you nonexistent exchange-traded fund shares that they will create later</em></strong>. These transactions are a form of shorting – Operational Shorting as coined by Richard Evans, Professor at the Darden School of Business.</p>\n\n<p>&#x200B;</p>\n\n<h1>Okay.. What does this mean for GME?</h1>\n\n<p><strong>Citadel is willing to NAKED SHORT ANY ETF containing GME</strong>, and by extension the <strong>ENTIRE MARKET</strong> (will show later) to drive down the price of GME. </p>\n\n<p><a href=\"https://preview.redd.it/fmcvf8th58p61.png?width=1645&amp;format=png&amp;auto=webp&amp;s=b0aaf95f29be4cd34b050883f8f3efefec40e2c8\">https://preview.redd.it/fmcvf8th58p61.png?width=1645&amp;format=png&amp;auto=webp&amp;s=b0aaf95f29be4cd34b050883f8f3efefec40e2c8</a></p>\n\n<h1>If Citadel Shorted ETFs to Drive Down GME Price, Why Did It Go Up Today?</h1>\n\n<p>SEC Rules that Citadel must deliver on naked ETF shorts by T+6 by buying back the underlying shares. Today lines up just under this restriction from the first time IWM was shorted on Mar 18.</p>\n\n<p><a href=\"https://preview.redd.it/s3g2vp5748p61.png?width=968&amp;format=png&amp;auto=webp&amp;s=f538798a7a0ac6fb52ae6709604762b0c7b21907\">https://preview.redd.it/s3g2vp5748p61.png?width=968&amp;format=png&amp;auto=webp&amp;s=f538798a7a0ac6fb52ae6709604762b0c7b21907</a></p>\n\n<h1>Conclusion</h1>\n\n<p>Findings from Evan’s paper on ETF Short Interest and Failures-to-Deliver: Naked Short-Selling or Operational Shorting? </p>\n\n<blockquote>\n<p>If higher levels of FTDs spill over from one ETF to another within the same AP or across different APs with overlap in their ETF market making activities, <strong>operational shorting could increase financial instability</strong>. When we examine the impact of FTDs across different ETFs, <strong>we find evidence consistent with this contagion-like effect</strong>. Moreover, we also find that <strong>APs that are closer to their maximum regulatory leverage limit are more likely to operationally short</strong>. These results suggest ETF trading relies on an inter-connected network of liquidity providers which, at times, pursue positively correlated <strong>trading strategies that can be detrimental to the overall market.</strong>”</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p><strong>Additional Findings on Operational Shorting and Financial Linkages</strong></p>\n\n<ul>\n<li>APs who are operationally short in one ETF, are more likely to be operationally short in other ETFs for which they serve as an AP (intra-AP linkage)\n\n<ul>\n<li>Proof in point: Citadel began shorting XRT to drive down the price of GME in Feb, and more recently have shorted IWM to drive down the price of GME again</li>\n</ul></li>\n<li>A given AP has higher operational shorting when other APs have higher levels of operational shorting (inter-AP linkage)\n\n<ul>\n<li>Higher operational shorting by Citadel linked to higher operational shorting by other APs</li>\n</ul></li>\n<li>Looking at regulatory constraints on AP leverage, <strong>we also find that the closer a firm is to its regulatory leverage limit, the higher levels of operational shorting.</strong> <strong>This is consistent with a contagion-like effect that could cause entire market instability.</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h1>CITADEL AND FRIENDS FUCKED AND ON THE BRINK.</h1>\n\n<h1>UPTICK IN RECENT ETF NAKED SHORTING SIGNALS THAT THEY ARE CLOSER TO THEIR REGULATORY LEVERAGE LIMITS.</h1>\n\n<h1>EXPECT MORE NAKED SHORTING OF ETFS BUT THESE ADDITIONAL SHORTING MAY LEAD TO ENTIRE MARKET INSTABILITY</h1>\n\n<p>&#x200B;</p>\n\n<p><strong>Sources:</strong></p>\n\n<p>Evans, Richard B. and Moussawi, Rabih and Pagano, Michael S. and Sedunov, John, ETF Short Interest and Failures-to-Deliver: Naked Short-Selling or Operational Shorting? (March 3, 2021). Darden Business School Working Paper No. 2961954, 2019 Academic Research Colloquium for Financial Planning and Related Disciplines, Available at SSRN: <a href=\"https://ssrn.com/abstract=2961954\">https://ssrn.com/abstract=2961954</a> or <a href=\"http://dx.doi.org/10.2139/ssrn.2961954\">http://dx.doi.org/10.2139/ssrn.2961954</a></p>\n\n<p><strong>Richard Evans – Darden School of Business Slides on Operational Shorting</strong></p>\n\n<p><a href=\"https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/09/Evans-Slides.pdf\">https://jacobslevycenter.wharton.upenn.edu/wp-content/uploads/2018/09/Evans-Slides.pdf</a></p>\n\n<p><strong>Youtube video of Evans giving a talk to Wharton’s on Operational Shorting</strong></p>\n\n<p><a href=\"https://youtu.be/ncq35zrFCAg?t=1641\">https://youtu.be/ncq35zrFCAg?t=1641</a></p>\n\n<p><strong>SEC Fail to Deliver Data</strong></p>\n\n<p><a href=\"https://www.sec.gov/data/foiadocsfailsdatahtm\">https://www.sec.gov/data/foiadocsfailsdatahtm</a></p>\n</div><!-- SC_ON -->",
  "score": 2916,
  "permalink": "/r/wallstreetbets/comments/md66ev/why_gme_went_up_today_and_how_citadel_may_crash/",
  "subreddit": "wallstreetbets",
  "id": "md66ev",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357144840
}