{
  "author": "Dupe5s",
  "original_created_utc": 1625476780,
  "title": "The ugly truth: You can't get rich fast with investing.",
  "created_utc": 1625495434,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many people often have the wrong idea that investing can make them rich in a short amount of time.</p>\n\n<p>However,</p>\n\n<p>Profiting from investing takes time. It is definitely not a get-rich-quick scheme.</p>\n\n<p>It requires time because the market always has a correction even if the price skyrockets.</p>\n\n<p>The richest people are the ones with the most patience. You can&#39;t expect to have 10-100x gains in a short amount of time unless you&#39;re gambling.</p>\n\n<p>To all the new investors out there, be prepared to hold longer than you expected if you&#39;re here for the &quot;quick gains&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/oe3mio/the_ugly_truth_you_cant_get_rich_fast_with/",
  "subreddit": "CryptoCurrency",
  "id": "oe3mio",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Many people often have the wrong idea that investing can make them rich in a\nshort amount of time.\n\nHowever,\n\nProfiting from investing takes time. It is definitely not a get-rich-quick\nscheme.\n\nIt requires time because the market always has a correction even if the price\nskyrockets.\n\nThe richest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人は、投資をすれば短期間でお金持ちになれると勘違いしています。\nと思っている人が多いようです。\n\nしかし。\n\n投資で利益を得るには時間がかかります。一攫千金を狙ったものではありません。\nスキームではありません。\n\n価格が高騰しても、市場には必ず調整があるので、時間が必要です。\n時間が必要です。\n\n大金持ちは...",
      "title": "醜い真実：投資で早く金持ちになることはできない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多人经常有错误的想法，认为投资可以使他们在短时间内致富。\n短时间内致富。\n\n然而。\n\n从投资中获利需要时间。它绝对不是一个快速致富的\n计划。\n\n它需要时间，因为市场总是有一个修正，即使价格\n暴涨。\n\n最富有的人",
      "title": "丑陋的真相：你不可能通过投资快速致富。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多人經常有錯誤的想法，認爲投資可以使他們在短時間內致富。\n短時間內致富。\n\n然而。\n\n從投資中獲利需要時間。它絕對不是一個快速致富的\n計劃。\n\n它需要時間，因爲市場總是有一個修正，即使價格\n暴漲。\n\n最富有的人",
      "title": "醜陋的真相：你不可能通過投資快速致富。"
    }
  ]
}