{
  "author": "jnc23",
  "the_new_excerpt": "First of all – season’s greetings, merry Christmas, and happy holidays to you\nall! I hope everyone had a good time and managed to spend a few days (hours?)\naway from the charts. There is more to life than crypto, and sometimes it’s good\nto remember that.\n\nAnyway, I had a bit of time on my hands and…",
  "original_created_utc": 1609184281,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，向您致以节日的问候，圣诞快乐，节日快乐！\n全!我希望每个人都玩得很开心，并设法花了几天(几个小时？)\n远离排行榜。生活中有比密码更多的东西，有时它是好的\n记住这一点。\n\n不管怎样，我有一点时间和…在一起",
      "title": "为什么我认为Nano会失败，为什么我认为推荐它是不负责任的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，向您致以節日的問候，聖誕快樂，節日快樂！\n全!我希望每個人都玩得很開心，並設法花了幾天(幾個小時？)\n遠離排行榜。生活中有比密碼更多的東西，有時它是好的\n記住這一點。\n\n不管怎樣，我有一點時間和…在一起",
      "title": "爲什麼我認爲Nano會失敗，爲什麼我認爲推薦它是不負責任的。"
    }
  ],
  "title": "Why I think Nano will fail and why I think it is irresponsible to recommend it.",
  "created_utc": 1609204649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all – season’s greetings, merry Christmas, and happy holidays to you all! I hope everyone had a good time and managed to spend a few days (hours?) away from the charts. There is more to life than crypto, and sometimes it’s good to remember that.</p>\n\n<p>Anyway, I had a bit of time on my hands and wanted to get something off my chest. Apologies for the clickbait title, but I want to spark some debate.</p>\n\n<p>We’ve just seen the first bull market for three years and many coins are massively up. One regularly shilled token is not among them. Let’s have a quick delve into why this might be. I don’t want to unfairly bash Nano here, but I am going to try and bring some objective facts to light, and you can make up your own mind.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;I don&#39;t really care about being right, I just care about success. I don&#39;t mind being wrong, and I&#39;ll admit that I&#39;m wrong a lot. It doesn&#39;t really matter to me too much.&quot; ~ Steve Jobs</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>The thing that was starting to annoy me this year was that lots of new people were joining the sub,  starting to get into crypto, and asking simple questions only to be met with guys like <a href=\"/u/SenatusSPQR\">u/SenatusSPQR</a> on EVERY. DAMN. POST talking about our Lord and Saviour Nano.</p>\n\n<p><strong>These new people were told to bet on the wrong horse. I find that misguided at best and malicious at worst.</strong></p>\n\n<p>People buying crypto want their investment to go up. Nano <strong>obviously</strong> didn’t do that. If you care at all about the worth of your investment (and you <em>should</em>), then Nano was the wrong pick.</p>\n\n<p>There is an opportunity to make life-changing amounts of money, and/or be part of a decentralized financial revolution. We should be recommending the right coins to newcomers. There is HUGE opportunity cost of getting it wrong. Imagine stumbling on <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a> earlier this year and thinking “BTC is too expensive” and buying something else instead. </p>\n\n<p>Here is a year comparison of Nano vs, BTC, ETH, XMR, ADA</p>\n\n<p><a href=\"https://preview.redd.it/ibjm33jrny761.png?width=3584&amp;format=png&amp;auto=webp&amp;s=f6040124d8e33d0abde1feb3736458089fb02204\">Did you bet on a winning horse or a donkey?</a></p>\n\n<p>The way I see it BTC is the king, Eth does DeFi, ADA is a hedge against Eth, and Monero does privacy. There are many other coins that represent different market segments. Lots of them outperformed Nano.</p>\n\n<p>Now at this point, considering many coins have recovered since 2018, I’d say there are two viewpoints one could adopt re: Nano.</p>\n\n<ol>\n<li>“The price is wrong dammit, one day Nano will rise again!”</li>\n<li>“Nano isn’t recovering, what have I missed?”</li>\n</ol>\n\n<p>I think it’s more useful to adopt the second viewpoint. At some point, I think you have to adopt the second viewpoint. But many will continue to hold the first. This can be explained by a number of cognitive biases. You might remember from <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/k1ze2w/the_probability_of_getting_rich_in_six_months_is/\">my previous post on longterm investing</a> that I’m a fan of this stuff.</p>\n\n<p><a href=\"https://www.behavioraleconomics.com/resources/mini-encyclopedia-of-be/endowment-effect/\">The endowment effect</a> refers to when we “overvalue something that we own, regardless of its objective market value”.</p>\n\n<p>I would say that accurately describes the most vocal Nano holders. The market has spoken. Again, rather than see this as continued evidence that Nano is undervalued, instead you could see it as evidence that it is <em>fairly</em> valued, and that you have missed something.</p>\n\n<p>If at any point this year, you had sold Nano and bought ETH or BTC, then continued to DCA, you would have likely recouped your losses. Eth is now nearly 500% up. However, three years of holding leads to serious <a href=\"https://www.behavioraleconomics.com/resources/mini-encyclopedia-of-be/loss-aversion/\">loss aversion</a>. That discomfort you feel when considering selling into btc/eth and being done with it, is the <a href=\"https://www.behavioraleconomics.com/resources/mini-encyclopedia-of-be/sunk-cost-fallacy/\">sunk cost fallacy</a>.</p>\n\n<h1>Fast and Feeless</h1>\n\n<p>Why might this not be such a big deal?</p>\n\n<p>It’s possible that transaction costs actually act as <em>incentives for economic activity</em>. The boom in DeFi this summer was driven by the fact that fees could be earned. Lending money to a liquidity pool was <em>incentivised</em> by the collection of fees. More broadly, transaction costs are what motivate mining of PoW coins. Fees secure a network. Staking coins for interest also locks up part of the supply reducing sell pressure.</p>\n\n<p>I’ve done a lot of reading around this over the last few months to try and answer it myself, and I’ll be honest and admit that I cannot find a simple, easy to digest source to link here. However, speak to an economist and you’l find out that transaction costs act as lubrication to an economic system.</p>\n\n<p><em>What if, after all this time, feeless is a bug and not a feature?</em></p>\n\n<p>What if charging tiny fees – enough to encourage people to run nodes or whatever, but small enough to not hugely inconvenience them – was actually better than charging no fees? I genuinely suspect that if Nano was fast and nearly-feeless it would do better than it has.</p>\n\n<p>And if you think I might be wrong, you can always ask yourself, why did DeFi explode this summer? Even when the gas fees got totally out of control? What was the reason for that? Why do people care about DeFi so much? Answer that honestly, and you might see which coins are likely to blow up over the coming months and years.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;Persistence and determination are incredibly important. But sometimes you need to analyze the situation and understand when you&#39;re wrong. You need to be able to cop to being wrong, learn to change, and continue to grow as a human being.&quot; ~ Sasha Grey</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<h1>What is the honest reason for holding Nano?</h1>\n\n<p><strong>Store of Value?</strong></p>\n\n<p>On the Bitcoin front, there has been <a href=\"https://bitcointreasuries.org/\">massive institutional investment</a> from hedge funds and other companies looking to diversify their treasuries. <a href=\"https://www.bybt.com/Grayscale\">Grayscale now has $16 Billion of BTC under management</a>.</p>\n\n<p>One thing I find interesting about this development is that it effectively settles the “store of value” vs “digital cash” argument. Bitcoin is used more than ever and has greater value than ever, but not because it’s being used as cash. This is NOT Satoshi’s vision, but - putting emotions aside for a minute - I think that’s neither a good nor bad thing. It’s just a thing. It just shows that the market has developed in one particular direction with regards to one particular coin.</p>\n\n<p><strong>Digital Cash?</strong></p>\n\n<p>Nano is often described as fulfilling Satoshi’s vision, as if this was the only thing of importance. I probably have a better understanding of the Whitepaper than most, have actually used bitcoin to buy things (in 2014 no less), and I still don’t think this is the be-all, end-all of crypto. If this was so important, Bitcoin Cash would be more popular. It’s a coin that I feel is unfairly derided, as it does what it set out to do. Still, not used all that much is it?</p>\n\n<p>If a token wants to be a medium of exchange, it needs to be relatively stable, hence the massive increase in stablecoins over the last few years. Nano bagholders might shout “but fees!” at this point, but what if <a href=\"https://cryptoslate.com/cryptos/stablecoin/\">stablecoins moved from the eth network to other networks</a> and fees continued to come down? I’ve used Vai on BSC and it cost a couple of cents to move and was near-instant.</p>\n\n<p>Serious question - what do you think will win: stablecoins with very low fees, or Nano with zero fees? If stablecoins continue to develop, move onto other networks, and are adopted by exchanges, what will be the advantage of using Nano?</p>\n\n<p><strong>Novelty?</strong></p>\n\n<p>At this point, maybe you just like the technology. You think it’s fun to use a token for things. That’s cool, but why? That’s what Doge is for ;) If you don’t care about price at all, then why are you shilling it to newcomers who do care about the price?</p>\n\n<h1>Use this time in history wisely</h1>\n\n<p>Past performance does not guarantee future results, but if you were trying to make the best bets you could, why bet on a donkey?</p>\n\n<h1>A Caveat</h1>\n\n<p>I could totally be wrong. I held XRB in the distant past, and some Nano in the not-too-distant past. One possible route to price increase that I can see is if multiple exchanges adopted Nano and provided Nano pairs. If that happens, it would thrive.</p>\n</div><!-- SC_ON -->",
  "score": 212,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/v-HXaFbu7B-LCorNBu9bOV-sCEHanO5EFo9dC9StJ7o.png?auto=webp&s=b70a8901fe045629bb7b5c8886743a1ec5cc26d7",
          "width": 3584,
          "height": 2240
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/v-HXaFbu7B-LCorNBu9bOV-sCEHanO5EFo9dC9StJ7o.png?width=108&crop=smart&auto=webp&s=fc4e7cc2979d35eab734369d9edabd46e5d06d02",
            "width": 108,
            "height": 67
          },
          {
            "url": "https://external-preview.redd.it/v-HXaFbu7B-LCorNBu9bOV-sCEHanO5EFo9dC9StJ7o.png?width=216&crop=smart&auto=webp&s=1f6e5f9600f0e8c5ea1fe8127eb1d1ba06c41cfb",
            "width": 216,
            "height": 135
          },
          {
            "url": "https://external-preview.redd.it/v-HXaFbu7B-LCorNBu9bOV-sCEHanO5EFo9dC9StJ7o.png?width=320&crop=smart&auto=webp&s=01ee0cecb823f930af310b409c585d072aa438d8",
            "width": 320,
            "height": 200
          },
          {
            "url": "https://external-preview.redd.it/v-HXaFbu7B-LCorNBu9bOV-sCEHanO5EFo9dC9StJ7o.png?width=640&crop=smart&auto=webp&s=d3116a4b88ffee21d89acd5e0944030b351b8894",
            "width": 640,
            "height": 400
          },
          {
            "url": "https://external-preview.redd.it/v-HXaFbu7B-LCorNBu9bOV-sCEHanO5EFo9dC9StJ7o.png?width=960&crop=smart&auto=webp&s=9875327c38a4fef33bbc64802a92a3a4892767ae",
            "width": 960,
            "height": 600
          },
          {
            "url": "https://external-preview.redd.it/v-HXaFbu7B-LCorNBu9bOV-sCEHanO5EFo9dC9StJ7o.png?width=1080&crop=smart&auto=webp&s=d8e15ca47cafdfa70d98dd46fa153394d5b6a55f",
            "width": 1080,
            "height": 675
          }
        ],
        "variants": {},
        "id": "AvcpkhyXoC_e2CPL5tkbkZPqFcSPzCINqCyJvoABVtE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/klxb2o/why_i_think_nano_will_fail_and_why_i_think_it_is/",
  "subreddit": "CryptoCurrency",
  "id": "klxb2o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495333641
}