{
  "author": "broken_throw_away__",
  "original_created_utc": 1630548393,
  "title": "ADA breaks the $3 barrier!!",
  "created_utc": 1630553468,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since a few days it seemed that ADA was going for the $3 barrier, the recent pump let the price oscilating around $2.8 and just now the price went above $3!!!</p>\n\n<p>Without a doubt all the announcements prepares for September, the long awaited Smart contracts on the blockchain that are currently being tested is making the price pump.</p>\n\n<p>Congrats to all the ADA Holders and believers in the project!</p>\n\n<p>We still have to wait for the rest of the announcements later this month, and see how the test of smrt contracts goes, but definetly seems like people are really bullish on Cardano.</p>\n</div><!-- SC_ON -->",
  "score": 285,
  "permalink": "/r/CryptoCurrency/comments/pg8dsc/ada_breaks_the_3_barrier/",
  "subreddit": "CryptoCurrency",
  "id": "pg8dsc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since a few days it seemed that ADA was going for the $3 barrier, the recent\npump let the price oscilating around $2.8 and just now the price went above\n$3!!!\n\nWithout a doubt all the announcements prepares for September, the long awaited\nSmart contracts on the blockchain that are currently being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数日前からADAは3ドルの壁を目指していると思われていましたが、最近のポンプで\n2.8ドル前後で推移していましたが、先ほど3ドルを超えてきました。\n$3!!!\n\n間違いなく、すべての発表が9月に向けて準備され、待ちに待った\n現在開発中のブロックチェーン上のスマートコントラクト...",
      "title": "ADAが3ドルの壁を破る!!!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几天以来，ADA似乎正在向3美元的大关迈进，最近的抽水让价格在2.8美元左右震荡，而刚才的价格则超过了3美元。\n几天来，ADA似乎要冲向3美元的大关，最近的抽奖活动让价格在2.8美元左右震荡，而刚才的价格又超过了\n$3!!!\n\n毫无疑问，所有的公告都是为9月做准备的，人们期待已久的\n区块链上的智能合约，目前正在...",
      "title": "ADA打破了3美元的障碍！!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天以來，ADA似乎正在向3美元的大關邁進，最近的抽水讓價格在2.8美元左右震盪，而剛纔的價格則超過了3美元。\n幾天來，ADA似乎要衝向3美元的大關，最近的抽獎活動讓價格在2.8美元左右震盪，而剛纔的價格又超過了\n$3!!!\n\n毫無疑問，所有的公告都是爲9月做準備的，人們期待已久的\n區塊鏈上的智能合約，目前正在...",
      "title": "ADA打破了3美元的障礙！!"
    }
  ]
}