{
  "author": "Content_Structure118",
  "original_created_utc": 1624665421,
  "title": "Things about Crypto I Learned the Hard Way...",
  "created_utc": 1624689041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Are you new to Crypto? I hope you&#39;re doing research in other places than Reddit,  although this sub can be very helpful. Here are some suggestions that might help you as you invest in projects.     </p>\n\n<ol>\n<li><p>Spend only what you can afford to lose, i.e., &quot;fun&quot; money. I know,  it&#39;s real tempting to use cash from a student loan or a credit card but you&#39;ll eventually regret it, especially if your chosen crypto tanks. Don&#39;t go into debt to invest. It rarely turns out well.        </p></li>\n<li><p>Most folks agree that Dollar Cost Averaging (DCA) is the best investing strategy in Crypto. DCA means buying coins on a regular schedule, hopefully lowering your average costs over time.  You can also DCA/buy the dips, but you never know when a project will be at its lowest, so pure DCA usually works better.          </p></li>\n<li><p>Diversify (don&#39;t put all your eggs in one basket) for risk management, and learn how to build a strong portfolio. A strong portfolio is heavily invested in original, safer coins such as BTC and ETH, with much lower percentages of Alt coins such as VET, ADA, LINK, ALGO, and the like. The alt coins carry higher chances of gains, but also much higher risk of losses.       </p></li>\n<li><p>Do Your Own Research.(DYOR) Don&#39;t just pick a coin shilled by some jerk like me on Reddit or a YouTube analyst. Your friend at work may not be as smart as you think! Read and research to find a project that makes sense and has a real world use cases - good tokenomics and development teams. This is especially important right now because the market is bearish.  Pick only projects that have a reason and utility to outlast others.       </p></li>\n<li><p>Don&#39;t FOMO ( fear of missing out) into a coin. This is most tempting in a Bull market when you see friends making money on a coin that is mooning.  If the token is nearly at its high, It can <em>and</em> will likely consolidate and go down; you can always buy in at the dip in price. Be patient!         </p></li>\n<li><p>Hold on to your coins,  especially if you bought them because you believe in their future. You will make more money Holding than selling and buying another Crypto almost EVERY TIME. The only good time to sell is with a profit, or if you decide the coin you hold is worthless or a s***coin. Otherwise HODL!      </p></li>\n<li><p>Don&#39;t PANIC SELL!  This is usually the first mistake Noobs make in order to cut their losses.  I know I did.  Had I never panic sold, I would be up about 60% higher than I am today.  \nThis panic selling also happens in a bear market,  when losses can hit 30% in day. Everyone wants to sell at the same time.  \nWhen you are in doubt about your coin&#39;s recent dive,  zoom out on the price chart to look at a year or three, and you will realize most 20% dips come right back up. &quot;When in doubt,  Zoom out!&quot;     </p></li>\n<li><p>Invest in a hardware wallet (directly from the company - NOT Amazon) when you make time. You can keep coins on exchanges or &quot;hot&quot; (online) wallets when actively trading, but take the crypto out when not trading for safety.  Some exchanges do not give you a seed phrase: many people say &quot;Not your keys, Not your Coin.&quot;  Your hardware wallet will have a personal seed phrase to unlock your crypto.       </p></li>\n<li><p>Have an exit plan.  Some people take out their original investment and play only with the &quot;house&quot; money or profits. Others take a percent of profits when a coin reaches a certain % gain or value. Set a goal and use it. If you wait until the bear market you may not have profits to take.      </p></li>\n<li><p>Don&#39;t watch your phone or computer all the damn time.  Unless you&#39;re a successful day trader (less than .05% of people, most experts say) you don&#39;t need to watch prices but one or two times a day. Nothing you will see should change your strategy unless BTC drops to 10k and you want to buy more. Stress kills.        </p></li>\n</ol>\n\n<p>11. Most people in Crypto just want to get out of poverty and gain some savings. A little money can mean a lot to some of us. BUT, It&#39;s only money. Money is not worth your health,  family,  career,  or life. This leads to...    </p>\n\n<ol>\n<li>Enjoy your family and friends. Spend time with loved ones, and enjoy their company.  Go for a hike, a run, or out for dinner.  This may not seem Cryptocurrency related,  but Crypto will never hold your hand when you&#39;re sick, give you love, or be there when you need help.<br/></li>\n</ol>\n\n<p>Hope these have helped. Good luck and HODL!</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/o7zm61/things_about_crypto_i_learned_the_hard_way/",
  "subreddit": "CryptoCurrency",
  "id": "o7zm61",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Are you new to Crypto? I hope you're doing research in other places than\nReddit,  although this sub can be very helpful. Here are some suggestions that\nmight help you as you invest in projects.  \n\n 1.  Spend only what you can afford to lose, i.e., \"fun\" money. I know,  it's\n     real tempting to use…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたはCryptoの初心者ですか？あなたが他の場所で研究していることを願っています。\nRedditは非常に参考になりますが。ここでは、プロジェクトに投資する際に役立つと思われる\nプロジェクトに投資する際に役立つかもしれません。  \n\n 1.  失ってもいいお金、つまり「お楽しみ」のお金だけを使いましょう。分かっています、それは\n     使いたくなるのはわかりますが...。",
      "title": "私が苦労して学んだCryptoに関すること..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你是第一次接触加密货币吗？我希望你是在其他地方做研究，而不是在\nReddit，尽管这个子网站可能非常有帮助。这里有一些建议\n可能对你的投资项目有所帮助。  \n\n 1.  只花你能承受的损失，即 \"好玩 \"的钱。我知道，这\n     我知道，这真的很诱人，可以用...",
      "title": "我从艰难的道路上学到的关于加密货币的事情..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你是第一次接觸加密貨幣嗎？我希望你是在其他地方做研究，而不是在\nReddit，儘管這個子網站可能非常有幫助。這裏有一些建議\n可能對你的投資項目有所幫助。  \n\n 1.  只花你能承受的損失，即 \"好玩 \"的錢。我知道，這\n     我知道，這真的很誘人，可以用...",
      "title": "我從艱難的道路上學到的關於加密貨幣的事情..."
    }
  ]
}