{
  "author": "TheGreenAlchemist",
  "original_created_utc": 1643152556,
  "title": "How close was Vincent Van Gogh to being \"discovered\"? If he had lived longer is it likely he would have become popular?",
  "created_utc": 1643199887,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was at the Van Gogh Immersive exhibit recently and one of the exhibits said he died &amp;quot;just as his work was starting to get recognition&amp;quot;. Previously I thought he had died in utter obscurity but this makes it sound like there was reason to think things were improving. Obviously a &amp;quot;what if&amp;quot; question can&amp;#39;t really be answered, but maybe let&amp;#39;s just focus on: is that exhibit accurate? Was he experiencing some kind of rise in interest just before his death?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/scqs41/how_close_was_vincent_van_gogh_to_being/",
  "subreddit": "AskHistorians",
  "id": "scqs41",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was at the Van Gogh Immersive exhibit recently and one of the exhibits said he\ndied \"just as his work was starting to get recognition\". Previously I thought he\nhad died in utter obscurity but this makes it sound like there was reason to\nthink things were improving. Obviously a \"what if\" question…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ゴッホのイマーシブ展に行ったのですが、展示物のひとつにゴッホのことが書いてありました。\n彼の作品が評価され始めた頃」に亡くなりました。以前は、私は彼が\nしかし、これではまるで、無名のまま死んでしまったかのようです。\nと思っていました。明らかに「もしも」の質問ですが...。",
      "title": "フィンセント・ファン・ゴッホは「発見」される寸前まで行ったのか？もし彼がもっと長生きしていたら、人気者になっていた可能性はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近在梵高的沉浸式展览上，其中一个展品说他\n死于 \"他的作品开始得到认可的时候\"。以前我以为他\n但这听起来像是有理由认为事情正在改善。\n认为事情正在改善。很明显，这是一个 \"如果 \"问题......",
      "title": "文森特-凡高离被 \"发现 \"还有多远？如果他活得更久，他有可能变得流行吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近在梵高的沉浸式展覽上，其中一個展品說他\n死於 \"他的作品開始得到認可的時候\"。以前我以爲他\n但這聽起來像是有理由認爲事情正在改善。\n認爲事情正在改善。很明顯，這是一個 \"如果 \"問題......",
      "title": "文森特-凡高離被 \"發現 \"還有多遠？如果他活得更久，他有可能變得流行嗎？"
    }
  ]
}