{
  "author": "anarcho-onychophora",
  "original_created_utc": 1643074863,
  "title": "The mite genus, Adactylidium, has an unusual lifecycle, where males impregnate sisters while both are still inside their pregnant mother. How does this not cause the sort of genetic catastrophe that inbreeding is known for?",
  "created_utc": 1643119439,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From Wikipedia (in case I summarized any of it incorrectly): The pregnant female mite feeds upon a single egg of a thrips,  growing five to eight female offspring and one male in her body. The  single male mite mates with all the daughters when they are still in the  mother. The females, now impregnated, eat their way out of their  mother&amp;#39;s body so that they can emerge to find new thrips eggs&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/sc1owz/the_mite_genus_adactylidium_has_an_unusual/",
  "subreddit": "askscience",
  "id": "sc1owz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From Wikipedia (in case I summarized any of it incorrectly): The pregnant female\nmite feeds upon a single egg of a thrips, growing five to eight female offspring\nand one male in her body. The single male mite mates with all the daughters when\nthey are still in the mother. The females, now…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィキペディアより（間違って要約しているところがあるかもしれないので）。妊娠したメスは\nダニはスリップスの卵1個を食べ、5～8匹のメスの子供を育てます。\nと1匹のオスが体内にいる。1匹の雄ダニは、娘たち全員と交尾する。\nまだ母親の中にいる。メスは、いまや...",
      "title": "ダニ属のAdactylidiumは、オスが妊娠中の母親の体内にいる間に姉妹を孕ませるという珍しいライフサイクルを持つダニである。近親交配で知られるような遺伝的破滅をどうして起こさないのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "来自维基百科（以防我总结的任何内容不正确）。怀孕的雌性\n怀孕的雌性螨虫以蓟马的一个卵为食，在体内生长出五到八个雌性后代和一个雄性后代。\n和一只雄螨。单一的雄性螨虫与所有的女儿交配，当它们\n它们还在母体中。雌性，现在...",
      "title": "螨属Adactylidium有一个不寻常的生命周期，雄性在姐妹俩还在怀孕的母亲体内时就受孕了。这怎么能不造成近亲繁殖所带来的那种遗传灾难呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來自維基百科（以防我總結的任何內容不正確）。懷孕的雌性\n懷孕的雌性蟎蟲以薊馬的一個卵爲食，在體內生長出五到八個雌性後代和一個雄性後代。\n和一隻雄蟎。單一的雄性蟎蟲與所有的女兒交配，當它們\n它們還在母體中。雌性，現在...",
      "title": "蟎屬Adactylidium有一個不尋常的生命週期，雄性在姐妹倆還在懷孕的母親體內時就受孕了。這怎麼能不造成近親繁殖所帶來的那種遺傳災難呢？"
    }
  ]
}