{
  "author": "pjman7",
  "original_created_utc": 1629799362,
  "title": "Finally! It's official, I now have a job in crypto!",
  "created_utc": 1629804648,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I lost my job in April during the pandemic. I told myself that my next job would be in a position that somehow was crypto related. Being a system admin I figured it shouldn&#39;t be too hard. Unfortunately they are few and far between still. But after multiple positions applied for and multiple rejections after more than 10 video interviews with 1 company I can finally say I accepted a job with a company working to support Defi and both POW and POS infrastructure which I will be helping to setup and administer. I couldn&#39;t be more excited! </p>\n\n<p>A happy cake day to me indeed!</p>\n</div><!-- SC_ON -->",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/paka98/finally_its_official_i_now_have_a_job_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "paka98",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I lost my job in April during the pandemic. I told myself that my next job would\nbe in a position that somehow was crypto related. Being a system admin I figured\nit shouldn't be too hard. Unfortunately they are few and far between still. But\nafter multiple positions applied for and multiple…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はパンデミック中の4月に仕事を失いました。私は、次の仕事は\n次の仕事は暗号に関連した仕事にしようと思っていました。システム管理者である私は、それほど難しいことではないと\n難しいことではないと思っていました。残念ながら、今でもそのような仕事はほとんどありません。しかし\n複数のポジションに応募して、複数の...",
      "title": "ついに! 公式に、私は今、cryptoの仕事をしています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在4月大流行期间失去了工作。我告诉自己，我的下一份工作将\n我告诉自己，我的下一份工作将是一个以某种方式与加密货币有关的职位。作为一个系统管理员，我想\n这应该不会太难。不幸的是，这些职位仍然少之又少。但是\n在申请了多个职位和多个...",
      "title": "终于来了! 这是正式的，我现在有了一份加密货币的工作!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在4月大流行期間失去了工作。我告訴自己，我的下一份工作將\n我告訴自己，我的下一份工作將是一個以某種方式與加密貨幣有關的職位。作爲一個系統管理員，我想\n這應該不會太難。不幸的是，這些職位仍然少之又少。但是\n在申請了多個職位和多個...",
      "title": "終於來了! 這是正式的，我現在有了一份加密貨幣的工作!"
    }
  ]
}