{
  "author": "TimikaWestfield",
  "original_created_utc": 1640622552,
  "title": "Here are some of my recommendations for new-comers who want to get started with crypto",
  "created_utc": 1640651843,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I did all of the typical mistakes, such as investing in the wrong projects, participating in shady exchanges, and selling the wrong coins (like selling my BTC after a month which I really don’t wanna think about) I&amp;#39;m at the stage where I&amp;#39;m able to earn with  cryptocurrency, and a lot of people approach me for advice on what to do, tactics, and so on. Right now I’m mostly doing defi farming. Here are a few of my recommendations. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Start with the basics such as accumulating bitcoin, learning how to use a wallet, security, and so on. Don&amp;#39;t just dive into defi coins. It may suck that it feels like you are missing all the gains from the &amp;quot;hot&amp;quot; new coins, but it will equally hurt if you are just burning through your capital.&lt;/li&gt;\n&lt;li&gt;Learn about taxes as much as trading in crypto. Tax is something you should be aware of right away since incorrect tax strategies may cost you far more than smart trading strategies. Also, download all trade histories at the end of each quarter to keep your data secure.&lt;/li&gt;\n&lt;li&gt;Use Telegram or Discord to find helpful trading groups. Eventually they will be a vital source of information or just ways to bounce ideas off. (E.g &lt;a href=\"https://www.coindesk.com/\"&gt;CoinDesk&lt;/a&gt;)&lt;/li&gt;\n&lt;li&gt;Read the crypto news as much as you can. And always have some BTC on an exchange ready to buy on such an opportunity. Again, telegram is great for this as you can quickly see tweets or news-links being shared.&lt;/li&gt;\n&lt;li&gt;Maintain a separate stack of Bitcoin or Ethereum for your &amp;quot;HODL&amp;quot; portfolio that you never touch. This will be beneficial for tax purposes. Transfer some gains into your long-term stack on a regular basis. Don&amp;#39;t do anything with that stack and like I said just keep holding.&lt;/li&gt;\n&lt;li&gt;Something I wish I had done from the start is tracking all my investments, gains and losses in an excel spreadsheet. This is how I manage everything coming in and out or if something is wrong with my portfolio.&lt;/li&gt;\n&lt;li&gt;For farming, make sure you are using the right apps like &lt;a href=\"https://zapper.fi/\"&gt;Zapper&lt;/a&gt; or &lt;a href=\"https://apy.vision/\"&gt;Apy Vision&lt;/a&gt; to track all your positions, your yield and any impermanent loss. That will also help with tax records should you need it. Watch out for farming on the ETH network as your gas fees will chew up any gains if you have small positions. &lt;a href=\"https://www.yield.app/\"&gt;Yield App&lt;/a&gt; is a beginner friendly platform if you are not familiar with defi and yield farming. &lt;/li&gt;\n&lt;li&gt;Don’t torment yourself when you lose on a trade. You&amp;#39;ve made the decision to sell, don&amp;#39;t even up revenge trading where you come back and try to get your losses back on the same trade.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/lSu9jSN3_LuAKIs74or5z0N6oYPDP4QBEKGRLBviyA4.jpg?auto=webp&amp;s=10d0c73d9de9320da8c8045d1ba679dd7a109171",
          "width": 1200,
          "height": 628
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/lSu9jSN3_LuAKIs74or5z0N6oYPDP4QBEKGRLBviyA4.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=e2575eeefa7ded330e986697df829811ab27491e",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/lSu9jSN3_LuAKIs74or5z0N6oYPDP4QBEKGRLBviyA4.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=8ed45377e88d4473bd499072762dfdb9abfc81bf",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/lSu9jSN3_LuAKIs74or5z0N6oYPDP4QBEKGRLBviyA4.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=7d372db64a122d5b6c429a2813f4c88d6faf9b9f",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/lSu9jSN3_LuAKIs74or5z0N6oYPDP4QBEKGRLBviyA4.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a798e0f24ce7c0a0eb8b0d7bbfa0a8aac3cdf828",
            "width": 640,
            "height": 334
          },
          {
            "url": "https://external-preview.redd.it/lSu9jSN3_LuAKIs74or5z0N6oYPDP4QBEKGRLBviyA4.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=5b4113f47eab24a841bb45d2054ae1fc759f4c12",
            "width": 960,
            "height": 502
          },
          {
            "url": "https://external-preview.redd.it/lSu9jSN3_LuAKIs74or5z0N6oYPDP4QBEKGRLBviyA4.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=490976a8e071d026bfbbf23d61fac3742d052610",
            "width": 1080,
            "height": 565
          }
        ],
        "variants": {},
        "id": "imHFrJOqhRqE7iEXCtHyjqQTEIOgw1FEkvgeIQSA_Fg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/rpr63u/here_are_some_of_my_recommendations_for_newcomers/",
  "subreddit": "CryptoCurrency",
  "id": "rpr63u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I did all of the typical mistakes, such as investing in the wrong projects,\nparticipating in shady exchanges, and selling the wrong coins (like selling my\nBTC after a month which I really don’t wanna think about) I'm at the stage where\nI'm able to earn with cryptocurrency, and a lot of people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、間違ったプロジェクトに投資してしまうなど、典型的な失敗をすべて行ってしまいました。\n怪しい取引所に参加したり、間違ったコインを売ったり（例えば、私が持っている\nBTCは1ヶ月後、本当に考えたくもないですが）私は今、その段階にいます。\n暗号通貨で稼げるようになり、多くの人...",
      "title": "これから暗号を始めたい初心者の方に、私がお勧めする暗号をご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做了所有典型的错误，例如投资于错误的项目。\n参与不正当的交易所，以及出售错误的硬币（比如在一个月后出售我的\n一个月后卖掉了我的BTC，我真的不想去想这个问题）我现在处于一个阶段，我可以通过加密货币赚钱，而很多人...\n我能够用加密货币赚钱，而很多人...",
      "title": "以下是我对那些想开始接触加密货币的新人的一些建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做了所有典型的錯誤，例如投資於錯誤的項目。\n參與不正當的交易所，以及出售錯誤的硬幣（比如在一個月後出售我的\n一個月後賣掉了我的BTC，我真的不想去想這個問題）我現在處於一個階段，我可以通過加密貨幣賺錢，而很多人...\n我能夠用加密貨幣賺錢，而很多人...",
      "title": "以下是我對那些想開始接觸加密貨幣的新人的一些建議"
    }
  ]
}