{
  "author": "Aggravating_Title593",
  "original_created_utc": 1649532368,
  "title": "Is my mom playing dumb or is she being serious about a box under my bed?",
  "created_utc": 1649545250,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Lmao this has been on my mind for weeks and I actually find it pretty funny but.&lt;/p&gt;\n\n&lt;p&gt;My mom was helping me decorate my room a while back and found where I keep my sex toys under my bed. They’re in a makeup case type thing with a mini padlock on the zip. Trying to keep it as inconspicuous as possible.&lt;/p&gt;\n\n&lt;p&gt;She asked me “what’s in the box?” and I didn’t make eye contact with her when I answered, obviously, because of the contents. I said “oh, I dunno, I have a bunch of crap under my bed.”&lt;/p&gt;\n\n&lt;p&gt;And it’s just like… Come on, lady. I’m a single 22 year old female. What do you THINK is in the locked box under my bed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/u00cgt/is_my_mom_playing_dumb_or_is_she_being_serious/",
  "subreddit": "TooAfraidToAsk",
  "id": "u00cgt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Lmao this has been on my mind for weeks and I actually find it pretty funny but.\n\nMy mom was helping me decorate my room a while back and found where I keep my\nsex toys under my bed. They’re in a makeup case type thing with a mini padlock\non the zip. Trying to keep it as inconspicuous as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Lmao これは何週間も前から気になっていたことで、実際かなり面白いと思っているのですが。\n\n母が僕の部屋の飾りつけを手伝ってくれて、僕がどこに置いているかを見つけたんだ。\nベッドの下にある性具。化粧箱のようなものに入れ、ミニ南京錠をかけています。\nジッパーに なるべく目立たないように...",
      "title": "母はふざけているのか、それとも私のベッドの下にある箱のことを真剣に考えているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经想了几个星期了，实际上我觉得这很有趣，但是。\n\n我妈妈不久前帮我装饰房间时，发现我把性玩具放在床底下的地方。\n性玩具放在床底下。它们被放在一个化妆箱里，拉链上有一个迷你挂锁。\n在拉链上。试图让它尽可能地不显眼......",
      "title": "我妈妈是在装傻还是在认真对待我床下的箱子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經想了幾個星期了，實際上我覺得這很有趣，但是。\n\n我媽媽不久前幫我裝飾房間時，發現我把性玩具放在牀底下的地方。\n性玩具放在牀底下。它們被放在一個化妝箱裏，拉鍊上有一個迷你掛鎖。\n在拉鍊上。試圖讓它儘可能地不顯眼......",
      "title": "我媽媽是在裝傻還是在認真對待我牀下的箱子？"
    }
  ]
}