{
  "author": "Chicano_Ducky",
  "the_new_excerpt": "I find it hard to believe that there were no rules regulating this since\nMesoamerica loved moderation, but I also understand the game has heavy religious\nand symbolic meaning that blatantly spells out the only winning move is not to\nplay.\n\nThe game is a giant allegory for how one's life can become…",
  "original_created_utc": 1618435063,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "から、これを規制するルールがなかったとは信じがたいことです。\nメソアメリカは節度を重んじていましたが、このゲームには宗教的、象徴的な意味があり、あからさまに\n象徴的な意味を持っていることも理解しています。このゲームでは、勝負をしないことが唯一の勝利の手段であると\nこのゲームは\n\nこのゲームは、人の人生がいかにして...となるかを示す巨大な寓話なのです。",
      "title": "アステカの賭博「パトリ」は、賭けるお金がなくなると愛する人や自由を賭けてしまうほどの中毒性があり、年季奉公が横行していました。接触前にこのゲームを規制する試みはあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很难相信，自从有了这个规定之后，就没有任何规则来规范这个事情。\n中美洲人喜欢节制，但我也明白游戏有很重的宗教性\n和象征意义，明目张胆地说出唯一的胜招是不\n戏。\n\n游戏是一个巨大的寓言，一个人的生活如何成为... ...",
      "title": "阿兹特克人的赌博游戏 \"帕托利 \"非常容易上瘾，当玩家没钱下注时，就会拿自己的亲人和自由做赌注，造成契约奴的猖獗。在接触前，有没有尝试过对这种游戏进行监管？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很難相信，自從有了這個規定之後，就沒有任何規則來規範這個事情。\n中美洲人喜歡節制，但我也明白遊戲有很重的宗教性\n和象徵意義，明目張膽地說出唯一的勝招是不\n戲。\n\n遊戲是一個巨大的寓言，一個人的生活如何成爲... ...",
      "title": "阿茲特克人的賭博遊戲 \"帕託利 \"非常容易上癮，當玩家沒錢下注時，就會拿自己的親人和自由做賭注，造成契約奴的猖獗。在接觸前，有沒有嘗試過對這種遊戲進行監管？"
    }
  ],
  "title": "The Aztec gambling game \"Patolli\" was so addictive players would bet their loved ones and freedom when they ran out of money to bet, causing rampant indentured servitude. Was there any attempt to regulate this game pre-contact?",
  "created_utc": 1618452981,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I find it hard to believe that there were no rules regulating this since Mesoamerica loved moderation, but I also understand the game has heavy religious and symbolic meaning that blatantly spells out the only winning move is not to play.</p>\n\n<p>The game is a giant allegory for how one&#39;s life can become unbalanced and how unbalance can be destructive with the most dangerous parts of the board being the &quot;spokes&quot; that represent unbalance in one&#39;s life causing you to lose the game. Couple this with the fact gambling is considered an unbalanced activity, its an ironic game that extols virtue of denying dangerous vices while also BEING a dangerous vice.</p>\n\n<p>Since this was an era where most human cultures tied &quot;luck&quot; to the favor of the gods than probability, would this also factor in why they seemingly did not regulate the game?  </p>\n\n<p>Knowing this, would my hunch of &quot;they allowed it because if you lost this game you deserved to lose not only because the gods willed it, but you ignored the game&#39;s warning&quot; be correct?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/mr09op/the_aztec_gambling_game_patolli_was_so_addictive/",
  "subreddit": "AskHistorians",
  "id": "mr09op",
  "is_self": true,
  "media": null,
  "is_video": false
}