{
  "author": "Zeusan_Pls",
  "original_created_utc": 1641081937,
  "title": "I didn't realize that you have to pay tax on every single Transaction. How fucked am I?",
  "created_utc": 1641145588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before you read: Every transaction was made with usdt and other coins. I basically only payed out fiat once. About 3 months ago i got into crypto and turned 7k into 11k with a lot of transactions. I then put that money in my bank account and wanted to pay the tax later. After a few weeks i took the 11k, added another 15k (so 26k in all), bought a lot of usdt and turned that into 40k using a few altcoins with lots of ups and downs and many transactions. My question is; How fucked am i now since i have over 950 Transactions (Bought and sold)?? The good news is that Changing between Crypto currencies is tax free in march in my country so maybe i can try to work my way around that? My Overall profit is 13k currently. I thought that I only had to pay taxes (27.5%) once i realised that into fiat&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 728,
  "permalink": "/r/CryptoCurrency/comments/rtwdh7/i_didnt_realize_that_you_have_to_pay_tax_on_every/",
  "subreddit": "CryptoCurrency",
  "id": "rtwdh7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Before you read: Every transaction was made with usdt and other coins. I\nbasically only payed out fiat once. About 3 months ago i got into crypto and\nturned 7k into 11k with a lot of transactions. I then put that money in my bank\naccount and wanted to pay the tax later. After a few weeks i took the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "<!-- SC_OFF --><div class=\"md\"><p>Before you read: すべての取引は\nusdtと他のコインで。基本的にフィアットの払い出しは1回だけです。3ヶ月ほど\n7000円から11000円になりました。その後、私は\nそのお金を銀行口座に入れて、税金を払おうと思って...。",
      "title": "トランザクションにいちいち税金を払わなければならないとは知りませんでした。私、どんだけダメなんだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "<！--SC_OFF --><div class=\"md\"><p>在你阅读之前。每笔交易都是\n用usdt和其他硬币。我基本上只支付了一次法币。大约3个月\n前，我开始接触加密货币，并通过大量的交易将7K变成11K。然后我\n我把这些钱放在我的银行账户上，并希望支付税款......",
      "title": "我没有意识到你必须为每一笔交易交税。我是多么糟糕啊？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "<！--SC_OFF --><div class=\"md\"><p>在你閱讀之前。每筆交易都是\n用usdt和其他硬幣。我基本上只支付了一次法幣。大約3個月\n前，我開始接觸加密貨幣，並通過大量的交易將7K變成11K。然後我\n我把這些錢放在我的銀行賬戶上，並希望支付稅款......",
      "title": "我沒有意識到你必須爲每一筆交易交稅。我是多麼糟糕啊？"
    }
  ]
}