{
  "author": "DaddyDersch",
  "the_new_excerpt": "I know Cramer is quite the controversial topic and i think that as long as you\ndo your own DD and listen to what he is actually saying to make that fit into\nyour own narrative he throws out some pretty good nuggets. Disney is one of the\nones i picked up because of him and its been good to me. He…",
  "original_created_utc": 1616635193,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我知道Cramer是一个相当有争议的话题，我认为只要你有足够的时间和精力去研究这个话题。\n做你自己的DD，听听他到底在说什么，使之符合\n你自己的叙事，他抛出了一些相当不错的金块。迪斯尼是一个\n那些我拿起 因为他和它一直对我很好。他...",
      "title": "爱他还是恨他... Cramer/CNBC暗示即将轮动回购科技股"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道Cramer是一個相當有爭議的話題，我認爲只要你有足夠的時間和精力去研究這個話題。\n做你自己的DD，聽聽他到底在說什麼，使之符合\n你自己的敘事，他拋出了一些相當不錯的金塊。迪斯尼是一個\n那些我拿起 因爲他和它一直對我很好。他...",
      "title": "愛他還是恨他... Cramer/CNBC暗示即將輪動回購科技股"
    }
  ],
  "title": "Love him or hate him... Cramer/ CNBC hinted at a rotation back to tech stocks soon",
  "created_utc": 1616668513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know Cramer is quite the controversial topic and i think that as long as you do your own DD and listen to what he is actually saying to make that fit into your own narrative he throws out some pretty good nuggets. Disney is one of the ones i picked up because of him and its been good to me. He also promoted AMD a lot which many people love and are super long on...</p>\n\n<p>Anyways i was listening to Mad Money from Tuesday 3/23/2021 and it was very subtle but i noticed he mentioned that there will be a rotation back to tech stocks soon. Cramer mentioned around easter is when things rally. I am curious to see what happens </p>\n\n<p>In addition today and yesterday listening to Fast Money/ Squak i noticed they mentioned the same thing... but in a different way. They mentioned that PE&#39;s for &quot;value&quot; are slowly  reaching PE&#39;s of &quot;tech&quot; and that with that people are going to jump back into the tech stocks thinking they are getting a deal now which will effectively cause a rotation back to tech. </p>\n\n<p>I found this interesting because in the previous weeks they&#39;ve been promoting value value value and ive been waiting for the hint that we are rotating back. </p>\n\n<p>What are everyone thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/stocks/comments/mcm9w1/love_him_or_hate_him_cramer_cnbc_hinted_at_a/",
  "subreddit": "stocks",
  "id": "mcm9w1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141504
}