{
  "author": "Captainwelfare2",
  "original_created_utc": 1629855876,
  "title": "Sage advice from the big 2018 crash: Before every fomo, ask yourself some important questions",
  "created_utc": 1629873743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Jan 2018, I was riding high.  Had just sold LTC for $300 several months after buying it for $40.  A 700%+ gain in such a short time, it’s the kind of thing most stock market people only dream of.  I had bought low and sold high. Damnit what a rush!</p>\n\n<p>But I was not yet an experienced cryptonaut, and was suddenly reading about how big Ethereum was going to get, how it was going to rewrite the internet as we knew it, and how it would become so scare that it threatened Bitcoin’s dominance.  I read, and I read, and I read some more. Ethereum was going to be like investing in Apple in 1982, but bigger, and faster.  It would be a game changer unlike any other!</p>\n\n<p><strong>I did my own research</strong></p>\n\n<p>So what did I do? I bought in at $1310.  I <em>had</em> to, after all.  It was about to reach escape velocity, right?  Right??</p>\n\n<p><em>Narrator: “He would not, in fact, be right.”</em></p>\n\n<p>You know the story.  The Bull ended.  ETH fell off a cliff.  Week after week after painful week.  $1100.  $950.  $750.  <strong><em>$500</em></strong></p>\n\n<p>For those who haven’t experienced it before, watching your investment crater is numbing.  It feels unreal. There’s a denialism that begins with “OMG I could have bought so much cheaper,” and steadily moves towards “This thing won’t go to zero… will it??”</p>\n\n<p>When Eth finally bottomed i could have bought 13X the amount of ETH for the same Money.  It was too early, in a market too bullish, too Irrational, and ETH was <strong><em>way too expensive.</em></strong></p>\n\n<p>So what did I do?  I sucked in my teeth, shrugged my shoulders, and said “I still believe this is going to succeed.”  I hodled, down 93%.  And today, well you know where ETH stands.</p>\n\n<p>I think it’s important for the n00bs and the Cardanonites and everyone else to remember a few important points with all the people asking now if Cardano is a buy or if they should buy in while the market is pumping.  If you are going to do more than DCA, if you have a lump sum you want to drop on a coin, ask the following:</p>\n\n<p><strong>-If this doubles, will I sell some to ensure profits?</strong></p>\n\n<p><strong>-If this triples and I sold some at double, will I be able to be grateful for my gains?</strong></p>\n\n<p><strong>-If a big FUD incident happens (exchange hack, ban in a country, investigation by government etc.) will I be able to shrug it off?</strong></p>\n\n<p><strong>-If the coin drops, will I regret getting in at this price? If it continues to only go up, will I regret sitting on the sidelines more?</strong></p>\n\n<p><strong>Am I -only- putting in money I 100% dont need and can afford to 100% lose?</strong></p>\n\n<h1><strong><em>If there is a total crash, and my coin drops 75/85/95(!) %, will I have the belief in it and the confidence to know that I will hold on no matter what?</em></strong></h1>\n\n<p>If any of these are a no, then think long and hard about fomoing. Anything could happen.  Tether could blow up tomorrow.  Maybe Binance gets hacked for 5 billion.  Maybe Coinbase gets ransomewared.  The future in uncertain and crypto can be downright terrifying at times.</p>\n\n<p>As a wise man once said “This ain’t no party, this ain’t no disco, this ain’t no foolin around.”</p>\n\n<p><strong>Make sure you aren’t either.</strong></p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/pb1bya/sage_advice_from_the_big_2018_crash_before_every/",
  "subreddit": "CryptoCurrency",
  "id": "pb1bya",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Jan 2018, I was riding high. Had just sold LTC for $300 several months after\nbuying it for $40. A 700%+ gain in such a short time, it’s the kind of thing\nmost stock market people only dream of. I had bought low and sold high. Damnit\nwhat a rush!\n\nBut I was not yet an experienced cryptonaut, and was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2018年1月、私は絶好調でした。40ドルで買ったLTCを数ヶ月後に300ドルで売ったばかりだった。\n40ドルで購入した後、300ドルで売ったばかりでした。短期間で700％以上の利益を得ることは、ほとんどの株式市場の人々が夢見るようなことです。\nほとんどの株式市場の人々は夢見るだけです。私は安く買って高く売りました。いやはや\n何てエキサイティングなんだ\n\nしかし、私はまだクリプトノートの経験が浅く、...",
      "title": "2018年大暴落からの賢者のアドバイス すべてのフォモの前に、自分自身にいくつかの重要な質問をしてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2018年1月，我正高歌猛进。在以40美元买入LTC几个月后，我刚刚以300美元的价格卖出LTC。\n以40美元的价格购买了它。在如此短的时间内获得700%以上的收益，这是大多数股市人士梦寐以求的事情。\n是大多数股市人士梦寐以求的。我低价买入，高价卖出。该死的\n多么令人振奋啊\n\n但我当时还不是一个有经验的加密者，而且是...",
      "title": "2018年大崩盘的圣人建议。在每个fomo之前，问自己一些重要问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2018年1月，我正高歌猛進。在以40美元買入LTC幾個月後，我剛剛以300美元的價格賣出LTC。\n以40美元的價格購買了它。在如此短的時間內獲得700%以上的收益，這是大多數股市人士夢寐以求的事情。\n是大多數股市人士夢寐以求的。我低價買入，高價賣出。該死的\n多麼令人振奮啊\n\n但我當時還不是一個有經驗的加密者，而且是...",
      "title": "2018年大崩盤的聖人建議。在每個fomo之前，問自己一些重要問題"
    }
  ]
}