{
  "author": "babossa77",
  "original_created_utc": 1650897274,
  "title": "BAYC instagram was hacked and people got scammed out of millions in NFTS",
  "created_utc": 1650948421,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Somebody just hacked Bored Ape Yacht Club&amp;#39;s instagram account and made a post trying to get people to connect their wallet to a malicious DAPP. A lot of people did so and now the attacker is stealing their valuable NFTs.&lt;/p&gt;\n\n&lt;p&gt;The attacker has so far stolen 4 BAYC and 6 MAYC NFTs, worth millions of dollars. &lt;/p&gt;\n\n&lt;p&gt;The scam was related to BAYC upcoming metaverse launch, which is set to be this saturday. There will be a landsale for the metaverse probably sometime this week, and the attacker used to situtation to make an announcement on the hacked instagram account to get people to connect their wallets.&lt;/p&gt;\n\n&lt;p&gt;You can follow the hackers wallet yourself on &lt;a href=\"https://etherscan.io/address/0x8c7934611b6ad70fbea13a1593de167a4689b9a9#tokentxnsErc721\"&gt;Etherscan&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/ubmkfy/bayc_instagram_was_hacked_and_people_got_scammed/",
  "subreddit": "CryptoCurrency",
  "id": "ubmkfy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Somebody just hacked Bored Ape Yacht Club's instagram account and made a post\ntrying to get people to connect their wallet to a malicious DAPP. A lot of\npeople did so and now the attacker is stealing their valuable NFTs.\n\nThe attacker has so far stolen 4 BAYC and 6 MAYC NFTs, worth millions…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Bored Ape Yacht Clubのインスタグラムアカウントを誰かがハッキングして、投稿したものです。\nウォレットを悪意のあるDAPPに接続させようとする投稿がありました。多くの人が\n多くの人がそうして、今、攻撃者は彼らの貴重なNFTを盗んでいます。\n\n攻撃者はこれまでに4つのBAYCと6つのMAYC NFTを盗んでおり、これは数百万ドルの価値があります...",
      "title": "BAYCのインスタグラムがハッキングされ、NFTSで数百万円を騙し取られる事件が発生"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有人刚刚黑了无聊的猿人游艇俱乐部的instagram账户并发了一个帖子\n试图让人们将他们的钱包连接到一个恶意的DAPP。很多\n人这样做，现在攻击者正在窃取他们宝贵的NFTs。\n\n到目前为止，攻击者已经窃取了4个BAYC和6个MAYC NFT，价值数百万。",
      "title": "BAYC的Instagram被黑，人们在NFTS中被骗走了数百万美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人剛剛黑了無聊的猿人遊艇俱樂部的instagram賬戶併發了一個帖子\n試圖讓人們將他們的錢包連接到一個惡意的DAPP。很多\n人這樣做，現在攻擊者正在竊取他們寶貴的NFTs。\n\n到目前爲止，攻擊者已經竊取了4個BAYC和6個MAYC NFT，價值數百萬。",
      "title": "BAYC的Instagram被黑，人們在NFTS中被騙走了數百萬美元"
    }
  ]
}