{
  "author": "laidbackagain",
  "the_new_excerpt": "I'd like to know the differences in political climate that lead to Nixon being\nmaligned but Reagan revered among conservatives, since both had some pretty\ndamning scandals during their Presidencies, yet the discrepancy between the\nblowback they received (one resigning, the other serving two full…",
  "original_created_utc": 1611607616,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想知道政治气候的不同，导致尼克松被。\n诟病，但里根在保守派中的崇敬，因为他们都有一些漂亮的\n在他们的总统任期内，有许多令人震惊的丑闻，但他们之间的差异却很大。\n他们所受到的打击（一个辞职，另一个服满两...",
      "title": "水门事件的余波直接导致尼克松辞职，他的遗产也受到损害，然而里根不仅在政治上没有受到伊朗 -康特拉的影响，而且还被人们深深地记住。与尼克松相比，是什么因素导致他成为保守派的偶像？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想知道政治氣候的不同，導致尼克松被。\n詬病，但里根在保守派中的崇敬，因爲他們都有一些漂亮的\n在他們的總統任期內，有許多令人震驚的醜聞，但他們之間的差異卻很大。\n他們所受到的打擊（一個辭職，另一個服滿兩...",
      "title": "水門事件的餘波直接導致尼克松辭職，他的遺產也受到損害，然而里根不僅在政治上沒有受到伊朗 -康特拉的影響，而且還被人們深深地記住。與尼克松相比，是什麼因素導致他成爲保守派的偶像？"
    }
  ],
  "title": "The fallout from the Watergate scandal directly lead to Nixon's resignation and his legacy tarnished, yet Reagan emerged not only politically unscathed from Iran-Contra, but fondly remembered. What factors lead to his status as a conservative icon, in contrast with Nixon?",
  "created_utc": 1611626805,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;d like to know the differences in political climate that lead to Nixon being maligned but Reagan revered among conservatives, since both had some pretty damning scandals during their Presidencies, yet the discrepancy between the blowback they received (one resigning, the other serving two full terms and then having his party secure the Presidency for another term) is stark, considering they&#39;re only one decade apart from each other. Is it the absence of a smoking gun in Reagan&#39;s case? Changing media landscape? Also would like to know if there were any serious efforts to impeach Reagan for Iran-Contra.</p>\n</div><!-- SC_ON -->",
  "score": 4306,
  "permalink": "/r/AskHistorians/comments/l4x4nz/the_fallout_from_the_watergate_scandal_directly/",
  "subreddit": "AskHistorians",
  "id": "l4x4nz",
  "is_self": true,
  "media": null,
  "is_video": false
}