{
  "author": "Wabi-Sabibitch",
  "original_created_utc": 1645300680,
  "title": "An NFT project named Squiggles bought their own NFTs and then put it for a discount , making Millions",
  "created_utc": 1645360978,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;An NFT project named Squiggles came under a bad reputation after it was linked to a network of NFT scams. This resulted in their project&amp;#39;s hype almost dying just before the release of their NFT project (It later got removed from Open Sea). Yet after a few hours of release they still made about 7 million dollars. How does a project associated with NFT scam make 7 million dollars?&lt;/p&gt;\n\n&lt;p&gt;Looking close at those 7 million dollars. A lot of the buyers were brand new . I mean, there were so many that had never done anything on ether scan before. A series of shadow wallets all created by one person that was all buying tons of Squiggles. Millions of dollars worth of fake volume and then immediately flipping them on open sea for less money.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/aj4gj6wqhui81.png?width=1920&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9d8bd44803349f78092840e79a7068f15225c8fe\"&gt;https://preview.redd.it/aj4gj6wqhui81.png?width=1920&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9d8bd44803349f78092840e79a7068f15225c8fe&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/t29cy81shui81.png?width=1920&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9360c5cbf28912b9d0d826a9f2407648e0b429a4\"&gt;https://preview.redd.it/t29cy81shui81.png?width=1920&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=9360c5cbf28912b9d0d826a9f2407648e0b429a4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;A single account, that spent 800 Ethereum, which is over 2 million dollars spread across two transactions, that created hundreds of new wallets .Each of these shadow wallets, then bought three squiggles a piece and immediately listed them on open sea for less money.&lt;/p&gt;\n\n&lt;p&gt;You might be wondering why do this? Why buy two million dollars worth of squiggles only to sell them for less? Well, the only reason that makes sense to me is they were trying to give the illusion of huge interest to get people to buy in to make people think this had a lot of trading volume , a lot of hype. The only people who could possibly want to do that is of course the team behind squiggles.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/swign1/an_nft_project_named_squiggles_bought_their_own/",
  "subreddit": "CryptoCurrency",
  "id": "swign1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "An NFT project named Squiggles came under a bad reputation after it was linked\nto a network of NFT scams. This resulted in their project's hype almost dying\njust before the release of their NFT project (It later got removed from Open\nSea). Yet after a few hours of release they still made about 7…"
}