{
  "author": "jfkskw",
  "original_created_utc": 1651046696,
  "title": "Is music becoming more crass or am I just getting old and bitter?",
  "created_utc": 1651057231,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im 22f and at work we have a radio that is always on and turned to the top hits. Sometimes it gets uncomfortable sitting in a room with my coworkers and hearing lyrics about doing it doggy style or songs with women moaning in the track, but these are the regular family radio stations and thats just what most of the music seems to be about now. I love a good raunchy song every now and then, but sometimes I want to go 10 minutes without hearing about sex acts and huge asses. Has popular music always been this way?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/ucyg9j/is_music_becoming_more_crass_or_am_i_just_getting/",
  "subreddit": "TooAfraidToAsk",
  "id": "ucyg9j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Im 22f and at work we have a radio that is always on and turned to the top hits.\nSometimes it gets uncomfortable sitting in a room with my coworkers and hearing\nlyrics about doing it doggy style or songs with women moaning in the track, but\nthese are the regular family radio stations and thats just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は22歳ですが、仕事場には常にラジオがあり、トップヒット曲に合わせています。\n時々、同僚と一緒に部屋に座って、後背位や女性の喘ぎ声が入った曲の歌詞を聞くのが不快になることがあります。\nをする歌詞や、女性がうめき声を上げている曲を聞くのは、不快に感じることもあります。\nこれらは普通の家庭用ラジオ局で、ただ...。",
      "title": "音楽がガサツになっているのか、私が年をとって苦しくなっただけなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我22岁，在工作中，我们有一个收音机，总是开着，并打开到最热门的歌曲。\n有时，我和同事们坐在一个房间里，听到有关狗仔式做爱的歌词或歌曲中的女性呻吟，会感到很不舒服。\n有时，当我和同事们坐在房间里，听到有关狗仔式的歌词或有女性呻吟的歌曲时，会感到不舒服。\n这些都是常规的家庭广播电台，这只是...",
      "title": "是音乐变得越来越粗俗，还是我变老了、变苦了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我22歲，在工作中，我們有一個收音機，總是開着，並打開到最熱門的歌曲。\n有時，我和同事們坐在一個房間裏，聽到有關狗仔式做愛的歌詞或歌曲中的女性呻吟，會感到很不舒服。\n有時，當我和同事們坐在房間裏，聽到有關狗仔式的歌詞或有女性呻吟的歌曲時，會感到不舒服。\n這些都是常規的家庭廣播電臺，這只是...",
      "title": "是音樂變得越來越粗俗，還是我變老了、變苦了？"
    }
  ]
}