{
  "author": "plokijar",
  "original_created_utc": 1630773743,
  "title": "Tell me about that one coin you are very excited and passionate about and I will research it and tell you my honest opinion on it",
  "created_utc": 1630783910,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was thinking about researching a bunch of random coins just to expand my knowledge on the space, as well as the potential to finding some gems out there. The idea hit me that I should ask reddit what their favorite coins are. To make it that I actually do the research, ill try my best to research each coin in the comments and give my thoughts on them. I will not however research any shitcoins, meme coins, food coins, or anything that looks like a blatant scam! Now please tell all about your favorite coins!</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: It will take a while, but I will do my best to reply to each and every comment :)</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/phuyk6/tell_me_about_that_one_coin_you_are_very_excited/",
  "subreddit": "CryptoCurrency",
  "id": "phuyk6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was thinking about researching a bunch of random coins just to expand my\nknowledge on the space, as well as the potential to finding some gems out there.\nThe idea hit me that I should ask reddit what their favorite coins are. To make\nit that I actually do the research, ill try my best to research…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、宇宙に関する知識を深めるために、たくさんのランダムなコインを調査しようと考えていました。\nこの分野の知識を深めるためにも、また、そこにある宝石を見つける可能性を高めるためにも。\nそこで思いついたのが、redditにお気に入りのコインを聞いてみようということでした。そうすれば\n実際に調べてみようと思って、頑張って調べてみると...。",
      "title": "あなたが非常に興奮し、情熱を持っているその1枚のコインについて教えてください、私はそれを調査し、そのコインについての私の正直な意見を教えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在考虑研究一堆随机的硬币，以扩大我在这个领域的知识。\n的知识，以及有可能在那里找到一些宝石。\n我突然想到，我应该问问reddit他们最喜欢的硬币是什么。为了使\n为了让我真正做研究，我尽力去研究......",
      "title": "告诉我你非常兴奋和热衷的那枚硬币，我会研究它并告诉你我对它的真实看法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在考慮研究一堆隨機的硬幣，以擴大我在這個領域的知識。\n的知識，以及有可能在那裏找到一些寶石。\n我突然想到，我應該問問reddit他們最喜歡的硬幣是什麼。爲了使\n爲了讓我真正做研究，我盡力去研究......",
      "title": "告訴我你非常興奮和熱衷的那枚硬幣，我會研究它並告訴你我對它的真實看法。"
    }
  ]
}