{
  "author": "sybar142857",
  "the_new_excerpt": "So if all we need to do is throw money into VT and chill, then every financial\nnews channel is useless. All those talking heads have no idea what they're\ntalking about. Cramer is just a confident idiot trying to see patterns in\nstatic. Cathie Wood and Bill Ackman are charismatic charlatans trying to…",
  "original_created_utc": 1623828604,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、VTにお金を投入して冷やせばいいのであれば、すべての金融機関の\nニュースチャンネルは役に立たない。話題の人たちは皆、自分が何を言っているのか分かっていません。\n話をしています。クレーマーは自信満々のバカで、静物にパターンを見ようとしているだけ。\n静止画です。キャシー・ウッドとビル・アックマンは、カリスマ的なカリスマであり、...",
      "title": "このサブは私の頭を悩ませています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，如果我们需要做的就是把钱扔进VT，然后冷静下来，那么每个金融\n新闻频道都是无用的。所有这些谈话者都不知道他们在\n在说什么。Cramer只是一个自信的白痴，试图从静态中看到模式。\n静态。凯西-伍德和比尔-阿克曼是有魅力的江湖骗子，试图...",
      "title": "这部电影让我头晕目眩"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，如果我們需要做的就是把錢扔進VT，然後冷靜下來，那麼每個金融\n新聞頻道都是無用的。所有這些談話者都不知道他們在\n在說什麼。Cramer只是一個自信的白癡，試圖從靜態中看到模式。\n靜態。凱西-伍德和比爾-阿克曼是有魅力的江湖騙子，試圖...",
      "title": "這部電影讓我頭暈目眩"
    }
  ],
  "title": "This sub has left my head spinning",
  "created_utc": 1623835640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So if all we need to do is throw money into VT and chill, then every financial news channel is useless. All those talking heads have no idea what they&#39;re talking about. Cramer is just a confident idiot trying to see patterns in static. Cathie Wood and Bill Ackman are charismatic charlatans trying to fool investors into thinking they know what they&#39;re doing. </p>\n\n<p>If the golden rule is to keep investing in VT and &quot;never peek&quot; as Bogle mentioned, Robinhood is a crime against humanity. It&#39;s on par with the advent of heroin in terms of its devastating impact on human well-being. The addictive gamification of trading that Robinhood has brought us will be the downfall of millions. </p>\n\n<p>But it goes further than that doesn&#39;t it? Because even with measured studying and technical analysis and 10k reports, I&#39;m still powerless against the noise in the market. Buffet&#39;s million dollar bet further drives home the point that not even hedge fund managers can beat the S&amp;P over a decade. So does that mean Wall Street itself is a lie? Are the thousands of analysts/fund managers unknowingly acting out a casino&#39;s interaction with gamblers to each other? Some win, many more lose but no one realizes that the winners are chosen completely at random? </p>\n\n<p>How is all this still continuing?</p>\n</div><!-- SC_ON -->",
  "score": 261,
  "permalink": "/r/Bogleheads/comments/o0za0w/this_sub_has_left_my_head_spinning/",
  "subreddit": "Bogleheads",
  "id": "o0za0w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741233
}