{
  "author": "10RealDeal10",
  "original_created_utc": 1638088653,
  "title": "Which altcoins should survive the bear market?",
  "created_utc": 1638106248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve read a lot of comments here stating that once the bear market comes, many altcoins will not survive. I think a rather common belief is that around 80% will either disappear entirely, or their price will never recover to the current/previous ATH levels. Personally, I have my doubts about this number being that high, but I am just a newbie trying to learn things, so what do I know? And that&#39;s beside the point of this post anyway. </p>\n\n<p>In this post I want us to discuss &quot;the other 20%&quot;. So, what coins, do you think, will survive the next bear market <strong>and will thrive</strong> during the next bull. If you could provide some reasoning, instead of just throwing some names or just shilling your favorite alts, that would be much appreciated! </p>\n\n<p>P.S. Just to clarify, I understand, ETH is technically an altcoin, but it&#39;s pretty safe to think, that it&#39;s grown so much it&#39;s, by far, the safest altcoin to survive the bear. Saying this before I get plenty of &quot;ETH&quot; comments, as I would kind of like the focus to be on other altcoins.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/r3zrpi/which_altcoins_should_survive_the_bear_market/",
  "subreddit": "CryptoCurrency",
  "id": "r3zrpi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've read a lot of comments here stating that once the bear market comes, many\naltcoins will not survive. I think a rather common belief is that around 80%\nwill either disappear entirely, or their price will never recover to the\ncurrent/previous ATH levels. Personally, I have my doubts about this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はここで多くのコメントを読みましたが、ベアマーケットが来ると、多くの人が\n多くのアルトコインは生き残れないというコメントを読んだことがあります。わりと一般的な意見としては、約80％のアルトコインが完全に消滅するか\n完全に消滅するか、価格が現在/過去のATHレベルに回復することはないだろう、というのが割と一般的な見方だと思います。\nわりと一般的な考えだと思います。個人的には、これには疑問がありますが...。",
      "title": "弱気な市場で生き残るべきアルトコインは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到很多评论说，一旦熊市来临，许多\n币将无法生存。我认为一个相当普遍的看法是，大约80%的\n会完全消失，或者他们的价格将永远不会恢复到\n目前/以前的ATH水平。就我个人而言，我对这一点表示怀疑...",
      "title": "哪些altcoins应该在熊市中生存？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到很多評論說，一旦熊市來臨，許多\n幣將無法生存。我認爲一個相當普遍的看法是，大約80%的\n會完全消失，或者他們的價格將永遠不會恢復到\n目前/以前的ATH水平。就我個人而言，我對這一點表示懷疑...",
      "title": "哪些altcoins應該在熊市中生存？"
    }
  ]
}