{
  "author": "imadumbshit69",
  "original_created_utc": 1626057380,
  "title": "Politicians probably aren't fond of crypto because we could track where our taxes go.",
  "created_utc": 1626067840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is just a thought, I&#39;m not saying I am correct at all. </p>\n\n<p>But politicians probably aren&#39;t (or won&#39;t be) keen on adopting crypto because all transactions can be tracked. If we pay taxes in crypto, we can see exactly where it goes. And the government (referring to American) obviously isn&#39;t very transparent nor do they want to be. </p>\n\n<p>Seeing where our taxes go exactly will be liberating. But, obviously, there are some issues. Like lobbying, donations to politicians, etc. </p>\n\n<p>But who knows, maybe it will be a step in the right direction.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/oii8mb/politicians_probably_arent_fond_of_crypto_because/",
  "subreddit": "CryptoCurrency",
  "id": "oii8mb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is just a thought, I'm not saying I am correct at all.\n\nBut politicians probably aren't (or won't be) keen on adopting crypto because\nall transactions can be tracked. If we pay taxes in crypto, we can see exactly\nwhere it goes. And the government (referring to American) obviously isn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは単なる思いつきで、私が正しいとはまったく言っていません。\n\nしかし、政治家はおそらく暗号を採用することに熱心ではない（あるいは今後もそうするだろう）。\nすべての取引が追跡可能だからです。暗号で税金を払えば、それがどこに行くのか正確にわかります。\nどこに行くのかがわかります。そして、政府（アメリカを指す）は明らかに...",
      "title": "政治家はおそらく暗号を好まないでしょう。なぜなら、私たちの税金がどこに行くのかを追跡できるからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这只是一个想法，我并不是说我完全正确。\n\n但政客们可能并不（或不会）热衷于采用加密货币，因为\n所有的交易都可以被追踪到。如果我们用加密货币交税，我们可以清楚地看到\n它的去向。而政府（指美国）显然不...",
      "title": "政治家们可能不喜欢加密货币，因为我们可以追踪我们的税收去向。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這只是一個想法，我並不是說我完全正確。\n\n但政客們可能並不（或不會）熱衷於採用加密貨幣，因爲\n所有的交易都可以被追蹤到。如果我們用加密貨幣交稅，我們可以清楚地看到\n它的去向。而政府（指美國）顯然不...",
      "title": "政治家們可能不喜歡加密貨幣，因爲我們可以追蹤我們的稅收去向。"
    }
  ]
}