{
  "author": "Drippymf",
  "original_created_utc": 1635836033,
  "title": "Why do my parents pull a ‘you’re living on our money, under our roof’ and ‘do it when you have your own place’ whenever i dont agree with them?",
  "created_utc": 1635845496,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m 15. They cancelled our Netflix subscription, i cant buy more than 2 books in a month, I’m not allowed to wear clothes of my choice or date. Social media is prohibited as well, i cant hang out with my friends more than once a month. I dont have a phone either. We are an upper middle class family so its not like money is an issue. Also, I get good grades. I feel guilty whenever i ask for something, be it a novel or new clothes. And then there’s my mother who goes shopping every week and watches shows on her preferred streaming platforms. It’s maddening</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/TooAfraidToAsk/comments/qkyhjf/why_do_my_parents_pull_a_youre_living_on_our/",
  "subreddit": "TooAfraidToAsk",
  "id": "qkyhjf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m 15. They cancelled our Netflix subscription, i cant buy more than 2 books in\na month, I’m not allowed to wear clothes of my choice or date. Social media is\nprohibited as well, i cant hang out with my friends more than once a month. I\ndont have a phone either. We are an upper middle class family…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は15歳です。Netflixの契約を解除されたり、1ヶ月に2冊以上の本を買ってはいけなかったり\n自分の好きな服を着ることも、デートすることも許されません。ソーシャルメディアは\nソーシャルメディアも禁止されていて、月に1回以上、友達と遊ぶこともできません。I\n携帯電話も持っていません。私たちは中流階級の家庭です。",
      "title": "なぜ私の両親は、私の意見が通らないと、「お前は私たちのお金で、私たちの屋根の下で暮らしている」「自分の家を持ってからやれ」と言うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我15岁了。他们取消了我们的Netflix订阅，我不能在一个月内买超过两本书。\n我不能在一个月内买超过两本书，我不能穿我自己选择的衣服或约会。社交媒体也被\n也被禁止，我不能和我的朋友们一起玩超过一个月的时间。I\n也没有电话。我们是一个中上阶层的家庭...",
      "title": "为什么每当我不同意他们的观点时，我的父母就会说 \"你靠我们的钱生活，在我们的屋檐下 \"和 \"等你有了自己的地方再做\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我15歲了。他們取消了我們的Netflix訂閱，我不能在一個月內買超過兩本書。\n我不能在一個月內買超過兩本書，我不能穿我自己選擇的衣服或約會。社交媒體也被\n也被禁止，我不能和我的朋友們一起玩超過一個月的時間。I\n也沒有電話。我們是一箇中上階層的家庭...",
      "title": "爲什麼每當我不同意他們的觀點時，我的父母就會說 \"你靠我們的錢生活，在我們的屋檐下 \"和 \"等你有了自己的地方再做\"？"
    }
  ]
}