{
  "author": "Many_Arm7466",
  "original_created_utc": 1626921788,
  "title": "I’m proud of you...",
  "created_utc": 1626928306,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For whoever needs to hear this: I am proud of you. I am proud of you for making the conscious effort to invest in a better life for your future self. I am proud of you for educating yourselves on Crypto and the technology behind it and being part of the revolution that will change the world. I am proud of you for shouldering risk by participating in such a volatile movement. I am proud of you for stomaching through a 50+% crash and continuing to hold, DCA, or stake your holdings. And most importantly I am proud of you for keeping your head up high during these uncertain times and looking long term at the brighter days ahead! And I know your future self will be proud of you too keep doing what you’re doing ☺️</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/op4zzz/im_proud_of_you/",
  "subreddit": "CryptoCurrency",
  "id": "op4zzz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For whoever needs to hear this: I am proud of you. I am proud of you for making\nthe conscious effort to invest in a better life for your future self. I am proud\nof you for educating yourselves on Crypto and the technology behind it and being\npart of the revolution that will change the world. I am…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "必要としている人には、これを聞いてほしい。私はあなたを誇りに思います。意識的に努力しているあなたを誇りに思います\n未来の自分のために、より良い人生を送るための投資を意識的に行っていることを誇りに思います。私はあなたを誇りに思います。\n暗号とその背後にある技術について学び、世界を変える革命の一端を担っていることを誇りに思います。\n世界を変える革命の一端を担っていることを誇りに思います。私は...",
      "title": "あなたを誇りに思います・・・。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不管是谁需要听到这个消息。我为你感到骄傲。我为你感到骄傲，因为你做出了\n有意识地努力为你未来的自己投资更好的生活。我很自豪\n我为你们教育自己了解加密货币及其背后的技术并成为将改变世界的革命的一部分而感到骄傲。\n革命的一部分，这将改变世界。我是...",
      "title": "我为你感到骄傲..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不管是誰需要聽到這個消息。我爲你感到驕傲。我爲你感到驕傲，因爲你做出了\n有意識地努力爲你未來的自己投資更好的生活。我很自豪\n我爲你們教育自己瞭解加密貨幣及其背後的技術併成爲將改變世界的革命的一部分而感到驕傲。\n革命的一部分，這將改變世界。我是...",
      "title": "我爲你感到驕傲..."
    }
  ]
}