{
  "author": "JoeWelburg",
  "the_new_excerpt": "Did everyone forget what happened in Thursday? That was a calculated effort to\nbring down our position. FUCK OFF BILLIONAIRS, well still take you fucking\nmoney; who do you think will fund our food stamps?\n\nWe didn’t “lose” because we made a bad call, we “lost” because we made the RIGHT\ncall and this…",
  "original_created_utc": 1612305252,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家都忘了周四发生了什么吗？那是一场精心策划的努力\n使我们的地位下降。去你妈的亿万富翁，好吧，还是带你他妈的。\n钱；你认为谁会资助我们的食品券？\n\n我们没有 \"输\"，因为我们做了一个错误的决定，我们 \"输\"，因为我们做了正确的。\n呼叫和这个...",
      "title": "为什么我们他妈的表现得像输了一样？我们让GME从4涨到400，联合交易平台沉默和作弊才把它涨到90。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家都忘了週四發生了什麼嗎？那是一場精心策劃的努力\n使我們的地位下降。去你媽的億萬富翁，好吧，還是帶你他媽的。\n錢；你認爲誰會資助我們的食品券？\n\n我們沒有 \"輸\"，因爲我們做了一個錯誤的決定，我們 \"輸\"，因爲我們做了正確的。\n呼叫和這個...",
      "title": "爲什麼我們他媽的表現得像輸了一樣？我們讓GME從4漲到400，聯合交易平臺沉默和作弊才把它漲到90。"
    }
  ],
  "title": "Why the fuck are we acting like we lost? We made GME go from 4 to 400 and it took combined trading platforms to silence and cheat to bring it to 90.",
  "created_utc": 1612320447,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Did everyone forget what happened in Thursday? That was a calculated effort to bring down our position. FUCK OFF BILLIONAIRS, well still take you fucking money; who do you think will fund our food stamps?</p>\n\n<p>We didn’t “lose” because we made a bad call, we “lost” because we made the RIGHT call and this disturbed  some folks at the top. </p>\n\n<p>I was reading 2 articles in Wall Street journal and it made my blood boil- first article was saying “random penny stock went up 30% with no news or announcement”- the people that are paid to predict and report and are the expert at stock market are saying this shit. The second article right after made me want to fuck the writers wife: “GME and AMC, Reddit favorite stocks, plunged after apparent loss in interest from retail investors” LOSS IN  INTEREST? MOTHERFUCKER WE CAN ONLY BUY 5 FUCKING SHARES EACH. </p>\n\n<p>WE LIKE THE STOCK. THOSE FUCKS JUST DON’T LET US BUY IT. How is GameStop and AMC and BB not already suing robinhood? Is any stock expert really gonna act like had they not restricted in Thursday, it would have went down that much? </p>\n\n<p>What the fuck is this gaslighting? That last week didn’t happen? Why are every news channel acting like they called GME or BB or AMC falling like it happened organically and not deliberately by everyone involved? </p>\n\n<p>Is GME worth 400$? FUCK NO. But since when was the stock market about actual worth? Stocks have become fiat currency in themself, doesn’t matter than company quarterly earnings, or its news, if people buy it, it goes up. When you restrict that- it goes down. </p>\n\n<p>We were up against billions of fund, trading platforms that we do not own or have a say in, our weapons, controlled by the enemy. Those fucks in TV acting like they actually called GME falling like this or acting like this is perfectly normal are trying to gaslight us about what happened in Thursday. </p>\n\n<p>FUCK THEM. We still got GME to go up and caused international fevor- we made the right call, we had the right stock, we had the right people, our enemies just had control of the only weapon we could use.</p>\n</div><!-- SC_ON -->",
  "score": 76977,
  "permalink": "/r/wallstreetbets/comments/lb8lwf/why_the_fuck_are_we_acting_like_we_lost_we_made/",
  "subreddit": "wallstreetbets",
  "id": "lb8lwf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518565573
}