{
  "author": "whatsmyname2u",
  "original_created_utc": 1631040203,
  "title": "It's crashing! Quick!! SELL!!!",
  "created_utc": 1631072033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sold! Phew, that was close, I am still in the green...  Wait, what? It&#39;s recovering! FALSE ALARM!! BUY IT BACK!!!   At MUCH MORE than I just sold it for a minute ago? YEAH, YEAH!   Bought!! I&#39;m now deep in the red, but it&#39;s due to shoot up now, right?!   WRONG!!! IT&#39;S CRASHING AGAIN, EVEN LOWER THIS TIME!! SELL IT, SELL IT ALL!!!  ok, done. I think it&#39;s time to exit crypto now...  Wait... It&#39;s... Stabilizing?!   I... I might have panicked... Should have waited... Should... Should I just put it all back?   All... THAT IS ALL I HAVE LEFT?!!!</p>\n</div><!-- SC_ON -->",
  "score": 243,
  "permalink": "/r/CryptoCurrency/comments/pjt5uu/its_crashing_quick_sell/",
  "subreddit": "CryptoCurrency",
  "id": "pjt5uu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sold! Phew, that was close, I am still in the green... Wait, what? It's\nrecovering! FALSE ALARM!! BUY IT BACK!!! At MUCH MORE than I just sold it for a\nminute ago? YEAH, YEAH! Bought!! I'm now deep in the red, but it's due to shoot\nup now, right?! WRONG!!! IT'S CRASHING AGAIN, EVEN LOWER THIS TIME!!…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "売れてます。ふぅ、惜しかったですね、まだ緑の中にいますよ...。待って、何？それは\n回復した！FALSE ALARM! 買い戻しだ!!! さっき売った値段よりはるかに高い値段で。\n1分前に？イェーイ、イェーイ！買った! 今は大赤字だけど、これから上がる予定だよ。\nこれから上がるよね？違った! また暴落して、今度はもっと下がるんじゃないか！？",
      "title": "クラッシュしました。クイック! 売ってくれ!!!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "售出! 呼，好险啊，我还在绿灯中...... 等等，什么？它正在\n正在恢复! 虚惊一场！! 把它买回来！！！。比我刚刚卖出的价格高得多。\n一分钟前？是的，是的! 买了! 我现在深陷亏损，但它是由于拍摄的\n涨，对吗？错了！！！它又崩溃了，这次甚至更低！......",
      "title": "它正在崩溃! 快！! 卖掉！！！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "售出! 呼，好險啊，我還在綠燈中...... 等等，什麼？它正在\n正在恢復! 虛驚一場！! 把它買回來！！！。比我剛剛賣出的價格高得多。\n一分鐘前？是的，是的! 買了! 我現在深陷虧損，但它是由於拍攝的\n漲，對嗎？錯了！！！它又崩潰了，這次甚至更低！......",
      "title": "它正在崩潰! 快！! 賣掉！！！"
    }
  ]
}