{
  "author": "IntroductionHonest10",
  "original_created_utc": 1637569468,
  "title": "From a Manager - this sub has changed my company",
  "created_utc": 1637633245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Throw away because I don’t want this linked to my main account which includes work related posts.</p>\n\n<p>I’m a senior manager at small firm (under 30 staff). During covid, our revenue skyrocketed as we were all able to work from home in a high demand industry. My boss, the business owner asked for my input in how we reward the team - he was thinking a team activity or Xmas bonus.  </p>\n\n<p>This sub has really made me question why we spend so much of our life working just to get by, so I put together a proposal - let’s work less and give everyone more space in their personal life. </p>\n\n<p>My proposal was:</p>\n\n<ul>\n<li><p>to provide a permanent pay increase of 10% to all staff. </p></li>\n<li><p>give an extra 5 days off per year (I come from a country where 4 weeks is standard, so this increased to 5 weeks total).</p></li>\n<li><p>make Monday an optional work day. Finish all your work from last week? Great, don’t come in. The week officially begins on Tuesday and that’s when we meet together. Feeling a little behind? Your Monday is for you to catch up from home, and you don’t have to meet or work with anyone else. </p></li>\n</ul>\n\n<p>The proposal was accepted 4 months ago, and all I can say is wowwww - what a difference it’s made to the team happiness, with no decline in revenue. </p>\n\n<p>It’s a fairly different story to what is posted here usually, but I wanted to share it, as without this sub I would never have thought to suggest such a thing.</p>\n</div><!-- SC_ON -->",
  "score": 75446,
  "permalink": "/r/antiwork/comments/qzgqnr/from_a_manager_this_sub_has_changed_my_company/",
  "subreddit": "antiwork",
  "id": "qzgqnr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Throw away because I don’t want this linked to my main account which includes\nwork related posts.\n\nI’m a senior manager at small firm (under 30 staff). During covid, our revenue\nskyrocketed as we were all able to work from home in a high demand industry. My\nboss, the business owner asked for my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仕事関連の投稿を含むメインアカウントにリンクさせたくないので、捨てます。\n仕事関連の投稿を含むメインアカウントにリンクさせたくないので捨てます。\n\n私は小さな会社（スタッフ数30名以下）のシニアマネージャーです。covidを使っている間、私たちの収益は急上昇しました。\n需要の高い業界で在宅勤務が可能になったため、収益が急増しました。私の\n私の上司である経営者は、私のことを尋ねました。",
      "title": "経営者の声 - このサブ機が私の会社を変えた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扔掉，因为我不想让它与我的主账户相连，因为我的主账户包括与工作有关的帖子。\n工作相关的帖子。\n\n我是一家小公司的高级经理（30人以下）。在Covid期间，我们的收入\n我们的收入猛增，因为我们都能在一个高需求的行业中在家工作。我的老板\n我的老板，即企业主要求我...",
      "title": "来自一位经理的信息--这个子改变了我的公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扔掉，因爲我不想讓它與我的主賬戶相連，因爲我的主賬戶包括與工作有關的帖子。\n工作相關的帖子。\n\n我是一家小公司的高級經理（30人以下）。在Covid期間，我們的收入\n我們的收入猛增，因爲我們都能在一個高需求的行業中在家工作。我的老闆\n我的老闆，即企業主要求我...",
      "title": "來自一位經理的信息--這個子改變了我的公司"
    }
  ]
}