{
  "author": "JM1210",
  "the_new_excerpt": "Note this is NOT a dig at mods, nor an invitation for commenters to be rude\nabout mods.\n\nIt seems most of the time on Reddit there are mods who are always there to tidy\nthe forums up tirelessly. It must take so much time and effort, I can understand\nsay volunteering for a charity a few days a week,…",
  "original_created_utc": 1616844473,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "请注意，这不是在挖苦版主，也不是邀请评论者无礼。\n关于版主。\n\n似乎大多数时候在Reddit上都有版主，他们总是在那里整理\n孜孜不倦地把论坛做起来。一定要花很多时间和精力，我能理解\n比如说每周为慈善机构做几天志愿者，... ...",
      "title": "像Reddit这样的网站的版主为什么要花这么大的力气去做一个自愿的、相当吃力的角色呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請注意，這不是在挖苦版主，也不是邀請評論者無禮。\n關於版主。\n\n似乎大多數時候在Reddit上都有版主，他們總是在那裏整理\n孜孜不倦地把論壇做起來。一定要花很多時間和精力，我能理解\n比如說每週爲慈善機構做幾天志願者，... ...",
      "title": "像Reddit這樣的網站的版主爲什麼要花這麼大的力氣去做一個自願的、相當喫力的角色呢？"
    }
  ],
  "title": "Why do moderators on websites like Reddit bother to put so much effort into a voluntary, pretty thankless role?",
  "created_utc": 1616852454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Note this is NOT a dig at mods, nor an invitation for commenters to be rude about mods.</p>\n\n<p>It seems most of the time on Reddit there are mods who are always there to tidy the forums up tirelessly. It must take so much time and effort, I can understand say volunteering for a charity a few days a week, but if it’s unpaid and so many people disrespect mods, I don’t know how they keep it up, day in day out. I assume they’ll be doing it when they’re home from\nwork, but even then I couldn’t imagine the incentive to deal with the tedium of the role instead of watching Netflix or something. Maybe I wouldn’t ask if it took longer for violations to get corrected but it seems like these forums are being watched like they’re being paid to do it.</p>\n\n<p>Edit: I’ll consider this answered thanks to NerdFerby’s answer which essentially is it really is as simple as they enjoy it. I personally can’t empathise with that position but if that’s what they enjoy doing then fair enough.</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/mebyt4/why_do_moderators_on_websites_like_reddit_bother/",
  "subreddit": "NoStupidQuestions",
  "id": "mebyt4",
  "is_self": true,
  "media": null,
  "is_video": false
}