{
  "author": "Tredur",
  "original_created_utc": 1637864551,
  "title": "20 play-to-earn blockchain games that really earn crypto rewards!",
  "created_utc": 1637883049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My fellow crypto enthusiasts: </p>\n\n<p>The following list is one I have compiled after playing Crypto Royale for the first time, realizing how big the future of blockchain gaming is going to be.  Most of these games are games that you can have your kids to play for you (if you have them,)  ... some of them are violent, though, so keep in mind that not all of these games are suitable for children, and I&#39;d bet that the chat in any of these games is probably not suitable for children. </p>\n\n<p>Also - only one of these games incurs an up-front cost.</p>\n\n<p>Without any further ado- here&#39;s to hoping that we can all find something to do while bored.</p>\n\n<p><a href=\"https://coinhunt.world/\">https://coinhunt.world</a> – <em>Coin Hunt World</em> - “Coin Hunt World is a mobile game that lets you earn crypto while exploring your neighborhood. Discover keys and unlock rewards. Play individually or with a team!” (Available on Andriod, currently invite-only beta in iOS.)</p>\n\n<p><a href=\"https://idlecyber.com/\">https://www.idlecyber.com</a> – <em>Idle Cyber</em> - “A P2E model idle game. Huge content with unlimited levels and PvP mode, the game is a new kind of frontier defense and RPG.”</p>\n\n<p><a href=\"https://axieinfinity.com/\">https://axieinfinity.com</a> – <em>Axie Infinity</em> - Pokemon style game with missions, adventure mode and PvP.  A trusted big name in P2E gaming.</p>\n\n<p><a href=\"https://metawars.gg/\">https://metawars.gg</a> – <em>Meta Wars</em> - “A futuristic sci-fi game following a multiplayer strategy.”  </p>\n\n<p><a href=\"https://splinterlands.com/\">https://splinterlands.com</a> – <em>Splinterlands</em> - “Trading game where players build a collection of playable Monsters &amp; Summoners.” ($10 up-front to unlock the full version of the game.)</p>\n\n<p><a href=\"https://www.sandbox.game/en/\">https://www.sandbox.game/en/</a> - <em>The Sandbox 3D</em> - “A blockchain-based version of Roblox or Minecraft. … Falling in the category of games for players, this platform also allows you to develop and play your own game.”</p>\n\n<p><a href=\"https://godsunchained.com/\">https://godsunchained.com</a> – <em>Gods Unchained</em> - “This unique game is well-known for merging various NFT components with a typical card trading game.”</p>\n\n<p><a href=\"http://www.sorare.com/\">www.sorare.com</a> – <em>Sorare</em> - “This soccer game lets players sell, buy, manage, and trade a virtual team with the help of Digital Player Cards.”</p>\n\n<p><a href=\"https://lightnite.io/\">https://lightnite.io</a> – Lightnite - “...falls into the category of Fortnite-like online multiplayer games or battle royale games.“</p>\n\n<p><a href=\"https://www.staratlas.com/\">https://staratlas.com</a> – <em>Star Atlas</em> - “A grand strategy game of space exploration, territorial conquest, political domination, and more.”</p>\n\n<p><a href=\"https://aavegotchi.com/\">https://aavegotchi.com/</a> - <em>Aavegotchi</em> – Basically a Tamagotchi (or digital pet,) from which you can earn crypto. More a participating game than a competitive game.</p>\n\n<p><a href=\"https://mcp3d.com/\">https://mcp3d.com</a> – <em>MegaCryptoPolis</em> - “This game combines quite a lot of different stuff – not only is it a virtual economy simulation that requires users to focus on management, it also features NFTs as resources owned by the player.”</p>\n\n<p><a href=\"https://crazydefenseheroes.com/\">https://crazydefenseheroes.com</a> – <em>Crazy Defense Heroes –</em> Tower defense game where you can play to earn a share of monthly distribution through earning exp.</p>\n\n<p><a href=\"https://blankos.com/\">https://blankos.com</a> – <em>Blankos</em> - “ it’s perhaps the closest to an AAA game we’ve seen from the NFT and crypto world. Users buy collect and outfit their Blankos before playing in various party games and competitions with them, of course for a reward in the form of more NFT drops or just straight up crypto.”</p>\n\n<p><a href=\"https://revvracing.com/\">https://revvracing.com</a> – <em>Revv Racing –</em> Play to earn racing game.</p>\n\n<p><a href=\"https://cryptokitties.co/\">https://cryptokitties.co</a> – <em>Crypto Kitties –</em> Collect and breed digital cats.  “CryptoKitties is a game centered around breedable, collectible, and oh-so-adorable creatures we call CryptoKitties!”</p>\n\n<p><a href=\"https://alienworlds.io/\">https://alienworlds.io</a> – <em>Alien Worlds</em> - “Your task is to discover new planets.”</p>\n\n<p><a href=\"https://cryptosnake.game/\">https://cryptosnake.game</a> – <em>Crypto Snake –</em> Snake, but profitable!</p>\n\n<p><a href=\"https://goldfever.io/\">https://goldfever.io</a> – <em>Gold Fever</em> - “Gold Fever is a challenging free-to-play survival RPG hybrid that leverages the power of the blockchain to create a decentralised economy around its limited resources and various NFT items.”</p>\n\n<p><a href=\"https://battleracers.io/\">https://battleracers.io</a> – <em>Battle Racers -</em> “Mix and match different parts and weapons to create your perfect Battle Racer. Race! Use your combat skills to beat other players to the finish line.”</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/r22w8n/20_playtoearn_blockchain_games_that_really_earn/",
  "subreddit": "CryptoCurrency",
  "id": "r22w8n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My fellow crypto enthusiasts:\n\nThe following list is one I have compiled after playing Crypto Royale for the\nfirst time, realizing how big the future of blockchain gaming is going to be.\nMost of these games are games that you can have your kids to play for you (if\nyou have them,) ... some of them…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号愛好家の皆さん。\n\n以下のリストは、Crypto Royaleを初めてプレイした後、ブロックチェーンゲームの未来がいかに大きいかを実感してまとめたものです。\nブロックチェーンゲームの未来がどれほど大きなものになるかを実感しました。\nこれらのゲームのほとんどは、子供たちに遊んでもらうことができるゲームです（子供がいればですが）。\n子供がいれば）......中には......。",
      "title": "本当にクリプト報酬を得られる20のプレイ・トゥ・イヤー型ブロックチェーンゲーム!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的加密货币爱好者朋友们。\n\n以下清单是我在第一次玩 \"大逃杀 \"后编制的。\n第一次玩Crypto Royale，意识到区块链游戏的未来会有多大。\n这些游戏中的大多数是你可以让你的孩子为你玩的游戏（如果\n你有他们，）......其中一些......",
      "title": "20个真正能赚取加密货币奖励的区块链游戏!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的加密貨幣愛好者朋友們。\n\n以下清單是我在第一次玩 \"大逃殺 \"後編制的。\n第一次玩Crypto Royale，意識到區塊鏈遊戲的未來會有多大。\n這些遊戲中的大多數是你可以讓你的孩子爲你玩的遊戲（如果\n你有他們，）......其中一些......",
      "title": "20個真正能賺取加密貨幣獎勵的區塊鏈遊戲!"
    }
  ]
}