{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "As if there weren’t enough posts on this subreddit about Tesla already I’ve decided to make another. I’d like to start with something that will become obvious later in this post: I’m bullish on the company and own the stock. \n \nI think we as investors are extremely lucky to have mediums like Reddit &amp; Twitter to help with our investment decisions. Not only do we have instant access to information, but we also have instant access to discussions regarding that information. I’ve noticed that throughout these posts it seems that the default position is that Tesla is overvalued. The biggest problem I have with this is that many will dismiss Tesla as a bubble and overvalued without digging into the company themselves. \n\nI want to make one thing clear with my post: I’m not saying that you can’t be bearish on Tesla. Nor am I saying that you aren’t allowed to think that it’s overvalued. I agree, there is growth priced into the stock and the company needs to execute to grow into its valuation. What I am trying to argue is that there isn’t nearly as much growth priced in as most think and you’re doing yourself a disservice by not looking into the company. \n \nLet’s start with some of the most common arguments people use to claim that Tesla is overvalued.  \n \n“The PE Ratio”\n \nThe price-earnings ratio is a very common metric to value companies. This makes perfect sense as it’s the price you pay for a stock divided by the actual earnings per share. Now, I’m going to say something that many of you probably won’t like: Tesla’s PE ratio is an extremely bullish indicator. \n \nWhen you compare 12/31/2020 vs 12/31/2021 you have the PE ratio declining 69% from 1,102.61 to 340.90. Why is this significant? \n \n1. Tesla reduced their PE by 69% while simultaneously increasing the stock price by 50%\n1. The earnings growth of 384% (0.64 vs 3.10) doesn’t include Q4 2021 (2021’s Q3 TTM is used as the Q4 report isn’t out till later this month)\n * If you assume that Q4 EPS will be ~2.5 then the PE ratio drops to under 200 with EPS growth over 700%! \n * If you annualized that Q4 EPS and assumed no growth throughout 2022 in both the stock price and earnings, then you’d end 2022 with a PE of 105.\n \nMany will argue that a PE of 105 is still massively overvalued, but I’m more interested in the &gt;700% earnings growth. Considering Tesla is still (somehow) ramping their Fremont &amp; Shanghai factories and has two more massive factories in Austin &amp; Berlin coming online sometime this year, I have a hard time believing that their EPS won’t continue to climb.  \n \nThat’s why, to me, their PE is an “extremely bullish indicator”. PE shouldn’t be used in isolation, so when you find out that a company has decreased their PE by 69% while increasing their stock price by 50% during a chip shortage, I think a little more digging is required (i.e., forecasting forward 5 years and then discounting back). Do you really think the best way to value a company growing earnings &gt;100% is a TTM ratio?  \n\n“The market cap is larger than all other automakers combined” \n \nLook at their [profit per vehicle](https://twitter.com/forwardcap/status/1464961280138174466?s=20) and then compare that to what the legacy auto industry is doing. I don’t think value by comparisons provides much merit especially when you consider the fact that what’s happening to the auto industry is a two-part disruption:\n \n1. Electric vehicles \n1. Autonomous vehicles  \n \nYou can agree/disagree with the two-part disruption and that’s valid (I’ll talk about both in isolation below), but if you agree that the industry is being disrupted then it doesn’t really make much sense to compare the new with the old. \n \n**Electric vehicle disruption** \n \nIf you still aren’t sold on the fact that electric vehicles are the future of the auto industry, I’m not entirely sure what I can say. \n \n* They’re better for consumers: easier to maintain, more reliable, better performance/price, better technology, and the total cost of ownership is lower (lifetime of the vehicle)\n* They’re better for manufacturers: simplistic design is easier to produce which lowers costs (spicy margins) \n* They’re much better for the environment\n \nThis is usually when another common bear thesis comes into play: \n \n“The competition is coming” \n \nThe biggest problem I have with this bear thesis is it entirely misses the point. The competition isn’t coming it’s always existed. Tesla isn’t competing against Lucid/Rivian/Mach-e/etc. Tesla/Lucid/Rivian/Mach-e/etc are competing against ICE. Electric vehicles are still a tiny percentage of the overall auto market today with 100% being their future. There is still plenty of room for other players to exist in the same space. \n \nBut there are people who will buy a Mach-e over a Model Y, so Tesla is losing market share, right? The problem with this is it ignores the extremely long waitlist that Tesla must deal with and the fact that they literally sell every vehicle they make. If you don’t buy a Tesla and instead go with a Mach-e, someone else is buying that Tesla. Tesla’s market share in the electric vehicle space will go down but it’s irrelevant as market share in the total vehicle space will increase. \n \nThe disruption is very simple: any company that makes a compelling electric vehicle for an attainable price will sell every vehicle they make.   \n \nSide note: There is also almost a default assumption that legacy autos will be able to ramp as quickly and even surpass Tesla which I find a tad absurd. I’m not saying it isn’t possible, but people are seriously underestimating and underappreciating Tesla’s growth. Their current run rate is already over a million vehicles per year and they’re guiding for 50% growth out till 2030. No other manufacturer has guidance that even comes close (even if they say they’ll be leaders by 2025). \n \n**Autonomous vehicle disruption** \n \nThis is where I’m sure a lot of you will roll your eyes. Honestly, I think that’s fine. Autonomy is a new technology that has never scaled nor proven to work in all situations and weather conditions. I don’t have robotaxi‘s in my model and I’m not saying you should either. The main point I’d like to make re: autonomy is that you don’t need to include it in your model for Tesla to have growth potential. In other words, if Tesla does succeed, throw your model out the door because every estimate you made is too low. And if they don’t succeed, well you’re stuck with a really good company — bummer. \n \nThe autonomous disruption could be a post entirely on its own but I don’t really want to scare potential new investors with wild ideas, so I’ll just talk to two main bear arguments. \n \n“The experts all say you need lidar”\n \nWhich experts? As far as I can tell no company in existence has scaled autonomy that works in all conditions. The consensus among current “experts” is that lidar &amp; HD mapping is needed, but they haven’t succeeded in their goal yet. If Tesla is the first to scale autonomy, then they are the only expert opinion that matters. \n \nTesla’s approach to autonomy is (in my opinion) brilliant. Every. Single. Car. helps with the mission. Tesla believes that the company with the most data will win the race. They’re not trying to solve autonomy on specific stretches of highway, or in certain cities, they are trying to create a generalized approach that will work everywhere. Basically, it’s extremely fucking complicated and no shit it isn’t available yet lol. I’m not saying you shouldn’t give Elon shit for talking about unrealistic timelines, but that’s just how Elon works. “If you give yourself 30 days to clean your home it will take 30 days…” \n \nNow, for those of you saying that I’m an idiot and Tesla will have to include lidar, additional cameras, and additional sensors… that’s okay. I’m not bullish on FSD timelines or the fact that their current hardware will be enough. I’m bullish on the company and its ability to adapt and make the right decisions. If they find that they need to add cameras or other sensors they will add them. The cost to do so is greatly overstated by bears and will be recouped by the massive revenue potential of an autonomous network. \n \n“Tesla is only SAE L2” \n \nBut, but, Mercedes has L3 on certain sections of the autobahn when you’re traveling under 37mph! \n \nGuys, the levels of autonomy don’t mean shit re: capability. The levels are all about liability. If you’re looking at Tesla as a potential investor you should want them to keep it as a L2 system for as long as possible. A L2 system means that the driver is to always remain in control and is ultimately liable for any incident. L5 is obviously the end goal but it’s not something that should be rushed. \n \n//\n \nI want to reiterate that I’m not saying that you aren’t allowed to be bearish on Tesla. There are no “rules” for investing. There will be plenty (probably the majority) who read this post and remain bearish. I actively encourage any bearish comments because I love reading them and adjusting my bull thesis accordingly. \n \nMy hope is that the default narrative around Tesla changes. There are far too many people who adamantly believe that Tesla is overvalued even though they’ve never done any research into the company. You’re entitled to your strong opinion but show us why so we can help each other grow.\n \nAlso, guys, don’t sleep on Tesla energy…",
  "author_fullname": "t2_7ol0r",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "We need to talk about Tesla",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rz3m1n",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.68,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 52,
  "total_awards_received": 2,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 52,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 2
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1641659229,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As if there weren’t enough posts on this subreddit about Tesla already I’ve decided to make another. I’d like to start with something that will become obvious later in this post: I’m bullish on the company and own the stock. &lt;/p&gt;\n\n&lt;p&gt;I think we as investors are extremely lucky to have mediums like Reddit &amp;amp; Twitter to help with our investment decisions. Not only do we have instant access to information, but we also have instant access to discussions regarding that information. I’ve noticed that throughout these posts it seems that the default position is that Tesla is overvalued. The biggest problem I have with this is that many will dismiss Tesla as a bubble and overvalued without digging into the company themselves. &lt;/p&gt;\n\n&lt;p&gt;I want to make one thing clear with my post: I’m not saying that you can’t be bearish on Tesla. Nor am I saying that you aren’t allowed to think that it’s overvalued. I agree, there is growth priced into the stock and the company needs to execute to grow into its valuation. What I am trying to argue is that there isn’t nearly as much growth priced in as most think and you’re doing yourself a disservice by not looking into the company. &lt;/p&gt;\n\n&lt;p&gt;Let’s start with some of the most common arguments people use to claim that Tesla is overvalued.  &lt;/p&gt;\n\n&lt;p&gt;“The PE Ratio”&lt;/p&gt;\n\n&lt;p&gt;The price-earnings ratio is a very common metric to value companies. This makes perfect sense as it’s the price you pay for a stock divided by the actual earnings per share. Now, I’m going to say something that many of you probably won’t like: Tesla’s PE ratio is an extremely bullish indicator. &lt;/p&gt;\n\n&lt;p&gt;When you compare 12/31/2020 vs 12/31/2021 you have the PE ratio declining 69% from 1,102.61 to 340.90. Why is this significant? &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Tesla reduced their PE by 69% while simultaneously increasing the stock price by 50%&lt;/li&gt;\n&lt;li&gt;The earnings growth of 384% (0.64 vs 3.10) doesn’t include Q4 2021 (2021’s Q3 TTM is used as the Q4 report isn’t out till later this month)\n\n&lt;ul&gt;\n&lt;li&gt;If you assume that Q4 EPS will be ~2.5 then the PE ratio drops to under 200 with EPS growth over 700%! &lt;/li&gt;\n&lt;li&gt;If you annualized that Q4 EPS and assumed no growth throughout 2022 in both the stock price and earnings, then you’d end 2022 with a PE of 105.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Many will argue that a PE of 105 is still massively overvalued, but I’m more interested in the &amp;gt;700% earnings growth. Considering Tesla is still (somehow) ramping their Fremont &amp;amp; Shanghai factories and has two more massive factories in Austin &amp;amp; Berlin coming online sometime this year, I have a hard time believing that their EPS won’t continue to climb.  &lt;/p&gt;\n\n&lt;p&gt;That’s why, to me, their PE is an “extremely bullish indicator”. PE shouldn’t be used in isolation, so when you find out that a company has decreased their PE by 69% while increasing their stock price by 50% during a chip shortage, I think a little more digging is required (i.e., forecasting forward 5 years and then discounting back). Do you really think the best way to value a company growing earnings &amp;gt;100% is a TTM ratio?  &lt;/p&gt;\n\n&lt;p&gt;“The market cap is larger than all other automakers combined” &lt;/p&gt;\n\n&lt;p&gt;Look at their &lt;a href=\"https://twitter.com/forwardcap/status/1464961280138174466?s=20\"&gt;profit per vehicle&lt;/a&gt; and then compare that to what the legacy auto industry is doing. I don’t think value by comparisons provides much merit especially when you consider the fact that what’s happening to the auto industry is a two-part disruption:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Electric vehicles &lt;/li&gt;\n&lt;li&gt;Autonomous vehicles&lt;br/&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;You can agree/disagree with the two-part disruption and that’s valid (I’ll talk about both in isolation below), but if you agree that the industry is being disrupted then it doesn’t really make much sense to compare the new with the old. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Electric vehicle disruption&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;If you still aren’t sold on the fact that electric vehicles are the future of the auto industry, I’m not entirely sure what I can say. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;They’re better for consumers: easier to maintain, more reliable, better performance/price, better technology, and the total cost of ownership is lower (lifetime of the vehicle)&lt;/li&gt;\n&lt;li&gt;They’re better for manufacturers: simplistic design is easier to produce which lowers costs (spicy margins) &lt;/li&gt;\n&lt;li&gt;They’re much better for the environment&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;This is usually when another common bear thesis comes into play: &lt;/p&gt;\n\n&lt;p&gt;“The competition is coming” &lt;/p&gt;\n\n&lt;p&gt;The biggest problem I have with this bear thesis is it entirely misses the point. The competition isn’t coming it’s always existed. Tesla isn’t competing against Lucid/Rivian/Mach-e/etc. Tesla/Lucid/Rivian/Mach-e/etc are competing against ICE. Electric vehicles are still a tiny percentage of the overall auto market today with 100% being their future. There is still plenty of room for other players to exist in the same space. &lt;/p&gt;\n\n&lt;p&gt;But there are people who will buy a Mach-e over a Model Y, so Tesla is losing market share, right? The problem with this is it ignores the extremely long waitlist that Tesla must deal with and the fact that they literally sell every vehicle they make. If you don’t buy a Tesla and instead go with a Mach-e, someone else is buying that Tesla. Tesla’s market share in the electric vehicle space will go down but it’s irrelevant as market share in the total vehicle space will increase. &lt;/p&gt;\n\n&lt;p&gt;The disruption is very simple: any company that makes a compelling electric vehicle for an attainable price will sell every vehicle they make.   &lt;/p&gt;\n\n&lt;p&gt;Side note: There is also almost a default assumption that legacy autos will be able to ramp as quickly and even surpass Tesla which I find a tad absurd. I’m not saying it isn’t possible, but people are seriously underestimating and underappreciating Tesla’s growth. Their current run rate is already over a million vehicles per year and they’re guiding for 50% growth out till 2030. No other manufacturer has guidance that even comes close (even if they say they’ll be leaders by 2025). &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Autonomous vehicle disruption&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;This is where I’m sure a lot of you will roll your eyes. Honestly, I think that’s fine. Autonomy is a new technology that has never scaled nor proven to work in all situations and weather conditions. I don’t have robotaxi‘s in my model and I’m not saying you should either. The main point I’d like to make re: autonomy is that you don’t need to include it in your model for Tesla to have growth potential. In other words, if Tesla does succeed, throw your model out the door because every estimate you made is too low. And if they don’t succeed, well you’re stuck with a really good company — bummer. &lt;/p&gt;\n\n&lt;p&gt;The autonomous disruption could be a post entirely on its own but I don’t really want to scare potential new investors with wild ideas, so I’ll just talk to two main bear arguments. &lt;/p&gt;\n\n&lt;p&gt;“The experts all say you need lidar”&lt;/p&gt;\n\n&lt;p&gt;Which experts? As far as I can tell no company in existence has scaled autonomy that works in all conditions. The consensus among current “experts” is that lidar &amp;amp; HD mapping is needed, but they haven’t succeeded in their goal yet. If Tesla is the first to scale autonomy, then they are the only expert opinion that matters. &lt;/p&gt;\n\n&lt;p&gt;Tesla’s approach to autonomy is (in my opinion) brilliant. Every. Single. Car. helps with the mission. Tesla believes that the company with the most data will win the race. They’re not trying to solve autonomy on specific stretches of highway, or in certain cities, they are trying to create a generalized approach that will work everywhere. Basically, it’s extremely fucking complicated and no shit it isn’t available yet lol. I’m not saying you shouldn’t give Elon shit for talking about unrealistic timelines, but that’s just how Elon works. “If you give yourself 30 days to clean your home it will take 30 days…” &lt;/p&gt;\n\n&lt;p&gt;Now, for those of you saying that I’m an idiot and Tesla will have to include lidar, additional cameras, and additional sensors… that’s okay. I’m not bullish on FSD timelines or the fact that their current hardware will be enough. I’m bullish on the company and its ability to adapt and make the right decisions. If they find that they need to add cameras or other sensors they will add them. The cost to do so is greatly overstated by bears and will be recouped by the massive revenue potential of an autonomous network. &lt;/p&gt;\n\n&lt;p&gt;“Tesla is only SAE L2” &lt;/p&gt;\n\n&lt;p&gt;But, but, Mercedes has L3 on certain sections of the autobahn when you’re traveling under 37mph! &lt;/p&gt;\n\n&lt;p&gt;Guys, the levels of autonomy don’t mean shit re: capability. The levels are all about liability. If you’re looking at Tesla as a potential investor you should want them to keep it as a L2 system for as long as possible. A L2 system means that the driver is to always remain in control and is ultimately liable for any incident. L5 is obviously the end goal but it’s not something that should be rushed. &lt;/p&gt;\n\n&lt;p&gt;//&lt;/p&gt;\n\n&lt;p&gt;I want to reiterate that I’m not saying that you aren’t allowed to be bearish on Tesla. There are no “rules” for investing. There will be plenty (probably the majority) who read this post and remain bearish. I actively encourage any bearish comments because I love reading them and adjusting my bull thesis accordingly. &lt;/p&gt;\n\n&lt;p&gt;My hope is that the default narrative around Tesla changes. There are far too many people who adamantly believe that Tesla is overvalued even though they’ve never done any research into the company. You’re entitled to your strong opinion but show us why so we can help each other grow.&lt;/p&gt;\n\n&lt;p&gt;Also, guys, don’t sleep on Tesla energy…&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rz3m1n",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "IMancini",
  "discussion_type": null,
  "num_comments": 81,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/rz3m1n/we_need_to_talk_about_tesla/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/rz3m1n/we_need_to_talk_about_tesla/",
  "subreddit_subscribers": 3488652,
  "created_utc": 1641693643,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1641659229,
  "the_new_excerpt": "As if there weren’t enough posts on this subreddit about Tesla already I’ve\ndecided to make another. I’d like to start with something that will become\nobvious later in this post: I’m bullish on the company and own the stock.\n\nI think we as investors are extremely lucky to have mediums like Reddit…"
}