{
  "author": "lawrenceugene",
  "original_created_utc": 1631579498,
  "title": "Why weren't Native Americans the primary slave population in America?",
  "created_utc": 1631590178,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that Native Americans were enslaved in certain cases, most notably by Christopher Columbus in Puerto Rico. However why is it that the primary enslaved population in the Americas were African? From both an economic and convenience perspective it seems odd that people from Europe would travel to Africa to then travel to America and produce crops to then... send back to Europe? Or at least send the profits back. Why not just enslave other Europeans? Or only bring African slaves to Europe, rather than risk the financial and human loss of transporting then to a tertiary location even farther away? Even simpler, why not just conquer Africa and grow the crops there? Certainly that was already happening, so why take all these extra steps? There are some obvious factors I&#39;m missing here, any explanation that can shed some more light on the economics of colonialism would be appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/pns1tk/why_werent_native_americans_the_primary_slave/",
  "subreddit": "AskHistorians",
  "id": "pns1tk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that Native Americans were enslaved in certain cases, most notably\nby Christopher Columbus in Puerto Rico. However why is it that the primary\nenslaved population in the Americas were African? From both an economic and\nconvenience perspective it seems odd that people from Europe would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ネイティブ・アメリカンが奴隷にされていたことは、クリストファー・コロンブスがプエルトリコで奴隷にしたのをはじめ、いくつかのケースで理解しています。\nクリストファー・コロンブスがプエルトリコで しかし、アメリカ大陸で主に奴隷にされていたのがアフリカ人だったのはなぜでしょうか？\nアメリカ大陸で奴隷にされたのは、なぜアフリカ人だったのでしょうか？経済的にも利便性の面でも、ヨーロッパから来た人たちが\n経済的にも利便性の観点からも、ヨーロッパの人々が...",
      "title": "なぜネイティブ・アメリカンはアメリカの主要な奴隷人口ではなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，美洲原住民在某些情况下是被奴役的，最突出的是\n被克里斯托弗-哥伦布在波多黎各奴役。然而，为什么美洲的主要\n美洲的主要受奴役人口是非洲人？无论是从经济角度还是从\n方便的角度来看，来自欧洲的人似乎很奇怪，他们会...",
      "title": "为什么美洲原住民不是美国的主要奴隶人口？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，美洲原住民在某些情況下是被奴役的，最突出的是\n被克里斯托弗-哥倫布在波多黎各奴役。然而，爲什麼美洲的主要\n美洲的主要受奴役人口是非洲人？無論是從經濟角度還是從\n方便的角度來看，來自歐洲的人似乎很奇怪，他們會...",
      "title": "爲什麼美洲原住民不是美國的主要奴隸人口？"
    }
  ]
}