{
  "author": "Dnumasen",
  "original_created_utc": 1638632366,
  "title": "Anyone actually living off trading or is it Just \"traders on YouTube\" living of viewers?",
  "created_utc": 1638660792,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all I am not trying to offend anyone. This is an actual question I have been wondering about since I got into crypto. Is it actually possible to live a sustainable life with crypto trading? Or do you need some kind of other income to go trading with?&lt;/p&gt;\n\n&lt;p&gt;Sometimes it seems to me it&amp;#39;s a lot of luck involved and a lot of traders I watched, did get wrecked or got some big losses. Perhaps they&amp;#39;ve been a bit unlucky while I watched them, but how does trading feel to you guys?&lt;/p&gt;\n\n&lt;p&gt;Have any of you guys triets to trade at some point? I did so my self, but I got rekt like a proper newb I am. Does TA actually work, or is it more based on marked trend and educated guesses to get the majority of the trades correct?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/r8s6p7/anyone_actually_living_off_trading_or_is_it_just/",
  "subreddit": "CryptoCurrency",
  "id": "r8s6p7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of all I am not trying to offend anyone. This is an actual question I have\nbeen wondering about since I got into crypto. Is it actually possible to live a\nsustainable life with crypto trading? Or do you need some kind of other income\nto go trading with?\n\nSometimes it seems to me it's a lot of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず第一に、私は誰かを不快にさせるつもりはありません。これは私が実際に抱いた疑問です。\nクリプトを始めてからずっと疑問に思っていたこと。実際に生活することは可能なのでしょうか？\n暗号取引で持続可能な生活？または、他の収入のいくつかの種類が必要です\nを使うのでしょうか？\n\nと思われることもありますが、たくさん...",
      "title": "実際にトレードで生活している人はいるのか、それとも「YouTubeのトレーダー」が視聴者の生活を支えているだけなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我并不是要冒犯任何人。这是我一直在想的一个实际问题\n自从我开始接触加密货币以来，我一直在想这个问题。是否真的有可能通过加密货币交易过一种\n可持续的生活吗？或者你需要一些其他的收入\n来进行交易？\n\n有时在我看来，这是一个很大的...",
      "title": "有没有人真正靠交易为生，还是只是 \"YouTube上的交易员 \"靠观众为生？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我並不是要冒犯任何人。這是我一直在想的一個實際問題\n自從我開始接觸加密貨幣以來，我一直在想這個問題。是否真的有可能通過加密貨幣交易過一種\n可持續的生活嗎？或者你需要一些其他的收入\n來進行交易？\n\n有時在我看來，這是一個很大的...",
      "title": "有沒有人真正靠交易爲生，還是隻是 \"YouTube上的交易員 \"靠觀衆爲生？"
    }
  ]
}