{
  "author": "Philbertan",
  "the_new_excerpt": "My history: Joined in 2017, did all rookie mistakes u can imagine, including\nlosing funds on a hacked exchange (BitGrail), but did not give up and sitting on\n30x of my initial investment today. The best thing about investing: You can't\nblame anyone but yourself for fucking up. This is what motivated…",
  "original_created_utc": 1619535998,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の歴史 2017年に入社し、以下のような想像しうるすべての新人のミスをしました。\nハッキングされた取引所（BitGrail）で資金を失いましたが、あきらめずに続けています。\n今では初期投資の30倍になっています。投資の醍醐味。失敗しても自分以外の誰かを責めることは\n投資の醍醐味：失敗しても自分以外の誰かを責めることはできない。これが、私のモチベーションになりました。",
      "title": "Cryptoを成功させたベテランとして、新規参入者のために最も貴重な教訓を共有したい（DCAへの代替手段"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的历史。2017年加入，犯了所有你能想象的菜鸟错误，包括\n在一个被黑客攻击的交易所（BitGrail）上损失了资金，但我没有放弃，今天坐在\n今天我的初始投资的30倍。关于投资的最好的事情。你不能\n你不能责怪任何人，只能责怪你自己搞砸了。这也是激励我的原因。",
      "title": "作为一名成功的加密货币老兵，我想为新人分享我最有价值的经验（DCA的替代品"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的歷史。2017年加入，犯了所有你能想象的菜鳥錯誤，包括\n在一個被黑客攻擊的交易所（BitGrail）上損失了資金，但我沒有放棄，今天坐在\n今天我的初始投資的30倍。關於投資的最好的事情。你不能\n你不能責怪任何人，只能責怪你自己搞砸了。這也是激勵我的原因。",
      "title": "作爲一名成功的加密貨幣老兵，我想爲新人分享我最有價值的經驗（DCA的替代品"
    }
  ],
  "title": "As A Crypto Veteran Who Made It I Want To Share My Most Valuable Lessons For Newcomers (Alternatives To DCA)",
  "created_utc": 1619549867,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My history: Joined in 2017, did all rookie mistakes u can imagine, including losing funds on a hacked exchange (BitGrail), but did not give up and sitting on 30x of my initial investment today. The best thing about investing: You can&#39;t blame anyone but yourself for fucking up. This is what motivated me the most, so I used the bearmarket to read books and educate myself.</p>\n\n<p>The strategies I&#39;m sharing here are for people who are a little bit more confident and want to do more than just DCA </p>\n\n<p><strong>Getting into a position / accumulating bags:</strong></p>\n\n<p>People love to accumulate on the way down. They think &quot;Wow, it can&#39;t drop much further from here&quot;, but it can always drop more. If u buy at -90% and it goes to -99%, which we saw for a lot of coins in 2018/19, u are down -90% on your investment. Since most coins recovered, people will feel like this strategy is great, but some stuff does NOT recover. About 5 of my old bags got delisted from exchanges and are now worthless.</p>\n\n<p>The much safer strategy is to accumulate on the way up after a break in market structure (making a higher low and higher high) and getting out when it forms new lows. You might be wrong a few times, but it is much safer. </p>\n\n<p>If this is too advanced for you and you prefer DCAing in a bear market, I would do this only for Bitcoin and Ethereum or a few other majors and only buy small caps after the trend has changed.</p>\n\n<p><strong>Exit strategy / taking profits:</strong></p>\n\n<p>You probably heard the following statement plenty of times: &quot;Nobody ever went broke by taking profits&quot;. I tend to disagree and here is my version: Bad traders go broke, because they cut losses too late and advanced traders go broke, because they take profits too early. </p>\n\n<p>My reasoning: We are in crypto. It is a highly volatile market with great opportunities and great risks. Investing into crypto for small profits is not a good risk/reward. So once you have a position and the market is starting to trend, you want to go with the trend and sit tight. People rather take profits on their 2x-3x bag and put them into their worst performing bag, because &quot;it has to catch up&quot;. Instead, they should add to their 2x-3x bag and think about getting rid of the loser. Of course, you have to take profits at some point, but don&#39;t set your targets too low. Even Bitcoin did a 15x and some of my other bags did a 50-100x and this is where I took profits the first time. </p>\n\n<p>So how do I find good targets? Analyze the history of the coin you&#39;re buying or similar coins and see how they performed in past bullmarkets to get a feeling what might happen. Go to their telegram channels to get a measure of euphoria. If new people are flooding in and sharing crazy targets AFTER it is already up a lot, you can start taking profits.</p>\n\n<p><strong>Patience is key</strong> </p>\n\n<p>This is not a secret, but I still want to emphasize it, because it is by far the most important factor. My two previous paragraphs are based on patience. By not accumulating on the way down you are basically doing nothing for a long time, but waiting for a shift in market structure. Once you are in position, you are again doing nothing for a long time, but watch your bags grow. This is how the big money is made. It is the easiest and hardest part at the same time and in theory everybody knows it, but once you are in position you forget about it. So set up a system of rules and do not break them, EVER.</p>\n\n<p>Patience was and is my biggest weakness, so I found a way to trick myself: I created one hodl/longterm portfolio with 90-95% of my assets and one active altcoin trading account with only 5-10%. This way I could still do stuff in crypto and keep myself busy without touching my good bags. It&#39;s also nice to compare the performance of holding vs trading. My trading account is in profit, but got outperformed big time by the longerm portfolio.</p>\n\n<p>I could probably fill a book at this point myself, because there is so much more about it, but I will cut it here.</p>\n\n<p>PS.: Don&#39;t check my post history, I did it for the Karma lol</p>\n</div><!-- SC_ON -->",
  "score": 920,
  "permalink": "/r/CryptoCurrency/comments/mzqioo/as_a_crypto_veteran_who_made_it_i_want_to_share/",
  "subreddit": "CryptoCurrency",
  "id": "mzqioo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212025
}