{
  "author": "MindofLogic23",
  "original_created_utc": 1637195518,
  "title": "The NBA is being overtaken by crypto",
  "created_utc": 1637235104,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the recent news of the Staples Center being renamed to the Crypto.com Center, there is a wildfire of crypto sponsoring organizations taking the NBA by storm while sports like the NFL and UFC have given it lots of publicity. </p>\n\n<p>The Los Angeles Lakers are one of the most prestigious organizations and one of the most-storied teams in the league. With all of its history and world-wide reach, this can definitely elevate crypto by introducing it to people all over the world and making it more mainstream! The Boston Celtics, their main rival and another powerful organization, also has Crypto.com on their jerseys. The Portland Trail Blazers have StormX as their main jersey sponsor as well. </p>\n\n<p>With highly popular athletes taking part in crypto-related things such as NFTs with Stephen Curry and Bitcoin with Tom Brady, there is bound to be many newcomers and more believers into crypto!</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qwd6do/the_nba_is_being_overtaken_by_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qwd6do",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "With the recent news of the Staples Center being renamed to the Crypto.com\nCenter, there is a wildfire of crypto sponsoring organizations taking the NBA by\nstorm while sports like the NFL and UFC have given it lots of publicity.\n\nThe Los Angeles Lakers are one of the most prestigious organizations…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Staples CenterがCrypto.com Centerに改名されたという最近のニュースを受けて\nセンターに改名されたことで、NFLやUFCなどのスポーツ界が注目を集める中、NBAでは暗号スポンサーの組織が嵐のような勢いで増えています。\nまた、NFLやUFCなどのスポーツ界でも注目されています。\n\nロサンゼルス・レイカーズは、最も権威のある組織の1つです...",
      "title": "NBAは暗号に追い越される"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着最近斯台普斯中心被改名为Crypto.com中心的消息传出。\n中心的消息，加密货币赞助机构在NBA掀起了一阵狂风。\n而像NFL和UFC这样的运动已经给了它很多宣传。\n\n洛杉矶湖人队是最著名的组织之一...",
      "title": "NBA正在被加密货币所取代"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着最近斯臺普斯中心被改名爲Crypto.com中心的消息傳出。\n中心的消息，加密貨幣贊助機構在NBA掀起了一陣狂風。\n而像NFL和UFC這樣的運動已經給了它很多宣傳。\n\n洛杉磯湖人隊是最著名的組織之一...",
      "title": "NBA正在被加密貨幣所取代"
    }
  ]
}