{
  "author": "ThermalFlask",
  "original_created_utc": 1654637083,
  "title": "If inflammation is bad, why does our body do it?",
  "created_utc": 1654656751,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I constantly see &amp;quot;anti-inflammatory properties&amp;quot; listed as a health benefit of various nutrients in healthy foods, but my understanding is that inflammation is a natural process of the human body. So anti-inflammatory foods are basically inhibiting a normal biological process.&lt;/p&gt;\n\n&lt;p&gt;Why do we need to do that to be healthy? Why do we have a self-destructive inflammatory behavior in the human body anyway?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/askscience/comments/v7857j/if_inflammation_is_bad_why_does_our_body_do_it/",
  "subreddit": "askscience",
  "id": "v7857j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I constantly see \"anti-inflammatory properties\" listed as a health benefit of\nvarious nutrients in healthy foods, but my understanding is that inflammation is\na natural process of the human body. So anti-inflammatory foods are basically\ninhibiting a normal biological process.\n\nWhy do we need to do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は常に、「抗炎症作用」が健康上の利点として挙げられているのを目にします。\nしかし、私の理解では、炎症は人体の自然なプロセスです。\nは人体の自然なプロセスであるということです。つまり、抗炎症作用のある食品は、基本的に\n正常な生物学的プロセスを阻害しているのです。\n\nなぜ、そのようなことをする必要があるのでしょうか...",
      "title": "炎症が悪いものなら、なぜ私たちの体は炎症を起こすのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常看到 \"抗炎特性 \"被列为各种营养素的健康益处之一。\n健康食品中的各种营养素，但我的理解是，炎症是人体的一个自然过程。\n是人体的一个自然过程。因此，抗炎食品基本上是\n抑制了一个正常的生物过程。\n\n为什么我们需要做...",
      "title": "如果炎症是不好的，为什么我们的身体会这样做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常看到 \"抗炎特性 \"被列爲各種營養素的健康益處之一。\n健康食品中的各種營養素，但我的理解是，炎症是人體的一個自然過程。\n是人體的一個自然過程。因此，抗炎食品基本上是\n抑制了一個正常的生物過程。\n\n爲什麼我們需要做...",
      "title": "如果炎症是不好的，爲什麼我們的身體會這樣做？"
    }
  ]
}