{
  "author": "th3cr1t1c",
  "the_new_excerpt": "reprinted from an earlier commentt I made elsewhere on the boards\n\nEDIT: Many thanks to those who gave awards/recogniton!\n\nTime Value of Money (TVM) is the central principle of all finance, and it can\nwork for you or against you. It's applicable to everything: Giving up some money\nnow for more money…",
  "original_created_utc": 1615658754,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "转载自我早先在其他板块的评论意见\n\n编辑：非常感谢给予奖励/表彰的朋友们!\n\n货币时间价值（TVM）是所有金融的核心原则，它可以\n对你有利或不利。它适用于所有的事情：放弃一些钱。\n现在为了更多的钱...",
      "title": "我是如何了解金钱的时间价值和复利的--10岁时在公海上贩毒--或者说，为什么我是一个价值投资者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "轉載自我早先在其他板塊的評論意見\n\n編輯：非常感謝給予獎勵/表彰的朋友們!\n\n貨幣時間價值（TVM）是所有金融的核心原則，它可以\n對你有利或不利。它適用於所有的事情：放棄一些錢。\n現在爲了更多的錢...",
      "title": "我是如何瞭解金錢的時間價值和複利的--10歲時在公海上販毒--或者說，爲什麼我是一個價值投資者？"
    }
  ],
  "title": "How I Learned About Time Value of Money and Compound Interest Dealing Drugs on the High Seas At The Age Of Ten -or- Why I'm a Value Investor",
  "created_utc": 1615670480,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>reprinted from an earlier commentt I made elsewhere on the boards</em></p>\n\n<p><strong>EDIT: Many thanks to those who gave awards/recogniton!</strong></p>\n\n<p><strong>Time Value of Money (TVM)</strong> is the central principle of all finance, and it can work for you or against you. It&#39;s applicable to everything: Giving up some money now for more money later, or buying a dollar for sixty cents versus the other way around.</p>\n\n<p>The Time Value of Money equation can be expressed as:</p>\n\n<p>FV = PV x (1 + r)<sup>nt</sup></p>\n\n<p>Where FV is the future value of an asset. PV is the present value. r is the rate of return. n is the number of times compounded per term. t is the term (in years) compounded. e.g. if you are compounding monthly for 30 years then n = 12, t = 30, nt = 12 * 30 = 360.</p>\n\n<p>When you&#39;re a borrower, you&#39;re paying the premium. When you&#39;re a depositor and investor, you&#39;re collecting the premium... provided that you are properly pricing assets and not buying into the inflated premiums speculators attach to stocks on the front end.</p>\n\n<p>If you&#39;re old enough to remember, there was this game for the Apple ][ called <em>Taipan!</em> that taught Time Value of Money and compound interest in a very interesting way:</p>\n\n<p>The game involved being a trader on the China Sea. It was basically the predecessor to Dope Wars... you would fight pirates, collect their treasure, buy bigger ships, buy cannons, trade arms, silk, cargo and opium. Opium was like a day trading stock. It could skyrocket for no reason. And you could get rich, then you&#39;d get mugged by robbers and lose all your cash.</p>\n\n<p>You have this Elder Brother Wu who is basically a loan shark. He can loan you money but he&#39;ll loan it to you at a usurious rate of interest... it compounds 10 percent <em>per turn.</em> And if you don&#39;t pay him off <em>he&#39;ll send his bodyguards to cut your throat.</em></p>\n\n<p><strong>BUT THERE&#39;S A GLITCH...</strong></p>\n\n<p>If you repay Wu more money than you owe him, suddenly you have a negative balance... and it grows at the same rate of interest, but in your favor. He owes you 10 percent compounded per turn.</p>\n\n<p>If you play this out for a while, your balance with him grows into the billions and trillions and hundreds of trillions of British pounds. Pretty soon, the risk of getting mugged over £3 million in opium seems worthless, because by this point in the game you&#39;re making more than <del>ten</del> 1000 times that just moving from port to port, causing Wu to incur <a href=\"https://i.imgur.com/4VtO2BL.png\">humongous interest</a>.</p>\n\n<p><strong>That</strong> is why you should always be, literally, on the right side of the Time Value of Money equation.</p>\n</div><!-- SC_ON -->",
  "score": 372,
  "permalink": "/r/stocks/comments/m4boaq/how_i_learned_about_time_value_of_money_and/",
  "subreddit": "stocks",
  "id": "m4boaq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382518
}