{
  "author": "deathtolucky",
  "original_created_utc": 1636462759,
  "title": "Could this sub have gotten it right for once? I love you all.",
  "created_utc": 1636479398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You all said that the pump wasn’t over. You said it hadn’t even truly started. It looks like you may be right. You all said that the money flows into BTC and ETH first. It looks like you might be right. You all said that the money flows into alts after the blue chip pump. I sincerely hope you are right. </p>\n\n<p>It is SO hard to know what to believe here. The sentiment can swing from euphoria to doom in the span of 24 hours. I wanted SO badly to hedge my bets and convert some of my positions into stables because when everyone is saying bull, it’s likely a bear is right around the corner. I didn’t. I believed in you all. I let my positions ride and I’m up. </p>\n\n<p>You all say that this was just the beginning of the pump. I SO badly want you all to be right. I haven’t swapped my coins for pumping memecoins like SHIB, FLOKI or any other INU coin. I have kept my positions and held the line while they crabbed like stablecoins. I haven’t FOMOed into LRC, SOL (but boy I wish I did months ago), CRO or any other coins that get all the love here. I held the line. </p>\n\n<p>It feels SO good. I mean even LTC is gaining which is both hilarious and wholesome. I have renewed hope that you might be right again. I believe that alts could pump next. But the good alts. The girl next door alts. The alts who you fell in love with in the first place and never left you alts. </p>\n\n<p>I love you all for being so stubborn and refusing to be shaken out of your positions. I love you all for holding the line. I’m getting drunk tonight and lighting a green candle. Enjoy the pumps hodlers. You’re all legends.</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/qq352m/could_this_sub_have_gotten_it_right_for_once_i/",
  "subreddit": "CryptoCurrency",
  "id": "qq352m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You all said that the pump wasn’t over. You said it hadn’t even truly started.\nIt looks like you may be right. You all said that the money flows into BTC and\nETH first. It looks like you might be right. You all said that the money flows\ninto alts after the blue chip pump. I sincerely hope you are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんは、「ポンプは終わっていない」とおっしゃっていました。本当の意味で始まってもいないと言っていましたね。\nそれは正しいかもしれませんね。皆さんは、お金がBTCとETHにまず流れると言いました。\nETHに流れると言っていましたが それは正しいかもしれないようです。皆さんは、ブルーチップポンプの後、資金は\nブルーチップポンプの後にアルトに資金が流れると言っていましたが 私はあなたがそうであることを切に願っています...",
      "title": "このサブ機は、一度だけでもうまくいったのだろうか？私はあなた方を愛しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们都说，泵还没有结束。你们说它甚至还没有真正开始。\n看起来你们可能是对的。你们都说过，资金会先流入BTC和\nETH第一。看起来你可能是对的。你们都说过，在蓝筹股抽水之后，资金会流向\n在蓝筹股抽水之后流入代理人。我真诚地希望你们是...",
      "title": "这家子公司能不能有一次做对了？我爱你们所有人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們都說，泵還沒有結束。你們說它甚至還沒有真正開始。\n看起來你們可能是對的。你們都說過，資金會先流入BTC和\nETH第一。看起來你可能是對的。你們都說過，在藍籌股抽水之後，資金會流向\n在藍籌股抽水之後流入代理人。我真誠地希望你們是...",
      "title": "這家子公司能不能有一次做對了？我愛你們所有人。"
    }
  ]
}