{
  "author": "chesteratkins",
  "the_new_excerpt": "I don’t know what I’m doing with my life, my job sucks, I still live at home. I\njust decided to pack up and leave my hometown to take a course at a college\n(already have my degree), I don’t have any plans for what I’ll do after that. I\nonly have enough money saved to stay a certain amount of time…",
  "original_created_utc": 1619696645,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分の人生で何をしたらいいのかわからない。仕事は最低だし、まだ実家で暮らしている。I\n大学の講義を受けるために、荷物をまとめて地元を離れることにしたんだ。\n既に学位を取得しています）、その後どうするかについては何の計画もありません。I\nある程度の期間滞在できるだけの貯金しかありません...。",
      "title": "20代で完全な負け犬になった気分になるのは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道我的生活在做什么，我的工作很糟糕，我仍然住在家里。I\n我刚刚决定收拾行李离开我的家乡，去一所大学学习课程。\n(已经有了学位)，我没有任何计划，不知道以后会做什么。I\n我的钱只够在这里呆一段时间......",
      "title": "在20多岁时感觉自己是个十足的失败者，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道我的生活在做什麼，我的工作很糟糕，我仍然住在家裏。I\n我剛剛決定收拾行李離開我的家鄉，去一所大學學習課程。\n(已經有了學位)，我沒有任何計劃，不知道以後會做什麼。I\n我的錢只夠在這裏呆一段時間......",
      "title": "在20多歲時感覺自己是個十足的失敗者，這正常嗎？"
    }
  ],
  "title": "Is it normal to feel like a total loser in your 20s?",
  "created_utc": 1619721769,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t know what I’m doing with my life, my job sucks, I still live at home. I just decided to pack up and leave my hometown to take a course at a college (already have my degree), I don’t have any plans for what I’ll do after that. I only have enough money saved to stay a certain amount of time and no job lined up. But I feel like I need to make moves and get out of my comfort zone so that I don’t end up a loser at 40, I don’t know how else to do it. Any older people with comments or advice?</p>\n</div><!-- SC_ON -->",
  "score": 141,
  "permalink": "/r/NoStupidQuestions/comments/n12iu3/is_it_normal_to_feel_like_a_total_loser_in_your/",
  "subreddit": "NoStupidQuestions",
  "id": "n12iu3",
  "is_self": true,
  "media": null,
  "is_video": false
}