{
  "author": "Rikky999",
  "the_new_excerpt": "Im a 19yr old and after many years of being a stoner I’ve always thought back on\nhow much money I’ve wasted on something ill never get back. Some might say you\ncan’t put a price on memories but the truth is for me that I don’t remember 80%\nof the shit I’ve done while high.\n\nAt the beginning of this…",
  "original_created_utc": 1613398098,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个19岁的人，经过多年的是一个石头人，我一直在想回在。\n我浪费了多少钱在一些永远也拿不回来的东西上。有人会说你\n回忆是不能用价格来衡量的 但对我来说，事实是我不记得80%的事情\n的狗屎我已经做了，而高。\n\n在开始的时候...",
      "title": "把大麻（我的毒瘾）变成比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個19歲的人，經過多年的是一個石頭人，我一直在想回在。\n我浪費了多少錢在一些永遠也拿不回來的東西上。有人會說你\n回憶是不能用價格來衡量的 但對我來說，事實是我不記得80%的事情\n的狗屎我已經做了，而高。\n\n在開始的時候...",
      "title": "把大麻（我的毒癮）變成比特幣。"
    }
  ],
  "title": "Turning Weed (my addiction) into Bitcoin",
  "created_utc": 1613408751,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im a 19yr old and after many years of being a stoner I’ve always thought back on how much money I’ve wasted on something ill never get back. Some might say you can’t put a price on memories but the truth is for me that I don’t remember 80% of the shit I’ve done while high. </p>\n\n<p>At the beginning of this pandemic I was a little happy I now had an excuse to just stay at home and smoke my weed but I quickly started to see things differently. I was now wasting away my days and gaining absolutely nothing. </p>\n\n<p>So around New Years I decided I wanted to take a break and just breath and see if I could do more or even be just as happy without weed. After just a few weeks I understood that all it did was make my mind foggy and take away my time. Recently I became very intrigued by crypto currencies and it boggled my mind how bulletproof Bitcoin seemed to me. I do believe it can be a major asset in the future and if not Bitcoin it self it’ll at least pave the way for the others. </p>\n\n<p>So I’ve decided I will now take all the money I save from not smoking anymore and put it into Bitcoin mostly and other cryptos and stocks. I will do so by DCA and I’m so excited to see where this goes. I hope this post can maybe point other young adults in the same direction and to be smarter with your money.</p>\n</div><!-- SC_ON -->",
  "score": 1565,
  "permalink": "/r/Bitcoin/comments/lkeczs/turning_weed_my_addiction_into_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "lkeczs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728613348
}