{
  "author": "historiagrephour",
  "original_created_utc": 1634724014,
  "title": "MEGATHREAD | Day Two of the AskHistorians 2021 Digital Conference | \"[Deleted] & Missing History: Reconstructing the Past, Confronting Distortions\"",
  "created_utc": 1634744723,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to Day Two of the AHDC 2021!</p>\n\n<p>We hope that you enjoyed our first day&#39;s offerings. You can catch up on any panels you may have missed via our <a href=\"https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww\">YouTube channel</a>, while the questions and answers from our first three panel AMA threads (<a href=\"https://www.reddit.com/r/AskHistorians/comments/qbdy27/the_lie_became_the_truth_locating_trans/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">here</a>, <a href=\"https://www.reddit.com/r/AskHistorians/comments/qbgj7f/racism_is_so_universal_its_become_normal_race/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">here</a>, and <a href=\"https://www.reddit.com/r/AskHistorians/comments/qbls5e/players_gonna_play_play_play_play_play_history_in/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">here</a>) are sure to provide some fantastic reading material. We will also be hosting Dr. Devon Mihesuah&#39;s <a href=\"http://www.askhistorians.com/2021-keynote\">keynote address</a> this morning at 11 AM EDT and releasing the recording of it as soon as we&#39;re able. Keep an eye on this space and register <a href=\"https://us02web.zoom.us/webinar/register/6516340505394/WN_cNNfK79IQWeTqj5O9SnVAQ\">here</a> if you haven&#39;t already!</p>\n\n<p>Today, there will be even more to see. We premiered three more panels yesterday evening whose Q&amp;A AMAs will go live over the course of the day. We also have two more networking sessions scheduled for this morning and evening as well.</p>\n\n<p>Again, check out our <a href=\"https://www.yumpu.com/en/document/read/65910401/ahdc-2021-program\">conference program</a>  if you are interested in the history of the AskHistorians conference, its background, rationale, and the details of this year&#39;s event (including information about the participants, papers, and panels), please check out.</p>\n\n<p>This thread contains an overview of today&#39;s events, with direct links added as soon as they go live, and an explanation of how to get involved. If you have any questions, leave them below and we&#39;ll address them as soon as possible.</p>\n\n<h1>Today&#39;s Schedule</h1>\n\n<p><strong>Networking Session Three (8 AM EDT): Trivia with AskHistorians</strong></p>\n\n<ul>\n<li>Register <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a></li>\n</ul>\n\n<p><strong>Panel Four AMA (9 AM EDT):</strong> <a href=\"https://www.askhistorians.com/asian-perspectives\">&quot;All Aboard the Orient&#39;s Expression: Reclaiming Asian Perspectives and Identity in the Age of Imperialism&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/iveebQf64UU\">Panel Recording</a>- Watch now!</li>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/qbyxe4/all_aboard_the_orients_expression_reclaiming/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">AMA Thread</a> - Go ask a question!</li>\n</ul>\n\n<p><strong>Keynote Address (11 AM EDT):</strong> <a href=\"https://www.askhistorians.com/2021-keynote\">&quot;Ned Christie and the Consequences of Fake News&quot;</a> by Dr. Devon Mihesuah of the University of Kansas</p>\n\n<ul>\n<li>Register for the live Zoom event <a href=\"https://us02web.zoom.us/webinar/register/6516340505394/WN_cNNfK79IQWeTqj5O9SnVAQ\">here</a></li>\n<li>Recording - (pending)</li>\n</ul>\n\n<p>Following yesterday&#39;s force majeure of our keynote speaker&#39;s internet going down, we will be presenting this year&#39;s keynote address this morning at 11 AM EDT instead. If you haven&#39;t already registered, you can do so at the link above!</p>\n\n<p><strong>Panel Five AMA (3 PM EDT):</strong> <a href=\"https://www.askhistorians.com/womens-agency\">&quot;I Make the Governor Call Me Governor: Rewriting the History of Women&#39;s Agency&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/ExyeAvc_wWY\">Panel Recording</a> - Watch now!</li>\n<li>AMA Thread - (pending)</li>\n</ul>\n\n<p><strong>Day Three Panel Livestreams (5 PM EDT)</strong></p>\n\n<ul>\n<li>Livestreams Thread - (pending)</li>\n</ul>\n\n<p><strong>Panel Three AMA (7 PM EDT):</strong> <a href=\"https://www.askhistorians.com/violence\">&quot;Never Forgotten, Never Again: Recentering Narratives of Historical Violence&quot;</a></p>\n\n<ul>\n<li><a href=\"https://youtu.be/ccQPsJRV-UE\">Panel Recording</a> - Watch now!</li>\n<li>AMA Thread - (pending)</li>\n</ul>\n\n<p><strong>Networking Session Four (9 PM EDT): Casual Networking</strong></p>\n\n<ul>\n<li>Register <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a></li>\n</ul>\n\n<h1>How to Participate</h1>\n\n<p><strong>Watch talks:</strong> The central feature of the conference is its collection of recorded talks. These talks have been divided into nine panels of 2–3 speakers, each taking ten minutes to present on their own research before joining in a group discussion with their fellow panelists and an expert moderator. Today&#39;s panels were premiered as livestreams yesterday evening and can now be found on our <a href=\"https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww\">YouTube channel</a>. The recordings will be available indefinitely, so you can always go back and catch up on anything you may have missed!</p>\n\n<p><strong>Ask questions:</strong> Each panel will have its own AMA-style Q&amp;A thread where you can ask the speakers anything you&#39;d like to know about their work. These will go live according to the schedule posted above, and will continue as long as the participants feel like answering more questions!</p>\n\n<p><strong>Attend live events:</strong> Although our conference panels have all been pre-recorded, they will be premiered at 5 PM EDT as livestreamed talks on YouTube the evening before their associated AMA (hence, Panels Four, Five, and Six were livestreamed yesterday evening, and Panels Seven, Eight, and Nine will be livestreamed today at 5 PM EDT). Once they have been premiered, they will be made available indefinitely on the AskHistorians YouTube channel.</p>\n\n<p>Throughout the conference, we will also be hosting live networking sessions for participants and audience members to attend. There will be one networking session focused on talking shop about all things history and one social session focused on chatting and getting to know fellow guests each day.</p>\n\n<p>Last night, we hosted our first-ever AskHistorians Trivia Night. This morning, we&#39;re doing it again.  If you&#39;ve ever been to pub trivia and thought &quot;Damn, I wish I had a historian on my team&quot;, here&#39;s your chance: today&#39;s social session at 8 AM EDT is AskHistorians Trivia hosted by <a href=\"/u/Starwarsnerd222\">u/Starwarsnerd222</a> and <a href=\"/u/Kugelfang52\">u/Kugelfang52</a>. If scavenger hunting is more your cup of tea, though, then you&#39;ll want to join us for tomorrow&#39;s social session at 1 PM EDT!  Find all 12 hidden items for your chance to win conference merch!</p>\n\n<p>You are welcome to register for and attend as many of our networking and social sessions as you like. A full list of these events, and information about registering, can bee found <a href=\"https://www.reddit.com/r/AskHistorians/comments/q6q88l/registration_is_open_for_askhistorians_digital/?utm_medium=android_app&amp;utm_source=share\">here</a>.</p>\n\n<p><strong>Be a part of the conversation:</strong> We&#39;ll be treating these daily conference megathreads like our Friday Free-for-Alls: you&#39;re welcome to use them to discuss the conference, leave questions or comments, or chat informally about today&#39;s papers in this thread. Keep in mind, though, that our rules about civility are still very much in force. You can also follow updates on Twitter via <a href=\"http://twitter.com/askhistorians\">@askhistorians</a> and #AHDC2021. We encourage you to tweet about our conference as well if you&#39;d like. Just remember to tag us and use the #AHDC2021 hashtag!</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/qbxd87/megathread_day_two_of_the_askhistorians_2021/",
  "subreddit": "AskHistorians",
  "id": "qbxd87",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Welcome to Day Two of the AHDC 2021!\n\nWe hope that you enjoyed our first day's offerings. You can catch up on any\npanels you may have missed via our YouTube channel\n[https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww], while the questions\nand answers from our first three panel AMA threads…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "AHDC 2021の2日目にようこそ!\n\n初日の内容はお楽しみいただけましたでしょうか？ご覧になれなかったパネルは\nご覧になれなかったパネルは、YouTubeチャンネル\n[https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww]でご覧いただけます。\nまた、最初の3つのパネルのAMAスレッドからの質問と回答は...",
      "title": "MEGATHREAD｜AskHistorians 2021 デジタルカンファレンス2日目｜「【削除】＆【消えた歴史】。過去を再構築し、歪曲に立ち向かう\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "欢迎来到AHDC 2021的第二天!\n\n我们希望你喜欢我们第一天的内容。你可以通过我们的YouTube频道了解任何\n你可以通过我们的YouTube频道了解你可能错过的任何小组讨论\n[https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww]，而问题\n我们前三个小组的问题和答案......",
      "title": "访谈｜\"询问历史学家 \"2021年数字会议的第二天｜\"[删除]和失踪的历史。重构过去，对抗扭曲\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歡迎來到AHDC 2021的第二天!\n\n我們希望你喜歡我們第一天的內容。你可以通過我們的YouTube頻道瞭解任何\n你可以通過我們的YouTube頻道瞭解你可能錯過的任何小組討論\n[https://www.youtube.com/channel/UCJudPwztZyg2BQjhetw_bww]，而問題\n我們前三個小組的問題和答案......",
      "title": "訪談｜\"詢問歷史學家 \"2021年數字會議的第二天｜\"[刪除]和失蹤的歷史。重構過去，對抗扭曲\""
    }
  ]
}