{
  "author": "random_hexadecimal",
  "original_created_utc": 1650910062,
  "title": "Before Fleming's accidental discovery of penicillin in 1928, was bread mold a \"folk remedy\" for treating wounds at home?",
  "created_utc": 1650922293,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The title is the TL;DR, but I&amp;#39;ll also add my personal interest in this question (a family legend), and some preliminary Googling that makes me believe this is plausible.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;My grandfather was born in 1906 in Poland (bordering Russia, so sometimes Russia, but that&amp;#39;s another story.) It was a tiny subsistence farming village. My grandfather barely attended some elementary school and then worked on the family farm before emigrating to the USA just after WW1.&lt;/p&gt;\n\n&lt;p&gt;There was no modern medicine or medical education in this rural area, but my grandfather described an interesting folk remedy for wounds on the farm. Basically, his family had a large wooden bowl that was designated for mixing and kneading bread dough. It was never washed or even scraped clean, never used for anything but bread, and it was used a LOT (poor farming family, so something like 14 siblings, parents and assorted uncles and aunts). No one knows where the tradition came from, but when there was an injury with a open wound-- say, my grandfather fell and a stone scraped his shin or knee badly enough to bleed-- the others would take a sharp spoon, scrape out a spoonful of the old dried-out layers of residue in the bowl, and create a poultice out of it.&lt;/p&gt;\n\n&lt;p&gt;When penicillin was discovered a decade or two later, my grandfather was like, &amp;quot;ha! We knew about penicillin on the farm long before that.&amp;quot; And often repeated this story to illustrate that modern medicine sometimes &amp;quot;discovers&amp;quot; health information already known in folk remedies.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So I was reading more about the discovery of penicillin on the web, and almost every website repeats the familiar story about Fleming. He goes away on holiday, leaves a window open, returns to find mold growing on some of his petri dishes, and then notices that the petri dishes with mold appear to have inhibited the growth of the staph bacteria he was cultivating. &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t find much information about what if anything was known prior to this, but there are some suggestive sentences. For instance, from the &lt;a href=\"https://en.wikipedia.org/wiki/Penicillin#Discovery\"&gt;Wikipedia article on Penicillin (Discovery subsection)&lt;/a&gt;:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Starting in the late 19th century there had been reports of the antibacterial properties of Penicillium mould, but scientists were unable to discern what process was causing the effect.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The citation for this sentence is: Dougherty TJ, Pucci MJ (2011). Antibiotic Discovery and Development. Springer Science &amp;amp; Business Media. pp. 79–80.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I do not have access to the full text, so my easiest question is whether someone with access can provide the context in that text? &lt;/p&gt;\n\n&lt;p&gt;More generally, I&amp;#39;d be interested in any other sources on mold being used in &amp;quot;folk medicine&amp;quot; prior to 1928. If anyone out there has expert knowledge on this esoteric question, I would be delighted. I know the rest of my family would be delighted to learn more, too, as this is one of the more intriguing bits of family apocrypha.&lt;/p&gt;\n\n&lt;p&gt;Thank you for any information or sources you might be able to share about this topic.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/askscience/comments/ubrekq/before_flemings_accidental_discovery_of/",
  "subreddit": "askscience",
  "id": "ubrekq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The title is the TL;DR, but I'll also add my personal interest in this question\n(a family legend), and some preliminary Googling that makes me believe this is\nplausible.\n\n\n\nMy grandfather was born in 1906 in Poland (bordering Russia, so sometimes\nRussia, but that's another story.) It was a tiny…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルがTL;DRですが、この質問に対する私の個人的な関心事\n(という個人的な興味と、事前にググってみたところ、これはありそうだということで\nということです。\n\n\n\n私の祖父は1906年にポーランド（ロシアと国境を接しているので、時々\nロシアですが、それはまた別の話です)。それは小さな...",
      "title": "1928年にフレミングが偶然ペニシリンを発見する以前は、家庭で傷を治すための「民間療法」としてパンのカビが使われていたのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题是TL;DR，但我也要加上我个人对这个问题的兴趣\n(一个家族传说），以及一些初步的谷歌搜索，使我相信这是\n貌似合理的。\n\n\n\n我的祖父于1906年出生在波兰（与俄罗斯接壤，所以有时是\n俄罗斯，但这是另一个故事）。那是一个很小的...",
      "title": "在弗莱明于1928年意外发现青霉素之前，面包霉是一种在家中治疗伤口的 \"民间疗法 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題是TL;DR，但我也要加上我個人對這個問題的興趣\n(一個家族傳說），以及一些初步的谷歌搜索，使我相信這是\n貌似合理的。\n\n\n\n我的祖父於1906年出生在波蘭（與俄羅斯接壤，所以有時是\n俄羅斯，但這是另一個故事）。那是一個很小的...",
      "title": "在弗萊明於1928年意外發現青黴素之前，麪包黴是一種在家中治療傷口的 \"民間療法 \"嗎？"
    }
  ]
}