{
  "author": "Candy-Horrorh3lp",
  "original_created_utc": 1641795297,
  "title": "Just found out my best friends bf does not wipe, should I tell her?",
  "created_utc": 1641812037,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My best friend is incredibly nice, too nice for her own good. She has stayed with her bf (let’s call him Ned) who has cheated on her twice, because she can’t break up. He also smells HORRRID. Like really really awful. While hanging out with one of his friends he told that Ned does not wipe after going #2. I thought he was joking but he told me it’s because Ned thinks it’s “gay” to do so… Ned legitimately thinks that wiping his butt is gay. Considering half of our friend group is gay it was news to me. What does this mean about Ned, and should I tell my friend?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/s0d0qu/just_found_out_my_best_friends_bf_does_not_wipe/",
  "subreddit": "TooAfraidToAsk",
  "id": "s0d0qu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "My best friend is incredibly nice, too nice for her own good. She has stayed\nwith her bf (let’s call him Ned) who has cheated on her twice, because she can’t\nbreak up. He also smells HORRRID. Like really really awful. While hanging out\nwith one of his friends he told that Ned does not wipe after…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の親友は信じられないほどいい人で、いい人すぎるくらいです。彼女は\n2回も浮気をした彼（ネッドと呼びましょう）と一緒にいるのは、彼女が\n別れる。彼はまた、HORRRIDのにおいがします。本当にひどい。一緒にいる間\n彼の友人と話したところでは、ネッドは拭き掃除をしないそうです。",
      "title": "私の親友のボーイフレンドがおしっこをしないことがわかったのですが、彼女に言うべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最好的朋友是令人难以置信的好人，对她自己来说太好。她一直和她的男朋友（我们叫他内德）在一起。\n她和她的男朋友（让我们称他为内德）在一起，后者已经欺骗了她两次，因为她不能\n分手。他还闻起来很可怕。就像真的非常糟糕。在和他的一个朋友出去玩的时候\n他的一个朋友告诉他，内德在做完手术后并不擦拭......",
      "title": "刚刚发现我最好的朋友的男朋友不擦拭，我应该告诉她吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最好的朋友是令人難以置信的好人，對她自己來說太好。她一直和她的男朋友（我們叫他內德）在一起。\n她和她的男朋友（讓我們稱他爲內德）在一起，後者已經欺騙了她兩次，因爲她不能\n分手。他還聞起來很可怕。就像真的非常糟糕。在和他的一個朋友出去玩的時候\n他的一個朋友告訴他，內德在做完手術後並不擦拭......",
      "title": "剛剛發現我最好的朋友的男朋友不擦拭，我應該告訴她嗎？"
    }
  ]
}