{
  "author": "UnexperiencedIT",
  "original_created_utc": 1645010225,
  "title": "I don't have an exit strategy. When the price goes down I just stand by, check the price from time to time and literally do nothing.",
  "created_utc": 1645022196,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, don&amp;#39;t be like me. You should always have an exit strategy.&lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t. I also actually never sold for any profit. &lt;/p&gt;\n\n&lt;p&gt;I came to the point where I would check prices of the coins I hold once in a week. And I would be like &amp;quot;&lt;em&gt;aaahh, it is going down, I am already at loss...well guess I will have to wait&lt;/em&gt;&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;And then I just wait and HODL. &lt;/p&gt;\n\n&lt;p&gt;It happened so many times to me that I lost that feeling of adrenaline when the price goes up or down. &lt;/p&gt;\n\n&lt;p&gt;I missed some good profits that way, but I don&amp;#39;t have a crystal ball where I would see the future. Still, I see my mistakes and will try to learn on them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 504,
  "permalink": "/r/CryptoCurrency/comments/stthta/i_dont_have_an_exit_strategy_when_the_price_goes/",
  "subreddit": "CryptoCurrency",
  "id": "stthta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First of all, don't be like me. You should always have an exit strategy.\n\nBut I don't. I also actually never sold for any profit.\n\nI came to the point where I would check prices of the coins I hold once in a\nweek. And I would be like \"aaahh, it is going down, I am already at loss...well\nguess I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、私のようにならないように。常に出口戦略を持っているべきです。\n\nでも、私はそうしない。また、実は利益確定売りもしたことがありません。\n\n保有するコインの価格は、1回に1回チェックする程度になりました。\n週間。で、「あ～あ、下がってるなぁ、もう損してるなぁ...う～ん」みたいな。\nと思う",
      "title": "出口戦略がないんです。価格が下がったら、私はただ待機し、時々価格をチェックし、文字通り何もしない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，不要像我一样。你应该总是有一个退出策略。\n\n但我没有。实际上我也从未卖出过任何利润。\n\n我到了这样的地步：我每星期会检查一次我所持有的硬币的价格。\n一周一次。我就会说：\"啊，它在下跌，我已经亏损了......嗯\n我想我...",
      "title": "我没有一个退出策略。当价格下跌时，我只是站在一旁，不时地检查价格，实际上什么都不做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，不要像我一樣。你應該總是有一個退出策略。\n\n但我沒有。實際上我也從未賣出過任何利潤。\n\n我到了這樣的地步：我每星期會檢查一次我所持有的硬幣的價格。\n一週一次。我就會說：\"啊，它在下跌，我已經虧損了......嗯\n我想我...",
      "title": "我沒有一個退出策略。當價格下跌時，我只是站在一旁，不時地檢查價格，實際上什麼都不做。"
    }
  ]
}