{
  "author": "lesbiansexparty",
  "the_new_excerpt": "6/20/2021\n\nColleges have seen an increase in optional test taking. the test prep industry\nis increasing anyway. more than 1,500 accredited schools are taking steps to\nreduce test requirements to near zero by fall admissions 2022.\n[https://finance.yahoo.com/news/college-board-standardized-testing…",
  "original_created_utc": 1624231622,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "6/20/2021\n\n大学では選択式のテストを受ける人が増えています。\n1,500校以上の認定校が、テストの必要性を最小限に抑えるための措置を講じています。\n500以上の認定校が、2022年秋の入学試験までにテストをほぼゼロにするための措置をとっています。\n[https://finance.yahoo.com/news/college-board-standardized-testing...",
      "title": "来週のマーケットニュース"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "6/20/2021\n\n大学已经看到了可选考试的增加。\n1,500多所经认证的学校正在采取措施，以便\n到2022年秋季入学时将考试要求降至接近零。\n[https://finance.yahoo.com/news/college-board-standardized-testing...",
      "title": "未来一周的市场新闻。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "6/20/2021\n\n大學已經看到了可選考試的增加。\n1,500多所經認證的學校正在採取措施，以便\n到2022年秋季入學時將考試要求降至接近零。\n[https://finance.yahoo.com/news/college-board-standardized-testing...",
      "title": "未來一週的市場新聞。"
    }
  ],
  "title": "market news for this coming week.",
  "created_utc": 1624247105,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>6/20/2021</p>\n\n<p><a href=\"https://finance.yahoo.com/news/college-board-standardized-testing-college-131709942.html\">Colleges have seen an increase in optional test taking. the test prep industry is increasing anyway. more than 1,500 accredited schools are taking steps to reduce test requirements to near zero by fall admissions 2022.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/news/workers-are-quitting-at-historic-rates-180539760.html\">food and energy prices should rise by 3% this year and 2.1% next year. GDP rising by 7% and the fed wants to raise interest rates twice by 2023.</a></p>\n\n<p>reopening will cause demand spikes in already inflated goods such as oil and automobiles. inflation is a problem we must keep an eye out for as any contributing factors may push for a burst.</p>\n\n<p><a href=\"https://finance.yahoo.com/quote/AMZN?p=AMZN&amp;.tsrc=fin-srch\">Amazon prime day</a> starts June 21st at midnight. only open to prime members, prime members have shown to increase their purchasing through amazon often redirecting any purchases to the platform or simply buying more products after shelling out the $119 dollars for the year to take advantage of deals and savings and ensure that they do not miss out on any. amazon saw record breaking sales during the previous holiday shopping season. they are projecting 8.4bn revenue this year compared to 7.5bn the year prior. prime day comes early this year in an effort to avoid conflicting with the Tokyo summer Olympics so shoppers can focus solely on consumerism. amazon has risen 7% YTD underperforming the SandP500 index rise of 11%. there is potential for a increase in the yearly membership cost of prime to increase.</p>\n\n<p>Earnings coming out this week</p>\n\n<p>Tuesday- PLUG</p>\n\n<p>Thursday- DRI/FDX/NKE</p>\n\n<p>Friday- KMX</p>\n\n<p><a href=\"https://money.yahoo.com/workers-are-quitting-at-historic-rates-180539760.html\">4 million workers have quit their job recently. this is the highest rate in 20 years. this could continue as employers are competing for workers and employees are seeking better working environments with better benefits and wages.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/news/restaurants-confused-frustrated-after-lawsuit-brings-sba-grants-to-screeching-halt-141554497.html\">Restaurants are receiving some kind of thing from the government.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/m/b5dfda43-9c34-37a9-bfd9-4bcc40a9b5c5/oil-bulls-are-dancing-in-the.html\">oil prices have risen above 70 per barrel.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/news/states-offer-return-to-work-bonuses-for-unemployed-workers-184139591.html\">some states are offering workers $2,000 sign on bonuses for starting new jobs. Montana, new Hampshire, Arizona, and Oklahoma are among these states. The idea is to pay for returning to work in order to boost the economy rather than pay for people to stay home as vaccines have been rolling out quite well and there is less of a need for isolation and more need for returning to work. each state has its own individual guidelines for how they are handling this effort.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/FDX?p=FDX&amp;.tsrc=fin-srch\">FDX declared a dividend increase this month.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/GC=F?p=GC=F&amp;.tsrc=fin-srch\">gold fell 6% this week. the fed is not raising interest rates immediately and central banks are waiting on adequate signals to scale back asset purchases.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/m/fd0267c9-f7e6-33f4-8e64-5fbe4f61ec88/tesla-isn%E2%80%99t-the-only.html\">SandP500 index dividend yield has fallen in the past year. the energy sector has seen an increase in dividends. lidar companies are relatively new and show promise of enabling self driving vehicles. lidar is laser based radar. AEye is merging with SPAC CF Finance Acquisition III (CFAC). valued at $2Bn based on outstanding shares after the merger. Target profit margin of 31% by 2025.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/YM%3DF?p=YM%3DF\">The dow jones industrial average posted its biggest weekly decline since October.</a></p>\n\n<p>Tech stocks are a favorite for hedge fund managers. they have strong business models and are good amid reopening with demand for product. most don&#39;t appear to have any concern over inflation and will write if off as a short term hurdle. companies in the tech sector are looking for ways to leverage growth.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/precious-metals-energy-weekly-review-073316061.html\">Banks are bearish and indexes of the worlds largest banks and lenders are among the worst performers this month.</a></p>\n\n<p><a href=\"https://finance.yahoo.com/m/1454b713-6c90-3dc6-8a58-f4a8454a1dae/%E2%80%98i-am-so-relieved%E2%80%99%3A-people.html?.tsrc=fin-srch\">The supreme court ruled in favor of the ACA. around 31mm people are covered under the ACA.</a></p>\n\n<p>IT companies are seeing tech workers leave to seek better opportunities. new hires are mostly rep-lacing recent employees. recent surveys approximate a 30% chance of IT workers to seek out new employment in the coming months. Employees in other fields are also looking for new jobs with opportunities for advancement and better wages with benefits. some are searching for w0ork at home options as the pandemic has left people uneasy and less eager to socialize face to face.</p>\n\n<p>Let me know what your thoughts and feelings are for the coming week.</p>\n\n<p>Do you have any big moves to make?</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/investing/comments/o4htgx/market_news_for_this_coming_week/",
  "subreddit": "investing",
  "id": "o4htgx",
  "is_self": true,
  "media": null,
  "is_video": false
}