{
  "author": "EffectiveQuiet4125",
  "original_created_utc": 1636337400,
  "title": "In Tolstoy's \"Confession\" he says that he has committed every crime including murder, is there any evidence of this?",
  "created_utc": 1636361839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been wondering about it since I read the book a few months ago, I haven&#39;t been able to find anything about Tolstoy being a criminal or a murderer, It could simply be a turn of phrase or artistic license. I know that he served in the Russian army during the Caucasian War, maybe he&#39;s referring to something that happened then?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qp3n1f/in_tolstoys_confession_he_says_that_he_has/",
  "subreddit": "AskHistorians",
  "id": "qp3n1f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been wondering about it since I read the book a few months ago, I haven't\nbeen able to find anything about Tolstoy being a criminal or a murderer, It\ncould simply be a turn of phrase or artistic license. I know that he served in\nthe Russian army during the Caucasian War, maybe he's referring to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前にこの本を読んだときから気になっていたのですが、何も見つけられませんでした。\nトルストイが犯罪者や殺人者であるという情報は見つけられませんでした。\nそれは単に言い回しや芸術的センスの問題かもしれません。彼がロシア軍に所属していたことは知っています。\nコーカサス戦争でロシア軍に従軍していたことは知っていますが、もしかしたら彼が言っているのは...",
      "title": "トルストイの「告白」では、自分は殺人を含むあらゆる犯罪を犯したと言っていますが、その証拠はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从几个月前我读了这本书后，我一直在想这个问题。\n我没能找到任何关于托尔斯泰是罪犯或杀人犯的资料。\n这可能只是一个短语的转折或艺术许可。我知道他在高加索战争期间曾在\n我知道他在高加索战争期间在俄罗斯军队服役，也许他指的是......",
      "title": "在托尔斯泰的《忏悔录》中，他说他犯了包括谋杀在内的所有罪行，这有什么证据吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從幾個月前我讀了這本書後，我一直在想這個問題。\n我沒能找到任何關於托爾斯泰是罪犯或殺人犯的資料。\n這可能只是一個短語的轉折或藝術許可。我知道他在高加索戰爭期間曾在\n我知道他在高加索戰爭期間在俄羅斯軍隊服役，也許他指的是......",
      "title": "在托爾斯泰的《懺悔錄》中，他說他犯了包括謀殺在內的所有罪行，這有什麼證據嗎？"
    }
  ]
}