{
  "author": "CoatAny1468",
  "original_created_utc": 1648897958,
  "title": "No more privacy for bitcoin users in Europe",
  "created_utc": 1648960805,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EU Parliament Passes Privacy-Busting Crypto Rules Despite Industry Criticism&lt;/p&gt;\n\n&lt;p&gt;Lawmakers are set to end even the smallest anonymous crypto transactions, and plan measures that could see unregulated exchanges cut off.&lt;/p&gt;\n\n&lt;p&gt;European Union lawmakers voted today in favor of controversial measures to outlaw anonymous crypto transactions, a move the industry said would stifle innovation and invade privacy.&lt;/p&gt;\n\n&lt;p&gt;More than 90 lawmakers voted in favor of the proposal, according to documents seen by CoinDesk.&lt;/p&gt;\n\n&lt;p&gt;The proposals are intended to extend anti-money laundering (AML) requirements that apply to conventional payments over EUR 1,000 ($1,114) to the crypto sector. They also scrap the floor for crypto payments, so payers and recipients of even the smallest crypto transactions would need to be identified, including for transactions with unhosted or self-hosted wallets. Further measures under discussion could see unregulated crypto exchanges cut off from the conventional financial system.&lt;/p&gt;\n\n&lt;p&gt;National governments said in December they wanted to scrap the EUR 1,000 threshold for crypto, on the basis that digital payments can easily circumvent the limit, and to include private wallets that aren’t operated by regulated crypto asset providers.\nThis is trash, truth be told. We need Web3 platforms like Point Network to focus more on privacy so that we will see how this type of rule works. &lt;/p&gt;\n\n&lt;p&gt;Members of the center-right European People&amp;#39;s Party (EPP) opposed many of the more controversial changes, condemning what they called a “de facto ban of self-hosted wallets.”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/Bitcoin/comments/tugh06/no_more_privacy_for_bitcoin_users_in_europe/",
  "subreddit": "Bitcoin",
  "id": "tugh06",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "EU Parliament Passes Privacy-Busting Crypto Rules Despite Industry Criticism\n\nLawmakers are set to end even the smallest anonymous crypto transactions, and\nplan measures that could see unregulated exchanges cut off.\n\nEuropean Union lawmakers voted today in favor of controversial measures to\noutlaw…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EU議会、業界の批判にもかかわらず、プライバシーを侵害する暗号化規則を可決\n\n議員たちは、最小限の匿名暗号取引さえも廃止する方向だ。\nは、未規制の取引所が遮断される可能性のある措置を計画しています。\n\n欧州連合（EU）の議員たちは本日、以下のような物議を醸す法案に賛成票を投じた。\n非合法化...",
      "title": "欧州のビットコインユーザーのプライバシーはもうない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "欧盟议会不顾业界的批评，通过了破坏隐私的加密货币规则\n\n立法者将结束甚至是最小的匿名加密货币交易，并计划采取措施，可能会看到一个新的加密货币。\n计划采取的措施，可能会看到不受监管的交易所被切断。\n\n欧盟立法者今天投票支持有争议的措施，即\n剥夺了......",
      "title": "欧洲的比特币用户再无隐私可言"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歐盟議會不顧業界的批評，通過了破壞隱私的加密貨幣規則\n\n立法者將結束甚至是最小的匿名加密貨幣交易，並計劃採取措施，可能會看到一個新的加密貨幣。\n計劃採取的措施，可能會看到不受監管的交易所被切斷。\n\n歐盟立法者今天投票支持有爭議的措施，即\n剝奪了......",
      "title": "歐洲的比特幣用戶再無隱私可言"
    }
  ]
}