{
  "author": "deathtolucky",
  "original_created_utc": 1640729903,
  "title": "If you find it difficult to take profits when things are going up, don’t despair. Nothing has changed in over 300 years. Let me introduce you to “The Mississippi Bubble”",
  "created_utc": 1640766786,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In 1717 the Mississippi Company, chartered in France, set out to colonize the lower Mississippi valley, establishing the city of New Orleans in the process. To finance it’s ambitious plans, the company, which had good connections at the court of King Louis XV, sold shares on the Paris stock exchange. &lt;/p&gt;\n\n&lt;p&gt;In 1717 the lower Mississippi valley offered few attractions besides seasons and alligators, yet the Mississippi Company spread tales of fabulous riches and boundless opportunities. French aristocrats, businessmen and other members of the bourgeoisie fell for those fantasies, and Mississippi share prices SKYROCKETED. &lt;/p&gt;\n\n&lt;p&gt;Initially, shares were offered at 500 livres apiece. Two years later on August 1st, 1719, shares traded at 2,750 livres. By the end of the month, they had nearly 2x and traded at 4,100 livres. Less than a week later, they shot up to 5k livres. By December, they had pumped to 10k livres per share and euphoria swept the streets of Paris. Instead of people taking profits and enjoying their gains, people sold ALL their possessions and took out huge loans to buy Mississippi shares. Everyone believed they had found their rocket to the moon. &lt;/p&gt;\n\n&lt;p&gt;In early December, the panic began. Speculators realized that share prices were totally unrealistic and unsustainable. People started selling and an avalanche ensued. In order to stabilize prices, the central bank of France bought up Mississippi shares, but it could not do so forever. Eventually it ran out of money. So what did they do? What banks do best; they printed more money. The entire French financial system was placed within a bubble and while big speculators got out in time, the small investors lost everything. &lt;/p&gt;\n\n&lt;p&gt;The moral of the story? FOMO has existed since the beginning of capitalism, taking profits is hard to do when everything is only going up, banks will win more often than not because they write the rules and if you’re a small fish in a big pond, nobody is gonna look out for your best interests except for you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/rqrb0c/if_you_find_it_difficult_to_take_profits_when/",
  "subreddit": "CryptoCurrency",
  "id": "rqrb0c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In 1717 the Mississippi Company, chartered in France, set out to colonize the\nlower Mississippi valley, establishing the city of New Orleans in the process.\nTo finance it’s ambitious plans, the company, which had good connections at the\ncourt of King Louis XV, sold shares on the Paris stock…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1717年、フランスで設立されたミシシッピ・カンパニーが植民地化のために出発した。\nミシシッピ川下流域にニューオリンズを建設した。\nこの野心的な計画の資金を調達するため、ミシシッピーグループは\nルイ15世の宮廷は、パリの株式市場で株を売り出し、...",
      "title": "上昇時に利益を出すのが難しいと感じている方も、絶望することはありません。300年以上前から何も変わっていないのだから。\"ミシシッピーバブル \"を紹介しよう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1717年，在法国注册的密西西比公司开始在密西西比河下游进行殖民开发。\n密西西比河下游流域，在此过程中建立了新奥尔良市。\n为了资助其雄心勃勃的计划，该公司在路易十五国王的宫廷里有很好的关系。\n为了资助其雄心勃勃的计划，该公司在路易十五国王的宫廷中拥有良好的关系，在巴黎证券交易所出售股票...",
      "title": "如果你发现在事情上升的时候很难获利，不要绝望。300多年来，一切都没有改变。让我向你介绍 \"密西西比州的泡沫\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1717年，在法國註冊的密西西比公司開始在密西西比河下游進行殖民開發。\n密西西比河下游流域，在此過程中建立了新奧爾良市。\n爲了資助其雄心勃勃的計劃，該公司在路易十五國王的宮廷裏有很好的關係。\n爲了資助其雄心勃勃的計劃，該公司在路易十五國王的宮廷中擁有良好的關係，在巴黎證券交易所出售股票...",
      "title": "如果你發現在事情上升的時候很難獲利，不要絕望。300多年來，一切都沒有改變。讓我向你介紹 \"密西西比州的泡沫\""
    }
  ]
}