{
  "author": "FractalImagination",
  "original_created_utc": 1634602221,
  "title": "I have 21 bitcoins, and one day, so can you.",
  "created_utc": 1634610647,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started trading in 2018.. didn&#39;t have enough money to buy much so I started investing in low cap coins. Lost a bunch of money but eventually I invested in one that gave me 20,000X my investment over the course of a few years. </p>\n\n<p>I took my profits and bought bitcoin with it.. I could believe I just bought 21 bitcoins.. the possibilities were endless.. I cried tears of happiness. </p>\n\n<p>Since this was a huge amount, I decided I needed I needed to store it somewhere.. I searched the internet, dodging shady hardware wallet deals .. and eventually I found the perfect place to store them.. </p>\n\n<p>In my imagination, where they have always been. </p>\n\n<p>Psych</p>\n</div><!-- SC_ON -->",
  "score": 295,
  "permalink": "/r/CryptoCurrency/comments/qazix3/i_have_21_bitcoins_and_one_day_so_can_you/",
  "subreddit": "CryptoCurrency",
  "id": "qazix3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I started trading in 2018.. didn't have enough money to buy much so I started\ninvesting in low cap coins. Lost a bunch of money but eventually I invested in\none that gave me 20,000X my investment over the course of a few years.\n\nI took my profits and bought bitcoin with it.. I could believe I just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2018年に取引を開始しました...あまり購入するための十分な資金を持っていなかったので、私は開始しました。\nローキャップコインへの投資を始めました。たくさんのお金を失いましたが、最終的に投資したのは\n数年かけて投資額の2万倍になったものがあります。\n\nその利益でビットコインを購入しました。自分でも信じられないくらい...",
      "title": "私は21ビットコインを持っていますが、ある日、あなたもそうなるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2018年开始交易。没有足够的钱买很多东西，所以我开始\n投资于低市值的硬币。损失了一堆钱，但最终我投资了\n在几年的时间里给我带来了20,000倍的投资。\n\n我拿着我的利润，用它买了比特币。我可以相信我只是...",
      "title": "我有21个比特币，而有一天，你也可以。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2018年開始交易。沒有足夠的錢買很多東西，所以我開始\n投資於低市值的硬幣。損失了一堆錢，但最終我投資了\n在幾年的時間裏給我帶來了20,000倍的投資。\n\n我拿着我的利潤，用它買了比特幣。我可以相信我只是...",
      "title": "我有21個比特幣，而有一天，你也可以。"
    }
  ]
}