{
  "author": "Vladith",
  "original_created_utc": 1659035970,
  "title": "Medieval Turkic peoples like the Seljuks, Khazars, and Cumans were descendants of Asian nomads who entered Europe and the Middle-East after centuries of interaction with the Chinese Empire. What role did China play in the folklore or cultural memory of medieval and early modern Turkic peoples?",
  "created_utc": 1659071537,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From what I understand, all literate peoples in medieval Europe and the Middle East were aware of China, even if direct contact between Chinese people and western-Eurasians was quite rare. Was the image of China more vivid in the minds of nomadic peoples whose ancestors had interacted with China, and may even have served as mercenaries or subjects of Chinese emperors?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/wainl0/medieval_turkic_peoples_like_the_seljuks_khazars/",
  "subreddit": "AskHistorians",
  "id": "wainl0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From what I understand, all literate peoples in medieval Europe and the Middle\nEast were aware of China, even if direct contact between Chinese people and\nwestern-Eurasians was quite rare. Was the image of China more vivid in the minds\nof nomadic peoples whose ancestors had interacted with China,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、中世ヨーロッパと中世のすべての識字民族は\n中国人と西洋・ユーラシア人が直接接触することはなかったとしても、中世ヨーロッパと中東のすべての文人は中国を意識していたようです。\n中世ヨーロッパ、中近東の文人たちは、中国を意識していたと思う。中世ヨーロッパ・中近東の遊牧民の頭の中では、中国のイメージはもっと鮮明だったのだろうか。\n先祖が中国と交流のあった遊牧民は、より鮮明に中国をイメージしていたのだろうか......。",
      "title": "セルジューク、ハザール、クマンなど中世のトルコ系民族は、アジアの遊牧民の子孫で、何世紀にもわたる中華帝国との交流を経てヨーロッパと中東に入り込んだ人々である。中世・近世のトルコ系民族の民俗学や文化的記憶において、中国はどのような役割を担っていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，中世纪的欧洲和中世纪的所有识字的人都是如此。\n都知道中国，尽管中国人和西方欧亚人之间的直接接触相当少。\n西方欧亚人之间的直接接触是相当罕见的。中国的形象在那些祖先曾与之交往的游牧民族心中是否更加鲜明？\n中国的形象在其祖先曾与中国交往过的游牧民族心中是否更加鲜明？",
      "title": "中世纪的突厥人，如塞尔柱人、哈扎尔人和库曼人，是亚洲游牧民族的后裔，他们在与中华帝国交往了几个世纪后进入欧洲和中东地区。中国在中世纪和现代早期突厥人的民俗或文化记忆中发挥了什么作用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，中世紀的歐洲和中世紀的所有識字的人都是如此。\n都知道中國，儘管中國人和西方歐亞人之間的直接接觸相當少。\n西方歐亞人之間的直接接觸是相當罕見的。中國的形象在那些祖先曾與之交往的遊牧民族心中是否更加鮮明？\n中國的形象在其祖先曾與中國交往過的遊牧民族心中是否更加鮮明？",
      "title": "中世紀的突厥人，如塞爾柱人、哈扎爾人和庫曼人，是亞洲遊牧民族的後裔，他們在與中華帝國交往了幾個世紀後進入歐洲和中東地區。中國在中世紀和現代早期突厥人的民俗或文化記憶中發揮了什麼作用？"
    }
  ]
}