{
  "author": "Jayke9",
  "the_new_excerpt": "The reverse mullet token?\n\nBusiness in the front, party in the back er..uh I mean the other way around\n\nD0GIRA is all about creating gaming ecosystems via their SDKs they will be\ndeveloping throughout the Summer so they are all business...but in the back.\nRecently they had a memecoin front (the…",
  "original_created_utc": 1621100573,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "逆マレット・トークン？\n\n前にビジネス、後ろにパーティー......いや、その逆だ。\n\nD0GIRAは、SDKを介してゲームのエコシステムを構築することを目的としています。\nD0GIRAは、夏の間に開発するSDKを通じて、ゲームのエコシステムを構築することを目的としています。\n最近、彼らはmemecoinのフロント（...",
      "title": "ゲームの明るい未来。暗号が \"Pay-to-Win \"のパラダイムをどう変えるか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "反向木耳的标志？\n\n生意在前，聚会在后，呃，我是说反过来。\n\nD0GIRA是通过他们的SDK创建游戏生态系统的，他们将在整个夏天进行开发。\n他们将在整个夏天进行开发，所以他们都是在做生意......但在后面。\n最近，他们有一个memecoin的前台（the...",
      "title": "博彩业的光明前景。加密货币如何改变 \"付费赢 \"的模式"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "反向木耳的標誌？\n\n生意在前，聚會在後，呃，我是說反過來。\n\nD0GIRA是通過他們的SDK創建遊戲生態系統的，他們將在整個夏天進行開發。\n他們將在整個夏天進行開發，所以他們都是在做生意......但在後面。\n最近，他們有一個memecoin的前臺（the...",
      "title": "博彩業的光明前景。加密貨幣如何改變 \"付費贏 \"的模式"
    }
  ],
  "title": "Gaming’s Bright Future: How Crypto Can Change the Paradigm of “Pay-to-Win”",
  "created_utc": 1621107154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The reverse mullet token?</p>\n\n<p>Business in the front, party in the back er..uh I mean the other way around</p>\n\n<p>D0GIRA is all about creating gaming ecosystems via their SDKs they will be developing throughout the Summer so they are all business...but in the back. Recently they had a memecoin front (the party) but flipped that aound and are currently updating all sites with their new logo.</p>\n\n<p>Before  getting into recent news and an outlook into the future, a brief introduction about D0GIRA and the KEY points of the project:</p>\n\n<p>D0GIRA aims to bring the power of the blockchain to game developers and creators by providing unique gaming services, supported by an NFT Ecosystem. Through building a SDK/API’s for popular game engines, game  developers could use this services to enhance their games with native  blockchain elements or implement an Anti cheat technology based on  Blockchain-level verification, the possibilities are endless.Lead by an engineering team rooted in Blockchain, Gaming, and Cloud Service Development, $D0GIRA has everything in place to create a true utility token to shape the future of Invesment NFTs, and Blockchain Native  Gaming.</p>\n\n<p><strong>No Tokens for Vitalik Buterin</strong></p>\n\n<p>Re-frame  it as much as you want, it turned out using Vitalik Buterin as a “burn wallet” for a marketing stunt, wasn’t the greatest idea. As funny and  ridiculous it might seem at first, the underlying message of this sort  of actions, is far more serious. For an investor, the KEY question is: Is my investment secure and are the people in charge competent and professional?Well, let’s see what the lead developer of D0GIRA has  to say about this matter:” FYI, $D0GIRA never sent VB any tokens. &quot;No tokens for Bogdan. No tokens for Vitalik. Only tokens for you, and D0GIRA&quot; </p>\n\n<p><strong>Large exchange listing and marketing partners upcoming</strong></p>\n\n<p>The D0GIRA team is currently in talks with a large exchange and new  marketing partners. As well known, these things come with expensive fees  - but both are a strong necessity to get things moving to the next  stage. So, how is a small marketcap coin going to be able to realize the  funding for this costs?As the liquidity was recently unlocked, <strong>a well thought out strategic move</strong> is going to be made: A maximum of 50-60% of the liquidity (leaving it  at a very healthy/very above average 6-7% liquidity backing) will be  removed at an unspecified time over the weekend (Fri/Sat/Sun), and no  later than 11:59pm (UTC) on Sunday 16th. Those funds will then be used directly on getting D0GIRA onto big exchanges, and onto big platforms for advertising the services and features that the project has in the  works. This will mean, that D0GIRA will essentially be a small marketcap coin, with a marketing/CEX listing budget that&#39;d make some of the big  hitters envious - while also enabling D0GIRA to finally grow like every other coin in the small mCap category. The remaining ETH will be placed  back into Locked Liquidity on a month-by-month basis, until the  deployment of the V2 Contract; at which point, the liquidity will be  moved into the V2 Pool, and re-locked once again.</p>\n\n<p><strong>Partnerships with $R3AU, Vira-Lata Finance and B1NGUS.finance</strong></p>\n\n<p>$R3AU is an open source, decentralized project, created to help include Brazilians in the cryptocurrency world. R3AU provides a safe financial system that is easy to use, and helps make a difference through  charitable donations. Starting  on the 17th, R3AU will have D0GIRA’s logo on their website leading to a  landing page, which will allow to easily donate to the animal shelters supported by R3AU.Alongside this, the D0GIRA team are working  directly on investment/donation NFTs (The last value-focused NFT sold  out in under 10 hours, generating $35,000 for marketing efforts) that contribute directly to R3AU&#39;s supported Shelters! In addition, all donations made either through direct contributions, or through NFTs will be displayed proudly on R3AU&#39;s homepage!</p>\n\n<p>B1NGUS.finance  started life as a small meme token - and with the guiding hand of an  excellent core team, they&#39;ve become one of the leading community &amp;  animal charity tokens in cryptocurrency today.B1NGUS donated a total of nearly $30.000 to various animal charities so far. D0GIRA will be working together on joint campaigns to multiply the  donation amount towards these charity groups. Alongside this, D0GIRA  will be working with B1NGUS to expand their own offerings in the utility  and NFT worlds, helping to solidify a long-term partnership for the two  growing tokens.</p>\n\n<p><strong>Upcoming</strong></p>\n\n<ul>\n<li>D0GIRA is kicking of a key campaign for B1NGUS today (15th of May), by pledging $20.000 on behalf of MoistCr1TiKal </li>\n<li>AMA sit down with one of R3AU’s members, and one of D0GIRA’s team members on the 16th of May</li>\n<li>Split  or Steal (#1 steam game by lead developer Eoghan Hayes) D0GIRA event  takes place at end of may, with the chance of winning up to 20k in D0GIRA.</li>\n<li>New website being finalized.</li>\n<li>A whitepaper further unpacking the D0GIRA usecases and utility will be releasing in May,  written by co-developer Chris Husse.</li>\n</ul>\n\n<p><strong>Latest News</strong></p>\n\n<ul>\n<li>D0GIRA made the top 5 of Top Satoshi Club April Guests – best price performance </li>\n<li>D0GIRA was featured at the Miami Crypto Expo 2021.</li>\n<li>The first manga NFT, <em>The D0GIRA Chronicles</em>, just dropped. More chapters to come!</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 644,
  "permalink": "/r/CryptoCurrency/comments/nd4ahw/gamings_bright_future_how_crypto_can_change_the/",
  "subreddit": "CryptoCurrency",
  "id": "nd4ahw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798342
}