{
  "author": "AutoModerator",
  "original_created_utc": 1635343210,
  "title": "Ask Anything Wednesday - Biology, Chemistry, Neuroscience, Medicine, Psychology",
  "created_utc": 1635353288,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to our weekly feature, Ask Anything Wednesday - this week we are focusing on <strong>Biology, Chemistry, Neuroscience, Medicine, Psychology</strong></p>\n\n<p>Do you have a question within these topics you weren&#39;t sure was worth submitting? Is something a bit too speculative for a typical <a href=\"/r/AskScience\">/r/AskScience</a> post? No question is too big or small for AAW. In this thread you can ask any science-related question! Things like: &quot;What would happen if...&quot;, &quot;How will the future...&quot;, &quot;If all the rules for &#39;X&#39; were different...&quot;, &quot;Why does my...&quot;.</p>\n\n<p><strong>Asking Questions:</strong></p>\n\n<p>Please post your question as a top-level response to this, and our team of panellists will be here to answer and discuss your questions. The other topic areas will appear in future Ask Anything Wednesdays, so if you have other questions not covered by this weeks theme please either hold on to it until those topics come around, or go and post over in our sister subreddit <a href=\"/r/AskScienceDiscussion\">/r/AskScienceDiscussion</a> , where every day is Ask Anything Wednesday! Off-theme questions in this post will be removed to try and keep the thread a manageable size for both our readers and panellists.</p>\n\n<p><strong>Answering Questions:</strong></p>\n\n<p>Please only answer a posted question if you are an expert in the field. <a href=\"http://www.reddit.com/r/askscience/wiki/index#wiki_answering_askscience\">The full guidelines for posting responses in AskScience can be found here</a>. In short, this is a moderated subreddit, and responses which do not meet our quality guidelines will be removed. Remember, peer reviewed sources are always appreciated, and anecdotes are absolutely not appropriate. In general if your answer begins with &#39;I think&#39;, or &#39;I&#39;ve heard&#39;, then it&#39;s not suitable for <a href=\"/r/AskScience\">/r/AskScience</a>.</p>\n\n<p>If you would like to become a member of the AskScience panel, <a href=\"https://www.reddit.com/r/askscience/about/sticky\">please refer to the information provided here</a>.</p>\n\n<p>Past AskAnythingWednesday posts <a href=\"http://www.reddit.com/r/askscience/search?q=flair%3A%27meta%27&amp;restrict_sr=on&amp;sort=new&amp;t=all\">can be found here</a>. Ask away!</p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/askscience/comments/qgxc40/ask_anything_wednesday_biology_chemistry/",
  "subreddit": "askscience",
  "id": "qgxc40",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Welcome to our weekly feature, Ask Anything Wednesday - this week we are\nfocusing on Biology, Chemistry, Neuroscience, Medicine, Psychology\n\nDo you have a question within these topics you weren't sure was worth\nsubmitting? Is something a bit too speculative for a typical /r/AskScience post?\nNo…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎週恒例の「Ask Anything Wednesday」へようこそ！今週のテーマは\n今週のテーマは、生物学、化学、神経科学、医学、心理学です。\n\nこれらのトピックの中で、投稿する価値があるかどうかわからない質問がありますか？\n投稿する価値があるかどうかわからない質問はありませんか？典型的な/r/AskScienceの投稿にはちょっと思わせぶりな内容でしょうか？\nそんなことはありません。",
      "title": "Ask Anything Wednesday - 生物学、化学、神経科学、医学、心理学"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "欢迎来到我们的每周专题--\"星期三随便问\"--本周我们将\n关注生物学、化学、神经科学、医学和心理学。\n\n在这些主题中，你是否有一个不确定是否值得提交的问题？\n提交？对于一个典型的/r/AskScience帖子来说，有些东西太过投机了？\n不...",
      "title": "任何问题星期三 - 生物学，化学，神经科学，医学，心理学"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歡迎來到我們的每週專題--\"星期三隨便問\"--本週我們將\n關注生物學、化學、神經科學、醫學和心理學。\n\n在這些主題中，你是否有一個不確定是否值得提交的問題？\n提交？對於一個典型的/r/AskScience帖子來說，有些東西太過投機了？\n不...",
      "title": "任何問題星期三 - 生物學，化學，神經科學，醫學，心理學"
    }
  ]
}