{
  "author": "Asskickingspree",
  "the_new_excerpt": "As far as my understanding goes, in an aircraft, during take-off the rotational\nspeed of the propeller would be large in order to generate enough thrust to take\noff.\n\nAnd during cruise, the rotational speed is lowered since the needed thrust is\nless.\n\nBut the efficiency curves of climb (green curve)…",
  "original_created_utc": 1620651390,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、航空機の場合、離陸時には十分な推力を得るためにプロペラの回転速度を大きくします。\n離陸時には、離陸に必要な推力を得るためにプロペラの回転速度を大きくします。\n離陸時には、離陸に必要な推力を得るためにプロペラの回転速度を大きくします。\n\nそして、巡航時には、必要な推力が小さくなるので、回転速度を下げます。\nとなります。\n\nしかし、上昇時の効率曲線（緑の曲線）は...。",
      "title": "上昇気流と巡航気流のプロペラの効率曲線をどのように解釈するか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我的理解，在飞机上，在起飞过程中，螺旋桨的旋转速度会很大，以产生足够的推力。\n的速度会很大，以便产生足够的推力来起飞。\n起飞。\n\n而在巡航过程中，转速会降低，因为需要的推力是\n少。\n\n但是爬升的效率曲线（绿色曲线）...",
      "title": "如何解释爬升和巡航螺旋桨的效率曲线？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我的理解，在飛機上，在起飛過程中，螺旋槳的旋轉速度會很大，以產生足夠的推力。\n的速度會很大，以便產生足夠的推力來起飛。\n起飛。\n\n而在巡航過程中，轉速會降低，因爲需要的推力是\n少。\n\n但是爬升的效率曲線（綠色曲線）...",
      "title": "如何解釋爬升和巡航螺旋槳的效率曲線？"
    }
  ],
  "title": "How to interpret efficiency cruves of climb and cruise propellers?",
  "created_utc": 1620660286,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As far as my understanding goes, in an aircraft, during take-off the rotational speed of the propeller would be large in order to generate enough thrust to take off.</p>\n\n<p>And during cruise, the rotational speed is lowered since the needed thrust is less.</p>\n\n<p>But the efficiency curves of climb (green curve) and cruise (blue curve) propellers tell me otherwise.</p>\n\n<p>See figure 6 of this paper <a href=\"https://commons.erau.edu/cgi/viewcontent.cgi?article=1840&amp;context=publication\">https://commons.erau.edu/cgi/viewcontent.cgi?article=1840&amp;amp;context=publication</a></p>\n\n<p>The climb propeller, which is meant to work at high propeller rotational speeds, has low efficiency at these high propeller rotational speeds. The same goes for the cruise propeller which has low efficiency at low rotational speeds. I have searched online, and everyone just takes these curves as they are but I genuinely don&#39;t understand the efficiency vs rpm curve.</p>\n\n<p>Shouldn&#39;t the curves be switches? The climb propeller has high efficiency at large speeds while the cruise propeller has high efficiency at low speeds?</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks in advance.</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/askscience/comments/n93sgv/how_to_interpret_efficiency_cruves_of_climb_and/",
  "subreddit": "askscience",
  "id": "n93sgv",
  "is_self": true,
  "media": null,
  "is_video": false
}