{
  "author": "TRILLTASKFORCE69",
  "the_new_excerpt": "I have been following the stock market very peripherally for a few years now.\n\nWhen the COVID pandemic happened and stocks tumbled, that made sense to me. What\ndid not make a whole lot of sense was the unbelievable ascent that took place\nimmediately after.\n\nI’m a grad student and so I don’t have a…",
  "original_created_utc": 1619469583,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数年前から株式市場を非常に細やかにフォローしています。\n\nCOVIDのパンデミックが起きて株が暴落したとき、私はそれで納得しました。しかし\nその直後に信じられないような上昇を見せたことは、あまり意味がありませんでした。\nその直後の信じられないような上昇でした。\n\n私は大学院生なので、私は...",
      "title": "2021年1月に投資ポートフォリオを開始した者として、今日ようやく収支がついた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年来，我一直在非常外围地关注股市。\n\n当COVID大流行发生时，股票暴跌，这对我来说很有意义。但是\n不太合理的是紧接着发生的令人难以置信的上涨。\n紧随其后。\n\n我是一个研究生，所以我没有...",
      "title": "作为在2021年1月开始投资组合的人，我今天终于实现了收支平衡"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年來，我一直在非常外圍地關注股市。\n\n當COVID大流行發生時，股票暴跌，這對我來說很有意義。但是\n不太合理的是緊接着發生的令人難以置信的上漲。\n緊隨其後。\n\n我是一個研究生，所以我沒有...",
      "title": "作爲在2021年1月開始投資組合的人，我今天終於實現了收支平衡"
    }
  ],
  "title": "As someone who started their investment portfolio in January 2021, I have finally broken even today",
  "created_utc": 1619477717,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been following the stock market very peripherally for a few years now.</p>\n\n<p>When the COVID pandemic happened and stocks tumbled, that made sense to me. What did not make a whole lot of sense was the unbelievable ascent that took place immediately after.</p>\n\n<p>I’m a grad student and so I don’t have a job at the moment (will graduate next month though and finally start earning money hopefully), so I couldn’t risk putting my savings in the markets and instead I sat on the sidelines watching everybody make a ton of money except me.</p>\n\n<p>By the end of 2020, I said enough was enough and decided that it was time to stop watching and finally start my own investment portfolio. That was my New Years resolution and by the middle of January I had finished my due diligence on all the companies and stocks I wanted to buy and I moved two-thirds of all the cash I had in my name into the stock market...</p>\n\n<p>It was a very good few weeks for me after that, and then February happened...</p>\n\n<p>I felt like such a dumbass for watching all the gains take place and then as soon as I moved my money in a correction took place. Of course I was overweight on tech and growth and so I was down about 12% of my investments all within the first 4 weeks of when I started trading.</p>\n\n<p>It was definitely a gut punch and made me question if I actually knew anything at all about stocks, but I knew that selling would be stupid so I just waited.</p>\n\n<p>It was hard not checking my Fidelity app every single day, but I’m happy to say that today I’m finally back to where I started. I could sell it all right now and it would be as if I had just kept all my money in my savings account this entire time.</p>\n\n<p>It really is true what they say, stocks take the elevator down and the stairs up.</p>\n</div><!-- SC_ON -->",
  "score": 317,
  "permalink": "/r/stocks/comments/mz7esj/as_someone_who_started_their_investment_portfolio/",
  "subreddit": "stocks",
  "id": "mz7esj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216004
}