{
  "author": "gwcurioustaw",
  "original_created_utc": 1631778491,
  "title": "PSA: Major exchanges (at least Binance and Coinbase) suspended all SOL deposits and withdrawals right as the network restarted, and are still down. Billions of coins are still stuck while price is being desperately manipulated via FTX lev long futures.",
  "created_utc": 1631806244,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m sure everyone saw the sudden 16 hour Solana network outage yesterday. During the outage the SOL price strangely tanked and then slowly recovered. That was because volume overall was pretty low since most of the coins are being either staked, stuck in various DeFi apps, or in wallets. The only coins that could be traded during the outage were already on exchanges. </p>\n\n<p>So everybody (including myself) was expecting a major price crash as soon as the SOL network went back online and people could get their coins out. </p>\n\n<p>But we saw was actually the opposite…it mysteriously pumped, and has since traded sideways.</p>\n\n<p>So what happened? Pretty much as soon as it went online, millions were pumped into FTX lev long SOL future positions (check out the WhaleTrades)</p>\n\n<p>At the same time, Binance, Coinbase, ( I believe FTX too), KuCoin and probably others I didn’t hear about suspended all deposits and withdrawals. So nobody with coins to move could even get them on exchanges to sell.</p>\n\n<p>Meanwhile, People with staked coins can’t unstake/withdraw them until the Solana network epoch turns over. That doesn’t happen until several hours from now (according to solanabeach.io status tracker)</p>\n\n<p>But oh wait, unstaking was suspended on some apps too (reports coming from Exodus users)</p>\n\n<p>As far as I know, Binance and Coinbase are still suspended.</p>\n\n<p>There are tens of billions of dollars worth of coins still stuck in DeFi or unable to be moved on or off exchanges. The price is still being stabilized by incremental leveraged positions and wash/arb trading bots moving volume around </p>\n\n<p>There seems to be some blatant and desperate interference being run from the exchanges, who have been silent about this thus far. If there really was a mass SOL exodus, they’d have probably been bled dry of liquidity. </p>\n\n<p>Meanwhile investors are sitting on millions of dollars of losses they can’t mitigate, with their coins being held hostage. </p>\n\n<p>It’s all super sketchy and the participants need to be called out on it.</p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/pp8u8w/psa_major_exchanges_at_least_binance_and_coinbase/",
  "subreddit": "CryptoCurrency",
  "id": "pp8u8w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m sure everyone saw the sudden 16 hour Solana network outage yesterday. During\nthe outage the SOL price strangely tanked and then slowly recovered. That was\nbecause volume overall was pretty low since most of the coins are being either\nstaked, stuck in various DeFi apps, or in wallets. The only…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、突然の16時間に及ぶソラナのネットワーク障害を皆さんもご覧になったと思います。その間\n停電の間、SOL価格は奇妙に暴落し、その後ゆっくりと回復していった。これは\nそれは、コインのほとんどがステークされているか、様々なDeFiアプリに留まっているか、ウォレットに入っているかのいずれかであるため、全体的なボリュームがかなり少なかったからだ。\nコインのほとんどが、ステークホルダー、様々なDeFiアプリ、またはウォレットに入れられているため、全体的なボリュームがかなり少なかったからだ。唯一の...",
      "title": "PSA：主要な取引所（少なくともBinanceとCoinbase）は、ネットワークが再起動した直後にすべてのSOLの入出金を停止し、現在も停止しています。FTX lev long futuresによって価格が必死に操作されている間、何十億枚ものコインがまだ動かない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信每个人都看到了昨天突然发生的16小时的索拉纳网络中断。在\n在中断期间，SOL的价格奇怪地下跌，然后慢慢恢复。这是因为\n这是因为整体的交易量很低，因为大多数的硬币要么被抵押，要么被卡在虚拟货币中。\n抵押，卡在各种DeFi应用程序中，或在钱包中。唯一...",
      "title": "PSA：主要交易所（至少是Binance和Coinbase）在网络重启时就暂停了所有SOL存款和取款，目前仍在停机。数以亿计的硬币仍然被卡住，而价格却通过FTX lev长线期货被拼命操纵。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信每個人都看到了昨天突然發生的16小時的索拉納網絡中斷。在\n在中斷期間，SOL的價格奇怪地下跌，然後慢慢恢復。這是因爲\n這是因爲整體的交易量很低，因爲大多數的硬幣要麼被抵押，要麼被卡在虛擬貨幣中。\n抵押，卡在各種DeFi應用程序中，或在錢包中。唯一...",
      "title": "PSA：主要交易所（至少是Binance和Coinbase）在網絡重啓時就暫停了所有SOL存款和取款，目前仍在停機。數以億計的硬幣仍然被卡住，而價格卻通過FTX lev長線期貨被拼命操縱。"
    }
  ]
}