{
  "author": "ShotBot",
  "the_new_excerpt": "It's like a pyramid scheme where everyone is required to shill these worthless\nassets or else you won't find new people to buy in. I kind of liked the market\nbetter when earnings and fundamentals mattered. At what point does this end?\n\n\n\nhttps://www.currentmarketvaluation.com/models/buffett…",
  "original_created_utc": 1618332858,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような価値のない資産をみんなで売りさばくことが求められるマルチ商法のようなものです。\nそうしないと新たに買ってくれる人がいなくなってしまうのです。私は、業績やファンダメンタルズが\n業績やファンダメンタルズが重要だった頃の市場の方が好きだった。これはどの時点で終わるのだろうか？\n\n\n\nhttps://www.currentmarketvaluation.com/models/buffett...",
      "title": "ネット上の投資に関する議論のほとんどは、もはや陶酔的なマルチ商法のように読める。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这就像一个传销一样，每个人都要推销这些不值钱的东西。\n资产，否则你就找不到新的人买进。我有点喜欢这个市场\n在盈利和基本面重要的时候更好。这种情况会在什么时候结束？\n\n\n\nhttps://www.currentmarketvaluation.com/models/buffett...",
      "title": "网上大部分的投资讨论，读起来就像一个兴奋的传销组织了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這就像一個傳銷一樣，每個人都要推銷這些不值錢的東西。\n資產，否則你就找不到新的人買進。我有點喜歡這個市場\n在盈利和基本面重要的時候更好。這種情況會在什麼時候結束？\n\n\n\nhttps://www.currentmarketvaluation.com/models/buffett...",
      "title": "網上大部分的投資討論，讀起來就像一個興奮的傳銷組織了。"
    }
  ],
  "title": "Most of investing discussion online reads like a euphoric pyramid scheme anymore.",
  "created_utc": 1618349065,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s like a pyramid scheme where everyone is required to shill these worthless assets or else you won&#39;t find new people to buy in. I kind of liked the market better when earnings and fundamentals mattered. At what point does this end? </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.currentmarketvaluation.com/models/buffett-indicator.php\">https://www.currentmarketvaluation.com/models/buffett-indicator.php</a></p>\n\n<p>&#x200B;</p>\n\n<p>The buffet indicator is suggesting that the market is currently more overvalued than the peak of the dotcom bubble. I totally believe it, everyone is in the market and I think the end is sooner than many people think.</p>\n</div><!-- SC_ON -->",
  "score": 441,
  "permalink": "/r/investing/comments/mq6e0u/most_of_investing_discussion_online_reads_like_a/",
  "subreddit": "investing",
  "id": "mq6e0u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617807
}