{
  "author": "GMEgotmehere",
  "the_new_excerpt": "Yes I know nobody can time the market. It doesn't mean it doesn't bother me! All\nof the above get under my skin. I think the worst for me has been watching the\nwatchlist stocks run without me. I usually invest a lot of time researching\nbefore adding them there. I've resorted to buying a small part…",
  "original_created_utc": 1619142808,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰も市場のタイミングを計ることができないことは知っています。だからといって、それが気にならないわけではありません。全ての\n上記のすべてが私の肌に合わないのです。私にとって最悪なのは、時計を見ているときだと思います。\n私にとって最悪なのは、ウォッチリストの銘柄が私なしで動いているのを見ることです。私は通常、ウォッチリストに追加する前に、多くの時間をかけて調査します。\n調べるのに時間がかかります。私は小さな部分を購入することに頼っています...",
      "title": "どっちが悪い？自分の利益が消えていくのを見るのと、売った後に株が暴走するのを見るのと、ウォッチリストに入っている株が暴走するのを見るのと。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我知道没有人可以掌握市场的时间。但这并不意味着它不会困扰我! 所有\n以上这些都让我感到不安。我认为对我来说，最糟糕的是看着那些\n观察名单上的股票在没有我的情况下运行。我通常投入大量的时间研究\n然后再把它们加到那里。我已经采取了购买一小部分...",
      "title": "哪个更糟糕？看着你的收益蒸发，看着一只股票在卖出后运行，还是看着一只股票在你的观察名单上运行。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我知道沒有人可以掌握市場的時間。但這並不意味着它不會困擾我! 所有\n以上這些都讓我感到不安。我認爲對我來說，最糟糕的是看着那些\n觀察名單上的股票在沒有我的情況下運行。我通常投入大量的時間研究\n然後再把它們加到那裏。我已經採取了購買一小部分...",
      "title": "哪個更糟糕？看着你的收益蒸發，看着一隻股票在賣出後運行，還是看着一隻股票在你的觀察名單上運行。"
    }
  ],
  "title": "Which is worse? Watching your gains evaporate, watching a stock run after selling or watching a stock run on your watchlist.",
  "created_utc": 1619147529,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes I know nobody can time the market. It doesn&#39;t mean it doesn&#39;t bother me! All of the above get under my skin. I think the worst for me has been watching the watchlist stocks run without me. I usually invest a lot of time researching before adding them there. I&#39;ve resorted to buying a small part of my position right away and waiting for a lower price for the rest of it. </p>\n\n<p>Not taking the gains and watching it drop makes me feel like I was being too greedy. Not a good feeling. Stop losses at the target sell price are important. Setting a trailing stop 3 percent below the market price has helped me. A volatile stock would have a different percentage.</p>\n\n<p>Watching the stock run after selling just sort of makes me laugh. Like watching your kid grow up and go to college. You appreciate the time you had and look forward to seeing what they become in the future.</p>\n</div><!-- SC_ON -->",
  "score": 3145,
  "permalink": "/r/stocks/comments/mwkisk/which_is_worse_watching_your_gains_evaporate/",
  "subreddit": "stocks",
  "id": "mwkisk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214688
}