{
  "author": "ZhangtheGreat",
  "the_new_excerpt": "I’m new to investing, and like any new investor (except for the ones who are\nsuper lucky beyond comprehension), I knew I was bound to make a few poor\npurchases here and there, even with all the research I did before I made my\nfirst purchase. So far, there are only three buys I regret:\n\n3) INTC -…",
  "original_created_utc": 1621386045,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は投資を始めたばかりで、他の投資家と同様に（理解できないほどの超ラッキーな投資家を除いて）、何度か失敗することになると思っていました。\n私は投資の初心者で、他の投資家と同様に（理解できないほどの超幸運な人を除いて）、購入前にいくら調べても、あちこちで間違った\n私は投資の初心者で、他の初心者投資家と同様に（理解できないほどの超幸運な人を除いて）、最初の購入をする前にいくら調べても、あちこちで間違った買い物をするに違いないと思っていた。\n最初の買い物をする前に調べたとしても、あちこちで間違った買い物をするに違いない。今のところ、後悔している買い物は3つだけです。\n\n3) INTC -...",
      "title": "今年、これまでに購入した中で最悪の買い物"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是个投资新手，和所有的新投资者一样（除了那些超级幸运的人）。\n除了那些超级幸运的人之外），我知道我肯定会在这里和那里做一些糟糕的投资。\n我知道我一定会在这里和那里做一些糟糕的购买，即使我在做第一次购买之前做了所有的研究。\n第一次购买。到目前为止，我只买了三个后悔的东西。\n\n3）INTC -...",
      "title": "今年到目前为止你买的最差的东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是個投資新手，和所有的新投資者一樣（除了那些超級幸運的人）。\n除了那些超級幸運的人之外），我知道我肯定會在這裏和那裏做一些糟糕的投資。\n我知道我一定會在這裏和那裏做一些糟糕的購買，即使我在做第一次購買之前做了所有的研究。\n第一次購買。到目前爲止，我只買了三個後悔的東西。\n\n3）INTC -...",
      "title": "今年到目前爲止你買的最差的東西"
    }
  ],
  "title": "Worst buys you’ve made this year so far",
  "created_utc": 1621407651,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m new to investing, and like any new investor (except for the ones who are super lucky beyond comprehension), I knew I was bound to make a few poor purchases here and there, even with all the research I did before I made my first purchase. So far, there are only three buys I regret:</p>\n\n<p>3) INTC - This has turned out to be a surprise disappointment at this time. In my pre-entry research, Intel had a reputation for being a safe, reliable company that would continue to steadily climb. Unfortunately, after about two days of small gains, Intel has done nothing but tumble. Still, I’m optimistic for its long term because it’s Intel, so I’m holding it.</p>\n\n<p>2) MRNA - Chalk this one up to bad luck. I bought Moderna to chase its earnings report, but the timing couldn’t have been worse: I got in literally MINUTES before the Biden administration announced that the US wouldn’t protect COVID vaccine patents. In a snap, MRNA tumbled 20 points, and to add insult to injury, its earnings report disappointed. Thankfully, it’s only 5 shares, but I’m stuck holding them until MRNA can climb back to 178 again.</p>\n\n<p>1) TSLA - Chalk this one up to being a total n00b. I bought TSLA on my 5th day in the market. I only had enough for one share, but I had to have it. Tesla had been surging for two straight days, and it looked poised to surge again for a third. I was thinking “easy $15 at least.” It turns out I wound up buying it at its peak. Since then, my one share of TSLA has tumbled $200, and with its unpredictability, who knows what direction it’s headed in? My stubbornness refuses to cut this loss, and a balanced portfolio that is gaining more than losing is allowing me to hold this share with the blind belief that it’ll see 800 again.</p>\n</div><!-- SC_ON -->",
  "score": 148,
  "permalink": "/r/stocks/comments/nfrmgh/worst_buys_youve_made_this_year_so_far/",
  "subreddit": "stocks",
  "id": "nfrmgh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804461
}