{
  "author": "bitwisewahoo",
  "original_created_utc": 1628166889,
  "title": "If all of our solar system's planets are orbiting the Sun in approximately in the same plane, what portion of the Sun's energy goes \"out of plane\" away from all of the planets in our solar system?",
  "created_utc": 1628239836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So the planets in our solar system are pretty close to having all of their elliptical orbits in a common plane ( I understand correctly, Mercury is the farthest out-of-plane about 7 degrees off of the ecliptic).  </p>\n\n<p>It readily follows that some of the Sun&#39;s light ends up going out-of-plane from the 8 planets + Pluto. What portion of this energy coming off of the Sun ends up getting just blasted out into the void of space never to go near any of the planets of our solar system, or even anywhere near where they <em>would be</em> at any time in their orbits?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/oyglq0/if_all_of_our_solar_systems_planets_are_orbiting/",
  "subreddit": "askscience",
  "id": "oyglq0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So the planets in our solar system are pretty close to having all of their\nelliptical orbits in a common plane ( I understand correctly, Mercury is the\nfarthest out-of-plane about 7 degrees off of the ecliptic).\n\nIt readily follows that some of the Sun's light ends up going out-of-plane from\nthe 8…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、太陽系の惑星は、すべての楕円軌道が共通の平面上にあることに近いのです。\n楕円軌道が共通の平面上にあることになります（私の理解では、水星は黄道から約7度離れた最も遠い平面上にあります）。\n黄道から約7度離れています）。)\n\nこのことから、太陽の光の一部が黄道面から外れてしまうことは容易に想像できます。\n8...",
      "title": "太陽系のすべての惑星がほぼ同じ平面上で太陽の周りを回っている場合、太陽のエネルギーのうちどの部分が太陽系のすべての惑星から「平面外」に出てしまうのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我们太阳系中的行星非常接近于其所有的\n椭圆轨道都在一个共同的平面上（我没有理解错，水星是最偏离平面约7度的地方）。\n离黄道7度左右的平面最远）。)\n\n由此可见，太阳的一些光线最终会离开平面，从\n8度......。",
      "title": "如果我们太阳系的所有行星都在大约相同的平面内围绕太阳运行，那么太阳的能量有多大一部分会 \"离开平面\"，远离我们太阳系的所有行星？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我們太陽系中的行星非常接近於其所有的\n橢圓軌道都在一個共同的平面上（我沒有理解錯，水星是最偏離平面約7度的地方）。\n離黃道7度左右的平面最遠）。)\n\n由此可見，太陽的一些光線最終會離開平面，從\n8度......。",
      "title": "如果我們太陽系的所有行星都在大約相同的平面內圍繞太陽運行，那麼太陽的能量有多大一部分會 \"離開平面\"，遠離我們太陽系的所有行星？"
    }
  ]
}