{
  "author": "VindictiveLem0m",
  "the_new_excerpt": "Well I got a phone that is supposed to have 32 gigs of internal storage (which I\nrealize isn't that much these days).\n\nIn reality only about 14 gigs of that is actually available to me because the\nsystem takes up 12 gigs and then there is another 6 gone to apps I cannot\nuninstall and don't…",
  "original_created_utc": 1622305579,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "32ギガの内部ストレージを持つとされる携帯電話を手に入れました。\n実際には14ギガ程度しか利用できません。)\n\n実際にはそのうち14ギガ程度しか利用できません。\nシステムが12ギガを占めていて、さらに6ギガはアンインストールできないアプリに使われているからです。\nアンインストールできないアプリがあるからです。",
      "title": "デバイスがストレージ容量を宣伝しているのに、その半分がシステムやアンインストール可能なアプリケーションで占められていると、誰もがイライラするのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一部手机，应该有32G的内部存储空间（我意识到现在的存储空间并不多）。\n我意识到现在的存储空间并不多）。)\n\n实际上，我只有14G的存储空间是可用的，因为系统占用了12G，还有6G被我不能使用的应用程序占用了。\n因为系统占用了12个G，然后还有6个G给了我无法卸载的应用程序。\n卸载，也不...",
      "title": "当一个设备宣传其存储量，然后一半的存储量被系统和可卸载的应用程序占用时，还有谁会感到恼火？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一部手機，應該有32G的內部存儲空間（我意識到現在的存儲空間並不多）。\n我意識到現在的存儲空間並不多）。)\n\n實際上，我只有14G的存儲空間是可用的，因爲系統佔用了12G，還有6G被我不能使用的應用程序佔用了。\n因爲系統佔用了12個G，然後還有6個G給了我無法卸載的應用程序。\n卸載，也不...",
      "title": "當一個設備宣傳其存儲量，然後一半的存儲量被系統和可卸載的應用程序佔用時，還有誰會感到惱火？"
    }
  ],
  "title": "Anyone else get annoyed when a device advertises a storage amount, then half that storage is taken up by system and uninstallable applications?",
  "created_utc": 1622318371,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well I got a phone that is supposed to have 32 gigs of internal storage (which I realize isn&#39;t that much these days).</p>\n\n<p>In reality only about 14 gigs of that is actually available to me because the system takes up 12 gigs and then there is another 6 gone to apps I cannot uninstall and don&#39;t want.</p>\n\n<p>Perhaps they should advertise the actual free storage as well. Would probably be a bit more honest.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/NoStupidQuestions/comments/nnqy70/anyone_else_get_annoyed_when_a_device_advertises/",
  "subreddit": "NoStupidQuestions",
  "id": "nnqy70",
  "is_self": true,
  "media": null,
  "is_video": false
}