{
  "author": "Independent_Sport403",
  "original_created_utc": 1658608620,
  "title": "Help, I think I’ve been scammed",
  "created_utc": 1658676818,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I posted to this forum asking for advice about transferring my BTC and ETH to my hardware wallet. I set up my trezor wallet and initiated the transfer of my coins. 2 days later, my BTC was in my wallet but not my ETH. I then went on this subreddit asking for help. Someone messaged me with these instructions about how to get the ETH onto my wallet. &lt;/p&gt;\n\n&lt;p&gt;(Link that I was given) \nClick on missing assets\nClick on the trezor wallet and connect manually\nThen click on the eth transaction to authenticate the transaction&lt;/p&gt;\n\n&lt;p&gt;I followed the steps and then entered my seed recovery password and when I went back to my wallet, my BTC was gone and sent to a different address. &lt;/p&gt;\n\n&lt;p&gt;Is there anyway to unsend that? I might be the dumbest person to ever walk the earth. It looked like a secure website omfg. Is there any action I can take to recover it? I’m freaking out&lt;/p&gt;\n\n&lt;p&gt;Edit: I’m so embarrassed and ashamed. I lost everything. I’m ruined. This shouldn’t come as a shock to anyone who’s more familiar with BTC, or has common sense. I fell for something that an elderly person with dementia would fall for. And I did it because I was so eager/anxious to resolve the issue that I didn’t use my head. Fuck my life I want to die.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/w6dipo/help_i_think_ive_been_scammed/",
  "subreddit": "CryptoCurrency",
  "id": "w6dipo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I posted to this forum asking for advice about transferring my BTC and ETH to\nmy hardware wallet. I set up my trezor wallet and initiated the transfer of my\ncoins. 2 days later, my BTC was in my wallet but not my ETH. I then went on this\nsubreddit asking for help. Someone messaged me with these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私はこのフォーラムに、BTCとETHの転送についてアドバイスを求める投稿をしました。\nハードウェアウォレットに転送するためのアドバイスを求めました。trezorウォレットをセットアップして、コインの転送を開始しました。\nコインの転送を開始しました。2日後、私のBTCはウォレットにありましたが、ETHはありませんでした。その後、私はこの\nsubredditで助けを求めました。誰かが私にこれらのメッセージを送りました...",
      "title": "助けてください、詐欺にあったようです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我在这个论坛上发帖，询问关于将我的BTC和ETH转移到\n我的硬件钱包。我设置了我的trezor钱包并启动了我的\n币。2天后，我的BTC在我的钱包里，但不是我的ETH。我就在这个\n分论坛上寻求帮助。有人给我发消息说，这些...",
      "title": "帮助，我想我被骗了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我在這個論壇上發帖，詢問關於將我的BTC和ETH轉移到\n我的硬件錢包。我設置了我的trezor錢包並啓動了我的\n幣。2天后，我的BTC在我的錢包裏，但不是我的ETH。我就在這個\n分論壇上尋求幫助。有人給我發消息說，這些...",
      "title": "幫助，我想我被騙了"
    }
  ]
}