{
  "author": "Tenma_Hito",
  "original_created_utc": 1625332970,
  "title": "Your $30 investment is great! Don't get discouraged when you see people throwing thousands of dollars into crypto.",
  "created_utc": 1625344511,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re new in crypto space and just started investing and see people throwing thousands of dollars into crypto don&#39;t be discouraged, your 30$ investment can go a long way.</p>\n\n<p>Everyone&#39;s in it for their own gain so invest on your own terms. Don&#39;t make rash decisions and invest responsibly. Even if you feel the urge to increase your investment remind yourself if you&#39;re willing to loose all the money. Your real life responsibility &gt; investing in crypto. Build up your emergency fund. Pay off debt. Spend some money and enjoy life. Gains aren&#39;t made from 1 time investments. Slowly build up your bag. DCA will get you way further in the long run. </p>\n\n<p>What is more important in my opinion is the experience you gain from beeing in the market. A lot of new players will get burned trying to leverage and daytrade. Getting a feel for how the market moves will put you ahead for your future investments. </p>\n\n<p>We&#39;re here for a while lads so let&#39;s enjoy the ride together.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/od2bpw/your_30_investment_is_great_dont_get_discouraged/",
  "subreddit": "CryptoCurrency",
  "id": "od2bpw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you're new in crypto space and just started investing and see people throwing\nthousands of dollars into crypto don't be discouraged, your 30$ investment can\ngo a long way.\n\nEveryone's in it for their own gain so invest on your own terms. Don't make rash\ndecisions and invest responsibly. Even if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが暗号の世界に入ったばかりで、投資を始めたばかりで、人々が暗号に何千ドルも投じているのを見ても、がっかりしないでください。\n何千ドルものお金を暗号に投じている人を見ても、がっかりしないでください。\nあなたの30ドルの投資が大きな意味を持ちます。\n\n誰もが自分の利益のために参加しているので、自分の条件で投資しましょう。軽率な判断をせず、責任を持って\n責任を持って投資しましょう。例え...",
      "title": "あなたの30ドルの投資は素晴らしいです。何千ドルものお金を暗号に投じる人を見ても、がっかりしないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是加密货币领域的新手，刚刚开始投资，看到人们将数千美元投向加密货币，不要气馁。\n不要气馁，你的30美元投资可以发挥很大作用。\n可以走很长的路。\n\n每个人都是为了自己的利益，所以根据自己的条件进行投资。不要做出草率的\n做出决定，负责任地投资。即使...",
      "title": "你的30美元投资很好! 当你看到人们向加密货币投掷数千美元时，不要气馁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是加密貨幣領域的新手，剛剛開始投資，看到人們將數千美元投向加密貨幣，不要氣餒。\n不要氣餒，你的30美元投資可以發揮很大作用。\n可以走很長的路。\n\n每個人都是爲了自己的利益，所以根據自己的條件進行投資。不要做出草率的\n做出決定，負責任地投資。即使...",
      "title": "你的30美元投資很好! 當你看到人們向加密貨幣投擲數千美元時，不要氣餒。"
    }
  ]
}