{
  "author": "binhp",
  "the_new_excerpt": "Today is the first time I feel bearish about AAPL. It's a money making machine\nbut stock goes higher because of future earning / innovation potential and not\nbecause of how successful the company in the past. The headwinds include: epic\ntrial, chip shortage leading to reduced iPad shipment and…",
  "original_created_utc": 1622753477,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は初めてAAPLに弱気になりました。金儲けの機械ではあるが\nしかし、株価が上がるのは、過去の成功ではなく、将来の収益性やイノベーションの可能性によるものです。\n過去にどれだけ成功したかではなく、将来の収益やイノベーションの可能性で株が上がる。逆風となるのは、大規模な\n逆風としては、大規模な裁判、チップ不足によるiPadの出荷台数の減少、そして...。",
      "title": "AAPLはピークを迎え、弱気のサインが出始めていると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天是我第一次对AAPL感到看跌。它是一台赚钱的机器\n但股票走高是因为未来的盈利/创新潜力，而不是因为公司过去有多成功。\n而不是因为该公司过去有多成功。逆风因素包括：史诗般的\n审判，芯片短缺导致iPad出货量减少，以及...",
      "title": "我认为AAPL正处于高峰期，开始出现看跌迹象"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天是我第一次對AAPL感到看跌。它是一臺賺錢的機器\n但股票走高是因爲未來的盈利/創新潛力，而不是因爲公司過去有多成功。\n而不是因爲該公司過去有多成功。逆風因素包括：史詩般的\n審判，芯片短缺導致iPad出貨量減少，以及...",
      "title": "我認爲AAPL正處於高峯期，開始出現看跌跡象"
    }
  ],
  "title": "I think AAPL is at its peak and starts to show bearish signs",
  "created_utc": 1622775780,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today  is the first time I feel bearish about AAPL. It&#39;s a money making  machine but stock goes higher because of future earning / innovation  potential and not because of how successful the company in the past. The  headwinds include: epic trial, chip shortage leading to reduced iPad  shipment and reduced future revenue, and possibly reduced iPhone 13  shipment due to no breaking changes.</p>\n\n<p>In  addition to all these, already highest market cap in the market and  inflation fear looming the tech sector. Since AAPL is such a big part of  many indexes, the downward of indexes will affect AAPL a lot. Also,  three top car division executives just left AAPL and it does not seem  AAPL has made much progress in the car business which could be next big  growth area for AAPL.</p>\n\n<p>Among a  dozen of professional analysts, only 2 are bearish and last week New  Street’s Pierre Ferragu gave a $90 price target EOY. No major banks have  downgraded their outlook for AAPL and the consensus median is $160,  average is $157.10, high is $185.</p>\n\n<p>What do you think about AAPL?</p>\n</div><!-- SC_ON -->",
  "score": 237,
  "permalink": "/r/investing/comments/nrnnv0/i_think_aapl_is_at_its_peak_and_starts_to_show/",
  "subreddit": "investing",
  "id": "nrnnv0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885454
}