{
  "author": "LorryWaraLorry",
  "original_created_utc": 1639442859,
  "title": "If HFCS is fructose and glucose, and raw honey is also mostly fructose and glucose, what makes HFCS *that* bad?",
  "created_utc": 1639455623,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Honey is often hailed as having medicinal benefits (or at least being not as bad as table sugar), whereas HFCS is in multiple nutritional black lists (figuratively) and is feared by many for its harmful effects being much worse than straight up table sugar.&lt;/p&gt;\n\n&lt;p&gt;Often the explanation is that HFCS has higher fructose which is the bad thing about it, when honey usually have similar if not even higher fructose content compared to glucose. So what gives?&lt;/p&gt;\n\n&lt;p&gt;I know that honey has enzymes, minerals and vitamins making it somewhat beneficial, but this doesn’t change how the body absorbs and metabolizes fructose whether in HFCS or honey. So what’s the deal here?&lt;/p&gt;\n\n&lt;p&gt;Is honey just as bad as HFCS or is HFCS not as bad as it is made out to be? Or am I missing something?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askscience/comments/rfuvb1/if_hfcs_is_fructose_and_glucose_and_raw_honey_is/",
  "subreddit": "askscience",
  "id": "rfuvb1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Honey is often hailed as having medicinal benefits (or at least being not as bad\nas table sugar), whereas HFCS is in multiple nutritional black lists\n(figuratively) and is feared by many for its harmful effects being much worse\nthan straight up table sugar.\n\nOften the explanation is that HFCS has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハチミツには薬効がある（あるいは、少なくとも薬効はない）とされることが多い。\n一方、HFCSは栄養価の高いブラックリストに何度も掲載されています。\n(その有害性は、多くの人に恐れられています。\n砂糖よりも\n\n多くの場合、HFCSには...という説明がなされます。",
      "title": "HFCSが果糖とブドウ糖で、生のハチミツもほとんどが果糖とブドウ糖だとしたら、HFCSがそんなに悪いものなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "蜂蜜经常被誉为具有药用价值（或至少不象标签那样糟糕\n而HFCS则被列入多个营养学黑名单\n(形象地讲），许多人担心它的有害影响比直接食用糖更糟糕。\n比直接食用糖更糟糕。\n\n通常的解释是，HFCS有...",
      "title": "如果HFCS是果糖和葡萄糖，而生蜂蜜也主要是果糖和葡萄糖，是什么让HFCS变得**糟糕？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "蜂蜜經常被譽爲具有藥用價值（或至少不象標籤那樣糟糕\n而HFCS則被列入多個營養學黑名單\n(形象地講），許多人擔心它的有害影響比直接食用糖更糟糕。\n比直接食用糖更糟糕。\n\n通常的解釋是，HFCS有...",
      "title": "如果HFCS是果糖和葡萄糖，而生蜂蜜也主要是果糖和葡萄糖，是什麼讓HFCS變得**糟糕？"
    }
  ]
}