{
  "author": "Apriose",
  "original_created_utc": 1656478451,
  "title": "Are there any known reactions from European royalty to the discovery that incest lead to health problems in offspring?",
  "created_utc": 1656512011,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;According to my understanding, Charles Darwin was the first one to propose that inbreeding cause problems for the offspring’s health but didn’t quite “prove it”, however when this phenomena was first proposed, understood, or proven. Did it caused a reaction from the “well connected” European monarchies or from elsewhere? The ones that often would “keep things in the family”? Was there outrage to the idea? An attempt to deny it? A grim realization? Or anything on the matter?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/vn7e0e/are_there_any_known_reactions_from_european/",
  "subreddit": "AskHistorians",
  "id": "vn7e0e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "According to my understanding, Charles Darwin was the first one to propose that\ninbreeding cause problems for the offspring’s health but didn’t quite “prove\nit”, however when this phenomena was first proposed, understood, or proven. Did\nit caused a reaction from the “well connected” European…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、チャールズ・ダーウィンは最初に次のことを提案した。\n近親交配が子孫の健康に問題を起こすことを最初に提唱したのはチャールズ・ダーウィンですが、「証明」したわけではありません。\nしかし、この現象が最初に提案され、理解され、証明されたのはいつなのか。はたして\nこの現象が最初に提案され、理解され、証明されたとき、ヨーロッパの「コネのある」人たちからの反発を招いた。",
      "title": "近親相姦が子孫の健康被害につながるという発見に対して、ヨーロッパの王族がどのような反応を示したか、知られているものはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我的理解，查尔斯-达尔文是第一个提出以下观点的人\n近亲繁殖会给后代的健康带来问题，但并没有完全 \"证明\n然而，这一现象是何时被首次提出、理解或证明的。是否\n它引起了欧洲 \"关系良好 \"的反应......",
      "title": "对于发现乱伦导致后代的健康问题，欧洲皇室是否有任何已知的反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我的理解，查爾斯-達爾文是第一個提出以下觀點的人\n近親繁殖會給後代的健康帶來問題，但並沒有完全 \"證明\n然而，這一現象是何時被首次提出、理解或證明的。是否\n它引起了歐洲 \"關係良好 \"的反應......",
      "title": "對於發現亂倫導致後代的健康問題，歐洲皇室是否有任何已知的反應？"
    }
  ]
}