{
  "author": "LukeG543",
  "original_created_utc": 1650070710,
  "title": "Did my girlfriends butt give me tonsillitis?",
  "created_utc": 1650081763,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I was eating my girlfriend’s bootyhole the other day. She had just gotten out of the shower and after a thorough examination, I had decided it was clean (as clean as buttholes get anyways) a few days later, I had a sore throat that got worse as the days went on. After a trip to the Urgent Care, I have been diagnosed with tonsillitis. Note that I have NEVER had a SINGLE issue with my tonsils in the past. Is this contracted from my girlfriend’s butthole?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 147,
  "permalink": "/r/TooAfraidToAsk/comments/u4mb2n/did_my_girlfriends_butt_give_me_tonsillitis/",
  "subreddit": "TooAfraidToAsk",
  "id": "u4mb2n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "So I was eating my girlfriend’s bootyhole the other day. She had just gotten out\nof the shower and after a thorough examination, I had decided it was clean (as\nclean as buttholes get anyways) a few days later, I had a sore throat that got\nworse as the days went on. After a trip to the Urgent Care,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "で、この間、恋人の戦利品を食べてたんですよ。彼女はちょうど出てきたところで\nシャワーを浴びた後、徹底的に調べた結果、きれいだと判断しました。\n数日後、喉が痛くなり、さらに悪化した。\n日が経つにつれて悪化した。緊急医療センターへ行った後...",
      "title": "女友達のお尻で扁桃腺炎になった？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，我正在吃我女朋友的屁眼。她刚从浴室出来\n她刚洗完澡，经过彻底的检查，我认为它是干净的（无论如何，屁眼是干净的）。\n几天后，我的喉咙痛，而且随着时间的推移越来越严重。\n几天后，我的喉咙痛，而且随着时间的推移越来越严重。在去了一趟急诊室后，我的喉咙痛得厉害。",
      "title": "我女朋友的屁股让我得了扁桃体炎吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，我正在喫我女朋友的屁眼。她剛從浴室出來\n她剛洗完澡，經過徹底的檢查，我認爲它是乾淨的（無論如何，屁眼是乾淨的）。\n幾天後，我的喉嚨痛，而且隨着時間的推移越來越嚴重。\n幾天後，我的喉嚨痛，而且隨着時間的推移越來越嚴重。在去了一趟急診室後，我的喉嚨痛得厲害。",
      "title": "我女朋友的屁股讓我得了扁桃體炎嗎？"
    }
  ]
}