{
  "author": "H20man1",
  "the_new_excerpt": "I only lost 0.63 percent of my networth in this but yet I feel this bad\ndepression I can't describe. I know for sure it's not the money but I just have\nthis indescribable shitty feeling. I don't know if it's because I now know I\nlive in a rigged system or if it's because a lot of people are probably…",
  "original_created_utc": 1612236269,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里面只损失了0.63%的净资产，但我却感觉到了这样的痛苦\n我无法描述的抑郁症。我知道肯定这不是钱的问题，但我只是有。\n这种无法形容的低劣感觉。我不知道这是否是因为我现在知道我\n生活在一个被操纵的系统中，或者是因为很多人可能...",
      "title": "有谁在GME惨败后感觉到了这种非常糟糕的郁闷？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏面只損失了0.63%的淨資產，但我卻感覺到了這樣的痛苦\n我無法描述的抑鬱症。我知道肯定這不是錢的問題，但我只是有。\n這種無法形容的低劣感覺。我不知道這是否是因爲我現在知道我\n生活在一個被操縱的系統中，或者是因爲很多人可能...",
      "title": "有誰在GME慘敗後感覺到了這種非常糟糕的鬱悶？"
    }
  ],
  "title": "Anyone else just feeling this really bad depression after the GME fiasco?",
  "created_utc": 1612254738,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I only lost 0.63 percent of my networth in this but yet I feel this bad depression I can&#39;t describe. I know for sure it&#39;s not the money but I just have this indescribable shitty feeling. I don&#39;t know if it&#39;s because I now know I live in a rigged system or if it&#39;s because a lot of people are probably going to lose a lot of money that they couldn&#39;t afford to lose. Amateur traders putting their life savings into it only to lose it. I think the suicide rate will probably be higher than normal in the next few weeks. I feel bad for those people that went in with noble intentions only to be robbed by the parasitic traders that have joined &quot;the movement&quot;. Anyone else feel the same?</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/stocks/comments/lam8fb/anyone_else_just_feeling_this_really_bad/",
  "subreddit": "stocks",
  "id": "lam8fb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541040
}