{
  "author": "Nervous_Sky_5167",
  "original_created_utc": 1627429839,
  "title": "A Comprehensive Analysis On Why Bitcoin's Bull Run Isn't Over",
  "created_utc": 1627500988,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>ABSTRACT</h1>\n\n<p>From logarithmic regression diagrams to stock-to-flow models, this post is an attempt to culminate all sources of data to understand how and why Bitcoin is in an accumulation phase, before heading for a second, higher peak. </p>\n\n<h1>LOGARITHMIC REGRESSION AND TREND LINES</h1>\n\n<p>Bitcoin has followed a rather strict logarithmic regression trend for nearly 12 years now, shown in Fig. 1. </p>\n\n<p>Specifically, in bull markets, Bitcoin doesn&#39;t trend lower than than its L3 regression line, or its mid-market support line. To trend lower means a preceding bear market, but to hold the line means an accumulation phase; and that is what&#39;s happening right now. We corrected off the L2 because the prices rose too rapidly without much market maturity, and are currently accumulating as expected on the L3 mid-market line. Figure 3 is a zoomed in portion of our current market circumstances. </p>\n\n<p>This is part of the argument for Bitcoin&#39;s current bull run and how it isn&#39;t over just yet. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ilcf3k1yytd71.png?width=1498&amp;format=png&amp;auto=webp&amp;s=154ea8c3a1d59e15c11f4007554fbfd9ecce39f2\">Fig. 1, a five-trend line logarithmic regression graph detailing the boundaries Bitcoin for nearly 12 years</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/26ev00192ud71.png?width=1491&amp;format=png&amp;auto=webp&amp;s=dd3ce72045f65ded5df5816dbfc73f11d33237bb\">Fig. 2, a zoomed-in portion of Fig.1, detailing how we bounced off the second highest (L2) boundary before accumulating on the third highest (L3) boundary. </a></p>\n\n<p>And below are the definitions for each blue regression trend line, from top to bottom, L1-L5. Just some extra detail for anyone that is curious to take a closer look at the charting. </p>\n\n<p>L1 : The logarithmic regression top, where Bitcoin will immediately hit a bear market after such movement to this boundary. Bitcoin is too overvalued on a logarithmic standpoint from the halving&#39;s artificial scarcity, and is why such movement to this indicator will almost always proceed with a long-term bear market.</p>\n\n<p>L2: An impulsive peak top, where Bitcoin will oftentimes correct from after rapid price appreciation but with unsustainable market maturity. Just in April, we hit this level, and have since corrected to the L3 boundary line. </p>\n\n<p>L3: A mid-market support line, provides heavy resistance/ heavy support when in both bear and bull markets. If broken to the downside, almost always guarantees a short-term bear market. If broken to the upside, almost always guarantees a short-term bull market. We are currently sitting very stable on this line, meaning that the bull market is most likely NOT over, but simply accumulating for a second peak. </p>\n\n<p>L4: An average market low derived from the thousands of accumulation trends. Almost a perfect natural log function, and is extremely reliable when predicting bear market lows. Acts like a baseline to base further lines (L5, L1-L4) on.</p>\n\n<p>L5 : When price trend hits the market cycle accumulation bottom, Bitcoin will jump back up. Just a factor of the notable increasing accumulation volatility, but however fit to <em>extremely little data</em> and should not be taken literally. </p>\n\n<p>&#x200B;</p>\n\n<h1>LENGTHENING MARKET CYCLE THEORY</h1>\n\n<p>Bitcoin has held lengthening market cycle theory since its inception, which equates to more than a decade. Lengthening cycle theory is a very popular and well-recognized theory, where Bitcoin&#39;s individual market cycle&#39;s stretch with time. </p>\n\n<p>Shown in Fig. 3, both models of halvings and high-low local market cycle show how the cycles extend as they progress with age. This is a trend that has held firm for nearly 12 years, and since nothing fundamental has changed, why shouldn&#39;t this cycle act the same? History repeats itself in the same conditions, and all those conditions have been met. </p>\n\n<p>This is another contributing piece of evidence that Bitcoin&#39;s long-term bull market is not over, but simply accumulating. It may be 6 months or even a year, but another second peak is almost certain.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/a5sxvrr03ud71.png?width=1494&amp;format=png&amp;auto=webp&amp;s=5360b1033c4353b9a39cffb418b7a61a005aa7c9\">Fig. 3, an exact replica of Fig. 1 but with the two models of historical Bitcoin market cycle logarithmic emulations highlighted. Notice how each market cycle lengthens with time, for both halving cycles and high-low cycles. The pink cycle line is our current market cycle, and notice how short of a cut-off it would be compared to a the last 10 years.</a></p>\n\n<p>&#x200B;</p>\n\n<h1>HISTORICAL COMPARISONS</h1>\n\n<p>Bitcoin, quite evidently, likes to repeat history. When market circumstances and fundamentals are <em>just right</em>, it can do mind-boggling things. </p>\n\n<p>Both 2013 and 2021 market cycles had, oh goodness, a <em>Wyckoff</em> distribution, 2021&#39;s pattern compared and shown respectively in Fig. 4 and 5.  As I am sure that most of you are familiar with this topic, Wyckoff distribution patterns happen as a indicator for heavy market manipulation. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fg5nyxtncud71.png?width=975&amp;format=png&amp;auto=webp&amp;s=13983816a34e751fef357d8ac042e582c2c2c200\">Fig. 4, a textbook derivative of Wyckoff distribution, a hallmark patterning caused by heavy market manipulation (StockCharts, n.d.)</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/47g567rlcud71.png?width=1488&amp;format=png&amp;auto=webp&amp;s=fcc742809bf806d215b8479f8496e54cd0dd138b\">Fig. 5, a graph comparing Bitcoin&#39;s recent price trends to Wyckoff distribution markers. </a></p>\n\n<p>A popular theory for why it occurred was that for both 2013 and 2021 market cycles, the rapid popularity and cash audience influx caused a boat load of gullible investors to dock into the Bitcoin market. This made market manipulation both more profitable and easier to pull off, and thus the outcome. </p>\n\n<p>Proceeding massive drops in the market, and especially after heavy market manipulation like Wyckoff distribution, occur &#39;accumulation phases&#39;. Not necessarily <em>Wyckoff-style</em> accumulation phases, but times of relative market stagnation where big corporations and market manipulators fill their bags with crypto for a second peak. </p>\n\n<p>Sounds like what&#39;s going on for our current cycle, right? Massive price dropout followed by relative stagnation; and that&#39;s because this was predicted <em>miles off</em>. Figure 6 shows you emulations taken way back in near early March, which show the predicted market movement based on fundamental similarities and historical price trends. Take a moment to realize some of the obvious price trend similarities it saw coming. Not convinced? Figure 7 directly lines them up for you. </p>\n\n<p>Now following 2013&#39;s emulation patterns, you will see many more months of stagnation ahead of us before another price shoot off, and that is exactly where we are right now. The calm before the storm, remember that! This is the final substantial bit of proof of a second Bitcoin peak. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/q71k4u3i9ud71.png?width=1296&amp;format=png&amp;auto=webp&amp;s=f0d648184d8c2cb843c2a051989914491c55ea9e\">Fig. 6, a graph of emulated 2013 cycle renditions, a result of comparing two very fundamentally similar cycles. </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gtcul3iddud71.png?width=1503&amp;format=png&amp;auto=webp&amp;s=9bcb045902d63315330acff6bcc221a065cfb4fe\">Fig. 7, a zoomed in Fig. 6 but with markets lining up the intra-cycle similarities between 2021&#39;s current cycle and 2013&#39;s emulated one. </a></p>\n\n<h1>TO CONCLUDE</h1>\n\n<p>I hope this clears up any misconceptions you may have for this current market cycle, and why many people still hold firm on a longer bull-run market cycle. I&#39;ve noticed an increased amount of &#39;is this the end&#39; kind of questions in both this subreddit and real-life, and hope this will help. </p>\n\n<p>Bitcoin is going up, its a train that has been chugging from nearly 12 years. Even if you buy the top, but hodl your way through the depths, time will always be on your side. Cheers!</p>\n\n<p>&#x200B;</p>\n\n<p><em>Disclaimer: I am not your financial advisor nor does this content attempt to replicate any of the sort. This content is listed strictly for entertainment and educational purposes. When in doubt, contact your own professional. Your money, your problem.</em></p>\n\n<h1>REFERENCES</h1>\n\n<p>StockCharts. (n.d.). <em>The Wyckoff Method: A Tutorial</em>. StockCharts. Retrieved from <a href=\"https://school.stockcharts.com/doku.php?id=market_analysis:the_wyckoff_method\">https://school.stockcharts.com/doku.php?id=market_analysis:the_wyckoff_method</a> </p>\n\n<p>Aside from that one picture, all other content is original to me. If you would like to adapt any pictures or ideas, please give credit when due.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?auto=webp&s=5509dd0a0499ca678760506e54425f817096be79",
          "width": 975,
          "height": 857
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=108&crop=smart&auto=webp&s=9ec60faf7bbc02f087701efc72cd642c45b16b1e",
            "width": 108,
            "height": 94
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=216&crop=smart&auto=webp&s=c41270d9d5fd415364e85904d0005542b7c8123e",
            "width": 216,
            "height": 189
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=320&crop=smart&auto=webp&s=6e0f070360a643e94ff5ad765d28f8a033f269c1",
            "width": 320,
            "height": 281
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=640&crop=smart&auto=webp&s=47edc4caa731cbf75d1b803d4650941c05a1c156",
            "width": 640,
            "height": 562
          },
          {
            "url": "https://external-preview.redd.it/2GchqXVw2ZlWMQG_9IwoGcYkrwn90a5xV9H8O7OPkGE.jpg?width=960&crop=smart&auto=webp&s=2979c8937d42a9ae8e0a6df4b6442b4aa9393aba",
            "width": 960,
            "height": 843
          }
        ],
        "variants": {},
        "id": "ajZNWBsVks0mTqZqNwcx42a49I_8UnZLPbQinFZPyJs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/osy9mn/a_comprehensive_analysis_on_why_bitcoins_bull_run/",
  "subreddit": "CryptoCurrency",
  "id": "osy9mn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ABSTRACT\n\nFrom logarithmic regression diagrams to stock-to-flow models, this post is an\nattempt to culminate all sources of data to understand how and why Bitcoin is in\nan accumulation phase, before heading for a second, higher peak.\n\n\nLOGARITHMIC REGRESSION AND TREND LINES\n\nBitcoin has followed a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ABSTRACT\n\n対数回帰図からストック・トゥー・フロー・モデルまで、この投稿はすべてのデータソースを集大成する試みです。\nこの記事は、ビットコインがどのようにして、そしてなぜ蓄積段階にあるのかを理解するために、すべてのデータソースをまとめようとするものです。\nがどのように、そしてなぜ蓄積段階にあるのかを理解するために、すべてのデータをまとめてみました。\n\n\n対数回帰とトレンドライン\n\nビットコインは、これまでに...",
      "title": "なぜビットコインのブルランは終わらないのか、包括的に分析する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ABSTRACT\n\n从对数回归图到库存-流量模型，这个帖子是一个尝试。\n试图将所有的数据来源整合到一起，以了解比特币是如何以及为何处于\n处于积累阶段，然后走向第二个更高的峰值。\n\n\n对数回归和趋势线\n\n比特币一直遵循着...",
      "title": "全面分析为什么比特币的牛市运行还没有结束"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ABSTRACT\n\n從對數迴歸圖到庫存-流量模型，這個帖子是一個嘗試。\n試圖將所有的數據來源整合到一起，以瞭解比特幣是如何以及爲何處於\n處於積累階段，然後走向第二個更高的峯值。\n\n\n對數迴歸和趨勢線\n\n比特幣一直遵循着...",
      "title": "全面分析爲什麼比特幣的牛市運行還沒有結束"
    }
  ]
}