{
  "author": "Yo_Fadre",
  "original_created_utc": 1635817408,
  "title": "Another ALGO Post and another ALGO Noob",
  "created_utc": 1635888637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a bit late to the ALGO game, but I have just discovered how much APY the Yieldly app provides. You can stake your Yieldy or other ASAs for crazy APYs that range from 40-110%. I have always invested heavy into ALGO, and initially I honestly thought that everything else that came with ALGO was a bit corny or just too good to be true. After giving it a try and converting my ALGO through the newly released tinyman app, I am extremely excited and ridiculously high on hopium.</p>\n\n<p>Now that I got that out of the way, I am curious to know why more people are not aware of or have not spoken much about these opportunities on here. I know that many people here will say that I am shilling the coin or promoting out of my free-will, although I honestly am not. I just really want to know:</p>\n\n<p>What are your thoughts on ALGO?</p>\n\n<p>Are you staking through Yieldly and using Tinyman?</p>\n\n<p>What are is keeping you from using ALGO /Yieldly /Tinyman?</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "permalink": "/r/CryptoCurrency/comments/qktej2/another_algo_post_and_another_algo_noob/",
  "subreddit": "CryptoCurrency",
  "id": "qktej2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a bit late to the ALGO game, but I have just discovered how much APY the\nYieldly app provides. You can stake your Yieldy or other ASAs for crazy APYs\nthat range from 40-110%. I have always invested heavy into ALGO, and initially I\nhonestly thought that everything else that came with ALGO was a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はALGOのゲームに少し遅れていますが、私は今、どのくらいのAPYの\nYieldlyアプリが提供してくれます。Yieldyや他のASAを賭けて、40～110%のクレイジーなAPYを得ることができます。\n40-110%の範囲で、クレイジーなAPYを得ることができます。私はこれまでALGOに重点的に投資してきました。\n正直、ALGOに付随する他の全てのものは...と思っていました。",
      "title": "別のALGOポストと別のALGO Noob"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我加入ALGO游戏有点晚，但我刚刚发现了APY\nYieldly应用程序提供的。你可以用你的Yieldy或其他ASA进行抵押，获得疯狂的APYs\n从40-110%不等。我一直在ALGO上投入大量资金，最初我\n老实说，我认为ALGO的其他所有东西都是一种。",
      "title": "另一个ALGO帖子和另一个ALGO新手"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我加入ALGO遊戲有點晚，但我剛剛發現了APY\nYieldly應用程序提供的。你可以用你的Yieldy或其他ASA進行抵押，獲得瘋狂的APYs\n從40-110%不等。我一直在ALGO上投入大量資金，最初我\n老實說，我認爲ALGO的其他所有東西都是一種。",
      "title": "另一個ALGO帖子和另一個ALGO新手"
    }
  ]
}