{
  "author": "down_vote_magnet",
  "original_created_utc": 1634655886,
  "title": "Back in 2013 my colleague used to continually try to ridicule me in front of the whole office for buying Bitcoin",
  "created_utc": 1634661232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I used to sit next to a senior sales guy in an open plan office. In 2013 I began investing in Bitcoin and made a number of purchases over a few weeks. I tried to explain to him what it was and why I kept buying it.</p>\n\n<p>He would constantly speak down to me like I was an idiot being scammed, despite him not having the slightest understanding of how it worked. He was loud and condescending, and would deliberately make jokes at my expense.</p>\n\n<p>I always told him we&#39;ll see in a few years how it ends up - I might be wrong and lose a bit of money that I was okay risking, but it seemed like a solid early idea to me. The fact I didn&#39;t care what he was saying would mildly annoy him.</p>\n\n<p>Fuck you Rory. I&#39;m still holding it, and I know you remember me every time you read about Bitcoin in the mainstream media now.</p>\n\n<p>TL;DR - Do your own research and understand what you&#39;re buying. If you&#39;re still happy to go ahead, ignore the opinion of people who have zero knowledge of their own - they&#39;re just projecting their own fear and doubt onto you. You wouldn&#39;t take golf tips from someone who&#39;s never hit a golf ball.</p>\n</div><!-- SC_ON -->",
  "score": 232,
  "permalink": "/r/CryptoCurrency/comments/qbdefy/back_in_2013_my_colleague_used_to_continually_try/",
  "subreddit": "CryptoCurrency",
  "id": "qbdefy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I used to sit next to a senior sales guy in an open plan office. In 2013 I began\ninvesting in Bitcoin and made a number of purchases over a few weeks. I tried to\nexplain to him what it was and why I kept buying it.\n\nHe would constantly speak down to me like I was an idiot being scammed, despite\nhim…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前、オープンプランのオフィスで営業の先輩の隣に座っていました。2013年に私は\nビットコインへの投資を始め、数週間かけて何度も購入しました。私は彼に、ビットコインとは何か、なぜ買い続けるのかを説明しようとしました。\n彼にビットコインとは何か、なぜ買い続けているのかを説明しようとしました。\n\nしかし彼は、私が詐欺に遭っている馬鹿者であるかのように、常に私を見下していました。\n彼は...",
      "title": "2013年当時、私の同僚は、私がビットコインを購入したことを会社の皆の前で嘲笑し続けていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经在一个开放式办公室里坐在一个高级销售人员的旁边。在2013年，我开始\n投资比特币，并在几周内进行了一些购买。我试图\n向他解释这是什么，以及为什么我一直在买它。\n\n他不断地对我说三道四，好像我是个被骗的白痴，尽管\n他...",
      "title": "早在2013年，我的同事曾经不断地试图在整个办公室面前嘲笑我购买比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經在一個開放式辦公室裏坐在一個高級銷售人員的旁邊。在2013年，我開始\n投資比特幣，並在幾周內進行了一些購買。我試圖\n向他解釋這是什麼，以及爲什麼我一直在買它。\n\n他不斷地對我說三道四，好像我是個被騙的白癡，儘管\n他...",
      "title": "早在2013年，我的同事曾經不斷地試圖在整個辦公室面前嘲笑我購買比特幣。"
    }
  ]
}