{
  "author": "shortyafter",
  "the_new_excerpt": "I read today that if a stock is trading at 20.04 and pays a .04 dividend, on\nex-dividend day the stock will adjust down to 20.00 to reflect that dividend no\nlonger being available to buyers.\n\nI got down voted to hell for saying it's not necessarily 1:1 like that, but\nactually now I'm just confused.…",
  "original_created_utc": 1619894699,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日読んだ本によると、ある銘柄が20.04で取引されていて、0.04の配当を支払っている場合、配当落ち日にはその配当を反映して20.00に調整されるそうです。\n配当落ちの日には、その配当を反映して20.00に調整され、買い手がつかなくなるということです。\n買うことができなくなったことを反映しています。\n\n必ずしも1:1ではないと言ったことで、地獄に落とされましたが\n実際のところ、今はただ混乱しています....",
      "title": "配当金が株価にどう影響するのかわからない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天读到，如果一只股票的交易价格是20.04，支付0.04的股息，在除息日\n在除息日，该股票将调整到20.00，以反映该股息不再是\n体现出买家不再能得到该股息。\n\n我因为说不一定是这样的1:1而被投到了地狱，但是\n实际上，现在我只是感到困惑，....",
      "title": "我不明白红利如何影响股票价格。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天讀到，如果一隻股票的交易價格是20.04，支付0.04的股息，在除息日\n在除息日，該股票將調整到20.00，以反映該股息不再是\n體現出買家不再能得到該股息。\n\n我因爲說不一定是這樣的1:1而被投到了地獄，但是\n實際上，現在我只是感到困惑，....",
      "title": "我不明白紅利如何影響股票價格。"
    }
  ],
  "title": "I don't understand how dividends affect a stock price.",
  "created_utc": 1619940522,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I read today that if a stock is trading at 20.04 and pays a .04 dividend, on ex-dividend day the stock will adjust down to 20.00 to reflect that dividend no longer being available to buyers. </p>\n\n<p>I got down voted to hell for saying it&#39;s not necessarily 1:1 like that, but actually now I&#39;m just confused.  Is it actually 1:1 like that?  Does the stock price adjust down automatically by that exact amount? I was under the impression that prices were only affected by supply and demand.  What about open limit orders?  Do they automatically adjust down by that exact amount? I saw this somewhere. </p>\n\n<p>Or is it 100% due to market forces?  Since investors know they are no longer entitled to that money on ex-dividend day, they will naturally be willing to pay .04 less for the stock, thus they adjust their bid sizes accordingly. </p>\n\n<p>The info I&#39;m finding online is not clear on it.  Some sources are saying it&#39;s automatic, some are saying it&#39;s market forces (or maybe I&#39;m just being thick). Anyway, sorry for spreading misinformation in the other thread, but it would be cool if someone could actually clarify how this works.</p>\n\n<p>EDIT: Already getting conflicting information here.  So looks like I&#39;m not the only dummy.  Let&#39;s see if we can clear this up together.</p>\n\n<p>EDIT 2: So I was pretty much right.  Thanks guys for explaining it clearly to me!</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/stocks/comments/n2ok5c/i_dont_understand_how_dividends_affect_a_stock/",
  "subreddit": "stocks",
  "id": "n2ok5c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380967012
}