{
  "author": "Trevigol",
  "the_new_excerpt": "Sorry if it's considered spam but this story is taunting me and I wanted to\nshare it with someone.\n\nIn 2012 I was in university studying Computer Science.\n\nThere was a classmate who was obsessed about bitcoin, always talking about it.\n\nI remember him talking to me every day about bitcoin. He even…",
  "original_created_utc": 1612787690,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，如果它被认为是垃圾邮件，但这个故事是嘲弄我，我想。\n与人分享。\n\n2012年，我在大学里学习计算机科学。\n\n有一个同学对比特币很痴迷，总是在谈论它。\n\n我记得他每天都跟我聊比特币。他甚至...",
      "title": "2012年，我拒绝了200个btc，因为我认为他们是没用的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，如果它被認爲是垃圾郵件，但這個故事是嘲弄我，我想。\n與人分享。\n\n2012年，我在大學裏學習計算機科學。\n\n有一個同學對比特幣很癡迷，總是在談論它。\n\n我記得他每天都跟我聊比特幣。他甚至...",
      "title": "2012年，我拒絕了200個btc，因爲我認爲他們是沒用的"
    }
  ],
  "title": "In 2012 I refused 200 btc because I thought they were useless",
  "created_utc": 1612804312,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if it&#39;s considered spam but this story is taunting me and I wanted to share it with someone.</p>\n\n<p>In 2012 I was in university studying Computer Science.</p>\n\n<p>There was a classmate who was obsessed about bitcoin, always talking about it. </p>\n\n<p>I remember him talking to me every day about bitcoin. He even gave me some software to mine bitcoin by myself, I didn&#39;t even try it because I didn&#39;t care. I don&#39;t remember a lot because I just thought it was boring so I didn&#39;t listen to him. </p>\n\n<p>On summer 2012 he decided to quit the university and to move to East Europe to open a mining farm. </p>\n\n<p>He offered me to move with him and become business partners but I refused. So he offered me to go there just for one month to help him to set up the infrastructure. </p>\n\n<p>He offered me about 2000€ so I initially accepted. \nBut there was a catch: he didn&#39;t have cash because he spent everything on this project. He offered me the equivalent in bitcoin: 200btc for working 1 month. </p>\n\n<p>I asked him why he couldn&#39;t convert btc in euro and he said it was quite complicated, so I thought that if it was complicated for him, it was impossible for me. </p>\n\n<p>I told him I was sorry but I wasn&#39;t interested in working 1 month and getting paid with money I couldn&#39;t spend. </p>\n\n<p>I never cared about bitcoin in these years. I even almost forgot about this story. </p>\n\n<p>Last week I saw my ex classmate on a TV show where a reporter interviewed him about bitcoin. I discovered that he actually opened that mining farm and he became an entrepreneur. </p>\n\n<p>After I saw him I remembered about this story and I checked how much is worth a bitcoin. </p>\n\n<p>If I understood well, if I accepted and kept those 200btc now I would be a millionaire. I even discovered that there are now a lot of websites where I can easily convert bitcoins in euro or just trade bitcoins. </p>\n\n<p>I&#39;m literally shocked, I feel stupid and I would like to do something about it but clearly I lost the train and now it&#39;s too late.</p>\n</div><!-- SC_ON -->",
  "score": 652,
  "permalink": "/r/CryptoCurrency/comments/lfavqt/in_2012_i_refused_200_btc_because_i_thought_they/",
  "subreddit": "CryptoCurrency",
  "id": "lfavqt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195588
}