{
  "author": "montaigne85",
  "the_new_excerpt": "OK can we please have a technical discussion regarding the scalability of\nCardano? Instead of the regular super highly upvoted moontalk (I know this\nthread will probably be downvoted to oblivion).\n\nCardano currently only handles 7 transactions per second on-chain. Ethereum\ncurrently handles 12-15…",
  "original_created_utc": 1622418540,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cardanoのスケーラビリティに関する技術的な議論をしたいのですが。\nCardanoのスケーラビリティに関する技術的な議論をしませんか？いつもの超高投票のムーントークではなく（このスレッドはおそらく忘却の彼方にダウンバイトされるでしょうが\nスレッドはおそらく忘却の彼方にダウンボートされるでしょうが）。)\n\nCardanoは現在、オンチェーンで1秒間に7件のトランザクションしか処理していません。イーサリアム\nは現在、12～15の取引を行っています...",
      "title": "カルダノがイーサリアムよりも速いと言われる理由は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我们能不能就Cardano的可扩展性进行一次技术讨论？\nCardano的可扩展性？而不是常规的超级高票数的moontalk（我知道这个\n我知道这个话题可能会被降权到遗忘）。)\n\nCardano目前在链上每秒只能处理7笔交易。以太坊\n目前处理12-15笔交易...",
      "title": "为什么人们认为Cardano比Ethereum快？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我們能不能就Cardano的可擴展性進行一次技術討論？\nCardano的可擴展性？而不是常規的超級高票數的moontalk（我知道這個\n我知道這個話題可能會被降權到遺忘）。)\n\nCardano目前在鏈上每秒只能處理7筆交易。以太坊\n目前處理12-15筆交易...",
      "title": "爲什麼人們認爲Cardano比Ethereum快？"
    }
  ],
  "title": "Why do people think that Cardano is faster than Ethereum?",
  "created_utc": 1622431418,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OK can we please have a technical discussion regarding the scalability of Cardano? Instead of the regular super highly upvoted moontalk (I know this thread will probably be downvoted to oblivion).</p>\n\n<p>Cardano currently only handles 7 transactions per second on-chain. Ethereum currently handles 12-15 transactions per second on-chain. By tweaking some parameters in the future Cardano could potentially scale to 50 transactions per second on-chain which obviously still isn&#39;t enough for real world adoption. Cardano will scale off-chain with layer 2 solutions (Hydra). But they are awfully behind their competition in developing layer 2 support.</p>\n\n<p>Don&#39;t take my word for it, even Cardano devs on their own subreddit admit all this.</p>\n\n<p>See here: <a href=\"https://np.reddit.com/r/CryptoCurrency/comments/mxjf0w/psa_cardano_ada_runs_at_seven_7_transactions_per/\">https://np.reddit.com/r/CryptoCurrency/comments/mxjf0w/psa_cardano_ada_runs_at_seven_7_transactions_per/</a></p>\n\n<p>And here: <a href=\"https://np.reddit.com/r/Cardano_ELI5/comments/la7ptu/how_many_transactions_per_second_tps_can_cardano/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">https://np.reddit.com/r/Cardano_ELI5/comments/la7ptu/how_many_transactions_per_second_tps_can_cardano/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf</a></p>\n\n<p>So why do so many people think that Cardano is faster than Ethereum?</p>\n\n<p>Also, I made this same post intended to discuss the scalability of Cardano two days ago. It quickly rose into the top 50 posts until a bot deleted it from the frontpage stating &quot;there are already 2 posts about this coin in the top 50&quot;. But guess what, there are always 2 non-critical moonboy posts about Cardano in the top 50. So it&#39;s very unfortunate that technical discussions about this coin have no place on <a href=\"https://www.reddit.com/r/CryptoCurrency/\">r/CryptoCurrency</a>. I will therefore keep posting this daily, until the day a bot doesn&#39;t delete it.</p>\n\n<p>Edit: Since this time, this post didn&#39;t get deleted, I will add this. I have nothing against Cardano. But I have noted that there currently exists a widespread lack of knowledge regarding the scalability of blockchains in general and Cardano in particular. This is an extremely hard technical problem that haven&#39;t been solved for over 10 years. Cardano is not offering a unique quick fix to this anytime in the near future. But I am happy that we now have more projects than ever (including Cardano) that are working on it.</p>\n</div><!-- SC_ON -->",
  "score": 2077,
  "permalink": "/r/CryptoCurrency/comments/nonoj6/why_do_people_think_that_cardano_is_faster_than/",
  "subreddit": "CryptoCurrency",
  "id": "nonoj6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297917
}