{
  "author": "FuckPutinBruh",
  "original_created_utc": 1645675791,
  "title": "What are the legit chances of WW3/nuclear war happening?",
  "created_utc": 1645681119,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a selfish piece of shit, but ya know I don&amp;#39;t want me and my family to end up getting blasted off the face of the earth just bc some old ass dudes wanna invade each other.&lt;/p&gt;\n\n&lt;p&gt;Could this Russia/Ukraine thing realistically lead to full on WW3? And will there be nukes? Basically is the world as we know it about to end&lt;/p&gt;\n\n&lt;p&gt;Thinking about everyone in Ukraine. If you are Ukranian I hope you can stay safe and survive Putin&amp;#39;s bullshit&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/NoStupidQuestions/comments/t01eb3/what_are_the_legit_chances_of_ww3nuclear_war/",
  "subreddit": "NoStupidQuestions",
  "id": "t01eb3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a selfish piece of shit, but ya know I don't want me and my family to end up\ngetting blasted off the face of the earth just bc some old ass dudes wanna\ninvade each other.\n\nCould this Russia/Ukraine thing realistically lead to full on WW3? And will\nthere be nukes? Basically is the world as we…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自分勝手な人間ですが、私や私の家族が、このようなことにならないよう\n地球上から抹殺されそうな勢いだ。\n互いに侵略し合う。\n\nこのロシアとウクライナの件は、現実的に第3次世界大戦につながる可能性があるのでしょうか？そして\n核兵器はあるのか？基本的に世界は私たちのように...",
      "title": "第3次世界大戦や核戦争が起こる可能性はどのくらいあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个自私的人，但我不希望我和我的家人最终因为一些老家伙想从地球上消失而被炸死。\n就因为一些老家伙想侵略对方而被从地球表面炸掉。\n入侵对方。\n\n俄罗斯/乌克兰的事情会不会现实地导致全面的第三次世界大战？而且会不会\n会有核弹吗？基本上，这个世界是我们...",
      "title": "第三次世界大战/核战争发生的合法概率是多少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個自私的人，但我不希望我和我的家人最終因爲一些老傢伙想從地球上消失而被炸死。\n就因爲一些老傢伙想侵略對方而被從地球表面炸掉。\n入侵對方。\n\n俄羅斯/烏克蘭的事情會不會現實地導致全面的第三次世界大戰？而且會不會\n會有核彈嗎？基本上，這個世界是我們...",
      "title": "第三次世界大戰/核戰爭發生的合法概率是多少？"
    }
  ]
}