{
  "author": "FloatNuker",
  "the_new_excerpt": "Unless you were under a rock for the past 48h, you noticed what happened to weed\nstocks. It's pretty simple, we have 10x as many active users as before. Most of\nthem, I take it, are newbies who suffer from Paper Portnoy Syndrome. Let me\nbreak it down, these Paper Portnoys either:\n\nA) Buy high and…",
  "original_created_utc": 1613170249,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "除非你过去48小时都在石头下面，否则你就会注意到杂草的情况了\n股票。很简单，我们的活跃用户是以前的10倍。大部分的\n他们，我把它，是新手 谁患纸波特诺伊综合症。让我\n细数一下，这些纸波特尼要么。\n\nA)高价买入...",
      "title": "你问大麻怎么了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除非你過去48小時都在石頭下面，否則你就會注意到雜草的情況了\n股票。很簡單，我們的活躍用戶是以前的10倍。大部分的\n他們，我把它，是新手 誰患紙波特諾伊綜合症。讓我\n細數一下，這些紙波特尼要麼。\n\nA)高價買入...",
      "title": "你問大麻怎麼了？"
    }
  ],
  "title": "What happened with weed you ask?",
  "created_utc": 1613226214,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unless you were under a rock for the past 48h, you noticed what happened to weed stocks. It&#39;s pretty simple, we have 10x as many active users as before. Most of them, I take it, are newbies who suffer from <strong>Paper Portnoy Syndrome</strong>. Let me break it down, these <strong>Paper Portnoys</strong> either:</p>\n\n<p>A) Buy high and sell low to &quot;mitigate&quot; losses. Fuck these types might sell as soon as they see a 1-3% drop, literally locking in a loss instead of moving away from the screen and averaging down or holding</p>\n\n<p>B) Buy and sell upon seeing a 10-20% gain thinking to be the next wolves of wallstreet with the 500$-1k they made</p>\n\n<p>If this describes any of your tendencies, I hate to break it to you but WSB isnt for you. What was good about WSB pre-GME is we admired loss porn as much as gain porn. Fuck one of the best WSB movies of all time came out due to the bonafide retard <a href=\"https://www.reddit.com/u/BearIncarnate/\">u/BearIncarnate</a> betting his 401k on FDs SPY puts when the market was rallying for 6 months.</p>\n\n<p>A lot of us here dont mind seeing our portfolios down 30-50% on some days. Hell personally I get a lot of comfort knowing my portfolio is deep in the red because itll probs only go up from there. Every loss I incurred on the market was because I paper handed bitched and sold for a loss. Every stock I ever lost on wouldve gave me a W had I fucking held. Diamond handing is an ancient art and a skill.</p>\n\n<p>I worked in a grocery store and realized apparently even expired cheese will increase in price if you hold it long enough instead of throwing it out.</p>\n\n<p>Disclosure: I&#39;m a retard and use darts to pick my stocks so then again, what do I know?</p>\n</div><!-- SC_ON -->",
  "score": 2239,
  "permalink": "/r/wallstreetbets/comments/limy4c/what_happened_with_weed_you_ask/",
  "subreddit": "wallstreetbets",
  "id": "limy4c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728629804
}