{
  "author": "tzzui0",
  "original_created_utc": 1631529995,
  "title": "Do people actually 100% trust their SO?",
  "created_utc": 1631538755,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT3: Well, I&#39;m pretty flabbergasted. It seems like people DO 100% trust their partners. You can stop downvoting me. I wasn&#39;t trying to attack your holy principles. I was merely asking a question about something that I cannot wrap my mind around in the slightest. No need to feel offended or attacked. I always assumed people meant it figuratively when talking about complete trust. Looks like they didn&#39;t...Also there is an extreme amount of ableism in here. </p>\n\n<p>EDIT2: Another question that came up in my mind: Why do people react so harshly (downvotes) when someone is questioning their trust? Is it because im challenging/questioning the validity of their world bearing pillars, so to say? Why are people becoming so hostile over a &quot;simple&quot; question?</p>\n\n<p>People always talk about how important trust is, that they trust their SO without doubt and that you can&#39;t have a proper relationship if you don&#39;t trust him/her completely.</p>\n\n<p>I&#39;ve always found this odd. I have never trusted anyone completely and never will. Imho it&#39;s naive thinking. I think that anyone can be corrupted and that you can&#39;t even trust yourself. (I haven&#39;t had any &quot;traumatic&quot; events in that regards either; if that&#39;s what you&#39;re thinking)</p>\n\n<p>Right now, I know that I wouldn&#39;t cheat on my SO, but there is no way knowing that it&#39;ll stay like this in the future. I might &quot;slip up&quot; while being drunk, I might just meet my &quot;soulmate&quot; and cheat on my SO on a whim. Realistically, you cannot have 100% certainty. Yet some people seem to have that. Are they all delusional? Is it some kind of protection mechanism? I want to understand.</p>\n\n<p>EDIT: well, I&#39;m getting a lot of shit. Not sure why people are getting this mad exactly. Maybe because I&#39;m questioning their loyalty. So far, I still haven&#39;t really understood how people 100% trust, but apparently many just do it. I can only assume that it works like religion (Which I also don&#39;t understand at all). You simply trust because you do, you simply believe beause you do, there is no explanation/reasoning/logic behind it. Must be nice for you people to be able to think like that. I might be a bit jealous.</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/TooAfraidToAsk/comments/pncyir/do_people_actually_100_trust_their_so/",
  "subreddit": "TooAfraidToAsk",
  "id": "pncyir",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EDIT3: Well, I'm pretty flabbergasted. It seems like people DO 100% trust their\npartners. You can stop downvoting me. I wasn't trying to attack your holy\nprinciples. I was merely asking a question about something that I cannot wrap my\nmind around in the slightest. No need to feel offended or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT3です。驚きましたね。人々はパートナーを100％信頼しているようです。\nパートナーを100％信頼しているようです。私をダウンボットするのはやめてください。私はあなたの聖なる理念を攻撃するつもりはありませんでした。\n批判したわけではありません。ただ、私の中でどうしても理解できないことを質問しただけです。\n疑問に思っただけです。気分を害する必要はありません。",
      "title": "人は実際にSOを100％信頼しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "EDIT3: 好吧，我很吃惊。看起来人们确实100%信任他们的\n伙伴。你可以不用再给我降权了。我并不是要攻击你的神圣\n原则。我只是问了一个我无法理解的问题。\n思考的问题。没有必要感到被冒犯或...",
      "title": "人们是否真的100%信任他们的SO？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "EDIT3: 好吧，我很喫驚。看起來人們確實100%信任他們的\n夥伴。你可以不用再給我降權了。我並不是要攻擊你的神聖\n原則。我只是問了一個我無法理解的問題。\n思考的問題。沒有必要感到被冒犯或...",
      "title": "人們是否真的100%信任他們的SO？"
    }
  ]
}