{
  "author": "cfmonkey45",
  "original_created_utc": 1659458640,
  "title": "NASA stated that they've recorded massive solar flares that are likely to hit Earth and cause geomagnetic storms. What exactly does this mean, and what are the risks?",
  "created_utc": 1659468054,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From Newsweek&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;NASA has spotted a bright solar flare erupting from the side of the sun, suggesting a particularly active solar region could be rotating this way.&lt;/p&gt;\n\n&lt;p&gt;The flare can be seen in the &lt;a href=\"https://sdo.gsfc.nasa.gov/data/latest48.php?q=0304\"&gt;video&lt;/a&gt; above that was captured by &lt;a href=\"https://www.newsweek.com/topic/nasa\"&gt;NASA&lt;/a&gt;&amp;#39;s Solar Dynamics Observatory on Sunday. In it, a contorted plasma structure can be seen moving on the left-hand side of the sun shortly before it erupts into space.&lt;/p&gt;\n\n&lt;p&gt;Solar flares are eruptions of electromagnetic radiation from the sun that travel at the speed of light. The increased levels of X-ray and extreme ultraviolet radiation carried by flares can have an effect on Earth&amp;#39;s ionosphere—a region of the atmosphere containing electrically-charged particles.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.newsweek.com/nasa-solar-flare-erupts-sun-source-sunspot-1729706\"&gt;https://www.newsweek.com/nasa-solar-flare-erupts-sun-source-sunspot-1729706&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Some articles are more sensationalist, suggesting that it could knock out radios and electrical devices.&lt;/p&gt;\n\n&lt;p&gt;What exactly does this mean from a scientific perspective, and what are the risks associated with it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 131,
  "permalink": "/r/askscience/comments/wegkgq/nasa_stated_that_theyve_recorded_massive_solar/",
  "subreddit": "askscience",
  "id": "wegkgq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From Newsweek\n\n\"NASA has spotted a bright solar flare erupting from the side of the sun,\nsuggesting a particularly active solar region could be rotating this way.\n\nThe flare can be seen in the video\n[https://sdo.gsfc.nasa.gov/data/latest48.php?q=0304] above that was captured by\nNASA…"
}