{
  "author": "002timmy",
  "original_created_utc": 1646223665,
  "title": "A Balanced Portfolio Should Consist of at least 70% BTC, 60% ETH, 30% top 15 alts, 20% stables, and 10% low cap",
  "created_utc": 1646235647,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been seeing a lot of people post about adding BTC and ETH to their portfolio and asking questions how they should split up their portfolio. In this thread, I will share my experience on the perfect breakdown. &lt;/p&gt;\n\n&lt;p&gt;To start, you want at least 70% in BTC. This is the granddaddy of all coins and your most stable. The higher the percentage of BTC, the better.&lt;/p&gt;\n\n&lt;p&gt;Next is ETH, I’ve found 60% is a good level. Even if you just have BTC and ETH, you will have 130% of your portfolio in 2 coins, up for 100% you started with. To instantly have 30% more, you are genius. &lt;/p&gt;\n\n&lt;p&gt;Next up is the large-cap alts. I like 30% here. You can LRDYOR (let Redditors do your own research) to decide which coin is best for you, but possible examples are SOL, ADA, DOT, LINK, AVAX, etc. Following advice up to this point, you have at least 160% portfolio. &lt;/p&gt;\n\n&lt;p&gt;Keeping 20% stables is key to any portfolio. You can earn interest (up to 20%) on stables, plus any price action. I saw one tik-tok’er predict Tether would go to $5 this year. I think that’s bullish, but I can easily see USDT going to $3. Let’s say you earn 20% interest on your 20% investment, you now have 40% (compounding interest works wonders). Now your portfolio allocation is at 200% and you have doubled your money. &lt;/p&gt;\n\n&lt;p&gt;Now that you have doubled your money, going for 100% portfolio allocation to 200%, you have freedom to gamble on low cap coins. I’d keep this to 10%. &lt;/p&gt;\n\n&lt;p&gt;This strategy will work for everyone. It will instantly turn you into a billionaire overnight. Follow me for more financial advice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 686,
  "permalink": "/r/CryptoCurrency/comments/t4yy7f/a_balanced_portfolio_should_consist_of_at_least/",
  "subreddit": "CryptoCurrency",
  "id": "t4yy7f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been seeing a lot of people post about adding BTC and ETH to their\nportfolio and asking questions how they should split up their portfolio. In this\nthread, I will share my experience on the perfect breakdown.\n\nTo start, you want at least 70% in BTC. This is the granddaddy of all coins and\nyour…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCとETHを追加する投稿をよく見かけるようになりました。\nポートフォリオをどのように分けたらいいのかという質問があります。この\nこのスレッドでは、完璧な内訳について私の経験を共有します。\n\nまず、BTCは最低でも70%は欲しいところです。これはすべてのコインの祖父であり\nあなたの...",
      "title": "バランスのとれたポートフォリオは、少なくとも70％のBTC、60％のETH、30％のトップ15アルト、20％のステーブル、10％のローキャップで構成されるべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人发帖说要在他们的投资组合中加入BTC和ETH，并询问他们应该如何分配他们的投资组合。\n并询问他们应该如何分割他们的投资组合。在这个\n我将与大家分享我对完美投资组合的经验。\n\n首先，你需要至少70%的BTC。这是所有硬币中的鼻祖，而且\n你的...",
      "title": "一个平衡的投资组合应该包括至少70%的BTC，60%的ETH，30%的前15名alts，20%的stables，以及10%的low cap。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人發帖說要在他們的投資組合中加入BTC和ETH，並詢問他們應該如何分配他們的投資組合。\n並詢問他們應該如何分割他們的投資組合。在這個\n我將與大家分享我對完美投資組合的經驗。\n\n首先，你需要至少70%的BTC。這是所有硬幣中的鼻祖，而且\n你的...",
      "title": "一個平衡的投資組合應該包括至少70%的BTC，60%的ETH，30%的前15名alts，20%的stables，以及10%的low cap。"
    }
  ]
}