{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Nassim Taleb**\n\n# **Fooled by Randomness**\n\n- Survivorship Bias means you don&amp;#39;t hear from the losers on a topic, you only hear from the winners.\n  - Watch out judging a person by their results because history will only show you the winners. You won&amp;#39;t hear the stories of the losers\n- Over short terms, you see variance, not returns. Don&amp;#39;t monitor your portfolio on a daily basis\n- AFTER an event has occurred, it is easy to make a story as to why it happened and why people should have seen it. But it is difficult to see in advance BEFORE it happens\n  - Events are more random than we think\n- Negative pangs cause a 2.5x more emotional response than a positive one\n- It is not how likely an event is to happen that matters, it is how much is made or lost when it happens that should be the consideration\n  - Maximize your profit expectancy, not probability\n- I try to benefit from &amp;quot;rare events&amp;quot;, events that do not tend to repeat themselves frequently\n- I believe that rare events are not fairly valued, and that the rarer the event, the more undervalued it will be in price\n- Investors for pure emotional reasons, will be drawn into strategies that experience rare but large variations.\n- Pascal&amp;#39;s Wager – The optimal strategy for humans is to believe in God because if God does exist the believer will be rewarded and if he doesn&amp;#39;t exist, the believer has nothing to lose.\n  - IE - Inequality of outcomes, don&amp;#39;t try to pick up nickels in front of a train\n- There is no point in searching for patterns that are available to everyone; once detected, they would be self-canceling\n- &amp;quot;One cannot judge a performance in any given field by the results, but by the costs of the alternative (i.e. if history played out in a different way). Such substitutes courses of events are called alternative histories. Cleary the quality of a decision cannot be solely judged based on its outcome.\n- Past events will always look less random than they were (hindsight bias)\n- Probability almost never presents itself as a mathematical problem or brain teaser\n- No one accepts randomness in their success, only in their failure\n- Take into account the costs of mistakes\n- Bad information is worse than no information at all\n- 5 traits of a Market Fool\n  - Overestimating accuracy of data or overconfidence\n  - Getting married to positions\n  - Changing story\n  - No plans for taking losses or exit strategy\n  - Denial of luck and randomness\n\n# **The Black Swan**\n\n- 3 attributes for a black swan\n  - A black swan is an outlier, as in outside the realm of regular expectations\n  - Carries extreme impact\n  - Human nature makes us concoct explanations for its occurrence _ **after** _ the fact\n    - Rare, Extreme Impact and Retrospective predictability\n- There are great problems with trying to forecast the future, given limited knowledge of the past\n- Black swans being unpredictable, we need to adjust to their existence rather than naively try to predict them\n- The human mind suffers from 3 ailments as it comes into contact with history\n  - The illusion of understanding or how everyone thinks they know what is going on in a world that is more complicated (or random) than they realize\n  - Retrospective distortion or how we assess matter only after the fact (history seems clearer and more organized in books than in empirical reality)\n  - Overvaluation of factual information\n- Taleb realized that he was totally incapable of predicting market prices, but that others were just as incapable as him but did not know it or did not know that they were taking massive risks. Most traders were just picking up pennies in front of a steamroller\n- 2 types of randomness analogy\n  - Mediocristan – land of average\n  - Extremistan – land of black swans\n    - Mediocristan - When your sample is large; no single instance will significantly change the aggregate or total. The largest observation will remain impressive, but insignificant to the sum. IE – Human weights, Human heights, car accidents, IQ\n      - Black swans don&amp;#39;t occur here. Once you collect enough data should reveal all you need to know and if you do have a surprise, it won&amp;#39;t be consequential. Collecting data here is ok. What you can learn from data in Mediocristan augments very rapidly with the supply of information. You can predict here.\n    - Extemistan – inequalities are such that one single observation can disproportionately impact the aggregate or the total. IE – wealth, income, book sales per author, financial markets, commodity prices, inflation rates, economic data\n      - Black swans do occur here. You will have trouble figuring out the average from any sample since it can depend so much on one single observation. Be suspicious of the knowledge of the data you collect here. Knowledge here grows slowly and erratically with the addition of data. Difficult or even impossible to predict.\n- Black Swan Example – Consider a turkey that is fed every day. Every single feeding will firm up the bird&amp;#39;s belief that it is the general rule of life to be fed every day by friendly humans &amp;quot;looking out for my best interests&amp;quot;. But the Wednesday before Thanksgiving something unexpected will happen to the turkey. It will occur a revision of belief. Ironically, the turkeys feeling of safety had reached a maximum when the risk was the highest.\n  - The turkey had &amp;quot;learned backwards&amp;quot; from observation\n  - oHow can we know the future, given finite knowledge of the past?\n  - Something may have worked in the past until, well it doesn&amp;#39;t. You don&amp;#39;t drive your car looking in the rear-view mirror.\n    - Before 1987, the biggest single day drop in the Dow was 13% so some people incorrectly concluded from the past that they most the Dow could drop in a day was 13%. It dropped 22% on &amp;quot;Black Monday&amp;quot;\n- Positive Black Swans take time to show their effects while negative black swans happen very quickly\n- Absence of evidence is not evidence of absence\n- Naïve Empiricism – We tend to have a tendency to look for instances that confirm our story and our vision of the world and these instances are easy to find. You take past instances that corroborate your theories and treat them as evidence.\n- Negative Empiricism - The way to counter your Naïve Empiricism is to understand that a series of corroborative facts is not _Necessarily_ evidence.\n  - Seeing White Swans does not confirm the nonexistence of Black Swans.\n- The error of confirmation - We are quick to draw conclusions from what we have seen to what is unseen.\n- Confirmation Bias – our natural tendency to look only for corroboration of our ideas.\n  - To counter this George Soros was known when taking a financial bet to keep looking for evidence or instances to prove his initial theory wrong\n- Narrative Fallacy – this is associated with our vulnerability to overinterpretation and our predilection for compact stories over raw truths. It severely distorts our mental representation of the world, especially rare events\n  - We tend to look at sequences of facts and weave them into an explanation. Explanations bind these facts together. Making them easy to remember. They help us make more sense of the facts. Because our brains can&amp;#39;t store all that information. Stories stick, statistics don&amp;#39;t\n    - The more you summarize, the more order you put in, the less randomness. The same condition that makes us simplify pushes us to think that the world is less random that it actually is.\n- In some strategies, you gamble dollars to win a succession of pennies while appearing to be winning all the time. In other strategies, you risk a succession of pennies to win dollars. In other words, you bet either that the black swan will or won&amp;#39;t happen. These require completely different mind sets.\n  - Most people have a preference for number 1\n  - Some bets in which one wins big but infrequently, yet loses small but frequently, are worth making if others are suckers for them and if you have the personal and intellectual stamina\n- We favor the narrated. We are not manufactured to understand abstract matters, we need context. Randomness and uncertainty are abstractions. We respect what has happened, ignoring what could have happened.\n- Our ideas are sticky: once we produce a theory, we are not likely to change our minds. When you develop your opinions on the basis of weak evidence, you will have difficulty interpreting subsequent information that contradicts these opinions. So those who delay developing their theories are better off\n- We humans are the victims of an asymmetry in the perception of random events. We attribute our success to our skills, and our failures to external events outside our control, namely to randomness. We feel responsible for the good, but not for the bad.\n- Taleb&amp;#39;s Perfect World – &amp;quot;Think of someone heavily introspective, tortured by the awareness of his own ignorance. He lacks the courage of the idiot, yet has the rare guts to say &amp;quot;I don&amp;#39;t know.&amp;quot; He does not mind looking like a fool. He hesitates, he will not commit, and he agonizes over the consequences of being wrong. He introspects, introspects, and introspects until he reaches physical and mental exhaustion. This does not mean he lacks confidence, only that he holds his own knowledge to be suspect.\n- Louis Pasteur – &amp;quot;Luck favors the prepared&amp;quot;\n- The black swan asymmetry allows you to be confident about what is wrong, not about what you believe is right\n- So, what to do if you can&amp;#39;t predict in a world with Black Swans??\n  - Avoid unnecessary dependence on large scale harmful predictions. Be fooled in small matters, not large. Example – don&amp;#39;t accept the government forecast for SS payments 50 years from now.\n  - Do not listen to economic forecasters or to predictions\n  - Be prepared! Be prepared for all relevant eventualities\n  - People are often ashamed of losses, so they engage in strategies that produce very little volatility but contain the risk of large loss.\n  - Barbell Strategy\n    - Be as hyper-conservative and hyper-aggressive and you can instead of being mildly aggressive or conservative\n    - Put 80-90% in extremely safe investments – (Example – T-Bills)\n    - Put the other 10-20% in extremely speculative investments (Example – VC)\n    - You have no risk on one side and high risk on the other, which equals out to medium risk. This minimizes your risk of negative black swans and exposures you to positive black swans\n    - Put yourself in situations where favorable consequences are much larger than unfavorable ones\n    - I am very aggressive when I can gain exposure to positive Black Swans and very conservative when I am under threat from a negative Black Swan\n\n# **Anti-Fragile**\n\n- Fragile-Robust-Antifragile. Fragile wants tranquility, Antifragile grows from disorder and robust doesn&amp;#39;t care too much\n- Some things benefit from shocks; they thrive and grow when exposed to volatility, randomness, disorder, and stressors and love adventure, risk, and uncertainty. This is Antifragile. The opposite is fragile\n- Antifragility is beyond resilience or robustness. The resilient resists shocks and stays the same; the antifragile gets stronger\n- I would rather be dumb and antifragile than smart and fragile\n  - It is much easier to figure out if something is fragile than to predict the occurrence of an event that may harm it.\n- Asymmetry: anything that has more upside than downside from random events is antifragile; the reverse is fragile\n- Fragile needs to be very predictive in its approach, and conversely, predictive systems cause fragility\n- For the economy to be antifragile as a whole, individual companies must be fragile. We don&amp;#39;t have this currently\n  - Many government interventions and social policies end up hurting the weak and consolidating the established\n- We are fragilizing social and economic systems by denying them stressors and randomness\n- We make social, political (and other) systems vulnerable to Black Swans when we over stabilize them\n- The problem with artificially suppressed volatility is not just that the system tends to become extremely fragile; it is that, at the same time, it exhibits no visible risks. They become prone to black swan events\n- Attempts at eliminating the business cycle led to more fragile economic systems (IE – The Greenspan Put)\n  - Part of this is due to the fact it is easier to sell &amp;quot;Look what I did for you&amp;quot; than &amp;quot;Look what I avoided for you.&amp;quot;\n- Our track record in figuring out significant rare events in politics and economics is about zero\n- What makes life simple is that the robust and antifragile don&amp;#39;t have to have as accurate a comprehension of the world as the fragile, and they do not need to forecast\n  - A person with extra cash in the bank and stockpiles of tradeable goods and gold bars doesn&amp;#39;t need to forecast correctly.\n  - People in debt are fragile and need a lot more forecasting ability\n- There are 2 types of domains\n  - Those we can somewhat predict. IE – The physical like planet motions\n  - Those that we cannot. IE - The Black Swan – Social, Economic, and Cultural life\n- The first step toward antifragility consists in first decreasing downside, rather than increasing upside. That means lowering exposure to negative black swans\n- What matters is the route taken, the order of events, not just the destination – what scientists call path-dependent property\n  - Example – A kidney stone operation and anesthesia after is very different than the opposite\n- People miss the strong logical precedence of survival over success\n- In other words, if something is fragile, its risk of breaking make anything you do to improve it or make it &amp;quot;efficient&amp;quot; inconsequential unless you first reduce that risk of breaking\n- Barbell Strategy or Bimodal Strategy\n  - Combination of 2 extreme areas with nothing in the middle\n    - Playing it safe in some areas – robust to black swans\n    - Taking a lot of small risks in other – open to positive black swans\n      - The whole then becomes antifragile\n- The causes extreme risk aversion on one side and extreme risk loving on the other\n  - But the barbell also results, because of its construction, in the reduction of downside risk – the elimination of the risk of ruin\n- Antifragility is the combination aggressiveness plus paranoia, protect your downside from extreme harm, and let the upside take care of itself\n- Yiddish proverb &amp;quot;Provide for the worst; the best can take care of itself.&amp;quot;\n  - Many people tend to provide for the best and hope the worst takes care of itself\n- Example of above\n  - People find insuring their house a necessity, not something to be judged against a financial strategy, but when it comes to their portfolios, because of the way things are framed in the press, they don&amp;#39;t look at them the same way.\n  - They think that the barbell strategy needs to be examined for its potential return as an investment. That is NOT the point. The barbell is simply an idea of insurance of survival\n- When you are fragile, you need to know a lot more than when you are antifragile. Conversely, when you think you know more than you do, you are fragile to error.\n  - Overconfidence leads to reliance on forecasts, which causes borrowing, then to the fragility of leverage. Example – Long Term Capital Management (LTCM)\n- Absence of evidence is not evidence of absence\n- Much of what other people know isn&amp;#39;t worth knowing\n- Non-linear means that the response is not straightforward and not in a straight line, so if you double say, the dose, you get a lot more or a lot less than double the effect.\n- For the fragile, shocks bring higher and higher harm as their intensity increases (up to a point)\n  - Example – Falling from a height of 30ft one time brings more than 30 times the harm of falling 30 times from a height of 1ft\n- What is fragile is something that is both unbroken and subjected to nonlinear effects\n- The fragile is hurt a lot more by extreme events than by a succession of intermediate ones\n- For the antifragile, shocks bring more benefits as their intensity increases (up to a point)\n  - Example – powerlifters get more benefits lifting 300 lbs one time than 1 lb 300 times\n    - Every additional pound brings more benefits, until one gets close to the limit, what would be known as &amp;quot;failure&amp;quot;\n- Convexity effect analogy (Positive and Negative) Think of a smile (+) and frown (-)\n  - Positive – Convex – Think Happy face - Gain more than pain. Likes volatility. If for a given variation, you have more upside than downside, it will be convex (slopes up)\n  - Negative - Concave – Think Sad face – Pain more than gain. Dislikes volatility. If for a given variation, you have more downside than upside, it will be concave (slopes down). The more harm from the unexpected. Large deviations have a disproportionately larger and larger effect (acceleration)\n- The inverse philosophers stone or how to detect fragility\n  - Figure out if our miscalculations or mis forecasts are on balance more harmful than they are beneficial, and how accelerating the damage will be.\n    - You don&amp;#39;t have to be exact with this measurement. You can get a scale that isn&amp;#39;t zeroed and know if you are gaining or losing weight. I can have a non-exact ruler and know if my child is growing or not.\n  - Example – Government deficits are particularly concave to changes in economic conditions. Every additional deviation in, say, the unemployment rate, particularly when the government has debt, makes deficits incrementally worse.\n  - Financial leverage for a company has the same effect: you need to borrow more and more to get the same result\n- Average (First order effects) do not matter\n  - &amp;quot;Do not cross a river if it is on average 4ft deep&amp;quot;\n  - Analogy – You grandmother will spend the next 2 hours at 70 degrees (Perfect Grandmother Temp).\n    - But there is also a second point of the data – she will spend the first hour at 0 and the 2nd hour at 140 for an average of 70\n    - Temp changes become more and more harmful as they deviate from 70. And the 2nd piece of information, the variability, turned out to be more important than the first.\n  - Point of above – The notion of average is of no significance when one is fragile to variations\n    - Grandmother is non-linear to temperature (response is not a straight line), it curves inward (concave), the more nonlinear the response, the less relevant the average\n- Many people are drawn to financial markets because we hear or see the success, but the failures are buried and we don&amp;#39;t hear about them",
  "author_fullname": "t2_6ucr2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Nassim Taleb Fooled by Randomness, The Black Swan, And AntiFragile Book Summaries",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "resources",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rasfya",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 63,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Resources",
  "can_mod_post": false,
  "score": 63,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1638857654,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nassim Taleb**&lt;/p&gt;\n\n&lt;h1&gt;&lt;strong&gt;Fooled by Randomness&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Survivorship Bias means you don&amp;#39;t hear from the losers on a topic, you only hear from the winners.\n\n&lt;ul&gt;\n&lt;li&gt;Watch out judging a person by their results because history will only show you the winners. You won&amp;#39;t hear the stories of the losers&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Over short terms, you see variance, not returns. Don&amp;#39;t monitor your portfolio on a daily basis&lt;/li&gt;\n&lt;li&gt;AFTER an event has occurred, it is easy to make a story as to why it happened and why people should have seen it. But it is difficult to see in advance BEFORE it happens\n\n&lt;ul&gt;\n&lt;li&gt;Events are more random than we think&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Negative pangs cause a 2.5x more emotional response than a positive one&lt;/li&gt;\n&lt;li&gt;It is not how likely an event is to happen that matters, it is how much is made or lost when it happens that should be the consideration\n\n&lt;ul&gt;\n&lt;li&gt;Maximize your profit expectancy, not probability&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;I try to benefit from &amp;quot;rare events&amp;quot;, events that do not tend to repeat themselves frequently&lt;/li&gt;\n&lt;li&gt;I believe that rare events are not fairly valued, and that the rarer the event, the more undervalued it will be in price&lt;/li&gt;\n&lt;li&gt;Investors for pure emotional reasons, will be drawn into strategies that experience rare but large variations.&lt;/li&gt;\n&lt;li&gt;Pascal&amp;#39;s Wager – The optimal strategy for humans is to believe in God because if God does exist the believer will be rewarded and if he doesn&amp;#39;t exist, the believer has nothing to lose.\n\n&lt;ul&gt;\n&lt;li&gt;IE - Inequality of outcomes, don&amp;#39;t try to pick up nickels in front of a train&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;There is no point in searching for patterns that are available to everyone; once detected, they would be self-canceling&lt;/li&gt;\n&lt;li&gt;&amp;quot;One cannot judge a performance in any given field by the results, but by the costs of the alternative (i.e. if history played out in a different way). Such substitutes courses of events are called alternative histories. Cleary the quality of a decision cannot be solely judged based on its outcome.&lt;/li&gt;\n&lt;li&gt;Past events will always look less random than they were (hindsight bias)&lt;/li&gt;\n&lt;li&gt;Probability almost never presents itself as a mathematical problem or brain teaser&lt;/li&gt;\n&lt;li&gt;No one accepts randomness in their success, only in their failure&lt;/li&gt;\n&lt;li&gt;Take into account the costs of mistakes&lt;/li&gt;\n&lt;li&gt;Bad information is worse than no information at all&lt;/li&gt;\n&lt;li&gt;5 traits of a Market Fool\n\n&lt;ul&gt;\n&lt;li&gt;Overestimating accuracy of data or overconfidence&lt;/li&gt;\n&lt;li&gt;Getting married to positions&lt;/li&gt;\n&lt;li&gt;Changing story&lt;/li&gt;\n&lt;li&gt;No plans for taking losses or exit strategy&lt;/li&gt;\n&lt;li&gt;Denial of luck and randomness&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;&lt;strong&gt;The Black Swan&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;3 attributes for a black swan\n\n&lt;ul&gt;\n&lt;li&gt;A black swan is an outlier, as in outside the realm of regular expectations&lt;/li&gt;\n&lt;li&gt;Carries extreme impact&lt;/li&gt;\n&lt;li&gt;Human nature makes us concoct explanations for its occurrence _ &lt;strong&gt;after&lt;/strong&gt; _ the fact&lt;/li&gt;\n&lt;li&gt;Rare, Extreme Impact and Retrospective predictability&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;There are great problems with trying to forecast the future, given limited knowledge of the past&lt;/li&gt;\n&lt;li&gt;Black swans being unpredictable, we need to adjust to their existence rather than naively try to predict them&lt;/li&gt;\n&lt;li&gt;The human mind suffers from 3 ailments as it comes into contact with history\n\n&lt;ul&gt;\n&lt;li&gt;The illusion of understanding or how everyone thinks they know what is going on in a world that is more complicated (or random) than they realize&lt;/li&gt;\n&lt;li&gt;Retrospective distortion or how we assess matter only after the fact (history seems clearer and more organized in books than in empirical reality)&lt;/li&gt;\n&lt;li&gt;Overvaluation of factual information&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Taleb realized that he was totally incapable of predicting market prices, but that others were just as incapable as him but did not know it or did not know that they were taking massive risks. Most traders were just picking up pennies in front of a steamroller&lt;/li&gt;\n&lt;li&gt;2 types of randomness analogy\n\n&lt;ul&gt;\n&lt;li&gt;Mediocristan – land of average&lt;/li&gt;\n&lt;li&gt;Extremistan – land of black swans&lt;/li&gt;\n&lt;li&gt;Mediocristan - When your sample is large; no single instance will significantly change the aggregate or total. The largest observation will remain impressive, but insignificant to the sum. IE – Human weights, Human heights, car accidents, IQ\n\n&lt;ul&gt;\n&lt;li&gt;Black swans don&amp;#39;t occur here. Once you collect enough data should reveal all you need to know and if you do have a surprise, it won&amp;#39;t be consequential. Collecting data here is ok. What you can learn from data in Mediocristan augments very rapidly with the supply of information. You can predict here.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Extemistan – inequalities are such that one single observation can disproportionately impact the aggregate or the total. IE – wealth, income, book sales per author, financial markets, commodity prices, inflation rates, economic data\n\n&lt;ul&gt;\n&lt;li&gt;Black swans do occur here. You will have trouble figuring out the average from any sample since it can depend so much on one single observation. Be suspicious of the knowledge of the data you collect here. Knowledge here grows slowly and erratically with the addition of data. Difficult or even impossible to predict.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Black Swan Example – Consider a turkey that is fed every day. Every single feeding will firm up the bird&amp;#39;s belief that it is the general rule of life to be fed every day by friendly humans &amp;quot;looking out for my best interests&amp;quot;. But the Wednesday before Thanksgiving something unexpected will happen to the turkey. It will occur a revision of belief. Ironically, the turkeys feeling of safety had reached a maximum when the risk was the highest.\n\n&lt;ul&gt;\n&lt;li&gt;The turkey had &amp;quot;learned backwards&amp;quot; from observation&lt;/li&gt;\n&lt;li&gt;oHow can we know the future, given finite knowledge of the past?&lt;/li&gt;\n&lt;li&gt;Something may have worked in the past until, well it doesn&amp;#39;t. You don&amp;#39;t drive your car looking in the rear-view mirror.&lt;/li&gt;\n&lt;li&gt;Before 1987, the biggest single day drop in the Dow was 13% so some people incorrectly concluded from the past that they most the Dow could drop in a day was 13%. It dropped 22% on &amp;quot;Black Monday&amp;quot;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Positive Black Swans take time to show their effects while negative black swans happen very quickly&lt;/li&gt;\n&lt;li&gt;Absence of evidence is not evidence of absence&lt;/li&gt;\n&lt;li&gt;Naïve Empiricism – We tend to have a tendency to look for instances that confirm our story and our vision of the world and these instances are easy to find. You take past instances that corroborate your theories and treat them as evidence.&lt;/li&gt;\n&lt;li&gt;Negative Empiricism - The way to counter your Naïve Empiricism is to understand that a series of corroborative facts is not &lt;em&gt;Necessarily&lt;/em&gt; evidence.\n\n&lt;ul&gt;\n&lt;li&gt;Seeing White Swans does not confirm the nonexistence of Black Swans.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The error of confirmation - We are quick to draw conclusions from what we have seen to what is unseen.&lt;/li&gt;\n&lt;li&gt;Confirmation Bias – our natural tendency to look only for corroboration of our ideas.\n\n&lt;ul&gt;\n&lt;li&gt;To counter this George Soros was known when taking a financial bet to keep looking for evidence or instances to prove his initial theory wrong&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Narrative Fallacy – this is associated with our vulnerability to overinterpretation and our predilection for compact stories over raw truths. It severely distorts our mental representation of the world, especially rare events\n\n&lt;ul&gt;\n&lt;li&gt;We tend to look at sequences of facts and weave them into an explanation. Explanations bind these facts together. Making them easy to remember. They help us make more sense of the facts. Because our brains can&amp;#39;t store all that information. Stories stick, statistics don&amp;#39;t&lt;/li&gt;\n&lt;li&gt;The more you summarize, the more order you put in, the less randomness. The same condition that makes us simplify pushes us to think that the world is less random that it actually is.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;In some strategies, you gamble dollars to win a succession of pennies while appearing to be winning all the time. In other strategies, you risk a succession of pennies to win dollars. In other words, you bet either that the black swan will or won&amp;#39;t happen. These require completely different mind sets.\n\n&lt;ul&gt;\n&lt;li&gt;Most people have a preference for number 1&lt;/li&gt;\n&lt;li&gt;Some bets in which one wins big but infrequently, yet loses small but frequently, are worth making if others are suckers for them and if you have the personal and intellectual stamina&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;We favor the narrated. We are not manufactured to understand abstract matters, we need context. Randomness and uncertainty are abstractions. We respect what has happened, ignoring what could have happened.&lt;/li&gt;\n&lt;li&gt;Our ideas are sticky: once we produce a theory, we are not likely to change our minds. When you develop your opinions on the basis of weak evidence, you will have difficulty interpreting subsequent information that contradicts these opinions. So those who delay developing their theories are better off&lt;/li&gt;\n&lt;li&gt;We humans are the victims of an asymmetry in the perception of random events. We attribute our success to our skills, and our failures to external events outside our control, namely to randomness. We feel responsible for the good, but not for the bad.&lt;/li&gt;\n&lt;li&gt;Taleb&amp;#39;s Perfect World – &amp;quot;Think of someone heavily introspective, tortured by the awareness of his own ignorance. He lacks the courage of the idiot, yet has the rare guts to say &amp;quot;I don&amp;#39;t know.&amp;quot; He does not mind looking like a fool. He hesitates, he will not commit, and he agonizes over the consequences of being wrong. He introspects, introspects, and introspects until he reaches physical and mental exhaustion. This does not mean he lacks confidence, only that he holds his own knowledge to be suspect.&lt;/li&gt;\n&lt;li&gt;Louis Pasteur – &amp;quot;Luck favors the prepared&amp;quot;&lt;/li&gt;\n&lt;li&gt;The black swan asymmetry allows you to be confident about what is wrong, not about what you believe is right&lt;/li&gt;\n&lt;li&gt;So, what to do if you can&amp;#39;t predict in a world with Black Swans??\n\n&lt;ul&gt;\n&lt;li&gt;Avoid unnecessary dependence on large scale harmful predictions. Be fooled in small matters, not large. Example – don&amp;#39;t accept the government forecast for SS payments 50 years from now.&lt;/li&gt;\n&lt;li&gt;Do not listen to economic forecasters or to predictions&lt;/li&gt;\n&lt;li&gt;Be prepared! Be prepared for all relevant eventualities&lt;/li&gt;\n&lt;li&gt;People are often ashamed of losses, so they engage in strategies that produce very little volatility but contain the risk of large loss.&lt;/li&gt;\n&lt;li&gt;Barbell Strategy&lt;/li&gt;\n&lt;li&gt;Be as hyper-conservative and hyper-aggressive and you can instead of being mildly aggressive or conservative&lt;/li&gt;\n&lt;li&gt;Put 80-90% in extremely safe investments – (Example – T-Bills)&lt;/li&gt;\n&lt;li&gt;Put the other 10-20% in extremely speculative investments (Example – VC)&lt;/li&gt;\n&lt;li&gt;You have no risk on one side and high risk on the other, which equals out to medium risk. This minimizes your risk of negative black swans and exposures you to positive black swans&lt;/li&gt;\n&lt;li&gt;Put yourself in situations where favorable consequences are much larger than unfavorable ones&lt;/li&gt;\n&lt;li&gt;I am very aggressive when I can gain exposure to positive Black Swans and very conservative when I am under threat from a negative Black Swan&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;&lt;strong&gt;Anti-Fragile&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Fragile-Robust-Antifragile. Fragile wants tranquility, Antifragile grows from disorder and robust doesn&amp;#39;t care too much&lt;/li&gt;\n&lt;li&gt;Some things benefit from shocks; they thrive and grow when exposed to volatility, randomness, disorder, and stressors and love adventure, risk, and uncertainty. This is Antifragile. The opposite is fragile&lt;/li&gt;\n&lt;li&gt;Antifragility is beyond resilience or robustness. The resilient resists shocks and stays the same; the antifragile gets stronger&lt;/li&gt;\n&lt;li&gt;I would rather be dumb and antifragile than smart and fragile\n\n&lt;ul&gt;\n&lt;li&gt;It is much easier to figure out if something is fragile than to predict the occurrence of an event that may harm it.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Asymmetry: anything that has more upside than downside from random events is antifragile; the reverse is fragile&lt;/li&gt;\n&lt;li&gt;Fragile needs to be very predictive in its approach, and conversely, predictive systems cause fragility&lt;/li&gt;\n&lt;li&gt;For the economy to be antifragile as a whole, individual companies must be fragile. We don&amp;#39;t have this currently\n\n&lt;ul&gt;\n&lt;li&gt;Many government interventions and social policies end up hurting the weak and consolidating the established&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;We are fragilizing social and economic systems by denying them stressors and randomness&lt;/li&gt;\n&lt;li&gt;We make social, political (and other) systems vulnerable to Black Swans when we over stabilize them&lt;/li&gt;\n&lt;li&gt;The problem with artificially suppressed volatility is not just that the system tends to become extremely fragile; it is that, at the same time, it exhibits no visible risks. They become prone to black swan events&lt;/li&gt;\n&lt;li&gt;Attempts at eliminating the business cycle led to more fragile economic systems (IE – The Greenspan Put)\n\n&lt;ul&gt;\n&lt;li&gt;Part of this is due to the fact it is easier to sell &amp;quot;Look what I did for you&amp;quot; than &amp;quot;Look what I avoided for you.&amp;quot;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Our track record in figuring out significant rare events in politics and economics is about zero&lt;/li&gt;\n&lt;li&gt;What makes life simple is that the robust and antifragile don&amp;#39;t have to have as accurate a comprehension of the world as the fragile, and they do not need to forecast\n\n&lt;ul&gt;\n&lt;li&gt;A person with extra cash in the bank and stockpiles of tradeable goods and gold bars doesn&amp;#39;t need to forecast correctly.&lt;/li&gt;\n&lt;li&gt;People in debt are fragile and need a lot more forecasting ability&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;There are 2 types of domains\n\n&lt;ul&gt;\n&lt;li&gt;Those we can somewhat predict. IE – The physical like planet motions&lt;/li&gt;\n&lt;li&gt;Those that we cannot. IE - The Black Swan – Social, Economic, and Cultural life&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The first step toward antifragility consists in first decreasing downside, rather than increasing upside. That means lowering exposure to negative black swans&lt;/li&gt;\n&lt;li&gt;What matters is the route taken, the order of events, not just the destination – what scientists call path-dependent property\n\n&lt;ul&gt;\n&lt;li&gt;Example – A kidney stone operation and anesthesia after is very different than the opposite&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;People miss the strong logical precedence of survival over success&lt;/li&gt;\n&lt;li&gt;In other words, if something is fragile, its risk of breaking make anything you do to improve it or make it &amp;quot;efficient&amp;quot; inconsequential unless you first reduce that risk of breaking&lt;/li&gt;\n&lt;li&gt;Barbell Strategy or Bimodal Strategy\n\n&lt;ul&gt;\n&lt;li&gt;Combination of 2 extreme areas with nothing in the middle&lt;/li&gt;\n&lt;li&gt;Playing it safe in some areas – robust to black swans&lt;/li&gt;\n&lt;li&gt;Taking a lot of small risks in other – open to positive black swans\n\n&lt;ul&gt;\n&lt;li&gt;The whole then becomes antifragile&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The causes extreme risk aversion on one side and extreme risk loving on the other\n\n&lt;ul&gt;\n&lt;li&gt;But the barbell also results, because of its construction, in the reduction of downside risk – the elimination of the risk of ruin&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Antifragility is the combination aggressiveness plus paranoia, protect your downside from extreme harm, and let the upside take care of itself&lt;/li&gt;\n&lt;li&gt;Yiddish proverb &amp;quot;Provide for the worst; the best can take care of itself.&amp;quot;\n\n&lt;ul&gt;\n&lt;li&gt;Many people tend to provide for the best and hope the worst takes care of itself&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Example of above\n\n&lt;ul&gt;\n&lt;li&gt;People find insuring their house a necessity, not something to be judged against a financial strategy, but when it comes to their portfolios, because of the way things are framed in the press, they don&amp;#39;t look at them the same way.&lt;/li&gt;\n&lt;li&gt;They think that the barbell strategy needs to be examined for its potential return as an investment. That is NOT the point. The barbell is simply an idea of insurance of survival&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;When you are fragile, you need to know a lot more than when you are antifragile. Conversely, when you think you know more than you do, you are fragile to error.\n\n&lt;ul&gt;\n&lt;li&gt;Overconfidence leads to reliance on forecasts, which causes borrowing, then to the fragility of leverage. Example – Long Term Capital Management (LTCM)&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Absence of evidence is not evidence of absence&lt;/li&gt;\n&lt;li&gt;Much of what other people know isn&amp;#39;t worth knowing&lt;/li&gt;\n&lt;li&gt;Non-linear means that the response is not straightforward and not in a straight line, so if you double say, the dose, you get a lot more or a lot less than double the effect.&lt;/li&gt;\n&lt;li&gt;For the fragile, shocks bring higher and higher harm as their intensity increases (up to a point)\n\n&lt;ul&gt;\n&lt;li&gt;Example – Falling from a height of 30ft one time brings more than 30 times the harm of falling 30 times from a height of 1ft&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;What is fragile is something that is both unbroken and subjected to nonlinear effects&lt;/li&gt;\n&lt;li&gt;The fragile is hurt a lot more by extreme events than by a succession of intermediate ones&lt;/li&gt;\n&lt;li&gt;For the antifragile, shocks bring more benefits as their intensity increases (up to a point)\n\n&lt;ul&gt;\n&lt;li&gt;Example – powerlifters get more benefits lifting 300 lbs one time than 1 lb 300 times&lt;/li&gt;\n&lt;li&gt;Every additional pound brings more benefits, until one gets close to the limit, what would be known as &amp;quot;failure&amp;quot;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Convexity effect analogy (Positive and Negative) Think of a smile (+) and frown (-)\n\n&lt;ul&gt;\n&lt;li&gt;Positive – Convex – Think Happy face - Gain more than pain. Likes volatility. If for a given variation, you have more upside than downside, it will be convex (slopes up)&lt;/li&gt;\n&lt;li&gt;Negative - Concave – Think Sad face – Pain more than gain. Dislikes volatility. If for a given variation, you have more downside than upside, it will be concave (slopes down). The more harm from the unexpected. Large deviations have a disproportionately larger and larger effect (acceleration)&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The inverse philosophers stone or how to detect fragility\n\n&lt;ul&gt;\n&lt;li&gt;Figure out if our miscalculations or mis forecasts are on balance more harmful than they are beneficial, and how accelerating the damage will be.&lt;/li&gt;\n&lt;li&gt;You don&amp;#39;t have to be exact with this measurement. You can get a scale that isn&amp;#39;t zeroed and know if you are gaining or losing weight. I can have a non-exact ruler and know if my child is growing or not.&lt;/li&gt;\n&lt;li&gt;Example – Government deficits are particularly concave to changes in economic conditions. Every additional deviation in, say, the unemployment rate, particularly when the government has debt, makes deficits incrementally worse.&lt;/li&gt;\n&lt;li&gt;Financial leverage for a company has the same effect: you need to borrow more and more to get the same result&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Average (First order effects) do not matter\n\n&lt;ul&gt;\n&lt;li&gt;&amp;quot;Do not cross a river if it is on average 4ft deep&amp;quot;&lt;/li&gt;\n&lt;li&gt;Analogy – You grandmother will spend the next 2 hours at 70 degrees (Perfect Grandmother Temp).&lt;/li&gt;\n&lt;li&gt;But there is also a second point of the data – she will spend the first hour at 0 and the 2nd hour at 140 for an average of 70&lt;/li&gt;\n&lt;li&gt;Temp changes become more and more harmful as they deviate from 70. And the 2nd piece of information, the variability, turned out to be more important than the first.&lt;/li&gt;\n&lt;li&gt;Point of above – The notion of average is of no significance when one is fragile to variations&lt;/li&gt;\n&lt;li&gt;Grandmother is non-linear to temperature (response is not a straight line), it curves inward (concave), the more nonlinear the response, the less relevant the average&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Many people are drawn to financial markets because we hear or see the success, but the failures are buried and we don&amp;#39;t hear about them&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "a376614c-65e6-11e5-b6e7-123c7cc7e97b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "rasfya",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "captmorgan50",
  "discussion_type": null,
  "num_comments": 8,
  "send_replies": false,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/rasfya/nassim_taleb_fooled_by_randomness_the_black_swan/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/rasfya/nassim_taleb_fooled_by_randomness_the_black_swan/",
  "subreddit_subscribers": 3354976,
  "created_utc": 1638892128,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1638857654,
  "the_new_excerpt": "Nassim Taleb**\n\n\nFOOLED BY RANDOMNESS\n\n * Survivorship Bias means you don't hear from the losers on a topic, you only\n   hear from the winners.\n   * Watch out judging a person by their results because history will only show\n     you the winners. You won't hear the stories of the losers\n * Over…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナッシム・タレブ**氏\n\n\nランダム性に惑わされる\n\n * 生存者バイアスとは、ある話題について、敗者の意見を聞かず、ただただ\n   勝者の声を聞くことができる。\n   * 歴史はその人を示すだけだからです。\n     勝者である。敗者の話は聞かない。\n * オーバー...",
      "title": "Nassim Taleb Fooled by Randomness, The Black Swan, And AntiFragile Book Summaries（ナシーム・タレブ、ランダムネスに騙されて、ブラック・スワン、アンチフラジャイル）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纳西姆-塔勒布**\n\n\n被随机性所迷惑\n\n * 幸存者偏差意味着你不会听到一个话题中的失败者的声音，你只会听到\n   你只听到赢家的声音。\n   *注意根据一个人的结果来判断他，因为历史只会表明\n     赢家。你不会听到失败者的故事。\n *过...",
      "title": "纳西姆-塔勒布被随机性愚弄、黑天鹅和反脆弱的书籍摘要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "納西姆-塔勒布**\n\n\n被隨機性所迷惑\n\n * 倖存者偏差意味着你不會聽到一個話題中的失敗者的聲音，你只會聽到\n   你只聽到贏家的聲音。\n   *注意根據一個人的結果來判斷他，因爲歷史只會表明\n     贏家。你不會聽到失敗者的故事。\n *過...",
      "title": "納西姆-塔勒布被隨機性愚弄、黑天鵝和反脆弱的書籍摘要"
    }
  ],
  "source_updated_at": 1639129314232
}