{
  "author": "ValyrianJedi",
  "original_created_utc": 1625241708,
  "title": "Why did civilizations first start forming at roughly the same time (5k-8k years ago) in completely unconnected areas, after hundreds of thousands of years without them?",
  "created_utc": 1625254165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand the basics of the agricultural revolution and whatnot, and what generally lead to the rise of civilizations. What I don&#39;t understand is why the same thing happened at roughly the same time (relative to the time scale of human evolution) in areas that shouldn&#39;t have had any interaction with one another (the Middle East, China, Europe, Egypt, etc) after hundreds of thousands of years of this not happening... So I get that learning the basics of farming and whatnot lead to civilizations arising. I don&#39;t understand why that happened simultaneously in different areas that were separated by thousands of miles and geographical features that would have been virtually impassable at the time... Did some people just rapidly spread the knowledge, so that people in Egypt and people in China were essentially taught from the same original source, or did they both just come up with it completely separate of one another?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ocd51r/why_did_civilizations_first_start_forming_at/",
  "subreddit": "AskHistorians",
  "id": "ocd51r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand the basics of the agricultural revolution and whatnot, and what\ngenerally lead to the rise of civilizations. What I don't understand is why the\nsame thing happened at roughly the same time (relative to the time scale of\nhuman evolution) in areas that shouldn't have had any interaction…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "農業革命などの基本的なことは理解していますし、何が一般的に\n文明の勃興につながることは理解しています。分からないのは、なぜ同じことが\n同じことが、ほぼ同じ時期に（人類の進化の時間軸に照らして）起こったのか、ということです。\n人間の進化の時間軸から見て）ほぼ同時期に、交流のないはずの地域で同じことが起こったのかということです。",
      "title": "文明がなかった数十万年後に、まったく無関係の地域で、ほぼ同時期（5k～8k年前）に文明が初めて形成されたのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我了解农业革命和什么的基本情况，以及什么通常会导致文明的崛起。\n导致文明兴起的一般原因。我不明白的是为什么\n同样的事情发生在大致相同的时间（相对于人类进化的时间尺度）。\n相对于人类进化的时间尺度），同样的事情发生在不应该有任何互动的地区......",
      "title": "为什么在几十万年没有文明的情况下，在完全没有联系的地区首次开始形成文明（5k-8k年前）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我瞭解農業革命和什麼的基本情況，以及什麼通常會導致文明的崛起。\n導致文明興起的一般原因。我不明白的是爲什麼\n同樣的事情發生在大致相同的時間（相對於人類進化的時間尺度）。\n相對於人類進化的時間尺度），同樣的事情發生在不應該有任何互動的地區......",
      "title": "爲什麼在幾十萬年沒有文明的情況下，在完全沒有聯繫的地區首次開始形成文明（5k-8k年前）？"
    }
  ]
}