{
  "author": "Chino-_-Chaos",
  "original_created_utc": 1624295816,
  "title": "Just a friendly reminder about Coinbase",
  "created_utc": 1624327736,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the past few days I have noticed several people complain about the fees on Coinbase. I just think it needs to be known, there is Coinbase Pro. It&#39;s a separate app, but the two apps connect. The fees are a lot lower on Pro, and the best part about it is that Coinbase Pro is free to use!</p>\n\n<p>CB Pro is a little more technical with more options and it&#39;s not as easy to look at, but it&#39;s totally worth it for the lower fees. </p>\n\n<p>So what&#39;s the point of the regular Coinbase? That should be used as your wallet. You can move your crypto instantly between the two once your funds clear. The reason why you would want to use regular Coinbase is because some coins offer staking rewards and it is easier to look at. Also Coinbase has vaults which provide extra security.</p>\n\n<p>You would also want to use Coinbase Pro for selling your crypto, so you can move it back to Pro whenever you like .</p>\n\n<p>I hope this helps you guys, the more money you save from fees, the more sweet crypto you can buy!</p>\n\n<p>Take care and good luck</p>\n\n<p>Edit: I was just informed you can actually deposit your fiat on regular Coinbase and move to Pro without having to wait for funds to clear!</p>\n\n<p>Edit 2: You can also do limit orders which are super helpful!</p>\n</div><!-- SC_ON -->",
  "score": 332,
  "permalink": "/r/CryptoCurrency/comments/o508s0/just_a_friendly_reminder_about_coinbase/",
  "subreddit": "CryptoCurrency",
  "id": "o508s0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the past few days I have noticed several people complain about the fees on\nCoinbase. I just think it needs to be known, there is Coinbase Pro. It's a\nseparate app, but the two apps connect. The fees are a lot lower on Pro, and the\nbest part about it is that Coinbase Pro is free to use!\n\nCB Pro is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、私は何人かの人がCoinbaseの手数料に不満を持っていることに気づきました。\nコインベース 私は、Coinbase Proがあることを知ってもらう必要があると思っています。それは別のアプリです。\n別のアプリですが、この2つのアプリはつながっています。Proの方が手数料はずっと安いですし、何よりも素晴らしいのは\nそして何より、Coinbase Proは無料で利用できるのです\n\nCB Proは...",
      "title": "Coinbaseについての注意事項です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几天里，我注意到有几个人在抱怨关于\nCoinbase。我只是认为需要知道的是，有Coinbase Pro。它是一个\n它是一个独立的应用程序，但这两个应用程序是相连的。专业版的费用要低得多。\n最重要的是，Coinbase Pro是免费使用的。\n\nCB Pro是...",
      "title": "关于Coinbase的一个友好提醒"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾天裏，我注意到有幾個人在抱怨關於\nCoinbase。我只是認爲需要知道的是，有Coinbase Pro。它是一個\n它是一個獨立的應用程序，但這兩個應用程序是相連的。專業版的費用要低得多。\n最重要的是，Coinbase Pro是免費使用的。\n\nCB Pro是...",
      "title": "關於Coinbase的一個友好提醒"
    }
  ]
}