{
  "author": "PolPhilAssistant",
  "original_created_utc": 1628678337,
  "title": "Hi! I am an assistant to a political philosophy professor and we're developing a project on political philosophy that falls outside the standard philosophical canon. We're currently looking for suggestions! Do you know any political philosophy works that are generally overlooked?",
  "created_utc": 1628725733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone. Thanks for reading on ;)</p>\n\n<p>One of the topics that has been coming up recently within philosophy has been the &#39;limits of the canon&#39; so to speak and to question whether we should look beyond it. Every university has to make a selection as philosophy is too big a topic to give a truly comprehensive introduction to - a wide range of philosophical works won&#39;t make the cut. Consequently, as an excercise for undergrad students that deals with this topic, we&#39;re developing a list of political theorists who&#39;ve fallen outside the historical canon but arguably could have (or maybe even should have) been included. It is up to the students to write a little essay arguing about the merits of one such philosopher&#39;s philosophical contributions and whether it should be included in the political philosophy course of our university. This helps them develop their argumentative skills as well as encouraging them to become more cognizant of the limits of canon selection of our university (and more generally). Hopefully this also makes them more aware that the world of philosophy is greater than &#39;the greatest hits&#39; that get discussed during their university education. So, to this end, I decided to see if some of you could come up the some names and theorists that we haven&#39;t thought of!</p>\n\n<p>The philosophers need to have one examplar political philosophy essay that students can base their arguments on. So for instance we&#39;ve already got Confucius and his &#39;The Analects&#39;, as well as Mary Astell &#39;some reflections upon marriage&#39;. It&#39;s not that we&#39;re looking for well-known philosophers that tend to be included in the canon but, rather, political philosophy texts that inspires one to ask &quot;Is this an important work of political philosophy? Why?&quot; (the answer to that question can be no! There just needs to be a significant doubt)</p>\n\n<p>So, yeah, does anything spring to mind? I&#39;m very interested to see what some of you come up with :)</p>\n\n<p>Edit: Wow, this has already been a huge help. Thanks for all the suggestions! It&#39;s going to take me a day or two to comb through all of them but already I&#39;ve seen a lot of interesting ones. Again, thanks a lot :)</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/p2ahx2/hi_i_am_an_assistant_to_a_political_philosophy/",
  "subreddit": "askphilosophy",
  "id": "p2ahx2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone. Thanks for reading on ;)\n\nOne of the topics that has been coming up recently within philosophy has been\nthe 'limits of the canon' so to speak and to question whether we should look\nbeyond it. Every university has to make a selection as philosophy is too big a\ntopic to give a truly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。ご覧いただきありがとうございます。)\n\n最近、哲学の中で話題になっていることの一つに\nいわば「カノンの限界」、そして「カノンの向こう側を見るべきかどうか」ということです。\nその先を見るべきかどうかということです。哲学はあまりにも大きなテーマなので、どの大学でも選択をしなければなりません。\n哲学はあまりにも大きなテーマなので、すべての大学が選択しなければなりません...",
      "title": "こんにちは！私は政治哲学の教授のアシスタントをしており、標準的な哲学の規範から外れた政治哲学に関するプロジェクトを開発しています。現在、提案を募集しています。一般的に見落とされている政治哲学の作品を知っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。谢谢你继续阅读;)\n\n最近在哲学界出现的一个话题是\n可以说是 \"典籍的局限性\"，并质疑我们是否应该看\n超越它。每所大学都必须做出选择，因为哲学是一个太大\n哲学是一个太大的话题，无法给一个真正的...",
      "title": "你好！我是一位政治哲学教授的助理，我们正在开发一个关于政治哲学的项目，它不属于标准的哲学典籍。我们目前正在寻找建议! 你知道有哪些政治哲学作品是被普遍忽视的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。謝謝你繼續閱讀;)\n\n最近在哲學界出現的一個話題是\n可以說是 \"典籍的侷限性\"，並質疑我們是否應該看\n超越它。每所大學都必須做出選擇，因爲哲學是一個太大\n哲學是一個太大的話題，無法給一個真正的...",
      "title": "你好！我是一位政治哲學教授的助理，我們正在開發一個關於政治哲學的項目，它不屬於標準的哲學典籍。我們目前正在尋找建議! 你知道有哪些政治哲學作品是被普遍忽視的嗎？"
    }
  ]
}