{
  "author": "TrueSpins",
  "original_created_utc": 1627390470,
  "title": "I don't mean to sound harsh, but I think you have to be a bit of a moron to fall for the vast majority of crypto scams...",
  "created_utc": 1627405086,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been around crypto since early 2013 and have had my fair share of scam attempts - but I can&#39;t think of a single one that was even remotely convincing.</p>\n\n<p>Essentially, as long as you don&#39;t share your private keys or seed, and don&#39;t send crypto to random people on the internet, you&#39;re pretty much safe.</p>\n\n<p>I mean, do people really receive a random reddit chat request and then just mindlessly handover the above because some chap with a poor command of the English language is promising them mega returns? Really? How stupid do you have to be?!</p>\n\n<p>The only time I have sympathy is when a scam involves a true technical hack or use of malware. Hardware wallets limit that risk, but back in the old days of software wallets you were somewhat vulnerable. But even then, provided you followed some key rules, the risk was low.</p>\n\n<p>Even things like Bitconnect were super obviously scams, or at the very least incredibly unstable and likely to fail modals. It just boggles my mind that people can be so stupid.</p>\n\n<p>In terms of exchange rug pulls, back in 2013 and 2014 I&#39;d again have had some sympathy - it was almost impossible to know which exchanges were legit. But nowadays exchanges are far more regulated, and if you&#39;re trading on clearly-a-scam-exchange.net you deserve everything you get. </p>\n\n<p>Has anyone come across a scam that you don&#39;t actually have to be braindead to fall for?</p>\n</div><!-- SC_ON -->",
  "score": 299,
  "permalink": "/r/CryptoCurrency/comments/osm9q3/i_dont_mean_to_sound_harsh_but_i_think_you_have/",
  "subreddit": "CryptoCurrency",
  "id": "osm9q3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been around crypto since early 2013 and have had my fair share of scam\nattempts - but I can't think of a single one that was even remotely convincing.\n\nEssentially, as long as you don't share your private keys or seed, and don't\nsend crypto to random people on the internet, you're pretty much…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2013年の初めから暗号の世界に身を置いていますが、これまでに多くの詐欺行為を経験してきました。\nしかし、説得力のあるものは一つもありませんでした。\n\n基本的には、秘密鍵やシードを共有せず、インターネット上の不特定多数の人に暗号を送らない限りは\nインターネット上の不特定多数の人に暗号を送信しない限り、ほとんどの場合...",
      "title": "厳しいことを言うつもりはありませんが、大多数の暗号化詐欺に引っかかるのは、ちょっとしたバカでなければならないと思います...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2013年初就开始接触加密货币，也遇到过不少骗局。\n但我想不出有哪一个是有说服力的。\n\n基本上，只要你不分享你的私钥或种子，并且不\n发送加密货币给互联网上的随机人员，你就几乎...",
      "title": "我无意听起来很刺耳，但我认为你必须是一个有点白痴的人，才会被绝大多数的加密货币骗局所骗..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2013年初就開始接觸加密貨幣，也遇到過不少騙局。\n但我想不出有哪一個是有說服力的。\n\n基本上，只要你不分享你的私鑰或種子，並且不\n發送加密貨幣給互聯網上的隨機人員，你就幾乎...",
      "title": "我無意聽起來很刺耳，但我認爲你必須是一個有點白癡的人，纔會被絕大多數的加密貨幣騙局所騙..."
    }
  ]
}