{
  "author": "JuicySpark",
  "the_new_excerpt": "What a FK'in Travesty. Decentralization is here because of people like him. Just\nhow why MeToo Rallies exist in the first place. Because of people like Harvey\nWeinstein.\n\nBig Corporate centralized information hoarding, censoring conglomerates like\nTwitter, Facebook, YouTube that hold monopolies on…",
  "original_created_utc": 1622914094,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なんというFKの茶番劇だ。彼のような人がいるからこそ、地方分権が実現したのです。ただ\nそもそもMeToo集会がなぜ存在するのか。なぜなら、Harvey\nWeinsteinです。\n\n大企業が中央集権的に情報を溜め込み、検閲するコングロマリットのような\nツイッター、フェイスブック、ユーチューブのような大企業が、情報を独占しています。",
      "title": "ジャック・ドーシーがビットコイン・カンファレンスに参加するのは、ハーヴェイ・ワインスタインがMeTooの集会に参加するようなものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "什么是FK'in Travesty。因为有他这样的人，权力下放才在这里。只是\n为什么MeToo集会一开始就存在。因为有像哈维\n温斯坦。\n\n大公司集中式的信息囤积，审查集团化的信息，如\n推特、脸书、YouTube，它们垄断了...",
      "title": "杰克-多尔西出席比特币会议就像哈维-温斯坦出席MeToo集会一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是FK'in Travesty。因爲有他這樣的人，權力下放纔在這裏。只是\n爲什麼MeToo集會一開始就存在。因爲有像哈維\n溫斯坦。\n\n大公司集中式的信息囤積，審查集團化的信息，如\n推特、臉書、YouTube，它們壟斷了...",
      "title": "傑克-多爾西出席比特幣會議就像哈維-溫斯坦出席MeToo集會一樣。"
    }
  ],
  "title": "Jack Dorsey at a Bitcoin Conference is like having Harvey Weinstein attend a MeToo Rally.",
  "created_utc": 1622933650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What a FK&#39;in Travesty.  Decentralization is here because of people like him. Just how \nwhy MeToo Rallies exist in the first place. Because of people like Harvey Weinstein.</p>\n\n<p>Big Corporate centralized information hoarding, censoring conglomerates like Twitter, Facebook, YouTube that hold monopolies on their area as to why they can do stuff like this without worrying about people leaving to another because of <em>herd complacency biases</em> , and active suppression of any competing apps. </p>\n\n<p>So having Jack Dorsey speaking at a BTC conference is one of the worst choices. </p>\n\n<p>How about a Hacker like Gummo that stresses privacy speak and explain all the ways why decentralization is important. Like letting everyone know their iPhones aren&#39;t safe form viruses despite what lying Apple says.      </p>\n\n<p>Or American law professor , and free software activist Eben Moglen who inspired the creation of the first Decentralized Social Network, Diaspora?</p>\n\n<p>I can think of many credible better candidates and this tells me one thing.  Either Jack Paid to get himself in or someone is stupid.  </p>\n\n<p>Jack Dorsey is not gonna use decentralization the way it should be.    There&#39;s no way he&#39;s gonna give up his fortune to push for a decentralized network that isn&#39;t freelancing your information.   He will figure out how to use it In a Centralized way, and hide behind the word Decentralized.    Yeah. I don&#39;t trust the guy. </p>\n\n<p>The problem with centralization is you have to trust God knows how many people with access to your information that they are keeping it safe, secure, and won&#39;t be suspect to be used for any Mal Intent. </p>\n\n<p>But we can&#39;t.   So really FK this guy.</p>\n</div><!-- SC_ON -->",
  "score": 472,
  "permalink": "/r/CryptoCurrency/comments/nt0smv/jack_dorsey_at_a_bitcoin_conference_is_like/",
  "subreddit": "CryptoCurrency",
  "id": "nt0smv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882855
}