{
  "author": "bor3d-",
  "the_new_excerpt": "I met this girl through mutual friends last year. We started texting a few\nmonths ago, hung out about 4 weeks ago, and I asked her on an official date\nabout 3 weeks ago. After talking she agreed to dinner so we made some plans.\n\nAt 5am the day were suppose get dinner she sends me a text that her…",
  "original_created_utc": 1612018563,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我去年通过共同的朋友认识了这个女孩。我们开始发了几条短信\n几个月前，挂出约4周前， 我问她在一个正式的日期，\n大约3周前。谈话后，她同意晚餐，所以我们做了一些计划。\n\n在早上5点，我们应该得到晚餐的一天，她给我发了一条短信，她的... ...",
      "title": "你怎么处理这些花花公子，让他们明白你不会容忍他们的行为，同时又不会让自己看起来像个混蛋？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我去年通過共同的朋友認識了這個女孩。我們開始發了幾條短信\n幾個月前，掛出約4周前， 我問她在一個正式的日期，\n大約3周前。談話後，她同意晚餐，所以我們做了一些計劃。\n\n在早上5點，我們應該得到晚餐的一天，她給我發了一條短信，她的... ...",
      "title": "你怎麼處理這些花花公子，讓他們明白你不會容忍他們的行爲，同時又不會讓自己看起來像個混蛋？"
    }
  ],
  "title": "How do you handle flakes and make it clear you wont tolerate their behavior without making yourself seem like an asshole?",
  "created_utc": 1612056919,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I met this girl through mutual friends last year. We started texting a few months ago, hung out about 4 weeks ago, and I asked her on an official date about 3 weeks ago. After talking she agreed to dinner so we made some plans. </p>\n\n<p>At 5am the day were suppose get dinner she sends me a text that her &quot;mom, sister, and grandma just tested positive for covid and she&#39;s not feeling well.&quot; She asked to hold-off until she could get tested. Fine.</p>\n\n<p>A few days pass and she messages me that she &quot;doesn&#39;t have the rona!&quot; but my week was pretty booked at this point so I told her that. She said she was leaving town for the weekend and would be back Sunday. The vibes I was getting is that she&#39;s not interested so instead of trying to force something on the schedule I just said &quot;okay have fun!&quot;</p>\n\n<p>A few more days pass and she messages me &quot;Hey! I&#39;m not going out of town now this weekend because of the storm. Lunch on Sunday?&quot;</p>\n\n<p>I agree. </p>\n\n<p>Sunday morning I text her &quot;Hey! We still on for today?&quot; She responds &quot;Most likely! I&#39;m super hungover and xyz came up that I have to do. Late lunch/early dinner?&quot;</p>\n\n<p>I agree.</p>\n\n<p>An hour later she texts me &quot;Hey, I just barfed and I don&#39;t want to keep you waiting. Want to just reschedule?&quot;</p>\n\n<p>If I&#39;m being honest I am a little pissed at this point. I&#39;m self employeed and busy and I&#39;ve now blocked my calendar off for her TWICE with her rescheduling the day of, preventing me from really filling in that time with anything else. Specifically on this last one, I had an offer to leave town for the weekend which I declined because it came after she already asked me to lunch on Sunday. </p>\n\n<p>I was pretty blunt in my response and just told her &quot;I don&#39;t want you puking on me so we can reschedule but, I&#39;m not going to tolerate another reschedule on the next one, okay?&quot;</p>\n\n<p>She responded a day later, I put the ball back in her court, and haven&#39;t heard from her in 4 days now. </p>\n\n<p>I realize I was probably a little blunt/aggressive in my response but I honestly have no time for this shit. </p>\n\n<p>How do you guys normally handle a situation like this? I&#39;m trying to have a little more tact going forward. </p>\n\n<p>Thanks</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskMen/comments/l8nbn6/how_do_you_handle_flakes_and_make_it_clear_you/",
  "subreddit": "AskMen",
  "id": "l8nbn6",
  "is_self": true,
  "media": null,
  "is_video": false
}