{
  "author": "cat_ta_strophe",
  "original_created_utc": 1630572706,
  "title": "I really don't understand the new law in Texas against abortion?! What if the woman don't want the baby? Are they going to force her to have one? What if she'll jast try to kill the fetus while in the womb? Or even after he gets born?",
  "created_utc": 1630587657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know it a bit extreme but what if things like this happens? What a doctor will do if the pregnant woman will say to them that she will try to kill the baby?? Will she be considered mentality ill? Will they still let her have him? Can someone stop her from trying ways to harm the fetus when he still in the womb?? Are they aware there is other ways to get rid of a fetus? Ways that will harm both the woman and the fetus/ baby?? </p>\n\n<p>(Sorry if there is any grammatical errors english isn&#39;t my language, and also sorry for the weird question..im just furious of everything about that law..)</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/NoStupidQuestions/comments/pgdyw5/i_really_dont_understand_the_new_law_in_texas/",
  "subreddit": "NoStupidQuestions",
  "id": "pgdyw5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know it a bit extreme but what if things like this happens? What a doctor will\ndo if the pregnant woman will say to them that she will try to kill the baby??\nWill she be considered mentality ill? Will they still let her have him? Can\nsomeone stop her from trying ways to harm the fetus when he…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょっと極端ですが、こんなことがあったらどうしますか？医者はどうするか？\n妊婦さんが「赤ちゃんを殺そうと思います」と言ったら、お医者さんはどうしますか？\n彼女は精神的な病気とみなされるのでしょうか？それでも彼女に赤ちゃんを産ませるのでしょうか？誰かが\n誰かが、彼女が胎児を傷つけようとするのを止めることができるでしょうか？",
      "title": "テキサス州の新しい中絶禁止法が本当に理解できません。もし女性が赤ちゃんを欲しくなかったらどうなるの？彼らは彼女に強制的に赤ちゃんを産ませようとしているのでしょうか？もし彼女が子宮の中で胎児を殺そうとするとしたら？あるいは、生まれた後でも？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这有点极端，但如果发生这样的事情怎么办？医生会怎么做\n如果孕妇对他们说，她会试图杀死孩子，医生会怎么做？\n她会被认为是精神有问题吗？他们还会让她把孩子生下来吗？能否\n有人能阻止她想办法伤害胎儿吗？",
      "title": "我真的不明白德克萨斯州禁止堕胎的新法律！？如果这个女人不想要这个孩子怎么办？他们要强迫她生孩子吗？如果她只是想在子宫里杀死胎儿呢？甚至在他出生后？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這有點極端，但如果發生這樣的事情怎麼辦？醫生會怎麼做\n如果孕婦對他們說，她會試圖殺死孩子，醫生會怎麼做？\n她會被認爲是精神有問題嗎？他們還會讓她把孩子生下來嗎？能否\n有人能阻止她想辦法傷害胎兒嗎？",
      "title": "我真的不明白德克薩斯州禁止墮胎的新法律！？如果這個女人不想要這個孩子怎麼辦？他們要強迫她生孩子嗎？如果她只是想在子宮裏殺死胎兒呢？甚至在他出生後？"
    }
  ]
}