{
  "author": "DaddySkates",
  "original_created_utc": 1639237760,
  "title": "Am I the only one absolutely astonished how well cryptomarket is holding up despite the problems with Evergrande and others?",
  "created_utc": 1639258245,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I gotta say I was ready to put in a few more dollars in the market as soon as I heard about the defaulting with the Evergrande.&lt;/p&gt;\n\n&lt;p&gt;Evergrande has liabilities of around $300B. Approximately $19 billion is in bonds that are denominated in U.S. dollars and issued offshore. That means a larger amount than is outstanding from any other Chinese property development company.&lt;/p&gt;\n\n&lt;p&gt;Yet crypto didn’t even dip half as much as I expected to dip!\nAre we getting less volatile or is it the market that is starting to get sick of the Chinese FUD? Or maybe the real dip is coming in monday?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/re2g6o/am_i_the_only_one_absolutely_astonished_how_well/",
  "subreddit": "CryptoCurrency",
  "id": "re2g6o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I gotta say I was ready to put in a few more dollars in the market as soon as I\nheard about the defaulting with the Evergrande.\n\nEvergrande has liabilities of around $300B. Approximately $19 billion is in\nbonds that are denominated in U.S. dollars and issued offshore. That means a\nlarger amount…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、この時、市場にもう少し資金を投入しようと思っていました。\nエバーグランデのデフォルトの話を聞いた。\n\nエバーグランデは約3000億ドルの負債を抱えている。そのうちの約190億ドルは\nドル建てで海外で発行された債券。ということは\nより大きな金額...",
      "title": "Evergrandeなどの問題があったにもかかわらず、クリプトマーケットがよく持ちこたえていることに驚かされるのは私だけでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不得不说，我一听说恒大违约，就准备在市场上多投几块钱。\n一听说恒大违约，我就准备在市场上多投点钱。\n\n恒大的负债约为3000亿美元。约有190亿美元是在\n债券，这些债券以美元计价，在境外发行。这意味着一个\n更大的数额...",
      "title": "难道只有我一个人绝对惊讶，尽管恒大和其他公司存在问题，但加密市场仍然保持得如此之好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不得不說，我一聽說恆大違約，就準備在市場上多投幾塊錢。\n一聽說恆大違約，我就準備在市場上多投點錢。\n\n恆大的負債約爲3000億美元。約有190億美元是在\n債券，這些債券以美元計價，在境外發行。這意味着一個\n更大的數額...",
      "title": "難道只有我一個人絕對驚訝，儘管恆大和其他公司存在問題，但加密市場仍然保持得如此之好？"
    }
  ]
}