{
  "author": "_bono983",
  "the_new_excerpt": "\"Tesla and founder Elon Musk are renowned for notching firsts. In 2012, the\nEV-maker unveiled the first-ever premium all-electric sedan, the Model S. Six\nyears later, Musk’s SpaceX launched the world’s most powerful rocket, the Falcon\nHeavy. That milestone marked another first, since the Falcon…",
  "original_created_utc": 1615024267,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\"特斯拉和创始人埃隆-马斯克以标榜第一著称。在2012年，该\n电动车制造商推出了首款高端纯电动轿车Model S。\n年后，马斯克的SpaceX公司发射了世界上最强大的火箭 \"猎鹰\"。\n重。这个里程碑标志着另一个第一次，自猎鹰... ...",
      "title": "特斯拉打破了一个记录。史上最大的六周跌幅"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"特斯拉和創始人埃隆-馬斯克以標榜第一著稱。在2012年，該\n電動車製造商推出了首款高端純電動轎車Model S。\n年後，馬斯克的SpaceX公司發射了世界上最強大的火箭 \"獵鷹\"。\n重。這個里程碑標誌着另一個第一次，自獵鷹... ...",
      "title": "特斯拉打破了一個記錄。史上最大的六週跌幅"
    }
  ],
  "title": "Tesla breaks a record: The biggest six-week drop in value ever",
  "created_utc": 1615040644,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Tesla and  founder Elon Musk are renowned for notching firsts. In 2012, the EV-maker unveiled the first-ever premium all-electric sedan, the Model S. Six years later, Musk’s SpaceX launched the world’s most powerful rocket, the Falcon Heavy. That milestone marked another first, since the Falcon carried the Tesla Roadster into space, making the pioneering EV the first auto ever to orbit the Earth.</p>\n\n<p>Recently, Musk has set supersonic financial records. Tesla’s moonshot from a market cap of $30 billion in mid-April of last year to $849 billion on Jan. 26 dwarfs the leap of any other young comer on the rise in a nine-month span. By early January, Tesla’s rise had lifted Musk’s net worth to $185 billion, placing the Tesla founder on a new pedestal as the world’s richest person.</p>\n\n<p>Musk just achieved a new financial first––for the stock losing the most value ever in a brief period. Since that late January peak, Tesla’s valuation has cratered by 36%, dropping by $305 billion to $544 billion at mid-morning on March 5, as its shares tumbled from $883 to $566. No company in the annals of equity markets has ever dropped on a scale remotely that big in just five and a half weeks. Tesla’s $300 billion–plus descent exceeds the market caps of all but the 16 most valuable companies in the S&amp;P 500. Tesla dropped by far more than twice the combined market caps of Ford and General Motors, and by $100 billion more than that of the world’s second most valuable automaker, Toyota.</p>\n\n<p>It may reassure Tesla bulls that it’s been a highly volatile stock in the past: It has seen big drops and then always recovered to shoot beyond previous peaks. From mid-February to mid-March of last year, it shed half its value and in the first two weeks of September, fell 34%, only to roar back on both occasions. The September slump shaved $186 billion from its valuation, but Tesla got it all back, and $400 billion more in the months ahead. Sure, you’ll hear, Tesla will suffer big bumps along the way, but its long-term trajectory will trace a sharp upward climb.\nStill, the 34% decline means that Tesla’s shares need to rebound 56% to regain their old peak of $883 (and valuation of $849 billion). Overnight, investors decided that Tesla will earn a lot less than they foresaw as recently as late January.</p>\n\n<p>What’s driving Tesla’s big pullback?</p>\n\n<p>Let’s assume shareholders will want at least a 10% annual return in exchange for what can be counted on as a wild ride. To get there as of late January, Tesla needed to be worth $2.2 trillion by early 2031. At a premium price-to-earnings multiple of 30, Tesla would be generating $73 billion in yearly GAAP net earnings. That’s $5 billion more than Apple, by far the biggest profit spinner in the S&amp;P, made last year.</p>\n\n<p>Now, shareholders have lowered the bar––but that bar remains dauntingly high. Using the same formula, the bogey is now $1.44 trillion 10 years from now, and earnings would need to reach $48 billion. To get there, Tesla’s 2020 profits of $721 million have to grow at an annual pace of around 50%.\nThat Tesla suffered such a huge fall, so fast, highlights the extreme uncertainty in assessing what it’s really worth. In reality, investors have little or no idea how much Tesla will earn in the future. Will the number be $60 billion in 2031 or $10 billion, something lower than that or something in between? Making any reasonable estimate requires so many assumptions that the exercise is futile. What remains is a super-sexy product, a charismatic CEO, a cult following, and a great narrative. What also remains is a still-giant valuation that can only go higher if great numbers start coming in, and fast. Otherwise, Tesla is sitting on an air pocket whose deflation would set new records unlikely ever to be equaled.&quot;</p>\n\n<p><a href=\"https://fortune.com/2021/03/05/tesla-stock-tsla-elon-musk-value-drop/\">Tesla breaks a record: The biggest six-week drop in value ever</a></p>\n</div><!-- SC_ON -->",
  "score": 426,
  "permalink": "/r/stocks/comments/lyyfxn/tesla_breaks_a_record_the_biggest_sixweek_drop_in/",
  "subreddit": "stocks",
  "id": "lyyfxn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576964
}