{
  "author": "Comprehensive-Disk81",
  "the_new_excerpt": "Elon, alt coins, BTC, stocks, manipulation. Blah blah blah blah blah. Has\neveryone forgotten what they came here for?\n\nI'm from the USA and it's a two party system for a reason: to keep us divided.\nReddit is an international means of communication, yet I see so much division.\nDivision and…",
  "original_created_utc": 1621204670,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーロン、アルトコイン、BTC、株、操作。ブラブラしています。みんなは\nみんな何のためにここに来たのか忘れたのか？\n\n私はアメリカ出身ですが、二大政党制を採用しているのには理由があります。\nRedditは国際的なコミュニケーションの手段ですが、私は多くの分裂を目にします。\n分断と...",
      "title": "これは戦争ではありません。冷静にならないと、戦争になってしまいますよ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "埃隆，替代币，BTC，股票，操纵。诸如此类。难道\n大家都忘记了他们来这里的目的了吗？\n\n我来自美国，它的两党制是有原因的：让我们保持分裂。\nReddit是一种国际交流手段，但我看到了如此多的分裂。\n分裂和...",
      "title": "这不是一场战争。冷静下来，否则你会把它变成一场战争！\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "埃隆，替代幣，BTC，股票，操縱。諸如此類。難道\n大家都忘記了他們來這裏的目的了嗎？\n\n我來自美國，它的兩黨制是有原因的：讓我們保持分裂。\nReddit是一種國際交流手段，但我看到了如此多的分裂。\n分裂和...",
      "title": "這不是一場戰爭。冷靜下來，否則你會把它變成一場戰爭！\"。"
    }
  ],
  "title": "This is not a war. Chill out or you'll turn it into one!",
  "created_utc": 1621227690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Elon, alt coins, BTC, stocks, manipulation. Blah blah blah blah blah. Has everyone forgotten what they came here for?</p>\n\n<p>I&#39;m from the USA and it&#39;s a two party system for a reason: to keep us divided. Reddit is an international means of communication, yet I see so much division. Division and distraction is the goal, to make us angry and confused. Is that what you want to be, angry and confused?</p>\n\n<p>You&#39;re all doing a good job at it.</p>\n\n<p>Do not let &quot;the powers that be&quot; sway you from your life goals. Invest and hold. Rinse and repeat. Stop putting blame on outside personalities, and live the life you choose to live. Pay yourself first. </p>\n\n<p>Listen to yourself first, and no one else.</p>\n</div><!-- SC_ON -->",
  "score": 329,
  "permalink": "/r/Bitcoin/comments/ndzx1g/this_is_not_a_war_chill_out_or_youll_turn_it_into/",
  "subreddit": "Bitcoin",
  "id": "ndzx1g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590794225
}