{
  "author": "keith-graftapp",
  "original_created_utc": 1655556038,
  "title": "Graft- a personal knowledge graph",
  "created_utc": 1655565825,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a full time software engineer, a big portion of my job is to understand the complex interactions between different components in a system. This often means exploring unfamiliar code paths and tracing the flow of information.&lt;/p&gt;\n\n&lt;p&gt;A characteristic of quality software is small functions that are highly focused. A good function does one thing, and it does it well. Algorithms and procedures are built by combining these small functions into one large entity.&lt;/p&gt;\n\n&lt;p&gt;The very traits that make software good also make it highly connected. Following data through a particular flow means you may have to step through a number of smaller pieces along the way. This ends up stressing working memory.&lt;/p&gt;\n\n&lt;p&gt;If there is one glaring weakness of our brains though, it is that of working memory. While it&amp;#39;s really hard to measure working capacity, studies suggest the typical brain is capable of reliably holding around 7 pieces of information.&lt;/p&gt;\n\n&lt;p&gt;When exploring a system, I often find myself looking back at the same pieces of code over and over. The code may not be particularly complicated or hard to understand. I just don&amp;#39;t have enough working memory to keep track of it. I fill my 7 pieces of information and have to get rid of something else.&lt;/p&gt;\n\n&lt;p&gt;This process of stopping and starting, relearning the same function is painfully slow. And it felt unnecessary. It felt like a solvable problem. So I set out to solve that problem. Enter Graft.&lt;/p&gt;\n\n&lt;p&gt;Graft acts like an extension of your working memory, capable of holding all of your context for as long as you need it. It allows you to explore the meaningful relationships between your knowledge and discover new connections.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://get.graftapp.co\"&gt;https://get.graftapp.co&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Since seeing is believing, I put together a knowledge graph project illustrating the relationships between different components in Graft. Feel free to take it for a spin.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.graftapp.co/p/y1qH1NYa\"&gt;Projects, Notes and Links&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Graft helps you explore the meaningful connections between your knowledge and unlock new insights. Are you ready to grow your knowledge with Graft?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 7,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/mHnhVB1zztWLAqGJnqAyTw347_jX321cdqhEyCyzc-s.jpg?auto=webp&amp;s=a87c32c761551fc2223b17dab89ce2e79cce1dd2",
          "width": 640,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/mHnhVB1zztWLAqGJnqAyTw347_jX321cdqhEyCyzc-s.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=70d1d36a1c03700029e0bd4c9802e6b2213936fe",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/mHnhVB1zztWLAqGJnqAyTw347_jX321cdqhEyCyzc-s.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=cf04fc1a7753380d04122739c067f68e411cebae",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/mHnhVB1zztWLAqGJnqAyTw347_jX321cdqhEyCyzc-s.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=7a141a3c427a1a8b56a45f4da12926c921f01533",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/mHnhVB1zztWLAqGJnqAyTw347_jX321cdqhEyCyzc-s.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=4bfafbc4d924c83d9ae8ca010a455ed8c6f032df",
            "width": 640,
            "height": 360
          }
        ],
        "variants": {},
        "id": "bOVC17ezf6-hxwNxpjBzS9L40rX2MSbInhnGnkSsC4A"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/vf5ezl/graft_a_personal_knowledge_graph/",
  "subreddit": "SideProject",
  "id": "vf5ezl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a full time software engineer, a big portion of my job is to understand the\ncomplex interactions between different components in a system. This often means\nexploring unfamiliar code paths and tracing the flow of information.\n\nA characteristic of quality software is small functions that are…"
}