{
  "author": "jn_ku",
  "the_new_excerpt": "Disclaimer: I am not a financial advisor. This entire post represents my\npersonal views and opinions, and should not be taken as financial advice (or\nadvice of any kind whatsoever). I encourage you to do your own research, take\nanything I write with a grain of salt, and hold me accountable for any…",
  "original_created_utc": 1612344835,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "声明：我不是财务顾问。整篇文章仅代表我\n个人观点和意见，不应视为财务建议（或）。\n任何形式的建议）。) 我鼓励你做自己的研究，采取必要的措施。\n我写的任何东西都要小心翼翼，并让我对任何... ...",
      "title": "Gamestop大图片。游戏已经... 停止了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聲明：我不是財務顧問。整篇文章僅代表我\n個人觀點和意見，不應視爲財務建議（或）。\n任何形式的建議）。) 我鼓勵你做自己的研究，採取必要的措施。\n我寫的任何東西都要小心翼翼，並讓我對任何... ...",
      "title": "Gamestop大圖片。遊戲已經... 停止了嗎？"
    }
  ],
  "title": "Gamestop Big Picture: Has The Game.. Stopped?",
  "created_utc": 1612359083,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Disclaimer: I am not a financial advisor. This entire post represents my personal views and opinions, and should not be taken as financial advice (or advice of any kind whatsoever). I encourage you to do your own research, take anything I write with a grain of salt, and hold me accountable for any mistakes you may catch. Also, full disclosure, I hold a net long position in GME, but my cost basis is very low, and I&#39;m using money I can absolutely lose. My capital at risk and tolerance for risk generally is likely substantially different than yours.</em></p>\n\n<p>So today was rough for those in the GME trade.  I, for example, cracked jokes in the comments to my last post about how my remaining GME holdings went from new Lexus money, through Corolla money, and briefly delved to the depths of used golf cart money.  At one point I mentioned maybe ending up with a Razor scooter in the end, but luckily ended the day with Polaris RZR type money instead.</p>\n\n<p>I wasn&#39;t paying attention to the pre-market action, but right the start of normal market hours it looked like an avalanche of panic selling.  Looking back at the chart, seeing the consistent downward march of price, the gap down into early pre-US market, immediate drop at 7am pre-market, it shouldn&#39;t have been too surprising.  Likely a number of people who are unable to trade pre-market were just watching their numbers move in the wrong direction for hours before they got the chance to bail, and that&#39;s what happened immediately once the option was available.</p>\n\n<p>In my previous post I had identified $150/$148 as what I thought might be the &quot;retail line of defense&quot;.  Given the immediate open below, there was no solid support or consolidation around any level, though some hyper aggressive buying put the floor in at $74.22 at around 10:45.  I&#39;m honestly not sure what to make of that remarkable move.   Likely it staunched the bleeding somewhat, repairing retail morale temporarily.  Once that parabolic arc slammed into the LULD halt, price action reversed and resumed a steady march downward.</p>\n\n<p>So, where does that leave things at this point?  With respect to a squeeze, which I&#39;ve been asked about quite a bit over the past few hours, my concern is the unlocking of so much float, given what I have to interpret as heavy panic selling.  As I covered in the Market Mechanics post, locking of liquid float is paramount and today was certainly not a help in that regard.  That being said, as I pointed out in that post, locking up the float gets cheaper at lower prices, so we shall see what happens over the next few days.</p>\n\n<p>So what&#39;s next?  I don&#39;t know, and no one else does either.  Yes, that tired old answer I give in just about every post.  The thing is, it&#39;s true.  The events over the past couple of weeks have certainly reinforced that fact to me.</p>\n\n<p>As with yesterday, I&#39;ve been variously accused of being a short side hedge fund shill and a long side pumper and dumper, which again I take as indicating a healthy balance.  One thing I promise is that I will call it like I see it, and admit to any mistakes I make.</p>\n\n<h1>Knowledge and Responsibility</h1>\n\n<p>Watching events unfold today had me thinking quite a bit.  About the debates across this sub and others, the media, etc.  As I&#39;ve mentioned previously in comments, my purpose in creating this account was to try to help provide some information, education, and a space for healthy discussion for in particular all of the newer traders that were flocking to this particular trade.  I&#39;ve been very happy to read the numerous comments and messages from various people who have expressed that they feel they&#39;ve been able to learn quite a bit in a very compressed timeframe due to the intensity of focus on the situation.</p>\n\n<p>I have been told by some that rather than discuss this trade or the mechanics behind it at all, I should simply flat out tell people to stay away because of the risk, and speak of it no more.  I have to admit, I was conflicted about this, because the risk is very high, as I&#39;ve always stated.</p>\n\n<p>That being said, I believe that participation in the market is one of the most important rights people should have, and equal participation in the market requires knowledge, transparency, and information.  You are all free to make our own choices.  Whatever others may say, You <em>will</em> make your own choices.  At least we can try to help each other make those choices with the best information we have available.</p>\n\n<p>Hah, I managed to keep this post at least a little shorter!  As mentioned previously, I will probably have to keep it that way for a while due to real life responsibility.  Thank you all in advance for the great discussion.</p>\n\n<p>Man, rocket rides can sure be bumpy, but it&#39;s been the most interesting week in the market I&#39;ve ever seen.  Let&#39;s see what the day brings!</p>\n\n<p>Good luck in the market!</p>\n</div><!-- SC_ON -->",
  "score": 1097,
  "permalink": "/r/investing/comments/lbjzsn/gamestop_big_picture_has_the_game_stopped/",
  "subreddit": "investing",
  "id": "lbjzsn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534795
}