{
  "author": "_Carnage_",
  "original_created_utc": 1625209938,
  "title": "Why doesn’t everyone distance themselves from Tether? With no transparency or audit how can we trust them?",
  "created_utc": 1625247395,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is no transparency and they could crash the market. They can’t be trusted basically and there are other stable coins so why stick with Tether? And if no decent alternative exists why hasn’t one been made?</p>\n\n<p>They still haven’t been audited as far as I know which should be a massive red flag cos we just have to take their words for it that the money is all there on the exchange. </p>\n\n<p>They also have people working for them with nefarious backgrounds, so why are they being trusted? They could be printing money for all we know and if they crash the market and everyone was to lose their crypto it would be a disaster. It could easily be avoided too but the longer this goes on the more I worry about it. </p>\n\n<p>Surely everyone with holdings on Tether must know this because it would be stupid not to know the details of the company where you’re storing your crypto.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/oc4yo5/why_doesnt_everyone_distance_themselves_from/",
  "subreddit": "CryptoCurrency",
  "id": "oc4yo5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There is no transparency and they could crash the market. They can’t be trusted\nbasically and there are other stable coins so why stick with Tether? And if no\ndecent alternative exists why hasn’t one been made?\n\nThey still haven’t been audited as far as I know which should be a massive red\nflag cos…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "透明性がなく、市場を破壊する可能性がある。信頼できません。\n基本的に安定したコインは他にもあるのに、なぜテザーにこだわるのか？そして、もしまともな\nなぜTetherに固執するのでしょう？まともな代替品が存在しないなら、なぜ作られないのでしょう？\n\n私の知る限り、彼らはまだ監査を受けていません。これは大きな赤旗であるべきです。\nこれは大きな赤信号です。",
      "title": "なぜ皆、Tetherから距離を置かないのか？透明性も監査もなく、どうやって信用できるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没有透明度，他们可能会使市场崩溃。他们不能被信任\n基本上，还有其他稳定的硬币，为什么要坚持使用Tether？如果没有\n如果没有像样的替代品，为什么不做一个呢？\n\n据我所知，他们仍然没有被审计，这应该是一个巨大的红旗。\n因为...",
      "title": "为什么所有人都不与Tether保持距离？由于没有透明度或审计，我们怎么能相信他们？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有透明度，他們可能會使市場崩潰。他們不能被信任\n基本上，還有其他穩定的硬幣，爲什麼要堅持使用Tether？如果沒有\n如果沒有像樣的替代品，爲什麼不做一個呢？\n\n據我所知，他們仍然沒有被審計，這應該是一個巨大的紅旗。\n因爲...",
      "title": "爲什麼所有人都不與Tether保持距離？由於沒有透明度或審計，我們怎麼能相信他們？"
    }
  ]
}