{
  "author": "kissing_the_beehive",
  "the_new_excerpt": "I've seen a ton of questions on various crypto generation methods, so I thought\nI'd share my experiences and what's working for me. I'm not an expert, merely a\ndabbler for the last few years who has tried nearly everything to get that\nsweet, free cryp. If I missed anything, let me know in the…",
  "original_created_utc": 1616005592,
  "localize": [
    {
      "locale": "zh",
      "title": "我产生被动加密货币的5大方法（+仓位，如何设置，值得称赞，以及什么不值得花时间",
      "the_new_excerpt": "我看到了一大堆关于各种加密生成方法的问题，所以我觉得\n我愿意分享我的经验和对我有用的东西。我不是专家，只是一个\n在过去的几年里，他几乎尝试了所有的方法，以获得那个\n甜蜜的，免费的Cryp。如果我错过了什么，让我知道在... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "我產生被動加密貨幣的5大方法（+倉位，如何設置，值得稱讚，以及什麼不值得花時間",
      "the_new_excerpt": "我看到了一大堆關於各種加密生成方法的問題，所以我覺得\n我願意分享我的經驗和對我有用的東西。我不是專家，只是一個\n在過去的幾年裏，他幾乎嘗試了所有的方法，以獲得那個\n甜蜜的，免費的Cryp。如果我錯過了什麼，讓我知道在... ..."
    }
  ],
  "title": "My Top 5 Ways To Generate Passive Crypto (+ Positions, How To Get Set Up, Honorable Mentions, And What's Not Worth The Time)",
  "created_utc": 1616016956,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen a ton of questions on various crypto generation methods, so I thought I&#39;d share my experiences and what&#39;s working for me. I&#39;m not an expert, merely a dabbler for the last few years who has tried nearly everything to get that sweet, free cryp. If I missed anything, let me know in the comments! Eager to learn more.</p>\n\n<p>Edit: check the comments, y&#39;all. I only wrote about what I know, but there&#39;s some great info below on things like DeFi, yield farming, and a ton of other tools to check out. </p>\n\n<p><strong>#5 - WeNano</strong></p>\n\n<p><em>What it is:</em> Free crypto drops for the NANO currency, based on GPS location (think PokemonGo). Not a huge money maker but fun, encourages people to go outdoors, and should only grow in terms of adoption.</p>\n\n<p><em>How to get set up: D</em>ownload the WeNano app for iOS or Android and follow registration steps.</p>\n\n<p><em>How much I&#39;ve made from it:</em> In a major US city I&#39;ve made just under 5 NANO (~$25), mostly from drops in the city and a few on trips I&#39;ve made within the state.</p>\n\n<p><strong>#4 - Coinbase Rewards</strong></p>\n\n<p><em>What it is:</em> An earnings program for various currencies on where you watch educational videos and answer brief surveys. Takes less than 5 minutes per currency, the videos are interesting, and it&#39;s connected me to some great new cryptos.</p>\n\n<p><em>How to get set up:</em> You need to register on <a href=\"https://coinbase.com/\">Coinbase</a> and navigate to Rewards. No credit card or bank account required to earn rewards!</p>\n\n<p><em>How much I&#39;ve made from it:</em> $205 across ~10 currencies in about a year (during the boom)</p>\n\n<p><strong>#3 - GPU Mining</strong></p>\n\n<p><em>What it is:</em> You know what it is but you may not know how to do it. Or you may have heard it&#39;s not worth the energy and wear and tear. The truth is, it can be.. if you have a decent GPU and cheap or free power. Note: this is about using your current GPU, NOT investing in a mining rig. That is a whole nother ball game!</p>\n\n<p><em>How to get set up:</em> This platform gets some hate and it does take a service fee but I find NiceHash to be very user friendly for mining newbies. They will also help calculate your potential earnings. There are many other options out there though.</p>\n\n<p><em>How much I&#39;ve made from it:</em> ~$5/day in BTC, NOT including power costs (I live in an apt where it&#39;s included in the rent).</p>\n\n<p><strong>#2 - Staking</strong></p>\n\n<p><em>What it is:</em> HODLing crypto for set periods of time to participate in the Proof of Stake model and earn interest for doing so. Note: you CANNOT withdraw your crypto during the lockup term.</p>\n\n<p><em>How to get set up:</em> Most of the big platforms offer staking, such as <a href=\"https://crypto.com/\">Crypto.com</a> for ETH, BTC, etc.</p>\n\n<p>H<em>ow much I&#39;ve made from it:</em> I&#39;m waiting for Coinbase to launch its ETH staking so I haven&#39;t actually done this yet. But it should be around 6-7% annually.</p>\n\n<p>Edit: <a href=\"/u/Gabgra11\">/u/Gabgra11</a> pointed out: some cryptos that support staking don&#39;t actually lock up your funds. For example, ADA is staked by staking your wallet. Withdrawing funds from the wallet effectively unstakes whatever you remove before the next snapshot. There isn&#39;t a lockup period.</p>\n\n<p><strong>#1 - YieldNodes</strong></p>\n\n<p><em>What it is:</em> Earning interest through an investment firm who uses your cash on masternoding, staking, and other blockchain investments. This is the one I&#39;m most skeptical of, but also the one that pays the most, so please do your DD. Their average MONTHLY yield is 11% and they paid out 19% in February, which is insane. The best part is they&#39;re somewhat dip-proof since they make most of their money noding transactions and are not directly tied to price fluctuations. The downside is you&#39;re essentially trusting this company with your money, but they&#39;ve got great reviews on TrustPilot and the individuals are transparent on LinkedIn so I gave it a shot.</p>\n\n<p><em>How to get set up:</em> Visit their website or DM me for an affiliate link. Note: minimum deposit of 500 EUR required.</p>\n\n<p><em>How much I&#39;ve made from it:</em> 19%, I&#39;ve been in it for one month. I plan to pull out my principle and let the rest compound.</p>\n\n<p><strong>Honorable Mentions:</strong></p>\n\n<ul>\n<li>Brave Browser - not a huge money maker but a great browser where you earn BAT in exchange for receiving ad pop-ups.</li>\n<li>Reddit Moons - as you&#39;ll see, I have none, but I see the potential and love the idea!</li>\n</ul>\n\n<p><strong>Not Worth Your Time:</strong></p>\n\n<ul>\n<li>Faucets, crypto games - miniscule amounts, I haven&#39;t seen any that are worth it</li>\n<li>(Most) Airdrops - I could be wrong here.. but most of the airdrops I&#39;ve looked into have been spammy and/or a ton of effort for very little. There have been some good ones though.\n\n<ul>\n<li>Edit: <a href=\"/u/AllYourCrypto\">/u/AllYourCrypto</a> shares some great links below on airdrops and DeFi</li>\n</ul></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 507,
  "permalink": "/r/CryptoCurrency/comments/m771sd/my_top_5_ways_to_generate_passive_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "m771sd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378443
}