{
  "author": "OkImIntrigued",
  "the_new_excerpt": "He didn't use the word perspective, he didn't know that word yet. I assumed he\nmeant history because, well he's 7. When he elaborated that he meant \"No, like\nfor you, where were you, what were you?\" I was kinda set astern. My first\nthought was he shouldn't think about death, but then I realized…",
  "original_created_utc": 1622228927,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼はパースペクティブという言葉を使わず、まだその言葉を知らなかったのです。私は、彼が7歳だから歴史のことだと思った。\n彼が詳しく説明すると、「いや、君にとっては、どこにいて、何をしていたのか？\nあなたにとって、あなたはどこにいて、何をしていたの？私はちょっとびっくりしました。最初に思ったのは\n最初に思ったのは、彼は死について考えるべきではないということでしたが、その後、気づいたのです...。",
      "title": "7歳の子供に、「あなたの視点で、あなたが存在する前はどうだったかを考えたことがあるか」と聞かれました。私たちはどこにいて、何をしていたの？なんて言ったりします。良い答えがなくても、このように深く考え続けるように彼を動機付けるにはどうしたら良いでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他没有用透视这个词，他还不知道这个词。我以为他是指历史，因为他才7岁。\n当他解释说，他的意思是 \"不，就像你，你在哪里？\n对你来说，你在哪里，你是什么？\" 我有点愕然了。我的第一个想法是\n我的第一个想法是他不应该考虑死亡，但后来我意识到...",
      "title": "我7岁的孩子问我，我是否曾经从你的角度思考过你存在之前是什么样子。我们在哪里，我们是什么？我怎么说呢？我如何激励他继续这样深入思考，尽管没有好的答案？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他沒有用透視這個詞，他還不知道這個詞。我以爲他是指歷史，因爲他才7歲。\n當他解釋說，他的意思是 \"不，就像你，你在哪裏？\n對你來說，你在哪裏，你是什麼？\" 我有點愕然了。我的第一個想法是\n我的第一個想法是他不應該考慮死亡，但後來我意識到...",
      "title": "我7歲的孩子問我，我是否曾經從你的角度思考過你存在之前是什麼樣子。我們在哪裏，我們是什麼？我怎麼說呢？我如何激勵他繼續這樣深入思考，儘管沒有好的答案？"
    }
  ],
  "title": "My 7 year old asked me if I ever think about what it was like before you existed from your perspective. Where were we, what were we? What do I say? How do I motivate him to keep thinking deeply like this even though there isn't good answers?",
  "created_utc": 1622258795,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He didn&#39;t use the word perspective, he didn&#39;t know that word yet. I assumed he meant history because, well he&#39;s 7. When he elaborated that he meant &quot;No, like for you, where were you, what were you?&quot; I was kinda set astern. My first thought was he shouldn&#39;t think about death, but then I realized that&#39;s not what he&#39;s talking about. All I could muster was, &quot;Impressive that at your age you&#39;re thinking that way but many philosophers have thought about that since the beginning of time. I don&#39;t have an answer.&quot;</p>\n\n<p>I want to fertilize this type of deep thinking though. Any good resources? Any good answers?</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/askphilosophy/comments/nn55be/my_7_year_old_asked_me_if_i_ever_think_about_what/",
  "subreddit": "askphilosophy",
  "id": "nn55be",
  "is_self": true,
  "media": null,
  "is_video": false
}