{
  "author": "taco___pizza",
  "the_new_excerpt": "The argument I heard was \"we are indoors and we have an American flag flying in\nthe room. Respect the flag and remove your headwear\". How is wearing a hat\ndisrespectful? Is this some tradition from the 1700s that never died out? I'm\njust genuinely curious what the big deal is. What is the perceived…",
  "original_created_utc": 1622051932,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が聞いた言い分は、「室内にアメリカの国旗が掲げられているのに\nる。国旗を尊重して、頭にかぶるものを外しなさい」というものでした。帽子をかぶることがどうして\n帽子をかぶることがどうして無礼なのか？これは1700年代からの死滅しない伝統なのか？私は\n何が問題なのか純粋に知りたいのです。何を考えているのでしょうか...",
      "title": "室内で頭を覆うもの（帽子、パーカー、ビーニーなど）をかぶることがなぜ失礼にあたるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听到的说法是：\"我们在室内，我们有一面美国国旗在飘扬。\n房间里有美国国旗。尊重国旗，摘下你的头饰\"。戴帽子怎么会\n不尊重？这是从1700年代开始的一些从未消亡的传统吗？我\n只是真的很好奇，这有什么大不了的？什么是被认为是...",
      "title": "为什么戴头套（帽子、连帽衫、小帽等）在室内被认为是不敬的行为？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽到的說法是：\"我們在室內，我們有一面美國國旗在飄揚。\n房間裏有美國國旗。尊重國旗，摘下你的頭飾\"。戴帽子怎麼會\n不尊重？這是從1700年代開始的一些從未消亡的傳統嗎？我\n只是真的很好奇，這有什麼大不了的？什麼是被認爲是...",
      "title": "爲什麼戴頭套（帽子、連帽衫、小帽等）在室內被認爲是不敬的行爲？"
    }
  ],
  "title": "Why is wearing a head covering (hat, hoodie, beanie, etc) considered disrespectful indoors?",
  "created_utc": 1622088053,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The argument I heard was &quot;we are indoors and we have an American flag flying in the room. Respect the flag and remove your headwear&quot;. How is wearing a hat disrespectful? Is this some tradition from the 1700s that never died out? I&#39;m just genuinely curious what the big deal is. What is the perceived &quot;disrespect&quot; from wearing a hat? </p>\n\n<p>Now, I understand there are different settings with different standards. Example, indoor areas where uniforms are required, there&#39;s a formal dress code, etc. The situation I am talking about is just at grade school - I saw someone talking about it so I wanted to ask. Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/nln8be/why_is_wearing_a_head_covering_hat_hoodie_beanie/",
  "subreddit": "NoStupidQuestions",
  "id": "nln8be",
  "is_self": true,
  "media": null,
  "is_video": false
}