{
  "author": "GabeSter",
  "original_created_utc": 1652142901,
  "title": "The Terra/TerraUSD Peg is continuing to slide and looks very bleak. UST currently below .69 and Terra is down 52% today to $30 - Details and a two month old warning from a Redditor inside.",
  "created_utc": 1652164701,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a follow up post to when I noticed it was down 3% which is incredibly dangerous for a stablecoin.&lt;/p&gt;\n\n&lt;p&gt;At this point it&amp;#39;s a question of - &amp;quot;will the bleeding stop&amp;quot; or will UST/Terra Rug itself out of existence?&lt;/p&gt;\n\n&lt;p&gt;Two months ago &lt;a href=\"/u/cwm9\"&gt;/u/cwm9&lt;/a&gt; made a very detailed post about his concerns with UST. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/tbcrkh/explain_to_me_how_terraluna_is_not_a_scam/?context=3\"&gt;Which outlined a scenario exactly like this.&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But go the other way: when people start selling their UST because they want to go back to bitcoin, they mint Luna and sell it. Now the price of Luna goes down. The fact that the price is going down and total coins minted is rising encourages the selling of Luna making the price drop farther. If the price drops too far, it can no longer support the burning of UST to get a dollar by selling Luna.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The response from Reddit was - well yah that&amp;#39;s supply/demand + Terra is a lot more than UST there is a whole ecosystem.&lt;/p&gt;\n\n&lt;p&gt;Additionally Terra began buying BTC reserves and had over $1B in reserves to prepare for this scenario.&lt;/p&gt;\n\n&lt;p&gt;At this point the question isn&amp;#39;t will the peg break? The BTC reserves of $1B are likely all gone and nothing is probably left. Nearly 3B in volume in the last 24 hours. The question is, is this the end of Terra?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/um5qs6/the_terraterrausd_peg_is_continuing_to_slide_and/",
  "subreddit": "CryptoCurrency",
  "id": "um5qs6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is a follow up post to when I noticed it was down 3% which is incredibly\ndangerous for a stablecoin.\n\nAt this point it's a question of - \"will the bleeding stop\" or will UST/Terra\nRug itself out of existence?\n\nTwo months ago /u/cwm9 made a very detailed post about his concerns with UST.\nWhich…"
}