{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "**What are bonds**\n\nFirst, an introduction on what bonds actually are.\n\nSimply  put, a bond is the \"asset side\" of governmental or corporate debt. When  a government or corporation borrows money, the borrower now holds a  liability, and the lender holds an asset, which is expected to return  them their original investment (the money they lent) plus profit  (interest) at some later date. A bond is basically a token that says  some government or company owes you some amount of principal by some  date known as the maturity date (usually 3 months to 30 years, depending  on the type of bond), plus interest. Because bonds are a tokenization  of debt, they can be easily traded in a liquid, open market, just like  stocks. This means that the original lender does not need to be the  person who is repaid when the bond matures; the repayment and interest  simply goes to whomever holds the bond at the time.\n\nThere are two main types of bonds: corporate bonds, and government bonds.\n\nCorporate bonds are the main way companies raise money, apart from selling shares.\n\nGovernment  bonds are how the government raises money to cover budget deficits (ie:  when the government spends more than they have the tax revenue to  spend, they borrow the remainder by selling bonds to whomever will buy  them). If nobody is buying the government bonds, the interest will go up  organically due to supply and demand until people are willing to buy  them. Government bonds are often known as **treasuries**,  and are broken down into three categories: treasury bills (short-term  maturity), treasury notes (mid-term maturity), and treasury bonds  (long-term maturity).\n\nOne of the  main buyers of US government bonds is the Federal Reserve, which is the  name of America's central bank. This is the entity that is able to  actually print US dollars. Everyone has heard of things like how the US  government recently ran huge deficits due to \"stimulus spending\", and  that it printed the money it needed for that spending. Well, this is a  slightly inaccurate picture of how it works. The government chooses  fiscal policy, which means they build the budget and they set the tax  rates. They are the ones who choose to overspend and run a deficit.  However, they don't choose monetary policy: they cannot print money.  This power was delegated by congress to the Federal Reserve over 100  years ago.\n\nSo, when the government  runs a deficit, they sell bonds to borrow the money. If the FED chooses  to, it can print a whole bunch of money and then lend that money to the  government (ie: the taxpayer) by buying the government bonds with it.  That is how newly printed money actually gets into the economy: the FED  prints it and then lends it out to companies and to the government by  buying corporate and government bonds. When the FED buys a bunch of  treasuries (government bonds), it is really lending out freshly-printed  cash to the American people (since the government's liabilities are  really the taxpayers' liabilities), and the people then owe that money,  with interest, back to the FED by the time the treasury matures.\n\nWhen  the FED decides to buy up the government's bonds in order to lend to  the taxpayers the money that congress is spending, they are also putting  downward pressure on the bond interest rate. This is because, if the  FED decided *not* to lend a bunch  of money to the government to cover its deficits, the bond interest  would organically rise through supply &amp; demand until other buyers  (individuals, companies, foreign investors, whatever) are willing to buy  those bonds.\n\nSo, when the FED  wants to keep bond interest low, they achieve this indirectly by  creating what is basically artificial demand for US bonds by buying a  ton of them with money that they printed at no cost to themselves. Due  to how supply &amp; demand works with debt, the more demand there is for  bonds, the lower the interest those bonds offer.\n\nSo,  the Federal Reserve executes its main task of managing the US bond rate  by choosing how much government debt it buys. If they want bond rates  to go up, they will print less cash and buy fewer bonds. If they want it  to go down, they will print more cash and buy more bonds.\n\nThe  FED is essentially a whale with the power to print money, who uses said  printed money to manipulate the US bond market, ostensibly for the good  of everybody.\n\n**The risk-free rate**\n\nThe  interest rate on American government bonds is considered one of the  most important variables in the American (and even worldwide) economy.  This is because the American gov is considered the de-facto safest  borrower of all borrowers in the world. In other words, if I buy an  American government bond, I am lending my money to the entity that is  considered to have the smallest risk of defaulting in the world (maybe  this is arguable, but regardless this is a premise that is at the core  of the world economy; what's important is that people believe it).\n\nThere  is a concept in economics called the \"risk-free rate\". This is the  interest you can get for lending your money to a 0-risk borrower, and  should logically be the lowest interest rate you see anywhere in that  economy. Of course, there is always technically some risk when you lend  money, so the risk-free rate is technically imaginary. However, in  practice, just about everybody considers the US bond rate (specifically,  treasury bills, the US bond with the shortest maturity) to be the  risk-free rate, as the risk is considered to be so low as to be  negligible.\n\nSo, if buying American  gov bonds is the safest way to lend money, it means that every single  other form of loan must pay higher interest. Why? Because every other  borrower is considered higher risk, and for me as a lender, I will not  accept less interest for greater risk. So, if American bond interest  goes up, all other loan interest (corporate bonds, bank loans,  mortgages, credit cards, whatever) will organically go up, because  everything must pay greater interest than American bonds to compensate  for greater risk. This is simply a matter of supply &amp; demand  mechanics.\n\nSo, American bond  interest is kind of like the baseline or the \"sea level\" for all  interest rates in the entire economy. This even stretches to other  countries, because anyone can buy a bond from the US gov, and they are  considered the safest borrower in the world, so nobody will ever lend  money to anybody else unless they are compensated with greater interest  than US bond interest.\n\n**The cost of capital**\n\nSo,  if US bond rates go up, and therefore all interest in the economy goes  up, that means money itself has gotten more expensive. Loan interest is  literally just the cost of money (known as the cost of capital). The  lesser the interest, the cheaper it is for me to acquire money right  now. When you realize that the entire world runs mainly on debt, it  becomes clear how significant this phenomenon is.\n\nSo,  when US bond rates go up, the price of capital itself goes up. That  means it becomes more costly for businesses to raise money, more costly  to mortgage a house, more costly to open a line of credit to buy  investments, more costly to spend with credit cards, more costly to use  leverage in securities markets, etc.\n\nThis  means that growth goes down, spending goes down, wages go down, etc. It  also means the prices of goods go down (or at least climb slower),  because people aren't willing to pay as much, since capital itself is  more expensive to acquire.\n\nWhat  happens when prices go down? Well, that's a reduction in inflation. So,  when inflation is getting too high, the FED (central bank) will make  bond interest go up to apply recessive forces on the economy to curb  said inflation.\n\nIf inflation is  low, the FED might reduce bond interest in order to make the cost of  capital lower to juice the economy, prop up securities markets, and  incentivize growth. Too much growth though, and we end up with inflation  again, meaning the FED might increase rates again. This causes a sort  of wave-like dance between bond rates and the heat of the economy.\n\nSo,  the FED influences bond rates ostensibly to keep the economy balanced:  not too hot and inflationary (can be very bad) and not too cold and  deflationary (also can be very bad).\n\nIt  is also worth noting that the FED wields a couple other levers it can  use to increase or decrease the cost of capital (ie: the general  interest rates in the economy) that are separate from bond rates. They  can change the reserve requirements of banks (what percentage of total  assets a bank must hold in reserve). If banks need to hold more in  reserve, then they have less liquid money to lend out, so the supply of  capital goes down, so market interest (cost of capital) rises. Also, the  FED can change the discount rate, which is the amount of interest they  charge banks for short-term loans (24 hours or less) from the FED  itself.  When these rates go up, banks are disincentivized from  borrowing from the FED, so the banks end up with less liquid capital,  which means they need to be more conservative about the loans they  themselves give out, which makes the supply of capital go down and thus  the cost of capital go up.\n\n**What does this mean for markets?**\n\nWhen  bond rates go up, most investment markets go down. Why? Well, the  higher bond rates go, the more I can make by investing in bonds, without  the risk going up. So, as bond rates go up, it becomes more and more  attractive to move my wealth out of riskier markets like stocks and into  what is considered the safest investment market in the world: US bonds.  Since rates going up means I get greater returns on my bond  investments, but the risk doesn't change, US gov bonds become more and  more sensible to an investor as the rates increase.\n\nOf  course, bonds rates going up a smidgen doesn't actually suddenly make  bonds a strategically more sound investment than riskier things like  stocks. In fact, US bond rates have been so comically low for so long  that it hasn't made much sense to buy bonds in years (decades, really).  However, when people hear that the FED is going to increase bond rates,  they think \"bond rates going up means people will sell stocks to buy  bonds, so I better sell now to front-run that\", which is the main thing  that *actually* causes stocks to fall when bond rates increase.\n\n**Some historical context**\n\nUS  bond rates hit an ATH in 1981 around 15% (edit: some sources seem to  say 20%; unsure which is correct). Unsurprisingly, the stock market hit a  low at the same time (like I said before, the orthodox narrative is  that there is an inverse relationship between bond rates and most  securities markets). Think about how ridiculous 15% bond rates are. That  would mean you could buy what is definitionally the safest investment  available and get 15% returns each year. By contrast, the safest stock  ETFs (still way riskier than US bonds) average like 7% a year.\n\nSo,  in the 80s, you could double your money every 5 years while accepting  what is usually considered 0 risk. Ever wonder why boomers seemed to get  wealthy so easily? This is one of the reasons.\n\nSince  the ATH in 1981, the treasury bond rate has fallen continuously until  Covid hit, at which point it pivoted at a low of about 0.5%. Since then,  it has been going back up, but is still extremely low, at around 1.5%.\n\nSince  bond rates going down means stocks go up (at least, this is a very  popular narrative, though some disagree), the stock market has been in a  tremendous and arguably unnatural bull run for about 40 years, only  pausing twice very briefly for \"corrections\" circa 1999 and 2008.\n\nSince  US bond rates have gotten so close to 0%, they can't really lower them  any further without going negative (which is actually a thing, and some  countries are trying negative interest now. This is an extremely weird  rabbit hole that nobody really knows the true consequences of yet.  Imagine getting paid to borrow money. Several countries have been  experimenting with this over the last 7 years, and a few I believe for  even longer). The chair of the FED (Jerome Powell) said a few months  back that they have no intention of going to negative interest rates, so  that means these past 40 years of propping up markets by reducing bond  rates has probably come to an end.\n\nYou  could think of the continuous lowering of rates for the last 40 years  as the FED spending its ammunition to prop up markets and propel  economic growth, but now that rates are barely above 0% and the FED  isn't willing to go negative, they are out of ammo. Not only are they  out of ammo when it comes to lowering the rates, but one might also  argue they are also currently incentivized to *increase* rates to combat rising inflation.\n\nThis  is why there is fear. The FED has been sticking its hands in for 40  years to prop up markets, and now it seems they are going to stop, at  least for now.\n\nI hope this ~~ELI5~~ ~~ELI12~~  ELI-an-Intro-to-Econ student about why US gov bond rates are such an  important concept for understanding global economics has been  enlightening!\n\n[Source](https://np.reddit.com/user/pseudoHappyHippy/posts/)",
  "author_fullname": "t2_a4ssb7tg",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "A crash course on what changing the US bond rate means: an important factor for US and global markets and economies!",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_sdep2t",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.96,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 48,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 48,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1643226692,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;What are bonds&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;First, an introduction on what bonds actually are.&lt;/p&gt;\n\n&lt;p&gt;Simply  put, a bond is the &amp;quot;asset side&amp;quot; of governmental or corporate debt. When  a government or corporation borrows money, the borrower now holds a  liability, and the lender holds an asset, which is expected to return  them their original investment (the money they lent) plus profit  (interest) at some later date. A bond is basically a token that says  some government or company owes you some amount of principal by some  date known as the maturity date (usually 3 months to 30 years, depending  on the type of bond), plus interest. Because bonds are a tokenization  of debt, they can be easily traded in a liquid, open market, just like  stocks. This means that the original lender does not need to be the  person who is repaid when the bond matures; the repayment and interest  simply goes to whomever holds the bond at the time.&lt;/p&gt;\n\n&lt;p&gt;There are two main types of bonds: corporate bonds, and government bonds.&lt;/p&gt;\n\n&lt;p&gt;Corporate bonds are the main way companies raise money, apart from selling shares.&lt;/p&gt;\n\n&lt;p&gt;Government  bonds are how the government raises money to cover budget deficits (ie:  when the government spends more than they have the tax revenue to  spend, they borrow the remainder by selling bonds to whomever will buy  them). If nobody is buying the government bonds, the interest will go up  organically due to supply and demand until people are willing to buy  them. Government bonds are often known as &lt;strong&gt;treasuries&lt;/strong&gt;,  and are broken down into three categories: treasury bills (short-term  maturity), treasury notes (mid-term maturity), and treasury bonds  (long-term maturity).&lt;/p&gt;\n\n&lt;p&gt;One of the  main buyers of US government bonds is the Federal Reserve, which is the  name of America&amp;#39;s central bank. This is the entity that is able to  actually print US dollars. Everyone has heard of things like how the US  government recently ran huge deficits due to &amp;quot;stimulus spending&amp;quot;, and  that it printed the money it needed for that spending. Well, this is a  slightly inaccurate picture of how it works. The government chooses  fiscal policy, which means they build the budget and they set the tax  rates. They are the ones who choose to overspend and run a deficit.  However, they don&amp;#39;t choose monetary policy: they cannot print money.  This power was delegated by congress to the Federal Reserve over 100  years ago.&lt;/p&gt;\n\n&lt;p&gt;So, when the government  runs a deficit, they sell bonds to borrow the money. If the FED chooses  to, it can print a whole bunch of money and then lend that money to the  government (ie: the taxpayer) by buying the government bonds with it.  That is how newly printed money actually gets into the economy: the FED  prints it and then lends it out to companies and to the government by  buying corporate and government bonds. When the FED buys a bunch of  treasuries (government bonds), it is really lending out freshly-printed  cash to the American people (since the government&amp;#39;s liabilities are  really the taxpayers&amp;#39; liabilities), and the people then owe that money,  with interest, back to the FED by the time the treasury matures.&lt;/p&gt;\n\n&lt;p&gt;When  the FED decides to buy up the government&amp;#39;s bonds in order to lend to  the taxpayers the money that congress is spending, they are also putting  downward pressure on the bond interest rate. This is because, if the  FED decided &lt;em&gt;not&lt;/em&gt; to lend a bunch  of money to the government to cover its deficits, the bond interest  would organically rise through supply &amp;amp; demand until other buyers  (individuals, companies, foreign investors, whatever) are willing to buy  those bonds.&lt;/p&gt;\n\n&lt;p&gt;So, when the FED  wants to keep bond interest low, they achieve this indirectly by  creating what is basically artificial demand for US bonds by buying a  ton of them with money that they printed at no cost to themselves. Due  to how supply &amp;amp; demand works with debt, the more demand there is for  bonds, the lower the interest those bonds offer.&lt;/p&gt;\n\n&lt;p&gt;So,  the Federal Reserve executes its main task of managing the US bond rate  by choosing how much government debt it buys. If they want bond rates  to go up, they will print less cash and buy fewer bonds. If they want it  to go down, they will print more cash and buy more bonds.&lt;/p&gt;\n\n&lt;p&gt;The  FED is essentially a whale with the power to print money, who uses said  printed money to manipulate the US bond market, ostensibly for the good  of everybody.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The risk-free rate&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The  interest rate on American government bonds is considered one of the  most important variables in the American (and even worldwide) economy.  This is because the American gov is considered the de-facto safest  borrower of all borrowers in the world. In other words, if I buy an  American government bond, I am lending my money to the entity that is  considered to have the smallest risk of defaulting in the world (maybe  this is arguable, but regardless this is a premise that is at the core  of the world economy; what&amp;#39;s important is that people believe it).&lt;/p&gt;\n\n&lt;p&gt;There  is a concept in economics called the &amp;quot;risk-free rate&amp;quot;. This is the  interest you can get for lending your money to a 0-risk borrower, and  should logically be the lowest interest rate you see anywhere in that  economy. Of course, there is always technically some risk when you lend  money, so the risk-free rate is technically imaginary. However, in  practice, just about everybody considers the US bond rate (specifically,  treasury bills, the US bond with the shortest maturity) to be the  risk-free rate, as the risk is considered to be so low as to be  negligible.&lt;/p&gt;\n\n&lt;p&gt;So, if buying American  gov bonds is the safest way to lend money, it means that every single  other form of loan must pay higher interest. Why? Because every other  borrower is considered higher risk, and for me as a lender, I will not  accept less interest for greater risk. So, if American bond interest  goes up, all other loan interest (corporate bonds, bank loans,  mortgages, credit cards, whatever) will organically go up, because  everything must pay greater interest than American bonds to compensate  for greater risk. This is simply a matter of supply &amp;amp; demand  mechanics.&lt;/p&gt;\n\n&lt;p&gt;So, American bond  interest is kind of like the baseline or the &amp;quot;sea level&amp;quot; for all  interest rates in the entire economy. This even stretches to other  countries, because anyone can buy a bond from the US gov, and they are  considered the safest borrower in the world, so nobody will ever lend  money to anybody else unless they are compensated with greater interest  than US bond interest.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The cost of capital&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So,  if US bond rates go up, and therefore all interest in the economy goes  up, that means money itself has gotten more expensive. Loan interest is  literally just the cost of money (known as the cost of capital). The  lesser the interest, the cheaper it is for me to acquire money right  now. When you realize that the entire world runs mainly on debt, it  becomes clear how significant this phenomenon is.&lt;/p&gt;\n\n&lt;p&gt;So,  when US bond rates go up, the price of capital itself goes up. That  means it becomes more costly for businesses to raise money, more costly  to mortgage a house, more costly to open a line of credit to buy  investments, more costly to spend with credit cards, more costly to use  leverage in securities markets, etc.&lt;/p&gt;\n\n&lt;p&gt;This  means that growth goes down, spending goes down, wages go down, etc. It  also means the prices of goods go down (or at least climb slower),  because people aren&amp;#39;t willing to pay as much, since capital itself is  more expensive to acquire.&lt;/p&gt;\n\n&lt;p&gt;What  happens when prices go down? Well, that&amp;#39;s a reduction in inflation. So,  when inflation is getting too high, the FED (central bank) will make  bond interest go up to apply recessive forces on the economy to curb  said inflation.&lt;/p&gt;\n\n&lt;p&gt;If inflation is  low, the FED might reduce bond interest in order to make the cost of  capital lower to juice the economy, prop up securities markets, and  incentivize growth. Too much growth though, and we end up with inflation  again, meaning the FED might increase rates again. This causes a sort  of wave-like dance between bond rates and the heat of the economy.&lt;/p&gt;\n\n&lt;p&gt;So,  the FED influences bond rates ostensibly to keep the economy balanced:  not too hot and inflationary (can be very bad) and not too cold and  deflationary (also can be very bad).&lt;/p&gt;\n\n&lt;p&gt;It  is also worth noting that the FED wields a couple other levers it can  use to increase or decrease the cost of capital (ie: the general  interest rates in the economy) that are separate from bond rates. They  can change the reserve requirements of banks (what percentage of total  assets a bank must hold in reserve). If banks need to hold more in  reserve, then they have less liquid money to lend out, so the supply of  capital goes down, so market interest (cost of capital) rises. Also, the  FED can change the discount rate, which is the amount of interest they  charge banks for short-term loans (24 hours or less) from the FED  itself.  When these rates go up, banks are disincentivized from  borrowing from the FED, so the banks end up with less liquid capital,  which means they need to be more conservative about the loans they  themselves give out, which makes the supply of capital go down and thus  the cost of capital go up.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What does this mean for markets?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;When  bond rates go up, most investment markets go down. Why? Well, the  higher bond rates go, the more I can make by investing in bonds, without  the risk going up. So, as bond rates go up, it becomes more and more  attractive to move my wealth out of riskier markets like stocks and into  what is considered the safest investment market in the world: US bonds.  Since rates going up means I get greater returns on my bond  investments, but the risk doesn&amp;#39;t change, US gov bonds become more and  more sensible to an investor as the rates increase.&lt;/p&gt;\n\n&lt;p&gt;Of  course, bonds rates going up a smidgen doesn&amp;#39;t actually suddenly make  bonds a strategically more sound investment than riskier things like  stocks. In fact, US bond rates have been so comically low for so long  that it hasn&amp;#39;t made much sense to buy bonds in years (decades, really).  However, when people hear that the FED is going to increase bond rates,  they think &amp;quot;bond rates going up means people will sell stocks to buy  bonds, so I better sell now to front-run that&amp;quot;, which is the main thing  that &lt;em&gt;actually&lt;/em&gt; causes stocks to fall when bond rates increase.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Some historical context&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;US  bond rates hit an ATH in 1981 around 15% (edit: some sources seem to  say 20%; unsure which is correct). Unsurprisingly, the stock market hit a  low at the same time (like I said before, the orthodox narrative is  that there is an inverse relationship between bond rates and most  securities markets). Think about how ridiculous 15% bond rates are. That  would mean you could buy what is definitionally the safest investment  available and get 15% returns each year. By contrast, the safest stock  ETFs (still way riskier than US bonds) average like 7% a year.&lt;/p&gt;\n\n&lt;p&gt;So,  in the 80s, you could double your money every 5 years while accepting  what is usually considered 0 risk. Ever wonder why boomers seemed to get  wealthy so easily? This is one of the reasons.&lt;/p&gt;\n\n&lt;p&gt;Since  the ATH in 1981, the treasury bond rate has fallen continuously until  Covid hit, at which point it pivoted at a low of about 0.5%. Since then,  it has been going back up, but is still extremely low, at around 1.5%.&lt;/p&gt;\n\n&lt;p&gt;Since  bond rates going down means stocks go up (at least, this is a very  popular narrative, though some disagree), the stock market has been in a  tremendous and arguably unnatural bull run for about 40 years, only  pausing twice very briefly for &amp;quot;corrections&amp;quot; circa 1999 and 2008.&lt;/p&gt;\n\n&lt;p&gt;Since  US bond rates have gotten so close to 0%, they can&amp;#39;t really lower them  any further without going negative (which is actually a thing, and some  countries are trying negative interest now. This is an extremely weird  rabbit hole that nobody really knows the true consequences of yet.  Imagine getting paid to borrow money. Several countries have been  experimenting with this over the last 7 years, and a few I believe for  even longer). The chair of the FED (Jerome Powell) said a few months  back that they have no intention of going to negative interest rates, so  that means these past 40 years of propping up markets by reducing bond  rates has probably come to an end.&lt;/p&gt;\n\n&lt;p&gt;You  could think of the continuous lowering of rates for the last 40 years  as the FED spending its ammunition to prop up markets and propel  economic growth, but now that rates are barely above 0% and the FED  isn&amp;#39;t willing to go negative, they are out of ammo. Not only are they  out of ammo when it comes to lowering the rates, but one might also  argue they are also currently incentivized to &lt;em&gt;increase&lt;/em&gt; rates to combat rising inflation.&lt;/p&gt;\n\n&lt;p&gt;This  is why there is fear. The FED has been sticking its hands in for 40  years to prop up markets, and now it seems they are going to stop, at  least for now.&lt;/p&gt;\n\n&lt;p&gt;I hope this &lt;del&gt;ELI5&lt;/del&gt; &lt;del&gt;ELI12&lt;/del&gt;  ELI-an-Intro-to-Econ student about why US gov bond rates are such an  important concept for understanding global economics has been  enlightening!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://np.reddit.com/user/pseudoHappyHippy/posts/\"&gt;Source&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "sdep2t",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "cascading_disruption",
  "discussion_type": null,
  "num_comments": 13,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/sdep2t/a_crash_course_on_what_changing_the_us_bond_rate/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/sdep2t/a_crash_course_on_what_changing_the_us_bond_rate/",
  "subreddit_subscribers": 3572012,
  "created_utc": 1643231658,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1643226692,
  "the_new_excerpt": "What are bonds\n\nFirst, an introduction on what bonds actually are.\n\nSimply put, a bond is the \"asset side\" of governmental or corporate debt. When a\ngovernment or corporation borrows money, the borrower now holds a liability, and\nthe lender holds an asset, which is expected to return them their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "債券とは\n\nまず、債券とはどのようなものかを紹介します。\n\n簡単に言うと、債券は国や企業の借金の「資産側」です。ある国が\n政府や企業がお金を借りると、借り手は負債を抱えることになります。\n貸し手は資産を保有し、その資産を返すことが期待される。",
      "title": "米国債金利の変動が意味するもの：米国および世界の市場・経済にとって重要な要素であることがよくわかる講座!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "什么是债券\n\n首先，介绍一下债券到底是什么。\n\n简单地说，债券是政府或公司债务的 \"资产方面\"。当一个\n政府或公司借钱的时候，借款人现在持有一种负债，而贷款人持有一种资产。\n贷款人持有的是一种资产，而这种资产预计会归还他们。",
      "title": "关于改变美国债券利率意味着什么的速成班：对美国和全球市场和经济的一个重要因素!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "什麼是債券\n\n首先，介紹一下債券到底是什麼。\n\n簡單地說，債券是政府或公司債務的 \"資產方面\"。當一個\n政府或公司借錢的時候，借款人現在持有一種負債，而貸款人持有一種資產。\n貸款人持有的是一種資產，而這種資產預計會歸還他們。",
      "title": "關於改變美國債券利率意味着什麼的速成班：對美國和全球市場和經濟的一個重要因素!"
    }
  ]
}