{
  "author": "Wiardv",
  "original_created_utc": 1634396037,
  "title": "If you ever feel dumb, remember there are people who STILL think we're in a bear market",
  "created_utc": 1634420369,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some people on Twitter have been calling for BTC to 10k since it hit 30/40k. Now that BTC is at 61K, they don&#39;t want to admit they are wrong, but instead they keep saying we&#39;re in a bear market and &quot;We should crash aaaanytime now, right?</p>\n\n<p>Whenever BTC goes from 61K to 60K they say: See? I told you! Bear market. Why do some people act like this lol. It&#39;s way more fun to be a perma bull than a perma bear. I am a perma bull, I was bullish at 40k, we then went down to 30k, I was bullish there as well. So while they are always bearish, I am always bullish. But bullish is way more fun.</p>\n\n<p>Let me tell you a secret: This is not what a bear market looks like. Don&#39;t be like: &quot;Oh this dump to 60k is what I&#39;ve been warning you about. <strong>We&#39;re in a bull market, if you&#39;re still a bear, just join the bulls, we don&#39;t bite.</strong></p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/q9djnv/if_you_ever_feel_dumb_remember_there_are_people/",
  "subreddit": "CryptoCurrency",
  "id": "q9djnv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some people on Twitter have been calling for BTC to 10k since it hit 30/40k. Now\nthat BTC is at 61K, they don't want to admit they are wrong, but instead they\nkeep saying we're in a bear market and \"We should crash aaaanytime now, right?\n\nWhenever BTC goes from 61K to 60K they say: See? I told you!…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ツイッターでは、BTCが30/40kになったときから、10kにしてくれと言っている人もいる。今\nBTCが61Kになった今、彼らは自分たちが間違っていることを認めようとはせず、代わりに\nBTCが61Kになった今、彼らは自分たちの間違いを認めようとせず、弱気になっていると言い続けています。\n\nBTCが61Kから60Kになるたびに彼らは言います。ほらね。だから言ったじゃないか！...と。",
      "title": "もし自分が馬鹿だと思ったら、今でも弱気になっている人がいることを思い出してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "推特上的一些人在BTC达到30/40K后，一直在呼吁将其提升到10K。现在\n现在BTC达到了61K，他们不想承认自己是错的，而是说\n他们一直说我们处于熊市，\"我们现在应该随时崩溃，对吗？\n\n每当BTC从61K涨到60K时，他们就会说。看到了吗？我告诉过你！...",
      "title": "如果你觉得自己很蠢，请记住，有些人仍然认为我们处于熊市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "推特上的一些人在BTC達到30/40K後，一直在呼籲將其提升到10K。現在\n現在BTC達到了61K，他們不想承認自己是錯的，而是說\n他們一直說我們處於熊市，\"我們現在應該隨時崩潰，對嗎？\n\n每當BTC從61K漲到60K時，他們就會說。看到了嗎？我告訴過你！...",
      "title": "如果你覺得自己很蠢，請記住，有些人仍然認爲我們處於熊市。"
    }
  ]
}