{
  "author": "TheTopplingRobot",
  "the_new_excerpt": "Beehive [https://www.askbeehive.com] is a social app that makes it easy to keep\nin touch with your friends by filling your day with quick, spontaneous phone\ncalls.\n\nWhen you have a free minute in your day, like when you're on a walk or waiting\nin line, you can post a topic on Beehive. Your friends…",
  "original_created_utc": 1621528241,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Beehive [https://www.askbeehive.com]は、友達と簡単に連絡を取ることができるソーシャルアプリです。\n友達と簡単に連絡を取り合えるソーシャルアプリです。\n電話をかけることができます。\n\n散歩中や行列に並んでいるときなど、1日の中で空いた時間があれば、Beehiveにトピックを投稿することができます。\nBeehiveにトピックを投稿することができます。あなたの友人は...",
      "title": "友達と連絡を取り合えるアプリを作ってみた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "蜂巢[https://www.askbeehive.com]是一款社交应用程序，它使你能够轻松地与你的朋友保持联系。\n与你的朋友保持联系，用快速、自发的电话来充实你的一天。\n电话。\n\n当你一天中有空闲时间时，比如你在散步或排队等候时，你可以在Beehive上发布一个话题。\n排队时，你可以在Beehive上发布一个话题。你的朋友...",
      "title": "我建立了一个应用程序，帮助你与你的朋友保持联系"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "蜂巢[https://www.askbeehive.com]是一款社交應用程序，它使你能夠輕鬆地與你的朋友保持聯繫。\n與你的朋友保持聯繫，用快速、自發的電話來充實你的一天。\n電話。\n\n當你一天中有空閒時間時，比如你在散步或排隊等候時，你可以在Beehive上發佈一個話題。\n排隊時，你可以在Beehive上發佈一個話題。你的朋友...",
      "title": "我建立了一個應用程序，幫助你與你的朋友保持聯繫"
    }
  ],
  "title": "I built an app that helps you keep in touch with your friends",
  "created_utc": 1621568958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.askbeehive.com\">Beehive</a> is a social app that makes it easy to keep in touch with your friends by filling your day with quick, spontaneous phone calls. </p>\n\n<p>When you have a free minute in your day, like when you&#39;re on a walk or waiting in line, you can post a topic on Beehive. Your friends will get notified that you&#39;re available and can call you through the app. </p>\n\n<p>My friend group has used it to talk about our day, the news, life advice, or plan meetups in-person. It&#39;s helped us feel more engaged in each others&#39; lives, form deeper connections, and pass the time. Hope you and your friends try it out!</p>\n</div><!-- SC_ON -->",
  "score": 11,
  "permalink": "/r/SideProject/comments/nh4qwg/i_built_an_app_that_helps_you_keep_in_touch_with/",
  "subreddit": "SideProject",
  "id": "nh4qwg",
  "is_self": true,
  "media": null,
  "is_video": false
}