{
  "author": "CMScientist",
  "the_new_excerpt": "The panic of 1901 [https://en.wikipedia.org/wiki/Panic_of_1901] was caused by a\nstandoff between J.P. Morgan/James Hill and E. H. Harriman for control over\nNorthern Pacific Railways. Trying to take control of the company, both parties\ncombined bought over 94% of the float. At the same time, other…",
  "original_created_utc": 1616655481,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "1901年的恐慌[https://en.wikipedia.org/wiki/Panic_of_1901]是由一个。\nJ.P.摩根/詹姆斯-希尔和E.H.哈里曼为争夺控制权而发生的对峙。\n北太平洋铁路公司。试图控制公司，双方。\n合计买入了超过94%的浮动股。同时，其他...",
      "title": "直到纽约证券交易所的第一次市场崩溃是由一个史诗般的空头挤压造成的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1901年的恐慌[https://en.wikipedia.org/wiki/Panic_of_1901]是由一個。\nJ.P.摩根/詹姆斯-希爾和E.H.哈里曼爲爭奪控制權而發生的對峙。\n北太平洋鐵路公司。試圖控制公司，雙方。\n合計買入了超過94%的浮動股。同時，其他...",
      "title": "直到紐約證券交易所的第一次市場崩潰是由一個史詩般的空頭擠壓造成的。"
    }
  ],
  "title": "TIL the first market crash at the NYSE was caused by an epic short squeeze",
  "created_utc": 1616707516,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://en.wikipedia.org/wiki/Panic_of_1901\">The panic of 1901</a> was caused by a standoff between J.P. Morgan/James Hill and E. H. Harriman for control over Northern Pacific Railways. Trying to take control of the company, both parties combined bought over 94% of the float. At the same time, other investors were heavily shorting the stock (to sell to one of the parties), until at one point everyone realized that they won&#39;t be able to cover their short position because Morgan/Hill and Harriman won&#39;t sell their shares. The shorts were squeezed as they fought for the remaining 6% of the shares and drove NP from $20 to $240. To pay for the high covering share prices, the shorts liquidated their other positions, causing mass panic that rippled through the whole stock market. Overwhelming cries of &quot;sell! sell! sell!&quot; were heard at the NYSE trading floor. Temporary relief were provided when rumors of Morgan&#39;s broker&#39;s death were spread, but quickly dissipated and the panic resumed. The whole ordeal concluded only when the two parties reached a truce and the shorts were finally able to cover their position.</p>\n\n<p>Edit: <a href=\"https://www.reddit.com/r/wallstreetbets/comments/mcs5v4/til_the_first_market_crash_at_the_nyse_was_caused/gs6jxro?utm_source=share&amp;utm_medium=web2x&amp;context=3\">someone corrected me and NP actually went to an intraday high of $1000/share</a>, corresponding to over $31K in today&#39;s dollars. I was only able to find some chart with longer time scale points that showed a high of $240.</p>\n</div><!-- SC_ON -->",
  "score": 3462,
  "permalink": "/r/wallstreetbets/comments/mcs5v4/til_the_first_market_crash_at_the_nyse_was_caused/",
  "subreddit": "wallstreetbets",
  "id": "mcs5v4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357144836
}