{
  "author": "fizzle63",
  "the_new_excerpt": "How do you navigate these myriad of options, sub-options, and sidebars? I'm just\ntrying to pull up simple lists of very basic index funds and ETFs such as their\nequivalents of VTI, BND, VT, VGIT, etc. and I'm getting reams of results far\nafield. Their interface looks like the television feed from…",
  "original_created_utc": 1621270046,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "膨大な数のオプション、サブオプション、サイドバーをどのように使いこなすのか？私はただ\n非常に基本的なインデックスファンドやETFのシンプルなリストを引き出そうとしています。\nVTI、BND、VT、VGITなどに相当する基本的なインデックスファンドやETFの簡単なリストを検索しようとしているのですが、結果は膨大な量になってしまいました。\n遠く離れています。彼らのインターフェイスは、テレビのフィードのように見えます...",
      "title": "最近、Fidelityで課税口座を開設したのですが、彼らのウェブサイトはナビゲートが難しいですよね？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你如何浏览这些无数的选项、子选项和边栏？我只是\n试图拉出非常基本的指数基金和ETF的简单列表，如它们的\n等价的VTI、BND、VT、VGIT等，但我得到的结果是一沓一沓的。\n遥远的地方。他们的界面看起来就像从电视上看到的...",
      "title": "最近在Fidelity开了一个应税账户，他们的网站很难浏览，不是吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你如何瀏覽這些無數的選項、子選項和邊欄？我只是\n試圖拉出非常基本的指數基金和ETF的簡單列表，如它們的\n等價的VTI、BND、VT、VGIT等，但我得到的結果是一沓一沓的。\n遙遠的地方。他們的界面看起來就像從電視上看到的...",
      "title": "最近在Fidelity開了一個應稅賬戶，他們的網站很難瀏覽，不是嗎？"
    }
  ],
  "title": "Recently opened a taxable account at Fidelity, and their website is hard to navigate, no?",
  "created_utc": 1621283389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How do you navigate these myriad of options, sub-options, and sidebars?  I&#39;m just trying to pull up simple lists of very basic index funds and ETFs such as their equivalents of VTI, BND, VT, VGIT, etc. and I&#39;m getting reams of results far afield.  Their interface looks like the television feed from <em>Idiocracy</em> (2006).</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/Bogleheads/comments/nel99g/recently_opened_a_taxable_account_at_fidelity_and/",
  "subreddit": "Bogleheads",
  "id": "nel99g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802226
}