{
  "author": "somethingesque",
  "the_new_excerpt": "After a series of losses in my early trading career, I thought I'd be humbled\nenough to realize that any gain is a good gain, no matter the trajectory of a\nstock. Even after being in deep red earlier this year, and finally realizing\nsome profits, I can't help but think about the \"could haves\".\n\nI…",
  "original_created_utc": 1622399749,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トレーディングを始めて間もない頃、何度も負け続けた私は、「どんな利益でも良い利益だ。\n株の軌道がどうであれ、利益は良い利益だと謙虚に考えるようになりました。\nの株を購入しました。今年の初めに大赤字になって、ようやく利益が出た後も\n今年の初めに大赤字になって、ようやく利益が出た後でも、どうしても「できたはずのこと」を考えてしまいます。\n\nI...",
      "title": "得をすればするほど、欲が出てくる。皆さんは、利確して売っても上がり続けた銘柄にどう対処していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我早期的交易生涯中经历了一系列的损失后，我认为我应该谦虚地认识到，任何收益都是好的收益。\n意识到任何收益都是好的收益，无论股票的轨迹如何。\n股票。即使在今年早些时候深陷亏损，并最终意识到\n一些利润，我还是忍不住想 \"可以\"。\n\nI...",
      "title": "我收益越多，就越贪婪。你们是如何处理那些在卖出获利后仍不断上涨的股票的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我早期的交易生涯中經歷了一系列的損失後，我認爲我應該謙虛地認識到，任何收益都是好的收益。\n意識到任何收益都是好的收益，無論股票的軌跡如何。\n股票。即使在今年早些時候深陷虧損，並最終意識到\n一些利潤，我還是忍不住想 \"可以\"。\n\nI...",
      "title": "我收益越多，就越貪婪。你們是如何處理那些在賣出獲利後仍不斷上漲的股票的？"
    }
  ],
  "title": "The more I gain, the more I get greedy. How do you guys deal with stocks that kept moving up even after selling at a profit?",
  "created_utc": 1622404587,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After a series of losses in my early trading career, I thought I&#39;d be humbled enough to realize that any gain is a good gain, no matter the trajectory of a stock. Even after being in deep red earlier this year, and finally realizing some profits, I can&#39;t help but think about the &quot;could haves&quot;. </p>\n\n<p>I need to realign and shift perspectives, even though I know that&#39;s the path to heavy losses, how do you guys deal with?</p>\n</div><!-- SC_ON -->",
  "score": 2510,
  "permalink": "/r/stocks/comments/nohefp/the_more_i_gain_the_more_i_get_greedy_how_do_you/",
  "subreddit": "stocks",
  "id": "nohefp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300253
}