{
  "author": "roberthonker",
  "original_created_utc": 1625953000,
  "title": "A Huge upgrade to Ethereum is coming within the next month. Here's what it means for the price of ETH",
  "created_utc": 1625971504,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EIP-1559 is a proposal for Ethereum that will be released on August 4th. This is the first step in ETH2, and the shift to Proof Of Stake. In essence, it will make gas fees more consistent and predictable. This is necessary because it will allow users to predict their transaction fee more effectively before sending.</p>\n\n<p>Another aspect of EIP-1559 is that it will burn the gas fees, making ETH less inflationary. This is a big deal for holders because less coins will be available for miners to sell, therefore the circulating supply will be diminished. This is a good thing for your ETH because a lower circulating supply means a higher price per coin.</p>\n\n<p>Full Disclosure: I own ETH and I am very bullish on it.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/ohrg2n/a_huge_upgrade_to_ethereum_is_coming_within_the/",
  "subreddit": "CryptoCurrency",
  "id": "ohrg2n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EIP-1559 is a proposal for Ethereum that will be released on August 4th. This is\nthe first step in ETH2, and the shift to Proof Of Stake. In essence, it will\nmake gas fees more consistent and predictable. This is necessary because it will\nallow users to predict their transaction fee more effectively…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EIP-1559は、8月4日に公開されるイーサリアムの提案です。これは\nETH2の最初のステップであり、Proof Of Stakeへの移行です。要するに、これは\nガス料金をより一貫性のある、予測可能なものにする。これが必要なのは\nユーザーが取引手数料をより効果的に予測できるようになります...",
      "title": "イーサリアムの巨大なアップグレードが来月中に行われる。ETHの価格に与える影響は以下の通りです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "EIP-1559是以太坊的一项提案，将于8月4日发布。这也是\n是ETH2的第一步，也是向权益证明转变的第一步。从本质上讲，它将\n使天然气费用更加一致和可预测。这是必要的，因为它将\n允许用户更有效地预测他们的交易费用...",
      "title": "以太坊的一次巨大升级将在下个月内到来。下面是它对ETH价格的意义"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "EIP-1559是以太坊的一項提案，將於8月4日發佈。這也是\n是ETH2的第一步，也是向權益證明轉變的第一步。從本質上講，它將\n使天然氣費用更加一致和可預測。這是必要的，因爲它將\n允許用戶更有效地預測他們的交易費用...",
      "title": "以太坊的一次巨大升級將在下個月內到來。下面是它對ETH價格的意義"
    }
  ]
}