{
  "author": "07Ghost",
  "the_new_excerpt": "Jeremy Grantham, a value investor, warned his clients that he finally start\nseeing bubbles forming in parts of the market and it would burst any time soon.\n[https://www.gmo.com/asia/research-library/waiting-for-the-last-dance/] He lays\nout many reasons why he sees the ending is near, yet the…",
  "original_created_utc": 1611370324,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "杰里米-格兰瑟姆，一个价值投资者，警告他的客户，他终于开始。\n看到部分市场的泡沫形成，它随时会破灭。\n[https://www.gmo.com/asia/research-library/waiting-for-the-last-dance/] 他说\n出了很多原因，为什么他看到的结局是近在咫尺，却...",
      "title": "那些试图叫嚣市场泡沫的人的讽刺行为"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "傑里米-格蘭瑟姆，一個價值投資者，警告他的客戶，他終於開始。\n看到部分市場的泡沫形成，它隨時會破滅。\n[https://www.gmo.com/asia/research-library/waiting-for-the-last-dance/] 他說\n出了很多原因，爲什麼他看到的結局是近在咫尺，卻...",
      "title": "那些試圖叫囂市場泡沫的人的諷刺行爲"
    }
  ],
  "title": "The Irony of Those Who Trying To Call Market Bubbles",
  "created_utc": 1611448174,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Jeremy Grantham, a value investor, <a href=\"https://www.gmo.com/asia/research-library/waiting-for-the-last-dance/\">warned his clients that he finally start seeing bubbles forming in parts of the market and it would burst any time soon.</a> He lays out many reasons why he sees the ending is near, yet <a href=\"https://www.youtube.com/watch?v=RYfmRTyl56w\">the interview he did with Bloomberg</a> shines a light that he&#39;s trying to time a market bubble just like every retail traders is doing right now.</p>\n\n<p>Irony 1: He calls out SPACs an illegitimated instrument for immature companies going public to raise capitals. Yet, he owns Quantum Scape which went public via SPAC. The company has no plan to generate any revenue until 2024-2025. I&#39;m sure he has been rewarded handsomely, but being an early investor has restricted him to sell shares to the public until lock up expiration. So all he can do right now is watching his investment goes up and down in wild swings.</p>\n\n<p>Irony 2: He is an advocated green energy investors. He has called out Tesla a bubble, which many by the time now know. He was wondering why the market hasn&#39;t taken notices to his green energy investments for 10 years. That was until Tesla showed up of course. The fact of his EVs&#39; and other green energies companies&#39; valuation are going into bubble territory is exactly because of Tesla&#39;s leading the charge. Perhaps he should sell some of those investments if he thinks those are in the bubbles as well?</p>\n\n<p>You have many other examples. Even legendary investor Warren Buffet, who advocated &quot;Be greedy when others are fearful,&quot; was very fearful just like every other human beings during the COVID crash in February &amp; March of 2020. Berkshire was not executing its strategy and sold many of its holding at rock bottom. If Buffet was brave at that moment like he did during the financial crisis of 2008, I&#39;m sure Berkshire&#39;s stock would outperform the market by a large margin by now.</p>\n\n<p>Moral of the story: Listen to what people said, <strong>but pay attention to what they actually DO.</strong> No one knows when the bubble may pop. If you&#39;re thinking long term, just stay the course. You will ride through bubble pops and still come up on tops in the end if you&#39;re investing in good companies.</p>\n\n<p>Fun fact: Fidelity has done yearly studies of their clients&#39; accounts performance, for many years. The best performing portfolio? Well, Fidelity found out those account holders were no longer living in this world, so &quot;Hold-onto dare Life&quot; until your dick dries up.</p>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/investing/comments/l33k1q/the_irony_of_those_who_trying_to_call_market/",
  "subreddit": "investing",
  "id": "l33k1q",
  "is_self": true,
  "media": null,
  "is_video": false
}