{
  "author": "busterrulezzz",
  "original_created_utc": 1642427515,
  "title": "Gamers aren't against NFTs. They're against microtransactions cash-grabs.",
  "created_utc": 1642438434,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last year, several gaming studios announced plans to roll-out NFTs on their platforms, and the backlash was swift. Gamers threatened to cancel their Discord membership, Square Enix got criticized for introducing NFTs in &lt;em&gt;Kingdom Hearts&lt;/em&gt;, Ubisoft got panned for a similar NFT program last month...&lt;/p&gt;\n\n&lt;p&gt;At first, I was aghast. Why would gamers reject so violently a new technology? I am not a gamer myself, so it was troubling.&lt;/p&gt;\n\n&lt;p&gt;But I read about it, and I came to this conclusion : gamers are not against to NFTs, they are against microtransactions cash-grabs. And to them, non-fungible tokens are nothing more than another way for studios to make more money. But this will change.&lt;/p&gt;\n\n&lt;p&gt;From what I read, the gaming industry has been plagued by microtransactions for quite some time now. You pay $60 for a game, and yet, you need to fork out more money to buy clothes, armor, weapons, etc., for your character. That pisses off players, and rightly so. So when big studios such as Square Enix or Ubisoft announced plans to offer NFTs, those same gamers are pissed off : they only see this technology as another form of microtransactions.&lt;/p&gt;\n\n&lt;p&gt;(There are also energy consumption concerns, but as most NFTs are build on Ethereum, those concerns will evaporate in six months when it switch to proof-of-stake.)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;That&amp;#39;s why I think that, in the long-term, NFTs will find a way into the gaming industry.&lt;/strong&gt; When/if big studios find ways to make it enticing for players, the revolution will begin. The tech will mature, the fears will fade away, and our ecosystem will benefit from this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 461,
  "permalink": "/r/CryptoCurrency/comments/s64hwj/gamers_arent_against_nfts_theyre_against/",
  "subreddit": "CryptoCurrency",
  "id": "s64hwj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Last year, several gaming studios announced plans to roll-out NFTs on their\nplatforms, and the backlash was swift. Gamers threatened to cancel their Discord\nmembership, Square Enix got criticized for introducing NFTs in Kingdom Hearts,\nUbisoft got panned for a similar NFT program last month...\n\nAt…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨年、いくつかのゲームスタジオがNFTを展開する計画を発表しました。\nそして、その反動は大きかった。ゲーマーはDiscordを解約すると脅し\nキングダムハーツにNFTを導入したスクウェア・エニックスは批判された。\nUbisoftは先月、同様のNFTプログラムで非難を浴びましたが...。\n\nで...",
      "title": "ゲーマーはNFTに反対しているのではありません。マイクロトランザクションの現金回収に反対しているのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "去年，一些游戏工作室宣布了在其平台上推出NFT的计划。\n平台上推出NFT，反响迅速。玩家们威胁说要取消他们的Discord\n会员资格，Square Enix因在《王国之心》中引入NFTs而受到批评。\n育碧上个月因类似的NFT项目而受到批评......\n\n在...",
      "title": "玩家们并不反对NFTs。他们反对的是微交易的现金掠夺。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去年，一些遊戲工作室宣佈了在其平臺上推出NFT的計劃。\n平臺上推出NFT，反響迅速。玩家們威脅說要取消他們的Discord\n會員資格，Square Enix因在《王國之心》中引入NFTs而受到批評。\n育碧上個月因類似的NFT項目而受到批評......\n\n在...",
      "title": "玩家們並不反對NFTs。他們反對的是微交易的現金掠奪。"
    }
  ]
}