{
  "author": "LAiglon144",
  "original_created_utc": 1643454407,
  "title": "Did the opening of the Suez Canal have a large and detrimental impact on the economy of Cape Town, and was there any opposition to the project in Cape Colony at the time?",
  "created_utc": 1643467266,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Cape Town was founded by the Dutch East India Company as a supply station on the route to India and ever since has serviced ships passing around the tip of Africa. The opening of the Suez Canal would&amp;#39;ve surely made traffic past the Cape of Good Hope lessen, I&amp;#39;m curious what this impact was and how the people of Cape Colony viewed it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/AskHistorians/comments/sffy5z/did_the_opening_of_the_suez_canal_have_a_large/",
  "subreddit": "AskHistorians",
  "id": "sffy5z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Cape Town was founded by the Dutch East India Company as a supply station on the\nroute to India and ever since has serviced ships passing around the tip of\nAfrica. The opening of the Suez Canal would've surely made traffic past the Cape\nof Good Hope lessen, I'm curious what this impact was and how…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ケープタウンは、オランダの東インド会社によって、物資の補給基地として設立されました。\nそれ以来、インドへの航路を通る船舶にサービスを提供してきました。\nアフリカ スエズ運河が開通すれば、アフリカの岬を通過する交通量は確実に増えるはずです。\n喜望峰への影響はどのようなもので、どのように軽減されたのでしょうか。",
      "title": "スエズ運河の開通は、ケープタウンの経済に大きな不利益をもたらしたのか、また、当時のケープコロニーでは、このプロジェクトに反対する声はなかったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "开普敦由荷兰东印度公司建立，是通往印度的航线上的一个供应站。\n开普敦由荷兰东印度公司建立，作为通往印度的补给站，并从那时起为绕过非洲顶端的船只提供服务。\n非洲。苏伊士运河的开通肯定会使经过好望角的交通减少。\n我很好奇这种影响是什么，以及如何...",
      "title": "苏伊士运河的开通是否对开普敦的经济产生了巨大的不利影响，当时在开普敦是否有反对该项目的声音？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "開普敦由荷蘭東印度公司建立，是通往印度的航線上的一個供應站。\n開普敦由荷蘭東印度公司建立，作爲通往印度的補給站，並從那時起爲繞過非洲頂端的船隻提供服務。\n非洲。蘇伊士運河的開通肯定會使經過好望角的交通減少。\n我很好奇這種影響是什麼，以及如何...",
      "title": "蘇伊士運河的開通是否對開普敦的經濟產生了巨大的不利影響，當時在開普敦是否有反對該項目的聲音？"
    }
  ]
}