{
  "author": "awdrii",
  "original_created_utc": 1629300950,
  "title": "The Home Owners Association seems universally disliked by everyone I talk to, across generations. Why did it come about and why is it so ubiquitous now?",
  "created_utc": 1629323649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The only information I could find on this outside of home owner management company propaganda was an unsourced website claiming it was a method to keep blacks out of the neighborhood during the rise of redlining. Which sounds plausible but I&#39;d like to get a more thorough understanding!</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/p6tlqd/the_home_owners_association_seems_universally/",
  "subreddit": "AskHistorians",
  "id": "p6tlqd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The only information I could find on this outside of home owner management\ncompany propaganda was an unsourced website claiming it was a method to keep\nblacks out of the neighborhood during the rise of redlining. Which sounds\nplausible but I'd like to get a more thorough understanding!",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このことについて、私が見つけた唯一の情報は、ホームオーナー・マネジメント会社の宣伝文句ではなく\n会社のプロパガンダ以外の情報は、黒人を近所から締め出すための方法だと主張する、ソースのないウェブサイトだけでした。\n根拠のないウェブサイトによると、レッドライニングの勃興期に黒人を近隣から排除するための方法だったそうです。これは\nもっと詳しく知りたいと思います。",
      "title": "ホームオーナーズアソシエーションは、世代を超えて誰からも嫌われているようです。なぜこのようなことが起きたのか、そしてなぜこのようにどこにでもあるものなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在房主管理公司的宣传之外，我唯一能找到的信息是一个没有来源的网站，声称这是一个让房主管理的方法。\n公司的宣传外，唯一能找到的信息是一个没有来源的网站，声称这是在重新划定区域时将黑人拒之门外的一种方法。\n在红线的兴起中，这是一种阻止黑人进入社区的方法。这听起来\n但我希望能得到更全面的了解。",
      "title": "我所接触到的每一个人都不喜欢业主委员会，包括各代人。它为什么会出现，为什么它现在如此普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在房主管理公司的宣傳之外，我唯一能找到的信息是一個沒有來源的網站，聲稱這是一個讓房主管理的方法。\n公司的宣傳外，唯一能找到的信息是一個沒有來源的網站，聲稱這是在重新劃定區域時將黑人拒之門外的一種方法。\n在紅線的興起中，這是一種阻止黑人進入社區的方法。這聽起來\n但我希望能得到更全面的瞭解。",
      "title": "我所接觸到的每一個人都不喜歡業主委員會，包括各代人。它爲什麼會出現，爲什麼它現在如此普遍？"
    }
  ]
}