{
  "author": "skysmoker",
  "the_new_excerpt": "For those who missed the 2017 cycle, there was a similar massive drop in 2016\nand people were having major FUD thinking bear season is upon us. But soon after\nthat not only BTC recovered but it reached ATH and then the bull cycle went on\nfor another year.\n\nThis 40% seems bad but people clearly…",
  "original_created_utc": 1621869569,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2017年のサイクルを見逃した人のために、2016年にも同様の大規模な下落がありました。\n人々はベアシーズンが到来したと考えて大きなFUDを抱えていました。しかし、その後すぐに\nBTCは回復しただけでなく、ATHに到達し、ブルサイクルはさらに1年続きました。\n続いています。\n\nこの40％は悪いことのように見えますが、人々は明らかに...",
      "title": "このようにして、強気のサイクルは、大きなディップをして、戻ってくることで強くなるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些错过2017年周期的人来说，2016年也有类似的大规模下跌\n人们有重大的恐惧感，认为熊季已经来临。但不久之后\n不仅BTC恢复了，而且达到了ATH，然后牛市周期持续了\n又持续了一年。\n\n这40%似乎不好，但人们显然...",
      "title": "这就是一个牛市周期如何变得强大，通过巨大的跌落和回来。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些錯過2017年週期的人來說，2016年也有類似的大規模下跌\n人們有重大的恐懼感，認爲熊季已經來臨。但不久之後\n不僅BTC恢復了，而且達到了ATH，然後牛市週期持續了\n又持續了一年。\n\n這40%似乎不好，但人們顯然...",
      "title": "這就是一個牛市週期如何變得強大，通過巨大的跌落和回來。"
    }
  ],
  "title": "This is how a bull cycle gets strong, by having a huge dip and coming back.",
  "created_utc": 1621885363,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those who missed the 2017 cycle, there was a similar massive drop in 2016 and people were having major FUD thinking bear season is upon us.  But soon after that not only BTC recovered but it reached ATH and then the bull cycle went on for another year. </p>\n\n<p>This 40% seems bad but people clearly aren&#39;t scared, look at the amount of in-flow money in stable coin in exchanges.  </p>\n\n<p>This is precisely how a bull cycle gets strong, upon a dip and it doesn&#39;t faze the investors.  Only makes them that much more greedy after it recovers.</p>\n\n<p>For those who experience this for the first, this is a powerful brain connection they will make that dip is a discount season and not bear season.</p>\n</div><!-- SC_ON -->",
  "score": 773,
  "permalink": "/r/CryptoCurrency/comments/nk0dj1/this_is_how_a_bull_cycle_gets_strong_by_having_a/",
  "subreddit": "CryptoCurrency",
  "id": "nk0dj1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385285
}