{
  "author": "The_Brews_Home",
  "original_created_utc": 1635173940,
  "title": "How did societies that were primarily nomadic mine for ore and smith metal weapons?",
  "created_utc": 1635212642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nomadic societies have cropped up throughout history, and many seemed to have wielded metal weapons. Where did they get these weapons? I could see maybe a simple forge or even a smelter being somehow packed up and moved, but not a whole mine. </p>\n\n<p>Did they have permanent settlements around ore deposits? Did they trade for their weapons, or force conquered people to give them weapons as a form of homage? Or even more likely, am I completely misunderstanding nomadic societies on a fundamental level?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/qfil9k/how_did_societies_that_were_primarily_nomadic/",
  "subreddit": "AskHistorians",
  "id": "qfil9k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nomadic societies have cropped up throughout history, and many seemed to have\nwielded metal weapons. Where did they get these weapons? I could see maybe a\nsimple forge or even a smelter being somehow packed up and moved, but not a\nwhole mine.\n\nDid they have permanent settlements around ore deposits?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史上、遊牧民の社会は数多く存在しており、その多くが\n金属製の武器を使っていたようです。その武器はどこで手に入れたのでしょうか？簡単な鍛冶屋や製錬所なら、なんとか梱包して運ぶことができるかもしれません。\n簡単な鍛冶屋や製錬所なら、なんとか梱包して移動できそうだが、鉱山となるとそうはいかない。\n鉱山ではない。\n\n鉱床の周りに定住地があったのだろうか...。",
      "title": "遊牧を中心とした社会では、どのようにして鉱石を採掘し、金属製の武器を作っていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "游牧社会在历史上层出不穷，许多人似乎都有\n挥舞着金属武器。他们从哪里得到这些武器？我可以看到，也许一个\n简单的锻造厂，甚至是一个冶炼厂，以某种方式被打包和移动，但不是一个\n整个矿场。\n\n他们在矿藏周围有永久性的定居点吗？",
      "title": "主要是游牧民族的社会是如何开采矿石和铸造金属武器的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "遊牧社會在歷史上層出不窮，許多人似乎都有\n揮舞着金屬武器。他們從哪裏得到這些武器？我可以看到，也許一個\n簡單的鍛造廠，甚至是一個冶煉廠，以某種方式被打包和移動，但不是一個\n整個礦場。\n\n他們在礦藏周圍有永久性的定居點嗎？",
      "title": "主要是遊牧民族的社會是如何開採礦石和鑄造金屬武器的？"
    }
  ]
}