{
  "author": "Bashingman",
  "original_created_utc": 1642084787,
  "title": "Could married people not having sex be correlated to the fact middle-aged men do not take care of themselves?",
  "created_utc": 1642094291,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t mean to piss off anyone. Also, I&amp;#39;m a straight dude.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve seen so many married men on Reddit and the Internet in general complaining that their sex lives are dead and their wives don&amp;#39;t want to have sex with them.&lt;/p&gt;\n\n&lt;p&gt;In all honesty, I&amp;#39;ve generally noticed that most middle-aged men make little to no effort to keep themselves attractive or in good shape. Heck, just take a walk through the mall. You&amp;#39;ll notice that most middle-aged men usually have a large pot belly, are dressed badly,  &lt;del&gt;balding&lt;/del&gt;, etc. &lt;/p&gt;\n\n&lt;p&gt;Based on personal experiences and observations, women in general are mostly skinnier and noticeablely in more effort to keep their appearances up. Even as they get older&lt;/p&gt;\n\n&lt;p&gt;It seems highly likely that since most middle-aged married men don&amp;#39;t put in the effort to look attractive, it&amp;#39;s probably the reason why they are not having an active sex life&lt;/p&gt;\n\n&lt;p&gt;Edit: balding is hereditary. You learn something new every day&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 209,
  "permalink": "/r/TooAfraidToAsk/comments/s30xy4/could_married_people_not_having_sex_be_correlated/",
  "subreddit": "TooAfraidToAsk",
  "id": "s30xy4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't mean to piss off anyone. Also, I'm a straight dude.\n\nI've seen so many married men on Reddit and the Internet in general complaining\nthat their sex lives are dead and their wives don't want to have sex with them.\n\nIn all honesty, I've generally noticed that most middle-aged men make little…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かを怒らせるつもりはないんです。あと、俺はノンケなんだけど\n\nRedditやインターネット上で多くの既婚男性が文句を言っているのを見たことがあります。\n性生活が破綻し、妻がセックスをしたがらない、と。\n\n正直なところ、中年男性の多くは、ほとんど...",
      "title": "既婚者がセックスレスなのは、中年男性が自分のことを大切にしていないことと相関があるのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是有意要惹恼任何人。另外，我是一个直男。\n\n我在Reddit和互联网上看到很多已婚男人抱怨\n他们的性生活已经死了，他们的妻子不想和他们做爱。\n\n说实话，我普遍注意到，大多数中年男人都没有做出什么...",
      "title": "已婚者不做爱是否与中年男子不照顾自己有关？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是有意要惹惱任何人。另外，我是一個直男。\n\n我在Reddit和互聯網上看到很多已婚男人抱怨\n他們的性生活已經死了，他們的妻子不想和他們做愛。\n\n說實話，我普遍注意到，大多數中年男人都沒有做出什麼...",
      "title": "已婚者不做愛是否與中年男子不照顧自己有關？"
    }
  ]
}