{
  "author": "roastmyrooster77",
  "the_new_excerpt": "I've been seeing General Electric popping up in the news quite a bit recently.\nThere's some ideas they're playing around with that gives me hope that there\nwill be a steady rise in stock value the way. Here's what I've gathered so far:\n\n 1. First off, right at the beginning of the year, an article…",
  "original_created_utc": 1613230257,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我经常看到通用电气公司出现在新闻中。\n他们的一些想法让我看到了希望。\n将是股票价值稳步上升的方式。这是我目前收集到的信息。\n\n 1. 首先，就在年初的时候，一篇文章...",
      "title": "你们觉得GE的股票怎么样？一直看到一些有希望的消息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我經常看到通用電氣公司出現在新聞中。\n他們的一些想法讓我看到了希望。\n將是股票價值穩步上升的方式。這是我目前收集到的信息。\n\n 1. 首先，就在年初的時候，一篇文章...",
      "title": "你們覺得GE的股票怎麼樣？一直看到一些有希望的消息。"
    }
  ],
  "title": "What do you guys think of GE stock? Been seeing some promising news.",
  "created_utc": 1613260553,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been seeing General Electric popping up in the news quite a bit recently. There&#39;s some ideas they&#39;re playing around with that gives me hope that there will be a steady rise in stock value the way. Here&#39;s what I&#39;ve gathered so far:</p>\n\n<ol>\n<li>First off, right at the beginning of the year, an article came out on the New York Times about the massive wind turbine  Haliade-X  they&#39;ve built in the Netherlands. This monster is the size of two 2 football fields and can power a small city. This is lead model for a series of more turbines in the works to come. Just look at this beast of a <a href=\"https://www.nytimes.com/2021/01/01/business/GE-wind-turbine.html\">windmill</a>.</li>\n<li>On that note, The Motley Fool put out this article yesterday announcing G&amp;E&#39;s plan to set in motion construction of their  <a href=\"https://www.fool.com/investing/2021/02/12/ges-rival-vestas-launches/\">V236-15.0 MW model</a> and they too seem to think it could look like a rise is on the way. Also, I don&#39;t know about you guys, but renewable energy is pretty dang cool to me. </li>\n<li>They have also announced some really exciting news for the automobile industry. Yes, flying cars are about to be real. &quot;The <a href=\"https://www.cnbc.com/2021/01/12/gm-unveils-ev-van-as-part-of-new-commercial-unit-fedex-first-customer.html\">EV600 electric van</a> is scheduled to go on sale later this year through a new commercial business unit of GM’s called BrightDrop. The division is planning a full portfolio of electric products, not just vehicles, <a href=\"https://www.cnbc.com/2021/01/12/gm-shares-hit-record-high-on-electric-van-and-flying-car-potential-plans.html\">including a delivery pallet that was unveiled Tuesda</a>y&quot; (CNBC). Now they look like inflated helicopters and I don&#39;t think it will be a revolutionary model, but it will certainly peak investor&#39;s attention. </li>\n<li>As of me writing this, <a href=\"https://www.nasdaq.com/articles/general-electrics-power-and-renewables-units-are-surging-2021-02-10\">Larry Ramer</a> of <em>InvestoPlace</em> has held a long standing position in G&amp;E. He notes their projects moving forward will be a crucial step to leading our goals to eliminate the use of coal in the U.S. by 2033. I am willing to bet this factor alone will mean a significant rise in G&amp;E&#39;s stock within the upcoming 10 years. </li>\n<li>There&#39;s a decent amount of analysts recommending to <a href=\"https://money.cnn.com/quote/forecast/forecast.html?symb=ge\">buy the stock right now.</a></li>\n<li>Yesterday, they also announced a partnership with Intel to expand the use of renewable energy in Portland. <em>Environmental Energy Leader</em> reports  that &quot;In 2020, PGE and Avangrid Renewables <a href=\"https://portlandgeneral.com/news/2020-02-11-portland-general-electric-and-avangrid-renewables-announce-major\">announced</a> the development of a 162-megawatt solar facility – the largest in Oregon – to meet the needs of <a href=\"https://portlandgeneral.com/news/2019-08-21-sustainability-leaders-claim-pges-green-future-impact-in-record\">17 Green Future Impact subscribers</a>. That project is expected to come online in late 2021.&quot;</li>\n</ol>\n\n<p><strong>Cons</strong></p>\n\n<p>Here&#39;s a quick list of some things that do concern me about the companies outcome:</p>\n\n<ul>\n<li>Portland General Electric has a bit of notoriety when it comes to power outages. </li>\n<li>General Electric <a href=\"https://www.wsj.com/articles/ge-to-cut-aviation-workforce-as-coronavirus-grounds-airliners-11584972724\">had to lay off many employees at the start of COVID-19</a>, a factor that indicates the companies lack of preparation to crisis. Laying off masses of employees is also very bad PR and it seems to have played in important role to the companies drop in price when the pandemic hit. </li>\n<li>There&#39;s also a LOT of outrage about their <a href=\"https://www.wsj.com/articles/ge-to-cut-aviation-workforce-as-coronavirus-grounds-airliners-11584972724\">25% cut of aviation</a> jobs back in May of 2020 for the same reasons explained above.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Overall, I think the good news outweigh the bad ones for G&amp;E. I think it looks really promising especially considering what they have been able to work on during this year. As of now, I only have 2 shares because I am out of a job, but I plan to go back to work soon and do look to buy more when my next paycheck comes in the mail. What are you guys&#39; thoughts? Is there something I&#39;m overlooking about the company or would you agree with me?</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/lj2l3w/what_do_you_guys_think_of_ge_stock_been_seeing/",
  "subreddit": "stocks",
  "id": "lj2l3w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623042
}