{
  "author": "chancletazo_es",
  "original_created_utc": 1634284283,
  "title": "People who bought BTC on their ATH, they are only 6% down.",
  "created_utc": 1634302006,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Investors who unfortunately bought Bitcoin in April, when it was worth around $63k, have gone from about 53% in losses to 6%, which is a relatively low number.</p>\n\n<p>With this I want to emphasize the importance of hodling, and of investing in a project in which you trust, since this factor will play a very important psychological role in not making a panic sold, since currencies with a good foundation usually recover from a crash, as in the case of BTC, ETH or ADA.</p>\n\n<p>It is not at all the first time this has happened, and with Bitcoin, it has managed to resurface from absolutely all its crashes.</p>\n\n<p>Make way for the Bitcoin king, we&#39;ll see new ATHs this Q4, I&#39;m totally sure.</p>\n</div><!-- SC_ON -->",
  "score": 246,
  "permalink": "/r/CryptoCurrency/comments/q8jj9l/people_who_bought_btc_on_their_ath_they_are_only/",
  "subreddit": "CryptoCurrency",
  "id": "q8jj9l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Investors who unfortunately bought Bitcoin in April, when it was worth around\n$63k, have gone from about 53% in losses to 6%, which is a relatively low\nnumber.\n\nWith this I want to emphasize the importance of hodling, and of investing in a\nproject in which you trust, since this factor will play a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "4月にビットコインを不幸にも買ってしまった投資家は、その時の価値が約\n損失は約53％から6％となり、比較的低い数字となっています。\nになりました。\n\n私が強調したいのは、ホドリングの重要性と、信頼できるプロジェクトに投資することです。\nこれは、ホドリングの重要性と、信頼できるプロジェクトに投資することの重要性を強調したい。",
      "title": "ATHでBTCを買った人は、6％しか下がっていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那些不幸在4月份买入比特币的投资者，当时比特币的价值约为\n6.3万美元，已经从大约53%的损失变成6%，这是一个相对较低的\n数字。\n\n我想以此来强调躲避的重要性，并强调投资于一个\n的重要性，因为这个因素将对你的投资产生影响。",
      "title": "在ATH上买入BTC的人，他们只跌了6%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那些不幸在4月份買入比特幣的投資者，當時比特幣的價值約爲\n6.3萬美元，已經從大約53%的損失變成6%，這是一個相對較低的\n數字。\n\n我想以此來強調躲避的重要性，並強調投資於一個\n的重要性，因爲這個因素將對你的投資產生影響。",
      "title": "在ATH上買入BTC的人，他們只跌了6%。"
    }
  ]
}