{
  "author": "dmack080288",
  "original_created_utc": 1638745497,
  "title": "Algorand rally in the recent dip",
  "created_utc": 1638755949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It would seem Algorand is currently bucking the trend and seeing some green in an otherwise red few days.&lt;/p&gt;\n\n&lt;p&gt;With that, it also jumped up to number 18 having held the number 21 spot a week ago. Today alone its overtaken Uniswap and Litecoin.&lt;/p&gt;\n\n&lt;p&gt;It seems to be performing well during this latest crash/dip/correction or whatever you want to call it.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s left me feeling even more bullish on this project and got me thinking those that hold it are keeping a level head, where other investors seem to be losing theirs.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never understood the need or desire to sell when there&amp;#39;s a dip, but looks like the Algonaughts are all on the same page.&lt;/p&gt;\n\n&lt;p&gt;Happy hunting, hope you&amp;#39;ve been enjoying these pre Christmas sales. Interested to know what you&amp;#39;ve been buying these past few days?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 229,
  "permalink": "/r/CryptoCurrency/comments/r9s22k/algorand_rally_in_the_recent_dip/",
  "subreddit": "CryptoCurrency",
  "id": "r9s22k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It would seem Algorand is currently bucking the trend and seeing some green in\nan otherwise red few days.\n\nWith that, it also jumped up to number 18 having held the number 21 spot a week\nago. Today alone its overtaken Uniswap and Litecoin.\n\nIt seems to be performing well during this latest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Algorandは現在、トレンドに逆らって、いくつかのグリーンを見ているようです。\nは、ここ数日赤字が続いています。\n\nまた、1週間前に21位だったのが、18位に急上昇しました。\nを、1年前に発表しています。今日だけで、UniswapとLitecoinを追い越した。\n\nこの間、好調に推移しているようだ...",
      "title": "最近のディップにおけるアルゴランドのラリー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，阿尔戈兰似乎正在逆势而上，在一个本来很糟糕的环境中看到一些绿色。\n在这几天的红色中看到了一些绿色。\n\n因此，它也从一周前的第21位跃升至第18位。\n前。仅在今天，它就超过了Uniswap和Litecoin。\n\n它似乎在最近这段时间表现良好。",
      "title": "阿尔戈兰在最近的跌势中反弹"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，阿爾戈蘭似乎正在逆勢而上，在一個本來很糟糕的環境中看到一些綠色。\n在這幾天的紅色中看到了一些綠色。\n\n因此，它也從一週前的第21位躍升至第18位。\n前。僅在今天，它就超過了Uniswap和Litecoin。\n\n它似乎在最近這段時間表現良好。",
      "title": "阿爾戈蘭在最近的跌勢中反彈"
    }
  ]
}