{
  "author": "MautKeBaadAishHai",
  "the_new_excerpt": "Let me get this out of the way, this is an opinion and analysis piece. It might\nor might not validate the 'to the moon' sentiment. So if you're looking for\nconfirmation bias, just downvote this and move on to the n-th post about 'crypto\nchanged my mum's dogs left testicle'\n\nHere's a few posts from…",
  "original_created_utc": 1620474801,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に断っておきますが、これは意見や分析のための記事です。それは、「月へ」という感情を\n月に向かって」という感情を裏付けるものではないかもしれません。ですから、もしあなたが確証バイアスを探しているなら\n確証バイアスを探しているのであれば、この記事をダウンコートして、「crypto\nママの犬の左の睾丸を変えた」についてのn番目の投稿に移る。\n\nここにはいくつかの投稿があります...",
      "title": "FOMO、マニア、2017年、2021年。今回がそれほど変わらない理由。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我把话说清楚，这是一篇意见和分析文章。它可能\n也可能不会验证 \"登月 \"的情绪。因此，如果你在寻找\n证实偏见，就把这篇文章降权，然后继续看第N篇关于 \"加密货币\n改变了我妈妈的狗的左睾丸' 的帖子。\n\n这里有几个帖子，从...",
      "title": "FOMO, Mania; 2017, 2021. 为什么这次并没有什么不同。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我把話說清楚，這是一篇意見和分析文章。它可能\n也可能不會驗證 \"登月 \"的情緒。因此，如果你在尋找\n證實偏見，就把這篇文章降權，然後繼續看第N篇關於 \"加密貨幣\n改變了我媽媽的狗的左睾丸' 的帖子。\n\n這裏有幾個帖子，從...",
      "title": "FOMO, Mania; 2017, 2021. 爲什麼這次並沒有什麼不同。"
    }
  ],
  "title": "FOMO, Mania; 2017, 2021. Why this time isn't all that different.",
  "created_utc": 1620484921,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me get this out of the way, this is an opinion and analysis piece. It might or might not validate the &#39;to the moon&#39; sentiment. So if you&#39;re looking for confirmation bias, just downvote this and move on to the n-th post about &#39;crypto changed my mum&#39;s dogs left testicle&#39;</p>\n\n<p>Here&#39;s a few posts from the past few days that haven&#39;t made it to hot.</p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/n5uq3h/australians_are_there_any_avenues_where_i_can/\">Australians: are there any avenues where I can take out a loan to buy $20,000-$50,000 of crypto, using the currency purchased as collateral?</a></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/n1snpi/taking_a_loan_to_buy_more_crypto/\">Taking a loan to buy more crypto.</a></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/n3o3b0/im_taking_a_100k_home_equity_loan_and_putting_it/\">I’m taking a 100k home equity loan and putting it in eth</a></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/n50rh4/taking_a_loan_out/\">Taking a loan out</a></p>\n\n<p>Now, here&#39;s a few posts from Nov-Dec 2017</p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/7jodeh/i_got_a_30_thousand_bank_loan_which_coins_should/\">i got a 30 thousand bank loan, which coins should i invest in</a></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/7k596z/borrowed_14k_usd_and_bought_btc/\">Borrowed 14k USD and bought Btc</a></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/7gc27m/thinking_of_getting_a_100k_personal_loan_to_buy/\">Thinking of getting a $100k personal loan to buy cryptos, what cryptos do you suggest?</a></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/7e6mnt/hey_just_wondering_if_anyone_has_had_any_personal/\">Hey Just wondering if anyone has had any personal experience with taking out a loan to invest in crypto&#39;s????</a></p>\n\n<p>Could find many more samples if I went through the comments and dailies. Now, we all know it is an obviously bad idea to take out a loan to invest in crypto. It totally goes against &#39;Never Invest More Than You Can Afford To Lose&#39; which can be seen on the frontpage everyday. The fact that people are still doing it just goes to show how properly in the greed phase we are right now. Everyone and their granddad wants to throw money into crypto, even if it&#39;s money they don&#39;t have. </p>\n\n<p>&nbsp;</p>\n\n<p>But is that the only parallel? Hell no! Here&#39;s some fun pumps from way back when!</p>\n\n<p>IOP: went from $0.7 to $10 in three months. Hit ATH in Jan 2017, and another local peak in Jan 2018. Currently at $0.1</p>\n\n<p>RISE: rose from $0.01 to $1.2 in two months. Hit ATH in Jan 2018 Currently at $0.1</p>\n\n<p>There was literally a coin called FUCKCOIN.</p>\n\n<p>But that&#39;s from 2017, haha we&#39;ve certainly matured by now, haven&#39;t we?<br/>\n<a href=\"/r/cryptomoonshots\">r/cryptomoonshots</a> would beg to differ. In just the last one month, there have been more rugpulls than one can keep track of. This is classic FOMO and greed. Couldn&#39;t make money on ElonMoon, no worries SafeGate will help you recover losses. And dogecoin is most definitely going to $1, and then to $2 and so on.  </p>\n\n<p>&nbsp;</p>\n\n<p>A lot of examples of stupidity. But we&#39;re definitely wiser this time around yeah?  </p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/7h7pz9/if_youre_new_in_the_crypto_space_stop_sharing/\">If you’re new in the crypto space, stop sharing your amount of coins and amount in fiat you have invested. This makes you targets for attacks in the near future if not already</a></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/7ghf9x/just_a_little_psa_about_buying_the_dip_for_new/\">Just a little PSA about buying the dip for new crypto investors</a></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/7ldkuk/psa_to_newcomers_to_crypto_if_you_move_your_coins/\">PSA to newcomers to crypto. If you move your coins to a desktop wallet, also back the wallet up to a USB drive.</a>  </p>\n\n<p>Sounds like good advice, yep it was great advice in peak 2017 too!</p>\n\n<p>And ofcourse, we have PSAs for newcomers this time around too. Everyday! Everyone is a veteran advising the newcomers, which I for one think is very wholesome. :D  </p>\n\n<p>&nbsp;</p>\n\n<p>So that&#39;s a lot of text, but what am I actually trying to say with all this? </p>\n\n<p>For one, this time is not different. Because people are not different, and will behave the same way, everytime. Every single coin is pumping. You could throw money at a logo you really like and within a week 2x your initial investment. Which is scary. Doesn&#39;t matter if it is a decent and secure project, whether it has a future roadmap, whether it even is decentralised. In the next few weeks, I expect to see a lot of weird ass coins in the top 100, and some maybe even in the top 20. The market is very very greedy right now. The smallest news causes huge pumps. People haven&#39;t figured out yet that not everyone can win, and they probably won&#39;t till they&#39;re left bagholding. And that will happen, because these prices and marketcaps are wildly irrational, just like the people currently invested in them.</p>\n\n<p>Which leads to my second point, I think winter is coming. Not right now, obviously, and yeah yeah no one can time the market. But, I think it&#39;ll be sooner than later. I&#39;m considering Sept-Nov 2020 as the start of this bullrun, and I don&#39;t think any bull can run for more than a year without collapsing.  </p>\n\n<p>So, maybe consider this advice, or maybe consider this a FUD-er spreading FUD, or maybe consider it a moon farm by being contradictory (METAMETAMETA). Just some thoughts I had. I&#39;m going to slowly and steadily pull some decent profits out, maybe buy some ramen for the winter, and hoard the rest for when things go south.</p>\n\n<p>Ofcourse, now that I&#39;ve typed it all out it&#39;s much more likely that every single coin will actually rocket and I&#39;ll be left in the lurch! Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 4152,
  "permalink": "/r/CryptoCurrency/comments/n7nn40/fomo_mania_2017_2021_why_this_time_isnt_all_that/",
  "subreddit": "CryptoCurrency",
  "id": "n7nn40",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990895
}