{
  "author": "katiexkittenx",
  "original_created_utc": 1655896326,
  "title": "Is it weird to not hate or be grossed out by getting dick pics?",
  "created_utc": 1655905747,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Idk I always see other girls on reddit and social media say how much they hate getting unsolicited dick pics and hating on men for it. But irl most of my friends don&amp;#39;t hate it (ok I admit I only have 7 friends lol). They either get turned on by it or just find it funny. I&amp;#39;m the same. But it seems we&amp;#39;re in the minority? If you&amp;#39;re a straight girl then why would you be like disgusted by a pic of an erect penis? I assume guys like getting unsolicited nudes so why not girls? Maybe it&amp;#39;s because I&amp;#39;m still 18 so still very horny minded or something, maybe it&amp;#39;s older women or very religious women who complain about it?&lt;/p&gt;\n\n&lt;p&gt;Edit: chill with the &amp;quot;rip inbox&amp;quot; type comments lmao, it&amp;#39;s not that bad. Most of them are asking how many dick pics I got or asking if I intentionally posted this to get dick pics instead of actual dick pics. And if I did get a ton of dick pics...I ain&amp;#39;t got time for that lol&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 202,
  "permalink": "/r/TooAfraidToAsk/comments/vi2qk9/is_it_weird_to_not_hate_or_be_grossed_out_by/",
  "subreddit": "TooAfraidToAsk",
  "id": "vi2qk9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Idk I always see other girls on reddit and social media say how much they hate\ngetting unsolicited dick pics and hating on men for it. But irl most of my\nfriends don't hate it (ok I admit I only have 7 friends lol). They either get\nturned on by it or just find it funny. I'm the same. But it seems…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "RedditやSNSで、他の女の子がどれだけ迷惑なチンコの写真を撮られるのが嫌か、男を憎んでいるか、いつも見ているんだ。\nって言ってるのをよく見るわ。でも、私の友達のほとんどは\n私の友達のほとんどはそれを嫌っていない（私は7人しか友達がいないけど）。彼らは\nをするのか、それともただ面白いと思っているのか。私もそうです。でも、どうやら...",
      "title": "チンコ写真撮られるのが嫌とかキモいと思わないのはおかしいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总是在reddit和社交媒体上看到其他女孩说她们有多讨厌\n得到不请自来的阴茎照片，并因此而憎恨男人。但在现实生活中，我的大多数\n的朋友并不讨厌它（好吧，我承认我只有7个朋友，笑）。他们要么得到\n兴奋，或者只是觉得好笑。我也是如此。但它似乎...",
      "title": "不讨厌或对收到鸡巴照片感到恶心，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是在reddit和社交媒體上看到其他女孩說她們有多討厭\n得到不請自來的陰莖照片，並因此而憎恨男人。但在現實生活中，我的大多數\n的朋友並不討厭它（好吧，我承認我只有7個朋友，笑）。他們要麼得到\n興奮，或者只是覺得好笑。我也是如此。但它似乎...",
      "title": "不討厭或對收到雞巴照片感到噁心，這很奇怪嗎？"
    }
  ]
}