{
  "author": "gulasch_man",
  "the_new_excerpt": "I just read through an \"analysis\" article about the reason of the flash crash\nand sudden rebound and reading it and the comments made my head hurt.\n\nThere were comments, like \"If my speculations are correct, you can buy quite a\nfew bitcoins for a share, so I would just buy GME shares\" and \"there is…",
  "original_created_utc": 1621495486,
  "title": "Was the sub overtaken by WSB or what the hell is happening?",
  "created_utc": 1621542870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just read through an &quot;analysis&quot; article about the reason of the flash crash and sudden rebound and reading it and the comments made my head hurt.</p>\n\n<p>There were comments, like &quot;If my speculations are correct, you can buy quite a few bitcoins for a share, so I would just buy GME shares&quot; and &quot;there is a good chance that a share will worth millions&quot; here in the CryptoCurrency sub? How the hell is this allowed?</p>\n\n<p>And the worst part is that all of these comments had HUNDREDS of upvotes. Anyone who even slightly believes this is not just delusional, they are entirely insane and have absolutely no knowledge about financial fundamentals.</p>\n\n<p>On the other hand, this has nothing to do with crypto. Pointing out that BTC is tied to the USD right now which makes the crypto market almost identical with the stock market is one thing and of course, it&#39;s welcomed to discuss. But seeing GME and AMC shilling posts with 3k upvotes, 30 award on the front page is ridiculous and I just can&#39;t imagine how the hell it is allowed.</p>\n\n<p>I have already been thinking about leaving the sub because it&#39;s in a ridiculous state. Downvoting hordes, moon farming bots and gif spamming threads, but this is just getting insanely ridiculous. I can&#39;t comment or post anything on this sub, because it&#39;s instantly downvoted, doesn&#39;t matter what it is and those bots or users are then going through my profile and starts to downvote other things too, that&#39;s why I have everything hidden. And it&#39;s not just me, but all these complaining is basically deleted from here, so I expect this post to be downvoted or deleted too.  </p>\n\n<p>I&#39;ve made quite a few technical posts a month and two ago about PosT, tokenomics, fundamentals and so on, they were all well researched and technical and none of them got more than 20 upvotes... but they all had &lt;50% upvote rates with 60-70 comments with mostly positive feedback and discussion. This sub is a pathetic moon farming WSB copying hive mind and it has NOTHING to do with crypto anymore.</p>\n\n<p>&#x200B;</p>\n\n<p>Sorry not sorry for the rant. I can&#39;t wait for bear market to all these &quot;people&quot; will disappear here and finally we can discuss tech and market again.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/ngtomm/was_the_sub_overtaken_by_wsb_or_what_the_hell_is/",
  "subreddit": "CryptoCurrency",
  "id": "ngtomm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381653,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フラッシュ・クラッシュの理由についての分析記事を読みました。\nと急反発し、そのコメントも含めて読んでいて頭が痛くなりました。\n\n私の推測が正しければ、かなりの金額を購入することができる」というようなコメントがありました。\n1株で数枚のビットコインが手に入るので、私ならGME株を買うだけ」「ある...",
      "title": "サブはWSBに抜かれたのか、一体どうなっているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚读了一篇关于闪电崩盘的原因的 \"分析 \"文章\n和突然的反弹，读完这篇文章和评论让我头疼。\n\n有一些评论，比如 \"如果我的猜测是正确的，你可以用一股比特币买到相当多的比特币。\n如果我的猜测是正确的，你可以用一股比特币买到相当多的比特币，所以我就会买GME的股票\"，\"有...",
      "title": "子是被WSB超越了，还是发生了什么鬼事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛讀了一篇關於閃電崩盤的原因的 \"分析 \"文章\n和突然的反彈，讀完這篇文章和評論讓我頭疼。\n\n有一些評論，比如 \"如果我的猜測是正確的，你可以用一股比特幣買到相當多的比特幣。\n如果我的猜測是正確的，你可以用一股比特幣買到相當多的比特幣，所以我就會買GME的股票\"，\"有...",
      "title": "子是被WSB超越了，還是發生了什麼鬼事？"
    }
  ]
}