{
  "author": "mybodybutnotmychoice",
  "original_created_utc": 1630587911,
  "title": "I’m a Canadian transplant living in Texas. My husband and I are considering trying to conceive. With the new legislation, what happens if a medical termination is necessary? Does that count as an abortion?",
  "created_utc": 1630608551,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Of course it’s one of the worst case scenarios that any prospective mother could consider, but now I find myself with a very real fear. Do I lose the option to terminate if my life is at risk? What about in cases with severe genetic defect, are you now forced to ride out a pregnancy fully if the baby has no chance of survival because it’s lungs didn’t develop properly?</p>\n\n<p>I’m not cemented in where I stand in those issues but I’m curious now if the choices I would have had before in those situations are now gone legally. I’m not pregnant yet.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/pghhpu/im_a_canadian_transplant_living_in_texas_my/",
  "subreddit": "NoStupidQuestions",
  "id": "pghhpu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Of course it’s one of the worst case scenarios that any prospective mother could\nconsider, but now I find myself with a very real fear. Do I lose the option to\nterminate if my life is at risk? What about in cases with severe genetic defect,\nare you now forced to ride out a pregnancy fully if the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、これからお母さんになる人にとっては、最悪のシナリオの1つです。\nしかし、私は今、とても現実的な恐怖を感じています。私の命が危険にさらされた場合、解約するという選択肢はなくなるのでしょうか？\n私の命が危険にさらされた場合、妊娠を解除する選択肢はなくなるのでしょうか？重度の遺伝子異常がある場合はどうでしょうか。\n重度の遺伝子異常がある場合には、妊娠を完全に乗り切らなければならないのでしょうか？",
      "title": "私はカナダからの移植者で、テキサスに住んでいます。夫と私は妊娠を考えています。新しい法律では、医療行為による中絶が必要な場合はどうなるのでしょうか？それは中絶とみなされるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当然，这是任何一个准妈妈都会考虑的最坏情况之一。\n但现在我发现自己有一种非常真实的恐惧。如果我的生命受到威胁，我是否会失去选择\n如果我的生命处于危险之中，我是否会失去终止妊娠的选择？在有严重基因缺陷的情况下怎么办？\n你现在是否被迫完全度过怀孕期，如果...",
      "title": "我是一个生活在德克萨斯州的加拿大移植者。我的丈夫和我正在考虑尝试怀孕。在新的立法中，如果有必要进行医疗终止，会发生什么情况？这算不算是堕胎？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當然，這是任何一個準媽媽都會考慮的最壞情況之一。\n但現在我發現自己有一種非常真實的恐懼。如果我的生命受到威脅，我是否會失去選擇\n如果我的生命處於危險之中，我是否會失去終止妊娠的選擇？在有嚴重基因缺陷的情況下怎麼辦？\n你現在是否被迫完全度過懷孕期，如果...",
      "title": "我是一個生活在德克薩斯州的加拿大移植者。我的丈夫和我正在考慮嘗試懷孕。在新的立法中，如果有必要進行醫療終止，會發生什麼情況？這算不算是墮胎？"
    }
  ]
}