{
  "author": "partymsl",
  "original_created_utc": 1652386179,
  "title": "This right now is peak crypto-fear. If you are still sticking to Crypto you are truly a holder and you can go through the worst bear markets.",
  "created_utc": 1652395679,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin just made its wickets below 28 and even further down to 25k. Luna is basically going down in a literally straight line and achieved 1$ before even UST. We got over a billion long liquidations. Today the markets just shed $200B alone from the combined market cap. This is not everyday Crypto, this is historical.&lt;/p&gt;\n\n&lt;p&gt;With that it&amp;#39;s highly impressive if you are still sticking around here and possibly even filling your bags with this discount. You are literally surviving one of the biggest bear markets in Crypto history while reading this, you are actually one of the last ones still actively being here. That&amp;#39;s called a holder and not someone who holds during 1000% gains. &lt;/p&gt;\n\n&lt;p&gt;But obviously it&amp;#39;s not bad either if you need to catch some fresh air outside of the markets. Because at the end of the day your health is more important than Crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 485,
  "permalink": "/r/CryptoCurrency/comments/uo9v7w/this_right_now_is_peak_cryptofear_if_you_are/",
  "subreddit": "CryptoCurrency",
  "id": "uo9v7w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin just made its wickets below 28 and even further down to 25k. Luna is\nbasically going down in a literally straight line and achieved 1$ before even\nUST. We got over a billion long liquidations. Today the markets just shed $200B\nalone from the combined market cap. This is not everyday Crypto,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインはウィケットを28以下にし、さらに25kまで下げたところです。ルナは\n基本的に文字通り一直線に下がっていき、USTの前に1ドルを達成しました。\nUSTです。10億枚以上のロングを清算しました。今日、市場は2,000億ドルの損失を出しました。\n今日、市場全体で2億ドルもの資金が流出しました。これは日常的な暗号ではありません...",
      "title": "今まさに、クリプトフィアのピークです。もしあなたがまだCryptoに固執しているならば、あなたは本当にホルダーであり、最悪の弱気相場を通り抜けることができるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币刚刚使其wickets低于28，甚至进一步下降到25K。露娜是\n基本上是直线下降，甚至在UST之前就达到了1美元。\nUST。我们有超过10亿的多头清算。今天，市场仅从总市值中就减少了2000亿美元。\n削减了2000亿美元的总市值。这不是日常的加密货币，...",
      "title": "现在是加密货币恐惧的高峰期。如果你仍然坚持使用加密货币，你就是真正的持有人，你可以经历最糟糕的熊市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣剛剛使其wickets低於28，甚至進一步下降到25K。露娜是\n基本上是直線下降，甚至在UST之前就達到了1美元。\nUST。我們有超過10億的多頭清算。今天，市場僅從總市值中就減少了2000億美元。\n削減了2000億美元的總市值。這不是日常的加密貨幣，...",
      "title": "現在是加密貨幣恐懼的高峯期。如果你仍然堅持使用加密貨幣，你就是真正的持有人，你可以經歷最糟糕的熊市。"
    }
  ]
}