{
  "author": "Bostonterrierpug",
  "the_new_excerpt": "I was speaking with my son while walking our dog the other day and we agreed\nthat most critters seem to be a variation on other critters, be it a long neck\ndeer or a chompy water rat. When asked about seahorse however neither of us\ncould come up with an answer. So what is up with the seahorse how…",
  "original_created_utc": 1618414988,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、犬の散歩中に息子と話をしていて、「ほとんどの生き物は」という意見で一致しました。\nほとんどの生き物は、他の生き物のバリエーションであるように思われます。\n首の長い鹿だったり、お腹の張った水ネズミだったり。しかし、タツノオトシゴについて聞かれると、二人とも答えられませんでした。\n答えられませんでした。では、タツノオトシゴはどうなっているのか...。",
      "title": "タツノオトシゴがどうしたって？自然が生き物を作るときにランダムボタンを押したようだ。どこから進化してきたのか、他の海の生き物とはどんな関係があるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前几天遛狗的时候，我和儿子聊天，我们一致认为\n大多数的小动物似乎都是其他小动物的变种，是长脖子的\n鹿或者说是一只唧唧歪歪的水老鼠。当被问及海马的时候，然而我们都没有。\n可以想出一个答案。那么海马是怎么回事呢？",
      "title": "海马是怎么回事？看来大自然在创造小动物的时候按下了随机按钮。它是从哪里进化而来的 它和其他的海洋小动物有什么关系？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天遛狗的時候，我和兒子聊天，我們一致認爲\n大多數的小動物似乎都是其他小動物的變種，是長脖子的\n鹿或者說是一隻唧唧歪歪的水老鼠。當被問及海馬的時候，然而我們都沒有。\n可以想出一個答案。那麼海馬是怎麼回事呢？",
      "title": "海馬是怎麼回事？看來大自然在創造小動物的時候按下了隨機按鈕。它是從哪裏進化而來的 它和其他的海洋小動物有什麼關係？"
    }
  ],
  "title": "What is up with the seahorse? It looks like nature hit the random button during critter creation. Where did it evolve from? what other sea critters is it related to?",
  "created_utc": 1618423445,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was speaking with my son while walking our dog the other day and we agreed that most critters seem to be a variation on other critters, be it a long neck deer or a chompy water rat. When asked about seahorse however neither of us could come up with an answer. So what is up with the seahorse how did it come be? What other animals can we see that it&#39;s genetically close to?</p>\n</div><!-- SC_ON -->",
  "score": 148,
  "permalink": "/r/askscience/comments/mqt9af/what_is_up_with_the_seahorse_it_looks_like_nature/",
  "subreddit": "askscience",
  "id": "mqt9af",
  "is_self": true,
  "media": null,
  "is_video": false
}