{
  "author": "totalcryptonewbie",
  "the_new_excerpt": "At times like these - it's important to revisit why this all started, and why\nit's still so vital. Bitcoin was born as a reaction to the 2008 financial crisis\n- looking back in brief, remember that:\n\n * Banks and brokers were giving out cheap, subprime mortgage loans to people\n   they knew would be…",
  "original_created_utc": 1624111306,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような時には、なぜこのイベントが始まったのか、そしてなぜ今も重要なのかを再確認することが重要です。\nそして、なぜそれが今でも重要なのかを考えてみましょう。ビットコインは、2008年の金融危機への対応として誕生しました。\n- 振り返ってみると、以下のようなことがありました。\n\n * 銀行や証券会社は、サブプライムローンと呼ばれる低金利の住宅ローンを、将来的に破綻するとわかっている人々に提供していました。\n   銀行や証券会社は、サブプライムローンのような低価格の住宅ローンを...",
      "title": "弱気市場で横ばいの中、2008年を思い出し、なぜ暗号が非常に重要なのかを考えることが重要である"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这样的时刻，有必要重新审视这一切开始的原因，以及为什么它仍然如此重要。\n它仍然是如此重要。比特币的诞生是对2008年金融危机的一种反应\n- 简单回顾一下，请记住。\n\n * 银行和经纪人向人们提供廉价的次级抵押贷款。\n   他们知道会...",
      "title": "虽然在熊市中横行，但重要的是要记住2008年，以及为什么加密货币如此非常重要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這樣的時刻，有必要重新審視這一切開始的原因，以及爲什麼它仍然如此重要。\n它仍然是如此重要。比特幣的誕生是對2008年金融危機的一種反應\n- 簡單回顧一下，請記住。\n\n * 銀行和經紀人向人們提供廉價的次級抵押貸款。\n   他們知道會...",
      "title": "雖然在熊市中橫行，但重要的是要記住2008年，以及爲什麼加密貨幣如此非常重要"
    }
  ],
  "title": "While sideways in a bear market, it's important to remember 2008 and why the heck crypto is so very important",
  "created_utc": 1624131398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At times like these - it&#39;s important to revisit why this all started, and why it&#39;s still so vital. Bitcoin was born as a reaction to the 2008 financial crisis - looking back in brief, remember that:</p>\n\n<ul>\n<li><p>Banks and brokers were giving out cheap, subprime mortgage loans to people they knew would be unable to afford them, fuelling a housing bubble</p></li>\n<li><p>these loans were sold to and then packaged up by Wall Street as financial investments such as mortgage backed securities</p></li>\n<li><p>This became a market in itself, with institutions buying and selling these packaged up securities internationally,.without any real idea of what they were</p></li>\n</ul>\n\n<p>In other words, no transparency</p>\n\n<p>Interest rates rose, housing bubble burst, people were unable to pay back subprime loans, financial crash occured in the US and spread internationally -</p>\n\n<p>Hedge funds went under</p>\n\n<p>Lehman brothers went under</p>\n\n<p>Major banks had to be rescued by their governments</p>\n\n<p>People queued up at banks to withdraw money which wasn&#39;t there</p>\n\n<p>The financial institutions that caused the whole shitshow were bailed out by the government&#39;s and the average person paid the price, through taxes, austerity and so on</p>\n\n<p>Whole countries had to be bailed out </p>\n\n<p>Basically when the time was good - all the profits were privatised and in the hands of the few, yet when the shit hit the fan - all the losses were socialised, and those responsible were enriched even further while the victims were made to suffer more</p>\n\n<p>This is what&#39;s crypto was all about solving</p>\n\n<p>It&#39;s not about just being a speculative asset class, or fcking moonshots and animal meme tokens</p>\n\n<p>It&#39;s about -</p>\n\n<p>Taking out the middle man</p>\n\n<p>Taking control of your own finances</p>\n\n<p>Transparency of transactions taking place</p>\n\n<p>Speed and efficiency of transactions</p>\n\n<p>And a whole load of other good stuff</p>\n\n<p>Whether things crash or rebound, bear market or bull, every so often reflect back on this. Put things in perspective. Look at all the resistance that&#39;s been put in place by the establishment, and look at how now they realise they can&#39;t prevent the coming changes so now want to be involved to control it.</p>\n\n<p>Whatever happens,.if you remember 2008 or read up on it if you are too young to really remember, and you understand what crypto came to solve and improve, you&#39;ll still be here for the next year, and beyond.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/o3gq9d/while_sideways_in_a_bear_market_its_important_to/",
  "subreddit": "CryptoCurrency",
  "id": "o3gq9d",
  "is_self": true,
  "media": null,
  "is_video": false
}