{
  "author": "Awhodothey",
  "original_created_utc": 1642596964,
  "title": "12 reasons Cardano can't scale in 2022",
  "created_utc": 1642611184,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This post is a reality check on IOHK&amp;#39;s latest investor disinformation campaign: &lt;a href=\"https://iohk.io/en/blog/posts/2022/01/14/how-we-re-scaling-cardano-in-2022/\"&gt;https://iohk.io/en/blog/posts/2022/01/14/how-we-re-scaling-cardano-in-2022/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Tldr: It&amp;#39;s great to see they are starting to acknowledge Cardano&amp;#39;s scalability problem, or at least pumping the brakes on their unsubstantiated claims of having solved the trilemma. For the first time, 2021 saw the Cardano community publicly acknowledge some of the limitations of their design that critics have pointed out for years. We&amp;#39;ve come a long way since IOHK was still pretending this was almost ready to go:\n&lt;a href=\"https://nitter.net/iohk_charles/status/1287481374224420864\"&gt;https://nitter.net/iohk_charles/status/1287481374224420864&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1. BLOCK SIZE/ 2. MEMORY/ 3. STORAGE INCREASES&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The bigger the blocks, the higher the memory, and the more storage- the faster the chain. Basically every chain that isn&amp;#39;t already run on super computers can increase blocksizes, memory or storage requirements if they are OK with more centralization and less stability. That&amp;#39;s the trade off. That&amp;#39;s true for Cardano, and it&amp;#39;s true for every other chain. &lt;/p&gt;\n\n&lt;p&gt;But how much room does Cardano have to increase parameters? Cardano already has pretty much the same blocksize as Ethereum (72Kb vs ETH&amp;#39;s average of 80Kb) and dramatic increases in blocksize will decrease the number of people who can afford to run nodes, and it also makes the network more likely to fork. The theoretical max limit is 28x the current blocksize, but that is almost certainly not practically possible, and no one supports increasing it to even half of that (which is about the most that has ever been tested), because increasing the blocksize isn&amp;#39;t free. How critical is it for Cardano to maintain as small of blocksizes as possible? &lt;/p&gt;\n\n&lt;p&gt;Critical enough that the plan is to only increase in 12.5% intervals when absolutely necessary. The fact that anyone is at all hesitant to increase Cardano&amp;#39;s limit when it&amp;#39;s 72kb tells you that this isn&amp;#39;t a free trade. There is no plan to ever reach max parameters. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://np.reddit.com/r/cardano/comments/pf25jk/without_hydra_cardano_probably_wont_be_faster/?utm_medium=android_app&amp;amp;utm_source=share\"&gt;https://np.reddit.com/r/cardano/comments/pf25jk/without_hydra_cardano_probably_wont_be_faster/?utm_medium=android_app&amp;amp;utm_source=share&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;What makes Cardano fundamentally slower than every other chain is how bloated their tx sizes are. We&amp;#39;ve all heard the sales pitch &amp;quot;And Cardano has native tokens that don&amp;#39;t need smart contracts!,&amp;quot; but what you didn&amp;#39;t get told is that native UTXO txs on Cardano are an average of 500 bytes WITHOUT smart contracts. And that a basic, native tx is larger than the average Ethereum tx WITH smart contracts. &lt;/p&gt;\n\n&lt;p&gt;And no, the &amp;quot;And Cardano can combine 20 txs into 1 !&amp;quot; meme doesn&amp;#39;t make any difference. The size and speed of each block is all the same regardless of whether you call it 1 tx or 20tx&amp;#39;s. The only thing combining txs does is make Cardano significantly cheaper to DDOS. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://messari.io/asset/ethereum/metrics/network-activity\"&gt;https://messari.io/asset/ethereum/metrics/network-activity&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Native Cardano UTXOs are bigger than the average Ethereum tx, and Plutus smart contracts txs are even bigger that - a lot bigger- like 40x the size of Ethereum smart contracts:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sundaeswap determined that the Cardano network was their primary bottle neck and measured Cardano&amp;#39;s real-world throughput for their smart contracts to be 0.15 TPS.&lt;/strong&gt; That&amp;#39;s 47x slower than a native UTXO on Cardano, 100x slower than an Ethereum tx, and 66,000x slower than a Cosmos and Terra tx. 0.15 TPS is a max of 12,960 txs per day, under ideal conditions... on the entire Cardano chain. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://sundaeswap-finance.medium.com/expectations-congestion-mainnet-launch-e9da5abfd819\"&gt;https://sundaeswap-finance.medium.com/expectations-congestion-mainnet-launch-e9da5abfd819&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Cardano&amp;#39;s problem is much bigger than anything that can be fixed with a 2x parameter adjustment. Max parameters will never be implemented, and even then, they would still leave Cardano more than 3x slower than the second slowest L1 chain, Ethereum.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4. Pipe Lining and 5. Input Endorsers&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;...are great ideas. So why are these still in the research phase? They&amp;#39;re promising to deliver a plan that hasn&amp;#39;t even been designed yet. Let&amp;#39;s assume these get designed and developed in 2022. Then Cardano is in the ballpark of Ethereum L1&amp;#39;s low tps and high congestion. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;6. Plutus Script Enhancements&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;These are basic functions (that are still in the research phase because of how they conflict with provability in Hydra). Plutus should not even have been released before they developed reference and data inputs. That was an obvious problem, and it was a huge mistake that will create chaos and disappointment.\n &lt;a href=\"https://m.youtube.com/watch?v=3dc6zG9EjWE&amp;amp;t=37m30s\"&gt;https://m.youtube.com/watch?v=3dc6zG9EjWE&amp;amp;t=37m30s&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Cardano will alway have much larger txs than non-UTXO chains because native UTXOs are so large. On top of that, Plutus&amp;#39; smart contract implementation is extremely bloated and inefficient. The problem is that Cardano&amp;#39;s UTXO model can&amp;#39;t store smart contracts on-chain. So instead of calling an on-chain smart contract, every Cardano SC tx must include the SC script in every tx, because there is no on-chain SC that can simply be referenced again and again. This makes every Cardano smart contract very large. &lt;/p&gt;\n\n&lt;p&gt;Cardano currently does native asset txs (without smart contracts) at 7 TPS, and that&amp;#39;s the theoretical minimum SC size, if they figure out how to compress SCs 47x. And that means that Cardano SCs will always be at least twice as slow as Ethereum L1&amp;#39;s unbearably slow 15 TPS, for the same blocksize. &lt;/p&gt;\n\n&lt;p&gt;Now is a good time to point out that it&amp;#39;s clear from their rhetorical focus of comparing their chain to the next slowest chain, that Cardano holders have no idea how slow Ethereum is. Up to this point in time, almost all of Cardano&amp;#39;s txs have been basic UTXO&amp;#39;s that haven&amp;#39;t filled up blocks, because they are a small fraction of the size of smart contracts. &lt;/p&gt;\n\n&lt;p&gt;Four months after going live, no one really uses smart contracts on Cardano yet. Muesliswap doesn&amp;#39;t even have $100 Million in TVL (and doesn&amp;#39;t have $5M in liquidity to other tokens). Small NFT drops did bring the network to a crawl, but we haven&amp;#39;t seen speeds across the whole network change dramatically like they will when Sundaeswap launches a real DEX and much bigger txs flood the chain Thursday. &lt;/p&gt;\n\n&lt;p&gt;And catching up to Ethereum L1 will not be good enough. Ethereum has L2s already, and nobody would use Eth L1 if it went live for the first time today. Ethereum has the first mover advantage of having all the liquidity. Whales don&amp;#39;t care about a $200 fee, they care about liquidity. They need to move in and out of large positions quickly with as little price impact and slippage as possible.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;7. Node Enhancements&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is not a scaling solution. Yes, fix your bugs and optimize your code. No other chain thinks a node update is a &amp;quot;scaling solution.&amp;quot; This is ridiculous. Let me say this again: Cardano is currently 66,000x slower than Cosmos and Terra.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;8. Side-chains&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Great idea. But Cardano doesn&amp;#39;t have any decentralized side-chains, and they didn&amp;#39;t even get serious about funding any until late last summer. Proper sidechains are the real solution. Milkomeda is on the right track with their M1 sidechain. It&amp;#39;s a accounts model Solidity EVM sidechain that has 32 permissioned nodes and uses slashing. Congratulations on abandoning all of your stated goals, and rushing to produce something usable. We waited six years so Catalyst could fund BSC 2.0.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://dcspark.gitbook.io/milkomeda/our-solution-1/the-m-1-sidechain\"&gt;https://dcspark.gitbook.io/milkomeda/our-solution-1/the-m-1-sidechain&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;9. Hydra&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;A comprehensive plan for interhead Hydra implementation that approaches anything close to a generalized L2 has yet to be described, let alone developed. We&amp;#39;re still waiting for a basic description of how isomorphic state channels will ever scale dApps or have any use between untrusted parties. Hydra&amp;#39;s 2022 release schedule is for payment channels between trusted parties. Yes, it will be able to handle smart contracts, but not any smart contracts that dApps use. Hydra heads have to be closed every time a party joins or leaves, and they have no known application for dApps. Hydra is really irrelevant, because native UTXO transfers aren&amp;#39;t the problem right now. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://np.reddit.com/r/cardano/comments/s18wie/should_cardano_be_prepared_to_abandon_hydra/?utm_medium=android_app&amp;amp;utm_source=share\"&gt;https://np.reddit.com/r/cardano/comments/s18wie/should_cardano_be_prepared_to_abandon_hydra/?utm_medium=android_app&amp;amp;utm_source=share&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;10. Off-chain computing&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Brilliant. This is a creative solution. Off-chain trusted computations. &lt;em&gt;Finally something that makes sense.&lt;/em&gt; Yes, Cardano users should definitely do their computations somewhere they trust, off-chain... Muhammad Fucking Christ. Let me suggest they do their computations on one of the 79 other L1 blockchains.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;11. Mithril&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;To achieve greater scalability, you need to address the complexity of critical operations that depend logarithmically on the number of participants.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What? This is straight gibberish. Mithril is obviously not a relevant scaling solution. Mithril is a solution to a problem that many other chains don&amp;#39;t even have. Even Ethereum can run a trustless lite client. Wtf does that have to do with how slow Cardano SCs are? Your inability to figure out a trustless lite client is irrelevant right now. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;12. Fees&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The short term consequence of Sundaeswap&amp;#39;s launch will be a DDOS attack. Txs across the entire Cardano network will take days to process. I predict that Sundaeswap will be forced to throttle their volume, so that the rest of the chain is usable. Best case scenario for EOY 2022, Cardano users can expect Ethereum L1 tx speeds, if everything goes right.&lt;/p&gt;\n\n&lt;p&gt;And Cardano has another problem they still haven&amp;#39;t solved that Ethereum doesn&amp;#39;t have. Slow blockchains require high fees, and Cardano doesn&amp;#39;t have dynamic fees. Price fixing always creates shortages. They need dynamic fees. There&amp;#39;s no way around supply and demand. Everyone has been saying Cardano&amp;#39;s fee model wouldn&amp;#39;t work for years. IOHK is just now taking the question seriously, and their recent moves on fees makes it clear that they have no idea what they are doing. &lt;/p&gt;\n\n&lt;p&gt;People don&amp;#39;t pay fees for fun. The fees are the only thing that make Ethereum usable. You can underpay gas on Ethereum and wait days for the tx to go through if you want, but you can&amp;#39;t manage Defi positions or even use a DEX without cutting in line to get immediate settlement. &lt;/p&gt;\n\n&lt;p&gt;It doesn&amp;#39;t matter that txs have a deterministic order. The Cardano chain can&amp;#39;t compute every tx (off-chain) and magically update price feeds with future prices, before the blocks are written. Even on Ethereum txs frequently fall outside of reasonable slippage in minutes. The slippage required to guarantee a tx over 24 hrs would regularly be a double digit percentage of the trade amount. And high slippage is especially a vulnerability for Cardano because so many dApps feature some risk of trusted party ordering. Low slippage is a protection against that.&lt;/p&gt;\n\n&lt;p&gt;Also, fees are how slow chains keep from getting Ddos attacked (RIP🏴‍☠️ NANO). If less than 13k txs take 24 hours to clear, anyone can completely stop all traffic on the Cardano network for the cost of 13k txs. And they can render it functionally unusable for a fraction of that. The Cardano community has only recently begun to admit that priority fees will be necessary, and their plans for tiered fees are poorly thought out. Search their sub for &amp;quot;fees&amp;quot; and read them blindly trying to reinvent the wheel. This is basic economics, and they have done no real research on it. &lt;/p&gt;\n\n&lt;p&gt;For years we were told that the whole point of Cardano was to avoid launching broken products like this. Cardano&amp;#39;s reputation will never recover from this &amp;quot;Move slow and break things&amp;quot; for a food DEX (that originally chose to launch on BSC). &lt;/p&gt;\n\n&lt;p&gt;ADA was worth more in 2018 than it was worth during its dip last week. What coin do you think ADA holders will have to sell to buy the other half of liquidity pairs to earn rewards on these DEXs? 🤔&lt;/p&gt;\n\n&lt;p&gt;Cardano has not been waiting to release better designed, more secure products. Txs that take days was not part of the 4d chess plan. Look at Sundaeswap&amp;#39;s audit and the Plutus exploit. It&amp;#39;s the same stuff we see on other chains, plus slow txs, plus trusted off-chain elements, plus a roadmap that is critically reliant on problems that are unsolved. &lt;/p&gt;\n\n&lt;p&gt;None of these problems are going away in weeks. The problem with Cardano is the complete lack of honesty from leaders and influencers like Charles Hoskinson, who regularly makes false claims, and a culture of over optimism and anti-critical thinking. Their plan isn&amp;#39;t going well, and their jobs rely on them not admitting it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 426,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/pUYNRcx7YLdIzbx2Z6vbi1PL7A6SmeKIgpkwb3NLbVo.jpg?auto=webp&amp;s=398627e50cd43c08f8b74cf45e7f369344b4edd6",
          "width": 600,
          "height": 400
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/pUYNRcx7YLdIzbx2Z6vbi1PL7A6SmeKIgpkwb3NLbVo.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=a8fc799ada3ee9d401d5bfe6ec409cc9dbe0f768",
            "width": 108,
            "height": 72
          },
          {
            "url": "https://external-preview.redd.it/pUYNRcx7YLdIzbx2Z6vbi1PL7A6SmeKIgpkwb3NLbVo.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=100cf3f8480a725e35d52d6a0a262b4ed41d7972",
            "width": 216,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/pUYNRcx7YLdIzbx2Z6vbi1PL7A6SmeKIgpkwb3NLbVo.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=8dd7a77c65bba9b75ecd0e763a3afab7028b3cd0",
            "width": 320,
            "height": 213
          }
        ],
        "variants": {},
        "id": "RenV45tvrePUkOeLXW4uHL90LQbPmnkoCF7-uJrH4oE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/s7pjy5/12_reasons_cardano_cant_scale_in_2022/",
  "subreddit": "CryptoCurrency",
  "id": "s7pjy5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This post is a reality check on IOHK's latest investor disinformation campaign:\nhttps://iohk.io/en/blog/posts/2022/01/14/how-we-re-scaling-cardano-in-2022/\n\nTldr: It's great to see they are starting to acknowledge Cardano's scalability\nproblem, or at least pumping the brakes on their…"
}