{
  "author": "NyxOfChaos",
  "the_new_excerpt": "I'm quite nervous to be posting this because I feel like I'll be looked down\nupon for even asking such a basic question. I've been on Reddit for a few months\nnow and I just don't understand how awards work. Do you actually pay money\nbecause you like someone's post or comment? If you do, then why?…",
  "original_created_utc": 1615357099,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我很紧张发这个帖子 因为我觉得我会被人看不起\n在甚至问这样一个基本问题。我在Reddit上待了几个月了\n现在，我只是不明白 如何奖励的工作。你真的给钱\n因为你喜欢别人的文章或评论？如果你喜欢，那为什么？",
      "title": "新的Reddit用户来了。奖都怎么用，有什么用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很緊張發這個帖子 因爲我覺得我會被人看不起\n在甚至問這樣一個基本問題。我在Reddit上待了幾個月了\n現在，我只是不明白 如何獎勵的工作。你真的給錢\n因爲你喜歡別人的文章或評論？如果你喜歡，那爲什麼？",
      "title": "新的Reddit用戶來了。獎都怎麼用，有什麼用？"
    }
  ],
  "title": "New Reddit User Here. How do awards even work and what's the point of them?",
  "created_utc": 1615398240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m quite nervous to be posting this because I feel like I&#39;ll be looked down upon for even asking such a basic question. I&#39;ve been on Reddit for a few months now and I just don&#39;t understand how awards work. Do you actually pay <em>money</em> because you like someone&#39;s post or comment? If you do, then why? I&#39;ve found some really clever/funny things people have said, but I don&#39;t know.</p>\n\n<p>I&#39;m basically opening myself up to ridicule here, so I&#39;d appreciate some non-condescending help (although feel free to mock me) because I&#39;m genuinely curious :)</p>\n\n<p>Edit: Thank you for the awards! I find it quite ironic given my question lol</p>\n\n<p>Edit 2: Wow! I didn&#39;t expect this to gain this much attention, thank you so much for the awards!</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/m1r2sn/new_reddit_user_here_how_do_awards_even_work_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "m1r2sn",
  "is_self": true,
  "media": null,
  "is_video": false
}