{
  "author": "pawspk",
  "the_new_excerpt": "I’ve recently turned 18 and have been using paper trade sites on and off since\nmiddle school. I eagerly made an account and wanted to try my first real trade.\nI bought ALF to see how buying works on the platform. A minute later I sold for\n17 cents profit to see how that works. I forgot that taxes…",
  "original_created_utc": 1624110869,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近18歳になりましたが、中学時代から紙のトレードサイトを利用したりしていました。\n中学生の頃から 私は熱心に口座を作り、初めての本格的な取引を試してみたいと思いました。\n私はALFを買って、このプラットフォームでの買い方を確認しました。その1分後、私は17セントの利益で売りました。\n17セントの利益を得ましたが、これがどのように機能するかを確認しました。私は税金のことを忘れていました...。",
      "title": "17セントに税金？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近刚满18岁，从初中开始就一直在断断续续地使用纸质交易网站。\n中学时就开始断断续续地使用纸质交易网站。我急切地开了一个账户，想尝试我的第一次真正的交易。\n我买了ALF，想看看平台上的买入情况。一分钟后，我卖出了\n17美分的利润，看看效果如何。我忘记了税收...",
      "title": "对17美分征税？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近剛滿18歲，從初中開始就一直在斷斷續續地使用紙質交易網站。\n中學時就開始斷斷續續地使用紙質交易網站。我急切地開了一個賬戶，想嘗試我的第一次真正的交易。\n我買了ALF，想看看平臺上的買入情況。一分鐘後，我賣出了\n17美分的利潤，看看效果如何。我忘記了稅收...",
      "title": "對17美分徵稅？"
    }
  ],
  "title": "Tax on 17 cents?",
  "created_utc": 1624133546,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve recently turned 18 and have been using paper trade sites on and off since middle school. I eagerly made an account and wanted to try my first real trade. I bought ALF to see how buying works on the platform. A minute later I sold for 17 cents profit to see how that works. I forgot that taxes exist, will I need to fill out taxes for 17 cents? I don’t know exactly how that works. I looked online and apparently if you make under 40,000$ it’s 0% tax but honestly I don’t know what I was looking at or if that information is accurate. Any information would be helpful, thank you.</p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/stocks/comments/o3gkzd/tax_on_17_cents/",
  "subreddit": "stocks",
  "id": "o3gkzd",
  "is_self": true,
  "media": null,
  "is_video": false
}