{
  "author": "JohnnyLeftNut",
  "original_created_utc": 1638814586,
  "title": "We need to listen to people who do not like crypto.",
  "created_utc": 1638822780,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All of us want mainstream use in the future. For this reason, we need to LISTEN to those who aren’t on board yet, because to achieve mainstream use we are going to need to convert people who aren’t on board yet. &lt;/p&gt;\n\n&lt;p&gt;They have LEGITIMATE concerns, but they are far too often ridiculed, called dinosaurs, etc. &lt;/p&gt;\n\n&lt;p&gt;Because let’s be honest, crypto in it’s current state will never mainstream use, and it’s IMPORTANT to address why. &lt;/p&gt;\n\n&lt;p&gt;The average person would never want to touch an asset where a 20%+ dip is a very real possibility. The price is going to have to become more predictable before your average mom and pop want to buy.&lt;/p&gt;\n\n&lt;p&gt;Many people, especially younger people are RIGHTFULLY concerned about the massive energy used crypto. Harvard business review estimates Bitcoin alone uses .55% of all the world’s energy use, and more than countries like Sweden. Many people are rightfully concerned about the climate, and as long as the energy input required is so high, it will scare off investors. &lt;/p&gt;\n\n&lt;p&gt;I think the last reason many steer clear of crypto are the current headlines that lead to misconceptions. The most that people not in crypto have heard in the last few months are shiba inu and the bored ape nfts. It is our job to educate people that these memes are not our mission nor the things that guide our investments.&lt;/p&gt;\n\n&lt;p&gt;Edit: Forgot to mention gas fees and tether but I’m sure you all get the picture. &lt;/p&gt;\n\n&lt;p&gt;TL;DR there are legitimate and valid reasons why people would not want to invest in crypto. It is our job to listen, educate, and make changes to make crypto better&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/rads5m/we_need_to_listen_to_people_who_do_not_like_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "rads5m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "All of us want mainstream use in the future. For this reason, we need to LISTEN\nto those who aren’t on board yet, because to achieve mainstream use we are going\nto need to convert people who aren’t on board yet.\n\nThey have LEGITIMATE concerns, but they are far too often ridiculed, called\ndinosaurs,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、将来的にメインで使いたいと考えています。このため、私たちは耳を傾ける必要があります\nというのも、主流になるためには、まだ乗っていない人たちの声を聞く必要があるからです。\nまだ乗っていない人たちを改心させる必要があります。\n\n彼らは正当な懸念を抱いていますが、あまりに頻繁に嘲笑され\n恐竜のような...",
      "title": "暗号を好まない人の意見にも耳を傾ける必要があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们所有人都希望在未来的主流使用。出于这个原因，我们需要倾听\n听取那些尚未加入的人的意见，因为要实现主流使用，我们将需要改变那些尚未加入的人。\n因为要实现主流使用，我们需要改变那些还没有加入的人。\n\n他们有合法的担忧，但他们经常被嘲笑，被称为\n恐龙，...",
      "title": "我们需要倾听那些不喜欢加密货币的人的意见。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們所有人都希望在未來的主流使用。出於這個原因，我們需要傾聽\n聽取那些尚未加入的人的意見，因爲要實現主流使用，我們將需要改變那些尚未加入的人。\n因爲要實現主流使用，我們需要改變那些還沒有加入的人。\n\n他們有合法的擔憂，但他們經常被嘲笑，被稱爲\n恐龍，...",
      "title": "我們需要傾聽那些不喜歡加密貨幣的人的意見。"
    }
  ]
}