{
  "author": "xathmos",
  "original_created_utc": 1627350841,
  "title": "Made my first IRL crypto purchase today, and it was in the middle of nowhere",
  "created_utc": 1627371245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a van driver and I was dropping off a new guy. He lives 15 minutes off the main road of an already small town. On my way there I spot a little honey stand with a nice sign with a couple familiar faces on it, a bunch of popular cryptocurrencies! So I drop my guy off and come back, grab my phone, open my ALGO wallet and scan the guy&#39;s code. I was in and out in a minute with what is hopefully, in a few years, the world&#39;s most expensive jar of honey.</p>\n\n<p>Crypto is everywhere!</p>\n</div><!-- SC_ON -->",
  "score": 239,
  "permalink": "/r/CryptoCurrency/comments/osdh0e/made_my_first_irl_crypto_purchase_today_and_it/",
  "subreddit": "CryptoCurrency",
  "id": "osdh0e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a van driver and I was dropping off a new guy. He lives 15 minutes off the\nmain road of an already small town. On my way there I spot a little honey stand\nwith a nice sign with a couple familiar faces on it, a bunch of popular\ncryptocurrencies! So I drop my guy off and come back, grab my phone,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はバンの運転手をしていますが、新しい人を降ろしていました。彼は小さな町の幹線道路から15分ほど離れたところに住んでいます。\n小さな町の幹線道路から15分ほど離れたところに住んでいます。その途中で、小さなハニースタンドを見つけました。\n看板にはお馴染みの顔がいくつか並んでいて、人気のある\n人気のある暗号通貨の数々です。彼を送って戻ってくると、携帯電話を持って...。",
      "title": "今日、初めてIRLで暗号を購入しましたが、それは何もないところでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名面包车司机，我正在送一个新人。他住在一个已经很小的镇子里，离主路15分钟的地方。\n他住在一个已经很小的城镇的主干道上。在我去那里的路上，我发现了一个小蜂蜜店\n有一个漂亮的招牌，上面有几张熟悉的面孔，有一群受欢迎的人\n加密货币! 所以我把我的人送走后回来，拿起我的手机，...",
      "title": "今天我第一次购买了IRL加密货币，而且是在荒郊野外。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名麪包車司機，我正在送一個新人。他住在一個已經很小的鎮子裏，離主路15分鐘的地方。\n他住在一個已經很小的城鎮的主幹道上。在我去那裏的路上，我發現了一個小蜂蜜店\n有一個漂亮的招牌，上面有幾張熟悉的面孔，有一羣受歡迎的人\n加密貨幣! 所以我把我的人送走後回來，拿起我的手機，...",
      "title": "今天我第一次購買了IRL加密貨幣，而且是在荒郊野外。"
    }
  ]
}