{
  "author": "A78V",
  "original_created_utc": 1644595432,
  "title": "Soon mining on GPU:s will be over! Intel is releasing a blockchain accelerator that will be x1000 faster than GPU:s! Gamechanging tech for crypto!",
  "created_utc": 1644630525,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Digital computing continues to enrich our lives in more ways than we  can imagine. We acquire, consume, and create content and services with a  few clicks or taps of our fingertips. Exponential increases in compute  performance, enabled by Moore’s Law, play a significant role in making  these experiences seamless. Moore’s Law is also enabling us to  democratize access to this enormous pool of processing power. Amazing  things happen when a lot of compute is available to a lot of people  without much friction.&lt;/p&gt;\n\n&lt;p&gt;We are looking forward to the next set of amazing things.&lt;/p&gt;\n\n&lt;p&gt;Blockchain  is a technology that has the potential to enable everyone to own much  of the digital content and services they create. Some even call it an  inflection point in computing, fundamentally disrupting the way we  store, process and transact our digital assets as we usher in the era of  metaverse and Web 3.0. No matter how the future evolves, it is certain  the availability of a lot more compute to everyone will play a central  role.&lt;/p&gt;\n\n&lt;p&gt;Today, we at Intel are declaring our intent to contribute to  the development of blockchain technologies, with a roadmap of  energy-efficient accelerators. Intel will engage and promote an open and  secure blockchain ecosystem and will help advance this technology in a  responsible and sustainable way.&lt;/p&gt;\n\n&lt;p&gt;We are mindful that some  blockchains require an enormous amount of computing power, which  unfortunately translates to an immense amount of energy. Our customers  are asking for scalable and sustainable solutions, which is why we are  focusing our efforts on realizing the full potential of blockchain by  developing the most energy-efficient computing technologies at scale.&lt;/p&gt;\n\n&lt;p&gt;Our  blockchain accelerator will ship later this year. We are engaged  directly with customers that share our sustainability goals. Argo  Blockchain, BLOCK (formerly known as Square) and GRIID Infrastructure  are among our first customers for this upcoming product. This  architecture is implemented on a tiny piece of silicon so that it has  minimal impact to the supply of current products.&lt;/p&gt;\n\n&lt;p&gt;Intel Labs has  dedicated decades of research into reliable cryptography, hashing  techniques and ultra-low voltage circuits. We expect that our circuit  innovations will deliver a blockchain accelerator that has over 1000x  better performance per watt than mainstream GPUs for SHA-256 based  mining. You will be able to learn more about our circuit innovations at  the International Solid State Circuit Conference (ISSCC) this month.&lt;/p&gt;\n\n&lt;p&gt;To  support this, and additional emerging technology, we have formed the  new Custom Compute Group within Intel’s Accelerated Computing Systems  and Graphics business unit. The objective of this team is to build  custom silicon platforms optimized for customers’ workloads, including  blockchain and other custom accelerated supercomputing opportunities at  the edge.&lt;/p&gt;\n\n&lt;p&gt;Onward, we aspire to leverage technologies from our  zetta-scale computing initiative to deliver energy-efficient solutions  that make our tomorrow better than our today.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;By Raja M. Koduri&lt;/em&gt;&lt;br/&gt;\n &lt;em&gt;Senior vice president and general manager of the Accelerated Computing Systems and Graphics Group at Intel Corporation.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://videocardz.com/press-release/intel-announces-energy-efficient-blockchain-accelerators-and-new-custom-compute-group\"&gt;Link to VideoCardz article.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 359,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/hh1arBW85bGOlHzgcDumTTw5v1ekKtC00-kgebi4UeI.jpg?auto=webp&amp;s=d943b61c5ea785fed0ae5ae7c5f4c2d908fdd3ae",
          "width": 1920,
          "height": 1080
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/hh1arBW85bGOlHzgcDumTTw5v1ekKtC00-kgebi4UeI.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=549d7c53c95a22fe7e2e3e28bcdcfe2c9c8957bf",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/hh1arBW85bGOlHzgcDumTTw5v1ekKtC00-kgebi4UeI.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=7f0fdec35b7d12287b8a7f142a6abf3227719c2b",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/hh1arBW85bGOlHzgcDumTTw5v1ekKtC00-kgebi4UeI.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=a92136f394ebd32fe2c0d3b5df38118bda250041",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/hh1arBW85bGOlHzgcDumTTw5v1ekKtC00-kgebi4UeI.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=b4968e9a6155d7a20a761a99dce6862c7cf16370",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/hh1arBW85bGOlHzgcDumTTw5v1ekKtC00-kgebi4UeI.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=240f96c0abbd113af6b7207a8836108a865be761",
            "width": 960,
            "height": 540
          },
          {
            "url": "https://external-preview.redd.it/hh1arBW85bGOlHzgcDumTTw5v1ekKtC00-kgebi4UeI.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=2e56b4e00a9389bcfb6aba779f497032b5e801d4",
            "width": 1080,
            "height": 607
          }
        ],
        "variants": {},
        "id": "wGRxCRSBmlWjZhHZz7doupbcYffQ0BAgWyPR_JpRBKc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/sq2srq/soon_mining_on_gpus_will_be_over_intel_is/",
  "subreddit": "CryptoCurrency",
  "id": "sq2srq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Digital computing continues to enrich our lives in more ways than we can\nimagine. We acquire, consume, and create content and services with a few clicks\nor taps of our fingertips. Exponential increases in compute performance, enabled\nby Moore’s Law, play a significant role in making these…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "デジタルコンピューティングは、私たちの生活をより豊かにするために、さまざまな形で活用され続けています。\nを想像してください。私たちは、数回のクリックで、コンテンツやサービスを入手し、消費し、創造しています。\n指先のタップで コンピュート性能の指数関数的な向上が可能にしたもので\nムーアの法則に基づき、これらの実現に大きな役割を果たしています。",
      "title": "もうすぐGPU:sでのマイニングは終わる! インテルがGPUより1000倍高速なブロックチェーンアクセラレーターを発表! 暗号を変える技術!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "数字计算继续以超出我们想象的方式丰富着我们的生活。\n丰富我们的生活。我们获取、消费和创造内容和服务，只需点击几下\n或轻触指尖，我们就能获得、消费和创造内容和服务。在摩尔定律的推动下，计算性能呈指数级增长。\n摩尔定律所促成的计算性能的指数级增长，在使这些产品和服务成为现实的过程中发挥了重要作用。",
      "title": "用GPU挖矿很快就会结束! 英特尔正在发布一款区块链加速器，其速度将比GPU：s快1000倍! 改变加密货币游戏规则的技术!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "數字計算繼續以超出我們想象的方式豐富着我們的生活。\n豐富我們的生活。我們獲取、消費和創造內容和服務，只需點擊幾下\n或輕觸指尖，我們就能獲得、消費和創造內容和服務。在摩爾定律的推動下，計算性能呈指數級增長。\n摩爾定律所促成的計算性能的指數級增長，在使這些產品和服務成爲現實的過程中發揮了重要作用。",
      "title": "用GPU挖礦很快就會結束! 英特爾正在發佈一款區塊鏈加速器，其速度將比GPU：s快1000倍! 改變加密貨幣遊戲規則的技術!"
    }
  ]
}