{
  "author": "Funny_Plant6433",
  "original_created_utc": 1649866000,
  "title": "When do you drop a bombshell on a potential partner?",
  "created_utc": 1649922227,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What would you do if you had something you generally don’t talk about to others but would be essential for your partner to know? It doesn’t define you, but it will affect the relationship one way or another. &lt;em&gt;Things like infertility, lifelong STD, life threatening disease, victim of SA, panic attacks, etc.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;When do you let someone in? How do you keep it fair to the other person? And how do you keep your secret safe (if you’ve chosen to keep it a secret)?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskWomen/comments/u2trvi/when_do_you_drop_a_bombshell_on_a_potential/",
  "subreddit": "AskWomen",
  "id": "u2trvi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What would you do if you had something you generally don’t talk about to others\nbut would be essential for your partner to know? It doesn’t define you, but it\nwill affect the relationship one way or another. Things like infertility,\nlifelong STD, life threatening disease, victim of SA, panic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一般的に人に話さないようなことがあったら、どうする？\nしかし、あなたのパートナーにとっては、知ることが不可欠です。それはあなたを定義するものではありませんが、それは\nは、いずれにせよ関係に影響を与えるでしょう。不妊症のようなもの。\n生涯性病、命にかかわる病気、SAの被害者、パニック...。",
      "title": "あなたはどのようなときに、潜在的なパートナーに爆弾を投下するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你有一般不对别人说的事情，你会怎么做？\n但又必须让你的伴侣知道？它并不决定你，但它\n会以这种或那种方式影响关系。像不孕不育这样的事情。\n终身性病，有生命危险的疾病，SA的受害者，恐慌......",
      "title": "你什么时候向潜在的合作伙伴扔出一个重磅炸弹？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你有一般不對別人說的事情，你會怎麼做？\n但又必須讓你的伴侶知道？它並不決定你，但它\n會以這種或那種方式影響關係。像不孕不育這樣的事情。\n終身性病，有生命危險的疾病，SA的受害者，恐慌......",
      "title": "你什麼時候向潛在的合作伙伴扔出一個重磅炸彈？"
    }
  ]
}