{
  "author": "Captainwelfare2",
  "original_created_utc": 1628018669,
  "title": "Stop whatever you are doing and review the following! You may thank me later!",
  "created_utc": 1628080883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>So the last 24 hours was awful.  And it’s shocking to learn someone who follows processes as much as I do lost his Reddit account, and almost lost his vault.</h1>\n\n<p>Hey all, this is your captain speaking.  So yesterday was the first time in 6 months my phone booted me out of Reddit.  Was completely random, and having not really thought about it since my account’s inception, I was disturbed to find out none of my standard passwords (or their variations for that matter) worked.   No big deal, I’ll have them email me a password reset!</p>\n\n<p>… and I sent a request to my email.  Nothing.  Nada.</p>\n\n<p>…okay but hey I’ve GOTTA be able to retrieve my account by phone number or something right?</p>\n\n<p>Narrator: “He would in fact, not be right.”</p>\n\n<p>Apparently, when you set up your phone account via Reddit, they don’t require an email or anything.  Apparently, I had to back it up in the settings, and I just had glossed over that.  Probably because I came to Reddit to learn about the GME blow up, and actually found out about <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> like a month later.  And opened my vault a month after that.  After two months of auto signing in, you don’t even think about things like backup.</p>\n\n<h1>FUCK.  What about my 10k moons?!</h1>\n\n<p>Thank GOODNESS I had written my seed phrase down.  I’ll just have Reddit team verify the seed phrase is linked to my account and…</p>\n\n<p>Noopppppee.  Right.  It doesn’t work that way.</p>\n\n<p>Several hours of attempted work around later and I find out that I can in fact send the moon from my old vault to this new (AND BACKED UP!!) account’s vault.  All I need to do is download meta mask and set it up for the Ethereum Testnet and create the wallet for a specialized token and… oh… oh you have to delete and reinstall metamask and…</p>\n\n<h1>Does this sound -awful- to you yet?</h1>\n\n<p>Needless to say, I’m creating a hard set of passwords and testing all of them for all my accounts, along with resetting my email passwords and backing them up via 2fa too.</p>\n\n<p>Sometimes crypto can be really fucking stomach churning.  Special shout outs to <a href=\"/u/Nanooverbtc\">u/Nanooverbtc</a> (yes, the mods absolutely deserve their moons) and the two guys who helped me figure this crap out yesterday.  There are some -heroes- on this sub.</p>\n\n<p>Some things still suck.  I lost my Reddit coins, as well as a free 3 month (I think) premium upgrade, and I posted -a lot- this round.   So yes fellow mooners, probably a good 3k more moons lost to a dead vault.  But hey, that’s crypto right?\nTL:DR</p>\n\n<p>-Back your crap up</p>\n\n<p>-Back up your backups</p>\n\n<p>-Never assume anything tied to your coins</p>\n\n<p>-Elon still sucks</p>\n\n<p>-Safemoon is still a Ponzi.</p>\n\n<p>-Fuck Robin Hood with a pointy steel-toed boot covered in Dire Ants</p>\n\n<p>EDIT: THANK YOU FOR ALL THE AWARDS AND KARMA! YOU ALL THE REAL MOON MVPS!</p>\n</div><!-- SC_ON -->",
  "score": 565,
  "permalink": "/r/CryptoCurrency/comments/oxatno/stop_whatever_you_are_doing_and_review_the/",
  "subreddit": "CryptoCurrency",
  "id": "oxatno",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "SO THE LAST 24 HOURS WAS AWFUL. AND IT’S SHOCKING TO LEARN SOMEONE WHO FOLLOWS\nPROCESSES AS MUCH AS I DO LOST HIS REDDIT ACCOUNT, AND ALMOST LOST HIS VAULT.\n\nHey all, this is your captain speaking. So yesterday was the first time in 6\nmonths my phone booted me out of Reddit. Was completely random,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ということで、この24時間はひどいものでした。私と同じようにプロセスを追っている人が、redditのアカウントを失い、金庫を失いかけていることを知ってショックを受けています。\nプロセスを追いかけている人がredditのアカウントを失い、金庫も失いそうになったのはショックでした。\n\nやあ、みんな、これは君たちのキャプテンだ。昨日は6ヶ月ぶりに\n昨日は6ヶ月ぶりに携帯がRedditから起動したんだ 完全にランダムで、...",
      "title": "何をしていようと、手を止めて次のことを確認してください。後で私に感謝するかもしれませんよ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，过去的24小时是可怕的。得知一个像我一样关注流程的人失去了他的REDIT账户，这让我感到震惊。\n进程的人失去了他的Reddit账户，并且几乎失去了他的金库。\n\n大家好，我是你们的队长。昨天是6个月以来的第一次\n我的手机把我从Reddit上启动了。这是完全随机的，...",
      "title": "停止你正在做的任何事情，回顾以下内容! 你以后可能会感谢我!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，過去的24小時是可怕的。得知一個像我一樣關注流程的人失去了他的REDIT賬戶，這讓我感到震驚。\n進程的人失去了他的Reddit賬戶，並且幾乎失去了他的金庫。\n\n大家好，我是你們的隊長。昨天是6個月以來的第一次\n我的手機把我從Reddit上啓動了。這是完全隨機的，...",
      "title": "停止你正在做的任何事情，回顧以下內容! 你以後可能會感謝我!"
    }
  ]
}