{
  "author": "gingeropolous",
  "the_new_excerpt": "Warning, 10 minute read. No tldr. Use your brain.\n\nI originally wrote this and posted it on https://moneroworld.com/whymonero.html\n, but obviously no one reads that.\n\nso, thought I would put it out here.\n\n\nWHY MONERO?\n\nYou may be coming across this article as someone new to cryptocurrencies…",
  "original_created_utc": 1618933000,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "警告、10分で読めます。tldrはありません。頭を使いましょう。\n\n私はもともとこれを書いて https://moneroworld.com/whymonero.html に投稿しました。\nに投稿しましたが、明らかに誰も読んでいませんでした。\n\nしかし、明らかに誰もそのサイトを読んでいないので、ここに掲載することにしました。\n\n\nなぜMONEROなのか？\n\nこの記事は、暗号通貨の初心者の方がご覧になるかもしれません...",
      "title": "なぜモネロなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "警告，10分钟阅读。没有tldr。使用你的大脑。\n\n我最初写了这个，并把它贴在https://moneroworld.com/whymonero.html\n，但显然没有人看。\n\n所以，我想我应该把它放在这里。\n\n\n为什么是MONERO？\n\n你可能是作为一个刚接触加密货币的人看到这篇文章的...",
      "title": "为什么是monero？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "警告，10分鐘閱讀。沒有tldr。使用你的大腦。\n\n我最初寫了這個，並把它貼在https://moneroworld.com/whymonero.html\n，但顯然沒有人看。\n\n所以，我想我應該把它放在這裏。\n\n\n爲什麼是MONERO？\n\n你可能是作爲一個剛接觸加密貨幣的人看到這篇文章的...",
      "title": "爲什麼是monero？"
    }
  ],
  "title": "Why monero?",
  "created_utc": 1618947430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Warning, 10 minute read. No tldr. Use your brain.</p>\n\n<p>I originally wrote this and posted it on <a href=\"https://moneroworld.com/whymonero.html\">https://moneroworld.com/whymonero.html</a> , but obviously no one reads that. </p>\n\n<p>so, thought I would put it out here. </p>\n\n<h1>Why monero?</h1>\n\n<p>You may be coming across this article as someone new to cryptocurrencies because of some recent bull run in bitcoin, and you are one of those folks that think you&#39;ve missed the bitcoin wave so you want to try and find another coin that might also rocket to the moon. Or, you&#39;ve been following Monero for a long time but have never got in for whatever reason, and getting in can mean either buying a nice bag or getting the software and actually using it. Or, you&#39;ve researched Bitcoin and see the flaws that exist and you&#39;re wondering what project has actively addressed these flaws.</p>\n\n<p>I know I shouldn&#39;t write a piece that tries to shill Monero to you, but why not? I think Monero is the best thing out there, and I almost feel it a disservice that our community can&#39;t communicate the awesomeness of Monero effectively, and people end up &quot;investing&quot; in other altcoins because those coins have louder voices. So, I will add my voice to the noise.</p>\n\n<p>First and foremost, I should probably expound the larger issue at hand - the global schema of my thoughts - my interpretation of our human experience. I believe that humanity is destined for greatness, and that our consciousness provides us faculty that is unprecedented in the web of life. The life force, be whatever it may, has granted us these abilities so that we can Do Our Part in the great expansion of life. Humanity is steward of life as we know it; thus we have the ability to write the story of how this strange notion of life grows throughout the cosmos. Now I don&#39;t know where I&#39;ve gotten this notion - probably some strange whispering manifestation of Mother Culture. If you think we are just meatpuppets put here to eat, shit, and reproduce... well, i guess monero might give you the chance to do more of that in a more fancy way if monero moons to the lambo world. But me, personally... I think cryptocurrency is revolutionary and will change the course of humanity.</p>\n\n<p>Before diving into &quot;why Monero&quot;, I should probably first dive into &quot;why cryptocurrency&quot;. First, one has to have an appreciation of the existing monetary and financial system. The quote you often see thrown around sums it up quite well: “It was Henry Ford who said in substance this: ‘It is perhaps well enough that the people of the nation do not know or understand our banking and monetary system, for if they did I believe there would be a revolution before tomorrow morning”. Now it should be noted that I don&#39;t consider myself a wild laissez faire kind of guy - I think there is a place for laws, rules, regulation, etc. You shouldn&#39;t be allowed to put toxins in the water supply, and you shouldn&#39;t be able to just rob somebody blind because an opportunity presents itself. I personally think that the common person is good, and when in favorable circumstances the common person will promulgate that good. Thus, it behooves the systems in which we live to foster these favorable circumstances, and this fostering is an act that can, and is, achieved. In fact, it could be said that the laws of our society best serve the individual when they are performing this fostering.</p>\n\n<p>And before getting to Monero, we should also explore my conceptualization of value. Here, I use value as that which has worth. And this worth I refer to is the personal worth of time. &quot;Is this worth my time&quot;. The phrase &quot;time is money&quot; comes to mind, and even though it is a now banal colloquialism that we utter mindlessly, it is a very powerful phrase. Time is a unique concept perhaps known only to man. Indeed, we have no idea how it works. Despite this elusive nature of time, our entire consciousness is predicate on the flow of time. Our narrative about who we are, as an individual or as a society or as a civilization, is firmly planted in the wake of times arrow, and its hopes and dreams in the arrow&#39;s path ahead. Thus, it is quite remarkable that we have invented the ability to &quot;store time&quot; in the form of money. Because, indeed, the most valuable thing we have is our time in this universe, and we have found a way to make time &quot;timeless&quot; by storing it in value transfer and storage instruments. If you want to spend less time on something, you can spend more money to get it done. If you want to obtain money, you have to spend time. If you manage to rid yourself of the need of money, you own more of your time. So things that have value are things into which we invest time. From that investment of time, we either see an immediate consequence in the form of satisfaction (or any other element of the human experience) or we see a time-deferred consequence in the form of money acquisition to be spent on future elements of the human experience.</p>\n\n<p>To me, it boils down to the fact that the extant monetary systems and policies of the world have created a system where value has been misplaced, and therefore, value has become perverted and the world has become valueless. This can be seen in how the United States of America, for instance, values human health. The very basic notion of tending to human physiology has been monetized and packaged as a commercial product, and for many this is a product that is unaffordable. The basic needs of child development have been made dependent on financial status. The natural world in which we live has been shaped by these perverted values - our environment is endlessly exploited and marching towards collapse. The things which should hold the most value - life, and that which fosters life - do not have value. Ironically, it seems the thing that holds the most value is the ability to identify value (I&#39;m looking at you Wall Street). It&#39;s easy to see how this orabourus ring of value will just put us in a downward spiral.</p>\n\n<p>So how can cryptocurrencies fix this? Firstly, I don&#39;t know if they can - but I do know that they are different and can change the course of things. It is possible their fundamental properties could modify our values towards the good, though I guess it is possible they could modify our values towards the bad. I have a notion, though, that it is the former - towards the good. I get this feeling due to the fact that a cryptocurrency - a GOOD cryptocurrency - is one that is trustless and permissionless. These properties allow the cryptocurrency itself to function as the authority, so that the Human Hand can not interfere with the progression of things. The extant systems are centralized - controlled by a powerful few who are forced to make decisions and modify parameters on the fly to achieve some target state. I can&#39;t quite put my finger on why centralized monetary systems fail, but it mostly has to do with the fact that decisions have to be made, and humans can make bad decisions. In the existing system, this creates odd feedback loops that ultimately end up destroying your 401k and erode the value of the US dollar over decades timespans, for instance. Honestly, inflation to this degree has never made sense to me. The fact that time erodes value implies that the past has less value than the present. If you can fathom nonlinear time, or embrace the possibility that time doesn&#39;t exist, you can see that this construct of eroding value just ... doesn&#39;t make sense. Thus, I ponder why this exists. Based on the current wealth disparities of our current world, I think there&#39;s an obvious reason why it exists - to work for those in power, and to keep others from gaining this power.</p>\n\n<p>Furthermore, these systems are dynamic - they change. The terms quantitative easing and prime lending rate come to mind as examples of these dynamic parameters. Granted, the ability to adapt to a changing environment is generally a good thing. However, when this change is centralized, this dynamic nature becomes less and less favorable as the changes implemented depend on the notions of this centralized entity.</p>\n\n<p>So the case must be made why the existing system is a failure and why it has failed. I would argue the existing system has failed because it has created significant gaps in a human&#39;s ability to thrive in the system based on both the socio-economic status they are born into as well as their geographic location. The Horatio Alger stories have <em>always</em> been a myth, and these days they are moreso. Granted, there are still flukes, but the exceptions really only draw attention to design of the existing state - that the state is <em>so bad</em> that those that have the ability to rise above and find their way out are exceptional and superheroes. This is ridiculous. Literally - should be ridiculed. &quot;The pursuit of happiness&quot; becomes a luck of the draw, either that you are born into money or you have the rare ability to not need that much of it in a world built on it - e.g., you are born with no illnesses and have the mental faculty to liberate your thoughts from the pursuit of money.</p>\n\n<p>Why the existing system has failed is unknown to me. I have notions, but the exact technical reasons are not within the scope of this rambling. Overall, I think the term failure may be too strong - the system is <em>not</em> a failure for some. But overall, I think the existing system has failed because it has just run its course. The existing system was not given to us as a corporeal manifestation of some archetype of monetary systems. It exists like all things today exist - because some group of someones thought it up and made it happen. It was designed, it is an experiment. So &quot;why it failed&quot; can simply be waved away with the notion that we never knew whether it would work. So, when you start with the question of &quot;does it work&quot;, and the answer is &quot;no&quot;, then it didn&#39;t fail.</p>\n\n<p>Of course, the same can be said of cryptocurrency. Does it work? Well, that&#39;s what were doing. Figuring it out.</p>\n\n<p>Perhaps one notion thats important to exclaim is that I think we will see both the new cryptocurrency system and the old system live alongside each other for a long time. The two are not mutually exclusive - indeed, cryptocurrency can bring to the extant system a novel type of input / modifier / parameter that it didn&#39;t have before, and perhaps this new element is a piece of the overall puzzle that has been missing.</p>\n\n<p>So now that I&#39;ve rambled enough about why cryptocurrencies are revolutionary and not just a new paypal or visa or investment vehicle, lets get into Why Monero.</p>\n\n<p>First off, this is just my opinion. I&#39;m just a dude. I got into Monero years ago because I studied Bitcoin and identified parts about it that I didn&#39;t like. Namely, the proof of work (PoW). The proof of work in a cryptocurrency is one of the most important aspects of the entire system. Its what allows the consensus mechanism to remain trustless, permissionless, and decentralized. Its what allows the ledger of transactions to grow in an uncensored way without anyones approval. In bitcoin, this proof of work is now performed by Application Specific Integrated Circuit (ASIC) machines, which are special computers purpose-built just for bitcoin mining. There are a small handful of companies that make these machines, and they have very few incentives to sell the hardware directly to consumers - most have incentives to use the hardware themselves to mine for profit, and then sell the hardware to consumers. In addition, these computers are expensive, loud, difficult to source, and difficult to use. In an ideal world, anyone can contribute to the mining network of a cryptocurrency, because - again - this mechanism is how the network remains decentralized, and the entire value of these new currencies comes from their decentralization. You should be able to contribute to the mining network in a meaningful way.</p>\n\n<p>Instead, what has happened in bitcoin is the economies of scale have made the mining infrastructure heavily centralized. Large mining farms are built containing thousands of these ASICs, managed by an individual or company, and located in parts of the world favorable for mining (climate and cheap power). Furthermore, the dominance of ASICs means that you can only contribute to the mining network in a meaningful way if you have an ASIC. You can not buy an ASIC at your local computer store. I doubt you can import them in some parts of the world. So here, a barrier to participation has been erected, and this is a centralizing force.</p>\n\n<p>Why is decentralization important? This whole cryptocurrency thing is <em>completely</em> dependent on decentralization - no one can shut this down, and no single entity can do significant damage to the network. The centralizing factors created by ASIC mining are multifaceted, but mainly center on the fact that it an ASIC is physical hardware. The hardware needs to exist, and it needs to get to where it is going. For one, in order to manufacture ASICs, a company needs permission from the state they are operating in. So, effectively, we need approval from the state in order to manufacture the computer equipment to secure the bitcoin network.</p>\n\n<p>Doesn&#39;t that seem.... odd?</p>\n\n<p>I think its more than odd. I think its flat out wrong and dangerous. Its counter to the entire reason Bitcoin exists - to be stateless, authority-less currency.</p>\n\n<p>So how does Monero address this mining aspect? The protocol that started Monero was actually designed with this goal in mind. Back in 2014, this goal was called &quot;ASIC Resistance&quot;. Basically, the developers of the original Monero code made a proof of work (Pow) that modified the Bitcoin PoW so that ASICs would be hard and expensive to build. This PoW is known as Cryptonight, and is referred to as CNv0 (Cryptonight Variant 0). Many years later, however, some companies decided to create ASICs anyway, even though they were expensive to make (most likely the value of Monero rose to a point where it made economic sense to build these machines). These ASICs infiltrated the network and commandeered a large percentage of the network hashrate. The Monero developers decided to tweak the PoW slightly (to create CNv1), so that any specific circuit design would no longer work. Furthermore, the Monero developers stated that the policy going forward would be to tweak the PoW every 6 months, in an effort to prevent the development of new ASICs (i.e., why would a company invest in making equipment that would become obsolete?). Admittedly, the Monero developers knew that this would be a battle of attrition (e.g., Monero devs tweak the PoW, ASIC designers make new chips, keep on fighting until one side gives up), so it was understood that this 6 month tweaking schedule was a way to buy time until a better solution could be found. Regardless, the first tweak (CNv1) may have worked - it is unclear if ASICs were developed for CNv1. On schedule, the Monero developers introduced CNv2. There was some evidence that the CNv2 epoch saw ASICs infiltrate the network again, though it is not certain. Due to the general gestalt of the community that ASICs were present, the Monero developers tweaked the PoW again, but this time ahead of schedule, to reach CNv3. And this is where the network stands at the time of this writing.</p>\n\n<p>Along the way, random souls of this Great Journey discovered Monero and it&#39;s quest for truly decentralized digital currency, and these souls hatched and developed the idea of what would become RandomX. Thinking about it now, its quite obvious, but the concept had evaded the entire cryptocurrency space for a whole decade. The proof of work, as built for Bitcoin, was effectively a hack. It uses cryptographic hashes to perform both the proof and the work. Howard Chu makes a good writeup of this PoW flaw , but in essence - you solve cryptographic puzzles and then prove you solved those puzzles using cryptography. This works, but cryptographic puzzles are really easy to solve - they are designed that way. You want a cryptographic puzzle to be easy to solve, because data needs to be protected, so it should be as easy as possible to protect it. For a cryptocurrency, you want a puzzle that is hard to solve but easy to prove.</p>\n\n<p>The goal - as stated in the original bitcoin whitepaper - is 1 CPU = 1 vote. The dreamers of RandomX took that to the extreme and thought, well, what does a CPU do really well? It executes programs. Any program. Anything you throw at a CPU, the CPU will just buckle down and do it. So this crew thought that a good bunch of work could be performed by creating a random program, having the CPU execute the program, and then proving that the whole thing was completed. Thus, they used cryptography to prove that a CPU had a done a lot of work, and the work that was done was just random programs.</p>\n\n<p>So this has been developed, and as of writing, RandomX is currently in the birth canal, waiting for some final reviews and initial implementations to wreak its glorious entropy-defying nature unto the fabric of the universe. The lock-step amorphous conjuring of an idea mashed into existence by disparate souls connected by a lightspeed communication network, a phenomenon only present in a true open source project, is occurring before our eyes and Monero may be handed the fervent baton of progress as humanity continues its relentless march through time.</p>\n\n<p>Of course, there are still aspects of the mining infrastructure that are anathema to decentralization - primarily pooled mining. Here, mining pool operators are creating block templates, and then the miners submit solutions the pool operator and the operator then builds the block. Therefore, the number of block producers on the Monero network is effectively equal to the number of pools (this is the same as all contemporary PoW networks). This is not a great situation, but at this time there are no clear solutions. I would argue, however, that having a decentralized PoW algorithm fosters a more independent mining community, such that any rogue pool operator will be abandoned and miners will migrate to pools that are following the protocol. There are some developments in Monero that may help chip away at this problem - namely, the idea of hash-for-service. Here, a user of the monero network will submit mining shares to receive a service of the monero network. This has mainly been designed as a means to incentivize those that run public RPC services - i.e., the ones you use as remote nodes for mobile wallets and using the GUI without your own copy of the blockchain. This will slightly increase the number of independent block producers.</p>\n\n<p>In addition to these decentralized aspects, Monero also have the vaulted property of actual being money. Monero&#39;s privacy gives it the property of fungibility, an essential property of money that all first generation cryptocurrencies do not have. Bitcoin is not fungible, ethereum is not fungible, litecoin is not fungible, etc. The privacy-protecting features of Monero are integral to its function as money. The features are well described elsewhere, but the primary outcome is that you can not trace transactions on the blockchain, you can not assign an identity to a transaction, and you can not see the value of a transaction. Of course, this does not mean that Monero provides 100% privacy - there are ways that metadata can leak due to user behavior, and some fundamental properties inherited from the internet itself can leak information. Countermeasures for these are being developed. It is important to note, however, that although Monero can not provide 100% privacy, I would argue that the Monero blockchain itself is 100% private and 100% fungible. If an adversary only has access to the Monero blockchain and they have NO access to meta-data, it would be very difficult for them to track the flow of money.</p>\n\n<p>Thus, when you spend your Monero, you do not need to worry about your money&#39;s history or its future or its ability to function. You don&#39;t need to worry that your monero may have come from a culturally-relevant nefarious activity, or that your transaction partner is going to use the money in culturally-relevant nefarious ways. You don&#39;t need to worry that your transaction partner can now monitor the blockchain to calculate your wealth. You don&#39;t need to worry that your transaction will be censored by a mining pool, or that the network will grind to a hault due to state interference of mining operations.</p>\n\n<p>Right now, the only legitimate fear that Monero can instill is that there is a bug in the code that allows for inflation or a breach in the privacy technology. These fears may always be present, as the technology is continually updated and new features are made available. Firstly, Monero has just celebrated its 5 year anniversary. This means there has been 5 years of software development. A critical bug in the original cryptonote code has been identified by Monero developers and fixed, and it was determined that this bug was not exploited. I am personally confident that the Monero money supply is sound. Again, this confidence comes from the fact that the software is now &quot;old&quot; and that hundreds of software developers have worked on it. I am confident that the privacy technology is secure because, again, the software is old and we have a dedicated team of cryptographers that study and develop this technology.</p>\n\n<p>So with all of that being said, if you are going to &quot;invest&quot; in a cryptocurrency, shouldn&#39;t you invest in a cryptocurrency that is actually a cryptocurrency? Also, it should be noted that if you plan on simply buying some monero and holding it, you are not investing - you are speculating. A true investment in Monero means that you are involved, in some way, to make the network better and stronger. Sure, you could argue that buying all the monero to &quot;invest&quot; means the price will skyrocket and maybe attract more development, but the network won&#39;t grow stronger as an immediate consequence of your actions. You, as a single user, have the ability to strengthen the monero network by investing time in understanding the software, burning electricity to support the network through mining and node operations, and developing the software and other infrastructure. For instance, one of the <em>most</em> critical aspects of the entire cryptocurrency ecosystem that is overlooked is that a functioning cryptocurrency requires a functioning internet. At this point in time, it is possible for end users to build their own internet (some kind of mega meshnet) - this is a critical development that must occur, and can only occur if people invest time in developing the infrastructure that supports Monero.</p>\n\n<p>In conclusion, Monero is money. Money is inherently private due its fungible nature. Cryptocurrency needs to be permissionless and decentralized in order to function as stateless money. Therefore, the only cryptocurrency that can currently function as money is Monero.</p>\n</div><!-- SC_ON -->",
  "score": 639,
  "permalink": "/r/CryptoCurrency/comments/mut2kc/why_monero/",
  "subreddit": "CryptoCurrency",
  "id": "mut2kc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523320
}