{
  "author": "FiboPI",
  "the_new_excerpt": "People bought a lot of risky stuff. ICLNs, ARKKs etc.\n\nThese people never held anything longer than 2-3 months, never went through a\nmarket correction, never witnessed a scandal that wipes out 15% of their\nposition in a day.\n\nI am not saying that asking about market condition is wrong but there are…",
  "original_created_utc": 1613749365,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "人们买了很多有风险的东西。ICLNs，ARKKs等。\n\n这些人持有的东西从来没有超过2-3个月，从来没有经过\n市场调整，从来没有见过一个丑闻使他们失去15%的资金。\n一天内的仓位。\n\n我并不是说问市场情况不对，但有...",
      "title": "对于每一个新来的人，担心低点和市场修正--我已经厌倦了你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們買了很多有風險的東西。ICLNs，ARKKs等。\n\n這些人持有的東西從來沒有超過2-3個月，從來沒有經過\n市場調整，從來沒有見過一個醜聞使他們失去15%的資金。\n一天內的倉位。\n\n我並不是說問市場情況不對，但有...",
      "title": "對於每一個新來的人，擔心低點和市場修正--我已經厭倦了你。"
    }
  ],
  "title": "To everyone new, worried about dips and market corrections - I am tired of you",
  "created_utc": 1613752230,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People bought a lot of risky stuff. ICLNs, ARKKs etc.</p>\n\n<p>These  people never held anything longer than 2-3 months, never went through a  market correction, never witnessed a scandal that wipes out 15% of  their position in a day.</p>\n\n<p>I am not  saying that asking about market condition is wrong but there are stocks  that don&#39;t and won&#39;t dip on days like these, less risky, more stable but  less sexy also. It&#39;s your choice to buy a risky investment and please  be prepared to see some losses along the way.</p>\n\n<p>GME  created a huge inflow of people to stock market subreddits and I am  tired of scrolling through thousands of posts asking about market  bubble, market correction. Yes some stocks are overvalued but we are in  totally uncharted waters given so much money printing, covid but also  investor beliefs in certain markets.</p>\n\n<p>You  are buying stocks like AAPL and MSFT at high valuations, you are not  that person that bought apple in 2003 and has 120000% gains. Please be  weary about the other side of your trades - there are people taking huge  profits - if we will have a lot of them in a span of 10-15-30-120 days  we might see a market correction.</p>\n\n<p>If  you are new to investing buying a stock feels like a very intimate  moment, sadly, a lot of people already own/owned that stock.</p>\n\n<p>If  you want safety sell your positions and buy ETFs (stable all world,  maybe S&amp;P), maybe go for a dividend stock like T. If you can&#39;t  handle your emotions make your portfolio all cash and trade on a paper  account.</p>\n\n<p>And for the love of god  don&#39;t call yourself a &quot;long term investor&quot; because you are bag holding a  20% loss. It might never come back, may come back tommorow, maybe in 7  years? You never know. We might see a bunch of people soon using that  term more often to offset that psychological game of chess with the  market but in reality you are simply not realizing that losses. I am  100% sure these LTIs are going to sell their position once breaking  even.</p>\n\n<p>Stock market is a game of  psychological chess and if you are weak - you will be wiped out by  people with time, money and huge balls.</p>\n\n<p>Please create daily/monthly/yearly threads designed for a discussion about bubble/correction or market conditions. There is so much noise it&#39;s crazy. </p>\n\n<p>#bringbackmaturity</p>\n\n<p>Not a financial advice.</p>\n</div><!-- SC_ON -->",
  "score": 10870,
  "permalink": "/r/stocks/comments/lniutl/to_everyone_new_worried_about_dips_and_market/",
  "subreddit": "stocks",
  "id": "lniutl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885062
}