{
  "author": "molochnik19",
  "original_created_utc": 1632600105,
  "title": "Do most guys actually not know anything about the clitoris?",
  "created_utc": 1632613262,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I grew up always hearing the stereotype that &quot;guys can&#39;t find the clitoris&quot; and I assumed it was always just a joke at the expense of bad male lovers; I thought pretty much every guy knew about it. But I recently had a sexual encounter in which I was commended for...&quot;using my knowledge&quot; and it dawned upon me that maybe the stereotype is true to an extent. Thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/NoStupidQuestions/comments/pvee5j/do_most_guys_actually_not_know_anything_about_the/",
  "subreddit": "NoStupidQuestions",
  "id": "pvee5j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I grew up always hearing the stereotype that \"guys can't find the clitoris\" and\nI assumed it was always just a joke at the expense of bad male lovers; I thought\npretty much every guy knew about it. But I recently had a sexual encounter in\nwhich I was commended for...\"using my knowledge\" and it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、「男はクリトリスを見つけられない」というステレオタイプを聞いて育ちました。\n男はクリトリスを見つけられない」というステレオタイプを聞いて育った私は、それがいつも悪い男性の恋人を犠牲にしたジョークだと思っていました。\n男なら誰でも知っていることだと思っていました。しかし、私は最近、ある性体験をしました。\n褒められたことがありました。",
      "title": "実際のところ、ほとんどの男性はクリトリスについて何も知らないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在成长过程中总是听到 \"男人找不到阴蒂 \"的刻板印象，我以为这只是一个笑话，是对糟糕的男性情人的讽刺。\n我以为这只是一个笑话，是对糟糕的男性恋人的讽刺；我以为几乎每个男人都知道。\n我以为几乎每个男人都知道这一点。但我最近有一次性接触\n我被称赞为...... \"使用了我的知识\"，这......。",
      "title": "大多数男人实际上对阴蒂一无所知吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在成長過程中總是聽到 \"男人找不到陰蒂 \"的刻板印象，我以爲這只是一個笑話，是對糟糕的男性情人的諷刺。\n我以爲這只是一個笑話，是對糟糕的男性戀人的諷刺；我以爲幾乎每個男人都知道。\n我以爲幾乎每個男人都知道這一點。但我最近有一次性接觸\n我被稱讚爲...... \"使用了我的知識\"，這......。",
      "title": "大多數男人實際上對陰蒂一無所知嗎？"
    }
  ]
}