{
  "author": "Yosho2k",
  "the_new_excerpt": "I have seen them waiting outside the building for someone to open the door for\nthem. I have already confronted them when they attempted to hold the door open\nwhen I was exiting the building and I shut the door behind me.\n\nUnfortunately, the other tenants in the building have not done the same to…",
  "original_created_utc": 1619905463,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "建物の外で、誰かがドアを開けてくれるのを待っているのを見たことがあります。\n私は、彼らが建物の外で誰かがドアを開けてくれるのを待っているのを見たことがある。彼らがドアを開けようとしたとき、私はすでに彼らと対決しました。\n私はドアを閉めてビルを出たのですが。\n\n残念ながら、このビルの他のテナントも同じようにはしていません。",
      "title": "エホバの証人が私のアパートに忍び込んでいます。不法侵入で通報することはできますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾看到他们在楼外等待有人为他们开门。\n他们。我已经和他们对峙过了，当时他们试图在我离开大楼时把门打开。\n我已经与他们对峙过，当时他们试图在我离开大楼的时候把门打开，我把门关在身后。\n\n不幸的是，大楼里的其他住户并没有对他们采取同样的措施。",
      "title": "耶和华见证人潜入我的公寓楼。我可以举报他们私闯民宅吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾看到他們在樓外等待有人爲他們開門。\n他們。我已經和他們對峙過了，當時他們試圖在我離開大樓時把門打開。\n我已經與他們對峙過，當時他們試圖在我離開大樓的時候把門打開，我把門關在身後。\n\n不幸的是，大樓裏的其他住戶並沒有對他們採取同樣的措施。",
      "title": "耶和華見證人潛入我的公寓樓。我可以舉報他們私闖民宅嗎？"
    }
  ],
  "title": "Jehova's Witnesses are sneaking into my apartment building. Can I report them for trespassing?",
  "created_utc": 1619912538,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen them waiting outside the building for someone to open the door for them. I have already confronted them when they attempted to hold the door open when I was exiting the building and I shut the door behind me.</p>\n\n<p>Unfortunately, the other tenants in the building have not done the same to keep them out, and they have knocked on my door at 9am for two weeks in a row and they have no reason to be here. I&#39;d like to call the police on them the next time they do it, but I don&#39;t know if police will respond to the resident of a building calling about people in the hallways.</p>\n\n<p>I&#39;m in Florida, by the way.</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/NoStupidQuestions/comments/n2s9ro/jehovas_witnesses_are_sneaking_into_my_apartment/",
  "subreddit": "NoStupidQuestions",
  "id": "n2s9ro",
  "is_self": true,
  "media": null,
  "is_video": false
}