{
  "author": "ichthi",
  "the_new_excerpt": "I understand that the term Jews nominally identify membership to the Tribe of\nJudah. My understanding, however, is that the term Jews is now an umbrella term\nfor anyone claiming Hebraic descent, and not just limited to actual members of\nthe Tribe of Judah.\n\nIf all Jews were descendants of the Tribe…",
  "original_created_utc": 1623723391,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、ユダヤ人という言葉が、名目上はユダ族の一員であることを示していると理解しています。\nユダ族の一員であることを理解しています。しかし、私の理解では、ユダヤ人という言葉は、現在、ヘブライ系の血を引くと主張するすべての人の包括的な用語であり\nヘブライ系の血を引く者の総称であり、実際のユダ族のメンバーに限らないということです。\nユダ族だけではありません。\n\nもし、すべてのユダヤ人がユダ族の子孫だったら...。",
      "title": "今から約2000年前、使徒パウロは自分がベニヤミン族の一員であることを自覚していました。私の知る限り、私のイスラエル人やヘブライ人の友人の中で、イスラエルの特定の部族を名乗っている人はいません。いつ、どのようにして、ヘブライ人の血を引く人々は、部族の血統に関する知識を失ったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解，犹太人这个词在名义上是指犹大部落的成员。\n犹大部落的成员。然而，我的理解是，犹太人这个词现在是一个总括性术语\n任何声称有希伯来血统的人，而不只是限于犹大部落的实际成员。\n犹大部落的实际成员。\n\n如果所有犹太人都是犹大部落的后裔......",
      "title": "大约2000年前，使徒保罗认定自己是便雅悯支派的成员。据我所知，我的以色列人或有希伯来血统的朋友中没有一个人认同以色列的任何特定部落。具有希伯来血统的人何时以及如何失去了对部落血统的认识？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解，猶太人這個詞在名義上是指猶大部落的成員。\n猶大部落的成員。然而，我的理解是，猶太人這個詞現在是一個總括性術語\n任何聲稱有希伯來血統的人，而不只是限於猶大部落的實際成員。\n猶大部落的實際成員。\n\n如果所有猶太人都是猶大部落的後裔......",
      "title": "大約2000年前，使徒保羅認定自己是便雅憫支派的成員。據我所知，我的以色列人或有希伯來血統的朋友中沒有一個人認同以色列的任何特定部落。具有希伯來血統的人何時以及如何失去了對部落血統的認識？"
    }
  ],
  "title": "Roughly 2000 years ago, Paul the Apostle identified himself as a member of the Tribe of Benjamin. As far as I know, none of my Israeli or friends of Hebraic origins identify with any particular tribe of Israel. When and how did persons of Hebraic heritage lose their knowledge of tribal descent?",
  "created_utc": 1623738215,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that the term Jews nominally identify membership to the Tribe of Judah. My understanding, however, is that the term Jews is now an umbrella term for anyone claiming Hebraic descent, and not just limited to actual members of the Tribe of Judah. </p>\n\n<p>If all Jews were descendants of the Tribe of Judah, then what precisely happened to the other tribes? How come the Jewish diaspora enabled certain Benjamites to retain their identity at least 2000 years ago, but somehow lost such identity 2000 years later?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/o038s0/roughly_2000_years_ago_paul_the_apostle/",
  "subreddit": "AskHistorians",
  "id": "o038s0",
  "is_self": true,
  "media": null,
  "is_video": false
}