{
  "author": "milonuttigrain",
  "original_created_utc": 1644113940,
  "title": "I analyse the 18 coins in Coinbase Venture portfolio from Jan 2021 to today date. $100 invested in each of these 18 coins is worth $22,831 now. Also: NASDAQ is +11% and Gold is -7%.",
  "created_utc": 1644143969,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We all know Coinbase but not all of us had heard of Coinbase Venture. It is an investment arm of Coinbase to invest in early-stage cryptocurrency and blockchain startups. You can check the portfolio at Messari website.&lt;/p&gt;\n\n&lt;p&gt;Their portfolio contains 18 coins as of  now:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Bitcoin (BTC) and Ethereum (ETH)&lt;/li&gt;\n&lt;li&gt;Larger market cap ($5B plus): LUNA, MATIC, NEAR, UNI&lt;/li&gt;\n&lt;li&gt;Average market cap ($1B plus): GRT, FLOW, AR, CELO&lt;/li&gt;\n&lt;li&gt;Small market cap (less than $1B): AUDIO, RLY, UMA, KEEP, RSR, DODO, RARI&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Okay, enough introduction. Let&amp;#39;s see how these coins perform in the last 1 year, from Jan 2021 to date.&lt;/p&gt;\n\n&lt;h1&gt;1. Overall performance - ROI 1168%; 15/18 up; 3/18 down&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/axvjaey6c4g81.png?width=925&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=6508771f2076b077e3585e1bbb7ee17cec4cddc5\"&gt;Coinbase Venture&amp;#39; portfolio&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Even when the market is still down right now, the return is 1,168%. This is a great return compared to various asset classes.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ujjxpreqc4g81.png?width=463&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=48e6e9b5fb65cd81cdd5efe5c04db7c1b7abe52a\"&gt;Comparison to other asset classes&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Except oil, which has a relatively fine return of 93%, the rest isn&amp;#39;t that impressive. And Mr Pete, I&amp;#39;m looking at you. Gold price actually decreased by 7% in the last year.&lt;/p&gt;\n\n&lt;h1&gt;2. The top gainers and which are the threes that make losses?&lt;/h1&gt;\n\n&lt;p&gt;The top 5 gainers in this portfolio is MATIC, LUNA, AR, NEAR and AUDIO. The most impressive ones are MATIC and LUNA which had returned over 8000%.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/brsh46l4d4g81.png?width=447&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7e28276133d7844c27b79c70affee776b0088009\"&gt;Top gainers and 3 losers&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The losses are actually not that huge, however. It&amp;#39;s quite normal for small cap coins to lose over 90% value in a market downturn. I&amp;#39;d say COMP will go back up pretty quickly once the market improves.&lt;/p&gt;\n\n&lt;h1&gt;3. Show me the sectors - which market niches do CV invested in and how do they perform&lt;/h1&gt;\n\n&lt;p&gt;Now I sort the portfolio based on the sector. You could see BTC stands as a category, even though it&amp;#39;s labelled as &amp;quot;Currencies&amp;quot; as it is the OG cryptocurrency, but nowadays it&amp;#39;s more like a store value of money. BTC is also the staple in the many institutional investor&amp;#39;s holdings.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0foje1azd4g81.png?width=825&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=84ecbae33684c4167b940c6ff5cb13786ebe4f99\"&gt;By sector&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;CV invested quite heavily in smart contract platforms, which features ETH, LUNA, NEAR, FLOW and CELO. I&amp;#39;d also argue that MATIC is closely related, though it&amp;#39;s not a L1, but with the high gas fees of Ethereum, MATIC as the front runner of scalability will be needed for a foreseeable future. All of this category did well, most notably LUNA and MATIC. NEAR also has a good run lately, though it&amp;#39;s not often mentioned in this sub.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m quite surprised that CV didn&amp;#39;t invest in ATOM and DOT, the two front runners of interoperability. However, they did invest in a small cap on this, which is KEEP Network. So far it has doubled in value but probably needs more time to prove its worth.&lt;/p&gt;\n\n&lt;p&gt;DeFi is a little disappointed at the moment, but many has predicted DeFi will see its rise in 2022. CV invested in only 1 lending defi which is COMP.&lt;/p&gt;\n\n&lt;p&gt;Other niche markets had been seeing mix results:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Asset management (RSR): down at the moment, but this is also quite new.&lt;/li&gt;\n&lt;li&gt;Content distribution: AUDIO - which has returns quite nicely as it&amp;#39;s the front runner in music streaming.&lt;/li&gt;\n&lt;li&gt;Data management (The Graph): doing ok at the moment. It might have the time with Web3.&lt;/li&gt;\n&lt;li&gt;Exchanges (UNI and DODO): UNI has its time in 2021 like most others, DODO has been in trouble with the hack last year.&lt;/li&gt;\n&lt;li&gt;File storage (AR): recently has partnered with Solana. AR is up over 1400% in the last year.&lt;/li&gt;\n&lt;li&gt;Tokenization (RLY and RARI): above average returns. Social tokens RLY and RARI is for buy/sell NFTs.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;How&amp;#39;s your portfolio doing? Are you happy with your choice of coins? Are you planning to buy or sell anything new? Let me know in the comment.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;*EDIT\\&lt;/strong&gt;*&lt;/p&gt;\n\n&lt;p&gt;I just do another deep dive into the list. Messari list doesn&amp;#39;t list all the coins that Coinbase Venture had invested in.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/is9lcabjr5g81.png?width=838&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=576bf2479bae2ad14f36fd1dd2a145b99fd250e8\"&gt;Here is another updated version from Coinbase Venture website&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;CV seems to focus more on the new trend now. One focus I could find is that now they stress on the important of NFT utility phase - so think beyond a picture of a rock that is sold for $1.3M&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/jwawkprtr5g81.png?width=833&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=afa00b8546378b047dfaddf2996313c646bd7195\"&gt;Info from Coinbase blog&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;For platform and developer tools, the focus is now shifted to Web3, with the tool kits that help the developers to make things happen. Also they pay attention to API such as Alchemy.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/nhx2c898s5g81.png?width=880&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=34195984e01d7fb927dc502569da11d537575c56\"&gt;Info from Coinbase blog&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;For more info please visit the Coinbase Ventures website. They have a full list of investments. When I have time I can actually look further into which coins do they invested in.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;**EDIT 2*\\&lt;/strong&gt;*&lt;/p&gt;\n\n&lt;p&gt;I could actually find another list of coins that Coinbase Venture had invested in. There are currently 38 coins (under &lt;strong&gt;Coinbase Ventures Portfolio Screener&lt;/strong&gt;). &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/g7k72evpq6g81.png?width=1919&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8d942a57050fc809ddbd745cc84e1e47a01fed72\"&gt;Coinbase Venture 38 coins - Portfolio Screener&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This list doesn&amp;#39;t contain BTC or ETH but we all know they own a truckload of BTC and ETH already. Some other interesting picks:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Metaverse / Gaming - SAND - arguably one of the better games in the Metaverse now (stand out against a sea of garbage games)&lt;/li&gt;\n&lt;li&gt;Smart contracts - MINA, CTK&lt;/li&gt;\n&lt;li&gt;Shared compute - LPT: which is kind of similar to THETA, focus on video infrastructure. It did have a pump in Nov 2021 (note not all alts have pumped crazily in Nov 2021)&lt;/li&gt;\n&lt;li&gt;Derivatives - SNX for Defi application. &lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/slngcc/i_analyse_the_18_coins_in_coinbase_venture/",
  "subreddit": "CryptoCurrency",
  "id": "slngcc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We all know Coinbase but not all of us had heard of Coinbase Venture. It is an\ninvestment arm of Coinbase to invest in early-stage cryptocurrency and\nblockchain startups. You can check the portfolio at Messari website.\n\nTheir portfolio contains 18 coins as of now:\n\n * Bitcoin (BTC) and Ethereum…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Coinbaseは知っていても、Coinbase Ventureは知らない人ばかりでした。これは\nコインベースの投資部門は、アーリーステージの暗号通貨および\nブロックチェーンスタートアップ メッサリのサイトでポートフォリオを確認することができます。\n\nそのポートフォリオには、現時点で18のコインが含まれています。\n\n * ビットコイン（BTC）、イーサリアム（Ethereum）...",
      "title": "コインベースベンチャーポートフォリオの18コインを2021年1月から今日の日付まで分析します。この18のコインにそれぞれ投資した100ドルは、現在22,831ドルの価値があります。また NASDAQは+11％、ゴールドは-7％です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道Coinbase，但不是所有人都听说过Coinbase Venture。它是一个\n它是Coinbase的一个投资部门，投资于早期的加密货币和\n区块链初创企业。你可以在Messari网站上查看投资组合。\n\n截至目前，他们的投资组合包含18个币种。\n\n * 比特币（BTC）和以太坊...",
      "title": "我分析了Coinbase风险投资组合中从2021年1月到今天的18个币。在这18个币中，每个币投资100美元，现在价值22,831美元。另外。纳斯达克是+11%，黄金是-7%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道Coinbase，但不是所有人都聽說過Coinbase Venture。它是一個\n它是Coinbase的一個投資部門，投資於早期的加密貨幣和\n區塊鏈初創企業。你可以在Messari網站上查看投資組合。\n\n截至目前，他們的投資組合包含18個幣種。\n\n * 比特幣（BTC）和以太坊...",
      "title": "我分析了Coinbase風險投資組合中從2021年1月到今天的18個幣。在這18個幣中，每個幣投資100美元，現在價值22,831美元。另外。納斯達克是+11%，黃金是-7%。"
    }
  ]
}