{
  "author": "kellieking80",
  "original_created_utc": 1630615002,
  "title": "Why do pro-life proponents not support all the things that would help that life after birth?",
  "created_utc": 1630643537,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m talking about programs like: sex education/ birth control education; contraceptive availability, improved WIC, Healthcare for children at reduced costs for preventative care, reduced cost child care, paid parental leave, making adoption more accessible, fixing the foster care system, etc?</p>\n\n<p>Why are these sort of measures not on the table? Why are there active supporters of removing some of these programs claiming they are pro life?</p>\n\n<p>Wouldn&#39;t the LIFE be the most important part of this? If the child is born into a situation where the parents didn&#39;t want it (or rape) and not able to get an adoption set, that child is not in a healthy environment.  Why force a child unto that?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/pgq77g/why_do_prolife_proponents_not_support_all_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "pgq77g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm talking about programs like: sex education/ birth control education;\ncontraceptive availability, improved WIC, Healthcare for children at reduced\ncosts for preventative care, reduced cost child care, paid parental leave,\nmaking adoption more accessible, fixing the foster care system, etc?\n\nWhy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "性教育／避妊教育といったプログラムのことです。\n避妊具の提供、WICの改善、予防的ケアのための子どもの医療費の\n養子縁組をより身近なものにすること。\n養子縁組をより身近なものにしたり、里親制度を改善したり、などです。\n\nなぜ...",
      "title": "賛成派はなぜ、生まれた後のその命を助けるためのあらゆることを支持しないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我指的是以下项目：性教育/节育教育。\n避孕药具的供应，改善WIC，以较低的费用为儿童提供医疗服务。\n预防性保健的费用，降低儿童护理的费用，带薪育儿假。\n使收养更容易，修复寄养系统，等等？\n\n为什么...",
      "title": "为什么支持生命的人不支持所有有助于出生后生命的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我指的是以下項目：性教育/節育教育。\n避孕藥具的供應，改善WIC，以較低的費用爲兒童提供醫療服務。\n預防性保健的費用，降低兒童護理的費用，帶薪育兒假。\n使收養更容易，修復寄養系統，等等？\n\n爲什麼...",
      "title": "爲什麼支持生命的人不支持所有有助於出生後生命的事情？"
    }
  ]
}