{
  "author": "TotalFox2",
  "original_created_utc": 1655891495,
  "title": "Why do weed smokers and stoners make it their whole personality?",
  "created_utc": 1655915787,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel it&amp;#39;s okay for people to smoke weed if it&amp;#39;s legal where they live, and if they want to. But why do most of them make it their whole personality? &lt;/p&gt;\n\n&lt;p&gt;They don&amp;#39;t talk about anything other than weed, or which strain they like to smoke, or how much high they are. It&amp;#39;s impossible to have any conversation with them that&amp;#39;s not about weed. Is this a form of narcissism, or is there are any psychological reason for this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/NoStupidQuestions/comments/vi1hmb/why_do_weed_smokers_and_stoners_make_it_their/",
  "subreddit": "NoStupidQuestions",
  "id": "vi1hmb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel it's okay for people to smoke weed if it's legal where they live, and if\nthey want to. But why do most of them make it their whole personality?\n\nThey don't talk about anything other than weed, or which strain they like to\nsmoke, or how much high they are. It's impossible to have any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分の住んでいるところで合法なら、そして吸いたければ、大麻を吸ってもいいと思うんです。\nてもいいと思います。でも、なぜほとんどの人がそれを全人格にしてしまうのでしょうか。\n\n葉っぱ以外の話はしないし、どの系統の葉っぱが好きとか、どれくらいハイになってるとか。\n葉っぱ以外の話はしないし、どの系統の葉っぱが好きとか、どれくらいハイになってるとか。それは不可能なことだ...。",
      "title": "なぜ、大麻を吸う人、石破はそれを全人格にしてしまうのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得人们吸食大麻是可以的，如果他们居住的地方是合法的，而且如果\n他们想这样做。但为什么他们中的大多数人把它作为他们的全部个性？\n\n他们不谈论除大麻以外的任何事情，或者他们喜欢哪种大麻，或者他们有多高。\n或者他们喜欢抽哪种大麻，或者他们有多高。这不可能有任何...",
      "title": "为什么吸食大麻的人和嗑药的人把它作为自己的全部个性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得人們吸食大麻是可以的，如果他們居住的地方是合法的，而且如果\n他們想這樣做。但爲什麼他們中的大多數人把它作爲他們的全部個性？\n\n他們不談論除大麻以外的任何事情，或者他們喜歡哪種大麻，或者他們有多高。\n或者他們喜歡抽哪種大麻，或者他們有多高。這不可能有任何...",
      "title": "爲什麼吸食大麻的人和嗑藥的人把它作爲自己的全部個性？"
    }
  ]
}