{
  "author": "HvideRiddere",
  "the_new_excerpt": "This will be a boiled down argument for why you should stop checking your\nportfolio hourly, daily and even weekly - and what intense portfolio-looking\ndoes to you.\n\n 1. The biggest and easiest to explain factor is glaringly obvious when\n    explained and it comes down to statistics. If you expect…",
  "original_created_utc": 1616923025,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这将是一个归纳的论点，为什么你应该停止检查你的。\n每小时、每天甚至每周的投资组合--这是多么紧张的投资组合看。\n对你的影响。\n\n 1. 最大也是最容易解释的因素是显而易见的，当\n    解释，它归结为统计数据。如果你期望...",
      "title": "停止检查你的投资组合：解释背后的统计数据和心理学。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這將是一個歸納的論點，爲什麼你應該停止檢查你的。\n每小時、每天甚至每週的投資組合--這是多麼緊張的投資組合看。\n對你的影響。\n\n 1. 最大也是最容易解釋的因素是顯而易見的，當\n    解釋，它歸結爲統計數據。如果你期望...",
      "title": "停止檢查你的投資組合：解釋背後的統計數據和心理學。"
    }
  ],
  "title": "Stop checking your portfolio: the statistics and psychology behind explained",
  "created_utc": 1616941831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This will be a boiled down argument for why you should stop checking your portfolio hourly, daily and even weekly - and what intense portfolio-looking does to you.</p>\n\n<ol>\n<li>The biggest and easiest to explain factor is glaringly obvious when explained and it comes down to statistics. If you expect 100% gains during a 1 year investment, it will not go up all the time during those 525.600 minutes of the year. At best, it will be up from the last minute, maybe 10.000 times more than it will be down. Say you check bitcoins price every minute 51/100 times it will be up (this is even generous). This is important, because og the theory in psychology that states losses cause more hurt than gains reward in terms of happiness.</li>\n</ol>\n\n<p>But if you check daily instead of per minute, you might be up 200/365 days. That’s significantly up from 51/100. Now if you check monthly, you might be up 8/12 og 9/12 months (from the last month) assuming a 100% expected yearly return. (This is a high apy, but still applies to a low one, but let’s be real, if ur in bitcoin you expect high returnand volatility)</p>\n\n<p>If you are a holder believing in bitcoin, you’re better off checking as few times as possible since variances in prices on daily candles are insignificant compared to the long term, and what you are seeing is the outcome of randomness. When you factor in the psychology of loss and gain, your mental will lose every time when checking often. By checking the price monthly or twice monthly, what you see is bitcoins actual price movement and not the result of daytraders random results.</p>\n\n<ol>\n<li><p>Becoming too invested in your investment. Dedicating your time to checking your portfolio also takes time away from other productive things (or even just watching tv). If you’re not planning on changing your investment, there’s no reason to be checking it often since no matter how many times you do so, it’s still going to be the same price in 1 month as if you didn’t check. Spend that time watching tv instead, it’s better than wasting time watching random outswings in price.</p></li>\n<li><p>Being down from your ATH is frustrating. \nBy checking bitcoins price often, you make sure you will be seeing the price being DOWN from the ATH 99% of the time. If you check it less, chances are you still won’t be seeing the ATH.. but instead of being 15% down from ATH you shift your focus to being up 10% since you checked last month.\nThis third reason could vary from person to person with it being insignificant to some people.</p></li>\n</ol>\n\n<p>TL;DR:\nBy checking your portfolio often, you’re just checking the results of daytraders random outcome. Checking less often gives you a clearer indication of bitcoins actual price moment. </p>\n\n<p>Psychological principles say losses hurt more than wins gain - leaving your unconscious mood to be decided by daytraders is probably not in your interests when investing in bitcoin. </p>\n\n<p>Check less often for higher chance of being up from when you last checked to be affected less by random, insignificant price actions. This applies if you’re a bitcoin bull in a bull market.</p>\n</div><!-- SC_ON -->",
  "score": 474,
  "permalink": "/r/CryptoCurrency/comments/mey1y7/stop_checking_your_portfolio_the_statistics_and/",
  "subreddit": "CryptoCurrency",
  "id": "mey1y7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357137112
}