{
  "author": "Ranger_Prick",
  "the_new_excerpt": "I was thinking about this while playing FIFA yesterday. England, Scotland,\nWales, and Northern Ireland are all independent \"nations\" for soccer\ntournaments. Hell, even Gibraltar competes independently, and it has\napproximately 1/3 the population of the American suburb where I live.\n\nYet for most…",
  "original_created_utc": 1619531441,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、FIFAをプレイしながら考えていたことがある。イングランド、スコットランド。\nイングランド、スコットランド、ウェールズ、北アイルランドは、サッカーの大会ではそれぞれ独立した「国」となります。\nトーナメントを開催しています。ジブラルタルも独立しています。\n私が住んでいるアメリカ郊外の人口の約3分の1です。\n\nしかし、ほとんどの場合...",
      "title": "なぜイギリスのスポーツは、オリンピックでは国としての活動をしているのに、サッカー・フットボール、ラグビー、クリケットなどの競技では別々の活動をしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我昨天在玩FIFA时想到了这个问题。英格兰、苏格兰。\n威尔士和北爱尔兰都是独立的足球 \"国家\"\n锦标赛。该死的，甚至直布罗陀也独立参赛，而它的人口约为我居住的美国郊区的1/3。\n它的人口约为我居住的美国郊区的1/3。\n\n然而，对于大多数...",
      "title": "为什么英国的体育项目在奥运会上作为一个整体表现，但在足球/橄榄球、橄榄球或板球等项目中却作为独立的实体表现？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨天在玩FIFA時想到了這個問題。英格蘭、蘇格蘭。\n威爾士和北愛爾蘭都是獨立的足球 \"國家\"\n錦標賽。該死的，甚至直布羅陀也獨立參賽，而它的人口約爲我居住的美國郊區的1/3。\n它的人口約爲我居住的美國郊區的1/3。\n\n然而，對於大多數...",
      "title": "爲什麼英國的體育項目在奧運會上作爲一個整體表現，但在足球/橄欖球、橄欖球或板球等項目中卻作爲獨立的實體表現？"
    }
  ],
  "title": "Why do UK sports perform as a whole nation at the Olympics but as separate entities in events like soccer/football, rugby, or cricket?",
  "created_utc": 1619558783,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was thinking about this while playing FIFA yesterday. England, Scotland, Wales, and Northern Ireland are all independent &quot;nations&quot; for soccer tournaments. Hell, even Gibraltar competes independently, and it has approximately 1/3 the population of the American suburb where I live.</p>\n\n<p>Yet for most sports at the Olympics (and other major international competitions), athletes from the UK compete as a part of Team Great Britain (sorry, Northern Ireland). What in history led to the UK consolidating some national sports and keeping others separate?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/mzovzz/why_do_uk_sports_perform_as_a_whole_nation_at_the/",
  "subreddit": "AskHistorians",
  "id": "mzovzz",
  "is_self": true,
  "media": null,
  "is_video": false
}