{
  "author": "kevinmarkdrozario",
  "original_created_utc": 1627964032,
  "title": "I built a website that teaches anyone who has or wants to start their own startup/business/side project all the aspects of Marketing and how they can get their first customers. ( It's completely free and always will be.✨)",
  "created_utc": 1627975784,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been working with all kinds of early-stage startups (Bootstrapped to Seed to Series A) and over the years I&#39;ve made it a habit to write about what I&#39;ve learned along the way. Finally, I&#39;ve gathered up the courage to launch what I&#39;ve learnt to the world.</p>\n\n<p>My goal is to <strong>help Solo founders, Indie Hackers, Marketers, and anyone who has an idea of launching a startup to identify problems, validate ideas, build an MVP, get customers, and then scale their customer acquisition and revenue.</strong> <strong>(Website:</strong><a href=\"https://dontjustbuild.com/\"> <strong>https://dontjustbuild.com/</strong></a><strong>)</strong>  </p>\n\n<p><a href=\"https://dontjustbuild.com/\"><strong>The resource</strong></a> is primarily divided into 5 sections:</p>\n\n<h1>MVP Base:</h1>\n\n<p>If you&#39;re searching for an idea, want to learn how to evaluate ideas or want to build a Minimal Viable Product (MVP) within a day or two and get some users, start here.<a href=\"https://dontjustbuild.com/mvp-base\"> <strong>This base</strong></a> teaches you:</p>\n\n<ol>\n<li>What an MVP is and the methodology we are going to follow while building an MVP and Acquiring users.</li>\n<li>How to identify problems, choose the best problem and come up with solutions for the problem that people would pay you for.</li>\n<li>How to build a landing page as fast as possible and optimize it to a degree.</li>\n<li>Learn how to set up accounts and integrations to your landing page to collect info like emails, receive payments and so on.</li>\n<li>Finally, learn how to acquire beta users for your MVP, build a waitlist, get feedback, and more.</li>\n</ol>\n\n<h1>UI/UX Base:</h1>\n\n<p>In<a href=\"https://dontjustbuild.com/uiux-base\"> <strong>this base</strong></a>, you will learn how to improve the UI/UX of your product so that you can offer your customer the best experience possible and maximize conversion rates and revenue. This base teaches you:</p>\n\n<ol>\n<li>About design thinking and how what you should consider while designing for your audience.</li>\n<li>All the Frameworks and best practices of UI/UX design and even design principles like Unity, White space, Similarity, Repetition, etc.</li>\n<li>The effect of typography and color on your landing page and product design and what colors are most suitable to produce a certain emotion in your users/prospects. Also, learn what Typefaces are best for which industries.</li>\n<li>Learn how to quickly design landing pages and product screens in Figma and convert that into HTML and CSS code.</li>\n<li>Learn how to create SVG&#39;s for your designs and logo, illustrations and much more.</li>\n</ol>\n\n<h1>Marketing Base:</h1>\n\n<p><a href=\"https://dontjustbuild.com/marketing-base\"><strong>The marketing base</strong></a> is being continually updated with new strategies and channels for acquiring customers and optimizing your marketing funnel. This base teaches you:</p>\n\n<ol>\n<li>The basics of marketing including the available channels, marketing metrics, content and distribution, the anatomy of a funnel and much more.</li>\n<li>It then focuses on three specific channels - Social ads, Search ads and SEO (includes content marketing) to help you grow to 1000 customers.</li>\n<li>You can then get inspiration on ads and landing pages to help you improve your own product. Also, learn CRO to optimize your landing pages to maximize conversions.</li>\n<li>Next, learn the power of using AI in your marketing to predict everything from churn to predicting conversion probability.</li>\n<li>The next part is marketing analytics where you can learn about various pricing strategies and price analytics. Learn about price psychology, how to estimate demand and costs and how to forecast sales.</li>\n<li>Finally, create a couple of basics web apps for competitor content marketing analysis and how you can listen for user/customer feedback on Twitter or any other social media platform.</li>\n</ol>\n\n<h1>Reporting and Dashboards Base:</h1>\n\n<p><a href=\"https://dontjustbuild.com/reporting-and-dashboards-base\"><strong>This base</strong></a> helps you set up all the dashboards and reports required to analyze the various metrics of your startup and get unique, actionable insights from these metrics. This base teaches you:</p>\n\n<ol>\n<li>How to build a Google analytics report in Data Studio (You can connect any analytics platform data)</li>\n<li>Build a Google Ads Dashboard and a Facebook Ads Dashboard to record important metrics and make crucial insights.</li>\n<li>Build SEO and Search Console Dashboards to help you understand your traffic and SEO Efforts, check your page speeds over time and much more.</li>\n<li>Analyze Facebook Ads and Google Ads to find insights into your campaign, ad sets and keyword data.</li>\n<li>Finally, create a Sentiment Analysis Dashboard to check the customer sentiment across social media channels, reviews and more, not only for your startup but for competitor startups too.</li>\n</ol>\n\n<h1>Software Base:</h1>\n\n<p><a href=\"https://dontjustbuild.com/software-base\"><strong>The software base</strong></a> consists of all the software/websites necessary to run your startup. This includes several categories like live chat, marketing tools, Analysis tools, payments and subscriptions and much more...</p>\n\n<p>&#x200B;</p>\n\n<p>I intend to keep this resource completely free. If you have any feedback about anything in this resource or if you would like me to add more topics to the resource, do let me know. Also, if you need guidance on how to use this resource do check out this<a href=\"https://dontjustbuild.com/how-to-use-this-resource\"> <strong>link.</strong></a></p>\n</div><!-- SC_ON -->",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/iZkMoEanQmok1X-3B9lZFL6X8E0VFCRI2adcObd-VT8.jpg?auto=webp&s=ab70df8d200bde97e73cc30ddb151c3c7685739a",
          "width": 1800,
          "height": 945
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/iZkMoEanQmok1X-3B9lZFL6X8E0VFCRI2adcObd-VT8.jpg?width=108&crop=smart&auto=webp&s=ac45d530642c030b8e0903aac56ce3944d6d8dd3",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/iZkMoEanQmok1X-3B9lZFL6X8E0VFCRI2adcObd-VT8.jpg?width=216&crop=smart&auto=webp&s=55a784d2429f184f091b648ba1d68d3fb73c9154",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/iZkMoEanQmok1X-3B9lZFL6X8E0VFCRI2adcObd-VT8.jpg?width=320&crop=smart&auto=webp&s=da6199060501628132ba6016f3d431dc33cc84c0",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/iZkMoEanQmok1X-3B9lZFL6X8E0VFCRI2adcObd-VT8.jpg?width=640&crop=smart&auto=webp&s=341e991a14a9848cad0ef9deec14a7e8243d080e",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/iZkMoEanQmok1X-3B9lZFL6X8E0VFCRI2adcObd-VT8.jpg?width=960&crop=smart&auto=webp&s=dfb56dcf52c5971ff031be89b2d2f9cd19ce2f25",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/iZkMoEanQmok1X-3B9lZFL6X8E0VFCRI2adcObd-VT8.jpg?width=1080&crop=smart&auto=webp&s=3611d12d1501fd2bcb48a23ecb7138aa7a78f90c",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "vo3W_PAmLnriiioMTsfQKB2DhoVBl6Gf_mrPuYmL5Ck"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/owvnr8/i_built_a_website_that_teaches_anyone_who_has_or/",
  "subreddit": "SideProject",
  "id": "owvnr8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been working with all kinds of early-stage startups (Bootstrapped to Seed\nto Series A) and over the years I've made it a habit to write about what I've\nlearned along the way. Finally, I've gathered up the courage to launch what I've\nlearnt to the world.\n\nMy goal is to help Solo founders, Indie…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、あらゆる種類の初期段階のスタートアップ（ブートストラップからシード\nシリーズAまで）と仕事をしてきましたが、その過程で学んだことを書くことを習慣にしてきました。\n私は長年にわたり、その過程で学んだことを記事にすることを習慣にしてきました。そしてついに、私が学んだことを世界に向けて発信する勇気がわいてきました。\n世界に向けて発信しています。\n\n私の目標は、ソロ・ファウンダーやインディー・ベンチャーの支援をすることです。",
      "title": "私は、自分のスタートアップやビジネス、サイドプロジェクトを始めようとしている人、あるいは始めたいと思っている人に、マーケティングのすべての側面と、最初の顧客を獲得する方法を教えるウェブサイトを作りました。(完全に無料で、これからもそうします✨）。)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在与各种早期阶段的创业公司合作（从启动到种子期\n到A轮融资），多年来，我已经养成了一个习惯，那就是写下我在这一路上学到的东西。\n多年来，我已经养成了一个习惯，那就是把我在这一路上学到的东西写出来。最后，我鼓起勇气推出我所学的东西\n我终于鼓起勇气将我所学到的东西向世界公布。\n\n我的目标是帮助独行侠的创始人、独立创业者、以及他们的朋友。",
      "title": "我建立了一个网站，教导任何已经或想要开始自己的创业/业务/副业项目的人营销的所有方面以及如何获得他们的第一个客户。( 这是完全免费的，而且永远都是。✨)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在與各種早期階段的創業公司合作（從啓動到種子期\n到A輪融資），多年來，我已經養成了一個習慣，那就是寫下我在這一路上學到的東西。\n多年來，我已經養成了一個習慣，那就是把我在這一路上學到的東西寫出來。最後，我鼓起勇氣推出我所學的東西\n我終於鼓起勇氣將我所學到的東西向世界公佈。\n\n我的目標是幫助獨行俠的創始人、獨立創業者、以及他們的朋友。",
      "title": "我建立了一個網站，教導任何已經或想要開始自己的創業/業務/副業項目的人營銷的所有方面以及如何獲得他們的第一個客戶。( 這是完全免費的，而且永遠都是。✨)"
    }
  ]
}