{
  "author": "AngooseTheC00t",
  "the_new_excerpt": "(Preface: I know basically nothing about medieval history and the geographical\ndistribution of lions, forgive any dumb stuff I say lol)\n\nFrom what I can tell, lions are animals native to sub-Saharan Africa. Why were\nthey so prevalent in Europe? Like, you have the three on the Royal Arms of\nEngland,…",
  "original_created_utc": 1617321183,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "(前言。我对中世纪的历史和地理知识基本一无所知。\n狮子的分布，原谅我说的任何愚蠢的东西lol)\n\n据我所知，狮子是原产于撒哈拉以南非洲的动物。为什么是\n他们在欧洲如此普遍？就像，你有三个在皇家臂章上的... ...\n英国，...",
      "title": "为什么狮子在中世纪的欧洲如此盛行？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(前言。我對中世紀的歷史和地理知識基本一無所知。\n獅子的分佈，原諒我說的任何愚蠢的東西lol)\n\n據我所知，獅子是原產於撒哈拉以南非洲的動物。爲什麼是\n他們在歐洲如此普遍？就像，你有三個在皇家臂章上的... ...\n英國，...",
      "title": "爲什麼獅子在中世紀的歐洲如此盛行？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "(前置きが長くなりました。中世の歴史やライオンの地理的分布については基本的に何も知りません。\nライオンの地理的分布については基本的に何も知らないので、馬鹿なことを言っても許してください(笑)\n\n私の知る限りでは、ライオンはサハラ以南のアフリカに生息する動物です。なぜヨーロッパでは\nヨーロッパではなぜあんなに流行っていたのでしょうか？イングランドの王家の紋章には3頭のライオンが描かれていますよね。\nイングランドの王家の紋章に3つあるように、...",
      "title": "中世ヨーロッパでは、なぜライオンが流行っているのでしょうか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "(前置きが長くなりました。中世の歴史やライオンの地理的分布については基本的に何も知りません。\nライオンの地理的分布については基本的に何も知らないので、馬鹿なことを言っても許してください(笑)\n\n私の知る限りでは、ライオンはサハラ以南のアフリカに生息する動物です。なぜヨーロッパでは\nヨーロッパではなぜあんなに流行っていたのでしょうか？イングランドの王家の紋章には3頭のライオンが描かれていますよね。\nイングランドの王家の紋章に3つあるように、...",
      "title": "中世ヨーロッパでは、なぜライオンが流行っているのでしょうか？"
    }
  ],
  "title": "Why is the lion so prevalent in Medieval Europe?",
  "created_utc": 1617371453,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(Preface: I know basically nothing about medieval history and the geographical distribution of lions, forgive any dumb stuff I say lol)</p>\n\n<p>From what I can tell, lions are animals native to sub-Saharan Africa. Why were they so prevalent in Europe? Like, you have the three on the Royal Arms of England, one on the Royal Banner of Scotland, one on the Coat of Arms of Finland, and even Richard I of England was called &quot;the Lionheart&quot;. I get that the Romans brought them up to fight gladiators but did that really influence later medieval culture so much?</p>\n\n<p>Again, forgive my ignorance, I&#39;m just really curious as to why an African animal would be so important to the heraldry and culture of medieval Europe.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/mi8aj5/why_is_the_lion_so_prevalent_in_medieval_europe/",
  "subreddit": "AskHistorians",
  "id": "mi8aj5",
  "is_self": true,
  "media": null,
  "is_video": false
}