{
  "author": "tanmay1010",
  "original_created_utc": 1642097148,
  "title": "Elizabeth Warren's ex staffer has filed a lawsuit against a Defi protocol after investing $10 in it. And nobody has realised OR could ever realise that the gigantic $10 investment was deliberate in order to file the lawsuit. No dots to connect here.",
  "created_utc": 1642105935,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A chap named Kent had invested $10 in a protocol called &amp;#39;PoolTogether&amp;#39; which essentially gamifies the process of saving by offering them a chance to win awards from the interest generated by collected funds.&lt;/p&gt;\n\n&lt;p&gt;A point to note here is- he was a part of Sen. Warren&amp;#39;s team during 2020 presidential elections and that in the lawsuit he&amp;#39;s described as someone who&amp;#39;s gravely concerned at the prospective use of the cryptocurrency. His &amp;#39;very legitimate&amp;#39; concerns are about climte change and crypto&amp;#39;s role in it, bad rug pulls, subversion of laws set by the society and so on.&lt;/p&gt;\n\n&lt;p&gt;The lawsuit in itself is not concerning but when you connect the dots on who filed the lawsuit and the purpose behind it- you see that this is but a malicious attempt of ridiculing crypto by only emphasizing a small proportion of use case. &lt;/p&gt;\n\n&lt;p&gt;A complete bullshittery continues still&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/s35jr7/elizabeth_warrens_ex_staffer_has_filed_a_lawsuit/",
  "subreddit": "CryptoCurrency",
  "id": "s35jr7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A chap named Kent had invested $10 in a protocol called 'PoolTogether' which\nessentially gamifies the process of saving by offering them a chance to win\nawards from the interest generated by collected funds.\n\nA point to note here is- he was a part of Sen. Warren's team during 2020\npresidential…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ケントという男性が、「PoolTogether」というプロトコルに10ドル投資していた。\n貯蓄のプロセスをゲーム化し、賞金を獲得するチャンスを提供します。\n集めた資金から発生する利子で賞金を得ることができる。\n\nここで注目すべきは、彼が2020年のウォーレン上院議員のチームの一員であったことです。\n大統領選...",
      "title": "Elizabeth Warrenの元スタッフが、Defiプロトコルに10ドルを投資した後、訴訟を起こしました。そして、この10ドルという巨額の投資が、訴訟を起こすために意図的に行われたものであることに、誰も気づいていないし、気づきようもない。ここでつながる点はない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个名叫肯特的小伙子在一个名为 \"PoolTogether \"的协议中投资了10美元，该协议\n该协议本质上是将储蓄过程游戏化，为他们提供机会，从收集的资金产生的利息中赢得奖励。\n从收集的资金所产生的利息中获得奖励。\n\n这里需要注意的一点是--他是沃伦参议员在2020年期间的团队的一部分。\n总统选举",
      "title": "伊丽莎白-沃伦的前工作人员在投资10美元后对一项Defi协议提起了诉讼。而且没有人意识到或可能意识到，这10美元的巨额投资是为了提起诉讼而故意的。这里没有任何线索可供联系。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個名叫肯特的小夥子在一個名爲 \"PoolTogether \"的協議中投資了10美元，該協議\n該協議本質上是將儲蓄過程遊戲化，爲他們提供機會，從收集的資金產生的利息中贏得獎勵。\n從收集的資金所產生的利息中獲得獎勵。\n\n這裏需要注意的一點是--他是沃倫參議員在2020年期間的團隊的一部分。\n總統選舉",
      "title": "伊麗莎白-沃倫的前工作人員在投資10美元后對一項Defi協議提起了訴訟。而且沒有人意識到或可能意識到，這10美元的鉅額投資是爲了提起訴訟而故意的。這裏沒有任何線索可供聯繫。"
    }
  ]
}