{
  "author": "valciro123",
  "the_new_excerpt": "Ok so , my experience with cryptos in my first 2 months: I managed to double my\nfirst investment, 2k, to 4k,and now I am left with only 200$. How? Emotional\ntrades and no patience at all, and also going all in on stuff. Went all in on\nalgo pegged coins, they crashed like 90% and I sold at loss. Now…",
  "original_created_utc": 1616857323,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好了，我的经验与加密货币在我的头2个月。我设法把我的\n第一笔投资，2k，到4k，现在我只剩下200元。怎么办？情绪化\n交易，而且完全没有耐心，还全身心地投入到东西上。全力以赴\nAlgo钉住硬币，他们崩溃了 像90％，我卖了亏损。现在...",
      "title": "如何在牛市中损失殆尽"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，我的經驗與加密貨幣在我的頭2個月。我設法把我的\n第一筆投資，2k，到4k，現在我只剩下200元。怎麼辦？情緒化\n交易，而且完全沒有耐心，還全身心地投入到東西上。全力以赴\nAlgo釘住硬幣，他們崩潰了 像90％，我賣了虧損。現在...",
      "title": "如何在牛市中損失殆盡"
    }
  ],
  "title": "How to lose all in a bull market",
  "created_utc": 1616887832,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok so , my experience with cryptos in my first 2 months: I managed to double my first investment, 2k, to 4k,and now I am left with only 200$. How? Emotional trades and no patience at all, and also going all in on stuff. Went all in on algo pegged coins, they crashed like 90% and I sold at loss. Now by the way so far they are going up again, don&#39;t know if they will go up more but I would be with 1k now if I didn&#39;t sell, which wasn&#39;t even that bad. I would like to say that I learned lesson, I hope that I did. I saw incredible opportunities for making money, I had cakes bought for 9$ could have hold that and I\nwould&#39;ve been in insane gain right now. I feel like trash because I really did the worse, buy high sell at almost the bottom, literally from like 10 options or even more I choosed the worse one, and now I don&#39;t even have more fiat and I feel like I will miss the bull market... I feel shit</p>\n</div><!-- SC_ON -->",
  "score": 223,
  "permalink": "/r/CryptoCurrency/comments/mefgi7/how_to_lose_all_in_a_bull_market/",
  "subreddit": "CryptoCurrency",
  "id": "mefgi7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357137107
}