{
  "author": "19Ant91",
  "original_created_utc": 1646290453,
  "title": "If memories are synaptic connections in the brain, how are we able to learn/memorize things so quickly?",
  "created_utc": 1646297867,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As I understand it, synapses are neurons making contact with one another. So to make new synapses, the neurons would have to change on a cellular level. Surely this would take hours, or possibly days (or more) to happen.&lt;/p&gt;\n\n&lt;p&gt;So why is it, if (for example) someone tells me their name, I&amp;#39;m sometimes able to remember it immediately for a very long time despite only being exposed to that information for far too short of a time for my brain to physically change?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/askscience/comments/t5lkfk/if_memories_are_synaptic_connections_in_the_brain/",
  "subreddit": "askscience",
  "id": "t5lkfk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As I understand it, synapses are neurons making contact with one another. So to\nmake new synapses, the neurons would have to change on a cellular level. Surely\nthis would take hours, or possibly days (or more) to happen.\n\nSo why is it, if (for example) someone tells me their name, I'm sometimes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、シナプスは神経細胞同士が接触しているものです。ですから\n新しいシナプスを作るには、神経細胞が細胞レベルで変化する必要があります。確かに\nこのようなことが起こるには、何時間も、あるいは何日も（あるいはそれ以上）かかるでしょう。\n\nでは、なぜかというと、（例えば）誰かが自分の名前を言ったとき、私は時々...",
      "title": "もし、記憶が脳のシナプス結合だとしたら、なぜ私たちはそんなに早く物事を学習／記憶することができるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我的理解，突触是神经元之间的接触。因此，为了\n形成新的突触，神经元就必须在细胞水平上发生变化。当然\n这需要几个小时，或可能几天（或更长时间）才能发生。\n\n那么，为什么如果（例如）有人告诉我他们的名字，我有时会...",
      "title": "如果记忆是大脑中的突触连接，我们如何能够如此迅速地学习/记忆事物？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我的理解，突觸是神經元之間的接觸。因此，爲了\n形成新的突觸，神經元就必須在細胞水平上發生變化。當然\n這需要幾個小時，或可能幾天（或更長時間）才能發生。\n\n那麼，爲什麼如果（例如）有人告訴我他們的名字，我有時會...",
      "title": "如果記憶是大腦中的突觸連接，我們如何能夠如此迅速地學習/記憶事物？"
    }
  ]
}