{
  "author": "switchere",
  "the_new_excerpt": "Japanese game developer, public company Nexon bought 1,717 bitcoins for about\n$100 million at an average exchange rate of about $58,200. President and CEO\nOwen Mahoney explained that the investment represented less than 2% of Nexon's\ntotal funds.\n\n> \"In the current economic climate, bitcoin offers…",
  "original_created_utc": 1619693838,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "日本のゲーム開発会社、上場企業のネクソンは、1,717ビットコインを約1億ドルで購入しました。\n平均為替レート約58,200円で1億ドルを購入しました。社長兼CEOの\nOwen Mahoney氏は、この投資はNexon社の総資金の2％未満であると説明しています。\nと説明しています。\n\n> 「現在の経済状況の中で、ビットコインは提供...",
      "title": "日本のゲーム開発会社ネクソンが1億ドル相当のビットコインを購入"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "日本游戏开发商，上市公司Nexon购买了1717个比特币，价格约为\n1亿美元，平均汇率约为58,200美元。总裁兼首席执行官\nOwen Mahoney解释说，这项投资只占Nexon总资金的不到2%。\n总资金的2%。\n\n> \"在目前的经济环境下，比特币提供...",
      "title": "日本游戏开发商Nexon购买了价值1亿美元的比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "日本遊戲開發商，上市公司Nexon購買了1717個比特幣，價格約爲\n1億美元，平均匯率約爲58,200美元。總裁兼首席執行官\nOwen Mahoney解釋說，這項投資只佔Nexon總資金的不到2%。\n總資金的2%。\n\n> \"在目前的經濟環境下，比特幣提供...",
      "title": "日本遊戲開發商Nexon購買了價值1億美元的比特幣"
    }
  ],
  "title": "Japanese game developer Nexon bought $100 million worth of bitcoins",
  "created_utc": 1619710237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Japanese game developer, public company Nexon bought 1,717 bitcoins for about $100 million at an average exchange rate of about $58,200. President and CEO Owen Mahoney explained that the investment represented less than 2% of Nexon&#39;s total funds.</p>\n\n<blockquote>\n<p>&quot;In the current economic climate, bitcoin offers long-term stability and liquidity while preserving the value of our funds for future investments,&quot; Mahoney said. Bitcoin is likely to retain its value, he said, even if it is not yet widespread.</p>\n</blockquote>\n\n<p>Nexon was founded in 1994. It develops online games. Nexon went public on the Tokyo Stock Exchange in December 2011. The company currently operates more than 50 online games in more than 190 countries.</p>\n\n<p>Earlier, the Hong Kong technology company Meitu, which produces smartphones and develops software, brought its investments in cryptocurrency to $100 million.</p>\n\n<p>At the same time, Elon Musk&#39;s Tesla announced that it sold $272 million worth of bitcoins at the end of March, with a profit of $101 million. The automaker&#39;s CFO, Zach Kirkhorn, stressed that the company believes in the long-term value of bitcoin and intends to maintain current assets in cryptocurrency and continue to accumulate coins received as payment for cars.</p>\n\n<p>The largest bitcoin holder among public companies is MicroStrategy. According to Bitcoin Treasuries, it owns 91,500 BTC worth about $5 billion.</p>\n</div><!-- SC_ON -->",
  "score": 333,
  "permalink": "/r/Bitcoin/comments/n11u38/japanese_game_developer_nexon_bought_100_million/",
  "subreddit": "Bitcoin",
  "id": "n11u38",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380957432
}