{
  "author": "DontTrustJack",
  "the_new_excerpt": "I have seen these kind of posts many times myself. \"This wouldn't happen to me,\nI'm very careful in the crypto world\" Well, I'm here to tell you that if my\nfunds get stolen this easily, yours can too.\n\nBefore we start: I haven't given anyone any kind of info. I have been in crypto\nlong enough to…",
  "original_created_utc": 1619594252,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私自身、このような書き込みを何度も見てきました。\"これは私には起こらないでしょう。\n私の資金がこんなに簡単に盗まれるなら、あなたの資金も盗まれる可能性があるということをお伝えします。\n私の資金がこんなに簡単に盗まれるなら、あなたの資金も盗まれる可能性があります。\n\n始める前に。私は誰にも何の情報も教えていません。私は暗号の世界に長くいます。\n十分な期間...",
      "title": "そして、3年半の長い間、暗号化に取り組んだ後... ハッキングされて資金を盗まれました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我自己也看过很多次这样的帖子。\"这不会发生在我身上。\n我在加密货币世界里非常小心\"。\n资金这么容易被盗，你的也可以。\n\n在我们开始之前。我没有给任何人任何形式的信息。我已经在加密货币\n足够长的时间来...",
      "title": "在经历了漫长的3.5年的加密货币之后... 我被黑了，我的资金被偷了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我自己也看過很多次這樣的帖子。\"這不會發生在我身上。\n我在加密貨幣世界裏非常小心\"。\n資金這麼容易被盜，你的也可以。\n\n在我們開始之前。我沒有給任何人任何形式的信息。我已經在加密貨幣\n足夠長的時間來...",
      "title": "在經歷了漫長的3.5年的加密貨幣之後... 我被黑了，我的資金被偷了"
    }
  ],
  "title": "And after a long 3,5 years in crypto... I got hacked and my funds were stolen",
  "created_utc": 1619624849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen these kind of posts many times myself. &quot;This wouldn&#39;t happen to me, I&#39;m very careful in the crypto world&quot; \nWell, I&#39;m here to tell you that if my funds get stolen this easily, yours can too.</p>\n\n<p>Before we start: I haven&#39;t given anyone any kind of info. I have been in crypto long enough to know its the wild west of the finance world. I&#39;ve done my research, I like trading, I like watching people make gains and or be passionate about crypto. Normally you would know where you messed up but this time....I don&#39;t even know how it happened....</p>\n\n<p>One day Im sitting there waiting for my XLM orders to get filled and Im getting this random email that someone from SWEDEN??? ( I live close to germany ) was accessing my account. Immediately I went onto my email to stop anything from happening but it was too late already ( I later found out ). He must have had access to my email as well because you cannot log into bittrex without an email verification code. But that makes it worse because my email is 2FA&#39;d with my phone number so how could he have accessed my account(s)? It&#39;s just mind blowing honestly. I&#39;m a very &#39; safe &#39; kinda guy and I don&#39;t do random stuff online which could endanger my funds. Go back to my early posts you&#39;ll find me asking questions on different subs about crypto and other related things to it.</p>\n\n<p>Sooo.. About $1.5k got stolen from my bittrex account</p>\n\n<p>Ikr? <strong>WHO EVEN USES BITTREX LMAO</strong> Well I did because I never had problems with them. When my account got verified in 2017 the exchange itsself was ok but the customer service was horrible. They have low liquidity but the exchange works fine. Anyways the customer service played a big role in this. I didnt even know I was hacked until I got my account back today and saw that the swedish thief ( probably VPN ) stole it that day ( end of March ).I then lost access to my account ( I froze my account that day ) had to start KYC all over again which took more than a month only to find out some random guy stole 0.03 BTC. I can&#39;t believe that after 3,5 years this <strong>garbage</strong> exchange still hasn&#39;t improved its customer service. I thought they would have had it fixed by now since there is so much competition... Nope, their service is <strong>garbage</strong></p>\n\n<p>I know the ins and outs of this sub so the first comment will be, always keep your funds in cold storage. No. You can&#39;t do that if you are a trader like me. You have to have some $ on the exchange to be able to trade.</p>\n\n<p>My advice: get off Bittrex asap, if you haven&#39;t already. ( Like, right now go withdraw your funds ). </p>\n\n<p>Nothing else to say, not even that mad</p>\n</div><!-- SC_ON -->",
  "score": 424,
  "permalink": "/r/CryptoCurrency/comments/n09amg/and_after_a_long_35_years_in_crypto_i_got_hacked/",
  "subreddit": "CryptoCurrency",
  "id": "n09amg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212038
}