{
  "author": "partymsl",
  "original_created_utc": 1658175170,
  "title": "Three Arrows Capital founder bought a $50M yacht with borrowed funds for his company. Now his company is bankrupt but he probably not.",
  "created_utc": 1658213087,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few weeks ago 3AC has collapsed and filed for a Chapter 11 bankruptcy. Some reasons have been the LUNA-UST collapse but also a very bad business model of the exchange where the crypto hedge fund basically just borrowed money from many other companies without every repaying that and now even those companies are going bankrupt.&lt;/p&gt;\n\n&lt;p&gt;So what did they do with that borrowed money, obviously they used it to improve their project and safety for their customers. Well from the $72M borrowed from Celsius, $50M directly went to the founder Su Zhu and he bought a yacht with that money.&lt;/p&gt;\n\n&lt;p&gt;I mean apperantly the project was always supposed to be a total scam and their team never took it serious. Sadly there are still such projects out there so be careful what you trust in.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/w28yt5/three_arrows_capital_founder_bought_a_50m_yacht/",
  "subreddit": "CryptoCurrency",
  "id": "w28yt5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A few weeks ago 3AC has collapsed and filed for a Chapter 11 bankruptcy. Some\nreasons have been the LUNA-UST collapse but also a very bad business model of\nthe exchange where the crypto hedge fund basically just borrowed money from many\nother companies without every repaying that and now even those…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数週間前、3ACが破綻し、連邦破産法第11条の適用を申請しました。その理由は\nLUNA-USTの破綻が原因ですが、取引所のビジネスモデルが非常にまずかったことも原因です。\nこの取引所は、暗号ヘッジファンドが基本的に他の多くの会社からお金を借りて、その返済をせずに\nそのため、このような事態になりました。",
      "title": "スリーアローズキャピタルの創業者が会社のために借り入れ資金で5,000万円のヨットを購入した。今、彼の会社は倒産しているが、彼はおそらく倒産していない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几周前，3AC已经倒闭，并申请了破产保护。一些\n一些原因是LUNA-UST的崩溃，但也有一个非常糟糕的商业模式。\n交易所的商业模式非常糟糕，加密货币对冲基金基本上只是从许多公司借钱，而没有偿还。\n其他公司的钱，而不去偿还，现在甚至那些...",
      "title": "三箭资本创始人用借来的资金为其公司购买了一艘5000万美元的游艇。现在他的公司破产了，但他可能没有。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾周前，3AC已經倒閉，並申請了破產保護。一些\n一些原因是LUNA-UST的崩潰，但也有一個非常糟糕的商業模式。\n交易所的商業模式非常糟糕，加密貨幣對沖基金基本上只是從許多公司借錢，而沒有償還。\n其他公司的錢，而不去償還，現在甚至那些...",
      "title": "三箭資本創始人用借來的資金爲其公司購買了一艘5000萬美元的遊艇。現在他的公司破產了，但他可能沒有。"
    }
  ]
}