{
  "author": "magnitorepulse",
  "the_new_excerpt": " * Disclaimer 1: I'm a novice. I'm informing you of what I'm aware of, and what\n   I know of. I would extremely appreciate it if commenters can post some DD or\n   any related facts on the topic.\n * Disclaimer 2: This is based on my current understanding, which may be\n   incorrect. If you object to…",
  "original_created_utc": 1612765553,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": " * 声明1：我是个新手。我把我所知道的，和我所知道的告诉你。\n   我知道： 如果评论者能发一些DD或。\n   任何相关的事实的主题。\n * 免责声明2：这是基于我目前的理解，可能会有偏差。\n   不正确的。 - 如果你反对... 如果你反对...",
      "title": "DD：09年2月GME和其他股票的短息报告是如何造假的，为什么你要注意。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " * 聲明1：我是個新手。我把我所知道的，和我所知道的告訴你。\n   我知道： 如果評論者能發一些DD或。\n   任何相關的事實的主題。\n * 免責聲明2：這是基於我目前的理解，可能會有偏差。\n   不正確的。 - 如果你反對... 如果你反對...",
      "title": "DD：09年2月GME和其他股票的短息報告是如何造假的，爲什麼你要注意。"
    }
  ],
  "title": "DD: How the short interest report for GME and other stocks on Feb 09 could be falsified, and why YOU should pay attention.",
  "created_utc": 1612795408,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li><strong>Disclaimer 1:</strong> I&#39;m a novice. I&#39;m informing you of what I&#39;m aware of, and what I know of. I would extremely appreciate it if commenters can post some DD or any related facts on the topic.</li>\n<li><strong>Disclaimer 2: This is based on my current understanding, which may be incorrect.</strong> <strong>If you object to any of the points I make, please make them clear in the comments and state why.</strong></li>\n<li><strong>Disclaimer 3:</strong> I&#39;m not a financial advisor, and this is my PERSONAL opinion.</li>\n<li><strong>Disclaimer 4:</strong> This post is making the assumption that you already believe, or at least believe in the possibility, that hedge funds have not covered and the squeeze has not squoze. If you don&#39;t, just see the hundreds of DD&#39;s floating around on this topic. Here&#39;s the most recent one I read by <a href=\"https://www.reddit.com/user/RubinoffButtChug69/\">u/RubinoffButtChug69</a></li>\n</ul>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/ldjbg1/analysis_on_why_hedge_funds_didnt_reposition_last/?utm_medium=android_app&amp;utm_source=share\">https://www.reddit.com/r/wallstreetbets/comments/ldjbg1/analysis_on_why_hedge_funds_didnt_reposition_last/?utm_medium=android_app&amp;utm_source=share</a></p>\n\n<ul>\n<li><strong>Disclaimer 5: If you disagree and think the squeeze has squoze, then I really have no idea why you&#39;re wasting your time and energy reading this and posting negative comments with your paper hands.</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>In my DD below, I will post links to where I&#39;m getting my information in the [1], [2], [3], [4], [5], etc; at the end of the sentence. Matching numbers means it&#39;s the same link.</p>\n\n<p>_________________________________________________________________________________________________________</p>\n\n<h1>Some background information</h1>\n\n<blockquote>\n<p>&quot;FINRA requires firms to report short interest positions in all customer and proprietary accounts in all equity securities twice a month. &quot; <a href=\"https://www.finra.org/filing-reporting/regulatory-filing-systems/short-interest#overview\">[1]</a></p>\n</blockquote>\n\n<p>The next reporting date is Feb 09th. where data from January 15 - January 29th will be reported. This information must be sent to FINRA by February 02<sup>nd</sup>. <a href=\"https://www.finra.org/filing-reporting/regulatory-filing-systems/short-interest#overview\">[1]</a></p>\n\n<p>This reporting is what nearly all other markets use as a reference point. For example, NASDAQ references the use of FINRA as the source of their short interest <a href=\"http://www.nasdaqtrader.com/trader.aspx?id=shortintpubsch\">[2]</a></p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;Member firms that have short positions in OTC equity securities and in securities listed on a national securities exchange, such as NASDAQ, NYSE, NYSE American, NYSE Arca, Cboe BZX, and IEX, must file a Short Position Report with FINRA via the Web-based system&quot;  <a href=\"https://www.finra.org/filing-reporting/short-interest/regulation-filing-applications-instructions\">[11]</a></p>\n</blockquote>\n\n<p>_________________________________________________________________________________________________________</p>\n\n<h1>What is my concern?</h1>\n\n<p>My concern lies with the potential of firms to inaccurately report their short interest levels to FINRA. From my understanding, it is the short investment <strong>firms</strong> that send these reports to FINRA, and not the company itself [Gamestop].</p>\n\n<p>What is the reasoning behind my concern? <strong>It is the penalty/fines for frauding the short interest that is the issue.</strong> In the most simple terms: The amount fined is extremely low.</p>\n\n<p>_________________________________________________________________________________________________________</p>\n\n<h1>Some examples of fines in the past:</h1>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>FINRA fines NOMURA <strong>$300,000</strong> for violations of short interest <a href=\"https://financefeeds.com/finra-fines-nomura-violations-short-interest-reporting-requirements/\">[3]</a>  </p>\n\n<p>FINRA fines Barclays Capital Inc. <strong>$125,000</strong> for failure to accurately report short interest positions<a href=\"https://financefeeds.com/finra-fines-barclays-capital-failure-accurately-report-short-interest-positions/\">[4]</a>  </p>\n\n<p>FINRA fines Morgan Stanly &amp; Co. LLC $<strong>2 million</strong> for short interest reporting and short sale rule violations <a href=\"https://www.finra.org/media-center/news-releases/2015/finra-fines-morgan-stanley-2-million-short-interest-reporting-and-short\">[5]</a>  </p>\n\n<p>FINRA fines Oppenheimer <strong>$275,000</strong> over short-interest reports <a href=\"https://www.finra.org/media-center/news-releases/2015/finra-fines-morgan-stanley-2-million-short-interest-reporting-and-short\">[6]</a>  </p>\n\n<p>FINRA fines Albert Fried &amp; Company <strong>$27,500</strong> for failing to report 28 short positions, totaling 8,757,100 shares <a href=\"https://www.finra.org/media-center/news-releases/2015/finra-fines-morgan-stanley-2-million-short-interest-reporting-and-short\">[7]</a></p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p><strong>Slightly related:</strong></p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>FINRA fines Citadel <strong>$700,000</strong> for allegedly breaching FINRA Rule 5320: Prohibition against trading ahead of customer orders. And Rule 6460: Display of Customer Limit orders. <a href=\"https://www.bloomberg.com/news/articles/2020-07-21/citadel-securities-fined-by-finra-for-trading-ahead-of-clients\">[8]</a>  </p>\n\n<p>FINRA fines Robinhood <strong>1.25 Million</strong> for best execution violations related to customers&#39; equity orders.<a href=\"https://www.finra.org/media-center/newsreleases/2019/finra-fines-robinhood-financial-llc-125-million-best-execution\">[9]</a>  </p>\n\n<p>FINRA fines Melvin securities <strong>$15,000</strong> for failing to make, and keep an accurate trail balance, general ledger, and net capital calculation by failing to timely accrue liabilities for certain invoices <a href=\"https://www.finra.org/sites/default/files/publication_file/Disciplinary_Actions_January_2019.pdf\">[10]</a> (found on page 3 of the link)</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p><strong>I hope you&#39;re starting to see the pattern here. These &quot;fines&quot; are just repulsively low in the grand scheme of the companies.</strong></p>\n\n<p>_________________________________________________________________________________________________________</p>\n\n<h1>How does this relate to GME?</h1>\n\n<p>If you haven&#39;t been living underneath a rock the past two weeks, you should know about all the market manipulation going on for GME. All the short ladder attacks against GME by hedge funds, all the media manipulation, the brokerages restricting GME orders and plummeting the price, the immense failure-to-deliver orders on GME; There&#39;s honestly way too much to list.</p>\n\n<p>Hedge funds are spending millions, tens of millions, hundreds of millions, every single day for these strategies and to pay off the interest on their expired short interest and failure-to-deliver positions.</p>\n\n<p>Do you really think they wouldn&#39;t pay a million-dollar fine in order to save billions on their short position?</p>\n\n<p>_________________________________________________________________________________________________________</p>\n\n<h1>Get your tinfoil hats ready</h1>\n\n<p>A lot of people are waiting on the February 09th date to decide what to do with their GME stock positions. We will probably see the wildest price fluctuations on the 9th, whether it soars or plummets. I know, I know, most people here will HOLD GME to the god damn ground. But unfortunately, a lot of people are looking at the February 9th date to understand the situation.</p>\n\n<p>And Hedge funds should know that.</p>\n\n<p>They should be aware that, if the Feb 09th report is accurate, it will show their short-positions. It will rally the stock again, and it will soar to the moon. At that point, there isn&#39;t much they can do to manipulate the stock. Everyone will know they lied to the media about covering their positions, and won&#39;t believe a thing they say. Everyone will have moved on to a real brokerage by then and can execute trades again.</p>\n\n<p><strong>So why haven&#39;t they covered yet?</strong></p>\n\n<p>In my eyes, there are three possible reasons why they haven&#39;t covered their position yet.</p>\n\n<ol>\n<li>They&#39;re waiting for the February 09th date. After the short interest report is released (and it inaccurately shows the low short-interest due to fraud) there will be a huge selloff in the next few days. They will probably cover their positions a few days/week after February 09th: as the GME stock will have had plenty of time to react and fall in light of news of the fraud short-interest. At some point, the increasing interest in their expired short-positions and failure to delivers will outweigh the decreasing GME stock, and they will cover. They would also want to sell this before FINRA catches wind of this, and publicly announces that there was fraud regarding GME short interest (I personally think it takes FINRA a while to discover these things, so don&#39;t count on it. But GME might be an exception they&#39;re eyeing due to all the attention surrounding it)</li>\n<li>They&#39;re going to cover on February 08th, before the news is released. They will use everything they have left at their disposal, all the media attacks, the short ladders, EVERYTHING. They will bring the price as low as they possibly can, and close out their positions towards the end of the market day. If we see huge downwards movement tomorrow despite low volume, this is probably what is happening.</li>\n<li>They are somehow clueless that the short-interest report on Feb 09th will cause a retaliation of the stock, and increase the volume. The stock will rise immensely within days, and they will be caught with their pants under their ass. The paper hands will again see their opportunity, and join back into the stock as the price keeps rising</li>\n</ol>\n\n<p>_________________________________________________________________________________________________________</p>\n\n<h1>What should you do?</h1>\n\n<p>If the short interest report comes out, and you believe, based on your DD and research, that the short-interest levels simply don&#39;t match up to what they should be: You should <strong>HOLD.</strong></p>\n\n<p><strong>HOLD</strong> through the crash. <strong>HOLD</strong> through the FUD.</p>\n\n<p>The shorts will cover a few days/week after Feb 09th, and there will be a very indicative spike in volume and price. This will also probably be followed with momentary confused hype around the stock for a few days, further increasing the price. Keep an eye out for these days!!!</p>\n\n<p>_________________________________________________________________________________________________________</p>\n\n<h1>TL;DR</h1>\n\n<p>There is a possibility the February 09th release of Short-Interest info will be fake, frauded. This is because the fine/penalty for reporting false information is EXTREMELY LOW (anywhere from 100k to 2 million on average in the past). Hedge funds will save BILLIONS by taking that measly 1 million fine. They already are spending millions every day on interest for their expired short and failure-to-deliver positions, short ladders, media manipulation, etc strategies.</p>\n\n<p>Be prepared to HOLD through this. Expect them to cover their positions after a few days/week after the rising interest cost of their expired short position and FTD &gt; the continued decreasing price in GME</p>\n\n<p>At the very least, just read the &quot;So why haven&#39;t they covered&quot; part of my DD so you know what MIGHT happen in the next few days and what to do.</p>\n</div><!-- SC_ON -->",
  "score": 3309,
  "permalink": "/r/wallstreetbets/comments/lf5tkc/dd_how_the_short_interest_report_for_gme_and/",
  "subreddit": "wallstreetbets",
  "id": "lf5tkc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123217878
}