{
  "author": "EtTuBrute31544",
  "original_created_utc": 1627478965,
  "title": "Why Bitcoin is really a “threat”:",
  "created_utc": 1627548236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think what we are seeing is that Gov is grabbing on to control. They realize that the internet and now BTC, has allowed for average people to liberate themselves from their control. This causes an overreaction to institute MORE control. Which causes people - especially Americans in which FREEDOM has been engrained in our mindset - to resist against this control measure. I find no use in “government”. This does not mean we don’t have governance - just not an anointed group to tell us how to live.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/Bitcoin/comments/ot9xh4/why_bitcoin_is_really_a_threat/",
  "subreddit": "Bitcoin",
  "id": "ot9xh4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think what we are seeing is that Gov is grabbing on to control. They realize\nthat the internet and now BTC, has allowed for average people to liberate\nthemselves from their control. This causes an overreaction to institute MORE\ncontrol. Which causes people - especially Americans in which FREEDOM…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちが見ているのは、Govが支配権を握っているということだと思います。彼らは\nインターネット、そして今ではBTCによって、平均的な人々が彼らの支配から自分自身を解放することができるようになりました。\n解放することができるようになりました。これは、より多くのコントロールを導入するための過剰な反応を引き起こします。\nコントロール。その結果、人々、特にアメリカ人は自由を求めて...",
      "title": "ビットコインが本当に \"脅威 \"である理由。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为我们所看到的是，戈夫正在抓紧时间控制。他们意识到\n互联网和现在的BTC，让普通人可以从他们的控制中解放出来。\n摆脱他们的控制。这导致了一种过度反应，以建立更多\n控制。这导致人们--特别是美国人在自由方面...",
      "title": "为什么比特币真的是一种 \"威胁\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲我們所看到的是，戈夫正在抓緊時間控制。他們意識到\n互聯網和現在的BTC，讓普通人可以從他們的控制中解放出來。\n擺脫他們的控制。這導致了一種過度反應，以建立更多\n控制。這導致人們--特別是美國人在自由方面...",
      "title": "爲什麼比特幣真的是一種 \"威脅\"。"
    }
  ]
}