{
  "author": "gwordsworth",
  "the_new_excerpt": "I’m not an advocate for market timing nor am I an advocate for stock picking but\nI feel like we need this. Too many people are feeling regret for not buying a\ncertain stock or selling off too early! This is despite the fact the stock\ncould’ve just as easily gone down (long term) as many have, after…",
  "original_created_utc": 1608409731,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不是市场时机的倡导者，也不是选股的倡导者，但是\n我觉得我们需要这个。太多的人为没有买一件衣服而感到后悔。\n某些股票或过早抛售！这是尽管有这样一个事实，即该公司的股票\n在…之后，可能会像许多人一样容易地(长期)下跌",
      "title": "你很高兴你没有买哪个股票，因为他们继续往下走？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是市場時機的倡導者，也不是選股的倡導者，但是\n我覺得我們需要這個。太多的人爲沒有買一件衣服而感到後悔。\n某些股票或過早拋售！這是儘管有這樣一個事實，即該公司的股票\n在…之後，可能會像許多人一樣容易地(長期)下跌",
      "title": "你很高興你沒有買哪個股票，因爲他們繼續往下走？"
    }
  ],
  "title": "Which stocks are you glad you didn’t buy because they proceeded to tank?",
  "created_utc": 1608474848,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not an advocate for market timing nor am I an advocate for stock picking but I feel like we need this. Too many people are feeling regret for not buying a certain stock or selling off too early! This is despite the fact the stock could’ve just as easily gone down (long term) as many have, after purchase because nobody knows the future. They forget their reasons which must’ve been in line with their risk tolerance and the information they had at the time.</p>\n\n<p>Having said that, what stocks were you on the verge of buying and then decided against, which proceeded to tank? </p>\n\n<p>N.B This is purely an exercise on getting people to stop this hindsight bias that will inevitably lead to FOMO and losing money. Buy stocks you believe in long term unless company fundamentals change.</p>\n</div><!-- SC_ON -->",
  "score": 96,
  "permalink": "/r/investing/comments/kgfm3j/which_stocks_are_you_glad_you_didnt_buy_because/",
  "subreddit": "investing",
  "id": "kgfm3j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493089
}