{
  "author": "Hologram22",
  "original_created_utc": 1651809878,
  "title": "How much was the demise of American streetcars caused by nefarious actions by the automotive industry versus more subtle \"natural\" or \"market\" forces?",
  "created_utc": 1651859564,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was rewatching &lt;a href=\"https://youtu.be/oOttvpjJvAo\"&gt;a Climate Town video&lt;/a&gt;, the thesis of which is that GM et al. killed mass transit in a deliberate and successful attempt at creating car centric development and selling more cars. However, I&amp;#39;ve heard elsewhere, without detail, that the fuller story is more nuanced and doesn&amp;#39;t quite implicate the automotive industry as much as Rollie suggests. So what is that fuller story? Was America really duped by GM, or was there more going that ultimately killed the streetcar?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/ujf24v/how_much_was_the_demise_of_american_streetcars/",
  "subreddit": "AskHistorians",
  "id": "ujf24v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was rewatching a Climate Town video [https://youtu.be/oOttvpjJvAo], the thesis\nof which is that GM et al. killed mass transit in a deliberate and successful\nattempt at creating car centric development and selling more cars. However, I've\nheard elsewhere, without detail, that the fuller story is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Climate Townのビデオ[https://youtu.be/oOttvpjJvAo]を見返していた。\nこのビデオでは、GMと他の企業が、意図的に自動車を作るために大量輸送機関を破壊し、成功させたという論点を取り上げています。\nこのビデオでは、GMとその他の企業が、自動車中心の開発を行い、より多くの自動車を販売するために、意図的かつ成功裏に大衆交通を消したという論点を扱っています。しかし、私は\nしかし、私は他の場所で、詳細は不明だが、より完全なストーリーは...であると聞いた。",
      "title": "アメリカの路面電車の衰退は、自動車産業による悪質な行為と、もっと微妙な「自然」や「市場」の力によるものだったのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在重看一个气候小镇的视频[https://youtu.be/oOttvpjJvAo]，其中的论点是，通用汽车等公司故意成功地杀死了公共交通。\n其中的论点是，通用汽车等公司在故意和成功的情况下扼杀了大众交通\n试图创造以汽车为中心的发展和销售更多的汽车。然而，我在其他地方听说\n我在其他地方听说，没有详细说明，更完整的故事是......",
      "title": "美国有轨电车的消亡在多大程度上是由汽车工业的邪恶行为而非更微妙的 \"自然 \"或 \"市场 \"力量造成的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在重看一個氣候小鎮的視頻[https://youtu.be/oOttvpjJvAo]，其中的論點是，通用汽車等公司故意成功地殺死了公共交通。\n其中的論點是，通用汽車等公司在故意和成功的情況下扼殺了大衆交通\n試圖創造以汽車爲中心的發展和銷售更多的汽車。然而，我在其他地方聽說\n我在其他地方聽說，沒有詳細說明，更完整的故事是......",
      "title": "美國有軌電車的消亡在多大程度上是由汽車工業的邪惡行爲而非更微妙的 \"自然 \"或 \"市場 \"力量造成的？"
    }
  ]
}