{
  "author": "DarkRooster33",
  "the_new_excerpt": "Feel free to disprove me, but problem is people are eager to spread information\nand statistics without reading all of the words even in the title.\n\nTake a post here - If 95% of traders don't beat the market, why are so many\nstock subs so…",
  "original_created_utc": 1618973612,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私に対する反論はご自由にどうぞ。しかし問題は、人々が情報や統計を広めようとすることです。\n問題は、人々が情報や統計を広めようとする際に、タイトルに書かれている言葉をすべて読むことなく\n\n例えば、ここの投稿 - 95%のトレーダーが市場に勝てないなら、なぜ多くの株式サブスク...\n株のサブスクリプションはとても...",
      "title": "トレーダーがマーケットに勝てないのは95％がFALSE"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请随意反驳我，但问题是人们急于传播信息\n和统计数字，甚至不看标题中的所有文字。\n\n就拿这里的一个帖子来说吧--如果95%的交易者不能战胜市场，为什么这么多的\n股票子是如此...",
      "title": "95%的交易者无法战胜市场是错误的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請隨意反駁我，但問題是人們急於傳播信息\n和統計數字，甚至不看標題中的所有文字。\n\n就拿這裏的一個帖子來說吧--如果95%的交易者不能戰勝市場，爲什麼這麼多的\n股票子是如此...",
      "title": "95%的交易者無法戰勝市場是錯誤的"
    }
  ],
  "title": "95% of traders not being able to beat the market is FALSE",
  "created_utc": 1619002532,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Feel free to disprove me, but problem is people are eager to spread information and statistics without reading all of the words even in the title.</p>\n\n<p>Take a post here - <a href=\"https://www.reddit.com/r/stocks/comments/muwhxe/if_95_of_traders_dont_beat_the_market_why_are_so/\">If 95% of traders don&#39;t beat the market, why are so many stock subs so popular?</a></p>\n\n<p>The closest thing i can find is this - <a href=\"https://www.aei.org/carpe-diem/more-evidence-that-its-really-hard-to-beat-the-market-over-time-95-of-finance-professionals-cant-do-it/\">here</a></p>\n\n<p>Which states that 95% of <strong>finance professionals</strong> can&#39;t do it, nothing said about average retail trader what so ever. It measured fund performance.</p>\n\n<p>Why does that matter ? Well for one fund managers are bound by rules, companies interests and possibly wants to attract a lot of investors paying the fees for them to manage it all. For one thing you will never see a fund yolo his entire life savings into GME stock. You will never see a fund believing in Tesla from start to finish with their entire life savings etc. there are also going to be stock picks based on common sense, math, fundimentals more than someone just reading and liking a reddit post, retail traders/investors and finance professionals are living in 2 different worlds.</p>\n\n<p>&#x200B;</p>\n\n<p>Second statistics that goes around endlessly - <a href=\"https://www.curiousgnu.com/day-trading\">80% of day traders lose money</a></p>\n\n<p>Especially on reddit this gets spinned to as &#39;&#39;80% of traders lose money&#39;&#39;, but honestly there was nothing said about an average trader/investor. So if someone says that 80% of investors lose money, it is <strong>false</strong></p>\n\n<p>&#39;&#39; Day trading is a form of speculation in securities in which a trader buys and sells a financial instrument within the same trading day, such that all positions are closed before the market closes for the trading day to avoid unmanageable risks and negative price gaps between one day&#39;s close and the next day&#39;s price at the open. Traders who trade in this capacity are generally classified as speculators. Day trading contrasts with the long-term trades underlying buy and hold and value investing strategies. Day trading can be considered a form of gambling.[1][2] It is made easier using day trading software.[3] &#39;&#39;</p>\n\n<p>Here is the definition from wiki. So unless you constantly decide to buy and sell the stocks in the same day, you are probably not a day trader.</p>\n\n<p>Why do day traders lose money though ? You might want to take a look at day traders competition - high frequency trading - <a href=\"https://www.investopedia.com/ask/answers/09/high-frequency-trading.asp\">here</a></p>\n\n<p>&#x200B;</p>\n\n<p>The third statistics i often see cited was made in 90s, sadly i can&#39;t find the source upon googling, but i wouldn&#39;t really rely on 90s studies to begin with, because at the time retail investors probably read about stocks on news papers and internet wasn&#39;t even a thing to begin with. Different times, different mindsets.</p>\n\n<p>Am i saying that average retail investor beats the market ? <strong>Absolutely not</strong></p>\n\n<p>The general conscious is probably in the right ball park, but everyone loves to cite statistics that has nothing to do with retail investors which makes the saying that this many % of investors can&#39;t beat the market fundimentally <strong>false</strong>.</p>\n\n<p>If someone has more studies and actual studies on retail traders, throw them in comments, what i mostly see everyone citing is their inability to understand titles.</p>\n</div><!-- SC_ON -->",
  "score": 98,
  "permalink": "/r/stocks/comments/mv6rdd/95_of_traders_not_being_able_to_beat_the_market/",
  "subreddit": "stocks",
  "id": "mv6rdd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527442
}