{
  "author": "TossedAwayWith",
  "original_created_utc": 1656113269,
  "title": "I think there are cameras in my apartment. What do I do?",
  "created_utc": 1656155598,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I moved into an apartment this year. I don&amp;#39;t share walls but have neighbors above and below. At first it was fine. Two weeks into it, it&amp;#39;s the weekend and I can hear the upstairs neighbors having what sounds like a party. I enjoy a good time myself so I&amp;#39;m like great, possibly new friends.&lt;/p&gt;\n\n&lt;p&gt;I have the window open so I can hear them pretty well. Suddenly I hear the remark (male voice) &amp;quot;oh there&amp;#39;s a new tennant in (my unit number).&amp;quot; I figure they can see the lights are on in my unit (there are balconies) and are discussing it. Then I hear (female voice) &amp;quot;oh I wonder if he&amp;#39;s single&amp;quot; followed by (different female voice) &amp;quot;well let&amp;#39;s look him up&amp;quot; and this is where things start to get weird. I figure at worst case, there is some directory for the building (it&amp;#39;s kinda modern) where they can get my name and look for me on the internet. Whatever, no big deal, my internet presence is pretty locked down. Then I hear &amp;quot;looks like he IS single!&amp;quot; and I&amp;#39;m like uh what, how could they find that out about me online? And then I hear &amp;quot;I don&amp;#39;t care if he is single, I wanna see that d*ck!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;At this point I&amp;#39;m like what the fuck is going on? How could someone make a reference to wanting to see my d*ck? Maybe they&amp;#39;re swingers and I&amp;#39;m gonna get invited into something? But it felt more sinister. So now I&amp;#39;m freaked out and probably over sensitized to paying attention, but I try to brush it off as just being paranoid so I go about my night. &lt;/p&gt;\n\n&lt;p&gt;I had only recently moved in and did not have a ton of furniture so I had a makeshift area set up in my living room and didn&amp;#39;t have my TV and internet set up yet so I&amp;#39;m just listening to music (analog music). I continue to hear commentary that aligns a little too much with what I&amp;#39;m doing around the house, but again, I&amp;#39;m telling myself I&amp;#39;m just being paranoid and there&amp;#39;s no way what I&amp;#39;m feeling could be true. Eventually I head to bed for the night.&lt;/p&gt;\n\n&lt;p&gt;Next day I get up and I&amp;#39;m just like that was really f*cking weird but probably just some weird feeling taking over my thoughts so moving on. That is, I felt that way until I took a shower. The bathroom is quiet except for the very quiet and dull hum of the vent fan. The lights in the bathroom (including one in the shower) are recessed but missing their full casings so it&amp;#39;s almost a through to the ceiling void above between my ceiling and their floor. I start to again hear commentary that aligns with my actions... and then commentary about my body. &lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m in a combination of panic and denial. There&amp;#39;s no way people are this shitty and there&amp;#39;s no way there are cameras in my house, this has to be some mental reaction. However, I&amp;#39;ve never felt this way at any point in my life. I don&amp;#39;t feel this way in any location, even currently. I don&amp;#39;t have this constant feeling in my head of being watched. It only happens in my new apartment. &lt;/p&gt;\n\n&lt;p&gt;I start looking around, trying to find something that looks like a camera, and I can&amp;#39;t. I figure it must be in the ceiling or my vents (central air) but I can&amp;#39;t find anything obvious and I haven&amp;#39;t gone to the point of pulling apart the vent system. I&amp;#39;ve inspected the ceilings and do see some curious pairs of holes in various locations (like a pair of holes right next to each other, each maybe a nail in diameter, in a few locations in different rooms) but nothing that jumps out as a camera. I haven&amp;#39;t pulled the lighting fixtures to see if there&amp;#39;s anything in there. The commentary I hear has taken a turn, coming to the realization that I am aware I&amp;#39;m being watched but can&amp;#39;t figure it out. There is still commentary happening about me and if anything has gotten more sinister due to the fact they are aware I know but seem helpless. &lt;/p&gt;\n\n&lt;p&gt;What do I do? I don&amp;#39;t have proof of anything. I don&amp;#39;t think the commentary is loud enough to record by any device as it&amp;#39;s kinda muffled but I can make out what&amp;#39;s being said. I feel like even writing this out I just sound like a crazy person hearing voices. I&amp;#39;m certain that&amp;#39;s not it, because this phenomenon does not happen anywhere else I&amp;#39;ve ever been or presently go to. It is 100% tied to being in my apartment. But the notion that this makes me sound like a crazy person is stopping me from talking to anyone about it. I feel like I&amp;#39;m being violated in my private residence. It&amp;#39;s really f*cking me up. I&amp;#39;ve tried to commit to the notion that I&amp;#39;m wrong, or that I need to ignore the feelings, or that my mind is turning muffled sounds into something else, but it never sticks. There&amp;#39;s always something I hear that pulls me right back into it. It makes me question having people over my house for the sake of their privacy being violated.&lt;/p&gt;\n\n&lt;p&gt;How do I fix this? I looked up services on the internet that are essentially counter espionage or will sweep places for bugs, but they all look hack and fake like just looking to take people&amp;#39;s money. I can&amp;#39;t find anything that looks legit.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d have to break a lease to move out which would cost me a ton of money. I also don&amp;#39;t like the idea of having to come up with some reason for why I moved out of this awesome looking apartment that everyone loves. &lt;/p&gt;\n\n&lt;p&gt;Looking for some help here. Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/vk1drs/i_think_there_are_cameras_in_my_apartment_what_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "vk1drs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I moved into an apartment this year. I don't share walls but have neighbors\nabove and below. At first it was fine. Two weeks into it, it's the weekend and I\ncan hear the upstairs neighbors having what sounds like a party. I enjoy a good\ntime myself so I'm like great, possibly new friends.\n\nI have…"
}