{
  "author": "jmilla360",
  "original_created_utc": 1631487232,
  "title": "I gave each of my dogs $100 to invest in crypto. I will give them the rewards when they turn 18 (~3 dog years)",
  "created_utc": 1631493678,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Being a man of science who also loves his dogs and crypto, this was an opportunity I could not pass on. Like the title says, I &quot;gave&quot; each of my dogs $100 to invest in crypto and plan on giving them the rewards (probably in the form of special treats, food, toys) when they reach the appropriate age. </p>\n\n<p>For practical reasons I did not create accounts for them in an exchange, we will be using my account instead and I will be managing their funds for the time being. Just imagining how long the verification (kyc) process would take for them gave me a headache. Moreover, my dogs are still not very good using the keyboard or touchscreens, so it made more sense for me to do it.</p>\n\n<p>Even though I am technically managing the funds for them, they were actually the ones who decided which projects were worth investing in. In order to save time I decided it would be best to show them the logo of each crypto and read them the name, if they barked, that meant they wanted me to buy some. I decided to allocate their $100 in three equal parts among the first 3 projects they barked at. This way they would have a diverse portfolio.</p>\n\n<p>The results were the following:</p>\n\n<ul>\n<li>Gandalf the Beagle (DOGE, CAKE, SHIBA)</li>\n<li>Attila the Pug (DOGE, BAT, ADA)</li>\n</ul>\n\n<p>Like I said, the decision was theirs, I have to respect it. Gandalf was probably just hungry at the moment and thought I was offering him cake and the sight of a doge and shiba dogs made him happy. Attila probably chose doge for the same reason, and I guess he reacted at the word &quot;bat&quot; because he hates bats. At first I was surprised when he chose ADA. I thought he had probably been reading up on the project and read about the smart contracts being implemented today. Now I just thing he though I said &quot;ADA BOYYY&quot;. </p>\n\n<p>I will let you know how these investments turn out, remember it&#39;s important to think about your pets&#39; financial future as well.</p>\n</div><!-- SC_ON -->",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/pn32al/i_gave_each_of_my_dogs_100_to_invest_in_crypto_i/",
  "subreddit": "CryptoCurrency",
  "id": "pn32al",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Being a man of science who also loves his dogs and crypto, this was an\nopportunity I could not pass on. Like the title says, I \"gave\" each of my dogs\n$100 to invest in crypto and plan on giving them the rewards (probably in the\nform of special treats, food, toys) when they reach the appropriate…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "犬と暗号を愛する科学者として、これは\nこの機会を逃すことはできませんでした。タイトルにあるように、私は飼っている犬たちにそれぞれ100ドルを与えました。\n暗号に投資するために100ドルを与え、達成したらご褒美（おそらく特別なおやつ、食べ物、おもちゃ）を与える予定です。\n報酬（特別なおやつ、食べ物、おもちゃなど）を与える予定です。",
      "title": "私は愛犬たちに100ドルずつ渡して、暗号に投資してもらいました。彼らが18歳になったら報酬を渡す予定です（～3犬年）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个热爱科学的人，同时也热爱他的狗和加密货币，这是一个不能错过的机会。\n机会，我不能错过。正如标题所说，我给了我的每只狗\n100美元来投资加密货币，并计划在他们获得奖励（可能是以特殊的食物、食品和玩具的形式）时，给他们以奖励。\n奖励（可能是特殊待遇、食物、玩具等形式），当它们达到适当的水平时......",
      "title": "我给了我的每个狗100美元，让它们投资于加密货币。我将在他们18岁时给他们奖励（~3个狗年）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個熱愛科學的人，同時也熱愛他的狗和加密貨幣，這是一個不能錯過的機會。\n機會，我不能錯過。正如標題所說，我給了我的每隻狗\n100美元來投資加密貨幣，並計劃在他們獲得獎勵（可能是以特殊的食物、食品和玩具的形式）時，給他們以獎勵。\n獎勵（可能是特殊待遇、食物、玩具等形式），當它們達到適當的水平時......",
      "title": "我給了我的每個狗100美元，讓它們投資於加密貨幣。我將在他們18歲時給他們獎勵（~3個狗年）。"
    }
  ]
}