{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Monday, April 12, 2021\n\nStocks traded mostly even on Monday, with the market taking a breather after the\nS&P 500 (SPY) and Dow Jones (DIA) recorded several fresh highs last week.\nLooking ahead, market participants will focus on the upcoming Quarter 1 earnings\nreport slated to be…",
  "original_created_utc": 1618260652,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月12日（月\n\n月曜日の株式市場は、S&P 500(SPY)とDow Jones(DIA)が先週の最高値を記録した後に一息ついたこともあり、ほぼ互角に取引された。\nS&P 500(SPY)とダウ・ジョーンズ(DIA)は先週、いくつかの新高値を記録しました。\n先行きについては、市場参加者は、来るべき第1四半期の収益\n今後の見通しについては、市場参加者は、来たるべき第1四半期の業績報告に注目しています...",
      "title": "本日2021年4月12日（月）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月12日，星期一。\n\n周一股市交投大多平淡，市场在喘息后\n标普500指数(SPY)和道琼斯指数(DIA)上周录得多个新高。\n展望未来，市场参与者将重点关注即将到来的一季度财报\n报告定于...",
      "title": "以下是2021年4月12日（星期一）今天的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月12日，星期一。\n\n週一股市交投大多平淡，市場在喘息後\n標普500指數(SPY)和道瓊斯指數(DIA)上週錄得多個新高。\n展望未來，市場參與者將重點關注即將到來的一季度財報\n報告定於...",
      "title": "以下是2021年4月12日（星期一）今天的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Monday, April 12, 2021",
  "created_utc": 1618270302,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Monday, April 12, 2021</strong></p>\n\n<p>Stocks traded mostly even on Monday, with the market taking a breather after the S&amp;P 500 (SPY) and Dow Jones (DIA) recorded several fresh highs last week. Looking ahead, market participants will focus on the upcoming Quarter 1 earnings report slated to be released in the next weeks. Big banks are kicking off the earnings season starting Wednesday premarket. </p>\n\n<p>As earnings season kicks off, a slew of recent promising economic data has suggested corporate profits will jump in tandem with the recovering economy, especially in the sectors most heavily affected by the pandemic. Over the past several weeks, analysts have raised their earnings estimates by record levels with the expectation that recent economic growth will drive corporate earnings higher. According to FactSet, first-quarter <a href=\"https://insight.factset.com/record-high-increase-in-sp-500-eps-estimates-for-q1\">earnings estimates were increased by a record margin of 6%</a> over the past several weeks, as analysts adjusted their forecasts for the much stronger-than-expected economic rebound seen so far.</p>\n\n<p>Year-to-date, the cyclical, energy, financial, and reopening sectors have broadly outperformed growth and tech stocks that led the market higher last year. The first quarter of 2021 was defined by the rotation out of high-flying tech stocks and into companies poised to directly benefit from the reopening of the economy. However, now that Quarter 2 started, we are seeing the rotation back into growth and tech stocks, with mega-cap companies like Microsoft (MSFT), Apple (AAPL), and Alphabet (GOOG, GOOGL) driving the market to record levels. In our view, while we expect tech stocks to continue performing well, it is highly unlikely they replicate the outsized performance from 2020 and continue to look for opportunities in companies that were most affected by COVID and that are poised to benefit from the reopening of the economy. Ian Shepherdson, Chief Economist at Pantheon Macroeconomics, wrote in a note “The initial reopening of the economy will trigger a huge rebound in margins across sectors which have been hit hardest by the COVID crisis. The unprecedented surge in households&#39; cash balances over the past year – mostly due to the enforced drop in spending on services, augmented by stimulus payments – represents a potential wave of demand, while supply is constrained by business failures.”</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The US government posted a March budget deficit of $660 billion amid the recent wave of fiscal spending, a record high for the month.</li>\n<li>Shares of Alibaba (BABA) jumped after the company paid a record anti-trust fine, with analysts calling the fine removal of overhang. &quot;Positively, Alibaba does not expect further investigations on this matter, and we believe the removal of this overhang could be a positive for shares,&quot; Raymond James analyst Aaron Kessler, who rates shares of Alibaba as a strong buy, wrote in a note Monday morning. </li>\n<li>Microsoft (MSFT) announced Monday morning that it agreed to purchase artificial intelligence speech recognition company Nuance Communications (NUAN) in an all-cash transaction valued at $19.7 billion, including Nuance&#39;s debt. The announcement confirmed earlier reporting of the deal over the weekend by Bloomberg. </li>\n<li>Shares of United Airlines sank after the company provided a worse-than-expected outlook for upcoming Quarter 1 earnings.</li>\n<li>Gamestop (GME) is reportedly searching for a new CEO. </li>\n<li>Shares of Nvidia (NVDA) surged more than 5% after the company raised revenue outlook for the upcoming earnings report.<br/></li>\n<li>The virtual summit in the White House focusing on the global semiconductor shortage began today</li>\n<li>Electric vehicle startup Rivian, backed by Amazon (AMZN) and Ford Motor (F) said on Monday that South Korean manufacturer Samsung SDI Co Limited would supply battery cells for its vehicles.</li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday movement*\\</strong>*</li>\n<li>Alaska Air (ALK) target raised by Raymond James from $65 to $85 at Strong-Buy. Stock currently around $73</li>\n<li>Allstate (ALL) target raised by JP Morgan (JPM) from $127 to $130 at Overweight. Stock currently around $117</li>\n<li>Chubb (CB) target raised by Barclays from $178 to $187 AT Overweight. Stock currently around $161</li>\n<li>Comcast (CMCSA) target raised by Pivotal Research from $63 to $65 at Buy. Stock currently around $53</li>\n<li>Darden Restaurants (DRI) target raised by JP Morgan from $150 to $162 at Overweight. Stock currently around $143</li>\n<li>Microsoft (MSFT) target raised by BMO Capital from $270 to $280 at Outperform. Stock currently around $256</li>\n<li>Navient (NAVI) target raised by Barclays from $16 to $20 at Overweight. Stock currently around $15</li>\n<li>Raytheon Technologies (RTX) target raised by Susquehanna from $83 to $91 at Positive. Stock currently around $78</li>\n<li>Ultra Clean (UCTT) target raised by Needham &amp; Co from $55 to $65 at Buy. Stock currently around $55</li>\n</ul>\n\n<p>“Someone&#39;s sitting in the shade today because someone planted a tree a long time ago.” - Warren Buffet</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/stocks/comments/mpn2f3/here_is_a_market_recap_for_today_monday_april_12/",
  "subreddit": "stocks",
  "id": "mpn2f3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618925
}