{
  "author": "Cashmere_Cowboy",
  "the_new_excerpt": "Not sure how many of you are following whats going on in container and bulk\nshipping...? But, it may be worth your attention as they are going from strength\nto strength.\n\nFor those of you that haven't been keeping an eye, container rates have gone\nthrough the roof due to a bottleneck in the…",
  "original_created_utc": 1613148701,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不知道你们有多少人在关注集装箱和散装货的情况。\n运费...？但是，它可能值得你的关注，因为他们的实力在不断增强\n的力量。\n\n对于那些没有留意的人来说，集装箱的价格已经上升了。\n由于瓶颈的原因，通过屋顶...",
      "title": "航运股大涨! 值得一看!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不知道你們有多少人在關注集裝箱和散裝貨的情況。\n運費...？但是，它可能值得你的關注，因爲他們的實力在不斷增強\n的力量。\n\n對於那些沒有留意的人來說，集裝箱的價格已經上升了。\n由於瓶頸的原因，通過屋頂...",
      "title": "航運股大漲! 值得一看!"
    }
  ],
  "title": "Shipping stocks are on the rise! Worth a look!",
  "created_utc": 1613181442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not sure how many of you are following whats going on in container and bulk shipping...? But, it may be worth your attention as they are going from strength to strength.</p>\n\n<p>For those of you that haven&#39;t been keeping an eye, container rates have gone through the roof due to a bottleneck in the container market met with increased demand for consumer goods during the pandemic (ie. containers are logjam and can&#39;t keep pace with demand as people order more goods from China/amazon). Similar, there is a huge amount of demand for raw materials as countries make their way out of the pandemic with government stimulus. Much of this demand is currently being driven by &#39;Chinese Special Bonds&#39; (ie. more cheap money for infrastructure/raw materials).</p>\n\n<p>In the handysize vessel segment alone, day-rates have now surpassed 2011 highs. This trade should continue for a while as more government stimulus is pumped into the system, central banks keep rates low and countries begin exiting lockdown/pandemic. There is a huge pent up demand and big infrastructure projects underway. Just look at the Biden administration&#39;s environmental agenda! A good way to get exposure to the upside in shipping is buying companies with handysize fleets. Due to the parcel size of the non-ferrous metals, handysize vessels are the best fit for non-ferrous transport.</p>\n\n<p>An added bonus in Handysize at the moment is the fact that the fleet is aging (which means the oldest of them get scrapped) and the orderbook for new builds only makes  some 2% of current fleet. It takes 18 months (at least) to build a handysize so its not like the market can get flooded one day to the next. Demand currently far outstrips supply!</p>\n\n<p>I would recommend that everyone has a look at the segment. Not all alpha has to come from brick phones and movie theaters....</p>\n\n<p>If any of you find this trade idea interesting feel free to message or respond and I&#39;ll share a few stocks I&#39;ve analysed.</p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/stocks/comments/lif26d/shipping_stocks_are_on_the_rise_worth_a_look/",
  "subreddit": "stocks",
  "id": "lif26d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623030
}