{
  "author": "SkyDefender",
  "the_new_excerpt": "It was around april 20, i got invited that group via discord. There were\nthousands of people, you could ask any question to one admin but that was all.\nYou couldn’t talk with other members. They gave the date for the coin’s\nannouncement. April 25 midnight. Also they created telegram group with…",
  "original_created_utc": 1620723664,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "4月20日頃、Discordでそのグループに招待されました。何千人もの人がいて\n何千人もの人がいて、一人の管理者に何か質問をすることができましたが、それだけでした。\n他のメンバーと話すことはできませんでした。彼らはコインの発表の日付を\n発表されました。4月25日の深夜です。また、彼らはテレグラムグループを作成しました...",
      "title": "ポンプ・アンド・ダンプのグループに招待されて、彼らを観察する。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那是在4月20日左右，我通过discord被邀请到那个小组。当时有\n有几千人，你可以向一个管理员问任何问题，但这就是全部。\n你不能和其他成员交谈。他们给出的日期是硬币的\n宣布。4月25日午夜。他们还创建了电报组，其中包括...",
      "title": "我被邀请参加一个泵和倾倒小组，为你观察他们的情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那是在4月20日左右，我通過discord被邀請到那個小組。當時有\n有幾千人，你可以向一個管理員問任何問題，但這就是全部。\n你不能和其他成員交談。他們給出的日期是硬幣的\n宣佈。4月25日午夜。他們還創建了電報組，其中包括...",
      "title": "我被邀請參加一個泵和傾倒小組，爲你觀察他們的情況"
    }
  ],
  "title": "I get invited to a pump and dump group and observe them for you",
  "created_utc": 1620740522,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It was around april 20, i got invited that group via discord. There were thousands of people, you could ask any question to one admin but that was all. You couldn’t talk with other members. They gave the date for the coin’s announcement. April 25 midnight. Also they created telegram group with thousands of people aswell. </p>\n\n<p>Coin announced exactly at midnight, it was rdn/btc. But 10 seconds later it was already too late, it hit ath and dropped to ground again. </p>\n\n<p>So who won? Admin and his friends/family who bought earlier and their sell order was ready.  </p>\n\n<p>So who lost? Thousands of small investors who bought at high prices.</p>\n\n<p>What happened to the groups? Discord deleted immediatly, telegram sold to random one. </p>\n\n<p>Tl;dr: please stay away from those kind of shenaningans. Don’t get fooled.</p>\n</div><!-- SC_ON -->",
  "score": 1292,
  "permalink": "/r/CryptoCurrency/comments/n9snpj/i_get_invited_to_a_pump_and_dump_group_and/",
  "subreddit": "CryptoCurrency",
  "id": "n9snpj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992426
}