{
  "author": "nyx_07",
  "the_new_excerpt": "Mt life is pretty freakin negative lately and I’m in a not so great place\nprofessionally and personally.\n\nSoooo I go on Reddit to upvote the beejesus out of everyone’s posts, comment on\nlow commented posts, positive reinforcement when someone is excited about\nsomething, and give out every free award…",
  "original_created_utc": 1614290823,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "山上的生活是相当畸形的消极最近，我在一个不是那么好的地方。\n专业和个人。\n\n我在Reddit上给每个人的帖子都打上了高分，评论上了\n低评论的帖子，当有人兴奋的时候，积极的强化。\n东西，并给予每一个免费的奖励... ...",
      "title": "还有人把Reddit作为自己的小灯塔吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "山上的生活是相當畸形的消極最近，我在一個不是那麼好的地方。\n專業和個人。\n\n我在Reddit上給每個人的帖子都打上了高分，評論上了\n低評論的帖子，當有人興奮的時候，積極的強化。\n東西，並給予每一個免費的獎勵... ...",
      "title": "還有人把Reddit作爲自己的小燈塔嗎？"
    }
  ],
  "title": "Does anyone else use Reddit as their small beacon of light?",
  "created_utc": 1614301828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Mt life is pretty freakin negative lately and I’m in a not so great place professionally and personally. </p>\n\n<p>Soooo I go on Reddit to upvote the beejesus out of everyone’s posts, comment on low commented posts, positive reinforcement when someone is excited about something, and give out every free award I get.  </p>\n\n<p>I’m hoping these interactions makes someone smile or laugh or feel better about their lives. Even if it’s for a fleeting second and in a small way. Doing this gives me some aspiration right now that it may make a small impact in my life too. And I’m starting to feel like it has. </p>\n\n<p>If you’re reading this and you feel like I do right now, this might help you feel a bit better about things and you’ll try it out instead of lurking. Okay enough of my rambling.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/NoStupidQuestions/comments/lsi9cv/does_anyone_else_use_reddit_as_their_small_beacon/",
  "subreddit": "NoStupidQuestions",
  "id": "lsi9cv",
  "is_self": true,
  "media": null,
  "is_video": false
}