{
  "author": "scrooplynooples",
  "the_new_excerpt": "This sub was built on speculative options plays, where people would slap their\nnuts on the table and say “this stock is going to triple by next week or I’m\ngoing to lose $10k” and if they were right, they made a shitload of money. No\none cares about the 4 shares of whatever stock you own and the…",
  "original_created_utc": 1615506219,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个子是建立在投机期权的玩法上的，人们会在这里拍下自己的\n坚果在桌子上，并说：\"这只股票将在下周三倍，否则我\n将失去1万美元\"，如果他们是正确的，他们赚了一大笔钱。不对\n一个人关心的4股，无论你拥有的股票和...",
      "title": "如果你对期权交易一窍不通，认为 \"仓位 \"就是把你买的股票和价格贴出来，那你就不要上WSB了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子是建立在投機期權的玩法上的，人們會在這裏拍下自己的\n堅果在桌子上，並說：\"這隻股票將在下週三倍，否則我\n將失去1萬美元\"，如果他們是正確的，他們賺了一大筆錢。不對\n一個人關心的4股，無論你擁有的股票和...",
      "title": "如果你對期權交易一竅不通，認爲 \"倉位 \"就是把你買的股票和價格貼出來，那你就不要上WSB了。"
    }
  ],
  "title": "If you don’t know anything about options trading, and think a “position” is just posting the stock you bought and the price, then you should not be on WSB.",
  "created_utc": 1615580826,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sub was built on speculative options plays, where people would slap their nuts on the table and say “this stock is going to triple by next week or I’m going to lose $10k” and if they were right, they made a shitload of money. No one cares about the 4 shares of whatever stock you own and the price you bought it at. You sound like morons asking what 3/12 means when someone is talking about an options contract. Autism I’m okay with, we’re all a little reeeeeeeee, but stupidity is curable. You can go on investopedia and in 5 minutes learn enough information to not be a complete moron and flood this sub with garbage posts and comments.</p>\n\n<p>This isn’t a safe space. This isn’t a school. This is trial by fire and if you say or do something dumb you deserve to get roasted for it. If you want to learn go to a different sub. This sub is for austists and degenerates.</p>\n</div><!-- SC_ON -->",
  "score": 4899,
  "permalink": "/r/wallstreetbets/comments/m342zt/if_you_dont_know_anything_about_options_trading/",
  "subreddit": "wallstreetbets",
  "id": "m342zt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147386930
}