{
  "author": "Kagerou2020",
  "original_created_utc": 1647872732,
  "title": "I misspelled one letter in the name of the student on the college certificate. Would you be angry?",
  "created_utc": 1647880634,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is my first time issuing transcripts/certificates/parchment for college students. All names are hand-written in a fancy way. I noticed there&amp;#39;s a &amp;quot;k&amp;quot; instead of &amp;quot;t&amp;quot; in one of the student&amp;#39;s names. I wasn&amp;#39;t the one to write it down, it was done by an outsourcer and I didn&amp;#39;t have an opportunity to check it until today.&lt;/p&gt;\n\n&lt;p&gt;Graduation ceremony is tomorrow so I clearly won&amp;#39;t be able to create a new one. I will write an apology email to the student and will also apologize to the dean and college office and will tell all of them it will be reissued asap and sent to student&amp;#39;s home. This is the first intake to graduate from this new department.&lt;/p&gt;\n\n&lt;p&gt;I understand that it&amp;#39;s a very big issue and I&amp;#39;m beyond myself with worry.  I&amp;#39;m so scared of what could happen to my job as well.&lt;/p&gt;\n\n&lt;p&gt;As a student, how would you react if it happened to you but the college employee properly apologized and reissued it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/NoStupidQuestions/comments/tjd0iy/i_misspelled_one_letter_in_the_name_of_the/",
  "subreddit": "NoStupidQuestions",
  "id": "tjd0iy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is my first time issuing transcripts/certificates/parchment for college\nstudents. All names are hand-written in a fancy way. I noticed there's a \"k\"\ninstead of \"t\" in one of the student's names. I wasn't the one to write it down,\nit was done by an outsourcer and I didn't have an opportunity to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大学の成績証明書/証明書/羊皮紙を発行するのは、今回が初めてです\nの学生です。名前は全て手書きで派手に書いてあります。気がつくと、\"k \"がある。\nある学生の名前に、\"t \"ではなく \"t \"が入っているんです。私が書いたのではありません。\n外注先がやったことなので、機会がなくて......。",
      "title": "大学の証明書の学生名の一文字を間違えてしまった。あなたは怒るだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我第一次为大学生出具成绩单/证书/学位证书。\n学生。所有的名字都是手写的，很花哨。我注意到其中一个学生的名字里有一个 \"k\"\n而不是 \"t\"，我注意到其中一个学生的名字里有一个 \"k\"。我不是那个写下它的人。\n它是由一个外包商完成的，我没有机会...",
      "title": "我在大学证书上的学生姓名中拼错了一个字母。你会生气吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我第一次爲大學生出具成績單/證書/學位證書。\n學生。所有的名字都是手寫的，很花哨。我注意到其中一個學生的名字裏有一個 \"k\"\n而不是 \"t\"，我注意到其中一個學生的名字裏有一個 \"k\"。我不是那個寫下它的人。\n它是由一個外包商完成的，我沒有機會...",
      "title": "我在大學證書上的學生姓名中拼錯了一個字母。你會生氣嗎？"
    }
  ]
}