{
  "author": "vizard0",
  "original_created_utc": 1635166863,
  "title": "Did the US actually honor any of the treaties it made with Native American tribes/nations?",
  "created_utc": 1635183154,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My understanding of US history when it comes to Native American tribes/nations/groups is that it generally followed the pattern of</p>\n\n<ol>\n<li><p>Treaty is signed between the US and a tribe or nation setting a border or proclaiming that each side had a right to certain parts of the land. </p></li>\n<li><p>White settlers/colonizers ignore the treaty and start taking Native American land and harassing/killing of any Native Americans who objected or kept living in the area.</p></li>\n<li><p>Native Americans respond to protect themselves and their land by fighting back.</p></li>\n<li><p>Due to Native American &quot;aggression&quot; the US Military comes in and expels/kills the members of the nation/tribe and any others Native Americans in the area.</p></li>\n</ol>\n\n<p>(For reservations, my understanding is that it was a toss up over whether goods and payments would actually make it to the intended Native Americans or be pocketed by the agent at the scene, having that the treaty would have been violated during the tenure of the dishonest agents.) </p>\n\n<p>Is this the general pattern? Were there any times when treaties were ended because both sides wanted to? Are there any treaties with Native American groups/tribes/nations left that the US has not violated at some point in the past?</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/AskHistorians/comments/qfg7us/did_the_us_actually_honor_any_of_the_treaties_it/",
  "subreddit": "AskHistorians",
  "id": "qfg7us",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My understanding of US history when it comes to Native American\ntribes/nations/groups is that it generally followed the pattern of\n\n 1. Treaty is signed between the US and a tribe or nation setting a border or\n    proclaiming that each side had a right to certain parts of the land.\n\n 2. White…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ネイティブアメリカンの部族・民族・グループに関するアメリカの歴史についての私の理解は\nの部族・民族・グループは、一般的に次のようなパターンであったと思います。\n\n 1. アメリカとある部族や国との間で条約が結ばれ、国境を設定したり\n    アメリカと部族や国との間で、国境を設定したり、お互いに土地の特定の部分を所有する権利があることを宣言したりする。\n\n 2. 白人...",
      "title": "アメリカはネイティブ・アメリカンの部族や国家と交わした条約を実際に守ったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对美国历史的理解，当涉及到美国原住民时\n部落/民族/群体时，我的理解是，它通常遵循以下模式\n\n 1. 美国和一个部落或国家之间签署条约，确定边界或\n    宣布双方对土地的某些部分都有权利。\n\n 2. 2. 白人...",
      "title": "美国是否真正履行了它与美国原住民部落/民族签订的任何条约？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對美國曆史的理解，當涉及到美國原住民時\n部落/民族/羣體時，我的理解是，它通常遵循以下模式\n\n 1. 美國和一個部落或國家之間簽署條約，確定邊界或\n    宣佈雙方對土地的某些部分都有權利。\n\n 2. 2. 白人...",
      "title": "美國是否真正履行了它與美國原住民部落/民族簽訂的任何條約？"
    }
  ]
}