{
  "author": "deadliftz420",
  "original_created_utc": 1632954720,
  "title": "Would it violate HIPAA if my primary care doctor told my mom that I'm having sex via a phone call even though I told her that I didn't feel comfortable with my mom knowing about the fact that I have sex?",
  "created_utc": 1632979049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 22 years old but I&#39;m unsure if on the paperwork I put down that she can have access to my medical records/info. However, the same day I saw my doctor I told her I didn&#39;t feel comfortable with my mom knowing about the fact I have sex which was why I avoided the pap smear and gyno referral due to my mom&#39;s insane questioning and logic. So would it be considered a violation regardless if she told my mom that I&#39;m having sex?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/py6dv3/would_it_violate_hipaa_if_my_primary_care_doctor/",
  "subreddit": "NoStupidQuestions",
  "id": "py6dv3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm 22 years old but I'm unsure if on the paperwork I put down that she can have\naccess to my medical records/info. However, the same day I saw my doctor I told\nher I didn't feel comfortable with my mom knowing about the fact I have sex\nwhich was why I avoided the pap smear and gyno referral due to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は22歳ですが、彼女が私の医療記録や情報にアクセスできるかどうか、私が書いた書類ではわかりません。\n私の医療記録や情報にアクセスできるかどうかはわかりません。しかし、私が医師に会った同じ日に、私は彼女に言いました。\n私がセックスをしていることを母に知られるのは不安だと伝えました。\nそれが理由で乳頭腫検査と婦人科の紹介を避けた理由です。",
      "title": "私が「母にセックスの事実を知られるのは気が進まない」と言ったにもかかわらず、主治医が母に電話で私がセックスをしていることを伝えた場合、HIPAAに違反しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经22岁了，但我不确定在我写的文件上，她是否可以有\n访问我的医疗记录/信息。然而，在我见医生的同一天，我告诉她\n我告诉她，我对我妈妈知道我有性行为的事实感到不舒服。\n这就是为什么我避免做子宫颈抹片检查和妇科转诊的原因。",
      "title": "如果我的主治医生通过电话告诉我妈妈我有性行为，即使我告诉她我对我妈妈知道我有性行为的事实感到不舒服，这是否违反了HIPAA？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經22歲了，但我不確定在我寫的文件上，她是否可以有\n訪問我的醫療記錄/信息。然而，在我見醫生的同一天，我告訴她\n我告訴她，我對我媽媽知道我有性行爲的事實感到不舒服。\n這就是爲什麼我避免做子宮頸抹片檢查和婦科轉診的原因。",
      "title": "如果我的主治醫生通過電話告訴我媽媽我有性行爲，即使我告訴她我對我媽媽知道我有性行爲的事實感到不舒服，這是否違反了HIPAA？"
    }
  ]
}