{
  "author": "Wolf9574",
  "original_created_utc": 1624259817,
  "title": "This sideways trend has proven that sometimes technical analysis means absolutely nothing.",
  "created_utc": 1624307839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ever since we hit 30k about a month ago TA people on twitter, reddit etc have been constantly talking about an imminent breakout either up or down, usually up, yet the market does its own thing and crabs sideways, something only a few people expected, most of whom used no TA to figure it out.</p>\n\n<p>Personally i think there is little to no point doing TA on any crypto in a market so controlled by the current BTC price action and also so volatile and sensitive to whales.</p>\n</div><!-- SC_ON -->",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/o4pikr/this_sideways_trend_has_proven_that_sometimes/",
  "subreddit": "CryptoCurrency",
  "id": "o4pikr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ever since we hit 30k about a month ago TA people on twitter, reddit etc have\nbeen constantly talking about an imminent breakout either up or down, usually\nup, yet the market does its own thing and crabs sideways, something only a few\npeople expected, most of whom used no TA to figure it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1ヶ月ほど前に30Kを達成して以来、twitterやredditなどでTAの人たちが\n上か下か、たいていは上か下かのブレイクアウトが迫っていると常に話しています。\nしかし、市場は独自の動きをし、横ばいで推移しています。\n予測していたのは数人だけで、ほとんどの人はTAを使わずに予測していました...。",
      "title": "この横ばいのトレンドは、テクニカル分析が全く意味をなさない場合があることを証明しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从一个月前我们达到了30K，TA在twitter、reddit等网站上的人就一直在谈论\n一直在谈论即将到来的突破，无论是向上还是向下，通常是向上。\n然而，市场做它自己的事情，横行霸道，只有少数人预料到这一点。\n只有少数人预料到这一点，其中大多数人没有使用TA来计算...",
      "title": "这种横盘走势已经证明，有时技术分析完全没有意义。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從一個月前我們達到了30K，TA在twitter、reddit等網站上的人就一直在談論\n一直在談論即將到來的突破，無論是向上還是向下，通常是向上。\n然而，市場做它自己的事情，橫行霸道，只有少數人預料到這一點。\n只有少數人預料到這一點，其中大多數人沒有使用TA來計算...",
      "title": "這種橫盤走勢已經證明，有時技術分析完全沒有意義。"
    }
  ]
}