{
  "author": "SkepticalCryptoDude",
  "original_created_utc": 1659093836,
  "title": "Why is crypto going up after the news of being in a recession?",
  "created_utc": 1659109193,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The markets are definitely behaving in mysterious ways lately. It seems like we turn from bullish to bearish and vice versa on the daily. I find it a bit odd that the market is pumping on the news of a recession. &lt;/p&gt;\n\n&lt;p&gt;Is Bitcoin and crypto proving it really is a hedge against the devaluing of the dollar, or is the fact it was only a 75bp hike until September that maybe caused the case for optimism?&lt;/p&gt;\n\n&lt;p&gt;Do you guys believe in this pump or is it just temporary until another leg down? I personally am not sure so I’m just slowly DCAing into my favourite projects. &lt;/p&gt;\n\n&lt;p&gt;Let me know your thoughts in the comments below. Have a great day everyone!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 409,
  "permalink": "/r/CryptoCurrency/comments/wb28x2/why_is_crypto_going_up_after_the_news_of_being_in/",
  "subreddit": "CryptoCurrency",
  "id": "wb28x2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The markets are definitely behaving in mysterious ways lately. It seems like we\nturn from bullish to bearish and vice versa on the daily. I find it a bit odd\nthat the market is pumping on the news of a recession.\n\nIs Bitcoin and crypto proving it really is a hedge against the devaluing of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近のマーケットは、確かに不思議な動きをしていますね。まるで\n日足で強気から弱気になったり、その逆もあるようです。私は、少し奇妙だと思います。\n不況のニュースで市場が盛り上がっているのは、ちょっと不思議です。\n\nビットコインと暗号は、それが本当に切り下げに対するヘッジであることを証明しているのだろうか...。",
      "title": "不況になったというニュースの後、なぜ暗号が上がっているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "市场最近的表现绝对是神秘的。似乎我们\n从看涨到看跌，反之亦然。我觉得这有点奇怪\n市场在经济衰退的消息中被打压。\n\n比特币和加密货币是否证明它真的是对冲经济贬值的工具？",
      "title": "为什么加密货币在处于经济衰退的消息后还在上涨？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場最近的表現絕對是神祕的。似乎我們\n從看漲到看跌，反之亦然。我覺得這有點奇怪\n市場在經濟衰退的消息中被打壓。\n\n比特幣和加密貨幣是否證明它真的是對沖經濟貶值的工具？",
      "title": "爲什麼加密貨幣在處於經濟衰退的消息後還在上漲？"
    }
  ]
}