{
  "author": "FazerGM",
  "original_created_utc": 1638874000,
  "title": "Why do mosaic humans not get attacked by their own immune system?",
  "created_utc": 1638901917,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently found out that genetic mosaicism exists, in which a single person has multiple different sets of DNA at a time, in different groups of cells.&lt;/p&gt;\n\n&lt;p&gt;However, it isn&amp;#39;t clear to me why the body doesn&amp;#39;t reject these cells with a different DNA, as is the case for e.g. organ transplants, or at least has immune responses between them?&lt;/p&gt;\n\n&lt;p&gt;Why does the immune system reject transplanted organs, but not genetic mosaic tissue?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/rawfr3/why_do_mosaic_humans_not_get_attacked_by_their/",
  "subreddit": "askscience",
  "id": "rawfr3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently found out that genetic mosaicism exists, in which a single person has\nmultiple different sets of DNA at a time, in different groups of cells.\n\nHowever, it isn't clear to me why the body doesn't reject these cells with a\ndifferent DNA, as is the case for e.g. organ transplants, or at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近知ったのですが、一人の人が持っている遺伝子のモザイクが存在するそうです。\n一度に複数の異なるDNAセットを、異なる細胞集団の中に持っている。\n\nしかし、なぜ体がこれらの異なる細胞を拒絶しないのか、私にはよくわかりません。\n臓器移植のように、異なるDNAを使用することもできますし、また、...",
      "title": "なぜモザイク人間は自分の免疫力で攻撃されないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近发现存在基因镶嵌现象，即一个人在不同的细胞中同时拥有多套不同的DNA。\n在不同的细胞组中，一个人在同一时间有多套不同的DNA。\n\n然而，我并不清楚为什么身体不排斥这些带有不同DNA的细胞。\n不同的DNA，如器官移植的情况，或在...",
      "title": "为什么混血儿不会被自己的免疫系统攻击？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近發現存在基因鑲嵌現象，即一個人在不同的細胞中同時擁有多套不同的DNA。\n在不同的細胞組中，一個人在同一時間有多套不同的DNA。\n\n然而，我並不清楚爲什麼身體不排斥這些帶有不同DNA的細胞。\n不同的DNA，如器官移植的情況，或在...",
      "title": "爲什麼混血兒不會被自己的免疫系統攻擊？"
    }
  ]
}