{
  "author": "Yosskee",
  "original_created_utc": 1629738960,
  "title": "Best crypto joke gets Reddit Diamond :P",
  "created_utc": 1629754502,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tell me a joke about crypto that makes me laugh. It can be anything, a pun, a dirty joke, insulting, ANYTHING. ROAST ME if you&#39;d like. Look at my profile, make fun of me, I&#39;m a TOTAL piece of shit. I&#39;m your typical trash day trader who lies about his gains and post pictures of green candles from cryptos I don&#39;t own and say &quot; did you get in too??&quot; Haha not really but what is real about this post is if you make me laugh hard enough I&#39;ll give you a useless reddit prize. Might hand out some other prizes for top mentions. </p>\n\n<p>TLDR; Make me laugh with a crypto joke I&#39;ll give you a stupid prize</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/pa4bgd/best_crypto_joke_gets_reddit_diamond_p/",
  "subreddit": "CryptoCurrency",
  "id": "pa4bgd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Tell me a joke about crypto that makes me laugh. It can be anything, a pun, a\ndirty joke, insulting, ANYTHING. ROAST ME if you'd like. Look at my profile,\nmake fun of me, I'm a TOTAL piece of shit. I'm your typical trash day trader who\nlies about his gains and post pictures of green candles from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に関するジョークで笑えるものを教えてください。ダジャレでも下ネタでも何でも構いません。\n侮辱的なものなど何でも構いません。よかったら「ROAST ME」もお願いします。私のプロフィールを見てください。\n俺をからかってくれ、俺は完全なクズだ。私は典型的なゴミのようなデイトレーダーです。\n自分の利益について嘘をつき、緑のローソクの写真を投稿する...",
      "title": "最高のcrypto jokeがReddit Diamondを獲得 :P"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "告诉我一个关于加密货币的笑话，让我发笑。它可以是任何东西，一个双关语，一个\n肮脏的笑话，侮辱性的，任何东西都可以。如果你愿意的话，就把我烤了吧。看看我的资料。\n取笑我，我是一个完全的垃圾。我是一个典型的垃圾日间交易员，他\n谎报他的收益，并张贴绿色蜡烛的照片，从...",
      "title": "最佳加密货币笑话获得Reddit钻石:P"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "告訴我一個關於加密貨幣的笑話，讓我發笑。它可以是任何東西，一個雙關語，一個\n骯髒的笑話，侮辱性的，任何東西都可以。如果你願意的話，就把我烤了吧。看看我的資料。\n取笑我，我是一個完全的垃圾。我是一個典型的垃圾日間交易員，他\n謊報他的收益，並張貼綠色蠟燭的照片，從...",
      "title": "最佳加密貨幣笑話獲得Reddit鑽石:P"
    }
  ]
}