{
  "author": "spike142",
  "the_new_excerpt": "Obligatory: Fuck Citron\n\nI got burned on PLTR back in November by their stupid \"Well that was a good run\"\nbull shit post. Now we have them trying to pull the same tactic today on GME\nthat they did back then. And today we fought back, we just shrugged off their\nannouncement and just moved right…",
  "original_created_utc": 1611105180,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "义务的。去他妈的香橼\n\n我在11月的时候被他们愚蠢的 \"嗯，这是一个很好的运行 \"烧死在PLTR上。\n扯淡的帖子。现在，他们今天在GME上也想用同样的手段。\n他们当时的做法。而今天我们反击了，我们只是甩开了他们。\n公告，只是移动的权利...",
      "title": "香橼最大的错误。他们宣布他们将有一个直播， 并提供了时间和日期。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "義務的。去他媽的香櫞\n\n我在11月的時候被他們愚蠢的 \"嗯，這是一個很好的運行 \"燒死在PLTR上。\n扯淡的帖子。現在，他們今天在GME上也想用同樣的手段。\n他們當時的做法。而今天我們反擊了，我們只是甩開了他們。\n公告，只是移動的權利...",
      "title": "香櫞最大的錯誤。他們宣佈他們將有一個直播， 並提供了時間和日期。"
    }
  ],
  "title": "Citron's Biggest Mistake: They Announced that they would have a live stream, and provided the time and date.",
  "created_utc": 1611129708,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Obligatory: Fuck Citron</p>\n\n<p>I got burned on PLTR back in November by their stupid &quot;Well that was a good run&quot; bull shit post. Now we have them trying to pull the same tactic today on GME that they did back then. And today we fought back, we just shrugged off their announcement and just moved right along, and still cleared double digit returns for the day.</p>\n\n<p>But by far their biggest mistake was that they posted the time and date of their event tomorrow. So what&#39;s holding us back from getting on their event tomorrow and just filling the seats with Autists? Heck we have enough strenght in numbers to bombard their stupid event tomorrow to the point they cannot host the event due either due to lewd and rude behavior or that the event just collapses due to hosting issues.</p>\n\n<p>All I am saying is that sure we can take the high road, or we can all just teach that fat fuck one final lesson and make it impossible for him to host such a stupid event. </p>\n\n<p>TLDR: Why don&#39;t we all just jump on the event tomorrow and drop rocket ships left and right till the man just can&#39;t take it anymore. </p>\n\n<p>Also what is he going to suggest, short the stock? WITH WHAT FUCKING SHARES AND AT WHAT COST?</p>\n</div><!-- SC_ON -->",
  "score": 4249,
  "permalink": "/r/wallstreetbets/comments/l0y80p/citrons_biggest_mistake_they_announced_that_they/",
  "subreddit": "wallstreetbets",
  "id": "l0y80p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311228537
}