{
  "author": "lmposterSyndrome",
  "original_created_utc": 1645989312,
  "title": "Who are the most influential living philosophers (from an academic perspective)?",
  "created_utc": 1646049659,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Really curious. From the perspective of a layperson, I am vaguely familiar with some names - e.g. Jurgen Habermas, and I&amp;#39;ve contributed to Singer&amp;#39;s Effective Altruism organisation. I&amp;#39;ve also heard of (though not engaged much with) public intellectuals like Noam Chomsky, or people that are regarded as pseudo-philosophers (or at least that&amp;#39;s the impression I get) like Jordan Peterson.&lt;/p&gt;\n\n&lt;p&gt;But I suspect this isn&amp;#39;t a very good analogue to the philosophers that are influential within academia, but more those that have the skills or connections to write for the public. So I&amp;#39;m wondering what philosophers are &amp;#39;internally&amp;#39; influential, and what sort of ideas or theories they support.&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/t2vgrc/who_are_the_most_influential_living_philosophers/",
  "subreddit": "askphilosophy",
  "id": "t2vgrc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Really curious. From the perspective of a layperson, I am vaguely familiar with\nsome names - e.g. Jurgen Habermas, and I've contributed to Singer's Effective\nAltruism organisation. I've also heard of (though not engaged much with) public\nintellectuals like Noam Chomsky, or people that are regarded…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当に不思議です。素人目線で、なんとなく知っているのは\nユルゲン・ハーバーマスや、シンガーのEffective Effectiveに寄稿したこともあります。\n利他主義の組織。また、（あまり関わったことはないのですが）公\nノーム・チョムスキーのような知識人、あるいはそのような人たちと...",
      "title": "現存する哲学者の中で、最も影響力のある人物は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "真的很好奇。从一个普通人的角度来看，我对一些名字隐约感到熟悉\n一些名字--例如尤尔根-哈贝马斯，而且我为辛格的 \"有效利他主义 \"组织做出过贡献。\n利他主义组织作出贡献。我还听说过（虽然没有怎么接触过）公共知识分子的名字。\n像诺姆-乔姆斯基这样的公共知识分子，或者被认为是......的人。",
      "title": "谁是最有影响力的在世哲学家（从学术角度来看）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "真的很好奇。從一個普通人的角度來看，我對一些名字隱約感到熟悉\n一些名字--例如尤爾根-哈貝馬斯，而且我爲辛格的 \"有效利他主義 \"組織做出過貢獻。\n利他主義組織作出貢獻。我還聽說過（雖然沒有怎麼接觸過）公共知識分子的名字。\n像諾姆-喬姆斯基這樣的公共知識分子，或者被認爲是......的人。",
      "title": "誰是最有影響力的在世哲學家（從學術角度來看）？"
    }
  ]
}