{
  "author": "Breeder-One",
  "the_new_excerpt": "Hi guys I’m reading through Mark Minervini book and he mentioned once your\nprofit has double your initial risk at 15% profit (-7% stop loss) you should\nstart to move your stop loss to your original buy point so it becomes an either\nneutral or profitable trade.\n\nAfter more profits Mark would use a…",
  "original_created_utc": 1612527026,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，伙计们，我正在阅读通过马克Minervini的书，他提到一次你的。\n在15%的利润（-7%的止损）下，您的利润是您初始风险的两倍，您应\n开始将你的止损移动到你原来的买入点，这样就变成了一个要么是\n中性或盈利的交易。\n\n在获得更多利润后，马克会用一...",
      "title": "保护你的利润。请分享你的方法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，夥計們，我正在閱讀通過馬克Minervini的書，他提到一次你的。\n在15%的利潤（-7%的止損）下，您的利潤是您初始風險的兩倍，您應\n開始將你的止損移動到你原來的買入點，這樣就變成了一個要麼是\n中性或盈利的交易。\n\n在獲得更多利潤後，馬克會用一...",
      "title": "保護你的利潤。請分享你的方法"
    }
  ],
  "title": "Protecting your profit. Please share your method",
  "created_utc": 1612545338,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys I’m reading through Mark Minervini book and he mentioned once your profit has double your initial risk at 15% profit (-7% stop loss) you should start to move your stop loss to your original buy point so it becomes an either neutral or profitable trade. </p>\n\n<p>After more profits Mark would use a trailing stop loss to closely monitor the price and exit in a favorable position with his profit in tact. This is the part where I’m confused. I understand that trailing stop loss follows price increases and stops when price decreases. So what would my stop loss be if I have 20,30,40% profit?</p>\n\n<p>Right now one of my trade has a 20% profit. I set the stop loss at break even + 5%. Giving the trade a 15% wiggle room, is this too much room? The stock exchange I use has a 7% limit fluctuations for every stock meaning it cannot go below 7% any given day.</p>\n\n<p>Thanks for your input!</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/investing/comments/ld5vgo/protecting_your_profit_please_share_your_method/",
  "subreddit": "investing",
  "id": "ld5vgo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198811
}