{
  "author": "Cacotopianist",
  "original_created_utc": 1643557298,
  "title": "We know that “southern China” was originally populated by many non-Chinese indigenous peoples. What did Chinese migration southwards actually look like, for both incoming migrants and indigenous Yue peoples?",
  "created_utc": 1643607282,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Building on &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/nyxe0u/how_did_the_south_of_china_the_area_south_of_the/h1nqjtg/\"&gt;this&lt;/a&gt; answer from &lt;a href=\"/u/dongzhou3kingdoms\"&gt;u/dongzhou3kingdoms&lt;/a&gt;, I got the impression that the consolidation of the south through migration and subsequent top-down Sinification was relatively finished by the Han (mainly caused by those fleeing the landlords who had taken control of the state after the post-Xin wars). &lt;/p&gt;\n\n&lt;p&gt;But from my research during the Six Dynasties period, which I’m far more familiar with, I know that the Wu and Chu peoples with heavy ties to the southern peoples still maintained a distinct identity into the Tang, and control of regions like Guangzhou and Guizhou was marginal at best. Especially because events like Ling Tong’s impressment (for lack of a better word to describe marching around in shiny armor to impress Shanyue) and the continued native control of Fujian by states like Donghai and Yueyao (if I’m understanding Brindley 2015 correctly) make it seem like control in those areas were more nominal or tributary than vassal (like most of China was pre-Wudi) or directly administrative.&lt;/p&gt;\n\n&lt;p&gt;So I wanted to ask some Han specialists. What did this initial migration wave look like, to both settlers and natives? If they were fleeing landlords, why keep their original culture instead of integrating into native mutual support and diplomatic systems, as many European settlers did the early days of American colonization? How did they learn southern farming techniques? What was the mortality rate like given that they were entering a completely new tropical environment? How did both settlers and natives perceive their relationship with the Han central government? Is it possible that it was more like what we now know of early Mesoamerican contact, where natives perceived their “emperors” as more like useful foreign allies? &lt;/p&gt;\n\n&lt;p&gt;Maybe I’m coming into this with too many preconceptions from American Indian studies lol, sorry for the long post and thanks in advance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sgbsvg/we_know_that_southern_china_was_originally/",
  "subreddit": "AskHistorians",
  "id": "sgbsvg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Building on this\n[https://www.reddit.com/r/AskHistorians/comments/nyxe0u/how_did_the_south_of_china_the_area_south_of_the/h1nqjtg/]\nanswer from u/dongzhou3kingdoms [/u/dongzhou3kingdoms], I got the impression\nthat the consolidation of the south through migration and subsequent top-down\nSinification…"
}