{
  "author": "RLRLRL97",
  "original_created_utc": 1644250931,
  "title": "Why does astrology seem to attract women more than it does men?",
  "created_utc": 1644260130,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At least where I&amp;#39;m from, the only people who take astrology semi-seriously are women for the most part. I can point out once I&amp;#39;ve seen a man share a horoscope on social media yet I see plenty of women doing it frequently and most men here think it&amp;#39;s all bullshit. What is it about astrology that draws in women over men?&lt;/p&gt;\n\n&lt;p&gt;Edit: Please stop with the sexism, this isn&amp;#39;t what this post was meant to be about, I&amp;#39;m all for insensitive jokes but there&amp;#39;s a couple of people just being blatantly sexist.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/NoStupidQuestions/comments/smu36d/why_does_astrology_seem_to_attract_women_more/",
  "subreddit": "NoStupidQuestions",
  "id": "smu36d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "At least where I'm from, the only people who take astrology semi-seriously are\nwomen for the most part. I can point out once I've seen a man share a horoscope\non social media yet I see plenty of women doing it frequently and most men here\nthink it's all bullshit. What is it about astrology that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少なくとも私が住んでいるところでは、占星術を半信半疑でやっている人たちだけが\n女性が多いですね。男性がホロスコープをシェアしているのを見たのは一度だけです。\nしかし、私は多くの女性がそれを頻繁にやっているのを見ますし、ほとんどの男性は、ここで\nデタラメだと思う。占星術のどこが...",
      "title": "なぜ占星術は、男性よりも女性を惹きつけるようなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "至少在我的家乡，对占星术半认真的人只有\n女性居多。我可以指出，有一次我看到一个男人在社交媒体上分享一个星座\n但我看到很多女人经常这样做，而这里的大多数男人\n认为这都是胡说八道。关于占星术，到底是什么...",
      "title": "为什么占星术似乎比男人更吸引女人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "至少在我的家鄉，對占星術半認真的人只有\n女性居多。我可以指出，有一次我看到一個男人在社交媒體上分享一個星座\n但我看到很多女人經常這樣做，而這裏的大多數男人\n認爲這都是胡說八道。關於占星術，到底是什麼...",
      "title": "爲什麼占星術似乎比男人更吸引女人？"
    }
  ]
}