{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "Listen up retards, this won't be short.\n\nThis was not meant for you apes; Seek ing alpha denied my article because they don't want recent SPACs merger on their website.\n\nSo instead of earning cash to spend it on stupid shit, I'm here wasting my time for you all because I don't want 50 hours and 4000 words of research to go to waste, let me tell you gamblers why Microvast ($MVST) is a Hidden gem.\n\nFirst of all, you retards probably came for the short squeeze potential, rumor has it, there's not many shares left to short sell and Microvast is down 60% from its peak (even after yesterday's 20%+ run), but I could not care less about that, MVST will trade significantly higher once decent analysts start coverage on it and this post will tell you why. You guys are so lucky to have found this now, I've been holding since November when it was $11, so the price right now is still dirt cheap (it was $15 two weeks ago...).\n\nQuick introduction for those of you who don’t know what Microvast is and what it does. Microvast is a technology innovator for Li-ion batteries that designs, develops and manufactures battery systems for commercial electric vehicles and energy storage that feature ultra-fast charging capabilities, long life and superior safety. Microvast believes the ultra-fast charging capabilities of its battery systems make charging electric vehicles as convenient as fueling conventional vehicles and believes the long battery life of its battery systems reduces the total cost of ownership of electric vehicles.\n\nMicrovast is expected to grow at a compounded annual growth rate of 87%, their estimates are justified by the growing desire for electrification as well as the growing demand for clean energy and the zero-carbon revolution.\n\nThe forecasted battery components revenues (see picture below) come from Microvast being vertically integrated. Their battery components are world-class, significantly differentiating and they are going to sell those parts to some key cell manufacturers in the passenger EV market (specifically their aramid separator and their gradient cathode). They currently ship to passenger vehicle applications (SAIC) but are also engaging with passenger OEMs that have made the announcement that they will manufacture their own batteries (with battery components)\\[1\\]. They also plan to do the same thing with consumer electronics.\n\n&#x200B;\n\nhttps://preview.redd.it/alqqdfwu0qf71.png?width=359&format=png&auto=webp&s=f607dd17a8b1c6817205d2e9b561ca0c22eb26dc\n\nMicrovast's projected revenues\n\nWhile their projections may seem optimistic, they were able to secure partnerships with industry leaders representing over $1.5 Bn in contracted revenue through 2027. $44 millions, $125 millions, $172 millions, $250 millions, and $355 millions for 2021, 2022, 2023, 2024, and 2025 respectively. Those numbers were before they recently announced a partnership with eVersum, a high-tech vehicle OEM, specialized in the design, development, and build of the most purposely engineered electric commercial vehicles for passenger transport. The deal has a potential volume forecasted to be more than 100 million €.\n\nThere’s a great interview on [cheddar news](https://cheddar.com/media/microvast-goes-public-on-nasdaq-via-spac) with Shane Smith, COO of Microvast, where he talks about why Microvast went public and raised more than $800 million: “We raised capital to support orders we already had in place. We’ve won more business than we’ve had capacity for”. It seems like Microvast has a great problem; the demand is bigger than the supply at the moment, which is great news as they may not need to spend a lot on marketing if customers are coming to them directly.\n\n\\- Microvast has over a decade of expertise in designing and manufacturing battery components (Cells, electrolytes, packs, separators). That differentiates them from most of the other battery makers who source their components from the vendors. It is important to note the cell makers do not have the right to produce the material that they did not invent or have the license for. “Microvast invented and manufactures the key battery materials to ensure unique performance and by also guaranteeing the leading time because the material patents are the strongest patents, legally protected and our success is founded on our deep technology portfolio which is wholly owned and protected by over 550 patents (and patent applications)”, said Dr. Mattis, Chief Technology Officer of the company.\n\n\\- They have more than 1800 employees including more than 500 employees in the R&D division.\n\n\\- They have 28000+ Battery systems in operation in 19 different countries.\n\n\\- More than 3.8Bn Miles of operational distance was covered with no major safety incidents.\n\n\\- Their Batteries can run at a high temperature for a long time and they won’t explode. They have this proprietary way for their Batteries to be 90% as efficient as brand-new ones after 10,000 charges.\n\n\\- Among all of Microvast’s products, two stands out that no one else in the world has: the 100% Aramid separator and the full concentration of the grading of the material.\n\no “One of the perks for the solid-state battery is on shrinking separators and with our Aramid separator, we are there”, Dr Wenjuan Mattis said in the Wedbush conference held on April 8th2021. For the fans of solid-state batteries, this could be a major catalyst incoming. Their Aramid separator has higher thermal stability than charged cathode material; 2X the temperature resistance of traditional poly-ethylene separators, enhancing safety and charging time.\n\no “We have almost 15 patents in solid-state batteries, it’s one of the three advanced technologies that we’re working on”, said COO Shane Smith. 15 might not look like a lot compared to QuantumScape, which holds over 200 patents and patent applications related to solid-state battery technology, but they operate in different markets, MVST in commercial vehicle batteries and QS more in the passenger EV batteries. Also, it’s important to mention that they are not really competitors at the moment, Microvast generated about $ 107 million in sales in 2020 and is expecting to generate more than $2 billion in sales in 2025 compared to QuantumScape, which will not generate meaningful revenues until 2026, according to the website “[barrons.com](https://barrons.com/)”.\n\n\\- The other material, the full concentration grid in the cathode, is a unique material made by Microvast. With this technology, they can tune the distribution of the transition metals across the particles, which allows them to maximize the capacity and maintain safety and at the same time minimize the cost and the risk by reducing the cobalt content. The material has a capacity 20% higher than the best material in the market and is 10% lower in cost. They have a production line that has been making 600 tons per year (for the past 3 years).\n\n**Partnership/Customers**\n\n\\- They have solid partnerships, including FPT (the global powertrain brand of CNH Industrial Group), Oshkosh (leading global innovator of mission-critical vehicles and essential equipment), Porsche, SAIC, and many more. Oshkosh also made a $25MM strategic investment in the PIPE, and signed joint development agreement highlighting future battery collaboration and integration. It is worth mentioning that Oshkosh received the USPS contract to replace its mail delivery trucks (the initial contract is. worth $482 million). Also, it is an open contract, meaning USPS will be able to order more vehicles throughout the 10-year contract ([they will order between 50,000 and 165,000 vehicles](https://www.oshkoshcorp.com/en/news/2-23-21-usps)). This is a lot of potential business for Microvast and could represent a serious catalyst in the future once more information is available. Oshkosh expects to start production in 2023, right when Microvast’s factory in Tennessee will be up and running. Remember, MVST went from $14 to $23 the day Oskosh got the USPS contract, this will definitely be a HUGE catalyst once we know more about it.\n\n\\- They can count as their customers some of the leading global bus OEMs including Yutong, Higer, Foton, King Long, VDL, and Wright Bus. Their batteries are being deployed across a broad range of commercial vehicles, including automated guided vehicles, port equipment, mining trucks, fork-lift trucks. They also have customer relationships with the likes of Kion, Kalmar, KoneCranes, Linde, PSA Singapore, and Gaussin. All of these names are recognized as leading OEMs in their particular area of focus.\n\n**Key advantages over its competitors**\n\nMicrovast is very unique in itself and it is hard to compare them with other public companies; some are fairly young compared to them and others are well established but operate in the passenger EV battery market and it is unclear when/if they will shift towards the manufacturing of commercial EV batteries.\n\nTheir closest competitor is probably \\*\\*\\* had to get rid of this competitor (market cap under 1bill) but the short answer is that MVST is 10 times better...\n\nIf we do a quick head-to-head comparison, we can see Microvast seems to have a clearer path to achieve its Revenue goals.\n\n\\*\\*\\* is headquartered in Los Angeles with a factory of 113K sq.ft compared to Microvast with its biggest factory in China (1.72MM sq.ft.), another one in Germany (170K sq.ft.), and one in the United States in 2022 (577K sq.ft.). In contrast, \\*\\*\\* has more than 200 employees and Microvast is expected to hire around 300 employees only for their new factory in Tennessee and they also have more than 500 employees working in the R&D division as mentioned before.\n\nIt looks like Microvast is better positioned to profit from global electrification with their factories established in three different parts of the world.\n\nThe picture below shows both their year-over-year revenues growth, which could be a bit misleading as they are not in the same business stage and operate in different continents for now. China and Europe lead the United States in electric commercial vehicles on the road, which could explain the difference.\n\n&#x200B;\n\nhttps://preview.redd.it/e6wzhoey0qf71.png?width=297&format=png&auto=webp&s=77984dcaac9f5762f2edc3dd7fc971418dfa0ed7\n\nBut the point I want to make here is that they rely on different things, \\*\\*\\* miss on revenues is due to the short-term limited number of battery cell providers, producing safe, high-performance cells suitable for the commercial electric vehicle market. “We know, we, and the whole industry, need more cells”, said the CEO of \\*\\*\\* in their latest earnings call. Whereas Microvast produces their own cells, relying more on the primary resources. See the picture below for Microvast 2021 projected Revenues as well as \\*\\*\\* forecasted and revised revenues.\n\n&#x200B;\n\nhttps://preview.redd.it/hbp0ee4x0qf71.png?width=253&format=png&auto=webp&s=23295bd6c127a150fb07bdfec94a2a814a5fc752\n\nOn the other hand, it is true that Microvast did not have earnings call yet to discuss their 2021 outlook but I believe they are in line to achieve their projected revenues. They had \\~ $107 MM in revenues in 2020 and if they keep the same YoY growth rate of 115% (Q1 2020 à Q1 2021), they will get to $230 MM by the end of the year. The key differentiator here is that Microvast manufactures their own cells, which ensures high quality, faster product development, greater customization to client needs, and tighter cost control as well as higher margins. The fact that Microvast has its own in-house manufacturing capacity is a clear competitive advantage to my eyes (see picture below, found on Microvast website).\n\n&#x200B;\n\nhttps://preview.redd.it/nkrsbv1r0qf71.png?width=468&format=png&auto=webp&s=a77943b9313e8bdb0ce659885fc94ab870543332\n\nBoth of these companies are currently highly valued based on their potential and future expected revenues. At their current market cap, \\*\\*\\* is selling at an estimated 2021 P/S ratio between 23 and 51 and MVST with an estimated 2021 P/S ratio of about 12. Once again, these two companies are not at the same business stage and I believe they will both succeed and grow at an impressive pace, however, MVST’s growth perspective and business model seem less risky and more predictable.\n\nI have a conservative 2023 Price target on MVST of $25 (that was for Seeking Alpha, let's be real here $25 is legit fair value for Microvast, it should trade at a premium for all its potential not a discount), which is more than a 200% increase from its current price of about 8$ and $25 also happens to be their 52 week-high. My price target is based on discounted 2023 revenues and a P/S ratio of 12 (85% of forecasted 2023 revenues (85%\\*751MM) \\* 12 = \\~$7,5 billion market cap). Considering their direct competitor is currently more expensive (P/S between 23-51) and other companies operating in a similar sector are trading at high valuations: Tesla (\\~20 P/S), Pro terra (\\~11 P/S), QuantumScape (Market cap of 9.5B without revenues yet), and Nikola (Market cap of \\~4B without revenues yet), Microvast can be considered as fairly cheap and this price target of $25 as conservative. It could easily go to $40 is what I meant.\n\n**TAM is estimated to be $30Bn + in 2025**\n\n· Battery providers are expected to play a pivotal role in the EV value chain: \\~ 30-40% of EV value resides in the battery.\n\n· The rotation from gas-powered commercial vehicles to electric-powered commercial vehicles might happen quicker than the rotation from gas passenger cars to electric passenger cars because of government funding. Also, with the lithium shortage, the world will have to mine more lithium but it would not make sense to use powered-gas trucks to mine to then build electric batteries for a greener future, I believe the U.S government as well as the other governments, will make sure we use clean energy to mine lithium or any other natural resources, which would benefit Microvast.\n\n· The demand is bigger than the supply at the moment with battery cell production in the U.S. just below 40 GWh in 2020, while battery demand exceeded 42 GWh. For context, achieving President Biden’s goal of a 100% electric fleet of U.S. government vehicles will require 69 GWh of battery cells. I believe Microvast is well-positioned to become a giant in the industry with their new factories; they planned ahead, which could give them a competitive advantage over their competitors.\n\n· EV Battery market is believed to be at a key inflection point (EV is 1.5% of 2020 sales – 8.5% by. 2025), which equals to an expected CAGR of 55% (based on sales in key markets: U.S, Europe, China, Japan & South Korea). Source: [Microvast investors presentation](https://microvast.com/app/uploads/2021/07/investor-presentation.pdf).\n\nØ There is a profound energy transition toward renewable energy driven by governmental policies that are synchronized for the first time, according to Frederique Carrier in the [RBC Global insight May 2021](https://www.rbcinsight.com/WM/Share/ResearchViewer/?SSS_550F5749FFF0E40F2A81B69264610173).\n\no The European Green Deal refocused the EU’s COVID-19 stimulus package onto renewables -charging infrastructure, power generation, and green hydrogen projects (allocating up to $600 billion to green projects).\n\no China’s 14th Five-Year Plan called for electric vehicles to constitute 20 percent of overall new car sales in China by 2021 from just 5% now (spending up to $1.5 trillion).\n\no Joe Biden won the U.S presidential election with a sweeping infrastructure program (up to $2 trillion).\n\no Microvast is well diversified in these three growing markets with its biggest factory in China (1.72MM sq.ft.), one in Germany (170K sq.ft.), and another one in production in the United States (577K sq.ft., expected to start production in 2022).\n\n\\- According to Shelby Tucker, RBC Capital Markets, LLC Utilities Analyst, the global market for batteries has the potential to grow 100 times by 2050.\n\nAlso, great find by [u/Little\\_Objective\\_683/](https://www.reddit.com/user/Little_Objective_683/) : The U.S department of energy (DOE) asked Microvast in 2019 to build a Li-ion battery facility in the United States to fulfill Microvast's biggest order to date, which will make Microvast the largest American Li-ion Manufacturer.\n\n&#x200B;\n\nhttps://preview.redd.it/7n6py2q11qf71.jpg?width=315&format=pjpg&auto=webp&s=3e40ba583ed4d5027fcb52d24d696a9eda469102\n\n**Global market presence**\n\nAfter primarily being focused on the PRC and Asia-Pacific regions, they are expanding their presence and product promotion to Europe and the United States to capitalize on the rapidly growing electrification markets. In 2021, they will be launching a marketing campaign to introduce Microvast to more potential customers in regions outside the Asia Pacific region and adding more headcounts to support business development ([source: Sec.gov; DEF14 form](https://sec.report/Document/0001213900-21-035581/defm14a_tuscanholdings.htm)).\n\nThe European market presents enormous growth opportunities for electric vehicles, driven by higher emission standards, reduced total cost of ownership compared to gas-based combustion engines, and growing environmental awareness. In the United States, they believe a new political administration is likely to push the electrification revolution through regulation. In pursuing contract opportunities with industry-leading companies in the United States, they have seen how their potential customers recognize the lower total cost of ownership for commercial vehicles and are seeking alternative forms of energy for energy storage applications.\n\nAs they expand their presence globally, they will continue to invest in their existing partnerships in the PRC and the Asia Pacific region and continue to grow their business there.\n\n&#x200B;\n\nhttps://preview.redd.it/00irgk431qf71.png?width=468&format=png&auto=webp&s=49bb262a01b29c15a45b58813e286e382434220e\n\n\\- Revenues in Europe decreased by about 22% while Revenues in PRC increased by more than 260%\n\n\\- I believe the decrease in Europe is temporary and was caused by the pandemic, since it affected the whole industry, as Panasonic mentioned in their latest earnings report. and with the new factory in Germany, it will become more convenient for European companies to try and buy Microvast’s products. According to the website [iea.org](https://www.iea.org/), new electric car registrations were about 3 million globally in 2020 and for the first time, Europe led with 1.4 million new registrations followed by China with 1.2 million and the United States with 295 000 new electric cars.\n\n**Bear Case**\n\nI could not find solid bear cases anywhere on Microvast other than “it’s a Chinese company, stay away” or “insiders are dumping shares on you, get out”.\n\nLet’s talk about the latter quickly. As found on [the sec.gov DEF14 filing for THCB](https://sec.report/Document/0001213900-21-035581/defm14a_tuscanholdings.htm) (SPAC that merged with Microvast),\n\n“Subject to certain exceptions, the Registration Rights and Lock-Up Agreement further provides (1) Wu will be subject to a lock-up of one year with respect to 25% of his shares and a lock-up of two years for the remaining 75% of his shares, provided that, with respect to the 25% of his shares subject to the one-year lock-up, he can sell those shares if the shares trade at $15.00 or above for 20 days in any 30-day period and (2) the Microvast equity holders other than Wu are subject to a six-month lock-up. The Registration Rights and Lock-Up Agreement further provides that the shares owned by the Sponsor Group will be subject to a lock-up. Specifically, with respect to 75% of the shares owned by the Sponsor Group, (a) 2/3rds of such shares are subject to a one-year lock-up unless the shares trade at $12.50 or above for any 20 trading days within a 30-trading day period and (b) the remaining 1/3rd of such shares are subject to a one-year lock-up. With respect to the remaining 25% of the shares owned by the Sponsor Group, (a) 50% of such shares are locked-up until the later of the one-year anniversary of the Closing and the date on which the shares trade at $12.00 or above for any 20 trading days within a 30-trading day period, (b) the remaining 50% of such shares are locked-up until the later of the one-year anniversary of the Closing and the date on which the shares trade at $15.00 or above for any 20 trading days within a 30-trading day period and (c) all of such shares are subject to forfeiture if such trading targets are not met by the fifth anniversary of the Closing.”.\n\nIn other words, insiders are not “dumping shares on us” at a price of about $8 (now $10) because of their lock-up agreement.\n\nShould you fear Microvast because it is a Chinese company? Perma bulls will tell you it is not a Chinese company as it is headquartered and founded in Houston, Texas. In reality, it really is a Chinese battery maker coming public through an American SPAC, [according to Dana Blankenhorn](https://www.nasdaq.com/articles/tuscan-holdings-is-gaining-traction-but-where-is-microvast-coming-from-2021-02-10) (let's not argue about this fellow retards, it doesn't really matter; China is years ahead of the U.S in EV). If you were on vacation the past couple of weeks, here’s what happened with the Chinese stocks:\n\n\\- A crackdown on education has spread to Chinese tech stocks and the whole Chinese market (MSCI China index delivered negative returns of -14% in July).\n\n\\- Investors fear the unpredictability of the Chinese government, which could explain the 40% drop in MVST share price in a month.\n\nSo, the question is, should you be greedy when others are fearful as Warren Buffet said? Or should you panic sell after a 40% drop in a month?\n\nHere’s what UBS Chief Investment Officer Mark Haefel had to say on China:\n\n“For the tech sector, Beijing remains focused on its long-term goal of technological self-sufficiency and leadership on the global stage. We believe the regulatory risk will continue in the socially sensitive sectors of property. And healthcare, we don’t expect the government will push these sectors to non-profit either”. Another important part that Mark Haefel discussed is directly related to Microvast: “Offshore equities are pricing in a higher risk premium. This is likely to linger in the near term. However, we think Future returns will be largely driven by earnings growth (mainly from cyclical and value sectors) this year. We recommend investors cherry-pick stocks across sectors that are supported by earnings growth but have limited regulatory risk exposure. Our preferred sectors include consumer durables and services, energy, and Greentech.”\n\nIn the short term, who knows where the stock price can go, however, if Microvast delivers on their promises, we will most likely see abnormal returns. I understand the risk of companies operating in China, but what I particularly like about Microvast is that they are diversifying away from China with their factory in Germany and one incoming in the United States, they will be on three different continents, which is worth something to my eyes.\n\nLet’s summarize what has been said before with a SWOT Analysis\n\nSWOT AnalysisStrengths:\n\nØ Unlike competitors who redesign existing batteries to fit them in EVs, Microvast has designed its batteries from the ground up specifically to address the problems facing EV batteries. Every step of the manufacturing process is controlled by Microvast, leading to higher quality and lower-cost products.\n\nØ Researchers from Microvast have developed a novel high-power battery technology that has a higher energy density, longer life, and safer operation than any other state-of-the-art lithium-ion battery on the market. The system is built from four breakthrough technologies and could potentially be used in plug-in hybrid electric vehicle and fully electric vehicle markets. Because of its many benefits, the technology has the potential to also enhance the performance of lithium-ion batteries used in cell phones and other smaller-scale applications, as well as in electric grid applications.\n\nØ $ 1.5B total contracted revenue in Pipeline through 2027, which will help Microvast to grow revenue at an expected CAGR of 87% from 2020-2025E\n\nWeaknesses:\n\nØ Being a “Chinese company”, U.S investors might not like it as much as a U.S company.\n\nØ Portfolio Managers being scared of investing in SPACs or even the “deSPACs phase “after the SPACs controversy in the beginning of 2021.\n\nOpportunities:\n\nØ There is three substantial untapped markets that Microvast plans on expanding their products offering to; Passenger Vehicles (PV), Energy Storage Solutions (ESS), and Battery Components (Consumer Electronics), which could expand their TAM by $45B.\n\nØ 2021: Begin Battery Production in the area of Berlin, Germany\n\nØ 2022: Begin Battery Production in Clarksville, TN\n\nThreats:\n\nØ Susceptible to disruption, many companies are trying to improve EV batteries and might not need Microvast in the foreseeable future.\n\nØ The Prices of Lithium-ion batteries have been plummeting over the past decade, and that trend is expected to continue in the coming years, which could impact Microvast’s profit margin.\n\nØ Other companies are working hard on lowering EV battery costs, one or more of them could make a battery substantially cheaper than Microvast.\n\nTo conclude, I believe the growth opportunity in the commercial EV battery sector is impressive as well as somewhat predictable as it makes sense for companies to go electric economically, financially, and environmentally. Microvast is well-positioned to capture a great portion of the total addressable market of $30 Bn and has the opportunity to dramatically increase their TAM if they expand their business to consumer electronics, passenger EV batteries, and energy storage solutions market. The fact that Microvast went public through a SPAC merger less than a week ago gives retail investors an edge to generate alpha as analysts have not started to cover the company yet. Microvast also fits the criteria of sustainable investing, a trend that is not about to die anytime soon. Overall, Microvast has everything it needs to become a successful company; it now just needs to deliver on its promises.\n\nSo, the real question is: does the upside outweigh the downside?\n\nYou tell me.\n\n\\*\\*Disclaimer\n\nI own shares and warrants of MVST.\n\nI am not a financial advisor, this should not be used as financial advice.\n\n\\[1\\] Wedbush presentation 4/8/2021",
  "author_fullname": "t2_cqyg0zoh",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 2,
  "clicked": false,
  "title": "Microvast ($MVST) -The only DD you'll ever need",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "DD"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "dd",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "00irgk431qf71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 47,
          "x": 108,
          "u": "https://preview.redd.it/00irgk431qf71.png?width=108&crop=smart&auto=webp&s=7e12e509499a5a3317a69df31c642b58381f3d6b"
        },
        {
          "y": 94,
          "x": 216,
          "u": "https://preview.redd.it/00irgk431qf71.png?width=216&crop=smart&auto=webp&s=87e61cfdc65f3dbf2962318cd8711840a86717e6"
        },
        {
          "y": 139,
          "x": 320,
          "u": "https://preview.redd.it/00irgk431qf71.png?width=320&crop=smart&auto=webp&s=8297938c24ebef2387ed54bdbb92f1e9147a4b00"
        }
      ],
      "s": {
        "y": 204,
        "x": 468,
        "u": "https://preview.redd.it/00irgk431qf71.png?width=468&format=png&auto=webp&s=49bb262a01b29c15a45b58813e286e382434220e"
      },
      "id": "00irgk431qf71"
    },
    "alqqdfwu0qf71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 31,
          "x": 108,
          "u": "https://preview.redd.it/alqqdfwu0qf71.png?width=108&crop=smart&auto=webp&s=90970279ce15cf32d6c97c01dd6b48d92e2dcfff"
        },
        {
          "y": 63,
          "x": 216,
          "u": "https://preview.redd.it/alqqdfwu0qf71.png?width=216&crop=smart&auto=webp&s=b84b1d2d82e6dc9d933e9f10d28c4f61fe9ede5d"
        },
        {
          "y": 94,
          "x": 320,
          "u": "https://preview.redd.it/alqqdfwu0qf71.png?width=320&crop=smart&auto=webp&s=66524044b624853e34e03cff6a5f616f5285a31b"
        }
      ],
      "s": {
        "y": 106,
        "x": 359,
        "u": "https://preview.redd.it/alqqdfwu0qf71.png?width=359&format=png&auto=webp&s=f607dd17a8b1c6817205d2e9b561ca0c22eb26dc"
      },
      "id": "alqqdfwu0qf71"
    },
    "nkrsbv1r0qf71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 30,
          "x": 108,
          "u": "https://preview.redd.it/nkrsbv1r0qf71.png?width=108&crop=smart&auto=webp&s=bea64d290c8c56752d6b6c8b7d2cffbb51c15c3f"
        },
        {
          "y": 61,
          "x": 216,
          "u": "https://preview.redd.it/nkrsbv1r0qf71.png?width=216&crop=smart&auto=webp&s=a74ab3de154b28ab357c1ddf945ed3747b7cb077"
        },
        {
          "y": 91,
          "x": 320,
          "u": "https://preview.redd.it/nkrsbv1r0qf71.png?width=320&crop=smart&auto=webp&s=614a96433eaca9ccff32e675b07f2996e20a26ce"
        }
      ],
      "s": {
        "y": 134,
        "x": 468,
        "u": "https://preview.redd.it/nkrsbv1r0qf71.png?width=468&format=png&auto=webp&s=a77943b9313e8bdb0ce659885fc94ab870543332"
      },
      "id": "nkrsbv1r0qf71"
    },
    "e6wzhoey0qf71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 23,
          "x": 108,
          "u": "https://preview.redd.it/e6wzhoey0qf71.png?width=108&crop=smart&auto=webp&s=ad1e46b313305eb0bcad81fbe6157f8768af4af5"
        },
        {
          "y": 46,
          "x": 216,
          "u": "https://preview.redd.it/e6wzhoey0qf71.png?width=216&crop=smart&auto=webp&s=59c1a2e241513eb733b61d397a795e65cd71bc2f"
        }
      ],
      "s": {
        "y": 64,
        "x": 297,
        "u": "https://preview.redd.it/e6wzhoey0qf71.png?width=297&format=png&auto=webp&s=77984dcaac9f5762f2edc3dd7fc971418dfa0ed7"
      },
      "id": "e6wzhoey0qf71"
    },
    "hbp0ee4x0qf71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 39,
          "x": 108,
          "u": "https://preview.redd.it/hbp0ee4x0qf71.png?width=108&crop=smart&auto=webp&s=004e48a14dfc546fc8118f3c5f13bbe936daff69"
        },
        {
          "y": 78,
          "x": 216,
          "u": "https://preview.redd.it/hbp0ee4x0qf71.png?width=216&crop=smart&auto=webp&s=683735802ae05d57da2b00a954997f8e27547dd3"
        }
      ],
      "s": {
        "y": 92,
        "x": 253,
        "u": "https://preview.redd.it/hbp0ee4x0qf71.png?width=253&format=png&auto=webp&s=23295bd6c127a150fb07bdfec94a2a814a5fc752"
      },
      "id": "hbp0ee4x0qf71"
    },
    "7n6py2q11qf71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 216,
          "x": 108,
          "u": "https://preview.redd.it/7n6py2q11qf71.jpg?width=108&crop=smart&auto=webp&s=433c46d62d0d6aea79d6db40418be40f69a37bde"
        },
        {
          "y": 432,
          "x": 216,
          "u": "https://preview.redd.it/7n6py2q11qf71.jpg?width=216&crop=smart&auto=webp&s=3ebe60b0ce719829437ab7695844bcb64332eebf"
        }
      ],
      "s": {
        "y": 648,
        "x": 315,
        "u": "https://preview.redd.it/7n6py2q11qf71.jpg?width=315&format=pjpg&auto=webp&s=3e40ba583ed4d5027fcb52d24d696a9eda469102"
      },
      "id": "7n6py2q11qf71"
    }
  },
  "name": "t3_oz4ka3",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.89,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 2390,
  "total_awards_received": 44,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": true,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "DD",
  "can_mod_post": false,
  "score": 2390,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 13,
    "gid_2": 2
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1628248495,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Listen up retards, this won&#39;t be short.</p>\n\n<p>This was not meant for you apes; Seek ing alpha denied my article because they don&#39;t want recent SPACs merger on their website.</p>\n\n<p>So instead of earning cash to spend it on stupid shit, I&#39;m here wasting my time for you all because I don&#39;t want 50 hours and 4000 words of research to go to waste, let me tell you gamblers why Microvast ($MVST) is a Hidden gem.</p>\n\n<p>First of all, you retards probably came for the short squeeze potential, rumor has it, there&#39;s not many shares left to short sell and Microvast is down 60% from its peak (even after yesterday&#39;s 20%+ run), but I could not care less about that, MVST will trade significantly higher once decent analysts start coverage on it and this post will tell you why. You guys are so lucky to have found this now, I&#39;ve been holding since November when it was $11, so the price right now is still dirt cheap (it was $15 two weeks ago...).</p>\n\n<p>Quick introduction for those of you who don’t know what Microvast is and what it does. Microvast is a technology innovator for Li-ion batteries that designs, develops and manufactures battery systems for commercial electric vehicles and energy storage that feature ultra-fast charging capabilities, long life and superior safety. Microvast believes the ultra-fast charging capabilities of its battery systems make charging electric vehicles as convenient as fueling conventional vehicles and believes the long battery life of its battery systems reduces the total cost of ownership of electric vehicles.</p>\n\n<p>Microvast is expected to grow at a compounded annual growth rate of 87%, their estimates are justified by the growing desire for electrification as well as the growing demand for clean energy and the zero-carbon revolution.</p>\n\n<p>The forecasted battery components revenues (see picture below) come from Microvast being vertically integrated. Their battery components are world-class, significantly differentiating and they are going to sell those parts to some key cell manufacturers in the passenger EV market (specifically their aramid separator and their gradient cathode). They currently ship to passenger vehicle applications (SAIC) but are also engaging with passenger OEMs that have made the announcement that they will manufacture their own batteries (with battery components)[1]. They also plan to do the same thing with consumer electronics.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/alqqdfwu0qf71.png?width=359&amp;format=png&amp;auto=webp&amp;s=f607dd17a8b1c6817205d2e9b561ca0c22eb26dc\">https://preview.redd.it/alqqdfwu0qf71.png?width=359&amp;format=png&amp;auto=webp&amp;s=f607dd17a8b1c6817205d2e9b561ca0c22eb26dc</a></p>\n\n<p>Microvast&#39;s projected revenues</p>\n\n<p>While their projections may seem optimistic, they were able to secure partnerships with industry leaders representing over $1.5 Bn in contracted revenue through 2027. $44 millions, $125 millions, $172 millions, $250 millions, and $355 millions for 2021, 2022, 2023, 2024, and 2025 respectively. Those numbers were before they recently announced a partnership with eVersum, a high-tech vehicle OEM, specialized in the design, development, and build of the most purposely engineered electric commercial vehicles for passenger transport. The deal has a potential volume forecasted to be more than 100 million €.</p>\n\n<p>There’s a great interview on <a href=\"https://cheddar.com/media/microvast-goes-public-on-nasdaq-via-spac\">cheddar news</a> with Shane Smith, COO of Microvast, where he talks about why Microvast went public and raised more than $800 million: “We raised capital to support orders we already had in place. We’ve won more business than we’ve had capacity for”. It seems like Microvast has a great problem; the demand is bigger than the supply at the moment, which is great news as they may not need to spend a lot on marketing if customers are coming to them directly.</p>\n\n<p>- Microvast has over a decade of expertise in designing and manufacturing battery components (Cells, electrolytes, packs, separators). That differentiates them from most of the other battery makers who source their components from the vendors. It is important to note the cell makers do not have the right to produce the material that they did not invent or have the license for. “Microvast invented and manufactures the key battery materials to ensure unique performance and by also guaranteeing the leading time because the material patents are the strongest patents, legally protected and our success is founded on our deep technology portfolio which is wholly owned and protected by over 550 patents (and patent applications)”, said Dr. Mattis, Chief Technology Officer of the company.</p>\n\n<p>- They have more than 1800 employees including more than 500 employees in the R&amp;D division.</p>\n\n<p>- They have 28000+ Battery systems in operation in 19 different countries.</p>\n\n<p>- More than 3.8Bn Miles of operational distance was covered with no major safety incidents.</p>\n\n<p>- Their Batteries can run at a high temperature for a long time and they won’t explode. They have this proprietary way for their Batteries to be 90% as efficient as brand-new ones after 10,000 charges.</p>\n\n<p>- Among all of Microvast’s products, two stands out that no one else in the world has: the 100% Aramid separator and the full concentration of the grading of the material.</p>\n\n<p>o “One of the perks for the solid-state battery is on shrinking separators and with our Aramid separator, we are there”, Dr Wenjuan Mattis said in the Wedbush conference held on April 8th2021. For the fans of solid-state batteries, this could be a major catalyst incoming. Their Aramid separator has higher thermal stability than charged cathode material; 2X the temperature resistance of traditional poly-ethylene separators, enhancing safety and charging time.</p>\n\n<p>o “We have almost 15 patents in solid-state batteries, it’s one of the three advanced technologies that we’re working on”, said COO Shane Smith. 15 might not look like a lot compared to QuantumScape, which holds over 200 patents and patent applications related to solid-state battery technology, but they operate in different markets, MVST in commercial vehicle batteries and QS more in the passenger EV batteries. Also, it’s important to mention that they are not really competitors at the moment, Microvast generated about $ 107 million in sales in 2020 and is expecting to generate more than $2 billion in sales in 2025 compared to QuantumScape, which will not generate meaningful revenues until 2026, according to the website “<a href=\"https://barrons.com/\">barrons.com</a>”.</p>\n\n<p>- The other material, the full concentration grid in the cathode, is a unique material made by Microvast. With this technology, they can tune the distribution of the transition metals across the particles, which allows them to maximize the capacity and maintain safety and at the same time minimize the cost and the risk by reducing the cobalt content. The material has a capacity 20% higher than the best material in the market and is 10% lower in cost. They have a production line that has been making 600 tons per year (for the past 3 years).</p>\n\n<p><strong>Partnership/Customers</strong></p>\n\n<p>- They have solid partnerships, including FPT (the global powertrain brand of CNH Industrial Group), Oshkosh (leading global innovator of mission-critical vehicles and essential equipment), Porsche, SAIC, and many more. Oshkosh also made a $25MM strategic investment in the PIPE, and signed joint development agreement highlighting future battery collaboration and integration. It is worth mentioning that Oshkosh received the USPS contract to replace its mail delivery trucks (the initial contract is. worth $482 million). Also, it is an open contract, meaning USPS will be able to order more vehicles throughout the 10-year contract (<a href=\"https://www.oshkoshcorp.com/en/news/2-23-21-usps\">they will order between 50,000 and 165,000 vehicles</a>). This is a lot of potential business for Microvast and could represent a serious catalyst in the future once more information is available. Oshkosh expects to start production in 2023, right when Microvast’s factory in Tennessee will be up and running. Remember, MVST went from $14 to $23 the day Oskosh got the USPS contract, this will definitely be a HUGE catalyst once we know more about it.</p>\n\n<p>- They can count as their customers some of the leading global bus OEMs including Yutong, Higer, Foton, King Long, VDL, and Wright Bus. Their batteries are being deployed across a broad range of commercial vehicles, including automated guided vehicles, port equipment, mining trucks, fork-lift trucks. They also have customer relationships with the likes of Kion, Kalmar, KoneCranes, Linde, PSA Singapore, and Gaussin. All of these names are recognized as leading OEMs in their particular area of focus.</p>\n\n<p><strong>Key advantages over its competitors</strong></p>\n\n<p>Microvast is very unique in itself and it is hard to compare them with other public companies; some are fairly young compared to them and others are well established but operate in the passenger EV battery market and it is unclear when/if they will shift towards the manufacturing of commercial EV batteries.</p>\n\n<p>Their closest competitor is probably *** had to get rid of this competitor (market cap under 1bill) but the short answer is that MVST is 10 times better...</p>\n\n<p>If we do a quick head-to-head comparison, we can see Microvast seems to have a clearer path to achieve its Revenue goals.</p>\n\n<p>*** is headquartered in Los Angeles with a factory of 113K sq.ft compared to Microvast with its biggest factory in China (1.72MM sq.ft.), another one in Germany (170K sq.ft.), and one in the United States in 2022 (577K sq.ft.). In contrast, *** has more than 200 employees and Microvast is expected to hire around 300 employees only for their new factory in Tennessee and they also have more than 500 employees working in the R&amp;D division as mentioned before.</p>\n\n<p>It looks like Microvast is better positioned to profit from global electrification with their factories established in three different parts of the world.</p>\n\n<p>The picture below shows both their year-over-year revenues growth, which could be a bit misleading as they are not in the same business stage and operate in different continents for now. China and Europe lead the United States in electric commercial vehicles on the road, which could explain the difference.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/e6wzhoey0qf71.png?width=297&amp;format=png&amp;auto=webp&amp;s=77984dcaac9f5762f2edc3dd7fc971418dfa0ed7\">https://preview.redd.it/e6wzhoey0qf71.png?width=297&amp;format=png&amp;auto=webp&amp;s=77984dcaac9f5762f2edc3dd7fc971418dfa0ed7</a></p>\n\n<p>But the point I want to make here is that they rely on different things, *** miss on revenues is due to the short-term limited number of battery cell providers, producing safe, high-performance cells suitable for the commercial electric vehicle market. “We know, we, and the whole industry, need more cells”, said the CEO of *** in their latest earnings call. Whereas Microvast produces their own cells, relying more on the primary resources. See the picture below for Microvast 2021 projected Revenues as well as *** forecasted and revised revenues.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/hbp0ee4x0qf71.png?width=253&amp;format=png&amp;auto=webp&amp;s=23295bd6c127a150fb07bdfec94a2a814a5fc752\">https://preview.redd.it/hbp0ee4x0qf71.png?width=253&amp;format=png&amp;auto=webp&amp;s=23295bd6c127a150fb07bdfec94a2a814a5fc752</a></p>\n\n<p>On the other hand, it is true that Microvast did not have earnings call yet to discuss their 2021 outlook but I believe they are in line to achieve their projected revenues. They had ~ $107 MM in revenues in 2020 and if they keep the same YoY growth rate of 115% (Q1 2020 à Q1 2021), they will get to $230 MM by the end of the year. The key differentiator here is that Microvast manufactures their own cells, which ensures high quality, faster product development, greater customization to client needs, and tighter cost control as well as higher margins. The fact that Microvast has its own in-house manufacturing capacity is a clear competitive advantage to my eyes (see picture below, found on Microvast website).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/nkrsbv1r0qf71.png?width=468&amp;format=png&amp;auto=webp&amp;s=a77943b9313e8bdb0ce659885fc94ab870543332\">https://preview.redd.it/nkrsbv1r0qf71.png?width=468&amp;format=png&amp;auto=webp&amp;s=a77943b9313e8bdb0ce659885fc94ab870543332</a></p>\n\n<p>Both of these companies are currently highly valued based on their potential and future expected revenues. At their current market cap, *** is selling at an estimated 2021 P/S ratio between 23 and 51 and MVST with an estimated 2021 P/S ratio of about 12. Once again, these two companies are not at the same business stage and I believe they will both succeed and grow at an impressive pace, however, MVST’s growth perspective and business model seem less risky and more predictable.</p>\n\n<p>I have a conservative 2023 Price target on MVST of $25 (that was for Seeking Alpha, let&#39;s be real here $25 is legit fair value for Microvast, it should trade at a premium for all its potential not a discount), which is more than a 200% increase from its current price of about 8$ and $25 also happens to be their 52 week-high. My price target is based on discounted 2023 revenues and a P/S ratio of 12 (85% of forecasted 2023 revenues (85%*751MM) * 12 = ~$7,5 billion market cap). Considering their direct competitor is currently more expensive (P/S between 23-51) and other companies operating in a similar sector are trading at high valuations: Tesla (~20 P/S), Pro terra (~11 P/S), QuantumScape (Market cap of 9.5B without revenues yet), and Nikola (Market cap of ~4B without revenues yet), Microvast can be considered as fairly cheap and this price target of $25 as conservative. It could easily go to $40 is what I meant.</p>\n\n<p><strong>TAM is estimated to be $30Bn + in 2025</strong></p>\n\n<p>· Battery providers are expected to play a pivotal role in the EV value chain: ~ 30-40% of EV value resides in the battery.</p>\n\n<p>· The rotation from gas-powered commercial vehicles to electric-powered commercial vehicles might happen quicker than the rotation from gas passenger cars to electric passenger cars because of government funding. Also, with the lithium shortage, the world will have to mine more lithium but it would not make sense to use powered-gas trucks to mine to then build electric batteries for a greener future, I believe the U.S government as well as the other governments, will make sure we use clean energy to mine lithium or any other natural resources, which would benefit Microvast.</p>\n\n<p>· The demand is bigger than the supply at the moment with battery cell production in the U.S. just below 40 GWh in 2020, while battery demand exceeded 42 GWh. For context, achieving President Biden’s goal of a 100% electric fleet of U.S. government vehicles will require 69 GWh of battery cells. I believe Microvast is well-positioned to become a giant in the industry with their new factories; they planned ahead, which could give them a competitive advantage over their competitors.</p>\n\n<p>· EV Battery market is believed to be at a key inflection point (EV is 1.5% of 2020 sales – 8.5% by. 2025), which equals to an expected CAGR of 55% (based on sales in key markets: U.S, Europe, China, Japan &amp; South Korea). Source: <a href=\"https://microvast.com/app/uploads/2021/07/investor-presentation.pdf\">Microvast investors presentation</a>.</p>\n\n<p>Ø There is a profound energy transition toward renewable energy driven by governmental policies that are synchronized for the first time, according to Frederique Carrier in the <a href=\"https://www.rbcinsight.com/WM/Share/ResearchViewer/?SSS_550F5749FFF0E40F2A81B69264610173\">RBC Global insight May 2021</a>.</p>\n\n<p>o The European Green Deal refocused the EU’s COVID-19 stimulus package onto renewables -charging infrastructure, power generation, and green hydrogen projects (allocating up to $600 billion to green projects).</p>\n\n<p>o China’s 14th Five-Year Plan called for electric vehicles to constitute 20 percent of overall new car sales in China by 2021 from just 5% now (spending up to $1.5 trillion).</p>\n\n<p>o Joe Biden won the U.S presidential election with a sweeping infrastructure program (up to $2 trillion).</p>\n\n<p>o Microvast is well diversified in these three growing markets with its biggest factory in China (1.72MM sq.ft.), one in Germany (170K sq.ft.), and another one in production in the United States (577K sq.ft., expected to start production in 2022).</p>\n\n<p>- According to Shelby Tucker, RBC Capital Markets, LLC Utilities Analyst, the global market for batteries has the potential to grow 100 times by 2050.</p>\n\n<p>Also, great find by <a href=\"https://www.reddit.com/user/Little_Objective_683/\">u/Little_Objective_683/</a> : The U.S department of energy (DOE) asked Microvast in 2019 to build a Li-ion battery facility in the United States to fulfill Microvast&#39;s biggest order to date, which will make Microvast the largest American Li-ion Manufacturer.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7n6py2q11qf71.jpg?width=315&amp;format=pjpg&amp;auto=webp&amp;s=3e40ba583ed4d5027fcb52d24d696a9eda469102\">https://preview.redd.it/7n6py2q11qf71.jpg?width=315&amp;format=pjpg&amp;auto=webp&amp;s=3e40ba583ed4d5027fcb52d24d696a9eda469102</a></p>\n\n<p><strong>Global market presence</strong></p>\n\n<p>After primarily being focused on the PRC and Asia-Pacific regions, they are expanding their presence and product promotion to Europe and the United States to capitalize on the rapidly growing electrification markets. In 2021, they will be launching a marketing campaign to introduce Microvast to more potential customers in regions outside the Asia Pacific region and adding more headcounts to support business development (<a href=\"https://sec.report/Document/0001213900-21-035581/defm14a_tuscanholdings.htm\">source: Sec.gov; DEF14 form</a>).</p>\n\n<p>The European market presents enormous growth opportunities for electric vehicles, driven by higher emission standards, reduced total cost of ownership compared to gas-based combustion engines, and growing environmental awareness. In the United States, they believe a new political administration is likely to push the electrification revolution through regulation. In pursuing contract opportunities with industry-leading companies in the United States, they have seen how their potential customers recognize the lower total cost of ownership for commercial vehicles and are seeking alternative forms of energy for energy storage applications.</p>\n\n<p>As they expand their presence globally, they will continue to invest in their existing partnerships in the PRC and the Asia Pacific region and continue to grow their business there.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/00irgk431qf71.png?width=468&amp;format=png&amp;auto=webp&amp;s=49bb262a01b29c15a45b58813e286e382434220e\">https://preview.redd.it/00irgk431qf71.png?width=468&amp;format=png&amp;auto=webp&amp;s=49bb262a01b29c15a45b58813e286e382434220e</a></p>\n\n<p>- Revenues in Europe decreased by about 22% while Revenues in PRC increased by more than 260%</p>\n\n<p>- I believe the decrease in Europe is temporary and was caused by the pandemic, since it affected the whole industry, as Panasonic mentioned in their latest earnings report. and with the new factory in Germany, it will become more convenient for European companies to try and buy Microvast’s products. According to the website <a href=\"https://www.iea.org/\">iea.org</a>, new electric car registrations were about 3 million globally in 2020 and for the first time, Europe led with 1.4 million new registrations followed by China with 1.2 million and the United States with 295 000 new electric cars.</p>\n\n<p><strong>Bear Case</strong></p>\n\n<p>I could not find solid bear cases anywhere on Microvast other than “it’s a Chinese company, stay away” or “insiders are dumping shares on you, get out”.</p>\n\n<p>Let’s talk about the latter quickly. As found on <a href=\"https://sec.report/Document/0001213900-21-035581/defm14a_tuscanholdings.htm\">the sec.gov DEF14 filing for THCB</a> (SPAC that merged with Microvast),</p>\n\n<p>“Subject to certain exceptions, the Registration Rights and Lock-Up Agreement further provides (1) Wu will be subject to a lock-up of one year with respect to 25% of his shares and a lock-up of two years for the remaining 75% of his shares, provided that, with respect to the 25% of his shares subject to the one-year lock-up, he can sell those shares if the shares trade at $15.00 or above for 20 days in any 30-day period and (2) the Microvast equity holders other than Wu are subject to a six-month lock-up. The Registration Rights and Lock-Up Agreement further provides that the shares owned by the Sponsor Group will be subject to a lock-up. Specifically, with respect to 75% of the shares owned by the Sponsor Group, (a) 2/3rds of such shares are subject to a one-year lock-up unless the shares trade at $12.50 or above for any 20 trading days within a 30-trading day period and (b) the remaining 1/3rd of such shares are subject to a one-year lock-up. With respect to the remaining 25% of the shares owned by the Sponsor Group, (a) 50% of such shares are locked-up until the later of the one-year anniversary of the Closing and the date on which the shares trade at $12.00 or above for any 20 trading days within a 30-trading day period, (b) the remaining 50% of such shares are locked-up until the later of the one-year anniversary of the Closing and the date on which the shares trade at $15.00 or above for any 20 trading days within a 30-trading day period and (c) all of such shares are subject to forfeiture if such trading targets are not met by the fifth anniversary of the Closing.”.</p>\n\n<p>In other words, insiders are not “dumping shares on us” at a price of about $8 (now $10) because of their lock-up agreement.</p>\n\n<p>Should you fear Microvast because it is a Chinese company? Perma bulls will tell you it is not a Chinese company as it is headquartered and founded in Houston, Texas. In reality, it really is a Chinese battery maker coming public through an American SPAC, <a href=\"https://www.nasdaq.com/articles/tuscan-holdings-is-gaining-traction-but-where-is-microvast-coming-from-2021-02-10\">according to Dana Blankenhorn</a> (let&#39;s not argue about this fellow retards, it doesn&#39;t really matter; China is years ahead of the U.S in EV). If you were on vacation the past couple of weeks, here’s what happened with the Chinese stocks:</p>\n\n<p>- A crackdown on education has spread to Chinese tech stocks and the whole Chinese market (MSCI China index delivered negative returns of -14% in July).</p>\n\n<p>- Investors fear the unpredictability of the Chinese government, which could explain the 40% drop in MVST share price in a month.</p>\n\n<p>So, the question is, should you be greedy when others are fearful as Warren Buffet said? Or should you panic sell after a 40% drop in a month?</p>\n\n<p>Here’s what UBS Chief Investment Officer Mark Haefel had to say on China:</p>\n\n<p>“For the tech sector, Beijing remains focused on its long-term goal of technological self-sufficiency and leadership on the global stage. We believe the regulatory risk will continue in the socially sensitive sectors of property. And healthcare, we don’t expect the government will push these sectors to non-profit either”. Another important part that Mark Haefel discussed is directly related to Microvast: “Offshore equities are pricing in a higher risk premium. This is likely to linger in the near term. However, we think Future returns will be largely driven by earnings growth (mainly from cyclical and value sectors) this year. We recommend investors cherry-pick stocks across sectors that are supported by earnings growth but have limited regulatory risk exposure. Our preferred sectors include consumer durables and services, energy, and Greentech.”</p>\n\n<p>In the short term, who knows where the stock price can go, however, if Microvast delivers on their promises, we will most likely see abnormal returns. I understand the risk of companies operating in China, but what I particularly like about Microvast is that they are diversifying away from China with their factory in Germany and one incoming in the United States, they will be on three different continents, which is worth something to my eyes.</p>\n\n<p>Let’s summarize what has been said before with a SWOT Analysis</p>\n\n<p>SWOT AnalysisStrengths:</p>\n\n<p>Ø Unlike competitors who redesign existing batteries to fit them in EVs, Microvast has designed its batteries from the ground up specifically to address the problems facing EV batteries. Every step of the manufacturing process is controlled by Microvast, leading to higher quality and lower-cost products.</p>\n\n<p>Ø Researchers from Microvast have developed a novel high-power battery technology that has a higher energy density, longer life, and safer operation than any other state-of-the-art lithium-ion battery on the market. The system is built from four breakthrough technologies and could potentially be used in plug-in hybrid electric vehicle and fully electric vehicle markets. Because of its many benefits, the technology has the potential to also enhance the performance of lithium-ion batteries used in cell phones and other smaller-scale applications, as well as in electric grid applications.</p>\n\n<p>Ø $ 1.5B total contracted revenue in Pipeline through 2027, which will help Microvast to grow revenue at an expected CAGR of 87% from 2020-2025E</p>\n\n<p>Weaknesses:</p>\n\n<p>Ø Being a “Chinese company”, U.S investors might not like it as much as a U.S company.</p>\n\n<p>Ø Portfolio Managers being scared of investing in SPACs or even the “deSPACs phase “after the SPACs controversy in the beginning of 2021.</p>\n\n<p>Opportunities:</p>\n\n<p>Ø There is three substantial untapped markets that Microvast plans on expanding their products offering to; Passenger Vehicles (PV), Energy Storage Solutions (ESS), and Battery Components (Consumer Electronics), which could expand their TAM by $45B.</p>\n\n<p>Ø 2021: Begin Battery Production in the area of Berlin, Germany</p>\n\n<p>Ø 2022: Begin Battery Production in Clarksville, TN</p>\n\n<p>Threats:</p>\n\n<p>Ø Susceptible to disruption, many companies are trying to improve EV batteries and might not need Microvast in the foreseeable future.</p>\n\n<p>Ø The Prices of Lithium-ion batteries have been plummeting over the past decade, and that trend is expected to continue in the coming years, which could impact Microvast’s profit margin.</p>\n\n<p>Ø Other companies are working hard on lowering EV battery costs, one or more of them could make a battery substantially cheaper than Microvast.</p>\n\n<p>To conclude, I believe the growth opportunity in the commercial EV battery sector is impressive as well as somewhat predictable as it makes sense for companies to go electric economically, financially, and environmentally. Microvast is well-positioned to capture a great portion of the total addressable market of $30 Bn and has the opportunity to dramatically increase their TAM if they expand their business to consumer electronics, passenger EV batteries, and energy storage solutions market. The fact that Microvast went public through a SPAC merger less than a week ago gives retail investors an edge to generate alpha as analysts have not started to cover the company yet. Microvast also fits the criteria of sustainable investing, a trend that is not about to die anytime soon. Overall, Microvast has everything it needs to become a successful company; it now just needs to deliver on its promises.</p>\n\n<p>So, the real question is: does the upside outweigh the downside?</p>\n\n<p>You tell me.</p>\n\n<p>**Disclaimer</p>\n\n<p>I own shares and warrants of MVST.</p>\n\n<p>I am not a financial advisor, this should not be used as financial advice.</p>\n\n<p>[1] Wedbush presentation 4/8/2021</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#365b8c",
  "id": "oz4ka3",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Wild-Fisherman-2573",
  "discussion_type": null,
  "num_comments": 353,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/oz4ka3/microvast_mvst_the_only_dd_youll_ever_need/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/oz4ka3/microvast_mvst_the_only_dd_youll_ever_need/",
  "subreddit_subscribers": 10719053,
  "created_utc": 1628268275,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1628248495,
  "the_new_excerpt": "Listen up retards, this won't be short.\n\nThis was not meant for you apes; Seek ing alpha denied my article because they\ndon't want recent SPACs merger on their website.\n\nSo instead of earning cash to spend it on stupid shit, I'm here wasting my time\nfor you all because I don't want 50 hours and 4000…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "聞いてください、これは短いものではありません。\n\nこれはあなた方猿のためのものではありません。\n最近のSPACの合併をウェブサイトに載せたくないからだ。\n\nだから、お金を稼いでくだらないことに使う代わりに、私はここで時間を無駄にしているのです。\n私は50時間と4000ドルを望んでいないので、皆さんのためにここで時間を無駄にしています...",
      "title": "Microvast ($MVST) -あなたが必要とする唯一のDD"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "听好了，弱智们，这不会很短。\n\n这不是为你们这些猿人准备的；Seeking alpha拒绝了我的文章，因为他们\n不希望最近的SPACs合并在他们的网站上。\n\n因此，我没有赚取现金花在愚蠢的事情上，而是在这里浪费了我的时间\n因为我不想要50个小时和4000个......",
      "title": "Microvast ($MVST) -你唯一需要的DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽好了，弱智們，這不會很短。\n\n這不是爲你們這些猿人準備的；Seeking alpha拒絕了我的文章，因爲他們\n不希望最近的SPACs合併在他們的網站上。\n\n因此，我沒有賺取現金花在愚蠢的事情上，而是在這裏浪費了我的時間\n因爲我不想要50個小時和4000個......",
      "title": "Microvast ($MVST) -你唯一需要的DD"
    }
  ],
  "source_updated_at": 1628847701237
}