{
  "author": "Financial_Cable9276",
  "the_new_excerpt": "Why are these people trying so hard to bring the price down? Trying so hard to\nprevent others from buying the dip? Acting as if they’re trying to protect\nothers from losing money. Since when did a stranger on the internet try so hard\nto help me protect my best interest? Then it hit me...\n\nNEVER.\n\nSo…",
  "original_created_utc": 1621782146,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜこの人たちは価格を下げようと必死になっているのか？一生懸命になっているのは\n他の人がディップを買うのを防ごうとするのか？まるで他人が損をしないように守るかのように\nあたかも他人が損をしないように守るかのように。いつからインターネット上の見知らぬ人が私の利益を守るために一生懸命になったのだろうか？\n自分の利益を守ろうとしてくれたのだろうか？そして、私はピンときたのです。\n\n一度もない。\n\nだから...",
      "title": "多くのFUDと不安を抱えながら、私は自分自身に問いかけました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么这些人如此努力地想把价格降下来？如此努力地试图\n阻止别人买下这块地？表现得好像他们在努力保护\n别人不赔钱。从什么时候开始，互联网上的一个陌生人如此努力地试图\n来帮助我保护我的最大利益？然后我想到了...\n\n永远不会。\n\n所以...",
      "title": "这么多的FUD和担心，所以我问自己......。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼這些人如此努力地想把價格降下來？如此努力地試圖\n阻止別人買下這塊地？表現得好像他們在努力保護\n別人不賠錢。從什麼時候開始，互聯網上的一個陌生人如此努力地試圖\n來幫助我保護我的最大利益？然後我想到了...\n\n永遠不會。\n\n所以...",
      "title": "這麼多的FUD和擔心，所以我問自己......。"
    }
  ],
  "title": "So much FUD and worried so i asked myself...",
  "created_utc": 1621801834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why are these people trying so hard to bring the price down? Trying so hard to prevent others from buying the dip? Acting as if they’re trying to protect others from losing money. Since when did a stranger on the internet try so hard to help me protect my best interest? Then it hit me...</p>\n\n<p>NEVER. </p>\n\n<p>So i bought more. Now im gonna go out and ruin this beautiful day with a shitty round of golf.</p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/Bitcoin/comments/nj9ib2/so_much_fud_and_worried_so_i_asked_myself/",
  "subreddit": "Bitcoin",
  "id": "nj9ib2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197380035
}