{
  "author": "JazzyJayKarr",
  "the_new_excerpt": "The Complete Guide to Coinbase Fees (and How to Avoid Them)\n\nThere are so many new subs to this forum and a lot of them are Coinbase users.\nYeah Coinbase has a cool graph that shows you your portfolio. It’s also very\neasy to use for a beginner.\n\nNow there is nothing wrong with Coinbase (except, of…",
  "original_created_utc": 1623456331,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Coinbaseの手数料に関する完全ガイド（およびその回避方法\n\nこのフォーラムには多くの新しいユーザーが参加していますが、その多くがCoinbaseのユーザーです。\nコインベースには、自分のポートフォリオを表示するクールなグラフがあります。また、初心者にとってはとても\n初心者にとってはとても使いやすいものです。\n\n現在、Coinbaseには何の問題もありません（ただし、...",
      "title": "コインベースの手数料に関する完全ガイド（およびその回避方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于Coinbase费用的完整指南（以及如何避免这些费用\n\n这个论坛有很多新的子用户，其中有很多是Coinbase的用户。\n是的，Coinbase有一个很酷的图表，显示你的投资组合。它也非常\n对于一个初学者来说，它也很容易使用。\n\n现在，Coinbase没有任何问题（除了，...",
      "title": "关于Coinbase费用的完整指南（以及如何避免这些费用）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於Coinbase費用的完整指南（以及如何避免這些費用\n\n這個論壇有很多新的子用戶，其中有很多是Coinbase的用戶。\n是的，Coinbase有一個很酷的圖表，顯示你的投資組合。它也非常\n對於一個初學者來說，它也很容易使用。\n\n現在，Coinbase沒有任何問題（除了，...",
      "title": "關於Coinbase費用的完整指南（以及如何避免這些費用）。"
    }
  ],
  "title": "The Complete Guide to Coinbase Fees (and How to Avoid Them)",
  "created_utc": 1623479882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Complete Guide to Coinbase Fees (and How to Avoid Them)</p>\n\n<p>There are so many new subs to this forum and a lot of them are Coinbase users. Yeah Coinbase has a cool graph that shows you your portfolio. It’s also very easy to use for a beginner. </p>\n\n<p>Now there is nothing wrong with Coinbase (except, of course, the mind boggling fees) but I haven’t seen any post addressing how to use Coinbase without paying crazy fees or at least the best strategy to pay as little fees as possible. So here we go. </p>\n\n<p>Quick (or not so quick) overview of fees:</p>\n\n<p>Buying Fixed Fees</p>\n\n<ul>\n<li>If the total transaction amount is less than or equal to $10, the fee is $0.99</li>\n<li>If the total transaction amount is more than $10 but less than or equal to $25, the fee is $1.49</li>\n<li>If the total transaction amount is more than $25 but less than or equal to $50, the fee is $1.99</li>\n<li>If the total transaction amount is more than $50 but less than or equal to $200, the fee is $2.99</li>\n</ul>\n\n<p>TLDR\n$10 or less $0.99 fee\n$10.01-$25 $1.49 fee\n$25.01-$50 $1.99 fee\n$50.01-$200 $2.99 fee</p>\n\n<p>BUT WAIT, THERE’S MORE!</p>\n\n<p>Buying Variable Fees:</p>\n\n<p>US Bank Account 1.49%\nCoinbase USD Wallet 1.49%\nDebit Card or PayPal 3.99%</p>\n\n<p>BUT WAIT THERES EVEN MORE!! </p>\n\n<p>Coinbase charges a spread of about one-half of one percent (0.50%) for cryptocurrency purchases and cryptocurrency sales. However, the actual spread may be higher or lower due to market fluctuations in the price of cryptocurrency on Coinbase Pro between the time we quote a price and the time when the order executes. </p>\n\n<p>This means if you buy bitcoin and the market price is $50,000, they will charge you the purchase price of $50,000 plus half a percent. So you’ll be getting less bitcoin than you should be, by half of a percent. They do this is case there is a crazy spike in price between the time you confirm and the transaction actually goes through. </p>\n\n<p>CONVERSIONS</p>\n\n<p>For conversions from one coin to the other, you’ll be charged a spread fee which is equal to or less than 2%. </p>\n\n<p>Real life example</p>\n\n<p>You buy $10 in crypto\nAfter fees you have $8.96</p>\n\n<p>You buy $25 in crypto\nAfter fees you have $23.39</p>\n\n<p>You buy $50 in crypto\nAfter fees you have $47.77</p>\n\n<p>You buy $200 in crypto\nAfter fees you have $196.02</p>\n\n<p>You buy $1000 in crypto\nAfter fees you have $980.39</p>\n\n<p>Now you also have to pay these fees when you are selling. So here is what we have if you bought and sold at same price:</p>\n\n<p>You buy $10 in crypto\nAfter fees you have $8.96\nAfter selling $7.97\nOver 20% lost</p>\n\n<p>You buy $25 in crypto\nAfter fees you have $23.39\nAfter selling $21.90\nOver 12% lost</p>\n\n<p>You buy $50 in crypto\nAfter fees you have $47.77\nAfter selling $45.78\nOver 8% lost</p>\n\n<p>You buy $200 in crypto\nAfter fees you have $196.02\nAfter selling $193.03\nOver 3.5% lost</p>\n\n<p>You buy $1000 in crypto\nAfter fees you have $980.39\nAfter selling $965.78\nOver 3.4% lost</p>\n\n<p>Now how do we not get killed on fees?</p>\n\n<ol>\n<li>Use Coinbase Pro if possible. Fees are capped at 0.5% no matter how much you buy. You can transfer between Coinbase and Coinbase pro free of charge. </li>\n<li>If you’re going to buy anything, buy at least $200 worth of it. Do NOT buy small amounts of something on here. If your DCA, instead of doing $50 every week, do $200 every four weeks. </li>\n<li>Do not day trade. It’s hard to make money day trading when you’re automatically down 5% just from fees. </li>\n<li>Use bank account to buy coins, not debit card. </li>\n<li>Only buy when market is going up. If you buy when it’s going down you will end up paying even more due to their spread fee (yes I know, hard to know when it’s going to go up). </li>\n<li>Use Coinbase if you’re planning on holding coins for a long time. </li>\n</ol>\n\n<p>I really just recommend you to use Binance.us or kraken. If you buy $100 worth of bitcoin, your fees are only $0.05 on Binance!!! </p>\n\n<p>Hope this helped. Let me know if I missed anything! </p>\n\n<p>TLDR; If you really have to use Coinbase, only purchase $200 or more at a given time. Don’t day trade, and hold for long periods of time. If you can use a different exchange like Binance, switch over.</p>\n</div><!-- SC_ON -->",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/nxtvbg/the_complete_guide_to_coinbase_fees_and_how_to/",
  "subreddit": "CryptoCurrency",
  "id": "nxtvbg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009737343
}