{
  "author": "biglyhonorpacioli",
  "the_new_excerpt": "Hi all,\n\nI'd like to explain why I believe LMND is currently overvalued, and encourage\nyou to please poke holes in my arguments. Tell me what I'm missing please,\nparticularly re. the path to profitability and the reinsurance topic.\n\nBasics\n\n * Lemonade says it's an insurance company that leverages…",
  "original_created_utc": 1612331906,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我想解释一下为什么我认为LMND目前的价值被高估，并且鼓励\n请你在我的论点上打洞。请告诉我，我错过了什么。\n特别是关于盈利之路和再保险的话题。\n\n基础知识\n\n * 柠檬水说这是一家保险公司，利用...",
      "title": "为什么我认为柠檬水的价值被高估了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我想解釋一下爲什麼我認爲LMND目前的價值被高估，並且鼓勵\n請你在我的論點上打洞。請告訴我，我錯過了什麼。\n特別是關於盈利之路和再保險的話題。\n\n基礎知識\n\n * 檸檬水說這是一家保險公司，利用...",
      "title": "爲什麼我認爲檸檬水的價值被高估了？"
    }
  ],
  "title": "Why I think Lemonade is overvalued",
  "created_utc": 1612363681,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>I&#39;d like to explain why I believe LMND is currently overvalued, and encourage you to please poke holes in my arguments. Tell me what I&#39;m missing please, particularly re. the path to profitability and the reinsurance topic.</p>\n\n<p><strong>Basics</strong></p>\n\n<ul>\n<li>Lemonade says it&#39;s an insurance company that leverages AI to price risk better.</li>\n<li>Lemonade claims to &quot;disrupt&quot; the insurance industry by using AI, implying all others don&#39;t.</li>\n<li>Lemonade has a do-good attitude, borderline arrogant, to all of its marketing. This appeals to quite some folks primarily in the U.S., as their growing client numbers show.</li>\n<li>The company was recently discussed by a bearish outlet called &quot;the friendly bear&quot;, and by Citron. The Friendly Bear article is worth a reading imo, the Citron video was absolutely weak and didn&#39;t attack the company meaningfully.</li>\n<li>From what I can tell, customers are either extremely happy or extremely disappointed with the company. The former are mainly - not only! - the ones that never submitted a claim and only experienced the sign-up process. My research is limited to reading reviews on the app store.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Bull case</strong></p>\n\n<ul>\n<li>Lemonade&#39;s AI capability: If LMND does manage to use AI to price risk better than its competitors, this could result in lower loss ratios. However, note that AI typically needs a lot of data points; data points LMND has just started collecting. Heavy reliance on AI also reduces salary spending and should lead to low costs of adding incremental customers.</li>\n<li>Target demographic: Below 40 year olds, due to hipster-oriented marketing and your phone being the only distribution channel. The idea is to grow alongside those customers.</li>\n<li>Doing good: Parts of earnings go to the lemonade foundation and from there to charities pre-selected by policyholders.</li>\n<li>Founder: Founders have founded and grown firms previously (Fiverr).</li>\n<li>Growth potential: LMND is rapidly expanding its insurance offerings, having most recently started to offer pet insurance, life insurance.</li>\n</ul>\n\n<p><strong>Bear case</strong></p>\n\n<ul>\n<li>Use of reinsurance: LMND cedes 75% of risks, and 75% of premiums received, to reinsurers. I think this is the main red flag here. Superior AI should allow them to underwrite only good risks, meaning they need less reinsurance - not more - than other insurance companies. The 25% ceding commission they gain is a small drop, it means they cede &quot;only&quot; 56% of premium, not the full 75%. Note that in addition to ceding 75%, they use even more reinsurance to manage the remaining 25% - meaning they probably retain about 20% of risk - and premium - themselves.</li>\n<li>Use of reinsurance 2: The S1 (July 1, 2020) announces the plan to start ceding 75% starting in Q3. So one quarter after going public, the company dramatically changes it&#39;s business model for it&#39;s core business which is providing insurance. This is suspect to say the least.</li>\n<li>Slight risk of misstating the truth: (Disclaimer: I can&#39;t judge as to whether this is illegal, nor do I want to enter that discussion). However, I believe that a) They might not actually pass the litmus test for being an insurance company. They are, at the moment, not more than a broker for reinsurers, that earns about 20 cents for every 1 dollar in premium.</li>\n<li>Political risk: The charities one can select do not resonate with less liberal folks, according to app store reviews.</li>\n<li>No path to profit visible: GWP in 3Q20 was 71.2, but ceded written premium was 118.6, resulting in NWP of -47.4. Losses and loss adjustment expenses decreased. Both is a result of the heavy reinsurance use. The gross earned premium figure in the 3Q20 can&#39;t be reconciled with prior quarters and the company presents gross earned premium of positive 42.9, but then another 32.4 are ceded to reinsurers, leading to revenue of only 17.8.</li>\n<li>Use of AI most likely overstated: a) The firm has no significant R&amp;D spending - &quot;technology development&quot; is an own line item (5m in Q3) but it&#39;s four times less than sales and marketing, and half that of G&amp;A. This is clearly not an indicator LMND invests massively into its AI capabilities. Rather they seek to push top line. b) If AI is so good there would be less need for reinsurance because the AI would be capable to weed out bad risks. Instead, LMND uses a shitload of reinsurance.</li>\n<li>Planned share issuance at 165$ - then at the all-time high, they announced the offering. A smart move that will bring in cash they need to grow (think advertising). And an indicator that mgmt thinks the stock is currently overvalued.</li>\n<li>Abroad growth is slow: In Germany, LMND is a very tiny (think &lt;1% of market) player according to news by competitor wefox and by other articles. In France they won some lawsuit about the use of the color pink, but I haven&#39;t yet found any data on their market share there, I assume it&#39;s negligible.</li>\n<li>The company&#39;s stock price started jumping once the stock was a suggested buy by motley fool. Motley fool regularly issues bullish articles on the stock. In addition, the firm seems - to me - to be actively marketing its shares through social media like tiktok. This sheds in my view a very dubious light on the firm.</li>\n<li>Lack of insurance experience by chief executives. While they have succeeded founding companies and taking them public in the past, they have no insurance industry experience. I see this as a major red flag in such a complex industry.</li>\n</ul>\n\n<p><strong>My main issue / stuff that prevents me from going all-in on my bearish bet:</strong></p>\n\n<ul>\n<li>No obvious catalyst visible that could trigger a big drop in share price - I&#39;m afraid that if they keep growing customers, as top line grows, so will the stock price. I&#39;m afraid investors see this as one of the only few &quot;hot new stocks&quot; in the insurance segment, leaving little alternative to investing if one wants to be part of innovation in insurance.</li>\n<li>Side note: Timing-wise, one problem might arise in 3 years when they will have to renegotiate the 75% reinsurance agreements. If their AI sucks, then their risks are not above market average, and if that&#39;s the case, reinsurers might raise premium / reduce ceding commission. I see this as one potential catalyst, but it&#39;s far in the future.</li>\n</ul>\n\n<p><strong>Positions currently held, albeit with medium conviction only, and planning to hold at least after Q4 release:</strong></p>\n\n<ul>\n<li>2x LMND Feb 21 (Feb 12 expiration) 120P, currently worth 232$</li>\n<li>1x LMND Jan22 (Jan 21 expiration) 100P, currently worth 2900$</li>\n<li>Side note: all options seem thinly traded and bid-ask is huge</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/investing/comments/lbh05m/why_i_think_lemonade_is_overvalued/",
  "subreddit": "investing",
  "id": "lbh05m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534793
}