{
  "author": "Petewonder",
  "original_created_utc": 1651767097,
  "title": "Crypto has been taken over by the same people it was invented to untether from….",
  "created_utc": 1651815696,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m not the first person to notice this on this sub, but the last couple years the crypto market seems to really move with the regular stock markets. Case in point, the last couple of days the two big swings in the NASDAQ I’m literally coincided with the same swing of all my crypto. This tells me that main stream adoption amongst the big fish, (meaning the banks not some monopoly man) Seems to have taken hold. I don’t really see what the future holds because if the way they handled unfettered capitalism is any indication, crypto will have a bad end as well&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/uj0x8x/crypto_has_been_taken_over_by_the_same_people_it/",
  "subreddit": "CryptoCurrency",
  "id": "uj0x8x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m not the first person to notice this on this sub, but the last couple years\nthe crypto market seems to really move with the regular stock markets. Case in\npoint, the last couple of days the two big swings in the NASDAQ I’m literally\ncoincided with the same swing of all my crypto. This tells me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブでこれに気づいたのは私が初めてではありませんが、ここ2、3年\n暗号市場は、通常の株式市場と一緒に動いているように見えます。例えば\nここ数日、ナスダックで大きな変動が2回あったのですが、私が持っている暗号も同じように変動しました。\n私の持っているすべての暗号の同じスイングと一致しました。これは私に教えてくれる...",
      "title": "暗号は、解脱するために発明されたのと同じ人たちに乗っ取られてしまった...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是第一个注意到这一点的人，但在过去的几年里\n加密货币市场似乎真的与普通股票市场一起移动。案例\n例如，在过去的几天里，纳斯达克指数的两次大的波动与我所有的加密货币的波动完全一致。\n恰好与我所有的加密货币的摆动相一致。这告诉我...",
      "title": "加密货币已被它的发明者接管，以解脱束缚....。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是第一個注意到這一點的人，但在過去的幾年裏\n加密貨幣市場似乎真的與普通股票市場一起移動。案例\n例如，在過去的幾天裏，納斯達克指數的兩次大的波動與我所有的加密貨幣的波動完全一致。\n恰好與我所有的加密貨幣的擺動相一致。這告訴我...",
      "title": "加密貨幣已被它的發明者接管，以解脫束縛....。"
    }
  ]
}