{
  "author": "Fizzdizz",
  "the_new_excerpt": "In MrBeasts livestream he announced that people can send images to the moon for\n10 dollars. He then stated that he will take that money and buy bitcoin with it\n(total 1 million usd) and he will put it on a flash drive and send it to the\nmoon. Check out shopmrbeast.com/moon for more info and he is…",
  "original_created_utc": 1611525641,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在MrBeasts的直播中，他宣布人们可以将图像发送到月球上，以获得\n10美元。然后他表示，他将拿这些钱去买比特币，用这些钱买\n(共计100万美金)，他将把它放在U盘里，然后发给。\n月亮。查看shopmrbeast.com/moon了解更多信息，他是... ...",
      "title": "MrBeast刚刚在直播中宣布，他将购买价值100万美元的比特币送上月球。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在MrBeasts的直播中，他宣佈人們可以將圖像發送到月球上，以獲得\n10美元。然後他表示，他將拿這些錢去買比特幣，用這些錢買\n(共計100萬美金)，他將把它放在U盤裏，然後發給。\n月亮。查看shopmrbeast.com/moon瞭解更多信息，他是... ...",
      "title": "MrBeast剛剛在直播中宣佈，他將購買價值100萬美元的比特幣送上月球。"
    }
  ],
  "title": "MrBeast just announced in his livestream that he will be buying 1 million dollars worth of Bitcoin to send to the moon.",
  "created_utc": 1611608634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In MrBeasts livestream he announced that people can send images to the moon for 10 dollars. He then stated that he will take that money and buy bitcoin with it (total 1 million usd) and he will put it on a flash drive and send it to the moon. Check out shopmrbeast.com/moon for more info and he is live on YouTube right now, search MrBeast. 1 million usd is not exactly a lot of money, roughly 32 btc, but it will be interesting to have bitcoin keys sitting on the moon surface. Having that bitcoin locked will also be interesting to see it sit in literal cold storage until someone finds it? What are the implications of future recovery? Interesting for sure.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/l48r2w/mrbeast_just_announced_in_his_livestream_that_he/",
  "subreddit": "CryptoCurrency",
  "id": "l48r2w",
  "is_self": true,
  "media": null,
  "is_video": false
}