{
  "author": "Aric_Holbrook",
  "the_new_excerpt": "Ok look, idiots, I am no genius, but this drop from 170 to 100ish is not all\nbad. TL/DR at the bottom for the most autist...\n\nHere is why-\n\n1) We are still up huge from the close of yesterday and have seen a solid ground\nat the 106 range. This establishes a floor, i.e. the minimum amount of money…",
  "original_created_utc": 1614285795,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，听着，白痴们，我不是天才，但从170跌到100左右并不全是\n坏的。TL/DR在底部的最自闭症......\n\n这就是为什么-\n\n1）从昨天收盘到现在，我们依然涨幅巨大，已经看到了坚实的地盘\n在106的范围内。这就确定了一个下限，即最低资金量...",
      "title": "请阅读!!!! (GME)为什么DIP是好的!!!!。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，聽着，白癡們，我不是天才，但從170跌到100左右並不全是\n壞的。TL/DR在底部的最自閉症......\n\n這就是爲什麼-\n\n1）從昨天收盤到現在，我們依然漲幅巨大，已經看到了堅實的地盤\n在106的範圍內。這就確定了一個下限，即最低資金量...",
      "title": "請閱讀!!!! (GME)爲什麼DIP是好的!!!!。"
    }
  ],
  "title": "PLEASE READ!!!! (GME) WHY THE DIP IS GOOD!!!!",
  "created_utc": 1614369396,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Ok look, idiots, I am no genius, but this drop from 170 to 100ish is not all bad.  TL/DR at the bottom for the most autist...</strong></p>\n\n<p>Here is why- </p>\n\n<p>1) <strong>We are still up huge from the close of yesterday</strong> and have seen a solid ground at the 106 range. This establishes a floor, i.e. the minimum amount of money the stock can go if paper hands sell.</p>\n\n<p>2) I have read multiple articles claiming <strong>that Short Sellers just on Wednesday lost a total of 818 million.</strong> Why is this important you may ask?? Well simply put for you fellow atuists, with these HF down nearly a billion in one day, they can&#39;t continue the squeeze because they have no capital to buy the calls back. <strong>So this might leave us with no large increases until Monday until capital can be raised to cover.</strong> </p>\n\n<p>3) We know from the past, that without capital <strong>A) there can&#39;t be any short latter attacks B) the HF will be forced to pay high interest on these positions if they don&#39;t cover them. C) there will be a continuation of a squeeze if we hold.</strong> </p>\n\n<p>IT won&#39;t LET ME POST THE LINK- just look it up it&#39;s the first article.</p>\n\n<p>4) <strong>Other shorted stocks have a good chance at rising too.</strong> Rember GME is the big whale while other shorts like AMC, NOK, and BB are more like fishes (still valuable but not like the whale). So while HF gathers capital to cover shorts on GME, <strong>they will have to pay BIG BIG BIG bucks on interest with the other smaller stocks.</strong> </p>\n\n<p><strong>TL/DR: don&#39;t panic because you see a drop right now, there is a good chance that it is because of limited capital from HF because of Wednesday&#39;s crash, leading to no money to cover shorts.</strong> This means HF will be forced to pay interest on the positions they still have and will lead to a bigger squeeze in the next few days. HOLD THE LINE.</p>\n\n<p>I am not an adviser, I just like the stock ;)</p>\n</div><!-- SC_ON -->",
  "score": 6965,
  "permalink": "/r/wallstreetbets/comments/lsgdqn/please_read_gme_why_the_dip_is_good/",
  "subreddit": "wallstreetbets",
  "id": "lsgdqn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937748164
}