{
  "author": "Viridez",
  "the_new_excerpt": "I talk to my friends and they tell me they throw X amount into crypto to hold\nand I wish I could do the same. I've started having $5 taken out of each check\nand thrown into my crypto wallet. It's not much but it's better than not\ninvesting!\n\nTrust me it adds up, I get paid 2x a month and if you've…",
  "original_created_utc": 1623244643,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人に話を聞くと、彼らは○○円を暗号化して保有していると言います。\nていて、自分もそうしたいと思っています。毎回の小切手から5ドルを取り出して、暗号財布に入れるようにしました。\nを暗号化財布に入れています。大した額ではありませんが、やらないよりはいいでしょう。\n投資しないよりはいいですよね。\n\n私は月に2回給料をもらっていますが、もしあなたが...",
      "title": "お金がないときに投資するのは難しいですが、1回5ドルの小切手を受け取ることは100％価値があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的朋友聊天，他们告诉我，他们把X数额的钱投入到加密货币中持有\n我希望我也能这样做。我已经开始从每张支票中拿出5美元\n扔到我的加密货币钱包里。虽然不多，但总比不投资好。\n投资!\n\n相信我，它增加了，我每月有2次工资，如果你已经...",
      "title": "没钱时很难投资......但拿5美元一张的支票是100%值得的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的朋友聊天，他們告訴我，他們把X數額的錢投入到加密貨幣中持有\n我希望我也能這樣做。我已經開始從每張支票中拿出5美元\n扔到我的加密貨幣錢包裏。雖然不多，但總比不投資好。\n投資!\n\n相信我，它增加了，我每月有2次工資，如果你已經...",
      "title": "沒錢時很難投資......但拿5美元一張的支票是100%值得的。"
    }
  ],
  "title": "It's hard to invest being broke.. but taking $5 a check is 100% worth it",
  "created_utc": 1623257279,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I talk to my friends and they tell me they throw X amount into crypto to hold and I wish I could do the same. I&#39;ve started having $5 taken out of each check and thrown into my crypto wallet. It&#39;s not much but it&#39;s better than not investing!</p>\n\n<p>Trust me it adds up, I get paid 2x a month and if you&#39;ve seen the infamous &#39;I put 1k into crypto in 2018&#39; post then know that $120 over the course of a year can easily become a solid chunk of change throughout the years. </p>\n\n<p>Anyone else have strategies that they do in order to invest small amounts into crypto when you&#39;re broke?</p>\n</div><!-- SC_ON -->",
  "score": 1334,
  "permalink": "/r/CryptoCurrency/comments/nvvq2u/its_hard_to_invest_being_broke_but_taking_5_a/",
  "subreddit": "CryptoCurrency",
  "id": "nvvq2u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884260
}