{
  "author": "lecherofahq",
  "the_new_excerpt": "I have never invested in funds that are focused on paying dividends, I stick to\nS&P 500 and other broad index funds. However as a start thinking about retiring\none day I’d like to be a little more conservative keep my principal and invest\nin something that pays dividends. So I started to do a little…",
  "original_created_utc": 1614226731,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有投资过专注于分红的基金，我坚持以\n标普500指数和其他大盘指数基金。然而作为一个开始考虑退休\n有一天，我想更保守一点 保持我的本金和投资。\n的东西，支付红利。所以我开始做一点...",
      "title": "需要一些指导，如果听起来太美好，那么可能不是真的..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有投資過專注於分紅的基金，我堅持以\n標普500指數和其他大盤指數基金。然而作爲一個開始考慮退休\n有一天，我想更保守一點 保持我的本金和投資。\n的東西，支付紅利。所以我開始做一點...",
      "title": "需要一些指導，如果聽起來太美好，那麼可能不是真的..."
    }
  ],
  "title": "Need some guidance, if it sounds too good then it’s probably not true...",
  "created_utc": 1614275830,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have never invested in funds that are focused on paying dividends, I stick to S&amp;P 500 and other broad index funds. However as a start thinking about retiring one day I’d like to be a little more conservative keep my principal and invest in something that pays dividends. So I started to do a little bit of due diligence, full disclosure I have about 20+ years till retirement. So what I was looking into is ones that pay dividends, I ran across $GOF.  It’s about $20/share and pays monthly dividends of $0.182.  </p>\n\n<p>My question is: if you invest $1MM in GOF you’ll have 50,000 share and generate $9,100 (50,000 x 0.182) per month.  The price is stable and expense ratio is low.  Is this correct?</p>\n\n<p>With my S&amp;P 500 investments and my tenure till retirement, I can expect liberally a 10% per year return. And the way I’m investing, I could assume (hypothetical) $5MM by the time I retire.  Using the GOF example I’d able to generate ~$45,000 per month....  this just seems unreal</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/investing/comments/lrxyap/need_some_guidance_if_it_sounds_too_good_then_its/",
  "subreddit": "investing",
  "id": "lrxyap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937739417
}