{
  "author": "rbear236",
  "original_created_utc": 1641562127,
  "title": "Is asking your partner to watch their table manners rude?",
  "created_utc": 1641575744,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I love this man with all my heart… but he eats food like no one else I know. Open mouth crunching, lip smacking, huge mouthfuls of food, loud finger sucking, he gets sauces &amp;amp; bits all over his mouth… it drives me crazy and grosses me out. He does it in restaurants as well. I realize we were brought up differently and I was reminded of my table manners as a kid. &lt;/p&gt;\n\n&lt;p&gt;It’s terrible, but I’m having trouble eating with him without getting distracted anymore :( He’s 33… and didn’t do this when we were first dating. He ate super cleanly. Now we’re 2 years in and he’s begun to do this. So far, I gently have influenced him to use a napkin instead of using his hand or arm.&lt;/p&gt;\n\n&lt;p&gt;I want to eat with him and not be upset by this. I’m embarrassed to even be this put off by it. And he’s a wonderful partner. Is it rude to tell him somehow in a non-hurtful way? Should I just get over it?&lt;/p&gt;\n\n&lt;p&gt;Edited- to add I’d say it’s misophonia but no other daily noise bothers me! Only this&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/TooAfraidToAsk/comments/ry7dbb/is_asking_your_partner_to_watch_their_table/",
  "subreddit": "TooAfraidToAsk",
  "id": "ry7dbb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I love this man with all my heart… but he eats food like no one else I know.\nOpen mouth crunching, lip smacking, huge mouthfuls of food, loud finger sucking,\nhe gets sauces & bits all over his mouth… it drives me crazy and grosses me out.\nHe does it in restaurants as well. I realize we were brought…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの人を心から愛しています...でも、彼は私の知る限り、他の誰よりも食べ物を食べるのです。\n口をパクパクさせ、唇を鳴らし、大きな口で食べ、大きな声で指をしゃぶる。\nソースや食べかすを口に入れてしまうので、気が狂いそうになるし、気持ち悪いです。\nレストランでも同じようにします。私たちが連れてこられたのは...",
      "title": "パートナーにテーブルマナーに気をつけるよう頼むのは失礼？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我全心全意地爱着这个男人......但他吃东西的样子是我所知道的其他人所没有的。\n张嘴咬碎，咂嘴，大口大口地吃东西，大声吮吸手指。\n他把酱汁和碎片弄得满嘴都是......这让我发疯，让我感到恶心。\n他在餐馆里也是如此。我意识到我们被带...",
      "title": "要求你的伴侣注意他们的餐桌礼仪是不礼貌的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我全心全意地愛着這個男人......但他喫東西的樣子是我所知道的其他人所沒有的。\n張嘴咬碎，咂嘴，大口大口地喫東西，大聲吮吸手指。\n他把醬汁和碎片弄得滿嘴都是......這讓我發瘋，讓我感到噁心。\n他在餐館裏也是如此。我意識到我們被帶...",
      "title": "要求你的伴侶注意他們的餐桌禮儀是不禮貌的嗎？"
    }
  ]
}