{
  "author": "SteveOMatt",
  "original_created_utc": 1652474958,
  "title": "Why are middle aged men loud as fuck in public toilets?",
  "created_utc": 1652531705,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like seriously, I go in there, sit down on a seat, get ready to just relax and BANG goes the door like they&amp;#39;re trying to break it off the hinges.&lt;/p&gt;\n\n&lt;p&gt;If they&amp;#39;re going for the urinal, you better believe they&amp;#39;re already unzipped, meat in hand read to piss an unhealthy shade of dark orange.&lt;/p&gt;\n\n&lt;p&gt;Or if they go for the cubicle next to me they have cough, splutter and basically sound like they just broke out of Chernobyl. Grab some paper and blow their nose like they&amp;#39;re trying to force their own brains through their nostril. Then when they sit down with all this is going on whilst they unleash the biggest, unhealthiest, fibre deficient shmit that damn near cracks the porcelain when it smacks into the bottom of the bowl.&lt;/p&gt;\n\n&lt;p&gt;I just don&amp;#39;t understand the sheer confidence and vinegar this generation has when they go to the bathroom in public. What&amp;#39;s the deal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/up12w0/why_are_middle_aged_men_loud_as_fuck_in_public/",
  "subreddit": "TooAfraidToAsk",
  "id": "up12w0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Like seriously, I go in there, sit down on a seat, get ready to just relax and\nBANG goes the door like they're trying to break it off the hinges.\n\nIf they're going for the urinal, you better believe they're already unzipped,\nmeat in hand read to piss an unhealthy shade of dark orange.\n\nOr if they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マジレスすると、中に入ってシートに座ってくつろごうとしたら\nドアをバンと閉めるんだ まるで蝶番を壊すようにね\n\n便器に行くなら、もうチャックを開けていると思った方がいい。\n肉片を手に、不健康なオレンジ色の小便をする。\n\nそれとも...",
      "title": "なぜ中年男性は公衆トイレでクソうるさいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，我去那里，坐在一个座位上，准备好放松和\n砰的一声，门就开了，好像他们想把门从铰链上掰下来。\n\n如果他们要去小便池，你最好相信他们已经拉上了拉链。\n手里拿着肉，准备把尿撒成不健康的深橙色。\n\n或者如果他们...",
      "title": "为什么中年男子在公共厕所里吵得要死？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，我去那裏，坐在一個座位上，準備好放鬆和\n砰的一聲，門就開了，好像他們想把門從鉸鏈上掰下來。\n\n如果他們要去小便池，你最好相信他們已經拉上了拉鍊。\n手裏拿着肉，準備把尿撒成不健康的深橙色。\n\n或者如果他們...",
      "title": "爲什麼中年男子在公共廁所裏吵得要死？"
    }
  ]
}