{
  "author": "MaladroitNeophyte",
  "original_created_utc": 1636526563,
  "title": "Why is it controversial to state I'm only attracted to 'modest' women?",
  "created_utc": 1636563589,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had no idea this was controversial, I mention it to some people and now I&#39;m pretty sure everyone thinks I&#39;m a misogynist.</p>\n\n<p>I myself am modest, no social media, don&#39;t take any pictures of myself and while I remain presentable and in shape I don&#39;t really care about my looks or try to put them on display. </p>\n\n<p>Obviously I don&#39;t expect a woman to be exactly like me, but I&#39;m really only into women who are modest. Granted my definition of &#39;modest&#39; wouldn&#39;t be the same as everyone else. Regardless, to take offence to that is to deny the existence of modest women and their choice to be modest.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/TooAfraidToAsk/comments/qqo7zq/why_is_it_controversial_to_state_im_only/",
  "subreddit": "TooAfraidToAsk",
  "id": "qqo7zq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had no idea this was controversial, I mention it to some people and now I'm\npretty sure everyone thinks I'm a misogynist.\n\nI myself am modest, no social media, don't take any pictures of myself and while\nI remain presentable and in shape I don't really care about my looks or try to\nput them on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これが議論の的になっているとは知らなかったので、何人かの人にこの話をしたところ、今では誰もが私のことを女嫌いだと思っていることでしょう。\n今では誰もが私を女性差別主義者だと思っています。\n\n私自身は控えめで、ソーシャルメディアも使わず、自分の写真も撮りません。\n自分の容姿や体型には気を配っていませんし、そうしようとも思っていません。\n私は自分の容姿や体型を維持していますが、自分の容姿を気にしたり、着飾ろうとはしません。",
      "title": "私が「控えめな」女性にしか惹かれないと言うことが、なぜ議論の的になるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道这是有争议的，我向一些人提起，现在我\n现在我确信每个人都认为我是个厌恶女人的人。\n\n我自己很谦虚，没有社交媒体，不拍任何自己的照片，虽然\n我保持着体面和身材，但我并不真正关心我的外表，也不试图\n把它们放在...",
      "title": "为什么说我只对 \"谦虚 \"的女人有吸引力是有争议的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道這是有爭議的，我向一些人提起，現在我\n現在我確信每個人都認爲我是個厭惡女人的人。\n\n我自己很謙虛，沒有社交媒體，不拍任何自己的照片，雖然\n我保持着體面和身材，但我並不真正關心我的外表，也不試圖\n把它們放在...",
      "title": "爲什麼說我只對 \"謙虛 \"的女人有吸引力是有爭議的？"
    }
  ]
}