{
  "author": "bybeardandthrone",
  "original_created_utc": 1635839173,
  "title": "Were there any reports of \"a monster\" at the Battle of the Somme in 1916?",
  "created_utc": 1635868705,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Firstly, I&#39;ll preface this by saying I am a historian, and I have exhausted my own skill set looking into this. I&#39;ve found absolutely nothing whatsoever and I only ever run into the medium that I heard about it on.  Secondly, I&#39;m aware that this could just be a REALLY good piece of fiction.</p>\n\n<p>Nevertheless here I am asking historians</p>\n\n<p>One of the podcasts I listen to deals with different true crime, scary stories, historical events and ufos/cryptids as episode topics. The podcast is satirical but they spend a lot of time actually doing historical, anthropological and sociological research on their topics. It&#39;s satire but it&#39;s not &quot;fake&quot;, despite taking on topics that could be considered &quot;make believe&quot;.</p>\n\n<p>Several years ago now they had a British military officer (fan of the show and claimed to be under a pseudonym as to not warrant attention to himself telling military secrets) who told the story of the Battle of the Somme in France 1916.</p>\n\n<p>I&#39;m fully aware that this could just be an insanely compelling piece of fiction. However, he claimed that as a military historian for the U.K. he came upon a letter that was dated the night before the Battle of the Somme by an English soldier. The letter was classified and began like any other letter, detailing what a soldier was allowed to tell his family of their whereabouts and what life in the military was like. He then detailed of witnessing an event at twilight. He said he saw across the field in the trenches of the German line, a monster made from smoke, twisting and turning like a vortex picking up German soldiers and pulling them apart &quot;like a child would pull the limbs off of an insect.&quot; </p>\n\n<p>After reading this letter he mentioned that a colleague of his in Berlin had also come across a letter from a battalion at what would be the Battle of the Somme, once translated said something to the effect of &quot;the monster came again tonight...&quot; etc. </p>\n\n<p>Furthermore he discussed how there was a village in the area that had woodcarving dating to the 1600s about the &quot;calamity&quot; that would take the children in the night, and supposedly the woodcarving was that of shape-shifting creature resembling what could on be described as a tornado.</p>\n\n<p>I first heard this story in 2015 or 2016 I cannot remember. But every time I go back to this episode of the podcast (which is toted as a &quot;listener stories&quot; and they&#39;re assumed to be true creepy stories) I always look into it. I cannot find anything about a monster at the Somme. I cannot find anything about the smoke monster. I cannot find anything about the 17th century French woodcarving. Has ANYONE ever heard of this before. Or have I just been duped by a really good scary story for the last 5-6 years?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qkz5rk/were_there_any_reports_of_a_monster_at_the_battle/",
  "subreddit": "AskHistorians",
  "id": "qkz5rk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Firstly, I'll preface this by saying I am a historian, and I have exhausted my\nown skill set looking into this. I've found absolutely nothing whatsoever and I\nonly ever run into the medium that I heard about it on. Secondly, I'm aware that\nthis could just be a REALLY good piece of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に、私は歴史学者であり、この件については自分のスキルセットを使い果たしてしまったことをお断りしておきます。\n私は歴史家であり、この件については自分のスキルセットを使い果たしました。全く何も見つけられず、私は自分が聞いたメディアにしか出くわさない。\n私がこの話を聞いたメディアにしか遭遇していないのです。第二に、私はこれが\nこれは本当に良い作品なのかもしれません...",
      "title": "1916年のソンムの戦いでは、\"怪物 \"の報告はあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我先说我是一个历史学家，我已经用尽了我的\n自己的技能来研究这个问题。我完全没有发现任何东西，而且我\n我只遇到过我听说过的媒体。第二，我知道\n这可能只是一个非常好的作品......",
      "title": "在1916年的索姆河战役中是否有关于 \"怪物 \"的报道？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我先說我是一個歷史學家，我已經用盡了我的\n自己的技能來研究這個問題。我完全沒有發現任何東西，而且我\n我只遇到過我聽說過的媒體。第二，我知道\n這可能只是一個非常好的作品......",
      "title": "在1916年的索姆河戰役中是否有關於 \"怪物 \"的報道？"
    }
  ]
}