{
  "author": "Thin-Leadership-5238",
  "original_created_utc": 1639604545,
  "title": "Why is the black community so intolerant of different opinions, hobbies and so forth?",
  "created_utc": 1639673918,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It feels like the black community has an idea of what it is to be black and if you don’t meet a benchmark, your skin color is somehow invalid.&lt;/p&gt;\n\n&lt;p&gt;I say this as a black person that I see this monolithic attitude all the time on social media pages when it comes to having certain hobbies, a way of speaking or difference of opinions. &lt;/p&gt;\n\n&lt;p&gt;You’ll literally be screamed at for being a coon, acting “white” and so on. And don’t even get me started on people who like to speak as a representative of every black person. &lt;/p&gt;\n\n&lt;p&gt;I just wanna know where this sort of antagonism comes from.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/rha6nw/why_is_the_black_community_so_intolerant_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "rha6nw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It feels like the black community has an idea of what it is to be black and if\nyou don’t meet a benchmark, your skin color is somehow invalid.\n\nI say this as a black person that I see this monolithic attitude all the time on\nsocial media pages when it comes to having certain hobbies, a way of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "黒人のコミュニティは、黒人であることが何であるかという考えを持っているように感じます。\nその基準に達しない場合、あなたの肌の色は無効となります。\n\n黒人の一人として言いますが、このような一枚岩の態度を、私はいつも見ています。\n趣味や生活スタイルが違うと、SNSのページで...",
      "title": "なぜ、黒人社会は異なる意見や趣味などに不寛容なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "感觉黑人社区对成为黑人有一种想法，如果你不符合\n你不符合一个基准，你的肤色就在某种程度上是无效的。\n\n我作为一个黑人这样说，我在社交媒体上经常看到这种单一的态度。\n在社交媒体页面上，我经常看到这种单一的态度，当它涉及到拥有某些爱好，一种方式......",
      "title": "为什么黑人社区对不同的意见、爱好等如此不宽容？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "感覺黑人社區對成爲黑人有一種想法，如果你不符合\n你不符合一個基準，你的膚色就在某種程度上是無效的。\n\n我作爲一個黑人這樣說，我在社交媒體上經常看到這種單一的態度。\n在社交媒體頁面上，我經常看到這種單一的態度，當它涉及到擁有某些愛好，一種方式......",
      "title": "爲什麼黑人社區對不同的意見、愛好等如此不寬容？"
    }
  ]
}