{
  "author": "BatmanDontGiveNoShit",
  "the_new_excerpt": "I invested in Blackberry a few months ago with the rumours of the deal with\namazon. My only regret is not putting more in. People still seem to think that\nblackberry are a failing phone company that used to be at the top, but they have\nevolved. I don't think they will just roll over and die.\n\nToday…",
  "original_created_utc": 1615824394,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，我投资黑莓的时候，传闻与\n亚马逊。我唯一的遗憾是没有放更多的东西。人们似乎仍然认为\n黑莓是一个失败的手机公司，曾经是在顶部，但他们有\n进化了。我想他们不会就这样翻身而死。\n\n今天...",
      "title": "你对黑莓有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，我投資黑莓的時候，傳聞與\n亞馬遜。我唯一的遺憾是沒有放更多的東西。人們似乎仍然認爲\n黑莓是一個失敗的手機公司，曾經是在頂部，但他們有\n進化了。我想他們不會就這樣翻身而死。\n\n今天...",
      "title": "你對黑莓有什麼看法？"
    }
  ],
  "title": "What's Your Opinion On Blackberry?",
  "created_utc": 1615830152,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I invested in Blackberry a few months ago with the rumours of the deal with amazon. My only regret is not putting more in. People still seem to think that blackberry are a failing phone company that used to be at the top, but they have evolved. I don&#39;t think they will just roll over and die. </p>\n\n<p>Today they announced a new critical event management (CEM) solution called BlackBerry Alert that will help commercial organizations prepare for, respond to and recover from major incidents. It can integrate within tools like Microsoft Teams and ServiceNow, so that IT can alert and assemble a best-in-class crisis team to troubleshoot and resolve issues directly within the third-party application. </p>\n\n<p>I feel like BB will be a promising long term investment, but I&#39;d like to hear what you think?</p>\n</div><!-- SC_ON -->",
  "score": 573,
  "permalink": "/r/stocks/comments/m5o1yc/whats_your_opinion_on_blackberry/",
  "subreddit": "stocks",
  "id": "m5o1yc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382532
}