{
  "author": "Imaginary-Friendship",
  "original_created_utc": 1628709187,
  "title": "Spend bitcoin at stores that accept it, please!",
  "created_utc": 1628778763,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before you downvote or post a negative comment, please read the post (or at least the TLDR below). “Spend bitcoins” seems to trigger folks so much that they fail to realize there’s a way to spend bitcoin without reducing your stack or paying capital gains.</p>\n\n<p>I see a lot of folks that think they should never spend any Bitcoin - they’re going to save it forever. Cool, HODL your stack. But, please realize there is a difference between &quot;taking profits&quot; and &quot;growing the network.&quot;</p>\n\n<p>When buying stuff with Bitcoin, you can either &quot;spend and replace&quot; or you can use something like Strike. The latter being better. It seems like so many people in comments here have never heard of Strike or lightning, or they don&#39;t know what they do. Granted, some countries don&#39;t have access to Strike yet but I see plenty of negative comments coming from folks that could be using it.</p>\n\n<p>For those that don&#39;t know about it, let me explain. You can connect your bank account and then deposit your dirty fiat into Strike. Whenever you want to send someone BTC (main chain or lightning) you just click “pay” and scan the QR code. Strike deducts your fiat and then Strike pays with BTC. Let me repeat: <em>Strike pays with BTC</em>. You never hold that BTC and so therefore you never have any capital gain issues. In other words, Strike lets you use the BTC network without holding BTC.</p>\n\n<p>So, if Strike is available in your country, please do yourself a favor and figure out how it works before you crap on people&#39;s joy when a new store starts accepting bitcoin. If people will spend bitcoin then there&#39;s no reason for stores not to accept bitcoin - and there&#39;s no reason you can&#39;t keep HODLing your stack if you use something like Strike.</p>\n\n<p>Finally, I see some folks that seem to think it&#39;s pointless for a store to accept bitcoin. I mean....is it not obvious why a store should? Sure, maybe a store instantly converts BTC to fiat, but (1) having them accept it is advertising for Bitcoin, (2) don&#39;t you think stores will start to realize that lightning is cheaper than merchant fees, and (3) who&#39;s more likely to HODL bitcoin - a business that accepts it or one that doesn&#39;t? And, as a bonus point, please realize there are people that would like to live on bitcoin (get paid in bitcoin) that would love to not convert it to fiat.</p>\n\n<p>TLDR (by <a href=\"/u/HumidCrispyCat\">u/HumidCrispyCat</a>) …if you dont want to pay from your personal bag, download the Strike app and use that. It allows you to send bitcoin to any BTC/lightning address, using fiat, for super low fees</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/p2jx6a/spend_bitcoin_at_stores_that_accept_it_please/",
  "subreddit": "Bitcoin",
  "id": "p2jx6a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Before you downvote or post a negative comment, please read the post (or at\nleast the TLDR below). “Spend bitcoins” seems to trigger folks so much that they\nfail to realize there’s a way to spend bitcoin without reducing your stack or\npaying capital gains.\n\nI see a lot of folks that think they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "否定的なコメントを投稿する前に、その記事を読んでください（または少なくとも\n少なくとも以下のTLDRを）お読みください。) \"Spend bitcoins \"という言葉があまりにも人々の心を動かしているようです。\nビットコインを使うには、スタックを減らしたり、キャピタルゲインを支払ったりしない方法があることに気づかないのです。\nキャピタルゲインを支払わずにビットコインを使う方法があることに気づかないのです。\n\n私は多くの人々を見てきましたが、彼らが考えるのは...",
      "title": "ビットコインを使えるお店で使ってくださいね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你降级投票或发表负面评论之前，请阅读帖子（或至少是下面的TLDR）。\n至少是下面的TLDR）。) \"花掉比特币 \"似乎很容易引起人们的兴趣，以至于他们\n他们没有意识到有一种方法可以花掉比特币而不减少你的堆栈或\n支付资本收益。\n\n我看到很多人认为他们...",
      "title": "请在接受比特币的商店里花费比特币吧!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你降級投票或發表負面評論之前，請閱讀帖子（或至少是下面的TLDR）。\n至少是下面的TLDR）。) \"花掉比特幣 \"似乎很容易引起人們的興趣，以至於他們\n他們沒有意識到有一種方法可以花掉比特幣而不減少你的堆棧或\n支付資本收益。\n\n我看到很多人認爲他們...",
      "title": "請在接受比特幣的商店裏花費比特幣吧!"
    }
  ]
}