{
  "author": "lazulilizard",
  "original_created_utc": 1638268639,
  "title": "roommate jerks off and I can hear it, how do I tell him that we can hear him?",
  "created_utc": 1638285532,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in a college dorm, and I share a dorm with two other dudes. one of them jerks off pretty often and the problem is that I can hear him from my desk and he doesn’t know. I don’t care that he does it (I mean how else are dudes supposed to destress lmao) but I don’t think it would be unreasonable to let him know that the door to the bathroom definitely isn’t thick enough to block out all the noise. idk how to bring it up please help &lt;/p&gt;\n\n&lt;p&gt;tldr: roommate jerks off in bathroom and I want to tell him that I can hear it but idk how to&lt;/p&gt;\n\n&lt;p&gt;also inb4 people say “join him”&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1528,
  "permalink": "/r/TooAfraidToAsk/comments/r5kjf5/roommate_jerks_off_and_i_can_hear_it_how_do_i/",
  "subreddit": "TooAfraidToAsk",
  "id": "r5kjf5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in a college dorm, and I share a dorm with two other dudes. one of them\njerks off pretty often and the problem is that I can hear him from my desk and\nhe doesn’t know. I don’t care that he does it (I mean how else are dudes\nsupposed to destress lmao) but I don’t think it would be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は大学の寮に住んでいて、他に2人の男性とシェアしています。\nをよくするのですが、問題は、私の机から彼の声が聞こえることです。\n彼は知らない。私は彼がそれをすることを気にしない（つまり、他の男はどうやって\nしかし、私はそれが...",
      "title": "ルームメイトが自慰行為をしていて、それが聞こえてしまうのですが、どうやって彼に聞こえていることを伝えればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在大学宿舍，与另外两个人同住一个宿舍。\n他们中的一个人经常打飞机，问题是我可以从我的桌子上听到他的声音，而他不知道。\n他却不知道。我不在乎他这样做（我的意思是男人还能怎么做？\n但我认为这不会是......。",
      "title": "室友打飞机，我可以听到，我怎么告诉他我们可以听到他？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在大學宿舍，與另外兩個人同住一個宿舍。\n他們中的一個人經常打飛機，問題是我可以從我的桌子上聽到他的聲音，而他不知道。\n他卻不知道。我不在乎他這樣做（我的意思是男人還能怎麼做？\n但我認爲這不會是......。",
      "title": "室友打飛機，我可以聽到，我怎麼告訴他我們可以聽到他？"
    }
  ]
}