{
  "author": "Broad-Inspector8905",
  "the_new_excerpt": "For years the health care industry has been ruining middle age and older\nAmericans. For example they charge insane premiums that should be criminal. CLOV\nis a tech based company that truly gets Americans the cheapest Medicare that\nthey can possibly receive. And for some odd reason these large…",
  "original_created_utc": 1623085041,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長年、医療業界は中高年をダメにしてきた\nアメリカ人を破滅させてきました。例えば、彼らは犯罪になるような非常識な保険料を請求しています。CLOV\nは、アメリカ人に最も安いメディケアを提供する技術ベースの会社です。\n受けることができます。そして、奇妙なことに、これらの大...",
      "title": "$clov=より良いアメリカ、より良いシステムへの賭け"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "多年来，医疗保健行业一直在毁掉中年和老年的\n美国人。例如，他们收取疯狂的保费，应该是犯罪。CLOV\n是一家以技术为基础的公司，真正为美国人提供他们可能得到的最便宜的医疗保险。\n他们可能得到的。由于一些奇怪的原因，这些大公司...",
      "title": "赌注是为了建立一个更好的美国和更好的制度。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多年來，醫療保健行業一直在毀掉中年和老年的\n美國人。例如，他們收取瘋狂的保費，應該是犯罪。CLOV\n是一家以技術爲基礎的公司，真正爲美國人提供他們可能得到的最便宜的醫療保險。\n他們可能得到的。由於一些奇怪的原因，這些大公司...",
      "title": "賭注是爲了建立一個更好的美國和更好的制度。"
    }
  ],
  "title": "$CLOV= BET TORWARDS A BETTER AMERICA AND A BETTER SYSTEM",
  "created_utc": 1623102303,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For years the health care industry has been ruining middle age and older Americans. For example they charge insane premiums that should be criminal. CLOV is a tech based company that truly gets Americans the cheapest Medicare that they can possibly receive. And for some odd reason these large institutions don’t see this company as solid. CLOV has been beaten to the ground and these institutions who are shorting this company don’t want them to succeed. They are trying to revolutionize the way we look upon healthcare. We have a 40% short interest and this isn’t even including the possible naked shorts that made AMC A TRUE PHENOMENON. They are growing at an insane rate and these large corporate suits do not enjoy them coming for there breadwinning healthcare center while simultaneously crushing poor to middle income Americans. I take it as this-if you purchase CLOV your taking a bet on america and the prosperous outcomes for a better healthcare system/provider. Shorting CLOV is unamerican and the suits that are doing such should be penalized by transferring there wealth into our pockets! Sorry if I sound like a retard but this is something that should be talked about!</p>\n</div><!-- SC_ON -->",
  "score": 1752,
  "permalink": "/r/wallstreetbets/comments/nuhgua/clov_bet_torwards_a_better_america_and_a_better/",
  "subreddit": "wallstreetbets",
  "id": "nuhgua",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404892704
}