{
  "author": "RatioAgreeable715",
  "original_created_utc": 1658202616,
  "title": "Servers, why does the plate I feel like eating earn you a bigger tip?",
  "created_utc": 1658220404,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im afraid of being ripped apart for asking this but I genuinely don’t understand. Someone please educate me if Im wrong, this has been on my mind a lot.&lt;/p&gt;\n\n&lt;p&gt;I understand that servers aren’t paid a living wage so they rely on tips, everyone deserves a living wage but why do I have to pay a big tip for ordering a more expensive meal?&lt;/p&gt;\n\n&lt;p&gt;for example, if i order a $50 plate over day a cheaper $16 meal, I now have to tip the server more simply because I wanted the more expensive plate ??? what more work does the server do to deserve a bigger tip at that point? at this point i tip at least 18% when i go out (which isn’t often) but everytime i feel like it’s such a scam. &lt;/p&gt;\n\n&lt;p&gt;by the way im not really talking about 18+% on only my meal, I mean when im in a group of 2+, now the servers gets a huge tip and I just dont see why. some severs definitely deserve it but i hate this pressure to tip everyone even when it seems they did absolutely nothing special. &lt;/p&gt;\n\n&lt;p&gt;i know they deal with garbage people everyday but so do so many other jobs. i’ve worked retail, i didn’t expect tips for interacting with rude people daily. what other reasons are there beside that that they deserve such big tips ? am i misunderstanding how much work they do ?&lt;/p&gt;\n\n&lt;p&gt;again, not trying to be rude, just so confused&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/w2ix8a/servers_why_does_the_plate_i_feel_like_eating/",
  "subreddit": "TooAfraidToAsk",
  "id": "w2ix8a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Im afraid of being ripped apart for asking this but I genuinely don’t\nunderstand. Someone please educate me if Im wrong, this has been on my mind a\nlot.\n\nI understand that servers aren’t paid a living wage so they rely on tips,\neveryone deserves a living wage but why do I have to pay a big tip for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなこと聞いたらボロクソに言われそうだけど、純粋にわからない。\nを理解できません。もしImが間違っていたら、誰か教えてください。\n多くの。\n\nサーバーには生活費が支払われないので、チップに頼っていることは理解しています。\nしかし、なぜ私は大きなチップを支払う必要があります...",
      "title": "サーバー、なぜ私が食べたいと思った皿は、より大きなチップをもらえるのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我担心问这个问题会被撕碎，但我真的不知道。\n懂得。如果我错了，谁来教教我，我一直在想这个问题。\n么多。\n\n我明白，服务员没有生活工资，所以他们依靠小费。\n每个人都应该得到一份生活工资，但为什么我必须支付一大笔小费给......",
      "title": "服务员，为什么我觉得吃的盘子能为你赢得更多的小费？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我擔心問這個問題會被撕碎，但我真的不知道。\n懂得。如果我錯了，誰來教教我，我一直在想這個問題。\n麼多。\n\n我明白，服務員沒有生活工資，所以他們依靠小費。\n每個人都應該得到一份生活工資，但爲什麼我必須支付一大筆小費給......",
      "title": "服務員，爲什麼我覺得喫的盤子能爲你贏得更多的小費？"
    }
  ]
}