{
  "author": "glenstaff",
  "the_new_excerpt": "If you are still trying to puzzle out what's going on with GME, try thinking\nabout it this way:\n\nWhen the Harry Potter books first came out, there was a lot of demand. It might\nhave been profitable to borrow a copy from the public library and sell it on\neBay. Sure, you now owed a copy to the library…",
  "original_created_utc": 1611986609,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你还在试图弄清楚GME是怎么一回事，可以试着想一想\n关于它这种方式。\n\n当《哈利波特》的书刚出版的时候 When the Harry Potter books first came out, 有很多需求 there was a lot of demand. 它可能\n从公共图书馆借来一本，然后再卖掉。\neBay 当然，你现在欠图书馆一份拷贝... ...",
      "title": "过于简单化地看待全球环境监测系统的情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你還在試圖弄清楚GME是怎麼一回事，可以試着想一想\n關於它這種方式。\n\n當《哈利波特》的書剛出版的時候 When the Harry Potter books first came out, 有很多需求 there was a lot of demand. 它可能\n從公共圖書館借來一本，然後再賣掉。\neBay 當然，你現在欠圖書館一份拷貝... ...",
      "title": "過於簡單化地看待全球環境監測系統的情況"
    }
  ],
  "title": "An Oversimplified Look at the GME Situation",
  "created_utc": 1611999646,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you are still trying to puzzle out what&#39;s going on with GME, try thinking about it this way:</p>\n\n<p>When the Harry Potter books first came out, there was a lot of demand. It might have been profitable to borrow a copy from the public library and sell it on eBay. Sure, you now owed a copy to the library and they were charging you late fees; but you just made $50 and eventually you&#39;d pick up a used copy for $5 once the hype died down and you&#39;d finish miles ahead. Unless something crazy happened like every copy of the Harry Potter books being sold out for months and all the used ones going for more than you sold your library book for. Then you&#39;d be watching the cost of the books keep rising and you&#39;d be accumulating late fees to boot. And since people were still wanting to read the book, the library would have to buy a replacement for the book you hadn&#39;t returned while they waited for you to return it. Now imagine that happening on a massive scale, creating tons of demand with limited supply. That is what is happening with GME. The short sellers haven&#39;t returned their library books yet and they are paying more and more late fees while they wait for the price of replacement books to come back down. Except the price won&#39;t come down and eventually they&#39;ll have to start buying books at market price or the cost of the late fees and the opportunity cost of having their resources set aside for replacing library books will make their losses even worse. This will cause more demand, increasing the price of the books, creating even more urgency for degenerate borrows to cut their losses and move on.</p>\n\n<p>Even better, the borrowers are currently committed to returning more books that are actually available to be bought at any price and the publisher is not printing any more.</p>\n\n<p>That is why holding the stock makes sense.</p>\n</div><!-- SC_ON -->",
  "score": 795,
  "permalink": "/r/stocks/comments/l8fcbm/an_oversimplified_look_at_the_gme_situation/",
  "subreddit": "stocks",
  "id": "l8fcbm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537971
}