{
  "author": "Chance_Programmer_54",
  "original_created_utc": 1651322127,
  "title": "What is the mechanism in which neurons change their connections? How are they able to 'move' their axon terminals to 'undo' a specific connection with neuron A, and create one with neuron B?",
  "created_utc": 1651328228,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For example, in neuroplasticity, how are the neurons able to &amp;#39;move&amp;#39; themselves to undo connections and create new connections with other neurons? I remember seeing a microscopic picture of a few neurons not very well connected between each other, and in the &amp;#39;after&amp;#39; picture (after learning something), they somehow had grown many projections/branches from their cell bodies, connecting with each other. In other words, what is the mechanism behind, when neurons undo a specific connection (synapse) with a neuron, and &amp;#39;move&amp;#39; it to another neuron? What causes them to &amp;#39;decide&amp;#39; to undo that connection?  &lt;/p&gt;\n\n&lt;p&gt;Also, how fast do they move connections and change their shapes (in nanometres per second, for example, or is it more like nanometres per minute)? The speed of which the dendrites and axon terminals move to change connections.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/askscience/comments/ufa7b9/what_is_the_mechanism_in_which_neurons_change/",
  "subreddit": "askscience",
  "id": "ufa7b9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For example, in neuroplasticity, how are the neurons able to 'move' themselves\nto undo connections and create new connections with other neurons? I remember\nseeing a microscopic picture of a few neurons not very well connected between\neach other, and in the 'after' picture (after learning…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、神経可塑性では、神経細胞はどのように自分自身を「動かす」ことができるのでしょうか？\nどのように「動く」ことができるのでしょうか？そういえば\n数個の神経細胞があまりうまく結合していない顕微鏡写真を見たことがある。\nそして、その「後」の写真（学習後...",
      "title": "神経細胞が結合を変化させる仕組みはどのようなものか？神経細胞はどのようにして軸索端子を「動かし」、神経細胞Aとの特定の結合を「解除」し、神経細胞Bとの結合を作り出すことができるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，在神经可塑性中，神经元如何能够 \"移动 \"自己？\n撤销连接并与其他神经元建立新的连接？我记得\n我记得看到一张显微镜下的图片，几个神经元之间的连接不是很好。\n而在 \"之后 \"的图片中（学习之后...",
      "title": "神经元改变其联系的机制是什么？它们如何能够 \"移动 \"它们的轴突终端，以 \"撤销 \"与神经元A的特定连接，并与神经元B建立一个连接？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，在神經可塑性中，神經元如何能夠 \"移動 \"自己？\n撤銷連接並與其他神經元建立新的連接？我記得\n我記得看到一張顯微鏡下的圖片，幾個神經元之間的連接不是很好。\n而在 \"之後 \"的圖片中（學習之後...",
      "title": "神經元改變其聯繫的機制是什麼？它們如何能夠 \"移動 \"它們的軸突終端，以 \"撤銷 \"與神經元A的特定連接，並與神經元B建立一個連接？"
    }
  ]
}