{
  "author": "yaroslavwwe",
  "original_created_utc": 1632549270,
  "title": "If you suddenly made $50 Million from crypto. What would you do?",
  "created_utc": 1632562522,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s say that you invested in crypto, and that investment paid off BIG TIME, from night to day you made 50 Million dollars, what would you do? We are talking about life changing money right here.</p>\n\n<p>I know it&#39;s unlikely to happen to the normies of this sub, but it&#39;s still healthy to dream about getting rich right? It&#39;s our goal when investing after all. </p>\n\n<p>I really want to know your crypto exit plan, but on steroids, 50 Million after all. </p>\n\n<p>Personally, I would try to keep it as low key as possible, you always hear about people that win the lottery and then get harassed 24/7. And I don&#39;t want any of it. So I would try to hide that info as much as I could until I&#39;m actually comfortable.</p>\n\n<p>Then I would save money just to pay taxes, as I always see people forgetting about it and ending up in bad places.</p>\n\n<p>Then I would created another passive income for myself, maybe buy a apartment complex and then rent it? I don&#39;t know, but something like that.</p>\n\n<p>What about you?</p>\n\n<p><em>Edit: I see a lot of people in the comments without their Vault open, come on guys, you have to open your vaults, otherwise no $50Million for you!</em></p>\n\n<h1><em>Edit 2: Thanks for the Happy Cake Day wishes!</em></h1>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/pv0sts/if_you_suddenly_made_50_million_from_crypto_what/",
  "subreddit": "CryptoCurrency",
  "id": "pv0sts",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's say that you invested in crypto, and that investment paid off BIG TIME,\nfrom night to day you made 50 Million dollars, what would you do? We are talking\nabout life changing money right here.\n\nI know it's unlikely to happen to the normies of this sub, but it's still\nhealthy to dream about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、あなたが暗号に投資して、その投資が大きな成果を上げたとしましょう。\n夜から昼にかけて5,000万ドルを稼いだとしたら、あなたは何をしますか？ここでは\n人生を変えるほどの大金です。\n\nこのサブにいる普通の人には起こりえないことだとは思いますが、それでも\n夢を見ることは健全なことだと思います。",
      "title": "もしあなたが突然、暗号から5000万円を稼いだとしたら。あなたは何をしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设你投资于加密货币，并且这项投资得到了巨大的回报。\n从晚上到白天，你赚了5000万美元，你会怎么做？我们正在谈论\n改变生活的钱，就在这里。\n\n我知道这不太可能发生在本子的常人身上，但它仍然是\n健康的梦想......",
      "title": "如果你突然从加密货币中赚了5000万美元。你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設你投資於加密貨幣，並且這項投資得到了巨大的回報。\n從晚上到白天，你賺了5000萬美元，你會怎麼做？我們正在談論\n改變生活的錢，就在這裏。\n\n我知道這不太可能發生在本子的常人身上，但它仍然是\n健康的夢想......",
      "title": "如果你突然從加密貨幣中賺了5000萬美元。你會怎麼做？"
    }
  ]
}