{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Saturday morning to all of you here on r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning March 29th, 2021.\n\n\nTHE…",
  "original_created_utc": 1616849490,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家周六早上好。我希望\n每个人都在这个子上做了相当不错的市场在过去的一周，和是\n为未来新的交易周做好准备。\n\n以下是你需要知道的一切，让你为本交易周做好准备。\n从2021年3月29日开始。\n\n\n该...",
      "title": "2021年3月29日开始的交易周华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家週六早上好。我希望\n每個人都在這個子上做了相當不錯的市場在過去的一週，和是\n爲未來新的交易周做好準備。\n\n以下是你需要知道的一切，讓你爲本交易周做好準備。\n從2021年3月29日開始。\n\n\n該...",
      "title": "2021年3月29日開始的交易周華爾街一週前瞻"
    }
  ],
  "title": "Wall Street Week Ahead for the trading week beginning March 29th, 2021",
  "created_utc": 1616856708,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Saturday morning to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning March 29th, 2021.</p>\n\n<h1><strong>The end of the quarter could create volatility for markets in the week ahead - <a href=\"https://www.cnbc.com/2021/03/26/the-end-of-the-quarter-could-create-volatility-for-markets-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>Stocks could be buffeted by end-of-quarter trading in the week ahead, as pension funds and other big investors buy bonds and sell stocks to rebalance their portfolios.</p>\n\n<hr/>\n\n<p>The dramatic move higher in bond yields this quarter sets up fund managers to shift their holdings, to make up for the shortfall in bond holdings.</p>\n\n<hr/>\n\n<p>The focus in the coming week could turn to the overall economy, with the March employment report expected Friday and the White House’s infrastructure plans expected to be unveiled Wednesday. There is also ISM manufacturing data released on Thursday.</p>\n\n<hr/>\n\n<p>The March jobs report is scheduled for a morning when the stock market is closed for the Good Friday holiday, but bonds will trade half a day, ending at noon. Economists expect 630,000 jobs were added in March, and the unemployment rate fell to 6% from 6.2%, according to Dow Jones.</p>\n\n<hr/>\n\n<p>President Joe Biden is expected to unveil details of his $3 trillion to $4 trillion infrastructure plan on Wednesday in Pittsburgh, but strategists say it is too soon to say what form the plan could take or how large it will be in its final form.</p>\n\n<hr/>\n\n<p>Stocks were higher in the past week, while Treasury yields were less volatile. The closely watched 10-year was at 1.67% Friday, down from 1.75% in the prior week. Yields move opposite price, and strategists expect rates to continue to slip in the coming week as investors rebalance their holdings.</p>\n\n<hr/>\n\n<p>“It’s the last week of the quarter so there could be just a lot of noise related to that,” said Peter Boockvar, chief investment strategist at Bleakley Advisory Group. “Obviously, we’ll be keeping an eye on bonds. The 10-year now seems to be in a range of 1.60% to 1.70%. I think people are just trying to find their footing here. They’re trying to figure it out.”</p>\n\n<hr/>\n\n<p>Some strategists say the quarter-end trade could end up being positive for stocks, especially big cap tech, since rates have stopped moving higher temporarily.</p>\n\n<hr/>\n\n<p>Stocks are higher for the quarter so far. The S&amp;P 500 was up 1.6% for the week and up 5.8% for the quarter to date. The Dow was up 1.4% for the week, and has an 8% gain for the first quarter so far. The Nasdaq has been the laggard, falling 0.6% for the week and up 1.9% for the quarter.</p>\n\n<hr/>\n\n<p>Bonds have staged a much more dramatic move for the quarter with the benchmark 10-year yield rising from 0.93% at the end of last year.</p>\n\n<hr/>\n\n<p>“It’s in the driver’s seat right now,” said NatWest’s Blake Gwinn of the 10-year yield. The 10-year is the most widely followed yield since it influences mortgages and other key financing rates.</p>\n\n<hr/>\n\n<p>Gwinn, head of U.S. rates strategy, said he changed his view on the 10-year and he now expects the yield to reach 2% by year-end from 1.75%. But in the near term, he said, the yield could continue to fall as big funds buy Treasurys. Japanese investors are also expected to be active buyers around their year-end, which is Wednesday.</p>\n\n<hr/>\n\n<p>“If anything, we’re really hoping it continues to push yields a little lower, so it gives us a better spot to get involved in shorts again,” he said.</p>\n\n<hr/>\n\n<h1>Infrastructure plan</h1>\n\n<p>Gwinn said he is focused on the Biden infrastructure plan and does not believe it is yet priced into the market. The $1.9 trillion fiscal plan, just signed by the president, was one driver of bond yields, as investors weighed the anticipated bump in economic activity and higher debt levels it will bring.</p>\n\n<hr/>\n\n<p>“The Biden plan to me is the biggest risk for the Treasury market right now. I don’t have what is the full Biden plan happening this year priced in to my ... forecast,” he said. “If all of a sudden we start moving quickly on that, and that starts coming together in Q2, I’m going to have to reconsider my 2% target.”</p>\n\n<hr/>\n\n<p>Gwinn said the market has “fiscal fatigue.”</p>\n\n<hr/>\n\n<p>“There’s a lot of doubt and uncertainty about how it’s going to be passed, when it’s going to be passed and whether it’s going to be passed ... It’s not tangible enough,” he said.</p>\n\n<hr/>\n\n<p>The plan is expected to span multiple years, and Democrats are expected to seek tax hikes to pay for it.</p>\n\n<hr/>\n\n<h1>Rotation</h1>\n\n<p>The rotation into cyclicals and value stocks is expected to continue into the next quarter. For the first quarter so far, energy and financials were the best performers, up about 33% and 16.5% respectively. Tech was up 1.7%, but it was a better performer than utilities and consumer staples.</p>\n\n<hr/>\n\n<p>“I think certain parts of the market have plenty of upside but part of that may come at the expense of the growth stocks,” said Dan Suzuki, deputy CIO at Richard Bernstein Advisors. He also expects growth stocks to continue to react negatively to rising interest rates and positively when they fall. That trade decoupled somewhat in the past week.</p>\n\n<hr/>\n\n<p>“It’s not going to match one for one with every wiggle,” he said. “I think the basis behind it is real. If you think rates are going to get up to 2% by the end of the year, that’s really bad for expensive high-growth names. The markets care less about absolute levels and more about direction. The higher rates go, the worse it is for high multiple stocks.”</p>\n\n<hr/>\n\n<p>Suzuki said the rise in rates is knocking some of the froth out of the market. The stocks of special purpose acquisition companies, or SPACs, had been jumping on their first days of trading in February, averaging more than 5% gains, and saw no gain in March, according to data from a University of Florida finance professor.</p>\n\n<hr/>\n\n<p>“As we’re seeing the economy get better and better at an incredible fast rate, especially when you add on stimulus, you have companies that are going to benefit most from that acceleration, that are going to be up 2X, 3X plus,” he said. “To their credit, those high multiple growth stocks were so resilient last year ... Tech earnings growth is coming in at mid-teens next year, but again, the more cyclical parts of the economy — energy, materials, industrials, small caps, they’re going to put up much stronger earnings growth this year as a result of the recovery.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/vO6bgbd.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/DHyy0jK.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/r9toVhW.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/WsvEjsM.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Yifrz8S.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ciosFuJ.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/mlnREkj.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/CtwxDvI.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/DIpCmjL.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/a57hPvk.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/up2SDlt.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/16Psc5m.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/TSJJQus.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/pLkbs1k.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>April Almanac: Top DJIA Month – Up 15 in a Row</h1>\n\n<p>April marks the end of the “Best Six Months” for DJIA and the S&amp;P 500. The window for our seasonal MACD sell signal opens on April 1st. From our Seasonal MACD Buy Signal on November 5, 2020 through yesterday’s close, DJIA was up 16.3% and S&amp;P 500 had advanced 13.2%. These above average gains are encouraging and suggests seasonality is back on track after getting derailed by Covid-19 last year.</p>\n\n<p>April 1999 was the first month to gain 1000 DJIA points. However, from 2000 to 2005, “Tax” month was hit, declining in four of six years. Since 2006, April has been up fifteen years in a row with an average gain of 2.9% to reclaim its position as the best DJIA month since 1950. April is second best for S&amp;P and fourth best for NASDAQ (since 1971).</p>\n\n<p>The first half of April used to outperform the second half, but since 1994 that has no longer been the case. The effect of April 15 Tax Deadline (moved to May 17 for 2021) appears to be diminished with numerous bullish days present on either side of the day. Traders and investors are clearly focused on first quarter earnings and guidance during April.</p>\n\n<p>This year, guidance is likely to be the greatest focus as the economy continues to reopen. Traders and investors will likely be looking for signs that “work-from-home” stocks can continue to grow and signs that leisure, hospitality, and travel are rebounding.</p>\n\n<p>Typical post-election year blues have done little to damper April’s performance since 1953. April is DJIA’s second best month in post-election years, gaining 1.9% on average. April is fourth best for S&amp;P 500 and NASDAQ. Although post-election year 2005 did suffer a 3% DJIA decline.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/9044f7ae02c5c0f0137bff0911ef7cb6/1367b75d549eb11f-fe/s400x600/d969c7c83e5a15cfb4c671e0a9ca959aa6c9fc54.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Historic Year for the S&amp;P 500</h1>\n\n<p>Tomorrow will mark the one-year anniversary of the S&amp;P 500&#39;s closing low from the COVID crash, and for most stocks in the index, it has been a historic year. Within the S&amp;P 500, stocks in the index are up an average of 104.22% through Friday&#39;s close, and just three stocks - all from the Health Care sector - are actually lower. Leading the losers, Gilead (GILD) has declined over 10%. Recall that GILD performed well during the initial stages of the pandemic on the promising results of its drug Remdesivir in treating COVID patients, but once the market started to rally, it was left behind.</p>\n\n<p>The table below lists the top 25 performing stocks in the S&amp;P 500 since the closing low on 3/23/20. Topping the list with a gargantuan gain of 763% is ViacomCBS (VIAC). After trading below $12 per share last March, the stock is close to triple-digits today. Behind VIAC, Tesla (TSLA), L Brands (LB), Etsy (ETSY), and Freeport-McMoRan (FCX) round out the top five, and all have gained in excess of 500%. Interestingly enough, despite the strength of the sector for what seems like years now, the only stock on the list from the Technology sector is Enphase Energy (ENPH). In fact, after ENPH, you have to go all the way down to the 53rd spot to find the next stock from the Technology sector (Applied Materials - AMAT, +186%).</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/03/032221-best-stocks1.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Leading the way higher, stocks in the Consumer Discretionary and Energy sectors are both up an average of over 150%, while Consumer Staples and Utilities are the only two sectors where each one&#39;s components are up an average of less than 50%. Just to the right of the S&amp;P 500 in the chart below is the Technology sector which is one of five sectors where the average performance of its components is less than 100%. A gain of 96.1% in a year is nothing to sneeze at in any market environment, but just the fact that the average performance of stocks in the Technology sector since the March lows is now lower than the average of the S&amp;P 500 illustrates the shift we have seen since the sector&#39;s peak relative strength last fall.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/03/032221-Sector-table.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>The Big Winner of the Past Year: Commodities</h1>\n\n<p>It has been just over a year since the S&amp;P 500 Index bottomed on March 23, 2020, and while global stock markets have provided historic returns since the low, the biggest winners come from a completely different asset class: commodities. As global activity quickly ground to a halt, commodity prices plummeted, with oil prices even trading for a negative value for the first time in history.</p>\n\n<p>Since March 23, 2020, commodity markets have roared back as the global economy has emerged from the shadow of COVID-19. As shown in the LPL Chart of the day, oil and lumber prices have more than doubled off the lows, while copper prices have pulled back a bit after reaching that feat back in February:</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/03/3.25.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>“After likely their worst period in history, although I wasn’t around for the bubonic plague so I can’t be certain, commodity prices have roared back as the global economy continues to wake up,” added LPL Financial Chief Market Strategist Ryan Detrick. “The US and China are well ahead of other nations in terms of economy activity and output, so as the rest of the world plays catch up, we wouldn’t be surprised to see commodities rise even further.”</p>\n\n<p>The emergence from lockdowns and subsequent increase in activity has boosted prices from the outright deflationary environment we saw last spring, to a more reflationary environment in recent months, and this has pulled commodity prices along with it. The commodity market’s top performer, lumber, has seen a particular boom in prices as the “stay at home environment” benefitted the housing market, leading to all-time highs in housing starts in December—even surpassing the high water mark set before the pandemic began. Adding to the fervor, mortgage rates continued to set record lows, falling as low as 2.82%, according to the Bankrate 30-year national average.</p>\n\n<p>We upgraded our view on oil in our January Global Portfolio Strategy publication, as strong technical factors favored prices to accelerate higher. Further, oil prices have continue to benefit from a favorable supply environment, with OPEC+ maintaining output until global demand rises, though the risk of a global increase in production at higher prices remains a risk to our view.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Mean Reversion After Biggest 1-Year Spike Since 1949?</h1>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/5689a720ed84d38815a99feebc905f12/e0f60c4ce9518235-5d/s500x750/0ac0150b41e963199a102d356909aac776eb265d.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Lots of chatter out there about the giant 1-year gain of 75% on the S&amp;P 500 from the March 23, 2020 low – actually it’s 74.78%. It may very well be the beginning of a new bull market, but that does not mean (pun intended) that we should expect gains like these moving forward.</p>\n\n<p>We ran the numbers on the 1-year rolling returns for the S&amp;P 500 back to 1949 and while these giant spikes do come at the early stages of extended bull runs gains of this magnitude have not been sustained and the market has tended to revert to the mean. The arithmetic mean or average rolling 1-year return since 1949 is 9.15%, which isn’t bad either.</p>\n\n<p>With lingering pandemic/vaccine and political and geopolitical issues, all the noise from the Fed and the bond market, Robinhood and Reddit stock pumping, rich valuations, teetering internals, extended technicals – and the end of the Best Six Months November-April on the horizon, it is not inconceivable to expect the market to consolidate over the Worst Six Months May-October (AKA “Sell in May”).</p>\n\n<p>Last time we had a 1-year rolling return of this magnitude in 2010 when the S&amp;P was up 68.57% on March 9, 2010 from the March 9, 2009 secular bear market low we had a 10.34% correction to the July 2, 2010 low and a 15.75% rolling 1-year return from March 9, 2010 to March 9, 2011. And let’s not forget the May 6, 2010 flash crash. So while we are by no means “bearish” perhaps a little caution and portfolio defense in the near future is not a crazy idea.</p>\n</blockquote>\n\n<hr/>\n\n<h1><strong>STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending March 26th, 2021</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE YOUTUBE VIDEO!]())</strong></h6>\n\n<p>(VIDEO NOT YET POSTED.)</p>\n\n<h1><strong>STOCK MARKET VIDEO: ShadowTrader Video Weekly 3.28.21</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE YOUTUBE VIDEO!]())</strong></h6>\n\n<p>(VIDEO NOT YET POSTED.)</p>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/a57hPvk.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/7ZBW7kO.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY&#39;S MARKET OPEN!]())</strong></h6>\n\n<p>(N/A.)</p>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 3.29.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/KCFoZ0p.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 3.29.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/A79uQcQ.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  3.30.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/JTM92oZ.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 3.30.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/CO3uIVi.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 3.31.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/T13r2c7.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 3.31.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/4o0Mk0k.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 4.1.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/EE7bg7B.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 4.1.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/SWonNMB.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 4.2.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 4.2.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>BlackBerry Limited $9.63</h1>\n\n<p><strong>BlackBerry Limited (BB)</strong> is confirmed to report earnings at approximately 5:05 PM ET on Tuesday, March 30, 2021. The consensus earnings estimate is $0.03 per share on revenue of $246.36 million and the Earnings Whisper ® number is $0.05 per share. Investor sentiment going into the company&#39;s earnings release has 68% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 66.67% with revenue decreasing by 12.64%. Short interest has increased by 27.2% since the company&#39;s last earnings release while the stock has drifted higher by 23.0% from its open following the earnings release to be 35.2% above its 200 day moving average of $7.12. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, March 23, 2021 there was some notable buying of 5,536 contracts of the $11.00 call expiring on Thursday, April 1, 2021. Option traders are pricing in a 11.0% move on earnings and the stock has averaged a 12.0% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=BB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Micron Technology, Inc. $87.99</h1>\n\n<p><strong>Micron Technology, Inc. (MU)</strong> is confirmed to report earnings at approximately 4:00 PM ET on Wednesday, March 31, 2021. The consensus earnings estimate is $0.96 per share on revenue of $6.20 billion and the Earnings Whisper ® number is $1.00 per share. Investor sentiment going into the company&#39;s earnings release has 77% expecting an earnings beat The company&#39;s guidance was for earnings of $0.68 to $0.82 per share. Consensus estimates are for year-over-year earnings growth of 113.33% with revenue increasing by 29.25%. Short interest has decreased by 26.1% since the company&#39;s last earnings release while the stock has drifted higher by 6.6% from its open following the earnings release to be 40.1% above its 200 day moving average of $62.82. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, March 16, 2021 there was some notable buying of 13,152 contracts of the $90.00 call expiring on Friday, July 16, 2021. Option traders are pricing in a 3.7% move on earnings and the stock has averaged a 5.6% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=MU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Chewy, Inc. $78.66</h1>\n\n<p><strong>Chewy, Inc. (CHWY)</strong> is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, March 30, 2021. The consensus estimate is for a loss of $0.09 per share on revenue of $1.96 billion and the Earnings Whisper ® number is ($0.02) per share. Investor sentiment going into the company&#39;s earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 40.00% with revenue increasing by 44.70%. Short interest has decreased by 16.8% since the company&#39;s last earnings release while the stock has drifted higher by 0.8% from its open following the earnings release to be 8.9% above its 200 day moving average of $72.21. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Friday, March 26, 2021 there was some notable buying of 12,124 contracts of the $75.00 put expiring on Friday, April 16, 2021. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 5.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>lululemon athletica inc. $314.00</h1>\n\n<p><strong>lululemon athletica inc. (LULU)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, March 30, 2021. The consensus earnings estimate is $2.49 per share on revenue of $1.66 billion and the Earnings Whisper ® number is $2.59 per share. Investor sentiment going into the company&#39;s earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 9.21% with revenue increasing by 18.78%. Short interest has increased by 31.2% since the company&#39;s last earnings release while the stock has drifted lower by 14.3% from its open following the earnings release to be 8.1% below its 200 day moving average of $341.55. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Friday, March 26, 2021 there was some notable buying of 1,135 contracts of the $340.00 call expiring on Thursday, April 1, 2021. Option traders are pricing in a 3.8% move on earnings and the stock has averaged a 5.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>BioNTech SE $95.76</h1>\n\n<p><strong>BioNTech SE (BNTX)</strong> is confirmed to report earnings at approximately 7:15 AM ET on Tuesday, March 30, 2021. The consensus estimate is for a loss of $0.18 per share on revenue of $226.94 million and the Earnings Whisper ® number is ($0.23) per share. Investor sentiment going into the company&#39;s earnings release has 69% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 37.93% with revenue increasing by 632.09%. Short interest has decreased by 41.5% since the company&#39;s last earnings release while the stock has drifted lower by 12.9% from its open following the earnings release to be 8.0% above its 200 day moving average of $88.65. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, March 17, 2021 there was some notable buying of 1,006 contracts of the $135.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 3.6% move on earnings and the stock has averaged a 4.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=BNTX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Walgreens Boots Alliance Inc $52.03</h1>\n\n<p><strong>Walgreens Boots Alliance Inc (WBA)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, March 31, 2021. The consensus earnings estimate is $1.14 per share on revenue of $35.48 billion and the Earnings Whisper ® number is $1.27 per share. Investor sentiment going into the company&#39;s earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 25.00% with revenue decreasing by 0.95%. Short interest has decreased by 21.7% since the company&#39;s last earnings release while the stock has drifted higher by 18.1% from its open following the earnings release to be 23.5% above its 200 day moving average of $42.12. Overall earnings estimates have been unchanged since the company&#39;s last earnings release. On Wednesday, March 24, 2021 there was some notable buying of 2,558 contracts of the $57.50 call expiring on Friday, May 21, 2021. Option traders are pricing in a 3.3% move on earnings and the stock has averaged a 5.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Kandi Technolgies $5.93</h1>\n\n<p><strong>Kandi Technolgies (KNDI)</strong> is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, March 30, 2021. The consensus estimate is for a loss of $0.08 per share on revenue of $33.10 million. Investor sentiment going into the company&#39;s earnings release has 65% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 42.86% with revenue decreasing by 46.47%. Short interest has increased by 18.0% since the company&#39;s last earnings release while the stock has drifted lower by 34.3% from its open following the earnings release to be 17.7% below its 200 day moving average of $7.21. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Friday, March 12, 2021 there was some notable buying of 6,400 contracts of the $5.00 put expiring on Friday, April 16, 2021. Option traders are pricing in a 21.2% move on earnings and the stock has averaged a 5.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=KNDI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>CarMax, Inc. $133.81</h1>\n\n<p><strong>CarMax, Inc. (KMX)</strong> is confirmed to report earnings at approximately 6:50 AM ET on Thursday, April 1, 2021. The consensus earnings estimate is $1.27 per share on revenue of $5.15 billion and the Earnings Whisper ® number is $1.51 per share. Investor sentiment going into the company&#39;s earnings release has 58% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.31% with revenue increasing by 3.78%. Short interest has decreased by 45.9% since the company&#39;s last earnings release while the stock has drifted higher by 38.5% from its open following the earnings release to be 29.8% above its 200 day moving average of $103.11. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, March 24, 2021 there was some notable buying of 1,123 contracts of the $132.00 call expiring on Thursday, April 1, 2021. Option traders are pricing in a 4.1% move on earnings and the stock has averaged a 6.0% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=KMX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>McCormick &amp; Company, Incorporated $90.21</h1>\n\n<p><strong>McCormick &amp; Company, Incorporated (MKC)</strong> is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, March 30, 2021. The consensus earnings estimate is $0.57 per share on revenue of $1.37 billion and the Earnings Whisper ® number is $0.59 per share. Investor sentiment going into the company&#39;s earnings release has 49% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 47.22% with revenue increasing by 13.04%. Short interest has increased by 12.2% since the company&#39;s last earnings release while the stock has drifted lower by 0.9% from its open following the earnings release to be 2.9% below its 200 day moving average of $92.92. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. Option traders are pricing in a 4.2% move on earnings and the stock has averaged a 3.6% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=MKC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 1967,
  "permalink": "/r/stocks/comments/med6uw/wall_street_week_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "med6uw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141535
}