{
  "author": "JohnLakeman99",
  "the_new_excerpt": "“with inflation rising and the economy doing better and the bond yield going up,\ndo they keep it from going up or do they let it go? If they do yield curve\ncontrol, do they risk the dollar?”\n\n“Prince — co-chief investment officer of Bridgewater, which manages $150bn in\nassets — said he was also…",
  "original_created_utc": 1615648079,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\"随着通胀上升，经济好转，债券收益率上升。\n他们是不让它涨还是让它涨？如果他们这样做收益率曲线\n控制，他们是否会冒着美元的风险？\"\n\n\"普林斯--桥水公司的联合首席投资官，该公司管理着1500亿美元的资金。\n资产--说他还...",
      "title": "桥水联合CIO普林斯谈通胀与被动投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"隨着通脹上升，經濟好轉，債券收益率上升。\n他們是不讓它漲還是讓它漲？如果他們這樣做收益率曲線\n控制，他們是否會冒着美元的風險？\"\n\n\"普林斯--橋水公司的聯合首席投資官，該公司管理着1500億美元的資金。\n資產--說他還...",
      "title": "橋水聯合CIO普林斯談通脹與被動投資"
    }
  ],
  "title": "Bridgewater co-CIO Prince on inflation and passive investing",
  "created_utc": 1615668664,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“with inflation rising and the economy doing better and the bond yield going up, do they keep it from going up or do they let it go? If they do yield curve control, do they risk the dollar?”</p>\n\n<p>“Prince — co-chief investment officer of Bridgewater, which manages $150bn in assets — said he was also troubled by the growth of index investing. With low rates leaving yield-hungry investors few alternatives to equities, he said, index funds were paying ever higher prices for stocks with lower future returns.</p>\n\n<p>“It has the look of a Ponzi scheme,” he said, “because if you can sell it on to someone else that’s fine but what happens if you can’t.”</p>\n\n<p>TLDR; QE and passive investing has created a bubble in equites and the Fed will have to decide whether to yield curve control or let inflation run wild</p>\n\n<p><a href=\"https://on.ft.com/3landPk\">Bridgewater’s Prince warns on risky assets after bond decline</a></p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/investing/comments/m4829g/bridgewater_cocio_prince_on_inflation_and_passive/",
  "subreddit": "investing",
  "id": "m4829g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379959
}