{
  "author": "Ragefan66",
  "original_created_utc": 1629304875,
  "title": "\"We know who you are. I have reported it to the admin team and they are considering taking legal action against you....Trust me, this is your first and last warning\" - A PM I got from a mod after I exposed their shitcoin",
  "created_utc": 1629311440,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>&quot;We know who you are. I have reported it to the MoonPirate admin team and they are considering taking legal action against you. Yes, they have a lawyer who has helped every step of the way. And social media threats and mininformation make for A GREAT CASE in this day and age. Trust me, this is your first and last warning&quot;.</em></p>\n\n<p>3 months ago I came across a coin called MoonPirate, a coin based around rum/beer. It&#39;s a token that provided right to vote on a poll for what they should focus on next, but that&#39;s literally it.</p>\n\n<p>I exposed them for having a fake address on their website, since I looked them up on Google maps and called the business that was actually listed at that address. I also exposed the fact that the rum was selling for $200 a bottle and that the guy running the coin literally had zero prior experience making alcohol. </p>\n\n<p>I essentially just listed information from their website and got threatened with legal action.</p>\n\n<p>Best part though? The mod in question stopped posting 4 weeks ago and Moonpirate has fallen over 93% since he sent that PM.</p>\n\n<p>It sucks when people lose money. But its hard to sympathize with people who threaten legal action to stop you from sharing your opinions.</p>\n</div><!-- SC_ON -->",
  "score": 242,
  "permalink": "/r/CryptoCurrency/comments/p6uxqz/we_know_who_you_are_i_have_reported_it_to_the/",
  "subreddit": "CryptoCurrency",
  "id": "p6uxqz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"We know who you are. I have reported it to the MoonPirate admin team and they\nare considering taking legal action against you. Yes, they have a lawyer who has\nhelped every step of the way. And social media threats and mininformation make\nfor A GREAT CASE in this day and age. Trust me, this is your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"あなたが誰であるか知っています。この件はMoonPirateの管理チームに報告しました。\nあなたに対して法的措置を取ることを検討しています。そう、彼らには弁護士がいて、あらゆる段階で助けてくれています。\nそう、彼らには弁護士がいて、あらゆる段階で助けてくれています。ソーシャルメディアでの脅迫や未成年者への情報提供は\n今の時代にはもってこいのケースです。信じてください、これはあなたの...",
      "title": "\"あなたが誰であるかは知っています。管理者チームに報告し、彼らはあなたに対して法的措置を取ることを検討しています....Trust me, this is your first and last warning\" - A PM I got from a mod after I exposed their shitcoin"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"我们知道你是谁。我已经向MoonPirate管理团队报告了此事，他们正在考虑对你采取法律行动。\n正在考虑对你采取法律行动。是的，他们有一个律师，他已经\n每一步都提供了帮助。社会媒体的威胁和虚假信息使\n在这个时代，这是一个伟大的案件。相信我，这是你的...",
      "title": "\"我们知道你是谁。我已经向管理团队报告，他们正在考虑对你采取法律行动....，相信我，这是对你的第一次也是最后一次警告\"--在我曝光了他们的狗屎币之后，我从一个mod那里得到的PM。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"我們知道你是誰。我已經向MoonPirate管理團隊報告了此事，他們正在考慮對你採取法律行動。\n正在考慮對你採取法律行動。是的，他們有一個律師，他已經\n每一步都提供了幫助。社會媒體的威脅和虛假信息使\n在這個時代，這是一個偉大的案件。相信我，這是你的...",
      "title": "\"我們知道你是誰。我已經向管理團隊報告，他們正在考慮對你採取法律行動....，相信我，這是對你的第一次也是最後一次警告\"--在我曝光了他們的狗屎幣之後，我從一個mod那裏得到的PM。"
    }
  ]
}