{
  "author": "Seebeedeee",
  "original_created_utc": 1634822780,
  "title": "I’m ALL IN and it feels good!",
  "created_utc": 1634855852,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started buying in 2017 but stupidly didn’t buy the bear market and focused on stocks (which did incredible for stocks).  I was comfortable holding my stocks and felt they were safe and had a great return.  However, they have not compared to BTC’s overall returns after this bull run.</p>\n\n<p>When BTC began making headlines again, I dove into the research and actually had a panic attack when “it clicked” in my brain.  How could I have not seen the potential before?  Thank goodness I never sold a single sat during the bear market.</p>\n\n<p>I decided to aggressively DCA into Bitcoin.  I sold all my stocks and Alts when the first dip occurred this year and put it all on BTC.  I bought every dip.  Then I called my IRA manager and told him to sell everything and mail me the check.  I dumped all of it on BTC in the low 30k’s and 29k.  My IRA manager said it was crazy. </p>\n\n<p>Well, I’ve now DCA’d everything into BTC.  New BTC purchases will come from my salary.  I have no other assets besides my house and an S19j Pro ASIC miner I recently bought.  I plan to keep everything I mine and purchase more ASICs. </p>\n\n<p>I’ve never had more money in my life and I’ve never felt so optimistic.  Who’s crazy now?</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/Bitcoin/comments/qcrs31/im_all_in_and_it_feels_good/",
  "subreddit": "Bitcoin",
  "id": "qcrs31",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I started buying in 2017 but stupidly didn’t buy the bear market and focused on\nstocks (which did incredible for stocks). I was comfortable holding my stocks\nand felt they were safe and had a great return. However, they have not compared\nto BTC’s overall returns after this bull run.\n\nWhen BTC began…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2017年に買い始めましたが、愚かにも弱気相場を買わずに、集中的に\n株を信じられないような結果になりました）。私は自分の株を保有することが快適でした\nで、安全で素晴らしいリターンがあると感じていました。しかし、それらは比較になりません。\nBTCの全体的なリターンには及ばない。\n\nBTCが始まったとき...",
      "title": "私はオールインしていて、気分がいいですよ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2017年开始买入，但愚蠢地没有买入熊市，而是专注于\n股票（这对股票来说是不可思议的）。我很舒服地持有我的股票\n并觉得它们是安全的，有很好的回报。然而，它们并没有比\n与BTC在这次牛市后的整体回报相比。\n\n当BTC开始...",
      "title": "我全身心投入，感觉很好!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2017年開始買入，但愚蠢地沒有買入熊市，而是專注於\n股票（這對股票來說是不可思議的）。我很舒服地持有我的股票\n並覺得它們是安全的，有很好的回報。然而，它們並沒有比\n與BTC在這次牛市後的整體回報相比。\n\n當BTC開始...",
      "title": "我全身心投入，感覺很好!"
    }
  ]
}