{
  "author": "Kingkong_smoldong",
  "the_new_excerpt": "Hello everyone, been kinda lurking on this sub lately. Found a lot of useful DD\nand met cool people. Decided I wanted to post a coin I’m very bullish on.\n\n * Harmony ONE is a blockchain-based platform, built to solve the riddle of\n   delivering both scalability and decentralization at no expense of…",
  "original_created_utc": 1618974366,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。最近はこのサブサイトをちょっと覗いていました。たくさんの有用なDDを見つけました。\nとクールな人々に出会いました。私はとても強気なコインを投稿したいと思いました。\n\n * Harmony ONEはブロックチェーンベースのプラットフォームで、スケーラビリティと分散性の両方を提供するという謎を解決するために構築されました。\n   Harmony ONEはブロックチェーンベースのプラットフォームで、スケーラビリティと分散性を両立させるという謎を解決するために構築されています...",
      "title": "ハーモニーONE"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，最近一直潜伏在这个分区。发现了很多有用的DD\n并认识了一些很酷的人。我决定发布一个我非常看好的硬币。\n\n * 和谐一号是一个基于区块链的平台，旨在解决以下问题\n   提供可扩展性和去中心化，同时又不影响到......",
      "title": "和谐一号"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，最近一直潛伏在這個分區。發現了很多有用的DD\n並認識了一些很酷的人。我決定發佈一個我非常看好的硬幣。\n\n * 和諧一號是一個基於區塊鏈的平臺，旨在解決以下問題\n   提供可擴展性和去中心化，同時又不影響到......",
      "title": "和諧一號"
    }
  ],
  "title": "Harmony ONE",
  "created_utc": 1618990272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone, been kinda lurking on this sub lately. Found a lot of useful DD and met cool people. Decided I wanted to post a coin I’m very bullish on. </p>\n\n<ul>\n<li>Harmony ONE is a blockchain-based platform, built to solve the riddle of delivering both scalability and decentralization at no expense of one another.</li>\n<li>Right now it has 2 second finality, yes 2 SECONDS.</li>\n<li>Its fees are extremely cheap, like practically fee when using it to do transactions. </li>\n<li>The team behind Harmony are amazing too, I’m not gonna list their names and accomplishments because I want to focus on the coin right now, but definitely recommend looking them up! </li>\n<li>Harmony’s MC is roughly 1.1B right now, price is .1233 at the moment. </li>\n<li><p>Harmony has been partnering up with some big names and announcing new partnerships almost every week now. Some big names are Animoca, Quidd, SWFT, and so many more. </p></li>\n<li><p>Staking, it’s 12% APY. Absolutely insane. </p></li>\n<li><p>All in all the team and coin are doing great things, the only thing it lacks really is community. Harmony just needs more exposure and adoption in the crypto world. A lot of people are predicting $1-$1.50 during this Bull run. I’m not gonna put any prediction of mine, because I’m a long term holder and the staking alone is amazing. I hope everyone decides to do some DD on this coin! Definitely recommend at least adding to the watchlist!</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 1317,
  "permalink": "/r/CryptoCurrency/comments/mv6yk8/harmony_one/",
  "subreddit": "CryptoCurrency",
  "id": "mv6yk8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523332
}