{
  "author": "Fiasco715",
  "original_created_utc": 1659639612,
  "title": "why is everywhere \"hiring\" but nowhere is actually hiring?",
  "created_utc": 1659665675,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been applying to a bunch of jobs, and haven&amp;#39;t gotten any interviews. If they do reach out it&amp;#39;s just to say they have not selected me for the job. I know I&amp;#39;m not the only one having this issue, I&amp;#39;ve seen a ton of people saying they are having the same issue. But then apparently there&amp;#39;s a shortage of workers and companies are understaffed, and I don&amp;#39;t understand why they aren&amp;#39;t hiring if they are so understaffed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 199,
  "permalink": "/r/NoStupidQuestions/comments/wg99mn/why_is_everywhere_hiring_but_nowhere_is_actually/",
  "subreddit": "NoStupidQuestions",
  "id": "wg99mn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been applying to a bunch of jobs, and haven't gotten any interviews. If\nthey do reach out it's just to say they have not selected me for the job. I know\nI'm not the only one having this issue, I've seen a ton of people saying they\nare having the same issue. But then apparently there's a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いろいろな仕事に応募しているが、面接を受けることができない。もし\nもし連絡があったとしても、その仕事には選ばれなかったと言われるだけです。わかってるんです。\nこの問題を抱えているのは私だけではなく、多くの人が同じ問題を抱えていると言ってい\nこの問題を抱えているのは私だけではなく、多くの人が同じ問題を抱えていると言っています。でも、どうやら...",
      "title": "なぜ、どこもかしこも「採用」しているのに、実際にはどこも採用していないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在申请一堆工作，但没有得到任何面试。如果\n如果他们主动联系我，也只是说他们没有选择我的工作。我知道\n我知道我不是唯一有这个问题的人，我看到很多人说他们\n有同样的问题。但是，显然有一个...",
      "title": "为什么到处都在 \"招聘\"，但没有地方真正在招聘？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在申請一堆工作，但沒有得到任何面試。如果\n如果他們主動聯繫我，也只是說他們沒有選擇我的工作。我知道\n我知道我不是唯一有這個問題的人，我看到很多人說他們\n有同樣的問題。但是，顯然有一個...",
      "title": "爲什麼到處都在 \"招聘\"，但沒有地方真正在招聘？"
    }
  ]
}