{
  "author": "Barcelona10CG",
  "original_created_utc": 1655060885,
  "title": "Am I overreacting or am I getting sexually harassed?",
  "created_utc": 1655073622,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All of my cousins are girls and so after years of sleepovers/hanging with their friends I’ve developed a pretty big group of girl friends that I hangout with regularly. &lt;/p&gt;\n\n&lt;p&gt;I started lifting recently and have build some muscle but it’s honestly not even that crazy. But I noticed that they are getting a little too comfortable with me and “jokingly” touching my arms and even lifting up my shirt when we’re in public. In the beginning I didn’t really mind it since I’ve known most of these girls for years and we’re comfortable being a little physical but now that Im single again it’s getting really bad lately, specially if they’re in a group because they do more risky things just to see my reaction. \nSometimes they jokingly ask “how big is it” or if Im driving they would put their hand on my thighs and slowly go up until I have to stop them and they laugh it off, It’s getting to the point where I cant even have them over anymore because if we’re alone watching a show they’ll start making excuses to be touching or they jokingly rest their legs on me or they lay their heads on my chest and it puts me in a really uncomfortable position and on edge.&lt;/p&gt;\n\n&lt;p&gt;I am making this post because last night was the last straw and they took it a little too far. I got invited to swim at one of their pools and it was literally just me and 4 of my girl friends. We got tipsy playing some card games before swimming and they made a big deal about how I have to “strip” for them first before they put on their bikinis. I already had my swim trunks on and i dont know how to strip so i just unbuttoned my shirt slowly with the music and it was funny, but the night just kinda got weirder specially when we were all inside the pool they kept taking turns going underwater and “tugging” down my swim trunks and shit. I was on edge the whole time. When I got out one of them smacked my ass and they all laughed. Theres more incidents but this is getting long. Am I just tripping or should I maybe say something&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 140,
  "permalink": "/r/TooAfraidToAsk/comments/vasy66/am_i_overreacting_or_am_i_getting_sexually/",
  "subreddit": "TooAfraidToAsk",
  "id": "vasy66",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "All of my cousins are girls and so after years of sleepovers/hanging with their\nfriends I’ve developed a pretty big group of girl friends that I hangout with\nregularly.\n\nI started lifting recently and have build some muscle but it’s honestly not even\nthat crazy. But I noticed that they are getting…"
}