{
  "author": "Geoffrey1016",
  "the_new_excerpt": "As we know, after the Actium, Octavian ordered Caesarion and Marcus Antonius\nAntyllus to be executed, but apparently he spared the children of Mark Antony\nand Cleopatra VII. The fate of the boys were unknown, but it's certain that they\nweren't killed by Octavian(otherwise historians, who were…",
  "original_created_utc": 1619959258,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "周知の通り、アクティウムの後、オクタヴィアンはシーザーリオンとマルクス・アントニウスの\nAntyllusを処刑するように命じたが、Mark Antony\nとクレオパトラ7世の子供たちを惜しんだようです。子供たちの運命は不明だが、オクタヴィアンに殺されたのではないことは確かである。\nオクタヴィアンに殺されたのではないことは確かである（そうでない歴史家たちは",
      "title": "そもそもオクタヴィアンは、クレオパトラ7世とマーク・アントニーとの間の子供たちをなぜ惜しんだのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们知道，在阿克提姆事件后，屋大维下令将凯撒里奥和马库斯-安东尼\n安提勒斯被处决，但显然他放过了马克-安东尼的孩子们\n和克里奥帕特拉七世的孩子。这些孩子的命运不得而知，但可以肯定的是，他们不是被屋大维杀死的。\n但可以肯定的是，他们不是被屋大维杀死的（否则，历史学家，他们...",
      "title": "屋大维当初为什么要放过克里奥帕特拉七世与马克-安东尼的孩子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們知道，在阿克提姆事件後，屋大維下令將凱撒里奧和馬庫斯-安東尼\n安提勒斯被處決，但顯然他放過了馬克-安東尼的孩子們\n和克里奧帕特拉七世的孩子。這些孩子的命運不得而知，但可以肯定的是，他們不是被屋大維殺死的。\n但可以肯定的是，他們不是被屋大維殺死的（否則，歷史學家，他們...",
      "title": "屋大維當初爲什麼要放過克里奧帕特拉七世與馬克-安東尼的孩子？"
    }
  ],
  "title": "Why did Octavian spare the children of Cleopatra VII with Mark Antony in the first place?",
  "created_utc": 1619994669,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As we know, after the Actium, Octavian ordered Caesarion and Marcus Antonius Antyllus to be executed, but apparently he spared the children of Mark Antony and Cleopatra VII. The fate of the boys were unknown, but it&#39;s certain that they weren&#39;t killed by Octavian(otherwise historians, who were largely nostagic about the age prior to Caesar, would write down this).</p>\n\n<p>Why didn&#39;t Octavian order them to be executed as well, to prevent another Civil war after his death(as forces opposed to Octavian might rally behind a descendant of both Antony and Cleopatra had Octavian suddenly died, as Octavian himself only had a daughter and two young stepsons at the time)? I can understand why didn&#39;t Octavian kill his own niece(otherwise it would provide ammunition to his enemies), but I cannot understand why Octavian keep all three children of Mark Antony and Cleopatra VII alive. </p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/n35mkg/why_did_octavian_spare_the_children_of_cleopatra/",
  "subreddit": "AskHistorians",
  "id": "n35mkg",
  "is_self": true,
  "media": null,
  "is_video": false
}