{
  "author": "Curiosity-Sailor",
  "original_created_utc": 1642728362,
  "title": "Why does every business we associate with refer to my husband for this and ignore me?",
  "created_utc": 1642737399,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At every apartment complex we have lived at, they send apartment information (emails, calls, etc.) only to my husband. My bank account changed my husband to primary owner after I added him onto it, after I had had the account for over 5 years. The insurance company we use and the place we got our car…every business we have interacted with basically treats my husband like he is the owner and provider even after I have made it clear I am the person to contact. They contact him INSTEAD of me. It really pisses me off because idk what else to think other than every business is sexist?&lt;/p&gt;\n\n&lt;p&gt;I specifically gave my contact info as the main contact info at every one of these institutions, besides being the main applicant and only person who has ever contacted them (and being the person who pays for rent and all the bills). This has happened in multiple states, so it is not just one area.&lt;/p&gt;\n\n&lt;p&gt;My husband is perplexed as well.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/NoStupidQuestions/comments/s8yemi/why_does_every_business_we_associate_with_refer/",
  "subreddit": "NoStupidQuestions",
  "id": "s8yemi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "At every apartment complex we have lived at, they send apartment information\n(emails, calls, etc.) only to my husband. My bank account changed my husband to\nprimary owner after I added him onto it, after I had had the account for over 5\nyears. The insurance company we use and the place we got our…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今まで住んでいたマンションでは、マンション情報を送ってくれるのですが\n(メールや電話など)は夫にだけ。私の銀行口座が夫に変わりました。\n私が5年以上口座を持っていたのに、私が彼を口座に加えた後、主な所有者は私になりました。\n年です。利用している保険会社や加入しているところ...",
      "title": "なぜ、私たちが付き合うすべての企業が、この件で夫を紹介し、私を無視するのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我们住过的每个公寓楼，他们都会发送公寓信息\n(电子邮件、电话等)只发给我丈夫。我的银行账户在我把我丈夫加入后，把他改为\n在我把他加进去之后，我的银行账户就变成了主要所有者，而我已经拥有这个账户5年多了。\n年。我们使用的保险公司和我们得到我们的地方。",
      "title": "为什么与我们有联系的每家企业都向我丈夫提及此事，而不理会我？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們住過的每個公寓樓，他們都會發送公寓信息\n(電子郵件、電話等)只發給我丈夫。我的銀行賬戶在我把我丈夫加入後，把他改爲\n在我把他加進去之後，我的銀行賬戶就變成了主要所有者，而我已經擁有這個賬戶5年多了。\n年。我們使用的保險公司和我們得到我們的地方。",
      "title": "爲什麼與我們有聯繫的每家企業都向我丈夫提及此事，而不理會我？"
    }
  ]
}