{
  "author": "rmczpp",
  "original_created_utc": 1643110539,
  "title": "Stop making DApps that don't open until you connect your wallet.",
  "created_utc": 1643159521,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I really hate that this has become so normalised in the crypto space, but I&amp;#39;ve encountered it many times before and again just now. You want to view a project&amp;#39;s DApp but it forces you to connect your wallet in order to even launch the app properly. Isn&amp;#39;t this a huge security risk? Part of your due diligence checks into a project involve checking it out first to see that it isn&amp;#39;t a scam before it can access your funds, why are they making this impossible? This is just a rant but I&amp;#39;d love to hear other&amp;#39;s thoughts on it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/scbpjb/stop_making_dapps_that_dont_open_until_you/",
  "subreddit": "CryptoCurrency",
  "id": "scbpjb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I really hate that this has become so normalised in the crypto space, but I've\nencountered it many times before and again just now. You want to view a\nproject's DApp but it forces you to connect your wallet in order to even launch\nthe app properly. Isn't this a huge security risk? Part of your due…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このようなことが暗号空間で常態化しているのは本当に嫌なことですが、私はこれまで\n以前から何度も遭遇しており、先ほどもまた遭遇しました。を見たいと思う。\nプロジェクトのDAppを起動するにも、ウォレットを接続するよう強制されます。\nアプリが正常に動作するようになりました。これはセキュリティ上、大きなリスクではないでしょうか？あなたの期限の一部...",
      "title": "ウォレットを繋ぐまで開かないDAppsを作るのはやめてくれ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的很讨厌这种情况在加密货币领域变得如此正常化，但我之前已经多次遇到这种情况，刚才又遇到了。\n以前遇到过很多次，刚才又遇到了。你想查看一个\n项目的DApp，但它强迫你连接你的钱包，以便正确启动\n适当地启动该应用程序。这不是一个巨大的安全风险吗？你的部分应...",
      "title": "不要再制作那些在你连接钱包之前无法打开的DApps。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的很討厭這種情況在加密貨幣領域變得如此正常化，但我之前已經多次遇到這種情況，剛纔又遇到了。\n以前遇到過很多次，剛纔又遇到了。你想查看一個\n項目的DApp，但它強迫你連接你的錢包，以便正確啓動\n適當地啓動該應用程序。這不是一個巨大的安全風險嗎？你的部分應...",
      "title": "不要再製作那些在你連接錢包之前無法打開的DApps。"
    }
  ]
}