{
  "author": "tscottn",
  "the_new_excerpt": "I sold 35 bitcoin for 3 pizzas back in 2011 and totally forgotten all about the\npizza until a few days ago when a buddy of mine asked if I ever ate them. I\ncouldn't really remember being so long ago, but I immediately went to my fridge.\nI looked for about 3 hours in there and finally found what…",
  "original_created_utc": 1613745521,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在2011年卖了35个比特币买了3个披萨，完全忘记了所有的事情。\n直到几天前，我的一个朋友问我是否吃过披萨。I\n真的不记得是这么久以前的事了，但我马上去了我的冰箱。\n我在里面找了3个小时，终于找到了... ...",
      "title": "伙计们，我很高兴我终于找回了我的披萨!!!!。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2011年賣了35個比特幣買了3個披薩，完全忘記了所有的事情。\n直到幾天前，我的一個朋友問我是否喫過披薩。I\n真的不記得是這麼久以前的事了，但我馬上去了我的冰箱。\n我在裏面找了3個小時，終於找到了... ...",
      "title": "夥計們，我很高興我終於找回了我的披薩!!!!。"
    }
  ],
  "title": "Guys I'm so happy I recovered my pizzas finally!!!!",
  "created_utc": 1613763196,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I sold 35 bitcoin for 3 pizzas back in 2011 and totally forgotten all about the pizza until a few days ago when a buddy of mine asked if I ever ate them.  I couldn&#39;t really remember being so long ago, but I immediately went to my fridge.  I looked for about 3 hours in there and finally found what might be 3 pizzas, I couldn&#39;t really tell but I also found a google doc on how to recover my pizzas.  I tried all night but couldn&#39;t remember my password, but then I called a pizza recovery service near me, and the guy was totally cool and used brute force password tech to recover my pizzas, I had to give him half of my pizzas but man was it worth it, I&#39;m living large now with 1.5 pizzas .  I think I will just hodl them for awhile till I can talk to my tax guy as see what&#39;s up.  Just wanted to share this story about my pizzas.  Its a happy day for me guys.  you all take care.</p>\n\n<p>&#x200B;</p>\n\n<p>ps.. they are all cheese and peperoni if anyone cares.</p>\n</div><!-- SC_ON -->",
  "score": 773,
  "permalink": "/r/Bitcoin/comments/lnhddm/guys_im_so_happy_i_recovered_my_pizzas_finally/",
  "subreddit": "Bitcoin",
  "id": "lnhddm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332870762
}