{
  "author": "TNGSystems",
  "the_new_excerpt": "After FunFair (A coin that I legitimately held since 2017) received a massive\npump from $0.0042 to $0.0210, sending the moonshot bag I bought into the\nstratosphere, I looked on this Crypto sub and saw people saying it was a Pump\nand Dump. Curious, I followed the Discord link someone had provided to…",
  "original_created_utc": 1609624874,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在游乐场(我自2017年以来合法持有的一枚硬币)收到了大量的\n从0.0042美元涨到0.0210美元，把我买的登月包送到\n平流层，我看着这艘加密潜艇，看到人们说它是一个泵\n然后扔掉。出于好奇，我跟踪了某人提供给…的不和谐链接",
      "title": "在一个抽水倾倒的团伙里，有欺骗，有骗局，也有艺术。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在遊樂場(我自2017年以來合法持有的一枚硬幣)收到了大量的\n從0.0042美元漲到0.0210美元，把我買的登月包送到\n平流層，我看着這艘加密潛艇，看到人們說它是一個泵\n然後扔掉。出於好奇，我跟蹤了某人提供給…的不和諧鏈接",
      "title": "在一個抽水傾倒的團伙裏，有欺騙，有騙局，也有藝術。"
    }
  ],
  "title": "Inside a Pump-and-Dump group, the deception, the con and the art.",
  "created_utc": 1609655958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After FunFair (A coin that I legitimately held since 2017) received a massive pump from $0.0042 to $0.0210, sending the moonshot bag I bought into the stratosphere, I looked on this Crypto sub and saw people saying it was a Pump and Dump. Curious, I followed the Discord link someone had provided to a group with over 200,000 members.  </p>\n\n<p>I didn&#39;t know what I should do, observe or participate... so for the time being I poked around and saw the structure of it all. You can&#39;t participate in any chats unless you invite someone. If you invite more people you get more bonuses... More on this later.  </p>\n\n<p><strong>The Deception</strong>  </p>\n\n<p>So what&#39;s a Pump and Dump group? Well, the owner selects a coin, I presume a low volume, low Market Cap project that&#39;s been dead for some time. Then they send a signal out to buy and everyone <strong>must</strong> market buy, then wait for the rubes on the outside (you) to think something big is happening, then they encourage participants to sell, &quot;25% at a time&quot; to prevent the market dumping.  </p>\n\n<p>Hey, in theory, it seems like if you&#39;re in, you&#39;re in and nothing can go wrong. There&#39;s even channels where you can help advertise the coin on social media, with links to Reddits, Tweets etc. Looks well organised and legit. With that, I decided to dip my toes and participate - if I held FUN before, and the 6-hour pump brought a 6-7x return on investment, what could happen next?  </p>\n\n<p><strong>The Con</strong>  </p>\n\n<p>In reality, things are different.  </p>\n\n<p>What happens is, the admin has picked a coin. This time, it was <strong>NEBL</strong>. They have all the time to load their bags. Let&#39;s say they put $10,000 into NEBL over a few weeks. The price barely moves and they have their bag ready. Then they start an announcement. &quot;On January 2nd at 9PM GMT, the next coin to be pumped will be announced&quot;  </p>\n\n<p>Remember that bonus I mentioned earlier? If you invite 5 people, you get notified 1 second earlier. If you invite 10, 2 seconds earlier, and so on.</p>\n\n<p>You or I may think that we all just buy at 9PM, and then when we get big profit, sell and move on. If it worked that way, then getting rich from these groups would be utterly trivial. Unfortunately, in reality, what happens is the people that get notified seconds earlier place fat buy orders, and by the time the thousands of new-ranks enter the server, it&#39;s all over. They buy at X price, but that&#39;s already more than enough profit for the admins and high-ranked server members, who are able to make out like bandits.  </p>\n\n<p>At a representative example, the coin chosen today was sat at 2744 sats prior to the dump. As soon as the alert went out, I went straight to the NEBL/BTC market and market-bought with just £50 of Bitcoin - a punt to try this thing out. My market buy went in at a whopping 8998 - at my buy, they more than tripled the price of the coin in <strong>seconds</strong>.  I don&#39;t even know if it went higher because a fraction of a second later, it all crashed. Right now it&#39;s sat at 0.0002472 - ironically slightly less than before.  </p>\n\n<p>The real kicker is that as soon as they announce the coin, they close the chat. Anyone who gets trapped can&#39;t get out and can&#39;t alert anyone else to what&#39;s happening. Right now, I&#39;m speaking to 10+ people who recently posted in the chat and <em>every single one of them</em> has lost money, some $10, some $25, one has even lost $500+  </p>\n\n<p><strong>The Art</strong>  </p>\n\n<p>I can only stress that I haven&#39;t gone in to this thinking it will compose my trading strategy - I&#39;ve learned that this group had nothing to do with the FUN P&#39;n&#39;D and there won&#39;t be an extended 6-hour pump. Instead, it seems like a very well-made and elaborate con to dump the absolute bejeesus of bags onto the rubes, who aren&#39;t the outsiders, but rather the 99% of users who participate thinking they are in for easy profit.  </p>\n\n<p><strong>Nobody ever said there was such a thing as a free lunch</strong>  </p>\n\n<p>If you could get in to this 20 seconds earlier, you&#39;d make money. Even better if you were the admin or his inside ring. You could make quite literally millions.  </p>\n\n<p>So in it&#39;s purest art form:  </p>\n\n<ul>\n<li>Accumulate coin on the sly until you have a heavy bag.<br/></li>\n<li>Announce a time to buy <em>secret coin</em><br/></li>\n<li>Send <em>secret coin</em> name to a small privileged group a few seconds before announcing it publicly.<br/></li>\n<li>Close the chat so people can&#39;t warn of the impending shitshow<br/></li>\n<li>The rubes buy it at market price en-masse<br/></li>\n<li>Seconds after the rubes have bought it, dump for massive profit.<br/></li>\n<li>The rules state not to panic sell, this is to encourage the rubes not to think it&#39;s a scam and hold on as their BTC turns into a completely worthless shitcoin.<br/></li>\n</ul>\n\n<p>And there you have it. The deception, the con and the art.  </p>\n\n<p>This is a warning to you. I lost a trivial amount of money, I was curious more than I was greedy. But I am talking to people who have lost nearly 4 figures worth of Fiat. If any of this looks obvious, well in a way it is, but scams are always obvious when someone is explaining them to you. On the face of it, I think I believed because I experienced the absolutely wild ride of FUN yesterday which was entirely coincidental - I just happened to hold a coin that PnD groups happened to pump and I got the benefit of it.  </p>\n\n<p>Stay safe out there.  </p>\n\n<p><strong>UPDATE TIME BIG UPDATE</strong></p>\n\n<p>This was added to the Discord channel:  </p>\n\n<blockquote>\n<p>Dear members, the pump was insane, we have 4 years of experience and never expected this volume. With a peak of 1200% this was the highest pump we have seen with this group. Was it the best pump? Not really. <strong>There is a lot of people that profited but because it went this high this quick, there is also people that lost during the pump. Luckily, there were a couple of waves the first few minutes.</strong> The second minute there was a lot of selling volume, which means a lot of people in our group were able to sell. Like we always say, do NOT buy too high. If you are late buying in, do not buy in or wait for the second wave. Never buy above 500%. We will send video&#39;s of people that participated soon. We will analyse this pump in a few hours. Chats will open later.  </p>\n</blockquote>\n\n<p>Bolded emphasis mine. I think it&#39;s complete fucking baloney. There was no wave, it was one spike which lasted a few seconds, and then massive selling pressure. More a dump than a pump.  </p>\n\n<p>Someone else in the server lodged a complaint and got this back:  </p>\n\n<blockquote>\n<p>&quot;That is unfortunate to hear. I&#39;ve been getting DMs of people complaining. I have also seen someone lose their life savings today. We hope this VIP opportunity can help losers become winners next week guaranteed, and if you&#39;re a winner to keep on winning. :slight_smile:<br/>\n0.005 BTC is the price for next weeks signal.<br/>\nYou&#39;ll be added to a private channel with other members.&quot;   </p>\n</blockquote>\n\n<p>So not satisfied with ripping off thousands of users at once, now pay them to be added to a private group. What a load of bollocks.</p>\n</div><!-- SC_ON -->",
  "score": 352,
  "permalink": "/r/CryptoCurrency/comments/kp6s43/inside_a_pumpanddump_group_the_deception_the_con/",
  "subreddit": "CryptoCurrency",
  "id": "kp6s43",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100744757
}