{
  "author": "InvestmentAccStonks",
  "the_new_excerpt": "While researching Darktrace’s rumoured all but confirmed upcoming IPO I began by\nlooking at whom the executive team were, with this research I’ve come across a\nfew interesting red flags regarding the executive team and those who funded the\ncompany which I think would be of acute interest to anyone…",
  "original_created_utc": 1609712965,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在研究Darktrace的传言时，我几乎确认了即将进行的IPO\n看看谁是高管团队，在这项研究中，我遇到了一个\n关于执行团队和那些提供资金的人，几乎没有什么有趣的危险信号\n我认为任何人都会对这家公司产生浓厚兴趣的…",
      "title": "Darktrace：即将进行的IPO受到100亿美元惠普Autonomy丑闻的影响"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在研究Darktrace的傳言時，我幾乎確認了即將進行的IPO\n看看誰是高管團隊，在這項研究中，我遇到了一個\n關於執行團隊和那些提供資金的人，幾乎沒有什麼有趣的危險信號\n我認爲任何人都會對這家公司產生濃厚興趣的…",
      "title": "Darktrace：即將進行的IPO受到100億美元惠普Autonomy醜聞的影響"
    }
  ],
  "title": "Darktrace: An upcoming IPO shadowed by the $10 Billion HP Autonomy scandal",
  "created_utc": 1609727797,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While researching Darktrace’s rumoured all but confirmed upcoming IPO I began by looking at whom the executive team were, with this research I’ve come across a few interesting red flags regarding the executive team and those who funded the company which I think would be of acute interest to anyone looking to invest in Darktrace once it does go public.</p>\n\n<p>This post will very briefly go into each of the executive team members listed on <a href=\"https://www.darktrace.com/en/executive-team/\">Darktrace’s website</a> and will point out their strong links to HP Autonomy which was embroiled in an accounting scandal in 2011 that resulted in $8.8B being written off the company after it was acquired by HP, the lawsuits for which are ongoing.</p>\n\n<p>-----------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<h1>Executive Team:</h1>\n\n<p><strong>Poppy Gustafsson - Chief Executive Officer</strong> (Previously CFO &amp; COO @ Darktrace) Gustafsson has held a position of Assistant Manager at Deloitte, the accounting/auditing firm who were fined £15M for its audit of HP Autonomy that contained “<a href=\"https://uk.reuters.com/article/uk-accounts-deloitte-fine-idUKKBN2680UH\">serious and serial failures</a>”.</p>\n\n<p>Gustafsson has also held a Corporate Controller position directly in Autonomy.</p>\n\n<p><strong>Cathy Graham - Chief Financial Officer</strong> Graham appears to be one of the few executives that have no connection to HP Autonomy. She has overseen the successful IPO of 2U Inc (NASDAQ: TWOU) and her presence in the company appears to give some valid legitimacy. However, she has only been with Darktrace since February 2020 so make of that what you will.</p>\n\n<p><strong>Jack Stockdale - Chief Technology Officer</strong> Stockdale has held a position of Technical Director at Autonomy. Also <a href=\"https://youtu.be/USHgnyIGAXI?t=280\">mentioned to be a co-founder of Darktrace by Gustaffson</a></p>\n\n<p><strong>Eloy Avila - Chief Technology Officer</strong> Avila has held extensive posts at Autonomy from 2004 - 2014.</p>\n\n<p><strong>Nicole Eagan - Chief Strategy Officer, AI Officer</strong> (Previously Co-CEO w Gustafsson) Eagan was Chief Marketing Officer at Autonomy between 2005 - 2012.</p>\n\n<p><strong>Emily Orton - Chief Marketing Officer</strong> Previously EU Marketing Manager at Autonomy</p>\n\n<p><strong>Nick Trim - Chief Revenue Officer</strong> Trim is another executive who does not appear to have held any positions at Autonomy, although he does have strong connections with intelligence agencies and has been with Darktrace since the early days of the company and was <a href=\"https://youtu.be/USHgnyIGAXI?t=280\">mentioned to be a co-founder by Gustaffson</a>.</p>\n\n<p><strong>Mike Beck - Global CISO</strong> No apparent connections to Autonomy, has been with Darktrace since 2014 and has strong connections with the UK Government.</p>\n\n<p><strong>Dave Palmer - Director of Technology</strong> Again no apparent connections to Autonomy, has been with Darktrace since 2013 and has strong connections with the UK Government.</p>\n\n<p><strong>Al Martin - SVP, Customer Success</strong> Little public information of interest to be found in my quick search.</p>\n\n<p>-----------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>&#x200B;</p>\n\n<p>To add to all this one multiple others who were directly responsible for the HP Autonomy scandal including Mike Lynch and Steve Chamberlain (both have been criminally charged for fraud) have a MAJOR influence in Darktrace to this day with Mike Lynch’s venture capital firm Invoke Capital being the first and biggest investor in Darktrace along with Chamberlain holding the position of Operations Manager at Darktrace.</p>\n\n<p>In conclusion; all this puts some serious red flags for me on a company I initially had a very positive outlook on. HP Autonomy was involved in one of the largest accounting fraud cases and much of the individuals behind Autonomy are the same ones behind Darktrace with a few others mixed in.</p>\n\n<p>-----------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>A few articles of interest on this subject which has been covered a fair amount:</p>\n\n<p>Forbes: Skeletons In The Closet: $2 Billion Cybersecurity Firm Darktrace Haunted By Characters From HP’s Failed Autonomy Deal</p>\n\n<p>Buisness Insider: Meet the power players at $1.7 billion cybersecurity giant Darktrace, which is thought to be preparing to IPO</p>\n\n<p>Sky News: Goldman snubs £2bn Darktrace float amid Lynch extradition battle</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/investing/comments/kpunlk/darktrace_an_upcoming_ipo_shadowed_by_the_10/",
  "subreddit": "investing",
  "id": "kpunlk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100747520
}