{
  "author": "YH-ITS-KESH",
  "the_new_excerpt": "The british accent, easy to understand, objective info and clear presentation.\nThis guy's got a noobazoid clued up so if you're a noobazoid like me and you\nhaven't already subscribed i highly recommend it! Thanks to the guys who\nrecommended him to me. Love this community for real\n\n(Not affiliated,…",
  "original_created_utc": 1619906389,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イギリス訛りで、わかりやすく、客観的な情報と明確なプレゼンテーション。\nこの人はnoobazoidにも情報を提供してくれるので、もしあなたが私のようなnoobazoidで、まだ購読していないのであれば\nまだ登録していない方は、ぜひ登録をお勧めします。彼を推薦してくれた方々に感謝します。\n彼を推薦してくれた皆さんに感謝します。このコミュニティは本当に大好きです\n\n(アフィリエイトではありません。",
      "title": "YoutubeのCoin Bureauは、特に初心者向けの質の高いCryptoコンテンツを提供しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "英国口音，易于理解，信息客观，表述清晰。\n这家伙把一个无名小卒搞得头头是道，所以如果你是一个像我一样的无名小卒，而且你\n还没有订阅，我强烈建议你去订阅! 感谢那些\n向我推荐他。爱上这个社区是真的\n\n(不隶属，...",
      "title": "Youtube上的Coin Bureau有高质量的加密货币内容，特别是针对新手的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "英國口音，易於理解，信息客觀，表述清晰。\n這傢伙把一個無名小卒搞得頭頭是道，所以如果你是一個像我一樣的無名小卒，而且你\n還沒有訂閱，我強烈建議你去訂閱! 感謝那些\n向我推薦他。愛上這個社區是真的\n\n(不隸屬，...",
      "title": "Youtube上的Coin Bureau有高質量的加密貨幣內容，特別是針對新手的。"
    }
  ],
  "title": "Coin Bureau on Youtube has quality Crypto content especially for newbies",
  "created_utc": 1619945112,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The british accent, easy to understand, objective info and clear presentation. This guy&#39;s got a noobazoid clued up so if you&#39;re a noobazoid like me and you haven&#39;t already subscribed i highly recommend it! Thanks to the guys who recommended him to me. Love this community for real</p>\n\n<p>(Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated, Not affiliated)</p>\n</div><!-- SC_ON -->",
  "score": 278,
  "permalink": "/r/CryptoCurrency/comments/n2skn9/coin_bureau_on_youtube_has_quality_crypto_content/",
  "subreddit": "CryptoCurrency",
  "id": "n2skn9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962688
}