{
  "author": "heresmyshitdiary",
  "original_created_utc": 1651116748,
  "title": "Does men still find women hot if they have no boobs at all?",
  "created_utc": 1651128833,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes I know not all men work the same but in the general sense is it a deal breaker for you if a girl has no boobs? Like actually no boobs. We&amp;#39;re talking smaller than A cup.\nSorry. I&amp;#39;m just feeling really insecure about my body (I&amp;#39;m 22) and I&amp;#39;m scared that no men is going to ever find me attractive because of my shitty titties.&lt;/p&gt;\n\n&lt;p&gt;Edit: I love how positive this responses are. Thank you from the bottom of my heart. I even feel kind of dumb for asking such a question.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/udlql3/does_men_still_find_women_hot_if_they_have_no/",
  "subreddit": "NoStupidQuestions",
  "id": "udlql3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Yes I know not all men work the same but in the general sense is it a deal\nbreaker for you if a girl has no boobs? Like actually no boobs. We're talking\nsmaller than A cup. Sorry. I'm just feeling really insecure about my body (I'm\n22) and I'm scared that no men is going to ever find me attractive…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべての男性が同じように働くわけではないことは承知していますが、一般的な感覚では、それは取引なのでしょうか？\nおっぱいがない女の子は、あなたにとって破格の存在ですか？実際におっぱいがないような。私たちが話しているのは\nAカップより小さい すみません。ただ、自分の体についてすごく不安で(私は\n22歳）、男性が私に魅力を感じないのではと恐れています...。",
      "title": "男性は、おっぱいが全くない女性でもセクシーだと感じるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我知道不是所有的男人都是这样工作的，但在一般意义上，如果一个女孩没有胸部，这是否是一个交易\n如果一个女孩没有胸部，这对你来说是一个破坏因素吗？比如说实际上没有胸部。我们在谈论\n小于A杯。对不起。我只是对我的身体感到非常不安全（我是\n22岁），我很害怕没有男人会觉得我有吸引力...",
      "title": "如果女人根本没有胸部，男人还会觉得她们很性感吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我知道不是所有的男人都是這樣工作的，但在一般意義上，如果一個女孩沒有胸部，這是否是一個交易\n如果一個女孩沒有胸部，這對你來說是一個破壞因素嗎？比如說實際上沒有胸部。我們在談論\n小於A杯。對不起。我只是對我的身體感到非常不安全（我是\n22歲），我很害怕沒有男人會覺得我有吸引力...",
      "title": "如果女人根本沒有胸部，男人還會覺得她們很性感嗎？"
    }
  ]
}