{
  "author": "Drudgel",
  "the_new_excerpt": "Veterans of the space are familiar with how it can go: a family member or close\nfriend comes to you for help buying crypto during a bull market. They know\nyou've been talking about crypto for some time and trust your judgement now that\nthey see the gains. You get them all set up after explaining the…",
  "original_created_utc": 1616154409,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "空间的老手们都很熟悉它的走向：家人或亲近的\n朋友在牛市期间来找你帮忙买加密货币。他们知道\n你谈论加密技术已经有一段时间了，相信你的判断，现在\n他们看到的收益。你把他们都安排好后，解释一下... ...",
      "title": "不要向你的朋友和家人超前宣传加密技术。我们都想与我们的亲人分享这场革命，但任何数量的潜在利润都不值得破坏关系。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "空間的老手們都很熟悉它的走向：家人或親近的\n朋友在牛市期間來找你幫忙買加密貨幣。他們知道\n你談論加密技術已經有一段時間了，相信你的判斷，現在\n他們看到的收益。你把他們都安排好後，解釋一下... ...",
      "title": "不要向你的朋友和家人超前宣傳加密技術。我們都想與我們的親人分享這場革命，但任何數量的潛在利潤都不值得破壞關係。"
    }
  ],
  "title": "Don't oversell your friends and family on crypto. We all want to share this revolution with our loved ones, but no amount of potential profit is worth damaging relationships.",
  "created_utc": 1616168274,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Veterans of the space are familiar with how it can go: a family member or close friend comes to you for help buying crypto during a bull market. They know you&#39;ve been talking about crypto for some time and trust your judgement now that they see the gains. You get them all set up after explaining the risks. But when the bear market looms, and they&#39;re staring at uncomfortably large losses, they can feel some resentment toward you.</p>\n\n<p><em>Shill lightly</em>.</p>\n\n<p>Share your knowledge and opinions, but undersell on the possible gains. Oversell on the risks. My father-in-law approached me about BTC and ETH recently and I spent several hours discussing all the possible risks with him. I&#39;ll be happy to set him up with a DCA plan and hardware wallet if he still wants to invest after sleeping on it. We&#39;re all part of a global revolution, and we naturally want to share that with the most important people in our lives - but no amount of profit is worth potentially damaging relationships with loved ones.</p>\n</div><!-- SC_ON -->",
  "score": 716,
  "permalink": "/r/CryptoCurrency/comments/m8fg9q/dont_oversell_your_friends_and_family_on_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "m8fg9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815287
}