{
  "author": "Artificial8Wanderer",
  "original_created_utc": 1625217145,
  "title": "How do some posts get over 1K upvotes while other extremely useful once range between 50 and 200 upvotes?",
  "created_utc": 1625225433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The other day i was scrolling through the Top posts and for real though i have seen some totally random posts with 12 thousand upvotes that simply share a silly self story thats mildly humorous.</p>\n\n<p>On the other hand ive seen other excellent DD and Research posts that are full of comments but stay in an upvote range of double or triple digits.</p>\n\n<p>It really makes no sense to me. Dont get me wrong i lo e a good laugh and i will upvote if something made me laugh but sometimes im really confused.</p>\n\n<p>Are bots involved or how does this happen. The upvote difference between 50 and 12 thousand is pretty large and considering we have millions of members its pretty bizzare to me.</p>\n</div><!-- SC_ON -->",
  "score": 274,
  "permalink": "/r/CryptoCurrency/comments/oc6dx3/how_do_some_posts_get_over_1k_upvotes_while_other/",
  "subreddit": "CryptoCurrency",
  "id": "oc6dx3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The other day i was scrolling through the Top posts and for real though i have\nseen some totally random posts with 12 thousand upvotes that simply share a\nsilly self story thats mildly humorous.\n\nOn the other hand ive seen other excellent DD and Research posts that are full\nof comments but stay in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、トップ記事をスクロールしていたところ、実際には、12,000のupvoteがついた全くランダムな記事を見ました。\n12,000のアップヴォートがついた全くのランダムな投稿を見ました。\nくだらない自分の話をしているだけで、ほのぼのとしています。\n\nその一方で、DDや研究のための素晴らしい投稿も見ましたが、それらはコメントで溢れていました。\nその一方で、素晴らしいDDや研究記事を目にしました。",
      "title": "1,000以上のアップヴォートを獲得する投稿がある一方で、50から200のアップヴォートしかないような非常に有益な投稿があるのはなぜでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，我在滚动浏览热门帖子，虽然我真的看到了一些完全随机的帖子，有1.2万的支持率，但这些帖子只是简单地分享一下。\n看到一些完全随机的帖子，有1.2万的支持率，只是分享一个\n愚蠢的自我故事，略带幽默感。\n\n另一方面，我也看到了其他优秀的DD和研究帖子，它们充满了评论。\n的评论，但却停留在...",
      "title": "为什么有些帖子能获得超过1K的支持率，而其他极其有用的一次支持率在50到200之间？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，我在滾動瀏覽熱門帖子，雖然我真的看到了一些完全隨機的帖子，有1.2萬的支持率，但這些帖子只是簡單地分享一下。\n看到一些完全隨機的帖子，有1.2萬的支持率，只是分享一個\n愚蠢的自我故事，略帶幽默感。\n\n另一方面，我也看到了其他優秀的DD和研究帖子，它們充滿了評論。\n的評論，但卻停留在...",
      "title": "爲什麼有些帖子能獲得超過1K的支持率，而其他極其有用的一次支持率在50到200之間？"
    }
  ]
}