{
  "author": "Killertimme",
  "original_created_utc": 1625916955,
  "title": "The scariest part of crypto is actually transferring it",
  "created_utc": 1625924304,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I believe everyone of us has transferred their crypto at one point. Be it from an exchange to a wallet or from one exchange to another.</p>\n\n<p>and I think we can all agree on it being pretty terrifying...</p>\n\n<p>and that a problem. I believe this hinders mainstream adoption especially for non tech savy people. You have no security if you send your funds to the void. You can send test transactions but this makes you lose money of course.</p>\n\n<p>What are projects and aim to solve this issue and how do you see this playing a role in the future. </p>\n\n<p>I dont want to have to check my 40 character each time while suffering a light heart attack.</p>\n</div><!-- SC_ON -->",
  "score": 387,
  "permalink": "/r/CryptoCurrency/comments/ohh3m0/the_scariest_part_of_crypto_is_actually/",
  "subreddit": "CryptoCurrency",
  "id": "ohh3m0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I believe everyone of us has transferred their crypto at one point. Be it from\nan exchange to a wallet or from one exchange to another.\n\nand I think we can all agree on it being pretty terrifying...\n\nand that a problem. I believe this hinders mainstream adoption especially for\nnon tech savy people.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが一度は自分の暗号を移したことがあると思います。それが\n取引所からウォレットへ、あるいは取引所から別の取引所へ。\n\nそして、それがとても恐ろしいものであることに、誰もが同意できると思います。\n\nそれが問題なのです。これが、特に以下のような主流の採用を妨げていると思います。\n普及を妨げていると思います。....",
      "title": "暗号の一番怖いところは、実際に送金すること"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信我们每个人都曾经转移过他们的加密货币。无论是从\n交易所到钱包或从一个交易所到另一个。\n\n我想我们都同意，这是很可怕的......。\n\n而这是一个问题。我相信这阻碍了主流的采用，特别是对于\n不懂技术的人....",
      "title": "加密货币最可怕的部分是实际转移它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信我們每個人都曾經轉移過他們的加密貨幣。無論是從\n交易所到錢包或從一個交易所到另一個。\n\n我想我們都同意，這是很可怕的......。\n\n而這是一個問題。我相信這阻礙了主流的採用，特別是對於\n不懂技術的人....",
      "title": "加密貨幣最可怕的部分是實際轉移它"
    }
  ]
}