{
  "author": "DisastrousClerk9618",
  "original_created_utc": 1637180670,
  "title": "Crypto might be one of the few remaining ways for millennials/GenZ to escape shitty working conditions and enjoy financial freedom",
  "created_utc": 1637196119,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The way I see it, retirement funds are a joke in most countries, increasing inflation paired with increasing costs of living(rent, food, transport etc.) will wreck our cozy idea of working 40 years and &quot;enjoying the rest&quot;. </p>\n\n<p>Of course, the blockchain technology, smart contracts,  decentralised finance etc. are fascinating and hopefully the future, but if anything buying crypto now, represents hope to me. Hope that I bought the right token and that one day I won&#39;t have to carry myself to an underpaid job, that let&#39;s me hustle to provide shelter and basic necessities. \nIf it isn&#39;t great technology, it is a lottery ticket that might set us free one day. </p>\n\n<p>And to everyone saying you should only invest what you can afford to miss, I&#39;m like 90% invested in Crypto. No regrets! </p>\n\n<p>Thanks for hearing me out</p>\n\n<p>Edit: it&#39;s nice to see that I&#39;m not the only one thinking this way or similar. Thank you all for your input to the discussion and holy smokes... thanks for the awards!</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qw845n/crypto_might_be_one_of_the_few_remaining_ways_for/",
  "subreddit": "CryptoCurrency",
  "id": "qw845n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The way I see it, retirement funds are a joke in most countries, increasing\ninflation paired with increasing costs of living(rent, food, transport etc.)\nwill wreck our cozy idea of working 40 years and \"enjoying the rest\".\n\nOf course, the blockchain technology, smart contracts, decentralised…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の考えでは、ほとんどの国では退職金は冗談のようなもので、インフレの進行と生活費の増加で\nインフレの進行と生活費の増加（家賃、食費、交通費など）によって\nインフレの進行と生活費（家賃、食費、交通費など）の増加により、40年働いて残りを楽しむという居心地の良い考えは崩壊するでしょう。\n\nもちろん、ブロックチェーン技術、スマートコントラクト、非中央集権的な...",
      "title": "暗号は、ミレニアル世代やGENZ世代が過酷な労働環境から逃れて経済的自由を享受するための、残された数少ない方法のひとつかもしれない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我看来，退休基金在大多数国家都是一个笑话，不断增长的通货膨胀加上不断增加的生活费用。\n通货膨胀与生活成本的增加（租金、食品、交通等）相伴而生。\n将破坏我们工作40年并 \"享受其余部分 \"的舒适想法。\n\n当然，区块链技术、智能合约、去中心化的...",
      "title": "加密货币可能是千禧一代/千禧一代逃离糟糕的工作环境并享受财务自由的少数剩余方式之一"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我看來，退休基金在大多數國家都是一個笑話，不斷增長的通貨膨脹加上不斷增加的生活費用。\n通貨膨脹與生活成本的增加（租金、食品、交通等）相伴而生。\n將破壞我們工作40年並 \"享受其餘部分 \"的舒適想法。\n\n當然，區塊鏈技術、智能合約、去中心化的...",
      "title": "加密貨幣可能是千禧一代/千禧一代逃離糟糕的工作環境並享受財務自由的少數剩餘方式之一"
    }
  ]
}