{
  "author": "Otocolobus_manul8",
  "original_created_utc": 1645876637,
  "title": "Why did so many prominent British soldiers and imperialists in the 19th and 20th century not marry?",
  "created_utc": 1645909025,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;General Charles Gordon, Lord Kitchener, Sir Colin Campbell, Cecil Rhodes and T.E. Lawrence were all men who were seemingly celibate. Many on this list were rumoured to be homosexuals but while this speculation exists is there any particular reason why there was a noticeable amount of men who seemingly did not marry?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/t1vgml/why_did_so_many_prominent_british_soldiers_and/",
  "subreddit": "AskHistorians",
  "id": "t1vgml",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "General Charles Gordon, Lord Kitchener, Sir Colin Campbell, Cecil Rhodes and\nT.E. Lawrence were all men who were seemingly celibate. Many on this list were\nrumoured to be homosexuals but while this speculation exists is there any\nparticular reason why there was a noticeable amount of men who…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "チャールズ・ゴードン将軍、キッチナー卿、コリン・キャンベル卿、セシル・ローズ、そして\nT.E.ローレンスは、一見独身に見える人たちばかりである。このリストの多くは\nホモセクシャルと噂されていますが、そのような憶測はありますが、何かあるのでしょうか？\nなぜ、そのような人が多いのか。",
      "title": "19世紀から20世紀にかけて、なぜ多くの著名な英国軍人や帝国主義者が結婚しなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "查尔斯-戈登将军、基钦纳勋爵、科林-坎贝尔爵士、塞西尔-罗德斯和\nT.E. Lawrence都是看似独身的人。这份名单上的许多人都被传为\n但在这种猜测存在的同时，是否有任何特别的原因，为什么会有明显的独身者？\n有什么特别的原因，为什么有相当数量的男人......",
      "title": "为什么19世纪和20世纪有那么多杰出的英国士兵和帝国主义者没有结婚？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "查爾斯-戈登將軍、基欽納勳爵、科林-坎貝爾爵士、塞西爾-羅德斯和\nT.E. Lawrence都是看似獨身的人。這份名單上的許多人都被傳爲\n但在這種猜測存在的同時，是否有任何特別的原因，爲什麼會有明顯的獨身者？\n有什麼特別的原因，爲什麼有相當數量的男人......",
      "title": "爲什麼19世紀和20世紀有那麼多傑出的英國士兵和帝國主義者沒有結婚？"
    }
  ]
}