{
  "author": "TheRealJNXD",
  "original_created_utc": 1629318559,
  "title": "Who else feels like whatever happens in the market right now, they don't have enough of crypto stacked?",
  "created_utc": 1629335123,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>During all my time in crypto, I have this feeling that I should be spending and projecting more of my daily money to cryptocurrencies. This is because we see these big booms, where we make gains of like 200% or more. In the long run, this rewards HODL:ers really well and all in all people who have patience to stay in the market. </p>\n\n<p>I have this feeling of just kind of missing out if I don&#39;t accumulate more, because we are still early in this space. Things are volatile, and we all are chasing big gains. Partly it is also FOMO, but I just want to know that at least I gave my best to my generation&#39;s opportunity of a lifetime.</p>\n\n<p>Not financial advice, rant over.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/p6zitu/who_else_feels_like_whatever_happens_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "p6zitu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "During all my time in crypto, I have this feeling that I should be spending and\nprojecting more of my daily money to cryptocurrencies. This is because we see\nthese big booms, where we make gains of like 200% or more. In the long run, this\nrewards HODL:ers really well and all in all people who have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これまで暗号に関わってきた中で、日々のお金をもっと暗号に費やすべきだと感じていました。\n日々のお金をもっと暗号通貨に投じるべきだと感じています。というのも、私たちは\n200％以上の利益を上げるような大ブームが起こるからです。長い目で見れば、これは\nHODL:ERの報酬は非常に高く、すべての人が...",
      "title": "今の市場で何が起こっても、暗号の積み重ねが足りないと感じている人は他にいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我从事加密货币的所有时间里，我有这样的感觉，我应该把我的日常开支和\n将我每天的钱更多地投向加密货币。这是因为我们看到\n这些大的繁荣，在那里我们取得了像200%或更多的收益。从长远来看，这\n奖励HODL:的人真的很好，而且总的来说，人们有...",
      "title": "还有谁觉得无论现在市场上发生什么，他们都没有足够的加密货币堆积？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我從事加密貨幣的所有時間裏，我有這樣的感覺，我應該把我的日常開支和\n將我每天的錢更多地投向加密貨幣。這是因爲我們看到\n這些大的繁榮，在那裏我們取得了像200%或更多的收益。從長遠來看，這\n獎勵HODL:的人真的很好，而且總的來說，人們有...",
      "title": "還有誰覺得無論現在市場上發生什麼，他們都沒有足夠的加密貨幣堆積？"
    }
  ]
}