{
  "author": "Throwing9900",
  "original_created_utc": 1660581256,
  "title": "I'm going to be homeless in WA, State soon. I never have been homeless before. what resources should I be aware of?",
  "created_utc": 1660600635,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Due to an unfortunate life and bad choices, I&amp;#39;m currently homeless at 29. Couch surfing.. I have no savings, no income currently, and now no car either. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t do drugs if that matters for resources Available. Do you guys know of any resources in WA that may be able to help me get back on my feet? &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a veteran if that matters. I&amp;#39;ve been googling but I&amp;#39;m so stressed and crushed by my situation I&amp;#39;m having a hard time understanding what I&amp;#39;m supposed to do in this situation. &lt;/p&gt;\n\n&lt;p&gt;Sorry if this is the wrong subreddit for this post. If it is where would be a better place to post this?&lt;/p&gt;\n\n&lt;p&gt;Thanks in advance, I&amp;#39;ll reply when I&amp;#39;m able to.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/wp44lc/im_going_to_be_homeless_in_wa_state_soon_i_never/",
  "subreddit": "NoStupidQuestions",
  "id": "wp44lc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Due to an unfortunate life and bad choices, I'm currently homeless at 29. Couch\nsurfing.. I have no savings, no income currently, and now no car either.\n\nI don't do drugs if that matters for resources Available. Do you guys know of\nany resources in WA that may be able to help me get back on my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "不遇な人生と選択ミスで、現在29歳でホームレスです。カウチ\nをサーフィンしています。貯金も収入もなく、今は車もありません。\n\n私は、それが利用可能なリソースのために重要であれば、ドラッグをしないでください。皆さんは、WA州で\nWA州には、私が元に戻るのを助けることができるかもしれない任意のリソースがあります...",
      "title": "もうすぐWA, Stateでホームレスになるんだ。今までホームレスになったことがないのですが、どのような情報源を知っておくべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于不幸的生活和错误的选择，我目前29岁时无家可归。在沙发上\n冲浪... 我没有存款，目前没有收入，现在也没有车。\n\n我不吸毒，如果这对资源有影响的话。你们是否知道\n在西澳有什么资源可以帮助我回到我的...",
      "title": "我很快就要在华盛顿州无家可归了。我以前从未无家可归过。我应该注意哪些资源？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於不幸的生活和錯誤的選擇，我目前29歲時無家可歸。在沙發上\n衝浪... 我沒有存款，目前沒有收入，現在也沒有車。\n\n我不吸毒，如果這對資源有影響的話。你們是否知道\n在西澳有什麼資源可以幫助我回到我的...",
      "title": "我很快就要在華盛頓州無家可歸了。我以前從未無家可歸過。我應該注意哪些資源？"
    }
  ]
}