{
  "author": "Gilgameshbrah",
  "the_new_excerpt": "It's so funny to me it's almost not funny anymore. I read another post about the\ncomputers crashing and people not beeing able to withdraw money. Is this\nnewsworthy? I'd say so. At least if you want to be consistent.\n\nBitcoin dips and all the piranhas smell blood in the water and write…",
  "original_created_utc": 1621685395,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう笑えないくらい面白いですよね。コンピューターがクラッシュして\nコンピューターがクラッシュして、お金を引き出せない人がいるという記事を読みました。これは\nニュースになりますか？私はそう思います。少なくとも、一貫性を持たせたいのであれば。\n\nビットコインが下落すると、ピラニアは水の中の血を嗅ぎ分けて...",
      "title": "米州銀行のコンピュータが世界中でクラッシュしても誰も気にしない。ビットコインが下落すると、すべての報道機関が新たにそれを引き裂こうとします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这对我来说太有趣了，几乎不再有趣了。我读了另一个帖子，关于\n电脑崩溃，人们无法提款。这是否\n有新闻价值吗？我说是的。至少如果你想保持一致的话。\n\n比特币下跌，所有的食人鱼都闻到了水中的血腥味，并写...",
      "title": "美国银行的电脑在全球范围内崩溃，无人问津。比特币下跌，所有的新闻机构都准备好了要给它一个新的说法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這對我來說太有趣了，幾乎不再有趣了。我讀了另一個帖子，關於\n電腦崩潰，人們無法提款。這是否\n有新聞價值嗎？我說是的。至少如果你想保持一致的話。\n\n比特幣下跌，所有的食人魚都聞到了水中的血腥味，並寫...",
      "title": "美國銀行的電腦在全球範圍內崩潰，無人問津。比特幣下跌，所有的新聞機構都準備好了要給它一個新的說法。"
    }
  ],
  "title": "Bank of Americas computers crash worldwide and nobody cares. Bitcoin dips and all news outlets are ready to tare it a new one.",
  "created_utc": 1621704975,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s so funny to me it&#39;s almost not funny anymore. I read another post about the computers crashing and people not beeing able to withdraw money. Is this newsworthy? I&#39;d say so. At least if you want to be consistent.</p>\n\n<p>Bitcoin dips and all the piranhas smell blood in the water and write articles about bubbles like some kind of kindergartener, but when a banks worldwide network crashes it gets mentioned in passing, like it&#39;s insignificant and nobody cares.</p>\n\n<p>At least be consistent and represent this crash like a world ending event that will ripple through time, like you always do with crypto market dips.</p>\n</div><!-- SC_ON -->",
  "score": 978,
  "permalink": "/r/CryptoCurrency/comments/nih94l/bank_of_americas_computers_crash_worldwide_and/",
  "subreddit": "CryptoCurrency",
  "id": "nih94l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383354
}