{
  "author": "koname32",
  "the_new_excerpt": "As we are about to enter a new week will hopefully less red day and more green\nday. Just wondering what you have bought with the dip or sold, hopefully not. I\nadded more DIS, CRSR, and OPEN; and got into NIO and PINS. I had been wanting to\nadd NIO for a while to get some EV plays and was waiting for…",
  "original_created_utc": 1615158794,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "由于即将进入新的一周，将希望少一些红日，多一些绿日。\n天。只是想知道你用跌停板买了什么或者卖了什么，希望不要。I\n增加了更多的DIS、CRSR和OPEN；并进入了NIO和PINS。我一直想\n添加NIO一段时间，以获得一些EV的发挥，并在等待... ...",
      "title": "跌停期间有什么好的买点吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於即將進入新的一週，將希望少一些紅日，多一些綠日。\n天。只是想知道你用跌停板買了什麼或者賣了什麼，希望不要。I\n增加了更多的DIS、CRSR和OPEN；並進入了NIO和PINS。我一直想\n添加NIO一段時間，以獲得一些EV的發揮，並在等待... ...",
      "title": "跌停期間有什麼好的買點嗎？"
    }
  ],
  "title": "Any great buys during the dip?",
  "created_utc": 1615168639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As we are about to enter a new week will hopefully less red day and more green day. Just wondering what you have bought with the dip or sold, hopefully not. I added more DIS, CRSR, and OPEN; and got into NIO and PINS. I had been wanting to add NIO for a while to get some EV plays and was waiting for the right moment. I know the journey ahead will be long and volatile, but I plan on hold for 5-7 years. Added CRSR because I use their products and am a big fan, also have been seeing them mentioned a lot. </p>\n\n<p>DIS is doing great and has a bright future ahead because of Disney+. As Disney+ becomes more available internationally it will be a huge rival to Netflix. They also have great originals. </p>\n\n<p>I was looking into LMND but I don’t have that strong of a conviction on them, and most comments I have seen on Reddit have been against. I might add CRWD if more red days happen.</p>\n\n<p>So what stocks did you buy and why? Are there any your eyeing? Let’s discuss</p>\n</div><!-- SC_ON -->",
  "score": 240,
  "permalink": "/r/stocks/comments/m026si/any_great_buys_during_the_dip/",
  "subreddit": "stocks",
  "id": "m026si",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576983
}