{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "# Spooky part\n\nSpooky season - spooky trades? Let’s talk about investing in **Triterras Inc.**\n\nWhat can scare a normal investor:\n\n* The company is labeled as **fraud** (by a short report, covered later in this DD)\n   * As a result, the company started an **independent internal investigation**, which is ongoing.\n* The company **failed to file an annual SEC report** for FY2020\n   * The report is being held under review of an **external audit**\n   * As a result, the company is hanging on a thread of **delisting** from NASDAQ\n* Please take a look at their one-year chart for a maximum **scare.**\n\nNot scared enough? It’s a **controlled offshore SPAC**, with a murky ownership structure centered around the founder/CEO and his buddies.\n\nDo I think you should short it - under normal circumstances - yes... But in this case, it might get you on a trip to the land of pain and suffering.\n\nI think **$TRIT is a powder keg** ready to blow in the face of anyone who wants to touch it.\n\nP.S. Nothing in this post is a piece of financial advice or anything that you should take seriously. Do your own research, size your own risks.\n\n# The Company\n\nSo what's it all about?\n\nThe company was founded by [Srinivas Koneru](https://www.linkedin.com/in/konerusrinivas/?originalSubdomain=sg) who by the time had a background in commodities trading. The guy noticed a niche to optimize the processes in international trade and make some $ in the process.\n\nThe company’s main product is [Kratos ](https://triterras.com/kratos)\\- essentially a marketplace for international commodity trading. Think of Amazon or Alibaba marketplace, but instead of retail consumers and merchants you have commodity traders and producers on both sides of the deal, and instead of merchandize you have iron ore and scrap metals.\n\nThey cater to underserved communities of SME commodity traders across the globe. This niche was estimated to be 1.5T dollars/year pre-pandemic. I think now you can double or triple this estimate.\n\nThey handle all aspects of the trade - discovery, compliance, due diligence, financing, logistics, shipping, etc. It’s done based on Ethereum smart contracts which is the ultimate way to ensure immutability and trust.\n\nSo what they are doing is quite amazing - they are essentially carving out the niche for themselves.\n\nThey don’t have direct competition, as there is nothing else on the market that allows handling all aspects of commodity trades in a single paperless system for smaller traders.\n\nFor the most part, the commodity trade business process is paper and labor-intensive to the point where it becomes prohibitive for SMEs, in addition, banks are not eager to engage with SMEs trade financing, which opens up a large opportunity for smart money to engage in commodity trades by financing traders on Kratos in real-time.\n\nKratos itself gets a cut on each such trade. I believe their commission stands at 0.3% of goods moved. They also get a cut on financing for trades if they match lender and borrower successfully.\n\n(Big banks ignore this niche due to [the Bazel Accord](https://www.investopedia.com/terms/b/basel_accord.asp) enacted as part of the response to a previous financial crisis that limits banks’ exposure to commodities. It essentially makes big banks cater only to large commodity trading companies)\n\n# Short report and rebuttal\n\nTo keep it brief: a suspicious newly formed hedge fund Phase 2 Partners, said it analyzed records and in the short report made the accusation that most of the transactions on Kratos are produced by Rhodium Resources, which is a commodity trader affiliated with the $TRIT CEO. This means that the company lied in their SEC statements and a lot of other unpleasant things. There are additional allegations around the SPAC combination and personal connections between SPAC and TRIT CEOs.\n\nIn response, the company rebutted the short-report claims citing coordinated price manipulation, and started 2 independent but related processes: audit of FY2021 financial statements and internal investigation into the short report. My understanding is that both are still ongoing.\n\nEver since the stock has not been itself, making lower lows after lower lows. And even the most devoted holders start to think about selling. The perfect storm begins.\n\nNaturally, this price action has triggered numerous shareholders’ lawsuits, which I believe are still pending.\n\nDuring the short report fallout, 2 board members have [resigned](https://www.gtreview.com/news/fintech/triterras-directors-quit-amid-row-over-related-party-claims/) citing disagreement with board decisions.\n\nOfficial [short report](https://phase2partners.egnyte.com/dl/bZMK5uwx27), but this is a [good summary.](https://www.gtreview.com/news/fintech/triterras-transactions-publicly-visible-on-blockchain/)\n\nOfficial company [response](https://ir.triterras.com/news-events/press-releases/detail/33/triterras-company-statement-in-response-to-short-report).\n\nCommencing of independent [investigation](https://ir.triterras.com/news-events/press-releases/detail/35/triterras-inc-announces-independent-investigation-by-the).\n\n# Delayed FY2020 report and audit\n\nOn June 28, 2021, the Company filed a Form 12b-25 informing the United States Securities and Exchange Commission that there will be a delay in filing its annual report on Form 20-F. The filing is available on Triterras website, Investor Section, under the SEC Filings section. The Company plans to file its 2021 Annual Report as soon as is practicable after the audit is completed by its independent registered accounting firm, Nexia.\n\nIt needs to be noted it took a while to assign Nexia as an independent auditor. KPMG (previous auditor) resigned with no explanation, but Kratos later cited conflict of interest in connection to Rhodium Resources. I believe KPMG audited both. All of it pushes the timeframes of submitting annual SEC statements (due on June 28, 2021).\n\nSo in addition to investigation and audit, the company has gotten itself into a troublesome relationship with SEC and NASDAQ, which has set the stage for a potential delisting. There really is no excuse for this type of major management misstep, and as a result, added to a HUGE pile of FUD and selling pressure the stock has seen ever since.\n\n[Delisting notice](https://ir.triterras.com/news-events/press-releases/detail/45/triterras-inc-receives-notification-from-nasdaq-related)\n\n[Compliance plan](https://ir.triterras.com/news-events/press-releases/detail/47/triterras-files-plan-with-nasdaq-related-to-delayed-annual)\n\n[Listing extension](https://ir.triterras.com/news-events/press-releases/detail/49/triterras-announces-listing-extension-granted-by-nasdaq)\n\n[Update on audit ](https://ir.triterras.com/news-events/press-releases/detail/51/triterras-provides-update-on-independent-audit-of-fiscal)\n\nOk, we established the company is hot water and management is probably lacking in some respects, If you feel like it - you can stop right here. And go back to DD on BRK.\n\n# Bright side\n\nIt’s not all doom and gloom from this point.\n\nI will try to describe what is known about the current state of the company’s financials, upcoming catalysts, and a variety of positive signals that were ignored by the market. Also, I will explain why, in my opinion, the company can ultimately regain compliance, leading share price to a swift recovery.\n\n# Fundamentals\n\nThere has been a great [DD](https://seekingalpha.com/article/4406419-trying-times-triterras-though-opportunity-to-disrupt-trade-finance-too-good-to-ignore) published on Seeking Alpha in February, after the short report. It’s behind a paywall so I won’t be able to rely on it too much. And have to retell part of the story here.\n\n# Business model\n\nBtw if you want to know a bit more about how blockchain is relevant to Triterras I direct you to an excellent summary by S&P: [Blockchain For Commodities Trading: Opportunities in a Digital Age ](https://www.spglobal.com/en/research-insights/featured/blockchain-for-commodities-trading-opportunities-in-a-digital-age) Anyway, let’s talk in a bit more detail about how they make money and look at this slide from their [investor presentation](https://www.sec.gov/Archives/edgar/data/1819876/000121390021002643/ea133543ex99-5_triterras.htm).\n\nThey charge trade participants twice (at least) - for trade discovery and for financing. So ideally they make 30-160bps (0.3-1.6%) per transaction traded on their platform.\n\nThe positive is that the cost of each additional transaction is nearly 0 for them; they don’t have any physical infrastructure like say Amazon or Alibaba, nor do they finance transactions themselves, so low overhead. The only thing they do - provide a software platform and support it.\n\nThe platform itself was likely developed by the CEO team while he was at Rhodium Resources (commodity trader) as an internal tool and he decided to spin it off as a separate business once the full potential was understood (correct me if I’m wrong). This would explain the low R&D spending the short report tried to highlight. Additionally, it may also explain the very high margin values. Anyway, from available screenshots, [the app](https://steemit.com/kratos/@bonanza-kreep/kratos-a-commodity-trading-platform-with-user-curated-funding) looks pretty polished and they just keep extending it with somewhat limited resources.\n\n# Growth\n\nGrowth in transaction volume directly converts into revenue growth. Following the short report, the company has reiterated [FY2021](https://ir.triterras.com/news-events/press-releases/detail/30/triterras-inc-reports-estimated-results-for-its-fiscal) guidance. While it’s not published yet (pending the audit) I do expect it to be met or exceeded. The company also had a bunch of initiatives to expand into new market sectors e.g. expand traders outreach and implement insurance & logistics modules to capitalize on more trades.\n\nThey planned to expand into the insurance business for their trades.\n\n# Financials\n\nThe company is **PROFITABLE**. Yes, unlike most of the SPACs flying high today. The company is making money. And pretty good money for an exponential-growth fintech startup. In the year leading to the SPAC merger deal, they made $0.15 per fully-diluted post-combination share.\n\n>Source: [https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037256/0001213900-20-037256.pdf](https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037256/0001213900-20-037256.pdf)  \n>  \n>(look for PRO FORMA CONDENSED COMBINED STATEMENT OF PROFIT OR LOSS AND OTHER COMPREHENSIVE INCOME)\n\nLook at their operating expenses and you would understand that growth in trade volume will result in significant growth in profitability. They are just printing money with not much effort. At the time of the business combination, the company had total assets of around $197M.\n\n>Source: [https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037256/0001213900-20-037256.pdf](https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037256/0001213900-20-037256.pdf)\n\nWhile the FY2021 report is still not available, the company did provide us with an [update ](https://d1io3yog0oux5.cloudfront.net/_a0a6a2f554170a38455a205727eeb84c/triterras/db/1089/9743/pdf/General+Update+_5.18.2021_Final_v2.pdf)on financial conditions in May. My understanding is it’s not been filed with the SEC, so take it with a grain of salt.\n\nThis report gives us their CASH position:\n\n>• As of May 1, 2021 the Company’s cash position was approximately $130 million, reflecting the generation of cash through operations and the cash utilized in the previously announced and now completed stock buyback program.  \n>  \n>• As of May 1, 2021 the Company has no long-term debt.\n\nThe market cap is $500M, $130M is just cash, also no debt means **dilution is highly unlikely**. The company just does not need your money.\n\nAlso, the company did a share buyback for $50M:\n\n>\\- On Jan 18, 2021, the Company announced a share repurchase program of up to US$50 million of the Company’s shares.  \n>  \n>\\- On Apr 20, 2021, the Company completed its share repurchase program initiated on Feb 12, 2021.  \n>  \n>Total purchases (US$) $49,866,509  \n>  \n>Total number of shares purchased 6,671,788  \n>  \n>Average share price purchased (US$) $7.47  \n>  \n>Total commission paid $133,436\n\nWhy would a fraudulent company that allegedly merged with an affiliated party execute a buyback? Also, note the average share price is $7.47. You are getting shares now much cheaper than the company is ready to buy itself back… Do you think they might want to spend some of it $130M on an extra buyback?\n\nAlso from the same document:\n\n>**Mergers and Acquisition Activity Strategic Partnership Focus**  \n>  \n>• On May 17, 2021 the company announced the successful execution of definitive documents relating to the Invoice Bazaar acquisition. This transaction informs the Company’s acquisition focus – to execute transactions that provide significant strategic synergies and/or provides tactical advantages and long-term earnings growth. As an example, the Invoice Bazaar transaction included an earn out provision. *To fully earn the earn out compensation of $ 4 million, Invoice Bazaar is required to generate revenues of $10 million over the next 2 years.*  \n>  \n>• The Company has a pipeline of acquisition candidates and continues to pursue its acquisition strategy. The Company has a strong cash position and over 6.6 million treasury shares to execute on these potential opportunities to increase shareholder value.  \n>  \n>• The Company has previously announced strategic partnerships with Marsh, Seven Oceans and Western Union to enhance its product and service offerings. In addition to M&A, the Company has a pipeline of potential strategic partnerships that will potentially increase the strength of its products and services.\n\nI *highlighted* another interesting detail that caught my eye.  They have longer-term performance metrics baked into the acquisition deals. Definitely does not look like an overnight fraud plan.\n\nThey also hired a new auditor. ([Triterras Appoints Nexia TS, Member Firm of Nexia International, as New Independent Auditor](https://www.globenewswire.com/en/news-release/2021/06/18/2249589/0/en/Triterras-Appoints-Nexia-TS-Member-Firm-of-Nexia-International-as-New-Independent-Auditor.html))\n\n# Price targets\n\nAfter the short report came out, most of the analysts pulled back their price targets. The only one who kept their target out is B. Riley and it stands at **$9.**  The [SA article](https://seekingalpha.com/article/4406419-trying-times-triterras-though-opportunity-to-disrupt-trade-finance-too-good-to-ignore) I mentioned above runs a pretty conservative post-short-report valuation estimate for a fintech startup based on their scalability and arrives at a fair value of **$12.5.**\n\n# Commodity market boom\n\nAs I mentioned earlier, an increase in Trade Volumes passed through the platform leads to a proportional significant increase in revenue and an exponential increase in profitability. How has the commodity market been doing recently? Since the short report or maybe since March/February when the shares (following short report) were traded at $7-$8 apiece?\n\nCan you spot a divergence between the shares of a fin-tech startup whose profitability directly depends on the price of commodities ($TRIT) and the actual commodity price index ($SPGSCI)?\n\n# App Store\n\nAn unlikely source of hopium came from Apple today. The SA article I mentioned a few times already features a screenshot on the amount of the number of reviews on the Kratos [mobile app](https://apps.apple.com/us/app/kratos-trade-finance-app/id1515877737). The current review count stands at 42, it was 21 in February when the SA article was published. These are supposedly platform traders, reviewing the app. And it makes me feel pretty good about platform growth.\n\nP.S. I think the mobile app is a gimmick for them. The main functionality of their platform is on the web. Check out this [older review](https://steemit.com/kratos/@bonanza-kreep/kratos-a-commodity-trading-platform-with-user-curated-funding) for some details.\n\n# New Hires\n\nOne of the best pieces of news for the company in the recent past are their new hires. Since the 2 board members left, the company has been on a spree of quality team additions.\n\n* [Triterras Hires Perry Mangers as Vice President of Financial Reporting](https://ir.triterras.com/news-events/press-releases/detail/50/triterras-hires-perry-mangers-as-vice-president-of)[LinkedIn ](https://www.linkedin.com/in/perry-mangers-cpa-0170922/)(long-term Jacobs executive)\n* [Triterras Bolsters Structured Finance Team with Key Appointments](https://ir.triterras.com/news-events/press-releases/detail/48/triterras-bolsters-structured-finance-team-with-key)Frank Barbarino, CAIA, will lead fund origination and structuring; Amoy Chambers joins as head of legal for structuring and distribution \n* [Frank Bombino](https://www.linkedin.com/in/barbarinofrank/) (former Goldman Sachs VP)\n* [Amoy Chambers](https://www.linkedin.com/in/amoy-chambers/) (former HSBC VP)\n* [Triterras Appoints Chief Technology Officer](https://ir.triterras.com/news-events/press-releases/detail/41/triterras-appoints-chief-technology-officer) ([LinkedIn](https://www.linkedin.com/in/srivasireddy/))\n* [Triterras Announces Senior Team Expansion](https://ir.triterras.com/news-events/press-releases/detail/39/triterras-announces-senior-team-expansion)\n\n>Peter Karos – Business Development, North America  \n>  \n>Mr. Karos joined Triterras in February 2021 as a consultant and is responsible for originating supplier and lending relationships in North America. He is based in Toronto and reports to Chief Operating Officer John Galani.  \n>  \n>Mr. Karos brings to Triterras more than 25 years of experience in financial markets as well as maritime and commodity trading industries. Since 2013, he has served as a special advisor to Bluewater Acquisition Corp (TSXV: BAQ.P), a Capital Pool Company that identifies, evaluates, and invests in assets or businesses in the maritime/shipping sector. Mr. Karos also serves as an independent consultant and investor for several assignments with private equity funds, hedge funds, and boutique investment banks.\n\nSo what I want to highlight:\n\n* First of all. The new CPA/Financial reporting head is a must, given their situation and increasing chances they will pass the audit and release FY2021 results in time. The guy looks solid to me and I hope he would not put his name on the line for a longer dime.\n* Former HSBC and Goldman VPs are not easy people to hire, they do their own DD on who hires them. They don’t like to look like fools (although the right salary and golden parachutes fix it).\n* I like “North America” and “Business Development” together. That screams “Money” to me.\n\n**Upcoming Catalysts**\n\nOk, maybe this boat won’t sink. Why should I invest now and not wait longer, maybe more discounts?\n\nWell I believe once their FY2021 report is filed and the audit is complete the price will either move (much) closer to $0 or back to at least $9-10. Based on the audit results.\n\n[Triterras Provides Update on Independent Audit of Fiscal 2021 Financials](https://ir.triterras.com/news-events/press-releases/detail/51/triterras-provides-update-on-independent-audit-of-fiscal)\n\n>While the Company believed that the Audit could be completed by September 30, 2021, additional time is needed for the Audit to be completed.  \n>  \n>Nasdaq granted the Company an extension to November 1, 2021 to regain compliance with Nasdaq Listing Rule 5250(c)(1) by filing its Annual Report on Form 20-F with the U.S. Securities and Exchange Commission. After discussions with the Company’s independent auditor, the Company anticipates that the Audit will be completed in time to allow for the finalization and filing of its Annual Report on Form 20-F by November 1, 2021.\n\nThere is an important consideration. November 1 is not a super-hard deadline. In theory, Nasdaq can extend it again into December. From previous extension filing:\n\n>If Nasdaq accepts the Company’s plan, then Nasdaq may grant the Company an exception of up to 180 calendar days from the due date of the 2021 Annual Report, **or until December 27, 2021,** to regain compliance. If Nasdaq does not accept the Company’s plan, then the Company would have the opportunity to appeal that decision to a Nasdaq hearings panel. The Notice has no immediate impact on the listing of the Company’s securities on Nasdaq.\n\nIt sure looks like we are on the final stretch of a long winter for this stock. And we have a few outcomes which I consider probable:\n\n* Half-decent audit and great financials. Everything is great.\n* Poor audit (the company is a fraud) and great financialsSome resignations, SEC investigations, and other potential fireworks. Price either tanks or stays in the range of $4.67-$6 depending on how bad things are.\n* The report is delayed further and the audit extends, no financial report is filed. Share price tanks locally, but there is a hard deadline of December 27 I mentioned earlier. So some resolution would come before that.\n\n# Float\n\nLet’s get to the interesting part.\n\nI would rather agree on a root canal treatment than calculate the float for a stock like this again. The data for float calculation was sourced from the SEC filings from Netfin (formerly SPAC) and Triterras Inc.\n\nFirst of all, The source data for total float is this [SEC filing](https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037183/0001213900-20-037183.pdf):\n\n[https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037183/0001213900-20-037183.pdf](https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037183/0001213900-20-037183.pdf)\n\n>**Share Capital**  \n>  \n>As of November 11, 2020, subsequent to the closing of the Business Combination, there were 83,195,869 Ordinary Shares outstanding and issued. There were also 25,981,000 Triterras Warrants outstanding, each exercisable at $11.50 per share, of which 25,300,000 were former Public Warrants and 681,000 were former Private Placement Warrants. The Business Combination Agreement provides that the Sellers will be entitled to receive an additional 15,000,000 Ordinary Shares upon the occurrence of certain Adjusted EBITDA thresholds, see “The Business Combination Agreement—Earnout Share Consideration and Adjusted EBITDA\\*” which is incorporated herein by reference.\n\n# Lockup agreement & insiders.\n\nThe lockup agreement existed before but expired and the insider shares are unlocked now.\n\n>**Lock-up Agreement**  \n>  \n>On the Closing Date, we entered into a lock-up agreement (the “Lock-Up Agreement”) with Netfin, MVR Netfin LLC, SSOL and IKON (SSOL and IKON together, the “Sellers”) pursuant to which the Sellers agreed to not transfer, sell, assign or otherwise dispose of our Ordinary Shares, including shares receivable upon exercise of Warrants, they received in the Business Combination prior to (i) three months after the Closing Date with respect to 10% of their Ordinary Shares and (ii) six months after the Closing Date with respect to the remaining 90% of their Ordinary Shares, subject to certain exceptions set forth therein. The foregoing description of the Lock-Up Agreement does not purport to be complete and is qualified in its entirety by reference to the full text of the Lock-Up Agreement, which is attached hereto as Exhibit 4.3 and is incorporated by reference herein.\n\nThe document also lists invaluable insiders ownership post-combination table.\n\nSee section MAJOR SHAREHOLDERS AND RELATED PARTY TRANSACTIONS\n\nThis is important. I'm going to refer to this section later.\n\nSo you can see that parties associated with **MVR Netfin** own a significant chunk of post-combination business. Interestingly enough none of them have sold as far as I can tell. It might be due to the share price having dropped before the lockup has expired for them. But they have not sold even eligible parts, since no filings on their behalf can be located. Free float can reasonably be decreased by the number of shares owned by these insiders. But I will caution you, it only works until the price is low. As bags get lighter, I can imagine these shares can end up on the market, the inflection point is probably $10/share. It’s a place where I would start getting cautious about these insiders.\n\n# Warrants\n\nAs you can see the company has issued a sizable amount of warrants, but they are exercisable at $11.5.  There are 25,300,000 outstanding public warrants and 681,000 private warrants. All are exercisable for $11.50 for one ordinary class A share and have an expiration of 12/10/2025. There are no current lock-ups on these warrants. $TRIT can redeem public warrants at any time for $0.01 provided the underlying price equals or exceeds $18 for 20 days out of a 30 day period. Private warrants are not redeemable. It looks like we should not worry about them until we reach $11.5.\n\n# Insider Bonus\n\n[F-4](https://ir.triterras.com/sec-filings/all-sec-filings?form_type=F-4&year=##document-2-0001213900-20-024301-2) also contains a description of an additional performance-based bonus for insiders based on stock performance and EBITDA targets:\n\n>**Earnout Share Consideration and Adjusted EBITDA\\***  \n>  \n>The Business Combination Agreement provides that the Sellers will be entitled to receive an additional 15,000,000 Holdco Ordinary Shares or “Earnout Share Consideration” after the closing of the Business Combination: (i) 5,000,000 Holdco Ordinary Shares on the earlier to occur of (a) the date on which Holdco’s audited financial statements for the fiscal year ending February 28, 2021 become available, if Holdco’s Adjusted EBITDA\\* calculated using such Holdco audited financial statements exceeds $35,838,245 or (b) the date on which the Holdco Ordinary Shares trade on the Nasdaq at a closing price greater than $13.00 for 20 trading days within any 30-day trading period during the one-year period immediately following the closing of the Business Combination; (ii) 5,000,000 Holdco Ordinary Shares on the earlier to occur of (a) the date on which Holdco’s audited financial statements for the fiscal year ending February 28, 2022 become available, if Holdco’s Adjusted EBITDA\\* calculated using such audited financial statements exceeds $75,901,142 or (b) the date on which the Holdco Ordinary Shares trade on the Nasdaq at a closing price greater than $15.00 for 20 trading days within any 30-day trading period during the two-year period immediately following the closing of the Business Combination; and (iii) 5,000,000 Holdco Ordinary Shares on the earlier to occur of (a) the date on which Holdco’s audited financial statements for the fiscal year ending February 28, 2023 become available, if Holdco’s Adjusted EBITDA\\* calculated using such audited financial statements exceeds $125,657,831 or (b) the date on which the Holdco Ordinary Shares trade on the Nasdaq at a closing price greater than $17.00 for 20 trading days within any 30-day trading period during the three-year period immediately following the closing of the Business Combination.\n\nWe should not worry about it until the stock hits $13USD or a good report with great EBITDA is published. Which would be a good problem to have.\n\n**13-Fs and institutional ownership**\n\nUsing the insider ownership table from this [SEC filing](https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037183/0001213900-20-037183.pdf), the fact that no SEC filings indicating insider selling have been filed on behalf of entities listed there and 13-Fs from [fintel](https://fintel.io/so/us/trit). I’m trying to build a profile of insiders and institutions with diamond hands.\n\nThere are a few reasons why I classify an institution as diamond hands:\n\n* It’s an investment bank or index fund\n* It’s a known long-term investment firm\n* They built a position recently after the short report\n* They did not sell a single share after the short report\n* They have hedged positions with options and are likely to hold through the thick and thin.\n\n[https://docs.google.com/spreadsheets/d/1Fk9Cr5xZviTP6wjx-Htnh1jmuXaBVtIkygMT4tyji8g/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1Fk9Cr5xZviTP6wjx-Htnh1jmuXaBVtIkygMT4tyji8g/edit?usp=sharing)\n\nPlease note, it’s not all institutional ownership, but only institutions/insiders who are likely to hold. So we reasonably can decrease the float by a sum of 69,257,790 shares. At this point the free float is  83,195,869 - 69,257,790 (diamond hands). Now, remember the company also bought back  6,671,788 shares (reported in May). Also 8,303,000 record for MVR includes 681,000 warrants. So I cannot really move out of the float So it brings us down to 83,195,869 - 69,257,790 -  6,671,788 + 681,000 =  **7,947,291** shares.\n\nIt is our free float by the DFV method.\n\n**Delta-hedging**\n\n$TRIT features significant [open interest](https://ibb.co/vHs02HR) on the call side going into November/December/January 2021. By my calculations market makers need to allocate around **2.2M** shares in delta-hedging based on the available data.\n\nI'm omitting calculations, but the size of interest can be easily checked here:\n\n[https://maximum-pain.com/options/TRIT](https://maximum-pain.com/options/TRIT)\n\nAssuming float is about **8M,** more than 25% of the float should be delta-hedged. If the price crosses $10, this number rises to 60%. [Illustration](https://ibb.co/dJK0BYd)\n\nThis can easily trigger a gamma-squeeze on a sudden upward price move.\n\n# Short Interest\n\nBased on [Ortex data](https://ibb.co/rFTLMyV), there are a few aspects of the short interest situation I would like to highlight.\n\n1. Total short interest stands at 2.41M shares, which represents more than 25% of free float by calculations above. A respectable number, but far from where it was a few months ago.\n2. The shorts have been covering very actively over the last few months. It’s both good because it’s a bullish sign in general and bad because it’s a missed opportunity.\n3. The fact shorts are actively covering also decreases the probability that the company is a total fraud.\n4. If you look at the data closely, you can notice how days to cover have jumped recently, while overall short interest is on the decline. The reason for it - the stock became extremely illiquid. Sometimes there are no trades for the full 25 minutes. And when there are some, it’s 100 shares changing hands. Check it for yourself. When I bought 200 shares the other day I raised the price by $0.02 lol. This indicates extreme stress the short may experience if the price goes up. There is no liquidity.\n5. FTDs % of daily volume sometimes shoots above 30-40%. Take a look here: [https://sec.report/fails.php?tc=TRIT](https://sec.report/fails.php?tc=TRIT)\n\nPaired with gamma ramp situation, and extremely low liquidity SI looks like a promising catalyst in case of a good news release next few days.\n\n# Positions\n\n2k shares @ $5.96\n\n100 x 7.5c November\n\n125 x 10c November\n\n50 x 7.5c December\n\n35 x 7.5 January 2021\n\n# Conclusion\n\nThe company operates on the intersection of 2 major trends in the global economy:\n\n* Improving supply chain reliability\n* Adopting cryptocurrencies in real-world applications.\n\nIn my opinion, $TRIT represents an asymmetrical risk/reward profile at this point. The stock has been beaten to oblivion and enters a phase of consolidation ahead of significant events. The risks remain and the company can go bankrupt if fraud allegations are confirmed but if it does not happen - it’s going to be a golden opportunity.\n\nThere are also distinct upcoming catalysts: filing FY2021 annual report, which I think has good numbers, ending the audit, and lifting a threat of delisting. This is all the company promises to accomplish **before November 1st.**\n\nLow free float, relatively high SI, and a lot of fireworks from a potential delta-hedging make the long-play very appealing. This situation is aggravated by how illiquid the stock is. No one really wants to trade it :)\n\nWhile I’m obviously bullish on the company, you can tell from my position. There might be some opportunity for interesting straddle option strategies or even short strategies if you find a short thesis more probable.",
  "author_fullname": "t2_3o1l0g2u",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 2,
  "clicked": false,
  "title": "Trick or $TRIT",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_qd1co2",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.98,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 146,
  "total_awards_received": 5,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 146,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1634876957,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_2": 2
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1634850119,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Spooky part</h1>\n\n<p>Spooky season - spooky trades? Let’s talk about investing in <strong>Triterras Inc.</strong></p>\n\n<p>What can scare a normal investor:</p>\n\n<ul>\n<li>The company is labeled as <strong>fraud</strong> (by a short report, covered later in this DD)\n\n<ul>\n<li>As a result, the company started an <strong>independent internal investigation</strong>, which is ongoing.</li>\n</ul></li>\n<li>The company <strong>failed to file an annual SEC report</strong> for FY2020\n\n<ul>\n<li>The report is being held under review of an <strong>external audit</strong></li>\n<li>As a result, the company is hanging on a thread of <strong>delisting</strong> from NASDAQ</li>\n</ul></li>\n<li>Please take a look at their one-year chart for a maximum <strong>scare.</strong></li>\n</ul>\n\n<p>Not scared enough? It’s a <strong>controlled offshore SPAC</strong>, with a murky ownership structure centered around the founder/CEO and his buddies.</p>\n\n<p>Do I think you should short it - under normal circumstances - yes... But in this case, it might get you on a trip to the land of pain and suffering.</p>\n\n<p>I think <strong>$TRIT is a powder keg</strong> ready to blow in the face of anyone who wants to touch it.</p>\n\n<p>P.S. Nothing in this post is a piece of financial advice or anything that you should take seriously. Do your own research, size your own risks.</p>\n\n<h1>The Company</h1>\n\n<p>So what&#39;s it all about?</p>\n\n<p>The company was founded by <a href=\"https://www.linkedin.com/in/konerusrinivas/?originalSubdomain=sg\">Srinivas Koneru</a> who by the time had a background in commodities trading. The guy noticed a niche to optimize the processes in international trade and make some $ in the process.</p>\n\n<p>The company’s main product is <a href=\"https://triterras.com/kratos\">Kratos </a>- essentially a marketplace for international commodity trading. Think of Amazon or Alibaba marketplace, but instead of retail consumers and merchants you have commodity traders and producers on both sides of the deal, and instead of merchandize you have iron ore and scrap metals.</p>\n\n<p>They cater to underserved communities of SME commodity traders across the globe. This niche was estimated to be 1.5T dollars/year pre-pandemic. I think now you can double or triple this estimate.</p>\n\n<p>They handle all aspects of the trade - discovery, compliance, due diligence, financing, logistics, shipping, etc. It’s done based on Ethereum smart contracts which is the ultimate way to ensure immutability and trust.</p>\n\n<p>So what they are doing is quite amazing - they are essentially carving out the niche for themselves.</p>\n\n<p>They don’t have direct competition, as there is nothing else on the market that allows handling all aspects of commodity trades in a single paperless system for smaller traders.</p>\n\n<p>For the most part, the commodity trade business process is paper and labor-intensive to the point where it becomes prohibitive for SMEs, in addition, banks are not eager to engage with SMEs trade financing, which opens up a large opportunity for smart money to engage in commodity trades by financing traders on Kratos in real-time.</p>\n\n<p>Kratos itself gets a cut on each such trade. I believe their commission stands at 0.3% of goods moved. They also get a cut on financing for trades if they match lender and borrower successfully.</p>\n\n<p>(Big banks ignore this niche due to <a href=\"https://www.investopedia.com/terms/b/basel_accord.asp\">the Bazel Accord</a> enacted as part of the response to a previous financial crisis that limits banks’ exposure to commodities. It essentially makes big banks cater only to large commodity trading companies)</p>\n\n<h1>Short report and rebuttal</h1>\n\n<p>To keep it brief: a suspicious newly formed hedge fund Phase 2 Partners, said it analyzed records and in the short report made the accusation that most of the transactions on Kratos are produced by Rhodium Resources, which is a commodity trader affiliated with the $TRIT CEO. This means that the company lied in their SEC statements and a lot of other unpleasant things. There are additional allegations around the SPAC combination and personal connections between SPAC and TRIT CEOs.</p>\n\n<p>In response, the company rebutted the short-report claims citing coordinated price manipulation, and started 2 independent but related processes: audit of FY2021 financial statements and internal investigation into the short report. My understanding is that both are still ongoing.</p>\n\n<p>Ever since the stock has not been itself, making lower lows after lower lows. And even the most devoted holders start to think about selling. The perfect storm begins.</p>\n\n<p>Naturally, this price action has triggered numerous shareholders’ lawsuits, which I believe are still pending.</p>\n\n<p>During the short report fallout, 2 board members have <a href=\"https://www.gtreview.com/news/fintech/triterras-directors-quit-amid-row-over-related-party-claims/\">resigned</a> citing disagreement with board decisions.</p>\n\n<p>Official <a href=\"https://phase2partners.egnyte.com/dl/bZMK5uwx27\">short report</a>, but this is a <a href=\"https://www.gtreview.com/news/fintech/triterras-transactions-publicly-visible-on-blockchain/\">good summary.</a></p>\n\n<p>Official company <a href=\"https://ir.triterras.com/news-events/press-releases/detail/33/triterras-company-statement-in-response-to-short-report\">response</a>.</p>\n\n<p>Commencing of independent <a href=\"https://ir.triterras.com/news-events/press-releases/detail/35/triterras-inc-announces-independent-investigation-by-the\">investigation</a>.</p>\n\n<h1>Delayed FY2020 report and audit</h1>\n\n<p>On June 28, 2021, the Company filed a Form 12b-25 informing the United States Securities and Exchange Commission that there will be a delay in filing its annual report on Form 20-F. The filing is available on Triterras website, Investor Section, under the SEC Filings section. The Company plans to file its 2021 Annual Report as soon as is practicable after the audit is completed by its independent registered accounting firm, Nexia.</p>\n\n<p>It needs to be noted it took a while to assign Nexia as an independent auditor. KPMG (previous auditor) resigned with no explanation, but Kratos later cited conflict of interest in connection to Rhodium Resources. I believe KPMG audited both. All of it pushes the timeframes of submitting annual SEC statements (due on June 28, 2021).</p>\n\n<p>So in addition to investigation and audit, the company has gotten itself into a troublesome relationship with SEC and NASDAQ, which has set the stage for a potential delisting. There really is no excuse for this type of major management misstep, and as a result, added to a HUGE pile of FUD and selling pressure the stock has seen ever since.</p>\n\n<p><a href=\"https://ir.triterras.com/news-events/press-releases/detail/45/triterras-inc-receives-notification-from-nasdaq-related\">Delisting notice</a></p>\n\n<p><a href=\"https://ir.triterras.com/news-events/press-releases/detail/47/triterras-files-plan-with-nasdaq-related-to-delayed-annual\">Compliance plan</a></p>\n\n<p><a href=\"https://ir.triterras.com/news-events/press-releases/detail/49/triterras-announces-listing-extension-granted-by-nasdaq\">Listing extension</a></p>\n\n<p><a href=\"https://ir.triterras.com/news-events/press-releases/detail/51/triterras-provides-update-on-independent-audit-of-fiscal\">Update on audit </a></p>\n\n<p>Ok, we established the company is hot water and management is probably lacking in some respects, If you feel like it - you can stop right here. And go back to DD on BRK.</p>\n\n<h1>Bright side</h1>\n\n<p>It’s not all doom and gloom from this point.</p>\n\n<p>I will try to describe what is known about the current state of the company’s financials, upcoming catalysts, and a variety of positive signals that were ignored by the market. Also, I will explain why, in my opinion, the company can ultimately regain compliance, leading share price to a swift recovery.</p>\n\n<h1>Fundamentals</h1>\n\n<p>There has been a great <a href=\"https://seekingalpha.com/article/4406419-trying-times-triterras-though-opportunity-to-disrupt-trade-finance-too-good-to-ignore\">DD</a> published on Seeking Alpha in February, after the short report. It’s behind a paywall so I won’t be able to rely on it too much. And have to retell part of the story here.</p>\n\n<h1>Business model</h1>\n\n<p>Btw if you want to know a bit more about how blockchain is relevant to Triterras I direct you to an excellent summary by S&amp;P: <a href=\"https://www.spglobal.com/en/research-insights/featured/blockchain-for-commodities-trading-opportunities-in-a-digital-age\">Blockchain For Commodities Trading: Opportunities in a Digital Age </a> Anyway, let’s talk in a bit more detail about how they make money and look at this slide from their <a href=\"https://www.sec.gov/Archives/edgar/data/1819876/000121390021002643/ea133543ex99-5_triterras.htm\">investor presentation</a>.</p>\n\n<p>They charge trade participants twice (at least) - for trade discovery and for financing. So ideally they make 30-160bps (0.3-1.6%) per transaction traded on their platform.</p>\n\n<p>The positive is that the cost of each additional transaction is nearly 0 for them; they don’t have any physical infrastructure like say Amazon or Alibaba, nor do they finance transactions themselves, so low overhead. The only thing they do - provide a software platform and support it.</p>\n\n<p>The platform itself was likely developed by the CEO team while he was at Rhodium Resources (commodity trader) as an internal tool and he decided to spin it off as a separate business once the full potential was understood (correct me if I’m wrong). This would explain the low R&amp;D spending the short report tried to highlight. Additionally, it may also explain the very high margin values. Anyway, from available screenshots, <a href=\"https://steemit.com/kratos/@bonanza-kreep/kratos-a-commodity-trading-platform-with-user-curated-funding\">the app</a> looks pretty polished and they just keep extending it with somewhat limited resources.</p>\n\n<h1>Growth</h1>\n\n<p>Growth in transaction volume directly converts into revenue growth. Following the short report, the company has reiterated <a href=\"https://ir.triterras.com/news-events/press-releases/detail/30/triterras-inc-reports-estimated-results-for-its-fiscal\">FY2021</a> guidance. While it’s not published yet (pending the audit) I do expect it to be met or exceeded. The company also had a bunch of initiatives to expand into new market sectors e.g. expand traders outreach and implement insurance &amp; logistics modules to capitalize on more trades.</p>\n\n<p>They planned to expand into the insurance business for their trades.</p>\n\n<h1>Financials</h1>\n\n<p>The company is <strong>PROFITABLE</strong>. Yes, unlike most of the SPACs flying high today. The company is making money. And pretty good money for an exponential-growth fintech startup. In the year leading to the SPAC merger deal, they made $0.15 per fully-diluted post-combination share.</p>\n\n<blockquote>\n<p>Source: <a href=\"https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037256/0001213900-20-037256.pdf\">https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037256/0001213900-20-037256.pdf</a>  </p>\n\n<p>(look for PRO FORMA CONDENSED COMBINED STATEMENT OF PROFIT OR LOSS AND OTHER COMPREHENSIVE INCOME)</p>\n</blockquote>\n\n<p>Look at their operating expenses and you would understand that growth in trade volume will result in significant growth in profitability. They are just printing money with not much effort. At the time of the business combination, the company had total assets of around $197M.</p>\n\n<blockquote>\n<p>Source: <a href=\"https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037256/0001213900-20-037256.pdf\">https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037256/0001213900-20-037256.pdf</a></p>\n</blockquote>\n\n<p>While the FY2021 report is still not available, the company did provide us with an <a href=\"https://d1io3yog0oux5.cloudfront.net/_a0a6a2f554170a38455a205727eeb84c/triterras/db/1089/9743/pdf/General+Update+_5.18.2021_Final_v2.pdf\">update </a>on financial conditions in May. My understanding is it’s not been filed with the SEC, so take it with a grain of salt.</p>\n\n<p>This report gives us their CASH position:</p>\n\n<blockquote>\n<p>• As of May 1, 2021 the Company’s cash position was approximately $130 million, reflecting the generation of cash through operations and the cash utilized in the previously announced and now completed stock buyback program.  </p>\n\n<p>• As of May 1, 2021 the Company has no long-term debt.</p>\n</blockquote>\n\n<p>The market cap is $500M, $130M is just cash, also no debt means <strong>dilution is highly unlikely</strong>. The company just does not need your money.</p>\n\n<p>Also, the company did a share buyback for $50M:</p>\n\n<blockquote>\n<p>- On Jan 18, 2021, the Company announced a share repurchase program of up to US$50 million of the Company’s shares.  </p>\n\n<p>- On Apr 20, 2021, the Company completed its share repurchase program initiated on Feb 12, 2021.  </p>\n\n<p>Total purchases (US$) $49,866,509  </p>\n\n<p>Total number of shares purchased 6,671,788  </p>\n\n<p>Average share price purchased (US$) $7.47  </p>\n\n<p>Total commission paid $133,436</p>\n</blockquote>\n\n<p>Why would a fraudulent company that allegedly merged with an affiliated party execute a buyback? Also, note the average share price is $7.47. You are getting shares now much cheaper than the company is ready to buy itself back… Do you think they might want to spend some of it $130M on an extra buyback?</p>\n\n<p>Also from the same document:</p>\n\n<blockquote>\n<p><strong>Mergers and Acquisition Activity Strategic Partnership Focus</strong>  </p>\n\n<p>• On May 17, 2021 the company announced the successful execution of definitive documents relating to the Invoice Bazaar acquisition. This transaction informs the Company’s acquisition focus – to execute transactions that provide significant strategic synergies and/or provides tactical advantages and long-term earnings growth. As an example, the Invoice Bazaar transaction included an earn out provision. <em>To fully earn the earn out compensation of $ 4 million, Invoice Bazaar is required to generate revenues of $10 million over the next 2 years.</em>  </p>\n\n<p>• The Company has a pipeline of acquisition candidates and continues to pursue its acquisition strategy. The Company has a strong cash position and over 6.6 million treasury shares to execute on these potential opportunities to increase shareholder value.  </p>\n\n<p>• The Company has previously announced strategic partnerships with Marsh, Seven Oceans and Western Union to enhance its product and service offerings. In addition to M&amp;A, the Company has a pipeline of potential strategic partnerships that will potentially increase the strength of its products and services.</p>\n</blockquote>\n\n<p>I <em>highlighted</em> another interesting detail that caught my eye.  They have longer-term performance metrics baked into the acquisition deals. Definitely does not look like an overnight fraud plan.</p>\n\n<p>They also hired a new auditor. (<a href=\"https://www.globenewswire.com/en/news-release/2021/06/18/2249589/0/en/Triterras-Appoints-Nexia-TS-Member-Firm-of-Nexia-International-as-New-Independent-Auditor.html\">Triterras Appoints Nexia TS, Member Firm of Nexia International, as New Independent Auditor</a>)</p>\n\n<h1>Price targets</h1>\n\n<p>After the short report came out, most of the analysts pulled back their price targets. The only one who kept their target out is B. Riley and it stands at <strong>$9.</strong>  The <a href=\"https://seekingalpha.com/article/4406419-trying-times-triterras-though-opportunity-to-disrupt-trade-finance-too-good-to-ignore\">SA article</a> I mentioned above runs a pretty conservative post-short-report valuation estimate for a fintech startup based on their scalability and arrives at a fair value of <strong>$12.5.</strong></p>\n\n<h1>Commodity market boom</h1>\n\n<p>As I mentioned earlier, an increase in Trade Volumes passed through the platform leads to a proportional significant increase in revenue and an exponential increase in profitability. How has the commodity market been doing recently? Since the short report or maybe since March/February when the shares (following short report) were traded at $7-$8 apiece?</p>\n\n<p>Can you spot a divergence between the shares of a fin-tech startup whose profitability directly depends on the price of commodities ($TRIT) and the actual commodity price index ($SPGSCI)?</p>\n\n<h1>App Store</h1>\n\n<p>An unlikely source of hopium came from Apple today. The SA article I mentioned a few times already features a screenshot on the amount of the number of reviews on the Kratos <a href=\"https://apps.apple.com/us/app/kratos-trade-finance-app/id1515877737\">mobile app</a>. The current review count stands at 42, it was 21 in February when the SA article was published. These are supposedly platform traders, reviewing the app. And it makes me feel pretty good about platform growth.</p>\n\n<p>P.S. I think the mobile app is a gimmick for them. The main functionality of their platform is on the web. Check out this <a href=\"https://steemit.com/kratos/@bonanza-kreep/kratos-a-commodity-trading-platform-with-user-curated-funding\">older review</a> for some details.</p>\n\n<h1>New Hires</h1>\n\n<p>One of the best pieces of news for the company in the recent past are their new hires. Since the 2 board members left, the company has been on a spree of quality team additions.</p>\n\n<ul>\n<li><a href=\"https://ir.triterras.com/news-events/press-releases/detail/50/triterras-hires-perry-mangers-as-vice-president-of\">Triterras Hires Perry Mangers as Vice President of Financial Reporting</a><a href=\"https://www.linkedin.com/in/perry-mangers-cpa-0170922/\">LinkedIn </a>(long-term Jacobs executive)</li>\n<li><a href=\"https://ir.triterras.com/news-events/press-releases/detail/48/triterras-bolsters-structured-finance-team-with-key\">Triterras Bolsters Structured Finance Team with Key Appointments</a>Frank Barbarino, CAIA, will lead fund origination and structuring; Amoy Chambers joins as head of legal for structuring and distribution </li>\n<li><a href=\"https://www.linkedin.com/in/barbarinofrank/\">Frank Bombino</a> (former Goldman Sachs VP)</li>\n<li><a href=\"https://www.linkedin.com/in/amoy-chambers/\">Amoy Chambers</a> (former HSBC VP)</li>\n<li><a href=\"https://ir.triterras.com/news-events/press-releases/detail/41/triterras-appoints-chief-technology-officer\">Triterras Appoints Chief Technology Officer</a> (<a href=\"https://www.linkedin.com/in/srivasireddy/\">LinkedIn</a>)</li>\n<li><a href=\"https://ir.triterras.com/news-events/press-releases/detail/39/triterras-announces-senior-team-expansion\">Triterras Announces Senior Team Expansion</a></li>\n</ul>\n\n<blockquote>\n<p>Peter Karos – Business Development, North America  </p>\n\n<p>Mr. Karos joined Triterras in February 2021 as a consultant and is responsible for originating supplier and lending relationships in North America. He is based in Toronto and reports to Chief Operating Officer John Galani.  </p>\n\n<p>Mr. Karos brings to Triterras more than 25 years of experience in financial markets as well as maritime and commodity trading industries. Since 2013, he has served as a special advisor to Bluewater Acquisition Corp (TSXV: BAQ.P), a Capital Pool Company that identifies, evaluates, and invests in assets or businesses in the maritime/shipping sector. Mr. Karos also serves as an independent consultant and investor for several assignments with private equity funds, hedge funds, and boutique investment banks.</p>\n</blockquote>\n\n<p>So what I want to highlight:</p>\n\n<ul>\n<li>First of all. The new CPA/Financial reporting head is a must, given their situation and increasing chances they will pass the audit and release FY2021 results in time. The guy looks solid to me and I hope he would not put his name on the line for a longer dime.</li>\n<li>Former HSBC and Goldman VPs are not easy people to hire, they do their own DD on who hires them. They don’t like to look like fools (although the right salary and golden parachutes fix it).</li>\n<li>I like “North America” and “Business Development” together. That screams “Money” to me.</li>\n</ul>\n\n<p><strong>Upcoming Catalysts</strong></p>\n\n<p>Ok, maybe this boat won’t sink. Why should I invest now and not wait longer, maybe more discounts?</p>\n\n<p>Well I believe once their FY2021 report is filed and the audit is complete the price will either move (much) closer to $0 or back to at least $9-10. Based on the audit results.</p>\n\n<p><a href=\"https://ir.triterras.com/news-events/press-releases/detail/51/triterras-provides-update-on-independent-audit-of-fiscal\">Triterras Provides Update on Independent Audit of Fiscal 2021 Financials</a></p>\n\n<blockquote>\n<p>While the Company believed that the Audit could be completed by September 30, 2021, additional time is needed for the Audit to be completed.  </p>\n\n<p>Nasdaq granted the Company an extension to November 1, 2021 to regain compliance with Nasdaq Listing Rule 5250(c)(1) by filing its Annual Report on Form 20-F with the U.S. Securities and Exchange Commission. After discussions with the Company’s independent auditor, the Company anticipates that the Audit will be completed in time to allow for the finalization and filing of its Annual Report on Form 20-F by November 1, 2021.</p>\n</blockquote>\n\n<p>There is an important consideration. November 1 is not a super-hard deadline. In theory, Nasdaq can extend it again into December. From previous extension filing:</p>\n\n<blockquote>\n<p>If Nasdaq accepts the Company’s plan, then Nasdaq may grant the Company an exception of up to 180 calendar days from the due date of the 2021 Annual Report, <strong>or until December 27, 2021,</strong> to regain compliance. If Nasdaq does not accept the Company’s plan, then the Company would have the opportunity to appeal that decision to a Nasdaq hearings panel. The Notice has no immediate impact on the listing of the Company’s securities on Nasdaq.</p>\n</blockquote>\n\n<p>It sure looks like we are on the final stretch of a long winter for this stock. And we have a few outcomes which I consider probable:</p>\n\n<ul>\n<li>Half-decent audit and great financials. Everything is great.</li>\n<li>Poor audit (the company is a fraud) and great financialsSome resignations, SEC investigations, and other potential fireworks. Price either tanks or stays in the range of $4.67-$6 depending on how bad things are.</li>\n<li>The report is delayed further and the audit extends, no financial report is filed. Share price tanks locally, but there is a hard deadline of December 27 I mentioned earlier. So some resolution would come before that.</li>\n</ul>\n\n<h1>Float</h1>\n\n<p>Let’s get to the interesting part.</p>\n\n<p>I would rather agree on a root canal treatment than calculate the float for a stock like this again. The data for float calculation was sourced from the SEC filings from Netfin (formerly SPAC) and Triterras Inc.</p>\n\n<p>First of all, The source data for total float is this <a href=\"https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037183/0001213900-20-037183.pdf\">SEC filing</a>:</p>\n\n<p><a href=\"https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037183/0001213900-20-037183.pdf\">https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037183/0001213900-20-037183.pdf</a></p>\n\n<blockquote>\n<p><strong>Share Capital</strong>  </p>\n\n<p>As of November 11, 2020, subsequent to the closing of the Business Combination, there were 83,195,869 Ordinary Shares outstanding and issued. There were also 25,981,000 Triterras Warrants outstanding, each exercisable at $11.50 per share, of which 25,300,000 were former Public Warrants and 681,000 were former Private Placement Warrants. The Business Combination Agreement provides that the Sellers will be entitled to receive an additional 15,000,000 Ordinary Shares upon the occurrence of certain Adjusted EBITDA thresholds, see “The Business Combination Agreement—Earnout Share Consideration and Adjusted EBITDA*” which is incorporated herein by reference.</p>\n</blockquote>\n\n<h1>Lockup agreement &amp; insiders.</h1>\n\n<p>The lockup agreement existed before but expired and the insider shares are unlocked now.</p>\n\n<blockquote>\n<p><strong>Lock-up Agreement</strong>  </p>\n\n<p>On the Closing Date, we entered into a lock-up agreement (the “Lock-Up Agreement”) with Netfin, MVR Netfin LLC, SSOL and IKON (SSOL and IKON together, the “Sellers”) pursuant to which the Sellers agreed to not transfer, sell, assign or otherwise dispose of our Ordinary Shares, including shares receivable upon exercise of Warrants, they received in the Business Combination prior to (i) three months after the Closing Date with respect to 10% of their Ordinary Shares and (ii) six months after the Closing Date with respect to the remaining 90% of their Ordinary Shares, subject to certain exceptions set forth therein. The foregoing description of the Lock-Up Agreement does not purport to be complete and is qualified in its entirety by reference to the full text of the Lock-Up Agreement, which is attached hereto as Exhibit 4.3 and is incorporated by reference herein.</p>\n</blockquote>\n\n<p>The document also lists invaluable insiders ownership post-combination table.</p>\n\n<p>See section MAJOR SHAREHOLDERS AND RELATED PARTY TRANSACTIONS</p>\n\n<p>This is important. I&#39;m going to refer to this section later.</p>\n\n<p>So you can see that parties associated with <strong>MVR Netfin</strong> own a significant chunk of post-combination business. Interestingly enough none of them have sold as far as I can tell. It might be due to the share price having dropped before the lockup has expired for them. But they have not sold even eligible parts, since no filings on their behalf can be located. Free float can reasonably be decreased by the number of shares owned by these insiders. But I will caution you, it only works until the price is low. As bags get lighter, I can imagine these shares can end up on the market, the inflection point is probably $10/share. It’s a place where I would start getting cautious about these insiders.</p>\n\n<h1>Warrants</h1>\n\n<p>As you can see the company has issued a sizable amount of warrants, but they are exercisable at $11.5.  There are 25,300,000 outstanding public warrants and 681,000 private warrants. All are exercisable for $11.50 for one ordinary class A share and have an expiration of 12/10/2025. There are no current lock-ups on these warrants. $TRIT can redeem public warrants at any time for $0.01 provided the underlying price equals or exceeds $18 for 20 days out of a 30 day period. Private warrants are not redeemable. It looks like we should not worry about them until we reach $11.5.</p>\n\n<h1>Insider Bonus</h1>\n\n<p><a href=\"https://ir.triterras.com/sec-filings/all-sec-filings?form_type=F-4&amp;year=##document-2-0001213900-20-024301-2\">F-4</a> also contains a description of an additional performance-based bonus for insiders based on stock performance and EBITDA targets:</p>\n\n<blockquote>\n<p><strong>Earnout Share Consideration and Adjusted EBITDA\\</strong>*  </p>\n\n<p>The Business Combination Agreement provides that the Sellers will be entitled to receive an additional 15,000,000 Holdco Ordinary Shares or “Earnout Share Consideration” after the closing of the Business Combination: (i) 5,000,000 Holdco Ordinary Shares on the earlier to occur of (a) the date on which Holdco’s audited financial statements for the fiscal year ending February 28, 2021 become available, if Holdco’s Adjusted EBITDA* calculated using such Holdco audited financial statements exceeds $35,838,245 or (b) the date on which the Holdco Ordinary Shares trade on the Nasdaq at a closing price greater than $13.00 for 20 trading days within any 30-day trading period during the one-year period immediately following the closing of the Business Combination; (ii) 5,000,000 Holdco Ordinary Shares on the earlier to occur of (a) the date on which Holdco’s audited financial statements for the fiscal year ending February 28, 2022 become available, if Holdco’s Adjusted EBITDA* calculated using such audited financial statements exceeds $75,901,142 or (b) the date on which the Holdco Ordinary Shares trade on the Nasdaq at a closing price greater than $15.00 for 20 trading days within any 30-day trading period during the two-year period immediately following the closing of the Business Combination; and (iii) 5,000,000 Holdco Ordinary Shares on the earlier to occur of (a) the date on which Holdco’s audited financial statements for the fiscal year ending February 28, 2023 become available, if Holdco’s Adjusted EBITDA* calculated using such audited financial statements exceeds $125,657,831 or (b) the date on which the Holdco Ordinary Shares trade on the Nasdaq at a closing price greater than $17.00 for 20 trading days within any 30-day trading period during the three-year period immediately following the closing of the Business Combination.</p>\n</blockquote>\n\n<p>We should not worry about it until the stock hits $13USD or a good report with great EBITDA is published. Which would be a good problem to have.</p>\n\n<p><strong>13-Fs and institutional ownership</strong></p>\n\n<p>Using the insider ownership table from this <a href=\"https://ir.triterras.com/sec-filings/all-sec-filings/content/0001213900-20-037183/0001213900-20-037183.pdf\">SEC filing</a>, the fact that no SEC filings indicating insider selling have been filed on behalf of entities listed there and 13-Fs from <a href=\"https://fintel.io/so/us/trit\">fintel</a>. I’m trying to build a profile of insiders and institutions with diamond hands.</p>\n\n<p>There are a few reasons why I classify an institution as diamond hands:</p>\n\n<ul>\n<li>It’s an investment bank or index fund</li>\n<li>It’s a known long-term investment firm</li>\n<li>They built a position recently after the short report</li>\n<li>They did not sell a single share after the short report</li>\n<li>They have hedged positions with options and are likely to hold through the thick and thin.</li>\n</ul>\n\n<p><a href=\"https://docs.google.com/spreadsheets/d/1Fk9Cr5xZviTP6wjx-Htnh1jmuXaBVtIkygMT4tyji8g/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1Fk9Cr5xZviTP6wjx-Htnh1jmuXaBVtIkygMT4tyji8g/edit?usp=sharing</a></p>\n\n<p>Please note, it’s not all institutional ownership, but only institutions/insiders who are likely to hold. So we reasonably can decrease the float by a sum of 69,257,790 shares. At this point the free float is  83,195,869 - 69,257,790 (diamond hands). Now, remember the company also bought back  6,671,788 shares (reported in May). Also 8,303,000 record for MVR includes 681,000 warrants. So I cannot really move out of the float So it brings us down to 83,195,869 - 69,257,790 -  6,671,788 + 681,000 =  <strong>7,947,291</strong> shares.</p>\n\n<p>It is our free float by the DFV method.</p>\n\n<p><strong>Delta-hedging</strong></p>\n\n<p>$TRIT features significant <a href=\"https://ibb.co/vHs02HR\">open interest</a> on the call side going into November/December/January 2021. By my calculations market makers need to allocate around <strong>2.2M</strong> shares in delta-hedging based on the available data.</p>\n\n<p>I&#39;m omitting calculations, but the size of interest can be easily checked here:</p>\n\n<p><a href=\"https://maximum-pain.com/options/TRIT\">https://maximum-pain.com/options/TRIT</a></p>\n\n<p>Assuming float is about <strong>8M,</strong> more than 25% of the float should be delta-hedged. If the price crosses $10, this number rises to 60%. <a href=\"https://ibb.co/dJK0BYd\">Illustration</a></p>\n\n<p>This can easily trigger a gamma-squeeze on a sudden upward price move.</p>\n\n<h1>Short Interest</h1>\n\n<p>Based on <a href=\"https://ibb.co/rFTLMyV\">Ortex data</a>, there are a few aspects of the short interest situation I would like to highlight.</p>\n\n<ol>\n<li>Total short interest stands at 2.41M shares, which represents more than 25% of free float by calculations above. A respectable number, but far from where it was a few months ago.</li>\n<li>The shorts have been covering very actively over the last few months. It’s both good because it’s a bullish sign in general and bad because it’s a missed opportunity.</li>\n<li>The fact shorts are actively covering also decreases the probability that the company is a total fraud.</li>\n<li>If you look at the data closely, you can notice how days to cover have jumped recently, while overall short interest is on the decline. The reason for it - the stock became extremely illiquid. Sometimes there are no trades for the full 25 minutes. And when there are some, it’s 100 shares changing hands. Check it for yourself. When I bought 200 shares the other day I raised the price by $0.02 lol. This indicates extreme stress the short may experience if the price goes up. There is no liquidity.</li>\n<li>FTDs % of daily volume sometimes shoots above 30-40%. Take a look here: <a href=\"https://sec.report/fails.php?tc=TRIT\">https://sec.report/fails.php?tc=TRIT</a></li>\n</ol>\n\n<p>Paired with gamma ramp situation, and extremely low liquidity SI looks like a promising catalyst in case of a good news release next few days.</p>\n\n<h1>Positions</h1>\n\n<p>2k shares @ $5.96</p>\n\n<p>100 x 7.5c November</p>\n\n<p>125 x 10c November</p>\n\n<p>50 x 7.5c December</p>\n\n<p>35 x 7.5 January 2021</p>\n\n<h1>Conclusion</h1>\n\n<p>The company operates on the intersection of 2 major trends in the global economy:</p>\n\n<ul>\n<li>Improving supply chain reliability</li>\n<li>Adopting cryptocurrencies in real-world applications.</li>\n</ul>\n\n<p>In my opinion, $TRIT represents an asymmetrical risk/reward profile at this point. The stock has been beaten to oblivion and enters a phase of consolidation ahead of significant events. The risks remain and the company can go bankrupt if fraud allegations are confirmed but if it does not happen - it’s going to be a golden opportunity.</p>\n\n<p>There are also distinct upcoming catalysts: filing FY2021 annual report, which I think has good numbers, ending the audit, and lifting a threat of delisting. This is all the company promises to accomplish <strong>before November 1st.</strong></p>\n\n<p>Low free float, relatively high SI, and a lot of fireworks from a potential delta-hedging make the long-play very appealing. This situation is aggravated by how illiquid the stock is. No one really wants to trade it :)</p>\n\n<p>While I’m obviously bullish on the company, you can tell from my position. There might be some opportunity for interesting straddle option strategies or even short strategies if you find a short thesis more probable.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "qd1co2",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "diamondpalantard",
  "discussion_type": null,
  "num_comments": 23,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/qd1co2/trick_or_trit/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/qd1co2/trick_or_trit/",
  "subreddit_subscribers": 3147405,
  "created_utc": 1634878830,
  "num_crossposts": 4,
  "media": null,
  "is_video": false,
  "original_created_utc": 1634850119,
  "the_new_excerpt": "SPOOKY PART\n\nSpooky season - spooky trades? Let’s talk about investing in Triterras Inc.\n\nWhat can scare a normal investor:\n\n * The company is labeled as fraud (by a short report, covered later in this DD)\n   * As a result, the company started an independent internal investigation,\n     which is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スプーキー・パート\n\nスプーキー・シーズン - スプーキー・トレード？株式会社トライテラスへの投資についてお話します。\n\n何が普通の投資家を怖がらせるのか。\n\n * 会社は詐欺師のレッテルを貼られている（DDで後述するショートレポートによって）。\n   * その結果、会社は独立した内部調査を開始しました。\n     それは...",
      "title": "Trick or $TRIT"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "诡异的部分\n\n诡异的季节 - 诡异的行业？让我们来谈谈对Triterras公司的投资。\n\n什么能让一个正常的投资者感到害怕。\n\n *该公司被贴上了欺诈的标签（由一份简短的报告，在本DD后面涉及）。\n   * 结果，公司开始进行独立的内部调查。\n     这就是...",
      "title": "骗局或$TRIT"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "詭異的部分\n\n詭異的季節 - 詭異的行業？讓我們來談談對Triterras公司的投資。\n\n什麼能讓一個正常的投資者感到害怕。\n\n *該公司被貼上了欺詐的標籤（由一份簡短的報告，在本DD後面涉及）。\n   * 結果，公司開始進行獨立的內部調查。\n     這就是...",
      "title": "騙局或$TRIT"
    }
  ],
  "source_updated_at": 1635500433752
}