{
  "author": "AuthenticWeeb",
  "original_created_utc": 1637062293,
  "title": "Are most people also terrified of how common being anti-vax has become?",
  "created_utc": 1637073321,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m from the UK. For the last year and a half or so every single news outlet on YouTube uploading videos regarding Covid-19 is spammed with dislikes from antivaxxers. Almost every single comment on these videos is heavily antivax and people talk as if taking the vaccine is dangerous. I actually thought it was some sort of meme at first because I just couldn&#39;t believe it. Just writing &quot;UK Coronavirus news&quot; on YouTube and checking the comments on ANY of these videos, you will see people swearing the vaccine is dangerous, COVID is a hoax made for control and the government is bad.</p>\n\n<p>I mean I&#39;m from Gen Z, I dislike capitalism and the government as much as the next guy. And the government does control us in a million ways, but the vaccine is not one of them. Like how exactly is making people take the vaccine giving the government any sort of control? Do people seriously believe there are microchips in there that track us? Like that&#39;s not a meme and people actually think that?</p>\n\n<p>It just boggles my mind. As much as people love to say Reddit is an echo chamber filled with idiots who act like they&#39;re geniuses, I gotta say I&#39;m glad this is the only social media I use. In most subreddits, people will go out of their way to make sure you look like a complete dumbass if you&#39;re antivax. I used to think that aspect of Reddit is quite toxic, but realising that if Facebook was my go-to social media instead I could have been one of these antivaxxers changes my mind.</p>\n\n<p>Anyway, I&#39;m just wondering if anyone else is completely dumbfounded and terrified of how common it has become to be antivax. In pretty much all of these UK news videos on Coronavirus, if you defend the vaccine in any way you will immediately be called a sheep who doesn&#39;t realise they&#39;re being controlled.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/qv5tlb/are_most_people_also_terrified_of_how_common/",
  "subreddit": "TooAfraidToAsk",
  "id": "qv5tlb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm from the UK. For the last year and a half or so every single news outlet on\nYouTube uploading videos regarding Covid-19 is spammed with dislikes from\nantivaxxers. Almost every single comment on these videos is heavily antivax and\npeople talk as if taking the vaccine is dangerous. I actually…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は英国出身です。この1年半ほど、YouTubeでCovid-19に関するビデオをアップロードしているすべてのニュースソースは\nYouTubeでCovid-19に関するビデオをアップロードすると、反ワクチン主義者からの嫌がらせを受けます。\n反抗的な人たちからの \"いいね！\"で溢れかえっています。これらのビデオのコメントはほとんどすべてが反ワクチンで、まるでワクチンを摂取しているかのような発言をしています。\nワクチンを打つことが危険であるかのように語られています。私は実際に...",
      "title": "ほとんどの人は、アンチワクチンが一般的になったことにも恐怖を感じているのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我来自英国。在过去一年半左右的时间里，YouTube上每一个上传有关Covid-19的视频的新闻机构都被来自世界各地的 \"不喜欢 \"所困扰。\nYouTube上上传的关于Covid-19的视频都会被反疫苗者的 \"不喜欢 \"所干扰。\n反疫苗的人。几乎这些视频上的每一条评论都是严重的反疫苗，并且\n人们说得好像接种疫苗很危险一样。实际上，我...",
      "title": "大多数人也对反疫苗变得如此普遍感到恐惧吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我來自英國。在過去一年半左右的時間裏，YouTube上每一個上傳有關Covid-19的視頻的新聞機構都被來自世界各地的 \"不喜歡 \"所困擾。\nYouTube上上傳的關於Covid-19的視頻都會被反疫苗者的 \"不喜歡 \"所幹擾。\n反疫苗的人。幾乎這些視頻上的每一條評論都是嚴重的反疫苗，並且\n人們說得好像接種疫苗很危險一樣。實際上，我...",
      "title": "大多數人也對反疫苗變得如此普遍感到恐懼嗎？"
    }
  ]
}