{
  "author": "Still_Hat6758",
  "original_created_utc": 1642865248,
  "title": "Which coins won’t reach their ATH ever again",
  "created_utc": 1642952296,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everyone preaches “This time is different”. Now obviously to a certain degree that is true but just like 2017 I am almost certain some coins seen in the top 50 today will not be seen again reaching its previous ATH, probably forever. &lt;/p&gt;\n\n&lt;p&gt;The key here is to invest in what you believe in rather than picking a few random coins in the top 50 and holding them without even knowing their utility. Because In a situation like now you are probably trying to break even at minimum and move on. This is completely the wrong idea. First off, always research your investments utility and if you picked some coins blindly based off social media for example, research what they do NOW, and I don’t mean reading the Coinbase info on the coin, properly understand the fundamentals. If you have a solid understanding of its function and believe it will be of use in the future then Hold. Or even invest more. If it simply does nothing of use I wouldn’t wait to break even, it is most likely the time to cut your losses and find promising useful coins. &lt;/p&gt;\n\n&lt;p&gt;I am interested to know which coins people here believe won’t reach their ATH again that are in the top 50.&lt;/p&gt;\n\n&lt;p&gt;Bull markets make your rich but bear markets make you wealthy&lt;/p&gt;\n\n&lt;p&gt;Edit: seems ICP and nano are quite popular, but does anyone believe some top 15 coins won’t be seen again tho and why?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/sa4ua0/which_coins_wont_reach_their_ath_ever_again/",
  "subreddit": "CryptoCurrency",
  "id": "sa4ua0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Everyone preaches “This time is different”. Now obviously to a certain degree\nthat is true but just like 2017 I am almost certain some coins seen in the top\n50 today will not be seen again reaching its previous ATH, probably forever.\n\nThe key here is to invest in what you believe in rather than…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんな「今回は違う」と説いている。今、明らかにある程度は\nしかし、2017年と同じように、上位に表示されるコインの中には、ほぼ間違いなく\n今日の50は、以前のATHに到達することは二度と、おそらく永遠にないだろう。\n\nここで重要なのは、自分が信じているものに投資することであり、むしろ...",
      "title": "二度とATHに到達しないコインは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个人都宣扬 \"这一次是不同的\"。现在显然在某种程度上\n这是真的，但就像2017年一样，我几乎可以肯定，今天在前50名中看到的一些钱币\n今天在前50名中看到的一些硬币将不会再达到其以前的ATH，可能是永远。\n\n这里的关键是投资于你相信的东西，而不是...",
      "title": "哪些硬币不会再达到其ATH值"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人都宣揚 \"這一次是不同的\"。現在顯然在某種程度上\n這是真的，但就像2017年一樣，我幾乎可以肯定，今天在前50名中看到的一些錢幣\n今天在前50名中看到的一些硬幣將不會再達到其以前的ATH，可能是永遠。\n\n這裏的關鍵是投資於你相信的東西，而不是...",
      "title": "哪些硬幣不會再達到其ATH值"
    }
  ]
}