{
  "author": "Lemonmule69",
  "the_new_excerpt": "By winning the suit against ripple and the execs (for anyone who’s been\nfollowing the suit ripple are absolutely smashing it) there will be case\nprecedence.\n\nThey will have the big fish and case law.\n\nThis means any ico or sale of crypto from the inventors of said crypto will be\ntargeted. There’s…",
  "original_created_utc": 1616973055,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "通过赢得对ripple和高管的诉讼（对任何一个人来说\n跟随西装波纹是绝对的粉碎它）将有案例。\n先例。\n\n他们将拥有大鱼和案例法。\n\n这意味着任何来自所述加密技术发明者的ico或出售加密技术将是\n目标。有...",
      "title": "Cardano的Charles是对的 你需要ripple来赢得或这场诉讼。美国证券交易委员会将打开CoinMarketCap，并开始诉讼下来的名单。不要让部落主义阻碍了这一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通過贏得對ripple和高管的訴訟（對任何一個人來說\n跟隨西裝波紋是絕對的粉碎它）將有案例。\n先例。\n\n他們將擁有大魚和案例法。\n\n這意味着任何來自所述加密技術發明者的ico或出售加密技術將是\n目標。有...",
      "title": "Cardano的Charles是對的 你需要ripple來贏得或這場訴訟。美國證券交易委員會將打開CoinMarketCap，並開始訴訟下來的名單。不要讓部落主義阻礙了這一切。"
    }
  ],
  "title": "Charles from cardano was right. You need ripple to win or this lawsuit. The SEC is going to open up CoinMarketCap and start litigating down the list. Do not let tribalism get in the way of this.",
  "created_utc": 1616985068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>By winning the suit against ripple and the execs (for anyone who’s been following the suit ripple are absolutely smashing it) there will be case precedence. </p>\n\n<p>They will have the big fish and case law.</p>\n\n<p>This means any ico or sale of crypto from the inventors of said crypto will be targeted. There’s one thing the SEC likes and that is money. </p>\n\n<p>They can see an untapped wealth of fines and settlements here and they want to be the regulator who controls crypto in the USA. You might hate Xrp, but right now ripple and their lawyers are preventing the SEC from getting their hands on the crypto market.</p>\n</div><!-- SC_ON -->",
  "score": 3992,
  "permalink": "/r/CryptoCurrency/comments/mfcerz/charles_from_cardano_was_right_you_need_ripple_to/",
  "subreddit": "CryptoCurrency",
  "id": "mfcerz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357137117
}