{
  "author": "semtexzv",
  "original_created_utc": 1632041082,
  "title": "This cycle is about institutions, next one will be about nations",
  "created_utc": 1632061843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Take a breather from looking at the price,</p>\n\n<p>&#x200B;</p>\n\n<p>There are major companies acquiring large amount of bitcoin, Microstrategy is the first one to recognize that bitcoin is a weapon of unprecedented power in economic warfare, in that it is possibly the first one that will be able to defeat the dollar. </p>\n\n<p>&#x200B;</p>\n\n<p>In 4 years, the nations of the world will be acquiring bitcoin to get free from the petrodollar system. Up until now, these attempts always ended in war. Iraq, Libya, Venezuela tried trading oil for something other than dollars, and all of these attempts were stopped by US interventions.</p>\n\n<p>&#x200B;</p>\n\n<p>You are a part of largest financial revolution ever.  </p>\n\n<p>&#x200B;</p>\n\n<p>Just buy Bitcoin, and enjoy the ride.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/pr4aag/this_cycle_is_about_institutions_next_one_will_be/",
  "subreddit": "Bitcoin",
  "id": "pr4aag",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Take a breather from looking at the price,\n\n\n\nThere are major companies acquiring large amount of bitcoin, Microstrategy is\nthe first one to recognize that bitcoin is a weapon of unprecedented power in\neconomic warfare, in that it is possibly the first one that will be able to\ndefeat the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "価格を見て、一息ついてください。\n\n\n\n大手企業が大量のビットコインを取得しているが、マイクロストラテジーが\nマイクロストラテジーは、ビットコインが経済戦争において前例のない威力を持つ武器であることを最初に認識した企業です。\nマイクロストラテジーは、ビットコインが経済戦争において前例のない威力を持つ武器であることを最初に認識しました。\nを倒すことができるかもしれないという意味で、ビットコインは経済戦争において前例のない威力を持つ武器であると認識しています。",
      "title": "今回のサイクルは機関について、次のサイクルは国家についてです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "喘口气吧，别再看价格了。\n\n\n\n有一些大公司在收购大量的比特币，Microstrategy是\n是第一个认识到比特币是一种前所未有的武器的公司。\n在经济战争中具有前所未有的力量，因为它可能是第一个能够\n击败...",
      "title": "这个周期是关于机构的，下一个周期将是关于国家的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "喘口氣吧，別再看價格了。\n\n\n\n有一些大公司在收購大量的比特幣，Microstrategy是\n是第一個認識到比特幣是一種前所未有的武器的公司。\n在經濟戰爭中具有前所未有的力量，因爲它可能是第一個能夠\n擊敗...",
      "title": "這個週期是關於機構的，下一個週期將是關於國家的。"
    }
  ]
}