{
  "author": "Glittering_Shoe_4460",
  "original_created_utc": 1650058279,
  "title": "Too afraid to ask because I'm afraid of the answer: were my parents crazy for doing this to us?",
  "created_utc": 1650098847,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My parents were obsessed with using homelessness as a discipline tool.&lt;/p&gt;\n\n&lt;p&gt;My 20 year-old half-sister had her house and car keys snatched out her hands and was told to get the fuck out at 2 a.m., ultimately because she was caught in a lie about having sex.&lt;/p&gt;\n\n&lt;p&gt;My 21 year-old half-sister got similar treatment for the same reason, but my parents went back for her, found her walking down the street at 1 a.m., and told her to get back in the car and drove her home. They offered her to stay and talk after church the next morning, but she went with church with us, came home, packed up her things, and left.&lt;/p&gt;\n\n&lt;p&gt;When I was 11, my parents pretended to throw me out for talking to a boy on the phone the night before, but before I realized their bluffing, it was very real to me. Woke me up, told me to put my shoes and clothes on, and told me to get out. They called me back in before I could walk to the school around the corner.&lt;/p&gt;\n\n&lt;p&gt;When I was 15, my parents verbally threatened the same for smarting off. (Again, likely a bluff, but still.) My brother was on the couch crying about me having to leave.&lt;/p&gt;\n\n&lt;p&gt;Crazy I took these moments as normal when I was growing up. Now at 25, kind of realizing how...interesting this all was.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/u4ic8s/too_afraid_to_ask_because_im_afraid_of_the_answer/",
  "subreddit": "TooAfraidToAsk",
  "id": "u4ic8s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My parents were obsessed with using homelessness as a discipline tool.\n\nMy 20 year-old half-sister had her house and car keys snatched out her hands and\nwas told to get the fuck out at 2 a.m., ultimately because she was caught in a\nlie about having sex.\n\nMy 21 year-old half-sister got similar…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の両親は、ホームレスを躾の道具にすることに夢中でした。\n\n20歳の異母姉は、家と車の鍵を奪われました。\n夜中の2時に「出て行け」と言われたのは、結局のところ、彼女のことがバレたからです。\nセックスをしたという嘘をついた。\n\n21歳の異母姉も同じようなことを...",
      "title": "答えが怖くて聞けない：私たちにこんなことをする親はおかしいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的父母痴迷于把无家可归作为一种惩戒工具。\n\n我20岁的同父异母的妹妹的房子和汽车钥匙被抢走了，并被告知在凌晨2点滚出去。\n被告知在凌晨2点滚出去，最终是因为她被抓到了一个关于做爱的谎言。\n因为她被抓到关于做爱的谎言。\n\n我21岁的同父异母的妹妹也得到了类似的...",
      "title": "不敢问，因为我害怕答案：我的父母对我们这样做，是不是疯了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的父母癡迷於把無家可歸作爲一種懲戒工具。\n\n我20歲的同父異母的妹妹的房子和汽車鑰匙被搶走了，並被告知在凌晨2點滾出去。\n被告知在凌晨2點滾出去，最終是因爲她被抓到了一個關於做愛的謊言。\n因爲她被抓到關於做愛的謊言。\n\n我21歲的同父異母的妹妹也得到了類似的...",
      "title": "不敢問，因爲我害怕答案：我的父母對我們這樣做，是不是瘋了？"
    }
  ]
}