{
  "author": "TwistedFluke",
  "the_new_excerpt": "I thought I'd share my simple life hack if you're ever faced with a long quote\ntime on waiting to speak with someone.\n\n 1. Write down the number selections when navigating through menu over the phone\n 2. Hang up once it puts you in line to speak with someone\n 3. Redial and select French (Canada) or…",
  "original_created_utc": 1623648092,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、あなたが長い待ち時間に直面したら、私の簡単なライフハックを共有しようと思いました。\n人と話すのを待つ時間が長くなってしまった時のために\n\n 1. 電話でメニューを選択するときは、選択した番号をメモしておく\n 2. 人と話すための列に並んだら電話を切る。\n 3. リダイヤルでフランス語（カナダ）または...を選択する。",
      "title": "銀行や証券会社に電話するとき"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我应该分享我的简单的生活黑客，如果你曾经面临一个很长的报价\n漫长的时间来等待与人交谈。\n\n 1. 在电话中通过菜单导航时，写下数字的选择\n 2. 2.一旦它让你排队与人交谈，就挂断电话\n 3. 重拨并选择法语（加拿大）或英语（加拿大）。",
      "title": "给银行或股票经纪公司打电话时"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我應該分享我的簡單的生活黑客，如果你曾經面臨一個很長的報價\n漫長的時間來等待與人交談。\n\n 1. 在電話中通過菜單導航時，寫下數字的選擇\n 2. 2.一旦它讓你排隊與人交談，就掛斷電話\n 3. 重撥並選擇法語（加拿大）或英語（加拿大）。",
      "title": "給銀行或股票經紀公司打電話時"
    }
  ],
  "title": "When calling banks or stock brokerage",
  "created_utc": 1623653055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I thought I&#39;d share my simple life hack if you&#39;re ever faced with a long quote time on waiting to speak with someone.</p>\n\n<ol>\n<li>Write down the number selections when navigating through menu over the phone</li>\n<li>Hang up once it puts you in line to speak with someone</li>\n<li>Redial and select French (Canada) or Spanish (USA)</li>\n<li>Press the number selections as if you&#39;re calling the English side</li>\n<li>Start speaking English as all agents have to be bilingual</li>\n</ol>\n\n<p>By doing this I found that wait time lasted anywhere from 5 minutes to 10 minutes in comparison to 3 hours on the English side</p>\n\n<p>With more new investors entering the market, I believe the queue will become even longer as more people invest and using this will save some time.</p>\n</div><!-- SC_ON -->",
  "score": 1992,
  "permalink": "/r/stocks/comments/nzffoa/when_calling_banks_or_stock_brokerage/",
  "subreddit": "stocks",
  "id": "nzffoa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743476
}