{
  "author": "ReleeSquirrel",
  "the_new_excerpt": "I grew up in the Great Lakes region and I've often wondered about the history of\nthe region before colonization.\n\nIn particular, I want to know why there was no civilization with permanent\nstructures in the Great Lakes region and St. Lawrence Seaway prior to the\nColonization of the Americas?\n\nI've…",
  "original_created_utc": 1620422727,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は五大湖地域で育ちましたが、植民地化される前のこの地域の歴史についてよく考えていました。\n私は五大湖周辺で育ったので、植民地化以前のこの地域の歴史についてよく考えていました。\n\n特に、なぜ五大湖地域とセントローレンス海路に恒久的な構造物を持つ文明が存在しなかったのかを知りたいと思っています。\n五大湖地域とセントローレンス海路に恒久的な構造物を持つ文明が存在しなかった理由を知りたいのです。\nアメリカ大陸の植民地化？\n\n私は...",
      "title": "アメリカ大陸の植民地化以前に、五大湖周辺やセントローレンス海路に恒久的な構造物を持つ文明が存在しなかったのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在大湖区长大，我经常想知道在殖民化之前该地区的历史。\n该地区在殖民化之前的历史。\n\n特别是，我想知道为什么在大湖区和圣劳伦斯河道上没有永久性建筑的文明？\n在大湖区和圣劳伦斯海道上，为什么没有任何具有永久性结构的文明？\n美洲的殖民化？\n\n我已经...",
      "title": "为什么在美洲殖民化之前，大湖区和圣劳伦斯海道周围没有永久性建筑的文明？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在大湖區長大，我經常想知道在殖民化之前該地區的歷史。\n該地區在殖民化之前的歷史。\n\n特別是，我想知道爲什麼在大湖區和聖勞倫斯河道上沒有永久性建築的文明？\n在大湖區和聖勞倫斯海道上，爲什麼沒有任何具有永久性結構的文明？\n美洲的殖民化？\n\n我已經...",
      "title": "爲什麼在美洲殖民化之前，大湖區和聖勞倫斯海道周圍沒有永久性建築的文明？"
    }
  ],
  "title": "Why was there no civilization with permanent structures around the Great Lakes region and St. Lawrence Seaway prior to Colonization in the Americas?",
  "created_utc": 1620457594,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I grew up in the Great Lakes region and I&#39;ve often wondered about the history of the region before colonization.</p>\n\n<p>In particular, I want to know why there was no civilization with permanent structures in the Great Lakes region and St. Lawrence Seaway prior to the Colonization of the Americas?</p>\n\n<p>I&#39;ve been led to believe that the settlements here were all either temporary or not &#39;built to last&#39; like the famous central american civilizations. If true, why was that?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/n79f5m/why_was_there_no_civilization_with_permanent/",
  "subreddit": "AskHistorians",
  "id": "n79f5m",
  "is_self": true,
  "media": null,
  "is_video": false
}