{
  "author": "AskScienceModerator",
  "original_created_utc": 1634025626,
  "title": "AskScience AMA Series: We're scientists and engineers working on NASA's Lucy mission to explore Jupiter's Trojan Asteroids. Ask us anything!",
  "created_utc": 1634042121,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Trojan asteroids are rocky worlds as old as our solar system, and they share an orbit with Jupiter around the Sun. They&#39;re thought to be remnants of the primordial material that formed the outer planets. On Oct. 16, NASA&#39;s Lucy mission is scheduled to launch from Cape Canaveral, Florida, to explore these small worlds for the first time. Lucy was named after the fossilized human ancestor (called &quot;Lucy&quot; by her discoverers) whose skeleton expanded our understanding of human evolution. The Lucy Mission hopes to expand our understanding of solar system evolution by visiting these 4.5-billion-year-old planetary &quot;fossils.&quot; We are:</p>\n\n<ul>\n<li>Jeremy Knittel, Senior Mission Design and Navigation Engineer at KinetX Aerospace</li>\n<li>Amy Simon, Senior Planetary Scientist for NASA Goddard Space Flight Center</li>\n<li>Audrey Martin, Graduate Research Assistant at Northern Arizona University</li>\n<li>Cory Prykull, Systems Integration and Test Supervisor at Lockheed Martin</li>\n<li>Joel Parker, Director at Southwest Research Institute</li>\n</ul>\n\n<p>All about the Lucy mission: <a href=\"http://www.nasa.gov/lucy\">www.nasa.gov/lucy</a></p>\n\n<p>We&#39;ll be here from from 2-3 p.m. EDT (18-19 UT), ask us anything!</p>\n\n<p>Username: <a href=\"/u/NASA\">/u/NASA</a></p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/askscience/comments/q6h6ch/askscience_ama_series_were_scientists_and/",
  "subreddit": "askscience",
  "id": "q6h6ch",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Trojan asteroids are rocky worlds as old as our solar system, and they share\nan orbit with Jupiter around the Sun. They're thought to be remnants of the\nprimordial material that formed the outer planets. On Oct. 16, NASA's Lucy\nmission is scheduled to launch from Cape Canaveral, Florida, to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "トロイア型小惑星は、太陽系と同じくらい古い岩石質の世界であり、その軌道を共有する\n木星と同じ軌道で太陽の周りを回っている。外惑星を形成した原始物質の残骸と考えられています。\n外惑星を形成した原始的な物質の残骸と考えられています。10月16日には、NASAのルーシー\nミッションは10月16日にフロリダ州ケープカナベラルから打ち上げられる予定です。",
      "title": "AskScience AMAシリーズ。私たちは、木星のトロイア小惑星を探査するNASAのルーシー・ミッションに携わる科学者とエンジニアです。何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "特洛伊小行星是与我们的太阳系一样古老的岩石世界，它们与木星共同围绕太阳运行。\n它们与木星共享一个围绕太阳的轨道。它们被认为是形成外行星的原始物质的遗留物。\n它们被认为是形成外行星的原始物质的残留物。10月16日，美国宇航局的露西\n任务计划从佛罗里达州的卡纳维拉尔角发射到...",
      "title": "AskScience AMA系列。我们是在美国国家航空航天局的露西任务中工作的科学家和工程师，以探索木星的特洛伊小行星。向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特洛伊小行星是與我們的太陽系一樣古老的岩石世界，它們與木星共同圍繞太陽運行。\n它們與木星共享一個圍繞太陽的軌道。它們被認爲是形成外行星的原始物質的遺留物。\n它們被認爲是形成外行星的原始物質的殘留物。10月16日，美國宇航局的露西\n任務計劃從佛羅里達州的卡納維拉爾角發射到...",
      "title": "AskScience AMA系列。我們是在美國國家航空航天局的露西任務中工作的科學家和工程師，以探索木星的特洛伊小行星。向我們提出任何問題!"
    }
  ]
}