{
  "author": "monophylethic",
  "the_new_excerpt": "A lot of new people are getting into crypto that don't fully understand the risk\nthey are taking. I know this space is exciting and the astronomical gains are\ntempting, but try to keep your head cool.\n\nPlease don't use leverage, don't max out your credit cards, don't borrow money\nfrom friends and…",
  "original_created_utc": 1614585031,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很多新人进入加密领域，并不完全了解风险所在\n他们正在服用。我知道这个领域是令人兴奋的，天文数字的收益是。\n很诱人，但尽量保持头脑冷静。\n\n请不要使用杠杆，不要把信用卡刷爆，不要借钱。\n从朋友和...",
      "title": "致所有新加入加密技术的人们"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多新人進入加密領域，並不完全瞭解風險所在\n他們正在服用。我知道這個領域是令人興奮的，天文數字的收益是。\n很誘人，但儘量保持頭腦冷靜。\n\n請不要使用槓桿，不要把信用卡刷爆，不要借錢。\n從朋友和...",
      "title": "致所有新加入加密技術的人們"
    }
  ],
  "title": "To all the new people FOMO'ing into crypto right now",
  "created_utc": 1614621105,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of new people are getting into crypto that don&#39;t fully understand the risk they are taking. I know this space is exciting and the astronomical gains are tempting, but try to keep your head cool. </p>\n\n<p>Please don&#39;t use leverage, don&#39;t max out your credit cards, don&#39;t borrow money from friends and for fuck&#39;s sake don&#39;t sell your house to buy bitcoin. </p>\n\n<p>Don&#39;t blindly listen to people on YouTube shilling the next once-in-a-lifetime opportunity shitcoin. Take the time to do your own research and try to really understand the project before investing. The potential for huge gains is as big as the potential to get rekt. </p>\n\n<p>My advice for beginners: stick to Bitcoin and Ethereum for now. Add to your position on the dips, but only when you&#39;ve got capital available to invest that you are willing to lose. If you can&#39;t sleep at night worrying about the next dip you probably have invested too much.</p>\n\n<p>That feeling of missing out will pass and new opportunities will be there every day. You are still early and you should be in it for the long haul. Enjoy the journey and try to have some fun on the way. These are exciting times and you are doing something for your future. That is something to be proud of!</p>\n\n<p>Lastly, if you have questions don&#39;t be afraid to ask. There are amazing knowledgeable people in this community that would love to help out!</p>\n\n<p>Take care :)</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/lv3bwq/to_all_the_new_people_fomoing_into_crypto_right/",
  "subreddit": "CryptoCurrency",
  "id": "lv3bwq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937736466
}