{
  "author": "Embarrassed_End_7807",
  "the_new_excerpt": "Couldn’t post on WSB. Hopefully I can help a couple new people out. These past\nfew weeks, there have been many new people joining joining the GME wave. All\neyes are in this stock. We all know what’s going on with GME, and yes its a\ncrazy occurrence. The people that are new here may see only the good…",
  "original_created_utc": 1611551872,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不能在WSB上发帖。希望能帮助几个新人。过去的这些\n几周以来，有很多新人加入到了GME的浪潮中。所有\n眼睛是在这只股票。我们都知道GME是怎么回事，是的，它是一只\n疯狂的发生。新来的人可能只看到了好... ...",
      "title": "对于那些刚接触投资的人来说，以为说了这么多GME就轻而易举了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不能在WSB上發帖。希望能幫助幾個新人。過去的這些\n幾周以來，有很多新人加入到了GME的浪潮中。所有\n眼睛是在這隻股票。我們都知道GME是怎麼回事，是的，它是一隻\n瘋狂的發生。新來的人可能只看到了好... ...",
      "title": "對於那些剛接觸投資的人來說，以爲說了這麼多GME就輕而易舉了。"
    }
  ],
  "title": "To the people that are new to investing thinking it’s a breeze with all this GME talk",
  "created_utc": 1611583965,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Couldn’t post on WSB. Hopefully I can help a couple new people out. These past few weeks, there have been many new people joining joining the GME wave. All eyes are in this stock. We all know what’s going on with GME, and yes its a crazy occurrence. The people that are new here may see only the good side of things with how many people are making so much money over night, how people are making so much money off GME. It all seems so easy. I’m here to remind you it’s the exact opposite. Most newbies that join WSB blow up their trading accounts and lose all their money. I am certain many people that are new here will lose lots of their money soon thinking how easy it is to do this. I am posting this to hopefully save some of those people. Never forget the guy who never knew how shorting works earlier in the year, and owed his broker $200,000 overnight. Educate yourselves before even thinking about investing and or trading. This isn’t a game. Trading stocks/options isn’t ever like this. I don’t want anyone to jump into this thinking trading stocks and options is the easiest money you will ever make. It’s not, and if you do enter this game thinking it is easy, the markets WILL humble you. And I am nearly 100% certain, the new people that yolo’d all their money into GME and made some money, will lose it ALL soon. Hopefully I helped some new people out. And please, NEVER invest or trade with money you cannot afford losing. Please think again if you are ready to load up your life savings on GME.</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/investing/comments/l4gq9z/to_the_people_that_are_new_to_investing_thinking/",
  "subreddit": "investing",
  "id": "l4gq9z",
  "is_self": true,
  "media": null,
  "is_video": false
}