{
  "author": "roberthonker",
  "the_new_excerpt": "tl;dr is at the bottom\n\nRecently there was a proposal passed to limit the amount of karma that counts\nfor moons each month to 15k. This proposal was aimed to \"make distribution more\nequal and limit bots\", but in practice has the opposite effect. Some of the\nissues with this rule are:\n\n 1. This…",
  "original_created_utc": 1620859603,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "tl;drは下部にあります\n\n最近、月にカウントされるカルマの量を15kに制限する案が可決されました。\n月にカウントされるカルマの量を15kに制限する案が可決されました。この提案は、「分配をより平等にし、ボットを制限する」ことを目的と\nこの提案は、「分配をより平等にし、ボットを制限する」ことを目的としていますが、実際には逆の効果があります。このルールの問題点は\nこのルールの問題点は\n\n 1. この...",
      "title": "ムーン案。カルマの15kの上限を削除し、ムーンの1.5%の上限に変更します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题在底部\n\n最近，有一项提案被通过，将每月计算的因果报应额度限制为\n每月计算的业力为15000。这个提案的目的是 \"使分配更加\n但在实践中却产生了相反的效果。这个规则的一些\n这个规则的一些问题是。\n\n 1. 这...",
      "title": "月亮建议。取消15K的上限，代之以1.5%的月球上限。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題在底部\n\n最近，有一項提案被通過，將每月計算的因果報應額度限制爲\n每月計算的業力爲15000。這個提案的目的是 \"使分配更加\n但在實踐中卻產生了相反的效果。這個規則的一些\n這個規則的一些問題是。\n\n 1. 這...",
      "title": "月亮建議。取消15K的上限，代之以1.5%的月球上限。"
    }
  ],
  "title": "Moon Proposal: Remove the 15k cap on Karma and replace it with a 1.5% cap on moons.",
  "created_utc": 1620899046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>tl;dr is at the bottom</strong></p>\n\n<p>Recently there was a proposal passed to limit the amount of karma that counts for moons each month to 15k. This proposal was aimed to &quot;make distribution more equal and limit bots&quot;, but in practice has the opposite effect. Some of the issues with this rule are:</p>\n\n<ol>\n<li>This proposal largely benefits whales (users with lots of moons), because now no one will be able to catch up to them. Even if they earn zero moons, it will be almost impossible for a normal user get a significant amount of moons, especially as the moon/karma ratio decreases.</li>\n<li>Whales are the users that have the biggest effect on the poll, so inhibiting others from catching up means that control over governance will remain largely in the hands of very few. Obviously in a sub focused on decentralization this is not ideal.</li>\n<li>Regardless on how you feel about a cap, hopefully you can agree that a fixed karma cap makes little logical sense. 15k karma is already easier than it sounds as comment karma counts double and you get a 25% bonus for holding moons and voting on polls. <strong>Additionally, karma will be much easier to earn as the sub grows</strong> (we already gained ~1.5 Million members in 2021). Therefore, a fixed <em>karma</em> cap makes little sense since we&#39;d need to adjust the cap frequently.</li>\n<li>This cap removes the incentives to hold moons and to vote in governance polls for some users. If someone is already hitting the cap, there is no incentive for them to hold their moons. This could lead to more moons on the open market instead of locked away in users vaults, which means a lower price on moons.</li>\n<li>The main point of the poll was to prevent bots from earning lots of moons, but all users above 15k karma are legitimate humans with usernames that I recognize. Bots work by opening many accounts and not being noticed, not by accumulating tons of karma and drawing attention to themselves. <strong>The current cap does nothing to stop bots</strong>.</li>\n<li>This poll also had biased wording in the options, instead of a simple yes / no it was &quot;close this loophole&quot; or &quot;no leave the loophole open&quot;. It was also a last minute addition that did not go through the new vetting process in <a href=\"https://www.reddit.com/r/cryptocurrencymeta/\">r/cryptocurrencymeta</a></li>\n</ol>\n\n<p>The proposed change is a <strong>cap at 1.5% of the user moons distribution</strong>. The next distribution is 1.8M moons so that cap would be 27k moons. This will <strong>scale</strong> <strong>lower</strong> <strong>automatically</strong> as the total moons being distributed in each round decreases. This would give new users a chance to catch up to the whales, doesn&#39;t promote centralization like the other cap, would stop any one person from getting a ton of moons, keeps the price of moons higher and doesn&#39;t become obsolete like the other cap. It is worth mentioning that if a user exceeds the limit, their surplus moons will be distributed amongst all other users.</p>\n\n<p><strong>tl;dr: A cap on moons makes more logical sense than a cap on karma. I propose a cap at 1.5% of the total distribution (27k moons this time), so that no user can earn more than 1.5% of all the moons in a given month. This promotes decentralization of moon voting power and will automatically scale as the sub gets new members.</strong></p>\n\n<p><strong>If this proposal passes the moons per karma will go from 0.238 to 0.232. In other words, a very small decrease, while fixing many problems.</strong></p>\n\n<p><a href=\"https://www.reddit.com/poll/nb1p2y\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 377,
  "permalink": "/r/CryptoCurrency/comments/nb1p2y/moon_proposal_remove_the_15k_cap_on_karma_and/",
  "subreddit": "CryptoCurrency",
  "id": "nb1p2y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993630
}