{
  "author": "zzznka",
  "original_created_utc": 1647384737,
  "title": "I feel critically alone. What should I do?",
  "created_utc": 1647414727,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a bit ashamed to post this.&lt;/p&gt;\n\n&lt;p&gt;I am 25, I live alone, I don&amp;#39;t have any close friends and I&amp;#39;m partially off work because I can&amp;#39;t handle it anymore. I barely talk to anyone and spend my time scrolling or watching stuff to forget the fact that I feel mind numbingly alone.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always had a tendency to look forward to being alone, which I have greatly appreciated, but depression has made its way back into my life harder than ever before. I have been prescribed meds to calm my anxiety a couple of months ago but lately I try to avoid it as much as possible.&lt;/p&gt;\n\n&lt;p&gt;I truly don&amp;#39;t know what to do. I have tried to reach out to an old friend, but it&amp;#39;s not like I can expect anyone to be at my disposal. I feel like no one cares. No one reaches out to me except my family, whom I don&amp;#39;t want to worry any more about my well being.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really have any hobbies, I&amp;#39;ve come to dislike my looks for several reasons. &lt;/p&gt;\n\n&lt;p&gt;I have more and more trouble seeing the point of all this. I don&amp;#39;t see the point of looking for a fulfilling job, I find that everything is expensive anyway. I simply wish I had someone to talk to. I even have trouble looking for people to talk to as I have general trust issues about humanity.&lt;/p&gt;\n\n&lt;p&gt;I know I should talk to a therapist but I am SO overly sensitive, I cry whenever I have to talk about my feelings.&lt;/p&gt;\n\n&lt;p&gt;I am sorry for this sob story of a post.&lt;/p&gt;\n\n&lt;p&gt;I just wish someone would care.&lt;/p&gt;\n\n&lt;p&gt;(I will delete this post later.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/tf2pyk/i_feel_critically_alone_what_should_i_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "tf2pyk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a bit ashamed to post this.\n\nI am 25, I live alone, I don't have any close friends and I'm partially off work\nbecause I can't handle it anymore. I barely talk to anyone and spend my time\nscrolling or watching stuff to forget the fact that I feel mind numbingly alone.\n\nI've always had a tendency…"
}