{
  "author": "deathtolucky",
  "original_created_utc": 1638331289,
  "title": "The last moon distribution before Christmas is imminent. Happy December and I hope everyone exceeded their moon dreams!",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Patience and HODLing does pay off! For those who held and didn’t touch your moons during the previous month, you just earned yourself a 20% bonus!&lt;/p&gt;\n\n&lt;p&gt;And for the ones who don’t know how to get moons, simply open your vault on the reddit app and you’ll get moons! How you ask? Simply by receiving upvotes on your posts and comments in &lt;a href=\"/r/cryptocurrency\"&gt;r/cryptocurrency&lt;/a&gt;, it’s that easy! &lt;/p&gt;\n\n&lt;p&gt;Mainnet is just around the corner and our wildest dreams and expectations &lt;strong&gt;can&lt;/strong&gt; come true. I hope that the last distribution before Christmas was everything you hoped for and more. Have a moontastic month farmers!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 502,
  "permalink": "/r/CryptoCurrency/comments/r65upm/the_last_moon_distribution_before_christmas_is/",
  "subreddit": "CryptoCurrency",
  "id": "r65upm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Patience and HODLing does pay off! For those who held and didn’t touch your\nmoons during the previous month, you just earned yourself a 20% bonus!\n\nAnd for the ones who don’t know how to get moons, simply open your vault on the\nreddit app and you’ll get moons! How you ask? Simply by receiving…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "忍耐とHODLingは報われる! ホールドしたまま手をつけなかった人たちへ\n前月は20％のボーナスを獲得しました。\n\nムーンの取り方がわからないという方は\nredditアプリでムーンをゲット! どうやって？単純に受信...",
      "title": "クリスマス前の最後の月配が迫っています。12月もよろしくお願いします。皆さんが月の夢を超えられますように。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "耐心和HODLing确实得到了回报! 对于那些持有而没有触及你的\n月亮的人，你刚刚为自己赢得了20%的奖金!\n\n对于那些不知道如何获得月亮的人来说，只需打开你在\nreddit应用程序上打开你的金库，你就可以得到月亮了! 你问怎么得到的？只需通过接收...",
      "title": "圣诞节前的最后一次月亮分配即将来临。12月快乐，我希望每个人都能超越他们的月亮梦!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "耐心和HODLing確實得到了回報! 對於那些持有而沒有觸及你的\n月亮的人，你剛剛爲自己贏得了20%的獎金!\n\n對於那些不知道如何獲得月亮的人來說，只需打開你在\nreddit應用程序上打開你的金庫，你就可以得到月亮了! 你問怎麼得到的？只需通過接收...",
      "title": "聖誕節前的最後一次月亮分配即將來臨。12月快樂，我希望每個人都能超越他們的月亮夢!"
    }
  ]
}