{
  "author": "Interesting_Power124",
  "original_created_utc": 1639465198,
  "title": "Suggestion for mods, not question... Can we please introduce *why* the questioner is too afraid to ask, as part of the rules?",
  "created_utc": 1639487180,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This would help for so many reasons;&lt;/p&gt;\n\n&lt;p&gt;It would help the reader and answerer to understand the context and grounding from which the question is asked&lt;/p&gt;\n\n&lt;p&gt;It would help the asker pinpoint what they&amp;#39;re actually scared of, and may not feel the need to be scared or ask the question anymore&lt;/p&gt;\n\n&lt;p&gt;It would help answerers explain why someone is rightfully, or wrongfully, scared of something... Maybe not exactly &amp;quot;right&amp;quot; or &amp;quot;wrong&amp;quot; necessarily, but in need of reassurance&lt;/p&gt;\n\n&lt;p&gt;It would help Reddit become a place of building each other up, rather than just criticising one another.. I&amp;#39;ve seen &amp;quot;why would you be scared to ask this?!&amp;quot; So many times on here&lt;/p&gt;\n\n&lt;p&gt;Please delete this post if not relevant and don&amp;#39;t ban me, but please do take this into consideration.&lt;/p&gt;\n\n&lt;p&gt;If anyone else has anything to add also?&lt;/p&gt;\n\n&lt;p&gt;Edit: it&amp;#39;s becoming too much like AskReddit, with questions that have no reason for one to be scared to ask, and also with the backlash people receive coming from commenters who don&amp;#39;t appreciate that the OP &lt;em&gt;is scared to ask, for fear of said backlash, but wants to gain understanding&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/rg1p6g/suggestion_for_mods_not_question_can_we_please/",
  "subreddit": "TooAfraidToAsk",
  "id": "rg1p6g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This would help for so many reasons;\n\nIt would help the reader and answerer to understand the context and grounding\nfrom which the question is asked\n\nIt would help the asker pinpoint what they're actually scared of, and may not\nfeel the need to be scared or ask the question anymore\n\nIt would help…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これには多くの理由があります。\n\n読者や回答者が、どのような文脈や背景で書かれたものかを理解するのに役立ちます。\nその質問がどのようなものであったか\n\n質問者が実際に何を恐れているのかが明確になり、その恐怖から解放されるかもしれません。\nもう怖がったり質問したりする必要はないと思う。\n\nそれは...",
      "title": "質問ではなく、Modsへの提案ですが・・・。質問者が怖くて質問できない*理由*をルールの一部として紹介していただけないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这将有助于许多原因。\n\n它可以帮助读者和回答者理解问题的背景和基础\n问题的来龙去脉\n\n这将帮助提问者确定他们真正害怕的是什么，并且可能不再\n觉得有必要再害怕或问这个问题。\n\n这将有助于...",
      "title": "给版主的建议，不是问题...... 我们能不能介绍一下**提问者为什么不敢问，作为规则的一部分？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這將有助於許多原因。\n\n它可以幫助讀者和回答者理解問題的背景和基礎\n問題的來龍去脈\n\n這將幫助提問者確定他們真正害怕的是什麼，並且可能不再\n覺得有必要再害怕或問這個問題。\n\n這將有助於...",
      "title": "給版主的建議，不是問題...... 我們能不能介紹一下**提問者爲什麼不敢問，作爲規則的一部分？"
    }
  ]
}