{
  "author": "AskScienceModerator",
  "original_created_utc": 1646222414,
  "title": "AskScience AMA Series: I'm a comparative psychologist that helped octopuses, lobsters, and their relatives be recognized in the UK as sentient beings. (See video of my cuttlefish \"marshmallow test\" self-control study in description.) AMA!",
  "created_utc": 1646232103,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi! I&amp;#39;m Dr. Alex Schnell, a Research Fellow from Darwin College at the University of Cambridge. I&amp;#39;m a comparative psychologist interested in the behaviour and mental processes of animals. More specifically, I investigate learning, memory, and self-control in mainly cephalopods (e.g. octopuses and cuttlefish). My findings have contributed to our understanding of the evolution of complex cognition and how certain cognitive abilities may have arisen independently in invertebrate taxa. 2021 was a productive year. Two of my papers showing that cuttlefish have both &lt;a href=\"https://royalsocietypublishing.org/doi/10.1098/rspb.2020.3161\"&gt;self-control&lt;/a&gt; and what&amp;#39;s termed []&amp;quot;episodic-like&amp;quot; memory](&lt;a href=\"https://royalsocietypublishing.org/doi/10.1098/rspb.2021.1052\"&gt;https://royalsocietypublishing.org/doi/10.1098/rspb.2021.1052&lt;/a&gt;) were the &lt;a href=\"https://twitter.com/RSocPublishing/status/1475451741298728968\"&gt;Royal Society&amp;#39;s fifth-&lt;/a&gt; and &lt;a href=\"https://twitter.com/RSocPublishing/status/1475089076143468545\"&gt;sixth-most&lt;/a&gt;-talked-about papers, respectively. &lt;a href=\"https://youtu.be/m0CZ6quPyls\"&gt;Watch VIDEO of cuttlefish pass the &amp;quot;marshmallow test&amp;quot; here!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I was also part of a team at the London School of Economics and Political Science that reviewed the evidence of sentience (the capacity to experience emotions) in both cephalopods and decapods (e.g. crabs, shrimp, lobsters). &lt;a href=\"https://www.lse.ac.uk/News/Latest-news-from-LSE/2021/k-November-21/Octopuses-crabs-and-lobsters-welfare-protection\"&gt;Our central recommendation&lt;/a&gt;, which is now being implemented, was to include both these groups of invertebrates in the UK Sentience Bill. This means, for the first time, these groups will be protected under animal welfare law.&lt;/p&gt;\n\n&lt;p&gt;My career purpose has been to further our understanding of the remarkable behaviours of animals in the hope that I might inspire more people to appreciate the incredible wonder of animal life on Earth. When people understand nature, they are more motivated to preserve it, research shows.&lt;/p&gt;\n\n&lt;p&gt;I joined the University of Cambridge as a Visiting Researcher in 2016 and became a Research Fellow in 2018.  Prior to Cambridge, in 2007, I obtained a B.A. in Marine Science at the University of Sydney. In 2015, I completed my Ph.D. on the behavioural ecology of giant cuttlefish at Macquarie University. I then held several post-doctoral positions with my experimental research based at a leading cephalopod research facility, the Marine Biological Laboratory in Massachusetts. My postdoctoral research focused on different aspects of cuttlefish cognition including perception, learning, and memory. I also won a prestigious Grass Fellowship in Neuroscience, a program that supports early career researchers to bridge the gap between neuroscience and behaviour. I&amp;#39;ve also worked as a BBC series researcher for Planet Earth III and Life of Mammals II, and my work was featured in a &lt;a href=\"https://youtu.be/m0CZ6quPyls\"&gt;NOVA PBS digital documentary on YouTube&lt;/a&gt;. Most recently, I worked for Wild Space Productions and Freeborne Media to produce a major new series for Netflix entitled &amp;#39;Oceans.&amp;#39; My aim in these roles was to highlight new findings on animal behaviour to give the public a new dimension for understanding wildlife. I&amp;#39;ll be on in the afternoon (ET), AMA!&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/novapbs\"&gt;/u/novapbs&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/askscience/comments/t4ym5r/askscience_ama_series_im_a_comparative/",
  "subreddit": "askscience",
  "id": "t4ym5r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi! I'm Dr. Alex Schnell, a Research Fellow from Darwin College at the\nUniversity of Cambridge. I'm a comparative psychologist interested in the\nbehaviour and mental processes of animals. More specifically, I investigate\nlearning, memory, and self-control in mainly cephalopods (e.g. octopuses…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは！私はダーウィン・カレッジの研究員、アレックス・シュネル博士です。\nケンブリッジ大学 私は、比較心理学者として、生物学に興味を持っています。\n動物の行動と心理プロセス 具体的には、以下のようなことを研究しています。\n主に頭足類（タコなど）における学習、記憶、自己制御。",
      "title": "AskScienceのAMAシリーズ。私は比較心理学者で、タコやロブスター、およびその近縁種が英国で感覚を持つ生物として認められるよう手助けをしました。(説明文中にある私のイカの「マシュマロ・テスト」自制心研究のビデオをご覧ください）。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨！我是亚历克斯-施奈尔博士，剑桥大学达尔文学院的研究人员。\n剑桥大学达尔文学院的研究员。我是一名比较心理学家，对以下方面感兴趣\n对动物的行为和心理过程感兴趣。更具体地说，我研究\n学习、记忆和自我控制，主要是头足类动物（如章鱼）。",
      "title": "AskScience AMA系列。我是一名比较心理学家，帮助章鱼、龙虾和它们的亲属在英国被承认为有生命的人。(见描述中我的墨鱼 \"棉花糖测试 \"自我控制研究的视频)。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨！我是亞歷克斯-施奈爾博士，劍橋大學達爾文學院的研究人員。\n劍橋大學達爾文學院的研究員。我是一名比較心理學家，對以下方面感興趣\n對動物的行爲和心理過程感興趣。更具體地說，我研究\n學習、記憶和自我控制，主要是頭足類動物（如章魚）。",
      "title": "AskScience AMA系列。我是一名比較心理學家，幫助章魚、龍蝦和它們的親屬在英國被承認爲有生命的人。(見描述中我的墨魚 \"棉花糖測試 \"自我控制研究的視頻)。AMA!"
    }
  ]
}