{
  "author": "Stye88",
  "the_new_excerpt": "If you have a bit of nostalgia for early internet before it got whored out to\ngovs and corporations, where there were no boomers/facebook Karens and\ninfluencers, just nerds on websites with absolute atrocious design if any and\ndegen forums you better realize this is the short lived state that defi…",
  "original_created_utc": 1623415229,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが、政府や企業に売られる前の初期のインターネットに少しでもノスタルジーを感じるならば\n政府や企業に買収される前のインターネットの初期を少しでも懐かしむことができれば、そこには団塊の世代やフェイスブックのカレンやインフルエンサーはおらず\n政府や企業に引き抜かれる前のインターネットの初期を少しでも懐かしく思うなら、ブームやフェイスブックのカレンジャーやインフルエンサーがいなくて、オタクが絶対的にひどいデザインのウェブサイトや\ndegenのフォーラムでは、このような短命な状態が定義されていることを理解した方がいいでしょう。",
      "title": "インターネットの黎明期を懐かしむなら、今すぐにでもDeFiを大切にした方がいい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你对早期互联网有一点怀念，在它被卖给政府和公司之前\n如果你对早期的互联网有点怀念，在它被卖给政府和公司之前，没有潮人/facebook Karens和\n影响力的人，只有网站上的书呆子，如果有的话，也是绝对糟糕的设计。\n你最好意识到这是一个短暂的状态，它决定了你的生活。",
      "title": "如果你怀念互联网的早期，你最好现在就珍惜DeFi的tf，因为它不会永远持续。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你對早期互聯網有一點懷念，在它被賣給政府和公司之前\n如果你對早期的互聯網有點懷念，在它被賣給政府和公司之前，沒有潮人/facebook Karens和\n影響力的人，只有網站上的書呆子，如果有的話，也是絕對糟糕的設計。\n你最好意識到這是一個短暫的狀態，它決定了你的生活。",
      "title": "如果你懷念互聯網的早期，你最好現在就珍惜DeFi的tf，因爲它不會永遠持續。"
    }
  ],
  "title": "If you miss the early years of the internet you better cherish tf out of DeFi right now as it won't last forever.",
  "created_utc": 1623426220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you have a bit of nostalgia for early internet before it got whored out to govs and corporations, where there were no boomers/facebook Karens and influencers, just nerds on websites with absolute atrocious design if any and degen forums you better realize this is the short lived state that defi is going through right now but you can bet it won&#39;t last. </p>\n\n<p>The fact that only a handful of regulators understand the extent of defi gives it still some room of absolutely unregulated freedom. Regulators are going after ICOs not even realizing IDOs, IFOs and all other non-KYC ways of bringing investors to a market start popping up. Enjoy those as it might not last forever that you&#39;ll be able to invest in a project based solely on your own risk tolerance. Sooner or later SEC or something else will come to protect you as an investor and guarantee you can only participate in approved offerings. </p>\n\n<p>Doesn&#39;t matter what projects you choose, but do cherish the freedom of choice and digital movement you are enjoying right now.</p>\n</div><!-- SC_ON -->",
  "score": 1048,
  "permalink": "/r/CryptoCurrency/comments/nxf1f1/if_you_miss_the_early_years_of_the_internet_you/",
  "subreddit": "CryptoCurrency",
  "id": "nxf1f1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009737340
}