{
  "author": "Geddy87",
  "original_created_utc": 1634093189,
  "title": "I’m going all in on ETHEREUM, I believe it has the best cost to potential ratio",
  "created_utc": 1634103197,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I Understand the reasoning behind diversification, but I don’t want to have my money spread thin on a bunch of what if’s. </p>\n\n<p>I truly bet ETHEREUM is going to make a solid climb in the next 6-12 months and be 5-6x the price in 5 years, it has so much potential and utility and I think the high gas fees right now are the main thing stopping it’s meteoric rise; with the implementation of 2.0 in the near future (insert joke about how long it’s taken here ) the gas fees will drop off substantially and the sky is the limit then. </p>\n\n<p>I’ve converted my other holdings into ETH already and will continue to DCA weekly. </p>\n\n<p>Good luck to fellow ETH holders</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/q71uuy/im_going_all_in_on_ethereum_i_believe_it_has_the/",
  "subreddit": "CryptoCurrency",
  "id": "q71uuy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I Understand the reasoning behind diversification, but I don’t want to have my\nmoney spread thin on a bunch of what if’s.\n\nI truly bet ETHEREUM is going to make a solid climb in the next 6-12 months and\nbe 5-6x the price in 5 years, it has so much potential and utility and I think\nthe high gas fees…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "分散投資の理由は理解できますが、もしもの時のために資金を薄くしたくはありません。\nしかし、もしもの時のために資金を薄くしたくはありません。\n\n私はETHEREUMが今後6-12ヶ月の間に確実に上昇し、5年後には価格が5-6倍になることを確信しています。\n5年後には5-6倍の価格になっていると思います。それだけの可能性と実用性を秘めています。\nガス料金が高いのは・・・。",
      "title": "私はETHEREUMに全力を尽くしています、コスト対ポテンシャル比が最も高いと信じています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解分散投资的理由，但我不想把我的钱分散在一堆万一上。\n的钱分散在一堆万一上。\n\n我真的打赌，ETHEREUM将在未来6-12个月内实现稳固的攀升，并在5年内达到5-6倍的价格。\n5年内价格会翻5-6倍，它有如此大的潜力和效用，我认为\n高昂的天然气费用...",
      "title": "我将全部投入ETHEREUM，我相信它有最好的成本和潜力比率。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解分散投資的理由，但我不想把我的錢分散在一堆萬一上。\n的錢分散在一堆萬一上。\n\n我真的打賭，ETHEREUM將在未來6-12個月內實現穩固的攀升，並在5年內達到5-6倍的價格。\n5年內價格會翻5-6倍，它有如此大的潛力和效用，我認爲\n高昂的天然氣費用...",
      "title": "我將全部投入ETHEREUM，我相信它有最好的成本和潛力比率。"
    }
  ]
}