{
  "author": "DaddySkates",
  "original_created_utc": 1638438280,
  "title": "What is the essential life-hack in cryptoverse that you want to share with newbies",
  "created_utc": 1638449295,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We’ve all been newbies at one point and in our community it’s important to share the knowledge. Thats why I am wondering what is your best lifehack in crypto that you would like to share with new people and veterans here alike. &lt;/p&gt;\n\n&lt;p&gt;In a year since Ive been here I found out a lot of stuff that made my life in crypto easier. &lt;/p&gt;\n\n&lt;p&gt;The one I want to emphasize is bookmarking the addresses of the exchange you are using or the defi sites that you use. There are a lot of scam sites nowadays and its very easy to mistype coimbase or bibance or whatever. &lt;/p&gt;\n\n&lt;p&gt;What are your lifehacks that youd like to share?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 199,
  "permalink": "/r/CryptoCurrency/comments/r73vlj/what_is_the_essential_lifehack_in_cryptoverse/",
  "subreddit": "CryptoCurrency",
  "id": "r73vlj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We’ve all been newbies at one point and in our community it’s important to share\nthe knowledge. Thats why I am wondering what is your best lifehack in crypto\nthat you would like to share with new people and veterans here alike.\n\nIn a year since Ive been here I found out a lot of stuff that made my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、一度は初心者になったことがあり、私たちのコミュニティでは、その経験を共有することが重要です。\n知識を得ることができます。そこで、暗号に関するあなたの最高のライフハックは何でしょうか？\n新入社員やベテラン社員と共有できるようなことを教えてください。\n\n私はここに来てから1年間で、多くのことを発見し、私の...",
      "title": "初心者に伝えたい、クリプトバースの必須ライフハックとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都曾是新手，在我们的社区中，分享知识是很重要的。\n的知识。这就是为什么我想知道你在加密货币方面最好的生活窍门是什么？\n你想与新人和老手分享的最佳生活秘诀。\n\n在我来到这里的一年里，我发现了很多东西，使我的生活变得更加美好。",
      "title": "你想与新手分享的加密世界中必不可少的生活秘诀是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都曾是新手，在我們的社區中，分享知識是很重要的。\n的知識。這就是爲什麼我想知道你在加密貨幣方面最好的生活竅門是什麼？\n你想與新人和老手分享的最佳生活祕訣。\n\n在我來到這裏的一年裏，我發現了很多東西，使我的生活變得更加美好。",
      "title": "你想與新手分享的加密世界中必不可少的生活祕訣是什麼？"
    }
  ]
}