{
  "author": "CortexExport",
  "the_new_excerpt": "Disclaimer: I am not saying gas cars are the future. I am saying GM, Ford,\nToyota, VW, etc are all switching to EV. Every single gas car manufacturer will\nalso offer EV within a few years, if not already, today.\n\nFor those who think Tesla is the only game in town, I guess you have not heard\nof…",
  "original_created_utc": 1614981246,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "声明：我并不是说汽油车是未来。我是说通用、福特。\n丰田、大众等都在改用电动车。每一个汽油车制造商都会\n也在几年内提供电动汽车，如果不是已经，今天。\n\n对于那些认为特斯拉是唯一的游戏在城里，我想你还没有听到\n的...",
      "title": "我相信电动车股票从长远来看是注定的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聲明：我並不是說汽油車是未來。我是說通用、福特。\n豐田、大衆等都在改用電動車。每一個汽油車製造商都會\n也在幾年內提供電動汽車，如果不是已經，今天。\n\n對於那些認爲特斯拉是唯一的遊戲在城裏，我想你還沒有聽到\n的...",
      "title": "我相信電動車股票從長遠來看是註定的。"
    }
  ],
  "title": "I believe EV stocks are doomed in the long run.",
  "created_utc": 1614999375,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Disclaimer:  I am not saying gas cars are the future.  I am saying</strong>  GM, Ford, Toyota, VW, etc <strong>are all switching to EV.  Every single gas car manufacturer will also offer EV within a few years, if not already, today.</strong></p>\n\n<p>For those who think Tesla is the only game in town, I guess you have not heard of <strong>Nissan Leaf, Audi eTron, Volvo XC40, Ford Mustang MachE, Chevy Bolt, Hyundai Kona and Ioniq.</strong></p>\n\n<p>An electric motor is an appliance feature like cruise control.</p>\n\n<p>All current existing car makers will eventually offer EV and it will be a non-event.</p>\n\n<p>You don’t get a 1000 PE for a car b/c it has cruise control.</p>\n\n<p>You think an EV maker will have a 1000 PE ratio a few years from now?</p>\n\n<p>Car makers have a PE of 8.   <strong>Eight.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>All these Pets.com EV stocks are doomed in the long run.</p>\n\n<p>5 years from now, these prices will seem high!</p>\n\n<p>&#x200B;</p>\n\n<p>Edit:  I am not saying gas cars are the future.  I am saying gas car markers are all switching to EV.  Every single car manufacturer will also offer EV within a few years.</p>\n</div><!-- SC_ON -->",
  "score": 255,
  "permalink": "/r/stocks/comments/lymvcn/i_believe_ev_stocks_are_doomed_in_the_long_run/",
  "subreddit": "stocks",
  "id": "lymvcn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576952
}