{
  "author": "EdHistory101",
  "original_created_utc": 1635771672,
  "title": "Megathread: Roe v. Wade and abortion in America",
  "created_utc": 1635780515,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On June 8th, 1964, an employee at the Norwich Motel in Norwich, Connecticut opened the door to one of the rooms and discovered an unresponsive woman kneeling on the floor, her cheek pressed to the carpet, bloody sheets and towels between her legs. When the police and ambulance arrived, they declared the woman dead and began collecting evidence, including medical equipment and a textbook. Geraldine &quot;Gerri&quot; Santoro’s daughters would be told that she died in a car accident, not knowing until they were older their mother had recently left their father and was pregnant at the time of her death. Much later, her daughters and sister would learn Gerri had been worried her husband would react violently if he found out she was pregnant and had rented the hotel room with her boyfriend, Clyde Dixon, intending to self-induce an abortion. According to his testimony during his trial for manslaughter, Dixon used the textbook to teach himself the procedure and panicked when Gerri began to hemorrhage. He fled. He would eventually serve a year in prison for manslaughter. The man who provided him the textbook was charged with “conspiring to commit an abortion.” Almost ten years later, in April 1973, just months after the ruling in the affirmative for Roe, Ms. magazine published a photograph of Gerri taken by the police, showing her just as the maid found her. The article with the photograph was titled simply, &quot;Never Again.&quot; </p>\n\n<h1><strong>Context for this Post</strong></h1>\n\n<p>The theme for this megathread was first proposed to the AskHistorians flair community in September, shortly after the United States Supreme Court announced it would hear arguments in <em>Thomas E. Dobbs, State Health Officer of the Mississippi Department of Health v. Jackson Women&#39;s Health Org</em> on December 1st. The plan was we’d have several months to find an approach to the topic, organize our thinking, and craft a concise but thorough history for interested members of the AH community. But then, on October 22nd, the Supreme Court announced they would hear arguments regarding Texas Senate Bill 8 today, November 1st. It is generally acknowledged in the legal and reproductive justice community that a ruling for Mississippi in the <em>Dobbs</em> case – or a ruling for Texas in <em>United States v. Texas</em> – will overturn the key ruling of <em>Roe v. Wade</em>, ending pregnant people’s constitutional protections regarding abortion. This will mean that a person’s right to obtain an abortion will depend on the laws in individual states. Included in the decision to hear arguments in <em>United States v. Texas</em>, Justice Sonya Sotomayor <a href=\"https://www.supremecourt.gov/opinions/21pdf/21a85_5h25.pdf\">expressed her opinion</a> about the majority ruling to keep the law in place until a final decision is made:</p>\n\n<blockquote>\n<p>I cannot capture the totality of this harm in these pages. …The State’s gambit has worked. The impact is catastrophic. These ruinous effects were foreseeable and intentional… These circumstances are exceptional.</p>\n\n<p>… Once again, I dissent.</p>\n</blockquote>\n\n<p>In the spirit of urgency expressed by Justice Sotomayor, we moved up our timeline to have this post and megathread available to members of the AH community as the arguments in <em>United States v. Texas</em> begin. Just like previous megathreads, we welcome top-level questions about the topic, which in this case is the legal and social history of abortion in America. While we do not have any flairs with this particular specialty, there are members of the community who can speak to different aspects of the history. Anyone is welcome to ask or answer questions, provided the comment meets our standards (<a href=\"https://www.reddit.com/r/AskHistorians/wiki/rules\">an explanation of our rules</a>). Please note that comments that are nothing more than a user’s opinion on abortion or people who seek out or provide them, will be removed. Users who break our rules around civility will be banned. </p>\n\n<p>Many thanks to <a href=\"/u/ghostofherzl\">u/ghostofherzl</a>, <a href=\"/u/PhiloSpo\">u/PhiloSpo</a>, <a href=\"/u/HillSonghood\">u/HillSonghood</a>, <a href=\"/u/aquatermain\">u/aquatermain</a>, <a href=\"/u/SarahAGilbert\">u/SarahAGilbert</a>, and the other mods and flairs who gave their time and feedback to earlier drafts of this post. If you’re interested in a history of abortion outside the United States, <a href=\"https://www.reddit.com/r/AskHistorians/comments/o316vw/in_philip_freemans_collection_of_irish_legends/h2d6gea/?context=3\">this answer</a> by <a href=\"/u/Kelpie-cat\">u/Kelpie-cat</a> provides a recounting of abortion in Ireland. <a href=\"https://www.reddit.com/r/AskHistorians/comments/5lvsv1/how_were_people_not_constantly_impregnated_during/\">This</a> from <a href=\"/u/Sunagainstgold\">u/Sunagainstgold</a> gets into abortion in Europe during the Middle and early modern Ages as does <a href=\"https://old.reddit.com/r/AskHistorians/comments/brdb9e/i_keep_hearing_prochoice_people_say_harsh/\">this one</a>. <a href=\"https://old.reddit.com/r/AskHistorians/comments/7yv55h/why_were_the_assyrians_so_opposed_to_abortion/\">This question</a> about Assyrians and abortion got several answers. Finally, <a href=\"https://www.reddit.com/r/AskHistorians/comments/635p76/did_the_ussr_suffer_from_a_reverse_baby_boom_a/dfrmlo2/\">this answer</a> from <a href=\"/u/Georgy_K_Zhukov\">u/Georgy_K_Zhukov</a> focuses on abortion in the Soviet Union.</p>\n\n<h1><strong>Background</strong></h1>\n\n<p>When we look at the history of abortion in America, there are generally three groups of people who are part of the historical record: people who can and did get pregnant, those who support pregnant people (midwives, healers, doctors, clergy, etc.), and lawmakers (judges, police, legislatures, etc. - almost exclusively cis white men until the modern era.)  Before getting into how these groups interacted, it’s helpful to start with language. First, as panel members during the AH conference session <a href=\"https://old.reddit.com/r/AskHistorians/comments/qbdy27/the_lie_became_the_truth_locating_trans/\">The Lie Became the Truth: Locating Trans Narratives in Queer History</a> demonstrated, trans and non-binary people have always existed. The history of abortion in America includes them; they are a part of the history. Not only have trans, non-binary, and Two-Spirit people needed and sought out abortions, using only the word women to describe those who got abortions ignores or disregards the girls who have gotten pregnant and needed or wanted an abortion. As such, it’s not only more inclusive but also more precise and historically accurate to talk about people who can get or have been pregnant. For more on the queering of abortion rights, see this 2018 article from Barbara Sutton and Elizabeth Borland, <a href=\"https://www.tandfohnline.com/doi/abs/10.1080/13691058.2018.1437221\"><em>Queering abortion rights: notes from Argentina.</em></a></p>\n\n<p>Next is the word <em>abortion</em> itself. Historian Sara Dubow, author of <a href=\"https://amzn.to/2XZPSiO\">Ourselves Unborn: A History of the Fetus in Modern America</a> begins her book by explaining to the reader that a:</p>\n\n<blockquote>\n<p>fetus in 1870 is not the same thing as a fetus in 1970, which is not the same thing as a fetus in 2010. Although multiple and competing fetuses have always coexisted, particular historical circumstances have generated and valorize different stories about the fetus. (p. 3) </p>\n</blockquote>\n\n<p>While the boundaries are not clean and discrete, it’s important to recognize there are multiple histories of abortion in America; that the social and legal history related to enslaved people’s bodily autonomy, access to contraception and abortion, and infanticide is different than the histories of abortion in Indigenous communities. In addition, the cultural and social norms around abortion varied between and among Indigenous communities and before and after colonization. These different definitions shape the meaning of the word and how the concept itself is viewed by a community or a particular group of people. In most histories of abortion in America, the focus is on white women. Yet, even for them, the meaning of the word, and the act itself, varied based on class, geographical location, and time period. (Historian Rickie Solinger describes these different yet interrelated histories and experiences as “reproductive politics.” Her book, <em>Pregnancy and Power</em> speaks to the question, “Who has power over matters of pregnancy and its consequences?”) So, while a reader in 2021 may think of a particular thing upon hearing the word, it’s important to stress that what we call an abortion hasn’t always been considered an abortion.</p>\n\n<h1><strong>Abortion in Early America</strong></h1>\n\n<p>As a way to better understand how the meaning of the word itself has changed and to find a starting place for the history, let&#39;s take the scenario of an American woman in 1780. While going about her business, she realizes that more weeks than normally pass have passed since the last time her uterus shed its lining, or as we think of it today, since her last period. (<a href=\"https://amzn.to/3EsQ35O\"><em>Revolutionary Conceptions: Women, Fertility and Family Limitations in America, 1760-1820</em></a> by Susan E. Klepp provides an in-depth look at what that woman may have been feeling and thinking upon that realization.) The most pressing problem at hand is her health, not if she’s pregnant. More specifically, she would be concerned that her body was out of balance. The prevailing thinking at the time – from laypeople, midwives, and leading medical professionals – was that a late or delayed period could indicate an illness that needed to be treated. At this point, she had two options: wait or treat the illness. For the sake of clarifying the meaning of the term <em>abortion</em> as it was used during that era, let’s say this woman sought out a local midwife or healer to fix the problem of “blocked menses.” She may have also consulted one of the many available medical or household guides which would recommend a variety of ways to bring on one’s period, including warnings about quantity and side effects. What she would want is known as an <em>emmenagogues</em>, an herb that stimulates bleeding or contractions in the uterus, which would, in effect, restart her period. While there were a number of wild and cultivated herbs with varying side effects for the person taking them, one of the most common means of inducing an abortion was savin, created from drying and powdering the leaves of or extracting oil from a juniper plant. (According to James C. Mohr, author of <em>Abortion in America: The Origins and Evolution of National Policy</em>, accidental overdoses of savin were common throughout American history. His findings remind us that abortion has always been a part of health care.)</p>\n\n<p>If the woman ingested the savin and her period started, all was well – her health had been restored, her menses unblocked. Even though she’d taken something classified today as an abortifacient, she had not gotten an abortion – even if she had been pregnant. In other words, doing something to bring on one’s period was not considered an abortion. (There were some religious exemptions to this but that’s outside the scope of this post. Cornelia Hughes Dayton’s 1991 article, <a href=\"https://www.jstor.org/stable/2937996\"><em>Taking the Trade: Abortion and Gender Relations in an Eighteenth-Century New England Village</em></a> is a very detailed look at the death of one particular woman following a botched surgical abortion and explores the religious implications in more depth. “Taking the trade” was the most common phrase for taking something to unblock one’s menses.) However, let’s say instead she waited until the next month. If her period restarted with no intervention, she had evidence her body was back in balance.</p>\n\n<p>Let’s say she waits one more month and nothing happens. Her body is still out of balance and she may still elect to seek out ways to unblock her menses. However, if she waited a bit longer, somewhere around four or five months after the first missed period, she might receive her confirmation that she wasn’t ill, but pregnant (it’s estimated that 20% of pregnancies end due to spontaneous abortion, or miscarriage - <a href=\"https://amzn.to/2ZCcaHI\"><em>The Myth of the Perfect Pregnancy: A History of Miscarriage in America</em></a> by Lara Freidenfelds is a fantastic read on the topic). This confirmation was known as <em>quickening</em>, when the pregnant person reported feeling fetal movement. She may have had other indicators of pregnancy – nausea, fatigue, swollen breasts, etc. but it was generally recognized that the quickening was the moment at which the pregnancy was officially confirmed. If at this point, she sought out the same midwife and asked for something to bring on her flow, she would then be, as defined at the time, seeking out an abortion. However, getting an abortion or terminating a pregnancy after the quickening was not necessarily illegal and for most white people who could get pregnant, was seen as a form of birth control with social implications more in line with other forms reducing the number of children a person has and less like it was framed by the pro-life movement in 20th century, as the “murder of an unborn child.” </p>\n\n<p>In many ways, the sentiment around abortion in white communities for most of American history was very different than it is today. Obtaining or providing an abortion happened in public; ads for abortion providers were common in newspapers in the 1800s and early 1900s. Perhaps the most significant difference was the disconnect from partisanship. That is, positions on abortion laws were not a proxy for political parties and prevailing sentiments around miscarriage and abortion were more complex and more nuanced than they are today. However, as a reminder, despite the use of <em>we the people</em> in the Constitution, nearly all people who were not white men were excluded from the spaces that determined the laws and policies around American life until well into the 20th century. Which is to say, as we move into a discussion of laws banning abortion, it’s important to remember that the discussions and lawmaking structures were designed, driven, dominated, and shaped by people who cannot get pregnant. This is not to say people who can get pregnant were not instrumental in anti-abortion advocacy and the work of historians such as Elizabeth Gillespie McRae in <a href=\"https://amzn.to/3brvuu8\"><em>Mothers of Massive Resistance: White Women and the Politics of White Supremacy</em></a>, Daniel K. Williams in <a href=\"https://amzn.to/3pWi9SX\"><em>Defenders of the Unborn: The Pro-Life Movement before Roe v. Wade</em></a>, <a href=\"https://www.press.uillinois.edu/books/?id=p082467\">Women against Abortion: Inside the Largest Moral Reform Movement of the Twentieth Century</a> from Karissa Haugeberg and <a href=\"https://amzn.to/3wdzwQx\"><em>The Lie that Binds</em></a> project from Ellie Langford and Ilyse Hogue explore their role in more depth. </p>\n\n<p>One of the reasons it’s important we distinguish between the history of abortion among white women and women of color is that for most enslaved people who could get pregnant, their status as a parent or a potential parent often came down to how their enslaver thought of the children they might bear. <a href=\"https://amzn.to/3bnlAtz\"><em>Killing the Black Body</em></a> by Dorothy Roberts offers a detailed look at enslaved women and their reproductive decisions, including the different ways courts handled infanticide and the essay <a href=\"https://www.ncbi.nlm.nih.gov/books/NBK425854/\"><em>Native American Health: Historical and Legal Context</em></a> provides more context on the factors that impacted Indigenous people. For more on white women’s sense of identity related to motherhood, Barbara Welter’s <a href=\"https://www.jstor.org/stable/2711179\"><em>The Cult of True Womanhood: 1820-1860</em></a> makes for an interesting read. Finally, Nicola Beisel and Tamara Kay’s article <a href=\"https://journals.sagepub.com/doi/10.1177/000312240406900402\"><em>Abortion, Race, and Gender in Nineteenth-Century America</em></a> provides even more context on the topic.</p>\n\n<h1><strong>1850s - 1960s</strong></h1>\n\n<p>It’s generally recognized that the first meaningful laws related to abortion emerged in the mid-1800s as abortifacients became increasingly commercialized. Just as general medicine was moving into a snake oil phase, so did medicines related to menstruation, abortion, and childbirth. One common sentiment at the time was the worse a person’s reaction to a medicine, the better the cure was working. Manufacturers added ingredients that increased the side effects experienced by the person taking the treatment, often eliminating the abortifacients themselves and basically poisoning the person taking the “trade.” These early laws were primarily focused on poison control; they did not seek to punish the pregnant person. In addition, they did not outlaw or ban particular herbs themselves. In other words, midwives and healers could still grow, harvest, and administer plants that could induce an abortion. As these plants could also help ease delivery or resolve an incomplete miscarriage, they were an essential part of maternal health. It’s also worth stating explicitly that these early laws did not seek to overrule a pregnant person’s autonomy or limit other means of completing or resolving an abortion, only those that were known to poison the pregnant person if taken in incorrectly or in the wrong dosage. This would no longer be the case by the end of the 19th century.</p>\n\n<p>By 1867, every state had a law making some aspect of obtaining or providing an abortion illegal. However, as previously mentioned, these laws did not eliminate abortions. Historians estimate that between 1867 and 1973, the period of time abortion was a crime, upwards of 25% of pregnancies ended through abortion. Or as legal historian <a href=\"https://www.c-span.org/video/?455127-1/legal-history-abortion-us\">Haugeberg</a> puts it, “it was a commonly practiced procedure, even though practiced criminally.” Yet, not all of the laws fully banned abortion. Lawmakers in Oregon held that an “unnecessary” abortion only became a crime when it, “results in the death of the mother, or of a quick foetus [a fetus after the point at which the pregnant person reports movement.].” Alabama had a similar law and Nebraska’s law was focused on cracking down on entrepreneurs selling abortion cures that were actually poison. Meanwhile, the degree to which states acted on these laws, even lawmakers within the same state, varied wildly, especially during the Great Depression when many parents were struggling to care for the children they already had. However, the public sentiment shifted in the 1950s as America experienced a baby boom and lawmakers began to crack down on abortion providers. </p>\n\n<p>Before World War II, a pregnant person with social connections could typically obtain a legal, safe abortion provided their doctor agreed it was medically necessary. As reproductive health services became less personalized, more clinical, it became harder for pregnant people to find a medical professional who was willing to certify their abortion was necessary. A pregnant person could plead their case in front of a panel at a hospital but it would require going public with the pregnancy. As safe and legal abortions became harder and harder to obtain, many communities created whisper networks and collectives, such as the <a href=\"https://www.wnycstudios.org/podcasts/takeaway/segments/roe-v-wade-there-was-jane-collective\">Jane Collective</a> in Chicago, that could connect pregnant people with a safe abortion provider. It also meant an increase in abortion providers who were more interested in financial benefits than reproductive health. It’s worth noting that many of these networks were led or otherwise supported by members of the clergy who were most likely to see the consequences of unsafe abortions on a community or family. During this period, those most likely to die from botched abortions were women and girls of color. In some cities, hospitals had to establish sepsis wards to treat those who contracted life-threatening infections following an unsafe abortion.</p>\n\n<p>In terms of the thinking behind outlawing abortion despite its presence in society and its role in healthcare, historians offer a variety of reasons. First, the American Medical Association (AMA) expressed a strong desire to move maternal and all healthcare related to pregnancy away from midwives, who were typically women trained through social networks and traditional apprenticeships, under a medical model they could control. Banning all abortions except those deemed “medically necessary” meant doctors, not midwives or the pregnant person, could control who got or performed - and who got paid for - an abortion. Second, according to historians including Beisel and Kay, white Americans in positions of power were worried about birth rates. In effect, they saw laws against abortion as a way to ensure the right (native-born, non-immigrant) kind of white babies were born and concurrent laws that allowed for the forced sterilization of Black and Indigenous women, white women deemed unworthy of raising children, as a way to ensure fewer undesirable babies were born. Third, it was about controlling women at a time when there was a sense they were “out” of control as seen in efforts to obtain the vote for women and increased access to higher education. When male legislatures passed laws outlawing abortion, it provided a way for them to control what was seen as the most fundamental purpose of womanhood: bearing children. From Kathryn Kolbert and Julie Kay:</p>\n\n<blockquote>\n<p>at its core, the abortion debate is an embodiment of the conflict between traditional and more modern concepts of gender roles. In its darkest corners, the abortion debate is about controlling when and with whom sex is appropriate, and when and with whom one has babies. A woman is unfairly branded by the sexual and procreative decisions she makes: married or spinster, saint or sinner, madonna or whore, selfless mother or welfare queen. (p. 9) </p>\n</blockquote>\n\n<p>While the death toll from botched abortions did go down as antibiotics became more readily available, efforts to decriminalize abortion began in the mid-1960 in states such as Colorado and New York State. Most notably, the AMA which had previously pushed to outlaw abortion changed its position and advocated for legal, safe abortion as a part of maternal health care. In the late-60s, a team of lawyers, including Sarah Weddington, connected with a Texas woman named Norma McCorvey who wanted an abortion. Weddington would go on to argue on behalf of her client McCorvey, then known by the pseudonym, Jane Roe, that there was a constitutional right to an abortion. Weddington was only 29 years old at the time, making her the youngest person to ever argue a case in front of the Supreme Court.</p>\n\n<h1><strong><em>Roe v. Wade</em> (1973)</strong></h1>\n\n<p>The legal decision in <em>Roe v. Wade</em> took place against a backdrop of contentious debate, and the previously described shift in public opinion favoring abortion. While the Court agreed to hear <em>Roe</em> in 1970, it was almost two years before the Court heard arguments in the case, and it took 27 months from the filing of the case to the decision being issued. Justice Blackmun, the author of the opinion, was heavily influenced by his attempts to conduct medical research during this period, as well as discussions with his law clerks and other justices. He was also clearly aware of the shift in public opinion and medical advocacy, as his <em>Roe</em> files contained a Washington Post article that reported on one such poll. The poll, conducted in June 1972, found that 66% of Americans believed abortion should be “a matter for decision solely between a woman and her physician.&quot; He collected articles representing a variety of viewpoints, including from the American Journal of Public Health depicting abortion as inevitable as well as dissenting articles from practicing obstetricians and gynecologists. Nevertheless, the sharpening of public opinion and medical opinion on the issue seems to have added to Justice Blackmun’s thinking, and no doubt weighed on the Court. </p>\n\n<p>Abortions done without the care of an attending physician and without the cover of state law killed hundreds, and in some years, thousands of people. While such deaths became less common with time due to improved care, they still formed a large percentage of childbirth-related deaths, and hospitalizations remained high. The Court was navigating a shift in public opinion and a continuing public health question, which influenced Justice Blackmun’s ultimate analysis. In fact, Justice Blackmun explicitly referenced these shifts in medical, public, historical, and legal understanding when announcing the decision in Roe from the bench. The other Justices were no less interested in the backdrop for the case, and some credit Justice Brennan with significant influence over the final opinion. There are suggestions in Blackmun’s papers and other records that Brennan and Justice Marshall were influential in pushing the trimester framework to its final result, whereby state regulation before viability but after the first trimester would be restrained to only specific areas, rather than leaving states completely free to regulate abortion after the first trimester. They, along with Justice Powell, wrote to Justice Blackmun about the proper points at which regulation could begin, and thus ended up creating the trimester framework. All were to some extent aware of, and conscious of, public opinion and medical opinion on abortion procedures at various points during pregnancy. (The recent Broadway show, <em><a href=\"https://constitutionbroadway.com/\">What the Constitution Means to Me</a></em> from Heidi Schreck provides more background on the judges, as well as audio of them debating the question. <a href=\"https://us.macmillan.com/books/9780805080575/becomingjusticeblackmun\"><em>Becoming Justice Blackmun</em></a> by Linda Greenhouse is a compelled read on his life and decision-making process.) </p>\n\n<p>That analysis focused on whether a right to privacy, grounded in the due process clause of the Fourteenth Amendment, could be the basis for the right to an abortion. The right to privacy was not a new idea. It had been a key part of the decision in <em>Griswold v. Connecticut</em> over 7 years earlier, ruling ultimately that barring the use of contraceptives was unconstitutional. However, finding the right in the Fourteenth Amendment’s guarantee of liberty was new, and legal commentators of all opinions have expressed both support and disappointment in Justice Blackmun’s analysis. The opinion reasoned that the right to privacy could only be overcome by a “compelling” government interest if the state wished to regulate under the authority of its interest in health. Roe thus created the “trimester” framework that many are familiar with, albeit one that would shift subtly over time: during the first trimester, a pregnant person’s privacy right outweighed the state’s interest in regulating health but during the second trimester and onwards, the state’s interest could outweigh the pregnant person’s if legitimately tied to its regulation of health. <em>Roe</em> also made clear that beyond viability, which the Court believed was at 26 or 27 weeks (approximately when quickening occurred), a state could outlaw abortion because the interest in the “potentiality” of life outweighed the pregnant person&#39;s right to privacy.</p>\n\n<p>What <em>Roe</em> did not do, however, was affirm that the state had to facilitate or ensure pregnant people had access to abortion. By not affirming the right to abortion beyond the right to privacy or the state’s interest, by not affirming what we think of as bodily autonomy of pregnant people in the modern era, the ruling left space for a new approach to laws. <em>The Hyde Amendment</em>, which banned the use of federal dollars in funding or providing abortion services, took advantage of that lack of affirmation. In 1992, the Rehnquist court created via <em>Casey v. Planned Parenthood</em> a new litmus test for anti-abortion laws known as an &quot;undue burden&quot; defined as a &quot;substantial obstacle in the path of a woman seeking an abortion before the fetus attains viability.&quot; This allowed states to mandate wait times before an abortion, parental notification, mandatory transvaginal ultrasounds. and in some cases, required doctors to share misinformation with people seeking an abortion about the consequences of getting the service. States began to push the limits of anti-abortion laws until 2016 when <em>Whole Woman’s Health v. Hellerstedt</em> ended most of the so-called TRAP (targeted restrictions on abortion providers) laws such as requiring abortion-service providers be located in buildings that meet building requirements for ambulatory surgical centers or that doctors who work at the clinics have admitting privileges at a nearby hospital. Although <em>Hellerstedt</em> ruling was seen as an affirmation of <em>Roe v. Wade</em>, conservative lawmakers went back to the drawing board to find new ways to make abortion harder to get. </p>\n\n<h1><strong>Today</strong></h1>\n\n<p>So here we are, on the day the Supreme Court will hear arguments regarding <em>Dobbs</em> and <em>Texas</em>. Dobbs seeks to shut down the last remaining abortion provider in the state of Mississippi, the state which consistently has one of the highest maternal death rates in the country. Texas SB8 empowers private citizens to receive a $10,000 bounty if they can prove someone has performed an illegal abortion, or participated in providing the abortion. Due to the nature of the law, guns rights advocacy groups have signaled support for the <em>United States</em> in the case, pointing out that if the Court sanctions the law, the same reasoning could be used to against gun owners. Meanwhile, it also seeks to make abortions after six weeks illegal. Because conception itself is a multi-day process, doctors start the pregnancy “clock” on the date of a person’s last period. Under SB08, in order to get a legal abortion in Texas, people who can get pregnant will need to confirm their pregnancy, schedule, and get an abortion within two weeks of their first missed period.</p>\n\n<p>As of October 2021, 20 states have anti-abortion trigger bans (bans that take effect when/if <em>Roe v. Wade</em> is overturned) or zombie laws (anti-abortion laws that were never repealed following <em>Roe</em>, meaning if/when <em>Roe</em> is overturned, the state will revert to laws that were in place in 1973). Even if the Supreme Court’s decision on the cases they’re hearing today keeps <em>Roe</em> in place, they will have more opportunities with <a href=\"https://rewirenewsgroup.com/article/2021/10/12/these-5-cases-could-finish-off-abortion-rights-for-good-after-dobbs-v-jackson-womens-health/\">other cases</a> that are in the pipeline. In anticipation of a conservative ruling and the roll back of abortion rights, acting in the same vein as networks in the 1960s, reproductive justice groups are educating people who can get pregnant about <a href=\"https://nwhn.org/safe-online-delivered-how-to-get-the-abortion-pill-by-mail/\">safe means of self-inducing an abortion early in the pregnancy</a> or fundraising in order to provide people who want or need an abortion later in the pregnancy with the funds needed to <a href=\"https://states.guttmacher.org/\">travel out of state</a>. </p>\n\n<p>It&#39;s impossible to know what will happen as a result of today&#39;s session. Whatever decision the court makes, though, will occur in a country where, last month, Brittney Poolaw, an Indigenous woman, was found guilty of manslaughter and <a href=\"https://www.bustle.com/politics/brittney-poolaw-miscarriage-conviction\">sentenced to four years in prison</a> after experiencing a miscarriage. Where, earlier this summer, Kim Blalock was charged with felony fraud for taking hydrocodone that her doctor had prescribed to her while she was pregnant. Where, in the days and weeks following the passage of SB8, clinics in Oklahoma, Kansas and New Mexico reported a surge in patients. </p>\n\n<h1><strong><em>History doesn&#39;t repeat but it teaches. It enables [us] to envision the future--for better or worse--by revealing how the present echoes the past.</em></strong> Joanne Freeman, Historian</h1>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/AskHistorians/comments/qkdhi8/megathread_roe_v_wade_and_abortion_in_america/",
  "subreddit": "AskHistorians",
  "id": "qkdhi8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On June 8th, 1964, an employee at the Norwich Motel in Norwich, Connecticut\nopened the door to one of the rooms and discovered an unresponsive woman\nkneeling on the floor, her cheek pressed to the carpet, bloody sheets and towels\nbetween her legs. When the police and ambulance arrived, they declared…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1964年6月8日、コネチカット州ノリッチにあるノリッチ・モーテルの従業員が、ある部屋のドアを開けたところ、無反応の女性を発見しました。\n部屋のドアを開けると、無反応の女性が床にひざまづき\n床にひざまずき、頬をカーペットに押し付け、血まみれのシーツとタオルを股間に挟んでいました。\n股間には血のついたシーツやタオルが敷かれていました。警察と救急車が到着すると、彼らは宣言した。",
      "title": "メガスレッド アメリカでの妊娠中絶について"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1964年6月8日，康涅狄格州诺里奇市诺里奇汽车旅馆的一名员工\n打开其中一个房间的门，发现一个没有反应的女人\n跪在地板上，脸颊贴在地毯上，两腿之间有血淋淋的床单和毛巾。\n在她的两腿之间。当警察和救护车到达时，他们宣布...",
      "title": "巨型话题。罗伊诉韦德案和美国的堕胎问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1964年6月8日，康涅狄格州諾里奇市諾里奇汽車旅館的一名員工\n打開其中一個房間的門，發現一個沒有反應的女人\n跪在地板上，臉頰貼在地毯上，兩腿之間有血淋淋的牀單和毛巾。\n在她的兩腿之間。當警察和救護車到達時，他們宣佈...",
      "title": "巨型話題。羅伊訴韋德案和美國的墮胎問題"
    }
  ]
}