{
  "author": "SirGasleak",
  "the_new_excerpt": "Not long ago I posted some results from a study I did of IPOs dating back to\n2012 to see whether it made sense to buy IPOs on the IPO day or wait. I focused\non \"popular\" IPOs to capture the FOMO phenomenon with the highly anticipated\nIPOs. The result was clear that it almost always makes sense to…",
  "original_created_utc": 1609440163,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不久前，我发布了一些我对IPO的研究结果，这些研究可以追溯到2012年。\n2012年，看看在新股发行日买入新股是否有意义，还是等待。我把重点放在\n我专注于 \"热门 \"IPO，以捕捉备受期待的IPO的FOMO现象。\nIPO。结果很清楚，几乎总是有意义的。",
      "title": "重新审视购买IPO--2020年的一些数据"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不久前，我發佈了一些我對IPO的研究結果，這些研究可以追溯到2012年。\n2012年，看看在新股發行日買入新股是否有意義，還是等待。我把重點放在\n我專注於 \"熱門 \"IPO，以捕捉備受期待的IPO的FOMO現象。\nIPO。結果很清楚，幾乎總是有意義的。",
      "title": "重新審視購買IPO--2020年的一些數據"
    }
  ],
  "title": "Buying IPOs revisited - some 2020 data",
  "created_utc": 1609497756,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not long ago I posted some results from a study I did of IPOs dating back to 2012 to see whether it made sense to buy IPOs on the IPO day or wait.  I focused on &quot;popular&quot; IPOs to capture the FOMO phenomenon with the highly anticipated IPOs.  The result was clear that it almost always makes sense to wait 6-12 months because in a very high % of cases, the stocks dropped to a price below the opening price at some point, and usually reached the lowest price within the first 6 months.</p>\n\n<p>Now that we&#39;re hitting the end of 2020 I decided to look at some of the IPOs from this year.  I went back and recorded every IPO in June through Sept which takes us back 3-6 months.  I then eliminated a bunch of very thinly traded SPACs that have hardly moved since their IPO.  That left me with a sample of 72 IPOs during that time frame.  Here&#39;s what I found:</p>\n\n<p>Number of stocks that opened trading at a higher price than the IPO price: 60/72 (83.3%)</p>\n\n<p>Number of stocks that subsequently dropped to a price below the opening price: <strong>71/72 (98.6%)</strong></p>\n\n<p>Number of stocks that subsequently dropped to a price below the IPO price: 27/72 (37.5%)</p>\n\n<p>Number of stocks currently trading below the opening trade price: 16/72 (22.2%)</p>\n\n<p>I draw a few interesting conclusions from this data:</p>\n\n<ol>\n<li>Like my other studies, this data confirms the &quot;bowl&quot; pattern that is very common with IPOs: the price opens high, subsequently drops to a lower price, and then generally climbs above the opening price.</li>\n<li>Buying an IPO on the day of the IPO is a huge, huge mistake.  In 98.6% of cases, literally all but one, investors could have gotten a lower price.  In some cases that would have been an intraday low on the IPO day, but in most cases the low came in the days/weeks after the IPO.</li>\n<li>I don&#39;t know if this is a phenomenon particular to 2020 without doing the same analysis for previous years, but the data clearly demonstrates the FOMO that occurs around IPOs.  In 83% of cases the stock opened trading at a price higher than the IPO price, which means public demand pushed the price above the price set by the company.  And notice that although the price dropped below the opening trade price in 98.6% of cases, it only dropped below the IPO price in 37.5% of cases.  This would suggest that the actual IPO price is a much more accurate representation of the value of the stock, and any stock that opens trading much higher than the IPO price should be avoided until it drops.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/stocks/comments/knvinu/buying_ipos_revisited_some_2020_data/",
  "subreddit": "stocks",
  "id": "knvinu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748516
}