{
  "author": "iybwolf",
  "original_created_utc": 1640852833,
  "title": "Have male sexual slavery existed in the ancient world? Which civilizations practiced it? Did commoners participated in the buying of male sex slaves too?",
  "created_utc": 1640877359,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the movie Pompeii (2014), there is a scene in which upper class Roman women were inspecting male sex slaves. Similar scenes have been depicted in the TV series Spartacus. &lt;/p&gt;\n\n&lt;p&gt;In history, female sexual slavery is well known. Similarly, has male sexual slavery existed in the ancient world? Which civilizations practiced it? Did commoners participated in the buying of male sex slaves?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 555,
  "permalink": "/r/AskHistorians/comments/rrwpiq/have_male_sexual_slavery_existed_in_the_ancient/",
  "subreddit": "AskHistorians",
  "id": "rrwpiq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In the movie Pompeii (2014), there is a scene in which upper class Roman women\nwere inspecting male sex slaves. Similar scenes have been depicted in the TV\nseries Spartacus.\n\nIn history, female sexual slavery is well known. Similarly, has male sexual\nslavery existed in the ancient world? Which…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "映画『ポンペイ』（2014年）の中で、ローマの上流階級の女性が登場するシーンがあるのですが\nは、男性性奴隷の検査をしていました。同様のシーンは、テレビ\nシリーズ「スパルタカス」。\n\n歴史上、女性の性奴隷はよく知られている。同じように、男性の性\n古代の世界には、奴隷制度があったのでしょうか？どの...",
      "title": "男性の性奴隷は古代世界に存在したのか？どの文明がそれを実践していたのか？平民も男性性奴隷の購入に参加したのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在电影《庞贝》（2014年）中，有一个场景是罗马上层妇女\n正在检查男性性奴隶。电视剧《斯巴达克斯》中也描述了类似的场景\n斯巴达克斯。\n\n在历史上，女性的性奴役是众所周知的。同样地，男性性\n在古代世界是否存在男性性奴役？哪...",
      "title": "男性性奴役在古代世界存在吗？哪些文明实行过这种做法？平民也参与了购买男性性奴隶的活动吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在電影《龐貝》（2014年）中，有一個場景是羅馬上層婦女\n正在檢查男性性奴隸。電視劇《斯巴達克斯》中也描述了類似的場景\n斯巴達克斯。\n\n在歷史上，女性的性奴役是衆所周知的。同樣地，男性性\n在古代世界是否存在男性性奴役？哪...",
      "title": "男性性奴役在古代世界存在嗎？哪些文明實行過這種做法？平民也參與了購買男性性奴隸的活動嗎？"
    }
  ]
}