{
  "author": "Ragnaroknight",
  "the_new_excerpt": "They're actually super scared it's another 2018, even though this happens like\nonce a week and they still haven't learned.\n\nThe rest of us just don't say anything, or do anything, and keep holding. Dips\ncome and go all the time. Really no need to tell everyone that you're buying it,\nor this is the…",
  "original_created_utc": 1613508631,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "他们其实超级害怕这又是一个2018年，尽管这种情况发生的时候就像\n一周一次，他们还是没有学会。\n\n剩下的人就什么也不说，什么也不做，继续坚持。迪普斯\n来来去去都是。真的没必要告诉大家你要买。\n或这是...",
      "title": "发出 \"这蘸料只是修正，这是登月前最后一次上火箭的机会 \"或者 \"好吃的蘸料 \"这样的帖子的人。都是把自己的恐惧投射到你身上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們其實超級害怕這又是一個2018年，儘管這種情況發生的時候就像\n一週一次，他們還是沒有學會。\n\n剩下的人就什麼也不說，什麼也不做，繼續堅持。迪普斯\n來來去去都是。真的沒必要告訴大家你要買。\n或這是...",
      "title": "發出 \"這蘸料只是修正，這是登月前最後一次上火箭的機會 \"或者 \"好喫的蘸料 \"這樣的帖子的人。都是把自己的恐懼投射到你身上。"
    }
  ],
  "title": "People who post stuff like \"This dip is just a correction, this is your last chance to get on the rocket before the moon\" or \"Yummy yummy dip\". Are just projecting their own fears on you.",
  "created_utc": 1613525645,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They&#39;re actually super scared it&#39;s another 2018, even though this happens like once a week and they still haven&#39;t learned. </p>\n\n<p>The rest of us just don&#39;t say anything, or do anything, and keep holding. Dips come and go all the time. Really no need to tell everyone that you&#39;re buying it, or this is the last chance to board the rocket. </p>\n\n<p>Sick of reading those threads. We all know you&#39;re terrified, probably because you FOMO&#39;d the top and you&#39;re trying to rationalize with your decision. </p>\n\n<p>Just saiyan.</p>\n</div><!-- SC_ON -->",
  "score": 895,
  "permalink": "/r/CryptoCurrency/comments/lldat8/people_who_post_stuff_like_this_dip_is_just_a/",
  "subreddit": "CryptoCurrency",
  "id": "lldat8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619141
}