{
  "author": "Okmanl",
  "the_new_excerpt": "\"Analysts have been calling the stock “overvalued” since the day they went\npublic, because they all keep comparing it to other car companies. I wish I had\na dollar for every analyst who pointed out how “every other car company sells\nten times as many cars”.\n\nI’ve also repeatedly bumped into some…",
  "original_created_utc": 1613171682,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\"分析师从上市那天起就一直称该股 \"估值过高\"\n公，因为他们都一直在和其他车企比较。我希望我有\n每一位指出 \"其他汽车公司如何销售 \"的分析师都会得到一美元的奖励。\n十倍的车\"。\n\n我也曾多次碰到一些...",
      "title": "为什么Cathie Wood可能是对的，以及为什么TSLA在这些水平上实际上仍然相当甚至被低估。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"分析師從上市那天起就一直稱該股 \"估值過高\"\n公，因爲他們都一直在和其他車企比較。我希望我有\n每一位指出 \"其他汽車公司如何銷售 \"的分析師都會得到一美元的獎勵。\n十倍的車\"。\n\n我也曾多次碰到一些...",
      "title": "爲什麼Cathie Wood可能是對的，以及爲什麼TSLA在這些水平上實際上仍然相當甚至被低估。"
    }
  ],
  "title": "Why Cathie Wood might be right, and why TSLA is actually STILL fairly or even undervalued at these levels.",
  "created_utc": 1613186318,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Analysts have been calling the stock “overvalued” since the day they went public, because they all keep comparing it to other car companies. I wish I had a dollar for every analyst who pointed out how “<em>every other car company sells ten times as many cars</em>”. </p>\n\n<p>I’ve also repeatedly bumped into some lazy analysis that Tesla is expensive because its current P/E is 1,270x or forward P/E is 204x. However, I’ve hardly ever seen a Tesla bear put out a detailed valuation in support of their bearish thesis which makes me wonder if a lot of people are simply dismissing Tesla in arrogance.</p>\n\n<p>But the thing is, they’re all making the same mistake:</p>\n\n<p><strong>Tesla isn’t a car company.</strong></p>\n\n<p>They’re an energy and technology and SaaS company that makes cars.</p>\n\n<p>Once you realize what Tesla really is, you start to see what their place in the market is going to be in the years to come.</p>\n\n<p>They acquired Grohmann Engineering. They acquired Perbox. They acquired Maxwell Technologies and Hibar Systems. And of course everyone remembers the Solar City acquisition back before dropping Motors from their name. They didn’t acquire these companies because they thought they were cool. They did it so nobody else could.</p>\n\n<ul>\n<li>There are 25,000 EV charging stations in the United States. 20,000 of them are owned by Tesla.</li>\n<li>Tesla is currently the #1 li-ion battery manufacturer in America, and #5 in the world.</li>\n<li>Tesla has secured the rights to large supplies of lithium, and has developed their own internal process for extracting lithium deposits inexpensively from other sources.</li>\n</ul>\n\n<p>These segments of the energy space — battery production and EV charging — are a market sector that’s going to grow 50 fold in the next 15 years as consumer demand for EV’s increases. All of the major auto manufacturers have declared they’re shifting towards electric cars.</p>\n\n<p>Where are they going to get the batteries? How are their customers going to charge them?</p>\n\n<p>The answer: Tesla.</p>\n\n<p>Musk has made it clear from the beginning that their intent is to supply batteries for the entire EV <em>industry</em>, not just their own cars, and has also more or less come out and said that he’s open to letting other auto manufacturers access their Supercharger network. That puts them squarely in the energy business as the single most capable distributor.</p>\n\n<p>There’s also been chatter about licensing their self-driving technology, and using their self-driving technology as a recurring revenue generation, which would be a very attractive value-add for the other OEM’s. And all of these things don’t even begin to cover the expected growth in residential energy with products like rooftop solar, Powerwall, etc.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>People making the claim that Tesla is an overvalued car company are making the same mistake they made saying Amazon is an overvalued retail company. Back in 2010, after it was clear how big AWS and cloud computing was going to become.</strong></p>\n</div><!-- SC_ON -->",
  "score": 292,
  "permalink": "/r/investing/comments/ling8b/why_cathie_wood_might_be_right_and_why_tsla_is/",
  "subreddit": "investing",
  "id": "ling8b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621132
}