{
  "author": "AskThrowaway230984",
  "original_created_utc": 1637435396,
  "title": "During the 1992 LA Riots, many Korean-Americans took to the rooftops with guns to protect their businesses, earning them the monikor \"roof Koreans.\" How were they treated/viewed by the media at the time? Were any of them charged, either for manslaughter/homicide or reckless endangerment?",
  "created_utc": 1637459155,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I will not pretend that this question isn&#39;t inspired by recent events, but as someone born to one of these mythical &quot;roof Koreans,&quot; this topic does hit close to home for me.  In short, what was public perception of these minority groups openly defending their property with weapons?  And were any of them charged with any crimes?  &quot;Roof Koreans&quot; seem to have a largely neutral-to-positive perception nowadays, but I wonder if that&#39;s just people looking back on the situation with rose-tinted glasses.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/qycfyg/during_the_1992_la_riots_many_koreanamericans/",
  "subreddit": "AskHistorians",
  "id": "qycfyg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I will not pretend that this question isn't inspired by recent events, but as\nsomeone born to one of these mythical \"roof Koreans,\" this topic does hit close\nto home for me. In short, what was public perception of these minority groups\nopenly defending their property with weapons? And were any of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問が最近の出来事に触発されたものではないというふりをするつもりはありません。\n神話上の「屋根のない韓国人」の一人に生まれた者として、このテーマは私にとって身近なものです。\nこのテーマは、私にとって身近なものです。要するに、これらの少数民族が武器を使って自分たちの財産を公然と守っていることを\n自分たちの財産を武器を使って公然と守ることについて、世間はどのように受け止めていたのでしょうか。また、どのような...",
      "title": "1992年のLA暴動では、多くの韓国系アメリカ人が銃を持って屋根に登り、自分たちのビジネスを守ったことから、「ルーフコリアン」と呼ばれるようになりました。当時、彼らはメディアからどのように扱われ、見られていたのでしょうか？また、過失致死/殺人や無謀な危険行為の罪で起訴された人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不会假装这个问题不是由最近的事件激发的，但作为\n作为这些神话中的 \"屋顶上的韩国人 \"之一所生的人，这个话题确实很贴近我的生活。\n我的家。简而言之，公众对这些少数民族群体的看法是什么？\n公然用武器保卫自己的财产？是否有任何...",
      "title": "在1992年洛杉矶骚乱期间，许多韩裔美国人拿着枪走上屋顶，保护他们的生意，为他们赢得了 \"屋顶韩国人 \"的称号。当时媒体是如何对待/看待他们的？他们中是否有人被起诉，无论是过失杀人还是鲁莽地危害他人的行为？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不會假裝這個問題不是由最近的事件激發的，但作爲\n作爲這些神話中的 \"屋頂上的韓國人 \"之一所生的人，這個話題確實很貼近我的生活。\n我的家。簡而言之，公衆對這些少數民族羣體的看法是什麼？\n公然用武器保衛自己的財產？是否有任何...",
      "title": "在1992年洛杉磯騷亂期間，許多韓裔美國人拿着槍走上屋頂，保護他們的生意，爲他們贏得了 \"屋頂韓國人 \"的稱號。當時媒體是如何對待/看待他們的？他們中是否有人被起訴，無論是過失殺人還是魯莽地危害他人的行爲？"
    }
  ]
}