{
  "author": "s3k2p7s9m8b5",
  "original_created_utc": 1630982513,
  "title": "A lot of people here is misunderstanding and criticizing the Bitcoin \"late buying\" by President Bukele. Here's why he is doing it the right way:",
  "created_utc": 1631017849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He promised <strong>$30 USD</strong> to every citizen, so they just need a fixed amount (known since the beginning) of dollars to do that <strong>regardless</strong> of the current (or past) price of BTC.</p>\n\n<p>So it doesn&#39;t matter if the price of Bitcoin is &quot;high&quot; or &quot;low&quot;, he had already separated the amount required to give $30 USD to everyone.</p>\n\n<p>He is doing it the right way: Transparently and in the open, announcing publicly their purchases.</p>\n\n<p>To those saying: &quot;He should&#39;ve bought when the price was lower!&quot;. </p>\n\n<p>They are wrong: The Government&#39;s duty is not to &#39;invest&#39; in Bitcoin, <strong>it&#39;s NOT appropriate for them to speculate with Bitcoin</strong>, and certainly not for the short term. They can buy and Hodl for the long term on their treasury as a hedge against inflation and that would be responsible and appropriate.</p>\n\n<p>So don&#39;t get your panties in a twist and support this financial revolution in every way you can!</p>\n\n<p>Edit: Also, giving each citizen $30 of bitcoin needed approval from the Assembly before El Salvador could buy the bitcoin. The National Assembly of El Salvador just approved giving each citizen $30 worth of bitcoin less than a week ago.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/Bitcoin/comments/pje7tk/a_lot_of_people_here_is_misunderstanding_and/",
  "subreddit": "Bitcoin",
  "id": "pje7tk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "He promised $30 USD to every citizen, so they just need a fixed amount (known\nsince the beginning) of dollars to do that regardless of the current (or past)\nprice of BTC.\n\nSo it doesn't matter if the price of Bitcoin is \"high\" or \"low\", he had already\nseparated the amount required to give $30 USD to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "国民全員に30米ドルを約束したのだから、あとは決まった額（既知の\nの価格に関係なく、そのためには一定のドルが必要です。\nBTCの価格。\n\nつまり、ビットコインの価格が「高い」か「低い」かは問題ではなく、彼はすでに\nに30米ドルを渡すために必要な量を分離していたのです。",
      "title": "ここでは多くの人がブケレ社長のビットコイン「レイトバイ」を誤解して批判しています。ここでは、なぜ彼が正しい方法でそれを行っているのかを説明します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他承诺给每个公民30美元，所以他们只需要一个固定的数额（从一开始就知道的\n所以他们只需要一个固定的美元数额（从一开始就知道）就可以做到这一点，而不管目前（或过去）的\nBTC的价格。\n\n因此，不管比特币的价格是 \"高 \"还是 \"低\"，他都已经\n分出了给30美元所需的金额...",
      "title": "这里有很多人在误解和批评布克尔总统的比特币 \"后期购买\"。以下是他为什么要以正确的方式做这件事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他承諾給每個公民30美元，所以他們只需要一個固定的數額（從一開始就知道的\n所以他們只需要一個固定的美元數額（從一開始就知道）就可以做到這一點，而不管目前（或過去）的\nBTC的價格。\n\n因此，不管比特幣的價格是 \"高 \"還是 \"低\"，他都已經\n分出了給30美元所需的金額...",
      "title": "這裏有很多人在誤解和批評布克爾總統的比特幣 \"後期購買\"。以下是他爲什麼要以正確的方式做這件事。"
    }
  ]
}