{
  "author": "HolderofFour",
  "the_new_excerpt": "Shares of credit card companies Mastercard (NYSE:MA) and Visa (NYSE:V) --\nordinarily the fiercest of rivals -- are joining hands and running up the stairs\ntogether today, with Mastercard climbing 4.1% higher and Visa up 3.2% as of 2:55\np.m. EST.\n\nThe reason: Both charge companies are getting ready…",
  "original_created_utc": 1614207298,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "信用卡公司万事达卡（NYSE:MA）和维萨（NYSE:V）的股票----。\n往往是最激烈的竞争者 -- 携手并肩，跑上楼梯\n万事达卡今天一起上涨4.1%，Visa上涨3.2%，截至美国东部时间下午2点55分。\n美东时间下午2点55分，万事达卡上涨4.1%，Visa上涨3.2%。\n\n原因是：两家收费公司都在准备...",
      "title": "维萨和万事达卡准备提高利率。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "信用卡公司萬事達卡（NYSE:MA）和維薩（NYSE:V）的股票----。\n往往是最激烈的競爭者 -- 攜手並肩，跑上樓梯\n萬事達卡今天一起上漲4.1%，Visa上漲3.2%，截至美國東部時間下午2點55分。\n美東時間下午2點55分，萬事達卡上漲4.1%，Visa上漲3.2%。\n\n原因是：兩家收費公司都在準備...",
      "title": "維薩和萬事達卡準備提高利率。"
    }
  ],
  "title": "Visa and MasterCard Are Getting Ready To Raise Their Rates.",
  "created_utc": 1614210540,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Shares of credit card companies Mastercard (NYSE:MA) and Visa (NYSE:V) -- ordinarily the fiercest of rivals -- are joining hands and running up the stairs together today, with Mastercard climbing 4.1% higher and Visa up 3.2% as of 2:55 p.m. EST.</p>\n\n<p>The reason: Both charge companies are getting ready to raise their rates.</p>\n\n<p>As The Wall Street Journal reports, both companies plan to hike their swipe fees -- the percentage merchants pay them on every transaction made using one of their cards -- as early as April 2021. The higher fees will apply only to &quot;some&quot; undefined purchases, including &quot;small supermarkets&quot; and &quot;restaurants,&quot; but the categories of spending affected are also expected to include &quot;many online transactions.&quot;</p>\n\n<p>That&#39;s important, because as the WSJ points out, &quot;swipe fees ... are often higher on online purchases&quot; already. (The credit card companies point out that they plan to lower fees on other purchases -- but mainly just &quot;certain low-price transactions.&quot;)  </p>\n\n<p>What&#39;s important to remember, though, once those changes are announced, is that because interchange fees are currently only about 2% per transaction -- yet yield tens of billions of dollars a year in revenue to the card companies -- even a tiny, tenth-of-a-percent increase in the rate charged could potentially add billions of dollars to each company&#39;s top and bottom lines.</p>\n</div><!-- SC_ON -->",
  "score": 315,
  "permalink": "/r/investing/comments/lrpi4v/visa_and_mastercard_are_getting_ready_to_raise/",
  "subreddit": "investing",
  "id": "lrpi4v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883608
}