{
  "author": "F_respecc",
  "original_created_utc": 1645695476,
  "title": "How would we know if World War III has officially been declared?",
  "created_utc": 1645706926,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;With the current situation in Ukraine, World War III seems to be creeping right around the corner, but what actually marks the start? As a member of the younger generation, I don&amp;#39;t really know what war is like, does it just get announced in the news? Does it come unannounced? Is it happening right now?  &lt;/p&gt;\n\n&lt;p&gt;If the history books in the future were to write about a rhetorical World War III, what event would be considered the beginning?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/t070kk/how_would_we_know_if_world_war_iii_has_officially/",
  "subreddit": "NoStupidQuestions",
  "id": "t070kk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "With the current situation in Ukraine, World War III seems to be creeping right\naround the corner, but what actually marks the start? As a member of the younger\ngeneration, I don't really know what war is like, does it just get announced in\nthe news? Does it come unannounced? Is it happening right…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウクライナ情勢を見ると、第三次世界大戦の危機が迫っているように見えます。\nしかし、実際に何がきっかけになるのでしょうか？若い世代としては\n戦争がどんなものなのか、よくわからないんです。\nニュースでは？予告なしにやってくるのか？それは正しいのか...",
      "title": "第三次世界大戦が正式に宣言されたかどうかは、どうすればわかるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着乌克兰目前的局势，第三次世界大战似乎正在悄悄地逼近。\n但究竟是什么标志着战争的开始？作为年轻一代的一员\n我真的不知道战争是什么样子，它只是在新闻中被宣布吗？\n新闻中宣布吗？它是在没有通知的情况下发生的吗？它是否就发生在...",
      "title": "我们怎么会知道第三次世界大战是否已经正式宣布？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着烏克蘭目前的局勢，第三次世界大戰似乎正在悄悄地逼近。\n但究竟是什麼標誌着戰爭的開始？作爲年輕一代的一員\n我真的不知道戰爭是什麼樣子，它只是在新聞中被宣佈嗎？\n新聞中宣佈嗎？它是在沒有通知的情況下發生的嗎？它是否就發生在...",
      "title": "我們怎麼會知道第三次世界大戰是否已經正式宣佈？"
    }
  ]
}