{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "**Richard Ferri**\n\n**All About Asset Allocation and Protecting Your Wealth**\n\n- As a nation, we are not saving enough in retirement accounts to make up for diminishing Social Security benefits and other traditional sources of income\n- 10% savings of pre-tax income is a good target for most people\n- Investors tend to suffer from overconfidence\n- You can&#39;t time the market. If Nobel winners have tried and failed (Long-Term Capital Management), what chance do I have? And during a bear market, stocks usually decline much faster than they advance during a bull market. But you don&#39;t want to get out of the market then because you will miss the rally.\n- A good idea is to decide on a static percentage of stocks, bonds, alternative investments that fit your needs and then maintain that allocation for a long, long, long time. Then rebalance as needed.\n- We also have a fondness for seeing patterns where they don&#39;t exist. Stocks that have done well in the past are expected to continue to do well and stocks that have done poorly are expected to continue to do poorly\n- Avoid the temptation to follow the herd and invest in the hottest sectors or stocks.\n- Don&#39;t chase popular investment styles. Stick with your plan and give it time to work out\n- It is impossible to predict which type of fund will outperform any given year. Therefore, the best strategy is to hold a diversified portfolio that contains all types and stick with it\n- The more a mutual fund charges in fees, the lower the expected return\n- Take caution where you get financial advice, most of it is just salesmanship\n- Schools have spent lots of money and hours trying to figure out which active managed mutual fund managers are likely to outperform in the future. They discovered 2 facts\n  - Funds with low fees tend to outperform the market\n  - It is unreliable to assume that managers who have beaten the market in the past will continue to do so over the long term\n- On any given year, the index fund will be beat by many active managed funds. But in the long run, the index fund will be at the top\n- Reduce your estimated SS check at retirement by 60-70% and an increase of 5-7 years for retirement\n- Treat SS and defined pension plans as a separate account and don&#39;t use it in your equity/bond calculations\n- On the short term, it is nearly impossible to predict the movement of the stock market. But over the long term, the performance of the stock market is predictable because it follows the growth of the U.S. economy\n- Earnings Growth (Corporate Earnings or GDP) +Dividend (Yield)+Speculation (P/E ratio) = market return\n- In the short run, speculation creates the volatility in stock prices, but in the long term, economic growth is the real driver of returns. You can&#39;t guess what P/E ratio the market will assign in the future so don&#39;t try\n- It is impossible to forecast the movement of the inflation rate, but you can limit risk by purchasing short term bonds. They don&#39;t have the volatility of long-term bonds. You do get extra yield from long term bonds but it does not justify the added interest rate risk\n- Diversify your portfolio across investments in several asset classes to reduce risk and increase return\n- Make sure your investments have a low correlation with each other or you don&#39;t get the benefits of diversification\n- Rebalance your portfolio at least 1 per year\n- Key points of book – All About Asset Allocation\n  - Allocate our investments across multiple asset classes to reduce overall portfolio risk\n  - Invest broadly within each class to eliminate the risk of owning any single security\n  - Keep your costs down including taxes\n  - Rebalance periodically\n- Rebalancing is the most difficult because it forces you to sell what is going up and to buy what went down\n- Try to rebalance through changes in what you buy, try not to rebalance by selling assets\n- Use a long-term strategic asset allocation or &quot;buy and hold&quot;. No predictions needed.\n- A successful lifelong investment experience hinges on 3 critical steps\n  - Development of a prudent financial plan\n  - The full implementation of that plan\n  - The discipline to maintain that plan in good AND bad times\n- Investment Pyramid – 5 levels\n  - Base 1 – Cash accounts for living expenses\n    - Checking\n    - Savings\n    - Money Market\n    - Emergency Fund\n  - 2 - Discretionary long-term liquid investments\n    - Mutual Funds\n    - ETF\n    - Bonds\n    - CD&#39;s\n    - Annuities\n  - 3 – Discretionary long term illiquid assets\n    - Personal Home\n    - Properties\n    - Business\n    - Collectibles\n  - 4 – Nondiscretionary assets\n    - Social Security\n    - Pension\n  - Top 5 – Discretionary Speculative\n    - Commodities\n    - Individual Stocks\n- 6-12-month Emergency Fund recommended\n- Investing in the next hot item is very difficult to do\n- Picking a manager who can pick the next hot item is equally difficult to do\n- Do not select mutual funds on past performance. Past performance is not an indication of future results\n- Investment returns are directly related to investment risk\n- There are no risk-free investments\n- Practitioners view risk as investment volatility\n- Individuals view risk as losing money\n- There is a direct relationship between risk taken and amount of expected return\n- Investments with less risk of income disruptions have lower expected returns\n- Portfolio risk cannot be eliminated but it can be controlled with an asset allocation strategy\n- T-Bills are &quot;risk free&quot; but can still lose money due to taxes and inflation. If their purchasing power doesn&#39;t keep up\n- High volatility means erratic returns. Low volatility means more consistent returns\n- Rebalancing is based on a theory called regression to the mean. That is, there is a natural tendency in the marketplace for all broad asset classes to return close to their history risk profiles.\n- When you rebalance, you sell some of the winners to buy some of the losers. It may feel counterintuitive at first but it follows the logic to buy low and sell high\n- Calendar based rebalancing is a good idea. Pick a date and rebalance then. You are more likely to not procrastinate\n- Rebalancing only works if the investments in the portfolio don&#39;t act the same way. You want assets that don&#39;t correlate with each other\n- If 2 investments move in the same direction at the same time, they have positive correlation. If they move in opposite directions, they have negative correlation.\n- You want investments that have lower correlation to each other\n- Don&#39;t purchase new investments that have a high positive correlation with investments you already have\n- Negative correlation is theoretically ideal when selecting investments but this doesn&#39;t occur in the real world. Typically, the best asset pairs you will find are noncorrelated\n  - Correlation is measured on a -1 to +1 scale\n    - +0.3 or greater is positive\n    - -0.3 or less is negative\n    - -0.3 to 0.3 is noncorrelated\n- Correlations are dynamic, not static. And you can&#39;t guess when/how they will change. For example – The S+P 500 and Intermediate term treasury bonds have been between +0.49 to -0.42 correlated in the last 20 years (1990-2009). Average was 0 so they are noncorrelated\n- Correlation is not the only reason to invest. The security must also have a positive expected rate of return. It is basically impossible to find 2 negative correlated asset classes that both earn a positive rate of return. Noncorrelated is your best bet\n- You cannot eliminate all risk from a portfolio but you can reduce it\n- You will lose money during some times. Don&#39;t try to market time your way out of it. You can&#39;t\n- Do NOT abandon your plan because you lose money. In the last 50 years the market is up 4 years for every 1 down\n- Owning several asset classes is better than owning a few\n- Choose asset classes that have positive real returns and lower correlation\n- You can select a good asset allocation but not a perfect one. Don&#39;t overanalyze\n- It is not possible to know which asset classes will perform well at any given time, therefore it is important to retain ALL asset classes in your portfolio at all times and to rebalance these annually.\n- The perfect portfolio can only be known in retrospect. So, don&#39;t overanalyze\n- Foreign stocks are great for US investors\n  - They do not always move in correlation with the US market\n  - They trade in foreign currency which is another diversifier\n- During extreme volatility when you want low correlation among asset classes, positive correlation increases drastically across all classes. Especially during bear markets or disasters\n- There is no known way to design a portfolio that is fully hedged against downturns while fully participating in the upswings\n- Look for mutual funds that have low expense ratios and no redemption fees\n- Prefer index mutual funds and ETF&#39;s\n- Stay away from high cost illiquid investments unless you really know what you are doing\n- You have to stay invested during all market conditions to benefit from the gains\n\nEquities\n\n- An investment in a total US stock market fund is a solid foundation on which to base a US stock market allocation. Total Index are heavily weighted toward large cap stocks\n- Take your age x 1.5 for your % AA to a TDF. Example. 40 x 1.5 = 60% allocation to TDF\n- Midcap indexes are highly correlated with total stock market indexes and are therefore a poor diversifier. You don&#39;t need them\n- 25% max dedicated toward factor tilts\n- If you want to tilt, above all, be patient and stick to your guns. Don&#39;t chase returns. Once you decide to tilt, you need to stick with that strategy and not bailout of it\n- The enemy of a good asset allocation is the quest for a perfect one. Fight the urge to be perfect\n- Study in 1992 By Fama and French – Performance of a broadly diversified US stock portfolio relied on 3 primary risks axis to determine its return. 95% accuracy as to what the portfolio would return\n  - Market risk or Beta – all portfolios move up or down in relation to the total stock market\n  - Percent of small cap in the portfolio by weight – small stocks have higher returns and do not always have correlation to the total stock market\n  - Percent of value orientation – value stocks have a higher return than growth and do not correlate with growth stocks\n- Small cap value index has outperformed growth with less standard deviation from 1979-2009\n  - Having a 50/50 value/growth index during this time added no return and increased standard deviation\n- Small cap stocks have higher expected returns but also higher standard deviation than large cap\n  - This occurs in foreign markets too\n- Small Cap value along with total stock market is a good choice in your portfolio\n\nInternational\n\n- International equity provides currency diversification\n- Global equity invests in both US and international. Not usually a good idea unless you have a very small amount of money want diversification from 1 fund\n- Good idea to have both US AND International equities in your portfolio at all times. You don&#39;t know which one will win. US won from 1970-2001 then International has won since\n- Canada&#39;s economy is weighted heavily toward finance, energy and basic materials. Canada has lots of natural resources and investing in them acts as a hedge against commodity prices\n- A permanent allocation to emerging market stocks is recommended. Emerging markets are very volatile. Recently Emerging markets have increased their correlation to US markets but this may or may not continue\n- Generally, the allocation to international stocks is about 30% of the equity portion of your portfolio\n- Independent studies prove the size and value premium (F+F study above) works in international stocks like it does with US. This means international small cap is a good idea too\n- Foreign stocks are subject to currency, political, trading, custody and regulatory risk. You must understand these risks. But they do provide diversification to a portfolio\n\nFixed Income\n\n- A diversified fixed income portfolio enhances return\n- Low-cost bond mutual funds are an ideal way to invest\n- Tax considerations may be an important element in fixed income when investing in a taxable account\n- Bond Structure\n  - Short – 3 years or less\n  - Intermediate – 4 to 9 years\n  - Long – 10+ years\n- Longer term bonds have higher interest rate risk. Longer maturity = higher rates. Opposite true\n- Lower quality bonds have higher credit risk. Lower credit rating = higher rates. Opposite true\n- High yield bonds have not only credit risks but the real danger that the issuers will default\n- Municipal bonds are a good choice for people in higher tax brackets in taxable accounts\n\nREIT\n\n- Real estate is a separate asset class from stocks and bonds\n- REIT are a convenient way to invest in real estate\n- REITs have low correlation with stocks and bonds\n- Nearly all commercial lease contracts have a built-in inflation hedge. Therefore, REITs are a good inflation hedge\n- REITs are the simplest way to participate in the real estate market. They are also liquid\n- Index Equity REITs and ETFs are a good choice\n- REITs are divided into 3 categories\n  - Equity – Real estate properties. Most pure holding\n  - Mortgage REITs – do not own property, they finance property. Bond investment\n  - Hybrid – Hold both\n- 10% allocation to REIT is enough\n- Do not include home equity in your asset allocation models\n- Equity REITs are portfolios of apartments, hotels, malls, industrial buildings, and other rental property\n\nBehavioral\n\n- Realistic expectations are important to investment planning\n- Market volatility is more predictable than market return\n- Investments with expected positive investment return and higher volatility have higher expected return\n- All investments have risk. Even T-Bills which is inflation risk. There is no risk-free investment\n- No more than 12 funds because it gets too complex with higher fees and diminishing returns\n- Do not change your percentage of equity/bond based on what you think the market will do. Once you select a ratio stick with it.\n- Most people can&#39;t stomach a 100% equity portfolio\n- A well-developed plan works only when the investor sticks to the plan through good and bad times\n- A sensible investment plan never fails an investor, the investor fails the plan\n- People tend to more optimistic about stocks after the market goes up and less after it goes down\n- Investors give too much weight to recent information\n- People tend to buy investments that have had a recent run-up in performance\n- Investors label investments good or bad depending of the price relative to where they bought it\n- People are reluctant to admit errors\n- Overconfident investors generally believe they have more knowledge and information than they actually do. Therefore, they tend to trade too much and underperform\n- Males tend to be overconfident\n- Females tend to do better at sticking to a long-term plan and usually perform better\n- Do not change your investment strategy during a bear market\n- If you can rebalance without hesitation even during bad markets, your risk tolerance is good\n- Many portfolio failures occur when investors take on too much risk\n\nWhen to change your asset allocation\n\n- 3 Reasons to change your AA\n  - Financial goal is well within reach\n  - You realize you will not need all your money during your lifetime\n  - You risk tolerance isn&#39;t what you thought it was\n- Any AA changes should require deep thinking and even-handed judgement. Don&#39;t make changes during times of duress\n\nWhere to put your money\n\n- Tax Deferred\n  - Corportate bonds\n  - CD\n  - High turnover mutual funds\n  - REITs\n  - Commodities Funds\n- Taxable\n  - Low turnover equity funds\n  - ETFs\n  - Municipal bonds",
  "author_fullname": "t2_6ucr2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Richard Ferri All About Asset Allocation and Protecting Your Wealth Book Summary",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_obcxqu",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.81,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 27,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 27,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1625137827,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Richard Ferri</strong></p>\n\n<p><strong>All About Asset Allocation and Protecting Your Wealth</strong></p>\n\n<ul>\n<li>As a nation, we are not saving enough in retirement accounts to make up for diminishing Social Security benefits and other traditional sources of income</li>\n<li>10% savings of pre-tax income is a good target for most people</li>\n<li>Investors tend to suffer from overconfidence</li>\n<li>You can&#39;t time the market. If Nobel winners have tried and failed (Long-Term Capital Management), what chance do I have? And during a bear market, stocks usually decline much faster than they advance during a bull market. But you don&#39;t want to get out of the market then because you will miss the rally.</li>\n<li>A good idea is to decide on a static percentage of stocks, bonds, alternative investments that fit your needs and then maintain that allocation for a long, long, long time. Then rebalance as needed.</li>\n<li>We also have a fondness for seeing patterns where they don&#39;t exist. Stocks that have done well in the past are expected to continue to do well and stocks that have done poorly are expected to continue to do poorly</li>\n<li>Avoid the temptation to follow the herd and invest in the hottest sectors or stocks.</li>\n<li>Don&#39;t chase popular investment styles. Stick with your plan and give it time to work out</li>\n<li>It is impossible to predict which type of fund will outperform any given year. Therefore, the best strategy is to hold a diversified portfolio that contains all types and stick with it</li>\n<li>The more a mutual fund charges in fees, the lower the expected return</li>\n<li>Take caution where you get financial advice, most of it is just salesmanship</li>\n<li>Schools have spent lots of money and hours trying to figure out which active managed mutual fund managers are likely to outperform in the future. They discovered 2 facts\n\n<ul>\n<li>Funds with low fees tend to outperform the market</li>\n<li>It is unreliable to assume that managers who have beaten the market in the past will continue to do so over the long term</li>\n</ul></li>\n<li>On any given year, the index fund will be beat by many active managed funds. But in the long run, the index fund will be at the top</li>\n<li>Reduce your estimated SS check at retirement by 60-70% and an increase of 5-7 years for retirement</li>\n<li>Treat SS and defined pension plans as a separate account and don&#39;t use it in your equity/bond calculations</li>\n<li>On the short term, it is nearly impossible to predict the movement of the stock market. But over the long term, the performance of the stock market is predictable because it follows the growth of the U.S. economy</li>\n<li>Earnings Growth (Corporate Earnings or GDP) +Dividend (Yield)+Speculation (P/E ratio) = market return</li>\n<li>In the short run, speculation creates the volatility in stock prices, but in the long term, economic growth is the real driver of returns. You can&#39;t guess what P/E ratio the market will assign in the future so don&#39;t try</li>\n<li>It is impossible to forecast the movement of the inflation rate, but you can limit risk by purchasing short term bonds. They don&#39;t have the volatility of long-term bonds. You do get extra yield from long term bonds but it does not justify the added interest rate risk</li>\n<li>Diversify your portfolio across investments in several asset classes to reduce risk and increase return</li>\n<li>Make sure your investments have a low correlation with each other or you don&#39;t get the benefits of diversification</li>\n<li>Rebalance your portfolio at least 1 per year</li>\n<li>Key points of book – All About Asset Allocation\n\n<ul>\n<li>Allocate our investments across multiple asset classes to reduce overall portfolio risk</li>\n<li>Invest broadly within each class to eliminate the risk of owning any single security</li>\n<li>Keep your costs down including taxes</li>\n<li>Rebalance periodically</li>\n</ul></li>\n<li>Rebalancing is the most difficult because it forces you to sell what is going up and to buy what went down</li>\n<li>Try to rebalance through changes in what you buy, try not to rebalance by selling assets</li>\n<li>Use a long-term strategic asset allocation or &quot;buy and hold&quot;. No predictions needed.</li>\n<li>A successful lifelong investment experience hinges on 3 critical steps\n\n<ul>\n<li>Development of a prudent financial plan</li>\n<li>The full implementation of that plan</li>\n<li>The discipline to maintain that plan in good AND bad times</li>\n</ul></li>\n<li>Investment Pyramid – 5 levels\n\n<ul>\n<li>Base 1 – Cash accounts for living expenses</li>\n<li>Checking</li>\n<li>Savings</li>\n<li>Money Market</li>\n<li>Emergency Fund</li>\n<li>2 - Discretionary long-term liquid investments</li>\n<li>Mutual Funds</li>\n<li>ETF</li>\n<li>Bonds</li>\n<li>CD&#39;s</li>\n<li>Annuities</li>\n<li>3 – Discretionary long term illiquid assets</li>\n<li>Personal Home</li>\n<li>Properties</li>\n<li>Business</li>\n<li>Collectibles</li>\n<li>4 – Nondiscretionary assets</li>\n<li>Social Security</li>\n<li>Pension</li>\n<li>Top 5 – Discretionary Speculative</li>\n<li>Commodities</li>\n<li>Individual Stocks</li>\n</ul></li>\n<li>6-12-month Emergency Fund recommended</li>\n<li>Investing in the next hot item is very difficult to do</li>\n<li>Picking a manager who can pick the next hot item is equally difficult to do</li>\n<li>Do not select mutual funds on past performance. Past performance is not an indication of future results</li>\n<li>Investment returns are directly related to investment risk</li>\n<li>There are no risk-free investments</li>\n<li>Practitioners view risk as investment volatility</li>\n<li>Individuals view risk as losing money</li>\n<li>There is a direct relationship between risk taken and amount of expected return</li>\n<li>Investments with less risk of income disruptions have lower expected returns</li>\n<li>Portfolio risk cannot be eliminated but it can be controlled with an asset allocation strategy</li>\n<li>T-Bills are &quot;risk free&quot; but can still lose money due to taxes and inflation. If their purchasing power doesn&#39;t keep up</li>\n<li>High volatility means erratic returns. Low volatility means more consistent returns</li>\n<li>Rebalancing is based on a theory called regression to the mean. That is, there is a natural tendency in the marketplace for all broad asset classes to return close to their history risk profiles.</li>\n<li>When you rebalance, you sell some of the winners to buy some of the losers. It may feel counterintuitive at first but it follows the logic to buy low and sell high</li>\n<li>Calendar based rebalancing is a good idea. Pick a date and rebalance then. You are more likely to not procrastinate</li>\n<li>Rebalancing only works if the investments in the portfolio don&#39;t act the same way. You want assets that don&#39;t correlate with each other</li>\n<li>If 2 investments move in the same direction at the same time, they have positive correlation. If they move in opposite directions, they have negative correlation.</li>\n<li>You want investments that have lower correlation to each other</li>\n<li>Don&#39;t purchase new investments that have a high positive correlation with investments you already have</li>\n<li>Negative correlation is theoretically ideal when selecting investments but this doesn&#39;t occur in the real world. Typically, the best asset pairs you will find are noncorrelated\n\n<ul>\n<li>Correlation is measured on a -1 to +1 scale</li>\n<li>+0.3 or greater is positive</li>\n<li>-0.3 or less is negative</li>\n<li>-0.3 to 0.3 is noncorrelated</li>\n</ul></li>\n<li>Correlations are dynamic, not static. And you can&#39;t guess when/how they will change. For example – The S+P 500 and Intermediate term treasury bonds have been between +0.49 to -0.42 correlated in the last 20 years (1990-2009). Average was 0 so they are noncorrelated</li>\n<li>Correlation is not the only reason to invest. The security must also have a positive expected rate of return. It is basically impossible to find 2 negative correlated asset classes that both earn a positive rate of return. Noncorrelated is your best bet</li>\n<li>You cannot eliminate all risk from a portfolio but you can reduce it</li>\n<li>You will lose money during some times. Don&#39;t try to market time your way out of it. You can&#39;t</li>\n<li>Do NOT abandon your plan because you lose money. In the last 50 years the market is up 4 years for every 1 down</li>\n<li>Owning several asset classes is better than owning a few</li>\n<li>Choose asset classes that have positive real returns and lower correlation</li>\n<li>You can select a good asset allocation but not a perfect one. Don&#39;t overanalyze</li>\n<li>It is not possible to know which asset classes will perform well at any given time, therefore it is important to retain ALL asset classes in your portfolio at all times and to rebalance these annually.</li>\n<li>The perfect portfolio can only be known in retrospect. So, don&#39;t overanalyze</li>\n<li>Foreign stocks are great for US investors\n\n<ul>\n<li>They do not always move in correlation with the US market</li>\n<li>They trade in foreign currency which is another diversifier</li>\n</ul></li>\n<li>During extreme volatility when you want low correlation among asset classes, positive correlation increases drastically across all classes. Especially during bear markets or disasters</li>\n<li>There is no known way to design a portfolio that is fully hedged against downturns while fully participating in the upswings</li>\n<li>Look for mutual funds that have low expense ratios and no redemption fees</li>\n<li>Prefer index mutual funds and ETF&#39;s</li>\n<li>Stay away from high cost illiquid investments unless you really know what you are doing</li>\n<li>You have to stay invested during all market conditions to benefit from the gains</li>\n</ul>\n\n<p>Equities</p>\n\n<ul>\n<li>An investment in a total US stock market fund is a solid foundation on which to base a US stock market allocation. Total Index are heavily weighted toward large cap stocks</li>\n<li>Take your age x 1.5 for your % AA to a TDF. Example. 40 x 1.5 = 60% allocation to TDF</li>\n<li>Midcap indexes are highly correlated with total stock market indexes and are therefore a poor diversifier. You don&#39;t need them</li>\n<li>25% max dedicated toward factor tilts</li>\n<li>If you want to tilt, above all, be patient and stick to your guns. Don&#39;t chase returns. Once you decide to tilt, you need to stick with that strategy and not bailout of it</li>\n<li>The enemy of a good asset allocation is the quest for a perfect one. Fight the urge to be perfect</li>\n<li>Study in 1992 By Fama and French – Performance of a broadly diversified US stock portfolio relied on 3 primary risks axis to determine its return. 95% accuracy as to what the portfolio would return\n\n<ul>\n<li>Market risk or Beta – all portfolios move up or down in relation to the total stock market</li>\n<li>Percent of small cap in the portfolio by weight – small stocks have higher returns and do not always have correlation to the total stock market</li>\n<li>Percent of value orientation – value stocks have a higher return than growth and do not correlate with growth stocks</li>\n</ul></li>\n<li>Small cap value index has outperformed growth with less standard deviation from 1979-2009\n\n<ul>\n<li>Having a 50/50 value/growth index during this time added no return and increased standard deviation</li>\n</ul></li>\n<li>Small cap stocks have higher expected returns but also higher standard deviation than large cap\n\n<ul>\n<li>This occurs in foreign markets too</li>\n</ul></li>\n<li>Small Cap value along with total stock market is a good choice in your portfolio</li>\n</ul>\n\n<p>International</p>\n\n<ul>\n<li>International equity provides currency diversification</li>\n<li>Global equity invests in both US and international. Not usually a good idea unless you have a very small amount of money want diversification from 1 fund</li>\n<li>Good idea to have both US AND International equities in your portfolio at all times. You don&#39;t know which one will win. US won from 1970-2001 then International has won since</li>\n<li>Canada&#39;s economy is weighted heavily toward finance, energy and basic materials. Canada has lots of natural resources and investing in them acts as a hedge against commodity prices</li>\n<li>A permanent allocation to emerging market stocks is recommended. Emerging markets are very volatile. Recently Emerging markets have increased their correlation to US markets but this may or may not continue</li>\n<li>Generally, the allocation to international stocks is about 30% of the equity portion of your portfolio</li>\n<li>Independent studies prove the size and value premium (F+F study above) works in international stocks like it does with US. This means international small cap is a good idea too</li>\n<li>Foreign stocks are subject to currency, political, trading, custody and regulatory risk. You must understand these risks. But they do provide diversification to a portfolio</li>\n</ul>\n\n<p>Fixed Income</p>\n\n<ul>\n<li>A diversified fixed income portfolio enhances return</li>\n<li>Low-cost bond mutual funds are an ideal way to invest</li>\n<li>Tax considerations may be an important element in fixed income when investing in a taxable account</li>\n<li>Bond Structure\n\n<ul>\n<li>Short – 3 years or less</li>\n<li>Intermediate – 4 to 9 years</li>\n<li>Long – 10+ years</li>\n</ul></li>\n<li>Longer term bonds have higher interest rate risk. Longer maturity = higher rates. Opposite true</li>\n<li>Lower quality bonds have higher credit risk. Lower credit rating = higher rates. Opposite true</li>\n<li>High yield bonds have not only credit risks but the real danger that the issuers will default</li>\n<li>Municipal bonds are a good choice for people in higher tax brackets in taxable accounts</li>\n</ul>\n\n<p>REIT</p>\n\n<ul>\n<li>Real estate is a separate asset class from stocks and bonds</li>\n<li>REIT are a convenient way to invest in real estate</li>\n<li>REITs have low correlation with stocks and bonds</li>\n<li>Nearly all commercial lease contracts have a built-in inflation hedge. Therefore, REITs are a good inflation hedge</li>\n<li>REITs are the simplest way to participate in the real estate market. They are also liquid</li>\n<li>Index Equity REITs and ETFs are a good choice</li>\n<li>REITs are divided into 3 categories\n\n<ul>\n<li>Equity – Real estate properties. Most pure holding</li>\n<li>Mortgage REITs – do not own property, they finance property. Bond investment</li>\n<li>Hybrid – Hold both</li>\n</ul></li>\n<li>10% allocation to REIT is enough</li>\n<li>Do not include home equity in your asset allocation models</li>\n<li>Equity REITs are portfolios of apartments, hotels, malls, industrial buildings, and other rental property</li>\n</ul>\n\n<p>Behavioral</p>\n\n<ul>\n<li>Realistic expectations are important to investment planning</li>\n<li>Market volatility is more predictable than market return</li>\n<li>Investments with expected positive investment return and higher volatility have higher expected return</li>\n<li>All investments have risk. Even T-Bills which is inflation risk. There is no risk-free investment</li>\n<li>No more than 12 funds because it gets too complex with higher fees and diminishing returns</li>\n<li>Do not change your percentage of equity/bond based on what you think the market will do. Once you select a ratio stick with it.</li>\n<li>Most people can&#39;t stomach a 100% equity portfolio</li>\n<li>A well-developed plan works only when the investor sticks to the plan through good and bad times</li>\n<li>A sensible investment plan never fails an investor, the investor fails the plan</li>\n<li>People tend to more optimistic about stocks after the market goes up and less after it goes down</li>\n<li>Investors give too much weight to recent information</li>\n<li>People tend to buy investments that have had a recent run-up in performance</li>\n<li>Investors label investments good or bad depending of the price relative to where they bought it</li>\n<li>People are reluctant to admit errors</li>\n<li>Overconfident investors generally believe they have more knowledge and information than they actually do. Therefore, they tend to trade too much and underperform</li>\n<li>Males tend to be overconfident</li>\n<li>Females tend to do better at sticking to a long-term plan and usually perform better</li>\n<li>Do not change your investment strategy during a bear market</li>\n<li>If you can rebalance without hesitation even during bad markets, your risk tolerance is good</li>\n<li>Many portfolio failures occur when investors take on too much risk</li>\n</ul>\n\n<p>When to change your asset allocation</p>\n\n<ul>\n<li>3 Reasons to change your AA\n\n<ul>\n<li>Financial goal is well within reach</li>\n<li>You realize you will not need all your money during your lifetime</li>\n<li>You risk tolerance isn&#39;t what you thought it was</li>\n</ul></li>\n<li>Any AA changes should require deep thinking and even-handed judgement. Don&#39;t make changes during times of duress</li>\n</ul>\n\n<p>Where to put your money</p>\n\n<ul>\n<li>Tax Deferred\n\n<ul>\n<li>Corportate bonds</li>\n<li>CD</li>\n<li>High turnover mutual funds</li>\n<li>REITs</li>\n<li>Commodities Funds</li>\n</ul></li>\n<li>Taxable\n\n<ul>\n<li>Low turnover equity funds</li>\n<li>ETFs</li>\n<li>Municipal bonds</li>\n</ul></li>\n</ul>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "obcxqu",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "captmorgan50",
  "discussion_type": null,
  "num_comments": 6,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/obcxqu/richard_ferri_all_about_asset_allocation_and/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/obcxqu/richard_ferri_all_about_asset_allocation_and/",
  "subreddit_subscribers": 79003,
  "created_utc": 1625154510,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1625109027,
  "the_new_excerpt": "Richard Ferri\n\nAll About Asset Allocation and Protecting Your Wealth\n\n * As a nation, we are not saving enough in retirement accounts to make up for\n   diminishing Social Security benefits and other traditional sources of income\n * 10% savings of pre-tax income is a good target for most people\n *…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "リチャード・フェリ\n\nアセットアロケーションと財産の保護について\n\n * 国民は、社会保障費の減少を補うために、退職金を十分に貯めていません。\n   社会保障給付やその他の伝統的な収入源の減少を補うために、国民はリタイヤメント口座に十分な貯蓄をしていません。\n * 税引き前収入の10％を貯蓄することは、ほとんどの人にとって良い目標です。\n *...",
      "title": "リチャード・フェリ 資産配分のすべてと財産の守り方 書籍概要"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "理查德-费里\n\n关于资产配置和保护你的财富的全部内容\n\n * 作为一个国家，我们没有在退休账户中储蓄足够的资金来弥补\n   社会保障福利和其他传统收入来源的减少\n * 对大多数人来说，税前收入的10%的储蓄是一个好的目标\n *...",
      "title": "理查德-费里《关于资产配置和保护你的财富》一书摘要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "理查德-費裏\n\n關於資產配置和保護你的財富的全部內容\n\n * 作爲一個國家，我們沒有在退休賬戶中儲蓄足夠的資金來彌補\n   社會保障福利和其他傳統收入來源的減少\n * 對大多數人來說，稅前收入的10%的儲蓄是一個好的目標\n *...",
      "title": "理查德-費裏《關於資產配置和保護你的財富》一書摘要"
    }
  ],
  "source_updated_at": 1625823776373
}