{
  "author": "t987h",
  "the_new_excerpt": "After a 40% rally - Magnachip is now 7x EV/ EBITDA and still extremely cheap for\nthis fast growing semiconductor company focused on 5G and OLED smartphones.\n\nMagnachip Semiconductor NYSE:MX - 33% global market share in OLED display\ndrivers or DDICs (allows OLED screens to function), behind Samsung…",
  "original_created_utc": 1613131525,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在经历了40%的涨幅后--麦格纳奇现在的EV/EBITDA是7倍，而且价格仍旧非常便宜。\n这家快速成长的半导体公司专注于5G和OLED智能手机。\n\n麦格纳晶半导体NYSE:MX--在OLED显示屏领域占据33%的全球市场份额。\n驱动程序或DDIC（允许OLED屏幕运行），背后是三星...",
      "title": "麦格纳晶MX有望超越第四季度指引。低估7倍EV/EVITDA及供应5G OLED手机/利润率上扬。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在經歷了40%的漲幅後--麥格納奇現在的EV/EBITDA是7倍，而且價格仍舊非常便宜。\n這家快速成長的半導體公司專注於5G和OLED智能手機。\n\n麥格納晶半導體NYSE:MX--在OLED顯示屏領域佔據33%的全球市場份額。\n驅動程序或DDIC（允許OLED屏幕運行），背後是三星...",
      "title": "麥格納晶MX有望超越第四季度指引。低估7倍EV/EVITDA及供應5G OLED手機/利潤率上揚。"
    }
  ],
  "title": "Magnachip MX Expected to Beat Q4 Guidance: Undervalued at 7x EV/EVITDA & Supplies to 5G OLED Phones / Margin Upside",
  "created_utc": 1613152607,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After a 40% rally - Magnachip is now 7x EV/ EBITDA and still extremely cheap for this fast growing semiconductor company focused on 5G and OLED smartphones.</p>\n\n<p>Magnachip Semiconductor NYSE:MX - 33% global market share in OLED display drivers or DDICs (allows OLED screens to function), behind Samsung which is #1 (66% mkt share)</p>\n\n<ul>\n<li>Cash on balance sheet $540MM as of Sep 2020</li>\n<li>Mkt cap of $650MM and debt of $308MM</li>\n<li>EV of $450MM</li>\n</ul>\n\n<p><strong>Valuation: LCD DDIC display suppliers HIMX trades at a 3.3x EV/Revenue multiple and SYNA (Synaptics, market leader in the other type of display chip called a TDDI and used by AAPL for all iPhone screens) at a 3.65x and 23 x EV/EBITDA. Both are seeing their LCD revenue move into OLEDZ Using a revenue multiple of 2x makes for a $1 billion EV (RR Q3 revenue that doesn&#39;t include sold subsidiary) for MX compared to its EV of $450MM -&gt; &gt;100% return.</strong> </p>\n\n<p><strong>Using a conservative 15x EBITDA multiple off of RR Q3 EBITDA of $48MM (removing gain from sale of subsidiary) = EV of $720MM -&gt; 60% return</strong></p>\n\n<p>Note: Earnings Wed 2/17</p>\n\n<p><strong>OLED is Booming</strong></p>\n\n<p>MX is the largest independent supplier of OLED DDICs which power the display screens, and focused on high frame rate phones. It’s tied to the hip of Samsung and LG and a big winner in the OLED space especially with 5G and will most likely beat their Q4 guidance. OLED and chip manufacturers are fully sold out as per guidance from several semiconductor companies.</p>\n\n<p>For each phone with OLED, there is 1 DDIC. For a rollable or foldable OLED screen, there are more than 1 DDIC chip on average. MX is also getting into laptop, TV, and auto OLED screens which all use more than 1 chip (given larger size).</p>\n\n<p><strong>Q4 2020 Guidance Beat</strong></p>\n\n<p>Magnachip Semiconductor Q4 &#39;20 revenue/profits are likely to surprise, here’s why: in their most recent analyst presentation, they said their Q4 guidance put out in Q3 was based on LOWER manufacturing capacity from their foundry partners. That allocation went up.</p>\n\n<p>From the analyst call: &quot;Our Q4 revenue guidance range was based on allocation from foundry partners for OLED as well as internal Fab 3 ramp-up. We were able to secure greater supply than we originally expected.&quot;</p>\n\n<p>The supply crunch is affecting 8&quot; fabs and MX focuses on using 12&quot; foundries which are less tight, and that explains why MX was able to receive more allocation.</p>\n\n<p>In addition, there is likely strong forward guidance given improved margins below...</p>\n\n<p><strong>Supply Crunch and Potential Acquirer?</strong></p>\n\n<p>Synaptics, a $3.7bln market cap company that dominates the adjacent semiconductor touch chips for OLED screens (called TDDI, used in all AAPL phones) in their earnings call on Feb 4 said there is a supply crunch in OLED DDICs and a potential for &quot;a tactical opportunity&quot;:</p>\n\n<p>&quot;Given the supply crunch, we&#39;ve seen an opening, an opportunity for us for OLED DDICs...The current supply base in OLED DDICs has been compressed..[On]...the second half of the year, as I mentioned, we do see a frontier opening up on OLED DDICs. Today, we have no revenue there. We don&#39;t think that -- in a backward look, we thought the margins were going to be challenged there, but the dynamics have changed very significantly in that market, and we think that there&#39;s going to be a tactical opportunity.&quot;</p>\n\n<p>Synaptics acquired an OLED DDIC company in the past (8-9 years ago) and did not make much out of it, focusing on the touch aspect versus the IC chip. However, margins for OLED DDICs are improving based on their comments and bodes well for MX.</p>\n\n<p>HIMX, another company operating in the display panel space (albeit not in OLED), has said that the transition from LCD to OLED screens is happening fast and sees OLED DDIC s as a major opportunity: &quot;As we have repeatedly indicated, traditional smartphone DDICs are quickly being replaced by TDDI and AMOLED....We believe AMOLED driver IC will soon become one of the major growth drivers for our small- and medium-panel driver IC business in 2021.&quot;</p>\n\n<p>In fact, HIMX said that given the &quot;helplessly tight&quot; semiconductor situation. <strong>&quot;We can very often transfer the cost increase to customers and a bit more.&quot;</strong></p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>For a global leader in a key component of OLED displays and with 5G phones / increase in display resolution and frame rates (for video games) and management said in their analyst calls (all online in IR videos) they are sold out in July (and likely Sep) from demand -&gt; drastically undervalued at ~7xEV/EBITDA valuation...</p>\n\n<p>Recommendation: Shares are more attractive given the options are somewhat thinly traded.</p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/li9qnq/magnachip_mx_expected_to_beat_q4_guidance/",
  "subreddit": "stocks",
  "id": "li9qnq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623024
}