{
  "author": "Dimas16",
  "original_created_utc": 1632324002,
  "title": "Today my bank called me...",
  "created_utc": 1632339027,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a crypto trader like many of you are and today my bank called me to tell me to cease all my activities immediately.</p>\n\n<p>I trade crypto daily using centralised exchanges and peer2peer exchanges, i trade purely for myself as an individual to build up my personal portfolio. This is also my only income at the moment. I&#39;m not bragging but my volume is quite high (I wont share specifics for obvious reasons).</p>\n\n<p>I use one bank for my crypto activities and another for my day to day life (bills and stuff). The bank I use for my crypto trading is called Rabobank, this is a dutch bank. Today a lady from this bank called me to ask me to stop immediately with what I am doing or they will block my account. This because the activity on my account seems more like business related (there is a lot of activity due to arbitrage between exchanges etc). I asked them if in that case i could switch to a business account (even though I am doing this as an individual). They told me they do not open accounts for crypto related businesses....</p>\n\n<p>This is not the first time a bank has called me regarding my crypto activities, but this is the first time they told me to stop it. On previous occasions the banks would merely suggest that crypto is high risk and maybe not a good idea. But this bank just blatantly told me to quit what I am doing. They basically told me to stop making a living the way i am doing it now. I do not know how you would react to that but that one really triggered me and i told the lady what she would say if someone would call her and tell her to quit her job(maybe a bit childish but i was really triggered)?</p>\n\n<p>I was under the impression that I live in a country with lots of personal freedom (the Netherlands). But if it is up to Rabobank they would gladly impede on this personal freedom of mine to do whatever I want with MY money (as long as it is not illegal) by excluding me from the banking system.</p>\n\n<p>I know this seems like a rant and maybe it is but I am very pissed of at this. I can not believe that they had the audacity to tell me and force me to spend my money differently.</p>\n\n<p>I contacted several lawyers, and the basic gist is that banks can do whatever they want. With the new anti money laundering rules in Europe banks are under pressure from the government to do their due diligence. This legislation comes at the cost of people like me, people who make money in a non traditional way. I am basically guilty until proven innocent because the bank does not have the capability to check wether all my transactions are legit or not.</p>\n\n<p>This move from Rabobank has me a little bit worried for the future of crypto in Europe. While they are not prohibiting crypto so far, they are making it limited by allowing banks like Rabobank to just cancel your activities because you trade crypto. And I know that I am a major minority(in the way I use my bank account) but while I am not doing anything illegal i do not understand how a bank can prohibit me from using my money the way i see fit.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: to all the people saying just switch banks, you are correct i can but it will not solve anything, maybe not today but in a year or two they will also call me with the same message. It is about the principle that all banks in EU are allowed to do this, to treat you like you are a criminal with no evidence.</p>\n</div><!-- SC_ON -->",
  "score": 230,
  "permalink": "/r/CryptoCurrency/comments/pt9rav/today_my_bank_called_me/",
  "subreddit": "CryptoCurrency",
  "id": "pt9rav",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a crypto trader like many of you are and today my bank called me to tell me\nto cease all my activities immediately.\n\nI trade crypto daily using centralised exchanges and peer2peer exchanges, i\ntrade purely for myself as an individual to build up my personal portfolio. This\nis also my only…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は皆さんと同じように暗号トレーダーですが、今日、銀行から電話があり、私が持っているすべての暗号を停止するように言われました。\n今日、銀行から電話があり、私のすべての活動を直ちに中止するように言われました。\n\n私は中央の取引所とピアツーピアの取引所を使って毎日暗号を取引しています。\n私は純粋に個人として自分のポートフォリオを構築するために取引しています。これは\nこれも私の唯一の...",
      "title": "今日、銀行から電話がかかってきて...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和你们中的许多人一样，是一名加密货币交易员，今天我的银行打电话给我，告诉我\n立即停止我的所有活动。\n\n我每天使用集中式交易所和点对点交易所进行加密货币交易。\n我的交易纯粹是为了我自己，作为一个人，建立我的个人投资组合。这\n这也是我唯一的...",
      "title": "今天我的银行给我打电话..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和你們中的許多人一樣，是一名加密貨幣交易員，今天我的銀行打電話給我，告訴我\n立即停止我的所有活動。\n\n我每天使用集中式交易所和點對點交易所進行加密貨幣交易。\n我的交易純粹是爲了我自己，作爲一個人，建立我的個人投資組合。這\n這也是我唯一的...",
      "title": "今天我的銀行給我打電話..."
    }
  ]
}