{
  "author": "throw-away-09876543",
  "original_created_utc": 1654281187,
  "title": "I’m sure you’re all tired of my updates but I just need one more happy moment......they chose my middle name.......and the second they told me why I broke down.?",
  "created_utc": 1654301455,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I accepted my parents offer to legal adopt me. Part of that was I wanted to take their last name, but also due to the abuse from my biological parents I didn’t want to keep my middle since since it was my biological mothers first name. &lt;/p&gt;\n\n&lt;p&gt;I told my new parents I wanted them to choose a name for my middle name because they have 4 kids between them (3 living) but have none biologically together so they’ve never gotten to choose a name for a child together. I wanted to give them that opportunity together and also for me to have the sentimental value that they chose my new middle name.  &lt;/p&gt;\n\n&lt;p&gt;So we’re headed to the lawyers soon to start paperwork and they wanted to come up with a name before we started the paperwork. Apparently they were awake half the night searching baby names and meanings on the Internet to find one they loved. &lt;/p&gt;\n\n&lt;p&gt;Well they found one. &lt;/p&gt;\n\n&lt;p&gt;They chose “EMMELLYN” which means  “peaceful home” &lt;/p&gt;\n\n&lt;p&gt;They told me their reasons for meaning and spelling were: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;With them and being adopted I now will legally forever have a peaceful home/family. No more abuse or trauma to worry about. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Both of their middle names start with “E” so they only considered “E” names &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Moms middle name has “ELL” in it &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Dad’s first name has “ELL” in it &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;As soon as they finished that explanation and I said my full name with this middle name and their last name out loud.........instant tears from me. &lt;/p&gt;\n\n&lt;p&gt;I don’t know what I expected them to come up with for a name, but this has so much more meaning and deep ties to them than I ever thought they could pack into one name. &lt;/p&gt;\n\n&lt;p&gt;I finally know my new name.....it’ll take a while for the whole process and before it’s legal and all that, but I finally feel like I’m moving on from my past and building a future with my family.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/v45snq/im_sure_youre_all_tired_of_my_updates_but_i_just/",
  "subreddit": "TooAfraidToAsk",
  "id": "v45snq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I accepted my parents offer to legal adopt me. Part of that was I wanted to\ntake their last name, but also due to the abuse from my biological parents I\ndidn’t want to keep my middle since since it was my biological mothers first\nname.\n\nI told my new parents I wanted them to choose a name for my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は、両親が合法的に私を養子に迎えてくれるという申し出を受け入れました。両親の姓を名乗りたかったというのもありますし\nという気持ちもありましたが、実の両親から虐待を受けていたこともあり、実の両親の姓を名乗ることは\nというのも、ミドルネームは実母のファーストネームだからです。\nを名乗りたかったのです。\n\n私は新しい両親に、私の名前を選んでほしいと伝えました...",
      "title": "皆さんは私の更新に飽きていると思いますが、もう一つ嬉しいことがあります......私のミドルネームが決まりました！理由を言われた瞬間、私は壊れました?"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我接受了我父母提出的合法收养我的建议。部分原因是我想\n但也由于我的亲生父母对我的虐待，我没有接受他们的建议。\n我不想保留我的中间名，因为那是我生母的名字。\n名字。\n\n我告诉我的新父母，我希望他们为我选择一个名字。",
      "title": "我相信你们都厌倦了我的更新，但我只需要再有一个快乐的时刻......，他们选择了我的中间名.......，以及他们告诉我为什么我崩溃的那一秒。?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我接受了我父母提出的合法收養我的建議。部分原因是我想\n但也由於我的親生父母對我的虐待，我沒有接受他們的建議。\n我不想保留我的中間名，因爲那是我生母的名字。\n名字。\n\n我告訴我的新父母，我希望他們爲我選擇一個名字。",
      "title": "我相信你們都厭倦了我的更新，但我只需要再有一個快樂的時刻......，他們選擇了我的中間名.......，以及他們告訴我爲什麼我崩潰的那一秒。?"
    }
  ]
}