{
  "author": "throw-away-09876543",
  "original_created_utc": 1654281187,
  "title": "I’m sure you’re all tired of my updates but I just need one more happy moment......they chose my middle name.......and the second they told me why I broke down.?",
  "created_utc": 1654301455,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I accepted my parents offer to legal adopt me. Part of that was I wanted to take their last name, but also due to the abuse from my biological parents I didn’t want to keep my middle since since it was my biological mothers first name. &lt;/p&gt;\n\n&lt;p&gt;I told my new parents I wanted them to choose a name for my middle name because they have 4 kids between them (3 living) but have none biologically together so they’ve never gotten to choose a name for a child together. I wanted to give them that opportunity together and also for me to have the sentimental value that they chose my new middle name.  &lt;/p&gt;\n\n&lt;p&gt;So we’re headed to the lawyers soon to start paperwork and they wanted to come up with a name before we started the paperwork. Apparently they were awake half the night searching baby names and meanings on the Internet to find one they loved. &lt;/p&gt;\n\n&lt;p&gt;Well they found one. &lt;/p&gt;\n\n&lt;p&gt;They chose “EMMELLYN” which means  “peaceful home” &lt;/p&gt;\n\n&lt;p&gt;They told me their reasons for meaning and spelling were: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;With them and being adopted I now will legally forever have a peaceful home/family. No more abuse or trauma to worry about. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Both of their middle names start with “E” so they only considered “E” names &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Moms middle name has “ELL” in it &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Dad’s first name has “ELL” in it &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;As soon as they finished that explanation and I said my full name with this middle name and their last name out loud.........instant tears from me. &lt;/p&gt;\n\n&lt;p&gt;I don’t know what I expected them to come up with for a name, but this has so much more meaning and deep ties to them than I ever thought they could pack into one name. &lt;/p&gt;\n\n&lt;p&gt;I finally know my new name.....it’ll take a while for the whole process and before it’s legal and all that, but I finally feel like I’m moving on from my past and building a future with my family.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/v45snq/im_sure_youre_all_tired_of_my_updates_but_i_just/",
  "subreddit": "TooAfraidToAsk",
  "id": "v45snq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I accepted my parents offer to legal adopt me. Part of that was I wanted to\ntake their last name, but also due to the abuse from my biological parents I\ndidn’t want to keep my middle since since it was my biological mothers first\nname.\n\nI told my new parents I wanted them to choose a name for my…"
}