{
  "author": "katdunks",
  "original_created_utc": 1648313661,
  "title": "How can I thank a spider who has been in my home for months helping with insects? (Serious)",
  "created_utc": 1648328138,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pretty much what the title says. I had a severe insect issue until my spider friend came around. It&amp;#39;s been a few months and they are still here taking care of insects for me. I used to hate spiders but I&amp;#39;ve come to appreciate them since I need help with pest control.&lt;/p&gt;\n\n&lt;p&gt;Is there a way I could help make it more comfortable or say thank you somehow? I&amp;#39;d also like to learn more about common household spiders from an any educational site but I&amp;#39;m not sure where to start or what is best. Google can be overwhelming. I know this sounds crazy but it&amp;#39;s the least I can do for them for helping out.&lt;/p&gt;\n\n&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/toxqo8/how_can_i_thank_a_spider_who_has_been_in_my_home/",
  "subreddit": "NoStupidQuestions",
  "id": "toxqo8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Pretty much what the title says. I had a severe insect issue until my spider\nfriend came around. It's been a few months and they are still here taking care\nof insects for me. I used to hate spiders but I've come to appreciate them since\nI need help with pest control.\n\nIs there a way I could help…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルとほぼ同じです。私は、クモを飼うまで、ひどい虫害に悩まされていました。\nがやってきてくれました。数ヶ月経ちますが、彼らはまだここで世話をしています。\nを、昆虫のために使っています。以前はクモが嫌いでしたが、それ以来、クモのありがたみを感じるようになりました。\n害虫駆除を手伝ってほしい。\n\n何かお手伝いできることはないでしょうか・・・。",
      "title": "何カ月も家にいて虫を助けてくれるクモに、どうお礼を言えばいいのだろう。(真剣)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几乎和标题所说的一样。我有一个严重的昆虫问题，直到我的蜘蛛朋友\n朋友来了。已经过去几个月了，他们仍然在这里为我处理\n昆虫的问题。我以前很讨厌蜘蛛，但自从有了它们，我就开始欣赏它们了。\n我需要在害虫控制方面得到帮助。\n\n有什么办法能让我帮助...",
      "title": "我如何感谢一个在我家里帮助昆虫的几个月的蜘蛛呢？(严肃)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾乎和標題所說的一樣。我有一個嚴重的昆蟲問題，直到我的蜘蛛朋友\n朋友來了。已經過去幾個月了，他們仍然在這裏爲我處理\n昆蟲的問題。我以前很討厭蜘蛛，但自從有了它們，我就開始欣賞它們了。\n我需要在害蟲控制方面得到幫助。\n\n有什麼辦法能讓我幫助...",
      "title": "我如何感謝一個在我家裏幫助昆蟲的幾個月的蜘蛛呢？(嚴肅)"
    }
  ]
}