{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Saturday afternoon to all of you here at r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning February 8th,…",
  "original_created_utc": 1612630838,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks[/r/stocks]这里，各位周六下午好。我希望\n每个人都在这个子上做了相当不错的市场在过去的一周，和是\n为未来新的交易周做好准备。\n\n以下是你需要知道的一切，让你为本交易周做好准备。\n2月8日开始，...",
      "title": "华尔街展望2021年2月8日开始的交易周。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks[/r/stocks]這裏，各位週六下午好。我希望\n每個人都在這個子上做了相當不錯的市場在過去的一週，和是\n爲未來新的交易周做好準備。\n\n以下是你需要知道的一切，讓你爲本交易周做好準備。\n2月8日開始，...",
      "title": "華爾街展望2021年2月8日開始的交易周。"
    }
  ],
  "title": "Wall Street look ahead for the trading week beginning February 8th, 2021",
  "created_utc": 1612646959,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Saturday afternoon to all of you here at <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning February 8th, 2021.</p>\n\n<h1><strong>Fiscal stimulus prospects and strong earnings tailwind may propel stocks in the week ahead - <a href=\"https://www.cnbc.com/2021/02/05/fiscal-stimulus-prospects-and-strong-earnings-tailwind-may-propel-stocks-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>Stocks head into the week ahead with a tailwind, as investors focus on a hefty fiscal stimulus package and the solid earnings season against a backdrop of rising interest rates.</p>\n\n<hr/>\n\n<p>There are several dozen S&amp;P 500 companies reporting earnings, including Coca-Cola, Pepsico, Cisco and The Walt Disney Co. On the data front, there are just a few reports in the coming week, but the consumer price index inflation report is the important one to watch when it is released Wednesday.</p>\n\n<hr/>\n\n<p>Federal Reserve chairman Jerome Powell speaks mid-week at a webinar hosted by the Economics Club of New York.</p>\n\n<hr/>\n\n<p>Stocks surged in the past week, with the S&amp;P 500 jumping 4.65% to a new record high, in its best week since November. The S&amp;P 500 closed Friday at 3,886.</p>\n\n<hr/>\n\n<p>The hyper-activity around short-squeeze names, like GameStop, receded in the past week. Market chatter turned to rising interest rates, the steepening yield curve and market expectations for inflation.</p>\n\n<hr/>\n\n<p>“Rates are actually going up as really an expression of the potential that economic activity is likely to start accelerating, and we’ll likely see some inflation,” said Art Hogan, chief market strategist at National Securities.</p>\n\n<hr/>\n\n<p>Hogan said investors will stay most focused on the $1.9 trillion stimulus package, which Democrats are pushing forward. If it is signed into law at its current size, the total federal spending due to the pandemic would be $5.3 trillion, according to Cowen, an investment bank.</p>\n\n<hr/>\n\n<p>“I think the path of least resistance has resumed to a higher level. I think we had a mini correction a week ago and I think it happened pretty quickly,” said Hogan of National Securities.</p>\n\n<hr/>\n\n<p>“I think we continue to grind higher and the only bumps in the road that I can see are a delay in fiscal stimulus or some exogenous factor come in and changes the dynamics,” he added.</p>\n\n<hr/>\n\n<p>The market is also depending on continued improvement in new virus cases, said Hogan.</p>\n\n<hr/>\n\n<h1>Higher interest rates</h1>\n\n<p>The prospect of more spending and an improving economy drove Treasury yields higher in the past week.</p>\n\n<hr/>\n\n<p>The benchmark 10-year Treasury yield was at 1.16% late Friday, after edging to 1.18% earlier in the day, near its recent high of 1.19%.</p>\n\n<hr/>\n\n<p>The 10-year is the most closely watched, as it influences the rates on mortgages and other consumer and business loans. Yields rise as the price of bonds decline.</p>\n\n<hr/>\n\n<p>Market pros have also been watching another bond market metric: the yield curve.</p>\n\n<hr/>\n\n<p>It is the spread between the yield on a short-term Treasury, like the 2-year note, and a longer duration Treasury, like the 10-year. In that case, the spread widened to reach 1.06% over the course of the week.</p>\n\n<hr/>\n\n<p>That is the highest level since the second quarter of 2017. A steeper curve — which is what we’re seeing today — is viewed as a sign of an improving economy.</p>\n\n<hr/>\n\n<p>Strategists say the move higher in Treasury yields so far is not detrimental to stocks, but instead is a reflection of the economic bounce that could come from the stimulus package.</p>\n\n<hr/>\n\n<p>Tom Lee, head of research at Fundstrat Global Advisors, said the steepening curve is good for the stock market, creating a tailwind for his “epicenter” trade in stocks that will benefit from an improving post-Covid economy.</p>\n\n<hr/>\n\n<p>His preferred sectors are the cyclicals — including industrials, consumer discretionary, materials, energy and financials.</p>\n\n<hr/>\n\n<p>Lee said the selling by hedge funds after short squeezes in a number of stocks and the record decline in the VIX, the volatility index, has led him to change his view on the stock market. He previously expected a sell-off in the first half of the year.</p>\n\n<hr/>\n\n<p>Now, Lee sees a “high probability that the first half 2021 correction is over.” The VIX, which is based on puts and calls in the S&amp;P 500, started the week over 33 and fell to 20.87 when the market closed on Friday. A low VIX signals lowered expectations for market volatility.</p>\n\n<hr/>\n\n<p>The sectors that did well in the past week were mostly the ones that will do better in a financial rebound, or in a higher rate environment. Financials were 6.6% higher in the past week as big banks rose along with the yield curve. Higher long-term interest rates are a positive for bank profits.</p>\n\n<hr/>\n\n<p>The industrial group rose 4.9%, and materials were up 3.9%. Energy, lifted by a jump in oil prices, gained 8.3%. Tech recovered some ground, gaining 4.9%.</p>\n\n<hr/>\n\n<p>Sectors that do not do particularly well with rising rates, were up less, including utilities, up 2.3%, and real estate investment trusts, up 3%.</p>\n\n<hr/>\n\n<p>“It’s really about having an economic boom, allowing policy to support that boom,” said Jim Caron, head of global macro strategies on the global fixed income team at Morgan Stanley Investment Management. “That’s the key driver of why the curve is steepening.”</p>\n\n<hr/>\n\n<p>Some strategists say the curve is also steepening because of the U.S. will be issuing a lot of debt to pay for the trillions in fiscal stimulus, and that would cause interest rates to rise.</p>\n\n<hr/>\n\n<p>That has also triggered concerns about increasing inflation. While economists do not expect inflation to spike, they do see the potential, for the first time in years, for inflation to move meaningfully above 2%.</p>\n\n<hr/>\n\n<p>Markets will also be monitoring the Senate impeachment trial of President Donald Trump, which begins Feb. 9.</p>\n\n<hr/>\n\n<p>“It will get a lot of attention. Do the markets care? Maybe not, but everyone will be paying attention,” said Michael Schumacher, head of rate strategy at Wells Fargo Securities.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/9mbC6C8.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/vPfhD1c.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/v2sPAFa.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/hloQBbG.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/bDxjcbQ.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/L1HFXeU.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Ngmecgj.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/4TPLEKn.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/7f4pptB.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/FirpRcy.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/8wWPOOE.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/xCQGHw3.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/S1k039c.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Super Bowl LV: Time to Break the Tie - Go Bucs!</h1>\n\n<p>This year&#39;s Super Bowl will be a first for many different reasons. It will be the first-ever game played in the home stadium of one of the teams playing. It will be the first-ever game with a 43 year old starting QB. The age difference between the starting QBs will be the widest ever (18+ years). The game will not be played to a full stadium (atendance capped at 25K). We could go on. Another interesting aspect of this year&#39;s game is that it will break the tie between the AFC and NFC for number of championships won (27). The last time the two conferences had an equal number of Super Bowl titles was back in 1990 after Super Bowl XXIV when each conference had 12. The New York Giants broke that tie in 1991 when Scott Norwood went &#39;wide ride&#39; to give the NFC its 7th straight and 13th total Super Bowl victory. From there, the NFC continued its domination of the AFC (and the Bills) winning the next six championship games, including three against the Bills.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/020521-Super-Bowl.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>We&#39;ve all heard of the Super Bowl market indicator which says that a win for the NFC bodes well for the equity market while an AFC victory is a bearish signal. For years, there actually was a wide gap in performance for the market following wins by either conference in the past, but in recent years the disparity has narrowed. In the 27 years where the AFC has won the Super Bowl, the S&amp;P 500 averaged a rest of year gain of 6.9% with positive returns 70% of the time. When the NFC wins, though, the S&amp;P 500&#39;s average rest of year performance has been a gain of 10.5% with positive returns more than 77% of the time.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/020521-Super-Bowl-Wins-NFC-AFC.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>When it comes to individual teams, 13 have won the Super Bowl more than once. The two teams with the most victories are the Steelers and Patriots each of which has won the game six times. The Dallas Cowboys otfen refer to themselves as &#39;America&#39;s Team&#39; but Pittsburgh is the &quot;Stock Market&#39;s Team&quot;. In the six years where the Steelers won the Super Bowl, the S&amp;P 500 experienced positive returns for the remainder of the year every time for an average gain of 18.8%! Market returns for the Patriots following their six victories has been a much more muted 4.6%, including a decline more than 21% from the end of the team&#39;s first victory in 2002. The 49ers and the Broncos have &#39;only&#39; won five and three Super Bowls, respectively, but following their victories, the S&amp;P 500 has been up for the remainder of the year every time for an average gain of more then 20%!</p>\n\n<p>So, what about this year&#39;s teams? The Chiefs have won the Super Bowl twice in their history, and the S&amp;P 500 has averaged a rest of year gain of 8.1% following their victories. While the S&amp;P 500 was down for the remainder of the year after they won in 1970, the decline was less than 1%. The one year the Chiefs made it to the championship but lost, the S&amp;P 500 was up over 14% for the remainder of the year.</p>\n\n<p>For the NFC, Tampa Bay&#39;s one and only appearance in the Super Bowl was in 2003 (XXXVII). They won that game, and the S&amp;P 500&#39;s rest of year gain was over 29%. Additionally, while they&#39;re on a new team now, in the three Patriots vicotries where Tom Brady and Rob Gronkowski were both on the team, the S&amp;P 500 was higher for the remainder of the year all three times for an average gain of 12.7%. Go Bucs!</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/02/020521-Super-Bowl-Wins1.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Should Investors Root For Tom Brady Or Patrick Mahomes?</h1>\n\n<p>The Super Bowl Indicator suggests stocks rise for the full year when the Super Bowl winner has come from the original National Football League (now the NFC), but when an original American Football League (now the AFC) team has won, stocks fall. We would be the first to admit that this indicator has no connection to the stock market, but “data don’t lie”: The S&amp;P 500 Index has performed better, and posted positive gains with greater frequency, over the past 54 Super Bowl games when NFC teams have won. Of course, it doesn’t always work, as stocks did quite well the past two years even though AFC teams won.</p>\n\n<p>It was originally discovered in 1978 by Leonard Kopett, a sportswriter for the New York Times. Up until that point, the indicator had never been wrong.</p>\n\n<p>A simpler way to look at the Super Bowl Indicator is to look at the average gain for the S&amp;P 500 when the NFC has won versus the AFC—and ignore the history of the franchises. As shown in the LPL Chart of the Day, this similar set of criteria has produced an average price return of 10.2% when an NFC team has won, compared with a return of 7.1% with an AFC winner. An NFC winner has produced a positive year 79% of the time, while the S&amp;P 500 has been up only 65% of the time when the winner came from the AFC.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.3.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Here’s the catch. Stocks have actually done just fine lately when the AFC has won. In fact, the S&amp;P 500 Index gained 10 of the past 11 years after an AFC Super Bowl champ.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.3.21-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>“There have been 54 Super Bowl winners, yet only 20 teams account for those wins,” said LPL Financial Chief Market Strategist Ryan Detrick. “And wouldn’t you know it, the best stock market performance happens after the Bucs win the big game? But I don’t care, I’m still not rooting for Tom Brady.”</p>\n\n<p>Here’s a breakdown of the 20 Super Bowl winners and how the S&amp;P 500 has done following their victories. For some reason, the author’s favorite team, The Cincinnati Bengals, isn’t on this list. We double checked the data, but they still aren’t on there.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.3.21-Blog-Chart-3.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Lastly, this is Tom Brady’s record 10th Super Bowl. It turns out; stocks don’t do well when he is in the game, up only 0.5% for the year. Meanwhile, should he lose (again, what the author is hoping for here), stocks actually do quite poorly, down 10.4% on average.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.3.21-Blog-Chart-4.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Post-Election Februarys Have Been Even More Troublesome</h1>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/a3e19a00cddddb7704cdd8a753391f6e/21a0af750a31c87e-f0/s500x750/12edd49a31c1cf7460cb21815b25d793853b7db8.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>From yesterday’s post, we knew February has a tepid recent record. In post-election years, February’s historically record has been even worse as historical average losses swell. In order to include as much data as we have available, we are using DJIA data since 1901, S&amp;P 500 since 1930, NASDAQ from 1971 and Russell 1000&amp; 2000 data beginning in 1979. When comparing post-election year February to the recent 21-year February seasonal pattern, the overall shape and trend does not change greatly however, weakness becomes more prevalent as the mid-month surge is less pronounced and second half declines expand.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/3c9c5cb8cb9d933fd2d96b686791066c/21a0af750a31c87e-1e/s500x750/26d3402fd26a76aa62cc8617497bd3095256cb33.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Breaking down historical performance by year confirms frequent post-election-year February losses, most notably by NASDAQ and DJIA. Generally speaking, when February is positive it is an “ok” month, but when the month has been down, it has frequently been down by sizable amounts. There are seven double-digit losses in the table and not a single double-digit gain.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Typical February Trading: Lackluster Over Last 21 Years</h1>\n\n<p>February has historically been a rather bland month. Since 1950, S&amp;P 500 has averaged a measly –0.04%. Over the last 21-year period S&amp;P 500 average performance has declined to a loss of 0.6% in February. February’s first trading day has historically been good, like yesterday, and trading days eight, nine, ten and eleven have offered repeatable long opportunities over the last 21 years. Outside of these five days, the balance of February has been somewhat disappointing for bulls.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/a60a9842edbb3f21e9e563c33a7562c4/6f0d8f0f40089d5c-76/s500x750/fe54de992aa12faaded34731a7884ca5ac4aa150.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>As Goes January, So Goes The Year</h1>\n\n<p>Stocks got off to a nice start in 2021, until the late January selloff, as everyone got GameStop fever. Should bulls worry about what a down January might mean for the rest of 2021?</p>\n\n<p>There’s an old adage on Wall Street that suggests, “As goes January, so goes the year.” This was first discussed in 1972 by Yale Hirsh of the Stock Trader’s Almanac, and it has an impressive track record. Simply put, when the first month of the year was green, it bodes well for the rest of the year (and vice versa). Given stocks closed red in January, how worried should investors be?</p>\n\n<p>As shown below in the LPL Chart of the Day, the numbers confirm that when the S&amp;P 500 has been green in January, the index has been up 11.9% on average over the rest of the year (final 11 months) and higher 86% of the time. However, when that first month was red, stocks rose only 1.7% on average over the final 11 months and were higher barely 60% of the time.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.1.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>“A weak January could foretell of rough times ahead in 2021,” explained LPL Financial Chief Market Strategist Ryan Detrick. “The good news is lately the trend has been broken, as stocks have done quite well after a weak January.” In fact, 8 of the past 9 times January saw stocks lower the final 11 months finished higher.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.1.21-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Have We Seen the Top in Negative Yielding Debt?</h1>\n\n<p>Negative yielding debt has been one of the most extraordinary and peculiar consequences of global monetary policy initiatives, turning the basic premise of fixed income investing upside down. Instead of one party lending another party money, and the lender receiving interest in return for the risk incurred, since 2018 the levels of outstanding debt in which the lender pays the borrower for the privilege of loaning the borrower money has skyrocketed. This has left both lenders and fixed income investors in the unfortunate situation of attempting to “lose less” rather than “earn slightly more” than the value of the loan extended.</p>\n\n<p>The total value of negative yielding debt around the globe set a new record in the final month of 2020, eclipsing more than $18 trillion as governments around the world issued debt to combat the COVID-19 pandemic. The majority of these bonds are issued by governments in the developed world such as Japan and Europe, while US Treasuries remain one of the few sovereign bonds in the developed world that held positive yields throughout the pandemic. Though the Federal Reserve has committed to keeping short-term rates near zero for the foreseeable future, it should come as a relief to investors that thus far, Fed Chair Jerome Powell has dismissed the idea of negative short-term rates in the U.S.</p>\n\n<p>However, negative yielding debt does affect U.S. investors. Even after accounting for the costs of hedging out currency risks, Japanese investors can obtain 70 bps more in yield by investing in the U.S. 10-year Treasury note compared to a 10-year Japanese government bond, while German investors can earn 0.37% after hedging costs, compared with the -0.45% current yield of the German 10-year bund, which is the highest level in nearly five months. These factors increase demand for U.S. debt, which has helped to depress Treasuries yields and dampen the outlook for fixed income investors.</p>\n\n<p>What does the future of negative yielding debt look like? As shown in the LPL Chart of the Day, the good news is that this amount of negative yielding debt has declined substantially in the past two months and fallen back below the previous record high set in 2019. We believe this amount should continue to fall in 2021 as global economies recover and safe-haven yields rise, contributing to the 10-year Treasury yield moving toward our year-end 2021 forecast of 1.25–1.75%.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/02/2.4.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/7f4pptB.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/6L4NJnH.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/alaiab8.jpg\">CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY&#39;S MARKET OPEN!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 2.8.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/KrG820f.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 2.8.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/VnrFf4C.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  2.9.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/mWyKy2U.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 2.9.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/UccCkb8.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 2.10.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/GJj43CZ.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 2.10.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/osaq694.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/0pSfA1V.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES #2!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 2.11.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/Lpl6M3g.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 2.11.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/yodgbMf.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 2.12.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/OoOIw8h.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 2.12.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Canopy Growth Corporation $42.93</h1>\n\n<p><strong>Canopy Growth Corporation (CGC)</strong> is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, February 9, 2021. The consensus estimate is for a loss of $0.21 per share on revenue of $115.75 million and the Earnings Whisper ® number is ($0.10) per share. Investor sentiment going into the company&#39;s earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 22.22% with revenue increasing by 23.44%. Short interest has decreased by 22.8% since the company&#39;s last earnings release while the stock has drifted higher by 60.3% from its open following the earnings release to be 106.2% above its 200 day moving average of $20.82. Overall earnings estimates have been unchanged since the company&#39;s last earnings release. On Friday, February 5, 2021 there was some notable buying of 24,236 contracts of the $35.00 put expiring on Friday, February 19, 2021. Option traders are pricing in a 12.7% move on earnings and the stock has averaged a 12.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CGC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>General Motors Corp. $54.41</h1>\n\n<p><strong>General Motors Corp. (GM)</strong> is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, February 10, 2021. The consensus earnings estimate is $1.62 per share on revenue of $36.90 billion and the Earnings Whisper ® number is $2.20 per share. Investor sentiment going into the company&#39;s earnings release has 70% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 852.94% with revenue increasing by 19.70%. Short interest has decreased by 10.7% since the company&#39;s last earnings release while the stock has drifted higher by 47.5% from its open following the earnings release to be 63.2% above its 200 day moving average of $33.34. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, January 19, 2021 there was some notable buying of 16,747 contracts of the $60.00 call expiring on Friday, February 19, 2021. Option traders are pricing in a 6.6% move on earnings and the stock has averaged a 2.8% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=GM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Corsair Gaming, Inc. $45.23</h1>\n\n<p><strong>Corsair Gaming, Inc. (CRSR)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, February 9, 2021. The consensus earnings estimate is $0.56 per share on revenue of $530.96 million and the Earnings Whisper ® number is $0.61 per share. Investor sentiment going into the company&#39;s earnings release has 77% expecting an earnings beat. The stock has drifted higher by 69.7% from its open following the earnings release. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, January 27, 2021 there was some notable buying of 11,342 contracts of the $50.00 call expiring on Friday, February 19, 2021. Option traders are pricing in a 19.8% move on earnings and the stock has averaged a 6.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CRSR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Hasbro, Inc. $97.28</h1>\n\n<p><strong>Hasbro, Inc. (HAS)</strong> is confirmed to report earnings at approximately 6:30 AM ET on Monday, February 8, 2021. The consensus earnings estimate is $1.14 per share on revenue of $1.70 billion and the Earnings Whisper ® number is $1.23 per share. Investor sentiment going into the company&#39;s earnings release has 66% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.06% with revenue increasing by 19.05%. Short interest has increased by 5.2% since the company&#39;s last earnings release while the stock has drifted higher by 11.8% from its open following the earnings release to be 19.0% above its 200 day moving average of $81.74. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Friday, January 15, 2021 there was some notable buying of 4,150 contracts of the $97.50 call expiring on Friday, February 19, 2021. Option traders are pricing in a 9.3% move on earnings and the stock has averaged a 8.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=HAS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Twitter, Inc. $56.78</h1>\n\n<p><strong>Twitter, Inc. (TWTR)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 9, 2021. The consensus earnings estimate is $0.29 per share on revenue of $1.19 billion and the Earnings Whisper ® number is $0.38 per share. Investor sentiment going into the company&#39;s earnings release has 57% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.83% with revenue increasing by 18.13%. Short interest has decreased by 28.4% since the company&#39;s last earnings release while the stock has drifted higher by 27.5% from its open following the earnings release to be 37.3% above its 200 day moving average of $41.35. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Friday, February 5, 2021 there was some notable buying of 13,531 contracts of the $60.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 13.0% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Coca-Cola Company $49.65</h1>\n\n<p><strong>Coca-Cola Company (KO)</strong> is confirmed to report earnings at approximately 6:55 AM ET on Wednesday, February 10, 2021. The consensus earnings estimate is $0.41 per share on revenue of $8.65 billion and the Earnings Whisper ® number is $0.46 per share. Investor sentiment going into the company&#39;s earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 6.82% with revenue decreasing by 4.61%. Short interest has increased by 2.6% since the company&#39;s last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 1.6% above its 200 day moving average of $48.87. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, January 7, 2021 there was some notable buying of 8,599 contracts of the $50.00 put expiring on Friday, March 19, 2021. Option traders are pricing in a 3.4% move on earnings and the stock has averaged a 2.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Walt Disney Co $181.16</h1>\n\n<p><strong>Walt Disney Co (DIS)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Thursday, February 11, 2021. The consensus estimate is for a loss of $0.47 per share on revenue of $15.64 billion and the Earnings Whisper ® number is ($0.22) per share. Investor sentiment going into the company&#39;s earnings release has 66% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 130.72% with revenue decreasing by 25.02%. Short interest has increased by 8.3% since the company&#39;s last earnings release while the stock has drifted higher by 28.6% from its open following the earnings release to be 35.8% above its 200 day moving average of $133.40. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Tuesday, January 19, 2021 there was some notable buying of 8,283 contracts of the $150.00 put and 8,105 contracts of the $200.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 3.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Coty Inc. $7.64</h1>\n\n<p><strong>Coty Inc. (COTY)</strong> is confirmed to report earnings at approximately 6:45 AM ET on Tuesday, February 9, 2021. The consensus earnings estimate is $0.08 per share on revenue of $1.40 billion and the Earnings Whisper ® number is $0.12 per share. Investor sentiment going into the company&#39;s earnings release has 68% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 70.37% with revenue decreasing by 40.30%. Short interest has decreased by 45.2% since the company&#39;s last earnings release while the stock has drifted higher by 101.6% from its open following the earnings release to be 18.0% above its 200 day moving average of $6.47. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, January 26, 2021 there was some notable buying of 8,662 contracts of the $7.00 call expiring on Friday, January 20, 2023. Option traders are pricing in a 20.4% move on earnings and the stock has averaged a 12.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=COTY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Global Payments, Inc. $198.27</h1>\n\n<p>​<strong>Global Payments, Inc. (GPN)</strong> is confirmed to report earnings at approximately 6:55 AM ET on Monday, February 8, 2021. The consensus earnings estimate is $1.76 per share on revenue of $1.77 billion and the Earnings Whisper ® number is $1.84 per share. Investor sentiment going into the company&#39;s earnings release has 29% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 8.64% with revenue decreasing by 10.96%. Short interest has increased by 20.0% since the company&#39;s last earnings release while the stock has drifted higher by 28.7% from its open following the earnings release to be 10.7% above its 200 day moving average of $179.16. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Friday, January 15, 2021 there was some notable buying of 764 contracts of the $190.00 put expiring on Friday, February 19, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 1.6% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=GPN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Cisco Systems, Inc. $48.08</h1>\n\n<p><strong>Cisco Systems, Inc. (CSCO)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, February 9, 2021. The consensus earnings estimate is $0.75 per share on revenue of $11.92 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company&#39;s earnings release has 70% expecting an earnings beat The company&#39;s guidance was for earnings of $0.74 to $0.76 per share. Consensus estimates are for earnings to decline year-over-year by 5.06% with revenue decreasing by 0.71%. Short interest has decreased by 1.2% since the company&#39;s last earnings release while the stock has drifted higher by 16.7% from its open following the earnings release to be 11.6% above its 200 day moving average of $43.10. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, February 4, 2021 there was some notable buying of 25,762 contracts of the $50.00 call expiring on Friday, February 12, 2021. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 7.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CSCO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/stocks/comments/le1maq/wall_street_look_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "le1maq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201982
}