{
  "author": "Larkligh",
  "original_created_utc": 1659326237,
  "title": "ETH is up 60% in a month",
  "created_utc": 1659376025,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to ask the opinion of the ETH holders in this sub, do you think this bull trap will persist ? I&amp;#39;m about breaking even and want to know if I should transfer over to BTC which hasn&amp;#39;t seen the same level of explosive growth this past month. Both are the only two I hold and am wondering if this may be beneficial overall if BTC sees a similar upwards run in the near future. I&amp;#39;m not very certain of this but I don&amp;#39;t know how much longer this upward trend can last for especially since we&amp;#39;re in a recession and growth like that is hard to find. Perhaps wait until the merge ? Or will there be a sell off because of staking? Or another trend up because the merge was successful? I&amp;#39;m all ears on the sentiment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/wd7lpi/eth_is_up_60_in_a_month/",
  "subreddit": "CryptoCurrency",
  "id": "wd7lpi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'd like to ask the opinion of the ETH holders in this sub, do you think this\nbull trap will persist ? I'm about breaking even and want to know if I should\ntransfer over to BTC which hasn't seen the same level of explosive growth this\npast month. Both are the only two I hold and am wondering if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブのETHホルダーの意見を聞きたいのですが、これはどうでしょう\nは続くと思いますか？私はほぼ収支が均衡しており、BTCに移行すべきかどうかを知りたいのです。\nBTCに移行すべきかどうか知りたいのです。\nに移すべきか知りたいのです。この2つの通貨は私が持っている唯一のものであり、もしそうなら...と思っています。",
      "title": "ETHは1ヶ月で60％上昇"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想问问这个子里的ETH持有者的意见，你认为这\n牛市陷阱会持续下去吗？我想知道我是否应该\n转移到BTC上，因为BTC在过去的一个月里没有看到同样水平的爆炸性增长。\n过去一个月的爆炸性增长。这两个是我唯一持有的两个，我想知道是否...",
      "title": "ETH在一个月内上涨了60%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想問問這個子裏的ETH持有者的意見，你認爲這\n牛市陷阱會持續下去嗎？我想知道我是否應該\n轉移到BTC上，因爲BTC在過去的一個月裏沒有看到同樣水平的爆炸性增長。\n過去一個月的爆炸性增長。這兩個是我唯一持有的兩個，我想知道是否...",
      "title": "ETH在一個月內上漲了60%。"
    }
  ]
}