{
  "author": "Jorpho",
  "original_created_utc": 1643230659,
  "title": "Source for Camus quote: \"It is necessary to fall in love – if only to provide an alibi for all the random despair you are going to feel anyway.\"",
  "created_utc": 1643295341,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is no shortage of places on the Internet that will suggest Albert Camus once said, &amp;quot;It is necessary to fall in love… if only to provide an alibi for all the random despair you are going to feel anyway.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Digging a little deeper, however, none of these sources seem to indicate exactly where he said it. It&amp;#39;s enough to make me wonder whether he actually said it at all, and if people have just been misattributing it all over the Internet! &lt;/p&gt;\n\n&lt;p&gt;(I suppose he probably wrote it in French originally, but I would think there would be at least one popular English translation from which it was sourced.)&lt;/p&gt;\n\n&lt;p&gt;I hope my Google-fu is not simply failing today. Would anyone here be able to point me in the right direction, or at least suggest an appropriate place to ask? (I may try E-mailing the Quote Investigator.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/sdg8c9/source_for_camus_quote_it_is_necessary_to_fall_in/",
  "subreddit": "askphilosophy",
  "id": "sdg8c9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There is no shortage of places on the Internet that will suggest Albert Camus\nonce said, \"It is necessary to fall in love… if only to provide an alibi for all\nthe random despair you are going to feel anyway.\"\n\nDigging a little deeper, however, none of these sources seem to indicate exactly\nwhere he…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インターネット上では、アルベール・カミュを示唆するような場所に事欠かない。\n恋に落ちることは必要なことだ......すべてのアリバイを作るためにはね」。\n\"どうせ絶望を感じる\"\n\nしかし、もう少し掘り下げてみると、どの資料も正確なことは書いていないようです。\nどこで...",
      "title": "カミュの名言の出典。「恋に落ちることは必要なことだ - 君がいずれ感じることになる無作為の絶望のためのアリバイを提供するだけなら。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "互联网上不乏这样的地方：阿尔伯特-加缪曾经说过\n曾经说过：\"有必要坠入爱河......如果只是为了给所有的随机绝望提供一个不在场证明的话。\n反正你会感到随机的绝望\"。\n\n然而，再深入挖掘一下，这些消息来源似乎都没有确切表明\n他在哪里...",
      "title": "加缪语录的来源。\"有必要坠入爱河--如果只是为了给你将要感受到的所有随机的绝望提供一个不在场证明的话\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "互聯網上不乏這樣的地方：阿爾伯特-加繆曾經說過\n曾經說過：\"有必要墜入愛河......如果只是爲了給所有的隨機絕望提供一個不在場證明的話。\n反正你會感到隨機的絕望\"。\n\n然而，再深入挖掘一下，這些消息來源似乎都沒有確切表明\n他在哪裏...",
      "title": "加繆語錄的來源。\"有必要墜入愛河--如果只是爲了給你將要感受到的所有隨機的絕望提供一個不在場證明的話\"。"
    }
  ]
}