{
  "author": "Cueshark29",
  "original_created_utc": 1625272332,
  "title": "It's so weird as someone with a 100% alt coin portfolio, all I can focus on is Bitcoin.",
  "created_utc": 1625286711,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If it gets under $28.8k then basically I&#39;m fucked apparently.</p>\n\n<p>Or if it goes over $x amount then btc will go on a rampage and take all the alts with it.  Happy days.</p>\n\n<p>Everything hinges on Bitcoin, if it loses its support then all the alts tumble.</p>\n\n<p>Or if it gets above a certain amount then all the main alts will start increasing with it resulting in alt coin utopia.</p>\n\n<p>It&#39;s got to the point where it doesn&#39;t really matter if you DYOR.  </p>\n\n<p>Many projects are great in their own right.  ZIL, MATIC, VET, ALGO, XTZ, SOL, ONE, the list goes on.</p>\n\n<p>Each with their passionate developers trying to make their technology the best it can be.  But ultimately the value of their work is down to bitcoin.  At any point however good their latest innovation is, their market value plummets as soon as something or &quot;someone&quot; makes the price of bitcoin change, then suddenly everything else changes too.</p>\n\n<p>It&#39;s ridiculous tbh.  My portfolio is pretty much either red or green from top to bottom.  All these alt coins.  A sea of green or red all dependent on bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/ocnblr/its_so_weird_as_someone_with_a_100_alt_coin/",
  "subreddit": "CryptoCurrency",
  "id": "ocnblr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If it gets under $28.8k then basically I'm fucked apparently.\n\nOr if it goes over $x amount then btc will go on a rampage and take all the alts\nwith it. Happy days.\n\nEverything hinges on Bitcoin, if it loses its support then all the alts tumble.\n\nOr if it gets above a certain amount then all the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし28.8万ドルを切ってしまったら、基本的にはお手上げですね。\n\nあるいは、$xの金額を超えたら、ビットコインが暴れて、すべてのアルトを連れて行くだろう。\nを持っていきます。幸せな日々です。\n\nすべてがビットコインにかかっていて、もしビットコインがサポートを失うと、すべてのアルトが暴落します。\n\nあるいは、ある金額を超えれば、すべての...",
      "title": "100%アルトコインのポートフォリオを持っている人間としては、ビットコインばかりに注目してしまうのはとても不思議です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果它低于2.88万美元，那么基本上我就完蛋了，显然。\n\n或者，如果它超过了x美元，那么btc就会横冲直撞，把所有的alts都带走\n与它一起。快乐的日子。\n\n一切都取决于比特币，如果它失去了支持，那么所有的代理都会暴跌。\n\n或者，如果它超过了某一数额，那么所有的...",
      "title": "作为一个拥有100%另类币投资组合的人，我所能关注的是比特币，这太奇怪了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果它低於2.88萬美元，那麼基本上我就完蛋了，顯然。\n\n或者，如果它超過了x美元，那麼btc就會橫衝直撞，把所有的alts都帶走\n與它一起。快樂的日子。\n\n一切都取決於比特幣，如果它失去了支持，那麼所有的代理都會暴跌。\n\n或者，如果它超過了某一數額，那麼所有的...",
      "title": "作爲一個擁有100%另類幣投資組合的人，我所能關注的是比特幣，這太奇怪了。"
    }
  ]
}