{
  "author": "sniphist",
  "the_new_excerpt": "Hi!\n\nI'm Georgia Grainger and I'm a (hopefully) final year PhD researcher looking at\nthe social history of vasectomy in Britain, using oral history as well as\narchives to draw together a general history, since there's not really one out\nthere already! I work at the University of Strathclyde in…",
  "original_created_utc": 1612271016,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨！我是乔治亚-格雷格。\n\n我是Georgia Grainger，我是一个（希望是）最后一年的博士生研究员，正在寻找\n英国输精管结扎术的社会历史，利用口述历史和其他资料；\n的档案，以绘制一个通用的历史，因为没有真正的一个出来。\n已经有了！我在斯特拉斯克莱德大学工作，在...",
      "title": "我擅长英国输精管切除术的历史，以及更广泛的优生优育、避孕、生殖权利和男性化的历史。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨！我是喬治亞-格雷格。\n\n我是Georgia Grainger，我是一個（希望是）最後一年的博士生研究員，正在尋找\n英國輸精管結紮術的社會歷史，利用口述歷史和其他資料；\n的檔案，以繪製一個通用的歷史，因爲沒有真正的一個出來。\n已經有了！我在斯特拉斯克萊德大學工作，在...",
      "title": "我擅長英國輸精管切除術的歷史，以及更廣泛的優生優育、避孕、生殖權利和男性化的歷史。AMA!"
    }
  ],
  "title": "I specialise in the history of vasectomy in Britain and, more broadly, histories of eugenics, contraception, reproductive rights, and masculinity. AMA!",
  "created_utc": 1612280165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi!</p>\n\n<p>I&#39;m Georgia Grainger and I&#39;m a (hopefully) final year PhD researcher looking at the social history of vasectomy in Britain, using oral history as well as archives to draw together a general history, since there&#39;s not really one out there already! I work at the University of Strathclyde in Scotland and my research project operates out of the Centre for the Social History of Health and Healthcare (CSHHH) and the Scottish Oral History Centre (SOHC). I&#39;ve written a general audience piece for <a href=\"https://www.prospectmagazine.co.uk/science-and-technology/eugenics-history-uk-britain-vasectomy\">Prospect</a> (note, Paul Erlich was not a German physician, the editor googled the name to include more clarification of who he was, found the wrong Paul Erlich, and has not changed it since I spotted it, please ignore that!), if you want to get a general idea of what I&#39;m looking at.</p>\n\n<p>I&#39;m also on twitter as <a href=\"https://twitter.com/sniphist\">@sniphist</a>, it&#39;s mainly pictures of my guinea pigs but I do tweet my research sometimes.</p>\n\n<p>More broadly, I teach undergrads on histories of drugs/medicines and histories of diseases in society, and do a lot of oral history theorising around intersubjectivity of research and of my role as a young woman interviewing older men about their vasectomies.</p>\n\n<p>Ask me anything!</p>\n\n<p>&#x200B;</p>\n\n<p>(I&#39;m posting this now and will be back in a couple of hours to start responding to questions!)</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/lauzwa/i_specialise_in_the_history_of_vasectomy_in/",
  "subreddit": "AskHistorians",
  "id": "lauzwa",
  "is_self": true,
  "media": null,
  "is_video": false
}