{
  "author": "Set1Less",
  "original_created_utc": 1637814423,
  "title": "Indian banks charge users just to view account statements. Because fetching records from a database costs so much!! What a scam by HDFC bank. This is why we need crypto.",
  "created_utc": 1637833319,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Imagine trying to con people by telling them fetching database records is chargeable, and takes 4 days!</p>\n\n<p>This is what HDFC bank is telling people. </p>\n\n<p><a href=\"https://preview.redd.it/kxj01zli4o181.jpg?width=1241&amp;format=pjpg&amp;auto=webp&amp;s=b2d5cd4ce9fb56529de88a54acd14fde79cf474c\">We require 4 days to fetch database records! And btw.. you need to pay too. </a></p>\n\n<p>Anyone who knows a thing or two about computers will realize this is just a scam, a fraud played on unsuspecting people. There is no universe where it costs money to query a centralised database. They aren&#39;t sending someone to an office to fetch the records dammit, it&#39;s all on a fucking computer. </p>\n\n<p>Indian banks have atrocious charges that rip people off - from minimum balance charge, to cash withdrawal charge to check clearance charge.  </p>\n\n<p>But because these scam policies by archaic bank institutions is threatened by crypto&#39;s emergence, the central bank that allows these scams to take place is lobbying to have crypto itself prohibited, so that these shady banks can continue conning users. This is the real pyramid scheme - sucking in new unsuspecting users and charging them for every single action while holding their funds hostage.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/r1nvun/indian_banks_charge_users_just_to_view_account/",
  "subreddit": "CryptoCurrency",
  "id": "r1nvun",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Imagine trying to con people by telling them fetching database records is\nchargeable, and takes 4 days!\n\nThis is what HDFC bank is telling people.\n\nWe require 4 days to fetch database records! And btw.. you need to pay…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "データベースの記録を取るのは有料で、4日かかります」と言って、人々を騙そうとすることを想像してみてください。\n4日かかります！」と言って騙そうとすることを想像してみてください。\n\nこれはHDFC銀行が人々に伝えていることです。\n\nデータベースの記録を取得するのに4日かかります。そして、あなたはお金を払う必要があります...。",
      "title": "インドの銀行は、口座の明細を見るだけでユーザーに料金を請求します。データベースから記録を取り出すのに莫大な費用がかかるからだ。これはHDFC銀行による詐欺です。だからこそ、暗号が必要なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想象一下，试图通过告诉人们获取数据库记录是要收费的，并且需要4天的时间来欺骗他们。\n收费，而且需要4天时间\n\n这就是HDFC银行对人们所说的。\n\n我们需要4天时间来获取数据库记录! 而且，你需要支付......。",
      "title": "印度的银行仅对用户查看账户报表就收费。因为从数据库中获取记录的成本太高了！！。这是HDFC银行的一个骗局。这就是为什么我们需要加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想象一下，試圖通過告訴人們獲取數據庫記錄是要收費的，並且需要4天的時間來欺騙他們。\n收費，而且需要4天時間\n\n這就是HDFC銀行對人們所說的。\n\n我們需要4天時間來獲取數據庫記錄! 而且，你需要支付......。",
      "title": "印度的銀行僅對用戶查看賬戶報表就收費。因爲從數據庫中獲取記錄的成本太高了！！。這是HDFC銀行的一個騙局。這就是爲什麼我們需要加密貨幣。"
    }
  ]
}