{
  "author": "minimumsquirrel",
  "the_new_excerpt": "I have been a crypto investor since 2017 but only took it serious over the last\nyear. Up until last July I have always been a McDonald's manager. I was the fix\nit manager sent into problem stores to change how they operate to make profit\ntargets. I made garbage wages, was treated like garbage, and I…",
  "original_created_utc": 1617407594,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从2017年开始就成为了一名加密投资者，但在过去的时间里，我才开始认真对待\n一年了 直到去年7月，我一直是麦当劳的经理。我是固定的\n派遣经理进驻问题店铺，改变经营方式以获取利润。\n目标。我挣的是垃圾工资，被当成垃圾，我... ...",
      "title": "今晚套现，因为我终于实现了买房的目标!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2017年開始就成爲了一名加密投資者，但在過去的時間裏，我纔開始認真對待\n一年了 直到去年7月，我一直是麥當勞的經理。我是固定的\n派遣經理進駐問題店鋪，改變經營方式以獲取利潤。\n目標。我掙的是垃圾工資，被當成垃圾，我... ...",
      "title": "今晚套現，因爲我終於實現了買房的目標!"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私は2017年から暗号化投資をしていますが、本格的に取り組んだのはここ数年です。\n年になってからです。去年の7月まで、私はずっとマクドナルドの店長をしていました。私はフィックス\n問題のある店舗に送り込まれ、利益目標を達成するために運営方法を変える\n目標としていました。ゴミのような給料、ゴミのような扱い、そして私は...。",
      "title": "家を買うという目標がようやく達成できたので、今夜はキャッシュアウトします!"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私は2017年から暗号化投資をしていますが、本格的に取り組んだのはここ数年です。\n年になってからです。去年の7月まで、私はずっとマクドナルドの店長をしていました。私はフィックス\n問題のある店舗に送り込まれ、利益目標を達成するために運営方法を変える\n目標としていました。ゴミのような給料、ゴミのような扱い、そして私は...。",
      "title": "家を買うという目標がようやく達成できたので、今夜はキャッシュアウトします!"
    }
  ],
  "title": "Cashing out tonight because I finally met my goal of buying a house!",
  "created_utc": 1617412335,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been a crypto investor since 2017 but only took it serious over the last year. Up until last July I have always been a McDonald&#39;s manager. I was the fix it manager sent into problem stores to change how they operate to make profit targets. I made garbage wages, was treated like garbage, and I felt like garbage.</p>\n\n<p>In 2014 I went back to school to study an engineering technology diploma and then last year went back again to take an advanced diploma in Ocean Technology. I got my dream job making better money. With my first few paychecks I put $100 into Ethereum. I continued until October until I had invested $1500 (Canadian) and I sat on it until now. </p>\n\n<p>As of tonight between investing in gamestop and my cryptocurrency investments I have enough for a large down-payment on a house and enough for lawyers fees and moving fees. We have placed an offer in on a great house and we close the deal on May 4th. </p>\n\n<p>I want to thank the cryptocurrency community for keeping me strong when I felt like I was about to lose it all and for also reminding me that taking profits is okay. I believe in Ethereum and cryptocurrency as a whole and I have no doubt I could make more money. But, I have met my goal and it is time for me to take profits.</p>\n</div><!-- SC_ON -->",
  "score": 11021,
  "permalink": "/r/CryptoCurrency/comments/miww8c/cashing_out_tonight_because_i_finally_met_my_goal/",
  "subreddit": "CryptoCurrency",
  "id": "miww8c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875621
}