{
  "author": "FlamingOrange",
  "the_new_excerpt": "I am a new investor and while I am learning more every day and looking into\nstuff more and more, Coca Cola has caught my eye. Basically, coca cola (I'll\njust say KO for now on) was shown to have a div/yield of around 3. On top of\nthat, KO isn't going anywhere any time soon, and even though it's a…",
  "original_created_utc": 1621594144,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は新しい投資家ですが、日々勉強し、いろいろなことを調べています。\nその中で、コカ・コーラに注目しました。基本的に、コカ・コーラ（以下、KOとします。\n基本的には、コカ・コーラ（以下、KOとします）は、約3のdiv/yieldを持っていることが示されました。それに加えて\nその上、KOはすぐにどこかに行ってしまうわけではないし、たとえそれが...",
      "title": "配当金目当てでコカ・コーラを複数株投資する価値はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个新的投资者，虽然我每天都在学习更多的东西，并且越来越多地研究这些东西。\n越来越多的东西，可口可乐公司引起了我的注意。基本上，可口可乐（我将\n可口可乐（我现在只说KO）被证明有3左右的股息/收益率。除此之外\n而且，KO很快就不会消失，尽管它是一个...",
      "title": "为了分红而投资多股可口可乐公司的股票是否值得？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個新的投資者，雖然我每天都在學習更多的東西，並且越來越多地研究這些東西。\n越來越多的東西，可口可樂公司引起了我的注意。基本上，可口可樂（我將\n可口可樂（我現在只說KO）被證明有3左右的股息/收益率。除此之外\n而且，KO很快就不會消失，儘管它是一個...",
      "title": "爲了分紅而投資多股可口可樂公司的股票是否值得？"
    }
  ],
  "title": "Is it worth it to invest in multiple shares of Coca Cola for Dividends?",
  "created_utc": 1621613431,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a new investor and while I am learning more every day and looking into stuff more and more, Coca Cola has caught my eye. Basically, coca cola (I&#39;ll just say KO for now on) was shown to have a div/yield of around 3. On top of that, KO isn&#39;t going anywhere any time soon, and even though it&#39;s a gigantic thing, it&#39;s only at around 54 dollars per share. I&#39;m thinking of buying a bit more shares of this than I normally would, around 19-20 or so, so I can get a decent amount of dividends and put those back into investing. Plus they pay out dividends very soon about next month, and quarterly at that. I have tried to play it as intelligently as I could, and if something may seem dumb, to me it made logical sense. I&#39;ve mostly been investing in ETF&#39;s, with only Visa being my one blue chip company. I was wondering if it would be wise to then buy a few of KO as my next blue chip company, and buy more for the dividends aspect too. I do not want to invest in random stuff like the rip-toe currency stuff (can&#39;t say it because word filters are stupid), and I just want to be a long term investor. So again, as intelligently as I could think</p>\n\n<p>My comparison, my portfolio right now is:<br/>\n2.51 shares of VOO (Vanguard S&amp;P 500 ETF)<br/>\n3.02 shares of V (Visa)<br/>\n1.05 Shares of SPY (SPDR S&amp;P 500 ETF)<br/>\n2.53 shares of VTV (Vanguard Value ETF)<br/>\n(I plan on buying a few shares of KO but here&#39;s where I come to ask if it&#39;s worth it to buy more, around 19-20 or just buy a few like I did with the others)</p>\n\n<p>Thanks for the help and if you read this far, thanks for reading this far too. I&#39;ve also noticed IRM for similar reasons, but I don&#39;t know much about IRM compared to Coca Cola.</p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/stocks/comments/nhpkn0/is_it_worth_it_to_invest_in_multiple_shares_of/",
  "subreddit": "stocks",
  "id": "nhpkn0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388321
}