{
  "author": "8zerozero85",
  "the_new_excerpt": "The last post died in new because it was stuck in a mod queue for 6 hours. So\nreposting it for more visibility. Would love suggestions for next week's update!\n\nI have seen amazing responses on the last post which so now we getting weekly\nupdates! Weekly updates will serve the purpose to update…",
  "original_created_utc": 1622364031,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最後の投稿は、mod queueに6時間も引っかかっていたため、newで死んでしまいました。そのため\nより見やすくするために再投稿します。来週のアップデートへの提案をお待ちしています。\n\n前回の投稿には素晴らしい反応がありましたので、今は毎週のように\n毎週更新しています。毎週の更新は、更新の目的を果たすために...",
      "title": "巣ごもりをして、自分の暗号から受動的な収入を得るための包括的なガイドです。(Repost)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最后一个帖子死在了新的地方，因为它被卡在mod队列中6个小时了。所以\n重新发布以提高知名度。希望大家对下周的更新提出建议!\n\n我在上一篇文章中看到了惊人的反应，所以现在我们每周都会得到\n更新! 每周更新的目的是为了更新...",
      "title": "建立你的巢穴并从你的加密货币中获得被动收入的全面指南。(转帖)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最後一個帖子死在了新的地方，因爲它被卡在mod隊列中6個小時了。所以\n重新發布以提高知名度。希望大家對下週的更新提出建議!\n\n我在上一篇文章中看到了驚人的反應，所以現在我們每週都會得到\n更新! 每週更新的目的是爲了更新...",
      "title": "建立你的巢穴並從你的加密貨幣中獲得被動收入的全面指南。(轉帖)"
    }
  ],
  "title": "A comprehensive guide to building up your nest egg and earn passive income from your crypto. (Repost)",
  "created_utc": 1622392341,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The last post died in new because it was stuck in a mod queue for 6 hours. So reposting it for more visibility. Would love suggestions for next week&#39;s update!</p>\n\n<p>I have seen amazing responses on the last post which so now we getting weekly updates! Weekly updates will serve the purpose to update tables as new information comes in, onboard new users to the 8<sup>th</sup> wonder of the world: <strong>compound interest,</strong> and also answer your important questions!</p>\n\n<p><strong>The 3 methods mentioned below are by far the most popular ways to earn a yield on your cryptocurrency:</strong></p>\n\n<p><strong>Question:  What is Cryptocurrency Staking?</strong></p>\n\n<ul>\n<li>Staking generally refers to the holding of your cryptocurrency funds in a wallet or an exchange and hence supporting the functionality of a blockchain system. The cryptos are being locked in their wallets by the stakeholders. They are then rewarded by the network in return. Staking provides a way of making an income.</li>\n</ul>\n\n<p><strong>Question: What is Cryptocurrency Lending?</strong></p>\n\n<ul>\n<li>Crypto Lending is a transaction in which you can lend your crypto and earn interest rates that accrue over a period of time. The transaction is supported by Crypto Lending Platforms selling loans to various cryptocurrencies such as Ether, Bitcoin, and Stable Coins.</li>\n</ul>\n\n<p><strong>Question: What is Liquidity Providing?</strong></p>\n\n<ul>\n<li>Liquidity Providing is a way of earning money on your coins in a decentralized manner which is managed by the smart contract. The pool is used for liquidity to power the swapping ability of a DEX. Investors are encouraged to deposit into liquidity pools because they earn revenue from the swaps that happen on the DEX platform.</li>\n</ul>\n\n<p><strong>Question: How do I choose what is best for me?</strong></p>\n\n<ul>\n<li>Go through the pros and cons of each and you will get to know which is the best for you!</li>\n</ul>\n\n<p>Pros:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>Cryptocurrency Staking</strong></th>\n<th align=\"left\"><strong>Cryptocurrency Lending</strong></th>\n<th align=\"left\"><strong>Liquidity Providing</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Non-Custodial which means you are in control of all your coins at all times.</td>\n<td align=\"left\">Easy to use and very low learning curve. It is just a deposit and you earning interest.</td>\n<td align=\"left\">Non-Custodial which means you are in control of all your coins at all times.</td>\n</tr>\n<tr>\n<td align=\"left\">Many options you can stake in the safety of your own wallet or stake on an exchange to get instant liquidity for selling</td>\n<td align=\"left\">The reward we are compensated for FAR outweighs the non-custodial aspect of the services.</td>\n<td align=\"left\">Potential to earn the governance coin just by participating which boosts yield.</td>\n</tr>\n<tr>\n<td align=\"left\">High APY for certain coins</td>\n<td align=\"left\">Low barrier to entry which means you can start with a small number of coins too</td>\n<td align=\"left\">Highest APY out of all other options</td>\n</tr>\n</tbody></table>\n\n<p>Cons:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"><strong>Cryptocurrency Staking</strong></th>\n<th align=\"left\"><strong>Cryptocurrency Lending</strong></th>\n<th align=\"left\"><strong>Liquidity Providing</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">High barrier to entry for some coins. where you got to deposit a lot of coins if you want to stake non-custodial.</td>\n<td align=\"left\">It is a custodial Service. So you are not in control of your coins at all times</td>\n<td align=\"left\">Extremely High fees right now to deposit and withdraw liquidity from a pool.</td>\n</tr>\n<tr>\n<td align=\"left\">Vulnerable to Exploits and Hacks in the smart contract</td>\n<td align=\"left\">Vulnerable to bad decision making in the company or inside jobs</td>\n<td align=\"left\">Vulnerable to Exploits and Hacks in the smart contract</td>\n</tr>\n<tr>\n<td align=\"left\">The high learning curve for some coins like ETH2 where you have to set up validators</td>\n<td align=\"left\">Withdrawals are usually not instant</td>\n<td align=\"left\">You have to worry about slippage high gas fees and impermanent loss. So I would only suggest LPing if you are more experienced.</td>\n</tr>\n</tbody></table>\n\n<p><strong>Note: Don&#39;t get scared by the cons as the hacks and inside jobs are virtually non-existent for good exchanges, services, and smart contracts. If you DYOR effectively this should not be a problem for you.</strong></p>\n\n<p><strong>Question:</strong> <strong>How to earn a yield on Bitcoin?</strong></p>\n\n<ul>\n<li>You cant stake bitcoin so you have to rely on lending services for now</li>\n<li>Decentralized lending services exist but the APY is too low to consider (0.26%)</li>\n<li>Here are a few reputable services that provide a yield on Bitcoin</li>\n</ul>\n\n<table><thead>\n<tr>\n<th align=\"left\">Service</th>\n<th align=\"left\">Blockfi</th>\n<th align=\"left\">Crypto.com</th>\n<th align=\"left\">Celsius Network/Voyager</th>\n<th align=\"left\">Ledn.io</th>\n<th align=\"left\">Nexo.io</th>\n<th align=\"left\">Swissborg</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Annual interest rate</td>\n<td align=\"left\">5%</td>\n<td align=\"left\">1.5%</td>\n<td align=\"left\">6%</td>\n<td align=\"left\">6.1%</td>\n<td align=\"left\">4%</td>\n<td align=\"left\">3%</td>\n</tr>\n<tr>\n<td align=\"left\">Lockup</td>\n<td align=\"left\">No lockup</td>\n<td align=\"left\">No lockup normally but Lock up is also available for boosted rewards</td>\n<td align=\"left\">No lockup</td>\n<td align=\"left\">No lockup</td>\n<td align=\"left\">No lockup normally but Lock up is also available for boosted rewards</td>\n<td align=\"left\">No lockup</td>\n</tr>\n<tr>\n<td align=\"left\">Service has its own token for boosted rates?</td>\n<td align=\"left\">No</td>\n<td align=\"left\">Yes</td>\n<td align=\"left\">Yes</td>\n<td align=\"left\">No</td>\n<td align=\"left\">Yes</td>\n<td align=\"left\">Yes</td>\n</tr>\n</tbody></table>\n\n<p><strong>Note:</strong></p>\n\n<ol>\n<li><strong>Celsius and Voyager are together because Celsius has partner with Voyager to provide yield for Voyager customers.</strong></li>\n<li><strong>Celsius yield is only 6% for US customers. Internationally it&#39;s 3.51%</strong></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p><strong>Question:</strong>  <strong>How to earn a yield on Ethereum?</strong></p>\n\n<ul>\n<li>The best way right now is to partake in ETH2 staking APY is currently between 6-8%. If you have less than 32 ETH you should stake it on a reputable exchange like <strong>Kraken</strong> or <strong>Binance</strong>.</li>\n<li><strong>Important</strong>: ETH 2 rewards will be locked till ETH2 hard launches. But you can still trade back your locked eth to normal eth by the respective pairs on the exchange</li>\n<li>Another way is to do it is via rocket pool when it launches.</li>\n<li>If you don&#39;t like the idea of locking up your coins here are some services and the yield they provide on Ethereum.</li>\n</ul>\n\n<table><thead>\n<tr>\n<th align=\"left\">Service</th>\n<th align=\"left\">Blockfi</th>\n<th align=\"left\">Crypto.com</th>\n<th align=\"left\">Celsius Network/Voyager</th>\n<th align=\"left\">Nexo.io</th>\n<th align=\"left\">Swissborg</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Annual interest rate</td>\n<td align=\"left\">4.55%</td>\n<td align=\"left\">2.5%</td>\n<td align=\"left\">5.05%</td>\n<td align=\"left\">4%</td>\n<td align=\"left\">3.5%</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p><strong>Question:</strong>  <strong>How to earn a yield on Stablecoin?</strong></p>\n\n<ul>\n<li>You could use the services mentioned below or you can dip your toes in DEFI lending like Anchor protocol (over 20% APY on UST !) or use the Compound protocol.</li>\n<li>Liquidity providing is also a good option but you have to worry about slippage high, gas fees, and impermanent loss. So I would only suggest LPing if you are more experienced.</li>\n</ul>\n\n<table><thead>\n<tr>\n<th align=\"left\">Service</th>\n<th align=\"left\">Blockfi</th>\n<th align=\"left\">Crypto.com</th>\n<th align=\"left\">Celsius Network/Voyager</th>\n<th align=\"left\">Ledn.io</th>\n<th align=\"left\">Nexo.io</th>\n<th align=\"left\">Swissborg</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Annual interest rate</td>\n<td align=\"left\">9.3%</td>\n<td align=\"left\">6%</td>\n<td align=\"left\">10%</td>\n<td align=\"left\">12.5%</td>\n<td align=\"left\">8%</td>\n<td align=\"left\">7.25%</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p><strong>Question:</strong>  <strong>How to earn a yield on other coins?</strong></p>\n\n<ul>\n<li>Some coins can be staked in your wallet in your custody. Some can be staked on exchanges like Kraken and Binance. Please do not miss out on these rewards, they compound and will help you reach financial freedom quicker.</li>\n<li>Note: some of the services I mentioned above are non-custodial. The &quot;not your keys not your crypto&quot; comes to mind. But I feel that the reward we are compensated for FAR outweighs the non-custodial aspect of the services.</li>\n<li>Good websites to learn more about rates and places to earn a yield on other coins are:</li>\n<li>interest.coinmarketcap.com</li>\n<li>stakingrewards.com</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>Now for some questions that I got from the previous update.</strong></p>\n\n<p><strong>Question: I only have a small amount in crypto should I still stake my coins?</strong></p>\n\n<p>A:  credit to AhwahneeBanff</p>\n\n<ol>\n<li>Most people underestimate the power of compound interest, especially when being turbocharged by a rapidly appreciating asset.</li>\n<li>Let&#39;s say you buy 5000 Cardano at $2 and 5 years later it becomes $20. Given a 5.5% APR (The most common number I see on the stake pools) you would be earning:</li>\n<li>Year 1: 275 Cardano earned from staking, or $550 in fiat earning, 5.5% fiat return (550/10,000) Year 5: 275 Cardano earned from staking, or $5,500 in fiat earning, a 55% return! (5,500/10,000)</li>\n<li>And this is not assuming compound interest, on year 5 I would actually have 6,534 Cardano which gives 359 Cardano given a 5.5% compounded return. This means $7,180 in fiat return (359x20), which is a 71.8% return on my initial $10,000 investment into Cardano, annually!</li>\n<li>Even if you have a small portfolio you should definitely start. <strong>Magic of compound interest + appreciating asset price will help you reach your own goal a lot quicker and with a lower amount of capital than if you were to ignore it.</strong></li>\n</ol>\n\n<p>The best part is that you&#39;re usually earning it in kind, so even if the current USD value seems insignificant, I suppose you&#39;re not invested in anything you don&#39;t expect will increase in value, so every dollar this week will hopefully be worth way more. <strong>Just a nice passive DCA basically.</strong></p>\n\n<p>This means even if you think staking is insignificant right now you would be surprised if crypto adoption keeps rising a couple of years down the line.</p>\n\n<p><strong>Question:  Where&#39;s the catch for the &gt;10% yields on stablecoins? It sounds a little too good to be true, so I&#39;m skeptical...</strong></p>\n\n<p>A: There are a few ways that service can offer rates like this when other savings accounts offer fractions of this return rate:</p>\n\n<ol>\n<li>No FDIC Insurance. Without this restriction, these services can take larger risks on the assets that they hold, while traditional banks are required to hold a large amount of Treasury Bond/Cash. This also means that if these services go broke, the US Government will not step in, and reimburse our deposits.</li>\n<li>They offer loans to other companies doing business in the crypto space. Since these companies have trouble getting loans through traditional banking, these services are able to charge premium interest rates on these companies.</li>\n<li>It seems that they are also using their Crypto assets, and their novel position in the market to offer other products to consumers, like offering loans backed by your crypto, or a credit card. I would expect these offerings to expand over time.</li>\n</ol>\n\n<p><strong>Question: What is the better way, staking through a wallet or through a DEX?</strong></p>\n\n<p>A: Depends on what&#39;s easier for you personally. DEX has higher rates but more complicated to set up. CEFI is easier and just deposit and forget about it but fewer rates and centralized. It&#39;s up to you!</p>\n\n<p><strong>Question: How much do you think you will need to have invested for a return of 4k a month?</strong></p>\n\n<p>A: Depends on what coin you earning interest on. If it&#39;s a stable coin Around 400000 dollars If it is in Bitcoin it would be more like 1 million dollars worth of BTC.</p>\n\n<p><strong>Question: What is binance savings?</strong></p>\n\n<p>A: It is flexible savings on Binance, which supports a couple of dozens of coins, and takes seconds to activate.</p>\n\n<p>I hope you find the guide helpful and see you next week!</p>\n</div><!-- SC_ON -->",
  "score": 364,
  "permalink": "/r/CryptoCurrency/comments/no6x6f/a_comprehensive_guide_to_building_up_your_nest/",
  "subreddit": "CryptoCurrency",
  "id": "no6x6f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296498
}