{
  "author": "BigBootyBear",
  "original_created_utc": 1654458060,
  "title": "Why is old writing (pre 20th century) so tedious and hard to follow?",
  "created_utc": 1654465321,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Aurelius&amp;#39;s &amp;quot;Meditations&amp;quot;, Plato&amp;#39;s &amp;quot;Republic&amp;quot; and Smith&amp;#39;s &amp;quot;Wealth of Nations&amp;quot; are very similar in that they are written in a very abstract language. There are either no introductions to various ideas or arguments the authors wish to make. And if examples are being given, they are long winded and exhaustive. In &amp;quot;Wealth of Nations&amp;quot; Smith will give &amp;quot;the cobbler, and the smith, and the portman, and the shipwright&amp;quot; etc when just one or two examples would have been fine. And many very basic &amp;quot;obvious&amp;quot; ideas are explained.&lt;/p&gt;\n\n&lt;p&gt;In one hour of reading, I can &amp;quot;digest&amp;quot; 10 times more ideas out of a modern book like &amp;quot;Selfish Gene&amp;quot; than I could out of an old book like &amp;quot;Wealth of Nations&amp;quot;. And I wonder why is that the case.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/v5kw1v/why_is_old_writing_pre_20th_century_so_tedious/",
  "subreddit": "AskHistorians",
  "id": "v5kw1v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Aurelius's \"Meditations\", Plato's \"Republic\" and Smith's \"Wealth of Nations\" are\nvery similar in that they are written in a very abstract language. There are\neither no introductions to various ideas or arguments the authors wish to make.\nAnd if examples are being given, they are long winded and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アウレリウスの「瞑想録」、プラトンの「共和国」、スミスの「国富論」などは、非常に抽象的な言葉で書かれている点で似ています。\n非常に抽象的な言葉で書かれている点で、非常によく似ている。また\nまた、著者が主張したい様々な思想や主張の紹介がない。\nそして、もし例が示されているとしても、それは長ったらしいもので、...",
      "title": "昔の文章（20世紀以前）は、どうしてこうも面倒で難しいのだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "奥勒留的 \"沉思录\"、柏拉图的 \"共和国 \"和斯密的 \"国富论 \"非常相似，都是用非常抽象的语言写成。\n它们非常相似，都是用非常抽象的语言写成的。有\n要么没有对作者希望提出的各种观点或论点进行介绍。\n即使是举例，也是冗长的、...",
      "title": "为什么古老的写作（20世纪以前）如此乏味和难以理解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "奧勒留的 \"沉思錄\"、柏拉圖的 \"共和國 \"和斯密的 \"國富論 \"非常相似，都是用非常抽象的語言寫成。\n它們非常相似，都是用非常抽象的語言寫成的。有\n要麼沒有對作者希望提出的各種觀點或論點進行介紹。\n即使是舉例，也是冗長的、...",
      "title": "爲什麼古老的寫作（20世紀以前）如此乏味和難以理解？"
    }
  ]
}