{
  "author": "clodhopper88",
  "the_new_excerpt": "It's really daunting seeing the Crypto market on it's way to a new ATH, and\nhaving your portfolio barely move....\n\nThat said, everyone shouting from the rooftops at how well ETH or alts are\nperforming, is just as scared as you and likely wouldn't be on reddit if they\nhad financial freedom.\n\nIn a sea…",
  "original_created_utc": 1612364016,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "看到Crypto市场在走向新的ATH的路上，真的是让人望而生畏，而且。\n让你的投资组合几乎不动....\n\n说到这里，大家都在屋顶上大喊ETH或alts有多好。\n表演，是一样害怕你，很可能不会在reddit上，如果他们。\n有财务自由。\n\n在海...",
      "title": "只是每天提醒大家，这里的人都不是有钱人，我保证你不会被落下....。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到Crypto市場在走向新的ATH的路上，真的是讓人望而生畏，而且。\n讓你的投資組合幾乎不動....\n\n說到這裏，大家都在屋頂上大喊ETH或alts有多好。\n表演，是一樣害怕你，很可能不會在reddit上，如果他們。\n有財務自由。\n\n在海...",
      "title": "只是每天提醒大家，這裏的人都不是有錢人，我保證你不會被落下....。"
    }
  ],
  "title": "Just a daily reminder that everyone here isn't rich, and I promise you're not being left behind....",
  "created_utc": 1612381329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s really daunting seeing the Crypto market on it&#39;s way to a new ATH, and having your portfolio barely move....</p>\n\n<p>That said, everyone shouting from the rooftops at how well ETH or alts are performing, is just as scared as you and likely wouldn&#39;t be on reddit if they had financial freedom. </p>\n\n<p>In a sea of green, you might be asking yourself &quot;why didn&#39;t I invest in X project&quot; or &quot;maybe if I sell now, and buy into X project instead, I&#39;ll be in a better situation&quot;.</p>\n\n<p>Understand that these mind-sets will get you into big trouble, especially given the 2017 hype when the entire crypto world was FOMO&#39;d in, only to have a nifty 2 year break period to follow. </p>\n\n<p>This is all super exciting, guys. But please USE YOUR HEAD and get your mind out of the gutter in assuming that if you don&#39;t invest right this second, you stand to lose the ability of gaining money. </p>\n\n<p>I promise you that calmer heads prevail in this game. It&#39;s a &quot;hurry up and wait&quot; situation in 90% of crypto cases. </p>\n\n<p>Just please take a deep breath, do your research, and plan/invest accordingly.</p>\n</div><!-- SC_ON -->",
  "score": 594,
  "permalink": "/r/CryptoCurrency/comments/lbp7k4/just_a_daily_reminder_that_everyone_here_isnt/",
  "subreddit": "CryptoCurrency",
  "id": "lbp7k4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532602
}