{
  "author": "VulfSki",
  "original_created_utc": 1628611674,
  "title": "Is there an increase in the average IQ of people born after the worldwide ban of leaded gasoline?",
  "created_utc": 1628666994,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We know lead hinders brain development, and makes us a little bit slower. Some have argued that leaded gasoline was responsible for reducing the iq of generations of people. It has now been a while since leaded gasoline has been banned worldwide. </p>\n\n<p>Do we see any non-negligible difference in levels of intelligence in people before and after the lead ban? </p>\n\n<p>(I know IQ is an imperfect measure of intelligence it is just one data point. And I use it for a lack of a better metric)</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/p1sami/is_there_an_increase_in_the_average_iq_of_people/",
  "subreddit": "askscience",
  "id": "p1sami",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We know lead hinders brain development, and makes us a little bit slower. Some\nhave argued that leaded gasoline was responsible for reducing the iq of\ngenerations of people. It has now been a while since leaded gasoline has been\nbanned worldwide.\n\nDo we see any non-negligible difference in levels of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "鉛は脳の発達を妨げ、人間の動きを少し鈍くすることがわかっています。ある\n有鉛ガソリンは、何世代にもわたって人々のIQを低下させてきたと主張する人もいます。\n世代の人々のIQを下げたと主張する人もいます。有鉛ガソリンが世界的に禁止されてからしばらく経ちました。\n世界的に禁止されて久しいですね。\n\n世代間のIQに無視できない差はあるのだろうか。",
      "title": "有鉛ガソリンが世界的に禁止された後に生まれた人の平均IQは上昇しているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们知道，铅会阻碍大脑发育，并使我们的速度变慢一些。有些人\n有些人认为，含铅汽油是降低几代人智商的原因。\n几代人的智力。现在已经有一段时间了，含铅汽油已经在世界范围内被禁止。\n世界范围内被禁止。\n\n我们是否看到了任何不可忽视的差异，在...",
      "title": "世界范围内禁止使用含铅汽油后出生的人的平均智商是否有提高？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們知道，鉛會阻礙大腦發育，並使我們的速度變慢一些。有些人\n有些人認爲，含鉛汽油是降低幾代人智商的原因。\n幾代人的智力。現在已經有一段時間了，含鉛汽油已經在世界範圍內被禁止。\n世界範圍內被禁止。\n\n我們是否看到了任何不可忽視的差異，在...",
      "title": "世界範圍內禁止使用含鉛汽油後出生的人的平均智商是否有提高？"
    }
  ]
}