{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Saturday afternoon to all of you here on r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning April 26th,…",
  "original_created_utc": 1619278531,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks [/r/stocks]をご覧の皆さん、土曜日の午後はいかがでしょうか。私は\nこのサブにいる皆さんは、先週の市場でうまく儲けて、これから始まる新しい取引の準備をしていることと思います。\n新しい週に向けて準備ができていることと思います。\n\nここでは、今週の取引の準備のために知っておくべきことをお伝えします。\n4月26日からの",
      "title": "2021年4月26日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "周六下午，在r/stocks [/r/stocks]的各位朋友们，大家好。我希望\n大家在过去的一周里在市场上赚得盆满钵满，并准备好迎接新的交易周。\n准备好迎接新的交易周的到来。\n\n以下是你需要知道的一切，让你为本周的交易做好准备\n从4月26日开始，...",
      "title": "2021年4月26日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "週六下午，在r/stocks [/r/stocks]的各位朋友們，大家好。我希望\n大家在過去的一週裏在市場上賺得盆滿鉢滿，並準備好迎接新的交易周。\n準備好迎接新的交易周的到來。\n\n以下是你需要知道的一切，讓你爲本週的交易做好準備\n從4月26日開始，...",
      "title": "2021年4月26日開始的交易周，華爾街一週前瞻"
    }
  ],
  "title": "Wall Street Week Ahead for the trading week beginning April 26th, 2021",
  "created_utc": 1619288168,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Saturday afternoon to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning April 26th, 2021.</p>\n\n<h1><strong>Taxes and inflation will be key themes for markets in the week ahead - <a href=\"https://www.cnbc.com/2021/04/23/taxes-and-inflation-will-be-key-themes-for-markets-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>The final week of April is going to be a busy one for markets with a Federal Reserve meeting and a deluge of earnings news.</p>\n\n<hr/>\n\n<p>Hot topics in markets will continue to be inflation and taxes.</p>\n\n<hr/>\n\n<p>President Joe Biden is expected to detail his “American Families Plan” and the tax increases to pay for it, including a much higher capital gains tax for the wealthy. The plan is the second part of his Build Back Better agenda and will include new spending proposals aimed at helping families. The president addresses a joint session of Congress Wednesday evening.</p>\n\n<hr/>\n\n<p>It’s a huge week for earnings with about a third of the S&amp;P 500 reporting, including Big Tech names, such as Apple, Microsoft, Alphabet and Amazon.</p>\n\n<hr/>\n\n<p>As many have already done, firms like Boeing, Ford, Caterpillar and McDonald’s, are likely to detail cost pressures they are facing from rising materials and transportation costs and supply chain disruptions.</p>\n\n<hr/>\n\n<p>At the same time, the Fed is expected to defend its policy of letting inflation run hot, while assuring markets it sees the pick-up in prices as only temporary. The central bank meets on Tuesday and Wednesday.</p>\n\n<hr/>\n\n<h1>The central bank takes the main stage</h1>\n\n<p>“I think the Fed would like not to be a feature next week, but the Fed will be forced from the background because of concerns about inflation,” said Diane Swonk, chief economist at Grant Thornton.</p>\n\n<hr/>\n\n<p>The central bank is not expected to make any policy moves, but Fed Chairman Jerome Powell’s press briefing following the meeting Wednesday will be closely watched.</p>\n\n<hr/>\n\n<p>So far, the barrage of earnings news has been positive, with 86% of companies reporting earnings beats. Corporate profits are expected to be up about 33.9% for the first quarter, based on estimates and actual reports, according to Refinitiv. Revenues are about 9.9% higher.</p>\n\n<hr/>\n\n<p>There is important inflation data Friday when the Fed’s preferred inflation gauge is reported.</p>\n\n<hr/>\n\n<p>The personal consumption expenditure report is expected to show a 1.8% rise in core inflation, still below the Fed’s target of 2%. Other data releases include the first-quarter gross domestic product on Thursday, which is expected to have grown by 6.5%, according to Dow Jones.</p>\n\n<hr/>\n\n<p>“I think the Fed has no urgency to shift monetary policy at this point,” said Ian Lyngen, head of U.S. rates strategy at BMO. “The Fed needs to acknowledge that the data is improving. We had a strong first quarter.”</p>\n\n<hr/>\n\n<p>“The Fed needs to acknowledge that but at the same time they’re keeping extremely accommodative policy in place, so they’ll have to make a note to the fact that the easy policy is warranted,” he said.</p>\n\n<hr/>\n\n<p>Lyngen said the Fed will likely point to continued concerns about the pandemic globally as a potential risk to the economic recovery.</p>\n\n<hr/>\n\n<p>Powell is also expected to once more explain that the Fed will let inflation rise above its 2% target for a period of time before it raises rates so that the economy can have more time to heal. “It’s going to be a challenge for the Fed,” said Swonk.</p>\n\n<hr/>\n\n<p>The base effects for the next several months will make inflation appear to have jumped sharply because of the comparison to a weak period last year. The consumer price index for April could be above 3%, compared to 2.6% last month, Swonk added.</p>\n\n<hr/>\n\n<p>“The Fed is trying to let a lot more people get out onto the dance floor before it calls ‘last call,’” she said. “Really what Powell has been saying since day one is if we take care of people on the margins and bring them back into the labor force, the rest will take care of itself.”</p>\n\n<hr/>\n\n<p>Stocks were slightly lower in the past week, and Treasury yields held at lower levels. The 10-year yield, which moves opposite price, was at 1.55% Friday.</p>\n\n<hr/>\n\n<p>The S&amp;P 500 was down 0.1%, ending the week at 4,180, while Nasdaq Composite was down nearly 0.3% at 14,016. The Dow was off just shy of 0.5% at 34,043.</p>\n\n<hr/>\n\n<h1>Tax hike prospects</h1>\n\n<p>Stocks were hit hard on Thursday when after a news report said that Biden is expected to propose a capital gains tax rate of 39.6% for people earning more than $1 million a year.</p>\n\n<hr/>\n\n<p>Combined with the 3.8% net investment income tax, the new levy would more than double the long term capital gains rate of 20% or the richest Americans.</p>\n\n<hr/>\n\n<p>Strategists said Biden is expected to propose raising the income tax rate for those earning more than $400,000.</p>\n\n<hr/>\n\n<p>“I think a lot of people are starting to price in the risk there going to be a significant increase in both corporate and capital gains taxes,” said Lyngen.</p>\n\n<hr/>\n\n<p>So far, companies have not provided much in the way of commentary on the proposed hike in corporate taxes to 28% from 21% but they have been talking about other costs.</p>\n\n<hr/>\n\n<p>David Bianco, chief investment strategist for the Americas at DWS, said he expects larger companies will do better dealing with supply chain constraints than smaller ones. Big Tech is also likely to fare better during the semiconductor shortage than auto makers, which have already announced production shutdowns, he said.</p>\n\n<hr/>\n\n<p>“Next week is tech week. I think we’re going to get down on our knees and just be in awe of their business models and their ability to grow at a behemoth scale,” Bianco said.</p>\n\n<hr/>\n\n<p>He said he’s not in favor of Wall Street’s popular trade into cyclicals and out of growth. He still favors growth.</p>\n\n<hr/>\n\n<p>“We’re overweight equities really because we’re concerned about rising interest rates,” Bianco said. “I’m not bullish in that I expect the market to rise that much from here.”</p>\n\n<hr/>\n\n<p>“We stuck with growth and dug deeper into bond substitutes, utilities, staples, real estate,” he said, adding he is underweight industrials, energy and materials. “Energy is doomed. It’s being nationalized via regulation. I do like industrials, they are well-run companies, but I do think infrastructure spending expectations for classic infrastructure are too high.”</p>\n\n<hr/>\n\n<p>He also said industrials are good businesses, but the stocks have become overvalued.</p>\n\n<hr/>\n\n<p>Bianco said he likes big box stores, but smaller retailers are facing big challenges that were already impacting them prior to Covid. He also finds small biotech firms attractive.</p>\n\n<hr/>\n\n<p>“I like healthcare stocks. Those valuations are reasonable. People have been paranoid about politicians beating on them since 1992. They manage through it and lately they’ve been delivering,” he said.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/03KqldG.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/FctG7IL.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Iq1PKMJ.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/eegfti6.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/cdNcBaJ.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/yhkNZLm.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/9js7oZJ.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/g84GywG.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/64LgRnj.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/dD0vkLd.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/LaQNKey.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/rOIVB71.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/hKlmSsP.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Fntbm0R.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Next Bump in Post-Election Year Rally Could Be in May</h1>\n\n<p>As of yesterday’s close, DJIA was up 10.5% year-to-date. S&amp;P 500 was up 10.1% and NASDAQ was at 7.0%. Compared to average post-election year historical performance since 1950 graphed in the charts above and below, DJIA, S&amp;P 500 and NASDAQ are all still comfortably above past post-election year average performance for this point of the year.</p>\n\n<p>Due to Covid-19, 2021 so far has been more volatile than the average post-election year. Aside from larger magnitude swings in performance, we have observed the return of seasonality with choppiness in February and weakness in March following monthly options expiration. Strength this April is also aligning with historical in post-election year April strength.</p>\n\n<p>Historically, the next area of potential concern for the current rally is just after mid-May. This is also right around the time Q1 earnings season is beginning to wrap and focus shifts to Q2 estimates, graduations, and other early summer activities.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/6d832ea3cc4bbc31e8cfe94f03d98ac6/8e21ed4124083bdb-70/s500x750/83b3d05531a38363e7eae827dfdc65cea7df6790.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/8d8b97ef2c731be8f580e16dbe25d431/8e21ed4124083bdb-5f/s500x750/1e8a68dfbdeea8147d89c8ac91122b1b05419ecb.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/cd741bab290266df3e64e5ed52a0d7a7/8e21ed4124083bdb-b0/s500x750/6384a25868caf6c5fcfad8e452b0ae508758114a.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Leading Indicators Suggest an Accelerating U.S. Economy</h1>\n\n<p>The economic reacceleration is underway in the U.S., as the expanding vaccination campaign, lifting of mobility restrictions, and infusion of fiscal stimulus combined to lift the Conference Board’s Leading Economic Index (LEI) in March. The LEI grew 1.3% month over month, ahead of Bloomberg consensus forecasts of 1%, raising the Conference Board’s gross domestic product (GDP) expectations to 6% on a year-over-year basis.</p>\n\n<p>After a weaker-than-expected February release that was primarily disrupted by the winter storm, data in March snapped back in a strong fashion. All ten components of the LEI rose in March, while jobless claims were the largest contributor to the growth of the index. Labor market data has continued to improve since the measurement period, as weekly jobless claims have posted back-to-back pandemic lows. The ISM New Orders Index was the second largest contributor to the LEI, which climbed to its highest levels since 2004.</p>\n\n<p>The Conference Board revised the February data lower, however, snapping what was a 10-month streak of growth for the index. As shown in the LPL Chart of the Day, the LEI is back on the rise, suggesting further economic momentum in the coming months:</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.23.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>“Momentum breeds momentum, and we expect the U.S. economy will continue to improve in the coming months as we move forward with reopening plans,” noted LPL Financial Chief Market Strategist Ryan Detrick. “As the rest of the world continues to improve as well, we expect some spill-over effects to also benefit the US economy.”</p>\n\n<p>The U.S. is currently vaccinating around 3 million people per day, according to the Center for Disease Control (CDC), and over half of the adult population has received at least one dose of the vaccine. Meanwhile, over 80% of the population above the age of 65—the most at-risk age segment of the population—has received at least one dose of the vaccine. The improving vaccination data has helped embolden policymakers to lift restrictions, and prompted us to upgrade our GDP forecast for the U.S. to 6.25-6.75% in our recent Weekly Market Commentary.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>What Happens After The First Rate Hike?</h1>\n\n<p>“Don’t fight the Fed.” Old investment saying</p>\n\n<p>One of the popular questions we’ve received lately is what do stocks do after the first rate hike? Let’s be clear, we think the Federal Reserve Bank (Fed) will leave rates low until at least 2023, but what if we get a sudden dose of inflation? This isn’t our base case, but a rate hike could potentially happen sooner in that situation.</p>\n\n<p>After all, the first rate hike in 2015 set off a huge sell-off into early February 2016, as the market was quite upset and let it be known that it felt the Fed acted too soon. In fact, the first hikes of 2004 and 1999 also saw losses the first three months after the first hike, but eventually stocks were in the green a year later.</p>\n\n<p>“The first hike in recent cycles has indeed brought with it some selling pressure, but hikes usually take place in strong economies, so it isn’t surprising to see returns turn green once you go further out,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But let’s not sound any alarms yet, we don’t see a rate hike for a couple of years. Still, it’s good to know what the playbook could be once it happens.”</p>\n\n<p>As shown in the LPL Chart of the Day, that initial rate hike can cause some hiccups the first three months, but returns turn much better 6- and 12-months later.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.21.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a></strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Twin Deficits and the US Dollar</h1>\n\n<p>It was a particularly challenging year for the greenback in 2020, where the world’s reserve currency acted as a “safe haven” asset at the height of the March 2020 market volatility, only to fall over the remainder of the year. With the U.S. outpacing much of the developed world in economic growth in 2021, Treasury yields have been rising and the dollar has strengthened, bucking the consensus view for dollar weakness.</p>\n\n<p>We view the “twin deficits” of the U.S. economy—the combination of the budget deficit and the current account deficit—as a long-term structural driver of a weaker U.S. dollar. As a historical net importer, the U.S. has usually carried a trade deficit (leading to a broader current account deficit in the process), while the flood of pandemic aid has stretched the budget deficit and ballooned the sum of the twin deficits to all-time lows as a percent of gross domestic product (GDP). As shown in the LPL Chart of the Day, changes in the twin deficits have been a relatively accurate predictor in the long-term trend of the value of the US dollar:</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.22.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>With the twin deficits reaching all-time lows, it’s hard to be bullish the US dollar over the long-term relative to its major counterparts. “The short-dollar trade has certainly been a frustrating one for investors this year, but the long-term trend continues to point lower,” added LPL Financial Chief Market Strategist Ryan Detrick. “However, a counter-trend rally like we saw in the first quarter might have been enough to flush out some of the crowded consensus for a lower dollar.”</p>\n\n<p>U.S. economic growth has outpaced our developed nation counterparts to begin 2021, but expectations for growth in the rest of the world may be playing catch up. In particular, the 30-year German bund yield broke out to its highest level since the onset of the pandemic, suggesting growth expectations for one of our major trade partners may be on the rise.</p>\n\n<p>A soft dollar has a variety of investment implications. While we continue to favor U.S. stock market exposure over developed international markets, investments overseas may benefit from the tailwind of the softer dollar. Meanwhile, commodities have historically benefitted from a weaker dollar, and may be positioned for further upside as economic activity in the rest of the world heats up. For more on our tactical market views, check out our April Global Portfolio Strategy.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Dips in Short Supply</h1>\n\n<p>While many areas of the market have seen sizable pullbacks this year, the broader market has been stingier. Just this morning, a client was lamenting the fact that they had a decent amount of cash, but the market just wasn&#39;t providing opportunities to get in. So far this year, the S&amp;P 500&#39;s largest decline from a peak (on a closing basis) has been 4.23%, and given that we&#39;re not even four full months into the year, we initially thought that 4% seemed normal enough especially when the earlier months of the year tend to be positive.</p>\n\n<p>In order to see how this year stacks up to prior years, the chart below shows the duration into each year (on a percentage basis) that the S&amp;P 500 first closed down 5% or more from its YTD peak. Years in green indicate that there wasn&#39;t a single point in the entire year that the S&amp;P 500 experienced a 5% decline. The last occurrence was in 2017, and there have been a total of seven years since 1928. As we near the end of April, we&#39;re nearly a third of the way into 2021, and compared to the &#39;average&#39; year, we&#39;ve already gone longer without a 5% pullback. Since 1928, the S&amp;P 500 usually experiences its first 5%+ pullback 28% of the way into the year, which coincidentally enough works out to April 15th - the day before Federal taxes are typically due! In fact, at this point in prior years, the S&amp;P 500 has already experienced its first 5%+ pullback more than 65% of the time. Believe it or not, in 30% of all years since 1928 the first 5% drop occurred in the month of January.</p>\n\n<p>Based on prior years, the market to this point has in fact been stingy in terms of providing opportunities for investors to add exposure, although based on today&#39;s reports of new capital gains tax increases from the Biden Administration, that window may soon open.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/042221-5-Pullbacks.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>What is a 200-Day Moving Average Again?</h1>\n\n<p>If we&#39;ve learned anything over the last two trading days after what seemed like a one-way move higher for the S&amp;P 500, it is that equities can also go down. Even after the declines of the last couple of days, though, the S&amp;P 500 still remains close to 4% above its 50-day moving average (DMA) and more than 10% above its 200-DMA. While there have been a handful of days since the COVID lows where the S&amp;P 500 has dipped below its 50-DMA, there hasn&#39;t been a single day since last June where the S&amp;P 500 came even close to testing its 200-DMA. We&#39;re only in late April now, but as long as the S&amp;P 500 doesn&#39;t see a significant fall in the next two months, it has the potential to go a full year without closing below its 200-DMA. When the 200-DMA does finally come into play again, many investors may not recognize what it is.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/042021-SP-500.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The chart below shows the percentage of time over a rolling one-year period that the S&amp;P 500 traded above its 200-DMA. At 89% now, the current level is hardly remarkable by historical standards. Right before the COVID crash last year, the percentage reached as high as 97.6%, and three years ago in March 2018, it was up at 100%. What is remarkable about the chart, though, is how elevated this moving average has been for so long. The last time it was below 50% was back in December 2009!</p>\n\n<p>It&#39;s easy to tell by looking at the chart, but thanks to short and swift pullbacks in the post-financial crisis period, this current streak without a sub-50% reading is the longest on record. To put a little more meat on the example, after the current streak of nearly 11.5 years, the next longest streak stretched over a period of just under ten years spanning from April 1991 through March 2001 while the one behind that was less than five years (ending in May 2008). And you only thought the market had been defying gravity recently!</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/042021-Above-200-DMA.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/dD0vkLd.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/tcxvmqm.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/hcAO3Gz.jpg\">CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY&#39;S MARKET OPEN!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/IAo7GlZ.jpg\">CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE NEXT FEW WEEKS!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/j0DqRRh.jpg\">CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLF COMPANIES FOR THE NEXT FEW WEEKS!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/mnzxCHb.jpg\">CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLK COMPANIES FOR THE NEXT FEW WEEKS!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/08xmiRX.jpg\">CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLV COMPANIES FOR THE NEXT FEW WEEKS!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/YpSjzzQ.jpg\">CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLI COMPANIES FOR THE NEXT FEW WEEKS!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 4.26.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/CSjyM5z.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 4.26.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/5f8y7hV.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  4.27.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/oiJIwAm.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/HBIDjE9.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h1><strong><em>Tuesday 4.27.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/ROeEsDZ.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/ULBdPab.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 4.28.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/vMsmAhL.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/rmljNNP.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h1><strong><em>Wednesday 4.28.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/RDE1FuX.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/yNRtL7R.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/SVlEwKR.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 4.29.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/4agD6a7.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/e1ex0sZ.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/J6Nw60b.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n\n<h1><strong><em>Thursday 4.29.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/VvVoXXd.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/bBCcQ78.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/HmfBR4U.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 4.30.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/kc3V6fB.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 4.30.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/t7kDKVf.png\">CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Apple, Inc. $134.32</h1>\n\n<p><strong>Apple, Inc. (AAPL)</strong> is confirmed to report earnings at approximately 4:30 PM ET on Wednesday, April 28, 2021. The consensus earnings estimate is $0.99 per share on revenue of $77.06 billion and the Earnings Whisper ® number is $1.08 per share. Investor sentiment going into the company&#39;s earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 55.29% with revenue increasing by 32.15%. Short interest has increased by 1.6% since the company&#39;s last earnings release while the stock has drifted lower by 3.7% from its open following the earnings release to be 11.1% above its 200 day moving average of $120.93. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, April 8, 2021 there was some notable buying of 49,660 contracts of the $140.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 4.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Tesla, Inc. $729.40</h1>\n\n<p><strong>Tesla, Inc. (TSLA)</strong> is confirmed to report earnings at approximately 4:10 PM ET on Monday, April 26, 2021. The consensus earnings estimate is $0.78 per share on revenue of $10.24 billion and the Earnings Whisper ® number is $0.86 per share. Investor sentiment going into the company&#39;s earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 248.21% with revenue increasing by 71.09%. Short interest has decreased by 17.9% since the company&#39;s last earnings release while the stock has drifted lower by 11.0% from its open following the earnings release to be 31.5% above its 200 day moving average of $554.56. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, April 19, 2021 there was some notable buying of 25,000 contracts of the $1,030.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 6.6% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Advanced Micro Devices, Inc. $82.76</h1>\n\n<p><strong>Advanced Micro Devices, Inc. (AMD)</strong> is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $0.44 per share on revenue of $3.21 billion and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company&#39;s earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 144.44% with revenue increasing by 79.73%. Short interest has increased by 34.4% since the company&#39;s last earnings release while the stock has drifted lower by 9.2% from its open following the earnings release to be 0.2% above its 200 day moving average of $82.58. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, April 12, 2021 there was some notable buying of 41,267 contracts of the $80.00 call and 39,182 contracts of the $80.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 5.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Amazon.com, Inc. -</h1>\n\n<p><strong>Amazon.com, Inc. (AMZN)</strong> is confirmed to report earnings at approximately 4:00 PM ET on Thursday, April 29, 2021. The consensus earnings estimate is $9.65 per share on revenue of $104.41 billion and the Earnings Whisper ® number is $11.56 per share. Investor sentiment going into the company&#39;s earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 92.61% with revenue increasing by 38.38%. Short interest has increased by 61.1% since the company&#39;s last earnings release while the stock has drifted lower by 2.5% from its open following the earnings release to be 5.3% above its 200 day moving average of $3,172.75. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, April 22, 2021 there was some notable buying of 8,119 contracts of the $3,400.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 4.5% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Microsoft Corp. $261.15</h1>\n\n<p><strong>Microsoft Corp. (MSFT)</strong> is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $1.76 per share on revenue of $41.03 billion and the Earnings Whisper ® number is $1.86 per share. Investor sentiment going into the company&#39;s earnings release has 85% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.71% with revenue increasing by 17.16%. Short interest has increased by 23.5% since the company&#39;s last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 17.2% above its 200 day moving average of $222.86. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, April 20, 2021 there was some notable buying of 9,063 contracts of the $265.00 call expiring on Friday, July 16, 2021. Option traders are pricing in a 3.6% move on earnings and the stock has averaged a 2.6% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Facebook Inc. $301.13</h1>\n\n<p><strong>Facebook Inc. (FB)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, April 28, 2021. The consensus earnings estimate is $2.36 per share on revenue of $23.53 billion and the Earnings Whisper ® number is $2.68 per share. Investor sentiment going into the company&#39;s earnings release has 84% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.01% with revenue increasing by 32.66%. The stock has drifted higher by 8.6% from its open following the earnings release to be 11.7% above its 200 day moving average of $269.60. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, April 14, 2021 there was some notable buying of 18,839 contracts of the $310.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 5.9% move on earnings and the stock has averaged a 5.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>NIO Inc. $41.08</h1>\n\n<p><strong>NIO Inc. (NIO)</strong> is confirmed to report earnings at approximately 5:00 PM ET on Thursday, April 29, 2021. Investor sentiment going into the company&#39;s earnings release has 67% expecting an earnings beat. Short interest has increased by 27.8% since the company&#39;s last earnings release while the stock has drifted lower by 10.9% from its open following the earnings release to be 15.8% above its 200 day moving average of $35.47. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, April 22, 2021 there was some notable buying of 32,398 contracts of the $40.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 9.6% move on earnings and the stock has averaged a 17.2% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=NIO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Boeing Co. $238.38</h1>\n\n<p><strong>Boeing Co. (BA)</strong> is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, April 28, 2021. The consensus estimate is for a loss of $1.17 per share on revenue of $15.41 billion. Investor sentiment going into the company&#39;s earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 31.18% with revenue decreasing by 8.86%. Short interest has decreased by 9.0% since the company&#39;s last earnings release while the stock has drifted higher by 21.1% from its open following the earnings release to be 20.2% above its 200 day moving average of $198.38. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 17,621 contracts of the $250.00 call and 17,205 contracts of the $250.00 put expiring on Friday, May 21, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>nited Parcel Service, Inc. $178.96</h1>\n\n<p><strong>United Parcel Service, Inc. (UPS)</strong> is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $1.63 per share on revenue of $20.47 billion and the Earnings Whisper ® number is $2.03 per share. Investor sentiment going into the company&#39;s earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 41.74% with revenue increasing by 13.50%. Short interest has increased by 32.9% since the company&#39;s last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 11.3% above its 200 day moving average of $160.74. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 14,036 contracts of the $190.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 6.8% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=UPS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Pinterest, Inc. $74.99</h1>\n\n<p><strong>Pinterest, Inc. (PINS)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $0.08 per share on revenue of $472.67 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company&#39;s earnings release has 81% expecting an earnings beat The company&#39;s guidance was for revenue of approximately $469.00 million. Consensus estiamtes are for year-over-year revenue growth of 73.81%. The stock has drifted lower by 13.0% from its open following the earnings release to be 29.5% above its 200 day moving average of $57.90. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, April 15, 2021 there was some notable buying of 7,454 contracts of the $90.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 18.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=PINS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 206,
  "permalink": "/r/stocks/comments/mxmbli/wall_street_week_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "mxmbli",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214692
}