{
  "author": "happy-tripping",
  "the_new_excerpt": "Any thoughts on KOPN? I don't have time to do a full DD but here are some\nthoughts:\n\nKOPN (Kopin Corporation) is best known for its display devices for mobile\nelectronics. The company was founded by engineers from MIT and currently holds\nhundreds of patents that are applicable to Augmented Reality.…",
  "original_created_utc": 1612904985,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对KOPN有什么看法？我没有时间做一个完整的DD，但这里有一些。\n思想。\n\nKOPN(科平公司)最著名的是它的移动显示设备。\n电子产品。公司由麻省理工学院的工程师创立，目前拥有\n数百项适用于增强现实的专利....。",
      "title": "KOPN以及为什么我相信它有100%以上的上涨潜力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對KOPN有什麼看法？我沒有時間做一個完整的DD，但這裏有一些。\n思想。\n\nKOPN(科平公司)最著名的是它的移動顯示設備。\n電子產品。公司由麻省理工學院的工程師創立，目前擁有\n數百項適用於增強現實的專利....。",
      "title": "KOPN以及爲什麼我相信它有100%以上的上漲潛力？"
    }
  ],
  "title": "KOPN and why I believe it has 100%+ upside potential",
  "created_utc": 1612965906,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Any thoughts on KOPN? I don&#39;t have time to do a full DD but here are some thoughts:</p>\n\n<p><strong>KOPN (Kopin Corporation)</strong> is best known for its display devices for mobile electronics. The company was founded by engineers from MIT and currently holds hundreds of patents that are applicable to <strong>Augmented Reality</strong>. Some of the most promising patents involve wearable technology and voice recognition-based headsets. </p>\n\n<p>In the past several years, Kopin has contracted with the U.S. Department of Defense to research wearable head-mounted computers for soldiers. They have supplied defense technology for several defense companies including Rockwell Collins, Raytheon, and BAE. But defense is just a fractional part of Kopin&#39;s growth potential. </p>\n\n<p><strong>I believe that Kopin is set to be a breakout company in the Augmented Reality (AR) and Virtual Reality (VR) sectors.</strong> Kopin&#39;s VR technology is already a market leader. Their OLED microdisplays have the highest frame rates and resolution rates with the smallest sizes and lowest power consumption. They also have a voice-activated microchip technology called Whisper, which they claim is 200% better than other voice-recognition chips in the market. Cathie Woods recently talked about AR/VR in her 2021 Big Ideas presentation, which I think is another solid sign for KOPN.</p>\n\n<p><strong>I also believe that Kopin will partner with Apple.</strong> Kopin has worked with Google Glass and Microsoft. Based on Patent filings, Apple has been exploring AR/VR for at least ten years. In January 2021, Dan Riccio, the former Apple Hardware Engineering Chief, transitioned to a new role overseeing Apple&#39;s work on developing an AR/VR headset. Apple is said to be working on multiple prototypes for AR/VR headsets, and is expected to first launch an &quot;Apple glasses&quot; product by 2022. Bloomberg has also reported that Apple plans to launch an AR headset similar to FaceBook&#39;s Oculus Quest. Kopin has a long history of research, product success, and high-level partnerships that I think would make it a great candidate to partner with Apple (if they haven&#39;t already, which I think it&#39;s likely that they have and it&#39;s just not public information). </p>\n\n<p>As <a href=\"/u/madmattmen\">u/madmattmen</a> mentioned, KOPN has been a sleeping giant this past year. Their stock is up almost 2000% this past year, with huge accumulation occurring over the past few months alone. Their Earnings Report was set for 3/9, but they just moved it up a week to 3/2 which suggests good news (they are expected to report their strongest quarter yet). I am extremely bullish on KOPN, and I&#39;m setting my price target at $20 by end-of-year. </p>\n\n<p>Some info I took from <a href=\"/u/Puzzled-Gear-4333\">u/Puzzled-Gear-4333</a>:</p>\n\n<ul>\n<li>34 million in revenue and Debt Free</li>\n<li>Small cap (under 300 million)</li>\n<li>Over 200 patents mostly related to wearables</li>\n<li>Over 20 patents related to OLED backplane technology</li>\n<li>Great customer base which includes Vuzix, Google (Google Glass), Lenovo, Garmin, Flir, Lockhead Martin, &amp; Collins Aerospace among many others.</li>\n<li>Sole Provider for military and defense programs including LCD pilot helmet visors for F-35 Strike Fighter &amp; LCD eyepiece for next gen thermal imaging rifle sights for U.S. Army</li>\n<li>The anticipate a 4 year 77% Growth in AR/VR spending between 2019-2023</li>\n<li>Cody Willard of <a href=\"https://marketwatch.com/\">MarketWatch.com</a> estimates V/R will be a trillion dollar marketplace within five years <a href=\"https://www.marketwatch.com/story/virtual-reality-will-be-a-trillion-dollar-marketplace-within-five-years-heres-a-good-example-why-11611320863\">https://www.marketwatch.com/story/virtual-reality-will-be-a-trillion-dollar-marketplace-within-five-years-heres-a-good-example-why-11611320863</a></li>\n</ul>\n\n<p>Caveat: I am not a professional, do your own DD, this is not advice, and I bought 50 shares today + plan to buy more with my next paycheck.</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/lgdk0p/kopn_and_why_i_believe_it_has_100_upside_potential/",
  "subreddit": "stocks",
  "id": "lgdk0p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204952
}