{
  "author": "Beginning_County_869",
  "the_new_excerpt": "If anyone out there is panicking, a stranger on reddit isn’t going to make them\nfeel better. For those who have seen the dips and bear markets before, please\nstop humble bragging saying “I’ve been in this for years you idiots don’t know\nwhat hodling is” and for those who just got into bitcoin within…",
  "original_created_utc": 1619238919,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パニックに陥っている人がいたら、redditの見知らぬ人が気分を良くしてくれるわけではありません。\n感じさせないでしょう。これまでにディップやベアマーケットを見てきた人たちは、どうか\n謙虚に自慢するのはやめてください。\nまた、ビットコインを始めたばかりの人には、「俺は何年もやっている。",
      "title": "正直なところ、「Don't Panic」の投稿は本当に苛立たしいものになっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果有人在那里感到恐慌，在Reddit上的一个陌生人不会使他们\n感觉更好。对于那些曾经见过下跌和熊市的人，请\n请不要再谦虚地吹嘘说 \"我已经在这里面呆了很多年了，你们这些白痴根本不知道什么是霍德林\"。\n而对于那些刚刚进入比特币的人来说...",
      "title": "不瞒你说，那些 \"不要惊慌 \"的帖子真的让人恼火。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果有人在那裏感到恐慌，在Reddit上的一個陌生人不會使他們\n感覺更好。對於那些曾經見過下跌和熊市的人，請\n請不要再謙虛地吹噓說 \"我已經在這裏面呆了很多年了，你們這些白癡根本不知道什麼是霍德林\"。\n而對於那些剛剛進入比特幣的人來說...",
      "title": "不瞞你說，那些 \"不要驚慌 \"的帖子真的讓人惱火。"
    }
  ],
  "title": "Not gonna lie, the “Don’t Panic” posts are getting really irritating",
  "created_utc": 1619268674,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If anyone out there is panicking, a stranger on reddit isn’t going to make them feel better. For those who have seen the dips and bear markets before, please stop humble bragging saying “I’ve been in this for years you idiots don’t know what hodling is” and for those who just got into bitcoin within the last few months, please stop posting like you have any idea what you’re talking about.</p>\n</div><!-- SC_ON -->",
  "score": 453,
  "permalink": "/r/Bitcoin/comments/mxcpbk/not_gonna_lie_the_dont_panic_posts_are_getting/",
  "subreddit": "Bitcoin",
  "id": "mxcpbk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776204239
}