{
  "author": "Many_Scratch2269",
  "original_created_utc": 1641832904,
  "title": "Forget Crypto, the entire stock market could crash in the upcoming months and you should prepare.",
  "created_utc": 1641847257,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As much as I&amp;#39;d love all these signals to be FUD, the truth is, it&amp;#39;s not. Even the Crypto market dipping for the two months is largely due to the stock market trending down along with energy prices all over the world. People can say what they want, but the FED has printed way too much money over the past 18 months. You cannot raise the supply of the USD by 50% and expect no consequences.&lt;/p&gt;\n\n&lt;h1&gt;Buffet&amp;#39;s Indicator&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/07bsaiv2sva81.png?width=960&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=584a05154be7cee599786270d69ea42e813bdc25\"&gt;Buffet Indicator: Anything Above 140&amp;#37; is \\&amp;quot;Extreme Danger\\&amp;quot;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The way the stock market is booming right now is nothing more than abnormal. The S&amp;amp;P500 alone is &lt;strong&gt;100%&lt;/strong&gt; higher than what it was in March 2020 while actual productivity has shrunk with people leaving jobs faster than ever. Moreover, the housing market booming makes zero sense. Houses continue to skyrocket in value faster than the already high inflation rate can keep up.&lt;/p&gt;\n\n&lt;p&gt;Companies are also being overvalued by hundreds of times if you compare their profits to the stock market. If you look at Tesla, it is often the most used example of an overvalued company, and even then it pales to some of the most overvalued companies in the market right now.&lt;/p&gt;\n\n&lt;h1&gt;Prof. Dr. Robert Shiller&amp;#39;s Bubble Checklist Made in 2010.&lt;/h1&gt;\n\n&lt;p&gt;&lt;em&gt;1. Sharp increases in the price of an asset like real estate or shares&lt;/em&gt;  &lt;strong&gt;☑&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;2. Great public excitement about said increases&lt;/em&gt;   &lt;strong&gt;☑&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;3. An accompanying media frenzy&lt;/em&gt;  &lt;strong&gt;☑&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;4. Stories of people earning much money, causing envy among people who are not&lt;/em&gt;   &lt;strong&gt;☑&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;5. Growing interest in asset class among the general public&lt;/em&gt;  &lt;strong&gt;☑&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;6. ”New era” theories to justify unprecedented price increases&lt;/em&gt;   &lt;strong&gt;☑&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;7. A decline in lending standards&lt;/em&gt;   &lt;strong&gt;☑&lt;/strong&gt;&lt;/p&gt;\n\n&lt;h1&gt;The Illusion of Prosperity&lt;/h1&gt;\n\n&lt;p&gt;Every hyperinflationary event is always followed by a fake illusion of prosperity. We&amp;#39;ve seen this happen with the Weimar Republic, Venezuela, Zimbabwe and Lebanon. For example, in the months following hyperinflation in the Weimar Republic, people were becoming wealthier in the millions despite coming out of a war just months earlier. The market was doing so good that it was called the &amp;quot;Golden Twenties&amp;quot; in Germany.&lt;/p&gt;\n\n&lt;p&gt;However, as the hyperinflation got closer, &amp;quot;The citizenry saw prices going up due to shortages — and as more currency was produced to pay ever-rising union wages — buying activity became a frenzy.&amp;quot; This is very similar to the worker, logistics and countless other shortages we are facing today, this is not normal.&lt;/p&gt;\n\n&lt;p&gt;The interest rates of 0.25% by the Fed are also another indication of money supply being overstretched. The interest rates have been kept artificially low for way too long. Any country that has kept interest rates this low has always faced some kind of crash or economic crisis. The US can only do so for so long.&lt;/p&gt;\n\n&lt;h1&gt;Be Prepared&lt;/h1&gt;\n\n&lt;p&gt;Recessions &lt;strong&gt;are the inevitable result of the business cycle in a capitalist economy,&lt;/strong&gt; never believe people that say &amp;quot;this time is different,&amp;quot; and be prepared if things go south. Moreover, something even worse than all these indications is the debt level growing right before our eyes which is nearly $30 Trillion and growing exponentially. Moreover, the Nasdaq is already 8% down from it&amp;#39;s ATH, while the S&amp;amp;P500 is 4% down. Maybe the crash comes in a few months or even years.&lt;/p&gt;\n\n&lt;p&gt;The best thing you can do right now to protect yourself is to keep an emergency fund that can act as a hedge in the case of hyperinflation or a sudden crash such as Gold or staked Crypto. Always be prepared for the worst because the current state of the economy is eerily similar to what has happened in the past right before a major economic crash.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 493,
  "permalink": "/r/CryptoCurrency/comments/s0oa0j/forget_crypto_the_entire_stock_market_could_crash/",
  "subreddit": "CryptoCurrency",
  "id": "s0oa0j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As much as I'd love all these signals to be FUD, the truth is, it's not. Even\nthe Crypto market dipping for the two months is largely due to the stock market\ntrending down along with energy prices all over the world. People can say what\nthey want, but the FED has printed way too much money over the…"
}