{
  "author": "IAbstainFromSociety",
  "original_created_utc": 1654123043,
  "title": "In the US, the emergency number, 911, was created in 1968. How were emergencies handled before 1968, or even before the existence of telephones?",
  "created_utc": 1654148825,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This has interested me for a while. In most 911 emergency situations, the people involved are unable to go to the hospital or police station. If someone is having a heart attack, they often won&amp;#39;t be able to make it to the hospital. And if someone is the victim of a crime, they likely won&amp;#39;t be able to make it to the police station either. How were these emergency situations handled before 911?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/v2tl2x/in_the_us_the_emergency_number_911_was_created_in/",
  "subreddit": "AskHistorians",
  "id": "v2tl2x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This has interested me for a while. In most 911 emergency situations, the people\ninvolved are unable to go to the hospital or police station. If someone is\nhaving a heart attack, they often won't be able to make it to the hospital. And\nif someone is the victim of a crime, they likely won't be able…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは以前から興味がありました。911の緊急事態では、ほとんどの場合、人々は病院や警察署に行くことができません。\n病院や警察署に行くことができません。もし、誰かが\n心臓発作を起こしたとしても、病院までたどり着けないことが多いのです。また\n誰かが犯罪の被害者である場合、彼らはおそらくできないでしょう...",
      "title": "アメリカでは、1968年に緊急電話番号「911」が誕生した。1968年以前、いや、電話が存在する以前は、緊急事態にどのように対処していたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对这个问题感兴趣已经有一段时间了。在大多数911紧急情况下，有关人员\n所涉及的人都无法去医院或警察局。如果有人\n心脏病发作，他们往往无法赶到医院。而且\n如果有人是犯罪的受害者，他们很可能无法...",
      "title": "在美国，紧急号码911是在1968年创建的。在1968年之前，甚至在电话存在之前，是如何处理紧急情况的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對這個問題感興趣已經有一段時間了。在大多數911緊急情況下，有關人員\n所涉及的人都無法去醫院或警察局。如果有人\n心臟病發作，他們往往無法趕到醫院。而且\n如果有人是犯罪的受害者，他們很可能無法...",
      "title": "在美國，緊急號碼911是在1968年創建的。在1968年之前，甚至在電話存在之前，是如何處理緊急情況的？"
    }
  ]
}