{
  "author": "GelDel12",
  "original_created_utc": 1634757080,
  "title": "Reddit servers might shut down if we hit $69,420",
  "created_utc": 1634769222,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I say &quot;if&quot; because I have no idea, and avoiding &quot;when&quot; because that indicates certainty.</p>\n\n<p>For the first time in crypto history, we might see this number, and it will be the most glorious thing ever.</p>\n\n<p>And as a reminder, as we reach price discovery, to stay calm, DCA up and DCA down. Corrections happen, but that doesn&#39;t mean the market is over. Try not to FOMO, or buy huge lump sums at one time. The way the universe works, it might crash. Ask me how I know (May 2021 survivor here)</p>\n\n<p>Stock up on diapers at your local warehouse store.</p>\n\n<p>Hope you all get something good for yourself and your families during these crazy months!</p>\n</div><!-- SC_ON -->",
  "score": 341,
  "permalink": "/r/CryptoCurrency/comments/qc8gbj/reddit_servers_might_shut_down_if_we_hit_69420/",
  "subreddit": "CryptoCurrency",
  "id": "qc8gbj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I say \"if\" because I have no idea, and avoiding \"when\" because that indicates\ncertainty.\n\nFor the first time in crypto history, we might see this number, and it will be\nthe most glorious thing ever.\n\nAnd as a reminder, as we reach price discovery, to stay calm, DCA up and DCA\ndown. Corrections…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が「もし」と言うのは、私には分からないからで、「いつ」と言うのは確実性を示すので避けています。\n確信があるからです。\n\n暗号の歴史の中で初めてこの数字を目にすることになるかもしれません。\n史上最も輝かしいものになるでしょう。\n\nそして、価格発見に到達したとき、落ち着いて、DCAを上げ、DCAを下げてください。\nを下げてください。訂正します...",
      "title": "69,420ドルに達した場合、Redditのサーバーが停止する可能性があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说 \"如果 \"是因为我不知道，而避免说 \"何时 \"是因为那表示\n确定性。\n\n在加密货币历史上，我们可能第一次看到这个数字，这将是\n最光荣的事情。\n\n作为提醒，当我们达到价格发现时，要保持冷静，DCA向上和DCA\n跌。纠正...",
      "title": "如果我们达到69,420美元，Reddit服务器可能会关闭"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說 \"如果 \"是因爲我不知道，而避免說 \"何時 \"是因爲那表示\n確定性。\n\n在加密貨幣歷史上，我們可能第一次看到這個數字，這將是\n最光榮的事情。\n\n作爲提醒，當我們達到價格發現時，要保持冷靜，DCA向上和DCA\n跌。糾正...",
      "title": "如果我們達到69,420美元，Reddit服務器可能會關閉"
    }
  ]
}