{
  "author": "grommash_sunscreen",
  "original_created_utc": 1641901130,
  "title": "Alright, I admit it, I work in tech, I have been in crypto for 4 years or so, and I genuinely have no idea what crypto is used for other than an investment or money transfer product. You can make apps on it?",
  "created_utc": 1641907921,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit to clarify: I like crypto myself, got a punk rock vibe to it. I just don&amp;#39;t know what all it gets used for. Also the job in tech is internal tools dev at a medium sized game publisher. &lt;/p&gt;\n\n&lt;p&gt;Yep. I think about this constantly, I understand the use case for something like Bitcoin. Transfer money with no middle men. I get that. &lt;/p&gt;\n\n&lt;p&gt;What the hell are these other chains supposed to be doing? Half my damn portfolio is Ethereum and I genuinely can&amp;#39;t tell you what your supposed to do with it. Why would you develop an app on a Blockchain? Let alone how. Is there some inherent benefit here? God I have no clue. &lt;/p&gt;\n\n&lt;p&gt;For the longest time I just thought it was like providing a decentralized version of something like AWS or Azure, like a grass roots server host. Holy shit I was wrong. There&amp;#39;s all sorts of shit you can make apparently. &lt;/p&gt;\n\n&lt;p&gt;But yeah idk. Feels good to come clean. I got into it cause it seemed like a smart investment and so far so good. But I&amp;#39;m amazed I&amp;#39;ve not come across any real application of it in my day to day life so far that I&amp;#39;m aware of at least. &lt;/p&gt;\n\n&lt;p&gt;I cannot be alone here right? Please. It&amp;#39;s wild to me that I understand more about the idea behind what an NFT is (supposed to be) used for than any application of any other blockchains. &lt;/p&gt;\n\n&lt;p&gt;Idk if anyone else is in this camp and feels dumb you&amp;#39;re not alone. I feel ya.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 414,
  "permalink": "/r/CryptoCurrency/comments/s1azjd/alright_i_admit_it_i_work_in_tech_i_have_been_in/",
  "subreddit": "CryptoCurrency",
  "id": "s1azjd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Edit to clarify: I like crypto myself, got a punk rock vibe to it. I just don't\nknow what all it gets used for. Also the job in tech is internal tools dev at a\nmedium sized game publisher.\n\nYep. I think about this constantly, I understand the use case for something like\nBitcoin. Transfer money with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集後記：私自身は暗号が好きで、パンクロックのような雰囲気があります。ただ\n何に使われるのかわからない。また、技術系の仕事は、ある会社の社内ツール開発です。\n中堅のゲームパブリッシャー。\n\nうん。常に考えていることですが、次のようなものの使用例を理解しています。\nビットコインです。で送金する...",
      "title": "私は技術職で、4年ほど暗号を扱っていますが、暗号が投資や送金の商品以外に何に使われるのか、純粋に全く分かりません。アプリが作れるの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑澄清：我自己喜欢加密货币，有一种朋克摇滚的感觉。我只是不知道\n我只是不知道它都有什么用途。另外，技术方面的工作是在一家中型游戏发行商的内部工具开发。\n中等规模的游戏出版商的内部工具开发。\n\n是的。我一直在思考这个问题，我知道像比特币这样的东西的使用情况。\n比特币。用比特币转移资金...",
      "title": "好吧，我承认，我在技术领域工作，我已经在加密货币领域工作了4年左右，除了投资或资金转移产品，我真的不知道加密货币有什么用途。你可以用它来制作应用程序？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯澄清：我自己喜歡加密貨幣，有一種朋克搖滾的感覺。我只是不知道\n我只是不知道它都有什麼用途。另外，技術方面的工作是在一家中型遊戲發行商的內部工具開發。\n中等規模的遊戲出版商的內部工具開發。\n\n是的。我一直在思考這個問題，我知道像比特幣這樣的東西的使用情況。\n比特幣。用比特幣轉移資金...",
      "title": "好吧，我承認，我在技術領域工作，我已經在加密貨幣領域工作了4年左右，除了投資或資金轉移產品，我真的不知道加密貨幣有什麼用途。你可以用它來製作應用程序？"
    }
  ]
}