{
  "author": "grommash_sunscreen",
  "original_created_utc": 1641901130,
  "title": "Alright, I admit it, I work in tech, I have been in crypto for 4 years or so, and I genuinely have no idea what crypto is used for other than an investment or money transfer product. You can make apps on it?",
  "created_utc": 1641907921,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit to clarify: I like crypto myself, got a punk rock vibe to it. I just don&amp;#39;t know what all it gets used for. Also the job in tech is internal tools dev at a medium sized game publisher. &lt;/p&gt;\n\n&lt;p&gt;Yep. I think about this constantly, I understand the use case for something like Bitcoin. Transfer money with no middle men. I get that. &lt;/p&gt;\n\n&lt;p&gt;What the hell are these other chains supposed to be doing? Half my damn portfolio is Ethereum and I genuinely can&amp;#39;t tell you what your supposed to do with it. Why would you develop an app on a Blockchain? Let alone how. Is there some inherent benefit here? God I have no clue. &lt;/p&gt;\n\n&lt;p&gt;For the longest time I just thought it was like providing a decentralized version of something like AWS or Azure, like a grass roots server host. Holy shit I was wrong. There&amp;#39;s all sorts of shit you can make apparently. &lt;/p&gt;\n\n&lt;p&gt;But yeah idk. Feels good to come clean. I got into it cause it seemed like a smart investment and so far so good. But I&amp;#39;m amazed I&amp;#39;ve not come across any real application of it in my day to day life so far that I&amp;#39;m aware of at least. &lt;/p&gt;\n\n&lt;p&gt;I cannot be alone here right? Please. It&amp;#39;s wild to me that I understand more about the idea behind what an NFT is (supposed to be) used for than any application of any other blockchains. &lt;/p&gt;\n\n&lt;p&gt;Idk if anyone else is in this camp and feels dumb you&amp;#39;re not alone. I feel ya.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 414,
  "permalink": "/r/CryptoCurrency/comments/s1azjd/alright_i_admit_it_i_work_in_tech_i_have_been_in/",
  "subreddit": "CryptoCurrency",
  "id": "s1azjd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Edit to clarify: I like crypto myself, got a punk rock vibe to it. I just don't\nknow what all it gets used for. Also the job in tech is internal tools dev at a\nmedium sized game publisher.\n\nYep. I think about this constantly, I understand the use case for something like\nBitcoin. Transfer money with…"
}