{
  "author": "JuicySpark",
  "original_created_utc": 1627671530,
  "title": "Regardless if you view moons as a shitcoin or not, we have to give it up to reddit for making it easier for the average person to aquire some crypto.",
  "created_utc": 1627684702,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They help with adoption. They help people who aren&#39;t quite computer literate having an easier time getting into crypto.   It&#39;s as simple as DL Reddit app, join the sub activate the vault and all the work is done for you after that.</p>\n\n<p>I myself am very knowledgeable, I started programming 28 years ago. Even so it was tedious the first time trying to buy with all the verifications, long Pws, PKs etc.  I can easily see how this would make the average Joe a bit ... apathetic?  </p>\n\n<p>So I have to give it up to reddit on this one centralized or not.  </p>\n\n<p>Regardless of where this goes as far as price, it&#39;s helping people adopt crypto, and that helps the price on whatever other crypto you&#39;re holding. It boosts the entire market.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/our7lk/regardless_if_you_view_moons_as_a_shitcoin_or_not/",
  "subreddit": "CryptoCurrency",
  "id": "our7lk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "They help with adoption. They help people who aren't quite computer literate\nhaving an easier time getting into crypto. It's as simple as DL Reddit app, join\nthe sub activate the vault and all the work is done for you after that.\n\nI myself am very knowledgeable, I started programming 28 years ago.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "養子縁組にも協力しています。コンピューターが苦手な人のためにも\n暗号の世界に入りやすくなります。RedditのアプリをDLして参加するだけの簡単なものです。\n金庫を起動するだけで、その後の作業はすべて完了します。\n\n私自身はとても知識が豊富で、28年前にプログラミングを始めました....",
      "title": "moonsをクソコインと見なすかどうかに関わらず、一般人が簡単に暗号を入手できるようにしたredditには敬意を表さなければなりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们帮助收养。他们帮助那些不太懂电脑的人\n更容易进入加密货币领域。这就像DL Reddit应用程序一样简单，加入\n激活金库，之后所有的工作都为你完成。\n\n我自己很有知识，我在28年前就开始编程了....",
      "title": "不管你是否认为月亮是一个狗屎币，我们必须把它交给reddit，让普通人更容易获得一些加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們幫助收養。他們幫助那些不太懂電腦的人\n更容易進入加密貨幣領域。這就像DL Reddit應用程序一樣簡單，加入\n激活金庫，之後所有的工作都爲你完成。\n\n我自己很有知識，我在28年前就開始編程了....",
      "title": "不管你是否認爲月亮是一個狗屎幣，我們必須把它交給reddit，讓普通人更容易獲得一些加密貨幣。"
    }
  ]
}