{
  "author": "Edwardo-18",
  "original_created_utc": 1649189650,
  "title": "My family wants to get another pet but I’m scared of going through the “end of life stage” again",
  "created_utc": 1649211552,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My last pet of 18 years (my whole life) we had to put down due to renal/liver failure and the trauma of that was horrifying. To watch my best friend disintegrate and suffer and after 2 weeks of misery for the poor guy he had to be put down, I’ll never get past it. How can people do this over and over? &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;the cat they wanna adopt is around 5 years old I think idk&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Thanks everyone for the kind words I appreciate it alot. We’re thinking about what to name the little guy :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/NoStupidQuestions/comments/tx3ycx/my_family_wants_to_get_another_pet_but_im_scared/",
  "subreddit": "NoStupidQuestions",
  "id": "tx3ycx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My last pet of 18 years (my whole life) we had to put down due to renal/liver\nfailure and the trauma of that was horrifying. To watch my best friend\ndisintegrate and suffer and after 2 weeks of misery for the poor guy he had to\nbe put down, I’ll never get past it. How can people do this over and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "18年間（生涯）飼った最後のペットは、腎臓／肝臓のため処分せざるを得ませんでした。\nそのトラウマは恐ろしいほどでした。私の親友を見るのは\n2週間も苦しんだ挙句に、彼は瀕死の状態になってしまいました。\n私はそれを克服することはできません。人はどうしてこんなことを繰り返してしまうのか...。",
      "title": "家族がもう1匹ペットを飼いたいと言っているが、また「終活」をするのが怖い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最后一只养了18年的宠物（我的一生），由于肾脏/肝脏衰竭，我们不得不把它放下。\n我们不得不因肾脏/肝脏衰竭而将其处死，这种创伤是非常可怕的。看着我最好的朋友\n崩溃和痛苦，在这个可怜的家伙痛苦了两个星期之后，他不得不被处死。\n我永远不会忘记它。人们怎么能一次又一次地这样做呢？",
      "title": "我的家人想再养一只宠物，但我害怕再次经历 \"生命终结阶段\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最後一隻養了18年的寵物（我的一生），由於腎臟/肝臟衰竭，我們不得不把它放下。\n我們不得不因腎臟/肝臟衰竭而將其處死，這種創傷是非常可怕的。看着我最好的朋友\n崩潰和痛苦，在這個可憐的傢伙痛苦了兩個星期之後，他不得不被處死。\n我永遠不會忘記它。人們怎麼能一次又一次地這樣做呢？",
      "title": "我的家人想再養一隻寵物，但我害怕再次經歷 \"生命終結階段\"。"
    }
  ]
}