{
  "author": "Mitotic_Figure",
  "the_new_excerpt": "When retirement planning or just choosing between different investment\nopportunities we all have to make some assumptions about what the long-term\nbroad market outlook is. With a difference of 2% growth rates over the next 20\nyears there can be massive differences in the end value of your…",
  "original_created_utc": 1619526251,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "リタイアメントプランを立てるとき、あるいは投資先を選ぶとき\n私たちは皆、長期的な市場の見通しについてある程度の仮定をしなければなりません。\n市場の長期的な見通しを想定しなければなりません。今後20年間の成長率が2％違うだけで、最終的な価値は大きく変わります。\n今後20年間の成長率が2％違うだけで、最終的な資産価値に大きな差が生じる可能性があります。",
      "title": "今後20年間のブロードマーケットのリターンの平均値はどのくらいだと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当退休计划或只是在不同的投资机会中选择\n机会时，我们都必须对长期的市场前景做出一些假设。\n广泛的市场前景是什么。在未来的20年里，2%的增长率差异\n在未来20年里，如果增长率相差2%，那么你的最终价值就会有巨大的差异...",
      "title": "你认为未来20年大盘的平均回报率会是多少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當退休計劃或只是在不同的投資機會中選擇\n機會時，我們都必須對長期的市場前景做出一些假設。\n廣泛的市場前景是什麼。在未來的20年裏，2%的增長率差異\n在未來20年裏，如果增長率相差2%，那麼你的最終價值就會有巨大的差異...",
      "title": "你認爲未來20年大盤的平均回報率會是多少？"
    }
  ],
  "title": "What do you think broad market returns will average over the next 20 years?",
  "created_utc": 1619560061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When retirement planning or just choosing between different investment opportunities we all have to make some assumptions about what the long-term broad market outlook is. With a difference of 2% growth rates over the next 20 years there can be massive differences in the end value of your investment.</p>\n\n<p>The historical CAGR (with dividends) of the S&amp;P500 over the last X years (ending Dec 31 2020) is as follows:</p>\n\n<p>100 Years: 10.46%</p>\n\n<p>90: 9.92%</p>\n\n<p>80: 11.23%</p>\n\n<p>70: 11.54%</p>\n\n<p>60: 10.27%</p>\n\n<p>50: 10.76%</p>\n\n<p>40: 12.01%</p>\n\n<p>30: 10.24%</p>\n\n<p>20: 6.59%</p>\n\n<p>10: 13.99%</p>\n\n<p>Source: <a href=\"http://www.moneychimp.com/features/market_cagr.htm\">http://www.moneychimp.com/features/market_cagr.htm</a></p>\n\n<p>Knowing this, what do you assume the broad market will have for an annualized growth rate over the next 20 years or so? I&#39;m thinking along the lines of the total S&amp;P500 return, VTSAX, or similar. Why?</p>\n\n<p>I realize nobody can truly know what to expect, but I&#39;m asking what assumption you would make based on historical norms, future outlook, macroeconomic factors, etc.</p>\n\n<p>Personally, I assume a conservative rate of return of 7%. I do this for several reasons. First, I would rather underestimate how much I will have in 20 years and be pleasantly surprised when the return is more. Second, I think macroeconomic headwinds are coming compared to the previous decades that will result in slower overall growth.</p>\n</div><!-- SC_ON -->",
  "score": 81,
  "permalink": "/r/investing/comments/mzn9py/what_do_you_think_broad_market_returns_will/",
  "subreddit": "investing",
  "id": "mzn9py",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214682
}