{
  "author": "just-a-simple-song",
  "original_created_utc": 1635537468,
  "title": "$30k. Want to invest it all. What would you do?",
  "created_utc": 1635600690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So in short, after a four year bout with cancer my Dad passed. I’ve spent the last years flying all over and taking care of him, taking him to different hospitals, working with him through radiation and chemo and clinical trials, and then finally hospice. We were lucky with insurance and somehow we weren’t bankrupted by his treatment. </p>\n\n<p>Anyway, he finally mercifully passed, peacefully and surrounded by all of his family, and he left me $50k. I have a lot of debt to pay off from the last few years. </p>\n\n<p>I’m thinking I want to invest the remainder. What would you do? Buy a fragment of a Bitcoin? Sprinkle it around? Just trying to think if the best thing that might help take these couple of years worth of trauma and use dad’s legacy to help set me up a little.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qil194/30k_want_to_invest_it_all_what_would_you_do/",
  "subreddit": "CryptoCurrency",
  "id": "qil194",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So in short, after a four year bout with cancer my Dad passed. I’ve spent the\nlast years flying all over and taking care of him, taking him to different\nhospitals, working with him through radiation and chemo and clinical trials, and\nthen finally hospice. We were lucky with insurance and somehow we…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "要するに、4年間の癌との闘いの後、父は亡くなったのです。この数年間、私は\n私はこの数年間、あちこちに飛んでは父の世話をし、いろいろな病院に連れて行ったり\nまた、放射線や化学療法、臨床試験、そして最後にはホスピスへと、父の世話をしてきました。\nそしてついにホスピスへ。私たちは幸運にも保険に加入していたので、なんとか...",
      "title": "$30k. すべてを投資したい。あなたならどうしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，简而言之，在与癌症斗争了四年之后，我父亲去世了。我花了\n照顾他，带他去不同的医院，与他一起接受放疗、化疗和临床试验。\n医院，与他一起经历了放疗、化疗和临床试验，以及最后的临终关怀。\n最后是安宁疗护。我们在保险方面很幸运，不知为何我们...",
      "title": "$30k. 想把它全部投资。你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，簡而言之，在與癌症鬥爭了四年之後，我父親去世了。我花了\n照顧他，帶他去不同的醫院，與他一起接受放療、化療和臨牀試驗。\n醫院，與他一起經歷了放療、化療和臨牀試驗，以及最後的臨終關懷。\n最後是安寧療護。我們在保險方面很幸運，不知爲何我們...",
      "title": "$30k. 想把它全部投資。你會怎麼做？"
    }
  ]
}