{
  "author": "onetypicalhuman",
  "original_created_utc": 1634277386,
  "title": "Anyone sleep just so they don't have to deal with being awake?",
  "created_utc": 1634285645,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in quite a strange household. (16M) I don&#39;t want to call it loveless but its quite &quot;cold&quot; if that makes sense. It&#39;s quite strict, so I&#39;m not allowed phones in my room, not allowed to talk to people on the Internet, (in games and stuff) I have a LOT of chores. I have to clean the entire house every day before I get to do anything I want to, so I have to tidy up, do dishes, vacuum,  clean the bathrooms, make everyone&#39;s bed, walk the dog and sometimes make my dad and brothers lunch when they come in from work. This takes up a lot of my energy so by the time it&#39;s about 1:00 I just sit and play video games until dinner. Then I have to do those dishes and tidy up again. I&#39;m also part of a strict religion which doesn&#39;t let me do normal things that other kids my age can do. The worst part is, my parents don&#39;t give a damn. All they want is their clean house and their dog to be tired out but they don&#39;t realise the effect of me doing the same thing over and over and over for a year and a half.</p>\n\n<p>To be honest, I&#39;m sick to death with my life. I&#39;m sick of my parents expectations, I&#39;m sick with being bored all damn time because I&#39;m not allowed to do &quot;normal&quot; things other people my age can do. And I live so far away from the people I used to consider friends that I can&#39;t go and meet up with them for anything. My friends have slowly just abandoned me since I left school and in the past 3 months I haven&#39;t been contacted at all by any of them. I don&#39;t have anyone to talk to. (Please don&#39;t send me a bunch of DMS about how I can talk to you. I appreciate the well intentions but it&#39;s not the same talking to a stranger on a screen than a real human person.) I had am amazing friend who listened to me and made me laugh and actually understood me but I was forced to cut him off because he stopped being part of my religion.</p>\n\n<p>So, I sleep. I go to sleep at 8pm and don&#39;t wake up until my parents have left for work which is about 9. I&#39;m sick of being alive so not being alive for the 8-11 hours is the best thing. Then the whole day is just a countdown until I can go back to sleep. My life is so boring and bland that there is no point in being alive. I don&#39;t know if I&#39;m depressed or suicidal or just in a phase, I just want to feel something other than sadness and boredom.</p>\n\n<p>Just wanted to make a small note... please stop and think for a minute about what kind of friend you are. Is there anyone that you have kind of forgot about? Please for the love of God, contact them. Ask them to go for a coffee or a walk or a zoom call or just SOMETHING. This absolutely sucks and I wouldn&#39;t wish this on my worst enemy.</p>\n</div><!-- SC_ON -->",
  "score": 121,
  "permalink": "/r/TooAfraidToAsk/comments/q8hyoq/anyone_sleep_just_so_they_dont_have_to_deal_with/",
  "subreddit": "TooAfraidToAsk",
  "id": "q8hyoq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in quite a strange household. (16M) I don't want to call it loveless but\nits quite \"cold\" if that makes sense. It's quite strict, so I'm not allowed\nphones in my room, not allowed to talk to people on the Internet, (in games and\nstuff) I have a LOT of chores. I have to clean the entire house…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かなり変な家庭に住んでいます。(16M) 愛のない家庭とは言いたくありませんが\nかなり \"冷たい \"感じがします。かなり厳しいので、自分の部屋で電話をしてはいけないし\n自分の部屋で電話をしてはいけないし、インターネットで人と話してはいけないし、（ゲームとかで\n私にはたくさんの雑用があります。家中を掃除しなければならないし...。",
      "title": "起きていることを気にしないで済むように寝ている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我生活在一个相当奇怪的家庭。(16M)我不想说它是无爱的，但是\n它相当 \"冷\"，如果这有意义的话。它相当严格，所以我不允许\n在我的房间里打电话，不允许在互联网上与人交谈，（在游戏和其他方面）。\n我有很多家务事。我必须打扫整个房子...",
      "title": "有谁睡觉只是为了不必处理醒着的问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我生活在一個相當奇怪的家庭。(16M)我不想說它是無愛的，但是\n它相當 \"冷\"，如果這有意義的話。它相當嚴格，所以我不允許\n在我的房間裏打電話，不允許在互聯網上與人交談，（在遊戲和其他方面）。\n我有很多家務事。我必須打掃整個房子...",
      "title": "有誰睡覺只是爲了不必處理醒着的問題？"
    }
  ]
}