{
  "author": "Brinothedino",
  "original_created_utc": 1627003342,
  "title": "Take a shit on the floor, scoop it up, throw it at the wall, and analyze the pattern. You are now doing TA on par with the best of the Crypto analysts.",
  "created_utc": 1627011363,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s been a great couple days: moons are up, people are Bullish, but you may have noticed there are still a ton of articles saying Bitcoin will hit 15k and that Bitcoin will hit 100k.</p>\n\n<p>Maybe both will happen, maybe neither. Nobody knows! But they sure as hell will try to convince you that they do. At the end of the day, TA is bullshit but solid projects will rise over time, so the best you can hope for is to DCA into solid projects. </p>\n\n<p>It&#39;s been awhile since if seen someone say it, so I will reiterate that time in the market is better than timing the market. And anyone h\nWho says otherwise is trying to scam you. Stay safe out there friends!</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/oprqvz/take_a_shit_on_the_floor_scoop_it_up_throw_it_at/",
  "subreddit": "CryptoCurrency",
  "id": "oprqvz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's been a great couple days: moons are up, people are Bullish, but you may\nhave noticed there are still a ton of articles saying Bitcoin will hit 15k and\nthat Bitcoin will hit 100k.\n\nMaybe both will happen, maybe neither. Nobody knows! But they sure as hell will\ntry to convince you that they do.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日は、月が昇り、人々は強気になっています。\n気づいたかもしれませんが、ビットコインが15Kになるという記事がまだ大量にあります。\nビットコインは15kになる」「ビットコインは100kになる」という記事がまだ大量にあることにお気づきでしょうか。\n\n両方とも実現するかもしれませんし、どちらでもないかもしれません。誰にもわかりません。しかし、彼らは確実に\nそうだと信じ込ませようとします....",
      "title": "床に落ちている糞をすくい上げ、壁に投げつけて、そのパターンを分析する。あなたは今、最高のCryptoアナリストと同等のTAを行っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这几天很不错：月亮升起来了，人们都看涨，但你可能已经注意到仍有大量的文章说比特币将达到15000美元。\n但你可能已经注意到，仍然有大量的文章说比特币将达到15000点，以及\n比特币将达到10万。\n\n也许两者都会发生，也许都不会。没人知道! 但他们肯定会\n试图让你相信他们会这样做....",
      "title": "在地板上拉屎，把它舀起来，扔到墙上，并分析其模式。你现在做的TA与最好的Crypto分析师相提并论。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這幾天很不錯：月亮升起來了，人們都看漲，但你可能已經注意到仍有大量的文章說比特幣將達到15000美元。\n但你可能已經注意到，仍然有大量的文章說比特幣將達到15000點，以及\n比特幣將達到10萬。\n\n也許兩者都會發生，也許都不會。沒人知道! 但他們肯定會\n試圖讓你相信他們會這樣做....",
      "title": "在地板上拉屎，把它舀起來，扔到牆上，並分析其模式。你現在做的TA與最好的Crypto分析師相提並論。"
    }
  ]
}