{
  "author": "maximum_horkheimer",
  "original_created_utc": 1646158155,
  "title": "Montaigne off-handedly asserts that Julius Caesar's horse had human feet. I googled that, and found corroboration in Suetonius. Is Julius Caesar's weird horse documented in contemporaneous sources? If not, when/why did this idea originate?",
  "created_utc": 1646187970,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;from the Frame translation of Montaigne&amp;#39;s essay &amp;quot;Of War Horses&amp;quot;:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;As Nature willed to make of that man [Julius Caesar] and Alexander two miracles of military art, so you would say that she also made an effort to arm them extraordinarily: for everyone knows that Alexander&amp;#39;s horse Bucephalus had a head resembling that of a bull, that he would allow no one but his master to mount him, could be broken only by him, was honored after his death, and had a city built in his name. Caesar too had one whose forefeet were like a man&amp;#39;s, with the hoof divided in the shape of toes, a horse which could be mounted and broken only by Caesar, who after his death dedicated his statue to the goddess Venus.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Naturally I had to set the book down to google that right away. Mostly weird blogs came up, but also &lt;a href=\"http://www.perseus.tufts.edu/hopper/text?doc=Perseus:abo:phi,1348,011:61\"&gt;this passage&lt;/a&gt; from Suetonius:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He rode a very remarkable horse, with feet almost like those of a man, the hoofs being divided in such a manner as to have some resemblance to toes. This horse he had bred himself, and the soothsayers having interpreted these circumstances into an omen that its owner would be master of the world, he brought him up with particular care, and broke him in himself, as the horse would suffer no one else to mount him. A statue of this horse was afterwards erected by Caesar&amp;#39;s order before the temple of Venus Genitrix.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So my question is basically what I ask in the title: what in the hell was up with Julius Caesar&amp;#39;s fucked-up horse with human feet?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/t4e7p5/montaigne_offhandedly_asserts_that_julius_caesars/",
  "subreddit": "AskHistorians",
  "id": "t4e7p5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "from the Frame translation of Montaigne's essay \"Of War Horses\":\n\n\"As Nature willed to make of that man [Julius Caesar] and Alexander two miracles\nof military art, so you would say that she also made an effort to arm them\nextraordinarily: for everyone knows that Alexander's horse Bucephalus had a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "モンテーニュのエッセイ「軍馬について」のフレーム訳より。\n\n「自然があの男（ユリウス・カエサル）とアレキサンダーに二つの奇跡を起こそうとしたように\n軍事的な芸術の、だからあなたは、彼女はまた、彼らを武装させるために努力したと言うでしょう。\nアレキサンダーの馬ブケファルスは、その馬の蹄鉄の上に乗っていたことは誰もが知っている。",
      "title": "モンテーニュは、ジュリアス・シーザーの馬には人間の足があったと、あっけらかんと主張している。ググってみたら、スエトニウスにその裏付けがあった。ユリウス・カエサルの変な馬は同時代の資料に載っているのでしょうか？そうでないとしたら、この考えはいつ、なぜ生まれたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "摘自蒙田《战马》一文的框架译本。\n\n\"正如大自然所希望的那样，那个人[凯撒大帝]和亚历山大创造了两个军事艺术的奇迹\n的两个奇迹，所以你会说，她也努力把他们武装起来了\n因为大家都知道，亚历山大的马Bucephalus有一个......。",
      "title": "蒙田不经意地断言，凯撒大帝的马有人类的脚。我上网查了一下，在苏埃托尼乌斯找到了佐证。朱利叶斯-凯撒的怪马在同时代的资料中是否有记载？如果没有，这个想法是什么时候/为什么产生的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "摘自蒙田《戰馬》一文的框架譯本。\n\n\"正如大自然所希望的那樣，那個人[凱撒大帝]和亞歷山大創造了兩個軍事藝術的奇蹟\n的兩個奇蹟，所以你會說，她也努力把他們武裝起來了\n因爲大家都知道，亞歷山大的馬Bucephalus有一個......。",
      "title": "蒙田不經意地斷言，凱撒大帝的馬有人類的腳。我上網查了一下，在蘇埃託尼烏斯找到了佐證。朱利葉斯-凱撒的怪馬在同時代的資料中是否有記載？如果沒有，這個想法是什麼時候/爲什麼產生的？"
    }
  ]
}