{
  "author": "maximum_horkheimer",
  "original_created_utc": 1646158155,
  "title": "Montaigne off-handedly asserts that Julius Caesar's horse had human feet. I googled that, and found corroboration in Suetonius. Is Julius Caesar's weird horse documented in contemporaneous sources? If not, when/why did this idea originate?",
  "created_utc": 1646187970,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;from the Frame translation of Montaigne&amp;#39;s essay &amp;quot;Of War Horses&amp;quot;:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;As Nature willed to make of that man [Julius Caesar] and Alexander two miracles of military art, so you would say that she also made an effort to arm them extraordinarily: for everyone knows that Alexander&amp;#39;s horse Bucephalus had a head resembling that of a bull, that he would allow no one but his master to mount him, could be broken only by him, was honored after his death, and had a city built in his name. Caesar too had one whose forefeet were like a man&amp;#39;s, with the hoof divided in the shape of toes, a horse which could be mounted and broken only by Caesar, who after his death dedicated his statue to the goddess Venus.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Naturally I had to set the book down to google that right away. Mostly weird blogs came up, but also &lt;a href=\"http://www.perseus.tufts.edu/hopper/text?doc=Perseus:abo:phi,1348,011:61\"&gt;this passage&lt;/a&gt; from Suetonius:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He rode a very remarkable horse, with feet almost like those of a man, the hoofs being divided in such a manner as to have some resemblance to toes. This horse he had bred himself, and the soothsayers having interpreted these circumstances into an omen that its owner would be master of the world, he brought him up with particular care, and broke him in himself, as the horse would suffer no one else to mount him. A statue of this horse was afterwards erected by Caesar&amp;#39;s order before the temple of Venus Genitrix.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So my question is basically what I ask in the title: what in the hell was up with Julius Caesar&amp;#39;s fucked-up horse with human feet?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/t4e7p5/montaigne_offhandedly_asserts_that_julius_caesars/",
  "subreddit": "AskHistorians",
  "id": "t4e7p5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "from the Frame translation of Montaigne's essay \"Of War Horses\":\n\n\"As Nature willed to make of that man [Julius Caesar] and Alexander two miracles\nof military art, so you would say that she also made an effort to arm them\nextraordinarily: for everyone knows that Alexander's horse Bucephalus had a…"
}