{
  "author": "Joppe84",
  "the_new_excerpt": "Hi.\n\nI want some input here, cause I simply can't make my mind up.\n\nI'm currently holding my PF, while adding a small amount of money in 5 different\nindex funds monthly.\n\nIn terms of money I'm saving about $ 700 in an world index fund every month as\nlocked in pension savings, and another $ 700 in 5…",
  "original_created_utc": 1620639488,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n自分の考えがまとまらないので、意見を聞かせてください。\n\n現在、私はPFを保有していますが、毎月5つの異なるインデックスファンドに少額の資金を追加しています。\nインデックスファンドを毎月購入しています。\n\nお金の面では、毎月約700ドルを世界のインデックスファンドに貯蓄しています。\nそして、さらに700ドルを5つの...",
      "title": "市場の評価と投資のアロケーション - インデックス vs ストックピッキング"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n我想在这里得到一些意见，因为我根本无法做出决定。\n\n我目前持有我的公积金，同时每月在5个不同的指数基金中增加少量的资金\n指数基金。\n\n在资金方面，我每月在世界指数基金中储蓄约700美元作为\n锁定的养老金储蓄，另外700美元在5个指数基金中。",
      "title": "市场估值和投资分配--指数与选股的关系"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n我想在這裏得到一些意見，因爲我根本無法做出決定。\n\n我目前持有我的公積金，同時每月在5個不同的指數基金中增加少量的資金\n指數基金。\n\n在資金方面，我每月在世界指數基金中儲蓄約700美元作爲\n鎖定的養老金儲蓄，另外700美元在5個指數基金中。",
      "title": "市場估值和投資分配--指數與選股的關係"
    }
  ],
  "title": "Market valuations and investing allocations - indexes vs stock picking",
  "created_utc": 1620654821,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi.</p>\n\n<p>I want some input here, cause I simply can&#39;t make my mind up.</p>\n\n<p>I&#39;m currently holding my PF, while adding a small amount of money in 5 different index funds monthly.</p>\n\n<p>In terms of money I&#39;m saving about $ 700 in an world index fund every month as locked in pension savings, and another $ 700 in 5 different index funds for personal savings (E.M., Scandinavia, Europe, World and small cap - I&#39;m considering wiping the Europe fund here, but I digress). So that&#39;s $ 1400 montly in indexes.</p>\n\n<p>I&#39;m also stacking about $ 2000 in cash every month. This goes hopefully into the market in the future or as downpayment on my mortgage (depending on inflation and change in interest).</p>\n\n<p>Other than that I have a stock picking PF with a handful of companies. </p>\n\n<p>Now here&#39;s the kicker. I&#39;m aware I can&#39;t time the market. I don&#39;t believe I can, but the question is whether I see a big upside in indexes from here on. And I&#39;m not sure I do. The markets might keep growing a bit more, but I feel the risk reward is unfavourable atm, and I wonder if indexes isn&#39;t the right thing now. I honestly feel far more comfortable with doing value buys, and there&#39;s less risk of buying dividend blue chips who aren&#39;t in favour.</p>\n\n<p>A few months ago my last big buy happened and that was Bayer AG. After that I&#39;ve kind of been on the sidelines as I haven&#39;t seen anything interesting.</p>\n\n<p>What&#39;s your opinion on investing right now? Would you stick to investing heavily in indexes or rotate into stock picking?  If so, would you sell off index funds? Or ride it out?</p>\n</div><!-- SC_ON -->",
  "score": 71,
  "permalink": "/r/investing/comments/n90hkk/market_valuations_and_investing_allocations/",
  "subreddit": "investing",
  "id": "n90hkk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994598
}