{
  "author": "Accomplished-Design7",
  "original_created_utc": 1632567445,
  "title": "You need more than 1 cycle to get rich",
  "created_utc": 1632588929,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto is the most innovative space for investment and it is DeFinetly going to be part of the future. There are crazy gains potential here, but don’t expect to get a x10 - x100 within months or week.</p>\n\n<p>I am not saying that it is impossible, it is just less likely to happen. Those who have been in crypto for more than 1 cycle and HODLed onto solid projects did see a lot of gains. So if you don’t see crazy gains in weeks or months worry not. It’s completely normal. </p>\n\n<p>DYOR get into some nice projects and HODL.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/pv4kk9/you_need_more_than_1_cycle_to_get_rich/",
  "subreddit": "CryptoCurrency",
  "id": "pv4kk9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto is the most innovative space for investment and it is DeFinetly going to\nbe part of the future. There are crazy gains potential here, but don’t expect to\nget a x10 - x100 within months or week.\n\nI am not saying that it is impossible, it is just less likely to happen. Those\nwho have been in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は投資のための最も革新的な空間であり、それはデフィネトリーに将来の\nは未来の一部となるでしょう。莫大な利益が得られる可能性がありますが、数ヶ月、数週間で10倍、100倍になるとは思わないでください。\n数ヶ月から1週間で10倍から100倍の利益を得ることはできません。\n\n不可能だと言っているのではなく、可能性が低いというだけです。経験者\nを経験したことがある人は、そのようなことはないでしょう。",
      "title": "お金持ちになるには1つのサイクルだけでは足りない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币是最具创新性的投资空间，它的发展方向是DeFinetly。\n是未来的一部分。这里有疯狂的收益潜力，但不要指望在几个月或一周内\n在几个月或几周内获得x10-x100。\n\n我并不是说这是不可能的，只是发生的可能性较小。那些\n处于这种情况的人...",
      "title": "你需要超过1个周期才能致富"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣是最具創新性的投資空間，它的發展方向是DeFinetly。\n是未來的一部分。這裏有瘋狂的收益潛力，但不要指望在幾個月或一週內\n在幾個月或幾周內獲得x10-x100。\n\n我並不是說這是不可能的，只是發生的可能性較小。那些\n處於這種情況的人...",
      "title": "你需要超過1個週期才能致富"
    }
  ]
}