{
  "author": "roberthonker",
  "original_created_utc": 1634414272,
  "title": "I don't give a fuck if my crypto goes to zero. All I know is that crypto is my best chance at living my dream life.",
  "created_utc": 1634420369,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m so tired of nocoiners telling me that my investment is &quot;risky&quot; and that I&#39;m going to lose it all. News flash people, high risk means high reward. I am willing to accept the fact that my crypto might go to zero, that&#39;s the chance I&#39;m taking in order to get massive gains.</p>\n\n<p>Crypto is my best chance at living my dream life on a secluded island somewhere. I can&#39;t invest in the stock market, 7% per year isn&#39;t enough. Cost of living is high enough that I can&#39;t quit my job going for some hail mary opportunity. </p>\n\n<p>So what do I even have left? Crypto. Crypto is my best chance, and I&#39;ve accepted that.</p>\n</div><!-- SC_ON -->",
  "score": 345,
  "permalink": "/r/CryptoCurrency/comments/q9jc8k/i_dont_give_a_fuck_if_my_crypto_goes_to_zero_all/",
  "subreddit": "CryptoCurrency",
  "id": "q9jc8k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm so tired of nocoiners telling me that my investment is \"risky\" and that I'm\ngoing to lose it all. News flash people, high risk means high reward. I am\nwilling to accept the fact that my crypto might go to zero, that's the chance\nI'm taking in order to get massive gains.\n\nCrypto is my best chance…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、自分の投資が「リスクが高い」とか「すべてを失ってしまう」などと言ってくるノコイナーにはうんざりしています。\nすべてを失うことになる。ニュースフラッシュの人々、ハイリスクはハイリターンを意味します。私は\n私は自分の暗号がゼロになるかもしれないという事実を喜んで受け入れていますが、それはチャンスです。\nそれが私のチャンスなのです。\n\n暗号は私の最高のチャンスです...",
      "title": "自分の暗号がゼロになっても、どうでもいい。私が知っているのは、暗号が私の夢の生活を送るための最高のチャンスだということです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经厌倦了那些告诉我我的投资有 \"风险 \"并且我将会失去所有投资的无名氏。\n将会失去一切。新闻快报的人，高风险意味着高回报。我\n愿意接受我的加密货币可能归零的事实，这就是机会。\n为了获得巨大的收益，我正在采取这种做法。\n\n加密货币是我最好的机会......",
      "title": "如果我的加密货币归零，我也不在乎。我所知道的是，加密货币是我实现梦想生活的最好机会。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經厭倦了那些告訴我我的投資有 \"風險 \"並且我將會失去所有投資的無名氏。\n將會失去一切。新聞快報的人，高風險意味着高回報。我\n願意接受我的加密貨幣可能歸零的事實，這就是機會。\n爲了獲得巨大的收益，我正在採取這種做法。\n\n加密貨幣是我最好的機會......",
      "title": "如果我的加密貨幣歸零，我也不在乎。我所知道的是，加密貨幣是我實現夢想生活的最好機會。"
    }
  ]
}