{
  "author": "GradiosTriko",
  "original_created_utc": 1635904119,
  "title": "Do you also sometimes want to disappear from this world just to know who cares?",
  "created_utc": 1635932515,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To start things of, im not suicidal or have any thoughts of ending my life or something, and I feel sorry for everyone who is, please look for help, you are wanted on this world by somebody, I am sure of it.</p>\n\n<p>But to get back to my question..</p>\n\n<p>I sometimes have thoughts of me not being there anymore, and i am thinking about who of my family and friends would actually be sad or grief about my death. Id want to know if it changes the daily routine of someone because I am not here anymore.\nTo see who really cares about me. To find out whos life I changed by being here and what happens when i am vanishing. To know if I would just be forgotten and not be a part of this world anymore, not even in memories.</p>\n\n<p>Thats stuff I want to know.\nIs someone out there the same as me and wants to know these kind of things?\nOr are you all happier if you dont know about it?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/qljx64/do_you_also_sometimes_want_to_disappear_from_this/",
  "subreddit": "TooAfraidToAsk",
  "id": "qljx64",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To start things of, im not suicidal or have any thoughts of ending my life or\nsomething, and I feel sorry for everyone who is, please look for help, you are\nwanted on this world by somebody, I am sure of it.\n\nBut to get back to my question..\n\nI sometimes have thoughts of me not being there anymore,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に言っておきますが、私は自殺願望があるわけでも、人生を終わらせたいと思っているわけでもありません。\n誰かに助けを求めてください、あなたはこの世界で誰かに求められています。\nあなたはこの世界で誰かに必要とされています、私はそれを確信しています。\n\nしかし、私の質問に戻ると...\n\n私は時々、自分はもう存在しないのではないかと考えてしまいます...。",
      "title": "この世から消えてしまいたいと思うことはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我没有自杀倾向，也没有任何结束自己生命的想法。\n我为每一个有自杀倾向的人感到遗憾，请寻求帮助，你在这个世界上是有人需要的。\n我确信，这个世界上有人需要你。\n\n但要回到我的问题上...\n\n我有时会想到我不再存在了，...",
      "title": "你是否有时也想从这个世界上消失，只是想知道谁在关心你？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我沒有自殺傾向，也沒有任何結束自己生命的想法。\n我爲每一個有自殺傾向的人感到遺憾，請尋求幫助，你在這個世界上是有人需要的。\n我確信，這個世界上有人需要你。\n\n但要回到我的問題上...\n\n我有時會想到我不再存在了，...",
      "title": "你是否有時也想從這個世界上消失，只是想知道誰在關心你？"
    }
  ]
}