{
  "author": "Spreizbacken",
  "original_created_utc": 1635496896,
  "title": "Crypto 101 - the Do's and Don'ts of Crypto investing.",
  "created_utc": 1635510951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been here for quite some time, had more than a few goof ups and figured I&#39;d help some newbies learn from my rough experience in the cryptoverse.  </p>\n\n<p>I&#39;ll start with the more controversial part - the Don&#39;ts.<br/>\n<strong>- Do not fall into the trap of thinking you are smarter than everyone else.</strong><br/>\nNobody can time the market. Getting a perfect top or bottom is pure luck and not something to aim for. DCA (dollar cost average) is your best bet. DCA in - DCA out.   </p>\n\n<p><strong>- Do not sell just to buy in lower.</strong><br/>\nI am a victim of this myself. Sound very simple to do, but 8 out of the 10 times I&#39;ve tried to do it I have either:<br/>\nA. screwed myself with fees and end up with worse deal than I originally had<br/>\nB. got left out of the market waiting for a dip to buy back in, because the price jumped<br/>\nC. shit actually worked, but historically that&#39;s rare.  </p>\n\n<p><strong>- Do not keep your crypto on an exchange</strong><br/>\nThis one hurts even if you don&#39;t get robbed out of your crypto. Buy a cold wallet, be safe. Feels really bad paying gas fees to move your crypto in and out of the exchange, but you get the security. It would feel much worse if you wake up to an empty portfolio.  </p>\n\n<p><strong>-Do not gamble. Invest</strong><br/>\nThis might come as a controversial topic with all the puppy coins bringing in humongous profits lately, but that&#39;s still a gamble, not an investment.<br/>\nIf this is your first bull/bear cycle and you are not that experienced, pick some coins from the Top20 list, do a research on them and than make your call.<br/>\nInvesting in serious project is what brings you peace and comfort in your investing journey. Betting on meme coins is a lottery ticket. 9 out of 10 times they are what we call a rug pull and the odds of you losing your money are huge.  </p>\n\n<p><strong>- Stay away from Signals and &#39;&#39;Pump and Dump&#39;&#39; groups.</strong><br/>\nSimple as that. The world is a jungle and no one is going to help you make money for free. Participating in a Pump and Dump group is a sure way to lose your money. I repeat, there is no possibility of you coming out on the winning side of this.  </p>\n\n<p><strong>- Do not reply to private messages from strangers.</strong><br/>\nNowadays scammers are everywhere, praying on young and uneducated victims. If somebody is messaging you in private offering help, promising to double your money through investing - do not reply, just ignore. Also do not click on links they send you, it could be the end of your portfolio.  </p>\n\n<p><strong>- Do not panic sell.</strong><br/>\nYour coin is free falling? Don&#39;t worry, just zoom out. Historically speaking <strong>serious</strong> projects have always gone up in time so a coin crashing down could mean two things - a buying opportunity or more time for you to get out in profit.   </p>\n\n<p><strong>-Do not use leverage trading.</strong><br/>\nI know it feels tempting, but don&#39;t. Much smarter people than you have lost everything this way. When you feel like you are experienced enough - do try it out, but be careful!   </p>\n\n<p><strong>- Do not chase pumps.</strong><br/>\nSimple, if a coin pumps - it&#39;s already too late to buy it. Better buy an undervalued one from the Top20 list, it has a better chance to pump than the one that&#39;s already pumped.  </p>\n\n<p><strong>- Do not make constant changes in your portfolio out of boredom.</strong><br/>\nI get it, you&#39;ve spent a whole month figuring things out, you&#39;ve made your portfolio just the way you like it, now what? Waiting. Yeah, but it&#39;s hard to get out of the habbit of researching, reading and basically breathing crypto. Do not fall in this trap, most of the times it will be a mistake. Stick with your plan.</p>\n\n<p><em>The Do&#39;s of crypto investing.</em>  </p>\n\n<p><strong>- Do give time.</strong><br/>\nThis is an investment, give it time to grow. It&#39;s not going to happen over night.<br/>\nDo you know who are the most profitable investers in crypto? The dead ones, because they didn&#39;t cash out early. Or at all, but that&#39;s another topic.  </p>\n\n<p><strong>- Do your own research.</strong><br/>\nIt&#39;s easy to fall in the trap of shilling a certain coin. Jeez, 9 out of 10 youtubers/redditers are doing just that. Promoting a coin so new money flows in and pumps their bags. It&#39;s not a bad thing, but do make your OWN choices, not under the influence of some guy in front of a camera screaming this is the last chance to buy in.  </p>\n\n<p><strong>- Do learn to HOLD.</strong><br/>\nLearn about cycles. Bull cycle, bear cycle, lenghtening cycles. It would help you to understand when to hold, when to sell and when to buy in.   </p>\n\n<p><strong>- Do forgive yourself about the mistakes you made and try to learn from them.</strong><br/>\nLet&#39;s face it, we all make mistakes. We all bought in too late or sold too early at some point. Nothing good can come from these dark thoughts, learn from your mistakes and move on, you will have many more chances to do right in the future.  </p>\n\n<p>This is just a short list of the most important ones, but DO feel free to add more in the comments.<br/>\nI really hope this can help some new ones in here and make their crypto journey a bit more joyful.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/qi8azn/crypto_101_the_dos_and_donts_of_crypto_investing/",
  "subreddit": "CryptoCurrency",
  "id": "qi8azn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been here for quite some time, had more than a few goof ups and figured I'd\nhelp some newbies learn from my rough experience in the cryptoverse.\n\nI'll start with the more controversial part - the Don'ts.\n- Do not fall into the trap of thinking you are smarter than everyone else.\nNobody can time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はここに来てかなりの時間が経ち、何度も失敗をしてきました。\n私のクリプトバースでの荒い経験から、何人かの初心者が学ぶのを助けようと思いました。\n\nまずは物議を醸しそうな部分、「やってはいけないこと」から始めます。\n- 自分が他の人よりも賢いと思う罠に陥らないでください。\n誰もが時間を...",
      "title": "Crypto 101 - Crypto投資のDo's and Don'ts。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里已经呆了很长时间了，有很多失误，我想我应该\n帮助一些新手从我在密码世界的粗略经验中学习。\n\n我将从比较有争议的部分开始--\"不要\"。\n- 不要落入认为自己比别人更聪明的陷阱。\n没有人可以时间...",
      "title": "Crypto 101 - Crypto投资的该做和不该做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏已經呆了很長時間了，有很多失誤，我想我應該\n幫助一些新手從我在密碼世界的粗略經驗中學習。\n\n我將從比較有爭議的部分開始--\"不要\"。\n- 不要落入認爲自己比別人更聰明的陷阱。\n沒有人可以時間...",
      "title": "Crypto 101 - Crypto投資的該做和不該做。"
    }
  ]
}