{
  "author": "UnexperiencedIT",
  "original_created_utc": 1636188600,
  "title": "I will probably never find a coin that will go x100",
  "created_utc": 1636195228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all love listening to these stories when people invested $50-$100 and got a lot of money.</p>\n\n<p>Well, those stories are rare and we as humans easily believe what we like to believe. That is why we don&#39;t pay attention to the people who lost a lot of their money by investing in some &quot;hidden gem&quot;.</p>\n\n<p>We don&#39;t like hearing those stories. We avoid them.</p>\n\n<p>And I probably will never find such a coin. I don&#39;t know how people do it honestly, maybe it is just pure luck. There is a a lot of projects that have such a great ideas and technologies but yet they are left behind.</p>\n\n<p>And even if I find it, I would probably sell most of it before it goes &quot;to the moon&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/qnwb68/i_will_probably_never_find_a_coin_that_will_go/",
  "subreddit": "CryptoCurrency",
  "id": "qnwb68",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all love listening to these stories when people invested $50-$100 and got a\nlot of money.\n\nWell, those stories are rare and we as humans easily believe what we like to\nbelieve. That is why we don't pay attention to the people who lost a lot of\ntheir money by investing in some \"hidden gem\".\n\nWe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "50～100ドルを投資して大金を手にした人の話を聞くのは誰でも好きですよね。\n大金を手にしたという話をよく聞きます。\n\nしかし、そのような話は稀であり、私たち人間は自分が信じたいことを簡単に信じてしまいます。\n信じてしまうのです。だからこそ、\"隠れた名品 \"に投資して大金を失った人には注意を払わないのです。\n隠れた宝石」に投資して大金を失った人に注意を払わないのはそのためです。\n\n私たちは...",
      "title": "100倍になるようなコインは、たぶん見つからないと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都喜欢听这样的故事：人们投资50-100美元，得到了很多钱。\n很多钱。\n\n嗯，这些故事很罕见，我们作为人类很容易相信我们喜欢的东西\n相信的东西。这就是为什么我们不关注那些因为投资一些 \"隐藏的宝石 \"而损失了大量资金的人。\n他们因投资于一些 \"隐藏的宝石 \"而损失了很多钱。\n\n我们...",
      "title": "我可能永远也找不到一个能达到X100的硬币了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都喜歡聽這樣的故事：人們投資50-100美元，得到了很多錢。\n很多錢。\n\n嗯，這些故事很罕見，我們作爲人類很容易相信我們喜歡的東西\n相信的東西。這就是爲什麼我們不關注那些因爲投資一些 \"隱藏的寶石 \"而損失了大量資金的人。\n他們因投資於一些 \"隱藏的寶石 \"而損失了很多錢。\n\n我們...",
      "title": "我可能永遠也找不到一個能達到X100的硬幣了"
    }
  ]
}