{
  "author": "UnexperiencedIT",
  "original_created_utc": 1632098655,
  "title": "Be proud if you invest in cryptocurrencies, no matter if it is $20 or $100. We, ordinary people with small capital, are the reason why all this exists.",
  "created_utc": 1632112816,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When Satoshi Nakamoto was making bitcoin, he thought mostly of us, ordinary people with low incomes. </p>\n\n<p>He was thinking on people living in corrupt states or dictatorships and had a vision of how his project could help the common man to be financially independent of such systems. </p>\n\n<p>That is why you should be proud if you invest in some quality cryptocurrencies because you invest money that you can afford to lose. YOU are contributing a small part to the future of that idea. </p>\n\n<p>Of course, in order for the price to be favorable, in the beginning it was necessary to invest large sums of money from people who had it. But, without ordinary people, then and now this would not exist.</p>\n\n<p>All the stories, all the hype, every community, the news on television, this sub, all the miners. That&#39;s all us.</p>\n\n<p>Also, if your $ 100 investment is significant for you, then your profits will also be significant. I honestly didn’t invest smart and I learned my lesson the hard way. Ever since then, when I see the opportunity and the price drop I’ve been investing  around $ 30- $ 50. I hope that in time it will grow and that I will be able to invest even more. Or also, find a better paid job.For now, I know my limits and I feel great.</p>\n\n<p>So don&#39;t get discouraged when you see all those people investing thousands and millions of dollars, just keep doing your thing and stay smart!</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/prk6q3/be_proud_if_you_invest_in_cryptocurrencies_no/",
  "subreddit": "CryptoCurrency",
  "id": "prk6q3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When Satoshi Nakamoto was making bitcoin, he thought mostly of us, ordinary\npeople with low incomes.\n\nHe was thinking on people living in corrupt states or dictatorships and had a\nvision of how his project could help the common man to be financially\nindependent of such systems.\n\nThat is why you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サトシ・ナカモトがビットコインを作っていたとき、彼が考えていたのはほとんどが私たち、普通の\n収入の少ない普通の人々のことを考えていました。\n\n腐敗した国家や独裁国家に住む人々のことを考え、自分のプロジェクトが庶民の経済的な助けになるというビジョンを持っていたのです。\n庶民が経済的に自立できるようにするにはどうすればいいか、というビジョンを持っていました。\n自分のプロジェクトが、一般の人々をそのようなシステムから経済的に独立させるのに役立つというビジョンを持っていました。\n\nだからこそ、あなた...",
      "title": "20ドルでも100ドルでも、暗号通貨に投資するなら誇りを持ってください。私たち、小資本の一般人がいるからこそ、このようなことが存在するのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当中本聪在制作比特币时，他主要想到的是我们这些低收入的普通人。\n低收入的人。\n\n他考虑的是生活在腐败国家或独裁国家的人，并有一个愿景，即他的项目可以帮助普通人实现财务自由。\n他认为他的项目可以帮助普通人在经济上独立于这些系统。\n独立于这些系统。\n\n这就是为什么你...",
      "title": "如果你投资于加密货币，不管是20美元还是100美元，都要感到自豪。我们这些拥有小资本的普通人，是这一切存在的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當中本聰在製作比特幣時，他主要想到的是我們這些低收入的普通人。\n低收入的人。\n\n他考慮的是生活在腐敗國家或獨裁國家的人，並有一個願景，即他的項目可以幫助普通人實現財務自由。\n他認爲他的項目可以幫助普通人在經濟上獨立於這些系統。\n獨立於這些系統。\n\n這就是爲什麼你...",
      "title": "如果你投資於加密貨幣，不管是20美元還是100美元，都要感到自豪。我們這些擁有小資本的普通人，是這一切存在的原因。"
    }
  ]
}