{
  "author": "Zach1902",
  "the_new_excerpt": "Hey guys, I am just looking for suggestions here. I am 19 years old. I invested\n6k into various stocks on Robinhood. I decided to take my money out of Robinhood\nbecause all the negative news and concern of a lawsuit. Plus, I think it may\nhave been time to find something a little more advanced than…",
  "original_created_utc": 1614542978,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，各位，我只是在这里寻找建议。我今年19岁。我投资了\n在Robinhood上投入了6k的各种股票。我决定把我的钱从Robinhood上取出来。\n因为所有的负面新闻和关注的官司。另外，我认为它可能\n是时候找点更先进的东西了，而不是...",
      "title": "摆脱了Robinhood。接下来我应该用什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，各位，我只是在這裏尋找建議。我今年19歲。我投資了\n在Robinhood上投入了6k的各種股票。我決定把我的錢從Robinhood上取出來。\n因爲所有的負面新聞和關注的官司。另外，我認爲它可能\n是時候找點更先進的東西了，而不是...",
      "title": "擺脫了Robinhood。接下來我應該用什麼？"
    }
  ],
  "title": "Got rid of Robinhood. What should I use next?",
  "created_utc": 1614552851,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys, I am just looking for suggestions here. I am 19 years old. I invested 6k into various stocks on Robinhood. I decided to take my money out of Robinhood because all the negative news and concern of a lawsuit. Plus, I think it may have been time to find something a little more advanced than Robinhood. I ended up selling at a good time and got a total profit of about 3k. I do not claim to be good at investing as I am still learning, but my question is what brokerage should I use. I have a vanguard account but that is mainly just for my ROTH IRA and ETFs in the normal brokerage. I want something that is good for individual stocks and has tools and research on those. I have a WeBull account but I am not sure I want to use that because its not owned by a USA company, not sure if that matters that much though. I was looking at M1 Finance. My mom has a TD Ameritrade so she let me look around on that a bit. I just want something that is user-friendly but also has the tools for individual stocks. Any suggestions?</p>\n</div><!-- SC_ON -->",
  "score": 288,
  "permalink": "/r/stocks/comments/lup5sf/got_rid_of_robinhood_what_should_i_use_next/",
  "subreddit": "stocks",
  "id": "lup5sf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937743288
}