{
  "author": "10z20Luka",
  "original_created_utc": 1634844442,
  "title": "Why are torture chambers so damn common in historic sites/castles/museums all across Europe?",
  "created_utc": 1634876483,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I swear, I&#39;ve encountered dozens of various &quot;torture chambers&quot; (often just rooms stuffed with devices for torture which were never actually used in said room) across many cities and countries in Europe, and they all meet similar criteria: imprecise dates, dead-eyed dummies, vivid descriptions of gruesome torture, and a collection of torture devices (ranging from the mundane, like the stocks, to the semi-mythical, such as an iron maiden).</p>\n\n<p>When did this phenomenon emerge? Which groups are responsible for the proliferation of such attractions (I understand they must be popular with tourists). How much do these exhibitions misrepresent the reality of torture in the Middle Ages and the Early Modern Period?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/qczecp/why_are_torture_chambers_so_damn_common_in/",
  "subreddit": "AskHistorians",
  "id": "qczecp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I swear, I've encountered dozens of various \"torture chambers\" (often just rooms\nstuffed with devices for torture which were never actually used in said room)\nacross many cities and countries in Europe, and they all meet similar criteria:\nimprecise dates, dead-eyed dummies, vivid descriptions of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誓って言うが、私は何十もの様々な「拷問室」（多くの場合、実際にはなかった拷問のための装置を詰め込んだだけの部屋）に出会ってきた。\n実際には使われていない拷問器具を詰め込んだだけの部屋）に何十回も遭遇している。)\nヨーロッパの多くの都市や国で、様々な「拷問室」（多くの場合、実際には使われていない拷問器具が詰め込まれただけの部屋）に出会ってきたが、それらはすべて同じような条件を満たしている。\n不正確な日付、死んだ目をしたダミー、生き生きとした描写...。",
      "title": "なぜヨーロッパ中の史跡・城・博物館に拷問室があんなにあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发誓，我遇到过几十个不同的 \"刑讯室\"（通常只是房间\n在许多城市和国家，我遇到了几十个不同的 \"酷刑室\"（通常只是一个房间，里面塞满了用于酷刑的设备，但实际上从未在该房间里使用）。)\n在欧洲的许多城市和国家，它们都符合类似的标准。\n不精确的日期、死人眼的假人、生动的描述......",
      "title": "为什么酷刑室在整个欧洲的历史遗址/城堡/博物馆中如此该死的普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發誓，我遇到過幾十個不同的 \"刑訊室\"（通常只是房間\n在許多城市和國家，我遇到了幾十個不同的 \"酷刑室\"（通常只是一個房間，裏面塞滿了用於酷刑的設備，但實際上從未在該房間裏使用）。)\n在歐洲的許多城市和國家，它們都符合類似的標準。\n不精確的日期、死人眼的假人、生動的描述......",
      "title": "爲什麼酷刑室在整個歐洲的歷史遺址/城堡/博物館中如此該死的普遍？"
    }
  ]
}