{
  "author": "nuanceisimportant1",
  "original_created_utc": 1643249457,
  "title": "Do you think it would be better if Reddit Moderators were called Janitors instead, so they don't take their job too seriously?",
  "created_utc": 1643259600,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In light of recent &amp;quot;events&amp;quot; on antiwork, some have pointed out the moderators there were taking their role too seriously, adding to the already negative view of powertripping moderators.&lt;/p&gt;\n\n&lt;p&gt;Do you think a change in official title to Janitor would help bring them down to a more down to earth view of their function on Reddit?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/sdn1p1/do_you_think_it_would_be_better_if_reddit/",
  "subreddit": "TooAfraidToAsk",
  "id": "sdn1p1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In light of recent \"events\" on antiwork, some have pointed out the moderators\nthere were taking their role too seriously, adding to the already negative view\nof powertripping moderators.\n\nDo you think a change in official title to Janitor would help bring them down to\na more down to earth view of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近のアンチワークでの「事件」を受けて、モデレーターの指摘もありました。\nを真剣に考えすぎていて、すでに否定的な見方をしている。\nパワートリガーするモデレーターの\n\n公式タイトルを「掃除屋」に変更することで、彼らを「掃除屋」に引きずり下ろすことができると思いますか？\nもっと地に足の着いた見方を......。",
      "title": "RedditのモデレーターはJanitors（清掃員）と呼ばれた方がいいと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于最近在antiwork上发生的 \"事件\"，一些人指出，那里的版主\n他们对自己的角色过于认真，使本来就很负面的看法更加严重。\n的负面看法。\n\n你认为将官方头衔改为 \"清洁工 \"会不会有助于将他们降至\n更加朴实的观点......",
      "title": "你认为如果Reddit版主被称为看门人会不会更好，这样他们就不会把自己的工作看得太重？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於最近在antiwork上發生的 \"事件\"，一些人指出，那裏的版主\n他們對自己的角色過於認真，使本來就很負面的看法更加嚴重。\n的負面看法。\n\n你認爲將官方頭銜改爲 \"清潔工 \"會不會有助於將他們降至\n更加樸實的觀點......",
      "title": "你認爲如果Reddit版主被稱爲看門人會不會更好，這樣他們就不會把自己的工作看得太重？"
    }
  ]
}