{
  "author": "cryptolord09",
  "original_created_utc": 1642844773,
  "title": "This is the best thing to happen to crypto for a while",
  "created_utc": 1642865469,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes you read my title right. this market crash and burn is the best thing to happen to crypto for a while.&lt;/p&gt;\n\n&lt;p&gt;sure most of us are down over 30%. sure it sucks seeing your investment of hard earned money (or not in some cases) capitulate.&lt;/p&gt;\n\n&lt;p&gt;however that being said, the joy of watching all the armchair experts who have been in the space for 5 minutes lose their shit is simply priceless. &lt;/p&gt;\n\n&lt;p&gt;call me evil, an a hole, machiavellian or whatever. but I am enjoying this moment of big old humble pie. crypto has been trending towards a meme, just another fad in pop culture. something you become a part of cos its cool, not because of the tech, disruption or any logical reason.&lt;/p&gt;\n\n&lt;p&gt;we are going to see a lot of noobs and dweebs get cleared out from this space. &lt;/p&gt;\n\n&lt;p&gt;we are also going to see a lot of scam coins, shitcoins, and downright terrible project disappear for the better.&lt;/p&gt;\n\n&lt;p&gt;this is the massive clean up we have needed for some time. the markets, and I mean ALL markets have been frothing for some time now.&lt;/p&gt;\n\n&lt;p&gt;if you truly understand and believe in crypto you will stay, and I will see you in 6 months time on the other side.&lt;/p&gt;\n\n&lt;p&gt;to all the obnoxious morons who thought they were so clever getting into crypto for the culture, GOODBYE!!! and good riddance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 424,
  "permalink": "/r/CryptoCurrency/comments/s9z1k2/this_is_the_best_thing_to_happen_to_crypto_for_a/",
  "subreddit": "CryptoCurrency",
  "id": "s9z1k2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Yes you read my title right. this market crash and burn is the best thing to\nhappen to crypto for a while.\n\nsure most of us are down over 30%. sure it sucks seeing your investment of hard\nearned money (or not in some cases) capitulate.\n\nhowever that being said, the joy of watching all the armchair…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この市場のクラッシュとバーンは最高の出来事です。\n暗号にしばらくは何が起こるかわかりません。\n\n確かに私たちの多くは30%以上下げています。\n稼いだお金(場合によっては稼げなかったお金)は、降伏する。\n\nしかし、そうは言っても、すべてのアームチェアーを見ることの喜びは、...",
      "title": "これは、しばらく暗号に起こる最高のことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，你读对了我的标题。这次市场崩溃和燃烧是加密货币一段时间内最好的事情。\n发生在加密货币上的最好事情。\n\n当然，我们大多数人都下跌了30%以上。\n赚来的钱（或在某些情况下没有）被俘。\n\n然而，尽管如此，看着所有的扶手椅上的人的喜悦......",
      "title": "这是一段时间内发生在加密货币上最好的事情了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，你讀對了我的標題。這次市場崩潰和燃燒是加密貨幣一段時間內最好的事情。\n發生在加密貨幣上的最好事情。\n\n當然，我們大多數人都下跌了30%以上。\n賺來的錢（或在某些情況下沒有）被俘。\n\n然而，儘管如此，看着所有的扶手椅上的人的喜悅......",
      "title": "這是一段時間內發生在加密貨幣上最好的事情了"
    }
  ]
}