{
  "author": "virusamongus",
  "the_new_excerpt": "If you've made enough to be comfortable for life or live off of a passive\nincome, congrats! But although I've had some great gains, I can't shake the\nfeeling that every dollar I put in today, can/should/will be worth 5-10 in a few\nyears. In the spirit of not investing more than I can afford to lose,…",
  "original_created_utc": 1616015238,
  "localize": [
    {
      "locale": "zh",
      "title": "我在这里看到很多人在谈论辞职，靠兴趣生活。我却反其道而行之，只是找了一份周末和晚上的第二份工作。",
      "the_new_excerpt": "如果你赚的钱足够让你过上舒适的生活，或者是被动的过日子的话\n收入，恭喜你 不过，虽然我有了一些很大的收获，但我还是无法撼动的\n感觉我今天投入的每一块钱，都可以/应该/将值5-10美元，在几个\n年。本着投资不能超过我所能承受的损失的精神，... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "我在這裏看到很多人在談論辭職，靠興趣生活。我卻反其道而行之，只是找了一份週末和晚上的第二份工作。",
      "the_new_excerpt": "如果你賺的錢足夠讓你過上舒適的生活，或者是被動的過日子的話\n收入，恭喜你 不過，雖然我有了一些很大的收穫，但我還是無法撼動的\n感覺我今天投入的每一塊錢，都可以/應該/將值5-10美元，在幾個\n年。本着投資不能超過我所能承受的損失的精神，... ..."
    }
  ],
  "title": "I see a lot in here talking about quitting their job and living off interests. I went the other way and just got a second job for weekends and evenings.",
  "created_utc": 1616023825,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;ve made enough to be comfortable for life or live off of a passive income, congrats! But although I&#39;ve had some great gains, I can&#39;t shake the feeling that every dollar I put in today, can/should/will be worth 5-10 in a few years. In the spirit of not investing more than I can afford to lose, I&#39;m not gonna kill my savings, so decided I&#39;ll churn some extra sidecoin instead.</p>\n\n<p>I just got accepted at a job of delivering food, think Door Dash/Uber eats, freelance kinda thing I can just rock whenever I have spare time and energy. Biking around in the sun on my ebike and listening to podcasts while churning out sats or moon shots (rather than rewatching The Office and staring at my charts), is honestly something I&#39;m super stoked about - and since it&#39;s covid best practice to just leave the food at the customers door and every interaction goes through an app, even an introvert like me can get this done lol.</p>\n\n<p>I can&#39;t wait to tell my grandkids my own BTC pizza story, that delivering junk food helped pay for their education. I don&#39;t have too many crypto junkie friends, so just needed to share with you all. </p>\n\n<p>Thank you all for your inspiration.</p>\n\n<p>/shitpost.</p>\n</div><!-- SC_ON -->",
  "score": 1220,
  "permalink": "/r/CryptoCurrency/comments/m7aozr/i_see_a_lot_in_here_talking_about_quitting_their/",
  "subreddit": "CryptoCurrency",
  "id": "m7aozr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378444
}