{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1631045440,
  "title": "I'm down over £9000 from yesterday.",
  "created_utc": 1631072033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I&#39;m not bothered, neither should you be. </p>\n\n<p>Seems to be more hysterical teens on here screaming &quot;DONT PANIC GUYS OMG WHY ARE YOU ALL PANICKING&quot; than sensible adults, where as, a matter of fact anyone who&#39;s been in crypto for more than a year knows this is healthy for the market. </p>\n\n<p>Over 120 millions USDT has been just deposited alone the past hour on exchanges, this will bounce back higher than ever imo. </p>\n\n<p>But if it doesn&#39;t, so what? This isn&#39;t a job or a quick money making opportunity. If we continue to decline, continue to wait or buy in small amounts throughout the rest of the week to average out. </p>\n\n<p>You&#39;re in safe hands if you invested in a solid project, which there are hundreds of at the moment. Unless your coin is a BSC/erc20 rug special, then rip.</p>\n\n<p>All you need to do is zoom out to be reassured. </p>\n\n<p>Source: trust me bro, I&#39;m a nugget.</p>\n</div><!-- SC_ON -->",
  "score": 448,
  "permalink": "/r/CryptoCurrency/comments/pjuwki/im_down_over_9000_from_yesterday/",
  "subreddit": "CryptoCurrency",
  "id": "pjuwki",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If I'm not bothered, neither should you be.\n\nSeems to be more hysterical teens on here screaming \"DONT PANIC GUYS OMG WHY ARE\nYOU ALL PANICKING\" than sensible adults, where as, a matter of fact anyone who's\nbeen in crypto for more than a year knows this is healthy for the market.\n\nOver 120 millions…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が気にならなければ、あなたも気にならないはずです。\n\nここでは、分別のある大人よりも、ヒステリックな10代の若者たちが「みんなパニックになるな」と叫んでいるように思えます。\n実際のところ、1年以上暗号に関わっている人なら誰でも知っていることですが。\n実際のところ、1年以上暗号に関わっている人は、これが市場にとって健全であることを知っています。\n\n1億2千万以上の...",
      "title": "昨日から9000ポンド以上のダウンです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我不烦，你也不应该烦。\n\n这里似乎有更多歇斯底里的青少年在尖叫 \"不要惊慌，伙计们，为什么你们都在惊慌\"，而不是明智的成年人。\n你们都在恐慌\"，而不是理智的成年人。\n都知道这对市场是健康的。\n\n超过1.2亿人...",
      "title": "我比昨天减少了9000多英镑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我不煩，你也不應該煩。\n\n這裏似乎有更多歇斯底里的青少年在尖叫 \"不要驚慌，夥計們，爲什麼你們都在驚慌\"，而不是明智的成年人。\n你們都在恐慌\"，而不是理智的成年人。\n都知道這對市場是健康的。\n\n超過1.2億人...",
      "title": "我比昨天減少了9000多英鎊。"
    }
  ]
}