{
  "author": "SuccessfulProblem494",
  "original_created_utc": 1655245227,
  "title": "Why are black only dating apps encouraged but white only ones are immediately controversial?",
  "created_utc": 1655261779,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recently I have noticed a lot of black only dating apps have came around. Yet their is not any for whites, and the ones that their have been got challenged and taken down. If black people can have a racial preference without being racist why is it any different for whites. I have no interest in using either I just find it interesting how this is where the line is drawn.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 371,
  "permalink": "/r/NoStupidQuestions/comments/vcf5zw/why_are_black_only_dating_apps_encouraged_but/",
  "subreddit": "NoStupidQuestions",
  "id": "vcf5zw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Recently I have noticed a lot of black only dating apps have came around. Yet\ntheir is not any for whites, and the ones that their have been got challenged\nand taken down. If black people can have a racial preference without being\nracist why is it any different for whites. I have no interest in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、黒人専用の出会い系アプリがたくさん出てきていますね。しかし\n白人のためのものはなく、また、そのようなものは挑戦され\nされ、削除されています。黒人が人種差別をすることなく人種的嗜好を持つことができるのなら、なぜ白人は違うのでしょう。\n白人と何が違うのでしょうか。私は興味がない...",
      "title": "なぜ黒人専用の出会い系アプリは奨励されるのに、白人専用のものはすぐに物議をかもすのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我注意到有很多只针对黑人的约会软件出现了。然而\n他们没有任何针对白人的应用程序，而那些已经被质疑的应用程序也被拿下了\n并被取缔。如果黑人可以有种族偏好而不成为\n为什么对白人来说有什么不同呢？我没有兴趣...",
      "title": "为什么只允许黑人约会的应用程序受到鼓励，而只允许白人约会的应用程序却立即引起了争议？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我注意到有很多隻針對黑人的約會軟件出現了。然而\n他們沒有任何針對白人的應用程序，而那些已經被質疑的應用程序也被拿下了\n並被取締。如果黑人可以有種族偏好而不成爲\n爲什麼對白人來說有什麼不同呢？我沒有興趣...",
      "title": "爲什麼只允許黑人約會的應用程序受到鼓勵，而只允許白人約會的應用程序卻立即引起了爭議？"
    }
  ]
}