{
  "author": "toomaime",
  "original_created_utc": 1631821543,
  "title": "Passed 500$ MRR with my side-project while having a full-time job and two kids",
  "created_utc": 1631828792,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started over a year ago with the work on a side project called <a href=\"https://sponsorgap.com/\">Sponsorgap</a> - a platform for creators to find a sponsor. It was profitable from the early beginning on and in the last months I passed 500$ MRR. It sounds like a success but to tell the truth, it is really hard work and often comes with some ups and a lot of downs.<br/>\nHere are some key learning lessons for me so far and things that have worked for me - maybe it helps other people working on side-projects:</p>\n\n<ul>\n<li>Marketing:</li>\n</ul>\n\n<p>Instead of just posting and sharing stuff, I also try to provide value and offer help with my posts. E.g. I regularly offer on Indiehackers, FB groups, or Reddit to send everyone a customized list with potential brands willing to buy ads or sponsorships in their industry niche.</p>\n\n<ul>\n<li>Tech Stack:</li>\n</ul>\n\n<p>Nothing new here but stick to what you already know or the tools you are familiar with. If you run a subscription service be very careful what tool you use for handling the SignUp/ Payment process as it could come with some restrictions.</p>\n\n<ul>\n<li>Talk to your customers</li>\n</ul>\n\n<p>That is maybe the most valuable lesson for me. From the beginning on, I tried to talk to everyone who was interested in Sponsorgap or who was already a customer. I offered to everyone to chat with me and I really had great calls with people letting me know what they like or didn&#39;t like and above all what exactly they were looking for.</p>\n\n<ul>\n<li>Focus on one or two features</li>\n</ul>\n\n<p>This was/is also a mistake I made at the beginning. While talking to different customers I noticed that I had two user personas with different needs. On the one hand, the creators looking for sponsors, and on the other hand brands looking to sponsor a creator. I started to add features for both sides which is not working at an early stage. So focus on one user persona and build one or two great features for them.</p>\n\n<ul>\n<li>People copying your idea</li>\n</ul>\n\n<p>This was really bothering me at the beginning, as people started to copy my idea, even some wording from my landing page. In the end, I decided to just ignore it as I think that they can&#39;t copy your creativity and vision of the product.</p>\n\n<ul>\n<li>Life/Work balance</li>\n</ul>\n\n<p>Ok, here I am failing miserable - not sure if there are a lot of people working on side-projects, having a full-time job, and having two kids...but I am one of these. The only thing which I can recommend here is to block a time slot where you exclusively work on your project. For me, that is mostly in the evening when everybody is sleeping.</p>\n\n<ul>\n<li>Connect with other makers in your niche and build partnerships</li>\n</ul>\n\n<p>The last thing which is really helping me also with the MRR is building partnerships with other makers in your niche. E.g. I teamed up with Pete Codes to offer a discount for his newsletter course on <a href=\"https://petecodes.gumroad.com/l/GGofo\">how to monetize your newsletter </a>and with Andrew from Pigeon, I am <a href=\"https://kampheyapproved.gumroad.com/l/PigeonSponsorGap\">currently running a deal</a> where you can get a one-year access to his CRM and Sponsorgap.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/ppkjvw/passed_500_mrr_with_my_sideproject_while_having_a/",
  "subreddit": "SideProject",
  "id": "ppkjvw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I started over a year ago with the work on a side project called Sponsorgap\n[https://sponsorgap.com/] - a platform for creators to find a sponsor. It was\nprofitable from the early beginning on and in the last months I passed 500$ MRR.\nIt sounds like a success but to tell the truth, it is really hard…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は1年以上前に、Sponsorgapというサイドプロジェクトの仕事を始めました。\n[https://sponsorgap.com/] - クリエイターがスポンサーを見つけるためのプラットフォームです。これは\n成功したように聞こえますが、実際にはそうではありません。\n成功したように聞こえますが、正直に言うと、これは本当に難しいことです...。",
      "title": "フルタイムの仕事と2人の子供を抱えながら、私のサイドプロジェクトで500ドルのMRRをパスした"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一年多前，我开始在一个名为Sponsorgap的副业上工作。\n[https://sponsorgap.com/] --一个为创作者寻找赞助商的平台。它从一开始就是盈利的。\n它从一开始就有利可图，在过去的几个月里，我通过了500美元的MRR。\n这听起来很成功，但说实话，这真的很困难......",
      "title": "在有全职工作和两个孩子的情况下，用我的副业项目通过了500美元的MRR"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一年多前，我開始在一個名爲Sponsorgap的副業上工作。\n[https://sponsorgap.com/] --一個爲創作者尋找贊助商的平臺。它從一開始就是盈利的。\n它從一開始就有利可圖，在過去的幾個月裏，我通過了500美元的MRR。\n這聽起來很成功，但說實話，這真的很困難......",
      "title": "在有全職工作和兩個孩子的情況下，用我的副業項目通過了500美元的MRR"
    }
  ]
}