{
  "author": "yeeyeesuckinteets",
  "the_new_excerpt": "Mods: please don't delete this post because \"there's already other Dogecoin\nposts.\" It's very frustrating when that happens. Peace & love..\n\nFor context: Some guy over on the Doge subreddit is posting his Dogecoin gains\nand bragging about being a Doge millionaire. When I first saw that post my…",
  "original_created_utc": 1619197830,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Mods: 「すでに他のDogecoinの投稿があるから」という理由でこの投稿を削除しないでください。\n投稿を削除しないでください。それが起こると、とてもイライラします。平和と愛を。\n\n文脈としては Doge subredditの一部の人がDogecoinの利益を投稿しています。\nDogeの億万長者になったことを自慢しています。私が最初にその投稿を見たとき...",
      "title": "Doge subredditで自慢している「Dogecoin millionaire」の男の真実"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "版主：请不要因为 \"已经有其他Dogecoin了 \"而删除此帖。\n帖子\"。当这种情况发生时，这是很令人沮丧的。和平与爱。\n\n对于背景。一些人在Doge子论坛上发布了他的Dogecoin收益\n并吹嘘自己是一个Doge百万富翁。当我第一次看到这个帖子时，我...",
      "title": "在Doge subreddit上吹嘘的 \"Dogecoin百万富翁 \"的真相"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "版主：請不要因爲 \"已經有其他Dogecoin了 \"而刪除此帖。\n帖子\"。當這種情況發生時，這是很令人沮喪的。和平與愛。\n\n對於背景。一些人在Doge子論壇上發佈了他的Dogecoin收益\n並吹噓自己是一個Doge百萬富翁。當我第一次看到這個帖子時，我...",
      "title": "在Doge subreddit上吹噓的 \"Dogecoin百萬富翁 \"的真相"
    }
  ],
  "title": "The truth about the \"Dogecoin millionaire\" guy that's bragging over on the Doge subreddit",
  "created_utc": 1619235450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Mods: please don&#39;t delete this post because &quot;there&#39;s already other Dogecoin posts.&quot; It&#39;s very frustrating when that happens. Peace &amp; love..</em></p>\n\n<p>For context: Some guy over on the Doge subreddit is posting his Dogecoin gains and bragging about being a Doge millionaire. When I first saw that post my mind was blown. I was under the impression that this guy was an average retail investor that invested a couple thousand and became a millionaire from it. Well, that&#39;s far from the truth. Naturally, I wanted to dig a little deeper and find out more about this guy. What I found out is that he&#39;s not being very transparent about these astronomical gains.</p>\n\n<p>His original investment wasn&#39;t a few thousand, or even 10 thousand, it was 188k. That is no small amount of money to be throwing around at a meme coin. This isn&#39;t some &quot;rags to riches&quot; story you&#39;re seeing, this guy is obviously very wealthy to begin with. When you have 188k to invest, it&#39;s much easier to make 1 million. As opposed to your average investor, if they only have a few thousand to work with, it&#39;s near impossible to hit that 1 million dollar mark.</p>\n\n<p>Not only that, but this guy posted a few days ago and showed that he still hasn&#39;t taken profits and doesn&#39;t plan on it yet, so he&#39;s now far from having 1 million gains. Considering the price of Doge right now, he&#39;s probably sitting at 350k..... and his original investment was 188k. Let&#39;s do the math, shall we. This means the dude is sitting at $162,000 profit. While that&#39;s amazing and incredible, it&#39;s a far cry from $1,000,000.</p>\n\n<p>Don&#39;t believe anything you see online and remember always to question everything. I just felt like this dudes post was misleading and it can make normal retail investors FOMO into Doge so they can be just like him only to be burnt in the end. In reality, this dude was very wealthy before Doge. Just remember, not everything is how it looks.</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/mx02jk/the_truth_about_the_dogecoin_millionaire_guy/",
  "subreddit": "CryptoCurrency",
  "id": "mx02jk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208805
}