{
  "author": "Qtredit",
  "original_created_utc": 1637861894,
  "title": "If you're in crypto for the long run, do yourself a favor and stop staring at the charts all day",
  "created_utc": 1637879818,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s fun reading crypto news, being on this subreddit and occasionally checking the prices.</p>\n\n<p>But the habit of refreshing the charts a few times a day or a few times every hour, or, waking up at 4am and reaching for your phone just ruins your life.</p>\n\n<p>Staring at the charts won&#39;t help the prices. If you&#39;re not day trading you&#39;re doing more harm than good.</p>\n\n<p>Think of all the things you could do instead.</p>\n\n<p>All those projects you&#39;ve never had time for, watching a movie, calling your parents, playing with your kid.</p>\n\n<p>Staring at charts mostly adds stress, but that&#39;s about it.</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/r21wnd/if_youre_in_crypto_for_the_long_run_do_yourself_a/",
  "subreddit": "CryptoCurrency",
  "id": "r21wnd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's fun reading crypto news, being on this subreddit and occasionally checking\nthe prices.\n\nBut the habit of refreshing the charts a few times a day or a few times every\nhour, or, waking up at 4am and reaching for your phone just ruins your life.\n\nStaring at the charts won't help the prices. If…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号ニュースを読んだり、このサブレディットに参加したり、たまに価格をチェックしたりするのは楽しいですね。\n価格をチェックするのも楽しいです。\n\nしかし、1日に数回、あるいは1時間に数回、チャートを更新する習慣\n1時間に数回チャートを更新したり、朝4時に目が覚めて携帯電話に手を伸ばしたりする習慣は、人生を台無しにします。\n\nチャートとにらめっこしていても、価格はどうにもならない。もし...",
      "title": "暗号を長期的に利用する場合は、一日中チャートを見るのはやめましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阅读加密货币新闻，在这个分论坛上，偶尔查看一下价格，这很有趣。\n价格。\n\n但是，每天刷新几次或每小时刷新几次图表的习惯\n或者，在凌晨4点醒来，伸手去拿你的手机，这只会毁了你的生活。\n\n盯着图表看对价格没有帮助。如果...",
      "title": "如果你想长期从事加密货币，请帮你自己一个忙，不要整天盯着图表看。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "閱讀加密貨幣新聞，在這個分論壇上，偶爾查看一下價格，這很有趣。\n價格。\n\n但是，每天刷新幾次或每小時刷新幾次圖表的習慣\n或者，在凌晨4點醒來，伸手去拿你的手機，這隻會毀了你的生活。\n\n盯着圖表看對價格沒有幫助。如果...",
      "title": "如果你想長期從事加密貨幣，請幫你自己一個忙，不要整天盯着圖表看。"
    }
  ]
}