{
  "author": "partymsl",
  "original_created_utc": 1658079083,
  "title": "Fear and Greed Index has been in \"Extreme Fear\" territory for consecutive 72 days, that's the longest period ever!",
  "created_utc": 1658113128,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Even after a pretty good relief rally for Bitcoin and especially alts and Ethereum this week despite the bad inflation data, there is no denying that we are very deep in a bear market right now. And the once in a century kind of bad macro situation with 40 year high inflation (with real data its 70 year peak), has made this arguably the most extraordinary bear market in Crypto yet.&lt;/p&gt;\n\n&lt;p&gt;To strengthen this statement, the occasionally used Fear and Greed Index that is meant to show the market sentiment in the crypto markets, has been at &amp;quot;Extreme Fear&amp;quot; territory for now 72 days in a row. That&amp;#39;s the longest period that has EVER happened. And you can clearly see that in the charts too, we did not have any meaningful rally since April.&lt;/p&gt;\n\n&lt;p&gt;The markets are in a situation they never been before and on July 28th crypto will see its first recession is history. The coming waters are very uncharted, so be cautious or the whales will eat you up.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/w1cmxa/fear_and_greed_index_has_been_in_extreme_fear/",
  "subreddit": "CryptoCurrency",
  "id": "w1cmxa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Even after a pretty good relief rally for Bitcoin and especially alts and\nEthereum this week despite the bad inflation data, there is no denying that we\nare very deep in a bear market right now. And the once in a century kind of bad\nmacro situation with 40 year high inflation (with real data its 70…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコイン、特にアルトのかなり良いリリーフラリーの後でもあり\n今週は悪いインフレデータにもかかわらず、イーサリアムがかなり良いリリーフラリーをしていることは否定できない。\n今、弱気相場の真っ只中にいることは否定できません。そして、100年に一度の悪材料である\n40年に一度の高インフレというマクロ状況（実際のデータでは70...",
      "title": "恐怖と貪欲の指数が72日間連続で「極度の恐怖」の領域に入り、これは過去最長の期間です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "即使在比特币，特别是alts和E-mail的一个相当好的缓解反弹之后，也是如此。\n尽管本周通胀数据不佳，但不可否认的是，我们已经深入到了熊市暴动中。\n现在正处于熊市的深处。而这种百年一遇的恶劣\n宏观形势是40年来的高通胀（实际数据是70年）。",
      "title": "恐惧和贪婪指数已经连续72天处于 \"极度恐惧 \"的区域，这是有史以来最长的时期！\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "即使在比特幣，特別是alts和E-mail的一個相當好的緩解反彈之後，也是如此。\n儘管本週通脹數據不佳，但不可否認的是，我們已經深入到了熊市暴動中。\n現在正處於熊市的深處。而這種百年一遇的惡劣\n宏觀形勢是40年來的高通脹（實際數據是70年）。",
      "title": "恐懼和貪婪指數已經連續72天處於 \"極度恐懼 \"的區域，這是有史以來最長的時期！\"。"
    }
  ]
}