{
  "author": "BrigPandita",
  "original_created_utc": 1628966419,
  "title": "Anyone know any other legit telegram channels to follow to find early projects?",
  "created_utc": 1628973186,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was introduced to crypto back in March by a buddy I gamed with. However, it’s fair to say when it comes to investing I am very much inexperienced.  I currently follow two telegram channels - Cryptogems55 (t.me/cryptogems555) and Gollum’s Gems (t.me/gollumsgems)</p>\n\n<p>I was happy following CryptoGems555 on Twitter for a while and did find some good projects on there. My problem was that it became very oversaturated and there wasn’t too many genuine coins that enabled me to make profit. I’m very slow so by the time I got in the chart had already peaked!</p>\n\n<p>I’ve been following Gollum’s Gems on Telegram which has provided some good projects and I&#39;ve made a couple of BNB profit on the ones I&#39;ve caught. I&#39;m not sure if it&#39;s just beginners luck or if all their calls are that good. All the coins I have bought from there have been safe which is important to me and it’s clear they do their research. My only issue is that I’m from Australia and often miss their calls.</p>\n\n<p>So this leads to my question – where can I find more reliable information about new coins? It’s important to me that they are honest and do their research into safe projects so I can have confidence investing.</p>\n\n<p>Thank you!</p>\n</div><!-- SC_ON -->",
  "score": 464,
  "permalink": "/r/CryptoCurrency/comments/p4dkrs/anyone_know_any_other_legit_telegram_channels_to/",
  "subreddit": "CryptoCurrency",
  "id": "p4dkrs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was introduced to crypto back in March by a buddy I gamed with. However, it’s\nfair to say when it comes to investing I am very much inexperienced. I currently\nfollow two telegram channels - Cryptogems55 (t.me/cryptogems555) and Gollum’s\nGems (t.me/gollumsgems)\n\nI was happy following CryptoGems555…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3月に一緒にゲームをしていた仲間から暗号を紹介されました。しかし、それは\n投資に関しては非常に未熟だと言っていいでしょう。現在、私は\n2つのテレグラムチャンネルをフォローしています - Cryptogems55 (t.me/cryptogems555) と Gollum's Gems (t.me/gollum's Gems)\nGems (t.me/gollumsgems)\n\n私はCryptoGems555をフォローして幸せでした...。",
      "title": "誰か、初期のプロジェクトを見つけるために、他の合法的な電報チャンネルを知っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早在3月份，我就被一个和我一起玩游戏的哥们介绍给了加密货币。然而，可以说在投资方面我是非常没有经验的。\n可以说，当涉及到投资时，我是非常没有经验的。我目前\n关注两个电报频道--Cryptogems55（t.me/cryptogems555）和Gollum's\nGems (t.me/gollumsgems)\n\n我很高兴跟随CryptoGems555...",
      "title": "有谁知道有什么其他合法的电报渠道可以用来寻找早期项目？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在3月份，我就被一個和我一起玩遊戲的哥們介紹給了加密貨幣。然而，可以說在投資方面我是非常沒有經驗的。\n可以說，當涉及到投資時，我是非常沒有經驗的。我目前\n關注兩個電報頻道--Cryptogems55（t.me/cryptogems555）和Gollum's\nGems (t.me/gollumsgems)\n\n我很高興跟隨CryptoGems555...",
      "title": "有誰知道有什麼其他合法的電報渠道可以用來尋找早期項目？"
    }
  ]
}