{
  "author": "Jase82",
  "original_created_utc": 1636060654,
  "title": "What is your #1 cryptocurrency market rule that you will never break?",
  "created_utc": 1636073351,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As we see many newcomers enter the market, they don&#39;t have a sense for the market like those who have had long term experience. </p>\n\n<p>A lot of easy to avoid mistakes are made. People lose a ton of money. </p>\n\n<p>Those who have weathered the 2018 crash have some tough skin and rigid rules they will never break in the crypto market. Tons of this insight comes from past mistakes we have all made. </p>\n\n<p>A rule I&#39;ve learned not to break is to never sell 100% of a crypto to buy a new one. Always save around 10% or more. If I had done this with ETH over the last 5 years my ETH bag would be substantial. </p>\n\n<p>What is your #1 crypto rule that you don&#39;t ever break?</p>\n\n<p>Edit: Welcome and good luck to all the newcomers the crypto community is happy to have you!</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/qmuvr8/what_is_your_1_cryptocurrency_market_rule_that/",
  "subreddit": "CryptoCurrency",
  "id": "qmuvr8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As we see many newcomers enter the market, they don't have a sense for the\nmarket like those who have had long term experience.\n\nA lot of easy to avoid mistakes are made. People lose a ton of money.\n\nThose who have weathered the 2018 crash have some tough skin and rigid rules\nthey will never break…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの新参者が市場に参入してきますが、彼らは長年の経験者のような市場感覚を持ち合わせていません。\n長く経験を積んだ人のように、市場に対する感覚がない。\n\n多くの簡単に避けられるミスが起こります。大金を失うことになります。\n\n2018年の暴落を乗り切った人たちは、強靭な皮膚と厳格なルールを持っています。\n決して破ることはないだろう...。",
      "title": "あなたが絶対に破ってはいけない暗号通貨市場のルール第1位は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们看到许多新人进入市场，他们对市场的感觉不像那些有长期经验的人那样。\n他们不像那些有长期经验的人那样对市场有感觉。\n\n犯了很多容易避免的错误。人们损失了一大笔钱。\n\n那些经历过2018年崩溃的人有一些坚韧的皮肤和严格的规则\n他们永远不会打破...",
      "title": "你的第一条加密货币市场规则是什么，你永远不会违反？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們看到許多新人進入市場，他們對市場的感覺不像那些有長期經驗的人那樣。\n他們不像那些有長期經驗的人那樣對市場有感覺。\n\n犯了很多容易避免的錯誤。人們損失了一大筆錢。\n\n那些經歷過2018年崩潰的人有一些堅韌的皮膚和嚴格的規則\n他們永遠不會打破...",
      "title": "你的第一條加密貨幣市場規則是什麼，你永遠不會違反？"
    }
  ]
}