{
  "author": "hollywood_harpoon",
  "the_new_excerpt": "I’ve been trying to dent my brain these last couple of months to get to\nunderstand what’s been going on and why I believe in GME so much, and then\nrecently, I feel a bomb had been dropped on me with the talk about Payment for\nOrder Flow and dark pool off-market buys. I’ve just started denting my…",
  "original_created_utc": 1616287694,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这几个月来，我一直在努力钻研我的大脑，以达到\n了解发生了什么，为什么我这么相信GME，然后...\n最近，我感觉到一个炸弹被扔在我的身上，关于支付的谈话。\n订单流和暗池场外买入。我刚刚开始凹陷我的...",
      "title": "猿，我想我钉了! TL;DR麦道夫切他的牙齿与欺诈PFOF之前移动到喂养鲸鱼，在同一时间，华尔街采用他的欺诈方法与PFOF喂养零售。这真的是一个大庞氏骗局。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這幾個月來，我一直在努力鑽研我的大腦，以達到\n瞭解發生了什麼，爲什麼我這麼相信GME，然後...\n最近，我感覺到一個炸彈被扔在我的身上，關於支付的談話。\n訂單流和暗池場外買入。我剛剛開始凹陷我的...",
      "title": "猿，我想我釘了! TL;DR麥道夫切他的牙齒與欺詐PFOF之前移動到餵養鯨魚，在同一時間，華爾街採用他的欺詐方法與PFOF餵養零售。這真的是一個大龐氏騙局。"
    }
  ],
  "title": "Apes, I think I nailed it! TL;DR Madoff cut his teeth with fraud with PFOF before moving to feeding off the whales, in the mean time, Wall Street adopted his fraud methods with PFOF to feed off of retail. It really is a big Ponzi scheme.",
  "created_utc": 1616330353,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been trying to dent my brain these last couple of months to get to understand what’s been going on and why I believe in GME so much, and then recently, I feel a bomb had been dropped on me with the talk about Payment for Order Flow and dark pool off-market buys. I’ve just started denting my brain by understanding how Fails to Deliver are hid in Out of the Money calls or puts or whatever and now I got to try and understand Payment for Order Flow?! Its like studying for the SAT and then someone knocks on the door and tells you, by the way, you are taking the MCATS tomorrow morning. WTF?!</p>\n\n<p>So, apparently PFOF was started by Madoff! I think on the surface it looks legit, but it is easily used for wicked purposes by moving it to dark pools and off market buys, which explains why there is so much buying but it doesn’t move the ticker at all, while sells plummet it in seconds. I guess the SEC looks at this and says, ‘oh cool, this was started by Madoff and is now industry standard, nothing to see here, would you like a sensual hand job or an angry one’? Is this why Wall Street and Main Street haven’t been the same street in a long time? Since 2008? Earlier?</p>\n\n<p>Its starting to feel like Wall Street is one big Ponzi scheme, I know we all know that, but when it happens for real its terrifying! Madoff has been butt fucking everyone since the early eighties, how deep does this rabbit hole go, how deep is his dick still in our rabbit hole?</p>\n\n<p>This is my favorite part of his Wiki.</p>\n\n<p>&quot;Madoff founded a penny stock brokerage in 1960 which eventually grew into Bernard L. Madoff Investment Securities. He served as its chairman until his arrest on December 11, 2008.[6][7] The firm was one of the top market maker businesses on Wall Street,[8] which bypassed &quot;specialist&quot; firms by directly executing orders over the counter from retail brokers.&quot; FUCKING GREAT!!!</p>\n\n<p>Then I went digging around and looking at the brokers who adopted this. And holy fucking shit, its almost all of them! TD Ameritrade where all of my funds are at are listed, and Vanguard who I was hoping to transfer to. And now I got to sweat moving my shares from TD, something that makes me extremely nervous, thinking that I might miss out on the rocket launch I’ve been so patiently waiting on.</p>\n\n<p>Any talk about moving from TD is simply not on here, lots of talk about Robinhood and Fidelity, but any questions about TD and I get down voted to oblivion. So much FUD, so little time...</p>\n\n<p>I remember when Apes figured out shorts were being hid in ETF’s and how big of a bomb that was, this TFOF stuff feels bigger! I don’t think its getting the attention it deserves because we haven’t had any time to catch our breath from all the other bombs dropped, short ETF’s, hidden FTD’s etc. Good luck ever getting this talked about in Congress, they can hardly even address Naked Short’s. They are still learning arithmetic when we need to be discussing Calculus!</p>\n\n<p>I’m so angry and frustrated and I don’t know who to blame. Citadel? SEC? Madoff? Myself for being so ignorant on what’s going on? I’m so confused and hoping some big brain apes can help. I’m just a homeless filmmaker, aren’t real adults supposed to be in charge of looking into this? What’s next, I wake up and there is Morpheus telling me to see with my real eyes? Have I become as crazy as all my friends and family think I am about GME? Have we become QAnon? WHAT THE FUCK IS GOING ON?!!!</p>\n\n<p>This really is the biggest fraud in history and we are the only ones talking about it, isn’t it? This is Madoff, only this time, Madoff is all of Wall Street!</p>\n\n<p>Is every broker dealing with PFOF a toxic dumping ground? Is it worth it to move from TD? How long will it truly take? Is every broker fucked? Are we all fucked? All of these institutions are saying, ‘hey, trust me with your money, I learned everything I know from Bernie Madoff’.</p>\n\n<p>FUCK! SHIT! FUCK! I want out! And I don’t know who to trust!</p>\n\n<p>I’m angry, scared, exhilarated… Fuck it, no matter what, if I miss the rocket, if it explodes, if it launches me at 30 G’s into the sun, this has been a wild ride and well worth it. I hope I know what I’m doing, I hope that you do too. But, most of all, I hope that this changes things for the better! I hope all of you Apes are rewarded and safe on your Rocket ride!</p>\n\n<p>I’m so confused and don’t know who to trust. The only thing I know is that I believe in the DD and I believe in you fellow Apes.</p>\n\n<p>Any thoughts would be greatly appreciated, Peace and HODL!</p>\n\n<p>TL;DR I think Madoff cut his teeth with fraud with PFOF before moving to bigger fraud feeding off the whales, in the mean time, Wall Street adopted his fraud methods with PFOF feeding off of retail. It really is a big Ponzi scheme.</p>\n</div><!-- SC_ON -->",
  "score": 1888,
  "permalink": "/r/wallstreetbets/comments/m9kh46/apes_i_think_i_nailed_it_tldr_madoff_cut_his/",
  "subreddit": "wallstreetbets",
  "id": "m9kh46",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752826456
}