{
  "author": "xcryptogurux",
  "original_created_utc": 1624475887,
  "title": "El Salvador President has a better grasp of Bitcoin than 99% of Bitcoiners",
  "created_utc": 1624502173,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Excerpts from Nayib Bukele&#39;s Interview with McCormack</strong></p>\n\n<p>(When he first came across Bitcoin) I thought it was very smart. But a lot of good ideas just vanish. Bitcoin just keeps growing and growing, not only in price.</p>\n\n<p>Measuring Bitcoin against dollars kind of defeats the point of Bitcoin. (1 BTC = 1 BTC)</p>\n\n<p>At the beginning, I thought Bitcoin was beautiful and now I&#39;m even more convinced about it since it has withstood the pressure of time and changes in global political landscapes, social media exploding... you have all these changes but Bitcoin has not only persisted but its impact keeps growing.</p>\n\n<p>It is not just a very good idea anymore. At the beginning it was interesting. Now it&#39;s a reality.</p>\n\n<p>Of course, classical economists don&#39;t like it. It&#39;s not that they don&#39;t understand but they don&#39;t want to understand it. It would mean all of their preconceptions, their theses, their works, their books would be meaningless because they were wrong.</p>\n\n<p>Imagine someone who has been attacking Bitcoin for over a decade and now to see it succeed would be very hard for them.</p>\n\n<p>(About World Bank not helping) We don&#39;t need them. Way before we announced our plan to make Bitcoin legal tender, we have had amazing talent from overseas working tirelessly to make this happen. They are not here for money, but idealists who want to make a difference, to make the lives of the people better who need it most.</p>\n\n<p>(About IMF concern) We adopted the dollar in 2001. This is no different. The only difference is we adopted the dollar for the benefit of our banks. This is for the benefit of our people.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/Bitcoin/comments/o6jubr/el_salvador_president_has_a_better_grasp_of/",
  "subreddit": "Bitcoin",
  "id": "o6jubr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Excerpts from Nayib Bukele's Interview with McCormack\n\n(When he first came across Bitcoin) I thought it was very smart. But a lot of\ngood ideas just vanish. Bitcoin just keeps growing and growing, not only in\nprice.\n\nMeasuring Bitcoin against dollars kind of defeats the point of Bitcoin. (1 BTC =\n1…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナイブ・ブケレ氏のマコーマック氏へのインタビューより抜粋\n\nビットコインに出会ったとき）とてもスマートだと思いました。しかし、多くの良いアイデアは\n良いアイデアは消えてしまうものです。ビットコインは、価格だけでなく、どんどん成長しています。\n価格だけではありません。\n\nドルに対してビットコインを測定することは、ビットコインの意味を失わせるようなものです。(1BTC =\n1...",
      "title": "エルサルバドル大統領は、ビットコインの99％を把握しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Nayib Bukele与McCormack的访谈摘录\n\n当他第一次接触到比特币时）我认为它非常聪明。但很多\n好的想法都会消失。比特币一直在不断增长，不仅是在\n价格。\n\n用美元衡量比特币，有点违背了比特币的意义。(1 BTC =\n1...",
      "title": "萨尔瓦多总统对比特币的掌握比99%的比特币人都要好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Nayib Bukele與McCormack的訪談摘錄\n\n當他第一次接觸到比特幣時）我認爲它非常聰明。但很多\n好的想法都會消失。比特幣一直在不斷增長，不僅是在\n價格。\n\n用美元衡量比特幣，有點違背了比特幣的意義。(1 BTC =\n1...",
      "title": "薩爾瓦多總統對比特幣的掌握比99%的比特幣人都要好"
    }
  ]
}