{
  "author": "ArkGuardian",
  "original_created_utc": 1656192814,
  "title": "Why did \"Platinum\" become the precious metal to represent surpassing Gold as opposed to other rare metals?",
  "created_utc": 1656224198,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Platinum is used in pop culture today with &amp;quot;Platinum Records&amp;quot; and the &amp;quot;Platinum Jubilee&amp;quot; to indicate a status above gold. But as far as I know platinum was not highly valued before the Industrial age and there are other metals such as palladium whose per weight value is more significant. Why did platinum become so entrenched in common culture that people automatically associate it above gold when that isn&amp;#39;t reflective of it&amp;#39;s true value?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/vkozvh/why_did_platinum_become_the_precious_metal_to/",
  "subreddit": "AskHistorians",
  "id": "vkozvh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Platinum is used in pop culture today with \"Platinum Records\" and the \"Platinum\nJubilee\" to indicate a status above gold. But as far as I know platinum was not\nhighly valued before the Industrial age and there are other metals such as\npalladium whose per weight value is more significant. Why did…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プラチナは、今日のポップカルチャーでは「プラチナ・レコード」や「プラチナ・ジュビリー」など、ゴールドより上の地位を示す言葉として使われています。\nプラチナムレコード」「プラチナムジュビリー」など、ゴールドより上のステータスを示す言葉として使われています。しかし、私の知る限り、プラチナは工業化時代以前にはあまり評価されていませんでした。\nしかし、私の知る限り、工業化時代以前はプラチナの価値は高くなく、重量あたりの価値がより高いパラジウムなどの金属があります。\nパラジウムなど、重量あたりの価値がもっと高い金属がある。なぜ...",
      "title": "なぜ「プラチナ」は、他のレアメタルとは異なり、「金」を超える代表的な貴金属になったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "铂金在今天的流行文化中被用于 \"铂金唱片 \"和 \"铂金庆典\"，表示高于黄金的地位。\nJubilee \"来表示高于黄金的地位。但据我所知，铂金并不是\n但据我所知，在工业时代之前，铂金的价值并不高，而且还有其他金属，如\n钯等其他金属，其单位重量的价值更为重要。为什么...",
      "title": "为什么 \"铂金 \"会成为超越黄金的贵金属，而不是其他稀有金属？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鉑金在今天的流行文化中被用於 \"鉑金唱片 \"和 \"鉑金慶典\"，表示高於黃金的地位。\nJubilee \"來表示高於黃金的地位。但據我所知，鉑金並不是\n但據我所知，在工業時代之前，鉑金的價值並不高，而且還有其他金屬，如\n鈀等其他金屬，其單位重量的價值更爲重要。爲什麼...",
      "title": "爲什麼 \"鉑金 \"會成爲超越黃金的貴金屬，而不是其他稀有金屬？"
    }
  ]
}