{
  "author": "ErZicky",
  "original_created_utc": 1628065398,
  "title": "A month ago my first app comes out, this is my experience so far",
  "created_utc": 1628077045,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone</p>\n\n<p>Almost a month ago I released my first android app: <a href=\"https://play.google.com/store/apps/details?id=com.notes.MindPack&amp;hl=en\">MindBook</a></p>\n\n<p>And I thought I&#39;d share my experience with you.</p>\n\n<p>On 1 July 2021 at 13:47 MindBook comes out on the playstore, I had started developing this app for a university exam (I study computer science) with which I managed to get a good grade, but I continued to work on it in my free time even after the exam (to the point that today&#39;s app only shares the name with the one given to my professor)</p>\n\n<p>The beginning was not the best, being my first experience I did not have (and still I&#39;m not sure I understand) the concepts of SEO and keywords optimization so I got very few visits to my page from the playstore, so I decide to start an advertising campaign with google ads for a week with a daily budget of € 2.50, I got a hundred downloads in this way and in the meantime I start working on a couple of updates.</p>\n\n<p>I tried to contact about fifty sites that deal with android applications to get a quote / review of the app in one of their posts, many responded by declaring to be available for an article in exchange from 100€ to 200€ (with one of them asking around 800€), but being my budget almost 0 I am forced to refuse.</p>\n\n<p>In the meantime, comes out what in my opinion is the most important update: it added a safety pin and allows you to insert voice notes of unlimited length, and I think that above all the safety pin has proved to be an indispensable feature since shortly after the update downloads increased.</p>\n\n<p>Desperate for downloads (considering that the posts on reddit turned out to be less profitable than expected) I turn my attention to Quora, I started answering a lot of questions in both English and my native language (I think I answered 200 / 300 questions) trying to answer each time in a relevant, honest and unobtrusive way.</p>\n\n<p>Quora will prove to be the major download source.</p>\n\n<p>At this point a friend of mine with about 4k followers on instagram offers to make an instagram story to help me, at first I refuse because I didn&#39;t want to look like the profiteer friend but in the end I give in and his story generates a peak of about 115 downloads.</p>\n\n<p>Unfortunately, Google detects this sudden spike in users as bot traffic and decides to limit my admob account (which is still limited)</p>\n\n<p>It is in this period (around July 13) that after having informed myself well about keywords and SEO I make changes to the playstore page (and I create both a simple landing page and a <a href=\"https://www.youtube.com/watch?v=GTUDWk5QVUQ\">demo video</a>), it turns out to be a good move and I notice a decisive increase in store visits (with a disappointing rate of conversions unfortunately) and it is also here that I realize how long the revision times of the changes and updates to the playstore page are, considering that the changes were only published on July 18 along with an update that allows you to change fonts among other things.</p>\n\n<p>Given my bad luck with review sites, I tried to write to youtubers specifying that I am not able to pay them, I think I wrote to 20 of them avoiding the big names knowing that they would never consider me, a couple of those contacted replied by saying that they will consider the app for a quote in their videos (it hasn&#39;t happened yet but it&#39;s still early).</p>\n\n<p>At this point (we are around July 21st) I have obtained about 300 downloads and my ordeal with mopub begins (to which I decide to switch in place of admob) to approve my profile, although I have performed all the steps correctly it will take about ten emails (and as many screenshots) and just over 2 weeks to get approval.</p>\n\n<p>From here on, nothing noteworthy happens anymore, I keep writing answers on quora and every now and then I still try to write to some smaller site in the hope of being able to get something with my small budget (still unsuccessful).</p>\n\n<p>And we come to today.</p>\n\n<p>My app has so far gotten 415 downloads and yielded just over 1 € (I know I&#39;m still deciding how to spend all this money ahaha) and we are probably approaching the final stages of my app since in the last few days I get only 2 / 3 downloads per day.</p>\n\n<p>Despite the relative few downloads I am proud of myself and satisfied with how I am doing, my only real regret is not being able to get a decent number of reviews (only 6 in various languages) I tried to add a &quot;rate this app&quot; button in the options but it doesn&#39;t seem to have had any results, I was pondering whether to use one of those sites where developers exchange reviews but don&#39;t seem very useful and well regarded.</p>\n\n<p>In conclusion this has been my experience, I thank those of you who have decided to take a few minutes to read this post and I hope to bring more good news in the future.</p>\n\n<p>For those wishing to try the app <a href=\"https://play.google.com/store/apps/details?id=com.notes.MindPack&amp;hl=en\">this is the link</a></p>\n</div><!-- SC_ON -->",
  "score": 11,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Fbq35WvUbB9awftbp97PPcrsgtuEyZcwoJtvmVqR2sw.jpg?auto=webp&s=5f365476a11503b76c9fcd1f6e8434ef840f122c",
          "width": 512,
          "height": 250
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Fbq35WvUbB9awftbp97PPcrsgtuEyZcwoJtvmVqR2sw.jpg?width=108&crop=smart&auto=webp&s=4336a82826f7034ce1caf5d49997acec99df1ca2",
            "width": 108,
            "height": 52
          },
          {
            "url": "https://external-preview.redd.it/Fbq35WvUbB9awftbp97PPcrsgtuEyZcwoJtvmVqR2sw.jpg?width=216&crop=smart&auto=webp&s=d9aa2f14b281bfb28d1e1daa01ef957aec72c4e0",
            "width": 216,
            "height": 105
          },
          {
            "url": "https://external-preview.redd.it/Fbq35WvUbB9awftbp97PPcrsgtuEyZcwoJtvmVqR2sw.jpg?width=320&crop=smart&auto=webp&s=4b94b6204d5f38477bd2466842eb41db4762b60e",
            "width": 320,
            "height": 156
          }
        ],
        "variants": {},
        "id": "seMaUUZ3MJkiyd23skcFQftVp0xYh-3jQWZLOB0zYvM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/oxo5no/a_month_ago_my_first_app_comes_out_this_is_my/",
  "subreddit": "SideProject",
  "id": "oxo5no",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone\n\nAlmost a month ago I released my first android app: MindBook\n[https://play.google.com/store/apps/details?id=com.notes.MindPack&hl=en]\n\nAnd I thought I'd share my experience with you.\n\nOn 1 July 2021 at 13:47 MindBook comes out on the playstore, I had started\ndeveloping this app for a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n約1ヶ月前、私は初めてのアンドロイドアプリをリリースしました。マインドブック\n[https://play.google.com/store/apps/details?id=com.notes.MindPack&hl=en]をリリースしました。\n\nそして、私の経験を皆さんと共有しようと思いました。\n\n2021年7月1日13:47にMindBookがplaystoreに公開されましたが、私はこのアプリの開発を始めていました。\nこのアプリの開発を始めたのは...",
      "title": "1ヶ月前に初めてのアプリが発売されましたが、これまでの私の経験を紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n差不多一个月前，我发布了我的第一个安卓应用。心灵书\n[https://play.google.com/store/apps/details?id=com.notes.MindPack&hl=en]\n\n我想我应该和大家分享我的经验。\n\n在2021年7月1日13:47，MindBook在playstore上发布了。\n我已经开始开发这个应用程序。",
      "title": "一个月前，我的第一个应用程序出来了，这是我到目前为止的经验。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n差不多一個月前，我發佈了我的第一個安卓應用。心靈書\n[https://play.google.com/store/apps/details?id=com.notes.MindPack&hl=en]\n\n我想我應該和大家分享我的經驗。\n\n在2021年7月1日13:47，MindBook在playstore上發佈了。\n我已經開始開發這個應用程序。",
      "title": "一個月前，我的第一個應用程序出來了，這是我到目前爲止的經驗。"
    }
  ]
}