{
  "author": "flanman1991",
  "original_created_utc": 1631296739,
  "title": "Are there any biological differences between Male and Female hair?",
  "created_utc": 1631315205,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was curious if mens hair has a different make-up over womens hair? If you were to view the hair at a DNA level, would you be able to identify the sex of the person it came from?</p>\n\n<p>The reason I ask is because in general, women have longer hair styles and men usually shorter. Is this 100% cultural? And only happens because we are used to these hair styles as the &quot;norms&quot;? Or is there some deeper biology going on that makes humans lean towards certain hairstyles without their knowledge?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askscience/comments/plq6ib/are_there_any_biological_differences_between_male/",
  "subreddit": "askscience",
  "id": "plq6ib",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was curious if mens hair has a different make-up over womens hair? If you were\nto view the hair at a DNA level, would you be able to identify the sex of the\nperson it came from?\n\nThe reason I ask is because in general, women have longer hair styles and men\nusually shorter. Is this 100% cultural?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "気になったのは、男性の髪の毛は女性の髪の毛とはメイクが違うのか？もし、DNAレベルで\n髪の毛をDNAレベルで見た場合、その髪の毛の出身者の性別を特定することができるのでしょうか？\n識別できるのでしょうか？\n\nなぜこのような質問をしたかというと、一般的に女性は長い髪型をしていて、男性は短い髪型をしています。\n一般的に女性は長い髪型で、男性は短い髪型です。これは100％文化的なものなのでしょうか...。",
      "title": "男性の髪と女性の髪には、生物学的な違いがあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很好奇，男性的头发是否与女性的头发有不同的化妆效果？如果你\n在DNA水平上查看头发，你是否能够识别其性别？\n人的性别？\n\n我问这个问题的原因是，一般来说，女性的头发较长，男性的头发较短。\n通常较短。这是100%的文化因素吗？",
      "title": "男性和女性的头发是否有任何生理差异？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很好奇，男性的頭髮是否與女性的頭髮有不同的化妝效果？如果你\n在DNA水平上查看頭髮，你是否能夠識別其性別？\n人的性別？\n\n我問這個問題的原因是，一般來說，女性的頭髮較長，男性的頭髮較短。\n通常較短。這是100%的文化因素嗎？",
      "title": "男性和女性的頭髮是否有任何生理差異？"
    }
  ]
}