{
  "author": "Jaxsoy",
  "original_created_utc": 1635979522,
  "title": "Exchanges need to start listing Bitcoin in Satoshis instead",
  "created_utc": 1636030041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unit bias is real, and even though the amount you own will be the exact same, it will heavily encourage new users to buy Bitcoin because they will see it as cheap and not be intimidated. I gotta admit, even though I know it doesn’t make a difference, I had a lot more fun buying 50 million Dogelon Mars coins for $120 (currently down 30% on that lmao) than I did buying 0.002 BTC for that same amount. Hell, you have to now spend over $6k just to get 0.1 BTC. I don’t see how anyone new to the space would not find that intimidating. However, for $120 you can get almost 200k Satoshis. For $6k you can get over 9.5 million. That seems very cheap to me still, and it would definitely be more appealing to someone who’s just now getting into crypto.</p>\n</div><!-- SC_ON -->",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/qm6dtd/exchanges_need_to_start_listing_bitcoin_in/",
  "subreddit": "CryptoCurrency",
  "id": "qm6dtd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unit bias is real, and even though the amount you own will be the exact same, it\nwill heavily encourage new users to buy Bitcoin because they will see it as\ncheap and not be intimidated. I gotta admit, even though I know it doesn’t make\na difference, I had a lot more fun buying 50 million Dogelon…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ユニットバイアスは現実にあり、所有している量は全く同じになるにも関わらず\n新しいユーザーがビットコインを購入するのを大きく後押しします。なぜなら、ビットコインが安いと見て、怖くないからです。\nビットコインの購入を促します。認めなければならないのは、違いがないとわかっていても\n認めざるを得ませんが、5000万ドゲロンを買った方がずっと楽しかったです...。",
      "title": "取引所はビットコインをサトシで上場する必要がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "单位偏差是真实存在的，即使你拥有的数量完全相同，但它会严重影响你的工作。\n这将极大地鼓励新用户购买比特币，因为他们会认为比特币很便宜。\n廉价，不会被吓到。我得承认，尽管我知道这没有什么区别\n我不得不承认，尽管我知道这没有什么区别，但我买5000万个Dogelon更有乐趣...",
      "title": "交易所需要开始将比特币以沙特币的形式上市，而不是以沙特币的形式。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "單位偏差是真實存在的，即使你擁有的數量完全相同，但它會嚴重影響你的工作。\n這將極大地鼓勵新用戶購買比特幣，因爲他們會認爲比特幣很便宜。\n廉價，不會被嚇到。我得承認，儘管我知道這沒有什麼區別\n我不得不承認，儘管我知道這沒有什麼區別，但我買5000萬個Dogelon更有樂趣...",
      "title": "交易所需要開始將比特幣以沙特幣的形式上市，而不是以沙特幣的形式。"
    }
  ]
}