{
  "author": "veggie-man",
  "the_new_excerpt": "VST has a $11.1B market cap which finished a historic week, very possibly\ngenerating some $2-4 billion on surge pricing as it was seemingly the only Texas\nutility to take winterization seriously with nearly all of their generation\nproducing electricity through last week…",
  "original_created_utc": 1613841159,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "VST的市值为110亿美元，本周完成了历史性的一周，很有可\n在激增定价上产生了约20-40亿美元的收入，因为它似乎是唯一的德克萨斯州。\n公用事业认真对待过冬问题，几乎所有的发电量都是如此\n上周的发电量...",
      "title": "威斯特拉公司（VST）。德州认真对待过冬的公用事业"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "VST的市值爲110億美元，本週完成了歷史性的一週，很有可\n在激增定價上產生了約20-40億美元的收入，因爲它似乎是唯一的德克薩斯州。\n公用事業認真對待過冬問題，幾乎所有的發電量都是如此\n上週的發電量...",
      "title": "威斯特拉公司（VST）。德州認真對待過冬的公用事業"
    }
  ],
  "title": "Vistra Corp (VST): Texas Utility that took Winterization Seriously",
  "created_utc": 1613883130,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>VST has a $11.1B market cap which finished a historic week, very possibly generating some $2-4 billion on surge pricing as it was seemingly the only Texas utility to take winterization seriously with nearly all of their generation producing electricity through last week (<a href=\"https://investor.vistracorp.com/investor-relations/news/press-release-details/2021/Vistras-Effort-to-Powering-Texas-During-Unprecedented-Winter-Storm/default.aspx\">Link</a> ).</p>\n\n<p>Vistra Corp is an energy generation company with a portfolio of natural gas, nuclear, coal, solar, and battery energy storage. Most of their portfolio is low and no carbon emission generation, and moving in that direction long term.</p>\n\n<p>As a company, they continue to trade at undervalued prices. Regulated utilities trade at a 20.5 PE (IPP’s trade at 65.5), while VST trades at 12.8 PE. <strong>If VST traded in line with regulated utilities, it would trade at $36.69</strong> (IPP’s at $117).</p>\n\n<p>This is all before the moonshot quarter, before forwards have increased, before all of these REP’s go on liquidation sale, and before the $1.5B share repurchase (started January 2021) has taken affect.</p>\n\n<p>As a company, VST has:</p>\n\n<ul>\n<li>4 years of YoY Revenue growth (over 100%)</li>\n<li>4 years of YoY Earnings growth (from -$250M to $1B+ TTM)</li>\n<li>4 years of YoY EPS growth</li>\n<li>Insider buying as recent as late December 2020 (right up to the blackout period)</li>\n<li>Pending IG rating in 2021, reducing costs of debt in 2021. This week their application got a whole lot better</li>\n<li>Way undervalued vs industry in nearly every valuation metric 18% FCF, 5.5 EV to EBITDA</li>\n<li>Average analyst rating of mid 30&#39;s</li>\n</ul>\n\n<p>The companies vision to transition to a zero carbon. Many talk about NextEra Energy as the only game in town. VST is far cheaper with a similar mission. Looking NEE’s energy breakdown by source (data from Sustainability&gt;Overview&gt;By the numbers on NEE website ), 58% of generation comes from Natural Gas +Nuclear vs 53% of VST. The difference is looking at the coal generation of 5% for NEE vs 20% EBITA for VST. If VST got rid of 15% of coal generated EBITA, and traded at NEE’s valuation, it would be $83 a share. Both NEE and VST have gas turbines that can be retrofit should hydrogen become economical. VST has the biggest battery in the world, VST is committing $500M+ in green investments annually.</p>\n\n<p>Q4 earnings are out on 2/26, so I’m looking forward to hearing the comments from last week.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/stocks/comments/loblud/vistra_corp_vst_texas_utility_that_took/",
  "subreddit": "stocks",
  "id": "loblud",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885066
}