{
  "author": "astockstonk",
  "the_new_excerpt": "KEY POINTS Amazon released first-quarter results on Thursday that trounced\nanalysts’ expectations.\n\nAmazon shares climbed as much as 5% in extended trading Thursday after the\ncompany released its first-quarter earnings, beating Wall Street’s expectations\nfor earnings and revenue.\n\nHere’s how the e…",
  "original_created_utc": 1619726859,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "キーポイント アマゾンは木曜日に、アナリストの予想を上回る第1四半期の業績を発表しました。\nアナリストの予想を上回りました。\n\n第1四半期の業績がウォール街の予想を上回ったことを受けて、アマゾンの株価は木曜日の延長戦で5％も上昇しました。\n第1四半期の業績が発表され、ウォールストリートの予想を上回りました。\nの予想を上回りました。\n\nここでは、アマゾンの第1四半期の業績がどのように変化したかをご紹介します。",
      "title": "アマゾン、業績予想を大幅に上回る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关键点 亚马逊周四发布的第一季度业绩超过了\n分析师的预期。\n\n亚马逊股价在周四的延长交易中攀升至5%，此前该公司发布的第一季度财报\n该公司发布了第一季度财报，超过了华尔街的预期。\n盈利和收入。\n\n以下是该公司的盈利情况...",
      "title": "亚马逊粉碎了盈利预期"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關鍵點 亞馬遜週四發佈的第一季度業績超過了\n分析師的預期。\n\n亞馬遜股價在週四的延長交易中攀升至5%，此前該公司發佈的第一季度財報\n該公司發佈了第一季度財報，超過了華爾街的預期。\n盈利和收入。\n\n以下是該公司的盈利情況...",
      "title": "亞馬遜粉碎了盈利預期"
    }
  ],
  "title": "Amazon Smashed Earnings Expectations",
  "created_utc": 1619730917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>KEY POINTS\nAmazon released first-quarter results on Thursday that trounced analysts’ expectations.</p>\n\n<p>Amazon shares climbed as much as 5% in extended trading Thursday after the company released its first-quarter earnings, beating Wall Street’s expectations for earnings and revenue. </p>\n\n<p>Here’s how the e-commerce giant fared, relative to analyst estimates compiled by Refinitiv:</p>\n\n<p>Earnings: $15.79 per share vs. $9.54 per share expected\nRevenue: $108.52 billion vs. $104.47 billion expected</p>\n\n<p>Few companies have benefited from the pandemic-fueled surge of online shopping as much as Amazon. The company notched record profits and revenue last year, while CEO Jeff Bezos announced earlier this month that Amazon crossed more than 200 million Prime subscribers, up from 150 million at the start of 2020.</p>\n\n<p>In 2020, Amazon invested heavily on coronavirus-related measures like safety protocols and wage increases for front-line workers. As a result of these costs, Amazon last quarter forecast operating income of $3 billion to $6.5 billion in the current period. Those coronavirus-related costs are expected to slow this year, although on Wednesday, Amazon said it would spent more than $1 billion on pay raises for more than half a million of its U.S. operations workers.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/04/29/amazon-amzn-earnings-q1-2021.html\">https://www.cnbc.com/2021/04/29/amazon-amzn-earnings-q1-2021.html</a></p>\n</div><!-- SC_ON -->",
  "score": 1356,
  "permalink": "/r/stocks/comments/n1czad/amazon_smashed_earnings_expectations/",
  "subreddit": "stocks",
  "id": "n1czad",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966997
}