{
  "author": "njozz",
  "original_created_utc": 1654370214,
  "title": "The longer I'm in crypto, the more I lean toward Bitcoin Maximalism",
  "created_utc": 1654398557,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Only been in crypto for two years. At first I invested in all sorts of coins and slowly, as I spent more time researching and learning, began to narrow it down. But the one I keep coming back to, and the one in which my conviction continues to strengthen, is BTC. It keeps weathering storms and coming back, and it&amp;#39;s the most truly decentralized coin I know. &lt;/p&gt;\n\n&lt;p&gt;All the recent stuff with LUNA has also swayed me toward BTC.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I will ever be a pure 100% BTC maxi. I invest in BTC, ETH, and the Cosmos ecosystem, but the percentage of BTC in my portfolio continues to grow (about 75% now), and it&amp;#39;s the one I feel most secure investing in.&lt;/p&gt;\n\n&lt;p&gt;I know I may lose out on some coins that go to the moon far more quickly, but I&amp;#39;ll also miss out on the many more coins that promise the moon yet hardly make it off the launching pad.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 370,
  "permalink": "/r/CryptoCurrency/comments/v4vxwo/the_longer_im_in_crypto_the_more_i_lean_toward/",
  "subreddit": "CryptoCurrency",
  "id": "v4vxwo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Only been in crypto for two years. At first I invested in all sorts of coins and\nslowly, as I spent more time researching and learning, began to narrow it down.\nBut the one I keep coming back to, and the one in which my conviction continues\nto strengthen, is BTC. It keeps weathering storms and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリプト歴はまだ2年 最初はあらゆる種類のコインに投資していました。\n徐々に、リサーチと学習に時間を費やすうちに、コインを絞り込み始めました。\nしかし、私が何度も戻ってきて、確信を深め続けているのは、BTCです。\nBTCです。嵐を乗り越え続け、...",
      "title": "暗号の世界に長くいればいるほど、ビットコイン最大主義に傾く"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只做了两年的加密货币。起初，我投资于各种硬币，随着我花更多时间研究和学习，慢慢地开始缩小范围。\n慢慢地，随着我花更多时间研究和学习，开始缩小范围。\n但是，我一直在回想，而且我的信念也在不断增强。\n的，是BTC。它不断地经受着风暴的洗礼，并在不断地发展。",
      "title": "我在加密货币领域的时间越长，我就越倾向于比特币最大化主义"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只做了兩年的加密貨幣。起初，我投資於各種硬幣，隨着我花更多時間研究和學習，慢慢地開始縮小範圍。\n慢慢地，隨着我花更多時間研究和學習，開始縮小範圍。\n但是，我一直在回想，而且我的信念也在不斷增強。\n的，是BTC。它不斷地經受着風暴的洗禮，並在不斷地發展。",
      "title": "我在加密貨幣領域的時間越長，我就越傾向於比特幣最大化主義"
    }
  ]
}