{
  "author": "AvidasOfficial",
  "the_new_excerpt": "Sorry if this seems like a silly post but I am absolutely blown away that my\ncomments and posts on this subreddit are paying my bills.\n\nI tried to explain this to my parents and a couple of friends but they couldn't\nget their head around it, they still think I'm some crazy bitcoin investor who\nis…",
  "original_created_utc": 1614291594,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，如果这看起来像一个愚蠢的帖子，但我绝对吹走，我的。\n评论和帖子在这个subreddit上是支付我的账单。\n\n我试图向我的父母和几个朋友解释这个问题，但他们不能\n但他们还是认为我是个疯狂的比特币投资者\n是...",
      "title": "红楼梦已经连续两个月为我支付账单了。我真的不敢相信网络追忆能支付生活费!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，如果這看起來像一個愚蠢的帖子，但我絕對吹走，我的。\n評論和帖子在這個subreddit上是支付我的賬單。\n\n我試圖向我的父母和幾個朋友解釋這個問題，但他們不能\n但他們還是認爲我是個瘋狂的比特幣投資者\n是...",
      "title": "紅樓夢已經連續兩個月爲我支付賬單了。我真的不敢相信網絡追憶能支付生活費!"
    }
  ],
  "title": "Reddit Moons have paid for my bills two months in a row now. I literally cannot believe Internet memes are covering living costs!",
  "created_utc": 1614314142,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if this seems like a silly post but I am absolutely blown away that my comments and posts on this subreddit are paying my bills. </p>\n\n<p>I tried to explain this to my parents and a couple of friends but they couldn&#39;t get their head around it, they still think I&#39;m some crazy bitcoin investor who is gambling his money like a mad man.</p>\n\n<p>The whole reddit moon concept is genius and I am truly impressed at how the community has handled it so far especially with the ability to vote on key issues and how they are distributed.</p>\n\n<p>I guess all I can say is thank you and I hope they are all helping you as much as they are me!</p>\n\n<p>Edit - people have asked what moons are so I have copied and pasted a summary i wrote a while back as a reply in the comments</p>\n</div><!-- SC_ON -->",
  "score": 851,
  "permalink": "/r/CryptoCurrency/comments/lsijro/reddit_moons_have_paid_for_my_bills_two_months_in/",
  "subreddit": "CryptoCurrency",
  "id": "lsijro",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937735121
}