{
  "author": "itstanaka",
  "original_created_utc": 1636452855,
  "title": "It is heartbreaking to know a coin is going to pump but you cannot afford to invest",
  "created_utc": 1636468555,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone.</p>\n\n<p>Today I am here to talk about a issue that I know it probably concerns a lot of us.</p>\n\n<p>I am myself a part-time worker and college student and I&#39;ve gotten into crypto basically two years ago. This experience has allowed me to gain knowledge on various crypto projects, some of which worked out well and others which unfortunately went wrong.</p>\n\n<p>So from my perspective, I make every month basically enough to only get by - with rent, housing expenses, college fees and everything I pretty much have no disposable income to invest in crypto. This leads me to a very hard situation, in which I some times forsee that some projects are likely to give me a good financial return, but I cannot afford to invest n them. Seeing them pump in the future simply takes a toll on my happiness, as I know that hypothetical income would mean the world to me. Investing in projects that don&#39;t work out would also mean that I would have to eat ramen everyday for the entirety of the month. </p>\n\n<p>Do any of you face the same issue? How do you personally handle it?</p>\n\n<p>Thank you to those who read all of it :)</p>\n</div><!-- SC_ON -->",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/qq0mso/it_is_heartbreaking_to_know_a_coin_is_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "qq0mso",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone.\n\nToday I am here to talk about a issue that I know it probably concerns a lot of\nus.\n\nI am myself a part-time worker and college student and I've gotten into crypto\nbasically two years ago. This experience has allowed me to gain knowledge on\nvarious crypto projects, some of which…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n今日は、おそらく多くの人が関心を持っているであろう問題についてお話します。\nのです。\n\n私はアルバイトと大学生をしていますが、暗号の世界に入ったのは2年前です。\n基本的には2年前からです。この経験により、さまざまな暗号プロジェクトに関する知識を得ることができました。\n様々な暗号プロジェクトについての知識を得ることができましたが、中には...",
      "title": "コインがポンピングされるとわかっていても、投資する余裕がないのは心が痛みます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n今天我在这里谈一个问题，我知道它可能关系到我们很多人。\n我们。\n\n我自己是一个兼职工人和大学生，我已经进入了加密货币\n基本上是两年前。这段经历让我获得了关于\n各种加密项目的知识，其中一些...",
      "title": "知道一个硬币将被抽走，但你却没有能力投资，这是令人心碎的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n今天我在這裏談一個問題，我知道它可能關係到我們很多人。\n我們。\n\n我自己是一個兼職工人和大學生，我已經進入了加密貨幣\n基本上是兩年前。這段經歷讓我獲得了關於\n各種加密項目的知識，其中一些...",
      "title": "知道一個硬幣將被抽走，但你卻沒有能力投資，這是令人心碎的。"
    }
  ]
}