{
  "author": "LordCommanderBlack",
  "original_created_utc": 1632156982,
  "title": "I'm a traveler in ad1200 going from Lübeck across the HRE to Rome on secular business; Do I travel alone or in a group? Do we camp every night in the woods or am I in a Tavern/Inn every night?",
  "created_utc": 1632167987,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m curious on how a secular traveler; not a pilgrim which had some protections; would take on a journey of several hundred miles.</p>\n\n<p>I&#39;m as close to middle class as existed, not a serf but not a noble. Just a well of peasant-merchant.</p>\n\n<p>Do I go &quot;Gandalf-style&quot;? A pony, a small cart of supplies but alone?</p>\n\n<p>Do I team up with fellow travelers like a wagon train of the American West? Not really related in kinship or business but together for protection?</p>\n\n<p>Could I find Taverns/Inns every 15-20 miles I travel in a day and could I afford to stay there?</p>\n\n<p>Even though I&#39;m not a pilgrim, would monasteries house and feed me for a donation? Or were the beds prioritized for those on pilgrimage?</p>\n\n<p>Really, what was the nature of long distance travel in the Holy Roman Empire in the 13th century?</p>\n\n<p><strong>also</strong> am I armed?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/pryw1n/im_a_traveler_in_ad1200_going_from_lübeck_across/",
  "subreddit": "AskHistorians",
  "id": "pryw1n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm curious on how a secular traveler; not a pilgrim which had some protections;\nwould take on a journey of several hundred miles.\n\nI'm as close to middle class as existed, not a serf but not a noble. Just a well\nof peasant-merchant.\n\nDo I go \"Gandalf-style\"? A pony, a small cart of supplies but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "巡礼者ではなく、世俗的な旅行者がどのようにして数百マイルの旅をするのか興味があります。\n巡礼者ではなく、一般の旅行者がどのようにして数百マイルの旅をするのか興味があります。\n\n私は限りなく中流階級に近く、農奴でも貴族でもありません。ただ\n農民兼商人です。\n\nガンダルフ・スタイル」で行くか？ポニーと小さな荷車で物資を運んで...",
      "title": "私はad1200の旅行者で、リューベックからHREを越えてローマに行く世俗的な仕事をしています。私は一人で旅行するのか、それともグループで旅行するのか？毎晩、森の中でキャンプするのか、それとも毎晩、居酒屋や旅館に泊まるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很好奇，一个世俗的旅行者；而不是一个有一些保护措施的朝圣者。\n会进行几百英里的旅行。\n\n我是最接近中产阶级的人，不是农奴但也不是贵族。只是一个井\n的农民-商人。\n\n我是否要走 \"甘道夫式\"？一匹小马，一小车物资，但是......",
      "title": "我是一个乘坐ad1200的旅行者，要从吕贝克穿越HRE到罗马进行世俗的工作；我是独自旅行还是跟团旅行？我们每晚都在森林里露营，还是每晚都在小酒馆/旅馆？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很好奇，一個世俗的旅行者；而不是一個有一些保護措施的朝聖者。\n會進行幾百英里的旅行。\n\n我是最接近中產階級的人，不是農奴但也不是貴族。只是一個井\n的農民-商人。\n\n我是否要走 \"甘道夫式\"？一匹小馬，一小車物資，但是......",
      "title": "我是一個乘坐ad1200的旅行者，要從呂貝克穿越HRE到羅馬進行世俗的工作；我是獨自旅行還是跟團旅行？我們每晚都在森林裏露營，還是每晚都在小酒館/旅館？"
    }
  ]
}