{
  "author": "cathie_burry",
  "original_created_utc": 1628204886,
  "title": "My experience and insights as a blockchain developer in the DEFI world",
  "created_utc": 1628268273,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have come to realize that what people think is happening is very different from what is really happening. I’ll walk you through an over-simplified version of my development process. Then I’ll talk about other non-coding steps most people take</p>\n\n<p>_____ A Bit on Development: _____</p>\n\n<p>- Programming</p>\n\n<p>If launched on Ethereum or BSC, the token has been programmed in a language called &#39;Solidity.&#39; There are 6 core functions that any normal token should have, (google &#39;ERC20 standard&#39; to find these). This is where things like the name, symbol, supply, and transfer protocols are written. You can add custom functions as well depending on what you want the token to do, for example if you want to tax transactions.</p>\n\n<p>That code (the token) is uploaded to either etherscan or bscscan, who can verify the token/contract. Basically they make sure it is to par with basic security benchmarks. If the contract isn&#39;t verified, or the contract doesn&#39;t contain the 6 core functions, it is almost certainly a scam.</p>\n\n<p>When the token is finished with development, you move into a launch phase, and people use different strategies depending on how they want to launch. Typically you will see a few things:</p>\n\n<p>- Marketing the token</p>\n\n<p>The challenge most tokens face is anonymity. Because people now can make tokens without building a whole blockchain, the number of tokens has exploded to an enormous amount, and that number will keep growing. Consequently it is easier than ever for tokens to drown in their competition. To counter this, tokens began to promote harder, so instead of just putting up banners on poocoin, they began to hire people to schill as their day job. Ironically enough, this has recreated the issue they are trying to solve, because now there is so much schilling everywhere for so many different names, it is hard to make a difference.</p>\n\n<p>- Presale</p>\n\n<p>Many tokens now are using a &#39;presale,&#39; where people can buy into a token before it is launched. This helps generate liquidity to be added right on launch. I hate presales because they don&#39;t seem very &#39;crypto-esque&#39; to me, but generally speaking, if you get in early to successful token launch in the presale you can make good money flipping the token afterwards.</p>\n\n<p>- Launch</p>\n\n<p>After the presale, a most of the presale money is thrown into a liquidity pool where anybody can trade the token. Tokens typically spike in price after launch, and then dump and level out as people fight to get in first. After leveling out a true pump and dump can then take place.</p>\n\n<p>_____ A Few Observations: _____</p>\n\n<p>I&#39;ve never seen so many people who actually *have* money pretending to be dumb</p>\n\n<p>- The Teams</p>\n\n<p>The people releasing the token usually are backed by a group that has a lot of money. The token you bought in presale isn&#39;t the brainchild of some MIT neckbeard, it&#39;s a barely innovated meme that somebody with money paid somebody like me to write. The team then spends money to hire out people to post things like &#39;wen lambo&#39; from different accounts. They sometimes hire people from across the world for 2/hr to go &#39;shill&#39; the token to random people posting &#39;moooon.&#39;</p>\n\n<p>- Shillers</p>\n\n<p>Who are those people posting in telegram &#39;wen lambo&#39; every 12 seconds? They are probably hired by the developer or are the developers themselves. Because the culture is &#39;ape&#39; and &#39;autistic&#39; everybody is pretending to be those things. Don&#39;t get me wrong, there are some actual dumb people in the groups too, but most of those shills and gif posters are actually middle-aged men and developers who are pretending to be autistic because they know it can help pump and dump their coin. For all you know the guy who posted &#39;moon lambo 69xxx cocaine stripper&#39; is a multimillionaire hedge fund manager.</p>\n\n<p>_____ My Takeaways: _____</p>\n\n<p>- Popular Tokenomics</p>\n\n<p>Why do people think taxing every transaction is such a good idea? Ever since SAFEMOON all that everybody wants anymore is to have tokens with transactional taxes. Sure, it makes it so that people are less likely to trade as much, but that DEFEATS THE PURPOSE of cryptocurrency. Currency is definitionally something that is trade for other things. Any cryptocurrency that implements a tax on trading won&#39;t be a successful project 5-10 years from now. People aren&#39;t going to use a currency long-term where 10% of everything they spend goes to charity and the developers. The taxes may allow for bigger pumps and dumps, which is what everybody really wants anyway these days.</p>\n\n<p>TL/DR: You definitely can make money on the pump and dumps, and I know lots of people who have. Just please, treat it as such. Watch out for those high-tax coins, those are ridiculous, and there are so many scams it’s unreal. If you want to gamble your money on some DEFI project a developer pulled out of his urethra for a shot at 100x, great. Just realize that it is a high-stakes gamble.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/oyu6g2/my_experience_and_insights_as_a_blockchain/",
  "subreddit": "CryptoCurrency",
  "id": "oyu6g2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have come to realize that what people think is happening is very different\nfrom what is really happening. I’ll walk you through an over-simplified version\nof my development process. Then I’ll talk about other non-coding steps most\npeople take\n\n_____ A Bit on Development: _____\n\n- Programming\n\nIf…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人が思っていることと、実際に起こっていることは全く違うということがわかってきました。\n人が思っていることと、実際に起こっていることは全く違うということを実感しました。ここでは、私の開発した製品を簡単に説明します。\n私の開発プロセスをご紹介します。そして、多くの人が行っているコーディング以外のステップについてもお話します。\nしています。\n\n_____ 開発について少し説明します。_____\n\n- プログラミング\n\nもしも...",
      "title": "DEFIの世界でのブロックチェーン開発者としての経験と見識"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经意识到，人们认为发生的事情与真正发生的事情有很大的不同。\n与真正发生的事情大相径庭。我将通过一个过于简化的版本向你介绍\n我的开发过程。然后，我将谈谈其他非编码步骤。\n人采取的其他非编码步骤\n\n_____ 关于开发的一点。_____\n\n- 编程\n\n如果...",
      "title": "我作为DEFI世界的区块链开发者的经验和见解"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經意識到，人們認爲發生的事情與真正發生的事情有很大的不同。\n與真正發生的事情大相徑庭。我將通過一個過於簡化的版本向你介紹\n我的開發過程。然後，我將談談其他非編碼步驟。\n人採取的其他非編碼步驟\n\n_____ 關於開發的一點。_____\n\n- 編程\n\n如果...",
      "title": "我作爲DEFI世界的區塊鏈開發者的經驗和見解"
    }
  ]
}