{
  "author": "striped_sweater12",
  "original_created_utc": 1657371886,
  "title": "\"I calculated how much a coin would be worth from a 1K investment now if it ever reaches back to its all time high.\" BAD IDEA!",
  "created_utc": 1657385154,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know this sub can be passionate about alt-coin projects. Please read and consider before commenting or downvoting.&lt;/p&gt;\n\n&lt;p&gt;This is a response to &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/vrcb1h/i_calculated_how_much_a_coin_would_be_worth_from/\"&gt;this post&lt;/a&gt; that got a lot of attention recently.&lt;/p&gt;\n\n&lt;p&gt;I get it. Alt-coins are enticing. But the above post is very dangerous. People who read the above post seem to erroneously assume that all of those alt coins will eventually come back to its ATH. Because crypto always comes back, right? This leads readers to conclude that they should put money in the alt-coin that has fallen the most percentage-wise for the highest gains when the ATH comes back. This is NOT analysis. This is a fun, fantastical thought experiment. None of this logic is based in reality, I&amp;#39;ll do my best to explain.&lt;/p&gt;\n\n&lt;p&gt;Let me start with this statement that should be the whole takeaway of this post: *&lt;strong&gt;NO MAINSTREAM ALT-COIN HAS EVER ACHIEVED ATH AGAINST BITCOIN IN TWO CONSECUTIVE CYCLES.&lt;/strong&gt; (*The only exception I know of is Dogecoin, and only because Elon pumped it. Hardly a sustainable model or basis for investment. So it&amp;#39;ll be ignored for this post.)&lt;/p&gt;\n\n&lt;p&gt;What this means is, every dollar you invest in crypto will be better going to Bitcoin than any other coin. I know a lot of people love their alt-coin projects that they are passionate about. I love crypto and want to see it succeed. But please look at the price history of alt-coins. They all fail against bitcoin in the long run. I&amp;#39;m not trying to crap on any alt-coin project you are passionate about, it very well &lt;em&gt;may&lt;/em&gt; succeed and be the next bitcoin. All I&amp;#39;m saying is let&amp;#39;s look at how well this bet has performed in the past.&lt;/p&gt;\n\n&lt;p&gt;Pretty much every alt-coin price history looks something like this:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/2p967fpnija91.png?width=1890&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=02d96d6103f84cf9cae4abfb4670e91b8156fea1\"&gt;https://preview.redd.it/2p967fpnija91.png?width=1890&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=02d96d6103f84cf9cae4abfb4670e91b8156fea1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s FTM. A decent project that was promoted by many. Such is the alt-coin life cycle. There&amp;#39;s a price discovery in a bull run, temporary euphoria (this is where most of us buy in, near the ATH), and then death. Doesn&amp;#39;t recover from that. Go look for yourself! Look up any alt-coin price history and it&amp;#39;ll look pretty much like this. It would have been better to put that money in Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;But what if we just weather the bear market? Just like the above post in question, what if we buy more when it&amp;#39;s low and get XXX% return when it hits the ATH again! It&amp;#39;s a bigger return than even Bitcoin returning to its ATH! People I know did this same &amp;quot;what if it went back to ATH?&amp;quot; experiment back in 2019. We all put a decent amount of money into NANO, because we would 30x our money! Well, look what happened:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/7qcwew1pija91.png?width=1888&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=002daf610a4a3bfdb4112f4398111fdb7e795c8c\"&gt;https://preview.redd.it/7qcwew1pija91.png?width=1888&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=002daf610a4a3bfdb4112f4398111fdb7e795c8c&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Didn&amp;#39;t get close to its ATH. It would have been better to put that money in Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;But what about coins where it DOES hit another ATH? Some coins will do that, here&amp;#39;s ADA for example:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/e4k2odbqija91.png?width=1894&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=65ae3ba3c25bc1e76588c45f2a1cb4f533b45142\"&gt;https://preview.redd.it/e4k2odbqija91.png?width=1894&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=65ae3ba3c25bc1e76588c45f2a1cb4f533b45142&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It shattered it&amp;#39;s ATH! What a great one to hold! Actually, no. Look at it&amp;#39;s price against Bitcoin:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5by4lhuqija91.png?width=1880&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=dbebc656e9d64c18272326826a40649c294fc6db\"&gt;https://preview.redd.it/5by4lhuqija91.png?width=1880&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=dbebc656e9d64c18272326826a40649c294fc6db&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Even ADA, the &amp;quot;ETH-Killer&amp;quot; didn&amp;#39;t reach another ATH against bitcoin. It would have been better to put that money in Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;And here&amp;#39;s ETH:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/mb7hfvq8yja91.png?width=1874&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e62eb3387c24a0b8ce83bff3bccce66ea46314d1\"&gt;https://preview.redd.it/mb7hfvq8yja91.png?width=1874&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e62eb3387c24a0b8ce83bff3bccce66ea46314d1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Yes, ETH, like some alt-coins, retouched it&amp;#39;s USD ATH. But not against Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;For any dollar you put into a crypto that&amp;#39;s NOT bitcoin, you are making one of the worst bets in history. Far worse than casino odds. You are literally betting for something to happen that has pretty much never happened before. Yet people still put money in alt-coins! Even the &amp;quot;smart money&amp;quot; does. A 2019 study by Deloitte found that a simple buy and hold strategy of bitcoin outperformed every single crypto hedge fund. Embarrassing.&lt;/p&gt;\n\n&lt;p&gt;Another AWFUL bet is anything in the top 10! Every coin that entered the top 10 has lost value against BTC from then on. And when one leaves the top 10, it has never returned. (Again, except DOGE). If you own a coin in the top 10, or worse, continue owning it after it leaves the top 10, you are making one of the worst bets in history! It doesn&amp;#39;t matter how passionate you are about the community, or how much you just know/believe that the coin will be the next big thing. History shows you are most definitely wrong in this bet. Should put the money in Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;One case for alt-coins that lots of people make is the bitcoin dominance chart. Guy from Coin bureau likes to point this one out a lot. According to him, it has been &amp;quot;dropping like a rock&amp;quot; since 2017:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/rw8wnptrija91.png?width=2714&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e68b17a33b1b1a6c8341aac05cd7f3a2ee025d51\"&gt;https://preview.redd.it/rw8wnptrija91.png?width=2714&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e68b17a33b1b1a6c8341aac05cd7f3a2ee025d51&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So the future is alt-coins right? Bitcoin is clearly losing market share to alts, right? Actually, this metric tells the opposite. Consider the sheer number of coins now in existence, along with the insane growth of stablecoins. If all components of this metric remained constant over the past several years, then I would agree that the future seems to be alt-coins. However, in 2017 there were less than 1000 cryptocurrencies. Now there are over 20,000! And value in stablecoins has exploded. So now, there are 20x more alt-coins and over 100 billions dollars of stablecoins in the denominator of this metric competing for marketshare against bitcoin. To have all that be added to the denominator and BTC dominance still be so high is remarkable, and only proves that it will continue to be the most valuable chain for the foreseeable future. History shows any bet against bitcoin has been a bad one.&lt;/p&gt;\n\n&lt;p&gt;Lastly, if you simply MUST invest in an alt-coin for whatever reason, here&amp;#39;s my advice on how to do it.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Ignore any alt-coins that have already made the upside-down V pattern in the first visual. If that&amp;#39;s already happened anywhere in its price history, then ignore it.&lt;/li&gt;\n&lt;li&gt;Find a new alt-coin that has a sideways price pattern and was created during the current crypto winter.&lt;/li&gt;\n&lt;li&gt;Its value proposition must be something that hasn&amp;#39;t had a bubble yet. No BTC forks/clones. No NFTs or platform tokens. No DeFi or DEX coins. Something new, like maybe soul-bound tokens for this next rally? (Not a soul-bound token itself, because that can&amp;#39;t be sold, but a token for its infrastructure)&lt;/li&gt;\n&lt;li&gt;Sell it somewhere in the next bull run. Don&amp;#39;t get too greedy, take the profits and put them in Bitcoin.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I do not consider myself to be a Bitcoin Maxi. Too many people lose money in alt-coin projects. Too many newbies buy an alt-coin as their first coin. Yes, there is money to be made in alt-coins, but mostly by getting in and out at the right time, not through a buy and hold which is 1000x easier. Yes, there&amp;#39;s money to be made in some alts, but by and large it&amp;#39;s better for the money to be put in Bitcoin. If someone has more info to prove me wrong or teach me something, please do. But unless you can, please learn from the price history of alt-coins. Buy bitcoin, put it in cold storage, and wait. History *so far* has shown that to be the best thing.&lt;/p&gt;\n\n&lt;p&gt;tl;dr Price history of alt-coins against Bitcoin proves that holding alt-coins are always a bad investment.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 462,
  "permalink": "/r/CryptoCurrency/comments/vv1ape/i_calculated_how_much_a_coin_would_be_worth_from/",
  "subreddit": "CryptoCurrency",
  "id": "vv1ape",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know this sub can be passionate about alt-coin projects. Please read and\nconsider before commenting or downvoting.\n\nThis is a response to this post\n[https://www.reddit.com/r/CryptoCurrency/comments/vrcb1h/i_calculated_how_much_a_coin_would_be_worth_from/]\nthat got a lot of attention recently.\n\nI…"
}