{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "From my personal experience as a Facebook and Instagram user for over 10 years; the experience has become more and more mundane every year, exponentially. I see the same pattern among most of my peers; everyone posts less and less or nothing at all anymore. Whenever you engage and comment on a public post/page/group that you follow, Facebook will blast it to all of your friends' feeds including people on your friends who you really don't care for or barely know like a former co-worker or someone you met briefly at a networking event 5 years ago. Nobody wants to share that with everyone. This is why posting and engagement is vanishing. Instagram has a similar version of this idiotic setup where the scroll will show your friends content that you liked or commented on and highlight your profile name, so there goes engaging on a controversial post or simping on a fitness influencer (which is probably a huge driver of engagement on Instagram). The point is that the disregard for privacy is also a disregard for a good-quality user experience.  It actually discourages engagement. \n\nOn both facebook and Instagram, business profiles are ghost towns even if you waste some money on ads for *additional* exposure. This is exacerbated for small businesses which largely outnumber large businesses.\n\nWhile facebook may have replaced myspace, it never accommodated an adequate space for bands/musicians. The amount of engagement that can be created between artists and fans has completely been neglected and abandoned by the platform. \n\nThe facebook marketplace is an absolute frustration for both buyers and sellers. \n\nFacebook groups have become safe heavens for scammers because no matter how many times you report them and the nigerian admins pretending to be sweet old ladies from the midwest selling puppies, and facebook's automated reporting system will tell you that they found nothing wrong that violated the community guidelines. Meanwhile, actual sweet old ladies keep getting scammed and sending deposits for puppies that don't exist. It doesn't matter how many times you report the group or the fake profiles, facebook's automated system says it's all good. When the scammer's group finally gets too much heat or finally gets shut down, they simply start new fake profiles and a new group in an hour, and it's rinse and repeat all over again. \n\nFacebook Watch is nowhere near as practical as Youtube, and the algorithm pushes the most toxic content possible for the sake of clickbait and engagement. You start by watching a sports clip or a video of a cute dog posted by a page that you actually follow, and the algorithm will immediately start playing an infinite auto-scroll of car crashes, fights, burglaries, and other violent/toxic content. Comment on any of those videos posted by pages that you don't follow, and all your friends will see your outburst or your stance on a controversial topic. \n\nInstagram has completely abandoned its original purpose to become a hybrid of snapchat and tiktok. You can say that social media is ever-evolfing and fluid, but the most egregious aspect of this is that Instagram does not support content creators. Without content creators, there is no Instagram! Instead, Instagram rewards spammers and content thieves that lift popular content from original creators and compile it under soulless pages that the algorithm reward with all the exposure. Seriously, go into the explore tab and start scrolling through reels and take note of how many of those are from either content creators or content thieves. \n\nHave you seen the profile page for facebook on Instagram? This is how delusional the company is. It completely ignores and underrepresents the core of the facebook userbase. Do you think that most of the poeple that actually use facebook are the cool kind of people shown in that facebook profile on instagram? They are actually the kind of people that use facebook the least, if they even have a facebook profile.  \n\nWhen facebook started, it had a clear vision to connect college students. Expanding beyond college students was reasonable and welcomed, it made sense to grow beyond that, but where is it heading now? Where has it been heading for the past 7 years? It seems like it's way off course and without a direction, just drifting away. What's the point of trying to be a generic one-size-fits-all version of snapchat, tiktok, youtube, craigslist, tinder, instagram, discord, myspace, zoom, periscope, etc. \n\nIf the stock depends on ad revenue, if ad revenue depends on engagement, if engagement depends on user experience; how is ad revenue going to grow if the user experience is declining and management seems delusional about it?",
  "author_fullname": "t2_15b7cl",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Who is the target audience/client base of Meta?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "tickerdiscussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_wgze4p",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.78,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 47,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Discussion",
  "can_mod_post": false,
  "score": 47,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1659715866,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From my personal experience as a Facebook and Instagram user for over 10 years; the experience has become more and more mundane every year, exponentially. I see the same pattern among most of my peers; everyone posts less and less or nothing at all anymore. Whenever you engage and comment on a public post/page/group that you follow, Facebook will blast it to all of your friends&amp;#39; feeds including people on your friends who you really don&amp;#39;t care for or barely know like a former co-worker or someone you met briefly at a networking event 5 years ago. Nobody wants to share that with everyone. This is why posting and engagement is vanishing. Instagram has a similar version of this idiotic setup where the scroll will show your friends content that you liked or commented on and highlight your profile name, so there goes engaging on a controversial post or simping on a fitness influencer (which is probably a huge driver of engagement on Instagram). The point is that the disregard for privacy is also a disregard for a good-quality user experience.  It actually discourages engagement. &lt;/p&gt;\n\n&lt;p&gt;On both facebook and Instagram, business profiles are ghost towns even if you waste some money on ads for &lt;em&gt;additional&lt;/em&gt; exposure. This is exacerbated for small businesses which largely outnumber large businesses.&lt;/p&gt;\n\n&lt;p&gt;While facebook may have replaced myspace, it never accommodated an adequate space for bands/musicians. The amount of engagement that can be created between artists and fans has completely been neglected and abandoned by the platform. &lt;/p&gt;\n\n&lt;p&gt;The facebook marketplace is an absolute frustration for both buyers and sellers. &lt;/p&gt;\n\n&lt;p&gt;Facebook groups have become safe heavens for scammers because no matter how many times you report them and the nigerian admins pretending to be sweet old ladies from the midwest selling puppies, and facebook&amp;#39;s automated reporting system will tell you that they found nothing wrong that violated the community guidelines. Meanwhile, actual sweet old ladies keep getting scammed and sending deposits for puppies that don&amp;#39;t exist. It doesn&amp;#39;t matter how many times you report the group or the fake profiles, facebook&amp;#39;s automated system says it&amp;#39;s all good. When the scammer&amp;#39;s group finally gets too much heat or finally gets shut down, they simply start new fake profiles and a new group in an hour, and it&amp;#39;s rinse and repeat all over again. &lt;/p&gt;\n\n&lt;p&gt;Facebook Watch is nowhere near as practical as Youtube, and the algorithm pushes the most toxic content possible for the sake of clickbait and engagement. You start by watching a sports clip or a video of a cute dog posted by a page that you actually follow, and the algorithm will immediately start playing an infinite auto-scroll of car crashes, fights, burglaries, and other violent/toxic content. Comment on any of those videos posted by pages that you don&amp;#39;t follow, and all your friends will see your outburst or your stance on a controversial topic. &lt;/p&gt;\n\n&lt;p&gt;Instagram has completely abandoned its original purpose to become a hybrid of snapchat and tiktok. You can say that social media is ever-evolfing and fluid, but the most egregious aspect of this is that Instagram does not support content creators. Without content creators, there is no Instagram! Instead, Instagram rewards spammers and content thieves that lift popular content from original creators and compile it under soulless pages that the algorithm reward with all the exposure. Seriously, go into the explore tab and start scrolling through reels and take note of how many of those are from either content creators or content thieves. &lt;/p&gt;\n\n&lt;p&gt;Have you seen the profile page for facebook on Instagram? This is how delusional the company is. It completely ignores and underrepresents the core of the facebook userbase. Do you think that most of the poeple that actually use facebook are the cool kind of people shown in that facebook profile on instagram? They are actually the kind of people that use facebook the least, if they even have a facebook profile.  &lt;/p&gt;\n\n&lt;p&gt;When facebook started, it had a clear vision to connect college students. Expanding beyond college students was reasonable and welcomed, it made sense to grow beyond that, but where is it heading now? Where has it been heading for the past 7 years? It seems like it&amp;#39;s way off course and without a direction, just drifting away. What&amp;#39;s the point of trying to be a generic one-size-fits-all version of snapchat, tiktok, youtube, craigslist, tinder, instagram, discord, myspace, zoom, periscope, etc. &lt;/p&gt;\n\n&lt;p&gt;If the stock depends on ad revenue, if ad revenue depends on engagement, if engagement depends on user experience; how is ad revenue going to grow if the user experience is declining and management seems delusional about it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "612ee368-65e6-11e5-b53f-129e4297eb59",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f7b84f",
  "id": "wgze4p",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "monitorcable",
  "discussion_type": null,
  "num_comments": 64,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/wgze4p/who_is_the_target_audienceclient_base_of_meta/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/wgze4p/who_is_the_target_audienceclient_base_of_meta/",
  "subreddit_subscribers": 4392195,
  "created_utc": 1659802151,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1659715866,
  "the_new_excerpt": "From my personal experience as a Facebook and Instagram user for over 10 years;\nthe experience has become more and more mundane every year, exponentially. I see\nthe same pattern among most of my peers; everyone posts less and less or nothing\nat all anymore. Whenever you engage and comment on a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10年以上FacebookとInstagramを利用している私の個人的な体験から。\nその体験は、年々、指数関数的に平凡になってきています。私の周りでも\nの投稿はどんどん少なくなっていますし、何もしていません。\nを投稿しなくなりました。このような状況下において、「facebook」や「Instagram」を利用することは、非常に重要です。",
      "title": "Metaのターゲット層/顧客層はどのような人たちですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我作为Facebook和Instagram用户超过10年的个人经验。\n经验已经变得越来越平凡，每年都在成倍增长。我看到\n在我的大多数同龄人中也有同样的模式；每个人的帖子越来越少，或者根本没有\n越来越少，或者根本就不发。每当你参与和评论一个...",
      "title": "谁是Meta的目标受众/客户群？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我作爲Facebook和Instagram用戶超過10年的個人經驗。\n經驗已經變得越來越平凡，每年都在成倍增長。我看到\n在我的大多數同齡人中也有同樣的模式；每個人的帖子越來越少，或者根本沒有\n越來越少，或者根本就不發。每當你參與和評論一個...",
      "title": "誰是Meta的目標受衆/客戶羣？"
    }
  ],
  "source_updated_at": 1660297489193
}