{
  "author": "tanmay1010",
  "original_created_utc": 1641240147,
  "title": "If Eminem buys an NFT for $0.5m, he spends less than 0.25% of his net worth. That's not the case for the most of us. Remember that before you make any extravagant purchase.",
  "created_utc": 1641267186,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Most of the celebrities who are buying BAYC NFTs are spending less than a % of what they own because they know that NFTs are at this point a gamble. At face value, those numbers might look great ($0.5m which will appreciate with time)- but when you dig a little down- these guys are just playing with their lying around money.&lt;/p&gt;\n\n&lt;p&gt;Do not get motivated by these purchases, they can afford to lose 0.20% of their net worth and still live the life that they are living. While most of us- if the purchase goes south- won&amp;#39;t be able to survive through the episode unscathed.&lt;/p&gt;\n\n&lt;p&gt;Adding to that, most of these projects would fail eventually. Terrapin (a LUNA NFT collection) was minted for 3Luna each. The floor price of them today is 0.5 LUNA.&lt;/p&gt;\n\n&lt;p&gt;And so (let this post be a reminder) only invest what you can afford to lose. Only buy NFTs if you can afford to buy a minimum of 10 of them. As it&amp;#39;s currently a game of fire, and if you&amp;#39;re not cautious you too will burn your hands.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/rvakhh/if_eminem_buys_an_nft_for_05m_he_spends_less_than/",
  "subreddit": "CryptoCurrency",
  "id": "rvakhh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Most of the celebrities who are buying BAYC NFTs are spending less than a % of\nwhat they own because they know that NFTs are at this point a gamble. At face\nvalue, those numbers might look great ($0.5m which will appreciate with time)-\nbut when you dig a little down- these guys are just playing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BAYC NFTを購入しているセレブリティの多くは、その購入額を1％未満に抑えています。\nNFTがギャンブルであることを知っているからです。額面上は\nこの数字は、素晴らしい数字に見えるかもしれません（0.5百万ドルで、時間とともに評価されるでしょう）。\nしかし、少し掘り下げてみると、彼らはただ遊んでいるだけなのだ......。",
      "title": "エミネムがNFTを0.5百万ドルで買ったとしたら、使ったのは純資産の0.25％以下です。ほとんどの人はそうはいきません。贅沢な買い物をする前に、このことを思い出してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数购买BAYC NFTs的名人所花的钱还不到他们所拥有的东西的百分之一。\n因为他们知道NFTs在这一点上是一场赌博。从表面上看\n价值，这些数字可能看起来很好（50万美元，会随着时间的推移而升值）-------。\n但当你深入了解时，这些人只是在玩......",
      "title": "如果埃米纳姆用50万美元买了一个NFT，他花的钱还不到他净资产的0.25%。对于我们大多数人来说，情况并非如此。在你进行任何奢侈的购买之前，请记住这一点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數購買BAYC NFTs的名人所花的錢還不到他們所擁有的東西的百分之一。\n因爲他們知道NFTs在這一點上是一場賭博。從表面上看\n價值，這些數字可能看起來很好（50萬美元，會隨着時間的推移而升值）-------。\n但當你深入瞭解時，這些人只是在玩......",
      "title": "如果埃米納姆用50萬美元買了一個NFT，他花的錢還不到他淨資產的0.25%。對於我們大多數人來說，情況並非如此。在你進行任何奢侈的購買之前，請記住這一點。"
    }
  ]
}