{
  "author": "Jasquirtin",
  "original_created_utc": 1635086711,
  "title": "A reminder Shib will NOT hit 1 penny",
  "created_utc": 1635103860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As shib is pumping we have many new people entering the space from their favorite YouTuber or person on Twitter telling them to buy shib. And it sure as hell is working to this point congrats. </p>\n\n<p>But the problem is many of you newbies don’t understand MC I just got flamed for pointing out to two people that shiba will not EVER hit a penny (.01). I was accused of it being just like BTC to 10k and doge to 50 cent. Okay no shib is like neither of those. </p>\n\n<p>Let’s revisit market cap shall we? The market cap is a metric we use to compare coins to one another it’s THE thing to check when you want to know potential price action of a coin. MC= circulating supply x current market price. BTC is the #1 coin at 1.1T (1 decimal place) MC. You can calculate that with $60,300 (current Market price) x 17 million (circulating supply). No one with a brain should believe your coin will surpass this. </p>\n\n<p>Let’s look at shib shall we. A current MC of 17 billion. It’s got some room to run sure. Will it get to a penny? No shot. Why? MC. To get to 1 cent shib will need to 238x from here. That would be a market cap of 17B x 238 = over 4T. All of crypto is currently 2.55T. It’s NOT HAPPENING THIS RUN. </p>\n\n<p>If you are new I hope this helps cause I doubt your influencer who told you to buy explained this. If you made money great but no your $50 will not 300x you will not hit $1 the supply continues to go up daily making it even harder. I hope this helps.</p>\n\n<p>Edit: to those who are commenting like it can happen beat of luck. If it does save this post hit me up and I’ll record me chewing my show strings of 3 year old shoes.</p>\n\n<p>Edit2: bring on the downvotes shib gang. Sorry for trying to educate you. /s im not sorry for telling the hard truth.</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/qetk4i/a_reminder_shib_will_not_hit_1_penny/",
  "subreddit": "CryptoCurrency",
  "id": "qetk4i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As shib is pumping we have many new people entering the space from their\nfavorite YouTuber or person on Twitter telling them to buy shib. And it sure as\nhell is working to this point congrats.\n\nBut the problem is many of you newbies don’t understand MC I just got flamed for\npointing out to two…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "shibが普及するにつれ、お気に入りのTuberやTwitterで「shibを買ってください」と言われた人が新たに参入してくるようになりました。\n好きなYouTuberやTwitterで「shibを買おう」と言っている人から、新しい人が入ってきます。そしてそれは確かに\nおめでとうございます。\n\nしかし問題は、多くの新規参入者が理解していないことです。\n炎上しましたが...",
      "title": "Shibは1ペニーにはならないということを覚えておいてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着shib的发展，我们有许多新的人从他们最喜欢的YouTuber或Twitter上的人那里进入这个空间。\n他们最喜欢的YouTuber或Twitter上的人告诉他们要购买shib。而且它肯定是\n地狱是工作到这一点，祝贺你。\n\n但问题是，你们中的许多新手不明白，我刚刚被骂了。\n我刚刚因为指出了两个...",
      "title": "提醒大家，Shib不会打出1分钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着shib的發展，我們有許多新的人從他們最喜歡的YouTuber或Twitter上的人那裏進入這個空間。\n他們最喜歡的YouTuber或Twitter上的人告訴他們要購買shib。而且它肯定是\n地獄是工作到這一點，祝賀你。\n\n但問題是，你們中的許多新手不明白，我剛剛被罵了。\n我剛剛因爲指出了兩個...",
      "title": "提醒大家，Shib不會打出1分錢。"
    }
  ]
}