{
  "author": "AskRedditModerators",
  "the_new_excerpt": "We’ve gotten a lot of feedback on this one. A lot of feedback. We’ve all seen\nthe “how would you feel about ____” in which the OP is just posting what is\nconsidered a \"shower thought\" which is aimed to ask users to support a largely\npopular concept in a way that fits AskReddit’s rules. Interesting…",
  "original_created_utc": 1617474615,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们已经得到了很多反馈 关于这一个。很多的反馈。我们都看到了\n的 \"你会如何看待____\"中，上级只是发布什么是。\n被认为是一种 \"洗澡思想\"，其目的是要求用户在很大程度上支持。\n流行概念的方式，符合AskReddit的规则。有趣的是...",
      "title": "你如何看待'你会怎么想？'的帖子被禁？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們已經得到了很多反饋 關於這一個。很多的反饋。我們都看到了\n的 \"你會如何看待____\"中，上級只是發佈什麼是。\n被認爲是一種 \"洗澡思想\"，其目的是要求用戶在很大程度上支持。\n流行概念的方式，符合AskReddit的規則。有趣的是...",
      "title": "你如何看待'你會怎麼想？'的帖子被禁？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "たくさんのご意見をいただきました。たくさんの意見が寄せられています。私たちは皆\n____ についてどう思いますか」というものがあります。\nこれは、Askのコンセプトに合致した形で、ユーザーに人気のあるコンセプトを支持してもらうことを目的としています。\n人気のあるコンセプトをAskRedditのルールに沿った形で支持してもらうことを目的とした「シャワー思考」と呼ばれるものをOPが投稿しているのを見たことがあります。興味深い...",
      "title": "あなたならどう感じるか」という投稿が禁止されたことについてどう思いますか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "たくさんのご意見をいただきました。たくさんの意見が寄せられています。私たちは皆\n____ についてどう思いますか」というものがあります。\nこれは、Askのコンセプトに合致した形で、ユーザーに人気のあるコンセプトを支持してもらうことを目的としています。\n人気のあるコンセプトをAskRedditのルールに沿った形で支持してもらうことを目的とした「シャワー思考」と呼ばれるものをOPが投稿しているのを見たことがあります。興味深い...",
      "title": "あなたならどう感じるか」という投稿が禁止されたことについてどう思いますか？"
    }
  ],
  "title": "How do you feel about ’how would you feel?’ posts being banned?",
  "created_utc": 1617514340,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’ve gotten a lot of feedback on this one. A lot of feedback. We’ve all seen the “how would you feel about ____” in which the OP is just posting what is considered a &quot;shower thought&quot; which is aimed to ask users to support a largely popular concept in a way that fits AskReddit’s rules. Interesting and engaging titles are always great but these posts don’t have much discussion value, which is the purpose of this sub. Because of this, and due to the feedback we’ve received, we’ve decided to remove these posts moving forward.</p>\n\n<p>We do understand that there’s some nuance to this. Some posts are shower thoughts/ideas, and others are actual discussion questions.</p>\n\n<p>For example:</p>\n\n<ul>\n<li>“<em>How would you feel about a ’if you accidentally scroll to the top, you can go back to where you were,’ button for Reddit?</em>” is really just a feature suggestion.</li>\n<li>“<em>How would you feel about dating someone that makes a lot more money than you?</em>” is a discussion question.</li>\n</ul>\n\n<p>Our philosophy in AskReddit is to keep rules as objective as possible because it helps ensure fairness and consistency in moderation without allowing for a moderator&#39;s personal discretion to interfere in the practice of removing or approving content. However, we also recognize that blanket bans on the phrasing of a question does not always accurately work to meet the spirit of the rules. If you feel your ”How would you feel” post promotes elaborate discussion and is not a rhetorical idea or limiting question, feel free to modmail us a link and we’ll be happy to manually review.</p>\n\n<p>Thank you to the users who modmailed us feedback asking for this policy. We always appreciate constructive feedback and we do take every bit of feedback into consideration. If you or anyone you know has been diagnosed with mesoth...sorry, wrong script...if you have feedback for us, we always appreciate it as we want to give people the best experience in AskReddit.</p>\n\n<p>With love,</p>\n\n<p>The Ass Credit Mods</p>\n</div><!-- SC_ON -->",
  "score": 93678,
  "permalink": "/r/AskReddit/comments/mje9y7/how_do_you_feel_about_how_would_you_feel_posts/",
  "subreddit": "AskReddit",
  "id": "mje9y7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961866774
}