{
  "author": "Coleslawsalads",
  "original_created_utc": 1646699432,
  "title": "Do people actually like small boobs?",
  "created_utc": 1646707646,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not gonna lie I’ve been insecure for quite some time cause of the size of my chest, It doesn’t help when people comment negatively on how small or flat they are and it’s not &amp;quot;feminine&amp;quot;. I just never understood why it’s seen as &amp;quot;unattractive&amp;quot; and we get put down for having something that’s out of our control. I know I shouldn’t be upset but sometimes those comments get to me especially since I’m already insecure.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 292,
  "permalink": "/r/TooAfraidToAsk/comments/t93xkj/do_people_actually_like_small_boobs/",
  "subreddit": "TooAfraidToAsk",
  "id": "t93xkj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Not gonna lie I’ve been insecure for quite some time cause of the size of my\nchest, It doesn’t help when people comment negatively on how small or flat they\nare and it’s not \"feminine\". I just never understood why it’s seen as\n\"unattractive\" and we get put down for having something that’s out of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、私は自分のサイズのせいで、かなり長い間不安でした。\n胸が小さいとか、平らだとか、否定的なコメントをされると、どうしようもない。\n女性らしくない。ただ、なぜそれが「女性らしい」と思われるのかが理解できません。\nそのため、\"魅力がない \"と言われ、\"そんなものを持っているからダメなんだ \"と言われるのです。",
      "title": "実はみんな小さいおっぱいが好きなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不瞒你说，我已经因为自己的胸部大小而不自信了很长时间。\n当人们对我的胸部有多小或多平进行负面评论时，这并没有什么帮助。\n当人们对我的胸部有多小或多平进行负面评论时，这并没有什么帮助，而且这也不是 \"女性化 \"的。我只是一直不明白为什么它被看作是\n我一直不明白为什么它被视为 \"不具吸引力\"，而我们却因为有一些不合适的东西而被贬低。",
      "title": "人们真的喜欢小胸吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不瞞你說，我已經因爲自己的胸部大小而不自信了很長時間。\n當人們對我的胸部有多小或多平進行負面評論時，這並沒有什麼幫助。\n當人們對我的胸部有多小或多平進行負面評論時，這並沒有什麼幫助，而且這也不是 \"女性化 \"的。我只是一直不明白爲什麼它被看作是\n我一直不明白爲什麼它被視爲 \"不具吸引力\"，而我們卻因爲有一些不合適的東西而被貶低。",
      "title": "人們真的喜歡小胸嗎？"
    }
  ]
}