{
  "author": "RusticBohemian",
  "the_new_excerpt": "I'm reading \"Benjamin Franklin: An American Life,\" by Walter Isaacson.\n\nIt says that, under Franklin, postal riders traveled at night.\n\n\"A letter sent from Philadelphia to Boston could receive a reply within six\ndays, and a round-trip to New York could be done within twenty-four hours, a\nservice…",
  "original_created_utc": 1620094201,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ベンジャミン・フランクリン」を読んでいます。ウォルター・アイザックソン著「Benjamin Franklin: An American Life」を読んでいます。\n\nそれによると、フランクリンの下では、郵便配達員は夜に移動していたそうです。\n\n\"フィラデルフィアからボストンに送った手紙は、6日以内に返事を受け取ることができた。\nフィラデルフィアからボストンに送った手紙は、6日以内に返事を受け取ることができ、ニューヨークへの往復は24時間以内に行うことができました。\nサービス...",
      "title": "ベン・フランクリンの郵便サービスは、フィラデルフィアからニューヨークに手紙を送ると、24時間以内に返事が届くというものでした。彼はどのようにして、現在では考えられないほどの効率性を実現したのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在读《本杰明-富兰克林》。美国生活》，作者沃尔特-艾萨克森。\n\n书中说，在富兰克林的领导下，邮递员在夜间出行。\n\n\"从费城寄到波士顿的信可以在六天内收到回信。\n从费城寄到波士顿的信可以在六天内收到回信，而到纽约的往返可以在二十四小时内完成，这是一项\n这项服务...",
      "title": "本-富兰克林邮政服务的用户可以从费城向纽约市寄信，并在24小时内收到答复。他是如何实现这种今天无法比拟的荒谬的效率的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在讀《本傑明-富蘭克林》。美國生活》，作者沃爾特-艾薩克森。\n\n書中說，在富蘭克林的領導下，郵遞員在夜間出行。\n\n\"從費城寄到波士頓的信可以在六天內收到回信。\n從費城寄到波士頓的信可以在六天內收到回信，而到紐約的往返可以在二十四小時內完成，這是一項\n這項服務...",
      "title": "本-富蘭克林郵政服務的用戶可以從費城向紐約市寄信，並在24小時內收到答覆。他是如何實現這種今天無法比擬的荒謬的效率的？"
    }
  ],
  "title": "Users of Ben Franklin's postal service could send a letter from Philadelphia to NYC and receive a reply within 24 hours. How did he achieve such ridiculous efficiency unmatched today?",
  "created_utc": 1620117396,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m reading &quot;Benjamin Franklin: An American Life,&quot; by Walter Isaacson.</p>\n\n<p>It says that, under Franklin, postal riders traveled at night. </p>\n\n<p>&quot;A letter sent from Philadelphia to Boston could receive a reply within six days, and a round-trip to New York could be done within twenty-four hours, a service that seems remarkable even now.&quot; </p>\n\n<p>The modern postal service sends trucks and planes out at night, but we can&#39;t send a letter and get a reply within 24 hours, even with all our advanced technology. </p>\n\n<p>So how was Franklin&#39;s system so efficient? Did he organize things in a fashion much different than what came before?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/n4dllw/users_of_ben_franklins_postal_service_could_send/",
  "subreddit": "AskHistorians",
  "id": "n4dllw",
  "is_self": true,
  "media": null,
  "is_video": false
}