{
  "author": "MyYakuzaTA",
  "original_created_utc": 1641860431,
  "title": "Are groceries taking up your whole budget too?",
  "created_utc": 1641869574,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m lucky enough that I can eat pantry meals but lately? The price of a can of beans has jumped from $0.99 to $3 a can. &lt;/p&gt;\n\n&lt;p&gt;Groceries take up my entire budget now to the point that I cannot afford utilities. While most of our meals are beans and rice or toast and eggs, it’s getting harder every single day. To the point I have to choose - food or water. &lt;/p&gt;\n\n&lt;p&gt;Today I bought one bag of dry goods. It was almost $100 for four meals. I need to know I’m not the only one. My savings is gone because I need food and I’m a step away from going to a food pantry but don’t want to take away from anyone who needs more than I do. &lt;/p&gt;\n\n&lt;p&gt;Am I alone?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 195,
  "permalink": "/r/TooAfraidToAsk/comments/s0z3n0/are_groceries_taking_up_your_whole_budget_too/",
  "subreddit": "TooAfraidToAsk",
  "id": "s0z3n0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m lucky enough that I can eat pantry meals but lately? The price of a can of\nbeans has jumped from $0.99 to $3 a can.\n\nGroceries take up my entire budget now to the point that I cannot afford\nutilities. While most of our meals are beans and rice or toast and eggs, it’s\ngetting harder every single…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はラッキーなことにパン食が食べられるのですが、最近？缶詰の値段は\n豆が1缶0.99ドルから3ドルに跳ね上がった。\n\n食料品に全予算を取られてしまい、今では、このような余裕はありません。\n光熱費。食事は豆ご飯かトーストと卵がほとんどですが\nますます大変に",
      "title": "食料品にも予算を取られていませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很幸运，我可以吃到储藏室的饭菜，但最近呢？一罐豆子的价格\n豆子的价格已经从0.99美元跳到了3美元一罐。\n\n杂货店现在占据了我的全部预算，以至于我无法承担\n水电费。虽然我们的大部分饭菜都是豆子和米饭，或者烤面包和鸡蛋，但这是越来越难了。\n越来越难了...",
      "title": "杂货店也占用了你的全部预算吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很幸運，我可以喫到儲藏室的飯菜，但最近呢？一罐豆子的價格\n豆子的價格已經從0.99美元跳到了3美元一罐。\n\n雜貨店現在佔據了我的全部預算，以至於我無法承擔\n水電費。雖然我們的大部分飯菜都是豆子和米飯，或者烤麪包和雞蛋，但這是越來越難了。\n越來越難了...",
      "title": "雜貨店也佔用了你的全部預算嗎？"
    }
  ]
}