{
  "author": "vrrrggggl",
  "original_created_utc": 1646405659,
  "title": "Does it seem like search engines are getting less helpful and accurate?",
  "created_utc": 1646421961,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems like over the last 5-10 years, search engines for general internet search (google, duck duck go, bing, etc) have become less useful in finding accurate results. I am just trying to gauge if this is true or something I am imagining. &lt;/p&gt;\n\n&lt;p&gt;For example, earlier, I typed in &amp;quot;Best Bose products of all time&amp;quot; into duck duck go. Pretty much every result was &amp;quot;best bose speakers of 2022&amp;quot; or some similar return result and of those results, pretty much the entire first few pages were nothing but amazon affiliate links and &amp;quot;reviews&amp;quot; that are nothing more than shallow advertisements for clicks. &lt;/p&gt;\n\n&lt;p&gt;I figured maybe it was just because duck duck go, so I did the same search in google. Of the google results, only 1 return really matched my search on the first page &amp;quot;the best bose speakers of all time 1972-2022. All the rest were similar &amp;quot;best of 2022&amp;quot; affiliate pages. &lt;/p&gt;\n\n&lt;p&gt;I have been using the internet since the mid-90s and it just seems like in the early-mid 00s when I searched something I found more objective, quality websites you would want to read. Now it seems like it returns nothing but ads.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/t6kpay/does_it_seem_like_search_engines_are_getting_less/",
  "subreddit": "NoStupidQuestions",
  "id": "t6kpay",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It seems like over the last 5-10 years, search engines for general internet\nsearch (google, duck duck go, bing, etc) have become less useful in finding\naccurate results. I am just trying to gauge if this is true or something I am\nimagining.\n\nFor example, earlier, I typed in \"Best Bose products of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この5〜10年、一般的なインターネット用の検索エンジンは\ngoogle、duck duck go、bingなど）の検索は、あまり意味がなくなってきています。\n正確な結果を得ることができます。私は、これが真実なのか、それとも私の思い過ごしなのか、見極めようとしているところです。\nを想像しています。\n\n例えば、さっき「Best Bose products of...」と入力したんです。",
      "title": "検索エンジンの使い勝手や精度が落ちてきているような気がしませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的5-10年里，用于一般互联网搜索的搜索引擎（google、duck duck go、bing等）似乎变得不再有用。\n搜索引擎（谷歌，鸭子，bing，等等）在找到一个人的时候已经变得不太有用了。\n准确的结果。我只是试图衡量这是真的还是我的想象。\n想象出来的。\n\n例如，早些时候，我输入了 \"Best Bose products of...",
      "title": "看起来搜索引擎的帮助和准确性越来越低了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的5-10年裏，用於一般互聯網搜索的搜索引擎（google、duck duck go、bing等）似乎變得不再有用。\n搜索引擎（谷歌，鴨子，bing，等等）在找到一個人的時候已經變得不太有用了。\n準確的結果。我只是試圖衡量這是真的還是我的想象。\n想象出來的。\n\n例如，早些時候，我輸入了 \"Best Bose products of...",
      "title": "看起來搜索引擎的幫助和準確性越來越低了嗎？"
    }
  ]
}