{
  "author": "ThomasReturns",
  "original_created_utc": 1643360003,
  "title": "So now that china can’t ban crypto anymore, you guys realize “the US will ban crypto” is the new “fud shaker”",
  "created_utc": 1643388022,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes the patterns are so obvious it hurts.&lt;/p&gt;\n\n&lt;p&gt;Lets make it really clear from the start: “there are people and parties that wan’t your bitcoin. Preferably cheaper than it is now”&lt;/p&gt;\n\n&lt;p&gt;Thats all you need to remember. The rest is noise. &lt;/p&gt;\n\n&lt;p&gt;Yes politics may come and go, different ideas may be thrown around, but don’t for one moment think that if there is money to be made, they will let that chance slide.&lt;/p&gt;\n\n&lt;p&gt;Regulations may come and you will probably have to kyc more regularly or in a more specific way.&lt;/p&gt;\n\n&lt;p&gt;But banning crypto has proved to be basically impossible. And at this point i don’t even slightly consider it an option and neither should you.&lt;/p&gt;\n\n&lt;p&gt;Instead, turn of the bullshit news (because it always is absolute bullshit) and just look for nice price points to get more of your favorite coin.&lt;/p&gt;\n\n&lt;p&gt;Then over a couple of years, look back and enjoy.&lt;/p&gt;\n\n&lt;p&gt;Tdlr: you watch too much television/newschannel.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/semd4g/so_now_that_china_cant_ban_crypto_anymore_you/",
  "subreddit": "CryptoCurrency",
  "id": "semd4g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sometimes the patterns are so obvious it hurts.\n\nLets make it really clear from the start: “there are people and parties that\nwan’t your bitcoin. Preferably cheaper than it is now”\n\nThats all you need to remember. The rest is noise.\n\nYes politics may come and go, different ideas may be thrown…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時には痛いほどわかるパターンもあります。\n\n最初からはっきりさせましょう。\"ある人々 \"や \"ある団体 \"が\nあなたのビットコインが欲しい。できれば今より安い方がいい\"\n\nそれだけを覚えておけばいいのです。あとはノイズです。\n\n確かに政治は行ったり来たりするし、違うアイディアが投げかけられるかもしれない...。",
      "title": "中国が暗号を禁止できなくなった今、あなた方は「米国が暗号を禁止する」ことが新しい \"fud shaker \"であることを理解しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有时，这些模式是如此明显，以至于让人心痛。\n\n让我们从一开始就把事情说清楚。\"有一些人和政党\n不想要你的比特币。最好是比现在更便宜的\"\n\n这就是你需要记住的一切。其他的都是噪音。\n\n是的，政治可能来来去去，不同的想法可能被抛出...",
      "title": "所以现在中国不能再禁止加密货币了，你们意识到 \"美国将禁止加密货币 \"是新的 \"假币摇动器\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有時，這些模式是如此明顯，以至於讓人心痛。\n\n讓我們從一開始就把事情說清楚。\"有一些人和政黨\n不想要你的比特幣。最好是比現在更便宜的\"\n\n這就是你需要記住的一切。其他的都是噪音。\n\n是的，政治可能來來去去，不同的想法可能被拋出...",
      "title": "所以現在中國不能再禁止加密貨幣了，你們意識到 \"美國將禁止加密貨幣 \"是新的 \"假幣搖動器\""
    }
  ]
}