{
  "author": "normie_sama",
  "original_created_utc": 1646719186,
  "title": "Political science theory puts a lot of emphasis on the Treaty of Westphalia (1648) as creating the modern state. How accurate is this from a historical perspective?",
  "created_utc": 1646750740,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It kind of seems to me that &amp;quot;the modern territorial state sprung into existence with the signing of the Peace of Westphalia&amp;quot; is something of an axiom within academic polsci. However, I often see it being mentioned as a throwaway statement by legal and political science scholars that don&amp;#39;t necessarily have a history background, and it rarely seems to be engaged with in any critical manner. Was the Treaty itself really that pivotal of an event? How can it be reconciled with notions of statehood held in non-European contexts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/t9a25l/political_science_theory_puts_a_lot_of_emphasis/",
  "subreddit": "AskHistorians",
  "id": "t9a25l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It kind of seems to me that \"the modern territorial state sprung into existence\nwith the signing of the Peace of Westphalia\" is something of an axiom within\nacademic polsci. However, I often see it being mentioned as a throwaway\nstatement by legal and political science scholars that don't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "近代的な領土国家が誕生した」というのは、なんとなくわかるような気がします。\nウェストファリア条約が締結されたとき」というのは、ある種の公理である。\n学問的な政治学です。しかし、この言葉は、しばしば捨て台詞のように語られるのを目にします。\n法学や政治学の研究者は、そのようなことは考えません。",
      "title": "政治学の理論では、近代国家の誕生としてウェストファリア条約（1648年）が重視されています。これは歴史的にみて、どの程度正確なのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我看来，\"现代领土国家是随着威斯特伐利亚和约的签署而出现的\n现代领土国家是随着威斯特伐利亚和约的签署而产生的\"，这似乎是学术政治学中的一个公理。\n学术政治学中的一个公理。然而，我经常看到有人把它作为一个抛物线提到\n然而，我经常看到法律和政治学学者把它作为一个抛砖引玉的说法，而这些学者并不...",
      "title": "政治学理论非常强调《威斯特伐利亚条约》（1648年）创造了现代国家。从历史的角度来看，这有多准确？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我看來，\"現代領土國家是隨着威斯特伐利亞和約的簽署而出現的\n現代領土國家是隨着威斯特伐利亞和約的簽署而產生的\"，這似乎是學術政治學中的一個公理。\n學術政治學中的一個公理。然而，我經常看到有人把它作爲一個拋物線提到\n然而，我經常看到法律和政治學學者把它作爲一個拋磚引玉的說法，而這些學者並不...",
      "title": "政治學理論非常強調《威斯特伐利亞條約》（1648年）創造了現代國家。從歷史的角度來看，這有多準確？"
    }
  ]
}