{
  "author": "CryptoCurrencEEE",
  "original_created_utc": 1633264042,
  "title": "Texas Aim To Be A World Leader In Bitcoin And Blockchain",
  "created_utc": 1633279219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Texas has seen the upside of China’s decision to cancel bitcoin mining, in what set off the ‘Great Mining Migration’ to Austin, Texas. The Texas Blockchain Council has grown to 70 members and is led by Lee Brachter, the President of the organization. And next Friday, he will be hosting the Texas Blockchain Summit – an event that could prove to be the largest state-level blockchain one-day summit ever.</p>\n\n<p>It’s not lost what Bitcoin might do for Texas – already a top ten economy in the world With Senator Ted Cruz (R-TX), Senator John Cornyn (R-TX) and Senator Cynthia Lummis (R-WY) speaking at the event, could make the first Texas Blockchain Summit a benchmark for the amount of interest in how Texas could benefit from the growth of digital currencies and blockchain technology.</p>\n\n<p>Texas Governor Greg Abbott has met with the Texas Blockchain Council twice already. Recently Abbott commented on Twitter that, “Texas will be the crypto leader. Cryptocurrency is now coming to Texas grocery stores.” Abbott was referring to the decision by H-E-B to put cryptocurrency kiosks in some Texas grocery stores.</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/Bitcoin/comments/q0grel/texas_aim_to_be_a_world_leader_in_bitcoin_and/",
  "subreddit": "Bitcoin",
  "id": "q0grel",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Texas has seen the upside of China’s decision to cancel bitcoin mining, in what\nset off the ‘Great Mining Migration’ to Austin, Texas. The Texas Blockchain\nCouncil has grown to 70 members and is led by Lee Brachter, the President of the\norganization. And next Friday, he will be hosting the Texas…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "テキサス州では、中国がビットコインの採掘を中止する決定をしたことで、上昇気流に乗りました。\nテキサス州オースティンへの「グレート・マイニング・マイグレーション」を引き起こしました。テキサス・ブロックチェーン\n協議会のメンバーは70名にまで増え、会長のLee Brachter氏を中心に\n組織です。そして、来週の金曜日には、彼が主催するTexas...",
      "title": "テキサス州、ビットコインとブロックチェーンの世界的リーダーを目指す"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "德州已经看到了中国取消比特币开采的决定所带来的好处。\n掀起了向德克萨斯州奥斯汀的 \"采矿大迁徙\"。德州区块链\n理事会已经发展到70个成员，由该组织的主席Lee Brachter领导。\n该组织的主席Lee Brachter领导。而下周五，他将主持德克萨斯州...",
      "title": "德州旨在成为比特币和区块链的世界领导者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "德州已經看到了中國取消比特幣開採的決定所帶來的好處。\n掀起了向德克薩斯州奧斯汀的 \"採礦大遷徙\"。德州區塊鏈\n理事會已經發展到70個成員，由該組織的主席Lee Brachter領導。\n該組織的主席Lee Brachter領導。而下週五，他將主持德克薩斯州...",
      "title": "德州旨在成爲比特幣和區塊鏈的世界領導者"
    }
  ]
}