{
  "author": "tiganius",
  "original_created_utc": 1647000613,
  "title": "How do pornstars survive hardcore anal scenes?",
  "created_utc": 1647018566,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve had only one partner who liked anal. We would do it pretty much in the safest way - foreplay, pre-stimulation with fingers/beads, lubes, slow penetration - and she would sometimes still be sore and in pain afterwards. And pornstars do this thing with multiple (very richly endowed) man in a row, there does not seem much lubing going on and the men are extremely rough and violent. How is that even possible? How fo their rectums just not tear/ bleed all over?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/tbos2a/how_do_pornstars_survive_hardcore_anal_scenes/",
  "subreddit": "NoStupidQuestions",
  "id": "tbos2a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I've had only one partner who liked anal. We would do it pretty much in the\nsafest way - foreplay, pre-stimulation with fingers/beads, lubes, slow\npenetration - and she would sometimes still be sore and in pain afterwards. And\npornstars do this thing with multiple (very richly endowed) man in a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アナルが好きなパートナーは一人しかいない。私たちは、かなり多くのことをします。\n前戯、指やビーズでの前刺激、ローブ、ゆっくりとした動作など、最も安全な方法です。\nそして、その後に彼女が痛がることもありました。そして\nAV女優が複数の（非常に豊かな）男性とアレをする...",
      "title": "AV女優がハードコアなアナルシーンに耐えるには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只有一个伙伴喜欢肛门。我们几乎是以最安全的方式进行\n我们会以最安全的方式进行--前戏，用手指/珠子进行预刺激，使用润滑剂，缓慢插入。\n而她有时在事后仍会感到疼痛和难过。而且\n色情明星与多个（非常丰富的）男人在一起做这件事。",
      "title": "色情演员如何在硬核肛门戏中生存？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只有一個夥伴喜歡肛門。我們幾乎是以最安全的方式進行\n我們會以最安全的方式進行--前戲，用手指/珠子進行預刺激，使用潤滑劑，緩慢插入。\n而她有時在事後仍會感到疼痛和難過。而且\n色情明星與多個（非常豐富的）男人在一起做這件事。",
      "title": "色情演員如何在硬核肛門戲中生存？"
    }
  ]
}