{
  "author": "jcoll627",
  "original_created_utc": 1634483619,
  "title": "Why Bitcoin Could Break $65,000 This Week",
  "created_utc": 1634560636,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When Bitcoin reached its previous high in April it is clear that high was built on higher leverage than today&#39;s price. April&#39;s $64K was driven by leverage with the near term goal of reaching a $1,000,000,000,000 (Trillion) Bitcoin market cap for the first time. We then saw a pullback as investors deleveraged to take their gains.</p>\n\n<p>During this recovery phase which has put us over $60K once again, we saw an influx in a higher proportion of actual dollars versus leveraged dollars. </p>\n\n<p>These are my top reasons why this week&#39;s potential Bitcoin all time high is different...</p>\n\n<p>(1) institutional investors continue to announce investments and plans to invest in Bitcoin (long term holders means more stability, and less / safer leverage)</p>\n\n<p>(2) high amounts of Bitcoin were being purchased and placed in cold storage during the pull back (less supply on market)</p>\n\n<p>(3) recognizable names and companies are increasingly endorsing crypto which further increases the network effect and legitimizes the assets (Tesla, Mr Wonderful, Mark Cuban, Societe General, Fidelity, Twitter, Visa, George Soros, etc)</p>\n\n<p>(4) the US government and the SEC appear to be permitting ETF futures which is a positive signal for a potential physical ETF.</p>\n\n<p>This last point is much more significant than people estimate. If an US ETF is approved it inherently means the US government is limiting its ability to regulate Bitcoin in a negative light. Once retirement savings are legitimatized via ETFs, regulation will come in the form of... How best can the US government protect people&#39;s retirements versus pre-ETF approval it feels like the government could still do what it wants. </p>\n\n<p>Even Mr Wonderful acknowledged that a trillion dollars of ETF money is on the sidelines waiting to enter Bitcoin.</p>\n\n<p>In other words, US ETF approval signifies escape velocity for Bitcoin, both in terms of US government legitimization and capital inflow from ETFs increasing stability / value. This value is north of $100,000 in 2021. </p>\n\n<p>I have Fidelity and I am 38, if that ETF is approved I move my whole retirement (actual retirement from the pharma company I work for) into Bitcoin because I believe the best way to build a better world is to allow programmers to tokenize/digitize the interactions of humanity one interaction at a time. I believe more in technology and programmers than Washington politics and lawyers. If left with the latter we all end up on dystopian welfare. Future generations of Americans will never let this happen! Let&#39;s go free markets and capitalism! </p>\n\n<p>And for the record, I love alts more than Bitcoin :p but Bitcoin paved the path</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/qa0nh5/why_bitcoin_could_break_65000_this_week/",
  "subreddit": "Bitcoin",
  "id": "qa0nh5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When Bitcoin reached its previous high in April it is clear that high was built\non higher leverage than today's price. April's $64K was driven by leverage with\nthe near term goal of reaching a $1,000,000,000,000 (Trillion) Bitcoin market\ncap for the first time. We then saw a pullback as investors…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインが4月に前回の高値をつけたとき、その高値が今日よりも高いレバレッジで作られたことは明らかです。\n今日の価格よりも高いレバレッジで構築されたことは明らかです。4月の64Kドルは、レバレッジを駆使して\n4月の64Kドルは、ビットコインの時価総額を初めて1,000,000,000(Trillion)ドルにするという短期的な目標に向かって、レバレッジをかけていました。\n4月の64Kドルは、ビットコインの時価総額が1,000,000,000ドル（兆円）に達するという短期的な目標に向かって、レバレッジをかけていました。その後、投資家によるプルバックが見られました...",
      "title": "ビットコインが今週中に65,000ドルを突破できる理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当比特币在4月达到之前的高点时，很明显，这个高点是建立在比今天的价格更高的杠杆上的。\n在比今天的价格更高的杠杆上。4月的64K美元是由杠杆驱动的，其近期目标是达到1,000,000,000,000（万亿美元）的比特币。\n近期目标是达到1,000,000,000,000（万亿美元）的比特币市值\n的目标。然后我们看到了回调，因为投资者...",
      "title": "为什么比特币本周可能突破65,000美元？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當比特幣在4月達到之前的高點時，很明顯，這個高點是建立在比今天的價格更高的槓桿上的。\n在比今天的價格更高的槓桿上。4月的64K美元是由槓桿驅動的，其近期目標是達到1,000,000,000,000（萬億美元）的比特幣。\n近期目標是達到1,000,000,000,000（萬億美元）的比特幣市值\n的目標。然後我們看到了回調，因爲投資者...",
      "title": "爲什麼比特幣本週可能突破65,000美元？"
    }
  ]
}