{
  "author": "CobaltBlue",
  "the_new_excerpt": "I'm fairly new to investing and the options lingo has a lot of overlapping\nterms,making it hard to google answers.\n\nLets say I think that stock ABC is going to drop significantly in the next 2\nmonths. I would like to use options to profit off of that, but I don't want to\nshort because I'm not…",
  "original_created_utc": 1612238031,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个相当新的投资和期权行话有很多的重叠\n术语，使它很难谷歌的答案。\n\n比方说，我认为，股票ABC是要在未来的2显著下降\n月。我想用期权来从中获利，但我不想\n短，因为我不...",
      "title": "帮助了解做风险较小的期权交易的基础知识。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個相當新的投資和期權行話有很多的重疊\n術語，使它很難谷歌的答案。\n\n比方說，我認爲，股票ABC是要在未來的2顯著下降\n月。我想用期權來從中獲利，但我不想\n短，因爲我不...",
      "title": "幫助瞭解做風險較小的期權交易的基礎知識。"
    }
  ],
  "title": "Help understanding basics of making less-risky options trading",
  "created_utc": 1612303404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m fairly new to investing and the options lingo has a lot of overlapping terms,making it hard to google answers.</p>\n\n<p>Lets say I think that stock ABC is going to drop significantly in the next 2 months. I would like to use options to profit off of that, but I don&#39;t want to short because I&#39;m not comfortable with unlimited downside in case I&#39;m wrong.  I also do NOT own any ABC stock.</p>\n\n<p>My understanding is I can do the following:</p>\n\n<ol>\n<li>Buy a &quot;put option&quot; as &quot;buy to open&quot;. This gives me the right, but not the obligation, to sell ABC stock at the strike price by the given date. For this privilege, I pay a premium upfront. </li>\n<li>I would not want to &quot;buy to close&quot; as this would be &quot;shorting&quot; and leave me on the hook to cover the position (though without paying a premium).</li>\n<li>Since I don&#39;t have stock in ABC I could <em>not</em> exercise the contract even if it were &quot;in the money&quot; (profitable), but I CAN sell it to someone who has stock in ABC who would want to exercise to offset their losses. </li>\n</ol>\n\n<p>Questions:</p>\n\n<ol>\n<li>Are the above all fully correct? I really don&#39;t want to accidentally buy the wrong thing and be on the hook.</li>\n<li>If that&#39;s all right, how does part 3 work? I don&#39;t see in my Ameritrade window a place to buy and sell existing options on an options market. It seems like the options tab exclusively deals with creating new contracts (options) not buying or selling someone elses. Is there ever issue with trading away an option in the money?</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/investing/comments/lamrns/help_understanding_basics_of_making_lessrisky/",
  "subreddit": "investing",
  "id": "lamrns",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534786
}