{
  "author": "Disposable_Canadian",
  "the_new_excerpt": "Not financial advice. Always seek professional advice from your financial\nadvisor.\n\nNYSE: NCLH\n\nNews: Recently received proxy vote information for Norwegian Cruise Lines, as\nfollows:\n\nItems:\n\n 1. Election of class II directors, nominees Adam M Aron and Stella David and\n    Mary E Landry.\n 2.…",
  "original_created_utc": 1619401383,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "財務に関するアドバイスではありません。専門的なアドバイスは、必ずあなたのファイナンシャル\nアドバイザーにご相談ください。\n\nNYSE: NCLH\n\nニュース ノルウェージャンクルーズラインズの委任状投票情報を最近受け取りました。\n以下の通りです。\n\n項目は以下の通りです。\n\n 1. クラスIIの取締役の選出、ノミネートされたアダム・M・アロン、ステラ・デイビッドと\n    Mary E Landry.\n 2....",
      "title": "NCLH ノルウェー人が普通株式を49万株から98万株へと100%増加させることを決議"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不是财务建议。始终向您的财务顾问寻求专业建议\n顾问。\n\nNYSE: NCLH\n\n新闻。最近收到挪威邮轮公司的代理投票信息，内容如下\n如下。\n\n项目。\n\n 1. 选举第二类董事，被提名人Adam M Aron和Stella David和\n    Mary E Landry。\n 2....",
      "title": "NCLH 挪威投票赞成增加普通股+100%，从49万股增加到98万股"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是財務建議。始終向您的財務顧問尋求專業建議\n顧問。\n\nNYSE: NCLH\n\n新聞。最近收到挪威郵輪公司的代理投票信息，內容如下\n如下。\n\n項目。\n\n 1. 選舉第二類董事，被提名人Adam M Aron和Stella David和\n    Mary E Landry。\n 2....",
      "title": "NCLH 挪威投票贊成增加普通股+100%，從49萬股增加到98萬股"
    }
  ],
  "title": "NCLH Norwegian voting for increase of ordinary shares +100% from 490k to 980k shares",
  "created_utc": 1619427352,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not financial advice.  Always seek professional advice from your financial advisor.</p>\n\n<p>NYSE: NCLH</p>\n\n<p>News:  Recently received proxy vote information for Norwegian Cruise Lines, as follows:</p>\n\n<p>Items:</p>\n\n<ol>\n<li>Election of class II directors, nominees Adam M Aron and Stella David and Mary E Landry.</li>\n<li>Approval, on a non-binding, advisory basis, of the compensation of our named executive officers.</li>\n</ol>\n\n<p>3)approval of an increase in our authorizes share capital to increase the number of ordinary shares authorized for issuance from 490,000,000 to 980,000,000.</p>\n\n<p>4)Approval of an amendment to our 2013 Performance incentive Plan (our &quot;Plan&quot;) including an increase in the number of shares available for grand under our plan.</p>\n\n<p>5) Ratification of the appointment of PricewaterhouseCoopers LLP as our independent registered public accounting for for the year ending Dec 31 2021 and the determination of PWC remuneration by our audit committee</p>\n\n<p>So, its looking like Norwegian is looking to eventually Dilute their shares through selling more shares, adding +100%, as I read it.</p>\n\n<p>This is for the 2021 Annual General Meeting.</p>\n\n<p>Vote by May 19, 2021, 11:59 PM ET</p>\n\n<p>Edit, can s mod change title from numerical k values to MM please.</p>\n</div><!-- SC_ON -->",
  "score": 77,
  "permalink": "/r/stocks/comments/mymsoz/nclh_norwegian_voting_for_increase_of_ordinary/",
  "subreddit": "stocks",
  "id": "mymsoz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776215991
}