{
  "author": "eebarrow",
  "original_created_utc": 1659661598,
  "title": "Is it rude to put gas in/wash someone’s car after borrowing it?",
  "created_utc": 1659693042,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My car broke down so while it’s in the shop my grandma let me borrow hers. I used it for a few days, and before I returned it I filled it with gas and washed it since she didn’t ask anything if me in return. After a few hours she called me and seemed genuinely offended that I had done that, but i was always taught that it’s common courtesy. Was it rude of me to wash/fill the car? It’s what I’ve done for years and I’d hate to think I’ve been offending people for such a long time.&lt;/p&gt;\n\n&lt;p&gt;ETA: I wash it (only the outside, I don’t move/remove anything inside, and touchless if I can help it) because I work on a farm so there’s a good amount of dirt and mud by the end of the day, but after seeing y’all’s comments I’ll def make sure to ask for permission and instruction before doing that in the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/wghp7i/is_it_rude_to_put_gas_inwash_someones_car_after/",
  "subreddit": "NoStupidQuestions",
  "id": "wghp7i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My car broke down so while it’s in the shop my grandma let me borrow hers. I\nused it for a few days, and before I returned it I filled it with gas and washed\nit since she didn’t ask anything if me in return. After a few hours she called\nme and seemed genuinely offended that I had done that, but i…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の車が壊れたので、修理に出している間、おばあちゃんの車を貸してもらいました。I\n数日使って、返す前にガソリンを入れて洗車しました。\n数日使って、返す前にガソリンを入れて、何も聞かれなかったので洗車しました。数時間後、おばあちゃんから電話があり\n数時間後、おばあちゃんから電話があり、私がそんなことをしたことを怒っているようでしたが、私は...",
      "title": "人の車を借りた後、ガソリンを入れたり洗車したりするのは失礼にあたりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的车坏了，所以当它在店里的时候，我奶奶让我借她的车。I\n我用了几天，在我归还之前，我给它加了油，还洗了车。\n因为她没有要求我做任何回报。几个小时后，她给我打电话\n她给我打电话，似乎对我的做法感到非常生气，但我...",
      "title": "借用别人的车后给其加油/洗车是不礼貌的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的車壞了，所以當它在店裏的時候，我奶奶讓我借她的車。I\n我用了幾天，在我歸還之前，我給它加了油，還洗了車。\n因爲她沒有要求我做任何回報。幾個小時後，她給我打電話\n她給我打電話，似乎對我的做法感到非常生氣，但我...",
      "title": "借用別人的車後給其加油/洗車是不禮貌的嗎？"
    }
  ]
}