{
  "author": "definitely_sus",
  "original_created_utc": 1624451799,
  "title": "Racism towards African Americans - How I can better understand to support my friend",
  "created_utc": 1624511976,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I would like to apologize in advance if I am not using the correct terms or if I sound insensitive. While I understand ignorance and naivety should not be an excuse, I am a Southeast Asian where American politics and relating factors are not often talked about in-depth, or are those situations exposed to us. We do deal with our own racism issues, but that&#39;s an entirely different topic.</p>\n\n<p>Today, I am here to try to understand better about some of the dialogue regarding African Americans [black people?] in America, and specific issues they face in the corporate world.</p>\n\n<p>For context, I have an African American friend who was born and raised in America. I don&#39;t want to disclose too much information on her, but she grew up fairly in a good family and was fortunate and financially able, got into a good college, and currently has a good steady [but boring] office job. Her issues with racism are secondhand from what she has read online, and not something someone she knows has experienced. I acknowledge that even if it is anecdotal, these issues exist and are valid.</p>\n\n<p>I met her through discord a few years back, and while we did talk about more serious issues about our depression and emotional lows, we never really touched on cultural or societal issues. Due to COVID, she and I bonded more and she has started to open up more about her frustrations regarding inequalities she has heard but never experienced herself, but I am having trouble fully understanding <em>some</em> of the roots of her frustrations. Being Southeast Asian, and growing up overseas, and having many international friends, I do understand <em>some</em> aspects of racism, but they are either limited to situations and events I have experienced myself, things a friend/family experience, but primarily non-American situations which are vastly different from her own. Her experiences, from what I have been told, are so different and new that I am unable to comprehend and synthesize with, outside of &#39;she was discriminated for xxxx, that is not right&#39;. I truly, truly want to REALLY understand her struggles and frustrations and am seeking insight into specific issues, as I am unable to do so myself due to either lack of knowledge, lack of exposure, and lack of experience.</p>\n\n<p>I hope I do not come off as insensitive if I use certain terminologies in my post or replies, and will do my very best to correct myself if I do make such mistakes. But please, bear with me on my ignorance because I am trying to better myself to understand and support my friend who is dear to me.</p>\n\n<p>Topics and situations I am unable to fully understand are as below:</p>\n\n<p><strong>HAIRSTYLES:</strong></p>\n\n<p>During COVID, my friend [A] and I found a mutual obsession with John Oliver on YouTube. Recently, she shared with me the segment on &quot;Hair&quot; and how African Americans can be discriminated on having their natural hair [braids, Afros, etc] because corporations deem the style as &#39;unprofessional and unfit&#39; as they do not fit the clean corporate look. While I think this opinion is outrageous, I brought up a situation where &#39;black culture hairstyles&#39; such as braids, crown rows, and afros can be seen as cultural appropriation if people not of that race/ethnicity were to adorn them, but in contrast, it is completely acceptable for African-Americans to adorn &#39;non-cultural / nonnatural hairstyles&#39; through wigs such as straight hair, ombre hair, hair buns, etc. I brought it up with her during our one-on-one movie night when she mentioned the topic, and citing the <a href=\"https://www.polygon.com/2020/11/30/21734131/animal-crossing-space-buns-puffs-black-hairstyles-nintendo-switch\">Animal Crossing Hair issue</a>, and the <a href=\"https://sites.google.com/site/michaelkorsbagwatch/home/does-anyone-own-the-cornrow\">Michael Kors Hair Issue</a>. Both these incidents present an outcry where Black Culture is being used as an accessory / is being appropriated, and that is wrong.  As an Asian [Southeast Asian specifically], I do not view non-Asian people experiencing our culture as &#39;appropriation&#39; or &#39;insensitive&#39;. There are <em>some</em> exceptions that do bother me such as &#39;weebism&#39; and how &#39;all Asians are basically Chinese or Japanese&#39;, I have no issue if a Caucasian/non-Asian were to adorn my ethnic costume to show appreciation, even if they don&#39;t do it 100% correctly. The intent is what matters to me. An example would be many foreigners coming to Bangkok/Thailand and wearing sarongs with a tank top. It&#39;s not the <em>correct</em> attire, but they are not doing it to offend the people, and are simply trying to experience part of the culture.</p>\n\n<p>However, my friend A told me that it is just not okay for non-African Americans to attempt to have braids or cornrows or Afros, because some races are just not equal enough and therefore looked down upon and used as caricatures for a cheap &#39;fashion trend&#39;. While I can understand how blatant use of &#39;Black culture&#39; aesthetics can be frustrating if the person does not give it much thought, I don&#39;t understand her anger because if a foreigner were to try to adorn some form of cultural fashion and do it wrong, a lot of people in my country would not take offense, and appreciate the attempt while giving them constructive advice on how they can improve the attire / look next time.</p>\n\n<p><strong>MAKEUP:</strong></p>\n\n<p>Another thing I am unable to understand is makeup. She is a big KPop fan, and listen to a lot of artists in KPop. She also got really into the &#39;kpop aesthetic&#39; and has started purchasing a lot of Korean brand cosmetics and tones to adhere to that aesthetic. I do not share her aesthetics with the Kpop makeup, but she often mention the Instagram accounts of makeup artists that do that makeup she likes, while complaining about Instagram accounts that do &#39;blackfish&#39;, where non-African Americans present themselves as that even though they are not. While I understand Blackface isn&#39;t acceptable due to the fact it was used as comic relief &#39;dumbed down&#39; characters to fit a certain profile, I do not see the issue of trying to pass off as a certain aesthetic because you like the look. A lot of non-Korean people adore the Korean-makeup aesthetic because that is what they like, and they just like how it looks without making a joke out of it. I do not understand how that is different from &#39;blackfishing&#39; purely in the makeup and aesthetic realm. As long as the person isn&#39;t pretending to be &#39;black&#39;, what is the issue?</p>\n\n<p><strong>CLOTHES AND ACCESSORIES:</strong></p>\n\n<p>My friend visited me before COVID, as did a few others. I took them around my country, and they wore each cities&#39; cultural/ethnic attire. I have no issue with it and while there arere many mistakes and awkwardness, and behavioral issues at religious places [pagodas], they listened to my advice and things were well. After the visit, they left for their respective countries, and the other friends except for A] sent me little gifts from their country, ranging from food to accessories like necklaces and clothing items, like plain fabric. I treasure all of them and make them into dresses, tops, or skirts, but A did not. I am not bothered that she didn&#39;t give me a gift, but more so by her reasoning, which was that &#39;she did not want her culture as some show pony or something I could just have as a display item&#39;. I do not think I protrayed that intent, nor did I as for gifts, but I felt as though I was being a bad friend by making her feel that way. However, the other part of me felt as though it was hypocritical, because she made a mini-skirt and a date outfit [very short dress] out of our ethnic pattern bought at an ethnical store. I do not care what she does with the fabric, but am bothered by her perception and accusation.</p>\n\n<p>So Reddit, how do I better understand my friend? I do think there is some cultural differences that is preventing me from truly understanding her. I do not want to know who is &#39;right or wrong&#39; or whtaeer, but would like some insight into variables I am obviously missing. I do not know where to really start the process of understanding, but I hope the above information provided some cope of understanding and the disconnect I have felt.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TrueAskReddit/comments/o6bxtn/racism_towards_african_americans_how_i_can_better/",
  "subreddit": "TrueAskReddit",
  "id": "o6bxtn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I would like to apologize in advance if I am not using the correct terms or if I\nsound insensitive. While I understand ignorance and naivety should not be an\nexcuse, I am a Southeast Asian where American politics and relating factors are\nnot often talked about in-depth, or are those situations…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし私が正しい用語を使っていなかったり、無神経な言い方をしていたら、あらかじめお詫びしておきます。\n無神経に聞こえたら、ごめんなさい。無知や世間知らずを言い訳にしてはいけないことは理解していますが\n私は東南アジア人ですが、アメリカの政治やそれに関連する要素については、あまり深く語られることはありません。\n私は東南アジア人ですが、アメリカの政治やそれに関連する要素について深く語られることはあまりありませんし、そのような状況は...。",
      "title": "アフリカ系アメリカ人に対する人種差別 - 友人をサポートするためにどう理解を深めるか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我没有使用正确的术语或如果我听起来不敏感，我想提前道歉。\n听起来很不敏感。虽然我知道无知和天真不应该是一个借口。\n我是一个东南亚人，在那里，美国的政治和相关因素并不经常被深入谈论。\n我是一个东南亚人，美国的政治和相关因素并不经常被深入谈论，或者说这些情况...",
      "title": "对非裔美国人的种族主义--我如何更好地理解以支持我的朋友"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我沒有使用正確的術語或如果我聽起來不敏感，我想提前道歉。\n聽起來很不敏感。雖然我知道無知和天真不應該是一個藉口。\n我是一個東南亞人，在那裏，美國的政治和相關因素並不經常被深入談論。\n我是一個東南亞人，美國的政治和相關因素並不經常被深入談論，或者說這些情況...",
      "title": "對非裔美國人的種族主義--我如何更好地理解以支持我的朋友"
    }
  ]
}