{
  "author": "EgoPoweredDreams",
  "the_new_excerpt": "Let’s get the elephant in Spotify’s room out of the way first, namely Apple\nMusic. While Apple is a formidable competitor, they’re second in the race by a\nlarge margin: Spotify sits at 144M subscribers and Apple sits around 60M (likely\ncloser to 70M by now). Despite the services being available in…",
  "original_created_utc": 1615317536,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们先把Spotify的大象说出来，即苹果公司\n音乐。虽然苹果是一个强大的竞争对手，但他们在这场竞争中以第二位的\n大的幅度。Spotify的用户数为1.44亿，苹果的用户数约为6000万（可能是\n现在已经接近70M了）。) 尽管服务在...",
      "title": "Spotify（SPOT）DD。处于盈利边缘的老牌公司，交易市盈率相对行业较低。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們先把Spotify的大象說出來，即蘋果公司\n音樂。雖然蘋果是一個強大的競爭對手，但他們在這場競爭中以第二位的\n大的幅度。Spotify的用戶數爲1.44億，蘋果的用戶數約爲6000萬（可能是\n現在已經接近70M了）。) 儘管服務在...",
      "title": "Spotify（SPOT）DD。處於盈利邊緣的老牌公司，交易市盈率相對行業較低。"
    }
  ],
  "title": "Spotify (SPOT) DD. Established company on the brink of profitability, trading at a low P/S relative to the industry.",
  "created_utc": 1615321296,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let’s get the elephant in Spotify’s room out of the way first, namely Apple Music. While Apple is a formidable competitor, they’re second in the race by a large margin: Spotify sits at 144M subscribers and Apple sits around 60M (likely closer to 70M by now). Despite the services being available in roughly the same number of countries (APM:167, Spotify:170), <strong>Spotify’s been able to capture much more subscriber growth thanks to a few aggressive expansions.</strong></p>\n\n<p>&#x200B;</p>\n\n<p>You’ve definitely heard of Spotify’s aggressive podcast expansions, including JRE exclusivity and new originals/exclusives such as Michelle Obama’s podcast. This expansion led Spotify to <strong>surpass Apple’s podcast numbers just barely in 2020, with analysts expecting 41% growth in 2021</strong>. Analysts expect that 53.9% of ‘digital audio listeners’ will be podcast listeners in 2021. Spotify’s continuing to expand in this space to meet upstart competitor Clubhouse, by testing paid podcast subscriptions that allow for interactivity. (side note, I’d be interested to know if they’re trying to compete with twitch here too)</p>\n\n<p>&#x200B;</p>\n\n<p>A newer expansion on Spotify’s part is their recent foray into audiobooks. It appears that they’re sticking to public domain works for now to test the waters, but moving forwards, this could create a real challenge to competitors like Audible, a company with an estimated $2.5B in revenue in 2020 and no real competitors. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Spotify’s been aggressively pursuing developing markets</strong>, which has a negative impact on financials in the short term but could lead to greater profitability in the future.  The reason is that they charge lower rates in developing markets in order to build a subscriber base and a presence. </p>\n\n<p>&#x200B;</p>\n\n<p>Onto some quick financial stats. (figures in EUR) </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Spotify’s 2020 revenue clocks in at 7.3B, and a 47.7B mkt cap, which works out to a P/S ratio of 6.53.</strong> </p>\n\n<p>&#x200B;</p>\n\n<p>Personally, I like to value companies in the context of competitors … which is sort of hard to do for spotify. I’d argue Netflix is the most comparable (software, digital media, subscriber model), and their P/S ratio sits at 8.96. Twitter’s a bit of a stretch, but their P/S ratio sits at 13.5: Adobe, another stretch but closer imo as it’s subscription-based software, sits at 15.9.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Spotify’s debt/equity ratio is on a downward trend, sitting at 1.26. It’s got a forwards CAGR of 22%.</strong> </p>\n\n<p>&#x200B;</p>\n\n<p>The biggest red flag I see on their balance sheet has to do with their <strong>cost of revenue: it’s been increasing almost in lock-step with revenue. Spotify’s very close to being profitable, and they’ve posted a profit for some quarters (though never a full year).</strong> Spotify’s under good management, however, and I’m confident that once their more aggressive expansions mature, profit will follow, especially as they’ve proved they can stave off competitors like Apple. </p>\n\n<p>&#x200B;</p>\n\n<p>On a valuation play alone, I’d argue Spotify is better suited to a <strong>P/S of at least NFLX,</strong> which would place it at <strong>$375/sh</strong>. With growth taken into account -- that the firm is estimated to grow at 22%, and is well-positioned globally against competitors -- I’d argue a more accurate P/S would place it <strong>closer to 10 P/S</strong>, putting SPOT at <strong>$418/sh</strong>. <sup>(these P/S ratios are gargantuan, but that’s true for the tech sector in general; my argument is that spotify’s undervalued in the context of the current market.</sup>)</p>\n\n<p>&#x200B;</p>\n\n<p>I don’t really do deep dives into companies this much, so let me know where I might’ve gone wrong in analyzing the company (especially if I missed something in the balance sheet).</p>\n</div><!-- SC_ON -->",
  "score": 1755,
  "permalink": "/r/investing/comments/m1dxar/spotify_spot_dd_established_company_on_the_brink/",
  "subreddit": "investing",
  "id": "m1dxar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575834
}