{
  "author": "Wolf9574",
  "original_created_utc": 1624349623,
  "title": "Calling dips and crashes sales and discounts is encouraging people to catch falling knives.",
  "created_utc": 1624386686,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every day posts like these seem to get more desperate. When ETH was 2500 it was a great sale, now 1900 is a discount and great buying opportunity. </p>\n\n<p>Stop deluding yourselves. Crypto is falling in value and nobody really knows when its going to go up again, it could take months, it could take years.</p>\n\n<p>If you’re going to buy an assest currently bleeding value thats fine but accept that its a risky play and stop this HODL, BUY BUY BUY, bs that just makes it obvious you’re bag holding and cant deal with the unrealised loss.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/o5hwqt/calling_dips_and_crashes_sales_and_discounts_is/",
  "subreddit": "CryptoCurrency",
  "id": "o5hwqt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every day posts like these seem to get more desperate. When ETH was 2500 it was\na great sale, now 1900 is a discount and great buying opportunity.\n\nStop deluding yourselves. Crypto is falling in value and nobody really knows\nwhen its going to go up again, it could take months, it could take…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "日に日にこのような投稿が増え、必死さが伝わってきます。ETHが2500の時は大安売りだった。\nETHが2500の時は大安売りで、今は1900が割安で絶好の買い場です。\n\n自分を騙すのはやめよう。暗号は価値が下がっていて、いつまた上がるかは誰にもわかりません。\n数ヶ月かかるかもしれませんし、...かかるかもしれません。",
      "title": "ディップやクラッシュセール、ディスカウントを呼びかけることは、落ちてくるナイフをキャッチすることを促すことになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "像这样的帖子每天似乎都会变得更加令人绝望。当ETH是2500时，它是\n的时候，它是一个伟大的销售，现在1900是一个折扣和伟大的购买机会。\n\n不要再自欺欺人了。加密货币的价值正在下降，没有人真正知道\n它何时会再次上涨，可能需要几个月，可能需要...",
      "title": "呼叫降价和崩溃的销售和折扣是在鼓励人们去抓落刀。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像這樣的帖子每天似乎都會變得更加令人絕望。當ETH是2500時，它是\n的時候，它是一個偉大的銷售，現在1900是一個折扣和偉大的購買機會。\n\n不要再自欺欺人了。加密貨幣的價值正在下降，沒有人真正知道\n它何時會再次上漲，可能需要幾個月，可能需要...",
      "title": "呼叫降價和崩潰的銷售和折扣是在鼓勵人們去抓落刀。"
    }
  ]
}