{
  "author": "NotRoryWilliams",
  "original_created_utc": 1648582186,
  "title": "Is there such a thing as a technology historian? I have some odd questions about the history of computers.",
  "created_utc": 1648637783,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My specific question, on the off chance such a person exists and follows this forum, is how operating systems were able to accommodate so many diverse hardware configurations among early computers, specifically Apple II and classic Macintosh platforms, where there existed a host of “upgrade cards” that added memory, graphics, and even processor upgrades through expansion bus products. I understand the basic principle of “device driver” software components, but it’s just boggling my mind how it was possible for software to run with acceptable and even sometimes impressive performance with things like coprocessors and expansion boards before the invention of modern “threading” tech - or was that concept actually in place all along and just not discussed in the same terms?&lt;/p&gt;\n\n&lt;p&gt;I feel like this may be more of a “tech” question than a classic “history” question in the spirit of this subreddit, though, so I would be happy if someone could just point me to the right place to ask this question.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/trfavz/is_there_such_a_thing_as_a_technology_historian_i/",
  "subreddit": "AskHistorians",
  "id": "trfavz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My specific question, on the off chance such a person exists and follows this\nforum, is how operating systems were able to accommodate so many diverse\nhardware configurations among early computers, specifically Apple II and classic\nMacintosh platforms, where there existed a host of “upgrade cards”…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "具体的な質問ですが、万が一そのような方がいて、このサイトをご覧になっているのであれば\nこのフォーラムでは、どのようにしてオペレーティング・システムが、多様な\n初期のコンピュータ、特にApple IIやクラシックなコンピュータのハードウェア構成が\nMacintoshのプラットフォームでは、「アップグレードカード」が多数存在し......。",
      "title": "技術史家というのはいるのでしょうか？コンピュータの歴史について、妙な疑問がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的具体问题是，如果有这样一个人存在并关注这个论坛的话\n我的具体问题是，如果有这样的人存在并关注这个论坛，那么操作系统是如何能够适应早期那么多不同的\n在早期的计算机中，特别是在Apple II和经典的Macintosh平台上，操作系统是如何适应这么多不同的硬件配置的？\nMacintosh平台，那里存在着大量的 \"升级卡\"......",
      "title": "有这样一个技术历史学家吗？我对计算机的历史有一些奇怪的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的具體問題是，如果有這樣一個人存在並關注這個論壇的話\n我的具體問題是，如果有這樣的人存在並關注這個論壇，那麼操作系統是如何能夠適應早期那麼多不同的\n在早期的計算機中，特別是在Apple II和經典的Macintosh平臺上，操作系統是如何適應這麼多不同的硬件配置的？\nMacintosh平臺，那裏存在着大量的 \"升級卡\"......",
      "title": "有這樣一個技術歷史學家嗎？我對計算機的歷史有一些奇怪的問題。"
    }
  ]
}