{
  "author": "x--BANKS--x",
  "the_new_excerpt": "It’s clear the narrative of the market right now is about the rotation from\ngrowth to value stocks. There are going to be a lot of fearful investors moving\ntheir money, and a lot of fund managers buying up value stocks to please their\nskittish customers.\n\nSo I started looking for stocks with a low…",
  "original_created_utc": 1615175493,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很显然，现在市场的说法是关于轮动从。\n成长股到价值股。将会有很多恐惧的投资者移居\n他们的钱，和很多基金经理买入价值股，以取悦他们的。\n敏感的客户。\n\n所以我开始寻找低价股...",
      "title": "成长到价值的轮动。这里有一批价值型股票可以从中受益"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很顯然，現在市場的說法是關於輪動從。\n成長股到價值股。將會有很多恐懼的投資者移居\n他們的錢，和很多基金經理買入價值股，以取悅他們的。\n敏感的客戶。\n\n所以我開始尋找低價股...",
      "title": "成長到價值的輪動。這裏有一批價值型股票可以從中受益"
    }
  ],
  "title": "The Growth-to-Value Rotation: Here’s a bunch of value stocks that could benefit",
  "created_utc": 1615216519,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s clear the narrative of the market right now is about the rotation from growth to value stocks. There are going to be a lot of fearful investors moving their money, and a lot of fund managers buying up value stocks to please their skittish customers. </p>\n\n<p>So I started looking for stocks with a low P/E ratio and the highest StarMine scores. StarMine is a scoring system used on Fidelity and some other brokers which uses an aggregate of analyst ratings. In other words, these stocks are universally rated buy and a likely target of cautious investors, and their low P/E puts them into the value basket. I’m not trying to get complicated. I’m looking for undervalued stocks with mainstream surface appeal. </p>\n\n<p>(Important to note that I am not saying StarMine scores are an accurate ranking of stocks, but only that I&#39;m using them a proxy for where mainstream money will go during this rotation.)</p>\n\n<p>The first group is what I’ll call Value Boomer Bait:</p>\n\n<ul>\n<li>StarMine Equity Score of 9.1 or higher</li>\n<li>Consumer discretionary company with a household name<br/></li>\n<li>P/E ratio below 18</li>\n</ul>\n\n<p>This gives you four good leads:</p>\n\n<ul>\n<li>WILLIAMS-SONOMA (WSM)</li>\n<li>AUTONATION (AN)</li>\n<li>JACK IN THE BOX (JACK)</li>\n<li>1-800-FLOWERS.COM (FLWS)</li>\n</ul>\n\n<p>Two similar leads without household names are AMERICA&#39;S CAR-MART (CRMT) and HAVERTY FURNITURE (HVT).</p>\n\n<p>The second group of obvious value stocks I found are some undervalued recreational boating companies with steady growth. ONEWATER MARINE (ONEW) and MARINEMAX (HZO) are high-end boat retailers, both with a StarMine score of 9.7, both with a P/E ratio of 11.9, and both with steady growth that was unaffected by the market sell-off. You can also look at BRUNSWICK CORP (BC), a manufacturer of boat components, which has a StarMine score of 9.4 and a P/E of 19.3. </p>\n\n<p>A lot of people have been looking at homebuilding recently, so here’s the homebuilders with a StarMine Score of 9.1 or higher and a P/E below 12:</p>\n\n<ul>\n<li>GREEN BRICK PARTNERS (GRBK)</li>\n<li>CENTURY COMMUNITIES (CCS)</li>\n<li>BEAZER HOMES USA (BZH)</li>\n</ul>\n\n<p>And finally, here is a list of the top StarMine Equity Score by each sector, so I’m guessing you’ll see inflows into each of these:</p>\n\n<p>Comm. Serv.</p>\n\n<ul>\n<li>8.7 LUMN Lumen</li>\n</ul>\n\n<p>Cons. Disc.</p>\n\n<ul>\n<li>10.0 ASO Academy</li>\n</ul>\n\n<p>Cons. Stap.</p>\n\n<ul>\n<li>9.8 BG Bunge </li>\n</ul>\n\n<p>Energy</p>\n\n<ul>\n<li>9.2 DVN Devon Energy</li>\n</ul>\n\n<p>Financials</p>\n\n<ul>\n<li>10.0 SF Stifel Financial </li>\n</ul>\n\n<p>Health Care</p>\n\n<ul>\n<li>9.8 HOLX Hologic </li>\n</ul>\n\n<p>Industrials</p>\n\n<ul>\n<li>10.0 ATKR Atkore</li>\n</ul>\n\n<p>Info. Tech.</p>\n\n<ul>\n<li>10.0 LOGI Logitech</li>\n</ul>\n\n<p>Materials</p>\n\n<ul>\n<li>9.7 Tronox</li>\n</ul>\n\n<p>Real Estate</p>\n\n<ul>\n<li>9.8 IIPR Innovative Ind Properties</li>\n</ul>\n\n<p>Utilities</p>\n\n<ul>\n<li>8.7 AY Atlantica</li>\n</ul>\n\n<p>Obviously this is just a starting point for capturing the mainstream money, but I think there are some good buys here if you want to add value stocks. Or you could throw a dart and pick any of about 30 financial stocks that are universally rated buy. My picks are: </p>\n\n<ul>\n<li>ROYAL CANADIAN (RY, 9.4 StarMine, 11 P/E)</li>\n<li>CANADIAN IMPERIAL BANK (CM, 9.4 StarMine, 10 P/E)</li>\n<li>ENSTAR GROUP (ESGR, 10.0 StarMine, 3 P/E)</li>\n<li>VIRTU (VIRT, 9.9 StarMine, 5 P/E)</li>\n</ul>\n\n<p>I don&#39;t own any of these yet, but I&#39;m going to do some more research tonight and pick a basket of them for Monday morning. Good luck everyone and happy hunting.</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/stocks/comments/m074gu/the_growthtovalue_rotation_heres_a_bunch_of_value/",
  "subreddit": "stocks",
  "id": "m074gu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542577949
}