{
  "author": "greencoffeemonster",
  "the_new_excerpt": "How long did it take before you started to understand what you're actually\ndoing? How long before you understood how it all works and what to look at when\nconsidering a stock? Am I the only one struggling to grasp how this works? I\ndon't even know what information to look for when doing DD.\n\nPlease…",
  "original_created_utc": 1613566490,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你花了多长时间才开始明白你到底在做什么？\n在做什么？多久之后，你才明白这一切是如何运作的，以及当\n考虑买股票？难道只有我一个人在努力掌握这一切是如何运作的吗？I\n做DD时都不知道要看什么资料。\n\n请你...",
      "title": "什么时候才会变得简单？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你花了多長時間纔開始明白你到底在做什麼？\n在做什麼？多久之後，你才明白這一切是如何運作的，以及當\n考慮買股票？難道只有我一個人在努力掌握這一切是如何運作的嗎？I\n做DD時都不知道要看什麼資料。\n\n請你...",
      "title": "什麼時候纔會變得簡單？"
    }
  ],
  "title": "When does it get easier?",
  "created_utc": 1613576393,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How long did it take before you started to understand what you&#39;re actually doing? How long before you understood how it all works and what to look at when considering a stock? Am I the only one struggling to grasp how this works? I don&#39;t even know what information to look for when doing DD. </p>\n\n<p>Please tell me I&#39;ll &quot;get it&quot; one day. I desperately want to participate in the game and secure my future, but I&#39;m mostly just overwhelmed by the losses. (So much losses)</p>\n\n<p>I already started out by using Robinhood, which in hindsight was a terrible idea. </p>\n\n<p>The worst thing of it all, I try to learn by reading and watching YouTubers who appear to know their ish, but I don&#39;t even understand what they&#39;re saying. </p>\n\n<p>Please tell me I&#39;m not the only one who started out confused and afraid. And please tell me how you learned.</p>\n\n<p>Sincerely, \nDumbass</p>\n</div><!-- SC_ON -->",
  "score": 255,
  "permalink": "/r/stocks/comments/lltvdh/when_does_it_get_easier/",
  "subreddit": "stocks",
  "id": "lltvdh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625103
}