{
  "author": "djuro94",
  "original_created_utc": 1635098026,
  "title": "Don't stop believing in good project because of shitcoins pump",
  "created_utc": 1635168677,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last few days we could see shitcoin shiba inu pump like crazy. That is coin that has nothing behind it. It&#39;s price is hype driven, but hype will disappear eventually like it did in doge&#39;s case. So if you are considering to sell your bags of good coins to fomo into shiba don&#39;t. Even if it continues to pump it can maybe reach 2-3x more but that  would already be enormous marketcap. But when hype disappears people will start buying good project like the ones you own and you will earn much more than on shiba. This is simply how things go. We have to go through this phase of a bull market and wait for the next one where thing are going to be much better.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/qex9u0/dont_stop_believing_in_good_project_because_of/",
  "subreddit": "CryptoCurrency",
  "id": "qex9u0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Last few days we could see shitcoin shiba inu pump like crazy. That is coin that\nhas nothing behind it. It's price is hype driven, but hype will disappear\neventually like it did in doge's case. So if you are considering to sell your\nbags of good coins to fomo into shiba don't. Even if it continues…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、我々はshitcoin shiba inuが狂ったように上昇するのを見ることができた。これは何の裏付けもないコイン\n何の裏付けもないコインです。その価格は誇大広告によるものですが、誇大広告はいずれ消えます。\ndogeの場合のように、いずれは消えてしまいます。なので、もしあなたが自分のバッグの中の良いコインを\nそのため、もしあなたが自分の持っている良いコインのバッグを売って柴にフォモしようと考えているなら、やめておきましょう。たとえそれが続いても...。",
      "title": "糞コインポンプのために、良いプロジェクトを信じることをやめないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几天里，我们可以看到狗屎币shiba inu疯狂地抽水。那是一种\n它背后没有任何东西。它的价格是由炒作驱动的，但炒作会消失\n最终会像Doge的情况一样。因此，如果你正在考虑出售你的\n袋子里的好币去炒作shiba，不要。即使它继续...",
      "title": "不要因为狗屎币泵而停止对好项目的信仰"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾天裏，我們可以看到狗屎幣shiba inu瘋狂地抽水。那是一種\n它背後沒有任何東西。它的價格是由炒作驅動的，但炒作會消失\n最終會像Doge的情況一樣。因此，如果你正在考慮出售你的\n袋子裏的好幣去炒作shiba，不要。即使它繼續...",
      "title": "不要因爲狗屎幣泵而停止對好項目的信仰"
    }
  ]
}