{
  "author": "moneymaker991",
  "original_created_utc": 1639330865,
  "title": "Is it weird to become aroused by yourself?",
  "created_utc": 1639367355,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I sometimes get a little bit aroused from myself. Like when I’m about to get into the shower, I look at the mirror and become slightly aroused. I’m not like fully turned on or anything, though. But I can bust out a load just looking at a mirror. It usually comes in waves, though. I get pretty turned on from seeing myself naked, then I’ll bust out a load to myself, then not be turned on by myself for about another 6 months then I start getting aroused from seeing myself naked and just stand by a mirror looking over my body. I’m pretty much fully straight too&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/retzco/is_it_weird_to_become_aroused_by_yourself/",
  "subreddit": "NoStupidQuestions",
  "id": "retzco",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I sometimes get a little bit aroused from myself. Like when I’m about to get\ninto the shower, I look at the mirror and become slightly aroused. I’m not like\nfully turned on or anything, though. But I can bust out a load just looking at a\nmirror. It usually comes in waves, though. I get pretty…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分から少し興奮することもあります。例えば、これから\nシャワーを浴びるとき、鏡を見て少し興奮するんです。という感じではありません。\nでも、完全にスイッチが入っているわけではありません。でも、見ているだけで、ドバっと出ちゃうんです。\n鏡です。だいたい波があるんですけどね。私はかなり...",
      "title": "自分で興奮するのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有时会从自己身上得到一点刺激。比如当我即将进入\n淋浴时，我看着镜子，变得有点兴奋。我并不像\n完全打开或任何东西，虽然。但我只要看着镜子，就能爆发出一股力量。\n镜子。不过，它通常是一波接一波的。我变得很...",
      "title": "被自己唤起的感觉很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有時會從自己身上得到一點刺激。比如當我即將進入\n淋浴時，我看着鏡子，變得有點興奮。我並不像\n完全打開或任何東西，雖然。但我只要看着鏡子，就能爆發出一股力量。\n鏡子。不過，它通常是一波接一波的。我變得很...",
      "title": "被自己喚起的感覺很奇怪嗎？"
    }
  ]
}