{
  "author": "Iiau_",
  "original_created_utc": 1628190005,
  "title": "Story: I had 50k moons, but I sold it all for 10 cents, traded with shitcoins and I now end up with only $300.",
  "created_utc": 1628202643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wall of text time.</p>\n\n<p>I know what you&#39;re thinking. The title sounds hilarious, but it&#39;s actually true.</p>\n\n<p>Back when Moons were a Rinkeby token with an xDai equivalent, when it peaked a few months back at around 15 cents, I decided to sell all of them. I turned all of them into BNB, and traded with that on PancakeSwap.</p>\n\n<p>Now, originally, I had success. Of course I decided to stray away from dog coins or safe coins and the like. But I found some decent BSC projects that I have, unsurprisingly, done DYOR on. I had $5k, and it peaked to about $10k. I had bought several obscure crypto, such as ALPACA and BUNNY. Great. I sold all of them. I was considering consolidating them all to Ethereum until I decided to get greedy. Sadly this was the case. This was just before the Elon dump.</p>\n\n<p>I thought I could somehow keep going and try $20k. So I bought 2 <em>much more obscure</em> tokens. <a href=\"https://www.coingecko.com/en/coins/pancaketools\">TCAKE</a> and <a href=\"https://www.coingecko.com/en/coins/growing-fi\">GROW</a>. TCAKE was a BSC charting app and GROW was a yield farm that gave BNB to holders.</p>\n\n<p>As Bitcoin dumped from 64k to 30k in months, I had all in on TCAKE. This crypto was at its peak in $0.15, and it crashed from $0.10 to $0.05. I dare say this was an amazing dip buying opportunity, and bought. But no. It went from $0.05 to $0.01. So I was left with just $2k.</p>\n\n<p>I decided, well that sucks, but hey. That&#39;s the world of shitcoins. TCAKE was pretty much dead, and I was right, the price went to $0.005 today. Better move on.</p>\n\n<p>So I went to GROW, which had an ATH of $420. GROW, here&#39;s the problem. As all yield farms are highly inflationary, they&#39;re doomed to fail very quickly. But everyone was highly enticed by its BNB rewards so I thought it&#39;d pump. So I went and bought it when it heavily dipped to $80. Well, right now it sits at $12. You guessed it, my value is now at $300.</p>\n\n<p>What if, I had kept the 50k in moons? I would have a whopping $16k.</p>\n\n<p>The world of shitcoins is much more dangerous than you think. It&#39;s fun to dabble with little cash but stay and you will get crushed hard eventually.</p>\n\n<p>Just stick with the top 100, especially coins like BTC and ETH when you know they&#39;ll never die, and any extra tokens like moons, just HODL and not trade.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/GBTr7VhbdfFZP27iKmwQJW1bgJARwbtc14UXhz1RRBA.jpg?auto=webp&s=ffcc496285142edb699c770439653d0e89ee678b",
          "width": 250,
          "height": 250
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/GBTr7VhbdfFZP27iKmwQJW1bgJARwbtc14UXhz1RRBA.jpg?width=108&crop=smart&auto=webp&s=5844aa100aa20f4c9f12fc8d3a659e0ba483f941",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/GBTr7VhbdfFZP27iKmwQJW1bgJARwbtc14UXhz1RRBA.jpg?width=216&crop=smart&auto=webp&s=eeaefd039ca27a3acb038f0f244da5be64eb5803",
            "width": 216,
            "height": 216
          }
        ],
        "variants": {},
        "id": "aq-EVS8rz9CYdzcXSCiIajpqoa_aYhCu7w0FcsLDBec"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/oyp7tn/story_i_had_50k_moons_but_i_sold_it_all_for_10/",
  "subreddit": "CryptoCurrency",
  "id": "oyp7tn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Wall of text time.\n\nI know what you're thinking. The title sounds hilarious, but it's actually true.\n\nBack when Moons were a Rinkeby token with an xDai equivalent, when it peaked a\nfew months back at around 15 cents, I decided to sell all of them. I turned all\nof them into BNB, and traded with that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Wall of text time.\n\nあなたの考えていることはわかります。このタイトルは滑稽に聞こえますが、実際にそうなのです。\n\nムーンがRinkebyトークンでxDai相当だった頃、数ヶ月前のピーク時には15セントくらいになっていました。\n数ヶ月前のピーク時には15セントくらいになっていたので、全部売ろうと思いました。私はすべての\nBNBに変えて、それで取引していました。",
      "title": "ストーリー 私は50Kのムーンを持っていましたが、10セントで全てを売り、シットコインで取引した結果、今では300ドルしか持っていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "文字墙时间。\n\n我知道你在想什么。这个标题听起来很搞笑，但实际上是真的。\n\n当月球是一个与xDai相当的Rinkeby代币时，当它在几个月前达到顶峰时\n几个月前在15美分左右时，我决定把它们全部卖掉。我把所有的\n变成BNB，然后用它进行交易......",
      "title": "故事。我有5万个月亮，但我以10美分的价格全部卖掉了，用狗屎币交易，现在我最终只有300美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "文字牆時間。\n\n我知道你在想什麼。這個標題聽起來很搞笑，但實際上是真的。\n\n當月球是一個與xDai相當的Rinkeby代幣時，當它在幾個月前達到頂峯時\n幾個月前在15美分左右時，我決定把它們全部賣掉。我把所有的\n變成BNB，然後用它進行交易......",
      "title": "故事。我有5萬個月亮，但我以10美分的價格全部賣掉了，用狗屎幣交易，現在我最終只有300美元。"
    }
  ]
}