{
  "author": "Gloomy_Vermicelli_62",
  "original_created_utc": 1632146696,
  "title": "Once again, it’s a correction... not a ‘flash crash’.",
  "created_utc": 1632209538,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s a correction, not “the type of dump that prevents mass adoption”</p>\n\n<p>Obviously, some of you have been in this game longer than others, and for those that bought during that last ATH, I know times have been difficult. It is always a struggle to be powerless, to see losses and feel the pressure, but I beg you please, just hold your hands tight around those diamonds and have faith!</p>\n\n<p>Please know, that experiment is over. All the doubts and fears now, are merely projections... tissue paper that burns up in the flames of progress. Cryptocurrency is here to stay. The adoption is already happening en masse and the expansion of this innovative sphere will be inevitable.</p>\n\n<p>The markets seem to suffer today when you look closely, and it looks pretty grim. However, everything is cycles within cycles, so when you expand out, you realize this is a healthy stimulative trimming of excesses. Massive market collapses, caused by the implosion of a Ponzi scam in the Asian housing sphere, is forcing many to panic worldwide. Liquidations absorb tremendous value and fear always follows.</p>\n\n<p>However, that money lost was never supposed to be there in the first place. It was air leveraged into existence. During a correction, the leveraged positions and any short term traders, get scraped away or sell, like pruning a tree. </p>\n\n<p>I like to think of the support floor by using the metaphor of a fighter. If you’re ever in a fight and you’re not doing too well, sometimes the best thing you can do is fall down to a knee and put your hands on the earth. Then, you breathe for a moment and you get back up, with the power needed to strike with a furious blow! This furious blow is the next ATH.</p>\n\n<p>The market has been brought to its knees, and it’s breathing deeply, but it’s gathering the power of that support and it’s going to use it like Mike Tyson’s uppercut. Don’t fret. Buy the dip. And HODL!</p>\n\n<p>Mentioning your buys during this dip and the most positive perspectives on market correction, automatically get upvoted! And the best comments get awards!</p>\n\n<p>TL:DR - “Crypto is here to stay”</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/prvkun/once_again_its_a_correction_not_a_flash_crash/",
  "subreddit": "CryptoCurrency",
  "id": "prvkun",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s a correction, not “the type of dump that prevents mass adoption”\n\nObviously, some of you have been in this game longer than others, and for those\nthat bought during that last ATH, I know times have been difficult. It is always\na struggle to be powerless, to see losses and feel the pressure, but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "訂正です。\"大量採用を妨げるタイプの捨て台詞 \"ではありません。\n\n明らかに、皆さんの中には他の人よりも長くこのゲームに参加している人がいます。\n前回のATHで購入された方にとっては、大変な時期だったと思います。それは常に\n損失を目の当たりにしてプレッシャーを感じ、無力感に苛まれるのはいつものことですが・・・。",
      "title": "もう一度言いますが、これは修正です...「フラッシュ・クラッシュ」ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一种纠正，而不是 \"阻止大规模采用的倾销类型\"\n\n很明显，你们中的一些人在这个游戏中的时间比其他人长，对于那些在上一次ATH期间买入的人来说，我知道时间很困难。\n的人来说，我知道时代已经很困难了。这始终是\n无力的挣扎，看到损失和感受到压力，但是......",
      "title": "再一次，这是一次修正......而不是 \"闪电崩盘\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一種糾正，而不是 \"阻止大規模採用的傾銷類型\"\n\n很明顯，你們中的一些人在這個遊戲中的時間比其他人長，對於那些在上一次ATH期間買入的人來說，我知道時間很困難。\n的人來說，我知道時代已經很困難了。這始終是\n無力的掙扎，看到損失和感受到壓力，但是......",
      "title": "再一次，這是一次修正......而不是 \"閃電崩盤\"。"
    }
  ]
}