{
  "author": "SkepticalCryptoDude",
  "original_created_utc": 1652318832,
  "title": "What alts do you see surviving the bear market?",
  "created_utc": 1652333743,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Unless your Patrick from SpongeBobs roommate, you’ve noticed that the crypto is getting absolutely nuked right now. I know everyone is saying “Just invest in BTC/ETH.” I get it. Those are safer and have less volatility.&lt;/p&gt;\n\n&lt;p&gt;Truthfully, I’m not looking for safety. I’ll go to the stock market for that. I’m also not looking for low caps either. What alts in the top 100 do you see surviving the bear market? Alts are where the true money will be made going forward. Do I think you can make good money in BTC and ETH still? Absolutely, but unless you have a ton invested your returns might not be life changing. I suppose it really depends on your goals. &lt;/p&gt;\n\n&lt;p&gt;I think more projects will survive than people think, especially projects with mid sized market caps, good teams, strong fundamentals, solid tech and real world utility.&lt;/p&gt;\n\n&lt;p&gt;What alts are you confident in?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/unparj/what_alts_do_you_see_surviving_the_bear_market/",
  "subreddit": "CryptoCurrency",
  "id": "unparj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Unless your Patrick from SpongeBobs roommate, you’ve noticed that the crypto is\ngetting absolutely nuked right now. I know everyone is saying “Just invest in\nBTC/ETH.” I get it. Those are safer and have less volatility.\n\nTruthfully, I’m not looking for safety. I’ll go to the stock market for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スポンジボブのルームメイトのパトリックでない限り、暗号が今、完全に核攻撃を受けていることに気づいているはずだ。\n今、絶対的に核兵器化されていることに気づいているはずだ。誰もが「BTC/ETHに投資すればいい」と言っているのは知っています。\nBTC/ETHに投資すればいい\" 私はそれを取得します。その方が安全だし、ボラティリティも低い。\n\n正直なところ、私は安全性を求めているわけではありません。私は株式市場に行くつもりです...",
      "title": "ベアマーケットで生き残るアルトは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除非你是海绵宝宝的室友帕特里克，否则你已经注意到，加密货币正在\n你已经注意到加密货币现在绝对被核销了。我知道每个人都在说 \"只要投资于\nBTC/ETH\"。我明白。这些都是比较安全的，而且波动性小。\n\n说实话，我不是在寻找安全。我会去股票市场寻找...",
      "title": "你认为哪些代理人能在熊市中生存下来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除非你是海綿寶寶的室友帕特里克，否則你已經注意到，加密貨幣正在\n你已經注意到加密貨幣現在絕對被覈銷了。我知道每個人都在說 \"只要投資於\nBTC/ETH\"。我明白。這些都是比較安全的，而且波動性小。\n\n說實話，我不是在尋找安全。我會去股票市場尋找...",
      "title": "你認爲哪些代理人能在熊市中生存下來？"
    }
  ]
}