{
  "author": "FrontButterscotch4",
  "original_created_utc": 1633941795,
  "title": "Why doesn't pregnancy and parenthood absolutely freak out everybody? Not shaming, genuine question.",
  "created_utc": 1633954703,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not trying to shame people or convince anyone not to have kids. </p>\n\n<p>When I think about bringing a human into this world, I genuinely can not think of a good reason to do so. \nFor love? Some people don&#39;t love their kids, some kids don&#39;t love their parents. That can happen. \nFor fulfillment? Chances are I will mess up and thus mess up a human being, possibly for live. Why take that risk? I don&#39;t want that. \nThere are so many things that can go wrong. Why don&#39;t people think about that before getting pregnant? To me, it feels like people often do it on a whim because &#39;babies look cute&#39;, but that can&#39;t be right... Right?</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/NoStupidQuestions/comments/q5rix6/why_doesnt_pregnancy_and_parenthood_absolutely/",
  "subreddit": "NoStupidQuestions",
  "id": "q5rix6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not trying to shame people or convince anyone not to have kids.\n\nWhen I think about bringing a human into this world, I genuinely can not think\nof a good reason to do so. For love? Some people don't love their kids, some\nkids don't love their parents. That can happen. For fulfillment? Chances…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は人を辱めたり、子供を持たないように説得するつもりはありません。\n\nこの世に人間を送り出すことを考えたとき、純粋にその理由が思い浮かばないのです。\nその理由が思い浮かばないのです。愛のため？自分の子供を愛さない人もいるし、子供が親を愛さないこともある。\n親を愛さない子供もいる。そういうこともあるだろう。充実感のため？可能性としては...",
      "title": "なぜ、妊娠や子育てはみんなを驚かせないのでしょうか？辱めではなく、純粋な疑問です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是想让人们感到羞耻，也不是想说服任何人不要孩子。\n\n当我想到要把一个人带到这个世界上时，我真的想不到\n有什么好的理由这样做。为了爱？有些人不爱他们的孩子，有些\n孩子不爱他们的父母。这可能发生。为了成就感？机会...",
      "title": "为什么怀孕和为人父母不会让所有人都感到害怕？不是羞辱，是真正的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是想讓人們感到羞恥，也不是想說服任何人不要孩子。\n\n當我想到要把一個人帶到這個世界上時，我真的想不到\n有什麼好的理由這樣做。爲了愛？有些人不愛他們的孩子，有些\n孩子不愛他們的父母。這可能發生。爲了成就感？機會...",
      "title": "爲什麼懷孕和爲人父母不會讓所有人都感到害怕？不是羞辱，是真正的問題。"
    }
  ]
}