{
  "author": "Lost-Tackle2126",
  "the_new_excerpt": "My best friend is Asian. She and her husband died leaving their two kids (7&9)\nbehind. I am their godmother and will be adopting them.\n\nBut I'm not sure on how to go about this. I am Black and elements of my culture\nare apparent in all things that I do. I play gospel music on Sundays when its\ntime…",
  "original_created_utc": 1620400300,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の親友はアジア人です。彼女と彼女の夫は、2人の子供（7歳と9歳）を残して亡くなった。\n残して亡くなりました。私は彼らのゴッドマザーであり、彼らを養子に迎える予定です。\n\nでも、どうしたらいいのかわかりません。私は黒人であり、私の文化の要素は、私のすべてのこと\n私の文化の要素は、私がするすべてのことに現れています。日曜日にはゴスペル音楽を演奏します。\n時間になると...",
      "title": "2人の韓国人の子供を養子に迎えた黒人女性として、自分の国の文化に溶け込みながら、彼らの文化を教えるにはどうすればよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最好的朋友是亚洲人。她和她的丈夫去世了，留下他们的两个孩子（7岁和9岁）。\n留下了他们的两个孩子（7岁和9岁）。我是他们的教母，将收养他们。\n\n但我不确定如何去做这件事。我是黑人，我的文化元素\n在我做的所有事情中都很明显。我在周日播放福音音乐，当其\n时间...",
      "title": "作为一个收养两个韩国孩子的黑人妇女，我怎样才能最好地教导他们的文化，同时又能融入我自己的文化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最好的朋友是亞洲人。她和她的丈夫去世了，留下他們的兩個孩子（7歲和9歲）。\n留下了他們的兩個孩子（7歲和9歲）。我是他們的教母，將收養他們。\n\n但我不確定如何去做這件事。我是黑人，我的文化元素\n在我做的所有事情中都很明顯。我在週日播放福音音樂，當其\n時間...",
      "title": "作爲一個收養兩個韓國孩子的黑人婦女，我怎樣才能最好地教導他們的文化，同時又能融入我自己的文化？"
    }
  ],
  "title": "As a Black woman adopting two Korean kids, how can I best teach them their culture while still fitting into my own?",
  "created_utc": 1620445035,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My best friend is Asian. She and her husband died leaving their two kids (7&amp;9) behind. I am their godmother and will be adopting them.</p>\n\n<p>But I&#39;m not sure on how to go about this. I am Black and elements of my culture are apparent in all things that I do. I play gospel music on Sundays when its time to clean, make &quot;soul food&quot; for Christmas dinner and even do a lot of volunteering for Black organizations. I don&#39;t really want to stop those things but I&#39;m worried a fusion might put these kids in an awkward spot growing up and they could be bullied. </p>\n\n<p>I love these kids and my best friend too. My friend was in a transracial adoption and part of her reason for being estranged from her adoptive parents was because of the isolation and bullying she dealt with being forced to ignore all aspects of where she came from. And so when she had children with her Korean husband, she was super excited to teach them about her community. Its important to me that I try to maintain that with the kids as well even as they are raised by two Black parents. This isnt the same as growing up with parents who don&#39;t have a culture like my friend. They are distinctly going to be raised by two people who have a culture and that culture is far from their own. I just want them to be happy. I want them to know that I love them and I want the kids to love their backgrounds too.</p>\n\n<p>My struggle is because I&#39;m not sure where to start. There aren&#39;t many resources for non-white people who are in transracial adoptions.</p>\n\n<p>edit: Clarity</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/n70rqc/as_a_black_woman_adopting_two_korean_kids_how_can/",
  "subreddit": "NoStupidQuestions",
  "id": "n70rqc",
  "is_self": true,
  "media": null,
  "is_video": false
}