{
  "author": "yeggles",
  "the_new_excerpt": "First off this message is not financial advice. I just wanted to inform people\nof future catalyst that we are about to hit.\n\nAMC is hyped and I don't see it stopping anytime soon. I suggest you to buy as\nmuch as you can within a value that you are comfortable sitting on for the next\nmonth. I think…",
  "original_created_utc": 1614109465,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先这条信息不是理财建议。我只是想告诉大家\n的未来催化剂，我们即将打。\n\nAMC被炒得沸沸扬扬，我不认为它很快就会停止。我建议你买入\n尽可能多的在一个你能接受的值范围内，在下一个\n月。我想...",
      "title": "继续买AMC。本周有大事发生！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先這條信息不是理財建議。我只是想告訴大家\n的未來催化劑，我們即將打。\n\nAMC被炒得沸沸揚揚，我不認爲它很快就會停止。我建議你買入\n儘可能多的在一個你能接受的值範圍內，在下一個\n月。我想...",
      "title": "繼續買AMC。本週有大事發生！"
    }
  ],
  "title": "Keep buying AMC. Big things happening this week!",
  "created_utc": 1614189597,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off this message is not financial advice. I just wanted to inform people of future catalyst that we are about to hit.</p>\n\n<p>AMC is hyped and I don&#39;t see it stopping anytime soon. I suggest you to buy as much as you can within a value that you are comfortable sitting on for the next month. I think there is a potential for huge returns. We have multiple events that could work as catalysts for some significant future gains.</p>\n\n<p>Here they are:</p>\n\n<ul>\n<li>FINRA reports (2/25 release): this will help us confirm if there is still an opportunity for a short squeeze</li>\n<li>Q4 Earnings (3/5 release): this could cause a huge spike in buys since I expect to see an uptrend in revenue due to states opening back up. Also keep in mind the last bump allowed AMC to pay off a bunch of their built up debt caused by COVID-19 closing</li>\n<li>COVID-19 vaccines: large number of people are getting the vaccine which will cause a surge in hope for the light at the end of the tunnel. Yesterday we saw what happened when NYC announced re-opening of all of their theaters to 25%</li>\n</ul>\n\n<p>I repeat this is not financial advice and I don&#39;t want you to buy due to FOMO but I think this bet has a good short term and long term play. Short term is we get a nice short squeeze. Long term is the stock settles to over $20 like its competitors. The worlds largest theater chain should not be trading for 1/4 of its competition.</p>\n\n<p>If you want to play it relatively safe then please only invest money that will not needed for at least a year. This way you can play the short and long game.</p>\n\n<p>Love you all! I hope this is prosperous for you all and any money troubles you have can be washed away! Go get them apes!</p>\n\n<p>----------------------------------------------------------------------------------------------------</p>\n\n<p><a href=\"https://fintel.io/so/us/amc\">https://fintel.io/so/us/amc</a></p>\n\n<p><a href=\"https://www.marketwatch.com/investing/stock/amc?mod=quote_search\">https://www.marketwatch.com/investing/stock/amc?mod=quote_search</a></p>\n\n<p><a href=\"https://www.amctheatres.com/on-demand\">https://www.amctheatres.com/on-demand</a></p>\n\n<p>----------------------------------------------------------------------------------------------------</p>\n\n<p>EDIT 1:  I forgot to mention that AMC just released their own streaming service that will allow you to watch blockbuster movies from you home. Having a streaming platform could work as an additional catalyst for gains.</p>\n\n<p>EDIT 2:  I accidently linked the wrong AMC streaming service.</p>\n\n<p>EDIT 3:  I updated the earning report release date and added links to AMC MarketWatch and Fintel data</p>\n</div><!-- SC_ON -->",
  "score": 1381,
  "permalink": "/r/wallstreetbets/comments/lqr516/keep_buying_amc_big_things_happening_this_week/",
  "subreddit": "wallstreetbets",
  "id": "lqr516",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332897153
}