{
  "author": "Ch_IV_TheGoodYears",
  "the_new_excerpt": "Mods forgive me, I understand there is a Meme stock megathread, and if this\nviolates rules, I understand. I just wanted to try and make a post anyway.\n\nI'm looking to create a collection of bearish or just neutral/non-bullish takes\non GME. I understood the squeeze last time, but I do not know why it…",
  "original_created_utc": 1615393279,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "版主见谅，据我所知，有一个梅梅股份的特大号，如果这个\n违反规定，我理解。反正我就是想试着发个帖子。\n\n我想创建一个看跌或只是中性/非看涨的集合。\n在GME上。我理解上次的挤压，但我不知道为什么它... ...",
      "title": "看衰GME？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "版主見諒，據我所知，有一個梅梅股份的特大號，如果這個\n違反規定，我理解。反正我就是想試着發個帖子。\n\n我想創建一個看跌或只是中性/非看漲的集合。\n在GME上。我理解上次的擠壓，但我不知道爲什麼它... ...",
      "title": "看衰GME？"
    }
  ],
  "title": "Bearish takes on GME?",
  "created_utc": 1615421905,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Mods forgive me, I understand there is a Meme stock megathread, and if this violates rules, I understand. I just wanted to try and make a post anyway. </p>\n\n<p>I&#39;m looking to create a collection of bearish or just neutral/non-bullish takes on GME. I understood the squeeze last time, but I do not know why it is going up this time. Is it actually rising because of news? </p>\n\n<p>The underlying financial fundamentals of this company suggest an optimistic $20 share price, and yet it is teasing $300 at time of writing this, moreover, it&#39;s been trading at over $100 a share since Feb 24th. </p>\n\n<p>Last time, it was a short/gamma squeeze that took place over a roughly 3 day period. We are now 2 weeks into this current situation.</p>\n\n<p>So, we have two fundamental questions, WHY is it trading at this price, and WHEN will it begin trading at its rational price of sub-20? </p>\n\n<p>Also, looking to collect DD found on other subs if possible.</p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/stocks/comments/m219ec/bearish_takes_on_gme/",
  "subreddit": "stocks",
  "id": "m219ec",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542577990
}