{
  "author": "NevilleHarris",
  "original_created_utc": 1635210991,
  "title": "Tom Brady announces on Monday Night Football he’s giving a fan a Bitcoin",
  "created_utc": 1635223569,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone else just hear that? </p>\n\n<p>Backstory: Yesterday Tom Brady threw his 600th career TD pass, an absolutely insane feat, and his receiver spaced out and gave the ball (one Brady would’ve liked to have kept) to a fan in the front row. The team got the ball back after some negotiating but today’s big topic in the sports debate space is whether the guy should have left the stadium with the ball and sold it for big money. </p>\n\n<p>Anyways, that got brought up on the “Peyton &amp; Eli” MNF broadcast—where Brady is a guest. Tom said “I’m giving him a Bitcoin too so he’s still getting a pretty decent deal.” </p>\n\n<p>We all know Brady is in on crypto but idk, thought it was cool and makes me wonder if TB12 is even more of a believer than we realize—seeing an opportunity to insert Bitcoin into a topic people are talking about and taking it.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qfv9qv/tom_brady_announces_on_monday_night_football_hes/",
  "subreddit": "CryptoCurrency",
  "id": "qfv9qv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Anyone else just hear that?\n\nBackstory: Yesterday Tom Brady threw his 600th career TD pass, an absolutely\ninsane feat, and his receiver spaced out and gave the ball (one Brady would’ve\nliked to have kept) to a fan in the front row. The team got the ball back after\nsome negotiating but today’s big…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今聞いた人はいますか？\n\nバックストーリー。昨日、トム・ブレイディがキャリア600本目のTDパスを投げました。\n投げたのですが、レシーバーが間延びしてしまい、最前列のファンにボールを渡してしまいました（ブレイディが持っていたかったボールです）。\n最前列にいたファンにボールを渡しました。チームは交渉の末、ボールを取り戻しました。\nチームは交渉の末にボールを取り戻しましたが、今日の大きな出来事は...。",
      "title": "トム・ブレイディがマンデーナイトフットボールで、ファンにビットコインをプレゼントすると発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还有人刚刚听到吗？\n\n背景故事。昨天，汤姆-布雷迪投出了他职业生涯中的第600次TD传球，这是一个绝对的\n而他的接球手却把球（布雷迪本想保留的球）给了边缘的一个球迷，这绝对是一个疯狂的壮举。\n他的接球手走神了，把球给了前排的一个球迷（布雷迪本想保留的）。球队在经过一番交涉后拿回了球\n但今天的大...",
      "title": "汤姆-布雷迪在 \"周一橄榄球之夜 \"上宣布他将给一个球迷一个比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還有人剛剛聽到嗎？\n\n背景故事。昨天，湯姆-布雷迪投出了他職業生涯中的第600次TD傳球，這是一個絕對的\n而他的接球手卻把球（布雷迪本想保留的球）給了邊緣的一個球迷，這絕對是一個瘋狂的壯舉。\n他的接球手走神了，把球給了前排的一個球迷（布雷迪本想保留的）。球隊在經過一番交涉後拿回了球\n但今天的大...",
      "title": "湯姆-布雷迪在 \"週一橄欖球之夜 \"上宣佈他將給一個球迷一個比特幣"
    }
  ]
}