{
  "author": "Southern_Lawfulness1",
  "original_created_utc": 1640090422,
  "title": "Can I restore my bitcoin from 2009?",
  "created_utc": 1640104317,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys I have a question that I am sure must of been asked hundreds of times before...here goes.&lt;/p&gt;\n\n&lt;p&gt;In 2009 I was really interested in anything related to economics and specifically currency. I came across the whitepaper for bitcoin and after doing some reading, I decided to download the bitcoin client. I remember I was mining for weeks on end not really knowing the significance of what I was doing but was just really trying to support the idea of a virtual currency as I knew this could be the future. Around 2010 I threw my computer and all my furniture in storage and moved overseas. My computer has been sitting in storage for about 11 years now and I am going back soon to open it up and see if I still have the bitcoin client. I am not really in sync with how bitcoin operates nowadays, all i know is you either have your private keys in cold storage or hot storage. I think in 2009 my computer should hold the private keys on cold storage as there weren&amp;#39;t any virtual wallets back then.&lt;/p&gt;\n\n&lt;p&gt;When I go back soon, I will attempt to recover my potential riches or perhaps cry in despair so...&lt;/p&gt;\n\n&lt;p&gt;I have a couple of questions.&lt;/p&gt;\n\n&lt;p&gt;1)What is the name of the bitcoin client that was operating in 2009? I only ask this because I tried to go to the bitcoin website and it says I need to log in. There were no accounts back then, it was just a client on my computer.&lt;/p&gt;\n\n&lt;p&gt;2)In the case that I formatted my computer (which i do not recall if i did or not), can I get my hard drive professionally restored saving my potential private keys to restore my coins? (I heard its an expensive process but with the use of magnets or something, you can restore your hard drive even if formatted)&lt;/p&gt;\n\n&lt;p&gt;3) I had a powerful graphics card in 2009, how many bitcoins can someone have mined in 2009 per day given the low amount of mining back then with a top of the line video card? ( I was mining every day for maybe a few weeks or a month)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 170,
  "permalink": "/r/Bitcoin/comments/rlduec/can_i_restore_my_bitcoin_from_2009/",
  "subreddit": "Bitcoin",
  "id": "rlduec",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys I have a question that I am sure must of been asked hundreds of times\nbefore...here goes.\n\nIn 2009 I was really interested in anything related to economics and\nspecifically currency. I came across the whitepaper for bitcoin and after doing\nsome reading, I decided to download the bitcoin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、何百回となく聞かれているであろう質問をさせてください。\nというわけで、早速ですが。\n\n2009年、私は経済学に関連することにとても興味がありました。\n特に通貨。私はビットコインのホワイトペーパーを見つけ、それを読んでから\nそして、ビットコインをダウンロードすることにしました。",
      "title": "2009年からのビットコインを復元することはできますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们，我有一个问题，我相信以前一定被问过几百次了。\n的问题......现在开始。\n\n在2009年，我对任何与经济有关的东西都非常感兴趣，特别是货币。\n特别是货币。我看到了比特币的白皮书，在做了一些阅读之后，我决定下载比特币。\n在做了一些阅读之后，我决定下载比特币的白皮书...",
      "title": "我可以把我的比特币从2009年恢复吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們，我有一個問題，我相信以前一定被問過幾百次了。\n的問題......現在開始。\n\n在2009年，我對任何與經濟有關的東西都非常感興趣，特別是貨幣。\n特別是貨幣。我看到了比特幣的白皮書，在做了一些閱讀之後，我決定下載比特幣。\n在做了一些閱讀之後，我決定下載比特幣的白皮書...",
      "title": "我可以把我的比特幣從2009年恢復嗎？"
    }
  ]
}