{
  "author": "alexb_090",
  "original_created_utc": 1636378348,
  "title": "This sub is almost always wrong, and if you rely on getting your crypto information from the headlines without reading into the stories, you will be very misinformed.",
  "created_utc": 1636400300,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed lately that every highly upvoted post here seems to be misleading or even blatantly incorrect, so I thought I&#39;d actually go through some of them to see if the pattern held up. I know it&#39;s a small sample size because I don&#39;t have a ton of time, but I went through the top posts from the past week and picked ones claiming to be some sort of news or analysis on a specific thing or event. These posts are:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qop0fv/solanas_team_lied_about_circulating_supply_and/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">This post about Solana</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qnzz2e/urgent_the_house_has_passed_an_infrastructure/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">This post about transactional reporting requirements</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qo1otl/reddit_plans_to_implement_community_points/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">This post about reddit crypto</a></li>\n<li><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qmgi2j/i_have_analyzed_every_shilled_coin_in_this_sub/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">This post about historical returns</a></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>Lets start with the first post. An event happened, but that&#39;s about all that the post got right. They implied it was recent news, when in fact it was 18 months old, and then got all of the circumstances and facts wrong. <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qoyrtd/how_circulating_supply_is_calculated/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Read here</a> if you want the actual story. Misinformed hit pieces like this are bad for the community, especially when everyone believes them.</p>\n\n<p>&#x200B;</p>\n\n<p>The second post is more fear mongering. The OP claims that this new regulation will hamstring defi, making it unusable. The regulations literally don&#39;t even apply to defi because the whole point is there is no single entity. You are interacting with an algorithm, and algorithms don&#39;t have social security numbers. Again, there is literally nothing to worry about here. If anything, its a positive because it shows that the United States is on its way to adoption by recognizing crypto as an actual currency, not just a speculative asset, or worse, a security.</p>\n\n<p>&#x200B;</p>\n\n<p>Post 3 tries to convince readers that the new reddit initiative is extremely bullish and will result in hundreds of millions of new crypto users. It ignores that these &quot;cryptos&quot; will all be worthless shitcoins controlled by reddit, and that most people probably won&#39;t even care. Even on <a href=\"/r/cc\">r/cc</a>, a subreddit explicitly about crypto, many people don&#39;t even know or care about the native currency.</p>\n\n<p>&#x200B;</p>\n\n<p>The last post discusses historical returns of top performing crypto&#39;s. While the information is correct, it is a misleading data set, because it doesn&#39;t consider all of the thousands of failed coins. It seems to be leading people to invest in ico&#39;s by only showing data where the coins are wildly successful, and all you have to do to get rich is buy into an ico. However, many of these are scams and its difficult to pick out for yourself what is what when they are so new. And on top of that, actually participating in them is often difficult, and prices will drop dramatically as soon as retail is actually able to buy in due to dumping of pre mined coins. </p>\n\n<p>&#x200B;</p>\n\n<p>In conclusion, 2 of the 4 posts were misleading, and the other 2 were pretty much just wrong. And yet, the posts have almost 25k upvotes between them. If you are getting your daily or weekly crypto news in this manner, and didn&#39;t actually DYOR on these stories when you read them, you will most likely now have 4 incorrect or mislead opinions, and you will lose money and hurt the ecosystem because of it. There&#39;s nothing that anyone can really do to fix this; its up to individuals to think more critically about what they read and check other sources</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/qpdp9z/this_sub_is_almost_always_wrong_and_if_you_rely/",
  "subreddit": "CryptoCurrency",
  "id": "qpdp9z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've noticed lately that every highly upvoted post here seems to be misleading\nor even blatantly incorrect, so I thought I'd actually go through some of them\nto see if the pattern held up. I know it's a small sample size because I don't\nhave a ton of time, but I went through the top posts from the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近気づいたのですが、このサイトで高い評価を得ている記事には、誤解を招くようなものや、明らかに間違ったものが多いようです。\nあきらかに間違っているような気がしたので、実際にいくつかの記事を見てみようと思いました。\nそのパターンが当てはまるかどうか、実際に見てみようと思いました。時間がないのでサンプル数が少ないのは承知していますが\n時間がないのでサンプル数が少ないのは承知の上ですが、私はこれまでの上位の投稿を見てみました。",
      "title": "このように、ほとんどの場合、間違っています。ストーリーを読み込まずにヘッドラインから暗号情報を得ることに頼ると、非常に誤った情報を得ることになります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近注意到，这里每一个高票数的帖子似乎都是误导性的\n甚至是公然不正确的，所以我想我应该实际去看看其中的一些帖子\n来看看这个模式是否成立。我知道这是个小样本，因为我没有\n我知道这只是一个小样本，因为我没有太多的时间，但是我看了一下那些最重要的帖子，这些帖子都是来自于《中国日报》的。",
      "title": "这个子几乎总是错误的，如果你依靠从头条新闻中获取你的加密货币信息，而不去阅读这些故事，你将会被严重误导。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近注意到，這裏每一個高票數的帖子似乎都是誤導性的\n甚至是公然不正確的，所以我想我應該實際去看看其中的一些帖子\n來看看這個模式是否成立。我知道這是個小樣本，因爲我沒有\n我知道這只是一個小樣本，因爲我沒有太多的時間，但是我看了一下那些最重要的帖子，這些帖子都是來自於《中國日報》的。",
      "title": "這個子幾乎總是錯誤的，如果你依靠從頭條新聞中獲取你的加密貨幣信息，而不去閱讀這些故事，你將會被嚴重誤導。"
    }
  ]
}