{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Hello everyone. I present a bear case for the summer. \n\nI've noticed people beginning to think about the risk of an imminent crash lately on various finance and, uhh, stock-gambling subreddits. What stocks to buy in case there's a crash? Where is safe in a crash? That sort of thing. Take a look around, do some searches for 'crash' or 'bubble', you'll see it. A change in the mood. I track about 10+ finance forums every day, and I keep seeing it coming up every single day on daily threads and topic posts.\n\nOf course, there are always people worrying about downside, the risks, and there are always people yelling the market is about to crash, perma-bears etc. \"Scared money don't make money\", and a stopped clock is right twice a day.  Why might this time be different? \n\nThe backdrop\n=====\n\nThe market is presently doing well following the idea of the 're-opening play' in addition to the free money fountain of central bank programs and government fiscal stimulus. However, I think the delta strain is going to prevent re-openings lasting more than a few weeks, and I think sentiment is going to turn sharply on that. \n\nDelta can often break past vaccines, unfortunately, and it spreads like absolute wildfire among the unvaccinated. Regardless, the EU and USA are opening up anyway! Given the R0 of 6 of delta, we should see very rapid spread when mask mandates, lockdown restrictions are removed, and people are socialising like crazy in the Summer of Hedonism. \n\nI would expect by end July to mid-August, delta will be causing very big problems pretty much everywhere in the world; it's established and spreading in 80+ countries already. Other strains are also a problem and we may see new variants of delta or entirely new strains showing up in the next 2-3 months. \n\nDo you think delta is the most deadly or infectious variant of covid we'll ever see? \n\nConsider: it's already about 2.5x faster spreading, more infectious in younger adults, more likely to cause symptomatic disease, new symptoms that can cause it to be misidentified, it has reduced the protectiveness of vaccines noticeably. If you look at the death/infections rate in covid-naive unvaccinated populations like Taiwan, it's potentially a lot more lethal too. That's how much covid 'improved' itself in the 12 months that constituted the bulk of its spread so far, and right now it's spreading (and getting lottery tickets to improve itself) in more people than ever. \n\nIf it's not rapidly eliminated and has another 12 months to circulate, mutate, and continue getting stronger and work around vaccine antibodies, how bad might it become? Are state & national governments in the EU & US & Japan etc taking actions that would eliminate covid before it gets any stronger, or taking actions that will likely allow it to continue to spread and develop?\n\nThe Bear Case\n=====\n\nMy key argument: Central bank and government stimulus programs were timed and globally synchronised on the assumption of the re-opening play throughout this summer. Taxpayer funds and central bank willingness/effectiveness may be exhausted should this continue another year - or two. Does anyone think life around the world will be back to 'business as usual' by the end of summer? Or will it be still 'the end of the beginning' as delta begins to reach the people that alpha failed to reach? The liquidity trap for central banks is also a real concern as printing continues and rates stay close to zero, added to uncertainty about the security of income in many sectors. \n\nThe number of doses of vaccine given worldwide is about 2 billion. The number of doses required to fully vaccinate the world just once is about 16 billion. Will covid continue to circulate and improve? What about new animal strains (remember the mink in Denmark?). What will happen to the stockmarkets and consumer demand in emerging markets with low levels of vaccination? \n\nEven if covid magically disappeared overnight in the developed world - and it won't - how can the US & EU stockmarkets do well if most of the world is still being ruined by covid and new dangerous strains continue to emerge? \n\nNow consider: A CAPE10 PER of 38? - 38! good lord! (https://www.multpl.com/shiller-pe) - Government debts globally hitting dangerously high levels vs GDP in most developed countries? A struggling global supply chain? Stalled, chaotic re-opening plans? This re-opening can't afford to fail, but as delta arrives perfectly timed with summer re-openings and incomplete vaccination, how can it succeed? \n\nThe world is already struggling where delta is well established this month.  https://www.worldometers.info/coronavirus/weekly-trends/#weekly_table . Some countries where delta is well established already: Russia, Indonesia, Bangladesh. Some countries with highly successful vaccination programs: United Kingdom, Israel, Seychelles. Sort by 'weekly case change' or 'weekly death change', ignore the small countries. Those are 'weekly' figures. Extrapolate out 6-8 weeks. \n\nFor discussion: What do you think is going to happen here? How do you think governments will respond? How do you think the market will respond? \n\nOther examples\n====\n\nConsider: Taiwan, Australia, Vietnam, China, New Zealand, were successful in holding back covid for 15 months. But delta sneaked past all their defenses. Now they are engaged in various levels of restrictions to try and stop it. If they can't keep it under control, how are countries with low rates of vaccination and limited/nonexistent restrictions ever going to manage? \n\nAnd then we get into the economic costs of continuing to push hard on burned out healthcare systems, the economic costs of long covid, the economic costs of permanent damage to economies  (businesses that went bust and won't ever re-open - hospitality, tourism etc). A lot of businesses can survive a bad year. But it's been 18 months now struggling like this. How many of these businesses can survive 2, maybe 3 terrible years? How much of the economy can we afford to lose before we have a really serious crisis on our hands or permanent economic damage?\n\nToo much like feb 2020\n======\n\nTo me the whole situation today rhymes far too much with the sentiment and backdrop in February 2020. A deadly strain spreading. Market hitting new highs. Too many big countries not taking it seriously, Asia & ANZ making a serious desperate attempt to stop it spiralling out of control.\n\nThe main difference with the February 2020 scenario? We're starting from a far, far, far higher point of stockmarket valuation (the SP500 is not just 'expensive', it's at the 2nd highest point of valuation ever, per CAPE10, and the highest ever in terms of broker margin, buffett ratio). \n\nThe investor backdrop is bubbling hyper-bullish sentiment and outright gambling on most forums, manias and pump/dumps erupting multiple times a day, and bearly [!] an inkling of bearishness. Yet we're going forward from here with companies AND consumers AND governments AND central banks that have taken a balance-sheet beating for the last 15 months. We're looking at a far more deadly strain of disease that spreads faster, hits harder. We're looking at governments that have already burned out the political support and willingness-to-suffer of their populations.\n\nThis is not a recipe for success. This is a recipe for March 2020... on steroids. \n\nSome counter-arguments against my case\n=========\n\n> \"The vaccines are effective and will bring covid to a halt\". \n\nBy definition, disease with a natural R>3 will continue to circulate even if vaccines are 66% effective against infection and 100% of the population is fully vaccinated. Contrast: The R of delta is around 6, the effectiveness of one of the best vaccines (AZN) is around 60%, and barely a handful of countries will have fully-vaccinated rates above 50% by the end of summer. \n\n> \"Well, OK, vaccines won't stop it, but they will stop people dying of it. That's what matters. We don't lockdown for 20000 flu deaths/year.\"\n\nWhat we are seeing from delta is that AZN & PFE/MDNA vaccines are **extremely** effective at preventing death generally, though less so in older people or immunocompromised people. I have read that a fully vaccinated 80 y/o has about the same chances vs covid as an unvaccinated 50 y/o, but I don't have the source to hand right now; sounds about right though. \n\nVaccines aren't nearly so effective at stopping someone spreading covid to vulnerable members of their family. While vaccines have a wonderful effect in reducing hospitalisations too, delta hits hard and spreads fast, so hospitals are already beginning to get quite busy again as a result. The problem is that this means regular hospital operation is going to be affected. If you have a hospital full of ultra-hyper-contagious-but-not-deadly plague, you can't be doing regular surgeries etc. So people will unfortunately die from that, from delayed surgeries etc, specialities on hold to help out in the covid wards. Flu has an R around 1.5 and it slams the hospital system hard every year. An ongoing (and worsening into the end of the year) slamming of the hospital system with a mostly-non-lethal-but-still-needs-oxygen/vent disease, that spreads between wards with an R of 6, that is a different matter. There's also the issue that e.g. teachers, retail, dentists, doctors, hospital staff are simply exhausted and emotionally burned out from dealing with this. The systems are under a huge amount of pressure as it is even today. It isn't realistic to expect governments to keep saying 'tough shit', all the public 'ignoring' covid all around, while these sectors crumble under the pressure.   \n\n> \"Regardless of whether it spreads, or whether people are dying, no matter how bad it gets, governments will simply not lock down again. End of story.\"\n\nWe saw in Sweden last year that if governments fail to enact a lockdown, a large part of the public will do it themselves anyway. And many businesses cannot operate at full productivity if workers keep falling ill and ending up long-term sick or in hospital, even if those workers remain alive. Many businesses cannot profitably operate on 30-50% custom. Ultimately, democratic governments cannot force you to go out and get slammed by a deadly plague providing you have enough money in the bank to avoid it. The retail & hospitality economy will not prosper if the only people out shopping/eating/holidaying are those unable to afford the luxury of hiding at home from a massive covid outbreak. \n\nhttps://www.reuters.com/article/health-coronavirus-sweden-retail-idUSL5N2BX1EK\n\nRandom things\n====\n\nRemember, whether it's 1987 or 2020, you don't get a warning before the rug gets pulled from under your feet. A trip down memory lane. https://pbs.twimg.com/media/ES4uVEcXsAEqZkT?format=jpg&name=4096x4096 . https://www.bbc.co.uk/news/business-51829852 . Not that long ago, really?\n\nAlso - \"Be Fearful When Others Are Greedy\", the sage wrote. But what does **greedy** look like? Does it look like 'my stock is worth $1m/share'? No. **Greedy** looks like this: smart, sensible, sane people saying things like 'well OK, sure this market seems pretty weird, idiots being stupid, but the music's still playing, and I think there's still time to skim a quick 5-10% and get out before it all falls apart. There will be a bit of warning before shit hits the fan; I'll run for the exit when I see it'. \n\nThe steamroller has arrived, it is right there, towering over them, but still their eyes are on the pennies on the ground, even though they know they ought to know better. But it hasn't started squishing ... yet. Then the moment arrives, and the door for everyone to get out is...  so very narrow. Painfully mixed metaphors but you see my point. \n\nFinally\n===\n\nDisclosure; I am now completely out of the market.\n\nSome further material for thought:  https://www.gmo.com/europe/research-library/waiting-for-the-last-dance/\n\nA closing note: every day, the next major stockmarket crash always gets one day closer. It's like the theta decay on a long-dated option whose expiry date is a secret. Hardly there at all for months or years, the signal lost in the noise, then suddenly, it arrives, it's the day, and everything is gone at once. \n\nStay safe everyone, get your vaccines, and don't catch the plague. The zero-th rule of making money is: be alive to enjoy it.\n\np.s. If you think what I've written is wrong/stupid fair enough but  don't downvote this purely because you are currently long in the market and don't like seeing bearish sentiment. I would very much welcome thoughtful & evidence-based criticism of what I'm presenting here. I would love to be wrong about this.",
  "author_fullname": "t2_3gh0loj",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "The Bear Case for Summer: A crash in the next 4-8 weeks?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_obh4gv",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.62,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 62,
  "total_awards_received": 2,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 62,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1625155821,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone. I present a bear case for the summer. </p>\n\n<p>I&#39;ve noticed people beginning to think about the risk of an imminent crash lately on various finance and, uhh, stock-gambling subreddits. What stocks to buy in case there&#39;s a crash? Where is safe in a crash? That sort of thing. Take a look around, do some searches for &#39;crash&#39; or &#39;bubble&#39;, you&#39;ll see it. A change in the mood. I track about 10+ finance forums every day, and I keep seeing it coming up every single day on daily threads and topic posts.</p>\n\n<p>Of course, there are always people worrying about downside, the risks, and there are always people yelling the market is about to crash, perma-bears etc. &quot;Scared money don&#39;t make money&quot;, and a stopped clock is right twice a day.  Why might this time be different? </p>\n\n<h1>The backdrop</h1>\n\n<p>The market is presently doing well following the idea of the &#39;re-opening play&#39; in addition to the free money fountain of central bank programs and government fiscal stimulus. However, I think the delta strain is going to prevent re-openings lasting more than a few weeks, and I think sentiment is going to turn sharply on that. </p>\n\n<p>Delta can often break past vaccines, unfortunately, and it spreads like absolute wildfire among the unvaccinated. Regardless, the EU and USA are opening up anyway! Given the R0 of 6 of delta, we should see very rapid spread when mask mandates, lockdown restrictions are removed, and people are socialising like crazy in the Summer of Hedonism. </p>\n\n<p>I would expect by end July to mid-August, delta will be causing very big problems pretty much everywhere in the world; it&#39;s established and spreading in 80+ countries already. Other strains are also a problem and we may see new variants of delta or entirely new strains showing up in the next 2-3 months. </p>\n\n<p>Do you think delta is the most deadly or infectious variant of covid we&#39;ll ever see? </p>\n\n<p>Consider: it&#39;s already about 2.5x faster spreading, more infectious in younger adults, more likely to cause symptomatic disease, new symptoms that can cause it to be misidentified, it has reduced the protectiveness of vaccines noticeably. If you look at the death/infections rate in covid-naive unvaccinated populations like Taiwan, it&#39;s potentially a lot more lethal too. That&#39;s how much covid &#39;improved&#39; itself in the 12 months that constituted the bulk of its spread so far, and right now it&#39;s spreading (and getting lottery tickets to improve itself) in more people than ever. </p>\n\n<p>If it&#39;s not rapidly eliminated and has another 12 months to circulate, mutate, and continue getting stronger and work around vaccine antibodies, how bad might it become? Are state &amp; national governments in the EU &amp; US &amp; Japan etc taking actions that would eliminate covid before it gets any stronger, or taking actions that will likely allow it to continue to spread and develop?</p>\n\n<h1>The Bear Case</h1>\n\n<p>My key argument: Central bank and government stimulus programs were timed and globally synchronised on the assumption of the re-opening play throughout this summer. Taxpayer funds and central bank willingness/effectiveness may be exhausted should this continue another year - or two. Does anyone think life around the world will be back to &#39;business as usual&#39; by the end of summer? Or will it be still &#39;the end of the beginning&#39; as delta begins to reach the people that alpha failed to reach? The liquidity trap for central banks is also a real concern as printing continues and rates stay close to zero, added to uncertainty about the security of income in many sectors. </p>\n\n<p>The number of doses of vaccine given worldwide is about 2 billion. The number of doses required to fully vaccinate the world just once is about 16 billion. Will covid continue to circulate and improve? What about new animal strains (remember the mink in Denmark?). What will happen to the stockmarkets and consumer demand in emerging markets with low levels of vaccination? </p>\n\n<p>Even if covid magically disappeared overnight in the developed world - and it won&#39;t - how can the US &amp; EU stockmarkets do well if most of the world is still being ruined by covid and new dangerous strains continue to emerge? </p>\n\n<p>Now consider: A CAPE10 PER of 38? - 38! good lord! (<a href=\"https://www.multpl.com/shiller-pe\">https://www.multpl.com/shiller-pe</a>) - Government debts globally hitting dangerously high levels vs GDP in most developed countries? A struggling global supply chain? Stalled, chaotic re-opening plans? This re-opening can&#39;t afford to fail, but as delta arrives perfectly timed with summer re-openings and incomplete vaccination, how can it succeed? </p>\n\n<p>The world is already struggling where delta is well established this month.  <a href=\"https://www.worldometers.info/coronavirus/weekly-trends/#weekly_table\">https://www.worldometers.info/coronavirus/weekly-trends/#weekly_table</a> . Some countries where delta is well established already: Russia, Indonesia, Bangladesh. Some countries with highly successful vaccination programs: United Kingdom, Israel, Seychelles. Sort by &#39;weekly case change&#39; or &#39;weekly death change&#39;, ignore the small countries. Those are &#39;weekly&#39; figures. Extrapolate out 6-8 weeks. </p>\n\n<p>For discussion: What do you think is going to happen here? How do you think governments will respond? How do you think the market will respond? </p>\n\n<h1>Other examples</h1>\n\n<p>Consider: Taiwan, Australia, Vietnam, China, New Zealand, were successful in holding back covid for 15 months. But delta sneaked past all their defenses. Now they are engaged in various levels of restrictions to try and stop it. If they can&#39;t keep it under control, how are countries with low rates of vaccination and limited/nonexistent restrictions ever going to manage? </p>\n\n<p>And then we get into the economic costs of continuing to push hard on burned out healthcare systems, the economic costs of long covid, the economic costs of permanent damage to economies  (businesses that went bust and won&#39;t ever re-open - hospitality, tourism etc). A lot of businesses can survive a bad year. But it&#39;s been 18 months now struggling like this. How many of these businesses can survive 2, maybe 3 terrible years? How much of the economy can we afford to lose before we have a really serious crisis on our hands or permanent economic damage?</p>\n\n<h1>Too much like feb 2020</h1>\n\n<p>To me the whole situation today rhymes far too much with the sentiment and backdrop in February 2020. A deadly strain spreading. Market hitting new highs. Too many big countries not taking it seriously, Asia &amp; ANZ making a serious desperate attempt to stop it spiralling out of control.</p>\n\n<p>The main difference with the February 2020 scenario? We&#39;re starting from a far, far, far higher point of stockmarket valuation (the SP500 is not just &#39;expensive&#39;, it&#39;s at the 2nd highest point of valuation ever, per CAPE10, and the highest ever in terms of broker margin, buffett ratio). </p>\n\n<p>The investor backdrop is bubbling hyper-bullish sentiment and outright gambling on most forums, manias and pump/dumps erupting multiple times a day, and bearly [!] an inkling of bearishness. Yet we&#39;re going forward from here with companies AND consumers AND governments AND central banks that have taken a balance-sheet beating for the last 15 months. We&#39;re looking at a far more deadly strain of disease that spreads faster, hits harder. We&#39;re looking at governments that have already burned out the political support and willingness-to-suffer of their populations.</p>\n\n<p>This is not a recipe for success. This is a recipe for March 2020... on steroids. </p>\n\n<h1>Some counter-arguments against my case</h1>\n\n<blockquote>\n<p>&quot;The vaccines are effective and will bring covid to a halt&quot;. </p>\n</blockquote>\n\n<p>By definition, disease with a natural R&gt;3 will continue to circulate even if vaccines are 66% effective against infection and 100% of the population is fully vaccinated. Contrast: The R of delta is around 6, the effectiveness of one of the best vaccines (AZN) is around 60%, and barely a handful of countries will have fully-vaccinated rates above 50% by the end of summer. </p>\n\n<blockquote>\n<p>&quot;Well, OK, vaccines won&#39;t stop it, but they will stop people dying of it. That&#39;s what matters. We don&#39;t lockdown for 20000 flu deaths/year.&quot;</p>\n</blockquote>\n\n<p>What we are seeing from delta is that AZN &amp; PFE/MDNA vaccines are <strong>extremely</strong> effective at preventing death generally, though less so in older people or immunocompromised people. I have read that a fully vaccinated 80 y/o has about the same chances vs covid as an unvaccinated 50 y/o, but I don&#39;t have the source to hand right now; sounds about right though. </p>\n\n<p>Vaccines aren&#39;t nearly so effective at stopping someone spreading covid to vulnerable members of their family. While vaccines have a wonderful effect in reducing hospitalisations too, delta hits hard and spreads fast, so hospitals are already beginning to get quite busy again as a result. The problem is that this means regular hospital operation is going to be affected. If you have a hospital full of ultra-hyper-contagious-but-not-deadly plague, you can&#39;t be doing regular surgeries etc. So people will unfortunately die from that, from delayed surgeries etc, specialities on hold to help out in the covid wards. Flu has an R around 1.5 and it slams the hospital system hard every year. An ongoing (and worsening into the end of the year) slamming of the hospital system with a mostly-non-lethal-but-still-needs-oxygen/vent disease, that spreads between wards with an R of 6, that is a different matter. There&#39;s also the issue that e.g. teachers, retail, dentists, doctors, hospital staff are simply exhausted and emotionally burned out from dealing with this. The systems are under a huge amount of pressure as it is even today. It isn&#39;t realistic to expect governments to keep saying &#39;tough shit&#39;, all the public &#39;ignoring&#39; covid all around, while these sectors crumble under the pressure.   </p>\n\n<blockquote>\n<p>&quot;Regardless of whether it spreads, or whether people are dying, no matter how bad it gets, governments will simply not lock down again. End of story.&quot;</p>\n</blockquote>\n\n<p>We saw in Sweden last year that if governments fail to enact a lockdown, a large part of the public will do it themselves anyway. And many businesses cannot operate at full productivity if workers keep falling ill and ending up long-term sick or in hospital, even if those workers remain alive. Many businesses cannot profitably operate on 30-50% custom. Ultimately, democratic governments cannot force you to go out and get slammed by a deadly plague providing you have enough money in the bank to avoid it. The retail &amp; hospitality economy will not prosper if the only people out shopping/eating/holidaying are those unable to afford the luxury of hiding at home from a massive covid outbreak. </p>\n\n<p><a href=\"https://www.reuters.com/article/health-coronavirus-sweden-retail-idUSL5N2BX1EK\">https://www.reuters.com/article/health-coronavirus-sweden-retail-idUSL5N2BX1EK</a></p>\n\n<h1>Random things</h1>\n\n<p>Remember, whether it&#39;s 1987 or 2020, you don&#39;t get a warning before the rug gets pulled from under your feet. A trip down memory lane. <a href=\"https://pbs.twimg.com/media/ES4uVEcXsAEqZkT?format=jpg&amp;name=4096x4096\">https://pbs.twimg.com/media/ES4uVEcXsAEqZkT?format=jpg&amp;name=4096x4096</a> . <a href=\"https://www.bbc.co.uk/news/business-51829852\">https://www.bbc.co.uk/news/business-51829852</a> . Not that long ago, really?</p>\n\n<p>Also - &quot;Be Fearful When Others Are Greedy&quot;, the sage wrote. But what does <strong>greedy</strong> look like? Does it look like &#39;my stock is worth $1m/share&#39;? No. <strong>Greedy</strong> looks like this: smart, sensible, sane people saying things like &#39;well OK, sure this market seems pretty weird, idiots being stupid, but the music&#39;s still playing, and I think there&#39;s still time to skim a quick 5-10% and get out before it all falls apart. There will be a bit of warning before shit hits the fan; I&#39;ll run for the exit when I see it&#39;. </p>\n\n<p>The steamroller has arrived, it is right there, towering over them, but still their eyes are on the pennies on the ground, even though they know they ought to know better. But it hasn&#39;t started squishing ... yet. Then the moment arrives, and the door for everyone to get out is...  so very narrow. Painfully mixed metaphors but you see my point. </p>\n\n<h1>Finally</h1>\n\n<p>Disclosure; I am now completely out of the market.</p>\n\n<p>Some further material for thought:  <a href=\"https://www.gmo.com/europe/research-library/waiting-for-the-last-dance/\">https://www.gmo.com/europe/research-library/waiting-for-the-last-dance/</a></p>\n\n<p>A closing note: every day, the next major stockmarket crash always gets one day closer. It&#39;s like the theta decay on a long-dated option whose expiry date is a secret. Hardly there at all for months or years, the signal lost in the noise, then suddenly, it arrives, it&#39;s the day, and everything is gone at once. </p>\n\n<p>Stay safe everyone, get your vaccines, and don&#39;t catch the plague. The zero-th rule of making money is: be alive to enjoy it.</p>\n\n<p>p.s. If you think what I&#39;ve written is wrong/stupid fair enough but  don&#39;t downvote this purely because you are currently long in the market and don&#39;t like seeing bearish sentiment. I would very much welcome thoughtful &amp; evidence-based criticism of what I&#39;m presenting here. I would love to be wrong about this.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "obh4gv",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bananacakesjoy",
  "discussion_type": null,
  "num_comments": 94,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/obh4gv/the_bear_case_for_summer_a_crash_in_the_next_48/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/obh4gv/the_bear_case_for_summer_a_crash_in_the_next_48/",
  "subreddit_subscribers": 2855141,
  "created_utc": 1625175579,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1625127021,
  "the_new_excerpt": "Hello everyone. I present a bear case for the summer.\n\nI've noticed people beginning to think about the risk of an imminent crash\nlately on various finance and, uhh, stock-gambling subreddits. What stocks to\nbuy in case there's a crash? Where is safe in a crash? That sort of thing. Take\na look…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。今回は、夏に向けてのベアケースをご紹介します。\n\n最近、様々な金融や株式ギャンブルのサブレッドで、人々が差し迫った暴落のリスクについて考え始めていることに気づきました。\n最近、様々な金融や株式ギャンブルのサブレディットで、差し迫った暴落のリスクについて考え始めている人がいることに気づきました。暴落に備えてどのような銘柄を\n暴落に備えてどの銘柄を買うか？暴落しても安全な場所は？そんなことを考えています。見て\n見てください。",
      "title": "The Bear Case for Summer: 今後4～8週間で暴落？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。我提出一个夏季的熊市案例。\n\n我注意到人们开始考虑即将发生的崩溃风险\n最近，在各种金融和，呃，股票赌博的子版块上，人们开始思考即将到来的崩溃风险。买什么股票\n买什么股票，以防崩盘？崩溃时哪里是安全的？诸如此类的问题。请看\n看一下...",
      "title": "夏季的熊市案例。未来4-8周内发生崩盘？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。我提出一個夏季的熊市案例。\n\n我注意到人們開始考慮即將發生的崩潰風險\n最近，在各種金融和，呃，股票賭博的子版塊上，人們開始思考即將到來的崩潰風險。買什麼股票\n買什麼股票，以防崩盤？崩潰時哪裏是安全的？諸如此類的問題。請看\n看一下...",
      "title": "夏季的熊市案例。未來4-8周內發生崩盤？"
    }
  ],
  "source_updated_at": 1625823778025
}