{
  "author": "Supercharmeleon",
  "original_created_utc": 1635786289,
  "title": "In the wake of this whole Squid situation, let's all be honest with each other: how many of you actually read whitepapers?",
  "created_utc": 1635810100,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let he who is without sin cast the first stone, as they say.</p>\n\n<p>Can all of you tell me, honestly, that you&#39;ve read the whitepaper of every single coin you hold/held? Because I couldn&#39;t say that. I&#39;ve read ALGO&#39;s and CKB&#39;s, but not LINK&#39;s or DOT&#39;s. I know what they&#39;re about, of course, I&#39;ve done my research, but I&#39;ve never read the whitepapers themselves.</p>\n\n<p>Of course, Squid was sus from the beginning and people should&#39;ve really done <em>some</em> research before jumping into it, but can you guys say you&#39;ve read whitepapers before? I&#39;m curious.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qkii6v/in_the_wake_of_this_whole_squid_situation_lets/",
  "subreddit": "CryptoCurrency",
  "id": "qkii6v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let he who is without sin cast the first stone, as they say.\n\nCan all of you tell me, honestly, that you've read the whitepaper of every\nsingle coin you hold/held? Because I couldn't say that. I've read ALGO's and\nCKB's, but not LINK's or DOT's. I know what they're about, of course, I've done\nmy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "罪のない者が最初の石を投げなさい、と言われています。\n\n皆さんは、正直に言って、これまでに発売されたすべてのコインのホワイトペーパーを読んだと言えますか？\n読んだと正直に言えますか？私はそう言えなかったからです。ALGOやCKBのものは読みましたが\nCKBのものは読んだが、LINKやDOTのものは読んでいない。もちろん、それらが何であるかは知っています。\n私の...",
      "title": "今回のSquidの件を受けて、正直に言うと、実際にホワイトペーパーを読んでいる人はどれくらいいるのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如他们所说，让没有罪的人投下第一块石头。\n\n你们所有人都能诚实地告诉我，你们已经阅读了每一份白皮书吗？\n币的白皮书？因为我不能这么说。我读过ALGO的和\nCKB的，但没有LINK或DOT的。当然，我知道它们的内容，我已经做了\n我的...",
      "title": "在整个Squid事件之后，让我们彼此坦诚：你们中有多少人真正读过白皮书？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如他們所說，讓沒有罪的人投下第一塊石頭。\n\n你們所有人都能誠實地告訴我，你們已經閱讀了每一份白皮書嗎？\n幣的白皮書？因爲我不能這麼說。我讀過ALGO的和\nCKB的，但沒有LINK或DOT的。當然，我知道它們的內容，我已經做了\n我的...",
      "title": "在整個Squid事件之後，讓我們彼此坦誠：你們中有多少人真正讀過白皮書？"
    }
  ]
}