{
  "author": "CAS_Appreciator",
  "original_created_utc": 1657711178,
  "title": "Historically, Muslim countries have had strong alcohol cultures. Nowadays, alcohol is prohibited in many Muslim countries. How did this transition affect local alcohol industry?",
  "created_utc": 1657736583,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I read from Wikipedia that Iran (for instance) used to have 300 wineries before the Revolution of 1797, but now there are none. So what happened to the owners of vineyards, brewers, tavernkeepers, etc.? Did they lose their livelihoods? Were they somehow compensated? What effect did the degeneration of viniculture have on the global economy?&lt;/p&gt;\n\n&lt;p&gt;I named Iran and 1979, but really any time and place will do. Thanks in advance!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/vy0st9/historically_muslim_countries_have_had_strong/",
  "subreddit": "AskHistorians",
  "id": "vy0st9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I read from Wikipedia that Iran (for instance) used to have 300 wineries before\nthe Revolution of 1797, but now there are none. So what happened to the owners\nof vineyards, brewers, tavernkeepers, etc.? Did they lose their livelihoods?\nWere they somehow compensated? What effect did the degeneration…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィキペディアで読んだのですが、イラン（例えば）には以前300のワイナリーがあったそうです。\n1797年の革命以前は300のワイナリーがあったそうですが、今はゼロ。では、ブドウ園のオーナーや醸造家、居酒屋の店主などはどうなったのでしょうか。\nブドウ畑のオーナー、醸造家、居酒屋の店主などはどうなったのでしょうか。彼らは生計を立てられなくなったのだろうか。\n補償はされたのだろうか。堕落はどのような影響を及ぼしたのだろうか。",
      "title": "歴史的に見ると、イスラム圏の国々は強いアルコール文化を持っています。現在では、多くのイスラム教国でアルコールが禁止されています。この変遷は、現地のアルコール産業にどのような影響を与えたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从维基百科上读到，伊朗（例如）以前有300家葡萄酒厂。\n1797年革命前有300家葡萄酒厂，但现在没有了。那么，葡萄园主、酿酒师、酒馆老板等人的情况如何呢？\n葡萄园的主人、酿酒师、酒馆老板等等？他们失去了他们的生计吗？\n他们是否得到了某种补偿？堕落产生了什么影响？",
      "title": "历史上，穆斯林国家有强大的酒文化。如今，许多穆斯林国家都禁止饮酒。这种转变是如何影响当地的酒业的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從維基百科上讀到，伊朗（例如）以前有300家葡萄酒廠。\n1797年革命前有300家葡萄酒廠，但現在沒有了。那麼，葡萄園主、釀酒師、酒館老闆等人的情況如何呢？\n葡萄園的主人、釀酒師、酒館老闆等等？他們失去了他們的生計嗎？\n他們是否得到了某種補償？墮落產生了什麼影響？",
      "title": "歷史上，穆斯林國家有強大的酒文化。如今，許多穆斯林國家都禁止飲酒。這種轉變是如何影響當地的酒業的？"
    }
  ]
}