{
  "author": "QuotableConservative",
  "original_created_utc": 1651033910,
  "title": "Can I report someone for their headlights?",
  "created_utc": 1651060371,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in a bottom floor apartment. Somewhere in this complex, lives someone who parks outside of my window at night, and leaves their lights on.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve gone outside to speak to them, but oddly, they aren&amp;#39;t in their car?&lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;ll leave them on for a couple of hours, with their car running. I honest to god have no fucking idea what they are doing. I also haven&amp;#39;t caught them.&lt;/p&gt;\n\n&lt;p&gt;I know that this sounds totally looney tunes, I know. &amp;quot;Leaves their car and lights on for hours? No way.&amp;quot; I swear they do. &lt;/p&gt;\n\n&lt;p&gt;My landlords don&amp;#39;t own every building in this area so they don&amp;#39;t know who drives the Jeep.&lt;/p&gt;\n\n&lt;p&gt;Can I call the police? Can they be towed? It&amp;#39;s literally driving me fucking crazy. Who does this?! Why leave your lights on?!&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m leaving a note on their car tonight, but goddamn, dude. I need to know if I can take it further if necessary?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/ucvapy/can_i_report_someone_for_their_headlights/",
  "subreddit": "NoStupidQuestions",
  "id": "ucvapy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I live in a bottom floor apartment. Somewhere in this complex, lives someone who\nparks outside of my window at night, and leaves their lights on.\n\nI've gone outside to speak to them, but oddly, they aren't in their car?\n\nThey'll leave them on for a couple of hours, with their car running. I honest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアパートの最下層に住んでいる。この団地のどこかに、夜、窓の外に車を停めて、明かりをつけっぱなしにする人が住んでいる。\n夜、窓の外に車を停めて、ライトを点けたままにしている人がいます。\n\n声をかけようと外に出てみると、不思議なことに車に乗っていない？\n\n彼らは車を走らせたまま、2、3時間つけっぱなしにするんです。正直言って...",
      "title": "ヘッドライトで通報してもいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在一个底层公寓。在这个小区的某个地方，住着一个人\n晚上把车停在我的窗外，还开着灯。\n\n我到外面和他们说话，但奇怪的是，他们不在车里？\n\n他们会把灯开着几个小时，而他们的车在运行。我真的...",
      "title": "我可以举报某人的大灯吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在一個底層公寓。在這個小區的某個地方，住着一個人\n晚上把車停在我的窗外，還開着燈。\n\n我到外面和他們說話，但奇怪的是，他們不在車裏？\n\n他們會把燈開着幾個小時，而他們的車在運行。我真的...",
      "title": "我可以舉報某人的大燈嗎？"
    }
  ]
}