{
  "author": "TNGSystems",
  "the_new_excerpt": "I remember looking at the Top 10 in 2019 and thinking “Bitcoin fork, bitcoin\nfork, EOS scam token, TRON rubbish” and wondering why legit projects weren’t\nranked higher. It’s been a long time but that day is finally almost here. I know\nit will probably have a huge bounce as BCH is wont to do, but it…",
  "original_created_utc": 1612521231,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我记得我看着2019年的前十名，心想 \"比特币分叉，比特币\n分叉，EOS诈骗令牌，TRON垃圾\"，并想知道为什么合法项目没有。\n排名较高。虽然过了很久，但那一天终于快到了。我知道...\n它可能会有一个巨大的反弹，因为BCH是惯于做的，但它... ...",
      "title": "自2017年以来首次，比特币现金即将跌出前十。我发现自己其实是在为Stellar的粉丝们欢呼"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得我看着2019年的前十名，心想 \"比特幣分叉，比特幣\n分叉，EOS詐騙令牌，TRON垃圾\"，並想知道爲什麼合法項目沒有。\n排名較高。雖然過了很久，但那一天終於快到了。我知道...\n它可能會有一個巨大的反彈，因爲BCH是慣於做的，但它... ...",
      "title": "自2017年以來首次，比特幣現金即將跌出前十。我發現自己其實是在爲Stellar的粉絲們歡呼"
    }
  ],
  "title": "For the first time since 2017, Bitcoin Cash is about to drop out of the top 10. I find myself actually cheering for the Stellar fans",
  "created_utc": 1612553490,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember looking at the Top 10 in 2019 and thinking “Bitcoin fork, bitcoin fork, EOS scam token, TRON rubbish” and wondering why legit projects weren’t ranked higher. It’s been a long time but that day is finally almost here. I know it will probably have a huge bounce as BCH is wont to do, but it is cathartic to see the top 15 filled with such excellent projects and the chaff is being slowly sent down the ranks.  </p>\n\n<p>Good work and good luck with your investments everyone. BCH, please don’t take it personally but there’s too much bad air surrounding BCH so its time has come.</p>\n</div><!-- SC_ON -->",
  "score": 347,
  "permalink": "/r/CryptoCurrency/comments/ld4igv/for_the_first_time_since_2017_bitcoin_cash_is/",
  "subreddit": "CryptoCurrency",
  "id": "ld4igv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123193195
}