{
  "author": "unprotextor",
  "original_created_utc": 1628972086,
  "title": "My recipe for success in crypto after 8 years",
  "created_utc": 1628983835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m pretty much a whale by now after 8 years in crypto. I started with nothing but a normal source of income and I didn&#39;t strike lucky on a megapump or anything like that. Just steady profit taking and a simple rule I <em>never</em> break.</p>\n\n<p><strong>If anyone wants to play the long game, here&#39;s how I play it</strong> (initially shared in comments, then people asked me to share it)</p>\n\n<ul>\n<li>I sell 20% of my bag after 40% profit, as a hard rule. Then I DCA back in during dips and bear markets using my main source of income and post-tax staking rewards. Works reliably every time. It&#39;s worth rewriting that as &quot;taking profit, but still with 80% of the portfolio intact&quot;</li>\n<li>The 40% profit level is usually hit 2-3 times during bull runs, but sometimes only 1. Profits end up in a composite index fund, and I prepay taxes.</li>\n<li>I&#39;m fairly diversified (around 30 coins), with a mix of oldcoins, solid midcap projects and a few microcaps. I do a lot of research and immerse myself into the communities of most of these coins. If something starts to smell bad, I sell immediately.</li>\n<li>I stake whenever I can, some coins are up to 20% APY <em>without lockup</em>. This is now a significant stream of passive income.</li>\n<li>I completely ignore fads and shitcoins. Just solid projects with a good plan.</li>\n</ul>\n\n<p>Key takeaways: I make no attempt to time the market, and &quot;hodling&quot; across bull runs is <em>not</em> effective.</p>\n\n<p>This is a powerful strategy, because you get to have a crypto exposure, yet benefit from the magic of compound interest in fiat.</p>\n</div><!-- SC_ON -->",
  "score": 225,
  "permalink": "/r/CryptoCurrency/comments/p4f8pi/my_recipe_for_success_in_crypto_after_8_years/",
  "subreddit": "CryptoCurrency",
  "id": "p4f8pi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I'm pretty much a whale by now after 8 years in crypto. I started with\nnothing but a normal source of income and I didn't strike lucky on a megapump or\nanything like that. Just steady profit taking and a simple rule I never break.\n\nIf anyone wants to play the long game, here's how I play it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "というわけで、暗号化を始めて8年が経過した今、私はかなりのクジラになっています。私は何もないところから始めました。\n普通の収入源しかなく、メガポンプなどの幸運にも恵まれませんでした。\n何の幸運もありませんでした。堅実な利益確定と、絶対に破らないシンプルなルールだけです。\n\nもし誰かがロングゲームをしたいと思ったら、これが私のやり方です...。",
      "title": "8年後に暗号で成功するための私のレシピ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我在加密货币领域工作了8年，现在几乎是一条鲸鱼了。我开始时\n除了正常的收入来源，我并没有幸运地在一个巨大的泵或\n诸如此类的事情。只是稳定的获利和一个简单的规则，我从不违反。\n\n如果有人想玩长期游戏，我是这样玩的...",
      "title": "8年后我在加密货币领域的成功秘诀"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我在加密貨幣領域工作了8年，現在幾乎是一條鯨魚了。我開始時\n除了正常的收入來源，我並沒有幸運地在一個巨大的泵或\n諸如此類的事情。只是穩定的獲利和一個簡單的規則，我從不違反。\n\n如果有人想玩長期遊戲，我是這樣玩的...",
      "title": "8年後我在加密貨幣領域的成功祕訣"
    }
  ]
}