{
  "author": "illintent99",
  "original_created_utc": 1639053133,
  "title": "If you bought in at 'ATH' and it fell off a cliff doesn't mean it will never climb it's way back up again. Trust me.",
  "created_utc": 1639064243,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you&amp;#39;re new and haven&amp;#39;t been around atleast a couple cycles, it&amp;#39;s easy to let the charts get to you when you&amp;#39;re down. I used to check them constantly trying to find the &amp;quot;dip&amp;quot; (I didn&amp;#39;t really understand what that was at the time) in the middle of a bull run... it was even more after it had a major, prolonged (actual) dip. I was off the ATH by less than 5% on the buy in. &lt;/p&gt;\n\n&lt;p&gt;I remember feeling like a fool for learning FOMO the hard way. I also made the mistake of telling 2 people I got into Crypto, and was up. I was green for less than a week and was constantly asked &amp;#39;how much was I up now?&amp;#39; In the following red months. &lt;/p&gt;\n\n&lt;p&gt;Those months did end though. I kept buying, lowering my average purchase price. Even with recent &amp;#39;crashes&amp;#39; (I use that term loosely) I&amp;#39;m still green.&lt;/p&gt;\n\n&lt;p&gt;Now not every coin does this, but some do. DYOR to find out which ones.&lt;/p&gt;\n\n&lt;p&gt;Edit: This ofcourse excludes shitcoins.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 288,
  "permalink": "/r/CryptoCurrency/comments/rcgq5f/if_you_bought_in_at_ath_and_it_fell_off_a_cliff/",
  "subreddit": "CryptoCurrency",
  "id": "rcgq5f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you're new and haven't been around atleast a couple cycles, it's easy to let\nthe charts get to you when you're down. I used to check them constantly trying\nto find the \"dip\" (I didn't really understand what that was at the time) in the\nmiddle of a bull run... it was even more after it had a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、あなたが初心者で、少なくとも2サイクル以上経過していないのであれば、このようなことは簡単にできます。\n落ち込んでいるときは、チャートが気になるものです。私は以前、常にチャートをチェックし\nの \"ディップ\"（当時はそれが何なのかよく理解していませんでした）を見つけるために\n強気で走っている最中...強気で走った後はさらに...。",
      "title": "ATH」で買って崖から落ちたとしても、二度と上がらないわけではない。私を信じてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是新来的，还没有在这里呆过至少几个周期，就很容易让\n当你心情不好时，很容易让图表影响你。我曾经不断地检查它们，试图\n试图在一个周期的中间找到 \"低点\"（当时我并不真正理解那是什么）。\n在牛市运行过程中......在牛市运行结束后更是如此。",
      "title": "如果你在 \"ATH \"买入，它从悬崖上掉下来，并不意味着它将永远不会再爬起来了。相信我。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是新來的，還沒有在這裏呆過至少幾個週期，就很容易讓\n當你心情不好時，很容易讓圖表影響你。我曾經不斷地檢查它們，試圖\n試圖在一個週期的中間找到 \"低點\"（當時我並不真正理解那是什麼）。\n在牛市運行過程中......在牛市運行結束後更是如此。",
      "title": "如果你在 \"ATH \"買入，它從懸崖上掉下來，並不意味着它將永遠不會再爬起來了。相信我。"
    }
  ]
}