{
  "author": "EffectOpening6330",
  "the_new_excerpt": "Gonna write some of my DD here for yall so you don't have to. Still do your own,\nofc.\n\nCompany? Disruptive. Risk? High. (Possible)Reward? Insane.\n\n\nAURINIA: THE UNDERDOG\n\n\nCONTEXT:\n\nFirst off, the voclosporin drug Aurinia's been working on is up for FDA approval\non Friday, though it's their only…",
  "original_created_utc": 1611063418,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我要把我的一些DD写在这里给你们，这样你们就不用写了。还是做你自己的。\nofc.\n\n的公司？颠覆性的。的风险？高。(可能的)回报? 疯了\n\n\n奥里尼亚：\"弱者\n\n\n语境。\n\n首先，Aurinia一直在研究的voclosporin药物已经通过了FDA的审批\n上周五，虽然这是他们唯一的... ...",
      "title": "Auph.T 医药界的弱者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我要把我的一些DD寫在這裏給你們，這樣你們就不用寫了。還是做你自己的。\nofc.\n\n的公司？顛覆性的。的風險？高。(可能的)回報? 瘋了\n\n\n奧里尼亞：\"弱者\n\n\n語境。\n\n首先，Aurinia一直在研究的voclosporin藥物已經通過了FDA的審批\n上週五，雖然這是他們唯一的... ...",
      "title": "Auph.T 醫藥界的弱者"
    }
  ],
  "title": "Auph: The Pharma Underdog",
  "created_utc": 1611107554,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong><em>Gonna write some of my DD here for yall so you don&#39;t have to. Still do your own, ofc.</em></strong></p>\n\n<p><strong><em>Company? Disruptive. Risk? High. (Possible)Reward? Insane.</em></strong></p>\n\n<h1>Aurinia: The Underdog</h1>\n\n<h1>Context:</h1>\n\n<p>First off, the voclosporin drug Aurinia&#39;s been working on is up for FDA approval on Friday, though it&#39;s their only project as of right now, and that&#39;s probably why the stock is down for 1y. The government in the U.K. already approved a drug for the same disease (Ticker GSK) a month or so ago, the stock all but stayed the same. Though, it&#39;s rumored that Aurinia&#39;s could be far better.</p>\n\n<p>Aurinia had a massive jump back in Feb. 2017 due to a combination of project news, a lot of institutional buying, hype, etc. though shares came back to reality (-30%ish) after a insider share lockup period ended. Gives me Nikola vibes. Eew.</p>\n\n<p>Also got cannoned up in late 2019 mainly due to project news.</p>\n\n<p>Disease name is lupus nephritis, if you want to do more research on their drug.</p>\n\n<p><strong>Financials and Growth:</strong></p>\n\n<p>Not profitable in the slightest, at least as of right now. 60m in total liabilities, but a surprising 1 million dollars in debt (To banks/institutions) which is far less than expected. Around -.28 EPS as of Q3, but that may soon change, with the ongoing project and it&#39;s offshoots. They&#39;ve been operating at a large loss</p>\n\n<p><strong>Current and Future Revenue:</strong></p>\n\n<p>Now, onto the JUICY stuff! Projections and guesswork galore!</p>\n\n<p>Well, as far as current... there is none. The reason why they have so much (55%) institutional shareholders is because of the fact that they haven&#39;t had a single million dollars roll through the bank and they need a constant medical bag full of funding from the big boys on Wall Street.</p>\n\n<p>As far as the future, AUPH&#39;s leadership team has put together a plan of ruthless investment into their pharmaceuticals to make themselves a big player in Canada. That&#39;s part of the reason why they blew through 100m+ last year.</p>\n\n<p>With this drug they&#39;re making, well... Let me just tell you the details.</p>\n\n<p>GSK, the company from earlier, has it&#39;s headquarters in and mainly operates in the U.K. Aurinia, however, operates in both Canada and the U.S.</p>\n\n<p>The disease is named Lupus Nephritis, or autoimmune disease. It&#39;s a worse case of normal lupus, and is far more deadly. There&#39;s currently no cure, and doctors around the world almost always only tread the symptoms.</p>\n\n<p>If their drug is good enough to provide stable treatment of the actual disease itself, then they could be in for billions in revenue as they expand around the world. My current projection is 5.5bn by 2025, and 1bn if something goes wrong along the way.</p>\n\n<p>Aurinia as a company is rated as ~70% undervalued, taken from a total of around 20 stock analysts. They&#39;re negative as far as revenue, though if this drug becomes widespread, they could become very revenue positive (Can&#39;t say profitable just yet, might not happen &#39;til 2022 or later)</p>\n\n<p>Other info:</p>\n\n<ul>\n<li>A whopping 90% of analysts have price targets above APHA&#39;s current share price!!! Holy cow!</li>\n<li>Every line of resistance imaginable points to an rocket in either direction, though they point more upward than downward. There&#39;s been a wedge for the past year, and an FDA approval Friday could turn this into either a WeWork or a Tesla. We will see.</li>\n</ul>\n\n<p>I also want to note that the site that I use for DD is rating Aurinia&#39;s fair value at $110. So... Value + Growth stock? Fatal disease curing spurred Tesla-like breakout? We&#39;ll find out Friday!</p>\n\n<p><strong><em>TL,DR: Stock could go up 50%+ on approval, or it could go down -50%+, as this one drug is basically it&#39;s entire future. Revenue with FDA approval could be as high as 5bn by 2025.</em></strong></p>\n\n<p><em>How I&#39;m playing it: (Not financial advice,</em> <em><del>don&#39;t get me arrested</del></em>*)*</p>\n\n<p>I plan on buying a whole bunch of shares, doing a risky call spread with Feb. expiry, then buying a LEAP and/or selling a put or two. Should come out to 3k to 10k, depending on how much money I want to possibly erase off the face of the Earth.</p>\n\n<p>As of writing this, it&#39;s up 4% in premarket already. The news is starting to get around a bit.</p>\n\n<p>Also, if someone from Canada here can tell me what the prices are early on CSX, that&#39;d be great.</p>\n\n<p><strong>Sources:</strong></p>\n\n<p><a href=\"https://simplywall.st/stocks/ca/pharmaceuticals-biotech/tsx-aup/aurinia-pharmaceuticals-shares\">https://simplywall.st/stocks/ca/pharmaceuticals-biotech/tsx-aup/aurinia-pharmaceuticals-shares</a></p>\n\n<p><a href=\"https://endpts.com/after-losing-race-for-first-to-market-in-lupus-nephritis-aurinia-taps-otsuka-for-voclosporin-licensing-pact-abroad/\">https://endpts.com/after-losing-race-for-first-to-market-in-lupus-nephritis-aurinia-taps-otsuka-for-voclosporin-licensing-pact-abroad/</a></p>\n\n<p>(Seeking Alpha link would go here if the damn AutoMod didn&#39;t take down my post.)</p>\n\n<p><a href=\"https://ir.auriniapharma.com/\">https://ir.auriniapharma.com/</a></p>\n\n<p><a href=\"https://d1io3yog0oux5.cloudfront.net/_d5224235ef1d27ef939d1c33666b318d/auriniapharma/db/246/991/pdf/Aurinia_Presentation_-CorpDeck-FINAL_Jan21.pdf\">https://d1io3yog0oux5.cloudfront.net/_d5224235ef1d27ef939d1c33666b318d/auriniapharma/db/246/991/pdf/Aurinia_Presentation_-CorpDeck-FINAL_Jan21.pdf</a></p>\n\n<p><a href=\"https://www.nasdaq.com/articles/aurinia-stock-to-surge-by-80-this-5-star-analyst-thinks-its-possible-2020-11-13\">https://www.nasdaq.com/articles/aurinia-stock-to-surge-by-80-this-5-star-analyst-thinks-its-possible-2020-11-13</a></p>\n\n<p><strong>Bearish source, for good balance:</strong></p>\n\n<p><a href=\"https://www.macroaxis.com/invest/market/AUPH--Aurinia-Pharmaceuticals\">https://www.macroaxis.com/invest/market/AUPH--Aurinia-Pharmaceuticals</a></p>\n\n<p>thanks for coming to my TedTalk. This is my first time doing in-depth(ish research like this, so give me all the criticisms your hearts desire!)</p>\n\n<p>Also, Theta Gang for Life.</p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/stocks/comments/l0jygs/auph_the_pharma_underdog/",
  "subreddit": "stocks",
  "id": "l0jygs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311219650
}