{
  "author": "Trini_Gamer10",
  "original_created_utc": 1642197156,
  "title": "What has influenced so many Americans to call the Confederacy their \"heritage\" despite it only existing for 4 and a half years? Nazi Germany existed for 13 and very very few Germans consider it as their heritage.",
  "created_utc": 1642268460,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I get that part of it is Germany&amp;#39;s heavy de-nazification process, however during the Cold War era, West Germany still had a lot of heavy Nazi sympathizers and there was no real de-nazification in Germany until a few years after reunification because of pressure from the East which implemented heavy de-nazification protocols from the beginning of Soviet occupation.  &lt;/p&gt;\n\n&lt;p&gt;However despite the amount of Nazi sympathizers/nostalgists in West Germany, which even had plenty of ex-NDSAP members in government and high business positions, nowadays you see almost no one of German descent claiming that the era of Nazi Germany was their &amp;quot;heritage&amp;quot;, and the whole ordeal happened less than 100 years ago. Yet the Confederacy, which fell 157 years ago, still has millions of Americans - some whose ancestors weren&amp;#39;t even living in Confederate states during the small time it existed, vehemently claim that the CSA is their &amp;quot;heritage&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;What caused this mass amount of Americans living in the ex-Confederate states, and even some living in non-Confederate states, to claim that the Confederacy is their &amp;quot;true heritage&amp;quot; and that the USA which has long both predated and outlived the CSA is not their &amp;quot;true&amp;quot; home country? And why has this obsession with a country that barely existed for 4 years been concentrated to the US, and never occurred in other countries with short-lived fascist governments?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/s43o4b/what_has_influenced_so_many_americans_to_call_the/",
  "subreddit": "NoStupidQuestions",
  "id": "s43o4b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I get that part of it is Germany's heavy de-nazification process, however during\nthe Cold War era, West Germany still had a lot of heavy Nazi sympathizers and\nthere was no real de-nazification in Germany until a few years after\nreunification because of pressure from the East which implemented…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドイツの脱ナチス化の流れもあるのでしょうが、しかし、その間に\n冷戦時代の西ドイツは、まだナチスへのシンパが多く残っていて\nドイツでは、数年後まで、本当の意味での脱ナチス化は行われていませんでした。\n東側からの圧力で統一され、東側が実施した...",
      "title": "南部連合が4年半しか存在しなかったにもかかわらず、これほど多くのアメリカ人が「遺産」と呼ぶのはなぜだろうか。ナチスドイツは13年間存在したが、それを自分たちの遺産だと考えるドイツ人はほとんどいない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道部分原因是德国正在进行大规模的去纳粹化进程，然而在冷战时期，西德仍然有很多严重的纳粹同情者和\n在冷战时期，西德仍然有很多严重的纳粹同情者，直到几年后，德国才有真正的去纳粹化。\n直到统一后几年，德国才有了真正的去纳粹化。\n因为来自东方的压力，它实施了...",
      "title": "是什么影响了这么多美国人将南方联盟称为他们的 \"遗产\"，尽管它只存在了4年半？纳粹德国存在了13年，很少有德国人认为它是他们的遗产。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道部分原因是德國正在進行大規模的去納粹化進程，然而在冷戰時期，西德仍然有很多嚴重的納粹同情者和\n在冷戰時期，西德仍然有很多嚴重的納粹同情者，直到幾年後，德國纔有真正的去納粹化。\n直到統一後幾年，德國纔有了真正的去納粹化。\n因爲來自東方的壓力，它實施了...",
      "title": "是什麼影響了這麼多美國人將南方聯盟稱爲他們的 \"遺產\"，儘管它只存在了4年半？納粹德國存在了13年，很少有德國人認爲它是他們的遺產。"
    }
  ]
}