{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I just don't understand how the \"metaverse\" won't just be a gimmick that is never widely adopted.  I do not see how it can be more attractive than just regular video chats where you see the actual person.  What am I missing?\n\nI've used VR headsets many many times and have owned one of my own...one of my biggest issues is that you get fatigued with that headset on your face pretty fast.  It puts weight on your face, it makes you too warm, and my eyes get fatigued staring at that screen for an extended period of time.\n\nFurthermore, with a video chat, you see the actual person, not just some animated cartoony looking version of them.  With a video chat, you see a person's subtle facial expressions, whereas the metaverse characters only pick up body movements and I don't see how they'd ever get to the point where they can pick up on every little facial expression that an actual video can pick up.\n\nI do think the metaverse can produce some really fun gaming opportunities, although I still feel they're a bit gimmicky.  I have noticed that Mark Zuckerberg seems to focus primarily on the business application of the metaverse.  I just don't understand how the metaverse can convince any significant number of businesses to buy metaverse equipment and get into the whole metaverse, when we already have video chat capabilities.\n\nI believe Zuckerberg is a smart guy, but I don't understand how going ALL IN on the metaverse can possibly be a good idea.  Obviously there are other players in the metaverse space (not just Meta/Facebook), but Meta seems to the the furthest along and they're pouring billings of dollars into this.  The thing is, I think the traditional Facebook businesses are a solid investment.  Their \"Reels\" are growing very rapidly. 50% of the time people spend on facebook is on videos...a lot of that is Reels.  20% of time on Instagram is on Reels.  They're fighting back well against Tiktok.  But the fact that they've changed their name to Meta and they're going all in on the Metaverse makes it impossible for me to invest.\n\nThoughts? Am I missing something?\n\nEDIT: Okay a bunch of you keep bringing up how the Internet was initially viewed as a fad, implying the metaverse is destined to explode like the Internet. That's just illogical...how many tech ideas have been absolute busts that you're just ignoring? This discussion is about coming up with theories or use cases as to what could attract a billion people to the metaverse. Don't just point and say \"the Internet exploded!!!\"...create a discussion about what you think could make the metaverse explode like the Internet did.",
  "author_fullname": "t2_rb4i7",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Why is the metaverse something work investing billions of dollars in?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "discussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": true,
  "name": "t3_vizr6a",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.79,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 787,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": "",
  "secure_media_embed": {},
  "link_flair_text": "Industry Discussion",
  "can_mod_post": false,
  "score": 787,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1656000743,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1655998667,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just don&amp;#39;t understand how the &amp;quot;metaverse&amp;quot; won&amp;#39;t just be a gimmick that is never widely adopted.  I do not see how it can be more attractive than just regular video chats where you see the actual person.  What am I missing?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve used VR headsets many many times and have owned one of my own...one of my biggest issues is that you get fatigued with that headset on your face pretty fast.  It puts weight on your face, it makes you too warm, and my eyes get fatigued staring at that screen for an extended period of time.&lt;/p&gt;\n\n&lt;p&gt;Furthermore, with a video chat, you see the actual person, not just some animated cartoony looking version of them.  With a video chat, you see a person&amp;#39;s subtle facial expressions, whereas the metaverse characters only pick up body movements and I don&amp;#39;t see how they&amp;#39;d ever get to the point where they can pick up on every little facial expression that an actual video can pick up.&lt;/p&gt;\n\n&lt;p&gt;I do think the metaverse can produce some really fun gaming opportunities, although I still feel they&amp;#39;re a bit gimmicky.  I have noticed that Mark Zuckerberg seems to focus primarily on the business application of the metaverse.  I just don&amp;#39;t understand how the metaverse can convince any significant number of businesses to buy metaverse equipment and get into the whole metaverse, when we already have video chat capabilities.&lt;/p&gt;\n\n&lt;p&gt;I believe Zuckerberg is a smart guy, but I don&amp;#39;t understand how going ALL IN on the metaverse can possibly be a good idea.  Obviously there are other players in the metaverse space (not just Meta/Facebook), but Meta seems to the the furthest along and they&amp;#39;re pouring billings of dollars into this.  The thing is, I think the traditional Facebook businesses are a solid investment.  Their &amp;quot;Reels&amp;quot; are growing very rapidly. 50% of the time people spend on facebook is on videos...a lot of that is Reels.  20% of time on Instagram is on Reels.  They&amp;#39;re fighting back well against Tiktok.  But the fact that they&amp;#39;ve changed their name to Meta and they&amp;#39;re going all in on the Metaverse makes it impossible for me to invest.&lt;/p&gt;\n\n&lt;p&gt;Thoughts? Am I missing something?&lt;/p&gt;\n\n&lt;p&gt;EDIT: Okay a bunch of you keep bringing up how the Internet was initially viewed as a fad, implying the metaverse is destined to explode like the Internet. That&amp;#39;s just illogical...how many tech ideas have been absolute busts that you&amp;#39;re just ignoring? This discussion is about coming up with theories or use cases as to what could attract a billion people to the metaverse. Don&amp;#39;t just point and say &amp;quot;the Internet exploded!!!&amp;quot;...create a discussion about what you think could make the metaverse explode like the Internet did.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "call_to_action": "",
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#4f8ef7",
  "id": "vizr6a",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Machiavelli127",
  "discussion_type": null,
  "num_comments": 159,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/vizr6a/why_is_the_metaverse_something_work_investing/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/vizr6a/why_is_the_metaverse_something_work_investing/",
  "subreddit_subscribers": 4212666,
  "created_utc": 1656003238,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1655998667,
  "the_new_excerpt": "I just don't understand how the \"metaverse\" won't just be a gimmick that is\nnever widely adopted. I do not see how it can be more attractive than just\nregular video chats where you see the actual person. What am I missing?\n\nI've used VR headsets many many times and have owned one of my own...one of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メタバース」が単なるギミックで、広く採用されることがないのが理解できない。\nメタバースは単なるギミックで、決して広く採用されることはないでしょう。実際の人が見える普通のビデオチャットよりも魅力的だとは思えません。\n魅力的なものになるとは思えません。何が足りないのでしょうか？\n\n私は何度もVRヘッドセットを使ったことがあり、自分でも1台所有しています...1台...",
      "title": "なぜメタバースは何十億円も投資する仕事なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是不明白，\"元空间 \"怎么会不只是一个噱头，而永远不会被广泛采用呢？\n永远不会被广泛采用。我不明白它怎么会比普通的视频聊天更有吸引力？\n普通的视频聊天，你可以看到真实的人。我错过了什么？\n\n我使用过很多很多次VR头盔，也拥有过自己的一个......一个......。",
      "title": "为什么元空间是投资数十亿美元的工作？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是不明白，\"元空間 \"怎麼會不只是一個噱頭，而永遠不會被廣泛採用呢？\n永遠不會被廣泛採用。我不明白它怎麼會比普通的視頻聊天更有吸引力？\n普通的視頻聊天，你可以看到真實的人。我錯過了什麼？\n\n我使用過很多很多次VR頭盔，也擁有過自己的一個......一個......。",
      "title": "爲什麼元空間是投資數十億美元的工作？"
    }
  ],
  "source_updated_at": 1656063750419
}