{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Trees are diverse, and tree height can tell us a lot about Earth's ecosystems.\nSatellites and ground-based measurements are used to track tree location,\ngrowth, monitor how well an ecosystem supports trees, and estimate how much\ncarbon is stored by trees. GLOBE [https://www.globe.gov/] encourages…",
  "original_created_utc": 1620298830,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "樹木には多様性があり、樹木の高さは地球の生態系について多くのことを教えてくれます。\n人工衛星や地上での測定により、樹木の位置や成長を追跡しています。\n樹木の位置や成長を把握し、生態系がどれだけ樹木を支えているかを監視し\n樹木が蓄えている炭素の量を推定することができます。GLOBE [https://www.globe.gov/]では...",
      "title": "AskScience AMAシリーズ。Redditの皆さん、こんにちは。私たちは、土地被覆や炭素を含む、森林や木の高さのデータを扱う科学者です。私たちの多くは、NASAをはじめとする研究機関で、衛星と地上の測定を組み合わせて使用しています。AUAでは、樹木について、また、樹木が気候変動の調整にどのように役立つかについて説明しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "树木是多样化的，而树木的高度可以告诉我们很多关于地球生态系统的信息。\n卫星和地面的测量被用来追踪树木的位置。\n生长，监测生态系统对树木的支持程度，并估计树木储存了多少碳。\n树木所储存的碳的数量。GLOBE [https://www.globe.gov/] 鼓励...",
      "title": "AskScience AMA系列。嗨，Reddit! 我们是从事森林和树木高度数据的科学家，包括土地覆盖和碳。我们中的许多人在与美国国家航空航天局及其他机构的研究中使用了卫星和地面测量的组合。AUA关于树木以及它们如何帮助我们调节气候变化。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "樹木是多樣化的，而樹木的高度可以告訴我們很多關於地球生態系統的信息。\n衛星和地面的測量被用來追蹤樹木的位置。\n生長，監測生態系統對樹木的支持程度，並估計樹木儲存了多少碳。\n樹木所儲存的碳的數量。GLOBE [https://www.globe.gov/] 鼓勵...",
      "title": "AskScience AMA系列。嗨，Reddit! 我們是從事森林和樹木高度數據的科學家，包括土地覆蓋和碳。我們中的許多人在與美國國家航空航天局及其他機構的研究中使用了衛星和地面測量的組合。AUA關於樹木以及它們如何幫助我們調節氣候變化。"
    }
  ],
  "title": "AskScience AMA Series: Hey Reddit! We are scientists working with forest and tree height data, including land cover and carbon. Many of us use a combination of satellite and ground measurements in our research with NASA and beyond. AUA about trees and how they can help us regulate climate change.",
  "created_utc": 1620327908,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Trees are diverse, and tree height can tell us a lot about Earth&#39;s ecosystems. Satellites and ground-based measurements are used to track tree location, growth, monitor how well an ecosystem supports trees, and estimate how much carbon is stored by trees. <a href=\"https://www.globe.gov/\">GLOBE</a> encourages the citizen scientist community to use the GLOBE Observer app to take <a href=\"https://observer.globe.gov/do-globe-observer/trees/taking-observations\">tree height</a> measurements with their smartphones.  These observations are added to a freely available, global inventory of tree height.</p>\n\n<p>Tree science experts are standing by. Ask us anything!</p>\n\n<ul>\n<li>Nancy Glenn, Remote Sensing Researcher, Forest Ecosystems, Boise State University (NASA ICESat-2 Early Adopter)</li>\n<li>Erika Podest, Physical Scientist, Carbon Cycle and Ecosystems Group, NASA Jet Propulsion Laboratory</li>\n<li>Lola Fatoyinbo, Research Physical Scientist, Forest Ecology and Ecosystems, NASA Goddard Space Flight Center</li>\n<li>Paul Montesano, Physical Researcher, Remote Sensing of Boreal Forest Structure, NASA Goddard Space Flight Center</li>\n<li>Peder Nelson, Researcher and Instructor, NASA GLOBE Observer Land Cover Science Lead, Oregon State University</li>\n<li>Brian Campbell, NASA Senior Earth Science Specialist, NASA GLOBE Observer Trees Science Lead, NASA Wallops Flight Facility</li>\n</ul>\n\n<p>We&#39;ll be online from 2-3 PM ET (6-7 PM UTC) to answer your questions. See you soon!</p>\n\n<p><em>You can download the <a href=\"https://observer.globe.gov/about/get-the-app\">GLOBE Observer app</a> and start taking tree height measurements today. You can also take part in our current <a href=\"https://observer.globe.gov/do-globe-observer/challenges/community-trees-challenge-2021\">Community Trees Challenge</a> now through May 15. Always follow guidelines from your local officials, and only participate in GLOBE activities or use the GLOBE Observer app if it is safe to do so.</em></p>\n\n<p>PROOF: <a href=\"https://twitter.com/GLOBEProgram/status/1389610772033150977\">https://twitter.com/GLOBEProgram/status/1389610772033150977</a></p>\n\n<p>Username: <a href=\"/u/nasa\">/u/nasa</a></p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askscience/comments/n64npm/askscience_ama_series_hey_reddit_we_are/",
  "subreddit": "askscience",
  "id": "n64npm",
  "is_self": true,
  "media": null,
  "is_video": false
}