{
  "author": "anoriginalmoniker",
  "the_new_excerpt": "I watched Hitchcock's Notorious last night, which came out in August of 1946,\nabout a year after the bombs were dropped. SPOLIER ALERT...in case you haven't\nseen the movie (it's only been out for 75 years)! I was taken aback that\nHitchcock used enriched uranium as his MacGuffin for a film that came…",
  "original_created_utc": 1613433799,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我昨晚看了希区柯克的《臭名昭著》，它是1946年8月问世的。\n大约一年后，炸弹被投下。斯波利尔警报......万一你还没有。\n看过这部电影(75年才出的)! 我被吓了一跳\n希区柯克用浓缩铀做为他电影中的 \"麦克格芬\"，来... ...",
      "title": "美国政府向公众传播原子弹和曼哈顿计划信息的策略是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨晚看了希區柯克的《臭名昭著》，它是1946年8月問世的。\n大約一年後，炸彈被投下。斯波利爾警報......萬一你還沒有。\n看過這部電影(75年纔出的)! 我被嚇了一跳\n希區柯克用濃縮鈾做爲他電影中的 \"麥克格芬\"，來... ...",
      "title": "美國政府向公衆傳播原子彈和曼哈頓計劃信息的策略是什麼？"
    }
  ],
  "title": "What was the U.S.A government's strategy for disseminating information on the atomic bombs and The Manhattan Project to the public?",
  "created_utc": 1613452471,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I watched Hitchcock&#39;s <em>Notorious</em> last night, which came out in August of 1946, about a year after the bombs were dropped. SPOLIER ALERT...in case you haven&#39;t seen the movie (it&#39;s only been out for 75 years)! I was taken aback that Hitchcock <span class=\"md-spoiler-text\">used enriched uranium as his MacGuffin for a film that came out a year after the bombs.</span> How much did the general public know about atomic energy before the bombs were dropped? How much did the average U.S. citizen know about it in the years after they were dropped? And a bonus question: Hitchcock must have had some special information. Considering how long it takes to make a film, some people in Hollywood must have known the basics of what was going on in Los Alamos.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/lkqv5y/what_was_the_usa_governments_strategy_for/",
  "subreddit": "AskHistorians",
  "id": "lkqv5y",
  "is_self": true,
  "media": null,
  "is_video": false
}