{
  "author": "PM_YOUR_FAV_NUMBER",
  "the_new_excerpt": "Recently there have been a lot of arguments to the effect that \"US companies\nwill keeping doing great the next decade and so stocks will do great as well.\"\nOver the long-run (several decades), this is certainly true: stocks represent\nownership in a company, and as the earnings of the company…",
  "original_created_utc": 1618117485,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近では、「米国企業は今後10年間は好調を維持し、株価も上昇する」という趣旨の議論が盛んに行われています。\n今後10年間、米国企業は絶好調だから、株式も絶好調になる」という趣旨の議論が最近よく聞かれます。\n長期的（数十年）に見れば、確かにその通りです。\n株式は企業の所有権を表すものであり、その企業の収益が...",
      "title": "経済は市場ではない、またはS&P500が10年後までに10,000を達成できない理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近有很多论调，大意是 \"美国的企业\n将在未来十年保持做大，所以股票也会做大。\"\n从长期来看（几十年），这当然是真的：股票代表着\n在公司的所有权，而作为公司的收益...",
      "title": "经济不是市场，或者说，为什么标普500指数在十年结束前不可能轻易达到10,000点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近有很多論調，大意是 \"美國的企業\n將在未來十年保持做大，所以股票也會做大。\"\n從長期來看（幾十年），這當然是真的：股票代表着\n在公司的所有權，而作爲公司的收益...",
      "title": "經濟不是市場，或者說，爲什麼標普500指數在十年結束前不可能輕易達到10,000點？"
    }
  ],
  "title": "The Economy is not the Market, or why the S&P 500 could easily NOT hit 10,000 before the end of the decade",
  "created_utc": 1618148205,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently there have been a lot of arguments to the effect that &quot;US companies will keeping doing great the next decade and so stocks will do great as well.&quot; Over the long-run (several decades), this is certainly true: stocks represent ownership in a company, and as the earnings of the company increase so will its stock price. However, in the short-run (a decade or less) the performance of a stock is also driven by <em>investor valuation and confidence</em>, measured by the price-to-earnings ratio. It is perfectly possible for a company to increase its earnings, but for its stock to move sideways or even drop if investor enthusiasm for the stock falls.</p>\n\n<p>For example, the US economy showed <a href=\"https://currentmarketvaluation.com/models/buffett-indicator.php\">remarkable growth</a> from 2000 to 2010, increasing from a nominal quarterly GDP of $10 trillion in 2000 to $15 trillion in 2010 (even including the recession in 2008). However, over that same time period the S&amp;P 500 index <a href=\"https://www.multpl.com/s-p-500-historical-prices/table/by-year\">dropped</a> 300 points from 1,425 to 1,123. What on earth happened? The problem was investor confidence and P/E was at an all time high in 2000 at the top of the dot-com bubble, which then plummeted after the bubble burst, and then plummeted again during the global financial crisis. Even though the US economy did great that decade, the S&amp;P 500 did not.</p>\n\n<p>Of course, I cannot predict the future, but investors should be prepared if history repeats itself the next decade. The current S&amp;P 500 <a href=\"https://www.multpl.com/shiller-pe\">Cyclically Adjusted P/E ratio</a> (CAPE) is at an almost record high of 37. Assuming a historically consistent growth rate of 10% over the next decade, the S&amp;P 500 will more than double in value. However, if over that decade the CAPE falls to a more realistic historical average of 16, then <em>all those gains will be wiped out</em>. It is very possible for the US economy to do great the next decade, but for the S&amp;P 500 to move sideways.</p>\n\n<p>In light of this possibility, what is an investor to do? Oddly enough, my advice is the same as the exuberant post that prompted this reply, but for a different reason. Existing investors at the start of 2000 went nowhere over the next decade, but they performed marvelously the decade after when the S&amp;P more than tripled to its current valuation of over 4000. In fact, 2000 to 2010 was one of the greatest decades ever to invest in the stock market, since you spent 10 long years buying great US companies at a bargain price. If the stock market drops again in the future, you should ride it out and keep investing into index funds or solid companies that will weather the storm and recover once investor confidence increases again.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/stocks/comments/moksb8/the_economy_is_not_the_market_or_why_the_sp_500/",
  "subreddit": "stocks",
  "id": "moksb8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618911
}