{
  "author": "wallstgod",
  "the_new_excerpt": "WSB Controls GME Sentiment, not the Price.\n\n\n\nLong read here but there is analogy using the Magic School bus so........yeah.\n\nTL:DR: at bottom.\n\nI've seen far too many people on this sub, Stinktwits, Tweeter, CNBC, WSJ,\nBarron's etc. incorrectly state that WSB is controlling GME. We have not,…",
  "original_created_utc": 1611488490,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "WSB控制GME情绪，而不是价格。\n\n\n\n这里读的很长，但有类比使用魔法校车所以........yeah。\n\nTL:DR：在底部。\n\n我在这个子上看到了太多的人，Stinktwits，Tweeter，CNBC，WSJ。\nBarron's等错误地指出，WSB正在控制GME。我们没有...",
      "title": "大家对GME的误解"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "WSB控制GME情緒，而不是價格。\n\n\n\n這裏讀的很長，但有類比使用魔法校車所以........yeah。\n\nTL:DR：在底部。\n\n我在這個子上看到了太多的人，Stinktwits，Tweeter，CNBC，WSJ。\nBarron's等錯誤地指出，WSB正在控制GME。我們沒有...",
      "title": "大家對GME的誤解"
    }
  ],
  "title": "What Everyone is Getting Wrong About GME",
  "created_utc": 1611516634,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>WSB Controls GME Sentiment, not the Price.</p>\n\n<p>&#x200B;</p>\n\n<p>Long read here but there is analogy using the Magic School bus so........yeah.</p>\n\n<p>TL:DR: at bottom.</p>\n\n<p>I&#39;ve seen far too many people on this sub, Stinktwits, Tweeter, CNBC, WSJ, Barron&#39;s etc. incorrectly state that WSB is controlling GME.  We have not, nor will we ever be in control of GME.  Simply put, our ~5% ownership isn&#39;t enough to push the price around.  As much as you retards, and the retard(s) on CNBC, and the retards on print media WANT everyone to believe it, its just not true so I wanted to clarify a few things going forward.</p>\n\n<p>First, the media, Shitron, and others are trying to paint WSB as a collective or a whole entity, and NOT as a group of individuals.  This claim is baseless, and has been mentioned here before but of course that won&#39;t stop them.  If in fact we were a collective, that would set a dangerous precedent and we would almost certainly be shut down.  Think of like Pirate Bay. If one person illegally uploads a movie that person is in violation of the law, but if 10000 people upload a couple seconds of said movie, and those pieces are stitched together it becomes a lot harder to make it illegal.</p>\n\n<p>The story of GME began much like M. Burry&#39;s big short began - someone looked!  That person was <a href=\"/r/DeepFuckingValue\">r/DeepFuckingValue</a> (and M. Burry, himself).  Let&#39;s use the Magic School Bus as an example. DFV is played by Ms. Frizzle. Here she comes around the bend in her little short bus on route to pick you mini autists up, but when she opens the door to the bus no one gets on!  Ms. Frizzle is not discouraged, so she wrangles you retards up and throws you on the bus.  Off you go on the adventure of your life, launching into the stratosphere to discover a new planet further than the Moon and Mars. You name this newly found planet Valhalla.  When you return you can&#39;t stop telling people about your trip!</p>\n\n<p>This is where we get to my point.  We are in control of the SENTIMENT surrounding GME, not the price.   You little autists have seen valhalla already, and can&#39;t stop telling others about how magical it is. Soon enough, other autists want to ride the short bus out to Valhalla, and so they buy their tickets (stonks) and then they tell their friends etc etc.  Take Tesla for example (with a P/E of 1700), does that stop the <del>retards</del> geniuses from buying?</p>\n\n<p>This is what we are doing to GME.  We didn&#39;t push our weight around as WSB and somehow, singlehandedly destroy the shorts.  No, retail just doesn&#39;t have that kind of power (hence why its B.S the media is pushing the narrative...LOL though they sure know how to make an autist blush).  WSB somehow, SOMEHOW edgeukated enough people on the GME story about how undervalued they were, financially healthy they were, how shorted the stock was, Lord Cohen et al, etc, and the story took off.</p>\n\n<p>You see? We are controlling the SENTIMENT around GME which in turn, is controlling the price.  Lets continue this going forward because its what got us to where we are.  If we really want this squeeze to happen there is going to have to be conviction on behalf of the buyers.  So go out there and edgeukate more people on the stock that everyone missed (apart from you DFV (xoxo) and Burry).</p>\n\n<p>Make sure they know this ain&#39;t no pump and dump. Everyone gets caught up in the stonk price when they should be looking at market cap.  Sure, we hit the highest price last week, but not the highest  market cap GME has ever had. In reality, we&#39;ve just recently corrected to the proper valuation GME should have been at all along (if it weren&#39;t for those greedy shorts!).</p>\n\n<p>So next time you post about GME, make sure you remind people about the above points and the fact that  the squeeze hasn&#39;t squoze yet, and that RC and Reggie Fils Aime are now driving this short bus!</p>\n\n<p>You keep the SENTIMENT high, the stonk price goes more uppies.</p>\n\n<p>(someone add a rocket emoji...or perhaps a school bus?)</p>\n\n<p>TL/DR:  WSB is controlling the SENTIMENT around GME, not the price.  </p>\n\n<p>*EDIT: Position:  557 glorious shares @ $20.21</p>\n</div><!-- SC_ON -->",
  "score": 1759,
  "permalink": "/r/wallstreetbets/comments/l3xy7m/what_everyone_is_getting_wrong_about_gme/",
  "subreddit": "wallstreetbets",
  "id": "l3xy7m",
  "is_self": true,
  "media": null,
  "is_video": false
}