{
  "author": "Ding123456",
  "the_new_excerpt": "I had to do this cathartic post because it is hilarious how wrong/clueless the\nmainstream financial analysts continue to be when discussing how investors could\nbenefit as investors from the historic surge in lumber prices.\n\nContext for anyone living under a rock the last 6 months\n\nLumber has been…",
  "original_created_utc": 1617891062,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がこのような投稿をしなければならなかったのは、投資家がどのようにすればいいのかを議論する際に、主流の金融アナリストがどれほど間違っていたり、無意味であったりするかがおかしいからです。\n歴史的な木材価格の高騰から投資家がどのように利益を得ることができるのかを議論する際に、主流の金融アナリストがいかに間違っているか、役に立たないかということが笑えるからです。\n歴史的な木材価格の高騰から投資家がどのような利益を得ることができるのかを議論する際に、主流の金融アナリストがいかに間違っているか、無意味であるかが笑えるからです。\n\nこの6ヶ月間、岩の下で暮らしていた人のためのコンテクスト\n\n木材の価格は...",
      "title": "Lumber DD: CNBCとMotley Foolが選ぶ「ベスト木材株」は意外にも価格パフォーマンスが最悪だったり、木材とは無関係だったりする。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不得不发这个宣泄帖，因为它是多么的搞笑，错误/无厘头。\n主流金融分析师们在讨论投资者如何能。\n作为投资者从木材价格的历史性上涨中获益。\n\n对于过去6个月生活在岩石下的人来说，这是一个背景。\n\n木材已经...",
      "title": "Lumber DD：CNBC和Motley Fool的 \"最佳木材股 \"不出所料是价格表现最差的，或与木材无关。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不得不發這個宣泄帖，因爲它是多麼的搞笑，錯誤/無厘頭。\n主流金融分析師們在討論投資者如何能。\n作爲投資者從木材價格的歷史性上漲中獲益。\n\n對於過去6個月生活在岩石下的人來說，這是一個背景。\n\n木材已經...",
      "title": "Lumber DD：CNBC和Motley Fool的 \"最佳木材股 \"不出所料是價格表現最差的，或與木材無關。"
    }
  ],
  "title": "Lumber DD: CNBC and Motley Fool's \"Best Lumber Stocks\" Unsurprisingly Are the Worst Price Performers or Are Unrelated to Lumber",
  "created_utc": 1617899788,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had to do this cathartic post because it is hilarious how wrong/clueless the mainstream financial analysts continue to be when discussing how investors could benefit as investors from the historic surge in lumber prices.</p>\n\n<p><strong>Context for anyone living under a rock the last 6 months</strong></p>\n\n<p>Lumber has been surging to all-time high prices recently, with every indication that it will continue to climb for the next few months due to how massive the new home construction demand and the busy season just getting started.  The price of dimensional lumber will likely dip at some point but will still stay at 2-3x its normal price into 2022 because of how insane the new housing construction boom.  </p>\n\n<p>For those that have suggested otherwise in recent reddit posts, you’re wrong and this post isn’t about that debate.  Go look at the 2021 and 2022 projections for all of the big home builders (KB, TOL, LEN, DHI, etc…).  Every single one is projected to have record earnings the next two years from increased home construction even with the surge in lumber prices.</p>\n\n<p><strong>The Financial Click-Bait “Best Lumber Stocks”</strong></p>\n\n<p>If you’re new to lumber and google lumber stocks to maybe see what options are out there to look into, you no doubt have run into the same laughably annoying phenomenon that I did: the mainstream financial media/internet clickbait sites (like CNBC and Motley Fool) keep on producing the same regurgitated articles titled the “Best ___ Lumber Stocks” or “Best Ways to Play the Lumber Surge” which then offer the same regurgitated hot stock tips: </p>\n\n<p>1) they recommend stocks that produce exclusively <strong>timber</strong> (like RYN) which get NO BENEFITS from the surge in <strong>lumber</strong> prices <em>because timber (the logs which lumber is made from) aren’t the commodity whose price is surging 3-fold</em>; </p>\n\n<p>2) they recommend stocks that get a large portion of their revenue/enterprise value from things other than lumber (or have such a large stock float) so that the benefits of the lumber surge will be pretty diffuse and not have a proportional impact on their stock price (e.g. WY, a clickbait favorite); or </p>\n\n<p>3) they pitch stocks like LL, Home Depot and Lowes who have done well riding the home improvement wave, but don’t actually produce their dimensional lumber at all and thus have absolutely nothing to gain from the surge in dimensional lumber prices.</p>\n\n<p>For those who want to invest in this lumber super cycle, it probably would be a good idea to invest in companies <em>whose earnings are actually tied to the price of lumber.</em>  Companies like WFG, CFPZF, IFSPF and RFP (This list is not exhaustive; these are just examples).  Companies like these that largely base almost all of their income on dimensional lumber, along with wood pulp and paper for some.  (Note: wood pulp surging to a new high as well, so these guys coincidentally are enjoying a double whammy this year).  And unlike WY, these lumber players don’t have nearly the volume of outstanding shares, so the surge in lumber prices is going to translate in a proportionally larger EPS growth.</p>\n\n<p>If you look at the stock price histories of these lumber companies and compare it to the historical price of lumber, their prices largely track with the changes in lumber (and to some degree wood pulp pricing).  2013 and 2018 had surges in the price of lumber and these companies’ stock prices correlated with those surges.  Why? Because the price of lumber and wood pulp dictate these companies’ earnings.  If you look at the timber companies, like WY and RYN, their stock prices don’t track well to lumber prices because the price of timber is separate.  In fact, despite the epic lumber surge, some timber producers are still not doing well because there is a big glut of it in some areas of the continent.</p>\n\n<p><strong>Let’s Look at the Numbers</strong></p>\n\n<p>In the end, it’s the numbers that matter, so let’s look at the price performance of these stocks YTD, the last 6 months and the last year.  CNBC and Motley pitched RYN, WY, LL, HD, and LOW as the best stocks to play the lumber surge.  Let’s see how they have done the last year during this surge compared to the actual lumber companies:</p>\n\n<p><strong>Shill Stocks:</strong> <a href=\"https://imgur.com/a/ihngsVA\">YTD</a>, <a href=\"https://imgur.com/a/2LlbPN7\">6 Months</a>, and <a href=\"https://imgur.com/a/GMgb6Ta\">1 Year</a></p>\n\n<p>Other than LL, all of them have been doing ok.  Some decent growth, all decently beating the SP.  But nothing spectacular and certainly nothing showing explosive stock price growth correlating with lumber’s explosive growth. (I’ll address outlier LL later.)</p>\n\n<p>Now look at the <strong>Lumber Stocks:</strong> <a href=\"https://imgur.com/a/CnYBrAb\">YTD</a>, <a href=\"https://imgur.com/a/qjTCQRQ\">6 Months</a>, and <a href=\"https://imgur.com/a/PAXODpp\">1 year</a> </p>\n\n<p>I included WY to prove a point on how badly CNBC and Motley’s favorite “Best” pick has done compared to the actual lumber stocks.  If you look at their growth, as a group its substantially larger than WY or RYN, or these home improvement store stocks. </p>\n\n<p><strong>Take away from the charts:</strong> </p>\n\n<p>The lumber stocks as a group have so far <em>destroyed</em> the shill stocks and actually show the type of growth you’d expect from a historic commodity surge.  Unsurprisingly, these lumber stocks particularly destroyed WY which is the most shilled stock by the financial clickbait media, and is probably why WY then seems to be regurgitated in a lot of the recent reddit posts on Canadian lumber stocks.  </p>\n\n<p>For those correctly pointing out that LL is up 500% in the last year, if you caught that party in Q4, good job.  RFP is still beating than LL by over 200%, but still, great job.  That being said, LL’s surge isn’t because of lumber prices and any future growth again won’t be from the surge in price in dimensional lumber.  And you know that because the price of lumber has surged higher in the last three months, but LL is down ~20% in that same time frame.  Frankly, if you bought LL when CNBC told you to in January 2021, you’d be down 20-25%.  The point being that what propelled LL was not the surge in lumber and it’s future is not likely tied to any sustained lumber surge.</p>\n\n<p><strong>Forward Looking Comments</strong></p>\n\n<p>For those cynics who keep saying “Lumber cycle is over.  It’s priced in,” you don’t know what you’re talking about and here’s why.  These Canadian lumber stocks are all sitting roughly around their mid 2018 highs when Lumber surged to $600 MBF for 3 weeks in May 2018, and averaged about $550 MBF during the forestry’s Q2, and then crashed Q3/Q4 2018.  </p>\n\n<p>For comparison, in 2021, lumber has been trading at over $1000 MBF since February, and the May futures just topped $1050 this week. <a href=\"https://imgur.com/a/TRWdKvE\">Here’s the CME futures yesterday.</a>  January 2022 futures are now closing in on $800 MBF.  It seems pretty clear all of these futures are rising and will continue to due so in the near term.  2021 earnings will likely blow 2018’s out of the water.  Yet despite the fact that these futures show these companies are about the have some of the best back-to-back quarters in industry history, they are still sitting at their 2018 highs... doesn’t sound priced in to me.</p>\n\n<p>Case in point, here’s the basic <a href=\"https://imgur.com/a/fiefWln\">valuation ratios for the Lumber Stocks</a>, and here’s the <a href=\"https://imgur.com/a/8jd6SsU\">valuation ratios for the Shill Stocks</a>.  Despite the epic run these lumber stocks have had this last year, they are largely <em>still</em> relatively undervalued and have drastically better forward PE’s when compared to the shill stocks or other related industrial sector averages.  </p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>I needed to write this cathartic post because I am sick of seeking these financial “professionals” shill the same mediocre/loser stocks as “the best lumber stocks” which have nothing to do with the production of lumber or are literally the worst price performers in the sector.  </p>\n\n<p>I am not telling you what to buy and can’t predict who will do the best this year.  Each of the lumber stocks have their advantage and disadvantages depending on investor preferences. And who knows, maybe these shill stocks are on the cusp of some epic 1000% gains.  But if you want to find a way to benefit from the lumber surge, then it may be wise to invest in <em>lumber producers</em> who actually stand to directly gain from the surge in lumber and still have unrealized value to offer if market conditions stay on their current trajectory.  </p>\n\n<p>If you are unsure if a stock you are looking at is timber or lumber, look at financial statements / website.  You will be able to see in a matter of seconds if their earnings come from timber and real estate or wood products/lumber that are actually surging in value.</p>\n\n<p>Note: I am not a financial adviser.  If there is one take away from this post, <strong>DO YOUR OWN RESEARCH.</strong>  Don’t trust strangers on the internet or TV.  Many of them are either lazy morons who keep regurgitating the same brainless clickbait they read somewhere or they have an ulterior motive and are selling you garbage. I&#39;m long RFP but recognize that all of these lumber stocks will probably do well.</p>\n</div><!-- SC_ON -->",
  "score": 3650,
  "permalink": "/r/stocks/comments/mmsnc1/lumber_dd_cnbc_and_motley_fools_best_lumber/",
  "subreddit": "stocks",
  "id": "mmsnc1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617814
}