{
  "author": "Charming-Metal-7103",
  "original_created_utc": 1656312230,
  "title": "Is there something wrong with me?",
  "created_utc": 1656321867,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;(F-19) I have never been able to feel any kind of pleasure from intercourse. The first time I had intercourse was about 5 years ago and it really hurt, I thought maybe its because I have never done this before but now I am in a relationship 5 years later and I still cannot feel anything but pure pain or just nothing. I have asked many doctors about this and none of them have an answer or even an idea on what could be wrong. &lt;/p&gt;\n\n&lt;p&gt;I remember at some point I could experience regular feeling but between that time and now I have been taken advantage of a handful of times and I think maybe that could be where this all came from. Maybe I have trauma that I have not been able to properly get through?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/vlp4zr/is_there_something_wrong_with_me/",
  "subreddit": "TooAfraidToAsk",
  "id": "vlp4zr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "(F-19) I have never been able to feel any kind of pleasure from intercourse. The\nfirst time I had intercourse was about 5 years ago and it really hurt, I thought\nmaybe its because I have never done this before but now I am in a relationship 5\nyears later and I still cannot feel anything but pure…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(F-19)性交で快感を感じたことは一度もない。初めて\n初めて性交をしたのは5年ほど前ですが、とても痛かったです。\nと思いましたが、5年後の今、交際中です。\nこのような場合、私は、このようなことをしたことがないからかもしれないと思いました。",
      "title": "何か問題があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(F-19)我从未从性交中感受到任何形式的快乐。我第一次性交是在5年前。\n我第一次性交是在5年前，当时真的很疼，我想也许是因为我以前没有做过，但现在我已经在恋爱了。\n也许是因为我以前从来没有做过，但现在我已经有了一段关系，5年后，我仍然无法感受到任何东西，只有纯粹的快乐。\n但现在我已经有了一段关系，5年后，我仍然无法感受到任何东西，只有纯粹的...",
      "title": "我有什么问题吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(F-19)我從未從性交中感受到任何形式的快樂。我第一次性交是在5年前。\n我第一次性交是在5年前，當時真的很疼，我想也許是因爲我以前沒有做過，但現在我已經在戀愛了。\n也許是因爲我以前從來沒有做過，但現在我已經有了一段關係，5年後，我仍然無法感受到任何東西，只有純粹的快樂。\n但現在我已經有了一段關係，5年後，我仍然無法感受到任何東西，只有純粹的...",
      "title": "我有什麼問題嗎？"
    }
  ]
}