{
  "author": "TangoBolshevik",
  "the_new_excerpt": "I bought my first lot of BTC at about $16k and ETH at $1200, about three years\nago. My first few months (years?) in crypto SUCKED. Luckily, I stuck with things\nand am doing pretty well. Here are some things I wish I knew back then in case\nthere are some new people here looking to get into it:\n\n 1.…",
  "original_created_utc": 1609801554,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我用大约16000美元买了我的第一批BTC，用1200美元买了ETH，大约三年\n那是以前的事了。我头几个月(几年？)密码太烂了。幸运的是，我坚持了下来\n我做得很好。以下是我当时希望知道的一些事情，以防万一\n这里有一些新人想要涉足其中：\n\n1.…",
      "title": "关于2017/2018年的密码交易，我希望有人告诉我4件事"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我用大約16000美元買了我的第一批BTC，用1200美元買了ETH，大約三年\n那是以前的事了。我頭幾個月(幾年？)密碼太爛了。幸運的是，我堅持了下來\n我做得很好。以下是我當時希望知道的一些事情，以防萬一\n這裏有一些新人想要涉足其中：\n\n1.…",
      "title": "關於2017/2018年的密碼交易，我希望有人告訴我4件事"
    }
  ],
  "title": "4 things I wish someone told me about trading crypto in 2017/2018",
  "created_utc": 1609870338,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I bought my first lot of BTC at about $16k and ETH at $1200, about three years ago. My first few months (years?) in crypto SUCKED. Luckily, I stuck with things and am doing pretty well. Here are some things I wish I knew back then in case there are some new people here looking to get into it:</p>\n\n<ol>\n<li>Be clear about why you are buying crypto. Decide if you want to HODL or trade (you can do both) and stick to that strat. If you are buying because you believe in the tech, then you should not be selling...at all. The price will go up again, eventually. This requires discipline. I held through the COVID-19 dump in early 2020...just. The reality is crypto is a long game...think of it like you would if buying a house.</li>\n<li>If you decide to &quot;trade&quot; be aware that this is a market and the main players in the market (experienced traders with LOTS of money) are there to take your money. You are at a poker table with pro players. The odds are against you.</li>\n<li>When buying or selling any crypto, do the opposite of what your gut tells you. TA aside (and there is a lot to be said for understanding fundamentals of technical analysis), big green candles should be a sell signal (not a buy signal). Big red candles are probably a buy signal (not a sell signal). If the price is mooning and you think you should buy, don’t. You missed the opportunity. You just need to be patient. If you do FOMO in and the price drops soon after you buy, then you should definitely not sell. The price usually recovers anyway - it can be days, months or even years (ETH is yet to get back to its ATH).</li>\n<li>If you want to &#39;day trade&#39; with margin/leverage, set aside an amount you are prepared to lose and just trade off that in a seperate account. Never leverage off your entire holdings. It will cloud your decision making. It&#39;s possible to get pretty good returns on a 10x leverage with $500. I turned $500 into $5000 pretty easily (after losing about $1500 in the learning process). But BY FAR my biggest returns are from just HOLDING.</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/kqkgsb/4_things_i_wish_someone_told_me_about_trading/",
  "subreddit": "CryptoCurrency",
  "id": "kqkgsb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100746075
}