{
  "author": "RusticBohemian",
  "original_created_utc": 1659970093,
  "title": "Thirty-four years after scribbling E = mc2, Albert Einstein wrote to President Franklin Roosevelt to warn him the Nazis were turning his famous theory into a nuclear weapon. How did Einstein know this, and did Roosevelt actually read his letter?",
  "created_utc": 1659985008,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;How did word reach Einstein that his ideas were being weaponized by the Nazis? The scientific grapevine?&lt;/p&gt;\n\n&lt;p&gt;Also, did the president really read all his mail? Was there someone screening incoming letters for him? Was there a chance Einstein&amp;#39;s letter might have been ignored or overlooked?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 147,
  "permalink": "/r/AskHistorians/comments/wjapxs/thirtyfour_years_after_scribbling_e_mc2_albert/",
  "subreddit": "AskHistorians",
  "id": "wjapxs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "How did word reach Einstein that his ideas were being weaponized by the Nazis?\nThe scientific grapevine?\n\nAlso, did the president really read all his mail? Was there someone screening\nincoming letters for him? Was there a chance Einstein's letter might have been\nignored or overlooked?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アインシュタインのアイデアがナチスによって武器化されることは、どのようにして知らされたのだろうか。\n科学界の噂話？\n\nまた、大統領は本当にすべての郵便物を読んでいたのでしょうか？誰かが選別していたのでしょうか？\nしていたのでしょうか？アインシュタインの手紙が無視されたり、見落とされたりする可能性はなかったのでしょうか？\n無視されたり、見落とされたりすることはなかったのだろうか？",
      "title": "E = mc2」を書き上げてから34年後、アルバート・アインシュタインはフランクリン・ルーズベルト大統領に手紙を出し、ナチスが彼の有名な理論を核兵器に転用しようとしていることを警告した。アインシュタインはこのことをどのようにして知ったのか、そしてルーズベルトは実際に手紙を読んだのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "爱因斯坦是如何得知他的思想被纳粹武器化的？\n科学界的小道消息吗？\n\n另外，总统真的读过他所有的邮件吗？是否有人在筛选\n来信？爱因斯坦的信是否有可能被\n忽视或忽略了？",
      "title": "在写下E=mc2的34年后，阿尔伯特-爱因斯坦写信给富兰克林-罗斯福总统，警告他纳粹正在把他的著名理论变成核武器。爱因斯坦是如何知道这一点的，罗斯福是否真的读过他的信？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "愛因斯坦是如何得知他的思想被納粹武器化的？\n科學界的小道消息嗎？\n\n另外，總統真的讀過他所有的郵件嗎？是否有人在篩選\n來信？愛因斯坦的信是否有可能被\n忽視或忽略了？",
      "title": "在寫下E=mc2的34年後，阿爾伯特-愛因斯坦寫信給富蘭克林-羅斯福總統，警告他納粹正在把他的著名理論變成核武器。愛因斯坦是如何知道這一點的，羅斯福是否真的讀過他的信？"
    }
  ]
}