{
  "author": "__-_____-_-__---_",
  "original_created_utc": 1638110066,
  "title": "If you were temporarily given the power to end all life, would choosing NOT to do so mean you would be ethically responsible for all the suffering that came afterwards?",
  "created_utc": 1638161387,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On one hand, the responsibility seems like too heavy a burden. If you did press the button so to speak, you would be responsible for ending the lives of trillions of beings on Earth and possibly many more elsewhere. But if you do not press it, doesn&#39;t that also mean that you are responsible for any form of suffering for any being that comes afterwards, since there is a direct causal relationship between your decision and the occurrence of those sufferings?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/r45lrd/if_you_were_temporarily_given_the_power_to_end/",
  "subreddit": "askphilosophy",
  "id": "r45lrd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On one hand, the responsibility seems like too heavy a burden. If you did press\nthe button so to speak, you would be responsible for ending the lives of\ntrillions of beings on Earth and possibly many more elsewhere. But if you do not\npress it, doesn't that also mean that you are responsible for any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一方で、その責任はあまりにも重く感じられます。もし、あなたが\nいわばボタンを押したとしたら、地球上の何兆もの生物、そしておそらく世界中の多くの生物の命を終わらせる責任を負うことになるのです。\n地球上の何兆人もの人間の命を奪うことになり、さらに多くの人間の命を奪うことになるかもしれません。しかし、もし押さなかったら\n押すことができなければ、それはまた、何かの責任を負うことを意味するのではないでしょうか...。",
      "title": "もしあなたが一時的にすべての生命を終わらせる権限を与えられたとしたら、そうしないことを選択すると、その後のすべての苦しみに対して倫理的な責任を負うことになりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一方面，这个责任似乎是一个太沉重的负担。如果你真的按下\n按键，你将负责结束地球上数万亿人的生命，并有可能使他们失去生命。\n地球上数万亿的生命，以及可能在其他地方的更多生命。但是如果你不\n按键，这不也意味着你要对任何......负责吗？",
      "title": "如果你暂时被赋予结束所有生命的权力，选择不这样做是否意味着你要对之后的所有痛苦承担道德责任？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一方面，這個責任似乎是一個太沉重的負擔。如果你真的按下\n按鍵，你將負責結束地球上數萬億人的生命，並有可能使他們失去生命。\n地球上數萬億的生命，以及可能在其他地方的更多生命。但是如果你不\n按鍵，這不也意味着你要對任何......負責嗎？",
      "title": "如果你暫時被賦予結束所有生命的權力，選擇不這樣做是否意味着你要對之後的所有痛苦承擔道德責任？"
    }
  ]
}