{
  "author": "Duk01001111bito",
  "the_new_excerpt": "I live in a third world country and even 2 dollars a day can definitely change\nmy life in a long run. but i can't do most of the surveys since they usually\nrequire KYC. are those games that give you crypto for playing actually work? i\neven couldn't withdraw my BAT earned with Brave since it also…",
  "original_created_utc": 1618764582,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は第三世界の国に住んでいるので、1日2ドルでも長い人生を変えることができます。\nしかし、ほとんどのアンケートはKYCが必要なのでできません。\nプレイすると暗号がもらえるゲームは実際に機能するのでしょうか？\nブレイブで稼いだBATを引き出すこともできませんでした...。",
      "title": "毎日いくらかのcrypto(例えば2$)を稼ぐには、どのような方法がありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我生活在第三世界国家，一天两块钱也能改变一切。\n但我不能做大多数的调查，因为他们通常是\n需要KYC. 那些给你玩加密游戏的游戏真的有用吗?\n甚至不能撤回我的BAT赚取 与勇敢，因为它也... ...",
      "title": "有什么方法可以每天赚取一些加密货币（例如2美元）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我生活在第三世界國家，一天兩塊錢也能改變一切。\n但我不能做大多數的調查，因爲他們通常是\n需要KYC. 那些給你玩加密遊戲的遊戲真的有用嗎?\n甚至不能撤回我的BAT賺取 與勇敢，因爲它也... ...",
      "title": "有什麼方法可以每天賺取一些加密貨幣（例如2美元）？"
    }
  ],
  "title": "What are some ways to earn some crypto (2$ for example) daily?",
  "created_utc": 1618774729,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in a third world country and even 2 dollars a day can definitely change my life in a long run. but i can&#39;t do most of the surveys since they usually require KYC. are those games that give you crypto for playing actually work? i even couldn&#39;t withdraw my BAT earned with Brave since it also needs KYC.</p>\n\n<p>Edit: Thank you everyone for the suggestions! you all have my upvotes.</p>\n\n<p>Edit2: Man I&#39;ve been upvoting and answering you guys for the past hour or something i think! thank you all so much you helped me a lot! i wanted to continue but it&#39;s 23:15 here i have to sleep and wake up early.</p>\n\n<p>I&#39;ll continue upvoting everyone tomorrow! agian, thank you all!</p>\n</div><!-- SC_ON -->",
  "score": 19604,
  "permalink": "/r/CryptoCurrency/comments/mtghzc/what_are_some_ways_to_earn_some_crypto_2_for/",
  "subreddit": "CryptoCurrency",
  "id": "mtghzc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521463
}