{
  "author": "danielrp00",
  "original_created_utc": 1632310474,
  "title": "China markets have been open for almost 12 hours now and nothing happened.",
  "created_utc": 1632325398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday there was a lot of people claiming there would be massive price drops today just as soon as the China markets were open, everybody was in panic and everybody was expecting a black Wendnesday today. Well, as you can see nothing happened (just a little dip). That proves nobody in this sub knows what the fuck they are talking about. Shit I dont even know if after posting this the markets will crash or go to the Moon. Nobody here knows what will happen. Evergrande could go bankrupt and that could cause crypto to go to Mars. Evergrande could announce it&#39;s been able to pay all it&#39;s debt and crypto could crash to oblivion. Nobody knows what will happen, there&#39;s no way of predicting what will happen. Past performance of the markets shouldnt be used for making predictions and technical analysis is basically astrology with charts (specially on crypto). All the posts predicting crashes are FUD written by people that dont even know they are spreading FUD. Just remember that analysts have successfully predicted 11 out of the 2 economic crisis of the last 20 years.</p>\n</div><!-- SC_ON -->",
  "score": 269,
  "permalink": "/r/CryptoCurrency/comments/pt5mm9/china_markets_have_been_open_for_almost_12_hours/",
  "subreddit": "CryptoCurrency",
  "id": "pt5mm9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday there was a lot of people claiming there would be massive price drops\ntoday just as soon as the China markets were open, everybody was in panic and\neverybody was expecting a black Wendnesday today. Well, as you can see nothing\nhappened (just a little dip). That proves nobody in this sub…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日は大規模な値下げが行われると多くの人が言っていたが\n今日、中国市場が開くやいなや、誰もがパニックに陥り、誰もが今日の黒いウェンズデーを予想していた。\n誰もが今日は黒い週末になると予想していました。見ての通り、何も起こりませんでした。\n何も起きませんでした（少し下がっただけ）。これは、このサブグループの誰もが...",
      "title": "中国市場は12時間近く開いていますが、何も起きませんでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天有很多人声称会有大规模的价格下跌\n今天中国市场刚一开盘，大家就陷入恐慌之中。\n每个人都期待着今天的黑色星期三。嗯，正如你所看到的，什么都没有发生\n发生了（只是一个小跌停）。这证明没有人在这个次...",
      "title": "中国市场已经开放了近12个小时，但没有发生任何事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天有很多人聲稱會有大規模的價格下跌\n今天中國市場剛一開盤，大家就陷入恐慌之中。\n每個人都期待着今天的黑色星期三。嗯，正如你所看到的，什麼都沒有發生\n發生了（只是一個小跌停）。這證明沒有人在這個次...",
      "title": "中國市場已經開放了近12個小時，但沒有發生任何事情。"
    }
  ]
}