{
  "author": "RusticBohemian",
  "original_created_utc": 1647526620,
  "title": "Did leaving the farm and going to work in a factory really seem \"like heaven\" to 19th century farmers?",
  "created_utc": 1647558354,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve been taught that industrialization was brutal, with people forced from their rural existence by changing economics and industrialization and made to work in dangerous and dehumanizing factories.&lt;/p&gt;\n\n&lt;p&gt;But there&amp;#39;s another argument that people preferred factories to farm labor, that they were a step up.&lt;/p&gt;\n\n&lt;p&gt;How true is &lt;a href=\"https://www.humanprogress.org/how-work-got-good/\"&gt;this statement&lt;/a&gt;? Should we read a broader truth here that industrialization, while harsh, was better than farm life?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Around 1858 in England, one 8-year-old girl did farm work 14 hours a day; she later testified that “it was like heaven to me when I was taken to the town of Leeds and put to work in a cotton factory.” By today’s standards, the conditions of the early factories were awful, but they were still better than the even more awful conditions that had prevailed in the countryside. The factory was progress, a stepping stone but not a stopping point. In the 1800s a great many people of all ages and genders voted with their feet for the factory over the farm.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/tgb9cr/did_leaving_the_farm_and_going_to_work_in_a/",
  "subreddit": "AskHistorians",
  "id": "tgb9cr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We've been taught that industrialization was brutal, with people forced from\ntheir rural existence by changing economics and industrialization and made to\nwork in dangerous and dehumanizing factories.\n\nBut there's another argument that people preferred factories to farm labor, that\nthey were a step…"
}