{
  "author": "the_nuttings",
  "original_created_utc": 1653240684,
  "title": "Aren’t people who are having gender identity issues a very small amount of people on the grand scheme?",
  "created_utc": 1653254386,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live in a city of 50,000 and if I went and wandered downtown, out of the hundreds and hundreds of people I&amp;#39;d come across, I will see maybe a handful, if that. Probably not even that much.&lt;/p&gt;\n\n&lt;p&gt;I am not bashing, it just doesn&amp;#39;t make sense to me the amount of resources and time spent on the topic. If the city manager declared they are spending $3,000,000 to redo toilets in the city to accommodate people 6&amp;#39;7&amp;quot; or taller more comfortably, most people would think that seems like major overkill because people 6’7” or taller are such a small percentage.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/uvfqxq/arent_people_who_are_having_gender_identity/",
  "subreddit": "NoStupidQuestions",
  "id": "uvfqxq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I live in a city of 50,000 and if I went and wandered downtown, out of the\nhundreds and hundreds of people I'd come across, I will see maybe a handful, if\nthat. Probably not even that much.\n\nI am not bashing, it just doesn't make sense to me the amount of resources and\ntime spent on the topic. If…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は5万人の都市に住んでいますが、もし私がダウンタウンに行き、ぶらぶら歩いていたら、その中から\n何百人、何千人といる中で、ほんの一握りにしか会わないでしょう。\nそんなものです。おそらく、それすらもないでしょう。\n\n私はバッシングしているわけではなく、この話題に費やされるリソースと時間の量が私には理解できないのです。\nこのトピックに費やされた時間とリソースの量を理解できないのです。もし...",
      "title": "性同一性障害を抱えている人は、大枠ではごく少数なのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在一个有50,000人的城市，如果我去市中心闲逛，在我遇到的成百上千的人中\n如果我去市中心闲逛，在我遇到的成百上千的人中，我可能会看到一小部分，如果\n那也是。甚至可能没有那么多。\n\n我不是在抨击，只是对我来说，花在这个问题上的资源和时间的数量没有意义。\n花在这个话题上的资源和时间是没有意义的。如果...",
      "title": "有性别认同问题的人在大计划中不是非常少的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在一個有50,000人的城市，如果我去市中心閒逛，在我遇到的成百上千的人中\n如果我去市中心閒逛，在我遇到的成百上千的人中，我可能會看到一小部分，如果\n那也是。甚至可能沒有那麼多。\n\n我不是在抨擊，只是對我來說，花在這個問題上的資源和時間的數量沒有意義。\n花在這個話題上的資源和時間是沒有意義的。如果...",
      "title": "有性別認同問題的人在大計劃中不是非常少的人嗎？"
    }
  ]
}