{
  "author": "penny_lavoie",
  "original_created_utc": 1638739387,
  "title": "How or even should I (white female) call out my (WOC) friend's racist comments?",
  "created_utc": 1638761504,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a brown female friend who has a thing against  Asian women. She often says nasty things about them. Sometimes when we are out in a group it&amp;#39;s me, her and a few other white chicks and she&amp;#39;ll start going on about Asian women. Everyone gets uncomfortable but I feel like noone wants to be the white lady lecturing the brown lady about racism. What is appropriate in this situation?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/r9psb7/how_or_even_should_i_white_female_call_out_my_woc/",
  "subreddit": "TooAfraidToAsk",
  "id": "r9psb7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a brown female friend who has a thing against Asian women. She often says\nnasty things about them. Sometimes when we are out in a group it's me, her and a\nfew other white chicks and she'll start going on about Asian women. Everyone\ngets uncomfortable but I feel like noone wants to be the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "褐色の女友達がいるんだけど、アジア系の女性に恨みを持っているんだ。彼女はよくこう言います。\n嫌なことを言われる。時々、私たちがグループで外出するとき、私と彼女、そしてもう一人\n他の白人女性数人がアジア人女性について語り始めるんです。みんな\n不愉快になるけど、誰も自分が...という感じ。",
      "title": "私（白人女性）は、私（WOC）の友人の人種差別的なコメントをどのように、あるいはどのように呼びかけるべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个棕色的女性朋友，她对亚洲女性有意见。她经常说\n说她们的坏话。有时，当我们在一个团体中，只有我、她和其他几个白人女孩时，她会开始谈论亚洲妇女。\n她就会开始谈论亚洲女性。每个人\n每个人都会感到不舒服，但我觉得没有人愿意成为...。",
      "title": "我（白人女性）如何或甚至应该叫出我（白人女性）朋友的种族主义言论？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個棕色的女性朋友，她對亞洲女性有意見。她經常說\n說她們的壞話。有時，當我們在一個團體中，只有我、她和其他幾個白人女孩時，她會開始談論亞洲婦女。\n她就會開始談論亞洲女性。每個人\n每個人都會感到不舒服，但我覺得沒有人願意成爲...。",
      "title": "我（白人女性）如何或甚至應該叫出我（白人女性）朋友的種族主義言論？"
    }
  ]
}