{
  "author": "zfreakazoidz",
  "original_created_utc": 1628929969,
  "title": "Anyone not really fear their own death, but fear their parent's death?",
  "created_utc": 1628980828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Growing up sick I never really feared my own death. But with my dads dying, I&#39;m depressed. He&#39;s a great man and we had a perfect relationship. So I have no &quot;What ifs&quot; of course. But none the less I don&#39;t want to lose him. Feel like I just want to scream into a pillow, cry and not have to deal with all this.  </p>\n\n<p>-edit-<br/>\nTo the mods, I saw the rule about how to title posts. Sorry, I&#39;d change the title if I could. </p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/p44bq9/anyone_not_really_fear_their_own_death_but_fear/",
  "subreddit": "TooAfraidToAsk",
  "id": "p44bq9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Growing up sick I never really feared my own death. But with my dads dying, I'm\ndepressed. He's a great man and we had a perfect relationship. So I have no\n\"What ifs\" of course. But none the less I don't want to lose him. Feel like I\njust want to scream into a pillow, cry and not have to deal with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "病気で育った私は、自分の死を恐れたことはありませんでした。しかし、親父が死んだことで\n落ち込んでいます。彼は素晴らしい人で、私たちは完璧な関係を築いていました。だから、私には\nもちろん、「もしも」ということはありません。でも、それでも彼を失いたくはありません。今の気持ちは\n枕に向かって叫びたいような、泣きたいような、そんな気持ちになります。",
      "title": "自分の死を本当に恐れない人でも、親の死を恐れる人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在生病的时候，我从来没有真正害怕过自己的死亡。但随着我父亲的死亡，我\n郁闷。他是一个伟大的人，我们有一个完美的关系。所以我没有\n\"如果\"，当然了。但无论如何，我不想失去他。我觉得自己好像\n只想对着枕头大喊大叫，痛哭流涕，而不必处理......",
      "title": "有没有人不是真的害怕自己的死亡，而是害怕父母的死亡？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在生病的時候，我從來沒有真正害怕過自己的死亡。但隨着我父親的死亡，我\n鬱悶。他是一個偉大的人，我們有一個完美的關係。所以我沒有\n\"如果\"，當然了。但無論如何，我不想失去他。我覺得自己好像\n只想對着枕頭大喊大叫，痛哭流涕，而不必處理......",
      "title": "有沒有人不是真的害怕自己的死亡，而是害怕父母的死亡？"
    }
  ]
}