{
  "author": "Commustar",
  "the_new_excerpt": "Hi everyone, I'm /u/Commustar, one of the Africa flairs. I've been invited by\nthe mods to make a Monday Methods post. Today I'll write about recent\ndevelopments in museums in Europe and North America, specifically about public\npressure to return artifacts and works of art which were violently taken…",
  "original_created_utc": 1619456512,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんこんにちは、アフリカのフレアの一人である/u/Commustarです。私は、モッズに招待されました。\n月曜メソッドの投稿をすることになりました。今日は、ヨーロッパと北米の美術館の最近の\n今日は、ヨーロッパと北米の美術館での最近の動き、特に、美術品を返却するようにという世間の\n特に、暴力的に奪われた美術品や芸術作品を返還するように求める人々の圧力について。",
      "title": "月曜日の方法-ユニバーサル・ミュージアムと略奪されたアーティファクト：返還、送還、そして最近の動向。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我是/u/Commustar，非洲耀眼的人之一。我被邀请到\n我应管理员的邀请，在星期一发表一篇方法帖。今天我想写的是\n欧洲和北美的博物馆的最新发展，特别是关于公众对归还艺术品和文物的压力。\n特别是关于公众要求归还被暴力夺走的文物和艺术品的压力......",
      "title": "星期一的方法--环球博物馆和被掠夺的文物：归还、返还和最新发展。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我是/u/Commustar，非洲耀眼的人之一。我被邀請到\n我應管理員的邀請，在星期一發表一篇方法帖。今天我想寫的是\n歐洲和北美的博物館的最新發展，特別是關於公衆對歸還藝術品和文物的壓力。\n特別是關於公衆要求歸還被暴力奪走的文物和藝術品的壓力......",
      "title": "星期一的方法--環球博物館和被掠奪的文物：歸還、返還和最新發展。"
    }
  ],
  "title": "Monday Methods- The Universal Museum and looted artifacts: restitution, repatriation, and recent developments.",
  "created_utc": 1619521150,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, I&#39;m <a href=\"/u/Commustar\">/u/Commustar</a>, one of the Africa flairs. I&#39;ve been invited by the mods to make a Monday Methods post. Today I&#39;ll write about recent developments in museums in Europe and North America, specifically about public pressure to return artifacts and works of art which were violently taken from African societies in the late 19th century and early 20th century, and which museums are under pressure to return (with special emphasis on the Benin Bronzes).</p>\n\n<p>I want to acknowledge at the start that I am not a museum professional, I do not work at a museum. Rather, I am a public historian who has followed these issues with interest for the past 4-5 years. </p>\n\n<hr/>\n\n<p>To start off, I want to give a very brief history of the Encyclopedic Museum (also called the Universal Museum). The concept of the Encyclopedic museum is that it strives to catalog and display objects that represent all fields of human knowledge and endeavor around the world. Crucial to the mission of the Universal Museum is the idea that objects from different cultures appear next to or adjacent to each other so that they can be compared. </p>\n\n<p>The origins of this type of museum reach back to the 1600s in Europe, growing out of the scholarly tradition of the <a href=\"https://en.wikipedia.org/wiki/Cabinet_of_curiosities\">Cabinet of Curiosities</a> which were private collections of objects of geologic, biological, anthropological or artistic curiosity and wonder.</p>\n\n<p>In fact, the private collection of Sir Hans Sloane formed the core collection when the British Museum was founded in 1753. The British Museum is in many ways the archetype of what an Encyclopedic Museum looks like and what role social, research and educational role such museums should play in society. To be sure, however, the Encyclopedic Museum model has influenced many other institutions like the Smithsonian, the Metropolitan Museum of Art, and the Field Museum in the United States as well as European institutions like the Irish National Museum, the Quai Branly museum, and the Humbolt Forum in Berlin.</p>\n\n<p>Throughout the 1800s, as the power of European empires grew and first commercial contacts and then colonial hegemony was expanded into South Asia, Southeast Asia, the Pacific Islands, Africa and the Middle East, there was a steady trend of Europeans sending home to Europe sculptures and works of art from these &quot;exotic&quot; locales. As European military power grew, it became common practice to take the treasures of defeated enemies home to Europe as loot. For instance, after the East India Company defeated Tipu Sultan of Mysore, an automaton called <a href=\"https://en.wikipedia.org/wiki/Tipu%27s_Tiger\">Tipu&#39;s Tiger</a> was brought to Britain and ended up in the collection of the Victoria and Albert Museum. Other objects originally belonging to Tipu Sultan were held in the private collections of British soldiers involved in the sacking of Mysore, and the <a href=\"https://www.thevintagenews.com/2019/03/18/tipu-sultan-gold/\">descendants of one soldier recently rediscovered several objects belonging to Tipu Sultan</a>.</p>\n\n<p>Similarly, in 1867 Britain dispatched the Napier Expedition, an armed column sent into the Ethiopian highlands to reach the court of Emperor Tewodros II, to secure the release of an imprisoned British consul and punish the Ethiopian emperor for imprisonment. It resulted in the sacking of Tewodros&#39; royal compound at Maqdala and Tewodros II&#39;s suicide. What followed was looting of the Ethiopian royal library (much of which ended up in the British library) as well as capture of a royal standard, robes, and Tewodros&#39; crown and a lock of the emperors hair. The crown, robes and standard also ended up in the Victoria and Albert museum.</p>\n\n<p>Ditto, French expeditions against the kingdom of Dahomey in 1892 resulted in the capturing of much Dahomeyan loot which was sent to Paris. Similarly, an expedition against Umar Tal, emir of the Tocoleur empire resulted in sending Tal&#39;s saber to Paris. </p>\n\n<p>One of the most famous collections in the British Museum, their 900 brass statues, plaques, and ivory masks and carved elephant tusks are collectively known as the Benin Bronzes. These objects were collected in similar circumstances as Tewodros&#39; and Tipu Sultan&#39;s treasures. In 1896 a British expedition of 5 British officers under George Phillips and 250 African soldiers was dispatched from Old Calabar in the British Niger Coast Protectorate towards the independent Benin Kingdom to resolve Benin&#39;s export blockade on palm oil that was causing trade disruptions in Old Calabar. Phillips&#39; expedition came bearing firearms, and there is reason to believe his intent was to conduct an armed overthrow of  <em>Oba</em> (king) Ovonramwen of Benin. His expedition was refused entry into the kingdom by sub-kings of Benin on the grounds that the kingdom was celebrating a religious festival. When Philips&#39; expedition entered the kingdom anyway, a Benin army ambushed the expedition and murdered all but two men.</p>\n\n<p>In response, the British protectorate organized a force of 1200 men armed with gunboats, rifles and 7-pounder cannon and attacked Benin city. The soldiers involved looted more than 3,000 brass plaques, sculptures, ivory masks and carved tusks, then burned the royal palace and the city to the ground and forced <em>Oba</em> Ovanramwen into exile. The Benin Kingdom was incorporated into Niger Rivers Protectorate and later became part of Nigeria colony and the modern Republic of Nigeria.</p>\n\n<p>For the British soldiers looting Benin city, these objects were seen as spoils of war, ways to supplement their wages after a dangerous campaign. Many of the soldiers soon sold the looted objects on to collectors for the British Museum (where 900 bronzes are), or to scholar-gentlemen like General Augustus Pitt-Rivers who donated 400 bronzes to Oxford university, now housed in the Pitt-Rivers museum at Oxford. Pitt-Rivers also purchased many more Benin objects and housed them at his private museum, the Pitt-Rivers museum at Farnham (or the &quot;second collection&quot;) which operated from 1900 until 1966, when it was closed and the Benin art was sold on the private art market. Other parts of the Benin royal collection have made it into museums in Berlin, Dresden, Leipzig, Vienna, Hamburg, the Field museum in Chicago, the Metropolitan Museum of Art in NYC, Boston&#39;s MFA, the Penn Museum in Philadelphia, National Museum of Ireland, UCLA&#39;s Fowler museum. An unknown number have remained in the collections of private individuals.</p>\n\n<p>Part of the reason that the Benin Bronzes have ended up in so many different institutions is that the prevailing European social attitude at the time must be called white supremacist. European social and artistic theory regarded African art as primitive, in contrast to the supposed refinement of classical and renaissance European art. The remarkable technical and aesthetic quality of the Benin bronzes challenged this underlying bias, and European art scholars and anthropologists sought to explain how such &quot;refined&quot; art could come from Africa.</p>\n\n<p>Later on, as African countries gained independence, art museums and ethnographic museums became increasingly aware of gaps in representation of African art in their collections. From the 1950s up to the present, museums have sought to add the Benin bronzes to their collections as prestigious additions that add to the &quot;completeness&quot; of their representation of art.</p>\n\n<hr/>\n\n<p>Since the majority of African colonies gained independence in the 1960, there have been repeated requests from formerly colonized states for the return of objects looted during the colonial era.</p>\n\n<p>There are precedents for this sort of repatriation or restitution for looted art, notably the issue of Nazi plunder. Since 1945, there have been periodic and unsystematic efforts by museums and institutions to determine the provenance of their art. By provenance  I mean the chain-of-custody; tracking down documentation of where art was, who owned it when. Going through this chain-of-custody research can reveal gaps in ownership, and for art known to be in Europe with gaps in ownership or that changes location unexplainably from 1933-1945, that is a possible signal such art was looted by the Nazi regime. In instances where art has been shown to be impacted by Nazi looting or confiscation from Jewish art collectors, some museums have tried to offer compensation (restitution) or return the art to descendants (repatriation) of the wronged owners.</p>\n\n<p>Another strand of the story is the growth of international legal agreements controlling the export and international sale of antiquities. Countries like Greece, Italy and Egypt long suffered from illicit digging for classical artifacts which were then exported and sold on the international art market. The governments of Greece, Italy, Egypt and others bitterly complained how illicit sales of antiquities harmed their nations cultural heritage. The 1970 UNESCO Convention on Means of Prohibiting and Preventing the Import, Export and Transfer of Ownership of Cultural Property is a major piece of legislation concerning antiquities. Arts dealers must prove that antiquities left their country of origin prior to 1970, or must have documentation that export of those specific antiquities was approved by national authorities. </p>\n\n<p>Additionally, starting in the 1990s countries began to implement specific bilateral agreements regulating the export of antiquities from &quot;source&quot; countries to &quot;market&quot; countries. An early example is the <a href=\"https://eca.state.gov/cultural-heritage-center/cultural-property-protection/bilateral-agreements/mali/us-mali-cultural\">US-Mali Cultural Property Agreement</a> these are designed to make it harder for the illicit export of Malian cultural heritage to the United Sates, and ensure repatriation of illegally imported goods.</p>\n\n<p>However, neither the UNESCO convention nor bilateral agreements cover goods historically looted in the colonial era. That has typically required diplomatic pressure and repeated requests from the source country and goodwill from the ex-colonial power. An example of this is Italy looting the Obelisk of Aksum in 1937 during the Italian occupation of Ethiopia. After World War 2 Ethiopia repeatedly demanded the return of the obelisk, but repatriation <a href=\"https://www.theguardian.com/world/2005/apr/20/italy.ethiopia\">only happened in 2005</a>.</p>\n\n<p>On the other hand, several European ex-colonial countries have established laws that forbid the repatriation of objects held in national museums. For instance, <a href=\"https://en.wikipedia.org/wiki/British_Museum_Act_1963\">The British Museum Act of 1963</a> passed by parliament forbids the museum from removing objects from the collection, effectively forbidding repatriation of Benin Bronzes, Elgin Marbles, and other controversial objects.</p>\n\n<p>However, there has been major, major movement in the topic of repatriation over the past 3-4 years. In 2017 French President Emmanuel Macron pledged to return 26 pieces of art looted from Dahomey and Tocoleur empire to Benin republic and Senegal respectively. <a href=\"https://news.artnet.com/art-world/france-senate-restitution-africa-1921184\">Last year French parliament approved the plan to return the objects</a>.</p>\n\n<p>Over the past 6 months, as public protest over public monuments like the <a href=\"https://www.theguardian.com/world/2020/jul/15/edward-colston-statue-replaced-by-sculpture-of-black-lives-matter-protester\">toppling of Edward Colston&#39;s statue in Bristol, England</a> and the <a href=\"https://en.wikipedia.org/wiki/Rhodes_Must_Fall\">Rhodes Must Fall movement</a> in South Africa and UK, and similar movements in United States, have forced a public reckoning with how public monuments have promoted Colonialism, White Supremacy, and have glorified men with links to the Slave Trade.</p>\n\n<p>There has been similar movement within the museum world, pushing for a public reckoning over the display of art plundered from Africa, India and other colonized areas. In December 2019, Jesus College at Cambridge University pledged to repatriate <a href=\"https://www.theguardian.com/education/2019/nov/27/bronze-cockerel-to-be-returned-to-nigeria-by-cambridge-college\">a bronze statue from Benin kingdom</a>. </p>\n\n<p>A month ago, in mid March, the Humbolt Forum in Berlin announced plans not to display their collection of 500 Benin Bronzes and entered talks with the Legacy Restoration Trust to repatriate the objects to Nigeria. A day later the University of Aberdeen committed themselves to repatriate a Benin Bronze in their collection.</p>\n\n<p>Other museums like the National Museum of Ireland, the Hunt Museum in Limerick, and UCLA&#39;s Fowler Museum are all reaching out to Nigerian National Commission for Museums and Monuments and the Legacy Restoration Trust to discuss repatriation. The Horniman Museum in London has signaled that it will consider opening discussions (translated &quot;we&#39;ll think about talking about giving back these objects&quot;).</p>\n\n<p>To their credit, museum curators have been active in conversations about repatriation. Museum professionals at <a href=\"https://digital-benin.org/team\">the Digital Benin Project</a> have been active in asking museums if they have Benin art in their collections, and researching the provenance of it to determine if it was plundered in the 1897 raid.</p>\n\n<p><a href=\"https://www.prm.ox.ac.uk/people/dr-dan-hicks\">Dr. Dan Hicks, curator at the Pitt-Rivers museum Oxford</a> has been a vocal proponent of returning Benin Bronzes in European and North American art collections.</p>\n\n<p>Finally, the Legacy Restoration Trust in Nigeria has been active in lobbying for the return of the objects, as well as <a href=\"https://www.smithsonianmag.com/smart-news/museum-west-african-art-will-incorporate-pieces-city-destroyed-1897-invasion-180976318/\">planning the construction of the Edo Museum of West African Art</a> to serve as one home for repatriated Benin art. In fact, it is Nigerian activists who have taken the lead in lobbying for repatriation. With construction of EMOWAA and other potential museums, curators like Hicks say <a href=\"https://www.artnews.com/art-news/news/benin-bronzes-safety-repatriation-columbia-university-conference-1234589408/\">Benin bronzes are not safer in Western institutions than they would be in Nigeria</a>.</p>\n\n<p>Most of these announcements of Benin Bronzes repatriation negotiations have happened in the past month. Watch this space, because more museums may announce repatriation or restitution plans.</p>\n\n<p>If you would like to read more about the history of how the Benin Bronzes got into more than 150 museums and institutions, I highly recommend Dan Hicks&#39; book <a href=\"https://www.plutobooks.com/9780745341767/the-brutish-museums/\">The Brutish Museums</a>. It includes an index of museums known to host looted Benin art. </p>\n\n<p>If you find that your local metropolitan museum holds Benin art, or other art looted during the colonial era, I encourage you to contact the museum and raise the issue of repatriation or restitution with them.</p>\n\n<p>Thank you for reading!</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/mz2efn/monday_methods_the_universal_museum_and_looted/",
  "subreddit": "AskHistorians",
  "id": "mz2efn",
  "is_self": true,
  "media": null,
  "is_video": false
}