{
  "author": "fer_momento",
  "original_created_utc": 1647805702,
  "title": "How I grew my startup to 100.000+ visitors per month with no time for marketing",
  "created_utc": 1647820236,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m the founder of &lt;a href=\"https://www.resumemaker.online/\"&gt;ResumeMaker.Online&lt;/a&gt;, a resume builder tool that aims to help non-tech savvy users to easily design an effective resume and have a fair chance to get the job they want.&lt;/p&gt;\n\n&lt;p&gt;Resumemaker.online recently reached a huge milestone: 1.000.000 free downloads. Almost at the same time, it also hit 100.000 thousands unique visitors per month for the first time. I thought it could be a good idea to write a simple recap and look back on how it grew this much without me spending any considerable time for marketing.&lt;/p&gt;\n\n&lt;p&gt;Disclaimer: this is by no means a guide or advice on what to do, because I’m far from being a good marketer (more often than not I feel like I’m throwing darts in the dark), but by telling my story, hopefully it sparks ideas that are applicable to your businesses.&lt;/p&gt;\n\n&lt;p&gt;During these past 3,5 years since I launched ResumeMaker.Online, I moved to three different countries and worked at three different full time jobs.Adapting to new cultures, settle down and finding where to live, visa paperwork, learning the ins and outs of new organizations: there were always too many things going on at the same time to set proper routines around a side project, plus I didn’t want to neglect my main source of income nor my relationships. It was not uncommon to spend entire weeks without being able to work on my side project for more than an hour or two.&lt;/p&gt;\n\n&lt;p&gt;Eventually, I managed to consistently work from about 4 to 6 hours during the weekends. Not ideal but, at least, it narrowed down the scope. This made it clear that the marketing strategy needed to be one that wouldn’t require constant action from my part. Instead, it should focus on bringing practical long-lasting, continued results. Here it is what worked:&lt;/p&gt;\n\n&lt;h2&gt;SEO&lt;/h2&gt;\n\n&lt;p&gt;Almost 65% of the traffic comes from organic search. I had a head start by being selected &lt;a href=\"https://www.producthunt.com/posts/resumemaker-online\"&gt;#1 Product of the day + week&lt;/a&gt; on Product Hunt. This built a good reputation and snowballed into countless backlinks, tweets and shares from day one.&lt;/p&gt;\n\n&lt;p&gt;I was a total beginner and not part of the indie hackers scene at all. I posted it just for fun, with zero real expectations. Looking back, knowing now how much of an impact it can have, I would have taken more time to prepare for the launch to leave less room for luck to play a major role.&lt;/p&gt;\n\n&lt;p&gt;From there on, it was relatively easy to follow up to the successful launch. I wrote an UX case study, did multiple interviews and got featured on several indie hacker/Saas related websites and design blogs, although it was always a struggle to get noticed outside the tech, design and indie hacker bubble.&lt;/p&gt;\n\n&lt;p&gt;My target audience are not tech savvy users and the goal was to get press coverage on more main stream channels. I wrote a cold mail template with a media kit attached that I sent to hundreds of journalists with pretty low success. I realized then, that it was not time effective to peruse both small, medium and big publications. So, I made the bold assumption that once a big online newspaper writes about my product, then the smaller ones would echo the story.&lt;/p&gt;\n\n&lt;p&gt;At first, I was not getting any replies and getting really frustrated seeing how the little time I had was going to waste, so I decided to change the angle of the story. Instead of making it about the product, I made it about my personal journey.&lt;/p&gt;\n\n&lt;p&gt;During that time, Argentina (my home country) was suffering harshly the economic effects of the pandemic and it was under one of the most strict set of restrictions in the world. The story about an Argentinian that fled the country, landed a job overseas, and was helping others do the same was much more interesting to a mainstream audience than just talking about a website. And it worked! &lt;a href=\"https://www.clarin.com/viste/joven-creo-pagina-web-diseno-cv-gratis-descargaron-800-mil-curriculums_0_k45nwO3Fv.html\"&gt;I managed to get an interview with Clarín&lt;/a&gt;, one of the most popular news sites in South America with more than 20 millions (!) unique visitors per month. As an extra, my assumption was correct and a lot of other news websites did echo the story, resulting in even more back links without me having to move a finger.&lt;/p&gt;\n\n&lt;p&gt;I’ll try to be alert to any new window of opportunity to pitch journalists with the right angle and multiply the result of the efforts, rather than merely talk about the product itself and getting low return of the time investment.&lt;/p&gt;\n\n&lt;p&gt;Getting high quality back links was only one part, the other was making sure the website meets the Google SEO requirements with flying colors. At one point, I got really comfortable with the rankings. ResumeMaker.Online was on the first page of Google for keywords like “resume maker” in almost every country, thanks to the number of backlinks. Then, ​from one day to another, the December 2020 Google Core Update tanked the rankings hard.&lt;/p&gt;\n\n&lt;p&gt;I was in shock, thinking the site was never going to recover. In a way, I’m glad it happened. It was a much-needed wake-up call to take ResumeMaker.Online to the next level and tick all the boxes in Google Search Console.&lt;/p&gt;\n\n&lt;p&gt;Back in early-mid 2021, I took a two week vacation at my full time job. I just chilled and recharged during the first week and, after that, I worked non stop on fixing all the problems that Google listed and revamped the mobile experience from scratch. Nowadays, ResumeMaker.Online v2.0 ranks better than ever and the improved performance (perfect score in Google Insights) have had an impact, not only on the rankings, but on the overall user experience and sales as well.&lt;/p&gt;\n\n&lt;h2&gt;Multilingual support&lt;/h2&gt;\n\n&lt;p&gt;I introduced support for six more languages: Spanish, German, Portuguese, Swedish, French and Italian. Data shows that despite most of the traffic is in English, up to 10% of users land in non-english pages.&lt;/p&gt;\n\n&lt;h2&gt;Watermark link&lt;/h2&gt;\n\n&lt;p&gt;During its first years, I was concerned that monetizing the product could get in the way of growth. Instead, I offered a 100% free service but I added a watermark link at the end of the page. By nature, a CV is shared with multiple other people and I wanted to leverage on that. Currently, almost 2% of the traffics comes from users that click in a watermark that took me less than 10 minutes to add.&lt;/p&gt;\n\n&lt;h2&gt;Share to download&lt;/h2&gt;\n\n&lt;p&gt;When I introduced the paid PRO version (without watermark), the free download remained available, but this time, locked behind a share-to-unlock feature. Now, users need to share a link on one of the available social media channels in order to unlock the download link, a fair deal in my opinion.&lt;/p&gt;\n\n&lt;p&gt;Currently, more than 25.000 free resumes are downloaded monthly. Even though many users do probably delete their post just after sharing, around 10% of the traffic comes from social media every month. This is a huge increase compared to previous performance.&lt;/p&gt;\n\n&lt;h2&gt;Sharable discount link&lt;/h2&gt;\n\n&lt;p&gt;After payment, users can also spread the word by sharing a discount link for the PRO download with friends and family. The traffic from this source is below 1%. Naturally, it is too low compared to the result of other efforts, but almost 70% of paid users copy the link and the conversion rate is almost double.&lt;/p&gt;\n\n&lt;h2&gt;Preparing for the future&lt;/h2&gt;\n\n&lt;p&gt;It was important to have realistic expectations on what I could accomplish with limited time, although there was no reason not to get ready for what’s to come. I have plans to launch a remote jobs newsletter some time during this year, so I added a newsletter subscription form. It currently sits at 30.000 subscribers averaging +800 new subs per week. When time is right to start working on this, subscribers are already there!&lt;/p&gt;\n\n&lt;p&gt;--&lt;/p&gt;\n\n&lt;p&gt;The dream is to come to a full circle and end up in a situation where most things are automated and no active marketing is required from my part, besides two or three hours of work per week, &lt;em&gt;but&lt;/em&gt; with much bigger revenue than now. So, in the meantime, there’s plenty more work to do!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/_CXOdg_htCRZpNMDffxIDnavZwCI0fUa0n7psxry3cY.jpg?auto=webp&amp;s=54d009379bea8a01d1a92042b428121659bab1fa",
          "width": 600,
          "height": 330
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/_CXOdg_htCRZpNMDffxIDnavZwCI0fUa0n7psxry3cY.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=567d16a8d1c4de057357f67c969c21f7f1d8ced0",
            "width": 108,
            "height": 59
          },
          {
            "url": "https://external-preview.redd.it/_CXOdg_htCRZpNMDffxIDnavZwCI0fUa0n7psxry3cY.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=b67ae9fd8223f738c8f38e4e0160942e87afa5e6",
            "width": 216,
            "height": 118
          },
          {
            "url": "https://external-preview.redd.it/_CXOdg_htCRZpNMDffxIDnavZwCI0fUa0n7psxry3cY.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=ae306d5cd2b12dc51b278cd084422b61c338b9da",
            "width": 320,
            "height": 176
          }
        ],
        "variants": {},
        "id": "fbJLAPNPE_m9L5bXWLkdVJqIwaJeePOOpOLXXRMk04Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/tit6qt/how_i_grew_my_startup_to_100000_visitors_per/",
  "subreddit": "SideProject",
  "id": "tit6qt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m the founder of ResumeMaker.Online [https://www.resumemaker.online/], a\nresume builder tool that aims to help non-tech savvy users to easily design an\neffective resume and have a fair chance to get the job they want.\n\nResumemaker.online recently reached a huge milestone: 1.000.000 free…"
}