{
  "author": "GlobalRevolution",
  "the_new_excerpt": "Call me a suspicious randy mf but right as GME started going down AH (lol they\nthink that blip matters) CNBC announces Melvin has closed out. This was then\nfollowed by a ton of suspect baby accounts posting with brain dead comments try\nto create FUD.\n\nAutomod cleaned a bunch of them already but…",
  "original_created_utc": 1611747328,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说我是一个可疑的兰迪mf，但就在GME开始下降AH（lol他们）。\n认为昙花一现很重要）CNBC宣布梅尔文已经收手。这时\n随后是一大堆疑似宝宝的账号发帖，并附上脑残的评论试试\n来制造FUD。\n\nAutomod已经清理了一堆，但是... ...",
      "title": "警告：GME短线在此子上的更多操作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說我是一個可疑的蘭迪mf，但就在GME開始下降AH（lol他們）。\n認爲曇花一現很重要）CNBC宣佈梅爾文已經收手。這時\n隨後是一大堆疑似寶寶的賬號發帖，並附上腦殘的評論試試\n來製造FUD。\n\nAutomod已經清理了一堆，但是... ...",
      "title": "警告：GME短線在此子上的更多操作。"
    }
  ],
  "title": "WARNING: More manipulation on this sub by GME shorts",
  "created_utc": 1611763955,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Call me a suspicious randy mf but right as GME started going down AH (lol they think that blip matters) CNBC announces Melvin has closed out. This was then followed by a ton of suspect baby accounts posting with brain dead comments try to create FUD.</p>\n\n<p>Automod cleaned a bunch of them already but watch the fuck out. I think they knew people are thinking about taking profit once Melvin is out. Not only are there a lot of other shorts I&#39;m calling fucking bullshit. CNBC caters to them, not us. They fed the media the fake story, put boys on the board, and took what&#39;s left of their dieing fund to drive the price down and made their last stand hoping to reclaim anything.</p>\n\n<p>Well guess what Melvin? Fuck you and eat my ass hole on your way out.</p>\n</div><!-- SC_ON -->",
  "score": 39263,
  "permalink": "/r/wallstreetbets/comments/l62obe/warning_more_manipulation_on_this_sub_by_gme/",
  "subreddit": "wallstreetbets",
  "id": "l62obe",
  "is_self": true,
  "media": null,
  "is_video": false
}