{
  "author": "Thorpio",
  "the_new_excerpt": "Since last December worldwide production of microchip is running low.\nAutomotives market is the first sector where it's gonna reflect the most.\nFinancial Times and IHS Markit said car production of Honda, Toyota, FCA, GM and\nFord will slow down and lots of money are going to be lost. Companies that…",
  "original_created_utc": 1612640293,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "自去年12月以来，全球的微芯片生产量正在减少。\n汽车市场是第一个反映最强烈的行业。\n金融时报》和IHS Markit表示，本田、丰田、FCA、通用汽车和通用汽车的汽车生产。\n福特会放慢脚步，很多钱都会流失。公司，...",
      "title": "$TSMC-----------------------------新来的DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自去年12月以來，全球的微芯片生產量正在減少。\n汽車市場是第一個反映最強烈的行業。\n金融時報》和IHS Markit表示，本田、豐田、FCA、通用汽車和通用汽車的汽車生產。\n福特會放慢腳步，很多錢都會流失。公司，...",
      "title": "$TSMC-----------------------------新來的DD"
    }
  ],
  "title": "$TSMC - a newbe sort of DD",
  "created_utc": 1612655576,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since last December worldwide production of microchip is running low. Automotives market is the first sector where it&#39;s gonna reflect the most. Financial Times and IHS Markit said car production of Honda, Toyota, FCA, GM and Ford will slow down and lots of money are going to be lost. Companies that can produce new generation microchip (7 and 5 nm) are INTEL, SAMSUNG and TSMC. Between the three Intel is the one who&#39;s struggling the most. Other than those three, Apple, Arm, Nvidia and Qualcomm play a big part in the game, but they actually design the chips and make TSMC to produce them. Trenforce, mentioned by Bloomberg, said that 56% of the gains from microchip worldwide income has been generated by TSMC. That&#39;s due to commercial war between US and China.  To prevent sanctions and duties, companies cancelled orders to China making workload of other companies outside China raised (or raising? I&#39;m not english). Sony, Microsoft  are saying that market is slowing down a bit for them aswell. Meanwhile TSMC has announced in the past weeks that they&#39;ve managed to increase their productive power.</p>\n\n<p>I use DEGIRO and I&#39;m not allowed to buy TSMC. If I could, I would to it. TSMC it&#39;s cheap. But you might be interested and I just wanted to be part of this give and take game</p>\n\n<p>Hugs</p>\n</div><!-- SC_ON -->",
  "score": 99,
  "permalink": "/r/investing/comments/le4zlk/tsmc_a_newbe_sort_of_dd/",
  "subreddit": "investing",
  "id": "le4zlk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199856
}