{
  "author": "throwaway-542789",
  "the_new_excerpt": "Pretty much what the title says. I've had a few different jobs and before I was\nat least able to enjoy my days off but in this one (call centre) I'm just\nconstantly dreading going back in. I handed my notice in a few weeks ago and\nthen they offered to put me on part time, I'm still waiting for it to…",
  "original_created_utc": 1621766013,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるようなことがほとんどです。私はいくつかの異なる仕事をしてきましたが、以前は少なくとも休日を楽しむことができました。\n前は少なくとも休日を楽しむことができましたが、この仕事（コールセンター）では常に\n戻るのが怖くてたまりません。数週間前に辞表を提出しました。\nパートタイムでの勤務を提案されましたが、まだそれを待っています。",
      "title": "すぐに復帰することがわかっているので、仕事のない日を楽しめないのは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几乎和标题所说的一样。我做过几份不同的工作，以前我至少可以享受我的休息日。\n至少能够享受我的休息日，但在这份工作中（呼叫中心）我只是\n一直害怕回去。我在几周前递交了我的通知，然后他们提出让我做兼职。\n然后他们提出让我做兼职，我仍然在等待...",
      "title": "不享受你的休息日，因为你知道你很快就会回来，这是否正常？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾乎和標題所說的一樣。我做過幾份不同的工作，以前我至少可以享受我的休息日。\n至少能夠享受我的休息日，但在這份工作中（呼叫中心）我只是\n一直害怕回去。我在幾周前遞交了我的通知，然後他們提出讓我做兼職。\n然後他們提出讓我做兼職，我仍然在等待...",
      "title": "不享受你的休息日，因爲你知道你很快就會回來，這是否正常？"
    }
  ],
  "title": "Is it normal to not enjoy your days off work because you know you're going to be back in way too quickly?",
  "created_utc": 1621785996,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pretty much what the title says. I&#39;ve had a few different jobs and before I was at least able to enjoy my days off but in this one (call centre) I&#39;m just constantly dreading going back in. I handed my notice in a few weeks ago and then they offered to put me on part time, I&#39;m still waiting for it to be approved so idk if that might help a bit if it ever does get approved. But yeah, just wanted to know if anyone else has had the same feeling. </p>\n\n<p>TIA</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/nj54yb/is_it_normal_to_not_enjoy_your_days_off_work/",
  "subreddit": "NoStupidQuestions",
  "id": "nj54yb",
  "is_self": true,
  "media": null,
  "is_video": false
}