{
  "author": "Ayy_2_Brute",
  "original_created_utc": 1627245742,
  "title": "I randomly came across hundreds of newspaper accounts of \"sea serpent\" sightings from the 1800s, some of which go into very precise detail. But by 1910 it had become a joke. What changed? Was this just a weird phenomenon of the era?",
  "created_utc": 1627269912,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started out clipping each one I found, but I soon realized there were literally more than a hundred of them just between 1818 and 1910. They range from just a few lines to accounts that read like sworn depositions. I chucked them all into an album here. <a href=\"https://imgur.com/a/GyaD4oU\">https://imgur.com/a/GyaD4oU</a></p>\n\n<p><a href=\"https://i.imgur.com/enoDtK5.png\">This one was so detailed I went to type in the name of the ship, only to find it has become quite famous.</a></p>\n\n<p>Was this some short-lived phenomenon, or was it just that newspapers began printing the weird sightings people had always made while out at sea?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/orjjh0/i_randomly_came_across_hundreds_of_newspaper/",
  "subreddit": "AskHistorians",
  "id": "orjjh0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I started out clipping each one I found, but I soon realized there were\nliterally more than a hundred of them just between 1818 and 1910. They range\nfrom just a few lines to accounts that read like sworn depositions. I chucked\nthem all into an album here. https://imgur.com/a/GyaD4oU\n\nThis one was so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初は見つけたものを一つ一つクリップしていたのですが、すぐに1818年から1910年の間だけでも文字通り100枚以上あることに気づきました。\n1818年から1910年の間に、文字通り100件以上もあったのです。その内容は\n数行のものから宣誓供述書のようなものまで。私は\nhttps://imgur.com/a/GyaD4oU にまとめました。\n\nこれはとても...",
      "title": "私は、1800年代の「シーサーペント」の目撃談が掲載された新聞を何百回となく目にしましたが、その中には非常に詳細な記述もありました。しかし、1910年には冗談のような話になっていました。何が変わったのでしょうか？この時代の奇妙な現象だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我开始剪下我找到的每一个，但我很快意识到，仅在1818年至1910年间，就有超过一百个这样的文件。\n仅在1818年至1910年间就有一百多份。它们的范围\n从只有几行字到读起来像宣誓证词的叙述。我把它们\n他们都在这里的一个相册里。https://imgur.com/a/GyaD4oU\n\n这个人是如此...",
      "title": "我随机看到了几百份19世纪以来关于 \"海蛇 \"目击的报纸报道，其中一些报道非常精确地描述了细节。但是到了1910年，这已经成为一个笑话。是什么改变了？这只是那个时代的一种奇怪现象吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我開始剪下我找到的每一個，但我很快意識到，僅在1818年至1910年間，就有超過一百個這樣的文件。\n僅在1818年至1910年間就有一百多份。它們的範圍\n從只有幾行字到讀起來像宣誓證詞的敘述。我把它們\n他們都在這裏的一個相冊裏。https://imgur.com/a/GyaD4oU\n\n這個人是如此...",
      "title": "我隨機看到了幾百份19世紀以來關於 \"海蛇 \"目擊的報紙報道，其中一些報道非常精確地描述了細節。但是到了1910年，這已經成爲一個笑話。是什麼改變了？這只是那個時代的一種奇怪現象嗎？"
    }
  ]
}