{
  "author": "q203",
  "the_new_excerpt": "I am having trouble understanding this because, on the one hand, it seems like\nif they didn't want China to have control over Hong Kong, they would just not\nhave ceded the territory in the first place. On the other hand, if they were\nfeeling immense pressure to cede the territory, then why include…",
  "original_created_utc": 1623932389,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がこのことを理解できないのは、一方では、中国に香港を支配されたくなければ\n中国に香港を支配されたくないのであれば、そもそも領土を割譲しなければよかったのではないかと\n香港を中国に支配されたくないのであれば、そもそも領土を割譲しなかったはずです。その一方で、もし彼らが\n領土を譲らなければならないという強いプレッシャーを感じていたのであれば、なぜ...",
      "title": "なぜイギリスは、香港を中国に割譲する際の契約書に、50年条項（2047年まで香港を擬似的に独立させる）を入れたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很难理解这一点，因为一方面，这似乎是\n如果他们不希望中国控制香港，他们就不会在一开始就割让香港。\n他们一开始就不会割让该领土。另一方面，如果他们\n感到割让领土的巨大压力，那么为什么包括......",
      "title": "为什么英国人在割让香港给中国的协议中加入了50年的条款（这使得香港在2047年之前都是伪独立的）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很難理解這一點，因爲一方面，這似乎是\n如果他們不希望中國控制香港，他們就不會在一開始就割讓香港。\n他們一開始就不會割讓該領土。另一方面，如果他們\n感到割讓領土的巨大壓力，那麼爲什麼包括......",
      "title": "爲什麼英國人在割讓香港給中國的協議中加入了50年的條款（這使得香港在2047年之前都是僞獨立的）？"
    }
  ],
  "title": "Why did the British put the 50-year provision (which makes Hong Kong pseudo-independent until 2047) in their agreement to cede Hong Kong to China?",
  "created_utc": 1623966207,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am having trouble understanding this because, on the one hand, it seems like if they didn&#39;t want China to have control over Hong Kong, they would just not have ceded the territory in the first place. On the other hand, if they were feeling immense pressure to cede the territory, then why include this provision at all? Why not just give it to China? Did they expect China to become a democracy within those 50 years and want Hong Kong to be protected until that time?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/o1vwdw/why_did_the_british_put_the_50year_provision/",
  "subreddit": "AskHistorians",
  "id": "o1vwdw",
  "is_self": true,
  "media": null,
  "is_video": false
}