{
  "author": "Bitter-Condition-492",
  "the_new_excerpt": "With Blackberry's crazy runup, I wonder if the stock presents a significant\nrisk. The stock is finally back to 2011 levels. Bagholders that have been\nlooking for an exit for years may start to sell. I know my brother did\nyesterday. Institutional and value oriented investors look at this…",
  "original_created_utc": 1611589098,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "随着黑莓的疯狂上涨，不知道该股是否呈现出明显的。\n险。该股终于回到了2011年的水平。袋股东，已经\n寻觅多年的出路，可能会开始出售。我知道我弟弟就是这样的\n昨日，。机构和价值导向的投资者来看，...",
      "title": "BB-风险？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着黑莓的瘋狂上漲，不知道該股是否呈現出明顯的。\n險。該股終於回到了2011年的水平。袋股東，已經\n尋覓多年的出路，可能會開始出售。我知道我弟弟就是這樣的\n昨日，。機構和價值導向的投資者來看，...",
      "title": "BB-風險？"
    }
  ],
  "title": "BB- A Risk?",
  "created_utc": 1611644124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With Blackberry&#39;s crazy runup, I wonder if the stock presents a significant risk. The stock is finally back to 2011 levels. Bagholders that have been looking for an exit for years may start to sell. I know my brother did yesterday. Institutional and value oriented investors look at this significant jump, see the $$ and jump ship...</p>\n\n<p>Additionally, their performance really isn&#39;t that great, sure they are transitioning, but that transition has already taken place years ago, phones haven&#39;t been a large part of their revenue for atleast 3 years. </p>\n\n<p>Their EPS is down 282% Q/Q, with sales down 18.4% Q/Q. If Apple and Amazon start working with Blackberry, sales could increase? But who knows how much? Certainly competition will emerge. Microsoft has already partnered with GM on their self driving platform.  Who knows, Tesla or Nio may sell their software. Elon likes making patents available to the public...</p>\n\n<p>&#x200B;</p>\n\n<p>I hear a lot of people saying BB is criminally undervalued, even after the jump. I&#39;m just not that sure. </p>\n\n<p>&#x200B;</p>\n\n<p>Disclosure: Jan 29, 13c</p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/stocks/comments/l4q9nc/bb_a_risk/",
  "subreddit": "stocks",
  "id": "l4q9nc",
  "is_self": true,
  "media": null,
  "is_video": false
}