{
  "author": "TheMuffinistMan",
  "original_created_utc": 1627362905,
  "title": "As this is pretty much Reddit's premier cryptocurrency sub, its important to remember that a huge amount of newcomers appear here every single day. Yes there are moon shitposters, but even more have genuine questions that are critical to their first experiences with cryptocurrency.",
  "created_utc": 1627396513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TL;DR: Newcomers with questions basic and advanced should be treated with the same integrity we have until now. Creating a toxic environment by refusing to answer questions due to suspicion only hurts the market as a whole and gives a bad taste to people who have genuine interest. Don&#39;t let the moonrise change this sub and it&#39;s environment, keep away the FUD and help people</strong></p>\n\n<p>The recent price increase of moons has started to inspire a negative attitude towards many basic question posts and real discussion posts over the last two days, and while there are clear fake self stories of success, the best way to handle all these basic questions is just to answer the question outright.</p>\n\n<p>Many different google searches lead to posts in this subreddit about cryptocurrency, especially the basic questions along with useful guides posted here somewhat often. Its similar to how yahoo questions is still a popular destination for students looking for answers to questions from years ago, people here need to remember to maintain a degree of honesty and integrity when it comes to answering individuals. Otherwise we end up creating a toxic ecosystem like DOGE forums and communities, where any little question starts to be seen as FUD.</p>\n\n<p>I&#39;m not going to write a sob story about how I came across this sub a year back, I genuinely wish newcomers the best since cryptocurrency is always in need of new developers, supporters, and idea creators. And the only way that will happen is if we treat people the same as we always have and don&#39;t deny people knowledge due to suspicion.</p>\n</div><!-- SC_ON -->",
  "score": 270,
  "permalink": "/r/CryptoCurrency/comments/osgjd4/as_this_is_pretty_much_reddits_premier/",
  "subreddit": "CryptoCurrency",
  "id": "osgjd4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL;DR: Newcomers with questions basic and advanced should be treated with the\nsame integrity we have until now. Creating a toxic environment by refusing to\nanswer questions due to suspicion only hurts the market as a whole and gives a\nbad taste to people who have genuine interest. Don't let the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR: 基本的な質問や上級者向けの質問をしている新規参入者には、これまでと同じように誠実に対応する必要があります。\n今までと同じように誠実に対応してください。質問に答えようとしないことで、有害な環境を作り\n疑って質問に答えないことで有害な環境を作ることは、市場全体に悪影響を与え、純粋に興味を持っている人に\n疑って質問に答えないような有害な環境を作ることは、市場全体に悪影響を与え、純粋に興味を持っている人に そのようなことがないように...",
      "title": "ここはRedditの中でも暗号通貨に関するサブセクションで、毎日多くの新規参入者が訪れていることを覚えておく必要があります。確かに月並みな投稿者もいますが、それ以上に、暗号通貨を初めて体験する上で重要な純粋な疑問を持っている人もいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR: 对有问题的新来者，不管是基本的还是高级的，都应该以迄今为止的诚信对待。\n到现在为止，我们都是以同样的诚信对待。通过拒绝回答问题来创造一个有毒的环境\n由于怀疑而拒绝回答问题，这只会伤害整个市场，并给真正有兴趣的人带来坏印象。\n给那些真正有兴趣的人带来不好的印象。不要让...",
      "title": "由于这几乎是Reddit的首要加密货币子，重要的是要记住，每天都有大量的新人出现在这里。是的，这里有月球上的屎壳郎，但更多的人有真正的问题，这些问题对他们在加密货币方面的第一次经历至关重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR: 對有問題的新來者，不管是基本的還是高級的，都應該以迄今爲止的誠信對待。\n到現在爲止，我們都是以同樣的誠信對待。通過拒絕回答問題來創造一個有毒的環境\n由於懷疑而拒絕回答問題，這隻會傷害整個市場，並給真正有興趣的人帶來壞印象。\n給那些真正有興趣的人帶來不好的印象。不要讓...",
      "title": "由於這幾乎是Reddit的首要加密貨幣子，重要的是要記住，每天都有大量的新人出現在這裏。是的，這裏有月球上的屎殼郎，但更多的人有真正的問題，這些問題對他們在加密貨幣方面的第一次經歷至關重要。"
    }
  ]
}