{
  "author": "Obligatory-Reference",
  "original_created_utc": 1634145550,
  "title": "The Silk Road ran through some pretty rugged terrain. Before paved roads, how did caravans manage to push through the mountains, deserts, etc? What kind of speed could they manage along the way?",
  "created_utc": 1634216616,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: Maybe to clarify a bit - I picked the Silk Road on a whim, even though as <a href=\"/u/EnclavedMicrostate\">/u/EnclavedMicrostate</a> pointed out it&#39;s not the best example as it wasn&#39;t really a thing. In general, I&#39;d be interested in any land-based caravan journey crossing rough terrain.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/q7fycy/the_silk_road_ran_through_some_pretty_rugged/",
  "subreddit": "AskHistorians",
  "id": "q7fycy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EDIT: Maybe to clarify a bit - I picked the Silk Road on a whim, even though as\n/u/EnclavedMicrostate pointed out it's not the best example as it wasn't really\na thing. In general, I'd be interested in any land-based caravan journey\ncrossing rough terrain.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: 少し明確にしておきたいのですが、私は気まぐれにシルクロードを選びました。\n/が指摘したように、実際には存在しなかったので、最良の例ではありません。\nのです。一般的には、陸地をベースにしたキャラバンの旅に興味があります。\n一般的には、荒れた土地を横断するキャラバンの旅に興味があります。",
      "title": "シルクロードは、かなり険しい場所を通っていました。舗装された道路がなかった頃、キャラバンはどのようにして山や砂漠などを突き進んでいたのでしょうか。また、どのくらいの速度で進んでいたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：也许要澄清一下--我是一时兴起才选的丝绸之路，尽管正如\n/u/EnclavedMicrostate指出，这并不是最好的例子，因为它并不是真的\n一件事。总的来说，我对任何基于陆地的商队旅行感兴趣\n穿越崎岖的地形。",
      "title": "丝绸之路穿过了一些相当崎岖的地形。在铺设道路之前，商队是如何穿过山区、沙漠等地的？他们一路上能有什么样的速度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：也許要澄清一下--我是一時興起才選的絲綢之路，儘管正如\n/u/EnclavedMicrostate指出，這並不是最好的例子，因爲它並不是真的\n一件事。總的來說，我對任何基於陸地的商隊旅行感興趣\n穿越崎嶇的地形。",
      "title": "絲綢之路穿過了一些相當崎嶇的地形。在鋪設道路之前，商隊是如何穿過山區、沙漠等地的？他們一路上能有什麼樣的速度？"
    }
  ]
}