{
  "author": "Bellweirboy",
  "the_new_excerpt": "No coiner here. Happy to stay poor. Or change my mind.\n\nAre you folk aware of the absurdities creeping into crypto? Where do you draw\nthe line? I mean look at Doge: if that can ‘moon’ to >20 cents and stay there as\nlong as it has, what does that say about all the intellectual and…",
  "original_created_utc": 1619683452,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここではコインを使わない。貧乏なままでいい。または、考えを変える。\n\nあなた方は暗号に忍び寄る不条理に気づいていますか？どこで線を引くのですか？\n線を引くのか？つまり、Dogeを見てみましょう：もしあれが20セント以上に「ムーン」して、今までのようにそこに留まることができるなら、すべての知的で...\nそれが20セントを超えて、ずっとそこにいられるとしたら、それはすべての知的で...",
      "title": "コインやトークン、プロジェクトに価値があるかどうかは、どうやってわかるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里没有投币者。很高兴能保持贫穷。或者改变我的想法。\n\n你们这些人知道加密货币中的荒谬现象吗？你在哪里划\n界线？我的意思是看看Doge：如果它可以 \"月球 \"到>20美分，并且像现在这样保持在那里。\n始终如一，这说明所有的智力和......。",
      "title": "你怎么知道一个硬币、代币或项目是有价值的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏沒有投幣者。很高興能保持貧窮。或者改變我的想法。\n\n你們這些人知道加密貨幣中的荒謬現象嗎？你在哪裏劃\n界線？我的意思是看看Doge：如果它可以 \"月球 \"到>20美分，並且像現在這樣保持在那裏。\n始終如一，這說明所有的智力和......。",
      "title": "你怎麼知道一個硬幣、代幣或項目是有價值的？"
    }
  ],
  "title": "How do you know a Coin, Token or project is worth anything?",
  "created_utc": 1619700076,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>No coiner here. Happy to stay poor. Or change my mind.   </p>\n\n<p>Are you folk aware of the absurdities creeping into crypto? Where do you draw the line? I mean look at Doge: if that can ‘moon’ to &gt;20 cents and stay there as long as it has, what does that say about all the intellectual and sophisticated projects? What is the point?   </p>\n\n<p>What criteria are YOU going to use to say ‘I am investing wisely?’   </p>\n\n<p>Saw the AMA on VeChain or VeToken or VeCoin or Ve Thor or whatever it’s called. I’m sure the founders and devs are earnest and mean well. Yet to a critical outsider, I’m sorry, it’s just Hopium. Gobbledegook. IoT, 5G, ‘DeFi. Etc. Only one practical application appealed to me: issuing COVID vaccination ‘passports’ in Malta. Even then, why does this need a blockchain? It’s over engineering, or what am I missing.   </p>\n\n<p>You folk here need to avoid the echo chamber effect. You need to be able to absorb challenge.   </p>\n\n<p>Right now, crypto seems to me to be getting crazier and more unhinged every day. Yes, there is limited adoption of Bitcoin in particular, but there is an exponential explosion of sheer garbage.   </p>\n\n<p>Explain to me how this is not worrying.</p>\n</div><!-- SC_ON -->",
  "score": 892,
  "permalink": "/r/CryptoCurrency/comments/n0znf8/how_do_you_know_a_coin_token_or_project_is_worth/",
  "subreddit": "CryptoCurrency",
  "id": "n0znf8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380959895
}