{
  "author": "KirbyAteMyCoins",
  "original_created_utc": 1658219742,
  "title": "If you use TikTok and crypto I recommend you change all your wallets immediately",
  "created_utc": 1658236135,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After todays FCC announcement of TikTok and their recommendations of banning it from stores, a lot of information regarding what they collect from users came to surface.&lt;/p&gt;\n\n&lt;p&gt;It’s even worse than I imagined. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TikTok is said to collect “everything”, from search and browsing histories; keystroke patterns; biometric identifiers—including faceprints, something that might be used in “unrelated facial recognition technology”, and voiceprints—location data; draft messages; metadata; and data stored on the clipboard, including text, images, and videos.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Im way too old and unattractive to be fiddling with TikTok but if any of you is using it, I highly recommend that you move your assets to new wallet(s) as the possibility of TikTok acquiring your seed-phrase and a ton of other personal data is very high. &lt;/p&gt;\n\n&lt;p&gt;Be safe guys and girls.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 751,
  "permalink": "/r/CryptoCurrency/comments/w2nopr/if_you_use_tiktok_and_crypto_i_recommend_you/",
  "subreddit": "CryptoCurrency",
  "id": "w2nopr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After todays FCC announcement of TikTok and their recommendations of banning it\nfrom stores, a lot of information regarding what they collect from users came to\nsurface.\n\nIt’s even worse than I imagined.\n\nTikTok is said to collect “everything”, from search and browsing histories;\nkeystroke…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日のFCCによるTikTokの発表と禁止勧告の後に\nTikTokがユーザーから収集する情報に関して、多くの情報が公開されました。\n表面化しました。\n\nそれは私が想像していたよりもさらにひどいものでした。\n\nTikTokは、検索や閲覧の履歴から、「すべて」を収集すると言われています。\nキーストローク...",
      "title": "TikTokと暗号を使用している場合、すぐにすべてのウォレットを変更することをお勧めします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在今天联邦通信委员会宣布TikTok和他们的建议禁止它之后\n的建议后，很多关于他们从用户那里收集的信息都出现了。\n浮出水面。\n\n这比我想象的还要糟糕。\n\n据说TikTok收集 \"一切\"，从搜索和浏览记录。\n敲击键盘...",
      "title": "如果你使用TikTok和加密货币，我建议你立即更换你的所有钱包"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在今天聯邦通信委員會宣佈TikTok和他們的建議禁止它之後\n的建議後，很多關於他們從用戶那裏收集的信息都出現了。\n浮出水面。\n\n這比我想象的還要糟糕。\n\n據說TikTok收集 \"一切\"，從搜索和瀏覽記錄。\n敲擊鍵盤...",
      "title": "如果你使用TikTok和加密貨幣，我建議你立即更換你的所有錢包"
    }
  ]
}