{
  "author": "nlvogel",
  "original_created_utc": 1638116014,
  "title": "I’m feeling bullish on CRO. Someone talk me out of it.",
  "created_utc": 1638124738,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not sure if it’s just the marketing, but CRO seems to be a great opportunity and is really paving the way for mass, retail adoption. I know coinbase is doing similar with their card, but CDC has the potential to really reach the masses if they keep the marketing up. </p>\n\n<p>This might be pie-in-the-sky thinking, but I also believe they’re positioning themselves as a governmental influence when it comes to crypto policy. Only because I think lawmakers will buy in to the popular option and they’ll politic it to make it beneficial for them in.</p>\n\n<p>I just need someone to tell me the tech sucks and it’s not scalable or something.</p>\n</div><!-- SC_ON -->",
  "score": 427,
  "permalink": "/r/CryptoCurrency/comments/r47rsc/im_feeling_bullish_on_cro_someone_talk_me_out_of/",
  "subreddit": "CryptoCurrency",
  "id": "r47rsc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not sure if it’s just the marketing, but CRO seems to be a great opportunity\nand is really paving the way for mass, retail adoption. I know coinbase is doing\nsimilar with their card, but CDC has the potential to really reach the masses if\nthey keep the marketing up.\n\nThis might be pie-in-the-sky…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マーケティングのおかげかどうかはわかりませんが、CROは大きなチャンスだと思います。\n大規模小売店での採用への道を開いています。コインベースが同様のことをしているのを知っています。\nしかし、CDCはマーケティングを続けていけば、本当に多くの人に届く可能性があります。\nマーケティングを続けていけば、CDCは本当に多くの人に届く可能性があります。\n\nこれは絵空事かもしれませんが...。",
      "title": "CROには強気の気持ちでいる。誰か私を説得してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不确定这是否只是营销的问题，但CRO似乎是一个巨大的机会\n而且确实在为大规模的零售采用铺平道路。我知道coinbase正在做\n我知道coinbase也在做类似的事情，但CDC有潜力真正达到大众化，如果他们保持营销。\n他们保持营销。\n\n这可能是天方夜谭......",
      "title": "我觉得看涨CRO。谁来劝劝我。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不確定這是否只是營銷的問題，但CRO似乎是一個巨大的機會\n而且確實在爲大規模的零售採用鋪平道路。我知道coinbase正在做\n我知道coinbase也在做類似的事情，但CDC有潛力真正達到大衆化，如果他們保持營銷。\n他們保持營銷。\n\n這可能是天方夜譚......",
      "title": "我覺得看漲CRO。誰來勸勸我。"
    }
  ]
}