{
  "author": "LonelyInTheNewLand",
  "original_created_utc": 1624633787,
  "title": "I put my savings into Bitcoin",
  "created_utc": 1624663998,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After a lot thinking, reading, and researching, last week I completed putting my savings into Bitcoin. I did it over a span multiple weeks (following the dollar-cost averaging strategy). I haven&#39;t told people that they know me about this, and not planning to (for security reasons). Here is my thinking about why I did it and things that I considered:</p>\n\n<ul>\n<li>I&#39;m debt free and have no responsibilities (not married, no kids, etc.), so for me the time is right.</li>\n<li>I came across crypto first back in 2017, I was interested in the technical side more than the finical side. Bought a little back then, never sold it. Seen it dropped more than 50% in the short term and gained more than 200% in the long term. In the long term, it increases.</li>\n<li>I&#39;m in it for the long term (minimum: 10 years, maximum: forever).</li>\n<li>There will be never more than 21 million Bitcoin. That&#39;s scarcity, scarcity has value.</li>\n<li>Bitcoin adoption is increasing rapidly.</li>\n<li>Everything in life has a risk factor, for me holding a fiat currency in a bank that is losing value and purchasing power due to inflation is riskier than buying Bitcoin.</li>\n<li>I did my homework about crypto and security back in 2017 (private keys, cold storage, etc.), so jumping in is technically easy.</li>\n<li>I kept 1 year worth of expenses in fiat.</li>\n<li>I have a full time job so even if the price goes to zero I can start over.</li>\n<li>I&#39;m a skilled software engineer so even if I lose my job I can find another one or do freelancing.</li>\n</ul>\n\n<p>After all, maybe I will be wrong, and yes, maybe I will lose it all, but I&#39;m willing to take my chances. The important thing for me is that I feel good about my decision.</p>\n\n<p><strong>Disclaimer:</strong> this is not a finial advice by any mean, I&#39;m just sharing my experience. Everyone&#39;s life and circumstances are different, and never put what you cannot afford to lose.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/Bitcoin/comments/o7plnh/i_put_my_savings_into_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "o7plnh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After a lot thinking, reading, and researching, last week I completed putting my\nsavings into Bitcoin. I did it over a span multiple weeks (following the\ndollar-cost averaging strategy). I haven't told people that they know me about\nthis, and not planning to (for security reasons). Here is my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いろいろ考えたり、読んだり、調べたりした結果、先週、私は自分の貯金を\n貯金をビットコインに変えました。私は複数の週に渡ってそれを行いました。\nドルコスト平均法）。) このことは知り合いには話していません。\nまた、その予定もありません（セキュリティ上の理由から）。これが私の...",
      "title": "貯金をビットコインにしました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经过大量的思考、阅读和研究，上周我完成了将我的\n储蓄变成比特币。我在多个星期内完成了这项工作（按照\n美元成本平均策略）。) 我还没有告诉认识我的人这件事。\n这事，也不打算说（出于安全原因）。这是我的...",
      "title": "我把我的储蓄存入比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經過大量的思考、閱讀和研究，上週我完成了將我的\n儲蓄變成比特幣。我在多個星期內完成了這項工作（按照\n美元成本平均策略）。) 我還沒有告訴認識我的人這件事。\n這事，也不打算說（出於安全原因）。這是我的...",
      "title": "我把我的儲蓄存入比特幣"
    }
  ]
}