{
  "author": "QwertytheCoolOne",
  "original_created_utc": 1635498201,
  "title": "Is giving someone a kiss on the top of their head when in a hug a sweet thing to do?",
  "created_utc": 1635526922,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So me and this girl are &quot;almost dating&quot; but we haven&#39;t kissed yet but we hug all the time. Shes shorter than me and when we hug her head reaches a perfect height where I could easily kiss the top of her head. Would this be a good thing to do? Is that a weird thing to kiss the top of the head? It wouldn&#39;t be her forehead, the actual top. I care about her and want to eventually do an actually kiss but am nervous, maybe this would help me build up to it.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/qi8l0v/is_giving_someone_a_kiss_on_the_top_of_their_head/",
  "subreddit": "TooAfraidToAsk",
  "id": "qi8l0v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So me and this girl are \"almost dating\" but we haven't kissed yet but we hug all\nthe time. Shes shorter than me and when we hug her head reaches a perfect height\nwhere I could easily kiss the top of her head. Would this be a good thing to do?\nIs that a weird thing to kiss the top of the head? It…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "僕と彼女は「ほぼ付き合っている」状態ですが、まだキスはしていませんが、いつもハグをしています。\nしている。彼女は僕より背が低いのですが、ハグをすると彼女の頭がちょうどいい高さになります。\n彼女の頭のてっぺんに簡単にキスできるんだ。これは良いことなのでしょうか？\n頭のてっぺんにキスをするのは変なことですか？それは...",
      "title": "ハグしているときに頭にキスをするのは、甘いことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我和这个女孩 \"几乎在约会\"，但我们还没有接吻，但我们一直拥抱着\n但我们一直在拥抱。她比我矮，当我们拥抱的时候，她的头达到一个完美的高度\n我可以轻易地亲吻她的头顶。这是件好事吗？\n亲吻头顶是一件奇怪的事情吗？它...",
      "title": "拥抱时亲吻对方的头顶是一件甜蜜的事情吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我和這個女孩 \"幾乎在約會\"，但我們還沒有接吻，但我們一直擁抱着\n但我們一直在擁抱。她比我矮，當我們擁抱的時候，她的頭達到一個完美的高度\n我可以輕易地親吻她的頭頂。這是件好事嗎？\n親吻頭頂是一件奇怪的事情嗎？它...",
      "title": "擁抱時親吻對方的頭頂是一件甜蜜的事情嗎？"
    }
  ]
}