{
  "author": "sgtslaughterTV",
  "the_new_excerpt": "If you're new here, consider reading our expanded rules\n[https://www.reddit.com/r/Cryptocurrency/wiki/expanded_rules] so you don't get\nbanned and get excluded from moons distribution.\n\nPlease remember tribalism and gatekeeping is frowned upon in this sub.\n\nI made this…",
  "original_created_utc": 1621564250,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初めてご利用になる方は、以下のルールをご参照ください。\n[https://www.reddit.com/r/Cryptocurrency/wiki/expanded_rules] を読んでください。\n禁止されたり、月の配布から除外されたりしないように。\n\n部族主義やゲートキーピングは、このサブでは嫌われていることを覚えておいてください。\n\n私はこれを...",
      "title": "/r/cryptocurrencyは、おそらく1週間以内に/r/bitcoinを追い越すでしょう。特にサブに参加している新しい人たちのために、ファンダメンタルズを少し見直してみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是新来的，请考虑阅读我们的扩展规则\n[https://www.reddit.com/r/Cryptocurrency/wiki/expanded_rules] 这样你就不会被\n被禁止并被排除在月球分布之外。\n\n请记住，在这个分区里，部落主义和守门人是不受欢迎的。\n\n我做了这个...",
      "title": "/r/cryptocurrency可能会在一周内超过/r/bitcoin。让我们花点时间来回顾一下基本面，特别是对于正在加入该子的新人们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是新來的，請考慮閱讀我們的擴展規則\n[https://www.reddit.com/r/Cryptocurrency/wiki/expanded_rules] 這樣你就不會被\n被禁止並被排除在月球分佈之外。\n\n請記住，在這個分區裏，部落主義和守門人是不受歡迎的。\n\n我做了這個...",
      "title": "/r/cryptocurrency可能會在一週內超過/r/bitcoin。讓我們花點時間來回顧一下基本面，特別是對於正在加入該子的新人們。"
    }
  ],
  "title": "/r/cryptocurrency will likely outgrow /r/bitcoin within a week. Let's take a moment to review fundamentals, especially for the new people that are joining the sub.",
  "created_utc": 1621604403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;re new here, consider reading our <a href=\"https://www.reddit.com/r/Cryptocurrency/wiki/expanded_rules\">expanded rules</a> so you don&#39;t get banned and get excluded from moons distribution.                 </p>\n\n<p>Please remember tribalism and gatekeeping is frowned upon in this sub.               </p>\n\n<p>I made <a href=\"https://np.reddit.com/r/Bitcoin/comments/ngowbn/as_a_moderator_for_rcryptocurrency_what_i_see_is/\">this thread</a> yesterday in the bitcoin sub because I am a bit disappointed with the way this sub has been conducting itself lately.                 </p>\n\n<p>I am a whatever-works-a-malist. I own BTC, Ethereum, and I earn money for part time work in some alts, and I am thinking of buying a few alts that are in the top 20 on coingecko.                </p>\n\n<p>BTC Maximalists will argue, &quot;Altcoins were created to enrich their creators and their friends. Nothing more.&quot; because Satoshi never sold any of his original 1 million or so bitcoins. I don&#39;t fully agree with this statement, but I feel like that is 90% of projects out there right now.                      </p>\n\n<p>There is cause for concern with PoS as a consensus mechanism, at the very least in the case of Eth I think there is. Imagine you run a node that has 1024 ETH. that is presently almost 3 million USD (assuming 1024 ETH x 2800 USD). Imagine if a nefarious actor or a burglar were capable of breaking in to your home and getting you to unstake that Eth and send it to a particular wallet that he owned. <strong>small things like this are my concern, especially if the owner of a PoS node is a public figure.</strong>               </p>\n\n<p>And finally, for the past 12 years, bitcoin has always been the number 1 coin by marketcap. That means after 2018 came and went and NEO crashed from 200 USD apiece to 20 USD (even lower a long time afterwards) apiece or ETH went from over 1400 USD apiece to 85 USD apiece EOY 2018, bitcoin was still at the number 1 spot by marketcap.                </p>\n\n<p><strong>I don&#39;t want to say your coin won&#39;t surpass Bitcoin, but if it hasn&#39;t happened yet, it is not likely to in the near future (10 years or so). Please ask yourself the following questions:</strong>                  </p>\n\n<p>Which coin is the &quot;next bitcoin?&quot; or in other words, the one coin that will replace bitcoin? Why is it that coin and not bitcoin? And how do you convince all of the banks and the traditional financial system to switch to that coin and not use bitcoin? Why would they switch to that coin and not use bitcoin? Why not use both? Is there a reason not to use both? This is why I strongly believe there will be no &quot;next bitcoin&quot; or a coin that replaces bitcoin.                </p>\n\n<p>Just some food for thought.                 </p>\n\n<p><strong>EDIT: It completely slipped my mind that there are some people who are here to make money from day trading and that is perfectly fine, in fact that is your prerogative. I, personally, don&#39;t do daytrading</strong>                </p>\n\n<p><strong>EDIT 2: To reinforce the idea of surpassing a particular market cap we need to think of metcalfe&#39;s law, and think &quot;how could such \na massive number of connections suddenly be created with a new coin?&quot; and to be honest I think there is only one organization or enterprise that could make it happen: Google.</strong></p>\n</div><!-- SC_ON -->",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/nhhyqs/rcryptocurrency_will_likely_outgrow_rbitcoin/",
  "subreddit": "CryptoCurrency",
  "id": "nhhyqs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381667
}