{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "I wanted to thank everyone for all their help over the last couple days. Sorry if this is considered a repetitive post but I wanted to keep asking for guidance to make sure I'm doing everything by the book.  FYI - I currently have a 401k with Fidelity with \\~150k in it.\n\n1. Today, I moved my \\~170k IRA from Edward Jones to a newly created Fidelity IRA. All the funds I'm currently in are also available at Fidelity so I'm good there. That is in flight.\n2. I liquidated 4 of the 6 mutual funds that are only available at Edward Jones and wouldn't transfer in-kind.\n3. Tomorrow I will liquidate most of the remaining 2 funds, leaving close to the bare minimum to keep my account open. I am keeping it open solely for their research on individual stocks that I've done well with.\n4. Once all these trades settle I will move all my individual stocks (\\~200k) over to my Fidelity brokerage. This will leave only a tiny sliver of mutual funds with Edward Jones.\n\nI will then figure out the proper allocation of low-fee broad exposure Index or ETF funds (domestic vs international vs fixed income). I will also use these allocations in my new IRA.  This should get me in a simple 2/3 fund model with low fees, consistent across taxable vs tax advantaged accounts. Kindly tell me if you think my strategy is sound or I'm being an idiot. I was told to check target year funds and I am going to go with a 90/10 equity to bond split. I am not sure about intentional vs domestic at this point as I'm kind at square one after having to unwind this Edward Jones garbage. Thank you for your time and for reading.\n\nEDIT: I have a question. A friend of mine always said \"go SP500 index funds and let it ride\" -- not sure if that's necessarily in alignment with bogleheads? I am assuming because it's isolating you down to just the top 500 US based companies as opposed to total market and international exposure? I guess this is an area of confusion for me. Not asking for financial advice, more like some ELI5 understanding lol.\n\nEDIT2: When I informed my EJ advisor about moving \\~400k out of my account into Fidelity she started giving me the cold shoulder. I explained I want no fee buying/selling of my individual stocks and that I was consolidating into simple 2/3 fund, low-fee, no load broad exposure ETF/Index fund portfolio to minimize drag. She then told me my account was too small for her time and I'd be instead using the main office, lol. I'm sure she knew I was \"right.\" A shame I didn't come to this realization a few months ago.",
  "author_fullname": "t2_294ic05q",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "My Edward Jones exit plan is nearly completed.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_t96jwp",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.95,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 17,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 17,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1646708510,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1646707424,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I wanted to thank everyone for all their help over the last couple days. Sorry if this is considered a repetitive post but I wanted to keep asking for guidance to make sure I&amp;#39;m doing everything by the book.  FYI - I currently have a 401k with Fidelity with ~150k in it.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Today, I moved my ~170k IRA from Edward Jones to a newly created Fidelity IRA. All the funds I&amp;#39;m currently in are also available at Fidelity so I&amp;#39;m good there. That is in flight.&lt;/li&gt;\n&lt;li&gt;I liquidated 4 of the 6 mutual funds that are only available at Edward Jones and wouldn&amp;#39;t transfer in-kind.&lt;/li&gt;\n&lt;li&gt;Tomorrow I will liquidate most of the remaining 2 funds, leaving close to the bare minimum to keep my account open. I am keeping it open solely for their research on individual stocks that I&amp;#39;ve done well with.&lt;/li&gt;\n&lt;li&gt;Once all these trades settle I will move all my individual stocks (~200k) over to my Fidelity brokerage. This will leave only a tiny sliver of mutual funds with Edward Jones.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I will then figure out the proper allocation of low-fee broad exposure Index or ETF funds (domestic vs international vs fixed income). I will also use these allocations in my new IRA.  This should get me in a simple 2/3 fund model with low fees, consistent across taxable vs tax advantaged accounts. Kindly tell me if you think my strategy is sound or I&amp;#39;m being an idiot. I was told to check target year funds and I am going to go with a 90/10 equity to bond split. I am not sure about intentional vs domestic at this point as I&amp;#39;m kind at square one after having to unwind this Edward Jones garbage. Thank you for your time and for reading.&lt;/p&gt;\n\n&lt;p&gt;EDIT: I have a question. A friend of mine always said &amp;quot;go SP500 index funds and let it ride&amp;quot; -- not sure if that&amp;#39;s necessarily in alignment with bogleheads? I am assuming because it&amp;#39;s isolating you down to just the top 500 US based companies as opposed to total market and international exposure? I guess this is an area of confusion for me. Not asking for financial advice, more like some ELI5 understanding lol.&lt;/p&gt;\n\n&lt;p&gt;EDIT2: When I informed my EJ advisor about moving ~400k out of my account into Fidelity she started giving me the cold shoulder. I explained I want no fee buying/selling of my individual stocks and that I was consolidating into simple 2/3 fund, low-fee, no load broad exposure ETF/Index fund portfolio to minimize drag. She then told me my account was too small for her time and I&amp;#39;d be instead using the main office, lol. I&amp;#39;m sure she knew I was &amp;quot;right.&amp;quot; A shame I didn&amp;#39;t come to this realization a few months ago.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "t96jwp",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "nexusmoonshot",
  "discussion_type": null,
  "num_comments": 6,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/t96jwp/my_edward_jones_exit_plan_is_nearly_completed/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/t96jwp/my_edward_jones_exit_plan_is_nearly_completed/",
  "subreddit_subscribers": 144112,
  "created_utc": 1646725797,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1646707424,
  "the_new_excerpt": "I wanted to thank everyone for all their help over the last couple days. Sorry\nif this is considered a repetitive post but I wanted to keep asking for guidance\nto make sure I'm doing everything by the book. FYI - I currently have a 401k\nwith Fidelity with ~150k in it.\n\n 1. Today, I moved my ~170k…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、皆さんにお世話になったので、お礼を申し上げたいのです。申し訳ありません。\n繰り返しの投稿と思われるかもしれませんが、ご指導を仰ぎたかったのです。\nというのも、私はすべて本に従って行動していることを確認するためです。参考までに - 私は現在、401k\nFidelityに15万円ほど預けています。\n\n 1. 今日、17万円を移動させました...",
      "title": "私のエドワード・ジョーンズ撤退計画は、ほぼ完成しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想感谢大家在过去几天里的所有帮助。抱歉\n如果这被认为是一个重复的帖子，但我想继续寻求指导\n以确保我是按部就班地做事。顺便说一下，我目前有一个401k\n在富达公司，里面有大约15万。\n\n 1. 今天，我把我的~17万...",
      "title": "我的爱德华-琼斯退出计划已接近完成。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想感謝大家在過去幾天裏的所有幫助。抱歉\n如果這被認爲是一個重複的帖子，但我想繼續尋求指導\n以確保我是按部就班地做事。順便說一下，我目前有一個401k\n在富達公司，裏面有大約15萬。\n\n 1. 今天，我把我的~17萬...",
      "title": "我的愛德華-瓊斯退出計劃已接近完成。"
    }
  ]
}