{
  "author": "Iiau_",
  "the_new_excerpt": "When you focus about making money, you lose money.\n\nWhen you focus about losing money, you lose money even faster.\n\nAt the moment where you least expected, when you don't care about money, you\nwake up and login to an exchange and find yourself a millionaire. Then you get\ngreedy and decide to wait a…",
  "original_created_utc": 1609819517,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当你专注于赚钱时，你就会赔钱。\n\n当你专注于赔钱时，你赔钱的速度会更快。\n\n在你最意想不到的时候，当你不在乎钱的时候，你\n醒来后登录交易所，发现自己是百万富翁。然后你就会得到\n贪婪地决定等待一次…",
      "title": "不要贪婪；来自经验丰富的密码交易员的建议"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你專注於賺錢時，你就會賠錢。\n\n當你專注於賠錢時，你賠錢的速度會更快。\n\n在你最意想不到的時候，當你不在乎錢的時候，你\n醒來後登錄交易所，發現自己是百萬富翁。然後你就會得到\n貪婪地決定等待一次…",
      "title": "不要貪婪；來自經驗豐富的密碼交易員的建議"
    }
  ],
  "title": "Don't be greedy; Advice from an experienced crypto trader",
  "created_utc": 1609870338,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When you focus about making money, you lose money.</p>\n\n<p>When you focus about losing money, you lose money even faster.</p>\n\n<p>At the moment where you least expected, when you don&#39;t care about money, you wake up and login to an exchange and find yourself a millionaire. Then you get greedy and decide to wait a little longer to make a quick buck, then it flat-out crashes the next day and you lose money.</p>\n\n<p>Don&#39;t let greed blind you. Don&#39;t say &quot;I want 1,000$ more so I&#39;ll wait a few more days&quot; after reaching your sell goal. Cash out.</p>\n\n<p>People lose money from bad investment. It&#39;s human nature. If you lost 100$ scratching a lottery ticket, you wouldn&#39;t buy a new one to &quot;break even&quot; from that. But in crypto, this sentiment hasn&#39;t really spread.</p>\n\n<p>I&#39;ve seen people go into deep debts trying to break even from their losses, hoping they can moonshot.</p>\n\n<p>Don&#39;t focus straight on the money. Focus on the goals that will make you money.</p>\n\n<p>Welcome to crypto. If you&#39;re the person who isn&#39;t willing to lose money, this probably isn&#39;t the place for you.</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/kqq4b8/dont_be_greedy_advice_from_an_experienced_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "kqq4b8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100746077
}