{
  "author": "Suspicious_Tension82",
  "the_new_excerpt": "Nice example of a contrarian research note from David Rosenberg here\n[https://site.rosenbergresearch.com/wp-content/uploads/2021/03/Free-Special…",
  "original_created_utc": 1615555799,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大卫-罗森博格的对立面研究笔记的一个很好的例子。\n[https://site.rosenbergresearch.com/wp-content/uploads/2021/03/Free-Special...",
      "title": "大卫-罗森伯格说，不会有轰轰烈烈的20年代，几乎没有通货膨胀。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大衛-羅森博格的對立面研究筆記的一個很好的例子。\n[https://site.rosenbergresearch.com/wp-content/uploads/2021/03/Free-Special...",
      "title": "大衛-羅森伯格說，不會有轟轟烈烈的20年代，幾乎沒有通貨膨脹。"
    }
  ],
  "title": "David Rosenberg says there will be no Roaring 20s, little inflation",
  "created_utc": 1615575573,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nice example of a contrarian research note from David Rosenberg <a href=\"https://site.rosenbergresearch.com/wp-content/uploads/2021/03/Free-Special-Report_Fade_the_Front_Cover_2021_03_08_Marketing_Upgrade.pdf?utm_source=Special%20Free%20Report&amp;utm_medium=Email&amp;utm_campaign=2021_03_08_Fade%20the%20Front%20Cover&amp;utm_term=Email%20link&amp;utm_content=Upgrade\">here</a>. </p>\n\n<p><strong>Excerpt:</strong> The economy did collapse back then, but the government did not blow its brains out on fiscal largesse. So, we went into the 1920s with tremendous pent-up demand once the crisis ended, and balance sheets were in far greater shape. Government debt-to-GDP was 10 per cent — not over 100%. And that better public sector balance sheet allowed the federal government to CUT taxes by the mid-1920s — top marginal rates for corporations were initially raised from 10 per cent in 1920 to 13.5 per cent by 1926 but cut to 11 per cent by the end of the decade; for individuals, the rate went from 58 per cent after the war to 24 per cent by 1929. Does anyone think taxes are going to be coming down in the US any time soon?</p>\n\n<p><strong>Tl;dr:</strong> There are major differences between the end of this pandemic and the end of the Spanish flu, notably business productivity, capital allocation, tax rates, starting valuations of the stock market, demographics and especially government debt levels. We are unlikely to see a repeat of the roaring 20s this decade. </p>\n\n<p><strong>Additional lesson:</strong> When multiple mainstream business publications are pushing the same narrative on their covers it often pays to go the other way.</p>\n</div><!-- SC_ON -->",
  "score": 1288,
  "permalink": "/r/investing/comments/m3hkd2/david_rosenberg_says_there_will_be_no_roaring_20s/",
  "subreddit": "investing",
  "id": "m3hkd2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379956
}