{
  "author": "schravenralph",
  "the_new_excerpt": "Anyone who spent some time studying the basics of investing knows about\ndollar-cost averaging. If anyone needs a refresher, here's a short analysis\nbetween lump-sum versus averaging by Vanguard:\nhttps://investor.vanguard.com/investing/online-trading/invest-lump-sum.\n\nVanguard makes a compelling case…",
  "original_created_utc": 1615770312,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "任何一个花了一些时间研究投资基础知识的人都知道，关于\n美元成本平均法。如果有人需要复习，这里有一个简短的分析。\n一次性付款与万家彩票的平均数之间。\nhttps://investor.vanguard.com/investing/online-trading/invest-lump-sum.\n\nVanguard提出了一个令人信服的理由...。",
      "title": "基于股票的美元成本平均法。有条不紊地买入跌停板并获取利润"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何一個花了一些時間研究投資基礎知識的人都知道，關於\n美元成本平均法。如果有人需要複習，這裏有一個簡短的分析。\n一次性付款與萬家彩票的平均數之間。\nhttps://investor.vanguard.com/investing/online-trading/invest-lump-sum.\n\nVanguard提出了一個令人信服的理由...。",
      "title": "基於股票的美元成本平均法。有條不紊地買入跌停板並獲取利潤"
    }
  ],
  "title": "Equity-Based Dollar-Cost Averaging: Methodically Buying Dips and Taking Profits",
  "created_utc": 1615780494,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anyone who spent some time studying the basics of investing knows about dollar-cost averaging. If anyone needs a refresher, here&#39;s a short analysis between lump-sum versus averaging by Vanguard: <a href=\"https://investor.vanguard.com/investing/online-trading/invest-lump-sum\">https://investor.vanguard.com/investing/online-trading/invest-lump-sum</a>.</p>\n\n<p>Vanguard makes a compelling case about market timing. Assuming a retail trader can&#39;t time the market (even if you don&#39;t support EMH, it still is obvious that this is pretty darn difficult), you may believe it&#39;s simply for those who are scared of realizing losses, which is exactly the point they make.</p>\n\n<p>I would like to propose a slight tweak to the concept: instead of spreading the payments out over time, spread them out over price. You start with an initial exposure, and scale up when the market takes a hit, while scaling down to take profits during bull runs.</p>\n\n<p>Let&#39;s demonstrate why this works out. Take a random price point the SPY has reached in the past: 250 USD. How many times did it reach this point? Five times. Take another one, 270 USD: <strong>ten times.</strong> How about 290 USD? <strong>Fourteen times.</strong> But maybe that&#39;s just a recent trend. Things might&#39;ve been different back when it was around 100 USD, right? Nope, <strong>ten times it reached 100 USD.</strong></p>\n\n<p>I haven&#39;t conducted an elaborate backtest, but it&#39;s clear the amount of setbacks to any particular price level is rather large, just as it&#39;s clear the whole thing is positively drifting in general.</p>\n\n<p>Given that we know this, instead of investing 100% at once, consider what would happen if you invested 60% at 100 USD and invested an extra 20% for every 10% drawdown, and scaled down by 5% for every 10% increase? In other words, we scale up by double the drawdown, and realize half of our profits.</p>\n\n<p>Starting in May &#39;68, let&#39;s say we started investing with 60 shares for a 6,000 USD position with 4K left in cash. Two months later we hit a low of 88 USD per share, meaning we now own 80 shares at roughly 7,000 USD with a little over 2K in cash. We dip to below 72 in May &#39;70 resulting in 100 shares with 800 USD remaining in cash. We hit four profit targets on the way up to 105 USD and end up with 80 shares and 2.6K in cash for a total of 11K USD. That&#39;s already doubling our profits while significantly reducing our exposure at any given time!</p>\n\n<p>We could continue to test and demonstrate this, but the point is clear; we all know this will generate less returns in a very strong bull market, and create very strong opportunities in bear markets. We profit when bull runs are facing continous corrections, when the market goes sideways with some swings in between, and we are extremely well-protected against crashes, able to purchase lows and hold whole multiples of shares compared to when we&#39;d just lump-sum.</p>\n\n<p>It&#39;s no coincidence the greats such as Warren Buffet hold so much of their available capital in cash and play the waiting game on crashing markets. Ask yourself: when the markets crashed by 50+% over the course of their history, did it ever correspond with a similar collapse of the global economy? Not really, jobs were lost, consumer spending took a hit, some companies went under, but at a global scale we never took a hit even in the same universe as the rate at which the market tanks during those times.</p>\n\n<p>So what&#39;s your take on this? Is this even considered &quot;dollar-cost averaging&quot;? Are there superior alternatives? Or would you consider / are you already applying this in your actual investment strategies? Would very much like to further my knowledge on this topic.</p>\n</div><!-- SC_ON -->",
  "score": 190,
  "permalink": "/r/investing/comments/m592rq/equitybased_dollarcost_averaging_methodically/",
  "subreddit": "investing",
  "id": "m592rq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379963
}