{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "One of the most overlooked stocks on the American stock market is Dropbox. I personally love it. It's got a lot of potential and the recent drop in price opens up an excellent opportunity for new investors.\n\n# Dropbox at a glance\n\nSo, why should we care about Dropbox? Simple. It's a well-performing business that keeps beating analyst expectations. In fact, Dropbox does not have a single earnings or revenue expectations miss since they floated on the stock market! Yes, Dropbox's growth may be slowing down a tiny, tiny bit, but it is still double digits. This growth is likely led by the overwhelming switch since last year to working from home. A lot of people are also starting their own small businesses and they need solutions like Dropbox to help them organise their files, documents and so on. So, the question is, what does Dropbox actually do? Their flagship product, Dropbox, is a cloud storage solution similar to Google Drive, One Drive, iCloud and so on. Essentially, you can store files on Dropbox and synchronise and share them across PC, mobile, tablets and so on. However, Dropbox is actively striving to become a workspace platform or a smart workplace. Over the last three years they have also acquired HelloSign and DocSend that provide even more capabilities to its users. HelloSign provides the ability to send, receive and manage legally binding electronic signatures, whereas DocSend allows you to securely share documents with other people or businesses, track their usage, provide NDAs, meaning Non-Disclosure Agreements, eSignatures, watermarking and so on. Overall, these three services provide the backbone of the Dropbox product offering. However, Dropbox continues to look for new ways to improve and expand and have recently introduced three new features: Capture, Replay and Shop. I am really interested in the Shop feature, I think that has a lot of potential, but it's still too early to tell. If it goes well though, it could become a very successful marketplace for digital content.\n\n# Earnings, revenue and key metrics\n\nThis all sounds really good, but let's look at the numbers. Always look at the numbers before you invest ***especially*** these days when there are so many companies that talk a lot, but have nothing to show for it. Like a lot of modern tech companies, the Dropbox business model revolves around subscriptions and that means it is relatively predictable. As long as users are satisfied with the product, they will continue using and paying for it. In Q3 of 2021, Dropbox had over 700 million registered users with 16.49 million paying users up from 15.25 million last year and those include both individuals and business subscriptions. Dropbox's business model focuses on converting existing users into paying users and we can see it's obviously working from this increase of 8.1% in the number of paying users per year. What Dropbox also does is upsell to existing users and nudge them to upgrade to premium plans, purchase additional licences and so on. As they say though, the proof is in the pudding. Over the last year, Dropbox has managed to increase the average revenue per user to $133.79 compared to $128.03 last year, which is a steady increase of 4.5%. When combined with the increase in paying users, that results in an increasingly profitable business and, as a result, Dropbox shows consistent growth every single quarter. Dropbox had 9 consecutive quarters of rising earnings, but broke their streak in the latest one. Q3 of 2021 showed a tiiiny dip from $0.40 to $0.37 dollars EPS, but that is still up 42% since last year. On the flipside, their revenue has grown every single consecutive quarter since they floated on the market with an average revenue growth of 12.5% to 19% year-on-year. Dropbox's revenue for Q3 was $550.2 million compared to $487 million last year so an increase of 12.9%. We can also see a decent increase in Dropbox's free cash flow of 18.4% to $221.5 million in Q3 of 2021.\n\n# Expectations\n\nGoing forward, analysts expect that Dropbox will see a 9.8% increase in revenue next year and a 6% increase in earnings. This doesn't sound like much, but it follows after one of Dropbox's best years so far. Plus, analysts keep pushing their expectations up, which, again, means that Dropbox is performing better than expected. That's important because that's what drives the share price up! There have been 7 Q4 earnings revisions in the last 90 days and all 7 of them have been upward revisions. There has also been 9 revenue revision for Dropbox's full-year 2021 revenue in the last 90 days, 8 of which have been upward revisions. Overall, this bodes well for Dropbox's performance.\n\n# Leaner operations\n\nAlso, I've noticed something which a lot of investors and analysts are overlooking right now, but it is extremely, extremely important in my opinion. The operating expenses of Dropbox have barely moved since December 2019 while their revenue has grown by 26% and their free cash flow has increased by 80%. Lean operations are what good tech businesses are all about so this is a really, really big plus for Dropbox in my books. Dropbox has high gross margins, currently 81% compared to the 80% last year and improving operating margins with 29.3% right now versus 23.0% last year.\n\n# Founder is still in business\n\nAnother bullish argument for Dropbox is the fact that the founder Andrew Houston still owns almost 30% of Dropbox. That's a massive stake and shows his commitment to the company even though he did sell 9% of his total shares on 17th Nov. That's his only sale in the last 2 years though. Founders having a big stake in the company usually means that the company is still in the growth stage and the share price still has room to grow.\n\n# Financial position\n\nThen, let's take a look at Dropbox's cash position. They are flush with cash, absolutely loaded! They currently have $1.93 billion in cash and cash equivalents which is more than their debt of $1.37 billion which means that Dropbox is in a really good financial position considering that they are also profitable. Plus, Dropbox is not actually paying any interest on its long-term debt! The reason why is because they raised money using convertible notes without any interest. Instead, those notes give the loaner the opportunity to convert the notes to shares of Dropbox at the price of $35.35 and $38.25 per share. So, what is Dropbox doing with its cash? Well, first of all, they have been buying back shares. In fact, Dropbox has managed to reduce shares outstanding by 8.6% since the start of 2020. Just during the last quarter, they've bought back $181 million worth of shares! Second, they're using that cash to acquire new companies to fuel additional growth. Acquisitions can be a double-edged sword sometimes, but Dropbox has made it work so far. As I mentioned before, Dropbox bought HelloSign in February 2019 and DocSend in March 2021. The two acquisitions boosted Dropbox's capabilities and now allow them to offer a complete, full suite of self-serve products to its users.\n\nAlright, I hope that by now we all have a pretty good understanding of what is the current situation with Dropbox. Two main questions now remain. One, is Dropbox trading at a good price. Two, what do we need to watch with Dropbox?\n\n# Valuation\n\nLet's look at the valuation first. Currently, Dropbox trades for a PE of 17.6 calculated using the adjusted EPS compared to the sector median of 25.3. Dropbox's forward PE is 16.5 which again lower than the sector median of 24.96. Finally, its PEG ratio is 0.53 and anything under 1 means that the stock is undervalued. The price-to-sales ratio of Dropbox is 4.66 compared to the sector's 4.08 and their forward price-to-sales are 4.36 compared to 4.14 so that's slightly higher than the median, but not by much. Dropbox also said that they expect $1 billion dollars in free cash flow by 2024, which gives us a forward price-to-free cash flow ratio of just 9 which is really, really good. Overall, Dropbox looks undervalued by several indicators right now. In terms of valuation, SimplyWallstreed gives Dropbox a fair value of $53.5 dollars based on its free cash flow. My personal EPS valuation of Dropbox gives me a more conservative figure of $40.2 dollars. Finbox's 10-year Gordon Growth model gives Dropbox an average valuation of $35.4 dollars which is near the analyst consensus of $34.5. Obviously, these are not precise targets, but the main point is that Dropbox currently appears really undervalued gives its current price of $24.7 dollars. The price of Dropbox surprisingly dipped 20% over the last 5 weeks which was strange. There was no actual obvious reason for it as Dropbox reported strong results and actually raised guidance going forward. To me, that's just a great opportunity to get a great stock at a discount!\n\n# What to watch with Dropbox\n\nBefore we finish this off, I want to mention a few things that we need to keep an eye on with Dropbox. First of all, we need to monitor the number of paying users and the average revenue per user as we need to see steady increases there for Dropbox to justify the investment. If those numbers start to stagnate, it may be time to get out of Dropbox. Another figure to watch is the stock-based compensation. In 2020, the total stock-based compensation was $505.9 million which was more than the adjusted earnings of $409.1 million for the entire year! Dropbox is obviously no longer a startup, but it is still in a growth stage so that type of stock-based compensation is normal, but it's still good to keep an eye on it as it dilutes stock ownership. A lot of people have missed the fact that Dropbox has stock-compensation clauses for its CEO, Andrew Houston, connected to its stock price. More precisely, those stock prices are $30, $35, $40, basically on every $5 dollar increment so the more Dropbox's price goes up, the more stock-based compensation Andrew Houston will get. Finally, it looks like institutions are bullish on DBX, but a bit less so than before. The current put-to-call ratio is only 0.8 and that's up from 0.42 during the previous quarter. Essentially, a put-to-call ratio below 1 means that funds think Dropbox will go up. If that ratio goes significantly above 1, then that's one sign of bearish sentiment on the side of funds. Also, it looks like the institutional ownership of Dropbox has gone done from 84% in the last quarter to 76.6% right now. Personally, I think that's because Dropbox hit an all-time high in the latest quarter and funds took the opportunity to take some profits so I'm not that worried about the reducing ownership.\n\nSo, that's all I have to say about Dropbox for now. What do you think? Are you bullish like me?",
  "author_fullname": "t2_bo6czmb5",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Dropbox (DBX): An Undervalued Cloud Company [Bullish Analysis]",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_rcgd43",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.71,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 317,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 317,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1639051757,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One of the most overlooked stocks on the American stock market is Dropbox. I personally love it. It&amp;#39;s got a lot of potential and the recent drop in price opens up an excellent opportunity for new investors.&lt;/p&gt;\n\n&lt;h1&gt;Dropbox at a glance&lt;/h1&gt;\n\n&lt;p&gt;So, why should we care about Dropbox? Simple. It&amp;#39;s a well-performing business that keeps beating analyst expectations. In fact, Dropbox does not have a single earnings or revenue expectations miss since they floated on the stock market! Yes, Dropbox&amp;#39;s growth may be slowing down a tiny, tiny bit, but it is still double digits. This growth is likely led by the overwhelming switch since last year to working from home. A lot of people are also starting their own small businesses and they need solutions like Dropbox to help them organise their files, documents and so on. So, the question is, what does Dropbox actually do? Their flagship product, Dropbox, is a cloud storage solution similar to Google Drive, One Drive, iCloud and so on. Essentially, you can store files on Dropbox and synchronise and share them across PC, mobile, tablets and so on. However, Dropbox is actively striving to become a workspace platform or a smart workplace. Over the last three years they have also acquired HelloSign and DocSend that provide even more capabilities to its users. HelloSign provides the ability to send, receive and manage legally binding electronic signatures, whereas DocSend allows you to securely share documents with other people or businesses, track their usage, provide NDAs, meaning Non-Disclosure Agreements, eSignatures, watermarking and so on. Overall, these three services provide the backbone of the Dropbox product offering. However, Dropbox continues to look for new ways to improve and expand and have recently introduced three new features: Capture, Replay and Shop. I am really interested in the Shop feature, I think that has a lot of potential, but it&amp;#39;s still too early to tell. If it goes well though, it could become a very successful marketplace for digital content.&lt;/p&gt;\n\n&lt;h1&gt;Earnings, revenue and key metrics&lt;/h1&gt;\n\n&lt;p&gt;This all sounds really good, but let&amp;#39;s look at the numbers. Always look at the numbers before you invest &lt;strong&gt;&lt;em&gt;especially&lt;/em&gt;&lt;/strong&gt; these days when there are so many companies that talk a lot, but have nothing to show for it. Like a lot of modern tech companies, the Dropbox business model revolves around subscriptions and that means it is relatively predictable. As long as users are satisfied with the product, they will continue using and paying for it. In Q3 of 2021, Dropbox had over 700 million registered users with 16.49 million paying users up from 15.25 million last year and those include both individuals and business subscriptions. Dropbox&amp;#39;s business model focuses on converting existing users into paying users and we can see it&amp;#39;s obviously working from this increase of 8.1% in the number of paying users per year. What Dropbox also does is upsell to existing users and nudge them to upgrade to premium plans, purchase additional licences and so on. As they say though, the proof is in the pudding. Over the last year, Dropbox has managed to increase the average revenue per user to $133.79 compared to $128.03 last year, which is a steady increase of 4.5%. When combined with the increase in paying users, that results in an increasingly profitable business and, as a result, Dropbox shows consistent growth every single quarter. Dropbox had 9 consecutive quarters of rising earnings, but broke their streak in the latest one. Q3 of 2021 showed a tiiiny dip from $0.40 to $0.37 dollars EPS, but that is still up 42% since last year. On the flipside, their revenue has grown every single consecutive quarter since they floated on the market with an average revenue growth of 12.5% to 19% year-on-year. Dropbox&amp;#39;s revenue for Q3 was $550.2 million compared to $487 million last year so an increase of 12.9%. We can also see a decent increase in Dropbox&amp;#39;s free cash flow of 18.4% to $221.5 million in Q3 of 2021.&lt;/p&gt;\n\n&lt;h1&gt;Expectations&lt;/h1&gt;\n\n&lt;p&gt;Going forward, analysts expect that Dropbox will see a 9.8% increase in revenue next year and a 6% increase in earnings. This doesn&amp;#39;t sound like much, but it follows after one of Dropbox&amp;#39;s best years so far. Plus, analysts keep pushing their expectations up, which, again, means that Dropbox is performing better than expected. That&amp;#39;s important because that&amp;#39;s what drives the share price up! There have been 7 Q4 earnings revisions in the last 90 days and all 7 of them have been upward revisions. There has also been 9 revenue revision for Dropbox&amp;#39;s full-year 2021 revenue in the last 90 days, 8 of which have been upward revisions. Overall, this bodes well for Dropbox&amp;#39;s performance.&lt;/p&gt;\n\n&lt;h1&gt;Leaner operations&lt;/h1&gt;\n\n&lt;p&gt;Also, I&amp;#39;ve noticed something which a lot of investors and analysts are overlooking right now, but it is extremely, extremely important in my opinion. The operating expenses of Dropbox have barely moved since December 2019 while their revenue has grown by 26% and their free cash flow has increased by 80%. Lean operations are what good tech businesses are all about so this is a really, really big plus for Dropbox in my books. Dropbox has high gross margins, currently 81% compared to the 80% last year and improving operating margins with 29.3% right now versus 23.0% last year.&lt;/p&gt;\n\n&lt;h1&gt;Founder is still in business&lt;/h1&gt;\n\n&lt;p&gt;Another bullish argument for Dropbox is the fact that the founder Andrew Houston still owns almost 30% of Dropbox. That&amp;#39;s a massive stake and shows his commitment to the company even though he did sell 9% of his total shares on 17th Nov. That&amp;#39;s his only sale in the last 2 years though. Founders having a big stake in the company usually means that the company is still in the growth stage and the share price still has room to grow.&lt;/p&gt;\n\n&lt;h1&gt;Financial position&lt;/h1&gt;\n\n&lt;p&gt;Then, let&amp;#39;s take a look at Dropbox&amp;#39;s cash position. They are flush with cash, absolutely loaded! They currently have $1.93 billion in cash and cash equivalents which is more than their debt of $1.37 billion which means that Dropbox is in a really good financial position considering that they are also profitable. Plus, Dropbox is not actually paying any interest on its long-term debt! The reason why is because they raised money using convertible notes without any interest. Instead, those notes give the loaner the opportunity to convert the notes to shares of Dropbox at the price of $35.35 and $38.25 per share. So, what is Dropbox doing with its cash? Well, first of all, they have been buying back shares. In fact, Dropbox has managed to reduce shares outstanding by 8.6% since the start of 2020. Just during the last quarter, they&amp;#39;ve bought back $181 million worth of shares! Second, they&amp;#39;re using that cash to acquire new companies to fuel additional growth. Acquisitions can be a double-edged sword sometimes, but Dropbox has made it work so far. As I mentioned before, Dropbox bought HelloSign in February 2019 and DocSend in March 2021. The two acquisitions boosted Dropbox&amp;#39;s capabilities and now allow them to offer a complete, full suite of self-serve products to its users.&lt;/p&gt;\n\n&lt;p&gt;Alright, I hope that by now we all have a pretty good understanding of what is the current situation with Dropbox. Two main questions now remain. One, is Dropbox trading at a good price. Two, what do we need to watch with Dropbox?&lt;/p&gt;\n\n&lt;h1&gt;Valuation&lt;/h1&gt;\n\n&lt;p&gt;Let&amp;#39;s look at the valuation first. Currently, Dropbox trades for a PE of 17.6 calculated using the adjusted EPS compared to the sector median of 25.3. Dropbox&amp;#39;s forward PE is 16.5 which again lower than the sector median of 24.96. Finally, its PEG ratio is 0.53 and anything under 1 means that the stock is undervalued. The price-to-sales ratio of Dropbox is 4.66 compared to the sector&amp;#39;s 4.08 and their forward price-to-sales are 4.36 compared to 4.14 so that&amp;#39;s slightly higher than the median, but not by much. Dropbox also said that they expect $1 billion dollars in free cash flow by 2024, which gives us a forward price-to-free cash flow ratio of just 9 which is really, really good. Overall, Dropbox looks undervalued by several indicators right now. In terms of valuation, SimplyWallstreed gives Dropbox a fair value of $53.5 dollars based on its free cash flow. My personal EPS valuation of Dropbox gives me a more conservative figure of $40.2 dollars. Finbox&amp;#39;s 10-year Gordon Growth model gives Dropbox an average valuation of $35.4 dollars which is near the analyst consensus of $34.5. Obviously, these are not precise targets, but the main point is that Dropbox currently appears really undervalued gives its current price of $24.7 dollars. The price of Dropbox surprisingly dipped 20% over the last 5 weeks which was strange. There was no actual obvious reason for it as Dropbox reported strong results and actually raised guidance going forward. To me, that&amp;#39;s just a great opportunity to get a great stock at a discount!&lt;/p&gt;\n\n&lt;h1&gt;What to watch with Dropbox&lt;/h1&gt;\n\n&lt;p&gt;Before we finish this off, I want to mention a few things that we need to keep an eye on with Dropbox. First of all, we need to monitor the number of paying users and the average revenue per user as we need to see steady increases there for Dropbox to justify the investment. If those numbers start to stagnate, it may be time to get out of Dropbox. Another figure to watch is the stock-based compensation. In 2020, the total stock-based compensation was $505.9 million which was more than the adjusted earnings of $409.1 million for the entire year! Dropbox is obviously no longer a startup, but it is still in a growth stage so that type of stock-based compensation is normal, but it&amp;#39;s still good to keep an eye on it as it dilutes stock ownership. A lot of people have missed the fact that Dropbox has stock-compensation clauses for its CEO, Andrew Houston, connected to its stock price. More precisely, those stock prices are $30, $35, $40, basically on every $5 dollar increment so the more Dropbox&amp;#39;s price goes up, the more stock-based compensation Andrew Houston will get. Finally, it looks like institutions are bullish on DBX, but a bit less so than before. The current put-to-call ratio is only 0.8 and that&amp;#39;s up from 0.42 during the previous quarter. Essentially, a put-to-call ratio below 1 means that funds think Dropbox will go up. If that ratio goes significantly above 1, then that&amp;#39;s one sign of bearish sentiment on the side of funds. Also, it looks like the institutional ownership of Dropbox has gone done from 84% in the last quarter to 76.6% right now. Personally, I think that&amp;#39;s because Dropbox hit an all-time high in the latest quarter and funds took the opportunity to take some profits so I&amp;#39;m not that worried about the reducing ownership.&lt;/p&gt;\n\n&lt;p&gt;So, that&amp;#39;s all I have to say about Dropbox for now. What do you think? Are you bullish like me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "rcgd43",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "TheNewbieInvestor",
  "discussion_type": null,
  "num_comments": 56,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/rcgd43/dropbox_dbx_an_undervalued_cloud_company_bullish/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/rcgd43/dropbox_dbx_an_undervalued_cloud_company_bullish/",
  "subreddit_subscribers": 1962158,
  "created_utc": 1639072111,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1639051757,
  "the_new_excerpt": "One of the most overlooked stocks on the American stock market is Dropbox. I\npersonally love it. It's got a lot of potential and the recent drop in price\nopens up an excellent opportunity for new investors.\n\n\nDROPBOX AT A GLANCE\n\nSo, why should we care about Dropbox? Simple. It's a well-performing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカの株式市場で最も見落とされている銘柄のひとつがDropboxです。I\n個人的には大好きです。多くの可能性を持っているし、最近の価格の下落は\nは、新たな投資家にとって絶好の機会を提供するものです。\n\n\nドロップボックスの概要\n\nでは、なぜDropboxに注目する必要があるのでしょうか？単純なことだ。それは、業績の良い...",
      "title": "ドロップボックス（DBX）。割安なクラウドカンパニー【強気の分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国股票市场上最被忽视的股票之一是Dropbox。I\n个人很喜欢它。它有很大的潜力，最近的价格下跌\n为新的投资者开辟了一个极好的机会。\n\n\n滴滴出行一目了然\n\n那么，我们为什么要关注Dropbox？很简单。它是一个表现良好的公司。",
      "title": "Dropbox（DBX）。一个被低估的云计算公司[看涨分析]"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國股票市場上最被忽視的股票之一是Dropbox。I\n個人很喜歡它。它有很大的潛力，最近的價格下跌\n爲新的投資者開闢了一個極好的機會。\n\n\n滴滴出行一目瞭然\n\n那麼，我們爲什麼要關注Dropbox？很簡單。它是一個表現良好的公司。",
      "title": "Dropbox（DBX）。一個被低估的雲計算公司[看漲分析]"
    }
  ],
  "source_updated_at": 1639734116894
}