{
  "author": "anotherjohnishere",
  "the_new_excerpt": "For those of you that it's your first time wondering \"is this it?\" Welcome!\nThese Bitcoin charts are looking rough as hell, and sometimes that can lead us\nto thinking that we're nosediving right into a bear market.\n\nAre we? Who's to say. Maybe? Maybe not. The good news is, if you're holding for\nthe…",
  "original_created_utc": 1621390465,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初めてで \"これかな？\"と思っている人へ。ようこそ。\nビットコインのチャートは荒れていて、時には弱気になってしまうこともあります。\n時には弱気な市場に突入しているのではないかと考えてしまいます。\n\nそうなのか？それは誰にも言えません。たぶん？そうではないかもしれません。良いニュースは、もしあなたが将来のために保持しているならば\n良いニュースは",
      "title": "さて、皆さん、誰がHodlingなのかを調べてみましょう。"
    },
    {
      "locale": "zh",
      "title": "好了，伙计们，女士们，现在我们来看看谁是霍德林。",
      "the_new_excerpt": "对于那些第一次想知道 \"这就是它吗？\"的人来说，这是你的第一次。欢迎你!\n这些比特币的图表看起来很粗糙，有时这可能导致我们\n认为我们正在跳入一个熊市。\n\n我们是吗？谁说得准呢。可能吗？也许不是。好消息是，如果你持有的是\n的话......。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些第一次想知道 \"這就是它嗎？\"的人來說，這是你的第一次。歡迎你!\n這些比特幣的圖表看起來很粗糙，有時這可能導致我們\n認爲我們正在跳入一個熊市。\n\n我們是嗎？誰說得準呢。可能嗎？也許不是。好消息是，如果你持有的是\n的話......。",
      "title": "好了，夥計們，女士們，現在我們來看看誰是霍德林。"
    }
  ],
  "title": "Well fellas and ladies, now we find out who's Hodling",
  "created_utc": 1621402793,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those of you that it&#39;s your first time wondering &quot;is this it?&quot; Welcome! These Bitcoin charts are looking rough as hell, and sometimes that can lead us to thinking that we&#39;re nosediving right into a bear market. </p>\n\n<p>Are we? Who&#39;s to say. Maybe? Maybe not. The good news is, if you&#39;re holding for the long term, enjoy the discount! If you&#39;re a short term trader, sorry fam shit be hard out here. Better time your entry really well lol. </p>\n\n<p>Just remember, wealth is made in a bull market, fortunes are made in a bear market. So if that&#39;s where we&#39;re headed just sit back and enjoy the ride down. Take it from me, don&#39;t try to short the market, you&#39;ll get bit in the ass. </p>\n\n<p>Namaste kings, we&#39;re all in this together. Pick your favorite alts and load the hell up!</p>\n</div><!-- SC_ON -->",
  "score": 3469,
  "permalink": "/r/CryptoCurrency/comments/nft76s/well_fellas_and_ladies_now_we_find_out_whos/",
  "subreddit": "CryptoCurrency",
  "id": "nft76s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801362
}