{
  "author": "lucrica",
  "the_new_excerpt": "I saw a lot of post about Doge coin but I didn't actually pay attention so a few\nhours ago I looked it up and I just so that within the past 24 hours the Doge\ncoin aka the joke coin has actually done more than 225%, and now has a market\nvalue of more than $ 54 billion. While Bitcoin fell by…",
  "original_created_utc": 1618587628,
  "localize": [
    {
      "locale": "ja",
      "title": "24時間以内にできたミームコインが、私のポートフォリオ全体の過去14日間の成績を実際に上回ったことは信じられません。",
      "the_new_excerpt": "ドージェコインについての投稿をたくさん見ましたが、実は気にしていなかったので、数日前に\n数時間前に調べてみたところ、過去24時間以内にドージェの\nのコイン、別名ジョークコインは、実際に225％以上上昇し、現在では市場\n540億ドル以上の価値があります。ビットコインが下落する中..."
    },
    {
      "locale": "zh",
      "title": "我不敢相信，一个追忆币在24小时内的表现居然比我整个投资组合在过去14天的表现还要好。",
      "the_new_excerpt": "我看到很多关于Doge硬币的帖子，但我并没有真正注意到，所以有几个\n几个小时前，我查了一下，发现在过去的24小时里，Doge\n在过去的24小时内，Doge币（又称笑话币）实际上已经上涨了225%以上，现在的市值为\n价值超过540亿美元。虽然比特币下跌了..."
    },
    {
      "locale": "zh-Hant",
      "title": "我不敢相信，一個追憶幣在24小時內的表現居然比我整個投資組合在過去14天的表現還要好。",
      "the_new_excerpt": "我看到很多關於Doge硬幣的帖子，但我並沒有真正注意到，所以有幾個\n幾個小時前，我查了一下，發現在過去的24小時裏，Doge\n在過去的24小時內，Doge幣（又稱笑話幣）實際上已經上漲了225%以上，現在的市值爲\n價值超過540億美元。雖然比特幣下跌了..."
    }
  ],
  "title": "I can't believe that a meme coin in 24hours has actually perform better than what my entire portfolio has done the past 14 days.",
  "created_utc": 1618621921,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I saw a lot of post about Doge coin but I didn&#39;t actually pay attention so a few hours ago I looked it up and I just so that within the past 24 hours the Doge coin aka the joke coin has actually done more than 225%, and now has a market value of more than $ 54 billion.\nWhile Bitcoin fell by 4%..</p>\n\n<p>Honestly,  if you look at from January to date Doge has done 5000% putting Bitcoins gains of 797% in the same time frame to shade.</p>\n\n<p>But honestly I don&#39;t think is a smart investment for long term, I am not going to fomo into it.\nCongratulations to those who made those gains and sorry to those who will receive the dump.</p>\n</div><!-- SC_ON -->",
  "score": 388,
  "permalink": "/r/CryptoCurrency/comments/ms5t3g/i_cant_believe_that_a_meme_coin_in_24hours_has/",
  "subreddit": "CryptoCurrency",
  "id": "ms5t3g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519532
}