{
  "author": "MarshWFT",
  "original_created_utc": 1659241194,
  "title": "In the US, has there ever been a large scale investigation performed on one federal agency by another? (Ex. FBI investigating corruption within CIA)",
  "created_utc": 1659279479,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like I see this all the time in movies, either the plot follows a federal agency (FBI, CIA, DEA, etc.) working to take down corrupt members of another agency, or it is revealed throughout the movie to the main characters that some agency has “had guys on the inside” and the movies protagonist “almost ruined their whole operation”.&lt;/p&gt;\n\n&lt;p&gt;Hollywood seems to depict these agencies as having little to no interaction with each other, going so far as to make it a trope that they are surprised by the presence of other agencies in certain areas (Ex. DEA was investigating a drug operation, yet it is revealed the CIA was orchestrating it the entire time in pursuit of something else)&lt;/p&gt;\n\n&lt;p&gt;So, with that being said, is there any documented history of corruption/wrongdoing being performed by one agency that is investigated and brought to light by another? I’m curious specifically about instances not involving (or at least not initiated) by the internal affairs department of the respective agency. Am I naive to think these agencies are keeping one another in check?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/wcfznx/in_the_us_has_there_ever_been_a_large_scale/",
  "subreddit": "AskHistorians",
  "id": "wcfznx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel like I see this all the time in movies, either the plot follows a federal\nagency (FBI, CIA, DEA, etc.) working to take down corrupt members of another\nagency, or it is revealed throughout the movie to the main characters that some\nagency has “had guys on the inside” and the movies…"
}