{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Good Friday evening to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning July 5th, 2021.\n\n# **Fed could be a surprise catalyst for the markets in holiday week - [(Source)](https://www.cnbc.com/2021/07/02/fed-could-be-a-surprise-catalyst-for-markets-in-holiday-week-.html)**\n*****\n> The quiet holiday week ahead could hold some fireworks for investors if the Federal Reserve reveals its thinking on its bond buying program.\n*****\n> The four-day trading week could see stocks drift, after hitting new highs this past week. The closely watched 10-year Treasury yield has held under 1.5%, a positive for tech which outperformed with a 3.2% gain for the week.\n*****\n> There are very few economic reports of note, aside from ISM services data on Tuesday. But the Fed’s minutes from its last meeting will be released Wednesday afternoon, and there is potential for the market to learn more about the central bank’s behind-the-scenes discussions on winding down its quantitative easing program.\n*****\n> “Our base case is that rates drift higher, but in order to that get that move higher you need a catalyst to get there,” said Brian Daingerfield, head of G10 FX strategy Americas at NatWest Markets. “Either the Fed has to move forward aggressively on tapering, or you have to get the data really rocking, and you don’t have either.”\n*****\n> Friday’s report that 850,000 jobs were added in June was better than expected. However, the unemployment rate missed expectations after rising by 0.1 percentage points to 5.9%. Economists expected the rate to fall to 5.6%. The report was not seen as strong enough to encourage the Fed to step away sooner from its easy policies. It was, however, seen as a positive — yet largely incomplete — picture of the labor market.\n*****\n> Daingerfield said there is the potential for the Fed’s June meeting minutes to surprise the market, similar to the way April minutes did.\n*****\n> “Remember, Powell said they were not talking about talking about tapering,” he said, referring to Fed Chairman Jerome Powell’s comments right after the April meeting. “Remember, Powell was very dismissive, and then the minutes revealed a kind of drift to the committee.”\n*****\n> The April meeting minutes did surprise investors when they noted that “a number of participants” said it would be appropriate to begin discussing tapering bond purchases at upcoming meetings if the economy continues to make rapid progress. After the June meeting, Powell revealed early stage discussions about paring back bond buying. The Fed also presented a new forecast that included two rate hikes in 2023, where there were none indicated before.\n*****\n> The market is highly sensitive to details about the Fed’s bond purchase program since the ending to that measure would be open the door for the central bank to raise interest rates. The low-rate environment has been the kindling behind the stock market’s robust gains since the Fed went all out to help the economy get through the pandemic. Cutting back on the monthly $120 billion bond purchases would be the first rollback of those extraordinary measures.\n*****\n> “There’s a lot we don’t know about the Fed’s thinking about tapering,” Daingerfield said. He said key information would be when it plans to start, how rapidly it will move to wind down the program and how it decides to break down its current monthly purchases of $80 billion in Treasurys and $40 billion in mortgage securities.\n*****\n> “These details really do matter. Did they get into that conversation at all about details? The more detail they discussed, the more likely it is they are looking to move forward sooner,” Daingerfield said. Fed watchers widely expect more details about tapering the bond program around its annual symposium in Jackson Hole, Wyoming in late August, and then start slowing purchases later this year or early in 2022.\n*****\n> For now, the positive tone in the bond market has helped stocks. The 10-year yield, which moves opposite price, has fallen from its high of the year of about 1.75%. At that level, technology and growth shares were under pressure.\n*****\n> But they’ve been making a comeback as rates drift around in a range below 1.6%. The 10-year was at 1.43% Friday, and while the lower rate may help tech stocks, the yield level is a sharp contrast to an economy that was expected to grow at more than 10% in the second quarter.\n*****\n> That pace is expected to slow, but growth for the year is expected to be robust at more than 7%.\n*****\n> # Tech transition\n> Citi Private Bank chief investment strategist Steven Wieting said that, with the economy peaking, the time is right for investors to begin transitioning to tech and growth shares from the popular cyclical trade.\n*****\n> “We’re seeing this as all a temporary period of massive distortions, and within a year from now, we’ll be on steadier water,” he said. “I think this is giving people a reason, including us, to move away from just cyclical rebound trades and into some sustainable growth opportunities.”\n*****\n> Year to date, cyclicals have been some of the better performers. Energy shares are up 44.5% with the rebound in oil prices, and financials have bounced 25.2%. In contrast, S&P 500 growth stocks are up 14.3%, lagging slightly the S&P 500′s 15.5% gain. Tech stocks are up just 14.9% year-to-date.\n*****\n> One area Wieting now likes is global health care. The S&P 500 health care sector was up 12.5% for the year so far.\n*****\n> “Health care is a mid-cycle outperformer. Health care is a part of the economy that didn’t fall as hard,” he said. “Earnings and revenues have grown moderately every year since the mid-1980s.” He said the sector has lagged the S&P 500 since the end of 2019 by 10 percentage points, and has a cheap valuation. Big pharma stocks are among the best dividend payers.\n*****\n> For the major sectors, on a 12-month basis, the cyclical sectors of industrials, materials, and energy have all risen more than 40%, and tech has had a similar 42% gain.\n*****\n> “The growth stocks have stayed rich. The value stocks have completely caught up with growth stocks in 12-month performance, but the valuation hasn’t been beaten down in growth stocks,” he said. “Gradually we’re going to get more sustained performance out of tech after this period where it flatlined.”\n*****\n> Wieting said one area that is particularly attractive is cybersecurity, where demand is strong as a “tech spending essential,” but the sector has gone nowhere.\n*****\n> For instance, the iShares Cybersecurity and Tech ETF IHAK is just below its 52 week high set in January, and the Global X Cybersecurity ETF BUG is trading about a dollar below its February high.\n*****\n> Wieting said he likes some alternative energy names and companies that are involved in digitization, including fintech.\n*****\n> He expects the overall stock market to move higher but not at the same rapid clip.\n*****\n> “We want to start transitioning portfolios away from just rebound plays...We’re transitioning, knowing we’ve captured significant outperformance over the past year with cyclical value. It made people comfortable investing in equities when we could show how cheap they were,” he said.\n*****\n> The S&P 500 ended the week up 1.7% at a record 4,352, while the Dow climbed 1% to 34,786. The Nasdaq was 1.9% higher, ending the week at a record 14,639.\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/irhvB4I.png))**\n\n# **S&P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/HyIc8Mm.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/gjk5Ixw.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/JQANZA1.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/Ae2GsGB.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ksvyv34.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/xBC4EaW.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JWcsGVb.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/XphUoWx.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/VDW8RH3.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK!](https://i.imgur.com/ygMGeuX.png))**\n\n*****\n\n> # Typical July Seasonal Pattern: Bullish Through Mid-Month & Tepid After\n\n> This July has commenced with across the board gains from the major indexes, DJIA, S&P 500, NASDAQ, Russell 1000 and Russell 2000. Yesterday’s gains are consistent with historical trends for the first trading day of July. Over the past twenty-one years, July has on average begun with respectable gains. The second trading day has been weaker, but after this the major indexes have tended to trend solidly higher through mid-month to around the thirteenth trading day. At this point the major indexes have tended to weaken and trade sideways to lower to finish out the month.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/67aea99b244a104d21bc6f57f445368d/23ccb58895e736a3-1f/s500x750/62f312b0353f82d3620acef0287e9821b5416749.jpg))**\n\n*****\n\n> # Sentiment Has Perked Up\n\n> Sentiment has taken a big step up in the past week. The AAII weekly sentiment survey saw 48.6% of respondents report as bullish this week, up 8.2 percentage points from last week for the highest reading since the week of April 22nd when over half of respondents reported as optimists. Not only is this week's reading ten percentage points above the historical average, but the one-week increase was the largest since an 11.1 percentage point jump during the week of April 8th. Similarly, the Investors Intelligence survey of newsletter writers saw bullish sentiment jump from 56.5% last week to an eight-week high of 59.6%.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/07/070121-AAII-Bull.png)**\n\n> Considering bearish sentiment was already muted, that big increase in bullish sentiment was only met with a 1.1 percentage point decline in bearish sentiment. Only 22.2% of respondents reported as bearish this week, the lowest reading since June 10th.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/07/070121-AAII-Bear.png)**\n\n> While bearish sentiment did not experience a particularly large decline, it was an inverse move to bullish sentiment which resulted in the bull-bear spread climbing 9.3 points to the highest level since April 22nd. That means sentiment continues to largely favor the bulls. Prior to the past year, late 2017 and early 2018 was the only other period in recent years that the bull-bear spread was at similar levels to now.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/07/070121-AAII-Spread.png)**\n\n> Given the jump in bullish sentiment did not borrow from bearish sentiment, neutral sentiment took a significant hit this week falling 7.4 percentage points. That was both the biggest one-week decline and marks the lower level in neutral sentiment since April.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/07/070121-AAII-Neutral.png)**\n\n*****\n\n> # Market Stronger Day Before than After Independence Day\n\n> Over the last 21 years, the trading day before Independence Day has been stronger than the day after. DJIA and S&P 500 have advanced 66.7% of the time with average gains of 0.13% and 0.11% respectively on the day before. Based upon average performance, NASDAQ and Russell 2000 are slightly softer on the day before, but still lean bullish. On the trading day after Independence Day DJIA, S&P 500 and Russell 2000 have declined more frequently than advanced. DJIA has recorded the fewest number of advances while Russell 2000 has the worst average performance with a 0.10% loss.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/0214b60dd1f5594640ff77e2453fac08/7bd83f462948997f-65/s500x750/06a40932e03d1d3b975d3f06cbe3bda0f394079a.jpg))**\n\n*****\n\n> # Stocks Only Going Up In The First Half\n\n> One of the most remarkable aspects of the past six months has been the lack of a significant pullback. The S&P 500 has not seen a 5% pullback since October, and since the start of the year, the most it had fallen from a high was 4.23% from mid-February to March 4th. Besides that and another smaller 4% pullback in May, it has been a one-way trip higher. Looking back through the history of the S&P 500, there are not many other years in which the index went the entire first half without at least a 5% pullback. Below we show the chart of the S&P 500 for each of the 14 years that, like this year, did not experience a pullback of at least 5% in the first half. . As shown, six of these (highlighted in green)—1954, 1958, 1964, 1993, 1995, and most recently 2017—actually did not see a 5% or larger pullback in the second half of the year either.\n\n> As for the other years, the S&P 500 did generally tend to move higher for at least part of the second half, but there have been a range of declines. The year with the largest decline in the second half was 1986 when the index fell 9.42% in September. And that was after a 7.53% decline shortly after the midpoint of the year in the first two weeks of July. The 1959 occurrence similarly saw a 9.17% decline from August through September. While it did not necessarily all happen within the second half of the year, the declines in the final days of the 1961 occurrence actually marked the beginning of a bear market that ultimately would see the S&P 500 fall 23.6% from its late 1961 peak.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/06/063021-5.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n> * **(T.B.A. THIS WEEKEND.)**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/N0bgk3G.png))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 7.5.21 Before Market Open:***\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF INDEPENDENCE DAY.)\n\n> # ***Monday 7.5.21 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK!]())\n(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF INDEPENDENCE DAY.)\n\n*****\n\n> # ***Tuesday  7.6.21 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n> # ***Tuesday 7.6.21 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/Holrw13.png))\n\n*****\n\n> # ***Wednesday 7.7.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/Il3YGVj.png))\n\n> # ***Wednesday 7.7.21 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/Zk3Ia22.png))\n\n*****\n\n> # ***Thursday 7.8.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/rrXsvxg.png))\n\n> # ***Thursday 7.8.21 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK!](https://i.imgur.com/S4a6vfv.png))\n\n*****\n\n> # ***Friday 7.9.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK!](https://i.imgur.com/VO1eejC.png))\n\n*****\n\n> # ***Friday 7.9.21 After Market Close:***\n> ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # (T.B.A. THIS WEEKEND.)\n**(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful 3-day weekend and a great trading week ahead r/stocks.",
  "author_fullname": "t2_eaak0",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Wall Street Week Ahead for the trading week beginning July 5th, 2021",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_ocmky9",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.9,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 66,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 66,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1625269680,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Friday evening to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning July 5th, 2021.</p>\n\n<h1><strong>Fed could be a surprise catalyst for the markets in holiday week - <a href=\"https://www.cnbc.com/2021/07/02/fed-could-be-a-surprise-catalyst-for-markets-in-holiday-week-.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>The quiet holiday week ahead could hold some fireworks for investors if the Federal Reserve reveals its thinking on its bond buying program.</p>\n\n<hr/>\n\n<p>The four-day trading week could see stocks drift, after hitting new highs this past week. The closely watched 10-year Treasury yield has held under 1.5%, a positive for tech which outperformed with a 3.2% gain for the week.</p>\n\n<hr/>\n\n<p>There are very few economic reports of note, aside from ISM services data on Tuesday. But the Fed’s minutes from its last meeting will be released Wednesday afternoon, and there is potential for the market to learn more about the central bank’s behind-the-scenes discussions on winding down its quantitative easing program.</p>\n\n<hr/>\n\n<p>“Our base case is that rates drift higher, but in order to that get that move higher you need a catalyst to get there,” said Brian Daingerfield, head of G10 FX strategy Americas at NatWest Markets. “Either the Fed has to move forward aggressively on tapering, or you have to get the data really rocking, and you don’t have either.”</p>\n\n<hr/>\n\n<p>Friday’s report that 850,000 jobs were added in June was better than expected. However, the unemployment rate missed expectations after rising by 0.1 percentage points to 5.9%. Economists expected the rate to fall to 5.6%. The report was not seen as strong enough to encourage the Fed to step away sooner from its easy policies. It was, however, seen as a positive — yet largely incomplete — picture of the labor market.</p>\n\n<hr/>\n\n<p>Daingerfield said there is the potential for the Fed’s June meeting minutes to surprise the market, similar to the way April minutes did.</p>\n\n<hr/>\n\n<p>“Remember, Powell said they were not talking about talking about tapering,” he said, referring to Fed Chairman Jerome Powell’s comments right after the April meeting. “Remember, Powell was very dismissive, and then the minutes revealed a kind of drift to the committee.”</p>\n\n<hr/>\n\n<p>The April meeting minutes did surprise investors when they noted that “a number of participants” said it would be appropriate to begin discussing tapering bond purchases at upcoming meetings if the economy continues to make rapid progress. After the June meeting, Powell revealed early stage discussions about paring back bond buying. The Fed also presented a new forecast that included two rate hikes in 2023, where there were none indicated before.</p>\n\n<hr/>\n\n<p>The market is highly sensitive to details about the Fed’s bond purchase program since the ending to that measure would be open the door for the central bank to raise interest rates. The low-rate environment has been the kindling behind the stock market’s robust gains since the Fed went all out to help the economy get through the pandemic. Cutting back on the monthly $120 billion bond purchases would be the first rollback of those extraordinary measures.</p>\n\n<hr/>\n\n<p>“There’s a lot we don’t know about the Fed’s thinking about tapering,” Daingerfield said. He said key information would be when it plans to start, how rapidly it will move to wind down the program and how it decides to break down its current monthly purchases of $80 billion in Treasurys and $40 billion in mortgage securities.</p>\n\n<hr/>\n\n<p>“These details really do matter. Did they get into that conversation at all about details? The more detail they discussed, the more likely it is they are looking to move forward sooner,” Daingerfield said. Fed watchers widely expect more details about tapering the bond program around its annual symposium in Jackson Hole, Wyoming in late August, and then start slowing purchases later this year or early in 2022.</p>\n\n<hr/>\n\n<p>For now, the positive tone in the bond market has helped stocks. The 10-year yield, which moves opposite price, has fallen from its high of the year of about 1.75%. At that level, technology and growth shares were under pressure.</p>\n\n<hr/>\n\n<p>But they’ve been making a comeback as rates drift around in a range below 1.6%. The 10-year was at 1.43% Friday, and while the lower rate may help tech stocks, the yield level is a sharp contrast to an economy that was expected to grow at more than 10% in the second quarter.</p>\n\n<hr/>\n\n<p>That pace is expected to slow, but growth for the year is expected to be robust at more than 7%.</p>\n\n<hr/>\n\n<h1>Tech transition</h1>\n\n<p>Citi Private Bank chief investment strategist Steven Wieting said that, with the economy peaking, the time is right for investors to begin transitioning to tech and growth shares from the popular cyclical trade.</p>\n\n<hr/>\n\n<p>“We’re seeing this as all a temporary period of massive distortions, and within a year from now, we’ll be on steadier water,” he said. “I think this is giving people a reason, including us, to move away from just cyclical rebound trades and into some sustainable growth opportunities.”</p>\n\n<hr/>\n\n<p>Year to date, cyclicals have been some of the better performers. Energy shares are up 44.5% with the rebound in oil prices, and financials have bounced 25.2%. In contrast, S&amp;P 500 growth stocks are up 14.3%, lagging slightly the S&amp;P 500′s 15.5% gain. Tech stocks are up just 14.9% year-to-date.</p>\n\n<hr/>\n\n<p>One area Wieting now likes is global health care. The S&amp;P 500 health care sector was up 12.5% for the year so far.</p>\n\n<hr/>\n\n<p>“Health care is a mid-cycle outperformer. Health care is a part of the economy that didn’t fall as hard,” he said. “Earnings and revenues have grown moderately every year since the mid-1980s.” He said the sector has lagged the S&amp;P 500 since the end of 2019 by 10 percentage points, and has a cheap valuation. Big pharma stocks are among the best dividend payers.</p>\n\n<hr/>\n\n<p>For the major sectors, on a 12-month basis, the cyclical sectors of industrials, materials, and energy have all risen more than 40%, and tech has had a similar 42% gain.</p>\n\n<hr/>\n\n<p>“The growth stocks have stayed rich. The value stocks have completely caught up with growth stocks in 12-month performance, but the valuation hasn’t been beaten down in growth stocks,” he said. “Gradually we’re going to get more sustained performance out of tech after this period where it flatlined.”</p>\n\n<hr/>\n\n<p>Wieting said one area that is particularly attractive is cybersecurity, where demand is strong as a “tech spending essential,” but the sector has gone nowhere.</p>\n\n<hr/>\n\n<p>For instance, the iShares Cybersecurity and Tech ETF IHAK is just below its 52 week high set in January, and the Global X Cybersecurity ETF BUG is trading about a dollar below its February high.</p>\n\n<hr/>\n\n<p>Wieting said he likes some alternative energy names and companies that are involved in digitization, including fintech.</p>\n\n<hr/>\n\n<p>He expects the overall stock market to move higher but not at the same rapid clip.</p>\n\n<hr/>\n\n<p>“We want to start transitioning portfolios away from just rebound plays...We’re transitioning, knowing we’ve captured significant outperformance over the past year with cyclical value. It made people comfortable investing in equities when we could show how cheap they were,” he said.</p>\n\n<hr/>\n\n<p>The S&amp;P 500 ended the week up 1.7% at a record 4,352, while the Dow climbed 1% to 34,786. The Nasdaq was 1.9% higher, ending the week at a record 14,639.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/irhvB4I.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/HyIc8Mm.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/gjk5Ixw.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/JQANZA1.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Ae2GsGB.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ksvyv34.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/xBC4EaW.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/JWcsGVb.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/XphUoWx.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE CHART!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/VDW8RH3.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ygMGeuX.png\">CLICK HERE FOR THE CHART LINK!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Typical July Seasonal Pattern: Bullish Through Mid-Month &amp; Tepid After</h1>\n\n<p>This July has commenced with across the board gains from the major indexes, DJIA, S&amp;P 500, NASDAQ, Russell 1000 and Russell 2000. Yesterday’s gains are consistent with historical trends for the first trading day of July. Over the past twenty-one years, July has on average begun with respectable gains. The second trading day has been weaker, but after this the major indexes have tended to trend solidly higher through mid-month to around the thirteenth trading day. At this point the major indexes have tended to weaken and trade sideways to lower to finish out the month.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/67aea99b244a104d21bc6f57f445368d/23ccb58895e736a3-1f/s500x750/62f312b0353f82d3620acef0287e9821b5416749.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Sentiment Has Perked Up</h1>\n\n<p>Sentiment has taken a big step up in the past week. The AAII weekly sentiment survey saw 48.6% of respondents report as bullish this week, up 8.2 percentage points from last week for the highest reading since the week of April 22nd when over half of respondents reported as optimists. Not only is this week&#39;s reading ten percentage points above the historical average, but the one-week increase was the largest since an 11.1 percentage point jump during the week of April 8th. Similarly, the Investors Intelligence survey of newsletter writers saw bullish sentiment jump from 56.5% last week to an eight-week high of 59.6%.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/07/070121-AAII-Bull.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>Considering bearish sentiment was already muted, that big increase in bullish sentiment was only met with a 1.1 percentage point decline in bearish sentiment. Only 22.2% of respondents reported as bearish this week, the lowest reading since June 10th.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/07/070121-AAII-Bear.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>While bearish sentiment did not experience a particularly large decline, it was an inverse move to bullish sentiment which resulted in the bull-bear spread climbing 9.3 points to the highest level since April 22nd. That means sentiment continues to largely favor the bulls. Prior to the past year, late 2017 and early 2018 was the only other period in recent years that the bull-bear spread was at similar levels to now.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/07/070121-AAII-Spread.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>Given the jump in bullish sentiment did not borrow from bearish sentiment, neutral sentiment took a significant hit this week falling 7.4 percentage points. That was both the biggest one-week decline and marks the lower level in neutral sentiment since April.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/07/070121-AAII-Neutral.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Market Stronger Day Before than After Independence Day</h1>\n\n<p>Over the last 21 years, the trading day before Independence Day has been stronger than the day after. DJIA and S&amp;P 500 have advanced 66.7% of the time with average gains of 0.13% and 0.11% respectively on the day before. Based upon average performance, NASDAQ and Russell 2000 are slightly softer on the day before, but still lean bullish. On the trading day after Independence Day DJIA, S&amp;P 500 and Russell 2000 have declined more frequently than advanced. DJIA has recorded the fewest number of advances while Russell 2000 has the worst average performance with a 0.10% loss.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/0214b60dd1f5594640ff77e2453fac08/7bd83f462948997f-65/s500x750/06a40932e03d1d3b975d3f06cbe3bda0f394079a.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Stocks Only Going Up In The First Half</h1>\n\n<p>One of the most remarkable aspects of the past six months has been the lack of a significant pullback. The S&amp;P 500 has not seen a 5% pullback since October, and since the start of the year, the most it had fallen from a high was 4.23% from mid-February to March 4th. Besides that and another smaller 4% pullback in May, it has been a one-way trip higher. Looking back through the history of the S&amp;P 500, there are not many other years in which the index went the entire first half without at least a 5% pullback. Below we show the chart of the S&amp;P 500 for each of the 14 years that, like this year, did not experience a pullback of at least 5% in the first half. . As shown, six of these (highlighted in green)—1954, 1958, 1964, 1993, 1995, and most recently 2017—actually did not see a 5% or larger pullback in the second half of the year either.</p>\n\n<p>As for the other years, the S&amp;P 500 did generally tend to move higher for at least part of the second half, but there have been a range of declines. The year with the largest decline in the second half was 1986 when the index fell 9.42% in September. And that was after a 7.53% decline shortly after the midpoint of the year in the first two weeks of July. The 1959 occurrence similarly saw a 9.17% decline from August through September. While it did not necessarily all happen within the second half of the year, the declines in the final days of the 1961 occurrence actually marked the beginning of a bear market that ultimately would see the S&amp;P 500 fall 23.6% from its late 1961 peak.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/063021-5.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<p>Here are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-</p>\n\n<hr/>\n\n<blockquote>\n<ul>\n<li><strong>(T.B.A. THIS WEEKEND.)</strong></li>\n</ul>\n</blockquote>\n\n<hr/>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h6><strong>(<a href=\"https://i.imgur.com/N0bgk3G.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 7.5.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())</h6>\n\n<p>(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF INDEPENDENCE DAY.)</p>\n\n<h1><strong><em>Monday 7.5.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())</h6>\n\n<p>(NONE. U.S. MARKETS CLOSED IN OBSERVANCE OF INDEPENDENCE DAY.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  7.6.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n\n<h1><strong><em>Tuesday 7.6.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/Holrw13.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 7.7.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/Il3YGVj.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 7.7.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/Zk3Ia22.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 7.8.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/rrXsvxg.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 7.8.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/S4a6vfv.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 7.9.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/VO1eejC.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 7.9.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>(T.B.A. THIS WEEKEND.)</h1>\n\n<p><strong>(T.B.A. THIS WEEKEND.)</strong> (T.B.A. THIS WEEKEND.).</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful 3-day weekend and a great trading week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "ocmky9",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bigbear0083",
  "discussion_type": null,
  "num_comments": 13,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/ocmky9/wall_street_week_ahead_for_the_trading_week/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/ocmky9/wall_street_week_ahead_for_the_trading_week/",
  "subreddit_subscribers": 2860237,
  "created_utc": 1625312465,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1625269680,
  "the_new_excerpt": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning July 5th, 2021.\n\n\nFED…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks[/r/stocks]をご覧の皆様、金曜日の夜はいかがお過ごしでしょうか。このサブの皆さんは\nこのサブにいる皆さんは、先週の市場でうまく利益を得て、これから始まる新しい取引の準備ができていることと思います。\n新しい週に向けて準備ができていることと思います。\n\nここでは、2021年7月5日から始まるトレーディングウィークに向けて、知っておくべきことをお伝えします。\n2021年7月5日から始まります。\n\n\nFED...",
      "title": "2021年7月5日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友们周五晚上好。我希望每个人\n在过去的一周里在市场上赚得盆满钵满，并准备好迎接新的交易周。\n迎接新的交易周的到来。\n\n以下是你需要知道的一切，让你为交易周做好准备\n2021年7月5日开始。\n\n\n美联储...",
      "title": "2021年7月5日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友們週五晚上好。我希望每個人\n在過去的一週裏在市場上賺得盆滿鉢滿，並準備好迎接新的交易周。\n迎接新的交易周的到來。\n\n以下是你需要知道的一切，讓你爲交易周做好準備\n2021年7月5日開始。\n\n\n美聯儲...",
      "title": "2021年7月5日開始的交易周，華爾街一週前瞻"
    }
  ],
  "source_updated_at": 1625823779347
}