{
  "author": "derika22",
  "original_created_utc": 1640554223,
  "title": "What will happen to El Salvador in case of a bear market?",
  "created_utc": 1640579848,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A whole nation which buy BTC as a national reserve, this has its advantages and disadvantages.&lt;/p&gt;\n\n&lt;p&gt;So far they they were making profit, but let&amp;#39;s say we hit a bear market at a certain moment in time (&lt;em&gt;I&amp;#39;m not to wake up bears in hibernation, I like bulls more, but just talking in theory&lt;/em&gt;),&lt;/p&gt;\n\n&lt;p&gt;what would happen to them? Do the people become poorer? And the economy over there, what could happen?&lt;/p&gt;\n\n&lt;p&gt;I am a proud supporter of the idea of cryptocurrency and I see El Salvador as an great innovative yet social/govermental/ecology experiement. They are the first to make Bitcoin a legal tender and it is exciting to see what will happen there in 10 years after adopting crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/rp68xe/what_will_happen_to_el_salvador_in_case_of_a_bear/",
  "subreddit": "CryptoCurrency",
  "id": "rp68xe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A whole nation which buy BTC as a national reserve, this has its advantages and\ndisadvantages.\n\nSo far they they were making profit, but let's say we hit a bear market at a\ncertain moment in time (I'm not to wake up bears in hibernation, I like bulls\nmore, but just talking in theory),\n\nwhat would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "国家備蓄として国全体でBTCを購入する、これにはメリットとデメリットがあります。\nデメリットがあります。\n\n今までは利益を出していましたが、ある時、弱気相場に突入したとします。\n冬眠中の熊を起こすわけではありません。\n理論的な話です）。\n\nどうだろう",
      "title": "弱気相場になった場合、エルサルバドルはどうなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "整个国家购买BTC作为国家储备，这有其优点和缺点。\n劣势。\n\n到目前为止，他们是盈利的，但假设我们在某一时刻遇到熊市\n我不是要唤醒冬眠中的熊市，我更喜欢牛市。\n更喜欢牛市，但只是理论上的说法）。\n\n会有什么...",
      "title": "如果出现熊市，萨尔瓦多会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "整個國家購買BTC作爲國家儲備，這有其優點和缺點。\n劣勢。\n\n到目前爲止，他們是盈利的，但假設我們在某一時刻遇到熊市\n我不是要喚醒冬眠中的熊市，我更喜歡牛市。\n更喜歡牛市，但只是理論上的說法）。\n\n會有什麼...",
      "title": "如果出現熊市，薩爾瓦多會發生什麼？"
    }
  ]
}