{
  "author": "goldiehamham",
  "the_new_excerpt": "I just spent two hours crying about how my dad makes me feel small and gaslights\nme about things he's said or done that has had a lasting effect on me, but at\nthe same time I feel guilty for criticizing him because he is capable of helping\nme and being there in certain circumstances. I lowkey feel…",
  "original_created_utc": 1620529720,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はちょうど2時間、父がいかに私を小さく見せているか、また、父の言動がいかに私に影響を与えているかについて泣いていました。\n私に影響を与えた父の言動についてガスライティングをしていることについて、何時間も泣いていました。\n同時に、父を批判することに罪悪感を感じています。\n批判することに罪悪感を感じます。私は控えめに感じています...",
      "title": "親が良い人であると同時に、今抱えている心理的問題の多くに責任を負っているという、中間的な親との関係を持っている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚花了两个小时哭诉我父亲如何让我觉得自己很渺小，并就他说过或做过的对我有持久影响的事情向我发火。\n他说过或做过的事情对我产生了持久的影响，但同时我又为批评他感到内疚，因为他有能力帮助我。\n同时，我为批评他而感到内疚，因为他有能力帮助我，并在某些情况下陪伴我。\n在某些情况下，他有能力帮助我并在我身边。我低调地觉得...",
      "title": "是否有人与父母的关系介于两者之间，他们既是好人，也要对你现在的很多心理问题负责？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛花了兩個小時哭訴我父親如何讓我覺得自己很渺小，並就他說過或做過的對我有持久影響的事情向我發火。\n他說過或做過的事情對我產生了持久的影響，但同時我又爲批評他感到內疚，因爲他有能力幫助我。\n同時，我爲批評他而感到內疚，因爲他有能力幫助我，並在某些情況下陪伴我。\n在某些情況下，他有能力幫助我並在我身邊。我低調地覺得...",
      "title": "是否有人與父母的關係介於兩者之間，他們既是好人，也要對你現在的很多心理問題負責？"
    }
  ],
  "title": "Does anyone else have an in-between kind of relationship with a parent where they are both good people and also responsible for a lot of the psychological issues you have now?",
  "created_utc": 1620575610,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just spent two hours crying about how my dad makes me feel small and gaslights me about things he&#39;s said or done that has had a lasting effect on me, but at the same time I feel guilty for criticizing him because he is capable of helping me and being there in certain circumstances. I lowkey feel crazy for feeling like I had a tough childhood, even though my friends validate my feelings. Does anybody else have a similar experience with one or more parents?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/n852n8/does_anyone_else_have_an_inbetween_kind_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "n852n8",
  "is_self": true,
  "media": null,
  "is_video": false
}