{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "Short-term market downturns of this magnitude (and much higher!) are to be expected. If you're going through your first small equity downturn right now, you're not alone. If you find it stressful, try to avoid watching the news and continue investing as usual. Better yet: if you're young, cultivate a 'stocks are on sale' attitude and be glad you can keep buying at lower prices. Whatever you do, avoid short-term, split-second decision-making.\n\nHopefully, you've planned for bumps in the road. You have an emergency fund in cash (like a savings or checking account) as a baseline. Beyond that, you know your risk tolerance and have a diversified portfolio of stocks and bonds, including home country and international equities. If you feel stress-tested by all of this, consider waiting it out without taking any action at all (or changing contributions). Then as things normalize, decide if maybe you should shift your stock/bond balance. Or if there is no recovery: sharpen some spears and start learning how to fish!\n\nBecause at the end of the day, things will recover. If they don't, your investments won't matter anyway. The biggest mistake you could make right now is capitulating and trying to time exits and entries. There are some chilling threads over on Bogleheads.org from the 08/09 crisis (a much bigger downturn!) filled with fear and (later) regret from panic selling. Every dip is different in its details, but if the past is any indicator, things will recover sooner or later.\n\nI have no idea if things will go up or down from here. I'm just rebalancing my allocation per my plan made years ago, and have only tweaked slightly along the way (and always in small ways and at non-volatile times). If you don't have a plan written down, it's worth doing - it can help you keep emotions in trek and invested in various scenarios.\n\nBut in the words of The Dude: that's just, like, my opinion, man!\n\nMeanwhile, stay safe out there, folks, and stay the course.",
  "author_fullname": "t2_3ue2x",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Expect downturns - embrace them if possible, and if that's challenging: at least stay the course",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_t0437e",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.94,
  "author_flair_background_color": "",
  "subreddit_type": "public",
  "ups": 39,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Investment Theory",
  "can_mod_post": false,
  "score": 39,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1645684340,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Short-term market downturns of this magnitude (and much higher!) are to be expected. If you&amp;#39;re going through your first small equity downturn right now, you&amp;#39;re not alone. If you find it stressful, try to avoid watching the news and continue investing as usual. Better yet: if you&amp;#39;re young, cultivate a &amp;#39;stocks are on sale&amp;#39; attitude and be glad you can keep buying at lower prices. Whatever you do, avoid short-term, split-second decision-making.&lt;/p&gt;\n\n&lt;p&gt;Hopefully, you&amp;#39;ve planned for bumps in the road. You have an emergency fund in cash (like a savings or checking account) as a baseline. Beyond that, you know your risk tolerance and have a diversified portfolio of stocks and bonds, including home country and international equities. If you feel stress-tested by all of this, consider waiting it out without taking any action at all (or changing contributions). Then as things normalize, decide if maybe you should shift your stock/bond balance. Or if there is no recovery: sharpen some spears and start learning how to fish!&lt;/p&gt;\n\n&lt;p&gt;Because at the end of the day, things will recover. If they don&amp;#39;t, your investments won&amp;#39;t matter anyway. The biggest mistake you could make right now is capitulating and trying to time exits and entries. There are some chilling threads over on Bogleheads.org from the 08/09 crisis (a much bigger downturn!) filled with fear and (later) regret from panic selling. Every dip is different in its details, but if the past is any indicator, things will recover sooner or later.&lt;/p&gt;\n\n&lt;p&gt;I have no idea if things will go up or down from here. I&amp;#39;m just rebalancing my allocation per my plan made years ago, and have only tweaked slightly along the way (and always in small ways and at non-volatile times). If you don&amp;#39;t have a plan written down, it&amp;#39;s worth doing - it can help you keep emotions in trek and invested in various scenarios.&lt;/p&gt;\n\n&lt;p&gt;But in the words of The Dude: that&amp;#39;s just, like, my opinion, man!&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, stay safe out there, folks, and stay the course.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "039ac088-6c0f-11ec-9e3f-2294c5b4c8da",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": "MOD 1",
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ffd635",
  "id": "t0437e",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "misnamed",
  "discussion_type": null,
  "num_comments": 7,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": "dark",
  "permalink": "/r/Bogleheads/comments/t0437e/expect_downturns_embrace_them_if_possible_and_if/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/t0437e/expect_downturns_embrace_them_if_possible_and_if/",
  "subreddit_subscribers": 142149,
  "created_utc": 1645692024,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1645684340,
  "the_new_excerpt": "Short-term market downturns of this magnitude (and much higher!) are to be\nexpected. If you're going through your first small equity downturn right now,\nyou're not alone. If you find it stressful, try to avoid watching the news and\ncontinue investing as usual. Better yet: if you're young, cultivate…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この程度の短期的な相場の下落は（もっと高い場合も！）ある。\nが予想されます。もしあなたが今、初めての小さな株安を経験しているならば。\nあなただけではないのです。もし、ストレスに感じるようであれば、ニュースを見ないようにして\nいつもと同じように投資を続ける それよりも、もしあなたが若いのであれば、...",
      "title": "景気後退を予想し、可能ならそれを受け入れ、それが困難なら、少なくとも軌道を維持する。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这种程度的短期市场衰退（以及更高的程度！）是可以预期的。\n预期的。如果你现在正在经历你的第一次小规模股票下跌。\n你并不孤单。如果你觉得压力很大，尽量避免看新闻，并\n继续像往常一样投资。更好的是：如果你是年轻人，培养...",
      "title": "期待经济下滑--如果可能的话，拥抱它们，如果这很有挑战性：至少要坚持到底"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這種程度的短期市場衰退（以及更高的程度！）是可以預期的。\n預期的。如果你現在正在經歷你的第一次小規模股票下跌。\n你並不孤單。如果你覺得壓力很大，儘量避免看新聞，並\n繼續像往常一樣投資。更好的是：如果你是年輕人，培養...",
      "title": "期待經濟下滑--如果可能的話，擁抱它們，如果這很有挑戰性：至少要堅持到底"
    }
  ],
  "source_updated_at": 1645782076806
}