{
  "author": "DrunkSpartan15",
  "the_new_excerpt": "Like many people, I jumped on the GME Hype. A couple years back I started an\naccount with TDA for Pot stocks. I did fairly well, turned 1.5k into 7k. Sadly I\ndidn't sell then. When I did sell it was at 4k. Needed cash to get an apartment\nwith my preggo girlfriend. fast forward a few years and I see…",
  "original_created_utc": 1614739373,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "和很多人一样，我也跳上了GME的炒作。几年前，我开始了一个\n帐户与TDA的锅股票。我做得相当不错，把1.5k变成了7k。可悲的是，我\n当时没有卖掉。我卖的时候是4千块钱。需要现金来买房\n和我的未婚女友，快进几年了，我看到... ...",
      "title": "如何DD，我看什么，我应该关注什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "和很多人一樣，我也跳上了GME的炒作。幾年前，我開始了一個\n帳戶與TDA的鍋股票。我做得相當不錯，把1.5k變成了7k。可悲的是，我\n當時沒有賣掉。我賣的時候是4千塊錢。需要現金來買房\n和我的未婚女友，快進幾年了，我看到... ...",
      "title": "如何DD，我看什麼，我應該關注什麼？"
    }
  ],
  "title": "How to DD, what do I look for? what should I focus on?",
  "created_utc": 1614776345,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like many people, I jumped on the GME Hype. A couple years back I started an account with TDA for Pot stocks. I did fairly well, turned 1.5k into 7k. Sadly I didn&#39;t sell then. When I did sell it was at 4k. Needed cash to get an apartment with my preggo girlfriend. fast forward a few years and I see the GME news on YouTube, and bought a couple of shares. since then I&#39;ve been glued to my phone, bouncing between both TDA and Reddit. Well I&#39;m a member here, WSB, and Pennystocks. </p>\n\n<p>I know enough about the stock market to be dangerous. As in, dangerous to myself. I just want to know what to look for when investigating a company. Every fucking guide I&#39;ve seen seems abstract. using vague terminology and not really pointing to any direction. Some talk about P/E but don&#39;t really explain whats good P/E.</p>\n\n<p>I&#39;m not looking for someone to do the work for me, but I need help. I want to know what to look for in a company. Like Market Cap vs Outstanding shares. I&#39;m not in any rush, I have time and want to learn. Can anyone help me?</p>\n</div><!-- SC_ON -->",
  "score": 63,
  "permalink": "/r/stocks/comments/lwj84t/how_to_dd_what_do_i_look_for_what_should_i_focus/",
  "subreddit": "stocks",
  "id": "lwj84t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744947
}