{
  "author": "omgwowloljkstfu",
  "the_new_excerpt": "This post will probably get buried, but whatever, it's funny.\n\nI went into get tested for Covid this afternoon after being exposed, nothing\nspecial. But I'm also buying dips on AMC at the same time and as a result,\nalmost missed my name being called multiple times by the receptionist when my\nturn…",
  "original_created_utc": 1614369184,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个帖子可能会被埋没，但不管怎样，它很有趣。\n\n今天下午我去做了Covid的测试，被曝光后，什么都没有\n特别。但我同时也在AMC上买进跌停板，结果。\n差点错过了我的名字被前台叫了很多次，当我的。\n转...",
      "title": "我的医生祝愿我们这些弱智的人一切顺利"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個帖子可能會被埋沒，但不管怎樣，它很有趣。\n\n今天下午我去做了Covid的測試，被曝光後，什麼都沒有\n特別。但我同時也在AMC上買進跌停板，結果。\n差點錯過了我的名字被前臺叫了很多次，當我的。\n轉...",
      "title": "我的醫生祝願我們這些弱智的人一切順利"
    }
  ],
  "title": "My doctor wishes us retards the best of luck",
  "created_utc": 1614390832,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post will probably get buried, but whatever, it&#39;s funny.</p>\n\n<p>I went into get tested for Covid this afternoon after being exposed, nothing special. But I&#39;m also buying dips on AMC at the same time and as a result, almost missed my name being called multiple times by the receptionist when my turn was ready. Tunnel vision is real.</p>\n\n<p>I get the swab and chat with the doc for a minute or two about all the Covid craziness and just overall life shit. He&#39;s a cool guy, super laid back and what not, and after a bit he steps out to go find my results. I&#39;m chillin in the exam room, waiting for my results and of course, I&#39;m still on my apps, just habitually watching the price and debating if I should go in on some more or not. About five or six minutes go by when my doctor returns with results. I didn&#39;t realize he could see the basic idea of what I was doing on my phone (price-watching etc) and as he passes me, I hear him say, &quot;Niiiiiice.&quot;</p>\n\n<p>Being in the exam room and awaiting my results, I chime in with, &quot;Oh sweet, I&#39;m negative?&quot; He responds with, &quot;Nah, I saw the stonks on your phone. Good luck, retard.&quot; There&#39;s a pause in the air before he mentions Reddit and WSB, just to laugh off a potential HR issue calling a patient a retard, Turns out he&#39;s here somewhere in the 9 million strong pulling for us and has been holding strong and buying the dips too.</p>\n\n<p>Anyways, TL;DR: My doctor said &quot;good luck, retard&quot; while catching me buying dips on AMC and he&#39;s here somewhere in the WSB crowd.</p>\n\n<p>Diamond hands, Covid neg, TO THE MOON WE GO!</p>\n</div><!-- SC_ON -->",
  "score": 15046,
  "permalink": "/r/wallstreetbets/comments/lt67sr/my_doctor_wishes_us_retards_the_best_of_luck/",
  "subreddit": "wallstreetbets",
  "id": "lt67sr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937750639
}