{
  "author": "TrueSpins",
  "original_created_utc": 1636980073,
  "title": "Are we watching crypto's awkward and slightly embarrassing teenage years?",
  "created_utc": 1637001690,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember back in 2013 when Bitcoin was inching towards 1k, and we were all going out of our minds talking about mass adoption and how we were on the cusp of a new era. It felt like we were watching a social movement in action - the fall of the corrupt banking system and the rise of people power. </p>\n\n<p>Oh how naive we were...</p>\n\n<p>Now in 2021 we are almost there, and it turns out mass adoption is ugly as hell. </p>\n\n<p>Scam coins are everywhere, everyone and their dog is pumping money into hastily launched memecoins and people that can barely use a computer are fomoing into NFTs.</p>\n\n<p>I&#39;m hoping that we&#39;re essentially just watching crypto&#39;s teenage years - an awkward self awakening, complete with acne and poor decisions - and eventually we&#39;ll come out the other side.</p>\n\n<p>But it does all feel a bit cringey at the moment.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/qufjpt/are_we_watching_cryptos_awkward_and_slightly/",
  "subreddit": "CryptoCurrency",
  "id": "qufjpt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I remember back in 2013 when Bitcoin was inching towards 1k, and we were all\ngoing out of our minds talking about mass adoption and how we were on the cusp\nof a new era. It felt like we were watching a social movement in action - the\nfall of the corrupt banking system and the rise of people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2013年にビットコインが1,000ドルに向かっていたとき、私たちは皆、大規模な採用とその頂点にいることについて夢中になっていたのを覚えています。\n大規模な導入が可能になり、その入り口に立っているという話で盛り上がっていました。\n新しい時代の入り口に立っているのだと。腐敗した銀行システムが崩壊し、新しい時代の幕開けとなったのです。\n腐敗した銀行システムが崩壊し、人々が台頭する...。",
      "title": "私たちは、暗号の不器用で少し恥ずかしい10代を見ているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得在2013年的时候，比特币正向1K迈进，而我们都在\n我们都在谈论大规模的采用，以及我们是如何站在一个新时代的风口浪尖上的。\n一个新时代的来临。感觉就像我们在看一场社会运动在行动--腐败的银行业的垮台。\n腐败的银行系统的衰落和人们的崛起......",
      "title": "我们是否在观看加密货币的尴尬和略显尴尬的青少年时期？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得在2013年的時候，比特幣正向1K邁進，而我們都在\n我們都在談論大規模的採用，以及我們是如何站在一個新時代的風口浪尖上的。\n一個新時代的來臨。感覺就像我們在看一場社會運動在行動--腐敗的銀行業的垮臺。\n腐敗的銀行系統的衰落和人們的崛起......",
      "title": "我們是否在觀看加密貨幣的尷尬和略顯尷尬的青少年時期？"
    }
  ]
}