{
  "author": "Tyrantt_47",
  "the_new_excerpt": "Looks like Robinhood couldn't handle the heat for more than 1 day into their 3\nday AMA and deleted their AMA. They just removed their post after ignoring all\nquestions that didn't ask about a crypto wallet, and even then, they refused to\ngive a date as to when they would release a wallet. It's so…",
  "original_created_utc": 1619586967,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロビンフッドは、3日間のAMAのうち1日以上の熱に耐えられず、AMAを削除したようです。\nAMAを削除しました。彼らは、暗号化された壁について質問していない質問をすべて無視した後、その投稿を削除しました。\n暗号ウォレットについて質問していないすべての質問を無視した後、投稿を削除しました。\nウォレットをいつリリースするかについての日付を与えることを拒否しました。それはとても...",
      "title": "Robinhoodは、3日間のAMAのうち1日以上の熱気に耐えられず、AMAを削除したようだ。あなたの鍵ではなく、あなたの暗号でもない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看起来Robinhood在他们3天的AMA中无法处理超过1天的热度，并删除了他们的AMA。\n天的AMA，并删除了他们的AMA。他们只是在无视所有\n所有没有问及加密货币钱包的问题后，他们刚刚删除了他们的帖子，即使如此，他们也拒绝\n即使如此，他们也拒绝给出一个日期，说明他们何时会发布钱包。这真是...",
      "title": "看起来Robinhood在他们3天的AMA中无法处理超过1天的热度，并删除了他们的AMA。不是你的钥匙，不是你的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看起來Robinhood在他們3天的AMA中無法處理超過1天的熱度，並刪除了他們的AMA。\n天的AMA，並刪除了他們的AMA。他們只是在無視所有\n所有沒有問及加密貨幣錢包的問題後，他們剛剛刪除了他們的帖子，即使如此，他們也拒絕\n即使如此，他們也拒絕給出一個日期，說明他們何時會發布錢包。這真是...",
      "title": "看起來Robinhood在他們3天的AMA中無法處理超過1天的熱度，並刪除了他們的AMA。不是你的鑰匙，不是你的加密貨幣"
    }
  ],
  "title": "Looks like Robinhood couldn't handle the heat for more than 1 day into their 3 day AMA and deleted their AMA. Not your keys, not your crypto",
  "created_utc": 1619598743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Looks like Robinhood couldn&#39;t handle the heat for more than 1 day into their 3 day AMA and deleted their AMA. They just removed their post after ignoring all questions that didn&#39;t ask about a crypto wallet, and even then, they refused to give a date as to when they would release a wallet. It&#39;s so weird that they would make an AMA if they weren&#39;t ready to answer the tough questions. All it did was further confirm that using their exchange is a terrible idea, especially after the GME fiasco</p>\n\n<p>Stay far far away from Robinhood and remember: not your keys, not your Crypto.</p>\n</div><!-- SC_ON -->",
  "score": 5886,
  "permalink": "/r/CryptoCurrency/comments/n07lz1/looks_like_robinhood_couldnt_handle_the_heat_for/",
  "subreddit": "CryptoCurrency",
  "id": "n07lz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776212037
}