{
  "author": "ChanzyChan",
  "the_new_excerpt": "Real quick, lets just clear the air. WSB has ALWAYS been filled with assholes\nand degenerates. DFV took his beatings the ENTIRE time until it paid off. WSB\ndoesn't play nice, if you post expect to be ridiculed ruthlessly lol.\n\nThat said, his name is DEEPFUCKINGVALUE. He did DEEPFUCKINGVALUE plays,…",
  "original_created_utc": 1612800666,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "快点，我们先把话说清楚 WSB一直以来都充满了混蛋\n和退化者。DFV承受了他的殴打，直到它得到回报。WSB\n不玩好的，如果你发帖期望被无情的嘲笑lol。\n\n话说，他的名字叫DEEPFUCKINGVALUE。他做了DEEPFUCKINGVALUE的戏，... ...",
      "title": "我注意到人们对DFV和WSB有一些混淆。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "快點，我們先把話說清楚 WSB一直以來都充滿了混蛋\n和退化者。DFV承受了他的毆打，直到它得到回報。WSB\n不玩好的，如果你發帖期望被無情的嘲笑lol。\n\n話說，他的名字叫DEEPFUCKINGVALUE。他做了DEEPFUCKINGVALUE的戲，... ...",
      "title": "我注意到人們對DFV和WSB有一些混淆。"
    }
  ],
  "title": "Something I noticed people have confused about DFV and WSB.",
  "created_utc": 1612815842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Real quick, lets just clear the air. WSB has ALWAYS been filled with assholes and degenerates. DFV took his beatings the ENTIRE time until it paid off. WSB doesn&#39;t play nice, if you post expect to be ridiculed ruthlessly lol.</p>\n\n<p>That said, his name is DEEPFUCKINGVALUE. He did DEEPFUCKINGVALUE plays, I&#39;m talking warren buffet level 4-D chess lol.</p>\n\n<p>He didnt chase trends. Or buy something because someone told him so. He was ruthless and logical in his belief that at the time, it was a very intelligent decision at the time.</p>\n\n<p>Be like DFV. Unless you&#39;re a degenerate gambler ready to lose it all. In which case...whats your next play? (Legit asking)</p>\n\n<p>Edit: Disclaimer i dont own ANY stocks or options right now, waiting for a play. No bias for or against GME.</p>\n</div><!-- SC_ON -->",
  "score": 7048,
  "permalink": "/r/wallstreetbets/comments/lff3g1/something_i_noticed_people_have_confused_about/",
  "subreddit": "wallstreetbets",
  "id": "lff3g1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123217896
}