{
  "author": "Frigorifico",
  "original_created_utc": 1628776887,
  "title": "Poisoning wells was a common practice in times of war, but then, at which point the well becomes drinkable again?, are there well still poisoned from past wars?",
  "created_utc": 1628781975,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When you read about certain conflicts, like Romans invading Persia, or the Cruzades, there are many mentions of wells being poisoned to deny water to their enemies, but no one explains in detail how this was done, what kinds of poison they were using, and if this process was reversible</p>\n\n<p>I imagine there must be a way for wells to become safe again, otherwise this practice wouldn&#39;t be so common because all the wells in the world would already be poisoned, but I have no idea how long it takes. Do you just wait?, do you add other substances in the well to neutralize the poison somehow?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/p30fpv/poisoning_wells_was_a_common_practice_in_times_of/",
  "subreddit": "AskHistorians",
  "id": "p30fpv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When you read about certain conflicts, like Romans invading Persia, or the\nCruzades, there are many mentions of wells being poisoned to deny water to their\nenemies, but no one explains in detail how this was done, what kinds of poison\nthey were using, and if this process was reversible\n\nI imagine…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローマ人がペルシャに侵攻したときや、クルザス戦争など、ある種の紛争を読むと\nクルツァーデの戦いでは、敵に水を与えないために井戸に毒を入れたという話が多く出てきます。\nしかし、どのようにして行われたのか、どのような種類の毒を使ったのか、どのような方法で\nどのようにして行われたのか、どのような毒を使ったのか、このプロセスは元に戻せるのか、などについて詳しく説明している人はいません。\n\n想像するに...。",
      "title": "戦時中は井戸に毒を入れるのが当たり前でしたが、その後、ある時点で井戸は再び飲めるようになるのでしょうか？過去の戦争で毒を入れられた井戸はまだあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你读到某些冲突的时候，比如罗马人入侵波斯，或者是克鲁兹王朝。\n克鲁兹德，有很多关于井被毒死以拒绝向敌人供水的记载。\n但没有人详细解释这是如何做到的，是什么类型的毒药？\n他们使用的是哪种毒药，以及这个过程是否可逆。\n\n我想象...",
      "title": "在战争时期，给水井下毒是一种常见的做法，但后来，在哪个时候，水井又变得可以饮用了呢，是否还有过去战争中的水井被下毒呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你讀到某些衝突的時候，比如羅馬人入侵波斯，或者是克魯茲王朝。\n克魯茲德，有很多關於井被毒死以拒絕向敵人供水的記載。\n但沒有人詳細解釋這是如何做到的，是什麼類型的毒藥？\n他們使用的是哪種毒藥，以及這個過程是否可逆。\n\n我想象...",
      "title": "在戰爭時期，給水井下毒是一種常見的做法，但後來，在哪個時候，水井又變得可以飲用了呢，是否還有過去戰爭中的水井被下毒呢？"
    }
  ]
}