{
  "author": "Superkulicka",
  "original_created_utc": 1628101939,
  "title": "I did filter top 400-500 so you don't have to.",
  "created_utc": 1628116241,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi.</p>\n\n<p>Like many of you, I have the majority of my portfolio from the top 100. But from time to time I do like to put a few bucks into some lesser-known projects, you know, hidden gems, best-kept secrets, etc. I did realize that every time I do an assessment if it&#39;s not completely moronic to invest in a particular project/coin, I am coming back and forth so many times, because I am forgetting what it is, what&#39;s the max supply, etc. That led me to make my own excel chart with Top 500 in which I filtered all the stuff that didn&#39;t pass my check. So I decided to share that with you and save you some tenths or hundreds of clicks.</p>\n\n<p><strong>So how did I filter the top 400-500? I removed all this:</strong></p>\n\n<ul>\n<li>no meme coins and also coins with HODL, SAFE, MOON etc in their name</li>\n<li>no stablecoins, no wrapped coins, no exchange related coins</li>\n<li>no coins where I couldn&#39;t find any decent info about the team behind them</li>\n<li>no coins where top 10 holders own more than 90% of the total circulating supply</li>\n<li>no coins where I couldn&#39;t verify how much top 10 holders own</li>\n<li>no NFT&#39;s, collectibles etc</li>\n<li>no projects without a working website</li>\n</ul>\n\n<p>For me, all that above are <strong>RED FLAGS</strong>. I did not evaluate if the coins/projects have their own apps, wallets, audit, mainnet etc, because some of them are X years old and some of them are 2021, so that wouldn&#39;t be fair. I would personally remove even those projects that are more than 90% low than their ATH considering them walking dead, but left them there for you. I would stay away from those zombies.</p>\n\n<p><strong>THE REMAINING 29</strong></p>\n\n<p>(positions of course changed a bit since this morning)</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/v3gxkdx4xdf71.png?width=609&amp;format=png&amp;auto=webp&amp;s=2f1df68e4da48ec13917d4efb942b042065b9a54\">https://preview.redd.it/v3gxkdx4xdf71.png?width=609&amp;format=png&amp;auto=webp&amp;s=2f1df68e4da48ec13917d4efb942b042065b9a54</a></p>\n\n<p><strong>Numbers:</strong></p>\n\n<p>(of course, the price is not live, but I left it here to have some approx, sorted by position)</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rus3v47axdf71.png?width=527&amp;format=png&amp;auto=webp&amp;s=a642c58414c6e51f9977ca7d7e08ad0de3c09993\">https://preview.redd.it/rus3v47axdf71.png?width=527&amp;format=png&amp;auto=webp&amp;s=a642c58414c6e51f9977ca7d7e08ad0de3c09993</a></p>\n\n<p><strong>Age of the project and exchange listing.</strong></p>\n\n<p><em>Yes</em> means that the project is listed on at least one of these exchanges: Coinbase, Binance, Kraken</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/2ad3ilj6xdf71.png?width=312&amp;format=png&amp;auto=webp&amp;s=cb408ac1ef12d32b0fd4cd01412b4d7490039cd5\">https://preview.redd.it/2ad3ilj6xdf71.png?width=312&amp;format=png&amp;auto=webp&amp;s=cb408ac1ef12d32b0fd4cd01412b4d7490039cd5</a></p>\n\n<p>PS: of course, I am just a dumbass who doesn&#39;t understand money, so this is not advice at all. Just top 500 trimmed down. Maybe your criteria are completely different and in that case, this is useless for you, but I believe there are many people here who can save some time with this.</p>\n\n<p>PS2: I am tired.</p>\n\n<p>PS3: if you want, I could do the same with the top 300-400. I guess I will just wait to see what will be the response.</p>\n\n<p>PS4: of course, this is what I filtered. That doesn&#39;t equal being a good project or a great investment opportunity. DYOR.</p>\n</div><!-- SC_ON -->",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/oxz3m5/i_did_filter_top_400500_so_you_dont_have_to/",
  "subreddit": "CryptoCurrency",
  "id": "oxz3m5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi.\n\nLike many of you, I have the majority of my portfolio from the top 100. But from\ntime to time I do like to put a few bucks into some lesser-known projects, you\nknow, hidden gems, best-kept secrets, etc. I did realize that every time I do an\nassessment if it's not completely moronic to invest in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n皆さんと同じように、私もポートフォリオの大半をトップ100から取っています。しかし、たまには\nあまり知られていないプロジェクトに数ドルを投じることもあります。\n隠れた名作、秘蔵の名作といったところでしょうか。私は、評価をするたびに、それが完全にモラルのあるものでなければ\n評価をするたびに、投資することが完全に馬鹿げていないかどうか...",
      "title": "私は上位400～500位までをフィルタリングしたので、その必要はありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n像你们中的许多人一样，我的大部分投资组合来自前100名。但从\n时不时地，我也喜欢在一些鲜为人知的项目中投入一些钱，你知道，隐藏的珍宝，最好的秘密。\n你知道，隐藏的宝石，最好的秘密，等等。我确实意识到，每次我做一个\n评估，如果它不是完全低能的投资......",
      "title": "我做了过滤前400-500名的工作，所以你不必如此。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n像你們中的許多人一樣，我的大部分投資組合來自前100名。但從\n時不時地，我也喜歡在一些鮮爲人知的項目中投入一些錢，你知道，隱藏的珍寶，最好的祕密。\n你知道，隱藏的寶石，最好的祕密，等等。我確實意識到，每次我做一個\n評估，如果它不是完全低能的投資......",
      "title": "我做了過濾前400-500名的工作，所以你不必如此。"
    }
  ]
}