{
  "author": "07Ghost",
  "the_new_excerpt": "There's always something to worry about\n[https://www.youtube.com/watch?v=Esn0QZmD77A].\n\nMost people on this sub who preach to invest into index funds, to hold for the\nlong term. Yet, everyday you see posts about what's next to buy, what's gonna\ncrash the stock market, or why this market doesn't make…",
  "original_created_utc": 1610369446,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "总有一些事要担心\n[https://www.youtube.com/watch?v=Esn0QZmD77A].\n\n这个小组中的大多数人鼓吹投资于指数基金，以持有\n从长远来看。然而，每天你都会看到关于下一步要买什么，要买什么的帖子\n股市崩盘，或者为什么这个市场没有让…",
      "title": "彼得·林奇：“总有一些事情需要担心。”"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "總有一些事要擔心\n[https://www.youtube.com/watch?v=Esn0QZmD77A].\n\n這個小組中的大多數人鼓吹投資於指數基金，以持有\n從長遠來看。然而，每天你都會看到關於下一步要買什麼，要買什麼的帖子\n股市崩盤，或者爲什麼這個市場沒有讓…",
      "title": "彼得·林奇：“總有一些事情需要擔心。”"
    }
  ],
  "title": "Peter Lynch: \"There's always something to worry about.\"",
  "created_utc": 1610409544,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.youtube.com/watch?v=Esn0QZmD77A\">There&#39;s always something to worry about</a>.</p>\n\n<p>Most people on this sub who preach to invest into index funds, to hold for the long term. Yet, everyday you see posts about what&#39;s next to buy, what&#39;s gonna crash the stock market, or why this market doesn&#39;t make sense when the economy is in the dumpster. At the end of day, most people here don&#39;t have the stomachs to withstand when actual correction comes. A lot of people don&#39;t know what they own. How many people sold out of their SPY or VOO during March &amp; April of 2020, then just to buy it back later at a way higher price?</p>\n\n<p>To them holding long term equals to holding a stock for 1-3 months, and they wondered why they got paper handed. You can be the best expert at economics, you understand the inside-and-out of the world&#39;s money supply and the U.S. national debts, and you would still get the market wrong.</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/investing/comments/kv20iv/peter_lynch_theres_always_something_to_worry_about/",
  "subreddit": "investing",
  "id": "kv20iv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379514
}