{
  "author": "Tephnos",
  "original_created_utc": 1656589379,
  "title": "If you have the genes for lactase persistence, such as is common in European populations, but stop consuming lactose for a period of time, is it possible to lose the ability to metabolize lactose, does lactase production stop without constant intake?",
  "created_utc": 1656642628,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This question seems to come up often, but is riddled with anecdotes that don&amp;#39;t make things clear. I&amp;#39;ve seen people talk about stopping diary then becoming intolerant after doing that for a number of months - but were they always intolerant (had no lactase enzymes) and just never knew it?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m aware that apparently, with enough consumption, even people with no lactase production can metabolise lactose (in limited quantities) as gut bacteria can take over - is this what happens in the above examples where people &amp;#39;lose&amp;#39; their ability to metabolise it? They just didn&amp;#39;t know they had no lactase, and it was gut flora doing the work?&lt;/p&gt;\n\n&lt;p&gt;I ask because I&amp;#39;ve been recently suffering with infrequent IBS and I am trying an elimination diet of things that may trigger it for a period of a few months, then slowly reintroduce it and hope that things clear up. However, the possibility that my ability to metabolise lactose might disappear because of that does make me concerned. As far as I&amp;#39;m aware, I have the genes for full lactase persistence. They don&amp;#39;t just get shut off if you stop consuming diary for a while, do they?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/askscience/comments/vo6d3u/if_you_have_the_genes_for_lactase_persistence/",
  "subreddit": "askscience",
  "id": "vo6d3u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This question seems to come up often, but is riddled with anecdotes that don't\nmake things clear. I've seen people talk about stopping diary then becoming\nintolerant after doing that for a number of months - but were they always\nintolerant (had no lactase enzymes) and just never knew it?\n\nI'm aware…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問はよく出るようだが、そうでない逸話が多い。\nが多い。日記をやめてから、不寛容になったという話を見たことがあります。\nしかし、彼らは常に不耐症（ラクターゼ酵素がない）だったのでしょうか？\nラクターゼ酵素がない）ので、気づかなかっただけなのでしょうか？\n\n自覚はあるのですが・・・。",
      "title": "ヨーロッパの人々に多いようなラクターゼ持続性の遺伝子を持っていても、一定期間、乳糖の摂取をやめると、乳糖の代謝能力が失われる可能性があるのですか、ラクターゼの生産は、常に摂取しないと止まってしまうのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题似乎经常出现，但充斥着各种奇闻轶事，不\n使事情变得清晰。我见过有人说到停止写日记然后变得\n变得不耐受--但是他们一直都是不耐受的吗？\n不耐受（没有乳糖酶），只是不知道而已？\n\n我知道...",
      "title": "如果你有乳糖酶持续存在的基因，如在欧洲人群中很常见，但在一段时间内停止食用乳糖，是否有可能失去代谢乳糖的能力，在没有持续摄入的情况下，乳糖酶的产生是否停止？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題似乎經常出現，但充斥着各種奇聞軼事，不\n使事情變得清晰。我見過有人說到停止寫日記然後變得\n變得不耐受--但是他們一直都是不耐受的嗎？\n不耐受（沒有乳糖酶），只是不知道而已？\n\n我知道...",
      "title": "如果你有乳糖酶持續存在的基因，如在歐洲人羣中很常見，但在一段時間內停止食用乳糖，是否有可能失去代謝乳糖的能力，在沒有持續攝入的情況下，乳糖酶的產生是否停止？"
    }
  ]
}