{
  "author": "Daytona116595RBOW",
  "the_new_excerpt": "$NOK unfortunately got lumped into the memification of the stock market.\nHowever, that's only because there was some post with very well thought out DD\non the stock, there was a few posts so people jumped on it and included it in\nthe lump of other moon missions.\n\n\nNOKIA & TELECOM:\n\nNokia is no…",
  "original_created_utc": 1612272285,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$NOK不幸被归入股市的追忆化。\n不过，这只是因为有一些帖子里有很好的思想DD\n在股票上，有几个帖子，所以人们跳到它，并将其列入\n其他月球任务的疙瘩。\n\n\nNOKIA与电信。\n\n诺基亚不是...",
      "title": "$NOK DD：（警告这不是一个备忘录月球任务）为什么$NOK在2月4日的收益之前被低估了&为什么我做多$NOK。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$NOK不幸被歸入股市的追憶化。\n不過，這只是因爲有一些帖子裏有很好的思想DD\n在股票上，有幾個帖子，所以人們跳到它，並將其列入\n其他月球任務的疙瘩。\n\n\nNOKIA與電信。\n\n諾基亞不是...",
      "title": "$NOK DD：（警告這不是一個備忘錄月球任務）爲什麼$NOK在2月4日的收益之前被低估了&爲什麼我做多$NOK。"
    }
  ],
  "title": "$NOK DD: (warning this is not a meme moon mission) Why $NOK is undervalued ahead of February 4th Earnings & Why I'm Long $NOK.",
  "created_utc": 1612283549,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>$NOK unfortunately got lumped into the memification of the stock market. However, that&#39;s only because there was some post with very well thought out DD on the stock, there was a few posts so people jumped on it and included it in the lump of other moon missions.</p>\n\n<h1>Nokia &amp; Telecom:</h1>\n\n<p>Nokia is no longer the phone company you once knew. They are now involved in building global telecoms equipment, and heavily involved in 4g and 5g. The telecoms equipment marketplace is dominated by three key players:</p>\n\n<ul>\n<li>Nokia</li>\n<li>Ericsson AB</li>\n<li>Huawei Technologies Co.</li>\n</ul>\n\n<p>These companies build infrastructure for broadband internet and cellphone connections. They also build the networks that factories, hospitals and anything else that relies on communication uses.Important to note that of those 3 companies China and Huawei have taken a lot of hat from not only the United States but also the U.K. France and potentially other countries in the future. <strong>THE WORLD is becoming more and more dependent on two companies Nokia and Ericsson.</strong></p>\n\n<h1>Ericsson AB:</h1>\n\n<p>Ericsson reported earnings last week, in their earnings report they made a note that they had gained market share in Europe. Ericsson has proved it is becoming a more profitable 5g player....as a result of their better than expected earnings the stock had an 8% increase.</p>\n\n<h1>5G:</h1>\n\n<p>I think we can all understand that 5g is the future, it&#39;s going to be incredible technology once it is even more widely available. It&#39;s very possibly in the not too distant future &quot;cord cutting&quot; will not only be speaking about moving to a streaming live TV company but also your internet connection. 5G is capable of being incredibly fast, 10gbps fast. If you&#39;re paying for 1gbps from a cable tv provider, but can get 10gbps from your phone (or a home router that uses a cellphone tower instead of fiber optic cables) it has the potential to change the way consumers think about getting access to the web. There are dozens of benefits to 5g....one that I personally think will be vital for the way the world is shifting is in the form of <strong>AUTONOMOUS VEHICLES.</strong> 5G plays an important role in the use and advancement of autonomous vehicles.</p>\n\n<h1>Other News From Nokia:</h1>\n\n<p>There is plenty of other highlights I&#39;ll leave out of here for the sake of not making this post too long. Nokia is working with NASA to place cellular on the moon, they&#39;re also extremely focused on 5g.They have some interesting deals they&#39;ve announced recently as well. A few links:<br/>\n<a href=\"https://www.pymnts.com/news/partnerships-acquisitions/2021/google-cloud-nokia-join-forces-on-cloud-native-5g-products/\">Nokia + Google</a><br/>\n<a href=\"https://www.mobileworldlive.com/asia/asia-news/starhub-teams-with-nokia-on-sa-5g-rollout\">Nokia + Starhub</a><br/>\n<a href=\"https://www.nokia.com/about-us/news/releases/2020/10/19/nokia-selected-by-nasa-to-build-first-ever-cellular-network-on-the-moon/\">Nokia + NASA</a><br/>\n<a href=\"https://www.gizmochina.com/2021/02/01/hmd-global-planning-to-launch-affordable-nokia-5g-in-india-2021/\">Nokia + Affordable Cell Phones in India</a><br/>\n<a href=\"https://www.bizjournals.com/dallas/news/2021/01/25/nokia-ed-cholerton.html\">Nokia&#39;s New NA President</a></p>\n\n<h1>Earnings:</h1>\n\n<p>Nokia is set to report earnings on February 4th. They&#39;ve already had an upgrade from DNB Markets after Ericsson had a blowout quarter. $NOK has had some movement upwards in the last few days, but I still feel this is a good <strong>LONG TERM HOLD</strong>. Sorry for anyone here trying to get a 400% return in a week like the fiasco last week...but that was likely a once in a lifetime opportunity.</p>\n\n<h1>Positions:</h1>\n\n<p>I&#39;m long $NOK. I have LEAPS with a $10 strike that expire January 2022. I also have some shorter term call options that expire this Friday, I plan to let those expire ITM and keep the shares. Over the next year to 3 years I&#39;ll be planning on holding 2-5% of Nokia in relation to my total portfolio. I think its a safe bet with the direction of 5g...and it has high potential with all of the places 5g can be implemented.</p>\n</div><!-- SC_ON -->",
  "score": 467,
  "permalink": "/r/stocks/comments/lavdhb/nok_dd_warning_this_is_not_a_meme_moon_mission/",
  "subreddit": "stocks",
  "id": "lavdhb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541045
}