{
  "author": "alfred_27",
  "original_created_utc": 1634908663,
  "title": "What are some of the things you feel would be the death of Crypto, like full scale dead to the ground death?",
  "created_utc": 1634931340,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry to bring in some pessimism in this optimistic run of form we are having but I have this inate nature to become a little skeptical when something good happens so was wondering this question, <em>what will be the signal for the death of Crypto and when will it happen if it does</em></p>\n\n<p>I have some invested in various coins and definitely going to be accumulating more as time passes, but as the bag gets bigger (for example 100k plus) in the years you&#39;re going to start questioning <em>wait what if I suddenly lose everything, what if this entire project fails, the 5 or so years of effort and time is gone to waste</em></p>\n\n<p>I know the tendancy to become more paranoid as your investment grows. This is for those who have gone in 100% into this project and slowly started accumulating that it grows by a large amount in few years.</p>\n\n<p>I don&#39;t know about everyone else but as much as I believe in something I reserve to being skeptical in nature.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/qdgr4w/what_are_some_of_the_things_you_feel_would_be_the/",
  "subreddit": "CryptoCurrency",
  "id": "qdgr4w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sorry to bring in some pessimism in this optimistic run of form we are having\nbut I have this inate nature to become a little skeptical when something good\nhappens so was wondering this question, what will be the signal for the death of\nCrypto and when will it happen if it does\n\nI have some invested…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この楽観的な流れの中で悲観的な意見を持ち込んで申し訳ないが\nしかし、私には、何か良いことがあると、少し懐疑的になってしまう性質がある。\n疑問に思っていたのですが、暗号の死のシグナルは何だろうか？\n暗号の死のシグナルは何なのか、それが起こるとしたらいつなのか。\n\n私はいくつかの投資をしていますが...",
      "title": "Cryptoが死ぬとしたら、どのようなことが挙げられますか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很抱歉在我们这种乐观的状态下带来了一些悲观情绪\n但我有这样的天性，当有好的事情发生时，我会变得有点怀疑。\n所以我想知道这个问题，什么会是加密货币死亡的信号？\n如果它发生，什么时候会发生？\n\n我有一些投资...",
      "title": "你觉得有哪些东西会成为加密货币的死亡，比如说全面的死于非命？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很抱歉在我們這種樂觀的狀態下帶來了一些悲觀情緒\n但我有這樣的天性，當有好的事情發生時，我會變得有點懷疑。\n所以我想知道這個問題，什麼會是加密貨幣死亡的信號？\n如果它發生，什麼時候會發生？\n\n我有一些投資...",
      "title": "你覺得有哪些東西會成爲加密貨幣的死亡，比如說全面的死於非命？"
    }
  ]
}