{
  "author": "ultron290196",
  "the_new_excerpt": "The total gold supply right now is roughly 200,000 tonnes which leads to per\ncapita distribution of roughly 33g each.\n\nBitcoin will have max supply of 21 million coins and doing the same calculation,\none person needs to hold only 0.003 BTC to be considered above average.\n\nApplying the same logic to…",
  "original_created_utc": 1617793165,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在の金の総供給量は約20万トンで、一人当たりの分配量は約33gとなります。\n一人当たりの分配量は約33gとなります。\n\nビットコインの最大供給量は2,100万コインで、同じ計算をすると\n同じ計算をすると、1人が平均以上とみなされるには、わずか0.003BTCを保有する必要があります。\n\n同じ論理を適用すると...",
      "title": "FUN FACT: たった125個の月があれば、月に恵まれていると言えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在黄金的总供应量大概是20万吨，这就导致每\n人均分配大概每人33g。\n\n比特币的最大供应量将达到2100万枚币，做同样的计算。\n一个人只需要持有0.003个BTC就可以被认为是高于平均水平。\n\n将同样的逻辑应用到...",
      "title": "有趣的是：你只需要125个月亮就可以被认为是月亮富翁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在黃金的總供應量大概是20萬噸，這就導致每\n人均分配大概每人33g。\n\n比特幣的最大供應量將達到2100萬枚幣，做同樣的計算。\n一個人只需要持有0.003個BTC就可以被認爲是高於平均水平。\n\n將同樣的邏輯應用到...",
      "title": "有趣的是：你只需要125個月亮就可以被認爲是月亮富翁。"
    }
  ],
  "title": "FUN FACT: You need only 125 moons to be considered moon rich.",
  "created_utc": 1617814291,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The total gold supply right now is roughly 200,000 tonnes which leads to per capita distribution of roughly 33g each. </p>\n\n<p>Bitcoin will have max supply of 21 million coins and doing the same calculation, one person needs to hold only 0.003 BTC to be considered above average.</p>\n\n<p>Applying the same logic to moons, the max supply is capped at 250 million. And our current subreddit user count is 2 million. Hence, each person should roughly have 125 moons each. </p>\n\n<p>So, if you have more than 125 moons, you can be proud to know that you have already beaten the current average.</p>\n\n<p>The average will keep getting lower the more our subreddit users grows.</p>\n\n<p>So continue contributing and get your share.</p>\n</div><!-- SC_ON -->",
  "score": 275,
  "permalink": "/r/CryptoCurrency/comments/mlzj9d/fun_fact_you_need_only_125_moons_to_be_considered/",
  "subreddit": "CryptoCurrency",
  "id": "mlzj9d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876912
}