{
  "author": "tldrthestoryofmylife",
  "original_created_utc": 1655772862,
  "title": "A Software Developer's Take: Why Solana is the Biggest Scam in Crypto",
  "created_utc": 1655779292,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; Solana could literally be replaced with a SQL database at this point; you&amp;#39;d get as much scalability as you want, and there would be no tradeoff in decentralization b/c the chain has none to begin with. &lt;strong&gt;People in crypto don&amp;#39;t actually want to get rid of the banks; they just want to be the first to get in on the bank that will give them the biggest yields.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been said here before, but Solana is a scam: I knew it from the second I heard the CEO of the development company describe the &amp;quot;network switch model&amp;quot; of &amp;quot;doing one thing (high scalability and throughput for dApps) and doing it well&amp;quot;. Here&amp;#39;s my reasoning:&lt;/p&gt;\n\n&lt;p&gt;I work in the tech industry, and I can show you a ledger that can scale faster and for cheaper than Solana right now. Moreover, it&amp;#39;s more stable and you&amp;#39;ll have next to no problems using it b/c &lt;em&gt;the underlying tech has already been in use since the &amp;#39;70s&lt;/em&gt;!&lt;/p&gt;\n\n&lt;p&gt;... It&amp;#39;s called a SQL database. It can handle millions of TPS even without complex scaling schemes, and it gets faster as you add more machines to it. You can run pretty much any financial application you want on top of it with no problems b/c, in fact, &lt;em&gt;all of traditional finance is already built on top of it&lt;/em&gt;. Instead of using a complex language like Solidity or Rust, devs can literally use JavaScript. You can even log into it with your Facebook account!&lt;/p&gt;\n\n&lt;p&gt;The problem is: What I&amp;#39;m describing is 100% centralized. In fact, it&amp;#39;s literally the technical foundation for all centralization of data; it&amp;#39;s the bookkeeping layer behind the billions and trillions of dollars that the banks and big tech are screwing people out of every day (the &lt;em&gt;settlement layer&lt;/em&gt;, if you will).&lt;/p&gt;\n\n&lt;p&gt;The point I&amp;#39;m getting at is that: &lt;strong&gt;If you have a ledger that can be rolled back at the discretion of a central group of authorities, then it&amp;#39;s literally a glorified database being run by a glorified bank.&lt;/strong&gt; If you have no problem with this, then you&amp;#39;re in crypto for the wrong reasons; therefore, I suggest it&amp;#39;s time to reexamine things.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 359,
  "permalink": "/r/CryptoCurrency/comments/vh0ors/a_software_developers_take_why_solana_is_the/",
  "subreddit": "CryptoCurrency",
  "id": "vh0ors",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TL;DR: Solana could literally be replaced with a SQL database at this point;\nyou'd get as much scalability as you want, and there would be no tradeoff in\ndecentralization b/c the chain has none to begin with. People in crypto don't\nactually want to get rid of the banks; they just want to be the…"
}