{
  "author": "tldrthestoryofmylife",
  "original_created_utc": 1655772862,
  "title": "A Software Developer's Take: Why Solana is the Biggest Scam in Crypto",
  "created_utc": 1655779292,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; Solana could literally be replaced with a SQL database at this point; you&amp;#39;d get as much scalability as you want, and there would be no tradeoff in decentralization b/c the chain has none to begin with. &lt;strong&gt;People in crypto don&amp;#39;t actually want to get rid of the banks; they just want to be the first to get in on the bank that will give them the biggest yields.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s been said here before, but Solana is a scam: I knew it from the second I heard the CEO of the development company describe the &amp;quot;network switch model&amp;quot; of &amp;quot;doing one thing (high scalability and throughput for dApps) and doing it well&amp;quot;. Here&amp;#39;s my reasoning:&lt;/p&gt;\n\n&lt;p&gt;I work in the tech industry, and I can show you a ledger that can scale faster and for cheaper than Solana right now. Moreover, it&amp;#39;s more stable and you&amp;#39;ll have next to no problems using it b/c &lt;em&gt;the underlying tech has already been in use since the &amp;#39;70s&lt;/em&gt;!&lt;/p&gt;\n\n&lt;p&gt;... It&amp;#39;s called a SQL database. It can handle millions of TPS even without complex scaling schemes, and it gets faster as you add more machines to it. You can run pretty much any financial application you want on top of it with no problems b/c, in fact, &lt;em&gt;all of traditional finance is already built on top of it&lt;/em&gt;. Instead of using a complex language like Solidity or Rust, devs can literally use JavaScript. You can even log into it with your Facebook account!&lt;/p&gt;\n\n&lt;p&gt;The problem is: What I&amp;#39;m describing is 100% centralized. In fact, it&amp;#39;s literally the technical foundation for all centralization of data; it&amp;#39;s the bookkeeping layer behind the billions and trillions of dollars that the banks and big tech are screwing people out of every day (the &lt;em&gt;settlement layer&lt;/em&gt;, if you will).&lt;/p&gt;\n\n&lt;p&gt;The point I&amp;#39;m getting at is that: &lt;strong&gt;If you have a ledger that can be rolled back at the discretion of a central group of authorities, then it&amp;#39;s literally a glorified database being run by a glorified bank.&lt;/strong&gt; If you have no problem with this, then you&amp;#39;re in crypto for the wrong reasons; therefore, I suggest it&amp;#39;s time to reexamine things.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 359,
  "permalink": "/r/CryptoCurrency/comments/vh0ors/a_software_developers_take_why_solana_is_the/",
  "subreddit": "CryptoCurrency",
  "id": "vh0ors",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TL;DR: Solana could literally be replaced with a SQL database at this point;\nyou'd get as much scalability as you want, and there would be no tradeoff in\ndecentralization b/c the chain has none to begin with. People in crypto don't\nactually want to get rid of the banks; they just want to be the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR: Solanaは、現時点では、文字通りSQLデータベースと置き換えることができます。\n必要なだけのスケーラビリティを得ることができ、チェーンにはそもそも分散化がないため、トレードオフがない。\nチェーンにはそもそも分散性がないのですから。暗号を扱う人々は、実際に銀行をなくしたいと思っているわけではありません。\n暗号の人々は実際に銀行をなくしたいと思っているわけではなく、ただ...",
      "title": "ソフトウェア開発者が語る：Solanaが暗号界最大の詐欺である理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：在这一点上，Solana完全可以用一个SQL数据库来代替。\n你可以得到你想要的可扩展性，而且在去中心化方面没有任何权衡。\n去中心化，因为这个链子本来就没有。从事加密货币的人并不\n其实并不想摆脱银行，他们只是想成为银行的一员。",
      "title": "一个软件开发者的观点：为什么索拉纳是加密货币中最大的骗局？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：在這一點上，Solana完全可以用一個SQL數據庫來代替。\n你可以得到你想要的可擴展性，而且在去中心化方面沒有任何權衡。\n去中心化，因爲這個鏈子本來就沒有。從事加密貨幣的人並不\n其實並不想擺脫銀行，他們只是想成爲銀行的一員。",
      "title": "一個軟件開發者的觀點：爲什麼索拉納是加密貨幣中最大的騙局？"
    }
  ]
}