{
  "author": "thesleepingdog",
  "original_created_utc": 1626830771,
  "title": "I recently learned of Joseph Stalin's string of underage mistresses, particularly with a 13 year old Siberian girl, Lydia Perelygino. Possibly NSFW Questions:",
  "created_utc": 1626845589,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had never read of Stalin&#39;s time in exile with such detail until recently, nor did I realize he has (likely quite a few, and definitely one proved by a DNA test) direct descendants living to this day.</p>\n\n<p>I would be quite curious to learn a bit more about marriageable age and thoughts around consent at this time in a place like Kureika, Siberia where the...relationship?....occured and how Stalin&#39;s relationship with the young girl might have been viewed at this time (1910s). </p>\n\n<p>I believe the article ( <a href=\"https://www.dailymail.co.uk/news/article-454291/Stalin-lover-aged-13.html\">https://www.dailymail.co.uk/news/article-454291/Stalin-lover-aged-13.html</a>  Excerpt from &#39;Young Stalin by Simon Sebag Montefiore) said 14 year olds were considered eligible to marry at the time, and particularly in remote Siberia. Although, it appears that his relationship with this child was only seen as somewhat scandalous, and perhaps not because of her age, but more because she and Stalin were un-wed while she was pregnant.</p>\n\n<p>Am I reading this correctly?  What insights could be found out there about Siberian culture and customs around sex, marriage, and procreation in that region and time period?  And how would this have been viewed by greater Russia, and Europe at the time?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/oofumo/i_recently_learned_of_joseph_stalins_string_of/",
  "subreddit": "AskHistorians",
  "id": "oofumo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had never read of Stalin's time in exile with such detail until recently, nor\ndid I realize he has (likely quite a few, and definitely one proved by a DNA\ntest) direct descendants living to this day.\n\nI would be quite curious to learn a bit more about marriageable age and thoughts\naround consent…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近までスターリンの亡命時代をこんなに詳しく読んだことはなかったし\nまた、スターリンの直系の子孫が今日まで生きていることも知りませんでした（かなりの数がいるでしょうし、間違いなくDNAテストで証明されています）。\n今日まで生きている直系の子孫がいることも知りませんでした。\n\n結婚適齢期や同意についての考え方など、もう少し詳しく知りたいと思います。\n承諾についてもう少し知りたいですね。",
      "title": "私は最近、スターリンが未成年の愛人を次々と作っていたことを知りました。特に13歳のシベリアの少女、リディア・ペレリジーノとの関係は大変興味深いものでした。NSFWの可能性のある質問です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "直到最近，我才读到斯大林流亡期间的细节，也没有意识到他有（很可能有不少人是通过DNA证明的）。\n我也没有意识到他有（可能是相当多的，而且肯定有一个通过DNA测试证明的\n的直系后裔生活到今天。\n\n我很想了解更多关于适婚年龄和想法的信息。\n围绕同意...",
      "title": "我最近了解到约瑟夫-斯大林的一连串未成年情妇，特别是与一个13岁的西伯利亚女孩莉迪亚-佩雷吉诺。可能是NSFW问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "直到最近，我纔讀到斯大林流亡期間的細節，也沒有意識到他有（很可能有不少人是通過DNA證明的）。\n我也沒有意識到他有（可能是相當多的，而且肯定有一個通過DNA測試證明的\n的直系後裔生活到今天。\n\n我很想了解更多關於適婚年齡和想法的信息。\n圍繞同意...",
      "title": "我最近了解到約瑟夫-斯大林的一連串未成年情婦，特別是與一個13歲的西伯利亞女孩莉迪亞-佩雷吉諾。可能是NSFW問題。"
    }
  ]
}