{
  "author": "NickBagelBoy",
  "original_created_utc": 1640671834,
  "title": "I have this constant feeling of waiting for something in life and want to see if others feel the same?",
  "created_utc": 1640719833,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not quite sure how to explain it. It&amp;#39;s not like I&amp;#39;m waiting for something bad or good. I just have this constant feeling that I&amp;#39;m waiting for something. Like my life doesn&amp;#39;t feel complete. I&amp;#39;m not sitting around doing nothing. I&amp;#39;m accomplishing some goals and making progress with life, good career and all, but something just feels missing. It&amp;#39;s really confusing and even more confusing now that I try to explain it. It&amp;#39;s just this &amp;quot;feeling&amp;quot;. Maybe it&amp;#39;s been because of lockdown, like I&amp;#39;m just waiting for it to be done to get back to normal but I really don&amp;#39;t know.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/rq8ni7/i_have_this_constant_feeling_of_waiting_for/",
  "subreddit": "TooAfraidToAsk",
  "id": "rq8ni7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not quite sure how to explain it. It's not like I'm waiting for something\nbad or good. I just have this constant feeling that I'm waiting for something.\nLike my life doesn't feel complete. I'm not sitting around doing nothing. I'm\naccomplishing some goals and making progress with life, good…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どう説明したらいいのか、よくわからないのですが。何かを待っているわけではないのです。\n悪いことでも良いことでもない。ただ、何かを待っているような感覚が常にあるんです。\n自分の人生が完結していないような。何もせずに座っているわけではありません。私は\n目標を達成し、人生を前進させる、いいことだ...。",
      "title": "私は人生で何かを待っているような感じを常に持っていて、他の人が同じように感じているかどうかを見てみたいのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不太清楚该如何解释。我并不像在等待什么\n坏事或好事。我只是一直有这种感觉，我在等待着什么。\n就像我的生活感觉并不完整。我不是无所事事地坐着。我正在\n完成了一些目标，在生活中取得了进展，很好...",
      "title": "我在生活中一直有这种等待的感觉，想看看其他人是否也有这种感觉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不太清楚該如何解釋。我並不像在等待什麼\n壞事或好事。我只是一直有這種感覺，我在等待着什麼。\n就像我的生活感覺並不完整。我不是無所事事地坐着。我正在\n完成了一些目標，在生活中取得了進展，很好...",
      "title": "我在生活中一直有這種等待的感覺，想看看其他人是否也有這種感覺？"
    }
  ]
}