{
  "author": "italiansomali",
  "the_new_excerpt": "COMPANY OVERVIEW\n\nPalantir technologies is an American software company founded in 2003 and\nheadquartered in Colorado that specializes in big data analytics.\n\nThey started building software for the intelligence community in the US to\nassist in counterterrorism investigations by helping them identify…",
  "original_created_utc": 1611279546,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "公司概述\n\nPalantir技术公司是一家美国软件公司，成立于2003年，是一家专业的软件公司。\n总部位于科罗拉多州，专门从事大数据分析的公司。\n\n他们开始为美国的情报界打造软件，以?\n协助反恐调查，帮助他们查明.。",
      "title": "在演示日之前完成PLTR DD（包括估值）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "公司概述\n\nPalantir技術公司是一家美國軟件公司，成立於2003年，是一家專業的軟件公司。\n總部位於科羅拉多州，專門從事大數據分析的公司。\n\n他們開始爲美國的情報界打造軟件，以?\n協助反恐調查，幫助他們查明.。",
      "title": "在演示日之前完成PLTR DD（包括估值）。"
    }
  ],
  "title": "Complete PLTR DD ahead of Demo Day (Valuation Included)",
  "created_utc": 1611284389,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Company Overview</h1>\n\n<p>Palantir technologies is an American software company founded in 2003 and headquartered in Colorado that specializes in big data analytics.</p>\n\n<p>They started building software for the intelligence community in the US to assist in counterterrorism investigations by helping them identify patterns hidden deep within large datasets.</p>\n\n<p>Later they realized that similarly to the intelligence community, commercial institutions did not have the most effective tools to manage and make sense of the data involved in large projects.</p>\n\n<p>Palantir has now developed two principal software platforms, Palantir Gotham which serves primarily the intelligence community, and Palantir Foundry for commercial purposes.</p>\n\n<p>Palantir went public on September 30, 2020 through a direct public offering. The company opened for trading at $10 a share, giving it an initial valuation of about $22B. As of the date of this publishing, Palantir stock is trading at $25.98, with a Market Cap of $44.26B, and 52-w high of $33.50.</p>\n\n<h1>Understanding the Business</h1>\n\n<p><strong>Value Proposition</strong></p>\n\n<p>Institutions often rely on various single-purpose software solutions which support the specific workflows of their operations such as customer relationship management and financial planning. Each new software creates a new silo within an already fragmented data landscape.</p>\n\n<p>When it comes to making operational decisions, institutions are left spending significant time and resources to unify their data. By the time the question is answered, the underlying data may be stale.</p>\n\n<p>A central operating system for data</p>\n\n<p>Palantir’s software allows institutions to reorganize the various independent data systems that support their operations into a unified data asset which facilitates advanced data analysis, knowledge management, and collaboration.</p>\n\n<p>Augmenting existing data systems, not displacing</p>\n\n<p>At a large manufacturer, Palantir does not build machine production ERP software, instead, Palantir’s software connects their production ERP data with other relevant systems. By integrating existing solutions into our central operating system, organizations can choose to maintain key historic investments without having to rebuild their entire data infrastructure.</p>\n\n<p>Making data actionable</p>\n\n<p>Gotham and Foundry enable their users to put data in context, using language that people understand. They transform data into objects that make sense to everyone in an organization. Data is represented not as cells in a spreadsheet, or exports from a single system, but as entities, events, relationships, consequences, and decisions.</p>\n\n<p>Their ontology management systems allow organizations to create their own description of the world, starting from a set of basic components: objects (such as people or events), properties (attributes), and relationships that tie objects together.</p>\n\n<p>Understand the history of data and decisions</p>\n\n<p>Palantir’s software tracks each piece of data in the system to its source and records all changes that have been made to a dataset or data object. Users can distinguish between data derived from a source system or data created by another user, and if a dataset has been updated/modified, the user can also identify the fact that the data was updated, the action, and the logic used to perform the update. This allows users to easily explain where the data, logic, and decisions originate.</p>\n\n<p>Enable users to work together even in the most complex circumstances</p>\n\n<p>The versioning and branching capabilities of their software enables thousands of users across departments and organizations to work on the same datasets, and actively collaborate on new models and analysis.</p>\n\n<p>Users can safely branch a view or a dataset into an isolated sandbox where the user is able to build or experiment as they wish and may merge successful experiments back into the main dataset. Each version of a dataset is saved so that it remains protected and available for concurrent access.</p>\n\n<p>Enforce rigorous and reliable data protection</p>\n\n<p>Palantir’s software was designed to embrace the complexity of security clearances, institutional boundaries, and varying data sensitivity levels. Organizations are able to secure each piece of information and define the privileges users require to perform a specific action on a specific resource. The central authorization system creates an audit trial of user activity which allows oversight officials to monitor behavior, identify potential violations, and investigate anomalies.</p>\n\n<p>AI/ML and operational change through data-driven decisions</p>\n\n<p>Their software infrastructure also enables organizations to combine simple math, third-party black box models, and machine trained models of the different components of their businesses in a graph made up of nodes (for example, each node can be a manufacturing unit and distribution site in a supply chain) where each model can describe the properties of a node, resulting in an interactive digital simulation of an entire supply chain.</p>\n\n<p>The AI/ML interface surfaces critical information about models, including plots, validation statistics, model stages, parameters and metadata.</p>\n\n<p><strong>Revenue Streams</strong></p>\n\n<p>Palantir’s revenue streams consists of their two main software, Gotham which was designed primarily for the defense and intelligence sectors, and Foundry for the commercial sector. However, the platforms are not exclusive to either sector, for example, Gotham is also offered to commercial customers in the financial services industry. The two platforms can either be used separately or bundled together as a single ecosystem.</p>\n\n<p>Currently, revenue is more or less evenly split between the government and commercial sector.</p>\n\n<p>It is important to note that for the government sector Palantir has to participate through a procurement process against other contractors who also sell custom tools.</p>\n\n<p>Gotham</p>\n\n<p>Its main tools include:</p>\n\n<p>Graph – a whiteboard like interface for users to explore, visualize, and interact with entities, their properties and their networks. Users can create or edit data in the graph and resolve duplicate objects to ensure robust data quality.</p>\n\n<p>Gaia – lets users plan, execute, and report on operations via a shared live map. Live maps track real-time data and users drag and drop objects from other Gotham applications directly into Gaia.</p>\n\n<p>Dossier – is a live collaboration document editor to share analysis and discover intelligence. Users can collaborate across teams and organizations to create a living, interactive, and up-to-date document.</p>\n\n<p>Video – an application designed to interact with both streaming and historical video data. Users can review video footage in the platform as well as enhance raw footage with geospatial information and overlays based on other data sources.</p>\n\n<p>Ava – an AI system which scans billions of data points in order to proactively assist investigations by alerting users to new, hard-to-find potential connections.</p>\n\n<p>Mobile – brings Gotham into the field via mobile devices to provide support to real-time, distributed operations.</p>\n\n<p>Foundry</p>\n\n<p>Monocle – enables users to understand data lineage using a graphical interface. Users can explore upstream dependencies or downstream consumers of data, as well as trace logic for a dataset back to its source.</p>\n\n<p>Contour – enables top down exploration of large-scale data. Users may filter, join, and visualize datasets to answer analytical questions and publish the results as a report or new dataset that will automatically update with the underlying datasets.</p>\n\n<p>Object Explorer – allows users to interact with data represented as objects – like customers, equipment, or plants – rather than rows in a table.</p>\n\n<p>Fusion – Foundry’s spreadsheet environment.</p>\n\n<p>Reports – allows users to publish their work from other applications in a document that dynamically updates as the underlying data changes.</p>\n\n<p>I strongly suggest watching <a href=\"https://palantir.events/livedemoday\">Palantir’s demo day</a> on January 26 to gain a better understanding of the tools provided by both software.</p>\n\n<p>Palantir’s Software Example Use Cases</p>\n\n<ul>\n<li>Humanitarian workers plan disaster relief missions following a natural disaster.</li>\n<li>Investigators receive alerts about open cases when new data about a suspect enters any system.</li>\n<li>Automotive plant engineers detect defects at their station while vehicles are still on assembly line.</li>\n<li>District attorney map out complex criminal networks in order to decide where to focus resources.</li>\n<li>Scientists use a unified view of cancer patients to personalize care.</li>\n</ul>\n\n<h1>Industry</h1>\n\n<p><strong>Market Size</strong></p>\n\n<p>As of Q3 2020 Palantir had 132 customers across 36 industries around the world.</p>\n\n<p>Currently, according to Palantir’s own estimates the Total Addressable Market (TAM) for their software across the commercial and government sectors around the world is approximately $119B. The TAM for the government sector is $63B and for the commercial sector $56B. Within the government TAM, $37B is international and $26B is domestic.</p>\n\n<p>According to <a href=\"https://www.statista.com/outlook/14000/100/software/worldwide\">Statista’s market forecast</a> revenue in the software market is expected to grow at an annual growth rate of 7.4% between 2021 and 2025.</p>\n\n<p><strong>Industry Fundamentals</strong></p>\n\n<p>Embrace digital transformation or risk getting disrupted</p>\n\n<p>It has become evident that companies which embrace digital transformation persist, while businesses that fail to transform or transform too late will disappear. According to a <a href=\"https://hbr.org/sponsored/2017/07/digital-transformation-is-racing-ahead-and-no-industry-is-immune-2\">Harvard Business Review report</a> digital disruption extinguished 52% of Fortune 500 companies between 2000 and 2017.</p>\n\n<p>We have repeatedly seen that pathbreaking institutions that use data to transform their core operations are the ones that win.</p>\n\n<p>Buy or Build</p>\n\n<p>Institutions often resort to the default approach of attempting to build a custom solution themselves. However, according to a recent <a href=\"https://www.standishgroup.com/about\">report by The Standish Group</a>, of 50,000 custom software projects from more than a 1,000 organizations, only 23% that were started from scratch were completed on time and on budget, while 56% of all projects were either overdue or over budget. Additionally, only 12% of organization-wide digital transformation projects were considered successful.</p>\n\n<p>Additionally, according to the <a href=\"https://www.businesswire.com/news/home/20200106005280/en/NewVantage-Partners-Releases-2020-Big-Data-and-AI-Executive-Survey\">NewVantage Partners 2020 Big Data and AI Executive Survey</a>, business adoption of Big Data continues to be a struggle, with 73.4% of firms citing this as an ongoing challenge.</p>\n\n<p>Palantir provides the example of a U.S. Military department which spent more than $1 billion building an enterprise resource planning system from scratch. The system was never delivered, and the project was terminated.</p>\n\n<p>Crisis &amp; Instability</p>\n\n<p>A <a href=\"https://www.appdynamics.com/blog/news/agents-of-transformation-report-2020/\">survey from AppDynamics</a> reports that 71% of IT professionals said COVID-19 has caused their businesses to implement digital transformation projects within weeks rather than the typical months or years, and 65% of respondents said they implemented digital transformation projects during the pandemic that had been previously dismissed.</p>\n\n<h1>Competitive Landscape &amp; Risks</h1>\n\n<p><strong>Competition</strong></p>\n\n<p>Palantir’s main competitors include:</p>\n\n<p>Internal software development – At first, organizations frequently attempt to build their own data platforms with the help of consultants, IT services companies, packaged and open-source software, and sizable internal IT resources.</p>\n\n<p>And two software companies with very similar business models:</p>\n\n<p><a href=\"https://www.alteryx.com/\">Alteryx</a> – founded 23 years ago and based in California, Alteryx is a public company with FY 2019 revenues of $418M and more than 1,290 employees. Alteryx is focused on providing solutions to the commercial sector and as of 2019 they had approximately 6,100 customers in more than 90 countries. Amongst their main customers are Chevron Corporation, Federal National Mortgage Association, Nasdaq Inc, Netflix, salesforce.com, Toyota, Twitter, and Uber Technologies.</p>\n\n<p><a href=\"https://www.semantic-ai.com/company\">Semantic AI</a> – is a privately-held software firm based in California, Semantic AI was founded in 2001 and after 9/11 it was used as “platform by choice” by the intelligence community. Similar to Palantir, they have gained significant adoption in the Defense and Law Enforcement communities and have recently launched their enterprise intelligence platform.</p>\n\n<p><strong>Competitive Strategy</strong></p>\n\n<p>Customer acquisition</p>\n\n<p>Palantir’s customer acquisition strategy targets large-scale, hard-to-execute opportunities at large government and commercial institutions. The high installation costs, high failure risks, complexity of data environments, and the long sales cycle associated with these opportunities raise the barriers to entry for competition.</p>\n\n<p>Additionally, in the first phase of Palantir’s customer acquisition strategy, they provide minimal risk to their customers through short-term pilot deployments of their software at no or low cost to them. As the customer increases the usage of the platform across its operations, Palantir’s revenue and margins grow significantly.</p>\n\n<p>Software engineers on the front line</p>\n\n<p>In order to fully address the most complex challenges of their customers, Palantir sends their Forward Deployed Engineers (FDEs), in order to experience and understand the problem firsthand. By working alongside their customers, FDEs gain a deep understanding of their needs, how and why they make decisions, and how they calculate trade-offs.</p>\n\n<p>Leverage experience in both private and public sector</p>\n\n<p>To the commercial sector, Palantir offers software which was designed to be secure enough to handle national secrets and stable enough to support soldiers’ wartime decisions. To the government sector, they offer software which incorporates and reflects Palantir’s experience of working across 36 industries and years spent in the field.</p>\n\n<p>Palantir’s strategic relationships last for years</p>\n\n<p>By the end of 2019, Palantir’s top 20 customers had an average relationship of 6.6 years.</p>\n\n<p>Palantir has chosen sides</p>\n\n<p>Their software is exclusively available to the United States and its allies in Europe and around the world.</p>\n\n<p><strong>Growth Strategy</strong></p>\n\n<p>Become the industry default</p>\n\n<p>Palantir’s current and potential customers are some of the largest enterprise in the world. They intend to broaden the platform’s reach through partnerships that establish their platforms as the central operating system for entire industries.</p>\n\n<p>This model has been successfully implemented in the aviation industry where, through its partnership with Airbus, work with more than a 100 airlines and 15 airline suppliers.</p>\n\n<p>Continue to grow their direct sales force</p>\n\n<p>Palantir’s decision to grow their sales force in recent years has resulted in a number of significant new customers, including Fortune 100 companies as well as a number of leading government agencies in the U.S. and other countries.</p>\n\n<p>Increase their reach with existing customers</p>\n\n<p>To drive revenue growth at an account, Palantir uses a number of sales and marketing strategies which include:</p>\n\n<ul>\n<li>Creating partnerships to extend the platform beyond the customer’s four walls into the operations of their partners and suppliers</li>\n<li>Selling additional productized cross-industry software capabilities</li>\n<li>Selling strategic implementations of Palantir’s software against specific use cases</li>\n</ul>\n\n<p>For Q3 2020 Palantir’s average revenue per customer had increased 38% compared to the same period last year.</p>\n\n<p>Become the default operating system for the U.S. government</p>\n\n<p>Palantir’s software has been tested and improved over years of use across industries and various government agencies in the U.S. who have been able to deploy Palantir’s platforms rapidly with minor configurations.</p>\n\n<p>Palantir already works with government agencies such as the U.S. Army, Navy, and Airforce, CDC, Department of Homeland Security, FDA, and SEC.</p>\n\n<p>New methods of customer acquisition and partnership</p>\n\n<p>As Palantir considers growing into new markets outside the U.S., they may consider entering into partnerships with strategic organizations that operate in their target market.</p>\n\n<p>For example, in Japan they launched a partnership with SOMPO Holdings, Inc.. one of the largest insurance companies in the country, to help grow their commercial and government business in the Japanese market.</p>\n\n<p><strong>Moats</strong></p>\n\n<p>R&amp;D expenditure</p>\n\n<p>Since 2008 and up to 2019, they have invested a total of $1.5B in research and development.</p>\n\n<p>Network effects</p>\n\n<p>Every data source that is integrated to the system, and every action taken by a developer, data scientist, or operational user, is made accessible to all other users at the institution.</p>\n\n<p>At a financial services customer, network effects enabled Palantir’s software to scale from a single use case to more than 70 workstreams across compliance, front office, risk, and internal audit desks. Each new application was built on a shared foundation of integrated systems, user groups, and existing applications.</p>\n\n<p>Additionally, each customer on their platform generates network effects. Palantir can leverage the knowledge acquired and capabilities developed for a customer within a specific industry and incorporate it into the platform for the benefit of all customers across industries. For example, capabilities of Palantir’s platform that were originally developed to help optimize production of crude oil, has been adapted by manufacturers of medical equipment to optimize supply chains.</p>\n\n<p>In addition to supporting individual institutions, Palantir’s platforms have the capacity to become the central operating system for entire industries and sectors.</p>\n\n<p>Regulation</p>\n\n<p>Section 2377 of the Federal Acquisition Streamlining Act (“FASA”) requires the U.S. government to first consider readily available commercial items before pursuing acquisition of custom developed items. Palantir’s software is a commercial item within the meaning of the law. A custom government solution built by a consulting company, is not.</p>\n\n<p>In 2016, Palantir won a lawsuit against the Army, challenging its decision to pursue a software development contract for the replacement of its battlefield intelligence system. In 2018, the ruling was upheld, and the US Court of Appeals ordered the Army to consider existing commercially available products. After testing real products, the Army selected Palantir’s software to deploy tactical units across the force.</p>\n\n<p><strong>Other Relevant Risks</strong></p>\n\n<p>Privacy and civil liberties</p>\n\n<p>Palantir is not in the business of collecting, mining, or selling data. They build software platforms that enable customers to integrate their own data – data they already have. Palantir claims to be committed to ensuring their software is effective as possible while preserving individuals’ fundamental rights to privacy and civil liberties.</p>\n\n<p>Customer concentration</p>\n\n<p>For the 9 months ended September 2020, Palantir’s top 3 customers accounted for 27% of their revenue.</p>\n\n<h1>Financial Summary</h1>\n\n<p><strong>Proforma Balance Sheet</strong></p>\n\n<p><a href=\"https://postimg.cc/ykzC91FN\">https://postimg.cc/ykzC91FN</a></p>\n\n<p><strong>Income Statement</strong></p>\n\n<p><a href=\"https://postimg.cc/yD1qQLp4\">https://postimg.cc/yD1qQLp4</a></p>\n\n<p>Palantir’s revenue has had a CAGR of 68.8% since inception, and 27.6% for the last three years.</p>\n\n<p>For the 9 months ended September 2020 compared to the same period last year:</p>\n\n<ul>\n<li>Revenue of the government sector increased by $177M (73%), of the increase 84% was from existing customers.</li>\n<li>Revenue of the commercial sector increased by $80M (30%).</li>\n<li>COGS, Sales and Marketing, R&amp;D, and SG&amp;A expense increases consist primarily of an increase in stock-based compensation expense primarily due to recognition of cumulative stock-based compensation expense upon the Direct Listing related to the company’s restricted stock units. The increase was partially offset by a decrease in traveling expense related to the COVID-19 pandemic.</li>\n</ul>\n\n<p>Palantir uses a Contribution Margin as a key business metric to evaluate their financial performance, which has improved consistently over the last 4 quarters. In short, by achieving a higher contribution margin, the increase in revenue required for Palantir to break-even is smaller.</p>\n\n<p><strong>Proforma Cashflow Statement</strong></p>\n\n<p><a href=\"https://postimg.cc/64CsSgNw\">https://postimg.cc/64CsSgNw</a></p>\n\n<p>For the 9 months ended September 2020:</p>\n\n<p>Net cash provided by financing activities consist primarily of proceeds from the issuance of common stock</p>\n\n<h1>Investment Decision</h1>\n\n<p><strong>Valuation Results</strong></p>\n\n<p><a href=\"https://postimg.cc/kBF3v0cv\">https://postimg.cc/kBF3v0cv</a></p>\n\n<p>The result of my <a href=\"https://docs.google.com/spreadsheets/d/1zMy8dkNFib7h-FkFtPZMf9bhH8DjE3XKf5t-HB_c5eY/edit?usp=sharing\">Valuation Model</a> indicate a <strong>Value of Equity per share of $28.38</strong></p>\n\n<p>Mayor assumptions of the valuation model include:</p>\n\n<ul>\n<li>By 2031, Palantir will gain 6% Market Share of a $119B market that grows 7.4% annually. This implies Palantir’s revenue will grow at a CAGR of 30% for 10 years.</li>\n<li>Palantir will achieve US GAAP operating margins of 23% by 2031.</li>\n<li>Terminal year growth rate of 5% and WACC of 7.5% after reaching a Beta of 1.0.</li>\n<li>Risk free rate of 2.5% and Equity Risk Premium of 5.5%</li>\n</ul>\n\n<p>Follow the link to view the valuation model, it include references to all assumptions. Please feel free to download it, play with it, and share your conclusions.</p>\n\n<p><strong>Investment Decision</strong></p>\n\n<p>I believe that at its current price PLTR is a buy opportunity for the following reasons:</p>\n\n<ul>\n<li>The model’s revenue and margin growth assumptions are achievable and likely to be exceeded if PLTR successfully executes their growth strategies.</li>\n<li>The industry is driven by strong fundamentals, organizations that do not embrace digital transformation and big data will cease to exist.</li>\n<li>Even though Palantir’s moat is currently narrow, it could expand significantly if they are successful in establishing their software as a central operating system for various industries.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 3034,
  "permalink": "/r/stocks/comments/l2d1wp/complete_pltr_dd_ahead_of_demo_day_valuation/",
  "subreddit": "stocks",
  "id": "l2d1wp",
  "is_self": true,
  "media": null,
  "is_video": false
}