{
  "author": "lam4_",
  "original_created_utc": 1643937964,
  "title": "Since Facebook/Meta lost $237 billion in market value today, which is the largest one-day loss ever in the market. What does it mean for the Metaverse and crypto coins associated with it?",
  "created_utc": 1643949076,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Meta also said the augmented and virtual reality business at the heart of its metaverse plans is generating revenue but is unprofitable. &lt;/p&gt;\n\n&lt;p&gt;I would expect a price drop in the three following cryptos as they are associated with the meta verse.&lt;/p&gt;\n\n&lt;p&gt;-Mana\n-Sand\n-AXS&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m calling it right now, the metaverse will be a big failure. The only reason the metaverse seems so popular is because of the advertisements and the amount of memes. Nobody is going out of their way to buy an Oculus headset for $400 and try to bid on a house to be snoop doggs neighbors.&lt;/p&gt;\n\n&lt;p&gt;Facebook is losing 1 million users daily. It&amp;#39;s very possible that the Facebook Era goes downhill from here on out.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 350,
  "permalink": "/r/CryptoCurrency/comments/sk0fix/since_facebookmeta_lost_237_billion_in_market/",
  "subreddit": "CryptoCurrency",
  "id": "sk0fix",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Meta also said the augmented and virtual reality business at the heart of its\nmetaverse plans is generating revenue but is unprofitable. \n\nI would expect a price drop in the three following cryptos as they are\nassociated with the meta verse.\n\n-Mana -Sand -AXS\n\nI'm calling it right now, the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メタはまた、同社の中核をなす拡張現実と仮想現実のビジネスについて、次のように述べています。\nメタバース計画では、収益は上がっているが、採算が取れていない。 \n\n以下の3つのクリプトは、価格下落が予想されます。\nメタバースを連想させる。\n\n-マナ -サンド -AXS\n\n今、呼んでいるのは、その...",
      "title": "Facebook/Metaは今日、2370億ドルの市場価値を失い、これは1日の市場損失としては過去最大となったので。メタバースやそれに関連する暗号コインにはどのような意味があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美达公司还表示，作为其元空间计划核心的增强型和虚拟现实业务正在产生收入，但没有盈利。\n元数据计划的核心是增强和虚拟现实业务，正在产生收入，但无利可图。 \n\n我预计以下三种加密货币的价格会下降，因为它们是\n与meta verse有关。\n\n-Mana -Sand -AXS\n\n我现在就叫它，...",
      "title": "由于Facebook/Meta今天损失了2370亿美元的市值，这是市场上有史以来最大的单日损失。这对Metaverse和与之相关的加密货币意味着什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美達公司還表示，作爲其元空間計劃核心的增強型和虛擬現實業務正在產生收入，但沒有盈利。\n元數據計劃的核心是增強和虛擬現實業務，正在產生收入，但無利可圖。 \n\n我預計以下三種加密貨幣的價格會下降，因爲它們是\n與meta verse有關。\n\n-Mana -Sand -AXS\n\n我現在就叫它，...",
      "title": "由於Facebook/Meta今天損失了2370億美元的市值，這是市場上有史以來最大的單日損失。這對Metaverse和與之相關的加密貨幣意味着什麼？"
    }
  ]
}