{
  "author": "com2420",
  "original_created_utc": 1642163241,
  "title": "Islam is famously aniconic, especially of the prophet Muhammad. In the early 14th-century, a manuscript, Jami' al-Tarwarikh, was completed by a Muslim author, Rashid-al-din Hamadani. It depicts an image of Muhammad receiving a revelation from Gabriel. Why was this allowed?",
  "created_utc": 1642183033,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand that Hamadani was born into a Jewish family and later converted to Islam and that he was born under Mongol rule. May this have anything to do with it? Or is it more simple, like a misunderstanding of how aniconism works in Islam?&lt;/p&gt;\n\n&lt;p&gt;Edit: spelling&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/AskHistorians/comments/s3r78i/islam_is_famously_aniconic_especially_of_the/",
  "subreddit": "AskHistorians",
  "id": "s3r78i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand that Hamadani was born into a Jewish family and later converted to\nIslam and that he was born under Mongol rule. May this have anything to do with\nit? Or is it more simple, like a misunderstanding of how aniconism works in\nIslam?\n\nEdit: spelling",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハマダニはユダヤ人の家に生まれ、後に改宗したと聞いています。\nイスラム教で、モンゴルの支配下に生まれたこと。このことが関係しているのでしょうか。\nそれは？それとももっと単純に、アニコニズムの仕組みを誤解しているようなものなのでしょうか。\nイスラム教？\n\n編集：スペル",
      "title": "イスラム教は、特に預言者ムハンマドの異教徒として有名である。14世紀初頭、イスラム教の作家ラシード・アルディン・ハマダーニによって『ジャーミー・アル・タルワリク』という写本が完成された。そこには、ガブリエルから啓示を受けるムハンマドの姿が描かれている。なぜ、これが許されたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，哈马达尼出生在一个犹太家庭，后来皈依了伊斯兰教。\n伊斯兰教，而且他是在蒙古人统治下出生的。这是否有什么关系？\n有关系吗？还是更简单，比如对伊斯兰教的运作方式的误解？\n伊斯兰教的作用？\n\n编辑：拼写",
      "title": "伊斯兰教是著名的无名氏，尤其是先知穆罕默德。14世纪初，穆斯林作家拉希德-阿尔丁-哈马达尼完成了一份手稿《Jami' al-Tarwarikh》。它描绘了穆罕默德接受加布里埃尔的启示的形象。为什么会允许这样做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，哈馬達尼出生在一個猶太家庭，後來皈依了伊斯蘭教。\n伊斯蘭教，而且他是在蒙古人統治下出生的。這是否有什麼關係？\n有關係嗎？還是更簡單，比如對伊斯蘭教的運作方式的誤解？\n伊斯蘭教的作用？\n\n編輯：拼寫",
      "title": "伊斯蘭教是著名的無名氏，尤其是先知穆罕默德。14世紀初，穆斯林作家拉希德-阿爾丁-哈馬達尼完成了一份手稿《Jami' al-Tarwarikh》。它描繪了穆罕默德接受加布裏埃爾的啓示的形象。爲什麼會允許這樣做？"
    }
  ]
}