{
  "author": "_red_roof_",
  "the_new_excerpt": "Like in TV, books, and even online, people always talk about siblings as if\nthey're your closest friend and they're the person you could tell all your\nsecrets to and that you know them really well. But... has anyone else sort of\nhad the opposite experience?\n\nI'm not talking like your sibling was so…",
  "original_created_utc": 1616409221,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "就像在电视、书本，甚至是网络上，人们总是把兄弟姐妹说得好像\n他们是你最亲密的朋友 他们是你可以告诉你所有的人\n秘密，你很了解他们。但是... ...有没有其他人...\n有相反的经历吗？\n\n我不是说你的兄弟姐妹是如此... ...",
      "title": "有没有人只是有一个非常... ... \"嗯 \"与他们的兄弟姐妹的关系？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像在電視、書本，甚至是網絡上，人們總是把兄弟姐妹說得好像\n他們是你最親密的朋友 他們是你可以告訴你所有的人\n祕密，你很瞭解他們。但是... ...有沒有其他人...\n有相反的經歷嗎？\n\n我不是說你的兄弟姐妹是如此... ...",
      "title": "有沒有人只是有一個非常... ... \"嗯 \"與他們的兄弟姐妹的關係？"
    }
  ],
  "title": "Does anyone else just have a really... \"meh\" bond with their siblings?",
  "created_utc": 1616416560,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like in TV, books, and even online, people always talk about siblings as if they&#39;re your closest friend and they&#39;re the person you could tell all your secrets to and that you know them really well. But... has anyone else sort of had the opposite experience?</p>\n\n<p>I&#39;m not talking like your sibling was so toxic that you had to cut them off, because that would be a different situation, but does anyone else just sort of have a really &quot;meh&quot; bond with their sibling? Like with my sister, even after many years, I just don&#39;t really know her that well and even though she&#39;s family, she just feels kind of like a stranger. And it&#39;s not because she&#39;s a bad person or either of us dislike each other, we just find it kind of boring to be around the other. When we were kids we would fight a lot, I think possibly even more than the average siblings, and since we never really had a real bond, when she moved away it just kind of completely fizzled. She feels like an acquaintance at best that I can have lukewarm small talk with.</p>\n\n<p>I&#39;m fine with that, I&#39;m perfectly fine with just calling on birthdays and having 5 minute conversations with her, but I was wondering, is it the same with anyone else? You never really found your sibling to be your best friend or your worst enemy, they were just sort of... there? I feel like I can&#39;t really ask this question in real life, because everyone always expects everyone to have either a wonderful or absolutely horrible relationship with their family. And whenever I&#39;ve said it out loud, people always sort of look down on me for not being super super close to my sibling.</p>\n\n<p>But I really want to know, since I never see it shown online or in TV shows, does anyone else have the same experience? It&#39;s just sort of a &quot;meh&quot; bond with your sibling? They just kind of feel like a coworker you wouldn&#39;t really be interested in hanging out with, but you&#39;re fine with seeing occasionally?</p>\n</div><!-- SC_ON -->",
  "score": 271,
  "permalink": "/r/TooAfraidToAsk/comments/makct3/does_anyone_else_just_have_a_really_meh_bond_with/",
  "subreddit": "TooAfraidToAsk",
  "id": "makct3",
  "is_self": true,
  "media": null,
  "is_video": false
}