{
  "author": "TimThyTurtle",
  "the_new_excerpt": "$STNG $TNK $NAT $TK $FRO The Suez Canal blockage has lead to a surge in tanker\nrates and it’ll continue to rise the longer the ship remains stuck. They are\nalready rerouting ships around Africa which signals the blockage could last\nweeks and with shipping as tight as it already is, the rates are…",
  "original_created_utc": 1616838462,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$STNG $TNK $NAT $TK $FRO 苏伊士运河堵塞导致油轮数量激增。\n率，而且船被困的时间越长，它将继续上升。他们是\n绕着非洲的船只已经改道了，这预示着封锁可能会持续下去。\n周，而且由于运输已经很紧张，费率... ...",
      "title": "苏伊士运河油轮剧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$STNG $TNK $NAT $TK $FRO 蘇伊士運河堵塞導致油輪數量激增。\n率，而且船被困的時間越長，它將繼續上升。他們是\n繞着非洲的船隻已經改道了，這預示着封鎖可能會持續下去。\n周，而且由於運輸已經很緊張，費率... ...",
      "title": "蘇伊士運河油輪劇"
    }
  ],
  "title": "Suez Canal Tanker Play",
  "created_utc": 1616866495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>$STNG $TNK $NAT $TK $FRO\nThe Suez Canal blockage has lead to a surge in tanker rates and it’ll continue to rise the longer the ship remains stuck. They are already rerouting ships around Africa which signals the blockage could last weeks and with shipping as tight as it already is, the rates are going to skyrocket and kick start a new supercycle.</p>\n\n<p>Tankers in general were already seeing a recovery across the whole industry before the Suez Canal and now its being boosted even further. CEO and insiders, specifically $STNG and $NAT, are already buying stock/call options. </p>\n\n<p>They are all also trading below their net asset value with strong fundamental cash positions from the huge rate spike in Q1 and Q2 2020. </p>\n\n<p>My current positions are in calls, mostly in $STNG to play product tankers and $TNK to play crude.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/stocks/comments/meaofc/suez_canal_tanker_play/",
  "subreddit": "stocks",
  "id": "meaofc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141535
}