{
  "author": "Sundance37",
  "original_created_utc": 1653970672,
  "title": "Are we early, or do people just not care to learn.",
  "created_utc": 1654039913,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in finance, and can tell you, it is incredibly frustrating going to &lt;a href=\"/r/personalfinance\"&gt;/r/personalfinance&lt;/a&gt; and giving advice to people that just want to sit around smelling their own farts. That is a place where people are supposed to know what they are talking about, and practically everyone there thinks that finance, means budgeting. &lt;/p&gt;\n\n&lt;p&gt;Financing has been around for thousands of years, and yet people have very little basic knowledge about even the concept of money, let alone the cost of it. &lt;/p&gt;\n\n&lt;p&gt;It gets so bad that I can&amp;#39;t help but to sit there and say that it feels like I&amp;#39;m &amp;quot;early&amp;quot; to the concept of interest rates. When in reality, the stupidity of the people are what the central planners are counting on. They aren&amp;#39;t hiding their theft from regular people, they are just operating out of another dimension.&lt;/p&gt;\n\n&lt;p&gt;I wonder if Bitcoin will suffer eternally due to the people that it benefits, having no real interest in learning why or how, and the people that do understand it, all have much more to gain from gaming the system.&lt;/p&gt;\n\n&lt;p&gt;Rant over. This will likely be seen by 4 people, but I needed to get it off my chest.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/Bitcoin/comments/v1hx7w/are_we_early_or_do_people_just_not_care_to_learn/",
  "subreddit": "Bitcoin",
  "id": "v1hx7w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work in finance, and can tell you, it is incredibly frustrating going to\n/r/personalfinance and giving advice to people that just want to sit around\nsmelling their own farts. That is a place where people are supposed to know what\nthey are talking about, and practically everyone there thinks that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は金融業界で働いていますが、/r/personalfinance に行って、ただ座っていたいだけの人にアドバイスをするのは信じられないほどイライラします。\n/r/personalfinance に行って、ただ座って自分の屁の臭いを嗅ぎたいだけの人にアドバイスするのは、信じられないほどイライラします。\n自分の屁を嗅ぎながら座っていたい人たちにアドバイスするのは、本当にイライラします。ここは、人々が何を話しているかを知っているはずの場所です。\nと思っている人ばかりです。",
      "title": "早い話、みんな学ぼうとしないのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在金融领域工作，可以告诉你，到\n我可以告诉你，去/r/personalfinance给那些只想坐在那里的人提供建议是非常令人沮丧的。\n闻他们自己的屁。那是一个人们应该知道自己在说什么的地方。\n他们在谈论什么，而实际上那里的每个人都认为......",
      "title": "是我们早了，还是人们不屑于学习。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在金融領域工作，可以告訴你，到\n我可以告訴你，去/r/personalfinance給那些只想坐在那裏的人提供建議是非常令人沮喪的。\n聞他們自己的屁。那是一個人們應該知道自己在說什麼的地方。\n他們在談論什麼，而實際上那裏的每個人都認爲......",
      "title": "是我們早了，還是人們不屑於學習。"
    }
  ]
}