{
  "author": "ThePurpleDuckling",
  "original_created_utc": 1638985871,
  "title": "What is your favorite “eco-friendly” coin and why should someone invest in it as an alt?",
  "created_utc": 1639014588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Back in spring and summer one big talking point was the climate impact of mining Bitcoin (among others). This was the conversation that got me started in crypto. &lt;/p&gt;\n\n&lt;p&gt;I want to hear what your favorite green coin is and why you think it’s worth a look. I’m including a list of some below, but I’m sure there are more. And I’m sure some are better in this regard than others. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;ALGO - Uses PoS and claims to be a carbon neutral network&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;BURST - Honestly have never heard of this until today. It uses proof of capacity for mining and supposedly only uses the power consumed equivalent to your computer idling. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;NANO - Uses block lattice technology to remain energy efficient while still relying on PoW. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;MINA - A newer coin intending to use zk-SNARKS and maintain a lightweight blockchain. This one seems intriguing. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;XLM - Uses a consensus protocol which has a shorter authentication cycle…thereby using less energy. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Others that appear in lists of green coins from time to time: MetaHash, XRP, Chia, Iota. &lt;/p&gt;\n\n&lt;p&gt;I’d love to hear about others and see what people think about those on this list.&lt;/p&gt;\n\n&lt;p&gt;Edit: The number of comments here is crazy. Way more than I expected. I’ll try to look at them all a little later tonight. Thanks all!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/rbwuby/what_is_your_favorite_ecofriendly_coin_and_why/",
  "subreddit": "CryptoCurrency",
  "id": "rbwuby",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Back in spring and summer one big talking point was the climate impact of mining\nBitcoin (among others). This was the conversation that got me started in crypto.\n\nI want to hear what your favorite green coin is and why you think it’s worth a\nlook. I’m including a list of some below, but I’m sure…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "春から夏にかけて、マイニングが気候に与える影響について大きな話題となりました。\nビットコイン（中略）。私が暗号を始めるきっかけとなった会話です。\n\n皆さんのお気に入りのグリーンコインは何か、そしてなぜそのコインが注目に値すると思うのか、お聞かせください。\nを見てください。以下にいくつかのリストを掲載しますが、きっと...",
      "title": "あなたが好きな「環境に優しい」コインは何ですか？また、なぜそのコインをアルトとして投資すべきなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在春季和夏季，一个重要的讨论点是采矿对气候的影响。\n比特币（包括其他）。这就是让我开始接触加密货币的谈话。\n\n我想听听你最喜欢的绿色货币是什么，以及为什么你认为它值得一看。\n看看。我在下面列出了一些，但我相信...",
      "title": "你最喜欢的 \"环保 \"币是什么，为什么有人要把它作为备选币进行投资？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在春季和夏季，一個重要的討論點是採礦對氣候的影響。\n比特幣（包括其他）。這就是讓我開始接觸加密貨幣的談話。\n\n我想聽聽你最喜歡的綠色貨幣是什麼，以及爲什麼你認爲它值得一看。\n看看。我在下面列出了一些，但我相信...",
      "title": "你最喜歡的 \"環保 \"幣是什麼，爲什麼有人要把它作爲備選幣進行投資？"
    }
  ]
}