{
  "author": "Apprehensive_Home912",
  "original_created_utc": 1636729613,
  "title": "Yes we exist. There are those of us that are in it for the wealth AND because we think the tech is badass.",
  "created_utc": 1636745536,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So many self-righteous posts about how disappointed the OP is in the rest of us for being focused on making profits.\nWell, I may have only been in crypto for about a year now but I have loved every minute of learning/experiencing blockchain, liquidity pairing, DEX, software wallets, shitcoin YOLOs, etc. I also look forward to continuing to watch all the new things that will get invented in years to come.\nThat said, the profits have also been fucking awesome! Do the try-hards really  not understand how great it is that we can make so much money in a sector that we all enjoy so much?!? With exception of the lucky few who truly found a career path &amp; job combo that brings them enjoyment &amp; total fulfillment everyday…most things we do for income are, on average, healthily mundane. \nTime to get off the high horses, uncork those sphincters, and start focusing on enjoying this shit a little bit. </p>\n\n<p>TLDR; take out the pacifier &amp; have fun with the rest of us because there is plenty to be had.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/qsd51m/yes_we_exist_there_are_those_of_us_that_are_in_it/",
  "subreddit": "CryptoCurrency",
  "id": "qsd51m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So many self-righteous posts about how disappointed the OP is in the rest of us\nfor being focused on making profits. Well, I may have only been in crypto for\nabout a year now but I have loved every minute of learning/experiencing\nblockchain, liquidity pairing, DEX, software wallets, shitcoin YOLOs,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OPが他の人に失望したという独善的な書き込みが多い\n儲けることに集中していることに失望しているという独善的な投稿が多いですね。私は暗号化に参加してまだ1年ほどですが\nブロックチェーン、リクイディティ・ペアリング、DEX、ソフトウェア、などを学んだり経験したりするのが好きなんです。\nブロックチェーン、流動性ペア、DEX、ソフトウェアウォレット、shitcoin YOLO、...。",
      "title": "Yes we exist. 富を得るため、そして技術が素晴らしいと思うために参加している人たちがいるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这么多自以为是的帖子，说OP对我们其他人是多么的失望\n因为他们专注于盈利。好吧，我可能只做了一年的加密货币\n但我喜欢学习/体验的每一分钟\n区块链，流动性配对，DEX，软件钱包，狗屎币YOLO，...",
      "title": "是的，我们存在。我们中有些人是为了财富，也因为我们认为技术是坏蛋。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這麼多自以爲是的帖子，說OP對我們其他人是多麼的失望\n因爲他們專注於盈利。好吧，我可能只做了一年的加密貨幣\n但我喜歡學習/體驗的每一分鐘\n區塊鏈，流動性配對，DEX，軟件錢包，狗屎幣YOLO，...",
      "title": "是的，我們存在。我們中有些人是爲了財富，也因爲我們認爲技術是壞蛋。"
    }
  ]
}