{
  "author": "villowapp",
  "original_created_utc": 1645721623,
  "title": "Villow bot - the first productivity tool that cares about your mental health - free tool to help you understand the real reasons behind your productivity struggles and build healthy productivity habits",
  "created_utc": 1645770572,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you ever struggled with procrastination, you probably realised that in most of the cases you procrastinated not because you didn&amp;#39;t know how to organise your to-do list or because you&amp;#39;re lazy, but because deep down you were struggling with certain emotions or thoughts that made it impossible for you to do anything. A lot of the time it&amp;#39;s very hard to understand those sabotaging emotions, but most importantly it&amp;#39;s extremely hard to know how to help yourself get unstuck and move on with your work.&lt;/p&gt;\n\n&lt;p&gt;Together with my friend, we created a tool that does exactly that. &lt;/p&gt;\n\n&lt;p&gt;Villow bot helps anyone struggling to be productive &lt;strong&gt;understand the real reasons behind their productivity struggles&lt;/strong&gt; (like fear of failure, lack of motivation, etc) and offers simple exercises to help you feel better in the moment and build healthy routines. &lt;/p&gt;\n\n&lt;p&gt;You can try it for free here: &lt;a href=\"https://t.me/villow_labs_bot\"&gt;https://t.me/villow_labs_bot&lt;/a&gt; (you will need a Telegram app which is totally free too)&lt;/p&gt;\n\n&lt;p&gt;This is our very first version of the tool, and we would appreciate your feedback to help us make Villow bot as helpful to everyone as possible. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re welcome to leave your feedback here: &lt;a href=\"https://www.reddit.com/r/Villow/\"&gt;https://www.reddit.com/r/Villow/&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;Many thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/KbgkDUhETDZCPLQ7z7OLkJZGxx7g4hfmKDgc2zu4Fyo.jpg?auto=webp&amp;s=713c9533d79c09f8e7e382c02e21fc1d0467767c",
          "width": 320,
          "height": 320
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/KbgkDUhETDZCPLQ7z7OLkJZGxx7g4hfmKDgc2zu4Fyo.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=07f0d7198fe5082fc5413eca05d655baa53597ed",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/KbgkDUhETDZCPLQ7z7OLkJZGxx7g4hfmKDgc2zu4Fyo.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=c173ccfa53ac2836b9432728c78dd838f49b9cbd",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/KbgkDUhETDZCPLQ7z7OLkJZGxx7g4hfmKDgc2zu4Fyo.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=5da0ce9a0981173b73ae05b651422c98b9008330",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "w8zF6dAEbT8moF1a0QKW31F__iBurDr-QYvAo2WCu3k"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/t0flx9/villow_bot_the_first_productivity_tool_that_cares/",
  "subreddit": "SideProject",
  "id": "t0flx9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you ever struggled with procrastination, you probably realised that in most\nof the cases you procrastinated not because you didn't know how to organise your\nto-do list or because you're lazy, but because deep down you were struggling\nwith certain emotions or thoughts that made it impossible for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが先延ばしに悩んだことがあるなら、おそらくほとんどの場合、そのことに気がつくでしょう。\n先延ばしにしているのは、整理の仕方がわからないからではありません。\nToDoリストや怠け者だからではなく、心の底で苦しんでいたからです。\nある種の感情や思考が、それを不可能にしているのです。",
      "title": "Villow bot - メンタルヘルスをケアする初の生産性向上ツール - 生産性に悩む本当の理由を理解し、健康的な生産性向上習慣を身につけるための無料ツール"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你曾经与拖延症作斗争，你可能意识到，在大多数情况下，你的拖延并不是因为你不知道如何组织你的工作。\n你可能意识到，在大多数情况下，你的拖延不是因为你不知道如何组织你的\n不是因为你不知道如何组织你的待办事项，也不是因为你很懒，而是因为在你内心深处，你正在与某些情绪或想法作斗争，而这些情绪或想法使你无法完成任务。\n而是因为在你内心深处与某些情绪或想法作斗争，使你无法...",
      "title": "Villow bot--第一个关心你心理健康的生产力工具--免费工具，帮助你了解你的生产力挣扎背后的真正原因，建立健康的生产力习惯。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你曾經與拖延症作鬥爭，你可能意識到，在大多數情況下，你的拖延並不是因爲你不知道如何組織你的工作。\n你可能意識到，在大多數情況下，你的拖延不是因爲你不知道如何組織你的\n不是因爲你不知道如何組織你的待辦事項，也不是因爲你很懶，而是因爲在你內心深處，你正在與某些情緒或想法作鬥爭，而這些情緒或想法使你無法完成任務。\n而是因爲在你內心深處與某些情緒或想法作鬥爭，使你無法...",
      "title": "Villow bot--第一個關心你心理健康的生產力工具--免費工具，幫助你瞭解你的生產力掙扎背後的真正原因，建立健康的生產力習慣。"
    }
  ]
}