{
  "author": "PizzaClause",
  "original_created_utc": 1643552344,
  "title": "You wake up and you’re a millionaire",
  "created_utc": 1643560346,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Say after waiting patiently and holding a few of your favorite crypto currency projects for the last 5 years, you wake up and see that they have all gone 300x and you realize that you are in possession of a life changing amount of money. What is the very first thing that you buy, what would your mind go to first?&lt;/p&gt;\n\n&lt;p&gt;As for me I would buy a house. I live in a city that property values are through the roof. It seems like a pipe dream to able to own a home where I am. I would love nothing more than a little backyard for a pupper and a roof for my future children&lt;/p&gt;\n\n&lt;p&gt;Edit: I’m honestly touched by a lot of the answers everyone has given here. There’s a lot of love in these comments. I really hope the best for all of you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 524,
  "permalink": "/r/CryptoCurrency/comments/sga4pf/you_wake_up_and_youre_a_millionaire/",
  "subreddit": "CryptoCurrency",
  "id": "sga4pf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Say after waiting patiently and holding a few of your favorite crypto currency\nprojects for the last 5 years, you wake up and see that they have all gone 300x\nand you realize that you are in possession of a life changing amount of money.\nWhat is the very first thing that you buy, what would your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、お気に入りの暗号通貨をいくつか保有し、辛抱強く待っていたところ\n過去5年間のプロジェクトが、目を覚ますと、すべて300倍になっていることに気づく。\nそして、あなたは人生を変えるほどの大金を手に入れたことに気づきます。\nあなたが最初に購入するものは何ですか、あなたは何をしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设在耐心等待并持有你最喜欢的几个加密货币\n项目后，你醒来时看到它们都已经涨了300倍\n而你意识到你拥有了一笔改变生活的资金。\n你买的第一件东西是什么，你会买什么？",
      "title": "一觉醒来，你就成了百万富翁"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設在耐心等待並持有你最喜歡的幾個加密貨幣\n項目後，你醒來時看到它們都已經漲了300倍\n而你意識到你擁有了一筆改變生活的資金。\n你買的第一件東西是什麼，你會買什麼？",
      "title": "一覺醒來，你就成了百萬富翁"
    }
  ]
}