{
  "author": "Affectionate-Win-788",
  "original_created_utc": 1638922275,
  "title": "Bringing new neighbors cookies weird?",
  "created_utc": 1638952883,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We (29m and 27f) recently had new neighbors our age move in next door. When we saw they were about our age we were very excited to have neighbors around our age next door. Obviously, we weren’t going to become best friends overnight but we were hoping we could start talking to them and build a neighborly relationship from there. We decided to bring cookies, that we baked, over a few weeks after they moved in. They responded by saying “oh, I didn’t realize people did that anymore” and have avoided us ever since. Is that a weird thing to do nowadays? I realize COVID might play a role in this as well.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/rbdhaq/bringing_new_neighbors_cookies_weird/",
  "subreddit": "TooAfraidToAsk",
  "id": "rbdhaq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We (29m and 27f) recently had new neighbors our age move in next door. When we\nsaw they were about our age we were very excited to have neighbors around our\nage next door. Obviously, we weren’t going to become best friends overnight but\nwe were hoping we could start talking to them and build a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たち（29歳男、27歳女）は最近、隣に同い年の人が引っ越してきました。私たち\n私たちと同じくらいの年齢の方がいらっしゃるのを見て、とても嬉しく思いました。\nということです。もちろん、一夜にして親友になれるわけではありませんが\nこの先、彼らと話をすることで、より親密な関係を築けたらと思っています。",
      "title": "新しい隣人のクッキーを持ってくるのは変？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们（29岁和27岁）最近有与我们同龄的新邻居搬到隔壁。当我们\n看到他们与我们年龄相仿，我们非常兴奋，因为隔壁有与我们年龄相仿的邻居。\n年龄的邻居，我们非常兴奋。很明显，我们不会在一夜之间成为最好的朋友，但是\n我们希望我们可以开始和他们交谈，并建立起一个良好的关系。",
      "title": "带来新邻居的饼干很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們（29歲和27歲）最近有與我們同齡的新鄰居搬到隔壁。當我們\n看到他們與我們年齡相仿，我們非常興奮，因爲隔壁有與我們年齡相仿的鄰居。\n年齡的鄰居，我們非常興奮。很明顯，我們不會在一夜之間成爲最好的朋友，但是\n我們希望我們可以開始和他們交談，並建立起一個良好的關係。",
      "title": "帶來新鄰居的餅乾很奇怪？"
    }
  ]
}