{
  "author": "Polytruce",
  "the_new_excerpt": "There are a lot of newbies entering the space. There are many reasons this is\ngreat news, but I've also noticed that the quality of posts and discussion about\nbitcoin has plummeted. We really aren't having the important discussions with\nnearly the frequency that we should.\n\nNow I know some of you…",
  "original_created_utc": 1610456519,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有很多新手进入这个空间。这有很多原因\n伟大的消息，但我也注意到，质量的帖子和讨论的关于\n比特币已经暴跌了。我们真的没有和你进行重要的讨论。\n几乎是我们应该的频率。\n\n现在我知道你们中的一些人...",
      "title": "一个长期混混和比特币迷的一些坦诚。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有很多新手進入這個空間。這有很多原因\n偉大的消息，但我也注意到，質量的帖子和討論的關於\n比特幣已經暴跌了。我們真的沒有和你進行重要的討論。\n幾乎是我們應該的頻率。\n\n現在我知道你們中的一些人...",
      "title": "一個長期混混和比特幣迷的一些坦誠。"
    }
  ],
  "title": "Some honesty from a longtime hodler and Bitcoin fanboy.",
  "created_utc": 1610502909,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are a lot of newbies entering the space. There are many reasons this is great news, but I&#39;ve also noticed that the quality of posts and discussion about bitcoin has plummeted. We really aren&#39;t having the important discussions with nearly the frequency that we should. </p>\n\n<p>Now I know some of you won&#39;t like me saying this, but it really does need to be said. Someone needs to be realistic with our new friends and give them the bad news and tell them the things they don&#39;t want to hear. So here goes.</p>\n\n<p>I feel that we&#39;re due for a correction, and I really don&#39;t think we&#39;ve even gotten started. I&#39;ve been around this rodeo a few times and it always -feels- different in the moment, but in reality it&#39;s mostly cyclical. In 2017/2018 we saw a months long sell off after the run up to 20k that saw Bitcoin fall to 4k. That&#39;s more than 75% in the red from the preceeding ATH. Refer to this figure later. </p>\n\n<p>I think we&#39;re going to see a few -15%&#39;s, maybe even a -20% or -30% before we&#39;re really back in bear territory. When it comes I expect the new crowd to go through the same things I and many others went through when we were the new kids. </p>\n\n<p>Weak hands will get shaken out. People getting way over leveraged/exposed and taking out credit to buy BTC are going to be burned hard and maybe leave the space forever. Some will risk it all and put their house on the line, and nearly all of those will lose their home. People will buy into BTC expecting their investments to double overnight, everynight.</p>\n\n<p>This shit happens every time. The vets come in to tell the new guys not to panic, or not get into serious debt chasing the bull run, and we get ignored. People will tell us we&#39;re trying to short, or how we might be causing this guy to miss out on SICK GAINZ by telling him not to take a second mortgage out to buy BTC. In reality, most of us really do care about the space, and want to see it grow. It hurt me every time I read about someone blowing years of their life away trying to chase the dragon at the end of the bull run. It hurts me more now to see it happening again, and the same arguments getting thrown about as justification for being reckless with their finances. </p>\n\n<p>Refer back to that -75% figure I dropped before. Would you rather that be the value of your house? Or would you rather it be the money you saved over time to buy ₿ responsibly? I made my own mistakes too, thankfully not with my house or something else vital to me, but mistakes nonetheless that put me in severe debt when I tried to chase BTC back in 2013. I only just now climbed out of that hole. (I literally made the last payment before posting this)</p>\n\n<p>Bottom line is that BTC unfortunately attracts the get rich quick types, and when shit hits the fan they are NOT happy. They will panic sell to stop the bleeding. If you gamble your life savings on Bitcoin while it&#39;s at ATH because of FOMO, it&#39;s going to really hurt. </p>\n\n<p>The harsh truth of it is, if bitcoin is going gangbusters and you don&#39;t already own your position, you&#39;re too late for the bull run. Your best bet is to accumulate over time, so that in four years when we&#39;re looking at this situation again you can be the guy making five figures in his sleep, and making posts like these telling the new guys to have a longer term view.</p>\n\n<p>I dunno, I just don&#39;t want to see people FOMO themselves into crippling debt like I did, and have heard so many horror stories about. It&#39;s the beginning of a very wild ride over the next couple of months.</p>\n\n<p>EDIT: With this getting a lot more attention than I thought it would, I&#39;d like to just say thank you to everyone for even giving this the time of day. I was initially replying to another comment on a different thread and the whole thing got a little long winded, leading me to just post this here instead. </p>\n\n<p>I just wanted to clarify a few things that I feel got left out or that I missed the mark on:</p>\n\n<ol>\n<li><p>I am very bullish. I do not believe we&#39;re crashing imminently, but rather wanted to caution those getting sweaty palms of what could happen should they get too emotional and overextend while we&#39;re in uncharted territory. </p></li>\n<li><p>I don&#39;t think we&#39;re going to follow a picture prefect pattern of the previous bull runs. The price is entirely unpredictable, and if one could tell you with any certainty what the price or market sentiment would be at any given time they would have to be a time traveler. </p></li>\n<li><p>It is never too late to get into BTC. But you should temper your expectations when you&#39;re a late entry to the cycle. The 10x gains come later when you&#39;ve held through a full cycle.</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 3178,
  "permalink": "/r/Bitcoin/comments/kvr8n3/some_honesty_from_a_longtime_hodler_and_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "kvr8n3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706373019
}