{
  "author": "thou_shall_reddit",
  "original_created_utc": 1646829119,
  "title": "So what are you planning to do if the price of everything keeps going up? When is enough enough?",
  "created_utc": 1646847075,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand gas will go down one day. But probably not under $3 if keeps going up. Used Car prices may come down in a 2years but not anytime soon. However my utilities are 2x higher for less usage. They wont go down. Supply chain issues has turned into a blanket bs statement in most cases. I’m going without for now. But I have a breaking point. What say you?!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/ta6sh5/so_what_are_you_planning_to_do_if_the_price_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "ta6sh5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand gas will go down one day. But probably not under $3 if keeps going\nup. Used Car prices may come down in a 2years but not anytime soon. However my\nutilities are 2x higher for less usage. They wont go down. Supply chain issues\nhas turned into a blanket bs statement in most cases. I’m…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ガソリンはいつか下がると理解している。しかし、このままではおそらく3ドルを切ることはないでしょう。\n上昇する。中古車価格は2年後に下がるかもしれませんが、すぐには下がらないでしょう。しかし、私の\n光熱費は使用量が少ない割に2倍高い。下がることはないでしょう。サプライチェーンの問題\nは、ほとんどの場合、包括的なbs文に変わった。私は...",
      "title": "では、あらゆるものの値段が上がり続けたら、どうするつもりなのでしょうか？いつになったら十分なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道汽油有一天会下降。但如果继续上涨，可能不会低于3美元\n涨。二手车价格可能在两年内下降，但不会很快。然而，我的\n水电费是2倍，但使用量较少。它们不会下降。供应链问题\n在大多数情况下已经变成了一个空洞的谎言。我是...",
      "title": "那么，如果所有东西的价格不断上涨，你打算怎么做呢？什么时候才算够用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道汽油有一天會下降。但如果繼續上漲，可能不會低於3美元\n漲。二手車價格可能在兩年內下降，但不會很快。然而，我的\n水電費是2倍，但使用量較少。它們不會下降。供應鏈問題\n在大多數情況下已經變成了一個空洞的謊言。我是...",
      "title": "那麼，如果所有東西的價格不斷上漲，你打算怎麼做呢？什麼時候纔算夠用？"
    }
  ]
}