{
  "author": "wokewasp",
  "the_new_excerpt": "How did the average early Chinese immigrant to the United States make their way\nfrom East Asia all the way to America. It seems like that passage would have not\nonly been expensive, but something that wouldn't have been available to a wide\nportion of the population. How did early Chinese immigrants…",
  "original_created_utc": 1621598633,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国に移住した初期の平均的な中国人は、どのようにして東アジアからアメリカに渡ったのでしょうか？\n東アジアからアメリカに渡ってきた。それは、お金がかかるだけでなく、多くの人が利用できるものではなかったと思います。\nお金がかかるだけでなく、多くの人が利用できないものだったのではないでしょうか。\n人口の大部分が利用できなかったはずです。初期の中国系移民はどのようにして...",
      "title": "私は1850年に生きる中国の農民です。どうやってアメリカのことを知ったり、アメリカへの航路を探したりすればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早期到美国的普通中国移民是如何从东亚一路走来的？\n从东亚一路走到美国。看起来这条通道不仅价格昂贵，而且广大的中国人也无法获得。\n不仅费用昂贵，而且大部分人都不可能得到。\n的一部分人。早期的中国移民是如何...",
      "title": "我是一个生活在1850年的中国农民。我甚至如何了解美国或找到前往美国的通道？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早期到美國的普通中國移民是如何從東亞一路走來的？\n從東亞一路走到美國。看起來這條通道不僅價格昂貴，而且廣大的中國人也無法獲得。\n不僅費用昂貴，而且大部分人都不可能得到。\n的一部分人。早期的中國移民是如何...",
      "title": "我是一個生活在1850年的中國農民。我甚至如何瞭解美國或找到前往美國的通道？"
    }
  ],
  "title": "I'm a Chinese peasant living in 1850. How do I even find out about America or find passage to the United States?",
  "created_utc": 1621620461,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How did the average early Chinese immigrant to the United States make their way from East Asia all the way to America. It seems like that passage would have not only been expensive, but something that wouldn&#39;t have been available to a wide portion of the population. How did early Chinese immigrants even find out about such opportunities and how did they get here?</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/AskHistorians/comments/nhqum8/im_a_chinese_peasant_living_in_1850_how_do_i_even/",
  "subreddit": "AskHistorians",
  "id": "nhqum8",
  "is_self": true,
  "media": null,
  "is_video": false
}