{
  "author": "screwyoushadowban",
  "original_created_utc": 1644524588,
  "title": "What did \"being a good husband\" mean to the Romans? Was \"being a good husband\" synonymous with \"being a good man\" (virtus) or were they separate things? And do records of Roman women's opinions on the topic survive, or just the those of the husbands themselves?",
  "created_utc": 1644551622,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/cx4kmv/how_did_the_idea_of_being_a_proper_man_virtus/\"&gt;I&amp;#39;ve previously asked about Roman concepts of masculinity/virtus&lt;/a&gt; and received a &lt;a href=\"https://www.reddit.com/r/AskHistorians/comments/cx4kmv/how_did_the_idea_of_being_a_proper_man_virtus/eykno2n/\"&gt;wonderful rundown of its origins and many permutations&lt;/a&gt;, but I&amp;#39;ve realized that virtus doesn&amp;#39;t seem to much address duties to one&amp;#39;s wife and household life so much, as it seems to be entirely a facet of public standing. My scant reading on Roman marriage practices often discuss the legal obligations of a husband or wife (and the broader list of ways a wife could fall afoul of them vs. a husband) as well the social expectations of a wife (often provided via historical anecdotes - Aemilia Tertia&amp;#39;s patient and forgiving attitude towards both Scipio Africanus and the woman he cheated with, for example), but very little on the expectations of a husband. I have run into Plutarch&amp;#39;s comments on Cato the Elder:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He used to say that the man who struck his wife or child, laid violent hands on the holiest of holy things. Also that he thought it more praiseworthy to be a good husband than a good senator [...] After the birth of his son, no business could be so urgent, unless it had a public character, as to prevent him from being present when his wife bathed and swaddled the babe.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So: in terms of social expectations, what behaviors made a Roman man a good husband? What made him a bad husband? Does art and theatre tell us anything that ancient Roman biographers/historians and moralists don&amp;#39;t? And are any of our surviving voices those of Roman women themselves and what they wanted in a husband for themselves or female family members, or are our surviving sources only those of Roman men, describing ideals they ascribed to themselves and each other?&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/spg3u8/what_did_being_a_good_husband_mean_to_the_romans/",
  "subreddit": "AskHistorians",
  "id": "spg3u8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've previously asked about Roman concepts of masculinity/virtus\n[https://www.reddit.com/r/AskHistorians/comments/cx4kmv/how_did_the_idea_of_being_a_proper_man_virtus/]\nand received a wonderful rundown of its origins and many…"
}