{
  "author": "FinestOldToby",
  "original_created_utc": 1635714350,
  "title": "Marcus Aurelius is probably the most well known ancient stoic leader, but what actual policies did he enact that reflected his stoic philosophy?",
  "created_utc": 1635741008,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>His writings such as &#39;Meditations&#39; are some the most well known writings on ancient stoicism and give an insight into his thought process and outlook on life, but do we know of any policies that he enacted or of any major actions he took as emperor that can be attributed to his stoic philosophy?</p>\n\n<p>What policies could be described as &#39;stoic&#39;? </p>\n\n<p>Basically, I&#39;m asking did he practice what he preached?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/qjyqtl/marcus_aurelius_is_probably_the_most_well_known/",
  "subreddit": "AskHistorians",
  "id": "qjyqtl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "His writings such as 'Meditations' are some the most well known writings on\nancient stoicism and give an insight into his thought process and outlook on\nlife, but do we know of any policies that he enacted or of any major actions he\ntook as emperor that can be attributed to his stoic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "瞑想録』など、彼の著作は最もよく知られたものである。\n古代ストイシズムは、彼の思考過程や考え方を知ることができる。\nしかし、彼が行った政策や主要な行動については、知られているのでしょうか？\n皇帝として取った行動は、彼のストイックな姿勢に起因するものです。",
      "title": "古代のストイックな指導者といえば、マルクス・アウレリウスが有名でしょうが、彼は実際にどのような政策をとって、ストイックな哲学を反映させたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他的著作，如《沉思录》，是一些最著名的古代斯多葛主义著作。\n他的著作，如《沉思录》，是一些最著名的关于古代斯多葛主义的著作，让人们了解到他的思想过程和观点。\n但我们是否知道他制定的任何政策或他作为皇帝采取的任何重大行动可以归功于他的斯多葛主义？\n但我们是否知道他作为皇帝所颁布的任何政策或采取的任何重大行动都可以归功于他的斯多葛主义...",
      "title": "马库斯-奥勒留可能是最知名的古代斯多葛派领袖，但他制定了哪些实际政策来反映他的斯多葛哲学？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他的著作，如《沉思錄》，是一些最著名的古代斯多葛主義著作。\n他的著作，如《沉思錄》，是一些最著名的關於古代斯多葛主義的著作，讓人們瞭解到他的思想過程和觀點。\n但我們是否知道他制定的任何政策或他作爲皇帝採取的任何重大行動可以歸功於他的斯多葛主義？\n但我們是否知道他作爲皇帝所頒佈的任何政策或採取的任何重大行動都可以歸功於他的斯多葛主義...",
      "title": "馬庫斯-奧勒留可能是最知名的古代斯多葛派領袖，但他制定了哪些實際政策來反映他的斯多葛哲學？"
    }
  ]
}