{
  "author": "RepresentativePop",
  "original_created_utc": 1652714737,
  "title": "When the Ottoman Caliphate was abolished in 1924, did Sunni Muslims still consider it an important religious authority? What were some of the long-term consequences of its abolition?",
  "created_utc": 1652748259,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Purely anecdotally (i.e. tell me if I&amp;#39;m wrong on this), most Sunni Muslims nowadays do not hold the late Ottoman Caliphate in particularly high regard, viewing it as more a political position than a religious one.  &lt;/p&gt;\n\n&lt;p&gt;But was it regarded as such in the 1920s?  Or did many Sunni Muslims still consider the Caliph as an important source of religious authority?  Was there a serious divide between Turkish and Arab Muslims on this question?   What about in the Islamic world more broadly (e.g. Afghanistan, Bosnia, Malaysia, Indonesia, etc)? &lt;/p&gt;\n\n&lt;p&gt;Did Ataturk&amp;#39;s abolition of the Caliphate have broader, long-term implications outside of Turkey?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/uqyhhh/when_the_ottoman_caliphate_was_abolished_in_1924/",
  "subreddit": "AskHistorians",
  "id": "uqyhhh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Purely anecdotally (i.e. tell me if I'm wrong on this), most Sunni Muslims\nnowadays do not hold the late Ottoman Caliphate in particularly high regard,\nviewing it as more a political position than a religious one.\n\nBut was it regarded as such in the 1920s? Or did many Sunni Muslims still\nconsider…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "純粋に逸話として（つまり、私が間違っていたら教えてください）、現在ほとんどのスンニ派のイスラム教徒は\nオスマン帝国末期のカリフを特に高く評価しているわけではありません。\n宗教的な立場というより政治的な立場としてとらえている。\n\nしかし、1920年代にはそのように見なされていたのだろうか。あるいは、多くのスンニ派ムスリムはまだ\nと考えていたのだろうか。",
      "title": "1924年にオスマン帝国のカリフが廃止されたとき、スンニ派のイスラム教徒は、それでもカリフを重要な宗教的権威と考えていたのでしょうか？その廃止がもたらした長期的な影響にはどのようなものがあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纯粹从传闻来看（也就是说，如果我错了就告诉我），大多数逊尼派穆斯林\n如今对奥斯曼帝国后期的哈里发并没有特别高的评价。\n将其视为一种政治立场而非宗教立场。\n\n但在20世纪20年代，它是否被视为如此？还是许多逊尼派穆斯林仍然\n认为...",
      "title": "当奥斯曼帝国的哈里发于1924年被废除时，逊尼派穆斯林是否仍然认为它是一个重要的宗教权威？它的废除有哪些长期后果？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "純粹從傳聞來看（也就是說，如果我錯了就告訴我），大多數遜尼派穆斯林\n如今對奧斯曼帝國後期的哈里發並沒有特別高的評價。\n將其視爲一種政治立場而非宗教立場。\n\n但在20世紀20年代，它是否被視爲如此？還是許多遜尼派穆斯林仍然\n認爲...",
      "title": "當奧斯曼帝國的哈里發於1924年被廢除時，遜尼派穆斯林是否仍然認爲它是一個重要的宗教權威？它的廢除有哪些長期後果？"
    }
  ]
}