{
  "author": "lwc-wtang12",
  "the_new_excerpt": "What the title said. How is halting a stock, whether it is going up or down\naggressively, not market manipulation? Is it really a free and open market if\nanyone (the exchanges) has the power to do this? It seems to me that there\nshould be no central control of a \"free\" market and the right to cease…",
  "original_created_utc": 1614208371,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "题目所说的。涨停的股票，不管是涨停还是跌停，怎么都是涨停的\n咄咄逼人，不是操纵市场吗？难道真的是一个自由开放的市场，如果\n任何人（交易所）都有权力这样做吗？在我看来，有\n不应该有中央控制的 \"自由 \"市场和停止的权利... ...",
      "title": "谁能给我解释一下为什么停止股票交易不是操纵市场？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "題目所說的。漲停的股票，不管是漲停還是跌停，怎麼都是漲停的\n咄咄逼人，不是操縱市場嗎？難道真的是一個自由開放的市場，如果\n任何人（交易所）都有權力這樣做嗎？在我看來，有\n不應該有中央控制的 \"自由 \"市場和停止的權利... ...",
      "title": "誰能給我解釋一下爲什麼停止股票交易不是操縱市場？"
    }
  ],
  "title": "Can someone explain to me why halting trading of a stock is not market manipulation?",
  "created_utc": 1614239488,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What the title said. How is halting a stock, whether it is going up or down aggressively, not market manipulation? Is it really a free and open market if anyone (the exchanges) has the power to do this? It seems to me that there should be no central control of a &quot;free&quot; market and the right to cease trading should not be held by any party whatsoever.</p>\n\n<p>It is everyone&#39;s personal responsibility to take on the risks of the market and that includes volatility. I feel like a lot of the time these things are done under the guise of what is &quot;in the best interest of retail investors&quot; but in reality, it does nothing but make them powerless to either buy or sell super volatile securities (get out or get in at their will). I didn&#39;t touch GME, AMC, or any of those wsb stocks with a ten-foot pole because I knew the risks, but just because some people didn&#39;t do their due diligence and may get burnt doesn&#39;t mean a stock should get halted. That is simply the nature of an open market, no?</p>\n\n<p>If you don&#39;t want to experience such volatility then one should do their research and either not get involved in the stock market or not buy securities that are known to be volatile. Halting the market or the trading of any specific security is quite the opposite of a free and open capitalist marketplace. I don&#39;t buy any of the &quot;halts are used to make the market safer&quot; narrative. That is not a free and open marketplace then. Plain and simple. </p>\n\n<p>Am I crazy for having this opinion? I wish there was a way to create an autonomous marketplace that is not under the control of any party and runs freely. It seems to me the free market really isn&#39;t free or transparent at all.</p>\n</div><!-- SC_ON -->",
  "score": 52,
  "permalink": "/r/stocks/comments/lrpx1d/can_someone_explain_to_me_why_halting_trading_of/",
  "subreddit": "stocks",
  "id": "lrpx1d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332887597
}