{
  "author": "mzelo",
  "original_created_utc": 1644774891,
  "title": "(SideProject) Digital Hangout website for hanging out with long distance partners!",
  "created_utc": 1644789208,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://mzelo.com/\"&gt;mzelo.com&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Hi, I have been working on building a web app that allows you to do lots of fun things with long distance partners like watching youtube, movies, anime, etc. together, along with the feature of video/audio/text chat.&lt;/p&gt;\n\n&lt;p&gt;It allows screen sharing and playing local media files. It also features playlist option where we can like our favorite youtube videos to create a playlist. The rooms give you privacy by choosing it to be private. Also option of clearing chat, etc. When registered, it allows to send and receive friend requests and private dms. Also, it allows to play games together, draw together. It features inbuilt search section for youtube videos, so you don&amp;#39;t need to copy links and paste it, you can search any youtube video in the app itself. Also there is a movies section, where you can literally watch any movie or show for free, simply by searching in search box.&lt;/p&gt;\n\n&lt;p&gt;I have been passionately working on it, and daily trying to improve it. I would like you guys to check it out, and give feedback on it. What else I can add to it. How can I make it better.&lt;/p&gt;\n\n&lt;p&gt;Also, join its discord please, &lt;a href=\"https://discord.gg/rXU9DVDsFf\"&gt;https://discord.gg/rXU9DVDsFf&lt;/a&gt; so that you guys can give feedback on new features and updates I do in future.&lt;/p&gt;\n\n&lt;p&gt;Thanks a lot!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/sroj17/sideproject_digital_hangout_website_for_hanging/",
  "subreddit": "SideProject",
  "id": "sroj17",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "mzelo.com [https://mzelo.com/]\n\nHi, I have been working on building a web app that allows you to do lots of fun\nthings with long distance partners like watching youtube, movies, anime, etc.\ntogether, along with the feature of video/audio/text chat.\n\nIt allows screen sharing and playing local media…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "mzelo.com [https://mzelo.com/]です。\n\nこんにちは、私は、あなたがたくさんの楽しいことをすることができるWebアプリケーションを構築するために取り組んできました。\n遠距離の相手とYoutubeや映画、アニメなどを見ることができます。\nビデオ/オーディオ/テキストチャットの機能とともに、一緒に。\n\n画面共有やローカルメディアの再生が可能です...",
      "title": "(SideProject）遠距離の相手と一緒に遊べるデジタルハングアウトサイト!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "mzelo.com [https://mzelo.com/]\n\n你好，我一直在努力建立一个网络应用，让你可以与远程伙伴做很多有趣的事情\n伙伴一起做很多有趣的事情，如观看YouTube、电影、动漫等。\n伴随着视频/音频/文字聊天的功能。\n\n它允许屏幕共享和播放本地媒体...",
      "title": "(SideProject)数字挂机网站，用于与远程伙伴挂机!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "mzelo.com [https://mzelo.com/]\n\n你好，我一直在努力建立一個網絡應用，讓你可以與遠程夥伴做很多有趣的事情\n夥伴一起做很多有趣的事情，如觀看YouTube、電影、動漫等。\n伴隨着視頻/音頻/文字聊天的功能。\n\n它允許屏幕共享和播放本地媒體...",
      "title": "(SideProject)數字掛機網站，用於與遠程夥伴掛機!"
    }
  ]
}