{
  "author": "Manvav",
  "the_new_excerpt": "No, I do not plan to suicide. It's just that all of us eventually die. There's\nno greater meaning. At some point everyone will be forgotten. No matter how much\nthey help the human race, they will eventually be forgotten. I have had this\nthought for quite some time and I wasn't able to find a…",
  "original_created_utc": 1611331051,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不，我不打算自杀。只是我们每个人最终都会死。有\n没有更大的意义。在某些时候，每个人都会被遗忘。不管有多\n他们帮助人类，他们最终会被遗忘。我有过这样的经历\n想了好久，我也没能找到... ...",
      "title": "这可能已经被问过很多了，但活着的意义是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不，我不打算自殺。只是我們每個人最終都會死。有\n沒有更大的意義。在某些時候，每個人都會被遺忘。不管有多\n他們幫助人類，他們最終會被遺忘。我有過這樣的經歷\n想了好久，我也沒能找到... ...",
      "title": "這可能已經被問過很多了，但活着的意義是什麼？"
    }
  ],
  "title": "This probably has been asked a lot, but what is the point in living?",
  "created_utc": 1611374670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>No, I do not plan to suicide. It&#39;s just that all of us eventually die. There&#39;s no greater meaning. At some point everyone will be forgotten. No matter how much they help the human race, they will eventually be forgotten. I have had this thought for quite some time and I wasn&#39;t able to find a satisfactory answer. I checked through other reddit posts, and they all said something like &quot;enjoy life&quot; or &quot;there is no point.&quot; I really want to calm my mind and that&#39;s why I ask. My life is decent, so I don&#39;t really know why I am so focused on this thought. It might be because report cards recently came out, but let&#39;s not go into detail on that.</p>\n\n<p>Also, if you&#39;re not enjoying life, then why live? Many adults have barely any free time. They&#39;re always working and they can&#39;t do the things they like. So then, what&#39;s the point? You get around 80 years to live. In the first 25, you go to school, college, university, etc. In the last 20, you become really weak, fragile, and won&#39;t be able to do much. The middle years are when you can enjoy must, but it looks like adults have to work a lot and don&#39;t have much time to enjoy.</p>\n\n<p>I don&#39;t really see the point in living. As for my future, nothing interests me. I find nearly everything boring. It&#39;s hard to explain. I am sorry if some of what I said is unclear.</p>\n</div><!-- SC_ON -->",
  "score": 147,
  "permalink": "/r/TrueAskReddit/comments/l2qjjh/this_probably_has_been_asked_a_lot_but_what_is/",
  "subreddit": "TrueAskReddit",
  "id": "l2qjjh",
  "is_self": true,
  "media": null,
  "is_video": false
}