{
  "author": "beacheytunez_",
  "original_created_utc": 1656841303,
  "title": "Are pacemakers able to adjust their \"heart rate\" based on the exertion of the person they belong to? Do they support a feedback system with the body?",
  "created_utc": 1656871106,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was thinking about this today, since someone&amp;#39;s heart rate fluctuates even as they just stand up, do pacemakers have a way of dealing with such fluctuation? And if they can, to what extent can they support changes in heart rate? Could a pacemaker patient go for a run, or participate in extreme sport, for example?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/askscience/comments/vqdyvf/are_pacemakers_able_to_adjust_their_heart_rate/",
  "subreddit": "askscience",
  "id": "vqdyvf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was thinking about this today, since someone's heart rate fluctuates even as\nthey just stand up, do pacemakers have a way of dealing with such fluctuation?\nAnd if they can, to what extent can they support changes in heart rate? Could a\npacemaker patient go for a run, or participate in extreme…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "としても心拍数が変動する人がいるので、今日はこのことについて考えてみました。\nペースメーカーには、そのような変動に対処する方法があるのでしょうか？\nもしあるとしたら、どの程度まで心拍数の変化に対応できるのでしょうか？ペースメーカーの患者さんが\nペースメーカーの患者は、走ったり、過激な運動に参加したりできるのでしょうか？",
      "title": "ペースメーカーは、所属する人の労力に応じて「心拍数」を調整することができるのでしょうか？身体とのフィードバックシステムをサポートしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天在想这个问题，因为有人的心率会波动，甚至如\n他们只是站起来，心脏起搏器是否有办法处理这种波动？\n如果它们能，它们能在多大程度上支持心率的变化？一个\n心脏起搏器的病人能否去跑步，或参加极端的...",
      "title": "心脏起搏器是否能够根据其所属人员的劳累程度来调整其 \"心率\"？它们是否支持与身体的反馈系统？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天在想這個問題，因爲有人的心率會波動，甚至如\n他們只是站起來，心臟起搏器是否有辦法處理這種波動？\n如果它們能，它們能在多大程度上支持心率的變化？一個\n心臟起搏器的病人能否去跑步，或參加極端的...",
      "title": "心臟起搏器是否能夠根據其所屬人員的勞累程度來調整其 \"心率\"？它們是否支持與身體的反饋系統？"
    }
  ]
}