{
  "author": "ohyouwillseemeoften",
  "original_created_utc": 1628159584,
  "title": "We could have been Rich if Facebook and Google Paid us for our Data they collect",
  "created_utc": 1628170236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>YES! you read that right, ever imagined why when you wanted to buy something or something you have talked about comes as an ad in future times?</p>\n\n<p>Suppose you wanted a TV and you were talking about this to your family or friend or maybe you had searched about TV in your browser, you would have definitely come across An ad relating to it.</p>\n\n<p>I bet you have faced at least one, either it comes as an add in YouTube/google search or it will come as an ad in Facebook as post.</p>\n\n<p><sup>Might go little deep so could be lengthy</sup></p>\n\n<p><strong>This is because Facebook and Google actually collects all your data</strong> </p>\n\n<p>This is called Data Mining</p>\n\n<p>Data mining is the massive collection of users’ data, which is analyzed to find patterns. Corporations like Amazon, Google, and Facebook use the analyses to make more sales by selling this data to companies, who then throw ads in your direction in hopes of you clicking on it and buying their products. </p>\n\n<p><strong>How much money do corporations make from your data?</strong></p>\n\n<p>Depending on your search results on Google, what you like and share on Facebook, you could be worth as l<strong>ittle as $2</strong>. If we took global earnings from Facebook and compared it to the number of users, on average, each user is worth <strong>around $30</strong><strong>.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>So the real question how would it make you rich in crypto?</strong></p>\n\n<p>now we come to that part were we look at the statistics</p>\n\n<p>A stat say that in every hour Approximately 5 MB of information<em>(taken from google)</em> about us are being collected by The mentioned companies if they have been installed on your phone or anything which supports them. <sup>Mainly android because apple is very strict regarding tracking.</sup></p>\n\n<p>so going into the math behind it </p>\n\n<p>1 hour = 60 minutes</p>\n\n<p>1 MB = 1024 KB</p>\n\n<p>5 MB = 5000 KB</p>\n\n<p>So in a day they collect around 5000 * 24 = 120000 KB of data are being collected</p>\n\n<p>so if they had to pay us 0.00001$ each KB, in a day you could have got -</p>\n\n<ul>\n<li><strong>1.2$</strong> a day that&#39;s equalent  to  <strong>0.000031 Bitcoin</strong> </li>\n<li><strong>36$</strong> a month that&#39;s equalent <strong>0.00094 Bitcoin</strong> </li>\n<li><strong>436$</strong> a year that&#39;s equalent <strong>0.011 Bitcoin</strong></li>\n</ul>\n\n<p>You see the....... you aint poor, you just rich intangibly </p>\n\n<p>you have the purchasing power to buy a Bitcoin but unfortunately  you cant ,</p>\n\n<p>if you had DCA&#39;d these money with proper management you might be worth at least 1000$ by now</p>\n\n<p>BUT THINGS DID CHANGE AROUND-</p>\n\n<p>For example Brave browser , that thing is Google Chrome on Steroids, It shows ads but also rewards us with BAT , eventho its  nothing much as a reward but hey we are getting something in return. But i love how it works</p>\n\n<p>Then after all the fuzz about facebook, facebook launched Facebook Study to pay us huge for our data </p>\n\n<p>i had it for a month, installed the app and got 5$ literally for nothing via paypal</p>\n\n<p>now google has its own rewarding system but it is reserved to just its recommended members.</p>\n\n<p>so yeah thats it.</p>\n\n<p>Edit : THE WORD &#39;COULD&#39; IN THE TITLE IS THERE FOR A REASON.</p>\n</div><!-- SC_ON -->",
  "score": 246,
  "permalink": "/r/CryptoCurrency/comments/oyetvw/we_could_have_been_rich_if_facebook_and_google/",
  "subreddit": "CryptoCurrency",
  "id": "oyetvw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "YES! you read that right, ever imagined why when you wanted to buy something or\nsomething you have talked about comes as an ad in future times?\n\nSuppose you wanted a TV and you were talking about this to your family or friend\nor maybe you had searched about TV in your browser, you would have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうなんです、あなたは何かを買おうとしたときに、なぜかと考えたことはありませんか？\nあなたが何かを買おうとしたときや、あなたが話したことが未来の広告として出てくるのはなぜだろう？\n\n例えば、あなたがテレビが欲しいと思って、家族や友人にその話をしていたとします。\nあるいは、ブラウザでテレビについて検索したとしましょう。",
      "title": "フェイスブックやグーグルが収集したデータの対価を支払ってくれれば、私たちはリッチになれたはずです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的！你没有看错，你有没有想过为什么当你想买东西或\n你所谈论的东西会在未来的时间里成为广告？\n\n假设你想买一台电视，并且你和你的家人或朋友谈论过这个问题\n或者你在浏览器中搜索了关于电视的信息，你会有...",
      "title": "如果Facebook和Google为他们收集的数据付费，我们本可以成为富人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的！你沒有看錯，你有沒有想過爲什麼當你想買東西或\n你所談論的東西會在未來的時間裏成爲廣告？\n\n假設你想買一臺電視，並且你和你的家人或朋友談論過這個問題\n或者你在瀏覽器中搜索了關於電視的信息，你會有...",
      "title": "如果Facebook和Google爲他們收集的數據付費，我們本可以成爲富人。"
    }
  ]
}