{
  "author": "nudderthrowaway",
  "original_created_utc": 1625219150,
  "title": "Why is it unheard of and kinda looked down upon for a woman to pay for a man's food?",
  "created_utc": 1625252128,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>22M I work with an all-female department, they&#39;re all fairly older than me so they treat me like a younger family member. More often than not they would treat me to lunch, I see nothing wrong with it but it was just a few weeks ago I was talking with my parents and they asked how work was going. I told them about how friendly the department I&#39;m working with is, and how they usually buy me lunch. And that&#39;s where I set my dad off on a rant about how he worked hard on the oil rig as a young man and would never accept &#39;handouts&#39; because &quot;that&#39;s what being a man is.&quot; Long story short he must&#39;ve told my uncle&#39;s and grandpa because now I get the &quot;work hard and be a man&quot; talk whenever I see them, even though I work a desk job.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/oc6shx/why_is_it_unheard_of_and_kinda_looked_down_upon/",
  "subreddit": "TooAfraidToAsk",
  "id": "oc6shx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "22M I work with an all-female department, they're all fairly older than me so\nthey treat me like a younger family member. More often than not they would treat\nme to lunch, I see nothing wrong with it but it was just a few weeks ago I was\ntalking with my parents and they asked how work was going. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "22M 私は女性ばかりの部署で働いていますが、みんな私よりかなり年上なので\n年下の家族のように接してくれます。頻繁にランチをご馳走してくれます。\n何の問題もないのですが、ほんの数週間前に両親と話していたら\n両親と話していて、仕事はどうかと聞かれました。I...",
      "title": "なぜ、女性が男性の食事代を払うことは前代未聞であり、見下されているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "22M 我和一个全女性的部门一起工作，她们都比我大，所以\n他们对待我就像对待一个年轻的家庭成员。他们经常会请我吃午饭。\n我认为这没有什么不妥，但就在几周前，我和我的父母聊天时\n我和父母聊天，他们问我工作进展如何。I...",
      "title": "为什么女人为男人的食物买单是闻所未闻的，而且还有点被看不起？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "22M 我和一個全女性的部門一起工作，她們都比我大，所以\n他們對待我就像對待一個年輕的家庭成員。他們經常會請我喫午飯。\n我認爲這沒有什麼不妥，但就在幾周前，我和我的父母聊天時\n我和父母聊天，他們問我工作進展如何。I...",
      "title": "爲什麼女人爲男人的食物買單是聞所未聞的，而且還有點被看不起？"
    }
  ]
}