{
  "author": "aussiesis",
  "original_created_utc": 1650691680,
  "title": "Should I kick my roommate out for starving my dogs?",
  "created_utc": 1650706641,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was away for 3 weeks and she offered to look after my pets. I left her like 15 cans of dog food, frozen dog food and like 15kgs of dry food.&lt;/p&gt;\n\n&lt;p&gt;None of the cans or frozen food were touched, and only a small amount of the dry food was used.&lt;/p&gt;\n\n&lt;p&gt;My dogs are extremely skinny. I&amp;#39;m amazed they aren&amp;#39;t worse than what they are tbh.&lt;/p&gt;\n\n&lt;p&gt;Should I kick her out? This is extremely upsetting for me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/u9y87r/should_i_kick_my_roommate_out_for_starving_my_dogs/",
  "subreddit": "NoStupidQuestions",
  "id": "u9y87r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was away for 3 weeks and she offered to look after my pets. I left her like 15\ncans of dog food, frozen dog food and like 15kgs of dry food.\n\nNone of the cans or frozen food were touched, and only a small amount of the dry\nfood was used.\n\nMy dogs are extremely skinny. I'm amazed they aren't worse…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は3週間留守にしますが、彼女は私のペットの世話を申し出てくれました。私は彼女に15個ほどの\n缶のドッグフード、冷凍ドッグフード、15kgのドライフードを預けました。\n\n缶詰や冷凍食品は一切手を付けず、ドライフードもほんの少ししか使わなかった。\nドライフードは少量しか使っていませんでした。\n\nうちの犬はものすごく痩せているんです。よくぞここまで...と思うほど。",
      "title": "私の犬を餓死させたルームメイトを追い出すべきですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我离开了3个星期，她提出要照顾我的宠物。我给她留下了大约15\n罐装狗粮、冷冻狗粮和大约15公斤干粮。\n\n罐头和冷冻食品都没有被动过，只有少量的干粮被使用。\n粮被使用。\n\n我的狗非常瘦小。我很惊讶他们没有更糟糕......",
      "title": "我应该把我的室友赶出去吗，因为他饿坏了我的狗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我離開了3個星期，她提出要照顧我的寵物。我給她留下了大約15\n罐裝狗糧、冷凍狗糧和大約15公斤乾糧。\n\n罐頭和冷凍食品都沒有被動過，只有少量的乾糧被使用。\n糧被使用。\n\n我的狗非常瘦小。我很驚訝他們沒有更糟糕......",
      "title": "我應該把我的室友趕出去嗎，因爲他餓壞了我的狗？"
    }
  ]
}