{
  "author": "xXAudacityXx",
  "original_created_utc": 1638613296,
  "title": "BTC topped at 69000 and bottomed at 42000. We are living in the goofiest simulation in the universe.",
  "created_utc": 1638641949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Lighten up y’all. Clearly the Gods have a sense of humor and gave us the gift of “69” “420” Nice! &lt;/p&gt;\n\n&lt;p&gt;On a serious note, no one knows what’s gonna happen moving forward but if you’ve never experienced such a pull back, understand that we’ve recovered from harsher dips than this. 2017’s bull market was filled with dips like this. Zoom out and chill out. If it is the beginning of the bear market, then pay close attention and take notes. This isn’t the end of crypto as a whole as far as I’m concerned. Magic internet money is here to stay.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 3482,
  "permalink": "/r/CryptoCurrency/comments/r8mt7k/btc_topped_at_69000_and_bottomed_at_42000_we_are/",
  "subreddit": "CryptoCurrency",
  "id": "r8mt7k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Lighten up y’all. Clearly the Gods have a sense of humor and gave us the gift of\n“69” “420” Nice!\n\nOn a serious note, no one knows what’s gonna happen moving forward but if you’ve\nnever experienced such a pull back, understand that we’ve recovered from harsher\ndips than this. 2017’s bull market was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "元気出せよお前ら 明らかに神々はユーモアのセンスを持っていて、私たちに次のような贈り物をしました。\n\"69\" \"420\" いいね！\n\n真面目な話、この先どうなるかは誰にもわからないけど、もしあなたが\nこのような引き戻しを経験したことがない人は、私たちがもっと厳しい状況から回復してきたことを理解してください。\nこれ以上の落ち込みはない。2017年の強気相場は",
      "title": "BTCは69000でトップ、42000でボトムとなりました。私たちは、宇宙で最もグーフィーなシミュレーションの中で生きている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "轻松一下吧，你们都是。显然，上帝有幽默感，给我们的礼物是\n\"69\"\"420 \"不错!\n\n严肃地说，没有人知道未来会发生什么，但如果你从来没有经历过这样的回调，请理解我们已经从更严厉的环境中恢复过来。\n如果你从未经历过这样的回调，请理解我们已经从比这更严厉的\n跌势中恢复过来。2017年的牛市是...",
      "title": "BTC顶部为69000，底部为42000。我们正生活在宇宙中最愚蠢的模拟中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "輕鬆一下吧，你們都是。顯然，上帝有幽默感，給我們的禮物是\n\"69\"\"420 \"不錯!\n\n嚴肅地說，沒有人知道未來會發生什麼，但如果你從來沒有經歷過這樣的回調，請理解我們已經從更嚴厲的環境中恢復過來。\n如果你從未經歷過這樣的回調，請理解我們已經從比這更嚴厲的\n跌勢中恢復過來。2017年的牛市是...",
      "title": "BTC頂部爲69000，底部爲42000。我們正生活在宇宙中最愚蠢的模擬中。"
    }
  ]
}