{
  "author": "t0rnap0rt",
  "original_created_utc": 1647773378,
  "title": "How \"advanced\" was the Islam world compared to the Christian Medieval Europe (c. 7th-12th century)?",
  "created_utc": 1647785776,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a history student in Taiwan. My access to state-of-the-art Medieval studies is limited, still more limited is my knowledge of Islam, so please correct me whenever I&amp;#39;m wrong.&lt;/p&gt;\n\n&lt;p&gt;Most scholarly-reviewed textbooks in the west now praise Islam world in the Middle Ages to be advanced in medicine, science, political prowess, access to Greek and Roman texts, and religious tolerance, etc.. Few historians, however, dared to conclude that in general the whole Muslim world was simply more advenced.&lt;/p&gt;\n\n&lt;p&gt;It is of course impossible to speak of &amp;quot;advanced&amp;quot; without clear criteria. I am more interested in the following:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Education: was the Muslim world in average more literate? Was the Muslim court more &amp;quot;civilized&amp;quot; (in Norbert Elias&amp;#39;s sense) than the Europe (at least until the Renaissance)?&lt;/li&gt;\n&lt;li&gt;Greek and Roman texts: We know that Muslims preserved and studied these texts better than the Europeans, and that the former helped the latter a lot. But were these centuries-old texts more important than actual hands-on experiments in early modern scientific discoveries? (Or on the contrary: it is the rebuttal of these texts that led to new discoveries?)&lt;/li&gt;\n&lt;li&gt;Philosophy/theology and Science: Scholasticism was arguably an important predecessor of modern philosophy, even though the Church from time to time had to eliminate &amp;quot;heresies&amp;quot;. Was the Muslim world more open to philosophic inquiry and contributed to modern scientific methods (the definition of which is still contested of course)?&lt;/li&gt;\n&lt;li&gt;Medicine: Quite some sources during the Crusade have told me that medicine practice and surgery in Europe was simply barbaric or even lethal (e.g. kicking the devil out of head by drilling a hole on it; healing a minor wound on leg by chopping it off) compared to Muslim counterparts . How much of it was true? Can we obtain reliable life expectancy data or medicine textbooks to discuss the problem?&lt;/li&gt;\n&lt;li&gt;Religious tolerance: in practice and in official ideology (or religious dogma), were the Muslim sultans more willing to tolerate diverse religious communities?&lt;/li&gt;\n&lt;li&gt;Commerce: Did any part of Europe host a commerce and industry as thriving as that in Muslim world? Was Henri Pirenne right to say that Christian Europe was cut from the Mediterranean Sea during the advent of Muslims?&lt;/li&gt;\n&lt;li&gt;Did the Muslims perceive Europeans as barbarians based on aforementioned problems?&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/tiigta/how_advanced_was_the_islam_world_compared_to_the/",
  "subreddit": "AskHistorians",
  "id": "tiigta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a history student in Taiwan. My access to state-of-the-art Medieval studies\nis limited, still more limited is my knowledge of Islam, so please correct me\nwhenever I'm wrong.\n\nMost scholarly-reviewed textbooks in the west now praise Islam world in the\nMiddle Ages to be advanced in medicine,…"
}