{
  "author": "BananaH4mm0ck",
  "the_new_excerpt": "Have some more questions about factor investing. I'm about to buy my first\nshares of AVDV and AVUV. Should these be going in taxable or tax-advantaged\nretirement accounts? I'm guessing AVDV should be in taxable to claim the foreign\ntax credit, but not sure.\n\nAlso on the topic of asset allocation…",
  "original_created_utc": 1620964281,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "因子投資についてもう少し質問があります。AVDVとAVUVを初めて購入しようとしています。\nAVDVとAVUVの株を初めて買おうとしています。これらの株は、課税対象の退職金口座に入れるべきでしょうか、それとも税制優遇の退職金口座に入れるべきでしょうか？\nリタイヤメントアカウントに入れるべきでしょうか？AVDVは外国税額控除を受けるために課税口座にすべきだと思いますが、よくわかりません。\n思うのですが、よくわかりません。\n\nまた、アセットアロケーションの話題ですが...。",
      "title": "ファクター・インベスティング AVDV AVUV固有の質問"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于因子投资还有一些问题。我即将购买我的第一\nAVDV和AVUV的股票。这些股票应该放在应税还是税收优惠的\n退休账户？我猜测AVDV应该放在应税账户中，以便申请外国税收抵免，但不确定。\n税收抵免，但不确定。\n\n另外，关于资产配置的话题......",
      "title": "因素投资AVDV AVUV具体问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於因子投資還有一些問題。我即將購買我的第一\nAVDV和AVUV的股票。這些股票應該放在應稅還是稅收優惠的\n退休賬戶？我猜測AVDV應該放在應稅賬戶中，以便申請外國稅收抵免，但不確定。\n稅收抵免，但不確定。\n\n另外，關於資產配置的話題......",
      "title": "因素投資AVDV AVUV具體問題"
    }
  ],
  "title": "Factor Investing AVDV AVUV specific questions",
  "created_utc": 1621016143,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Have some more questions about factor investing. I&#39;m about to buy my first shares of AVDV and AVUV. Should these be going in taxable or tax-advantaged retirement accounts? I&#39;m guessing AVDV should be in taxable to claim the foreign tax credit, but not sure. </p>\n\n<p>Also on the topic of asset allocation (and keeping in mind rebalancing), is there an optimal strategy for where to park each fund? Here&#39;s my asset allocation:</p>\n\n<ul>\n<li>US Equities (VTSAX) - 60%</li>\n<li>International Equities (VTIAX) - 21.6%</li>\n<li>Emerging Market Equities (VEMAX) - 2.4%</li>\n<li>US Small Cap Value (AVUV) - 10%</li>\n<li>International Small Cap Value (AVDV) - 6%</li>\n</ul>\n\n<p>My taxable accounts have exclusively VTSAX currently and account for 25% of my overall total investments. Keeping in mind tax efficiency and also flexibility with rebalancing in the future and avoiding taxable events, should I be doing this differently?</p>\n</div><!-- SC_ON -->",
  "score": 14,
  "permalink": "/r/Bogleheads/comments/nbznxa/factor_investing_avdv_avuv_specific_questions/",
  "subreddit": "Bogleheads",
  "id": "nbznxa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802221
}