{
  "author": "Juicebox3234",
  "original_created_utc": 1640296042,
  "title": "Is it just me when I say it actually doesn’t feel like Christmas this year?",
  "created_utc": 1640302850,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know people say this EVERY year so I don’t want to ask this question. But genuinely Christmas is in 3 days and it still feels like November. This isn’t normal and I have never felt this way. I always get a bit “festive” in December but I don’t feel any different. The christmas tree in my living room makes me feel nothing. That is not normal whatsoever. Normally when I look at that stupid fucking tree Christmas spirit fills me. But when I look at it now I can’t say that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/rn67zh/is_it_just_me_when_i_say_it_actually_doesnt_feel/",
  "subreddit": "TooAfraidToAsk",
  "id": "rn67zh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know people say this EVERY year so I don’t want to ask this question. But\ngenuinely Christmas is in 3 days and it still feels like November. This isn’t\nnormal and I have never felt this way. I always get a bit “festive” in December\nbut I don’t feel any different. The christmas tree in my living…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎年言われることなので、この質問はしたくないのですが。でも\n純粋にクリスマスまであと3日なのに、まだ11月のような気分です。これは\nこんな気持ちになったのは初めてです。私はいつも12月になると少し「お祭り気分」になるのですが\nが、特に違和感はない。リビングにあるクリスマスツリー...",
      "title": "今年はクリスマスという感じがしないのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道人们每年都会这样说，所以我不想问这个问题。但是\n真正的圣诞节还有3天就到了，但感觉上仍然是11月。这并不\n正常，我从来没有这种感觉。我在12月总是有点 \"节日气氛\"。\n但我并不觉得有什么不同。我家客厅里的圣诞树也是如此。",
      "title": "当我说今年实际上感觉不到是在过圣诞节时，是不是只有我在说？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道人們每年都會這樣說，所以我不想問這個問題。但是\n真正的聖誕節還有3天就到了，但感覺上仍然是11月。這並不\n正常，我從來沒有這種感覺。我在12月總是有點 \"節日氣氛\"。\n但我並不覺得有什麼不同。我家客廳裏的聖誕樹也是如此。",
      "title": "當我說今年實際上感覺不到是在過聖誕節時，是不是隻有我在說？"
    }
  ]
}