{
  "author": "Brinothedino",
  "original_created_utc": 1634315397,
  "title": "Don't FOMO out of your alt position for BTC. Think of BTC growth as the slow pulling back on a slingshot for alts!",
  "created_utc": 1634362244,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s been such a good year for alts that it seems like many newbies (and not so newbies) are starting to feel mad FOMO watching Bitcoin soar and get all the press while many alts are seemingly stagnant. </p>\n\n<p>This would be a good time to remind many that this is the natural progression that you may not have had experience with yet. But like the title says, don&#39;t look at it like Bitcoin is stealing the thunder of your alts, Bitcoin growth is the slow and steady pullback if a slingshot, and at some point it will let alts absolutely fly. The longer we see Bitcoin growth now, the bigger the snapback once papa Bitcoin decides to chill and find it&#39;s footing. </p>\n\n<p>My biggest mistake as a rookie investor was chasing pumps only to see my old position jump substantially after I sold to buy the top of something else. Avoid my mistakes and just hold what you believe in. There is a reason this type of info gets regurgitated here often, and it&#39;s because fomo can get intense and we all get by with community support around here. Much love to you all. Keep your heads screwed on tight.</p>\n\n<p>Your friendly neighborhood brinothedino.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/q8s22u/dont_fomo_out_of_your_alt_position_for_btc_think/",
  "subreddit": "CryptoCurrency",
  "id": "q8s22u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's been such a good year for alts that it seems like many newbies (and not so\nnewbies) are starting to feel mad FOMO watching Bitcoin soar and get all the\npress while many alts are seemingly stagnant.\n\nThis would be a good time to remind many that this is the natural progression\nthat you may not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年はアルトにとって非常に良い年だったので、多くの初心者（そうでない人も）が、ビットコインが高騰し、すべてを手に入れるのを見て狂喜し始めているようです。\nビットコインが急騰して報道されているのを見て、多くの初心者（そうでない人も）が異常なFOMOを感じ始めています。\n多くのアルトが停滞しているように見えます。\n\nこれは、多くの人に、これが自然な進行であることを思い出させるのに良い機会です。\nこれが自然な流れであることを多くの人に知ってもらう良い機会だと思います...",
      "title": "BTCのアルトポジションをFOMOしないように。BTCの成長は、アルトにとってのパチンコのゆっくりとした引き戻しだと考えてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年是代理币的好年景，似乎许多新手（或不太熟练的新手）看着比特币飙升，开始感到疯狂的恐惧。\n新手）开始感到疯狂的FOMO，看着比特币飙升并得到所有的\n而许多代理币却似乎停滞不前。\n\n这将是一个很好的时间来提醒许多人，这是一个自然的发展过程\n你可能不...",
      "title": "不要为了BTC而FOMO出你的alt位置。把BTC的增长看成是对alts的弹弓的缓慢拉回!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年是代理幣的好年景，似乎許多新手（或不太熟練的新手）看着比特幣飆升，開始感到瘋狂的恐懼。\n新手）開始感到瘋狂的FOMO，看着比特幣飆升並得到所有的\n而許多代理幣卻似乎停滯不前。\n\n這將是一個很好的時間來提醒許多人，這是一個自然的發展過程\n你可能不...",
      "title": "不要爲了BTC而FOMO出你的alt位置。把BTC的增長看成是對alts的彈弓的緩慢拉回!"
    }
  ]
}