{
  "author": "Myxozoa",
  "the_new_excerpt": "When the pandemic hit and lockdowns started happening, my reclusive friends and\nI were all stoked to not have to go anywhere or see anyone. However, over the\ncourse of the last year one by one they all started getting sick of it and\nhoping for group activities to open up again. I, on the other hand,…",
  "original_created_utc": 1614127034,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当疫情来袭，封锁开始发生时，我的隐居朋友和\n我都兴奋得不得了，哪里都不用去，哪里都不用见人。然而，在\n在去年的过程中，他们都开始厌恶它，并一个接一个地\n希望团体活动能再次开放。而我，则...",
      "title": "还有人还是绝对喜欢一直在家吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當疫情來襲，封鎖開始發生時，我的隱居朋友和\n我都興奮得不得了，哪裏都不用去，哪裏都不用見人。然而，在\n在去年的過程中，他們都開始厭惡它，並一個接一個地\n希望團體活動能再次開放。而我，則...",
      "title": "還有人還是絕對喜歡一直在家嗎？"
    }
  ],
  "title": "Is anyone else still absolutely loving being at home all the time?",
  "created_utc": 1614149855,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When the pandemic hit and lockdowns started happening, my reclusive friends and I were all stoked to not have to go anywhere or see anyone. However, over the course of the last year one by one they all started getting sick of it and hoping for group activities to open up again. I, on the other hand, am still just as stoked to get up and shuffle over to my office in my robe and slippers to spend all day on the computer as I was on day one.</p>\n\n<p>I absolutely love how I don&#39;t have a morning commute, and I don&#39;t have my boss looking over my shoulder at work all the time. I love how I don&#39;t have any family obligations, but I can still chat and play games with my friends over discord or whatever. I&#39;ve had more time to cook and bake, more time to read and relax, and just more overall control over my life, since I never wanted to do anything outside the house in the first place. It&#39;s been great spending so much time with my girlfriend as well; I feel like we&#39;ve gotten a lot closer in the past year than we were before.</p>\n\n<p>I know it&#39;s shitty to say with all that&#39;s going on, but I&#39;ve been loving my life this past year, and I absolutely don&#39;t want it to change any time soon.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/lqycrj/is_anyone_else_still_absolutely_loving_being_at/",
  "subreddit": "TooAfraidToAsk",
  "id": "lqycrj",
  "is_self": true,
  "media": null,
  "is_video": false
}