{
  "author": "Th3N0mad47",
  "the_new_excerpt": "I just want to ask him, how his shorting positions are doing, considering that\nthe South African Stock Market has and continues to outperform the American,\nEuropean and Asian stock markets as the South African economy is now coming out\nof recession and investors are streaming to South Africa.\n\nDo…",
  "original_created_utc": 1619710223,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼に聞きたいのは、彼の空売りのポジションはどうなっているのか、ということです。\n南アフリカの株式市場は、アメリカやヨーロッパ、Aクラスの株式市場よりも優れたパフォーマンスを示しています。\n南アフリカの株式市場は、アメリカ、ヨーロッパ、アジアの株式市場を上回り続けています。\n南アフリカの株式市場は、アメリカ、ヨーロッパ、アジアの株式市場を上回り続けています。\n\nド...",
      "title": "南アフリカという国を短くすることを決めたガイへ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只想问他，他的做空头寸做得如何，考虑到\n考虑到南非股市已经并继续超过美国、欧洲和亚洲股市的表现。\n欧洲和亚洲股市的表现，因为南非经济现在正在走出衰退，而投资者也在等待。\n衰退，投资者纷纷涌向南非。\n\n你是否...",
      "title": "致决定做空南非国家的那个人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想問他，他的做空頭寸做得如何，考慮到\n考慮到南非股市已經並繼續超過美國、歐洲和亞洲股市的表現。\n歐洲和亞洲股市的表現，因爲南非經濟現在正在走出衰退，而投資者也在等待。\n衰退，投資者紛紛湧向南非。\n\n你是否...",
      "title": "致決定做空南非國家的那個人"
    }
  ],
  "title": "To the Guy who decided to Short the country of South Africa",
  "created_utc": 1619737037,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just want to ask him, how his shorting positions are doing, considering that the South African Stock Market has and continues to outperform the American, European and Asian stock markets as the South African economy is now coming out of recession and investors are streaming to South Africa.</p>\n\n<p>Do you plan on holding your short positions and hoping for the best (Well, worst for the country, best for you), or have you already, or are you at least planning to sell your short positions if things continue to improve for the South African Stock Market and economy?</p>\n\n<p>Also, to other investors, do you think that he has made a huge blunder with his decision, or do you think he should hold as he made a possibly good decision?</p>\n</div><!-- SC_ON -->",
  "score": 3158,
  "permalink": "/r/wallstreetbets/comments/n16wga/to_the_guy_who_decided_to_short_the_country_of/",
  "subreddit": "wallstreetbets",
  "id": "n16wga",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380970807
}