{
  "author": "Pma2kdota",
  "original_created_utc": 1631842572,
  "title": "The biggest rugpull on the Harmony (ONE) network so far: Radiant Lands (RADI)",
  "created_utc": 1631878234,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit 1: THANK YOU ANONYMOUS USER FOR MY FIRST EVER GOLD AWARD!</p>\n\n<p><strong>IMPORTANT EDIT 3: Like I said in my original post, the story was still developing when I posted. As more people contacted me with their stories, I learned that the person one of the pictures below (promoting the airdrop in the discord) was NOT part of the dev team. He was hired by them to post content and help community members. They are an NFT artist not associated with the actual rugpull and have also been affected by the rugpull.</strong></p>\n\n<p><strong>My apologies to</strong> <a href=\"https://davinci.gallery/profile/PixiMan\"><strong>https://davinci.gallery/profile/PixiMan</strong></a> <strong>it was not my intention to slander you by leaving your name uncensored. At the bottom of this post is a quote from a second admin hired by the dev team to help manage the community, that may help others avoid rugpulls in the future.</strong></p>\n\n<p>First of all, luckily I had nothing invested in this project. But full disclosure I do have money in $ONE and a different project on the Harmony network.</p>\n\n<p>This is not the first rugpull (after Lockswap and JarJar Token), but it is the biggest.</p>\n\n<p>The concept of Radiant Lands was to say the least, very ambitious. To put simply, a VR version of Decentraland (MANA) but on the Harmony network, using their own token (RADI). This project JUST got rugged, according to <a href=\"https://twitter.com/crypto10x1/status/1438566345625391116\">https://twitter.com/crypto10x1/status/1438566345625391116</a> so we&#39;re hot of the press here guys. Some parts of the story may be missing as the community starts to gather more info on the Dev, and where the funds may have been transferred. I hope i have covered as much as I can to accurately portray the story as it is so far.</p>\n\n<p>Rugpull aftermath:</p>\n\n<ol>\n<li>The dev has deleted their reddit acc, their comments on the thread but the full text is still up describing the project: <a href=\"https://www.np.reddit.com/r/harmony_one/comments/pejynn/im_frederik_the_creator_of_radiant_isle_a_project/?utm_medium=android_app&amp;utm_source=share\">link</a> . here is an update from the dev from 2 weeks ago: <a href=\"https://www.np.reddit.com/r/harmony_one/comments/po53xl/radiant_isle_project_update/\">link</a> confirming all plots of land were sold out. <strong>THESE ARE NON-PARTICIPATION LINKS TO REDDIT SO THAT AUTOMOD DOESN&#39;T TAKE THE POST DOWN. they are SAFE you may remove the &quot;np.&quot; before reddit</strong></li>\n<li>the website is down: <a href=\"http://radiantisle.io/\">http://radiantisle.io/</a> . Here on imgur is the website registration by the dev (not doxxing, public information from <a href=\"https://main.whoisxmlapi.com/\">https://main.whoisxmlapi.com/</a>) <a href=\"https://imgur.com/a/gxqFRFW\">https://imgur.com/a/gxqFRFW</a>HERE are snapshots from the internet wayback machine on what the website looked like in AUGUST: <a href=\"https://web.archive.org/web/20210830173433/http://radiantisle.io/\">https://web.archive.org/web/20210830173433/http://radiantisle.io/</a>, <a href=\"https://web.archive.org/web/20210830151226/http://radiantisle.io/\">https://web.archive.org/web/20210830151226/http://radiantisle.io/</a></li>\n</ol>\n\n<p><a href=\"https://preview.redd.it/pl9f89epvyn71.png?width=1524&amp;format=png&amp;auto=webp&amp;s=aa21372d9054e5d3ff4220ebeea87f16c2da9fcb\">promising picture of what the VR world could have looked like</a></p>\n\n<ol>\n<li><p>the twitter has been deleted: <a href=\"https://twitter.com/radiantisle\">https://twitter.com/radiantisle</a>. pics from the community bottom of post</p></li>\n<li><p>discord is still up but, the dev is gone but i was able to interview some members who provided me with some detailed info about the now dead project.</p></li>\n<li><p>on sushiswap the contract pair is :</p></li>\n</ol>\n\n<p><a href=\"https://app.sushi.com/swap?inputCurrency=0x8Eb03202275bD598AdC23678008eF88655544910\">https://app.sushi.com/swap?inputCurrency=0x8Eb03202275bD598AdC23678008eF88655544910</a></p>\n\n<p>which currently puts 1 WONE (wrapped ONE) as ~200-220 RADI. do NOT buy as this will quickly become worthless when more people are aware of the rug.</p>\n\n<p>So let&#39;s talk money. The ONE-RADI pool on sushiswap (now removed) had around $50K USD in liquidity, now <strong>all gone</strong>.</p>\n\n<p>The land plots that were purchaseable on Davinci <a href=\"https://davinci.gallery/explore/tag/radiant%20lands\">https://davinci.gallery/explore/tag/radiant%20lands</a> are now locked out and gone, so users cannot sell their assets.</p>\n\n<p>According to user BigThommy in the discord, the average land purchase for a</p>\n\n<ul>\n<li>1x1 plot was 500 ONE (aprox $80 USD now)</li>\n<li>1x2 plot was 1000 ONE (aprox $160 USD now)</li>\n<li>and larger plots went all the way to $2000-$3000 USD (at the time of sale)</li>\n<li>All 1128 parcels of land were sold out.</li>\n<li>The &quot;genesis sectors&quot; of land (15 total) were also sold for ~0.1 ETH each on Opensea. you can see them here <a href=\"https://opensea.io/collection/radiant-isle\">https://opensea.io/collection/radiant-isle</a></li>\n</ul>\n\n<p>An anonymous user who would rather not to be named invested in lands with a partner has lost around $20k USD.</p>\n\n<p>What are lands? Lands/plots are quite popular as of recently on many Harmony NFT sales. They reflect some ownership of the virtual ecosystem, whether an actual &quot;game world&quot; or just theoretical since many of these projects do not even have a functioning game at all.</p>\n\n<p>Here is one of the smallest lands.</p>\n\n<p><a href=\"https://preview.redd.it/5mrzvr3svyn71.jpg?width=534&amp;format=pjpg&amp;auto=webp&amp;s=4ace1c9e70b03c7b946dcad878c38175c36b6471\">a plot of land for sale (500 ONE)</a></p>\n\n<p>These projects have some redflags to be aware of, like very generous token drops for early purchasers of the lands, which are usually on another chain like ETH.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/b8pgeljyvyn71.png?width=1362&amp;format=png&amp;auto=webp&amp;s=d15547cbb34d93d18436a1119e4449910b76bd27\">edit: This is admin hired by the devs, NOT associated with the rugpull </a></p>\n\n<p>Here is some excitment from the Twitter community about those lands selling out, just a few days ago before this rug.</p>\n\n<p><a href=\"https://preview.redd.it/epu8fewtvyn71.png?width=810&amp;format=png&amp;auto=webp&amp;s=8511be8c5ae35c7c04f3792439c9cba4b575a742\">twitter</a></p>\n\n<p>Behind every rugpull, there is a community of users who have been rugged. My heart goes out to those affected by this scam, and hope the dev will be caught and can&#39;t create any more scams. Always be wary of projects that make huge promises.</p>\n\n<p>Thank you for the information to users BigThommy and anon user on discord who helped me gather the info for this story.</p>\n\n<p>&#x200B;</p>\n\n<p>edit 2:</p>\n\n<p>To answer a question that was deleted by the automod due to insufficient karma</p>\n\n<blockquote>\n<p>&quot;It definitely sucks that this happens, and will likely happen again in the future. You mentioned the red flag of generous token drops for early adopters. Are there any other signs that show up before these kinds of things happen?&quot;</p>\n</blockquote>\n\n<p>That&#39;s a great question, the main thing that sticks out to me is an unfinished product. I&#39;m not talking about a beta or a work in progress, i mean when all you can do with the project is purchase assets.</p>\n\n<p>To clarify my point on these fishy airdrops, the requirement was purchasing NFT lands on Opensea (using ETH) or Davinci to qualify. In contrast to other projects that airdropped tokens simply for participation, because the devs were able to fix bugs, improve user experience and build a community.</p>\n\n<p>Edit 3: According to another mod (ThePovertyLine) hired by the dev team,</p>\n\n<blockquote>\n<p>&quot;The owner had every detail all mapped out, he had an answer to every question that was ever asked of him. The land on davinci would sell out almost immediately after minting so that’s why people were looking into it so much. He announced our liquidity pool was being moved yesterday and he moved it to Defi kingdom and the total liquidity pool was around 100k there was also an announcement this morning about us getting onto another pool. He said we could make things to put into the vr world by making things in blender 3D design software and that we would be able to import .blend files. He was really really detailed about everything that we would be able to expect. Hope some of this information helps this not happen to anyone else&quot;</p>\n</blockquote>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/5V2dOL3YHs9NDh7KYzMZDU8XJpkj-wNhrEdon966RyI.jpg?auto=webp&s=268d27790d2a221ef2be4b648b09b9125d0a7d35",
          "width": 319,
          "height": 709
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/5V2dOL3YHs9NDh7KYzMZDU8XJpkj-wNhrEdon966RyI.jpg?width=108&crop=smart&auto=webp&s=ea65fb076ba0fdd1a9d8b4bcd17011abc0292b0f",
            "width": 108,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/5V2dOL3YHs9NDh7KYzMZDU8XJpkj-wNhrEdon966RyI.jpg?width=216&crop=smart&auto=webp&s=ce35a7903f381952f05c7a90ae9508f40bc02801",
            "width": 216,
            "height": 432
          }
        ],
        "variants": {},
        "id": "Fs00iNAHUKH1hkwa_HTnW741vAJJ1ILs26tiVnrYQGg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ppqnso/the_biggest_rugpull_on_the_harmony_one_network_so/",
  "subreddit": "CryptoCurrency",
  "id": "ppqnso",
  "is_self": true,
  "media": {
    "oembed": {
      "provider_url": "http://imgur.com",
      "description": "Post with 0 views.",
      "title": "Imgur",
      "url": "https://imgur.com/a/gxqFRFW",
      "thumbnail_width": 600,
      "height": 769,
      "width": 500,
      "html": "<iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fimgur.com%2Fa%2FgxqFRFW%2Fembed%3Fpub%3Dtrue%26ref%3Dhttps%253A%252F%252Fembed.ly%26w%3D500&display_name=Imgur&url=https%3A%2F%2Fimgur.com%2Fa%2FgxqFRFW&image=https%3A%2F%2Fi.imgur.com%2FjnKGMNS.jpg%3Ffb&key=2aa3c4d5f3de4f5b9120b660ad850dc9&type=text%2Fhtml&schema=imgur\" width=\"500\" height=\"769\" scrolling=\"no\" title=\"Imgur embed\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen=\"true\"></iframe>",
      "version": "1.0",
      "provider_name": "Imgur",
      "thumbnail_url": "https://i.imgur.com/jnKGMNS.jpg?fb",
      "type": "rich",
      "thumbnail_height": 315
    },
    "type": "imgur.com"
  },
  "is_video": false,
  "the_new_excerpt": "Edit 1: THANK YOU ANONYMOUS USER FOR MY FIRST EVER GOLD AWARD!\n\nIMPORTANT EDIT 3: Like I said in my original post, the story was still\ndeveloping when I posted. As more people contacted me with their stories, I\nlearned that the person one of the pictures below (promoting the airdrop in the\ndiscord)…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Edit 1: THANK YOU ANONYMOUS USER FOR MY FIRST EVER GOLD AWARD!\n\n重要な編集3: 最初の投稿で言ったように、私が投稿したときにはストーリーはまだ発展途上でした。\n私が投稿したときには、ストーリーはまだ発展途上でした。より多くの人が自分の話を連絡してきたので、私はこの写真の人物が\n下の写真の人（discordでエアドロップの宣伝をしている人）は\ndiscordでエアドロップを宣伝している）...)",
      "title": "これまでのハーモニー（ONE）ネットワークの中で最大のラグプル。ラディアント・ランド（RADI"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑1：感谢匿名用户给我的第一个金奖!\n\n重要编辑3。就像我在原帖中说的那样，当我写下这个故事的时候，它还在发展之中。\n进展。随着越来越多的人与我联系，讲述他们的故事。\n我了解到以下图片中的一个人（促进空投的人在\n聊天室）...)",
      "title": "迄今为止，和谐号（ONE）网络上最大的地毯式拉动。Radiant Lands (RADI)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯1：感謝匿名用戶給我的第一個金獎!\n\n重要編輯3。就像我在原帖中說的那樣，當我寫下這個故事的時候，它還在發展之中。\n進展。隨着越來越多的人與我聯繫，講述他們的故事。\n我瞭解到以下圖片中的一個人（促進空投的人在\n聊天室）...)",
      "title": "迄今爲止，和諧號（ONE）網絡上最大的地毯式拉動。Radiant Lands (RADI)"
    }
  ]
}