{
  "author": "ghfjdkslapqowieuruty",
  "the_new_excerpt": "In the past few months on YouTube I have seen ads for blatant pyramid schemes,\nget-rich-quick scams which straight up ask for your credit card info,\n“charities” which ask you to “donate” to “sick children” on random dodgy\nwebsites without saying what sickness the child has or why so much money…",
  "original_created_utc": 1614345302,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几个月里，我在YouTube上看到了公然的传销计划的广告。\n快速致富的骗局，直接向你索要信用卡信息。\n\"慈善机构 \"要求你 \"捐款 \"给 \"生病的孩子\"，在随机的可疑的\n网站上不说孩子得了什么病，也不说为什么要花这么多钱... ...",
      "title": "为什么YouTube允许明目张胆的骗局在其平台上做广告？为什么没有美国或欧盟的法律，迫使YouTube监管他们的广告？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾個月裏，我在YouTube上看到了公然的傳銷計劃的廣告。\n快速致富的騙局，直接向你索要信用卡信息。\n\"慈善機構 \"要求你 \"捐款 \"給 \"生病的孩子\"，在隨機的可疑的\n網站上不說孩子得了什麼病，也不說爲什麼要花這麼多錢... ...",
      "title": "爲什麼YouTube允許明目張膽的騙局在其平臺上做廣告？爲什麼沒有美國或歐盟的法律，迫使YouTube監管他們的廣告？"
    }
  ],
  "title": "Why does YouTube allow blatant scams to advertise on their platform? Why are there no US or EU laws which force YouTube to regulate their ads?",
  "created_utc": 1614357871,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the past few months on YouTube I have seen ads for blatant pyramid schemes, get-rich-quick scams which straight up ask for your credit card info, “charities” which ask you to “donate” to “sick children” on random dodgy websites without saying what sickness the child has or why so much money is needed to cure it, and fake products with “before and after” pictures which are blatantly photoshopped. About half of the ads I receive are for obvious scams which I highly suspect are illegal. </p>\n\n<p>How can YouTube present itself as a family friendly platform while allowing criminals and fraudsters to advertise on their platform? Where do they draw the line? Would they take down an ad for heroin? An ad which gave you a virus when you clicked on it? Why is nobody cracking down on this? YouTube is facilitating illegal scams, which is almost certainly causing children and naive adults to lose money, as well as causing annoyance and making their platform look trashy. It didn’t used to be like this ten years ago, you would get normal ads for normal products, and I don’t understand (a) how the current situation arose or (b) why US and EU regulators don’t seem to care.</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/NoStupidQuestions/comments/lsxgo9/why_does_youtube_allow_blatant_scams_to_advertise/",
  "subreddit": "NoStupidQuestions",
  "id": "lsxgo9",
  "is_self": true,
  "media": null,
  "is_video": false
}