{
  "author": "Kohthefinalone",
  "original_created_utc": 1652558606,
  "title": "I'm 19 and my mother just explicitly told me I'm not allowed to leave the house when she's away, and she'll know if I do because of the camera doorbell in front of the house. Is this normal?",
  "created_utc": 1652586941,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For context, In my entire life I have never once gone out that front door unless it was to go to school or if we were all going out, and I always had this vague sense that I wouldn&amp;#39;t be allowed to just walk through that door. Every time I bring it up on reddit people said I should just go out the front door and there&amp;#39;s no reason I wouldn&amp;#39;t be allowed to because I&amp;#39;m a grown man. But just earlier, clear as day she said not to leave the house and that I&amp;#39;ll be in trouble if I do.&lt;/p&gt;\n\n&lt;p&gt;Should I just accept that until I move out one day or is there something wrong here?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/upp77m/im_19_and_my_mother_just_explicitly_told_me_im/",
  "subreddit": "NoStupidQuestions",
  "id": "upp77m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For context, In my entire life I have never once gone out that front door unless\nit was to go to school or if we were all going out, and I always had this vague\nsense that I wouldn't be allowed to just walk through that door. Every time I\nbring it up on reddit people said I should just go out the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の人生において、一度も玄関から出たことがありません。\n学校に行くときや、みんなで出かけるとき以外は、一度もその玄関から出たことがありませんでした。\nそのドアを通ることは許されないと、いつも漠然と感じていました。毎回\nこの話をREDDITに載せるたびに、みんなは「玄関から出ればいい」と...。",
      "title": "私は19歳ですが、母から「留守中は家を出てはいけない」とはっきり言われ、家の前にあるカメラの呼び鈴のせいで外出したらバレてしまうんです。これは普通なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就背景而言，在我的整个生命中，我从未走出过那扇前门，除非\n除非是去学校或我们都要出去，而我总是有一种模糊的\n我一直有一种模糊的感觉，就是我不会被允许随便走过那扇门。每当我\n在Reddit上提出这个问题时，人们都说我应该直接从...",
      "title": "我19岁了，我母亲刚刚明确告诉我，她不在的时候我不能离开家，如果我离开，她会知道，因为家门口有摄像头门铃。这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就背景而言，在我的整個生命中，我從未走出過那扇前門，除非\n除非是去學校或我們都要出去，而我總是有一種模糊的\n我一直有一種模糊的感覺，就是我不會被允許隨便走過那扇門。每當我\n在Reddit上提出這個問題時，人們都說我應該直接從...",
      "title": "我19歲了，我母親剛剛明確告訴我，她不在的時候我不能離開家，如果我離開，她會知道，因爲家門口有攝像頭門鈴。這正常嗎？"
    }
  ]
}