{
  "author": "Hard_working247",
  "the_new_excerpt": "NEW YORK (Reuters) - U.S. stocks rallied on Monday, as a round of strong\neconomic data on the labor market and services sector buoyed investor optimism\nfor the economic reopening and a muted climb in the 10-year U.S. Treasury yield\nkept inflation worries at bay.\n\nAn ISM survey for March showed a…",
  "original_created_utc": 1617651612,
  "localize": [
    {
      "locale": "ja-JA",
      "the_new_excerpt": "ニューヨーク（ロイター） - 月曜日、米国の株式は、一連の強い経済指標を受けて上昇しました。\n労働市場やサービス業などの経済指標が好調で、投資家の景気回復への期待が高まった。\n景気回復への期待感が高まり、米国10年債利回りの上昇が抑制されたため、米国株は上昇した。\nインフレ懸念が抑えられました。\n\n3月に発表されたISM調査では、労働市場とサービス業の...",
      "title": "ダウ、S&P500は好調な経済指標に後押しされて過去最高を更新"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纽约(Reuters)--美国股市周一反弹，因一轮强劲的。\n劳动力市场和服务业的经济数据提振了投资者的乐观情绪。\n为经济重启和美国10年期国债收益率的温和攀升。\n保持了对通胀的担忧。\n\n3月ISM调查显示，美国3月份的通胀率为...",
      "title": "受强劲经济数据提振，道指、标普500指数涨幅创纪录"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "紐約(Reuters)--美國股市週一反彈，因一輪強勁的。\n勞動力市場和服務業的經濟數據提振了投資者的樂觀情緒。\n爲經濟重啓和美國10年期國債收益率的溫和攀升。\n保持了對通脹的擔憂。\n\n3月ISM調查顯示，美國3月份的通脹率爲...",
      "title": "受強勁經濟數據提振，道指、標普500指數漲幅創紀錄"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "ニューヨーク（ロイター） - 月曜日、米国の株式は、一連の強い経済指標を受けて上昇しました。\n労働市場やサービス業などの経済指標が好調で、投資家の景気回復への期待が高まった。\n景気回復への期待感が高まり、米国10年債利回りの上昇が抑制されたため、米国株は上昇した。\nインフレ懸念が抑えられました。\n\n3月に発表されたISM調査では、労働市場とサービス業の...",
      "title": "ダウ、S&P500は好調な経済指標に後押しされて過去最高を更新"
    }
  ],
  "title": "Dow, S&P 500 rally to records, boosted by strong economic data",
  "created_utc": 1617696373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>NEW YORK  (Reuters) -     U.S. stocks rallied on Monday, as a round of strong  economic data on the labor market and services sector buoyed investor  optimism for the economic reopening and a muted climb in the 10-year  U.S. Treasury yield kept inflation worries at bay.</p>\n\n<p>An ISM survey for March showed a measure of U.S. services industry  activity jumped to a record high. The data followed Friday&#39;s report  showing U.S. nonfarm payrolls surged by 916,000 jobs in March, trouncing  forecasts.  </p>\n\n<p>Investors have bet on sectors poised to lead an economic reopening,  such as energy, financials and materials. A climbing yield on the  10-year U.S. Treasury note has dented appetite for technology stocks. </p>\n\n<p>Despite strong economic data, gains were led by sectors that have  underperformed recently, including communication services, consumer  discretionary and tech, as the 10-year yield remained below a 14-month  high hit last week.  </p>\n\n<p>&quot;One of the fears in March was that the rise in rates meant you need to take multiples down,&quot; said Rob Haworth, senior investment strategist at U.S. Bank Wealth Management in Seattle. </p>\n\n<p>&quot;It&#39;s not the reopening trade at this point, it is higher interest  rates are here but not accelerating so the whole economy is being  lifted.&quot; </p>\n\n<p>The Dow Jones Industrial Average rose 385.96 points, or 1.16%, to  33,539.17, the S&amp;P 500 gained 59.11 points, or 1.47%, to 4,078.98  and the Nasdaq Composite added 234.78 points, or 1.74%, to 13,714.89.</p>\n\n<p>With speedy vaccinations and additional government stimulus helping  the S&amp;P 500 and the Dow clinch all-time highs, focus now turns to  progress on a massive infrastructure plan and the upcoming corporate  earnings season.</p>\n\n<p>The tech-heavy Nasdaq is still about 4% below its February high as  the recent spike in bond yields spurred inflation concerns and made  growth stocks less attractive.</p>\n\n<p>Energy shares were the worst performing sector, following a sharp  drop in oil prices. Reopening plays gained, as the S&amp;P 1500 airlines  index jumped 3.43% after the U.S. Centers for Disease Control and Prevention  said fully vaccinated people can safely travel at &quot;low risk.&quot; The  agency had held off for weeks on revising guidance that discouraged all  non-essential trips.</p>\n\n<p>U.S. Treasury Secretary Janet Yellen said she was  working with G20 countries to agree on a global corporate minimum tax  rate to end a &quot;30-year race to the bottom on corporate tax rates.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 390,
  "permalink": "/r/stocks/comments/mkszp8/dow_sp_500_rally_to_records_boosted_by_strong/",
  "subreddit": "stocks",
  "id": "mkszp8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878995
}