{
  "author": "colonialnerd",
  "original_created_utc": 1653575465,
  "title": "How do politicians justify being pro-life but anti-free-childcare and anti-formula-imports?",
  "created_utc": 1653593845,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want the genuine reason why they think these things or vote the way they do, but how do they justify it publicly and maintain the loyalty of their base and get them to agree that these seemingly conflicting ideas (to me at least) can and should coexist?&lt;/p&gt;\n\n&lt;p&gt;Do they just not connect them?&lt;/p&gt;\n\n&lt;p&gt;Do they blame the other party? What&amp;#39;s the train of thought that&amp;#39;s given to conservative voters on these issues? Are they different factions of the same party?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/uy8xh6/how_do_politicians_justify_being_prolife_but/",
  "subreddit": "TooAfraidToAsk",
  "id": "uy8xh6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't want the genuine reason why they think these things or vote the way they\ndo, but how do they justify it publicly and maintain the loyalty of their base\nand get them to agree that these seemingly conflicting ideas (to me at least)\ncan and should coexist?\n\nDo they just not connect them?\n\nDo…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、彼らがなぜこのようなことを考え、このような投票をするのか、その真の理由を知りたいわけではありません。\nしかし、どうやってそれを公的に正当化し、支持層の忠誠心を維持するか。\nこの一見相反する考えを（少なくとも私にとっては）共存させることができ、また共存させるべきであるということに同意させることができるのでしょうか？\nは共存できるのか、共存すべきなのか。\n\nただ単に、両者を結び付けないだけなのだろうか？\n\nそれとも...",
      "title": "政治家は、生命を守る一方で、自由保育や整形輸入に反対することをどのように正当化するのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不想知道他们为什么会有这些想法或投票方式的真正原因。\n但他们如何在公开场合证明这一点，并保持其基础的忠诚度\n并让他们同意这些看似矛盾的想法（至少对我来说是这样）。\n可以而且应该共存？\n\n他们只是不把它们联系起来吗？\n\n难道...",
      "title": "政客们是如何证明自己支持生命，但却反对免费的儿童保育和反对奶粉进口的呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不想知道他們爲什麼會有這些想法或投票方式的真正原因。\n但他們如何在公開場合證明這一點，並保持其基礎的忠誠度\n並讓他們同意這些看似矛盾的想法（至少對我來說是這樣）。\n可以而且應該共存？\n\n他們只是不把它們聯繫起來嗎？\n\n難道...",
      "title": "政客們是如何證明自己支持生命，但卻反對免費的兒童保育和反對奶粉進口的呢？"
    }
  ]
}