{
  "author": "ChepaukPitch",
  "original_created_utc": 1632809373,
  "title": "On the front page there is a story about Betty White getting criticism for inviting Arthur Duncan, a black artist, on her show in 1950s. How do I go about reading the original criticism if it appeared in print media at that time?",
  "created_utc": 1632837246,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Snopes says incident is true because both of them have corroborated it. A simple google search leads to many links that were published recently. What I would like to see is original articles or comments that criticized her to understand 1) If it was prevalent in all of America or only certain parts of the country and 2) What was the tone and justification used for criticizing a simple act of inviting a black performer on her show?</p>\n\n<p>I could have just asked a specific question as to what the original criticism was but I often feel like reading more from those times whenever I see a similar article, so I would appreciate if you guys could help in how a normal person would go about finding such things.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/px022x/on_the_front_page_there_is_a_story_about_betty/",
  "subreddit": "AskHistorians",
  "id": "px022x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Snopes says incident is true because both of them have corroborated it. A simple\ngoogle search leads to many links that were published recently. What I would\nlike to see is original articles or comments that criticized her to understand\n1) If it was prevalent in all of America or only certain parts…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Snopesによると、二人が裏付けをとっているので、事件は真実だという。簡単な\n最近発表された多くのリンクを見ることができます。私が見たいのは\n私が見たいのは、彼女を批判しているオリジナルの記事やコメントです。\n1) アメリカ全体で流行っているのか、一部の地域でしか流行っていないのか...",
      "title": "ベティ・ホワイトが1950年代に黒人アーティストのアーサー・ダンカンを自分の番組に招待して批判されたという記事がトップページに掲載されています。当時の紙媒体に掲載された批判の原文を読むにはどうすればよいのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "斯诺普斯说事件是真的，因为他们两人都证实了这一点。一个简单的\n谷歌搜索就能找到许多最近发表的链接。我想看到的是\n希望看到的是批评她的原创文章或评论，以了解\n1）如果是在全美国普遍存在，还是只在某些地区普遍存在...",
      "title": "在头版有一个关于贝蒂-怀特在1950年代邀请黑人艺术家亚瑟-邓肯参加她的节目而受到批评的故事。如果当时出现在印刷媒体上，我如何去阅读原始批评？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "斯諾普斯說事件是真的，因爲他們兩人都證實了這一點。一個簡單的\n谷歌搜索就能找到許多最近發表的鏈接。我想看到的是\n希望看到的是批評她的原創文章或評論，以瞭解\n1）如果是在全美國普遍存在，還是隻在某些地區普遍存在...",
      "title": "在頭版有一個關於貝蒂-懷特在1950年代邀請黑人藝術家亞瑟-鄧肯參加她的節目而受到批評的故事。如果當時出現在印刷媒體上，我如何去閱讀原始批評？"
    }
  ]
}