{
  "author": "Lemonmule69",
  "the_new_excerpt": "The sec wanted to settle and offered settlement to ripple, garlinghouse and\nLarsen chose not to and chose for this to go to court. They could have settled\nand payed a fine. I still think they will reach an agreement with the SEC now\nthat Jay Clayton has gone.\n\n90 + percent of trading and movement is…",
  "original_created_utc": 1608871227,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "美国证券交易委员会希望达成和解，并向涟漪、加林豪斯和\n拉森选择不这样做，并选择将这件事告上法庭。他们本可以安顿下来的\n并交了罚金。我仍然认为他们现在会与SEC达成协议\n杰伊·克莱顿已经走了。\n\n90%以上的交易和移动是…",
      "title": "这就是涟漪诉讼将会发生的情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國證券交易委員會希望達成和解，並向漣漪、加林豪斯和\n拉森選擇不這樣做，並選擇將這件事告上法庭。他們本可以安頓下來的\n並交了罰金。我仍然認爲他們現在會與SEC達成協議\n傑伊·克萊頓已經走了。\n\n90%以上的交易和移動是…",
      "title": "這就是漣漪訴訟將會發生的情況"
    }
  ],
  "title": "This is what is going to happen with the ripple lawsuit",
  "created_utc": 1608895843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The sec wanted to settle and offered settlement to ripple, garlinghouse and Larsen chose not to and chose for this to go to court. They could have settled and payed a fine. I still think they will reach an agreement with the SEC now that Jay Clayton has gone.</p>\n\n<p>90 + percent of trading and movement is done on the Xrp ledger OUTSIDE of the USA. Multiple g20 countries have already decided and declared it is a currency, fincen and the us treasury department have done the same.</p>\n\n<p>You probably hate ripple, you probably hate Xrp. The Xrp ledger exists without ripple no matter what you say, no matter what the sec says. Ripple has the capital to fight this and ex sec enforcers on their board.</p>\n\n<p>They broke fincen rules and payed a fine. I dare say the same is going to happen with this case.</p>\n\n<p>At the end of this ripple get what they are chasing after, regulatory clarity not only for Xrp but other cryptos.</p>\n\n<p>disclosure I hold btc, eth and xrp. Just not going to fight over lines of code like half the people on here.</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/CryptoCurrency/comments/kjt73w/this_is_what_is_going_to_happen_with_the_ripple/",
  "subreddit": "CryptoCurrency",
  "id": "kjt73w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495331376
}