{
  "author": "F-Severn",
  "the_new_excerpt": "First, I want to say that I feel for anyone affected by Covid and hope everyone\nstays safe right now.\n\nOk now on to what I’m trying to say: Fuck it.\n\nI seriously cannot believe how much the US government is just absolutely fucking\nthe average person right now. I’m torn between thinking $600 is too…",
  "original_created_utc": 1609001070,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想说我同情任何受Covid影响的人，并希望每个人\n现在要保证安全。\n\n好了，现在我想说的是：去他妈的。\n\n我真的不敢相信美国政府有这么多\n现在的普通人。我左右为难，觉得六百美元太…了",
      "title": "去他妈的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想說我同情任何受Covid影響的人，並希望每個人\n現在要保證安全。\n\n好了，現在我想說的是：去他媽的。\n\n我真的不敢相信美國政府有這麼多\n現在的普通人。我左右爲難，覺得六百美元太…了",
      "title": "去他媽的"
    }
  ],
  "title": "Fuck it",
  "created_utc": 1609018785,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First, I want to say that I feel for anyone affected by Covid and hope everyone stays safe right now. </p>\n\n<p>Ok now on to what I’m trying to say: Fuck it. </p>\n\n<p>I seriously cannot believe how much the US government is just absolutely fucking the average person right now. I’m torn between thinking $600 is too much or too little. </p>\n\n<p>Background:\nThis summer I turned 18 and decided it was time for me to work I got a job in a small construction company and we were seriously understaffed. Like way too understaffed, half the time it was just me (who had no experience) and my boss. I pulled 15 hour days for 6 days a week and thanks to supreme leader Cuomo made less than someone on unemployment. Now because of the government’s ridiculous money printing policy my bank account will be worth shit in 10 years. </p>\n\n<p>I’ve invested in some Bitcoin but honestly I can’t take this anymore. I just said fuck it and shipped all my money into BTC. I don’t even care if that’s a stupid move. My friend just told me that with his parents help he bullshitted unemployment this summer and made more than I made. Honestly fuck that dude. He just shows me how screwed the system is. Bitcoin gives me a chance to better my life over the next 15 years and I hope more people learn about BTC so they can get off the USD. I will now HODL until the moon.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/Bitcoin/comments/kklgr2/fuck_it/",
  "subreddit": "Bitcoin",
  "id": "kklgr2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495329039
}