{
  "author": "NoWave3",
  "the_new_excerpt": "Some might say that this question belongs in an anthropological, sociological,\nhistorical or some other sub, but I disagree. I think it is a genuine\nphilosophical question (which is not to say that philosophers shouldn’t rely on\nsciences and humanities in dealing with it.) How have we come to this…",
  "original_created_utc": 1622153415,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この問題は、人類学や社会学の分野に属するものだと言う人もいるでしょう。\nしかし、私はそうは思いません。私は、この問題は純粋な\n哲学的な問題だと思います（哲学者が科学的な知識に頼るべきではないということではありません）。\n科学や人文科学に頼ってはいけないということではありません。) どうしてこんなことになってしまったのか・・・。",
      "title": "なぜ私たちは資本主義を超えて考えることが非常に難しいのでしょうか？ある作家が「資本主義的リアリズム」と呼んだものを、なぜ私たちは受け入れるようになったのか。ジジェクの言葉を借りれば、「資本主義の終焉」よりも「世界の終焉」を想像する方が簡単なのはなぜか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有些人可能会说，这个问题属于人类学、社会学。\n历史学或其他一些子，但我不同意。我认为它是一个真正的\n哲学问题（这并不是说哲学家们不应该依赖\n科学和人文学科来处理它）。) 我们是如何走到这一步的...",
      "title": "为什么我们超越资本主义的思考是如此的困难？我们是如何接受一位作者所说的 \"资本主义现实主义 \"的？为什么我们想象世界末日比想象资本主义的末日更容易，引用日泽克的话，或者不管是谁说的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有些人可能會說，這個問題屬於人類學、社會學。\n歷史學或其他一些子，但我不同意。我認爲它是一個真正的\n哲學問題（這並不是說哲學家們不應該依賴\n科學和人文學科來處理它）。) 我們是如何走到這一步的...",
      "title": "爲什麼我們超越資本主義的思考是如此的困難？我們是如何接受一位作者所說的 \"資本主義現實主義 \"的？爲什麼我們想象世界末日比想象資本主義的末日更容易，引用日澤克的話，或者不管是誰說的？"
    }
  ],
  "title": "Why is it so exceedingly difficult for us to think beyond capitalism? How have we come to embrace what one author has called “capitalist realism”? Why is it easier for us to imagine the end of the world than the end of capitalism, to quote Žižek, or whoever it is that said it?",
  "created_utc": 1622170843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some might say that this question belongs in an anthropological, sociological, historical or some other sub, but I disagree. I think it is a genuine philosophical question (which is not to say that philosophers shouldn’t rely on sciences and humanities in dealing with it.) How have we come to this point?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/askphilosophy/comments/nmj0l1/why_is_it_so_exceedingly_difficult_for_us_to/",
  "subreddit": "askphilosophy",
  "id": "nmj0l1",
  "is_self": true,
  "media": null,
  "is_video": false
}