{
  "author": "pmusz",
  "the_new_excerpt": "Looking at Mungers recent position, 20% of the portfolio is going to China's\n$BABA. This really brought to my attention Buffet's quote of \"be fearful when\nothers are greedy, and greedy when others are fearful.” I noticed this is\noccurring within your typical Chinese stocks. Many of these we talk…",
  "original_created_utc": 1617842710,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Mungersの最近のポジションを見ると、ポートフォリオの20％が中国の\nBABAです。これを見て、バフェットの「他の人が欲張っているときには恐れ、他の人が恐れているときには欲張れ」という言葉が気になりました。\n他の人が欲張っているときには恐れ、他の人が恐れているときには欲張れ」というバフェットの言葉を思い出しました。私はこれが\nこれが典型的な中国株で起きていることに気づきました。私たちが話しているこれらの銘柄の多くは...",
      "title": "\"他人が欲を出している時は恐れ、他人が恐れている時は欲を出す\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从芒格近期的持仓情况来看，20%的投资组合将进入中国的。\n$BABA。这让我真正注意到了巴菲特的一句话 \"当恐惧的时候\n别人贪婪的时候贪婪，别人恐惧的时候恐惧。\" 我注意到这是\n发生在典型的中国股票中。我们所谈的许多这些...",
      "title": "\"别人贪婪时恐惧，别人恐惧时贪婪\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從芒格近期的持倉情況來看，20%的投資組合將進入中國的。\n$BABA。這讓我真正注意到了巴菲特的一句話 \"當恐懼的時候\n別人貪婪的時候貪婪，別人恐懼的時候恐懼。\" 我注意到這是\n發生在典型的中國股票中。我們所談的許多這些...",
      "title": "\"別人貪婪時恐懼，別人恐懼時貪婪\"。"
    }
  ],
  "title": "\"fearful when others are greedy, and greedy when others are fearful.”",
  "created_utc": 1617860168,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Looking at Mungers recent position, 20% of the portfolio is going to China&#39;s $BABA. This really brought to my attention Buffet&#39;s quote of &quot;be fearful when others are <strong>greedy</strong>, and <strong>greedy</strong> when others are fearful.” I noticed this is occurring within your typical Chinese stocks. Many of these we talk about quite often in this sub. </p>\n\n<p>Looking at companies like $BABA, $TME, $BIDU, $JD and $IQ, most of them have fallen anywhere from 15-48%. Recent news has mentioned that the hedge funds and banks are letting go of their Chinese holdings but I believe this is a great buying opportunity strictly due to the low prices and Munger&#39;s new position. </p>\n\n<p>Most of them still have pretty high analyst PT&#39;s but their P/E&#39;s and P/S&#39;s stick out like a sour thumb. All of these companies are stuck below the 42 zone on the RSi and show massive growth for the EPS. Being able to pay off any debts and having Jack Ma, the idiot who spoke against a communist government finally out from CEO of BABA, may now let us see the only upside potential we&#39;ve been waiting for. BTW, hearing Munger&#39;s opinion on Jack Ma&#39;s actions and him stepping down seriously makes me believe BABA is a gold mine with purchasing LEAPS. Much more of a safer bet with him out of the eqaution. </p>\n\n<p>I still have a great interest in these companies and want to hear some of your opinions on this. I did purchase today 600 shares of $IQ @ 18.54 to add a new stock into my portfolio with me already having LEAPS on BABA and a decent amount of money in JD @ 84 per share. Even though the hedge funds and banks are dumping their stakes, I believe it has the potential to make solid, big gains. </p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/stocks/comments/mmg71k/fearful_when_others_are_greedy_and_greedy_when/",
  "subreddit": "stocks",
  "id": "mmg71k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961880369
}