{
  "author": "partymsl",
  "original_created_utc": 1660929575,
  "title": "The wife of the arrested Tornado Cash developer is not allowed to talk with him. That's just wrong.",
  "created_utc": 1660967345,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The wife of the arrested Tornado Cash developer after the blacklisting of them by the US Treasury (which is very controversial and not supported by actual law), Ksenia Malik, is not allowed to talk with her husband and says that they treating him &amp;quot;like the worst criminals Eventhough he just write a code&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Honestly that&amp;#39;s just mad and embarrassing and sad. He has not committed any actual crime all he did was write a code that just like everything else in this world can be used by wrong people too. Tornado Cash was an open source code with no owner still they got after him.&lt;/p&gt;\n\n&lt;p&gt;Thankfully DeFi protocol 1inch is calling for protest against Alexey Petresy in Amsterdam. It would be good if anyone here also takes that step to help against this injustice. The Crypto community should not accept such things.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/wsjjpf/the_wife_of_the_arrested_tornado_cash_developer/",
  "subreddit": "CryptoCurrency",
  "id": "wsjjpf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The wife of the arrested Tornado Cash developer after the blacklisting of them\nby the US Treasury (which is very controversial and not supported by actual\nlaw), Ksenia Malik, is not allowed to talk with her husband and says that they\ntreating him \"like the worst criminals Eventhough he just write a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "逮捕されたトルネード・キャッシュの開発者の妻がブラックリストに載った後\n逮捕されたトルネード・キャッシュの開発者の妻、Ksenia Malikは、米国財務省によるブラックリスト（これは非常に議論の余地があり\nKsenia Malikは、夫と話をすることが許されず、夫が「最低の人間」扱いされていると言っています。\nを書いただけなのに、最悪の犯罪者のように扱われている。",
      "title": "逮捕されたトルネード・キャッシュの開発者の妻は、彼との会話を禁じられている。それは間違っている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "被逮捕的龙卷风现金开发商的妻子在他们被列入黑名单后\n美国财政部将其列入黑名单后，被捕的龙卷风现金开发商的妻子（这是非常有争议的，没有实际的法律支持\nKsenia Malik，不被允许与她的丈夫交谈，并说他们\n他说，他们 \"像对待最坏的罪犯一样对待他，尽管他只是写了一篇文章。",
      "title": "被捕的龙卷风现金开发商的妻子不被允许与他交谈。这实在是错了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "被逮捕的龍捲風現金開發商的妻子在他們被列入黑名單後\n美國財政部將其列入黑名單後，被捕的龍捲風現金開發商的妻子（這是非常有爭議的，沒有實際的法律支持\nKsenia Malik，不被允許與她的丈夫交談，並說他們\n他說，他們 \"像對待最壞的罪犯一樣對待他，儘管他只是寫了一篇文章。",
      "title": "被捕的龍捲風現金開發商的妻子不被允許與他交談。這實在是錯了。"
    }
  ]
}