{
  "author": "razebyte",
  "the_new_excerpt": "I just want to get this message to all sufferers and take a moment to talk about\nthe negativity being thrown around and the potential mental health crisis that\ncould unfold for many people here.\n\nI know the general sentiment is to shit on all the people with negativity about\n\"you should've sold when…",
  "original_created_utc": 1612484328,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我只想把这个信息传达给所有的患者，花点时间来谈谈。\n抛出的负面情绪和潜在的心理健康危机，即\n可以为这里的很多人展开。\n\n我知道一般人的情绪是对所有的人用负面的情绪来拉屎\n\"你应该卖掉的时候...",
      "title": "致整场惨败的所有受害者--心理健康与康复"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想把這個信息傳達給所有的患者，花點時間來談談。\n拋出的負面情緒和潛在的心理健康危機，即\n可以爲這裏的很多人展開。\n\n我知道一般人的情緒是對所有的人用負面的情緒來拉屎\n\"你應該賣掉的時候...",
      "title": "致整場慘敗的所有受害者--心理健康與康復"
    }
  ],
  "title": "To All Sufferers of the Whole Fiasco - Mental Health & Recovery",
  "created_utc": 1612492707,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just want to get this message to all sufferers and take a moment to talk about the negativity being thrown around and the potential mental health crisis that could unfold for many people here.</p>\n\n<p>I know the general sentiment is to shit on all the people with negativity about &quot;you should&#39;ve sold when you had the chance&quot;, etc and I understand why some of them feel that way. But I want to remind the people that you could be exasperating some serious inner self-turmoil for many people based on these words causing their mental health to be in ruins.</p>\n\n<p>In these times, we have to help these people up and give them good advice without sounding pompous.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>My Perspective about Holding - Hindsight 20/20 - May put your mind at ease</strong></p>\n\n<p>Holding is not a bad idea granted you could actually afford to which is what I feel people missed out on.</p>\n\n<p>The point is, it wasn&#39;t completely horrible to get involved because truly, hindsight is 20/20 for situations like this. This was an unprecedented event in the likes the world has literally never seen. How could you possibly have predicted it to the tee? You can&#39;t pretend like you&#39;re the smartest in the room that saw all this coming. You can only extrapolate the data as it comes and watch as the event unfolds.</p>\n\n<p>I&#39;d say you can call it more of a gamble than an investment, but it doesn&#39;t take a genius to understand that when getting in. The fact is, expectations should have been set better for all the new people that joined.</p>\n\n<p>Like I said earlier, the only people to worry about are the ones who truly have lost a majority of their wealth from this. I&#39;m all about the movement but realistically if I invested at the starting price before it spiked to $400, I probably would&#39;ve sold enough to cover my initial investment and kept the rest to be a part of the movement.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Some Lives Have Been Destroyed... Let&#39;s not deny it</strong></p>\n\n<p>There are some people here that really went all out. Like I don&#39;t know if you&#39;ve been paying attention, but I&#39;ve seen it on blogs, on many subreddits, on social media. Some people really have gone ALL OUT or have thrown a majority of their wealth on this.</p>\n\n<p>If this is the case, I&#39;d start talking to a financial advisor immediately about what your next steps are. My deepest sympathies go out to the guys and gals who are feeling breathless and suffocated in these times, that in it of itself has been giving me more anxiety than anything else. Just looking at all the people who put in way more than they could chew... it honestly destroys me. I have anxiety myself and I can&#39;t imagine what you people are going through right now.</p>\n\n<p>I can see people hurting themselves over the decisions that have been made in the past 2 weeks. Especially with the pandemic at an all time high and already causing mental health ruin, this does not help.</p>\n\n<p>For the people that feel destroyed - you are going to get through this. I know it really sucks but you will. Life can change at an instant at any second the same way it can go to shit. The same way you feel you&#39;re never going to find that person to fall in love with and the next second some gorgeous girl is going out with your ugly bum. In either case, little by little, you&#39;ll fix this and you&#39;ll have become stronger for it.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Upside and Lessons</strong></p>\n\n<p>On the flip side, I and I&#39;m sure many have had and are having a lot fun being a part of this movement. I hope this was a valuable lesson to many who had thrown everything in to not let emotions get in the way of making smart investment decisions.</p>\n\n<p>This was a volatile market, and should have come in understanding that this was basically gambling money as much as it was an attempt at a short-term investment. Going forward, if you decide to stick around and invest in the stock market in general, it really can be an enjoyable experience to play with the numbers in a way that doesn&#39;t get your heart dropping every 2 seconds.</p>\n\n<p>If any of you need to talk or are feeling low, the PMs are open, and I&#39;m sure there are many people that can and will help you get through this.</p>\n\n<p><strong>Closing thoughts... hold if you can afford it and have been in it for the movement. But don&#39;t have any expectations of this giving any real returns going forward.</strong></p>\n</div><!-- SC_ON -->",
  "score": 458,
  "permalink": "/r/investing/comments/lcuiaj/to_all_sufferers_of_the_whole_fiasco_mental/",
  "subreddit": "investing",
  "id": "lcuiaj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198806
}