{
  "author": "Prestigious-Try-4363",
  "the_new_excerpt": "I've been reading up on Blackberry for a couple days now and found out some\ninteresting things about the company that I don't think most people know.\nObviously it is a lot to unpack but here are the important aspects of my\nfindings thus far:\n\nBlackberry (ticker BB) provides intelligent security…",
  "original_created_utc": 1622684978,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、ブラックベリーについて調べていたところ、多くの人が知らないような興味深いことがわかりました。\nこの会社について、多くの人が知らないような興味深いことがわかりました。\nもちろん、解明すべきことはたくさんありますが、これまでに私が発見した重要な点は以下の通りです。\nこれまでにわかったことのうち、重要な点を以下に挙げる。\n\nBlackberry (ticker BB) は、インテリジェントなセキュリティを提供しています。",
      "title": "ブラックベリー - 巨大な可能性を秘めた企業"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几天来，我一直在阅读黑莓公司的资料，发现了一些我认为大多数人不知道的关于该公司的有趣事情。\n关于该公司的一些有趣的事情，我认为大多数人都不知道。\n显然，这有很多东西需要解读，但以下是我迄今为止发现的重要方面。\n到目前为止的发现。\n\n黑莓公司（股票代码：BB）提供智能安全服务。",
      "title": "黑莓--一家具有巨大潜力的公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天來，我一直在閱讀黑莓公司的資料，發現了一些我認爲大多數人不知道的關於該公司的有趣事情。\n關於該公司的一些有趣的事情，我認爲大多數人都不知道。\n顯然，這有很多東西需要解讀，但以下是我迄今爲止發現的重要方面。\n到目前爲止的發現。\n\n黑莓公司（股票代碼：BB）提供智能安全服務。",
      "title": "黑莓--一傢俱有巨大潛力的公司"
    }
  ],
  "title": "Blackberry - A company with enormous potential",
  "created_utc": 1622713336,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been reading up on Blackberry for a couple days now and found out some interesting things about the company that I don&#39;t think most people know. Obviously it is a lot to unpack but here are the important aspects of my findings thus far:</p>\n\n<p>Blackberry (ticker BB) provides intelligent security software and services to enterprises and governments around the world. <strong>Blackberry secures more than 500 million endpoints including more than 175 million cars on the road today</strong>. Changes to data privacy laws in the United States, Europe and other jurisdictions are compounding the challenges faced by organizations by increasing their responsibilities for securing their data as well as that of their customers. This is where Blackberry fills the void; there is no technology that has been exclusively or commercially adopted as the industry standard for many of the products and services offered by blackberry.</p>\n\n<p>Blackberry’s go-to-market strategy focuses principally on generating revenue from enterprise software, services and licensing. The company intends to drive revenue growth and to achieve margins that are consistent with those of other enterprise software companies.  </p>\n\n<p><strong>Blackberry owns 38,000 worldwide patents</strong>. It owns rights to an array of patented and patent pending technologies which include operating systems, networking infrastructure, acoustics, messaging, enterprise software, automotive subsystems, cybersecurity and wireless communications. Blackberry knows the value behind its patents and as such has a team of in-house patent attorneys ready to put pen to paper should any company infringe on its intellectual property. Blackberry believes that its patent portfolio continues to provide a competitive advantage in its core product areas as well as provide leverage in the development of future technologies.</p>\n\n<p>Other interesting facts:</p>\n\n<p>Blackberry QNX is a preferred supplier of embedded systems for companies building medical devices, train-control systems, industrial robots, hardware security modules, building automation systems, green energy solutions, and other mission critical applications. Blackberry QNX technology is embedded in over 175 million cars.</p>\n\n<p>Blackberry AtHoc has received FedRAMP certification and is the leading provider of network-centric, interactive crisis communication to the U.S. Department of Defense and the U.S. Department of Homeland Security, among other governmental bodies. Blackberry AtHoc helps to protect more than 70% of U.S. government personnel.</p>\n\n<p><em>Disclaimer: Not financial advice, please do your own DD.</em></p>\n</div><!-- SC_ON -->",
  "score": 4010,
  "permalink": "/r/wallstreetbets/comments/nr21l5/blackberry_a_company_with_enormous_potential/",
  "subreddit": "wallstreetbets",
  "id": "nr21l5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804304099
}