{
  "author": "toyume",
  "original_created_utc": 1631238281,
  "title": "I live in a developing country and crypto saves me $150-$300 each month (higher than our minimum monthly wage) and that's a fucking lot",
  "created_utc": 1631248253,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I honestly don&#39;t care about HODLING crypto (more power to all of you though). </p>\n\n<p>I was forced into it because I was losing so much money from traditional banking. </p>\n\n<p>Background: I get most of my income from marketing clients abroad (I manage digital ad campaigns). Paypal/Swift used be the default method to get paid because it was ubiquitous and honestly quite easy to use for clients.</p>\n\n<p>But Paypal charged me A LOT.</p>\n\n<ul>\n<li>They take a cut from each payment I get from each client</li>\n<li>Then they take another cut to convert those funds (ie. USD, AUD) into my local currency</li>\n<li>Finally they charge me to transfer funds to my bank account </li>\n<li>There&#39;s no interest or staking on any funds I leave and don&#39;t transfer to a local account</li>\n</ul>\n\n<p>This happens to each client and for each payment.  All these fees and extra charges each month easily add up to $150-$300. </p>\n\n<p>For context, this is how much $300 is worth in my country:</p>\n\n<ul>\n<li>I can get <strong>6 weeks&#39; worth of groceries</strong> for my 5-person household</li>\n<li>It&#39;s almost <strong>50% higher</strong> than our minimum wage </li>\n<li>It&#39;s equal to <strong>more than half</strong> what a young professional earns each month in their 1st job</li>\n<li>I can eat 98 Big Macs</li>\n</ul>\n\n<p>Now, I get paid in crypto (not all, but a big chunk). It&#39;s mostly XRP because it&#39;s easy to withdraw here and the fees are next to nothing. </p>\n\n<p>I basically get a bonus paycheck every month and I love it. </p>\n\n<p>I now have less stress because of strict budgets for groceries, can buy actual good quality stuff, and have a bit extra to get a few small gifts every now and then for the people I care about.</p>\n\n<p>But it also makes me sad because <strong>there are literal millions of people like me</strong> who rely on payments or remittances from abroad to survive. </p>\n\n<p>$300 might be small time for folks in the US, but it&#39;s life changing for us.</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/plbg2z/i_live_in_a_developing_country_and_crypto_saves/",
  "subreddit": "CryptoCurrency",
  "id": "plbg2z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I honestly don't care about HODLING crypto (more power to all of you though).\n\nI was forced into it because I was losing so much money from traditional\nbanking.\n\nBackground: I get most of my income from marketing clients abroad (I manage\ndigital ad campaigns). Paypal/Swift used be the default method…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、HODLING cryptoには興味がありません（皆さんにはもっとパワーがありますが）。\n\n伝統的な銀行業務であまりにも多くのお金を失っていたので、仕方なくやっています。\n銀行では大損していたからです。\n\n背景 私の収入のほとんどは、海外のマーケティングクライアントから得ています。\nデジタル広告キャンペーンを管理しています）。) 以前はPaypal/Swiftがデフォルトの方法でした...",
      "title": "私は発展途上国に住んでいますが、暗号化によって毎月150～300ドル（最低月給よりも高い）を節約できています。これは非常に大きなことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，我并不关心炒作加密货币（不过你们所有人都更有力量）。\n\n我是被迫这样做的，因为我从传统的银行业务中损失了太多的钱。\n银行业务中损失惨重。\n\n背景。我的大部分收入来自国外的营销客户（我负责管理\n数字广告活动）。) Paypal/Swift曾经是我的默认方法。",
      "title": "我住在一个发展中国家，加密货币每个月为我节省150-300美元（比我们的最低月工资还高），这他妈的是个大数目。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，我並不關心炒作加密貨幣（不過你們所有人都更有力量）。\n\n我是被迫這樣做的，因爲我從傳統的銀行業務中損失了太多的錢。\n銀行業務中損失慘重。\n\n背景。我的大部分收入來自國外的營銷客戶（我負責管理\n數字廣告活動）。) Paypal/Swift曾經是我的默認方法。",
      "title": "我住在一個發展中國家，加密貨幣每個月爲我節省150-300美元（比我們的最低月工資還高），這他媽的是個大數目。"
    }
  ]
}