{
  "author": "buddhist-truth",
  "the_new_excerpt": "Deutsche Bank has joined the growing ranks of large financial institutions\nexploring cryptocurrency custody, with aspirations to offer high-touch services\nto hedge funds that invest in the asset class.\n\nThe Deutsche Bank Digital Asset Custody prototype aims to develop “a fully\nintegrated custody…",
  "original_created_utc": 1613239095,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "德意志银行加入了不断壮大的大型金融机构行列\n探索加密货币托管，有志于提供高触感的服务\n到投资该资产类别的对冲基金。\n\n德意志银行的数字资产托管原型旨在开发 \"一个全\n综合监管...",
      "title": "德意志银行悄然计划提供加密托管、主要经纪业务。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "德意志銀行加入了不斷壯大的大型金融機構行列\n探索加密貨幣託管，有志於提供高觸感的服務\n到投資該資產類別的對沖基金。\n\n德意志銀行的數字資產託管原型旨在開發 \"一個全\n綜合監管...",
      "title": "德意志銀行悄然計劃提供加密託管、主要經紀業務。"
    }
  ],
  "title": "Deutsche Bank Quietly Plans to Offer Crypto Custody, Prime Brokerage",
  "created_utc": 1613268025,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Deutsche Bank has joined the growing ranks of large financial institutions exploring cryptocurrency custody, with aspirations to offer high-touch services to hedge funds that invest in the asset class.</p>\n\n<p>The Deutsche Bank Digital Asset Custody prototype aims to develop “a fully integrated custody platform for institutional clients and their digital assets providing seamless connectivity to the broader cryptocurrency ecosystem,” according to a little-noticed report by the World Economic Forum, host of the annual gathering of muckety-mucks in Davos, Switzerland. </p>\n\n<p>In a passage buried on page 23 of the December 2020 report, Germany’s largest bank says it plans to create a trading and token issuance platform, bridging digital assets with traditional banking services, and managing the array of digital assets and fiat holdings in one easy-to-use platform.</p>\n</div><!-- SC_ON -->",
  "score": 88,
  "permalink": "/r/investing/comments/lj5gl2/deutsche_bank_quietly_plans_to_offer_crypto/",
  "subreddit": "investing",
  "id": "lj5gl2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621135
}