{
  "author": "ZaidiePops",
  "the_new_excerpt": "I've never valued money. As far as my memory goes, I never cared for getting or\nspending money. Never had my parents, teachers or friends ever explain money and\nit's value and I have lost a ton of money because of it.\n\nThat is until I got into crypto and I started understanding more and more…",
  "original_created_utc": 1619748950,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はお金を大切にしたことがありません。私の記憶では、お金をもらうことも使うことも気にしたことはありません。\nお金を使うことに興味がなかった。親も先生も友達も、お金とその価値について説明してくれませんでした。\nそのために私はたくさんのお金を失ってしまいました。\n\nそれが、暗号の世界に入るまでは、ますます理解を深めていきました。",
      "title": "6ヶ月という短い期間で暗号が私の人生を変えた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有重视过金钱。在我的记忆中，我从来没有关心过获取或\n花钱。我的父母、老师和朋友从来没有解释过金钱和它的价值。\n它的价值，而我也因此损失了一大笔钱。\n\n直到我接触了加密货币，我开始越来越了解...",
      "title": "Crypto在短短6个月内改变了我的生活"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有重視過金錢。在我的記憶中，我從來沒有關心過獲取或\n花錢。我的父母、老師和朋友從來沒有解釋過金錢和它的價值。\n它的價值，而我也因此損失了一大筆錢。\n\n直到我接觸了加密貨幣，我開始越來越瞭解...",
      "title": "Crypto在短短6個月內改變了我的生活"
    }
  ],
  "title": "Crypto changed my life in 6 short months",
  "created_utc": 1619764378,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve never valued money.\nAs far as my memory goes, I never cared for getting or spending money. Never had my parents, teachers or friends ever explain money and it&#39;s value and I have lost a ton of money because of it.</p>\n\n<p>That is until I got into crypto and I started understanding more and more about the value of money and how our financial institutions work which completely fascinates me.</p>\n\n<p>I started spending less, saving more and now I&#39;m at the absolute best financial situation of my life and I have yet to touch any of my crypto profits.</p>\n\n<p>I hope your ride has been as fruitful and life changing as mine in spite of the money (that&#39;s just a bonus ;))</p>\n</div><!-- SC_ON -->",
  "score": 777,
  "permalink": "/r/CryptoCurrency/comments/n1k4xf/crypto_changed_my_life_in_6_short_months/",
  "subreddit": "CryptoCurrency",
  "id": "n1k4xf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961453
}