{
  "author": "Buntafujiwara85",
  "the_new_excerpt": "Guys we need to stop posting loss porn on GME (FOR NOW) The Loss porn if half of\nit even real just kills moral. Given any other normal day on WSB sure go ahead\nbut given the play that took place and continues to do so I would reccomond not\nto on GME. And stop exposing your positions. Do not expose…",
  "original_created_utc": 1612527837,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "伙计们，我们需要停止在GME上发布亏损色情信息（现在）。 亏损色情信息如果有一半的人在GME上发布。\n它甚至真实的只是杀死道德。在WSB的任何其他正常的日子里肯定会去的\n但鉴于该剧的发生，并继续这样做，我会建议不。\n到GME上。别再暴露你的位置了 不要暴露...",
      "title": "停止暴露你的损失和位置。THEY ARE USING THIS AGAINST US!!!!!!!!!!。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "夥計們，我們需要停止在GME上發佈虧損色情信息（現在）。 虧損色情信息如果有一半的人在GME上發佈。\n它甚至真實的只是殺死道德。在WSB的任何其他正常的日子裏肯定會去的\n但鑑於該劇的發生，並繼續這樣做，我會建議不。\n到GME上。別再暴露你的位置了 不要暴露...",
      "title": "停止暴露你的損失和位置。THEY ARE USING THIS AGAINST US!!!!!!!!!!。"
    }
  ],
  "title": "STOP EXPOSING YOUR LOSSES AND POSITIONS. THEY ARE USING THIS AGAINST US!!!!!!!!!!",
  "created_utc": 1612593461,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Guys we need to stop posting loss porn on GME (FOR NOW) The Loss porn if half of it even real just kills moral. Given any other normal day on WSB sure go ahead but given the play that took place and continues to do so I would reccomond not to on GME. And stop exposing your positions. Do not expose what your plan to sell it for or what dollar amount you think its worth. Simply you either like the stock or you dont.This only helps the other side. It exposes you totally. Do not expose your exact moves. Ever. They will play against you if they start to notice trend. Market volume is one thing and noise is another. Its okay for us to be loud. But don&#39;t give away the exact play. Easy as that.  Please keep it to yourself. That is a very important rule, not just in trading but in any hustle. As Biggie said. Never let another player no how much dough you hold. The less they know, they less ammo they have to fire against you. They pay people for this information. Don&#39;t give it to them free. Make them have to pay  for it. Let them spend money for the data which inevitably will be worth the most out of anything here. Let them pay some goof to sit there and sift through all the order sheets hahaha. And re write programs and algos based off of this data. Protect it. Don&#39;t be like Facebook. Keep that shit for yourself and stop making it easy for them to get the data. Make them Pay!!!!</p>\n\n<p>EDIT: Notice how many shorts bash this post. Dd yourself and ask why? Its so easy to see through it. They are totally transparent. This is why I make posts like this. Bait taken. Once again. So easy. You guys are trying so hard with no success. Pls go ed yourself. Sun Tzu art of war..</p>\n</div><!-- SC_ON -->",
  "score": 1373,
  "permalink": "/r/wallstreetbets/comments/ld62ln/stop_exposing_your_losses_and_positions_they_are/",
  "subreddit": "wallstreetbets",
  "id": "ld62ln",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123211359
}