{
  "author": "Thalesian",
  "the_new_excerpt": "I've been watching since mid-February as green energy stocks (for me, mostly\nsolar and microgrids) have tumbled. I will broaden this out to green stocks in\ngeneral (throw in EVs) in general, but wanted to get opinions on which of the\nfollowing hypotheses could explain it:\n\n 1. Speculation Bubble:…",
  "original_created_utc": 1617831715,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2月中旬からグリーンエネルギー関連銘柄（私にとってはほとんどが\nソーラーとマイクログリッド）が暴落しているのを見ています。これをグリーン株全般に広げると\nこれをグリーン株全般（EVも含めて）に広げるつもりだが、次のどの仮説で説明できるか意見を聞きたかった。\n以下の仮説で説明できるか意見を聞きたい。\n\n 1. 投機バブル：...",
      "title": "グリーン補正。いくつかの仮説を立ててみた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自2月中旬以来，我一直在观察绿色能源股（对我来说，主要是\n太阳能和微电网）纷纷跌停。我将把这个范围扩大到绿色股票，在\n一般情况下（包括电动车），但想了解一下哪种情况下的意见。\n以下假设可以解释。\n\n 1. 投机泡沫：...",
      "title": "绿色修正。一些假设"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自2月中旬以來，我一直在觀察綠色能源股（對我來說，主要是\n太陽能和微電網）紛紛跌停。我將把這個範圍擴大到綠色股票，在\n一般情況下（包括電動車），但想了解一下哪種情況下的意見。\n以下假設可以解釋。\n\n 1. 投機泡沫：...",
      "title": "綠色修正。一些假設"
    }
  ],
  "title": "The Green Correction: Some Hypotheses",
  "created_utc": 1617876867,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been watching since mid-February as green energy stocks (for me, mostly solar and microgrids) have tumbled. I will broaden this out to green stocks in general (throw in EVs) in general, but wanted to get opinions on which of the following hypotheses could explain it:</p>\n\n<ol>\n<li>Speculation Bubble: None of the green stocks have realistic valuations, and are falling back to their value. </li>\n<li>GameStop Black Hole: A lot of the growth in green stocks was from retail, which is now increasingly drawn to meme stocks instead. </li>\n<li>Interest Rates: The rise of 10 year bond interest rate is increasing the cost of loans, and eating into the expected profitability of green companies</li>\n<li>Politics: As green energy becomes a partisan political issue, it is becoming a mood indicator for liberal policies in general</li>\n</ol>\n\n<p>I am long term optimistic about green energy, particularly with <a href=\"https://ourworldindata.org/cheap-renewables-growth\">solar and wind being cost-competitive (and in most cases cheaper) than fossil fuels</a>. I don&#39;t need the money now, so currently just suffering through compounding red days. But I want to understand the source of what is happening, and whether is relates to fundamentals (e.g. valuations are too high now), or technicals (e.g. mass psychology/behavior dragging it down).</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/stocks/comments/mmcpqo/the_green_correction_some_hypotheses/",
  "subreddit": "stocks",
  "id": "mmcpqo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617812
}