{
  "author": "Many_Scratch2269",
  "original_created_utc": 1639969683,
  "title": "The government shouldn't tax Crypto unless they recognize it.",
  "created_utc": 1639985487,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m from a country where Crypto is not recognized by the government and therefore I do not have to pay any tax on my Crypto.&lt;/p&gt;\n\n&lt;p&gt;This should be so far the policy for the rest of the governments. Because, taxing something you don&amp;#39;t recognize as an asset of value seems very off. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not like the government does anything for the Crypto market either. The crypto market is an independent market unlike the stock market or a Fiat currency as stocks and other traditional markets are usually bailed out and kept stable by the government. &lt;/p&gt;\n\n&lt;p&gt;A government that provides nothing to Crypto, refuses to recognize crypto as payment and yet expects all Crypto users to pay a tax on the same asset is just hypocritical. &lt;/p&gt;\n\n&lt;p&gt;TLDR: If a government refuses to fully recognize something as an asset, it should not turn around and make money off of it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/rkd54b/the_government_shouldnt_tax_crypto_unless_they/",
  "subreddit": "CryptoCurrency",
  "id": "rkd54b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm from a country where Crypto is not recognized by the government and\ntherefore I do not have to pay any tax on my Crypto.\n\nThis should be so far the policy for the rest of the governments. Because,\ntaxing something you don't recognize as an asset of value seems very off.\n\nIt's not like the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はCryptoが政府によって認識されていない国から来ました。\nしたがって、私は自分のCryptoに税金を払う必要はありません。\n\nこれは、他の国の政府にとっても、今のところ方針であるべきです。なぜなら\n価値ある資産として認識されていないものに課税するのは、とても間違っているように思います。\n\nそれは、まるで...",
      "title": "政府はCryptoを認めない限り課税すべきではない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我来自一个政府不承认加密货币的国家。\n因此，我不需要为我的加密货币支付任何税款。\n\n到目前为止，这应该是其他国家政府的政策。因为。\n对你不承认的有价值的资产征税似乎很不正常。\n\n这并不像...",
      "title": "政府不应该对加密货币征税，除非他们承认它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我來自一個政府不承認加密貨幣的國家。\n因此，我不需要爲我的加密貨幣支付任何稅款。\n\n到目前爲止，這應該是其他國家政府的政策。因爲。\n對你不承認的有價值的資產徵稅似乎很不正常。\n\n這並不像...",
      "title": "政府不應該對加密貨幣徵稅，除非他們承認它。"
    }
  ]
}