{
  "author": "HaloWaifu",
  "original_created_utc": 1631181934,
  "title": "Does the feeling of still being a teenager ever go away?",
  "created_utc": 1631243580,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 20 but I still feel like I&#39;m 16, especially mentally and I have this despair of getting older, like I&#39;ll close my eyes and be 40 next time I open them. I don&#39;t feel mature for my age and I&#39;m shocked at seeing people in my age group who actually look and act like adults. Sometimes I even forget that I&#39;m above the age of consent and feel weird when guys around or older than me hit on me before I remember. </p>\n\n<p>I feel like I need to buy a house decorated in all white with live-laugh-love and have little gatherings with wine and cheese to be an adult. And I hate that, because I like video games and lava lamps and glow in the dark stuff, but that&#39;s not what an adult is about.</p>\n\n<p>Edit: just to add on, I turned 19 and 20 during the pandemic so that could be a contribution factor for a lot of us who became adults. Thank you everyone for sharing how you feel and your experiences with age!</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/pkuurw/does_the_feeling_of_still_being_a_teenager_ever/",
  "subreddit": "NoStupidQuestions",
  "id": "pkuurw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm 20 but I still feel like I'm 16, especially mentally and I have this despair\nof getting older, like I'll close my eyes and be 40 next time I open them. I\ndon't feel mature for my age and I'm shocked at seeing people in my age group\nwho actually look and act like adults. Sometimes I even forget…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は20歳ですが、特に精神的にはまだ16歳のような気がします。\n目を閉じると40歳になっているような、年をとることへの絶望感があります。I\n同年代の人たちを見てショックを受けています。\n同年代の人たちが実際に大人のように見え、行動しているのを見てショックを受けます。時々、私は忘れてしまいます。",
      "title": "まだ10代であるという感覚は消えないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经20岁了，但我仍然觉得自己是16岁，特别是在精神上，我有这种对变老的绝望。\n我对变老感到绝望，就像我闭上眼睛，下次睁开眼睛就会变成40岁。I\n我不觉得自己的年龄有多成熟，看到同年龄段的人，我很震惊。\n感到震惊，因为我看到同年龄组的人看起来和行动都像成年人。有时我甚至忘记了...",
      "title": "仍然是青少年的感觉是否会消失？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經20歲了，但我仍然覺得自己是16歲，特別是在精神上，我有這種對變老的絕望。\n我對變老感到絕望，就像我閉上眼睛，下次睜開眼睛就會變成40歲。I\n我不覺得自己的年齡有多成熟，看到同年齡段的人，我很震驚。\n感到震驚，因爲我看到同年齡組的人看起來和行動都像成年人。有時我甚至忘記了...",
      "title": "仍然是青少年的感覺是否會消失？"
    }
  ]
}