{
  "author": "pleasedontjudgeme13",
  "original_created_utc": 1628226881,
  "title": "Why are there so many comments and so little upvotes?",
  "created_utc": 1628297232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are SO MANY comments. This is just my observation. But it feels like every posts gets more comments than in other subreddits. But the upvotes never follow. This could mean one of two things: 1) people are stingy. They realize if they upvote others, they get less moons for their upvotes. 2) More people like to comment and discuss crypto? Comments could get more upvotes than posts do. </p>\n\n<p>Tldr; every time I post I feel like a meat loaf dangled into a pool of piranhas because of all the comments on posts here.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/oz05tk/why_are_there_so_many_comments_and_so_little/",
  "subreddit": "CryptoCurrency",
  "id": "oz05tk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are SO MANY comments. This is just my observation. But it feels like every\nposts gets more comments than in other subreddits. But the upvotes never follow.\nThis could mean one of two things: 1) people are stingy. They realize if they\nupvote others, they get less moons for their upvotes. 2)…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SO MANYのコメントがあります。これは私の観察に過ぎません。感じています。\n他のsubredditsよりもコメントが多い気がします。しかし、upvoteはついてきません。\nこれには2つの意味があります。1) 人々がケチである。他の人をupvoteすると、自分の得られる利益が減ることを\n他の人をupvoteすると、自分のupvote分の月数が減ることに気づく。2)...",
      "title": "なぜこんなにコメントが多いのに、アップヴォートが少ないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有这么多的评论。这只是我的观察。但感觉每一个\n帖子的评论都比其他子版块的多。但是加分项却从未出现过。\n这可能意味着两件事中的一件。1）人们很吝啬。他们意识到如果他们\n给别人加分，他们得到的加分就会减少。2)...",
      "title": "为什么有这么多的评论，却没有这么多的支持？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有這麼多的評論。這只是我的觀察。但感覺每一個\n帖子的評論都比其他子版塊的多。但是加分項卻從未出現過。\n這可能意味着兩件事中的一件。1）人們很吝嗇。他們意識到如果他們\n給別人加分，他們得到的加分就會減少。2)...",
      "title": "爲什麼有這麼多的評論，卻沒有這麼多的支持？"
    }
  ]
}