{
  "author": "waawooweewaa",
  "original_created_utc": 1635315504,
  "title": "Why do people hate electric cars?",
  "created_utc": 1635335428,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I always scroll through comments on videos of teslas hitting 0-60 in like 3 seconds, and all of the comments are like “most boring 0-60 ever”, “have fun driving a bomb”, and “electric is not the future. If it ain’t broke, don’t fix it”. Like do people really like paying for gas and having their engine repaired every year? Why does it make you cum when you hear the car screaming in agony? I can tell they’re ignorant but this doesn’t have to be political to understand the adv/dis. I’m not a huge car guy and although I can appreciate the chargers/cameros/Ferraris, I’d much rather have a more efficient and technologically advanced car.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/qgq3qy/why_do_people_hate_electric_cars/",
  "subreddit": "TooAfraidToAsk",
  "id": "qgq3qy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I always scroll through comments on videos of teslas hitting 0-60 in like 3\nseconds, and all of the comments are like “most boring 0-60 ever”, “have fun\ndriving a bomb”, and “electric is not the future. If it ain’t broke, don’t fix\nit”. Like do people really like paying for gas and having their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はいつも、0-60を3秒で走るテスラのビデオのコメントをスクロールします。\n3秒くらいで0-60を達成しているテスラのビデオのコメントを見ると、すべてのコメントが「今までで最も退屈な0-60」、「爆弾を運転して楽し\nとか、「爆弾を運転するのは楽しい」とか、「電気自動車は未来ではない。壊れていないなら、直さなくていい。\n壊れていなければ直す必要はない」というものです。人々は本当にガソリン代を払って、自分の...",
      "title": "電気自動車はなぜ嫌われるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总是翻阅特斯拉在3秒内达到0-60英里的视频评论，所有的评论都是 \"有史以来最无聊的0-60英里\"、\"玩得开心\"。\n所有的评论都是 \"有史以来最无聊的0-60\"，\"享受驾驶炸弹的乐趣\"，以及 \"电动车不是未来\"。\n所有的评论都是 \"有史以来最无聊的0-60秒\"，\"享受驾驶炸弹的乐趣\"，以及 \"电动汽车不是未来的趋势。如果它没坏，就不要修\n就不要修\"。就像人们真的喜欢花钱买汽油并让他们的...",
      "title": "为什么人们讨厌电动汽车？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是翻閱特斯拉在3秒內達到0-60英里的視頻評論，所有的評論都是 \"有史以來最無聊的0-60英里\"、\"玩得開心\"。\n所有的評論都是 \"有史以來最無聊的0-60\"，\"享受駕駛炸彈的樂趣\"，以及 \"電動車不是未來\"。\n所有的評論都是 \"有史以來最無聊的0-60秒\"，\"享受駕駛炸彈的樂趣\"，以及 \"電動汽車不是未來的趨勢。如果它沒壞，就不要修\n就不要修\"。就像人們真的喜歡花錢買汽油並讓他們的...",
      "title": "爲什麼人們討厭電動汽車？"
    }
  ]
}