{
  "author": "Mr_Find_Value",
  "the_new_excerpt": "I don't know who needs to read this but I think it's a very important message to\nhear. I've been investing proactively for going on 6 years now. Not a wealth of\nexperience, but enough to more or less know what I'm doing.\n\nSo long as your initial due diligence was good, and unless the company is…",
  "original_created_utc": 1617185387,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道谁需要读这个，但我认为这是一个非常重要的信息，以\n听说。我主动投资已经6年了。并不是一个丰富的\n经验，但足以让我或多或少知道自己在做什么。\n\n只要你最初的尽职调查是好的，除非公司是... ...",
      "title": "尽量不要卖，永远不要。最大的遗憾来自于过早的卖出，而不是错过机会。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道誰需要讀這個，但我認爲這是一個非常重要的信息，以\n聽說。我主動投資已經6年了。並不是一個豐富的\n經驗，但足以讓我或多或少知道自己在做什麼。\n\n只要你最初的盡職調查是好的，除非公司是... ...",
      "title": "儘量不要賣，永遠不要。最大的遺憾來自於過早的賣出，而不是錯過機會。"
    }
  ],
  "title": "Try not to sell, ever. The biggest regrets come from selling early, not missed opportunities.",
  "created_utc": 1617190787,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know who needs to read this but I think it&#39;s a very important message to hear. I&#39;ve been investing proactively for going on 6 years now. Not a wealth of experience, but enough to more or less know what I&#39;m doing. </p>\n\n<p>So long as your initial due diligence was good, and unless the company is faced with certain doom, try not to ever, ever sell any of the stock. </p>\n\n<p>All of my biggest regrets don&#39;t come from opportunities missed, like crypto or Tesla or the plethora of multi-baggers out there. It has always, always been selling a stock that I knew was good but I thought had run up over its fair value and sold.</p>\n\n<p>The market is a mass wealth accumulation machine. If the company is good, even if its value has gone up significantly compared to its cash flows, hold. I always find the solid companies I invest in continue to increase their earnings into the futures and not only grow into their higher evaluations but exceed them in a few years time.</p>\n\n<p>Whatever you do, provided your due diligence and research was good, try not to ever sell. Let that great machine of wealth creation that is the stock market work for you and the companies you invest in. Let it churn, let it grow. Take your hands off the wheel and let your good choices be rewarded with time.</p>\n\n<p>I know this isn&#39;t the most quantitative post, but I think it is a good signal to put out there. Don&#39;t be afraid to leave your winners be, reinvest your dividends, give your choices time to compound. Be a lazy investor, let your good decisions reward you in abundance and take your hands off the wheel, you&#39;ll be all the wealthier for it.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/investing/comments/mh2x3s/try_not_to_sell_ever_the_biggest_regrets_come/",
  "subreddit": "investing",
  "id": "mh2x3s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357140069
}