{
  "author": "dumbeinsteinASU0101",
  "original_created_utc": 1643765513,
  "title": "Was it possible to prank call high ranking Nazis during WWII and get away with it?",
  "created_utc": 1643784821,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was just thinking, if you were in Nazi Germany in WWII, would it have been possible to make prank calls to members of the Reich government without being caught? I mean, how would they ever realistically trace the call? Could I have phoned the Reich Chancellery in 1941, said something stupid like “mein Hitler ist kaputt!”, hung up, and gotten away with it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/sibq2r/was_it_possible_to_prank_call_high_ranking_nazis/",
  "subreddit": "AskHistorians",
  "id": "sibq2r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was just thinking, if you were in Nazi Germany in WWII, would it have been\npossible to make prank calls to members of the Reich government without being\ncaught? I mean, how would they ever realistically trace the call? Could I have\nphoned the Reich Chancellery in 1941, said something stupid like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、あなたが第二次世界大戦中のナチス・ドイツにいたとしたら、どうだっただろう？\n帝国政府関係者にいたずら電話をかけることができる。\n捕まる？つまり、現実的にどうやって通話を追跡するんだ？私が\n1941年に帝国総統府に電話をかけて、こんなバカなことを言ったんだ。",
      "title": "第二次世界大戦中、ナチスの高官にいたずら電話をして、逃げ切ることは可能だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在想，如果你是在二战中的纳粹德国，是否有可能\n是否有可能给帝国政府的成员打恶作剧电话而不被发现？\n而不被发现？我的意思是，他们怎么可能现实地追踪电话？我是否可以\n在1941年打电话给帝国总理府，说一些愚蠢的话，比如......",
      "title": "在二战期间，是否有可能恶作剧地给高级别的纳粹分子打电话并逃脱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在想，如果你是在二戰中的納粹德國，是否有可能\n是否有可能給帝國政府的成員打惡作劇電話而不被發現？\n而不被發現？我的意思是，他們怎麼可能現實地追蹤電話？我是否可以\n在1941年打電話給帝國總理府，說一些愚蠢的話，比如......",
      "title": "在二戰期間，是否有可能惡作劇地給高級別的納粹分子打電話並逃脫？"
    }
  ]
}