{
  "author": "Crafty_Charge",
  "the_new_excerpt": "I found this DD originally posted by /twenty98 5 months ago. I've been following\nthis company ever since. This was before the Amazon partnership I believe but\ncheck this out...\n\nWhat and who is Clean Energy Fuels Corp?\n\nThe company is THE leading provide of the cleanest fuel, Natural Gas, for…",
  "original_created_utc": 1623417435,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5ヶ月前に/twenty98さんが投稿したDDを見つけました。それ以来、私はこの会社を\nそれ以来、この会社を追いかけています。これはアマゾンとの提携の前だったと思いますが\nこれを見てください...\n\nClean Energy Fuels Corp.とは何か、誰なのか?\n\nこの会社は、最もクリーンな燃料である天然ガスを、...",
      "title": "牛の屁以外に$CLNEについて知っておくべきことのすべて..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发现这个DD最初由/twenty98在5个月前发布。我一直在关注\n从那时起，我就一直在关注这家公司。我相信这是在与亚马逊合作之前，但\n看看这个...\n\n清洁能源燃料公司是什么，是谁？\n\n该公司是最清洁的燃料--天然气的领先供应商。",
      "title": "除了牛屁之外，你需要知道的关于$CLNE的一切......。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發現這個DD最初由/twenty98在5個月前發佈。我一直在關注\n從那時起，我就一直在關注這家公司。我相信這是在與亞馬遜合作之前，但\n看看這個...\n\n清潔能源燃料公司是什麼，是誰？\n\n該公司是最清潔的燃料--天然氣的領先供應商。",
      "title": "除了牛屁之外，你需要知道的關於$CLNE的一切......。"
    }
  ],
  "title": "Everything you need to know about $CLNE besides cow farts...",
  "created_utc": 1623424710,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I found this DD originally posted by /twenty98 5 months ago. I&#39;ve been following this company ever since. This was before the Amazon partnership I believe but check this out... </p>\n\n<p><strong>What and who is Clean Energy Fuels Corp?</strong></p>\n\n<p>The company is THE leading provide of the cleanest fuel, Natural Gas, for the transportation market in the United States and Canada. They primarily focus in on:</p>\n\n<ol>\n<li>Regional Fleets of Trucks</li>\n<li>Heavy Duty Trucking</li>\n<li>Airport Transit</li>\n<li>Public Transit</li>\n<li>Construction Vehicles</li>\n<li>Waste Management Vehicles (Dump trucks)</li>\n</ol>\n\n<p>It’s products consist of Compressed Natural Gas (CNG), Renewable Natural Gas (RNG), and Liquefied Natural Gas (LNG). One of its leading products is something called Redeem, which is a form of renewable natural gas (RNG), won’t bother getting into how it’s composed, but know that it provides up to 70% reduction in greenhouse gasses versus diesel and gasoline. Redeem itself is made from organic waste from landfills and farms.</p>\n\n<p><strong>Natural Gas</strong></p>\n\n<p>There has been a lot of stigma around what it really means to be “clean” or “green” when it comes to transportation; most of us think that Electric Vehicles seem to be the most green product for transportation out there. EV’s are definitely the future, I just want to state that before getting started spewing out more information, but RNG has huge demand and can definitely lead the way for clean energy. The company itself reduced 745,000 metric tons of greenhouse gas emissions and more than 401,000,000 gallons were sold in 2019.</p>\n\n<p>This may come as a surprise, but how clean is natural gas? Based only minimal research, it looks to be cleaner than the “electric truck” provided by companies like $HYLN.</p>\n\n<p><strong>Emission Comparison:</strong></p>\n\n<ol>\n<li>Natural Gas Truck - Produces 0.02g/bhp/hr of NO</li>\n<li>Electric Truck - Produces 0.07g/bhp/hr of NO</li>\n<li>Diesel Truck - Produces 0.2g/bhp/hr of NO</li>\n</ol>\n\n<p><strong>Financials &amp; Valuations (as of 9/30/2020):</strong></p>\n\n<ul>\n<li>Current Market Capitalization (as of 1/8/2021) - $2.032B</li>\n<li>Total Revenue (3 months): $70,886,000</li>\n<li>Total Revenue (9 months): $216,766,000</li>\n<li>Net Profit (Loss) – 3 months: ($2,539,000) – Down from ($5,375,000)</li>\n<li>Net Profit (Loss) – 9 months: ($8,677,000) – Down from ($25,964,000)</li>\n<li>Cash on Hand: $91,605,000</li>\n</ul>\n\n<p>The financials of Clean Energy are not very special, yes they have a high PE ratio, but in this market, really anything is possible. The point is the opportunity, with Biden supplementing a lot of stimulus into the clean energy market, Clean Energy Fuels Corp is poised to get a large piece with it being such a staple within the Natural Gas industry.</p>\n\n<p><strong>Partnerships &amp; Programs:</strong></p>\n\n<p><strong>1.</strong> <strong>Chevron</strong></p>\n\n<p>Chevron partnered with CLNE on July 8th, 2020 with the announcement of the <strong>Adopt-a-Port program</strong>. This will allow fleets across North America to subsidize costs transitioning into a greener product for transportation with cost advantages. Chevron will provide funding for Adopt-a-Port and supply RNG to Clean Energy stations near the ports. Chevron’s funding will allow truck operators to subsidize the cost of buying new RNG-powered trucks. Clean Energy, meanwhile, will manage the program, including offering fueling services for qualified truck operators.</p>\n\n<p><strong>2.</strong> <strong>Total SE</strong></p>\n\n<p>Total is a very large company focusing in refining petroleum. They are the largest shareholder of CLNE @ 26% of outstanding shares. Again, a large company partnering with CLNE to produce revenues in the current year and future years. With Total SE, they’ve partnered with CLNE in a joint venture (valued at around $145 million) to launch the Zero Now Program. The <strong>Zero Now Program</strong> allows companies to purchase a natural gas truck for the same price as they could buy a diesel truck; in the combined deal, they would also offer a discount for fuel up until an agreed time to help persuade the companies to go greener.</p>\n\n<p><strong>3.</strong> <strong>BP</strong></p>\n\n<p>The third partner is BP, CLNE recently announced that it will work with BP to develop, own, and operate RNG facilities at dairies and other agriculture facilities that will produce Redeem. The deal is quite small but could mean big things if the partnership were to be progressed through time.</p>\n\n<p><strong>4.</strong> <strong>Waste Connections</strong></p>\n\n<p>Waste connections is the 3rd largest waste collections company in North America, based on market cap, they’re currently worth around $40B. They’ve been a partner with CLNE for years, and have recently promoted one of their regional fleets of dump trucks to RNG vehicles, and will begin operating with Redeem as soon as possible. The fleet consists of 110 trucks in the San Jose area. The deal itself isn’t that great, I must admit, but this could mean big things as if the trial goes well in the San Jose area, this could mean upgrades to their regional fleets across the United States and possibly into Canada.</p>\n\n<p><strong>5.</strong> <strong>Republic Services</strong></p>\n\n<p>Another large company with a long partnership history with Clean Energy Fuels Corp. In February 2019, they announced that they will utilize increasing amounts of Redeem fuel across 21 states over the next 5 years, and this is in process. This transition to cleaner fuel will represent 250,000 metric tons of carbon dioxide emission reduction each year, which translates to around 53,000 passenger vehicles to be taken off the road.</p>\n\n<p><strong>Summary of Partnerships &amp; Programs</strong></p>\n\n<p>These partnerships will continue to provide Clean Energy Fuels Corp. with recurring revenues to drive growth across North America. Their recent and past partnerships continue to give rise to increasing demand of natural gas in one of the largest industries that demands fuel of this nature. The programs in place: Zero Now &amp; Adopt-a-Port program were introduced and will drive growth in the industry by providing incentives to adopting RNG vehicles instead of gasoline or diesel-powered vehicles. There are a lot of advantages to adopting Redeem:</p>\n\n<ul>\n<li>70% reudction in greenhouse gases</li>\n<li>Cost efficient - offered at $1.00/gallon.</li>\n<li>Renewable</li>\n<li>Domestic - Moving North America towards energy independence.</li>\n</ul>\n\n<p><strong>Growth &amp; Opportunities</strong></p>\n\n<p>With most of the world in lockdown, and the rise of eCommerce and the need for shipping and delivery services, this will drive the demand for their Redeem product. Companies like UPS, Kroger, FedEx and Republic Services have already signed up for large deals to use the product as a substantially lower cost then Diesel or Gas. The cost of Redeem is $1.00/gallon to give you perspective. Volume growth for their Redeem Product in the past 3 years averaged 34.67% growth; and this was before the Pandemic.</p>\n\n<p>The Heavy-Duty Truck industry is one of the largest markets for fuel consumption, and so the opportunities are endless to gain more market share as governments are demanding for greener transportation. The Heavy-Duty trucing industry demands 35 billion gallons of fuel, 30 billion over any other market in the big-rig industries.</p>\n\n<p>There are a lot of opportunities for future advancement throughout the space by making partnerships that will be mutually beneficial for both the world, CLNE, and the company involved. Companies that currently use Natural Gas for their national fleets include: Honda, FritoLay, FedEx, Anheuser Busch, Verizon, Bimbo, J&amp;J, Waste Management, Republic Services, Home Depot, Lowes, AT&amp;TT, Costco, Colgate-Palmolive, PepsiCo, UPS, HP, Unilever, Starbucks, Amazon, Kraft, Kroger, and McDonalds. These companies are large, and there is huge potential for future partnerships with them.</p>\n\n<p><strong>Other Notes</strong></p>\n\n<p>You may be asking yourself: “that’s not really that impressive, why should I invest?” Well, the recent hype and growth of the opportunities in Clean Energy are very apparent with the large stimulus packages including a lot of subsidies for clean energy companies. Government’s are transitioning to non-gas related vehicles and this will continue to be progressed for years to come. The company itself has recently been partnering with well-known industry leaders that want to be first-movers in the space to transition to greener consumption of transportation.</p>\n\n<p>The CEO owns 0.7% of shares outstanding. Current shares outstanding are 198M, and of this, the CEO himself owns approximately 1.38 million shares. He definitely believes in the company!</p>\n\n<p><strong>Price Targets</strong></p>\n\n<p>Some people may be curious of my price targets for CLNE. It’s been on an absolute tear recently, so I apologize for the late post, but this is just the beginning! My conservative price target is $20 by June 2021, $40 by end of 2022; this is pretty much guessing lol, so take it with a grain of salt.</p>\n\n<p><strong>Disclosure:</strong></p>\n\n<p>Do your own due diligence before investing, this is just my personal opinion on the company, and this is not financial advice of any kind! I’m not liable for any losses that you guys might incur! But I do believe in this company!</p>\n</div><!-- SC_ON -->",
  "score": 2502,
  "permalink": "/r/wallstreetbets/comments/nxfrlp/everything_you_need_to_know_about_clne_besides/",
  "subreddit": "wallstreetbets",
  "id": "nxfrlp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009747673
}