{
  "author": "pitterpatter0207",
  "original_created_utc": 1656508700,
  "title": "How to deal with a nearly sexless marriage?",
  "created_utc": 1656517562,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello I am looking for some guidance, I am 26 my wife being 29 and sex in our marriage is basically non existent happening once maybe twice a month. We have 2 children our relationship is great everybody is happy life is good. The best way I can explain it is sex is just the very last thing on her priority list she doesn’t talk about sex nor does she ever masturbate, i don’t think it would bother her if it never happened again while the thought of sex is in my head quite often. I do not have a desire to cheat or risk losing what I have but I continuously have thoughts of what it must be like to have a partner that WANTS sex. I have expressed multiple times over and over that this is a problem for me but nothing has ever changed and I’ve just stopped trying all together and just masturbate when there’s an urge. It wasn’t always like this and I don’t know what I can do to change it or if there is anything I can do. What are my options here?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 158,
  "permalink": "/r/NoStupidQuestions/comments/vnfmxq/how_to_deal_with_a_nearly_sexless_marriage/",
  "subreddit": "NoStupidQuestions",
  "id": "vnfmxq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Hello I am looking for some guidance, I am 26 my wife being 29 and sex in our\nmarriage is basically non existent happening once maybe twice a month. We have 2\nchildren our relationship is great everybody is happy life is good. The best way\nI can explain it is sex is just the very last thing on her…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私はいくつかのガイダンスを探しています、私は26です妻は29とセックスで私たちの...\n基本的に月に1、2回しかありません。私たちは2\nを弖紗することができます。最高の方法\nを説明すると、セックスは彼女の最後のものです...",
      "title": "ほぼセックスレスの夫婦にどう対処するか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我想寻求一些指导，我26岁，我的妻子29岁，我们的性生活是很正常的。\n我们的婚姻基本上是不存在的，一个月只有一次或两次。我们有两个\n孩子，我们的关系很好，每个人都很开心，生活很美好。最好的办法是\n我可以解释的是，性是她最不愿意看到的。",
      "title": "如何处理几乎无性的婚姻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我想尋求一些指導，我26歲，我的妻子29歲，我們的性生活是很正常的。\n我們的婚姻基本上是不存在的，一個月只有一次或兩次。我們有兩個\n孩子，我們的關係很好，每個人都很開心，生活很美好。最好的辦法是\n我可以解釋的是，性是她最不願意看到的。",
      "title": "如何處理幾乎無性的婚姻？"
    }
  ]
}