{
  "author": "Dupe5s",
  "original_created_utc": 1624903297,
  "title": "I am leaving.",
  "created_utc": 1624915836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The reason why I am leaving is that I am currently a student that is studying and have been too distracted about crypto and it looks like I would need to stop caring about my investments. Therefore, I think It would be wise for me to put in as much money as possible before I leave for real. I have bought the recent dip with almost most of my money and I am sure that I would not need the money for a long time. Cryptocurrency has brought emotional stress for me and I think that it is unhealthy for my mental health. Studying has already made me feel stressed out and in addition to cryptocurrency, this has made me feel like shit for the past months. Therefore I am gonna leave and come back when I graduate. The moons I have on this post will also not be touched for a couple of years. See you guys when 2024 starts. (the start of the next bull run). I am looking forward to that day :)</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks, everyone for the support for the past months. I appreciate it. It has been a fun ride with you guys. Gonna delete Reddit and my exchange :)</p>\n\n<p>The coins I&#39;m currently holding is Btc, Eth,Ada if you guys are wondering  </p>\n\n<p>EDIT : Thanks for the tips guys! </p>\n</div><!-- SC_ON -->",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/o9pqog/i_am_leaving/",
  "subreddit": "CryptoCurrency",
  "id": "o9pqog",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The reason why I am leaving is that I am currently a student that is studying\nand have been too distracted about crypto and it looks like I would need to stop\ncaring about my investments. Therefore, I think It would be wise for me to put\nin as much money as possible before I leave for real. I have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "退会する理由は、私は現在勉強中の学生で、暗号に気を取られすぎていて\n勉強していますが、暗号に気を取られすぎていて、もうやめた方が良さそうです。\n自分の投資に気を配るのをやめなければならなくなりそうだからです。そのため、私にとっては\n私は、本気で出発する前に、できるだけ多くのお金を入れておくのが賢明だと思います。私は...",
      "title": "私は帰ります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我离开的原因是，我目前是一名正在学习的学生。\n而我对加密货币太过心烦意乱，看来我需要停止\n我需要停止对我的投资的关注。因此，我认为对我来说，明智的做法是把\n在我真正离开之前，尽可能多地投入资金。我已经...",
      "title": "我要走了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我離開的原因是，我目前是一名正在學習的學生。\n而我對加密貨幣太過心煩意亂，看來我需要停止\n我需要停止對我的投資的關注。因此，我認爲對我來說，明智的做法是把\n在我真正離開之前，儘可能多地投入資金。我已經...",
      "title": "我要走了。"
    }
  ]
}