{
  "author": "Glenzz",
  "the_new_excerpt": "Planning on HODLing long term for 10 years or so, and still being in my 20s I do\nfeel a lot more optimistic for the future than if I had just worked away all my\nlife and stored all my money in the bank to depreciate\n\nI’ve already been working as a tradesman for 10 years, no way I’m doing this…",
  "original_created_utc": 1617792420,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10年ほどの長期にわたるHODLを計画していますが、まだ20代なので、将来のことを考えると\n一生懸命働いて、銀行にお金を貯めて減価償却していた場合よりも、将来に対して楽観的になれます。\n働かずに銀行に貯金して減価償却していくよりも、将来に対して楽観的になれます。\n\n私はすでに10年間、職人として働いていますが、こんなことはできません。",
      "title": "今、長い人生にホッとしている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "计划长期做HODL，10年左右，还在20多岁的我做\n比起我把所有的工作都做掉，我觉得对未来更乐观。\n并把我的钱都存到银行里去贬值。\n\n我已经做了10年工匠，不可能做这个...",
      "title": "现在还有人对自己的长期生活感到欣慰吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "計劃長期做HODL，10年左右，還在20多歲的我做\n比起我把所有的工作都做掉，我覺得對未來更樂觀。\n並把我的錢都存到銀行裏去貶值。\n\n我已經做了10年工匠，不可能做這個...",
      "title": "現在還有人對自己的長期生活感到欣慰嗎？"
    }
  ],
  "title": "Anyone else feel relieved with their longterm life now?",
  "created_utc": 1617806113,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Planning on HODLing long term for 10 years or so, and still being in my 20s I do feel a lot more optimistic for the future than if I had just worked away all my life and stored all my money in the bank to depreciate </p>\n\n<p>I’ve already been working as a tradesman for 10 years, no way I’m doing this for another 40!! If I can cut my working life in half and retire completely in my 40s/50s that would be amazing </p>\n\n<p>Man, it’s actually a reachable goal, i wouldn’t have even found crypto without stumbling into this subreddit. I appreciate you all ❤️</p>\n</div><!-- SC_ON -->",
  "score": 864,
  "permalink": "/r/CryptoCurrency/comments/mlzd12/anyone_else_feel_relieved_with_their_longterm/",
  "subreddit": "CryptoCurrency",
  "id": "mlzd12",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961876911
}