{
  "author": "juaggo_",
  "the_new_excerpt": "In the midst of the earnings season, we should be more interested in how the\ncompany is actually performing, not just staring blindly at the stock’s reaction\nto the results.\n\nIf a company shows good financial performance and provides positive news, you\nshould be happy. Don’t worry about the fact…",
  "original_created_utc": 1619698037,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "決算期の真っ只中にある今、私たちは、株価の反応に目を奪われるのではなく、会社が実際にどのように動いているのかに関心を持つべきです。\n盲目的に株価の反応を見るのではなく、実際に会社がどのように動いているのかに興味を持つべきです。\nに注目する必要があります。\n\n企業が良好な業績を示し、ポジティブなニュースを提供してくれれば\nは喜ぶべきです。事実を気にする必要はありません...",
      "title": "PSA: 決算期には、株価の反応ではなく、企業の実際の業績を見るべきだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在财报季中，我们应该对公司的实际表现更感兴趣\n公司的实际表现，而不仅仅是盲目地盯着股票对业绩的反应\n对结果的反应。\n\n如果一家公司显示出良好的财务表现并提供了积极的消息，你\n应该感到高兴。不要担心事实...",
      "title": "PSA：在财报季，我们应该更多地关注公司的实际财务表现，而不是股票的反应。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在財報季中，我們應該對公司的實際表現更感興趣\n公司的實際表現，而不僅僅是盲目地盯着股票對業績的反應\n對結果的反應。\n\n如果一家公司顯示出良好的財務表現並提供了積極的消息，你\n應該感到高興。不要擔心事實...",
      "title": "PSA：在財報季，我們應該更多地關注公司的實際財務表現，而不是股票的反應。"
    }
  ],
  "title": "PSA: During earnings season, we should look more towards the company’s actual financial performance, not the stock’s reaction",
  "created_utc": 1619704410,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the midst of the earnings season, we should be more interested in how the company is actually performing, not just staring blindly at the stock’s reaction to the results. </p>\n\n<p>If a company shows good financial performance and provides positive news, you should be happy. Don’t worry about the fact that the stock might be 5% down after hours, since that just usually means the positive news were already baked in. Despite the short term drop, your stock still shows that it’s fundamentally strong and will provide good value in the long run.</p>\n\n<p>The stock will eventually catch up with its growth if it does lag. But you shouldn’t be shocked if the stock tanks because of the quarterly reports.</p>\n\n<p><strong>Worry more about the company than the actual stock.</strong></p>\n</div><!-- SC_ON -->",
  "score": 452,
  "permalink": "/r/stocks/comments/n12w23/psa_during_earnings_season_we_should_look_more/",
  "subreddit": "stocks",
  "id": "n12w23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966995
}