{
  "author": "universal_language",
  "the_new_excerpt": "I started that as a comment but it became quite lengthy and I decided that it\nshould be a separate post instead.\n\nLet's say, currently the inflation is 0%, a burger costs $1 and a single stock\nshare of any company costs $20. You can buy 20 burgers if you sell that share.\n\nTomorrow the inflation…",
  "original_created_utc": 1620854657,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コメントとして書き始めたのですが、かなり長くなってしまったので、別の記事にすることにしました。\n代わりに別の記事にすることにしました。\n\n例えば、現在インフレ率が0％で、ハンバーガーが1ドル、どの会社の株式でも1株が20ドルだとします。\n株が20ドルだったとします。その株を売ればハンバーガーが20個買えます。\n\n明日のインフレ率は...",
      "title": "インフレの説明は5歳の時のように"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我开始是以评论的形式写的，但后来变得很冗长，我决定\n应该是一个单独的帖子，而不是。\n\n比方说，目前的通货膨胀率是0%，一个汉堡的价格是1美元，任何公司的单一股票\n任何公司的股票都是20美元。如果你卖掉这支股票，你可以买20个汉堡。\n\n明天的通货膨胀...",
      "title": "通货膨胀的解释就像你五岁的时候"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我開始是以評論的形式寫的，但後來變得很冗長，我決定\n應該是一個單獨的帖子，而不是。\n\n比方說，目前的通貨膨脹率是0%，一個漢堡的價格是1美元，任何公司的單一股票\n任何公司的股票都是20美元。如果你賣掉這支股票，你可以買20個漢堡。\n\n明天的通貨膨脹...",
      "title": "通貨膨脹的解釋就像你五歲的時候"
    }
  ],
  "title": "Inflation explained like you're five",
  "created_utc": 1620861061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started that as a comment but it became quite lengthy and I decided that it should be a separate post instead.</p>\n\n<p>Let&#39;s say, currently the inflation is 0%, a burger costs $1 and a single stock  share of any company costs $20. You can buy 20 burgers if you sell that share.</p>\n\n<p>Tomorrow the inflation becomes 10%. Everything is more expensive by 10%. The burger now costs $1.1, the share costs $22. You can still buy 20 burgers for that share. But if you have sold that share yesterday at $20, today you can buy only 18 burgers. Your money lost buying power due to inflation. That&#39;s why some people say that during the inflation it&#39;s better to have money in the market, you protect your money from losing value by buying stocks. But it&#39;s often not that simple, we&#39;ll return to this at the end.</p>\n\n<p>The government doesn&#39;t like 10% inflation, it&#39;s too high. They like 5% inflation. To achieve that they need to decrease the demand for buying burgers. When less people compete for the goods, the price of those goods decreases. How can government decrease the demand? They do it by increasing the interest rate in banks. Now instead of spending $1.1 on the burger you can put that money into the bank, and over time your money will grow in value, and in 30 years you&#39;ll be able to buy 1000 burgers. Not everyone is capable of delayed gratification, so only part of people will put money into the bank, the others will continue buying burgers. Anyway, the demand decreases and eventually the burger price decreases to $1.05, that&#39;s 5% inflation, exactly what the government wants.</p>\n\n<p>Now let&#39;s talk about the banks. How do they earn money? They do it by offering loans. Let&#39;s say, a fancy tech company wants to build SkyNet. They need to hire developers and they need money to pay those developers. The company does not earn anything yet, so the plan is to get money from the bank, build the product, then start earning and then repay the debts. Bank gives the money to that company and asks to return the same amount and 10% extra later. Where did bank get that money? Well, most likely they are just holding your salary on your bank account. Your money is safe, no one can steal it, and at the same time bank can use that money to give loans and earn interest. Everyone is happy.</p>\n\n<p>You remember that the government increased the interest rate to fight the inflation, right? Previously your money was just sitting at the deposit and doing nothing. But now you started to earn some interest on it. Let&#39;s say, it&#39;s 5% per year. This makes banks sad, because instead of just using your money and getting extra 10% from the SkyNet company, they now also need to pay you those 5%. Obviously they won&#39;t pay it out of their own pockets. They will instead ask the SkyNet company to return not 10%, but 15% at the end of the loan period.</p>\n\n<p>The SkyNet company now has to pay more to the banks. It&#39;s difficult as they have no earnings yet. Where do they take the money to pay banks? They have to issue more shares and sell it to investors. More shares means more supply. More supply means that the price of the good drops, so the shares of that company become much cheaper.</p>\n\n<p>So, if you&#39;re sure that inflation is inevitable, how can you prepare for this? We discussed that a bit at the beginning. One option is to keep money in your account. Your $20 will lose some value, you&#39;ll be able to buy only 18 burgers instead of 20. Another option is to buy a share of the SkyNet company. As we&#39;ve just discussed, it will likely drop in value and will cost like $12, you&#39;ll buy only 11 burgers for it. But who knows, maybe in 5 years it&#39;ll pay of. And a yet another options is to buy a share of the burger company. Since burgers became more expansive the company also earns more and its share is more valuable. Most likely it costs $25 now, and you can buy more burgers with it.</p>\n\n<p>You&#39;ve already figured it out. The burger company is what we call a value stock. The SkyNet company is the growth stock. And since everyone expects inflation, we currently observe the rotation from the growth stocks into the value stocks.</p>\n</div><!-- SC_ON -->",
  "score": 1303,
  "permalink": "/r/stocks/comments/nazu9q/inflation_explained_like_youre_five/",
  "subreddit": "stocks",
  "id": "nazu9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996885
}