{
  "author": "The_Real_Mr_F",
  "original_created_utc": 1654376348,
  "title": "When is a rock considered to be “born”?",
  "created_utc": 1654394224,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You often hear that a rock is 1 billion years old or 300 million years old or whatever age it may be. What is the starting point for a rock’s age? I assume it might vary based on the type of rock, like maybe volcanic rocks are “born” when they emerge from a volcano, or sedimentary rocks are “born” when they harden from whatever swampy material they were before, but I’m not sure, and Googling mainly tells me that Dwayne Johnson was born in 1972, which is interesting but not helpful. Since just about every rock is made of material that has been around since the Big Bang, it’s confusing to know what science considers the start of a rock’s existence. What defines a rock’s birthday?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 265,
  "permalink": "/r/askscience/comments/v4xy3e/when_is_a_rock_considered_to_be_born/",
  "subreddit": "askscience",
  "id": "v4xy3e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You often hear that a rock is 1 billion years old or 300 million years old or\nwhatever age it may be. What is the starting point for a rock’s age? I assume it\nmight vary based on the type of rock, like maybe volcanic rocks are “born” when\nthey emerge from a volcano, or sedimentary rocks are “born”…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よく、10億年前の岩石とか3億年前の岩石とか\nよく耳にしますが 岩石の年齢の出発点は何なのでしょうか？おそらく\n火山岩が出現したときに生まれるとか、岩石の種類によって違うのでは？\n火山岩が「生まれる」とか、堆積岩が「生まれる」とか...。",
      "title": "石はいつ「生まれる」と考えられているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你经常听到有人说，一块岩石有10亿年的历史或3亿年的历史或\n无论它是什么年龄。岩石年龄的起始点是什么？我想它\n可能会根据岩石的类型而有所不同，比如说火山岩是在从火山里出来的时候 \"出生 \"的。\n当它们从火山中出现时，或者沉积岩是 \"出生 \"的......",
      "title": "岩石何时被认为是 \"出生\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你經常聽到有人說，一塊岩石有10億年的歷史或3億年的歷史或\n無論它是什麼年齡。岩石年齡的起始點是什麼？我想它\n可能會根據岩石的類型而有所不同，比如說火山岩是在從火山裏出來的時候 \"出生 \"的。\n當它們從火山中出現時，或者沉積岩是 \"出生 \"的......",
      "title": "岩石何時被認爲是 \"出生\"？"
    }
  ]
}