{
  "author": "thehammer6",
  "original_created_utc": 1625143174,
  "title": "How does Hawking's area theorem reconcile with Hawking radiation?",
  "created_utc": 1625153110,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hawking&#39;s area theorem says that the area of a black hole&#39;s event horizon can never decrease, only increase, similarly to entropy. Further, the radius (and hence, the area) of the event horizon is determined by the mass inside the horizon. At the same time, Hawking&#39;s theory that quantum effects near the event horizon can cause Hawking radiation implies the black hole can evaporate.</p>\n\n<p>I suspect I&#39;m missing some simple nuance of one or both of the theories that reconciles the two, but if the event horizon can never shrink and the area of the horizon is determined by the hole&#39;s mass, then how can black holes evaporate through Hawking radiation?</p>\n</div><!-- SC_ON -->",
  "score": 125,
  "permalink": "/r/askscience/comments/obkz5d/how_does_hawkings_area_theorem_reconcile_with/",
  "subreddit": "askscience",
  "id": "obkz5d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hawking's area theorem says that the area of a black hole's event horizon can\nnever decrease, only increase, similarly to entropy. Further, the radius (and\nhence, the area) of the event horizon is determined by the mass inside the\nhorizon. At the same time, Hawking's theory that quantum effects near…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ホーキング博士の面積定理とは、ブラックホールの事象の地平線の面積は、エントロピーと同じように\nエントロピーと同じように、ブラックホールの事象の地平線の面積は決して小さくならず、大きくなるだけだというものです。さらに、事象の地平線の半径（したがって面積）は\nさらに、事象の地平線の半径（したがって面積）は、地平線の内側にある質量によって決まります。\nで決まります。同時に、ホーキング博士の理論では、事象の地平線付近の量子効果は...",
      "title": "ホーキングの面積定理とホーキング放射との整合性は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "霍金的面积定理说，黑洞事件视界的面积不能\n永远不会减少，只会增加，与熵类似。此外，事件视界的半径（以及\n因此，事件穹界的面积是由穹界内的质量决定的。\n界的质量决定的。同时，霍金的理论认为，量子效应近...",
      "title": "霍金的面积定理如何与霍金辐射相协调？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "霍金的面積定理說，黑洞事件視界的面積不能\n永遠不會減少，只會增加，與熵類似。此外，事件視界的半徑（以及\n因此，事件穹界的面積是由穹界內的質量決定的。\n界的質量決定的。同時，霍金的理論認爲，量子效應近...",
      "title": "霍金的面積定理如何與霍金輻射相協調？"
    }
  ]
}