{
  "author": "warriorlynx",
  "original_created_utc": 1642876794,
  "title": "Crypto will go to 5 Trillion in 2022",
  "created_utc": 1642887471,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes you heard me it may be half of its ATH right now but Crypto will go to 5 trillion dollars this year that’s right in 2022 in fact I guarantee it and this IS financial advice.&lt;/p&gt;\n\n&lt;p&gt;I don’t know shit about fuck? You are wrong I know this because I did the TA and it is set for a massive massive super massive bounce and relief rally. The king will jump to 45k and dump to 39k for one last correction and then off we fricken go like no one has ever seen. &lt;/p&gt;\n\n&lt;p&gt;What other proof do you want? Hash rates at ATH, PoS staking / TVL at record highs, illiquidity rates, record coins and tokens off exchanges, the log charts showing we never topped, extreme fear, bears super greedy as hell, how much more do you want?&lt;/p&gt;\n\n&lt;p&gt;I am so fucking bullish I am getting a fricken pickle or a hard on so pls recommend me to some NSFW content thanks&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 689,
  "permalink": "/r/CryptoCurrency/comments/sa8zfr/crypto_will_go_to_5_trillion_in_2022/",
  "subreddit": "CryptoCurrency",
  "id": "sa8zfr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Yes you heard me it may be half of its ATH right now but Crypto will go to 5\ntrillion dollars this year that’s right in 2022 in fact I guarantee it and this\nIS financial advice.\n\nI don’t know shit about fuck? You are wrong I know this because I did the TA and\nit is set for a massive massive super…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうです、今現在は時価総額の半分かもしれませんが、暗号は5億円まで行くでしょう。\n今年、つまり2022年に1兆円、これは私が保証します。\nこれは財務的なアドバイスです。\n\n俺はクソも知らねぇってのか？あなたは間違っている、私はTAを行ったので知っている、そして\n超巨大な超巨大な...",
      "title": "暗号は2022年に5兆円へ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，你听到我说的了，现在它可能是其总资产的一半，但加密货币将在今年达到5万亿美元，也就是在2022年。\n今年将达到5万亿美元，也就是2022年，事实上，我保证这一点。\n这是金融建议。\n\n我什么都不知道吗？你错了，我知道这一点，因为我做了TA和\n它被设定为一个巨大的超级...",
      "title": "加密货币将在2022年达到5万亿美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，你聽到我說的了，現在它可能是其總資產的一半，但加密貨幣將在今年達到5萬億美元，也就是在2022年。\n今年將達到5萬億美元，也就是2022年，事實上，我保證這一點。\n這是金融建議。\n\n我什麼都不知道嗎？你錯了，我知道這一點，因爲我做了TA和\n它被設定爲一個巨大的超級...",
      "title": "加密貨幣將在2022年達到5萬億美元"
    }
  ]
}