{
  "author": "nuub96",
  "original_created_utc": 1627461167,
  "title": "Do women see lesbians the same way men see gay men?",
  "created_utc": 1627479400,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For context I&#39;m a guy and I&#39;ve noticed that most of my male freinds are uncomfortable with gay men but have absolutely no problem when it comes gay women. Personally I think they are uncomfortable because they don&#39;t like the idea that a man would be attracted to them. I just wanted to know if women feel the same way as they do.</p>\n</div><!-- SC_ON -->",
  "score": 149,
  "permalink": "/r/TooAfraidToAsk/comments/ot5sjz/do_women_see_lesbians_the_same_way_men_see_gay_men/",
  "subreddit": "TooAfraidToAsk",
  "id": "ot5sjz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For context I'm a guy and I've noticed that most of my male freinds are\nuncomfortable with gay men but have absolutely no problem when it comes gay\nwomen. Personally I think they are uncomfortable because they don't like the\nidea that a man would be attracted to them. I just wanted to know if women…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は男性ですが、男性の友人のほとんどが\n同性愛者の男性には抵抗があるが、同性愛者の女性には全く問題がない。\n女性の場合は全く問題ない。個人的には、彼らは男性が自分に惹かれるという考えが好きではないので、不快に感じているのだと思います。\n個人的には、彼らは男性が自分に惹かれるという考えが嫌いだから不快なのだと思います。私が知りたかったのは、もし女性が...",
      "title": "男性がゲイを見るのと同じように、女性はレズビアンを見るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个男人，我注意到我的大多数男性朋友都对同性恋者感到不舒服，但当涉及到同性恋时却完全没有问题。\n我注意到，我的大多数男性朋友对男同性恋者感到不舒服，但当涉及到女同性恋者时，却完全没有问题。\n女性。我个人认为他们感到不舒服是因为他们不喜欢男人对他们有吸引力的想法。\n他们不喜欢一个男人对他们有吸引力的想法。我只是想知道，如果女人...",
      "title": "女性对女同性恋者的看法与男性对男同性恋者的看法一样吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個男人，我注意到我的大多數男性朋友都對同性戀者感到不舒服，但當涉及到同性戀時卻完全沒有問題。\n我注意到，我的大多數男性朋友對男同性戀者感到不舒服，但當涉及到女同性戀者時，卻完全沒有問題。\n女性。我個人認爲他們感到不舒服是因爲他們不喜歡男人對他們有吸引力的想法。\n他們不喜歡一個男人對他們有吸引力的想法。我只是想知道，如果女人...",
      "title": "女性對女同性戀者的看法與男性對男同性戀者的看法一樣嗎？"
    }
  ]
}