{
  "author": "IamCluLess",
  "the_new_excerpt": "Yep. You read that correctly, no this isn’t a reference to investing in your\nbeloved stock. It’s just a message to all of you and in specific the person that\nreally needs to hear this right now.\n\nWSB is a toxic community, we pride ourselves in it. It’s kind of like how when\nyour dad says “shut up…",
  "original_created_utc": 1614842599,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "是的，你没看错 你没看错，这不是指投资你的...\n心爱的股票。这只是给大家的一个信息，具体来说就是给大家的一个信息。\n真的需要听到这个现在。\n\nWSB是个有毒的社区 我们以此为荣。这有点像当\n你爸爸说 \"闭嘴...",
      "title": "这不值得。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，你沒看錯 你沒看錯，這不是指投資你的...\n心愛的股票。這只是給大家的一個信息，具體來說就是給大家的一個信息。\n真的需要聽到這個現在。\n\nWSB是個有毒的社區 我們以此爲榮。這有點像當\n你爸爸說 \"閉嘴...",
      "title": "這不值得。"
    }
  ],
  "title": "It’s not worth it.",
  "created_utc": 1614867948,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yep. You read that correctly, no this isn’t a reference to investing in your beloved stock. It’s just a message to all of you and in specific the person that really needs to hear this right now. </p>\n\n<p>WSB is a toxic community, we pride ourselves in it. It’s kind of like how when your dad says “shut up retard” what he really means is I love you son. (Well maybe he really does mean you’re retarded and wants you to shut up) </p>\n\n<p>I digress… Anyways, with a community of over 9 million users it would be almost statistically impossible that there <strong>isnt</strong> someone here who has lost a lot of money, has made a huge mistake whether it be from just misunderstanding, or trading on emotions and is really battling with suicidal thoughts. </p>\n\n<p>I just want to let you know that I and many others are here for you, you can message me anytime my inbox is open. Your life isn’t worth a loss of money, let me say that again. <strong>Your life isn’t worth any amount of money.</strong> There are people that care about you way more than they care about your money. Things will get better. You will make it through. Message me or anyone else who volunteers at any time. I for one am here to listen if you need anything.</p>\n</div><!-- SC_ON -->",
  "score": 10773,
  "permalink": "/r/wallstreetbets/comments/lxf5v9/its_not_worth_it/",
  "subreddit": "wallstreetbets",
  "id": "lxf5v9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542579470
}