{
  "author": "arktal",
  "original_created_utc": 1627132237,
  "title": "After months of sacrifices, I finally stacked 0.1BTC",
  "created_utc": 1627148060,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My interest in bitcoin started back in February and I binge read stuff about it back then.</p>\n\n<p>Because of my low income, I sacrifice quite a lot of things to be able to save up as much money as possible since I want to be able to buy my own house as soon as possible. Meaning I only occasionally eat meat, fish, or even fruits (even though I love those!), I will only buy games during sales, and think twice before buying things not essential.</p>\n\n<p>I keep some emergency savings in bank, but all the rest goes into bitcoin (yes, I&#39;m going against the rule of investing only what I can afford to lose for I strongly believe in Bitcoin)</p>\n\n<p>All these sacrifices paid off as I finally managed to stack 10 000 000 satoshis.</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/Bitcoin/comments/oqpqyc/after_months_of_sacrifices_i_finally_stacked_01btc/",
  "subreddit": "Bitcoin",
  "id": "oqpqyc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My interest in bitcoin started back in February and I binge read stuff about it\nback then.\n\nBecause of my low income, I sacrifice quite a lot of things to be able to save\nup as much money as possible since I want to be able to buy my own house as soon\nas possible. Meaning I only occasionally eat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がビットコインに興味を持ったのは2月のことで、当時はビットコインに関する本を読みあさりました。\n読んでいました。\n\n私は収入が少ないので、できるだけ多くのお金を貯めるために多くのことを犠牲にしています。\n私は収入が少ないので、できるだけ多くのお金を貯めるために、いろいろなことを犠牲にしていますが、それは早く自分の家を買いたいからです。\n私は収入が少ないので、できるだけ早く自分の家を買うために、多くのことを犠牲にして貯金しています。つまり、たまにしか食べない...。",
      "title": "何ヶ月もの犠牲の末、ついに0.1BTCを積み上げました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对比特币的兴趣始于二月份，当时我疯狂地阅读了关于比特币的资料。\n那时候。\n\n因为我的收入很低，所以我牺牲了很多东西，以便能够存下尽可能多的钱。\n尽可能多的钱，因为我想尽快买自己的房子。\n尽可能多的钱。这意味着我只是偶尔会吃...",
      "title": "经过几个月的牺牲，我终于堆了0.1BTC"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對比特幣的興趣始於二月份，當時我瘋狂地閱讀了關於比特幣的資料。\n那時候。\n\n因爲我的收入很低，所以我犧牲了很多東西，以便能夠存下儘可能多的錢。\n儘可能多的錢，因爲我想盡快買自己的房子。\n儘可能多的錢。這意味着我只是偶爾會喫...",
      "title": "經過幾個月的犧牲，我終於堆了0.1BTC"
    }
  ]
}