{
  "author": "booyahkasha",
  "original_created_utc": 1642473971,
  "title": "Emperor Charles the V famously challenged to King Francis I to personal combat to settle their wars in Europe. Wasn't Francis I a renowned fighter? Was Charles serious? Why would he do this?",
  "created_utc": 1642502035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From what I understand on 2 separate occasions Charles V, Mr. Hapsburg, Holy Roman Emperor and arguably the most powerful man in Europe, publicly and officially put it all on the line to challenge Francis the I of France single hand to hand combat to settle their various claims.&lt;/p&gt;\n\n&lt;p&gt;Francis had not only best Henry VIII in a wrestling match by &amp;quot;throwing him in the air&amp;quot;, he was also known for reckless advances and fighting valiantly to the last man in real life or death combat.&lt;/p&gt;\n\n&lt;p&gt;Charles was known for none of these things.&lt;/p&gt;\n\n&lt;p&gt;Why would he make these challenges? Was it political? Was it a bluff? Did he just hate him that much?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/s6midg/emperor_charles_the_v_famously_challenged_to_king/",
  "subreddit": "AskHistorians",
  "id": "s6midg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From what I understand on 2 separate occasions Charles V, Mr. Hapsburg, Holy\nRoman Emperor and arguably the most powerful man in Europe, publicly and\nofficially put it all on the line to challenge Francis the I of France single\nhand to hand combat to settle their various claims.\n\nFrancis had not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の知る限り、2回にわたってハプスブルク家のシャルル5世が\nローマ皇帝であり、ヨーロッパで最も権力を持つ人物が、公に、そして\nフランスのフランシス1世に、全てを賭けて一騎打ちを挑みました。\nを、様々な主張を解決するために直接対決させる。\n\nフランシスはまだ...",
      "title": "皇帝シャルル5世が、ヨーロッパの戦争を解決するために、国王フランシス1世に個人戦を挑んだのは有名な話である。フランシス1世は有名な戦士じゃなかったのか？シャルルは本気だったのか？なぜ、そんなことをしたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，在两个不同的场合，哈布斯堡先生，神圣罗马帝国的皇帝，可以说是欧洲最有权势的人，查理五世公开地和他的朋友们说了话。\n可以说是欧洲最有权势的人，公开地、正式地把一切都押上，向法国的弗朗西斯一世挑战。\n公开地、正式地把一切都押上了，向法国的弗朗西斯一世提出单挑\n来解决他们的各种要求。\n\n弗朗西斯并没有...",
      "title": "查理五世皇帝曾向国王弗朗西斯一世提出挑战，要求亲自作战以解决他们在欧洲的战争。弗朗西斯一世不是一个著名的战士吗？查尔斯是认真的吗？他为什么要这样做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，在兩個不同的場合，哈布斯堡先生，神聖羅馬帝國的皇帝，可以說是歐洲最有權勢的人，查理五世公開地和他的朋友們說了話。\n可以說是歐洲最有權勢的人，公開地、正式地把一切都押上，向法國的弗朗西斯一世挑戰。\n公開地、正式地把一切都押上了，向法國的弗朗西斯一世提出單挑\n來解決他們的各種要求。\n\n弗朗西斯並沒有...",
      "title": "查理五世皇帝曾向國王弗朗西斯一世提出挑戰，要求親自作戰以解決他們在歐洲的戰爭。弗朗西斯一世不是一個著名的戰士嗎？查爾斯是認真的嗎？他爲什麼要這樣做？"
    }
  ]
}