{
  "author": "Mortal1ty1337",
  "the_new_excerpt": "I do love having a go at deciphering the management bullsh8t when they have\ndodgy accounts (sorry if you own it). Here is my stab... the stuff in brackets\nis my deciphering attempt.\n\nCompany: Adjustments on the balance sheets to reduce the carrying amount of\ncertain right of use assets and finance…",
  "original_created_utc": 1615933928,
  "localize": [
    {
      "locale": "zh",
      "title": "插头电源--解读专业术语",
      "the_new_excerpt": "我很喜欢解读管理层的废话，当他们有\n虚假账户（如果你拥有它，很抱歉）。下面是我的尝试......括号里的东西。\n是我的破译尝试。\n\n公司。在资产负债表上调整资产负债表，以减少资产负债表的账面金额。\n某些使用权资产和融资..."
    },
    {
      "locale": "zh-Hant",
      "title": "插頭電源--解讀專業術語",
      "the_new_excerpt": "我很喜歡解讀管理層的廢話，當他們有\n虛假賬戶（如果你擁有它，很抱歉）。下面是我的嘗試......括號裏的東西。\n是我的破譯嘗試。\n\n公司。在資產負債表上調整資產負債表，以減少資產負債表的賬面金額。\n某些使用權資產和融資..."
    }
  ],
  "title": "Plug power - unravelling the jargon",
  "created_utc": 1615959714,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I do love having a go at deciphering the management bullsh8t when they have dodgy accounts (sorry if you own it). Here is my stab... the stuff in brackets is my deciphering attempt.</p>\n\n<p>Company:\nAdjustments on the balance sheets to reduce the carrying amount of certain right of use assets and finance obligations associated with leases.... </p>\n\n<p>(Overestimated the value of the leases they have entered into. Reduction in size of assets and associated lease expense).  </p>\n\n<p> Company:\n·An increase in the loss accrual relating to certain service contracts;</p>\n\n<p>(Probably more serious that the above. They have mispriced service contracts and need to account for more losses as a result).<br/>\n </p>\n\n<p>Company:\n·Recognition of non-cash impairment charges relating to certain long-lived assets, including certain right of use assets and certain fixed assets;</p>\n\n<p>(Probably the most serious. These assets being impaired are non-cash in nature now... but they would have been cash at some point, e.g. capex to build these assets. At its more nefarious... they paid money or provided capex to customers and they just aren&#39;t getting the benefits back).<br/>\n </p>\n\n<p>Company:\n·A reclassification of certain costs resulting in a decrease in Operating expenses - Research and development expense and a corresponding increase in Cost of revenue</p>\n\n<p>(Overestimated the gross margin, cost moving from development to cost of service. Therefore less tech spend... more manufacturing and service spend).</p>\n\n<p>....</p>\n\n<p>All in all seems pretty serious to me. That last set of accounts were a big red flag with negative revenue being delivered. In these situations its a good opportunity to scan the last set of accounts... see what  you could haven&#39;t learnt and what to watch out for.</p>\n</div><!-- SC_ON -->",
  "score": 62,
  "permalink": "/r/investing/comments/m6lakz/plug_power_unravelling_the_jargon/",
  "subreddit": "investing",
  "id": "m6lakz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379968
}