{
  "author": "IAmTheGlazed",
  "the_new_excerpt": "I'm an atheist but I find learning about religions to be really cool and super\ninteresting. Also, occult magic and stuff like that is super interesting.\n\nI went to a magic shop today with some friends where they sold crystals to heal\nyou or give you luck and shit, they had tarot cards, books on…",
  "original_created_utc": 1622750274,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は無神論者ですが、宗教について学ぶことはとてもクールで、とても興味深いことです。\n興味深いです。また、オカルトマジックなども超面白いです。\n\n今日、友達と一緒にマジックショップに行ったんだけど、そこでは癒しや幸運をもたらすクリスタルが売られていて\nタロットカードもあったし、本もあったし・・・。",
      "title": "宗教やオカルトマジックを信じていなくても、学ぶことが好きな人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个无神论者，但我发现学习宗教是非常酷和超级有趣的。\n有趣。另外，神秘的魔法和类似的东西也超级有趣。\n\n我今天和一些朋友去了一家魔术店，他们卖的是水晶，可以治疗你的疾病或给你带来好运。\n或给你带来好运，他们有塔罗牌，还有关于......的书。",
      "title": "还有人不相信宗教或神秘的魔法，但仍然喜欢学习这方面的知识吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個無神論者，但我發現學習宗教是非常酷和超級有趣的。\n有趣。另外，神祕的魔法和類似的東西也超級有趣。\n\n我今天和一些朋友去了一家魔術店，他們賣的是水晶，可以治療你的疾病或給你帶來好運。\n或給你帶來好運，他們有塔羅牌，還有關於......的書。",
      "title": "還有人不相信宗教或神祕的魔法，但仍然喜歡學習這方面的知識嗎？"
    }
  ],
  "title": "Does anyone else not believe in religion or occult magic but still loves to learn about it?",
  "created_utc": 1622759148,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an atheist but I find learning about religions to be really cool and super interesting. Also, occult magic and stuff like that is super interesting.</p>\n\n<p>I went to a magic shop today with some friends where they sold crystals to heal you or give you luck and shit, they had tarot cards, books on witch stuff and the occult. I found it super interesting and cool and the shop keep was really interesting to listen to and talk about it. However, I don&#39;t believe in it all. I don&#39;t think tarot cards can tell the future and witches don&#39;t exist. Yet, it&#39;s just super cool to learn about. I wanted to buy some stuff there but I needed to save.</p>\n\n<p>With religion, I don&#39;t believe in any of it but I look at it the same way I look at folk tales from different cultures and learning about different philosophies. I love learning about tales from different cultures, I love learning about their history and I treat religions as the same.</p>\n\n<p>From small tribal cults to global religion, the stories that are told in them are just really neat stories that kind of just got out of hand and people began taking them seriously. There was this video Wendigoon made and it was a Christianity Iceberg and I highly recommend it, it proves that Christianity as a story and lore is super interesting and that&#39;s the same for all religions for me. Its not real, just cool stories. Eastern philosophy and religion are super cool to learn about too. It&#39;s literally the same feeling I get learning about video game or movie lores. </p>\n\n<p>Plus, religion does have good life lessons in them that are true. I just don&#39;t think it&#39;s real. Sorry, I&#39;m rambling but does anyone think like me here?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/nrmf3h/does_anyone_else_not_believe_in_religion_or/",
  "subreddit": "TooAfraidToAsk",
  "id": "nrmf3h",
  "is_self": true,
  "media": null,
  "is_video": false
}