{
  "author": "Atari_buzzk1LL",
  "original_created_utc": 1631728615,
  "title": "Unpopular Opinion: ETH Maxis are becoming more insufferable than BTC Maxis with their denial of serious ETH problems.",
  "created_utc": 1631745112,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like there just things that are undeniably terrible about how ETH works and rather than accept that these are problems, ETH Maxis use non-arguements like &quot;but it&#39;s the most used ecosystem chain&quot; or just make excuses as to why their chain is so damn outdated that it can&#39;t keep up.</p>\n\n<p>Some undeniably bad things Maxis need to accept as problems or at least a concern are:</p>\n\n<ul>\n<li><p>gas fees being anything more than $0.25 USD is not acceptable at ANY point in time if the point is to be better than banks.</p></li>\n<li><p>gas fees have made ETH DApps and NFTs practically unusable to the masses unless you&#39;re a millionaire or billionaire which was literally the opposite of who ETH was supposed to be for.</p></li>\n<li><p>needing layer 2, sharding and a bunch of other over complicated fixes (which now break its own white paper philosophy of simplicity) because your tech isn&#39;t designed to scale like other chains that already have built in layer 1 solutions, is not good.</p></li>\n<li><p>requiring all gas to be paid in ETH rather than having native tokens that you can pay gas for using the tokens you own makes absolutely no sense and it only beneficial to ETH holders rather than being beneficial to everyone using the chain.</p></li>\n<li><p>having it included in EIP-1559 that miners would literally have their pay cut by burning a large amount of ETH in blocks that they verify and are one of the only reasons the network can run, because the devs refuse to put a cap on or are too restless to simply wait until they converted to PoS where the block reward could be made smaller instead of burning most of it.</p></li>\n<li><p>Praising Vitalik as some God who is the sole reason ETH exists when in reality he was a just a smart 19 year old with a good idea and if it wasn&#39;t for people like Dr. Gavin Wood, Ethereum WOULD NOT exist.</p></li>\n<li><p>The DAO attack that to this day should make you question if code truly is law to the ETH Foundation or can you just make a new chain any time someone outsmarted you and things don&#39;t go your way?</p></li>\n<li><p>Transaction times are too damn slow in comparison to the competition (don&#39;t give me that &quot;but most used chain&quot; bull, other chains are handling what ETH used to handle and can complete transactions in a fraction of the time of what ETH could do when it had to handle those transaction amounts).</p></li>\n</ul>\n\n<p>These are all genuine problems that are pretty much all solved by other modern chains, but ETH Maxis (like BTC Maxis) act like just because ETH innovated the space 6 years ago you should still have to respect that they were the first to do what they do, which is the equivalent trying to convince people that you should still use dial up internet connection instead of high speed fibre simply because it came out first. It&#39;s one thing to be optimistic of what ETH could be someday, but right now the chain is a tangled mess that&#39;s almost unusable, that&#39;s needs to acknowledged and accepted.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/povb97/unpopular_opinion_eth_maxis_are_becoming_more/",
  "subreddit": "CryptoCurrency",
  "id": "povb97",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like there just things that are undeniably terrible about how ETH works and\nrather than accept that these are problems, ETH Maxis use non-arguements like\n\"but it's the most used ecosystem chain\" or just make excuses as to why their\nchain is so damn outdated that it can't keep up.\n\nSome undeniably…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETHの仕組みについては、紛れもなくひどいものがあるように思いますし\nETH Maxisは、これらの問題点を受け入れるのではなく、「しかし、最も使われているエコシステム・チェーン」のような非論拠を用いたり\nETH Maxisは、これらの問題を受け入れるのではなく、「しかし、それは最も使用されているエコシステム・チェーンである」というような非論拠を用いたり、あるいは、なぜ彼らのチェーンがとても古くてついていけないのかという\nETH Maxisは、これらの問題を受け入れるのではなく、「しかし、最も使われているエコシステム・チェーンだ」というような非論拠を用いたり、自分のチェーンがとても古くてついていけない理由を言い訳したりします。\n\nいくつかの紛れもない...",
      "title": "不人気な意見。ETH Maxisは、ETHの深刻な問題を否定することで、BTC Maxisよりも我慢できなくなってきている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像ETH的工作方式一样，有一些不可否认的糟糕之处。\n而ETH Maxis并没有接受这些问题，而是使用了一些非争论性的说法，如\n\"但它是最常用的生态系统链\"，或者只是找借口说为什么他们的\n链是如此该死的过时，以至于它无法跟上。\n\n一些不可否认的...",
      "title": "不受欢迎的意见。与BTC Maxis相比，ETH Maxis否认严重的ETH问题，变得更加令人难以忍受。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像ETH的工作方式一樣，有一些不可否認的糟糕之處。\n而ETH Maxis並沒有接受這些問題，而是使用了一些非爭論性的說法，如\n\"但它是最常用的生態系統鏈\"，或者只是找藉口說爲什麼他們的\n鏈是如此該死的過時，以至於它無法跟上。\n\n一些不可否認的...",
      "title": "不受歡迎的意見。與BTC Maxis相比，ETH Maxis否認嚴重的ETH問題，變得更加令人難以忍受。"
    }
  ]
}