{
  "author": "barbasol1099",
  "original_created_utc": 1656062133,
  "title": "What terms do historians use for non-indigenous, colonized peoples? For example, the Hakka and Hokkien peoples of Taiwan",
  "created_utc": 1656086260,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I struggled writing this question because I am so confused about the terminology. The groups that inspired this line of questioning were the Hakka and Hokkien peoples of Taiwan. They are ethnically Han Chinese, and generally immigrated to the island between the 17th and 19th century, and thus are certainly not indigenous. However, they were colonized and systematically discsriminated against by both the Japanese and, later, the waishengren Han Chinese that came with the KMT after the Chinese Civil War.&lt;/p&gt;\n\n&lt;p&gt;So, what terms do historians use to discuss groups in such a position?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/vjk7y4/what_terms_do_historians_use_for_nonindigenous/",
  "subreddit": "AskHistorians",
  "id": "vjk7y4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I struggled writing this question because I am so confused about the\nterminology. The groups that inspired this line of questioning were the Hakka\nand Hokkien peoples of Taiwan. They are ethnically Han Chinese, and generally\nimmigrated to the island between the 17th and 19th century, and thus…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問を書くのに苦労したのは、用語がとてもわかりにくいからです。\nを書くのに苦労しました。この質問のきっかけとなったのは、客家（はっか）族と福建（ほうきん）族です。\n台湾の客家人と福建人です。彼らは民族的には漢民族で、一般的には17世紀から19世紀にかけて台湾に移住してきた。\n17世紀から19世紀にかけて台湾に移住してきたため、...",
      "title": "歴史家は、非原住民である植民地化された人々をどのような言葉で表現するのでしょうか。例えば、台湾の客家人や福建人がそうです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在写这个问题时很费劲，因为我对这些术语感到非常困惑。\n术语。激发这个问题的群体是台湾的客家和福建人。\n和台湾的福建人。他们在种族上是汉族，一般是\n在17世纪和19世纪之间移民到岛上，因此...",
      "title": "历史学家对非本土的、被殖民的民族使用什么术语？例如，台湾的客家和福建人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在寫這個問題時很費勁，因爲我對這些術語感到非常困惑。\n術語。激發這個問題的羣體是臺灣的客家和福建人。\n和臺灣的福建人。他們在種族上是漢族，一般是\n在17世紀和19世紀之間移民到島上，因此...",
      "title": "歷史學家對非本土的、被殖民的民族使用什麼術語？例如，臺灣的客家和福建人"
    }
  ]
}