{
  "author": "awesomedan24",
  "the_new_excerpt": "In essence, don't be greedy but don't arbitrarily make investment decisions\nbased on Old Mcdonald Had a Farm.\n\nIf all your research and due dilligence tells you a company will see 1200%\ngrowth over the next few years, trust the data. Don't say \"Well, I really think\nthis company is gonna go to the…",
  "original_created_utc": 1613394805,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从本质上讲，不要贪婪，但不要随意做投资决策。\n基于《老麦当劳有个农场》。\n\n如果你所有的研究和尽职调查都告诉你，一家公司将看到1200%。\n未来几年的增长，相信数据。不要说 \"好吧，我真的认为\"。\n这家公司要去... ...",
      "title": "牛市赚钱，熊市赚钱，猪被宰，罗纳德-韦恩以800美元的价格卖掉了他在苹果公司10%的股份。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從本質上講，不要貪婪，但不要隨意做投資決策。\n基於《老麥當勞有個農場》。\n\n如果你所有的研究和盡職調查都告訴你，一家公司將看到1200%。\n未來幾年的增長，相信數據。不要說 \"好吧，我真的認爲\"。\n這家公司要去... ...",
      "title": "牛市賺錢，熊市賺錢，豬被宰，羅納德-韋恩以800美元的價格賣掉了他在蘋果公司10%的股份。"
    }
  ],
  "title": "Bulls make money, Bears make money, Pigs get slaughtered, and Ronald Wayne sold his 10% stake in Apple for $800",
  "created_utc": 1613398603,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In essence, don&#39;t be greedy but don&#39;t arbitrarily make investment decisions based on Old Mcdonald Had a Farm. </p>\n\n<p>If all your research and due dilligence tells you a company will see 1200% growth over the next few years, trust the data. Don&#39;t say &quot;Well, I really think this company is gonna go to the moon, but I already made 20%, I don&#39;t wanna be greedy.&quot; Making an arbitrary decision to sell and ignore your data is always a bad idea. </p>\n\n<p>If this is all your life savings, take your 20% sure, there are always unforeseen risks. But if this is money you can afford to lose, and you&#39;ve truly put in the work on your DD, don&#39;t second guess yourself out of fear. </p>\n\n<p>Don&#39;t be a pig but don&#39;t be Ronald Wayne.</p>\n</div><!-- SC_ON -->",
  "score": 10435,
  "permalink": "/r/stocks/comments/lkdf8u/bulls_make_money_bears_make_money_pigs_get/",
  "subreddit": "stocks",
  "id": "lkdf8u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624075
}