{
  "author": "catch22bro",
  "original_created_utc": 1638159995,
  "title": "Do not beat yourself up because you can only afford to invest a small amount. $60 or $600, in time, you will reap the reward.",
  "created_utc": 1638178251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do not get disheartened because you can only afford  to invest less than $500 in crypto. If you are patient enough, you will definitely gain profit. If the small amount you invested is significant for you, the gains will also immensely benefit you. </p>\n\n<p>You do not need to sell your house and put it in crypto. A smaller amount at first is ideal to understand this  space.  It gives you time to properly learn how this space and technology works, and understand the market. </p>\n\n<p>If you have put in some money, no matter how small it is, you belong to the tiny minority of early adopters.  Billions are yet to enter this space. And in time, if you are patient and keep DCAing, you will definitely make it. </p>\n\n<p>It&#39;s better to learn and invest in fewer cryptos than FMOing and chasing coins that are shilled heavily. All my gains came from this strategy. Hope we all make it big in five years.</p>\n</div><!-- SC_ON -->",
  "score": 334,
  "permalink": "/r/CryptoCurrency/comments/r4nddk/do_not_beat_yourself_up_because_you_can_only/",
  "subreddit": "CryptoCurrency",
  "id": "r4nddk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Do not get disheartened because you can only afford to invest less than $500 in\ncrypto. If you are patient enough, you will definitely gain profit. If the small\namount you invested is significant for you, the gains will also immensely\nbenefit you.\n\nYou do not need to sell your house and put it in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "500ドル以下の投資しかできないからといって、気を落とさないでください。\nしないでください。忍耐力があれば、必ず利益を得ることができます。少額の投資でも\n投資した金額が大きければ、その利益も非常に大きくなります。\n恩恵を受けることができます。\n\n家を売って、家の中に入れる必要はありません。",
      "title": "少額の投資しかできないからといって、自分を責めないでください。60ドルでも600ドルでも、時間が経てば必ず報われます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要因为你只能投资不到500美元而感到灰心。\n低碳货币。如果你有足够的耐心，你肯定会获得利润。如果你的小额\n你的投资金额对你来说是重要的，收益也将极大地\n使你受益。\n\n你不需要卖掉你的房子，把它放在...",
      "title": "不要因为你只能负担少量的投资而自责。60美元或600美元，假以时日，你将获得回报。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要因爲你只能投資不到500美元而感到灰心。\n低碳貨幣。如果你有足夠的耐心，你肯定會獲得利潤。如果你的小額\n你的投資金額對你來說是重要的，收益也將極大地\n使你受益。\n\n你不需要賣掉你的房子，把它放在...",
      "title": "不要因爲你只能負擔少量的投資而自責。60美元或600美元，假以時日，你將獲得回報。"
    }
  ]
}