{
  "author": "SteveJackson007",
  "the_new_excerpt": "These channels are starting to flourish, and while I’m all for increased\nparticipation by non-professionals, YOLO’ers, and all other amateurs, I think\nsome of them do more harm than good. It’s a lot like the flood of half-assed\nnutritional and fitness guys offering broscience on YT. These financial…",
  "original_created_utc": 1622329494,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらのチャンネルは繁栄し始めており、プロではない人やYOLOの人など、すべてのアマチュアの参加が増えることには賛成ですが\nプロではない人やYOLO'er、その他すべてのアマチュアの参加が増えることには賛成ですが、中には良いことよりも悪いこともあると思います。\nしかし、中には良いことよりも悪いことの方が多いと思います。巷に溢れている中途半端な\nYTでは、栄養学やフィットネスの専門家が氾濫しており、一般的な科学を提供しています。これらの金融...",
      "title": "館山のコンテンツ制作者が新しいチャンネルで、中途半端な株式投資分析をしているのを見かけることが多くなりました。私はこれを \"ブロベスティング \"と呼んでいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些渠道开始蓬勃发展，虽然我很赞成增加非专业人士、YOLO者和所有其他业余爱好者的参与。\n虽然我赞成增加非专业人员、YOLO'ers和所有其他业余人员的参与，但我认为\n但我认为其中一些渠道弊大于利。这就像大量的半吊子的\n营养和健身的人在YT上提供科学知识。这些金融...",
      "title": "我越来越多地看到YT内容创作者在新的频道上提供半懂不懂的股票投资分析。我称其为 \"兄弟投资\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些渠道開始蓬勃發展，雖然我很贊成增加非專業人士、YOLO者和所有其他業餘愛好者的參與。\n雖然我贊成增加非專業人員、YOLO'ers和所有其他業餘人員的參與，但我認爲\n但我認爲其中一些渠道弊大於利。這就像大量的半吊子的\n營養和健身的人在YT上提供科學知識。這些金融...",
      "title": "我越來越多地看到YT內容創作者在新的頻道上提供半懂不懂的股票投資分析。我稱其爲 \"兄弟投資\"。"
    }
  ],
  "title": "More and more I see YT content creators with new channels offering half-informed stock investment analysis. I call it “brovesting.”",
  "created_utc": 1622342686,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>These channels are starting to flourish, and while I’m all for increased participation by non-professionals, YOLO’ers, and all other amateurs, I think some of them do more harm than good. It’s a lot like the flood of half-assed nutritional and fitness guys offering broscience on YT. These financial bros I’m not sure are a great help to educating folks new to this movement.</p>\n</div><!-- SC_ON -->",
  "score": 3046,
  "permalink": "/r/stocks/comments/nnyfep/more_and_more_i_see_yt_content_creators_with_new/",
  "subreddit": "stocks",
  "id": "nnyfep",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300251
}