{
  "author": "tghGaz",
  "the_new_excerpt": "Saw this quote on another sub and it made me laugh. Vitalik Buterin is the\ncreator of Ethereum - the most popular cryptocurrency making use of smart\ncontracts and the second most popular cryptocurrency overall. Vitalik's creation\nof Ethereum was one of the most significant turning points for the…",
  "original_created_utc": 1614250107,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在另一个子上看到这句话，让我笑了。Vitalik Buterin是\nEthereum的创造者--最流行的加密货币，使用智能\n合约，也是整体上第二受欢迎的加密货币。Vitalik的创作\n的Ethereum是最重要的转折点之一，对...",
      "title": "\"'货币互联网'[比特币]每笔交易的成本不应该是0.05美元。这有点荒谬。\" - Vitalik Buterin（2014年）"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在另一個子上看到這句話，讓我笑了。Vitalik Buterin是\nEthereum的創造者--最流行的加密貨幣，使用智能\n合約，也是整體上第二受歡迎的加密貨幣。Vitalik的創作\n的Ethereum是最重要的轉折點之一，對...",
      "title": "\"'貨幣互聯網'[比特幣]每筆交易的成本不應該是0.05美元。這有點荒謬。\" - Vitalik Buterin（2014年）"
    }
  ],
  "title": "\"The 'Internet Of Money' [Bitcoin] should not cost $0.05 per transaction. It's kind of absurd.\" - Vitalik Buterin (2014)",
  "created_utc": 1614275322,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Saw this quote on another sub and it made me laugh.  Vitalik Buterin is the creator of Ethereum - the most popular cryptocurrency making use of smart contracts and the second most popular cryptocurrency overall.  Vitalik&#39;s creation of Ethereum was one of the most significant turning points for the cryptosphere and opened the door to a whole wealth of new use cases.  It&#39;s popularity and use has grown ever since its release.  It seems however to be suffering an unfortunate side effect of that success.  Recently the high levels of activity on Ethereum have caused transaction fees to rocket to over $20 on average.  Many users are reporting being hit with fees several orders of magnitude higher.  Ethereum 2.0 is in the works to rectify this however no clear launch date has been set.  What are your thoughts, can Ethereum&#39;s popularity weather these high fees?  It still seems to be going from strength to strength despite them.  Or will projects increasingly move to lower cost alternatives.  If so will they move back to ETH when Ethereum 2.0 is launched?</p>\n\n<p><a href=\"https://preview.redd.it/zr68blomolj61.png?width=618&amp;format=png&amp;auto=webp&amp;s=b546a98d00af478e587bfc9c6a93a7203a51403b\">https://preview.redd.it/zr68blomolj61.png?width=618&amp;format=png&amp;auto=webp&amp;s=b546a98d00af478e587bfc9c6a93a7203a51403b</a></p>\n</div><!-- SC_ON -->",
  "score": 349,
  "permalink": "/r/CryptoCurrency/comments/ls3wgs/the_internet_of_money_bitcoin_should_not_cost_005/",
  "subreddit": "CryptoCurrency",
  "id": "ls3wgs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937733633
}