{
  "author": "Many_Scratch2269",
  "original_created_utc": 1631152220,
  "title": "Coinbase should not give in against the SEC. It is a private company. The SEC is going too far with their bias towards banks.",
  "created_utc": 1631172649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you didn&#39;t know yet, the SEC wants to sue Coinbase for offering people a 4% interest rate on their stablecoins. This is should not be the SEC&#39;s business whether or not Coinbase offers more interest rate than the banks since they are a private company.</p>\n\n<p>This is just another way for the SEC to save the banks from competition. Banks currently offer terrible interest rates compared to Crypto. This is just basic capitalism. If you can&#39;t offer decent interest rates compared to your competitors, you deserve to lose out on customers. Yet they are trying to save their ass by directly attacking Coinbase.</p>\n\n<p>The average bank interest rate for interest checking accounts in the United States is <strong>0.03%.</strong> Coinbase plans to offer their customers 4%. The banks know that Coinbase is giving them a run for their money. Them trying to sue Coinbase is pure stupid. In my opinion, as a private company, Coinbase holds the right to offer their customers whatever interest rate they want.</p>\n\n<p>The feds should not oppress a private company from their rights to provide their customers financial service. They are going after Coinbase since they know they can&#39;t do shit against Cryptocurrencies that offer high interest rates directly. Coinbase should definitely fight this in the court. The SEC has no business trying to sue a private company for offering tough competition.</p>\n\n<p>TLDR: Coinbase is a private company and holds the right to offer whatever interest they want. The SEC is being total bullshit and just wants to save the banks from the competition from Crypto.</p>\n\n<p>EDIT:  Apparently, Coinbase is no longer a private company unfortunately. However my point is  still there. The SEC doesn&#39;t have any business attacking a company that is just offering financial service superior to their competitors  (Banks). It&#39;s publicly traded, but still a private company as it is not owned by the government.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/pko5kb/coinbase_should_not_give_in_against_the_sec_it_is/",
  "subreddit": "CryptoCurrency",
  "id": "pko5kb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you didn't know yet, the SEC wants to sue Coinbase for offering people a 4%\ninterest rate on their stablecoins. This is should not be the SEC's business\nwhether or not Coinbase offers more interest rate than the banks since they are\na private company.\n\nThis is just another way for the SEC to save…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まだご存じない方もいるかもしれませんが、SECは、安定したコインに4％の金利を提供したとして、Coinbaseを訴えようとしています。\nの金利を提供したとして、Coinbaseを訴えようとしています。これはSECの仕事ではありません。\nCoinbaseが銀行よりも高い金利を提供しているかどうかは、SECが関知すべきことではありませんが、彼らは民間企業です。\n私企業ですから。\n\nこれは、SECが銀行を救うための別の方法に過ぎません。",
      "title": "コインベースは、SECに対して屈してはいけない。それは民間企業だからです。SECは銀行への偏見で行き過ぎている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你还不知道，美国证券交易委员会想要起诉Coinbase，因为它向人们提供4%的\n利率的稳定币。这不应该是SEC的事情\n无论Coinbase是否提供比银行更高的利率，因为他们是\n一个私人公司。\n\n这只是美国证券交易委员会的另一种方式，以节省...",
      "title": "Coinbase不应该对SEC让步。它是一家私人公司。美国证券交易委员会对银行的偏见走得太远了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你還不知道，美國證券交易委員會想要起訴Coinbase，因爲它向人們提供4%的\n利率的穩定幣。這不應該是SEC的事情\n無論Coinbase是否提供比銀行更高的利率，因爲他們是\n一個私人公司。\n\n這只是美國證券交易委員會的另一種方式，以節省...",
      "title": "Coinbase不應該對SEC讓步。它是一傢俬人公司。美國證券交易委員會對銀行的偏見走得太遠了。"
    }
  ]
}