{
  "author": "Toen6",
  "original_created_utc": 1641736348,
  "title": "I just read a medieval text in which a man claims the human soul does not exist and that there is no afterlife. How common was such atheistic thought in the Middle-Ages?",
  "created_utc": 1641742779,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So for a internship I am working through a Latin text from the 11th century Low Countries: &lt;em&gt;De Diversitate Temporum&lt;/em&gt; (&amp;#39;On several things of this time&amp;#39;) by Alpertus of Metz.&lt;/p&gt;\n\n&lt;p&gt;In it, Alpertus tells of a man in an inn who supposedly said the following:&amp;quot;...that the human soul amounts to nothing and that it leaves the body completely with the last breath to disappear into the air&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;My Latin is pretty bad and the above sentence is my own translation of a Dutch translation of the Latin original. I will post the Latin at the bottom of this post.&lt;/p&gt;\n\n&lt;p&gt;Still, the writer condemns the man for saying this but it did make me wonder how common this denial of the continued existence of the human soul after the expiration of the body was during this time. I certainly had never heard of it in a medieval context.&lt;/p&gt;\n\n&lt;p&gt;The Latin:&lt;br/&gt;\n&amp;quot;Audivi fidelem nostrum teferentem, quendam ex his miseris, cum in tabernis vino estuans derisisset sanctum hominem, ad hanc etiam miserabilem vocem erupisse, animam hominis nihil esse et in ultimo flatu in auras penitus evanescere&amp;quot;. from:  Alperti Mettensis, &lt;em&gt;De diversitate temporum&lt;/em&gt;, ed. A. Hulshof (Amsterdam 1916), p. 24-25.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 132,
  "permalink": "/r/AskHistorians/comments/rzs5hn/i_just_read_a_medieval_text_in_which_a_man_claims/",
  "subreddit": "AskHistorians",
  "id": "rzs5hn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So for a internship I am working through a Latin text from the 11th century Low\nCountries: De Diversitate Temporum ('On several things of this time') by\nAlpertus of Metz.\n\nIn it, Alpertus tells of a man in an inn who supposedly said the\nfollowing:\"...that the human soul amounts to nothing and that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、私はインターンシップで11世紀のラテン語のテキストに取り組んでいます。\n国です。De Diversitate Temporum（「この時代のいくつかの事柄について」）。\nメッツのアルペルトゥス。\n\nその中で、アルペルトゥスは、ある宿屋でこんなことを言ったとされる男のことを語っています。\n人間の魂は無に等しいということ。",
      "title": "人間の魂は存在しない、死後の世界もないと主張する中世の文章を読んだところです。このような無神論的な思想は、中世ではどの程度一般的だったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，为了实习，我正在研究11世纪的拉丁文本《低地》。\n国家。De Diversitate Temporum（\"关于这个时代的几件事\"），作者是\n梅斯的阿尔佩尔图斯。\n\n在这本书中，Alpertus讲述了在一家旅馆里的一个人，据说他说了以下的话\n他说：\"......人类的灵魂一无是处，而且......。",
      "title": "我刚刚读了一篇中世纪的文章，其中一个人声称人类的灵魂并不存在，也没有来世。这种无神论思想在中世纪有多普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，爲了實習，我正在研究11世紀的拉丁文本《低地》。\n國家。De Diversitate Temporum（\"關於這個時代的幾件事\"），作者是\n梅斯的阿爾佩爾圖斯。\n\n在這本書中，Alpertus講述了在一家旅館裏的一個人，據說他說了以下的話\n他說：\"......人類的靈魂一無是處，而且......。",
      "title": "我剛剛讀了一篇中世紀的文章，其中一個人聲稱人類的靈魂並不存在，也沒有來世。這種無神論思想在中世紀有多普遍？"
    }
  ]
}