{
  "author": "learner4f",
  "the_new_excerpt": "In 2020, all of Cathie Wood's ETFs were hugely successful. Now in 2021, Cathie\nhas revealed a brand new ETF called \"ARK Space Exploration\", whose ticker symbol\nis ARKX. Here is video summarizing the N-1A filing of ARKX - I hope it will be\nuseful to everyone:\n\n( NOTE: sorry, mods don't allow youtube…",
  "original_created_utc": 1611246222,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在2020年，Cathie Wood的所有ETF都取得了巨大的成功。现在在2021年，Cathie\n披露了一只名为 \"ARK太空探索 \"的全新ETF，其股票代码为\n是ARKX。这里是总结ARKX的N-1A申请的视频--我希望它能\n对大家有用。\n\n( 注：抱歉，版主不允许Youtube... )",
      "title": "ARK太空探索ETF(ARKX)N-1A申报材料"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在2020年，Cathie Wood的所有ETF都取得了巨大的成功。現在在2021年，Cathie\n披露了一隻名爲 \"ARK太空探索 \"的全新ETF，其股票代碼爲\n是ARKX。這裏是總結ARKX的N-1A申請的視頻--我希望它能\n對大家有用。\n\n( 注：抱歉，版主不允許Youtube... )",
      "title": "ARK太空探索ETF(ARKX)N-1A申報材料"
    }
  ],
  "title": "ARK Space Exploration ETF (ARKX) N-1A Filing",
  "created_utc": 1611288329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 2020, all of Cathie Wood&#39;s ETFs were hugely successful. Now in 2021, Cathie has revealed a brand new ETF called &quot;ARK Space Exploration&quot;, whose ticker symbol is ARKX. Here is video summarizing the N-1A filing of ARKX - I hope it will be useful to everyone:</p>\n\n<p>( NOTE: sorry, mods don&#39;t allow youtube link. You can search for &quot;ARK Space Exploration ETF (ARKX) N-1A Filing&quot; on youtube and it should show up) </p>\n\n<p>ARKX will go public some time after 3/29/2021.</p>\n\n<p>Theme: Invest in companies that are engaged in leading, enabling, or benefitting from products/services that occur beyond the surface of the Earth.</p>\n\n<p>ARKX has 4 investment categories: Orbital Aerospace, Suborbital Aerospace, Enabling Technologies, and Aerospace Beneficiary.</p>\n\n<p>Risk Factors:</p>\n\n<ol>\n<li>Concentrate (&gt;25% of the fund’s assets) in industrial sector and information technology sector.</li>\n<li>Currency risk: a strong US dollar will negatively affect the fund due to the non-US stock holding in the fund.</li>\n<li>Aerospace and Defense industry is heavily depending on US government’s demand and other government’s demand around the world.</li>\n<li>Newly offered fund. No performance history is available.</li>\n</ol>\n\n<p>Upside:</p>\n\n<ol>\n<li>Credibility: Cathie Wood and the success of ARK Invest ETFs (ARKK, ARKQ, …)</li>\n<li>Promising of incredible return</li>\n<li>The fund’s portfolio holdings are publicly disseminated daily.</li>\n</ol>\n\n<p>(see the video for more in-depth details)</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/investing/comments/l21phu/ark_space_exploration_etf_arkx_n1a_filing/",
  "subreddit": "investing",
  "id": "l21phu",
  "is_self": true,
  "media": null,
  "is_video": false
}