{
  "author": "Rare-Elderberry-7898",
  "original_created_utc": 1653055635,
  "title": "Why do smokers get so offended when you say that you don't date smokers?",
  "created_utc": 1653062385,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have in my dating profile that I don&amp;#39;t date smokers because I&amp;#39;m severe asthmatic. Even just smelling it on people&amp;#39;s clothes can give me an asthma attack. But guys who smoke don&amp;#39;t read my profile and  message me anyway.  I used to try to be nice if they sent a nice message and at least give them a reason why I wasn&amp;#39;t interested but I got so many nasty, hateful messages that I don&amp;#39;t even do that anymore. Smokers have to know that a lot of people don&amp;#39;t like that habit so why get so angry if someone nicely tells them that they don&amp;#39;t like it? Genuinely curious.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 548,
  "permalink": "/r/TooAfraidToAsk/comments/utx176/why_do_smokers_get_so_offended_when_you_say_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "utx176",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have in my dating profile that I don't date smokers because I'm severe\nasthmatic. Even just smelling it on people's clothes can give me an asthma\nattack. But guys who smoke don't read my profile and message me anyway. I used\nto try to be nice if they sent a nice message and at least give them a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は重度の喘息患者なので、喫煙者とはデートしないとデートプロフィールに書いています。\n喘息持ちだからです。人の服についたタバコの匂いを嗅ぐだけでも、喘息の発作を起こすことがあるんです。\n喘息の発作が出るんだ。でも、タバコを吸う人は私のプロフィールを読まないで、とにかくメッセージを送ってくるの。以前は\n以前は、相手が素敵なメッセージを送ってきたら、親切にしようと思って、少なくとも...",
      "title": "なんで喫煙者は「喫煙者とは付き合わない」って言うと怒るんだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在我的约会资料中说我不和吸烟者约会，因为我有严重的\n哮喘病人。即使只是闻到人们衣服上的烟味，也会让我哮喘发作。\n发作。但那些吸烟的人不看我的资料，还是给我发信息。我曾经\n如果他们发来好的信息，我就会试着对他们好一点，至少给他们一个...",
      "title": "为什么当你说你不和吸烟者约会时，吸烟者会如此反感？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在我的約會資料中說我不和吸菸者約會，因爲我有嚴重的\n哮喘病人。即使只是聞到人們衣服上的煙味，也會讓我哮喘發作。\n發作。但那些吸菸的人不看我的資料，還是給我發信息。我曾經\n如果他們發來好的信息，我就會試着對他們好一點，至少給他們一個...",
      "title": "爲什麼當你說你不和吸菸者約會時，吸菸者會如此反感？"
    }
  ]
}