{
  "author": "lydiaj02",
  "original_created_utc": 1642614544,
  "title": "About to be a first time cat owner what should I know?",
  "created_utc": 1642697827,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m going today to pick up my little fur angel, Inky. She’s all black and got these beautiful yellow eyes. I’m super excited to have her and I know the basics since I have family who own cats. But I was wondering what are some things I should know or tips or tricks, any advice is welcome!&lt;/p&gt;\n\n&lt;p&gt;Edit: thank you so much everybody for your answers! A lot of the medical stuff such as spaying, vaccines and microchipping have already been done since she is coming to me at over a year old from a rescue. I’ll take all this advice and use it as needed, much appreciated!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/s7vvfz/about_to_be_a_first_time_cat_owner_what_should_i/",
  "subreddit": "NoStupidQuestions",
  "id": "s7vvfz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m going today to pick up my little fur angel, Inky. She’s all black and got\nthese beautiful yellow eyes. I’m super excited to have her and I know the basics\nsince I have family who own cats. But I was wondering what are some things I\nshould know or tips or tricks, any advice is welcome!\n\nEdit:…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は毛皮の天使、インキーを引き取りに行くんだ。彼女は真っ黒で\nこの美しい黄色の目。この子を飼うのがとても楽しみで、基本的なことは知っています。\n猫を飼っている家族がいるので。でも、何かいい方法はないかと考えています。\n知っておくべきこと、コツなど、どんなアドバイスでも大歓迎です。\n\n編集：...",
      "title": "これから初めて猫を飼うのですが......何を知ればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天要去接我的小毛球天使，Inky。她是全黑的，有\n这双美丽的黄眼睛。我对拥有她超级兴奋，而且我知道基本情况\n因为我的家人都养猫。但我想知道有哪些事情是我\n应该知道的事情，或者提示或技巧，欢迎提供任何建议!\n\n编辑：...",
      "title": "即将成为第一次养猫的人，我应该知道什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天要去接我的小毛球天使，Inky。她是全黑的，有\n這雙美麗的黃眼睛。我對擁有她超級興奮，而且我知道基本情況\n因爲我的家人都養貓。但我想知道有哪些事情是我\n應該知道的事情，或者提示或技巧，歡迎提供任何建議!\n\n編輯：...",
      "title": "即將成爲第一次養貓的人，我應該知道什麼？"
    }
  ]
}