{
  "author": "Qu4rko",
  "the_new_excerpt": "The name Bitcoin isn't used anymore because no one can afford 81 trillion\ndollars for a coin. Satoshis are becoming expensive too, there are talks to\nsplit every Satoshi in 8 Nakamotos for further convenience for consumers. This\nhas been discussed by the core developers for 3 years, but no consensus…",
  "original_created_utc": 1620518907,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインという名前が使われなくなったのは、81兆円ものお金を出せる人がいないからです。\nコインに81兆円も払えないからです。サトシも高価になりつつあります。\nサトシを8ナカモトに分割して、消費者の利便性を高めようという話もあります。これは\n3年前からコア開発者の間で議論されていますが、コンセンサスは得られていません...。",
      "title": "2030年、暗号は確実に私たちの生活を変えていますが、それは誰も予想しなかった方法です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币这个名字已经不再使用了，因为没有人能够负担得起81万亿的\n美元的硬币。中本聪也变得很贵，有人在讨论\n把每个中本聪分成8个中本聪，以进一步方便消费者。这一点\n核心开发人员已经讨论了3年，但没有达成共识......",
      "title": "现在是2030年，加密货币肯定已经改变了我们的生活；只是以一种没有人预期的方式。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣這個名字已經不再使用了，因爲沒有人能夠負擔得起81萬億的\n美元的硬幣。中本聰也變得很貴，有人在討論\n把每個中本聰分成8箇中本聰，以進一步方便消費者。這一點\n核心開發人員已經討論了3年，但沒有達成共識......",
      "title": "現在是2030年，加密貨幣肯定已經改變了我們的生活；只是以一種沒有人預期的方式。"
    }
  ],
  "title": "It's the year 2030 and crypto has definitely changed our lives; just in a way no one expected.",
  "created_utc": 1620531208,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The name Bitcoin isn&#39;t used anymore because no one can afford 81 trillion dollars for a coin. Satoshis are becoming expensive too, there are talks to split every Satoshi in 8 Nakamotos for further convenience for consumers. This has been discussed by the core developers for 3 years, but no consensus has been reached yet.</p>\n\n<p>Ethereum has taken over the world with their last rollout Skyn3t. It turns out all those gas fees were used to build robot assembly-lines in the Arctic. Vitalik has revealed to be a cyborg sent from the future to enslave humanity. Humans who purchased ETH are filthy rich, though.</p>\n\n<p>The Resistance movement has rallied behind XMR. It&#39;s so damn private, they can&#39;t even find other cells to coordinate.</p>\n\n<p>LINK is using its self-consciousness to update in real time Sergei Nazarov&#39;s geolocation, so you can go and tell him how he has betrayed you yet again.</p>\n\n<p>Civil war has ravaged the USA and split the country in two.  The new formed country has adopted DOGE as their official currency. Elon Musk has proclaimed himself as Techno DogeKing of the Solar System.</p>\n\n<p>NANO has become so fast it has reached faster than light transaction speeds and quantum-leaped itself out of existence. The devs are working on a solution to slow down transactions without success.</p>\n\n<p>Cardano has published 741 papers, 700 of them about how good is to publish a lot of papers. Smart Contracts in mainnet expected next month. Charles is doing AMAs on Youtube every 15 minutes.</p>\n\n<p>Binance Smart Chain has been fomo-bought by Warren Buffet, who is still denying blockchain but bought the first project that an intern mentioned in the coffee room. God knows what they’re plotting in this world governed by machines but everyone agrees they’re up to no good.</p>\n\n<p>Tether has opened their vault at last. Every 1 USDT is pegged to a cap of Nuka-Cola. This has made USDT the first stablecoin to experience a +1000% valuation.</p>\n</div><!-- SC_ON -->",
  "score": 3628,
  "permalink": "/r/CryptoCurrency/comments/n81zf4/its_the_year_2030_and_crypto_has_definitely/",
  "subreddit": "CryptoCurrency",
  "id": "n81zf4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990898
}