{
  "author": "pandatits",
  "original_created_utc": 1636897229,
  "title": "I cant stop adding new coins to my portoflio",
  "created_utc": 1636921838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>since the start of my involvement with crypto i have been getting excited with projects that have a good roadmap, strong teams behind them and a long term vision that i embrace.</p>\n\n<p>&#x200B;</p>\n\n<p>The past year though, i keep learning about new projects and i like to throw some cash in but but portoflio allocation has been messed up and i like most of the projects to sell. </p>\n\n<p>&#x200B;</p>\n\n<p>Ofcourse whenever i sell, that coin will moon just like my AVAX did this week. </p>\n\n<p>This is my coin allocation, any thoughts?  i&#39;m also afraid that in the end of the cycle many of these will be hugely down and id prefer to have more sats </p>\n\n<p>should i just remove initial capital and leave them there even if its very little amount?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8ae5nfhbekz71.png?width=441&amp;format=png&amp;auto=webp&amp;s=77b87ba905bd120c31a57ad4c9e79fce577e6aeb\">https://preview.redd.it/8ae5nfhbekz71.png?width=441&amp;format=png&amp;auto=webp&amp;s=77b87ba905bd120c31a57ad4c9e79fce577e6aeb</a></p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/qtq1cf/i_cant_stop_adding_new_coins_to_my_portoflio/",
  "subreddit": "CryptoCurrency",
  "id": "qtq1cf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "since the start of my involvement with crypto i have been getting excited with\nprojects that have a good roadmap, strong teams behind them and a long term\nvision that i embrace.\n\n\n\nThe past year though, i keep learning about new projects and i like to throw\nsome cash in but but portoflio allocation…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号に関わり始めた頃から、私はPythonに興奮していました。\nロードマップがしっかりしていて、強力なチームがついていて、長期的なビジョンを持っているプロジェクトには興奮します。\n長期的なビジョンを持ったプロジェクトに興奮してきました。\n\n\n\nしかし、この1年は新しいプロジェクトについて学び続け、多少の資金を投入したいと思っています。\n現金を投入したいのですが、しかし、ポートフォリオの配分が...。",
      "title": "ポルトフォリオに新しいコインを追加するのをやめられない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从我开始接触加密货币以来，我一直对那些有良好路线图的项目感到兴奋。\n那些有良好的路线图，背后有强大的团队，并且有长期的\n的项目感到兴奋，这些项目有良好的路线图，背后有强大的团队，并且有我所接受的长期愿景。\n\n\n\n在过去的一年里，我不断地了解新的项目，我喜欢投入一些现金。\n一些现金，但在门头沟分配......",
      "title": "我无法停止向我的portoflio添加新的硬币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從我開始接觸加密貨幣以來，我一直對那些有良好路線圖的項目感到興奮。\n那些有良好的路線圖，背後有強大的團隊，並且有長期的\n的項目感到興奮，這些項目有良好的路線圖，背後有強大的團隊，並且有我所接受的長期願景。\n\n\n\n在過去的一年裏，我不斷地瞭解新的項目，我喜歡投入一些現金。\n一些現金，但在門頭溝分配......",
      "title": "我無法停止向我的portoflio添加新的硬幣"
    }
  ]
}