{
  "author": "TheRealGoochman",
  "original_created_utc": 1628004182,
  "title": "Before food allergies became known/detected, would people believe a person to be poisoned if they are something they were allergic to?",
  "created_utc": 1628077040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If so, we’re there any documented historical events where this mistake took place?  In the way of “it is very strange that this person was poisoned, it is very possible it could have been an allergy/medical”, and if so - how big of an impact could those small bits of knowledge could of had on history?</p>\n\n<p>Thanks a ton!  Love this sub</p>\n</div><!-- SC_ON -->",
  "score": 2191,
  "permalink": "/r/AskHistorians/comments/ox5p0v/before_food_allergies_became_knowndetected_would/",
  "subreddit": "AskHistorians",
  "id": "ox5p0v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If so, we’re there any documented historical events where this mistake took\nplace? In the way of “it is very strange that this person was poisoned, it is\nvery possible it could have been an allergy/medical”, and if so - how big of an\nimpact could those small bits of knowledge could of had on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしそうなら、このような間違いが起こった歴史的な出来事が記録されていますか？\nあるのでしょうか？この人が毒殺されたのは非常に不思議だが、アレルギーや病気の可能性もある」というように。\nアレルギーや病気の可能性もある」という意味で、もしそうだとしたら、その小さな断片がどのくらいの影響を与えるのか。\nもしそうだとしたら、そのような小さな知識がどれだけ大きな影響を与えることができるのでしょうか？",
      "title": "食物アレルギーが知られるようになる前は、アレルギーのあるものを食べると毒を盛られたと思われたのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果是这样，我们是否有任何有记载的历史事件发生过这种错误？\n发生的历史事件？在 \"这个人被毒死是非常奇怪的，它是\n非常有可能是过敏/医疗\"，如果是这样的话--有多大的影响？\n如果是这样的话，这些小的知识点能对......产生多大的影响？",
      "title": "在食物过敏被认识/检测出来之前，如果一个人是对什么东西过敏，人们会相信他是被毒死的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果是這樣，我們是否有任何有記載的歷史事件發生過這種錯誤？\n發生的歷史事件？在 \"這個人被毒死是非常奇怪的，它是\n非常有可能是過敏/醫療\"，如果是這樣的話--有多大的影響？\n如果是這樣的話，這些小的知識點能對......產生多大的影響？",
      "title": "在食物過敏被認識/檢測出來之前，如果一個人是對什麼東西過敏，人們會相信他是被毒死的嗎？"
    }
  ]
}