{
  "author": "Imnotashitpost",
  "original_created_utc": 1642248710,
  "title": "How do I convince my husband that him pissing on the floor is not ok and he needs to be responsible for it?",
  "created_utc": 1642260612,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t know how standing and peeing works but I guess sometimes my husband gets a little piss on the floor when he does. I’ve pointed it out a few times, asking him to either watch where he’s peeing or clean it up. Everytime he says ok but I still see pee on the floor almost everytime I go to the bathroom. I’ve asked him to clean it after seeing the mess myself but he’ll insist there’s no way that’s his piss on the floor. I he thinks it’s water from washing his hands. But when I go wipe up the spot it’s always yellowish. Our floor is darker so it’s hard to tell but I assure you it’s piss and it’s always just in front of the toilet. If it was water from hand washing it would be on other spots of the floor too.&lt;/p&gt;\n\n&lt;p&gt;I’m so tired of basically stepping on pee when I use the toilet. What am I supposed to do? I feel like I’m going crazy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/s4j1xv/how_do_i_convince_my_husband_that_him_pissing_on/",
  "subreddit": "NoStupidQuestions",
  "id": "s4j1xv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I don’t know how standing and peeing works but I guess sometimes my husband gets\na little piss on the floor when he does. I’ve pointed it out a few times, asking\nhim to either watch where he’s peeing or clean it up. Everytime he says ok but I\nstill see pee on the floor almost everytime I go to the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "立ちションがどのように行われるのか分かりませんが、主人が時々しているようです。\nをすると、床に小便がかかる。何度かそれを指摘し、お願いしたことがあります。\nおしっこをする場所に注意するか、きれいにするように言っています。毎回、彼はオーケーと言いますが、私は\nというのも、私がトイレに行くたびに、床におしっこが落ちているのを見るからです。",
      "title": "夫が床に小便をするのは良くないことで、責任を持つ必要があると、どうすれば説得できますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道站着撒尿的效果如何，但我想有时我的丈夫在撒尿的时候会有一点尿在地上。\n在地板上撒了一点尿。我已经指出过几次，要求他要么注意自己的小便位置，要么清理干净。\n他要么注意他尿尿的地方，要么把它清理干净。每次他都说好，但我\n但我几乎每次去厕所都能看到地板上的尿液。",
      "title": "我如何说服我的丈夫，他在地板上撒尿是不对的，他需要对此负责？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道站着撒尿的效果如何，但我想有時我的丈夫在撒尿的時候會有一點尿在地上。\n在地板上撒了一點尿。我已經指出過幾次，要求他要麼注意自己的小便位置，要麼清理乾淨。\n他要麼注意他尿尿的地方，要麼把它清理乾淨。每次他都說好，但我\n但我幾乎每次去廁所都能看到地板上的尿液。",
      "title": "我如何說服我的丈夫，他在地板上撒尿是不對的，他需要對此負責？"
    }
  ]
}