{
  "author": "Sir_Sesh_Lord",
  "the_new_excerpt": "I want to elaborate that I am referring to the effect it has on young children.\nIn reference to it's \"challenges\" and the promotion of unhealthy/unrealistic\nexpectations, which we as a society are trying to eliminate. Particularly it's\nother \"challenges\" that has unfortunately lead to the death of…",
  "original_created_utc": 1619696150,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が言いたいのは、幼い子供たちに与える影響についてです。\nその「挑戦」と、不健全で非現実的な期待を助長することについては\n私たちが社会的に排除しようとしている不健全で非現実的な期待を助長するものです。特に、それは\n他の \"課題 \"は、不幸にも...の死をもたらしました。",
      "title": "TikTokは非常に危険だと思う人はいませんか？幼い子供たちへの影響は信じられないほどの毒であり、社会の退行を先導しているのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想详细说明一下，我指的是它对年轻儿童的影响。\n指的是它的 \"挑战 \"和对不健康/不现实的期望的促进。\n的期望，而我们作为一个社会正在努力消除这种期望。特别是它的\n其他的 \"挑战\"，不幸地导致了......的死亡。",
      "title": "还有人认为TikTok是非常危险的吗？它对年轻儿童的影响是令人难以置信的毒害，并且正在引领社会的倒退？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想詳細說明一下，我指的是它對年輕兒童的影響。\n指的是它的 \"挑戰 \"和對不健康/不現實的期望的促進。\n的期望，而我們作爲一個社會正在努力消除這種期望。特別是它的\n其他的 \"挑戰\"，不幸地導致了......的死亡。",
      "title": "還有人認爲TikTok是非常危險的嗎？它對年輕兒童的影響是令人難以置信的毒害，並且正在引領社會的倒退？"
    }
  ],
  "title": "Does anyone else think TikTok is extremely dangerous? It's influences on young children is unbelievably poisonous, and is leading the charge to the regression of society?",
  "created_utc": 1619717119,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I want to elaborate that I am referring to the effect it has on young children. In reference to it&#39;s &quot;challenges&quot;  and the promotion of unhealthy/unrealistic expectations, which we as a society are trying to eliminate. Particularly it&#39;s other &quot;challenges&quot; that has unfortunately lead to the death of some.</p>\n\n<p>It&#39;s main issue is is vast reach, speed and grasp upon young audiences, clearly not prepared, to be exposed to such content content, which is their target market.</p>\n\n<p><em>It&#39;s the current captain of this regressive ship, which left long ago.</em></p>\n\n<p>I am not referring to time wasting, because hell, the amount of time I spend on Reddit, I&#39;d be a hypocrite aha</p>\n\n<p><em>Edit-</em> With technology becoming more and more accessible, it&#39;s clear to see, the age of which it is obtained has also drastically reduced. Which this platform,  as a good business would, capitalises on. This however doesn&#39;t excuse the danger it poses.  So I absolutely agree with this stance on technology and age determents.</p>\n\n<p><em>Edit 2-</em> I am not trying to sound like I&#39;m in my old age, and kids these days need to play outside. I come from a very personal position which I have experience in the effects it has on children, some of which has triggered attempts on their own lives. Again, the platform itself cannot be blamed solely, it&#39;s up to people to moderate what their children can access. But you cannot truly stop children getting access to the internet, it&#39;s everywhere and anywhere.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/TooAfraidToAsk/comments/n12ebj/does_anyone_else_think_tiktok_is_extremely/",
  "subreddit": "TooAfraidToAsk",
  "id": "n12ebj",
  "is_self": true,
  "media": null,
  "is_video": false
}