{
  "author": "loyota876",
  "original_created_utc": 1660896084,
  "title": "Did people really go to the opera nude in 19th century Russia?",
  "created_utc": 1660907427,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m in the middle of reading War and Peace and just encountered a passage that was really perplexing. Several of the major characters are at an opera in Moscow and Tolstoy keeps describing how one of the female characters in the audience is nude. First he says she was &amp;quot;completely undressed&amp;quot; and then later he says &amp;quot;her bosom was completely bare.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I must be misunderstanding. Surely women in circa 1810 Russia didn&amp;#39;t get undressed as they watched the opera?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/ws85zm/did_people_really_go_to_the_opera_nude_in_19th/",
  "subreddit": "AskHistorians",
  "id": "ws85zm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm in the middle of reading War and Peace and just encountered a passage that\nwas really perplexing. Several of the major characters are at an opera in Moscow\nand Tolstoy keeps describing how one of the female characters in the audience is\nnude. First he says she was \"completely undressed\" and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、『戦争と平和』を読んでいる途中なのですが、ある一節に出会ってしまいました。\nを読んでいる最中なのだが、実に不可解な一節に出会った。主要な登場人物の何人かが、モスクワのオペラに出演しているのですが\nトルストイは、観客の一人の女性が裸であることを描写し続ける。\n裸である。最初に「完全に服を脱いでいた」と言い、そして...。",
      "title": "19世紀のロシアで、人々は本当にヌードでオペラを観に行ったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在读《战争与和平》，刚刚遇到一段话，非常令人困惑。\n真的很令人困惑。几个主要人物在莫斯科的一场歌剧中\n托尔斯泰一直在描述观众席上的一个女性角色是如何\n裸体。首先，他说她 \"完全没有穿衣服\"，然后...",
      "title": "在19世纪的俄罗斯，人们真的去看裸体歌剧吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在讀《戰爭與和平》，剛剛遇到一段話，非常令人困惑。\n真的很令人困惑。幾個主要人物在莫斯科的一場歌劇中\n托爾斯泰一直在描述觀衆席上的一個女性角色是如何\n裸體。首先，他說她 \"完全沒有穿衣服\"，然後...",
      "title": "在19世紀的俄羅斯，人們真的去看裸體歌劇嗎？"
    }
  ]
}