{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Tuesday, March 30, 2021\n\nThe broader market finished lower following another volatile session, but\ninterestingly, many individual stocks that were beaten down in recent weeks\nsurged. Market participants continue to digest the sudden unwinding in stocks by\na large hedge fund and…",
  "original_created_utc": 1617135859,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年3月30日，星期二。\n\n大盘在再次波动后收盘下跌，但\n有意思的是，最近几周很多被打压的个股\n飙升。市场参与者继续消化股票的突然解套，由\n一家大型对冲基金和...",
      "title": "以下是2021年3月30日（星期二）的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年3月30日，星期二。\n\n大盤在再次波動後收盤下跌，但\n有意思的是，最近幾周很多被打壓的個股\n飆升。市場參與者繼續消化股票的突然解套，由\n一家大型對沖基金和...",
      "title": "以下是2021年3月30日（星期二）的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, March 30, 2021",
  "created_utc": 1617140570,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Tuesday, March 30, 2021</strong></p>\n\n<p>The broader market finished lower following another volatile session, but interestingly, many individual stocks that were beaten down in recent weeks surged. Market participants continue to digest the sudden unwinding in stocks by a large hedge fund and an elevated Treasury yield.</p>\n\n<p>Yesterday, Bloomberg News reported that Archegos Capital Management, managed by Bill Hwang, the ex-head of Tiger Management’s family office and a so-called “Tiger cub” (the name Wall Street gave to protégés of legendary fund manager Julian Robertson), was forced to sell more than $20 billion worth of stocks following a margin call. Hwang was heavily invested in Chinese tech stocks and American media conglomerates Discovery (DISC) and ViacomCBS (VIAC).  Nomura (NMR) and Credit Suisse (CS) warned that their earnings might take a “significant hit” following Archegos Capital’s margin call, with the stock of both banks falling double-digits. A margin call happens when a leveraged account drops below an agreed level. The broker will then require the client to add funds to the account. If it can&#39;t, the broker will dump the client&#39;s shares and liquidate its holdings to make up the shortfall.</p>\n\n<p>Despite the fear stemming from Archegos’ margin call, new data shows encouraging signs that the economy is recovering.  In 2021, cyclical, energy, financial, and reopening stocks - the under-performers of 2020 - have strongly outperformed tech and high growth stocks, underscoring the sector rotation taking place. Moreover, last week’s unemployment report was a pandemic-low, a sign the labor market is improving as the economy gradually reopens and the vaccine continues to be distributed. Looking ahead, the March jobs report is set to be released Friday. The report is estimated<a href=\"https://finance.yahoo.com/news/march-jobs-report-consumer-confidence-what-to-know-in-the-week-ahead-160859015.html\"> to show the economy created a whopping 630,00 jobs</a> in March — the most since October 2019 before the coronavirus pandemic.</p>\n\n<p>However, concerns from market participants remained centered on the pace of economic recovery. With the recent passage of more stimulus and the Federal Reserve’s commitment to maintaining accommodative policies in place for the foreseeable future may cause a rapid spike in inflation. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The benchmark 10-year Treasury yield remains at elevated levels, 1.731% at the time of writing.</li>\n<li>ARK Investment, managed by star-manager Cathie Wood, launched a space-themed ETF today. More than $196 million in shares were exchanged as of noon in New York, according to Bloomberg data. Check out the list of holdings <a href=\"https://www.thestreet.com/etffocus/market-intelligence/arkx-full-list-holdings-ark-space-exploration-etf\">here </a></li>\n<li>Spotify (SPOT) said on Tuesday it has purchased Betty Labs, the company behind sports-focused social audio app Locker Room, to accelerate its move into live audio.</li>\n<li>DraftKings (DKNG) acquired Vegas Sports Information Network Inc., a multi-platform broadcast and content company providing sports betting news, analysis and data. VSiN, which operates out of Las Vegas, develops, produces, and distributes up to 18-plus hours of live linear sports betting content each day in addition to its sport-themed 24/7 stream. DraftKings has been extremely active lately signing agreements with major sports leagues and acquiring smaller companies. </li>\n<li>NIO has agreed to partner with German retailer Metro AG to construct charging and battery swap stations in malls of Metro China. </li>\n<li><strong>**Please note that current stock price was written in the morning premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>AbbVie (ABBV) target raised by SVB Leerink from $140 to $144 at Outperform. Stock currently around $107</li>\n<li>Digital Turbine (APPS) target raised by Maxim Group from $85 to $111 at Buy. Stock currently around $71</li>\n<li>Lamar Advertising (LAMR) target raised by Morgan Stanley (MS) from $95 to $105 at Overweight. Stock currently around $92</li>\n<li>L Brands (LB) target raised by Morgan Stanley (MS) from $68 to $73 at Overweight. Stock currently around $60</li>\n<li>Silvergate Capital (SI) target raised by Cannaccord Genuity from $90 to $150. Stock currently around $120</li>\n<li>Target (TGT) target raised by Stifel Nicolaus from $220 to $230 at Buy. Stock currently around $198</li>\n<li>Truist Financial (TFC) target raised by Morgan Stanley (MS) from $65 to $68 Equal-Weight, Stock currently around $57</li>\n<li>Dave &amp; Busters (PLAY) target downgraded by Wells Fargo to $33. Stock currently around $47 with earnings tomorrow after-hours</li>\n</ul>\n\n<p>“Whether we&#39;re talking about socks or stocks, I like buying quality merchandise when it is marked down.” - Warren Buffet</p>\n</div><!-- SC_ON -->",
  "score": 518,
  "permalink": "/r/stocks/comments/mgp4mf/here_is_a_market_recap_for_today_tuesday_march_30/",
  "subreddit": "stocks",
  "id": "mgp4mf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142667
}