{
  "author": "worldofoysters",
  "original_created_utc": 1658857797,
  "title": "Did America's upper class men really 'dodge the draft' for the Vietnam war, en masse?",
  "created_utc": 1658912998,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a very common trope that those shipped off to Vietnam were the poor (and often Black) Americans while anyone with means found a way to evade the draft? How true is this? I know that there were ways of getting out of it, was it utterly pervasive or has it been hyped up beyond proportionality as part of the narrative of the war being unjust and unfair?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/w8q80k/did_americas_upper_class_men_really_dodge_the/",
  "subreddit": "AskHistorians",
  "id": "w8q80k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's a very common trope that those shipped off to Vietnam were the poor (and\noften Black) Americans while anyone with means found a way to evade the draft?\nHow true is this? I know that there were ways of getting out of it, was it\nutterly pervasive or has it been hyped up beyond proportionality as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ベトナムに出荷されたのは、貧しい人々であったというのは、ごく一般的な話である（と\nその一方で、裕福な人は徴兵を免れる方法を見つけていた。\nこれは本当なのでしょうか？徴兵から逃れる方法があったことは知っています。\nそれとも、比例しないほど誇張されて...？",
      "title": "アメリカの上流階級の男性は、本当にベトナム戦争に「徴兵逃れ」して、集団で参加したのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个非常普遍的说法，即那些被运往越南的人都是穷人（和）。\n往往是黑人）的美国人，而任何有能力的人都能找到办法逃避征兵？\n这种说法的真实性如何？我知道有一些方法可以逃避，但这是否是\n彻底的普遍性，还是被夸大了，超出了相称性，因为......。",
      "title": "美国的上层阶级男子真的集体 \"躲避 \"越南战争的征兵吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個非常普遍的說法，即那些被運往越南的人都是窮人（和）。\n往往是黑人）的美國人，而任何有能力的人都能找到辦法逃避徵兵？\n這種說法的真實性如何？我知道有一些方法可以逃避，但這是否是\n徹底的普遍性，還是被誇大了，超出了相稱性，因爲......。",
      "title": "美國的上層階級男子真的集體 \"躲避 \"越南戰爭的徵兵嗎？"
    }
  ]
}