{
  "author": "Chooky47",
  "original_created_utc": 1630011563,
  "title": "Just so everyone is aware, this isn’t a ‘dip’. It’s just the market moving normally. Don’t listen to predictions because as we all know, *we don’t know what it’s going to do next*.",
  "created_utc": 1630028501,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seems to be a lot of chatter today about “taking advantage of this dip”. Some people are saying now is your chance before the bull run, others are calling this a crash precursor. </p>\n\n<p>The fact of the matter is, it’s just the market moving normally. It’s been trending up for two weeks and it’s taking a breather. </p>\n\n<p>Zoom out on the charts and you’ll see there’s not too much to analyse, it looks logical enough, so let’s just keep doing what we’ve been doing and keep our pants on. </p>\n\n<p>At the end of the day, absolutely <strong>no one</strong> knows what the market is going to do, it’s best not to try predict anything. </p>\n\n<p>Ride the wave my fellow crypto adopters!</p>\n</div><!-- SC_ON -->",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/pc8grg/just_so_everyone_is_aware_this_isnt_a_dip_its/",
  "subreddit": "CryptoCurrency",
  "id": "pc8grg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seems to be a lot of chatter today about “taking advantage of this dip”. Some\npeople are saying now is your chance before the bull run, others are calling\nthis a crash precursor.\n\nThe fact of the matter is, it’s just the market moving normally. It’s been\ntrending up for two weeks and it’s taking a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は、「このディップを利用しよう」という話が多いようです。ある人は\nブルランの前のチャンスだと言う人もいれば、暴落の前兆だと言う人もいる。\nこれは暴落の前兆だと言う人もいる。\n\n実際のところ、これは市場が普通に動いているだけなのだ。2週間前から\n2週間前から上昇傾向にあり、今は...",
      "title": "皆さんに知っておいていただきたいのですが、これは「ディップ」ではありません。市場が普通に動いているだけなのです。予測に耳を傾けてはいけません。なぜなら、皆が知っているように、*次に何をするかわからない*からです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天似乎有很多关于 \"利用这次下跌的机会 \"的讨论。有些人\n有些人说现在是你在牛市运行前的机会，其他人则称这是一次危机。\n这是个崩溃的前兆。\n\n事实是，这只是市场的正常运动。它已经\n两周来一直呈上升趋势，它正在采取一种...",
      "title": "只是为了让大家知道，这不是一个 \"下跌\"。这只是市场的正常运行。不要听信预测，因为我们都知道，*我们不知道它接下来会做什么*。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天似乎有很多關於 \"利用這次下跌的機會 \"的討論。有些人\n有些人說現在是你在牛市運行前的機會，其他人則稱這是一次危機。\n這是個崩潰的前兆。\n\n事實是，這只是市場的正常運動。它已經\n兩週來一直呈上升趨勢，它正在採取一種...",
      "title": "只是爲了讓大家知道，這不是一個 \"下跌\"。這只是市場的正常運行。不要聽信預測，因爲我們都知道，*我們不知道它接下來會做什麼*。"
    }
  ]
}