{
  "author": "berriesandcreamxo",
  "original_created_utc": 1641245012,
  "title": "22F &amp; Black. I do NOT support Black Lives Matter as a movement but only as a statement. Is there something wrong with me?",
  "created_utc": 1641257375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;As a black woman, I hate Black Lives Matter as a movement, but love it as a simple message. I do not believe funding or time is being spent to actually further the ENTIRE black community but only make a very small percentage richer.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Im tired of the organizations saying their goal is to help black people but will give us half-assed effort when Lord knows we need in depth reform and assistance.&lt;/p&gt;\n\n&lt;p&gt;I’m tired of hearing, “Hey guys just go to college, pick what sounds fun, and you’ll be good” while they should say “Pick what makes money so your family has a damn chance m’fcker”.&lt;/p&gt;\n\n&lt;p&gt;I’m tired of them throwing top d$llar festivals while the people who live in these neighborhoods that they throw things in never received any MONEY or GOOD advice on how to move up the social ladder.&lt;/p&gt;\n\n&lt;p&gt;They keep pushing this image of black excellence meaning that you spend excessive amounts of money on STUFF or degrees one doesn’t need, while Lord please tell these people to SAVE every dollar they have for their futures to either invest, start a business, or have some chance at retirement.&lt;/p&gt;\n\n&lt;p&gt;Why aren’t they instilling the importance of HOMES WITHOUT FATHERS AS NOT NORMAL. Why aren’t they instilling the importance of FAMILY. Why aren’t they instilling the importance COMMUNITY VALUES. EDUCATION. EFFICIENT FINANCIAL LITERACY. NUTRITION. COMMON CURTESY.&lt;/p&gt;\n\n&lt;p&gt;But they will spend all day educating people on the history of black culture as though its AS important as SURVIVAL and SOCIAL MOBILITY.&lt;/p&gt;\n\n&lt;p&gt;HAVE YOU SEEN THE SIZE OF THE HOMES OF THE BLM LEADERS BUT THEIR FOOT SOLIDERS ARE STRUGGLING TO FEED THEMSELVES. EXCUSE ME??? WHAT A DAMN SHAME. THAT IS NOT CHARITY NOR ADVOCACY.&lt;/p&gt;\n\n&lt;p&gt;[AND I believe the “foundation” has begun to lobby for who donates the MOST— and it was mostly &lt;em&gt;white&lt;/em&gt; donors, most likely due to the white population having more access to funds on average.(Could this mean that whatever the demographic of majority donors are may be “washing” the real message of BLM?— aka the leaders of the foundation do whatever the majority says to do)]&lt;/p&gt;\n\n&lt;p&gt;Do BLM? Yes, but this organization DOES NOT help black people actually MOVE UPWARDS.&lt;/p&gt;\n\n&lt;p&gt;Donate to the local Boys and Girls Club or just……………give money to people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 212,
  "permalink": "/r/TooAfraidToAsk/comments/rvcfi4/22f_black_i_do_not_support_black_lives_matter_as/",
  "subreddit": "TooAfraidToAsk",
  "id": "rvcfi4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a black woman, I hate Black Lives Matter as a movement, but love it as a\nsimple message. I do not believe funding or time is being spent to actually\nfurther the ENTIRE black community but only make a very small percentage richer.\n\nIm tired of the organizations saying their goal is to help black…",
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为一名黑人妇女，我讨厌 \"黑人的生活 \"这一运动，但喜欢它作为一个\n简单的信息。我不相信资金或时间被花在真正的\n我不相信资金或时间被用来真正促进整个黑人社区的发展，而只是让一小部分人更富有。\n\n我厌倦了那些说他们的目标是帮助黑人的组织。",
      "title": "22F &amp; 黑人。我不支持 \"黑人的生活 \"这一运动，而只是作为一种声明。我有什么不对吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一名黑人婦女，我討厭 \"黑人的生活 \"這一運動，但喜歡它作爲一個\n簡單的信息。我不相信資金或時間被花在真正的\n我不相信資金或時間被用來真正促進整個黑人社區的發展，而只是讓一小部分人更富有。\n\n我厭倦了那些說他們的目標是幫助黑人的組織。",
      "title": "22F &amp; 黑人。我不支持 \"黑人的生活 \"這一運動，而只是作爲一種聲明。我有什麼不對嗎？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "黒人女性として、私は運動としての「ブラック・ライブズ・マター」は嫌いですが、この運動は大好きです。\nシンプルなメッセージです。私は、資金や時間が実際に費やされているとは思っていません。\n黒人の社会全体が豊かになるのではなく、ごく一部の人が豊かになるだけです。\n\n黒人を助けることが目的だと言っている団体にはうんざりしています。",
      "title": "22F &amp; Blackです。私はBlack Lives Matterを運動としてではなく、声明として支持しています。何か問題があるのでしょうか？"
    }
  ]
}