{
  "author": "kwalitykontrol",
  "the_new_excerpt": "I got into the market last year post Covid around May or June. Since then it has\nbeen an absolute rollercoaster trying to pick stocks. I was up 100% on multiple\nstocks including Tesla, Carvana, Square, Fiverr. I didn't sell because you're\nsupposed to hold for the long term I heard, only for those…",
  "original_created_utc": 1620324294,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "去年の5月か6月頃にポスト・コビットとして市場に参入しました。それ以来、銘柄選びには\nそれ以来、銘柄選びはまさにジェットコースターのようでした。私は、Tesla、Carvana、Square、Fiverrなど、複数の銘柄で\nテスラ、カーバナ、スクエア、Fiverrなどの複数の銘柄で100％の上昇をしました。私が売らなかったのは、あなたが\n私が聞いたところによると、長期的に保有することになっているので売らなかったのですが、その場合に限っては・・・。",
      "title": "今日は持っている株を全部売りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在去年5月或6月左右进入了Covid之后的市场。从那时起，它一直\n挑选股票的过程绝对是一场过山车。我曾在多只\n包括特斯拉、Carvana、Square、Fiverr。我没有卖出，因为你是\n我没有卖出，因为我听说应该长期持有，只是为了那些...",
      "title": "我今天卖掉了我拥有的所有股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在去年5月或6月左右進入了Covid之後的市場。從那時起，它一直\n挑選股票的過程絕對是一場過山車。我曾在多隻\n包括特斯拉、Carvana、Square、Fiverr。我沒有賣出，因爲你是\n我沒有賣出，因爲我聽說應該長期持有，只是爲了那些...",
      "title": "我今天賣掉了我擁有的所有股票。"
    }
  ],
  "title": "I sold every share I own today.",
  "created_utc": 1620329236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got into the market last year post Covid around May or June. Since then it has been an absolute rollercoaster trying to pick stocks. I was up 100% on multiple stocks including Tesla, Carvana, Square, Fiverr. I didn&#39;t sell because you&#39;re supposed to hold for the long term I heard, only for those stocks and others over many months to drop 30% - 80% or more. I bought some new stocks in February only for them to then drop 30% or more in a matter of months. I have spent months this year and last inside on beautiful days going cross eyed staring at charts trying to figure out what stock to buy, what to sell, why this stock is going up, why this stock is going down. As we speak I&#39;m sitting inside on a beautiful day writing this. I have admitted to myself I don&#39;t understand stocks. I don&#39;t understand businesses. I have reached a point where I stopped caring about losing money. That&#39;s a dangerous road I&#39;m sure. With the amount of stocks I&#39;ve bought and sold, I don&#39;t know if I&#39;m up or down.</p>\n\n<p>Evidence I don&#39;t understand stocks is that today Twitter is worth less than it was in 2013 when it IPO&#39;d. One of the most popular social media apps in the entire world I would have assumed would be worth something. Apparently not. It may seem I&#39;m impatient or have a short term horizon for the market, but if I bought Twitter in 2013, I would have wasted 8 years of my life holding it.</p>\n\n<p>PLTR backed by Peter Thiel and signing multi-million dollar contracts week after week, well the bottom just fell out. While it will probably go back up, I don&#39;t understand when and why it would. If a company with that much growth potential can&#39;t go up, what chance does anything else have.</p>\n\n<p>10 months ago I bought DKNG at $25 and sold a few months later for about $50. Today it&#39;s worth a little more than was 10 months ago. I&#39;m glad I got out when I did.</p>\n\n<p>So, I am buying the S&amp;P. It&#39;s the boring thing to do, but I will be able to sleep at night and not spend everyday inside staring at a screen. I should have done it much sooner. Rant over.</p>\n</div><!-- SC_ON -->",
  "score": 3885,
  "permalink": "/r/investing/comments/n6dh3d/i_sold_every_share_i_own_today/",
  "subreddit": "investing",
  "id": "n6dh3d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994593
}