{
  "author": "cobbes",
  "original_created_utc": 1627390602,
  "title": "Several resources and websites to help you DYOR",
  "created_utc": 1627407042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here&#39;s a compilation of several different websites I utilize to help DYOR. I figured it would be worthwhile to share them with everyone here to [hopefully] make things just a little bit easier when it comes to researching more about crypto. If there&#39;s any other websites that you recommend, let me know and I can include them within the list! I&#39;ve posted again in case anyone has missed the initial post. I hope it helps!</p>\n\n<p>TradingView:</p>\n\n<p>A cloud based charting and social networking platform. You can search out several different crypto traders and see whether people are feeling more bearish or bullish as a result. You can either create your own price targets, or find out others&#39; price targets. <a href=\"https://www.tradingview.com/\">https://www.tradingview.com/</a></p>\n\n<p>CoinGecko:</p>\n\n<p>A website and an app that allows you to stay on top of crypto markets. You can use it to view live price changes for thousands of different cryptos, set price alerts, rate and view ratings for a coin, build lists, view trending news, etc. It also has a reward system that hasn&#39;t been fully developed yet, but could be utilized in the future for NFT&#39;s, their own crypto, etc. <a href=\"https://www.coingecko.com/en\">https://www.coingecko.com/en</a></p>\n\n<p>CoinMarketCap:</p>\n\n<p>Similar to CoinGecko, allows you to stay up to date on crypto markets. Also allows you to see thousands of cryptocurrencies, with the capability to look at brand new crypto&#39;s being released, as well as current trending crypto&#39;s as well. Has an &#39;earn&#39; section which allows you to perform quizzes to end with a chance at getting airdropped crypto, as well as a rewards section which allows you to collect diamonds which will be used at a later time as well. <a href=\"https://coinmarketcap.com/\">https://coinmarketcap.com/</a></p>\n\n<p>CoinMarketCal:</p>\n\n<p>This website shows all upcoming events and future releases regarding a certain Cryptocurrency. Allows you to see what&#39;s being released by which cryptocurrency, and gives you an opportunity to buy ahead in anticipation for price increases as a result of upcoming events. <a href=\"https://coinmarketcal.com/en/\">https://coinmarketcal.com/en/</a></p>\n\n<p>Blocktivity:</p>\n\n<p>It&#39;s utilized as a good metric to compare coins based on their adoption. <a href=\"https://blocktivity.info\">https://blocktivity.info</a></p>\n\n<p>MultiCoinCharts:</p>\n\n<p>A website that allows you to view multiple different coins at once. It&#39;s a great resource to utilize if you often watch various coins at the same time, or need to often look between different coins at a high frequency. <a href=\"https://www.multicoincharts.com/\">https://www.multicoincharts.com/</a></p>\n\n<p>Glassnode:</p>\n\n<p>Allows you to unchain market indicators for Bitcoin and Ethereum. You’ll be able to see stats like exchange info volume for them. <a href=\"https://glassnode.com/\">https://glassnode.com/</a></p>\n\n<p>Fear and Greed:</p>\n\n<p>Allows you to take a look at the crypto fear and greed index to have an idea how the people are feeling in general about crypto right now, and historical values over the past months as well. Good way to gauge buying and selling opportunities. <a href=\"https://alternative.me/crypto/fear-and-greed-index/\">https://alternative.me/crypto/fear-and-greed-index/</a></p>\n\n<p>CryptoQuant:</p>\n\n<p>Allows you to view the amount of bitcoin being transferred to and from exchange wallets to understand investors&#39; behaviors. Allows you to better understand what people are currently doing within the markets. <a href=\"https://cryptoquant.com/overview/btc-exchange-flows\">https://cryptoquant.com/overview/btc-exchange-flows</a></p>\n\n<p>Alt Season Index: </p>\n\n<p>This website is used as an indicator to see how the altcoins are performing in comparison to Bitcoin. It has a generalized score rating to determine whether we are in Altcoin season (over 75 being Altcoin season), or Bitcoin season (under 25 being Bitcoin season). We are currently sitting at 32 right now. <a href=\"https://www.blockchaincenter.net/altcoin-season-index/\">https://www.blockchaincenter.net/altcoin-season-index/</a></p>\n\n<p>CoinDance:</p>\n\n<p>A site more comprised of data that allows you to see the numbers for things such as hash rates, fees, mining breakdowns, network nodes and more. Further, you can view statistics based on country to determine how adoption is going based on their trends and news. <a href=\"https://coin.dance/\">https://coin.dance/</a></p>\n\n<p>-TheCoinPerspective:</p>\n\n<p>Allows you to view certain things such as current market caps, speculative market caps, total supplies and maximum supplies to allow you to see how coins could progress or regress. \n<a href=\"https://thecoinperspective.com/\">https://thecoinperspective.com/</a></p>\n\n<p>CryptoPro:</p>\n\n<p>Tracks cryptocurrency prices, manage your portfolio, set price alerts, and read latest news with crypto portfolio tracker. Can be utilized as an app through the phone too. \n<a href=\"https://cryptopro.app/\">https://cryptopro.app/</a></p>\n\n<p>Messari: </p>\n\n<p>Provides reliable data and market intelligence with professional grade data, tools, and research.</p>\n\n<p><a href=\"https://messari.io/\">https://messari.io/</a></p>\n</div><!-- SC_ON -->",
  "score": 159,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/LKHZIYF-rPN7dUwfu2P7P3v6IqnEiWNsFWIkhikSk3M.jpg?auto=webp&s=e5324a9d08d881512d99202677c584ab639790c3",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/LKHZIYF-rPN7dUwfu2P7P3v6IqnEiWNsFWIkhikSk3M.jpg?width=108&crop=smart&auto=webp&s=2835305a5ef7e5c4436e64141d2ff32ad663641e",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/LKHZIYF-rPN7dUwfu2P7P3v6IqnEiWNsFWIkhikSk3M.jpg?width=216&crop=smart&auto=webp&s=87c8197d1775cb83218e15add65fa519071ee3ce",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/LKHZIYF-rPN7dUwfu2P7P3v6IqnEiWNsFWIkhikSk3M.jpg?width=320&crop=smart&auto=webp&s=caf6d7d42059846d956646e5e96e12ec47b18de5",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/LKHZIYF-rPN7dUwfu2P7P3v6IqnEiWNsFWIkhikSk3M.jpg?width=640&crop=smart&auto=webp&s=9346392e61baa606c7f2247b4c8d6c7b5e2d5547",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/LKHZIYF-rPN7dUwfu2P7P3v6IqnEiWNsFWIkhikSk3M.jpg?width=960&crop=smart&auto=webp&s=8208a8455fd26bdafd5f2e6b0c916e1ea0ad72b7",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/LKHZIYF-rPN7dUwfu2P7P3v6IqnEiWNsFWIkhikSk3M.jpg?width=1080&crop=smart&auto=webp&s=0d1579bef59f500f73fcb80de8bc938c88c5dca3",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "4zk5yMMTnAR0-yLPM644EgC-7y58GyfEMCTzEqP6c2Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/osmb00/several_resources_and_websites_to_help_you_dyor/",
  "subreddit": "CryptoCurrency",
  "id": "osmb00",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here's a compilation of several different websites I utilize to help DYOR. I\nfigured it would be worthwhile to share them with everyone here to [hopefully]\nmake things just a little bit easier when it comes to researching more about\ncrypto. If there's any other websites that you recommend, let me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここでは、私がDYORのために利用しているいくつかの異なるウェブサイトをまとめました。I\nこのサイトを皆さんと共有することは価値のあることだと思います。\n少しでも楽になるようにと考えました。\nと思っています。他におすすめのウェブサイトがあれば教えてください。",
      "title": "DYORに役立ついくつかのリソースとウェブサイト"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下是我利用的几个不同网站的汇编，以帮助DYOR。I\n我认为值得在这里与大家分享，以[希望]使事情变得更简单。\n让大家在研究更多关于\n币。如果你有任何其他网站推荐，让我...",
      "title": "有几个资源和网站可以帮助你DYOR"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是我利用的幾個不同網站的彙編，以幫助DYOR。I\n我認爲值得在這裏與大家分享，以[希望]使事情變得更簡單。\n讓大家在研究更多關於\n幣。如果你有任何其他網站推薦，讓我...",
      "title": "有幾個資源和網站可以幫助你DYOR"
    }
  ]
}