{
  "author": "qwerty5151",
  "the_new_excerpt": "There are numerous studies showing that in the long run, almost nobody beats the\nmarket, so investing in various index funds is generally the best strategy.\n\nWouldn't selling far OTM covered calls on index funds make it reasonably\nprobable to beat the market in most years?\n\nGranted, far OTM CCs…",
  "original_created_utc": 1619386445,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長期的に見て、市場に勝てる人はほとんどいないということを示す多くの研究があります。\nそのため、様々なインデックス・ファンドに投資することが一般的には最良の戦略となります。\n\nインデックス・ファンドのファーOTMカバード・コールを売れば、ほとんどの年で市場に勝てる可能性が高くなるのではないでしょうか？\nのカバード・コールを売れば、ほとんどの年で市場に勝てる可能性が高いのではないでしょうか？\n\n確かに、ファーOTMのCCは...",
      "title": "指数のカバードコールを売って市場に勝つ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有许多研究表明，从长远来看，几乎没有人能够战胜市场。\n因此，投资于各种指数基金通常是最好的策略。\n\n在指数基金上卖出远期OTM覆盖的看涨期权，难道不会使它在大多数年份有合理的可能性战胜市场吗？\n有可能在大多数年份战胜市场吗？\n\n当然，远端OTM CCs...",
      "title": "卖出指数的覆盖性看涨期权以战胜市场"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有許多研究表明，從長遠來看，幾乎沒有人能夠戰勝市場。\n因此，投資於各種指數基金通常是最好的策略。\n\n在指數基金上賣出遠期OTM覆蓋的看漲期權，難道不會使它在大多數年份有合理的可能性戰勝市場嗎？\n有可能在大多數年份戰勝市場嗎？\n\n當然，遠端OTM CCs...",
      "title": "賣出指數的覆蓋性看漲期權以戰勝市場"
    }
  ],
  "title": "Selling Covered Calls on Indexes to Beat the Market",
  "created_utc": 1619466881,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are numerous studies showing that in the long run, almost nobody beats the market, so investing in various index funds is generally the best strategy.</p>\n\n<p>Wouldn&#39;t selling far OTM covered calls on index funds make it reasonably probable to beat the market in most years?</p>\n\n<p>Granted, far OTM CCs provide a small premium, but it is still technically beating the market as long as you don&#39;t lose your shares. Even if you do, there is a good chance that the price dips back below the breakeven point at some point, especially if you time CCs with unsustainable spikes.</p>\n\n<p>For example, many indexes had a several week run recently that had at annualized return of over 100%. There is clearly no way that rate is sustainable, so selling CCs on a run like that seems like an attractive strategy. </p>\n\n<p>I realize the percentage return might be small, but once a position gets large enough (likely if you have most of your portfolio in index funds), this strategy can either provide some extra income or can be used as a DRIP to increase shares every month, week, etc.</p>\n\n<p>Now, there certainly are some risks to consider.  If you do lose your shares, you might have to pay short-term capital gains. However, you could always just close or roll the CCs. While this would be a loss, that might be attractive to offset any large short-terms gains you might already have. For example, I had huge gains in January and February. If my index CCs end up ITM, I can close them to offset short-term gains, while still holding my shares for long-term gains.</p>\n\n<p>The other risk of CCs is that you generally have to be willing to hold the shares until expiration, which doesn&#39;t matter for index funds since they are generally held long.</p>\n\n<p>Is there anything I&#39;m overlooking? I don&#39;t hear much about this strategy. Normally the advice is &quot;don&#39;t sell CCs on shares you don&#39;t want to lose,&quot; which is good advice, but seems overly restrictive.</p>\n\n<p>TL;DR</p>\n\n<p>Selling low-delta CCs on index funds seems like a great way to slightly beat the market. Are there any non-obvious risks with this strategy?</p>\n</div><!-- SC_ON -->",
  "score": 39,
  "permalink": "/r/stocks/comments/myi7i5/selling_covered_calls_on_indexes_to_beat_the/",
  "subreddit": "stocks",
  "id": "myi7i5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776215990
}