{
  "author": "Nossa30",
  "original_created_utc": 1636987401,
  "title": "The POWER of dollar cost averaging. Growing $300 to over $3500+ in a year with bitcoin.",
  "created_utc": 1637019243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So i told my mom she should invest in bitcoin. Me being the tech and finance savvy IT pro that I am, she thankfully believed everything I said without question. I already have alot of bitcoin as you can probably see from my earlier posts. </p>\n\n<p>I wanted to make it literally dummy simple easy. So i made a coinbase account for her. She started with a humble investment of about $300 a year ago. That&#39;s it. (Honestly It&#39;s literally the same strategy I used 5 years ago just without altcoins).</p>\n\n<p>The next day, I asked her if she was going to reinvest and she was not sure. So i said &quot;well why don&#39;t we just set up autopay for just $30 a week, EVERY week no exceptions.&quot; That way she won&#39;t even notice the money is gone. </p>\n\n<p>So that entire time from about a year ago, she was investing literally just $30 a week. All the way from its highs of $65,000, all the way to the $30K lows a while back. The account balance has grown from that $300 to just under $4,000. </p>\n\n<p>She was SHOCKED, blown away. She was slaving away for 10+ years at her job at 50 years old just to accumulate a $50K 401K. Here I was under 30 years old and I have more than DOUBLE what she has saved in her 401K. I think it&#39;s safe to say that she &quot;gets it&quot; now. </p>\n\n<p>TL:DR - <strong><em>Guys, understand the time value of money.</em></strong> That little $100 starter investment goes A LONG WAY when you have alot of time to wait AND you consistently invest. Time and consistency. That&#39;s literally all you need to get wealthy with bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/quhz7n/the_power_of_dollar_cost_averaging_growing_300_to/",
  "subreddit": "Bitcoin",
  "id": "quhz7n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So i told my mom she should invest in bitcoin. Me being the tech and finance\nsavvy IT pro that I am, she thankfully believed everything I said without\nquestion. I already have alot of bitcoin as you can probably see from my earlier\nposts.\n\nI wanted to make it literally dummy simple easy. So i made a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は、母にビットコインに投資するべきだと言いました。技術と金融に詳しいITプロである私は\nITに精通している私の言うことを、ありがたいことに何の疑いもなく信じてくれました。\n疑うことなく信じてくれました。これまでの私の投稿を見ていただければわかると思いますが、私はすでにたくさんのビットコインを持っています。\nしています。\n\n私はそれを文字通りダミーでシンプルに簡単にしたかったのです。そこで私が作ったのは...",
      "title": "ドルコスト平均法のPOWER ビットコインで300ドルを1年で3500ドル以上に成長させる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我告诉我妈妈她应该投资比特币。我是一个精通技术和金融\n我是一个精通技术和金融的IT专家，她很感激地相信了我说的一切，没有任何疑问\n疑问。我已经有很多比特币了，你可以从我之前的帖子中看到\n的帖子中可以看到。\n\n我想让它变得简单易行。所以我做了一个...",
      "title": "美元成本平均化的力量。用比特币在一年内将300美元增长到3500美元以上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我告訴我媽媽她應該投資比特幣。我是一個精通技術和金融\n我是一個精通技術和金融的IT專家，她很感激地相信了我說的一切，沒有任何疑問\n疑問。我已經有很多比特幣了，你可以從我之前的帖子中看到\n的帖子中可以看到。\n\n我想讓它變得簡單易行。所以我做了一個...",
      "title": "美元成本平均化的力量。用比特幣在一年內將300美元增長到3500美元以上。"
    }
  ]
}