{
  "author": "thefullmcnulty",
  "original_created_utc": 1633746715,
  "title": "Just drove by a handmade sign for papusas and stopped by the shop",
  "created_utc": 1633772147,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Turns out the 3 women running this little restaurant were all Salvadoran immigrants. I asked if any of them ever remitted money home (I had to bring it up) and they all said freely that they do every week. I got some weird looks for this question so I explained my interest in bitcoin and how El Salvador was a big deal for people in the space. </p>\n\n<p>At that point they understood where I was coming from, relaxed a bit, and the most talkative of the group mentioned they were all using Chivo now. She asked if I had heard of it. Of course I was excited, responded yes, and asked if they preferred Chivo to their previous way of remitting money. Again the most talkative of group said when she used to send $50 usd home each week through Western Union, it would cost her $8 in fees and would take days to arrive. She excitedly said now it’s free and instant for them and it’s very helpful to their families in El Salvador. At one point she said, “This is from Bukele’s bitcoin, so we like it.” which cracked me up. </p>\n\n<p>This happened in NW Oregon mind you. It was a serendipitous and surreal experience as someone who is deeply interested in the global bitcoin movement. Thought I’d share with the sub. </p>\n\n<p>The bitcoin network is effecting positive change and I heard about it firsthand today. Cheers to all the real bitcoiner’s. Also, the papusa was bangin.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/Bitcoin/comments/q4cg6m/just_drove_by_a_handmade_sign_for_papusas_and/",
  "subreddit": "Bitcoin",
  "id": "q4cg6m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Turns out the 3 women running this little restaurant were all Salvadoran\nimmigrants. I asked if any of them ever remitted money home (I had to bring it\nup) and they all said freely that they do every week. I got some weird looks for\nthis question so I explained my interest in bitcoin and how El…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この小さなレストランを経営していた3人の女性は、全員がサルバドールの\n移民であった。私は、彼女たちの中で送金をしたことがある人がいるかどうか尋ねた。\nと聞くと、彼女たちは皆、毎週送金していると答えた。この質問をすると変な目で見られたので\n私はビットコインに興味があることを説明し、どのようにエル...続きを読む",
      "title": "パパスの手作り看板の前を通りかかり、お店に立ち寄ったところ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "结果发现经营这家小餐馆的三个女人都是萨尔瓦多的\n移民。我问她们中是否有人向家里汇过钱（我不得不提出这个问题）。\n他们都自由地说，他们每周都汇钱。我因为这个问题得到了一些奇怪的眼神\n所以我解释了我对比特币的兴趣，以及El...",
      "title": "刚刚开车经过一个手工制作的木瓜饼的标志，并在店门口停下。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "結果發現經營這家小餐館的三個女人都是薩爾瓦多的\n移民。我問她們中是否有人向家裏匯過錢（我不得不提出這個問題）。\n他們都自由地說，他們每週都匯錢。我因爲這個問題得到了一些奇怪的眼神\n所以我解釋了我對比特幣的興趣，以及El...",
      "title": "剛剛開車經過一個手工製作的木瓜餅的標誌，並在店門口停下。"
    }
  ]
}