{
  "author": "katakakitty",
  "original_created_utc": 1658664096,
  "title": "If we can recognize that there are thin people who eat poorly and don't exercise, but don't gain weight, why can't we recognize that there are fat people who eat healthy and exercise, but can't lose weight?",
  "created_utc": 1658727756,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like everyone has met that one super thin person who eats like Shaggy and doesn&amp;#39;t exercise at least once in their lives. Obviously the metabolism of these thin people are really fast, or they have a medical condition/medication that makes it hard to gain weight.&lt;/p&gt;\n\n&lt;p&gt;Sooo, why is it so hard for people to apply that same logic to fat people? People assume that all fat people overeat and have sedentary lives.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/w6u1iy/if_we_can_recognize_that_there_are_thin_people/",
  "subreddit": "NoStupidQuestions",
  "id": "w6u1iy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel like everyone has met that one super thin person who eats like Shaggy and\ndoesn't exercise at least once in their lives. Obviously the metabolism of these\nthin people are really fast, or they have a medical condition/medication that\nmakes it hard to gain weight.\n\nSooo, why is it so hard for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが一度は出会ったことがあるような、シャギーみたいな食べっぷりの超痩せ型の人や\n運動していない人に会ったことがあると思います。明らかにそのような細い人の代謝は\nが速いか、あるいは病気や薬で運動不足になっているか。\n太りにくい体質なのでしょう。\n\nでは、なぜそんなに大変なのか...。",
      "title": "粗食で運動もしていないのに太らない痩せた人がいることを認識できるなら、健康的な食事をして運動もしているのに、痩せられない太った人がいることをなぜ認識できないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得每个人都遇到过一个超级瘦的人，他吃东西像沙吉和\n在他们的生活中至少有一次不运动。很明显，这些人的新陈代谢\n瘦人的新陈代谢非常快，或者他们有某种疾病/药物，使得他们很难减肥。\n使得他们很难增加体重。\n\n那么，为什么对...",
      "title": "如果我们能认识到有的瘦子吃得不好，不运动，但不发胖，为什么我们不能认识到有的胖子吃得健康、运动，但不能减肥？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得每個人都遇到過一個超級瘦的人，他喫東西像沙吉和\n在他們的生活中至少有一次不運動。很明顯，這些人的新陳代謝\n瘦人的新陳代謝非常快，或者他們有某種疾病/藥物，使得他們很難減肥。\n使得他們很難增加體重。\n\n那麼，爲什麼對...",
      "title": "如果我們能認識到有的瘦子喫得不好，不運動，但不發胖，爲什麼我們不能認識到有的胖子喫得健康、運動，但不能減肥？"
    }
  ]
}