{
  "author": "FiteMeHore",
  "original_created_utc": 1630956651,
  "title": "I’m not in this because of money tbh.",
  "created_utc": 1631029122,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like yes, it’d be nice as an “early adopter” that I could end up becoming rich off of this. But I don’t think it’s likely. I only have about, 6k in BTC so I doubt even if it explodes it will “set me for life”</p>\n\n<p>But I’m not holding Bitcoin because I want to be rich. At least, it’s not what motivates me completely.</p>\n\n<p>The system, time and time again, fucks the little guy. We went from slaves to serfs to indentured servitude to (wage) slaves. It doesn’t matter what era of history.</p>\n\n<p>The powers at be manipulate everything to send us to war to fight other poors over geopolitical / ideological dick measuring; they drink Champaign while we lose our jobs and houses. The young are growing up to inherit a world that wont be able to own a house or get ahead because of big time investors.</p>\n\n<p>Taking back centralized control of the banking system is how we win. It’s how we get true democracy and fairness. If we take back control of the money system, there’s no more bailouts. No more paper printing. No more manipulation.</p>\n\n<p>This is the real reason I invest. To fuck over the people who think me, and everyone I care about, are just ants to step on while they get more wealth.</p>\n\n<p>Whether it goes up or down- don’t let go of this one of a kind chance to completely flip the table to even the playing field for the rest of humanity from this point on.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/pj6m8s/im_not_in_this_because_of_money_tbh/",
  "subreddit": "Bitcoin",
  "id": "pj6m8s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like yes, it’d be nice as an “early adopter” that I could end up becoming rich\noff of this. But I don’t think it’s likely. I only have about, 6k in BTC so I\ndoubt even if it explodes it will “set me for life”\n\nBut I’m not holding Bitcoin because I want to be rich. At least, it’s not what\nmotivates…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうですね、「アーリーアダプター」としてお金持ちになるのもいいかもしれませんね。\nられるといいですね。でも、それはありえないと思います。私はBTCを6,000円ほどしか持っていません。\n爆発しても \"一生モノ \"になるとは思えません。\n\nでも、お金持ちになりたいからビットコインを持っているわけではありません。少なくとも、それが動機ではありません。\n動機にはなっていませんが...。",
      "title": "私はお金のためにこの仕事をしているわけではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比如是的，作为一个 \"早期采用者\"，我最终可能成为富人，这很好。\n变得富有。但我认为这不太可能。我只有大约6千块钱的BTC，所以我\n我怀疑即使它爆炸了，也会 \"让我终身受益\"\n\n但我持有比特币并不是因为我想成为富人。至少，这不是\n动机...",
      "title": "我不是因为钱而参与其中的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如是的，作爲一個 \"早期採用者\"，我最終可能成爲富人，這很好。\n變得富有。但我認爲這不太可能。我只有大約6千塊錢的BTC，所以我\n我懷疑即使它爆炸了，也會 \"讓我終身受益\"\n\n但我持有比特幣並不是因爲我想成爲富人。至少，這不是\n動機...",
      "title": "我不是因爲錢而參與其中的。"
    }
  ]
}