{
  "author": "__mahi__",
  "the_new_excerpt": "If you visit WSB for even a minute, you will quickly notice how mostly everyone\nis convinced of HF's still being fucked, S3 lying about shorts, and squeeze\nhappening in a matter of days.\n\nIf you visit /r/stocks for even a minute, you will quickly notice how mostly\neveryone is convinced of HF's…",
  "original_created_utc": 1612260783,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你访问WSB哪怕一分钟，你就会很快注意到大多数人都是如何\n确信HF的还在被干，S3躺在短裤上，和挤兑。\n发生在几天之内。\n\n如果你访问/r/stocks哪怕是一分钟，你就会很快注意到大部分的\n每个人都相信高频的... ...",
      "title": "别再装作知道GME已经结束了，这和装作要登月没什么区别。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你訪問WSB哪怕一分鐘，你就會很快注意到大多數人都是如何\n確信HF的還在被幹，S3躺在短褲上，和擠兌。\n發生在幾天之內。\n\n如果你訪問/r/stocks哪怕是一分鐘，你就會很快注意到大部分的\n每個人都相信高頻的... ...",
      "title": "別再裝作知道GME已經結束了，這和裝作要登月沒什麼區別。"
    }
  ],
  "title": "Stop acting like you know GME is over, it's no different than acting like it's going to moon.",
  "created_utc": 1612268447,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you visit WSB for even a minute, you will quickly notice how mostly everyone is convinced of HF&#39;s still being fucked, S3 lying about shorts, and squeeze happening in a matter of days.</p>\n\n<p>If you visit <a href=\"/r/stocks\">/r/stocks</a> for even a minute, you will quickly notice how mostly everyone is convinced of HF&#39;s having already won, S3 being correct, and squeeze being over.</p>\n\n<p>Yet somehow WSB is a cult mentality and we (you) are not? Anyone with the slightest self-respect will admit that <strong>they do not know</strong> and that anything can still happen. S3 could be lying. Or they could be not. Shorts could be at 50%. Or they could be at 100+%. Anyone and everyone <em>might</em> be lying, or they might not. WSB is right about one thing: this is a casino. If you disagree, I would love to see how you have personally tracked the number of shares shorted. Otherwise it&#39;s just &quot;the guy I trust is correct and the guy you trust is wrong&quot;.</p>\n\n<p>Right now there are numerous people here asking for more solid advice than they can get on WSB. Those people should be <em>warned of the risks</em> and we should admit that <em>nobody knows right now</em>. Yet I see countless people saying &quot;yeah it&#39;s totally over just sell while you can&quot;.</p>\n\n<p>I personally don&#39;t know, which is why I have just a small amount of GME longs.</p>\n</div><!-- SC_ON -->",
  "score": 2887,
  "permalink": "/r/stocks/comments/lashev/stop_acting_like_you_know_gme_is_over_its_no/",
  "subreddit": "stocks",
  "id": "lashev",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541043
}