{
  "author": "TwizAU",
  "original_created_utc": 1634215964,
  "title": "If a persons brain is split into two hemispheres what would happen when trying to converse with the two hemispheres independently? For example asking what's your name, can you speak, can you see, can you hear, who are you...",
  "created_utc": 1634239902,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Started thinking about this after watching this video: <a href=\"https://www.youtube.com/watch?v=wfYbgdo8e-8\">https://www.youtube.com/watch?v=wfYbgdo8e-8</a></p>\n\n<p>It talks about the effects on a person after having a surgery to cut the bridge between the brains hemispheres to aid with seizures and presumably more.</p>\n\n<p>It shows experiments where for example both hemispheres are asked to pick their favourite colour, and they both pick differently. </p>\n\n<p>What I haven&#39;t been able to find is an experiment to try have a conversation with the non speaking hemisphere and understand if it is a separate consciousness, and what it controls/did control when the hemispheres were still connected.</p>\n\n<p>You wouldn&#39;t be able to do this though speech, but what about using cards with questions, and a pen and paper for responses for example?</p>\n\n<p>Has this been done, and if not, why not?</p>\n</div><!-- SC_ON -->",
  "score": 150,
  "permalink": "/r/askscience/comments/q7z2xb/if_a_persons_brain_is_split_into_two_hemispheres/",
  "subreddit": "askscience",
  "id": "q7z2xb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Started thinking about this after watching this video:\nhttps://www.youtube.com/watch?v=wfYbgdo8e-8\n\nIt talks about the effects on a person after having a surgery to cut the bridge\nbetween the brains hemispheres to aid with seizures and presumably more.\n\nIt shows experiments where for example both…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このビデオを見て考え始めました。\nhttps://www.youtube.com/watch?v=wfYbgdo8e-8\n\n痙攣を抑えるために脳の半球の間の橋を切る手術を受けた後の人への影響について書かれています。\n脳の半球の間の橋を切る手術をした後の人への影響について話しています。\n\nこのビデオでは、例えば、両方の...",
      "title": "もし、人の脳が2つの半球に分かれているとしたら、2つの半球と独立して会話をしようとするとどうなるでしょうか？例えば、あなたの名前は何ですか、あなたは話すことができますか、あなたは見ることができますか、あなたは聞くことができますか、あなたは誰ですか...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看完这个视频后开始思考这个问题。\nhttps://www.youtube.com/watch?v=wfYbgdo8e-8\n\n它讲述了一个人在做了切断大脑半球之间的桥梁的手术后所受到的影响\n大脑半球之间的桥梁，以帮助解决癫痫发作和可能的更多问题。\n\n它显示了一些实验，例如，两个...",
      "title": "如果一个人的大脑被分割成两个半球，当试图与两个半球独立对话时会发生什么？例如，问你叫什么名字，你能不能说话，你能不能看到，你能不能听到，你是谁......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看完這個視頻後開始思考這個問題。\nhttps://www.youtube.com/watch?v=wfYbgdo8e-8\n\n它講述了一個人在做了切斷大腦半球之間的橋樑的手術後所受到的影響\n大腦半球之間的橋樑，以幫助解決癲癇發作和可能的更多問題。\n\n它顯示了一些實驗，例如，兩個...",
      "title": "如果一個人的大腦被分割成兩個半球，當試圖與兩個半球獨立對話時會發生什麼？例如，問你叫什麼名字，你能不能說話，你能不能看到，你能不能聽到，你是誰......"
    }
  ]
}