{
  "author": "mythstified",
  "original_created_utc": 1626327261,
  "title": "You have $5k right this second and can buy one coin, what is it?",
  "created_utc": 1626341536,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m thinking of dropping a few grand into a coin but I&#39;m trying to weigh them all out for a couple of factors.</p>\n\n<p>I plan to HODL until at least 2022 as I believe this lul is soon to be over.</p>\n\n<p>So while I hold I want to stake. But not locked in, just in case any ridiculous price action happens I&#39;d like to be able to sell quick.</p>\n\n<p>So what shows the most potential for growth, has good staking abilities and is not a moonshot shit coin?  I already have a few of those I&#39;m rolling the dice on.</p>\n\n<p>Right now my most tempting option is ADA. But ETH sounds tempting too if it hit 10k that&#39;d be 5x.  XRP is very tempting but I don&#39;t think it can be staked, and is really dependent on that silly lawsuit, I feel there&#39;s an unprecedented pent up price long built into it that will spring.</p>\n\n<p>Heck, part of me suspects that the bear trot we&#39;re in right now will be dramatically reversed once XRP settles and explodes.</p>\n\n<p>Maybe I should get XRP for a month just in case.. If ti jumps but the market doesn&#39;t, then I can just put moar into ADA</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/okmbee/you_have_5k_right_this_second_and_can_buy_one/",
  "subreddit": "CryptoCurrency",
  "id": "okmbee",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm thinking of dropping a few grand into a coin but I'm trying to weigh them\nall out for a couple of factors.\n\nI plan to HODL until at least 2022 as I believe this lul is soon to be over.\n\nSo while I hold I want to stake. But not locked in, just in case any ridiculous\nprice action happens I'd like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コインに数千ドルを投じようと考えていますが、いくつかの要素を考慮して\nいくつかの要因ですべてを検討しています。\n\nこの低迷期はもうすぐ終わると思っているので、少なくとも2022年まではHODLするつもりです。\n\nですから、ホールドしている間にステークしたいと思っています。しかし、とんでもない価格変動が起こった場合に備えて、固定はしません。\n万が一、とんでもない価格変動が起こったときのために...。",
      "title": "今この瞬間に5,000ドルを持っていて、1枚のコインを買うことができますが、それは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在考虑为一枚硬币投入几千美元，但我正试图权衡它们\n所有这些都是为了几个因素。\n\n我计划至少在2022年之前进行HODL，因为我相信这个低潮很快就会过去。\n\n因此，在我持有的同时，我想入股。但不是锁定的，只是为了防止任何可笑的\n价格行动发生，我想......",
      "title": "你现在就有5千美元，可以买一个硬币，是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在考慮爲一枚硬幣投入幾千美元，但我正試圖權衡它們\n所有這些都是爲了幾個因素。\n\n我計劃至少在2022年之前進行HODL，因爲我相信這個低潮很快就會過去。\n\n因此，在我持有的同時，我想入股。但不是鎖定的，只是爲了防止任何可笑的\n價格行動發生，我想......",
      "title": "你現在就有5千美元，可以買一個硬幣，是什麼？"
    }
  ]
}