{
  "author": "DeliciousNectarine8",
  "original_created_utc": 1652551214,
  "title": "The only people panicking right now are the ones that didnt respect the “dont invest more than you can afford to lose” rule, or simply invested in dumb hype coins.",
  "created_utc": 1652584983,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When you’re in the green and making lots of profits your brain will automatically make you double down even though you told yourself multiple times that “this is enough”That’s just how human greed works. The majority of FOMO after all is simply just greed and events like this one should always be a reminder to overcome this feeling.&lt;/p&gt;\n\n&lt;p&gt;Then there are the people who went all in on memecoins and hype coins and are full blown REKT right now. What did you expect? Its a coin that’s literally backed by &lt;strong&gt;hype&lt;/strong&gt; and &lt;strong&gt;nothing more.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Yet again, events like this bear market should always be a reminded to invest in something that has actual backup.&lt;/p&gt;\n\n&lt;p&gt;Look at Ethereum for example. Its down bad but its holding up way better than other coins since it has actual technology and fundamentals. Or even Bitdao. Their price action has been one of the steadiest in the market cause of their massive $2 billion treasury backing them up with hundreds of millions of dollars of stablecoins and ETH.&lt;/p&gt;\n\n&lt;p&gt;Let this be a lesson to NEVER invest more than you can afford to lose and focus more on projects with fundamentals and backing rather than hype based coins that will most probably go to zero at the nearest market dip.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/upmpkg/the_only_people_panicking_right_now_are_the_ones/",
  "subreddit": "CryptoCurrency",
  "id": "upmpkg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When you’re in the green and making lots of profits your brain will\nautomatically make you double down even though you told yourself multiple times\nthat “this is enough”That’s just how human greed works. The majority of FOMO\nafter all is simply just greed and events like this one should always be…"
}