{
  "author": "EllJayy",
  "the_new_excerpt": "I was just looking through the play store top charts for games and it really got\nme thinking. 9 or 10 years ago, the top mobile games on the charts were all well\ndeveloped and designed games such as Angry Birds, Fruit Ninja, Clash of Clans\netc. But now, the apps at the top of the charts are all ad…",
  "original_created_utc": 1619320849,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プレイストアのゲームのトップチャートを見ていて、すごく考えさせられました。\n考えさせられました。9～10年前は、モバイルゲームのトップチャートは、Angry Birds、Fruit Ninja、C++などの\nAngry Birds、Fruit Ninja、Clash of Clansなどのデザイン性の高いゲームでした。\nなどがありました。しかし今は、上位にランクインしているアプリはすべて広告...",
      "title": "アプリマーケットに一体何が起こったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚看了一下Play商店的游戏排行榜，这真的让我想到了\n我在想。9或10年前，排行榜上的顶级移动游戏都是开发和设计良好的游戏，如《愤怒的小鸟》、《红楼梦》和《红楼梦》。\n开发和设计的游戏，如愤怒的小鸟、水果忍者、部落冲突等。\n等。但现在，排行榜上的应用都是广告。",
      "title": "应用市场到底发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛看了一下Play商店的遊戲排行榜，這真的讓我想到了\n我在想。9或10年前，排行榜上的頂級移動遊戲都是開發和設計良好的遊戲，如《憤怒的小鳥》、《紅樓夢》和《紅樓夢》。\n開發和設計的遊戲，如憤怒的小鳥、水果忍者、部落衝突等。\n等。但現在，排行榜上的應用都是廣告。",
      "title": "應用市場到底發生了什麼？"
    }
  ],
  "title": "What the hell happened to the app market?",
  "created_utc": 1619355158,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was just looking through the play store top charts for games and it really got me thinking. 9 or 10 years ago, the top mobile games on the charts were all well developed and designed games such as Angry Birds, Fruit Ninja, Clash of Clans etc. \nBut now, the apps at the top of the charts are all ad-filled, low effort, low budget money grabbing pieces of crap. Most of them seem like they only exist purely to sell as many ad spaces as possible, with unoriginal gameplay and poor graphics.\nIt confuses me because obviously there are a ton of really great modern mobile games with good intentions, but none of them are on the charts at all. Only shitty ad-filled uninspired poor efforts. My first guess was kids, but I&#39;m not too sure.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/mxzq6t/what_the_hell_happened_to_the_app_market/",
  "subreddit": "NoStupidQuestions",
  "id": "mxzq6t",
  "is_self": true,
  "media": null,
  "is_video": false
}