{
  "author": "SkepticalCryptoDude",
  "original_created_utc": 1646231622,
  "title": "If banks freeze our accounts, how does crypto help if we can’t get any fiat from it?",
  "created_utc": 1646282001,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if I’m missing something obvious here, but it doesn’t add up. Everyone is saying unbank yourself, but when you sell your crypto, where are you getting the fiat from to survive? &lt;/p&gt;\n\n&lt;p&gt;Most countries and places don’t accept crypto as payment yet. Don’t most people sell their crypto on the exchange and then send it to their bank for fiat? If your account is frozen, then how do you take out your crypto profits?&lt;/p&gt;\n\n&lt;p&gt;Again, my apologies if I’m missing something obvious here but it doesn’t make sense to me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/t51f4s/if_banks_freeze_our_accounts_how_does_crypto_help/",
  "subreddit": "CryptoCurrency",
  "id": "t51f4s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sorry if I’m missing something obvious here, but it doesn’t add up. Everyone is\nsaying unbank yourself, but when you sell your crypto, where are you getting the\nfiat from to survive?\n\nMost countries and places don’t accept crypto as payment yet. Don’t most people\nsell their crypto on the exchange…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明らかな見落としがあったら申し訳ないのですが、腑に落ちないのです。誰もが\nしかし、暗号を売った場合、どこでその暗号を手に入れるのでしょうか？\nフィアット（不換紙幣）は生きていくために必要なものですか？\n\nほとんどの国や場所は、まだ暗号を支払いとして受け入れていないのです。ほとんどの人が\n取引所で暗号を売る...",
      "title": "銀行が私たちの口座を凍結したら、暗号はどのように役立つのでしょうか。暗号からフィアットを得ることができないのであれば。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我错过了一些明显的东西，请原谅，但这并不符合事实。每个人都在说\n但当你卖掉你的加密货币时，你从哪里获得了\n法币来生存？\n\n大多数国家和地方还不接受加密货币作为支付手段。大多数人不是\n在交易所出售他们的加密货币......",
      "title": "如果银行冻结了我们的账户，如果我们不能从中获得任何法币，那么加密货币有什么帮助？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我錯過了一些明顯的東西，請原諒，但這並不符合事實。每個人都在說\n但當你賣掉你的加密貨幣時，你從哪裏獲得了\n法幣來生存？\n\n大多數國家和地方還不接受加密貨幣作爲支付手段。大多數人不是\n在交易所出售他們的加密貨幣......",
      "title": "如果銀行凍結了我們的賬戶，如果我們不能從中獲得任何法幣，那麼加密貨幣有什麼幫助？"
    }
  ]
}