{
  "author": "TheFreeOracle",
  "the_new_excerpt": "U.S. safety regulators have asked Tesla to recall 158,000 vehicles over media\ncontrol unit failures that cause the touchscreen displays to stop working,\nfollowing a months-long investigation by the National Highway Traffic Safety\nAdministration.\n\nThe Office of Defects Investigation unit of the…",
  "original_created_utc": 1610591093,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "美国安全监管机构要求特斯拉召回15.8万辆汽车，因媒体\n控制单元故障，导致触摸屏显示停止工作。\n在美国国家公路交通安全局进行了长达数月的调查后。\n管理局。\n\n厅缺陷调查组对我厅缺陷调查工作进行了...",
      "title": "美联储要求特斯拉召回15.8万辆汽车，原因是触摸屏显示屏失效"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國安全監管機構要求特斯拉召回15.8萬輛汽車，因媒體\n控制單元故障，導致觸摸屏顯示停止工作。\n在美國國家公路交通安全局進行了長達數月的調查後。\n管理局。\n\n廳缺陷調查組對我廳缺陷調查工作進行了...",
      "title": "美聯儲要求特斯拉召回15.8萬輛汽車，原因是觸摸屏顯示屏失效"
    }
  ],
  "title": "Feds asks Tesla to recall 158,000 vehicles over failing touchscreen displays",
  "created_utc": 1610610063,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>U.S. safety regulators have asked Tesla to recall 158,000 vehicles over media control unit failures that cause the touchscreen displays to stop working, following a months-long investigation by the National Highway Traffic Safety Administration.</p>\n\n<p>The Office of Defects Investigation unit of the agency determined that the failure of the media control unit is a safety issue since functions like the backup camera and defogging and defrosting setting controls stop working as well as audible chimes, which are used when the turn signal indicator is activated and to alert drivers while the vehicle&#39;s Autopilot advanced driver assistance system is engaged. Reports of the MCUs suddenly failing have been a topic for years in Tesla forums.</p>\n\n<p>The failure is caused when the memory storage in a flash drive used in the used in these vehicles reaches capacity, investigators concluded. The only solution is to replace the physical piece of hardware. Vehicles affected include Model S sedans built between 2012 and 2018 as well as Model X SUVs in 2016 through 2018.</p>\n\n<p>Tesla did not respond to a request for comment. However, the company did provide information to NHTSA, which is contained in the report. Tesla confirmed to NHTSA that all units will inevitably fail given the memory device’s finite storage capacity. Tesla provided its own statistical model showing the number of projected weekly MCU repairs from 2020 to 2028. The automaker estimated that replacement rates for MCU failures will peak in early 2022 and gradually decline until (near) full part turnover has been accomplished in 2028, according to the report.</p>\n\n<p>These vehicles are equipped with an NVIDIA Tegra 3 processor with an integrated 8GB eMMC NAND flash memory device. Part of this 8GB storage capacity is used each time the vehicle is started. The eMMC NAND cell hardware fails when the storage capacity is reached, resulting in failure of the MCU, the agency said.</p>\n\n<p>The eMMC NAND flash device&#39;s lifespan based upon the number of program/erase cycles, after which the MCU fails due to memory wear-out. Investigators determined that the expected usage life rating for the 8GB eMMC NAND flash memory device is about 3,000 Program-Erase cycles, after which the eMMC NAND flash memory device would become fully consumed and no longer be operational. At a daily cycle usage rate of 1.4 per block, accumulation of 3,000 P/E cycles would take only 5 to 6 years, the agency said.</p>\n\n<p>The agency has officially requested that Tesla initiate a recall to notify all owners, purchasers, and dealers of the subject vehicles of this safety defect and provide a remedy.</p>\n\n<p><a href=\"https://uk.finance.yahoo.com/news/feds-asks-tesla-recall-158-000308276.html\">https://uk.finance.yahoo.com/news/feds-asks-tesla-recall-158-000308276.html</a></p>\n</div><!-- SC_ON -->",
  "score": 138,
  "permalink": "/r/stocks/comments/kww5i6/feds_asks_tesla_to_recall_158000_vehicles_over/",
  "subreddit": "stocks",
  "id": "kww5i6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706383095
}