{
  "author": "CPAPrez",
  "original_created_utc": 1627054540,
  "title": "Crypto Margin Trading EXPOSED!",
  "created_utc": 1627072240,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you are trading crypto with leverage on Bybit, Phemex, Bitmex, FTX, BINANCE futures or any other exchange that offers leverage, STOP right now, it is all RIGGED!!!</p>\n\n<p>The exchanges pay big fees to the (CME) Chicago Mercantile exchange Globex and other financial institutional firms to use &quot;Hitmen&quot; (high frequency trading bots) that are programmed to hunt your stop-loss&#39; and liquidate your positions with-in certain percentages from your entry. In turn, the CME and institutional firms steal your crypto and the exchanges make further billions in fees. *CME charts are also delayed by 10mins unless you pay an additional Tradingview fee to unlock the live version.</p>\n\n<p>There is also the exchange fine print which should be thoroughly studied before executing any margin trade, which most traders will never look into or find out about until it&#39;s too late.</p>\n\n<p>A couple of examples: (Bybit)</p>\n\n<p>1.) An order can be executed and closed by the exchange (LTP) &quot;Last traded price&quot;, but can be liquidated by the &quot;Mark price&quot; (the price that reflects the real-time spot price, which is referenced from five other major exchanges: Coinbase, Binance, Gemini, Bittrex &amp; Kraken), even if the current candle did not reach your liquidation price. Furthermore, to see the live Mark price, you must set up the .MBTC, BYBIT indicator to it&#39;s correct settings of... Inputs: Low or High (depending if you are Long or Short), and Style: Precision: 4 , Override Min Tick: 1/1000. Failing to set this up correctly can get you stopped out or prematurely liquidated (especially for scalpers).</p>\n\n<p>2.) You can get paid a maker rebate fee of -0.025% (of your trade value) by executing a limit trade, ticking the post only check box and closing that trade using the limit function. The catch is, when using the limit button to close a trade, you must priorly set a worse or better price depending if you are Long or Short. *If you instantly close your trade using the limit button, the maker fee will be forfeited and you will be charged a market Taker fee of 0.075%. None of this is ever mentioned to retail traders in order to charge you the maximum in fees possible!</p>\n\n<p>Other major concerns that I have noticed are paid YouTuber partnerships pushing margin trading on new traders that have absolutely no experience for a $10 per customer commission fee. Yes, &quot;The Moon, MMCrypto, Davincij15, Ivan, Bitboy&quot; and more... are all getting hundreds of thousands of dollars paid to them in affiliate commissions from each exchange for trapping innocent people. Bybit has also been seen monitoring and defending comments on The Moon and MMCrypto twitter pages as of recent when they went down from a possible DNS attack.</p>\n\n<p>In summary: There is a reason that 98% of traders have lost more than they have made trading with Margin. The system is designed and stacked so far against the average retail trader, that you will end up losing everything you deposit.</p>\n\n<p>Goodluck to you all, I hope this saves some of you in the future. HODL and win!</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/Bitcoin/comments/oq4wbi/crypto_margin_trading_exposed/",
  "subreddit": "Bitcoin",
  "id": "oq4wbi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you are trading crypto with leverage on Bybit, Phemex, Bitmex, FTX, BINANCE\nfutures or any other exchange that offers leverage, STOP right now, it is all\nRIGGED!!!\n\nThe exchanges pay big fees to the (CME) Chicago Mercantile exchange Globex and\nother financial institutional firms to use \"Hitmen\"…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Bybit、Phemex、Bitmex、FTX、BINANCE、futuresなど、レバレッジをかけて暗号を取引している場合は、今すぐ中止してください。\n先物、またはレバレッジを提供するその他の取引所でレバレッジをかけて取引している場合は、今すぐ停止してください、すべてが\nすべてが不正なのです!!!\n\n取引所は、シカゴ・マーカンタイル取引所（CME）やGlobexなどの金融機関に多額の手数料を支払っています。\n取引所は \"ヒットマン \"を使うために、（CME）シカゴ・マーカンタイル取引所（Globex）などの金融機関に多額の手数料を支払っています。",
      "title": "Crypto Margin Trading EXPOSED!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你在Bybit、Phemex、Bitmex、FTX、BINANCE上用杠杆交易加密货币\n期货或任何其他提供杠杆的交易所，现在就停止吧，这一切都是\n被操纵了！！！。\n\n交易所向芝加哥商业交易所(CME)Globex和其他金融机构公司支付大笔费用，以使用 \"打击\"。\n其他金融机构公司使用 \"杀手\"......",
      "title": "加密货币保证金交易被曝光!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你在Bybit、Phemex、Bitmex、FTX、BINANCE上用槓桿交易加密貨幣\n期貨或任何其他提供槓桿的交易所，現在就停止吧，這一切都是\n被操縱了！！！。\n\n交易所向芝加哥商業交易所(CME)Globex和其他金融機構公司支付大筆費用，以使用 \"打擊\"。\n其他金融機構公司使用 \"殺手\"......",
      "title": "加密貨幣保證金交易被曝光!"
    }
  ]
}