{
  "author": "gdj11",
  "the_new_excerpt": "Remember the big news that Visa had completed their first crypto transaction on\ntheir network? Did you know it was Crypto.com who was behind that? Probably not,\nbecause everyone seemed to ignore that part. They’re currently releasing NFTs\nwith Snoop Dogg, they’re sponsoring F1 race cars, and have…",
  "original_created_utc": 1617522720,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "还记得Visa完成第一笔加密交易的大新闻吗？\n他们的网络？你知道是快播网在背后搞鬼吗？也许不知道。\n因为大家似乎都忽略了这部分。他们目前正在发布NFTs。\n与Snoop Dogg，他们赞助F1赛车，并有... ...",
      "title": "我觉得Crypto.com的功劳还不够大，因为他们为主流加密技术的采用所做的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還記得Visa完成第一筆加密交易的大新聞嗎？\n他們的網絡？你知道是快播網在背後搞鬼嗎？也許不知道。\n因爲大家似乎都忽略了這部分。他們目前正在發佈NFTs。\n與Snoop Dogg，他們贊助F1賽車，並有... ...",
      "title": "我覺得Crypto.com的功勞還不夠大，因爲他們爲主流加密技術的採用所做的事情。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "にVisaが初の暗号化取引を完了したという大きなニュースを覚えていますか？\n憶えていますか？その裏にはCrypto.comの存在があったことをご存知でしょうか？おそらく知らないでしょう。\n皆、その部分は無視していたようですから。彼らは現在NFTをリリースしています。\nスヌープ・ドッグと一緒にNFTをリリースしたり、F1レースカーのスポンサーになったり、そして...",
      "title": "Crypto.comは、主流の暗号採用のために行ってきたことに対して、十分な評価を受けていないように感じます。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "にVisaが初の暗号化取引を完了したという大きなニュースを覚えていますか？\n憶えていますか？その裏にはCrypto.comの存在があったことをご存知でしょうか？おそらく知らないでしょう。\n皆、その部分は無視していたようですから。彼らは現在NFTをリリースしています。\nスヌープ・ドッグと一緒にNFTをリリースしたり、F1レースカーのスポンサーになったり、そして...",
      "title": "Crypto.comは、主流の暗号採用のために行ってきたことに対して、十分な評価を受けていないように感じます。"
    }
  ],
  "title": "I feel like Crypto.com doesn’t get nearly enough credit for what they’ve done for mainstream crypto adoption",
  "created_utc": 1617540913,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Remember the big news that Visa had completed their first crypto transaction on their network? Did you know it was Crypto.com who was behind that? Probably not, because everyone seemed to ignore that part. They’re currently releasing NFTs with Snoop Dogg, they’re sponsoring F1 race cars, and have the 6th most popular finance app on Android.</p>\n\n<p>I remember posts on this subreddit getting so much attention that would criticize them for hidden fees which didn’t exist. (It was just people not understanding how spreads and low volume work.) People also gave them so much hate for making changes to their company and tokens without telling the public first. Granted some things they should’ve said before doing, but they’re a startup in a brand new sector with regulations changing by the day. You can’t expect them to divulge everything to the public before it’s ready for the public.</p>\n\n<p>I’m not saying everything they’ve done is perfect and we can’t criticize anything. Far from it. But I think they deserve a lot more credit than they get for bringing crypto to where it is today.</p>\n</div><!-- SC_ON -->",
  "score": 1028,
  "permalink": "/r/CryptoCurrency/comments/mjrtv6/i_feel_like_cryptocom_doesnt_get_nearly_enough/",
  "subreddit": "CryptoCurrency",
  "id": "mjrtv6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875627
}