{
  "author": "YesIateYourLunch",
  "the_new_excerpt": "The quote I've read is from Ruth Goodman's book \"How to be Tudor\":\n\n\"In 1515 the Dutch humanist Desiderius Erasmus wrote in a letter that the floors\nof English houses ‘are, in general, laid with white clay, and are covered with\nrushes, occasionally renewed, but so imperfectly that the bottom layer…",
  "original_created_utc": 1615540633,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我读到的这句话来自露丝-古德曼的《如何成为都铎人》一书。\n\n\"1515年，荷兰人文学者德西德里乌斯-伊拉斯谟在一封信中写道，地板... ...\n英国房屋的'一般来说，都是用白色的粘土铺设的，并且覆盖着白色的粘土。\n偶尔更新，但不完善，以至于底层... ...",
      "title": "在1515年的一封信中，伊拉斯谟抱怨英国房屋的地板有多恶心，声称它们藏有\"......祛痰、呕吐......以及其他不适合被提及的可憎之处\"。\"是伊拉斯谟只是一个脾气暴躁的游客，还是英国的地板特别不卫生？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀到的這句話來自露絲-古德曼的《如何成爲都鐸人》一書。\n\n\"1515年，荷蘭人文學者德西德里烏斯-伊拉斯謨在一封信中寫道，地板... ...\n英國房屋的'一般來說，都是用白色的粘土鋪設的，並且覆蓋着白色的粘土。\n偶爾更新，但不完善，以至於底層... ...",
      "title": "在1515年的一封信中，伊拉斯謨抱怨英國房屋的地板有多噁心，聲稱它們藏有\"......祛痰、嘔吐......以及其他不適合被提及的可憎之處\"。\"是伊拉斯謨只是一個脾氣暴躁的遊客，還是英國的地板特別不衛生？"
    }
  ],
  "title": "In a 1515 letter, Erasmus complained about how disgusting the floors of English houses were, claiming they harboured \"... expectoration, vomiting ... and other abominations not fit to be mentioned.\" Was Erasmus just being a grumpy tourist, or were English floors particularly unsanitary?",
  "created_utc": 1615556574,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The quote I&#39;ve read is from Ruth Goodman&#39;s book &quot;How to be Tudor&quot;:</p>\n\n<p>&quot;In 1515 the Dutch humanist Desiderius Erasmus wrote in a letter that the floors of English houses ‘are, in general, laid with white clay, and are covered with rushes, occasionally renewed, but so imperfectly that the bottom layer is left undisturbed, sometimes for twenty years, harbouring expectoration, vomiting, the leakage of dogs and men, ale droppings, scraps of fish and other abominations not fit to be mentioned’.&quot;</p>\n\n<p>This made me curious of a few things:</p>\n\n<p>1) The question in the title: how did the English compare to Western continental Europe, for instance - France - in this regard? Would stone or wooden flooring have been more common among the French, even for those who belonged to low-middle end of society?</p>\n\n<p>2) For what types of people would this practice of covering the floor with rushes been common? As he claims this applied to English houses &quot;in general&quot;, what kind of people would he have had to have visited to have been given this impression, and where would they land on the socio-economic spectrum?</p>\n\n<p>3) Finally, when did wooden flooring (or stone, but I assume wood would be more common) become the norm among farmers who were slightly more well to do? (Small landowning farmers, who would make a profit a good year and not live hand to mouth)</p>\n\n<p>/* End of questions */</p>\n\n<p>Just a message to the mods: you&#39;re doing such a good job. Seriously. I want to thank you as individuals for the time you put into this subreddit. Even you <a href=\"/u/sunagainstgold\">/u/sunagainstgold</a>, who deleted my previous question (which was perfectly reasonable). If you review this post - don&#39;t have mercy on me. Protect the community.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/m3dyen/in_a_1515_letter_erasmus_complained_about_how/",
  "subreddit": "AskHistorians",
  "id": "m3dyen",
  "is_self": true,
  "media": null,
  "is_video": false
}