{
  "author": "the_wijji",
  "the_new_excerpt": "Disclaimer: I am a LTC bag holder since 2017. I don't intent this to be a FUD\npost, rather a discussion where I want to hear other people's opinions.\n\n\n\nI noticed LTC has been slowly, but very steadily, going down the pecking order\nin the top 10 cryptocurrencies. Main reasons why I think so are:\n\n\n\n…",
  "original_created_utc": 1616328712,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "声明：我从2017年开始就是一个LTC包的持有者。我无意将此作为一个FUD。\n帖子，而是一个讨论，我想听听其他人的意见。\n\n\n\n我注意到LTC一直在慢慢地，但非常稳定地往下走。\n在十大加密货币中。我这么认为的主要原因是：:\n\n\n\n…",
      "title": "我不认为LTC会成功。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聲明：我從2017年開始就是一個LTC包的持有者。我無意將此作爲一個FUD。\n帖子，而是一個討論，我想聽聽其他人的意見。\n\n\n\n我注意到LTC一直在慢慢地，但非常穩定地往下走。\n在十大加密貨幣中。我這麼認爲的主要原因是：:\n\n\n\n…",
      "title": "我不認爲LTC會成功。"
    }
  ],
  "title": "I don't think LTC is gonna make it",
  "created_utc": 1616340988,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: I am a LTC bag holder since 2017. I don&#39;t intent this to be a FUD post, rather a discussion where I want to hear other people&#39;s opinions.</p>\n\n<p>&#x200B;</p>\n\n<p>I noticed LTC has been slowly, but very steadily, going down the pecking order in the top 10 cryptocurrencies. Main reasons why I think so are:</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>It is far away ~40% of its ATH, and has barely seen any positive price movement since this bull run started (as compared to others in the top 10).</li>\n<li>The critics of LTC are correct that LTC doesn&#39;t provide any feature that the other currencies don&#39;t provide. It doesn&#39;t have any such feature which another crypto doesn&#39;t have.</li>\n<li>It was supposed to be the &quot;silver to BTC&#39;s gold&quot;, but even the actual silver is being considered less and less of an investment or a currency.</li>\n<li>Mainly it is (was?) used to transfer coins from one exchange/wallet to another because it&#39;s faster and cheaper than *Bitcoin*. But now coins like ADA and XLM provide better and faster services.</li>\n<li>Lastly, we have been saying that it will gain value once mimblewimble is implemented. But we already have Monero as a privacy coin, which arguably is the best privacy coin currently. And I don&#39;t think LTC is gonna beat Monero in it&#39;s own game.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>I dont see much new money flowing in into LTC, as opposed to cryptos like uniswap, chainlink or polkadot. I feel once it drops from the top 10, LTC will be left behind in the dust unfortunately when the other crypto&#39;s really gather steam in this bull run.</p>\n\n<p>An example would be Lisk from the last bull run of 2017. It was a good coin but it just sort of burnt out and fell off the face of the earth.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Edit:</p>\n\n<p>Just wanted to make a counter-argument against myself. I just noticed that LTC still has higher  24h volume than BNB, Polkadot, Uniswap and Chain. ADA has almost the same volume than LTC, a bit higher though.</p>\n\n<p>So maybe people are still using LTC. </p>\n</div><!-- SC_ON -->",
  "score": 662,
  "permalink": "/r/CryptoCurrency/comments/m9ve9b/i_dont_think_ltc_is_gonna_make_it/",
  "subreddit": "CryptoCurrency",
  "id": "m9ve9b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816903
}