{
  "author": "ToesyToeNails",
  "original_created_utc": 1631672869,
  "title": "Why is a lack of jealousy a turn off for some people?",
  "created_utc": 1631698390,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not insecure, so I&#39;m not a jealous person. If somebody is gonna cheat on me, they&#39;ll cheat on me. If they cheat on me, they didn&#39;t care about me and did me a favour ending the relationship early. I don&#39;t see the point in getting stressed over unknowns. You&#39;re in a relationship with somebody because you trust them. If you don&#39;t trust them, you rushed getting into the relationship.</p>\n\n<p>But because I&#39;m not jealous, it leads to arguments. Apparently I don&#39;t care. It&#39;s like not viewing a girlfriend as properity is a bad thing. Not being overprotective is a bad thing. Understanding your girlfriend has a social life outside of you is a bad thing etc. Apparently me not feeling jealous when my gf talks to another man means I don&#39;t care about her. Me not feeling jealous when she brings up ex&#39;s means I don&#39;t care about her etc. </p>\n\n<p>Why would you want your bf to get jealous? Why is it a desirable trait?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/poh6b4/why_is_a_lack_of_jealousy_a_turn_off_for_some/",
  "subreddit": "TooAfraidToAsk",
  "id": "poh6b4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not insecure, so I'm not a jealous person. If somebody is gonna cheat on me,\nthey'll cheat on me. If they cheat on me, they didn't care about me and did me a\nfavour ending the relationship early. I don't see the point in getting stressed\nover unknowns. You're in a relationship with somebody…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自分に自信がないので、嫉妬するような人間ではありません。もし誰かが私を騙そうとするならば\n彼らは私を騙します。もし浮気をしたら、その人は私のことを気にかけていなかったということで、私のために早く関係を終わらせてくれたということです。\n早めに関係を終わらせてくれました。わからないことにストレスを感じることに意味はないと思います。\n分からないことにストレスを感じる意味がありません。あなたは誰かと交際している...",
      "title": "嫉妬心がないことが、なぜ人によっては嫌われるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是没有安全感，所以我不是一个嫉妒的人。如果有人要欺骗我，\n他们就会欺骗我。如果他们对我不忠，他们就不关心我，并为我做了一件事\n早日结束这段关系。我不认为有必要为未知的事情而紧张\n在未知的情况下。你和某人的关系...",
      "title": "为什么没有嫉妒心会让一些人感到厌恶？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是沒有安全感，所以我不是一個嫉妒的人。如果有人要欺騙我，\n他們就會欺騙我。如果他們對我不忠，他們就不關心我，併爲我做了一件事\n早日結束這段關係。我不認爲有必要爲未知的事情而緊張\n在未知的情況下。你和某人的關係...",
      "title": "爲什麼沒有嫉妒心會讓一些人感到厭惡？"
    }
  ]
}