{
  "author": "jimtors100",
  "original_created_utc": 1644323273,
  "title": "i asked a coworker to dinner and i like this girl, she refused. does that mean i have no chance.?",
  "created_utc": 1644329640,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I asked her on Christmas eve and she said no, i realized the next day that she had to work or had another appointment. I also think that i wasn&amp;#39;t so serious when i asked her out. I didn&amp;#39;t made a move since then and stayed professional till now. &lt;/p&gt;\n\n&lt;p&gt;But recently she&amp;#39;s so nice to me and even notice her try grab my hand 1 time. I&amp;#39;m not sure if I misreading some vibe here or not but I&amp;#39;m still thinking, &amp;quot;what if i could just br brave to ask her out seriously and not play it cool, tell her how i really feel  and not care if i get flat out rejected. &amp;quot;???&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 160,
  "permalink": "/r/TooAfraidToAsk/comments/snj180/i_asked_a_coworker_to_dinner_and_i_like_this_girl/",
  "subreddit": "TooAfraidToAsk",
  "id": "snj180",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I asked her on Christmas eve and she said no, i realized the next day that she\nhad to work or had another appointment. I also think that i wasn't so serious\nwhen i asked her out. I didn't made a move since then and stayed professional\ntill now.\n\nBut recently she's so nice to me and even notice her…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリスマスイブに聞いたら断られたので、翌日気づいたのですが、彼女は\nは、仕事か別の予定があったのです。また、私はそれほど真剣ではなかったと思います。\nデートに誘ったとき それ以来、自分から動くことはなく、プロフェッショナルであり続けました。\n今まで。\n\nでも、最近はすごく優しくしてくれて、気づいたら...。",
      "title": "私は同僚を食事に誘いました。私はその女の子が好きなのですが、彼女は断りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在圣诞节前夕问她，她说没有。\n我意识到第二天她要工作或有其他约会。我还认为我在约她出来时并不是那么认真的\n当我邀请她出去的时候。从那时起，我没有采取任何行动，并保持专业性\n直到现在。\n\n但最近她对我很好，甚至注意到她...",
      "title": "我请同事吃饭，我喜欢这个女孩，她拒绝了。这是否意味着我没有机会？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在聖誕節前夕問她，她說沒有。\n我意識到第二天她要工作或有其他約會。我還認爲我在約她出來時並不是那麼認真的\n當我邀請她出去的時候。從那時起，我沒有采取任何行動，並保持專業性\n直到現在。\n\n但最近她對我很好，甚至注意到她...",
      "title": "我請同事喫飯，我喜歡這個女孩，她拒絕了。這是否意味着我沒有機會？"
    }
  ]
}