{
  "author": "ThinkValue2021",
  "the_new_excerpt": "It seems many are trying to bail on stocks because inflation. (collectibles that\nwe treat as currency, commodities etc). I wanted to explore is if there are\ncertain categories of stocks that are better positioned against Inflation.\n\nSo I came up with a short-list of they type of stocks I might look…",
  "original_created_utc": 1620651183,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インフレのため、多くの人が株を手放そうとしているようです。(通貨や商品として扱われる収集品\n私たちが通貨や商品として扱う収集品など）。) 私が調べたかったのは\nインフレに強い銘柄があるのではないかと考えました。\n\nそこで私は、どのようなタイプの銘柄を探すべきか、ショートリストを考えてみました...",
      "title": "インフレに強い銘柄をスクリーニングするための私のショートリスト"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎很多人都想因为通货膨胀而保住股票。(收藏品\n我们将其视为货币、商品等）。) 我想探讨的是，是否有\n某些类别的股票能更好地抵御通货膨胀。\n\n因此，我想出了一个短名单，列出了我可能会关注的股票类型...",
      "title": "我针对通货膨胀筛选股票的短名单"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎很多人都想因爲通貨膨脹而保住股票。(收藏品\n我們將其視爲貨幣、商品等）。) 我想探討的是，是否有\n某些類別的股票能更好地抵禦通貨膨脹。\n\n因此，我想出了一個短名單，列出了我可能會關注的股票類型...",
      "title": "我針對通貨膨脹篩選股票的短名單"
    }
  ],
  "title": "My shortlist for screening stocks against inflation",
  "created_utc": 1620728999,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems many are trying to bail on stocks because inflation. (collectibles that we treat as currency, commodities etc). I wanted to explore is if there are certain categories of stocks that are better positioned against Inflation.</p>\n\n<p>So I came up with a short-list of they type of stocks I might look for in a period with volatile inflation.</p>\n\n<ol>\n<li>Established Brand Name. This gives the company pricing power because clients are going to buy their product because of what they are getting is also associated with the brand and not just the product. Think AAPL, MCD, KO.</li>\n<li>Commodity selling stocks, industrial sector (<a href=\"https://etfdb.com/etf/RGI/#holdings\">https://etfdb.com/etf/RGI/#holdings</a>). Think metal mines, lumber, companies that produce commodity byproducts that are used in industry (no discrete product firms, like jewelry makers).</li>\n<li>Capitalist Europe. If it goes down in the USA, it all goes down - true, but there is a place where it will go down less relative to others. So, I&#39;m looking at European companies that do not have diversity and inclusion in their 10K. These are actually young companies that are thirsty to grow and will do anything and everything to move up. Alternatively, I look at cultures who are still capitalist, think Russia, Poland, Ireland, Estonia.</li>\n<li>Companies with more fixed-rate debt instead of floating rate debt. If the interest is fixed but there is more money in circulation the lenders are in trouble not the borrowers.</li>\n<li>Government-backed stocks. Especially those that have defense contracts. I think that bad times create civil unrest with a potential for internal and external escalation. Think Northrop Grumman, Boeing, Lockheed Martin (<a href=\"https://etfdb.com/etf/DFEN/#holdings\">https://etfdb.com/etf/DFEN/#holdings</a>)</li>\n</ol>\n\n<p>What would you do if you were worried about inflation eating your gains?</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/investing/comments/n93q2k/my_shortlist_for_screening_stocks_against/",
  "subreddit": "investing",
  "id": "n93q2k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994598
}