{
  "author": "LargePenisJones",
  "original_created_utc": 1636372490,
  "title": "I'm currently paying for a storage unit that only has a 6 foot 90 pound sex doll in it, can I legally just sell the storage unit?",
  "created_utc": 1636385566,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>long story short yes I used to be a lonely weirdo and I bought a sex doll when I was drunk then one day I got a girlfriend and I had no idea what to do with the doll so I got a storage unit and put it in there but I&#39;m tired of paying $60 a month for the unit and then I found out the other day that people sell their storage units or something like that. so could I just do that? how would I go about doing that and would I run into any trouble with the law? I mean it&#39;s not illegal to own a sex doll so I can&#39;t imagine I would.</p>\n</div><!-- SC_ON -->",
  "score": 272,
  "permalink": "/r/NoStupidQuestions/comments/qpc1g6/im_currently_paying_for_a_storage_unit_that_only/",
  "subreddit": "NoStupidQuestions",
  "id": "qpc1g6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "long story short yes I used to be a lonely weirdo and I bought a sex doll when I\nwas drunk then one day I got a girlfriend and I had no idea what to do with the\ndoll so I got a storage unit and put it in there but I'm tired of paying $60 a\nmonth for the unit and then I found out the other day that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単に言うと......俺は昔、孤独な変人で、酔っ払ってセックスドールを買った。\nある日、彼女ができて、その人形をどうしたらいいかわからなくなって、倉庫に入れたんだ。\n人形をどうしたらいいのかわからなくて、倉庫を買ってそこに入れたんだけど、月に60ドルも払うのはもう飽きた。\n月に60ドルも払うのはもう嫌だし、それに先日知ったんだけど...。",
      "title": "現在、6フィート90ポンドのセックスドールが入っているだけの倉庫にお金を払っているのですが、法的に倉庫を売ることはできますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "长话短说，是的，我曾经是一个孤独的怪人，我买了一个性爱娃娃，当我喝醉的时候。\n然后有一天我有了一个女朋友，我不知道该怎么处理这个娃娃。\n所以我找了一个储藏室，把它放在那里，但我已经厌倦了每月支付60美元的储藏室费用。\n但我已经厌倦了每月支付60美元的存储单元，然后我发现有一天，...",
      "title": "我目前正在支付一个存储单元，里面只有一个6英尺90磅的性爱娃娃，我可以合法地直接卖掉这个存储单元吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長話短說，是的，我曾經是一個孤獨的怪人，我買了一個性愛娃娃，當我喝醉的時候。\n然後有一天我有了一個女朋友，我不知道該怎麼處理這個娃娃。\n所以我找了一個儲藏室，把它放在那裏，但我已經厭倦了每月支付60美元的儲藏室費用。\n但我已經厭倦了每月支付60美元的存儲單元，然後我發現有一天，...",
      "title": "我目前正在支付一個存儲單元，裏面只有一個6英尺90磅的性愛娃娃，我可以合法地直接賣掉這個存儲單元嗎？"
    }
  ]
}