{
  "author": "Gods_Shadow_mtg",
  "original_created_utc": 1629113993,
  "title": "Safemoon finally dropped out of top 100",
  "created_utc": 1629142697,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It has taken quite a while, but Safemoon finally dropped out of the top 100 again. Whilst some of you might disregard it, I am happy about every single shitcoin that is not taking the place of a solid project in the top100 - as it comes with a certain degree of free publicity and therefore influences outside perception of the Cryptospace as a whole. </p>\n\n<p>It also means that some of those whose first investment into Crypto was Safemoon, have educated themselves enough to move over to other, more solid projects. Therefore, I guess it did have some positive impact at last.</p>\n\n<p>Farewell SFM Army, hope to never see you again.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/p5ec0v/safemoon_finally_dropped_out_of_top_100/",
  "subreddit": "CryptoCurrency",
  "id": "p5ec0v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It has taken quite a while, but Safemoon finally dropped out of the top 100\nagain. Whilst some of you might disregard it, I am happy about every single\nshitcoin that is not taking the place of a solid project in the top100 - as it\ncomes with a certain degree of free publicity and therefore…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かなりの時間がかかりましたが、Safemoonがついにトップ100から脱落してしまいました。\nしてしまいました。皆さんの中には無視する人もいるかもしれませんが、私は、トップ100で堅実なプロジェクトの代わりになっていないすべてのシットコインについて喜んでいます。\n私は、トップ100の確かなプロジェクトの代わりになっていないすべてのシットコインに満足しています。\nある程度の無料の宣伝効果があるので...",
      "title": "Safemoonがついにトップ100から脱落"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "花了相当长的时间，但Safemoon终于跌出了前100名。\n又是如此。虽然你们中的一些人可能无视它，但我对每一个\n币都很高兴，因为它没有取代前100名中的一个可靠项目。\n因为它带来了一定程度的免费宣传，因此...",
      "title": "萨菲姆终于跌出了前100名"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "花了相當長的時間，但Safemoon終於跌出了前100名。\n又是如此。雖然你們中的一些人可能無視它，但我對每一個\n幣都很高興，因爲它沒有取代前100名中的一個可靠項目。\n因爲它帶來了一定程度的免費宣傳，因此...",
      "title": "薩菲姆終於跌出了前100名"
    }
  ]
}