{
  "author": "TheStonksHub",
  "the_new_excerpt": "What if I told you there was a stock that offers a ~6-7% dividend AND has\npotential for revenue growth, is that something you would be interested in? That\ncompany is AT&T (T) and we’ll break-down some opportunities & challenges this\ncash-generating machine faces in the mid-to-long term.\n\nThe…",
  "original_created_utc": 1621166872,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし私が、6～7％の配当を提供し、かつ収益を上げる可能性のある銘柄があると言ったらどうでしょうか。\n収入が伸びる可能性のある銘柄があるとしたら、あなたは興味を持ちますか？その\nその会社はAT&T(T)です。ここでは、この現金生成機が中長期的に直面する機会と課題について説明します。\nここでは、このキャッシュ生成マシンが中長期的に直面する機会と課題について説明します。\n\nその...",
      "title": "The Weekly DD - AT&T (T): 債券の代理人"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我告诉你有一支股票，提供约6-7%的股息，并且有收入增长的潜力，你会感兴趣吗？\n有收入增长的潜力，你会对它感兴趣吗？这家公司\n这家公司就是AT&T（T），我们将分解这个现金生成机器在中长期面临的一些机会和挑战。\n在中长期内面临的一些机会和挑战。\n\n这家公司就是AT&T（T）。",
      "title": "每周DD - AT&T（T）。债券代理"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我告訴你有一支股票，提供約6-7%的股息，並且有收入增長的潛力，你會感興趣嗎？\n有收入增長的潛力，你會對它感興趣嗎？這家公司\n這家公司就是AT&T（T），我們將分解這個現金生成機器在中長期面臨的一些機會和挑戰。\n在中長期內面臨的一些機會和挑戰。\n\n這家公司就是AT&T（T）。",
      "title": "每週DD - AT&T（T）。債券代理"
    }
  ],
  "title": "The Weekly DD - AT&T (T): A Bond Proxy",
  "created_utc": 1621191437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What if I told you there was a stock that offers a ~6-7% dividend AND has potential for revenue growth, is that something you would be interested in? That company is AT&amp;T (T) and we’ll break-down some opportunities &amp; challenges this cash-generating machine faces in the mid-to-long term.</p>\n\n<p><strong>The Overview</strong></p>\n\n<p>AT&amp;T has three business segments: Communications, Warner Media, and Latin America. AT&amp;T’s communications segment contributes ~79% of operating revenues and ~80% of profits. AT&amp;T’s recent acquisition of Warner Media adds to AT&amp;T’s development, production, and distribution capabilities. The Warner Media acquisition has been broadly successful, comprising 17% of AT&amp;T’s revenues and 22% of profits. Warner Bros. is one of the largest TV and film studios globally, remains a media powerhouse with a profound content library that reaches audiences across many platforms.</p>\n\n<p>In this day and age huge “value” is seen in the amount of users or customers a company has reached. A quick glance at Zoom and we can see that a large portion of their value comes from the 300 million users they leverage. Coming back to AT&amp;T they have over 170 million customers across numerous products to go along with a broad array of content rights.</p>\n\n<p><strong>HBO Max</strong></p>\n\n<p>One of AT&amp;T’s biggest risks over the next 5 years comes from their acquisition of HBO Max. Main concerns are over whether or not they can retain or grow the service’s subscriber base and ultimately increase earnings. Management has recently <strong>increased expectations</strong> of the HBO Max subscription base to reach between 120 to 150 million subscribers by 2025, which is up from their relatively conservative estimate of 75-90 million in 2019. Here’s a look from their recent earnings presentation  </p>\n\n<p>AT&amp;T is progressing in its postpaid wireless, and HBO Max segments, which saw ~800k lines and an additional <strong>~3.5M subscribers added in their previous two quarters</strong>. Consumers are willing to spend more on high-quality internet service as work from home continues.</p>\n\n<p><strong>Final Thoughts</strong></p>\n\n<p>When we look at AT&amp;T’s share price over the last 10 years and we see the stock is up roughly 10% during that time-period it doesn’t necessarily instill confidence as a profitable investment. Some might argue why purchasing shares of AT&amp;T would be a better investment than a “more secure” bond play. However, it is our opinion that AT&amp;T is at a turning point and we may now be able to see the best of both worlds, a high yield dividend return, as well as steady growth in revenues.</p>\n\n<p>A 5% return per annum, paired with its high dividend yield of ~6-7%, allows AT&amp;T to remain more attractive than treasury bonds even with the associated risk of holding shares. Despite increased debt levels and decreased credit ratings, AT&amp;T has a strong strategy to reduce its debt burden. AT&amp;T should continue to have a dividend payout ratio at roughly 50% of FCF, acting as a bond proxy in an investor’s portfolio.</p>\n\n<p><strong>Positions Disclosure:</strong> It can be assumed the author of this article has a long position in the stock.</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/investing/comments/ndmymd/the_weekly_dd_att_t_a_bond_proxy/",
  "subreddit": "investing",
  "id": "ndmymd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802241
}