{
  "author": "burgoyne17",
  "the_new_excerpt": "This was a hard lesson I recently came to terms with in life. I am fairly young\n(26) so don’t really have any hard feelings about it. I always felt I needed\nothers to enjoy the same hobbies as me to actually enjoy doing them. This made\nme miss a lot of opportunities to just enjoy life.\n\nIf you want…",
  "original_created_utc": 1607182486,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这是我最近在生活中接受的一个艰难的一课。我还相当年轻\n(26)所以不要真的对此有什么不好的感觉。我总觉得我需要\n其他人喜欢和我一样的爱好，才能真正享受做这些事情的乐趣。这使得\n我错过了很多享受生活的机会。\n\n如果你想要…",
      "title": "LPT：不要在这里等别人。制定你自己的计划，并坚持执行。不要因为没有人能和你一起去，就做那个永远不会出来的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我最近在生活中接受的壹個艱難的壹課。我還相當年輕\n(26)所以不要真的對此有什麽不好的感覺。我總覺得我需要\n其他人喜歡和我壹樣的愛好，才能真正享受做這些事情的樂趣。這使得\n我錯過了很多享受生活的機會。\n\n如果妳想要…",
      "title": "LPT：不要在這裏等別人。制定妳自己的計劃，並堅持執行。不要因為沒有人能和妳壹起去，就做那個永遠不會出來的人。"
    }
  ],
  "title": "LPT: Don’t wait around for others. Make your own plans and stick to them. Don’t be the person who never gets out just because nobody else can go with you.",
  "created_utc": 1607239390,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This was a hard lesson I recently came to terms with in life. I am fairly young (26) so don’t really have any hard feelings about it. I always felt I needed others to enjoy the same hobbies as me to actually enjoy doing them. This made me miss a lot of opportunities to just enjoy life. </p>\n\n<p>If you want to do something (anything, be it physical, mental) just do it. By all means, extend an invite to others, but if nobody makes plans, just go do it yourself. </p>\n\n<p>Instead of asking “hey, we should go out and do ______ some time”, say “hey, I’m going to go _________, did you want to come?”</p>\n\n<p>This way you already have plans to do whatever it is you’re doing, and you’re just extending an invite. Not actually basing whether you will do thing on someone else. </p>\n\n<p>Hope this helps someone!</p>\n\n<p>Edit: A lot of comments are pointing this out. Obviously with Covid you need to be responsible about these “activities”. In my case, fishing alone outdoors really doesn’t have any covid complications.</p>\n</div><!-- SC_ON -->",
  "score": 78807,
  "permalink": "/r/LifeProTips/comments/k79gxn/lpt_dont_wait_around_for_others_make_your_own/",
  "subreddit": "LifeProTips",
  "id": "k79gxn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260389669
}