{
  "author": "PizzaBlasterZ",
  "original_created_utc": 1637570555,
  "title": "Why is argon used in sputtering PVD processes?",
  "created_utc": 1637608064,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last week during a lecture about PVD and sputtering my professor showed a graph of sputter yield for each atomic number, and it looked like the opposite of atomic radii for each atomic number, the yield goes up as you move to the right in the periodic table, and drops down when you move from a noble gas to an alkali metal. He said this graph explains it because argon has the highest yield, but it doesn&#39;t. Every noble gas below it in the periodic table has better yield (according to that graph).\nMy question is - why use argon? And what makes noble gases have the best yield for their row in the periodic table?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/qzh09o/why_is_argon_used_in_sputtering_pvd_processes/",
  "subreddit": "askscience",
  "id": "qzh09o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Last week during a lecture about PVD and sputtering my professor showed a graph\nof sputter yield for each atomic number, and it looked like the opposite of\natomic radii for each atomic number, the yield goes up as you move to the right\nin the periodic table, and drops down when you move from a noble…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先週、PVDとスパッタリングについての講義で、教授がグラフを見せてくれました。\n原子番号ごとのスパッタリング収率のグラフを見せてくれましたが、それは原子番号ごとの原子半径とは逆で\n原子番号ごとの原子半径とは逆に、周期的に右に行くほど歩留まりが上がっていきます。\n周期表で右に行くほど歩留まりが上がり、高貴な場所から移動すると歩留まりが下がる...というものでした。",
      "title": "なぜスパッタリングPVDプロセスにアルゴンが使われるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "上周，在关于PVD和溅射的讲座中，我的教授展示了一个图表\n每个原子数的溅射产量，它看起来与每个原子数的原子半径相反。\n每个原子序数的原子半径相反，当你向右移动时，产量会上升\n在周期表中，当你向右移动时，产量就会上升，而当你从一个高贵的...",
      "title": "为什么在溅射PVD工艺中使用氩气？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "上週，在關於PVD和濺射的講座中，我的教授展示了一個圖表\n每個原子數的濺射產量，它看起來與每個原子數的原子半徑相反。\n每個原子序數的原子半徑相反，當你向右移動時，產量會上升\n在週期表中，當你向右移動時，產量就會上升，而當你從一個高貴的...",
      "title": "爲什麼在濺射PVD工藝中使用氬氣？"
    }
  ]
}