{
  "author": "aquamanjunior",
  "the_new_excerpt": "This guy does not get the respect he deserves. Every time someone talks about\npurchasing with bitcoins, everyone just says ‘I don’t wanna be like the guy who\nbought pizza with his bitcoins.’ Did anyone know bitcoin was going to be worth\n60k 10 years ago? Fuck no. This guy normalized paying with…",
  "original_created_utc": 1617159123,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这家伙没有得到应有的尊重。每次有人谈论\n每个人都会说 \"我可不想成为那个用比特币购买的人\n用他的比特币买了披萨。有谁知道比特币会值钱吗？\n10年前的6万？他妈的没有。这家伙将支付正常化...",
      "title": "那个为了一个披萨卖了一万个BTC的人不是弱智。他把它用在了它所要做的事情上 He used it for what it was intended for 并帮助合法化了这个运动 and helped legitimize the movement."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這傢伙沒有得到應有的尊重。每次有人談論\n每個人都會說 \"我可不想成爲那個用比特幣購買的人\n用他的比特幣買了披薩。有誰知道比特幣會值錢嗎？\n10年前的6萬？他媽的沒有。這傢伙將支付正常化...",
      "title": "那個爲了一個披薩賣了一萬個BTC的人不是弱智。他把它用在了它所要做的事情上 He used it for what it was intended for 並幫助合法化了這個運動 and helped legitimize the movement."
    }
  ],
  "title": "The guy who sold 10, 000 BTC For a pizza is not retarded. He used it for what it was intended for and helped legitimize the movement",
  "created_utc": 1617169313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This guy does not get the respect he deserves. Every time someone talks about purchasing with bitcoins, everyone just says ‘I don’t wanna be like the guy who bought pizza with his bitcoins.’ Did anyone know bitcoin was going to be worth 60k 10 years ago? Fuck no. This guy normalized paying with bitcoin so other people could take it seriously, and here it is years later performing stronger than most fiat currencies. Satoshi nakamoto created bitcoin with the intention of replacing the centralized monetary system. Give the pizza lover the respect he deserves.</p>\n</div><!-- SC_ON -->",
  "score": 5557,
  "permalink": "/r/Bitcoin/comments/mgwiry/the_guy_who_sold_10_000_btc_for_a_pizza_is_not/",
  "subreddit": "Bitcoin",
  "id": "mgwiry",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357133966
}