{
  "author": "Jxntb733",
  "original_created_utc": 1646598985,
  "title": "How to explain Bitcoin to someone in 12 seconds.",
  "created_utc": 1646621162,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Have you ever mentioned Bitcoin to someone and they ask ‘Oh yeah I heard about that, what is Bitcoin anyway?’             &lt;/p&gt;\n\n&lt;p&gt;And you kind of just stutter for a hot second as like a million thoughts flood your mind - history of money - gold standard - Brettonwoods - fiat - computers - hashes - housing crash - mtgox - DeFi - miners - inflation - consensus mechanisms - market caps - bonds - yield - Merkel trees - SHA-256 - Could probably talk for hours about economic possibilities.        &lt;/p&gt;\n\n&lt;p&gt;Here are the easy answers:&lt;br/&gt;\n1). Bitcoin is just a money sending system, like the VISA network, but it’s now owned by anyone, it’s open source software. Really good for instant settlements, you can trade it back to USD in one click, while banks take a few days.       &lt;/p&gt;\n\n&lt;p&gt;2) Bitcoin is like a digital dollar, but instead of the US government making more of it whenever they want, it’s made on orderly computers by anyone who runs the Bitcoin software. The more computers the more strength the network has. It goes up in price because people find its digital value more and more worthwhile.           &lt;/p&gt;\n\n&lt;p&gt;3) Bitcoin is just digital money. Thing is it wasn’t once not digital and made digital like the dollar was, it was designed on computers using advanced security software with its continued computational integrity in mind.                       &lt;/p&gt;\n\n&lt;p&gt;Those are my best quick answers. How would you elevator pitch Bitcoin?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/t87re9/how_to_explain_bitcoin_to_someone_in_12_seconds/",
  "subreddit": "CryptoCurrency",
  "id": "t87re9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Have you ever mentioned Bitcoin to someone and they ask ‘Oh yeah I heard about\nthat, what is Bitcoin anyway?’\n\nAnd you kind of just stutter for a hot second as like a million thoughts flood\nyour mind - history of money - gold standard - Brettonwoods - fiat - computers -\nhashes - housing crash -…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインの話をしたときに、「ああ、聞いたことあるよ」と言われたことはありませんか？\nビットコインってなんですか？\n\nそして、あなたは、100万もの考えが溢れるように、一瞬、吃驚してしまうのです。\nお金の歴史、金本位制、ブレトンウッズ、不換紙幣、コンピューター、などなど。\nハッシュ - 住宅クラッシュ -...",
      "title": "12秒でわかるビットコインの説明の仕方。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你是否曾经向别人提到过比特币，他们会问'哦，是的，我听说过'。\n我听说过，比特币到底是什么？\n\n然后你就在一瞬间结巴了，因为有无数的想法涌上心头。\n货币的历史--金本位制--布雷顿森林体系--法币--计算机--哈希斯--住房等。\n哈希值 - 房屋崩盘 -...",
      "title": "如何在12秒内向别人解释比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你是否曾經向別人提到過比特幣，他們會問'哦，是的，我聽說過'。\n我聽說過，比特幣到底是什麼？\n\n然後你就在一瞬間結巴了，因爲有無數的想法湧上心頭。\n貨幣的歷史--金本位制--佈雷頓森林體系--法幣--計算機--哈希斯--住房等。\n哈希值 - 房屋崩盤 -...",
      "title": "如何在12秒內向別人解釋比特幣。"
    }
  ]
}