{
  "author": "TerminusFox",
  "the_new_excerpt": "I was learning IT stuff and got stuck at a wall with imposter syndrome and was\nscared I wasn't good enough, but godfather offered the advice in the question.\n\"Son, even if you were mediocre, as long as you're decent to be around, they'll\nhelp you or give you a pass, for the most part.\"\n\nEssentially,…",
  "original_created_utc": 1617056029,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在学习IT的东西时，被冒牌货综合症卡在了墙上，被\n怕我不够优秀，但干爹在问题中提出了建议。\n\"孩子，就算你再平庸，只要你体面地待在身边，他们也会\n帮助你或给你一个通行证，在大多数情况下。\"\n\n基本上，...",
      "title": "这句话的真实性如何？\"大多数人宁愿和一个工作平庸，但相处愉快的人一起工作，也不愿和一个特别优秀，但却是个混蛋的人一起工作\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在學習IT的東西時，被冒牌貨綜合症卡在了牆上，被\n怕我不夠優秀，但乾爹在問題中提出了建議。\n\"孩子，就算你再平庸，只要你體面地待在身邊，他們也會\n幫助你或給你一個通行證，在大多數情況下。\"\n\n基本上，...",
      "title": "這句話的真實性如何？\"大多數人寧願和一個工作平庸，但相處愉快的人一起工作，也不願和一個特別優秀，但卻是個混蛋的人一起工作\"？"
    }
  ],
  "title": "How true is this, \"Most people would rather work with someone who's mediocre at their job, but pleasant to be around, than a person who's exceptionally good, but a dick\"?",
  "created_utc": 1617061813,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was learning IT stuff and got stuck at a wall with imposter syndrome and was scared I wasn&#39;t good enough, but godfather offered the advice in the question. &quot;Son, even if you were mediocre, as long as you&#39;re decent to be around, they&#39;ll help you or give you a pass, for the most part.&quot;</p>\n\n<p>Essentially, he was saying, even if I was an IT God/Rockstar engineer, if I was a complete asshole, no one would give a fuck, and would hope I&#39;d leave the company, even if I made everyone&#39;s job easier.</p>\n\n<p>Has that been true of your experience??</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/NoStupidQuestions/comments/mg10fe/how_true_is_this_most_people_would_rather_work/",
  "subreddit": "NoStupidQuestions",
  "id": "mg10fe",
  "is_self": true,
  "media": null,
  "is_video": false
}