{
  "author": "Dramatic-Shower3028",
  "the_new_excerpt": "So I'm sure everyone has seen the news on national ketchup shortage. In the past\nwhen news like this broke like the toilet paper situation. The toilet paper\nstocks rocketed. Sanitizer shortages, same thing.\n\nKHC was green today, but really not that great and low on volume. Any ideas on\nwhy the small…",
  "original_created_utc": 1617908595,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ケチャップが全国的に不足しているというニュースは、皆さんもご覧になったと思います。過去には\nこのようなニュースが流れたとき、トイレットペーパーの状況のように トイレットペーパーは\n株が高騰しました。除菌剤の不足も同様です。\n\nKHCは今日、グリーンだったが、実際にはそれほど良くなく、出来高も少なかった。何かアイデアはありませんか？\nなぜ小さいのか...",
      "title": "$KHCのブル・テーゼ。この株は過小評価されており、大衆には気づかれていないと思う。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以相信大家都看到了全国番茄酱短缺的新闻。在过去\n当这样的新闻像卫生纸的情况下爆发。厕纸\n股价暴涨。消毒液短缺，同样的道理。\n\nKHC今天绿了，但真的没那么大，成交量也很低。有什么想法吗？\n为什么小...",
      "title": "$KHC牛股论。这只股票的价值被低估了，我认为是没有被大众注意到的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以相信大家都看到了全國番茄醬短缺的新聞。在過去\n當這樣的新聞像衛生紙的情況下爆發。廁紙\n股價暴漲。消毒液短缺，同樣的道理。\n\nKHC今天綠了，但真的沒那麼大，成交量也很低。有什麼想法嗎？\n爲什麼小...",
      "title": "$KHC牛股論。這隻股票的價值被低估了，我認爲是沒有被大衆注意到的。"
    }
  ],
  "title": "$KHC bull thesis. This stock is undervalued and I think is going unnoticed by the masses.",
  "created_utc": 1617911358,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m sure everyone has seen the news on national ketchup shortage.  In the past when news like this broke like the toilet paper situation. The toilet paper stocks rocketed.   Sanitizer shortages, same thing.  </p>\n\n<p>KHC was green today, but really not that great and low on volume.  Any ideas on why the small price action?\nJust sensory overload, and it was overlooked?   </p>\n\n<p>This stock is top 5 in Buffet&#39;s and Burry&#39;s portfolio. The company has made all the right moves in terms of paying down debt and making the momentum go the right direction as of late.</p>\n\n<p>I&#39;m thinking that being that we are sitting at a 52 week high there is a mental resistance line to cross. However if you remove that it really looks like this stock price is just ready to take off.</p>\n\n<p>Some interesting catalyst I noticed there has been over $65 million in block purchases made.  I&#39;m not an expert on these but I couldn&#39;t see any other block purchases anywhere near this size on khc in recent past.  (If I&#39;m wrong on this, please show me where to find it.)</p>\n\n<p>Assuming that Burry has exercised his call options or will rather than selling, Buffets giant position, the block purchases today, the consistent upwards momentum, the increase in demand and profitability on the ketchup packets.      Things look really really good on this company.  </p>\n\n<p>When first researching this stock I really didn&#39;t fully understand all of the fundamentals that have been falling in place over the last year to get us to this point.   I looked at this stock as a great hedge if and when the market crashes as consumers rotate back into home cooked meals and groceries with less eating out to save money.</p>\n\n<p>I see this article and it was the final piece of the puzzle for me.   If we have another wave of covid,. KHC goes up. If everything opens up, KHC goes up.   If stock market keeps ripping and roaring, KHC goes up.   Market and economy crash, KHC goes way up.    </p>\n\n<p>Extremely Bullish on this company.</p>\n\n<p>I am certainly no expert but I love this brand right now.<br/>\nIf anyone wants to add to my thoughts or even poke holes in my statements I encourage it.   Id like to know what everyone else thinks about this company.  </p>\n\n<p>Edit update:\nOpen options interest for this week are trending 100% bullish sentiment</p>\n\n<p>Today they announced a new marshmallow snack for grab and go has station type purchases.    Marshmallow is one of the highest profit margins of any food products.</p>\n\n<p>Article \n<a href=\"https://www.google.com/amp/s/www.yahoo.com/amphtml/entertainment/ketchup-shortage-affecting-restaurants-across-195912767.html\">Heinz</a></p>\n</div><!-- SC_ON -->",
  "score": 495,
  "permalink": "/r/investing/comments/mmywpw/khc_bull_thesis_this_stock_is_undervalued_and_i/",
  "subreddit": "investing",
  "id": "mmywpw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616793
}