{
  "author": "DaddySkates",
  "original_created_utc": 1631952282,
  "title": "Save yourself trouble and just stay quiet about investing in crypto",
  "created_utc": 1631961095,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My only friend in the whole wide world just got into crypto because I told him that I made a small profit since I started. My pal went ahead and started watching bitboy-like youtubers and lost a whole lotta money. Now he is trying to blame it on me for telling him to get into crypto. </p>\n\n<p>I wholeheartedly believe that telling your friends or family about investing in crypto is just asking for trouble. Money can be evil and can destroy many things, also long-time friendships and even family. I’ve seen it before with some of my relatives and you don’t want that.</p>\n\n<p>And family dinners will be far less enjoyable when crypto will dip and they will start lecturing you with “I knew that computer money is a hoax”. They don’t understand crypto. They don’t even remotely understand what it’s trying to achieve.</p>\n\n<p>Keep your investments to yourself. There is no need to announce it to everyone. You don’t go around telling people how thick your wallet is right? You should stay safe. Be a Satoshi, an unknown figure from the darkness of the web. Banks and government know about you too much already, no need to give them any additional information.</p>\n\n<p>Have a superb weekend my bestest lads and lasses</p>\n</div><!-- SC_ON -->",
  "score": 377,
  "permalink": "/r/CryptoCurrency/comments/pqidia/save_yourself_trouble_and_just_stay_quiet_about/",
  "subreddit": "CryptoCurrency",
  "id": "pqidia",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My only friend in the whole wide world just got into crypto because I told him\nthat I made a small profit since I started. My pal went ahead and started\nwatching bitboy-like youtubers and lost a whole lotta money. Now he is trying to\nblame it on me for telling him to get into crypto.\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界で唯一の友人が暗号化を始めました。\n始めてから少しずつ利益が出ていると話したからです。その友人は先に進み、ビットボーイ的なユーチューバーを見始めて\nビットボーイ的なユーチューバーを見て大損した。今度は私のせいにしようとしている。\n暗号に手を出すように言った私のせいにしようとしています。\n\nI...",
      "title": "トラブルを避けるためにも、暗号への投資については黙っていましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在整个世界上唯一的朋友刚刚进入加密货币领域，因为我告诉他\n因为我告诉他，我从一开始就赚了点钱。我的朋友继续前进并开始\n看比特币的优酷，结果输了一大笔钱。现在他正试图\n归咎于我告诉他进入加密货币。\n\nI...",
      "title": "省去麻烦，对投资加密货币保持沉默就可以了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在整個世界上唯一的朋友剛剛進入加密貨幣領域，因爲我告訴他\n因爲我告訴他，我從一開始就賺了點錢。我的朋友繼續前進並開始\n看比特幣的優酷，結果輸了一大筆錢。現在他正試圖\n歸咎於我告訴他進入加密貨幣。\n\nI...",
      "title": "省去麻煩，對投資加密貨幣保持沉默就可以了"
    }
  ]
}