{
  "author": "alexb_090",
  "original_created_utc": 1634303985,
  "title": "My professor is an early adopter who probably never sold.",
  "created_utc": 1634311925,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m a 3rd year college student, and I recently had a professor who bought into Bitcoin back in 2010. He can’t tell us how much, but it was obviously a significant amount. How do I know? Because every year, he gives a crypto seminar and gives away Bitcoin to all the students who send their wallet. Last year, there were about 350 students in the seminar, and he gave us each 10 dollars. So clearly, he’s not hurting for cash. </p>\n\n<p>For a few years, he even gave out physical bitcoins (if you don’t know, physical bitcoins are hardware wallets with 1 Bitcoin on them that look like an actual coin. Very cool) to a few of the lucky students that attended. He also helped spread adoption by writing a book called “Bitcoin for the befuddled” way back in 2013 to explain blockchain in a simple to understand way. And now he is the editor of a blockchain technical development journal, and is implementing a blockchain degree concentration at the university. </p>\n\n<p>People like this are how blockchain really gets adopted, not by banks and corporations co-opting the technology. There isn’t really a main point, just wanted to share a cool story about an early blockchain adopter. I guess I would just say to have conviction in your beliefs and success will come.</p>\n\n<p>ETA: The journal is called “Ledger” if anyone wants some reading.</p>\n</div><!-- SC_ON -->",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/q8oauw/my_professor_is_an_early_adopter_who_probably/",
  "subreddit": "CryptoCurrency",
  "id": "q8oauw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a 3rd year college student, and I recently had a professor who bought into\nBitcoin back in 2010. He can’t tell us how much, but it was obviously a\nsignificant amount. How do I know? Because every year, he gives a crypto seminar\nand gives away Bitcoin to all the students who send their wallet.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は大学3年生なのですが、最近、教授が買った\n2010年にビットコインを購入した教授がいました。金額は教えてくれませんでしたが、明らかにかなりの額でした。\nかなりの額だったようです。なぜ知っているかというと 毎年、教授は暗号セミナーを開催していて\nウォレット（....）を送った学生全員にビットコインをプレゼントしています。",
      "title": "私の教授はアーリーアダプターで、おそらく売れなかったと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个大学三年级的学生，我最近有一个教授在2010年买了\n比特币。他不能告诉我们多少钱，但显然是一个\n巨大的数额。我怎么知道？因为每年他都会举办一个加密货币研讨会\n并向所有发送钱包的学生赠送比特币....。",
      "title": "我的教授是一个早期采用者，他可能从未出售过。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個大學三年級的學生，我最近有一個教授在2010年買了\n比特幣。他不能告訴我們多少錢，但顯然是一個\n巨大的數額。我怎麼知道？因爲每年他都會舉辦一個加密貨幣研討會\n並向所有發送錢包的學生贈送比特幣....。",
      "title": "我的教授是一個早期採用者，他可能從未出售過。"
    }
  ]
}