{
  "author": "Guy_PCS",
  "the_new_excerpt": "1. How rich other people are getting. John Pierpont Morgan is attributed with\nthe quote, “Nothing so undermines your financial judgement as the sight of your\nneighbor getting rich.”\n\nAnd JP didn’t have to deal with friends, influencers and celebrities constantly\nbragging about their lifestyle and…",
  "original_created_utc": 1622674683,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1. 他の人がどれだけお金持ちになっているか ジョン・ピアポント・モルガンは、次のように言われています。\n隣人が金持ちになっているのを見るほど、あなたの経済的判断を鈍らせるものはない」という言葉を残しています。\nほど金融判断を狂わせるものはない。\"\n\nJPは、友人やインフルエンサー、有名人が自分のライフスタイルを常に自慢しているのに付き合う必要はありませんでした。\n友人やインフルエンサー、有名人が自分のライフスタイルを自慢したり",
      "title": "投資家として気にしてはいけないこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1. 其他人变得多么富有。 约翰-皮尔庞特-摩根被认为是\n这句话：\"没有什么能比看到你的邻居发财更能破坏你的财务判断力了。\n邻居发财的景象\"。\n\n而且，JP不必处理朋友、有影响力的人和名人不断吹嘘他们的生活方式和......。\n夸耀他们的生活方式和...",
      "title": "作为一个投资者，你不应该关心的事情"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1. 其他人變得多麼富有。 約翰-皮爾龐特-摩根被認爲是\n這句話：\"沒有什麼能比看到你的鄰居發財更能破壞你的財務判斷力了。\n鄰居發財的景象\"。\n\n而且，JP不必處理朋友、有影響力的人和名人不斷吹噓他們的生活方式和......。\n誇耀他們的生活方式和...",
      "title": "作爲一個投資者，你不應該關心的事情"
    }
  ],
  "title": "Things You Shouldn’t Care About as an Investor",
  "created_utc": 1622680226,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>1. How rich other people are getting.</strong> John Pierpont Morgan is attributed with the quote, “Nothing so undermines your financial judgement as the sight of your neighbor getting rich.”</p>\n\n<p>And JP didn’t have to deal with friends, influencers and celebrities constantly bragging about their lifestyle and wealth on social media all day long. There will always be people with more success, prestige, money and accolades than you.</p>\n\n<p>Easier said than done but not worrying about how much money other people are making can save you a lot of unnecessary stress and angst.</p>\n\n<p><strong>2. The amount of time and effort you put into your investments.</strong> In many areas of life, trying harder leads to better results. That’s not the case when it comes to investing. In fact, trying harder and paying more attention to your investments will often lead to worse results.</p>\n\n<p>There are no extra points for degree of difficulty when it comes to the markets.</p>\n\n<p>Most investors would be better served doing less, not more.</p>\n\n<p><strong>3. Timing the market perfectly.</strong> Investors waste far too much time trying to find the perfect entry point for their investments. That perfect entry point is only known with the benefit of hindsight. You’re far better off putting your money to work when you have some money to put to work and letting compound interest make up for any ill-timed purchases.</p>\n\n<p>Regular reminder that a long time horizon can trump even the most poorly timed of investments:</p>\n\n<p><strong>4. Success in other areas of your life.</strong> Your biggest risk as an investor depends a lot on your personality, emotional make-up and station in life.</p>\n\n<p>For more seasoned investors, your experience can actually work against you if it allows you to become overconfident in your own abilities. This is true of people who have found success in other areas of their life as well.</p>\n\n<p>The worst investors are often those who assume success in their career automatically translates to success investing in the markets. It doesn’t work like that.</p>\n\n<p><strong>5. Your IQ.</strong> EQ matters more than IQ when investing.</p>\n\n<p>Yes, some level of intelligence is required but as Warren Buffett once said, “Investing is not a game where the guy with the 160 IQ beats the guy with the 130 IQ. Once you have ordinary intelligence, what you need is the temperament to control the urges that get other people into trouble in investing.”</p>\n\n<p>There are plenty of intelligent people involved with the markets but not nearly as many who have control over their reactions.</p>\n\n<p>Intelligence alone does not guarantee success in the markets.</p>\n</div><!-- SC_ON -->",
  "score": 556,
  "permalink": "/r/investing/comments/nqytan/things_you_shouldnt_care_about_as_an_investor/",
  "subreddit": "investing",
  "id": "nqytan",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300240
}