{
  "author": "wiggle-le-air",
  "the_new_excerpt": "I recently started dabbling with the stock market and have roughly $250 in\ndifferent tech stocks. I know that's not a lot by most standards but I am just\ntesting the water.\n\nI am a college student and have $8000 in a savings account just sitting there\ndoing nothing. With the impending threat of high…",
  "original_created_utc": 1617823958,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、株式市場に手を出し始め、さまざまなハイテク株に約250ドルを投資しています。\nのハイテク株を持っています。普通に考えれば大した額ではないと思いますが、私はただ単に\n試しているところです。\n\n私は大学生で、8000ドルを普通預金に預けていますが、何もしていません。\n何もしていません。差し迫った高金利の脅威にさらされています。",
      "title": "今、どのETFが良い選択肢なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近开始涉足股市，大约有250美元在\n不同的科技股。我知道按大多数标准来说，这不是很多，但我只是\n试水。\n\n我是一名大学生，储蓄账户里有8000元钱，就这么放着。\n什么都不做。随着即将到来的威胁，高...",
      "title": "现在哪些ETF是不错的选择？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近開始涉足股市，大約有250美元在\n不同的科技股。我知道按大多數標準來說，這不是很多，但我只是\n試水。\n\n我是一名大學生，儲蓄賬戶裏有8000元錢，就這麼放着。\n什麼都不做。隨着即將到來的威脅，高...",
      "title": "現在哪些ETF是不錯的選擇？"
    }
  ],
  "title": "Which ETFs are good options right now?",
  "created_utc": 1617910779,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently started dabbling with the stock market and have roughly $250 in different tech stocks. I know that&#39;s not a lot by most standards but I am just testing the water.</p>\n\n<p>I am a college student and have $8000 in a savings account just sitting there doing nothing. With the impending threat of high inflation rates I am keen on the idea of putting some (maybe 3000) into one or two ETFs.</p>\n\n<p>Which ETF do you recommend? Should I even buy into an ETF?</p>\n\n<p>I really like the model of ARKK but it seems like a more risky investment and there are lots of mixed reviews about it. Lots of analysis says that ARKK is too high to buy right now but it is down nearly $40 from all-time highs. </p>\n\n<p>Other common ETFs like QQQ and SPY are at all-time highs and I wonder if I would pay more money for less value with those in this current market condition.</p>\n\n<p>Are there a bunch of people like me buying ETFs driving the price up past what the ETFs are worth?</p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/stocks/comments/mm9yza/which_etfs_are_good_options_right_now/",
  "subreddit": "stocks",
  "id": "mm9yza",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617812
}