{
  "author": "chomskian1",
  "original_created_utc": 1629685124,
  "title": "REMEMBER: What a ride it was since the last time we touched 50k.",
  "created_utc": 1629693096,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now that we are minutes away from breaking 50k, I want us all to take a minute and make some memory. Specially on the bumpy road we had here since the last time BTC departed 50 grand.</p>\n\n<p>Remember how China kicked miners, and spreaded powerful FUD, taking miners elsewhere and opening new mines in many countries.</p>\n\n<p>Remember how Elon stopped accepting BTC and partially caused the spiral down that took BTC to 28k.</p>\n\n<p>Remember the billions liquidated in crypto longs.</p>\n\n<p>Remember the discussion about BTC , energy consumption and the enviroment that this movement triggered.</p>\n\n<p>Remember Microstrategy taking a loan of around half a billion to buy more BTC at 37k.</p>\n\n<p>Remember seeing ADA under $1. Yeah I know.</p>\n\n<p>Also, Moons for like 7 cents....</p>\n\n<p>Remember the Doge rollercoaster, and the rise of memecoins. Story still unfolding...</p>\n\n<p>Out of the blue, El Salvador became the first country to make BTC a legal tender!</p>\n\n<p>Oh and Mark Cuban got rugpulled.</p>\n\n<p>Remember that someone killed John McAfee, holy shit. Does anyone know what even happened to this guy?</p>\n\n<p>Remember the Amazon tease.</p>\n\n<p>Britney Spears has been using BTC since 2014? </p>\n\n<p>Mandatory remember: fuck robinhood.</p>\n\n<p>Remember all the FUD, and how people was sure of BTC hitting 20k or 18k.</p>\n\n<p><strong>And most importantly, remember all you learned since then.</strong> Most of us, didn&#39;t even know what a smart contract was back in april, or used to read PoS as &quot;piece of shit&quot;.</p>\n\n<p>Hell I think even politicians have learnt some things, at least the proposal to ammend the Infrastructure Bill showed a couple of senators either knew more about the issue or got better advisors.</p>\n\n<p>All in all, when we see the news reporting BTC at 50k and a new FOMO cycle all around, it will have such a different meaning.</p>\n\n<p>This will be a great season ending, I&#39;m eager to see what will come next.</p>\n\n<p>Edit: The train has left the 50k station, see you at 100k</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/p9qc7r/remember_what_a_ride_it_was_since_the_last_time/",
  "subreddit": "CryptoCurrency",
  "id": "p9qc7r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Now that we are minutes away from breaking 50k, I want us all to take a minute\nand make some memory. Specially on the bumpy road we had here since the last\ntime BTC departed 50 grand.\n\nRemember how China kicked miners, and spreaded powerful FUD, taking miners\nelsewhere and opening new mines in many…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5万人突破まであと数分となった今、皆さんにはちょっとした思い出を作ってほしいと思います。\n思い出を作ってください。特に、前回BTCが50,000ドルを突破した時からのデコボコ道について。\n特に、BTCが50,000ドルを突破した時からのデコボコ道について。\n\n中国が鉱夫を蹴散らし、強力なFUDを撒き散らし、鉱夫を他の場所に連れて行き、新しい鉱山を開いたことを思い出してください。\n他の場所に鉱夫を連れて行き、多くの場所で新しい鉱山を開いたことを覚えています...",
      "title": "REMEMBER: 前回50Kに触れた時から、何度も走っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在我们离突破5万还有几分钟的时间，我希望我们都能花一分钟时间\n并留下一些记忆。特别是在我们的坎坷道路上，自从上次\nBTC突破5万的时候。\n\n还记得中国是如何踢掉矿工的，并散布强大的FUD，把矿工带到其他地方，并在其他地方开设新矿。\n把矿工带到其他地方，并在许多地方开设新的矿场。",
      "title": "记得：自从上次我们触及50千米后，这是一次多么大的旅程。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在我們離突破5萬還有幾分鐘的時間，我希望我們都能花一分鐘時間\n並留下一些記憶。特別是在我們的坎坷道路上，自從上次\nBTC突破5萬的時候。\n\n還記得中國是如何踢掉礦工的，並散佈強大的FUD，把礦工帶到其他地方，並在其他地方開設新礦。\n把礦工帶到其他地方，並在許多地方開設新的礦場。",
      "title": "記得：自從上次我們觸及50千米後，這是一次多麼大的旅程。"
    }
  ]
}