{
  "author": "cumfilleddonut8",
  "original_created_utc": 1639787020,
  "title": "People always say drug addiction ruins their lives, but weed hasn't lowered my quality of life. Why is that?",
  "created_utc": 1639824266,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I smoke weed nightly and look forward to it every day. I don&amp;#39;t feel or act any differently than before I started. I&amp;#39;m in school and work and I&amp;#39;m able to not only get through it but excel. Its crazy saying this but weed even increased my motivation (when I&amp;#39;m not high) and makes me wake up consistently at around 7am without an alarm (I used to wake up after 10am), probably because I&amp;#39;m getting better sleep.&lt;/p&gt;\n\n&lt;p&gt;My family still doesn&amp;#39;t know I smoke and they think weed is some kind of scary life ruiner. Why has my life only gotten better since I discovered weed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/riutmk/people_always_say_drug_addiction_ruins_their/",
  "subreddit": "NoStupidQuestions",
  "id": "riutmk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I smoke weed nightly and look forward to it every day. I don't feel or act any\ndifferently than before I started. I'm in school and work and I'm able to not\nonly get through it but excel. Its crazy saying this but weed even increased my\nmotivation (when I'm not high) and makes me wake up…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎晩大麻を吸い、毎日楽しみにしています。私は何も感じないし、何も行動しない。\n始める前と違っている。学校にも会社にも通い、仕事もできるようになりました。\n乗り切るだけでなく、優秀な成績を残すことができます。こんなことを言うのは変ですが、葉っぱは私の人生をより豊かにしてくれました。\nハイになっていないときは）やる気が出てきて、目が覚めるんです...。",
      "title": "薬物中毒は人生を台無しにすると言われるが、大麻は私の人生の質を下げていない。なぜでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每晚都抽大麻，每天都期待着它的到来。我没有任何感觉或行为\n与我开始吸食前没有任何不同。我在学校和工作中，我不仅能够\n我在学校和工作中，不仅能够度过难关，而且还很出色。这样说很疯狂，但大麻甚至增加了我的\n动机（当我不高的时候），并使我醒过来......",
      "title": "人们总是说毒瘾毁了他们的生活，但大麻并没有降低我的生活质量。这是为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每晚都抽大麻，每天都期待着它的到來。我沒有任何感覺或行爲\n與我開始吸食前沒有任何不同。我在學校和工作中，我不僅能夠\n我在學校和工作中，不僅能夠度過難關，而且還很出色。這樣說很瘋狂，但大麻甚至增加了我的\n動機（當我不高的時候），並使我醒過來......",
      "title": "人們總是說毒癮毀了他們的生活，但大麻並沒有降低我的生活質量。這是爲什麼呢？"
    }
  ]
}