{
  "author": "ToHallowMySleep",
  "the_new_excerpt": "Even given the differences in availability of ingredients between the two\ncontinents, you would think the food that would stick would be the ones the\nimmigrants brought with them natively. With Chinese food, Cantonese had the\nupper hand in America for precisely this reason for a long time.\n\nWhat…",
  "original_created_utc": 1612777908,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "即使考虑到二者在原料供应上的不同\n大陆，你会认为食物会坚持的是那些\n移民带来的本土。有了中国菜，广东人有了\n在美国的上风，正是因为这个原因，长期以来。\n\n什么...",
      "title": "既然最初移民到美国的意大利人大部分来自南方，为什么美国流行的意大利菜（Lasagne，Bolognese，Baloney，Alfredo/creamier sauce，Pollo/Vitello/Melanzane Parmigiana，Tiramisu）大部分都是来自北方？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "即使考慮到二者在原料供應上的不同\n大陸，你會認爲食物會堅持的是那些\n移民帶來的本土。有了中國菜，廣東人有了\n在美國的上風，正是因爲這個原因，長期以來。\n\n什麼...",
      "title": "既然最初移民到美國的意大利人大部分來自南方，爲什麼美國流行的意大利菜（Lasagne，Bolognese，Baloney，Alfredo/creamier sauce，Pollo/Vitello/Melanzane Parmigiana，Tiramisu）大部分都是來自北方？"
    }
  ],
  "title": "Given that the majority of original Italian immigrants to America came from the South, how come most of the popular Italian dishes in America (Lasagne, Bolognese, Baloney, Alfredo/creamier sauce, Pollo/Vitello/Melanzane Parmigiana, Tiramisu) are far more Northern in origin?",
  "created_utc": 1612795403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Even given the differences in availability of ingredients between the two continents, you would think the food that would stick would be the ones the immigrants brought with them natively.  With Chinese food, Cantonese had the upper hand in America for precisely this reason for a long time.</p>\n\n<p>What caused this shift in cooking style between the immigrants&#39; own food style, and the one that was more adopted by America?  Was it the American palate, the easier access to &quot;richer&quot; ingredients like meat, more limited access to some fresh ingredients, or something else?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/lf8l59/given_that_the_majority_of_original_italian/",
  "subreddit": "AskHistorians",
  "id": "lf8l59",
  "is_self": true,
  "media": null,
  "is_video": false
}