{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Look everyone's portfolio is likely looking red, so here's what you need to do: Likely doing nothing for now is the right move. Don't sell at a loss. Work more hours so you have more money to buy solid, economy defining stocks at a fraction of their price they once were and build your retirement portfolio. (PYPL for example, way oversold with a 26 RSI). Downward pressure (bear market) is not forever and doesn't last as long as upward momentum (bull market). In the end, stocks of financially healthy companies will continue to go up. They always have and will.\n\nAs long as you're patient and investing in solid companies with healthy balance sheets poised for future growth (even if growth slows in 2022), you'll be fine.\n\nThe market is forward looking. Once it gets a grip on where the Fed wants to take rates (likely around 2% by year-end with 50bps the first 2 rate hikes and 25bps thereafter). They will then continue to monitor if inflation is going down from CPI data before hiking more. \n\nInflation will go down. Odds are we are here at the peak of inflation currently as we sit. Used and new car prices are not as expensive as they once were and are starting to come down. In my opinion I feel the economy will slow down substantially simply as a result of high gas and food prices re-routing what people can or can't spend their money on. \n\nCovid for the majority of the world except China has pretty much subsided. People will go out and spend money, that's a given. However, they will be limited on how much they can go out and spend due to the increase in food and gas. Once consumer spending decreases, inflation will also decrease. \n\nPrices of goods only go up if people are willing to pay them. Once people stop paying sky high prices for assets and commodities, prices will come back down. I think this will happen relatively soon.\n\nA simple look at the stock market is a prime example. The market is forward looking like I said. People are not willing to pay high multiples of companies due to slower growth in the future. Any slowdown in future growth in a company's quarterly earnings will drive the stock price down. Why? People don't want to pay high prices for a company that's not growing as fast, and nor should they. \n\nThe Fed technically hasn't even done anything beside 'threaten' to raise rates so far. But a hawkish Fed (an aggressive rate hike minded Fed), is scary to the market. If they hike rates too aggressively and slow down the economy too much, then we'll have a recession (albeit a short one in my opinion, but inflation would cease to exist pretty much instantly going this route). \n\nSo far all we have endured is a 25bps hike. With the current Fed rate at 0.25%. Likely to go up to 0.75% on Tuesday, May 3rd. But if they say they want to tighten rates more aggressively than 50bps, the market will naturally have a huge negative reaction because a future priced market does not like slow growth. However this route will end inflation quicker, so the market can go back to normal once the dust settles.\n\nAgain, all the Fed has done so far is mostly talk. They haven't really taken much action yet as far as tightening goes. I'd say the market is currently pricing in Fed rates of around 3% which is taking us well into 2023. Which means by 2023 the market will start pricing in growth for 2024. This is when I think the growth will resume its bullish trajectory. Until then we are likely to remain volatile. \n\nTLDR: Long story short, be patient. Do not stress over what you cannot control. Let the Fed do their job and you do yours. Earn money. Control the budget and buy the dip if you have the means to do so. Real wealth is built during markets like this. Once the bull market resumes, make sure you are on the train.",
  "author_fullname": "t2_xv4oj",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "The stock market is the greatest tool to build wealth, if you're patient.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_ufxal8",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.79,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 66,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": "",
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 66,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1651402712,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1651401953,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Look everyone&amp;#39;s portfolio is likely looking red, so here&amp;#39;s what you need to do: Likely doing nothing for now is the right move. Don&amp;#39;t sell at a loss. Work more hours so you have more money to buy solid, economy defining stocks at a fraction of their price they once were and build your retirement portfolio. (PYPL for example, way oversold with a 26 RSI). Downward pressure (bear market) is not forever and doesn&amp;#39;t last as long as upward momentum (bull market). In the end, stocks of financially healthy companies will continue to go up. They always have and will.&lt;/p&gt;\n\n&lt;p&gt;As long as you&amp;#39;re patient and investing in solid companies with healthy balance sheets poised for future growth (even if growth slows in 2022), you&amp;#39;ll be fine.&lt;/p&gt;\n\n&lt;p&gt;The market is forward looking. Once it gets a grip on where the Fed wants to take rates (likely around 2% by year-end with 50bps the first 2 rate hikes and 25bps thereafter). They will then continue to monitor if inflation is going down from CPI data before hiking more. &lt;/p&gt;\n\n&lt;p&gt;Inflation will go down. Odds are we are here at the peak of inflation currently as we sit. Used and new car prices are not as expensive as they once were and are starting to come down. In my opinion I feel the economy will slow down substantially simply as a result of high gas and food prices re-routing what people can or can&amp;#39;t spend their money on. &lt;/p&gt;\n\n&lt;p&gt;Covid for the majority of the world except China has pretty much subsided. People will go out and spend money, that&amp;#39;s a given. However, they will be limited on how much they can go out and spend due to the increase in food and gas. Once consumer spending decreases, inflation will also decrease. &lt;/p&gt;\n\n&lt;p&gt;Prices of goods only go up if people are willing to pay them. Once people stop paying sky high prices for assets and commodities, prices will come back down. I think this will happen relatively soon.&lt;/p&gt;\n\n&lt;p&gt;A simple look at the stock market is a prime example. The market is forward looking like I said. People are not willing to pay high multiples of companies due to slower growth in the future. Any slowdown in future growth in a company&amp;#39;s quarterly earnings will drive the stock price down. Why? People don&amp;#39;t want to pay high prices for a company that&amp;#39;s not growing as fast, and nor should they. &lt;/p&gt;\n\n&lt;p&gt;The Fed technically hasn&amp;#39;t even done anything beside &amp;#39;threaten&amp;#39; to raise rates so far. But a hawkish Fed (an aggressive rate hike minded Fed), is scary to the market. If they hike rates too aggressively and slow down the economy too much, then we&amp;#39;ll have a recession (albeit a short one in my opinion, but inflation would cease to exist pretty much instantly going this route). &lt;/p&gt;\n\n&lt;p&gt;So far all we have endured is a 25bps hike. With the current Fed rate at 0.25%. Likely to go up to 0.75% on Tuesday, May 3rd. But if they say they want to tighten rates more aggressively than 50bps, the market will naturally have a huge negative reaction because a future priced market does not like slow growth. However this route will end inflation quicker, so the market can go back to normal once the dust settles.&lt;/p&gt;\n\n&lt;p&gt;Again, all the Fed has done so far is mostly talk. They haven&amp;#39;t really taken much action yet as far as tightening goes. I&amp;#39;d say the market is currently pricing in Fed rates of around 3% which is taking us well into 2023. Which means by 2023 the market will start pricing in growth for 2024. This is when I think the growth will resume its bullish trajectory. Until then we are likely to remain volatile. &lt;/p&gt;\n\n&lt;p&gt;TLDR: Long story short, be patient. Do not stress over what you cannot control. Let the Fed do their job and you do yours. Earn money. Control the budget and buy the dip if you have the means to do so. Real wealth is built during markets like this. Once the bull market resumes, make sure you are on the train.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "call_to_action": "",
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "ufxal8",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "animoshpit",
  "discussion_type": null,
  "num_comments": 43,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/ufxal8/the_stock_market_is_the_greatest_tool_to_build/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/ufxal8/the_stock_market_is_the_greatest_tool_to_build/",
  "subreddit_subscribers": 3970210,
  "created_utc": 1651411055,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1651401953,
  "the_new_excerpt": "Look everyone's portfolio is likely looking red, so here's what you need to do:\nLikely doing nothing for now is the right move. Don't sell at a loss. Work more\nhours so you have more money to buy solid, economy defining stocks at a fraction\nof their price they once were and build your retirement…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほら、みんなのポートフォリオが赤く見えてきたでしょう。\n今のところ何もしないのが正解のようです。損切りをしないこと。もっと働いて\nより多く働いて、より多くの資金を確保し、堅実な経済定義銘柄をかつての何分の一かの価格で購入する。\nそして、老後の生活の糧にするのだ。",
      "title": "株式市場は、辛抱強くやれば富を築くことができる最大のツールです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看每个人的投资组合可能看起来都是红色的，所以这里是你需要做的。\n现在什么都不做很可能是正确的做法。不要在亏损的情况下出售。多工作\n工作时间，这样你就有更多的钱来购买坚实的、有经济价值的股票，价格只是它们曾经的一小部分。\n以他们曾经的价格购买坚实的经济定义的股票，并建立你的退休生活......",
      "title": "如果你有耐心，股市是积累财富的最大工具。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看每個人的投資組合可能看起來都是紅色的，所以這裏是你需要做的。\n現在什麼都不做很可能是正確的做法。不要在虧損的情況下出售。多工作\n工作時間，這樣你就有更多的錢來購買堅實的、有經濟價值的股票，價格只是它們曾經的一小部分。\n以他們曾經的價格購買堅實的經濟定義的股票，並建立你的退休生活......",
      "title": "如果你有耐心，股市是積累財富的最大工具。"
    }
  ]
}