{
  "author": "anonbitcoinperson",
  "the_new_excerpt": "Some people might say that it was great that he was on Ellen promoting crypto\ncurrency. However he suggested that people go on Robinhood and buy dogecoin. He\nsaid that it was a better investement than buying a lottery ticket and at worst\nif it doesnt go up, you can use it to buy things on his…",
  "original_created_utc": 1619620380,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エレンで暗号通貨の宣伝をしていたのは良かったと言う人もいるでしょう。\n通貨の宣伝をしたことを素晴らしいと言う人もいるでしょう。しかし、彼は人々にRobinhoodでdogecoinを購入することを提案しました。彼は\n宝くじを買うよりも良い投資だと言っていましたし、最悪の場合上昇しなくても\n最悪の場合、上昇しなくても、彼のサイトで物を買うのに使えると言っていました。",
      "title": "Mark Cubanは、Robinhoodの使用を推奨した際、サービスよりもEllenでの暗号に対するサービスを行った。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有些人可能会说，他在Ellen上宣传加密货币，这很好。\n货币。然而，他建议人们上Robinhood购买dogecoin。他说\n他说，这是一个比买彩票更好的投资，最坏的情况是\n如果它不涨价，你可以用它来买他的东西...",
      "title": "马克-库班在Ellen上推荐使用Robinhood时，对加密货币的伤害比对服务的伤害更大。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有些人可能會說，他在Ellen上宣傳加密貨幣，這很好。\n貨幣。然而，他建議人們上Robinhood購買dogecoin。他說\n他說，這是一個比買彩票更好的投資，最壞的情況是\n如果它不漲價，你可以用它來買他的東西...",
      "title": "馬克-庫班在Ellen上推薦使用Robinhood時，對加密貨幣的傷害比對服務的傷害更大。"
    }
  ],
  "title": "Mark Cuban did more of a disservice to crypto on Ellen than a service when he recommended using Robinhood.",
  "created_utc": 1619659120,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some people might say that it was great that he was on Ellen promoting crypto currency.  However he suggested that people go on Robinhood and buy dogecoin.  He said that it was a better investement than buying a lottery ticket and at worst if it doesnt go up, you can use it to buy things on his webstore.  But he was dishonest, no one can transfer doge anywhere when their doge was bought on Robinhood.  </p>\n\n<p>It&#39;s kind of a dishonest thing to do, point people to Robinhood where you dont own the keys.  No one in crypto should be telling people bad habits to start off with when getting into crypto for the 1st time.  He should have directed them to an exchange where you can withdraw. He wasn&#39;t helping crypto out by going on Ellen and promoting Robinhood.  I mean was he getting paid to do that ?  Because its the absolute worst place to get started in crypto.  </p>\n\n<p>edit:  He is crippling the adoption with suggestion robinhood because they only thing people can do is to sell it.  They cant send to freinds, they cant tip people on reddit.  they cant explore self custody wallets.  They can&#39;t withdraw. Basically they are not really interacting with the ecosystem at all.</p>\n</div><!-- SC_ON -->",
  "score": 224,
  "permalink": "/r/CryptoCurrency/comments/n0g4xz/mark_cuban_did_more_of_a_disservice_to_crypto_on/",
  "subreddit": "CryptoCurrency",
  "id": "n0g4xz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776213350
}