{
  "author": "albacore_futures",
  "original_created_utc": 1634881475,
  "title": "How did 19th century Dickensian-era Londoners keep the ubiquitous coal soot and coal dust from turning everything they owned black?",
  "created_utc": 1634916229,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I ask this because I learned that the &quot;traditional&quot; suit / outer coat color is black because of the legend that soot in London was so bad that one wore black in order to hide the grime. That led me to think that, even if that myth is true, then the faces and hands and other exposed parts would get dirty anyway. </p>\n\n<p>So, see question: how did populations in heavily-polluted 19th century cities keep coal dust and coal soot from turning their sofas, chairs, wallpaper, whatever all completely black?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qdabji/how_did_19th_century_dickensianera_londoners_keep/",
  "subreddit": "AskHistorians",
  "id": "qdabji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I ask this because I learned that the \"traditional\" suit / outer coat color is\nblack because of the legend that soot in London was so bad that one wore black\nin order to hide the grime. That led me to think that, even if that myth is\ntrue, then the faces and hands and other exposed parts would get…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がこの質問をしたのは、「伝統的な」スーツやアウターコートの色が黒であることを知ったからです。\n汚れを隠すために黒を着ていたという伝説があるからです。\n汚れを隠すために黒い服を着ていたという伝説があるからです。それを聞いて、たとえその神話が間違っていたとしても......と思いました。\n顔や手などの露出している部分が...",
      "title": "19世紀のディッケンジアン時代のロンドンの人々は、どこにでもある石炭のすすや石炭の粉で、所有するすべてのものを黒くしないように、どのようにしていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题是因为我了解到，\"传统 \"的西装/外衣颜色是\n因为传说伦敦的烟尘非常严重，所以人们都穿黑色的衣服，以掩盖灰尘。\n以隐藏污垢。这使我想到，即使这个神话是真的，那么，一个人的脸和一个人的心都是一样的。\n也是如此，那么脸部和手部以及其他暴露在外的部分就会被...",
      "title": "19世纪狄更斯时代的伦敦人是如何保持无处不在的煤烟和煤尘不把他们拥有的一切变成黑色的呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題是因爲我瞭解到，\"傳統 \"的西裝/外衣顏色是\n因爲傳說倫敦的煙塵非常嚴重，所以人們都穿黑色的衣服，以掩蓋灰塵。\n以隱藏污垢。這使我想到，即使這個神話是真的，那麼，一個人的臉和一個人的心都是一樣的。\n也是如此，那麼臉部和手部以及其他暴露在外的部分就會被...",
      "title": "19世紀狄更斯時代的倫敦人是如何保持無處不在的煤煙和煤塵不把他們擁有的一切變成黑色的呢？"
    }
  ]
}