{
  "author": "Dharmahuasca",
  "original_created_utc": 1637058367,
  "title": "What are you buying during this dip?",
  "created_utc": 1637069463,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I always thought the posts of &quot;what are you buying during the dip&quot; we&#39;re super annoying, because I was panicking about all crypto going to 0. \nEvery freaking time the market got back up in a short time and made me bummed I didn&#39;t buy the dip. </p>\n\n<p>This time I want to do it differently and I wanna get a big bag of something. Just not sure what to get... \nShould I get big coins like BTC/ETH, or maybe a top 10 like DOT..? Or is it smarter to get a smaller coin because they&#39;re dropping hard; like LTO/LRC.</p>\n\n<p>What are you guys buying?</p>\n</div><!-- SC_ON -->",
  "score": 296,
  "permalink": "/r/CryptoCurrency/comments/qv4uu8/what_are_you_buying_during_this_dip/",
  "subreddit": "CryptoCurrency",
  "id": "qv4uu8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I always thought the posts of \"what are you buying during the dip\" we're super\nannoying, because I was panicking about all crypto going to 0. Every freaking\ntime the market got back up in a short time and made me bummed I didn't buy the\ndip.\n\nThis time I want to do it differently and I wanna get a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いつも思うのですが、「ディップ時に何を買っているのか」という書き込みは、超\n私はすべての暗号が0になってしまうのではないかとパニックになっていたので、非常に迷惑でした。\n毎回、市場は短時間で立ち直り、私はディップを買わなかったことにがっかりしていました。\nディップ。\n\n今回はそれとは違ったやり方をしたいと思っていて、私が得たいのは...",
      "title": "このディップの間に何を買いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直认为 \"你在下跌期间买什么 \"的帖子超级烦人。\n烦人，因为我对所有加密货币归零感到恐慌。\n市场都会在很短的时间内回升，并让我感到沮丧，我没有买下这个\n跌。\n\n这次我想用不同的方式来做，我想得到一个...",
      "title": "你在这次下跌中买了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直認爲 \"你在下跌期間買什麼 \"的帖子超級煩人。\n煩人，因爲我對所有加密貨幣歸零感到恐慌。\n市場都會在很短的時間內回升，並讓我感到沮喪，我沒有買下這個\n跌。\n\n這次我想用不同的方式來做，我想得到一個...",
      "title": "你在這次下跌中買了什麼？"
    }
  ]
}