{
  "author": "busterrulezzz",
  "original_created_utc": 1644252776,
  "title": "One of the biggest audit firm in Canada just bought BTC and ETH for the first time, saying that \"cryptoassets are a maturing asset class\". Institutions are getting onboard!",
  "created_utc": 1644266037,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One of the most bullish things for our ecosystem will be the adoption of crypto by large institutions. And today, one of Canada&amp;#39;s largest auditing and verification firms announced that they have purchased BTC and ETH for the first time ever!&lt;/p&gt;\n\n&lt;p&gt;The firm, KPMG, is a major player in Canada. It&amp;#39;s been around for more than 150 years and employs nearly 8,000 people. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s what they had to say : &amp;quot;Investors such as hedge funds and family offices to large insurers and pension funds &lt;strong&gt;are increasingly gaining exposure to cryptoassets&lt;/strong&gt; (...). This investment reflects our belief that &lt;strong&gt;institutional adoption of cryptoassets and blockchain technology will continue to grow&lt;/strong&gt; and become a regular part of the asset mix.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;For me, this news is absolutely a bullish sign. No matter what the haters and no-coiners think, crypto is here to stay, and this kind of news proves it. Institutions have only just set foot in it: we are still very early! Just think about it : if you hold long enough, you will probably end up selling your tokens to Wall Street big boys in a few years. &lt;/p&gt;\n\n&lt;p&gt;We are, indeed, all gonna make it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 620,
  "permalink": "/r/CryptoCurrency/comments/smuto8/one_of_the_biggest_audit_firm_in_canada_just/",
  "subreddit": "CryptoCurrency",
  "id": "smuto8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "One of the most bullish things for our ecosystem will be the adoption of crypto\nby large institutions. And today, one of Canada's largest auditing and\nverification firms announced that they have purchased BTC and ETH for the first\ntime ever!\n\nThe firm, KPMG, is a major player in Canada. It's been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちのエコシステムにとって最も強気なことの1つは、暗号が採用されることでしょう。\n大規模な機関投資家による そして今日、カナダ最大級の監査と\n検証会社が、BTCとETHを初めて購入したと発表しました。\nを実現しました。\n\nこの事務所、KPMGはカナダではメジャーな事務所です。これまでにも...",
      "title": "カナダ最大の監査法人のひとつが、「暗号アセットは成熟した資産クラスだ」と、BTCとETHを初めて購入したところです。機関投資家も乗り気!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对我们的生态系统来说，最看好的事情之一将是大型机构对加密货币的采用。\n被大型机构采用。今天，加拿大最大的审计和验证公司之一\n今天，加拿大最大的审计和验证公司之一宣布，他们已经购买了BTC和ETH，这是有史以来的第一次\n有史以来第一次购买BTC和ETH!\n\n该公司KPMG是加拿大的一个主要参与者。它一直...",
      "title": "加拿大最大的一家审计公司刚刚首次购买了BTC和ETH，称 \"加密资产是一个成熟的资产类别\"。机构正在上船!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對我們的生態系統來說，最看好的事情之一將是大型機構對加密貨幣的採用。\n被大型機構採用。今天，加拿大最大的審計和驗證公司之一\n今天，加拿大最大的審計和驗證公司之一宣佈，他們已經購買了BTC和ETH，這是有史以來的第一次\n有史以來第一次購買BTC和ETH!\n\n該公司KPMG是加拿大的一個主要參與者。它一直...",
      "title": "加拿大最大的一家審計公司剛剛首次購買了BTC和ETH，稱 \"加密資產是一個成熟的資產類別\"。機構正在上船!"
    }
  ]
}