{
  "author": "busterrulezzz",
  "original_created_utc": 1644252776,
  "title": "One of the biggest audit firm in Canada just bought BTC and ETH for the first time, saying that \"cryptoassets are a maturing asset class\". Institutions are getting onboard!",
  "created_utc": 1644266037,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One of the most bullish things for our ecosystem will be the adoption of crypto by large institutions. And today, one of Canada&amp;#39;s largest auditing and verification firms announced that they have purchased BTC and ETH for the first time ever!&lt;/p&gt;\n\n&lt;p&gt;The firm, KPMG, is a major player in Canada. It&amp;#39;s been around for more than 150 years and employs nearly 8,000 people. &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s what they had to say : &amp;quot;Investors such as hedge funds and family offices to large insurers and pension funds &lt;strong&gt;are increasingly gaining exposure to cryptoassets&lt;/strong&gt; (...). This investment reflects our belief that &lt;strong&gt;institutional adoption of cryptoassets and blockchain technology will continue to grow&lt;/strong&gt; and become a regular part of the asset mix.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;For me, this news is absolutely a bullish sign. No matter what the haters and no-coiners think, crypto is here to stay, and this kind of news proves it. Institutions have only just set foot in it: we are still very early! Just think about it : if you hold long enough, you will probably end up selling your tokens to Wall Street big boys in a few years. &lt;/p&gt;\n\n&lt;p&gt;We are, indeed, all gonna make it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 620,
  "permalink": "/r/CryptoCurrency/comments/smuto8/one_of_the_biggest_audit_firm_in_canada_just/",
  "subreddit": "CryptoCurrency",
  "id": "smuto8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "One of the most bullish things for our ecosystem will be the adoption of crypto\nby large institutions. And today, one of Canada's largest auditing and\nverification firms announced that they have purchased BTC and ETH for the first\ntime ever!\n\nThe firm, KPMG, is a major player in Canada. It's been…"
}