{
  "author": "hello-world-foo-bar",
  "the_new_excerpt": "CONTEXT\n\nWhat happened last week with GME stock price and option was a combination of a\ngamma squeeze [1] and infinite short squeeze [2]. For the first time in\nfinancial history all GME call options are in the money (ITM) because the\nhighest call strike price set by the CBOE for Januaray 29, 2021 is…",
  "original_created_utc": 1611415995,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "背景\n\n上周发生在GME股价和期权上的事情，是一个结合了\n伽马挤压[1]和无限短挤压[2]。首次在\n所有的GME看涨期权都是在钱里的（ITM），原因是：所有的GME看涨期权都是在钱里的（ITM）。\nCBOE设定的2021年1月29日的最高认购行权价为...",
      "title": "GME无限伽马压榨｜期权市场结构的缺口｜千载难逢的机会。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景\n\n上週發生在GME股價和期權上的事情，是一個結合了\n伽馬擠壓[1]和無限短擠壓[2]。首次在\n所有的GME看漲期權都是在錢裏的（ITM），原因是：所有的GME看漲期權都是在錢裏的（ITM）。\nCBOE設定的2021年1月29日的最高認購行權價爲...",
      "title": "GME無限伽馬壓榨｜期權市場結構的缺口｜千載難逢的機會。"
    }
  ],
  "title": "GME Infinite Gamma Squeeze | Gap In Option Market Structure | Once In a Lifetime Opportunity",
  "created_utc": 1611433062,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Context</h1>\n\n<p>What happened last week with GME stock price and option was a combination of a gamma squeeze [1] and infinite short squeeze [2]. For the first time in financial history all GME call options are in the money (ITM) because the highest call strike price set by the CBOE for Januaray 29, 2021 is $60.</p>\n\n<p><strong>Note:</strong> A primer on gamma squeeze:</p>\n\n<p>h<a href=\"https://www.reddit.com/r/wallstreetbets/comments/l2t9bf/gme_i_think_this_is_a_gamma_squeeze_where_dealers/\">ttps://www.reddit.com/r/wallstreetbets/comments/l2t9bf/gme_i_think_this_is_a_gamma_squeeze_where_dealers/</a></p>\n\n<p>Market Maker [1] are in a condition never observed in financial history. Hundred of thousands of retail (wsb) are buying the GME 60C across the options calendar and MM can&#39;t hedge properly because there are not enough GME shares to buy to properly financially hedge (accounting for the interest rate to borrow)</p>\n\n<h1>Market Structure</h1>\n\n<p>To summarize the market structure:</p>\n\n<ol>\n<li>Few GME shares to hedge.</li>\n<li>Hundreds of thousands of (wsb) are buying the GME 60C because of the infinite short squeeze.</li>\n<li>January 29, 2021 60C call option are the highest one on the option change for that date.</li>\n<li>Conditions for Infinite Gamma Squeeze &amp; Infinite Short Squeeze</li>\n</ol>\n\n<p>As you may now realize --(MM and brokers) hope you don&#39;t -- there is a gap in the market structure that leaves them (MM/Citadel) vulnerable to massive losses.</p>\n\n<h1>Infinite Gamma Squeeze</h1>\n\n<p><strong><em>Should</em></strong> <strong>million of retails (wsb) buy the Januray 29, 2021 60C weekly on Monday, this will create an infinite gamma squeeze because MM still can&#39;t properly hedge, and are forced to buy shares at whatever price to hedge. MM doing so, forces brokers to margin call the shorts caught in their infinite short squeeze. Both conditions are pro-cyclical and feed on each other in an infinite feedback loop</strong> <strong><em>so long as more an more retails buy the GME 60C.</em></strong></p>\n\n<p>There is a chance that MM can dump the shares they bought to hedged the gamma steepening and call buying [1]. However, doing so does not make them market neutral. It effectively turns MM into a hedge fund. SEC may allow them to get away from this momentarily.</p>\n\n<p><strong>However, after the MM dump shares in an attempt to stop the infinite gamma squeeze they will be net short GME shares and unhedged/not market neutral.</strong> If after the MM dump, retails continue to buy GME shares up to the $60 price, MM will be caught in a <em>exponentially worse gamma squeeze</em>, which should GME go pass 60C (gamma bump) on the week of January 25, it would turn into the one of biggest tail risk event for the MM/Citidal.</p>\n\n<p><strong>tldr;</strong></p>\n\n<p><strong>There is a gap in the market structure so that if millions of retails buy Januray 29 GME 60C on January 25 2021, there is a high probability of both an infinite gamma and short squeeze. This has never happened in financial history. And should millions of retail buy the January 29 GME60C 2021, the losses for MM but profits for retail will be massive. Retails could see 100000% return on their weekly GME Januray 29 call options at the highest strike price.</strong></p>\n\n<p><strong>Edit1:</strong> Apparently there may be higher call prices for the January 29 2021 option chains. Fundamentally, this analysis is still correct. Should millions of retail all choose a common higher call strike price to buy (higher than 60C), the gamma squeeze will be triggered when that prices is hit.</p>\n\n<p>Example:</p>\n\n<p>Should millions of retail buy the January 29 70C or January 29 75C, and the infinite short squeeze continues. If the GME 70C or 75C is hit, GME share price enters a gamma squeeze.</p>\n\n<p>What the MM are hoping for are twofolds:</p>\n\n<ol>\n<li>They scare retails to sell below $60. This alleviates the infinite gamma squeeze. Or;</li>\n<li>Retails don&#39;t all buy the same call options. But given that wsb loves high risk, I hypothesize they will all choose the furthest OTM call options.</li>\n</ol>\n\n<p>GME at 60 is the Maginot line next week. Should it go to 75, gamma and infinite short squeeze continues. Should it fall below it, MM have won a strategic victory.</p>\n\n<p><strong>Edit2:</strong></p>\n\n<p>For gamma squeeze, you look at the open interest (OI) and strike price. Should the share price get close to the price with a highest open interest, that&#39;s when the gamma steepening occurs as probability goes to 1. MM have to buy shares to remain neutral as the options are now ITM.</p>\n\n<h1>References</h1>\n\n<p>[1] h<a href=\"https://www.reddit.com/r/wallstreetbets/comments/l2t9bf/gme_i_think_this_is_a_gamma_squeeze_where_dealers/\">ttps://www.reddit.com/r/wallstreetbets/comments/l2t9bf/gme_i_think_this_is_a_gamma_squeeze_where_dealers/</a></p>\n\n<p>[2] <a href=\"https://www.reddit.com/r/stocks/comments/l21gpz/infinite_short_squeeze_explained_blue_appron_case/\">https://www.reddit.com/r/stocks/comments/l21gpz/infinite_short_squeeze_explained_blue_appron_case/</a></p>\n\n<p>[3] <a href=\"https://ca.finance.yahoo.com/quote/GME/options?p=GME\">https://ca.finance.yahoo.com/quote/GME/options?p=GME</a></p>\n</div><!-- SC_ON -->",
  "score": 5751,
  "permalink": "/r/stocks/comments/l3e54f/gme_infinite_gamma_squeeze_gap_in_option_market/",
  "subreddit": "stocks",
  "id": "l3e54f",
  "is_self": true,
  "media": null,
  "is_video": false
}