{
  "author": "milk_cherry",
  "original_created_utc": 1645589525,
  "title": "Have you ever had a bad gut feeling about someone, even without any evidence as to why they're suspicious?",
  "created_utc": 1645599836,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I&amp;#39;m in a bit of a pickle right now: I (19F) met a new member of my church recently (late 20&amp;#39;sM, we will call him Adam). I met him 3 weeks ago, and decided to welcome him because he seemed lost. He&amp;#39;s converting from Catholic to Orthodox, and we talked briefly about that. I joked about converting my boyfriend to Orthodox (since he&amp;#39;s also Catholic), and Adam acknowledged my boyfriend in the conversation (this is important to keep in mind). &lt;/p&gt;\n\n&lt;p&gt;Well, I didn&amp;#39;t see Adam until last Sunday (so 2 weeks later). He was quick to greet me, but I sat down nearby him (our church was full, otherwise I would&amp;#39;ve sat elsewhere) and just focused on the service/praying. For some reason, I got a really weird feeling about Adam. I just felt nervous, but I didn&amp;#39;t have any evidence as to why he would seem suspicious. Once the service was over, he seemed kinda awkward when we chatted, which wasn&amp;#39;t too different from the last time I spoke to him, but again, he came off as odd this time. I got uncomfortable and decided to end the conversation with &amp;quot;I gotta return this book to our archpriest--- nice talking to you, have a good day&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I kept myself occupied with another clergy member instead, but I did this partially because I had to return the book, but also to give Adam some time to leave the church so I wouldn&amp;#39;t bump into him on my way out.&lt;/p&gt;\n\n&lt;p&gt;I feel guilty because I don&amp;#39;t want to discriminate anyone without any reason, but I genuinely feel like the vibe is off with this guy. What should I do? &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;NOTE: I don&amp;#39;t know if this will add onto the story, but after my last interaction with Adam, I had a dream about him. In the dream, he basically was trying to control me and was oddly portrayed as a demon. He basically tried to pressure me into submitting to him (sexually). Maybe there&amp;#39;s something my subconscious is picking up on that I can&amp;#39;t recognize?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/sz7xve/have_you_ever_had_a_bad_gut_feeling_about_someone/",
  "subreddit": "TooAfraidToAsk",
  "id": "sz7xve",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, I'm in a bit of a pickle right now: I (19F) met a new member of my church\nrecently (late 20'sM, we will call him Adam). I met him 3 weeks ago, and decided\nto welcome him because he seemed lost. He's converting from Catholic to\nOrthodox, and we talked briefly about that. I joked about converting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それで、今、ちょっと困っているんです。私(19F)は教会の新しいメンバーに会いました。\n最近、（20代後半M、アダムと呼ぶことにします）。私は3週間前に彼に会い、そして\nというのも、彼は迷っているようだったので、歓迎することにしました。彼はカトリックから\n正統派ということで、その辺の話を少ししました。冗談で改宗を...",
      "title": "なぜ怪しいのか、何の根拠もないのに、直感で嫌な予感がしたことはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我现在处于一个有点棘手的问题。我（19岁）最近遇到了我的教会的一个新成员\n(20多岁的男性，我们叫他亚当)。我在三周前认识他，并决定\n欢迎他，因为他看起来很迷茫。他正在从天主教改信\n东正教，我们简单地谈了谈这个问题。我开玩笑说要皈依...",
      "title": "你是否曾经对某人有一种不好的直觉，甚至没有任何证据说明他们为什么会被怀疑？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我現在處於一個有點棘手的問題。我（19歲）最近遇到了我的教會的一個新成員\n(20多歲的男性，我們叫他亞當)。我在三週前認識他，並決定\n歡迎他，因爲他看起來很迷茫。他正在從天主教改信\n東正教，我們簡單地談了談這個問題。我開玩笑說要皈依...",
      "title": "你是否曾經對某人有一種不好的直覺，甚至沒有任何證據說明他們爲什麼會被懷疑？"
    }
  ]
}