{
  "author": "Whizzmaster",
  "original_created_utc": 1652142731,
  "title": "In 1374, the Knights Hospitallers of Rhodes took over the defense of the city of Smyrna, which had previously been captured during a crusade. The Knights stayed there until 1402, when Smyrna was taken by Timur. What were the Knights' day-to-day responsibilities and duties from 1374 - 1402 in Smyrna?",
  "created_utc": 1652163375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Were the Knights responsible for defending the city from other forces, such as the Ottomans, or bandits? Did they act as a guard force? Accounts of the siege in 1402 mention that Timur&amp;#39;s forces slaughtered the Christian population; was that population already present, or were the Hospitallers responsible for converting the locals during their stay?&lt;/p&gt;\n\n&lt;p&gt;This is a second posting of this question, as the first time I posted this last year I didn&amp;#39;t receive an answer!&lt;/p&gt;\n\n&lt;p&gt;EDIT: Even if you have just a little information on this that might not be enough for a full answer, please, send me a private message with that information! I&amp;#39;m scrounging footnotes of sources trying to find out more about the Hospitallers in Smyrna and everything helps.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/um5otm/in_1374_the_knights_hospitallers_of_rhodes_took/",
  "subreddit": "AskHistorians",
  "id": "um5otm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Were the Knights responsible for defending the city from other forces, such as\nthe Ottomans, or bandits? Did they act as a guard force? Accounts of the siege\nin 1402 mention that Timur's forces slaughtered the Christian population; was\nthat population already present, or were the Hospitallers…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "などの他勢力から街を守るのが騎士団の役目だったのでしょうか？\nオスマントルコや盗賊から街を守る役割を担っていたのでしょうか？警備隊として機能していたのか？1402年の包囲戦の記録では\n1402年の包囲の記録では、ティムール軍はキリスト教徒を虐殺したと書かれていますが、その住民はすでにいたのでしょうか？\nそれともホスピタラーは...？",
      "title": "1374年、ロードス島ホスピタラー騎士団は、十字軍の遠征で占領されたスミルナ市の防衛を引き受けた。そして1402年、ティムールによってスミルナが占領されるまで、騎士団はスミルナに留まった。1374年から1402年まで、騎士団はスミルナでどのような日常的な責任と任務を担っていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "骑士们是否负责保卫城市不受其他势力的影响，如\n奥斯曼人，或土匪？他们是否充当了警卫部队？关于1402年围城战的描述\n中提到，帖木儿的军队屠杀了基督教徒；这些人是否已经存在？\n这些人是否已经存在，或者是福音派教徒......",
      "title": "1374年，罗得岛的好望角骑士团接管了士麦那城的防务，该城此前在一次十字军东征中被占领。骑士团在那里一直呆到1402年，当时士麦那被帖木儿占领。从1374年到1402年，骑士团在士麦那的日常责任和义务是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "騎士們是否負責保衛城市不受其他勢力的影響，如\n奧斯曼人，或土匪？他們是否充當了警衛部隊？關於1402年圍城戰的描述\n中提到，帖木兒的軍隊屠殺了基督教徒；這些人是否已經存在？\n這些人是否已經存在，或者是福音派教徒......",
      "title": "1374年，羅得島的好望角騎士團接管了士麥那城的防務，該城此前在一次十字軍東征中被佔領。騎士團在那裏一直呆到1402年，當時士麥那被帖木兒佔領。從1374年到1402年，騎士團在士麥那的日常責任和義務是什麼？"
    }
  ]
}