{
  "author": "MenokinDevelopment",
  "original_created_utc": 1626096602,
  "title": "AMA: We are the Staff from Menokin (a National Historic Landmark). AMA!",
  "created_utc": 1626109882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Introduction: We are the staff of Menokin - a historic ruin located in Virginia&#39;s rural Northern Neck. Menokin, the home of Francis Lightfoot Lee (a signer of the Declaration of Independence) is a National Historic Landmark, and, like our country, built on the contradictions of slavery. Menokin is one of the best documented 18th centuries houses in the United States. Today we will be answering questions about our historic preservation work, the home and land, and the past occupants including the enslaved people. You can also learn more about Menokin at our website (<a href=\"https://www.menokin.org\">www.menokin.org</a>).</p>\n\n<p>The staff answering questions today are:</p>\n\n<p>Sam McKelvey - Executive Director</p>\n\n<p>Juliana Grassia - Director of Visitor &amp; Community Engagement</p>\n\n<p>Alice French - Director of Education &amp; Programming</p>\n\n<p>Clarissa Sanders - Development Coordinator</p>\n\n<p>If you want to learn more about our individual backgrounds, check out our bios (<a href=\"https://www.menokin.org/our-team-board\">https://www.menokin.org/our-team-board</a>)</p>\n\n<p>We are really excited to be answering your questions, so go ahead and ask us anything!</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/AskHistorians/comments/oir9sy/ama_we_are_the_staff_from_menokin_a_national/",
  "subreddit": "AskHistorians",
  "id": "oir9sy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Introduction: We are the staff of Menokin - a historic ruin located in\nVirginia's rural Northern Neck. Menokin, the home of Francis Lightfoot Lee (a\nsigner of the Declaration of Independence) is a National Historic Landmark, and,\nlike our country, built on the contradictions of slavery. Menokin is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はじめに 私たちは、バージニア州のノーザン・ネックという田舎町にある歴史的な廃墟、メノーキンのスタッフです。\nバージニア州の田舎町ノーザンネックにある歴史的な廃墟です。フランシス・ライトフット・リー（独立宣言の署名者）の家であるメノーキンは、国定歴史建造物です。\nメノーキンは、フランシス・ライトフット・リー（独立宣言の署名者）の邸宅で、国定歴史建造物に指定されています。\n私たちの国と同じように、奴隷制度の矛盾の上に成り立っています。メノーキンは...",
      "title": "AMA: メノーキン（国定歴史建造物）のスタッフです。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "介绍。我们是梅诺金的工作人员，这是一个位于弗吉尼亚州北颈区农村的历史遗迹。\n位于弗吉尼亚州北颈部农村的历史遗迹。梅诺金是弗朗西斯-莱特福特-李（《独立宣言》的签署者）的故乡。\n独立宣言的签署者）的家，是国家历史地标，而且。\n就像我们的国家一样，建立在奴隶制的矛盾之上。梅诺金是...",
      "title": "AMA: 我们是来自Menokin（国家历史地标）的工作人员。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "介紹。我們是梅諾金的工作人員，這是一個位於弗吉尼亞州北頸區農村的歷史遺蹟。\n位於弗吉尼亞州北頸部農村的歷史遺蹟。梅諾金是弗朗西斯-萊特福特-李（《獨立宣言》的簽署者）的故鄉。\n獨立宣言的簽署者）的家，是國家歷史地標，而且。\n就像我們的國家一樣，建立在奴隸制的矛盾之上。梅諾金是...",
      "title": "AMA: 我們是來自Menokin（國家歷史地標）的工作人員。AMA!"
    }
  ]
}