{
  "author": "cannibalsunite",
  "original_created_utc": 1647068472,
  "title": "I [25f] want to be alone all the time and I dread socializing even with people I love. But I feel so lonely and empty. What’s my problem and what do I do?",
  "created_utc": 1647104844,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to be alone literally all the time when I’m not doing something, like at work or the grocery store or school, etc. (I don’t mind being around ppl then). But I’m lonely and empty deep inside and I know it’s not good for my already bad mental health. Why then do I hate socializing so much and turn down every invitation even when I promise myself I will go? What do you think is my problem and what do I do? &lt;/p&gt;\n\n&lt;p&gt;I wish I could just have fun and be normal. I hate what my life is but I don’t actually want to do the things that I fantasize about (have a friend group, relationships, travel, go to stuff etc.) I am really embarrassed by what I’ve become. I don’t even know why I feel this way. I like people but don’t want to be around them. I just feel very alone and lost and dead inside. &lt;/p&gt;\n\n&lt;p&gt;I do try to socialize sometimes and everyone is so nice and honestly meet tons of people would be ideal friends if I put just a little effort but every time I’m invited somewhere I can’t think of anything I want to do less. I kind of hate myself for it. I’m so incredibly boring and lazy and serious and standoffish honestly. &lt;/p&gt;\n\n&lt;p&gt;I am an introvert yes and I am mildly depressed and anxious and medicated. I am therapy even but this seems like it is beyond that maybe. I feel like it reflects very badly on me as a person.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/tcar74/i_25f_want_to_be_alone_all_the_time_and_i_dread/",
  "subreddit": "TooAfraidToAsk",
  "id": "tcar74",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I want to be alone literally all the time when I’m not doing something, like at\nwork or the grocery store or school, etc. (I don’t mind being around ppl then).\nBut I’m lonely and empty deep inside and I know it’s not good for my already bad\nmental health. Why then do I hate socializing so much and…"
}