{
  "author": "lightsong1610",
  "original_created_utc": 1656423675,
  "title": "What did the mile-high ice sheet covering North America look like?",
  "created_utc": 1656439341,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve read lots of references to the Laurentide ice sheet being a mile thick layer of ice covering Canada and part of the US but I’m struggling to visualize what this would look like. &lt;/p&gt;\n\n&lt;p&gt;Did it eventually slope down to ground/sea level at its edges? Or could you walk on dry ground next to it with open air on one side and a mile high wall of ice on the other? &lt;/p&gt;\n\n&lt;p&gt;What happened when it encountered mountains? Did the ice move like glaciers or did the sheet just add and lose ice at the edges? &lt;/p&gt;\n\n&lt;p&gt;How did weather work over the ice sheet if for thousands of miles in any direction, the “ground” was a over 5,000 feet higher than the rest of the continent and surrounding oceans? Did clouds run into it and get stuck? Did they exist over it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askscience/comments/vmnk7l/what_did_the_milehigh_ice_sheet_covering_north/",
  "subreddit": "askscience",
  "id": "vmnk7l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve read lots of references to the Laurentide ice sheet being a mile thick\nlayer of ice covering Canada and part of the US but I’m struggling to visualize\nwhat this would look like.\n\nDid it eventually slope down to ground/sea level at its edges? Or could you walk\non dry ground next to it with open…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローレンサイドの氷床は1マイルの厚さだという文献をたくさん読みました\nカナダとアメリカの一部を覆っている厚さ1マイルの氷の層であるという記述をたくさん読みました。\nを想像するのに苦労しています。\n\n氷床は、最終的に地面や海面まで傾斜していたのでしょうか？あるいは\nその横を乾いた地面で歩くことができるのだろうか？",
      "title": "北米を覆う高さ1マイルの氷床は、どのような姿をしていたのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读过很多关于劳伦特冰层有一英里厚的说法。\n覆盖加拿大和美国部分地区的冰层，但我很难想象出\n这看起来像什么。\n\n它的边缘是否最终倾斜到地面/海平面？或者你可以走在\n在它旁边的干燥地面上行走，并开...",
      "title": "覆盖北美洲的一英里高的冰层是什么样子的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀過很多關於勞倫特冰層有一英里厚的說法。\n覆蓋加拿大和美國部分地區的冰層，但我很難想象出\n這看起來像什麼。\n\n它的邊緣是否最終傾斜到地面/海平面？或者你可以走在\n在它旁邊的乾燥地面上行走，並開...",
      "title": "覆蓋北美洲的一英里高的冰層是什麼樣子的？"
    }
  ]
}