{
  "author": "-Aporia",
  "original_created_utc": 1646830914,
  "title": "You remember when Solana was the next big thing and it turned out the team were just massive liars and were committing fraud? A lesson in doing your own research and not buying into hype.",
  "created_utc": 1646840675,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For those of you who may be new to the whole crypto thing, Solana was all the rage last year. People and VCs were incredibly high on this chain like it was the next best thing since sliced bread. Well surprise surprise. Not only did Solana turn out to be INCREDIBLY centralized, the team lied about their circulating supply twice and were caught committing fraud. That&amp;#39;s a big yikes from me.&lt;/p&gt;\n\n&lt;p&gt;I have literally sold all my SOL,  I&amp;#39;ve bought a bag of MATIC and I&amp;#39;m never going back. It&amp;#39;s more  decentralized (SOL has proven to be extremely centralized), The team can  actually be trusted and it&amp;#39;s just an overall better chain IN MY  OPINION. I know a lot of you apes are pretty much gambling and will invest into anything even if it&amp;#39;s a shitcoin. That&amp;#39;s not me though and that shouldn&amp;#39;t be you either.&lt;/p&gt;\n\n&lt;p&gt;This chain CANNOT compete with the likes of Ethereum and L2s like Polygon. Especially when Solana is a project that has literally lied to you and disrespected you straight to your face. A real shame that people will still invest in this because y&amp;#39;all have no self respect lmao.&lt;/p&gt;\n\n&lt;p&gt;Anyway I went off on a bit of a rant but the point of my post is this. Do your own research, do consistent research and tune out all the noise you&amp;#39;re going to be hearing. Forget about marketing and hype. You will avoid most of this game&amp;#39;s pitfalls by doing your own research. The most important skill you&amp;#39;re ever going to use is tuning out noise and research.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 392,
  "permalink": "/r/CryptoCurrency/comments/ta7anv/you_remember_when_solana_was_the_next_big_thing/",
  "subreddit": "CryptoCurrency",
  "id": "ta7anv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For those of you who may be new to the whole crypto thing, Solana was all the\nrage last year. People and VCs were incredibly high on this chain like it was\nthe next best thing since sliced bread. Well surprise surprise. Not only did\nSolana turn out to be INCREDIBLY centralized, the team lied about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号について初めて知る人のために説明しますと、Solanaは全\n昨年大流行した 人々やVCはこのチェーンを信じられないほど高く評価していました。\nを、「スライスしたパンの次においしいもの」としています。しかし、これは驚きです。驚くだけでなく\nSolanaは非常に中央集権的であることが判明し、チームは嘘をつきました...",
      "title": "ソラナが次の大きな話題となったとき、そのチームが大嘘つきで詐欺を働いていたことが判明したのを覚えていますか？自分で調べて、誇大広告に踊らされないようにするための教訓です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些可能对整个加密货币事物感到陌生的人来说，Solana在去年是所有的\n去年风靡一时。人们和风险投资商对这条链子的评价非常高，好像它是\n自切片面包以来的下一个最好的东西。好吧，令人惊讶的是。不仅是\n索拉纳不仅被证明是非常集中的，而且团队还谎称...",
      "title": "你还记得当索拉纳是下一个大事件时，结果发现该团队只是大量的骗子，正在进行欺诈？这是一个关于做自己的研究和不购买炒作的教训。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些可能對整個加密貨幣事物感到陌生的人來說，Solana在去年是所有的\n去年風靡一時。人們和風險投資商對這條鏈子的評價非常高，好像它是\n自切片面包以來的下一個最好的東西。好吧，令人驚訝的是。不僅是\n索拉納不僅被證明是非常集中的，而且團隊還謊稱...",
      "title": "你還記得當索拉納是下一個大事件時，結果發現該團隊只是大量的騙子，正在進行欺詐？這是一個關於做自己的研究和不購買炒作的教訓。"
    }
  ]
}