{
  "author": "-Aporia",
  "original_created_utc": 1646830914,
  "title": "You remember when Solana was the next big thing and it turned out the team were just massive liars and were committing fraud? A lesson in doing your own research and not buying into hype.",
  "created_utc": 1646840675,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For those of you who may be new to the whole crypto thing, Solana was all the rage last year. People and VCs were incredibly high on this chain like it was the next best thing since sliced bread. Well surprise surprise. Not only did Solana turn out to be INCREDIBLY centralized, the team lied about their circulating supply twice and were caught committing fraud. That&amp;#39;s a big yikes from me.&lt;/p&gt;\n\n&lt;p&gt;I have literally sold all my SOL,  I&amp;#39;ve bought a bag of MATIC and I&amp;#39;m never going back. It&amp;#39;s more  decentralized (SOL has proven to be extremely centralized), The team can  actually be trusted and it&amp;#39;s just an overall better chain IN MY  OPINION. I know a lot of you apes are pretty much gambling and will invest into anything even if it&amp;#39;s a shitcoin. That&amp;#39;s not me though and that shouldn&amp;#39;t be you either.&lt;/p&gt;\n\n&lt;p&gt;This chain CANNOT compete with the likes of Ethereum and L2s like Polygon. Especially when Solana is a project that has literally lied to you and disrespected you straight to your face. A real shame that people will still invest in this because y&amp;#39;all have no self respect lmao.&lt;/p&gt;\n\n&lt;p&gt;Anyway I went off on a bit of a rant but the point of my post is this. Do your own research, do consistent research and tune out all the noise you&amp;#39;re going to be hearing. Forget about marketing and hype. You will avoid most of this game&amp;#39;s pitfalls by doing your own research. The most important skill you&amp;#39;re ever going to use is tuning out noise and research.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 392,
  "permalink": "/r/CryptoCurrency/comments/ta7anv/you_remember_when_solana_was_the_next_big_thing/",
  "subreddit": "CryptoCurrency",
  "id": "ta7anv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For those of you who may be new to the whole crypto thing, Solana was all the\nrage last year. People and VCs were incredibly high on this chain like it was\nthe next best thing since sliced bread. Well surprise surprise. Not only did\nSolana turn out to be INCREDIBLY centralized, the team lied about…"
}