{
  "author": "UnexperiencedIT",
  "original_created_utc": 1633037571,
  "title": "I spent hours on \"shitcoins\" subreddits and their community platforms and wrote down what all of them have in common",
  "created_utc": 1633050763,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>After spending hours on their community platforms this is my conclusion:</strong> </p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>They are putting too much attention on the price over ways &quot;shitcoin&quot; could be actually useful in real world<br/></li>\n<li>Mostly their websites have vague information about goals and usually it is followed by graphics with astronauts, moons, stacks of money, people climbing to the clouds, flying in a spaceships etc.</li>\n<li> I have a feeling that 90% of them didn&#39;t read the white paper, and the ones that did and saw that <em>&quot;shitcoin&quot;</em> white paper doesn&#39;t cover any real world use are being downvoted to eternety</li>\n<li>When you ask them why you should buy <em>&quot;shitcoin&quot;</em> their biggest focus is on how the seller&#39;s fee and manual burns of tokens should be good for the price </li>\n<li>Shilling their <em>&quot;shitcoin</em>&quot; from a celebrity who has no idea about cryptocurrency is presented as a valid reason to for buying</li>\n<li>There is atleast one post of someone going <em>ALL IN</em> on the <em>&quot;shitcoin&quot;</em> and most of the people are acting like it is the next best thing right after the Bitcoin. The ones who don&#39;t think the same way are getting downvoted to eternety in old fashioned way</li>\n<li>The coin is the most undervalued project...<em>this counts if there is actually a project behind it, if there is not they will keep talking about manual burns etc.</em></li>\n<li>All of their community platforms like Telegram, Discord, Viber, WhatsApp etc. are full with memes, pictures, and jokes. Any serious question goes unoticed in purgatory.</li>\n<li> Any red flag, like an enormous drop in price when everything else pumps is justified with a  <em>&quot;great time to buy the dip&quot;</em> </li>\n<li>Their devs team are crypto gods, and they possess knowledge like nobody else in the world</li>\n<li> All the flaws in the coin are ignored while any good thing is celebrated like it is going to change the world to better at that very moment</li>\n</ol>\n\n<p>Don&#39;t let the early returns fool you. Trading shitcoins is as risky as it gets.  <strong>Nobody</strong> here likes shitcoins. The people who love them are the ones that will buy the coin as soon as it launches and get out as soon as they can. People who are telling you to HODL are probably the ones that are too deep in it to sell at loss. They want you to stay so they can get out.  </p>\n\n<p><strong>Holding shitcoin for a long term will most likely result in a loss of money -</strong> <strong><em>Losing money made me wiser</em></strong><em>, take this seriously even if I am not your</em> <strong><em>financial advisor.</em></strong></p>\n</div><!-- SC_ON -->",
  "score": 293,
  "permalink": "/r/CryptoCurrency/comments/pytfbu/i_spent_hours_on_shitcoins_subreddits_and_their/",
  "subreddit": "CryptoCurrency",
  "id": "pytfbu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After spending hours on their community platforms this is my conclusion:\n\n\n\n 1.  They are putting too much attention on the price over ways \"shitcoin\" could\n     be actually useful in real world\n     \n 2.  Mostly their websites have vague information about goals and usually it is\n     followed by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何時間も彼らのコミュニティ・プラットフォームで過ごした後、私の結論はこうです。\n\n\n\n 1.  1.彼らは、「shitcoin」の可能性よりも価格に注目しすぎている。\n     実世界で実際に役立つ\n     \n 2.  2. ウェブサイトには目標に関する漠然とした情報が掲載されていることが多く、大抵は\n     その後に続くのは...",
      "title": "私は、\"shitcoins\" subredditsとそのコミュニティ・プラットフォームに何時間も費やし、それらのすべてに共通することを書き出しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在他们的社区平台上花了几个小时后，这是我的结论。\n\n\n\n 1.  他们把太多的注意力放在价格上，而不是放在 \"狗屎币 \"可能的方式上\n     在现实世界中的实际作用\n     \n 2.  2.他们的网站大部分都有关于目标的模糊信息，而且通常是\n     后面是...",
      "title": "我在 \"屎币 \"子版块及其社区平台上花了几个小时，写下了所有这些版块的共同点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在他們的社區平臺上花了幾個小時後，這是我的結論。\n\n\n\n 1.  他們把太多的注意力放在價格上，而不是放在 \"狗屎幣 \"可能的方式上\n     在現實世界中的實際作用\n     \n 2.  2.他們的網站大部分都有關於目標的模糊信息，而且通常是\n     後面是...",
      "title": "我在 \"屎幣 \"子版塊及其社區平臺上花了幾個小時，寫下了所有這些版塊的共同點"
    }
  ]
}