{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "# **Asset Allocation by Roger C Gibson**\n\n- Asset Allocation is not a new idea. The Talmud developed the first asset allocation over 2,000 years ago.\n  - Let every man divide his money into three parts, and invest a third in land, a third in business, and a third let him keep in reserve\n- While various market anomalies do seem to indicate that the markets are not perfectly efficient, most research supports the notion that the markets are reasonably efficient\n  - This will make it increasingly difficult for anyone to consistently beat the market\n    - If you believe in the above statement, then the only way to win the game is to never play the game at all by buying index funds\n- A research firm did an analysis on inflows and outflows (1986-2005) from equity mutual fund investors, it showed that the average investor earned just 3.9% vs 11.9% for the S+P 500\n  - Why? Mostly due to chasing the performance of funds that had recently done well\n  - Investment return is far more dependent on investor behavior than on fund performance\n- Designing an investment portfolio has several steps (Investment Policy)\n  - Deciding which assets to include\n  - Determining the long-term target % of the portfolio to allocate to each of these asset classes\n    - The first 2 steps determine the portfolios volatility and return characteristics\n  - Specifying a range for each asset class for which it can be altered to exploit opportunities\n    - Minimum and Maximum limits are set for each asset class\n    - This is the &amp;quot;market timing&amp;quot; portion of the portfolio\n  - Selecting the securities within each asset class\n- Research studies repeatedly show that most money managers underperform the market\n  - Professionals populate the marketplace and by definition, the majority cannot outperform the average. And this will continue to be true\n- Some managers with superior skill do exist, the problem is they are rare and very difficult to identify conclusively\n- Modern Portfolio Theory considers each asset class not as an end in itself but rather as it stands in relationship to all others in the portfolio\n  - With a focus on asset allocation and investment policy is transforming management. Less emphasis is placed on &amp;quot;beating the market&amp;quot; and more at devising appropriate strategies\n- Generally, people believe that higher returns are possible with less volatility than is actually the case\n- Destroy the myth of the ideal investment\n- No liquid investment alternative with stable guaranteed principal exist that can provide real returns by consistently beating the combined impact of inflation and taxes\n- Governments are the primary beneficiaries of inflation, in part because of tax structures that tax nominal rather than real incomes\n- Bonds can easily be described with 3 characteristics\n  - Interest rate risk - magnitude of price changes induced by movements in interest rates. Maturity of a bond is a rough indication of how sensitive its price will be to movements in rates. Longer maturity = more fluctuation\n  - Creditworthiness – How likely is repayment?\n  - Tax status – Municipal bonds issued by local and state governments are free from federal taxes so they might make sense for investors in high tax brackets\n- Avoid focusing too much attention of the relationships among long-term average returns without also looking at the variations that occur over shorter periods\n- During periods of moderate inflation, returns are good for long term bonds provided that the inflation was anticipated. During periods of high inflation, long term government bonds, as well as other long term fixed income securities, do poorly\n- Intermediate government bonds have less upside and downside than long term bonds\n- Common stocks do much better in a low inflation environment. They have performed poorly during deflation or high inflation, especially if the inflation is unexpected.\n  - Over the longer run, the companies can make adjustments to inflation, but in the short run those adjustments are difficult to accomplish\n- Small stocks superior performance over large stocks have several possible explanations\n  - Higher volatility\n  - Higher betas\n  - More room to grow in the future vs large cap companies\n- A person who understands inflation risk, interest rate risks, credit risk, and equity risk is in a much better position to make intelligent investment decisions\n- The capital appreciation component for large company stocks returns has a compound annual return of 5.5%\n  - Therefore, the long-term equity investor historically has had long term capital appreciation sufficient to not only maintain but also to enhance purchasing power.\n    - Because the value of a broadly diversified common stock portfolio can keep up with inflation on average over time, so will its dividend stream\n      - But in the short run, the much higher volatility of common stocks produces great uncertainty.\n- Simple Average Return vs Compound Annual Return\n  - Example – If I invest $100 and I get a 25% return year 1 and a -20% return in year 2.\n    - Simple average return (Arithmetic return) is 2.5%. 25%-20%/2 = 2.5%\n    - Compound Annual Return (Geometric return) - $100 x 25% = $125 x -20% = $100 or 0%\n      - For any series of returns, the simple average return will ALWAYS be higher or equal to the compound annual return\n      - The difference between the simple average and compound annual is larger for highly volatile returns.\n      - Only in a situation where returns are consistent will the returns be equal\n        - The reason in the disparity is that it requires a larger percentage of above average performance to offset a given percentage of below average performance\n          - Simple average is ok to use in a single period\n          - Compound return is more appropriate to use when comparing returns over multiple periods\n- You should be concerned not only about an asset class historical return but also about the dispersion of those returns and the likelihood that future returns will be higher or lower than past returns\n  - People often anchor their return expectation to an investments long term historical return. The average return could be an unlikely result\n- The TIPS spread provides a market-concensus forecast of future inflation\n  - Equal to the difference between the yield to maturity of a conventional treasury bond and the yield to maturity of a similar TIPS bond\n- The median normalized P/E ratio for 1926-2011 is 16.45\n  - Higher current P/E ratios signal lower future returns\n  - Lower current P/E ratios signal higher future returns\n  - But there is a range to these outcomes\n  - P/E ratio and 10-year returns following\n    - Below 9 = Average 15.09%\n    - 9-11 = Average 15.40%\n    - 11-14 = Average 12.99%\n    - 14-18 = Average 10.9%\n    - 18-25 = Average 6.46%\n    - 25+ = Average 3.07%\n      - Range was -1% on the low to 6% on the high\n- Market timing doesn&amp;#39;t exist, but people want to believe it is possible\n- Over 11 cycles post WWII\n  - Median bull market was up 79%, bear market was down 28%\n  - Median bull market lasted 2.5x as long as the median bear market\n- A study by Robert Jeffrey concluded: No one can predict the market&amp;#39;s ups and downs over a long period, and the risks of trying outweigh the rewards\n  - Most of the &amp;quot;positive action&amp;quot; in stocks in compressed into just a few periods, which (perversely but understandably) tend to follow particularly adverse times for stocks\n- Much of the problem with market timing is that a disproportionate % of the total gain from a bull market tends to occur very rapidly at the beginning of a market recovery\n- Percent you must be right to make marking timing a viable strategy\n  - 80% bull and 50% bear\n  - 70% bull and 80% bear\n  - 60% bull and 90% bear\n- Do not invest in stocks unless you are in it for the long run\n  - Benjamin Graham – &amp;quot;though the stock market functions as a voting machine in the short run, it acts as a weighing machine in the long run.&amp;quot;\n- Bonds – advantage is cash flows are specified in advance. Disadvantage is they are susceptible to inflation\n  - You are the loaner\n- Stocks – equity provides a return in the form of dividends or capital appreciation. Offers the opportunity of real (inflation adjusted) long term capital growth. Disadvantage is no promise is made of repayment. Also, the high short run volatility of principal\n  - You are the owner\n- Given the higher returns produced by equity investments, we can conclude that investors have a greater fear of stock market volatility than of inflation.\n- Investors who are not aware of the impact of inflation over time tend to favor the less volatile nature of fixed income investments\n- Stock volatility can do much damage in the short term. Many investors focus too narrowly on the short term and sell their stocks out at the bottom of the market\n- We can count on 2 things in the future\n  - Short run stock returns will continue to be volatile and unpredictable\n  - People will prefer predictability over uncertainty\n- Stocks long term higher returns are built partially on their volatility\n  - If stock volatility disappeared, then the reward for owning stocks would too\n- The volatility of stocks is undoubtedly an enemy in the short term, but it is the basis for their higher expected returns. Times transforms this short run enemy into a friend for the long-term investor\n- Fixed incomes investments have less volatility, are hurt by inflation and are appropriate for short horizons\n- Equity investments have long term real capital growth, high volatility and are appropriate for long time horizons\n- Most people do not think in terms of expected returns and standard deviation.\n  - They think in terms of the chance of loss\n- For any series of returns, the larger the standard deviation, the more the compound annual returns (geometric) drop below the simple average return\n  - Volatility therefore impairs the compounding of returns\n  - If I have 2 investments, both with the same 10% simple average return and one has a higher standard deviation than the other, the investment with the higher standard deviation will have a lower compound annual return.\n- An ideal investment would be inversely correlated assets with similar returns. But they don&amp;#39;t exist in real life.\n  - If you had 2 investments with 10% simple average return and a negative correlation, the compound annual return would be 10% also.\n    - This doesn&amp;#39;t exist though in real life; it would be too good to be true\n- Most investments in real life that have similar return patterns have a slightly positive correlation to each other. Although differing in degree, most financial classes are positively correlated to each other\n  - If you have 2 portfolios with the same 10% simple average return, the one with the lower volatility will have the higher compound annual return.\n- Having assets with similar return profiles and slightly positive correlations will reduce standard deviation and therefore improve the compound annual return of the portfolio. Even if the correlation is just mostly or slightly positive, it still provides a benefit\n- Historic data is helpful in understanding asset class volatility and return characteristics and relationships. But precise answers to future portfolio AA decisions simply are not possible. The perfect AA is not possible except in retrospect\n- A portfolio that minimizes portfolio volatility for a given expected return or maximizes portfolio expected return for a given level of risk is said to be efficient\n  - The objective is to allocate assets in such a way as to have a portfolio on the efficient frontier\n- MPT lesson is that an efficient market does not compensate you for bearing volatility that they can eliminate\n  - Any risks that can be diversified away, receive no compensation\n    - Imagine a firefighter who puts on his gear and goes into a burning building and saves a child. He receives a raise from the chief\n    - Imagine later he goes to a fire, but this time goes into the building in his underwear, save another child, then asks for a raise because he did it without his fire gear. How would his chief respond?\n- Those who do not diversify pay the price by assuming a high level of volatility\n- Volatility is not only difficult to tolerate, but also impairs our compound returns\n- Globally diversified portfolios should give investors a better relationship between the returns they want and the volatility they wish to mitigate\n- Evidence suggests that non-U.S. diversification of a U.S. bond portfolio will likely improve long term volatility adjusted returns\n- The dissimilarity in patterns of returns between the U.S. and non-U.S. stock markets creates an opportunity to improve portfolio volatility adjusted returns through diversification\n- As an equity investment, Real Estate generally has served as an effective hedge against inflation over long time horizons\n- Real estate is a major asset class that should have a meaningful allocation in a well-diversified portfolio\n  - Investors seeking real estate diversification have 2 ways to access the asset class. REITs or Private non-liquid real estate investments\n  - Equity REITs provide an alternative method of real estate diversification and are considered real estate\n    - Over the long term, equity REITs have had total returns comparable with U.S. stocks. Volatility is similar to stocks. They also have a relatively low correlation with both bond and stock markets which make them an attractive portfolio diversifier\n    - Equity REITs tend to be more correlated to small company stocks and changes in interest rates\n      - And just like in stocks, it makes sense to diversify your REIT holdings to both U.S and non-U. S holdings\n- When an asset class underperforms, particularly for a long period, investors often eject it from their portfolios\n- Fixed income investments play an important role in investors portfolios. They help to mitigate volatility but usually at the price of lower returns\n- Equity investments usually are responsible for returns when they occur, but also are most often responsible for significant losses\n- If diversification is so good, why don&amp;#39;t more people do it?\n  - Lack of awareness, investors know it reduces volatility but incorrectly suspect that is impairs returns.\n  - Investors also incorrectly believe that some way exists to predict which asset class will come in first place and that they can time it\n  - It involves tracking error problems with investors. Investors use their domestic market as a frame of reference for evaluating results\n    - When the S+P 500 comes out on top, the investor incorrectly perceives that diversification has impaired their returns.\n    - Every year, the diversification strategy loses relative to some of its component assets and wins relative to others. That is the nature of diversification\n- Investment management is simple, but it isn&amp;#39;t easy\n  - Because the principles of successful investing are relatively few and easy to understand\n    - It is natural to fear the unknown and to want to reduce the uncertainty whenever possible. But some uncertainties cannot be avoided\n- For short investment horizons, volatility is the danger. So, portfolios should follow a fixed income AA strategy\n- For long investment horizons, inflations are the danger. So, these portfolios should have a higher allocation to equity investments",
  "author_fullname": "t2_6ucr2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Asset Allocation by Roger Gibson Book Summary",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_sifppu",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.95,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 62,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 62,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1643776941,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;&lt;strong&gt;Asset Allocation by Roger C Gibson&lt;/strong&gt;&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Asset Allocation is not a new idea. The Talmud developed the first asset allocation over 2,000 years ago.\n\n&lt;ul&gt;\n&lt;li&gt;Let every man divide his money into three parts, and invest a third in land, a third in business, and a third let him keep in reserve&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;While various market anomalies do seem to indicate that the markets are not perfectly efficient, most research supports the notion that the markets are reasonably efficient\n\n&lt;ul&gt;\n&lt;li&gt;This will make it increasingly difficult for anyone to consistently beat the market&lt;/li&gt;\n&lt;li&gt;If you believe in the above statement, then the only way to win the game is to never play the game at all by buying index funds&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;A research firm did an analysis on inflows and outflows (1986-2005) from equity mutual fund investors, it showed that the average investor earned just 3.9% vs 11.9% for the S+P 500\n\n&lt;ul&gt;\n&lt;li&gt;Why? Mostly due to chasing the performance of funds that had recently done well&lt;/li&gt;\n&lt;li&gt;Investment return is far more dependent on investor behavior than on fund performance&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Designing an investment portfolio has several steps (Investment Policy)\n\n&lt;ul&gt;\n&lt;li&gt;Deciding which assets to include&lt;/li&gt;\n&lt;li&gt;Determining the long-term target % of the portfolio to allocate to each of these asset classes&lt;/li&gt;\n&lt;li&gt;The first 2 steps determine the portfolios volatility and return characteristics&lt;/li&gt;\n&lt;li&gt;Specifying a range for each asset class for which it can be altered to exploit opportunities&lt;/li&gt;\n&lt;li&gt;Minimum and Maximum limits are set for each asset class&lt;/li&gt;\n&lt;li&gt;This is the &amp;quot;market timing&amp;quot; portion of the portfolio&lt;/li&gt;\n&lt;li&gt;Selecting the securities within each asset class&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Research studies repeatedly show that most money managers underperform the market\n\n&lt;ul&gt;\n&lt;li&gt;Professionals populate the marketplace and by definition, the majority cannot outperform the average. And this will continue to be true&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Some managers with superior skill do exist, the problem is they are rare and very difficult to identify conclusively&lt;/li&gt;\n&lt;li&gt;Modern Portfolio Theory considers each asset class not as an end in itself but rather as it stands in relationship to all others in the portfolio\n\n&lt;ul&gt;\n&lt;li&gt;With a focus on asset allocation and investment policy is transforming management. Less emphasis is placed on &amp;quot;beating the market&amp;quot; and more at devising appropriate strategies&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Generally, people believe that higher returns are possible with less volatility than is actually the case&lt;/li&gt;\n&lt;li&gt;Destroy the myth of the ideal investment&lt;/li&gt;\n&lt;li&gt;No liquid investment alternative with stable guaranteed principal exist that can provide real returns by consistently beating the combined impact of inflation and taxes&lt;/li&gt;\n&lt;li&gt;Governments are the primary beneficiaries of inflation, in part because of tax structures that tax nominal rather than real incomes&lt;/li&gt;\n&lt;li&gt;Bonds can easily be described with 3 characteristics\n\n&lt;ul&gt;\n&lt;li&gt;Interest rate risk - magnitude of price changes induced by movements in interest rates. Maturity of a bond is a rough indication of how sensitive its price will be to movements in rates. Longer maturity = more fluctuation&lt;/li&gt;\n&lt;li&gt;Creditworthiness – How likely is repayment?&lt;/li&gt;\n&lt;li&gt;Tax status – Municipal bonds issued by local and state governments are free from federal taxes so they might make sense for investors in high tax brackets&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Avoid focusing too much attention of the relationships among long-term average returns without also looking at the variations that occur over shorter periods&lt;/li&gt;\n&lt;li&gt;During periods of moderate inflation, returns are good for long term bonds provided that the inflation was anticipated. During periods of high inflation, long term government bonds, as well as other long term fixed income securities, do poorly&lt;/li&gt;\n&lt;li&gt;Intermediate government bonds have less upside and downside than long term bonds&lt;/li&gt;\n&lt;li&gt;Common stocks do much better in a low inflation environment. They have performed poorly during deflation or high inflation, especially if the inflation is unexpected.\n\n&lt;ul&gt;\n&lt;li&gt;Over the longer run, the companies can make adjustments to inflation, but in the short run those adjustments are difficult to accomplish&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Small stocks superior performance over large stocks have several possible explanations\n\n&lt;ul&gt;\n&lt;li&gt;Higher volatility&lt;/li&gt;\n&lt;li&gt;Higher betas&lt;/li&gt;\n&lt;li&gt;More room to grow in the future vs large cap companies&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;A person who understands inflation risk, interest rate risks, credit risk, and equity risk is in a much better position to make intelligent investment decisions&lt;/li&gt;\n&lt;li&gt;The capital appreciation component for large company stocks returns has a compound annual return of 5.5%\n\n&lt;ul&gt;\n&lt;li&gt;Therefore, the long-term equity investor historically has had long term capital appreciation sufficient to not only maintain but also to enhance purchasing power.&lt;/li&gt;\n&lt;li&gt;Because the value of a broadly diversified common stock portfolio can keep up with inflation on average over time, so will its dividend stream\n\n&lt;ul&gt;\n&lt;li&gt;But in the short run, the much higher volatility of common stocks produces great uncertainty.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Simple Average Return vs Compound Annual Return\n\n&lt;ul&gt;\n&lt;li&gt;Example – If I invest $100 and I get a 25% return year 1 and a -20% return in year 2.&lt;/li&gt;\n&lt;li&gt;Simple average return (Arithmetic return) is 2.5%. 25%-20%/2 = 2.5%&lt;/li&gt;\n&lt;li&gt;Compound Annual Return (Geometric return) - $100 x 25% = $125 x -20% = $100 or 0%\n\n&lt;ul&gt;\n&lt;li&gt;For any series of returns, the simple average return will ALWAYS be higher or equal to the compound annual return&lt;/li&gt;\n&lt;li&gt;The difference between the simple average and compound annual is larger for highly volatile returns.&lt;/li&gt;\n&lt;li&gt;Only in a situation where returns are consistent will the returns be equal&lt;/li&gt;\n&lt;li&gt;The reason in the disparity is that it requires a larger percentage of above average performance to offset a given percentage of below average performance\n\n&lt;ul&gt;\n&lt;li&gt;Simple average is ok to use in a single period&lt;/li&gt;\n&lt;li&gt;Compound return is more appropriate to use when comparing returns over multiple periods&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;You should be concerned not only about an asset class historical return but also about the dispersion of those returns and the likelihood that future returns will be higher or lower than past returns\n\n&lt;ul&gt;\n&lt;li&gt;People often anchor their return expectation to an investments long term historical return. The average return could be an unlikely result&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The TIPS spread provides a market-concensus forecast of future inflation\n\n&lt;ul&gt;\n&lt;li&gt;Equal to the difference between the yield to maturity of a conventional treasury bond and the yield to maturity of a similar TIPS bond&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The median normalized P/E ratio for 1926-2011 is 16.45\n\n&lt;ul&gt;\n&lt;li&gt;Higher current P/E ratios signal lower future returns&lt;/li&gt;\n&lt;li&gt;Lower current P/E ratios signal higher future returns&lt;/li&gt;\n&lt;li&gt;But there is a range to these outcomes&lt;/li&gt;\n&lt;li&gt;P/E ratio and 10-year returns following&lt;/li&gt;\n&lt;li&gt;Below 9 = Average 15.09%&lt;/li&gt;\n&lt;li&gt;9-11 = Average 15.40%&lt;/li&gt;\n&lt;li&gt;11-14 = Average 12.99%&lt;/li&gt;\n&lt;li&gt;14-18 = Average 10.9%&lt;/li&gt;\n&lt;li&gt;18-25 = Average 6.46%&lt;/li&gt;\n&lt;li&gt;25+ = Average 3.07%\n\n&lt;ul&gt;\n&lt;li&gt;Range was -1% on the low to 6% on the high&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Market timing doesn&amp;#39;t exist, but people want to believe it is possible&lt;/li&gt;\n&lt;li&gt;Over 11 cycles post WWII\n\n&lt;ul&gt;\n&lt;li&gt;Median bull market was up 79%, bear market was down 28%&lt;/li&gt;\n&lt;li&gt;Median bull market lasted 2.5x as long as the median bear market&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;A study by Robert Jeffrey concluded: No one can predict the market&amp;#39;s ups and downs over a long period, and the risks of trying outweigh the rewards\n\n&lt;ul&gt;\n&lt;li&gt;Most of the &amp;quot;positive action&amp;quot; in stocks in compressed into just a few periods, which (perversely but understandably) tend to follow particularly adverse times for stocks&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Much of the problem with market timing is that a disproportionate % of the total gain from a bull market tends to occur very rapidly at the beginning of a market recovery&lt;/li&gt;\n&lt;li&gt;Percent you must be right to make marking timing a viable strategy\n\n&lt;ul&gt;\n&lt;li&gt;80% bull and 50% bear&lt;/li&gt;\n&lt;li&gt;70% bull and 80% bear&lt;/li&gt;\n&lt;li&gt;60% bull and 90% bear&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Do not invest in stocks unless you are in it for the long run\n\n&lt;ul&gt;\n&lt;li&gt;Benjamin Graham – &amp;quot;though the stock market functions as a voting machine in the short run, it acts as a weighing machine in the long run.&amp;quot;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Bonds – advantage is cash flows are specified in advance. Disadvantage is they are susceptible to inflation\n\n&lt;ul&gt;\n&lt;li&gt;You are the loaner&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Stocks – equity provides a return in the form of dividends or capital appreciation. Offers the opportunity of real (inflation adjusted) long term capital growth. Disadvantage is no promise is made of repayment. Also, the high short run volatility of principal\n\n&lt;ul&gt;\n&lt;li&gt;You are the owner&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Given the higher returns produced by equity investments, we can conclude that investors have a greater fear of stock market volatility than of inflation.&lt;/li&gt;\n&lt;li&gt;Investors who are not aware of the impact of inflation over time tend to favor the less volatile nature of fixed income investments&lt;/li&gt;\n&lt;li&gt;Stock volatility can do much damage in the short term. Many investors focus too narrowly on the short term and sell their stocks out at the bottom of the market&lt;/li&gt;\n&lt;li&gt;We can count on 2 things in the future\n\n&lt;ul&gt;\n&lt;li&gt;Short run stock returns will continue to be volatile and unpredictable&lt;/li&gt;\n&lt;li&gt;People will prefer predictability over uncertainty&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Stocks long term higher returns are built partially on their volatility\n\n&lt;ul&gt;\n&lt;li&gt;If stock volatility disappeared, then the reward for owning stocks would too&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The volatility of stocks is undoubtedly an enemy in the short term, but it is the basis for their higher expected returns. Times transforms this short run enemy into a friend for the long-term investor&lt;/li&gt;\n&lt;li&gt;Fixed incomes investments have less volatility, are hurt by inflation and are appropriate for short horizons&lt;/li&gt;\n&lt;li&gt;Equity investments have long term real capital growth, high volatility and are appropriate for long time horizons&lt;/li&gt;\n&lt;li&gt;Most people do not think in terms of expected returns and standard deviation.\n\n&lt;ul&gt;\n&lt;li&gt;They think in terms of the chance of loss&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;For any series of returns, the larger the standard deviation, the more the compound annual returns (geometric) drop below the simple average return\n\n&lt;ul&gt;\n&lt;li&gt;Volatility therefore impairs the compounding of returns&lt;/li&gt;\n&lt;li&gt;If I have 2 investments, both with the same 10% simple average return and one has a higher standard deviation than the other, the investment with the higher standard deviation will have a lower compound annual return.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;An ideal investment would be inversely correlated assets with similar returns. But they don&amp;#39;t exist in real life.\n\n&lt;ul&gt;\n&lt;li&gt;If you had 2 investments with 10% simple average return and a negative correlation, the compound annual return would be 10% also.&lt;/li&gt;\n&lt;li&gt;This doesn&amp;#39;t exist though in real life; it would be too good to be true&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Most investments in real life that have similar return patterns have a slightly positive correlation to each other. Although differing in degree, most financial classes are positively correlated to each other\n\n&lt;ul&gt;\n&lt;li&gt;If you have 2 portfolios with the same 10% simple average return, the one with the lower volatility will have the higher compound annual return.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Having assets with similar return profiles and slightly positive correlations will reduce standard deviation and therefore improve the compound annual return of the portfolio. Even if the correlation is just mostly or slightly positive, it still provides a benefit&lt;/li&gt;\n&lt;li&gt;Historic data is helpful in understanding asset class volatility and return characteristics and relationships. But precise answers to future portfolio AA decisions simply are not possible. The perfect AA is not possible except in retrospect&lt;/li&gt;\n&lt;li&gt;A portfolio that minimizes portfolio volatility for a given expected return or maximizes portfolio expected return for a given level of risk is said to be efficient\n\n&lt;ul&gt;\n&lt;li&gt;The objective is to allocate assets in such a way as to have a portfolio on the efficient frontier&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;MPT lesson is that an efficient market does not compensate you for bearing volatility that they can eliminate\n\n&lt;ul&gt;\n&lt;li&gt;Any risks that can be diversified away, receive no compensation&lt;/li&gt;\n&lt;li&gt;Imagine a firefighter who puts on his gear and goes into a burning building and saves a child. He receives a raise from the chief&lt;/li&gt;\n&lt;li&gt;Imagine later he goes to a fire, but this time goes into the building in his underwear, save another child, then asks for a raise because he did it without his fire gear. How would his chief respond?&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Those who do not diversify pay the price by assuming a high level of volatility&lt;/li&gt;\n&lt;li&gt;Volatility is not only difficult to tolerate, but also impairs our compound returns&lt;/li&gt;\n&lt;li&gt;Globally diversified portfolios should give investors a better relationship between the returns they want and the volatility they wish to mitigate&lt;/li&gt;\n&lt;li&gt;Evidence suggests that non-U.S. diversification of a U.S. bond portfolio will likely improve long term volatility adjusted returns&lt;/li&gt;\n&lt;li&gt;The dissimilarity in patterns of returns between the U.S. and non-U.S. stock markets creates an opportunity to improve portfolio volatility adjusted returns through diversification&lt;/li&gt;\n&lt;li&gt;As an equity investment, Real Estate generally has served as an effective hedge against inflation over long time horizons&lt;/li&gt;\n&lt;li&gt;Real estate is a major asset class that should have a meaningful allocation in a well-diversified portfolio\n\n&lt;ul&gt;\n&lt;li&gt;Investors seeking real estate diversification have 2 ways to access the asset class. REITs or Private non-liquid real estate investments&lt;/li&gt;\n&lt;li&gt;Equity REITs provide an alternative method of real estate diversification and are considered real estate&lt;/li&gt;\n&lt;li&gt;Over the long term, equity REITs have had total returns comparable with U.S. stocks. Volatility is similar to stocks. They also have a relatively low correlation with both bond and stock markets which make them an attractive portfolio diversifier&lt;/li&gt;\n&lt;li&gt;Equity REITs tend to be more correlated to small company stocks and changes in interest rates\n\n&lt;ul&gt;\n&lt;li&gt;And just like in stocks, it makes sense to diversify your REIT holdings to both U.S and non-U. S holdings&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;When an asset class underperforms, particularly for a long period, investors often eject it from their portfolios&lt;/li&gt;\n&lt;li&gt;Fixed income investments play an important role in investors portfolios. They help to mitigate volatility but usually at the price of lower returns&lt;/li&gt;\n&lt;li&gt;Equity investments usually are responsible for returns when they occur, but also are most often responsible for significant losses&lt;/li&gt;\n&lt;li&gt;If diversification is so good, why don&amp;#39;t more people do it?\n\n&lt;ul&gt;\n&lt;li&gt;Lack of awareness, investors know it reduces volatility but incorrectly suspect that is impairs returns.&lt;/li&gt;\n&lt;li&gt;Investors also incorrectly believe that some way exists to predict which asset class will come in first place and that they can time it&lt;/li&gt;\n&lt;li&gt;It involves tracking error problems with investors. Investors use their domestic market as a frame of reference for evaluating results&lt;/li&gt;\n&lt;li&gt;When the S+P 500 comes out on top, the investor incorrectly perceives that diversification has impaired their returns.&lt;/li&gt;\n&lt;li&gt;Every year, the diversification strategy loses relative to some of its component assets and wins relative to others. That is the nature of diversification&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investment management is simple, but it isn&amp;#39;t easy\n\n&lt;ul&gt;\n&lt;li&gt;Because the principles of successful investing are relatively few and easy to understand&lt;/li&gt;\n&lt;li&gt;It is natural to fear the unknown and to want to reduce the uncertainty whenever possible. But some uncertainties cannot be avoided&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;For short investment horizons, volatility is the danger. So, portfolios should follow a fixed income AA strategy&lt;/li&gt;\n&lt;li&gt;For long investment horizons, inflations are the danger. So, these portfolios should have a higher allocation to equity investments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "sifppu",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "captmorgan50",
  "discussion_type": null,
  "num_comments": 4,
  "send_replies": false,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/sifppu/asset_allocation_by_roger_gibson_book_summary/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/sifppu/asset_allocation_by_roger_gibson_book_summary/",
  "subreddit_subscribers": 136630,
  "created_utc": 1643798462,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1643776941,
  "the_new_excerpt": "ASSET ALLOCATION BY ROGER C GIBSON\n\n * Asset Allocation is not a new idea. The Talmud developed the first asset\n   allocation over 2,000 years ago.\n   * Let every man divide his money into three parts, and invest a third in\n     land, a third in business, and a third let him keep in reserve\n *…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アセット・アロケーション by ロジャー・ギブソン\n\n * アセット・アロケーションは新しい考え方ではありません。タルムードが最初のアセットアロケーションを開発した。\n   2,000年以上前にアロケーションを行った。\n   * すべての人が自分のお金を3分割し、3分の1を投資しましょう\n     3分の1は土地、3分の1はビジネス、そして3分の1は予備として持たせておく。\n *...",
      "title": "アセット・アロケーション（ロジャー・ギブソン著）書籍概要"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "罗杰-C-吉布森的资产配置\n\n * 资产配置并不是一个新的想法。塔木德经》在2000多年前就提出了第一个资产\n   犹太法典》在两千多年前就提出了第一个资产配置。\n   * 让每个人把他的钱分成三份，三分之一投资于\n     三分之一投资于土地，三分之一投资于商业，还有三分之一让他保留。\n *...",
      "title": "罗杰-吉布森的《资产配置》一书摘要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "羅傑-C-吉布森的資產配置\n\n * 資產配置並不是一個新的想法。塔木德經》在2000多年前就提出了第一個資產\n   猶太法典》在兩千多年前就提出了第一個資產配置。\n   * 讓每個人把他的錢分成三份，三分之一投資於\n     三分之一投資於土地，三分之一投資於商業，還有三分之一讓他保留。\n *...",
      "title": "羅傑-吉布森的《資產配置》一書摘要"
    }
  ],
  "source_updated_at": 1643967614389
}