{
  "author": "ExcellentNoThankYou",
  "the_new_excerpt": "Coinbase Global made public on Thursday the prospectus for its much-anticipated\ninitial public offering, setting up the company to possibly launch its IPO in\nMarch.\n\nCoinbase, whose mission is to create an open financial system for everyone,\nplans to use a direct listing to tap the public equities…",
  "original_created_utc": 1614271404,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Coinbase Global周四公开了其备受关注的招股说明书。\n首次公开募股，为该公司可能会在\n3月份。\n\nCoinbase，其使命是为每个人建立一个开放的金融体系。\n计划采用直接上市的方式来挖掘公众股...",
      "title": "Coinbase最快可能在今年3月上市"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Coinbase Global週四公開了其備受關注的招股說明書。\n首次公開募股，爲該公司可能會在\n3月份。\n\nCoinbase，其使命是爲每個人建立一個開放的金融體系。\n計劃採用直接上市的方式來挖掘公衆股...",
      "title": "Coinbase最快可能在今年3月上市"
    }
  ],
  "title": "Coinbase Could Go Public as Soon as This March",
  "created_utc": 1614280459,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Coinbase Global made public on Thursday the prospectus for its much-anticipated initial public offering, setting up the company to possibly launch its IPO in March.  </p>\n\n<p>Coinbase, whose mission is to create an open financial system for everyone, plans to use a direct listing to tap the public equities markets. Coinbase won’t receive any proceeds from shareholders selling their stock during the offering, the prospectus said. Goldman Sachs , J.P. Morgan Securities, Allen &amp; Co., and Citigroup Global Markets are acting as financial advisors on the deal. Coinbase plans to trade on the Nasdaq under the symbol “COIN.”</p>\n\n<p>Companies typically have to wait 15 days to commence a roadshow for their IPOs after making the prospectus public. This means Coinbase could launch the direct listing as soon as next month. Coinbase isn’t conducting a typical roadshow, but may host one or more investor days, the prospectus said. </p>\n\n<p><a href=\"https://www.barrons.com/articles/coinbase-could-go-public-as-soon-as-march-51614270033\">https://www.barrons.com/articles/coinbase-could-go-public-as-soon-as-march-51614270033</a></p>\n</div><!-- SC_ON -->",
  "score": 360,
  "permalink": "/r/investing/comments/lsat2y/coinbase_could_go_public_as_soon_as_this_march/",
  "subreddit": "investing",
  "id": "lsat2y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937739428
}