{
  "author": "Sablac",
  "the_new_excerpt": "Listen, this sucks. You have the right to be sad. Don't let anyone on the\ninternet denounce your feelings. We're all in the same boat. I am down 25% and\nit fucking stings. Some of you might, like myself, have thought about selling.\nDon't. It's too late. This was a very harsh correction but things…",
  "original_created_utc": 1614884956,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "听着，这很糟糕。你有权利伤心。不要让任何人在\n网上谴责你的感情。我们都在同一条船上。我跌了25%，而且\n它他妈的刺痛。你们中的一些人可能会像我一样 想过要卖掉它。\n不要这样做 太迟了 这是一个非常严厉的纠正，但事情... ...",
      "title": "别卖了 我有个计划"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着，這很糟糕。你有權利傷心。不要讓任何人在\n網上譴責你的感情。我們都在同一條船上。我跌了25%，而且\n它他媽的刺痛。你們中的一些人可能會像我一樣 想過要賣掉它。\n不要這樣做 太遲了 這是一個非常嚴厲的糾正，但事情... ...",
      "title": "別賣了 我有個計劃"
    }
  ],
  "title": "Don't sell. Here's a plan",
  "created_utc": 1614901107,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Listen, this sucks. You have the right to be sad. Don&#39;t let anyone on the internet denounce your feelings. We&#39;re all in the same boat. I am down 25% and it fucking stings. Some of you might, like myself, have thought about selling. Don&#39;t. It&#39;s too late. This was a very harsh correction but things are looking bright. Don&#39;t buy the dip. Wait. Let SPY hit $370-371. And it will. We broke all the major support levels and next up is $370-371. If we go lower, which we probably won&#39;t, then brace yourself for another downfall. But if we stay there, buy good companies. If you can, hedge your positions.</p>\n\n<p>Let the market cool off until you buy anything. 10-year yields went higher after the Powell interview and it can potentially go even higher. </p>\n\n<p>Hopefully we&#39;ll leave this behind us, being even better investors/traders. Please take care of yourself.</p>\n</div><!-- SC_ON -->",
  "score": 190,
  "permalink": "/r/stocks/comments/lxsim5/dont_sell_heres_a_plan/",
  "subreddit": "stocks",
  "id": "lxsim5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575858
}