{
  "author": "rrdonoo",
  "the_new_excerpt": "https://news.yahoo.com/champions-league-tax-avoidance-uber-025211310.html\n\nUber used around 50 Dutch shell companies to help reduce its global tax burden,\nan Australian research group found. Despite earning $5.8 billion in global\nrevenues in 2019, Uber claimed a $4.5 billion loss for tax purposes.…",
  "original_created_utc": 1620881027,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://news.yahoo.com/champions-league-tax-avoidance-uber-025211310.html\n\nUberは世界的な税負担軽減のために、約50のオランダのシェル企業を利用していた。\nオーストラリアの研究グループが発表しました。世界で58億ドルの収益を上げたにもかかわらず\n2019年に58億ドルの収益を上げたにもかかわらず、Uberは税務上45億ドルの損失を計上した....",
      "title": "Yahoo] Uberは50のオランダのシェル企業を使って、60億ドルの収入に対する税金を逃れていた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://news.yahoo.com/champions-league-tax-avoidance-uber-025211310.html\n\nUber使用了大约50家荷兰空壳公司来帮助减少其全球税收负担。\n一个澳大利亚研究小组发现。尽管在2019年获得了58亿美元的全球收入\n收入，但Uber声称有45亿美元的税收损失....",
      "title": "[雅虎]Uber使用50家荷兰空壳公司来逃避60亿美元的收入税收"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://news.yahoo.com/champions-league-tax-avoidance-uber-025211310.html\n\nUber使用了大約50家荷蘭空殼公司來幫助減少其全球稅收負擔。\n一個澳大利亞研究小組發現。儘管在2019年獲得了58億美元的全球收入\n收入，但Uber聲稱有45億美元的稅收損失....",
      "title": "[雅虎]Uber使用50家荷蘭空殼公司來逃避60億美元的收入稅收"
    }
  ],
  "title": "[Yahoo] Uber used 50 Dutch shell companies to dodge taxes on $6B in revenue",
  "created_utc": 1620889346,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://news.yahoo.com/champions-league-tax-avoidance-uber-025211310.html\">https://news.yahoo.com/champions-league-tax-avoidance-uber-025211310.html</a></p>\n\n<p>Uber used around 50 Dutch shell companies to help reduce its global tax burden, an Australian research group found. Despite earning $5.8 billion in global revenues in 2019, Uber claimed a $4.5 billion loss for tax purposes. One researcher called Uber’s alleged scheme “the Champions League of tax avoidance.” See more stories on Insider’s business page. Uber has been using a complex tax shelter involving around 50 Dutch shell companies to reduce its global tax bill, according to recent research from the Center for International Corporate Tax Accountability and Research.</p>\n\n<p>In 2019, Uber claimed $4.5 billion in global operating losses (excluding the US and China) for tax purposes – in reality, it brought in $5.8 billion in operating revenue, according to CICTAR, an Australia-based research group.</p>\n\n<p>Uber had previously disclosed details about its Dutch tax haven in 2019, when it moved its intellectual property from Bermuda to the Netherlands, but CICTAR’s research sheds more light on how the company has structured its network of shell companies.</p>\n\n<p>“This is the Champions League of tax avoidance,” CICTAR principal analyst Jason Ward told Dutch news magazine De Groene Amsterdammer.</p>\n\n<p>Uber did not immediately respond to a request for comment on this story.</p>\n\n<p>Uber transfered its intellectual property through a $16 billion “loan” from one of its subsidiaries in Singapore that in turn owns one of Uber’s Dutch shell companies, a manuever that grants the company a $1 billion tax break every year for the next 20 years, the researchers found.</p>\n\n<p>“Uber has supercharged their tax avoidance approach,” Ward told Insider, using an intellectual property tax break “to prevent future tax bills, turning it into a much more useful, viable tax structure in the Netherlands.”</p>\n\n<p>CICTAR also found several of Uber’s Dutch subsidiaries hadn’t submitted mandatory financial reports, and in India, Uber paid less than a third of the 6% tax the country imposes on multinational companies, according to the report.</p>\n\n<p>“India is in desperate need of public revenue” to help it combat COVID-19, yet companies like Uber are able to avoid cointributing to that effort through tax avoidance schemes, Ward told Insider.</p>\n\n<p>In Australia, CICTAR found that Uber was underpaying its tax bill by $30.5 million (AUD$39 million), according to Groene Amsterdammer.</p>\n\n<p>Uber’s sophisticated efforts to achieve little or no tax burden on multibillion-dollar global revenues highlights a long-standing challenge governments face in enforcing tax compliance among wealthy corporations and individuals across borders.</p>\n\n<p>In response, some lawmakers around the world, including the US President Joe Biden, have lobbied for a global minimum tax and other measures to reduce tax avoidance, which the Tax Justice Network estimates costs governments $427 billion annually.</p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/investing/comments/nb8mhb/yahoo_uber_used_50_dutch_shell_companies_to_dodge/",
  "subreddit": "investing",
  "id": "nb8mhb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994602
}