{
  "author": "roberthonker",
  "original_created_utc": 1625851918,
  "title": "Crypto is a long game. People who bought the peak in 2017 had to wait 3 years to break even. Your timeframe to hold should be 5+ years.",
  "created_utc": 1625866506,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Too many people treat this like a casino. Crypto is a long game. People that bought the peak in 2017 had to wait three years to break even, it doesn’t happen overnight.</p>\n\n<p>Don&#39;t get me wrong, if you make the right crypto choices you will make a significant amount of money, you just have to hold long enough. 5+ years should be your timeframe.</p>\n\n<p><strong>Big gains in crypto require years of holding.</strong></p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/oh0gbq/crypto_is_a_long_game_people_who_bought_the_peak/",
  "subreddit": "CryptoCurrency",
  "id": "oh0gbq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Too many people treat this like a casino. Crypto is a long game. People that\nbought the peak in 2017 had to wait three years to break even, it doesn’t happen\novernight.\n\nDon't get me wrong, if you make the right crypto choices you will make a\nsignificant amount of money, you just have to hold long…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カジノのように扱う人が多すぎる 暗号は長いゲームです。2017年のピーク時に買った人が\n2017年のピーク時に購入した人は、損益分岐点に達するまで3年待たなければならず、一晩では起こりません。\n一夜にして起こるものではありません。\n\n誤解しないでほしいのですが、正しい暗号の選択をすれば、かなりの金額を稼ぐことができます。\n誤解しないでほしいのですが、正しい暗号の選択をすれば、かなりの金額を稼ぐことができますが、ただ長く保有しなければなりません...。",
      "title": "暗号はロングゲーム 2017年のピーク時に買った人は、ブレイクイーブンになるまで3年待たなければなりませんでした。保有する時間枠は5年以上であるべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "太多的人把这当做是一个赌场。低碳货币是一个长期游戏。那些\n在2017年买入高峰期的人不得不等待三年才能实现收支平衡，它不会在一夜之间发生\n一夜之间。\n\n不要误会我的意思，如果你做出正确的加密货币选择，你将会赚到大量的钱。\n你必须长期持有......",
      "title": "低碳货币是一个漫长的游戏。在2017年买入峰值的人不得不等待3年才能实现收支平衡。你持有的时间框架应该是5年以上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "太多的人把這當做是一個賭場。低碳貨幣是一個長期遊戲。那些\n在2017年買入高峯期的人不得不等待三年才能實現收支平衡，它不會在一夜之間發生\n一夜之間。\n\n不要誤會我的意思，如果你做出正確的加密貨幣選擇，你將會賺到大量的錢。\n你必須長期持有......",
      "title": "低碳貨幣是一個漫長的遊戲。在2017年買入峯值的人不得不等待3年才能實現收支平衡。你持有的時間框架應該是5年以上。"
    }
  ]
}