{
  "author": "moonski",
  "the_new_excerpt": "The only reason GME is where it is right now is through blatant market\nmanipulation.\n\nOn January 28th GME was over $500 pre market. It had sensational momentum.\nBuying GME on the 27th at $300+ was not a bad play. GME had already gravity\nslingshotted round Earth and had blown past the moon, on course…",
  "original_created_utc": 1613182360,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "GME能有现在的地位，唯一的原因是通过公然的市场。\n操纵。\n\n1月28日，GME前期市场超过500美元。它的势头很轰动。\n27日在300多美元买入GME不失为一个好戏。GME已经重力\n绕着地球飞了一圈，飞过了月球，正准备... ...",
      "title": "记住--GEE EM EE之所以能有今天的成就，是因为公然操纵市场。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "GME能有現在的地位，唯一的原因是通過公然的市場。\n操縱。\n\n1月28日，GME前期市場超過500美元。它的勢頭很轟動。\n27日在300多美元買入GME不失爲一個好戲。GME已經重力\n繞着地球飛了一圈，飛過了月球，正準備... ...",
      "title": "記住--GEE EM EE之所以能有今天的成就，是因爲公然操縱市場。"
    }
  ],
  "title": "Remember- GEE EM EE is only where it is because of blatant market manipulation.",
  "created_utc": 1613197176,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The only reason GME is where it is right now is through blatant market manipulation. </p>\n\n<p>On January 28th GME was over $500 pre market. It had sensational momentum. Buying GME on the 27th at $300+ was not a bad play. GME had already gravity slingshotted round Earth and had blown past the moon, on course to leave the fucking Milky Way. The shorts were completely fucking fucked. They were done. Dead. Bags heavier than a dying star. About to be squeezed so hard they’d turn into hand shaped diamonds. And then suddenly they weren’t. </p>\n\n<p>It wasn’t fucking short laddering that saved them. It wasn’t fucking “hedge fund tactics.” It wasn’t synthetic longs. It wasn’t a bear raid (look it up, this is what they are actually doing ). It wasn’t cause gme was a silly meme play. none of this is what stopped the inter dimensional GME rocket. </p>\n\n<p>What saved them? Market manipulation. “They” (dtc/ brokers / clearing houses whoever) changed the rules and essentially banned buying the stock.  They locked the (retail at least) market out of one side of a trade. The fuck?</p>\n\n<p>They didn’t halt the stock. </p>\n\n<p>They didn’t suspend it. </p>\n\n<p>The stock wasn’t halted by the exchanges. No That would stop all trading. </p>\n\n<p>They just stopped people <em>buying</em>. Kill the demand and surprise! supply overtakes demand  and price drops like your wife’s pants when her bf is in town. </p>\n\n<p>But why?</p>\n\n<p>If they hadn’t restricted buying? Well the shorts would be bankrupt. But they can’t let retail win. Specially fucking Reddit. Retail investors are idiots remember. Institutions are far smarter than that bunch. </p>\n\n<p>The big boys can’t have retail win. That’s preposterous. So just stop em buying. You do that to <em>any stock</em> and it would absolutely tank. Its mind blowing how blatant it was. </p>\n\n<p>And this was all to get themselves out a terrible situation they engineered through sheer unadulterated greed. So greedy that dumbfuck retail caught them with their dick in the cookie jar. So bad that  the clearing houses / dtc didn’t want to pay for the gargantuan bags that were being held by the shorts. Because they’d have to. Someone had to pay and the shorts were, well, poetically the shorts were going to be short... A few billion dollars. </p>\n\n<p>So it turns out all you have to do to avoid being molested by the squeeze of the century is change the rules, very clearly manipulate the stocks price, and suddenly squeezeageddon is a little gentle hug.</p>\n\n<p>If this doesn’t show just how rigged the markets are, I don’t know what else could. Maybe a news story coming out that the DTC and large firms have a daily morning zoom call to literally decide what every single stocks opening and closing price will be every day, and then phone Cramer so he can say the opposite on CNBC. </p>\n\n<p>Everything else since the great buying lockdown is small fry fuckery. Remember this.</p>\n\n<p>But here’s the other thing. You think the boys at the funds hoarding short positions like they’re some kind of short dragon of Wall Street  are going just go “well that was close, let’s close all our GME shorts now while we can?” No fucking way. I guaranfuckingtee they’re doubling down. They think GME is worth $0. They aren’t to stop until they’re right. Specially when they’re playing against “dumbfuck” retail and the investor known as Reddit. </p>\n\n<p>GME ain’t done yet. </p>\n\n<p>Hold. </p>\n\n<p><sup>Not</sup> <sup>financial</sup> <sup>advice.</sup></p>\n</div><!-- SC_ON -->",
  "score": 9214,
  "permalink": "/r/wallstreetbets/comments/liqvpq/remember_gee_em_ee_is_only_where_it_is_because_of/",
  "subreddit": "wallstreetbets",
  "id": "liqvpq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728629839
}