{
  "author": "dreamliner330",
  "the_new_excerpt": "I see a lot of posts that go something like \"Oh yeah, I was saying last week to\nsell off all my holdings because I knew this weeks dip was coming\" or \"oh yeah,\nI knew to buy *stock* last week because there would be another month-end\n'squeeze' bump\".\n\nThis frustration continues when I read a flurry…",
  "original_created_utc": 1614408904,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多帖子都是这样说的：\"哦，对了，我上周还在说到\n卖掉我所有的持股，因为我知道这周的跌势即将到来 \"或 \"哦，是的。\n上周我就知道要买*股，因为月底还会有一个\n'挤'撞\"。\n\n这种挫折感还在继续，当我读到一连串...",
      "title": "每个人都是先知。预测后天的市场......而不是之前!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多帖子都是這樣說的：\"哦，對了，我上週還在說到\n賣掉我所有的持股，因爲我知道這周的跌勢即將到來 \"或 \"哦，是的。\n上週我就知道要買*股，因爲月底還會有一個\n'擠'撞\"。\n\n這種挫折感還在繼續，當我讀到一連串...",
      "title": "每個人都是先知。預測後天的市場......而不是之前!"
    }
  ],
  "title": "Everybody is an Oracle. Predicting the market the day after...instead of before!",
  "created_utc": 1614432314,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see a lot of posts that go something like &quot;Oh yeah, I was saying last week to sell off all my holdings because I knew this weeks dip was coming&quot; or &quot;oh yeah, I knew to buy *stock* last week because there would be another month-end &#39;squeeze&#39; bump&quot;.</p>\n\n<p>This frustration continues when I read a flurry of industry-articles that come out during the day as if they knew it was going to happen...no matter what happens.  Like they&#39;ve got them pre-made to send out no matter what.</p>\n\n<p>I am glad you are wise and have plenty of foresight to share, I truly am, that&#39;s why I&#39;m here...but please, next time, share it BEFORE so we can all get in the fun.</p>\n\n<p>Sometimes I see an event happen and I think to myself &quot;of course that was going to happen it makes so much sense&quot; and honestly, I wish I could learn how to figure that out BEFORE it actually happens.</p>\n\n<p>I am trying to learn as best I can by reading a lot in this thread but the more time I spend here continuing to see after-the-fact posts of wisdom, I start to think nobody knows anything and perhaps the Bogle Three-Fund-Portfolio is the best way to go.</p>\n\n<p>DL;DR: My short-play account just became a long-play account because the <a href=\"/r/stocks\">r/stocks</a> Oracles were holding out. ヽ(ಠ_ಠ)ノ</p>\n\n<p>I also averaged down as hard as I could this week, so dear lord please bump tech next week.</p>\n</div><!-- SC_ON -->",
  "score": 84,
  "permalink": "/r/stocks/comments/ltih3x/everybody_is_an_oracle_predicting_the_market_the/",
  "subreddit": "stocks",
  "id": "ltih3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742120
}