{
  "author": "Ramanticasf",
  "original_created_utc": 1636625255,
  "title": "Those who came to crypto from stocks, what are some pros and convos of crypto over stock market?",
  "created_utc": 1636655725,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto has attracted a lot of people, ranging from mechanics and plumbers to businessmen and investors. No wonder, it also attracted a large number of investors and stock market veterans cause let&#39;s be honest what holding a stock can generate in years, crypto can do it within days. </p>\n\n<p>So, my question is to the stock market traders/investors what is it about crypto that makes it better than stock market and what are some of its flaws besides the high volatility and non regulations. </p>\n\n<p>Looking forward to some valuable insights and not just troll comments xD</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/qri2j8/those_who_came_to_crypto_from_stocks_what_are/",
  "subreddit": "CryptoCurrency",
  "id": "qri2j8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto has attracted a lot of people, ranging from mechanics and plumbers to\nbusinessmen and investors. No wonder, it also attracted a large number of\ninvestors and stock market veterans cause let's be honest what holding a stock\ncan generate in years, crypto can do it within days.\n\nSo, my question…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は、機械工や配管工からビジネスマンや投資家まで、多くの人々を魅了しています。\nビジネスマンや投資家まで、多くの人々を魅了しています。驚くことではありませんが、多くの投資家や株式市場のベテランたちを魅了しています。\n投資家や株式市場のベテランたちを魅了しています。\n正直に言うと、株式を保有して数年で得られる利益を、暗号は数日で得られるからです。\n\nそこで、質問ですが...。",
      "title": "株式から暗号に移行した人は、株式市場に対する暗号の長所と短所は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币已经吸引了很多人，从机械师和水管工到\n商人和投资者。难怪，它也吸引了大量的\n投资者和股市老手，因为说实话，持有一支股票可以产生几年的收益，而加密货币可以在几天内完成。\n能产生多少年的收益，加密货币能在几天内完成。\n\n所以，我的问题是...",
      "title": "那些从股票转向加密货币的人，加密货币比股票市场有哪些优点和说服力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣已經吸引了很多人，從機械師和水管工到\n商人和投資者。難怪，它也吸引了大量的\n投資者和股市老手，因爲說實話，持有一支股票可以產生幾年的收益，而加密貨幣可以在幾天內完成。\n能產生多少年的收益，加密貨幣能在幾天內完成。\n\n所以，我的問題是...",
      "title": "那些從股票轉向加密貨幣的人，加密貨幣比股票市場有哪些優點和說服力？"
    }
  ]
}