{
  "author": "ThatMuslimGamer",
  "original_created_utc": 1638987951,
  "title": "Is it weird that I feel more comfortable wearing a mask rather than showing my actual face?",
  "created_utc": 1639004200,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ever since the pandemic started, I feel more comfortable wearing a face mask than showing my actual face. I feel like I&amp;#39;m too grotesque and ugly to look at and wearing a face mask kind of hides that. It&amp;#39;s gotten to the point where I think me wearing a face mask is my &amp;quot;actual face&amp;quot;. Kind of like how Rorschach thinks his mask is his &amp;quot;actual face&amp;quot;. I&amp;#39;m sorry if the post itself is kind of cringey. I&amp;#39;m in desperate need of an answer.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/rbxm23/is_it_weird_that_i_feel_more_comfortable_wearing/",
  "subreddit": "TooAfraidToAsk",
  "id": "rbxm23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ever since the pandemic started, I feel more comfortable wearing a face mask\nthan showing my actual face. I feel like I'm too grotesque and ugly to look at\nand wearing a face mask kind of hides that. It's gotten to the point where I\nthink me wearing a face mask is my \"actual face\". Kind of like how…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンデミック以来、フェイスマスクをしていると安心するんです。\n顔を出すよりも 自分がグロテスクで醜いような気がしてなりません。\nマスクをしていると、それを隠してくれるような気がします。今では\nマスクをしているのが「素顔」だと思っています。例えるなら...",
      "title": "素顔を見せるよりもマスクをしている方が落ち着くというのは変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从大流行病开始以来，我觉得戴上口罩比露出真实的脸更舒服。\n而不是展示我真正的脸。我觉得自己太过怪异和丑陋，不忍直视\n而戴上口罩则可以掩盖这一点。现在已经到了这样的地步，我\n我认为我戴着口罩就是我的 \"真面目\"。有点像...",
      "title": "我觉得戴着面具比露出真面目更舒服，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從大流行病開始以來，我覺得戴上口罩比露出真實的臉更舒服。\n而不是展示我真正的臉。我覺得自己太過怪異和醜陋，不忍直視\n而戴上口罩則可以掩蓋這一點。現在已經到了這樣的地步，我\n我認爲我戴着口罩就是我的 \"真面目\"。有點像...",
      "title": "我覺得戴着面具比露出真面目更舒服，這很奇怪嗎？"
    }
  ]
}