{
  "author": "Stye88",
  "original_created_utc": 1639070946,
  "title": "The real flippening will be when this sub surpasses wsb.",
  "created_utc": 1639107241,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just half a year ago, wsb had around 8million subs, while cc had 2. Now it&amp;#39;s 11 million compared to 4 million, showing crypto is catching up at a rapid speed to stock&amp;#39;s popularity. Large portion of that migration might be due to realization that it will be harder and harder to pull off GME and I think we&amp;#39;re lately seeing more and more people who use both subs. &lt;/p&gt;\n\n&lt;p&gt;If that happens I think it&amp;#39;s possible TradFi might need to tokenize stocks so that people can use the same wallets for crypto and stocks, though that process I imagine would take at least a decade to fully transfer stocks, so after some brutal regulatory fights the outcome might be that stocks will be allowed both on blockchain and on paper.  What do you think?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/rcmjip/the_real_flippening_will_be_when_this_sub/",
  "subreddit": "CryptoCurrency",
  "id": "rcmjip",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just half a year ago, wsb had around 8million subs, while cc had 2. Now it's 11\nmillion compared to 4 million, showing crypto is catching up at a rapid speed to\nstock's popularity. Large portion of that migration might be due to realization\nthat it will be harder and harder to pull off GME and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど半年前、wsbの会員数は約800万人、ccは2人でした。現在では1100万人\n400万人に対し、暗号は400万人と、急速なスピードで追いついてきています。\n株の人気。この移行の大部分は、以下のことに気づいたからかもしれません。\nGMEやIを抜くのは難しくなってくるので......。",
      "title": "このサブ機がwsbを超えた時が、本当の意味でのフリップペンになるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在半年前，WSB有大约800万个子用户，而CC有2个。现在，它是11\n万，而CC只有400万，这表明加密货币正以极快的速度追赶上\n股票的普及。这种迁移的很大一部分可能是由于意识到\n它将越来越难拉开GME和I...",
      "title": "真正的翻天覆地将是当这个潜艇超过WSB时。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在半年前，WSB有大約800萬個子用戶，而CC有2個。現在，它是11\n萬，而CC只有400萬，這表明加密貨幣正以極快的速度追趕上\n股票的普及。這種遷移的很大一部分可能是由於意識到\n它將越來越難拉開GME和I...",
      "title": "真正的翻天覆地將是當這個潛艇超過WSB時。"
    }
  ]
}