{
  "author": "cemkar",
  "original_created_utc": 1651690322,
  "title": "Recent philosophy graduates: What did you end up doing after you graduated?",
  "created_utc": 1651764215,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Studying Philosophy&lt;/h1&gt;\n\n&lt;p&gt;I&amp;#39;m currently a junior, and I&amp;#39;ve been studying philosophy for about a semester now. Originally, I was a computer science major, yet I realized two years into college that I didn&amp;#39;t want to do software. (1) I&amp;#39;m really not passionate about it, as I thought I was. (2) I don&amp;#39;t want my whole career/life to consist of me working at a software firm. &lt;/p&gt;\n\n&lt;p&gt;I determined that I wanted to study philosophy because I just love reading philosophical literature, I love the absurd questions and trying to think about the deeper aspects of life (probably because I&amp;#39;ve always had so many questions about my own life and my place in it). &lt;/p&gt;\n\n&lt;p&gt;My interest in it began in high school, and since my job pays for college, I decided that I could afford to study something for more than just its ROI, and I&amp;#39;m so happy I made that decision (my major doesn’t make me miserable, i don’t have to spend 30+ hours a week studying for math tests, and I can just spend my time reading and writing). &lt;/p&gt;\n\n&lt;p&gt;Though, one of my biggest questions (even when I was a computer science major) is what I wanted to spend my life doing. In a deeper sense, &amp;quot;What is it out of my life that I want?&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really think I want to be financially successful, or famous, but I want to achieve something to leave the world with (even if it&amp;#39;s minuscule). The biggest things I&amp;#39;ve been trying to find out in my life always seem so far out of reach: romantic relationships, financial stability, a sense of well-being, and contentment with my current place in life.  &lt;/p&gt;\n\n&lt;p&gt;I like to write (poetry, fiction, web articles), though, I&amp;#39;m really struggling in trying to turn this into a living, and I&amp;#39;ve been trying to diversify myself with other skills: (journalism, minor in writing/publishing, minor in computer science, technical writing on GitHub). &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve considered law school or grad school, though I don&amp;#39;t think law school would bring me the contentment I&amp;#39;m looking for, and it wouldn&amp;#39;t even be worth it financially unless I go into major debt at a decent school. Graduate school I&amp;#39;m definitely considering, my job pays 100% tuition for the &lt;a href=\"https://online.arizona.edu/\"&gt;University of Arizona&lt;/a&gt;. Though their programs seem limited, and I don&amp;#39;t know what to pick. &lt;/p&gt;\n\n&lt;h1&gt;Questions&lt;/h1&gt;\n\n&lt;p&gt;My question to those of you who recently graduated with a B.A. in Philosophy: &lt;/p&gt;\n\n&lt;p&gt;(1) What did you end up doing after you graduated. &lt;/p&gt;\n\n&lt;p&gt;(2) What do you truly want to be doing. &lt;/p&gt;\n\n&lt;p&gt;(3) Do you think we all just end up falling into a career even though we don&amp;#39;t enjoy it, or because &amp;quot;life just happens&amp;quot;? &lt;em&gt;I have so many questions, and I can&amp;#39;t seem to find a specific path that I can wholeheartedly endeavor in, and this worries me because I feel as though I&amp;#39;ll just end up getting stuck in a career that I didn&amp;#39;t give much thought to.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/uido7y/recent_philosophy_graduates_what_did_you_end_up/",
  "subreddit": "askphilosophy",
  "id": "uido7y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "STUDYING PHILOSOPHY\n\nI'm currently a junior, and I've been studying philosophy for about a semester\nnow. Originally, I was a computer science major, yet I realized two years into\ncollege that I didn't want to do software. (1) I'm really not passionate about\nit, as I thought I was. (2) I don't want…"
}