{
  "author": "_Misjudged_",
  "the_new_excerpt": "Hi sorry for posting here. I was advised to ask on reddit. I am new to reddit so\nI only have 1 Karma. I would have posted to the r/cybersecurity\n[/r/cybersecurity] but I had too low of karma to post there.\n\nSo I am in a undergraduate Cybersecurity program. This is my second week of\ncollege and I…",
  "original_created_utc": 1621594806,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、ここに投稿してすみません。redditで質問するようにアドバイスを受けました。私はredditの初心者なので\n1つのカルマしか持っていません。私はr/cybersecurityに投稿するつもりでした。\n[/r/cybersecurity]に投稿しようと思いましたが、カルマが低すぎて投稿できませんでした。\n\n私は学部のCybersecurityプログラムに参加しています。これは私の大学の2週目です。\n大学に入って2週間目ですが、私は...",
      "title": "課題ではどのようなテーマを選べばよいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，很抱歉在这里发帖。有人建议我在reddit上提问。我是reddit的新手，所以\n我只有1个Karma。我本来想发到r/cybersecurity\n[/r/cybersecurity]，但我的业力太低，无法在那里发帖。\n\n我在读本科网络安全课程。这是我大学的第二个星期\n大学的第二周，我...",
      "title": "我应该为我的作业选择什么主题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，很抱歉在這裏發帖。有人建議我在reddit上提問。我是reddit的新手，所以\n我只有1個Karma。我本來想發到r/cybersecurity\n[/r/cybersecurity]，但我的業力太低，無法在那裏發帖。\n\n我在讀本科網絡安全課程。這是我大學的第二個星期\n大學的第二週，我...",
      "title": "我應該爲我的作業選擇什麼主題？"
    }
  ],
  "title": "What topic should i choose for my assignment?",
  "created_utc": 1621648607,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi sorry for posting here. I was advised to ask on reddit. I am new to reddit so I only have 1 Karma. I would have posted to the <a href=\"/r/cybersecurity\">r/cybersecurity</a> but I had too low of karma to post there.</p>\n\n<p>So I am in a undergraduate Cybersecurity program. This is my second week of college and I already have 5 assignments. I need to choose a fairly recent security breach and write an assignment from <strong>Laws and Security policies</strong> point of view.  Honestly I would take my time to google and research the topics to choose myself, but this one is due in 5days and already have 4 other assignment. I have already wasted 2 days looking for topics and got overwhelmed.</p>\n\n<p>There are so many topics to choose from and so little time. So please can cybersecurity/netsec guys  reading this help me choose a topic that already has lot of analysis done.</p>\n\n<p>Thank you.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit:- This is the most helpful community I have seen so far. I got so many helpful responses in such short time. I have shortlisted to  Anthem, Equifax, JP Morgan Chase, Adobe. I will choose one of these and hopefully complete it before due date.</p>\n\n<p><strong>You guys are awesome.</strong></p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/nhpqrg/what_topic_should_i_choose_for_my_assignment/",
  "subreddit": "NoStupidQuestions",
  "id": "nhpqrg",
  "is_self": true,
  "media": null,
  "is_video": false
}