{
  "author": "Nostalg33k",
  "original_created_utc": 1633090461,
  "title": "Congrats to beginners who survived September !",
  "created_utc": 1633102962,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey this post is for us noobs! Just congrats for surviving this small dip. I didn&#39;t survive the one this summer but here I didn&#39;t sell and I bought the dip.</p>\n\n<p>We are now in green territory and bravo to you! Let this be a learning lesson ! You just have to wait to see green again in your portfolio. Let&#39;s brace, for there are greener valleys to discover !</p>\n\n<p>If you didn&#39;t sell during this period tell your stories please ! So that we grow together ! We can prepare our mental for the next dip and learn to slowly win here !!   </p>\n\n<p>I&#39;m so glad to be in the profits again ! Let&#39;s all celebrate this start of October ! =)</p>\n</div><!-- SC_ON -->",
  "score": 284,
  "permalink": "/r/CryptoCurrency/comments/pz6q0r/congrats_to_beginners_who_survived_september/",
  "subreddit": "CryptoCurrency",
  "id": "pz6q0r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey this post is for us noobs! Just congrats for surviving this small dip. I\ndidn't survive the one this summer but here I didn't sell and I bought the dip.\n\nWe are now in green territory and bravo to you! Let this be a learning lesson !\nYou just have to wait to see green again in your portfolio.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事は私たち初心者のためのものです。この小さなディップを乗り切ったことを祝福します。I\n私は今年の夏には生き残れませんでしたが、ここでは売らずにディップを買いました。\n\n今、私たちは緑の領域にいますが、あなたに感謝します。これを教訓にしましょう!\nあなたのポートフォリオが再びグリーンになるのを待つしかありません。....",
      "title": "9月を乗り切ったビギナーの皆さん、おめでとうございます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，这个帖子是为我们这些新手准备的! 祝贺你在这次小跌中幸存下来。I\n我没能在今年夏天的那次下跌中幸存下来，但在这里我没有卖出，而是买入了下跌的股票。\n\n我们现在是在绿色区域，为你喝彩! 让这成为一个学习的教训吧！你只需等待看到绿色。\n你只需等待在你的投资组合中再次看到绿色....。",
      "title": "祝贺熬过9月的初学者们!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，這個帖子是爲我們這些新手準備的! 祝賀你在這次小跌中倖存下來。I\n我沒能在今年夏天的那次下跌中倖存下來，但在這裏我沒有賣出，而是買入了下跌的股票。\n\n我們現在是在綠色區域，爲你喝彩! 讓這成爲一個學習的教訓吧！你只需等待看到綠色。\n你只需等待在你的投資組合中再次看到綠色....。",
      "title": "祝賀熬過9月的初學者們!"
    }
  ]
}