{
  "author": "robis87",
  "original_created_utc": 1624272840,
  "title": "The China FUD to end all FUDs: Why today's Chinese crypto ban No 37 is extremely bullish long-term",
  "created_utc": 1624307839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>During my almost 4 years in crypto, C<em>hina</em> and <em>ban</em> have been single two most frequently seen words in a sentence - no competition. With each ban there was naturally less and less effect on the actual market. But it looks like recently the Chinese went all out with their crypto ban hammer on all levels (so conveniently coinciding with the final stages of the Digital Yuan launch).</p>\n\n<p>For a long time, <em>Chinese controlling Bitcoin and it&#39;s hashrate</em>, was a leading FUD of the opponents of Bitcoin in general. Well guess what, it&#39;s no longer valid - they might have hoarded millions of BTC, but they will no longer have 51% of the network power, and that&#39;s a game changer. </p>\n\n<p>Now with their Central Bank forbidding banks and payment providers to deal with crypto-related businesses, the FUD narrative seems to be virtually exhausted. They won&#39;t go on banning the actual ownership of crypto, since it&#39;s unfeasible (and their own courts define Bitcoin as an asset class that can&#39;t be confiscated on no substantial grounds).</p>\n\n<p>So it&#39;s way better to take this short-term beating, but to decouple from that authoritarian manipulative country for good.</p>\n</div><!-- SC_ON -->",
  "score": 506,
  "permalink": "/r/CryptoCurrency/comments/o4sg8a/the_china_fud_to_end_all_fuds_why_todays_chinese/",
  "subreddit": "CryptoCurrency",
  "id": "o4sg8a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "During my almost 4 years in crypto, China and ban have been single two most\nfrequently seen words in a sentence - no competition. With each ban there was\nnaturally less and less effect on the actual market. But it looks like recently\nthe Chinese went all out with their crypto ban hammer on all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の約4年間の暗号の世界では、中国と禁止が最も頻繁に目にする言葉でした。\n競合するものはありません。禁止されるたびに、実際の市場への影響は\n実際の市場への影響は当然少なくなっていきます。しかし、最近のように\n中国は全力で暗号化禁止のハンマーを...",
      "title": "すべてのFUDを終わらせるための中国のFUDです。今日の中国の暗号禁止No37が長期的に極めて強気な理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我从事加密货币的近4年时间里，中国和禁令一直是单一的两个最自由的国家。\n句子中最常出现的两个词--没有竞争。随着每项禁令的出台\n对实际市场的影响自然越来越小。但看起来最近\n中国全力以赴，对所有加密货币的禁令进行了敲打。",
      "title": "中国的疑虑是所有疑虑的终结。为什么今天的中国加密货币禁令第37号是非常长期的看涨。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我從事加密貨幣的近4年時間裏，中國和禁令一直是單一的兩個最自由的國家。\n句子中最常出現的兩個詞--沒有競爭。隨着每項禁令的出臺\n對實際市場的影響自然越來越小。但看起來最近\n中國全力以赴，對所有加密貨幣的禁令進行了敲打。",
      "title": "中國的疑慮是所有疑慮的終結。爲什麼今天的中國加密貨幣禁令第37號是非常長期的看漲。"
    }
  ]
}