{
  "author": "PunPryde",
  "original_created_utc": 1628316376,
  "title": "ETH just completed a history-making 16 green candles in 17 days and now is going for 17 in 18 days. This has never happened before!",
  "created_utc": 1628332957,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We just had the history-making 13 green candles in a row for ETH until it broke at day 14. Many thought ETH would &quot;sell the news&quot; on the London hard fork upgrade which included EIP-1559. However, ETH had other plans and has been rallying before and after the hard fork. With the ETH burning in full swing it seems to be accelerating the rally!</p>\n\n<p>Yesterday, ETH completed 16 green candles in 17 days and now is going for 17 in 18 days today. This has also never happened before in it&#39;s 6 year history. I actually can&#39;t think of any $200B+ asset that has had such a relentless continuous rally before. I recommend opening up the ETH daily chart and looking at this sea of unstoppable green, it&#39;s a thing of beauty. During this incredible run ETH has gone from $1,706 and now is at $2,963 representing a +74% rally. Now let&#39;s take $3,000 and keep going!!!</p>\n</div><!-- SC_ON -->",
  "score": 365,
  "permalink": "/r/CryptoCurrency/comments/oznwv4/eth_just_completed_a_historymaking_16_green/",
  "subreddit": "CryptoCurrency",
  "id": "oznwv4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We just had the history-making 13 green candles in a row for ETH until it broke\nat day 14. Many thought ETH would \"sell the news\" on the London hard fork\nupgrade which included EIP-1559. However, ETH had other plans and has been\nrallying before and after the hard fork. With the ETH burning in full…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETHは14日目にブレイクするまで、歴史に残る13本の緑のローソクが連続していました。\n14日目にブレイクしました。EIP-1559を含むロンドンのハードフォークのアップグレードでETHは「ニュースを売る」と多くの人が考えていた。\nEIP-1559を含むアップグレードが行われると考えていました。しかし、ETHには別の計画がありました。\nハードフォークの前後で上昇しています。ETHが完全に燃えている状態で...",
      "title": "ETHは歴史に残る17日間で16本の緑のローソク足を完成させ、現在は18日間で17本を目指しています。これは今までになかったことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们刚刚为ETH创造了连续13根绿色蜡烛的历史，直到它在第14天被打破。\n在第14天。许多人认为ETH会在伦敦硬分叉时 \"卖出消息\"。\n升级，其中包括EIP-1559。然而，ETH有其他的计划，并且一直在\n在硬分叉之前和之后都在反弹。随着ETH的全面燃烧...",
      "title": "ETH刚刚在17天内完成了创造历史的16根绿色蜡烛，现在正准备在18天内完成17根。这在以前从来没有发生过!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們剛剛爲ETH創造了連續13根綠色蠟燭的歷史，直到它在第14天被打破。\n在第14天。許多人認爲ETH會在倫敦硬分叉時 \"賣出消息\"。\n升級，其中包括EIP-1559。然而，ETH有其他的計劃，並且一直在\n在硬分叉之前和之後都在反彈。隨着ETH的全面燃燒...",
      "title": "ETH剛剛在17天內完成了創造歷史的16根綠色蠟燭，現在正準備在18天內完成17根。這在以前從來沒有發生過!"
    }
  ]
}