{
  "author": "Set1Less",
  "original_created_utc": 1645067646,
  "title": "If you thought CBDC’s are here to help people, here is some clarity from Bank of International Settlement’s head: “With cash, we dont know who is using a $100 bill and who is using a 1000 pesos bill. A key difference in CBDC is that the central bank will have absolute control over its use.”",
  "created_utc": 1645094426,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many people seem to think CBDCs are the next step in crypto adoption, and governments are keen on introducing CBDCs to help people spend and invest in crypto in a safe manner instead of having to rely on risky tokens like USDT. I’ve seen statement thrown around like “CBDC will render Bitcoin useless.”&lt;/p&gt;\n\n&lt;p&gt;If you thought so, here is some clarity on what CBDC’s actually help to accomplish. &lt;/p&gt;\n\n&lt;p&gt;Agustín Carstens, head of the Bank of International Settlements: &lt;a href=\"https://www.youtube.com/watch?v=rpNnTuK5JJU\"&gt;https://www.youtube.com/watch?v=rpNnTuK5JJU&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We don’t know who’s using a $100 bill today and we don’t know who’s using a 1,000 peso bill today.  &lt;/p&gt;\n\n&lt;p&gt;The key difference with the CBDC is the central bank will have absolute control on the rules and regulations that will determine the use of that expression of central bank liability, and also we will have the technology to enforce that.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is not a joke, nor are they even trying to be subtle about it. The goal of CBDC is to enable governments to have complete control over people’s finances. They can already do this to a great extent with the current financial system where most transactions are already electronic, but due to intermediaries like retail banks, the Central Banks are not in an immediate position to halt or know about everyone’s finances. CBDCs are designed to over come this. With CBDCs, the government can directly seize a user’s funds without having to go through retail banks.&lt;br/&gt;\n The current electronic payment system already allows governments and central banks to have complete control over the users of the electronic network. CBDCs just help them exert their control in a more efficient manner. &lt;/p&gt;\n\n&lt;p&gt;This is how CBDCs are implemented in China. Everything is through their CBDC Digital Yuan app. Money cannot leave that app, nor can it be sent to anyone outside that network. This is how every single proposed CBDC framework looks like. You can transfer/receive CBDCs from others on the same network, thats all. All the funds on the network are ring fenced and cannot leave or enter this system unless the central bank allows for it. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/pjh9gk0u7bi81.jpg?width=2560&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=dec8bd3d91cdc23daf668bcb3bdab4034df1ca4e\"&gt;Digital Yuan app&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;CBDC shills (i.e. central bankers, regulators etc) will try to claim CBDC&amp;#39;s are &amp;quot;programmable money&amp;quot;. They are not wrong, but it is &amp;quot;programmable&amp;quot; only by the central bank and the programming enables them to stop payments and remove your access to money. CBDC&amp;#39;s are not programmable by end users, developers who want to build with the CBDC. Any attempt to program CBDC must be signed off by the central banks. They are just stealing terms like &amp;quot;programmable money&amp;quot; from decentralised cryptocurrency jargon and using this narrative to pitch to those who do not have an understanding about crypto for the CBDC gotcha moment: &amp;quot;Look CBDCs are here, now your crypto coins dont have a use!&amp;quot;. It&amp;#39;s false advertising for those unaware of what CBDCs are. &lt;/p&gt;\n\n&lt;p&gt;If you thought CBDCs are going to allow you to invest in your favourite defi apps or use it as a replacement for USD Stablecoins to earn more interest, that is not going to happen. Once CBDCs are mainstream, the next goal would be to prohibit cash transactions completely, so that the entire economy can be controlled by a centralised entity. The only obstacle standing in this path is the emergence of decentralised currencies.  &lt;/p&gt;\n\n&lt;p&gt;CBDCs are a privacy nightmare straight from a dystopian novel, and an autocrats dream. Central Banks are taking the worst of the crypto industry and devising ways to use it so that the governments can have even more power over their subjects.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 346,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/2SLEAhrOzlfMwk67t9oGYrhjZCIrcjR55F-nZfdwQgk.jpg?auto=webp&amp;s=604063232e476794394865736da5f7f3f6019484",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/2SLEAhrOzlfMwk67t9oGYrhjZCIrcjR55F-nZfdwQgk.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=1e43d5876df7e23c45f42b841fc0f1063a84d993",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/2SLEAhrOzlfMwk67t9oGYrhjZCIrcjR55F-nZfdwQgk.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=05baac795e5ae790ed3bf65433a6a3ff6c2cee5f",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/2SLEAhrOzlfMwk67t9oGYrhjZCIrcjR55F-nZfdwQgk.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=59b12c5ac3c2f738ec996e615885418afac5c129",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "2PdlHJE3ewu6iLtSeAObogEvdD2-1EbTtPiiWE73uNQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/suegcg/if_you_thought_cbdcs_are_here_to_help_people_here/",
  "subreddit": "CryptoCurrency",
  "id": "suegcg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Many people seem to think CBDCs are the next step in crypto adoption, and\ngovernments are keen on introducing CBDCs to help people spend and invest in\ncrypto in a safe manner instead of having to rely on risky tokens like USDT.\nI’ve seen statement thrown around like “CBDC will render Bitcoin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人がCBDCは暗号の普及の次のステップだと考えているようで\n各国政府は、人々の消費と投資を助けるためにCBDCの導入に熱心である。\nUSDTのようなリスクの高いトークンに頼ることなく、安全な方法で暗号化することができます。\nCBDCはビットコインをレンダリングする...」というような文言が投げかけられるのを見たことがあります。",
      "title": "CBDCは人々を助けるためにあるのだと思っていたら、Bank of International Settlementのトップから明言がありました。「現金の場合、誰が100ドル札を使っていて、誰が1000ペソ札を使っているのかわかりません。CBDCの重要な違いは、中央銀行がその使用を絶対的に管理することです。\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多人似乎认为CBDCs是加密货币应用的下一步，而且政府热衷于引入CBDCs，以帮助人们消费和投资。\n政府热衷于引入CBDCs，以帮助人们安全地消费和投资于\n政府热衷于引入CBDC，以帮助人们以安全的方式消费和投资加密货币，而不是依赖USDT这样的风险代币。\n我已经看到一些说法，如 \"CBDC将使比特币...",
      "title": "如果你认为CBDC是来帮助人们的，这里有国际清算银行负责人的一些澄清。\"对于现金，我们不知道谁在使用100美元的钞票，谁在使用1000比索的钞票。CBDC的一个关键区别是，中央银行将对其使用有绝对的控制权。\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多人似乎認爲CBDCs是加密貨幣應用的下一步，而且政府熱衷於引入CBDCs，以幫助人們消費和投資。\n政府熱衷於引入CBDCs，以幫助人們安全地消費和投資於\n政府熱衷於引入CBDC，以幫助人們以安全的方式消費和投資加密貨幣，而不是依賴USDT這樣的風險代幣。\n我已經看到一些說法，如 \"CBDC將使比特幣...",
      "title": "如果你認爲CBDC是來幫助人們的，這裏有國際清算銀行負責人的一些澄清。\"對於現金，我們不知道誰在使用100美元的鈔票，誰在使用1000比索的鈔票。CBDC的一個關鍵區別是，中央銀行將對其使用有絕對的控制權。\""
    }
  ]
}