{
  "author": "geedaang",
  "original_created_utc": 1657653786,
  "title": "How did this magician turn off my fucking TV?",
  "created_utc": 1657677336,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been trying to figure this out for 30 years. It&amp;#39;s always there, in the back of my mind. I can&amp;#39;t find a video or even remember the magician&amp;#39;s name, but I was about 5 years old at my adult (mid 20s) cousins&amp;#39; house. I was alone, watching TV, and this magician is doing tricks. Sleight of hand, card tricks, rabbit out of the hat, etc. Standard stuff. Then this guy looks me dead in the eye on the TV, says, &amp;quot;this trick is for you at home. Yes, you. Now, on the count of 3, I&amp;#39;m going to turn your TV off to prove to you that magic is real.\n&amp;quot;No way,&amp;quot; thought.\nI was a fool.\nHe started counting all dramatic, flourishing his hands, &amp;quot;One... Two...&amp;quot; \n&amp;quot;There&amp;#39;s no way.&amp;quot; \n&amp;quot;Three!&amp;quot;\nAnd the the fucking TV turned off. &amp;quot;WHAT.&amp;quot; I scrambled for the remote and rushed to turn it back on. And there he was, front and center, standing with his arms behind his back, smug grin plastered on his face. &amp;quot;Now do you believe?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Guys this whole thing has been living in my head rent free for decades. I can&amp;#39;t figure it out. There&amp;#39;s no way. This was sometime around 92 - 94. My cousins didn&amp;#39;t have universal remotes. I was alone when it happened and no one believes me. But it was real. It happened. There has to be an explanation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 292,
  "permalink": "/r/NoStupidQuestions/comments/vxja9e/how_did_this_magician_turn_off_my_fucking_tv/",
  "subreddit": "NoStupidQuestions",
  "id": "vxja9e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been trying to figure this out for 30 years. It's always there, in the back\nof my mind. I can't find a video or even remember the magician's name, but I was\nabout 5 years old at my adult (mid 20s) cousins' house. I was alone, watching\nTV, and this magician is doing tricks. Sleight of hand,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "30年間、このことを考え続けてきたんだ。いつも頭の片隅にある\n心の中に ビデオも見つからないし、マジシャンの名前も覚えていないのですが、5年前くらいに\n歳くらいの時に大人（20代半ば）の従兄弟の家で 一人でテレビを見ていたら\nテレビを見ていると、そのマジシャンが手品をしているんです。手品、...",
      "title": "このマジシャンはどうやって私のクソテレビを消したんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "30年来，我一直想弄清楚这个问题。它总是在那里，在我的脑海里\n在我的脑海中。我找不到视频，甚至不记得那个魔术师的名字，但我当时\n大约5岁的时候，在我成年（20多岁）的表兄弟家。我独自一人，看着\n电视，而这个魔术师正在表演魔术。巧妙的手势，...",
      "title": "这个魔术师是如何关掉我那该死的电视的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "30年來，我一直想弄清楚這個問題。它總是在那裏，在我的腦海裏\n在我的腦海中。我找不到視頻，甚至不記得那個魔術師的名字，但我當時\n大約5歲的時候，在我成年（20多歲）的表兄弟家。我獨自一人，看着\n電視，而這個魔術師正在表演魔術。巧妙的手勢，...",
      "title": "這個魔術師是如何關掉我那該死的電視的？"
    }
  ]
}