{
  "author": "dicjcjcnc",
  "original_created_utc": 1658598505,
  "title": "Not to sound cheap but am I the only person who thinks tipping culture in America is getting out of hand?",
  "created_utc": 1658604503,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Its like every time you leave your house, someone’s asking for a tip. Before it was “if you can’t tip, you can’t afford to eat out.” Ok that’s fine. But now cashiers are expecting tips just for ringing up your order and spinning those stupid iPads around that asks us how much we wanna tip. The way I see it, if I’m standing up to receive my service I’m not tipping anyone. Not to sound like a dick but at some point, workers have to realize they are just simply doing their jobs that they signed up to get paid for. I’m in customer service by the way but I found it odd how places that don’t actually serve you ask for tips. I never got tips as a fast food worker, nor did I expect tips. Same for retail. I will always tip servers though. It’s sad because customer service workers get mad at us instead of realizing the actual problem is corporate greed. The problem is your employer who is making millions in profit thinks it’s okay to pay you minimum wage, not me who is also making minimum wage. Tipping culture really is a way to keep the rich richer and the poor even more poor, and we’re all eating it up. It worries me because before you know it, EVERY single job is going to pay below minimum wage because the employer will expect working class customers to pay their wages. Corporations are smart for this though. They pay their workers peanuts and for some reason, people get mad at customers instead of them. They get to keep more profits while we continue being poor.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 129,
  "permalink": "/r/NoStupidQuestions/comments/w69su4/not_to_sound_cheap_but_am_i_the_only_person_who/",
  "subreddit": "NoStupidQuestions",
  "id": "w69su4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Its like every time you leave your house, someone’s asking for a tip. Before it\nwas “if you can’t tip, you can’t afford to eat out.” Ok that’s fine. But now\ncashiers are expecting tips just for ringing up your order and spinning those\nstupid iPads around that asks us how much we wanna tip. The way…"
}