{
  "author": "Kamminginhot34",
  "original_created_utc": 1647176029,
  "title": "Do men like to get Anal and BJ at the Same time ??",
  "created_utc": 1647188759,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So... I did that to my Husband, for the 1st time.\n I used Dildo in his ass and suck him off at the same time... I don&amp;#39;t know what came over me.. I just did it, well ofc with his consent. He seems to enjoy it alot..actually.  He told me that was the strongest  cum he ever had,.... now....Since he likes it too much I am started to concern if I should Keep doing it or let it be as a one time thing... cuz now I&amp;#39;m abit confused....&lt;/p&gt;\n\n&lt;p&gt;Sorry for the TMI but need to hear some perspectives..&lt;/p&gt;\n\n&lt;p&gt;Thank you.&lt;/p&gt;\n\n&lt;p&gt;EDIT : let me be abit more clear. I was just a bit confused cuz I didn&amp;#39;t think it would be something a guy would enjoy. Silly me right?\nI did it to be more sort of punishment roleplay\nSo when he admitted that he actually love it.\nI freaked out abit. But, thanks to u all. I understand it better now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/TooAfraidToAsk/comments/td6bnp/do_men_like_to_get_anal_and_bj_at_the_same_time/",
  "subreddit": "TooAfraidToAsk",
  "id": "td6bnp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "So... I did that to my Husband, for the 1st time. I used Dildo in his ass and\nsuck him off at the same time... I don't know what came over me.. I just did it,\nwell ofc with his consent. He seems to enjoy it alot..actually. He told me that\nwas the strongest cum he ever had,.... now....Since he likes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それで・・・私は初めて夫にそれをしました。ディルドを彼のお尻に挿しながら\n同時にフェラして...。何が起こったのかわからない... 私はただそれをやった。\nもちろん、彼の同意の上で。彼はそれをとても楽しんでいるようです...実際。彼は私にこう言いました。\nは今までで一番強いザーメンだった、、、今は、、、彼が好きだから、、、。",
      "title": "男性はアナルとBJを同時にされるのが好きなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以......我第一次对我丈夫做了这个。我用假阳具插入他的屁股，同时\n同时为他口交... 我不知道我是怎么了。我就这样做了。\n当然是在他同意的情况下。他似乎很享受这个过程，实际上。他告诉我\n是他有史以来最强烈的精液，....，因为他喜欢......。",
      "title": "男人喜欢同时接受肛交和BJ吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以......我第一次對我丈夫做了這個。我用假陽具插入他的屁股，同時\n同時爲他口交... 我不知道我是怎麼了。我就這樣做了。\n當然是在他同意的情況下。他似乎很享受這個過程，實際上。他告訴我\n是他有史以來最強烈的精液，....，因爲他喜歡......。",
      "title": "男人喜歡同時接受肛交和BJ嗎？"
    }
  ]
}