{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "June 30 (Reuters) - Facebook-owner Meta Platforms Inc (META.O) is bracing for a leaner second half of the year, as it copes with macroeconomic pressures and data privacy hits to its ads business, according to an internal memo seen by Reuters on Thursday.\n\nThe company must \"prioritize more ruthlessly\" and \"operate leaner, meaner, better executing teams,\" Chief Product Officer Chris Cox wrote in the memo, which appeared on the company's internal discussion forum Workplace.\n\n\"I have to underscore that we are in serious times here and the headwinds are fierce. We need to execute flawlessly in an environment of slower growth, where teams should not expect vast influxes of new engineers and budgets,\" Cox wrote.\n\nMeta did not immediately respond to a request for comment.\n\nThe memo is the latest rough forecast to come from Meta executives, who already moved to trim costs and pause hiring across much of the company this year in the face of slowing ad sales and user growth.\n\nTech companies across the board have scaled back their ambitions in anticipation of a possible U.S. recession, although the slide in stock price at Meta has been more severe than at competitors Apple (AAPL.O) and Google (GOOGL.O).\n\nThe world's biggest social media company lost about half its market value this year, after Meta reported that daily active users on its flagship Facebook app had experienced a quarterly decline for the first time. \n\nIts austerity drive comes at a tricky time, coinciding with two major strategic pivots: one aimed at re-fashioning its social media products around \"discovery\" to beat back competition from short-video app TikTok, the other an expensive long-term bet on augmented and virtual reality technology.\n\nIn his memo, Cox said Meta would need to increase fivefold the number of graphic processing units (GPUs) in its data centers by the end of the year to support the \"discovery\" push, which requires extra computing power for artificial intelligence to surface popular posts from across Facebook and Instagram in users' feeds.\n\nInterest in Meta's TikTok-style short video product Reels was growing quickly, said Cox, with users doubling the amount of time they were spending on Reels year over year, both in the United States and globally.\n\nSome 80% of the growth since March came from Facebook, he added.\n\nThat user engagement with Reels could provide a key route to bolster the bottom line, making it important to boost ads in Reels \"as quickly as possible,\" he added.\n\nChief Executive Mark Zuckerberg told investors in April that executives viewed Reels as \"a major part of the discovery engine vision,\" but at the time described the short video shift as a \"short-term headwind\" that would increase revenue gradually as advertisers became more comfortable with the format.\n\nCox said Meta also saw possibilities for revenue growth in business messaging and in-app shopping tools, the latter of which, he added, could \"mitigate signal loss\" created by Apple-led privacy changes.\n\nHe said the company's hardware division was \"laser-focused\" on successfully launching its mixed-reality headset, code-named \"Cambria,\" in the second half of the year. Meta was also focused on linking accounts across its virtual reality products and traditional social media apps, he said.\n\nZuckerberg will share more on the company's priorities and outlook at the company's next Q&amp;A, he said. The weekly session is set to take place on Thursday.\n\nhttps://www.reuters.com/technology/exclusive-meta-girds-fierce-headwinds-slower-growth-second-half-memo-2022-06-30/",
  "author_fullname": "t2_a1fdck05",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Meta girds for 'fierce' headwinds, slower growth in second half -memo",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "tickernews",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_vol6bl",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.86,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 42,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company News",
  "can_mod_post": false,
  "score": 42,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1656629174,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;June 30 (Reuters) - Facebook-owner Meta Platforms Inc (META.O) is bracing for a leaner second half of the year, as it copes with macroeconomic pressures and data privacy hits to its ads business, according to an internal memo seen by Reuters on Thursday.&lt;/p&gt;\n\n&lt;p&gt;The company must &amp;quot;prioritize more ruthlessly&amp;quot; and &amp;quot;operate leaner, meaner, better executing teams,&amp;quot; Chief Product Officer Chris Cox wrote in the memo, which appeared on the company&amp;#39;s internal discussion forum Workplace.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I have to underscore that we are in serious times here and the headwinds are fierce. We need to execute flawlessly in an environment of slower growth, where teams should not expect vast influxes of new engineers and budgets,&amp;quot; Cox wrote.&lt;/p&gt;\n\n&lt;p&gt;Meta did not immediately respond to a request for comment.&lt;/p&gt;\n\n&lt;p&gt;The memo is the latest rough forecast to come from Meta executives, who already moved to trim costs and pause hiring across much of the company this year in the face of slowing ad sales and user growth.&lt;/p&gt;\n\n&lt;p&gt;Tech companies across the board have scaled back their ambitions in anticipation of a possible U.S. recession, although the slide in stock price at Meta has been more severe than at competitors Apple (AAPL.O) and Google (GOOGL.O).&lt;/p&gt;\n\n&lt;p&gt;The world&amp;#39;s biggest social media company lost about half its market value this year, after Meta reported that daily active users on its flagship Facebook app had experienced a quarterly decline for the first time. &lt;/p&gt;\n\n&lt;p&gt;Its austerity drive comes at a tricky time, coinciding with two major strategic pivots: one aimed at re-fashioning its social media products around &amp;quot;discovery&amp;quot; to beat back competition from short-video app TikTok, the other an expensive long-term bet on augmented and virtual reality technology.&lt;/p&gt;\n\n&lt;p&gt;In his memo, Cox said Meta would need to increase fivefold the number of graphic processing units (GPUs) in its data centers by the end of the year to support the &amp;quot;discovery&amp;quot; push, which requires extra computing power for artificial intelligence to surface popular posts from across Facebook and Instagram in users&amp;#39; feeds.&lt;/p&gt;\n\n&lt;p&gt;Interest in Meta&amp;#39;s TikTok-style short video product Reels was growing quickly, said Cox, with users doubling the amount of time they were spending on Reels year over year, both in the United States and globally.&lt;/p&gt;\n\n&lt;p&gt;Some 80% of the growth since March came from Facebook, he added.&lt;/p&gt;\n\n&lt;p&gt;That user engagement with Reels could provide a key route to bolster the bottom line, making it important to boost ads in Reels &amp;quot;as quickly as possible,&amp;quot; he added.&lt;/p&gt;\n\n&lt;p&gt;Chief Executive Mark Zuckerberg told investors in April that executives viewed Reels as &amp;quot;a major part of the discovery engine vision,&amp;quot; but at the time described the short video shift as a &amp;quot;short-term headwind&amp;quot; that would increase revenue gradually as advertisers became more comfortable with the format.&lt;/p&gt;\n\n&lt;p&gt;Cox said Meta also saw possibilities for revenue growth in business messaging and in-app shopping tools, the latter of which, he added, could &amp;quot;mitigate signal loss&amp;quot; created by Apple-led privacy changes.&lt;/p&gt;\n\n&lt;p&gt;He said the company&amp;#39;s hardware division was &amp;quot;laser-focused&amp;quot; on successfully launching its mixed-reality headset, code-named &amp;quot;Cambria,&amp;quot; in the second half of the year. Meta was also focused on linking accounts across its virtual reality products and traditional social media apps, he said.&lt;/p&gt;\n\n&lt;p&gt;Zuckerberg will share more on the company&amp;#39;s priorities and outlook at the company&amp;#39;s next Q&amp;amp;A, he said. The weekly session is set to take place on Thursday.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reuters.com/technology/exclusive-meta-girds-fierce-headwinds-slower-growth-second-half-memo-2022-06-30/\"&gt;https://www.reuters.com/technology/exclusive-meta-girds-fierce-headwinds-slower-growth-second-half-memo-2022-06-30/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5a4c814a-65e6-11e5-b65e-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f9cc80",
  "id": "vol6bl",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "rockinoutwith2",
  "discussion_type": null,
  "num_comments": 31,
  "send_replies": false,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/vol6bl/meta_girds_for_fierce_headwinds_slower_growth_in/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/vol6bl/meta_girds_for_fierce_headwinds_slower_growth_in/",
  "subreddit_subscribers": 4247593,
  "created_utc": 1656655574,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1656629174,
  "the_new_excerpt": "June 30 (Reuters) - Facebook-owner Meta Platforms Inc (META.O) is bracing for a\nleaner second half of the year, as it copes with macroeconomic pressures and\ndata privacy hits to its ads business, according to an internal memo seen by\nReuters on Thursday.\n\nThe company must \"prioritize more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "6月30日（ロイター） - フェイスブックのオーナーであるメタ・プラットフォームズ社（META.O）は、マクロ経済的な問題に対処するため、下半期は縮小傾向にあるとみている。\nマクロ経済的な圧力と広告ビジネスへのデータプライバシー侵害に対処するため、今年後半は縮小傾向にある。\n広告事業がデータ・プライバシーの問題で打撃を受けたため、下半期は縮小する見通しだ。\nロイターが木曜日に公開した社内メモによると、同社は「より多くのことを優先しなければならない。\n\n同社は、「より多くの...",
      "title": "メタは「激しい」逆風と下期の成長鈍化に備える -memo"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "6月30日（路透社）--Facebook的所有者Meta Platforms Inc（META.O）正在为下半年的业绩做准备。\n应对宏观经济压力和数据隐私对其广告业务的影响，今年下半年将面临更严峻的形势。\n根据路透社周四看到的一份内部备忘录，该公司正在为下半年的精简做准备。\n路透社周四看到的一份内部备忘录。\n\n该公司必须 \"优先考虑更多...",
      "title": "美达公司准备应对 \"激烈的 \"逆风，下半年增长放缓-备忘录"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "6月30日（路透社）--Facebook的所有者Meta Platforms Inc（META.O）正在爲下半年的業績做準備。\n應對宏觀經濟壓力和數據隱私對其廣告業務的影響，今年下半年將面臨更嚴峻的形勢。\n根據路透社週四看到的一份內部備忘錄，該公司正在爲下半年的精簡做準備。\n路透社週四看到的一份內部備忘錄。\n\n該公司必須 \"優先考慮更多...",
      "title": "美達公司準備應對 \"激烈的 \"逆風，下半年增長放緩-備忘錄"
    }
  ]
}