{
  "author": "jwinterm",
  "the_new_excerpt": "As everyone has seen, allowing everyone to post one meme per day results in the\nsub being completely overrun with memes for whatever days this is allowed,\ncurrently Saturday and Sunday UTC time. This policy of allowing memes only on\nthe weekend was adopted because the previous policy of only…",
  "original_created_utc": 1614686524,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家都看到了，允许每个人每天发一个备忘录的结果是：。\n子被完全溢出与备忘录无论天这是允许的。\n目前是UTC时间周六和周日。这个政策只允许在\n周末之所以采用，是因为之前的政策只...",
      "title": "建议将所有的备忘录移到不同的子reddit。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家都看到了，允許每個人每天發一個備忘錄的結果是：。\n子被完全溢出與備忘錄無論天這是允許的。\n目前是UTC時間週六和週日。這個政策只允許在\n週末之所以採用，是因爲之前的政策只...",
      "title": "建議將所有的備忘錄移到不同的子reddit。"
    }
  ],
  "title": "Proposal to move all memes to a different subreddit",
  "created_utc": 1614695487,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As everyone has seen, allowing everyone to post one meme per day results in the sub being completely overrun with memes for whatever days this is allowed, currently Saturday and Sunday UTC time. This policy of allowing memes only on the weekend was adopted because the previous policy of only allowing two meme/COMEDY posts in the top 50 during the week and five meme/COMEDY posts on the weekend was prone to being gamed, and was a constant source of frustration for users who felt (fairly or unfairly) that the memes that did make it into the top 50 and stick didn&#39;t deserve to be there soaking up karma while their own precious creation was removed by a bot.</p>\n\n<p>This proposal would disallow all simple image and gif posts in <a href=\"/r/CryptoCurrency\">/r/CryptoCurrency</a>. We would still allow COMEDY flaired posts in the main sub, such as <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/luu7pa/english_is_outdated/\">this one</a>, and those posts would be subject to the proposal that recently passed limiting karma to COMEDY flaired posts. However, direct link to an image, images, or gif would not be allowed to be posted in this subreddit.</p>\n\n<p>Of course, we don&#39;t want to kill all memes (well maybe some mods do, but not all of us), so what we are proposing is to shift all memery to our sister subreddit <a href=\"/r/CryptoCurrencyMemes\">/r/CryptoCurrencyMemes</a>. In the immediate term the plan is to reward the top five meme posts in terms of upvotes that sub has at the end of each week UTC time with MOONs from the mod/community pot in the amount of 400, 250, 150, 100, 50 MOONs. In the medium term, let&#39;s say a month or two, we are hoping that we can define a way for these rewards to come directly from the monthly MOON distribution. We have had some preliminary discussion about this with admins and they seem onboard but would like to see the community define a distribution governance proposal and pass it to define exactly how this would be done.</p>\n\n<p><a href=\"https://www.reddit.com/poll/lw0f6q\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 2982,
  "permalink": "/r/CryptoCurrency/comments/lw0f6q/proposal_to_move_all_memes_to_a_different/",
  "subreddit": "CryptoCurrency",
  "id": "lw0f6q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738015
}