{
  "author": "thundergun0911",
  "original_created_utc": 1647260065,
  "title": "Why isn't there a separate category in sports for transgender athletes?",
  "created_utc": 1647268998,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We have the NBA, WNBA, Paralympics, and Special Olympics. Why can&amp;#39;t there be a category for trans athletes instead of debating on whether a MtF or FtM should be able to participate in a category that they weren&amp;#39;t assigned to at birth? Wouldn&amp;#39;t that just settle the issue? I&amp;#39;m not hating on trans individuals at all but I just don&amp;#39;t understand why it&amp;#39;s a big deal. Can someone explain it to me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 413,
  "permalink": "/r/NoStupidQuestions/comments/tdw410/why_isnt_there_a_separate_category_in_sports_for/",
  "subreddit": "NoStupidQuestions",
  "id": "tdw410",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We have the NBA, WNBA, Paralympics, and Special Olympics. Why can't there be a\ncategory for trans athletes instead of debating on whether a MtF or FtM should\nbe able to participate in a category that they weren't assigned to at birth?\nWouldn't that just settle the issue? I'm not hating on trans…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NBA、WNBA、パラリンピック、スペシャルオリンピックスなどがあります。なぜ、そのようなものがないのでしょうか。\nトランスジェンダーのアスリートのためのカテゴリは、MtFやFtMがどうあるべきかを議論するのではなく\n生まれたときに割り当てられていないカテゴリーに参加できるのでしょうか？\nそうすれば、問題は解決するのではないでしょうか？トランスを嫌っているわけではないのですが...。",
      "title": "なぜスポーツ界には、トランスジェンダーのアスリートのための別のカテゴリーがないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们有NBA、WNBA、残奥会和特奥会。为什么就不能有一个\n为什么不能为变性运动员设立一个类别，而不是争论一个MtF或FtM是否应该\n而不是争论MtF或FtM是否应该参加他们在出生时没有被分配到的类别？\n这样不就可以解决这个问题了吗？我并不讨厌变性人...",
      "title": "为什么体育界没有为变性运动员设立单独的类别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們有NBA、WNBA、殘奧會和特奧會。爲什麼就不能有一個\n爲什麼不能爲變性運動員設立一個類別，而不是爭論一個MtF或FtM是否應該\n而不是爭論MtF或FtM是否應該參加他們在出生時沒有被分配到的類別？\n這樣不就可以解決這個問題了嗎？我並不討厭變性人...",
      "title": "爲什麼體育界沒有爲變性運動員設立單獨的類別？"
    }
  ]
}