{
  "author": "nugatty",
  "original_created_utc": 1650187023,
  "title": "How I accumulated my wealth by looking at pages 10 and beyond on Coingecko",
  "created_utc": 1650195424,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Being early is everything in crypto, so it baffles me that people buy top 50 coins and expect to get rich. These generally have 2-3x potential at best in any reasonable investor timeframe, while lowcaps have 100-500x potential. Of course you buy lowcaps.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;But it&amp;#39;s so risky!&amp;quot; you may object. Well, here&amp;#39;s the thing: that risk can be managed by looking at some key factors before you invest in a project:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Is the team doxed? If yes, continue&lt;/li&gt;\n&lt;li&gt;Is the initial distribution reasonable and transparent? If yes, continue&lt;/li&gt;\n&lt;li&gt;Does the project belong to a category with one valuable project at the top and several smaller ones? If yes, continue. The move2earn category is a good example. stepn is at the top (don&amp;#39;t invest in that) with several interesting lowcaps (invest in the unique ones)&lt;/li&gt;\n&lt;li&gt;Does the project have differentiating attributes? If yes, continue. If it&amp;#39;s just a fork, stop now.&lt;/li&gt;\n&lt;li&gt;Does the project have an active non-price-chat community on Telegram and other socials? If yes, continue&lt;/li&gt;\n&lt;li&gt;Is the project solving hard problems? If yes, continue&lt;/li&gt;\n&lt;li&gt;Is the &lt;em&gt;fully diluted&lt;/em&gt; market cap below $15M? If yes, continue&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;If your inquiry survived all 7 points, congratulations! You&amp;#39;re &lt;em&gt;early&lt;/em&gt; in a project that has a good chance of becoming very valuable.&lt;/p&gt;\n\n&lt;p&gt;Reasonably unique lowcap projects tend to do 20-200x. Make sure you formulate an exit plan and stick to it. Not taking profit keeps you poor.&lt;/p&gt;\n\n&lt;p&gt;Lowcaps are risky, yes, but risk can be managed. I made my wealth by putting a decent chunk of money into a handful of projects fitting the 7 bullet points, and I recommend everyone giving it a shot.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 604,
  "permalink": "/r/CryptoCurrency/comments/u5je3f/how_i_accumulated_my_wealth_by_looking_at_pages/",
  "subreddit": "CryptoCurrency",
  "id": "u5je3f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Being early is everything in crypto, so it baffles me that people buy top 50\ncoins and expect to get rich. These generally have 2-3x potential at best in any\nreasonable investor timeframe, while lowcaps have 100-500x potential. Of course\nyou buy lowcaps.\n\n\"But it's so risky!\" you may object. Well,…"
}