{
  "author": "zakelijke",
  "original_created_utc": 1656350814,
  "title": "[META] When is an anecdote not an anecdote but a primary source?",
  "created_utc": 1656368788,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen a lot of answers in this subreddit be removed if they are an anecdote about the historical subject that is asked about, even if the person has lived through the specific event him or herself.\nThis got me thinking, aren&amp;#39;t most primary sources an anecdote of some sort? I can see that you would want to collect a large number of personal accounts to get a proper understanding of an event, but doesn&amp;#39;t that mean that every individual anecdote has historical value?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/vm0vww/meta_when_is_an_anecdote_not_an_anecdote_but_a/",
  "subreddit": "AskHistorians",
  "id": "vm0vww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've seen a lot of answers in this subreddit be removed if they are an anecdote\nabout the historical subject that is asked about, even if the person has lived\nthrough the specific event him or herself. This got me thinking, aren't most\nprimary sources an anecdote of some sort? I can see that you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットでの回答は、逸話であれば削除されることが多いようですが\n質問された歴史的テーマに関する逸話であれば、たとえその人がその出来事を体験していたとしても\nこのSubredditでは、質問された歴史的テーマに関する逸話であれば、たとえその人が具体的な出来事を経験していたとしても、回答が削除されることがよくあります。そこで考えたのですが、ほとんどの\n一次資料のほとんどは、ある種の逸話ではないだろうか？というのはわかるのですが...。",
      "title": "[META】逸話が逸話でなく一次資料となるのはどんなときか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到这个分论坛上的很多答案都被删除了，如果它们是一个轶事的话\n的答案就会被删除，即使这个人曾经经历过具体的事件。\n即使这个人经历过具体的事件。这让我想到，是不是大多数\n主要资料不都是某种轶事吗？我可以看到，你...",
      "title": "[META] 轶事何时不是轶事而是主要来源？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到這個分論壇上的很多答案都被刪除了，如果它們是一個軼事的話\n的答案就會被刪除，即使這個人曾經經歷過具體的事件。\n即使這個人經歷過具體的事件。這讓我想到，是不是大多數\n主要資料不都是某種軼事嗎？我可以看到，你...",
      "title": "[META] 軼事何時不是軼事而是主要來源？"
    }
  ]
}