{
  "author": "bunnyhouseinyoursoul",
  "original_created_utc": 1640844501,
  "title": "How historically accurate was William Du Bois's 1920 statement “Let me say this again and emphasize it and leave no room for mistaken meaning: The World War was primarily the jealous and avaricious struggle for the largest share in exploiting darker races.” from \"The Souls of White People\"?",
  "created_utc": 1640878472,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;“The Souls of White Folk” is an excellent read and you can get to it by clicking the link on this page:&lt;a href=\"https://www.loa.org/news-and-views/1681-web-du-bois-the-souls-of-white-folk\"&gt;https://www.loa.org/news-and-views/1681-web-du-bois-the-souls-of-white-folk&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Here is the paragraph the quote comes from for context:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Let me say this again and emphasize it and leave no room for mistaken meaning:  The World War was primarily the jealous and avaricious struggle for the largest share in exploiting darker races.  As such it is and must be but the prelude to the armed and indignant protest of these despised and raped peoples.  Today Japan is hammering on the door of justice, China is raising her half-manacled hands to knock next, India is writhing for the freedom to knock, Egypt is sullenly muttering, the Negroes of South and West Africa, of the West Indies, and of the United States are just awakening to their shameful slavery.  Is, then, this war the end of wars?  Can it be the end, so long as sits enthroned, even in the souls of those who cry peace, the despising and robbing of darker peoples?  If Europe hugs this delusion, then this is not the end of world war,—­it is but the beginning!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I learned very little about World War I in school. Thank you very much to anyone who can comment on the historical accuracy of all this. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I  wanted to share some other paragraphs from this essay supporting this same idea in case you&amp;#39;re interested:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;First:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Whither is this expansion? What is that breath of life,  thought to be so indispensable to a great European nation? Manifestly it is expansion overseas; it is colonial aggrandizement which explains, and alone adequately explains, the World War. How many of us today fully realize the current theory of colonial expansion, of the relation of Europe which is white, to the world which is black and brown and yellow? Bluntly put, that theory is this: It is the duty of white Europe to divide up the darker world and administer it for Europe&amp;#39;s good. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Another quote: &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Thus the world market most wildly and desperately sought today is the market where labor is cheapest and most helpless and profit is most abundant. This labor is kept cheap and helpless cause&lt;br/&gt;\n the white world despises &amp;quot;darkies.&amp;quot; If one has the temerity to suggest that these workingmen may walk the way of white workingmen and climb by votes and self-assertion and education to the rank of men, he is howled out of&lt;/p&gt;\n\n&lt;p&gt;court. They cannot do it and if they could, they shall not, for they are the enemies of the white race and the whites shall rule forever and forever and everywhere. Thus the hatred and despising of human beings from whom Europe wishes to extort her luxuries has led to such jealousy and bickering between European nations that they have fallen afoul of each other and have fought like crazed beasts. Such is the fruit of human hatred.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;And a third quote: &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The fateful day came. It had to come. The cause of war is preparation for war; and of all that Europe has done in a century there is nothing that has equaled in energy, thought, and time her preparation for wholesale murder. The only adequate cause of this preparation was conquest and conquest, not in Europe, but primarily among the darker peoples of Asia and Africa; conquest, not for assimilation and uplift, but for commerce and degradation. For this, and this mainly, did Europe gird herself at frightful cost for war.&lt;/p&gt;\n\n&lt;p&gt;The red day dawned when the tinder was lighted in the Balkans and Austro-Hungary seized a bit which brought her a step nearer to the world&amp;#39;s highway; she seized one bit and poised herself for another. Then came that curious chorus of challenges, those leaping suspicions, raking all causes for distrust and rivalry and hatred, but saying little of the real and greatest cause.  Each nation felt its deep interests involved. But how? Not, surely, in the death of Ferdinand the Warlike; not, surely, in the old, half-forgotten revanche for Alsace-Lorraine; not even in the neutrality of Belgium. No! But in the possession of and overseas, in the right to colonies, the chance to levy endless tribute on the darker world,-on coolies in China, on starving peasants in India, on black savages in Africa, on dying South Sea Islanders, on Indians of the Amazon-all this and nothing more. &amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Thank you and Happy New Year to you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/AskHistorians/comments/rrud9g/how_historically_accurate_was_william_du_boiss/",
  "subreddit": "AskHistorians",
  "id": "rrud9g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "“The Souls of White Folk” is an excellent read and you can get to it by clicking\nthe link on this\npage:https://www.loa.org/news-and-views/1681-web-du-bois-the-souls-of-white-folk\n\n\n\nHere is the paragraph the quote comes from for context:\n\n\"Let me say this again and emphasize it and leave no room…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"The Souls of White Folk \"は素晴らしい読み物で、クリックするとそのページに行くことができます。\nこのリンクから\nページ:https://www.loa.org/news-and-views/1681-web-du-bois-the-souls-of-white-folk\n\n\n\n以下は、この引用文の引用元となった段落である。\n\n「もう一度言っておくが、このことは強調しておきたい。",
      "title": "ウィリアム・デュボワが1920年に発表した「もう一度言っておくが、強調しておくが、誤解の余地はない」という言葉は、どれほど歴史的に正確だったのだろうか。世界大戦は、主として暗い人種から搾取する最大の分け前を求める、嫉妬深く欲深い闘争であった」『白人の魂』より"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"白人的灵魂》是一本很好的读物，你可以通过点击以下链接进入该书\n这个网页上的链接\n网页上的链接：https://www.loa.org/news-and-views/1681-web-du-bois-the-souls-of-white-folk\n\n\n\n以下是这段话的背景。\n\n\"让我再说一遍，强调这一点，不留余地......",
      "title": "威廉-杜波依斯1920年的声明 \"让我再说一遍，并强调这一点，不给错误的含义留下任何余地 \"是多么具有历史准确性。世界大战主要是争夺剥削黑暗种族的最大份额的嫉妒和贪婪的斗争。\"出自《白人的灵魂》？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"白人的靈魂》是一本很好的讀物，你可以通過點擊以下鏈接進入該書\n這個網頁上的鏈接\n網頁上的鏈接：https://www.loa.org/news-and-views/1681-web-du-bois-the-souls-of-white-folk\n\n\n\n以下是這段話的背景。\n\n\"讓我再說一遍，強調這一點，不留餘地......",
      "title": "威廉-杜波依斯1920年的聲明 \"讓我再說一遍，並強調這一點，不給錯誤的含義留下任何餘地 \"是多麼具有歷史準確性。世界大戰主要是爭奪剝削黑暗種族的最大份額的嫉妒和貪婪的鬥爭。\"出自《白人的靈魂》？"
    }
  ]
}