{
  "author": "RadicalEggroll",
  "the_new_excerpt": "Hi guys. I am seeing a lot of information flying around accusing brokerages of\nblocking retail traders from buying with the express intent of screwing retail\ninvestors. Here's another, more rational take, coming from an associate of mine\nwho works on Wall Street:\n\n * In the US, there is one central…",
  "original_created_utc": 1611891002,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，各位。我看到很多信息飞来飞去，指责经纪公司的\n阻止散户购买，目的就是要搞垮散户。\n投资者。这里还有一个更理性的观点，来自我的一个同事。\n在华尔街工作的人\n\n * 在美国，有一个中央... ...",
      "title": "为什么你的经纪人不让你买？这可能不是一个阴谋"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，各位。我看到很多信息飛來飛去，指責經紀公司的\n阻止散戶購買，目的就是要搞垮散戶。\n投資者。這裏還有一個更理性的觀點，來自我的一個同事。\n在華爾街工作的人\n\n * 在美國，有一箇中央... ...",
      "title": "爲什麼你的經紀人不讓你買？這可能不是一個陰謀"
    }
  ],
  "title": "Why isn't your broker letting you buy? It's probably not a conspiracy",
  "created_utc": 1611914106,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys. I am seeing a lot of information flying around accusing brokerages of blocking retail traders from buying with the express intent of screwing retail investors. Here&#39;s another, more rational take, coming from an associate of mine who works on Wall Street:</p>\n\n<ul>\n<li>In the US, there is one central securities depository called the Depository Trust Company (DTC).</li>\n<li>When you buy a stock on your broker, they take the order to DTC. DTC fills the order by finding a seller. The same thing happens when a hedge fund wants to buy securities, or a bank.</li>\n<li>However, there is risk associated with matching a buyer to a seller. To mitigate this risk, there is something called the &quot;settlement cycle&quot;</li>\n<li>The settlement cycle is a 2-day holding period where the buyer (in this case, your broker) puts down a clearing fund deposit to collateralize the transaction. After the two days, they get the deposit back.</li>\n</ul>\n\n<p>So what&#39;s happening here?</p>\n\n<p>The clearing fund deposit that buyers have to submit is adjusted based on market volatility. Because of the volatility surrounding $GME, $AMC, and these other stocks, the clearinghouses/DTC are requiring firms to front excessively high collateral in order to buy shares of these companies.</p>\n\n<p>Many of these brokers simply just may not have the cash on hand to front the collateral to fulfill the massive influx of buy orders incoming for these stocks. So they suspended accepting buy orders for the stocks. They kept the option of selling open, because they have a fiduciary duty towards their customers. Their actions are a byproduct of not having enough money to fulfill the orders.</p>\n\n<p>Why can hedge funds and big banks buy then? Because they have plenty of cash lying around! And if they don&#39;t, they can borrow it from each other. Because of this, they don&#39;t have to worry about being locked out of the markets due to volatility.</p>\n\n<p>In summary: please don&#39;t jump to conclusions and assume bad faith before it is proven. There are lots of people here and on <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a> who have been &quot;investors&quot; for less than 2 weeks and don&#39;t understand how everything works. Let&#39;s keep a cool head and not make accusations which we can&#39;t prove. That goes for everyone, including those in the media. Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/stocks/comments/l7hwll/why_isnt_your_broker_letting_you_buy_its_probably/",
  "subreddit": "stocks",
  "id": "l7hwll",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537959
}