{
  "author": "gubbsbe",
  "the_new_excerpt": "\"In Amazon’s 1997 letter to shareholders, our first, I talked about our hope to\ncreate an “enduring franchise,” one that would reinvent what it means to serve\ncustomers by unlocking the internet’s power. I noted that Amazon had grown from\nhaving 158 employees to 614, and that we had surpassed 1.5…",
  "original_created_utc": 1618502557,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"1997年、アマゾンが初めて株主に宛てた手紙の中で、私は「不朽のフランチャイズ」を作りたいと語りました。\nインターネットの力を利用して、お客様にサービスを提供することの意味を再構築するような、\"永続的なフランチャイズ \"を作りたいと考えていました。\nインターネットの力を利用して、お客様にサービスを提供することの意味を再構築するような、\"永続的なフランチャイズ \"を作りたいと考えました。私は、アマゾンが158人だった従業員を614人に増やしたこと\n従業員が158人から614人に増えたこと、1.5億ドルを突破したことを述べました。",
      "title": "ジェフ・ベゾス氏、アマゾン株主への最後の手紙を発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"在亚马逊1997年给股东的信中，也就是我们的第一封信中，我谈到了我们希望能够\n创建一个 \"持久的专营权\"，一个将重塑服务意义的专营权。\n通过释放互联网的力量来吸引客户。我注意到，亚马逊已经从\n从158名员工到614名员工，我们已经超过了1.5... ...",
      "title": "杰夫-贝佐斯发布致亚马逊股东的最后一封信"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"在亞馬遜1997年給股東的信中，也就是我們的第一封信中，我談到了我們希望能夠\n創建一個 \"持久的專營權\"，一個將重塑服務意義的專營權。\n通過釋放互聯網的力量來吸引客戶。我注意到，亞馬遜已經從\n從158名員工到614名員工，我們已經超過了1.5... ...",
      "title": "傑夫-貝佐斯發佈致亞馬遜股東的最後一封信"
    }
  ],
  "title": "Jeff Bezos Releases Final Letter To Amazon Shareholders",
  "created_utc": 1618510677,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;In Amazon’s 1997 letter to shareholders, our first, I talked about our hope to create an “enduring franchise,” one that would reinvent what it means to serve customers by unlocking the internet’s power. I noted that Amazon had grown from having 158 employees to 614, and that we had surpassed 1.5 million customer accounts. We had just gone public at a split-adjusted stock price of $1.50 per share. I wrote that it was Day 1.</p>\n\n<p>We’ve come a long way since then, and we are working harder than ever to serve and delight customers. Last year, we hired 500,000 employees and now directly employ 1.3 million people around the world. We have more than 200 million Prime members worldwide. More than 1.9 million small and medium-sized businesses sell in our store, and they make up close to 60% of our retail sales. Customers have connected more than 100 million smart home devices to Alexa. Amazon Web Services serves millions of customers and ended 2020 with a $50 billion annualized run rate. In 1997, we hadn’t invented Prime, Marketplace, Alexa, or AWS. They weren’t even ideas then, and none was preordained. We took great risk with each one and put sweat and ingenuity into each one.</p>\n\n<p>Along the way, we’ve created $1.6 trillion of wealth for shareowners. Who are they? Your Chair is one, and my Amazon shares have made me wealthy. But more than 7/8ths of the shares, representing $1.4 trillion of wealth creation, are owned by others. Who are they? They’re pension funds, universities, and 401(k)s, and they’re Mary and Larry, who sent me this note out of the blue just as I was sitting down to write this shareholder letter:</p>\n\n<p>I am approached with similar stories all the time. I know people who’ve used their Amazon money for college, for emergencies, for houses, for vacations, to start their own business, for charity – and the list goes on. I’m proud of the wealth we’ve created for shareowners. It’s significant, and it improves their lives. But I also know something else: it’s not the largest part of the value we’ve created.</p>\n\n<h3>Create More Than You Consume</h3>\n\n<p>If you want to be successful in business (in life, actually), you have to create more than you consume. Your goal should be to create value for everyone you interact with. Any business that doesn’t create value for those it touches, even if it appears successful on the surface, isn’t long for this world. It’s on the way out.</p>\n\n<p>Remember that stock prices are not about the past. They are a prediction of future cash flows discounted back to the present. The stock market anticipates. I’m going to switch gears for a moment and talk about the past. How much value did we create for shareowners in 2020? This is a relatively easy question to answer because accounting systems are set up to answer it. Our net income in 2020 was $21.3 billion. If, instead of being a publicly traded company with thousands of owners, Amazon were a sole proprietorship with a single owner, that’s how much the owner would have earned in 2020.</p>\n\n<p>How about employees? This is also a reasonably easy value creation question to answer because we can look at compensation expense. What is an expense for a company is income for employees. In 2020, employees earned $80 billion, plus another $11 billion to include benefits and various payroll taxes, for a total of $91 billion.</p>\n\n<p>How about third-party sellers? We have an internal team (the Selling Partner Services team) that works to answer that question. They estimate that, in 2020, third-party seller profits from selling on Amazon were between $25 billion and $39 billion, and to be conservative here I’ll go with $25 billion.</p>\n\n<p>For customers, we have to break it down into consumer customers and AWS customers.</p>\n\n<p>We’ll do consumers first. We offer low prices, vast selection, and fast delivery, but imagine we ignore all of that for the purpose of this estimate and value only one thing: we save customers time.</p>\n\n<p>Customers complete 28% of purchases on Amazon in three minutes or less, and half of all purchases are finished in less than 15 minutes. Compare that to the typical shopping trip to a physical store – driving, parking, searching store aisles, waiting in the checkout line, finding your car, and driving home. Research suggests the typical physical store trip takes about an hour. If you assume that a typical Amazon purchase takes 15 minutes and that it saves you a couple of trips to a physical store a week, that’s more than 75 hours a year saved. That’s important. We’re all busy in the early 21st century.</p>\n\n<p>So that we can get a dollar figure, let’s value the time savings at $10 per hour, which is conservative. Seventy-five hours multiplied by $10 an hour and subtracting the cost of Prime gives you value creation for each Prime member of about $630. We have 200 million Prime members, for a total in 2020 of $126 billion of value creation.</p>\n\n<p>AWS is challenging to estimate because each customer’s workload is so different, but we’ll do it anyway, acknowledging up front that the error bars are high. Direct cost improvements from operating in the cloud versus on premises vary, but a reasonable estimate is 30%. Across AWS’s entire 2020 revenue of $45 billion, that 30% would imply customer value creation of $19 billion (what would have cost them $64 billion on their own cost $45 billion from AWS). The difficult part of this estimation exercise is that the direct cost reduction is the smallest portion of the customer benefit of moving to the cloud. The bigger benefit is the increased speed of software development – something that can significantly improve the customer’s competitiveness and top line. We have no reasonable way of estimating that portion of customer value except to say that it’s almost certainly larger than the direct cost savings. To be conservative here (and remembering we’re really only trying to get ballpark estimates), I’ll say it’s the same and call AWS customer value creation $38 billion in 2020.</p>\n\n<p>Adding AWS and consumer together gives us total customer value creation in 2020 of $164 billion.</p>\n\n<p>Summarizing:<br/>\nShareholders      $21B<br/>\nEmployees          $91B<br/>\n3P Sellers            $25B<br/>\nCustomers           $164B<br/>\nTotal                    $301B</p>\n\n<p>If each group had an income statement representing their interactions with Amazon, the numbers above would be the “bottom lines” from those income statements. These numbers are part of the reason why people work for us, why sellers sell through us, and why customers buy from us. We create value for them. And this value creation is not a zero-sum game. It is not just moving money from one pocket to another. Draw the box big around all of society, and you’ll find that invention is the root of all real value creation. And value created is best thought of as a metric for innovation.</p>\n\n<p>Of course, our relationship with these constituencies and the value we create isn’t exclusively dollars and cents. Money doesn’t tell the whole story. Our relationship with shareholders, for example, is relatively simple. They invest and hold shares for a duration of their choosing. We provide direction to shareowners infrequently on matters such as annual meetings and the right process to vote their shares. And even then they can ignore those directions and just skip voting.</p>\n\n<p>Our relationship with employees is a very different example. We have processes they follow and standards they meet. We require training and various certifications. Employees have to show up at appointed times. Our interactions with employees are many, and they’re fine-grained. It’s not just about the pay and the benefits. It’s about all the other detailed aspects of the relationship too.</p>\n\n<p>Does your Chair take comfort in the outcome of the recent union vote in Bessemer? No, he doesn’t. I think we need to do a better job for our employees. While the voting results were lopsided and our direct relationship with employees is strong, it’s clear to me that we need a better vision for how we create value for employees – a vision for their success.</p>\n\n<p>If you read some of the news reports, you might think we have no care for employees. In those reports, our employees are sometimes accused of being desperate souls and treated as robots. That’s not accurate. They’re sophisticated and thoughtful people who have options for where to work. When we survey fulfillment center employees, 94% say they would recommend Amazon to a friend as a place to work.</p>\n\n<p>Employees are able to take informal breaks throughout their shifts to stretch, get water, use the rest room, or talk to a manager, all without impacting their performance. These informal work breaks are in addition to the 30-minute lunch and 30-minute break built into their normal schedule.</p>\n\n<p>We don’t set unreasonable performance goals. We set achievable performance goals that take into account tenure and actual employee performance data. Performance is evaluated over a long period of time as we know that a variety of things can impact performance in any given week, day, or hour. If employees are on track to miss a performance target over a period of time, their manager talks with them and provides coaching.</p>\n\n<p>Coaching is also extended to employees who are excelling and in line for increased responsibilities. In fact, 82% of coaching is positive, provided to employees who are meeting or exceeding expectations. We terminate the employment of less than 2.6% of employees due to their inability to perform their jobs (and that number was even lower in 2020 because of operational impacts of COVID-19).</p>\n\n<h3>Earth’s Best Employer and Earth’s Safest Place to Work</h3>\n\n<p>The fact is, the large team of thousands of people who lead operations at Amazon have always cared deeply for our hourly employees, and we’re proud of the work environment we’ve created. We’re also proud of the fact that Amazon is a company that does more than just create jobs for computer scientists and people with advanced degrees. We create jobs for people who never got that advantage.</p>\n\n<p>Despite what we’ve accomplished, it’s clear to me that we need a better vision for our employees’ success. We have always wanted to be Earth’s Most Customer-Centric Company. We won’t change that. It’s what got us here. But I am committing us to an addition. We are going to be Earth’s Best Employer and Earth’s Safest Place to Work.</p>\n\n<p>In my upcoming role as Executive Chair, I’m going to focus on new initiatives. I’m an inventor. It’s what I enjoy the most and what I do best. It’s where I create the most value. I’m excited to work alongside the large team of passionate people we have in Ops and help invent in this arena of Earth’s Best Employer and Earth’s Safest Place to Work. On the details, we at Amazon are always flexible, but on matters of vision we are stubborn and relentless. We have never failed when we set our minds to something, and we’re not going to fail at this either.</p>\n\n<p>We dive deep into safety issues. For example, about 40% of work-related injuries at Amazon are related to musculoskeletal disorders (MSDs), things like sprains or strains that can be caused by repetitive motions. MSDs are common in the type of work that we do and are more likely to occur during an employee’s first six months. We need to invent solutions to reduce MSDs for new employees, many of whom might be working in a physical role for the first time.</p>\n\n<p>One such program is WorkingWell – which we launched to 859,000 employees at 350 sites across North America and Europe in 2020 – where we coach small groups of employees on body mechanics, proactive wellness, and safety. In addition to reducing workplace injuries, these concepts have a positive impact on regular day-to-day activities outside work.</p>\n\n<p>We’re developing new automated staffing schedules that use sophisticated algorithms to rotate employees among jobs that use different muscle-tendon groups to decrease repetitive motion and help protect employees from MSD risks. This new technology is central to a job rotation program that we’re rolling out throughout 2021.</p>\n\n<p>Our increased attention to early MSD prevention is already achieving results. From 2019 to 2020, overall MSDs decreased by 32%, and MSDs resulting in time away from work decreased by more than half.</p>\n\n<p>We employ 6,200 safety professionals at Amazon. They use the science of safety to solve complex problems and establish new industry best practices. In 2021, we’ll invest more than $300 million into safety projects, including an initial $66 million to create technology that will help prevent collisions of forklifts and other types of industrial vehicles.</p>\n\n<p>When we lead, others follow. Two and a half years ago, when we set a $15 minimum wage for our hourly employees, we did so because we wanted to lead on wages – not just run with the pack – and because we believed it was the right thing to do. A recent paper by economists at the University of California-Berkeley and Brandeis University analyzed the impact of our decision to raise our minimum starting pay to $15 per hour. Their assessment reflects what we’ve heard from employees, their families, and the communities they live in.</p>\n\n<p>Our increase in starting wage boosted local economies across the country by benefiting not only our own employees but also other workers in the same community. The study showed that our pay raise resulted in a 4.7% increase in the average hourly wage among other employers in the same labor market.</p>\n\n<p>And we’re not done leading. If we want to be Earth’s Best Employer, we shouldn’t settle for 94% of employees saying they would recommend Amazon to a friend as a place to work. We have to aim for 100%. And we’ll do that by continuing to lead on wages, on benefits, on upskilling opportunities, and in other ways that we will figure out over time.</p>\n\n<p>If any shareowners are concerned that Earth’s Best Employer and Earth’s Safest Place to Work might dilute our focus on Earth’s Most Customer-Centric Company, let me set your mind at ease. Think of it this way. If we can operate two businesses as different as consumer ecommerce and AWS, and do both at the highest level, we can certainly do the same with these two vision statements. In fact, I’m confident they will reinforce each other.</p>\n\n<h3>The Climate Pledge</h3>\n\n<p>In an earlier draft of this letter, I started this section with arguments and examples designed to demonstrate that human-induced climate change is real. But, bluntly, I think we can stop saying that now. You don’t have to say that photosynthesis is real, or make the case that gravity is real, or that water boils at 100 degrees Celsius at sea level. These things are simply true, as is the reality of climate change.</p>\n\n<p>Not long ago, most people believed that it would be good to address climate change, but they also thought it would cost a lot and would threaten jobs, competitiveness, and economic growth. We now know better. Smart action on climate change will not only stop bad things from happening, it will also make our economy more efficient, help drive technological change, and reduce risks. Combined, these can lead to more and better jobs, healthier and happier children, more productive workers, and a more prosperous future. This doesn’t mean it will be easy. It won’t be. The coming decade will be decisive. The economy in 2030 will need to be vastly different from what it is today, and Amazon plans to be at the heart of the change. We launched The Climate Pledge together with Global Optimism in September 2019 because we wanted to help drive this positive revolution. We need to be part of a growing team of corporations that understand the imperatives and the opportunities of the 21st century.</p>\n\n<p>Now, less than two years later, 53 companies representing almost every sector of the economy have signed The Climate Pledge. Signatories such as Best Buy, IBM, Infosys, Mercedes-Benz, Microsoft, Siemens, and Verizon have committed to achieve net-zero carbon in their worldwide businesses by 2040, 10 years ahead of the Paris Agreement. The Pledge also requires them to measure and report greenhouse gas emissions on a regular basis; implement decarbonization strategies through real business changes and innovations; and neutralize any remaining emissions with additional, quantifiable, real, permanent, and socially beneficial offsets. Credible, quality offsets are precious, and we should reserve them to compensate for economic activities where low-carbon alternatives don’t exist.</p>\n\n<p>The Climate Pledge signatories are making meaningful, tangible, and ambitious commitments. Uber has a goal of operating as a zero-emission platform in Canada, Europe, and the U.S. by 2030, and Henkel plans to source 100% of the electricity it uses for production from renewable sources. Amazon is making progress toward our own goal of 100% renewable energy by 2025, five years ahead of our initial 2030 target. Amazon is the largest corporate buyer of renewable energy in the world. We have 62 utility-scale wind and solar projects and 125 solar rooftops on fulfillment and sort centers around the globe. These projects have the capacity to generate over 6.9 gigawatts and deliver more than 20 million megawatt-hours of energy annually.</p>\n\n<p>Transportation is a major component of Amazon’s business operations and the toughest part of our plan to meet net-zero carbon by 2040. To help rapidly accelerate the market for electric vehicle technology, and to help all companies transition to greener technologies, we invested more than $1 billion in Rivian – and ordered 100,000 electric delivery vans from the company. We’ve also partnered with Mahindra in India and Mercedes-Benz in Europe. These custom electric delivery vehicles from Rivian are already operational, and they first hit the road in Los Angeles this past February. Ten thousand new vehicles will be on the road as early as next year, and all 100,000 vehicles will be on the road by 2030 – saving millions of metric tons of carbon. A big reason we want companies to join The Climate Pledge is to signal to the marketplace that businesses should start inventing and developing new technologies that signatories need to make good on the Pledge. Our purchase of 100,000 Rivian electric vans is a perfect example.</p>\n\n<p>To further accelerate investment in new technologies needed to build a zero-carbon economy, we introduced the Climate Pledge Fund last June. The investment program started with $2 billion to invest in visionary companies that aim to facilitate the transition to a low-carbon economy. Amazon has already announced investments in CarbonCure Technologies, Pachama, Redwood Materials, Rivian, Turntide Technologies, ZeroAvia, and Infinium – and these are just some of the innovative companies we hope will build the zero-carbon economy of the future.</p>\n\n<p>I have also personally allocated $10 billion to provide grants to help catalyze the systemic change we will need in the coming decade. We’ll be supporting leading scientists, activists, NGOs, environmental justice organizations, and others working to fight climate change and protect the natural world. Late last year, I made my first round of grants to 16 organizations working on innovative and needle-moving solutions. It’s going to take collective action from big companies, small companies, nation states, global organizations, and individuals, and I’m excited to be part of this journey and optimistic that humanity can come together to solve this challenge.</p>\n\n<h3>Differentiation is Survival and the Universe Wants You to be Typical</h3>\n\n<p>This is my last annual shareholder letter as the CEO of Amazon, and I have one last thing of utmost importance I feel compelled to teach. I hope all Amazonians take it to heart.</p>\n\n<p>Here is a passage from Richard Dawkins’ (extraordinary) book The Blind Watchmaker. It’s about a basic fact of biology.</p>\n\n<p>“Staving off death is a thing that you have to work at. Left to itself – and that is what it is when it dies – the body tends to revert to a state of equilibrium with its environment. If you measure some quantity such as the temperature, the acidity, the water content or the electrical potential in a living body, you will typically find that it is markedly different from the corresponding measure in the surroundings. Our bodies, for instance, are usually hotter than our surroundings, and in cold climates they have to work hard to maintain the differential. When we die the work stops, the temperature differential starts to disappear, and we end up the same temperature as our surroundings. Not all animals work so hard to avoid coming into equilibrium with their surrounding temperature, but all animals do some comparable work. For instance, in a dry country, animals and plants work to maintain the fluid content of their cells, work against a natural tendency for water to flow from them into the dry outside world. If they fail they die. More generally, if living things didn’t work actively to prevent it, they would eventually merge into their surroundings, and cease to exist as autonomous beings. That is what happens when they die.”</p>\n\n<p>While the passage is not intended as a metaphor, it’s nevertheless a fantastic one, and very relevant to Amazon. I would argue that it’s relevant to all companies and all institutions and to each of our individual lives too. In what ways does the world pull at you in an attempt to make you normal? How much work does it take to maintain your distinctiveness? To keep alive the thing or things that make you special?</p>\n\n<p>I know a happily married couple who have a running joke in their relationship. Not infrequently, the husband looks at the wife with faux distress and says to her, “Can’t you just be normal?” They both smile and laugh, and of course the deep truth is that her distinctiveness is something he loves about her. But, at the same time, it’s also true that things would often be easier – take less energy – if we were a little more normal.</p>\n\n<p>This phenomenon happens at all scale levels. Democracies are not normal. Tyranny is the historical norm. If we stopped doing all of the continuous hard work that is needed to maintain our distinctiveness in that regard, we would quickly come into equilibrium with tyranny.</p>\n\n<p>We all know that distinctiveness – originality – is valuable. We are all taught to “be yourself.” What I’m really asking you to do is to embrace and be realistic about how much energy it takes to maintain that distinctiveness. The world wants you to be typical – in a thousand ways, it pulls at you. Don’t let it happen.</p>\n\n<p>You have to pay a price for your distinctiveness, and it’s worth it. The fairy tale version of “be yourself” is that all the pain stops as soon as you allow your distinctiveness to shine. That version is misleading. Being yourself is worth it, but don’t expect it to be easy or free. You’ll have to put energy into it continuously.</p>\n\n<p>The world will always try to make Amazon more typical – to bring us into equilibrium with our environment. It will take continuous effort, but we can and must be better than that.</p>\n\n<p>* * *</p>\n\n<p>As always, I attach our 1997 shareholder letter. It concluded with this: “We at Amazon.com are grateful to our customers for their business and trust, to each other for our hard work, and to our shareholders for their support and encouragement.” That hasn’t changed a bit. I want to especially thank Andy Jassy for agreeing to take on the CEO role. It’s a hard job with a lot of responsibility. Andy is brilliant and has the highest of high standards. I guarantee you that Andy won’t let the universe make us typical. He will muster the energy needed to keep alive in us what makes us special. That won’t be easy, but it is critical. I also predict it will be satisfying and oftentimes fun. Thank you, Andy.</p>\n\n<p>To all of you: be kind, be original, create more than you consume, and never, never, never let the universe smooth you into your surroundings. It remains Day 1.</p>\n\n<p>Sincerely,</p>\n\n<p>To our shareowners:</p>\n\n<p>Jeffrey P. Bezos<br/>\nFounder and Chief Executive Officer<br/>\nAmazon.com, Inc.</p>\n</div><!-- SC_ON -->",
  "score": 1815,
  "permalink": "/r/investing/comments/mrhrgv/jeff_bezos_releases_final_letter_to_amazon/",
  "subreddit": "investing",
  "id": "mrhrgv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524765
}