{
  "author": "ZombieNamedJosh",
  "original_created_utc": 1646810242,
  "title": "As a cripple, crypto currencies have changed my life for the better.",
  "created_utc": 1646883040,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if this kind of post has been done before, if its over done, I apologize. Simply put, I want to express my gratitude to crypto, and how its changed my life for the better.&lt;/p&gt;\n\n&lt;p&gt;Also, I&amp;#39;d like to note that I&amp;#39;m not sharing this story for pity points or some other shit like that, simply put, I want to give a small view into the life of a stranger who had some misfortunate things happen in their lives, but were able to make the best of it with the assistance of crypto.&lt;/p&gt;\n\n&lt;p&gt;For context, I was crippled when I was 15, I was involved in a pretty bad collision with a vehicle, the injuries had left me unable to walk for more then a few minutes, and barely even being able to lift my arms over my shoulder height, I could barely even grip more then a few pounds. I could thankfully still stand, but daily life had greatly changed for me, and anxieties set in.&lt;/p&gt;\n\n&lt;p&gt;Because of my accident, to no ones surprise, companies far and wide just didn&amp;#39;t want to hire me. Eventually, I had gotten reviewed and eventually accepted into a disability program. Although if I ever start working again, they&amp;#39;ll remove my disability permanently, which just greatly increased my anxieties of not being able to find work I was comfortable in doing.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to my early 20s, I&amp;#39;ve been on disability for quite some time. I was always very interested in crypto, but never had the chance to buy in or start with it. My medical related bills always drained what little money I had. And then a big pandemic hit, and Canada had given everyone a few thousand if they needed it for emergency aid.&lt;/p&gt;\n\n&lt;p&gt;Now of course, right away I used stimulus checks to secure food, pay off all my bills, and even bought some equipment to start exercising in hopes to repair the damage in my arms and legs to eventually get back to work. After everything was said and done, I had roughly 2.2k left over, and bought a few GPUs after really thinking about crypto and how it could benefit me in the long run.&lt;/p&gt;\n\n&lt;p&gt;Thankfully, this was the thing that would really help me both mentally, physically, and financially. I bought the cards and power supply, already had ram and a motherboard, put it all together and started mining with HiveOS. &lt;/p&gt;\n\n&lt;p&gt;Let me just say, as someone who lived off of 1100$ Canadian a month, for almost 7 years, this was a major game changer for me. Suddenly, I was able to afford better food, lots more meat! I was able to pay all my bills on time, and no longer slowly came into debt, and I was, for the first time, able to lower my financial worries of being homeless if a payment suddenly didn&amp;#39;t come in. The amount of joy that I had for just a few hundred extra a month was unmeasurable.&lt;/p&gt;\n\n&lt;p&gt;The best part for me was that the cards paid themselves off in a few months due to the boom.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to now, and even though I&amp;#39;m still technically in extreme poverty, my little mining rig gives me just enough breathing room in my income that I can focus on my mental well being, and my physical well being. I cannot express my gratitude to how mining has positively effected my life.&lt;/p&gt;\n\n&lt;p&gt;Sure, to most people getting an extra 200$-300$ a month would be effectively worthless, but that kind of money is enough to cover the power bill, my phone bill, and internet. It lets me have just enough breathing room to actually have a savings account, to be able to put money aside for my future.&lt;/p&gt;\n\n&lt;p&gt;Right now, I&amp;#39;m planning to put some money aside to hopefully expand and get a few more cards, so I can completely get off disability, and maybe finally be able to live alone. I&amp;#39;ve been doing better physically, to the point that I can even walk for over 20 minutes now! I&amp;#39;m still struggling on grip and shoulder stuff, but progress is progress.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/ta2bbq/as_a_cripple_crypto_currencies_have_changed_my/",
  "subreddit": "CryptoCurrency",
  "id": "ta2bbq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't know if this kind of post has been done before, if its over done, I\napologize. Simply put, I want to express my gratitude to crypto, and how its\nchanged my life for the better.\n\nAlso, I'd like to note that I'm not sharing this story for pity points or some\nother shit like that, simply put,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような投稿は以前にもあったのかどうかわかりませんが、もしやりすぎなら\n申し訳ありません。簡単に言うと、暗号に感謝したいのです。\n私の人生をより良いものに変えてくれました。\n\nまた、この話をするのは、憐れみのポイントとか、そういうものではないことを明記しておきたいと思います。\nとか、そういうのじゃなくて、簡単に言うと...。",
      "title": "障がい者である私の人生を、暗号通貨は良い方向に変えてくれました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道这种帖子以前是否有人做过，如果做得太过了，我也不知道。\n感到抱歉。简单地说，我想表达我对加密货币的感激之情，以及它如何\n改变了我的生活，使之变得更好。\n\n另外，我想说明的是，我分享这个故事并不是为了博得同情或其他类似的东西。\n其他类似的狗屎，简单地说，...",
      "title": "作为一个瘸子，加密货币已经改变了我的生活。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道這種帖子以前是否有人做過，如果做得太過了，我也不知道。\n感到抱歉。簡單地說，我想表達我對加密貨幣的感激之情，以及它如何\n改變了我的生活，使之變得更好。\n\n另外，我想說明的是，我分享這個故事並不是爲了博得同情或其他類似的東西。\n其他類似的狗屎，簡單地說，...",
      "title": "作爲一個瘸子，加密貨幣已經改變了我的生活。"
    }
  ]
}