{
  "author": "Fantastic-Cucumber-1",
  "the_new_excerpt": "I've noticed that people in this sub are getting more and more interested in\nDeFi (Decentralized Finance) applications. With this guide I would like to help\nyou getting started with learning the basic fundamentals of DeFi and setting up\nyour wallet and tools. I tried to make this guide as complete…",
  "original_created_utc": 1622029010,
  "localize": [
    {
      "locale": "ja",
      "title": "DeFi Explained: 完全ガイド",
      "the_new_excerpt": "このサブの人たちの関心が高まっているのは\nDeFi (Decentralized Finance)のアプリケーションです。このガイドで、私は以下のことをお手伝いしたいと思います。\nDeFiの基本を学び、セットアップすることから始めましょう。\nウォレットやツール このガイドは、できるだけ完全なものにしようとしました..."
    },
    {
      "locale": "zh",
      "title": "DeFi的解释。完整的指南",
      "the_new_excerpt": "我注意到，在这个子项目中，人们对以下方面的兴趣越来越大\nDeFi（去中心化金融）的应用。通过这个指南，我想帮助\n你开始学习DeFi的基本原理并设置你的\n你的钱包和工具。我试图使这个指南尽可能完整..."
    },
    {
      "locale": "zh-Hant",
      "title": "DeFi的解釋。完整的指南",
      "the_new_excerpt": "我注意到，在這個子項目中，人們對以下方面的興趣越來越大\nDeFi（去中心化金融）的應用。通過這個指南，我想幫助\n你開始學習DeFi的基本原理並設置你的\n你的錢包和工具。我試圖使這個指南儘可能完整..."
    }
  ],
  "title": "DeFi Explained: The FULL Guide",
  "created_utc": 1622040619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed that people in this sub are getting more and more interested in DeFi (Decentralized Finance) applications. With this guide I would like to help you getting started with learning the basic fundamentals of DeFi and setting up your wallet and tools. I tried to make this guide as complete as possible.</p>\n\n<h1>Fundamentals</h1>\n\n<p>Let&#39;s start with some fundamentals first.</p>\n\n<h1>What is Decentralized Finance</h1>\n\n<p>Decentralized Finance (DeFi) is a movement that uses decentralized networks and blockchains to transform traditional financial products into trustless and transparent protocols that work without intermediaries.</p>\n\n<p>Currently, almost all DeFi applications are built on the Ethereum blockchain and Binance Smart Chain. Like Bitcoin, Ethereum and Binance have a blockchain that acts as a shared ledger in which digital value is tracked. Rather than a central authority, the participants making up the network control the issuance of ether, the network&#39;s cryptocurrency, in a decentralized way.</p>\n\n<p>Developers can program applications that can create, store and manage digital assets, also known as tokens, on the blockchain. For this to work, smart contracts and decentralized applications (DApps) are written and built. The expiration of these contracts and agreements is automatically enforced if the blockchain receives the correct data. You can make complex, irreversible agreements without the need for an intermediary.</p>\n\n<p>Anyone is able to create, adapt, mix, link or build on an existing DeFi product without permission. DeFi protocols are modular, so they can be stacked on top of each other to build an increasingly dense system of interacting parts.</p>\n\n<h1>Wallets</h1>\n\n<p>You can download a wallet on a PC, tablet or telephone. With this you can store, send or receive Bitcoin or other cryptocurrencies. Three related concepts determine whether someone has ownership of a certain wallet, these are your digital keys (also called public &amp; private keys), your wallet address and your digital signature.</p>\n\n<p>The most important aspect of a wallet are your digital keys, as they give you access to your wallet. It is important to know that these keys are not stored online on the blockchain but are instead stored independently within the digital wallet itself. Each key consists of both a public key and a private key.</p>\n\n<p>Consider your public key the same as the bank account, which also consists of an address. Your public key works more or less the same. The pin code with which you subsequently gain access to this bank account is then referred to as your private key.</p>\n\n<p>It is very important that you ALWAYS keep your private key to yourself. If someone else has the private key, he / she can send and steal all coins, so keep it safe. With the public key, people can only send coins, so that can&#39;t hurt.</p>\n\n<p>Every wallet has a unique code, which we also call the wallet address, which consists of a random letter and number combination that is different for everyone. This address is in fact the name of your wallet and makes it possible for others to transfer cryptocurrencies to you.</p>\n\n<p>Example of just any bitcoin address: 14J5Q7ageKhM3miKd94DX44Kf6b7ko4BZe</p>\n\n<p>Some people assume that your public key is the same as your wallet address. This is not entirely true, but the two are mathematically related.</p>\n\n<p>In order for you to start using DeFi platforms, a browser wallet is needed.</p>\n\n<h1>Coins vs Tokens</h1>\n\n<p>A coin runs on its own blockchain, on its own system. It is therefore completely independent. A coin could be compared to a contemporary currency, such as the Dollar. Bitcoin is a coin and has been developed with the aim of serving as a digital payment method and store of value.</p>\n\n<p>Then there are tokens. Tokens by definition do not run on their own blockchain, unlike a coin. They have been added to an already existing blockchain. Tokens can have the same functionality as a coin, although this is not common.</p>\n\n<p>Tokens that are created on the Ethereum network are typically ERC-20 tokens. When we talk about ERC20, we mean the standard that is implemented in certain tokens. ERC20 stands for &#39;Ethereum Request for Comment 20&#39;. The Binance Smart Chain uses a similar standard, which is the BEP-20 standard.</p>\n\n<p>These standards contains numerous functions that allow any token that has implemented this set of functions to be traded. Examples of those functions are:</p>\n\n<ul>\n<li>Sending tokens.</li>\n<li>Request balance information from any address.</li>\n<li>List the number of available tokens.</li>\n</ul>\n\n<h1>Layer 2 solutions</h1>\n\n<p>Because of high demand, the Ethereum network is getting overloaded. This resulted in very high transaction fees, making it to expensive for small investors to use it&#39;s dapps.</p>\n\n<p>This is the main reason why many investors moved to the Binance Smart Chain, which has much lower fees, untill Ethereum 2.0 has been implemented, which is an update that will drastically lower the transaction fees for the network.</p>\n\n<p>However, in order for the Binance Smart Chain to maintain such low transaction fees, it had to sacrifice it&#39;s decentralized properties. This resulted in that the Binance Smart Chain is much more centralized and less safe compared to Ethereum.</p>\n\n<p>Fortunately, there are various projects working on Layer 2 solutions to improve both the scalability and speed of the Ethereum network. Layer 2 refers to a secondary framework, chain or protocol that is built on top of an existing blockchain system. By doing so, the mainchain can be unloaded and can solely focus on the safety of the network.</p>\n\n<p>In the case of Ethereum, there are currently 2 sidechains that are pegged to it. These chains are the xDai chain and the Polygon chain. The latter of the sidechains is the most promising Layer 2 solution so far.</p>\n\n<p>By bridging your assets from the Ethereum mainchain to the sidechains, you are able to interact with various dapps that work on these sidechains for almost an negligible amount transaction fees.</p>\n\n<h1>Getting started</h1>\n\n<p>Now that you&#39;re aware of the fundamentals of DeFi, let&#39;s dive into how you can move your assets into the various DeFi protocols.</p>\n\n<h1>Setting up your wallet</h1>\n\n<p>In order to move your assets from your wallet on the exchange that you&#39;re using to either the Ethereum network, Binance Smart Chain, or Sidechains, you will need a browser wallet that can interact with these DeFi protocols.</p>\n\n<p>I&#39;m currently using MetaMask, so I will use this browser wallet in this guide:</p>\n\n<ol>\n<li>Go to the official MetaMask website in your browser (<a href=\"https://metamask.io/\">https://metamask.io/</a>)</li>\n<li>Press “Get Chrome extension”, “Chrome Firefox Opera” or “Get Brave Browser”. This of course depends on the browser you want to use at that time.</li>\n<li>You will now be taken to a page where you can add the extension. With Chrome, for example, there is a button with: + ADD. TO CHROME. Click on the button.</li>\n<li>A popup appears to confirm this</li>\n<li>You will now see a MetaMask logo at the top right of the browser. Click this to set up MetaMask.</li>\n<li>Accept the terms and conditions</li>\n<li>Create and confirm a new password. Please remember this password.</li>\n<li>You will now see 12 words. With these words you can always recover your wallet - in combination with the password. Write these words down and keep them safe. Preferably offline - just on paper.</li>\n<li>Congratulations! You have now installed and configured a MetaMask extension. You can now use the buttons “Buy” and “Send” to buy or send Ether to your wallet. You can now also send Ethereum to the address under “Account 1”.</li>\n</ol>\n\n<p>Your MetaMask wallet will be automatically connected to the Ethereum network. In order to connect your MetaMask to the Binance Smart Chain, Polygon or xDai, follow these steps:</p>\n\n<ol>\n<li>Click on the network in the top right corner.</li>\n<li>Go to settings.</li>\n<li>Click &quot;Add network&quot;</li>\n</ol>\n\n<p>In order to setup your wallet for the Binance Smart Chain, enter the following parameters:</p>\n\n<p>Network Name: Smart Chain</p>\n\n<p>New RPC URL: <a href=\"https://bsc-dataseed.binance.org/\">https://bsc-dataseed.binance.org/</a></p>\n\n<p>ChainID: 56</p>\n\n<p>Symbol: BNB</p>\n\n<p>Block Explorer URL: <a href=\"https://bscscan.com/\">https://bscscan.com</a></p>\n\n<p>&#x200B;</p>\n\n<p>In order to setup your wallet for the Polygon sidechain, enter the following parameters:</p>\n\n<p>Network Name: Matic Mainnet</p>\n\n<p>New RPC URL: <a href=\"https://rpc-mainnet.maticvigil.com/\">https://rpc-mainnet.maticvigil.com/</a></p>\n\n<p>ChainID: 137</p>\n\n<p>Symbol: MATIC</p>\n\n<p>Block Explorer URL: <a href=\"https://explorer.matic.network/\">https://explorer.matic.network/</a></p>\n\n<p>&#x200B;</p>\n\n<p>In order to setup your wallet for the xDai sidechain, enter the following parameters:</p>\n\n<p>Network Name: xDai</p>\n\n<p>New RPC URL: <a href=\"https://rpc.xdaichain.com/\">https://rpc.xdaichain.com/</a></p>\n\n<p>Chain ID: 0x64</p>\n\n<p>Symbol: xDai</p>\n\n<p>Block Explorer URL: <a href=\"https://blockscout.com/xdai/mainnet\">https://blockscout.com/xdai/mainnet</a></p>\n\n<h1>Faucets</h1>\n\n<p>In order to be able to perform transactions on these chains, you need to have some of their coins/tokens in your wallet in order to pay for the transaction fees.</p>\n\n<ul>\n<li>In order to use Ethereum you need Ether</li>\n<li>In order to use Binance Smart Chain you need BNB</li>\n<li>In order to use xDai you need xDai</li>\n<li>In order to use Polygon you need Matic</li>\n</ul>\n\n<p>Luckily you can get small amounts of the currencies for free from so called faucets.</p>\n\n<p>A faucet is an app or a website that distributes small amounts of cryptocurrencies. They’re given the name “faucets&#39;&#39; because the rewards are small, just like small drops of water dripping from a leaky faucet.</p>\n\n<p>However, in the case of crypto faucets, tiny amounts of free or earned cryptocurrency are sent to a user’s wallet. In order to get free crypto, users need to complete tasks as simple as viewing ads, watching product videos, completing quizzes, clicking links (be careful!) or completing a captcha.</p>\n\n<p>You can use the following faucets to receive small amounts of crypto:</p>\n\n<ul>\n<li>xDai: <a href=\"https://blockscout.com/xdai/mainnet/faucet\">https://blockscout.com/xdai/mainnet/faucet</a></li>\n<li>Matic: <a href=\"https://faucet.matic.network/\">https://faucet.matic.network/</a></li>\n</ul>\n\n<p>Unfortunately. I wasn&#39;t able to find any faucets for Ether or BNB.</p>\n\n<h1>Sending crypto from the exchange to MetaMask</h1>\n\n<p>In order to receive send your assets to MetaMask wallet, you need to fill in the correct address. This is probably straight forward for most of you, but please make sure to quadruple check you&#39;re MetaMask wallet address before sending your tokens from the exchange to your address.</p>\n\n<p>When you&#39;re sending tokens from Binance, it will ask if you want to send them as BEP20 or ERC20 tokens. Please choose the correct one! Sending BEP20 tokens to your Ethereum address can result in a loss or they end up in your Binance Smart Chain wallet.</p>\n\n<h1>Bridging: An important step!</h1>\n\n<p>Please notice that you can&#39;t send your tokens directly from the exchange to sidechains such as xDai or Polygon! You need to send them first to the Ethereum network (as they are both sidechains pegged to the Ethereum blockchain). Once received, you can bridge them to xDai or Polygon by using the following links:</p>\n\n<ul>\n<li><a href=\"https://bridge.xdaichain.com/\">https://bridge.xdaichain.com/</a></li>\n<li><a href=\"https://wallet.matic.network/bridge/\">https://wallet.matic.network/bridge/</a></li>\n</ul>\n\n<p>Keep in mind that for during the bridging, Ethereum transactions fees have to be paid. After the bridging, you play by the rules of the sidechain (which means cheap transactions).</p>\n\n<h1>I can&#39;t find my tokens in my wallet!</h1>\n\n<p>If you can&#39;t find your tokens back in your wallet after sending them from the exchange, you can follow these steps:</p>\n\n<ul>\n<li>Check the transaction record, is the transaction completed?</li>\n<li>Make sure you look at the right network. Your MetaMask wallet might be connected to the Binance Smart Chain network, hence not showing your assets.</li>\n<li>Add the contract address of your token to the wallet. You can find the address of your token via <a href=\"https://etherscan.io/\">https://etherscan.io</a> (Ethereum) or <a href=\"https://bscscan.com/yieldfarms\">https://bscscan.com</a> (Binance Smart Chain). The token address can then be copied in to the MetaMask wallet by clicking on add custom token.</li>\n</ul>\n\n<h1>Setting up your dashboard</h1>\n\n<p>To make things a bit more clear, I would advice you to use the DeFi dashboard <a href=\"https://zapper.fi/\">Zapper.fi</a>. Zapper is an interesting platform that lets you quickly and easily deploy and manage your DeFi positions within a single interface. It is a DeFi portfolio management dashboard that helps you stay on top of your portfolio, liquidity pools, and liquidity mining positions.</p>\n\n<p>Zapper supports Ethereum, Binance Smart Chain, xDai and Polygon. In order to connect to the right network, you must first connect your MetaMask to the network you want zapper to connect to. By clicking in the top right corner of your MetaMask wallet you can connect to the network you want Zapper to manage for you.</p>\n\n<p>The first tab of Zapper, shows an overview of your account. It shows the value of your assets in your MetaMask wallet and how your deployed assets are performing in the DeFi protocols (if you deployed any already).</p>\n\n<p>In order to reduce gas fees, Zapper has several features that can &quot;Zap&quot; your assets fast and &quot;cheap&quot; in order to:</p>\n\n<ul>\n<li>Start providing liquidity in a pool.</li>\n<li>Swap tokens.</li>\n<li>Bridge your tokens from one network to another.</li>\n</ul>\n\n<p>Zapper also keeps track of the estimated APY&#39;s (Annual Percentage Yield) of the various pools from different DeFi protocols as well as farming opportunities.</p>\n\n<h1>A list of DeFi protocols</h1>\n\n<p>Before wrapping this post up, I want to share the following website: <a href=\"https://defipulse.com/\">https://defipulse.com/</a></p>\n\n<p>DeFi Pulse records the top performing DeFi protocols on the Ethereum main chain as well as their TVL (total locked value) and ranks them accordingly. This page is really worth checking out as it can help you to pick the right protocols to deploy your assets in.</p>\n\n<p>In order to monitor the DeFi space of Binance Smart Chain, Polygon and xDai I like to use <a href=\"https://dappradar.com/rankings/category/defi\">https://dappradar.com/rankings/category/defi</a> and <a href=\"https://defiprime.com/#defi_projects\">https://defiprime.com/#defi_projects</a>. However, If you use other resources in order to find the right dapp, let me know!</p>\n\n<h1>That&#39;s it for this guide!</h1>\n\n<p>I really do hope that this guide helps you to get started on your DeFi adventure.If I missed something or whatever let me know so I can change it.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>If you found this guide helpful, <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mdjsrj/defi_explained_defi_wallets/\">please read my DeFi (Decentralized Finance) series</a>. I&#39;ve covered a wide plethora of subjects and linked all posts to make it more convenient for you to read.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 7439,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?auto=webp&s=3b2a6cadcf175e7b6934d143cf3b5d1978639d43",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=108&crop=smart&auto=webp&s=0c5b3665287cd29680e9d291d94b751c080fde6f",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=216&crop=smart&auto=webp&s=d7e26e3dd005cd8f8087d98f847ab8996ef006c5",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=320&crop=smart&auto=webp&s=bda481b8d537cf7bfd3890c75d414b435be10ddd",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=640&crop=smart&auto=webp&s=4ad0a2b48b190f1d22ad85d05a5a11ecf06b95de",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=960&crop=smart&auto=webp&s=af87657d4879e0a086b5809b412d3cf154ee0764",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=1080&crop=smart&auto=webp&s=829f9de305b30b51832f664c9703bd65edf4a706",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "4jPdiaVD-s35AxplTrYPcbo-8BUjZDBgXOuWFC8TM1Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/nletmi/defi_explained_the_full_guide/",
  "subreddit": "CryptoCurrency",
  "id": "nletmi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387098
}