{
  "author": "Giga79",
  "original_created_utc": 1626178852,
  "title": "Use custom wallet addresses (adam.wallet) instead of confusing public keys!",
  "created_utc": 1626190263,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the best things I learned this year was you can create mint domain names (as NFTs aka ERC721 tokens) then point them at your own public keys. Someone can send ETH, BTC, Doge, XMR, (200+) tokens to the same domain “adam.wallet” and it all ends up in the corresponding crypto wallet.</p>\n\n<p>---</p>\n\n<p><strong>How?</strong></p>\n\n<p>There are multiple routes but the best (I think) is through UnstoppableDomains since they don&#39;t expire.</p>\n\n<p>On their site find a domain you want, like Username(.x / .wallet / .crypto / .888 / .blockchain / .coin / .nft / .bitcoin), if it&#39;s not short it&#39;ll be around $20. Claim it in MetaMask for ~$10 in gas (*) then enter all the public keys to the wallets you own through their website. Now tell people to enter that domain into their wallet or exchange like Coinbase and hit send!</p>\n\n<p>---</p>\n\n<p><strong><em>Why?</em></strong></p>\n\n<p>Instead of telling someone you’ll email them your key, or, “hold on I’ll get a QR code”, you can tell them to send their crypto of choice to TorontoDonuts.crypto. It&#39;s easy, print it on business cards, spray paint it on your fence, as long as it’s legible people will know what to do.</p>\n\n<p>I used to check my address 8 or 10 times before I’d move $15. Twice a week for months, I’ve probably spent an hour staring at my own key. I know it off by heart, but you know every time I think I’m right I have to check again to make sure anyway. Since I registered my own domain I just whip it into Coinbase and hit send, I don&#39;t have to triple check anymore because I know my name.</p>\n\n<p>---</p>\n\n<p><strong>What&#39;s the catch?</strong></p>\n\n<p>If you register a domain with ENS(EthereumNamingService) you have to renew it every year. If you pay for one year at a time you have to pay gas every time you renew it so it&#39;s more than paying for multiple years at once. </p>\n\n<p>Not every wallet or exchange support sending crypto to ERC721 tokens. The most popular support it, Blockchain-com, Bitcoin-com MetaMask, Trust Wallet, Coinbase-com, Gemini, (etcetera) and more <strong>do</strong> yet there&#39;s a chance your friend&#39;s still does not. I’m not sure what happens if someone sends crypto through a non supporting wallet or if they&#39;re even able to. If anyone knows please add in a comment, I&#39;d be grateful. </p>\n\n<p>Not every crypto is supported. Over 200 are but currently there&#39;s no way to set this up with safemoon... yet.</p>\n\n<p>Gas fees. When I did mine gas was around 10GWEI and cost around $11 per domain but gas has gone from 1-100 in this month. There&#39;s talk they&#39;ll be migrating to an L2 like Arbitirum or Optimism soon dropping the gas 90-99% and you&#39;ll be able to move custody of the NFT between chains and choose which to claim it on. Until then planning for the gas market is crucial, there&#39;s no mention of it on their sites until the moment before. </p>\n\n<p>UnstoppableDomains just added most of their TLD’s like .wallet and .coin and those one&#39;s are on pre-sale right now (currently defunct.). Lots of people bought somename.tld and put on OpenSea for $10,000+ then UD&#39;s released somename.x for $40 lowering the return for those initial investors, leaving lots pissed unless they bought the new name&#39;s out too... There&#39;s nothing to say they won&#39;t do this ten more times, but they&#39;ve only done it once (just last month) so on the bright side there are lots of great names still available. FWIW they did give an air drop in credits to people who made purchases before then to claim their name&#39;s over again. </p>\n\n<p>If you register your fullname.crypto and use it to send/receive funds from your other wallets they’ll be tied and your name will show up in Etherscan, like any wallet but some people overlook this. I use my personal name domain as a savings account that only talks to an exchange, and other names for personal or business use. If you send from hookerslove.coin to yourfamily.wallet it&#39;ll be there until the end of Ethereum. If you want to move funds between wallets anyway and maintain privacy you can still use intermediary wallets and monoro. </p>\n\n<p>---</p>\n\n<p><strong>What else?</strong></p>\n\n<p>You can use these for IPFS websites, that are decentralized and censorship resistant by nature. While they’re set up as websites they still function as wallets.. It takes much gas and knowledge to accomplish this so it&#39;s not a great environment to learn in, but if you know-you know it&#39;s solid. </p>\n\n<p>Since they&#39;re NFT’s you can trade them, if you land on VirtualSpace.x for $40 today who knows what someone will pay for it in 1-10 years. There are lots that sell for over 1ETH every day, though I&#39;m too old to understand why. Personal wallets are my line.</p>\n\n<hr/>\n\n<p>I don&#39;t know why more people aren&#39;t using them, I think it&#39;s only a matter of time before we all do.. If anyone knows any downsides please comment and share because to me this all looks good :)</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/ojef8r/use_custom_wallet_addresses_adamwallet_instead_of/",
  "subreddit": "CryptoCurrency",
  "id": "ojef8r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One of the best things I learned this year was you can create mint domain names\n(as NFTs aka ERC721 tokens) then point them at your own public keys. Someone can\nsend ETH, BTC, Doge, XMR, (200+) tokens to the same domain “adam.wallet” and it\nall ends up in the corresponding crypto wallet.\n\n--…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年学んだことの中で最も良かったことの一つは、ミント・ドメイン名を作成して\n(NFT、別名ERC721トークンとして)を作成し、自分の公開鍵を指すことができるということです。誰かが\nETH、BTC、Doge、XMRなど（200以上）のトークンを同じドメイン「adam.wallet」に送ると\nすべてが対応する暗号ウォレットに入ります。\n\n--...",
      "title": "紛らわしい公開鍵の代わりに、カスタムウォレットアドレス（adam.wallet）を使用してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年学到的最好的事情之一是你可以创建薄荷域名\n(作为NFT（又称ERC721代币），然后将其指向你自己的公钥。有人可以\n发送ETH、BTC、Doge、XMR等（200多种）代币到同一个域名 \"adam.wallet\"，然后全部进入相应的加密货币。\n所有这些都会出现在相应的加密货币钱包中。\n\n--...",
      "title": "使用自定义的钱包地址（adam.wallet），而不是混乱的公钥!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年學到的最好的事情之一是你可以創建薄荷域名\n(作爲NFT（又稱ERC721代幣），然後將其指向你自己的公鑰。有人可以\n發送ETH、BTC、Doge、XMR等（200多種）代幣到同一個域名 \"adam.wallet\"，然後全部進入相應的加密貨幣。\n所有這些都會出現在相應的加密貨幣錢包中。\n\n--...",
      "title": "使用自定義的錢包地址（adam.wallet），而不是混亂的公鑰!"
    }
  ]
}