{
  "author": "Unique_Username2b",
  "original_created_utc": 1636695049,
  "title": "When will crypto get serious?",
  "created_utc": 1636732021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a dream. The dream is this. I want crypto to level up. I want to get past the hype and bullshit. I want the entire crypto ecosystem, to be the driving force in future finance across the globe. I also want the Banks to be left out in the cold.</p>\n\n<p>I don&#39;t ever want to take my holdings out and convert to shitty fiat. I don&#39;t want to be taxed because it&#39;s capital gains. I want to walk into a shop, swipe my phone and pay in whatever the fuck crypto I want (you can tax me their on my purchase pricks!). I want to earn bonuses on those purchases, I want the world to utilize crypto in a way that makes the Banks cream their pleated pants. </p>\n\n<p>Is this a pipedream? What do you want from your crypto future?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/qs4cq8/when_will_crypto_get_serious/",
  "subreddit": "CryptoCurrency",
  "id": "qs4cq8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a dream. The dream is this. I want crypto to level up. I want to get past\nthe hype and bullshit. I want the entire crypto ecosystem, to be the driving\nforce in future finance across the globe. I also want the Banks to be left out\nin the cold.\n\nI don't ever want to take my holdings out and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私には夢があります。その夢とはこうだ。cryptoをレベルアップさせたい。誇大広告やデタラメを乗り越えたい\n誇大広告やデタラメを乗り越えて 暗号のエコシステム全体を、世界中の未来の金融の原動力にしたいのです。\n世界の未来の金融の原動力になってほしい。また、銀行には冷遇してもらいたいですね。\n冷遇してほしい。\n\n私は自分の持ち株を外に持ち出すことはしたくありません。",
      "title": "暗号はいつ本気になるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个梦想。这个梦想是这样的。我希望加密货币的水平提高。我想超越\n炒作和废话。我希望整个加密货币生态系统，成为未来的驱动力。\n在全球范围内成为未来金融的驱动力。我也希望银行被冷落\n处于冷落状态。\n\n我不希望把我持有的股票拿出来，而...",
      "title": "什么时候加密货币才会变得严肃？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個夢想。這個夢想是這樣的。我希望加密貨幣的水平提高。我想超越\n炒作和廢話。我希望整個加密貨幣生態系統，成爲未來的驅動力。\n在全球範圍內成爲未來金融的驅動力。我也希望銀行被冷落\n處於冷落狀態。\n\n我不希望把我持有的股票拿出來，而...",
      "title": "什麼時候加密貨幣纔會變得嚴肅？"
    }
  ]
}