{
  "author": "AlreadyLiberated",
  "original_created_utc": 1624983002,
  "title": "Why Prices Are Rising Today, and Where They Could Be Headed (A Reverse-Stochastic Analysis of the Winihoff Decumulation Phase)",
  "created_utc": 1625002566,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all know that for the last 47 days we’ve been jerked around by the inverted Winihoff decumulation phase. But today Bitcoin moved into a descending pentagon pattern, currently testing 35k to the upper falsetto Trend Line of 37k. This indicates Bitcoin could possibly range back downwards to 30k if the Phase 3 Burgandy Trend Line isn’t held in the 24-hour period. </p>\n\n<p>If we <em>do</em> hold the Burgandy trend line, we could rocket past the 37k mark and overcome the asymmetric volatility, just like we saw at the end of last cycle’s oscillating Morningstone quadrant phase. </p>\n\n<p>In short: it’s quickly approaching Truth Time™️ for Bitcoin. If we can’t hold the Burgandy line, I see a re-test of the 21-day SVP directional level. But if we <em>can</em> hold the Burgandy line, and if Bitcoin blasts through the Tamland 27-week support metric, the upward pressure could lead to a downward stochastic indication of a Rainbow Cross. If that happens, all bets are off.</p>\n\n<p>Please subscribe to my shocked-face-thumbnail YouTube channel for more insight and analysis.</p>\n</div><!-- SC_ON -->",
  "score": 475,
  "permalink": "/r/CryptoCurrency/comments/oabex3/why_prices_are_rising_today_and_where_they_could/",
  "subreddit": "CryptoCurrency",
  "id": "oabex3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all know that for the last 47 days we’ve been jerked around by the inverted\nWinihoff decumulation phase. But today Bitcoin moved into a descending pentagon\npattern, currently testing 35k to the upper falsetto Trend Line of 37k. This\nindicates Bitcoin could possibly range back downwards to 30k if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この47日間、私たちは反転した\nウィニホフのデキュメレーション・フェーズに翻弄されていることを知っています。しかし今日、ビットコインは下降するペンタゴンパターンに移行した。\nパターンに移行し、現在35kから37kの上側のファルセットトレンドラインを試しています。これは\nビットコインが30kまで下降する可能性があることを示しています...",
      "title": "なぜ今、価格が上昇し、どこへ向かうのか（「ウィニホフ・デキュミュレーション・フェーズ」の逆ストキャスティック分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道，在过去的47天里，我们一直被倒置的\n威尼霍夫下降阶段。但今天比特币进入了一个下降的五边形\n模式，目前正在测试35K到37K的上行趋势线。这\n表明比特币有可能向下回落到30K，如果...",
      "title": "为什么今天的价格在上涨，以及它们可能的走向（对威尼霍夫下降阶段的反向随机分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道，在過去的47天裏，我們一直被倒置的\n威尼霍夫下降階段。但今天比特幣進入了一個下降的五邊形\n模式，目前正在測試35K到37K的上行趨勢線。這\n表明比特幣有可能向下回落到30K，如果...",
      "title": "爲什麼今天的價格在上漲，以及它們可能的走向（對威尼霍夫下降階段的反向隨機分析"
    }
  ]
}