{
  "author": "pepperonimilkjuice5",
  "original_created_utc": 1650217079,
  "title": "No. Looking at pages 10 and beyond on Coingecko and tick the “7 key factors” boxes will NOT guarantee wealth.",
  "created_utc": 1650239049,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a response to the &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/u5je3f/how_i_accumulated_my_wealth_by_looking_at_pages/\"&gt;post&lt;/a&gt; on the front page titled ‘How I accumulated my wealth by looking at pages 10 and beyond on Coingecko’.&lt;/p&gt;\n\n&lt;p&gt;Let me just start of that his story is anecdotal and not based on any evidence, but let’s just give it the benefit of the doubt.&lt;/p&gt;\n\n&lt;p&gt;——&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Being early is everything in crypto&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That’s not entirely true. Of course everyone wants a time machine so they can buy Bitcoin back in 2009/2010/2011, but what’s the point if being early if you would not have held until 2021/2022? Remember pizza guy?&lt;/p&gt;\n\n&lt;p&gt;A lot of people who were early sold early too. When Bitcoin was $1k or even $100 for example. But I don’t blame them, because profit = profit. Anyway, being early is good but &lt;strong&gt;certainly&lt;/strong&gt; not “everything”.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;so it baffles me that people buy top 50 coins and expect to get rich. These generally have 2-3x potential at best in any reasonable investor timeframe, while lowcaps have 100-500x potential.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Incorrect. If FTM (#46 on Coingecko) had the marketcap of DOGE (#12 on Coingecko), the upside would be 544%. Even if ATOM (#23 on Coingecko) had the marketcap of ADA (#8 on Coingecko), the upside would be 330%. And let’s not forget that the crypto market is relatively new: Bitcoin exists for only 13 years. Cryptocurrency in general has a lot of grow potential.&lt;/p&gt;\n\n&lt;p&gt;Also, OP has a narrow definition of “reasonable investor timeframe”. What does that even mean? People expecting quick gains, chasing pumps or waiting for their coin to x100 often get burned. Besides, lowcaps may have 100-500x potential, but are very volatile and even though the price may go up fast… it can dump real fast too. High/mid marketcaps are a more stable and safer choice.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;But it&amp;#39;s so risky!&amp;quot; you may object. Well, here&amp;#39;s the thing: that risk can be managed by looking at some key factors before you invest in a project:&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;OP then continues by writing down some rules. These are good guidelines to pick a solid project with a good use case, and avoid things like a pump and dump.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If your inquiry survived all 7 points, congratulations! You&amp;#39;re &lt;em&gt;early&lt;/em&gt; in a project that has a good chance of becoming very valuable.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Exactly. “A good chance.” We only hear of success stories and generally don’t hear about the times people who failed to pick a project that did a x100.&lt;/p&gt;\n\n&lt;p&gt;To finish this rant, I would like to get rid of the assumption that a good project or a doxxed team does not automatically mean that the price is going to x100. There are a LOT of very good and solid (low marketcap) projects that never got in the top marketcap rankings for years.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 351,
  "permalink": "/r/CryptoCurrency/comments/u5s0fs/no_looking_at_pages_10_and_beyond_on_coingecko/",
  "subreddit": "CryptoCurrency",
  "id": "u5s0fs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is a response to the post\n[https://np.reddit.com/r/CryptoCurrency/comments/u5je3f/how_i_accumulated_my_wealth_by_looking_at_pages/]\non the front page titled ‘How I accumulated my wealth by looking at pages 10 and\nbeyond on Coingecko’.\n\nLet me just start of that his story is anecdotal and not…"
}