{
  "author": "Many_Scratch2269",
  "original_created_utc": 1641114664,
  "title": "Anyone else saving in Crypto and completely ignoring banks?",
  "created_utc": 1641145588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Whenever someone talks about depositing or saving money, most people instantly think about banks for some reason. IMO they are the worst way to save money, not only do they offer interest rates that are terrible and lower than the inflation rate, they&amp;#39;re also terrible privacy wise.&lt;/p&gt;\n\n&lt;p&gt;Crypto is much much better. I&amp;#39;m getting double digit interest rates, huge annual return due to Crypto&amp;#39;s value rising PLUS a hedge against inflation. Moreover, there&amp;#39;s no privacy concern and the utility is the same or even more than banks considering Crypto is being accepted more and more as a payment method with better discounts than bank credit cards. Who else does the same?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 448,
  "permalink": "/r/CryptoCurrency/comments/ru5yrc/anyone_else_saving_in_crypto_and_completely/",
  "subreddit": "CryptoCurrency",
  "id": "ru5yrc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Whenever someone talks about depositing or saving money, most people instantly\nthink about banks for some reason. IMO they are the worst way to save money, not\nonly do they offer interest rates that are terrible and lower than the inflation\nrate, they're also terrible privacy wise.\n\nCrypto is much…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "<!-- SC_OFF --><div class=\"md\"><p> 預け入れの話をするとき、必ずと言っていいほど、「預け入れ」「預け入れ」が出てきます。\nお金を貯めるとき、多くの人はなぜか即座に銀行を思い浮かべます。私は、銀行が\nお金を貯めるには最悪の方法です。\n",
      "title": "Cryptoで貯金して、銀行を完全に無視してる人いる？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "<! -- SC_OFF --><div class=\"md\"><p>每当有人谈及存款或储蓄时\n时，大多数人出于某种原因会立即想到银行。IMO他们\n是最糟糕的存钱方式，他们不仅提供的利率是\n他们不仅提供可怕的、低于通货膨胀率的利率，他们还...",
      "title": "还有人用加密货币储蓄而完全无视银行吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "<! -- SC_OFF --><div class=\"md\"><p>每當有人談及存款或儲蓄時\n時，大多數人出於某種原因會立即想到銀行。IMO他們\n是最糟糕的存錢方式，他們不僅提供的利率是\n他們不僅提供可怕的、低於通貨膨脹率的利率，他們還...",
      "title": "還有人用加密貨幣儲蓄而完全無視銀行嗎？"
    }
  ]
}