{
  "author": "Newbietoinvesting",
  "the_new_excerpt": "I recently received $35k in inheritance. I'm sad about the loss of my mom, but\nthe least I feel I can do is put her gift to good use. I'm very new to investing\nand am reading all I can but due to some information overload I also wanted to\npost here asking for help and advice.\n\nI started a small car…",
  "original_created_utc": 1623446141,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、35,000ドルの相続が発生しました。母を失ったことは悲しいですが\n私にできることは、母の遺産を有効に活用することだと思います。私は投資の経験が浅く\n読んでいますが、情報過多になっているため、ここに投稿して助けやアドバイスを求めたいと思います。\n私は投資の初心者で、できる限りのことを読んでいます。\n\n私は小さな車を始めました...",
      "title": "19歳の35万円の相続のお手伝い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近收到了3.5万美元的遗产。我为失去我的母亲而感到悲伤，但是\n我觉得我至少可以做的是把她的礼物好好利用起来。我对投资很陌生\n我是投资新手，正在阅读所有我能读到的东西，但由于一些信息过载，我也想在这里发表一下我的看法。\n在这里发帖寻求帮助和建议。\n\n我开始了一个小型的车...",
      "title": "19岁的3.5万遗产的帮助"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近收到了3.5萬美元的遺產。我爲失去我的母親而感到悲傷，但是\n我覺得我至少可以做的是把她的禮物好好利用起來。我對投資很陌生\n我是投資新手，正在閱讀所有我能讀到的東西，但由於一些信息過載，我也想在這裏發表一下我的看法。\n在這裏發帖尋求幫助和建議。\n\n我開始了一個小型的車...",
      "title": "19歲的3.5萬遺產的幫助"
    }
  ],
  "title": "19 year old 35k inheritance help",
  "created_utc": 1623463485,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently received $35k in inheritance. I&#39;m sad about the loss of my mom, but the least I feel I can do is put her gift to good use. I&#39;m very new to investing and am reading all I can but due to some information overload I also wanted to post here asking for help and advice.</p>\n\n<p>I started a small car detailing business, so that&#39;s my main source of income atm. I&#39;m looking for a long term strategy that I can add funds to over time. Fidelity has all of the money right now, and is just waiting for a game plan.</p>\n\n<p>Thank you all so much for the information you have added to this subreddit, and the support you show to eachother. I&#39;m looking forward to reading responses.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/Bogleheads/comments/nxqgbr/19_year_old_35k_inheritance_help/",
  "subreddit": "Bogleheads",
  "id": "nxqgbr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741226
}