{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Wednesday, May 12, 2021\n\nThe selloff in stocks intensified after a report that showed the consumer price\nindex (CPI) rose at a faster-than-expected pace, spooking market participants\nabout the prospects of inflationary pressures, increasing pressure on equities.\nThe S&P 500…",
  "original_created_utc": 1620852757,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月12日（水\n\n消費者物価指数(CPI)が予想以上に上昇したとの報道を受けて、株式の反落が強まった。\n消費者物価指数（CPI）が予想を上回るペースで上昇したことで、市場参加者はインフレ圧力の見通しを不安視し、株式の下落圧力が高まった。\nインフレ圧力の見通しについて市場参加者を不安にさせ、株式への圧力を高めました。\nS&P500は...",
      "title": "本日、2021年5月12日（水）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾 - 2021年5月12日，星期三\n\n在一份报告显示消费者价格指数（CPI）以高于预期的速度增长后，股票的抛售加剧了。\n报道显示消费者价格指数(CPI)上涨速度超过预期，吓坏了市场参与者。\n通货膨胀压力的前景，增加了对股票的压力。\n标准普尔500指数...",
      "title": "以下是今天的市场回顾，2021年5月12日，星期三"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧 - 2021年5月12日，星期三\n\n在一份報告顯示消費者價格指數（CPI）以高於預期的速度增長後，股票的拋售加劇了。\n報道顯示消費者價格指數(CPI)上漲速度超過預期，嚇壞了市場參與者。\n通貨膨脹壓力的前景，增加了對股票的壓力。\n標準普爾500指數...",
      "title": "以下是今天的市場回顧，2021年5月12日，星期三"
    }
  ],
  "title": "Here is a Market Recap for today Wednesday, May 12, 2021",
  "created_utc": 1620861061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>PsychoMarket Recap - Wednesday, May 12, 2021</p>\n\n<p>The selloff in stocks intensified after a report that showed the consumer price index (CPI) rose at a faster-than-expected pace, spooking market participants about the prospects of inflationary pressures, increasing pressure on equities. The S&amp;P 500 (SPY) closed 2.09% down, the tech-heavy Nasdaq (QQQ) fell 2.54%, while the Dow Industrial Average (DIA) fell 2%, the worst slump since February.</p>\n\n<p>The Bureau of Labor statistics reported that the consumer price index, which measures a basket of goods as well as energy and housing costs, rose 4.2% from a year ago, compared to the Dow Jones estimate for a 3.6% increase. The monthly gain was 0.8%, against the expected 0.2%. Excluding the volatile food and energy prices, the core CPI (this is the main measure of inflation) increased 3% compared to the same period in 2020 and 0.9% on a monthly basis. The respective estimates were 2.3% and 0.3%. This confirms fears market participants have had for months. Tomorrow, the producer price index will be released, which is expected to show a similar spike like the CPI. </p>\n\n<p>Market participants are worried that as the economy reopens and comes out of the pandemic, the surge in demand and consumer spending could drive a surge in prices, which, in turn, may prompt the Federal Reserve to raise interest rates sooner-than-expected, pressuring the valuations of technology and growth stocks. However, while the readings in inflation definitely are not good, it is important to note that Federal Reserve Chair Jerome Powell has consistently reiterated he expects any rise in inflation to be “transitory” as the economy continues to recover from the March and bottom and want to see a “string” of strong labor reports totaling 1 million before. In an April 28 meeting Powell said, “Amid progress on vaccinations and strong policy support, indicators of economic activity and employment have strengthened. Inflation has risen, largely reflecting transitory factors. Overall financial conditions remain accommodative, in part reflecting policy measures to support the economy and the flow of credit to U.S. households and businesses.”</p>\n\n<p>While the inflationary readings are definitely not good, they weren’t unexpected and with the SPY trading near record levels for consecutive weeks and the stretched valuation of some technology, this week’s sell-off is not unexpected. In my opinion, the current fear around the equity market seems overblown, and though I expect volatility going forward, my long-term outlook remains bullish and will be looking to take advantage of this dip in the indexes and mega-caps. </p>\n\n<p>Moreover, the April Job Report, released last Friday, showed the US economy only added 266,000 new jobs last month, missing estimates of more than 1 million jobs gained and marking a sharp deceleration from March’s total of 916,000 new jobs added. As said earlier, members of the Federal Reserve, including Powell, have consistently reiterated they want to see a<br/>\n“String” of strong labor reports before considering any changes to the current policy. Talking about the March Job report, Powell said, “We want to see a string of months like that [like in March] so we can really begin to show progress toward our goals. We just need to keep reminding ourselves that even though some parts of the economy are starting just great, there’s a very large group of people who are not.” The April Job Report bolsters Powell’s argument that large segments that the Federal Reserve will move slowly in changing policy. </p>\n\n<p>In addition, at a separate event in April, Powell said that quantitative easing would likely taper “well before” the interest rate is increased. He said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.” In short, while the inflationary readings are not great, I’m fairly confident fears that the Federal Reserve will tighten policy sooner than expected are overblown. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Elon Musk tweeted that Tesla (TSLA) is tweaking its self-driving software to eliminate a phantom braking problem and may release a significantly improved version within the next two to three weeks.</li>\n<li>Roblox (RBLX) says it would be able to pay its game developers more money if Epic Games - Apple trial results in cut fees in the app-store.</li>\n<li>Vehicle sales in China rose 8.6% in April versus the same month a year earlier, their 13th consecutive month of gains, according to the China Association of Automobile Manufacturers. Sales reached 2.25 million vehicles in April</li>\n<li>Gartner Research says it expects the global semiconductor shortage to persist until 2022.</li>\n</ul>\n\n<p>“Success is not final, failure is not fata; It is the courage to continue that counts.” - Winston Churchill</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/stocks/comments/naz3qf/here_is_a_market_recap_for_today_wednesday_may_12/",
  "subreddit": "stocks",
  "id": "naz3qf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996884
}