{
  "author": "aMnHa7N0Nme",
  "the_new_excerpt": "Dear friends\n\nSo i am a 28 yr old PhD student with a decent steady income with a few thousands\njust sitting in my bank account which I do not like.\n\nI tried my hand at CFD trading but quickly realized that it was too time\nconsuming of a commitment that I couldn't afford therefore i switched to…",
  "original_created_utc": 1613391808,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "亲爱的朋友们\n\n所以，我是一个28岁的博士生，有不错的稳定收入，有几千块钱。\n只是坐在我的银行账户，我不喜欢。\n\n我曾尝试过CFD交易，但很快意识到这太浪费时间了。\n消耗的承诺，我买不起，因此，我转到... ...",
      "title": "如何不过度分散我的ETF组合。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "親愛的朋友們\n\n所以，我是一個28歲的博士生，有不錯的穩定收入，有幾千塊錢。\n只是坐在我的銀行賬戶，我不喜歡。\n\n我曾嘗試過CFD交易，但很快意識到這太浪費時間了。\n消耗的承諾，我買不起，因此，我轉到... ...",
      "title": "如何不過度分散我的ETF組合。"
    }
  ],
  "title": "How not to over-diversify my ETF portfolio.",
  "created_utc": 1613403694,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Dear friends</p>\n\n<p>So i am a 28 yr old PhD student with a decent steady income with a few thousands just sitting in my bank account which I do not like.</p>\n\n<p>I tried my hand at CFD trading but quickly realized that it was too time consuming of a commitment that I couldn&#39;t afford therefore i switched to ETFs and already see the benefit of it. My fear is that i am too interested in seeing way too broad of a spectrum of ETFs.</p>\n\n<p>Currently I&#39;m invested in a lot of technology funds and clean energy. However, now I&#39;m also considering by a few of the other options as well such as the oil/commodities. Etc.</p>\n\n<p>What would you recommend as a aggressive enough approach without spreading my eggs in too many baskets</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/investing/comments/lkcnks/how_not_to_overdiversify_my_etf_portfolio/",
  "subreddit": "investing",
  "id": "lkcnks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621142
}