{
  "author": "maximalsimplicity",
  "the_new_excerpt": "So, I’ve had a thought recently about how it would be if the market was open\n24/7.\n\nI think there would be sufficient liquidity for most of the time; the US market\nis one of the most extensive and prominent in the world. In fact, I live in the\nUK and I actually like the US market more than the UK…",
  "original_created_utc": 1619968327,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで最近考えたのは、もし市場が24時間365日開いていたらどうだろうということです。\n24/7.\n\nほとんどの時間帯で十分な流動性があると思います。\nアメリカの市場は、世界で最も広範かつ著名な市場のひとつです。実際、私はイギリスに住んでいますが\n実際、私はイギリスに住んでいますが、イギリスよりもアメリカの市場の方が好きですね...。",
      "title": "株式市場が24時間365日開いていることについてはどう思われますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我最近有一个想法，如果市场开放，会是怎样的情况？\n24/7.\n\n我认为在大部分时间内会有足够的流动性；美国市场\n是世界上最广泛和最重要的市场之一。事实上，我住在\n事实上，我住在英国，我实际上更喜欢美国的市场，而不是英国......",
      "title": "你对股票市场24小时开放有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我最近有一個想法，如果市場開放，會是怎樣的情況？\n24/7.\n\n我認爲在大部分時間內會有足夠的流動性；美國市場\n是世界上最廣泛和最重要的市場之一。事實上，我住在\n事實上，我住在英國，我實際上更喜歡美國的市場，而不是英國......",
      "title": "你對股票市場24小時開放有什麼看法？"
    }
  ],
  "title": "How would you feel about the stock market being open 24/7?",
  "created_utc": 1619974083,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I’ve had a thought recently about how it would be if the market was open 24/7.</p>\n\n<p>I think there would be sufficient liquidity for most of the time; the US market is one of the most extensive and prominent in the world. In fact, I live in the UK and I actually like the US market more than the UK one, due to the stocks and the reliability of it. So, since there’s always global demand, I think we’ll have constant trading happening no matter the time.</p>\n\n<p>However, I enjoy the feeling of being able to sleep without the risk of waking up and seeing some stock has crashed 20% overnight.</p>\n\n<p>I’m personally in favour of keeping the market with distinct opening and closing times, but I wanted to hear other people’s opinions on it.</p>\n</div><!-- SC_ON -->",
  "score": 329,
  "permalink": "/r/stocks/comments/n38c3h/how_would_you_feel_about_the_stock_market_being/",
  "subreddit": "stocks",
  "id": "n38c3h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380967017
}