{
  "author": "UhUhWaitForTheCream",
  "the_new_excerpt": "Just had to had to share my story, I know there’s others like me out there.\n\nI invested $600 in 2018 on the back of the last bull run. I traded atleast 50\ncoins over the two years. I held everything from bitcoin to dogecoin, IOTA, XLM,\nvechain and holochain.\n\nI traded often. Eventually for a net…",
  "original_created_utc": 1620218741,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど私の話を共有する必要がありました、私はそこに私のような他の人がいることを知っています。\n\n私は最後のブルランに乗って2018年に600ドルを投資しました。私は2年間で少なくとも50\nコインを取引しましたが、この2年間で少なくとも50 ビットコインからdogecoin、IOTA、XLMまですべて保有しました。\nvechainとholochainです。\n\nよくトレードしました。最終的にはネットで...",
      "title": "強気の市場では誰もが金持ちになるわけではない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是不得不不得不分享我的故事，我知道还有其他像我一样的人在那里。\n\n在上一轮牛市的背景下，我在2018年投资了600美元。这两年我至少交易了50\n币，在这两年里。我持有从比特币到Dogecoin、IOTA、XLM。\nvechain和holochain。\n\n我经常进行交易。最终，我的净收入为1.5万美元。",
      "title": "在牛市中，不是每个人都能发财。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是不得不不得不分享我的故事，我知道還有其他像我一樣的人在那裏。\n\n在上一輪牛市的背景下，我在2018年投資了600美元。這兩年我至少交易了50\n幣，在這兩年裏。我持有從比特幣到Dogecoin、IOTA、XLM。\nvechain和holochain。\n\n我經常進行交易。最終，我的淨收入爲1.5萬美元。",
      "title": "在牛市中，不是每個人都能發財。"
    }
  ],
  "title": "In a bull market not everyone gets rich.",
  "created_utc": 1620233428,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just had to had to share my story, I know there’s others like me out there.</p>\n\n<p>I invested $600 in 2018 on the back of the last bull run. I traded atleast 50 coins over the two years. I held everything from bitcoin to dogecoin, IOTA, XLM, vechain and holochain. </p>\n\n<p>I traded often. Eventually for a net gain of $0. </p>\n\n<p>I wanted to get rich but I wanted to hold every bright project. I just couldn’t invest more than $600 so I had to sell constantly to get the next project. </p>\n\n<p>In 2020 after 2 years of no profits.. nothing. I decided to cash out. The last project I had before I sold was 800,000 Holochain tokens. I sold for $600. Was worth $30,000 six months later.</p>\n\n<p>I once held 0.0545 bitcoin. 6100 dogecoin. 96,000 VeChain. 1600 IOTA. 4000 XLM. </p>\n\n<p>Don’t be like me. Never trade. Buy and hodl and never check.</p>\n</div><!-- SC_ON -->",
  "score": 349,
  "permalink": "/r/CryptoCurrency/comments/n5f29i/in_a_bull_market_not_everyone_gets_rich/",
  "subreddit": "CryptoCurrency",
  "id": "n5f29i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965849
}