{
  "author": "dumbsaintmind",
  "original_created_utc": 1626943000,
  "title": "Do Your Part: Stop Spreading Elon Videos",
  "created_utc": 1626958376,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Or downvote those who do. Seriously, some of you are suffering from Stockholm syndrome in the worst way. A couple months ago, you were all anti-Elon. Now that he <em>might</em> be resuming BTC payments, or that SpaceX holds, you’re all for him again?  We know he holds, we know he has conviction, but he’s been manipulating people for months to get in at a better price...and you’re falling for it again, as though you’re all forgetful goldfish swimming from end to end. At the end of the day, who really cares what Elon thinks, says, does, etc.? Didn’t you learn your lesson the first time? (and the second, and the third?)</p>\n\n<p>If you truly believe in Bitcoin, you realize it will always be bigger than one person, one country, one dinosaur legacy system. Promoting a shameless self-promoter only feeds the notion that billionaires can and will shaft the little guy for their own gain. Bitcoin is supposed to be our vector out of that. Keep your eyes on the prize.</p>\n</div><!-- SC_ON -->",
  "score": 459,
  "permalink": "/r/Bitcoin/comments/op9t6w/do_your_part_stop_spreading_elon_videos/",
  "subreddit": "Bitcoin",
  "id": "op9t6w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Or downvote those who do. Seriously, some of you are suffering from Stockholm\nsyndrome in the worst way. A couple months ago, you were all anti-Elon. Now that\nhe might be resuming BTC payments, or that SpaceX holds, you’re all for him\nagain? We know he holds, we know he has conviction, but he’s been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "または、そういった人をダウンビートする。真面目な話、最悪ストックホルム症候群になっている人がいます。\n最悪の形でストックホルム症候群を患っている方がいます。数ヶ月前までは、皆さん反イーロンでした。今では\nBTCの支払いを再開するかもしれないし、SpaceXが保有しているから、また彼に賛成するのか？\nまた？保有していることも、信念を持っていることも知っていますが、彼はずっと...",
      "title": "Do Your Part: イーロン・ビデオを広めないで"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "或者对那些人进行降级投票。说真的，你们中的一些人正遭受着斯德哥尔摩\n症候群，以最糟糕的方式。几个月前，你们都在反对埃隆。现在\n他可能会恢复BTC支付，或者SpaceX持有，你们又都支持他了？\n又开始支持他了？我们知道他持有，我们知道他有信念，但他一直...",
      "title": "尽你的职责。停止传播埃隆视频"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "或者對那些人進行降級投票。說真的，你們中的一些人正遭受着斯德哥爾摩\n症候羣，以最糟糕的方式。幾個月前，你們都在反對埃隆。現在\n他可能會恢復BTC支付，或者SpaceX持有，你們又都支持他了？\n又開始支持他了？我們知道他持有，我們知道他有信念，但他一直...",
      "title": "盡你的職責。停止傳播埃隆視頻"
    }
  ]
}