{
  "author": "mxdSirty",
  "original_created_utc": 1647874480,
  "title": "With the \"supposed\" date of the ETH merge approaching, what do you think is truly going to happen?",
  "created_utc": 1647931453,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title says, the clock is ticking for the rumored time frame of the inevitable merge from POW to POS. We all know that this has been continually pushed back for years, and many expect this to continue. I&amp;#39;d be interested to hear your guy&amp;#39;s opinions on the subject. Personally, I believe that another delay is inevitable, simply due to the fact that hundreds of billions are on the line. There is no reason to rush such a major switch when a failure could cause competitors like SOL and ADA, to pass you in usage.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "permalink": "/r/CryptoCurrency/comments/tjdmx0/with_the_supposed_date_of_the_eth_merge/",
  "subreddit": "CryptoCurrency",
  "id": "tjdmx0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As the title says, the clock is ticking for the rumored time frame of the\ninevitable merge from POW to POS. We all know that this has been continually\npushed back for years, and many expect this to continue. I'd be interested to\nhear your guy's opinions on the subject. Personally, I believe that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、噂されている時間帯の\nPOWからPOSへの統合は避けられない。私たちは、これが継続的に行われていることを知っています。\n何年も前から延期されており、多くの人がこの状態が続くと予想しています。私は、次のことに興味があります。\nこの件に関して、あなたの部下の意見を聞かせてください。個人的には、...",
      "title": "ETHの合併の「予定日」が近づいてきましたが、本当にどうなると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所言，传言中的时间框架的时间正在流逝。\n从战俘到POS的不可避免的合并。我们都知道，这已经被不断地推迟了多年。\n我们都知道，这已经被持续推迟了多年，而且许多人希望这种情况继续下去。我很想知道\n我很想听听你们这些人对这个问题的看法。我个人认为，...",
      "title": "随着ETH合并的 \"假定 \"日期临近，你认为真正会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所言，傳言中的時間框架的時間正在流逝。\n從戰俘到POS的不可避免的合併。我們都知道，這已經被不斷地推遲了多年。\n我們都知道，這已經被持續推遲了多年，而且許多人希望這種情況繼續下去。我很想知道\n我很想聽聽你們這些人對這個問題的看法。我個人認爲，...",
      "title": "隨着ETH合併的 \"假定 \"日期臨近，你認爲真正會發生什麼？"
    }
  ]
}