{
  "author": "SlappySpankBank",
  "original_created_utc": 1629035360,
  "title": "Bank took money from my GF's account, they saw she bought crypto and their pissed they can't touch it no matter what they do.",
  "created_utc": 1629055835,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Long story short my gf took out a bunch of loans and she was approved because she was making a lot of money each month as a nurse at a world famous hospital here in Asia. Then covid hit and no one has been allowed into the country for almost 18 months now. So there is zero medical tourism now. So her salary went from making a shit ton of OT hours, to getting cut completely in half from base salary.</p>\n\n<p>So the past 18 months she, and like half the country, have been fighting with the banks to defer payments until the country re-opens. Well they went to court and the bank was supposed to wait. About two weeks ago her account was emptied by the bank. They just took it from her.</p>\n\n<p>No she still owes like $10,000 which is quite a bit of money here. They saw on her transactions history that she bought some crypto, thanks to me, and they want that too. The thing is, there is nothing they can do to take it from her. She was worried the bank was going to call the exchange or the &quot;electrum&quot; company and take it. I almost started laughing because she really doesn&#39;t know that that isn&#39;t possible. The only way they can get it is if them come to your house and torture you until you give them the seed phrase or make the transfer, which they won&#39;t do. I mean this isn&#39;t North Korea...not yet anyway.</p>\n\n<p>Now she has been getting calls daily from the bank harassing her about it.</p>\n\n<p>Damn it feels fucking good to have even just a little bit of power over the banks.</p>\n\n<p>PS: She is still going to pay the loans back when she can, just a really shitty situations right now for most people. Banks don&#39;t care.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/p4tqea/bank_took_money_from_my_gfs_account_they_saw_she/",
  "subreddit": "CryptoCurrency",
  "id": "p4tqea",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Long story short my gf took out a bunch of loans and she was approved because\nshe was making a lot of money each month as a nurse at a world famous hospital\nhere in Asia. Then covid hit and no one has been allowed into the country for\nalmost 18 months now. So there is zero medical tourism now. So…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長い話になりますが、私の妻はたくさんのローンを組みましたが、彼女は承認されました。\nアジアの世界的に有名な病院で看護師として毎月たくさんのお金を稼いでいたからです。\nアジアの有名な病院で看護師として働いていたからだ。その後、Covidが発生して、誰も入国できなくなってしまったんだ。\nもう1年半になります。そのため、メディカルツーリズムはゼロになってしまいました。それで...",
      "title": "彼女が暗号を買ったのを見て、銀行は怒って何をしても手を出せないと言っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "长话短说，我的女友申请了一堆贷款，她被批准了，因为她赚了很多钱。\n她在一家世界著名的医院当护士，每个月能赚很多钱\n在亚洲的一家世界著名的医院做护士，每个月都能赚很多钱，所以她获得了批准。然后就发生了核事故，没有人被允许进入这个国家。\n几乎18个月了。所以现在的医疗旅游是零。所以...",
      "title": "银行从我GF的账户中取走了钱，他们看到她买了加密货币，他们很生气，无论他们怎么做都不能碰它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長話短說，我的女友申請了一堆貸款，她被批准了，因爲她賺了很多錢。\n她在一家世界著名的醫院當護士，每個月能賺很多錢\n在亞洲的一家世界著名的醫院做護士，每個月都能賺很多錢，所以她獲得了批准。然後就發生了核事故，沒有人被允許進入這個國家。\n幾乎18個月了。所以現在的醫療旅遊是零。所以...",
      "title": "銀行從我GF的賬戶中取走了錢，他們看到她買了加密貨幣，他們很生氣，無論他們怎麼做都不能碰它。"
    }
  ]
}