{
  "author": "DaWorldIsAVampiree",
  "the_new_excerpt": "I originally asked this question in the r/AskGayMen [/r/AskGayMen] subreddit,\nand began by saying that I could only draw two conclusions about the person\nanswering questions in that community; Those two things being:\n\n * they identify as a man\n * they’re sexually attracted to other men\n\nEverything…",
  "original_created_utc": 1616144207,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最初是在r/AskGayMen[/r/AskGayMen]子reddit中提出这个问题的。\n并开始说，我只能对这个人得出两个结论。\n在该社区回答问题； 这两件事是：\n\n * 他们认为自己是个男人\n * 他们对其他男人有性吸引力\n\n一切...",
      "title": "什么是'性'？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最初是在r/AskGayMen[/r/AskGayMen]子reddit中提出這個問題的。\n並開始說，我只能對這個人得出兩個結論。\n在該社區回答問題； 這兩件事是：\n\n * 他們認爲自己是個男人\n * 他們對其他男人有性吸引力\n\n一切...",
      "title": "什麼是'性'？"
    }
  ],
  "title": "What is ‘sexuality’?",
  "created_utc": 1616182226,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I originally asked this question in the <a href=\"/r/AskGayMen\">r/AskGayMen</a> subreddit, and began by saying that I could only draw two conclusions about the person answering questions in that community; Those two things being:</p>\n\n<ul>\n<li><em>they identify as a man</em></li>\n<li><em>they’re sexually attracted to other men</em></li>\n</ul>\n\n<p><em>Everything</em> else about the person is a mystery to me, and if you take a moment to think about that... really just think about that for a moment... ‘everything else’ is <strong>A LOT</strong> of shit! </p>\n\n<p><em>Where do they live? What are their hobbies? What is their ethnic background? Are they a member of a religion? How old are they? Do they come from a big or small family? Are they well-off? Are they living paycheck to paycheck? What do they do for a living? What gets them out of bed in the morning?</em></p>\n\n<p>Yet, being a gay man myself, I said that this thing known as our ‘sexuality’ is such a strong element of our existence that it feels as though we (myself and my fellow gay men) know each other on some level. The <em>reason</em> for that being because sharing the same sexuality means we share a similar life experience, I am not entirely sold on. I think many would agree that we all have very different lives from one another, despite sharing a sexuality; And even when it comes to our shared identity, our relationships with our sexuality are not likely identical and possibly contrasting.</p>\n\n<p>So what is ‘sexuality’? Well...</p>\n\n<p>Google says that ‘sexuality’ is one’s <strong>”capacity for sexual feelings.”</strong> That seems a bit shy of covering the complete nature of sexuality, don’tcha think? Of course, sexuality does involve our capacity for sexual feelings, but it also holds weight in our platonic relationships as well. It is a driving force behind who we speak with and how we speak to them. More importantly (attempting to put words to the far-reaching influence sexuality has over our lives), it impacts how we interact with and interpret the world around us.</p>\n\n<p><em>Some say sexuality is fixed. Some say sexuality is a spectrum, but our position on said spectrum is fixed. Some say sexuality is a spectrum, and our position on said spectrum glides back and forth during our time spent alive. Some say sexuality is an abstract human element that simply has no rhyme or reason. Some say sexuality is given by a deity exclusively for procreational purposes.</em></p>\n\n<p>So what do <em>you</em> think is this thing called our ‘sexuality’? I am genuinely curious to hear what you have to say. It’s one of those things that when you really think hard about it, the more confusing it becomes. Impossible to define? Or comically simple and exhaustingly overanalyzed?</p>\n\n<p>Thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/m8d202/what_is_sexuality/",
  "subreddit": "askphilosophy",
  "id": "m8d202",
  "is_self": true,
  "media": null,
  "is_video": false
}