{
  "author": "Andra1996",
  "the_new_excerpt": "Pretty much like the title says, of course i want to specify that this is based\nentirely on my experience and therefore subjective. Here's why:\n\n\n\n-First of all, you usually take a very little amount of time to make your\ndecisions. Needless to say that this brings to reeeeally bad ones;\n\n\n\n-It…",
  "original_created_utc": 1615370552,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题说的那样，当然我想说明的是，这是基于\n完全是根据我的经验，因此是主观的。这就是为什么。\n\n\n\n-首先，你通常只需要花很少的时间来制作你的作品。\n决定。不用说，这带来的是非常糟糕的决定。\n\n\n\n-它...",
      "title": "所以在我短暂的经历后，我意识到日间交易真的很糟糕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題說的那樣，當然我想說明的是，這是基於\n完全是根據我的經驗，因此是主觀的。這就是爲什麼。\n\n\n\n-首先，你通常只需要花很少的時間來製作你的作品。\n決定。不用說，這帶來的是非常糟糕的決定。\n\n\n\n-它...",
      "title": "所以在我短暫的經歷後，我意識到日間交易真的很糟糕。"
    }
  ],
  "title": "So after my brief experience, i've realized that day trading really SUCKS",
  "created_utc": 1615398245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pretty much like the title says, of course i want to specify that this is based entirely on my experience and therefore subjective. Here&#39;s why:</p>\n\n<p>&#x200B;</p>\n\n<p>-First of all, you usually take a very little amount of time to make your decisions. Needless to say that this brings to reeeeally bad ones;</p>\n\n<p>&#x200B;</p>\n\n<p>-It doesn&#39;t feel like a wise investment for your future anymore, but more like gambling;</p>\n\n<p>&#x200B;</p>\n\n<p>-It really hurts to see cryptos you once owned (and sold for minimal profits) literally skyrocket and &quot;go to the moon&quot;;</p>\n\n<p>&#x200B;</p>\n\n<p>And last but not least:</p>\n\n<p>&#x200B;</p>\n\n<p>-It also feels like a job, a very bad one for your mental health: prices and charts are literally stuck in your head and you constantly feel the urge to check them. It&#39;s the first thing you do when you wake up and the last thing  you do before going to bed. Probably the worst out of them all;</p>\n\n<p>&#x200B;</p>\n\n<p>So to conclude: i feel like crypto should be more of a plan B, something where you put the money YOU DON&#39;T NEED and hope them to grow, maybe helping you to achieve a better future someday. But this should work as a background process, not something you constantly need to check and you have constantly stuck in your head, and therefore day trading feels BAAAAAD man (my opinion of course).</p>\n\n<p>&#x200B;</p>\n\n<p>Let me know what you guys think.</p>\n\n<p>&#x200B;</p>\n\n<p>TL;DR: day trading feels like a job, an addiction and a gamble all in once, and is BAAAAAAAAAD.</p>\n</div><!-- SC_ON -->",
  "score": 251,
  "permalink": "/r/CryptoCurrency/comments/m1u7qc/so_after_my_brief_experience_ive_realized_that/",
  "subreddit": "CryptoCurrency",
  "id": "m1u7qc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573527
}