{
  "author": "cattle-baron-",
  "original_created_utc": 1653616526,
  "title": "Does anyone else prefer room temperature water to cold?",
  "created_utc": 1653637356,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I should preface this by saying I don’t drink water,\nI chug it as rapidly as I possibly can until my stomach is full. However, this means that I hate cold water.\nOne sip is alright but it doesn’t really quench your thirst, just makes your mouth cold and prevents you from drinking any more for a few seconds. I’m not sure if what I do is weird but I do know my girlfriend only drinks water out of a brita filter in the fridge.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/uynb5e/does_anyone_else_prefer_room_temperature_water_to/",
  "subreddit": "NoStupidQuestions",
  "id": "uynb5e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I should preface this by saying I don’t drink water, I chug it as rapidly as I\npossibly can until my stomach is full. However, this means that I hate cold\nwater. One sip is alright but it doesn’t really quench your thirst, just makes\nyour mouth cold and prevents you from drinking any more for a few…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は水を飲まずに、お腹がいっぱいになるまで、できるだけ早く一気飲みしています。\n一気飲みしています。しかし、その分、冷たい水は苦手である。\n冷たい水は苦手だ。一口で飲めるのはいいのですが、喉の渇きを癒してくれるわけでもなく、ただ口の中が冷たくなって\n口の中が冷たくなって、しばらくは飲めなくなる...。",
      "title": "冷たい水より常温の水の方が好きな人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我应该先说我不喝水，我尽可能快地喝水，直到我的肚子饱了。\n我尽可能快地喝水，直到我的胃被填满。然而，这意味着我讨厌冷\n水。喝一口还可以，但它并不能真正解渴，只是让你的嘴变得冰冷，让你无法再喝。\n你的嘴很冷，让你无法再喝下去。",
      "title": "还有人喜欢室温水而不是冷水吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我應該先說我不喝水，我儘可能快地喝水，直到我的肚子飽了。\n我儘可能快地喝水，直到我的胃被填滿。然而，這意味着我討厭冷\n水。喝一口還可以，但它並不能真正解渴，只是讓你的嘴變得冰冷，讓你無法再喝。\n你的嘴很冷，讓你無法再喝下去。",
      "title": "還有人喜歡室溫水而不是冷水嗎？"
    }
  ]
}