{
  "author": "hominoid_in_NGC4594",
  "original_created_utc": 1636803810,
  "title": "What do you think it was exactly that made Julius Caesar so formidable in battle?",
  "created_utc": 1636820170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im not so much interested in the Gallic Wars, bc im sort of in the camp that doubts most of what he presents in Commentarii de Bello Gallico. Ive gone through it twice now, and I just can not help but  think that most of the battles were way, way more one-sided than he lets on. And of course the enemy numbers are just ridiculous and in no way possible given the military logistical capabilities of the Gauls in the 1st century BC. Im sure there were a lot of them, but millions of warriors with almost zero Roman casualties?? Come on Caesar...</p>\n\n<p>Anyway, I am more curious about every other battle he fought against other Roman generals, in Iberia, southern Gaul, Northern Africa, Egypt, and of course Greece. What did he do differently than the optimate Roman generals? </p>\n\n<p>Aside from Dyrrhachium, and maybe Ruspina, he seems to have completely out-maneuvered every single one of his foes on the battlefield, and most of the time with a smaller force. And some of those generals had like 30-40 years of military experience under their belts, while Caesar had very little military experience (at least at the head of an army) when he first went off to Gaul. And his most trusted lieutenant from the wars in Gaul, Labienus, went over to the Optimates, and even he couldn&#39;t take Caesar down. I just don&#39;t understand what he did so differently that made him such a dangerous adversary. </p>\n\n<p>Anyone with more knowledge care to shed some light on this?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/qszm1u/what_do_you_think_it_was_exactly_that_made_julius/",
  "subreddit": "AskHistorians",
  "id": "qszm1u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im not so much interested in the Gallic Wars, bc im sort of in the camp that\ndoubts most of what he presents in Commentarii de Bello Gallico. Ive gone\nthrough it twice now, and I just can not help but think that most of the battles\nwere way, way more one-sided than he lets on. And of course the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はガリア戦記にはあまり興味がありません。\n私は、彼が『Commentarii de Bello Gallico』で紹介している内容のほとんどに疑問を持っています。今までに2回ほど読みましたが\n今までに2回ほど読みましたが、ほとんどの戦いは彼が言うよりもずっとずっと一方的だったと思わずにはいられませんでした。\n彼が言っているよりもずっとずっと一方的だったと思わざるを得ません。そして、もちろん...",
      "title": "ユリウス・カエサルが戦場で圧倒的な強さを発揮した理由は何だと思われますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对高卢战役不怎么感兴趣，因为我属于那种对他在Commentarii de Bello Galo中的大部分内容表示怀疑的阵营。\n怀疑他在《高卢雄鸡评论》中提出的大部分内容。我已经看了两遍\n我已经看了两遍，我只是不由自主地认为，大多数的战斗\n都比他说的要片面得多。当然，还有...",
      "title": "你认为究竟是什么让凯撒大帝在战场上如此威武？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對高盧戰役不怎麼感興趣，因爲我屬於那種對他在Commentarii de Bello Galo中的大部分內容表示懷疑的陣營。\n懷疑他在《高盧雄雞評論》中提出的大部分內容。我已經看了兩遍\n我已經看了兩遍，我只是不由自主地認爲，大多數的戰鬥\n都比他說的要片面得多。當然，還有...",
      "title": "你認爲究竟是什麼讓凱撒大帝在戰場上如此威武？"
    }
  ]
}