{
  "author": "englishrestoration",
  "the_new_excerpt": "I was talking to a Vietnamese girl on OKcupid about the Vietnamese invasion of\nCambodia, and she explained how the Chinese had supported Pol Pot against\nVietnam. She said she really didn't like China for this reason because the\nVietnamese were only trying to prevent genocide in Cambodia, and the…",
  "original_created_utc": 1621156835,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OKcupidでベトナム人の女の子とベトナムのカンボジア侵攻について話していました。\n彼女は、中国がポル・ポトを支援してベトナムに対抗したことを説明してくれました。\nを支援していたことを説明してくれました。彼女は、この理由で中国が本当に嫌いになったと言っていました。\nベトナム人はカンボジアでの大量虐殺を防ごうとしていただけなのに、中国は...。",
      "title": "ポルポト政権は30万人の中国人カンボジア人を殺害し、中国から多大な資金援助を受けていました。鄧小平は、中国人を大量虐殺した政権を擁護してベトナムに侵攻したこともあった。なぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在OKcupid上和一个越南女孩谈起越南对柬埔寨的入侵。\n她解释说中国人是如何支持波尔布特对抗越南的。\n越南。她说，由于这个原因，她真的不喜欢中国，因为\n越南人只是想阻止柬埔寨的种族灭绝，而中国人则是想阻止柬埔寨的种族灭绝。",
      "title": "波尔布特政权杀害了30万中国柬埔寨人，并得到了中国广泛的财政支持。邓小平甚至一度入侵越南，为一个屠杀中国人的政权辩护。为什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在OKcupid上和一個越南女孩談起越南對柬埔寨的入侵。\n她解釋說中國人是如何支持波爾布特對抗越南的。\n越南。她說，由於這個原因，她真的不喜歡中國，因爲\n越南人只是想阻止柬埔寨的種族滅絕，而中國人則是想阻止柬埔寨的種族滅絕。",
      "title": "波爾布特政權殺害了30萬中國柬埔寨人，並得到了中國廣泛的財政支持。鄧小平甚至一度入侵越南，爲一個屠殺中國人的政權辯護。爲什麼？"
    }
  ],
  "title": "Pol Pot's regime killed 300k Chinese Cambodians and received extensive Chinese financial support. At one point Deng Xiaoping even invaded Vietnam in defense of a regime that genocided Chinese people. Why?",
  "created_utc": 1621191425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was talking to a Vietnamese girl on OKcupid about the Vietnamese invasion of Cambodia, and she explained how the Chinese had supported Pol Pot against Vietnam. She said she really didn&#39;t like China for this reason because the Vietnamese were only trying to prevent genocide in Cambodia, and the Chinese were apparently complicit in the Cambodian genocide. </p>\n\n<p>This is all apparently true but it&#39;s especially bizarre because the Khmer Rouge killed hundreds of thousands of Chinese Cambodians. Why didn&#39;t the Chinese stick up for their own people?</p>\n\n<p>It is especially odd because we very often accuse China of Han chauvinism, e.g. in Tibet or Xinjiang. But in this case China essentially went to war against its own people.</p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/AskHistorians/comments/ndkikh/pol_pots_regime_killed_300k_chinese_cambodians/",
  "subreddit": "AskHistorians",
  "id": "ndkikh",
  "is_self": true,
  "media": null,
  "is_video": false
}