{
  "author": "mic_droo",
  "original_created_utc": 1641746663,
  "title": "Yes, people can be \"too poor\" to invest in crypto",
  "created_utc": 1641764297,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;and it&amp;#39;s weird that I have to state this. But a few minutes ago one of these &amp;quot;3 posts and 50 comments a day exactly&amp;quot; moon farmers on here made a pseudo-wholesome post saying that nobody is too poor to buy crypto and &amp;quot;Crypto is for everyone regardless how poor or wealthy they are&amp;quot;. And of course you guys are upvoting this.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s garbage. &lt;a href=\"https://www.gapminder.org/answers/how-many-are-rich-and-how-many-are-poor/\"&gt;A billion people have less than 1 USD a day&lt;/a&gt;. Those that have a bit more than that are not exactly rich either. There are millions of homeless people around the world, many of which don&amp;#39;t have access to the internet to buy crypto - and none of which have money to do so. There are so, so many people in the world who cannot afford to buy enough food, pay rent, or other important commodities, and many more who can barely do so but have nothing left in their bank account at the end of the month. &lt;strong&gt;Those people are definitely too poor to buy crypto&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Sure, don&amp;#39;t get me wrong, if you get by and only have a few bucks each month to gamble away, you&amp;#39;re not too poor to buy crypto, you can just buy small amounts and it&amp;#39;s fine. But saying &amp;quot;Nobody is “too poor” to invest&amp;quot;, as one of the commenters did, is just arrogant - and blatantly wrong.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit: please stop telling me that this is also true for other investments. Of course it is. My point is that people like to pretend while this is true for other investments, the barrier is so low for crypto that it isn&amp;#39;t true for crypto. I&amp;#39;m not saying crypto is more exclusive than other investments, I&amp;#39;m saying it isn&amp;#39;t really more inclusive&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/rzvnqd/yes_people_can_be_too_poor_to_invest_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "rzvnqd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "and it's weird that I have to state this. But a few minutes ago one of these \"3\nposts and 50 comments a day exactly\" moon farmers on here made a\npseudo-wholesome post saying that nobody is too poor to buy crypto and \"Crypto\nis for everyone regardless how poor or wealthy they are\". And of course you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "と記載するのも変な話ですが。しかし、数分前、この「3」のうちの一人が\n1日50件のコメントと投稿を正確に行う」月見草が、次のような投稿をしました。\n暗号を買うのに貧しすぎる人はいない」「暗号を買うのに貧しすぎる人はいない」という擬似健全な投稿が\nは、貧乏人も裕福な人も関係なく、みんなのものです」。そしてもちろん、あなたは...",
      "title": "そう、人々は暗号に投資するには「貧しすぎる」ことがあるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "而且我必须说明这一点，这很奇怪。但几分钟前，这些 \"每天3个帖子和50条评论 \"的月光族中的一个。\n这里的一个 \"每天有3个帖子和50条评论 \"的月球农民发了一个\n伪健康的帖子说，没有人太穷而不能购买加密货币，\"加密货币是每个人的\n是为每个人服务的，无论他们有多穷或多富有\"。当然，你也...",
      "title": "是的，人们可能 \"太穷 \"而无法投资于加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而且我必須說明這一點，這很奇怪。但幾分鐘前，這些 \"每天3個帖子和50條評論 \"的月光族中的一個。\n這裏的一個 \"每天有3個帖子和50條評論 \"的月球農民發了一個\n僞健康的帖子說，沒有人太窮而不能購買加密貨幣，\"加密貨幣是每個人的\n是爲每個人服務的，無論他們有多窮或多富有\"。當然，你也...",
      "title": "是的，人們可能 \"太窮 \"而無法投資於加密貨幣"
    }
  ]
}