{
  "author": "Frostytoes99",
  "original_created_utc": 1648559940,
  "title": "Are any of you actually productive the entire 8 hours of your normal work day?",
  "created_utc": 1648592348,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve worked all sorts of jobs and aside from exclusively physical work where things were very busy on certain days, I find it incredibly hard to have any more than about 4 hours of really good productivity on average.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had very stressful weeks where I&amp;#39;m productive for 10ish hours but after 2 weeks of that I&amp;#39;m so incredibly burnt out I basically do nothing the next two weeks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/tqzkit/are_any_of_you_actually_productive_the_entire_8/",
  "subreddit": "NoStupidQuestions",
  "id": "tqzkit",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've worked all sorts of jobs and aside from exclusively physical work where\nthings were very busy on certain days, I find it incredibly hard to have any\nmore than about 4 hours of really good productivity on average.\n\nI've had very stressful weeks where I'm productive for 10ish hours but after…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はいろいろな仕事をしてきましたが、体力勝負の仕事ばかりを除けば\nある日突然忙しくなることがあります。\n平均して4時間以上、生産性が高いのです。\n\nストレスの多い週は、10時間くらいは生産性が高いのですが、その後は...。",
      "title": "皆さんの中で、通常の勤務時間である8時間を通して、実際に生産性の高い仕事をしている人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做过各种各样的工作，除了专门的体力工作外，在某些日子里事情非常繁忙。\n忙碌的工作之外，我发现很难有超过4个小时的真正意义上的休息时间。\n平均超过4小时的真正好的生产力。\n\n我曾有过压力很大的几周，我有10来个小时的生产力，但之后...",
      "title": "你们中是否有人在正常工作日的整个8小时内都有实际生产力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做過各種各樣的工作，除了專門的體力工作外，在某些日子裏事情非常繁忙。\n忙碌的工作之外，我發現很難有超過4個小時的真正意義上的休息時間。\n平均超過4小時的真正好的生產力。\n\n我曾有過壓力很大的幾周，我有10來個小時的生產力，但之後...",
      "title": "你們中是否有人在正常工作日的整個8小時內都有實際生產力？"
    }
  ]
}