{
  "author": "partymsl",
  "original_created_utc": 1649007136,
  "title": "The BTC-dominance rate is falling. This is something good for whole Crypto, showing that we don't just rely on one project.",
  "created_utc": 1649041151,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Bitcoin dominance rate describing, the BTC market cap in comparison to the other crypto market caps and how much BTC accounts for it, has been falling since last year and even during this dip it did not really recover but kept falling.&lt;/p&gt;\n\n&lt;p&gt;Even if some Bitcoin-maxis may find this annoying, it is actually very good for Crypto as a whole. As it shows that competition and diversity has arrived in the Crypto market. Also it shows that Crypto is not just Bitcoin, it&amp;#39;s a lot of other awesome projects too.&lt;/p&gt;\n\n&lt;p&gt;Every successful market needs a ton of products. We can&amp;#39;t always rely on one. But obviously BTC is and will always remain the godfather of Crypto but good development would show even better products coming.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/tvepaa/the_btcdominance_rate_is_falling_this_is/",
  "subreddit": "CryptoCurrency",
  "id": "tvepaa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Bitcoin dominance rate describing, the BTC market cap in comparison to the other\ncrypto market caps and how much BTC accounts for it, has been falling since last\nyear and even during this dip it did not really recover but kept falling.\n\nEven if some Bitcoin-maxis may find this annoying, it is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインの支配率について説明すると、BTCの時価総額が他と比較して\n暗号の時価総額とその中でBTCが占める割合は、昨年から下がり続けています。\nそして、この落ち込みの間にも、回復することなく下がり続けている。\n\nビットコインマキシの中には、これを迷惑に思う人もいるかもしれないが、それは...。",
      "title": "BTCの優位性が低下している。これはCrypto全体にとって良いことで、1つのプロジェクトだけに頼っているわけではないことを表しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币主导率描述，BTC的市值与其他国家相比\n比特币市值与其他加密货币市值的对比，以及比特币在其中所占的比重，自去年以来一直在下降。\n甚至在这次下跌中，它也没有真正恢复，而是继续下跌。\n\n即使一些比特币大户可能觉得这很烦人，但这是...",
      "title": "BTC的主导率正在下降。这对整个加密货币来说是件好事，表明我们不只是依赖一个项目。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣主導率描述，BTC的市值與其他國家相比\n比特幣市值與其他加密貨幣市值的對比，以及比特幣在其中所佔的比重，自去年以來一直在下降。\n甚至在這次下跌中，它也沒有真正恢復，而是繼續下跌。\n\n即使一些比特幣大戶可能覺得這很煩人，但這是...",
      "title": "BTC的主導率正在下降。這對整個加密貨幣來說是件好事，表明我們不只是依賴一個項目。"
    }
  ]
}