{
  "author": "AskScienceModerator",
  "original_created_utc": 1652871616,
  "title": "AskScience AMA Series: We're the team behind CAPSTONE, the spacecraft testing the orbit for NASA's future lunar space station! Ask us anything!",
  "created_utc": 1652891748,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before NASA&amp;#39;s &lt;a href=\"https://www.nasa.gov/specials/artemis/\"&gt;Artemis&lt;/a&gt; astronauts head to the Moon, a microwave oven-size spacecraft will help lead the way. The Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment, or &lt;a href=\"https://www.nasa.gov/directorates/spacetech/small_spacecraft/capstone/\"&gt;CAPSTONE&lt;/a&gt;, is a CubeSat mission launching no earlier than May 31, 2022. For at least six months, the small spacecraft will fly a unique elongated path around the Moon. Its trajectory - known as a near rectilinear halo orbit - has never been flown before! After it&amp;#39;s tried and tested by CAPSTONE, the same orbit will also be home to NASA&amp;#39;s future lunar space station &lt;a href=\"https://www.nasa.gov/gateway\"&gt;Gateway&lt;/a&gt;. CAPSTONE&amp;#39;s flight will provide valuable data about this orbit that could support future missions to the Moon and beyond, helping to launch a new era of human space exploration. Commercial partner Rocket Lab will launch CAPSTONE, and small business partner Advanced Space will operate the mission.&lt;/p&gt;\n\n&lt;p&gt;We are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Elwood Agasid, NASA CAPSTONE lead at NASA&amp;#39;s Ames Research Center&lt;/li&gt;\n&lt;li&gt;Justin Treptow, Small Spacecraft Technology program deputy executive at NASA Headquarters&lt;/li&gt;\n&lt;li&gt;Ali Guarneros Luna, aerospace and system engineer at NASA&amp;#39;s Ames Research Center&lt;/li&gt;\n&lt;li&gt;Nujoud Merancy, Exploration Mission Planning Office chief at NASA&amp;#39;s Johnson Space Center&lt;/li&gt;\n&lt;li&gt;Michael Thompson, CAPSTONE orbit determination lead at Advanced Space&lt;/li&gt;\n&lt;li&gt;Alec Forsman, CAPSTONE lead systems engineer at Advanced Space&lt;/li&gt;\n&lt;li&gt;Ethan Kayser, CAPSTONE mission design lead at Advanced Space&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Ask us anything about:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;What makes CAPSTONE&amp;#39;s orbit unique&lt;/li&gt;\n&lt;li&gt;How spacecraft like CAPSTONE help demonstrate and test technologies for future missions&lt;/li&gt;\n&lt;li&gt;What the CAPSTONE mission timeline looks like&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;We&amp;#39;ll be online to answer questions on Wednesday, May 18 from 1:00-2:30 pm PT (4:00-5:30 pm ET, 8:00-9:30 pm UTC) and will sign our answers. See you then!&lt;/p&gt;\n\n&lt;p&gt;PROOF: &lt;a href=\"https://twitter.com/NASAAmes/status/1526246040671858689\"&gt;https://twitter.com/NASAAmes/status/1526246040671858689&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/nasa\"&gt;/u/nasa&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askscience/comments/usa7yp/askscience_ama_series_were_the_team_behind/",
  "subreddit": "askscience",
  "id": "usa7yp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Before NASA's Artemis [https://www.nasa.gov/specials/artemis/] astronauts head\nto the Moon, a microwave oven-size spacecraft will help lead the way. The\nCislunar Autonomous Positioning System Technology Operations and Navigation\nExperiment, or…"
}