{
  "author": "Elie0_0",
  "original_created_utc": 1649711321,
  "title": "Experts say Bitcoin will hit $100k by 2021.",
  "created_utc": 1649735452,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;By experts, of course I mean the members of this subreddit. &lt;/p&gt;\n\n&lt;p&gt;Now that we know for sure when it will hit $100k, it&amp;#39;s time to take out a loan whilst being unemployed and FOMO it all into Bitcoin. Not only that, but let&amp;#39;s talk to everyone we know and convince them to FOMO all their money in Bitcoin. What could go wrong, we have the word of experts. &lt;/p&gt;\n\n&lt;p&gt;Honestly though, I&amp;#39;m already seeing articles about how Bitcoin will hit $100k by the end of 2022 and it feels like the same thing again that happened last year, namely, people expecting crazy gains because Bitcoin has moved up like 5%. &lt;/p&gt;\n\n&lt;p&gt;And this again will cause people invest in Bitcoin and expect to be rich by the end of the year, which is very unlikely, so they&amp;#39;ll definitely be disappointed. I would say that we shouldn&amp;#39;t really care how much Bitcoin will be this week, this month, or even this year. Why look at short term? Not like short term works with Bitcoin, because it&amp;#39;s become a little stable compared to alts, and even they&amp;#39;re not as volatile anymore to get you a lot of profits short term. &lt;/p&gt;\n\n&lt;p&gt;Bitcoin won&amp;#39;t get you rich Short term, it&amp;#39;s best to have patience and invest and wait. No, Waiting doesn&amp;#39;t mean checking the charts every second of the day, simply DCA if you already do or forget about your investment. Patience does pay off.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/u1hoqe/experts_say_bitcoin_will_hit_100k_by_2021/",
  "subreddit": "CryptoCurrency",
  "id": "u1hoqe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "By experts, of course I mean the members of this subreddit.\n\nNow that we know for sure when it will hit $100k, it's time to take out a loan\nwhilst being unemployed and FOMO it all into Bitcoin. Not only that, but let's\ntalk to everyone we know and convince them to FOMO all their money in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "専門家というのは、もちろんこのサブレディットのメンバーのことです。\n\nいつ10万ドルになるのかがはっきりした今、ローンを組む時です。\n失業中にFOMOで全部Bitcoinにしちゃいましょう。それだけでなく\n知り合いに声をかけて、全財産をFOMOにするように説得して...。",
      "title": "専門家によると、ビットコインは2021年までに10万ドルに達すると言われています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的专家，当然是指这个分论坛的成员。\n\n现在我们已经确定了它将在什么时候达到10万美元，现在是时候贷款了\n是时候在失业的情况下贷款，并将其全部转化为比特币。不仅如此，我们还应该\n和我们认识的所有人谈谈，说服他们把所有的钱都FOMO到...",
      "title": "专家说，比特币将在2021年达到10万美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的專家，當然是指這個分論壇的成員。\n\n現在我們已經確定了它將在什麼時候達到10萬美元，現在是時候貸款了\n是時候在失業的情況下貸款，並將其全部轉化爲比特幣。不僅如此，我們還應該\n和我們認識的所有人談談，說服他們把所有的錢都FOMO到...",
      "title": "專家說，比特幣將在2021年達到10萬美元。"
    }
  ]
}