{
  "author": "NineteenSixtySix",
  "the_new_excerpt": "https://www.morningstar.com/articles/1039009/palantir-proves-solutions-are-resonating-growth-ahead\n\nPalantir Proves Solutions Are Resonating, Growth Ahead\n\nWe are raising our fair value estimate for the narrow-moat company.\n\nWe are raising our fair value estimate for narrow-moat Palantir…",
  "original_created_utc": 1620832581,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.morningstar.com/articles/1039009/palantir-proves-solutions-are-resonating-growth-ahead\n\nパランティアはソリューションが反響を呼んでいることを証明し、今後の成長につなげる\n\n狭義の会社の公正価値予想を引き上げています。\n\n狭義のPalantir社の公正価値推定値を引き上げています...",
      "title": "モーニングスター社がPalantir社を「Buy」にアップグレード、目標株価を25ドルに設定"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.morningstar.com/articles/1039009/palantir-proves-solutions-are-resonating-growth-ahead\n\n帕兰提尔证明解决方案引起共鸣，未来将出现增长\n\n我们提高了对这家狭小的公司的公平价值评估。\n\n我们正在提高我们对狭义的Palantir公司的公允价值估计...",
      "title": "晨星公司将Palantir升级为买入，目标价为25美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.morningstar.com/articles/1039009/palantir-proves-solutions-are-resonating-growth-ahead\n\n帕蘭提爾證明解決方案引起共鳴，未來將出現增長\n\n我們提高了對這家狹小的公司的公平價值評估。\n\n我們正在提高我們對狹義的Palantir公司的公允價值估計...",
      "title": "晨星公司將Palantir升級爲買入，目標價爲25美元"
    }
  ],
  "title": "Morningstar upgrades Palantir to Buy with price-target of $25",
  "created_utc": 1620845162,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.morningstar.com/articles/1039009/palantir-proves-solutions-are-resonating-growth-ahead\">https://www.morningstar.com/articles/1039009/palantir-proves-solutions-are-resonating-growth-ahead</a></p>\n\n<p>Palantir Proves Solutions Are Resonating, Growth Ahead</p>\n\n<p>We are raising our fair value estimate for the narrow-moat company.</p>\n\n<p>We are raising our fair value estimate for narrow-moat Palantir Technologies (PLTR) to $25 from $24 after its first-quarter results left us more bullish about its long-term prospects. While we do not expect GAAP profitability for years, we believe Palantir is prudently investing in ramping up its business to land a wider breadth of organizations from various industries, sizes, and geographic locations. Palantir constitutes a minuscule amount of overall U.S. defense spending and has an embryonic commercial customer base; however, once Palantir’s solutions are installed, we believe organizations can become reliant on its products. With shares trading around $19 in intraday trading, we believe investors have upside to capture in this disruptor.</p>\n\n<p>Palantir’s revenue growth of 49% year over year topped our already aggressive expectations, thanks to resounding results in the government vertical and strong broad-based expansion within the U.S. Government revenue was the bright spot, growing 76% year over year. U.S. government business grew by 83%, led by defense and pandemic-related use cases. We do not believe Palantir’s non-defense government segment will fizzle out after businesses reopen, as we think the company is proving its software capabilities during a time of crisis, which can open the door and lead to proliferation across other government entities working to harness their data.</p>\n\n<p>Commercial sales rose 19% and were impacted by certain geography lockdowns, although U.S.-based commercial growth increased 72% year over year. With Palantir’s push to modularize its offerings and expand its sales reach, commercial opportunities within the U.S. and U.K. increased by 2.5 times and commercial pilots more than doubled since February. Alongside the strong top-line results and expectations of continued strength ahead, Palantir also posted 34% adjusted operating margin (up 200 basis points sequentially) and 44% adjusted free cash flow margin.</p>\n</div><!-- SC_ON -->",
  "score": 90,
  "permalink": "/r/stocks/comments/nar4ow/morningstar_upgrades_palantir_to_buy_with/",
  "subreddit": "stocks",
  "id": "nar4ow",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996884
}