{
  "author": "_DeanRiding",
  "original_created_utc": 1634048410,
  "title": "What would happen if we removed too much CO2 from the atmosphere? How much would be too much?",
  "created_utc": 1634067027,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earth is a very fragile ecosystem and everything is about balance. One relatively minor event (on a planetary scale) can drastically alter our climate for countless years. We&#39;re starting to see this with global warming.</p>\n\n<p>Carbon capture is currently possible, however at the moment it&#39;s prohibitively expensive and not used very much. What would happen if we were started being carbon negative? Would we see an initial reversal in climate change to where we were pre-industrial revolution? What would happen if we kept going after that though? Would we have a slow global cooling?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/askscience/comments/q6n8y2/what_would_happen_if_we_removed_too_much_co2_from/",
  "subreddit": "askscience",
  "id": "q6n8y2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Earth is a very fragile ecosystem and everything is about balance. One\nrelatively minor event (on a planetary scale) can drastically alter our climate\nfor countless years. We're starting to see this with global warming.\n\nCarbon capture is currently possible, however at the moment it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "地球は非常に脆弱な生態系であり、すべてはバランスが重要です。ある\n惑星規模の比較的小さな出来事が、数年に渡って私たちの気候を大きく変えてしまうことがあります。\n数え切れないほどの年月をかけて気候を大きく変えることができます。地球温暖化がそれを物語っています。\n\n現在、二酸化炭素の回収は可能ですが、現時点では...",
      "title": "大気中のCO2を除去しすぎるとどうなるのでしょうか？どのくらいの量が多すぎるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "地球是一个非常脆弱的生态系统，一切都要讲究平衡。一个\n一个相对较小的事件（在地球范围内）可以极大地改变我们的气候\n无数年。我们已经开始看到全球变暖的情况。\n\n目前，碳捕捉是可能的，然而，目前它是...",
      "title": "如果我们从大气中清除过多的二氧化碳，会发生什么？多少才算过量？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "地球是一個非常脆弱的生態系統，一切都要講究平衡。一個\n一個相對較小的事件（在地球範圍內）可以極大地改變我們的氣候\n無數年。我們已經開始看到全球變暖的情況。\n\n目前，碳捕捉是可能的，然而，目前它是...",
      "title": "如果我們從大氣中清除過多的二氧化碳，會發生什麼？多少纔算過量？"
    }
  ]
}