{
  "author": "bitbuggs",
  "the_new_excerpt": "First and foremost, I am not a financial advisor. Do what you want with your\nmoney, I couldn't care less. I look at facts and base predictions around those\nfacts. If you see flaws in my logic, feel free to comment, I always am looking\nfor different perspectives that I may have not thought of. At the…",
  "original_created_utc": 1610331977,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我不是财务顾问。你可以随心所欲地使用你的\n钱，我一点也不在乎。我看着事实和围绕这些的基本预测\n事实。如果你看到我逻辑上的缺陷，请随意评论，我一直在找\n我可能没有想过的不同观点。在…",
      "title": "比特币牛市被碾压？不，才刚刚开始！！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我不是財務顧問。你可以隨心所欲地使用你的\n錢，我一點也不在乎。我看着事實和圍繞這些的基本預測\n事實。如果你看到我邏輯上的缺陷，請隨意評論，我一直在找\n我可能沒有想過的不同觀點。在…",
      "title": "比特幣牛市被碾壓？不，纔剛剛開始！！"
    }
  ],
  "title": "Bitcoin Bull run Over? NO, It's just starting!!",
  "created_utc": 1610389398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First and foremost, I am not a financial advisor. Do what you want with your money, I couldn&#39;t care less. I look at facts and base predictions around those facts. If you see flaws in my logic, feel free to comment, I always am looking for different perspectives that I may have not thought of. At the end of the day, you proving me wrong is ultimately going to save me money.  </p>\n\n<p>I am hearing a lot of talk from people believing that this bull run is coming to an end. From my experience in the traditional and crypto markets I do not find that to be the case. Here are the reasons that I believe that bitcoin (and altcoins) are just getting started. </p>\n\n<p>1.) <strong>Liquidity = Gains:</strong> There has been a lot of liquidity being added both into the traditional and crypto markets over the last few months. From federal stimulus to Tether printing more USDT, both are creating massive amounts of liquidly to the market. With Biden expecting to push a multi-trillion dollar <a href=\"https://www.washingtonpost.com/us-policy/2021/01/08/biden-stimulus-plan/\">Stimulus plan</a>, this will only continue to push asset prices up. Also, with USDT continuing to print more tether, I do not see this stopping any time soon even with the the NY attorney General down there throats. Court cases are long and drawn out. Even after they receive all documents they requested, it is highly unlikely that Tether will be deemed a security that same day. I am no attorney or law expert, so correct me if I am wrong, but I believe this process could take at least a few more months before tether is deemed a security. During this waiting period I believe tether will operate as usual and keep on printing USDT before they get the hammer. </p>\n\n<p>2.) <strong>US Inflation and currency debasement:</strong> Those who believe that inflation is currently happening are wrong. Inflation has not even started yet. The <a href=\"https://usinflationcalculator.com/inflation/current-inflation-rates/#:%7E:text=The%20annual%20inflation%20rate%20for,at%208%3A30%20a.m.%20ET\">Inflation Rate</a> for the 12 month year ending in November 2020 was only 1.2%. Considering that the feds previous goal was to keep the inflation rate at 2% and we were below that even after printing trillions into existence is astonishing. I believe that the reasoning for this is most likely because not enough people are spending their stimulus money on goods or services. All this money is going to assets which is causing asset prices to increase and keeping inflation low. Inflation occurs when volatility of money increases which in turns increases the CPI (inflation of goods and services). Currently there is a lot of pent up demand for people to go out and start spending money again on goods and services. I do not expect this to start happening until the spring and until then I expect Biden to push for as much stimulus as possible. Once the U.S. starts lightening up on their COVID restrictions, all that free money that was printed will be spent in the real economy. This will shoot up the volatility of money, causing inflation to rise faster than expected, making the dollar go down in value faster than expected. I do not think this will lead to hyper inflation but I do believe this will cause many people to push more money into assets pushing stocks, real estate and crypto even higher. </p>\n\n<p>3.) <strong>Low interest rates and zero reserve requirements</strong>: Currently interest rates are at zero and that incentivizes people to take out loans. With every loan that is created, that is more money hitting the real economy which in-turn leads to more inflation. Majority of the money that is created comes from bank loans. Even if Biden&#39;s stimulus plans get rejected, zero interest rates will be enough of a catalyst for inflation to start to rise as restrictions ease up. In addition, I expect more loans to be provided in years past because the Feds also lowered the reserve requirements to 0%. This means that a bank needs to hold NO MONEY in reserves for them to create a loan. Historically reserve requirements were around 10%, but now with them being zero, we can expect inflation from loans to be a lot higher than normal because banks are no longer required to withhold money from society. </p>\n\n<p>4.) <strong>Bitcoin cycles:</strong> Bitcoin is programmed to move in 4 year cycles that is centered around the havening event. These cycles usually consist of 2 years of a bull market after the havening and 2 years of a bear market after the  supply shock of bitcoin is realized. Currently there is much demand for bitcoin and sentiment is high, but not at its peak. Personally, I think we just passed the &quot;Hope&quot; stage of the &quot;wall street cheat sheet&quot;. There are still countless skeptics expecting bitcoin to crash and fail. Bitcoin is officially here to stay. Hedge funds, and financial institutions would not be paying billions to create bitcoin products if they believed this was still a fad. The baby boomers are still thinking that bitcoin has no intrinsic value as they don&#39;t understand the value of being able to move billions of dollars in a matter of minutes to anyone in the world without a central authority. Once we see these skeptics finally &quot;understand&quot; why bitcoin is valuable, I will be looking for this cycle to end.</p>\n\n<p>&#x200B;</p>\n\n<p>I Understand that bitcoin has already went from $3,500 - 40k in only a few months and it is obvious that a correction is coming. But understand that the incoming dip will be short term and I am expecting to see a 6 figure bitcoin before the end of this cycle. </p>\n\n<p>Again, all this is what I believe what will happen based off what I see, but DYOR. I do not have a crystal ball, no one does. All I know are the facts I listed above and everything else is my personal opinion. Good luck and go make gains.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/9gPPGTpQwKMgy51fcRrbDx6X098VeuQ4-innhOXn6b0.jpg?auto=webp&s=ed520a38e87e981d3173445135e10b44fdd58cee",
          "width": 1440,
          "height": 810
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/9gPPGTpQwKMgy51fcRrbDx6X098VeuQ4-innhOXn6b0.jpg?width=108&crop=smart&auto=webp&s=7bc49db828cd5221c2d96f4f11fe1384931a7933",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/9gPPGTpQwKMgy51fcRrbDx6X098VeuQ4-innhOXn6b0.jpg?width=216&crop=smart&auto=webp&s=7f3fd4c79a46fe88368f9f383c6ec9c9e08caa7e",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/9gPPGTpQwKMgy51fcRrbDx6X098VeuQ4-innhOXn6b0.jpg?width=320&crop=smart&auto=webp&s=387d1c4866312b6354f5502dbb1d515bbaefedc7",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/9gPPGTpQwKMgy51fcRrbDx6X098VeuQ4-innhOXn6b0.jpg?width=640&crop=smart&auto=webp&s=4e3ea0893f5856b430f865a54066a8d92b270725",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/9gPPGTpQwKMgy51fcRrbDx6X098VeuQ4-innhOXn6b0.jpg?width=960&crop=smart&auto=webp&s=bb53369c90bd466da7ab0ff3e80e7dfa50b06b44",
            "width": 960,
            "height": 540
          },
          {
            "url": "https://external-preview.redd.it/9gPPGTpQwKMgy51fcRrbDx6X098VeuQ4-innhOXn6b0.jpg?width=1080&crop=smart&auto=webp&s=98c84ad578927a23c1bd6d66b83921b2421e7644",
            "width": 1080,
            "height": 607
          }
        ],
        "variants": {},
        "id": "x887rKlPD_3BSFRtKFWXDR-jwSzo7W0E3w1ItkygIOY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/kut3tr/bitcoin_bull_run_over_no_its_just_starting/",
  "subreddit": "Bitcoin",
  "id": "kut3tr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706371564
}