{
  "author": "blackswanonthelake",
  "original_created_utc": 1631012328,
  "title": "I am pregnant and my boyfriend and his mother are harrasing me. What to do?",
  "created_utc": 1631026523,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know he only dated me for sex. I was very experienced and he was raised in a conservative family. His mother is a scientist and the father an engineer. This guy is also working in nuclear field and is highly respected. He is 26 and already has a well paying job. Anyway, he was career focused and only wanted someone to bang. He never said it like this, but I knew it. He has always been mommas good boy, good looking, well mannered and to be honest girls liked him a lot. We started sleeping togheter last year. I am 21 and work at the local supermarket. ( I need to say this because I want to make sure why I feel weak comparing to them)</p>\n\n<p>Anyway I got pregnant and he became almost hysterical that his mother will kill him. I thought he is so childish but somehow I thought the problem was simply that he was not ready for this. But... he told his best friend his problem was me. He did not want his mother to know he fathered a child with a whore ( and here I will quote) that was used more than google. I decided to simply told him to f... off and give birth to my baby. I am not very concerned. I know I will be a good mother and I will love him( I already know it is a boy) But his mother found out and called me. He gave her my number and she called me a hoe for seducing her son. Nothing was his fault, only mine and she somehow forbid him to talk to me anymore and she is going to take over. Her request is that after I give birth I MUST give the baby to her and dissapear. She offered me money. I will not that this. I love my baby. I tried to call him and beg him to make her leave me alone but he blocked my number and though a friend told me he is very sorry but he cannot say anything to his mom. Now, I have no one. My mom doesnt care about me and my father is ill. I have nothing and no one. My question is... can they actually take my baby from me? It would be illegal, no? </p>\n\n<p>I know where he works. It is a well secured plant because of the field, but I could try. Would it be worth it?</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/pjksbn/i_am_pregnant_and_my_boyfriend_and_his_mother_are/",
  "subreddit": "NoStupidQuestions",
  "id": "pjksbn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know he only dated me for sex. I was very experienced and he was raised in a\nconservative family. His mother is a scientist and the father an engineer. This\nguy is also working in nuclear field and is highly respected. He is 26 and\nalready has a well paying job. Anyway, he was career focused and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼がセックスのためだけに私と付き合っていたことは知っています。私は経験豊富で、彼は保守的な家庭で育ったので\n保守的な家庭で育ちました。母親は科学者で、父親はエンジニア。この\nこの人も原子力関係の仕事をしていて、とても尊敬されています。彼は26歳で\n彼は26歳で、すでに高給取りの仕事をしています。とにかくキャリアを重視していて・・・。",
      "title": "妊娠しているのに、彼氏とその母親から嫌がらせを受けています。どうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道他与我约会只是为了性。我很有经验，而他是在一个\n保守的家庭。他的母亲是一名科学家，父亲是一名工程师。这个人\n这家伙也在核领域工作，而且非常受人尊敬。他今年26岁，\n已经有了一份收入不错的工作。总之，他是以事业为重，...",
      "title": "我怀孕了，我的男朋友和他的母亲在骚扰我。该怎么做呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道他與我約會只是爲了性。我很有經驗，而他是在一個\n保守的家庭。他的母親是一名科學家，父親是一名工程師。這個人\n這傢伙也在覈領域工作，而且非常受人尊敬。他今年26歲，\n已經有了一份收入不錯的工作。總之，他是以事業爲重，...",
      "title": "我懷孕了，我的男朋友和他的母親在騷擾我。該怎麼做呢？"
    }
  ]
}