{
  "author": "misium500",
  "the_new_excerpt": "Well, as I predicted, they kept the price over $50 so that the stack of 10,000\n(yes, ten thousand options) Put contracts didn't get executed. That tells me\nthat they aren't just tanking the price, and that they are playing the options\nspread at the moment.\n\nIt also tells me that they are scared…",
  "original_created_utc": 1613247971,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，正如我所预料的那样，他们把价格控制在50元以上，这样一叠10000元的价格就可以了。\n(是的，一万份期权)认沽合约没有被执行。这说明\n他们不仅仅是在压价，他们还在玩期权\n传播在当下。\n\n这也告诉我，他们害怕...",
      "title": "即将到来的第2/19周Geee Em Eeee ITM期权目标。玩弄市场... 第二部分..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，正如我所預料的那樣，他們把價格控制在50元以上，這樣一疊10000元的價格就可以了。\n(是的，一萬份期權)認沽合約沒有被執行。這說明\n他們不僅僅是在壓價，他們還在玩期權\n傳播在當下。\n\n這也告訴我，他們害怕...",
      "title": "即將到來的第2/19周Geee Em Eeee ITM期權目標。玩弄市場... 第二部分..."
    }
  ],
  "title": "Upcoming Week 2/19 Geee Em Eeee ITM Options Targets: Playing The Market Fuckery... Pt. 2...",
  "created_utc": 1613260136,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well, as I predicted, they kept the price over $50 so that the stack of 10,000 (yes, ten thousand options) Put contracts didn&#39;t get executed. That tells me that they aren&#39;t just tanking the price, and that they are playing the options spread at the moment.</p>\n\n<p>It also tells me that they are scared shitless of shares needing to be delivered and taken off of the open market. They&#39;d rather keep the price boosted over $50 to stop delivery than to risk an extra 1,000,000 shares getting into long hands.</p>\n\n<p>But, thankfully, that also let&#39;s us know that they&#39;re still playing the game. If they were giving up and going into all-or-nothing mode, they wouldn&#39;t give a shit about the deliveries. They&#39;d either flood the market with 25,000,000 FTDs while tanking the price to cover at $20 while hoping they have enough left over for the fines... Or they&#39;d cash out what they have left now and file for bankruptcy while leaving the clearing houses to pay the bad debt.</p>\n\n<p>No, they&#39;re still planning on finding the cheapest way out of this without any (or minimal) legal trouble. That means we&#39;re still getting paid. (Eventually...)</p>\n\n<p>I&#39;ve been watching this for a while now, and I think I&#39;ve gotten a hand on what they are doing. This coming week will be the tell-all... And I&#39;m going to explain why I believe the price can only go up...</p>\n\n<p>So. Let&#39;s crunch the 2/19 option chain and see where this train is headed... - This Week, oooon Gaaaaaame Theeeeory!... <em>queue intro music</em>...</p>\n\n<p>Current price $52:</p>\n\n<p>Put ITM: 59,434</p>\n\n<p>Put OTM: 346,288</p>\n\n<p>Call ITM: 29,930</p>\n\n<p>Call OTM: 87,111</p>\n\n<p>At Current Price, a total of 89,364 option contracts are ITM.</p>\n\n<p>Now, let&#39;s look at possible price movement. See, they are keeping Gee em eee at the line of demarcation between the single-dollar price change contracts ($41-$42-$43-et al.)... And the five-dollar price change per contract ($50-$55-$60-et al.)</p>\n\n<p>That means that for every dollar that the stock drops, it executes a new Put option contract... But it would need to climb five dollars to execute a new call option. That&#39;s why I told you in the last thread that they are playing between the $50-$54.99 range all week.</p>\n\n<p>See, because of the contract price structuring, it actually costs them MORE to knock the price down any lower. Allow me to explain:</p>\n\n<p>Lets look at both the Call and Put sides of the option chain... And for the nearest $10 swing in prices...</p>\n\n<p>There are 29,337 Put Options for $40-$50 strike.</p>\n\n<p>There are 2,459 Put Options for $51-$59 strike.</p>\n\n<p>There are 13,187 Call Options for $40-$50 strike.</p>\n\n<p>There are 3,066 Call Options for $51-$59 strike.</p>\n\n<p>Now, lemme explain why I believe this matters in predicting where the price is going to drift this week.</p>\n\n<p>If the price were to drop by $10, the net difference would be an ADDITIONAL 16,150 options that would be executed because of the contract price structuring. 10 Put Options would become in the money.</p>\n\n<p>Conversely, if the price went UP by $9, the net difference would be 507 extra contracts that would be able to be executed. Because of the price structuring, only two new Call Option strikes would be able to be executed between $55-$59.</p>\n\n<p>If we were to just look at the next five Put Option contracts below the current strike price, it equals up to 22,175. That means if the price were to DROP $5, they would need to find delivery for an EXTRA 2,217,500 shares.</p>\n\n<p>If the price were to go UP by $5, they would only need to find 85,600 extra shares to cover the extra contracts that would be ITM at $55.</p>\n\n<p>Let me say that again. If the price goes DOWN... It takes MORE shares off the market because of the Put Options going in dollar increments, while the Call Options go up in $5 increments.</p>\n\n<p>It is also interesting to note that ending the week at $59 would cause less deliveries than ending at $55.</p>\n\n<p>My hypothesis: They can&#39;t hold the price at $50 this upcoming week simply due to the lack of shares available and the buyer demand staying so consistent. We only had 12mil-13mil volume the last two days. The shares are drying up.</p>\n\n<p>So if they can&#39;t hold the price steady, they need to decide which direction to move it. And based on the math, moving the price UP would save the shorts money by causing the lesser of two evils in extra deliveries.</p>\n\n<p>But one thing is for sure. They can&#39;t let the price tank any lower this upcoming week. It would trigger too many new deliveries.</p>\n\n<p>(There&#39;s actually some serious game theory that says the best move to trigger the squeeze would be for us to ALLOW the price to drop to exactly $39.99 at close of next week... as odd as that seems)</p>\n\n<p>So what&#39;s my non-financially-advising-crystal-ball predict that this weeks close will be on 2/19?...</p>\n\n<p>$58.47...</p>\n\n<p>They are going to allow some big single-day swings Tuesday and Wednesday to send the stock price from $52 up to tickle the $60 mark so that they can go balls-deep selling $60C Premium... And then they will hold the price just below the line.</p>\n\n<p>The next target after that would be $69 (giggity), as there is a large off-set of Calls vs Puts at $70 that would cause the delivery equilibrium to start going net positive again. I just don&#39;t think they&#39;re going to let us get $19 in a single week, as that would cause retail investor interest to start going up again.</p>\n\n<p>Tl;dr: We end next week at $58-$59 and the slow bleeding continues until the week of Feb 26.</p>\n\n<p>I&#39;ll be back when I finish another model I&#39;m working on...</p>\n\n<p>orgininally posted by u / ThatGuyOntheReddits</p>\n</div><!-- SC_ON -->",
  "score": 4204,
  "permalink": "/r/wallstreetbets/comments/lj8gh1/upcoming_week_219_geee_em_eeee_itm_options/",
  "subreddit": "wallstreetbets",
  "id": "lj8gh1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728630591
}