{
  "author": "psychotrader00",
  "the_new_excerpt": "After a steep pullback in the last couple of weeks, stocks roared back Tuesday,\nwith the tech-heavy Nasdaq recording its best day since April 2020. The move\nmarked a stark reversal after the index sank into a correction by the close of\nMonday's session, plunging a total of more than 10% from a…",
  "original_created_utc": 1615324875,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在经历了过去几周的大幅回调后，周二股市轰然回升。\n与科技重镇纳斯达克录得2020年4月以来最好的一天。此举\n标志着该指数在收盘前陷入修正后的大幅逆转。\n周一盘中，共暴跌超过10%，从...",
      "title": "以下是2021年3月9日（星期二）今天的市场回顾。请大家欣赏!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在經歷了過去幾周的大幅回調後，週二股市轟然回升。\n與科技重鎮納斯達克錄得2020年4月以來最好的一天。此舉\n標誌着該指數在收盤前陷入修正後的大幅逆轉。\n週一盤中，共暴跌超過10%，從...",
      "title": "以下是2021年3月9日（星期二）今天的市場回顧。請大家欣賞!"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, March 9, 2021. Please enjoy!",
  "created_utc": 1615332901,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After a steep pullback in the last couple of weeks, stocks roared back Tuesday, with the tech-heavy Nasdaq recording its best day since April 2020. The move marked a stark reversal after the index sank into a correction by the close of Monday&#39;s session, plunging a total of more than 10% from a recent record closing high. Goes to show how volatile the market can be. The S&amp;P 500 (SPY) closed 1.42% higher and the Dow Jones (DIA) closed 0.10% up.</p>\n\n<p>The sharp contrast between the performance of the Dow and the Nasdaq in recent weeks underscores market participant’s increasing rotation out of high-flying tech stocks that led the markets higher in 2020 into stocks that are poised to directly benefit from the impending economic reopening. </p>\n\n<p>The Treasury yield pulled back a little but remains at elevated levels, which was pressuring equity markets, particularly tech stocks, in recent weeks. . Rising interest rates hurt high-growth stocks the most because high-growth companies generate most of their cash and earnings years down the road. Future cash decreases in today&#39;s dollars as rates increase partly because investors have more opportunity to earn bigger returns from assets paying higher interest and dividends right now. </p>\n\n<p>Courtney Dominguez, Payne Capital Management Senior Wealth Advisor said, “This is a trend that tends to happen as we get out of a recession: You tend to see stocks move towards cyclical. So things like value companies or small caps, things like energy, tend to do really well when you’re coming out of a recession. And what happened last year is, those tech companies were really doing so well that their prices were getting extremely high. I don’t think these companies are going away. I think a lot of these are going to be things that we continue to have in our workplaces going forward. But the question is, are these companies so expensive, is all the optimism already priced in?”</p>\n\n<p>Over the weekend, the Senate approved the $1.9 trillion stimulus package. The bill, which includes $300 per week in enhanced federal unemployment benefits through early September, $350 billion in state and local aid and $1,400 stimulus checks to Americans who qualify is set for a vote in the House of Representatives tomorrow before being sent to President Biden’s for signature. The bill is likely to pass before the March 14 deadline where enhanced federal unemployment benefits expire. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Shares of Gamestop (GME) performed strongly again today, rising around 25% at the time of writing.</li>\n<li>Roblox is set to go public tomorrow via direct listing, ticker will be RBLX. Unlike a traditional IPO the company isn’t raising new capital via the offering, instead holders are selling stock they already own.</li>\n<li>Walt Disney Co.&#39;s flagship streaming service, Disney+, has surpassed 100 million subscribers in its first 16 months of operation, the company announced today.</li>\n<li>After cratering in value in recent weeks, EV stocks like NIO and Tesla (TSLA) came roaring back today! It was Tesla’s best day since 2013, up around 19% at the time of writing</li>\n<li>Twitter (TWTR) and Square (SQ) boss Jack Dorsey said on Tuesday he will convert proceeds from the digital auction of the first-ever tweet on the platform to bitcoin for charity. His first tweet sold as a non-fungible token for $2.5 million</li>\n<li><strong>Please note current stock price was written premarket and does not reflect intraday changes.</strong></li>\n<li>Ambarella (AMBA) with a host of target raises. Consensus price target around $135 at Buy. Stock currently around $106</li>\n<li>Clean Harbors (CLH) target raised by Needham &amp; Co from $104 to $107 at Buy. Stock currently around $89</li>\n<li>Endava (DAVA) target raised by Morgasn Stanley (MS) from $85 to $93 at Equal-Weight. Stock currently around $80</li>\n<li>Lemonade (LMND) target raised by JMP Securities from $105 to $130 at Outperform. Stock currently around $87</li>\n<li>Mastercard (MA) target raised by Mizuho from $400 to $430 at Buy. Stock currently around $371</li>\n<li>Maravi LifeSciences (MRVI) with two target raises. Stock currently around $35\n\n<ul>\n<li>Morgan Stanley (MS) from $35 to $54 at Overweight.</li>\n<li>Keycorp from $39 to $46 at Overweight</li>\n</ul></li>\n<li>Oracle (ORCL) with two target raises. Stock currently around $72\n\n<ul>\n<li>KeyCorp from $70 to $82 at Overweight</li>\n<li>BMO Capital Markets from $64 to $80</li>\n</ul></li>\n<li>PagSeguro Digital (PAGS) target raised by JP Morgan (JPM) from $61 to $65 at Overweight. Stock currently around $49</li>\n<li>Virgin Galactic (SPCE) target raised by Bank of AMerica from $35 to $50 at Buy. Stock currently around $26.50</li>\n<li>Target (TGT) target raised by BMO Capital Markets from $185 to $205 at Outperform. Stock currently around $177</li>\n<li>ULTA Beauty (ULTA) target raised by Deutsche Bank from $312 to $376 at Buy. Stock currently around $346</li>\n</ul>\n\n<p>&quot;In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices not risk, but it is an opportunity. Where else do you look for cheap stocks?&quot; - Li Lu (Had to reuse the quote, so valuable considering how stocks rallied today)</p>\n</div><!-- SC_ON -->",
  "score": 316,
  "permalink": "/r/stocks/comments/m1gntz/here_is_a_market_recap_for_today_tuesday_march_9/",
  "subreddit": "stocks",
  "id": "m1gntz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542577968
}