{
  "author": "Keshonnne",
  "original_created_utc": 1629815555,
  "title": "Do you have a coin that you bought and made you life changing money?",
  "created_utc": 1629829839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay guys, so we all heard about how crypto can change your life and stuff like this, but I kind of lived the experience on my skin.</p>\n\n<p>September 2020, one of my friends told me about a coin with good potential that could skyrocket and do 3-5x in like 3-6 months.</p>\n\n<p>I was just started to get familiar to crypto back then, it was the period when I started investing the small of money that I had saved into stocks, so I was like “Woooooow, 3-5x in like 6 months?this looks like an once in a lifetime opportunity”.</p>\n\n<p>But the problem was, I didn’t have big money to invest into that coin.</p>\n\n<p>That’s when my father came into play.He had some friends that were also doing crypto for a couple of years, he kind of wanted to get into it, but didn’t really had the “push” to do it.</p>\n\n<p>When I told him about the coin and that it would have the opportunity to us a lot of money, he agreed to put some money into it.</p>\n\n<p>The coin that I am talking about is EGLD.</p>\n\n<p>So we decided that we should buy 20 coins and see how it goes, at the price of 14.46$.The next day, it went up to 15,6$ and I told my father that we are already in the greens.</p>\n\n<p>When I told him that, he got so happy that he gave me money to buy 80 more coins, so we have 100, a nice even number (FOMO got to him instantly, and he’s not that type of guy).</p>\n\n<p>All was good, it went up to like 16-17$, then it dropped dramatically in the next few months back to 7-8$.I was too afraid to tell him about it (he’s kind of bad with technology and didn’t really know how to check the price), so I kept it for myself.</p>\n\n<p>I had a good feeling about the project and that it would be a good investment, so I bought 20 more coins with my money that I saved, to get the total amount at 120 at an average price of 13,32$.I also put them on staking so we could multiply them.</p>\n\n<p>Long story short, it started going way past beyond my expectations, and it reached a high of 242$, so about 18x my money.</p>\n\n<p>Of course, being at the beginning of my journey in crypto, and investing in general, I tought it’ll never stop going up, so I didn’t sell and watched it drop back to the 60’s.The only good part about this is that I had them on stake and they multiplied from 120 to 135 in that period of time.</p>\n\n<p>Now, that I got out of the “MOON BABY” mentality, and that crypto started pumping again, I started gradually selling the coins  at certain price points for some profits.</p>\n\n<p>So, my initial 1600$ investment turned into about 20,000$ and more, depending on how the crypto market will go further on.</p>\n\n<p>This might not be a lot for a lot of you, but for me, coming from a quite poor country, it’s hell of a lot!</p>\n\n<p>Feel free to share your story, I’d definitely love to hear it!</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/paoitx/do_you_have_a_coin_that_you_bought_and_made_you/",
  "subreddit": "CryptoCurrency",
  "id": "paoitx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay guys, so we all heard about how crypto can change your life and stuff like\nthis, but I kind of lived the experience on my skin.\n\nSeptember 2020, one of my friends told me about a coin with good potential that\ncould skyrocket and do 3-5x in like 3-6 months.\n\nI was just started to get familiar to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、皆さん、暗号が人生を変えるという話は聞いたことがあると思います。\nしかし、私は自分の肌でその体験をしたのです。\n\n2020年9月、友人の一人が、3～6ヶ月で3～5倍に高騰する可能性のある有望なコインについて教えてくれました。\n3-6ヶ月で3-5倍になる可能性がある」と教えてくれました。\n\n私はちょうど、そのコインに慣れ始めたところでした...",
      "title": "買って人生が変わるほど儲かったコインはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好了，伙计们，我们都听说了加密货币如何改变你的生活和类似的东西。\n但我是在自己的皮肤上体验到的。\n\n2020年9月，我的一个朋友告诉我一个具有良好潜力的硬币。\n可以在3-6个月内暴涨并达到3-5倍。\n\n我当时刚开始熟悉...",
      "title": "你是否有一枚硬币被你买下，并使你的生活得到改变？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，夥計們，我們都聽說了加密貨幣如何改變你的生活和類似的東西。\n但我是在自己的皮膚上體驗到的。\n\n2020年9月，我的一個朋友告訴我一個具有良好潛力的硬幣。\n可以在3-6個月內暴漲並達到3-5倍。\n\n我當時剛開始熟悉...",
      "title": "你是否有一枚硬幣被你買下，並使你的生活得到改變？"
    }
  ]
}