{
  "author": "mysteriousbaby0",
  "original_created_utc": 1628064297,
  "title": "Today, I finally paid off last of my debts!",
  "created_utc": 1628080883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Can&#39;t tell you how relieved I feel today. I guess only people who were in debt for a long time can relate to this!  </p>\n\n<p>I had a long term loan running since last few years due to purchase of a car I couldn&#39;t afford at the time but could pay in installments.  I am not so bright, don&#39;t be me!  </p>\n\n<p>Soon after pandemic I had to take a big salary cut or lose the job. So I chose the former.  Suddenly, I was not able to pay off my monthly installments. I started taking out huge chunks out of my crypto investment portfolio every month.  </p>\n\n<p>I exhausted my portfolio last month.  But I just wanted to live debt free no matter how. Had to do the inevitable and sold my moons today. And I did pre-closure of debt few months ago.<br/>\nThe sense of relief is immeasurable. I just hope no one has to live under the trap of debt.  </p>\n\n<p>My only regret is I lost all my crypto investments and losing on moons just before mainnet. But oh well!    </p>\n\n<p>I won&#39;t be a millionaire any time soon but I sure do feel like a million bucks.</p>\n</div><!-- SC_ON -->",
  "score": 491,
  "permalink": "/r/CryptoCurrency/comments/oxnx1j/today_i_finally_paid_off_last_of_my_debts/",
  "subreddit": "CryptoCurrency",
  "id": "oxnx1j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Can't tell you how relieved I feel today. I guess only people who were in debt\nfor a long time can relate to this!\n\nI had a long term loan running since last few years due to purchase of a car I\ncouldn't afford at the time but could pay in installments. I am not so bright,\ndon't be me!\n\nSoon after…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日はどれだけホッとしたことでしょう。長い間、借金をしていた人にしかわからないと思いますが\n長い間、借金をしていた人だけが共感できることだと思います。\n\n私はここ数年、当時は買えなかったけれど分割払いできる車を購入したため、長期のローンを抱えていました。\n当時は買えなかったが、分割払いが可能だった。私はそれほど優秀ではありません。\n私のようにならないでください。\n\nその直後...。",
      "title": "今日、ついに最後の借金を完済しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "无法告诉你我今天感觉有多解脱。我想只有那些欠债的人\n的人才能体会到这一点!\n\n在过去的几年里，我有一笔长期贷款，因为我买了一辆车，所以我不能再买了。\n当时买不起，但可以分期付款。我不是那么聪明。\n别像我一样!\n\n不久之后...",
      "title": "今天，我终于还清了我的最后一笔债务!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "無法告訴你我今天感覺有多解脫。我想只有那些欠債的人\n的人才能體會到這一點!\n\n在過去的幾年裏，我有一筆長期貸款，因爲我買了一輛車，所以我不能再買了。\n當時買不起，但可以分期付款。我不是那麼聰明。\n別像我一樣!\n\n不久之後...",
      "title": "今天，我終於還清了我的最後一筆債務!"
    }
  ]
}