{
  "author": "1-Of-Everything",
  "the_new_excerpt": "So my last post on here was also about this, but I promise I’m not just\nconstantly obsessed with this aspect of the market. Basically I heard about the\nimportance of the bond yield rate recently and it sounded quite important. Then\nI heard about the auction happening on Wednesday and that sounded…",
  "original_created_utc": 1615575273,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我上次在这里发的帖子也是关于这个的，但我保证我不只是\n不断迷恋这方面的市场。基本上我听说过\n最近债券收益率的重要性，听起来相当重要。然后\n我听说周三有拍卖会，听起来... ...",
      "title": "国债收益率再次上升"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我上次在這裏發的帖子也是關於這個的，但我保證我不只是\n不斷迷戀這方面的市場。基本上我聽說過\n最近債券收益率的重要性，聽起來相當重要。然後\n我聽說週三有拍賣會，聽起來... ...",
      "title": "國債收益率再次上升"
    }
  ],
  "title": "Treasury yields rose again",
  "created_utc": 1615635050,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my last post on here was also about this, but I promise I’m not just constantly obsessed with this aspect of the market. Basically I heard about the importance of the bond yield rate recently and it sounded quite important. Then I heard about the auction happening on Wednesday and that sounded like it could have consequences, good or bad. From what I understand, the auction was able to sell bonds and thus the yield rate didn’t raise much at all. Then I was like “ok cool that’s over with.” </p>\n\n<p>But today I am on my yahoo finance app and just happen to see TNX as one of the suggested/trending/whatever items. TNX is the 10 year treasury indicator (idk if it’s a stock or a index or what). And I see that it’s at 1.626 which is higher than it closed at from the auction on Wednesday (1.52 or something). So why did it jump up again? I thought it was supposed to be steady after the auction on Wednesday kind of set things in place. Does it matter really?</p>\n</div><!-- SC_ON -->",
  "score": 64,
  "permalink": "/r/investing/comments/m3ocer/treasury_yields_rose_again/",
  "subreddit": "investing",
  "id": "m3ocer",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379958
}