{
  "author": "ZealousidealRub9407",
  "original_created_utc": 1660088232,
  "title": "My girlfriend doesn’t want to have sex with me. What should I do?",
  "created_utc": 1660109590,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My girlfriend of 3 years has stopped wanting to have sex with me. During the last year we&amp;#39;ve had sex less than 10 times. I&amp;#39;ve tried many things to try and get her in the mood but they never work. I&amp;#39;ve brought it up multiple times with her how much it affects me and my mental health but nothing has changed. I know sex and intimacy isn&amp;#39;t the be all and end all in a relationship but to me it&amp;#39;s important and it&amp;#39;s making me feel like she doesn&amp;#39;t have any attraction or list towards me. I love her so much and\nwould never cheat on her but it&amp;#39;s really affecting me. What can I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/TooAfraidToAsk/comments/wki6cr/my_girlfriend_doesnt_want_to_have_sex_with_me/",
  "subreddit": "TooAfraidToAsk",
  "id": "wki6cr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "My girlfriend of 3 years has stopped wanting to have sex with me. During the\nlast year we've had sex less than 10 times. I've tried many things to try and\nget her in the mood but they never work. I've brought it up multiple times with\nher how much it affects me and my mental health but nothing has…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3年付き合った彼女がセックスをしたがらなくなった。この1年間\nこの1年、私たちは10回以下しかセックスしていません。私は彼女をその気にさせようと、いろいろなことを試しましたが\nいろいろ試してみたが、うまくいかない。何度もその話をしたんだ。\n何度も何度も、それがどれだけ僕と僕の精神衛生に影響を与えるかを話したが、何も...",
      "title": "恋人がセックスをしたがらない。どうしたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我交往了三年的女友不再想和我做爱了。在过去的一年里\n在过去的一年里，我们的性生活不到10次。我尝试了很多方法来尝试和\n让她进入状态，但都没有用。我已经多次向她提出\n她说这对我和我的心理健康有多大影响，但没有任何效果......",
      "title": "我的女朋友不想和我做爱。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我交往了三年的女友不再想和我做愛了。在過去的一年裏\n在過去的一年裏，我們的性生活不到10次。我嘗試了很多方法來嘗試和\n讓她進入狀態，但都沒有用。我已經多次向她提出\n她說這對我和我的心理健康有多大影響，但沒有任何效果......",
      "title": "我的女朋友不想和我做愛。我應該怎麼做？"
    }
  ]
}