{
  "author": "thebreadjordan",
  "the_new_excerpt": "My friend and I dropped some acid and had literally a 4 hour conversation about\nwhy Bitcoin is unstoppable. I will attempt to write as much of it down here (I'm\ncurious to hear your thoughts and whether you agree or think I'm a mad man), but\nwe had so many interesting ideas that I wish I had it on…",
  "original_created_utc": 1614672928,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友和我扔了一些酸，并有一个字4小时的谈话，关于\n为什么比特币势不可挡。我将尝试在这里尽可能多的写下来（我是\n很想听听你的想法，以及你是否同意或认为我是个疯子），但。\n我们有这么多有趣的想法，我希望我有它的... ...",
      "title": "我有一个疯狂的酸之旅，我百分之百相信这是宇宙告诉我买比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友和我扔了一些酸，並有一個字4小時的談話，關於\n爲什麼比特幣勢不可擋。我將嘗試在這裏儘可能多的寫下來（我是\n很想聽聽你的想法，以及你是否同意或認爲我是個瘋子），但。\n我們有這麼多有趣的想法，我希望我有它的... ...",
      "title": "我有一個瘋狂的酸之旅，我百分之百相信這是宇宙告訴我買比特幣"
    }
  ],
  "title": "I had a crazy acid trip and I am 100% convinced it was the universe telling me to buy bitcoin",
  "created_utc": 1614688233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My friend and I dropped some acid and had literally a 4 hour conversation about why Bitcoin is unstoppable. I will attempt to write as much of it down here (I&#39;m curious to hear your thoughts and whether you agree or think I&#39;m a mad man), but we had so many interesting ideas that I wish I had it on video or some shit. </p>\n\n<p>Basically, we are big stock guys who dabbled in bitcoin, but have never fully committed. But after this, we are 100% on board. </p>\n\n<p>So basically, as you know, retail investing has been on the rise. More and more people have begun investing, and they are only beginning to realize the power they have. You don&#39;t need go be a billionaire to invest, and honestly the whole system is kind of bullshit. People claim stock prices are built on &quot;fundamentals&quot; and they are to some extent. But every stock has INTRINSIC value (the &quot;fundamentals&quot;, EPS, value for having a successful business, ect) and extrinsic value (hype, speculation on future, ect) This whole GME thing has made people realize that. They banded together and moved a market, sticking it to the guys at the top. However, trading was halted, and with malicious intent or not, Robinhood and its billionaire investors halted trading, ending the retail revolution. </p>\n\n<p>So, now that people realize that stocks are bullshit with whatever value we collectively place on them, and that they have power in numbers... what is the logical conclusion?</p>\n\n<p>BITCOIN</p>\n\n<p>More and more people will realize that decentralized finance is better in every way. It&#39;s sticking it to the government, not allowing them to manipulate and control every aspect of the financial system. If everyone just holds, everyone could be rich, and bitcoin could begin to rival the US dollar, with investors who got in relatively early being rich like all the hedge funds. Unlike in the stock market, no institution could halt trading, meaning there is literally no way bitcoin could be rejected. It&#39;s like the snowball effect. It will just keep getting bigger and bigger as it gains more institutional and retail support. </p>\n\n<p>For part two of our theory, we realized that after our last president showed just how influential social media can be to politics, it is only a matter of time before someone runs for office on the platform of  Bitcoin and decentralized finance. Because decentralized finance would benefit everyone in the country, it could be a wildly popular opinion, and even a way forward into the future. All it takes is for this OBVIOUS idea of someone tying bitcoin to politics to happen. </p>\n\n<p>Anyways, am I crazy? Or did the universe actually give me reasons that bitcoin cannot fail?</p>\n</div><!-- SC_ON -->",
  "score": 673,
  "permalink": "/r/Bitcoin/comments/lvx4iz/i_had_a_crazy_acid_trip_and_i_am_100_convinced_it/",
  "subreddit": "Bitcoin",
  "id": "lvx4iz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937732207
}