{
  "author": "akokaz1",
  "the_new_excerpt": "I created an algorithm that scans popular trading subreddits and logs when\nstocks are mentioned. It also analyses the posts and comments that the stocks\nare mentioned in and calculates the sentiment and context the stock is mentioned\nin.\n\nThe algorithm tries to track the overall hype and prevalence…",
  "original_created_utc": 1613659525,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我创建了一个算法，扫描流行的交易子网，并记录当。\n股票被提及。它还分析了这些股票的帖子和评论。\n并计算出股票被提及的情绪和背景。\n中。\n\n算法中试图追踪整体炒作和流行...",
      "title": "我已经创建了一个算法，跟踪交易子网的讨论，试图识别嗡嗡作响的股票。这是我的结果。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我創建了一個算法，掃描流行的交易子網，並記錄當。\n股票被提及。它還分析了這些股票的帖子和評論。\n並計算出股票被提及的情緒和背景。\n中。\n\n算法中試圖追蹤整體炒作和流行...",
      "title": "我已經創建了一個算法，跟蹤交易子網的討論，試圖識別嗡嗡作響的股票。這是我的結果。"
    }
  ],
  "title": "I have created an algorithm that tracks discussions across trading subreddits to try and identify buzzing stocks. Here's my results.",
  "created_utc": 1613668434,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I created an algorithm that scans popular trading subreddits and logs when stocks are mentioned. It also analyses the posts and comments that the stocks are mentioned in and calculates the sentiment and context the stock is mentioned in.</p>\n\n<p>The algorithm tries to track the overall hype and prevalence of the stock across the different subreddits, rather than simply calculating the amount of times the stock is mentioned.</p>\n\n<p><strong>How do I currently use this?</strong><br/>\nNormally, I would browse different subreddits to try and learn about new stocks that are trending or being discussed. I would use those stocks as the basis of my due-diligence research over the next few days.</p>\n\n<p>What I found was that this was not only time-consuming, but by the time I had done my research, the stock had already shot up in price based on the news or events that were being discussed on Reddit, or simply from the fact that now everyone is aware of this upcoming stock.</p>\n\n<p>The algorithm serves as an early detection system, allowing me to pick up stocks such as SRNE or PLTR before their big price shifts.</p>\n\n<p><strong>What is it not?</strong></p>\n\n<p>This is an early detection tool, you should not base your investment decisions solely on the results of this algorithm.</p>\n\n<p><strong>Please do your own DD before investing.</strong></p>\n\n<p><strong>Results</strong></p>\n\n<p>The results represent the most discussed stocks across the various sub-reddits over the last week, their price movement over the last 2-weeks <em>(first value in percentages)</em> and their overall bullishness sentiment score (second value, in bold, ranging from 0 (<em>negative</em>) to 100(<em>positive</em>)).</p>\n\n<p><a href=\"https://ibb.co/vk0hLL0\">https://ibb.co/vk0hLL0</a></p>\n\n<p>of the top 3 discussed stocks in there, <strong>Aphria Inc (APHA)</strong> <strong>+45%</strong> is the most interesting for me.</p>\n\n<p>This was actually a stock my algorithm has identified for a number of days now, peaking a few days later, however given the continued chatter, and the long-term outlook for this stock, I think there is still a big upside for this stock.</p>\n\n<p>Aphria Inc is a Canada-based international recreation and medicinal based cannabis distribution company. The Company’s Canadian cannabis operations are comprised of its Aphria One greenhouse facility (Aphria One), facilities held through its wholly owned British Columbia-based subsidiary, Broken Coast Cannabis Ltd. (Broken Coast) and its Leamington-based subsidiary, 1974568 Ontario Limited (Aphria Diamond).</p>\n\n<p>APHA also manufacture and distribute bottled, canned and draft craft beers. The Company currently has established operations in Canada, Germany, Italy, Malta, Colombia and Argentina.</p>\n\n<p>With a market cap of $5.9bn, it’s currently one of the largest cannabis companies globally, and will only grow even further once its merger with <strong>Tilray (TLRY)</strong> <em>(this is another stock my algorithm picked up on)</em> is complete.</p>\n\n<p>To keep things brief, I will skip over discussing the merger in this post, focussing on the company financials and growth landscape instead <em>(I can cover this in detail if this is something people are after)</em>.</p>\n\n<p><strong>Revenue</strong></p>\n\n<p>APHA has had consistent revenue growth, going from $237m in 2019 to $543m in FY 2020, an increase of <strong>125%</strong>. By comparison, its closest rival Canopy Growth Corporation had a revenue increase of <strong>%76</strong>.</p>\n\n<p>While revenue growth this year will be slightly subdued this year due to COVID supply issues and temporary closure of retail shops, pent-up demand (fuelled not only by a desire to make up for lost time, but also as a way for people to cope with the built-up anxiety of lockdown) and further mainstreaming of recreational cannabis products will only support growth long-term.</p>\n\n<p>In November, Aphria purchased Sweetwater Brewing, one of the largest independent craft brewers in the US. This, along with the fact that TLRY has a contract with InBev, one of the largest beverage producers in the world, and the growing demand for more flexible ways to consume cannabis, opens up a completely new revenue stream. It’s price since that merger is up <strong>311%</strong>.</p>\n\n<p><strong>Politics</strong></p>\n\n<p>In the US, Democrats now control all of Congress, Senate and the White House. Their more progressive stance on recreational drugs compared to the previous administration means decriminalisation at a federal level is a lot more likely. This is highlighted by Chuck Schumer’s announcement that a draft of the bill be introduced at some point H1 2021.</p>\n\n<p>Full US decriminalisation not only unlocks a massive market, but also places focus on European countries to follow suit with full de-restriction and regulation (this is already happening in some countries, with France currently undergoing a public consultation).</p>\n\n<p>When this happens, Aphria’s European operations and scale means they can go to market at scale quicker than most rivals.</p>\n\n<p><strong>Possible downsides</strong></p>\n\n<p>Cannabis stocks are volatile stocks at the best of times, given the hype that has emerged on WallStreetBets surrounding this sector in the last few days, expect price to be volatile, with some more potential downside as the hype cools down.</p>\n\n<p>Furthermore, some analysts are skeptical of the true size of the recreational cannabis market, suggesting growth has plateaued, pointing to sub-par market performance compared to projections historically. Personally, I believe this is all short term, as the market becomes more embedded and accepted, we will see more ‘casual’ users entering the market.</p>\n\n<p><strong>Summary</strong></p>\n\n<p>Underneath all the volatility, APHA has some solid fundamentals that stand out compared to peers in the sector, that’s without taking into account the TLRY merger, which personally I believe will be a game changer.</p>\n\n<p>In terms of investment play, this is a long-term hold, so if you are interested prepare to purchase and hold for 2–3 years. There is lots of volatility surrounding the stock, especially currently, I would suggest a small portfolio allocation, entering either before the merger, or before US decriminalisation if you miss that boat.</p>\n\n<h1>What’s next?</h1>\n\n<p>If people find this content useful, I plan on sharing this on a regular cadence, along with providing some of my commentary and DD on these stocks, so you can garner a better idea of what the stocks are about.</p>\n\n<p>Please share this with friends who may find this type of content useful. The more this is received the more time I can dedicate towards stock education for the masses.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/stocks/comments/lmobc0/i_have_created_an_algorithm_that_tracks/",
  "subreddit": "stocks",
  "id": "lmobc0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883618
}