{
  "author": "MrMooooody",
  "original_created_utc": 1650056426,
  "title": "What will it take to ignite the next bull run?",
  "created_utc": 1650090979,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just wondering peoples thoughts on what could ignite the next bull run? We have clearly been on a continuous downtrend for the past 6 months which has been a little depressing and bitcoin is over 30% down from this point 1 year ago. What can get us out of this? &lt;/p&gt;\n\n&lt;p&gt;Could it be the Russia invasion of Ukraine coming to an end? XRP winning the court case against SEC? Bitcoin being declared as part of a big company&amp;#39;s balance sheet? Or could we have to wait as long as the next bitcoin halving in 2024?&lt;/p&gt;\n\n&lt;p&gt;Personally I think the war plus inflation is probably the biggest thing holding us back right now!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/u4hp2i/what_will_it_take_to_ignite_the_next_bull_run/",
  "subreddit": "CryptoCurrency",
  "id": "u4hp2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just wondering peoples thoughts on what could ignite the next bull run? We have\nclearly been on a continuous downtrend for the past 6 months which has been a\nlittle depressing and bitcoin is over 30% down from this point 1 year ago. What\ncan get us out of this?\n\nCould it be the Russia invasion of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "次のブルランの火付け役となり得るものについて、皆さんのご意見をお聞かせください。私たちは\nこの6ヶ月間、明らかに下降トレンドが続いており、このままでは\nビットコインは1年前のこの時点から30％以上下がっています。何が\nはここから抜け出せるのか？\n\nそれは、ロシアの侵攻かもしれない・・・。",
      "title": "次のブルランに火をつけるには何が必要なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是想知道人们对什么能点燃下一轮牛市的想法？我们已经\n在过去的6个月里，我们显然一直处于持续的下降趋势中，这让我们有点沮丧。\n有点郁闷，而且比特币比一年前的这个点下降了30%以上。什么\n能让我们走出困境？\n\n会不会是俄罗斯入侵的...",
      "title": "要怎样才能点燃下一个牛市的活力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是想知道人們對什麼能點燃下一輪牛市的想法？我們已經\n在過去的6個月裏，我們顯然一直處於持續的下降趨勢中，這讓我們有點沮喪。\n有點鬱悶，而且比特幣比一年前的這個點下降了30%以上。什麼\n能讓我們走出困境？\n\n會不會是俄羅斯入侵的...",
      "title": "要怎樣才能點燃下一個牛市的活力？"
    }
  ]
}