{
  "author": "DetroitMotorShow",
  "the_new_excerpt": "Its crazy how all regulation fails when it comes to the large players and\nparticipants. Bill Hwang/Archegos capital was convicted by the SEC for insider\ntrading [https://www.sec.gov/news/press-release/2012-2012-264htm], is also\nbanned from participating in Hong Kong stock market for fraud, but…",
  "original_created_utc": 1617073632,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "其疯狂的是，当涉及到大玩家和所有的监管失败。\n的参与者。Bill Hwang/Archegos capital因内幕消息被SEC定罪。\n贸易[https://www.sec.gov/news/press-release/2012-2012-264htm]，也是\n因欺诈罪被禁止参与港股市场，但...",
      "title": "股票市场是混乱的。富人能够绕过所有的法规。一位对冲基金交易员，因内幕交易被美国证券交易委员会定罪，被清算了150亿美元的保证金账户。Cryptos是一股清新的空气。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "其瘋狂的是，當涉及到大玩家和所有的監管失敗。\n的參與者。Bill Hwang/Archegos capital因內幕消息被SEC定罪。\n貿易[https://www.sec.gov/news/press-release/2012-2012-264htm]，也是\n因欺詐罪被禁止參與港股市場，但...",
      "title": "股票市場是混亂的。富人能夠繞過所有的法規。一位對沖基金交易員，因內幕交易被美國證券交易委員會定罪，被清算了150億美元的保證金賬戶。Cryptos是一股清新的空氣。"
    }
  ],
  "title": "Stock markets are shambolic. The rich are able to bypass all regulations. A hedge fund trader, who was convicted by the SEC for insider trading, got liquidated on $15bn margin account. Cryptos are a breath of fresh air.",
  "created_utc": 1617100224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Its crazy how all regulation fails when it comes to the large players and participants. Bill Hwang/Archegos capital was <a href=\"https://www.sec.gov/news/press-release/2012-2012-264htm\">convicted by the SEC for insider trading</a>, is also banned from participating in Hong Kong stock market for fraud, but somehow can get 5x leverage from large public banks like Nomura, Goldman Sachs and Credit Suisse. He blew up what is estimated to be a $15bn account that was extended to $80bn by leverage. Entire account gone, tanking bank stocks and profits with it. None of the banks that have been lending to him were bothered by his risky track record. And another of his proteges Teng Yue also apparently blew up a similar sized account, all trading risky Chinese stocks. The total impact is estimated at around $30bn without leverage. </p>\n\n<p>These &quot;hedge funds&quot; were given leverage to place super risky bets on stocks. One of the company Hwang/Archegos was into, GSX Techedu has long been suspected of being a fraud company. As per some analysts and whistle blowers like Muddy Waters Research who have been calling GSX a scam for a long time, all the so called &quot;students&quot; of GSX are just bots, GSX was compared to another phony company Luckin Coffee. In Jan, it was suspected that the stocks rise in price was due to short covering. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wjhflelly2q61.png?width=1048&amp;format=png&amp;auto=webp&amp;s=3508b609db86ba14c55d10413e9cf239d7c5189c\">Public shareholders of GSX. Its owned by a lot of big banks, who seemingly have not done any due diligence. A lot of US public funds is used to pump shady companies. Even Pension funds are invested in this garbage.</a></p>\n\n<p>These hedge funds even skip SEC reporting rules by dealing in swaps and not the actual equities of risky companies. So in this case, the SEC doesnt even know what Archegos and Teng Yue&#39;s accounts look like, because they are all held in swaps and the banks are the final owners of these risky assets. </p>\n\n<p>These risky stocks are held by pension funds and public banks on their books, while clean assets like Bitcoin are labelled risky and speculative. If the pension funds actually held bitcoin, all their pensioners would be better off and thank them. Instead they have been investing in garbage that will only erode their investors investments.</p>\n</div><!-- SC_ON -->",
  "score": 359,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/BvDuKqTcATOXkvzAdSuC0JzNuc2LUk87GS_ZjIYKTe0.jpg?auto=webp&s=06ba31218fca2022630307ad8e8a4c5bd15441d4",
          "width": 122,
          "height": 122
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/BvDuKqTcATOXkvzAdSuC0JzNuc2LUk87GS_ZjIYKTe0.jpg?width=108&crop=smart&auto=webp&s=a93ccc5e0879adf1d1f8ad2b7d930c13d9626fe6",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "jMLeMC1xH2G9tQCuMdQjz_O2wgCW35pPg0sZrSwqSGs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mg6hyb/stock_markets_are_shambolic_the_rich_are_able_to/",
  "subreddit": "CryptoCurrency",
  "id": "mg6hyb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138667
}