{
  "author": "luisantonio197",
  "original_created_utc": 1638130462,
  "title": "With all the recent hype sorrounding Nervos' CKB, how much do you actually know about what CKB is trying to accomplish?",
  "created_utc": 1638207638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been seeing more and more CKB shills lately (I&#39;m a strong supporter of this project so this is no way intended to discourage investors). </p>\n\n<p>I was just wondering how much this community actually knows about the project. I personally had a hard time grasping some of the concepts behind the tokenomics at first when I read the whitepaper. If you are invested in the project is it solely because it has started to become popular on this sub or is it because you believe in the tech and the roadmap that Nervos has laid out?</p>\n\n<p>Also, if you currently hold CKB, what got you into the project?</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/r4d7vt/with_all_the_recent_hype_sorrounding_nervos_ckb/",
  "subreddit": "CryptoCurrency",
  "id": "r4d7vt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been seeing more and more CKB shills lately (I'm a strong supporter of this\nproject so this is no way intended to discourage investors).\n\nI was just wondering how much this community actually knows about the project. I\npersonally had a hard time grasping some of the concepts behind the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、CKBのしりとりが増えてきましたね（私はこの強力な\n私はこのプロジェクトを強く支持しているので、決して投資家を落胆させるつもりはありません）。\n\n私は、このコミュニティが実際にこのプロジェクトについてどれだけ知っているのか疑問に思っていました。I\n個人的にはCKBのコンセプトを理解するのに苦労しました。",
      "title": "最近、ネルボスのCKBが話題になっていますが、実際にCKBが何を目指しているのか、どの程度ご存知ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近看到越来越多的CKB骗子（我是这个项目的坚定支持者，所以这不可能）。\n我是这个项目的坚定支持者，所以这并不是要打击投资者）。\n\n我只是想知道这个社区对这个项目究竟了解多少。I\n我个人很难掌握这个项目背后的一些概念。",
      "title": "最近围绕着Nervos的CKB的所有炒作，你实际上对CKB试图实现的目标了解多少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近看到越來越多的CKB騙子（我是這個項目的堅定支持者，所以這不可能）。\n我是這個項目的堅定支持者，所以這並不是要打擊投資者）。\n\n我只是想知道這個社區對這個項目究竟瞭解多少。I\n我個人很難掌握這個項目背後的一些概念。",
      "title": "最近圍繞着Nervos的CKB的所有炒作，你實際上對CKB試圖實現的目標瞭解多少？"
    }
  ]
}