{
  "author": "busterrulezzz",
  "original_created_utc": 1636810980,
  "title": "Another reason why L2s are going to explode and revolutionize Ethereum",
  "created_utc": 1636836083,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems like there&#39;s not a day going by without a top post complaining about high gas fees on Ethereum. I totally agree with the core critic : retail investors are being priced out of the network. Nobody - except whales - can afford to pay 200$ for a simple swap.</p>\n\n<p>But those days will soon be over.</p>\n\n<p>A lot of people already know about Layer-2, the &quot;execution&quot; layer of Ethereum. They have names like Optimism, Arbitrum and zkSync. But most of the times, when I mention those services, people are still not satisfied. UX isn&#39;t great, bridging to L2 costs money, and there are no liquidity on a lot of pairs there.</p>\n\n<p>That&#39;s about to change!</p>\n\n<p>This week, MakerDAO introduced Maker Wormhole, a solution that will let users <strong>bridge DAI between mainnet and L2 instantly</strong> and with ridiculously low fees (a fraction of a penny). The official launch is scheduled for Q1 2022, and it should work first on Arbitrum/Optimism, and then be deployed on other L2s. Even better, this Wormhole doesn&#39;t require any liquidity at all! DAI will be burnt and minted on each side of the transaction by an oracle.</p>\n\n<p>This will have a huge implication for all Ethereum L2s : no more waiting times for withdrawing, frictionless transfers of capital between layers, and extremely low fees to get started on L2s. And this is just one of the many exciting projects that are in the works for the Ethereum ecosystem. Those are not distant vaporware ; it&#39;s happening right now, before our eyes. And I think a lot of people around here still don&#39;t realize how close we are to this revolution.</p>\n\n<p>(Here are <a href=\"https://forum.makerdao.com/t/introducing-maker-wormhole/11550\">more details</a> for those interested.)</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qt1irj/another_reason_why_l2s_are_going_to_explode_and/",
  "subreddit": "CryptoCurrency",
  "id": "qt1irj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems like there's not a day going by without a top post complaining about\nhigh gas fees on Ethereum. I totally agree with the core critic : retail\ninvestors are being priced out of the network. Nobody - except whales - can\nafford to pay 200$ for a simple swap.\n\nBut those days will soon be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムのガス料金の高さを嘆く記事が毎日のように投稿されているようです。\nイーサリアムのガス料金が高い 個人投資家がネットワークから値引きされている」という批判の核心にはまったく同意します。\n個人投資家がネットワークから値下げされているというものです。クジラを除いて、誰もが\n単純なスワップに200ドルも払う余裕はありません。\n\nしかし、そんな時代はもうすぐ終わります。",
      "title": "L2が爆発的に普及し、イーサリアムに革命を起こすもう一つの理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎没有一天不在上面发帖抱怨\n以太坊的高额加油费。我完全同意核心批评者的观点：零售\n投资者被挤出网络的价格。没有人--除了鲸鱼--能够\n负担得起为一个简单的交换支付200美元。\n\n但这些日子很快就会过去。",
      "title": "L2将爆发并彻底改变以太坊的另一个原因"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎沒有一天不在上面發帖抱怨\n以太坊的高額加油費。我完全同意核心批評者的觀點：零售\n投資者被擠出網絡的價格。沒有人--除了鯨魚--能夠\n負擔得起爲一個簡單的交換支付200美元。\n\n但這些日子很快就會過去。",
      "title": "L2將爆發並徹底改變以太坊的另一個原因"
    }
  ]
}