{
  "author": "DeadlyViperA_Squad",
  "the_new_excerpt": "FEDERAL RESERVE’S DIGITAL DOLLAR PUSH WORRIES WALL STREET\n\nThe financial services industry, braced for what could be its biggest disruption\nin decades, is about to get an early glimpse at the Federal Reserve’s work on a\nnew digital currency.\n\nWall Street is not thrilled.\n\nBanks, credit card…",
  "original_created_utc": 1616524707,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "联邦储备局的数字货币推动令华尔街担忧\n\n金融服务行业，准备迎接可能是最大的颠覆。\n数十年来，即将提前一睹美联储在一个\n新的数字货币。\n\n华尔街并不兴奋。\n\n银行、信用卡...",
      "title": "波士顿联储、麻省理工学院最快7月发布数字美元原型。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聯邦儲備局的數字貨幣推動令華爾街擔憂\n\n金融服務行業，準備迎接可能是最大的顛覆。\n數十年來，即將提前一睹美聯儲在一個\n新的數字貨幣。\n\n華爾街並不興奮。\n\n銀行、信用卡...",
      "title": "波士頓聯儲、麻省理工學院最快7月發佈數字美元原型。"
    }
  ],
  "title": "Boston Federal Reserve, MIT to release digital dollar prototypes as soon as July",
  "created_utc": 1616535132,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Federal Reserve’s Digital Dollar Push Worries Wall Street</h1>\n\n<p>The financial services industry, braced for what could be its biggest disruption in decades, is about to get an early glimpse at the Federal Reserve’s work on a new digital currency.</p>\n\n<p>Wall Street is not thrilled.</p>\n\n<p>Banks, credit card companies and digital payments processors are nervously watching the push to create an electronic alternative to the paper bills Americans carry in their wallets, or what some call a digital dollar and others call a Fedcoin.</p>\n\n<p>As soon as July, officials at the <a href=\"https://www.bloomberg.com/quote/2972930Z:US\">Federal Reserve Bank of Boston</a> and the Massachusetts Institute of Technology, which have been developing prototypes for a digital dollar platform, plan to unveil their research, said <a href=\"https://www.bostonfed.org/people/bank/james-cunha.aspx\">James Cunha</a>, who leads the project for the Boston Fed.</p>\n\n<p>A digital currency could fundamentally change the way Americans use money, leading some financial firms to lobby the Fed and Congress to slow its creation -- or at least ensure they’re not cut out.</p>\n\n<p>Seeing the threat to their profits, the banks’ main trade group has told Congress a digital dollar isn’t needed, while payment companies like <a href=\"https://www.bloomberg.com/quote/V:US\">Visa Inc.</a> and <a href=\"https://www.bloomberg.com/quote/MA:US\">Mastercard Inc.</a> are trying to work with central banks to make sure the new currencies can be used on their networks.</p>\n\n<p>“Everyone is afraid that you could disrupt all the incumbent players with a whole new form of payment,” said Michael Del Grosso, an analyst for <a href=\"https://www.bloomberg.com/quote/0211844D:US\">Compass Point Research &amp; Trading LLC</a>.</p>\n\n<p>Lawmakers, U.S. Treasury Department officials and the Fed haven’t yet approved the rollout of a U.S. virtual currency, which could still be years away. Nor have they decided how a digital dollar would interact with the existing global payments network. Still, the U.S. and other countries seem committed enough to digitizing their currencies that it’s making financial industry executives nervous.</p>\n\n<p>“The fire has been lit,” said <a href=\"https://www.atlanticcouncil.org/expert/josh-lipsky/\">Josh Lipsky</a>, who has helped convene government officials from the U.S. and other countries working on digital currencies as director of the GeoEconomics Center at the Atlantic Council. “The world is moving very quickly on these projects.”</p>\n\n<p>&#x200B;</p>\n\n<p>At issue are forms of digital cash being considered by the U.S. and other governments. The growing popularity of Bitcoin, Ethereum and other cryptocurrencies, whose market value has grown to more than $1 trillion, inspired the projects. Unlike those privately created tokens, the new currencies would be issued by central banks as an alternative to paper bills. Cash wouldn’t go away, but its use would likely decline.</p>\n\n<p>Using the currencies could be as simple as holding up the screen of a mobile phone to be scanned. Behind the scenes, the digital cash would move from one account to another. This is similar to how most money already works -- the majority of U.S. dollars are just digital entries in bank accounts -- but the new currency could potentially avoid the go-between of a commercial bank or credit-card network. For vendors, settlement would happen almost immediately, without having to wait for the money or worry about fraud.</p>\n\n<p>The U.S. effort got an extra push last month, when Treasury Secretary Janet Yellen said such a project could help Americans who don’t have access to the banking system.</p>\n\n<p>In video <a href=\"https://www.bloomberg.com/news/articles/2021-03-18/powell-says-central-bank-digital-currency-must-coexist-with-cash\">remarks</a> last week to a payments conference in Basel, Switzerland, Federal Reserve Chair Jerome Powell may have eased some of the banks’ concerns when he said “digital currencies would need to be integrated into existing payment systems alongside cash and other forms of money.”</p>\n\n<p>Powell in a Bank for International Settlements panel on Monday <a href=\"https://www.bloomberg.com/news/articles/2021-03-22/fed-s-powell-and-peers-aren-t-rushing-into-digital-currencies-kmkp6667\">said</a> the Fed has “an obligation to be on the cutting edge of understanding the technological challenges” and the costs and benefits of a digital dollar but wouldn’t rush the project. Powell also said the Fed wouldn’t proceed without support from Congress, ideally in the form of legislation.</p>\n\n<p>Cunha said the Boston Fed and MIT hope to unveil some of their work in the third quarter, including at least two prototype software platforms that could move, store and settle transactions made with digital dollars. He wouldn’t say if either platform uses the blockchain technology that underlies Bitcoin and other cryptocurrencies. Once the prototypes are released, Cunha said, others will be able to see and build on the code.</p>\n\n<p>The Fed’s work is meant to show what’s possible without taking a stand on major issues that the central bank, Treasury and Congress must address, Cunha said. These include whether the Fed itself should host customer accounts, whether to allow anonymity, and what protections consumers would have in case of a cyber-breach or mistaken transaction.</p>\n\n<p>“We think it’s important that we not wait for the policy debate because then we’ll be a year or so behind,” Cunha said. “This will take significant outreach to the industry and serious debate.”</p>\n\n<p>The potential that the central bank could cut banks out of their middleman role in the lucrative U.S. payments system is causing angst among banks.</p>\n\n<p>So is the push coming from Ohio Democratic Senator Sherrod Brown, the new chairman of the <a href=\"https://www.bloomberg.com/quote/1025701D:US\">Senate Banking Committee</a>. Brown is urging the Fed to move quickly to create digital-currency accounts for Americans who can’t easily access the financial system and have been forced to deal with payday lenders who charge higher fees and interest rates. Brown’s plan could threaten the deposits that commercial banks rely on to make mortgages and other loans.</p>\n\n<p>“Rushing anything of this potential magnitude could introduce unintended consequences that threaten the stability of the banking system without contributing meaningfully to economic inclusion,” said Steve Kenneally, senior vice president of payments at the <a href=\"https://www.bloomberg.com/quote/0321782Z:US\">American Bankers Association</a>.</p>\n\n<p>The ABA, which says it’s lobbying Congress on the issue, last year in written testimony called the digital dollar a costly solution in search of a nonexistent problem.</p>\n\n<p>Two lobbyists for a large bank said they’re in contact with lawmakers to keep track of the issue. They expect lobbying to pick up once banks can actually see the Fed’s work and how it might affect them, said the lobbyists, who requested anonymity to discuss internal conversations.</p>\n\n<p>Interest in a digital currency has gathered momentum in part because many banks take days to give consumers access to checks deposited in their accounts and some charge stiff overdraft fees. Those without bank accounts sometimes must pay high fees to cash paychecks or transmit money to relatives.</p>\n\n<p>Some of the profits of credit-card companies, such as Visa and Mastercard, could be at risk if the new currencies let Americans more easily make transactions without their involvement and fees.</p>\n\n<p>Spokespeople from both companies say their firms are working with central banks to ensure the new currencies can run over their networks. Mastercard in February began to issue pre-paid debit cards loaded with the “Sand Dollar,” a digital currency issued by the Bahamas.</p>\n\n<p>“We’re increasingly having conversations with central banks as they think about designing potential central bank digital currency, CBDC, and we’re talking to them about how they think about design,” said Visa’s North America president Oliver Jenkyn, at a <a href=\"https://www.bloomberg.com/quote/MS:US\">Morgan Stanley</a> conference earlier this month. “So there’s a lot of talking, but there’s actually a lot of action alongside it as well.”</p>\n\n<p>&#x200B;</p>\n\n<p>Other countries <a href=\"https://www.bloomberg.com/news/articles/2021-02-05/central-banks-edge-toward-money-s-next-frontier-in-digital-world\">are further along</a>. China is currently piloting a digital yuan in several cities. Lipsky said there’s a chance its currency could be ready for a broader debut at the 2022 Winter Olympics in Beijing, which he said could cause tensions if American athletes are asked to use a currency that the Chinese government can completely track.</p>\n\n<p>Brown earlier this month sent a <a href=\"https://www.banking.senate.gov/imo/media/doc/Federal%20Reserve_%20Letter%2003012021.pdf\">letter</a> to Powell urging him to speed up the research. “We cannot be left behind,” Brown wrote.</p>\n\n<p>Among other threats, Brown pointed to the development by <a href=\"https://www.bloomberg.com/quote/FB:US\">Facebook Inc.</a> and other companies of their own cryptocurrency, once called Libra. That currency, since renamed Diem, was slated to launch in 2020 but has struggled to win regulatory approval.</p>\n\n<p>Advocates of existing cryptocurrencies, like Bitcoin, have mixed feelings about the Federal Reserve muscling into the industry.</p>\n\n<p>A Fedcoin could acclimate Americans to purchasing Bitcoin, said Jerry Brito, who heads <a href=\"https://www.bloomberg.com/quote/1241579D:US\">Coin Center</a>, a cryptocurrency advocacy group. But depending on the government’s direction, such a currency could be used to track Americans’ spending, destroying the partial anonymity that was once the promise of crypto, he said.</p>\n\n<p>A U.S. digital dollar could also put the final nail in the coffin for Bitcoin as a means of exchange, Brito said. Crypto enthusiasts have already started to acknowledge that’s happening anyway, and instead tout the currency as a store of value or “digital gold.”</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2021-03-22/federal-reserve-s-digital-dollar-momentum-worries-wall-street?sref=w3vFo7gi\">https://www.bloomberg.com/news/articles/2021-03-22/federal-reserve-s-digital-dollar-momentum-worries-wall-street?sref=w3vFo7gi</a></p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/investing/comments/mblhn8/boston_federal_reserve_mit_to_release_digital/",
  "subreddit": "investing",
  "id": "mblhn8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819539
}