{
  "author": "maali74",
  "original_created_utc": 1643288467,
  "title": "Why do we (in the US) tolerate a government that does not represent us, and does not serve us?",
  "created_utc": 1643310266,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The US Govt - for the most part - does not serve the people, they serve corporations with deep pockets who can lobby for any damned law they want. Our &amp;#39;representatives&amp;#39; do not represent us. They represent our own interests and greed. How long can this continue? How do we make a change? And don&amp;#39;t tell me through voting bc that is a glacially-slow process that won&amp;#39;t make significant change for .. .IDK, 2-3 generations? What do we do NOW to force them to represent US, the way they were meant?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/sdxutv/why_do_we_in_the_us_tolerate_a_government_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "sdxutv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The US Govt - for the most part - does not serve the people, they serve\ncorporations with deep pockets who can lobby for any damned law they want. Our\n'representatives' do not represent us. They represent our own interests and\ngreed. How long can this continue? How do we make a change? And don't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカ政府は、ほとんどの場合、国民に奉仕しているのではなく、国民に奉仕しているのです。\n私腹を肥やす企業は、どんな忌まわしい法律でもロビー活動で求めることができる。私たちの\n代表者」は私たちを代表しているわけではありません。彼らは私たち自身の利益と\n欲に駆られる。いつまでこんなことが続くのでしょうか。どうすれば変えられるのか？そして、しないでください...",
      "title": "なぜ私たち（米国）は、私たちを代表せず、私たちに奉仕しない政府を容認しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国政府--在大多数情况下--并不为人民服务，他们为那些拥有雄厚资金的公司服务。\n他们为那些拥有雄厚资金的公司服务，这些公司可以为他们想要的任何该死的法律进行游说。我们的\n代表 \"并不代表我们。他们代表的是我们自己的利益和\n贪婪。这种情况还能持续多久？我们怎样才能做出改变？而且不要...",
      "title": "为什么我们（在美国）容忍一个不代表我们，也不为我们服务的政府？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國政府--在大多數情況下--並不爲人民服務，他們爲那些擁有雄厚資金的公司服務。\n他們爲那些擁有雄厚資金的公司服務，這些公司可以爲他們想要的任何該死的法律進行遊說。我們的\n代表 \"並不代表我們。他們代表的是我們自己的利益和\n貪婪。這種情況還能持續多久？我們怎樣才能做出改變？而且不要...",
      "title": "爲什麼我們（在美國）容忍一個不代表我們，也不爲我們服務的政府？"
    }
  ]
}