{
  "author": "badbunny9191",
  "original_created_utc": 1659315312,
  "title": "Just got a job where I will work 12+ hours a day of manual labor. Any advice on how to stay mentally sane during long shifts?",
  "created_utc": 1659380244,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m working over the summer, to save money for my next semester of college. The pay is good, but when hours are long, oftentimes over 12 a day. I am used to working the regular 8 hours, but 12 hours of manual labor is going to be new. How can I focus on a task for that long without going crazy?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TrueAskReddit/comments/wd3yre/just_got_a_job_where_i_will_work_12_hours_a_day/",
  "subreddit": "TrueAskReddit",
  "id": "wd3yre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m working over the summer, to save money for my next semester of college. The\npay is good, but when hours are long, oftentimes over 12 a day. I am used to\nworking the regular 8 hours, but 12 hours of manual labor is going to be new.\nHow can I focus on a task for that long without going crazy?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大学の次の学期のためのお金を貯めるために、夏休みに働いているんです。給料は良いのですが\n給料は良いのですが、労働時間が長く、1日に12時間以上働くこともよくあります。私は8時間労働に慣れています。\n8時間労働には慣れていますが、12時間もの肉体労働は初めてです。\nどうしたら、気が狂わない程度に長い時間、作業に集中できるのでしょうか？",
      "title": "1日12時間以上の肉体労働をする仕事に就いたばかり。長時間のシフトの間、精神的に正気を保つ方法について何かアドバイスがあれば教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在暑假期间工作，为大学的下一学期攒钱。工资不错，但工作时间长，经常是每天12小时以上。\n工资很高，但工作时间很长，经常是一天超过12小时。我已经习惯了\n习惯于正常的8小时工作，但12小时的体力劳动将是全新的。\n我怎样才能在这么长的时间里专注于一项工作而不发疯呢？",
      "title": "刚找到一份工作，每天要做12个小时以上的体力劳动。对如何在长班期间保持精神正常有什么建议吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在暑假期間工作，爲大學的下一學期攢錢。工資不錯，但工作時間長，經常是每天12小時以上。\n工資很高，但工作時間很長，經常是一天超過12小時。我已經習慣了\n習慣於正常的8小時工作，但12小時的體力勞動將是全新的。\n我怎樣才能在這麼長的時間裏專注於一項工作而不發瘋呢？",
      "title": "剛找到一份工作，每天要做12個小時以上的體力勞動。對如何在長班期間保持精神正常有什麼建議嗎？"
    }
  ]
}