{
  "author": "Innit4theTech",
  "original_created_utc": 1638039420,
  "title": "Many of us are here for the tech, and not just for a “get rich quick” scheme. The current financial system is a disgrace and Crypto is our only hope to change that.",
  "created_utc": 1638070887,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Of course who doesn’t like money? We all do.</p>\n\n<p>But for me crypto is not just about the money. It’s about doing something good, making the world a better place for our children. </p>\n\n<p>Giving power to the people and not to corrupt governments.</p>\n\n<p>Making managing money simpler and easier. Making transactions smarter and faster. </p>\n\n<p>DeFi, Web 3.0. </p>\n\n<p>There’s so much to crypto than just making money.</p>\n\n<p>If crypto does succeed, it’s most likely going to make us rich. <strong>BUT</strong> that’s not the main priority for me. Crypto has the potential to be an important step in our history, <strong>if</strong> it’s done right!</p>\n\n<p>“I came to crypto for the money, stayed for the tech.”</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/r3k70r/many_of_us_are_here_for_the_tech_and_not_just_for/",
  "subreddit": "CryptoCurrency",
  "id": "r3k70r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Of course who doesn’t like money? We all do.\n\nBut for me crypto is not just about the money. It’s about doing something good,\nmaking the world a better place for our children.\n\nGiving power to the people and not to corrupt governments.\n\nMaking managing money simpler and easier. Making transactions…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もちろん、お金が嫌いな人はいません。みんなそうですよね。\n\nしかし、私にとって暗号はお金だけのものではありません。それは何か良いことをするためです。\n私たちの子供たちのために世界をより良い場所にすることです。\n\n腐敗した政府ではなく、人々に力を与えること。\n\nお金の管理をよりシンプルで簡単にします。取引を...",
      "title": "私たちの多くは技術のためにここにいるのであって、「一攫千金」を狙っているわけではありません。現在の金融システムは恥ずべきものであり、暗号はそれを変えるための唯一の希望なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当然，谁不喜欢钱呢？我们都喜欢。\n\n但对我来说，加密货币不仅仅是为了钱。它是关于做一些好事。\n为我们的孩子创造一个更好的世界。\n\n把权力交给人民，而不是交给腐败的政府。\n\n让资金管理更简单、更容易。让交易...",
      "title": "我们中的许多人是为了技术而来，而不仅仅是为了一个 \"快速致富 \"的计划。目前的金融体系是一种耻辱，而加密货币是我们改变这种状况的唯一希望。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當然，誰不喜歡錢呢？我們都喜歡。\n\n但對我來說，加密貨幣不僅僅是爲了錢。它是關於做一些好事。\n爲我們的孩子創造一個更好的世界。\n\n把權力交給人民，而不是交給腐敗的政府。\n\n讓資金管理更簡單、更容易。讓交易...",
      "title": "我們中的許多人是爲了技術而來，而不僅僅是爲了一個 \"快速致富 \"的計劃。目前的金融體系是一種恥辱，而加密貨幣是我們改變這種狀況的唯一希望。"
    }
  ]
}