{
  "author": "AcroyearOfSPartak",
  "the_new_excerpt": "As I'm sure most of you have heard, AMC stocks soared today, based on news that\nAMC has acquired enough funds to stay afloat \"deep into 2021\" according to an\narticle. They've acquired \"917 million in debt and equity financing.\" During the\nshort interval that the market has been open, I've seen AMC…",
  "original_created_utc": 1611586862,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我相信你们大多数人都听说了，AMC股票今天大涨，原因是有消息说\nAMC已经获得了足够的资金，以维持 \"深陷2021年 \"的局面。\n的文章。他们已经获得了 \"9.17亿的债权和股权融资\"。在这期间。\n市场开盘时间很短，我看到AMC... ...",
      "title": "AMC的好消息"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信你們大多數人都聽說了，AMC股票今天大漲，原因是有消息說\nAMC已經獲得了足夠的資金，以維持 \"深陷2021年 \"的局面。\n的文章。他們已經獲得了 \"9.17億的債權和股權融資\"。在這期間。\n市場開盤時間很短，我看到AMC... ...",
      "title": "AMC的好消息"
    }
  ],
  "title": "Good news from AMC",
  "created_utc": 1611644124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I&#39;m sure most of you have heard, AMC stocks soared today, based on news that AMC has acquired enough funds to stay afloat &quot;deep into 2021&quot; according to an article. They&#39;ve acquired &quot;917 million in debt and equity financing.&quot; During the short interval that the market has been open, I&#39;ve seen AMC fluctuate from 4.60-something to 4.13. Last time it got this high, it ended up hemorrhaging. That was based on the news of a vaccine, if I recall. But perhaps this rise isn&#39;t quite as much a mirage, as it&#39;s actually on the strength not merely of expectations and hopes, but an actual, tangible financial development.</p>\n\n<p>So, what do you all think? Is AMC stock going to soar or at least make a steady turn around? One thing I&#39;ll say is, they need to actually start putting out movies that bring people to the theaters. And hopefully hammer out exclusive deals that don&#39;t involve sharing with streaming platforms. Godzilla vs Kong is on the horizon and perhaps that can rake in some old-fashioned blockbuster numbers. But they need to start putting tushes in seats somehow.</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/investing/comments/l4pidq/good_news_from_amc/",
  "subreddit": "investing",
  "id": "l4pidq",
  "is_self": true,
  "media": null,
  "is_video": false
}