{
  "author": "Gorilladaddy69",
  "original_created_utc": 1649282617,
  "title": "What Were the Extent of Tsar Nicolas II's Atrocities?",
  "created_utc": 1649333659,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have read that pre-1917 Tsarist Russia and Eastern Europe were often horrific places filled with genocidal policies and mass murder, anti-democratic repression and censorship, secret police, and famine. I have read and been told by certain Russians that Tsar Nicolas II upheld jewish segregation and slaughter of hundreds of thousands of them in a brutal campaign, and that it is a &amp;quot;common western myth&amp;quot; that he was a soft-hearted, well-meaning, but clueless man... &lt;strong&gt;Is this accurate?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;What are the extent of his atrocities, and what did the Tsarist political system look like on a deep, systemic level? &lt;strong&gt;I do not care about his, nor his families personal life, nor his quirks or his personality.&lt;/strong&gt; I want the political realities of this authoritarian regime that often goes undiscussed!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/txxjnt/what_were_the_extent_of_tsar_nicolas_iis/",
  "subreddit": "AskHistorians",
  "id": "txxjnt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have read that pre-1917 Tsarist Russia and Eastern Europe were often horrific\nplaces filled with genocidal policies and mass murder, anti-democratic\nrepression and censorship, secret police, and famine. I have read and been told\nby certain Russians that Tsar Nicolas II upheld jewish segregation…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1917年以前のツァーリズム・ロシアや東欧は、しばしば恐ろしいことになったと読んだことがあります。\n大量殺戮政策や大量殺人、反民主主義的な政策に満ちた場所です。\n弾圧と検閲、秘密警察、そして飢饉。私は、次のようなことを読み、聞いたことがあります。\nニコライ2世がユダヤ人の隔離を支持したと、あるロシア人から...",
      "title": "ニコライ2世の残虐行為はどのようなものだったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾读到，1917年以前的沙皇俄国和东欧往往是可怕的\n充满了种族灭绝政策和大规模谋杀、反民主的\n镇压和审查制度、秘密警察和饥荒。我读到过，也被某些俄罗斯人告知\n某些俄罗斯人告诉我，沙皇尼古拉二世支持犹太人的隔离......",
      "title": "沙皇尼古拉二世的暴行有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾讀到，1917年以前的沙皇俄國和東歐往往是可怕的\n充滿了種族滅絕政策和大規模謀殺、反民主的\n鎮壓和審查制度、祕密警察和饑荒。我讀到過，也被某些俄羅斯人告知\n某些俄羅斯人告訴我，沙皇尼古拉二世支持猶太人的隔離......",
      "title": "沙皇尼古拉二世的暴行有多大？"
    }
  ]
}