{
  "author": "Gamewheat",
  "original_created_utc": 1643751884,
  "title": "Should I feel bad because I genuinely want to have kids?",
  "created_utc": 1643766373,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a 16 years old male and I have always thought about having kids ever since I was young. I see so many people my generation talk about not wanting to have kids and it made me feel bad because I fell like the only one in my generation who actually wants to have kids.&lt;/p&gt;\n\n&lt;p&gt;Of course, I perfectly respect their choices and don&amp;#39;t shame them for it, but a part me feel guilty for wanting kids because I feel like I&amp;#39;m pressured into also making the same choice and it&amp;#39;s tearing me apart.&lt;/p&gt;\n\n&lt;p&gt;Plus, they make the argument about how you shouldn&amp;#39;t bring kids into the world because &amp;quot;it has become such a bad and cruel place&amp;quot;, but wasn&amp;#39;t the world just as shitty and cruel when they were born and their parents still choose to have them or am I missing something?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 191,
  "permalink": "/r/TooAfraidToAsk/comments/si6k1t/should_i_feel_bad_because_i_genuinely_want_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "si6k1t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a 16 years old male and I have always thought about having kids ever since\nI was young. I see so many people my generation talk about not wanting to have\nkids and it made me feel bad because I fell like the only one in my generation\nwho actually wants to have kids.\n\nOf course, I perfectly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は16歳の男性で、以前から子供を持つことを考えていました。\n幼い頃。同世代の人たちが「産みたくない」と言うのをよく見かけます。\n同世代で私一人しかいないような気がして嫌な気持ちになりました。\n子供が欲しいと思っている人。\n\nもちろん、私は完璧に...",
      "title": "純粋に子供が欲しいので、悪いと思うべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名16岁的男性，从年轻时起我就一直想着要孩子。\n我还年轻。我看到很多与我同辈的人都在谈论不想生孩子的问题。\n这让我感到很难过，因为我觉得自己是我们这一代人中唯一一个\n真正想生孩子的人。\n\n当然，我完全...",
      "title": "我应该感到难过吗，因为我真的很想有孩子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名16歲的男性，從年輕時起我就一直想着要孩子。\n我還年輕。我看到很多與我同輩的人都在談論不想生孩子的問題。\n這讓我感到很難過，因爲我覺得自己是我們這一代人中唯一一個\n真正想生孩子的人。\n\n當然，我完全...",
      "title": "我應該感到難過嗎，因爲我真的很想有孩子？"
    }
  ]
}