{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "",
  "user_reports": [],
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "8 Reasons To Never Bet Against the US",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_toy1r8",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.74,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 18,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "author_fullname": "t2_l8x2d2q",
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Articles &amp; Resources",
  "can_mod_post": false,
  "score": 18,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": false,
  "mod_note": null,
  "crosspost_parent_list": [
    {
      "approved_at_utc": null,
      "subreddit": "stocks",
      "selftext": "#Intro\n\nI’m going to outline 8 reasons why I believe the US remains the best place in the world to invest. This will cover culture, future projections, economic sectors, and international relations. This is going to try to remain as factual as possible with all information sited. Each of these bullet points is going to be generally stating why the US markets have an advantage over other developed markets like Europe and Japan or an advantage over developing markets such as China and India. [This is the theory behind the strategy that I run]( https://www.reddit.com/r/FinancialAnalysis/comments/ry1qq5/efficient_leveraged_portfolios/) and suggest to people to best take advantage of this market.\n\n###More Investors\n * In the United States if you want to retire well off you need to be invested in all non-outlier cases. Some people chose real estate, but stocks are far more popular. About [5 percent of people own a second property]( https://eyeonhousing.org/2020/10/nations-stock-of-second-homes-2/) which I’m using as a rough proxy for how many people would be considered real estate investors. The point is that it’s a very low number. To contrast this between [52]( https://www.pewresearch.org/fact-tank/2020/03/25/more-than-half-of-u-s-households-have-some-investment-in-the-stock-market/) and [56]( https://news.gallup.com/poll/266807/percentage-americans-owns-stock.aspx) percent of people are invested in the stock market. Social security exists as a safety net, but it will barely keep you out of poverty. In the 1980’s [60% of workers had a defined benefit pension. This is down to just 4% now.]( https://money.cnn.com/retirement/guide/pensions_basics.moneymag/index7.htm) This means that if a majority of people currently working want to retire comfortably, they need the market to do well. This is a bullish sign for the market for two main reasons. The first is that most of these people are adding a portion of their paycheck to various index funds every other week. These massive monetary inflows create a permanent upward pressure on the market. The second reason is less direct, but due to the scale of the incentive for the market to do well, laws, regulations, and interest rates are all going to be biased in favor of the market. This explains a reason why the US market should trend up, but why should it trend up faster than other markets? The answer is that the percentage of people who invest in other countries is far smaller. [15% of people in Germany, 17% of people in the Netherlands, 33% of people in the UK]( https://money.cnn.com/retirement/guide/pensions_basics.moneymag/index7.htm), and [only 7% of people in China]( https://www.thebalance.com/china-stock-market-shanghai-shenzhen-hong-kong-3305480#:~:text=Only%207%20percent%20of%20China's,swings%20in%20China's%20stock%20market.&amp;text=In%20China%2C%20less%20than%2020,is%20in%20the%20stock%20market.) hold stocks. This means the inflows to their markets are smaller and the incentive to favor the market in their national policies is weaker. This is only one of many factors that influence market movements.\n\n###High Consumer Spending\n * In the United States people are incredibly fond of spending. It’s quite straightforward that a lot of spending means a lot of money flowing into businesses. These elevated cashflows directly lead to increased stock prices. Now of course not all companies only do business in their home country, but that’s where most of their revenue typically comes from. The way I decided to compare this with other countries spending is by looking at [household consumption as a percent of GDP]( https://www.theglobaleconomy.com/rankings/consumption_GDP/#:~:text=Household%20consumption%20is%20about%2060,over%2080%20percent%20of%20GDP.). The US is not at the top of the list, but it is significantly higher than most of its wealthy peers. 68% of US GDP comes from household consumption compared to 52% in Japan or 51% in the EU. You can also see the [sheer scale of US consumer spending when it’s displayed nominally]( https://www.theglobaleconomy.com/rankings/household_consumption_dollars/). The people of the US spend 7x as much as the people of Germany, even though the US only has a bit over 3x the people. \n\n###Low (Enough) Corruption\n * Despite all of the issues you see on the news about the US government and its politicians, it’s a relatively uncorrupted country. [While it scores far from the top on the control of corruption index]( https://www.theglobaleconomy.com/rankings/wb_corruption/) the idea is that it’s more than good enough to invest in. The main point is that it ranks far above most major developing countries that could in theory outgrow the US markets in the next couple decades such as Brazil, India, and China. Despite these countries generally having higher annual GDP growth, their uncertainty and inconsistency when it comes to investing scares away a lot of potential money. This gives the US markets an advantage over most developing markets but doesn’t provide any advantage over Europe for this point. \n\n###Past Performance Indicates Future Performance\n * Everyone has heard that past performance doesn’t guarantee future results, but guarantee is the problem word there. Nothing in the market is guaranteed, but the past is still a fantastic indictor of what we can expect in the future, broadly speaking. US markets have grown at an average rate of 5-10% annually for many decades depending on what time frame you look at. This is not as true for other developed economies. Over the past 25 years the US [has returned 50% more on average annually]( http://www.lazyportfolioetf.com/comparison/european-stocks-vs-us-stocks/) than a comparable portfolio of European stocks. The time frame is somewhat restrained by the data available in some emerging countries such as Brazil and India who both only got stable exchanges in the 1990’s. This is still far enough back to cover multiple business cycles and generally give an idea of expected returns. Over the same time frame [emerging markets returned a very similar amount]( http://www.lazyportfolioetf.com/allocation/emerging-markets/) to their European counterparts. Of course the future could be very different, but past performance suggests that the US has the right combination of traits to be the most successful market and most of those traits likely remain. \n\n###Continued Population Growth\n * One of the biggest long run concerns of investors is that population growth is stagnating or even dropping in the most developed countries. The last hundred years of growth have been greatly assisted by an ever increasing population. Japan’s stock market is famously very flat. It remains [below it’s high that was achieved in the 1990s]( https://tradingeconomics.com/japan/stock-market). There are a variety of reasons for this but one of the major concerns with the country is that there population has appeared to peak and has been slowly trending down since 2010. Estimates project that they will fall from 126 million to 75 million by 2100. [The EU faces a similar issue]( https://ec.europa.eu/eurostat/web/products-eurostat-news/-/DDN-20190710-1). They are projected to fall from 450 million to 416 million by 2100. This is where the US completely stands out from the rest of the developed world. The US is [projected to increase in population from 330 million to 430 million]( https://en.wikipedia.org/wiki/Projections_of_population_growth) in this same time frame. This growth rate is on par with many developing countries and far ahead of ones like China and Brazil who are expected to shrink. I can’t state strongly enough how much of a comparative boost this will provide the US. I also want to point out that most of this growth is expected to come from immigration as our birth rates aren’t that much different than Europe. \n\n###Global Reserve Currency\n * The USD is what is known as the global reserve currency. Central banks around the world hold significant amounts of foreign currency for a variety of reasons. These include the ability to stabilize your own currency against another, facilitate international trade, and to provide protection in case of market shocks. It makes sense that other countries would hold something they think is stable, useful, and commonly accepted. The USD is this currency more often than not making up [59% of all foreign reserves]( https://blogs.imf.org/2021/05/05/us-dollar-share-of-global-foreign-exchange-reserves-drops-to-25-year-low/). It cannot be understated how powerful of an economic tool this is. We have just seen this in action when sanctions were placed on Russia. The US government [has frozen more than half a trillion in Russian reserves]( https://www.nytimes.com/2022/02/28/us/politics/us-sanctions-russia-central-bank.html). Another example of this being used was in 2020 when the US created trillions of new dollars. This increase in money supply was not only born by US citizens. It was absorbed globally due to the extensive currency reserves. Why does this give US markets an advantage? It provides the country as a whole with a powerful weapon that can be used to push the world into a more favorable position. It means the US can use QE to escape recession more effective than any other country, on paper at least. Lastly, it makes foreign trade incredibly easy. All of these are pieces that provide better economic conditions than their competitors can create. \n\n###Military Dominance\n * It’s no secret that the US spends a lot on its military. The scale is sometimes lost on people though because there’s a huge difference between being the biggest, and [being larger than the next nine combined]( https://www.visualcapitalist.com/u-s-military-spending-vs-other-top-countries/). This military dominance is tremendously beneficial to the overall health of the economy for a couple of reasons. The first is that it provides an incredibly safe place to do business. People are hesitant about doing business in a country that has even a tiny threat of being invaded. An example that’s frequently talked about on Reddit is the possible risk of investing in Taiwan due to its proximity and scale compared to China. The US has both an ocean and the worlds largest military separating it from any hostile powers. Notice how even though Germany wasn’t attacked by Russia last month, there was still [substantial fear]( https://tradingeconomics.com/germany/stock-market) in their financial markets, though a large portion of this was related to energy fears - another issue the US outperforms in. People might mention that nuclear weapons could reach the US from just about anywhere, but I consider that a non-point. The minute nukes start flying the minute your money doesn’t mean anything anymore. There’s also an economic side to the military that can be broken into two parts. The first is that that 800 billion dollar budget needs to be spent somewhere and that somewhere is in the US economy. In the latest budget [a staggering 130 billion is allocated to research and development]( https://www.bloomberg.com/news/articles/2022-03-23/white-house-to-seek-813-3-billion-national-security-budget), as an example. A secondary economic factor is that this military power allows the US to provide the same protection it provides itself to its allies. Groups like NATO have a “common defense clause” that basically say if you attack any member you have attacked all of the members. So even though a country like Iceland [doesn’t have a military]( https://www.nato.int/cps/en/natohq/declassified_162083.htm#:~:text=Iceland%20is%20the%20only%20Ally,the%20Alliance%20until%20the%201990s.) it is still quite safe from invasion because no one wants to go to war with the rest of the pact. Having these safe allies provides both a great place to do business, which leads to economics and trade growth. \n\n###Key Industry Dominance\n * Lastly, the US has economic dominance in two of the world’s most crucial industries, energy and technology. The US [is the world’s largest oil producer]( https://www.eia.gov/tools/faqs/faq.php?id=709&amp;t=6) which drastically reduces their reliance on hostile foreign governments. This doesn’t mean that the country is immune to changes in the global price of oil, but it does offer comparative lower prices [than most of their developed competitors]( https://www.theglobaleconomy.com/rankings/gasoline_prices/). It also provides some security if the world enters into a depression or becomes more fractured. On a more abstract note, the US is also the [global leader in technological development]( https://info.kpmg.us/news-perspectives/technology-innovation/us-extends-tech-innovation-leadership.html#:~:text=China%20is%20close%20behind%20but,Silicon%20Valley%20are%20rising%20fast.&amp;text=More%20than%20a%20third%20of,2018%20global%20technology%20innovation%20survey.). Technology is the backbone of the economy and being one step ahead of the rest of the world is an incredible advantage. A huge number of the worlds most advanced projects and highest potential innovations are being done by US based tech companies and this is unlikely to change anytime soon. While China is ranked #2 and gaining ground, this is not as significant as it may seem. China is not investor friendly and is unlikely to change that. Investor money is still going to flow to the US for the foreseeable future. \n\n#Conclusion\n\nThis has been a **BULL** case for the united states. There are currently no intentions to write a bear case as most of the points are simply going to be the inverse of the ones stated here. The goal of this post is to highlight why I believe the US, despite the last decade of massive growth, is still the worlds best place to invest and will remain so for the foreseeable future. If you want to refute one of the points please, I beg you, back up what you say with reputable sources. One thing I want to note is that just because a company is US based, that doesn’t mean those companies have a strictly US based revenue stream. Most of the massive companies that drive the market’s growth are international. If the US goes into a deep recession, most of the world will also likely go into a deep recession. There are benefits to diversification but adding more to a portfolio does not always make it better!\n\n#TLDR\nThe US’s excess growth compared to other developed countries is not an anomaly. The US is highly unlikely to follow in the footsteps of countries like Japan. There are numerous factors that drove our growth that still exist and will continue to exist for the foreseeable future.",
      "author_fullname": "t2_dknszabo",
      "saved": false,
      "mod_reason_title": null,
      "gilded": 0,
      "clicked": false,
      "title": "8 Reasons To Never Bet Against the US",
      "link_flair_richtext": [],
      "subreddit_name_prefixed": "r/stocks",
      "hidden": false,
      "pwls": 6,
      "link_flair_css_class": "advice",
      "downs": 0,
      "top_awarded_type": null,
      "hide_score": false,
      "name": "t3_toarrz",
      "quarantine": false,
      "link_flair_text_color": "light",
      "upvote_ratio": 0.83,
      "author_flair_background_color": null,
      "subreddit_type": "public",
      "ups": 469,
      "total_awards_received": 3,
      "media_embed": {},
      "author_flair_template_id": null,
      "is_original_content": false,
      "user_reports": [],
      "secure_media": null,
      "is_reddit_media_domain": false,
      "is_meta": false,
      "category": null,
      "secure_media_embed": {},
      "link_flair_text": "Advice",
      "can_mod_post": false,
      "score": 469,
      "approved_by": null,
      "is_created_from_ads_ui": false,
      "author_premium": true,
      "thumbnail": "",
      "edited": 1648314336,
      "author_flair_css_class": null,
      "author_flair_richtext": [],
      "gildings": {
        "gid_1": 1
      },
      "content_categories": null,
      "is_self": true,
      "mod_note": null,
      "created": 1648258133,
      "link_flair_type": "text",
      "wls": 6,
      "removed_by_category": null,
      "banned_by": null,
      "author_flair_type": "text",
      "domain": "self.stocks",
      "allow_live_comments": false,
      "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Intro&lt;/h1&gt;\n\n&lt;p&gt;I’m going to outline 8 reasons why I believe the US remains the best place in the world to invest. This will cover culture, future projections, economic sectors, and international relations. This is going to try to remain as factual as possible with all information sited. Each of these bullet points is going to be generally stating why the US markets have an advantage over other developed markets like Europe and Japan or an advantage over developing markets such as China and India. &lt;a href=\"https://www.reddit.com/r/FinancialAnalysis/comments/ry1qq5/efficient_leveraged_portfolios/\"&gt;This is the theory behind the strategy that I run&lt;/a&gt; and suggest to people to best take advantage of this market.&lt;/p&gt;\n\n&lt;h3&gt;More Investors&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;In the United States if you want to retire well off you need to be invested in all non-outlier cases. Some people chose real estate, but stocks are far more popular. About &lt;a href=\"https://eyeonhousing.org/2020/10/nations-stock-of-second-homes-2/\"&gt;5 percent of people own a second property&lt;/a&gt; which I’m using as a rough proxy for how many people would be considered real estate investors. The point is that it’s a very low number. To contrast this between &lt;a href=\"https://www.pewresearch.org/fact-tank/2020/03/25/more-than-half-of-u-s-households-have-some-investment-in-the-stock-market/\"&gt;52&lt;/a&gt; and &lt;a href=\"https://news.gallup.com/poll/266807/percentage-americans-owns-stock.aspx\"&gt;56&lt;/a&gt; percent of people are invested in the stock market. Social security exists as a safety net, but it will barely keep you out of poverty. In the 1980’s &lt;a href=\"https://money.cnn.com/retirement/guide/pensions_basics.moneymag/index7.htm\"&gt;60% of workers had a defined benefit pension. This is down to just 4% now.&lt;/a&gt; This means that if a majority of people currently working want to retire comfortably, they need the market to do well. This is a bullish sign for the market for two main reasons. The first is that most of these people are adding a portion of their paycheck to various index funds every other week. These massive monetary inflows create a permanent upward pressure on the market. The second reason is less direct, but due to the scale of the incentive for the market to do well, laws, regulations, and interest rates are all going to be biased in favor of the market. This explains a reason why the US market should trend up, but why should it trend up faster than other markets? The answer is that the percentage of people who invest in other countries is far smaller. &lt;a href=\"https://money.cnn.com/retirement/guide/pensions_basics.moneymag/index7.htm\"&gt;15% of people in Germany, 17% of people in the Netherlands, 33% of people in the UK&lt;/a&gt;, and &lt;a href=\"https://www.thebalance.com/china-stock-market-shanghai-shenzhen-hong-kong-3305480#:%7E:text=Only%207%20percent%20of%20China&amp;#x27;s,swings%20in%20China&amp;#x27;s%20stock%20market.&amp;amp;text=In%20China%2C%20less%20than%2020,is%20in%20the%20stock%20market.\"&gt;only 7% of people in China&lt;/a&gt; hold stocks. This means the inflows to their markets are smaller and the incentive to favor the market in their national policies is weaker. This is only one of many factors that influence market movements.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;High Consumer Spending&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;In the United States people are incredibly fond of spending. It’s quite straightforward that a lot of spending means a lot of money flowing into businesses. These elevated cashflows directly lead to increased stock prices. Now of course not all companies only do business in their home country, but that’s where most of their revenue typically comes from. The way I decided to compare this with other countries spending is by looking at &lt;a href=\"https://www.theglobaleconomy.com/rankings/consumption_GDP/#:%7E:text=Household%20consumption%20is%20about%2060,over%2080%20percent%20of%20GDP.\"&gt;household consumption as a percent of GDP&lt;/a&gt;. The US is not at the top of the list, but it is significantly higher than most of its wealthy peers. 68% of US GDP comes from household consumption compared to 52% in Japan or 51% in the EU. You can also see the &lt;a href=\"https://www.theglobaleconomy.com/rankings/household_consumption_dollars/\"&gt;sheer scale of US consumer spending when it’s displayed nominally&lt;/a&gt;. The people of the US spend 7x as much as the people of Germany, even though the US only has a bit over 3x the people. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Low (Enough) Corruption&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Despite all of the issues you see on the news about the US government and its politicians, it’s a relatively uncorrupted country. &lt;a href=\"https://www.theglobaleconomy.com/rankings/wb_corruption/\"&gt;While it scores far from the top on the control of corruption index&lt;/a&gt; the idea is that it’s more than good enough to invest in. The main point is that it ranks far above most major developing countries that could in theory outgrow the US markets in the next couple decades such as Brazil, India, and China. Despite these countries generally having higher annual GDP growth, their uncertainty and inconsistency when it comes to investing scares away a lot of potential money. This gives the US markets an advantage over most developing markets but doesn’t provide any advantage over Europe for this point. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Past Performance Indicates Future Performance&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Everyone has heard that past performance doesn’t guarantee future results, but guarantee is the problem word there. Nothing in the market is guaranteed, but the past is still a fantastic indictor of what we can expect in the future, broadly speaking. US markets have grown at an average rate of 5-10% annually for many decades depending on what time frame you look at. This is not as true for other developed economies. Over the past 25 years the US &lt;a href=\"http://www.lazyportfolioetf.com/comparison/european-stocks-vs-us-stocks/\"&gt;has returned 50% more on average annually&lt;/a&gt; than a comparable portfolio of European stocks. The time frame is somewhat restrained by the data available in some emerging countries such as Brazil and India who both only got stable exchanges in the 1990’s. This is still far enough back to cover multiple business cycles and generally give an idea of expected returns. Over the same time frame &lt;a href=\"http://www.lazyportfolioetf.com/allocation/emerging-markets/\"&gt;emerging markets returned a very similar amount&lt;/a&gt; to their European counterparts. Of course the future could be very different, but past performance suggests that the US has the right combination of traits to be the most successful market and most of those traits likely remain. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Continued Population Growth&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;One of the biggest long run concerns of investors is that population growth is stagnating or even dropping in the most developed countries. The last hundred years of growth have been greatly assisted by an ever increasing population. Japan’s stock market is famously very flat. It remains &lt;a href=\"https://tradingeconomics.com/japan/stock-market\"&gt;below it’s high that was achieved in the 1990s&lt;/a&gt;. There are a variety of reasons for this but one of the major concerns with the country is that there population has appeared to peak and has been slowly trending down since 2010. Estimates project that they will fall from 126 million to 75 million by 2100. &lt;a href=\"https://ec.europa.eu/eurostat/web/products-eurostat-news/-/DDN-20190710-1\"&gt;The EU faces a similar issue&lt;/a&gt;. They are projected to fall from 450 million to 416 million by 2100. This is where the US completely stands out from the rest of the developed world. The US is &lt;a href=\"https://en.wikipedia.org/wiki/Projections_of_population_growth\"&gt;projected to increase in population from 330 million to 430 million&lt;/a&gt; in this same time frame. This growth rate is on par with many developing countries and far ahead of ones like China and Brazil who are expected to shrink. I can’t state strongly enough how much of a comparative boost this will provide the US. I also want to point out that most of this growth is expected to come from immigration as our birth rates aren’t that much different than Europe. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Global Reserve Currency&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The USD is what is known as the global reserve currency. Central banks around the world hold significant amounts of foreign currency for a variety of reasons. These include the ability to stabilize your own currency against another, facilitate international trade, and to provide protection in case of market shocks. It makes sense that other countries would hold something they think is stable, useful, and commonly accepted. The USD is this currency more often than not making up &lt;a href=\"https://blogs.imf.org/2021/05/05/us-dollar-share-of-global-foreign-exchange-reserves-drops-to-25-year-low/\"&gt;59% of all foreign reserves&lt;/a&gt;. It cannot be understated how powerful of an economic tool this is. We have just seen this in action when sanctions were placed on Russia. The US government &lt;a href=\"https://www.nytimes.com/2022/02/28/us/politics/us-sanctions-russia-central-bank.html\"&gt;has frozen more than half a trillion in Russian reserves&lt;/a&gt;. Another example of this being used was in 2020 when the US created trillions of new dollars. This increase in money supply was not only born by US citizens. It was absorbed globally due to the extensive currency reserves. Why does this give US markets an advantage? It provides the country as a whole with a powerful weapon that can be used to push the world into a more favorable position. It means the US can use QE to escape recession more effective than any other country, on paper at least. Lastly, it makes foreign trade incredibly easy. All of these are pieces that provide better economic conditions than their competitors can create. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Military Dominance&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;It’s no secret that the US spends a lot on its military. The scale is sometimes lost on people though because there’s a huge difference between being the biggest, and &lt;a href=\"https://www.visualcapitalist.com/u-s-military-spending-vs-other-top-countries/\"&gt;being larger than the next nine combined&lt;/a&gt;. This military dominance is tremendously beneficial to the overall health of the economy for a couple of reasons. The first is that it provides an incredibly safe place to do business. People are hesitant about doing business in a country that has even a tiny threat of being invaded. An example that’s frequently talked about on Reddit is the possible risk of investing in Taiwan due to its proximity and scale compared to China. The US has both an ocean and the worlds largest military separating it from any hostile powers. Notice how even though Germany wasn’t attacked by Russia last month, there was still &lt;a href=\"https://tradingeconomics.com/germany/stock-market\"&gt;substantial fear&lt;/a&gt; in their financial markets, though a large portion of this was related to energy fears - another issue the US outperforms in. People might mention that nuclear weapons could reach the US from just about anywhere, but I consider that a non-point. The minute nukes start flying the minute your money doesn’t mean anything anymore. There’s also an economic side to the military that can be broken into two parts. The first is that that 800 billion dollar budget needs to be spent somewhere and that somewhere is in the US economy. In the latest budget &lt;a href=\"https://www.bloomberg.com/news/articles/2022-03-23/white-house-to-seek-813-3-billion-national-security-budget\"&gt;a staggering 130 billion is allocated to research and development&lt;/a&gt;, as an example. A secondary economic factor is that this military power allows the US to provide the same protection it provides itself to its allies. Groups like NATO have a “common defense clause” that basically say if you attack any member you have attacked all of the members. So even though a country like Iceland &lt;a href=\"https://www.nato.int/cps/en/natohq/declassified_162083.htm#:%7E:text=Iceland%20is%20the%20only%20Ally,the%20Alliance%20until%20the%201990s.\"&gt;doesn’t have a military&lt;/a&gt; it is still quite safe from invasion because no one wants to go to war with the rest of the pact. Having these safe allies provides both a great place to do business, which leads to economics and trade growth. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h3&gt;Key Industry Dominance&lt;/h3&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Lastly, the US has economic dominance in two of the world’s most crucial industries, energy and technology. The US &lt;a href=\"https://www.eia.gov/tools/faqs/faq.php?id=709&amp;amp;t=6\"&gt;is the world’s largest oil producer&lt;/a&gt; which drastically reduces their reliance on hostile foreign governments. This doesn’t mean that the country is immune to changes in the global price of oil, but it does offer comparative lower prices &lt;a href=\"https://www.theglobaleconomy.com/rankings/gasoline_prices/\"&gt;than most of their developed competitors&lt;/a&gt;. It also provides some security if the world enters into a depression or becomes more fractured. On a more abstract note, the US is also the &lt;a href=\"https://info.kpmg.us/news-perspectives/technology-innovation/us-extends-tech-innovation-leadership.html#:%7E:text=China%20is%20close%20behind%20but,Silicon%20Valley%20are%20rising%20fast.&amp;amp;text=More%20than%20a%20third%20of,2018%20global%20technology%20innovation%20survey.\"&gt;global leader in technological development&lt;/a&gt;. Technology is the backbone of the economy and being one step ahead of the rest of the world is an incredible advantage. A huge number of the worlds most advanced projects and highest potential innovations are being done by US based tech companies and this is unlikely to change anytime soon. While China is ranked #2 and gaining ground, this is not as significant as it may seem. China is not investor friendly and is unlikely to change that. Investor money is still going to flow to the US for the foreseeable future. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;h1&gt;Conclusion&lt;/h1&gt;\n\n&lt;p&gt;This has been a &lt;strong&gt;BULL&lt;/strong&gt; case for the united states. There are currently no intentions to write a bear case as most of the points are simply going to be the inverse of the ones stated here. The goal of this post is to highlight why I believe the US, despite the last decade of massive growth, is still the worlds best place to invest and will remain so for the foreseeable future. If you want to refute one of the points please, I beg you, back up what you say with reputable sources. One thing I want to note is that just because a company is US based, that doesn’t mean those companies have a strictly US based revenue stream. Most of the massive companies that drive the market’s growth are international. If the US goes into a deep recession, most of the world will also likely go into a deep recession. There are benefits to diversification but adding more to a portfolio does not always make it better!&lt;/p&gt;\n\n&lt;h1&gt;TLDR&lt;/h1&gt;\n\n&lt;p&gt;The US’s excess growth compared to other developed countries is not an anomaly. The US is highly unlikely to follow in the footsteps of countries like Japan. There are numerous factors that drove our growth that still exist and will continue to exist for the foreseeable future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
      "likes": null,
      "suggested_sort": "confidence",
      "banned_at_utc": null,
      "view_count": null,
      "archived": false,
      "no_follow": false,
      "is_crosspostable": false,
      "pinned": false,
      "over_18": false,
      "all_awardings": [
        {
          "giver_coin_reward": null,
          "subreddit_id": null,
          "is_new": false,
          "days_of_drip_extension": null,
          "coin_price": 30,
          "id": "award_a2506925-fc82-4d6c-ae3b-b7217e09d7f0",
          "penny_donate": null,
          "award_sub_type": "PREMIUM",
          "coin_reward": 0,
          "icon_url": "https://i.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png",
          "days_of_premium": null,
          "tiers_by_required_awardings": null,
          "resized_icons": [
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=16&amp;height=16&amp;auto=webp&amp;s=4e475e8c3265ec7148d7f4204f07d33949482f21",
              "width": 16,
              "height": 16
            },
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=32&amp;height=32&amp;auto=webp&amp;s=42e32a4b9f1e70791716c3be283e89951e212a69",
              "width": 32,
              "height": 32
            },
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=48&amp;height=48&amp;auto=webp&amp;s=5adb621fede4e8e66b952a379ad038fcc1b8ad13",
              "width": 48,
              "height": 48
            },
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=64&amp;height=64&amp;auto=webp&amp;s=6161edea19569bbee73ef322a2e5470535ec1787",
              "width": 64,
              "height": 64
            },
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=128&amp;height=128&amp;auto=webp&amp;s=5d2c75f44f176f430e936204f9a53b8a2957f2fc",
              "width": 128,
              "height": 128
            }
          ],
          "icon_width": 2048,
          "static_icon_width": 2048,
          "start_date": null,
          "is_enabled": true,
          "awardings_required_to_grant_benefits": null,
          "description": "A golden splash of respect",
          "end_date": null,
          "subreddit_coin_reward": 0,
          "count": 1,
          "static_icon_height": 2048,
          "name": "Narwhal Salute",
          "resized_static_icons": [
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=16&amp;height=16&amp;auto=webp&amp;s=4e475e8c3265ec7148d7f4204f07d33949482f21",
              "width": 16,
              "height": 16
            },
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=32&amp;height=32&amp;auto=webp&amp;s=42e32a4b9f1e70791716c3be283e89951e212a69",
              "width": 32,
              "height": 32
            },
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=48&amp;height=48&amp;auto=webp&amp;s=5adb621fede4e8e66b952a379ad038fcc1b8ad13",
              "width": 48,
              "height": 48
            },
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=64&amp;height=64&amp;auto=webp&amp;s=6161edea19569bbee73ef322a2e5470535ec1787",
              "width": 64,
              "height": 64
            },
            {
              "url": "https://preview.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png?width=128&amp;height=128&amp;auto=webp&amp;s=5d2c75f44f176f430e936204f9a53b8a2957f2fc",
              "width": 128,
              "height": 128
            }
          ],
          "icon_format": null,
          "icon_height": 2048,
          "penny_price": null,
          "award_type": "global",
          "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/80j20o397jj41_NarwhalSalute.png"
        },
        {
          "giver_coin_reward": null,
          "subreddit_id": null,
          "is_new": false,
          "days_of_drip_extension": null,
          "coin_price": 100,
          "id": "gid_1",
          "penny_donate": null,
          "award_sub_type": "GLOBAL",
          "coin_reward": 0,
          "icon_url": "https://www.redditstatic.com/gold/awards/icon/silver_512.png",
          "days_of_premium": null,
          "tiers_by_required_awardings": null,
          "resized_icons": [
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_16.png",
              "width": 16,
              "height": 16
            },
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_32.png",
              "width": 32,
              "height": 32
            },
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_48.png",
              "width": 48,
              "height": 48
            },
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_64.png",
              "width": 64,
              "height": 64
            },
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_128.png",
              "width": 128,
              "height": 128
            }
          ],
          "icon_width": 512,
          "static_icon_width": 512,
          "start_date": null,
          "is_enabled": true,
          "awardings_required_to_grant_benefits": null,
          "description": "Shows the Silver Award... and that's it.",
          "end_date": null,
          "subreddit_coin_reward": 0,
          "count": 1,
          "static_icon_height": 512,
          "name": "Silver",
          "resized_static_icons": [
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_16.png",
              "width": 16,
              "height": 16
            },
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_32.png",
              "width": 32,
              "height": 32
            },
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_48.png",
              "width": 48,
              "height": 48
            },
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_64.png",
              "width": 64,
              "height": 64
            },
            {
              "url": "https://www.redditstatic.com/gold/awards/icon/silver_128.png",
              "width": 128,
              "height": 128
            }
          ],
          "icon_format": null,
          "icon_height": 512,
          "penny_price": null,
          "award_type": "global",
          "static_icon_url": "https://www.redditstatic.com/gold/awards/icon/silver_512.png"
        },
        {
          "giver_coin_reward": null,
          "subreddit_id": null,
          "is_new": false,
          "days_of_drip_extension": null,
          "coin_price": 50,
          "id": "award_02d9ab2c-162e-4c01-8438-317a016ed3d9",
          "penny_donate": null,
          "award_sub_type": "GLOBAL",
          "coin_reward": 0,
          "icon_url": "https://i.redd.it/award_images/t5_q0gj4/p4yzxkaed5f61_oldtakemyenergy.png",
          "days_of_premium": null,
          "tiers_by_required_awardings": null,
          "resized_icons": [
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/p4yzxkaed5f61_oldtakemyenergy.png?width=16&amp;height=16&amp;auto=webp&amp;s=10034f3fdf8214c8377134bb60c5b832d4bbf588",
              "width": 16,
              "height": 16
            },
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/p4yzxkaed5f61_oldtakemyenergy.png?width=32&amp;height=32&amp;auto=webp&amp;s=100f785bf261fa9452a5d82ee0ef0793369dbfa5",
              "width": 32,
              "height": 32
            },
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/p4yzxkaed5f61_oldtakemyenergy.png?width=48&amp;height=48&amp;auto=webp&amp;s=b15d030fdfbbe4af4a5b34ab9dc90a174df40a23",
              "width": 48,
              "height": 48
            },
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/p4yzxkaed5f61_oldtakemyenergy.png?width=64&amp;height=64&amp;auto=webp&amp;s=601c75be6ee30dc4b47a5c65d64dea9a185502a1",
              "width": 64,
              "height": 64
            },
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/p4yzxkaed5f61_oldtakemyenergy.png?width=128&amp;height=128&amp;auto=webp&amp;s=540f36e65c0e2f1347fe32020e4a1565e3680437",
              "width": 128,
              "height": 128
            }
          ],
          "icon_width": 2048,
          "static_icon_width": 2048,
          "start_date": null,
          "is_enabled": true,
          "awardings_required_to_grant_benefits": null,
          "description": "I'm in this with you.",
          "end_date": null,
          "subreddit_coin_reward": 0,
          "count": 1,
          "static_icon_height": 2048,
          "name": "Take My Energy",
          "resized_static_icons": [
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=16&amp;height=16&amp;auto=webp&amp;s=045db73f47a9513c44823d132b4c393ab9241b6a",
              "width": 16,
              "height": 16
            },
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=32&amp;height=32&amp;auto=webp&amp;s=298a02e0edbb5b5e293087eeede63802cbe1d2c7",
              "width": 32,
              "height": 32
            },
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=48&amp;height=48&amp;auto=webp&amp;s=7d06d606eb23dbcd6dbe39ee0e60588c5eb89065",
              "width": 48,
              "height": 48
            },
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=64&amp;height=64&amp;auto=webp&amp;s=ecd9854b14104a36a210028c43420f0dababd96b",
              "width": 64,
              "height": 64
            },
            {
              "url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=128&amp;height=128&amp;auto=webp&amp;s=0d5d7b92c1d66aff435f2ad32e6330ca2b971f6d",
              "width": 128,
              "height": 128
            }
          ],
          "icon_format": "PNG",
          "icon_height": 2048,
          "penny_price": 0,
          "award_type": "global",
          "static_icon_url": "https://i.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png"
        }
      ],
      "awarders": [],
      "media_only": false,
      "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
      "can_gild": false,
      "spoiler": false,
      "locked": false,
      "author_flair_text": null,
      "treatment_tags": [],
      "visited": false,
      "removed_by": null,
      "num_reports": null,
      "distinguished": null,
      "subreddit_id": "t5_2qjfk",
      "author_is_blocked": false,
      "mod_reason_by": null,
      "removal_reason": null,
      "link_flair_background_color": "#646d73",
      "id": "toarrz",
      "is_robot_indexable": true,
      "report_reasons": null,
      "author": "Market_Madness",
      "discussion_type": null,
      "num_comments": 515,
      "send_replies": true,
      "whitelist_status": "all_ads",
      "contest_mode": false,
      "mod_reports": [],
      "author_patreon_flair": false,
      "author_flair_text_color": null,
      "permalink": "/r/stocks/comments/toarrz/8_reasons_to_never_bet_against_the_us/",
      "parent_whitelist_status": "all_ads",
      "stickied": false,
      "url": "https://www.reddit.com/r/stocks/comments/toarrz/8_reasons_to_never_bet_against_the_us/",
      "subreddit_subscribers": 3792514,
      "created_utc": 1648258133,
      "num_crossposts": 1,
      "media": null,
      "is_video": false
    }
  ],
  "created": 1648314522,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": null,
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "url_overridden_by_dest": "/r/stocks/comments/toarrz/8_reasons_to_never_bet_against_the_us/",
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "cc31739e-6c0e-11ec-a019-9eae049f0f7d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ff4500",
  "id": "toy1r8",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "DexterTwerp",
  "discussion_type": null,
  "num_comments": 17,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "crosspost_parent": "t3_toarrz",
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/toy1r8/8_reasons_to_never_bet_against_the_us/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "/r/stocks/comments/toarrz/8_reasons_to_never_bet_against_the_us/",
  "subreddit_subscribers": 150567,
  "created_utc": 1648331166,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1648314522,
  "the_new_excerpt": ""
}