{
  "author": "Fantastic-Cucumber-1",
  "the_new_excerpt": "DeFi had recently breached a new milestone: after breaking $100 billion TVL, it\nmanaged to be the equivalent of a top 40 U.S. bank. New investors are moving\ntheir assets to DeFi on a daily basis. And at the time of writing, lending and\nborrowing platforms are becoming widely popular. Which brings us…",
  "original_created_utc": 1618037763,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DeFiは、TVL1,000億ドルを突破した後、新たなマイルストーンを達成しました。\nTVL1,000億ドルを突破したDeFiは、米国のトップ40銀行に匹敵する規模になりました。毎日のように新しい投資家が\n毎日のように新しい投資家がDeFiに資産を移している。そして、この記事を書いている時点では、貸し出しと借り入れが\n借り入れのプラットフォームが広く普及している。それは私たちに...",
      "title": "DeFiの説明。貸し出しと借り入れ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，DeFi又突破了一个新的里程碑：在TVL突破1000亿美元后，其\n管理，相当于美国前40名的银行。新的投资者正在转移\n其资产每天都在向DeFi。而在撰写本报告时，借贷和。\n借款平台正在广泛流行。这就给我们带来了...",
      "title": "DeFi解释。贷款和借款"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，DeFi又突破了一個新的里程碑：在TVL突破1000億美元后，其\n管理，相當於美國前40名的銀行。新的投資者正在轉移\n其資產每天都在向DeFi。而在撰寫本報告時，借貸和。\n借款平臺正在廣泛流行。這就給我們帶來了...",
      "title": "DeFi解釋。貸款和借款"
    }
  ],
  "title": "DeFi Explained: Lending & borrowing",
  "created_utc": 1618073586,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>DeFi had recently breached a new milestone: after breaking $100 billion TVL, it managed to be the equivalent of a top 40 U.S. bank. New investors are moving their assets to DeFi on a daily basis. And at the time of writing, lending and borrowing platforms are becoming widely popular. Which brings us to the question: What is all the fuss about lending and borrowing in crypto? And who are the big players in this game?</p>\n\n<h2>What is crypto lending?</h2>\n\n<p>Crypto lending is an alternative investment form, where investors lend fiat money or cryptocurrencies to other borrowers in exchange for interest payments. This means there are two main parties involved in this loan:</p>\n\n<ul>\n<li>The lender, who will receive interest from the borrower in exchange for the loan.</li>\n<li>The borrower, who will deposit crypto-assets as collateral to secure the investor’s investment.</li>\n</ul>\n\n<p>By depositing collateral, lenders can be sure that if something goes wrong the collateral will be used to compensate them. All DeFi lending services are based on blockchain, which is usually the Ethereum blockchain. This means that there are no traditional banks or custodians.</p>\n\n<h2>Why Crypto Loan Rates Are So Attractive</h2>\n\n<p>Traditional banking does not offer any attractive interest rates anymore. Some of them even go so far as to have a negative deposit rate. No wonder many investors are looking for more lucrative opportunities in search of passive income.</p>\n\n<p>Cryptocurrency lending is still a topic of debate, but more and more people are turning to crypto loans as an alternative source of income. Interest rates can even go up to 30%.  DeFi is a young and evolving market and the demand for it is constantly increasing. Borrowers can take out cryptocurrency-backed loans to ensure they have available funds while avoiding losing their exposure to specific crypto assets.</p>\n\n<p>The lenders are those who help provide these loans to the borrowers through DeFi platforms, and often through centralized financing (CeFi) platforms.</p>\n\n<p>It is no secret that DeFi has taken the crypto lending industry a significant step forward. Let’s take a look at the advantages:</p>\n\n<ul>\n<li>All loans are provided through smart contracts. Every detail of the loan has been automated and verified.</li>\n<li>DeFi lending does not require custody to perform any operation.</li>\n<li>Income interest is automatically adjusted to the market.</li>\n<li>The interest or collateral is collected automatically, so no need to worry if the deal goes wrong.</li>\n</ul>\n\n<p>In short, DeFi loans have proven to be a safe and easy way for investors to make their money work for them without breaking a sweat (that is if you don’t look at your investment every minute).</p>\n\n<h2>The Crypto Lending Ecosystem</h2>\n\n<p>While crypto lending platforms are not classified as banks, they can be centralized or decentralized entities such as Nexo, BlockFi, Celsius, Aave, Yearn.finance or Compound. These crypto lending platforms play the role of the middleman in both CeFi and DeFi.</p>\n\n<h2>Top crypto lending platforms in DeFi</h2>\n\n<p>Crypto lending platforms are springing up like mushrooms, which can be confusing for investors. So, for the sake of clarification, let’s review some of the well-known crypto lending platforms in DeFi:</p>\n\n<h2>Aave</h2>\n\n<p>The name Aave comes from the Finnish word for &quot;ghost&quot; and is a lending protocol on the Ethereum blockchain.</p>\n\n<p>The main feature of Aave is its open-source environment. It is a non-custodial protocol that allows for decentralized lending and borrowing. Lenders provide liquidity to the market to generate passive income, while borrowers can… well, borrow! After providing collateral of course.</p>\n\n<p>Lenders earn from ERC20 compliant aTokens at a ratio of 1: 1 to the delivered assets. This means that while lending 36 Dai, they receive 36 aTokens (in this case, 36 aDai).</p>\n\n<p>Interest rates are adjusted algorithmically based on supply and demand, but Aave allows borrowers to choose a stable interest rate (at any time) that changes less often. What makes Aave unique is its latest feature: flash loans. This feature allows borrowers to borrow any available amount of assets without collateral.</p>\n\n<h2>Compound</h2>\n\n<p>Compound is an algorithmic money market protocol on Ethereum that, like Aave, allows you to borrow or lend money and earn interest for providing collateral. The interest rates are automatically adjusted based on supply and demand.</p>\n\n<p>As in the case of Aave, asset balances provided are represented by ERC20 minted tokens, but in Compound’s protocol they are called cTokens. When the investors received their cTokens, which is after providing collateral, they can borrow up to 50-75% of their cTokens value depending on the type of the underlying asset.</p>\n\n<p>The Compound Protocol reserves 10% of the interest paid as reserves; everything else goes to the lenders.</p>\n\n<h2>Yearn.finance</h2>\n\n<p>The Yearn Finance platform communicates with several other DeFi protocols on the Ethereum blockchain with the aim of maximizing the investors’ returns. It can be described as a AI advisor for DeFi returns. Because of this, investors can earn the most from lending their stablecoins. Yearn works purely based on codes without a financial intermediary.</p>\n\n<p>Yearn has an automatic reward system has been developed based on the YFI token. The Yearn platform consists of several products:</p>\n\n<ul>\n<li>Earn - Earn indicates where the highest interest can be earned by lending a crypto asset. Earn searches across different lending protocols such as Balancer, Aave and Compound to find the best interest rate. Users can deposit DAI, USDC, USDT, TUSD or sUSD on the yearn.finance platform to start earning interest.</li>\n<li>Vaults - a collection of investment strategies designed to maximize returns from other DeFi projects and operate as actively managed investment funds. The use of these decentralized funds does not come without risks. The yDAI vault was robbed of $11 million dollars due to a vulnerability on February 5, 2021.</li>\n<li>Zap - allows to combine and execute different trades with one click to save time and money. Thus, an investor can instantly trade DAI for yCRV in one click instead of three different actions across the Yearn.finance and the Curve Finance platform.</li>\n<li>YFI tokens - Users can earn YFI tokens by placing cryptocurrencies in Yearn.finance contracts running on the Balancer and Curve DeFi trading platforms, which use the Yearn.finance platform.</li>\n</ul>\n\n<p>Because of these features, Yearn.finance provides an extensive yield farming service that enables users to capture crypto assets in a DeFi protocol in order to automatically earn more cryptos and achieve better returns.</p>\n\n<h2>Top crypto lending platforms in CeFi</h2>\n\n<p>While writing this article, gas fees on the Ethereum blockchain are reaching absurdly high numbers. This makes investing in DeFi for smaller investors not profitable. They could, however, consider CeFi platforms. With CeFi, investors trust the people behind a business to ethically manage funds and execute on services the business is offering. This differs from DeFi, where investors trust that the technology will function as intended to execute on services being offered.</p>\n\n<h2>Nexo</h2>\n\n<p>Nexo is a cryptolending platform founded in 2018 by the same people that were behind Credissimo, which is an organization that has more than 10 years of experience in offering loans. It is probably the most known CeFi platform of this list. Like Compound and Aave, Nexo offers a service that allows you to act as both a borrower and a lender. The platform is especially interesting for investors who think that they currently receive too little interest on their savings account (which is everyone). At Nexo you receive up to 8% interest on your euros, dollars, pounds or stablecoins.</p>\n\n<p>The benefits of Nexo are:</p>\n\n<ul>\n<li>Fully licensed and regulated.</li>\n<li>Insurance up to $ 100 million (BitGo Custody).</li>\n<li>Fully automated platform.</li>\n<li>Processed more than $ 1.5 billion.</li>\n<li>8% interest for lenders.</li>\n<li>Flexible loan with 5.6% interest for borrowers.</li>\n<li>All loans are 100% covered.</li>\n</ul>\n\n<p>It’s also worth noting that Nexo is developing a payment card called the Nexo card, which allows investors to spend the value of their digital assets without having to sell them.</p>\n\n<h2>Block.fi</h2>\n\n<p>BlockFi is a peer-to-peer credit marketplace that was founded in 2017 by a number of key figures from the financial sector. Block.fi supports the following coins: Bitcoin, Litecoin, Ethereum and Chainlink. They also support USD stablecoins. Like the other platforms, interest can be compounded. BlockFi charges a withdrawal fee, which is deducted from the total withdrawal amount. Investors get 1 free withdrawal per month, so if you plan your withdrawals strategically, you pay no fees at all.</p>\n\n<h2>Celsius network</h2>\n\n<p>Although not supporting US investors, Celsius carved a name for itself. The Celsius Network was founded in 2017 by Alex Mashinsky (CEO), Daniel Leon (COO) and Nuke Goldstein (CTO). Celsius is currently working with ~250 large institutional investors. These companies borrow crypto from Celsius on which they pay an interest of 16%. That is a high interest rate, but that is because these companies often have no other choice, because they are limited by law. For example, most institutional investors are not allowed, to invest in crypto because of the volatility. This is circumvented by borrowing crypto. The companies deposit dollars as collateral, putting Celsius at minimal risk. This is also exactly how users can borrow from Celsius.</p>\n\n<p>Of that 16% interest paid by Celsius&#39; institutional clients, 80% goes to Celsius users. The amount of interest you get on your crypto depends on which crypto coin(s) you have deposited and your loyalty level. It is worth noting that as of writing, unlike Nexo and Block.fi, Celsius has never been hacked, doesn’t have withdrawal fees and offers the highest lending interests (~10%).</p>\n\n<h2>Final words</h2>\n\n<p>DeFi (and CeFi) crypto lending platforms are experiencing a hype that has attracted billions of dollars from investors. Based on these numbers, it can be concluded that migration from banking to blockchain and exchanges seems like a natural next step for the entire crypto niche and will most likely keep continuing and evolving.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Did you know most new crypto currencies are <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mnbc6i/defi_explained_forks/\">initiated through forks</a>?</li>\n</ul>\n\n<p>EDIT: I forgot to mention the website <a href=\"https://defipulse.com/\">https://defipulse.com/</a>. It shows the top platforms in DeFi for different catagories. It helped me out a lot.</p>\n</div><!-- SC_ON -->",
  "score": 253,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/rtH_ipuk2dlSSLt8mfklmg9_UUJ3x9Ts1W9EmLKuxGM.jpg?auto=webp&s=7ea2e03bfc7fe6e8e3d3119ca608b0be0da4b2ee",
          "width": 2098,
          "height": 1232
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/rtH_ipuk2dlSSLt8mfklmg9_UUJ3x9Ts1W9EmLKuxGM.jpg?width=108&crop=smart&auto=webp&s=8025d904b15b6d9b3f488c58f81b888f36edf360",
            "width": 108,
            "height": 63
          },
          {
            "url": "https://external-preview.redd.it/rtH_ipuk2dlSSLt8mfklmg9_UUJ3x9Ts1W9EmLKuxGM.jpg?width=216&crop=smart&auto=webp&s=c646abdd593233a613e2b80e08f0e8e60903de02",
            "width": 216,
            "height": 126
          },
          {
            "url": "https://external-preview.redd.it/rtH_ipuk2dlSSLt8mfklmg9_UUJ3x9Ts1W9EmLKuxGM.jpg?width=320&crop=smart&auto=webp&s=0486b06395c0e77b1ff7d50414ca02c71011009c",
            "width": 320,
            "height": 187
          },
          {
            "url": "https://external-preview.redd.it/rtH_ipuk2dlSSLt8mfklmg9_UUJ3x9Ts1W9EmLKuxGM.jpg?width=640&crop=smart&auto=webp&s=7f510673adbeb9f581cc82aff12e90bc823f3134",
            "width": 640,
            "height": 375
          },
          {
            "url": "https://external-preview.redd.it/rtH_ipuk2dlSSLt8mfklmg9_UUJ3x9Ts1W9EmLKuxGM.jpg?width=960&crop=smart&auto=webp&s=3a56f7f75260874e0e70f1cecdb6b892853c5d45",
            "width": 960,
            "height": 563
          },
          {
            "url": "https://external-preview.redd.it/rtH_ipuk2dlSSLt8mfklmg9_UUJ3x9Ts1W9EmLKuxGM.jpg?width=1080&crop=smart&auto=webp&s=ef848a6eb87595d5d66e2fd53574883b1fd28550",
            "width": 1080,
            "height": 634
          }
        ],
        "variants": {},
        "id": "Om1PYFcuqegwlolm9SaC8peGoMMx3wMHkrzclhAOx1M"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mnzv1c/defi_explained_lending_borrowing/",
  "subreddit": "CryptoCurrency",
  "id": "mnzv1c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614245
}