{
  "author": "reggiebergst",
  "the_new_excerpt": "For earnings reports, public companies are required to submit a 10-Q (quarterly\nreport) or annual report (10-K) with the SEC. The 10-Q is unaudited, meaning it\nhas not been approved by a certified external auditor. The 10-K is audited. You\ncan read more about the details of 10-Q and 10-K forms on…",
  "original_created_utc": 1619546728,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "収益報告については、公開企業は10-Q（四半期報告書）または10-K（年次報告書）をSECに提出する必要があります。\n報告書）または年次報告書（10-K）をSECに提出する必要があります。10-Qは監査を受けていません。\n10-Qは未監査で、公認外部監査人の承認を受けていないことを意味します。一方、10-Kは監査済みです。詳細は\n10-Qおよび10-Kフォームの詳細については、...",
      "title": "決算報告書の分析（速報版・短縮版"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于收益报告，上市公司需要提交10-Q（季度报告）或年度报告。\n季度报告）或年度报告（10-K）提交给美国证券交易委员会。10-Q报告是未经审计的，这意味着它\n没有经过认证的外部审计师的批准。10-K报告是经过审计的。你\n你可以阅读更多关于10-Q和10-K表格的细节，在...",
      "title": "分析收益报告（快速和简短的版本"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於收益報告，上市公司需要提交10-Q（季度報告）或年度報告。\n季度報告）或年度報告（10-K）提交給美國證券交易委員會。10-Q報告是未經審計的，這意味着它\n沒有經過認證的外部審計師的批准。10-K報告是經過審計的。你\n你可以閱讀更多關於10-Q和10-K表格的細節，在...",
      "title": "分析收益報告（快速和簡短的版本"
    }
  ],
  "title": "Analyzing an Earnings Report (quick and short version)",
  "created_utc": 1619593746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For earnings reports, public companies are required to submit a 10-Q (quarterly report) or annual report (10-K) with the SEC. The 10-Q is unaudited, meaning it has not been approved by a certified external auditor. The 10-K is audited. You can read more about the details of 10-Q and 10-K forms on any financial website. Or google.</p>\n\n<p>So let&#39;s go over the fast way to read an earnings report.</p>\n\n<ol>\n<li>Before an earnings report releases, make sure you look at the past earnings metrics or have it with you to compare the upcoming earnings report. Some things to consider about any earnings report: sentiment going into earnings, industry momentum, and macro condition can affect the swings in stock price to make option plays worthless. Trade carefully.</li>\n<li>Take a look at the revenues, earnings per share, and net income. Compare it to past quarters and the last few years in that same quarter. Did the company grow Q/Q and Y/Y? Does the company have a history of seasonal cycles?</li>\n<li>Look at expenses. Did they spend more/less than previous quarters/years? What was the operational margin? What&#39;s the profit margin on their products and/or services? Was there anything unusual in their operational/product expenses that wouldn&#39;t normally be there?</li>\n<li>If a company performs poorly compared to estimates, do research on why. Some variables can be: supply chain issues (like many companies are having right now), decreasing demand in their products/service, increasing competition, changing trends, talent going to other companies, execution of various strategies (marketing for example), etc.</li>\n<li>Even if a company performs well after an earnings report, take a look why. It&#39;s easy when you your favorite company&#39;s stock goes up. It&#39;s green, it doesn&#39;t matter. Well in fact it does. Because if you want your favorite company to perform well in every or most quarters in the future, you have to understand its business model. Pay attention to their guidance and how the executives phrase their words. An <a href=\"https://review.chicagobooth.edu/finance/2017/article/how-listen-hidden-data-earnings-calls\">article back in 2017</a> dissected the words from 17,419 earnings call transcripts. On average, &quot;have an issue&quot; ranked in the top phrase used in those calls coming at just more than 3%. In those calls it was repeated just more than 5 times. Coming in 2nd was &quot;headwind&quot; and was repeated just over 10 times in an earnings call. In short, listen to the earnings call or read the transcript. News media outlets will spin words to make a company appear bad (like Tesla) when in reality nothing bad happened. Educate yourselves. Media is just noise.</li>\n</ol>\n\n<p>So in short, ask yourselves:</p>\n\n<p>How did the company perform financially Q/Q and Y/Y? What factors led to these results? What does guidance say about its future? Will the financials grow more, less, or the same? What are the headwinds and tailwinds? Will upcoming trends and macroeconomical conditions affect future growth?</p>\n\n<p>If you can answer these questions, you&#39;re on a good path. If you cannot, more research is required.</p>\n\n<p>For some companies, understanding their business model and the industry they&#39;re in can be difficult to assess. Tesla is a great example because of the extremes of the two sides, bulls and bears (TESLAQ). Tesla is in a unique position because their earnings consist of EV credits, and in this earnings cycle, they sold about $100 million in Bitcoin. They also didn&#39;t have an S/X models delivered or produced because of the refresh. So how did the company beat on earnings? What&#39;s their guidance? I&#39;ll leave that for all to research yourselves :)</p>\n\n<p>Anyway, this is just a quick way to understanding earnings reports. Understanding a company&#39;s potential is based on some factors like the industry its in, business model, and more. It takes a few hours or less to read an earnings report and understanding the financials. It takes hours or days to actually understand a company as a whole. IMO, don&#39;t read stock books. Read about businesses, the industries they&#39;re in, their TAM/SAM/SOM. If you really want to make money, you need to understand where the world is transitioning to. Ask, &quot;are electric vehicles the future?&quot;, &quot;is telemedicine relevant even after COVID?&quot;, &quot;do I and my friends/family/coworkers go to the gym anymore? or do we attend zoom fitness classes?&quot;, &quot;are users moving away from Netflix to other streaming services?&quot;. Notice the products and services you and your peers use. </p>\n\n<p>Hope this helps some people with their research!</p>\n</div><!-- SC_ON -->",
  "score": 52,
  "permalink": "/r/stocks/comments/mzumed/analyzing_an_earnings_report_quick_and_short/",
  "subreddit": "stocks",
  "id": "mzumed",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216011
}