{
  "author": "JustinianusI",
  "original_created_utc": 1627283968,
  "title": "My town is sacked. The population, decimated. Can I just move into one of the empty houses?",
  "created_utc": 1627310702,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll give a specific example, as I&#39;m sure this varied from time-to-time and place-to-place. Say I&#39;m a villager at a neighboring hamlet, and a town nearby is sacked during the Hundred Years&#39; War. The population is decimated, but many houses are still there in working condition with no one living there. If nobody comes and claims the house, may I move in? No one else is staking a claim to this house via inheritance - they all perished tragically in the sacking.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: This question was inspired by today&#39;s Wikipedia article of the day, on the Battle of Caen (1346).</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/ortpxl/my_town_is_sacked_the_population_decimated_can_i/",
  "subreddit": "AskHistorians",
  "id": "ortpxl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'll give a specific example, as I'm sure this varied from time-to-time and\nplace-to-place. Say I'm a villager at a neighboring hamlet, and a town nearby is\nsacked during the Hundred Years' War. The population is decimated, but many\nhouses are still there in working condition with no one living…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは時と場所によって異なると思いますので、具体的な例を挙げて説明します。\n具体的な例を挙げましょう。私が隣の村の村人だとすると、百年戦争で近くの町が略奪された。\n百年戦争で略奪されました。人口は減りましたが、多くの家が\nしかし、多くの家が現役で残っており、誰も住んでいない...。",
      "title": "私の町は略奪された。人口は減りました。空き家に引っ越せばいいの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我将举一个具体的例子，因为我确信这在不同的时间和地点是不同的。\n地方不同而有所不同。假设我是附近村庄的村民，而附近的一个城镇被\n百年战争期间被洗劫一空。人口锐减，但许多房屋仍能正常使用，并且有很多人还在工作。\n但许多房屋仍处于工作状态，没有人居住......",
      "title": "我的城市被洗劫一空。人口，被消灭了。我可以搬到其中一个空房子里吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我將舉一個具體的例子，因爲我確信這在不同的時間和地點是不同的。\n地方不同而有所不同。假設我是附近村莊的村民，而附近的一個城鎮被\n百年戰爭期間被洗劫一空。人口銳減，但許多房屋仍能正常使用，並且有很多人還在工作。\n但許多房屋仍處於工作狀態，沒有人居住......",
      "title": "我的城市被洗劫一空。人口，被消滅了。我可以搬到其中一個空房子裏嗎？"
    }
  ]
}