{
  "author": "benjaneson",
  "original_created_utc": 1629639086,
  "title": "The full name of Pedro I, the first Emperor of Brazil, was \"Pedro de Alcântara Francisco António João Carlos Xavier de Paula Miguel Rafael Joaquim José Gonzaga Pascoal Cipriano Serafim\" - 18 words (and the full name of his son Pedro II was 17 words). Why did Portuguese royalty give such long names?",
  "created_utc": 1629654230,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit:   </p>\n\n<p>Apparently, it wasn&#39;t just the Portuguese royal family.<br/>\nCharles I, the final Emperor of Austria-Hungary, gave 13+ names to each of his eight children:</p>\n\n<ul>\n<li>Otto was &quot;Franz Joseph Otto Robert Maria Anton Karl Max Heinrich Sixtus Xaver Felix Renatus Ludwig Gaetan Pius Ignatius&quot; (17)</li>\n<li>Adelheid was &quot;Adelheid Maria Josepha Sixta Antonia Roberta Ottonia Zita Charlotte Luise Immakulata Pia Theresia Beatrix Franziska Isabella Henriette Maximiliana Genoveva Ignatia Marcus d&#39;Aviano&quot; (22)</li>\n<li>Robert was &quot;Robert Karl Ludwig Maximilian Michael Maria Anton Franz Ferdinand Joseph Otto Hubert George Pius Johannes Marcus d&#39;Aviano&quot; (17)</li>\n<li>Felix was &quot;Felix Friedrich August Maria vom Siege Franz Joseph Peter Karl Anton Robert Otto Pius Michael Benedikt Sebastian Ignatius Marcus d&#39;Aviano&quot; (20)</li>\n<li>Carl Ludwig was &quot;Carl Ludwig Maria Franz Joseph Michael Gabriel Antonius Robert Stephan Pius Gregor Ignatius Marcus d&#39;Aviano&quot; (15)</li>\n<li>Rudolf was &quot;Rudolf Syringus Peter Karl Franz Joseph Robert Otto Antonius Maria Pius Benedikt Ignatius Laurentius Justiniani Marcus d&#39;Aviano&quot; (17)</li>\n<li>Charlotte was &quot;Charlotte Hedwig Franziska Josepha Maria Antonia Roberta Ottonia Pia Anna Ignatia Marcus d&#39;Aviano&quot; (13)</li>\n<li>Elisabeth was &quot;Elisabeth Charlotte Alphonsa Christina Theresia Antonia Josepha Roberta Ottonia Franziska Isabelle Pia Marcus d&#39;Aviano&quot; (14)</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/p9ciif/the_full_name_of_pedro_i_the_first_emperor_of/",
  "subreddit": "AskHistorians",
  "id": "p9ciif",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit:\n\nApparently, it wasn't just the Portuguese royal family.\nCharles I, the final Emperor of Austria-Hungary, gave 13+ names to each of his\neight children:\n\n * Otto was \"Franz Joseph Otto Robert Maria Anton Karl Max Heinrich Sixtus Xaver\n   Felix Renatus Ludwig Gaetan Pius Ignatius\" (17)\n *…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集\n\nどうやらポルトガル王室だけではないようです。\nオーストリア・ハンガリー帝国の最終皇帝であるチャールズ1世は、8人の子供たちに13以上の名前を\n8人の子供たちに13以上の名前をつけました。\n\n * オットーは「フランツ・ヨーゼフ・オットー・ロバート・マリア・アントン・カール・マックス・ハインリヒ・シクストゥス・クサヴァー」。\n   Felix Renatus Ludwig Gaetan Pius Ignatius」(17)\n *...",
      "title": "初代ブラジル皇帝のペドロ1世のフルネームは「ペドロ・デ・アルカンタラ・フランシスコ・アントニオ・ジョアン・カルロス・シャビエル・デ・パウラ・ミゲル・ラファエル・ジョアキム・ジョゼ・ゴンザガ・パスコアル・シプリアーノ・セラフィム」の18文字（息子のペドロ2世のフルネームは17文字）だった。なぜポルトガルの王族はこのような長い名前をつけたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑。\n\n显然，这不仅仅是葡萄牙王室的事。\n奥匈帝国的最后一位皇帝查理一世给他的八个孩子分别起了13个以上的名字。\n八个孩子。\n\n * 奥托是 \"弗朗茨-约瑟夫-奥托-罗伯特-玛丽亚-安东-卡尔-马克斯-海因里希-西斯图斯-夏弗\"。\n   Felix Renatus Ludwig Gaetan Pius Ignatius\" (17)\n *...",
      "title": "巴西第一任皇帝佩德罗一世的全名是 \"佩德罗-德-阿尔坎塔拉-弗朗西斯科-安东尼奥-若昂-卡洛斯-哈维尔-德-保拉-米格尔-拉斐尔-华金-何塞-冈萨加-帕斯科-西普里亚诺-塞拉菲姆\"--18个字（而他儿子佩德罗二世的全名是17个字）。为什么葡萄牙皇室成员会起这么长的名字？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯。\n\n顯然，這不僅僅是葡萄牙王室的事。\n奧匈帝國的最後一位皇帝查理一世給他的八個孩子分別起了13個以上的名字。\n八個孩子。\n\n * 奧托是 \"弗朗茨-約瑟夫-奧托-羅伯特-瑪麗亞-安東-卡爾-馬克斯-海因裏希-西斯圖斯-夏弗\"。\n   Felix Renatus Ludwig Gaetan Pius Ignatius\" (17)\n *...",
      "title": "巴西第一任皇帝佩德羅一世的全名是 \"佩德羅-德-阿爾坎塔拉-弗朗西斯科-安東尼奧-若昂-卡洛斯-哈維爾-德-保拉-米格爾-拉斐爾-華金-何塞-岡薩加-帕斯科-西普里亞諾-塞拉菲姆\"--18個字（而他兒子佩德羅二世的全名是17個字）。爲什麼葡萄牙皇室成員會起這麼長的名字？"
    }
  ]
}