{
  "author": "conv3rsion",
  "original_created_utc": 1652472667,
  "title": "Are You All Starting to Understand Toxic AF Bitcoin Maxis Now?",
  "created_utc": 1652493530,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;New crypto users often mistake the conduct and attitudes from experienced Bitcoiners as them just trying to protect BTC bags and &amp;quot;outdated technology&amp;quot;. What new users don&amp;#39;t understand is that these people HAVE SEEN SOME SHIT.    &lt;/p&gt;\n\n&lt;p&gt;Imagine living through not just the Terra/Luna meltdown but also witnessing Bitconect, The DAO hack, Mt Gox, and hundreds of shitcoins, rug pulls, ponzis, and exchange hacks. Imagine getting burned yourself (perhaps several times) and then watching it constantly happen to new people. Imagine how every four years, right after the Bitcoin halvening, all these new people show up with their &amp;quot;new toys&amp;quot;. (2013 alt coins, 2017 icos, 2021 NFTs) and zero experience and stubbornness and watch as they completely ignore the advice from people who have spent years in this space.  &lt;/p&gt;\n\n&lt;p&gt;Bitcoin is just different. There is no leader. There is no premine. There is no changing the finite supply or the economic properties. Its real decentralized money and the reason we even understand the word &amp;quot;blockchain&amp;quot; today.  &lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s to all the new Bitcoin maxis that will be born during this crypto winter. May you be toxic af and may you do a better job protecting new retail investors than the SEC ever has.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 412,
  "permalink": "/r/CryptoCurrency/comments/up09rm/are_you_all_starting_to_understand_toxic_af/",
  "subreddit": "CryptoCurrency",
  "id": "up09rm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "New crypto users often mistake the conduct and attitudes from experienced\nBitcoiners as them just trying to protect BTC bags and \"outdated technology\".\nWhat new users don't understand is that these people HAVE SEEN SOME SHIT.\n\nImagine living through not just the Terra/Luna meltdown but also…",
  "localize": [
    {
      "locale": "ja",
      "title": "皆さんは、トキシックAFビットコインマキシスを理解し始めましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "新的加密货币用户往往会误认为来自有经验的人的行为和态度。\nBitcoiners的行为和态度，认为他们只是想保护BTC袋子和 \"过时的技术\"。\n新用户不明白的是，这些人已经看到了一些狗屎。\n\n想象一下，他们不仅经历了Terra/Luna的崩溃，而且还经历了...",
      "title": "你们现在都开始了解有毒的AF比特币Maxis了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "新的加密貨幣用戶往往會誤認爲來自有經驗的人的行爲和態度。\nBitcoiners的行爲和態度，認爲他們只是想保護BTC袋子和 \"過時的技術\"。\n新用戶不明白的是，這些人已經看到了一些狗屎。\n\n想象一下，他們不僅經歷了Terra/Luna的崩潰，而且還經歷了...",
      "title": "你們現在都開始瞭解有毒的AF比特幣Maxis了嗎？"
    }
  ]
}