{
  "author": "rosemarysuns",
  "original_created_utc": 1658839954,
  "title": "My pillow turns yellow/brown after extended periods of time. What is it caused by?",
  "created_utc": 1658853076,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My old pillow had the same issue, but we moved houses and that one was dumped. I got a new pillow &amp;amp; now the same thing is occurring. My first thought was oily hair: however, I shower every single day + shampoo. I did some research and it said it’s due to sweat, which makes a lot of sense because both my rooms in my old and new house are, for some reason, incredibly stuffy + I sweat really easy. Is it because of sweat or something else?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/NoStupidQuestions/comments/w8j0vx/my_pillow_turns_yellowbrown_after_extended/",
  "subreddit": "NoStupidQuestions",
  "id": "w8j0vx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My old pillow had the same issue, but we moved houses and that one was dumped. I\ngot a new pillow & now the same thing is occurring. My first thought was oily\nhair: however, I shower every single day + shampoo. I did some research and it\nsaid it’s due to sweat, which makes a lot of sense because…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前使っていた枕も同じ問題を抱えていたのですが、家を引っ越したのでそちらは捨てられてしまいました。I\n新しい枕を買ったのですが、同じことが起こっています。最初に思ったのは、油っぽい\nしかし、私は毎日シャワーを浴びて、シャンプーをしています。いくつか調べてみたところ\n汗のせいだと言われました。",
      "title": "枕が長時間使用すると黄ばんでしまう。原因は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我以前的枕头也有同样的问题，但我们搬了家，那个枕头被扔了。I\n我买了一个新的枕头，现在又出现了同样的问题。我首先想到的是油性\n然而，我每天都洗澡+洗发。我做了一些研究，它\n它说这是由于汗水造成的，这很有道理，因为...",
      "title": "我的枕头在长时间使用后会变成黄色/棕色。这是由什么引起的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我以前的枕頭也有同樣的問題，但我們搬了家，那個枕頭被扔了。I\n我買了一個新的枕頭，現在又出現了同樣的問題。我首先想到的是油性\n然而，我每天都洗澡+洗髮。我做了一些研究，它\n它說這是由於汗水造成的，這很有道理，因爲...",
      "title": "我的枕頭在長時間使用後會變成黃色/棕色。這是由什麼引起的？"
    }
  ]
}