{
  "author": "Gothic_Sunshine",
  "original_created_utc": 1624709390,
  "title": "What might the singer of Barrett's Privateers future be?",
  "created_utc": 1624756162,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The song itself is fictional, but also highly realistic. For those not familiar with the song, a 17 year old in Canada signs onto a privateering vessel under the British Crown in 1778, going after American shipping. The ship is completely unfit for service and is destroyed by the Americans, with only the singer surviving, but with the loss of his legs, and in 1784 he&#39;s a broken man on a Halifax pier in his early 20s. Now what happens to him? Without legs, I presume he can&#39;t easily work, especially being an uneducated peasant. I don&#39;t know that a privateer could get a pension from the crown. Is there any sort of welfare system at all? Is he relegated to begging? Is there any kind of mobility aid available to him? How does society probably see him?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/o89l5t/what_might_the_singer_of_barretts_privateers/",
  "subreddit": "AskHistorians",
  "id": "o89l5t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The song itself is fictional, but also highly realistic. For those not familiar\nwith the song, a 17 year old in Canada signs onto a privateering vessel under\nthe British Crown in 1778, going after American shipping. The ship is completely\nunfit for service and is destroyed by the Americans, with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この曲自体はフィクションですが、非常にリアリティがあります。この曲を知らない人は\nこの歌を知らない人のために説明すると、1778年にカナダの17歳の少年が、イギリス王室の私掠船に乗り込んで\n1778年、カナダの17歳の少年が、イギリス王室の私掠船に乗り込み、アメリカの船を狙う。その船は、まったく使い物にならず\nアメリカ人によって破壊されてしまいますが...。",
      "title": "バレットのプライベイトの未来の歌手はどうなるかも？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这首歌本身是虚构的，但也是高度真实的。对于那些不熟悉\n对于那些不熟悉这首歌的人来说，加拿大的一个17岁少年在一艘由英国王室管理的私掠船上签字。\n1778年，一个17岁的加拿大少年签署了一艘英国皇家的私掠船，去追捕美国航运。这艘船完全\n这艘船完全不适合服役，被美国人摧毁了，而...",
      "title": "巴雷特的私掠者未来的歌手可能是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這首歌本身是虛構的，但也是高度真實的。對於那些不熟悉\n對於那些不熟悉這首歌的人來說，加拿大的一個17歲少年在一艘由英國王室管理的私掠船上簽字。\n1778年，一個17歲的加拿大少年簽署了一艘英國皇家的私掠船，去追捕美國航運。這艘船完全\n這艘船完全不適合服役，被美國人摧毀了，而...",
      "title": "巴雷特的私掠者未來的歌手可能是什麼？"
    }
  ]
}