{
  "author": "Gaffle74",
  "original_created_utc": 1655862540,
  "title": "Why is the black community so judgmental towards family members?",
  "created_utc": 1655913360,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I went to nice schools growing up and every time I went around them they always pointed out how i &amp;quot;talk white&amp;quot; and brought up how I went to a predominantly white school. (up until my mother moved when I was a freshman in high school.) This made me associate with them less but now when they see me they say I &amp;quot;act like I&amp;#39;m better than somebody&amp;quot; or &amp;quot;act bouijie&amp;quot; simply because of how I present myself, how I speak etc. This went on from about when I was 9 years old till now. (I&amp;#39;m 20) They made me feel so alienated at a young age because of this and I realize that this heavily influenced who I am today. The majority of the ones judging me were grownups and some cousins. The majority of them did grow up in areas with substandard schooling systems ranking very low. Why should I be judged because my mother wanted me to have a good education at a young age? I notice this happens to my younger brother as well which is why I&amp;#39;m typing this now.&lt;/p&gt;\n\n&lt;p&gt;I see this a lot in the black community but I don&amp;#39;t want it to be a race thing so if you are any other race and went through this can you comment as well. &lt;/p&gt;\n\n&lt;p&gt;PS: I do have a couple of cousins who are more understanding of this now and I don&amp;#39;t hear it as much now because I know which ones to associate with.&lt;/p&gt;\n\n&lt;p&gt;EDIT: The only difference is the school system I was in up until 8th grade and the fact my dialect was a product of it. Other than that I grew up relatively the same as them, poor.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/vhtgbx/why_is_the_black_community_so_judgmental_towards/",
  "subreddit": "TooAfraidToAsk",
  "id": "vhtgbx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I went to nice schools growing up and every time I went around them they always\npointed out how i \"talk white\" and brought up how I went to a predominantly\nwhite school. (up until my mother moved when I was a freshman in high school.)\nThis made me associate with them less but now when they see me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は幼い頃からいい学校に通っていたのですが、彼らの周りに行くたびにいつも\n白人の多い学校に通っていたことを指摘されました。\nを指摘されました（私が高校1年生の時に母が引っ越すまで）。\nそのため、彼らとの付き合いは少なくなりましたが、今では彼らが私に会うと...",
      "title": "なぜ、黒人社会は家族に対して批判的なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在好的学校长大，每次我去他们身边，他们总是指出我是如何 \"说白话 \"的，并提出我是如何去了以白人为主的学校。\n他们总是指出我是如何 \"说白话 \"的，并提到我是如何去了一个以白人为主的学校。\n直到我母亲在我上高中一年级时搬走。\n这使我与他们的联系减少，但现在当他们看到我...",
      "title": "为什么黑人社区对家庭成员的判断力如此之强？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在好的學校長大，每次我去他們身邊，他們總是指出我是如何 \"說白話 \"的，並提出我是如何去了以白人爲主的學校。\n他們總是指出我是如何 \"說白話 \"的，並提到我是如何去了一個以白人爲主的學校。\n直到我母親在我上高中一年級時搬走。\n這使我與他們的聯繫減少，但現在當他們看到我...",
      "title": "爲什麼黑人社區對家庭成員的判斷力如此之強？"
    }
  ]
}