{
  "author": "jordanlesson",
  "the_new_excerpt": "TLDR: The U.S. Government has confirmed several sightings of UFO's (possibly\naliens). Several government officials have come out and said that U.S. military\nhas had several encounters with physics-defying vehicles. Based off this\nevidence, defense stocks have a direct relationship with UFO…",
  "original_created_utc": 1620746813,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR: 米国政府は、UFO（おそらくエイリアン）の目撃情報をいくつか確認しています。\n宇宙人の可能性もあります）。) 何人かの政府関係者が、米軍が何度かUFOを目撃していると発表しました。\nが物理学的に不可能な乗り物と何度か遭遇したと発言しています。これらの証拠から\n防衛関連株はUFOと直接の関係があります...",
      "title": "UFOと防衛関連株の重要なつながり。*please read i beg of you *"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简要记录：美国政府已经确认了几次目击UFO的事件（可能是\n外星人）。) 一些政府官员已经出来说，美国军方\n遇到了几起违反物理学的飞行器。基于这些\n证据，国防股与UFO有直接关系...",
      "title": "UFO和国防股之间的重要联系。*请阅读，我求你了*。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡要記錄：美國政府已經確認了幾次目擊UFO的事件（可能是\n外星人）。) 一些政府官員已經出來說，美國軍方\n遇到了幾起違反物理學的飛行器。基於這些\n證據，國防股與UFO有直接關係...",
      "title": "UFO和國防股之間的重要聯繫。*請閱讀，我求你了*。"
    }
  ],
  "title": "Important Connection Between UFOs and Defense Stocks. *PLEASE READ I BEG OF YOU*",
  "created_utc": 1620768339,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR:</strong> The U.S. Government has confirmed several sightings of UFO&#39;s (possibly aliens). Several government officials have come out and said that U.S. military has had several encounters with physics-defying vehicles. Based off this evidence, defense stocks have a direct relationship with UFO disclosure. I recommend purchasing U.S. defense stocks due to recent UFO activity and human emotions. <strong>PLEASE READ, THIS POST IS VERY IMPORTANT TO ME</strong></p>\n\n<p>---------------------------------------------------------------------------------</p>\n\n<p>This is my first time posting on this subreddit. I hope this post can be welcomed with open arms like many other posts on this platform. This is a rather long post but it is definitely the most important one for not only this subreddit but Earth as a whole. I beg of you to take this post as serious as possible as I lay out claims that might not be considered &quot;realistic&quot; by some of you. Again, this is one of the most important issues of our time and I thought that it would be a great way to share this information with you guys since the spread of information on this platform is unmatched.</p>\n\n<p>The issue that I am referring to above is the growing contact/sightings of possibly extraterrestrial or extra-dimensional beings and crafts on Earth. This is an issue that everyone in the world should be familiar with and allocate their greatest interest in order to find the truth behind this. This post is very unusual compared to the others on this subreddit as most posts are stock market related. However, I promise that I will show the intersectionality between this global issue and finance throughout this post.</p>\n\n<p>I first began to become interested in this issue in December of 2020 while quarantined in South East Michigan when the former Israeli space security chief, Haim Eshed, announced to the Jerusalem Post that aliens are indeed real. He later stated in the interview with the reputable news source that extraterrestrials from distant planets are engaged in a &quot;Galactic Federation&quot; where important policies regarding issues between civilizations are made. Eshed exclaimed that the United States is in talks with the Galactic Federation and even have American representatives participating in meetings and research with these extraterrestrials in an underground base on Mars. The former space security chief states that the main purpose of the research is to understand &quot;the fabric of the universe&quot;. Around this time, America&#39;s former president, Donald Trump, established the seventh branch of their military, the Space Force. Haim insists that Trump was briefed and is fully aware of this situation. He even says that Trump was &quot;on the verge&quot; of disclosing their existence, however, he was stopped by the Galactic Federation as they didn&#39;t want to cause &quot;mass hysteria&quot; due to the many conflicts we are facing today such as political divide, COVID-19, and degrading international relationships.</p>\n\n<p>Keep in mind that Haim Eshed is the one of the most credible, reliable, high-ranking, and intelligent individuals in regards to this issue. This would be comparable to if the head of NASA announced that intelligent life from other planets is a reality and that they are in communication with our highest-ranking officials. It is also important to mention that Israel&#39;s space agency is one of the best as they are one of only seven countries on the planet that build and launch their own satellites into orbit. Not only that, but Israel and the United States have a very good relationship regarding not only trade but military operations as well. This means that information is without a doubt transferred between the countries&#39; military in regards to warfare and space. You may be asking why Haim Eshed is going public with this reality-shattering information nine years after his retirement in 2011. He claims that a lot has changed in the scientific community and that &quot;if I had come up with what I’m saying today five years ago, I would have been hospitalized&quot;. In the end, he stated that he is one of the most respected individuals in the academia setting and that he has &quot;nothing to lose. I’ve received my degrees and awards&quot;. Again, this is a man who served for 30 years as head of Israel&#39;s space program and is a three-time recipient of the Israel Security Award.</p>\n\n<p>Here is the original Jerusalem Post article *PLEASE READ*: <a href=\"https://www.jpost.com/omg/former-israeli-space-security-chief-says-aliens-exist-humanity-not-ready-651405\">Jerusalem Post Article</a></p>\n\n<p>In December of 2017, the New York Times published an article entitled, <em>Glowing Auras and ‘Black Money’: The Pentagon’s Mysterious U.F.O. Program.</em> This article was one of the first publications to give an in-depth investigation of the current state of U.S. intelligence about UFO&#39;s (unidentified flying objects) or UAP&#39;s (unidentified aerial phenomenons) as they are known today by the U.S. Government. In the NYT report, it provides evidence to prove the U.S. Government&#39;s involvement in research programs investigating UAP sightings. According to Defense Department officials, included in the $600 billion annual defense budget was a virtually impossible to find $22 million allocation of money to an unknown Pentagon program called the Advance Aerospace Threat Identification Program (AATIP). The program&#39;s main responsibility was to examine proof of UAP&#39;s provided by various military sources and to determine whether or not it posed a threat to our country. The program was ran by a former military intelligence official named Luis Elizondo on the fifth floor of the Pentagon&#39;s C ring. The Defense Department has never acknowledged the existence of this program before and when asked about it recently they said that they shut it down in 2012. However, when the program&#39;s backers were asked about it, they confirmed that the Defense Department stopped funding back in 2012 but the program still continued to investigate several more episodes provided by service members until October of 2017 when Luis Elizondo resigned from the Pentagon to protest excessive government secrecy about this issue.</p>\n\n<p><a href=\"https://www.nytimes.com/2017/12/16/us/politics/pentagon-program-ufo-harry-reid.html\">New York Times Article *PLEASE READ*</a></p>\n\n<p>One of the most fascinating things about this program was the examining of videos showing encounters between these unknown objects and U.S. military aircrafts. Three videos on this subject were published by the New York Times entitled &quot;FLIR1&quot;, &quot;GIMBAL&quot;, and &quot;GOFAST&quot;. The videos were taken by Navy fighter jets belonging to the USS Nimitz and USS Roosevelt. All three of these videos show cockpit display data, infrared imagery, and even audio communications between the pursuing pilots. The UAP&#39;s displayed in these videos showed unprecedented and &quot;impossible&quot; aerial maneuvers that is unmatched by any technology present on Earth at this time. One of the fighter pilots, Commander David Fravor, who was part of the F/A-18F team that attempted to intercept the UAPs in 2004, had only this to say to the <em>New York Times:</em> “I have no idea what I saw...It had no plumes, wings or rotors and outran our F-18s.” Another fighter pilot witness named Chad Underwood described the movement of the craft as &quot;not behaving by the normal laws of physics&quot;. Furthermore, he described the UAP to not be &quot;behaving in a manner that’s predictable or is normal by how flying objects physically move&quot;. In addition to this bizarreness, all the pilots involved stated that the crafts didn&#39;t produce a heat signature, fumes, or even a propulsion system. Overall, these crafts can only be labeled as otherworldly as they clearly aren&#39;t capable to be developed by our current standards of science and innovation according to these pilots and other significant figures in the scientific community.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=lWLZgnmRDs4\">&quot;FLIR1&quot; Video Evidence</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=2TumprpOwHY\">&quot;GIMBAL&quot; Video Evidence</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=VUrTsrhVce4\">&quot;GOFAST&quot; Video Evidence</a></p>\n\n<p>Although these videos showed compelling evidence of extraterrestrial existence, it still was not confirmed by any government officials to be raw and genuine footage. Some of the videos actually surfaced on the Internet as early as 2007, as they were being passed around in various website forums. It wasn&#39;t until September of 2019, when a spokeswoman of the Pentagon confirmed that the released videos were in fact 100% real and recorded by Navy aviators. She also added that this was &quot;part of a larger issue of an increased number of training range incursions by unidentified aerial phenomena in recent years.&quot; This was one of the first incidences of the U.S. Government confirming that unknown and physics-defying air crafts have entered U.S. airspace.</p>\n\n<p><a href=\"https://www.cbsnews.com/news/ufo-video-authenticity-pentagon/\">Confirmation of Video Authenticity by Pentagon Representative</a></p>\n\n<p>More recently, in April of 2021, a new video published by <a href=\"https://www.mysterywire.com/\">Mystery Wire</a> showed yet another case of an unidentified aerial phenomenon. The video took storm on the web and showcased a swarm of pyramid shaped aircrafts hovering over a U.S. Navy destroyer in night vision. The UAP&#39;s flashed with bright lights and performed physics-defying maneuvers. Additionally, what stood out about this incident was that the crafts were &quot;transmedium&quot; vehicles, meaning that they could transition from air to water seamlessly. Also, three photos supposedly taken by Navy fighter jet pilots displayed three different shaped UAP&#39;s. The objects the Navy Personnel captured on his iPhone included a &quot;sphere&quot;, an &quot;acorn&quot;, and a &quot;metallic blimp&quot;. Although the video clip and photos originally didn&#39;t seem to standout from the other UFO videos found on the Internet, it wasn&#39;t long for a spokeswoman from the Pentagon to confirm the authenticity of the video and photos. Susan Gough, the spokesperson for the Pentagon said that, “I can confirm that the referenced photos and videos were taken by Navy personnel. The UAPTF has included these incidents in their ongoing examinations.” As you can see, this is an ongoing issue that most likely happens very frequently. It wasn&#39;t until now that the people of America can really see what secrets the U.S. Government is hiding from its citizens.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=h3zpqQJYinc\">Confirmed Pyramid UAP Video</a></p>\n\n<p><a href=\"https://www.nxsttv.com/nmw/wp-content/uploads/sites/107/2021/04/Sphere.jpeg?w=900\">&quot;Sphere&quot; UAP Photo</a></p>\n\n<p><a href=\"https://www.nxsttv.com/nmw/wp-content/uploads/sites/107/2021/04/Acorn.jpeg?w=900\">&quot;Acorn&quot; UAP Photo</a></p>\n\n<p><a href=\"https://www.wtrf.com/wp-content/uploads/sites/25/2021/04/Metallic-Blinp.jpg\">&quot;Metallic Blimp&quot; UAP Photo</a></p>\n\n<p><a href=\"https://www.cnn.com/2021/04/15/politics/unidentified-aerial-phenomena-defense-department/index.html\">Pentagon Confirmation Article</a></p>\n\n<p>Now you may be asking yourself &quot;what happens now?&quot; Well in last years&#39; gargantuan $2.3 trillion appropriation bill that was mainly for COVID-19 relief aid for millions of Americans, contained a rider that was provided by the Senate Intelligence Committee. For anyone that doesn&#39;t know, a rider is when an additional provision is added to a bill while having little to do with the main subject matter of it. In this case, the rider mandated that the director of national intelligence works with the secretary of defense on a report to detail everything the U.S. Government knowns about UAP&#39;s. The small provision in the 5,500+ page bill also warranted that the report be released within 180 days of the bill being signed. Donald Trump signed the bill on December 27th, 2020 so that means that UAP disclosure should be released in early June. Some speculate that this report will contain all the secrets the U.S. Government has regarding unidentified aerial phenomenons while other say that they will only release the minimum amount of information in order to be labeled as a &quot;UFO report&quot;. What do you think? I&#39;d love to hear your opinion!</p>\n\n<p><a href=\"https://nypost.com/2020/12/29/covid-19-bill-started-a-180-day-countdown-for-ufo-disclosures/\">UFO Disclosure Article</a></p>\n\n<p>While this is potentially one of the greatest ongoing issues in human history, I&#39;d like to take a minute to fulfill my promise of connecting this global issue to the stock market. All the evidence I provided were confirmed by some of the highest-ranking individuals on this planet. This means that there is a high probability of similar events occurring in the near future. These events could be increased UFO sightings, more government confirmations of UAP encounters, or even extraterrestrial contact. Overall, what is absolutely certain if any of these events take place, is the growing awareness of extraterrestrials/extra-dimensional beings by the general public. Based off human emotion, people will not take this news lightly. I truly believe that many humans will panic after hearing the startling news of unknown crafts traveling over their countries airspace without their country&#39;s military able to do anything about. People will instinctively go into a defensive state meaning that they will purchase more weapons like guns, knives, and ammunition. Some people will most likely even commit suicide due to the feeling of insignificance and defenselessness by this devastating news. Additionally, there will be a massive pushback against the U.S. Government because of this unprecedented and excessive government secrecy regarding this issue. Most likely the government will stay intact and billions of dollars will be put into the military as it is the only structured organization that can defend against this off-world threat. However, this will be the start to a new concept of what us humans call life.</p>\n\n<p>What I stated above sounds absolutely horrific, however, our species need to recognize the fact that we may not be alone in this universe. New information we find on this issue will happen inevitably, it is more of a question of when. Investing in military defense stocks like Lockheed Martin ($LMT), Raytheon ($RTX), and Boeing ($BA) will be a great long term investment because I hypothesize that this situation is caused by only three scenarios. The first scenario is that there are extraterrestrials/extra-dimensional beings navigating the UAP&#39;s shown in the evidence above. The second scenario is that one of our country&#39;s nemesis like China or Russia has technologically leaped frogged us and created aircrafts that has defied our current understandings of physics. The final scenario is that the U.S. military has developed these crafts and in an attempt to keep our rivals from figuring out this information, they made a massive effort to hide it from the general public. All three of these scenarios ultimately conclude with the U.S. military&#39;s capabilities being expanded along with a giant budget increase. Higher budget means more money for big military companies like the ones stated above to develop cutting edge technology for the government. Again, whether this happens in June when UFO disclosure is released or 10 years from now when aliens make contact, this is an asymmetric trade meaning that the potential gains of buying defense stocks FAR exceed the potential losses.</p>\n\n<p>Now if you can take one thing from this post, it is that information is ESSENTIAL. What the U.S. Government has held from its people, is the greatest intelligence failure in United States history. This global issue affects us all significantly and as people of Earth, we deserve to have this information told to us in full.</p>\n\n<p>---------------------------------------------------------------------------------</p>\n\n<p><strong>Resources:</strong></p>\n\n<p><strong>THESE RESOURCES ARE STRICTLY FOR OBJECTIVE PURPOSES ONLY, NOT POLITICAL</strong></p>\n\n<p><a href=\"https://www.reddit.com/r/UFOs/\">r/UFOs</a> - UFO/UAP Sightings posted every single day</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=ZA-h3dIeD_A\">Retired Navy Commander David Fravor Describes his Encounter</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=FTdCDfEu6x0\">Former Defense of Intelligence Official on Public UFO Findings</a></p>\n\n<p><a href=\"https://pbs.twimg.com/media/Ez8o2MIVEAM3pzb?format=jpg&amp;name=large\">Senate Majority Leader Harry Reid Proving Luis Elizondo was Head of AATIP</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=1MbJpTQD2Uk\">Luis Elizondo Interview on U.S. Intelligence Failure</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=Z7-DhPCG_II\">Luis Elizondo Interview on U.S. in Possession of UFO Debris</a></p>\n\n<p><a href=\"https://www.youtube.com/watch?v=iNLCfSnJDgs&amp;t=2s\">Former Director of National Intelligence Speaks Out On UFOs</a></p>\n\n<p><a href=\"https://thevault.tothestarsacademy.com/2004-nimitz-flir1-video\">In-Depth Breakdown of &quot;FLIR1&quot; Video</a></p>\n\n<p><a href=\"https://thevault.tothestarsacademy.com/gimbal/tag/Tom+Delonge\">In-Depth Breakdown of &quot;GIMBAL&quot; video</a></p>\n\n<p><a href=\"https://thevault.tothestarsacademy.com/2015-go-fast-footage\">In-Depth Breakdown of &quot;GOFAST&quot; Video</a></p>\n</div><!-- SC_ON -->",
  "score": 2590,
  "permalink": "/r/wallstreetbets/comments/n9zlpn/important_connection_between_ufos_and_defense/",
  "subreddit": "wallstreetbets",
  "id": "n9zlpn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620986000157
}