{
  "author": "liferider09",
  "the_new_excerpt": "I am familiar with the concept of white flight & highways destroying\nneighborhoods, but not with respect to LA. Additionally, I thought it was\ninteresting that a movie made in the 80s would so directly make a reference to\nthe public transportation of the 40s or 50s. In hindsight, this seemed like…",
  "original_created_utc": 1614775043,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我熟悉白飞与高速公路破坏的概念。\n社区，但就洛杉矶而言则不然。此外，我认为这是\n有意思的是，一部80年代的电影竟然直接提到了\n40或50年代的公共交通。事后看来，这似乎是... ...",
      "title": "在以20世纪初为背景的《谁陷害了兔子罗杰》中，主人公形容洛杉矶拥有 \"世界上最棒的公共交通\"。如今，洛杉矶的交通大多以汽车为主。他们曾经是世界上最好的，这是真的吗，发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我熟悉白飛與高速公路破壞的概念。\n社區，但就洛杉磯而言則不然。此外，我認爲這是\n有意思的是，一部80年代的電影竟然直接提到了\n40或50年代的公共交通。事後看來，這似乎是... ...",
      "title": "在以20世紀初爲背景的《誰陷害了兔子羅傑》中，主人公形容洛杉磯擁有 \"世界上最棒的公共交通\"。如今，洛杉磯的交通大多以汽車爲主。他們曾經是世界上最好的，這是真的嗎，發生了什麼？"
    }
  ],
  "title": "In \"Who Framed Roger Rabbit,\" set in the early 20th century, the main character describes LA as having the \"greatest public transportation in the world.\" Today, LA transportation is mostly car-oriented. Is it true that they used to be the best in the world, and what happened?",
  "created_utc": 1614791560,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am familiar with the concept of white flight &amp; highways destroying neighborhoods, but not with respect to LA. Additionally, I thought it was interesting that a movie made in the 80s would so directly make a reference to the public transportation of the 40s or 50s. In hindsight, this seemed like a reference that I would not have understood as a kid, but adults living in CA would have some preexisting notions about.</p>\n</div><!-- SC_ON -->",
  "score": 276,
  "permalink": "/r/AskHistorians/comments/lwswlg/in_who_framed_roger_rabbit_set_in_the_early_20th/",
  "subreddit": "AskHistorians",
  "id": "lwswlg",
  "is_self": true,
  "media": null,
  "is_video": false
}