{
  "author": "partymsl",
  "original_created_utc": 1649883602,
  "title": "The bull run will come when we all expect it the least. That's why a bearish sentiment is highly bullish.",
  "created_utc": 1649908370,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;With now months in this a lot of nothing happening many, even the best, are becoming very unhopeful about a possible upturn. And that very understandable no human would like to see weeks of very red bleeding and every attempt of relief completly fail. &lt;/p&gt;\n\n&lt;p&gt;At such situations where everyone is just so sad that they can&amp;#39;t even watch the charts anymore or even talk about Crypto. That&amp;#39;s when you know we are truely in some bearish sentiment. But a bearish sentiment is probably the best thing, as the bears become very overconfident that everything is under control but in Crypto nothing every is in anyone&amp;#39;s hands.&lt;/p&gt;\n\n&lt;p&gt;Also looking at the history the past big bull runs started after everyone was not even thinking about a pump but just about a further dumb. One thing to akwys remember is that a bear run only happens when we can not imagine it going down any day soon and a bulk run happens when we can not imagine it going up any time soon.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/u308hu/the_bull_run_will_come_when_we_all_expect_it_the/",
  "subreddit": "CryptoCurrency",
  "id": "u308hu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "With now months in this a lot of nothing happening many, even the best, are\nbecoming very unhopeful about a possible upturn. And that very understandable no\nhuman would like to see weeks of very red bleeding and every attempt of relief\ncompletly fail.\n\nAt such situations where everyone is just so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この数ヶ月は何も起こらないことが多く、多くの人が、最高の人たちさえも、そうです。\nこのままではいけないと、希望が持てなくなりました。そして、それはとても理解できることです。\n何週間も真っ赤な出血が続き、あらゆる救いの手が差し伸べられるのを見るのは、人間にとって好ましいことではありません。\nということです。\n\nそんな時、誰もが、ただただ...。",
      "title": "ブルランは、私たちが最も期待していないときにやってくる。だからこそ、弱気なセンチメントは非常に強気なのだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在已经过去几个月了，很多人，甚至是最好的人，都对可能出现的好转变得非常不抱希望。\n对可能出现的好转变得非常不抱希望。这也是可以理解的，没有人\n没有人愿意看到数周的红色出血和每一次救济的尝试都失败。\n完全失败。\n\n在这种情况下，每个人都是如此...",
      "title": "牛市运行将在我们大家最不期待的时候到来。这就是为什么看跌的情绪是高度看涨的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在已經過去幾個月了，很多人，甚至是最好的人，都對可能出現的好轉變得非常不抱希望。\n對可能出現的好轉變得非常不抱希望。這也是可以理解的，沒有人\n沒有人願意看到數週的紅色出血和每一次救濟的嘗試都失敗。\n完全失敗。\n\n在這種情況下，每個人都是如此...",
      "title": "牛市運行將在我們大家最不期待的時候到來。這就是爲什麼看跌的情緒是高度看漲的。"
    }
  ]
}