{
  "author": "judowna",
  "original_created_utc": 1644903214,
  "title": "Why did Japanese nobility abandon the spoon during the Heian period?",
  "created_utc": 1644930344,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know, pretty dull thing to wonder about. But I was thinking about how Koreans still use the Tang Dynasty combination of the chopstick and spoon, and Korean cuisine and table manners evolved alongside spoon usage (ex. So many soups, the bowl mustn’t be lifted from the table) and I thought about how Japanese cuisine on the other hand seems as if it evolved alongside the lack of a spoon (ex. the bowl must be lifted up to eat.) that led me to wonder if spoons were only a mainland thing and if Japan never adopted the Tang dining set up. I was wrong, the spoon was introduced to Japan during the heian, however only by nobility. Which made me wonder, why did the lower class not imitate the noble class by also adopting the spoon? And why, after the decline of the Tang Dyansty, did the nobility just decide “we aren’t going to use spoons anymore, but we’ll keep the chopsticks?” &lt;/p&gt;\n\n&lt;p&gt;Bonus question: Japanese culture seems to take minimalism to a whole new level than China or Korea. Confucianism and Buddhism were major influences in both Korean and Chinese culture. What happened? Was it because of the rise of the military class? Was it a lack of on shore resources? Was it just a need by leadership to distinguish japan from similar mainland culture?&lt;/p&gt;\n\n&lt;p&gt;(Edited for spelling)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ssvi1y/why_did_japanese_nobility_abandon_the_spoon/",
  "subreddit": "AskHistorians",
  "id": "ssvi1y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know, pretty dull thing to wonder about. But I was thinking about how Koreans\nstill use the Tang Dynasty combination of the chopstick and spoon, and Korean\ncuisine and table manners evolved alongside spoon usage (ex. So many soups, the\nbowl mustn’t be lifted from the table) and I thought about…"
}