{
  "author": "sweetbutterknife",
  "the_new_excerpt": "I'm 18F and bisexual. I've had a fair amount of sex but everytime it comes to\ntaking my bra off I get terrified of what my partner must think of my boobs.\nThey're super uneven - I've never had any comments about it, but if I'm ever\nghosted I always assume it's because of that.\n\nTo be honest, I don't…",
  "original_created_utc": 1620920448,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は18Fでバイセクシャルです。かなりの数のセックスをしてきましたが、ブラジャーを外すときにはいつも\nブラジャーを外すときに、相手が私のオッパイをどう思っているのか不安になります。\nそのことについて何か言われたことはありませんが、もし私がゴーストになったら\n幽霊になったら、そのせいだと思っています。\n\n正直に言うと、私は...",
      "title": "相手のおっぱいが凸凹していても気にする人はいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是18岁，双性恋。我有过相当多的性生活，但每当涉及到\n我都很害怕我的伴侣会对我的胸部有什么看法。\n它们超级不均匀--我从来没有过任何关于它的评论，但如果我有一天\n我总是认为是由于这个原因。\n\n说实话，我并不...",
      "title": "人们关心他们伴侣的胸部是否不平整吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是18歲，雙性戀。我有過相當多的性生活，但每當涉及到\n我都很害怕我的伴侶會對我的胸部有什麼看法。\n它們超級不均勻--我從來沒有過任何關於它的評論，但如果我有一天\n我總是認爲是由於這個原因。\n\n說實話，我並不...",
      "title": "人們關心他們伴侶的胸部是否不平整嗎？"
    }
  ],
  "title": "Do people care if their partner's boobs are uneven?",
  "created_utc": 1620928888,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m 18F and bisexual. I&#39;ve had a fair amount of sex but everytime it comes to taking my bra off I get terrified of what my partner must think of my boobs. They&#39;re super uneven - I&#39;ve never had any comments about it, but if I&#39;m ever ghosted I always assume it&#39;s because of that.</p>\n\n<p>To be honest, I don&#39;t really know why I&#39;m even posting this - whenever I hear people saying they don&#39;t care I just automatically think they&#39;re lying, maybe that&#39;s the dysmorphia talking though.</p>\n\n<p>What&#39;s your honest opinion on uneven boobs?</p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 206,
  "permalink": "/r/TooAfraidToAsk/comments/nbjk6a/do_people_care_if_their_partners_boobs_are_uneven/",
  "subreddit": "TooAfraidToAsk",
  "id": "nbjk6a",
  "is_self": true,
  "media": null,
  "is_video": false
}