{
  "author": "GroundbreakingMain81",
  "the_new_excerpt": "What a great week for crypto. Prices that we haven't seen since February. A\nbunch of strong coins at an amazing discount for anyone who had FOMO. And some\nreally telling tweets from He Who Shall Not Be Named making a great fool out of\nhimself.\n\nBe aware that some of the following technical analysis…",
  "original_created_utc": 1621296339,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリプトにとって何と素晴らしい週だろう。2月以来、見られなかった価格。A\n強烈なコインの数々が、気になっていた人のために驚くべき割引価格で提供されました。そして、いくつかの\n名も無き人が大馬鹿をしているようなツイートもありました。\nといったツイートもありました。\n\n以下のテクニカル分析には注意が必要です。...",
      "title": "ブルマーケットは続く...。エモーションテクニカル分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于加密货币来说，这是多么伟大的一周。自2月份以来，我们还没有看到过这样的价格。A\n一批强大的硬币以惊人的折扣为任何有FOMO的人服务。还有一些\n不愿透露姓名的人在推特上大放厥词。\n他自己。\n\n请注意，以下的一些技术分析...",
      "title": "牛市仍在继续... 情绪技术分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於加密貨幣來說，這是多麼偉大的一週。自2月份以來，我們還沒有看到過這樣的價格。A\n一批強大的硬幣以驚人的折扣爲任何有FOMO的人服務。還有一些\n不願透露姓名的人在推特上大放厥詞。\n他自己。\n\n請注意，以下的一些技術分析...",
      "title": "牛市仍在繼續... 情緒技術分析"
    }
  ],
  "title": "The Bull Market Continues... An Emotechnical Analysis",
  "created_utc": 1621353194,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What a great week for crypto. Prices that we haven&#39;t seen since February. A bunch of strong coins at an amazing discount for anyone who had FOMO. And some really telling tweets from He Who Shall Not Be Named making a great fool out of himself. </p>\n\n<p>Be aware that some of the following technical analysis is adapted from Kraken&#39;s OTC Daily newsletter. BTC&#39;s 14 month RSI has returned back to normal at 69.9. This is the first time this has happened since Oct 2020. We last saw this reversion in the 2013 bull market. Kraken Intelligence is seeing technical indicators that a bounce upwards for BTC is coming soon. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rwq43wgfprz61.png?width=3304&amp;format=png&amp;auto=webp&amp;s=86887da85a76ef42c821f083494cf3e4156241cc\">https://preview.redd.it/rwq43wgfprz61.png?width=3304&amp;format=png&amp;auto=webp&amp;s=86887da85a76ef42c821f083494cf3e4156241cc</a></p>\n\n<p><strong>How To Read This Chart:</strong></p>\n\n<ul>\n<li>Using ETH’s historical price action, we can plot logarithmic regression trendlines that coincide with historical levels of support and resistance.</li>\n<li>These lines can be useful for navigating bull and bear market cycles, as well as for identifying critical levels of support and resistance.</li>\n<li>Do note that with each day that passes, ETH&#39;s logarithmic regression rainbow trends higher. This means the longer ETH can continue to trend higher to the next subsequent regression trendline, potentially the higher the market cycle top.</li>\n</ul>\n\n<p><strong>What You Should Know:</strong></p>\n\n<ul>\n<li>At a current price of $3,392, ETH currently resides between Band 5 ($2,857) and Band 6 ($5,327).</li>\n<li>Based on these regression lines, ETH&#39;s next big test of resistance is currently at $5,327 while support resides around $2,857.</li>\n<li>ETH would have to rally +57% to test resistance at $5,327 and would have to correct -16% to test support at $2,857.</li>\n<li>A move up to Band 8, which coincides with ETH’s previous market cycle top, would imply a $16,164 Ether and a +313.0% return from current price.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>One of the charts that I found to be most interesting was BTC&#39;s 200W moving average multiple. This chart (below) shows a trendline that measures BTC&#39;s average price over the prior ~ 4 years. The multiples you see show the peak of BTC&#39;s price as a function of the spot price of the trendline. </p>\n\n<p>One of the most bullish indicators I&#39;ve seen is that BTC&#39;s current multiple is just 3.5X. Compare that to the bull market in 2018 where BTC hit 15.2X. Prior to that it was 13.2X (2014) and 10.3X (2013).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/yzf7o67uprz61.png?width=3560&amp;format=png&amp;auto=webp&amp;s=204d081f6e3a586612dfcfe627441dd88e89a2da\">https://preview.redd.it/yzf7o67uprz61.png?width=3560&amp;format=png&amp;auto=webp&amp;s=204d081f6e3a586612dfcfe627441dd88e89a2da</a></p>\n\n<p><strong>What You Should Know:</strong></p>\n\n<ul>\n<li>In prior bull market cycles, BTC has traded as much as 10x - 15x its 200-week moving average prior to entering a bear market.</li>\n<li>BTC&#39;s 200-week moving average is 3.54x. That is, BTC is trading at 3.54x its 200-week moving average ($12,630), <strong>down from last week&#39;s multiple of 3.74x and representing a 3-month low.</strong></li>\n<li>Given today&#39;s 200-week moving average of $12,630, a 10x - 15x multiple would imply a BTC price of $126,300 - $189,450.</li>\n<li>BTC&#39;s 200-week moving average multiple hit a local high of 10.3X for the week of April 4, 2013. On April 9, 2013, BTC hit a cycle high of $259.</li>\n<li>BTC&#39;s 200-week moving average multiple hit a local high of 13.2X for the week of November 25, 2013, which coincided with a market cycle top of $1,158.</li>\n<li>BTC&#39;s 200-week moving average multiple hit a local high of 15.2X for the week of December 11, 2017. That same week, price hit a cycle high of $19,660.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>This next chart really goes both ways. It shows that there is still room for BTC to grow. But, if we really are heading for a bear market, it shows how much BTC can still tumble. Again, the other indicators I have read about seem to point strongly toward the bull market continuing.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/4tq27b16qrz61.png?width=3386&amp;format=png&amp;auto=webp&amp;s=238e764c45f2aebca088d97e2424089414c7b501\">https://preview.redd.it/4tq27b16qrz61.png?width=3386&amp;format=png&amp;auto=webp&amp;s=238e764c45f2aebca088d97e2424089414c7b501</a></p>\n\n<p><strong>How To Read This Chart:</strong></p>\n\n<ul>\n<li>BTC&#39;s logarithmic growth curve consists of two sets of curved trendlines that have historically proven to be critical levels of support and resistance.</li>\n<li>While both lines point to price ranges whereby BTC is arguably &quot;overbought&quot; or &quot;oversold,&quot; they also represent a notable underlying property of BTC that can be found in social networks, technological innovations, pandemics, societies, and economics: exponential growth.</li>\n</ul>\n\n<p><strong>What You Should Know:</strong></p>\n\n<ul>\n<li>BTC is a +86% to +144% move away from entering into &quot;overbought&quot; territory, which is currently between $83,306 and $109,134.</li>\n<li>BTC is a -50% to -62% move away from falling into &quot;oversold&quot; territory. This week&#39;s range is $17,143 - $22,458.</li>\n<li>At a current price of $44,700, BTC resides in the 49 percentile of the logarithmic growth curve&#39;s $17,143 - $109,134 range.</li>\n</ul>\n\n<p>Bitcoin&#39;s SOPR indicator chart is one of my favorites. SOPR stands for Spent Output Profit Ratio and is a simple calculation. It is the price of each BTC when it was last moved divided by the value at creation of the output. To simplify it further, think of SOPR as price sold : price paid. Your goal is to have a SOPR of &gt; 1 as that means you are making a profit.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tpl8hvtkqrz61.png?width=3510&amp;format=png&amp;auto=webp&amp;s=a6fbdadb643bedf814a72366d3ebbffe3955c849\">https://preview.redd.it/tpl8hvtkqrz61.png?width=3510&amp;format=png&amp;auto=webp&amp;s=a6fbdadb643bedf814a72366d3ebbffe3955c849</a></p>\n\n<p><strong>How To Read This Chart:</strong></p>\n\n<ul>\n<li>Bitcoin&#39;s Spent Output Profit Ratio (SOPR) is an indicator that is calculated by dividing the realized value (the price of each BTC when it was last moved) divided by the value at creation of the output. Said differently, it is price sold / price paid.</li>\n<li>A SOPR &gt; 1 means that the owners of spent outputs are in profit at the time of the transaction. Because a reading &lt; 1 means market participants would have to sell at a loss, few are willing to do so in the midst of a bull market.</li>\n<li>History shows that when the indicator approaches or reverts down to a reading of 1 in a bull market, bullish momentum is likely to follow. As such, the SOPR oscillator can serve as a useful indicator for identifying local tops &amp; bottoms.</li>\n<li>When used in conjunction with other indicators and oscillators, the SOPR indicator may be able to confirm a market cycle top or bottom.</li>\n</ul>\n\n<p><strong>What You Should Know:</strong></p>\n\n<ul>\n<li>Since hitting a local high of 1.21 in December 2020, the SOPR indicator (7-day moving average) has been in a downtrend despite BTC&#39;s bullish price action.</li>\n<li>At the time of writing, BTC&#39;s SOPR indicator sits at a reading of 1.0126, a level last seen in September 2020.</li>\n<li>With the SOPR indicator fast approaching a reading of 1, one could expect BTC to bounce higher in the days/weeks ahead.</li>\n<li>Note that in 2017 we saw the SOPR indicator mean revert down towards 1 while price consolidated. Shortly thereafter, price rallied meaningfully higher and resumed its macro uptrend.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>BUT WAIT THERE&#39;S MORE!</strong></p>\n\n<p>There&#39;s a few things about this bull run and the correct market correction that tells me that a major upswing is yet to come. First, we all know that Voldeidiot has an outsized impact on the crypto market. We also know that he tends to have a smaller impact over time as people start to ignore his antics (c.f. DOGE). Certainly his tweets couldn&#39;t have come at a worse time given the other bad news that day about crypto - but recall again from 2017-2018 that all it took was a single threat to somehow regulate BTC to send the markets crashing. We&#39;ve seen numerous threats now over the past few months including ignorant statements by Yanet Yellin&#39;, SUC&#39;s lawsuit against Ripple, and entire countries &quot;outlawing&quot; crypto followed by a rapid &quot;Oops, just kidding&quot; (c.f. Turkey).</p>\n\n<p>IMHO, we are seeing the cumulative effect of all of that bad news impacting the market. If you plot when all this news happened as a function of the spot price of BTC, you&#39;ll see them as hammer blows on crypto. What you will also see is that each successive blow has a smaller and smaller effect. In some cases, like Ripple, it outright ignores them and becomes parabolic. </p>\n\n<p>Ultimately, that is MY basis to have faith in this marketplace. We are at a time where we are seeing unprecedented innovation in the crypto space. Ignore the meme coins for a second - think about the EIP-1559 upgrade for ETH, the upcoming PoS that will decrease ETH&#39;s energy costs by 100X, and how ETH is poised to (sort of) become deflationary. Now think about the upcoming parachain auctions for Polkadot and Kusama. The massive innovation around Cardano. The international use cases for Stellar.</p>\n\n<p>Now bring the meme coins into the picture. Millions of people spending their lunch money and making enough to buy a car. We are seeing &quot;the masses&quot; enter the crypto space. From young kids who are sensing a cool trend, to middle aged adults trying to get by, to older adults looking for a multiple on a retirement portfolio - WE ARE ALL IN.</p>\n\n<p>And it&#39;s all because of the massive innovation, the sheer energy from &lt;viewers like you&gt;, and the nonstop news coverage of it all. Success stories on CNN. Conservative media outlets jumping on the train (when do they ever!?). International outlets covering a BTC story at least once a day. ALL of the financial outlets talking about this...</p>\n\n<p>Which brings me to my next point. Once again, you may have a psychotic whale threatening the market with some ill-informed statements - but the BTC ocean has A LOT of whales. What&#39;s the market cap again? OH YEAH - it&#39;s bigger than almost everything on PLANET EARTH. Relatively speaking, he can take HIS lunch money and go home. If his overpriced plastic car company sells their holdings, SO WHAT? Sure, the market will react negatively for a little while. We may even see other whales jump in and sell. But what about more informed investors? What about the smart professionals who DO THIS EVERY DAY? What about you guys, who may have a lot riding on this?</p>\n\n<p>Those dips will be honest to goodness buying opportunities. I DO believe that technical analysis has a role in this. I ALSO know that while history doesn&#39;t always repeat, historical performance IS a good indicator for future potential. And the potential for BTC and some alt coins (and even some meme coins!) is nothing but blue skies.</p>\n\n<p>&#x200B;</p>\n\n<p><em>Everything I&#39;ve written (other than Kraken&#39;s awesome analysis) is solely my opinion. I am not a financial advisor, and I am NOT giving you financial advice. YMMV. You should do your own research and make your own financial decisions. Invest at your own risk. GOOD LUCK!</em></p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/nevx6c/the_bull_market_continues_an_emotechnical_analysis/",
  "subreddit": "CryptoCurrency",
  "id": "nevx6c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799678
}