{
  "author": "ForeverEqual",
  "the_new_excerpt": "I have seen quite a few posts here about others just not dealing well with the\ngood days. I understand that it can be hard to see a stock you've invested in go\nup so much. It can easily take hold of your emotions and cause you to make some\npretty irrational choices. My advice to all of you during…",
  "original_created_utc": 1621004156,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサイトでは、他の人が楽しい日々をうまく過ごせないという投稿をたくさん見てきました。\n好調な日にうまく対処できないという書き込みをよく見かけます。自分が投資した銘柄が大きく上昇するのを見るのはつらいことだと思います。\n自分が投資した銘柄が大きく上昇するのを見るのは辛いことだと思います。感情に流されて、かなり不合理な判断をしてしまうことがあります。\n不合理な選択をしてしまうこともあるでしょう。私が皆さんにアドバイスするのは...。",
      "title": "緑の日を気にしない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到不少关于其他人不能很好地应对好日子的帖子。\n好日子。我明白，看到自己投资的股票上涨，可能会很难受。\n涨了这么多。它很容易控制住你的情绪，使你做出一些\n非常不理智的选择。我对你们所有人的建议是在...",
      "title": "不要担心绿色的日子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到不少關於其他人不能很好地應對好日子的帖子。\n好日子。我明白，看到自己投資的股票上漲，可能會很難受。\n漲了這麼多。它很容易控制住你的情緒，使你做出一些\n非常不理智的選擇。我對你們所有人的建議是在...",
      "title": "不要擔心綠色的日子"
    }
  ],
  "title": "Don't worry about the green days",
  "created_utc": 1621010915,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen quite a few posts here about others just not dealing well with the good days. I understand that it can be hard to see a stock you&#39;ve invested in go up so much. It can easily take hold of your emotions and cause you to make some pretty irrational choices. My advice to all of you during green days like this is the following:</p>\n\n<ul>\n<li>Look at your investments and see if anything has changed. If nothing has changed fundamentally, then it would make no sense to sell now.</li>\n<li>Look at your portfolio and see if you are heavy in any particular sector.. Readjust as necessary based on your risk tolerance.</li>\n<li>Lastly, don&#39;t look at the graphs all day. I know it is hard for me when I see green everywhere in my portfolio to not question my investing choices. However, it will only do you harm to keep looking at them all day. If your DD on a company has not changed and the price change is due to market volatility, then you have nothing to worry about for today.</li>\n</ul>\n\n<p>Remember there will be green days like today, but there will also be red days in the future as well. Take days like today to step away for a bit.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>P.S. (hopefully this was obvious /s. Just replace &quot;green&quot; with &quot;red&quot; and &quot;up&quot; with &quot;down&quot; and it just about sums up a normal post that is made on red days)</p>\n</div><!-- SC_ON -->",
  "score": 2242,
  "permalink": "/r/stocks/comments/ncajlk/dont_worry_about_the_green_days/",
  "subreddit": "stocks",
  "id": "ncajlk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803294
}