{
  "author": "A_Queff_In_Time",
  "original_created_utc": 1647888501,
  "title": "Social media only took off about 15 years ago. While it has been revolutionary, there have been unintended consequences (disinformation, polarization, teenage mental health, etc). We all believe Cryptocurrency will also be revolutionary but what unintended consequences do you foresee for Crypto?",
  "created_utc": 1647905500,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all. Smart phones and social media have without a doubt changed the world rapidly and has forever changed our lives. However there have been growing pains and some unintended consequences of this technology adoption. Do you foresee any unintended consequences as a result of mass adoption of Crypto/Blockchain technology? Obviously there will be major economic changes ranging from job displacement and inflows/outflows of capital to and from this new technology. But I am really focused on the potential societal effects that it may cause.  &lt;/p&gt;\n\n&lt;p&gt;What are your thoughts?&lt;/p&gt;\n\n&lt;p&gt;EDIT: I was really looking for outside of the box thinking. Not the typical scams, losing money, shills, and pump and dumps we all know about.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 502,
  "permalink": "/r/CryptoCurrency/comments/tjix4u/social_media_only_took_off_about_15_years_ago/",
  "subreddit": "CryptoCurrency",
  "id": "tjix4u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all. Smart phones and social media have without a doubt changed\nthe world rapidly and has forever changed our lives. However there have been\ngrowing pains and some unintended consequences of this technology adoption. Do\nyou foresee any unintended consequences as a result of mass…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルがすべてを物語っています。スマートフォンとソーシャルメディアは間違いなく変化した\n私たちの生活を大きく変えました。しかし、そこには\nこの技術を採用したことで、成長痛や予期せぬ結果も生じています。また\nこのような大量生産の結果、何か予期せぬ事態が起こる可能性はありますか？",
      "title": "ソーシャルメディアが普及したのは、15年ほど前です。革命的であった一方で、意図しない結果（偽情報、偏向、10代の精神衛生など）も生じています。私たちは暗号通貨も革命的なものになると信じていますが、あなたは暗号通貨についてどのような意図しない結果を予想していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切。智能手机和社交媒体无疑已经迅速改变了\n迅速改变了世界，并永远改变了我们的生活。然而，也有\n这种技术的采用带来了成长的痛苦和一些意想不到的后果。是否\n你是否预见到任何意外的后果，因为大量的...",
      "title": "社交媒体大约在15年前才开始兴起。虽然它是革命性的，但也有意想不到的后果（虚假信息、两极化、青少年心理健康等）。我们都相信加密货币也将是革命性的，但你预见到加密货币有什么意外的后果？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切。智能手機和社交媒體無疑已經迅速改變了\n迅速改變了世界，並永遠改變了我們的生活。然而，也有\n這種技術的採用帶來了成長的痛苦和一些意想不到的後果。是否\n你是否預見到任何意外的後果，因爲大量的...",
      "title": "社交媒體大約在15年前纔開始興起。雖然它是革命性的，但也有意想不到的後果（虛假信息、兩極化、青少年心理健康等）。我們都相信加密貨幣也將是革命性的，但你預見到加密貨幣有什麼意外的後果？"
    }
  ]
}