{
  "author": "toyume",
  "original_created_utc": 1640512387,
  "title": "Can we reward original and helpful content that take effort to write? Here are great examples of great DD, research, and educational posts from this December",
  "created_utc": 1640532643,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Almost everyday I look through 10+ pages of daily posts here on CC (I&amp;#39;m in between jobs right now and have more free time than I&amp;#39;m used to) and the huge majority of posts here are reaction posts, one-liners, or shower thoughts types. These are great because it feels like you&amp;#39;re chilling with friends venting and celebrating.&lt;/p&gt;\n\n&lt;p&gt;But I also found there we have many users here who do a lot of research and put a lot of effort into researching topic, and writing about it.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, these research posts almost always get buried. They don&amp;#39;t get as much attention as they deserve despite bring in a lot of educational value, tech discussion, or excellent resources.&lt;/p&gt;\n\n&lt;p&gt;Here are some of the most helpful posts this month of December:&lt;/p&gt;\n\n&lt;h1&gt;1. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/r725cs/crypto_winter_survival_gear/\"&gt;Crypto Winter Survival Gear&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;If you thought the dip early this month was bad, what are you going to do when the -90% bear market actually comes and your fiat is burned?&lt;/p&gt;\n\n&lt;p&gt;We hibernate of course. Here the OP introduces how you can passively get bits of crypto while we sleep through winter. Includes active faucets for Nano, Matic, Algo, and several other coins, plus a wide list of play-to-earn games to pass the time until the sun shines on us again.&lt;/p&gt;\n\n&lt;h1&gt;2. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/r1d648/12_creative_ideas_to_hide_your_seed_phrase/\"&gt;Creative ideas to hide your seed phrase&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;A wise redditor once said, &amp;quot;Not your keys not your coins, but if you lose your seed phrase then they&amp;#39;re not your coins either, dumbass.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This post is 95% practical advice on how to actually keep your phrase secure, and 5% &amp;quot;wait, will that actually work?&amp;quot; absurdity.&lt;/p&gt;\n\n&lt;p&gt;If you have a &amp;quot;friend&amp;quot; who still keeps their phrase on a post-it note inside their wallet, then this might be the most helpful post you can share with them this year.&lt;/p&gt;\n\n&lt;h1&gt;3. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/r7n8yd/tax_tidbits_from_a_cpa_us/\"&gt;Tax tips for users in the United States from a Certified Public Accountant&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;Crypto tax hurts to think about, but a necessity when the memecoin you gambled your mortgage moon. A CPA jumps in to the rescue with answers to a full page of questions like:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Why holding long term gives you more tax benefits than selling quickly&lt;/li&gt;\n&lt;li&gt;Are Coinbase rewards taxable?&lt;/li&gt;\n&lt;li&gt;Can I get what I spent on overpriced graphic cards for mining as tax deductible costs?&lt;/li&gt;\n&lt;li&gt;Are NFT&amp;#39;s taxed differently from coins/tokens?&lt;/li&gt;\n&lt;li&gt;Monero won&amp;#39;t save you from taxes (not a question, but you should know it anyway)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Note that I&amp;#39;m not from the US and can&amp;#39;t check the accuracy of the advice given here.&lt;/p&gt;\n\n&lt;h1&gt;4. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/ragxwq/i_spent_5_hours_researching_what_a_dao_is_so_you/\"&gt;Wtf is a DAO?&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;A few weeks ago, a DAO pooled together $47 million worth of Eth in an attmept to buy the US Constitution.&lt;/p&gt;\n\n&lt;p&gt;A few weeks ago, I also realized I had no idea what a DAO is and how they work.&lt;/p&gt;\n\n&lt;p&gt;I definitely recommend giving it a read to round out your knowledge about the crypto industry.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s everything you need to know about DAOs like how it&amp;#39;s different from traditional organizations, their purpose, and how to join one.&lt;/p&gt;\n\n&lt;h1&gt;5. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/rebesb/i_reviewed_one_of_the_most_commonly_mentioned/\"&gt;Is it actually worth your time to play Crypto Royale - one of the most mentioned crypto games on CC?&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;Are crypto game reviews a thing already?&lt;/p&gt;\n\n&lt;p&gt;Here the OP spends 10 days playing Crypto Royale and gives a very informative chronicle of their experience. This is a big eye opener on how these kind of games and their tokenomics work, and how much time you need to pour into it to make it profitable.&lt;/p&gt;\n\n&lt;p&gt;The game is still fairly new and only has a small number of holders which means you&amp;#39;ll be an early adopter. The mechanics are also easy to learn, but definitely give this a read before you jump into it.&lt;/p&gt;\n\n&lt;h1&gt;6. &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/re7ohq/i_made_a_game_using_looprings_zkrollup_layer_2/\"&gt;I made a game using Loopring&amp;#39;s zkRollup Layer 2 ETH tech to show how easy it is&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;TIL being a shill on the comments section is not the only career path to promote the tech behind crypto.&lt;/p&gt;\n\n&lt;p&gt;The OP created a game from the ground up to showcase how easy it is to incorporate crypto. It&amp;#39;s probably the first ever LRC integrated game you can play on phones and PC.&lt;/p&gt;\n\n&lt;p&gt;The game is simple where you need to travel/survive through a course in a battle against time. All you need to play is 1 LRC, then 85% of the pooled LRC is given back to users with the highest scores in the leaderboard (1st place gets 40%). There&amp;#39;s even a referral program where you can invite your friends to get your LRC refunded back to you!&lt;/p&gt;\n\n&lt;p&gt;It will only be active for a few more weeks (until Jan 7th 2022), so go try it!&lt;/p&gt;\n\n&lt;h1&gt;7. &lt;a href=\"https://np.reddit.com/r/CryptoTax/comments/re6jal/cryptocurrency_tax_faq/\"&gt;The in-depth guide with resources on how to properly file your crypto taxes in the US&lt;/a&gt;&lt;/h1&gt;\n\n&lt;p&gt;The earlier tax post was focused on tips from a CPA, while this one will teach you how to actually get started.&lt;/p&gt;\n\n&lt;p&gt;The guide covers how to:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Calculate how much you owe&lt;/li&gt;\n&lt;li&gt;Reduce taxes&lt;/li&gt;\n&lt;li&gt;Choose which software to use&lt;/li&gt;\n&lt;li&gt;Know what is taxable and what is not&lt;/li&gt;\n&lt;li&gt;Hire a professional who can help&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;There&amp;#39;s also a huge list of extra FAQs and resources to help you find your bearings and not get hunted down by the IRS.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 247,
  "permalink": "/r/CryptoCurrency/comments/rotysb/can_we_reward_original_and_helpful_content_that/",
  "subreddit": "CryptoCurrency",
  "id": "rotysb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Almost everyday I look through 10+ pages of daily posts here on CC (I'm in\nbetween jobs right now and have more free time than I'm used to) and the huge\nmajority of posts here are reaction posts, one-liners, or shower thoughts types.\nThese are great because it feels like you're chilling with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほぼ毎日、このCCの10ページ以上の日々の投稿に目を通しています。\n今、仕事の合間で、以前より自由な時間があります）。\nここの投稿の大半はリアクション投稿、一発ギャグ投稿、感想シャワー系です。\nこのような投稿は、まるで一緒に冷やかしているような感じがして、とてもいいものです。",
      "title": "書くのに手間がかかる、オリジナルで役に立つコンテンツに報酬を与えることができるか？この12月の素晴らしいDD、リサーチ、教育的な投稿の例をご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几乎每天我都会翻阅CC网站上每天10多页的帖子（我在\n我现在处于两份工作之间，有比我习惯的更多的空闲时间），而这里的绝大部分帖子都是反应。\n这里的大部分帖子都是反应帖、单口相声，或者是洗澡的想法类型。\n这些都很好，因为感觉就像你在与人聊天。",
      "title": "我们能不能奖励花费精力写的原创和有益的内容？以下是今年12月的优秀DD、研究和教育帖子的例子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾乎每天我都會翻閱CC網站上每天10多頁的帖子（我在\n我現在處於兩份工作之間，有比我習慣的更多的空閒時間），而這裏的絕大部分帖子都是反應。\n這裏的大部分帖子都是反應帖、單口相聲，或者是洗澡的想法類型。\n這些都很好，因爲感覺就像你在與人聊天。",
      "title": "我們能不能獎勵花費精力寫的原創和有益的內容？以下是今年12月的優秀DD、研究和教育帖子的例子"
    }
  ]
}