{
  "author": "PapaLongD0ng",
  "the_new_excerpt": "Hey guys, if any of you guys were waiting for a correction and aren’t buying at\nthese prices, something is just wrong. Please don’t ask should I buy now? When\nbitcoin is back trading at 65k. You have the chance to buy rn, but won’t because\nyou’re scared and hope we’ll drop more. We just had a 50%…",
  "original_created_utc": 1621820249,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、もし皆さんの中に、調整局面を待っていて、この価格で買わない人がいるとしたら\nこの価格で買わないのは、何かが間違っている。くれぐれも、「今買うべきか？と聞かないでください。\nビットコインが65kで取引を再開したとき。今なら買うチャンスがあるのに、怖くて買わない。\nもっと下がるのではないかと怖くて買わないのです。我々はちょうど50％の...",
      "title": "この価格で買っていない人は、\"今買うべきか？\"と聞かないでください。私たちがまた新しいアスレチックを作るときに。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们，如果你们中的任何一个人在等待修正而不在这些价格上买进\n的价格，那就有些不对劲了。请不要问我现在应该买吗？当\n比特币回到了65K的交易价格。你现在有机会买入，但不会因为\n因为你很害怕，希望我们会跌得更多。我们刚刚有一个50%的...",
      "title": "如果你不在这些价格下购买，请不要问 \"我现在应该买吗？\" 当我们重新制造新的神话时。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們，如果你們中的任何一個人在等待修正而不在這些價格上買進\n的價格，那就有些不對勁了。請不要問我現在應該買嗎？當\n比特幣回到了65K的交易價格。你現在有機會買入，但不會因爲\n因爲你很害怕，希望我們會跌得更多。我們剛剛有一個50%的...",
      "title": "如果你不在這些價格下購買，請不要問 \"我現在應該買嗎？\" 當我們重新制造新的神話時。"
    }
  ],
  "title": "If you’re not buying at these prices, please don’t ask “should I buy now?” When we’re back making new aths.",
  "created_utc": 1621838308,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys, if any of you guys were waiting for a correction and aren’t buying at these prices, something is just wrong. Please don’t ask should I buy now? When bitcoin is back trading at 65k. You have the chance to buy rn, but won’t because you’re scared and hope we’ll drop more. We just had a 50% correction, and you’re hoping it’ll drop more. Don’t miss this great buying opportunity. Good luck and hodl strong.</p>\n</div><!-- SC_ON -->",
  "score": 2003,
  "permalink": "/r/CryptoCurrency/comments/njmj21/if_youre_not_buying_at_these_prices_please_dont/",
  "subreddit": "CryptoCurrency",
  "id": "njmj21",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385278
}