{
  "author": "Exlixis23",
  "original_created_utc": 1644401195,
  "title": "Why do chicks wear leggings that go all the way down their buttcrack at the gym?",
  "created_utc": 1644410756,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t get this new trend and find it very uncomfortable to look at (don&amp;#39;t come up with that bullshit &amp;#39;then just don&amp;#39;t look&amp;#39; argument, thanks).&lt;/p&gt;\n\n&lt;p&gt;Those leggings go so far up their buttcrack, it can&amp;#39;t possibly be comfortable. Now I get it, you have a nice booty, you want to show it to the whole entire universe and walk in the gym like you own it. Fine by me but...it&amp;#39;s a tad weird, isn&amp;#39;t it?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve got a pretty nice set of balls. Should I wear leggings so tight they split my balls apart and walk in the gym like I own it?!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 182,
  "permalink": "/r/TooAfraidToAsk/comments/soa2w8/why_do_chicks_wear_leggings_that_go_all_the_way/",
  "subreddit": "TooAfraidToAsk",
  "id": "soa2w8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't get this new trend and find it very uncomfortable to look at (don't come\nup with that bullshit 'then just don't look' argument, thanks).\n\nThose leggings go so far up their buttcrack, it can't possibly be comfortable.\nNow I get it, you have a nice booty, you want to show it to the whole…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この新しいトレンドは理解できないし、見るのも非常に不快だ（出てこないでください）。\n見なきゃいいじゃん」なんて、くだらない言い訳はやめてください。）\n\nあのレギンスはお尻の割れ目まであるんだから、快適なわけがない。\nあなたはいいお尻をしていて、それをみんなに見せたいんでしょうけど...。",
      "title": "なぜヒヨコはジムでお尻の割れ目まであるレギンスを履くのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白这种新趋势，觉得看了很不舒服（不要想出'那就不看'这种狗屁理由）。\n不要用那种 \"那就别看 \"的狗屁说法，谢谢）。\n\n那些紧身裤在她们的臀部裂缝中走得那么远，不可能是舒适的。\n现在我明白了，你有一个漂亮的臀部，你想把它展示给全...",
      "title": "为什么小妞们在健身房里穿的紧身裤一直延伸到她们的屁股沟？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白這種新趨勢，覺得看了很不舒服（不要想出'那就不看'這種狗屁理由）。\n不要用那種 \"那就別看 \"的狗屁說法，謝謝）。\n\n那些緊身褲在她們的臀部裂縫中走得那麼遠，不可能是舒適的。\n現在我明白了，你有一個漂亮的臀部，你想把它展示給全...",
      "title": "爲什麼小妞們在健身房裏穿的緊身褲一直延伸到她們的屁股溝？"
    }
  ]
}