{
  "author": "quangctkm9207",
  "original_created_utc": 1629809053,
  "title": "I built my first Mac app for my own need, then I found out that others love it too.",
  "created_utc": 1629818678,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>Back weeks ago, I felt bored with my Mac which I spent the whole day coding on. Besides, I missed the peaceful moments that my puppy was sleeping around while I studied during school time.  </p>\n\n<p>Then I came up with the idea to build an app that shows a sleeping pet on the menu bar, and the pet might remind you to take a break too (I am a fan of the Pomodoro technique). I was so excited about that and spent nights and weekends building it. Besides, I ordered the freelance designer to sketch the icon pack too.  </p>\n\n<p>After finishing MVP, I shared it with some of my friends for feedback. After several feedback loops, I improved the app and released the first version on Mac App Store as a paid app ($3.99).</p>\n\n<p>Then, several days ago, I decided to share on /macapps subreddit to get more feedback. Unbelievably, it became a hit. I got a lot of great comments and feature requests that I have not even thought of. Some of them even had a private chat with me. They are so nice to give me suggestions. The most useful ones are from a CTO who gave me an actionable list of feedback.  </p>\n\n<p>Then, after gathering feedback, I jumped into updating the app and releasing a new version within 24 hours. Wow, people love that, especially, the users who had requests for new pets. I added 3 new ones in that version. It reinforced what I learned that &quot;listening to the users and making them happy&quot; is a correct direction for product development and business. And the great idea usually is the one that solves our own problem.  </p>\n\n<p>By the way, here is my app (PetBar) on <a href=\"https://apps.apple.com/jp/app/petbar-a-pet-on-your-menu-bar/id1580266242?l=en&amp;mt=12\">App Store</a> in case you want to check it out.</p>\n\n<p>Thanks for reading and have a nice day.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/dXRf2_1HeATjlvVZth7u_5EI5Obi-uVt50LmaY8D9x8.jpg?auto=webp&s=9350a16a2dc2a2e47bae42f0e6066799e9127f1f",
          "width": 630,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/dXRf2_1HeATjlvVZth7u_5EI5Obi-uVt50LmaY8D9x8.jpg?width=108&crop=smart&auto=webp&s=16ecfb4065592446ed9471617ebd026016ef44bb",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/dXRf2_1HeATjlvVZth7u_5EI5Obi-uVt50LmaY8D9x8.jpg?width=216&crop=smart&auto=webp&s=1a74b20c7cfbc2a0c3f210ebeb995294bb93be1e",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/dXRf2_1HeATjlvVZth7u_5EI5Obi-uVt50LmaY8D9x8.jpg?width=320&crop=smart&auto=webp&s=2ee1f5d993ee9fe6277e954a6223e652c154ce05",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "HULBaRD7QiiMkASH52lJxcm-Ff87FsrLMUcjJOPP1cE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/paml0z/i_built_my_first_mac_app_for_my_own_need_then_i/",
  "subreddit": "SideProject",
  "id": "paml0z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone,\n\nBack weeks ago, I felt bored with my Mac which I spent the whole day coding on.\nBesides, I missed the peaceful moments that my puppy was sleeping around while I\nstudied during school time.\n\nThen I came up with the idea to build an app that shows a sleeping pet on the\nmenu bar, and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n数週間前、私は一日中コーディングしていたMacに飽きを感じていました。\nその上、学校で勉強している間、子犬が寝ている平和な時間が恋しくなりました。\n穏やかな時間を過ごしたいと思っていました。\n\nそこで私は、寝ているペットをメニューに表示するアプリを作ることを思いつきました。\nメニューバーに寝ているペットを表示するアプリを作ることを思いついたのです...",
      "title": "私は自分の必要性から最初のMacアプリを作ったのですが、その後、他の人も気に入っていることを知りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n几周前，我对我的Mac感到厌烦，因为我花了一整天的时间在上面编码。\n此外，我很怀念我的小狗在我上学期间睡觉时的宁静时光。\n在学校里学习的时候，我错过了我的小狗在周围睡觉的宁静时刻。\n\n于是我想出了一个主意，建立一个应用程序，在电脑上显示睡着的宠物。\n菜单栏上显示一个正在睡觉的宠物，而这是我的想法。",
      "title": "我为了自己的需要建立了我的第一个Mac应用程序，然后我发现其他人也喜欢它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n幾周前，我對我的Mac感到厭煩，因爲我花了一整天的時間在上面編碼。\n此外，我很懷念我的小狗在我上學期間睡覺時的寧靜時光。\n在學校裏學習的時候，我錯過了我的小狗在周圍睡覺的寧靜時刻。\n\n於是我想出了一個主意，建立一個應用程序，在電腦上顯示睡着的寵物。\n菜單欄上顯示一個正在睡覺的寵物，而這是我的想法。",
      "title": "我爲了自己的需要建立了我的第一個Mac應用程序，然後我發現其他人也喜歡它。"
    }
  ]
}