{
  "author": "ineedbuttrubs",
  "original_created_utc": 1651709077,
  "title": "Why do I love penis so much? Does this make me a whore?",
  "created_utc": 1651719675,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is this weird? I love the way they look. Some people say they are so gross, but I love looking at them?? Is this weird? &lt;/p&gt;\n\n&lt;p&gt;And given the opportunity, if one of my guy friends whipped one out, I wouldn’t be opposed to giving a bj?? It’s never happened before btw, but I don’t want to be a whore for thinking about it? &lt;/p&gt;\n\n&lt;p&gt;Does this make me a whore?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 365,
  "permalink": "/r/TooAfraidToAsk/comments/uikbum/why_do_i_love_penis_so_much_does_this_make_me_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "uikbum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Is this weird? I love the way they look. Some people say they are so gross, but\nI love looking at them?? Is this weird?\n\nAnd given the opportunity, if one of my guy friends whipped one out, I wouldn’t\nbe opposed to giving a bj?? It’s never happened before btw, but I don’t want to\nbe a whore for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これって変ですか？私はこの見た目が好きです。キモイって言われることもあるけど\n私は見るのが好きなの？これって変ですか？\n\nそして、機会があれば、私の男の友人のいずれかが1つを振っている場合、私は反対しないでしょう。\nをすることに反対ですか？今までそんなことなかったんだけど...。\n娼婦にはなりたくない",
      "title": "どうしてこんなにペニスが好きなんだろう？これは私を淫乱にするのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这很奇怪吗？我喜欢它们的样子。有些人说它们太恶心了，但\n我喜欢看它们？这很奇怪吗？\n\n如果有机会的话，如果我的一个男性朋友拿出一个，我也不会反对给他做个爱。\n我也不反对给人打飞机。这在以前从未发生过，但我不想成为一个妓女。\n成为一个妓女...",
      "title": "为什么我这么喜欢阴茎？这是否使我成为一个妓女？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這很奇怪嗎？我喜歡它們的樣子。有些人說它們太噁心了，但\n我喜歡看它們？這很奇怪嗎？\n\n如果有機會的話，如果我的一個男性朋友拿出一個，我也不會反對給他做個愛。\n我也不反對給人打飛機。這在以前從未發生過，但我不想成爲一個妓女。\n成爲一個妓女...",
      "title": "爲什麼我這麼喜歡陰莖？這是否使我成爲一個妓女？"
    }
  ]
}