{
  "author": "Eldeanio100",
  "original_created_utc": 1630682947,
  "title": "I have called it a day",
  "created_utc": 1630690233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Exactly what it says.</p>\n\n<p>I have gained over 300% profit from crypto, so I have called time on my journey for now. I have made enough for a house deposit and a family member offered to double it if I took my gains now whilst the increase in profit is through the roof as there is a stock market correction around the corner.</p>\n\n<p>It was all thanks to Solana, so thank you SOL. Yeah it may moon some more but I have got out of it all what I wanted, so I can’t complain.</p>\n\n<p>I have only my staked ETH which I can’t remove but hey…hopefully in 2022 when ETH 2.0 gets released I can refit the house.</p>\n\n<p>It’s been a stressful journey and a fun one at the same time and I wish everyone a safe and pleasant journey.</p>\n\n<p>Keep hodling your bags until you hit the magic number.</p>\n\n<p>Peace out and keep staring at the charts.</p>\n\n<p>Oh and may the moons grow some more and I can have a refit in 2025</p>\n</div><!-- SC_ON -->",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/ph7g4r/i_have_called_it_a_day/",
  "subreddit": "CryptoCurrency",
  "id": "ph7g4r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Exactly what it says.\n\nI have gained over 300% profit from crypto, so I have called time on my journey\nfor now. I have made enough for a house deposit and a family member offered to\ndouble it if I took my gains now whilst the increase in profit is through the\nroof as there is a stock market…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まさにその通りです。\n\n私は暗号から300％以上の利益を得たので、私の旅に時間をかけました。\n今のところ。家を建てるのに十分な額を稼ぎましたが、家族から、今の利益を取れば倍にしてもいいと言われました。\n家の預金に十分な額を稼ぎましたが、家族が、今利益を得れば倍にしてくれると言ってくれました。\n株式市場があるので、利益の増加は天井知らずです...。",
      "title": "私はそれを一日と呼んだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正像它所说的那样。\n\n我已经从加密货币中获得了超过300%的利润，所以我已经在我的旅程中调用了时间\n暂时。我已经赚够了房子的押金，一个家庭成员提出，如果我接受的话，就把它翻倍。\n如果我现在把我的收益加倍，而利润的增长是通过\n涨，因为有一个股票市场......",
      "title": "我已经结束了一天的工作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正像它所說的那樣。\n\n我已經從加密貨幣中獲得了超過300%的利潤，所以我已經在我的旅程中調用了時間\n暫時。我已經賺夠了房子的押金，一個家庭成員提出，如果我接受的話，就把它翻倍。\n如果我現在把我的收益加倍，而利潤的增長是通過\n漲，因爲有一個股票市場......",
      "title": "我已經結束了一天的工作"
    }
  ]
}