{
  "author": "luvisrage1492",
  "the_new_excerpt": "Medical Psychedelics are the next moonshot, missed the weed gains? Worry not,\nthese stocks are where weed was 10 years ago.\n\nMissed Palantir? Don't worry, Thiel has got another company to make you rich if\nyou get in early.\n\nPeter Thiel and Kevin O Learly are deeply invested, the world's…",
  "original_created_utc": 1612904357,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "医用迷幻药是下一个月球，错过了杂草的收益？不用担心。\n这些股票是在哪里杂草是10年前。\n\n错过了Palantir？别担心，泰尔有另一家公司 让你发财，如果\n你提前进入。\n\n彼得-泰尔和凯文-奥-里尔利是深陷投资，世界上...",
      "title": "迷幻药，PSYK，CMPS，MMED，你的新视野指南。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "醫用迷幻藥是下一個月球，錯過了雜草的收益？不用擔心。\n這些股票是在哪裏雜草是10年前。\n\n錯過了Palantir？別擔心，泰爾有另一家公司 讓你發財，如果\n你提前進入。\n\n彼得-泰爾和凱文-奧-里爾利是深陷投資，世界上...",
      "title": "迷幻藥，PSYK，CMPS，MMED，你的新視野指南。"
    }
  ],
  "title": "Psychedelics, PSYK, CMPS, MMED, your guide to new horizons",
  "created_utc": 1612956228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Medical Psychedelics are the next moonshot, missed the weed gains? Worry not, these stocks are where weed was 10 years ago. </p>\n\n<p>Missed Palantir? Don&#39;t worry, Thiel has got another company to make you rich if you get in early.</p>\n\n<p>Peter Thiel and Kevin O Learly are deeply invested, the world&#39;s first psychedelics ETF was launched this year (PSYK) by a reputable Canadian Asset Manager. </p>\n\n<p>I just tossed half my portfolio in these, the rest in NIO and BABA. </p>\n\n<p>Lets make Psychdelics the next story the media can&#39;t resist. Every Boomer / Grateful Dead fan in their 50s-60s will be buying in with their old person stacks of $$$ as soon as this gets mainstream. Plus, they are tackling mental health and addiction, both hot topics in today&#39;s world.</p>\n</div><!-- SC_ON -->",
  "score": 5507,
  "permalink": "/r/wallstreetbets/comments/lgd9px/psychedelics_psyk_cmps_mmed_your_guide_to_new/",
  "subreddit": "wallstreetbets",
  "id": "lgd9px",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123220419
}