{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "https://www.cbsnews.com/news/ukraine-russia-war-fighter-jets-antony-blinken-face-the-nation/\n\nSecretary of State Antony Blinken said Sunday that NATO members have the go-ahead to send fighter jets to Ukraine as the U.S. and allies continue their efforts to help Ukraine defend itself against Russia's invasion.\n\n\"That gets a green-light,\" Blinken said in an interview with \"Face the Nation\" when asked whether the Polish government, a member of NATO, could send fighter planes to Ukraine. \"In fact, we're talking with our Polish friends right now about what we might be able to do to backfill their needs if in fact they choose to provide these fighter jets to the Ukrainians. What can we do? How can we help to make sure that they get something to backfill the planes that they are handing over to the Ukrainians?\"\n\nTranscript: Secretary of State Antony Blinken on \"Face the Nation\" A White House spokesperson told CBS News the Biden administration is evaluating the capabilities it could provide to provide jets to Poland if it decided to transfer planes to Ukraine but noted there are several questions that arise from a decision to do so, including how the jets could be transferred from Poland to Ukraine.\n\nOksana Markarova, Ukraine's ambassador to the U.S., told \"Face the Nation\" she hopes Ukraine will receive fighter jets from Poland \"as soon as possible.\"\n\n\"We are working with our American, especially, friends and allies, on the steady supply of all the ammunition and anti-air, anti-tank and planes to be able to effectively defend our country,\" she said.\n\nRussia's invasion of Ukraine has sparked worldwide support for the Ukrainian people and a united response from the West. The U.S. and European allies have provided military and humanitarian aid to Ukraine, and imposed sweeping sanctions on Russia's biggest financial institutions, Russian oligarchs and top officials in Moscow, including President Vladimir Putin himself and Foreign Minister Sergei Lavrov, as part of efforts to cut the country off from the global financial system. Putin on Saturday said the sanctions are \"like a war.\"\n\nBlinken, who was in eastern Europe meeting with U.S. allies, said NATO countries and members of the Group of 7 are \"working together\" to raise the pressure on Russia, including through additional sanctions, which will be implemented in the coming days.\n\n\"The impact of the sanctions is already devastating,\" the secretary of state said. \"The ruble is in freefall. Their stock market's been shuttered for almost a week. We're seeing a recession set in in Russia. Consumers aren't able to buy basic products because companies are fleeing Russia, so it's having a big impact.\"\n\nStill, Blinken noted that Putin is \"doubling down and digging in on this aggression against Ukraine.\"\n\n\"I think we have to be prepared, unfortunately, tragically, for this to go on for some time,\" he said.\n\nMarkarova said Ukraine is thankful to the West for its continued support but suggested the international community needs to respond quicker because the Russians are \"escalating\" their attacks.\n\n\"It's clear after 11 days that we also need all of us to move faster,\" she said. Ukraine, she continued, did not provoke an attack from Russia.\n\n\"We were not a threat to Russia unless being a peaceful democracy and just peacefully leaving in your own country is a threat,\" she said. \"And if it's so, then it's not only about Ukraine, then Europe and the whole world is not safe.\"\n\nUkrainian President Volodymyr Zelensky participated in a Zoom call with U.S. lawmakers on Saturday, during which he urged them to provide his country with military planes and impose an embargo on Russian oil. He also reiterated to lawmakers it could be the final time they see him alive, echoing a warning he has issued to European leaders.\n\nAsked whether the U.S. is working on a contingency plan to support the Ukrainian government should something happen to Zelensky, Blinken praised his leadership and indicated Ukrainian officials are prepared.\n\n\"The Ukrainians have plans in place, that I'm not going to talk about or get into any details on, to make sure that there is what we would call 'continuity of government' one way or another,\" he said. \"And let me leave it at that.\"\n\nThe secretary of state was steadfast that even if Russia's war in Ukraine continues for months, the Ukrainians will prevail.\n\n\"Winning a battle is not the same thing as winning a war. Taking the city is not the same thing as capturing the hearts and minds of Ukrainians,\" he said. \"What they've demonstrated with extraordinary courage is that they will not be subjugated to Vladimir Putin's will and be under Russia's thumb. So whether that takes another week, another month, another year to play out, it will, and I know how this is going to end. But the question is, can we end it sooner rather than later with less suffering going forward? That's the challenge.\"",
  "author_fullname": "t2_6mw59g7y",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Blinken says NATO countries have \"green light\" to send fighter jets to Ukraine",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "News"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "news",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_t85i04",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.92,
  "author_flair_background_color": "",
  "subreddit_type": "public",
  "ups": 1909,
  "total_awards_received": 0,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "News",
  "can_mod_post": false,
  "score": 1909,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "self",
  "edited": false,
  "author_flair_css_class": "",
  "author_flair_richtext": [
    {
      "e": "text",
      "t": "Asks VisualMod for Investment Advice"
    }
  ],
  "gildings": {},
  "post_hint": "self",
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1646592694,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "richtext",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.cbsnews.com/news/ukraine-russia-war-fighter-jets-antony-blinken-face-the-nation/\"&gt;https://www.cbsnews.com/news/ukraine-russia-war-fighter-jets-antony-blinken-face-the-nation/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Secretary of State Antony Blinken said Sunday that NATO members have the go-ahead to send fighter jets to Ukraine as the U.S. and allies continue their efforts to help Ukraine defend itself against Russia&amp;#39;s invasion.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;That gets a green-light,&amp;quot; Blinken said in an interview with &amp;quot;Face the Nation&amp;quot; when asked whether the Polish government, a member of NATO, could send fighter planes to Ukraine. &amp;quot;In fact, we&amp;#39;re talking with our Polish friends right now about what we might be able to do to backfill their needs if in fact they choose to provide these fighter jets to the Ukrainians. What can we do? How can we help to make sure that they get something to backfill the planes that they are handing over to the Ukrainians?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Transcript: Secretary of State Antony Blinken on &amp;quot;Face the Nation&amp;quot; A White House spokesperson told CBS News the Biden administration is evaluating the capabilities it could provide to provide jets to Poland if it decided to transfer planes to Ukraine but noted there are several questions that arise from a decision to do so, including how the jets could be transferred from Poland to Ukraine.&lt;/p&gt;\n\n&lt;p&gt;Oksana Markarova, Ukraine&amp;#39;s ambassador to the U.S., told &amp;quot;Face the Nation&amp;quot; she hopes Ukraine will receive fighter jets from Poland &amp;quot;as soon as possible.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We are working with our American, especially, friends and allies, on the steady supply of all the ammunition and anti-air, anti-tank and planes to be able to effectively defend our country,&amp;quot; she said.&lt;/p&gt;\n\n&lt;p&gt;Russia&amp;#39;s invasion of Ukraine has sparked worldwide support for the Ukrainian people and a united response from the West. The U.S. and European allies have provided military and humanitarian aid to Ukraine, and imposed sweeping sanctions on Russia&amp;#39;s biggest financial institutions, Russian oligarchs and top officials in Moscow, including President Vladimir Putin himself and Foreign Minister Sergei Lavrov, as part of efforts to cut the country off from the global financial system. Putin on Saturday said the sanctions are &amp;quot;like a war.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Blinken, who was in eastern Europe meeting with U.S. allies, said NATO countries and members of the Group of 7 are &amp;quot;working together&amp;quot; to raise the pressure on Russia, including through additional sanctions, which will be implemented in the coming days.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The impact of the sanctions is already devastating,&amp;quot; the secretary of state said. &amp;quot;The ruble is in freefall. Their stock market&amp;#39;s been shuttered for almost a week. We&amp;#39;re seeing a recession set in in Russia. Consumers aren&amp;#39;t able to buy basic products because companies are fleeing Russia, so it&amp;#39;s having a big impact.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Still, Blinken noted that Putin is &amp;quot;doubling down and digging in on this aggression against Ukraine.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I think we have to be prepared, unfortunately, tragically, for this to go on for some time,&amp;quot; he said.&lt;/p&gt;\n\n&lt;p&gt;Markarova said Ukraine is thankful to the West for its continued support but suggested the international community needs to respond quicker because the Russians are &amp;quot;escalating&amp;quot; their attacks.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;It&amp;#39;s clear after 11 days that we also need all of us to move faster,&amp;quot; she said. Ukraine, she continued, did not provoke an attack from Russia.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;We were not a threat to Russia unless being a peaceful democracy and just peacefully leaving in your own country is a threat,&amp;quot; she said. &amp;quot;And if it&amp;#39;s so, then it&amp;#39;s not only about Ukraine, then Europe and the whole world is not safe.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Ukrainian President Volodymyr Zelensky participated in a Zoom call with U.S. lawmakers on Saturday, during which he urged them to provide his country with military planes and impose an embargo on Russian oil. He also reiterated to lawmakers it could be the final time they see him alive, echoing a warning he has issued to European leaders.&lt;/p&gt;\n\n&lt;p&gt;Asked whether the U.S. is working on a contingency plan to support the Ukrainian government should something happen to Zelensky, Blinken praised his leadership and indicated Ukrainian officials are prepared.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The Ukrainians have plans in place, that I&amp;#39;m not going to talk about or get into any details on, to make sure that there is what we would call &amp;#39;continuity of government&amp;#39; one way or another,&amp;quot; he said. &amp;quot;And let me leave it at that.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The secretary of state was steadfast that even if Russia&amp;#39;s war in Ukraine continues for months, the Ukrainians will prevail.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Winning a battle is not the same thing as winning a war. Taking the city is not the same thing as capturing the hearts and minds of Ukrainians,&amp;quot; he said. &amp;quot;What they&amp;#39;ve demonstrated with extraordinary courage is that they will not be subjugated to Vladimir Putin&amp;#39;s will and be under Russia&amp;#39;s thumb. So whether that takes another week, another month, another year to play out, it will, and I know how this is going to end. But the question is, can we end it sooner rather than later with less suffering going forward? That&amp;#39;s the challenge.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/WdjENsSFcdK-_iGJTGI7ZbluSR6l9zyvLUljb6xFEwU.jpg?auto=webp&amp;s=12e9bca864d11178972cb80334a508c49241c178",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/WdjENsSFcdK-_iGJTGI7ZbluSR6l9zyvLUljb6xFEwU.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=d6fcb83814be0d1b9f26bbbe9f941931d16deb52",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/WdjENsSFcdK-_iGJTGI7ZbluSR6l9zyvLUljb6xFEwU.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=9c01f4be364281e88f891f4eb2a1755fb295bccf",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/WdjENsSFcdK-_iGJTGI7ZbluSR6l9zyvLUljb6xFEwU.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=1498253af5b96d749c2759d52a2d74d1b21ecb58",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/WdjENsSFcdK-_iGJTGI7ZbluSR6l9zyvLUljb6xFEwU.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=4676ba47b3175a600f67aeab2ab1fd5e90ab2577",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/WdjENsSFcdK-_iGJTGI7ZbluSR6l9zyvLUljb6xFEwU.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=f336546584a970f1b95543a616f930227c9b4a3d",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/WdjENsSFcdK-_iGJTGI7ZbluSR6l9zyvLUljb6xFEwU.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=6770047ef4331f0d5f8bdacee9a495938b5ca5b8",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "fsI3jbvCk-u5fj1Od8t2PwtdoMkyjT4DCjaJWfxbyxE"
      }
    ],
    "enabled": false
  },
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "519c3d26-4acc-11eb-8ce2-0ec530aa616d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": "Asks VisualMod for Investment Advice",
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ffb000",
  "id": "t85i04",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Aerotyne69",
  "discussion_type": null,
  "num_comments": 337,
  "send_replies": false,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": "dark",
  "permalink": "/r/wallstreetbets/comments/t85i04/blinken_says_nato_countries_have_green_light_to/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/t85i04/blinken_says_nato_countries_have_green_light_to/",
  "subreddit_subscribers": 11716474,
  "created_utc": 1646614508,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1646592694,
  "the_new_excerpt": "https://www.cbsnews.com/news/ukraine-russia-war-fighter-jets-antony-blinken-face-the-nation/\n\nSecretary of State Antony Blinken said Sunday that NATO members have the\ngo-ahead to send fighter jets to Ukraine as the U.S. and allies continue their\nefforts to help Ukraine defend itself against…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.cbsnews.com/news/ukraine-russia-war-fighter-jets-antony-blinken-face-the-nation/\n\nアントニー・ブリンケン国務長官は日曜日、NATO加盟国には\n米国と同盟国は、ウクライナに戦闘機を派遣することを許可しています。\nウクライナの自国防衛を支援するための努力...",
      "title": "ブリンケンは、NATO諸国がウクライナに戦闘機を派遣する「グリーンライト」を持っていると述べた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.cbsnews.com/news/ukraine-russia-war-fighter-jets-antony-blinken-face-the-nation/\n\n国务卿安东尼-布林肯周日表示，北约成员国已经\n在美国和盟国继续努力帮助乌克兰保卫自己的利益时，北约成员已获准向乌克兰派遣战斗机。\n美国和盟国继续努力帮助乌克兰保护自己，以抵御...",
      "title": "布林肯称北约国家为向乌克兰派遣战机开了 \"绿灯\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.cbsnews.com/news/ukraine-russia-war-fighter-jets-antony-blinken-face-the-nation/\n\n國務卿安東尼-布林肯週日表示，北約成員國已經\n在美國和盟國繼續努力幫助烏克蘭保衛自己的利益時，北約成員已獲准向烏克蘭派遣戰鬥機。\n美國和盟國繼續努力幫助烏克蘭保護自己，以抵禦...",
      "title": "布林肯稱北約國家爲向烏克蘭派遣戰機開了 \"綠燈\""
    }
  ],
  "source_updated_at": 1646991707685
}