{
  "author": "cartstanza",
  "original_created_utc": 1642086116,
  "title": "Why don't ALL American working men and women have unions that are as powerful as the American police unions?",
  "created_utc": 1642092785,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I always read about how bad American workers have it in terms of pay, working conditions, healthcare, vacation days, overtime, contract terms, etc...but at the same time, I also read about police unions having almost unlimited powers. So why aren&amp;#39;t there huge, powerful unions all over the country (like the police unions) to stand up for workers&amp;#39; rights?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/s31f21/why_dont_all_american_working_men_and_women_have/",
  "subreddit": "NoStupidQuestions",
  "id": "s31f21",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I always read about how bad American workers have it in terms of pay, working\nconditions, healthcare, vacation days, overtime, contract terms, etc...but at\nthe same time, I also read about police unions having almost unlimited powers.\nSo why aren't there huge, powerful unions all over the country…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はいつも、アメリカの労働者が給与、労働条件に関していかに劣悪であるかということを読んでいます。\n条件、医療、休暇、残業、契約条件などなど...でも、同時に\n同時に、警察の組合がほとんど無制限の権限を持っているという話も読みました。\nでは、なぜ国中に巨大で強力な組合がないのでしょうか...。",
      "title": "なぜアメリカの労働者は皆、アメリカの警察官のような強力な組合を持っていないのだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我总是读到美国工人在工资、工作条件、医疗保健、假期、加班、合同条款等方面有多么糟糕。\n但与此同时，我也读到警察工会几乎拥有无限的权力。\n但与此同时，我也读到警察工会拥有几乎无限的权力。\n那么，为什么全国各地都没有庞大而强大的工会呢？",
      "title": "为什么所有的美国劳动者都没有像美国警察工会那样强大的工会？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我總是讀到美國工人在工資、工作條件、醫療保健、假期、加班、合同條款等方面有多麼糟糕。\n但與此同時，我也讀到警察工會幾乎擁有無限的權力。\n但與此同時，我也讀到警察工會擁有幾乎無限的權力。\n那麼，爲什麼全國各地都沒有龐大而強大的工會呢？",
      "title": "爲什麼所有的美國勞動者都沒有像美國警察工會那樣強大的工會？"
    }
  ]
}