{
  "author": "jwithers93",
  "original_created_utc": 1637582389,
  "title": "We need a list of pro-crypto banks vs anti-crypto",
  "created_utc": 1637623972,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I came across this comment by <a href=\"/u/Typical_Branch_7695\">u/Typical_Branch_7695</a>, &quot;I think someone should make a subreddit of banks that are pro-crypto and anti-crypto. Which ones are flexible in terms of setting up an account, fees, etc.&quot; The original comment can be found here: <a href=\"https://np.reddit.com/r/CryptoCurrency/comments/qzi051/remember_the_israeli_lady_who_made_fortune_in_her/\">https://np.reddit.com/r/CryptoCurrency/comments/qzi051/remember_the_israeli_lady_who_made_fortune_in_her/</a></p>\n\n<p>This is an amazing idea. It would save a good amount of people a lot of legal trouble and heartache. I know I&#39;ve been accumulating and it would be heartbeaking after years of painstakingly putting away fiat to consistently DCA, then when you&#39;re finally about to reap the benefits, to be stopped by accusations of money laundering or illegal activity. It&#39;s absolutely unacceptable and we have to avoid for as many people as we can. Not to mention these same banks participate in money laundering, however, they just get a slap on the wrist. Let&#39;s make this list guys and have it stickied somrwhere in this subreddit so we can help the community avoid the corrupt financial institutions. </p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/qzjuyz/we_need_a_list_of_procrypto_banks_vs_anticrypto/",
  "subreddit": "CryptoCurrency",
  "id": "qzjuyz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I came across this comment by u/Typical_Branch_7695 [/u/Typical_Branch_7695], \"I\nthink someone should make a subreddit of banks that are pro-crypto and\nanti-crypto. Which ones are flexible in terms of setting up an account, fees,\netc.\" The original comment can be found…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、u/Typical_Branch_7695 [/u/Typical_Branch_7695]さんの「I\n誰かがpro-crypto and ant-cryptoな銀行のsubredditを作るべきだと思います。\n反暗号。どの銀行が口座開設や手数料の面で柔軟性があるか。\netc.\" 元のコメントはこちらから...",
      "title": "暗号化に積極的な銀行と反暗号化に積極的な銀行のリストが必要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到了u/Typical_Branch_7695 [/u/Typical_Branch_7695]的这条评论，\"我\n我认为有人应该建立一个支持加密货币和反对加密货币的银行的子Reddit。\n反加密货币。哪些银行在设立账户、收费方面是灵活的。\n等等。\" 原始评论可以找到...",
      "title": "我们需要一份支持加密货币的银行与反对加密货币的银行的名单"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到了u/Typical_Branch_7695 [/u/Typical_Branch_7695]的這條評論，\"我\n我認爲有人應該建立一個支持加密貨幣和反對加密貨幣的銀行的子Reddit。\n反加密貨幣。哪些銀行在設立賬戶、收費方面是靈活的。\n等等。\" 原始評論可以找到...",
      "title": "我們需要一份支持加密貨幣的銀行與反對加密貨幣的銀行的名單"
    }
  ]
}