{
  "author": "woottonp",
  "original_created_utc": 1637914680,
  "title": "Global markets sliding on COVID news, get your dip buying chips ready!",
  "created_utc": 1637922928,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On the back of fresh fears over this new COVID variant the markets are getting spooked.</p>\n\n<p>Asia had biggest slip in 2 months.</p>\n\n<p>UK has just opened and FTSE 100 is down 3%, lots of blue chips down a reasonable amount and the media is all over it.</p>\n\n<p>US market obviously not open at the moment but the global sentiment seems quite consistent.</p>\n\n<p>With so much institutional investment in crypto this could be an interesting few days/weeks for stocks and very likely crypto if large sums are pulled out.</p>\n\n<p>Just remember, if you believe in the project and there is no news to the negative against it then why sell. If you are over exposed consider sensible stop losses.</p>\n\n<p>Personally I&#39;m in for the ride and have some FIAT ready to go if need be!</p>\n\n<p>Best wishes all, and remember I have no idea what I&#39;m saying...</p>\n</div><!-- SC_ON -->",
  "score": 1200,
  "permalink": "/r/CryptoCurrency/comments/r2ig2x/global_markets_sliding_on_covid_news_get_your_dip/",
  "subreddit": "CryptoCurrency",
  "id": "r2ig2x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On the back of fresh fears over this new COVID variant the markets are getting\nspooked.\n\nAsia had biggest slip in 2 months.\n\nUK has just opened and FTSE 100 is down 3%, lots of blue chips down a reasonable\namount and the media is all over it.\n\nUS market obviously not open at the moment but the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このCOVIDの新バージョンに対する新たな懸念から、市場は混乱しています。\n市場は怯えている。\n\nアジアでは2ヶ月間で最大の下げ幅となりました。\n\n英国ではFTSE100が3％下落し、多くの優良企業がそれなりに下落しており、マスコミも大騒ぎしています。\n多くの優良企業がそれなりに下げており、マスコミもそれに夢中です。\n\n米国市場は明らかに今は開いていませんが、...",
      "title": "COVIDニュースで世界の市場がスライド！ディップバイイングチップスを用意しよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在对这个新的COVID变体的新的担忧的背景下，市场正变得惊恐不安。\n惊慌失措。\n\n亚洲市场出现了两个月来最大的下滑。\n\n英国刚刚开盘，富时100指数下跌了3%，许多蓝筹股下跌了一定的幅度。\n很多蓝筹股下跌了一定的幅度，媒体都在报道此事。\n\n美国市场目前显然没有开盘，但...",
      "title": "全球市场因COVID消息而下滑，准备好你的蘸水购买筹码吧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在對這個新的COVID變體的新的擔憂的背景下，市場正變得驚恐不安。\n驚慌失措。\n\n亞洲市場出現了兩個月來最大的下滑。\n\n英國剛剛開盤，富時100指數下跌了3%，許多藍籌股下跌了一定的幅度。\n很多藍籌股下跌了一定的幅度，媒體都在報道此事。\n\n美國市場目前顯然沒有開盤，但...",
      "title": "全球市場因COVID消息而下滑，準備好你的蘸水購買籌碼吧"
    }
  ]
}