{
  "author": "PlayfulAccident",
  "original_created_utc": 1631386418,
  "title": "Why did people from Nepal not climb Mount Everest? ( or did they ?)",
  "created_utc": 1631447907,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was reading a book by a Nepalese climber the other day about promoting climbing my Nepalese climbers over that of Europeans and Americans. Of course I know about the Sherpas who guided Europeans up Everst in the 20th century but did any Nepalese people try to climb Everest before the presence of foreigners? Were they successful and this has not been recorded ? And if they didn&#39;t attempt this who not ?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/pmd58i/why_did_people_from_nepal_not_climb_mount_everest/",
  "subreddit": "AskHistorians",
  "id": "pmd58i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was reading a book by a Nepalese climber the other day about promoting\nclimbing my Nepalese climbers over that of Europeans and Americans. Of course I\nknow about the Sherpas who guided Europeans up Everst in the 20th century but\ndid any Nepalese people try to climb Everest before the presence of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、ネパール人クライマーの本を読んでいたら、欧米人よりもネパール人クライマーの方が\nこの間、ネパール人クライマーの本を読んでいたら、ヨーロッパ人やアメリカ人よりもネパール人クライマーのクライミングを推進していると書いてあった。もちろん\nもちろん、20世紀にヨーロッパ人をエベレストに案内したシェルパのことは知っています。\nしかし、シェルパがいなくなる前にエベレストに登ろうとしたネパール人はいたのだろうか？",
      "title": "なぜネパールの人はエベレストに登らなかったのか？(´・ω・`)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前几天，我在读一本由尼泊尔登山者写的书，内容是关于促进尼泊尔登山者比欧洲和美国登山者更多。\n攀登我的尼泊尔登山者而不是欧洲人和美国人的攀登。当然，我\n当然，我知道在20世纪引导欧洲人攀登Everst的夏尔巴人，但是\n在有夏尔巴人出现之前，是否有尼泊尔人试图攀登珠穆朗玛峰？",
      "title": "为什么来自尼泊尔的人没有登上珠穆朗玛峰？( 或者他们有吗？)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天，我在讀一本由尼泊爾登山者寫的書，內容是關於促進尼泊爾登山者比歐洲和美國登山者更多。\n攀登我的尼泊爾登山者而不是歐洲人和美國人的攀登。當然，我\n當然，我知道在20世紀引導歐洲人攀登Everst的夏爾巴人，但是\n在有夏爾巴人出現之前，是否有尼泊爾人試圖攀登珠穆朗瑪峯？",
      "title": "爲什麼來自尼泊爾的人沒有登上珠穆朗瑪峯？( 或者他們有嗎？)"
    }
  ]
}