{
  "author": "iLoveCuil",
  "the_new_excerpt": "The AutoMod decided this was a bad post for /r/personalfinance so I am here now.\n\nHello /r/investing I was wondering what I should do in regards to my Roth IRA,\nbasically I am focused growth, with plans to retire at age 55-62 depending on\nhow everything goes (IE I hit whatever number I feel is…",
  "original_created_utc": 1620173494,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "AutoModがこれは/r/personalfinanceには不適切な投稿だと判断したので、私は今ここにいます。\n\nこんにちは、/r/investing 私はRoth IRAに関して何をすべきか悩んでいます。\n基本的に私は成長を重視しており、55～62歳で引退する予定です。\n私は基本的に成長を重視しています。",
      "title": "Question about my Roth IRA options, reposted from /r/personalfinance."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "AutoMod认为这对/r/personalfinance来说是一个不好的帖子，所以我现在在这里。\n\n你好/r/investing 我想知道我应该如何处理我的Roth IRA。\n基本上，我专注于增长，计划在55-62岁退休，这取决于所有事情的进展。\n我想知道我应该如何处理我的Roth IRA，基本上我专注于增长，计划在55-62岁退休，这取决于所有事情的进展（我达到了我认为的任何数字）。",
      "title": "关于我的Roth IRA选择的问题，从/r/personalfinance转贴。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "AutoMod認爲這對/r/personalfinance來說是一個不好的帖子，所以我現在在這裏。\n\n你好/r/investing 我想知道我應該如何處理我的Roth IRA。\n基本上，我專注於增長，計劃在55-62歲退休，這取決於所有事情的進展。\n我想知道我應該如何處理我的Roth IRA，基本上我專注於增長，計劃在55-62歲退休，這取決於所有事情的進展（我達到了我認爲的任何數字）。",
      "title": "關於我的Roth IRA選擇的問題，從/r/personalfinance轉貼。"
    }
  ],
  "title": "Questions about my Roth IRA options, reposted from /r/personalfinance.",
  "created_utc": 1620185451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The AutoMod decided this was a bad post for <a href=\"/r/personalfinance\">/r/personalfinance</a> so I am here now.</p>\n\n<p>Hello <a href=\"/r/investing\">/r/investing</a> I was wondering what I should do in regards to my Roth IRA, basically I am focused growth, with plans to retire at age 55-62 depending on how everything goes (IE I hit whatever number I feel is appropriate I am done). Currently I have about 9K in my Roth IRA, and 11K in my 401k,  with plans to move much of that 401k money into my Roth so it can be maxed out.</p>\n\n<p>My main questions are what exactly should I read to have more confidence in what I am doing, what should I be investing in, and should I use their roboinvestor (Even with the fees).</p>\n\n<p>&#x200B;</p>\n\n<p>My understanding of my options are:</p>\n\n<ol>\n<li>Switch to the Robo advisor, with its 0.35% fee, which seems beatable to me, but I and all of my family use Chase, so it would be convenient, and I do already kinda like YouInvest. I think vanguard is like 10% of this rate fwiw, so it seems suboptimal, although I am taking on a lot of risk managing things myself.</li>\n<li>Buy mutual funds via my Chase account, my understanding is that I will not be charged a fee whatsoever for these trades [Source: <a href=\"https://www.chase.com/personal/investments/online-investing/pricing\">https://www.chase.com/personal/investments/online-investing/pricing</a>] and this would only charge me whatever fee the mutual fund charges.\n\n<ol>\n<li>I would presumably go with something like  TTIIX, as that is what my job put my 401k into, although they also underperformed the SP500 by quite a bit. Their fee is  0.100% [Source: <a href=\"https://www.morningstar.com/funds/xnas/ttiix/quote\">https://www.morningstar.com/funds/xnas/ttiix/quote</a>]</li>\n<li>I could also just buy VTSAX, that seems like a semi-reasonable plan.</li>\n</ol></li>\n<li>Continue my manual buying of stocks and mutual funds I like, regardless of how risky it seems.\n\n<ol>\n<li>This seems dangerous to me, my current intuition on stocks has me about at the following ratios.\n\n<ol>\n<li>40% SPYG</li>\n<li>25% VTSAX and the Schwab equivalent (I was YouTube researching on separate days and both ended up suggested.</li>\n<li>15% ARKK</li>\n<li>15% Ford (Hey, I made 85%)</li>\n<li>5% AAPL</li>\n</ol></li>\n</ol></li>\n</ol>\n\n<p>Basically my concerns are the level of risk I am taking, and the amount that I will pay for expert advice on my little bit of money.</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 237,
  "permalink": "/r/investing/comments/n52di6/questions_about_my_roth_ira_options_reposted_from/",
  "subreddit": "investing",
  "id": "n52di6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380966989
}