{
  "author": "the-good-side",
  "original_created_utc": 1626080155,
  "title": "Why can I easily watch four hours of a TV show but struggle to watch a two-hour-long movie?",
  "created_utc": 1626100238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title. Why can I easily watch four consecutive hours of a TV show (not talking like sitcoms, but narrative shows) but I struggle to sit through a movie that’s only two hours? The only thing I can think it may be is pacing or maybe that TV shows are sectioned into episodes, but I’m still watching them consecutively. I know others who feel the same way. What is it?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/oing6p/why_can_i_easily_watch_four_hours_of_a_tv_show/",
  "subreddit": "NoStupidQuestions",
  "id": "oing6p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Title. Why can I easily watch four consecutive hours of a TV show (not talking\nlike sitcoms, but narrative shows) but I struggle to sit through a movie that’s\nonly two hours? The only thing I can think it may be is pacing or maybe that TV\nshows are sectioned into episodes, but I’m still watching…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトル なぜ、テレビ番組（シットコムのようなものではなく、ストーリー性のあるもの）は4時間連続で簡単に見ることができるのに\nテレビ番組（シットコムではなく、ストーリー性のある番組）は4時間連続で簡単に見られるのに、2時間しかない映画は苦労するのはなぜ？\n時間の映画を見るのに苦労するのはなぜ？唯一考えられるのは、ペース配分か、テレビ番組がエピソードごとに区切られていることかもしれません。\nしかし、私はまだ見ている...。",
      "title": "テレビ番組を4時間見るのは簡単なのに、2時間の映画を見るのに苦労するのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题。为什么我可以轻松地连续看四个小时的电视节目（不是说\n不是指情景喜剧，而是指叙事性节目），但我却很难看完一部只有两个小时的电影？\n只有两个小时？我唯一能想到的可能是节奏问题，也可能是电视节目被分成几集。\n节目被分成了几集，但我还是在看......",
      "title": "为什么我可以轻松地看完四个小时的电视节目，但却很难看完一部长达两个小时的电影？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題。爲什麼我可以輕鬆地連續看四個小時的電視節目（不是說\n不是指情景喜劇，而是指敘事性節目），但我卻很難看完一部只有兩個小時的電影？\n只有兩個小時？我唯一能想到的可能是節奏問題，也可能是電視節目被分成幾集。\n節目被分成了幾集，但我還是在看......",
      "title": "爲什麼我可以輕鬆地看完四個小時的電視節目，但卻很難看完一部長達兩個小時的電影？"
    }
  ]
}