{
  "author": "pieceofpineapple",
  "the_new_excerpt": "Every now and then, I see some people asking, ”What’s up with XLM?”\n\nSo I have written this for educational purposes.\n\nDid you know the MOST RECENT NEWS just published a few hours ago about Stellar?\n\n\nAN EU COMPANY JUST LAUNCHED A €20 MILLION…",
  "original_created_utc": 1610589321,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "时不时看到有人问：\"XLM是怎么回事？\"\n\n所以我写了这篇教育性的文章。\n\n你知道几个小时前刚刚发布的关于Stellar的最新新闻吗？\n\n\n一家欧盟公司刚刚推出了一个2000万欧元的... ...",
      "title": "恒星（XLM）是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "時不時看到有人問：\"XLM是怎麼回事？\"\n\n所以我寫了這篇教育性的文章。\n\n你知道幾個小時前剛剛發佈的關於Stellar的最新新聞嗎？\n\n\n一家歐盟公司剛剛推出了一個2000萬歐元的... ...",
      "title": "恆星（XLM）是怎麼回事？"
    }
  ],
  "title": "What’s up with Stellar (XLM)?",
  "created_utc": 1610619382,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every now and then, I see some people asking, <em>”What’s up with XLM?”</em></p>\n\n<p>So I have written this for educational purposes.</p>\n\n<p>Did you know the <strong>MOST RECENT NEWS</strong> just published a few hours ago about Stellar?</p>\n\n<h2>An EU company just launched a <a href=\"https://markets.ft.com/data/announce/detail?dockey=600-202101130407DGAP____CORPNEWS_corporate_1160288_en-1\">€20 MILLION BOND</a> on Stellar. Compared to other projects, Stellar is getting adopted by banks, financial institutions, and top-tier companies.</h2>\n\n<p>Second, if you try Stellar, you’ll be amazed just how fast and quick XLM gets to your wallet. More or less than 2 seconds. It is no doubt why on <a href=\"https://www.coinstats.network\">Coinstats,</a> Stellar is the number 1 when it comes to transaction volumes. For the sake of simplicity, it means Stellar blockchain is being used more than any other chains.</p>\n\n<p>Ukraine choosing Stellar to test and create their CBDC is also one of the greatest achievements of Stellar.</p>\n\n<p>USDC will also come to Stellar on February 2021. What does it mean for users? Well, no more cursing the damn USDC fees because of HIGH ETH GAS FEES.</p>\n\n<p>You can exchange your crypto to USDC easily on Stellar and send it for a fraction of a cent at an ultra-speed.</p>\n\n<p>Furthermore, it is no doubt that Stellar is the main player in cross-border payments, remittances, CBDC, and asset tokenization.</p>\n\n<p>But wait that’s only the tip of the iceberg!</p>\n\n<p>Stellar also has a native DEX, and they are working on turing smart contract. There is already a Stellar Smart Contract but with turing it will be better.</p>\n\n<p>You will also find Stablecoins on Stellar not found on any other blockchain e.g. <strong>Philippine Peso, Nigerian Naira, Chinese Yuan, Mexican Peso, Euro, Brazilian Real, and Argentine Peso.</strong> And guess what? They are 100% backed 1:1, because you can’t issue Stablecoins on stellar if you are not regulated or licensed. That’s also the reason why one of the <a href=\"https://www.coindesk.com/one-of-the-worlds-oldest-banks-is-issuing-a-euro-stablecoin-on-stellar\">world’s oldest banks</a>  issued their EURO on Stellar. </p>\n\n<p>You can also try to play <a href=\"https://www.litemint.io\">Litemint</a>. It is a game built on Stellar, and you’ll also get an NFT if you win the competition and earn CREDITS which you can trade for XLM on Stellar DEX(SDEX). You can download Lobstr or Solar from App Store and Play Store to interact with SDEX.</p>\n\n<p>See? Stellar does not only change the way payment works. You can also play games. There are more use cases, but I suggest you go to Stellar to learn more.</p>\n</div><!-- SC_ON -->",
  "score": 263,
  "permalink": "/r/CryptoCurrency/comments/kwvmfs/whats_up_with_stellar_xlm/",
  "subreddit": "CryptoCurrency",
  "id": "kwvmfs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706378016
}