{
  "author": "Ishihado",
  "original_created_utc": 1651931421,
  "title": "Why is America considered the \"Land of the Free\" despite it having the largest incarcerated population on the planet?",
  "created_utc": 1651946070,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not only the largest on the planet, but we have the largest incarcerated population in the history of our entire species. No joke, we have more people in prison/jail than any other time or civilization ever has. Last year alone we passed 120,000 laws on the local, state, and federal levels. Isn&amp;#39;t that kind of the opposite of free?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/ukdprx/why_is_america_considered_the_land_of_the_free/",
  "subreddit": "TooAfraidToAsk",
  "id": "ukdprx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Not only the largest on the planet, but we have the largest incarcerated\npopulation in the history of our entire species. No joke, we have more people in\nprison/jail than any other time or civilization ever has. Last year alone we\npassed 120,000 laws on the local, state, and federal levels. Isn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "地球上で最も大きいだけでなく、最も多くの投獄者を抱えている\n私たちの種の歴史上、最大の収容者数を誇っています。冗談抜きで、私たちはかつてないほど多くの人々が\n冗談抜きで、私たちは、他のどの時代、どの文明よりも、刑務所や拘置所にいる人が多いのです。昨年だけでも、私たちは\n地方、州、連邦レベルで12万もの法律が制定されました。それは...",
      "title": "アメリカは、地球上で最も多くの人々が投獄されているにもかかわらず、なぜ「自由の国」と考えられているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们不仅是地球上最大的国家，而且还拥有最大的在押犯人。\n我们整个物种历史上最大的监禁人口。不是开玩笑，我们有更多的人在\n监狱/牢房的人数比任何其他时代或文明都要多。仅在去年，我们\n就通过了120,000条地方、州和联邦层面的法律。是不是...",
      "title": "为什么美国被认为是 \"自由之地\"，尽管它拥有地球上最大的监禁人口？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們不僅是地球上最大的國家，而且還擁有最大的在押犯人。\n我們整個物種歷史上最大的監禁人口。不是開玩笑，我們有更多的人在\n監獄/牢房的人數比任何其他時代或文明都要多。僅在去年，我們\n就通過了120,000條地方、州和聯邦層面的法律。是不是...",
      "title": "爲什麼美國被認爲是 \"自由之地\"，儘管它擁有地球上最大的監禁人口？"
    }
  ]
}