{
  "author": "borissnm",
  "original_created_utc": 1631304115,
  "title": "Surely the Earl of Sandwich wasn't the first guy who thought of putting food inside/in between bits of bread, right? Tell me about them.",
  "created_utc": 1631326630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The story goes that the Earl of Sandwich came up with putting meals in between slices of bread because he wanted to be able to eat while playing cards. But the dude lived in the 1700s and humans have been eating bread for thousands of years; I feel like there <em>have</em> to have been others who did/were doing that and that story just started as some rich English dudes taking credit for, and slapping their name on, something that already existed. </p>\n\n<p>So I guess tell me how older cultures combined bread and non-bread foods, I suppose!</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/plsibx/surely_the_earl_of_sandwich_wasnt_the_first_guy/",
  "subreddit": "AskHistorians",
  "id": "plsibx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The story goes that the Earl of Sandwich came up with putting meals in between\nslices of bread because he wanted to be able to eat while playing cards. But the\ndude lived in the 1700s and humans have been eating bread for thousands of\nyears; I feel like there have to have been others who did/were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サンドウィッチ伯爵は、食事をパンの間に挟むことを思いついたという話があります。\nサンドイッチ伯爵は、トランプをしながらでも食事ができるようにと、パンの間に食事を挟むことを思いついたそうです。しかし\n人間は何千年も前からパンを食べていたわけですから、他にもそういう人がいたのではないかと思います。\n人間は何千年も前からパンを食べていたのだから、他にもパンを食べた人がいたはずだと思うのですが...。",
      "title": "パンの中に食べ物を入れることを考えたのは、サンドウィッチ伯爵が初めてではないでしょう？彼らについて教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "传说三明治伯爵想出了将饭菜放在面包片之间的办法。\n因为他希望能在打牌时吃东西。但是，这位老兄生活在1700年，而人类在几千年前就开始吃面包了。\n但这家伙生活在1700年代，而人类吃面包已经有几千年的历史了。\n我觉得肯定还有人做过/正在做......",
      "title": "三明治伯爵肯定不是第一个想到把食物放在面包中间的人，对吗？告诉我他们的情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "傳說三明治伯爵想出了將飯菜放在麪包片之間的辦法。\n因爲他希望能在打牌時喫東西。但是，這位老兄生活在1700年，而人類在幾千年前就開始吃麪包了。\n但這傢伙生活在1700年代，而人類吃麪包已經有幾千年的歷史了。\n我覺得肯定還有人做過/正在做......",
      "title": "三明治伯爵肯定不是第一個想到把食物放在麪包中間的人，對嗎？告訴我他們的情況。"
    }
  ]
}