{
  "author": "Thich_QuangDuc",
  "original_created_utc": 1631543819,
  "title": "This last LTC x Walmart fake news should reflect bad on the media, not crypto",
  "created_utc": 1631568914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is so much bullshit, every news outlet published like it was real, even Reuters for god&#39;s sake.</p>\n\n<p>Everyone that works at a respected journalism firm and publishes something without due diligence should be fired immediately.</p>\n\n<p>What happened to real trustworthy content? We need random Twitter people to verify these claims??</p>\n\n<p>It just looks bad on the media overall, not on crypto!</p>\n\n<p>This was obviouslly market manipulation and news outlets followed it like the clickbait whores they are without proper diligence.</p>\n\n<p>EDIT: this also is really shitty from LTC, that confirmed it via twitter only to delete it later. If it was such a huge decision of course the Walmart people would have contacted LTC.</p>\n\n<p>Reposting it after some blogs is really stupid or shady, eitherway they should also be held accountable</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/pngqbv/this_last_ltc_x_walmart_fake_news_should_reflect/",
  "subreddit": "CryptoCurrency",
  "id": "pngqbv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is so much bullshit, every news outlet published like it was real, even\nReuters for god's sake.\n\nEveryone that works at a respected journalism firm and publishes something\nwithout due diligence should be fired immediately.\n\nWhat happened to real trustworthy content? We need random Twitter…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはあまりにもデタラメで、どの報道機関もそれが現実であるかのように発表しました。\nロイターもそうです。\n\n尊敬されているジャーナリズム企業で働いていて、十分な注意を払わずに何かを発表する人は皆、すぐに解雇されるべきです。\n慎重さを欠いた発表をした者は全員、直ちに解雇されるべきです。\n\n本当の意味で信頼できるコンテンツはどうなったのでしょうか？私たちはランダムなTwitterが必要です。",
      "title": "この最後のLTC x Walmartのフェイクニュースは、暗号ではなく、メディアに悪い影響を与えるべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是如此多的废话，每家新闻媒体都像真的一样发表，甚至连路透社也是如此。\n看在上帝的份上，路透社。\n\n在一家受人尊敬的新闻公司工作的每个人，如果没有尽职尽责地发表一些东西\n应立即被解雇。\n\n真正值得信赖的内容怎么了？我们需要随机的Twitter...",
      "title": "最后这个LTC x Walmart的假新闻应该反映出媒体的不好，而不是加密货币的不好"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是如此多的廢話，每家新聞媒體都像真的一樣發表，甚至連路透社也是如此。\n看在上帝的份上，路透社。\n\n在一家受人尊敬的新聞公司工作的每個人，如果沒有盡職盡責地發表一些東西\n應立即被解僱。\n\n真正值得信賴的內容怎麼了？我們需要隨機的Twitter...",
      "title": "最後這個LTC x Walmart的假新聞應該反映出媒體的不好，而不是加密貨幣的不好"
    }
  ]
}