{
  "author": "bLackieJESUS",
  "original_created_utc": 1638388358,
  "title": "Crypto.com has proven that marketing is an important part in this market. What other projects do you think will follow in their path?",
  "created_utc": 1638409114,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;CRO&amp;#39;s recent pump is no secret. A lot of people are speculating that this upward movement is because of the marketing efforts that the Crypto.com team have executed. &lt;/p&gt;\n\n&lt;p&gt;Things like buying the naming rights to the Los Angeles Staples Center making it the Crypto.com Arena or their countless sponsors in top sports (Formula 1, the Paris Saint Germain football team and the UFC). &lt;/p&gt;\n\n&lt;p&gt;This marketing is a major reason why the price had surged over 400% (to it&amp;#39;s all-time high) over the last 30 days. What other projects do you think have the potential to step up their marketing game and follow in Crypto.com&amp;#39;s footsteps?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/r6ngoh/cryptocom_has_proven_that_marketing_is_an/",
  "subreddit": "CryptoCurrency",
  "id": "r6ngoh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "CRO's recent pump is no secret. A lot of people are speculating that this upward\nmovement is because of the marketing efforts that the Crypto.com team have\nexecuted.\n\nThings like buying the naming rights to the Los Angeles Staples Center making it\nthe Crypto.com Arena or their countless sponsors in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CROの最近のポンプは、周知のとおりです。多くの人がこの上昇を推測しています。\nこの動きは、Crypto.comチームが行ったマーケティング活動によるものです。\nを実行しました。\n\nロサンゼルスのステイプルズ・センターの命名権を買って、そこを\nCrypto.comアリーナや、数え切れないほどのスポンサーを...",
      "title": "Crypto.comは、この市場ではマーケティングが重要な役割を果たすことを証明しました。他にどのようなプロジェクトが続くと思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "CRO最近的抽水机已经不是什么秘密。很多人都在猜测，这种向上的\n是由于Crypto.com团队所做的营销努力。\n执行的。\n\n像购买洛杉矶斯台普斯中心的命名权，使其成为\nCrypto.com竞技场或他们无数的赞助商在...",
      "title": "Crypto.com已经证明，在这个市场上，营销是一个重要部分。你认为还有哪些项目会沿着他们的道路走下去？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "CRO最近的抽水機已經不是什麼祕密。很多人都在猜測，這種向上的\n是由於Crypto.com團隊所做的營銷努力。\n執行的。\n\n像購買洛杉磯斯臺普斯中心的命名權，使其成爲\nCrypto.com競技場或他們無數的贊助商在...",
      "title": "Crypto.com已經證明，在這個市場上，營銷是一個重要部分。你認爲還有哪些項目會沿着他們的道路走下去？"
    }
  ]
}