{
  "author": "tylertennisman",
  "original_created_utc": 1631209383,
  "title": "Grandpa's mystery WWII destination per SECRET special orders, Army Air Corps",
  "created_utc": 1631229536,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My grandfather passed away at 101+ yrs old, and never found out the answer to what is, on the face, a simple question: what was secret destination 1609-A?</p>\n\n<p>He left behind an autobiography which contains a lit of great first-hand accounts of his time in the military as a fighter pilot and gunnery instructor. I&#39;d love to publish it in the public domain at some point, but that&#39;s another topic.</p>\n\n<p>He was Army Air Corps, and his group was supposed to go to the east coast to fly a relatively new-to-him plane off carriers and watch for U-boats. However, some of his guys (him included) didn&#39;t have the requisite number of hours on the plane, so they were left behind. They eventually got bored and felt underutilized in the war effort, so they bugged a general by phone. That general got them stationed somewhere else, but they were still flying a meager selection of training aircraft at that air field to keep their skills sharp. Their change of station took them closer to the general, so they decided to pay him a visit in person and really make their case.</p>\n\n<p>The general arranged for them to follow special orders on mission &quot;1609-A,&quot; marked SECRET. This may have been a wild goose chase (I wonder how much the general liked the pestering), but maybe it was an important mission. Grandpa writes he did not know the actual destination. Just that they needed to start in Presque Isle, ME, the jumping-off point for destinations further east (Europe).</p>\n\n<p>Upon arriving in Iceland, presumably on the way to somewhere in mainland Europe, some officer pulled rank and had my grandfather and his crew relieve exhausted pilots that had been chasing Nazi planes out of Icelandic skies for quite some time. After a rather miserable year in Iceland, shooing Germans away with no real action, the crew returned stateside.</p>\n\n<p>Grandpa never learned what 1609-A was about.</p>\n\n<p>This far past those events, I imagine such orders are declassified and public record. If so, where would I go to search for answers? I have the name and location of where the orders (the 1pg extract relevant to my grandfather and his crew, anyway). Searches based on names and locations haven&#39;t yet turned anything up. Nor has the mystery designator &quot;1609-A.&quot;</p>\n\n<p>References to better places to look, museums/docents/librarians/archives to consult, or to someone with excellent research skills would be very much appreciated.</p>\n\n<p>I can share further details from the orders extract if that would be helpful. Are such things, in fact, no longer &quot;secret&quot; this far in the future?</p>\n\n<p>Thank you for any leads!</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/pl2oil/grandpas_mystery_wwii_destination_per_secret/",
  "subreddit": "AskHistorians",
  "id": "pl2oil",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My grandfather passed away at 101+ yrs old, and never found out the answer to\nwhat is, on the face, a simple question: what was secret destination 1609-A?\n\nHe left behind an autobiography which contains a lit of great first-hand\naccounts of his time in the military as a fighter pilot and gunnery…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の祖父は101歳以上で亡くなりましたが、その答えは見つかりませんでした。\n祖父は101歳で亡くなりましたが、「1609-Aという秘密の目的地は何だったのか」という単純な疑問の答えを見つけることはできませんでした。\n\n祖父が残した自叙伝には、軍人時代の素晴らしい体験談がたくさん載っています。\n彼は自伝を残していますが、そこには戦闘機のパイロットや砲術士として軍隊にいた頃の素晴らしい体験談がたくさん書かれています...。",
      "title": "おじいちゃんの謎の第二次世界大戦中の行き先は、SECRET特別指令書に基づき、陸軍航空隊"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的祖父在101多岁的时候去世了，他一直没有找到答案。\n从表面上看，这是一个简单的问题：1609-A的秘密目的地是什么？\n\n他留下了一本自传，其中包含了许多精彩的第一手资料。\n他在军队中担任战斗机飞行员和炮手的经历。",
      "title": "爷爷的神秘二战目的地，根据陆军航空队的秘密特别命令。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的祖父在101多歲的時候去世了，他一直沒有找到答案。\n從表面上看，這是一個簡單的問題：1609-A的祕密目的地是什麼？\n\n他留下了一本自傳，其中包含了許多精彩的第一手資料。\n他在軍隊中擔任戰鬥機飛行員和炮手的經歷。",
      "title": "爺爺的神祕二戰目的地，根據陸軍航空隊的祕密特別命令。"
    }
  ]
}