{
  "author": "_LemonySnicket",
  "original_created_utc": 1659338038,
  "title": "Are these normal things for my father to tell his daughter?",
  "created_utc": 1659342837,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello! I (F15) admitted to my father (M34) that my mother&amp;#39;s boyfriend had been saying creepy and sexual things to me. My parents are divorced, you see. In the past, my father has said things to me in the past such as calling me sexy or hot, that every boy will look at me, and he has said he wished he had a girlfriend like me, as well as some other things I&amp;#39;ve forgotten.&lt;/p&gt;\n\n&lt;p&gt;But anyway, once I told him, he was angry about it, I kind of had to make him promise that he wouldn&amp;#39;t tell my mother. (She would absolutely freak out if she knew) ...But while being angry, my father said, &amp;#39;Yeah, I wouldn&amp;#39;t be able to stop myself either, you&amp;#39;re &amp;#39;fine&amp;#39;, but you&amp;#39;re what- 14?&amp;#39; then went back to being angry about him saying the things he did.&lt;/p&gt;\n\n&lt;p&gt;Are these (and the other things) normal comments that I&amp;#39;m overthinking? I don&amp;#39;t know where a line would be between a daughter and her father. We are quite close, and I&amp;#39;ve always preferred him over my mother.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/wdazok/are_these_normal_things_for_my_father_to_tell_his/",
  "subreddit": "TooAfraidToAsk",
  "id": "wdazok",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Hello! I (F15) admitted to my father (M34) that my mother's boyfriend had been\nsaying creepy and sexual things to me. My parents are divorced, you see. In the\npast, my father has said things to me in the past such as calling me sexy or\nhot, that every boy will look at me, and he has said he wished…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。私（F15）は、父（M34）に、母のボーイフレンドが私に気持ち悪いことや性的なことを言っていることを認めました。\n気持ち悪いこと、性的なことを言われたことを認めました。私の両親は離婚していますよ。過去に\n過去に父が私に言ったことは、「セクシー」「イケメン」「男の子はみんな私のことを見ている」というようなことでした。\nとか、「男の子はみんな私を見てくれる」とか、「願わくば...」と言ったことがあります。",
      "title": "これらは、父が娘に伝えるべき普通のことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好! 我（F15）向我父亲（M34）承认，我母亲的男友一直在对我说一些令人毛骨悚然的性话。\n对我说一些令人毛骨悚然的性话。我的父母已经离婚了，你看。在\n过去，我父亲曾对我说过一些话，比如说叫我性感或热辣，说每个男孩都会看我。\n说每个男孩都会看我，他还说他希望......",
      "title": "我父亲对他的女儿说这些话正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好! 我（F15）向我父親（M34）承認，我母親的男友一直在對我說一些令人毛骨悚然的性話。\n對我說一些令人毛骨悚然的性話。我的父母已經離婚了，你看。在\n過去，我父親曾對我說過一些話，比如說叫我性感或熱辣，說每個男孩都會看我。\n說每個男孩都會看我，他還說他希望......",
      "title": "我父親對他的女兒說這些話正常嗎？"
    }
  ]
}