{
  "author": "Basic_Bridge_8177",
  "the_new_excerpt": "Every transaction needs to be validated by users to make sure everything is\nlegit, there are two ways of doing this: staking and mining. I’ll only focus on\nstaking because that’s what this post is about.\n\nTo start basic a Stake is like a security deposit. Staking is the act of putting\nyour crypto…",
  "original_created_utc": 1620430513,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべてのトランザクションは、すべてが合法であることを確認するために、ユーザーによって検証される必要があります。\nこれにはステークとマイニングという2つの方法があります。この記事では\nステイキングについてのみ説明します。\n\nそもそもStakeとは、保証金のようなものです。ステイキングとは、自分の暗号を\nあなたの暗号を...",
      "title": "5歳の頃のようなステーキングの説明"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每笔交易都需要经过用户的验证，以确保一切合法。\n合法的，有两种方法可以做到这一点：赌注和采矿。我将只关注\n赌注，因为这是这篇文章的主题。\n\n首先，基本的赌注就像一个保证金。赌注是把\n你的加密货币...",
      "title": "钉子的解释就像你是5岁的孩子"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每筆交易都需要經過用戶的驗證，以確保一切合法。\n合法的，有兩種方法可以做到這一點：賭注和採礦。我將只關注\n賭注，因爲這是這篇文章的主題。\n\n首先，基本的賭注就像一個保證金。賭注是把\n你的加密貨幣...",
      "title": "釘子的解釋就像你是5歲的孩子"
    }
  ],
  "title": "Staking explained like you are 5 years old",
  "created_utc": 1620462636,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every transaction needs to be validated by users to make sure everything is legit, there are two ways of doing this: staking and mining. I’ll only focus on staking because that’s what this post is about.</p>\n\n<p>To start basic a Stake is like a security deposit. Staking is the act of putting your crypto out to forge blocks in the blockchain (valid transactions). The more you stake the more likely you are to be chosen to forge a block. If you are chosen to forge a block you will receive a reward in extra coins.</p>\n\n<p>I hope this helps everyone, if you have any more questions just PM me.</p>\n</div><!-- SC_ON -->",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/n7c61z/staking_explained_like_you_are_5_years_old/",
  "subreddit": "CryptoCurrency",
  "id": "n7c61z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988851
}