{
  "author": "aisling1199",
  "original_created_utc": 1659734477,
  "title": "Why can’t I (F23) make friends with American women after making so much progress with British ones?",
  "created_utc": 1659756469,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a British girl studying for my postgrad in New York and so far all of my friends are dudes. Basically, none of the girls I come across seem to like me. I’m not sure whether this is some kind of cultural divide but it kinda sucks as I place a lot of value on female friendships. Not that I’m looking for any BFFs necessarily. I just would prefer a bit of a mixed group.&lt;/p&gt;\n\n&lt;p&gt;Admittedly I have been in this position before. In my younger years, I was bullied by the mean girls and almost all of my friends were guys. However, this changed when I first went to uni in the UK to study for my undergrad. For the first time in my life, I had some women I could hang out and do stuff with. I figured I had just had a bad experience at school and that making girlfriends as an adult would be much easier moving forward.&lt;/p&gt;\n\n&lt;p&gt;Now I feel like I am being dragged back to some super awkward and disheartening times I was hoping to forget.&lt;/p&gt;\n\n&lt;p&gt;What do you think the problem is? And what can I do to alleviate it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 142,
  "permalink": "/r/TooAfraidToAsk/comments/wh6qcp/why_cant_i_f23_make_friends_with_american_women/",
  "subreddit": "TooAfraidToAsk",
  "id": "wh6qcp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a British girl studying for my postgrad in New York and so far all of my\nfriends are dudes. Basically, none of the girls I come across seem to like me.\nI’m not sure whether this is some kind of cultural divide but it kinda sucks as\nI place a lot of value on female friendships. Not that I’m…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はニューヨークで大学院に留学しているイギリス人女性ですが、これまでのところ、私のすべての\nの友達はみんな男よ。基本的に、どの女の子も私を好きになってくれないようです。\nこれはある種の文化的な隔たりなのかどうかわかりませんが、ちょっと嫌ですね。\n私は女性の友情に大きな価値を置いています。別に...",
      "title": "私(F23)は、イギリス人女性との交際がこれだけ進展しているのに、なぜアメリカ人女性と友達になれないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个在纽约攻读研究生的英国女孩，到目前为止，我所有的\n朋友都是男的。基本上，我遇到的女孩似乎都不喜欢我。\n我不确定这是否是某种文化上的差异，但这有点糟糕，因为\n我非常重视女性的友谊。不是说我...",
      "title": "为什么我（F23）在与英国女性取得如此大的进展后，却不能与美国女性交朋友？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個在紐約攻讀研究生的英國女孩，到目前爲止，我所有的\n朋友都是男的。基本上，我遇到的女孩似乎都不喜歡我。\n我不確定這是否是某種文化上的差異，但這有點糟糕，因爲\n我非常重視女性的友誼。不是說我...",
      "title": "爲什麼我（F23）在與英國女性取得如此大的進展後，卻不能與美國女性交朋友？"
    }
  ]
}