{
  "author": "Georgy_K_Zhukov",
  "original_created_utc": 1641310531,
  "title": "It's time to vote for the Best of AskHistorians, 2021!!! Make your voice heard!!!",
  "created_utc": 1641354110,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;2021 has concluded, and that means it is time to look back and reflect on all the amazing content that was written on the subreddit this past year.&lt;/p&gt;\n\n&lt;p&gt;And while &lt;em&gt;every single&lt;/em&gt; answer, and writer, who contributed over the past year deserves recognition for the part they played in making this such an incredible community (not to mention people asking the questions, reading the answers, upvoting, or just quietly lurking), but every year there are nevertheless some truly incredible standouts, and the &amp;#39;Best of 2021&amp;#39; Awards honor at least a slice of those with some &lt;em&gt;super cool AskHistorians swag&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/5gyoqbo5xo981.jpg?width=2712&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=69a28506948d4f11fc4918a4a2e5008c0ea11214\"&gt;Some of the possible prizes at stake!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And those awards are based on &lt;em&gt;your&lt;/em&gt; input! As in past years, the &amp;#39;Best of&amp;#39; Awards are &amp;quot;seeded&amp;quot; using the winners of our monthly award winners, and &lt;strong&gt;you&lt;/strong&gt; can upvote the answer(s) you enjoyed the most (With a 1st, 2nd, 3rd, *and* Dark Horse award, you don&amp;#39;t need to limit yourself to just one). But if you think there is an answer which ought to be in there and isn&amp;#39;t, feel free to submit it yourself!&lt;/p&gt;\n\n&lt;p&gt;If you have any questions or commentary about the Best of Awards, please restrict them as replies to the designated stickied comment at the top of the thread.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/rvx4q1/its_time_to_vote_for_the_best_of_askhistorians/",
  "subreddit": "AskHistorians",
  "id": "rvx4q1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "2021 has concluded, and that means it is time to look back and reflect on all\nthe amazing content that was written on the subreddit this past year.\n\nAnd while every single answer, and writer, who contributed over the past year\ndeserves recognition for the part they played in making this such an…"
}