{
  "author": "AskScienceModerator",
  "original_created_utc": 1654772442,
  "title": "AskScience AMA Series: Hi Reddit - we are group of 250 engineers, scientists, innovators, technologists, digital experts, and designers with a collected 45 PhDs / Professors and 35 members representing national science or engineering institutions. AUA!",
  "created_utc": 1654777718,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt;\nA year ago, we did an &lt;a href=\"https://www.reddit.com/r/askscience/comments/m5i6g5/askscience_ama_series_hi_reddit_we_are_group_of/\"&gt;AMA&lt;/a&gt; answering science or technology questions on any topic from Reddit. We had a blast and so we&amp;#39;re back again! So please ask us any questions any of you have to do with science or technology and how they affect your life. There are no silly questions - ask us anything and we will try to give an easy-to-understand answer and, wherever possible, provide some further sources to enable you to do your own research/reading.&lt;/p&gt;\n\n&lt;p&gt;Our goal is simply to advance everyone&amp;#39;s understanding of science, engineering, and technology and to help people be better informed about the issues likely to affect them and their families.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;More info / Longer read:&lt;/strong&gt;\nCSES is a registered charity in the UK, founded in 1920. We&amp;#39;re a volunteer group of over 250 members and our key strength is our diversity and interdisciplinary expertise. Our members come from a variety of educational, social, and economic backgrounds, from industry and academia and a multitude of age groups, representing groups from the millennials all the way to the Silent Generation (our oldest member being 98)!&lt;/p&gt;\n\n&lt;p&gt;There has been growing dis-information globally in the last 20 years. Today&amp;#39;s global interconnectedness, while being hugely beneficial for making information easily accessible to everyone, has made it ever more difficult to determine &amp;#39;truth&amp;#39; and who to trust. As an independent charity, not affiliated or biased to any particular group, but with broad knowledge we are here to answer any questions you may have and to hopefully point you to further reading!&lt;/p&gt;\n\n&lt;p&gt;Our goal is simply to answer as many of your questions as we can - but we aren&amp;#39;t able to give advice on things - sorry! We will also be clear where what we are saying is the experience-based opinion of someone in our team.&lt;/p&gt;\n\n&lt;p&gt;So, Reddit... Ask us anything!&lt;/p&gt;\n\n&lt;p&gt;CSES will draw from its large pool of volunteers to answer your questions, however some of the people standing by to answer comments are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Professor David Humber&lt;/strong&gt;: Over 30 years&amp;#39; experience as a researcher, lecturer and senior university manager, specialising in immuno-biology and the life sciences.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;David Whyte BEM&lt;/strong&gt;: Technologist and Chartered Engineer with over 10 years&amp;#39; R&amp;amp;D experience and 16 international patents across a wide range of technologies. Honoured by The Queen with a BEM, for services to engineering and technology.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Amy Knight&lt;/strong&gt;: Science teacher and artist experienced in art/science collaborations with organisations like Soapbox Science and The Royal Society; her work has been featured at the Tate Modern&amp;#39;s &amp;quot;Tate Exchange&amp;quot;.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Anthony McQuiggan&lt;/strong&gt;: 10 years of engineering experience and 30 years as a serial entrepreneur having built a number of very successful start-up SME technology companies in the UK, Japan, and the USA.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Roger Pittock&lt;/strong&gt;: Active retired engineer with 37 years&amp;#39; experience in electronics, software, mechanical, electrical, process, and safety systems. Avid supporter of the Consumers&amp;#39; Association having been elected to their Council for many years.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Adam Wood - President of CSES&lt;/strong&gt;: Chartered Engineer with over 13 years&amp;#39; experience in electronics, software, and systems engineering - working in the medical / healthcare, transport, and aerospace industries.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/chelmsfordses\"&gt;/u/chelmsfordses&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askscience/comments/v8e901/askscience_ama_series_hi_reddit_we_are_group_of/",
  "subreddit": "askscience",
  "id": "v8e901",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TL;DR: A year ago, we did an AMA\n[https://www.reddit.com/r/askscience/comments/m5i6g5/askscience_ama_series_hi_reddit_we_are_group_of/]\nanswering science or technology questions on any topic from Reddit. We had a\nblast and so we're back again! So please ask us any questions any of you have to\ndo…"
}