{
  "author": "vanderbubin",
  "the_new_excerpt": "Idk if this is the right place to ask this, but here is the back story, I have a\nfriend who is the mother of two beautiful half white half honduran children.\nSadly earlier this year the older son, S, was kidnapped by their self proclaimed\nnazi father. While he had S, he convinced the kid that he is;…",
  "original_created_utc": 1619206085,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで聞いていいのかわかりませんが、以下のような経緯があります。\n私の友人は、白人とホンジュラス人のハーフである2人の美しい子供の母親です。\n悲しいことに今年の初め、上の息子のS君が自称ナチスの父親に誘拐されてしまいました。\nナチスの父親に誘拐されました。彼はSを拉致している間、Sに「自分は...」と信じ込ませていました。",
      "title": "子供がナチスへの執着をやめるための推奨図書"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道这是否是问这个问题的正确地方，但这里有一个背景故事。\n我有一个朋友，她是两个漂亮的半白半洪都拉斯孩子的母亲。\n不幸的是，今年早些时候，大儿子S被他们自称的纳粹父亲绑架了。\n纳粹父亲绑架。在他绑架S时，他让孩子相信他是；...",
      "title": "推荐阅读，帮助孩子不再痴迷于纳粹的东西"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道這是否是問這個問題的正確地方，但這裏有一個背景故事。\n我有一個朋友，她是兩個漂亮的半白半洪都拉斯孩子的母親。\n不幸的是，今年早些時候，大兒子S被他們自稱的納粹父親綁架了。\n納粹父親綁架。在他綁架S時，他讓孩子相信他是；...",
      "title": "推薦閱讀，幫助孩子不再癡迷於納粹的東西"
    }
  ],
  "title": "Recommended reading to help a kid stop obsessing over nazi stuff",
  "created_utc": 1619217190,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Idk if this is the right place to ask this, but here is the back story, I have a friend who is the mother of two beautiful half white half honduran children. Sadly earlier this year the older son, S, was kidnapped by their self proclaimed nazi father. While he had S, he convinced the kid that he is; not half honduran, that he is fully white and german, that ballet is gay, that being gay is wrong, and introduced him to tons of youtube videos about the nazi military complex during ww2. now, months later, S is finally back with his mother and has been blasting nazi marching music, talking about the master race, and other stuff glorifying nazi&#39;s. He is about 11 years old and very bright. This is all a huge shift to how he was before the kidnapping. His mother has taking him to therapy and she has asked me to help get him into other history stuff to help curtail this behavior. My question is could you guys recommend some reading or videos on honduras culture? As well as other interesting time periods to help shift his interest? Anything is appreciated. </p>\n\n<p>Edit: thought of this right after making the post, I&#39;m also going to be going over nazi&#39;s with him in a ww2 context to help curb the wehraboo type statements from him. As someone commented, I definitely agree surpressing him wanting to learn about it is a bad idea. Better to help educate him on the truth of the matter. </p>\n\n<p>Tldr: friends kid was kidnapped by a nazi and was indoctrinated, need other history to help shift his interest.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/mx33a4/recommended_reading_to_help_a_kid_stop_obsessing/",
  "subreddit": "AskHistorians",
  "id": "mx33a4",
  "is_self": true,
  "media": null,
  "is_video": false
}