{
  "author": "870SWMAN",
  "original_created_utc": 1654301655,
  "title": "Why aren't loud obnoxious people told to \"shut the fuck up\" more often?",
  "created_utc": 1654317325,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I own a retail business. I grew up in the retail and restaurant industry. I&amp;#39;m in my thirties. I only encounter these types of people at work. I think I just don&amp;#39;t deal with them in my personal life because I can just walk away and avoid them. &lt;/p&gt;\n\n&lt;p&gt;There seems to be this personality type of people that have to talk louder and more than you. They have to dominate the conversation. If you say one word they have to say fifty. They always have to one up you and they always talk down to you. They seem to be on the lookout for something, anything, they can make fun of you about or embarrass you. It&amp;#39;s almost like they see every conversation or interaction as a competition that they have to win. Dealing with them is just draining. &lt;/p&gt;\n\n&lt;p&gt;I suspect they do this behavior because they are super insecure. I guess they feel like if they dominate the conversation and insult you or make fun of you it will protect them.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve noticed the people that do this are overwhelming all weak looking. Shorter than average, overweight, out of shape, oddly shaped etc. I swear they do this behavior to compensate. Maybe it&amp;#39;s their armor. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve had a couple of repeat customer that do this in my shop. It&amp;#39;s non stop obnoxious stuff statements, shitting on me, shitting on my staff, shitting on my business, screeching, god forbid they think you made a mistake, etc. They seem to enjoy doing this trying to push your buttons and catch you off guard or make you uncomfortable. They ask inappropriate or invasive questions. Just fucking exhausting dealing with them. My coworkers and other customers are looking at them like they are crazy. It always seems like a pissing match. Pointless competition. &lt;/p&gt;\n\n&lt;p&gt;In the last couple of years I&amp;#39;ve stood up to these types. Usually I ask them why they are so obnoxious or tell them they need to stop talking. If they give me shit I tell them to stop talking or leave my business. They usually shut up pretty quick. If they do return they are super polite and quiet. I swear they were like testing me and when I showed I could stand up for myself they started respecting me.&lt;/p&gt;\n\n&lt;p&gt;I barely have to open my mouth and say anything to them and they shut up. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s so weird. If you are a horrible fighter why would you go out of your way to try to get into fights with people?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/TooAfraidToAsk/comments/v4cqyh/why_arent_loud_obnoxious_people_told_to_shut_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "v4cqyh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I own a retail business. I grew up in the retail and restaurant industry. I'm in\nmy thirties. I only encounter these types of people at work. I think I just\ndon't deal with them in my personal life because I can just walk away and avoid\nthem.\n\nThere seems to be this personality type of people that…"
}