{
  "author": "Logical-Beautiful66",
  "the_new_excerpt": "If you've been around crypto for a while, you probably had a good return on your\ninvestment. You know the feeling of doubling your money and some of you might\nknow the feeling of seeing that initial investment 5x.\n\nI'm a dude in his tirthies. Before getting involved in crypto I invested in S&P\n500…",
  "original_created_utc": 1622162890,
  "localize": [
    {
      "locale": "ja",
      "title": "セックスは素晴らしいですが、暗号化された投資を5倍にしたことはありますか？",
      "the_new_excerpt": "暗号をしばらく使っていた人は、おそらく良いリターンを得ていたことでしょう。\n投資 お金が2倍になる感覚をご存知の方や\nその初期投資額が5倍になった時の感動を、私は知っています。\n\n私は胴元の男です。暗号に関わる前に、私はS&Pに投資していました。\n500..."
    },
    {
      "locale": "zh",
      "title": "是的，性是伟大的，但你有过5倍于你的加密货币投资吗？",
      "the_new_excerpt": "如果你接触加密货币已经有一段时间了，你可能在你的投资上有一个良好的回报。\n投资。你知道你的钱翻倍的感觉，有些人可能知道\n知道看到最初的投资翻了5倍的感觉。\n\n我是一个花花公子，在他的Tirthies。在涉足加密货币之前，我投资于标准普尔\n500..."
    },
    {
      "locale": "zh-Hant",
      "title": "是的，性是偉大的，但你有過5倍於你的加密貨幣投資嗎？",
      "the_new_excerpt": "如果你接觸加密貨幣已經有一段時間了，你可能在你的投資上有一個良好的回報。\n投資。你知道你的錢翻倍的感覺，有些人可能知道\n知道看到最初的投資翻了5倍的感覺。\n\n我是一個花花公子，在他的Tirthies。在涉足加密貨幣之前，我投資於標準普爾\n500..."
    }
  ],
  "title": "Yeah sex is great, but have you ever 5X'd your crypto investment?",
  "created_utc": 1622193654,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you&#39;ve been around crypto for a while, you probably had a good return on your investment. You know the feeling of doubling your money and some of you might know the feeling of seeing that initial investment 5x.</p>\n\n<p>I&#39;m a dude in his tirthies. Before getting involved in crypto I invested in S&amp;P 500 stocks and I was so hyped to get those 10% yearly returns!</p>\n\n<p>You can imagine the euphoria I felt when my initial investment in crypto doubled IN A MONTH. At a point, it 5X&#39;d before that dip. The best feeling ever, since I could literaly pay the remining of my mortgage with that sum.</p>\n\n<p>I got a bit greedy and put more money into it before the last 50% dip. You know what? I take that as a costly lesson.</p>\n\n<p>I withdraw 2x of my initial investment to put on my mortgage and I&#39;ll hodl the remaining for my retirement.</p>\n\n<p>What I want to say is I let the euphoria turn into greed, event when I attained my goal. That feeling is exiting and you kind of think it will go on forever, but reality will slap back soon or later. So just a reminder to take profit sometimes.</p>\n\n<p>Other than that, I&#39;ll HODL ON FOR THE YEARS TO COME! I see that investment as an opportunity to gain financial freedom one day, but the journey with you guys is awesome. </p>\n\n<p>Thanks for the read, fellow redditors!</p>\n</div><!-- SC_ON -->",
  "score": 710,
  "permalink": "/r/CryptoCurrency/comments/nmly45/yeah_sex_is_great_but_have_you_ever_5xd_your/",
  "subreddit": "CryptoCurrency",
  "id": "nmly45",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804295055
}