{
  "author": "Pixeth_",
  "original_created_utc": 1631550743,
  "title": "If the SEC wants to be taken seriously, they should take action against the massive media outlets which caused the manipulation we saw today",
  "created_utc": 1631593843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Is it likely? Are we going to see them fine outlets like Reuters, Yahoo and CNBC and all of the rest who picked up the story and pushed this info to millions around the world?</p>\n\n<p>These are traditional media entities, around a long time before crypto came to be - so can we really be considered the problem?</p>\n\n<p>Surely this is textbook manipulation - the kind they&#39;re quite publicly condemning and one of the main reasons they claim regulation is required in the first place?</p>\n\n<p>It should be criminal to report misinformation about financial assets (isn&#39;t it meant to be?)- and preventing this kind of thing from happening should be within the SEC&#39;s remit. This most certainly should not have happened and the culprits should face action.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/pniztx/if_the_sec_wants_to_be_taken_seriously_they/",
  "subreddit": "CryptoCurrency",
  "id": "pniztx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Is it likely? Are we going to see them fine outlets like Reuters, Yahoo and CNBC\nand all of the rest who picked up the story and pushed this info to millions\naround the world?\n\nThese are traditional media entities, around a long time before crypto came to\nbe - so can we really be considered the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "可能性はありますか？ロイター、ヤフー、CNBCのような細かいアウトレットを見ることになるのでしょうか？\nこの記事を取り上げ、世界中の何百万人もの人々にこの情報を伝えたロイター、ヤフー、CNBCなどの報道機関に感謝することになるのでしょうか？\n世界中の何百万人もの人々にこの情報を伝えたロイターやヤフー、CNBCなどの報道機関に罰金を科すことになるのでしょうか？\n\nこれらは伝統的なメディア企業で、暗号が登場するずっと前から存在していました。\nだから、私たちは本当に...",
      "title": "もしSECが真剣に対応したいのであれば、今日のような操作を引き起こした巨大なメディアに対して行動を起こすべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有可能吗？我们是否会看到他们对路透社、雅虎和CNBC等机构进行罚款？\n以及所有其他报道并将这一信息推送给全世界数百万人的机构。\n报道？\n\n这些都是传统的媒体实体，在加密货币出现之前已经存在了很长时间。\n所以我们真的可以被认为是......",
      "title": "如果美国证券交易委员会希望被认真对待，他们应该对造成我们今天看到的操纵行为的大规模媒体采取行动。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有可能嗎？我們是否會看到他們對路透社、雅虎和CNBC等機構進行罰款？\n以及所有其他報道並將這一信息推送給全世界數百萬人的機構。\n報道？\n\n這些都是傳統的媒體實體，在加密貨幣出現之前已經存在了很長時間。\n所以我們真的可以被認爲是......",
      "title": "如果美國證券交易委員會希望被認真對待，他們應該對造成我們今天看到的操縱行爲的大規模媒體採取行動。"
    }
  ]
}