{
  "author": "yellao23",
  "original_created_utc": 1629842354,
  "title": "Am I the Only One Who’s Crypto “Bags” are like $20?",
  "created_utc": 1629873743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been curious about this for awhile. I always hear people say they have big bags of crypto. Or they have a bag in this crypto coin or that.</p>\n\n<p>I don’t know if it’s just me, but I feel like I got a coin purse in most crypto. My “bags” of crypto are like $35. </p>\n\n<p>I wouldn’t say I’m economically challenged either. I’m single and don’t have kids, but I still don’t know where everyone finds the money to have these big “bags” in different crypto. Sometimes in the $1000s.</p>\n\n<p>Someone let me in on the secret</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/paxc9s/am_i_the_only_one_whos_crypto_bags_are_like_20/",
  "subreddit": "CryptoCurrency",
  "id": "paxc9s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been curious about this for awhile. I always hear people say they have big\nbags of crypto. Or they have a bag in this crypto coin or that.\n\nI don’t know if it’s just me, but I feel like I got a coin purse in most crypto.\nMy “bags” of crypto are like $35.\n\nI wouldn’t say I’m economically…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前々から気になっていたことがあります。大きなバッグを持っているという話をよく耳にします。\n大きな暗号の袋を持っているとか あるいは、この暗号コインやその他のものをバッグに入れているとか。\n\n私だけかもしれませんが、ほとんどの暗号を小銭入れに入れているような気がします。\n私の暗号の「バッグ」は35ドルくらいです。\n\n経済的とは言えませんが...。",
      "title": "Crypto \"Bag \"を20ドルで購入しているのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对这个问题已经好奇了一段时间。我总是听到有人说他们有大袋\n大袋的加密货币。或者他们有一袋这种或那种加密货币。\n\n我不知道是不是我的原因，但我觉得我在大多数加密货币中都有一个硬币包。\n我的加密货币的 \"袋子 \"好像是35美元。\n\n我不会说我在经济上...",
      "title": "我是唯一一个加密货币 \"包 \"像20美元的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對這個問題已經好奇了一段時間。我總是聽到有人說他們有大袋\n大袋的加密貨幣。或者他們有一袋這種或那種加密貨幣。\n\n我不知道是不是我的原因，但我覺得我在大多數加密貨幣中都有一個硬幣包。\n我的加密貨幣的 \"袋子 \"好像是35美元。\n\n我不會說我在經濟上...",
      "title": "我是唯一一個加密貨幣 \"包 \"像20美元的人嗎？"
    }
  ]
}