{
  "author": "y_angelov",
  "the_new_excerpt": "What does Alibaba do?\n\nFirst and foremost, they are an online commerce platform. They sell retail, they\nsell wholesale, they sell single items, they sell container loads of items. This\nalso includes a logistics platform and global fulfillment network, Cainiao\nNetwork, and an on-demand delivery and…",
  "original_created_utc": 1620513573,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アリババは何をしているのでしょうか？\n\nまず第一に、アリババはオンラインコマースのプラットフォームです。小売、卸売、単品、コンテナ単位での販売を行っています。\n卸売り、単品販売、コンテナ単位での販売を行っています。これは\nまた、物流プラットフォームやグローバルフルフィルメントネットワークであるCainiao Networkや\nネットワーク、そしてオンデマンド・デリバリーと...",
      "title": "Alibaba: 短い分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阿里巴巴是做什么的？\n\n首先，也是最重要的，他们是一个在线商务平台。他们销售零售，他们\n批发，他们销售单件商品，他们销售集装箱的商品。这\n这也包括一个物流平台和全球执行网络，财猫网\n网络，以及一个按需交付和...",
      "title": "阿里巴巴。简要分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "阿里巴巴是做什麼的？\n\n首先，也是最重要的，他們是一個在線商務平臺。他們銷售零售，他們\n批發，他們銷售單件商品，他們銷售集裝箱的商品。這\n這也包括一個物流平臺和全球執行網絡，財貓網\n網絡，以及一個按需交付和...",
      "title": "阿里巴巴。簡要分析"
    }
  ],
  "title": "Alibaba: A Short Analysis",
  "created_utc": 1620556012,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>What does Alibaba do?</strong></p>\n\n<p>First and foremost, they are an online commerce platform. They sell retail, they sell wholesale, they sell single items, they sell container loads of items. This also includes a logistics platform and global fulfillment network, Cainiao Network, and an on-demand delivery and services platform, Ele.me. Then, they also have a rapidly expanding cloud business in addition to some small entertainment, gaming and other business units, but in this analysis I&#39;ll mainly focus on the online commerce and the cloud business as they are the two pillars of Alibaba&#39;s business strategy.</p>\n\n<p>So, let&#39;s look at the online commerce. Is it doing well? Well? It&#39;s doing fantastic! The last year, it grew by 35% YoY! Over the last 5 years, online commerce sales increased by almost 500% from 92 billion RMB in 2016 to 436 billion in 2020. To give you an idea, 1 US dollar was roughly 7.08 RMB then so Alibaba&#39;s online commerce revenue in 2020 was roughly $61.5 Billion. Revenue is extremely important for business growth so seeing a 35 PERCENT increase is amazing! In fact, this is almost unheard of for businesses of this size which just shows you how unique Alibaba is. Then, the adjusted earnings from online commerce also grew by roughly 22% to 165 billion RMB or $23.4 billion. So, how are they doing THAT well? Simple! They did get the boost in online sales because of the pandemic, but they also have 780 MILLION active consumers on their online marketplaces in China and another 190 millions internationally as of the end of 2020. They also have 846 Million Mobile Monthly Active users. Essentially, they&#39;ve got more customers that the population of the US and EU COMBINED!</p>\n\n<p>So, Alibaba&#39;s online marketplaces include several websites, but not just any websites. In fact, the company owns 2 of the 10 most visited websites IN. THE. WORLD. Tmall and Taobao. Alipay ranks in 26th place and Aliexpress ranks in 42nd place. The company presence is just mindboggling. And, to top it all off, the business model is much lighter than Amazon&#39;s, for example. Why? Well, Alibaba does not sell its own products, it doesn&#39;t have any inventory, doesn&#39;t have any warehouses, which results in less expenses and a higher net profit. How much higher? Well, Amazon&#39;s latest net profit margin is 5.53%. Alibaba&#39;s? 24.71%!</p>\n\n<p>So, the online commerce is the main driver behind Alibaba&#39;s amazing performance as currently none of the other business segments are producing any meaningful earnings. In fact, the digital media and entertainment and the innovation incentives and others segments are actually losing money, although the CEO has explained that their purpose is not to be profitable, but rather to augment the Alibaba brand and support the online commerce platform. Now, the cloud computing is different. In the 4th quarter of 2020, it finally broke even! It is an important part of Alibaba&#39;s long-term strategy and they are placing a lot of emphasis on growing it. In 2020, cloud revenues grew by almost 62%! Alibaba Cloud is currently the biggest cloud provider in China and they intend to stay that way.</p>\n\n<p>Overall, the company is growing fast, roughly 38% increase in sales YoY with net income rising roughly 70% in the last year! We can see that the core business and the future business of Alibaba are doing well. How are its financials though? Well, it has a lot of cash, roughly 330 Billion RMB and its current assets are enough to cover all of its liabilities so they are looking very healthy. In fact, they&#39;ve got enough free cash to start repurchasing shares. In the final quarter of 2020, they repurchased roughly $110 million US dollars which is not that much honestly, but they&#39;ve approved a share repurchase plan of between $6 and $10 Billion. If we see them acting on that plan, investors could get very excited! So, the business is growing fast, the financials look solid, they&#39;re starting to return money to the shareholders. What about their price?</p>\n\n<p>Well, the company is relatively cheap right now. Their PE ratio is 25.5 with a forward PE of 20.6. Historically, they have a PE average of 34.5 so we can see that they are on a big discount right now. Their PB ratio is 5 which is normal for them so there&#39;s that. Compared to their direct Chinese competitors, Alibaba&#39;s PE isn&#39;t actually that low, but I&#39;d say that the reason behind it is that most of its rivals are only involved in online commerce whereas Alibaba is also the leader in the rapidly growing cloud computing business. Also, if we compare Alibaba to Amazon which is pretty much the closest comparison we can get in terms of business segments, we can see that Amazon&#39;s PE has not dropped below 60 in the last 5 years and their average is 137.2, way higher than Alibaba! Amazon&#39;s PB ratio is also roughly 18 or almost 2 and a half times higher than Alibaba&#39;s! Their revenues and earnings are growing at roughly the same pace although Amazon had a phenomenal year in 2020.</p>\n\n<p>But, they&#39;ve also beaten the last 10 analysts earnings estimates and the last 8 revenue estimates so they tend to outperform although I think that their next quarterly earnings will be a miss due to the fine that was imposed on them. Basically, we can see that investors have not priced in the growth in the share price which essentially means that Alibaba is a great deal, at least in my opinion. It&#39;s no wonder that virtually all of the analyst recommendations for this stock are either BUY or STRONG BUY (Yahoo finance screenshot). Also, most of their competitors are focused only on online commerce which means that Alibaba has a better overall offering and competitive advantage than them. It&#39;s got better sales, better net profit margin, better brand presence, better long-term strategy AND more users than Pinduoduo, Vipshop, JD. Clearly, it&#39;s the better deal, at least in my opinion, but in all fairness even its competitors are doing really well. Some people who agree with me are Ray Dalio whose 3rd biggest stock holding is Alibaba and Charlie Munger who just bought into it with 20% of his Daily Journal portfolio.</p>\n\n<p>Now, this stock just looks to good to be true, right? Sort of. Alibaba does have some issues, but they&#39;re of slightly different nature. The main risks involved with the company are more... political. First of all, you have the SEC threatening to delist any companies that are doing business with the Chinese military, that don&#39;t provide proper financial statements and reporting, that have a Chinese Communist Party member on their board OR are controlled by an entity of a foreign government. Now, technically speaking, just because a company is delisted doesn&#39;t mean that you cannot trade it, but chances are that its stock price will be hurt... A LOT. You&#39;d still be able to trade it over-the-counter, but that brings a lot of problems of its own and also chances are that most normal online brokers won&#39;t support it. I know that my broker, eToro, does not. Still, you can easily avoid that by simply buying Alibaba&#39;s stock that is trading on the Hong Kong exchange. The ticker is 9988, but it&#39;s essentially the same stock. Personally, I don&#39;t think that&#39;s going to happen, but don&#39;t take my word for it. Buying the Hong Kong stock will ensure you are protected from the delisting.</p>\n\n<p>That isn&#39;t all though. Currently, there is also an ongoing regulation crackdown in China aimed at Chinese big tech companies. Alibaba was famously targeted because Jack Ma, its founder, made criticised the Chinese government&#39;s approach to financial regulations. As a result, the IPO for Ant Group, which is essentially Alibaba&#39;s spin-off that deals with consumer financing and lending, was squashed late last year and restructuring was ordered. More recently, more regulations and restructuring was ordered. While this has affected Alibaba&#39;s business model to an extent, the regulations have also affected Alibaba&#39;s direct competitors so the company still retains its competitive advantage. The regulators also handed Alibaba a fine of $2.8 BILLION US dollars, the biggest one ever handed... so far. They also ordered the company to stop its anti-competitive practices which involved Alibaba making merchants choose between using only Alibaba or rival platforms. So, are the regulators finished with Alibaba? Well, we can only speculate. The biggest worry that investors have is that the regulators will break up Alibaba into different smaller businesses, which is a possibility although a lot of analysts say that China will not risk destroying one of its biggest and most famous companies. They do seem to have moved on to the other tech companies, but as I said this is not something that you can know for certain.</p>\n\n<p>So, what&#39;s the verdict? Is Alibaba a good investment right now? Personally, I think so. It is undoubtedly risky, but the company offers such amazing prospects that it&#39;s just crazy to miss out on. I mean, if you could buy Amazon at such a cheap price, wouldn&#39;t you? I&#39;d recommend doing your own research into it, but I believe that it offers a great opportunity right now and that&#39;s why it is my second largest holding and almost 10% of my total portfolio. </p>\n\n<p>Finally, Alibaba will be reporting its 2021 quarter 1 earnings next Thursday so check this out to see what could happen. There will probably be a lot of price action before that and likely after it, hopefully in a nice positive green upward trajectory.</p>\n\n<p>That&#39;s my analysis on Alibaba. There&#39;s a lot more to talk about, but I wanted to keep it on the short side. What do you think?</p>\n\n<p>&#x200B;</p>\n\n<p><strong>TLDR; Alibaba is solid and cheap. Check the comments for a video link.</strong></p>\n</div><!-- SC_ON -->",
  "score": 54,
  "permalink": "/r/stocks/comments/n80bmo/alibaba_a_short_analysis/",
  "subreddit": "stocks",
  "id": "n80bmo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995616
}