{
  "author": "RowanHarley",
  "the_new_excerpt": "I'm not really sure what PLTRs short term prospectives are, they are integrated\nwith AWS, which I think will be very beneficial for their longevity, alongside\ntheir projects offered to counter-terrorism analysts, hedge funds, banks,\nfinancial firms. I'm sure there's plenty of bearish cases for PLTR,…",
  "original_created_utc": 1616084605,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不太清楚PLTRs的短期前景是什么，它们是综合的。\n与AWS的合作，我认为这将对他们的长久发展非常有利，同时也是\n其项目提供给反恐分析师、对冲基金、银行。\n金融公司。我相信PLTR有很多看空的案例，...",
      "title": "如果你喜欢长期玩，26岁以下的PLTR是个不错的抢手货。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不太清楚PLTRs的短期前景是什麼，它們是綜合的。\n與AWS的合作，我認爲這將對他們的長久發展非常有利，同時也是\n其項目提供給反恐分析師、對沖基金、銀行。\n金融公司。我相信PLTR有很多看空的案例，...",
      "title": "如果你喜歡長期玩，26歲以下的PLTR是個不錯的搶手貨。"
    }
  ],
  "title": "If you like to play long-term, PLTR under 26 is a good steal",
  "created_utc": 1616089828,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not really sure what PLTRs short term prospectives are, they are integrated with AWS, which I think will be very beneficial for their longevity, alongside their projects offered to counter-terrorism analysts, hedge funds, banks, financial firms. I&#39;m sure there&#39;s plenty of bearish cases for PLTR, but looking historically, the price tends to float between 24 and 26 when it&#39;s doing nothing, and could probably hit 30 on a good day, but if you want to stock up on shares, and there&#39;s no news, you should try to buy your shares between this range. If you get in under 24, you&#39;re doing very well, but even between this range, you&#39;ll be profitable in the future. Of course, this advice is only good if PLTR doesn&#39;t come out with a brilliant earnings report, a new project that will solve world hunger, or find a cure for cancer, but in general, this is the best entry range to ensure you don&#39;t miss out on any upward momentum, while saving yourself from any major losses.</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/stocks/comments/m7uje6/if_you_like_to_play_longterm_pltr_under_26_is_a/",
  "subreddit": "stocks",
  "id": "m7uje6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819548
}