{
  "author": "AuroraVandomme",
  "original_created_utc": 1641213593,
  "title": "Algo is garbage (I'm explaining why)",
  "created_utc": 1641229119,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m totally aware that this will be probably the most downvoted post in the history of this sub. But I don&amp;#39;t care.&lt;/p&gt;\n\n&lt;p&gt;Algo is the most shilled coin on reddit. I am the unlucky one and took the bait and bought Algo because of the shill. I did the research and on paper everything looked great. Fast, secure, reliable. I have read a lot of articles, read whitepaper and bought Algo. But now after half a year of holding I have to say that it&amp;#39;s really bad. And I&amp;#39;ll tell you why. Keep in mind that I&amp;#39;m talking about the WHOLE ALGO ECOSYSTEM and not blockchain itself.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Dapps - like currently there are 5 or 6 daapps? This is a joke. Younger chains have hundreds of them but in algo ecosystem there are 5 or 6 dapps and they are working really bad (more about this in the next points. The chain being young is not an excuse because other chains have much more cool and usefull daaps. Algo dapps are using AVM (Algorand wirtual machine) so the adoption will be always slower and slower.&lt;/li&gt;\n&lt;li&gt;Dapps working like shit. Many of those daaps rely on a single source of truth that is Algoexplorer API. It has constant problems and because of that platforms like yieldly works like shit. November and December was horrible. There wasn&amp;#39;t a single day without any issues.&lt;/li&gt;\n&lt;li&gt;Official wallet... Sometimes is not working. Or not working correctly. It&amp;#39;s too dependant on Algoexporer api and AWS.&lt;/li&gt;\n&lt;li&gt;ALGO is CENTRALIZED&lt;/li&gt;\n&lt;li&gt;No rewards for running own node&lt;/li&gt;\n&lt;li&gt;Yesterday the only Algorand DEX tinyman was compromised and hacked and all liquidity pools are gone.&lt;/li&gt;\n&lt;li&gt;Horrible marketing.&lt;/li&gt;\n&lt;li&gt;No clear roadmap for 2022.&lt;/li&gt;\n&lt;li&gt;Unfulfilled promises (example? about increasing TPS)&lt;/li&gt;\n&lt;li&gt;A lot small ones like poor website (doesn&amp;#39;t look professional) and poor communication with Algorand Foundation&lt;/li&gt;\n&lt;li&gt;The Algorand community on reddit is so toxic and blind. If the Algo price is increasing they are posting charts and yelling how awesome Algo is and the pump is incoming. When it&amp;#39;s down they claim that it&amp;#39;s just because of bitcoin? You get it? Algo UP - it&amp;#39;s because algo is awesome? Algo down - because of bitcoin. They hate every other chain because only ALGORAND is the best. &lt;/li&gt;\n&lt;li&gt;Poor price action comparing to other scalable solutions. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Ok some of you may disagree with some points but most of them are straigth facts. Please research about the recent Hack and algoexplorer problems.&lt;/p&gt;\n\n&lt;p&gt;Edit: Thanks for all rewards!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 602,
  "permalink": "/r/CryptoCurrency/comments/rv0u98/algo_is_garbage_im_explaining_why/",
  "subreddit": "CryptoCurrency",
  "id": "rv0u98",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm totally aware that this will be probably the most downvoted post in the\nhistory of this sub. But I don't care.\n\nAlgo is the most shilled coin on reddit. I am the unlucky one and took the bait\nand bought Algo because of the shill. I did the research and on paper everything\nlooked great. Fast,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはおそらく、これまでで最も多くのダウンボーティングを受けた投稿になることは、完全に承知しています。\nこのサブの歴史の中で。しかし、私は気にしない。\n\nアルゴはredditで最もシリングされたコインです。私は不運なことに、その餌に食らいつきました。\nを買ってしまい、シロウトのせいでアルゴを買ってしまった。私は調査をして、書類上ではすべて\n素晴らしい。速い、...",
      "title": "アルゴはゴミ（その理由を説明しています）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我完全知道，这可能是本分册历史上被贬得最多的一个帖子。\n这篇文章的历史。但我不在乎。\n\nAlgo是reddit上最多的被攻击的币种。我是个不幸的人，上钩了\n买了Algo，因为这个骗子。我做了研究，纸面上的一切\n看起来很好。速度快，...",
      "title": "Algo是垃圾（我正在解释原因）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我完全知道，這可能是本分冊歷史上被貶得最多的一個帖子。\n這篇文章的歷史。但我不在乎。\n\nAlgo是reddit上最多的被攻擊的幣種。我是個不幸的人，上鉤了\n買了Algo，因爲這個騙子。我做了研究，紙面上的一切\n看起來很好。速度快，...",
      "title": "Algo是垃圾（我正在解釋原因）。"
    }
  ]
}