{
  "author": "Vitamina_e",
  "original_created_utc": 1628362549,
  "title": "How my side project is becoming a real product",
  "created_utc": 1628372308,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;ve recently launched a Social Network which was a side project that I&#39;ve been working on for the last 6 months, after a full-time job. The site is a Social Network for Koreans living overseas (<a href=\"https://www.korseas.com\">www.korseas.com</a>).</p>\n\n<p>Obviously, I wasn&#39;t expecting people to use the site or have any sort of impact on people&#39;s lives, but to my surprise, more than 200 users have already signed up and used the site! Because of that, my side project is really becoming... something?</p>\n\n<p>Hopefully, I can encourage people to aim higher on your side projects and to really not give up on them, as some day, they can become more than a pet project.</p>\n\n<p>Let me know if you have any questions or feedback! Thank you :)</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/ozz2w4/how_my_side_project_is_becoming_a_real_product/",
  "subreddit": "SideProject",
  "id": "ozz2w4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I've recently launched a Social Network which was a side project that I've\nbeen working on for the last 6 months, after a full-time job. The site is a\nSocial Network for Koreans living overseas (www.korseas.com\n[https://www.korseas.com]).\n\nObviously, I wasn't expecting people to use the site or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ソーシャルネットワークを立ち上げましたが、これは私のサイドプロジェクトで\nフルタイムの仕事の後、この半年間取り組んできたサイドプロジェクトでした。このサイトは\n海外在住の韓国人のためのソーシャルネットワーク (www.korseas.com)\n[https://www.korseas.com])です。\n\nもちろん、人々がこのサイトを利用することを期待していたわけではありませんし、...",
      "title": "私のサイドプロジェクトが実際の製品になるまで"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我最近推出了一个社会网络，这是我在过去6个月里一直在做的一个副业项目。\n在过去的6个月里，我一直在从事全职工作。该网站是一个\n生活在海外的韩国人的社交网络（www.korseas.com\n[https://www.korseas.com]）。)\n\n显然，我并不期望人们使用这个网站或...",
      "title": "我的副业如何成为一个真正的产品"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我最近推出了一個社會網絡，這是我在過去6個月裏一直在做的一個副業項目。\n在過去的6個月裏，我一直在從事全職工作。該網站是一個\n生活在海外的韓國人的社交網絡（www.korseas.com\n[https://www.korseas.com]）。)\n\n顯然，我並不期望人們使用這個網站或...",
      "title": "我的副業如何成爲一個真正的產品"
    }
  ]
}