{
  "author": "rayjaywolf",
  "original_created_utc": 1643618842,
  "title": "Wonderland Time - A Smart Scam disguised as a \"Failed Project\" (Timeline)",
  "created_utc": 1643654090,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;Daniel Sestagalli a known reputable person in the crypto space and his team created an OHM Fork and DAO called &amp;quot;Wonderland&amp;quot; on the Avalanche network.&lt;/li&gt;\n&lt;li&gt;Wonderland offered an insane 80000% APY on its launch (10x that of Olympus) for staking its token &amp;quot;TIME&amp;quot;.&lt;/li&gt;\n&lt;li&gt;The project gained mass popularity right from its launch due to its high APY and Daniel&amp;#39;s pre existing followers.&lt;/li&gt;\n&lt;li&gt;The price of TIME token peaked to an all time high of $10k from about $2000 within a month.&lt;/li&gt;\n&lt;li&gt;Wonderland gained its maximum investors between mid november and end november. TIME was trading on an average of $8000 at that time.&lt;/li&gt;\n&lt;li&gt;Nobody thought that Wonderland would rug since its founder was doxxed. Anybody who thought otherwise would instantly be labelled as a FUDster.&lt;/li&gt;\n&lt;li&gt;Any valid question or criticism of the project was suppressed and downvoted claiming to be FUD. The founders of the project promoted it.&lt;/li&gt;\n&lt;li&gt;Sifu, an anonymous person who claimed to be working in a major finance company in US was in charge of managing the $1 billion dollar treasury of Wonderland.&lt;/li&gt;\n&lt;li&gt;Daniel regularly used to act like a &amp;quot;people&amp;#39;s man&amp;quot; by tweeting stuff like, &amp;quot;fuck the suits&amp;quot;, &amp;quot;fuck the VC&amp;#39;s&amp;quot;, &amp;quot;fuck the whales&amp;quot;. Basically, man used to preach about decentralisation alot. His followers slowly turned into a cult who used to worship him no matter what decisions he made.&lt;/li&gt;\n&lt;li&gt;Despite being a DAO, majority of people who invested in Wonderland believed that decision making should be done by Daniel and Sifu only, giving them too much power right from the beginning.&lt;/li&gt;\n&lt;li&gt;The project with its ridiculous &amp;quot;lambo calculator&amp;quot; gave many false hopes to people. $1k worth of TIME would become worth millions in one year. Many people invested way more than what they were willing to lose. Someone put in his house down payment, someone put in his student loan in the hopes of becoming millionaire at the end of the year.&lt;/li&gt;\n&lt;li&gt;Everything was working fine until the entire crypto market crashed in January. TIME price started to plummet losing around 20% of its value every weak (sometimes everyday). The price started dipping from an average of $8000 to $6000, then $4000, then $2000. Nothing was stopping the price drop.&lt;/li&gt;\n&lt;li&gt;People had already lost more than 50% of their investment in less than a month. But the &amp;quot;price doesn&amp;#39;t matter, the APY will cover it up in a year&amp;quot; attitude of people kept them clinging to this project.&lt;/li&gt;\n&lt;li&gt;Any concerns or questions about TIME&amp;#39;S price tanking were dismissed by saying &amp;quot;Bitcoin is also down&amp;quot; and &amp;quot;it&amp;#39;s just whales selling to buy back at cheaper rate&amp;quot;.&lt;/li&gt;\n&lt;li&gt;While the price kept tanking weeks after weeks, the team kept on supplying hopium to the people. Sifu claimed that they will be investing the treasury money into several projects that will generate them revenue in the long run.&lt;/li&gt;\n&lt;li&gt;The very first investment was supposed to be a sports betting platform called Betswap.&lt;/li&gt;\n&lt;li&gt;Sifu promised that holders of TIME who did not sell even after the crash would receive an airdrop of BSGG (betting platform&amp;#39;s official token) coins as a gift for having faith in the project.&lt;/li&gt;\n&lt;li&gt;Needless to say, the airdrop never happened. It was supposed to happen &amp;quot;next week&amp;quot; but which &amp;quot;next week&amp;quot; was never clarified. Questions about the airdrop were dodged by saying &amp;quot;technical issue&amp;quot;, &amp;quot;coding error&amp;quot; by Sifu.&lt;/li&gt;\n&lt;li&gt;Several other projects were also announced as part of our investment which never saw the light of day.&lt;/li&gt;\n&lt;li&gt;The team had promised that if the price of TIME fell below the backing price, they would do huge buybacks from treasury so that the price doesn&amp;#39;t drop any further. (For example, if the price of TIME was $3000 and its backing price was $2000, and suddenly the price of TIME crashed to $1500, the team would initiate buybacks, i.e buying TIME until the price reached the backing price of $2000)&lt;/li&gt;\n&lt;li&gt;The backing price of TIME was once $2300. As expected, the price fell below $2000 but no buybacks were done. After some time the backing price fell to just $1000 per TIME.&lt;/li&gt;\n&lt;li&gt;Again the price of TIME fell below $1000, but this time Sifu did the buyback and bragged about it how they are not like other DAOs and they actually do buy backs.&lt;/li&gt;\n&lt;li&gt;The price of TIME stayed above $1000 for like 2 days after it fell again.&lt;/li&gt;\n&lt;li&gt;This is when things start getting spicier. One fine day, the price of TIME tanks 50% from $1000 to about $500, yes in a single day.&lt;/li&gt;\n&lt;li&gt;There was panic all around the community having the same question, &amp;quot;what the fuck happened&amp;quot;.&lt;/li&gt;\n&lt;li&gt;Basically there was a mass selling in a certain hour by whales.&lt;/li&gt;\n&lt;li&gt;Daniel and Sifu, the founders of project did not do the buybacks because they were &amp;quot;sleeping&amp;quot;. Alot of people who had kept TIME as a collateral to borrow stable coins from &lt;a href=\"http://abracadabra.money/\"&gt;abracadabra.money&lt;/a&gt; (another Daniel&amp;#39;s project) got liquidated. The people who used TIME to borrow crypto believed that the price would never tank so hard because the team would do buybacks.&lt;/li&gt;\n&lt;li&gt;But since Daniel was sleeping and he forgot to do the buyback (lol), so many people got liquidated, including Daniel and Sifu themselves.&lt;/li&gt;\n&lt;li&gt;Daniel tried to act all innocent tweeting he did not know any of this and he was just sleeping. And since he lost money too, noone doubted him.&lt;/li&gt;\n&lt;li&gt;Just one day after this shitshow another news breaks out that Sifu, the treasury manager is the founder of a collapsed CEX called &lt;a href=\"https://www.coindesk.com/markets/2022/01/27/wonderland-rattled-after-cofounder-tied-to-alleged-quadrigacx-190m-exit-scam/\"&gt;Quadriga&lt;/a&gt; and a known fraudster who has been scamming people for about 2 decades.&lt;/li&gt;\n&lt;li&gt;The price of TIME falls to an all time low of $300 after this news.&lt;/li&gt;\n&lt;li&gt;Daniel claimed that he knew about Sifu&amp;#39;s identify from 1 month ago but he did not take any action because he believes in giving second chances.&lt;/li&gt;\n&lt;li&gt;Following the outrage by the community, Sifu was removed from Wonderland as the treasury manager through vote.&lt;/li&gt;\n&lt;li&gt;After this, Daniel makes another proposal the next day. He gives the people two choices. Abandon the project, do one more buyback and take the TIME price above backing by draining the treasury or to keep the project alive and assemble a new team within 5 days.&lt;/li&gt;\n&lt;li&gt;The first option was nothing but a tight slap to long time holders face. People who had invested in this project from the beginning had lost more than 90% of their wealth. Draining the treasury would only give them about 10-15% of their investments back.&lt;/li&gt;\n&lt;li&gt;Meanwhile the whales saw the opportunity to make some quick cash through this. They bought a shit ton amount of TIME for $300 each, while the backing price was almost $600. That would mean that after the buyback (if option 1 wins) the whales would double their money in 2 days while long term holders will only get 10% of their money back.&lt;/li&gt;\n&lt;li&gt;The votes started kicking in and as expected top 20 whales made 70% of the votes in favor of option 1 while thousands of other voters with less TIME and voting power made only 30% in favor of option 2.&lt;/li&gt;\n&lt;li&gt;Basically except the whales who joined in just 1 day ago, noone else was benefiting from draining the treasury and everybody else wanted the project to continue.&lt;/li&gt;\n&lt;li&gt;But but but, even though a bunch of whales had a lot of voting power, they lost the lead because an overwhelming majority voted for option 2 and won.&lt;/li&gt;\n&lt;li&gt;Daniel who wanted to drain the treasury after seeing the result dismisses the vote not respecting the proposal. And says some bullshit like &lt;a href=\"https://twitter.com/danielesesta/status/1487826195978899457?s=20&amp;amp;t=LT0_MYYQKSUpnv7pNmJZFQ\"&gt;this&lt;/a&gt;.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;So, what actually happened here?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In short:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;This was all part of a huge scam carried out by Daniel and Sifu.&lt;/li&gt;\n&lt;li&gt;Daniel knew all along about Sifu&amp;#39;s identity.&lt;/li&gt;\n&lt;li&gt;Daniel got liquidated not because he was sleeping but he wanted to get liquidated. He had borrowed stablecoins by keeping TIME as collateral. He knew that TIME would be worth pennies in the next few days so he did not mind losing it all.&lt;/li&gt;\n&lt;li&gt;If he had directly swapped TIME for any stablecoin people would have doubted him so instead he gets liquidated and tries to act all innocent.&lt;/li&gt;\n&lt;li&gt;Next day Sifu&amp;#39;s identity is revealed, it was not found out by any detective, it was pre planned from the beginning. (also there&amp;#39;s no proof that Sifu is Omar, it might just be another one of their tactics)&lt;/li&gt;\n&lt;li&gt;After the price tanks to $300, Daniel, Sifu and everybody on his team create several new wallets, buy millions worth of TIME at such a cheap rate and then Daniel announces that there would be a vote to distribute the treasury to TIME holders with proportion to their holdings.&lt;/li&gt;\n&lt;li&gt;Daniel knew that the he and his team would win the proposal because they had a lot of voting power with their alt wallets.&lt;/li&gt;\n&lt;li&gt;Things don&amp;#39;t turn out his way and he loses the proposal so today he comes with another proposal that the ones who want out of this project can go with their money.&lt;/li&gt;\n&lt;li&gt;Inevitably Daniel and his team are gonna win this proposal or any other proposal coming after this and they will cash out their millions of dollars while everybody else would be getting screwed.&lt;/li&gt;\n&lt;li&gt;At the end no one would be after Daniel, because he was &amp;quot;innocent&amp;quot; and the project failed due to bad luck. After a few months he will start another scam project and use similar tactics to loot people&amp;#39;s money all while maintaining his goodwill.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;GG Daniel &amp;amp; Sifu, you played everyone&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;(sorry for bad english)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; For people saying that the insane APY was a red flag itself, it was but people were under the impression that it would not be a rugged since the founder was doxxed. What people feared was the price and APY of TIME dropping (just like Olympus). If the calculator showed them 500x return in one year, people would take the worst case scenario like &amp;quot;even if I don&amp;#39;t get 500x, I will atleast get 5x&amp;quot; which is still good.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/sgwmnd/wonderland_time_a_smart_scam_disguised_as_a/",
  "subreddit": "CryptoCurrency",
  "id": "sgwmnd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": " * Daniel Sestagalli a known reputable person in the crypto space and his team\n   created an OHM Fork and DAO called \"Wonderland\" on the Avalanche network.\n * Wonderland offered an insane 80000% APY on its launch (10x that of Olympus)\n   for staking its token \"TIME\".\n * The project gained mass…"
}