{
  "author": "madpanda94",
  "original_created_utc": 1628603130,
  "title": "You don't get more moons for downvoting posts. Don't be afraid to show your support to a well-researched post <3",
  "created_utc": 1628620918,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>*DISCLAIMER* this is not an accuse to anyone ofc.</p>\n\n<p>During these days I often go to &quot;new posts&quot; section because the most upvoted posts during are just about the infrastucture Bill. I see many well-researched posts getting less than 10 upvotes and 50-60 comments and this make me a bit upset because this lack of support discourage many kind redditors. Karma farming is a thing, we can&#39;t deny it, but showing love to who writes informative posts about crypto and put some effort in it may improve this community, already amazing :)</p>\n\n<p>We&#39;re all here to learn and teach and if we can do it by earning something, why not?</p>\n\n<p>Love you guys &lt;3</p>\n\n<p>EDIT: Thanks a lot for the awards, I really appreciate it :)</p>\n</div><!-- SC_ON -->",
  "score": 284,
  "permalink": "/r/CryptoCurrency/comments/p1ph91/you_dont_get_more_moons_for_downvoting_posts_dont/",
  "subreddit": "CryptoCurrency",
  "id": "p1ph91",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "*DISCLAIMER* this is not an accuse to anyone ofc.\n\nDuring these days I often go to \"new posts\" section because the most upvoted\nposts during are just about the infrastucture Bill. I see many well-researched\nposts getting less than 10 upvotes and 50-60 comments and this make me a bit\nupset because…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "*免責事項*これは誰かを非難するものではありません。\n\nこの数日間、私はよく「新しい投稿」セクションに行きます。\nインフラ法案についての投稿が多いからです。よく研究された記事でも\nよく研究された投稿でも、アップバイトは10以下、コメントは50～60程度のものが多く、これにはちょっと腹が立ちます。\n憤慨しています...",
      "title": "投稿をダウンさせたからといって、ムーンが増えるわけではありません。よく調べられた投稿には、遠慮なく応援の気持ちを伝えましょう <3"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "*这不是对任何人的指责。\n\n在这些天里，我经常去 \"新帖 \"部分，因为最多投票的是 \"新帖\"。\n的帖子都是关于基础设施法案的。我看到许多经过深入研究的\n我看到许多研究得很好的帖子得到不到10个支持和50-60个评论，这让我有点儿\n不高兴，因为...",
      "title": "你不会因为降权的帖子而得到更多的月亮。不要害怕对一个经过充分研究的帖子表示支持 <3"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "*這不是對任何人的指責。\n\n在這些天裏，我經常去 \"新帖 \"部分，因爲最多投票的是 \"新帖\"。\n的帖子都是關於基礎設施法案的。我看到許多經過深入研究的\n我看到許多研究得很好的帖子得到不到10個支持和50-60個評論，這讓我有點兒\n不高興，因爲...",
      "title": "你不會因爲降權的帖子而得到更多的月亮。不要害怕對一個經過充分研究的帖子表示支持 <3"
    }
  ]
}