{
  "author": "Inverted_Poopie",
  "original_created_utc": 1631631939,
  "title": "Politicians Want You to Stay Poor & Obedient",
  "created_utc": 1631641143,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This infrastructure bill is proposing a 25% capital gains tax. Capital gains are the only way out of poverty/wage slavery for most of us common folks. </p>\n\n<p>Sure people like AOC want your basic needs met, but the second you get a leg up, these leeches are gonna want their cut. This notion that anyone who takes a risk and then has success, is inherently taking food off the table of a poor immigrant family or what have you, is total BS. They need you broke, so that they have mindless drones working soul crushing jobs, so they can then take more tax dollars from you. </p>\n\n<p>Modern day governments are evil. They want your money, they want to control your life in every conceivable way. They think they know what’s best for you and society as a whole; they’re just incompetent morons who know nothing. They spend their entire lives in government, creating legislation that takes your financial freedom, one cut at a time. Being happy to pay more in taxes doesn’t make you virtuous. It makes you a sucker and victim of propaganda.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/po4l2u/politicians_want_you_to_stay_poor_obedient/",
  "subreddit": "CryptoCurrency",
  "id": "po4l2u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This infrastructure bill is proposing a 25% capital gains tax. Capital gains are\nthe only way out of poverty/wage slavery for most of us common folks.\n\nSure people like AOC want your basic needs met, but the second you get a leg up,\nthese leeches are gonna want their cut. This notion that anyone who…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回のインフラ法案では、25％のキャピタルゲイン税を提案しています。キャピタルゲインは\n私たち庶民にとって貧困や賃金奴隷から抜け出す唯一の方法です。\n\nAOCのような人々は基本的なニーズを満たしたいと思っていますが、あなたが優位に立った途端、これらのヒルは自分たちの取り分を欲しがるでしょう。\nこの蛭子さんたちは、自分たちの分け前を欲しがるでしょう。この概念は、誰もが...",
      "title": "政治家は、あなたが貧しくて従順であることを望んでいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这项基础设施法案提议征收25%的资本利得税。资本收益是\n是我们大多数普通人摆脱贫困/工资奴役的唯一途径。\n\n当然，像AOC这样的人希望你的基本需求得到满足，但你一有机会，这些水蛭就会想要分一杯羹。\n这些水蛭就会想要他们的那份。这种观念认为，任何...",
      "title": "政治家希望你保持贫穷和顺从"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這項基礎設施法案提議徵收25%的資本利得稅。資本收益是\n是我們大多數普通人擺脫貧困/工資奴役的唯一途徑。\n\n當然，像AOC這樣的人希望你的基本需求得到滿足，但你一有機會，這些水蛭就會想要分一杯羹。\n這些水蛭就會想要他們的那份。這種觀念認爲，任何...",
      "title": "政治家希望你保持貧窮和順從"
    }
  ]
}