{
  "author": "sandman2591",
  "original_created_utc": 1628175141,
  "title": "Do you guys think this is getting a little dangerous. Hear me out",
  "created_utc": 1628191834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So moons hit a new ath of 38c which is absolutely incredible!! Even tho it’s down 14% today that milestone alone should be celebrated. Why I think this is starting to get dangerous is because of everyone displaying the amount of moons they have. Some people on here are displaying that they have 100s of thousands of moons. I saw someone today with 500k moons at the peak that was $190,000. </p>\n\n<p>All I’m saying is people can now become targets and that’s scary. We don’t walk around displaying what’s in our bank accounts or what we have in our wallets I feel like it should be the same for moons since it’s becoming high in value. What does everyone think? I’m just trying to look after the well being of everyone. Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/CryptoCurrency/comments/oyjzey/do_you_guys_think_this_is_getting_a_little/",
  "subreddit": "CryptoCurrency",
  "id": "oyjzey",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So moons hit a new ath of 38c which is absolutely incredible!! Even tho it’s\ndown 14% today that milestone alone should be celebrated. Why I think this is\nstarting to get dangerous is because of everyone displaying the amount of moons\nthey have. Some people on here are displaying that they have 100s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "月は38℃の新記録を達成しました。これは本当にすごいことです。今日は14％下がったけど\n今日は14％下がっていますが、この節目だけでも祝福すべきです。なぜ私がこのように思うかというと\n危険な状態になってきたと思うのは、みんなが自分の持っている月の量を表示しているからです。\n月の数を表示しているからです。何人かの人は100個も持っていると表示していますが...。",
      "title": "皆さん、これはちょっと危険な状態だと思いませんか？聞く"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，月亮创下了38℃的新高度，这绝对是不可思议的！！。尽管它今天已经\n今天下跌了14%，单是这个里程碑就应该庆祝一下。为什么我认为这\n因为每个人都在展示他们拥有的月球数量。\n他们有多少月亮。有些人在这里显示他们有100多个...",
      "title": "你们是否认为这变得有点危险了。听我说"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，月亮創下了38℃的新高度，這絕對是不可思議的！！。儘管它今天已經\n今天下跌了14%，單是這個里程碑就應該慶祝一下。爲什麼我認爲這\n因爲每個人都在展示他們擁有的月球數量。\n他們有多少月亮。有些人在這裏顯示他們有100多個...",
      "title": "你們是否認爲這變得有點危險了。聽我說"
    }
  ]
}