{
  "author": "TarkovReddit0r",
  "original_created_utc": 1654260683,
  "title": "If your plan is to HODL please make sure you are aware what that means",
  "created_utc": 1654311148,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;TL;DR: it’s very important to stick to your plan and be fully aware what it means.&lt;/p&gt;\n\n&lt;p&gt;The most important part is to always have a plan. A lot of people follow the HODL strat and “I’m never gonna sell it’ll go back up again” mentality. It makes sense, it’s a good strategy but please be aware of what can happen.\nLet me give you an example.&lt;/p&gt;\n\n&lt;h1&gt;The 2017 Incident&lt;/h1&gt;\n\n&lt;p&gt;Imagine you bought around the ATH in 2017. 10-16.000$ back then. After 2017 a bear market hit. And it was a brutal one for the mentality of a lot of investors. -80% investment &lt;em&gt;on BITCOIN&lt;/em&gt; not just alts. And this wasn’t happening in a couple months it happened over years.&lt;/p&gt;\n\n&lt;p&gt;Fast foreword it’s 2019 and BTC is currently at 9k again. You hope for a new ATH to cut your losses or at least break even and what happens? It goes back down again. It’s 2020 and BTC is still at 9000$. &lt;strong&gt;It’s been nearly 3 years now&lt;/strong&gt; since you bought BTC and your portfolio was always in a loss. And now Covid happens. BTC falls towards 5000$. All that with the years of mentality “Will it ever hit 10-16k again?”&lt;/p&gt;\n\n&lt;p&gt;If you managed to even hold through that time after 4 years you finally get rewarded. The next big bullrun hits and it was the biggest that ever happen. In a matter of weeks BTC doubles. After that it doubles every couple weeks. New all time highs every week reaching up to 60k+&lt;/p&gt;\n\n&lt;p&gt;If you managed to HODL through those years congratulations you just 6-8x your initial investment. I’ve been through this time and I can promise you the majority of people with that HODL mentality gave up and sold eventually. It’s rough and not as easy as a lot of people think.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "permalink": "/r/CryptoCurrency/comments/v3ypxp/if_your_plan_is_to_hodl_please_make_sure_you_are/",
  "subreddit": "CryptoCurrency",
  "id": "v3ypxp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TL;DR: it’s very important to stick to your plan and be fully aware what it\nmeans.\n\nThe most important part is to always have a plan. A lot of people follow the\nHODL strat and “I’m never gonna sell it’ll go back up again” mentality. It makes\nsense, it’s a good strategy but please be aware of what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR: 計画を守り、その意味を十分に認識することが非常に重要です。\nということです。\n\n最も重要なのは、常に計画を持っていることです。多くの人が、「HODL戦略」や「絶対に売らない\n多くの人がHODLストラットや「また上がるだろうから絶対に売らない」という考え方に従っています。それは理にかなっている。\nそれは理にかなっており、それは良い戦略ですが、何を意識してください...",
      "title": "HODLを計画している場合は、その意味を確認してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：坚持你的计划并充分意识到它的意义是非常重要的。\n意义。\n\n最重要的部分是要始终有一个计划。很多人都遵循\nHODL策略和 \"我永远不会卖掉它，它会再涨回来 \"的心态。这是有道理的。\n它是有道理的，是一个很好的策略，但请注意什么是......",
      "title": "如果你的计划是HODL，请确保你知道这意味着什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：堅持你的計劃並充分意識到它的意義是非常重要的。\n意義。\n\n最重要的部分是要始終有一個計劃。很多人都遵循\nHODL策略和 \"我永遠不會賣掉它，它會再漲回來 \"的心態。這是有道理的。\n它是有道理的，是一個很好的策略，但請注意什麼是......",
      "title": "如果你的計劃是HODL，請確保你知道這意味着什麼。"
    }
  ]
}