{
  "author": "knowsalotofthings",
  "the_new_excerpt": "Hi guys,\n\nI'm from a third world country called India. The right-wing fascist government\nhere is planning to ban all cryptocurrencies. (They are so tone-deaf they called\nBitcoin a \"private cryptocurrency\"\n[https://www.newsweek.com/india-drafts-bill-create-government-cryptocurrency-ban-private…",
  "original_created_utc": 1612558800,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我来自一个叫印度的第三世界国家。右翼法西斯政府\n这里正计划禁止所有的加密货币。(他们是如此的语无伦次，他们称其为：)\n比特币是一种 \"私人加密货币\"\n[https://www.newsweek.com/india-drafts-bill-create-government-cryptocurrency-ban-private...",
      "title": "因为一个专制政府而卖掉我所有的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我來自一個叫印度的第三世界國家。右翼法西斯政府\n這裏正計劃禁止所有的加密貨幣。(他們是如此的語無倫次，他們稱其爲：)\n比特幣是一種 \"私人加密貨幣\"\n[https://www.newsweek.com/india-drafts-bill-create-government-cryptocurrency-ban-private...",
      "title": "因爲一個專制政府而賣掉我所有的加密貨幣"
    }
  ],
  "title": "Selling all my crypto because of an authoritarian government",
  "created_utc": 1612564923,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys,</p>\n\n<p>I&#39;m from a third world country called India. The right-wing fascist government here is planning to ban all cryptocurrencies. (They are so tone-deaf they called Bitcoin a <a href=\"https://www.newsweek.com/india-drafts-bill-create-government-cryptocurrency-ban-private-cryptocurrencies-exceptions-1566558\">&quot;private cryptocurrency&quot;</a>). </p>\n\n<p>Of course, you can never ban Bitcoin due to its decentralized nature and you might be thinking why I am selling my crypto when I could just as easily use a VPN. Well, the answer is that you don&#39;t live under this government. In 2019, the country was undergoing civil unrest with riots in the capital in the <a href=\"https://en.wikipedia.org/wiki/Citizenship_Amendment_Act_protests\">CAA protest</a> against a bill that discriminated based on religion. They silence journalists, kill protestors, and control not only just the media but also the judiciary. It&#39;s. fucked. up.</p>\n\n<p>Currently, many <a href=\"https://en.wikipedia.org/wiki/2020%E2%80%932021_Indian_farmers\">farmers of the country are protesting against the new farm laws</a> which have been deemed anti-farmers and pro-corporate. The government was apathetic to the protest initially and then they were cruel, and brutal. </p>\n\n<p><a href=\"https://indianexpress.com/article/india/rihanna-farmers-protest-mea-7173657/\">When Greta Thunberg and Rihana tweeted about the issue</a>, the government lost its mind and used the Ministry of External Affairs to issue a statement... against a pop star and a teenager. The protestors are also dealt with harshly and Delhi has been turned into a fortress keeping them out; more than a hundred farmers have died but the government remains apathetic.</p>\n\n<p>Meanwhile, the Reserve Bank of India prohibited all banks in India from accepting cryptocurrency transactions in 2018. However, the industry went to the Supreme Court and the order was deemed unconstitutional in March last year. The crypto industry rose in India again and just as more people were buying in, the government comes out with a bill that fines a person 3x to 10x their gains on crypto or a jail term up to 10 years, or both. </p>\n\n<p>The worst part is that the bill states that it&#39;s up to the government to decide how people should dispose of their crypto after its banned. And you know what, it&#39;s not beyond this government to take all the crypto for themselves and claim they &quot;destroyed it&quot;. <a href=\"https://en.wikipedia.org/wiki/List_of_scandals_in_India\">All governments have a history with corruption in India</a>. My exchange is linked to my bank accounts and my central government tax ID, and they can easily track me. </p>\n\n<p>That&#39;s why I&#39;m selling everything I have, for now, just to wait it out and see what happens with the bill here. I really don&#39;t want to sell but I think it&#39;s better if I cash out instead of letting the government decide what I should do with my coins or face jail time.</p>\n\n<p>I know India is probably not in your circle of concern right now but Bitcoin was about decentralization, about resisting government censorship and it seems the fanatical government is hellbent on making sure nobody can hold crypto by threatening harsh punishments and penalties. However, this is also good for crypto because the government is scared of it due to its growing power, just like its scared of Rihana and Greta Thunberg. </p>\n\n<p>I hope the bill never passes but most likely it will and bring an end to the crypto industry here again.</p>\n\n<p>EDIT - <a href=\"/u/makeingcent5\">/u/makeingcent5</a> gave this post a Platinum Award which comes with 700 coins. I have never received reddit coins before and never had the chance to award comments or posts so I&#39;ll distribute it to as many top comments here as I can. Cryptocurrency might be about decentralizion but it also brings the world a bit closer in a way. Thank you. <a href=\"/u/Pos1tivity\">/u/Pos1tivity</a> gilded this post and 100 more coins have been redistributed to top comments</p>\n</div><!-- SC_ON -->",
  "score": 14050,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Xa-xihb3xehhMQjveQwBX4ehHlUnPZ9sFw4B6T53uB4.jpg?auto=webp&s=afc3fb4d9d67e72c9cb3024fb7c67e079a741893",
          "width": 2500,
          "height": 1728
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Xa-xihb3xehhMQjveQwBX4ehHlUnPZ9sFw4B6T53uB4.jpg?width=108&crop=smart&auto=webp&s=cec580aac52d811fb222b245d56ad3a5632fec24",
            "width": 108,
            "height": 74
          },
          {
            "url": "https://external-preview.redd.it/Xa-xihb3xehhMQjveQwBX4ehHlUnPZ9sFw4B6T53uB4.jpg?width=216&crop=smart&auto=webp&s=abb2b7b49aa538a7a526571bc30de29998fbe524",
            "width": 216,
            "height": 149
          },
          {
            "url": "https://external-preview.redd.it/Xa-xihb3xehhMQjveQwBX4ehHlUnPZ9sFw4B6T53uB4.jpg?width=320&crop=smart&auto=webp&s=0e66df36da41536f575d782a5a216cc58246411a",
            "width": 320,
            "height": 221
          },
          {
            "url": "https://external-preview.redd.it/Xa-xihb3xehhMQjveQwBX4ehHlUnPZ9sFw4B6T53uB4.jpg?width=640&crop=smart&auto=webp&s=04da68615f3ff6ce77271a48ceadb9df71814100",
            "width": 640,
            "height": 442
          },
          {
            "url": "https://external-preview.redd.it/Xa-xihb3xehhMQjveQwBX4ehHlUnPZ9sFw4B6T53uB4.jpg?width=960&crop=smart&auto=webp&s=0cd6280571fffee9d5dbee4f9c3f999924ad4c8b",
            "width": 960,
            "height": 663
          },
          {
            "url": "https://external-preview.redd.it/Xa-xihb3xehhMQjveQwBX4ehHlUnPZ9sFw4B6T53uB4.jpg?width=1080&crop=smart&auto=webp&s=9c309ee275084519f50dedca544d5e2115c17f27",
            "width": 1080,
            "height": 746
          }
        ],
        "variants": {},
        "id": "_DMafPSIaPJlwRbdcXRwE3zNKNyUbNVWPpf0mbJBzTk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ldh53f/selling_all_my_crypto_because_of_an_authoritarian/",
  "subreddit": "CryptoCurrency",
  "id": "ldh53f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123194325
}