{
  "author": "kaidonkaisen",
  "original_created_utc": 1626454516,
  "title": "What if Nintendo sold Pokemon as NFT?",
  "created_utc": 1626467497,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just imagine. Each Pokemon is one unique NFT. No further copies. And you buy the ownership to own this Pokemon. What do you think would happen when they would do that? How much worth would it be to be the owner of Pikachu? How much are people willing to invest to own the original 150?</p>\n\n<p>Nintendo should be able to collect a lot of money for the first auctions. And then they could link their new games to the blockchain. If you can authenticate as a real owner, you get exclusive in-game goodies. A Money printing machine that is. </p>\n\n<p>What do you guys think? Do you think people would try to buy and collect unique Pokemon as NFT? Let’s place bets on a hypothetical price.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/olkx67/what_if_nintendo_sold_pokemon_as_nft/",
  "subreddit": "CryptoCurrency",
  "id": "olkx67",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just imagine. Each Pokemon is one unique NFT. No further copies. And you buy the\nownership to own this Pokemon. What do you think would happen when they would do\nthat? How much worth would it be to be the owner of Pikachu? How much are people\nwilling to invest to own the original 150?\n\nNintendo…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "想像してみてください。それぞれのポケモンは1つのユニークなNFTです。それ以上のコピーはありません。そして、あなたはこのポケモンを\nこのポケモンを所有する権利を購入します。そんなことをしたら、どうなると思いますか？\nどうなると思いますか？ピカチュウのオーナーになることにどれだけの価値があるだろうか？人々は、オリジナルの150匹を所有するために\nオリジナルの150匹を所有するためにどれだけの投資をしてくれるのか？\n\n任天堂...",
      "title": "もし任天堂がポケモンをNFTとして販売したら？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "试想一下。每个小精灵都是一个独特的NFT。没有进一步的副本。而你购买了\n拥有这个小精灵的所有权。你认为当他们这样做的时候会发生什么？\n会发生什么？成为皮卡丘的主人会有多大价值？人们有多少钱\n愿意投资来拥有原始的150个？\n\n任天堂...",
      "title": "如果任天堂将口袋妖怪作为NFT出售呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "試想一下。每個小精靈都是一個獨特的NFT。沒有進一步的副本。而你購買了\n擁有這個小精靈的所有權。你認爲當他們這樣做的時候會發生什麼？\n會發生什麼？成爲皮卡丘的主人會有多大價值？人們有多少錢\n願意投資來擁有原始的150個？\n\n任天堂...",
      "title": "如果任天堂將口袋妖怪作爲NFT出售呢？"
    }
  ]
}