{
  "author": "myhaxdontwork",
  "the_new_excerpt": "And that’s a wrap ladies and gentlemen. On June 9, 2021, at approximately\n12:08am EST, El Salvador has become the First Nation to pass a bill that makes\nBitcoin a legal currency. Who would have thought this would happen so quickly!\nIt will take ~90 days for this law to be enacted; presumably to…",
  "original_created_utc": 1623211923,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、お疲れ様でした。2021年6月9日、米国東部標準時の約\nエルサルバドルはビットコインを法定通貨とする法案を可決した最初の国となりました。\nビットコインを合法的な通貨とする法案を可決しました。こんなに早く実現するとは誰が考えたでしょうか！？\nこの法律が制定されるまでには、おそらく90日ほどかかるでしょう。",
      "title": "エルサルバドルは、ビットコインを合法的な通貨とする法律を正式に可決しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "女士们，先生们，就这样结束了。2021年6月9日，大约在美国东部时间上午12:08，萨尔瓦多成为第一个通过法案的国家。\n美东时间上午12:08，萨尔瓦多成为第一个通过法案的国家，使\n比特币成为合法货币。谁会想到这一切会发生得这么快！？\n这项法律将需要~90天的时间来颁布；估计是为了...",
      "title": "萨尔瓦多已正式通过一项法律，使比特币成为合法货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "女士們，先生們，就這樣結束了。2021年6月9日，大約在美國東部時間上午12:08，薩爾瓦多成爲第一個通過法案的國家。\n美東時間上午12:08，薩爾瓦多成爲第一個通過法案的國家，使\n比特幣成爲合法貨幣。誰會想到這一切會發生得這麼快！？\n這項法律將需要~90天的時間來頒佈；估計是爲了...",
      "title": "薩爾瓦多已正式通過一項法律，使比特幣成爲合法貨幣。"
    }
  ],
  "title": "El Salvador has officially passed a law that makes Bitcoin a legal currency.",
  "created_utc": 1623224031,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And that’s a wrap ladies and gentlemen. On June 9, 2021, at approximately 12:08am EST, El Salvador has become the First Nation to pass a bill that makes Bitcoin a legal currency. Who would have thought this would happen so quickly!  It will take ~90 days for this law to be enacted; presumably to allow merchants and others to prepare for the acceptance and transmission of bitcoin. </p>\n\n<p>It’s also important to remember that the people of El Salvador have been using bitcoin and it’s lightning network for some time now. This has helped with the quick majority approval of the bill. </p>\n\n<p>For those reading this live, you can watch their congress continue to push this through as law here: <a href=\"https://www.facebook.com/asamblea.legislativa/videos/305036231334752/\">https://www.facebook.com/asamblea.legislativa/videos/305036231334752/</a></p>\n\n<p>Here is the English translation of the law: <a href=\"https://freopp.org/el-salvadors-bitcoin-law-full-proposed-english-text-9a2153ad1d19\">https://freopp.org/el-salvadors-bitcoin-law-full-proposed-english-text-9a2153ad1d19</a></p>\n\n<p>The questions now:\nHow will the US handle policy based on this change?\nHow many nations will pass similar laws this year?\nHow many bitcoin will these sovereign nations purchase? \nWill you be selling your bitcoin to them? ;)</p>\n</div><!-- SC_ON -->",
  "score": 3882,
  "permalink": "/r/CryptoCurrency/comments/nvmwsk/el_salvador_has_officially_passed_a_law_that/",
  "subreddit": "CryptoCurrency",
  "id": "nvmwsk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884256
}