{
  "author": "Psalm20_7-9",
  "the_new_excerpt": "Let's assume the fed is right and we don't raise interest rates until ~2023,\nit's my understanding that raising rates is going to send growth/tech stocks\ndown because money isn't as cheap as it used to be. Under that assumption,\nshouldn't that mean it would be smarter to sit these next few years out…",
  "original_created_utc": 1620134656,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "FRBが正しく、2023年頃まで利上げを行わないと仮定します。\n私の理解では、利上げは成長株やハイテク株を下落させるでしょう。\n私の理解では、金利を上げると、お金が以前ほど安くないので、成長株やハイテク株が下がると思います。その仮定の下では\nこの仮定の下では、今後数年間を見守る方が賢明だということになりませんか...。",
      "title": "なぜ今、わざわざ成長・技術に投資する必要があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们假设美联储是正确的，我们在2023年之前不会加息。\n我的理解是，加息将使增长型/科技型股票下跌\n因为钱不再像以前那么便宜了。根据这一假设。\n这不应该意味着在未来的几年里，坐视不理会更明智吗？",
      "title": "在这个时候，我们为什么还要费心投资于增长/技术？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們假設美聯儲是正確的，我們在2023年之前不會加息。\n我的理解是，加息將使增長型/科技型股票下跌\n因爲錢不再像以前那麼便宜了。根據這一假設。\n這不應該意味着在未來的幾年裏，坐視不理會更明智嗎？",
      "title": "在這個時候，我們爲什麼還要費心投資於增長/技術？"
    }
  ],
  "title": "Why should we even bother investing in growth/tech at this moment in time?",
  "created_utc": 1620148784,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s assume the fed is right and we don&#39;t raise interest rates until ~2023, it&#39;s my understanding that raising rates is going to send growth/tech stocks down because money isn&#39;t as cheap as it used to be. Under that assumption, shouldn&#39;t that mean it would be smarter to sit these next few years out until they end up raising rates and then open long positions? I recently purchased 10 LEAPs on various growth/tech companies and plan to exercise them in the future. Would it have been smarter to just wait for the rate hikes later on or how much of that is already being priced in the market today? I plan to be these positions 5-10+ years so I&#39;m just curious.</p>\n</div><!-- SC_ON -->",
  "score": 100,
  "permalink": "/r/stocks/comments/n4o8yb/why_should_we_even_bother_investing_in_growthtech/",
  "subreddit": "stocks",
  "id": "n4o8yb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968354
}