{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Thursday, May 27, 2021\n\nStocks traded mixed today, with the S&P 500 (SPY) and Dow Jones (DIA) rising\nwhile the tech-heavy Nasdaq (QQQ) fell modestly as market participants looked\ntoward the new weekly jobless report. Market participants continue to closely\nmonitor incoming…",
  "original_created_utc": 1622147195,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月27日（木\n\n今日の株式市場はまちまちで、S&P500(SPY)とダウ・ジョーンズ(DIA)は上昇し、ハイテク株の多いナスダック(QQQ)は小幅に下落しました。\n一方、ハイテク株の多いナスダック(QQQ)は小幅に下落しました。\n市場参加者は週次の雇用統計に注目しています。市場参加者は、引き続き注意深く\nを注視しています。",
      "title": "本日2021年5月27日（木）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月27日星期四\n\n今天股市涨跌互现，标准普尔500指数（SPY）和道琼斯指数（DIA）上升\n而科技股的纳斯达克指数(QQQ)则小幅下跌，因为市场参与者期待着\n新的每周失业报告。市场参与者继续密切关注\n密切关注即将到来的...",
      "title": "以下是今天的市场回顾，2021年5月27日，星期四"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月27日星期四\n\n今天股市漲跌互現，標準普爾500指數（SPY）和道瓊斯指數（DIA）上升\n而科技股的納斯達克指數(QQQ)則小幅下跌，因爲市場參與者期待着\n新的每週失業報告。市場參與者繼續密切關注\n密切關注即將到來的...",
      "title": "以下是今天的市場回顧，2021年5月27日，星期四"
    }
  ],
  "title": "Here is a Market Recap for today Thursday, May 27, 2021",
  "created_utc": 1622186943,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Thursday, May 27, 2021</strong></p>\n\n<p>Stocks traded mixed today, with the S&amp;P 500 (SPY) and Dow Jones (DIA) rising while the tech-heavy Nasdaq (QQQ) fell modestly as market participants looked toward the new weekly jobless report. Market participants continue to closely monitor incoming inflation data, though it seems fears that the Federal Reserve will be forced to tighten monetary policy have tempered in recent weeks, with the SPY roughly 3 points away from its record level. </p>\n\n<p>This week, the indexes have largely consolidated, an encouraging sign following the volatility experienced in the first weeks of May. Market participants continue to look towards incoming economic data to further judge whether inflation will lead to a sustained jump in prices, causing the Federal Reserve to raise interest rates, or be a transitory side-effect as the US economy roars back following the coronavirus-induced recession. Personally, I am in the latter camp and am not concerned about sustained inflation. </p>\n\n<p>Todd Jablonski, chief investment officer at Principal Global Asset Allocation said, “Inflation has gone from being on no one’s radar screen maybe five years as a lead concern, to now being at the absolute forefront as you see the economy rebound off of COVID lows. There has been a tremendous acceleration in earnings, coupled with massive monetary and fiscal stimulus.”</p>\n\n<p>members of the Federal Open Market Committee (FOMC), reiterated their stance that they were not yet concerned that new inflation data would force the Fed to tighten monetary policy sooner than expected. St. Louis Federal Reserve President James Bullard said he believed increases in inflation would be “mostly temporary” and that the Fed was “not quite there yet” when it came to discussing tapering its asset purchase program. In separate comments, Kansas City Federal Reserve President Esther George said she did not want the Fed to be “overly reliant on historical relationships and dynamics in judging the outlook for inflation.” </p>\n\n<p>Richard Clarida, Vice Chairman of the Federal Reserve, also said “there will come a time in upcoming meetings” when the Fed would consider tapering the asset purchase program but that “it is going to depend on the flow of data”. The Fed is currently buying $120 billion a month in government-issued and government-backed securities, and has pledged to continue doing that until the economy is more fully recovered.</p>\n\n<p>This reaffirms the market that the Fed is not on a set timeline when it comes to rolling back current accommodative policies and will, as they have said time and again, wait for concrete data before any considerations are made. This follows a similar statement from Jerome Powell back in April 14, which proves market participants shouldn’t worry about quantitative easing tapering, in my opinion. Powell said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.”</p>\n\n<p>The Department of Labor’s Weekly Unemployment Report showed jobless claims fell for the fourth straight week to yet another pandemic-era low, an encouraging sign that the labor market is improving following the extremely disappointing April Jobs report, which showed 266,000 new jobs added in the month, far below estimated of more than 1 million and a sharp deceleration in job growth compared to March. </p>\n\n<ul>\n<li><strong>Initial jobless claims, week ended May 22:</strong> 406,000 vs. 425,000 expected and 444,000 the week prior</li>\n<li><strong>Continuing claims, week ended May 15:</strong> 3.642 million vs. 3.680 million expected and a revised 3.738 the week prior</li>\n</ul>\n\n<p><strong>Highlights</strong> </p>\n\n<ul>\n<li>Boeing (BA) agreed to pay at least $17 million to settle enforcement cases with the Federal Aviation Administration over production issues with its 737 jets. Stock reacted positively to the news. </li>\n<li>Durable goods orders, or orders for manufactured goods intended to last at least three years, unexpectedly declined in April, ending an 11-month streak of increases, the Commerce Department said Thursday, an encouraging sign. </li>\n<li>“Meme stocks” are on the move again, with AMC gapping up 40% on the day. Gamestop (GME) and AMC have both been on monster runs this week.</li>\n<li>Paytm, India’s largest digital payment platform, is reportedly aiming to go public later this year with a valuation of $25-$30 billion.</li>\n<li>Shares of Ford (F) have been on fire since the company announced it was making a big investment to manufacture EVs and recently unveiled the all-electric Ford F-150 pickup, one of the company’s most popular models. \\</li>\n<li>Amazon (AMZN), Microsoft (MSFT) and Alphabet (GOOG, GOOGL) are all involved in a bidding process to provide cloud services to Boeing, according to multiple reports. </li>\n<li>Disney’s (DIS) California-based parks will welcome non-California natives starting June 15.</li>\n<li><strong>**Please note that current stock price was written in the morning and does not reflect intraday changes*\\</strong>*</li>\n<li>Applied Materials (AMAT) with three target raises. Stock currently around $137\n\n<ul>\n<li>JP Morgan from $146 to $160</li>\n<li>Susquehanna from $155 to $170 </li>\n<li>Mizuho from $155 to $158 </li>\n</ul></li>\n<li>Burlington Stores (BURL) target raised by Telsey Advisory Group from $320 to $370 at Outperform. Stock currently around $328</li>\n<li>DR Horton (DHI) target raised by Wells Fargo from $110 to $115 at Overweight. Stock currently around $94</li>\n<li>Nvidia (NVDA) with a host of target raises. Average price target $730 at Buy. Stock currently around $628</li>\n<li>Palo Alto Networks (PANW) with two target raises. Stock currently around $368\n\n<ul>\n<li>Deustche Bank from $395 to $410 at Buy</li>\n<li>Northland Securities from $420 to $440</li>\n</ul></li>\n<li>Restoration Hardware (RH) target raised by Wedbush from $550 to $700 at Outperform. Stock currently around $639</li>\n<li>UnitedHealth Group (UNH) target raised by Truist Securities from $450 to $480 at Buy. Stock currently around $413</li>\n<li>Western Digital (WDC) target raised by Benchmark from $87 to $92 at Buy. Stock currently around $75</li>\n</ul>\n\n<p>“A wise man will make more opportunities than he finds.” - Francis Bacon</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/nmgr81/here_is_a_market_recap_for_today_thursday_may_27/",
  "subreddit": "stocks",
  "id": "nmgr81",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300244
}