{
  "author": "No_Contribution2112",
  "original_created_utc": 1642460984,
  "title": "Was I raped?",
  "created_utc": 1642521906,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I remember asking this in another subreddit a while ago but the replies were mixed and im still not sure. So im gonna ask here since its been on my mind so much.  &lt;/p&gt;\n\n&lt;p&gt;2 months ago i was messaging this guy on grindr and we agreed to do some things, but not once did we agree to anal sex. Anal was not even mentioned in the conversation AT ALL. So i get to the guys house and we trade oral, make out, and do some other things. Eventually he tells me to turn around which i agreed to because i assumed he was gonna rim me since i just got finished doing it to him, but that’s not what he did at all. He put his penis inside and started fucking me. It hurt really bad since he was like 8&amp;quot;. I was too scared to tell him to stop so i just sat there and took it. He kept going until he came and i was completely turned off at this point.  &lt;/p&gt;\n\n&lt;p&gt;After a week or so my bum started to itch a lot and i assume he gave me an std. if he did give me one then its still untreated till this day because im too scared to come out. Everyone in my life including my doctor thinks im straight. Was I raped? Or is it my fault for not speaking up&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/s6hutr/was_i_raped/",
  "subreddit": "TooAfraidToAsk",
  "id": "s6hutr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I remember asking this in another subreddit a while ago but the replies were\nmixed and im still not sure. So im gonna ask here since its been on my mind so\nmuch.\n\n2 months ago i was messaging this guy on grindr and we agreed to do some things,\nbut not once did we agree to anal sex. Anal was not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し前に別のsubredditでこの質問をした記憶があるのですが、返事は\nが混在しており、まだよくわからない。なので、気になったのでここで聞いてみようと思います。\nを多くしています。\n\n2ヶ月前、私はGrindrでこの人とメッセージをしていて、あることをすることに同意しました。\nしかし、一度もアナルセックスをすることに同意しませんでした。アナルは...",
      "title": "私はレイプされたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得不久前在另一个分论坛上问过这个问题，但得到的答复是\n混合，我仍然不确定。所以我想在这里问一下，因为它一直在我的脑海里，所以\n我在这里问一下，因为它一直在我的脑海里。\n\n2个月前，我在Grindr上给这个家伙发信息，我们同意做一些事情。\n但我们没有一次同意进行肛交。肛门并不是...",
      "title": "我被强奸了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得不久前在另一個分論壇上問過這個問題，但得到的答覆是\n混合，我仍然不確定。所以我想在這裏問一下，因爲它一直在我的腦海裏，所以\n我在這裏問一下，因爲它一直在我的腦海裏。\n\n2個月前，我在Grindr上給這個傢伙發信息，我們同意做一些事情。\n但我們沒有一次同意進行肛交。肛門並不是...",
      "title": "我被強姦了嗎？"
    }
  ]
}