{
  "author": "AvidasOfficial",
  "the_new_excerpt": "Hi, as you have all seen BTC took a minor dip over the last day. This is just a\nsmall correction and is unlikely an indicator that a bear market is coming.\n\nThat said it is very clear that emotions are high in the market place right now.\nNew users may not be used to these kind of movements,…",
  "original_created_utc": 1614005852,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，大家都看到了，BTC在上一天出现了小幅下挫。这只是一个\n小幅调整，不太可能是熊市来临的指标。\n\n也就是说，现在市场上的情绪非常明显。\n新用户可能不习惯这种走势，...",
      "title": "熊市归来时的心理健康（帖子不为FUD，今天的走势只是小幅修正）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，大家都看到了，BTC在上一天出現了小幅下挫。這只是一個\n小幅調整，不太可能是熊市來臨的指標。\n\n也就是說，現在市場上的情緒非常明顯。\n新用戶可能不習慣這種走勢，...",
      "title": "熊市歸來時的心理健康（帖子不爲FUD，今天的走勢只是小幅修正）。"
    }
  ],
  "title": "Mental Health when the bear market returns (post not for FUD, todays move is just a minor correction)",
  "created_utc": 1614029946,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, as you have all seen BTC took a minor dip over the last day. This is just a small correction and is unlikely an indicator that a bear market is coming.</p>\n\n<p>That said it is very clear that emotions are high in the market place right now. New users may not be used to these kind of movements, especially as BTC and the whole market has been in parabolic mode for an extended period of time.</p>\n\n<p>When the bear market does arrive however it will be as brutal as ever. BTC and the crypto market has always gone through a cycle and when the tide does turn 14% dips will seem like childs play. Be prepared for tokens dropping 50% or more in the space of hours and for this to happen week after week after week.</p>\n\n<p>When this part of the cycle comes around it inevitably has a massive effect on people&#39;s mental health and in previous bear markets we have seen crypto investors on the verge of suicide.</p>\n\n<p>The most important thing I must stress right now is to only invest what you can afford to lose. If your portfolio dropped by 80% right now would it financially ruin you? </p>\n\n<p>It is very important though to remember that the bear market doesn&#39;t last forever and long term crypto has been on an upward trend. A year long downward movement may feel like the end whilst it happens but the long term prospects are incredibly bullish.</p>\n\n<p>If you do get trapped with your tokens in a bear market do not despair, you only lose money if you sell at a loss, instead use the lower prices to strengthen your positions and dollar cost average down ready for the next bull cycle. </p>\n\n<p>Money is great but your mental health and well being is more important. Hopefully we won&#39;t see the bear market any time soon but it will come at some point so make sure you are prepared.</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/lppyrv/mental_health_when_the_bear_market_returns_post/",
  "subreddit": "CryptoCurrency",
  "id": "lppyrv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332879176
}