{
  "author": "TheFamousHesham",
  "original_created_utc": 1644360372,
  "title": "I Read Cathie Wood’s Ark Invest’s 132 Page “Big Ideas 2022” Report.. So You Don’t Have To",
  "created_utc": 1644395712,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you don’t know her, Cathie Wood is a fund manager (Ark Invest) who rose to prominence in 2020/21 after a series of very successful investments/market bets.&lt;/p&gt;\n\n&lt;p&gt;She is a strong believer in disruptive technologies.&lt;/p&gt;\n\n&lt;p&gt;Think robotics, tomorrow’s batteries and genomics as well as erm.. blockchain technology and is perhaps &lt;strong&gt;the most bullish person&lt;/strong&gt; on crypto.&lt;/p&gt;\n\n&lt;p&gt;She recently predicted that BTC will be worth &lt;strong&gt;over $1M by 2030&lt;/strong&gt;, making her perhaps the most bullish person I know.&lt;/p&gt;\n\n&lt;p&gt;Allow me to summarize the report’s highlights on the future of Bitcoin..&lt;/p&gt;\n\n&lt;h1&gt;Ark Invest analysts predict that the market capitalization of blockchain technology will reach $49T in 2030.&lt;/h1&gt;\n\n&lt;p&gt;That’s roughly &lt;strong&gt;half&lt;/strong&gt; what the global equities market is worth today ($106T).&lt;/p&gt;\n\n&lt;p&gt;Cathie Wood predicts that &lt;strong&gt;more than half (57%)&lt;/strong&gt; of that market cap will come from Bitcoin alone; believing Bitcoin’s market cap will climb to &lt;strong&gt;$28T by 2030.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Currently, Bitcoin&amp;#39;s market cap stands at $815B, down from an ATH of around $1.2T.&lt;/p&gt;\n\n&lt;p&gt;And this is where she gets her $1M/BTC price point from (more details on that at the end of this post).&lt;/p&gt;\n\n&lt;h1&gt;According to Cathie Wood, El Salvador’s Bitcoin “experiment” is already a resounding success.&lt;/h1&gt;\n\n&lt;p&gt;&lt;em&gt;Why?&lt;/em&gt; The data &lt;strong&gt;speaks volumes.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;# of people in El Salvador with a Bitcoin wallet = &lt;strong&gt;3.8 million&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;# of people in El Salvador with a traditional bank account = &lt;strong&gt;1.9 million&lt;/strong&gt; &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The % of eligible citizens with a Bitcoin wallet in El Salvador is 84% as of December 2021, versus 42% with a traditional bank account.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What’s more bullish is people are actually using these wallets!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Bitcoin wallets in El Salvador settled (on average) &lt;strong&gt;$2M worth of transactions in remittances DAILY&lt;/strong&gt; as of October 2021.&lt;/li&gt;\n&lt;li&gt;On an annual basis, this accounts for roughly &lt;strong&gt;12% of ALL remittances sent&lt;/strong&gt; to El Salvador (total = $6B annually, or &lt;strong&gt;2% of El Salvador’s overall GDP&lt;/strong&gt;)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Reader’s Note I — Remittances are money transfers sent from one party who works abroad to another in their home country (typically family).&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h1&gt;And El Salvador is not alone..&lt;/h1&gt;\n\n&lt;p&gt;2021 was the year that Bitcoin’s annual settlement volume &lt;strong&gt;surpassed that of Visa’s.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Bitcoin’s total came to a whopping &lt;strong&gt;$13.1T, or ~120% of Visa’s.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is effectively a &lt;strong&gt;5x increase&lt;/strong&gt; on the previous year ($2.3T in 2020, ~24% of the Visa network’s).&lt;/p&gt;\n\n&lt;p&gt;However, is the Bitcoin network becoming more dominated by larger investors with deeper pockets?!&lt;/p&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;Well.. probably.&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;The average value of each individual transaction in 2021 was $136,555. This is up from $21,590 in 2020, significantly more than the increase in Bitcoin’s price over the same period.&lt;/p&gt;\n\n&lt;p&gt;This makes sense as ETFs, countries and companies have all increased their BTC holdings in 2021 and now hold roughly 1.5 million BTC. Or, &lt;strong&gt;8% of the total circulating supply.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The 5 largest publicly disclosed bitcoin wallets belong to the (1) Grayscale Bitcoin Trust (2) Block One (3) Microstrategy (4) CoinShares and (5) Tesla.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;But what about me, you and the annoying Karen you avoid on the school run?&lt;/em&gt;&lt;/p&gt;\n\n&lt;h1&gt;Believe it or not, most Bitcoin investors in 2021 were not speculators.&lt;/h1&gt;\n\n&lt;p&gt;The number of BTC long term holders has been steadily increasing since 2011, except for a substantial “blip” back in 2018. Understandable.&lt;/p&gt;\n\n&lt;p&gt;This trend has continued throughout the most recent bull run in 2020/21.&lt;/p&gt;\n\n&lt;p&gt;Long term investors now collectively hold &lt;strong&gt;13.5m Bitcoin&lt;/strong&gt;, or more than half of all BTC.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Reader’s Note II — A “long term investor” is defined by Ark Invest as someone who has held their BTC for more than 155 days.  &lt;/p&gt;\n\n&lt;p&gt;Reader’s Note III — Yes, they removed any wallets with “dust” BTC from the data.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;h1&gt;So how does Cathie Wood arrive at the $28T BTC market cap by 2030?&lt;/h1&gt;\n\n&lt;p&gt;&lt;em&gt;Is she, like all of us, drunk on hopium?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I’ll give you the figures and let you make your mind up:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Reader’s Note IV — Important For Context..  &lt;/p&gt;\n\n&lt;p&gt;Gold’s market capitalization is $10T (2021)  &lt;/p&gt;\n\n&lt;p&gt;The global equities market has an overall market capitalization of $106T (2021)  &lt;/p&gt;\n\n&lt;p&gt;In their analysis, Ark Invest chose to project BTC’s 2030 market cap using 2021 data rather than “&lt;em&gt;projected&lt;/em&gt;” 2030 data/guesswork.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Now For The Juice:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;BTC will become the new “digital gold” and account for a whopping 50% of gold’s market cap by 2030 — or, $5.5T.&lt;/li&gt;\n&lt;li&gt;More S&amp;amp;P companies will keep BTC on their balance sheets (like Tesla). Ark Invest estimates 5% of balance sheets will be kept in BTC — adding another $4.2T.&lt;/li&gt;\n&lt;li&gt;Institutions are not far behind and will keep 2.55% of assets in BTC — accounting for $4.1T.&lt;/li&gt;\n&lt;li&gt;High Net Worth Individuals will dedicate 5% of their portfolios to BTC — that’s another $4.0T right there.&lt;/li&gt;\n&lt;li&gt;Nation-states will keep 1% of their reserves in BTC — providing a further $3.8T in “value” to the market.&lt;/li&gt;\n&lt;li&gt;US Banks will get in on the action too and use BTC for 25% of all inter-bank settlements — that’s another $3.8T.&lt;/li&gt;\n&lt;li&gt;BTC will have replaced fiat currencies in emerging markets at a rate of around 10% by 2030 — or, $2.8T.&lt;/li&gt;\n&lt;li&gt;Finally, BTC will account for 50% of all global remittances — adding a relatively meagre $0.3T.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;span class=\"md-spoiler-text\"&gt;Grand Total = $28.5T (equal to $1.36M/BTC)&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Reader’s Note V — For those interested, I personally think some of these numbers are actually conservative especially as (mentioned earlier) they’re based on 2021 market capitalization rather than “projected” 2030 market caps.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Obv there is so much more in the report about blockchain tech and DeFi, but I chose to focus on BTC in this post because I, honestly, already doubt anyone will read this considering its length so it doesn’t need to be any longer.&lt;/p&gt;\n\n&lt;p&gt;Anyway, I’m sorry if I bored you and you’re most welcome if you happened to read and appreciate this post :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/snx7rw/i_read_cathie_woods_ark_invests_132_page_big/",
  "subreddit": "CryptoCurrency",
  "id": "snx7rw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you don’t know her, Cathie Wood is a fund manager (Ark Invest) who rose to\nprominence in 2020/21 after a series of very successful investments/market bets.\n\nShe is a strong believer in disruptive technologies.\n\nThink robotics, tomorrow’s batteries and genomics as well as erm..…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "知らない人もいるかもしれませんが、キャッシー・ウッドはファンドマネージャー（アーク・インベスト）で、一躍有名になった人です。\n2020/21年、投資/市場ベットで大成功を収め、一躍脚光を浴びました。\n\n彼女は破壊的技術に強い信念を持っています。\n\nロボット工学、未来のバッテリー、ゲノム学、そして......。",
      "title": "キャッチー・ウッド氏のアークインベスト社の132ページの「Big Ideas 2022」レポートを読みました... だから、あなたはそうする必要はありません"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你不认识她，凯西-伍德是一位基金经理（Ark Invest），她在2020/21年因一系列非常成功的投资/市场押注而崛起。\n在一系列非常成功的投资/市场赌注之后，她在2020/21年崭露头角。\n\n她是颠覆性技术的坚定信仰者。\n\n认为机器人技术、明天的电池和基因组学以及erm.....。",
      "title": "我读了凯西-伍德的方舟投资公司的132页 \"2022年大想法 \"报告。所以你不必这样做"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你不認識她，凱西-伍德是一位基金經理（Ark Invest），她在2020/21年因一系列非常成功的投資/市場押注而崛起。\n在一系列非常成功的投資/市場賭注之後，她在2020/21年嶄露頭角。\n\n她是顛覆性技術的堅定信仰者。\n\n認爲機器人技術、明天的電池和基因組學以及erm.....。",
      "title": "我讀了凱西-伍德的方舟投資公司的132頁 \"2022年大想法 \"報告。所以你不必這樣做"
    }
  ]
}