{
  "author": "volocom7",
  "original_created_utc": 1627396957,
  "title": "Why Bitcoin credit cards will make us all rich.",
  "created_utc": 1627425423,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I realized something today as I finally got my invite for the Blockfi Bitcoin Credit Card . . .</p>\n\n<p>These credit cards (there are others) will make us all rich.</p>\n\n<p>As of now, 3.5% of my credit card transactions are being rewarded to me in Bitcoin. This single financial move I made to this card is directly increasing the rate that I am removing the circulating supply of Bitcoin from the world. I&#39;m buying more and more of this limited resource and products like bitcoin credit cards just make it easier and easier for me to do it.</p>\n\n<p>As a fearless HODLer, I&#39;m helping the greater community by removing supply and increasing value.</p>\n\n<p>Realizing that these Bitcoin reward credit cards are only going to generate millions of people like me blew my mind.</p>\n\n<p>We are working towards a future with more mechanism to let people buy up this limited resource asset. The demand is there and rising. Hyperbitcoinization will happen.</p>\n\n<p>EDIT:</p>\n\n<p>Correcting a misleading point in my post. </p>\n\n<p>The 3.5% reward is a promotion that is capped to $100 of value. The true regular reward rate is 1.5% which I see as better than my previous card (Coinbase debit card) at 1% reward.</p>\n\n<p>My whole point is that millions of people claiming any amount of crypto through cards like this is a very very powerful thing. We are eating up the worlds first truly limited asset and building more and more mechanisms for people to eat at it quicker.</p>\n\n<p>Supply goes down + Demand stays the same =&gt; Price goes up</p>\n\n<p>Price goes up  =&gt; Demand goes up</p>\n\n<hr/>\n\n<p>Supply goes down + Demand goes up =&gt; BLASTOFF</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/Bitcoin/comments/oso5ng/why_bitcoin_credit_cards_will_make_us_all_rich/",
  "subreddit": "Bitcoin",
  "id": "oso5ng",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I realized something today as I finally got my invite for the Blockfi Bitcoin\nCredit Card . . .\n\nThese credit cards (there are others) will make us all rich.\n\nAs of now, 3.5% of my credit card transactions are being rewarded to me in\nBitcoin. This single financial move I made to this card is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、Blockfi Bitcoinの招待状が届いて、あることに気づきました。\nクレジットカード ... .\n\nこのクレジットカード（他にもあります）は、私たちをお金持ちにしてくれます。\n\n今のところ、私のクレジットカード取引の3.5%が、ビットコインで報われています。\nBitcoinです。私がこのカードにしたこの単一の金融移動は...",
      "title": "ビットコイン・クレジットカードが私たちを豊かにする理由。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天意识到一些事情，因为我终于收到了Blockfi比特币的邀请。\n信用卡......。\n\n这些信用卡（还有其他的）将使我们都变得富有。\n\n到现在为止，我的信用卡交易中有3.5%是以比特币的形式奖励给我的。\n比特币。我对这张卡的这一单一金融举措是...",
      "title": "为什么比特币信用卡会让我们都发财。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天意識到一些事情，因爲我終於收到了Blockfi比特幣的邀請。\n信用卡......。\n\n這些信用卡（還有其他的）將使我們都變得富有。\n\n到現在爲止，我的信用卡交易中有3.5%是以比特幣的形式獎勵給我的。\n比特幣。我對這張卡的這一單一金融舉措是...",
      "title": "爲什麼比特幣信用卡會讓我們都發財。"
    }
  ]
}