{
  "author": "BlackSmoKitty",
  "original_created_utc": 1655721287,
  "title": "Is it typical to make lower income guests pay for their own travel to a destination wedding?",
  "created_utc": 1655731282,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My boyfriend’s sister is having a destination wedding soon. I was shocked to find that she isn’t paying for her low income aunt to travel over (from another country a great distance away). My boyfriend isn’t receiving any help with travel expenses either and has already had to pay for his wedding clothes &amp;amp; food for the guests she’s having him entertain at his flat. He’s disabled and I know it’s a lot for him, though he hasn’t complained. Is this typical?  I’ve never been to a destination wedding but they seem rather selfish to me. I couldn’t imagine asking people to pay to travel to another country for MY wedding.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/vgifkj/is_it_typical_to_make_lower_income_guests_pay_for/",
  "subreddit": "TooAfraidToAsk",
  "id": "vgifkj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My boyfriend’s sister is having a destination wedding soon. I was shocked to\nfind that she isn’t paying for her low income aunt to travel over (from another\ncountry a great distance away). My boyfriend isn’t receiving any help with\ntravel expenses either and has already had to pay for his wedding…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼氏の妹が近々デスティネーションウェディングをすることになりました。私はショックでした。\n低所得の叔母の旅費を負担してくれないことにショックを受けました。\nを払わないことにショックを受けました。） 私のボーイフレンドは、旅費の援助を受けていません。\n私のボーイフレンドも旅費の援助を受けておらず、すでに結婚式の費用を支払わなければならなくなりました...",
      "title": "低所得のゲストには、デスティネーション・ウェディングへの旅費を自己負担させるのが一般的なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我男朋友的妹妹很快要举行一个目的地婚礼。我很震惊地发现\n我很震惊地发现，她没有为她的低收入阿姨支付旅行费用（从另一个国家，距离很远）。\n远的国家）。我的男朋友没有得到任何帮助\n旅费也没有得到任何帮助，而且已经不得不支付他的婚礼费用......",
      "title": "让收入较低的客人自己支付前往目的地婚礼的旅费，这是否很典型？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我男朋友的妹妹很快要舉行一個目的地婚禮。我很震驚地發現\n我很震驚地發現，她沒有爲她的低收入阿姨支付旅行費用（從另一個國家，距離很遠）。\n遠的國家）。我的男朋友沒有得到任何幫助\n旅費也沒有得到任何幫助，而且已經不得不支付他的婚禮費用......",
      "title": "讓收入較低的客人自己支付前往目的地婚禮的旅費，這是否很典型？"
    }
  ]
}