{
  "author": "Iskari",
  "the_new_excerpt": "Hi all,\n\nI've been seeing all these posts about shady accounts trying to hype Nokia etc.\nDunno anything about that, but I feel like I should ship into this conversation.\n\nFirst of all, a few weeks ago, I made a bad decision (hindsight 20/20) and\ndecided to sell my NOK shares. Didn't have a big…",
  "original_created_utc": 1611658352,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n我一直看到这些帖子，关于黑幕账户试图炒作诺基亚等。\n不知道什么，但我觉得我应该船到这个对话。\n\n首先，几周前，我做了一个错误的决定（事后看20/20），我的决定是，我的手机是我的。\n决定卖掉我的NOK股票。没有一个大的...",
      "title": "关于NOK的诚实案例"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n我一直看到這些帖子，關於黑幕賬戶試圖炒作諾基亞等。\n不知道什麼，但我覺得我應該船到這個對話。\n\n首先，幾周前，我做了一個錯誤的決定（事後看20/20），我的決定是，我的手機是我的。\n決定賣掉我的NOK股票。沒有一個大的...",
      "title": "關於NOK的誠實案例"
    }
  ],
  "title": "An honest case on NOK",
  "created_utc": 1611690164,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, </p>\n\n<p>I&#39;ve been seeing all these posts about shady accounts trying to hype Nokia etc. Dunno anything about that, but I feel like I should ship into this conversation. </p>\n\n<p>First of all, a few weeks ago, I made a bad decision (hindsight 20/20) and decided to sell my NOK shares. Didn&#39;t have a big position to begin with, but still. You can see the <a href=\"https://imgur.com/a/8Nd0PUH\">screenshot of that transaction here</a>.  (It is in Finnish, but it says I sold 1150 shares at 3,18 on 8th of January).</p>\n\n<p>Now today, after some careful consideration, I decided to hop back in, with a bigger, 9k position. <a href=\"https://imgur.com/a/pxZiEhW\">Screen here</a>. </p>\n\n<p>I&#39;ll tell you why. </p>\n\n<p>First of all, every Finn has an opinion about Nokia, and they&#39;re very sentimental and nostalgic about it.  The company made a lot of people rich and they hope it&#39;ll become one of the great ones someday. And they&#39;re willing to hang on through the toughest of times. I do not know how much of the hype on interest is made up and how much is real, but I&#39;m sure many Finns will view the latest surge in the stock price as a positive and - I believe - will jump back in and go long. The company has been all over the local news yesterday and today, so the media is adding to the hype. </p>\n\n<p>Second, I think the company has been undervalued for quite some time now. And I don&#39;t blame the investors. There was every reason to think that the company was done for. But now it genuinely looks like there is a meaningful change coming. It might take a few years, but the company has definitely renewed their strategy and is moving in the right direction. </p>\n\n<p>Third, the analysts seem to agree. In the past week at least 4 different analysts have upgraded their target price. Latest were banks Danske Bank to 4,30€ and Handelsbanken to 4,40€.</p>\n\n<p>To sum it up, the hype might not last, but I genuinely feel the potential is there.</p>\n</div><!-- SC_ON -->",
  "score": 64,
  "permalink": "/r/stocks/comments/l5bocw/an_honest_case_on_nok/",
  "subreddit": "stocks",
  "id": "l5bocw",
  "is_self": true,
  "media": null,
  "is_video": false
}