{
  "author": "Willyhats",
  "the_new_excerpt": "This is the worst dip we’ve seen yet this cycle, but we’ve seen lots worse in\nprevious cycles and bitcoin still came back to rally when the time came. Be\npatient. one bad thing happens and everyone seems to forget the long game. This\nis exactly how they want you to react so they can have your…",
  "original_created_utc": 1621288978,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、このサイクルでまだ見たことのない最悪のディップですが、これまでのサイクルではもっとひどいことがありました。\nしかし、これまでのサイクルでは、もっと悪い状況をたくさん見てきましたが、ビットコインは時が来ればラリーに戻ってきました。忍耐強く\n1つの悪いことが起こると、誰もが長期的なゲームを忘れてしまうようです。これは\nこれはまさに、彼らがあなたに反応してもらい、あなたの...を手に入れようとする方法です。",
      "title": "ビットコインの強気相場では、このようなディップはなかったように皆が行動している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我们在这个周期中看到的最糟糕的下跌，但是我们在以前的周期中看到过很多更糟糕的情况\n但在以前的周期中，我们也见过很多更糟糕的情况，而当时机到来时，比特币仍然会回来反弹。要有耐心。\n一件坏事发生后，每个人似乎都忘记了长期的游戏。这\n这正是他们希望你做出的反应，这样他们就能得到你的...",
      "title": "每个人都表现得好像在比特币牛市中没有出现过这样的跌势一样"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我們在這個週期中看到的最糟糕的下跌，但是我們在以前的週期中看到過很多更糟糕的情況\n但在以前的週期中，我們也見過很多更糟糕的情況，而當時機到來時，比特幣仍然會回來反彈。要有耐心。\n一件壞事發生後，每個人似乎都忘記了長期的遊戲。這\n這正是他們希望你做出的反應，這樣他們就能得到你的...",
      "title": "每個人都表現得好像在比特幣牛市中沒有出現過這樣的跌勢一樣"
    }
  ],
  "title": "Everyone acting like there hasn’t been dips like this during a bitcoin bull market",
  "created_utc": 1621307108,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is the worst dip we’ve seen yet this cycle, but we’ve seen lots worse in previous cycles and bitcoin still came back to rally when the time came. Be patient. one bad thing happens and everyone seems to forget the long game. This is exactly how they want you to react so they can have your bitcoin. Quit feeding the FUD HODL</p>\n</div><!-- SC_ON -->",
  "score": 620,
  "permalink": "/r/Bitcoin/comments/net9mu/everyone_acting_like_there_hasnt_been_dips_like/",
  "subreddit": "Bitcoin",
  "id": "net9mu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590795288
}