{
  "author": "Some1fromReddit",
  "original_created_utc": 1646158272,
  "title": "It's been exactly 6 years to this day I owned Crypto, and the one thing I tell you, is that I'm 99.99% in it to get rich, and only 0.01% in for decentralization.",
  "created_utc": 1646174128,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s right, in this day, it&amp;#39;s money.  The Moola, the dinero, cash that&amp;#39;s the most important thing that I get out of cryptocurrency.   All of that privacy jargon is cool and all, but I just heard Gas will hit $10 by EOY in California which means it will be close to $7 on the east coast.     My taxes on a regular home went up 30% in two years, 2 slices of pizza, and a drink come out to $10, and now the town decided it was the perfect idea to TRIPLE OUR WATER BILL! &lt;/p&gt;\n\n&lt;p&gt;YES, they actually tripled it.   Turns out the previous mayor didn&amp;#39;t pay the water bill from the other city we get water from for like 8 years!.    Great that I have to pay for the previous home owner&amp;#39;s water bill.  Why not right?    But the absolute worst thing about what we are going through right now is the idea that &amp;quot;crypto is the problem&amp;quot; and it&amp;#39;s being used as one of the scape goats in the Ukraine/Russia war.   God, people are so FKing stupid to believe this shit. &lt;/p&gt;\n\n&lt;p&gt;The more we change, the more we stay the same.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 490,
  "permalink": "/r/CryptoCurrency/comments/t4e9dl/its_been_exactly_6_years_to_this_day_i_owned/",
  "subreddit": "CryptoCurrency",
  "id": "t4e9dl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "That's right, in this day, it's money. The Moola, the dinero, cash that's the\nmost important thing that I get out of cryptocurrency. All of that privacy\njargon is cool and all, but I just heard Gas will hit $10 by EOY in California\nwhich means it will be close to $7 on the east coast. My taxes on a…"
}