{
  "author": "Some1fromReddit",
  "original_created_utc": 1646158272,
  "title": "It's been exactly 6 years to this day I owned Crypto, and the one thing I tell you, is that I'm 99.99% in it to get rich, and only 0.01% in for decentralization.",
  "created_utc": 1646174128,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s right, in this day, it&amp;#39;s money.  The Moola, the dinero, cash that&amp;#39;s the most important thing that I get out of cryptocurrency.   All of that privacy jargon is cool and all, but I just heard Gas will hit $10 by EOY in California which means it will be close to $7 on the east coast.     My taxes on a regular home went up 30% in two years, 2 slices of pizza, and a drink come out to $10, and now the town decided it was the perfect idea to TRIPLE OUR WATER BILL! &lt;/p&gt;\n\n&lt;p&gt;YES, they actually tripled it.   Turns out the previous mayor didn&amp;#39;t pay the water bill from the other city we get water from for like 8 years!.    Great that I have to pay for the previous home owner&amp;#39;s water bill.  Why not right?    But the absolute worst thing about what we are going through right now is the idea that &amp;quot;crypto is the problem&amp;quot; and it&amp;#39;s being used as one of the scape goats in the Ukraine/Russia war.   God, people are so FKing stupid to believe this shit. &lt;/p&gt;\n\n&lt;p&gt;The more we change, the more we stay the same.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 490,
  "permalink": "/r/CryptoCurrency/comments/t4e9dl/its_been_exactly_6_years_to_this_day_i_owned/",
  "subreddit": "CryptoCurrency",
  "id": "t4e9dl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "That's right, in this day, it's money. The Moola, the dinero, cash that's the\nmost important thing that I get out of cryptocurrency. All of that privacy\njargon is cool and all, but I just heard Gas will hit $10 by EOY in California\nwhich means it will be close to $7 on the east coast. My taxes on a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうです、今の時代、お金なんです。ムーラ、ディネーロ、キャッシュ、それが\n暗号通貨から得られる最も重要なものです。個人情報保護は\nしかし、ガスがカリフォルニアの年末までに10ドルになると聞いた。\nつまり、東海岸では7ドル近くまで下がるということです。私の税金は...",
      "title": "私が暗号を所有してから今日でちょうど6年になりますが、一つだけ言えることは、私は99.99%は金持ちになるためで、分散化のためには0.01%しか参加していないということです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是正确的，在这个时代，它是钱。Moola，dinero，现金，这是\n我从加密货币中得到的最重要的东西。所有这些隐私\n所有这些隐私术语都很酷，但我刚刚听说天然气将在加州的EOY达到10美元。\n这意味着它在东海岸将接近7美元。我的税款在美国和欧洲都有。",
      "title": "到今天为止，我拥有加密货币已经整整6年了，我告诉你一件事，就是我99.99%是为了致富，只有0.01%是为了去中心化。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是正確的，在這個時代，它是錢。Moola，dinero，現金，這是\n我從加密貨幣中得到的最重要的東西。所有這些隱私\n所有這些隱私術語都很酷，但我剛剛聽說天然氣將在加州的EOY達到10美元。\n這意味着它在東海岸將接近7美元。我的稅款在美國和歐洲都有。",
      "title": "到今天爲止，我擁有加密貨幣已經整整6年了，我告訴你一件事，就是我99.99%是爲了致富，只有0.01%是爲了去中心化。"
    }
  ]
}