{
  "author": "potaloma",
  "original_created_utc": 1631585519,
  "title": "3 Smaller Cap Coins That Might Peak Your Interest...",
  "created_utc": 1631604651,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>While I believe many of the coins I&#39;ve endorsed are doing well and will continue to be good investments, there are a handful of others that are less well-known that I thought I&#39;d bring to people&#39;s attention. These coins are now inexpensive and can be purchased in large quantity; they all have tremendous future potential, and despite their youth and low value, there is little doubt that their value will rise. I&#39;ve compiled a list in no particular order to raise awareness of these coins, as well as a few reasons why their value and popularity are likely to increase in the future.  </p>\n\n<h1>Yieldly</h1>\n\n<p>Yieldly is a cryptocurrency that exists on the Algorand blockchain (the coin that recently doubled in value and is now the foundation for El Salvador&#39;s cryptocurrency infrastructure). Yieldly is the centerpiece of a DeFi app of the same name that allows users to boost their income in a variety of ways.</p>\n\n<p>The novelty of this coin is that it allows users to use their Algorand to enter a no-lose lottery in which they could win thousands of Algos. If you don&#39;t win in a given week, don&#39;t worry; keeping your Algos staked and playing costs you nothing. In fact, while your Algos are being staked, you will earn Yieldly tokens, which can be used to stake for NFTs. While I&#39;m not a huge fan of NFTs, I do think they have their place.</p>\n\n<p>Yieldly&#39;s bridge functionality is another feature that will set it apart. Essentially, this will allow users to exchange Yieldly or Algorand for Bitcoin, Ethereum, and a variety of other coins quickly and with little fees. If the platform&#39;s functionality is improved, it has the potential to become the instrument of choice for on-the-fly asset exchanges.</p>\n\n<p>&#x200B;</p>\n\n<h1>hi Dollar</h1>\n\n<p>Hi is a new platform that has just recently opened but is rapidly gaining interest for a variety of reasons.</p>\n\n<p>While many cryptocurrencies are complicated to use and manage, hi makes it simple for individuals to use its network by connecting with popular social media and messaging apps like Telegram and WhatsApp. </p>\n\n<p>All of your currencies are linked to your phone number, which shouldn&#39;t be a big deal unless you have something to hide.</p>\n\n<p>I believe that HI&#39;s accessibility alone makes it a strong candidate for future growth, but for those who aren&#39;t convinced, the platform is making significant progress in providing new features to users.</p>\n\n<p>One of these features is offering platforms the ability for users to claim daily rewards. Imagine opening your Telegram or WhatsApp, tap &quot;Claim Daily Reward,&quot; answer a question, and you&#39;ll receive one HI.</p>\n\n<p>As a result, there is no cost to get started with the platform. </p>\n\n<h1>Harmony One</h1>\n\n<p>ONE is a cryptocurrency that aims to work in tandem with the Ethereum network to dramatically improve its capabilities and operability. This is comparable to Polygon, but I believe Harmony One has a lot more potential than is apparent at first glance.</p>\n\n<p>Because of its sharding capabilities, the platform already has among of the fastest transaction times among cryptocurrencies. The fact that these may be used in tandem with Ethereum, the second-largest cryptocurrency ecosystem, can boost efficiency and make Harmony One a viable challenger in any crypto-driven economy. Users can also use the Guarda wallet to engage in staking.</p>\n\n<p>&#x200B;</p>\n\n<p>Yieldly, Harmony One, and hi Dollar are all excellent choices for anyone searching for young but rising cryptocurrencies. And as always, DYOR.</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/pntp5z/3_smaller_cap_coins_that_might_peak_your_interest/",
  "subreddit": "CryptoCurrency",
  "id": "pntp5z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "While I believe many of the coins I've endorsed are doing well and will continue\nto be good investments, there are a handful of others that are less well-known\nthat I thought I'd bring to people's attention. These coins are now inexpensive\nand can be purchased in large quantity; they all have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が支持してきたコインの多くは好調で、今後も良い投資先になると信じていますが\nしかし、あまり知られていないコインもあります。\nその中で、あまり知られていないコインがあるので、それを紹介したいと思います。これらのコインは、今では安価で\n大量に購入できるようになりました。また、これらのコインは...",
      "title": "3 Smaller Cap Coins That Might Peak Your Interest..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然我相信我认可的许多硬币表现良好，并将继续成为良好的投资。\n优秀的投资，但也有一些不太知名的币种\n我认为我应该提请人们注意。这些钱币现在价格不高\n而且可以大量购买；它们都有...",
      "title": "3个较小市值的硬币可能会引起你的兴趣..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然我相信我認可的許多硬幣表現良好，並將繼續成爲良好的投資。\n優秀的投資，但也有一些不太知名的幣種\n我認爲我應該提請人們注意。這些錢幣現在價格不高\n而且可以大量購買；它們都有...",
      "title": "3個較小市值的硬幣可能會引起你的興趣..."
    }
  ]
}