{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "I haven't told hardly anyone this because it kills me to think about.  I had started day trading paper stocks. I was reading day trading books by reputable day traders, watching live YouTube traders and actually was doing pretty good. In 1 year, I had turned the original 10,000 paper money I started with into 140,000. It was like I couldn't lose. For every red day, I had 3 green days. I was doing everything by the book and it was really working.  \n   \n   So, not having any money, I took out a personal loan for 5k. Put 2k in the bank and 3k into my day trading platform. I was so confident in myself that i laughed when the loan guy told me 5 years at 23%. I told him I'd pay it off in full within 6 months. \n\n   Now in day trading they teach you to look for a catalyst. A reason why a stock will go up. They also teach you to set a stop loss at no more than 5% so you don't lose everything if it drops. Well I started day trading for real and was doing only ok. I would make 250 dollars then lose 150 dollars. Lose 300 then make 200. I was about 50/50 red days and green days. My 3k was down to about 2,800 after a week. Then it happened.  I read a stock twit at 5am about a small company that just had their product approved to sell on Amazon. I looked it up and it was true. I told myself I would buy 2k worth. When I looked up the price, it was only .88 a share!\n\n   The bell rings and I buy like 2,200 shares. It instantly goes up about 6 percent and I'm getting excited. Then, literally as I'm setting my stop loss (not even 2 minutes into the session) it drops. Alot. Below where my stop was gonna be set. I'm down 100 so I'm like we'll shit. I go to set another stop but it falls so fast that I can't set it in time. I'm down 200 then 300 then 400 and I'm freaking out. I finally set a stop and it sells immediately for a 400 dollar loss. This was the first 5 minutes of the session. Over the next 20 minutes it dropped to .40 a share. I thought well at least I got out before it went that low. Upset and confused about why it would fall so low on positive news, I Ieft to work. I had about a 35 min drive and decided about 10 mins into it to check on that stock. It was 2.50 a share! The app for the particular platform at the time was only for checking stocks, I could not perform any buy/sell action from the app and I was driving to work. I checked again 10 mins later, it was at 4.50 a share! I got to the supply house about 20 mins later and checked while I was waiting on parts. 7.00 a share. I couldn't stop watching it all day so when the market closed and it was at 12.35 a share I literally felt sick. The next day it fell a bit early but then ended at 17 dollars! \n\n   Over the next two weeks it had massive swings but hit a high of 34 dollars a share. Now I don't know if I would have held it to that point but I beat myself up for months thinking I lost 400 dollars when I could have made 60k. It completely killed my spirit. I started sucking at my trades. It only took a few months and another almost 2k in losses for me to lose all motivation and pull out my 600 bucks I had left and put it in a different stock trading account, close my day trading account and completely lose all confidence in my ability to day trade.\n\n   They say 84% of day traders claim a loss at the end of the year. I guess I was part of that statistic. I went from being on cloud 9 with my paper account for a year, just slaying the market to being completely shut down in just a few months. Every time someone brings up \"yo man, you still doing the day trading thing\" I just lie and tell them no I don't have enough time to dedicate to it anymore. But really I think of the perfect trade that I knew would go up, that I sold for a loss and, unable to do anything, I watched it go up 3,500% and it still makes me physically queasy. This was 4 years ago. I am what they call in the business an emotional trader. Just thinking of day trading for real money now actually gives me anxiety. Thanks for reading my story. 100% true btw. Nothing in this is made up or exaggerated. Real prices, real time frames. I just can't remember the ticker. \n \n   It ended up falling to about 3 or 4 dollars a share over the next year, and yes I watched it for the next year but 2k into 26k in one day would have been great. 2k into 35k the next day would have been better.  Turning it into 60k would have been life changing for me at that time but I think what hurts the most is that I found that obscure twit. I did the research. I truly believed it would go up, I knew it would go up. Then I panic sold my perfect trade that was truly perfect. Thats worse than losing the money.",
  "author_fullname": "t2_dda7pja6",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "This killed day trading for me..",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_ryznm8",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.82,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 89,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 89,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1641647831,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t told hardly anyone this because it kills me to think about.  I had started day trading paper stocks. I was reading day trading books by reputable day traders, watching live YouTube traders and actually was doing pretty good. In 1 year, I had turned the original 10,000 paper money I started with into 140,000. It was like I couldn&amp;#39;t lose. For every red day, I had 3 green days. I was doing everything by the book and it was really working.  &lt;/p&gt;\n\n&lt;p&gt;So, not having any money, I took out a personal loan for 5k. Put 2k in the bank and 3k into my day trading platform. I was so confident in myself that i laughed when the loan guy told me 5 years at 23%. I told him I&amp;#39;d pay it off in full within 6 months. &lt;/p&gt;\n\n&lt;p&gt;Now in day trading they teach you to look for a catalyst. A reason why a stock will go up. They also teach you to set a stop loss at no more than 5% so you don&amp;#39;t lose everything if it drops. Well I started day trading for real and was doing only ok. I would make 250 dollars then lose 150 dollars. Lose 300 then make 200. I was about 50/50 red days and green days. My 3k was down to about 2,800 after a week. Then it happened.  I read a stock twit at 5am about a small company that just had their product approved to sell on Amazon. I looked it up and it was true. I told myself I would buy 2k worth. When I looked up the price, it was only .88 a share!&lt;/p&gt;\n\n&lt;p&gt;The bell rings and I buy like 2,200 shares. It instantly goes up about 6 percent and I&amp;#39;m getting excited. Then, literally as I&amp;#39;m setting my stop loss (not even 2 minutes into the session) it drops. Alot. Below where my stop was gonna be set. I&amp;#39;m down 100 so I&amp;#39;m like we&amp;#39;ll shit. I go to set another stop but it falls so fast that I can&amp;#39;t set it in time. I&amp;#39;m down 200 then 300 then 400 and I&amp;#39;m freaking out. I finally set a stop and it sells immediately for a 400 dollar loss. This was the first 5 minutes of the session. Over the next 20 minutes it dropped to .40 a share. I thought well at least I got out before it went that low. Upset and confused about why it would fall so low on positive news, I Ieft to work. I had about a 35 min drive and decided about 10 mins into it to check on that stock. It was 2.50 a share! The app for the particular platform at the time was only for checking stocks, I could not perform any buy/sell action from the app and I was driving to work. I checked again 10 mins later, it was at 4.50 a share! I got to the supply house about 20 mins later and checked while I was waiting on parts. 7.00 a share. I couldn&amp;#39;t stop watching it all day so when the market closed and it was at 12.35 a share I literally felt sick. The next day it fell a bit early but then ended at 17 dollars! &lt;/p&gt;\n\n&lt;p&gt;Over the next two weeks it had massive swings but hit a high of 34 dollars a share. Now I don&amp;#39;t know if I would have held it to that point but I beat myself up for months thinking I lost 400 dollars when I could have made 60k. It completely killed my spirit. I started sucking at my trades. It only took a few months and another almost 2k in losses for me to lose all motivation and pull out my 600 bucks I had left and put it in a different stock trading account, close my day trading account and completely lose all confidence in my ability to day trade.&lt;/p&gt;\n\n&lt;p&gt;They say 84% of day traders claim a loss at the end of the year. I guess I was part of that statistic. I went from being on cloud 9 with my paper account for a year, just slaying the market to being completely shut down in just a few months. Every time someone brings up &amp;quot;yo man, you still doing the day trading thing&amp;quot; I just lie and tell them no I don&amp;#39;t have enough time to dedicate to it anymore. But really I think of the perfect trade that I knew would go up, that I sold for a loss and, unable to do anything, I watched it go up 3,500% and it still makes me physically queasy. This was 4 years ago. I am what they call in the business an emotional trader. Just thinking of day trading for real money now actually gives me anxiety. Thanks for reading my story. 100% true btw. Nothing in this is made up or exaggerated. Real prices, real time frames. I just can&amp;#39;t remember the ticker. &lt;/p&gt;\n\n&lt;p&gt;It ended up falling to about 3 or 4 dollars a share over the next year, and yes I watched it for the next year but 2k into 26k in one day would have been great. 2k into 35k the next day would have been better.  Turning it into 60k would have been life changing for me at that time but I think what hurts the most is that I found that obscure twit. I did the research. I truly believed it would go up, I knew it would go up. Then I panic sold my perfect trade that was truly perfect. Thats worse than losing the money.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "ryznm8",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Certain_Economist548",
  "discussion_type": null,
  "num_comments": 112,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/ryznm8/this_killed_day_trading_for_me/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/ryznm8/this_killed_day_trading_for_me/",
  "subreddit_subscribers": 3486097,
  "created_utc": 1641655242,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1641647831,
  "the_new_excerpt": "I haven't told hardly anyone this because it kills me to think about. I had\nstarted day trading paper stocks. I was reading day trading books by reputable\nday traders, watching live YouTube traders and actually was doing pretty good.\nIn 1 year, I had turned the original 10,000 paper money I started…"
}