{
  "author": "AskScienceModerator",
  "original_created_utc": 1633604463,
  "title": "AskScience AMA Series: I'm Diego Pol, a paleontologist and Nat Geo Explorer. AMA about dinosaurs!",
  "created_utc": 1633616373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi! I&#39;m Diego Pol, a paleontologist and National Geographic Explorer who studies dinosaurs and ancient crocs. For the last few years, I&#39;ve been exploring and discovering dinosaurs in Patagonia, the southern tip of South America. I&#39;m the head of the science department at the Egidio Feruglio paleontology museum in Patagonia, Argentina, and during the last ten years I&#39;ve focused on the remarkable animal biodiversity of the dinosaur era preserved in Patagonia. My research team has recently discovered fossils of over 20 new species of dinosaurs, crocs, and other vertebrates, revealing new chapters in the history of Patagonia&#39;s past ecosystems.</p>\n\n<p>You can read more about me <a href=\"https://www.nationalgeographic.com/expeditions/experts/diego-pol/\">here</a>. I&#39;ll be on at 12pm ET (16 UT), AMA!</p>\n\n<p>Username: <a href=\"/u/nationalgeographic\">/u/nationalgeographic</a></p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/askscience/comments/q36m27/askscience_ama_series_im_diego_pol_a/",
  "subreddit": "askscience",
  "id": "q36m27",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi! I'm Diego Pol, a paleontologist and National Geographic Explorer who studies\ndinosaurs and ancient crocs. For the last few years, I've been exploring and\ndiscovering dinosaurs in Patagonia, the southern tip of South America. I'm the\nhead of the science department at the Egidio Feruglio…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは！古生物学者であり、ナショナルジオグラフィックの探検家でもあるディエゴ・ポルです。\n古生物学者のディエゴ・ポルです。ここ数年、私は南米の南端にあるパタゴニアで恐竜の調査と発見を行っています。\n南米の南端に位置するパタゴニアで恐竜を発見しています。私は\nエジディオ・フェルリオ大学の科学部の部長を務めています...",
      "title": "AskScience AMAシリーズ。古生物学者でNat Geo ExplorerのDiego Polです。恐竜についてのAMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨！我是迭戈-波尔，一位古生物学家和国家地理探险家，研究\n恐龙和古鳄鱼。在过去的几年里，我一直在探索和\n在南美洲南端的巴塔哥尼亚发现恐龙。我是\n在埃吉迪奥-费鲁格里奥的科学部门的负责人...",
      "title": "AskScience AMA系列。我是迭戈-波尔，一位古生物学家和国家地理探险家。关于恐龙的AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨！我是迭戈-波爾，一位古生物學家和國家地理探險家，研究\n恐龍和古鱷魚。在過去的幾年裏，我一直在探索和\n在南美洲南端的巴塔哥尼亞發現恐龍。我是\n在埃吉迪奧-費魯格里奧的科學部門的負責人...",
      "title": "AskScience AMA系列。我是迭戈-波爾，一位古生物學家和國家地理探險家。關於恐龍的AMA!"
    }
  ]
}