{
  "author": "vulturepants",
  "the_new_excerpt": "Sometimes I’ll be ready to go to sleep but i have to get up 4 or 5 times (or\nmore) to go pee the tiniest amount because i can’t fall asleep if i have even\nthe slightest feeling of needing to pee. i’m just curious if anyone else has\nthis. I’m female for reference, not sure if that makes a difference.…",
  "original_created_utc": 1619838446,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "寝ようと思っても、ほんの少しのおしっこのために4、5回（またはそれ以上）起きなければならないことがあります。\nわずかな量のおしっこに行くために4、5回（またはそれ以上）起きなければなりません。\n少しでもおしっこがしたいと思うと眠れないからです。\nこれは 参考までに私は女性ですが、違いがあるかどうかはわかりません....",
      "title": "少しでもオシッコをしたいと思うと、寝付けない人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有时我准备睡觉，但我不得不起来4或5次（或更多）去尿尿，因为如果我有哪怕是一点点尿，我就无法入睡。\n因为如果我有哪怕是最轻微的尿意，我都无法入睡。\n我只是想知道是否有其他人有这种情况。\n这种情况。我是女性，供参考，不知道这是否有区别....。",
      "title": "还有人在要小便的情况下无法入睡吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有時我準備睡覺，但我不得不起來4或5次（或更多）去尿尿，因爲如果我有哪怕是一點點尿，我就無法入睡。\n因爲如果我有哪怕是最輕微的尿意，我都無法入睡。\n我只是想知道是否有其他人有這種情況。\n這種情況。我是女性，供參考，不知道這是否有區別....。",
      "title": "還有人在要小便的情況下無法入睡嗎？"
    }
  ],
  "title": "Is anyone else not able to fall asleep if you have to pee even the tiniest bit?",
  "created_utc": 1619876376,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sometimes I’ll be ready to go to sleep but i have to get up 4 or 5 times (or more) to go pee the tiniest amount because i can’t fall asleep if i have even the slightest feeling of needing to pee. i’m just curious if anyone else has this. I’m female for reference, not sure if that makes a difference. i’ve thought about mentioning this to my gynecologist next time i see her but i’m not sure if it’s an actual medical thing or just a weird quirk.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/n29sq5/is_anyone_else_not_able_to_fall_asleep_if_you/",
  "subreddit": "TooAfraidToAsk",
  "id": "n29sq5",
  "is_self": true,
  "media": null,
  "is_video": false
}