{
  "author": "wists",
  "original_created_utc": 1631809714,
  "title": "Would you be prepared to hold through another 'Crypto Winter'?",
  "created_utc": 1631820651,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If everything fell by 90% and didn&#39;t show signs of recovering, would you panic and chuck in the lot, or would you treat it as an opportunity to buy?</p>\n\n<p>Would you have the stomach to watch your investment drain away and keep putting money into something showing few signs or life?</p>\n\n<p>Hindsight makes mid 2018-2019 look like the opportunity of a lifetime, but I imagine it wasn&#39;t the most pleasant of experiences for those who bought in 2017 and early 2018.</p>\n\n<p>What would you do if we saw such a drop and a declining market?</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/ppgoc1/would_you_be_prepared_to_hold_through_another/",
  "subreddit": "CryptoCurrency",
  "id": "ppgoc1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If everything fell by 90% and didn't show signs of recovering, would you panic\nand chuck in the lot, or would you treat it as an opportunity to buy?\n\nWould you have the stomach to watch your investment drain away and keep putting\nmoney into something showing few signs or life?\n\nHindsight makes mid…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、すべてのものが90％下落し、回復の兆しがないとしたら、あなたはパニックになって、その土地を捨てるでしょうか？\n慌てて投げ出すでしょうか、それとも買い時と考えるでしょうか。\n\n投資したものが消えていくのを見て、生きている兆しのないものにお金を投入し続ける勇気がありますか？\n投資したものが消えていくのを見て、生き生きとした兆しのないものに資金を投入し続けることができるだろうか？\n\n後悔先に立たずですね。",
      "title": "もう一つの \"Crypto Winter \"を乗り切る覚悟はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果所有的东西都下跌了90%，而且没有恢复的迹象，你是会惊慌失措地扔掉这些东西呢？\n扔掉这批货，还是把它当作一个买入的机会？\n\n你会忍心看着你的投资流失，而继续把钱投入到没有什么迹象或生命力的东西上吗？\n钱投入一个几乎没有迹象或生命力的东西？\n\n事后诸葛亮",
      "title": "你是否准备在另一个 \"加密货币的冬天 \"中持有？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果所有的東西都下跌了90%，而且沒有恢復的跡象，你是會驚慌失措地扔掉這些東西呢？\n扔掉這批貨，還是把它當作一個買入的機會？\n\n你會忍心看着你的投資流失，而繼續把錢投入到沒有什麼跡象或生命力的東西上嗎？\n錢投入一個幾乎沒有跡象或生命力的東西？\n\n事後諸葛亮",
      "title": "你是否準備在另一個 \"加密貨幣的冬天 \"中持有？"
    }
  ]
}