{
  "author": "elgeeQuid",
  "original_created_utc": 1626613727,
  "title": "Help free Zimbabwe",
  "created_utc": 1626677288,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys. I&#39;ve got a few questions I&#39;d like to ask about bitcoin and crypto exchange.\nI&#39;m from Zimbabwe (yes the country with trillion dollar notes). And it&#39;s no secrete we have a corrupt and dictatorship government here.our currency is worthless and as Zimbabweans we cannot shop online as our gvt won&#39;t have foreign currency to pay out of Zim. So here is my questions</p>\n\n<p>1). Is there a way our government can just Create a cryptocurrency exchange and just adopt bitcoin as main currency. That way at least we can buy stuff online using bitcoin and they still get their tax as they include it in transaction charges.</p>\n\n<p>2). Is there a way an exchange can be created and run in Zimbabwe but be registered with a foreign bank. That way our government will not have control. For instance, can a Mexican buy crypto and pay for it at an American bank.</p>\n\n<p>I know this my sound like stupid questions but I&#39;d really like to enlightend on this.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/omq7gv/help_free_zimbabwe/",
  "subreddit": "Bitcoin",
  "id": "omq7gv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi guys. I've got a few questions I'd like to ask about bitcoin and crypto\nexchange. I'm from Zimbabwe (yes the country with trillion dollar notes). And\nit's no secrete we have a corrupt and dictatorship government here.our currency\nis worthless and as Zimbabweans we cannot shop online as our gvt…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、皆さん。ビットコインと暗号化について、いくつか質問したいことがあります。\n交換についてです。私はジンバブエ出身です（そう、1兆ドル札のある国です）。そして\n腐敗した独裁政権であることは周知の事実だよ。\n私たちの通貨は価値がなく、ジンバブエ人としてオンラインで買い物をすることができません、政府は...",
      "title": "ヘルプフリー・ジンバブエ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，伙计们。我有几个问题想问一下关于比特币和加密货币的\n兑换。我来自津巴布韦（是的，那个拥有万亿纸币的国家）。而且\n我们这里有一个腐败和独裁的政府，这已经不是什么秘密了。\n我们的货币一文不值，作为津巴布韦人我们不能在网上购物，因为我们的政府...",
      "title": "帮助解放津巴布韦"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，夥計們。我有幾個問題想問一下關於比特幣和加密貨幣的\n兌換。我來自津巴布韋（是的，那個擁有萬億紙幣的國家）。而且\n我們這裏有一個腐敗和獨裁的政府，這已經不是什麼祕密了。\n我們的貨幣一文不值，作爲津巴布韋人我們不能在網上購物，因爲我們的政府...",
      "title": "幫助解放津巴布韋"
    }
  ]
}