{
  "author": "killawaspattack",
  "original_created_utc": 1636483904,
  "title": "How to crypto, a guide for people just starting and some info for all",
  "created_utc": 1636533518,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, Hope your having a good week. \nSo see a lot of the same questions on this sub in posts and in the daily, so I decided to make this to try to help all the newbies. Maybe others will learn too so lets get straight into it. </p>\n\n<p><strong>TLDR</strong>\nToo long didn&#39;t read, a quick look at what the post is about ;)</p>\n\n<p><strong>DYOR</strong>\nFirstly we hear do your own research a lot and the obvious question of how and were to start. One of the main websites (as there is just so many) that people use daily <a href=\"https://coinmarketcap.com/\">Coinmarketcap</a> a great start for a lot, here you can get daily news updates, check out a coin and associated website which is very useful and you get log in bonuses. If you are brand new, what I did is learned the base info about crypto and blockchain through YouTube, just be carful and don&#39;t listen to coin maxers who are just looking to make money, your here just to gain knowledge. I used to watch someone called Kubera on his old channel but most about crypto/blockchain videos are good. Always good to check the general consensus on this sub, you can look into the specific subs for a coin although obviously this is going to be a heavily bias view. \nHave been pointed to the following for amazing help on <a href=\"https://coingeko.com/\">coingecko</a> In fact both those defi books that you can get with candies are a great reading material.\n<a href=\"https://academy.binance.me/en\">binance academy</a>, great videos pretty informative;\ncoin bureau, everyone here knows and recommend this YouTube guy and I have seen a lot too very good videos.</p>\n\n<p><strong>Wallets</strong>\nSo you can download wallet app&#39;s (only use very well known apps on android), use an exchange and even most exchanges have their own separate wallets, cold and hot wallets even paper wallets. So lets break it down Hot wallets are kept online and connected to the internet like apps and the exchange wallets, browsers wallets like MetaMask and cloud storage wallets like wax wallet or cloud wallet (not ones I have used). Cold Storage is offline storage like paper and hardware wallets (Trezor and Ledger). So these are stored offline with more limited access than hot as that is always online. Cold is the safest by far but come with the risk of losing the seed phrase, or piece of paper. If you loose a hardware wallet you can replace and load it back up with your seed phrase so very handy. FYI you can get a engraver quite cheap get a small piece of metal and engrave seed phrases for a durable solution. In the past <em>not your keys not your coins</em> was a huge issue due to the Mt. Gox hack but this is getting less important with the proper exchanges now. Personally if your playing with upto a few thousand then exchanges are fine but once you start to accumulate more unless you trade a lot, it would be a good idea to invest in a Hardware wallet for the safety at least. Things like the online wallets are fine to learn as you go BUT always double and triple check EVERYTHING when sending funds around maybe do a little bit for the first time just to cover yourself, not a week goes by without seeing someone say they got a bit wrong and that&#39;s it the funds are gone. </p>\n\n<p><strong>Tracking your Portfolio</strong>\nSo when I started it was very easy to open the one account I had and see exactly how much I own and the spread but over time I used more wallets. Before I knew it I had 3 different Hot wallets as well as 3 different exchanges I was using (one is best for staking one is to try and get a card soon and one just purely for buy and send or hold). So what could be done, if you create an account on coinmarketcap you can input all the information here and use this to track your portfolio very well, an added bonus is you get daily redeemable of crystals that can be used for rewards. Coingeko does the same they have candies as the daily. Always good to keep an eye on the rewards as they have NFT&#39;s, discounts on items and equipment plus lots more. Also you can create a live spreadsheet on excel to track the prices from coinmarkt or coingeko but it is a little difficult if your not a wiz with excel. their was one posted by <a href=\"/u/fly115\">u/fly115</a> but I don&#39;t know it is ok to use I have been for the live prices but I manually enter everything.  </p>\n\n<p><strong>Market Cap</strong>\nSo market cap is the current supply of coins times the price of the coin. It no way reflects the coins potential as plenty of coins can have a large market cap if they have a very large supply/lots of funds in at the start, also this means with a very large supply the market cap could also reflect a barrier in the price. Lets look at a couple of examples: so Bitcoin first current price $48,500 current supply 18,793,962 Current market $911,507,157,000. then also fully diluted market cap using the Max supply if it has one so $48,500 x max supply 21,000,000 = $1,018,500,000,000. Over 1 trillion market cap on max supply. now lets look at look at Shiba (Not against it at all but just to show) they have a current supply of 394,796Billion current price $0.00000819 market cap $3,233,379,240,000 yes 3 billion market cap. As you can see it would be almost impossible for shiba to ever even be worth 1c let alone $1 as this would give it a jump in market cap 3x that of bitcoin. It gets a bit confusing as most places talk about it with companies and stock and then say <em>but with crypto its a bit different</em> <a href=\"https://www.coinbase.com/learn/crypto-basics/what-is-market-cap\">Coinbase basics</a> has a good explanation.</p>\n\n<p><strong>DeFi Decentralised Finance</strong>\n In short instead of a bank being in charge of your money and what they say goes like not allowing you to withdraw over a certain amount, freezing funds/accounts and just being in total control. Decentralise finance is no one person or entity being able to control the money. Now DeFi is the term to cover a whole host of decentralization like yield farming, liquidity mining, decentralized exchanges, lending and wrapped coins. A great article to read if you are interested in this is <a href=\"https://www.coindesk.com/what-is-defi\">Coin Desk&#39;s What is DeFi</a>. This covers everything you would need to know and more. </p>\n\n<p><strong>POW/POS</strong>\nProof of work is the process of using computational power to solve complex mathematical problems to mine blocks (Hash Power). So a lot of power and a lot of graphics cards to run a program that is mining for rewards. the issue is you are competing with everyone who is also mining and people could do so for ages and not get a penny, if they do not have enough hash power. POS adding funds to a pool/wallet for rewards based on the percent you holding in the pool/wallet. Your giving your funds to be able to mine the blocks for further rewards and these are distributed to everyone in the pool or given a fixed rate in a wallet. Quite the consensus that POS is the way forward due to the amount of power used for POW so not environmentally friendly.  </p>\n\n<p><strong>Staking</strong> \nIf you went further into DeFi you may have covered this but in a nutshell the process of staking is earning rewards for holding crypto, think of it as a savings account but without the ridiculously low APY. This is one of the reasons why I use Kraken as you can stake a lot more on here then other exchanges available to me. If your holding a coin that you can get a reward for holding, then why not Stake it and let it grow. \nAn Addition here Liquidity POS that has evolved form the delegated POS. <a href=\"https://opentezos.com/tezos-basics/liquid-proof-of-stake/\">Tezos</a> has developed LPoS, an evolution of DPoS idea. The current version, in the Florence protocol is &quot;Emmy+&quot; [10]. In LPoS, a validator is called a &quot;baker&quot; or an &quot;endorser&quot;. As opposed to DPoS, any user can become a validator if he has enough coins. If he doesn&#39;t, then he has the choice to delegate. The idea is to dilute even more the activity and to increase inclusion. The focus is more on governance liquidity rather than the network&#39;s scalability.</p>\n\n<p><strong>NFT&#39;s</strong>\nNone Fungible tokens, so what does that actually mean well fungible tokens are Dollars, Pound, and Bitcoin all have a common valuation (so everyone knows the price) none fungible tokens are more like a Picasso so they would have a unique value that can and does change depending on how much someone is willing to spend on it. So NFT&#39;s would be unique pieces of digital art or unique digital assets you can&#39;t trade them for other NFT&#39;s too. Now just like any art they can be copied yet the original will be the only one that has been minted and therefore cemented on the blockchain as a unique asset. I actually have said in the past I would never buy one but after putting some time into learning about NFT&#39;s I would love to own a couple.</p>\n\n<p><strong>Community Points</strong> \nWe have Moons as a community incentive for <a href=\"/r/cryptocurrency\">r/cryptocurrency</a> on the Karma you earn within the sub. make sure you have set up your wallet on the mobile app and you can start to receive these but also if you are a fortnight fan you can head on to <a href=\"/r/fortnitebr\">r/fortnitebr</a> and earn bricks for karma and then one more <a href=\"/r/ethtrader\">r/ethtrader</a> for donuts but these are already on mainnet and you have to set up a MetaMask or Trust wallet for the distributions (and you have to pay gas but usually not a lot unless in peak) but there is a way to get the distributions for free on Xdai all in explained in the sidebar on their page. I follow <a href=\"/u/communitypoints\">u/communitypoints</a> to keep updated on the distribution lists very handy. </p>\n\n<p>For the real new to crypto people a great start is <a href=\"/r/bitcoinbeginners\">r/bitcoinbeginners</a> and <a href=\"https://bitcoin.org/en/getting-started\">Bitcoin.org getting started</a></p>\n\n<p>Check out all the latest news from Ethereum at <a href=\"https://ethereum.org/en/what-is-ethereum/\">Ethereum.org</a></p>\n\n<p>The 2 best crypto news and market pages earn your daily diamonds and candies <a href=\"https://coinmarketcap.com/\">Coin Market Cap</a> <a href=\"https://coingeko.com/\">Coin Geko</a>. </p>\n\n<p>Just news <a href=\"https://coindesk.com\">Coin Desk</a> but again make sure you fact check info here as I have heard it isn&#39;t always 100%.</p>\n\n<p>Keep an eye on the gas price to ensure your never transferring at peak again <a href=\"https://ethereumprice.org/gas/\">Ethereum Gas</a></p>\n\n<p>Hardware wallets <a href=\"https://trezor.io/\">Trezor</a> and <a href=\"https://www.ledger.com/\">Ledger</a></p>\n\n<p><a href=\"https://Brave.com\">Brave browser</a> earn BAT for your browsing and easy to use with <a href=\"https://metamask.io\">Metamask</a> and I really like the wallet. </p>\n\n<p>Lastly check out all the links on the top of the daily discussion including the <a href=\"/r/CryptoCurrencyMeta\">r/CryptoCurrencyMeta</a> for the governance polls to this sub </p>\n\n<p>I hope you like my little guide please leave a comment if you would like me to add any sections and I will update, have a great rest of the week. Take care</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/ehupqy7WdAvlmVL4vtLRjBLLd5SddqQM1SsfO0AwPao.jpg?auto=webp&s=17a15a2a0861f93f597a1c798394f0087b70d3f0",
          "width": 600,
          "height": 315
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/ehupqy7WdAvlmVL4vtLRjBLLd5SddqQM1SsfO0AwPao.jpg?width=108&crop=smart&auto=webp&s=cbe6f8e7ae5f056ce6d9543e3c2fc5a4e0b9d542",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/ehupqy7WdAvlmVL4vtLRjBLLd5SddqQM1SsfO0AwPao.jpg?width=216&crop=smart&auto=webp&s=5159c2981f72d4b7a1d513b789715d09af9c745c",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/ehupqy7WdAvlmVL4vtLRjBLLd5SddqQM1SsfO0AwPao.jpg?width=320&crop=smart&auto=webp&s=ea98bd5918d7c16f51bd8e018f5fa5beb66eb3f1",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "2CglEyeRDgHuG1rCoeOwM7On4SgUk4WbdvFYrwIEeok"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qqagjm/how_to_crypto_a_guide_for_people_just_starting/",
  "subreddit": "CryptoCurrency",
  "id": "qqagjm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi all, Hope your having a good week. So see a lot of the same questions on this\nsub in posts and in the daily, so I decided to make this to try to help all the\nnewbies. Maybe others will learn too so lets get straight into it.\n\nTLDR Too long didn't read, a quick look at what the post is about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは！今週もよろしくお願いします。このサブ記事やデイリーで同じような質問をたくさん見かけます。\nそこで、初心者の皆さんのお役に立てればと思い、これを作成することにしました。\n初心者の皆さんのお役に立てればと思います。多分、他の人も勉強になると思うので、早速始めてみましょう。\n\nTLDR 長すぎて読めませんでしたが、記事の内容を簡単に見てみると...",
      "title": "How to crypto, 始めたばかりの人のためのガイドとすべての人のための情報"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，希望你们这周过得愉快。我在这个网站上看到了很多相同的问题。\n子的帖子和日报中，所以我决定做这个，以尝试帮助所有\n新手。也许其他人也会学到，所以让我们直接进入主题。\n\nTLDR 太长了，没看完，快速看一下帖子的内容......",
      "title": "如何进行加密，为刚开始的人提供指南，为所有人提供一些信息"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，希望你們這周過得愉快。我在這個網站上看到了很多相同的問題。\n子的帖子和日報中，所以我決定做這個，以嘗試幫助所有\n新手。也許其他人也會學到，所以讓我們直接進入主題。\n\nTLDR 太長了，沒看完，快速看一下帖子的內容......",
      "title": "如何進行加密，爲剛開始的人提供指南，爲所有人提供一些信息"
    }
  ]
}