{
  "author": "PickleRick1001",
  "original_created_utc": 1636036156,
  "title": "How do professional historians explain the causes of the Shia-Sunni schism in Islam? Are there socio-economic causes for it?",
  "created_utc": 1636093165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was raised Shi&#39;ite*, so what I was taught growing up was that Ali was appointed the successor by Muhammad, but there was a coup by Umar and Abu Bakr after the Prophet&#39;s death, denying Ali his rightful inheritance, so to speak. And then after some time, the first Ummayad Caliph, Mu&#39;auiyah** killed Hussein (son of Ali, grandson of Muhammad, fourth Shi&#39;ite Imam) in the battle of Karbala, thereby sealing the schism &quot;with the blood of the Prophet&#39;s grandchildren&quot;, as it was dramatically put. Some more stuff happened in between and afterwards, but thats the gist of the Twelver Shi&#39;ite narrative as I understood it growing up.</p>\n\n<p>On the other hand, there is the Sunni or orthodox narrative, which is much more common. From what I understand, the story goes: Muhammad dies, Abu Bakr gets elected Caliph; Abu Bakr appoints Umar as his successor, who is succeeded by Uthman, then Ali. After Ali, the Ummayads take over, and the rest is history. Or at least, there is some agreement between the two sects over the big picture after this point.</p>\n\n<p>So, to my main question: what&#39;s the historical explanation for all this? How do historians reconcile these two narratives? Or do they give more weight to the Sunni narrative, considering 90% of Muslims are Sunni? Most academic work I&#39;ve seen takes the latter position, which makes sense to me. Is this a correct understanding of the work being done in this field?</p>\n\n<p>Second, the way these narratives are told traditionally seems to me to emphasise the importance of personality, or morality, or some later religious or political position. In other words, these seem more like myths than historical sources. So what are the social, economic, and political causes for the schism?</p>\n\n<p>*I am no longer religious, but I mention this to explain my premise. Also, I mean Twelver Shi&#39;ite, or Ja&#39;afari Shi&#39;ite, who are the largest branch of Shi&#39;ites iirc.</p>\n\n<p>**I have no idea if this is the right transliteration.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qmltmd/how_do_professional_historians_explain_the_causes/",
  "subreddit": "AskHistorians",
  "id": "qmltmd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was raised Shi'ite*, so what I was taught growing up was that Ali was\nappointed the successor by Muhammad, but there was a coup by Umar and Abu Bakr\nafter the Prophet's death, denying Ali his rightful inheritance, so to speak.\nAnd then after some time, the first Ummayad Caliph, Mu'auiyah** killed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はシーア派（※）で育ったので、子供の頃に教えられたのは、「アリはムハンマドから後継者に指名されたが\nムハンマドによって後継者に指名されたが、預言者の死後、ウマルとアブ・バクルによるクーデターが起きた。\n預言者の死後、ウマルとアブ・バクルがクーデターを起こし、アリの正当な継承権を否定したというものです。\nそしてしばらくして、ウンマヤド朝の初代カリフであるムアイーヤ**が殺害した...。",
      "title": "イスラム教のシーア派とスンニ派の分裂の原因を、プロの歴史家はどのように説明するのか？社会経済的な原因があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是在什叶派长大的，所以我在成长过程中所接受的教育是：阿里是穆罕默德指定的继承人。\n继承人，但在先知去世后，欧麦尔和艾布-伯克尔发生了政变。\n但在先知去世后，欧麦尔和艾布-伯克尔发动政变，剥夺了阿里的合法继承权，可以这么说。\n然后过了一段时间，第一任欧麦德哈里发穆阿伊亚**杀了...",
      "title": "专业历史学家如何解释伊斯兰教中什叶派和逊尼派分裂的原因？是否有社会经济方面的原因？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是在什葉派長大的，所以我在成長過程中所接受的教育是：阿里是穆罕默德指定的繼承人。\n繼承人，但在先知去世後，歐麥爾和艾布-伯克爾發生了政變。\n但在先知去世後，歐麥爾和艾布-伯克爾發動政變，剝奪了阿里的合法繼承權，可以這麼說。\n然後過了一段時間，第一任歐麥德哈里發穆阿伊亞**殺了...",
      "title": "專業歷史學家如何解釋伊斯蘭教中什葉派和遜尼派分裂的原因？是否有社會經濟方面的原因？"
    }
  ]
}