{
  "author": "hshshsheueyey",
  "original_created_utc": 1653996214,
  "title": "Girlfriend opening about her past relationships?",
  "created_utc": 1654006775,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So we’ve been dating for around 8 months and my girl throughout never mentioned that she had been with any guy before me. She pretended to know nothing about sex and relationships. Now all of a sudden she disclosed everything. She has dated multiple guys and has been sexually active ever since. I don’t want to be a narrow minded guy but it’s kinda traumatic because I feel cheated. What if she has told many more lies which I assumes to be true as of now. What if she’s using me too. What’s your humble take on it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 138,
  "permalink": "/r/TooAfraidToAsk/comments/v1o0m5/girlfriend_opening_about_her_past_relationships/",
  "subreddit": "TooAfraidToAsk",
  "id": "v1o0m5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So we’ve been dating for around 8 months and my girl throughout never mentioned\nthat she had been with any guy before me. She pretended to know nothing about\nsex and relationships. Now all of a sudden she disclosed everything. She has\ndated multiple guys and has been sexually active ever since. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、私たちは約8ヶ月間付き合ったが、私の女の子はずっとそのことを言わなかった。\nをしたことがない。彼女は、セックスや恋愛について何も知らないふりをし\nセックスや恋愛について何も知らないふりをしていた。それが突然、全てを打ち明けたんだ。彼女はこれまで\n複数の男とデートし、それ以来、性的に活発である。I...",
      "title": "ガールフレンドが過去の恋愛を暴露？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我们已经约会了大约8个月，我的女孩自始至终都没有提到\n她在我之前曾和任何男人交往过。她假装对性和关系一无所知。\n性和关系。现在，她突然透露了一切。她已经\n与多个男人约会，并且从那时起就开始性生活活跃。I...",
      "title": "女友公开她过去的关系？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我們已經約會了大約8個月，我的女孩自始至終都沒有提到\n她在我之前曾和任何男人交往過。她假裝對性和關係一無所知。\n性和關係。現在，她突然透露了一切。她已經\n與多個男人約會，並且從那時起就開始性生活活躍。I...",
      "title": "女友公開她過去的關係？"
    }
  ]
}