{
  "author": "nobjos",
  "the_new_excerpt": "I had posted the previous picks from my program and my analysis here and the\nresponse I received was amazing. I have been working on improving the program\nand have made the program public. If you have seen the previous posts, please\nfeel free to skip to the DD.\n\nHow does it work: The program is…",
  "original_created_utc": 1615552733,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我曾在这里发布过我之前的选秀节目和我的分析，并在这里发布了\n我收到的回应是惊人的。我一直在努力改进这个程序\n并已将程序公开。如果您看到之前的帖子，请\n随意跳到DD。\n\n它是如何工作的。这个程序是...",
      "title": "我分析各社交媒体对股票的提及率和情绪，来寻找上涨的股票! 本周涨幅最高的股票及其DD：$RKT"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾在這裏發佈過我之前的選秀節目和我的分析，並在這裏發佈了\n我收到的迴應是驚人的。我一直在努力改進這個程序\n並已將程序公開。如果您看到之前的帖子，請\n隨意跳到DD。\n\n它是如何工作的。這個程序是...",
      "title": "我分析各社交媒體對股票的提及率和情緒，來尋找上漲的股票! 本週漲幅最高的股票及其DD：$RKT"
    }
  ],
  "title": "I analyze mentions and sentiment of stocks across social media to find rising stocks! This week's top growing stock and its DD: $RKT",
  "created_utc": 1615559214,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had posted the previous picks from my program and my analysis here and the response I received was amazing. I have been working on improving the program and <strong>have made the program public</strong>. If you have seen the previous posts, please feel free to skip to the DD.</p>\n\n<p><strong>How does it work:</strong> The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth.</p>\n\n<p>Here is the stock picked by the program and my DD</p>\n\n<p><strong>Stock: Rocket Companies ($RKT)</strong></p>\n\n<p>Week on Week increase in mentions: 2332%</p>\n\n<p>Month on Month increase in mentions: 1265.1%</p>\n\n<p>Average sentiment across mentions: +14.2%</p>\n\n<p><strong>Core Product</strong></p>\n\n<p>Rocket is headquartered in Detroit and was founded in 1985. Their business model involves much more than just rapidly processing mortgages. They leverage analytics to provide real-time quotes to clients and provides end-to-end visibility into their transactions. </p>\n\n<p>Rocket operates both a direct-to-consumer business and a partner network which expands the platform’s reach.  Their major divisions include:</p>\n\n<p><strong>Rocket Mortgage:</strong> This is Rocket’s main division which contributes to the bulk of its revenue. They are the largest mortgage lender in the US closing more than $1 Trillion in home loans since their inception.</p>\n\n<p><strong>Rocket Homes:</strong> Online home search platform and real estate agent referral network.</p>\n\n<p><strong>Rocket Auto:</strong> An asset-light auto sales platform.</p>\n\n<p><strong>Rocket Loans:</strong> Personal loan platform that operates similar to the core mortgage business.</p>\n\n<p><strong>Amrock:</strong> Amrock provides title insurance, property valuations, and settlement services. </p>\n\n<p>Although only less than 10% of the revenue is generated from their non-core businesses, these products have the potential to grow faster than traditional mortgage in the future. Their ultimate aim is to provide a one-stop ecosystem for a wide range of financial products. </p>\n\n<p><strong>Financials</strong></p>\n\n<p>Rocket, like other mortgage companies, had a stellar year in 2020 and it reflects in its financials. </p>\n\n<p>Revenue increased 144% y-o-y to $4.7 Billion in their fourth quarter and net income increased 277% to $2.8 Billion. They also announced a special dividend of $1.11 per share. In FY’20 they had $320 Billion in loan originations with total revenue of $15.7 Billion (208% increase). Their net income for 2020 was $9.3B (948% more than 2019). They have a very strong cash position with total liquidity of $7.7 Billion. </p>\n\n<p>Rocket also increased gain on sale margin by 100 basis points year-over-year to 4.41%. Rocket Auto, their retail marketplace facilitated the sale of 9,400 auto units - Up more than 2,000 units as compared to the fourth quarter of 2019. Rocket homes assisted their clients with $1.6 B real estate transactions just in Q4’20. </p>\n\n<p><strong>Potential and Hype Factors</strong></p>\n\n<p><strong>Interest rates:</strong> The Fed is currently pumping an insane amount of money into the economy and holding the interest rates down. The current interest rates are some of the lowest ever in recent history. Almost everyone who has a mortgage is refinancing it since the rates have basically halved over the past year. </p>\n\n<p><strong>Covid and Stay at home restrictions:</strong> Rocket is currently the leading provider of online mortgages. Given that a large majority of people are currently stuck at home/unwilling to go out, if they want to refinance their loans, Rocket would end up as their primary option. This is accelerated as more and more young people who prefer online marketplaces start buying their houses. </p>\n\n<p><strong>Customer retention:</strong> Rocket has amazing customer service (Predominantly due to their company culture, AKA ‘<a href=\"https://www.myrocketcareer.com/About-Us/Our-Philosophies\">ISMs</a>’) with a client retention rate of 92%. Their recapture rates were 82% for refinance transactions. This is an important metric since Rocket is foraying into other sectors such as homes and auto and will easily be able to cross-sell their products. </p>\n\n<p><strong>Risk and Competition</strong> </p>\n\n<p>The main risks associated with Rocket are</p>\n\n<p><strong>Mortgage rates:</strong> The current refinancing boom is due to rock bottom mortgage rates. Any substantial increase in these rates would drastically affect both the revenue and the bottom line of the company. The company’s short-term prospects are almost completely dependent on the Fed. </p>\n\n<p><strong>Sale Margins:</strong> The current jump in the margin for Rocket is predominantly due to the low mortgage rates as well as the huge demand for refinancing the mortgages. This led to loan originators restricting the demand by not decreasing their offered rates in line with their funding costs, which enabled them to improve their sale margins.</p>\n\n<p><strong>Internal ownership:</strong> The open market holds less than 10% of the total shares. So, if the insiders convert and sell even 10% of the ownership, the outstanding shares will double and can cause the stock price to drop.</p>\n\n<p><strong>UWMC’s Announcement:</strong> UWMC during a recent event announced that it would no longer work with real estate brokers doing business with Rocket Companies. The full and long-term impact of this announcement is not yet clear and can impact Rocket adversely in the near future. </p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>I deliberately left out the short interest and the short squeeze play as I believe it would be extremely difficult to time it if it ever happens. Rocket, with its emphasis on technology and outstanding customer service, is in a good position to gain market share in the mortgage market. On the flip side, the company is heavily dependent on the mortgage rates and on how long the refinancing boom would continue. I believe the company is undervalued given the explosive growth in revenue and future prospects of all their associated platforms! </p>\n\n<p><em>Disclaimer: I am not a financial advisor. Please do your own extensive research before investing in any stock.</em></p>\n</div><!-- SC_ON -->",
  "score": 242,
  "permalink": "/r/stocks/comments/m3gpc3/i_analyze_mentions_and_sentiment_of_stocks_across/",
  "subreddit": "stocks",
  "id": "m3gpc3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381389
}