{
  "author": "sgmwai",
  "original_created_utc": 1653146649,
  "title": "How hard is it to quit opiates/narcotics cold turkey?",
  "created_utc": 1653167919,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Currently going through the first 24hrs of withdrawal. I don&amp;#39;t think I&amp;#39;ve reached peak symptoms yet I&amp;#39;m pretty uncomfortable and my mind keeps rationalizing giving in to the cravings. If anyone has gone through this before please share what you did to make it through and how long till the symptoms subside. I really want to break dependance my whole life is going to shit. Completely alone here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/uupd2n/how_hard_is_it_to_quit_opiatesnarcotics_cold/",
  "subreddit": "TooAfraidToAsk",
  "id": "uupd2n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Currently going through the first 24hrs of withdrawal. I don't think I've\nreached peak symptoms yet I'm pretty uncomfortable and my mind keeps\nrationalizing giving in to the cravings. If anyone has gone through this before\nplease share what you did to make it through and how long till the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、禁断症状の最初の24時間を過ごしています。まだピークに達していないようですが\nまだピーク症状には達していないと思いますが、かなり不快で、私の心は欲求に負けることを合理化し続けています。\n欲望に負けることを合理化しています。どなたか経験されたことのある方がいらっしゃいましたら\nどんな方法で切り抜けたのか、禁断症状が出るまでどのくらいかかるのか、教えてください。",
      "title": "アヘン／麻薬の禁断症状はどのくらい難しいか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前正在经历戒断的第一个24小时。我不认为我已经达到了\n我还没有达到高峰期的症状，但我很不舒服，而且我的大脑一直在合理化地向欲望妥协。\n合理化地屈服于欲望。如果有人以前经历过这种情况\n请分享你是如何度过难关的，以及还有多长时间才会恢复正常。",
      "title": "戒掉阿片类药物/麻醉品冷火鸡有多难？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前正在經歷戒斷的第一個24小時。我不認爲我已經達到了\n我還沒有達到高峯期的症狀，但我很不舒服，而且我的大腦一直在合理化地向慾望妥協。\n合理化地屈服於慾望。如果有人以前經歷過這種情況\n請分享你是如何度過難關的，以及還有多長時間纔會恢復正常。",
      "title": "戒掉阿片類藥物/麻醉品冷火雞有多難？"
    }
  ]
}