{
  "author": "Hands0L0",
  "original_created_utc": 1627089908,
  "title": "Disagreements between the citizenry have caused extreme polarization where it seemed that civil war would certainly result. In your period of focus, what examples exist of such groups becoming so enraged at each other that fell short of civil war, and how did they end up mending their differences?",
  "created_utc": 1627094158,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In short, I&#39;d like to learn how social groups of one country were so far apart on serious issues, but instead of ending up with violence, they eventually worked out a solution over time.</p>\n\n<p>Special thanks to the mods for helping me tailor the topic so that it stays within the rules! Apologies for the previous post!</p>\n</div><!-- SC_ON -->",
  "score": 238,
  "permalink": "/r/AskHistorians/comments/oqg4hi/disagreements_between_the_citizenry_have_caused/",
  "subreddit": "AskHistorians",
  "id": "oqg4hi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In short, I'd like to learn how social groups of one country were so far apart\non serious issues, but instead of ending up with violence, they eventually\nworked out a solution over time.\n\nSpecial thanks to the mods for helping me tailor the topic so that it stays\nwithin the rules! Apologies for the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "要するに、ある国の社会集団が、深刻な問題については大きく離れていたのに、暴力で終わらせるのではなく、最終的にどのようにして\n暴力で終わらせるのではなく、時間をかけて解決していったのかを知りたいのです。\n時間をかけて解決していったのかを知りたいのです。\n\nルールの範囲内でトピックを調整するのを手伝ってくれたモデレーターに感謝します。\nルールの範囲内に収まるようにトピックを調整してくれたモデレーターに感謝します。申し訳ありませんが...",
      "title": "市民の間での意見の相違が極端な偏りを生み、確実に内戦が起こると思われていました。あなたが注目している時代には、そのようなグループがお互いに激怒して内戦に至らなかった例があり、どのようにして仲直りしたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简而言之，我想了解一个国家的社会团体是如何在严重的问题上存在如此大的分歧\n在严重的问题上分歧如此之大，但他们最终没有以暴力收场，而是随着时间的推移\n随着时间的推移，他们最终找到了解决办法。\n\n特别感谢版主帮助我调整主题，使其不超出规则范围。\n在规则之内! 歉意的是...",
      "title": "公民之间的分歧造成了极端的两极分化，似乎一定会导致内战。在你所关注的时期，有哪些例子表明这类群体互相激怒，以至于没有发生内战，他们最终是如何弥补分歧的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡而言之，我想了解一個國家的社會團體是如何在嚴重的問題上存在如此大的分歧\n在嚴重的問題上分歧如此之大，但他們最終沒有以暴力收場，而是隨着時間的推移\n隨着時間的推移，他們最終找到了解決辦法。\n\n特別感謝版主幫助我調整主題，使其不超出規則範圍。\n在規則之內! 歉意的是...",
      "title": "公民之間的分歧造成了極端的兩極分化，似乎一定會導致內戰。在你所關注的時期，有哪些例子表明這類羣體互相激怒，以至於沒有發生內戰，他們最終是如何彌補分歧的？"
    }
  ]
}