{
  "author": "MacchuWA",
  "the_new_excerpt": "I was listening to Peter Frankopan's The Silk Roads the other day, and in a\nchapter on the Black Death, he quoted a contemporary source from England blaming\nthe plague on women's immodesty. The medieval author was complaining about (and\nblaming) women wearing what he called \"extremely short…",
  "original_created_utc": 1614544975,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "前几天我在听彼得-弗兰克潘的《丝绸之路》，在关于黑死病的一章中\n在关于黑死病的一章中，他引用了英国的一个当代资料，指责\n瘟疫归咎于妇女的不端庄。这位中世纪的作者正在抱怨（并指责）妇女穿着他所谓的 \"不体面\"。\n责备）妇女穿着他所谓的 \"极短的......\"。",
      "title": "我对中世纪欧洲人的谦逊有一个完全不准确的描述吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天我在聽彼得-弗蘭克潘的《絲綢之路》，在關於黑死病的一章中\n在關於黑死病的一章中，他引用了英國的一個當代資料，指責\n瘟疫歸咎於婦女的不端莊。這位中世紀的作者正在抱怨（並指責）婦女穿着他所謂的 \"不體面\"。\n責備）婦女穿着他所謂的 \"極短的......\"。",
      "title": "我對中世紀歐洲人的謙遜有一個完全不準確的描述嗎？"
    }
  ],
  "title": "Do I have a completely inaccurate picture of mediaeval European modesty?",
  "created_utc": 1614560991,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was listening to Peter Frankopan&#39;s The Silk Roads the other day, and in a chapter on the Black Death, he quoted a contemporary source from England blaming the plague on women&#39;s immodesty. The medieval author was complaining about (and blaming) women wearing what he called &quot;extremely short garments, which failed to conceal their arses or private parts&quot;.</p>\n\n<p>That jumped out at me, because it sounds like he&#39;s describing something akin to a modern miniskirt, the existence of which in 14th century England would go against everything I thought I understood about standards of modesty and religious sensibilities of the time.</p>\n\n<p>I only have the Audiobook, so I can&#39;t easily pull up the source he&#39;s quoting from, but assuming it&#39;s legit, do I just have a complete misunderstanding of how people dressed in the past? Or is this quote being misapplied or misunderstood? I guess it&#39;s possible the author was referring to prostitutes or some other group to whom modesty standards wouldn&#39;t exactly apply? Anyone know?</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/AskHistorians/comments/lupxoq/do_i_have_a_completely_inaccurate_picture_of/",
  "subreddit": "AskHistorians",
  "id": "lupxoq",
  "is_self": true,
  "media": null,
  "is_video": false
}