{
  "author": "Matty_Cakez",
  "original_created_utc": 1638033526,
  "title": "Who else gets anxiety when transferring crypto?",
  "created_utc": 1638045049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was helping my dad move his crypto from Exodus to his Coinbase so he could trade for a different crypto. I double and triple checked the address then sent the ETH. I didn’t fuck up and successfully moved the ETH. However I had anxiety until the process was completed.</p>\n\n<p>Is anyone working on an exchange or is there an exchange where a common investor can transfer crypto without concern. You see so many stories of “I sent XXX to the wrong address and lost my crypto”. Until it gets a lot easier to move or pay without concern I feel like it won’t be openly accepted.</p>\n</div><!-- SC_ON -->",
  "score": 265,
  "permalink": "/r/CryptoCurrency/comments/r3i2xv/who_else_gets_anxiety_when_transferring_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r3i2xv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was helping my dad move his crypto from Exodus to his Coinbase so he could\ntrade for a different crypto. I double and triple checked the address then sent\nthe ETH. I didn’t fuck up and successfully moved the ETH. However I had anxiety\nuntil the process was completed.\n\nIs anyone working on an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "父が別の暗号を取引できるように、ExodusからCoinbaseに自分の暗号を移すのを手伝っていた。\n別の暗号と交換するために。アドレスを二重三重に確認してから、ETHを送りました。\nETHを送りました。私は失敗せず、ETHの移動に成功しました。しかし、プロセスが完了するまで不安があった。\nプロセスが完了するまで不安がありました。\n\nどなたか、このような作業をされている方はいらっしゃいますか？",
      "title": "暗号を転送するときに不安になる人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在帮助我父亲把他的加密货币从Exodus转移到他的Coinbase，以便他能够\n换一个不同的加密货币。我反复检查了地址，然后发送了\nETH。我没有搞砸，成功转移了ETH。然而，我有一种焦虑感\n直到这个过程结束。\n\n是否有人正在研究一个...",
      "title": "还有谁在转移加密货币时感到焦虑？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在幫助我父親把他的加密貨幣從Exodus轉移到他的Coinbase，以便他能夠\n換一個不同的加密貨幣。我反覆檢查了地址，然後發送了\nETH。我沒有搞砸，成功轉移了ETH。然而，我有一種焦慮感\n直到這個過程結束。\n\n是否有人正在研究一個...",
      "title": "還有誰在轉移加密貨幣時感到焦慮？"
    }
  ]
}