{
  "author": "GordonGekkoVienna",
  "the_new_excerpt": "\"Tesla is under investigation by the California Department of Motor Vehicles\nwith the investigation seeking to determine if Tesla is misleading customers\nwhen it advertises its “full self-driving capability” option.\"\n\nEnron Elon Musk is currently under investigation by the California DMV.…",
  "original_created_utc": 1621338261,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"テスラは、カリフォルニア州自動車局の調査を受けています。\nこの調査は、テスラが顧客を欺いていないかどうかを調べるものです。\n調査は、Teslaが「完全な自動運転機能」オプションを宣伝する際に、顧客を誤解させているかどうかを調べることを目的としています。\"\n\nエンロン・イーロン・マスクは現在、カリフォルニア州DMVの調査を受けている....",
      "title": "カリフォルニア州陸運局、テスラ社の自動運転能力の主張を調査"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"特斯拉正在接受加州机动车管理局的调查\n该调查旨在确定特斯拉在宣传其 \"全功能 \"时是否误导了客户\n当它宣传其 \"完全自动驾驶能力 \"选项时，是否误导了客户。\"\n\n安然-埃隆-马斯克目前正在接受加州车管所的调查....",
      "title": "加州车管所调查特斯拉的自驾游能力说法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"特斯拉正在接受加州機動車管理局的調查\n該調查旨在確定特斯拉在宣傳其 \"全功能 \"時是否誤導了客戶\n當它宣傳其 \"完全自動駕駛能力 \"選項時，是否誤導了客戶。\"\n\n安然-埃隆-馬斯克目前正在接受加州車管所的調查....",
      "title": "加州車管所調查特斯拉的自駕遊能力說法"
    }
  ],
  "title": "California DMV investigates Tesla’s self-driving capability claims",
  "created_utc": 1621346307,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Tesla is under investigation by the California Department of Motor Vehicles with the investigation seeking to determine if Tesla is misleading customers when it advertises its “full self-driving capability” option.&quot;</p>\n\n<p><del>Enron</del> Elon Musk is currently under investigation by the California DMV. The investigation was triggered by correspondence between the agency and a Tesla engineer working on the development of the system. The latter said that Elon was exaggerating on Twitter about the progress of the system. </p>\n\n<p><a href=\"https://www.slashgear.com/california-dmv-investigates-teslas-self-driving-capability-claims-18673252/\">https://www.slashgear.com/california-dmv-investigates-teslas-self-driving-capability-claims-18673252/</a></p>\n\n<p>&quot;For drivers, that could mean their vehicles &quot;could be removed from the public roadway by police officers&quot; should they notice FSD is activated, a DMV spokesperson told the LA Times. Separately, the company is currently facing numerous lawsuits, including allegations of misleading marketing being investigated by the U.S. Consumer Financial Protection Commission (FTC).&quot;</p>\n\n<p><a href=\"https://www.derstandard.at/story/2000126729820/us-untersuchung-gegen-tesla-wegen-musks-behauptungen-zu-self-driving\">https://www.derstandard.at/story/2000126729820/us-untersuchung-gegen-tesla-wegen-musks-behauptungen-zu-self-driving</a> (translated from German to English)</p>\n</div><!-- SC_ON -->",
  "score": 818,
  "permalink": "/r/stocks/comments/nf8jnv/california_dmv_investigates_teslas_selfdriving/",
  "subreddit": "stocks",
  "id": "nf8jnv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804459
}