{
  "author": "beceladon",
  "the_new_excerpt": "I suck at day trading and while generally interested in tech and optimistic\nabout the future of cryptos, my current goal is to make money and save enough\nfor retirement. I stayed away from 99% of cryptos for a long time, the only one\nthat sparked my interest was Nano (which I still hold a bit of).…",
  "original_created_utc": 1621249727,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はデイトレードが苦手で、一般的には技術に興味があり、楽観的ですが\n私の現在の目標は、お金を稼いで老後のために十分な貯蓄をすることです。\n老後のために十分な貯蓄をすることです。長い間、99％のクリプトから遠ざかっていました。\n興味を持ったのはNano（今でも少し保有しています）....",
      "title": "ステイキングの楽しさを知るまでは、暗号には興味がありませんでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不擅长日间交易，虽然总体上对技术感兴趣并对加密货币的未来持乐观态度。\n对加密货币的未来持乐观态度，但我目前的目标是赚钱并为退休储蓄足够的资金。\n储蓄，以便退休。在很长一段时间里，我对99%的加密货币都敬而远之，唯一一个\n激发我兴趣的是纳米（我仍然持有一点）....",
      "title": "我并不关心加密货币，直到我发现押注的乐趣。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不擅長日間交易，雖然總體上對技術感興趣並對加密貨幣的未來持樂觀態度。\n對加密貨幣的未來持樂觀態度，但我目前的目標是賺錢併爲退休儲蓄足夠的資金。\n儲蓄，以便退休。在很長一段時間裏，我對99%的加密貨幣都敬而遠之，唯一一個\n激發我興趣的是納米（我仍然持有一點）....",
      "title": "我並不關心加密貨幣，直到我發現押注的樂趣。"
    }
  ],
  "title": "I didn't care for crypto until I discovered the joys of staking",
  "created_utc": 1621283432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I suck at day trading and while generally interested in tech and optimistic about the future of cryptos, my current goal is to make money and save enough for retirement. I stayed away from 99% of cryptos for a long time, the only one that sparked my interest was Nano (which I still hold a bit of). But lately I found out about staking and how great it is to build passive income with long term investments (what I am good at!). I got myself a bit of ADA, ALGO, and ONE just to try them out. I immediately fell in love, especially with ALGO. I love how easy and intuitive it is. I love that the team behind it as a clear long term strategy and actually tries to keep the price low to avoid pump and dump behaviour. I don&#39;t expect the price to moon any time soon and that&#39;s actually a great thing cause I can just keep buying month after month without FOMO.</p>\n\n<p>So thats me. First post in this sub. A crypto investor, not a trader. 5-10 years horizon at the very least, very curious about where we are headed and what&#39;s the space gonna look like by then. Looking forward to learn and grow with you guys!</p>\n</div><!-- SC_ON -->",
  "score": 417,
  "permalink": "/r/CryptoCurrency/comments/nedc5b/i_didnt_care_for_crypto_until_i_discovered_the/",
  "subreddit": "CryptoCurrency",
  "id": "nedc5b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799672
}