{
  "author": "_DarthBob_",
  "original_created_utc": 1632050011,
  "title": "Is the uncertainty principle basically because at that level, to measure the system you have to interfere with the system somehow?",
  "created_utc": 1632064402,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Basically my question boils down to the fact that to me at least it seems to intuitively make sense that the quantum scale makes measurement hard but I don&#39;t see many people talk about it like this and I&#39;m wondering if I&#39;ve managed to get the wrong end of the stick. </p>\n\n<p>Like if I want to measure a javelin in flight I can use video. There are a crap ton of photons bouncing off it all the time that allow me to see where it is, I record these over multiple frames and bam I&#39;ve got both where it is and where it is going, easy.</p>\n\n<p>Now if we try that same thing again where I&#39;m trying to measure a photon in flight, well now if I was in a well lit stadium like for the javelin, it would seem to me at least to be a bit like trying to measure a snooker ball with another snooker ball with billions of other snooker balls flying around.</p>\n\n<p>Suddenly when you think about it like that then the idea that if I carefully created a lattice of photons with a corresponding detector then if one of the corresponding detectors didn&#39;t end up receiving its photon we could say hey I know it was there but seeing as I&#39;ve blasted it with another photon, I have no clue where it is now. </p>\n\n<p>Given this complexity (if I&#39;ve even got it half right) it seems to me at least like most explanations of quantum experiments at least at the undergrad level don&#39;t really talk about the mechanics of measurement or observation and so it all sounds a lot more spooky and without those bits of info it&#39;s harder for people to reason about. Like the uncertainty principle sounds crazy until you start thinking that the only way to measure is to collide.</p>\n\n<p>Now I realise that even the term collide is potentially a massive over simplification of the interaction of forces at the particle level but I hope it conveys what I see as the problem. </p>\n\n<p>So yeah I had what felt like a flash of insight into what all the the uncertainty principle was explaining but then it seems weird that we just talk about experiments in simplified terms like observation, wave function collapse and kind of avoid talking about what they even mean by that and how they accomplish that. I mean I get that the maths behind quantum mechanics explains what we observe but I mean more about the experimental methods we use to confirm the maths and how we observe the quantum level from a macro level.</p>\n\n<p>So the crux of the question is twofold:</p>\n\n<ol>\n<li><p>Is the uncertainty principle basically because at that level, to measure the system you have to interfere with the system somehow?</p></li>\n<li><p>If that is correct, then it seems like the way we are taught about the experimental proof is very light on how we interfere with quantum scale stuff to try and measure them and I&#39;d love pointers to good science explainer that go into a good level of detail on this</p></li>\n</ol>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/askscience/comments/pr618y/is_the_uncertainty_principle_basically_because_at/",
  "subreddit": "askscience",
  "id": "pr618y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Basically my question boils down to the fact that to me at least it seems to\nintuitively make sense that the quantum scale makes measurement hard but I don't\nsee many people talk about it like this and I'm wondering if I've managed to get\nthe wrong end of the stick.\n\nLike if I want to measure a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的に私の質問は、少なくとも私にとっては、量子スケールが測定を困難にすることは直感的に意味があるように思えます。\n量子スケールが測定を困難にしていることは、直感的に理解できるように思います。\nしかし、多くの人がこのように話しているのを見たことがないので、私が間違った方向に進んでしまったのではないかと思っています。\nと思っています。\n\n例えば、私が測定したいのは...",
      "title": "不確定性原理とは、基本的にそのレベルでは、システムを測定するためには、システムに何らかの形で干渉しなければならないからですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，我的问题可以归结为这样一个事实：至少对我来说，量子尺度使测量变得困难，这似乎在直觉上是有道理的。\n至少在我看来，量子尺度使测量变得困难，这在直觉上是有道理的，但我没有看到很多人这样谈论它。\n但我没有看到很多人这样谈论它，我想知道我是否设法得到了\n错了。\n\n例如，如果我想测量一个...",
      "title": "不确定性原理基本上是因为在这个层面上，为了测量系统，你必须以某种方式干扰系统？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，我的問題可以歸結爲這樣一個事實：至少對我來說，量子尺度使測量變得困難，這似乎在直覺上是有道理的。\n至少在我看來，量子尺度使測量變得困難，這在直覺上是有道理的，但我沒有看到很多人這樣談論它。\n但我沒有看到很多人這樣談論它，我想知道我是否設法得到了\n錯了。\n\n例如，如果我想測量一個...",
      "title": "不確定性原理基本上是因爲在這個層面上，爲了測量系統，你必須以某種方式干擾系統？"
    }
  ]
}