{
  "author": "Tonytonni",
  "original_created_utc": 1633992417,
  "title": "Pay attention to you competitors design",
  "created_utc": 1634030498,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone I would like to share a project I have been working uxanalytic.com. It’s a tool for getting an overview of the major websites/app layouts.</p>\n\n<p>We have broken down digital products into pattern components so that you do have a micro-level view of the building blocks that shape our favorite product such as Netflix and Spotify. The idea is to \nhelp you define what design practices or patterns to add to your own project.</p>\n\n<p>Hopefully this is something for you, feel free to reach out with any suggestions as we want to provide more valuable insight for your design decisions.</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/q67w4u/pay_attention_to_you_competitors_design/",
  "subreddit": "SideProject",
  "id": "q67w4u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey everyone I would like to share a project I have been working uxanalytic.com.\nIt’s a tool for getting an overview of the major websites/app layouts.\n\nWe have broken down digital products into pattern components so that you do have\na micro-level view of the building blocks that shape our favorite…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、私が取り組んでいるプロジェクトuxanalytic.comを紹介したいと思います。\nこれは、主要なウェブサイトやアプリのレイアウトの概要を把握するためのツールです。\n\nデジタル製品をパターン・コンポーネントに分解しているので\nデジタル製品をパターン・コンポーネントに分解して、私たちのお気に入りを形成するビルディング・ブロックをミクロレベルで見ることができるようにしています。",
      "title": "競合他社のデザインに注目する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，大家好，我想分享我一直在做的一个项目uxanalytic.com。\n这是一个用于了解主要网站/应用程序布局概况的工具。\n\n我们将数字产品分解为模式组件，以便你有\n形成我们最喜欢的构件的微观视角......",
      "title": "注意你的竞争对手的设计"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，大家好，我想分享我一直在做的一個項目uxanalytic.com。\n這是一個用於瞭解主要網站/應用程序佈局概況的工具。\n\n我們將數字產品分解爲模式組件，以便你有\n形成我們最喜歡的構件的微觀視角......",
      "title": "注意你的競爭對手的設計"
    }
  ]
}