{
  "author": "coldneck86",
  "original_created_utc": 1648988102,
  "title": "Why do so many black women wear wigs?",
  "created_utc": 1649001755,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For context, I live in the Netherlands, so I&amp;#39;m not sure how it is in other countries but I am assuming is not exclusive from here.&lt;/p&gt;\n\n&lt;p&gt;It seems that many black women wear wigs or fake hair, and there are several shops that focus on this market.\nI don&amp;#39;t know the reason. I guess it can be because of social constructs of beauty not being inclusive of their type of hair, which makes them feel insecure and leads to this. My wife thinks it&amp;#39;s because their hair  sometimes gets really damaged after so many attempts to straight it up...but for me it&amp;#39;s the same root cause (insecurity leading to an attempt to comply to beauty standards).&lt;/p&gt;\n\n&lt;p&gt;But again, I don&amp;#39;t know. So I ask you Reddit: what are the reasons for so many black women doing this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/tv7xlv/why_do_so_many_black_women_wear_wigs/",
  "subreddit": "TooAfraidToAsk",
  "id": "tv7xlv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For context, I live in the Netherlands, so I'm not sure how it is in other\ncountries but I am assuming is not exclusive from here.\n\nIt seems that many black women wear wigs or fake hair, and there are several\nshops that focus on this market. I don't know the reason. I guess it can be\nbecause of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちなみに、私はオランダに住んでいるので、他の国ではどうなのかはわかりません。\nしかし、私はここから排他的ではないと仮定しています。\n\n黒人女性の多くがウィッグや付け毛を付けているようで、いくつかのウィッグショップがあり\nこのマーケットにフォーカスしているショップがあります。理由はわかりません。理由はわかりませんが\nというのも...",
      "title": "なぜ、黒人女性にはウィッグが多いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了说明情况，我住在荷兰，所以我不确定其他国家的情况如何。\n但我认为这并不是这里独有的。\n\n似乎许多黑人妇女都戴假发，而且有几家商店专注于这个市场。\n有几家商店专注于这个市场。我不知道原因是什么。我想这可能是\n因为......。",
      "title": "为什么这么多黑人妇女戴假发？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了說明情況，我住在荷蘭，所以我不確定其他國家的情況如何。\n但我認爲這並不是這裏獨有的。\n\n似乎許多黑人婦女都戴假髮，而且有幾家商店專注於這個市場。\n有幾家商店專注於這個市場。我不知道原因是什麼。我想這可能是\n因爲......。",
      "title": "爲什麼這麼多黑人婦女戴假髮？"
    }
  ]
}