{
  "author": "JunoKat",
  "original_created_utc": 1635583037,
  "title": "Bitcoin and lightning have just done something fiat couldn’t for me",
  "created_utc": 1635593900,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My mom flown all the way from Asia to Europe to see me this morning. She has a prepaid phone with some money in it. All the money got burned the moment she landed because she forgot to turn off data roaming.</p>\n\n<p>She couldn’t recharge the phone as she’s super low tech and now in a foreign country. Luckily, a fellow traveler texted me to let me know she couldn’t contact me at all, not even receiving international calls because the phone is out of cash for roaming.</p>\n\n<p>I went onto bitrefill, chose Vietnam, her mobile provider, input her phone number and recharged her phone with 40k satoshi using Muun wallet. All within 2 minutes. I couldn’t have done this with my credit card because the Asian service provider wouldn’t have accepted my European credit card. I didn’t want to jump through their KYC hoops either. Didn’t have to with bitrefill.</p>\n\n<p>Thank you Bitcoin and lightning developers and community for making communication possible for me and my mom today!</p>\n\n<p>Bitcoin is for global citizens.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/Bitcoin/comments/qixa2x/bitcoin_and_lightning_have_just_done_something/",
  "subreddit": "Bitcoin",
  "id": "qixa2x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My mom flown all the way from Asia to Europe to see me this morning. She has a\nprepaid phone with some money in it. All the money got burned the moment she\nlanded because she forgot to turn off data roaming.\n\nShe couldn’t recharge the phone as she’s super low tech and now in a foreign\ncountry.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "母は今朝、アジアからヨーロッパまで飛んできて、私に会いに来てくれました。母はプリペイド携帯を持っていて\nプリペイド携帯にお金を入れていたのですが 着陸した瞬間にデータローミングをオフにするのを忘れて\nデータローミングをオフにするのを忘れたために、着陸した瞬間にすべてのお金が燃えてしまった。\n\n彼女は超ローテクなので、携帯電話を充電することもできず、今は外国にいる。\n....",
      "title": "ビットコインとライトニングは、私にとってフィアットではできないことをしてくれました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我妈妈今天早上从亚洲一路飞到欧洲来看我。她有一个\n预付电话，里面有一些钱。所有的钱在她降落的那一刻被烧掉了\n因为她忘记关闭数据漫游。\n\n她无法给手机充电，因为她的技术水平超低，现在在国外\n国家....",
      "title": "比特币和闪电刚刚为我做了法币无法做到的事情"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我媽媽今天早上從亞洲一路飛到歐洲來看我。她有一個\n預付電話，裏面有一些錢。所有的錢在她降落的那一刻被燒掉了\n因爲她忘記關閉數據漫遊。\n\n她無法給手機充電，因爲她的技術水平超低，現在在國外\n國家....",
      "title": "比特幣和閃電剛剛爲我做了法幣無法做到的事情"
    }
  ]
}