{
  "author": "makeshiftballer",
  "the_new_excerpt": "ETC is a literal scam coin that has been 51% attacked not once, not twice, but\nTHREE TIMES. Imo this is far worse for the crypto sphere than Doge potentially\nflipping BNB and making it to the top 3 as a massive pump n dump. I don’t see\nhow people don’t get wrecked on something like ETC. A lot of…",
  "original_created_utc": 1620308112,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETCは文字通りの詐欺コインで、一度や二度ではなく、51％の攻撃を受けています。\n3回目です。これは、DogeがBNBを反転させて大規模なポンプ・アンド・ダンプとしてトップ3に入る可能性よりも、暗号領域にとってはるかに悪いことだと思います。\n大規模なパンプ・アンド・ダンプとしてBNBを反転させてトップ3に入る可能性があることよりもはるかに悪いと思います。私にはわかりません。\nETCのようなもので人々が混乱しないとは思えません。多くの人が...",
      "title": "ETCが15位以内に入ることは、Dogeが3位以内に入ることよりも暗号にとっては悪いことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "ETC是一个字面意义上的骗局币，已经被51%的人攻击了，不是一次，不是两次，而是\n三次。我认为这对加密货币领域来说，比Doge有可能翻转BNB并成为前三名更糟糕。\n炒作BNB，使其成为前三名，成为一个大规模的抽水机。我不明白\n人们是如何在ETC这样的东西上不被破坏的。很多...",
      "title": "ETC排在前15位对加密货币来说比Doge排在前3位更糟糕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "ETC是一個字面意義上的騙局幣，已經被51%的人攻擊了，不是一次，不是兩次，而是\n三次。我認爲這對加密貨幣領域來說，比Doge有可能翻轉BNB併成爲前三名更糟糕。\n炒作BNB，使其成爲前三名，成爲一個大規模的抽水機。我不明白\n人們是如何在ETC這樣的東西上不被破壞的。很多...",
      "title": "ETC排在前15位對加密貨幣來說比Doge排在前3位更糟糕。"
    }
  ],
  "title": "ETC being top 15 is worse for crypto than Doge being top 3",
  "created_utc": 1620322616,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>ETC is a literal scam coin that has been 51% attacked not once, not twice, but THREE TIMES. Imo this is far worse for the crypto sphere than Doge potentially flipping BNB and making it to the top 3 as a massive pump n dump. I don’t see how people don’t get wrecked on something like ETC. A lot of people think regulations will spark the next bear market, its coins like ETC that will spark the regulations. (I understand they’re coming regardless)</p>\n</div><!-- SC_ON -->",
  "score": 1478,
  "permalink": "/r/CryptoCurrency/comments/n67f31/etc_being_top_15_is_worse_for_crypto_than_doge/",
  "subreddit": "CryptoCurrency",
  "id": "n67f31",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985987339
}