{
  "author": "jb64w",
  "original_created_utc": 1651706717,
  "title": "Bitstamp BLOCKED my account because I'm from Russia!?",
  "created_utc": 1651754036,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry if I posted in the wrong section, but I don&amp;#39;t know where else to post. I already wrote in the Bitstamp thread, but the post was blocked without comments.&lt;/p&gt;\n\n&lt;p&gt;So 2 weeks ago I saw that my account is blocked, they don&amp;#39;t let me trade and also withdraw my funds. I wrote to their support and here is their reply - &amp;quot; in the light of the current events in Ukraine and the consequent regulatory directives, we’ve been required to disable your account’s deposit, trading and withdrawal options&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I asked for an official notice that all Russian citizens should be blocked, without the possibility of withdrawal.&lt;/p&gt;\n\n&lt;p&gt;I am a simple person, not connected in any way and not supporting the war in Ukraine. I created an account in 2019, verified it, confirmed the legal origin of the funds.&lt;/p&gt;\n\n&lt;p&gt;And now the exchange just wants to appropriate my money, referring to what is happening in Ukraine.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/u/BitStampOfficial/\"&gt;u/BitStampOfficial&lt;/a&gt; I ask you to provide legal notice on what basis you completely blocked my account, as well as many other accounts from Russia.&lt;/p&gt;\n\n&lt;p&gt;Why is no other exchange taking measures like yours?? Two weeks later, your support team cannot give me an answer, but is just playing for time. &lt;strong&gt;TICKET #BIT-1438832&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I really hope that you are mistaken and the reliability of the oldest European stock exchange is beyond doubt.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/nkj7hoefmjx81.jpg?width=1580&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=a8059f5d04b1912fb2709cd586cfff2c814c05c0\"&gt;https://preview.redd.it/nkj7hoefmjx81.jpg?width=1580&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=a8059f5d04b1912fb2709cd586cfff2c814c05c0&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 332,
  "permalink": "/r/Bitcoin/comments/uijimr/bitstamp_blocked_my_account_because_im_from_russia/",
  "subreddit": "Bitcoin",
  "id": "uijimr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sorry if I posted in the wrong section, but I don't know where else to post. I\nalready wrote in the Bitstamp thread, but the post was blocked without comments.\n\nSo 2 weeks ago I saw that my account is blocked, they don't let me trade and\nalso withdraw my funds. I wrote to their support and here is…"
}