{
  "author": "journoprof",
  "original_created_utc": 1640052068,
  "title": "Why did small cities like Ft. Wayne, Rochester and Rock Island get early pro sports franchises?",
  "created_utc": 1640084628,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The NFL famously was founded in an auto dealership in Canton, Ohio, home of one of the original teams. Other early franchises included big burgs like Dayton, Duluth, Muncie and Tonawanda. The NBA’s history includes metropolises such as Rochester, Syracuse, Fort Wayne and even lovely Moline, Illinois. &lt;/p&gt;\n\n&lt;p&gt;It’s not surprising that, except for Green Bay, most of the teams in tiny towns either relocated or went bust. But why were they included in the first place? How could owners expect to draw enough attendance, in the era before TV rights, to survive?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/rl3b9k/why_did_small_cities_like_ft_wayne_rochester_and/",
  "subreddit": "AskHistorians",
  "id": "rl3b9k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The NFL famously was founded in an auto dealership in Canton, Ohio, home of one\nof the original teams. Other early franchises included big burgs like Dayton,\nDuluth, Muncie and Tonawanda. The NBA’s history includes metropolises such as\nRochester, Syracuse, Fort Wayne and even lovely Moline,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NFLはオハイオ州カントンの自動車ディーラーで設立されたことで有名ですが、その本拠地の1つである\nを設立した。他の初期のフランチャイズには、デイトンなどの大きな町が含まれています。\nダルース、マンシー、トナワンダ。NBAの歴史には、次のような大都市が含まれています。\nロチェスター、シラキュース、フォートウェイン、そして愛らしいモリーンも...。",
      "title": "フォートウェイン、ロチェスター、ロックアイランドといった小さな都市が、なぜ早くからプロスポーツのフランチャイズを獲得したのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "著名的NFL是在俄亥俄州坎顿的一家汽车经销商处成立的，坎顿是其中一支原始球队的所在地。\n最初的球队之一。其他早期的特许经营权包括像代顿这样的大城市。\n德卢斯，曼西和托纳万达。NBA的历史包括一些大都市，如\n罗切斯特、锡拉丘兹、韦恩堡，甚至是可爱的莫林，...",
      "title": "为什么像韦恩堡、罗切斯特和洛克岛这样的小城市能早期获得职业体育特许权？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "著名的NFL是在俄亥俄州坎頓的一家汽車經銷商處成立的，坎頓是其中一支原始球隊的所在地。\n最初的球隊之一。其他早期的特許經營權包括像代頓這樣的大城市。\n德盧斯，曼西和託納萬達。NBA的歷史包括一些大都市，如\n羅切斯特、錫拉丘茲、韋恩堡，甚至是可愛的莫林，...",
      "title": "爲什麼像韋恩堡、羅切斯特和洛克島這樣的小城市能早期獲得職業體育特許權？"
    }
  ]
}