{
  "author": "Gummymyers124",
  "original_created_utc": 1655588854,
  "title": "Why do women 9 times out of 10 never message first on tinder?",
  "created_utc": 1655631065,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title. I’ve had this happen only a handful of times. 90% of the time when I match with somebody, unless I send them a message first, they will just sit in my “matched” until I delete my account again. &lt;/p&gt;\n\n&lt;p&gt;Why don’t you send a message first you ask? I do. But most of the time, I never get a response. I’ve tried asking questions as an opener, saying hello, pickup lines, whatever, you name it. 9 times out of 10, no response. &lt;/p&gt;\n\n&lt;p&gt;So why do women do this? I’m bi and have matched with other males and they always message first. Why do they also even bother swiping if they’re not going to respond/read your message? Whats the point? If you swiped on me, I assume that means you’re attracted to me and would like to get to know me. Evidently, this is almost never the case. I’m not going to be attracted to anyone who doesn’t show they’re attracted to me as well. You have to show you’re interested in me, or i’m not going to be interested in you. If you swiped on me, I assume you’re interested in me. But not interested enough to make a move? Make up your mind.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/vfg6j5/why_do_women_9_times_out_of_10_never_message/",
  "subreddit": "TooAfraidToAsk",
  "id": "vfg6j5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title. I’ve had this happen only a handful of times. 90% of the time when I\nmatch with somebody, unless I send them a message first, they will just sit in\nmy “matched” until I delete my account again.\n\nWhy don’t you send a message first you ask? I do. But most of the time, I never\nget a response.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトル このようなことが起こったのはほんの一握りです。私が誰かと対戦するとき、90％の確率で\nマッチングした場合、メッセージを送らない限り、その相手は私が削除するまで\nになってしまいます。\n\nなぜ最初にメッセージを送らないのかって？そうなんです。でも、たいていの場合、返事はないんだ。\n返事をもらうことができないんだ...。",
      "title": "なぜ女性は10回中9回、tinderで最初にメッセージをしないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题。我遇到这种情况的次数屈指可数。90%的情况下，当我\n匹配的人，除非我先给他们发信息，否则他们就会在我的\n我的 \"匹配\"，直到我再次删除我的账户。\n\n你问为什么不先发信息？我发了。但大多数时候，我从未\n得到回应....",
      "title": "为什么10个女人中的9个从来不在tinder上先发信息？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題。我遇到這種情況的次數屈指可數。90%的情況下，當我\n匹配的人，除非我先給他們發信息，否則他們就會在我的\n我的 \"匹配\"，直到我再次刪除我的賬戶。\n\n你問爲什麼不先發信息？我發了。但大多數時候，我從未\n得到回應....",
      "title": "爲什麼10個女人中的9個從來不在tinder上先發信息？"
    }
  ]
}