{
  "author": "DetroitMotorShow",
  "original_created_utc": 1628653230,
  "title": "The ongoing Polynetwork hack is hilarious right now. Hacker's USDT got locked, someone informed him and hacker rewarded him. He then sent some of the reward to Vitalik lol",
  "created_utc": 1628685312,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Polynetwork hacker stole around $600m and tried to launder those funds but was immediately locked out by USDT Tether, so he couldnt spend the usdt in his wallet. He tried moving them to curve and it failed</p>\n\n<p>Someone told him USDT banned him with an onchain txn message, so he tipped the guy around $50k. The guy who got the reward immediately sent around $5k to Vitalik lol. </p>\n\n<p>Meanwhile the hacker got swamped by beggars, asking him for money. Some were recommending him tips on how to launder (like using Tornado Cash) and looking for a reward.  </p>\n\n<p>Im not sure if the hacker is really unaware of dapps like Tornado Cash but anyways he seemed to play along and asked people &quot;TEACH ME PLZ!&quot;</p>\n\n<p>The whole thing is like watching money heist IRL lol </p>\n\n<p>Meanwhile the polynetwork team posted a cringy message asking the hacker to return the funds otherwise there will be legal consequences. </p>\n\n<p>The hacker then said he is not interested in the money, and his latest message seems to indicate he will create a token and the DAO will decide on the fate. </p>\n\n<p><a href=\"https://etherscan.io/address/0xc8a65fadf0e0ddaf421f28feab69bf6e2e589963\">https://etherscan.io/address/0xc8a65fadf0e0ddaf421f28feab69bf6e2e589963</a></p>\n\n<p>Meanwhile people pour in asking him for money. Over 600 people have sent txns asking for mone.y Some people really seem to think he will distribute the hacked amount to the people who are begging for it lol. I wont be surprised if he did, crazier things have happened in crypto.</p>\n</div><!-- SC_ON -->",
  "score": 227,
  "permalink": "/r/CryptoCurrency/comments/p254um/the_ongoing_polynetwork_hack_is_hilarious_right/",
  "subreddit": "CryptoCurrency",
  "id": "p254um",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Polynetwork hacker stole around $600m and tried to launder those funds but was\nimmediately locked out by USDT Tether, so he couldnt spend the usdt in his\nwallet. He tried moving them to curve and it failed\n\nSomeone told him USDT banned him with an onchain txn message, so he tipped the\nguy around…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Polynetworkのハッカーは約6億ドルを盗み、その資金をロンダリングしようとしたが、すぐにUSDT Tetherにロックアウトされた。\nUSDT Tetherにロックアウトされ、財布の中のUSDTを使うことができませんでした。\n財布の中のusdtを使うことができませんでした。カーブに移動させようとしましたが、失敗しました\n\n誰かが彼にUSDTがオンチェーンのtxnメッセージで彼を禁止したと言ったので、彼はその人にチップを渡しました。\nその人にチップを渡して...",
      "title": "現在進行中のPolynetworkのハッキングは、今、笑えます。ハッカーのUSDTがロックされ、誰かが彼に知らせ、ハッカーは彼に報酬を与えました。そして、その報酬の一部をVitalikに送った(笑)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Polynetwork的黑客盗取了约6亿美元，并试图清洗这些资金，但被USDT Tether立即锁定。\n被USDT Tether立即锁定，所以他无法花费他钱包里的USDT。\n钱包。他试图将它们转移到曲线，但失败了\n\n有人告诉他USDT用链上的txn信息禁止了他，所以他向那人告密\n所以他就向那个人通风报信......",
      "title": "正在进行的Polynetwork黑客攻击现在是很搞笑的。黑客的USDT被锁定，有人通知他，黑客奖励了他。然后他把部分奖励发给了维塔利克。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Polynetwork的黑客盜取了約6億美元，並試圖清洗這些資金，但被USDT Tether立即鎖定。\n被USDT Tether立即鎖定，所以他無法花費他錢包裏的USDT。\n錢包。他試圖將它們轉移到曲線，但失敗了\n\n有人告訴他USDT用鏈上的txn信息禁止了他，所以他向那人告密\n所以他就向那個人通風報信......",
      "title": "正在進行的Polynetwork黑客攻擊現在是很搞笑的。黑客的USDT被鎖定，有人通知他，黑客獎勵了他。然後他把部分獎勵發給了維塔利克。"
    }
  ]
}