{
  "author": "Many_Arm7466",
  "original_created_utc": 1643556319,
  "title": "Anybody feel like celebrities are not paying for the Ape NFTs??’",
  "created_utc": 1643574900,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have seen all over the news of different celebrities paying exorbitant amounts for the Ape NFTs and it just feels super inorganic and forced. &lt;/p&gt;\n\n&lt;p&gt;There are many celebrities that have supposedly bought these NFTs and now have changed their profile picture to the Ape they own. Some of the prominent ones include Future, Lil Baby, and Jimmy Fallon all spending 500K+. And while I don’t doubt they couldn’t afford it as they are all obviously multimillionaires. I do not believe they are actually buying them. &lt;/p&gt;\n\n&lt;p&gt;My working theory is that they are simply getting them for or even getting paid to market these NFT’s and it’s just the NFT owners wash trading between their own ETH wallets to create Artificial demand and contribute to the price inflation. &lt;/p&gt;\n\n&lt;p&gt;The most recent one I saw was Justin Bieber buying an Ape NFT for around 500 ETH (over 1 million USD). When the base price of the NFT was 250K. &lt;/p&gt;\n\n&lt;p&gt;I refuse to believe celebrities at their own willingness are overpaying for these. Once again I understand that a celebrity like Justin Bieber could in theory afford to throw a million at something like this. But just doesn’t seem like something he would rationally do without ulterior motives. &lt;/p&gt;\n\n&lt;p&gt;Welcoming any thoughts people have on this? Just want to disclaim I am not against NFT’s and believe the tech and potential of it is amazing, but the current use case is absurd and indicative of a artificially inflated bubble(this is coming from someone that made a few ETH flipping NFTs)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 378,
  "permalink": "/r/CryptoCurrency/comments/sgbh3x/anybody_feel_like_celebrities_are_not_paying_for/",
  "subreddit": "CryptoCurrency",
  "id": "sgbh3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have seen all over the news of different celebrities paying exorbitant amounts\nfor the Ape NFTs and it just feels super inorganic and forced.\n\nThere are many celebrities that have supposedly bought these NFTs and now have\nchanged their profile picture to the Ape they own. Some of the prominent…"
}