{
  "author": "BigBootyBear",
  "original_created_utc": 1640795123,
  "title": "In \"The Red Queen\" it is mentioned that many medieval men had trouble finding women to marry, sometimes marrying only in their late 30's, because many young females were hired as the \"help\" in castles. To what extent was polygamy practiced in medieval Europe?",
  "created_utc": 1640805641,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The author brings many examples of ancient institutionalized systems of polygamy like in the Inca:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In the ancient empire of the Incas, sex was a heavily regulated industry. The sun-king Atahualpa kept fifteen hundred women in each of many “houses of virgins” throughout his kingdom. They were selected for their beauty and were rarely chosen after the age of eight—to ensure their virginity. But they did not all remain virgins for long: They were the emperor’s concubines. Beneath him, each rank of society afforded a harem of a particular legal size. Great lords had harems of more than seven hundred women. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;He also mentions that even in Christendom polygamy was practiced. I don&amp;#39;t recall the exact passages, be he talks about feudal lords depleting many of the surrounding villages of young females for &amp;quot;housework&amp;quot; in the castle. He also mentioned a few castles that had secret passageways from the lord&amp;#39;s bedroom to the women&amp;#39;s quarters, and even the infirmary...&lt;/p&gt;\n\n&lt;p&gt;Is this true? Was the supposedly prude and Catholic medieval period maybe a little more mischievous than we think it was?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 133,
  "permalink": "/r/AskHistorians/comments/rrc02e/in_the_red_queen_it_is_mentioned_that_many/",
  "subreddit": "AskHistorians",
  "id": "rrc02e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The author brings many examples of ancient institutionalized systems of polygamy\nlike in the Inca:\n\n> In the ancient empire of the Incas, sex was a heavily regulated industry. The\n> sun-king Atahualpa kept fifteen hundred women in each of many “houses of\n> virgins” throughout his kingdom. They were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "著者は、古代の制度化された一夫多妻制の事例を数多く紹介し\nインカのように\n\n> 古代インカ帝国では、セックスは厳しく規制された産業であった。古代インカ帝国では、セックスは厳しく規制された産業だった。\n> 太陽王アタフアルパは、1500人の女性をそれぞれ多くの「家」で飼っています。\n> 処女 \"である。彼らは...",
      "title": "赤の女王』では、中世の男性の多くが結婚相手に恵まれず、30代後半で結婚することもあったと書かれていますが、これは城の「お手伝いさん」として若い女性が多く雇われたからです。中世ヨーロッパでは、一夫多妻制はどの程度行われていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作者带来了许多古代制度化的一夫多妻制的例子\n比如在印加人那里。\n\n> 在印加人的古老帝国中，性是一个受到严格管制的行业。太阳王\n> 太阳王阿塔瓦尔帕（Atahualpa）在他的王国中的许多 \"处女之家 \"中各养了一千五百名妇女。\n> 处女之家\"。她们是...",
      "title": "在《红皇后》中提到，许多中世纪的男人很难找到可以结婚的女人，有时到了30多岁才结婚，因为许多年轻女性被雇为城堡的 \"帮手\"。在中世纪的欧洲，一夫多妻制实行到什么程度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作者帶來了許多古代制度化的一夫多妻制的例子\n比如在印加人那裏。\n\n> 在印加人的古老帝國中，性是一個受到嚴格管制的行業。太陽王\n> 太陽王阿塔瓦爾帕（Atahualpa）在他的王國中的許多 \"處女之家 \"中各養了一千五百名婦女。\n> 處女之家\"。她們是...",
      "title": "在《紅皇后》中提到，許多中世紀的男人很難找到可以結婚的女人，有時到了30多歲才結婚，因爲許多年輕女性被僱爲城堡的 \"幫手\"。在中世紀的歐洲，一夫多妻制實行到什麼程度？"
    }
  ]
}