{
  "author": "Mallardshead",
  "original_created_utc": 1638958753,
  "title": "Quit fucking around and provide cover fire for ₿itcoin until it makes it out the door",
  "created_utc": 1638974016,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;One of my favorite charts of all time is the Papiermark vs gold. The Papiermark (also called paper mark or Weimar Mark) was the Weimar Republic’s fiat that hyperinflated and went to zero in the early 1920’s.&lt;/p&gt;\n\n&lt;p&gt;After WW1, Germany was forced to pay reparations for the war. But the reparations were denominated in gold. So predictably, nations that were owed money, banned imports from Germany, and then central banks colluded to manipulate gold. Meanwhile, the US continued loaning money to Germany to make its reparation payments to France and the UK, so that these two could service their war debts to the US. A very disgusting game. Anyway, this all set the wheels of the Papiermark’s hyperinflation in motion.&lt;/p&gt;\n\n&lt;p&gt;What people don’t realize, however, is that many of the people that bet against the Papiermark (especially those with leverage) went broke before the Papiermark did, even though they guessed the direction correctly, entering their trades as a favorable parabola was forming. How’s that? Because the volatility was too extreme, the percentage change in gold’s price versus the currency could move 100% or more in a single week, and it took years for hyperinflation to fully play out.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/lo586w99oa481.png?width=601&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d7dcf2973cb4c5c2e2ad519936f895cec38d63cd\"&gt;https://preview.redd.it/lo586w99oa481.png?width=601&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d7dcf2973cb4c5c2e2ad519936f895cec38d63cd&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So playing leverage in either direction on Bitcoin is a fool’s game, unless it’s part of a strategy involving derivatives (options, futures) where you can tape together delta-neutral positions, or hedge out crippling risk.&lt;/p&gt;\n\n&lt;p&gt;Here’s what you do:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;You go long Bitcoin, and you shut up.&lt;/li&gt;\n&lt;li&gt;Repeat&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;You don’t ask what the exit strategy is. This is what shitcoiner’s ask of their altcoins, which are parasites hanging around waiting for bitcoin’s halving every four years to do anything. This is about the separation of money from State. In thirteen years, when was the best time to sell bitcoin? Never. Bitcoin &lt;strong&gt;is&lt;/strong&gt; the exit strategy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 158,
  "permalink": "/r/Bitcoin/comments/rbo9q3/quit_fucking_around_and_provide_cover_fire_for/",
  "subreddit": "Bitcoin",
  "id": "rbo9q3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One of my favorite charts of all time is the Papiermark vs gold. The Papiermark\n(also called paper mark or Weimar Mark) was the Weimar Republic’s fiat that\nhyperinflated and went to zero in the early 1920’s.\n\nAfter WW1, Germany was forced to pay reparations for the war. But the\nreparations were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の好きなチャートのひとつに、パピアマルクと金の対比があります。パピアマルクは\n(ペーパーマーク、ワイマールマークとも呼ばれる）ワイマール共和国の不換紙幣は\n1920年代前半にハイパーインフレが起こり、ゼロになった。\n\n第一次世界大戦後、ドイツは戦争賠償金を支払うことを余儀なくされた。しかし、その\n賠償金は...",
      "title": "くだらないことをしていないで、₿itcoinがドアから出てくるまで援護射撃をする。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直以来最喜欢的图表之一是Papiermark与黄金的对比。Papiermark\n(也被称为纸币马克或魏玛马克）是魏玛共和国的法币，它在早期过度膨胀并归零。\n在20世纪20年代初，它被过度膨胀并归于零。\n\n一战结束后，德国被迫为战争支付赔款。但是，这些\n赔款是...",
      "title": "不要再胡闹了，为₿itcoin提供火力掩护，直到它出了门。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直以來最喜歡的圖表之一是Papiermark與黃金的對比。Papiermark\n(也被稱爲紙幣馬克或魏瑪馬克）是魏瑪共和國的法幣，它在早期過度膨脹並歸零。\n在20世紀20年代初，它被過度膨脹並歸於零。\n\n一戰結束後，德國被迫爲戰爭支付賠款。但是，這些\n賠款是...",
      "title": "不要再胡鬧了，爲₿itcoin提供火力掩護，直到它出了門。"
    }
  ]
}