{
  "author": "NervousTumbleweed",
  "the_new_excerpt": "This isn’t some ideological battleground. This is the stock market. There are\nhedge funds taking long positions, there are hedge funds going short and hedging\ntheir bets with long positions.\n\nYou’re not “sticking it to the man” holding GME.\n\nTrade based on what makes you money. Not ideology. Who…",
  "original_created_utc": 1612583035,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这不是什么意识形态的战场。这是股市。有\n对冲基金做多，也有对冲基金做空，对冲。\n他们用多头仓位下注。\n\n你持有GME并不是 \"见缝插针\"。\n\n交易的基础是什么让你赚钱。而不是意识形态。谁...",
      "title": "你们要明白，你们不是在向对冲基金发动战争。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這不是什麼意識形態的戰場。這是股市。有\n對沖基金做多，也有對沖基金做空，對沖。\n他們用多頭倉位下注。\n\n你持有GME並不是 \"見縫插針\"。\n\n交易的基礎是什麼讓你賺錢。而不是意識形態。誰...",
      "title": "你們要明白，你們不是在向對沖基金發動戰爭。"
    }
  ],
  "title": "You people need to understand that you are not waging a war on hedge funds.",
  "created_utc": 1612618018,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This isn’t some ideological battleground. This is the stock market. There are hedge funds taking long positions, there are hedge funds going short <em>and hedging their bets with long positions</em>.</p>\n\n<p>You’re not “sticking it to the man” holding GME. </p>\n\n<p>Trade based on what makes you money. Not ideology. Who gives a fuck. We don’t celebrate losses here to prove a point, we celebrate the stupid risky plays that the person took regardless of the fact it blew up in their face. </p>\n\n<p>If you think you’re going to profit off holding, hold. Stop letting people hype you up and manipulate you by framing this as some act of defiance against a corrupt system. You’re being played.</p>\n</div><!-- SC_ON -->",
  "score": 2572,
  "permalink": "/r/wallstreetbets/comments/ldp52a/you_people_need_to_understand_that_you_are_not/",
  "subreddit": "wallstreetbets",
  "id": "ldp52a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123213442
}