{
  "author": "Qtredit",
  "original_created_utc": 1644330081,
  "title": "If you want to make money day trading, try this first:",
  "created_utc": 1644341682,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Day trade on paper for at least a month or even longer. (Without actually making the trades)&lt;/p&gt;\n\n&lt;p&gt;I got this advice a few years ago but didn&amp;#39;t listen and was down 50%.&lt;/p&gt;\n\n&lt;p&gt;It sounds odd, but it&amp;#39;ll show you how hard and unpredictable it is, especially with crypto.&lt;/p&gt;\n\n&lt;p&gt;Literally write every trade you would have made with your crypto and see if you&amp;#39;re really in the green after at least a month.&lt;/p&gt;\n\n&lt;p&gt;This will be a great way to learn you can&amp;#39;t always time the market but without losing a big chunk of your money.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying day trading isn&amp;#39;t possible, but make your mistakes on paper first.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 364,
  "permalink": "/r/CryptoCurrency/comments/snle9h/if_you_want_to_make_money_day_trading_try_this/",
  "subreddit": "CryptoCurrency",
  "id": "snle9h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Day trade on paper for at least a month or even longer. (Without actually making\nthe trades)\n\nI got this advice a few years ago but didn't listen and was down 50%.\n\nIt sounds odd, but it'll show you how hard and unpredictable it is, especially\nwith crypto.\n\nLiterally write every trade you would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最低でも1ヶ月、あるいはそれ以上の期間、紙面上でデイトレードを行う。(実際には行わずに\nトレード)\n\n数年前にこのアドバイスを受けたが、聞かなかったので50％ダウンした。\n\n奇妙に聞こえるかもしれませんが、これがいかに困難で予測不可能なことかを教えてくれます。\n暗号で。\n\n文字通り、すべてのトレードを書く...",
      "title": "デイトレードで儲けたいなら、まずこれを試してみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在纸面上进行日间交易，至少有一个月甚至更长时间。(没有实际进行\n交易）。\n\n几年前我得到了这个建议，但没有听进去，结果下跌了50%。\n\n这听起来很奇怪，但它会告诉你这是多么的困难和不可预测，尤其是加密货币。\n尤其是加密货币。\n\n从字面上看，你可以写下每一笔交易，你会...",
      "title": "如果你想在日间交易中赚钱，先试试这个。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在紙面上進行日間交易，至少有一個月甚至更長時間。(沒有實際進行\n交易）。\n\n幾年前我得到了這個建議，但沒有聽進去，結果下跌了50%。\n\n這聽起來很奇怪，但它會告訴你這是多麼的困難和不可預測，尤其是加密貨幣。\n尤其是加密貨幣。\n\n從字面上看，你可以寫下每一筆交易，你會...",
      "title": "如果你想在日間交易中賺錢，先試試這個。"
    }
  ]
}