{
  "author": "carboonpn",
  "original_created_utc": 1636622306,
  "title": "Nocoiner friend told me I'm brainwashed and said bye",
  "created_utc": 1636641421,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems like I need to check my mental state my fellow Bitcoin hodlers investors and believers. A nocoiner friend who is into traditional stocks for a long while with about 30% profit so far asked me about Bitcoin because I was pretty open about it.  So explaining the basics of Blockchain and the inherent value of limited supply I hoped the response that I got was intelligent and leading into legitimate interest. First he says Bitcoin is going to be hacked with quantum computers and so that it&#39;s not going to last. Told him it&#39;s the best investment since 2009 and it&#39;s still growing, getting it&#39;s own ETF and traded by large corporations and hedge funds. &quot;Yeah, you&#39;re clearly brainwashed&quot; and said bye. </p>\n\n<p>Sad times to be a nocoiner I guess, losing your friends to brainwashing.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/qrhdh6/nocoiner_friend_told_me_im_brainwashed_and_said/",
  "subreddit": "Bitcoin",
  "id": "qrhdh6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems like I need to check my mental state my fellow Bitcoin hodlers\ninvestors and believers. A nocoiner friend who is into traditional stocks for a\nlong while with about 30% profit so far asked me about Bitcoin because I was\npretty open about it. So explaining the basics of Blockchain and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自分の精神状態をチェックする必要があるようです。\n投資家や信奉者の皆さん。伝統的な株式に長く投資していて、これまでに約30％の利益を上げているノコイナーの友人が、ビットコインについて尋ねてきました。\nしている友人が、ビットコインについて尋ねてきた。\n私がビットコインについてかなりオープンにしていたからです。そこで、Blockchainの基本を説明し、...",
      "title": "Nocoinerの友人は、私が洗脳されていると言って、バイバイしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看来我需要检查一下我的精神状态，我的比特币爱好者们\n投资者和信仰者。一个无币的朋友，在传统的股票上做了很久，到目前为止有30%的利润，他问我关于比特币的问题，因为我是在说：\"你知道吗？\n的朋友问我关于比特币的问题，因为我对比特币的看法很开放，他对传统的股票有很长时间的研究，到目前为止有30%的利润。\n因为我对它很开放。因此，解释了区块链的基本知识和...",
      "title": "Nocoiner朋友告诉我，我被洗脑了，然后说再见"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看來我需要檢查一下我的精神狀態，我的比特幣愛好者們\n投資者和信仰者。一個無幣的朋友，在傳統的股票上做了很久，到目前爲止有30%的利潤，他問我關於比特幣的問題，因爲我是在說：\"你知道嗎？\n的朋友問我關於比特幣的問題，因爲我對比特幣的看法很開放，他對傳統的股票有很長時間的研究，到目前爲止有30%的利潤。\n因爲我對它很開放。因此，解釋了區塊鏈的基本知識和...",
      "title": "Nocoiner朋友告訴我，我被洗腦了，然後說再見"
    }
  ]
}