{
  "author": "gorillamutila",
  "original_created_utc": 1637187586,
  "title": "I do not know what the next 100x coin will be, but here is my take on what will likely be the next big revolution in crypto",
  "created_utc": 1637211041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>The pitch</h1>\n\n<p>If you&#39;ve been in the market for a while, you&#39;ve noticed how things run on hype-cycles. We&#39;ve recently seen the DeFi hype that mooned several projects in the space. We also saw the NFT mania that still seems to have some significant steam behind it, and now we are seeing the Metaverse hype, with all kinds of crypto projects related to it performing beautifully. We also saw the ludicrous dog-coin hype moon all kinds of <del>useless</del> projects.</p>\n\n<p>There is one segment of the market that we still haven&#39;t seen have a real run and it is one that seems to have most parts in place, just waiting for something to happen. I believe we should pay attention to the incoming <strong>Data</strong> hype.</p>\n\n<p>Back in 2017, <a href=\"https://www.economist.com/briefing/2017/05/06/data-is-giving-rise-to-a-new-economy\">The Economist</a> called Data the &quot;new oil&quot;, being the most valuable resource of the current economy, and highlighted how</p>\n\n<blockquote>\n<p>Data are to this century what oil was to the last one: a driver of growth and change. Flows of data have created new infrastructure, new businesses, new monopolies, new politics and—crucially—new economics. Digital information is unlike any previous resource; it is extracted, refined, valued, bought and sold in different ways. It changes the rules for markets and it demands new approaches from regulators. Many a battle will be fought over who should own, and benefit from, data. </p>\n</blockquote>\n\n<p><span class=\"md-spoiler-text\">(I really recommend you all read this article).</span></p>\n\n<p>5 years later, we can see that this is absolutely true. If you check the top 10 global companies today by Market Cap, you will notice how most of them are deeply involved with Data. Out of the top 10, half of them are directly involved with data (Facebook, Amazon, Microsoft, Apple, Google) and others either generate, process or heavily consume it (Tesla and Nvidia, for instance). Data went from allowing targeted ads to the matter that feeds powerful AI and deep-learning applications.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/bomtfakoy7081.jpg?width=602&amp;format=pjpg&amp;auto=webp&amp;s=f57f00688477bc12c8bc7e84d46ce89ac4b4ffbe\">Taken November 17, 2021</a></p>\n\n<p>As one can immediately glance, however, the world&#39;s Data right now is also extremely centralized in the hands of a few trillion dollar companies that can do whatever they want with it and I think the biggest reason why that happens is because most people still don&#39;t appreciate how valuable Data is. As we can see in the quoted article, Data has indeed created new monopolies. What we should also pay attention to, though, is that it will also create a <em>new economy.</em> If one takes into consideration that, back in 2017, the World Economic Forum already estimated the Data Market to be worth some <a href=\"https://www.weforum.org/agenda/2017/09/the-value-of-data/\">US$ 3 trillion</a>, one can immediately appreciate the huge implications of this.</p>\n\n<p>We are talking about the creation of a new asset class that not only we all produce pretty much every moment of our lives, but that it will also be valued, bought and sold like goods, stocks or crypto.</p>\n\n<h1>Talking about crypto...</h1>\n\n<p>Crypto always had pretentions of revolutionizing the way finance is structured, privileging decentralization free exchange and personal ownership of financial assets. We already know that crypto has proved largely successful in this task with Bitcoin, Ethereum and the whole DeFi space. We now see crypto once again revolutionizing digital property and ownership through NFTs which are, at its most essential, Data.</p>\n\n<p>If you add both together, you can immediately grasp how crypto is uniquely positioned to benefit from the budding and nascent Data market. Through different crypto projects, Data can be generated. Through NFT&#39;s, data can be tokenized and owned. Through decentralized finance mechanisms it can be bought, sold, staked, rented and whatever else we can imagine.</p>\n\n<p>There are already good projects that allow people to benefit from this:</p>\n\n<ul>\n<li>There are projects like <a href=\"https://audius.co/\">Audius</a>, <a href=\"https://livepeer.org/\">Livepeer</a> and <a href=\"https://filecoin.io/\">Filecoin</a> that each in its own way can store and share data on the blockchain. Some of these have already shown great results this year.</li>\n<li>There is Brave&#39;s <a href=\"https://basicattentiontoken.org/\">Basic Attention Token</a> that is already changing our relationship to internet browsing and ads consumption. </li>\n<li>There is <a href=\"https://protocol.fractal.id/\">Fractal Protocol</a> that allows you to control the data you create online and how you share it.</li>\n<li><a href=\"https://thegraph.com/\">The Graph</a> and <a href=\"https://chain.link/\">Chainlink</a> both provide different kinds of data that will help build future blockchain applications. Also strong names in the market.</li>\n<li>Last - but not least, nor final - there is also <a href=\"https://oceanprotocol.com/\">Ocean Protocol</a>, that provides the Market Place where all this data can be bought, sold and staked.</li>\n</ul>\n\n<p>All of these moving pieces, together and in due time, will radically alter the Data market as it is now structured, reducing the control a few select companies over it, and allowing people not only to have more control over it, but to be rewarded by it. I hope this somewhat long article has brought some interesting information and insight about this very important, yet somewhat neglected sector that could highly benefit from crypto.  </p>\n\n<p>Safe investments for you all!  </p>\n\n<p>(Disclosure: I own 3 of the 8 projects I mentioned. I do not intend to shill any of them, but raise awareness about some of what is happening regarding Data and crypto).</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/HtOXQj33PoWbrWBTt4MoWeYMx6mpHQOXEtloeNATCDY.jpg?auto=webp&s=7e7fb643815eaf3fdae8828bb6841f489207f94c",
          "width": 595,
          "height": 335
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/HtOXQj33PoWbrWBTt4MoWeYMx6mpHQOXEtloeNATCDY.jpg?width=108&crop=smart&auto=webp&s=7b005f12810cdbff34a15231c0607f3d810e7ab3",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/HtOXQj33PoWbrWBTt4MoWeYMx6mpHQOXEtloeNATCDY.jpg?width=216&crop=smart&auto=webp&s=d54dbd71f281cdce1634c11b75ae3ba299a0ae4c",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/HtOXQj33PoWbrWBTt4MoWeYMx6mpHQOXEtloeNATCDY.jpg?width=320&crop=smart&auto=webp&s=1135b501150dc5e1e76744cc61fef66b8fa565fb",
            "width": 320,
            "height": 180
          }
        ],
        "variants": {},
        "id": "M023FxYXR082Nve0dYuWaZbR5JIXRypFIpLDeAeXl-8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qwahv3/i_do_not_know_what_the_next_100x_coin_will_be_but/",
  "subreddit": "CryptoCurrency",
  "id": "qwahv3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "THE PITCH\n\nIf you've been in the market for a while, you've noticed how things run on\nhype-cycles. We've recently seen the DeFi hype that mooned several projects in\nthe space. We also saw the NFT mania that still seems to have some significant\nsteam behind it, and now we are seeing the Metaverse…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ザ・ピッチ\n\n市場に長く身を置いている方なら、物事がいかにして\nハイプサイクルがあることに気づいています。最近では、DeFiの誇大広告がいくつかのプロジェクトで見られました。\nを見ました。また、NFTマニアも見てきましたが、これはまだかなりの勢いがあるようです。\nそして今、私たちはメタバースを目の当たりにしています...",
      "title": "次の100倍コインが何になるかはわかりませんが、暗号の次の大きな革命になりそうなものについて、私は次のように考えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "讲座\n\n如果你已经在市场上呆了一段时间，你已经注意到事情是如何运行的了\n炒作周期。我们最近看到了DeFi的炒作，在这个领域的几个项目中，DeFi被炒得很热。\n空间的几个项目。我们也看到了NFT的狂热，它似乎仍然有一些重要的意义。\n而现在我们看到了Metaverse...",
      "title": "我不知道下一个100倍币会是什么，但以下是我对可能成为加密货币下一次大革命的看法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "講座\n\n如果你已經在市場上呆了一段時間，你已經注意到事情是如何運行的了\n炒作週期。我們最近看到了DeFi的炒作，在這個領域的幾個項目中，DeFi被炒得很熱。\n空間的幾個項目。我們也看到了NFT的狂熱，它似乎仍然有一些重要的意義。\n而現在我們看到了Metaverse...",
      "title": "我不知道下一個100倍幣會是什麼，但以下是我對可能成爲加密貨幣下一次大革命的看法"
    }
  ]
}