{
  "author": "EagleEyes192",
  "original_created_utc": 1632089658,
  "title": "How do I tell a family member that their dreams are completely unrealistic and that they need to get a job and do something with their life?",
  "created_utc": 1632115208,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My brother (26M) who stills lives at home believes that he will become a huge gaming streamer and won’t ever have to work. I (17M) would love to support his goals but this just seems absolutely absurd to me. He has an extremely small following and is terrible at the games he streams. He does not help out around the house, he does not pay any kind of rent, and eats all of our food. I am very annoyed by this because my mom is single and I help her out as much as I can with absolutely everything, and half of my check from my part time job goes to rent, groceries, and bills because she cannot do it on her own. Should I just blatantly tell him to get off of his ass and do something with his life? Sorry, I just don’t know how to go about this.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/prhrdt/how_do_i_tell_a_family_member_that_their_dreams/",
  "subreddit": "NoStupidQuestions",
  "id": "prhrdt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My brother (26M) who stills lives at home believes that he will become a huge\ngaming streamer and won’t ever have to work. I (17M) would love to support his\ngoals but this just seems absolutely absurd to me. He has an extremely small\nfollowing and is terrible at the games he streams. He does not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "実家にいる兄(26M)は、自分が大物になると信じている。\n働かなくてもいいと思っています。私（17M）は彼の目標をサポートしたいと思っています。\n私（17M）は彼の目標をサポートしたいと思っていますが、これは私にとっては絶対に不合理なことです。彼のファンは非常に少なく\n彼のファンは非常に少なく、彼が配信するゲームは下手です。彼には...",
      "title": "家族に、自分の夢はまったく現実的ではなく、仕事をして人生で何かをしなければならないと、どのように伝えればよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的弟弟（26岁）仍然住在家里，他相信他将成为一个巨大的\n他相信自己会成为一个巨大的游戏玩家，永远不用工作了。我（17M）很想支持他的目标。\n但这在我看来绝对是荒谬的。他的追随者极少\n他的粉丝很少，而且他的游戏很糟糕。他并不...",
      "title": "我如何告诉一个家庭成员，他们的梦想是完全不现实的，他们需要找一份工作，为自己的生活做点什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的弟弟（26歲）仍然住在家裏，他相信他將成爲一個巨大的\n他相信自己會成爲一個巨大的遊戲玩家，永遠不用工作了。我（17M）很想支持他的目標。\n但這在我看來絕對是荒謬的。他的追隨者極少\n他的粉絲很少，而且他的遊戲很糟糕。他並不...",
      "title": "我如何告訴一個家庭成員，他們的夢想是完全不現實的，他們需要找一份工作，爲自己的生活做點什麼？"
    }
  ]
}