{
  "author": "brad1242",
  "the_new_excerpt": "The overly optimistic head-in-sand rah rah hewld 4eva spam is so goddamn\nirritating, it makes me want to sell the shares that i was already planning on\nholding just to NOT be part of this group. When I enlisted I was joining the\nband of WSB low-IQ retards, not the r/all [/r/all] caravan of single…",
  "original_created_utc": 1612449217,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "过于乐观的头在沙子里拉赫维尔德4eva垃圾邮件是如此该死的。\n恼人的，这让我想卖掉我已经计划好的股票。\n持有只是为了不属于这个团体。当我入伍的时候，我加入了\n带WSB低智商的弱智，而不是r/所有[/r/所有]大篷车的单... ...",
      "title": "请注意手推车上的悬挂者和回音壁滑稽的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "過於樂觀的頭在沙子里拉赫維爾德4eva垃圾郵件是如此該死的。\n惱人的，這讓我想賣掉我已經計劃好的股票。\n持有隻是爲了不屬於這個團體。當我入伍的時候，我加入了\n帶WSB低智商的弱智，而不是r/所有[/r/所有]大篷車的單... ...",
      "title": "請注意手推車上的懸掛者和迴音壁滑稽的人。"
    }
  ],
  "title": "ATTENTION BANDWAGON HANGERS-ON AND ECHO-CHAMBER SMOOTHIES",
  "created_utc": 1612508243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The overly optimistic head-in-sand rah rah hewld 4eva spam is so goddamn irritating, it makes me want to sell the shares that i was already planning on holding just to NOT be part of this group. When I enlisted I was joining the band of WSB low-IQ retards, not the <a href=\"/r/all\">r/all</a> caravan of single-celled microbe house-plant marble brains. <strong>WE FUCKING GET IT</strong> - you opened a robinhood account, liquidated your pokemon collection and spent $378 on a game disc scratchoff - I&#39;m holding shares but I swear to yahweh the more shitty low-effort posts I see in rising with the same copy/paste &quot;SH0RT L4DD3RS R 4 REAL - EMOJI POWER MOON ROCKET&quot; horsehit, it honestly just makes people think &quot;hey I like coloring on my walls as much as the next guy, but am I THIS fucking dumb?&quot; Enough with the attempts to reassure yourselves via CONSTANT spam - hold your goddamn shares and post QUALITY MEMES OR NOTHING AT ALL GOD DAMMIT</p>\n</div><!-- SC_ON -->",
  "score": 6485,
  "permalink": "/r/wallstreetbets/comments/lcgvos/attention_bandwagon_hangerson_and_echochamber/",
  "subreddit": "wallstreetbets",
  "id": "lcgvos",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123209314
}