{
  "author": "TrojanArmor",
  "the_new_excerpt": "Like the title says I've been in crypto for a while but I've never really\ndabbled in DEFI because ETH does a pretty good job of pricing out retail\ninvestors.\n\nRecently I learn how to bridge between the BSC chain and MATIC network for\npennies and started using AAVE to generate some passive income as…",
  "original_created_utc": 1623278506,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、私はしばらくの間、暗号に関わってきましたが、DEFIにはあまり手を出しませんでした。\nETHは個人投資家の価格を下げることに成功しているので、DEFIには手を出していません。\n投資家の方には、ぜひお勧めします。\n\n最近、BSCチェーンとMATICネットワークをつなぐ方法を小銭で学び、AAVEを使って\nAAVEを利用して受動的な収入を得られるようになりました。",
      "title": "私は長年の暗号ユーザーで、DEFIを使い始めたばかりです。DEFIはすごいですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题所说的，我从事加密货币已经有一段时间了，但我从来没有真正地\n因为ETH在为零售业定价方面做得很好。\n投资者。\n\n最近我学会了如何在BSC链和MATIC网络之间搭建桥梁，并开始使用AAVE。\n分钱，并开始使用AAVE来产生一些被动收入作为。",
      "title": "我是一个长期的加密货币用户，刚刚开始使用DEFI。我的妈呀，DEFI太神奇了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題所說的，我從事加密貨幣已經有一段時間了，但我從來沒有真正地\n因爲ETH在爲零售業定價方面做得很好。\n投資者。\n\n最近我學會了如何在BSC鏈和MATIC網絡之間搭建橋樑，並開始使用AAVE。\n分錢，並開始使用AAVE來產生一些被動收入作爲。",
      "title": "我是一個長期的加密貨幣用戶，剛剛開始使用DEFI。我的媽呀，DEFI太神奇了。"
    }
  ],
  "title": "I'm a long time crypto user who just started using DEFI. Holy crap DEFI is amazing.",
  "created_utc": 1623297474,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like the title says I&#39;ve been in crypto for a while but I&#39;ve never really dabbled in DEFI because ETH does a pretty good job of pricing out retail investors.</p>\n\n<p>Recently I learn how to bridge between the BSC chain and MATIC network for pennies and started using AAVE to generate some passive income as well as borrow some stable coins to gain more passive income. </p>\n\n<p>Holy crap DEFI is amazing. No question, no identification, no middle man, 1 click and I can borrow crypto to generate even more passive income on top of my initial deposit.</p>\n\n<p>If yall haven&#39;t looked into DEFI or tried it out I suggest you do, it really is truly amazing technology.</p>\n</div><!-- SC_ON -->",
  "score": 538,
  "permalink": "/r/CryptoCurrency/comments/nw8fz5/im_a_long_time_crypto_user_who_just_started_using/",
  "subreddit": "CryptoCurrency",
  "id": "nw8fz5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884267
}