{
  "author": "stankyyboiii",
  "original_created_utc": 1654476276,
  "title": "Why do I feel like I’m getting dumber?",
  "created_utc": 1654495975,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 23, living on my own, going to school. I’m fairly isolated most of the time. I feel like there is a heavy “fog” clouding my ability think clearly or communicate effectively. I used to feel smart, I’d be able to think quickly and carry out conversations but now I feel like I’ve lost that entirely. &lt;/p&gt;\n\n&lt;p&gt;This has only gotten worse lately and it’s made me reclusive and shy. My motivation is down the gutter. I feel like I’m on autopilot, even the most mundane tasks feel completely mindless. I can’t watch movies without constantly rewinding because I’ve lost focus. I find it difficult to hold conversations because they feel like utter nonsense most of the time. &lt;/p&gt;\n\n&lt;p&gt;There more aware of it I become, the worse it gets. Genuinely feels like my mind has regressed. Is this normal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/v5qsq6/why_do_i_feel_like_im_getting_dumber/",
  "subreddit": "NoStupidQuestions",
  "id": "v5qsq6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m 23, living on my own, going to school. I’m fairly isolated most of the time.\nI feel like there is a heavy “fog” clouding my ability think clearly or\ncommunicate effectively. I used to feel smart, I’d be able to think quickly and\ncarry out conversations but now I feel like I’ve lost that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "23歳、一人暮らし、学校へ通っています。私はかなり孤立していることがほとんどです。\n私の思考やコミュニケーション能力を曇らせる重い \"霧 \"があるように感じています。\n霧がかかっているような感じです。以前は頭がよくて、頭の回転が速く、会話もうまくいっていたのですが、いまでは\nでも今は、それを失ってしまったような気がします。",
      "title": "なぜか、頭が悪くなったような気がする。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我23岁，独自生活，正在上学。我大部分时间都是相当孤立的。\n我觉得有一层厚厚的 \"雾 \"蒙蔽了我的能力，使我无法清楚地思考或与人合作。\n有效沟通的能力。我以前觉得自己很聪明，能够快速思考并进行对话。\n进行对话，但现在我觉得我已经失去了这种能力......",
      "title": "为什么我觉得自己越来越笨了呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我23歲，獨自生活，正在上學。我大部分時間都是相當孤立的。\n我覺得有一層厚厚的 \"霧 \"矇蔽了我的能力，使我無法清楚地思考或與人合作。\n有效溝通的能力。我以前覺得自己很聰明，能夠快速思考並進行對話。\n進行對話，但現在我覺得我已經失去了這種能力......",
      "title": "爲什麼我覺得自己越來越笨了呢？"
    }
  ]
}