{
  "author": "Wild-Mind2595",
  "original_created_utc": 1659192615,
  "title": "My Boyfriend watches Andrew Tate. What should I do ?",
  "created_utc": 1659200277,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;my boyfriend watches andrew tate. at first it was fine because i assumed he was just coming across these videos and some of them i actually found amusing. but his entire tik tok and instagram consists of this man shaming and bashing women and it’s begun to make me extremely uncomfortable. mainly because his attitude and opinions have changed dramatically and most of what he is saying is stemming from watching these videos, and i’ll admit it’s extremely hurtful to hear. he says that when we’re 25 we should have kids but he doesn’t want to be married, and if by 25 i don’t have kids, i will have done nothing with my life and it apparently won’t matter anymore. i am 20 years old, and so is he. i’ve had numerous jobs, one where i worked on planes (i have my pilots license) and he says i shouldn’t be doing it because that job is for men, and that i should want to be a stay at home mom and not work. he now believes that me, as a woman working a job that is “socially constructed for men,” i am disrespecting and undermining his masculinity. i don’t even know what the hell that means. he even suggests my sister is a whore because she lives in a popular city (she is a model). to him, if i do anything that isn’t considered a “norm” for my “given gender” then i am trying to be a man. it’s sucks because we’ve been together for four years, and i’ve never seen him like that. what should i do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/wbz840/my_boyfriend_watches_andrew_tate_what_should_i_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "wbz840",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "my boyfriend watches andrew tate. at first it was fine because i assumed he was\njust coming across these videos and some of them i actually found amusing. but\nhis entire tik tok and instagram consists of this man shaming and bashing women\nand it’s begun to make me extremely uncomfortable. mainly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のボーイフレンドはアンドリュー・テイトを見ています。\nと思っていました。\n彼のtik tokとインスタグラムは全てこの男が女性を貶め、バッシングすることで構成されています。\n私は非常に不快に感じるようになりました。",
      "title": "私のボーイフレンドは、アンドリュー・テイトを見る。私はどうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的男朋友看安德鲁-泰特。起初，这很好，因为我认为他只是遇到了这些视频，而有些视频我确实觉得很有趣。\n遇到这些视频，其中一些我觉得很有趣。\n他的整个Tik Tok和Instagram都是这个人在羞辱和抨击女性。\n这已经开始让我感到非常不舒服了。",
      "title": "我的男朋友在看安德鲁-塔特。我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的男朋友看安德魯-泰特。起初，這很好，因爲我認爲他只是遇到了這些視頻，而有些視頻我確實覺得很有趣。\n遇到這些視頻，其中一些我覺得很有趣。\n他的整個Tik Tok和Instagram都是這個人在羞辱和抨擊女性。\n這已經開始讓我感到非常不舒服了。",
      "title": "我的男朋友在看安德魯-塔特。我應該怎麼做？"
    }
  ]
}