{
  "author": "TitForSnack",
  "original_created_utc": 1643197916,
  "title": "Bukele and Erdogan are plotting against the IMF",
  "created_utc": 1643236746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Remember that meeting that took place between Erdogan and Bukele last week? If you don&amp;#39;t, you will probably read about it in the history books for it may have been one of the most important meetings in modern history.&lt;/p&gt;\n\n&lt;p&gt;Granted this is reddit so I don&amp;#39;t have any proof, but it makes a lot of sense so follow along:&lt;/p&gt;\n\n&lt;p&gt;Erdogan has been orange pilled. I think he, as well as anyone, realizes that American empire is collapsing. There is zero appetite for any military action &lt;em&gt;anywhere&lt;/em&gt; and barring some Pearl Harbour-like event, I don&amp;#39;t see the US going to war for anything.&lt;/p&gt;\n\n&lt;p&gt;So the world police has left the station, and they&amp;#39;re not coming back. When America is no longer interested in world affairs, all of the institutions America built during the post-war era will fall as well. The purpose of institutions like the IMF and the World Bank was always to serve America&amp;#39;s interests, ideological or Machiavellian. Without the US steering the ship, they will be lost and eventually rendered completely neutered. It will be like the Oscar&amp;#39;s of politics; no one will even care enough to notice when it&amp;#39;s finally gone.&lt;/p&gt;\n\n&lt;p&gt;This of course leaves a huge power vacuum in all sorts of different avenues, especially in international trade. Through the Petrodollar system, all oil trade around the world settles in USD. This gave the US immense soft power, since all oil importing countries like Turkey are forced to acquire dollars somehow and if they want to acquire dollars, they have to follow America&amp;#39;s wishes. If they didn&amp;#39;t want to adhere to the rules of the Petrodollar, they were free to join Saddam Hussein and Gaddafi six feet down under.&lt;/p&gt;\n\n&lt;p&gt;But like we&amp;#39;ve already established; the US won&amp;#39;t do another Iraq, nor another Libya. There is so little appetite for war that I believe that any attempt to start one might be enough to ignite a domestic revolution. The time for countries to free themselves from the Petrodollar is ripe.&lt;/p&gt;\n\n&lt;p&gt;Countries like Turkey then have two options; &lt;/p&gt;\n\n&lt;p&gt;Either they enter a similar agreement with China, and let China become the new global super power who gets to call the shots.&lt;/p&gt;\n\n&lt;p&gt;or they will build alternative systems where no single super power is in control.&lt;/p&gt;\n\n&lt;p&gt;I think it is fairly obvious what alternative is preferable for anyone who isn&amp;#39;t Chinese. The only question is &lt;em&gt;how&lt;/em&gt; would anyone be able to build institutions that can withstand Chinese pressure?&lt;/p&gt;\n\n&lt;p&gt;Enter bitcoin. &lt;/p&gt;\n\n&lt;p&gt;Here one might question whether the ideals of bitcoin are compatible with an increasingly authoritarian Turkish government. I don&amp;#39;t think however that Erdogan, nor any other leader, is particularly ideological. They want to stay in power of course but &lt;em&gt;how&lt;/em&gt; they do so isn&amp;#39;t the central focus. &lt;/p&gt;\n\n&lt;p&gt;Anyone who lives in a country that has been bullied by super powers knows the shame it brings to the people. It is one thing to be pushed around by one of your own, but to be pushed around by foreigners? A million times worse. If leaders of smaller countries like Erdogan, Bukele etc. manage to free their countries from American control &lt;em&gt;without&lt;/em&gt; entering a similarly abusive relationship with China, they will forever be entrenched in the nation&amp;#39;s collective memory, and they realize this. Bitcoin is their opportunity to do precisely that. In my opinion, it is their only option. They will never be able to convince any other country of joining an international monetary network that themselves control. But convincing other countries to join a network &lt;em&gt;no one&lt;/em&gt; controls might actually not be a very difficult task, for the reasons stated above. Every single country in the world are sick and tired of getting bullied by America and the last thing they want is to be bullied by a new super power, regardless of how authoritarian the regime might be. Bitcoin is the key that solves this puzzle. Bukele was the first head of state to come to this realization. He will not be the last.&lt;/p&gt;\n\n&lt;p&gt;TLDR;&lt;/p&gt;\n\n&lt;p&gt;The 20th century was the era of centralisation. With the fall of the American empire, we will enter an era of decentralisation. All the pieces are in play and now we are just waiting for the dominos to fall.&lt;/p&gt;\n\n&lt;p&gt;To finish this, I&amp;#39;d like to end with a quote from Erdogan from last month:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Turkey will never again submit its political and economic future to the prescriptions of global economic tutelage institutions, such as the IMF and similar institutions,&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.aa.com.tr/en/politics/turkey-will-never-submit-its-economic-future-to-imf-president-erdogan/2435775\"&gt;https://www.aa.com.tr/en/politics/turkey-will-never-submit-its-economic-future-to-imf-president-erdogan/2435775&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sounds familiar?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/CyaPuuSqPtnvPLZvayAv3YFjY7k-2MXa_OFlSbMmors.jpg?auto=webp&amp;s=7ef181af92a2270735d66c38e7532e8a04977ee7",
          "width": 864,
          "height": 486
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/CyaPuuSqPtnvPLZvayAv3YFjY7k-2MXa_OFlSbMmors.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=78634ab0e4562cb9205509cccf2859b727017b6a",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/CyaPuuSqPtnvPLZvayAv3YFjY7k-2MXa_OFlSbMmors.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=a77e03ae0d2ea0c8ca99dce14fc3704645924e5e",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/CyaPuuSqPtnvPLZvayAv3YFjY7k-2MXa_OFlSbMmors.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=4d20e8ce69488443f7eec83e9e19fa1f6bed8192",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/CyaPuuSqPtnvPLZvayAv3YFjY7k-2MXa_OFlSbMmors.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=68d0c8e6174e4f6cce273554872d1dfb17767f3e",
            "width": 640,
            "height": 360
          }
        ],
        "variants": {},
        "id": "zapDGMWnswuUAxrznMCUKj_tm-OMvVErZJFE8TrBQ0M"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/sd483m/bukele_and_erdogan_are_plotting_against_the_imf/",
  "subreddit": "Bitcoin",
  "id": "sd483m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Remember that meeting that took place between Erdogan and Bukele last week? If\nyou don't, you will probably read about it in the history books for it may have\nbeen one of the most important meetings in modern history.\n\nGranted this is reddit so I don't have any proof, but it makes a lot of sense…"
}