{
  "author": "uhsauh",
  "original_created_utc": 1636994028,
  "title": "Growing my newsletter to 100 subscribers in 1 month, sharing my learnings and growth channels",
  "created_utc": 1637020742,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone! Previously, I shared on this sub about the growth of my newsletter <a href=\"https://indiegrow.substack.com/\">indiegrow,</a> and how it was nearing 100 subscribers. I got comments asking me to share strategies and learnings.</p>\n\n<p>This week I finally reached the milestone of 100 subscribers and thought I could share a couple of growth channels that work for me. If you are running a newsletter or creating content for your business, maybe these could help.</p>\n\n<p>For background, my newsletter is a free newsletter for entrepreneurs who want to grow their Twitter following. I send my subscribers three tweets daily to comment on (Engage through comments is the best way for small accounts to gain followers in the beginning). I mainly created this newsletter for myself and others: to make friends and have a community while working on our start-ups / growing on Twitter.</p>\n\n<p><strong>First 50 subscribers</strong></p>\n\n<p>My initial ~30 subscribers came mostly from Indiehackers and my Twitter account (a small account with less than 600 followers).</p>\n\n<p>I announced my newsletter on Twitter first and created a post on Indiehackers sharing announcing the launch. After seeing the interest, I felt more motivated and shared the newsletter around here, on startupschool forum and a few other slack groups. This gained ~10 additional subscribers.</p>\n\n<p>After these initial outreach, I have been marketing the newsletter on Twitter through daily shares of what I sent out -- this usually consists of a Twitter thread with three tweets I sent out and a little plug at the end. I also try to promote my newsletter in comments under threads by large accounts. These tactics eventually got me to 50 before my first post.</p>\n\n<p><strong>Reaching 100 Subscribers</strong></p>\n\n<p>During the last couple of weeks, I prioritized consistency and not missing any day of the newsletter. I was also working on a launch with my co-founder, so I had less time to do marketing, but I try to promote whenever I can. I posted my newsletter on several newsletter directories and kept up with posting the threads on Twitter. I also posted my journey on indie hackers and a few other forums that I mentioned here. With time, it grew to 100.</p>\n\n<p><strong>Summing up the growth channels</strong></p>\n\n<p>Channels I have tried so far:</p>\n\n<ul>\n<li>Twitter</li>\n<li>Indiehackers</li>\n<li>startupschool forum</li>\n<li>Elpha</li>\n<li>Reddit</li>\n<li>my other newsletter</li>\n</ul>\n\n<p>Channels I have yet to try but curious about</p>\n\n<ul>\n<li>fb groups</li>\n<li>product hunt discussion boards</li>\n<li>product hunt launch</li>\n<li>cross-promotions</li>\n<li>ads in other newsletters</li>\n</ul>\n\n<p>That&#39;s about it. In conclusion, what helps the most is sharing the journey and being consistent (Setting up a really good system for writing and sharing helps alot with that). The growth has slowed down a bit since the first two weeks, but I think there is a lot I can improve. For example, I feel there are better ways to do the daily twitter share, though I haven&#39;t figured out what or how. Setting up a referral system is another thing that&#39;s on the back of my mind. If you have any ideas, feel free to suggest them below. Also, if you are looking to grow on Twitter together, I hope you&#39;d consider <a href=\"https://indiegrow.substack.com/\">subscribing</a> indiegrow!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/BWN1QxLvGR0LWqpw89doBGTojQTwacH-rdkdkZ0JO7o.jpg?auto=webp&s=ec0cb2c046109a7a68da9a96a6e464a61f088ed8",
          "width": 1128,
          "height": 564
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/BWN1QxLvGR0LWqpw89doBGTojQTwacH-rdkdkZ0JO7o.jpg?width=108&crop=smart&auto=webp&s=1dcac95f6c94583867b9e53b46259e81bbe90149",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/BWN1QxLvGR0LWqpw89doBGTojQTwacH-rdkdkZ0JO7o.jpg?width=216&crop=smart&auto=webp&s=a13ab6db0ad4db067cafb278540266cded2456dd",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/BWN1QxLvGR0LWqpw89doBGTojQTwacH-rdkdkZ0JO7o.jpg?width=320&crop=smart&auto=webp&s=f53e04dc3d546eb0eacff802adcdff70fd31237d",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/BWN1QxLvGR0LWqpw89doBGTojQTwacH-rdkdkZ0JO7o.jpg?width=640&crop=smart&auto=webp&s=e8ca32bd661d35fe5aa864b583bad57c280813c1",
            "width": 640,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/BWN1QxLvGR0LWqpw89doBGTojQTwacH-rdkdkZ0JO7o.jpg?width=960&crop=smart&auto=webp&s=ac539c72f6665a795143edb919890c8ee06cdb29",
            "width": 960,
            "height": 480
          },
          {
            "url": "https://external-preview.redd.it/BWN1QxLvGR0LWqpw89doBGTojQTwacH-rdkdkZ0JO7o.jpg?width=1080&crop=smart&auto=webp&s=81b9caf34ffb0a11a2b3c6791e5adfb4a48eb3c7",
            "width": 1080,
            "height": 540
          }
        ],
        "variants": {},
        "id": "Q25cCZMAVZPLB4AM_imZgNLHdnihAyvYmyojudBOHJc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/qukdm7/growing_my_newsletter_to_100_subscribers_in_1/",
  "subreddit": "SideProject",
  "id": "qukdm7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone! Previously, I shared on this sub about the growth of my newsletter\nindiegrow, [https://indiegrow.substack.com/] and how it was nearing 100\nsubscribers. I got comments asking me to share strategies and learnings.\n\nThis week I finally reached the milestone of 100 subscribers and thought I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。以前、このサブで私のメルマガの成長についてご紹介しましたが\nindiegrow, [https://indiegrow.substack.com/]の登録者数が100人に近づいていることを紹介しました。\nの購読者がいることをお伝えしました。その際、戦略や学びを共有してほしいというコメントをいただきました。\n\n今週、ついに登録者数が100人という節目を迎えたので、私は...",
      "title": "1ヶ月でニュースレターの購読者を100人に増やし、自分の学びと成長経路を共有する。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 之前，我在这个子上分享了关于我的通讯的增长情况\nindiegrow, [https://indiegrow.substack.com/] 以及它如何接近100个\n用户。我收到的评论要求我分享策略和经验。\n\n本周我终于达到了100个订阅者的里程碑，我想我...",
      "title": "在1个月内将我的通讯发展到100个订阅者，分享我的学习和成长渠道"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 之前，我在這個子上分享了關於我的通訊的增長情況\nindiegrow, [https://indiegrow.substack.com/] 以及它如何接近100個\n用戶。我收到的評論要求我分享策略和經驗。\n\n本週我終於達到了100個訂閱者的里程碑，我想我...",
      "title": "在1個月內將我的通訊發展到100個訂閱者，分享我的學習和成長渠道"
    }
  ]
}