{
  "author": "rootpl",
  "original_created_utc": 1633380962,
  "title": "Pandora Papers: I understand the outrage but what a lot of people forget here is the fact that a lot of those transactions were actually legal. That's the crazy and frustrating part about all this.",
  "created_utc": 1633423453,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes, it is shitty to hide assets, yes, it is shitty to not pay taxes etc. but if you read closely on some of the reports about the recent Pandora Papers scandal you&#39;ll realise that probably 95% if not more of those transactions were actually legal. The system is rigged and usually the rich and powerful enough, have enough resources, power, lawyers and advisors telling them how to use those loopholes. We shouldn&#39;t be angry that Tony Blair&#39;s wife saved 300k on stamp duty. We should be angry that this was even possible in the first place and the system is completely broken and against us regular people. I bet your accountant who does taxes for your small business once a year wouldn&#39;t be able to come up with those loopholes and strategies those people used. </p>\n\n<p>TLDR: Don&#39;t be angry with individuals, be angry with lawmakers, policymakers and people who rigged the system in the first place. And vote next time there&#39;s an election.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/q1ezdf/pandora_papers_i_understand_the_outrage_but_what/",
  "subreddit": "CryptoCurrency",
  "id": "q1ezdf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yes, it is shitty to hide assets, yes, it is shitty to not pay taxes etc. but if\nyou read closely on some of the reports about the recent Pandora Papers scandal\nyou'll realise that probably 95% if not more of those transactions were actually\nlegal. The system is rigged and usually the rich and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "資産を隠したり、税金を払わなかったりするのは確かに悪いことです。\n最近のパンドラ文書スキャンダルに関するいくつかの報道をよく読めば\nしかし、最近のパンドラ・ペーパー・スキャンダルに関するいくつかの報道をよく読めば、それらの取引の95％以上が実際には合法であったことに気づくでしょう。\n合法です。システムは不正に操作されており、通常、金持ちや...",
      "title": "パンドラペーパー。憤りを感じるのはわかりますが、多くの人が忘れているのは、これらの取引の多くが実際には合法的なものだったという事実です。それが今回の事件のクレイジーでイライラする部分です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，隐藏资产是糟糕的，是的，不交税是糟糕的，等等。\n你仔细阅读一些关于最近潘多拉文件丑闻的报道\n你就会意识到，这些交易中可能有95%甚至更多的交易实际上是\n合法的。这个系统是被操纵的，通常富人和...",
      "title": "潘多拉论文。我理解人们的愤怒，但很多人忘记了一个事实，即这些交易中有很多实际上是合法的。这就是关于这一切的疯狂和令人沮丧的部分。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，隱藏資產是糟糕的，是的，不交稅是糟糕的，等等。\n你仔細閱讀一些關於最近潘多拉文件醜聞的報道\n你就會意識到，這些交易中可能有95%甚至更多的交易實際上是\n合法的。這個系統是被操縱的，通常富人和...",
      "title": "潘多拉論文。我理解人們的憤怒，但很多人忘記了一個事實，即這些交易中有很多實際上是合法的。這就是關於這一切的瘋狂和令人沮喪的部分。"
    }
  ]
}