{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "I recently read [this](https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/) post by u/Dubs13151 on how to *think* about DCA-ing a windfall in a way that such that intuition matches with the optimal path as suggested by statistics and decision theory. \n\nThe post got a surprising amount of pushback for what I thought was a brilliant point, so I would like to attempt a short post on how to reconcile optimal decision-making with the reality of flawed human emotion.\n\nNow, the reason, as many pointed out, that DCA works as an *emotional*, not *rational*, strategy is a combination of [loss aversion](https://en.wikipedia.org/wiki/Loss_aversion) and [ownership bias](https://en.wikipedia.org/wiki/Endowment_effect). If you were a robot, DCA wouldn't even cross your robotic mind, but humans are not robots, and are prone to making bad decisions. Loss aversion makes it so that people don't feel as bad on missing out on gains as they do from losing money.\n\nBut I believe that it's silly to compromise on money for the sake of appeasing cognitive biases. I refuse to pay the cognitive biases in my brain rent, so here are some ways of *thinking* about investments in a way such that the *intuition* matches what a robot would do in your position.\n\n1.\tWhenever you evaluate your holdings, imagine that your rich uncle died yesterday and left you your current portfolio (for this thought experiment congress repealed step-up basis rules, RMDs, etc). What would you do, untainted by any history?\n\nAlternatively, if a robot picked up your portfolio, what would they do?\n\nThis is primarily to overcome the notion of \"losing\" and \"making\" money compared to where you entered your position. Just because you bought high doesn't mean it was a bad idea, and just because you bought low doesn't mean it was a good one. The feeling of losing money is never great, but that's just sunk-cost fallacy and loss aversion speaking.\n\nI have seen many investors talk about \"breaking even\" on a negative position. Stop. If you investments are bad, you should sell them even if it's a loss, don't wait for break-even. If a robot that picked up your portfolio would immediately liquidate a holding, so should you. Don't let sunk-cost fallacy get in the way of optimal decision-making.\n\nI know this might be a little controversial, but really think with your head for a second. Just because a loss is not realised doesn't mean it still isn't a loss. The money is already gone, throwing more money after it is not gonna do anything. Realisation of your P/L only matters for taxes; every time you look at your portfolio you should look at it with fresh eyes. The same thing with gains, but usually selling at a gain isn't an issue for most people on this sub.\n\nThis is also how to think about your portfolio during crashes. \"If I inherited this portfolio today, would I sell?\" In a crash, I think most people's answer would be \"I'd pour in money when everything's cheap\", so you should hold.\n\nThis works for both taxable and non-taxable accounts. Imagine a taxable account where an \"advisor\" sold your uncle some shitty funds/stocks and you have large amounts of gains; if you will sell, how will you unwind in a way that won't bankrupt you in taxes? \n\n2.\tPer [this](https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/) post, when entering the market from a large 100% cash position, imagine a parallel universe where you are already 100% invested. Would you sell and re-buy over the next ___ number of days/months/years?\n\nThis is because, as OP pointed out, there is no difference between 100% cash and 100% invested in &lt;portfolio of your choice&gt; if you can instantaneously switch between either. This is especially true in tax-advantaged accounts, since you really *could* instantly switch between whatever % of cash you wanted. Don't let recency bias eat your money.\n\nThis is really just a corollary to #1, but I felt like this warrants a special mention due to the frequency at which I see DCA being recommended. Before just silently resigning yourself to sub-optimal decisions, at least try to rewire your brain to align your intuition with your best interests.\n\nReally I think the above works not just for investment decisions, but for many life decisions. \"If I woke up tomorrow in this body, will I (move to a new city/find a new house/leave my job/divorce my wife)?\" We should not just sit there as resign ourselves to making suboptimal decisions. We should actively attempt to mould our thinking to more closely conform with mathematical reality.\n\nThe conclusion I wish to leave is *not* that emotions are dumb and we should all be robots, but that before going with a sub-optimal strategy, at least try to see if you can train your brain into *making better decisions*. If you truly believe that by going with a more optimal strategy your monkey brain will chicken out and leave you worse off, then don't; but acknowledge that you're leaving money on the table.",
  "author_fullname": "t2_119c5755",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "How to think about investment decisions rationally - an exercise in making emotions work for you, not against",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_txkghv",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.86,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 16,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Investment Theory",
  "can_mod_post": false,
  "score": 16,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1649247311,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1649246199,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently read &lt;a href=\"https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/\"&gt;this&lt;/a&gt; post by &lt;a href=\"/u/Dubs13151\"&gt;u/Dubs13151&lt;/a&gt; on how to &lt;em&gt;think&lt;/em&gt; about DCA-ing a windfall in a way that such that intuition matches with the optimal path as suggested by statistics and decision theory. &lt;/p&gt;\n\n&lt;p&gt;The post got a surprising amount of pushback for what I thought was a brilliant point, so I would like to attempt a short post on how to reconcile optimal decision-making with the reality of flawed human emotion.&lt;/p&gt;\n\n&lt;p&gt;Now, the reason, as many pointed out, that DCA works as an &lt;em&gt;emotional&lt;/em&gt;, not &lt;em&gt;rational&lt;/em&gt;, strategy is a combination of &lt;a href=\"https://en.wikipedia.org/wiki/Loss_aversion\"&gt;loss aversion&lt;/a&gt; and &lt;a href=\"https://en.wikipedia.org/wiki/Endowment_effect\"&gt;ownership bias&lt;/a&gt;. If you were a robot, DCA wouldn&amp;#39;t even cross your robotic mind, but humans are not robots, and are prone to making bad decisions. Loss aversion makes it so that people don&amp;#39;t feel as bad on missing out on gains as they do from losing money.&lt;/p&gt;\n\n&lt;p&gt;But I believe that it&amp;#39;s silly to compromise on money for the sake of appeasing cognitive biases. I refuse to pay the cognitive biases in my brain rent, so here are some ways of &lt;em&gt;thinking&lt;/em&gt; about investments in a way such that the &lt;em&gt;intuition&lt;/em&gt; matches what a robot would do in your position.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt; Whenever you evaluate your holdings, imagine that your rich uncle died yesterday and left you your current portfolio (for this thought experiment congress repealed step-up basis rules, RMDs, etc). What would you do, untainted by any history?&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Alternatively, if a robot picked up your portfolio, what would they do?&lt;/p&gt;\n\n&lt;p&gt;This is primarily to overcome the notion of &amp;quot;losing&amp;quot; and &amp;quot;making&amp;quot; money compared to where you entered your position. Just because you bought high doesn&amp;#39;t mean it was a bad idea, and just because you bought low doesn&amp;#39;t mean it was a good one. The feeling of losing money is never great, but that&amp;#39;s just sunk-cost fallacy and loss aversion speaking.&lt;/p&gt;\n\n&lt;p&gt;I have seen many investors talk about &amp;quot;breaking even&amp;quot; on a negative position. Stop. If you investments are bad, you should sell them even if it&amp;#39;s a loss, don&amp;#39;t wait for break-even. If a robot that picked up your portfolio would immediately liquidate a holding, so should you. Don&amp;#39;t let sunk-cost fallacy get in the way of optimal decision-making.&lt;/p&gt;\n\n&lt;p&gt;I know this might be a little controversial, but really think with your head for a second. Just because a loss is not realised doesn&amp;#39;t mean it still isn&amp;#39;t a loss. The money is already gone, throwing more money after it is not gonna do anything. Realisation of your P/L only matters for taxes; every time you look at your portfolio you should look at it with fresh eyes. The same thing with gains, but usually selling at a gain isn&amp;#39;t an issue for most people on this sub.&lt;/p&gt;\n\n&lt;p&gt;This is also how to think about your portfolio during crashes. &amp;quot;If I inherited this portfolio today, would I sell?&amp;quot; In a crash, I think most people&amp;#39;s answer would be &amp;quot;I&amp;#39;d pour in money when everything&amp;#39;s cheap&amp;quot;, so you should hold.&lt;/p&gt;\n\n&lt;p&gt;This works for both taxable and non-taxable accounts. Imagine a taxable account where an &amp;quot;advisor&amp;quot; sold your uncle some shitty funds/stocks and you have large amounts of gains; if you will sell, how will you unwind in a way that won&amp;#39;t bankrupt you in taxes? &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt; Per &lt;a href=\"https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/\"&gt;this&lt;/a&gt; post, when entering the market from a large 100% cash position, imagine a parallel universe where you are already 100% invested. Would you sell and re-buy over the next ___ number of days/months/years?&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;This is because, as OP pointed out, there is no difference between 100% cash and 100% invested in &amp;lt;portfolio of your choice&amp;gt; if you can instantaneously switch between either. This is especially true in tax-advantaged accounts, since you really &lt;em&gt;could&lt;/em&gt; instantly switch between whatever % of cash you wanted. Don&amp;#39;t let recency bias eat your money.&lt;/p&gt;\n\n&lt;p&gt;This is really just a corollary to #1, but I felt like this warrants a special mention due to the frequency at which I see DCA being recommended. Before just silently resigning yourself to sub-optimal decisions, at least try to rewire your brain to align your intuition with your best interests.&lt;/p&gt;\n\n&lt;p&gt;Really I think the above works not just for investment decisions, but for many life decisions. &amp;quot;If I woke up tomorrow in this body, will I (move to a new city/find a new house/leave my job/divorce my wife)?&amp;quot; We should not just sit there as resign ourselves to making suboptimal decisions. We should actively attempt to mould our thinking to more closely conform with mathematical reality.&lt;/p&gt;\n\n&lt;p&gt;The conclusion I wish to leave is &lt;em&gt;not&lt;/em&gt; that emotions are dumb and we should all be robots, but that before going with a sub-optimal strategy, at least try to see if you can train your brain into &lt;em&gt;making better decisions&lt;/em&gt;. If you truly believe that by going with a more optimal strategy your monkey brain will chicken out and leave you worse off, then don&amp;#39;t; but acknowledge that you&amp;#39;re leaving money on the table.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "039ac088-6c0f-11ec-9e3f-2294c5b4c8da",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ffd635",
  "id": "txkghv",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "arcane_in_a_box",
  "discussion_type": null,
  "num_comments": 6,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/txkghv/how_to_think_about_investment_decisions/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/txkghv/how_to_think_about_investment_decisions/",
  "subreddit_subscribers": 152723,
  "created_utc": 1649302841,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1649246199,
  "the_new_excerpt": "I recently read this\n[https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/]\npost by u/Dubs13151 [/u/Dubs13151] on how to think about DCA-ing a windfall in a\nway that such that intuition matches with the optimal path as suggested by\nstatistics and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近読んだ本\n[https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/]です。\nを考える方法について、u/Dubs13151 [/u/Dubs13151]が投稿しています。\n直感と最適経路が一致するような方法。\n統計学と...",
      "title": "投資判断の合理的な考え方 -感情を逆なでするのではなく、自分のために使う訓練"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近读到这个\n[https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/]\nu/Dubs13151 [/u/Dubs13151]的帖子，内容是关于如何思考DCA-ing意外之财的方式。\n的方式，使直觉与统计学所建议的最佳路径相吻合。\n统计数据和...",
      "title": "如何理性地思考投资决策--让情感为你工作，而不是反对你的练习"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近讀到這個\n[https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/]\nu/Dubs13151 [/u/Dubs13151]的帖子，內容是關於如何思考DCA-ing意外之財的方式。\n的方式，使直覺與統計學所建議的最佳路徑相吻合。\n統計數據和...",
      "title": "如何理性地思考投資決策--讓情感爲你工作，而不是反對你的練習"
    }
  ]
}