{
  "author": "galacticwyandotte",
  "original_created_utc": 1631395511,
  "title": "I’m scared reading all these ETH posts today, and thinking I should sell my ETH! please help!",
  "created_utc": 1631424637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am seeing all of these ETH-alternative posts today and lately. Yes, ETH is jammed up, yes gas fees are high, and yes other chains have cheaper fees and faster transaction time. Money is flowing into them, and that’s a little scary to me, because it seems like ETH could lose its first-mover advantage and get passed by other coins.</p>\n\n<p>Should I sell my ETH? Should I switch over to these other chains that are surging into the top 10? It seems risky to sell, yet I’m scared people are losing faith in ETH and the price will go down rather than up. Maybe ETH 2.0 actually is “a mess” and developers are switching to these other chains, and ETH won’t be able to recover. What do I do?</p>\n\n<p>I’ll tell you what I won’t do. I will not. I repeat. I will not sell my ETH. That’s exactly what these turd furgeson’s want, so they can scoop them up now while it’s still relatively cheap. So there. I’m not selling, and screw you for making me scared and telling me I should consider selling. Who’s with me? Diamond hands all the way</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/pmfr44/im_scared_reading_all_these_eth_posts_today_and/",
  "subreddit": "CryptoCurrency",
  "id": "pmfr44",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am seeing all of these ETH-alternative posts today and lately. Yes, ETH is\njammed up, yes gas fees are high, and yes other chains have cheaper fees and\nfaster transaction time. Money is flowing into them, and that’s a little scary\nto me, because it seems like ETH could lose its first-mover…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日も最近もETHオルタネイトの投稿ばかり見ています。はい、ETHは\n渋滞しているし、ガス代が高いし、他のチェーン店の方が料金が安くて\n取引時間も早い。お金がそちらに流れていて、それがちょっと怖いです。\nETHの先行者利益を失う可能性があるように思えるからです。",
      "title": "今日、これらのETHの記事を読んで怖くなり、ETHを売るべきだと思っています！助けてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天和最近看到的都是这些ETH-替代性的帖子。是的，ETH是\n是的，ETH被堵住了，是的，汽油费很高，是的，其他链子的费用更便宜，而且\n交易时间更快。钱正在流入它们，这让我有点害怕。\n对我来说，因为ETH似乎可能失去其先发优势......",
      "title": "今天看了这些ETH的帖子，我很害怕，觉得我应该卖掉我的ETH！请大家帮帮忙。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天和最近看到的都是這些ETH-替代性的帖子。是的，ETH是\n是的，ETH被堵住了，是的，汽油費很高，是的，其他鏈子的費用更便宜，而且\n交易時間更快。錢正在流入它們，這讓我有點害怕。\n對我來說，因爲ETH似乎可能失去其先發優勢......",
      "title": "今天看了這些ETH的帖子，我很害怕，覺得我應該賣掉我的ETH！請大家幫幫忙。"
    }
  ]
}