{
  "author": "xavierwest888",
  "original_created_utc": 1641385250,
  "title": "NFTs won't ruin computer games, greedy game companies will ruin computer games using NFTs",
  "created_utc": 1641393189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title says, there was a post recently in the gaming subreddit that was claiming that NFTs will ruin computer gaming further just like microtransactions did.&lt;/p&gt;\n\n&lt;p&gt;However, I disagree with that statement. If NFTs were in DnD they would be a lawful neutral force, they are not good or evil they are just a tool and being a transparent and open tool it makes them more easy to keep track of.&lt;/p&gt;\n\n&lt;p&gt;If anything NFTs should provide more consumer protection for digital game downloads than the present model of Microsoft being all like &amp;quot;trust me bra, we got this&amp;quot; until one day they just remove the game from the store and leave no public evidence that you ever owned it.&lt;/p&gt;\n\n&lt;p&gt;However, I also 100% guarantee that game companies are going to use this to further monetise the market for pointless crap cosmetics and strip even more out of a game to sell back to the player later.&lt;/p&gt;\n\n&lt;p&gt;But people shouldn&amp;#39;t hate the technology, that&amp;#39;s like hating the internet because game companies use the internet to download microtransactions, it really makes no sense. Hate the companies and hate the people buying their garbage.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 505,
  "permalink": "/r/CryptoCurrency/comments/rwlo57/nfts_wont_ruin_computer_games_greedy_game/",
  "subreddit": "CryptoCurrency",
  "id": "rwlo57",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As the title says, there was a post recently in the gaming subreddit that was\nclaiming that NFTs will ruin computer gaming further just like microtransactions\ndid.\n\nHowever, I disagree with that statement. If NFTs were in DnD they would be a\nlawful neutral force, they are not good or evil they are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、最近ゲーム系のサブレディットでこんな投稿がありました。\nNFTはマイクロトランザクションのようにコンピュータゲームをさらにダメにすると主張しています。\nした。\n\nしかし、私はその発言に反対です。もし、NFTがDnDに登場したら、彼らは\nローフル・ニュートラルな勢力であり、善でも悪でもない...。",
      "title": "NFTがコンピュータゲームを駄目にするのではなく、強欲なゲーム会社がNFTを使ってコンピュータゲームを駄目にするのだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，最近在游戏分论坛上有一个帖子，称\n声称NFTs将进一步毁掉电脑游戏，就像微交易一样\n那样。\n\n然而，我不同意这种说法。如果NFTs出现在DnD中，他们将是一个\n合法的中立力量，他们不是善或恶，他们是......",
      "title": "NFTs不会毁掉电脑游戏，贪婪的游戏公司会利用NFTs毁掉电脑游戏"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，最近在遊戲分論壇上有一個帖子，稱\n聲稱NFTs將進一步毀掉電腦遊戲，就像微交易一樣\n那樣。\n\n然而，我不同意這種說法。如果NFTs出現在DnD中，他們將是一個\n合法的中立力量，他們不是善或惡，他們是......",
      "title": "NFTs不會毀掉電腦遊戲，貪婪的遊戲公司會利用NFTs毀掉電腦遊戲"
    }
  ]
}