{
  "author": "BunnyFromClouds",
  "original_created_utc": 1659949303,
  "title": "[F19] Is it okay to not want sexual intercourse and only cuddles. Like.. Is it okay to not be horny at all?",
  "created_utc": 1659958068,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I never get sexual arousal at all, in any condition. Whenever I&amp;#39;m with my BF, all I can think of is to just cuddle and not involve in any sexual activity, not even making out. I feel the same when I watch pornographic content online. I have touched me-self maybe 5 times in my life, and I felt awful every time.&lt;/p&gt;\n\n&lt;p&gt;But on the other hand, I get really frustrated when I do not receive physical contact (The aforementioned cuddles, hugs, even holding his arm)&lt;/p&gt;\n\n&lt;p&gt;Is this normal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 150,
  "permalink": "/r/NoStupidQuestions/comments/wj41s4/f19_is_it_okay_to_not_want_sexual_intercourse_and/",
  "subreddit": "NoStupidQuestions",
  "id": "wj41s4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I never get sexual arousal at all, in any condition. Whenever I'm with my BF,\nall I can think of is to just cuddle and not involve in any sexual activity, not\neven making out. I feel the same when I watch pornographic content online. I\nhave touched me-self maybe 5 times in my life, and I felt awful…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どんな状態でも、まったく性的興奮を覚えない。BFといるときはいつも。\nただ抱き合うだけで、性行為には一切関与しない。\nイチャイチャもしない。ネットでポルノを観ても同じ感じ。I\n自分自身を触ったのは、人生で5回くらいで、ひどい気分でした。",
      "title": "[F19】性行為を望まず、抱擁だけでいいのか。ような。全くムラムラしないのはいいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在任何情况下，我都不会有性唤起。每当我和我的男朋友在一起的时候，我所想到的只是拥抱，不涉及任何性行为。\n我所能想到的只是拥抱，不参与任何性活动，甚至不亲热。\n甚至是亲热。当我在网上看色情内容时，我也有同样的感觉。I\n在我的生活中，我可能接触过自己5次，我感觉很糟糕......",
      "title": "[F19]不想要性交，只想要拥抱，可以吗。比如... 完全没有性欲可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在任何情況下，我都不會有性喚起。每當我和我的男朋友在一起的時候，我所想到的只是擁抱，不涉及任何性行爲。\n我所能想到的只是擁抱，不參與任何性活動，甚至不親熱。\n甚至是親熱。當我在網上看色情內容時，我也有同樣的感覺。I\n在我的生活中，我可能接觸過自己5次，我感覺很糟糕......",
      "title": "[F19]不想要性交，只想要擁抱，可以嗎。比如... 完全沒有性慾可以嗎？"
    }
  ]
}