{
  "author": "jasonluxton",
  "original_created_utc": 1639394830,
  "title": "If you’re spending money on crypto instead of gifts for loved ones this December, you are a degenerate.",
  "created_utc": 1639406025,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I was speaking with a mutual friend on discord, he told me how he bought the dip earlier this month and spent more than he usually would due to the size of the dip and as he expected a quick bounce back, problem is that now he’s completely screwed himself in terms of Christmas presents, he’s bought nothing for his family because he figured he could make a fast profit instead, this is a gamblers mentality.. using funds you really can’t afford to spend and taking massive risks with them. I feel sorry for anyone getting themselves in this position but seriously, when you’re spending money on speculative assets instead of gifts you planned to get for your own family, you’re nothing more than a degenerate, no ifs, no buts.&lt;/p&gt;\n\n&lt;p&gt;If you have problems with self-control, for the love of god, take the money out of your account you really need so you can’t fuck with it. Stop thinking crypto is going to go the way you expect it to within 5 minutes, this short term mentality will do nothing but get you in trouble.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Don’t be this guy.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;EDIT: This thread is about people with unhealthy tendencies or gambling addictions that planned to spend money a certain way and due to their tendencies have now spent said money.\nThis isn’t about what you believe Christmas means, consumerism or anything of the sort.\nIt’s about certain people having no control and losing sight of what’s important to them.&lt;/p&gt;\n\n&lt;p&gt;Please re-read this and note it’s about a friend of mine, who every year buys his family gifts, he’s now confided in me and let me know his addiction got the better of him, has spent that money he planned for his family, lost more on the dip and now he feels like shit for it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 205,
  "permalink": "/r/CryptoCurrency/comments/rfdn87/if_youre_spending_money_on_crypto_instead_of/",
  "subreddit": "CryptoCurrency",
  "id": "rfdn87",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I was speaking with a mutual friend on discord, he told me how he bought the\ndip earlier this month and spent more than he usually would due to the size of\nthe dip and as he expected a quick bounce back, problem is that now he’s\ncompletely screwed himself in terms of Christmas presents, he’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "で、共通の友人とディスコードで話していたら、彼が購入した経緯が\n今月上旬にディップを購入したのですが、サイズが大きかったため、普段より多く使ってしまいました。\nを期待したのですが、問題なのは、今彼が\nクリスマスプレゼントは完全に失敗した、彼は...。",
      "title": "今年の12月、愛する人へのプレゼントの代わりに暗号にお金を使っているとしたら、あなたは堕落しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和一个共同的朋友在网上聊天，他告诉我他是如何在本月早些时候购买了\n他告诉我，他在本月初买了一个跌停板，由于跌停板的大小，他花的钱比通常要多。\n由于他期待快速反弹，问题是现在他在圣诞礼物方面完全搞砸了。\n问题是现在他在圣诞礼物方面完全搞砸了，他...",
      "title": "如果你在今年12月把钱花在加密货币上，而不是给所爱的人送礼物，你就是个堕落的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和一個共同的朋友在網上聊天，他告訴我他是如何在本月早些時候購買了\n他告訴我，他在本月初買了一個跌停板，由於跌停板的大小，他花的錢比通常要多。\n由於他期待快速反彈，問題是現在他在聖誕禮物方面完全搞砸了。\n問題是現在他在聖誕禮物方面完全搞砸了，他...",
      "title": "如果你在今年12月把錢花在加密貨幣上，而不是給所愛的人送禮物，你就是個墮落的人。"
    }
  ]
}