{
  "author": "ifigiglhohofdyxcvi",
  "the_new_excerpt": "Initially posted this on bb_stock\n[https://www.reddit.com/r/BB_Stock/comments/lsxrq9/stop_whining/?utm_source=share&utm_medium=ios_app&utm_name=iossmf]\nand was hoping to get some sort of intelligent feedback but should have not made\nthat assumption. Figured I’d come here and see if I can solicit…",
  "original_created_utc": 1614369112,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最初发布在bb_stock上\n[https://www.reddit.com/r/BB_Stock/comments/lsxrq9/stop_whining/?utm_source=share&utm_medium=ios_app&utm_name=iossmf]\n并希望得到某种智能的反馈，但不应该使\n那个假设。我想来这里看看能不能征求... ...",
      "title": "一个黑莓讨论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最初發布在bb_stock上\n[https://www.reddit.com/r/BB_Stock/comments/lsxrq9/stop_whining/?utm_source=share&utm_medium=ios_app&utm_name=iossmf]\n並希望得到某種智能的反饋，但不應該使\n那個假設。我想來這裏看看能不能徵求... ...",
      "title": "一個黑莓討論"
    }
  ],
  "title": "A Blackberry Discussion",
  "created_utc": 1614378365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Initially posted this on <a href=\"https://www.reddit.com/r/BB_Stock/comments/lsxrq9/stop_whining/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">bb_stock </a> and was hoping to get some sort of intelligent feedback but should have not made that assumption. Figured I’d come here and see if I can solicit some better ideas. I’m new to <a href=\"/r/stocks\">r/stocks</a> so if I’ve screwed up on some of your rules please let me know.</p>\n\n<p>I generally invest in high growth data stocks as I work in the industry and I’m beginning to think blackberry will be nicely positioned in a couple of years to dominate and worst case the rising tide will raise all the boats.</p>\n\n<p>Smarter people can break down the financials so I want to focus on positioning, markets, branding, board members and the AWS partnership. I’m doing my best to clean up my last post because I realize this is a higher level of discourse.</p>\n\n<ol>\n<li>Repeat CEO: you’re not paying for someone to learn on the job, John Chen has done it before and can handle the stress. I’m thinking this is his swan song. </li>\n</ol>\n\n<p>He has a 90 million dollar bonus at a $30 USD price point for 10 days by 2023. don’t think CEOs generally miss out on 90 million dollar bonuses but hey what do I know.</p>\n\n<ol>\n<li>Potential market size: IOT security and data collection. I personally care the most about their auto investment in QNX and IVY but the board of directors reflect a whole slew of other bets that are also potentially majorly profitable. </li>\n</ol>\n\n<p>The military side of the equation may become more material with the New board member: Lisa Disbrow. \nOnce again I’ll defer to smarter people to do market evaluation and sizing. </p>\n\n<ol>\n<li><p>Sales orientation/cycle: this is a company that usually deals with governments, financial institutions, and enterprise clients. They are used to the longer and more complex sales cycles associated with this so there will be no learning curve when approaching larger clients.</p></li>\n<li><p><a href=\"https://www.blackberry.com/us/en/company/board-of-directors\">Board of directors:</a> I like to follow money and influence.</p></li>\n</ol>\n\n<p>Interesting highlights:</p>\n\n<p>John Chen’s: CEO that delivered an exit of Sybase. Really strong history of maintaining relationships in China and on trade boards with China. See BOD link above.</p>\n\n<p>Prem Watsa: Canada’s Warren Buffett. Reddit deity of justifying this investment. Fairfax financial and a value investor. He brought in John Chen</p>\n\n<p>Mike Daniels: John Chen’s Sybase buddy and cybersecurity executive. Well positioned to influence across the cyber security industry</p>\n\n<p>Timothy Dattels: TPG Capital major investor in Asia.</p>\n\n<p>Lisa Disbrow: New Board member. She is the military connection and was Senate-confirmed Under Secretary of the United States Air Force, and she served as Acting Secretary of the U.S. Air Force from January 2017 to May 2017.</p>\n\n<p>Richard Lynch : Ex-cto of Verizon wireless.</p>\n\n<p>Dr. Smaldone Alsup: Pharma positioning, take a look at <a href=\"https://pharmapprove.com\">PharmApprove</a> and you’ll get a better sense of her speciality working on positioning.</p>\n\n<p>Barbara Stymiest: Big player in Canada. Current portfolio includes: director of George Weston Limited, Sun Life Financial Inc. and the University Health Network, and is Chair of the Canadian Institute for Advanced Research. For you Americans out there George Weston is the really big name there.</p>\n\n<p>Wayne Wouters: Strategy and policy advisor on the government front. at one point he was Deputy Minister to the Prime Minister of Canada.</p>\n\n<p>Just wanted to give a high level breakdown of the board and if you can give a more complete picture on benefits and risks of these players I’d love to hear it.</p>\n\n<ol>\n<li>BLACKBERRY IVY:  Generally I don’t look that deeply into products but I’ll do you all a favour and break down the branding and real market value to both companies.</li>\n</ol>\n\n<p>It’s an Amazon partnership but it’s called Blackberry Ivy. Does that strike you as being a bit interesting? They avoided the Amazon brand name on purpose. BB owns the commercial relationship limiting Amazon’s exposure to the customer and fear of being screwed by the 2nd largest company in the world.</p>\n\n<p>Auto execs are all aware of competition risks coming from Apple and Google. Also on the Google front they have learned from advertising that Google like to own the data. Tesla is a direct competitor so I don’t see much risk losing OEM business to then.</p>\n\n<p>It’s been branded blackberry and avoided touching anything associated with data ownership to make the product more attractive to the OEMs.</p>\n\n<p>They are looking for a monopoly on the censors and data transfer and have what seems like a 2 year head start. \nThis is a rounding error for Amazon but material for bb. Amazon payoff will be the number of clients that transfer to AWS because of ease of integration and reduced costs of moving the data.</p>\n\n<ol>\n<li><p>Blackberry and Apple: every single employee of blackberry knows what happened with Apple and knows what happens when you sit comfortably on a lead as opposed to paying offence. If you are worried about a company culture that is stagnant and moving too slowly go find someone who is currently winning not a comeback kid.</p></li>\n<li><p>Negatives: \nShit brand with reputation as an loser. </p></li>\n</ol>\n\n<p>ARR: the only thing that really matters. Of course Ivy is a subscription that wasn’t a surprise. They need to show positive growth and then you can be considered a 10-20x revenue cap. Do that for 4 quarters and then you can be a cool kid and get to 50x.</p>\n\n<p>TL;DR. I want actual feedback so if you don’t just post rockets or some other bullshit that would be great</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/stocks/comments/lt66tp/a_blackberry_discussion/",
  "subreddit": "stocks",
  "id": "lt66tp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742112
}