{
  "author": "AccountToUseHigh",
  "original_created_utc": 1635187379,
  "title": "\"If you don’t believe it or don’t get it, I don’t have the time to try to convince you, sorry.\" – Satoshi Nakamoto",
  "created_utc": 1635212651,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;This is one of the earliest Bitcoin quotes in existence. The founder of Bitcoin, Satoshi Nakamoto, saw before everyone else what Bitcoin was capable of. In those early days, however, not many could imagine the potential of this new currency. Today, his invention has completely changed the world and it’s safe to assume that those early doubters should have done more research.&quot;</p>\n\n<p>Found this quote from internet. Thought it represents well that mentality which we all need to have. Time is most valuable asset. Don&#39;t waste your time trying to get people in cryptocurrency. If they are interested of course help them. But do not waste time on it.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/CryptoCurrency/comments/qfneaf/if_you_dont_believe_it_or_dont_get_it_i_dont_have/",
  "subreddit": "CryptoCurrency",
  "id": "qfneaf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"This is one of the earliest Bitcoin quotes in existence. The founder of\nBitcoin, Satoshi Nakamoto, saw before everyone else what Bitcoin was capable of.\nIn those early days, however, not many could imagine the potential of this new\ncurrency. Today, his invention has completely changed the world and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"これは現存する最も古いビットコインの名言の一つです。ビットコインの創始者である\nビットコインの創始者であるサトシ・ナカモトは、誰よりも早くビットコインの可能性を見抜いていました。\nしかし、初期の段階では、この新しい通貨の可能性を想像できた人は少なかった。\n通貨の可能性を想像することはできませんでした。今日、彼の発明は世界を完全に変え、...",
      "title": "\"信じられない、わからないという方には、説得しようとする時間がありません、すみません\" - 中本哲史"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"这是现存最早的比特币语录之一。比特币的创始人\n比特币的创始人，中本聪，比其他人更早看到了比特币的能力。\n然而，在那些早期的日子里，没有多少人能够想象这种新货币的潜力。\n货币的潜力。今天，他的发明已经完全改变了世界和...",
      "title": "\"如果你不相信或不理解，我没有时间去试图说服你，对不起。\" - 中本聪"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"這是現存最早的比特幣語錄之一。比特幣的創始人\n比特幣的創始人，中本聰，比其他人更早看到了比特幣的能力。\n然而，在那些早期的日子裏，沒有多少人能夠想象這種新貨幣的潛力。\n貨幣的潛力。今天，他的發明已經完全改變了世界和...",
      "title": "\"如果你不相信或不理解，我沒有時間去試圖說服你，對不起。\" - 中本聰"
    }
  ]
}