{
  "author": "GullibleAirport732",
  "the_new_excerpt": "To be very clear, I don't think women owe men relationships or anything. But I\ncan't help feel that whenever I see men share their dating struggles and how\nlooks impact them, they instantly get bashed and shamed. \"Just be confident bro\"\n\" It's probably your personality\". How can people deny and…",
  "original_created_utc": 1622896790,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はっきり言って、女性は男性に恋愛の義務があるなどとは思っていません。しかし、私は\nしかし、男性がデートの悩みや見た目の影響を語ると、即座にバッシングされたり、恥をかかされたりするような気がしてなりません。\n見た目がどのように影響するかを男性が話すと、即座にバッシングされ、恥をかかされるような気がしてなりません。\"Just be confident bro\"\n\" それはあなたの性格のせいでしょう」。人はどうして否定したり...",
      "title": "なぜ人は、人間関係に外見やお金は関係ないと主張するのでしょうか、それは間違いなくそうです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说得很清楚，我不认为女人欠男人关系或什么。但我\n我不禁感到，每当我看到男人分享他们的约会挣扎以及外貌对他们的影响时\n容貌对他们的影响，他们马上就会受到抨击和羞辱。\"只要自信就好，兄弟\"\n\" 这可能是你的个性\"。人们怎么能否认和...",
      "title": "为什么人们声称外表和金钱对关系并不重要，而它们肯定是重要的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說得很清楚，我不認爲女人欠男人關係或什麼。但我\n我不禁感到，每當我看到男人分享他們的約會掙扎以及外貌對他們的影響時\n容貌對他們的影響，他們馬上就會受到抨擊和羞辱。\"只要自信就好，兄弟\"\n\" 這可能是你的個性\"。人們怎麼能否認和...",
      "title": "爲什麼人們聲稱外表和金錢對關係並不重要，而它們肯定是重要的？"
    }
  ],
  "title": "Why do people claim looks and money don't matter for relationships, while they most certainly do?",
  "created_utc": 1622913596,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To be very clear, I don&#39;t think women owe men relationships or anything. But I can&#39;t help feel that whenever I see men share their dating struggles and how looks impact them, they instantly get bashed and shamed. &quot;Just be confident bro&quot; &quot; It&#39;s probably your personality&quot;. How can people deny and downplay another person&#39;s lived reality so easily? I&#39;m from Pakistan and here money is a very important factor for guys to get married. In Western countries, it seems women have tons of options in dating so it seems both money as well as looks matter. I fail to understand why people deny this. Yes, we should make the best use of whatever we have. But telling poor and ugly that looks and money don&#39;t matter just seems really patronizing and unrealistic.</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/TooAfraidToAsk/comments/nsuw1h/why_do_people_claim_looks_and_money_dont_matter/",
  "subreddit": "TooAfraidToAsk",
  "id": "nsuw1h",
  "is_self": true,
  "media": null,
  "is_video": false
}