{
  "author": "xerxxxx",
  "the_new_excerpt": "First of all, if you're still using 2FA through SMS, you really should consider\nswitching to an authenticator app such as Google Authenticator or Authy. This is\na significantly safer option than receiving 2FA codes via SMS.\n\nOnce you've done that, save yourself a potentially MASSIVE headache in…",
  "original_created_utc": 1624023160,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、SMSによる2FAを使用している場合は、Google AuthenticatorやAuthyなどの認証アプリへの切り替えを検討すべきです。\nGoogle AuthenticatorやAuthyなどの認証アプリに切り替えることをお勧めします。これは\nSMSで2FAコードを受信するよりもはるかに安全なオプションです。\n\nこのようにして、大きな頭痛の種となる可能性があります。",
      "title": "2FAのバックアップについての注意事項"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，如果你仍然通过短信使用2FA，你真的应该考虑\n切换到谷歌认证器或Authy等认证器应用。这是\n这是一个明显比通过短信接收2FA代码更安全的选择。\n\n一旦你这样做了，就可以为自己节省一个潜在的巨大的头痛问题。",
      "title": "友情提醒：备份你的2FA"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，如果你仍然通過短信使用2FA，你真的應該考慮\n切換到谷歌認證器或Authy等認證器應用。這是\n這是一個明顯比通過短信接收2FA代碼更安全的選擇。\n\n一旦你這樣做了，就可以爲自己節省一個潛在的巨大的頭痛問題。",
      "title": "友情提醒：備份你的2FA"
    }
  ],
  "title": "Friendly reminder to backup your 2FA",
  "created_utc": 1624048844,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, if you&#39;re still using 2FA through SMS, you really should consider switching to an authenticator app such as Google Authenticator or Authy. This is a significantly safer option than receiving 2FA codes via SMS.</p>\n\n<p>Once you&#39;ve done that, save yourself a potentially MASSIVE headache in the future and backup your 2FA. Ask anyone who has lost their primary device how much of a pain in the ass it was to get their access back to all their crypto accounts and you&#39;ll realize why. Most authenticator apps allow you to either enable multiple devices, export a token or generate a QR code to regain access to your 2FAs on another device. This is particularly important if you keep your authenticator app on your primary mobile device, which you&#39;re more likely to lose/break than a device that doesn&#39;t leave your house.</p>\n\n<p>As an example, I keep a backup of my 2FAs on an old smartphone that I no longer use. It just stays in a safe place in my home and if anything happened to my primary device I&#39;d still be able to access all of my crypto accounts.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/o2p6ry/friendly_reminder_to_backup_your_2fa/",
  "subreddit": "CryptoCurrency",
  "id": "o2p6ry",
  "is_self": true,
  "media": null,
  "is_video": false
}