{
  "author": "401TCW",
  "the_new_excerpt": "The winning bid for a seat on Blue Origin's first-ever space tourism flight came\nin at an eye-popping $28 million during a Saturday live auction.\n\nThe winner will be joining Blue Origin's founder Jeff Bezos on the New Shepard\nspacecraft for an 11-minute trip to the edge of space scheduled to blast…",
  "original_created_utc": 1623549608,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルーオリジン社による史上初の宇宙旅行フライトの座席の落札価格は\n土曜日に行われたライブオークションでは、2800万ドルという破格の値段で落札されました。\n\n落札者は、ブルーオリジン社の創業者であるジェフ・ベゾス氏と一緒に、ニューシェパード（New Shepard）と呼ばれる宇宙船に乗り込みます。\n搭乗するのは、ブルーオリジンの創業者であるジェフ・ベゾス。",
      "title": "ジェフ・ベゾスの宇宙船「ブルーオリジン」の座席を2800万ドルで落札"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在星期六的现场拍卖会上，蓝色起源公司有史以来第一次太空旅游飞行座位的中标价为\n在星期六的现场拍卖中，以令人瞠目结舌的2800万美元的价格拍得。\n\n获胜者将与蓝色起源的创始人杰夫-贝佐斯一起乘坐新谢泼德号\n航天器上，进行11分钟的太空旅行，计划在太空的边缘爆炸。",
      "title": "杰夫-贝索斯的蓝色起源号飞船座位的中标价为2800万美元"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在星期六的現場拍賣會上，藍色起源公司有史以來第一次太空旅遊飛行座位的中標價爲\n在星期六的現場拍賣中，以令人瞠目結舌的2800萬美元的價格拍得。\n\n獲勝者將與藍色起源的創始人傑夫-貝佐斯一起乘坐新謝潑德號\n航天器上，進行11分鐘的太空旅行，計劃在太空的邊緣爆炸。",
      "title": "傑夫-貝索斯的藍色起源號飛船座位的中標價爲2800萬美元"
    }
  ],
  "title": "Winning bid for a seat on Jeff Bezos' Blue Origin spacecraft goes for $28 million",
  "created_utc": 1623553689,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The winning bid for a seat on Blue Origin&#39;s first-ever space tourism flight came in at an eye-popping $28 million during a Saturday live auction.  </p>\n\n<p>The winner will be joining Blue Origin&#39;s founder Jeff Bezos on the New Shepard spacecraft for an 11-minute trip to the edge of space scheduled to blast off on July 20. The name of the winner will be released in coming weeks, the company said.  </p>\n\n<p>Bidding on Saturday opened at $4.8 million and quickly shot up to $28 million. Blue Origin opened the auction for a seat on the inaugural crewed New Shepard flight on May 5 and more than 7,000 people from 159 countries registered, the company said on Saturday. Some of those bidders will be contacted about taking a seat on future space flights, the company said.  </p>\n\n<p>In order to qualify for the &quot;Astronaut Experience,&quot; participants must meet a series of requirements set forth by Blue Origin, including the ability to deal with heights, walk on uneven surfaces, and handle up to three times the individual&#39;s weight. The participant will fill out a long series of waivers, as well as complete a special Blue Origin training program.  </p>\n\n<p>Bezos and the rest of the crew will float around the cabin of the spacecraft for just three minutes before strapping in again for the descent back to the ground.  </p>\n\n<p>Virgin Galactic — Sir Richard Branson&#39;s space tourism company — has sold tickets for about $250,000 to about 600 passengers.   </p>\n\n<p>Link: <a href=\"https://www.businessinsider.com/blue-origin-auction-spacecraft-jeff-bezos-winner-seat-astronaut-2021-6\">https://www.businessinsider.com/blue-origin-auction-spacecraft-jeff-bezos-winner-seat-astronaut-2021-6</a></p>\n</div><!-- SC_ON -->",
  "score": 913,
  "permalink": "/r/stocks/comments/nym9od/winning_bid_for_a_seat_on_jeff_bezos_blue_origin/",
  "subreddit": "stocks",
  "id": "nym9od",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743470
}