{
  "author": "EnclavedMicrostate",
  "original_created_utc": 1625674232,
  "title": "Clarifying the origin of a survey advertised on our sub",
  "created_utc": 1625686237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last night it came to our attention that an ad with the title, &quot;Use <a href=\"/r/AskHistorians\">r/AskHistorians</a>? Win $100 for taking our 5 minute survey on how to improve the subreddit&quot; was being promoted in our community. We want to clarify that we are not affiliated with the survey.</p>\n\n<p>While we have confirmed with the researchers that the survey is part of research study and does not appear to be a scam or phishing attempt, and that it received ethics approval from its institution’s IRB, we have requested they remove our community from the study immediately as we have several concerns.</p>\n\n<ol>\n<li><p>First, is that while asking for usernames and email addresses is standard operating procedure when offering incentives, there is no indication that the username it asks you to provide will be stored separately from your responses. There is no indication of who is anticipated to access the data. This is a security risk and thus <em>not</em> standard operating procedure in survey research.</p></li>\n<li><p>Second, there is no indication in the informed consent form that states that you can withdraw consent, or how you would be able to do so. This is also not standard operating procedure in research involving humans.</p></li>\n<li><p>Third, while the goals stated to us by the researchers when we reached out to them sound interesting and valuable to the reddit community as a whole, we believe the wording of the title, which suggests that results will help improve <a href=\"/r/AskHistorians\">r/AskHistorians</a> specifically and directly, is misleading. It is not clear to us how the results will improve our community, or indeed, even make their way back to us when the study is complete.</p></li>\n</ol>\n\n<p>We are highly supportive of research on <a href=\"/r/AskHistorians\">r/AskHistorians</a>. We are regularly contacted with research requests and often agree to participate after we’ve discussed the project with the researchers and have confirmed IRB approval. <em>Researchers interested in working with us should contact us first, so that we can ensure that research goals align with our interests, those of our community, and that our community will be safe from harm.</em> Not only did that not happen here, but because the survey was posted as an ad we couldn’t remove it until we could confirm that it was indeed an academic survey and not a scam.</p>\n\n<p>We aren’t sure if the ad is still running. If it is, we’d like to be clear that this is not a study the <a href=\"/r/AskHistorians\">r/AskHistorians</a> mod team has approved or endorsed.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/ofm2b1/clarifying_the_origin_of_a_survey_advertised_on/",
  "subreddit": "AskHistorians",
  "id": "ofm2b1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Last night it came to our attention that an ad with the title, \"Use\nr/AskHistorians [/r/AskHistorians]? Win $100 for taking our 5 minute survey on\nhow to improve the subreddit\" was being promoted in our community. We want to\nclarify that we are not affiliated with the survey.\n\nWhile we have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨晩、私たちの目にとまったのは、「Use」というタイトルの広告でした。\nr/AskHistorians [/r/AskHistorians]? サブレディットを改善する方法についての5分間のアンケートに答えて100ドルを獲得しよう\nというタイトルの広告が私たちのコミュニティで宣伝されていることに気づきました。私たちは\n私たちは、このアンケートとは無関係であることを明確にしたいと思います。\n\n私たちは...",
      "title": "サブサイトに掲載されているアンケートの出所を明らかにする"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天晚上，我们注意到，一个标题为 \"使用\nr/AskHistorians [/r/AskHistorians]? 参加我们的5分钟调查就能赢得100美元\n赢取100美元 \"的广告正在我们的社区中推广。我们想\n澄清我们与该调查没有关系。\n\n虽然我们有...",
      "title": "澄清在我们的网站上宣传的一项调查的来源"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天晚上，我們注意到，一個標題爲 \"使用\nr/AskHistorians [/r/AskHistorians]? 參加我們的5分鐘調查就能贏得100美元\n贏取100美元 \"的廣告正在我們的社區中推廣。我們想\n澄清我們與該調查沒有關係。\n\n雖然我們有...",
      "title": "澄清在我們的網站上宣傳的一項調查的來源"
    }
  ]
}