{
  "author": "rundown03",
  "original_created_utc": 1656677200,
  "title": "Whats up with the coinbase fud",
  "created_utc": 1656727155,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First we&amp;#39;re seeing fud that coinbase might be insolvent. Wich is just plain ridiculous if you check their revenue. They are literally a money making machine with all the fees from you apes.&lt;/p&gt;\n\n&lt;p&gt;Next we&amp;#39;re seeing those posts that they are selling geo location. Guess what almost all websites nowadays contains a google pixel. Wich is giving your geo location away for free even.  &lt;/p&gt;\n\n&lt;p&gt;Now there was a post about insider trading.&lt;/p&gt;\n\n&lt;p&gt;So my question is, who is trying to take down these big crypto companies right now. We&amp;#39;re seeing them collapse one by one. And it looks as if coinbase is next on their target.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/voz9f7/whats_up_with_the_coinbase_fud/",
  "subreddit": "CryptoCurrency",
  "id": "voz9f7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First we're seeing fud that coinbase might be insolvent. Wich is just plain\nridiculous if you check their revenue. They are literally a money making machine\nwith all the fees from you apes.\n\nNext we're seeing those posts that they are selling geo location. Guess what\nalmost all websites nowadays…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まずcoinbaseが債務超過に陥るかもしれないというフシがある。コインベースが破産するかもしれないという\n馬鹿げている。彼らは文字通り金儲けマシーンです。\nお前ら猿からの手数料で\n\n次に、位置情報を売っているという書き込みを目にしました。何を推測する\n最近のほとんどのウェブサイトは...",
      "title": "コインベースはどうしたんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先我们看到的是coinbase可能破产的假消息。如果你检查一下他们的收入，就会发现Wich只是普通的\n荒谬的，如果你检查他们的收入。他们简直是一台赚钱机器\n所有的费用都来自于你们这些猿人。\n\n接下来，我们看到那些关于他们正在出售地理定位的帖子。你猜怎么着\n现在几乎所有的网站...",
      "title": "币基的假货是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先我們看到的是coinbase可能破產的假消息。如果你檢查一下他們的收入，就會發現Wich只是普通的\n荒謬的，如果你檢查他們的收入。他們簡直是一臺賺錢機器\n所有的費用都來自於你們這些猿人。\n\n接下來，我們看到那些關於他們正在出售地理定位的帖子。你猜怎麼着\n現在幾乎所有的網站...",
      "title": "幣基的假貨是怎麼回事？"
    }
  ]
}