{
  "author": "hbarSquared",
  "original_created_utc": 1654854599,
  "title": "What the heck happened in Södertälje, Sweden in 1719?",
  "created_utc": 1654871716,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently moved from the US to Sweden and bought a house in Södertälje, a beautiful city in Stockholm county with a lot of history. However, one of the buildings in the city center has &lt;a href=\"https://imgur.com/a/7kndcNs\"&gt;this mural&lt;/a&gt; on a keystone. Clearly, something big went down that year but I haven&amp;#39;t been able to find any info on it. What event is this commemorating?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/v945pn/what_the_heck_happened_in_södertälje_sweden_in/",
  "subreddit": "AskHistorians",
  "id": "v945pn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently moved from the US to Sweden and bought a house in Södertälje, a\nbeautiful city in Stockholm county with a lot of history. However, one of the\nbuildings in the city center has this mural [https://imgur.com/a/7kndcNs] on a\nkeystone. Clearly, something big went down that year but I haven't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、アメリカからスウェーデンに移住し、Södertälje（セーデルタリエ）という街に家を買いました。\nストックホルム県にある、歴史のある美しい街です。しかし、街の中心部にある建物のひとつに\nの壁画[https://imgur.com/a/7kndcNs]があります。\nがあります。明らかにその年に何か大きな出来事があったようですが、私はまだ・・・。",
      "title": "1719年、スウェーデンのセーデルタリエで一体何が起こったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近从美国搬到了瑞典，并在索德泰尔耶买了一套房子。\n这是一个位于斯德哥尔摩县的美丽城市，有很多的历史。然而，其中一个\n市中心的一栋建筑在一块基石上有这样的壁画[https://imgur.com/a/7kndcNs]。\n钥匙石上的壁画。很明显，那一年发生了一些大事，但我还没有...",
      "title": "1719年在瑞典的Södertälje到底发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近從美國搬到了瑞典，並在索德泰爾耶買了一套房子。\n這是一個位於斯德哥爾摩縣的美麗城市，有很多的歷史。然而，其中一個\n市中心的一棟建築在一塊基石上有這樣的壁畫[https://imgur.com/a/7kndcNs]。\n鑰匙石上的壁畫。很明顯，那一年發生了一些大事，但我還沒有...",
      "title": "1719年在瑞典的Södertälje到底發生了什麼？"
    }
  ]
}