{
  "author": "elvita12345",
  "the_new_excerpt": "OVERVIEW\n\nVital Farms is a certified B-Corp focused on ethically growing pasture raised\neggs and butter. They do this by partnering with roughly 200 family farms that\nshare the mentality of putting the welfare of the animals before anything else\nand engaging in sustainable farming practices. All of…",
  "original_created_utc": 1614908330,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "概述\n\n生命力农场是一家经过认证的B-Corp，专注于以道德的方式种植牧草。\n鸡蛋和黄油。他们通过与大约200个家庭农场合作来实现这一目标。\n有着 \"以人为本 \"的心态。\n并从事可持续农业实践。所有的...",
      "title": "生命力农场（VITL）DD--一个非技术性增长的游戏。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "概述\n\n生命力農場是一家經過認證的B-Corp，專注於以道德的方式種植牧草。\n雞蛋和黃油。他們通過與大約200個家庭農場合作來實現這一目標。\n有着 \"以人爲本 \"的心態。\n並從事可持續農業實踐。所有的...",
      "title": "生命力農場（VITL）DD--一個非技術性增長的遊戲。"
    }
  ],
  "title": "Vital Farms (VITL) DD - A non-tech growth play",
  "created_utc": 1614923743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Overview</h1>\n\n<p>Vital Farms is a certified B-Corp focused on ethically growing pasture raised eggs and butter. They do this by partnering with roughly 200 family farms that share the mentality of putting the welfare of the animals before anything else and engaging in sustainable farming practices. All of the farms are located in “The Pasture Belt”, an area notorious for favorable weather all year long.</p>\n\n<h1>Management and employee satisfaction</h1>\n\n<p>The company was founded by Matt O’Hayer in 2007. He is the founder and former president of the Organic Egg Farmers of America and is still the Executive Chairman and Director of Vital Farms.</p>\n\n<p>The current CEO is Russell Diez-Canseco. Previous work experience includes McKinsey &amp; Company, H-E-B Grocery, and the Central Intelligence Agency (he also has an MBA from Harvard University).</p>\n\n<p>Other senior management members have extensive experience in the food industry.</p>\n\n<p>The company has a 4.2 rating on Glassdoor (50 reviews), 88% approval of the CEO and the reviews highlight the employees alignment and motivation with the company’s ethical mission. A few reviews complain about managers (not uncommon on Glassdoor) and about the company’s culture.</p>\n\n<h1>Industry and competition</h1>\n\n<p>Vital Farms is active in the highly-competitive and fragmented US food industry with a focus on retail consumers and a few partnerships with restaurants.</p>\n\n<p>Notable competitors include Cal-Maine Foods (NASDAQ: CALM), Rose Care Farms and other major US egg producers.</p>\n\n<h1>Moats and competitive advantages</h1>\n\n<p>Vital Farms differentiates itself from competitors by focusing on the ethical side of the production and farming of its eggs and dairy products. Customers and reviewers claim the products are of higher quality and of greater taste due to the production approach they’re taking. Customer reviews and satisfaction is extremely high (their standard egg carton has a 4.9 out of 5 rating on Amazon based on 5,985 reviews with customers praising the premium quality).</p>\n\n<p>Although their eggs are pricier than competitors, consumers haven’t been minding shelling out the difference for the premium quality. </p>\n\n<p>Their marketing is unique and exceptional amongst competitors. To exemplify a part of this, they allow buyers to check out the farm where their eggs were laid in a 360 degree video to see if it’s up to snuff and they have a reward program for filling up a “pasture passport” with the names of 10 different farms.</p>\n\n<p>Their branding and packaging is also really strong and although it is still a small company, it is starting to show strong brand loyalty among its consumers (a significant percentage of first-time buyers during the COVID-19 pandemic became repeat buyers according to the CEO).</p>\n\n<p>Although the company does not have a truly strong moat at the moment, in my opinion they’re well on their way to building themselves one by the customer loyalty they’re amassing and the network of small farms they’re building.</p>\n\n<h1>Areas of growth</h1>\n\n<p>The company has been willing and adventurous when it comes to expanding their product line into sub-products (Egg bites, hard boiled eggs, liquid whole eggs) and completely new segments (butter). A natural next-step for the company at this point, in my opinion, would be to expand their dairy products further (milk, cream, etc.) to tap into other large markets.</p>\n\n<p>Partnerships with large restaurant chains willing to back sustainable farming practices could also be a catalyst for growth.</p>\n\n<p>One could argue there is also potential internationally for Vital Farms, but I believe this is very far-off the current road-map. </p>\n\n<h1>Potential headwinds</h1>\n\n<p>As previously mentioned, the industry they operate in is highly fragmented and it’s unlikely Vital Farms will own a majority of market share in their segment. The egg and dairy industry is also notoriously smaller and has a lower CAGR than other high-flying fast-growing industries, so Vital Farm’s TAM and market cap growth is capped unless they manage to go international successfully or tap into new product and revenue streams.</p>\n\n<h1>Institutional and insider ownership, short interest</h1>\n\n<ul>\n<li><p>Institutional ownership sits at about 51-52% (including a 4.1% indirect ownership by Amazon.com).</p></li>\n<li><p>Insider ownership: </p></li>\n<li><p>Mathew O’Hayer (Founder, chairman): 10,650,494 shares </p></li>\n<li><p>Brent Drever (Board Member): 2,533,512 shares </p></li>\n<li><p>Karl Khoury (Board Member): 1,780,380 shares</p></li>\n<li><p>Glenda J. Flanagan (Board Member): 1,603,230 shares </p></li>\n<li><p>Jason L. Jones (Co-Founder, Ex-President): 640,461 shares </p></li>\n<li><p>Peter Nicholas Pappas (Chief Sales Officer): 91,972 shares </p></li>\n<li><p>Jeffrey S Dawson (listed as Chief Accounting Officer): 40,377 shares </p></li>\n<li><p>Gisel Ruiz (Board Member): 16,500 shares </p></li>\n<li><p>Denny Marie Post (Board Member): 7,500 shares</p></li>\n<li><p>Kofi Amoo-Gottfried (Board Member): 4,788 shares </p></li>\n<li><p>Dale Jason (COO): 246 shares</p></li>\n</ul>\n\n<p><strong>- Total % of outstanding shares held by insiders: 44%.</strong></p>\n\n<p><strong>Important to note that the CEO does not own any shares and is apparently on a stock-based compensation program.</strong></p>\n\n<ul>\n<li>Short interest is currently 18.85% of the total floating shares</li>\n</ul>\n\n<h1>Earnings</h1>\n\n<p><strong>From the latest earning report:</strong></p>\n\n<ul>\n<li>Quarterly net revenue was $53.4 million, up 57% YoY</li>\n<li>Quarterly gross margin of 34.38%, up 3% YoY</li>\n<li><p>Quarterly net income of $1.677 million, up 102.29% YoY</p></li>\n<li><p>Guidance for full-year 2020 of revenue between $210 to $214 million, representing a 49% YoY increase over 2019</p></li>\n<li><p>Q4 and Full-Year 2020 earnings report on March 24 2021.</p></li>\n</ul>\n\n<h1>Balance Sheet</h1>\n\n<ul>\n<li>$112,619 Million in Cash and Cash Equivalents </li>\n<li>$145,901 Million of Total Current Assets</li>\n<li><p><strong>$177,593 Million of Total Assets</strong></p></li>\n<li><p>$26,056 Million of Current Liabilities</p></li>\n<li><p>$6,480 Million of Long-Term Debt</p></li>\n<li><p><strong>$35,574 Million of Total Liabilities</strong></p></li>\n</ul>\n\n<h1>Valuation metrics</h1>\n\n<ul>\n<li>Market cap: $1.078 Billion </li>\n<li>Total shares outstanding: 39.43 Million</li>\n<li><strong>PE Ratio: 94</strong></li>\n<li>P/S Ratio: 5</li>\n<li>P/B Ratio: 7.8</li>\n<li>D/E Ratio: 0.25</li>\n<li><strong>Free Cash Flow (39 week-period): $8.315 Million</strong></li>\n<li><strong>PEG Ratio: ≈ 1.36</strong></li>\n</ul>\n\n<h1>Principal financial metrics of closest competitor</h1>\n\n<p><strong>NASDAQ: CALM</strong></p>\n\n<ul>\n<li>Market Cap: $1.955 Billion</li>\n<li>Revenue: $1.43 Billion (growth has been very stagnant and erratic since 2014)</li>\n<li>PE Ratio: 29.14</li>\n<li>PS Ratio: 1.37</li>\n</ul>\n\n<h1>Price action</h1>\n\n<p>Vital Farms went public on July 31st 2020 and currently sits 36.84% below its 52-week high. It traded sideways after it’s IPO and has been declining since November 2020.</p>\n\n<p>Important to note that the current price held fairly well amongst the recent growth stock correction (only declining ≈ 8.5% from its February peak).</p>\n\n<h1>Conclusion</h1>\n\n<ol>\n<li>Extremely high institutional and insider ownership (almost 95% of the total outstanding shares are being held by insiders and institutions - including a small 4.1% stake by Amazon.com).</li>\n<li><strong>Very strong balance sheet with lots of cash and very light on long-term debt and liabilities.</strong></li>\n<li><strong>Growing revenues at &gt; 50% per year and management aiming to grow at over 40% in 2021 and 2022.</strong></li>\n<li><strong>Net income growing at over 60% YoY.</strong></li>\n<li><strong>Profitable, cash flow positive.</strong></li>\n<li>High employee satisfaction and brand loyalty and high ratings from customers.</li>\n<li>Innovating in existing product lines and opportunity to venture into other product segments.</li>\n<li>Brilliant marketing.</li>\n<li>Opportunity to invest in a fast-growing non-tech ethical business at an attractive valuation.</li>\n</ol>\n\n<p>Disclaimer: I’m long Vital Farms and have a position of 3,636 shares at an average cost of $27.50 as of the time of this writing.</p>\n</div><!-- SC_ON -->",
  "score": 96,
  "permalink": "/r/investing/comments/ly0x13/vital_farms_vitl_dd_a_nontech_growth_play/",
  "subreddit": "investing",
  "id": "ly0x13",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574784
}