{
  "author": "xcryptogurux",
  "the_new_excerpt": "In 2006, the Fed decided to abort publishing the M3 stock, dismissing it as\n\"irrelevant and not being part of monetary policies for a long time\"\n\nBut the truth was, M3 was increasing at a much more alarming rate (nearly 2x)\nthan M2 following the dot-com bailouts in the early 2000s. Just as the Fed…",
  "original_created_utc": 1622702311,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2006年、FRBはM3ストックの公表を中止することを決定し、次のように切り捨てました。\n\"無関係であり、長い間、金融政策の一部ではなかった \"と切り捨てた。\n\nしかし実際には、2000年代初頭のドットコム救済後、M3はM2よりもはるかに憂慮すべき速度（約2倍）で増加していた。\n2000年代初頭のドットコム救済後、M2よりもM3の方がはるかに驚異的な勢いで増加していたのです。ちょうど、FRBが...",
      "title": "米連邦準備制度理事会（FRB）がマネーサプライ・データの週次発表を中止したことで、あなたは非常に心配しなければならない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2006年，美联储决定放弃公布M3库存，认为它是\n\"无关紧要，在很长一段时间内不会成为货币政策的一部分\"\n\n但事实是，在2000年代初的网络公司救助行动之后，M3以比M2更惊人的速度增长（近2倍）。\n比M2在2000年代初的网络公司救助后的增长速度更惊人。就在美联储...",
      "title": "美联储已经停止了每周发布的货币供应量数据，你应该非常担心"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2006年，美聯儲決定放棄公佈M3庫存，認爲它是\n\"無關緊要，在很長一段時間內不會成爲貨幣政策的一部分\"\n\n但事實是，在2000年代初的網絡公司救助行動之後，M3以比M2更驚人的速度增長（近2倍）。\n比M2在2000年代初的網絡公司救助後的增長速度更驚人。就在美聯儲...",
      "title": "美聯儲已經停止了每週發佈的貨幣供應量數據，你應該非常擔心"
    }
  ],
  "title": "The Federal Reserve has discontinued the weekly release of money supply data and you should be very worried",
  "created_utc": 1622720469,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 2006, the Fed decided to abort publishing the M3 stock, dismissing it as &quot;irrelevant and not being part of monetary policies for a long time&quot;</p>\n\n<p>But the truth was, M3 was increasing at a much more alarming rate (nearly 2x) than M2 following the dot-com bailouts in the early 2000s. Just as the Fed and pro-administration pundits habitually make sure to focus on whatever consumer price measure increases the least to play down inflation, the Fed wanted to divert public attention towards a money supply measure which was increasing at a relatively lesser rate at the time - the M2 stock.</p>\n\n<p>We all know what happened 2 years later.</p>\n\n<p>Now fast forward 15 years, this is what M1 and M2 look like</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/uu489cywuz271.png?width=1167&amp;format=png&amp;auto=webp&amp;s=228f277cf10f073b536140e25ce9ffa87edef693\">M1 Money Stock</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5ambkp70vz271.png?width=1164&amp;format=png&amp;auto=webp&amp;s=684238dad9f8178843e5bebb2239b572bef6dd63\">M2 Money Stock</a></p>\n\n<p>As you can see, M1 stock, which is all the loose money in active circulation plus your checking bank deposits, is melting faces and going to the moon!</p>\n\n<p><strong>M1 has risen from $4 trillion in March 2020 to $18 trillion in February 2021.</strong></p>\n\n<p>M2, which is M1 plus savings deposits and funds, is up as well but not as much. This is a clear indication that people have been forced to abort saving/investing.</p>\n\n<p>Both these metrics are a bad look for the economy. So for the time being, the Fed has stopped the weekly release of this information while they figure out how to spin this in their favor just like they did in 2006. Again, we know what happened 2 years later.</p>\n</div><!-- SC_ON -->",
  "score": 875,
  "permalink": "/r/Bitcoin/comments/nr6ttq/the_federal_reserve_has_discontinued_the_weekly/",
  "subreddit": "Bitcoin",
  "id": "nr6ttq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404877354
}