{
  "author": "1silvertiger",
  "the_new_excerpt": "If I'm not a professor, how can I stay involved in philosophy? I know I can read\nbooks and I have. But I want something more rigorous than just teaching myself,\nsince I feel that I'm in a poor position to give myself a high-quality\neducation. I want to do more than memorize the orthodox…",
  "original_created_utc": 1612620587,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果我不是教授，怎么能继续从事哲学研究？我知道我可以读\n书，我也有。但我想要的是更严谨的东西，而不仅仅是自学。\n因为我觉得我没有能力给自己一个高质量的。\n教育。我想做的不仅仅是背诵正统的... ...",
      "title": "不加入学术界，如何涉足哲学？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我不是教授，怎麼能繼續從事哲學研究？我知道我可以讀\n書，我也有。但我想要的是更嚴謹的東西，而不僅僅是自學。\n因爲我覺得我沒有能力給自己一個高質量的。\n教育。我想做的不僅僅是背誦正統的... ...",
      "title": "不加入學術界，如何涉足哲學？"
    }
  ],
  "title": "How to get involved in philosophy without joining academia?",
  "created_utc": 1612652140,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I&#39;m not a professor, how can I stay involved in philosophy? I know I can read books and I have. But I want something more rigorous than just teaching myself, since I feel that I&#39;m in a poor position to give myself a high-quality education. I want to do more than memorize the orthodox interpretations on different texts, but I don&#39;t want to be full of my own crazy ideas, either. I know I could take a few classes on the side, and I plan to, but over my lifetime the classes won&#39;t amount to a lot of time. Are there groups or clubs I could join where philosophers meet that also accept laypeople? I&#39;ve thought about writing my own papers or commentaries, but without feedback, I&#39;m not sure how useful that would be. </p>\n\n<p>For context, I was thinking about getting a PhD in philosophy, but I&#39;ve decided against trying because of the terrible job prospects afterward (I want to be a professor, not get a random job where philosophy is tangentially helpful). In my current field of computer science, if someone isn&#39;t a developer, there are still open source projects they can contribute to. If someone is into history, there are historical societies they can volunteer at. Is there anything like that for philosophy? Thanks in advance.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/ldyb4i/how_to_get_involved_in_philosophy_without_joining/",
  "subreddit": "askphilosophy",
  "id": "ldyb4i",
  "is_self": true,
  "media": null,
  "is_video": false
}