{
  "author": "badfishbeefcake",
  "original_created_utc": 1651464872,
  "title": "Guys , this is what a bear market is.",
  "created_utc": 1651506577,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The market has a negative trend from 6 months, and flat (if you are very optimistic) for 1 year.&lt;/p&gt;\n\n&lt;p&gt;Now, we see the bad news coming out, Cro, Solana(again), and more will come. In a near future, people will ask, so much good news, why is it still crashing?&lt;/p&gt;\n\n&lt;p&gt;And its now cryptos fault, im very bullish on 2 to 3 years from nom. But right now, the post pandemic is hitting us. Same things are happening on stocks…. do you think wallstreetsbet is having a good time? No they dont if you dont get sarcasm.&lt;/p&gt;\n\n&lt;p&gt;Even real estate, I live in one of the craziest market in the USA and prices are still x2 what they are in Feb 2020, but it stops increasing . Its very telling.&lt;/p&gt;\n\n&lt;p&gt;Just be patient and look at the halving clock.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/ughai4/guys_this_is_what_a_bear_market_is/",
  "subreddit": "CryptoCurrency",
  "id": "ughai4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The market has a negative trend from 6 months, and flat (if you are very\noptimistic) for 1 year.\n\nNow, we see the bad news coming out, Cro, Solana(again), and more will come. In\na near future, people will ask, so much good news, why is it still crashing?\n\nAnd its now cryptos fault, im very bullish…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場は6ヶ月からマイナストレンドで、横ばい（もし、非常に\n1年間は横ばい（非常に楽観的な場合）。\n\n今、私たちは、クロ、ソラナ(再び)などの悪いニュースが出てくるのを目の当たりにしている。近い将来\n近い将来、「こんなに良いニュースがあるのに、なぜまだ暴落しているんだ？\n\nそして、そのクリプトのせいで、私は非常に強気です...",
      "title": "みんな、これが弱気相場なんだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "市场从6个月开始有一个负面的趋势，而且是平的（如果你是很\n一年来都是平的（如果你很乐观的话）。\n\n现在，我们看到坏消息出来了，C罗、索拉纳（再次），还有更多的消息会出现。在\n在不久的将来，人们会问，这么多好消息，为什么它还在崩溃？\n\n现在是加密货币的错，我非常看好......",
      "title": "伙计们，这就是熊市的含义。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場從6個月開始有一個負面的趨勢，而且是平的（如果你是很\n一年來都是平的（如果你很樂觀的話）。\n\n現在，我們看到壞消息出來了，C羅、索拉納（再次），還有更多的消息會出現。在\n在不久的將來，人們會問，這麼多好消息，爲什麼它還在崩潰？\n\n現在是加密貨幣的錯，我非常看好......",
      "title": "夥計們，這就是熊市的含義。"
    }
  ]
}