{
  "author": "onlymadethistoargue",
  "the_new_excerpt": "Crypto is not one thing. This is what I’ve come to learn. Crypto is an\necosystem. It’s many technologies competing in different crypto-ecological\nniches for the right to act as value arbiters in those spaces.\n\n\nPART 0: IN TRUTH, NOT EVEN FIAT CURRENCY IS REALLY OUR MAIN CURRENCY.\n\nWhat has been the…",
  "original_created_utc": 1620102973,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は一つではありません。これは私が学んできたことです。暗号は一つの\n生態系です。さまざまなテクノロジーが、さまざまな暗号生態学的ニッチにおいて、その空間で価値を裁定する権利をめぐって競争しています。\nニッチな空間で価値を決定する権利をめぐって競い合っています。\n\n\nパート0：本当は、不換紙幣さえも私たちの主要な通貨ではない。\n\nこれまでの...",
      "title": "私は9年間、マジック・インターネット・マネーを追い続けてきました。強気の動きや弱気の市場で厳しい教訓を学んできました ここでは私の見解を述べます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Crypto不是一个东西。这是我了解到的情况。Crypto是一个\n生态系统。它是许多技术在不同的加密生态环境中的竞争\n争夺在这些空间充当价值仲裁者的权利。\n\n\n第0部分：事实上，甚至法币都不是我们真正的主要货币。\n\n什么一直是...",
      "title": "我关注神奇的互联网资金已经9年了。我在牛市运行和熊市中吸取了惨痛的教训 以下是我的观点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Crypto不是一個東西。這是我瞭解到的情況。Crypto是一個\n生態系統。它是許多技術在不同的加密生態環境中的競爭\n爭奪在這些空間充當價值仲裁者的權利。\n\n\n第0部分：事實上，甚至法幣都不是我們真正的主要貨幣。\n\n什麼一直是...",
      "title": "我關注神奇的互聯網資金已經9年了。我在牛市運行和熊市中吸取了慘痛的教訓 以下是我的觀點。"
    }
  ],
  "title": "I’ve been following magic internet money for 9 years. I’ve learned hard lessons on bull runs and bear markets Here’s my perspective.",
  "created_utc": 1620120631,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto is not one thing. This is what I’ve come to learn. Crypto is an ecosystem. It’s many technologies competing in different crypto-ecological niches for the right to act as value arbiters in those spaces.</p>\n\n<h1>Part 0: In truth, not even fiat currency is really our main currency.</h1>\n\n<p>What has been the basis of the currency of the United States, historically? Gold and then the greenback. At first, the greenback represented gold, but it wasn’t gold. Then the nation decided it was better to have the greenback represent itself. Why? Because we already valued it. The physical underpinnings of its paper fibers held no material relevance to us. In truth, though gold has many uses, its main valuation had come from people knowing that people like shiny rocks. Chemistry and physics came after our appraisal of gold as valuable.</p>\n\n<p>Nowadays, do you use cash much? Maybe sometimes, maybe even every day, but if you have a bank account, there’s not a vault of greenbacks sitting in a safe with your name on it. You have a digital representation of a value which is part of an overall collection of values held and used by a bank representing an equivalent sum of greenbacks. Sure, it may add up to a real number of dollars that you can print, but that’s only when you need to use cash. </p>\n\n<p><a href=\"/r/WallStreetBets\">/r/WallStreetBets</a> caused a hedge fund to lose billions on shares of stock that exceed the total supply. We’re fine with floating shares as a concept because we assume it’ll all add up in the end. </p>\n\n<p>Ultimately, all of these things simply represent a normative standard of <strong>value.</strong></p>\n\n<h1>Part 1: The Zygotic Stage: Bitcoin and the Mt. Gox Collapse</h1>\n\n<p>Jed McCaleb, cocreator of Ripple as well as Stellar, founded Mt. Gox, the first Bitcoin exchange. It was a sign that bitcoin was gaining some legitimacy; there was now an infrastructure to handle bitcoin arbitrage. </p>\n\n<p>Problem was: it hard-centralized bitcoin. Jed left, Mark Karpeles took over and Mt. Gox was hacked a few years later. Thousands and thousands of bitcoins were stolen; BTC lost 90% of its value in less than a month.</p>\n\n<p>What happened? Crypto wasn’t ready. It couldn’t handle the stress test of one intuition suffering what countless CeFi institutions have without obliterating the value of the fiat. It was one blockchain with one protocol. </p>\n\n<h1>Part 2: The Rise of the Alts and Crypto Winter 2018</h1>\n\n<p>Nowadays, BTC is called a store of value solution. This is a recent phenomenon. I was around back when BTC was genuinely being considered as a currency. </p>\n\n<p>Valve once took BTC for Steam purchases, starting in 2016. They reneged on this in December 2017, as the volatility had made it bad for something like video game retail. It seemed perfect; Steam had broken new ground as an alternative to physical storefronts, why not break it further with digital currency? </p>\n\n<p>The tech was bad for it. As it became more valuable, transaction fees became untenably high. Bitcoin had failed in its original use case. </p>\n\n<p>Crypto wasn’t ready; if it was a zygote in 2014, it was only a blastula in 2017. There were subdivisions in the overall structure but no real specialization. Ethereum had been finding some legs with its smart contracts. Doge was rebounding, as it seems to never truly die, defying all logic. Bitcoin dominance was plummeting. People were willing to look at the alt coins and give them a try. After all, there had been almost a decade of data on Bitcoin’s failings; surely someone had been ingenious enough to overcome all of them.</p>\n\n<p>Unfortunately, if they had, no one had noticed. There were projects, but they were all proof of concept. They were plagued with the same problems as Bitcoin, just on a smaller scale. Scamcoin after scamcoin after scamcoin parted many from their money. The new wave was another round wanting to get on the bitcoin rocket despite having missed it (or so they thought). What they really wanted was a time machine. Unfortunately, there’s no such thing.</p>\n\n<h1>Part 3: The Growing Crypto Ecosystem</h1>\n\n<p>NFTs have brought crypto back into the spotlight; I am personally bearish. I think the massive prices for these are mostly from more time machine seekers. But what I have seen since 2018 is that we’re not just looking at stores of value and analogs to fiat anymore.</p>\n\n<p>Take BNB. It’s a utility token with good tokenomics. But it’s a single exchange’s token. How could that ever replace the USD? <strong><em>It doesn’t need to.</em></strong> It’s simply demonstrating the value of holding the token, which offers some degree of utility. Because that utility connects to the rest of crypto, holding has historically been of high value - enough that someone would pay to hold it.</p>\n\n<p>It’s not competing in the same ecological niche as BTC or ETH. It’s coexisting. It’s perfectly fine to do <em>something else</em> and the fact that the core chains - your BTCs, your ETHs, your Stellars and Cardanos - can support something like this is almost unreal to me. It’s not alone, either. You have CRO, NEXO, and other exchange coins doing the same.</p>\n\n<p>I think this shows that something is happening. I don’t know exactly what, and I suppose no one will truly know except in retrospect. </p>\n\n<h1>Part 4: The Future</h1>\n\n<p>In my opinion, the baby is still not yet ready for primetime, so to speak. Crypto now is like an embryo - it’s getting specialized segments with some morphological differentiation, but it’s not capable of thriving without continuous input from its supporters. Ethereum is rocketing up but as it does, transaction fees go with it. They may lower in the future but as it stands, the retail investor gains nothing for small dollar spending. ETH seems to be finding purchase in the smart contracts domain; I think it too will have to adapt to be faster and cheaper or yield that it will never become a true currency. </p>\n\n<p>I think that in order for everyone to accept a new way of spending, they’re going to need to be able to spend frivolously and impulsively without punishment. They’re going to need quick withdrawals and transfers. Transaction speed is crucial in finance; a difference of a few minutes can change everything, as we have seen with countless coins. </p>\n\n<p>I know that other chains are working on their own projects. The ecosystem is still very disconnected in many ways. I’m not sure we’ll never see another bear market but I do know that the more the ecosystem adapts and learns from the failures of previous iterations, the safer the environment will become. </p>\n\n<p>The log graph of BTC’s price looks like a square root function and it’s starting to plateau, but because it’s a logarithmic graph, even a plateau means a fluctuation between orders of magnitude. I think there’s at least one bull run left.</p>\n\n<p>When all is said and done, will this all have been a collective delusion by us? Or will we be vindicated? No one can perfectly know the future; all we can do is approximate it. At the very least, I think very strongly that we are not in the last cycle. That makes me feel good about the future, even though I know hard times may come. </p>\n\n<h1>tl;dr</h1>\n\n<p>number go up at least one more time</p>\n</div><!-- SC_ON -->",
  "score": 1538,
  "permalink": "/r/CryptoCurrency/comments/n4g1sb/ive_been_following_magic_internet_money_for_9/",
  "subreddit": "CryptoCurrency",
  "id": "n4g1sb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964319
}