{
  "author": "naji102",
  "the_new_excerpt": "Today I was too happy how I got little extra money from moons shared my life\nstory about working in 3rd world country in daily comments section but you\nbeautiful humans just gave me more moons than I could imagine. I got into crypto\nthinking I would get some profit because life/Job wasn’t doing good…",
  "original_created_utc": 1623907572,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は、ムーンズ・シェアード・マイ・ライフでの小遣い稼ぎが嬉しすぎました。\n毎日のコメント欄で、第三世界の国で働いている話をしていましたが、美しい人間たちが\nしかし、美しい人間たちは、私が想像する以上の月を与えてくれました。私は暗号化を始めました。\n人生や仕事がうまくいっていなかったので、少しでも利益を得ようと思ってcryptoに参加しました...。",
      "title": "このコミュニティには優しい人がたくさんいて、私は今、涙を流しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我太高兴了，我从月亮上得到了一点额外的钱，分享了我的生活\n在每日评论区分享我在第三世界国家工作的故事。\n但你们这些美丽的人类却给了我超乎想象的月亮。我进入加密货币领域\n因为我的生活/工作并不顺利，所以我想获得一些利润......",
      "title": "这个社区充满了善良的人，我目前正在流泪。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我太高興了，我從月亮上得到了一點額外的錢，分享了我的生活\n在每日評論區分享我在第三世界國家工作的故事。\n但你們這些美麗的人類卻給了我超乎想象的月亮。我進入加密貨幣領域\n因爲我的生活/工作並不順利，所以我想獲得一些利潤......",
      "title": "這個社區充滿了善良的人，我目前正在流淚。"
    }
  ],
  "title": "This community is full of kind people, I’m currently in tears.",
  "created_utc": 1623929438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today I was too happy how I got little extra money from moons shared my life story about working in 3rd world country in daily comments section but you beautiful humans just gave me more moons than I could imagine. I got into crypto thinking I would get some profit because life/Job wasn’t doing good for me so I started investing a little bit of my salary into crypto. Nothing worked out so far but it’s all fine I wasn’t planning to be a millionaire over night today you guys just made me burst into tears how beautiful and kind some humans can be, I hope whatever coin you are investing in goes to moon. Thanks for kind comments and wishes.</p>\n</div><!-- SC_ON -->",
  "score": 586,
  "permalink": "/r/CryptoCurrency/comments/o1pfcf/this_community_is_full_of_kind_people_im/",
  "subreddit": "CryptoCurrency",
  "id": "o1pfcf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741215
}