{
  "author": "Scary-Sand4273",
  "original_created_utc": 1634887919,
  "title": "Bank is after me because of Bitcoin",
  "created_utc": 1634907522,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey guys </p>\n\n<p>My bank is after me, I’ve invested in Btc and they want to know my balance on exchange and wallet, exact amounts and proof of holdings. What’s next they are gonna ask for my seeds??? They will shut my accounts down today. Because I’m scared of providing them proof, what if they get hacked one day?? All my info, holdings, personal number, phone number, address will show up.. they are gonna close both business and private accounts, setting me in a terrible position. I’ve called another bank and they told me that they only want to know my holdings. But I don’t feel like giving it to them, but they don’t understand what risk involved with those informations.</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/Bitcoin/comments/qdbq88/bank_is_after_me_because_of_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "qdbq88",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey guys\n\nMy bank is after me, I’ve invested in Btc and they want to know my balance on\nexchange and wallet, exact amounts and proof of holdings. What’s next they are\ngonna ask for my seeds??? They will shut my accounts down today. Because I’m\nscared of providing them proof, what if they get hacked…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n銀行に追われています。BTCに投資しているのですが、取引所と財布の残高を知りたがっています。\n取引所とウォレットの残高、正確な金額と保有証明を知りたがっています。次は何を要求されるんだろう？\n種を要求してくるのかな？彼らは今日、私の口座を閉鎖するでしょう。なぜなら私は\nハッキングされたらどうしよう...と思うと怖くて証拠を出せません。",
      "title": "ビットコインのせいで銀行に追われている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们\n\n我的银行在追我，我投资了Btc，他们想知道我在交易所和钱包里的余额。\n交易所和钱包里的余额，准确的金额和持有的证明。接下来他们会怎样\n要问我的种子？他们今天会关闭我的账户。因为我\n害怕向他们提供证据，如果他们被黑了怎么办......",
      "title": "银行因为比特币而追杀我"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們\n\n我的銀行在追我，我投資了Btc，他們想知道我在交易所和錢包裏的餘額。\n交易所和錢包裏的餘額，準確的金額和持有的證明。接下來他們會怎樣\n要問我的種子？他們今天會關閉我的賬戶。因爲我\n害怕向他們提供證據，如果他們被黑了怎麼辦......",
      "title": "銀行因爲比特幣而追殺我"
    }
  ]
}