{
  "author": "donotholdyourbreath",
  "original_created_utc": 1649515701,
  "title": "why isnt having gender dysphoria considered a mental illness?",
  "created_utc": 1649526351,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or maybe I&amp;#39;m misunderstanding something. if you feel that you can&amp;#39;t go on with your life unless you transition, isn&amp;#39;t that s mental illness? I don&amp;#39;t think we should be mean to people with mental illness but simply saying they don&amp;#39;t have it doesn&amp;#39;t make all that much sense to me. Like if I had my legs cut off and I am distressed over it, I mean yeah, I have a mental disorder, rightfully so, but its still there?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/tzupdw/why_isnt_having_gender_dysphoria_considered_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "tzupdw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Or maybe I'm misunderstanding something. if you feel that you can't go on with\nyour life unless you transition, isn't that s mental illness? I don't think we\nshould be mean to people with mental illness but simply saying they don't have\nit doesn't make all that much sense to me. Like if I had my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それとも、私が何か誤解しているのでしょうか。\n移行しないと生きていけないというのは、精神疾患ではないのでしょうか。私は\n精神疾患を持つ人に意地悪をするのはいけないことですが、単に「精神疾患はない」と言うのは\n私にはあまり意味がありません。もし私が...",
      "title": "性同一性障害というのは、なぜ精神疾患とみなされないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许我有什么误解。如果你觉得你不能继续生活，除非你转型。\n你的生活，除非你转型，这不就是精神疾病吗？我不认为我们\n我不认为我们应该对有精神疾病的人吝啬，但仅仅说他们没有精神疾病也没有意义。\n对我来说并没有什么意义。就像如果我有我的...",
      "title": "为什么性别障碍不被认为是一种精神疾病？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許我有什麼誤解。如果你覺得你不能繼續生活，除非你轉型。\n你的生活，除非你轉型，這不就是精神疾病嗎？我不認爲我們\n我不認爲我們應該對有精神疾病的人吝嗇，但僅僅說他們沒有精神疾病也沒有意義。\n對我來說並沒有什麼意義。就像如果我有我的...",
      "title": "爲什麼性別障礙不被認爲是一種精神疾病？"
    }
  ]
}