{
  "author": "egjtlre",
  "the_new_excerpt": "I dont think most of you clowns realize this. That on top of having humongous\nnuts, none of you will ever have, he is also INCREDIBLY good looking. Look at\nthat luxurious hair, those crystal blue eyes, that jaw line. You're all in awe.\n\nIn interview we learn hes stoic and you could lay head on his…",
  "original_created_utc": 1613825028,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不认为你们大多数小丑意识到这一点。这在上面有巨大的\n坚果，你们都不会有，他也是无比的好看。你看\n那华贵的头发，那晶莹的蓝眼睛，那下巴线条。都让你们惊叹不已。\n\n在采访中，我们了解到他的沉稳，你可以躺在他的头... ...",
      "title": "DFV帅气沉稳。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不認爲你們大多數小丑意識到這一點。這在上面有巨大的\n堅果，你們都不會有，他也是無比的好看。你看\n那華貴的頭髮，那晶瑩的藍眼睛，那下巴線條。都讓你們驚歎不已。\n\n在採訪中，我們瞭解到他的沉穩，你可以躺在他的頭... ...",
      "title": "DFV帥氣沉穩。"
    }
  ],
  "title": "DFV is handsome and composed.",
  "created_utc": 1613845601,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I dont think most of you clowns realize this.  That on top of having humongous nuts, none of you will ever have, he is also INCREDIBLY good looking.  Look at that luxurious hair, those crystal blue eyes, that jaw line.  You&#39;re all in awe.</p>\n\n<p>In interview we learn hes stoic and you could lay head on his chest and know safety.  At same time hes a genuinely nice guy, humble and only wants to help others. Non judgmental of all.</p>\n\n<p>Basically he is the PERFECT human being, someone I would love as a friend and be proud to call my wife&#39;s lover.  Treat him right Mrs. Gill or I will.</p>\n\n<p>Love u DFV.</p>\n\n<p>Not gay.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: gay</p>\n\n<p>Edit 2:  Just addressing elephant in room regarding his looks and saying what NEEDED to be said.  Also I can tell he has muscles, not from working out like many try, but just natural lean muscles</p>\n</div><!-- SC_ON -->",
  "score": 3712,
  "permalink": "/r/wallstreetbets/comments/lo6eho/dfv_is_handsome_and_composed/",
  "subreddit": "wallstreetbets",
  "id": "lo6eho",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332892237
}