{
  "author": "Many_Arm7466",
  "original_created_utc": 1641587600,
  "title": "To Everyone Still Holding Let me See Those Beautiful Hands...",
  "created_utc": 1641598947,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This post is intended to be a bit of a wellness check and morale boost during these red days. &lt;/p&gt;\n\n&lt;p&gt;I know many are really disappointed that we didn’t quite see 100K EOY as many so called “experts” have been predicting. And now we’re seeing a lot of red to start the new year. Which is a good reminder that stonks along with Crypto don’t always go up in a straight line. But no need to be worried if we zoom out and look at how far we have come in a 1, 2, 5 years we see a lot of reason to still be super bullish. &lt;/p&gt;\n\n&lt;p&gt;Now is the time to start up the old fiat miner and be getting ready as much disposable cash as you can to start DCAing into the market if you haven’t already been. If this is truly a bear (which I am still not convinced) this is where fortunes are made. &lt;/p&gt;\n\n&lt;p&gt;So don’t lose interest like many retailer investors are doing just cause we aren’t seeing crazy gains. Remember smart money is accumulating right now. So for once let’s not be dumb money and “buy high sell low” but instead be smart money and “buy low, buy lower, buy lowest, then sell high”. &lt;/p&gt;\n\n&lt;p&gt;So to those still holding on and stacking sats I am proud of you and I bet your mom is too. So to all those that haven’t lost faith and still accumulating during these uncertain times let me see those beautiful hands!!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 349,
  "permalink": "/r/CryptoCurrency/comments/ryh5oj/to_everyone_still_holding_let_me_see_those/",
  "subreddit": "CryptoCurrency",
  "id": "ryh5oj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This post is intended to be a bit of a wellness check and morale boost during\nthese red days.\n\nI know many are really disappointed that we didn’t quite see 100K EOY as many so\ncalled “experts” have been predicting. And now we’re seeing a lot of red to\nstart the new year. Which is a good reminder…"
}