{
  "author": "shlammyjohnson",
  "original_created_utc": 1626384176,
  "title": "Get ready for prices to rebound, shorts are getting liquidated as we speak (BTC)",
  "created_utc": 1626406455,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Watch it live on datamish.com, the percentage of total shorts on BTC is declining at an almost exact rate with the price increasing.</p>\n\n<p>Shorts have been slowly rising the last week and pulling the price down but watch how it consistently goes up now that those shorts are being bought back and paying market price to cover the positions.</p>\n\n<p>It doesn&#39;t nessesarily means there&#39;s a short squeeze happening here, just the contracts need to repay their borrowed BTC and the more shorts there are left (around 16k in contract BTC left) the price will move up.</p>\n\n<p>I for one am seriously surprised no one has taken advantage of these obvious moves between the 30-35k band, it cyclically keeps getting pulled to one side or the other rhythmically for the last few months. And obviously I mean whales and large holders, not the $10 pizza crew gang (rise up)</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/ol2ago/get_ready_for_prices_to_rebound_shorts_are/",
  "subreddit": "CryptoCurrency",
  "id": "ol2ago",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Watch it live on datamish.com, the percentage of total shorts on BTC is\ndeclining at an almost exact rate with the price increasing.\n\nShorts have been slowly rising the last week and pulling the price down but\nwatch how it consistently goes up now that those shorts are being bought back\nand paying…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "datamish.comのライブ映像を見ると、BTCのショート全体の割合が\n価格の上昇とほぼ同じ割合で減少している。\n\n先週からショートが徐々に上昇し、価格を引き下げていますが\nしかし、それらのショートが買い戻されている今、一貫して上昇している様子を見てください。\n払っています。",
      "title": "価格の反発に備えよう、ショートはすぐに清算される(BTC)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在datamish.com上观看直播，BTC上的总空头比例正在以几乎精确的速度随着价格的上升而下降。\n随着价格的上涨，空头的比例几乎以精确的速度下降。\n\n上周，空头一直在缓慢上升，并将价格拉低，但是\n看它是如何持续上升的，现在这些空头被买回来了\n并支付...",
      "title": "准备好价格反弹，空头正在被清算（BTC）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在datamish.com上觀看直播，BTC上的總空頭比例正在以幾乎精確的速度隨着價格的上升而下降。\n隨着價格的上漲，空頭的比例幾乎以精確的速度下降。\n\n上週，空頭一直在緩慢上升，並將價格拉低，但是\n看它是如何持續上升的，現在這些空頭被買回來了\n並支付...",
      "title": "準備好價格反彈，空頭正在被清算（BTC）。"
    }
  ]
}