{
  "author": "sharkprincefishstick",
  "original_created_utc": 1635964146,
  "title": "Why do people bully me for wearing fingerless gloves?",
  "created_utc": 1635980904,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I (22F) bought a pair of faux leather fingerless gloves, and I think they look cool. They also keep my hands warm while letting me do more dexterous tasks. However, my peers and family don’t seem to appreciate them like I do. “Okay Joseph Joestar” “are you trying to look like an incel?” “You know you look retarded, right?” and my personal favorite “What in God’s name are those?”\nAre they really that bad? A lot of cool video game character wear them and nobody comments about how dorky they look on them. Granted, I’m a gangly, pale, anemic and underweight dweeb who looks like a Amy Pharah Fowler on heroine crossed with a opossum, but still. Heaven forbid I feel good about something I wear. \nShould I feel ashamed of my gloves, or stop wearing them? I’m sick of being bullied about them, but I think they’re cool.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/qm0usm/why_do_people_bully_me_for_wearing_fingerless/",
  "subreddit": "NoStupidQuestions",
  "id": "qm0usm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I (22F) bought a pair of faux leather fingerless gloves, and I think they look\ncool. They also keep my hands warm while letting me do more dexterous tasks.\nHowever, my peers and family don’t seem to appreciate them like I do. “Okay\nJoseph Joestar” “are you trying to look like an incel?” “You know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（22F）は、フェイクレザーのフィンガーレスグローブを購入しました。\nかっこいいと思います。手を温めながら、手先の器用な作業ができるようになりました。\nしかし、仲間や家族は、私のようには評価していないようです。\"Okay\n\"Joseph Joestar\" \"インセルのように見せようとしているのか？\" \"ほら...",
      "title": "なぜ指なし手袋をしているといじめられるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（22岁）买了一副仿皮无指手套，我认为它们看起来很\n很酷。它们还能让我的手保持温暖，同时让我做更多灵巧的工作。\n然而，我的同龄人和家人似乎并不像我这样欣赏它们。\"好吧\n你是想让自己看起来像个乱伦者吗？\"你知道...",
      "title": "为什么人们会因为我戴无指手套而欺负我？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（22歲）買了一副仿皮無指手套，我認爲它們看起來很\n很酷。它們還能讓我的手保持溫暖，同時讓我做更多靈巧的工作。\n然而，我的同齡人和家人似乎並不像我這樣欣賞它們。\"好吧\n你是想讓自己看起來像個亂倫者嗎？\"你知道...",
      "title": "爲什麼人們會因爲我戴無指手套而欺負我？"
    }
  ]
}