{
  "author": "The-Virus_11",
  "original_created_utc": 1628086631,
  "title": "To the people who wear very revelling clothes in public, why do you get upset when someone looks at you?",
  "created_utc": 1628099309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I really hope I don&#39;t come across as bad person for asking this I just never understood the reasoning. Some people only wear revealing clothes when they are outside and when they get looked at they get upset. Why highlight your body if you don&#39;t want it to be seen? The thing that I hear the most about this question is &quot;we don&#39;t do it for you we do it for ourselves&quot; if that&#39;s the case why do you wear it only when you go outside? Surely if it was just for you you&#39;d wear it at home as well. Sorry if this was an unappropriate thing to ask.</p>\n</div><!-- SC_ON -->",
  "score": 992,
  "permalink": "/r/NoStupidQuestions/comments/oxtmmv/to_the_people_who_wear_very_revelling_clothes_in/",
  "subreddit": "NoStupidQuestions",
  "id": "oxtmmv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I really hope I don't come across as bad person for asking this I just never\nunderstood the reasoning. Some people only wear revealing clothes when they are\noutside and when they get looked at they get upset. Why highlight your body if\nyou don't want it to be seen? The thing that I hear the most…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような質問をして、悪い人だと思われないことを願っています。\n理由を理解できませんでした。外出するときだけ露出度の高い服を着る人がいますが\n外では露出度の高い服しか着ない人がいて、それを見られると動揺してしまう。見られたくないのに、なぜ自分の体を\n見られたくないのに、なぜ体を強調するのでしょうか？私が最もよく耳にするのは...。",
      "title": "公衆の面前で非常にセクシーな服を着ている人たち、なぜ人に見られると動揺するのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的希望我不会因为问这个问题而被认为是坏人，我只是从来没有\n明白其中的道理。有些人只在外面的时候才穿暴露的衣服\n而当他们被人看时，他们就会不高兴。为什么要突出你的身体，如果\n如果你不想让别人看到，为什么要突出你的身体呢？我听到最多的是...",
      "title": "对于那些在公共场合穿得很谩骂的人来说，为什么有人看你的时候你会不高兴？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的希望我不會因爲問這個問題而被認爲是壞人，我只是從來沒有\n明白其中的道理。有些人只在外面的時候才穿暴露的衣服\n而當他們被人看時，他們就會不高興。爲什麼要突出你的身體，如果\n如果你不想讓別人看到，爲什麼要突出你的身體呢？我聽到最多的是...",
      "title": "對於那些在公共場合穿得很謾罵的人來說，爲什麼有人看你的時候你會不高興？"
    }
  ]
}