{
  "author": "Cristian7x",
  "original_created_utc": 1628286882,
  "title": "For those who don’t use Twitter: Coinbase CEO Brian Armstrong’s words about infrastructure bill",
  "created_utc": 1628304251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tweets in order:</p>\n\n<p>“1/ There are a few key moments that define our future. One is happening now in the Senate w/ the infrastructure bill. At the 11th hour @MarkWarner has proposed an amendment that would decide which foundational technologies are OK and which are not in crypto. This is disastrous.”</p>\n\n<p>“2/ Senator @MarkWarner has asked for proof of stake validators to comply with the impossible, but not proof of work miners. Why? It’s not clear, but we could find ourselves with the Senate deciding which types of crypto will survive government regulation.”</p>\n\n<p>“3/ This is the government trying to pick winners and losers in a nascent industry today, where some new technology is being developed every month. They are guaranteed to get it wrong, by writing in a few exceptions by hand today.”</p>\n\n<p>“4/ Imagine if the government decided that iOS is OK but Android isn’t. And that software developers building on iOS can thrive, but Android is outlawed.”</p>\n\n<p>“5/ Our Senators are voting tomorrow on the future of innovation in finance and crypto in America. If they choose the Sen.@MarkWarner amendment, we will see future development of blockchain technology move offshore to countries like China that are currently embracing it.”</p>\n\n<p>“6/ Crypto is still in its early stages. Innovators across this country are working to make crypto networks better, enabling new apps like NFTs, smart contracts, and DeFi. These will bring enormous benefits to Americans, and help ensure our place as a financial hub.”</p>\n\n<p>“7/ If the U.S. fails to embrace the innovation happening in crypto, it risks becoming a financial backwater, missing out on one of the fastest growing sectors of the economy. Imagine if we had missed out on the internet, and the largest internet companies had been built overseas.”</p>\n\n<p>“8/ This debate in the Senate started because the govt sees the growing crypto industry as a source of tax revenue. We agree everyone must pay their taxes. There is no debate on this topic. But destroying some of the most exciting innovations in the process is unconscionable.”</p>\n\n<p>“9/ History will not be kind to any politician who tries to block American&#39;s access to new technologies. Americans have a very low tolerance for taking away our rights, and harming economic growth.”</p>\n\n<p>“10/ Contact your Senators and urge them to vote for the Wyden-Lummis-Toomey amendment and vote NO on the Warner-Portman amendment. Let’s keep crypto alive and thriving, we’re just getting started.”</p>\n\n<p>The link to his <a href=\"https://twitter.com/brian_armstrong/status/1423744994444206092?s=21\">Thread</a></p>\n\n<p>Read more about the issue <a href=\"https://techcrunch.com/2021/08/06/crypto-biden-amendment-infrastructure-bill-proof-of-work/\">here.</a></p>\n</div><!-- SC_ON -->",
  "score": 293,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/1KuacsU2mVmfQSOVtaMXQC6IqWuuWDrk2fgE7x_XeIU.jpg?auto=webp&s=294845fdf96e67cb3eb84c9f3dca9e18568ae0ed",
          "width": 140,
          "height": 140
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/1KuacsU2mVmfQSOVtaMXQC6IqWuuWDrk2fgE7x_XeIU.jpg?width=108&crop=smart&auto=webp&s=4369ffff0ec1661430d7ab4fd0966d758cefa85a",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "pd32x9Z7CHWMw9miznmyXH6sTPkyIeJNkxkRN8gEcTQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ozghck/for_those_who_dont_use_twitter_coinbase_ceo_brian/",
  "subreddit": "CryptoCurrency",
  "id": "ozghck",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Tweets in order:\n\n“1/ There are a few key moments that define our future. One is happening now in\nthe Senate w/ the infrastructure bill. At the 11th hour @MarkWarner has proposed\nan amendment that would decide which foundational technologies are OK and which\nare not in crypto. This is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "順番にツイートします。\n\n\"1/ 私たちの未来を決める重要な瞬間がいくつかあります。その一つが今、上院で起きている\n上院ではインフラ法案の審議が行われています。土壇場になって@MarkWarnerが提案したのは\nどの基盤技術が暗号化されていて、どの技術が暗号化されていないかを決定する修正案を提案しました。\n暗号化されていないかを決める修正案を提案しました。これは...",
      "title": "ツイッターを使っていない人のために コインベースCEOブライアン・アームストロングのインフラ法案に関する言葉"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "按顺序发推文。\n\n\"1 有几个关键时刻决定了我们的未来。一个是现在正在发生在\n参议院的基础设施法案。在第11个小时，@MarkWarner提出了\n一项修正案，将决定哪些基础技术是可以的，哪些是不可以的。\n哪些不属于加密货币。这是...",
      "title": "对于那些不使用Twitter的人。Coinbase首席执行官Brian Armstrong关于基础设施法案的话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "按順序發推文。\n\n\"1 有幾個關鍵時刻決定了我們的未來。一個是現在正在發生在\n參議院的基礎設施法案。在第11個小時，@MarkWarner提出了\n一項修正案，將決定哪些基礎技術是可以的，哪些是不可以的。\n哪些不屬於加密貨幣。這是...",
      "title": "對於那些不使用Twitter的人。Coinbase首席執行官Brian Armstrong關於基礎設施法案的話"
    }
  ]
}