{
  "author": "Pashahlis",
  "original_created_utc": 1638135874,
  "title": "Did the 2001 film \"Enemy at the Gates\" popularize common misconceptions about the Red Army during World War II, such as the supposedly widespread use of \"human wave\" tactics and \"no step back\" orders?",
  "created_utc": 1638163638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The 2001 film &quot;Enemy at the Gates&quot; was quite popular. It was very good popcorn cinema and arguably remains the most popular movie about the Eastern Front of WW2.</p>\n\n<p>The movie, however, vastly exaggerated the tactical and strategic shortcomings of the Red Army during that time. While &quot;human wave&quot; tactics and &quot;no step back&quot; orders did exist and were used occasionally, their usages, to my knowledge (which comes mostly from this subreddit to be fair), were very localized and not very widespread as depicted in the film. There were also not such widespread supply shortages that one man would be given a rifle with one 5-round clip and the man behind him was given another 5-round clip and told to pick up the other man&#39;s rifle should he drop dead.</p>\n\n<p>Nowadays, those incorrect perceptions of the Red Army during WW2 remain very popular. So the question is then: Did &quot;Enemy at the Gates&quot; popularize those misconceptions? <strong>If not, then what did?</strong></p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/r4f8mi/did_the_2001_film_enemy_at_the_gates_popularize/",
  "subreddit": "AskHistorians",
  "id": "r4f8mi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The 2001 film \"Enemy at the Gates\" was quite popular. It was very good popcorn\ncinema and arguably remains the most popular movie about the Eastern Front of\nWW2.\n\nThe movie, however, vastly exaggerated the tactical and strategic shortcomings\nof the Red Army during that time. While \"human wave\"…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2001年に公開された「Enemy at the Gates」はかなりの人気を博した。とても良いポップコーン映画でした。\n映画であり、第二次世界大戦の東部戦線を描いた映画の中で最も人気のある作品であることは間違いない。\n最も人気のある映画です。\n\nしかし、この映画は、当時の赤軍の戦術的、戦略的な欠点を大幅に誇張しています。\nしかし、この映画は、当時の赤軍の戦術的、戦略的欠点を大幅に誇張している。人間の波」とはいえ...",
      "title": "2001年に公開された映画「Enemy at the Gates」は、「人間の波」戦術や「一歩も退かない」命令など、第二次世界大戦中の赤軍に関する一般的な誤解を広めたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2001年的电影 \"门外之敌 \"相当受欢迎。它是非常好的爆米花\n它是非常好的爆米花电影，可以说仍然是最受欢迎的关于二战东线的电影。\n二战中最受欢迎的电影。\n\n然而，这部电影极大地夸大了战术和战略上的缺陷\n红军在那个时期的战术和战略缺陷。虽然 \"人浪\"...",
      "title": "2001年的电影《大敌当前》是否普及了关于二战期间红军的常见误解，例如所谓的广泛使用 \"人浪 \"战术和 \"不退步 \"命令？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2001年的電影 \"門外之敵 \"相當受歡迎。它是非常好的爆米花\n它是非常好的爆米花電影，可以說仍然是最受歡迎的關於二戰東線的電影。\n二戰中最受歡迎的電影。\n\n然而，這部電影極大地誇大了戰術和戰略上的缺陷\n紅軍在那個時期的戰術和戰略缺陷。雖然 \"人浪\"...",
      "title": "2001年的電影《大敵當前》是否普及了關於二戰期間紅軍的常見誤解，例如所謂的廣泛使用 \"人浪 \"戰術和 \"不退步 \"命令？"
    }
  ]
}