{
  "author": "ParticularGlass1821",
  "the_new_excerpt": "It is my understanding that Ron Klain told HHS to freeze all Trump Healthcare\nEOs not yet effective so that OMB can review them. Trumpers are going nuts that\nthe insulin EO Trump signed will not go into effect until March 22. That EO\nbasically, if I understand correctly, forces pharmaceutical…",
  "original_created_utc": 1611440997,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "据我了解，罗恩-克莱恩告诉HHS冻结所有特朗普医疗的\nEO还没有生效，所以OMB可以审查它们。特朗普们都快疯了\n特朗普签署的胰岛素EO要到3月22日才会生效。该EO\n基本上，如果我没理解错的话，迫使制药... ...",
      "title": "拜登刚被冻结的胰岛素，特朗普的EO是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我瞭解，羅恩-克萊恩告訴HHS凍結所有特朗普醫療的\nEO還沒有生效，所以OMB可以審查它們。特朗普們都快瘋了\n特朗普簽署的胰島素EO要到3月22日纔會生效。該EO\n基本上，如果我沒理解錯的話，迫使製藥... ...",
      "title": "拜登剛被凍結的胰島素，特朗普的EO是怎麼回事？"
    }
  ],
  "title": "What is the deal with Trump's EO regarding insulin that Biden just had frozen",
  "created_utc": 1611497442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is my understanding that Ron Klain told HHS to freeze all Trump Healthcare EOs not yet effective so that OMB can review them. Trumpers are going nuts that the insulin EO Trump signed will not go into effect until March 22. That EO basically, if I understand correctly, forces pharmaceutical companies to pass on savings they receive from government, to low income individuals that purchase their insulin. I read that this EO lacked specifics and enforcement mechanisms and would be a bureaucracy nightmare for pharmaceutical companies who are already passing along savings. So this EO might also be a redundancy. And I&#39;ve also read that it needs an act of Congress to do what it is supposed to do. Does anyone know anymore about this EO and why it was frozen?</p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/Ask_Politics/comments/l3m8pq/what_is_the_deal_with_trumps_eo_regarding_insulin/",
  "subreddit": "Ask_Politics",
  "id": "l3m8pq",
  "is_self": true,
  "media": null,
  "is_video": false
}