{
  "author": "Karnes",
  "the_new_excerpt": "'During a live question-and-answer session Saturday, an investor challenged\nBuffett and Munger on their well-documented skepticism of X, especially X, whose\nprice has surged more than sixfold over the last year.\n\nCharlie Munger - “I don’t welcome a currency that’s so useful to kidnappers…",
  "original_created_utc": 1620878866,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "「土曜日のライブの質疑応答で、ある投資家が挑戦しました。\nバフェットとマンガーは「X」、特に昨年6倍に高騰した「X」に対する懐疑的な見方をしていることが明らかになった。\n特にXの価格は去年の6倍以上に高騰している。\n\nCharlie Munger - 「誘拐犯にとって便利な通貨は歓迎できない...。",
      "title": "今晩のマスク氏の発表を受けて、バークシャー社の年次総会での取り組みを訪ねてみるのも関連があると思います（5-1-2021）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "'在周六的现场问答环节中，一位投资者挑战了\n巴菲特和芒格对他们有据可查的对X的怀疑，尤其是X，它的价格在过去一年中飙升了六倍多。\n其价格在过去一年中已经飙升了六倍多。\n\n查理-芒格--\"我不欢迎对绑架者如此有用的货币......",
      "title": "在今天晚上马斯克宣布之后，我认为访问伯克希尔的年会解决这个问题是有意义的（5-1-2021）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "'在週六的現場問答環節中，一位投資者挑戰了\n巴菲特和芒格對他們有據可查的對X的懷疑，尤其是X，它的價格在過去一年中飆升了六倍多。\n其價格在過去一年中已經飆升了六倍多。\n\n查理-芒格--\"我不歡迎對綁架者如此有用的貨幣......",
      "title": "在今天晚上馬斯克宣佈之後，我認爲訪問伯克希爾的年會解決這個問題是有意義的（5-1-2021）。"
    }
  ],
  "title": "In the wake of Musk's announcement this evening, I think it's relevant to visit Berkshire's Annual Meeting addressing the matter (5-1-2021)",
  "created_utc": 1620899050,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#39;During a live question-and-answer session Saturday, an investor challenged Buffett and Munger on their well-documented skepticism of X, especially X, whose price has surged more than sixfold over the last year.</p>\n\n<p>Charlie Munger - “I don’t welcome a currency that’s so useful to kidnappers and extortionists,” Munger said. “I think the whole damn development is disgusting and contrary to the interests of civilization.”</p>\n\n<p>Warren Buffet - “I’m gonna dodge that question,” Buffett said. “We’ve probably got hundreds of thousands of people watching this that own X, and we’ve probably got two people who are short. So we have a choice of making 400,000 people mad at us and unhappy, or making two people happy, and that’s just a dumb equation.”</p>\n</div><!-- SC_ON -->",
  "score": 213,
  "permalink": "/r/stocks/comments/nb81w0/in_the_wake_of_musks_announcement_this_evening_i/",
  "subreddit": "stocks",
  "id": "nb81w0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996886
}