{
  "author": "singingWeirdo",
  "original_created_utc": 1626545743,
  "title": "Why is everyone just okay with social media being completely fake?",
  "created_utc": 1626578324,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all know that it takes like 50 tries to get that perfect Instagram photo, and yet people treat it as if the person just wakes up that way. If we ALL know social media is so fake then why do we still compare ourselves to each other and get depressed over it? There&#39;s always some corporation trying to manipulate you into buying their product, or some influencer that&#39;s only ever &quot;interactive&quot; to promote their beauty line. Nothing wrong with having a job, but no one is genuine anymore. Its almost as if people prefer to be lied to and subconsciously controlled rather than make the most of their reality past the screen. And the crazy thing is that we ALL have known this for the longest time. It&#39;s like everyone I meet has gotten really bitter and sensitive somehow and I can&#39;t be the only one who&#39;s noticed that everyone seems really out of touch with each other nowadays. People die everyday because of something stupid online! I mean, it&#39;s fine to enjoy the internet but it&#39;s just scary how seemingly numb we&#39;ve all become to its manipulation. Am I just crazy or does anyone else feel like this?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/om9k95/why_is_everyone_just_okay_with_social_media_being/",
  "subreddit": "TooAfraidToAsk",
  "id": "om9k95",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all know that it takes like 50 tries to get that perfect Instagram photo, and\nyet people treat it as if the person just wakes up that way. If we ALL know\nsocial media is so fake then why do we still compare ourselves to each other and\nget depressed over it? There's always some corporation trying…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "完璧なインスタグラムの写真を撮るには、50回以上の挑戦が必要だと言われています。\nそれなのに、まるでその人が目を覚ましたかのように扱われる。ソーシャルメディアは偽物だとわかっているのに\nソーシャルメディアが偽物だとわかっているなら、なぜ私たちはまだ自分自身をお互いに比較して\n落ち込んでしまうのでしょうか？常にどこかの企業が努力しています。",
      "title": "なぜみんな、ソーシャルメディアが完全にフェイクであることを良しとするのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道，要想拍出完美的Instagram照片，需要尝试50次，但人们却把它当作一个人一觉醒来就变成这样。\n然而，人们却把它当作一个人刚刚醒来时的样子。如果我们都知道\n社交媒体是如此虚假，那么为什么我们仍然互相比较，并为此感到沮丧？\n为它感到沮丧？总有一些公司试图...",
      "title": "为什么每个人都能接受社交媒体完全是假的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道，要想拍出完美的Instagram照片，需要嘗試50次，但人們卻把它當作一個人一覺醒來就變成這樣。\n然而，人們卻把它當作一個人剛剛醒來時的樣子。如果我們都知道\n社交媒體是如此虛假，那麼爲什麼我們仍然互相比較，併爲此感到沮喪？\n爲它感到沮喪？總有一些公司試圖...",
      "title": "爲什麼每個人都能接受社交媒體完全是假的？"
    }
  ]
}