{
  "author": "Feed-Me-Your-Tron",
  "original_created_utc": 1632478994,
  "title": "Making money is mentally exhausting",
  "created_utc": 1632502306,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Serious post from a regular Joe who has been in the game since 2017 and made all the mistakes, but I finally feel like a winner.</p>\n\n<p>I won&#39;t bore you with my whole journey, but in summary I invested a small fortune (5-10k) over several years through the bear market. Im not rich, but every time the market crashed, I bought more. It&#39;s a gamblers mentality... buy the dip and surely you will reap a quick return. Ignore what the parrots here say, it&#39;s not a good feeling when you buy something and it instantly dumps 10%. It doesn&#39;t make you a savvy investor &quot;being greedy when others are fearful&quot;, it&#39;s stressful feeling like you just keep fucking up over and over again.</p>\n\n<p>Fast forward, my coin took off more than most earlier this year. I had several days gaining 5-10k at a time. 100k profit was just a matter of time. Why would anyone cash out in that kind of market?? I&#39;d go to bed expecting to wake up to 10 - 20k profit, and it happened more than once. </p>\n\n<p>Fast forward again, flash crash.... and then a slow death.. my 80-90k was now 20k. Its not a good feeling. The fomo makes it incredibly difficult to hit the sell button. What if I sell and it goes 2x overnight??</p>\n\n<p>Final fast forward, this time I had a plan and stuck to it. Recovered to a certain threshold and sold $20k of my stack. It wasn&#39;t easy. All I was thinking was how much it would suck if it boomed tomorrow. Since selling, the market has dumped and my coin is down 10%, and I couldn&#39;t feel better about it.</p>\n\n<p>So at the end of this rambling, what&#39;s the point? In short, it&#39;s incredibly taxing mentally and emotionally when you have a large sum of money and try to milk every last cent of it. Moreover, most of the people here posting advice don&#39;t have anywhere near these amounts... so be careful who&#39;s advice you heed.</p>\n\n<p>My advice as someone who started with little, made a lot, lost a lot, and was fortunate enough to get a second go at it: take profits. Fuck you money is the dream, but its rare and it isn&#39;t worth the mental anguish. It&#39;s good to take a win now and then, even if it&#39;s not a tattslotto sized one.</p>\n\n<p>Happy trading!</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/pugvk6/making_money_is_mentally_exhausting/",
  "subreddit": "CryptoCurrency",
  "id": "pugvk6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Serious post from a regular Joe who has been in the game since 2017 and made all\nthe mistakes, but I finally feel like a winner.\n\nI won't bore you with my whole journey, but in summary I invested a small\nfortune (5-10k) over several years through the bear market. Im not rich, but\nevery time the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2017年からゲームに参加し、すべてのミスを犯した普通のジョーからの真面目な投稿\nしかし、私は最終的に勝者のように感じています。\n\n私はあなたに私の全体の旅を退屈させませんが、要約すると、私は小さな財産を投資しました。\n数年に渡って弱気な市場を通して小額の財産（5～10k）を投資しました。金持ちではありませんが\n毎回のように...",
      "title": "お金を稼ぐのは精神的に疲れる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个自2017年以来一直在游戏中的普通乔的严肃帖子，他犯了所有的\n错，但我终于觉得自己是个赢家。\n\n我不会让你厌烦我的整个旅程，但总的来说，我投资了一小笔\n财富（5-10万），经过几年的熊市。我并不富有，但\n每一次都是如此。",
      "title": "赚钱是一种精神上的消耗"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個自2017年以來一直在遊戲中的普通喬的嚴肅帖子，他犯了所有的\n錯，但我終於覺得自己是個贏家。\n\n我不會讓你厭煩我的整個旅程，但總的來說，我投資了一小筆\n財富（5-10萬），經過幾年的熊市。我並不富有，但\n每一次都是如此。",
      "title": "賺錢是一種精神上的消耗"
    }
  ]
}