{
  "author": "Mcgillby",
  "the_new_excerpt": "I would like to propose a 5% increase to monthly karma totals for users who\nvoted on at least one governance poll in the previous session, up to a maximum\nof 500 extra karma.\n\nThis would encourage people to participate in governance which is one of the\nmain reasons MOON exists. Even though activity…",
  "original_created_utc": 1616026277,
  "localize": [
    {
      "locale": "zh",
      "title": "提案]凡是在施政调查中投票的人，可获得5%的奖励月球。",
      "the_new_excerpt": "我建议对以下用户的每月业力总额增加5%。\n在上一届会议上至少就一项治理投票进行了表决，但最多只能有一项。\n的500个额外业力。\n\n这将鼓励人们参与治理，这是其中的一项\nMOON存在的主要原因。即使活动..."
    },
    {
      "locale": "zh-Hant",
      "title": "提案]凡是在施政調查中投票的人，可獲得5%的獎勵月球。",
      "the_new_excerpt": "我建議對以下用戶的每月業力總額增加5%。\n在上一屆會議上至少就一項治理投票進行了表決，但最多隻能有一項。\n的500個額外業力。\n\n這將鼓勵人們參與治理，這是其中的一項\nMOON存在的主要原因。即使活動..."
    }
  ],
  "title": "[PROPOSAL] 5% Bonus MOONs for anyone who votes on governance polls",
  "created_utc": 1616038228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I would like to propose a 5% increase to monthly karma totals for users who voted on at least one governance poll in the previous session, up to a maximum of 500 extra karma.</p>\n\n<p>This would encourage people to participate in governance which is one of the main reasons MOON exists. Even though activity is up in recent months, we have had a hard time achieving the minimum quorum on some good proposals and this may help get people more active in our governance by providing a small incentive for participation while not overly benefiting the highest earners and diluting the distribution.</p>\n\n<p>Based off input from previous proposals, I wanted to make this as simple as possible to qualify for. In order to get this bonus karma, all you have do is vote on at least one proposal in a 4-week session. You do not need to hold any moons when you vote, so this will also benefit new users who have not yet received their first distributions.</p>\n\n<h2>Summary:</h2>\n\n<ul>\n<li>5% karma bonus to next distribution for users who vote on at least one governance poll in a 4-week period</li>\n<li>Maximum of 500 karma from this bonus in one session</li>\n<li>Voting with any amount of MOONs will qualify, even 0</li>\n</ul>\n\n<p><a href=\"https://www.reddit.com/poll/m7ehzz\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 1004,
  "permalink": "/r/CryptoCurrency/comments/m7ehzz/proposal_5_bonus_moons_for_anyone_who_votes_on/",
  "subreddit": "CryptoCurrency",
  "id": "m7ehzz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147379940
}