{
  "author": "m00ncake80",
  "original_created_utc": 1627679417,
  "title": "$100 million shorts liquidated in the last hour",
  "created_utc": 1627696612,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nearly $100 million shorts have been liquidated over the last hour (<a href=\"https://www.bybt.com/LiquidationData\">https://www.bybt.com/LiquidationData</a>) leading to the large rise in price. BTC is heading towards its 10th daily green candle. I went back as far as Dec 2013 and couldn’t see any 10 daily green candle consecutively (correct me if I’m wrong). We could be making history tonight and we’ll all be apart of that.</p>\n\n<p>Edit: as pointed out the highest is actually 13 candles back in December 2011, 11 candles back in September 2012 and an another 10 candle movement in Oct 2013. (I’ve checked these on the BITSTAMP chart)</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/CryptoCurrency/comments/ouu0a9/100_million_shorts_liquidated_in_the_last_hour/",
  "subreddit": "CryptoCurrency",
  "id": "ouu0a9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nearly $100 million shorts have been liquidated over the last hour\n(https://www.bybt.com/LiquidationData) leading to the large rise in price. BTC\nis heading towards its 10th daily green candle. I went back as far as Dec 2013\nand couldn’t see any 10 daily green candle consecutively (correct me if…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この1時間で約1億ドルのショートが清算された\n(https://www.bybt.com/LiquidationData)が大きな価格上昇につながっています。BTC\nは10本目の日足緑ローソクに向かっている。2013年12月まで遡ってみたが\n2013年12月まで遡ってみましたが、連続して10本の日足グリーンローソクは見当たりませんでした（...と言ったら訂正してください）。",
      "title": "最後の1時間で1億ドルのショートが清算された"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "过去一小时内有近1亿美元的空头被清算\n(https://www.bybt.com/LiquidationData)，导致价格大幅上涨。BTC\n正朝着它的第10根日线绿色蜡烛前进。我最早追溯到2013年12月\n并没有看到任何连续的10根日线绿烛（纠正我，如果...",
      "title": "1亿美元的空头在最后一小时被清算"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "過去一小時內有近1億美元的空頭被清算\n(https://www.bybt.com/LiquidationData)，導致價格大幅上漲。BTC\n正朝着它的第10根日線綠色蠟燭前進。我最早追溯到2013年12月\n並沒有看到任何連續的10根日線綠燭（糾正我，如果...",
      "title": "1億美元的空頭在最後一小時被清算"
    }
  ]
}