{
  "author": "HarlansWorld",
  "original_created_utc": 1642422094,
  "title": "Is it stupid or not stupid to write \"wrong side\" on my left arm when I am having surgery on my right tomorrow?",
  "created_utc": 1642435435,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically the title. The top of my right biceps tendon will be relocated tomorrow and I&amp;#39;m full of anxiety. I&amp;#39;ve only had abdominal surgery before, so there was no incorrect side to worry about. Google, of course, has comforted me with stories of surgical mistakes. I feel like I should use a sharpie and leave a note on my left side stating it is the wrong side, but don&amp;#39;t want to insult my surgeon...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/NoStupidQuestions/comments/s62so4/is_it_stupid_or_not_stupid_to_write_wrong_side_on/",
  "subreddit": "NoStupidQuestions",
  "id": "s62so4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Basically the title. The top of my right biceps tendon will be relocated\ntomorrow and I'm full of anxiety. I've only had abdominal surgery before, so\nthere was no incorrect side to worry about. Google, of course, has comforted me\nwith stories of surgical mistakes. I feel like I should use a sharpie…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的にはタイトル通りです。右上腕二頭筋腱の上部を移設することになりました。\n明日から不安で一杯です。今まで腹部の手術しかしたことがないので\n心配するような不正確な側面はありませんでした。Googleはもちろん、私を慰めてくれたのは\n手術の失敗談で シャープペンを使った方がいいような気がしてきた・・・。",
      "title": "明日、右の手術をするのに、左腕に「左右違い」と書くのは、バカなのか、バカじゃないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上就是这个题目。我的右肱二头肌肌腱的顶部明天将被重新定位\n明天，我充满了焦虑。我以前只做过腹部手术，所以\n我以前只做过腹部手术，所以没有不正确的一面需要担心。当然，谷歌已经安慰了我\n用手术错误的故事来安慰我。我觉得我应该用锐利的笔...",
      "title": "明天我的右臂要做手术，在左臂上写上 \"错误的一面\"，是傻还是不傻？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上就是這個題目。我的右肱二頭肌肌腱的頂部明天將被重新定位\n明天，我充滿了焦慮。我以前只做過腹部手術，所以\n我以前只做過腹部手術，所以沒有不正確的一面需要擔心。當然，谷歌已經安慰了我\n用手術錯誤的故事來安慰我。我覺得我應該用銳利的筆...",
      "title": "明天我的右臂要做手術，在左臂上寫上 \"錯誤的一面\"，是傻還是不傻？"
    }
  ]
}