{
  "author": "PurpleMastodon9499",
  "the_new_excerpt": "I finally get it, it was like a wave that hit me in the face and I just wanna\nsay I'm sorry I ever doubted bitcoin from the beginning but I was blinded.\n\nI've got a background in finance so naturally everything we were taught at\ncollege is that stocks, indices, etfs they all are either part of a…",
  "original_created_utc": 1620321512,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はようやく理解しました、それは私の顔に当たった波のようでした、そして私はただ言いたいです。\n最初からビットコインを疑っていてごめんなさい、でも私は盲目でした。\n\n私は金融のバックグラウンドを持っているので、当然、大学で教えられたことはすべて理解していました。\n大学で教えられたことは、株、インデックス、EFS、これらはすべて、ある種の...",
      "title": "やっとわかりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我终于明白了，这就像一个浪潮打在我的脸上，我只想说\n我很抱歉我从一开始就怀疑比特币，但我被蒙蔽了。\n\n我有金融背景，所以我们在大学里学到的东西自然是\n大学里教的都是股票，指数，ETF 它们都是一个...",
      "title": "我终于明白了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我終於明白了，這就像一個浪潮打在我的臉上，我只想說\n我很抱歉我從一開始就懷疑比特幣，但我被矇蔽了。\n\n我有金融背景，所以我們在大學裏學到的東西自然是\n大學裏教的都是股票，指數，ETF 它們都是一個...",
      "title": "我終於明白了。"
    }
  ],
  "title": "I finally understand.",
  "created_utc": 1620337043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I finally get it, it was like a wave that hit me in the face and I just wanna say I&#39;m sorry I ever doubted bitcoin from the beginning but I was blinded.</p>\n\n<p>I&#39;ve got a background in finance so naturally everything we were taught at college is that stocks, indices, etfs they all are either part of a company or track an underlying asset hence when bitcoin was first introduced to me in 2017, I laughed and say there&#39;s not shot this shit isn&#39;t even real nor does it track anything its gonna collapse, but boy was I fucking wrong and I am sorry to the bitcoin community, I finally understand why bitcoin is so valuable, every finance tute there is a specific saying &quot;A dollar today is worth more than a dollar tomorrow&quot; with bitcoin it&#39;s literally the only asset apart from gold where a bitcoin today is worth more than a dollar tomorrow, and it doesn&#39;t matter if you own 1 bitcoin or 0.00001 as long as you have some bitcoin in your portfolio (excluding the profits) I can&#39;t find anything better whereby your wealth is preserved especially with the insane amount of inflation that not only is occurring but that has already occurred and I&#39;m gonna continue to DCA my way buying into bitcoin because while some might think this is close to the tip of the iceberg, bitcoin is only just beginning.</p>\n</div><!-- SC_ON -->",
  "score": 467,
  "permalink": "/r/Bitcoin/comments/n6cesq/i_finally_understand/",
  "subreddit": "Bitcoin",
  "id": "n6cesq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985986287
}