{
  "author": "calipfarris01",
  "the_new_excerpt": "For the past month I've been getting absolutely crushed little by little each\nday it seems like in every sector. I feel like I have a pretty well diversified\nportfolio. I'm not really heavy on any one particular stock out of the ones\nbelow, so I'm not even sure where the majority of the losses are…",
  "original_created_utc": 1616615045,
  "localize": [
    {
      "locale": "zh",
      "title": "不只是我吧？",
      "the_new_excerpt": "在过去的一个月里，我一直在被绝对粉碎一点一点的每个\n天，似乎在每个行业。我觉得我有一个很好的多元化的。\n投资组合。我不是真的重在任何一个特定的股票的那些。\n下面，所以我都不知道大部分的损失在哪里... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "不只是我吧？",
      "the_new_excerpt": "在過去的一個月裏，我一直在被絕對粉碎一點一點的每個\n天，似乎在每個行業。我覺得我有一個很好的多元化的。\n投資組合。我不是真的重在任何一個特定的股票的那些。\n下面，所以我都不知道大部分的損失在哪裏... ..."
    }
  ],
  "title": "It's not just me right?",
  "created_utc": 1616628765,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the past month I&#39;ve been getting absolutely crushed little by little each day it seems like in every sector.  I feel like I have a pretty well diversified portfolio.  I&#39;m not really heavy on any one particular stock out of the ones below, so I&#39;m not even sure where the majority of the losses are coming from.  I&#39;m still green on most everything but I&#39;ve given back a lot of gains, these definitely aren&#39;t all my investments but a majority of the bigger positions.<br/>\nTech/Growth:  AAPL, GOOG, PLTR, TSLA, AMZN, AMD, UBER, BABA, JD etc. ~35%<br/>\nTravel/Rebound (cyclical):  UAL, AAL, OXY, MGM, MAR, NCLH, TRIP, ABNB ~30%<br/>\nFinancials: WFC, BCS, JPM, BAC~10%<br/>\nRetail stocks for stimulus check play:  UAA, NKE, M, LULU, etc.  ~10%<br/>\nOther positions making up less than 15%   </p>\n\n<p>Somehow I&#39;ve lost about 20% of my portfolio with these names in the last month, it doesn&#39;t feel like it but every day it goes down 1 or 2% and that starts to add up.  I know I know, in 5 years who cares but I just wanted to know if other people seem to be in the same boat.  I haven&#39;t seen the main indexes see that kind of loss so I&#39;m not getting where it seems to be coming from.  Even today when all looked great in the morning now somehow I&#39;m deep red again (another 2%) despite indexes being mostly stable.</p>\n</div><!-- SC_ON -->",
  "score": 6873,
  "permalink": "/r/stocks/comments/mceprg/its_not_just_me_right/",
  "subreddit": "stocks",
  "id": "mceprg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822104
}