{
  "author": "MarioTheMojoMan",
  "original_created_utc": 1636601543,
  "title": "What led 3/4 of American state legislatures to surrender a massive amount of power by ratifying the 17th amendment?",
  "created_utc": 1636653014,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Prior to the 17th Amendment to the US Constitution, senators were chosen by state legislatures, rather than directly elected. But constitutional amendments in the US require the assent of 3/4 of state legislatures, who, one would think, would logically be resolutely opposed to giving up this influence they had on the federal government. So what benefit did state legislatures see in ratifying the 17th amendment and switching to direct election of senators?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qrbte6/what_led_34_of_american_state_legislatures_to/",
  "subreddit": "AskHistorians",
  "id": "qrbte6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Prior to the 17th Amendment to the US Constitution, senators were chosen by\nstate legislatures, rather than directly elected. But constitutional amendments\nin the US require the assent of 3/4 of state legislatures, who, one would think,\nwould logically be resolutely opposed to giving up this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "米国憲法修正第17条以前は、上院議員は直接選挙ではなく、州議会によって選ばれていました。\n上院議員は直接選挙ではなく、州議会によって選ばれていました。しかし、米国では憲法改正により\nアメリカの憲法改正には、州議会の3/4の賛成が必要です。\n憲法改正には州議会の3/4の賛成が必要であり、これを放棄することには断固として反対すると考えられます。",
      "title": "アメリカの州議会の3/4が修正第17条を批准して大きな権限を放棄したのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在美国宪法第17条修正案之前，参议员是由各州立法机构选出来的，而不是直接选举产生的。\n州立法机构选出，而不是直接选举。但美国的宪法修正案\n美国的宪法修正案需要3/4的州立法机构同意，人们认为，这些立法机构\n从逻辑上讲，他们会坚决反对放弃这个......",
      "title": "是什么导致美国3/4的州立法机构通过批准第17条修正案交出了大量的权力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在美國憲法第17條修正案之前，參議員是由各州立法機構選出來的，而不是直接選舉產生的。\n州立法機構選出，而不是直接選舉。但美國的憲法修正案\n美國的憲法修正案需要3/4的州立法機構同意，人們認爲，這些立法機構\n從邏輯上講，他們會堅決反對放棄這個......",
      "title": "是什麼導致美國3/4的州立法機構通過批准第17條修正案交出了大量的權力？"
    }
  ]
}