{
  "author": "Faze-Cumshot",
  "original_created_utc": 1636916668,
  "title": "DOT vs SOL: Which one would you bet on for long term (5+ years) from now?",
  "created_utc": 1636932649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Although both of these projects are good in their own way, but if you had to choose one to HODL for long term ,I&#39;m talking about 5+ years. So which one are you more bullish on. Solana did outperform Polkadot by miles this year but with Polkadot parachain auctions launching we can see triple digit DOT pretty soon as well. SOL vs DOT is the most debated question I saw many times even on this subreddit. If you had $1000 and you had to pick between these 2 which one would you choose and why? More importantly you can&#39;t sell for 5 years.</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/qtwt80/dot_vs_sol_which_one_would_you_bet_on_for_long/",
  "subreddit": "CryptoCurrency",
  "id": "qtwt80",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Although both of these projects are good in their own way, but if you had to\nchoose one to HODL for long term ,I'm talking about 5+ years. So which one are\nyou more bullish on. Solana did outperform Polkadot by miles this year but with\nPolkadot parachain auctions launching we can see triple digit…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どちらのプロジェクトもそれなりに優れていますが、長期的にHODLするなら\n選ぶとしたら、5年以上の長期に渡ってHODLする方を選ぶべきだと思います。どちらのプロジェクトに\n強気なのでしょうか？今年、SolanaはPolkadotを何マイルも上回っていました。\nしかし、Polkadotのパラチェインオークションが始まると、3桁の...",
      "title": "DOT vs SOL：今からの長期（5年以上）ではどちらに賭けるか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然这两个项目都有各自的优点，但如果你不得不选择\n选择一个长期的HODL，我指的是5年以上的时间。那么，哪一个是\n你更看好哪一个。索拉纳今年的表现确实远远超过了波尔卡多特，但与此同时\n但随着Polkadot拍卖会的启动，我们可以看到三位数的...",
      "title": "DOT与SOL：从现在起的长期（5年以上）来看，你会赌哪一个？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然這兩個項目都有各自的優點，但如果你不得不選擇\n選擇一個長期的HODL，我指的是5年以上的時間。那麼，哪一個是\n你更看好哪一個。索拉納今年的表現確實遠遠超過了波爾卡多特，但與此同時\n但隨着Polkadot拍賣會的啓動，我們可以看到三位數的...",
      "title": "DOT與SOL：從現在起的長期（5年以上）來看，你會賭哪一個？"
    }
  ]
}