{
  "author": "SenatusSPQR",
  "original_created_utc": 1625406487,
  "title": "Crypto's threat to central banking (a primer on central banking and why crypto is an existential threat to it)",
  "created_utc": 1625441746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p><em>The root problem with conventional currency is all the trust that&#39;s required to make it work. The central bank must be trusted not to debase the currency, but the history of fiat currencies is full of breaches of that trust.</em></p>\n</blockquote>\n\n<p>In one of the first lines of the <a href=\"https://satoshi.nakamotoinstitute.org/posts/p2pfoundation/1/\">first post by Satoshi</a>, he (she? they?) names one of their primary reasons for creating Bitcoin and starting the cryptocurrency space. Following the financial crisis around 2008, central banks largely “printed” extra money, debasing everyone’s cash. In this post, I outline why central banks did so at the time, how this money printing works, and why crypto can be seen as such a threat to central banking. If you&#39;re only interested in the latter, scroll down.</p>\n\n<p><strong>Why central banks want inflation</strong></p>\n\n<p>The general idea behind targeting inflation of roughly 2% per year is that, essentially, low inflation is better than deflation. The thinking behind this is that when there is deflation (negative inflation), people postpone purchases/investment, causing prices to fall further (since sellers will decrease prices to at least get *some* income), leading to a downward spiral. This is, according to central banks, undesirable. </p>\n\n<p><strong>How much inflation do central banks want</strong></p>\n\n<p>Central banks typically target inflation of roughly 2% per year. The exact number isn’t that important – the key is that central banks aim for steady, positive inflation. 2% is seen as a good target, as this is far enough above 0% that there is no risk of deflation. It also provides a clear anchor for the market. If inflation is consistently lower than 2%, the public’s expectation is (should be) that central banks will provide stimulus to raise inflation. If inflation is overshooting 2%, central banks will try to rein it in. These expectations are partly self-fulfilling, and help achieve price stability where price stability is 2% inflation per year.</p>\n\n<p><strong>What this means in practice</strong> </p>\n\n<p>Increasing inflation isn’t as easy as pressing a button. Prices for goods and services aren’t decided centrally, at least not in the US, EU and Japan. To influence inflation, central banks have tools at their disposal. In short, focusing on the ECB here because I know it best, central banks have both standard measures and non-standard measures at their disposal.</p>\n\n<ol>\n<li><p>Interest rates on refinancing operations. Banks can borrow liquidity from the central bank against collateral. </p></li>\n<li><p>Interest rates on the deposit facility. Commercial banks can deposit liquidity at the central bank and get an interest rate, which is lower than the refinancing rate.</p></li>\n<li><p>Interest rates on marginal lending. Marginal lending offers overnight credit to commercial banks, at an interest rate above the refinancing operations rate.</p></li>\n</ol>\n\n<p>By changing these interest rates, the ECB (or Fed) can impact the rates at which banks lend out to customers. Simply put, if the ECB raises rates, it becomes more expensive to borrow money as a bank, and therefore when lending out money, they will want a higher interest rate. If the ECB decreases interest rates, it becomes cheaper to borrow money for commercial banks, and they are able to lend out to customers at a lower rate. This allows companies to invest more cheaply, and therefore should “stimulate” the economy during recessions. There are also non-standard measures, which are honestly rather complicated and which I will summarize as central banks buying up absolutely massive amounts of bonds with money that they create at will. This started with government bonds with an initial limit of 25%, expanded to semi-governmental entities, then to large corporates, and in countries like Japan has already expanded to the central bank buying stock ETFs.</p>\n\n<p>The central banks have also expanded lending to commercial banks through “Targeted long-term refinancing operations”, moving from offering overnight loans to offering long-term loans to commercial banks at very low rates.</p>\n\n<p><strong>Okay, but what does this mean in practice?</strong></p>\n\n<p>What it means is that central banks have been originating huge amounts of money, and pumping it into the economy. The ECB’s balance sheet for example has grown to roughly <a href=\"https://tradingeconomics.com/euro-area/central-bank-balance-sheet\">7,736,536 million Euro</a>, or 7,736 billion euro. To put this into perspective, total direct government debt in the eurozone is <a href=\"https://ec.europa.eu/eurostat/documents/2995521/11563051/2-23042021-AP-EN.pdf/a794c696-ae8b-db1e-ba8b-76529919a843?t=1619178233484\">roughly 11,100 billion euro</a>. In other words, the total holdings of the ECB are roughly 69% of total outstanding government debt in the EU. To be clear, not all ECB holdings are government debt, these holdings include corporate debt, loans to commercial banks, etc. </p>\n\n<p>Around the start of 2020, the ECB’s balance sheet was already large at roughly 4,800 billion owing to a massive expansion to fight the previous financial (and eurozone) crisis, but this expansion to 7,700 billion euro is large even compared to the start of 2020.</p>\n\n<p>Some small sidenotes have to be placed here, part of the ECB’s holdings are gold, receivables from the IMF, etc. This together however doesn’t even account for 10% of the balance sheet. The overwhelmingly vast majority is money “created” by the ECB themselves, used to purchase these bonds. When we talk about central banks debasing currencies, we’re not just talking about money being physically printed. A central bank can change numbers internally, and directly use this money to then buy bonds, or lend it to commercial banks.</p>\n\n<p><strong>The threat from crypto</strong></p>\n\n<p>In central banking terms, the route from the central bank changing variables they control to the economy actually being impacted is called the “monetary transmission mechanism”. This monetary transmission mechanism is the major fear central banks have when it comes to cryptocurrencies (or other currencies). If we all came to the conclusion today that the euro isn’t valuable anymore, and that we’d rather hold crypto, then all the money creation in the world won’t help central banks. If the past years have shown anything for the ECB, it’s that they can’t seem to hit their inflation targets, despite extraordinary measures. </p>\n\n<p>At the end of the day, money supply increases aim at increasing investment and spending, to hit a 2% inflation target. Helicopter money is an extreme option that has been explored, in which for example €1,000 would be directly given to EU residents to kickstart spending and investment. However, if people convert this money into crypto, save in crypto, and see their net worth in crypto terms rather than euro terms, then €1,000 does not matter, nor would €1,000,000. It would devalue the euro, rather than leading to actual investment and spending.</p>\n\n<p>This is one of the main fears of central banking. When people stop seeing the euro, or the dollar, or any currency, as a safe haven, as a store of value, the euro becomes worthless. People no longer see the Venezuelan Bolivar as a proper currency. Instead, they convert to dollars, to crypto, to anything except Venezuelan Bolivar. Venezuela can’t create additional dollars or crypto, only Bolivars. In other words, their monetary control over the economy is lost.</p>\n\n<p>That is the fear that the ECB, the Fed, and the Japanese central bank have. Crypto isn’t just another currency, it’s an existential threat. Libra/Diem was attacked harshly for this same reason. It takes away control from central banks. <strong>With each person that converts their fiat into crypto because they realise fiat is constantly being debased, central banks’ influence decreases. With every person who sees their crypto as money, rather than just an investment to get more fiat, central banks lose power.</strong> That is terrifying to central banks. It threatens their very core, and it’s something that is by definition impossible for them to emulate. </p>\n\n<p>This is what crypto was originally made for. It was made to wrestle away control from central banks, to make it impossible to manipulate the money supply. To offer a currency that we can save in securely, that can be spent sovereignly, without needing middlemen and without needing trust. To do away with trust in central banks, to replace it by algorithmic certainty. </p>\n\n<p>I hope you enjoyed this longread, I&#39;m always open for discussion and questions!</p>\n\n<p>Edit: to those that like these kind of long-reads, I have a few <a href=\"https://senatus.substack.com/\">more of them here</a> about for example what I see as the <a href=\"https://senatus.substack.com/p/why-99-of-cryptocurrencies-centralize\">biggest issue for 99% of cryptocurrencies (centralization over time)</a> or about <a href=\"https://senatus.substack.com/p/why-nano-is-the-ultimate-store-of-value-and-reserve-currency-3b0318844bc8\">analyzing crypto as a store of value</a>.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/odkspo/cryptos_threat_to_central_banking_a_primer_on/",
  "subreddit": "CryptoCurrency",
  "id": "odkspo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "> The root problem with conventional currency is all the trust that's required\n> to make it work. The central bank must be trusted not to debase the currency,\n> but the history of fiat currencies is full of breaches of that trust.\n\nIn one of the first lines of the first post by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 従来の通貨の根本的な問題は、信頼を必要とすることです。\n> なくてはならないことです。中央銀行は、通貨の価値を下げないように信頼されなければなりません。\n> しかし、不換紙幣の歴史は、その信頼の破壊に満ちています。\n\n最初の投稿の1行目に...",
      "title": "Crypto's threat to central banking（中央銀行の入門書であり、なぜ中央銀行にとって暗号が存在的な脅威となるのか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> 传统货币的根本问题是需要所有的信任\n> 以使其发挥作用。必须相信中央银行不会使货币贬值。\n> 但法定货币的历史充满了对这种信任的破坏。\n\n在一个人的第一篇文章的第一句话中，他说：\"我不知道。",
      "title": "加密货币对中央银行的威胁（中央银行的入门知识，以及为什么加密货币对它的存在构成威胁）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 傳統貨幣的根本問題是需要所有的信任\n> 以使其發揮作用。必須相信中央銀行不會使貨幣貶值。\n> 但法定貨幣的歷史充滿了對這種信任的破壞。\n\n在一個人的第一篇文章的第一句話中，他說：\"我不知道。",
      "title": "加密貨幣對中央銀行的威脅（中央銀行的入門知識，以及爲什麼加密貨幣對它的存在構成威脅）。"
    }
  ]
}