{
  "author": "Zestyclose-Pea-3533",
  "original_created_utc": 1625956914,
  "title": "What’s the deal with Buzzfeed straight up copy and pasting Reddit feeds in lieu of writing their own article?",
  "created_utc": 1625980336,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I occasionally scroll through Apple News and quite often see Buzzfeed “articles” that are literally copies of the top comments on Reddit chains. This always struck me as kind of sleazy on their part… then today I happened to be on Apple News and saw that Buzzfeed did it again and my comment was featured without me being notified/asked permission. I get that legally there’s probably a justification because Reddit is a public platform and they credit our usernames, but I’m surprised there isn’t more of a backlash from Reddit users. Thoughts?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/ohskh4/whats_the_deal_with_buzzfeed_straight_up_copy_and/",
  "subreddit": "NoStupidQuestions",
  "id": "ohskh4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I occasionally scroll through Apple News and quite often see Buzzfeed “articles”\nthat are literally copies of the top comments on Reddit chains. This always\nstruck me as kind of sleazy on their part… then today I happened to be on Apple\nNews and saw that Buzzfeed did it again and my comment was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "たまにApple Newsを見ていると、Buzzfeedの \"記事 \"がよく出てきます。\nは、Redditチェーンのトップコメントを文字通りコピーしたものです。これはいつも\nそして今日、私はたまたまApple Newsを見ていました。\nそして今日、たまたまApple Newsを見ていたら、Buzzfeedがまた同じことをしていたので、私のコメントを...。",
      "title": "バズフィードが自分で記事を書く代わりに、Redditのフィードをそのままコピー＆ペーストするのはどうなんでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我偶尔翻阅苹果新闻，经常看到Buzzfeed的 \"文章\"\n这些文章简直就是Reddit链上的顶级评论的副本。这总是\n然后今天我碰巧在苹果新闻上看到了Buzzfeed的 \"文章\"，这些文章都是复制Reddit链上的顶级评论，这让我觉得他们有点卑鄙。\n新闻，看到Buzzfeed又这样做了，我的评论是......",
      "title": "Buzzfeed直接复制和粘贴Reddit feeds，而不是写自己的文章，这是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我偶爾翻閱蘋果新聞，經常看到Buzzfeed的 \"文章\"\n這些文章簡直就是Reddit鏈上的頂級評論的副本。這總是\n然後今天我碰巧在蘋果新聞上看到了Buzzfeed的 \"文章\"，這些文章都是複製Reddit鏈上的頂級評論，這讓我覺得他們有點卑鄙。\n新聞，看到Buzzfeed又這樣做了，我的評論是......",
      "title": "Buzzfeed直接複製和粘貼Reddit feeds，而不是寫自己的文章，這是怎麼回事？"
    }
  ]
}