{
  "author": "garbagecrap",
  "original_created_utc": 1652979426,
  "title": "I'm at a rowdy frat party in 1970s America. Was the music being played your generic top 40 \"dad rock\" or was there a subgenre of heavier party music, like the hip-hop \"bangers\" and electronic music you might hear today?",
  "created_utc": 1652987004,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Visit a house party in 2022 and the music isn&amp;#39;t representative of what you hear on the radio. The tracks have heavier bass, they&amp;#39;re simpler, more aggressive.&lt;/p&gt;\n\n&lt;p&gt;Can the same be said for parties of the 1970s? &lt;/p&gt;\n\n&lt;p&gt;What were the &amp;quot;bangers&amp;quot; of this era, and did it differ from what was played on the radio?&lt;/p&gt;\n\n&lt;p&gt;For the sake of specificity, lets assume our frat party takes place in a major city, such as the NYU campus.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 148,
  "permalink": "/r/AskHistorians/comments/ut7ui9/im_at_a_rowdy_frat_party_in_1970s_america_was_the/",
  "subreddit": "AskHistorians",
  "id": "ut7ui9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Visit a house party in 2022 and the music isn't representative of what you hear\non the radio. The tracks have heavier bass, they're simpler, more aggressive.\n\nCan the same be said for parties of the 1970s?\n\nWhat were the \"bangers\" of this era, and did it differ from what was played on\nthe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2022年のハウスパーティーを訪問し、音楽は代表的なものではありません\nラジオで聴くような音楽ではありません。より重低音で、よりシンプルで、よりアグレッシブな音楽が流れています。\n\nでは、1970年代のパーティーはどうだったのでしょうか？\n\nこの時代の \"バンガー \"は、ラジオから流れてくる音楽とどう違うのでしょうか？\nそれは...",
      "title": "私は1970年代のアメリカの騒々しい社交パーティにいます。そこで流れていた音楽は、一般的なトップ40の「お父さんロック」だったのか、それとも、今でいうヒップホップの「バンガー」や電子音楽のような、よりヘビーなパーティ音楽のサブジャンルがあったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在2022年参观一个家庭聚会，其音乐并不代表你在广播中听到的内容\n的音乐。这些曲目有更重的低音，它们更简单，更有侵略性。\n\n20世纪70年代的聚会也是这样吗？\n\n这个时代的 \"流行音乐 \"是什么，它是否与广播中播放的不同？\n的音乐不同。",
      "title": "我在20世纪70年代美国的一个喧闹的兄弟会派对上。所播放的音乐是一般的前40名的 \"爸爸摇滚\"，还是有一个更重的聚会音乐的亚流派，就像你今天可能听到的嘻哈 \"bangers \"和电子音乐？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在2022年參觀一個家庭聚會，其音樂並不代表你在廣播中聽到的內容\n的音樂。這些曲目有更重的低音，它們更簡單，更有侵略性。\n\n20世紀70年代的聚會也是這樣嗎？\n\n這個時代的 \"流行音樂 \"是什麼，它是否與廣播中播放的不同？\n的音樂不同。",
      "title": "我在20世紀70年代美國的一個喧鬧的兄弟會派對上。所播放的音樂是一般的前40名的 \"爸爸搖滾\"，還是有一個更重的聚會音樂的亞流派，就像你今天可能聽到的嘻哈 \"bangers \"和電子音樂？"
    }
  ]
}