{
  "author": "ErikasKabak",
  "the_new_excerpt": " * Yellen again reiterates that the focus now is not on tax increases, but\n   rather on relief programs tied to the pandemic.\n * Yellen says that technologies in terrorist financing change over time, and\n   response also needs to change with it. She noted crypotcurrency as an area of\n   concern for…",
  "original_created_utc": 1611081883,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": " *耶伦再次重申，现在的重点不是增税，而是\n   而不是与该大流行病有关的救济计划。\n * 耶伦说，资助恐怖主义的技术会随着时间的推移而改变。\n   应对措施也需要随之改变。她指出，加密货币作为一个领域的\n   关心",
      "title": "叶伦摘要今天。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " *耶倫再次重申，現在的重點不是增稅，而是\n   而不是與該大流行病有關的救濟計劃。\n * 耶倫說，資助恐怖主義的技術會隨着時間的推移而改變。\n   應對措施也需要隨之改變。她指出，加密貨幣作爲一個領域的\n   關心",
      "title": "葉倫摘要今天。"
    }
  ],
  "title": "YELLEN SUMMARY TODAY.",
  "created_utc": 1611087538,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li>Yellen again reiterates that the focus now is not on tax increases, but rather on relief programs tied to the pandemic.</li>\n<li>Yellen says that technologies in <strong>terrorist financing</strong> change over time, and response also needs to change with it. She noted crypotcurrency as an area of concern for terrorist and criminal financing.</li>\n<li>“I believe the future is likely to bring <strong>low interest rates for a long time</strong>,” she said, adding it is possible for rates to rise.</li>\n<li>“I think we should take these risks very,very seriously. I think <strong>climate change is an existential threat</strong>.”</li>\n<li>“I would be very pleased to take a look” at <strong>issuing longer-term debt</strong>, including a <strong>50-year Treasury bond</strong>, she says.</li>\n<li><strong>Yellen goes on the offensive here over the question of the minimum wage</strong>, saying the latest research shows only “minimal” job losses in states that raised their minimum wage levels.</li>\n<li> Grassley said he’s “closely examining” Biden’s $1.9 trillion stimulus plan. He says the plan doesn’t appear to be well targeted and says it’s <strong>important to “focus efforts” on pandemic relief and not enact a “laundry list” of liberal reforms.</strong></li>\n<li>This appears to be a stab at the plans inclusion of a $15 federal minimum wage in the plan.</li>\n<li>She says there would be money for small business, grants to small entrepreneurs, eviction protections, nutrition assistance, paid leave -- all things to help minority communities.</li>\n<li>To <strong>not spend more on pandemic and economic relief would leave the economy worse off</strong>, she said. She said without deficit financing this aid, the economy could have long run problems and “scarring.”</li>\n<li>She says she is concerned that China is investing in electric vehicles and that most of the EV sales are projected to be in China in the coming years.</li>\n<li>Yellen says that they would not seek to roll back the 2017 tax cuts “now” while the economy is still struggling.</li>\n<li>Yellen says <strong>the value of the dollar should be determined by markets, and the U.S. does not seek a weaker currency to gain a competitive advantage.</strong></li>\n<li> Some hedge funds have “dangerous levels of leverage,” Yellen says. </li>\n<li>Grassley says he’s told Yellen that <strong>it would be a “big mistake” to raise taxes on individuals and businesses during a pandemic.</strong></li>\n</ul>\n\n<p>These are the most outstanding things that came to me for investing.</p>\n\n<p><strong><em>TL;DR MORE STIMULUS, MORE GREEN INVESTMENTS AND POLICIES AND COMPETING WITH CHINA, UPCOMING CRYPTO POLICIES, TAX CUTS ARE HERE TO STAY FOR THE PANDEMIC.</em></strong></p>\n\n<p>GOOD LUCK IN INVESTING. I HOPE YOUR AND MINE GREEN INVESTMENTS MOON!</p>\n</div><!-- SC_ON -->",
  "score": 1177,
  "permalink": "/r/investing/comments/l0q87h/yellen_summary_today/",
  "subreddit": "investing",
  "id": "l0q87h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217232
}