{
  "author": "Aggeaf123",
  "original_created_utc": 1640304733,
  "title": "\"I’m not anti ETH. I’m anti-centralized, VC-owned, single point of failure, and corporate controlled lies\" - Jack Dorsey, former Twitter CEO",
  "created_utc": 1640364813,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is one of the most ridiculous things I have seen in a long time. Why do these billionaires have to tamper in crypto? Is it so that they just can&amp;#39;t keep their greedy hands away from the space or why are they drawn to it.&lt;/p&gt;\n\n&lt;p&gt;Jack Dorsey former Twitter CEO - recently posted this on twitter and from what I&amp;#39;m reading it seems like he&amp;#39;s anti himself. Why do people listen to these guys? Why do people look up to them? Most of them come from rich family&amp;#39;s or had some insane luck or connections. They are rarely different from your ordinary man and ever it&amp;#39;s even more rare for them to be a good person. They are like parasites latching onto anything with money. If Jack was so anti-centralization where was he 7 years ago or 5 years ago? These guys need to laughed at when they post stuff like this but instead they get praised by their flock of sheeps who don&amp;#39;t understand how to think their own thoughts. This stuff makes my blood boil.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/rn987v/im_not_anti_eth_im_anticentralized_vcowned_single/",
  "subreddit": "CryptoCurrency",
  "id": "rn987v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is one of the most ridiculous things I have seen in a long time. Why do\nthese billionaires have to tamper in crypto? Is it so that they just can't keep\ntheir greedy hands away from the space or why are they drawn to it.\n\nJack Dorsey former Twitter CEO - recently posted this on twitter and from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、私が長い間見てきた中で最もばかげたことの一つである。なぜ\nこの億万長者たちは、暗号を改ざんする必要があるのでしょうか？それは、彼らがどうしても\nそれとも、なぜこの分野に引き寄せられるのでしょうか。\n\nジャック・ドーシー元ツイッターCEOは、最近ツイッターでこのように投稿しています。",
      "title": "\"アンチETH \"ではないんです。反中央集権、VC所有、単一障害点、企業支配の嘘だ」-ジャック・ドーシー（元Twitter CEO"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我在很长一段时间内看到的最荒谬的事情之一。为什么\n这些亿万富翁要在加密货币上做手脚？是为了让他们不能把贪婪的手从这个领域中移开？\n他们贪婪的手远离这个领域，还是他们被吸引到这个领域。\n\n杰克-多尔西（Jack Dorsey），前Twitter首席执行官--最近在twitter上发布了这个消息，从...",
      "title": "\"我不反对ETH。我反对中心化的、风险投资公司拥有的、单点故障的、企业控制的谎言\"--杰克-多尔西，前Twitter CEO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我在很長一段時間內看到的最荒謬的事情之一。爲什麼\n這些億萬富翁要在加密貨幣上做手腳？是爲了讓他們不能把貪婪的手從這個領域中移開？\n他們貪婪的手遠離這個領域，還是他們被吸引到這個領域。\n\n傑克-多爾西（Jack Dorsey），前Twitter首席執行官--最近在twitter上發佈了這個消息，從...",
      "title": "\"我不反對ETH。我反對中心化的、風險投資公司擁有的、單點故障的、企業控制的謊言\"--傑克-多爾西，前Twitter CEO"
    }
  ]
}