{
  "author": "Agreeable_Ad_322",
  "original_created_utc": 1638993799,
  "title": "I think I finally get it now.",
  "created_utc": 1639002865,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The fiat currency banking system is doomed to fail because most all new money is created as debt; only backed by a banks promise to pay it back. In other words, backed by nothing.&lt;/p&gt;\n\n&lt;p&gt;Banks make money by lending. But banks don&amp;#39;t actually lend money they have. Instead, they &lt;em&gt;create&lt;/em&gt; it by writing it into borrowers accounts. &lt;/p&gt;\n\n&lt;p&gt;Whenever we take out a loan, we are led to believe that we&amp;#39;ve received money from someone else&amp;#39;s deposits. The reality is that the bank actually just wires you the amount it has promised to owe you. &lt;/p&gt;\n\n&lt;p&gt;In the real world, the lender must have something to lend. If you need a hammer, my written promise to provide a hammer I don&amp;#39;t have will be of no use.&lt;/p&gt;\n\n&lt;p&gt;But in the magical world of money, &lt;strong&gt;a banks written promise to provide you money it doesn&amp;#39;t have is allowed to be passed off as money&lt;/strong&gt;. 95% - 99% of money exists this way; as digits on bank accounts representing debt owed by the bank to you.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;DEBT = MONEY&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s not even the worst part. This system is doomed to fail because the debt is perpetual. &lt;/p&gt;\n\n&lt;p&gt;You see, banks only create the principle of the loans that they lend, not the interest. &lt;strong&gt;This means there will always be more debt than money&lt;/strong&gt;.  The money needed to pay back the interest accumulated on a loan doesn&amp;#39;t exist. So the only way the interest can be paid back is by taking on even more debt, which just kicks the can down the road. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s quite literally a scheme. Banks are parasites. They want more money than there even is money. &lt;/p&gt;\n\n&lt;p&gt;I believe Bitcoin/crypto can be the quickest path for the general public to take and ditch this system. &lt;/p&gt;\n\n&lt;p&gt;Now, I&amp;#39;m not going to pretend that Bitcoin will solve everything. But it does solve a lot and now I finally understand why it is better than fiat. &lt;/p&gt;\n\n&lt;p&gt;For the first time ever in a very long time, we have a currency that is not in control of any authority. A currency that can be sent between each other without a third party. A currency that does not require a private bank to issue. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s revolutionary. It has the power to change the game.&lt;/p&gt;\n\n&lt;p&gt;But time will tell whether or not the people catch on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 193,
  "permalink": "/r/Bitcoin/comments/rbznxd/i_think_i_finally_get_it_now/",
  "subreddit": "Bitcoin",
  "id": "rbznxd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The fiat currency banking system is doomed to fail because most all new money is\ncreated as debt; only backed by a banks promise to pay it back. In other words,\nbacked by nothing.\n\nBanks make money by lending. But banks don't actually lend money they have.\nInstead, they create it by writing it into…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "不換紙幣銀行システムは失敗する運命にある。なぜなら、すべての新しい貨幣は、そのほとんどが\n銀行が返済を約束することだけが裏付けとなる負債として作られる。言い換えれば\n何も裏付けがない。\n\n銀行は融資することでお金を稼ぎます。しかし、銀行は実際に持っているお金を貸すわけではありません。\nそのかわり、銀行がお金を作り出すのです。そのお金を書き込むことによって...",
      "title": "今になってようやくわかった気がします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "法定货币的银行系统注定要失败，因为大多数新的货币都是以债务的形式创造出来的。\n都是以债务的形式创造出来的；只有银行承诺偿还才会有支持。换句话说。\n没有任何支持。\n\n银行通过放贷赚钱。但银行实际上并没有借出他们拥有的钱。\n相反，他们通过把钱写进......来创造钱。",
      "title": "我想我现在终于明白了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "法定貨幣的銀行系統註定要失敗，因爲大多數新的貨幣都是以債務的形式創造出來的。\n都是以債務的形式創造出來的；只有銀行承諾償還纔會有支持。換句話說。\n沒有任何支持。\n\n銀行通過放貸賺錢。但銀行實際上並沒有借出他們擁有的錢。\n相反，他們通過把錢寫進......來創造錢。",
      "title": "我想我現在終於明白了。"
    }
  ]
}