{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Friday, May 21, 2021\n\nStocks traded mixed today, with the S&P 500 (SPY) and Nasdaq (QQQ) declining\nmodestly after yesterday’s rally. It’s encouraging to see the market holding on\nto yesterday’s gains following the volatility experienced in recent weeks. It\nseems overall market…",
  "original_created_utc": 1621630982,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月21日（金\n\n今日の株価はまちまちで、S&P500(SPY)とNasdaq(QQQ)は昨日の上昇から小幅に下落した。\nS&P500(SPY)とNasdaq(QQQ)は昨日の上昇の後、小幅に減少した。市場が昨日の上昇を維持しているのは心強いことです。\n最近の数週間で経験したボラティリティーの後、市場が昨日の利益を維持しているのは励みになります。それは\n市場全体では...",
      "title": "本日2021年5月21日（金）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾 - 2021年5月21日，星期五\n\n今天股市涨跌互现，标准普尔500指数（SPY）和纳斯达克指数（QQQ）在昨天的反弹后小幅下跌。\n在昨天的反弹之后小幅下跌。令人鼓舞的是，市场在波动之后保持了\n令人鼓舞的是，在最近几周的波动之后，市场保持了昨天的收益。总的来说\n似乎整体市场...",
      "title": "以下是今天（2021年5月21日，星期五）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧 - 2021年5月21日，星期五\n\n今天股市漲跌互現，標準普爾500指數（SPY）和納斯達克指數（QQQ）在昨天的反彈後小幅下跌。\n在昨天的反彈之後小幅下跌。令人鼓舞的是，市場在波動之後保持了\n令人鼓舞的是，在最近幾周的波動之後，市場保持了昨天的收益。總的來說\n似乎整體市場...",
      "title": "以下是今天（2021年5月21日，星期五）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Friday, May 21, 2021",
  "created_utc": 1621648619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Friday, May 21, 2021</strong></p>\n\n<p>Stocks traded mixed today, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) declining modestly after yesterday’s rally. It’s encouraging to see the market holding on to yesterday’s gains following the volatility experienced in recent weeks. It seems overall market sentiment is improving following a surge in inflationary fears after the release of the April Consumer Price Index. The SPY closed 0.08% down, the QQQ closed 0.56% down, and the Dow Jones (DIA) closed 0.36% up.</p>\n\n<p>Markets have recently been shaken by the prospect that a rise in inflation may prompt the Federal Reserve to tighten monetary policy sooner than expected. However, as has been reiterated in the recap before, there are several reasons why a change in monetary policy seems very unlikely. In the Federal Reserve’s April meeting minutes, “participants generally noted that the economy remained far from the Committee’s maximum-employment and price-stability goals”.  Jerome Powell and other monetary officials have reiterated several times that they want to see a “string” of strong labor reports before major adjustments to policy are considered. The April Job Reports showed only 266,000 jobs added back to the economy, widely missing analyst expectations and marking a sharp deceleration in job growth from March, bolsters that argument.</p>\n\n<p>As the US economy reopens, we are seeing a surge in consumer spending (we saw a 10.8% increase in spending in March), supply is having a hard time catching up to rising demand, which of course, causes a rise in prices. As the economic reopening continues and supply in various consumer industries is able to catch up, inflation is expected to slow down. In a nutshell, this is why Jerome Powell and other monetary officials consistently refer to current inflationary pressures “transitory”.</p>\n\n<p>On a slightly sour note, the meeting minutes also noted “a number of participants suggested” that as the economy continues to quickly, “it might be appropriate at some point in upcoming meetings to begin discussing a plan for adjusting the pace of asset purchase”, which have currently been going at a rate of $120 billion per month. However, this is not a surprising statement and one Powell himself has said before. Back in an April 14 meeting, Powell said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.” As a reminder, quantitative easing is a process in which the Fed buys government bonds in order to inject money into the economy. It is only natural that as the economy recovers, less money needs to be injected into the economy in this manner. The Federal Reserve gave absolutely no signal it was even considering beginning discussion on raising interest rates, which is what market participants are really concerned about. <a href=\"https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20210428.pdf\">Read the entire meeting minutes here</a></p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Shares of Nvidia (NVDA), one of the leading semiconductor companies, jumped after the company announced a 4-1 split. This means that after the split goes through, every share of  NVDA will become 4 and the price will adjust accordingly.</li>\n<li>In the midst of surging prices, the housing market has begun showing signs of slowing down. Today, the National Association of Realtors showed that existing home sales fell 2.7% in April compared to the month prior. That is well below the expectation of 1% growth and may be a sign the rise in prices may be slowing in the near-term. However, compared to April 2020, existing home sales are up 33.9%.</li>\n<li>Snap (SNAP) said it will acquire WaveOptics, a British Augmented Reality company, for over $500 million. The company has recently been making a big push into the world of wearable AR technology.</li>\n<li>China&#39;s internet watchdog said on Friday that companies including ByteDance, Baidu, and Microsoft (MSFT) improperly collected user data in the country.</li>\n<li>Yesterday, the US Department of Treasury announced it was taking steps to crackdown on digital assets by requiring any transfer worth $10,000 or more to be reported to the Internal Revenue Service (IRS)</li>\n<li>China’s Financial Stability and Development Commission, which is chaired by Vice Premier Liu He, released a statement today saying it is necessary to “crack down on digital asset mining and trading behavior and resolutely prevent the transmission of individual risks to the social field.”</li>\n</ul>\n\n<p>“All our dreams can come true, if we have the courage to pursue them.” - Walt Disney</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/stocks/comments/ni2ty8/here_is_a_market_recap_for_today_friday_may_21/",
  "subreddit": "stocks",
  "id": "ni2ty8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389722
}