{
  "author": "GrandmasterKane",
  "the_new_excerpt": "Full disclosure: I have a small position in $ASTS and warrant $ASTSW.\nDisclaimer: I'm not a financial advisor. Do your own DD as always.\n\nI want to share some info on $ASTS (AST Spacemobile) to save potential retail\ninvestors time when they do their DD. There is this idea of \"20-100x Return Or\n100%…",
  "original_created_utc": 1618600726,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Full disclosure: 私は$ASTSとワラント$ASTSWの小さなポジションを持っています。\n免責事項：私はファイナンシャル・アドバイザーではありません。いつものように自分で判断してください。\n\n私は、潜在的な個人投資家がDDを行う際に時間を節約するために、$ASTS（AST Spacemobile）に関するいくつかの情報を共有したいと思います。\nの情報をお伝えしたいと思います。20-100倍のリターンや\n100%...",
      "title": "AST Spacemobile ($ASTS)、Lynk、Appleの3社は、400億ドル規模の携帯電話から衛星への移行市場で競争することになる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "充分披露：我有一个小仓位在$ASTS和权证$ASTSW。\n声明：我不是财务顾问。做你自己的DD一如既往。\n\n我想分享一些关于$ASTS（AST Spacemobile）的信息，以挽救潜在的散户。\n投资者在做DD的时候，时间。有这样一个理念 \"20-100倍回报或\n100%…",
      "title": "AST Spacemobile ($ASTS)、Lynk和苹果都将争夺利润丰厚的400亿美元移动到卫星市场。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "充分披露：我有一個小倉位在$ASTS和權證$ASTSW。\n聲明：我不是財務顧問。做你自己的DD一如既往。\n\n我想分享一些關於$ASTS（AST Spacemobile）的信息，以挽救潛在的散戶。\n投資者在做DD的時候，時間。有這樣一個理念 \"20-100倍回報或\n100%…",
      "title": "AST Spacemobile ($ASTS)、Lynk和蘋果都將爭奪利潤豐厚的400億美元移動到衛星市場。"
    }
  ],
  "title": "AST Spacemobile ($ASTS), Lynk, and Apple all will be competing for the lucrative $40B mobile to satellite market",
  "created_utc": 1618606417,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Full disclosure: I have a small position in $ASTS and warrant $ASTSW. Disclaimer: I&#39;m not a financial advisor. Do your own DD as always.</p>\n\n<p>I want to share some info on $ASTS (AST Spacemobile) to save potential retail investors time when they do their DD. There is this idea of &quot;20-100x Return Or 100% Loss&quot; associated with $ASTS floating around, but AST Spacemobile is no $NKLA. The technology was proven to work by AST and again by Lynk. Apple is diving in this as well. AST Spacemobile the real deal with over 1000 patents, extensive satellite expertise particularly their CEO, and their own majority owned satellite subsidiarity Nanoavionics and is already cash flow positive. AST Spacemobile itself has no debt.</p>\n\n<p>The good stuff: the data that got these giant institutional investors Vadafone, Rakuten, American Tower, Samsung NEXT, AT&amp;T, Cisneros all lined up to give money to AST Spacemobile started with the tiny 12kg Bluewalker 1 satellite that successfully proved that AST tech worked:</p>\n\n<p>&quot;<em>On April 1, 2019, AST successfully launched  BW1, which connected directly to an antenna (“BW2”) at AST’s facility in Midland, Texas, to test its satellite to ground communications  technology. During such testing, AST was able to validate its cellular  architecture and was capable of managing communications delays from LEO  orbit and the effects of doppler in a satellite to ground cellular environment using the 4G-LTE protocol.</em>&quot;</p>\n\n<p>The 1.5 ton, 10-meter antenna Bluewalker 3 satellite currently in progress of being built and is slated to launch at the end of 2021 is much more capable and will fully enable AST to demonstrate their tech:</p>\n\n<p>&quot;<em>The BW3 test satellite is expected to enable live ground, sea, and  airborne testing with unmodified LTE and 5G devices such as smartphones, tablets and internet of things (“IoT”) equipment. The satellite is also  expected to enable live testing for voice, video and data. Testing will  be available for approximately six minutes per satellite pass  approximately two times per day in certain areas. For U.S. based  testing, AST will utilize a gateway installed in Midland, Texas and in  Hawaii. AST will install at least two additional gateways for the full constellation, one on the east coast and a second on the west coast. With the BW3 test satellite, AST’s main objective is to demonstrate the entire technology stack of the AST constellation satellite design by  providing direct broadband communications between an AST- patented LEO  satellite and standard compliant LTE and 5G devices without any  modification using UE standard in select bands in the 698 MHz to 960 MHz range and using gateways located in a number of selected countries, including the U.S. The BW3 test satellite will provide the testing and validation plans for the BB1 satellite design, expected to be used for  the first phase of commercial satellites comprising the SpaceMobile  Service.</em>&quot;</p>\n\n<p>Lynk, a competing company, also <a href=\"https://vimeo.com/398041128/e10228da19\">demonstrated</a> the technology worked when they successfully connected a tiny satellite to a normal handset and witnessed by independent third-party observers:</p>\n\n<p><a href=\"https://www.businesswire.com/news/home/20200318005113/en/Lynk-First-to-Connect-Satellite-Directly-to-Standard-Mobile-Phones-on-Earth\">Article</a></p>\n\n<p>&#x200B;</p>\n\n<p>Additionally, <strong>Apple</strong> is <a href=\"https://www.channelnews.com.au/telstra-set-to-become-surplus-to-requirement-if-apple-satellite-iphones-take-off/\">reportedly</a> not holding back on putting a lot of resources to dive into this potentially massively lucrative market:</p>\n\n<p>&quot;<em>Currently Apple is spending billions, developing a new satellite service  that will beam internet services directly to devices, bypassing carrier  networks</em>&quot; </p>\n\n<p>Apple has <a href=\"https://www.gurufocus.com/news/1160408/apple-fi-5g-killer-technology-profits-confidential-by-ray-blanco--anti5g-stock-research-report\">already started the process</a> of doing the very thing that AST Spacemobile is set up to do, calling it Apple-Fi:</p>\n\n<p>&quot;<strong><em>To roll out its revolutionary technology, Apple has reportedly hired  Michael Trela and John Fenwick, two world-famous aerospace engineers who  are widely considered to be pioneers in the field of satellite  technology. Not only that, Apple also recently brought onboard Matt Ettus, Ashley Moore Williams, and Daniel Ellis, experts renowned for  their work with wireless technologies. Not only that, but it is also  being alleged that Apple is currently in the process of creating a  satellite mesh network to provide its customers with insane network  coverage. In this regard, the company has already filed plans with the  FCC to launch between 1,400 and 3,000 satellites.</em></strong>&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>In order to connect from Earth to space LEO and back, you either need a big dish/antenna on Earth to connect to a small satellite or increase the size of the satellite to connect to a small, normal cellphone. A fairly long technical paper submitted to the FCC <a href=\"https://fcc.report/IBFS/SAT-PDR-20200413-00034/2511994\">here</a> describes how AST Spacemobile will use its constellation of satellites to act as a 900 meters squared satellite. This is proven tech and has been done many times.</p>\n\n<p>The document found <a href=\"https://ecfsapi.fcc.gov/file/10061972201614/AST%205G%20Fund%20Ex%20Parte%2010-06-20%20(00168439xC33F1\">here</a>.pdf) submitted to the FCC describing how they brilliantly deal with doppler issue:</p>\n\n<p>Some interesting technical points were described in the document:</p>\n\n<p>&quot;<em>-The AST low earth orbiting (“LEO”) satellites system (“SpaceMobile”)  is able to communicate directly with standard unmodified off-the shelf  cellular devices from their 700 kilometer high orbits through the use of  AST’s patented architecture of large LEO satellites with  specially-designed proprietary antenna arrays with very large aperture.  The configuration results in enough antenna gain to enable the satellite  to communicate effectively with standard mobile handsets operating on  terrestrial broadband wireless frequencies.</em></p>\n\n<p><em>- The  AST SpaceMobile system will connect to user terminals that operate on  standard 3GPP  frequencies that are licensed to terrestrial carriers  with which AST has agreements that grant AST consent to use the  spectrum.  The service will fill the terrestrial carriers’ gaps in  coverage to provide broadband mobile services where the terrestrial  carrier spectrum is not available or in use. This mitigates and  eliminates the risk of interference.</em></p>\n\n<p><em>-  Potential interference also will be managed by the use of other  methods, including frequency selection, Inter-Cell Interference  Coordination (ICIC), beams control, and power control. These techniques  are discussed at length in the Technical Sharing Analysis submitted to  the Commission by AST on July 6, 2020;amendment to IBFS File No.  SAT-PDR-20200413-00034 (Call Sign S3065).</em></p>\n\n<p><em>- Each  satellite is capable of supporting approximately 2800 spot beams. The  satellite can generate cellular cells ranging from 12.5 kilometers  (C-band and CBRS) to 24-48kilometers (Lowband and midband). The  above-referenced Technical Sharing Analysis contains an overview of the  SpaceMobile approaches for frequency sharing and interference management  using parameters in this range.</em></p>\n\n<p><em>- The SpaceMobile  service will meet a low(sub-100 ms) latency(with latency well below 40  ms). AST holds,and/or has pending, approximately 650 patent claims,many  of which pertain to advanced technology that will be implemented on the  ground to address Doppler and delay.</em></p>\n\n<p><em>- The SpaceMobile service will meet and exceed the download and upload speed requirements of 35 Mbps / 3 Mbps.</em></p>\n\n<p><em>-  AST’s patented technology incorporates beam handover,which is analogous  to the terrestrial user equipment (UE) handoff between neighboring base stations (eNodeB’s).  Based on the schedule files that list the handoff  time instances, the setting satellite simultaneously turns off,and the  rising satellite turns on a beam in the overlapping cell.AST’s patented  technologies for compensation of delay/Doppler makes the UEs in the cell  being handed off see near equal delay/Doppler before and after the handoff, making them synchronize quickly to new beams from rising formation. The UE keeps track of the received signal strength (RSSI) of  both the serving and adjacent beams. When the serving beam’s RSSI is  weaker than the adjacent beam’s RSSI, it requests serving eNodeB to initiate handoff. The decision to hand off or not is made by the serving eNodeB.</em>&quot;</p>\n\n<p>Here, AST claimed that their proprietary  antenna arrays with very large aperture allow them to have enough gain to communicate with mobile handsets. They also claim to have download/upload speed of at least 35 Mbps/3 Mbps and a latency well below 40ms. These numbers are highly conservative just to show that AST at minimum should qualify for a huge 5G grant. Starlink is on the same LEO as AST will be and Starlink is able to do latency in the 20&#39;s ms, which is inline with current terrestrial broadband/5G.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Patent</strong> found <a href=\"https://pdfpiw.uspto.gov/.piw?PageNum=0&amp;docid=10979133&amp;IDKey=06F3538FA7C8%0D%0A&amp;HomeUrl=http%3A%2F%2Fpatft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect1%3DPTO2%2526Sect2%3DHITOFF%2526p%3D1%2526u%3D%25252Fnetahtml%25252FPTO%25252Fsearch-bool.html%2526r%3D1%2526f%3DG%2526l%3D50%2526co1%3DAND%2526d%3DPTXT%2526s1%3DAvellan%2526s2%3DAbel%2526OS%3DAvellan%252BAND%252BAbel%2526RS%3DAvellan%252BAND%252BAbel\">here</a> and the website <a href=\"https://www.wired.com/story/your-phone-may-soon-receive-4g-service-from-space/\">here</a> described some the details of AST proprietary antenna  arrays:</p>\n\n<p>&quot;<em>AST is building a new, unproven type of satellite constellation that’s a  riff on so-called “fractionated satellites,” which divide the  capability of one large satellite among several smaller ones. For  example, one satellite might host a scientific payload, while another  might be responsible for communicating with ground stations. The two  would communicate with one another through wireless links. A  fractionated satellite system has never flown in orbit, although Darpa  spent six years and more than $200 million dollars developing a  fractionated satellite before abandoning the concept in 2013 due to  budgetary constraints.</em></p>\n\n<p><em>AST’s system will consist  of dozens of small, pizza box-sized satellites flying in formation as  they receive cell signals. According to AST’s founder and CEO Abel  Avellan, the system isn’t truly fractionated because each of the small  satellites will have the same capabilities, rather than splitting the  functionality of one larger satellite. But the formation will be managed  by a large control satellite, which will direct network traffic and  satellite movement like a conductor leading an orchestra. Although the  later versions of the satellites in AST’s system will communicate with  one another over Wi-Fi or a similar wireless protocol, Avellan says the  first satellites to go up will be physically connected.</em></p>\n\n<p><em>The  advantage of AST’s approach is that the satellites can be spread out  over hundreds of feet. Since each satellite is itself a receiver and is  working in tandem with the others, this has the effect of creating a  massive antenna. “In essence we are building a very, very large  satellite with a lot of power that can connect directly to a handset,”  says Avellan. “Our system is a replica of the terrestrial network in  space.”</em>&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>The CEO himself is an engineer and communication/satellite genius. He&#39;s not a salesman and definitely isn&#39;t the type that can get all of those giant institutions to invest in $ASTS through words instead of concrete data. There are more patents and technical stuff dealing with waveform and others but I found them to be uninteresting to traders and not worth listing them all.</p>\n\n<p>To conclude, anyone that claims this stock goes to zero is ignorant to the technical data at hand and completely dismisses the incredible work AST Spacemobile research team has done. I have a strong belief that any analyst from the <a href=\"https://twitter.com/spacanpanman/status/1373825830938378241\">numerous banks</a> Morgan Stanley, JP Morgan, Barclays, Deutsche Bank, Raymond James, Scotia, LightShed and Benchmark that attended AST Spacemobile analyst day will have favorable price target and analysis.</p>\n</div><!-- SC_ON -->",
  "score": 205,
  "permalink": "/r/investing/comments/msadak/ast_spacemobile_asts_lynk_and_apple_all_will_be/",
  "subreddit": "investing",
  "id": "msadak",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524767
}