{
  "author": "PsychologicalData978",
  "original_created_utc": 1659782319,
  "title": "Is little to no communication with your dad considered normal?",
  "created_utc": 1659816680,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I live with my parents since I am not old enough to move out. But me and my dad don&amp;#39;t speak a single word to each other for months if I don&amp;#39;t initiate a conversation. The longest we haven&amp;#39;t spoken to each other without me initiating and without there being any sort of conflict is 3 months. And this is when we live in the same freaking house! I confronted him about this last week and he said he has nothing to say and despite several attempts by me, he just deadpanned most of them. Am I being too sensitive? Is it normal for dads to be this distant? He has never been physically or verbally abusive and is generally alone and quiet. Since we don&amp;#39;t talk much and I am not a trouble maker, a pretty boring teenager we&amp;#39;ve never had a big argument over anything. I just sometimes feel a little abandoned when I see other kids&amp;#39; fathers spending time with them and listening to their stories. I never had that with my dad. I am afraid that I don&amp;#39;t have enough memories of him to miss him in the future when I leave home.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;EDIT: It&amp;#39;s so heartbreaking to see that so many of us have the same or even worse experience than me. Thank you so much for your kind words and advice! :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/whlbx4/is_little_to_no_communication_with_your_dad/",
  "subreddit": "TooAfraidToAsk",
  "id": "whlbx4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I live with my parents since I am not old enough to move out. But me and my dad\ndon't speak a single word to each other for months if I don't initiate a\nconversation. The longest we haven't spoken to each other without me initiating\nand without there being any sort of conflict is 3 months. And this…"
}