{
  "author": "TWA-LDR",
  "original_created_utc": 1656821845,
  "title": "My boss is hitting on me and I like it?",
  "created_utc": 1656838928,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;He’s explicitly told me I’m hot and that there is a possibility for something more if I wanted it. His attraction is causing infatuation on my part - I like the attention, he’s fun to be around, and he’s also quite attractive. He’s married with two kids and another on the way. I know I shouldn’t want to flirt with him but I just enjoy it &lt;/p&gt;\n\n&lt;p&gt;1) how do I put a stop to this without ruining my career\n2) has anyone ever had an affair with a non-ideal partner and how has it gone?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/vq95p4/my_boss_is_hitting_on_me_and_i_like_it/",
  "subreddit": "TooAfraidToAsk",
  "id": "vq95p4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "He’s explicitly told me I’m hot and that there is a possibility for something\nmore if I wanted it. His attraction is causing infatuation on my part - I like\nthe attention, he’s fun to be around, and he’s also quite attractive. He’s\nmarried with two kids and another on the way. I know I shouldn’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のことをイケメンだと言ってくれたり、何かの可能性があるとはっきり言ってくれたり。\n可能性があると言ってくれました。彼の魅力に惹かれ、私も夢中になっています。\n注目されるのが好きで、一緒にいると楽しいし、彼もかなり魅力的です。彼は\n彼は結婚していて、2人の子供がいて、もう一人生まれる予定です。私はいけないと知っている...",
      "title": "上司に口説かれてるんだけど、好きなの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他明确地告诉我，我很性感，而且有可能发生一些事情。\n如果我想要的话。他的吸引力导致了我的迷恋--我喜欢\n我喜欢这种关注，他很有趣，而且他也很有吸引力。他是\n他已经结婚，有两个孩子，另一个也快了。我知道我不应该...",
      "title": "我的老板在勾引我，我喜欢这样吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他明確地告訴我，我很性感，而且有可能發生一些事情。\n如果我想要的話。他的吸引力導致了我的迷戀--我喜歡\n我喜歡這種關注，他很有趣，而且他也很有吸引力。他是\n他已經結婚，有兩個孩子，另一個也快了。我知道我不應該...",
      "title": "我的老闆在勾引我，我喜歡這樣嗎？"
    }
  ]
}