{
  "author": "compsc1",
  "original_created_utc": 1633200756,
  "title": "About 6 months ago hundreds of millions of genetically modified mosquitos were released in the Florida Keys. Is there any update on how that's going?",
  "created_utc": 1633206250,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s an ongoing experiment in Florida involving mosquitos that are engineered to breed only male mosquitos, with the goal of eventually leaving no female mosquitos to reproduce.</p>\n\n<p>In an effort to extinguish a local mosquito population, up to a billion of these mosquitos will be released in the Florida Keys over a period of a few years. How&#39;s that going?</p>\n</div><!-- SC_ON -->",
  "score": 437,
  "permalink": "/r/askscience/comments/q011ji/about_6_months_ago_hundreds_of_millions_of/",
  "subreddit": "askscience",
  "id": "q011ji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There's an ongoing experiment in Florida involving mosquitos that are engineered\nto breed only male mosquitos, with the goal of eventually leaving no female\nmosquitos to reproduce.\n\nIn an effort to extinguish a local mosquito population, up to a billion of these\nmosquitos will be released in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フロリダで行われている実験では、オスの蚊だけが繁殖するように設計された蚊が登場します。\n最終的にはメスの蚊がいなくなることを目標に、オスの蚊だけを繁殖させる実験がフロリダで行われています。\n最終的にはメスの蚊がいなくなることを目指しています。\n\n地元の蚊の数をなくすために、最大で10億匹の蚊が放たれます。\n蚊を放ちます。",
      "title": "半年ほど前、フロリダキーズに遺伝子組み換えの蚊が何億匹も放たれました。その状況についての最新情報はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "佛罗里达州有一个正在进行的实验，涉及的蚊子是经过设计的\n只繁殖雄性蚊子，目的是最终不留下雌性蚊子。\n目标是最终没有雌性蚊子可以繁殖。\n\n为了消灭当地的蚊子数量，多达10亿只这样的蚊子将被释放。\n蚊子的数量将被释放。",
      "title": "大约6个月前，数以亿计的转基因蚊子被释放到佛罗里达群岛。有什么最新进展吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "佛羅里達州有一個正在進行的實驗，涉及的蚊子是經過設計的\n只繁殖雄性蚊子，目的是最終不留下雌性蚊子。\n目標是最終沒有雌性蚊子可以繁殖。\n\n爲了消滅當地的蚊子數量，多達10億隻這樣的蚊子將被釋放。\n蚊子的數量將被釋放。",
      "title": "大約6個月前，數以億計的轉基因蚊子被釋放到佛羅里達羣島。有什麼最新進展嗎？"
    }
  ]
}