{
  "author": "naturalfractal",
  "the_new_excerpt": "2nd September 2020 - 24th September 2020: the S&P 500 dropped 9.33%\n\n23rd October 2020 - 30th October 2020: It dropped 5.64%\n\n16th November, it rallied 11% from the 30th October\n\nIf you'd invested on 2nd September, it would've taken you till November 13th to\ngo green again.\n\nNow that's just the…",
  "original_created_utc": 1614887482,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2020年9月2日-2020年9月24日：标普500指数下跌9.33%。\n\n2020年10月23日-2020年10月30日。跌幅5.64%\n\n11月16日，它比10月30日反弹了11%。\n\n如果你在9月2日就投资，那你要到11月13日才会有\n再次变绿。\n\n现在，这只是...",
      "title": "呼吸--这就是股市。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2020年9月2日-2020年9月24日：標普500指數下跌9.33%。\n\n2020年10月23日-2020年10月30日。跌幅5.64%\n\n11月16日，它比10月30日反彈了11%。\n\n如果你在9月2日就投資，那你要到11月13日纔會有\n再次變綠。\n\n現在，這只是...",
      "title": "呼吸--這就是股市。"
    }
  ],
  "title": "Breathe - This is the stock market.",
  "created_utc": 1614893704,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>2nd September 2020 - 24th September 2020: the S&amp;P 500 dropped 9.33%</strong></p>\n\n<p><strong>23rd October 2020 - 30th October 2020: It dropped 5.64%</strong></p>\n\n<p><strong>16th November, it rallied 11% from the 30th October</strong></p>\n\n<p><strong>If you&#39;d invested on 2nd September, it would&#39;ve taken you till November 13th to go green again.</strong></p>\n\n<p>Now that&#39;s just the S&amp;P500, I can&#39;t say for EV and Tech stocks on their own but the point still stands. Think why you&#39;ve invested in the stocks you&#39;ve chosen. Have you just gone off random advice on reddit without doing DD, or do you see a bright future for your companies?</p>\n\n<p>Yes, <strong>the market is overvalued,</strong> yes there&#39;s warning signs of a crash, people panicking, media stirring it up, but the reality is no one knows what&#39;s going to happen next. <strong>All you can do is judge your situation based on your own circumstances.</strong></p>\n\n<p>If you&#39;ve lost a lot of money recently in your portfolio <strong>you have two options, realise your losses and accept it and learn from it, or wait a few months or years and hope that your portfolio recovers</strong>. The option you choose depends on when you need your money, and how risky your stocks are and how much you can afford to lose. People love to see the upside of things but rarely factor in the downside. <strong>This is your downside, you need to judge how much more of it you can take.</strong></p>\n\n<p>If you&#39;ve found it incredibly stressful watching your portfolio be in the red, maybe you need to <strong>reevaluate whether investing is for you or the kind of investing you&#39;re doing or educate yourself on how to invest better,</strong> there&#39;s lots of free resources out there to learn about analyzing stocks, what metrics to look at, etc.</p>\n\n<p><strong>If you&#39;re a beginner investor, keep it simple</strong>, don&#39;t just jump on the bandwagon or make trades you don&#39;t fully understand. You need some sort of system to follow to take your emotions out of the equation as much as possible.</p>\n\n<p>It&#39;s easier said than done but I&#39;d urge everyone to <strong>be careful, leveraged trading, shorting and not diversifying are all surefire ways to land yourself in trouble.</strong></p>\n\n<p>Do I think the stock market is about to crash or begin a long term bear market? No I don&#39;t but no one can be 100% certain. If there is a crash, it&#39;s likely that things will rally soon after. If you&#39;re scared to lose more than you can afford, then maybe cut some of your losses but if you can afford to wait and you believe in the stocks you&#39;ve chosen then sit tight and it will all be alright.</p>\n\n<p><strong>TL;DR - be sensible with your investments, do your own research and don&#39;t assume the worst right now. As long as you&#39;re diversified sufficiently and are using money you don&#39;t need soon then you&#39;ll be OK in the long term.</strong></p>\n</div><!-- SC_ON -->",
  "score": 674,
  "permalink": "/r/stocks/comments/lxthw9/breathe_this_is_the_stock_market/",
  "subreddit": "stocks",
  "id": "lxthw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575858
}