{
  "author": "BigLongFootDoctor",
  "original_created_utc": 1635034094,
  "title": "Don't make the same mistake as our parents. Teach your kids about investing!",
  "created_utc": 1635057049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The most common regret I&#39;ve seen in investing is wishing to have had the knowledge to begin investing earlier. The difference between starting investing at 18 and 30 can be millions of dollars.</p>\n\n<p>Unfortunately this information isn&#39;t so readily taught in schools, and if your parents were like mine they didn&#39;t teach you about investing, it&#39;s something you had to learn on your own. Let&#39;s not make the same crucial mistake!</p>\n\n<p>Gamify the experience, make chores so your kids can earn and pay them in crypto and stocks. Let them see their hard efforts paying off as it grows over time. You will develop harder working budget conscious, investment minded kids and set them up with habits of success that last a lifetime.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qegthu/dont_make_the_same_mistake_as_our_parents_teach/",
  "subreddit": "CryptoCurrency",
  "id": "qegthu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The most common regret I've seen in investing is wishing to have had the\nknowledge to begin investing earlier. The difference between starting investing\nat 18 and 30 can be millions of dollars.\n\nUnfortunately this information isn't so readily taught in schools, and if your\nparents were like mine…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が投資をしていて一番後悔しているのは、「あの時、知識を持っていれば」ということです。\nもっと早く投資を始めていればよかった」というものです。18歳で投資を始めるのと30歳で始めるのとでは\n18歳で投資を始めるのと30歳で投資を始めるのとでは、数百万ドルの違いがあります。\n\n残念ながら、この情報は学校ではあまり教えられていませんし、もしあなたの親が私と同じように\nあなたの親が私と同じだったら...。",
      "title": "親と同じ失敗をしないために。子供たちに投資について教えてあげてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在投资中看到的最常见的遗憾是希望能有更早的知识开始投资。\n具备更早开始投资的知识。18岁和30岁开始投资之间的区别\n18岁和30岁开始投资的区别可能是数百万美元。\n\n不幸的是，这些信息在学校里并不是那么容易教的，如果你的父母像我一样\n如果你的父母像我一样...",
      "title": "不要犯与我们父母相同的错误。教导你的孩子投资!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在投資中看到的最常見的遺憾是希望能有更早的知識開始投資。\n具備更早開始投資的知識。18歲和30歲開始投資之間的區別\n18歲和30歲開始投資的區別可能是數百萬美元。\n\n不幸的是，這些信息在學校裏並不是那麼容易教的，如果你的父母像我一樣\n如果你的父母像我一樣...",
      "title": "不要犯與我們父母相同的錯誤。教導你的孩子投資!"
    }
  ]
}