{
  "author": "DetroitMotorShow",
  "original_created_utc": 1628216194,
  "title": "White House comes out in support of Warner-Portman-Sinema crypto amendment, and against the Toomey-Wyden-Lummis plan. The former is disastrous for crypto and specifically against Proof of Stake",
  "created_utc": 1628227882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The White House has signalled that it will support the last minute amendment by Warner, Portman, Sinema over the plan proposed by Toomey Wyden Lummis</p>\n\n<p>The former plan is even more disastrous than the original text without amendment </p>\n\n<p>It heavily regulates crypto tech and stifles  innovation, industry, and jobs in the US. In fact it makes out an node reporting exception just for proof of work chains, excluding proof of stake. </p>\n\n<p>While the Wyden Lummis plan promotes innovation and technology and financial freedom and human rights. But the White House is over ruling this </p>\n\n<p>This is a complete joke. 70 and 80 year old Dinosaurs who have no idea about crypto are squashing the entire industry for laughs and gags while being sponsored by banks.</p>\n\n<p>Edit: The Warner Portman Amendment against Proof of Stake even harms Lightning Network, imposing harsh reporting requirements. BTC Maxis were lobbying hard against Proof of stake and begging their legislators to take steps against PoS chains. The new classification does exactly that but sticks a dagger into LN as well. A tale of trying to harm others coming back to stab you in the back.. within 24 Hours! BTC Maxis are really THIS dumb. They have zero vision to see past their limited point of views, and are actively taking steps to damage the entire space, oblivious to the fact that the flame they fan will land on their own homes</p>\n\n<p>White House and Congress fighting over Proof of Work vs Proof of Stake. While they are living example of Proof of Mistake</p>\n\n<p>Edit 2 : </p>\n\n<p>Many crypto law experts are claiming they did not see the 2nd Amendment coming in at all, and it seems to have shocked them. Its baffling who is behind this last minute distiction between proof of work vs proof of stake, and why such text is being inserted into an Infrastructure Bill. Easy to see imo...who wins from doing this..? Both <a href=\"https://www.opensecrets.org/members-of-congress/mark-warner/summary?cid=N00002097&amp;__cf_chl_captcha_tk__=pmd_d81b008ac0241993d385e318e9a9dc480742f027-1628221811-0-gqNtZGzNAzijcnBszQj6\">Warner</a> &amp; <a href=\"https://www.opensecrets.org/members-of-congress/rob-portman/summary?cid=N00003682&amp;cycle=2020&amp;type=I\">Portman</a> are, as expected, funded by big banks and investment institutions. Portman is funded by BlackRock, American Financial Group, other archaic institutions that derive great benefit from over regulating DeFi/Proof of stake networks. Warner is funded by Goldman Sachs. By making DeFi hard to access for end users, these institutions get to keep their close sources legacy financial system that oppresses its participants and funnels wealth to those at the top.</p>\n\n<p>Sen. Portman is even retiring next month. His absolute last act as a Senator is to attempt to kill innovation in finance, kill individual freedom , and instead enslave people to behemoth corporations. These are the dinosaurs that the country deserves? Why are these people who have zero stake in tomorrow writing laws that will harm millions of tomorrow&#39;s kids and prevent them from accessing an open and inclusive financial system?</p>\n</div><!-- SC_ON -->",
  "score": 289,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/IeKE1UYVkKuiTUM9jRWkDsNz8_t97wIwxY5Ux5iLVkY.jpg?auto=webp&s=e399d03976cdb9f5dcc572690f75c638c119436b",
          "width": 514,
          "height": 720
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/IeKE1UYVkKuiTUM9jRWkDsNz8_t97wIwxY5Ux5iLVkY.jpg?width=108&crop=smart&auto=webp&s=5bf47ead98ff6afc9079df550e3dac3d90fdc2ac",
            "width": 108,
            "height": 151
          },
          {
            "url": "https://external-preview.redd.it/IeKE1UYVkKuiTUM9jRWkDsNz8_t97wIwxY5Ux5iLVkY.jpg?width=216&crop=smart&auto=webp&s=fd16d5266eb9dfa2ce74e06e0f21a38008d47506",
            "width": 216,
            "height": 302
          },
          {
            "url": "https://external-preview.redd.it/IeKE1UYVkKuiTUM9jRWkDsNz8_t97wIwxY5Ux5iLVkY.jpg?width=320&crop=smart&auto=webp&s=6f0562b5931cfb0630267ac3e1dfbf57cabbdafb",
            "width": 320,
            "height": 448
          }
        ],
        "variants": {},
        "id": "H1ctqGn-V2iRjhGk9cU0mJYVZHlL8SeJmyrHawWOYE0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/oyxejb/white_house_comes_out_in_support_of/",
  "subreddit": "CryptoCurrency",
  "id": "oyxejb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The White House has signalled that it will support the last minute amendment by\nWarner, Portman, Sinema over the plan proposed by Toomey Wyden Lummis\n\nThe former plan is even more disastrous than the original text without amendment\n\nIt heavily regulates crypto tech and stifles innovation, industry,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ホワイトハウスは、ワーナー、ポートマン、シネマによる直前の修正案を支持する意向を示しています。\nワーナー、ポートマン、シネマによる直前の修正案を支持すると発表しました。\n\n前者の案は、修正なしの原文よりもさらに悲惨なものである\n\n暗号技術を大きく規制し、イノベーションや産業、...",
      "title": "ホワイトハウスは、ワーナー・ポートマン・シネマの暗号化修正案を支持し、トゥーミー・ワイデン・ラムミスの案には反対しました。前者は、暗号化にとって悲惨なものであり、特にProof of Stakeに対して不利である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "白宫已表示将支持最后一分钟的修正案。\n华纳、波特曼、西内玛提出的修正案，而不是托米-威登-卢米斯提出的计划。\n\n前者的计划比未经修正的原始文本更加灾难性\n\n它严重规范了加密技术，扼杀了创新、产业、...",
      "title": "白宫出面支持华纳-波特曼-西内玛加密修正案，反对托米-维登-卢米斯计划。前者对加密货币来说是灾难性的，特别是对权益证明来说。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "白宮已表示將支持最後一分鐘的修正案。\n華納、波特曼、西內瑪提出的修正案，而不是托米-威登-盧米斯提出的計劃。\n\n前者的計劃比未經修正的原始文本更加災難性\n\n它嚴重規範了加密技術，扼殺了創新、產業、...",
      "title": "白宮出面支持華納-波特曼-西內瑪加密修正案，反對托米-維登-盧米斯計劃。前者對加密貨幣來說是災難性的，特別是對權益證明來說。"
    }
  ]
}