{
  "author": "ThrowAway0183910",
  "the_new_excerpt": "I usually see people in this sub bashing newcomers because they ask stupid\nquestions and this usually leads to them being too scared to ask anything. So if\nyou are a beginner and you have a question that you fear is a stupid one, ask me\nin the comments and I will explain them to you without judging…",
  "original_created_utc": 1617353666,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我通常会在这个子里看到一些人在抨击新人，因为他们问了一些愚蠢的问题。\n问题，这通常会导致他们不敢问什么。所以如果\n你是一个初学者，你有一个问题，你怕是一个愚蠢的问题，问我。\n在评论中，我会向你解释，不做评判...",
      "title": "如果你是初学者，你有一个问题，你怕是一个愚蠢的问题，请在评论中问我。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我通常會在這個子裏看到一些人在抨擊新人，因爲他們問了一些愚蠢的問題。\n問題，這通常會導致他們不敢問什麼。所以如果\n你是一個初學者，你有一個問題，你怕是一個愚蠢的問題，問我。\n在評論中，我會向你解釋，不做評判...",
      "title": "如果你是初學者，你有一個問題，你怕是一個愚蠢的問題，請在評論中問我。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "このサブでは、新参者が愚かな質問をするとバッシングする人をよく見かけます。\nこのサブでは、新参者がくだらない質問をすることで、新参者をバッシングしています。なので、もし\nもしあなたが初心者で、くだらないと思う質問があるなら、コメントで私に聞いてください。\n批判せずに説明してあげます。",
      "title": "もしあなたが初心者で、愚かな質問だと恐れていることがあれば、コメントで聞いてください。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "このサブでは、新参者が愚かな質問をするとバッシングする人をよく見かけます。\nこのサブでは、新参者がくだらない質問をすることで、新参者をバッシングしています。なので、もし\nもしあなたが初心者で、くだらないと思う質問があるなら、コメントで私に聞いてください。\n批判せずに説明してあげます。",
      "title": "もしあなたが初心者で、愚かな質問だと恐れていることがあれば、コメントで聞いてください。"
    }
  ],
  "title": "If you’re a beginner and you have a question that you fear is a stupid one, ask me in the comments.",
  "created_utc": 1617366780,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I usually see people in this sub bashing newcomers because they ask stupid questions and this usually leads to them being too scared to ask anything. So if you are a beginner and you have a question that you fear is a stupid one, ask me in the comments and I will explain them to you without judging you.</p>\n\n<p>Also before asking, check the preexisting comments.</p>\n</div><!-- SC_ON -->",
  "score": 1173,
  "permalink": "/r/CryptoCurrency/comments/migcay/if_youre_a_beginner_and_you_have_a_question_that/",
  "subreddit": "CryptoCurrency",
  "id": "migcay",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961875616
}