{
  "author": "SuspiciousTurtle",
  "original_created_utc": 1635796111,
  "title": "Why did American founders direct all of their anger in the Declaration of Independence towards the king, when every decision they had a grievance with was made by the parliament?",
  "created_utc": 1635835839,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This might be me completely misreading history, but by the time of George III, the British Monarch had already largely been relegated to the symbolic role we think of today. So why did the American Founding Fathers direct all of their anger and grievance towards him, when it was parliament that was making all of the decisions on taxes and government actions in the American colonies?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qkm3ev/why_did_american_founders_direct_all_of_their/",
  "subreddit": "AskHistorians",
  "id": "qkm3ev",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This might be me completely misreading history, but by the time of George III,\nthe British Monarch had already largely been relegated to the symbolic role we\nthink of today. So why did the American Founding Fathers direct all of their\nanger and grievance towards him, when it was parliament that was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私が歴史を完全に読み違えているのかもしれませんが、ジョージ3世の時代には、英国の君主はすでに大部分を失っていました。\nイギリスの君主は、すでに今日のような象徴的な役割に追いやられていました。\nしかし、ジョージ3世の時代には、英国の君主はすでに今日のような象徴的な存在ではなくなりました。では、なぜアメリカの建国の父たちは、その怒りや不満の矛先を\n怒りや不満の矛先をジョージ3世に向けたのはなぜでしょうか、それは議会が...",
      "title": "アメリカの建国者たちは、不満のある決定はすべて議会で行われていたのに、なぜ独立宣言で怒りの矛先を国王に向けたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能是我完全误读了历史，但在乔治三世时期，英国君主已经在很大程度上沦为我们的象征角色。\n英国君主已经在很大程度上沦为我们今天认为的象征性角色。\n我们今天所认为的那样。那么，为什么美国的开国元勋们把他们所有的愤怒和不满都指向他呢？\n愤怒和怨恨指向他，而议会才是...",
      "title": "为什么美国的创始人在《独立宣言》中把所有的愤怒都指向了国王，而他们所不满的每一个决定都是由议会做出的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能是我完全誤讀了歷史，但在喬治三世時期，英國君主已經在很大程度上淪爲我們的象徵角色。\n英國君主已經在很大程度上淪爲我們今天認爲的象徵性角色。\n我們今天所認爲的那樣。那麼，爲什麼美國的開國元勳們把他們所有的憤怒和不滿都指向他呢？\n憤怒和怨恨指向他，而議會纔是...",
      "title": "爲什麼美國的創始人在《獨立宣言》中把所有的憤怒都指向了國王，而他們所不滿的每一個決定都是由議會做出的？"
    }
  ]
}