{
  "author": "rulesforrebels",
  "original_created_utc": 1643229027,
  "title": "I'm Shocked How Against Crypto Reddit as a Whole is Outside of Crypto Subs",
  "created_utc": 1643258581,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At times it feels like crypto is being pretty widely accepted by the general public, we see guys like Mark Cuban and Elon Musk adopting it for their companies, many mainstream companies like Charmin and Taco Bell are getting into the NFT game and at times it&amp;#39;s a mainstream media darling when it&amp;#39;s doing well.&lt;/p&gt;\n\n&lt;p&gt;I would expect Reddit to be equally if not more supportive of crypto than the general public or that I might expect to see from say in a comments section on Yahoo News, however when I see Bitcoin or Crypto mentioned in more mainstream Reddit subs like &lt;a href=\"/r/news\"&gt;r/news&lt;/a&gt; or others everyone seems to be talking shit about &amp;quot;crypto bros&amp;quot; or making references to Beanie Babies, its kind of crazy to me as Reddit tends to sku younger and be very tech friendly. Here&amp;#39;s some of the types of comments I&amp;#39;m talking about and these are like handpicked comments this sentiment seems to be the majority.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Looks like Cryptobros will have to go back to Amway.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Pyramid scheme&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Anyone who thinks the world&amp;#39;s governments and central banks are going to allow unregulated virtual currency to take over is dillusional.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&amp;quot;Let&amp;#39;s pretend a speculative asset masquerading as the most deflationary currency ever is the future of finance. This is a Very Good Idea and I&amp;#39;m actually an expert on economics, not a con artist trying to attract as many suckers as possible to pay me real money for my hoarded assets.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I’m not convinced it is here to stay. What is the utility of bitcoin? At least gold is used in electronics, jewelry etc…&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Digital Beanie Babies.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I put my entire net worth into beanie babies and He-Man action figures.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I mean NFTs are basically the crypto equivalent of beanie babies with the difference being that with beanie babies you actually have something that is worth a damn whereas NFTs are a fucking worthless scam.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Jesus fuck what is wrong with that dude?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;El Salvadors President Jesus fuck what is wrong with that dude?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This year, I invested in pumpkins. They&amp;#39;ve been going up the whole month of October and I got a feeling they&amp;#39;re going to peak right around January. Then, bang! That&amp;#39;s when I&amp;#39;ll cash in.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;I’m sticking with my tulip bulbs.I’m sticking with my tulip bulbs.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Obligatory Beanie Babies vs Bitcoin Investment Guide&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This happens to things whose only value is derived from what people are willing to pay for it. That bitcoin is worth anything is only because people think they will be able to sell it for more than they bought/manufactured it for. Maybe I&amp;#39;m wrong, but I don&amp;#39;t think bitcoin is substantially different than beanie babies. If people decide it&amp;#39;s no longer valued, it&amp;#39;s just virtual junk.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 459,
  "permalink": "/r/CryptoCurrency/comments/sdflpo/im_shocked_how_against_crypto_reddit_as_a_whole/",
  "subreddit": "CryptoCurrency",
  "id": "sdflpo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "At times it feels like crypto is being pretty widely accepted by the general\npublic, we see guys like Mark Cuban and Elon Musk adopting it for their\ncompanies, many mainstream companies like Charmin and Taco Bell are getting into\nthe NFT game and at times it's a mainstream media darling when it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号が一般に広く受け入れられているように感じられることがあります。\nマーク・キューバンやイーロン・マスクのような人が、自分の会社のために採用し\nまた、チャーミンやタコベルなどの主流企業も参入しています。\nNFTは、そのようなときに主要なメディアの寵児となることもあります。",
      "title": "Crypto Subs以外のRedditが全体としてCryptoに反対していることに衝撃を受けた。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有时，我们感觉加密货币正被大众广泛接受。\n我们看到像马克-库班和埃隆-马斯克这样的人在他们的公司中采用加密货币。\n许多主流公司，如Charmin和Taco Bell，都开始涉足加密货币。\n很多主流公司，如Charmin和Taco Bell都进入了NFT游戏，有时它是主流媒体的宠儿，当它是...",
      "title": "我很震惊，在加密货币子系统之外，整个Reddit是多么的反对加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有時，我們感覺加密貨幣正被大衆廣泛接受。\n我們看到像馬克-庫班和埃隆-馬斯克這樣的人在他們的公司中採用加密貨幣。\n許多主流公司，如Charmin和Taco Bell，都開始涉足加密貨幣。\n很多主流公司，如Charmin和Taco Bell都進入了NFT遊戲，有時它是主流媒體的寵兒，當它是...",
      "title": "我很震驚，在加密貨幣子系統之外，整個Reddit是多麼的反對加密貨幣。"
    }
  ]
}