{
  "author": "maxoptionstrading",
  "the_new_excerpt": "Good morning sun, good morning trees, good morning Apple...which is reportedly\nplanning a new ad-free podcasting subscription service.\n\nRight now, podcasts are an adman’s game: Spotify and other top companies in the\nspace, like Amazon and SiriusXM, spent the past few years “swallow[ing]…",
  "original_created_utc": 1611174048,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早晨的阳光，早晨的树木，早晨的苹果......据说，这是\n计划一个新的无广告播客订阅服务。\n\n眼下，播客是一个欣赏者的游戏。Spotify和其他顶级公司在\n空间，如亚马逊和SiriusXM，在过去的几年里 \"吞下......\"。",
      "title": "AAPL正在计划推出一项新的免广告播客订阅服务，以增加播客收入。这可能会迫使SPOT的手也跟上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早晨的陽光，早晨的樹木，早晨的蘋果......據說，這是\n計劃一個新的無廣告播客訂閱服務。\n\n眼下，播客是一個欣賞者的遊戲。Spotify和其他頂級公司在\n空間，如亞馬遜和SiriusXM，在過去的幾年裏 \"吞下......\"。",
      "title": "AAPL正在計劃推出一項新的免廣告播客訂閱服務，以增加播客收入。這可能會迫使SPOT的手也跟上。"
    }
  ],
  "title": "AAPL is planning a new ad-free podcasting subscription service to increase podcaster revenue. This could force SPOT’s hand to follow suit",
  "created_utc": 1611201959,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good morning sun, good morning trees, good morning Apple...which is reportedly planning a new ad-free podcasting subscription service. </p>\n\n<p>Right now, podcasts are an adman’s game: Spotify and other top companies in the space, like Amazon and SiriusXM, spent the past few years “swallow[ing] up podcasting production firms in an effort to gain more control of the podcast ad market,” per The Information. </p>\n\n<p>Think: Stitcher, The Ringer, etc. </p>\n\n<p>Come back later: It could be bad timing for Spotify, which recently saw shares decline after analysts at Citi downgraded its stock because Spotify hasn’t shown “‘any material benefit’…from its $800 million-plus investment in podcasting content and tech,” per Variety. </p>\n\n<p>And, in theory, a major subscription service has the potential to yield more money for creators than the ads keeping them afloat now. </p>\n\n<p>Why it matters: This isn&#39;t the first ad-free subscription podcasting service, but Apple&#39;s deep pockets give it a better shot at disruption than smaller upstarts (looking at you, Luminary).</p>\n\n<ul>\n<li><a href=\"https://link.morningbrew.com/click/22708929.47598/aHR0cHM6Ly93d3cubW9ybmluZ2JyZXcuY29tL21hcmtldGluZy9yLz9raWQ9NTMzZmMyOWU/5cbe3beb24c17c6c936b328eBcbf2aaeb\">Morning Brew</a></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 91,
  "permalink": "/r/stocks/comments/l1hl2u/aapl_is_planning_a_new_adfree_podcasting/",
  "subreddit": "stocks",
  "id": "l1hl2u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311219656
}