{
  "author": "crandalljft",
  "original_created_utc": 1649529379,
  "title": "Strike Announces Shopify Integration, Partnerships With NCR And Blackhawk Bringing Bitcoin Lighting Payments To Major Merchants",
  "created_utc": 1649559171,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Strike, a digital payments platform based on Bitcoin&amp;#39;s Lightning Network, has announced a partnership with Shopify, an e-commerce platform. &lt;/p&gt;\n\n&lt;p&gt;Strike CEO Jack Mallers announced at the Bitcoin 2022 conference in Miami that eligible U.S. Shopify merchants will now be able to accept bitcoin payments from customers around the world as U.S. dollars.&lt;/p&gt;\n\n&lt;p&gt;Mallers, a Forbes Under 30 alum, also mentioned that Strike, based in Chicago, has teamed with NCR NCR, the world&amp;#39;s largest point-of-sale (POS) supplier, and payments business Blackhawk.&lt;/p&gt;\n\n&lt;p&gt;By leveraging the Lightning Network, a second layer built on top of the bitcoin blockchain that allows users to send and receive cryptocurrency quickly and cheaply by moving transactions off of the main blockchain, the integration provides an alternative to traditional card networks such as Visa V and MasterCard. According to Mallers, the service would be available to anybody in the world who has a Lightning Network-enabled wallet, which includes more than 70 million CashApp users.&lt;/p&gt;\n\n&lt;p&gt;The announcement demonstrates the Lightning Network&amp;#39;s growing popularity. Robinhood announced intentions to integrate the solution into its technological stack earlier today, joining companies such as cryptocurrency exchange Kraken, Twitter, and Block. &lt;/p&gt;\n\n&lt;p&gt;Lightning Labs, a California-based developer of the Lightning Network, announced a new protocol on Tuesday that it hopes would allow the Lightning Network to accept assets other than bitcoin, such as other household names like Ethereum and the new ones like $Darc, stablecoins and fiat currencies.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/Bitcoin/comments/tzzcju/strike_announces_shopify_integration_partnerships/",
  "subreddit": "Bitcoin",
  "id": "tzzcju",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Strike, a digital payments platform based on Bitcoin's Lightning Network, has\nannounced a partnership with Shopify, an e-commerce platform.\n\nStrike CEO Jack Mallers announced at the Bitcoin 2022 conference in Miami that\neligible U.S. Shopify merchants will now be able to accept bitcoin payments…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインのライトニングネットワークを基盤としたデジタル決済プラットフォーム「Strike（ストライク）」が\nEコマースプラットフォームのShopifyと提携することを発表しました。\n\nストライクのCEOであるジャック・マラーズは、マイアミで開催されたBitcoin 2022カンファレンスで次のように発表しました。\n米国のShopifyの加盟店でビットコインによる決済が可能になります。",
      "title": "ストライク、Shopifyとの統合を発表 NCRおよびBlackhawkと提携し、大手販売店にビットコインライティング決済を導入"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Strike是一个基于比特币闪电网络的数字支付平台。\n宣布与电子商务平台Shopify建立伙伴关系。\n\nStrike首席执行官Jack Mallers在迈阿密举行的比特币2022会议上宣布\n符合条件的美国Shopify商家现在将能够接受比特币支付...",
      "title": "Strike宣布与Shopify整合，与NCR和Blackhawk建立伙伴关系，为主要商家带来比特币照明支付服务"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Strike是一個基於比特幣閃電網絡的數字支付平臺。\n宣佈與電子商務平臺Shopify建立夥伴關係。\n\nStrike首席執行官Jack Mallers在邁阿密舉行的比特幣2022會議上宣佈\n符合條件的美國Shopify商家現在將能夠接受比特幣支付...",
      "title": "Strike宣佈與Shopify整合，與NCR和Blackhawk建立夥伴關係，爲主要商家帶來比特幣照明支付服務"
    }
  ]
}