{
  "author": "momo-nana",
  "original_created_utc": 1630360514,
  "title": "I slept with someone a year ago, now I become friends with a girl and turns out that she's his wife, should I tell her?",
  "created_utc": 1630373409,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>NOTES: I didn&#39;t know he was already married!\nHe&#39;s a friend of a friend. Back then, we had sex after a party at our mutual friend&#39;s party. We both weren&#39;t stupidly drunk, just little bit tipsy. It was a build-up since we had been flirting since the party started. We were talking and ended up fucking inside a guest room.\n---fast foward one year---\nI met a woman randomly while buying coffee and we became friends not long after. She shared a story that she has a husband (married for 3 years) and they been trying to have a baby for the last 2 years. When they started to try to have a baby, her husband became so easily to get jealous and it&#39;s been stressing her out. Her phone lighted up when she got a message, I saw her lock screen picture and suddenly I had the urge to throw up. I tried to hold myself and asked her &quot;awww how cute both of you! is that him?&quot; and she said &quot;thank you! yes this is him&quot;. IT WAS THE GUY WHO I HAD SEX WITH AROUND LAST YEAR!\nI knew it right away it was him because of the same piercing on his nose, but I needed to make sure it was the same guy so I asked for his name. SAME NAME! Oh god....</p>\n\n<p>Hearing the fact that she&#39;s been stressing out that her husband gets jealous easily started 2 years ago and the fact that I had sex with him last year......it makes me angry and sad. Please give me some advices, should I tell her? We&#39;ve known each other like, one month! Am I invading their privacy by telling her my story? Should I just keep it?</p>\n</div><!-- SC_ON -->",
  "score": 216,
  "permalink": "/r/TooAfraidToAsk/comments/pes5co/i_slept_with_someone_a_year_ago_now_i_become/",
  "subreddit": "TooAfraidToAsk",
  "id": "pes5co",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "NOTES: I didn't know he was already married! He's a friend of a friend. Back\nthen, we had sex after a party at our mutual friend's party. We both weren't\nstupidly drunk, just little bit tipsy. It was a build-up since we had been\nflirting since the party started. We were talking and ended up fucking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NOTES: 彼がすでに結婚しているとは知りませんでした! 彼は友人の友人です。当時\n当時、私たちは共通の友人のパーティーの後にセックスをしました。二人ともバカみたいに酔っていたわけではなく\nほろ酔い程度でした。それは、私たちが以前からいちゃついていたからです。\nパーティーが始まった時からいちゃついていたので 私たちは話していて、最後にはファックしてしまった...。",
      "title": "1年前に誰かと寝たのですが、今、ある女の子と友達になって、その子が彼の奥さんだとわかったのですが、彼女に言うべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "笔记。我不知道他已经结婚了! 他是一个朋友的朋友。当年\n那时，我们在我们共同的朋友的聚会后发生了关系。我们都没有\n愚蠢地喝醉了，只是有点微醺。那是一种积累，因为我们从聚会开始就一直\n从聚会开始就一直在调情。我们聊着聊着，最后就上了......",
      "title": "我一年前和某人睡过，现在我和一个女孩成为朋友，结果发现她是他的妻子，我应该告诉她吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "筆記。我不知道他已經結婚了! 他是一個朋友的朋友。當年\n那時，我們在我們共同的朋友的聚會後發生了關係。我們都沒有\n愚蠢地喝醉了，只是有點微醺。那是一種積累，因爲我們從聚會開始就一直\n從聚會開始就一直在調情。我們聊着聊着，最後就上了......",
      "title": "我一年前和某人睡過，現在我和一個女孩成爲朋友，結果發現她是他的妻子，我應該告訴她嗎？"
    }
  ]
}