{
  "author": "Ornery_Maintenance_8",
  "original_created_utc": 1642005485,
  "title": "Understanding the upcoming inflation and why it wont be transitory !",
  "created_utc": 1642030781,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You have probably heard of the money printer going BRRRRRR during the pandemic and the currently high inflation resulting from that. You may have also heard that the US federal reserve Bank (FED) and probably also the European Zentral Bank (EZB) are going to raise interest rates in the coming years to put everything to normal.&lt;/p&gt;\n\n&lt;p&gt;This is what central bankers and high ranked politicians currently want you to belief, maybe some of them believe it themselves but it doesn&amp;#39;t change the fact that it is a straight lie ! We are about to witness an unprecedented inflation period affecting the entire western world.&lt;/p&gt;\n\n&lt;p&gt;To prevent the whole system from collapsing, these authorities are doing the only thing they can. It is necessary to stretch this period over several years keep the masses calm during the process of devaluation. This is why they assure you: it is only transitory / we are raising interest rates and this will fix it / ... and so on. Sadly this is complete BS.&lt;/p&gt;\n\n&lt;p&gt;Here is the real situation:&lt;/p&gt;\n\n&lt;p&gt;The FED and especially the EZB were buying government bonds with freshly printed money for years, to allow governments to spend money they don&amp;#39;t have without paying interest on it. The pandemic was only the big final topping of a long term development that started after the 2008 crash. The amount of bonds the central banks are sitting on is enormous. Since 2008, the FED three-folded the amount of Dollar in existence and the EZB even six-folded the amount of Euro in existence. This money has already been created. This is not something that could eventually happen in the future. It has already happened.&lt;/p&gt;\n\n&lt;p&gt;In classic economy theory, it was assumed that an increase in the amount of money will directly result into inflation. But how was it then possible that they printed and spend these gigantic amounts of fresh money without causing inflation until now ? The answer to that was given by the work of the economist John Maynard Keynes. The short version is that freshly minted money is not causing instant inflation. There has to happen some kind of trickle down effect from the freshly minted money into the system which can take years. The inflation will first appear once the new money trickled down into the circulation spheres of the average people.&lt;/p&gt;\n\n&lt;p&gt;But this is not a matter of if, its a matter of when. The now starting inflation is basically the beginning of this trickle down effect reaching the financial spheres of average people. But sadly it is only the first tip of a giant amount that is yet to come. No raise of interest rate will prevent this, it will only slow it down. Ultimately, the money is printed and its just a matter of time until it trickles down.&lt;/p&gt;\n\n&lt;p&gt;With that in mind, we can try to make a rough estimate of the overall inflation ahead of us. The FED three-folded the amount of Dollar in existence and the EZB even six-folded the amount of Euro in existence. Therefore, once everything which is already printed yet has trickled down, the Dollar value will decrease to a third and the Euro value will decrease to a sixth. Depending on the time frame they manage to stretch the process, some of the inflation will be eaten up by economic growth, if there is one. However, including housing, energy, transportation and so on and not only the basic food basket used by the government, we can probably still expect around a decade with a real average annual inflation north of 8% in the US and even more in the EU.&lt;/p&gt;\n\n&lt;p&gt;As already said, a raise of interest rates wont prevent this because the money is already there. It has just not trickled down yet. A raise in interest rates only slows the process down because the entities (mostly Banks) that are currently sitting on all that money are less eager to spend it when they get interest on it. But this is only stretching it. Having it stretched over a longer period of years just makes the whole thing more digestible.&lt;/p&gt;\n\n&lt;p&gt;There is only one way to actually prevent this whole thing from happening, but this wont or cant be done. The central banks would need to sell these giant stacks of bonds they obtained and take the money back out of circulation (burning it) before it can trickle down. The problem with this is that would crush the entire bond market. This would lead to the majority of the balance sheets of all Banks becoming worthless and countries having to pay real interest rates again when borrowing money which most of them cant afford anymore. Ultimately this would bankrupt the whole western banking industry and probably also a lot of entire countries in the western world. Whole industries, currencies and maybe even societies would collapse. Or in other words: 2008 would look like a small correction compared to this.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I have to further explain why this is not an option. The way this will be played is to stretch it over a long time period to distribute the impact over years and being able to keep the majority calm until it is done. You will see, after a few years it will be the new normality to have this kind of inflation and the majority plus the media wont even care anymore. The value of the giant amounts of generational debt our governments and societies have created over the last decades will melt away. It will be a consolidation but also the biggest transfer of wealth witnessed in the younger history.&lt;/p&gt;\n\n&lt;p&gt;With this knowledge, it is about you to position yourself correctly in the upcoming era of inflation. The majority of the bill will be paid by ordinary people having a few thousand bucks in their saving accounts and low wage earners which wont get a sufficient raise in salary to compensate. The rich and wealthy have the majority of their wealth in equity and other goods. Some even have debt in Dollar on the other side. This is how you profit the most from whats coming up. Just look at Microstrategy for example. Creating Dollar debt in exchange for a scarce asset (Bitcoin). Debt devalues and the asset increases in value.&lt;/p&gt;\n\n&lt;p&gt;I am not trying to advocate taking debt here but everybody should at least think about not keeping significant amounts of money in currency over the next decade. Saving accounts are completely off limits in my opinion. If you are thinking about buying a flat or a house, now is probably the perfect time. Other possibilities to position yourself to protect hard earned value of your money are Gold, Stocks or of course Crypto.&lt;/p&gt;\n\n&lt;p&gt;Thank you for reading this long text and I hope it was somehow interesting for you.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: The current Inflation is absolutely not transitory. It will last for years and probably become a new normality. You should position yourself to protect the hard earned value of your money.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/Bitcoin/comments/s2ajn3/understanding_the_upcoming_inflation_and_why_it/",
  "subreddit": "Bitcoin",
  "id": "s2ajn3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You have probably heard of the money printer going BRRRRRR during the pandemic\nand the currently high inflation resulting from that. You may have also heard\nthat the US federal reserve Bank (FED) and probably also the European Zentral\nBank (EZB) are going to raise interest rates in the coming years…"
}