{
  "author": "AskScienceModerator",
  "original_created_utc": 1639656049,
  "title": "AskScience AMA Series: We're experts working on the James Webb Space Telescope, the most powerful observatory ever built. It's ready to launch. Ask us anything!",
  "created_utc": 1639661422,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The James Webb Space Telescope (aka Webb) is the most complex, powerful and largest space telescope ever built, designed to fold up in its rocket before unfolding in space. After its scheduled Dec. 24, 2021, liftoff from Europe&amp;#39;s Spaceport in French Guiana (located in South America), Webb will embark on a 29-day journey to an orbit one million miles from Earth.&lt;/p&gt;\n\n&lt;p&gt;For two weeks, it will systematically deploy its sensitive instruments, heat shield, and iconic primary mirror. Hundreds of moving parts have to work perfectly - there are no second chances. Once the space telescope is ready for operations six months after launch, it will unfold the universe like we&amp;#39;ve never seen it before. With its infrared vision, JWST will be able to study the first stars, early galaxies, and even the atmospheres of planets outside of our own solar system. Thousands of people around the world have dedicated their careers to this endeavor, and some of us are here to answer your questions. We are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Dr. Jane Rigby, NASA astrophysicist and Webb Operations Project Scientist (JR)&lt;/li&gt;\n&lt;li&gt;Dr. Alexandra Lockwood, Space Telescope Science Institute project scientist and Webb communications lead (AL)&lt;/li&gt;\n&lt;li&gt;Dr. Stephan Birkmann, European Space Agency scientist for Webb&amp;#39;s NIRSpec camera (SB)&lt;/li&gt;\n&lt;li&gt;Karl Saad, Canadian Space Agency project manager (KS)&lt;/li&gt;\n&lt;li&gt;Dr. Sarah Lipscy, Ball Aerospace deputy director of New Business, Civil Space (SL)&lt;/li&gt;\n&lt;li&gt;Mei Li Hey, Northrop Grumman mechanical design engineer (MLH)&lt;/li&gt;\n&lt;li&gt;Shawn Domagal-Goldman, NASA branch head for the Planetary Systems Laboratory (SDG)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;We&amp;#39;ll be on at 1 p.m. ET (18 UT), ask us anything!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://twitter.com/NASAWebb/status/1470861166503096320?s=20\"&gt;Proof!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Username: &lt;a href=\"/u/NASA\"&gt;/u/NASA&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 188,
  "permalink": "/r/askscience/comments/rhpba8/askscience_ama_series_were_experts_working_on_the/",
  "subreddit": "askscience",
  "id": "rhpba8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The James Webb Space Telescope (aka Webb) is the most complex, powerful and\nlargest space telescope ever built, designed to fold up in its rocket before\nunfolding in space. After its scheduled Dec. 24, 2021, liftoff from Europe's\nSpaceport in French Guiana (located in South America), Webb will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジェームス・ウェッブ宇宙望遠鏡（通称：ウェッブ）は、最も複雑で強力かつ\nロケットで折り畳んでから使うように設計された、史上最大の宇宙望遠鏡です。\n宇宙で展開する 2021年12月24日に予定されているヨーロッパからの打ち上げ後\nフランス領ギアナ（南米）にある宇宙港で、ウェッブ...",
      "title": "AskScience AMAシリーズ。私たちは、史上最強の天文台であるジェームス・ウェッブ宇宙望遠鏡に携わる専門家です。打ち上げの準備はできています。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "詹姆斯-韦伯太空望远镜（又称韦伯）是有史以来最复杂、最强大和最大的太空望远镜。\n最大的太空望远镜，它被设计成可以在火箭中折叠起来，然后再释放出来。\n在太空中展开。在其预定于2021年12月24日从欧洲的\n位于南美洲的法属圭亚那太空港升空后，韦伯将...",
      "title": "AskScience AMA系列。我们是研究詹姆斯-韦伯太空望远镜的专家，这是有史以来最强大的观测站。它已经准备好发射了。请向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "詹姆斯-韋伯太空望遠鏡（又稱韋伯）是有史以來最複雜、最強大和最大的太空望遠鏡。\n最大的太空望遠鏡，它被設計成可以在火箭中摺疊起來，然後再釋放出來。\n在太空中展開。在其預定於2021年12月24日從歐洲的\n位於南美洲的法屬圭亞那太空港升空後，韋伯將...",
      "title": "AskScience AMA系列。我們是研究詹姆斯-韋伯太空望遠鏡的專家，這是有史以來最強大的觀測站。它已經準備好發射了。請向我們提出任何問題!"
    }
  ]
}