{
  "author": "raven-madness",
  "original_created_utc": 1642679748,
  "title": "Someone a friend of mine used to live with (no romantic relationship) had been having sex with her while she slept and has an entire Google Drive full of videos and photos of this. Can Google cooperate when served subpoena in Australia?",
  "created_utc": 1642689397,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Not just of her, either. What can she do about this? Can Australian Police get Google to allow access to his Drive? Even just on her word? I&amp;#39;ve Googled NSW law about revenge porn/ Image Abuse, but because there is no threat of redistribution over text or proof that these photos even exist, what can she do?&lt;/p&gt;\n\n&lt;p&gt;[EDIT] Shortened the post to stick to the point.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/s8hbic/someone_a_friend_of_mine_used_to_live_with_no/",
  "subreddit": "TooAfraidToAsk",
  "id": "s8hbic",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Not just of her, either. What can she do about this? Can Australian Police get\nGoogle to allow access to his Drive? Even just on her word? I've Googled NSW law\nabout revenge porn/ Image Abuse, but because there is no threat of\nredistribution over text or proof that these photos even exist, what can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女だけではありません。彼女はどうしたらいいのだろう？オーストラリア警察は\nGoogleは彼のドライブへのアクセスを許可するのか？彼女の言葉だけでも？NSW州法でググってみた\nリベンジポルノや画像不正利用についてですが、脅迫がないので\nテキストで再配布したり、これらの写真が存在することを証明したり、何ができるのでしょうか...。",
      "title": "以前、私の友人が一緒に住んでいた人（恋愛関係なし）が、彼女が寝ている間にセックスをしていて、その動画や写真がGoogle Driveにいっぱい入っているんです。オーストラリアで召喚状が出されたとき、Googleは協力できるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也不仅仅是她的。她对此能做些什么？澳大利亚警方能否让\n谷歌允许访问他的硬盘？哪怕只是根据她的话？我在网上搜索了新南威尔士州的法律\n关于报复性色情/图像虐待的法律，但因为没有威胁到\n但因为没有威胁要通过文字重新传播，也没有证据证明这些照片的存在，所以什么能...",
      "title": "我的一个朋友曾经和她住在一起（没有恋爱关系），在她睡觉的时候和她发生了性关系，并且有一整个谷歌硬盘，里面全是这方面的视频和照片。在澳大利亚，当传票送达时，谷歌可以合作吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也不僅僅是她的。她對此能做些什麼？澳大利亞警方能否讓\n谷歌允許訪問他的硬盤？哪怕只是根據她的話？我在網上搜索了新南威爾士州的法律\n關於報復性色情/圖像虐待的法律，但因爲沒有威脅到\n但因爲沒有威脅要通過文字重新傳播，也沒有證據證明這些照片的存在，所以什麼能...",
      "title": "我的一個朋友曾經和她住在一起（沒有戀愛關係），在她睡覺的時候和她發生了性關係，並且有一整個谷歌硬盤，裏面全是這方面的視頻和照片。在澳大利亞，當傳票送達時，谷歌可以合作嗎？"
    }
  ]
}