{
  "author": "caspertheasper",
  "the_new_excerpt": "This is not meant to be a shit post. But I literally can't focus on work\nanymore.\n\nThe profit potential for crypto far exceeds anything I'll ever make working. The\nonly rational reason I stay at my job is to have a buffer in case of a market\ncorrection. But work is lame. And cash is trash.\n\nI can't…",
  "original_created_utc": 1618614142,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはクソ記事にするつもりはありません。しかし、私は文字通り仕事に集中することができません。\nもう仕事に集中できません。\n\n暗号の潜在的な利益は、私が仕事で稼ぐことができるものをはるかに超えています。私は\n私が仕事を続ける唯一の合理的な理由は、市場が調整された場合のバッファを持つためです。\n補正するためです。しかし、仕事はつまらない。そして現金はゴミです。\n\n私には...",
      "title": "働くことが不合理に思えてきた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这并不是要发什么狗屁帖子。但我真的无法专注于工作。\n了。\n\n加密的盈利潜力远远超过了我工作的任何东西。The\n我留在工作岗位上的唯一合理原因是为了在市场发生变化时有一个缓冲期\n纠正。但工作是蹩脚的。而现金是垃圾。\n\n我不能...",
      "title": "工作开始觉得不理智"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這並不是要發什麼狗屁帖子。但我真的無法專注於工作。\n了。\n\n加密的盈利潛力遠遠超過了我工作的任何東西。The\n我留在工作崗位上的唯一合理原因是爲了在市場發生變化時有一個緩衝期\n糾正。但工作是蹩腳的。而現金是垃圾。\n\n我不能...",
      "title": "工作開始覺得不理智"
    }
  ],
  "title": "Working Is Starting To Feel Irrational",
  "created_utc": 1618681875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is not meant to be a shit post. But I literally can&#39;t focus on work anymore.</p>\n\n<p>The profit potential for crypto far exceeds anything I&#39;ll ever make working.  The only rational reason I stay at my job is to have a buffer in case of a market correction.  But work is lame. And cash is trash.</p>\n\n<p>I can&#39;t be the only one.</p>\n\n<p>Edit: I’m just super impressed with how responsible this sub is. Thanks for the awesome conversation.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/mseru0/working_is_starting_to_feel_irrational/",
  "subreddit": "CryptoCurrency",
  "id": "mseru0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519536
}