{
  "author": "SonNaeunismywife",
  "original_created_utc": 1659870081,
  "title": "Was the US in the 1920s a more progressive society than in the 1950s?",
  "created_utc": 1659931048,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From my hardly scientific observations, when you look at what was depicted  in the popular culture of the 1920s you see images of the Smoking,  Drinking, Sexually available Flapper girl. Homosexuality was slightly more acceptable than in previous decades. Women could work. Jazz and Petting Parties were all the rage.&lt;/p&gt;\n\n&lt;p&gt;Whereas  when you look at the Popular Culture of the 1950s, it seems as though  all of that progress had seemingly reversed. The nuclear family was the pinnacle of life. Women went back to dressing more modestly, were discouraged from working, and going to college. Homosexual behavior was  condemned and could get you institutionalized.&lt;/p&gt;\n\n&lt;p&gt;While on the other hand, the 1950s saw the beginnings of the US Civil Rights movement with Rosa Parks, MLK Jr, and the backlash against racism in general after the horrific Emmet Till incident. Anti-Miscegenation Laws began to be overturned in some states as well.&lt;/p&gt;\n\n&lt;p&gt;So, is this simply my overlooking more progressive aspects of the 50s, or is there some truth to my entirely subjective observation?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/wid4ad/was_the_us_in_the_1920s_a_more_progressive/",
  "subreddit": "AskHistorians",
  "id": "wid4ad",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From my hardly scientific observations, when you look at what was depicted in\nthe popular culture of the 1920s you see images of the Smoking, Drinking,\nSexually available Flapper girl. Homosexuality was slightly more acceptable than\nin previous decades. Women could work. Jazz and Petting Parties…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私のほとんど科学的でない観察によれば、『』に描かれたものを見ると\n1920年代の大衆文化を見ると、タバコを吸い、酒を飲み、性欲にまみれた\nフラッパーガール。ホモセクシュアルは、それ以前の数十年間に比べれば、若干容認されるようになった。\n同性愛は、それ以前の数十年間よりも若干容認されていました。女性は働くことができました。ジャズとペッティングパーティー...。",
      "title": "1920年代のアメリカは、1950年代よりも進歩的な社会だったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从我几乎没有科学的观察来看，当你看了一下在《中国》中描述的内容后，你会发现\n20世纪20年代的流行文化，你会看到吸烟、饮酒、性爱的形象。\n有性欲的Flapper女孩。同性恋比以前更容易被接受。\n同性恋比前几十年更容易被接受。妇女可以工作。爵士乐和宠物聚会...",
      "title": "20世纪20年代的美国比50年代的美国是一个更进步的社会吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從我幾乎沒有科學的觀察來看，當你看了一下在《中國》中描述的內容後，你會發現\n20世紀20年代的流行文化，你會看到吸菸、飲酒、性愛的形象。\n有性慾的Flapper女孩。同性戀比以前更容易被接受。\n同性戀比前幾十年更容易被接受。婦女可以工作。爵士樂和寵物聚會...",
      "title": "20世紀20年代的美國比50年代的美國是一個更進步的社會嗎？"
    }
  ]
}