{
  "author": "chromatic45",
  "the_new_excerpt": "So in February I was introduced to a company that promised 1.5% daily returns on\ninvestments. This company went by the name of Wiseling. Now I tired my best to\nensure that this wasn't a scammed and did research and saw where they were\nregistered (fake certificates embedded on the internet) I lost…",
  "original_created_utc": 1619364879,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで2月に、毎日1.5％のリターンを約束する会社を紹介してもらいました。\nという会社を紹介されました。その会社は「Wiseling」という名前でした。私は、これが詐欺ではないかと最善を尽くしました。\n詐欺ではないかと思い、調べてみると、どこに登録されているかがわかりました。\nインターネット上に埋め込まれた偽の証明書）私は失った...",
      "title": "2月に詐欺に遭い、ようやくそれについて話せるようになりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，在二月，我被介绍给一家公司，该公司承诺每天有1.5%的投资回报。\n投资。这家公司的名字叫Wiseling。现在我竭尽全力\n确保这不是一个骗局，并做了研究，看到他们在哪里注册的\n(互联网上的假证书)，我失去了...",
      "title": "2月被骗，终于准备好谈一谈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，在二月，我被介紹給一家公司，該公司承諾每天有1.5%的投資回報。\n投資。這家公司的名字叫Wiseling。現在我竭盡全力\n確保這不是一個騙局，並做了研究，看到他們在哪裏註冊的\n(互聯網上的假證書)，我失去了...",
      "title": "2月被騙，終於準備好談一談。"
    }
  ],
  "title": "Got scammed in February finally ready to talk about it.",
  "created_utc": 1619393466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So in February I was introduced to a company that promised 1.5% daily returns on investments. This company went by the name of Wiseling. Now I tired my best to ensure that this wasn&#39;t a scammed and did research and saw where they were registered (fake certificates embedded on the internet)  I lost 3.5+k in total (BTC and ETH). By the time i figured out it was a scam (they introduced a 10% investment plan that i figured was too good to be true) they had stopped withdrawal and my crypto was gone!! There website and communication was so perfectly laid out that I got duped. Not only did I get duped, I referred a total of 17 individuals to this &quot;company&quot; who invested a total of 7+k in total. After almost two months of coming back to reality I am finally confident enough to share my story. Please don&#39;t go around investing your crypto into online schemes. Learn to trade or hold. Don’t let my mistake become yours. I am now down to zero in my crypto account but all is not lost because for the rest of this year I will recover, and I will purchase more BTC and ETH and hold!</p>\n</div><!-- SC_ON -->",
  "score": 400,
  "permalink": "/r/CryptoCurrency/comments/myaofj/got_scammed_in_february_finally_ready_to_talk/",
  "subreddit": "CryptoCurrency",
  "id": "myaofj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210452
}