{
  "author": "SnooCookies6411",
  "the_new_excerpt": "I hope this isn't taken the wrong way.. Now obviously you should talk about your\nemotions and society isn't really good at allowing men to do so, however I think\nthat this maybe resulted in men treating the women in their lives like free\ntherapists. What I mean by this is dumping all of your…",
  "original_created_utc": 1620013802,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解しないでいただきたいのですが...。もちろん、自分の感情について話すべきです。\n感情を話すべきであり、社会は男性がそうすることをあまり認めていません。\nその結果、男性は女性を無料のセラピストのように扱うようになってしまったのではないでしょうか。\nセラピスト。私が言いたいのは、自分の感情をすべて捨てて...",
      "title": "自分を無料のセラピストのように扱ってくれる男性との境界線をどのように設定しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我希望这不会被误解。现在显然你应该谈论你的\n社会并不允许男人这样做，但是我认为\n但我认为，这可能导致男人把他们生活中的女人当作免费的\n治疗师。我的意思是，将你所有的...",
      "title": "你如何为那些把你当成免费治疗师的男人设定界限？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我希望這不會被誤解。現在顯然你應該談論你的\n社會並不允許男人這樣做，但是我認爲\n但我認爲，這可能導致男人把他們生活中的女人當作免費的\n治療師。我的意思是，將你所有的...",
      "title": "你如何爲那些把你當成免費治療師的男人設定界限？"
    }
  ],
  "title": "How do you set boundaries for men who treat you like a free therapist?",
  "created_utc": 1620055812,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hope this isn&#39;t taken the wrong way.. \nNow obviously you should talk about your emotions and society isn&#39;t really good at allowing men to do so, however I think that this maybe resulted in men treating the women in their lives like free therapists. \nWhat I mean by this is dumping all of your emotions and trauma onto someone in an untimely manner, or using someone as your emotional clutch, throwing all of your problems onto them and expecting them to be helpful or a savior to you in some way. It can be really exhausting. I think since women are known to be a little more emotionally mature, men can sometimes view women as emotional outlets who will fix them. Do any of you experience this? And how do you set boundaries if you do?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskWomen/comments/n3n8b0/how_do_you_set_boundaries_for_men_who_treat_you/",
  "subreddit": "AskWomen",
  "id": "n3n8b0",
  "is_self": true,
  "media": null,
  "is_video": false
}