{
  "author": "Holy_Shit_HeckHounds",
  "original_created_utc": 1632766404,
  "title": "\"Meditations\" by Marcus Aurelius and translation in general",
  "created_utc": 1632782304,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was listening to <em>Meditations</em> and I came across a passage that stuck out.</p>\n\n<p>#1</p>\n\n<blockquote>\n<p>sculptors; he will see a kind of bloom and fresh beauty in an old woman or an old man; <strong>and he will be able to look with sober eyes on the seductive charm of his own slave boys.</strong> Book 3.2 (Penguin Classics edition; Translated with Notes by MARTIN HAMMOND)</p>\n</blockquote>\n\n<p>I bolded the part that stood out to me. The translator provided a footnote for that part, referencing a different part of the book, which provided a degree of context. Out of curiosity, I looked up other translations of the book. These are the first few results from Google</p>\n\n<p>#2</p>\n\n<blockquote>\n<p>So will he be able to perceive the proper ripeness and beauty of old age, whether in man or woman: <strong>and whatsoever else it is that is beautiful and alluring in whatsoever is, with chaste and continent eyes he will soon find out and discern</strong>. ( <a href=\"https://www.gutenberg.org/files/2680/2680-h/2680-h.htm#link2H_4_0035\">Gutenberg.org</a> version, Translator: Meric Casaubon)</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>#3</p>\n\n<blockquote>\n<p>He’ll look calmly at the distinct beauty of old age in men, women, <strong>and at the loveliness of children. And other things like that will call out to him constantly—things unnoticed by others</strong> (<a href=\"http://seinfeld.co/library/meditations.pdf\">Modern Library edition</a>,  A New Translation, with an Introduction, by Gregory Hays)</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>#4</p>\n\n<blockquote>\n<p>With like pleasure will his chaste eyes behold &lt;77&gt; the maturity and grace of old age in man or woman, <strong>and the inviting charms of youth. (</strong><a href=\"http://files.libertyfund.org/files/2133/Aurelius_1464_LFeBk.pdf\">Liberty Fund</a>. Translated by Francis Hutcheson and James Moor Edited and with an Introduction by James Moore and Michael Silverthorne )</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>#5</p>\n\n<blockquote>\n<p>and in an old woman and an old man he will be able to see a certain maturity and comeliness; <strong>and the attractive loveliness of young persons he will be able to look on with chaste eyes</strong>; and many such things will present themselves, not pleasing to every man, but to him only who has become truly familiar with nature and her works. (<a href=\"http://classics.mit.edu/Antoninus/meditations.3.three.html\">MIT Classics</a>  Translated by George Long )</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>All of these version present, at least to a lay person, a VERY different interpretation of the passage. #1, #4 and #5 all make the attractiveness to youth seem sexual in nature, and #1 makes it the most explicit; #3 reads to me more paternalistic; and #2 makes no mention of young people at all, only the old! Additionally, #1 is the only one to mention the word &quot;slave&quot; which completely alters the perception for a modern reader.</p>\n\n<p>&#x200B;</p>\n\n<p>So my question is two fold</p>\n\n<ul>\n<li> Which is more accurate? Do we know what he is trying to say</li>\n<li>How can, as I layperson, have confidence in an arbitrary translation of an ancient work, when translations vary so widely? Or how can pick a translation?</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/pwmygv/meditations_by_marcus_aurelius_and_translation_in/",
  "subreddit": "AskHistorians",
  "id": "pwmygv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was listening to Meditations and I came across a passage that stuck out.\n\n#1\n\n> sculptors; he will see a kind of bloom and fresh beauty in an old woman or an\n> old man; and he will be able to look with sober eyes on the seductive charm of\n> his own slave boys. Book 3.2 (Penguin Classics edition;…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Meditationsを聴いていて、心に残る一節がありました。\n\n#1\n\n> 彫刻家は、老婆や老人の中に、ある種の花のような新鮮な美しさを見出すだろう。\n> また、自分の奴隷少年の魅惑的な魅力を冷静な目で見ることができるだろう。\n> 自分の奴隷少年たちの魅惑的な魅力を冷静な目で見ることができるだろう。第3.2巻（ペンギンクラシック版；...",
      "title": "マルクス・アウレリウスの \"Meditations \"と翻訳について"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在听《沉思录》的时候，看到了一段话，让我印象深刻。\n\n#1\n\n> 雕塑家；他将在一个老妇人或一个老人身上看到一种绽放和新鲜的美。\n> 老人；他将能以清醒的眼光看待自己的奴隶男孩的诱人魅力。\n> 他自己的奴仆男孩。第3.2册（企鹅经典版；...",
      "title": "\"马库斯-奥勒留的《沉思录》和一般的翻译"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在聽《沉思錄》的時候，看到了一段話，讓我印象深刻。\n\n#1\n\n> 雕塑家；他將在一個老婦人或一個老人身上看到一種綻放和新鮮的美。\n> 老人；他將能以清醒的眼光看待自己的奴隸男孩的誘人魅力。\n> 他自己的奴僕男孩。第3.2冊（企鵝經典版；...",
      "title": "\"馬庫斯-奧勒留的《沉思錄》和一般的翻譯"
    }
  ]
}