{
  "author": "Many_Scratch2269",
  "original_created_utc": 1635843933,
  "title": "Crypto.com is now the most downloaded app in the US play store while Coinbase is the most downloaded in the Apple appstore",
  "created_utc": 1635885599,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just shows how fast Crypto is being adopted. Banking apps are nowhere close to even the top 10 while Crypto is number 1 in all categories. Even in the Apple app store, Coinbase is the number one most downloaded app. </p>\n\n<p>This is huge considering Facebook, Tiktok, Snapchat, Instagram or even messaging apps are below Crypto apps. Crypto is literally growing faster than the internet in its prime years. Honestly, I believe this is just the start of Crypto becoming mainstream. I can only imagine what the future holds.</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/ql05s5/cryptocom_is_now_the_most_downloaded_app_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "ql05s5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just shows how fast Crypto is being adopted. Banking apps are nowhere close to\neven the top 10 while Crypto is number 1 in all categories. Even in the Apple\napp store, Coinbase is the number one most downloaded app.\n\nThis is huge considering Facebook, Tiktok, Snapchat, Instagram or even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号がいかに早く普及しているかを示しています。銀行系アプリはトップ10にも入っていませんが\nトップ10にも入っていませんが、Cryptoはすべてのカテゴリーで1位です。Appleのアプリストアでも\nアプリストアでも、Coinbaseは最もダウンロードされたアプリの第1位です。\n\nFacebook、Tiktok、Snapchat、Instagram、さらには...を考えると、これは非常に大きなことです。",
      "title": "Crypto.comは米国のプレイストアで最もダウンロードされたアプリに、CoinbaseはAppleのAppStoreで最もダウンロードされたアプリになりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这表明加密货币被采用的速度有多快。银行应用程序还远未达到\n甚至前10名，而加密货币在所有类别中都是第一。即使在苹果的\n应用商店，Coinbase也是下载量最大的应用之一。\n\n考虑到Facebook、Tiktok、Snapchat、Instagram甚至是......这是很巨大的。",
      "title": "Crypto.com现在是美国play商店中下载量最大的应用程序，而Coinbase是苹果appstore中下载量最大的应用程序。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這表明加密貨幣被採用的速度有多快。銀行應用程序還遠未達到\n甚至前10名，而加密貨幣在所有類別中都是第一。即使在蘋果的\n應用商店，Coinbase也是下載量最大的應用之一。\n\n考慮到Facebook、Tiktok、Snapchat、Instagram甚至是......這是很巨大的。",
      "title": "Crypto.com現在是美國play商店中下載量最大的應用程序，而Coinbase是蘋果appstore中下載量最大的應用程序。"
    }
  ]
}