{
  "author": "Jazz-Cigarettes",
  "original_created_utc": 1643228981,
  "title": "Emperor Franz Josef of Austria-Hungary once wrote to his wife suggesting that shirtless Bedouin guides must be the reason why “English women so happily and frequently like to scale the pyramids”. Was this a common stereotype other 19th century Europeans had about English women being \"thirsty\"?",
  "created_utc": 1643245098,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m currently reading Margaret MacMillan&amp;#39;s &lt;em&gt;The War that Ended Peace&lt;/em&gt; about the lead-up to the First World War. In a chapter on Austria-Hungary&amp;#39;s prewar history, she details Franz Josef&amp;#39;s upbringing, reign, and his attitudes toward the cultural milieu of 19th and early 20th century society.&lt;/p&gt;\n\n&lt;p&gt;In what I take as an anecdote meant to demonstrate his sense of propriety and conservative values, she notes that during a visit to Egypt, he wrote in a letter to his wife, the Empress Elizabeth, that the Bedouin guides who helped him climb up the great pyramid tended to leave their shirts open, and that must be why “English women so happily and frequently like to scale the pyramids”.&lt;/p&gt;\n\n&lt;p&gt;I think the general stereotype many of us (at least in the Anglosphere) have about Victorian era Britain is that chastity, propriety, and purity were some of the most prized ideals for women. Franz Josef&amp;#39;s snarky comment to his wife seems to belie that impression though. Is this just a one-off comment from a particularly conservative monarch putting down another nation&amp;#39;s women? Or was there some wider stereotype Europeans had about English women that he was playing into here?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 147,
  "permalink": "/r/AskHistorians/comments/sdfl0z/emperor_franz_josef_of_austriahungary_once_wrote/",
  "subreddit": "AskHistorians",
  "id": "sdfl0z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm currently reading Margaret MacMillan's The War that Ended Peace about the\nlead-up to the First World War. In a chapter on Austria-Hungary's prewar\nhistory, she details Franz Josef's upbringing, reign, and his attitudes toward\nthe cultural milieu of 19th and early 20th century society.\n\nIn what…"
}