{
  "author": "notbrokemexican",
  "the_new_excerpt": "Pinterest is currently my biggest holding and I have a strong conviction about\nit. I love that it's a women-driven investment that is growing impressively fast\naround the world and sits at 500M monthly active users.\n\nThe leadership refers to the company as a personal media application and a\nsearch…",
  "original_created_utc": 1622402224,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Pinterestは現在、私の最大の持ち株であり、強い信念を持っています。\n確信があります。世界中で急速に成長し、月間アクティブユーザー数が5億人に達している、女性主導の投資先であることが気に入っています。\n世界中で急速に成長しており、月間アクティブユーザー数は5億人に達しています。\n\nリーダーたちは、この会社をパーソナルメディアアプリケーションと\n検索のためのアプリケーションと呼んでいます。",
      "title": "ピンタレストの感想は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Pinterest是我目前最大的持股，我对它有强烈的信念。\n的坚定信念。我喜欢它是一个以女性为主导的投资，在全球范围内快速增长，并拥有5亿月度活跃用户，令人印象深刻。\n我喜欢它是一个以女性为主导的投资项目，在全球范围内快速增长，月活跃用户达到5亿。\n\n领导层称该公司是一个个人媒体应用和一个\n搜索...",
      "title": "对Pinterest的看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Pinterest是我目前最大的持股，我對它有強烈的信念。\n的堅定信念。我喜歡它是一個以女性爲主導的投資，在全球範圍內快速增長，並擁有5億月度活躍用戶，令人印象深刻。\n我喜歡它是一個以女性爲主導的投資項目，在全球範圍內快速增長，月活躍用戶達到5億。\n\n領導層稱該公司是一個個人媒體應用和一個\n搜索...",
      "title": "對Pinterest的看法？"
    }
  ],
  "title": "Thoughts on Pinterest?",
  "created_utc": 1622471436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pinterest is currently my biggest holding and I have a strong conviction about it. I love that it&#39;s a women-driven investment that is growing impressively fast around the world and sits at 500M monthly active users.</p>\n\n<p>The leadership refers to the company as a personal media application and a search engine for ideas. Their two biggest changes has been the introduction of Shops,  which has pressured Instagram to release its own influencer version of shops and the release of Livestreams with tickets/waitrooms.</p>\n\n<p>I really love the direction that this company is going in and it in some ways it kind of reminds me of the intention of YouTube. Mostly women are going on the platform with an intent to plan or search, so the need for influencing is not nearly as high as it is on platforms like Facebook or Bytedance.</p>\n\n<p>In the short term, I&#39;m bullish on Pinterest with respect to travel. I think we will see continued growth because people are planning their trips and it&#39;s a lucrative market.</p>\n\n<p>In the long-term I&#39;m bullish on it being one of the more effective forms of social media with respect to e-commerce and advertising effectiveness. A user may go on Instagram and spend more time, resulting in no net gain for an advertiser. A user on Pinterest is almost guarunteed to enter and exit with an attempted plan or shop.</p>\n\n<p>What are your thoughts on Pinterest?</p>\n</div><!-- SC_ON -->",
  "score": 49,
  "permalink": "/r/stocks/comments/noia7g/thoughts_on_pinterest/",
  "subreddit": "stocks",
  "id": "noia7g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300254
}