{
  "author": "ferrofibrous",
  "original_created_utc": 1646927439,
  "title": "Do songbirds birds pre-plan nest locations, or is it an \"on the fly\" decision made when they get broody?",
  "created_utc": 1646935880,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have several bluebird nest boxes, one of which was heavily used last year (3 successful broods). They have been around this year and checking out my other boxes, but seem to spend time evaluating boxes not really profiled for bluebirds (interior dimension, location, entrance size).&lt;/p&gt;\n\n&lt;p&gt;So do birds actually &amp;quot;plan ahead&amp;quot; weeks in advance which location they plan to use for a nest, or do they do a sort of psuedo-random rotation of possible sites, and the one they happen to be investigating the day they decide to start building is the one that gets used? Bad analogy, but like walking back and forth between two bathrooms you aren&amp;#39;t sure which you want to use, until you absolutely need to pee.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/askscience/comments/tb1nls/do_songbirds_birds_preplan_nest_locations_or_is/",
  "subreddit": "askscience",
  "id": "tb1nls",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have several bluebird nest boxes, one of which was heavily used last year (3\nsuccessful broods). They have been around this year and checking out my other\nboxes, but seem to spend time evaluating boxes not really profiled for bluebirds\n(interior dimension, location, entrance size).\n\nSo do birds…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はブルーバードの巣箱をいくつか持っていますが、そのうちの1つは昨年酷使されました（3つ\nを成功させました。） 今年に入ってからは、他の鳥もチェックするようになりました。\nしかし、ブルーバード用に設計されていない箱の評価に時間を費やしているようです。\n(内寸、場所、入り口の大きさ）。\n\n鳥もそうですが・・・。",
      "title": "鳴禽類はあらかじめ巣の場所を決めているのか、それとも子作りのときに「その場」で決めているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有几个蓝鸟巢箱，其中一个去年被大量使用（3个\n成功繁殖）。今年，它们一直在我身边，并查看了我的其他\n巢箱，但似乎花时间去评估那些并不适合蓝鸟的巢箱。\n(内部尺寸，位置，入口尺寸）。\n\n鸟类也是如此...",
      "title": "鸣禽鸟类是否事先计划好了筑巢地点，还是在它们获得育雏期时 \"临时 \"决定的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有幾個藍鳥巢箱，其中一個去年被大量使用（3個\n成功繁殖）。今年，它們一直在我身邊，並查看了我的其他\n巢箱，但似乎花時間去評估那些並不適合藍鳥的巢箱。\n(內部尺寸，位置，入口尺寸）。\n\n鳥類也是如此...",
      "title": "鳴禽鳥類是否事先計劃好了築巢地點，還是在它們獲得育雛期時 \"臨時 \"決定的？"
    }
  ]
}