{
  "author": "zhirzzh",
  "original_created_utc": 1626443098,
  "title": "Did the Japanese government really plan to create a colony of Jewish people in Manchuria, and, if so, was this really because they were positively influenced by the Protocols of the Elders of Zion?",
  "created_utc": 1626462916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In his book &quot;The Fugu Plan: The Untold Story of the Japanese and the Jews During World War II,&quot; Marvin Tokayer claims that Japanese people exposed to the Protocols of the Elders of Zion believed the anti-Semitic propaganda, but interpreted it positively. They thought that, if Jewish people were so influential and powerful, Japan should try to have as close relations with them as possible, so that it could benefit from their power. As such, the Japanese government planned to eventually settle a group of Jewish settlers in Manchuria to form the basis of a Japanese/Jewish colony.</p>\n\n<p>This is something I have heard repeatedly as a piece of interesting WWII trivia, but, while I found a bunch of articles discussing it, (for example: <a href=\"https://chinachannel.org/2019/03/28/japan-fugu/\">https://chinachannel.org/2019/03/28/japan-fugu/</a>) all the citations eventually seem to go back to Tokayer&#39;s book. Tokayer is not a historian, but a rabbi who served in Japan, and seems to have a generally positive outlook on Japan&#39;s WW2 leadership (based on Wikipedia: <a href=\"https://en.wikipedia.org/wiki/Marvin_Tokayer\">https://en.wikipedia.org/wiki/Marvin_Tokayer</a>) and wants to promote ties between Japan and the Jewish community. This makes me wonder if this story is actually true, or apocryphal. </p>\n\n<p>Were there really plans to create a Jewish colony in Manchuria, and were these plans really because the Japanese government believed the anti-Semitic conspiracy theories in the Protocols, but thought that they were a good thing?</p>\n\n<p>I see this question has been asked here a couple times before, but it looks like it never got an answer.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/olh568/did_the_japanese_government_really_plan_to_create/",
  "subreddit": "AskHistorians",
  "id": "olh568",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In his book \"The Fugu Plan: The Untold Story of the Japanese and the Jews During\nWorld War II,\" Marvin Tokayer claims that Japanese people exposed to the\nProtocols of the Elders of Zion believed the anti-Semitic propaganda, but\ninterpreted it positively. They thought that, if Jewish people were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "著書「河豚計画」では 第二次世界大戦中の日本人とユダヤ人の知られざる物語\nマービン・トカイエは、著書『河豚計画-第二次世界大戦中の日本人とユダヤ人の知られざる物語』の中で、河豚を食べた日本人は\nシオン長老の議定書」を目にした日本人は、反ユダヤ的なプロパガンダを信じながらも、それを肯定的に解釈していたと主張している。\n肯定的に解釈していた。彼らは、ユダヤ人が...",
      "title": "日本政府は本当に満州にユダヤ人の植民地を作るつもりだったのか、もしそうだとしたら、それは本当に「シオンの長老たちの議定書」に肯定的な影響を受けたからなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在他的书《河豚计划》中。二战期间日本人和犹太人不为人知的故事\n马文-托卡耶（Marvin Tokayer）在他的《府谷计划：二战期间日本人和犹太人不为人知的故事》一书中称，接触过《锡安长老会议定书》的日本人\n马文-托卡耶（Marvin Tokayer）声称，接触到《锡安长老会议定书》的日本人相信反犹太主义宣传，但对其进行了积极的解释。\n对它的解释是积极的。他们认为，如果犹太人是...",
      "title": "日本政府是否真的计划在满洲里建立一个犹太人的殖民地，如果是的话，这真的是因为他们受到了《锡安长老会议定书》的积极影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在他的書《河豚計劃》中。二戰期間日本人和猶太人不爲人知的故事\n馬文-託卡耶（Marvin Tokayer）在他的《府谷計劃：二戰期間日本人和猶太人不爲人知的故事》一書中稱，接觸過《錫安長老會議定書》的日本人\n馬文-託卡耶（Marvin Tokayer）聲稱，接觸到《錫安長老會議定書》的日本人相信反猶太主義宣傳，但對其進行了積極的解釋。\n對它的解釋是積極的。他們認爲，如果猶太人是...",
      "title": "日本政府是否真的計劃在滿洲里建立一個猶太人的殖民地，如果是的話，這真的是因爲他們受到了《錫安長老會議定書》的積極影響？"
    }
  ]
}