{
  "author": "ethereum88",
  "the_new_excerpt": "Saving accounts? 0.1% interest isn’t going to help at all in building wealth. ❌\n\nReal estate? Housing prices are so expensive millennials can barely afford to\nown their own house, let alone invest in rental property.❌\n\nHigher education? A degree is so common nowadays it doesn’t confer any…",
  "original_created_utc": 1624177242,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "貯金箱？0.1%の利息では、資産形成には全く役に立ちませんよ。❌\n\n不動産？ミレニアル世代は自分の家を持つのがやっとというくらい住宅価格が高いです。\n賃貸物件への投資はおろか、自分の家を持つこともできません。\n\n高等教育？今や学位は一般的なものですが、それだけでは何の意味もありません...",
      "title": "センチメント。ミレニアル世代にとってこれ以上の選択肢はないので、私はCryptoにしがみついています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "储蓄账户？0.1%的利息对积累财富一点帮助都没有。❌\n\n房地产？房价是如此昂贵，千禧一代几乎无法负担得起\n拥有自己的房子，更不用说投资租赁房产了。\n\n高等教育？如今，学位是如此普遍，它并没有赋予任何...",
      "title": "感情。我在坚持我的加密货币，因为对于千禧一代，我看不到任何更好的选择。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "儲蓄賬戶？0.1%的利息對積累財富一點幫助都沒有。❌\n\n房地產？房價是如此昂貴，千禧一代幾乎無法負擔得起\n擁有自己的房子，更不用說投資租賃房產了。\n\n高等教育？如今，學位是如此普遍，它並沒有賦予任何...",
      "title": "感情。我在堅持我的加密貨幣，因爲對於千禧一代，我看不到任何更好的選擇。"
    }
  ],
  "title": "Sentiment: I’m Hodling on to my Crypto because I can’t see any better option for millennials",
  "created_utc": 1624188638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Saving accounts? 0.1% interest isn’t going to help at all in building wealth. ❌</p>\n\n<p>Real estate? Housing prices are so expensive millennials can barely afford to own their own house, let alone invest in rental property.❌</p>\n\n<p>Higher education? A degree is so common nowadays it doesn’t confer any extra advantage. PhDs are in oversupply, many are stuck in low paying adjunct positions. (Ok this is a partial tick ✅, but no one is going to get rich just by having a higher degree.)</p>\n\n<p>Stocks? Partial tick ✅ only for Frontier Technology like Electric Vehicles. No one is going to get rich investing in Apple, Amazon, FaceBook in 2021, the time for that has passed 10 years ago.</p>\n\n<p>Crypto’s institutional adoption only really began this year in 2021. DeFi started less than 5 years ago in 2018-2019, but again really became popular only recently. Crypto (those of good quality) is literally one of the most promising things a millennial can invest in.</p>\n</div><!-- SC_ON -->",
  "score": 373,
  "permalink": "/r/CryptoCurrency/comments/o40uqs/sentiment_im_hodling_on_to_my_crypto_because_i/",
  "subreddit": "CryptoCurrency",
  "id": "o40uqs",
  "is_self": true,
  "media": null,
  "is_video": false
}