{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "\"This is not financial advice\" - Every youtuber ever.\n\nBut sign up with my Webull or Gemini or \"fill in the blank exchange\"\n\nI understand that all the youtubers need to have a disclaimer however they all know that the picks they give, the opinions they make, and bias they have influence their followers. It influences them into buying, selling, hyping, pumping, etc. I don't know how many times that I expressed having these strong biases towards particular stocks creates an unhealthy environment and circle jerk. No community is immune to this.\n\nI was recently just removed from a discord for expressing an opinion that people need to be able to talk about their fear of the market and not continue this unrealistic expectation that the market will continue to indefinitely support uneducated investments.\n\nOn this discord server there was a person who is worried about the delisting of Chinese stocks, NIO in particular, after the DIDI delisting. The partner of one of the mods said that they were \"over it\" with these people coming in spreading FUD. I disagreed stating that we can't essentially just talk about the pump side of the market without recognizing the dump aspect. That's not FUD. It's critical thinking. It's skepticism. It's reality.\n\nI saw one user in this specific discord literally have a breakdown upon losing hundreds of thousands in pre-LCID and while this was going on I expressed that hyping this guy up to keep buying was dangerous. Yet it continued to happen without any sort of community wide discussion. That is an unhealthy environment, especially one that only encourages hyping but won't tolerate people that express an alternative POV.\n\nThis is a warning for all the new people out there who hopefully haven't yet likely lost hundreds, thousands and maybe hundreds of thousands following youtube \"advice.\" Don't trust any youtuber that quotes Tipranks as their sole due diligence. Don't trust any youtuber that won't defend their thesis on why particular stocks should have value and are therefore worthy of your hard earned money.\n\nThat being said, this isn't a hate post by any stretch because I think the people that are running this discord and the people that are in the discord are good people.\n\nIf anyone wants to chat about any discords I would like to have a healthy discussion without hate language. We should have a place or even a sub where youtubers can be reviewed to provide people with information on whether they are valuable and informative, or not.\n\n**The tips I want to give anyone who is starting their investing journey after being part of a few discords are:**\n\n\\- Investing is not a team sport even though you've joined a community. Be careful of confirmation bias.\n\n\\- Whenever you watch a video recommending a stock or investment do your own research looking at the company websites, charts, articles, etc.\n\n\\- This is your money. It is hard to earn. Don't throw it away.\n\n\\- All of this applies to reddit as well. I mean I've made some posts on companies but admittedly my understanding was and is primitive. Whether or not they actually pan out is yet to be seen.\n\nModerator — Today at 11:59 AM\n\nHi, Cedar, due to a conflict of interest, we are choosing to revoke your membership to the Patreon. A refund for December will be issued to you which you will see on your card within 5-7 days. We wish you all the best in future endeavors.\n\nCedarAndFerns — Today at 12:01 PM\n\nIt's sad. You and *Moderator* are amazing people but there is a bias that exists in here. Whenever someone disagrees with you they are promptly removed. I don't want to imply anything but the 3 minutes of referral links every video with the bias of certain stocks without any education on why they are valuable while quoting tipranks as dd isn't teaching your community anything.\n\n\\*edit\\* a word",
  "author_fullname": "t2_921lurev",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Youtubers and Investing - Be careful",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "discussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_r9rgpl",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.83,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 278,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Industry Discussion",
  "can_mod_post": false,
  "score": 278,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1638744513,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1638743855,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;quot;This is not financial advice&amp;quot; - Every youtuber ever.&lt;/p&gt;\n\n&lt;p&gt;But sign up with my Webull or Gemini or &amp;quot;fill in the blank exchange&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I understand that all the youtubers need to have a disclaimer however they all know that the picks they give, the opinions they make, and bias they have influence their followers. It influences them into buying, selling, hyping, pumping, etc. I don&amp;#39;t know how many times that I expressed having these strong biases towards particular stocks creates an unhealthy environment and circle jerk. No community is immune to this.&lt;/p&gt;\n\n&lt;p&gt;I was recently just removed from a discord for expressing an opinion that people need to be able to talk about their fear of the market and not continue this unrealistic expectation that the market will continue to indefinitely support uneducated investments.&lt;/p&gt;\n\n&lt;p&gt;On this discord server there was a person who is worried about the delisting of Chinese stocks, NIO in particular, after the DIDI delisting. The partner of one of the mods said that they were &amp;quot;over it&amp;quot; with these people coming in spreading FUD. I disagreed stating that we can&amp;#39;t essentially just talk about the pump side of the market without recognizing the dump aspect. That&amp;#39;s not FUD. It&amp;#39;s critical thinking. It&amp;#39;s skepticism. It&amp;#39;s reality.&lt;/p&gt;\n\n&lt;p&gt;I saw one user in this specific discord literally have a breakdown upon losing hundreds of thousands in pre-LCID and while this was going on I expressed that hyping this guy up to keep buying was dangerous. Yet it continued to happen without any sort of community wide discussion. That is an unhealthy environment, especially one that only encourages hyping but won&amp;#39;t tolerate people that express an alternative POV.&lt;/p&gt;\n\n&lt;p&gt;This is a warning for all the new people out there who hopefully haven&amp;#39;t yet likely lost hundreds, thousands and maybe hundreds of thousands following youtube &amp;quot;advice.&amp;quot; Don&amp;#39;t trust any youtuber that quotes Tipranks as their sole due diligence. Don&amp;#39;t trust any youtuber that won&amp;#39;t defend their thesis on why particular stocks should have value and are therefore worthy of your hard earned money.&lt;/p&gt;\n\n&lt;p&gt;That being said, this isn&amp;#39;t a hate post by any stretch because I think the people that are running this discord and the people that are in the discord are good people.&lt;/p&gt;\n\n&lt;p&gt;If anyone wants to chat about any discords I would like to have a healthy discussion without hate language. We should have a place or even a sub where youtubers can be reviewed to provide people with information on whether they are valuable and informative, or not.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The tips I want to give anyone who is starting their investing journey after being part of a few discords are:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;- Investing is not a team sport even though you&amp;#39;ve joined a community. Be careful of confirmation bias.&lt;/p&gt;\n\n&lt;p&gt;- Whenever you watch a video recommending a stock or investment do your own research looking at the company websites, charts, articles, etc.&lt;/p&gt;\n\n&lt;p&gt;- This is your money. It is hard to earn. Don&amp;#39;t throw it away.&lt;/p&gt;\n\n&lt;p&gt;- All of this applies to reddit as well. I mean I&amp;#39;ve made some posts on companies but admittedly my understanding was and is primitive. Whether or not they actually pan out is yet to be seen.&lt;/p&gt;\n\n&lt;p&gt;Moderator — Today at 11:59 AM&lt;/p&gt;\n\n&lt;p&gt;Hi, Cedar, due to a conflict of interest, we are choosing to revoke your membership to the Patreon. A refund for December will be issued to you which you will see on your card within 5-7 days. We wish you all the best in future endeavors.&lt;/p&gt;\n\n&lt;p&gt;CedarAndFerns — Today at 12:01 PM&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s sad. You and &lt;em&gt;Moderator&lt;/em&gt; are amazing people but there is a bias that exists in here. Whenever someone disagrees with you they are promptly removed. I don&amp;#39;t want to imply anything but the 3 minutes of referral links every video with the bias of certain stocks without any education on why they are valuable while quoting tipranks as dd isn&amp;#39;t teaching your community anything.&lt;/p&gt;\n\n&lt;p&gt;*edit* a word&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "8acd2324-65e6-11e5-a263-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#4f8ef7",
  "id": "r9rgpl",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "CedarAndFerns",
  "discussion_type": null,
  "num_comments": 54,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/r9rgpl/youtubers_and_investing_be_careful/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/r9rgpl/youtubers_and_investing_be_careful/",
  "subreddit_subscribers": 3349023,
  "created_utc": 1638755964,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1638743855,
  "the_new_excerpt": "\"This is not financial advice\" - Every youtuber ever.\n\nBut sign up with my Webull or Gemini or \"fill in the blank exchange\"\n\nI understand that all the youtubers need to have a disclaimer however they all\nknow that the picks they give, the opinions they make, and bias they have\ninfluence their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"これは金融アドバイスではありません\" - これまでのすべてのyoutuber。\n\nしかし、私のWebullやGeminiや \"空白の交換を埋める \"と契約してください。\n\nユーチューバーが免責事項を設ける必要があることは理解していますが、彼らは皆\nその際、自分の選んだもの、自分の意見、自分が持っている偏見などが\nを、...",
      "title": "Youtuberと投資-気をつけよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"这不是财务建议\"--每一个优酷网友都是如此。\n\n但在我的Webull或双子座或 \"填补空白的交易所 \"注册。\n\n我理解所有优酷网友都需要有一个免责声明，但是他们都知道\n他们都知道，他们给出的选择，他们的意见，以及他们的偏向性\n影响到他们的...",
      "title": "Youtubers和投资 - 要小心"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"這不是財務建議\"--每一個優酷網友都是如此。\n\n但在我的Webull或雙子座或 \"填補空白的交易所 \"註冊。\n\n我理解所有優酷網友都需要有一個免責聲明，但是他們都知道\n他們都知道，他們給出的選擇，他們的意見，以及他們的偏向性\n影響到他們的...",
      "title": "Youtubers和投資 - 要小心"
    }
  ],
  "source_updated_at": 1639129312592
}