{
  "author": "parkix",
  "original_created_utc": 1657260462,
  "title": "Can a dormant herpes virus become active if someone is in contact with cold sores?",
  "created_utc": 1657344192,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve read that most of the world population already has herpes (something like 80-90%) but only a small minority show symptoms (cold sores). In the case of HSV-1 virus, if someone already has the virus, but is asymptomatic (never had any outbreaks, as seems to be the case with most of the population) and gets into contact with cold sores (from a partner), will that person develop symptoms (cold sores) or will the virus continue to be dormant?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/vu3r40/can_a_dormant_herpes_virus_become_active_if/",
  "subreddit": "askscience",
  "id": "vu3r40",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've read that most of the world population already has herpes (something like\n80-90%) but only a small minority show symptoms (cold sores). In the case of\nHSV-1 virus, if someone already has the virus, but is asymptomatic (never had\nany outbreaks, as seems to be the case with most of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "世界人口のほとんどがすでにヘルペスにかかっているという記事を読んだことがあります（なんか\nているが、症状が出るのはごく少数である（冷え症）。HSV-1ウイルスの場合\nHSV-1ウイルスの場合、すでにウイルスに感染していても、無症状（発症したことがない）であれば\nほとんどの人がそうであるように、発症したことがありません。",
      "title": "ヘルペスウイルスの休眠状態が、冷え症の人と接触した場合、活性化することがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读到过，世界上大多数人口已经有了疱疹（类似于\n80-90%），但只有少数人出现症状（冷疮）。在以下情况下\n在HSV-1病毒的情况下，如果某人已经感染了该病毒，但没有症状（似乎从未有任何爆发\n爆发，这似乎是大多数人的情况。",
      "title": "如果有人接触到冷疮，休眠的疱疹病毒会变得活跃吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀到過，世界上大多數人口已經有了皰疹（類似於\n80-90%），但只有少數人出現症狀（冷瘡）。在以下情況下\n在HSV-1病毒的情況下，如果某人已經感染了該病毒，但沒有症狀（似乎從未有任何爆發\n爆發，這似乎是大多數人的情況。",
      "title": "如果有人接觸到冷瘡，休眠的皰疹病毒會變得活躍嗎？"
    }
  ]
}