{
  "author": "domingolin",
  "the_new_excerpt": "Here is a quote from a Benzinga article released Friday, \"PLTR shares are\ntrading higher on above-average volume amid continued volatility in the name\nstemming from increased popularity amongst traders on Reddit's Wall Street Bets\ncommunity.\"\n\nThis is one of the most concise points made in an…",
  "original_created_utc": 1611507208,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "以下是引用Benzinga周五发布的一篇文章，\"PLTR的股价是。\n在名义上持续波动的情况下，交易量高于平均水平，走高。\n源于Reddit上的华尔街赌局在交易员中的人气增加\n社区。\"\n\n这是一个最简洁的观点，在一个...",
      "title": "Benzinga声称PLTR的运行完全是因为我们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是引用Benzinga週五發佈的一篇文章，\"PLTR的股價是。\n在名義上持續波動的情況下，交易量高於平均水平，走高。\n源於Reddit上的華爾街賭局在交易員中的人氣增加\n社區。\"\n\n這是一個最簡潔的觀點，在一個...",
      "title": "Benzinga聲稱PLTR的運行完全是因爲我們。"
    }
  ],
  "title": "Benzinga claims PLTR is running solely because of us.",
  "created_utc": 1611535998,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here is a quote from a Benzinga article released Friday, &quot;PLTR shares are trading higher on above-average volume amid continued volatility in the name stemming from increased popularity amongst traders on Reddit&#39;s Wall Street Bets community.&quot; </p>\n\n<p>This is one of the most concise points made in an article I&#39;ve read in a while, and they simply don&#39;t list any of the other catalysts for the stock. No mention of Cathie Woods accumulating shares, no mention of demo day on the horizon. No mention of the float structure and Mithril potentially buying the locked up shares. </p>\n\n<p>Seriously, who writes this stuff? It&#39;s almost like the chief editors of every financial publication agency are telling people to only write about WSB. This is really weird and it gives me the heebie jeebies. How can someone claiming to be a professional financial publication simply omits so many key facts about PLTR? Stuff seems borderline criminal. Anyone reading their article to get investment advice or info on PLTR got literally nothing. All they get is go check out <a href=\"/r/wallstreetbets\">r/wallstreetbets</a>. Who the fuck is paying these writers?</p>\n</div><!-- SC_ON -->",
  "score": 1543,
  "permalink": "/r/wallstreetbets/comments/l431h4/benzinga_claims_pltr_is_running_solely_because_of/",
  "subreddit": "wallstreetbets",
  "id": "l431h4",
  "is_self": true,
  "media": null,
  "is_video": false
}