{
  "author": "_ArtosisCurse_",
  "original_created_utc": 1636834746,
  "title": "Actually using your crypto is so much more fun than just owning it!",
  "created_utc": 1636921838,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like most investors in crypto i just held on to my coins on a nice and easy to use exchange until about four weeks ago, just watching the prices go up and down. I never really thought about actually using my coins, and what i should even do with them. </p>\n\n<p>This all changed when i started to learn more about NFTs. The tought of digital art on the blockchain made my very curious instantly. I decided to get a wallet and transfer my coins there to have more controll and to trade NFTs on Opensea. I heard a lot about gas fees before, but actually paying them changed my view completly and made me appreciate projects like polygon a lot more! I just recently sold my very first own NFT and got the payment straigt to my wallet (which was awesome!)! I also now can trade coins on exchanges like pancakeswap that i would never have gotten acess to on the small exchange i was using before.</p>\n\n<p>And honestly i couldn&#39;t be happier right now. Using crypto was so much more fun than i thought it would be and made me realize quiet a few things. I finally get the whole 1 BTC = 1 BTC thing, now that my coins are not on an exchange anymore where the constantly get compared to the dollar. If you, like me only invested into crypto so far, and have never really done anything with them you totally should try it out! It is much easier than you think and you will learn so much!</p>\n\n<p>I will now look more into staking some of my coins and have a renewed passion about crypto to continue learning. </p>\n\n<p>Thanks for reading this far :) Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/qt98mg/actually_using_your_crypto_is_so_much_more_fun/",
  "subreddit": "CryptoCurrency",
  "id": "qt98mg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like most investors in crypto i just held on to my coins on a nice and easy to\nuse exchange until about four weeks ago, just watching the prices go up and\ndown. I never really thought about actually using my coins, and what i should\neven do with them.\n\nThis all changed when i started to learn more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの暗号投資家と同様に、私も4週間前までは使いやすい取引所でコインを保有していました。\n4週間ほど前までは、使いやすい取引所にコインを置いて、価格が上がったり下がったりするのを見ていました。\n下がるのを見ていました。自分のコインを実際に使うことや、何をすべきかを考えたことはありませんでした。\n使ってどうするかなんて考えたこともありませんでした。\n\nそれが一変したのは、もっと勉強し始めてからです...",
      "title": "自分の暗号を実際に使ってみると、所有しているだけではなく、とても楽しいものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "像大多数加密货币的投资者一样，我只是把我的硬币放在一个很好的和容易的位置上。\n交易所，直到大约四周前，只是看着价格涨跌。\n跌。我从来没有真正想过真正使用我的硬币，以及我应该如何\n甚至用它们做什么。\n\n当我开始学习更多的知识时，这一切都改变了...",
      "title": "实际使用你的加密货币比仅仅拥有它要有趣得多!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像大多數加密貨幣的投資者一樣，我只是把我的硬幣放在一個很好的和容易的位置上。\n交易所，直到大約四周前，只是看着價格漲跌。\n跌。我從來沒有真正想過真正使用我的硬幣，以及我應該如何\n甚至用它們做什麼。\n\n當我開始學習更多的知識時，這一切都改變了...",
      "title": "實際使用你的加密貨幣比僅僅擁有它要有趣得多!"
    }
  ]
}