{
  "author": "Ponygirlfromthe80s",
  "original_created_utc": 1653611717,
  "title": "Is it bad to set a boundary that I do not want female friend to stay overnight at his house?",
  "created_utc": 1653631859,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My boyfriend has a long time female friend and when I first dated him she stayed overnight on and off at his house. I believe their relationship is completely platonic but they have a sexual past from years ago. I have no issues with them hanging out but her staying overnight even once in a while is not something I’m comfortable. Is it ok to tell him this and ask him to set a boundary to not allow her to continue this behavior? Or am I ask too much? We have been together 3 months and the idea of having to deal with this would make me even more uncomfortable in the future.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/TooAfraidToAsk/comments/uylt4e/is_it_bad_to_set_a_boundary_that_i_do_not_want/",
  "subreddit": "TooAfraidToAsk",
  "id": "uylt4e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "My boyfriend has a long time female friend and when I first dated him she stayed\novernight on and off at his house. I believe their relationship is completely\nplatonic but they have a sexual past from years ago. I have no issues with them\nhanging out but her staying overnight even once in a while…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の彼氏には長年の女友達がいて、私が初めて彼とデートした時、彼女はずっと\n彼の家に泊まったりしていました。二人の関係は完全にプラトニックなものだと思います。\nしかし、二人は数年前から性的な関係を持っています。私は彼らが付き合うことに何の問題もありません。\nをするのは問題ないのですが、彼女がたまにでも泊まるのは...。",
      "title": "女友達を彼の家に泊めたくないという境界線を作るのは悪いことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的男朋友有一个长期的女性朋友，当我第一次和他约会时，她一直在\n在他家断断续续过夜。我相信他们的关系是完全\n但他们在多年前就有一段性关系。我对他们的关系没有意见\n但她在他家过夜，即使偶尔一次......",
      "title": "设定一个界限，说我不希望女性朋友在他家过夜，这样做不好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的男朋友有一個長期的女性朋友，當我第一次和他約會時，她一直在\n在他家斷斷續續過夜。我相信他們的關係是完全\n但他們在多年前就有一段性關係。我對他們的關係沒有意見\n但她在他家過夜，即使偶爾一次......",
      "title": "設定一個界限，說我不希望女性朋友在他家過夜，這樣做不好嗎？"
    }
  ]
}