{
  "author": "Titan_Arum",
  "the_new_excerpt": "Wikipedia lists 32 annular lakes, of which 24 are north of the 49th parallel.\nFollow up question: why are 20 of them in just the three countries of Canada,\nFinland, and Sweden? What makes these countries more prone to annular lakes than\nothers? Do they account for the majority of land north of the…",
  "original_created_utc": 1620301499,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィキペディアには32の環状湖が掲載されていますが、そのうち24は49度線の北側にあります。\n続いての質問ですが、なぜカナダ、フィンランド、スウェーデンの3カ国だけで20個もの湖があるのでしょうか？\n疑問：なぜカナダ、フィンランド、スウェーデンの3カ国だけで20個もあるのか？なぜこれらの国は他の国よりも環状湖が発生しやすいのでしょうか？\n他の国よりも環状湖が発生しやすい理由は何でしょうか？北緯49度以北の陸地の大部分を占めているのでしょうか？",
      "title": "地球の陸地の約1/8しかないのに、地球の環状湖の75％が49度線より北にあるのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "维基百科列出了32个环形湖泊，其中24个在北纬49度线以北。\n追问：为什么其中20个只在加拿大、芬兰和瑞典这三个国家。\n芬兰和瑞典？是什么让这些国家比其他国家更容易出现环状湖泊？\n其他国家？它们是否占了北纬40度线以北的大部分土地？",
      "title": "为什么地球上75%的环形湖泊都在北纬49度线以北，而那里只占地球陆地面积的1/8左右？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "維基百科列出了32個環形湖泊，其中24個在北緯49度線以北。\n追問：爲什麼其中20個只在加拿大、芬蘭和瑞典這三個國家。\n芬蘭和瑞典？是什麼讓這些國家比其他國家更容易出現環狀湖泊？\n其他國家？它們是否佔了北緯40度線以北的大部分土地？",
      "title": "爲什麼地球上75%的環形湖泊都在北緯49度線以北，而那裏只佔地球陸地面積的1/8左右？"
    }
  ],
  "title": "Why are 75% of the earth's annular lakes north of the 49th parallel when only about 1/8 of the earth's land surface is there?",
  "created_utc": 1620337038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wikipedia lists 32 annular lakes, of which 24 are north of the 49th parallel. Follow up question: why are 20 of them in just the three countries of Canada, Finland, and Sweden? What makes these countries more prone to annular lakes than others? Do they account for the majority of land north of the 49th?</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/askscience/comments/n65cyz/why_are_75_of_the_earths_annular_lakes_north_of/",
  "subreddit": "askscience",
  "id": "n65cyz",
  "is_self": true,
  "media": null,
  "is_video": false
}