{
  "author": "pet2pet1982",
  "original_created_utc": 1650287332,
  "title": "It’s today: April 18 2022: withdraw all your crypto from all centralised exchanges",
  "created_utc": 1650346753,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This movement first originated in Monero community. The reason is most centralised exchanges don’t allow you to withdraw XMR under fake technical reasons. Meanwhile, XMR deposits are always welcome and available.&lt;/p&gt;\n\n&lt;p&gt;Later, users of other cryptos recognised they can’t withdraw their funds due to fake power of liquidity. Although anonymous cryptos are affected first, some time other types of crypto were touched.&lt;/p&gt;\n\n&lt;p&gt;This insane situation is made possible because large centralised exchanges trend to have fake liquidity at all. That’s because their economical nature is to generate profit dependent on your buy/sell operations: no buy/sell leads to no profit. &lt;/p&gt;\n\n&lt;p&gt;And because crypto exchanges are not properly regulated as traditional asset exchanges, they practice to simply generate inexistent “paper” coins. You can easily trade these coins but if you try to withdraw them, you fail.&lt;/p&gt;\n\n&lt;p&gt;Most corrupt exchanges in that sense of “paper” coins are Binance, Huobi and Poloniex. Please don’t use that exchanges at all in the future and prepare to migrate from them.&lt;/p&gt;\n\n&lt;p&gt;On April 18 2022, just try to withdraw all your crypto from all centralised exchanges and hence check whether exchanges of your choice do trade “paper” coins or not. If so, you can’t withdraw. Blacklist that exchanges and broadcast them to all your friends in all social media.&lt;/p&gt;\n\n&lt;p&gt;It is extremely easy experiment, just perform your own test!&lt;/p&gt;\n\n&lt;p&gt;If you ask where to migrate from Binance, Huobi and Poloniex, consider the following list:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://kycnot.me\"&gt;https://kycnot.me&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Upd. XMR/BTC &amp;gt; 0.006, as Monero community is the most active in April 18 event.&lt;/p&gt;\n\n&lt;p&gt;Upd. UTC 15:18 XMR 0.0065 @ $256. Make your XMR withdrawals from centralised exchanges on a per week basis! It works!!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/u6crmi/its_today_april_18_2022_withdraw_all_your_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "u6crmi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This movement first originated in Monero community. The reason is most\ncentralised exchanges don’t allow you to withdraw XMR under fake technical\nreasons. Meanwhile, XMR deposits are always welcome and available.\n\nLater, users of other cryptos recognised they can’t withdraw their funds due to\nfake…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この動きは、まずMoneroのコミュニティから始まりました。その理由は、ほとんどの\n中央集権的な取引所は、偽の技術的な理由でXMRを引き出すことを許さない。\nという理由があります。一方、XMRの入金はいつでも歓迎され、利用可能である。\n\nその後、他の暗号のユーザーも、以下の理由で資金を引き出せないことを認識した。\nフェイク...",
      "title": "今日なんです。2022年4月18日：すべての中央集権的な取引所からすべての暗号を撤回する。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这一运动首先起源于Monero社区。其原因是大多数\n大多数集中式交易所都不允许你以虚假的技术原因提取XMR\n原因。同时，XMR的存款永远是受欢迎的，可以使用的。\n\n后来，其他加密货币的用户认识到他们不能提取他们的资金，因为\n虚假的...",
      "title": "就是今天。2022年4月18日：从所有集中式交易所撤出你所有的加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這一運動首先起源於Monero社區。其原因是大多數\n大多數集中式交易所都不允許你以虛假的技術原因提取XMR\n原因。同時，XMR的存款永遠是受歡迎的，可以使用的。\n\n後來，其他加密貨幣的用戶認識到他們不能提取他們的資金，因爲\n虛假的...",
      "title": "就是今天。2022年4月18日：從所有集中式交易所撤出你所有的加密貨幣"
    }
  ]
}