{
  "author": "Gullible_Location705",
  "original_created_utc": 1641936882,
  "title": "what Powell said today",
  "created_utc": 1641969389,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;He said two less hawkish things today that apply to crypto (Yes, I actually listened to the entire stream).&lt;/p&gt;\n\n&lt;p&gt;The first and probably most specific to crypto is that he wasn&amp;#39;t against stablecoins continuing to exist even if they began to issue a CBDC USD-meaning there&amp;#39;s less of a threat that stablecoins would suddenly collapse from a ban which would be very destabilizing for the crypto ecosystem.&lt;/p&gt;\n\n&lt;p&gt;The second was that he (in passing) spoke of likely allowing bonds to expire off but he specified that this would probably be towards the end of the year-so this is basically quantitative tightening since they wouldn&amp;#39;t be continuing to hold the same amount of bonds since they wouldn&amp;#39;t be buying any more. I think there was some fear originally that they would start doing the rate hikes plus tightening all at once in March.&lt;/p&gt;\n\n&lt;p&gt;Of course overall he&amp;#39;s still talking about planning for at least 3 hikes this year plus the tightening so it&amp;#39;s not like he went all out in favor of easy money, but basically it wasn&amp;#39;t the worst case scenario that was driving a lot of fear in recent days.&lt;/p&gt;\n\n&lt;p&gt;Now I guess we wait patiently for the CPI numbers tomorrow-the two bullish scenarios for Bitcoin would be either lower than expected numbers causing the Fed to reduce the number of hikes or further delay tightening, or if the numbers are so freaking crazy that people think the Fed cannot control inflation at all. That said, I don&amp;#39;t think either are particularly super likely scenarios. If it comes in about what everyone is expecting or a little bit hotter then they&amp;#39;ll hike rates and tighten as planned. Whether that really is going to further impact Bitcoin is unclear-we&amp;#39;re already down 40% and while we&amp;#39;ve drawn down 80% in the past it&amp;#39;s also a much more mature asset class now and there&amp;#39;s global exposure so it&amp;#39;s not solely US policy driving price.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: Powell said stablecoins A-OK, will still hike rates soon but likely tightening not until Q3-Q4. Not worst case scenario feared.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/s1oa3l/what_powell_said_today/",
  "subreddit": "CryptoCurrency",
  "id": "s1oa3l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "He said two less hawkish things today that apply to crypto (Yes, I actually\nlistened to the entire stream).\n\nThe first and probably most specific to crypto is that he wasn't against\nstablecoins continuing to exist even if they began to issue a CBDC USD-meaning\nthere's less of a threat that…"
}