{
  "author": "JonSnow781",
  "the_new_excerpt": "There are currently only 1000 public comments on the regulation proposal\nrequiring identification for transactions between privately held wallets and\nexchanges.\n\nPlease submit additional comments to:\nhttps://beta.regulations.gov/document/FINCEN-2020-0020-0001\n\nI personally felt that I wasn't smart…",
  "original_created_utc": 1609440093,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "目前只有1000名公众对监管建议提出了意见\n要求对私人持有的钱包和交易所之间的交易进行识别。\n交易所之间的交易身份。\n\n请提交更多评论到。\nhttps://beta.regulations.gov/document/FINCEN-2020-0020-0001\n\n我个人觉得我并不聪明...",
      "title": "只有几天的时间来提交对可怕的FinCEN加密钱包条例的意见"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前只有1000名公衆對監管建議提出了意見\n要求對私人持有的錢包和交易所之間的交易進行識別。\n交易所之間的交易身份。\n\n請提交更多評論到。\nhttps://beta.regulations.gov/document/FINCEN-2020-0020-0001\n\n我個人覺得我並不聰明...",
      "title": "只有幾天的時間來提交對可怕的FinCEN加密錢包條例的意見"
    }
  ],
  "title": "Only a few more days to submit comments on terrible FinCEN crypto wallet regulation",
  "created_utc": 1609515721,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are currently only 1000 public comments on the regulation proposal requiring identification for transactions between privately held wallets and exchanges.</p>\n\n<p>Please submit additional comments to: <a href=\"https://beta.regulations.gov/document/FINCEN-2020-0020-0001\">https://beta.regulations.gov/document/FINCEN-2020-0020-0001</a></p>\n\n<p>I personally felt that I wasn&#39;t smart enough to write a comment, or that what I said wouldn&#39;t make a difference, but we have to fight for the future of this technology. Almost no one in the U.S. understands cryptocurrency, and an even smaller percentage know about this regulation proposal. Your comments matter on this proposal, if you don&#39;t comment no one else will.</p>\n\n<p>This is what I am going to write. I plan on sending it to my senators as well. Please provide editorial comments, as I&#39;d like it to be as bulletproof as possible. Feel free to steal it, or extrapolate and expand single points for your own comments.</p>\n\n<p>The proposed regulations will strike a massive blow to our personal right to privacy as well as create a major obstacle for innovation in the cryptocurrency and blockchain space.  Cryptocurrencies have the very real potential to be a world changing technological innovation, on the same scale or greater than the internet.  They will change the way the global economy functions, they will change banking and finance, they will create entirely new tools and technologies that we can&#39;t even imagine at this point in time.  This regulation not only stomps on the new growth of technological innovation, but turns a potentially beneficial tool into an authoritarian surveillance nightmare.  Cryptocurrency regulation can have drastic consequences on the competitiveness of our country technologically and economically and our personal freedoms. Regulation of this magnitude has absolutely no business being pushed through over a holiday while our country deals with a national emergency and a change of administration. Regulation of this magnitude really has no business being proposed at all from a small unelected branch of the government. On top of this, the vast majority of U.S. citizens have no understanding of what cryptocurrency is, let alone this regulation change happening behind the scenes that may have massive consequences on their future. </p>\n\n<p>Cryptocurrency regulation is necessary, but it needs to be delicate and precise, it needs to be written by people who understand that technology and it&#39;s future implications and potential. It needs to be done to spur innovation and keep the U.S. as a technological leader, not as a detriment to our native industries. Regulation should ultimately benefit our country and citizens, and help create financial independence and security, it should not be used as a tool of mass surveillance and destroy innovation. This regulation should be cancelled immediately, as it does far more harm than good.</p>\n\n<p>This new regulation proposes that all transactions between &quot;unhosted wallets&quot; (private citizen&#39;s wallets) over $3,000 in value require identification.  This means that a citizen cannot transact in amounts over $3,000 without government surveillance. In addition, most cryptocurrency transactions are recorded on a public ledger, so once a wallet&#39;s owner is identified none of their transactions, no matter how small, are anonymous. Effectively, this creates a tool that allows the government constant surveillance of all transactions.  The regulation claims it is &quot;consistent with existing requirements&quot;, but it is not whatsoever. If I go into a bank today and withdraw $10,000, yes the government will get a report of that, however they are not currently allowed to go watch how I spend every last dime of that money. Under these new regulations, as soon as &quot;wallet&quot; ownership is identified the government will have free reign to track the use of that wallet and how funds are spent indefinitely on the public blockchain ledger. Currently this level of surveillance would require a warrant, and for good reason.  We should not be giving up our right to privacy so easily, especially to a 15 day comment period piece of regulation that no one is aware of and no one understands the future implications of.</p>\n\n<p>This regulation also proposes that every cryptocurrency exchange and platform will be required to record a massive database of every person&#39;s private holdings, in addition the government will also control an even more comprehensive database of this information.  This is a massive honeypot to potential hackers, that has now been spread over many many institutions as well as the government to secure, allowing many vectors of attack and potential vulnerabilities.  This type of financial data, linked to addresses and identification, is a huge personal security threat to individuals.  Recently Ledger, a company that produces cryptocurrency hardware wallets, was hacked releasing similar information. Now people are being sent anonymous threats and blackmail telling them to send their crypto to the hackers. Compiling this type of data, especially between this many parties, should be avoided unless absolutely necessary as it significantly weakens protection of very important information that could affect the personal and financial security of citizens as well as their rights to privacy.</p>\n\n<p>Whoever wrote this regulation seems to also be completely ignorant of how many cryptocurrencies work.  One of the major technological innovations of cryptocurrencies is the development of &quot;smart contracts&quot;.  These programmable contracts allow individuals to work together with trustless contracts that do not require a third party and are executed automatically.  For instance, party A can submit a loan to party B with some sort of collateral, if Party B fails to pay per the contract the collateral in escrow can automatically be sent to party A without the need for lawyers, banks, or cops to get involved. This is just the tip of the iceberg of what is possible and these smart contracts have the potential to create huge efficiencies in certain industries and give individuals more agency and independence when conducting business. Under this new regulation, it is unclear how smart contracts can exist at all.  Smart contracts have wallet addresses that appear to be exactly the same as &quot;unhosted wallets&quot;, but they clearly have no identity or address to report. If you aren&#39;t legally allowed to interact with a smart contract, or if it requires significant hurdles and obstacles to use, you&#39;ve crushed part of the massive potential of this new technology.</p>\n\n<p>In addition, this regulation will require new crypto businesses millions of dollars to implement and additional time and energy.  Why are they being forced to provide surveillance over customers, on top of the AML/KYC identification rules they already have to follow? Why are we creating roadblocks for this budding industry before a real problem is even identified.</p>\n\n<p>What is the problem? Who has defined it? How bad is it? Cryptocurrency did not create money laundering, drug trade, and terrorism. This activity is as old as time and has existed under every governmental and financial system that has ever existed. Cryptocurrency may provide a tool for the bad guys, but it is just a tool and not a very good one at that. Most of these cryptocurrencies are recorded on a PUBLIC LEDGER, this alone creates the easiest system to watch that has ever existed. With chain analytics tools it is actually easier to track criminal transactions than ever before, as the government has free unfettered access to every single transaction that has ever happened on a public blockchain. They do not need to create rules that allow unwarranted surveillance of all citizens as they already have ample tools to track unwanted behavior.</p>\n\n<p>Additionally, cryptocurrencies with a public blockchain on centralized exchanges aren&#39;t even a problem. Cryptocurrencies already exist that are completely private, and transactions cannot be traced, tools like Decentralized Finance and atomic swaps already allow person to person cryptocurrency trade without a centralized entity to oversee the trade. No smart criminal is going to conduct business over public blockchains and exchanges (like Bitcoin and Ethereum) when every transaction is recorded publically, so this regulation creates mass surveillance without any clear &quot;need&quot;. Criminals will find a way to do business, they always have, we should not be instituting extremely harmful regulation that does absolutely nothing to stop this activity.</p>\n\n<p>Cryptocurrency is a green seedling of an unknown plant. It appears it could feed the world. It also appears it could contain a bit of poison. Like all new world changing technologies it has vast potential for good as well as bad, but it&#39;s just unrealized potential at this point and no one really knows how the world may be affected. Regulators feel it is their responsibility to stomp all around this plant, throw unknown fertilizers and poisons around it, water it with milk, dig it up and move it to the top of the mountain, who knows. Some of these people are well meaning, some of them are not, but almost no one actually knows what they are doing or the consequences and ramifications of their actions. If we as a country don&#39;t allow this technology to grow, someone else will, and we will be left behind as someone else carries the torch of progress. We need regulation for crypto to flourish, but it needs to be careful, well thought out, and minimal. It is better to under regulate this new industry, and deal with real problems as they arise, than to overregulate it and never see it flourish at all.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/knvhwb/only_a_few_more_days_to_submit_comments_on/",
  "subreddit": "CryptoCurrency",
  "id": "knvhwb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100743664
}