{
  "author": "learnandearnmyass",
  "original_created_utc": 1646139569,
  "title": "I am tired of Meta and mainstream social networking platforms and understand starting a new one is a herculean task. Need suggestions and feedback on starting one anyway.",
  "created_utc": 1646148531,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A little background, I am a software engineer fresh out of college. Never started a business, but I understand the technical aspects of starting a social networking platform. I understand the following challenges and difficulties:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Content Moderation.&lt;/li&gt;\n&lt;li&gt;Scaling and funds.&lt;/li&gt;\n&lt;li&gt;Security.&lt;/li&gt;\n&lt;li&gt;Saturated marketplace.&lt;/li&gt;\n&lt;li&gt;Internationalisation.&lt;/li&gt;\n&lt;li&gt;And a lot more.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Why do I still need to go for it? I have a zeal that I hate how mainstream networks are just data hoarding advertising space and not what it primarily focused on, &amp;quot;connecting people together&amp;quot;. Not everyone cares for privacy on a broader spectrum. I personally want to create a space that allows individuals to discover and connect with people and their content and generate revenue similar to DuckDuckGo, i.e that is through privacy-respecting advertisement, through keywords not tracking the user like sheep. I don&amp;#39;t want to become a unicorn or some sellout networking platform, I just want to earn enough resources to sustain my platform and maybe switch to my own infra (A very far fetched dream). I am want to become a fully transparent and ethically right company and will stand by it, if I mess things up, I&amp;#39;ll own them.&lt;/p&gt;\n\n&lt;p&gt;Few key features: Everything you do gets deleted after 24 hours, this does come with pros and cons but this is what I am aiming for, a privacy-focused, transparent, free platform for speech and discovering people.&lt;/p&gt;\n\n&lt;p&gt;I have a lot, I couldn&amp;#39;t cover please let me know and I am ready to have a civilised dialogue.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/t47dma/i_am_tired_of_meta_and_mainstream_social/",
  "subreddit": "SideProject",
  "id": "t47dma",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A little background, I am a software engineer fresh out of college. Never\nstarted a business, but I understand the technical aspects of starting a social\nnetworking platform. I understand the following challenges and difficulties:\n\n 1. Content Moderation.\n 2. Scaling and funds.\n 3. Security.\n 4.…"
}