{
  "author": "greytoc",
  "the_new_excerpt": "For those new to Reddit and to investing subreddits - many people often complain\nthat r/investing [/r/investing] mods are too draconian in removing posts and\ncomments.\n\nOne reason is that we often get posts from bots or stock promoters who are\nseeking to profit from pumping a stock or to create…",
  "original_created_utc": 1619097477,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Redditや投資系サブレディットに慣れていない人にとっては、r/investing [/r/investing]のmodがあまりにも強引に投稿を削除していることに不満を持つ人が多いです。\nr/investing [/r/investing]のmodsは投稿やコメントを削除する際にあまりにも強硬であると多くの人が訴えています。\nコメントを削除していると不満を持つ人が多いです。\n\nその理由の一つは、ボットや株のプロモーターからの投稿が多いことです。\nその理由の一つは、ボットや株のプロモーターからの投稿がよくあることです。",
      "title": "PSA：ストックプロモーションと疑わしい銘柄推奨"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些刚进入Reddit和投资子版块的人来说--许多人经常抱怨\n许多人经常抱怨r/investing[/r/investing]版主在删除帖子和评论时过于严厉。\n评论。\n\n其中一个原因是，我们经常收到来自机器人或股票推销员的帖子，他们正在\n谋求通过抽调股票获利或创造...",
      "title": "PSA：股票促销和可疑的股票推荐"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些剛進入Reddit和投資子版塊的人來說--許多人經常抱怨\n許多人經常抱怨r/investing[/r/investing]版主在刪除帖子和評論時過於嚴厲。\n評論。\n\n其中一個原因是，我們經常收到來自機器人或股票推銷員的帖子，他們正在\n謀求通過抽調股票獲利或創造...",
      "title": "PSA：股票促銷和可疑的股票推薦"
    }
  ],
  "title": "PSA: Stock promotion and suspicious stock recommendations",
  "created_utc": 1619102799,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those new to Reddit and to investing subreddits - many people often complain that <a href=\"/r/investing\">r/investing</a> mods are too draconian in removing posts and comments.</p>\n\n<p>One reason is that we often get posts from bots or stock promoters who are seeking to profit from pumping a stock or to create hype. You can sometimes identify if it&#39;s a bot or promoter simply by looking at the posters comment and post history. Often you will see that the account has posted nothing related to investing or trading but suddenly there is the same or varying versions of comments on one or two specific stocks. This morning - an account which only posted porn in the past to collect karma suddenly starts to post investing advice and stock recommendations.</p>\n\n<p>One other way to recognize suspicious posts is if the OP never engages in a discussion on comments and questions in the thread on their own dd. Those are all signs of stock promotion.</p>\n\n<p>If you are new to reddit <a href=\"/r/investing\">r/investing</a> - and you wish to post dd please see the wiki guidelines for appropriate dd here - <a href=\"https://www.reddit.com/r/investing/wiki/index/rules\">https://www.reddit.com/r/investing/wiki/index/rules</a></p>\n\n<p>[edit]</p>\n\n<p>For those interested in understanding a little more about stock promotion - one of the mods provided an AMA 8 years ago about a penny stock pump operation that he unwittingly became associated with  - you can find the AMA here - <a href=\"https://www.reddit.com/r/investing/comments/158vi7/i_used_to_be_a_penny_stock_promoter_in_the_late/\">https://www.reddit.com/r/investing/comments/158vi7/i_used_to_be_a_penny_stock_promoter_in_the_late/</a></p>\n</div><!-- SC_ON -->",
  "score": 1332,
  "permalink": "/r/investing/comments/mw4jei/psa_stock_promotion_and_suspicious_stock/",
  "subreddit": "investing",
  "id": "mw4jei",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214671
}