{
  "author": "StingerMcGee",
  "the_new_excerpt": "Given the events of the past week with Doge and XRP pump and dumps it’s clear\nthat we need to protect people within this community. Some have been in this\nspace for a lot longer than others and there’s been plenty of examples of scams\nthroughout the years and plenty people scammed with them.\n\nThe…",
  "original_created_utc": 1612254209,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于过去一周发生的Doge和XRP抽水机和转储事件，很明显的是\n我们需要保护这个社区的人。有些人已经在这个\n空间的时间比别人长很多，也有很多骗局的例子。\n多年来，有很多人用它们进行诈骗。\n\n这...",
      "title": "是时候出手保护这个社会了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於過去一週發生的Doge和XRP抽水機和轉儲事件，很明顯的是\n我們需要保護這個社區的人。有些人已經在這個\n空間的時間比別人長很多，也有很多騙局的例子。\n多年來，有很多人用它們進行詐騙。\n\n這...",
      "title": "是時候出手保護這個社會了。"
    }
  ],
  "title": "Time to step up and protect this community.",
  "created_utc": 1612265657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Given the events of the past week with Doge and XRP pump and dumps it’s clear that we need to protect people within this community. Some have been in this space for a lot longer than others and there’s been plenty of examples of scams throughout the years and plenty people scammed with them. </p>\n\n<p>The Doge pump last week angered me and you could see people getting excited and the inevitable was going to happen. A lot of new people got sucked into the prospect of quick, easy money and calls for calm fell on deaf ears.</p>\n\n<p>Then the same with XRP. I had friends calling me about it and asking advice and I told them exactly what I thought was going on, which transpired to be the case.  Lucky they took my advice and held off. </p>\n\n<p>There’s been a significant rise in new accounts shilling these days and it’s our responsibility to help ease new investors into the space. It’s frustrating watching the endless shill. Is there anything else that can be done to protect this space? Scamming people doesn’t bode well for the future of this society.</p>\n</div><!-- SC_ON -->",
  "score": 6815,
  "permalink": "/r/CryptoCurrency/comments/laqzt1/time_to_step_up_and_protect_this_community/",
  "subreddit": "CryptoCurrency",
  "id": "laqzt1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530882
}