{
  "author": "AlreadyLiberated",
  "the_new_excerpt": "OK people, strap in. First of all, let me assure you that everything below\nhappened exactly as I’ve written it. I’m a former journalist; I love chatting\nwith interesting people and kinda letting them talk. Today has left me shook,\nbut thoroughly entertained.\n\nSo, I’m in Las Vegas today on a post…",
  "original_created_utc": 1622590164,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よし、みんなベルトを締めよう。最初に断っておきますが、以下のことはすべて私が書いたとおりに\n私が書いた通りに起こったことです。私は元ジャーナリストで、面白い人とおしゃべりするのが好きです。\n興味深い人たちとおしゃべりするのが好きで、彼らに話をさせるのが好きなんです。今日は私を震え上がらせました。\nしかし、十分に楽しむことができました。\n\n私は今日、ラスベガスに滞在しています...",
      "title": "サトシの正体、アラン・グリーンスパンの秘策、250万ドルのビットコイン、そして著名なサイキックがあらゆるコインの未来の価値を予測するなど、現場からの報告です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好了，伙计们，系上安全带。首先，让我向你保证，下面的一切\n都是按照我所写的内容发生的。我曾是一名记者，我喜欢和人聊天。\n我喜欢和有趣的人聊天，让他们说话。今天让我感到震惊。\n但却得到了彻底的娱乐。\n\n所以，我今天在拉斯维加斯的一个职位...",
      "title": "一份来自现场的报告，涉及中本聪的真实身份，艾伦-格林斯潘的秘密计划，250万美元的比特币，以及一位知名的灵媒预测每个硬币的未来价值。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，夥計們，繫上安全帶。首先，讓我向你保證，下面的一切\n都是按照我所寫的內容發生的。我曾是一名記者，我喜歡和人聊天。\n我喜歡和有趣的人聊天，讓他們說話。今天讓我感到震驚。\n但卻得到了徹底的娛樂。\n\n所以，我今天在拉斯維加斯的一個職位...",
      "title": "一份來自現場的報告，涉及中本聰的真實身份，艾倫-格林斯潘的祕密計劃，250萬美元的比特幣，以及一位知名的靈媒預測每個硬幣的未來價值。"
    }
  ],
  "title": "A report from the field involving the real identity of Satoshi, Allan Greenspan’s secret plan, $2.5-million bitcoin, and a well-known psychic predicting the future value of every coin.",
  "created_utc": 1622607495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>OK people, strap in. First of all, let me assure you that everything below happened exactly as I’ve written it. I’m a former journalist; I love chatting with interesting people and kinda letting them talk. Today has left me shook, but thoroughly entertained. </p>\n\n<p>So, I’m in Las Vegas today on a post-Covid vacation with my wife and son. We hop in an a taxi to go to an arcade; my son wants to game, damnit.</p>\n\n<p>Driver asks me, “What do you do for a living?”</p>\n\n<p>I tell him I’m an author.</p>\n\n<p>He says, “I’m a writer too, but my book is only 25 pages. It’s about cryptocurrency.“</p>\n\n<p>I avoid talking much about crypto in real life, but I’m always interested in what people are thinking, and he says he’s writing a book. I lean forward as he turns out of Caesar’s Palace onto The Strip, “Interesting. Tell me more about that.“</p>\n\n<p>He drives strangely: a kind of herky-jerky, gas on, gas off, gas on, gas off, like a drummer in a band keeping the beat with his feet. </p>\n\n<p>He starts with the big reveal of his book: “Satoshi is 6-7 Asian guys.”</p>\n\n<p>I’m thinking, “Okay, I’ve heard that theory before,” but I don’t say anything. </p>\n\n<p>He goes on, “You’ll never guess who hired them. It’s a name you’ve heard.”</p>\n\n<p>The whole interaction is strange as hell already, but keep in mind, this guy is around 65, with a kind of washed-out face caked with spray tan that makes him look like a corpse ready for viewing. </p>\n\n<p>He stares right at me in the rearview—eyes nowhere near the road, but he gave up caring about roads long ago—“Allan Greenspan hired 6-7 Asian guys to create Bitcoin.”</p>\n\n<p>He goes on to explain that Greenspan—who was the Chairman of the Federal Reserve for 20 years, including the years just before Bitcoin’s launch—wanted Americans to be able to save money, given the weakening dollar. He was pissed about the financial crisis, so he hired the 6-7 Asian guys to create it. He concludes, “I’m not 100% sure about Greenspan, but the 6-7 Asians is definite.”</p>\n\n<p>“How do you know for sure about the 6-7 Asian guys?” I ask. </p>\n\n<p>He looks at me in the rearview again—missing a turn in the process, and says the following as though I’m the dumbest bastard on earth: “America’s best-known psychic, Michelle Whitedove. She’s sure of it.”</p>\n\n<p>I stare back to see if he’s trolling me, but he’s not. This guy is dead serious. </p>\n\n<p>So now I’m pretty curious. I mean, if I’m chatting with a psychic who knows the identity of the real Satoshi, what’s my next question gonna be? Same as his was: What coins will moon?</p>\n\n<p>“Get out your phone,” he says. “It doesn’t matter how much you have to start with. Take notes if you want to be a multi-millionaire in 5 years.”</p>\n\n<p>He goes on to tell me how the next few years will go, according to this psychic, staring me down after each sentence like he might shoot me if I don’t write it down. And as a former journalist, writing down batshit crazy quotes comes naturally, so I type as fast as I can. </p>\n\n<p>Here’s a small selection:</p>\n\n<p>“Anytime a currency starts with an X that’s a world currency. Buy as much as you can even if you have to live like a pauper. Why the hell do you think I’m driving this taxi?”</p>\n\n<p>“Most say Bitcoin will be half a million dollars. I have it from two good sources that it will be 1.5 to 2 million.” (I assume one source was the psychic. For the rest of my life I’ll regret not asking who the second was.)</p>\n\n<p>“Bitcoin Cash will be way bigger than Bitcoin.” (I asked whether he thought that was due to BCH becoming more of an everyday transaction coin, which I still wouldn’t agree with but at least it would have had a theory behind it. He shook his head like I was a tool. “Michelle Whitedove.”</p>\n\n<p>On Dogecoin: “shouldn’t be worth what it is but people love dogs and e-coins. So you take the word ‘dog’ and add an ‘e’ for ‘electronic’ and that’s why.”</p>\n\n<p>“XRP is going to at least $1200.”</p>\n\n<p>“Theta is is the big one. Combine Microsoft, Google, Apple and eBay. Bigger than that. Easy. It’s the Godzilla. It’s market cap will be 100x all those companies combined. Sell everything you own and put it in Theta.”</p>\n\n<p>“Stellar Lumens. Easy 10,000x. Imagine buying the whole internet. Ethereum is dead. XLM was at 5 cents on March 3 and already at a dollar.” (Spoiler alert: neither of those prices are even close to correct).</p>\n\n<p>Toward the end I asked him about Cardano, just because it was the biggest coin he hadn’t talked about. “I don’t have time to research everything.”</p>\n\n<p>When we got to the arcade after another few wrong turns, he didn’t want me to leave. He was staring at my phone just to make sure I’d captured his words. I thanked him for the advice and stepped out into the 105-degree heat and asked my wife, “Should we drop all our savings on Theta?”</p>\n\n<p>We got pretty lucky at the arcade. Won a lot of tickets. Exchanged tickets for some toys. </p>\n\n<p>TLDR: Las Vegas cabbie and well-known psychic are bullish.</p>\n</div><!-- SC_ON -->",
  "score": 805,
  "permalink": "/r/CryptoCurrency/comments/nq7pba/a_report_from_the_field_involving_the_real/",
  "subreddit": "CryptoCurrency",
  "id": "nq7pba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297951
}