{
  "author": "a_critical_inspector",
  "the_new_excerpt": "Gödel on Wittgenstein:\n\n> It is indeed clear from the passage that you cite that Wittgenstein did not\n> understand my Theorem (or that he pretended not to understand it). He\n> interprets it as a kind of logical paradox, while in fact it is just the\n> opposite, namely a mathematical theorem within an…",
  "original_created_utc": 1618071073,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Gödel on Wittgenstein:\n\n> ウィトゲンシュタインが私の定理を理解していなかった（あるいは理解していないふりをしていた）ことは、あなたが引用した文章からも明らかです。\n> 私の定理を理解していなかった（あるいは、理解していないふりをしていた）ことは、あなたが引用した文章から明らかです。彼は\n> 彼はそれを一種の論理的なパラドックスとして解釈していますが、実際にはそれは単なる\n> 実際にはその反対で、つまり、「...の中の数学的定理」なのです。",
      "title": "ウィトゲンシュタインが自分の不完全性定理を理解していないと言ったゲーデルは正しかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哥德尔论维特根斯坦。\n\n>从你引用的那段话中可以看出，维特根斯坦并没有：\n>理解我的定理（或者说他假装不理解）。他\n> 将其解释为一种逻辑悖论，而事实上它只是一种逻辑悖论。\n>相反，即数学定理中的一个...。",
      "title": "哥德尔说维特根斯坦不理解他的不完全性定理是对的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "哥德爾論維特根斯坦。\n\n>從你引用的那段話中可以看出，維特根斯坦並沒有：\n>理解我的定理（或者說他假裝不理解）。他\n> 將其解釋爲一種邏輯悖論，而事實上它只是一種邏輯悖論。\n>相反，即數學定理中的一個...。",
      "title": "哥德爾說維特根斯坦不理解他的不完全性定理是對的嗎？"
    }
  ],
  "title": "Was Gödel right to say that Wittgenstein didn't understand his incompleteness theorems?",
  "created_utc": 1618155719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Gödel on Wittgenstein:</p>\n\n<blockquote>\n<p>It is indeed clear from the passage that you cite that Wittgenstein did not understand my Theorem (or that he pretended not to understand it). He interprets it as a kind of logical paradox, while in fact it is just the opposite, namely a mathematical theorem within an absolutely uncontroversial part of mathematics (finitary number theory or combinatorics).</p>\n</blockquote>\n\n<p>I assume experts have analyzed this dispute, was Gödel correct?</p>\n\n<p>Follow-up question: I often see Wittgenstein described as a philosopher and logician, as someone &#39;working on logic&#39; and so on, he also spoke about the joy of solving math puzzles for fun, and enjoys this &quot;logical positivism&quot; sciency flair, people quote his comments on logic and math etc. But I find it very difficult to find any tractable contributions of W to formal logic, or really just any evidence of his competence in this field other than Russell saying he&#39;s clever. As far as I know he never proved a theorem, had no significant formal education in mathematical logic, and has no noteworthy contributions to logic. With Gödel, on top of this, thinking he didn&#39;t understand his results (which are now taught to undergraduate students), does this cast some doubt on the characterization of Wittgenstein as a logician? If he couldn&#39;t understand Gödel&#39;s results, do his thoughts on logic and math come from a place of sufficient competence and knowledge?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/mo7l65/was_gödel_right_to_say_that_wittgenstein_didnt/",
  "subreddit": "askphilosophy",
  "id": "mo7l65",
  "is_self": true,
  "media": null,
  "is_video": false
}