{
  "author": "Kolibri8",
  "original_created_utc": 1630863857,
  "title": "Apparently, German- and English-speaking historians do not agree on the Identity of Cleopatra's mother. Why?",
  "created_utc": 1630869397,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Question of Cleopatra&#39;s ancestry is a question that is quite often &quot;discussed&quot; on the internet, may it be here on Reddit or on other websites. Generally people tend to point out, that Cleopatra was Greek, and not Egyptian.</p>\n\n<p>Now, the thing is, I study history at a University in Germany, and I actually had to do a presentation on Cleopatra VII some semesters ago. But from what I remember, when I did my research, reading German language books on Cleopatra, German historians, at least those that I&#39;ve read, all seem to follow the Theory that Cleopatra&#39;s mother is unknown but presumably was an Egyptian noblewoman probably from the priesthood of Memphis. Which would make Cleopatra VII approximately half-Egyptian.</p>\n\n<p>With this in mind, I wondered why people would tend to say, that Cleopatra was fully Greek, so I checked the English language Wikipedia article on Cleopatra VII, and the theory of an Egyptian mother is nowhere mentioned, instead Cleopatra V/VI is mentioned as the presumed mother.</p>\n\n<p>Now this Egyptian-Mother-Theory was apparently put up by German Historian Werner Huß in 1990, at least his article &quot;Die Herkunft der Kleopatra Philopator&quot; (published in &quot;Aegyptus&quot; No. 70, <a href=\"https://www.jstor.org/stable/41216791?refreqid=excelsior%3A87b4bdd812bdca5ef4798b1ccae19a44&amp;seq=1#metadata_info_tab_contents\">p. 191–203</a>) is cited in the German Wikipedia article. Christoph Schäfer&#39;s Biography of Cleopatra from 2006 follows Huß&#39; Theory of an Egyptian mother, and I think that is the latest scientific Biography written by a German Historian.</p>\n\n<p>So I&#39;m wondering: Why is there such a discrepancy between German and English Historians? Has Huß&#39; Theory just not spread outside of Germany, or was it discarded by English-speaking historians, or is the English Wikipedia article just bad for not mentioning it?</p>\n</div><!-- SC_ON -->",
  "score": 150,
  "permalink": "/r/AskHistorians/comments/pihm6d/apparently_german_and_englishspeaking_historians/",
  "subreddit": "AskHistorians",
  "id": "pihm6d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Question of Cleopatra's ancestry is a question that is quite often\n\"discussed\" on the internet, may it be here on Reddit or on other websites.\nGenerally people tend to point out, that Cleopatra was Greek, and not Egyptian.\n\nNow, the thing is, I study history at a University in Germany, and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クレオパトラの祖先の問題は、インターネット上でよく「議論」されている問題です。\nこのRedditでも他のサイトでも、インターネット上でよく「議論」される質問です。\n一般的には、クレオパトラはエジプト人ではなく、ギリシャ人であると指摘されがちです。\n\nさて、私はドイツの大学で歴史を学んでいますが、その中で...",
      "title": "クレオパトラの母親の正体について、ドイツ語圏と英語圏の歴史家の意見は一致していないようです。なぜでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "克利奥帕特拉的祖先问题是一个经常被问及的问题\n在互联网上经常被 \"讨论\"，不管是在Reddit还是在其他网站。\n一般来说，人们倾向于指出，克利奥帕特拉是希腊人，而不是埃及人。\n\n现在的问题是，我在德国的一所大学学习历史，而我...",
      "title": "显然，德语和英语的历史学家对埃及艳后的母亲的身份并不认同。为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "克利奧帕特拉的祖先問題是一個經常被問及的問題\n在互聯網上經常被 \"討論\"，不管是在Reddit還是在其他網站。\n一般來說，人們傾向於指出，克利奧帕特拉是希臘人，而不是埃及人。\n\n現在的問題是，我在德國的一所大學學習歷史，而我...",
      "title": "顯然，德語和英語的歷史學家對埃及豔后的母親的身份並不認同。爲什麼呢？"
    }
  ]
}