{
  "author": "Raiwist",
  "original_created_utc": 1631823821,
  "title": "Which project did you invest in which is now dead?",
  "created_utc": 1631844702,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Which project were you invested in which no longer exists or has fallen so far it might as well be considered dead? One in which your investment has dwindled so much and so close to zero, it&#39;s not worth the effort to sell and recoup what you have left?</p>\n\n<p>I&#39;ve invested in a lot of crap stocks over the years which went spectacularly wrong - went &#39;tits-up&#39;, so to speak, and are now effectively worthless; but during my short time in crypto I&#39;ve more or less managed to avoid these types of investments (or at least jumped ship before the crashing and the burning began).</p>\n\n<p>What project did you invest in which is now defunct, or effectively worthless?</p>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/CryptoCurrency/comments/pplaz1/which_project_did_you_invest_in_which_is_now_dead/",
  "subreddit": "CryptoCurrency",
  "id": "pplaz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Which project were you invested in which no longer exists or has fallen so far\nit might as well be considered dead? One in which your investment has dwindled\nso much and so close to zero, it's not worth the effort to sell and recoup what\nyou have left?\n\nI've invested in a lot of crap stocks over the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたが投資していたプロジェクトで、今はもう存在しないものや、大きく落ち込んでしまったものはありますか？\nもう存在しないか、死んだも同然になってしまったプロジェクトは？あなたの投資が減少しているもの\nあなたの投資があまりにも減少し、ゼロに近づいているため、売却して残ったものを回収する努力をする価値がないもの。\n残っているものを回収するために努力する価値がないもの？\n\n私はこれまで、たくさんのクソ株に投資してきた。",
      "title": "あなたが投資したプロジェクトの中で、今は亡きプロジェクトは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你投资的哪个项目已经不存在了，或者已经跌落到如此地步\n它可能被认为是死的？一个你的投资已经减少了\n如此之多，接近于零，不值得努力去卖掉并收回你剩下的东西？\n你剩下的钱？\n\n在过去，我投资了很多垃圾股票。",
      "title": "你投资的哪个项目现在已经死了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你投資的哪個項目已經不存在了，或者已經跌落到如此地步\n它可能被認爲是死的？一個你的投資已經減少了\n如此之多，接近於零，不值得努力去賣掉並收回你剩下的東西？\n你剩下的錢？\n\n在過去，我投資了很多垃圾股票。",
      "title": "你投資的哪個項目現在已經死了？"
    }
  ]
}