{
  "author": "AXdssd5as",
  "the_new_excerpt": "As far as I can see, one of the arguments that is used to sell the idea of\nBitcoin is that unlike gold, and fiat currency I guess, it has a finite amount\nof it theoretically possible and useful (minus whatever gets lost or hidden),\nhence it is considered some kind of store of value relative to fiat…",
  "original_created_utc": 1609758879,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，用来推销\n比特币与黄金和法定货币不同，我想它的金额是有限的。\n在理论上是可能的和有用的(减去任何丢失或隐藏的东西)，\n因此，它被认为是相对于菲亚特…的某种价值存储",
      "title": "“比特币”的供给真的是有限的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，用來推銷\n比特幣與黃金和法定貨幣不同，我想它的金額是有限的。\n在理論上是可能的和有用的(減去任何丟失或隱藏的東西)，\n因此，它被認爲是相對於菲亞特…的某種價值存儲",
      "title": "“比特幣”的供給真的是有限的嗎？"
    }
  ],
  "title": "Is the supply of \"Bitcoin\" actually finite?",
  "created_utc": 1609796403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As far as I can see, one of the arguments that is used to sell the idea of Bitcoin is that unlike gold, and fiat currency I guess, it has a finite amount of it theoretically possible and useful (minus whatever gets lost or hidden), hence it is considered some kind of store of value relative to fiat currencies which can be printed endlessly.</p>\n\n<p>Is this actually true though? Isn&#39;t it possible to either:</p>\n\n<p>a) Infinitely divide bitcoins into smaller and smaller units of exchange, sort of the opposite of hyper-inflation.</p>\n\n<p>b) Can&#39;t you come up with an ever-increasing number of &#39;versions&#39; of Bitcoin, i.e. other cryptocurrencies that utilize virtually identically underlying technology, and even if they too have a limit to how much of them can be mined, if you can just keep on inventing a new one and a new one after that, for which there would obviously be a profit motive, then what is the actual difference?</p>\n</div><!-- SC_ON -->",
  "score": 97,
  "permalink": "/r/investing/comments/kq6q6e/is_the_supply_of_bitcoin_actually_finite/",
  "subreddit": "investing",
  "id": "kq6q6e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100747522
}