{
  "author": "UnexperiencedIT",
  "original_created_utc": 1642412534,
  "title": "Yes, we are early in crypto. But not \"$1000 in BTC will make me a millionaire\" early.",
  "created_utc": 1642434314,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Saying that we are early in crypto is not totally true if you are a new investor thinking that with $1000 in BTC you will become a millionaire in next couple of years. We are not that early, and I hate when people are leaving that imperssion on new investors.&lt;/p&gt;\n\n&lt;p&gt;We are early from perspective of crypto and blockchain as a technology that can really change some things in nowadays financial world and world as a whole.&lt;/p&gt;\n\n&lt;p&gt;However holding coins that are standing strong like BTC and ETH in this highly volatile market is lowering your risk and in some way saving your money because they will stick with us for a long time. &lt;/p&gt;\n\n&lt;p&gt;But you are not late. &lt;/p&gt;\n\n&lt;p&gt;If you invested in any top10 coins in the begining of 2021 you would be in profit in each of it, even BCH.&lt;/p&gt;\n\n&lt;p&gt;Also if you invested last year in coins like MATIC, FTM, SOL and held it, your profits would go x1000.&lt;/p&gt;\n\n&lt;p&gt;You need to be very smart and very lucky to choose a right coin with a good project and after you do that you need to hold it while it goes up and that is a thing of masterpiece. But no, you won&amp;#39;t get rich with $1000 in BTC, we are not that early.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/s60856/yes_we_are_early_in_crypto_but_not_1000_in_btc/",
  "subreddit": "CryptoCurrency",
  "id": "s60856",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Saying that we are early in crypto is not totally true if you are a new investor\nthinking that with $1000 in BTC you will become a millionaire in next couple of\nyears. We are not that early, and I hate when people are leaving that imperssion\non new investors.\n\nWe are early from perspective of…"
}