{
  "author": "Basic_Bridge_8177",
  "the_new_excerpt": "Staking is a phenomenal way for the average person to make money. By staking you\nare 1. Contributing to something bigger then you and most importantly 2. You\nwill make as much as if you were invested in an ETF in the stock market. Yes the\nprice of the coin can go down which is a notable risk factor.…",
  "original_created_utc": 1620378711,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ステイキングは、一般の人がお金を稼ぐための驚異的な方法です。ステイキングをすることで\n1. そして最も重要なことは、2.\n株式市場でETFに投資したのと同じくらいの利益を得ることができます。そうです。\nコインの価格が下がることがありますが、これは重要なリスク要因です....",
      "title": "\"人にステーキを与えれば一日は食べられるが、人に杭を教えれば永遠に食べられる\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "赌注对普通人来说是一种惊人的赚钱方式。通过押注，你可以\n是1。贡献给比你更大的东西，最重要的是2。\n你赚的钱就像你投资于股市的ETF一样多。是的\n币的价格可能下降，这是一个显著的风险因素....。",
      "title": "\"给人一块牛排，他可以吃一天，但教人打桩，他可以吃一辈子\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "賭注對普通人來說是一種驚人的賺錢方式。通過押注，你可以\n是1。貢獻給比你更大的東西，最重要的是2。\n你賺的錢就像你投資於股市的ETF一樣多。是的\n幣的價格可能下降，這是一個顯著的風險因素....。",
      "title": "\"給人一塊牛排，他可以喫一天，但教人打樁，他可以喫一輩子\""
    }
  ],
  "title": "“Give a man a steak and he will eat for a day but teach a man to stake and he will eat forever”",
  "created_utc": 1620391114,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Staking is a phenomenal way for the average person to make money. By staking you are 1. Contributing to something bigger then you and most importantly 2. You will make as much as if you were invested in an ETF in the stock market. Yes the price of the coin can go down which is a notable risk factor. However, staking the right coin is a very great opportunity which everyone should at least look into.</p>\n</div><!-- SC_ON -->",
  "score": 9615,
  "permalink": "/r/CryptoCurrency/comments/n6ubjb/give_a_man_a_steak_and_he_will_eat_for_a_day_but/",
  "subreddit": "CryptoCurrency",
  "id": "n6ubjb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988845
}