{
  "author": "chance_waters",
  "original_created_utc": 1624352790,
  "title": "Please do your part and don't engage with USDT",
  "created_utc": 1624366574,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s that simple, the actual market cap of USDT isn&#39;t as large of a problem as the sheer volume of trade facilitated through it, the competitors are well over 50% of it&#39;s market cap now (and expanding rapidly as people cotton on to the fact it&#39;s a Ponzi).</p>\n\n<p>If given an option to buy in with an alt rather than USDT, or to trade directly via FIAT, please take that option. Please don&#39;t store your value in USDT, please use audited competitors like USDC. </p>\n\n<p>Not only will this make it harder for them to mint more USDT due to falling demand, but it will also assist in minimising any potential bank run (if one occurs).</p>\n</div><!-- SC_ON -->",
  "score": 2872,
  "permalink": "/r/CryptoCurrency/comments/o5inle/please_do_your_part_and_dont_engage_with_usdt/",
  "subreddit": "CryptoCurrency",
  "id": "o5inle",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's that simple, the actual market cap of USDT isn't as large of a problem as\nthe sheer volume of trade facilitated through it, the competitors are well over\n50% of it's market cap now (and expanding rapidly as people cotton on to the\nfact it's a Ponzi).\n\nIf given an option to buy in with an alt…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "USDTの実際の時価総額は、それほど大きな問題ではありません。\nUSDTを介して行われる膨大な取引量が問題なのです。\n競合他社は現在、時価総額の50％をはるかに超えています（そして、人々がそれがネズミ講であるという事実に気づくにつれ、急速に拡大しています）。\n競合他社は現在、時価総額の50％をはるかに超えています。)\n\nもし、アルトで購入するという選択肢があれば...。",
      "title": "自分の役割を果たし、USDTに関わらないようにしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就是这么简单，USDT的实际市值并不是一个大问题，因为通过它促成的交易量很大。\n通过它促进的交易量，竞争对手远远超过了\n竞争对手现在已经超过其市值的50%（并且随着人们对它是庞氏骗局的认识而迅速扩大）。\n随着人们意识到这是一个庞氏骗局的事实，它正在迅速扩大）。)\n\n如果给你一个选择，让你用另一种方式购买...",
      "title": "请做好自己的工作，不要与USDT打交道"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就是這麼簡單，USDT的實際市值並不是一個大問題，因爲通過它促成的交易量很大。\n通過它促進的交易量，競爭對手遠遠超過了\n競爭對手現在已經超過其市值的50%（並且隨着人們對它是龐氏騙局的認識而迅速擴大）。\n隨着人們意識到這是一個龐氏騙局的事實，它正在迅速擴大）。)\n\n如果給你一個選擇，讓你用另一種方式購買...",
      "title": "請做好自己的工作，不要與USDT打交道"
    }
  ]
}