{
  "author": "dado3",
  "original_created_utc": 1635446855,
  "title": "What's up with the markets? It's a fight over $3B in expiring options",
  "created_utc": 1635460438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Depending on where the price ends up, option sellers may be out a whole lot of money. The higher the price goes, the more money they&#39;re out.</p>\n\n<p>Option sellers are engaged in a furious battle to push prices down as much as possible before the end of the week. Obviously, the people on the other side of that equation want the opposite.</p>\n\n<p>Strap in.</p>\n\n<p>Here are some extra characters because 500 is a ridiculous amount of characters to require in a post. It encourages this type of extraneous work just to make character counts.</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/qhtqf4/whats_up_with_the_markets_its_a_fight_over_3b_in/",
  "subreddit": "CryptoCurrency",
  "id": "qhtqf4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Depending on where the price ends up, option sellers may be out a whole lot of\nmoney. The higher the price goes, the more money they're out.\n\nOption sellers are engaged in a furious battle to push prices down as much as\npossible before the end of the week. Obviously, the people on the other side…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "価格がどこに落ち着くかによって、オプションの売り手は大損することになります。\nお金を失うことになります。価格が上がれば上がるほど、彼らが失う金額は大きくなります。\n\nオプションの売り手は、週明けまでに少しでも価格を下げようと、激しい戦いを繰り広げています。\n週明けまでに少しでも価格を下げようと激しい戦いを繰り広げている。もちろん、反対側の人たちは...。",
      "title": "マーケットはどうなっている？30億ドルの期限切れオプションをめぐる争いです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据价格的最终走向，期权卖家可能会损失一大笔钱。\n钱。价格越高，他们出的钱就越多。\n\n期权卖家正在进行一场激烈的战斗，以尽可能多地推低价格\n尽可能在本周结束前推低价格。很明显，另一边的人...",
      "title": "市场怎么了？这是一场关于30亿美元到期期权的斗争"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據價格的最終走向，期權賣家可能會損失一大筆錢。\n錢。價格越高，他們出的錢就越多。\n\n期權賣家正在進行一場激烈的戰鬥，以儘可能多地推低價格\n儘可能在本週結束前推低價格。很明顯，另一邊的人...",
      "title": "市場怎麼了？這是一場關於30億美元到期期權的鬥爭"
    }
  ]
}