{
  "author": "anonamonkey",
  "the_new_excerpt": "I used to care. I used to watch charts all the time. I used to try to time and\nbuy the dips. But not anymore. I just don’t care anymore. It just isn’t worth\nthe time. There are too many things to do in the real world. Bitcoin is a long\nterm play and I will never understand why I had invested so much…",
  "original_created_utc": 1619189926,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前は気にしていました。以前は常にチャートを見ていました。タイミングを見計らって、ディップを買おうとしたものです。\nディップを買おうとしていました。でも今は違います。もうどうでもいいんです。時間をかける価値がありません。\n時間をかける価値がない。現実の世界ではやるべきことが多すぎます。ビットコインは長期的なものです。\nなぜあんなに投資したのか理解できません...。",
      "title": "私は完全に麻痺しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经关心过。我过去一直在看图表。我曾经试图把握时机并\n买入低点。但现在不一样了。我只是不再关心了。它只是不值得\n的时间。在现实世界中有太多的事情要做。比特币是一个长期\n我永远不会明白为什么我投资了这么多......",
      "title": "我已经完全麻木了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經關心過。我過去一直在看圖表。我曾經試圖把握時機並\n買入低點。但現在不一樣了。我只是不再關心了。它只是不值得\n的時間。在現實世界中有太多的事情要做。比特幣是一個長期\n我永遠不會明白爲什麼我投資了這麼多......",
      "title": "我已經完全麻木了"
    }
  ],
  "title": "I am completely numb",
  "created_utc": 1619253109,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I used to care. I used to watch charts all the time. I used to try to time and buy the dips. But not anymore. I just don’t care anymore. It just isn’t worth the time. There are too many things to do in the real world. Bitcoin is a long term play and I will never understand why I had invested so much time obsessing over the price on a daily basis, even after understanding it is a long term play. It was like a drug, an obsession with money and value. But today is different. I literally don’t care about the price. The apathy has sunk in. I am numb. I will always hodl. But I don’t care about the price. I had forgotten that time is the most important resource we have, and Bitcoin was the thing that reminded me.</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/Bitcoin/comments/mwx5nu/i_am_completely_numb/",
  "subreddit": "Bitcoin",
  "id": "mwx5nu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776204237
}