{
  "author": "SweetPie123",
  "the_new_excerpt": "Since the price of Moons have risen quite a lot over the past few months I and\nothers have become less comfortable with having a number next to my name that\nrepresents quite a lot of value. Reddit officially states Moons don't have\nvalue, but at this point I don't think anyone can deny they do.\n\nThe…",
  "original_created_utc": 1613606564,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "由于在过去的几个月里，月亮的价格上涨了不少，我和。\n别人对我的名字旁边有一个数字就不太舒服了，那就是......。\n代表着相当大的价值。Reddit官方表示，Moons没有\n价值，但在这一点上，我不认为任何人都可以否认他们做。\n\n这...",
      "title": "让月球平衡的可见性成为可选项"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於在過去的幾個月裏，月亮的價格上漲了不少，我和。\n別人對我的名字旁邊有一個數字就不太舒服了，那就是......。\n代表着相當大的價值。Reddit官方表示，Moons沒有\n價值，但在這一點上，我不認爲任何人都可以否認他們做。\n\n這...",
      "title": "讓月球平衡的可見性成爲可選項"
    }
  ],
  "title": "Make Moon balance visibility optional",
  "created_utc": 1613644652,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since the price of Moons have risen quite a lot over the past few months I and others have become less comfortable with having a number next to my name that represents quite a lot of value. Reddit officially states Moons don&#39;t have value, but at this point I don&#39;t think anyone can deny they do.</p>\n\n<p>The idea is quite simple, make Moon balance visibility optional. This could be implemented in the Vault as a setting or in any other way Moon devs seem to be the best solution.</p>\n\n<p><strong>Pros:</strong></p>\n\n<p>- Safety; it&#39;s common in cryptocurrency not to disclose your holdings as it makes you an easy target.</p>\n\n<p>- less unwanted messages; there are people who slide into DM&#39;s to ask for Moons, not cool.</p>\n\n<p>- More equality; some people tend to believe opinions more from people with a lot of Moons, but More Moons doesn&#39;t equal more knowledge.</p>\n\n<p><strong>Cons:</strong></p>\n\n<p>- harder to separate beginners more experienced holders; People that have more Moons tend to be here longer and might have greater common knowledge about their coin and investing altogether.</p>\n\n<p>(if you have more pros and cons, feel free to share them with me)</p>\n\n<p><a href=\"https://www.reddit.com/poll/lm8kf4\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 485,
  "permalink": "/r/CryptoCurrency/comments/lm8kf4/make_moon_balance_visibility_optional/",
  "subreddit": "CryptoCurrency",
  "id": "lm8kf4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332875928
}