{
  "author": "xxsneakyduckxx",
  "original_created_utc": 1628433219,
  "title": "How much, if at all, have covid vaccines been improved since public release?",
  "created_utc": 1628518799,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This question applies to the vaccines available to the public. Are we still on version 1.0? Have formulas been improved as more variants are researched? Have we even made it to 1.0 considering that they were released under emergency release guidelines?</p>\n\n<p>Here in the US I only hear about Pfizer, AstraZeneca, and J&amp;J. What are other promising vaccines and how do they stack up to the 3 I mentioned? Are other less reputable countries, like China and Russia, reporting advances in their vaccines and has anyone been able to verify the claims?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askscience/comments/p0fpzp/how_much_if_at_all_have_covid_vaccines_been/",
  "subreddit": "askscience",
  "id": "p0fpzp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This question applies to the vaccines available to the public. Are we still on\nversion 1.0? Have formulas been improved as more variants are researched? Have\nwe even made it to 1.0 considering that they were released under emergency\nrelease guidelines?\n\nHere in the US I only hear about Pfizer,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、一般に公開されているワクチンに当てはまります。私たちはまだ\nバージョン1.0のままですか？より多くの種類が研究され、処方は改善されましたか？はたして\n緊急リリースのガイドラインに沿ってリリースされたことを考えると、1.0にさえなっていないのでは？\n緊急リリースのガイドラインに基づいてリリースされたことを考えると、1.0にさえなっていないのでしょうか？\n\nアメリカでは、ファイザーや...という話しか聞きません。",
      "title": "covid vaccineは公開後、どの程度改良されたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题适用于向公众提供的疫苗。我们是否仍处于\n1.0版本？随着更多变种的研究，配方是否得到了改进？我们是否已经\n考虑到这些疫苗是在紧急状态下发布的，我们甚至已经达到了1.0版本？\n发布指南？\n\n在美国，我只听说过辉瑞，...",
      "title": "自公开发布以来，covid疫苗的改进程度如何（如果有的话）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題適用於向公衆提供的疫苗。我們是否仍處於\n1.0版本？隨着更多變種的研究，配方是否得到了改進？我們是否已經\n考慮到這些疫苗是在緊急狀態下發布的，我們甚至已經達到了1.0版本？\n發佈指南？\n\n在美國，我只聽說過輝瑞，...",
      "title": "自公開發布以來，covid疫苗的改進程度如何（如果有的話）？"
    }
  ]
}