{
  "author": "nevermindgoodbye",
  "the_new_excerpt": "This is definitely something that’s been on my mind for years now. I can say\nthat I am less ignorant on the subject of race than I was in 2010, but, this\nparticular set of thoughts always bother me.\n\nFor starters, I think I should say I’m a very anxious person with severe social\nanxiety, I live in a…",
  "original_created_utc": 1614623648,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这绝对是我多年来一直在思考的问题。我可以说\n我在种族问题上的无知比2010年要少，但是，这也是我的责任。\n特别的一系列想法总是困扰着我。\n\n首先，我想我应该说我是一个非常焦虑的人，有严重的社交。\n焦虑，我住在... ...",
      "title": "为什么感觉对白人如此缺乏同情心，而对每个人都要有同理心？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這絕對是我多年來一直在思考的問題。我可以說\n我在種族問題上的無知比2010年要少，但是，這也是我的責任。\n特別的一系列想法總是困擾着我。\n\n首先，我想我應該說我是一個非常焦慮的人，有嚴重的社交。\n焦慮，我住在... ...",
      "title": "爲什麼感覺對白人如此缺乏同情心，而對每個人都要有同理心？"
    }
  ],
  "title": "Why does it feel like there is such a lack of empathy for white people while they are expected to be empathetic towards everyone?",
  "created_utc": 1614639038,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is definitely something that’s been on my mind for years now. I can say that I am less ignorant on the subject of race than I was in 2010, but, this particular set of thoughts always bother me.</p>\n\n<p>For starters, I think I should say I’m a very anxious person with severe social anxiety, I live in a small (mostly white) town and I never got out much even before Covid. I don’t have much real world experience, my view of the world is largely determined by what I see on the internet/TV/Media.</p>\n\n<p>Up until all the wokeness stuff started, I never thought about my race at all. I just thought of myself as a person. When thinking about other races, I thought the same thing of other races, “Oh, this person just happens to be this color”. </p>\n\n<p>And yes I will admit, there are some very racist people where I live. I can admit I’ve had biases and some ignorance when it comes to race, but I don’t associate with these people, as I said, I’m basically a hermit. Though of course, my environment surely has had some kind of impact on me in ways I may not realize. Though I think anyone could say the same.</p>\n\n<p>Now, this particular subject, I’ve brought up before to people in the past, but it’s always dismissed. And that’s exactly what I see as part of a problem. Everyone is (seemingly) so dismissive of white people in general, and their opinions on race... but are told that they need to listen to other races and not be dismissive of them. It just seems so hypocritical and backwards to me.</p>\n\n<p>Now let me say I believe racism is a problem. Black people and other POC do face discrimination daily.  And I’ll probably never completely understand what it’s like to be black in the US. I think there’s work to be done when it comes to racial equality.</p>\n\n<p>With that being said, I can’t help but feel like I’m being thrown in to some oppressor role for simply being white. White people in general seem to be treated like a monolith, all the while being told not to treat other races like a monolith. </p>\n\n<p>Like me not being able to comprehend being an average black person, I don’t think poc quite understand what it’s like to be an average white person. I’m white, and I can’t help but feel attacked for being white. But if I say anything about it, I’m more or less told to just get over it. </p>\n\n<p>If you do a google search, anything you find about white people is always negative. White people are terrible. White people need to do x or y. White people are the problem. White opinions don’t matter. Abolish whiteness. I mean... what a bunch of freakin horrible things to say about the same people that they say need to support them. They say white people need to help with the goals of ending racism also while saying they can’t have an opinion or talk about race. How am I not supposed to take stuff like that personally? It just seems very self centered and one sided... and well, kinda racist.</p>\n\n<p>But then I’m told “Stop making this about you”. And that’s that. </p>\n\n<p>“You need to do what we say or you’re racist/evil/part of the problem, end of story.” Or at least it definitely comes off that way.</p>\n\n<p>I don’t feel heard as a white person. In fact I’m usually told that I shouldn’t be. Because, I’m white, it’s not about me, etc.</p>\n\n<p>And I don’t mean “heard” from white people. I wanna be heard from other races, not by some racist pro white circle jerk that’ll just make it about other races being bad. </p>\n\n<p>I just think it’s difficult for real conversations to happen if the respect isn’t mutual. Or if one side is silenced. And I can’t help but feel like that happens way too much. And I’m sure white people do it too. I’m sure black people have felt dismissed by white people. How can races get along if either side feels dismissed by the other? </p>\n\n<p>I would really like to believe that I’m receptive to what other people (particularly of other races) have to say, I like to believe that I actually listen... but man, it really sucks when it feels like it’s not a two way street.</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/TooAfraidToAsk/comments/lvgmfu/why_does_it_feel_like_there_is_such_a_lack_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "lvgmfu",
  "is_self": true,
  "media": null,
  "is_video": false
}