{
  "author": "Happy-Twist-4697",
  "original_created_utc": 1656810031,
  "title": "Is this a red flag or is my bf just a bit too friendly?",
  "created_utc": 1656834487,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had a birthday dinner with my friends and family, I thought it would be nice for my boyfriend to come along and meet them as well. I invited my friend (Female) and she&amp;#39;s gorgeous,\nthat&amp;#39;s not a question. My boyfriend has always been outgoing, likes to everyone. Doesn&amp;#39;t matter\nthe gender and the convo is always appropriate but I think he was being a little too friendly with my friend. He&amp;#39;ll walk beside her instead of walking\nbeside me, she needed a bag for her hair cause it was raining. He went with her to the cashier to get one, while I&amp;#39;m just on the side line. It was just\nkinda weird. I love my friend I know she wouldn&amp;#39;t do shady stuff but idk it didn&amp;#39;t sit right with me. Thoughts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/vq5pc3/is_this_a_red_flag_or_is_my_bf_just_a_bit_too/",
  "subreddit": "TooAfraidToAsk",
  "id": "vq5pc3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I had a birthday dinner with my friends and family, I thought it would be nice\nfor my boyfriend to come along and meet them as well. I invited my friend\n(Female) and she's gorgeous, that's not a question. My boyfriend has always been\noutgoing, likes to everyone. Doesn't matter the gender and the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人や家族と一緒に誕生日ディナーをしたのですが、いいなと思いました。\n彼氏も一緒に来てくれたらいいなと思いました。友人（女性）を誘いました。\n(女性)ですが、文句なしにゴージャスです。私のボーイフレンドは、いつも外向的で、誰にでも好かれる人です。\n外向的で、誰にでも好かれる。性別は関係なく、...",
      "title": "これは赤信号なのか、それとも私のボーイフレンドがちょっとフレンドリーすぎるだけなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我与我的朋友和家人共进生日晚餐，我认为这很好\n让我的男朋友也来见见他们。我邀请了我的朋友\n(女），她非常漂亮，这不是一个问题。我的男朋友一直都是\n外向，喜欢和每个人交往。不管是什么性别，也不管是什么...",
      "title": "这是一个红旗，还是我的男友只是有点太友好了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我與我的朋友和家人共進生日晚餐，我認爲這很好\n讓我的男朋友也來見見他們。我邀請了我的朋友\n(女），她非常漂亮，這不是一個問題。我的男朋友一直都是\n外向，喜歡和每個人交往。不管是什麼性別，也不管是什麼...",
      "title": "這是一個紅旗，還是我的男友只是有點太友好了？"
    }
  ]
}