{
  "author": "eleanor_konik",
  "the_new_excerpt": "I just finished reading Brotherhood of Kings by Amanda Podany and apparently\nAmenhotep II stated outright that \"from time immemorial no daughter of the King\nof Egypt is given to anyone.\"\n\nDo we know why this attitude, so different from that of the nearby Mesopotamian\nkings, evolved in Egyptian…",
  "original_created_utc": 1614940234,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚读完了阿曼达-波达尼写的《国王的兄弟情谊》，而且显然\n阿门霍特普二世直言：\"自古以来，没有一个国王的女儿。\n埃及的，是给任何人的。\"\n\n我们知道为什么这种态度，与附近的美索不达米亚人的态度如此不同吗？\n王，在埃及演化为...",
      "title": "古代*王妃如果没有当上冕下或摄政王，她们会做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛讀完了阿曼達-波達尼寫的《國王的兄弟情誼》，而且顯然\n阿門霍特普二世直言：\"自古以來，沒有一個國王的女兒。\n埃及的，是給任何人的。\"\n\n我們知道爲什麼這種態度，與附近的美索不達米亞人的態度如此不同嗎？\n王，在埃及演化爲...",
      "title": "古代*王妃如果沒有當上冕下或攝政王，她們會做什麼？"
    }
  ],
  "title": "What did Ancient *PRINCESSES* do if they didn't wind up as coruler or regent?",
  "created_utc": 1614954296,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just finished reading Brotherhood of Kings by Amanda Podany and apparently Amenhotep II stated outright that &quot;from time immemorial no daughter of the King of Egypt is given to anyone.&quot;</p>\n\n<p>Do we know why this attitude, so different from that of the nearby Mesopotamian kings, evolved in Egyptian society? What did the princesses <em>do</em> if they weren&#39;t allowed to engage in diplomatic marriages? I know that some married their brothers in order to preserve the royal line and some ruled outright, but what about the rest of them? Did they serve the Temples? Doing what? Or did they exclusively focus on childrearing?</p>\n\n<p>NOTE: I posted this last night and got 10 upvotes but I had accidentally typo&#39;d it as &quot;Priestesses&quot; thanks to autocorrect :( Sorry for anyone who was curious about Egyptian Priestesses (who are super cool, but pretty well-covered by Ancient History Encyclopedia).</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/AskHistorians/comments/ly931r/what_did_ancient_princesses_do_if_they_didnt_wind/",
  "subreddit": "AskHistorians",
  "id": "ly931r",
  "is_self": true,
  "media": null,
  "is_video": false
}