{
  "author": "BlueHorizon87",
  "original_created_utc": 1629681666,
  "title": "Which CRYPTOCURRENCY that has so far been dormant is going to be the next to EXPLODE in price?",
  "created_utc": 1629711481,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m curious as to all of your opinions on which currently dormant Cryptocurrency will be the next potential big thing in the Crypto world, and more importantly, why?</p>\n\n<p>Some questions I have are:</p>\n\n<ul>\n<li><p>Is there a Crypto you think has the single best chance to be the most useful as a CURRENCY, rather than just as an investment? Some Cryptos have high fees and slow transactions, where as others are zero fee, with instant transactions, so I&#39;d imagine these will be the dominant currency but most major Crypto are currently gaining such high returns, I find it difficult to imagine any Crypto as a currency tbh. What are you thoughts on this?</p></li>\n<li><p>Which crypto has the most potential as purely an INVESTMENT? Many say Bitcoin is going to be the &#39;Gold&#39; of Crypto, and so far it has been, do you see this changing any time soon, and why? Ethereum could be the top dog soon, but is there another Crypto just waiting for it&#39;s moment to take over?</p></li>\n<li><p>I find it hard to see Bitcoin being used as a currency due to the extremely high price, so people will be holding on to it as purely an investment only. Do you agree with this?</p></li>\n<li><p>Which Smart Contract Crypto will be dominant?</p></li>\n<li><p>Lastly, why do you think Crypto is important now more than ever before?</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/p9pdtp/which_cryptocurrency_that_has_so_far_been_dormant/",
  "subreddit": "CryptoCurrency",
  "id": "p9pdtp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm curious as to all of your opinions on which currently dormant Cryptocurrency\nwill be the next potential big thing in the Crypto world, and more importantly,\nwhy?\n\nSome questions I have are:\n\n * Is there a Crypto you think has the single best chance to be the most useful\n   as a CURRENCY, rather…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在眠っている暗号通貨の中で、どのようなものが次世代の暗号通貨になるのか、皆さんの意見を聞かせてください。\n次の暗号世界の大物になる可能性があるのか、さらに重要なのは\nそしてさらに重要なのは、その理由です。\n\nいくつか質問があります。\n\n * 通貨として、というよりはむしろ通貨として最も有用になる可能性が最も高いと思われる暗号はありますか？\n   通貨として、むしろ...",
      "title": "これまで眠っていたCRYPTOCURRENCYの中で、次に価格が爆発するのはどのCRYPTOCURRENCYか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很好奇你们对哪种目前处于休眠状态的加密货币有什么看法？\n将成为加密世界的下一个潜在大事件，更重要的是。\n为什么？\n\n我有一些问题。\n\n * 是否有一种加密货币，你认为它最有可能成为最有用的货币？\n   作为一种货币，而不是...",
      "title": "哪种迄今为止一直处于休眠状态的CRYPTOCURRENCY将成为下一个爆炸性的价格？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很好奇你們對哪種目前處於休眠狀態的加密貨幣有什麼看法？\n將成爲加密世界的下一個潛在大事件，更重要的是。\n爲什麼？\n\n我有一些問題。\n\n * 是否有一種加密貨幣，你認爲它最有可能成爲最有用的貨幣？\n   作爲一種貨幣，而不是...",
      "title": "哪種迄今爲止一直處於休眠狀態的CRYPTOCURRENCY將成爲下一個爆炸性的價格？"
    }
  ]
}