{
  "author": "R0B0C0P33",
  "original_created_utc": 1635293078,
  "title": "Screw it, I'm buying Shiba Inu!",
  "created_utc": 1635309170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright, I can&#39;t stand the FOMO anymore! Everyone on Reddit says how ridiculous it is! It&#39;s definitely going to crash soon. And I agree with them! Doge was one thing, but this now a joke based on a joke. But...it keeps going up like crazy! If I was smart/foolish enough to invest a month ago, I&#39;d be a happy camper.</p>\n\n<p>Maybe what I buy will crash until 0 and that&#39;s ok. But I can&#39;t take the feeling of seeing it shoot up like it has been and not take a piece of it.</p>\n\n<p>I&#39;m not asking for validation, but I&#39;m curious how long it would have to go up for you all to consider buying in (talking to the skeptics here). Would it have to go up 2x, 5x, 10x, 100x? Is there any amount that would make you consider jumping in?</p>\n\n<p>Wish me luck as I buy a joke coin at an ATH. What could go wrong???</p>\n</div><!-- SC_ON -->",
  "score": 286,
  "permalink": "/r/CryptoCurrency/comments/qgju7q/screw_it_im_buying_shiba_inu/",
  "subreddit": "CryptoCurrency",
  "id": "qgju7q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Alright, I can't stand the FOMO anymore! Everyone on Reddit says how ridiculous\nit is! It's definitely going to crash soon. And I agree with them! Doge was one\nthing, but this now a joke based on a joke. But...it keeps going up like crazy!\nIf I was smart/foolish enough to invest a month ago, I'd be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さてさて、もうFOMOには耐えられませんね。Redditではみんながどれだけ馬鹿げているか\nと言っています。近いうちに間違いなくクラッシュするでしょう。そして、私もそれに同意します。Dogeは1つのことでした。\nジョークの上にジョークを重ねたようなものです。でも...めちゃくちゃ上がり続けています。\nもし私が1ヶ月前に投資するほど賢く/愚かであったならば、私は・・・。",
      "title": "ふざけるな！柴犬を買うぞ！」と。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好了，我不能再忍受FOMO了! Reddit上的每个人都说这是多么的可笑\n它是多么的荒谬! 它肯定很快就会崩溃。我也同意他们的说法! DOGE是一个\n但现在是一个基于笑话的笑话。但是......它一直在疯狂地上涨!\n如果我一个月前足够聪明/愚蠢地投资，我就会...",
      "title": "去它的，我要买柴犬!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，我不能再忍受FOMO了! Reddit上的每個人都說這是多麼的可笑\n它是多麼的荒謬! 它肯定很快就會崩潰。我也同意他們的說法! DOGE是一個\n但現在是一個基於笑話的笑話。但是......它一直在瘋狂地上漲!\n如果我一個月前足夠聰明/愚蠢地投資，我就會...",
      "title": "去它的，我要買柴犬!"
    }
  ]
}