{
  "author": "AwesomeMathUse",
  "the_new_excerpt": "FREMONT, Calif., Feb. 09, 2021 (GLOBE NEWSWIRE) -- Corsair Gaming, Inc.\n(NASDAQ:CRSR) (“Corsair”), a leading global provider and innovator of\nhigh-performance gear for gamers and content creators, today announced\npreliminary financial results for the fourth quarter and full year ended\nDecember 31,…",
  "original_created_utc": 1612934629,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2021年2月9日，加利福尼亚州弗里蒙特市（GLOBE NEWSWIRE）--Corsair Gaming, Inc.\n纳斯达克股票代码：CRSR）（以下简称 \"Corsair\"），是全球领先的游戏产品供应商和创新者。\n为游戏玩家和内容创作者提供的高性能设备，今天宣布\n初步的财务业绩，截止到第四季度和全年\n12月31日，...",
      "title": "Corsair Gaming公布第四季度及2020年全年财报"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年2月9日，加利福尼亞州弗裏蒙特市（GLOBE NEWSWIRE）--Corsair Gaming, Inc.\n納斯達克股票代碼：CRSR）（以下簡稱 \"Corsair\"），是全球領先的遊戲產品供應商和創新者。\n爲遊戲玩家和內容創作者提供的高性能設備，今天宣佈\n初步的財務業績，截止到第四季度和全年\n12月31日，...",
      "title": "Corsair Gaming公佈第四季度及2020年全年財報"
    }
  ],
  "title": "Corsair Gaming Reports Fourth Quarter and Full Year 2020 Financial Results",
  "created_utc": 1612980664,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>FREMONT, Calif., Feb. 09, 2021 (GLOBE NEWSWIRE) -- Corsair Gaming, Inc. (NASDAQ:CRSR) (“Corsair”), a leading global provider and innovator of high-performance gear for gamers and content creators, today announced preliminary financial results for the fourth quarter and full year ended December 31, 2020.</p>\n\n<p>Fourth Quarter 2020 Highlights</p>\n\n<p>Net revenue was $556.3 million, an increase of 70.4% year-over-year. Gamer and creator peripherals segment net revenue was $191.8 million, an increase of 104.0% year-over-year. Gaming components and systems segment net revenue was $364.5 million, an increase of 56.8% year-over-year.\nGross profit was $153.8 million, an increase of 118.3% year-over-year, with gross margin of 27.6%, an improvement of 600 basis points year-over-year. Gamer and creator peripherals segment gross profit was $68.9 million, an increase of 197.7% year-over-year. Gaming components and systems segment gross profit was $84.9 million, an increase of 79.5% year-over-year.\nOperating income was $58.9 million, an increase of  314.2% year-over-year.\nAdjusted operating income was $71.0 million, an increase of 166.9% year-over-year.\nNet income was $43.0 million, or $0.43 per diluted share, compared to net income of $6.0 million in the same period a year ago, or $0.08 per diluted share.\nAdjusted net income was $53.0 million, or $0.53 per diluted share, an increase of 214.8% year-over-year compared to adjusted net income of $16.8 million in the same period a year ago, or $0.21 per diluted share.\nAdjusted EBITDA was $72.5 million, an increase of 154.7% year-over-year, with adjusted EBITDA margin of 13.0%, an improvement of 430 basis points year-over-year.\nAs of December 31, 2020, we had cash and restricted cash of $133.6 million, $48.1 million capacity under our revolving credit facility and total long-term debt of $321.4 million.\nCash flows from operations was $68.6 million, which increased from $36.0 million in the same period a year ago, bringing the full year 2020 cash flow from operations to $169.0 million.\nFull Year 2020 Highlights</p>\n\n<p>Net revenue was $1.7 billion, an increase of 55.2% year-over-year. Gamer and creator peripherals segment net revenue was $539.4 million, an increase of 83.4% year-over-year. Gaming components and systems segment net revenue was $1,163.0 million, an increase of 44.8% year-over-year.\nGross profit was $465.4 million, an increase of 107.5% year-over-year, with gross margin of 27.3%, an improvement of 690 basis points year-over-year. Gamer and creator peripherals segment gross profit was $189.7 million, an increase of 133.2% year-over-year. Gaming components and systems segment gross profit was $275.7 million, an increase of 92.9% year-over-year.\nOperating income was $158.4 million, an increase of 568.0% year-over-year.\nAdjusted operating income was $204.8 million, an increase of 211.4% year-over-year.\nNet income was $103.2 million, or $1.14 per diluted share, compared to net loss of $8.4 million in the same period a year ago, or $(0.11) per diluted share.\nAdjusted net income was $145.0 million, or $1.60 per diluted share, an increase of 427.0% year-over-year compared to adjusted net income of $27.5 million, or $0.35 per diluted share.\nAdjusted EBITDA was $213.0 million, an increase of 197.5% year-over-year, with adjusted EBITDA margin of 12.5%, an improvement of 600 basis points year-over-year.\nDefinitions of the non-GAAP financial measures used in this press release and reconciliations of such measures to their nearest GAAP equivalents are included below under the heading “Use and Reconciliation of Non-GAAP Financial Measures.”</p>\n\n<p>“We are excited to see the market for gaming and streaming product continue to grow at such a pace.  It is clear that a new wave of gamers and streamers has entered the market as well as consumers building gaming PCs for the first time.  Our expectation is that all these people that are new to the market will continue to buy gaming and streaming products from us for many years into the future.  I am particularly pleased that the revenue from our gaming components and systems segment is now over $1 billion.  And equally happy to see our gamer and creator peripherals segment grow by 83% and break through the half billion milestone.  Obviously this is amazing growth in both segments.  We continue to bring out exciting new product in all our product lines, and these seem to be resonating well with our current and new customers.  In fact our last three major product launches, the K100 keyboard, the Elgato Wave microphone, and the 4000X gaming case, are all showing near 5 star reviews at major retailers, and gained solid market share in a short time,” stated Andy Paul, Chief Executive Officer of Corsair.</p>\n\n<p>“We are extremely pleased with our financial performance in the fourth quarter.  We have paid off an additional $50 million in debt during the quarter, making the total debt repayment $190 million for 2020.  We expect to continue to use our operating cashflows to reduce our debt and continue to invest in growth.  We also had a successful secondary offering this January, with all net proceeds going to the selling shareholders participating in the secondary,” said Michael G. Potter, Chief Financial Officer of Corsair.</p>\n\n<p>Financial Outlook</p>\n\n<p>For the full year 2021, we currently expect:</p>\n\n<p>Net revenue to be in the range of $1.8 billion to $1.95 billion.\nAdjusted operating income to be in the range of $205 million to $220 million.\nAdjusted EBITDA to be in the range of $215 million to $230 million.\nCertain non-GAAP measures included in our financial outlook were not reconciled to the comparable GAAP financial measures because the GAAP measures are not accessible on a forward-looking basis. We are unable to reconcile these forward looking non-GAAP financial measures to the most directly comparable GAAP measures without unreasonable efforts because we are currently unable to predict with a reasonable degree of certainty the type and extent of certain items that would be expected to impact GAAP measures for these periods but would not impact the non-GAAP measures. Such items may include stock-based compensation charges, public offering related charges, depreciation and amortization, severance, IPO costs and other items. The unavailable information could have a significant impact on our GAAP financial results.</p>\n\n<p>The foregoing forward-looking statements reflect our expectations as of today&#39;s date. Given the number of risk factors, uncertainties and assumptions discussed below, actual results may differ materially. We do not intend to update our financial outlook until our next quarterly results announcement.</p>\n\n<p>Please see “Use and Reconciliation of Non-GAAP Financial Measures” below for a discussion on how we calculate the non-GAAP measures presented herein and a reconciliation to the most directly comparable GAAP measure.</p>\n\n<p>Recent Developments</p>\n\n<p>On February 1, 2021, in the patent infringement case, Ironburg Inventions Ltd. v. Valve Corp, the jury unanimously found that Valve Corp infringed Ironburg’s controller patent and awarded Corsair’s subsidiary Ironburg (a subsidiary of SCUF) over $4 million.  In addition, the jury unanimously found willful infringement by Valve Crop.  The jury verdict of willful infringement is the first step to a potential award of enhanced damages up to the statutory limit of treble damages.\nOn January 26, 2021, Corsair closed its follow-on public offering by selling stockholders of 8,625,000 shares of its common stock at a price of $35.00 per share.  The total gross proceeds from the offering, before deducting underwriting discounts and commissions and other offering expenses were approximately $301,875,000.  The selling stockholders received all of the net proceeds from the offering.\nOn January 12, 2021 Corsair announced the promotion of Thi La to President and COO, as well as other senior leadership promotions.\nOn January 28, 2021 Corsair launched three new Corsair Gen 4 PCIe x4 NVMe M.2 Solid State Drives – the MP600 CORE, MP600 PRO and MP600 PRO Hydro X Edition.  All MP600 SSDs store massive amounts of data with lightning-fast transfer speeds, leveraging PCIe technology for incredible sustained performance.\nOn January 21, 2021 Corsair launched its Vengeance RGB PRO SL high-performance DDR4 memory kits.  Initially available in a wide range of frequencies up to 3,600MHz and kits up to 128GB (4x32GB) in both black and white, VENGEANCE RGB PRO SL boasts dynamic ten-zone RGB lighting in a form-factor just 44mm tall, offering wide compatibility with nearly any PC build. Each module is tightly screened and optimized for peak performance and overclocking potential, for memory that matches its mesmerizing visuals with equally impressive performance. \nOn January 14, 2021 Corsair launched a new series of mid-tower ATX cases to suit nearly any build: the Corsair 5000D, 5000D AIRFLOW and the iCUE 5000X RGB. Every 5000 Series case offers simple and tidy cable management thanks to the Corsair RapidRoute cable management system, terrific cooling from included fans featuring Corsair AirGuide technology and a spacious interior that fits multiple radiators, including two 360mm simultaneously. Between the understated styling of the 5000D, the optimized airflow of the 5000D AIRFLOW, and the eye-catching RGB lighting behind four beautiful tempered glass panels of the 5000X RGB, the 5000 Series has a case to meet any builder’s priorities.\nOn December 9, 2020 Corsair under its SCUF brand unveiled the new SCUF H1 customizable wired gaming headset. Based on the design and technology of the award-winning CORSAIR VIRTUOSO headset, the H1 is customizable and tailored for competitive gamers who prefer the zero-latency provided by a wired headset.  The SCUF H1’s lightweight design is fully configurable and built for comfort, with immersive sound and a high-resolution interchangeable microphone to make crucial callouts that can be the difference between a victory or a loss. Every rustle of footsteps in a grassy field and every far-off missile strike is delivered with clear fidelity, almost doubling the audio frequency of most gaming headsets.</p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/investing/comments/lgmr8x/corsair_gaming_reports_fourth_quarter_and_full/",
  "subreddit": "investing",
  "id": "lgmr8x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200896
}