{
  "author": "Clip_It_",
  "original_created_utc": 1628291123,
  "title": "To all American investors, We all genuinely feel sorry for you.",
  "created_utc": 1628300486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s world known that the U.S government is one of the most powerful and corrupt governments in the world and they squeeze the U.S citizens for every cent that they can, and if you so happen to find a way around that chokehold they have on you, they just implement even worse laws to regain control of your assets.</p>\n\n<p>We onlook from our own countries hoping that you muster enough votes to stand against these destructive laws and keep your rights as investors and crypto traders.</p>\n\n<p>The Crypto world is feeling your pain and we stand with you against the &quot;big brother&quot; tyranny of your government. Stay strong and work hard against these chains they want to put around your digital assets.</p>\n\n<p>Lots of love and tendies from across the pond ❤</p>\n</div><!-- SC_ON -->",
  "score": 570,
  "permalink": "/r/CryptoCurrency/comments/ozhqmr/to_all_american_investors_we_all_genuinely_feel/",
  "subreddit": "CryptoCurrency",
  "id": "ozhqmr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's world known that the U.S government is one of the most powerful and corrupt\ngovernments in the world and they squeeze the U.S citizens for every cent that\nthey can, and if you so happen to find a way around that chokehold they have on\nyou, they just implement even worse laws to regain control…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカ政府が最も強力で腐敗した政府の一つであることは、世界的に知られています。\n米国政府は世界で最も強力で腐敗した政府の一つであり、米国市民からありったけのお金を搾り取っています。\nそして、万が一、彼らの首を絞めている状況を回避する方法を見つけた場合は\nそして、万が一、彼らに首を絞められている状態を回避する方法を見つけたとしても、彼らは支配力を取り戻すためにさらに悪い法律を施行するのです...",
      "title": "アメリカの投資家の皆さん、本当にお気の毒です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "众所周知，美国政府是世界上最强大和最腐败的政府之一。\n的政府之一，他们榨取美国公民的每一分钱。\n如果你碰巧找到了一个可以绕过他们扼制的方法，他们就会实施更糟糕的法律来重新控制你。\n他们就会实施更糟糕的法律来重新获得控制权......",
      "title": "致所有美国投资者，我们都真心为你感到难过。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "衆所周知，美國政府是世界上最強大和最腐敗的政府之一。\n的政府之一，他們榨取美國公民的每一分錢。\n如果你碰巧找到了一個可以繞過他們扼制的方法，他們就會實施更糟糕的法律來重新控制你。\n他們就會實施更糟糕的法律來重新獲得控制權......",
      "title": "致所有美國投資者，我們都真心爲你感到難過。"
    }
  ]
}