{
  "author": "Khwarezm",
  "original_created_utc": 1624366905,
  "title": "Are the Indian subcontinent's current religious divisions a construct of intentional British colonial policy during their colonial rule?",
  "created_utc": 1624375305,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To clarify I don&#39;t mean the British created Muslim, Sikh, Hindu, Jain etc communities, its more that they played up and created divisions between them as a divide and conquer tactic to solidfy their rule. I&#39;ve seen this idea put forward quite extensively in my surface level dips into the subject, like this Ted-Ed video where its stated British religious policy sowed distrust among communities that previously co-existed:<br/>\n<a href=\"https://www.youtube.com/watch?v=DrcCTgwbsjc&amp;ab_channel=TED-Ed\"><strong>https://www.youtube.com/watch?v=DrcCTgwbsjc&amp;ab_channel=TED-Ed</strong></a></p>\n\n<p>I get a bit confused because when I read about the Mughal empire and some other entities in India before the British it sounds like religion was quite a big deal and a strong dividing force in the subcontinent that could lead to violence, but I understand this is also highly controversial because the propaganda around the Mughals, and Aurangzeb in particular, have distorted the truth to paint them as villainous Islamic bigots for the benefit of current day Hindu nationalism. I&#39;ve also heard some nationalist minded Indians today suggest that Pakistan is just a construct of British policy and is essentially a wayward province that should be part of India so it can be hard for me to tell how much I should be taking these ideas at face value.</p>\n</div><!-- SC_ON -->",
  "score": 409,
  "permalink": "/r/AskHistorians/comments/o5mmvo/are_the_indian_subcontinents_current_religious/",
  "subreddit": "AskHistorians",
  "id": "o5mmvo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To clarify I don't mean the British created Muslim, Sikh, Hindu, Jain etc\ncommunities, its more that they played up and created divisions between them as\na divide and conquer tactic to solidfy their rule. I've seen this idea put\nforward quite extensively in my surface level dips into the subject,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はっきりさせておきたいのは、イギリスがイスラム教徒、シーク教徒、ヒンドゥー教徒、ジャイナ教徒などのコミュニティを作ったということではありません。\nコミュニティを作ったということではなく、支配を強固にするために、彼らの間の分裂を演出し\n自分たちの支配を強固なものにするための分割統治戦術として、彼らの間に分断を生み出したということです。私はこの考えが、私の表層の\n私は、このテーマに表面的に触れる中で、この考えがかなり広範囲に提唱されているのを見てきました。",
      "title": "インド亜大陸の現在の宗教的分裂は、イギリスの植民地支配時代に意図的に行われた植民地政策の産物なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "澄清一下，我并不是说英国人创造了穆斯林、锡克教、印度教、耆那教等社区。\n穆斯林、锡克教、印度教、耆那教等社区，更多的是他们在这些社区之间制造分裂，作为一种分化和征服的策略，以巩固英国的地位。\n这是一种分化和征服的策略，以巩固其统治。我已经看到这个想法\n在我对这一问题的表面研究中，我已经看到了这种观点的广泛提出，...",
      "title": "印度次大陆目前的宗教分歧是否是英国殖民统治时期有意制定的殖民政策的产物？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "澄清一下，我並不是說英國人創造了穆斯林、錫克教、印度教、耆那教等社區。\n穆斯林、錫克教、印度教、耆那教等社區，更多的是他們在這些社區之間製造分裂，作爲一種分化和征服的策略，以鞏固英國的地位。\n這是一種分化和征服的策略，以鞏固其統治。我已經看到這個想法\n在我對這一問題的表面研究中，我已經看到了這種觀點的廣泛提出，...",
      "title": "印度次大陸目前的宗教分歧是否是英國殖民統治時期有意制定的殖民政策的產物？"
    }
  ]
}