{
  "author": "LifeInAction",
  "the_new_excerpt": "Traditionally, real estate was always seen as one of the best kinds of\ninvestment, but imo that's largely because knowledge on stocks was much more\nrare, and it wasn't as easy back then, since there weren't many investing apps,\nhigher fees, and it wasn't as easy to do.\n\nWhile there are of course…",
  "original_created_utc": 1620594296,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "従来、不動産は最高の投資対象とされてきました。\nしかし、それは株式に関する知識がより希薄であったことと、投資用のアプリがあまりなく、投資が簡単ではなかったからだと思います。\n当時は投資アプリもあまりなく、株の知識を得ることは簡単ではありませんでした。\n当時は投資アプリも少なく、手数料も高く、簡単にはできませんでした。\n\nもちろんあるとはいえ...。",
      "title": "株式の方がはるかに身近で良いと思われるのに、なぜ今、不動産に投資するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "传统上，房地产总是被视为最好的投资种类之一。\n投资，但我认为这主要是因为股票方面的知识更加稀少，而且当时并不那么容易，因为没有很多投资应用程序，所以也没有什么人知道。\n稀少，而且那时并不那么容易，因为没有很多投资应用程序。\n更高的费用，而且不那么容易做到。\n\n当然，虽然有...",
      "title": "今天，当股票看起来更容易获得和更好时，为什么有人会投资房地产？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "傳統上，房地產總是被視爲最好的投資種類之一。\n投資，但我認爲這主要是因爲股票方面的知識更加稀少，而且當時並不那麼容易，因爲沒有很多投資應用程序，所以也沒有什麼人知道。\n稀少，而且那時並不那麼容易，因爲沒有很多投資應用程序。\n更高的費用，而且不那麼容易做到。\n\n當然，雖然有...",
      "title": "今天，當股票看起來更容易獲得和更好時，爲什麼有人會投資房地產？"
    }
  ],
  "title": "Why would someone invest in real estate today when stocks seem much accessible and better?",
  "created_utc": 1620609629,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Traditionally, real estate was always seen as one of the best kinds of investment, but imo that&#39;s largely because knowledge on stocks was much more rare, and it wasn&#39;t as easy back then, since there weren&#39;t many investing apps, higher fees, and it wasn&#39;t as easy to do. </p>\n\n<p>While there are of course still challenges and risks, there seems to be countless reasons today why stocks are now much easier and better, and barely any reasons to invest in real estate, given how expensive real estate has become right now, and this is coming from someone who&#39;s followed investing for several years now, seen multiple crashes, as well as bull markets as well.  </p>\n\n<p>With stocks </p>\n\n<ol>\n<li>The barrier to entry is much less, you just need an app or computer and can do it on your spare time. </li>\n<li>It&#39;s cheaper, you can start with as little as $100 to an infinite amount. Where I&#39;m from, studio apartments go in the mid 6-figures, and even in lower costs of living area, you still need several $1000s for a down payment, on top of multiple other costs, and a stable salary to continuously pay your mortgage. </li>\n<li>It&#39;s more liquid, you can sell at anytime you need, of course probably don&#39;t want to during a down market, but at least it&#39;s an option. With real estate, you could be stuck holding onto property indefinitely, and the amount of work to sell or rent out is significantly greater. </li>\n<li>There is more potential and money to be made, even if playing the lower risk game, and choosing common sense FANMG stocks, many of these stocks have gone up 2-5 folds over the last several years, meanwhile you&#39;d be hard press to ever find real estate that can go up even 2x within 5 years, if even in 10 years. </li>\n<li>Much less work, at least compared to real estate, where you have to physically manage, deal with tenants, work on the legal side, and all the other hassles that can happen running a property. </li>\n</ol>\n\n<p>I could see it being different before this era, when it was much cheaper, but it seems like today, stocks are significantly more accessible, liquid, much less work, and have a higher potential to make even more money from too, so is there really any point investing in real estate today, aside from the actual property you have to live in?</p>\n</div><!-- SC_ON -->",
  "score": 516,
  "permalink": "/r/investing/comments/n8nkcd/why_would_someone_invest_in_real_estate_today/",
  "subreddit": "investing",
  "id": "n8nkcd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994597
}