{
  "author": "Lurkerwithaquestio",
  "original_created_utc": 1652627497,
  "title": "Is it normal to do like 2/3 hours of actually work per day working an office job?",
  "created_utc": 1652638975,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been working an office job for 3 years now and it&amp;#39;s my first one of that kind. I used to work Foodservice which was busy for pretty much my entire shift.&lt;/p&gt;\n\n&lt;p&gt;Now I work the standard 9-5 and I have to say I only spend about 3 hours a day doing things relevant to my job.&lt;/p&gt;\n\n&lt;p&gt;My boss gives me assignments and gives me like 3 days to complete it when it genuinely only takes half an hour of my time. I get it to him early, he praises me and say I do an amazing job.&lt;/p&gt;\n\n&lt;p&gt;I just got my second raise in a year with my boss telling me how amazing I am and how much effort I put into my work, but I spend most of my days on reddit.&lt;/p&gt;\n\n&lt;p&gt;This gives me such bad imposter syndrome so I have to know... Is this normal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/NoStupidQuestions/comments/uq843x/is_it_normal_to_do_like_23_hours_of_actually_work/",
  "subreddit": "NoStupidQuestions",
  "id": "uq843x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been working an office job for 3 years now and it's my first one of that\nkind. I used to work Foodservice which was busy for pretty much my entire shift.\n\nNow I work the standard 9-5 and I have to say I only spend about 3 hours a day\ndoing things relevant to my job.\n\nMy boss gives me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "事務職を始めて3年目にして初めてその\n種類の仕事です。以前はフードサービスの仕事をしていて、シフトのほとんどを忙しくしていました。\n\n今、私は標準的な9時から5時まで働いていますが、1日に3時間くらいしか関連すること\n私の仕事に関連することを行う。\n\n私の上司は私に...",
      "title": "事務職で1日に実働2/3時間とかが普通なんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在办公室工作已经三年了，这是我第一次做这种工作。\n样的工作。我以前是做餐饮服务的，几乎整个班次都很忙。\n\n现在我的工作是标准的朝九晚五，我不得不说我每天只花了大约3个小时\n做与我的工作有关的事情。\n\n我的老板给我...",
      "title": "在办公室工作，每天实际工作2/3小时，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在辦公室工作已經三年了，這是我第一次做這種工作。\n樣的工作。我以前是做餐飲服務的，幾乎整個班次都很忙。\n\n現在我的工作是標準的朝九晚五，我不得不說我每天只花了大約3個小時\n做與我的工作有關的事情。\n\n我的老闆給我...",
      "title": "在辦公室工作，每天實際工作2/3小時，這正常嗎？"
    }
  ]
}