{
  "author": "veryeducatedinvestor",
  "original_created_utc": 1632189121,
  "title": "\"We don't know sh*t about f*ck\" is the most idiotic and dangerous mindset ever",
  "created_utc": 1632213851,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can&#39;t for the life of me figure out why during a market downturn everyone here is so quick to cry out &quot;we don&#39;t know shit about fuck.&quot; All it reads to me is that people want to feel smart during the pumps, but rid themselves of accountability during the dumps.</p>\n\n<p>We do our research and invest in projects we believe in. </p>\n\n<p>We made educated guesses about which projects will succeed and which won&#39;t, based on our own due diligence.</p>\n\n<p>We are in tune with the crypto market news and current mainstream sentiment.</p>\n\n<p>We constantly discuss ideas with each other and get a feel for each other&#39;s perspectives.</p>\n\n<p>We make an effort to understand the greater global market conditions and how unfolding events will impact the crypto market.</p>\n\n<p>We calibrate our filters so that we can evaluate which news stories are FUD and which news requires serious consideration. </p>\n\n<p>We choose investment strategies that fit our current risk profile.</p>\n\n<p>...</p>\n\n<p>This sub is chalk full of insanely valuable advice that is literally pummeled into our brain, be it original content, reposts, or whatever.</p>\n\n<p>So yes, we do our best to know as much as possible, and if you don&#39;t know shit about fuck, you shouldn&#39;t be investing in crypto let alone anything else.</p>\n\n<p>Am I the only person that wants to puke every time I read that phrase? It&#39;s a complete disservice to all of the work we put into being knowledgeable and confident about our investments into Cryptocurrencies.</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "permalink": "/r/CryptoCurrency/comments/ps8x3e/we_dont_know_sht_about_fck_is_the_most_idiotic/",
  "subreddit": "CryptoCurrency",
  "id": "ps8x3e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can't for the life of me figure out why during a market downturn everyone here\nis so quick to cry out \"we don't know shit about fuck.\" All it reads to me is\nthat people want to feel smart during the pumps, but rid themselves of\naccountability during the dumps.\n\nWe do our research and invest in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私にはどうしても理解できないのですが、市場が低迷しているときに、ここにいる皆さんが\n市場が低迷しているときに、なぜここにいる人たちがすぐに「我々はファックについて何も知らない」と叫ぶのか、私には理解できません。私には次のようにしか見えません\n盛り上がっている時には賢くなりたいが、落ち込んでいる時には責任を負いたくないという\n落ち込んでいる時には説明責任を果たしたいということです。\n\n私たちはリサーチをして投資をしています。",
      "title": "\"We don't know sh*t about f*ck \"は、最も愚かで危険な考え方です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我无法理解，为什么在市场低迷时，这里的每个人\n这么快就喊出 \"我们根本不知道什么是他妈的\"。在我看来，所有这些都是\n人们想在经济增长时觉得自己很聪明，但在经济下滑时又想摆脱自己的责任。\n的责任。\n\n我们做我们的研究并投资于...",
      "title": "\"我们不知道关于f*ck的事 \"是最愚蠢和最危险的心态"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我無法理解，爲什麼在市場低迷時，這裏的每個人\n這麼快就喊出 \"我們根本不知道什麼是他媽的\"。在我看來，所有這些都是\n人們想在經濟增長時覺得自己很聰明，但在經濟下滑時又想擺脫自己的責任。\n的責任。\n\n我們做我們的研究並投資於...",
      "title": "\"我們不知道關於f*ck的事 \"是最愚蠢和最危險的心態"
    }
  ]
}