{
  "author": "busterrulezzz",
  "original_created_utc": 1638639544,
  "title": "Influencers were predicting 100k BTC because that's what you wanted to hear",
  "created_utc": 1638653626,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I saw a lot of posts yesterday complaining about wild predictions not coming to fruition. Multiple crypto-influencers were predicting Bitcoin would be above 100k before the end of the year, and as it&amp;#39;s not likely to happen after that nasty crash, some people are mad.&lt;/p&gt;\n\n&lt;p&gt;But here&amp;#39;s the thing : &lt;strong&gt;talking heads are making crazy predictions because it&amp;#39;s what we, as a community, want to hear&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;We want to be comforted about our investment choices, so we only listen to the voices that are churning out bullish news and insane price targets. On the other hand, down-to-earth influencers, or those warning us crypto markets movements are famously hard to predict, are ignored, while those with rocket emojis in their YouTube thumbnails are racking up millions of views for their videos.&lt;/p&gt;\n\n&lt;p&gt;Here is the truth : when it comes to short-term prediction, &lt;strong&gt;absolutely nobody has any clue about anything&lt;/strong&gt;. We can try to predict where the market is heading (I tried it myself a few times), but to give a precise target such as &amp;quot;BTC 100k EOY!&amp;quot; is just non-sense. You could end up being right, or entirely wrong.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why I try to stay away from all that noise. I choose solid projects, I DCA, I stake when possible and I relax. It&amp;#39;s really not that complicated. I still keep small bags of various alts, just in case, but the bulk of my money is into ETH. Of course, I won&amp;#39;t give you a price target today, but I am still certain that, in ten years, ETH will have more value then today.&lt;/p&gt;\n\n&lt;p&gt;So, here&amp;#39;s my tip : get in with a strategy, and stick to it, while ignoring price predictions, TA and influencers. Long-term, you&amp;#39;ll be happier, and possibly richer.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/r8uppr/influencers_were_predicting_100k_btc_because/",
  "subreddit": "CryptoCurrency",
  "id": "r8uppr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I saw a lot of posts yesterday complaining about wild predictions not coming to\nfruition. Multiple crypto-influencers were predicting Bitcoin would be above\n100k before the end of the year, and as it's not likely to happen after that\nnasty crash, some people are mad.\n\nBut here's the thing : talking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、野良予想が当たらないことに文句を言う書き込みをたくさん見かけましたが\n実現した。複数の暗号インフルエンサーが、ビットコインは以下のようになると予測していました。\n年末までに10万ドルというのは、あの後、実現しそうにないので\n暴落して、怒っている人がいます。\n\nしかし、ここで問題なのは、話す...",
      "title": "インフルエンサーが100k BTCを予測していたのは、それを聞きたかったから。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我昨天看到很多帖子，抱怨狂热的预测没有实现\n变成现实。多个加密货币影响者预测比特币将超过\n10万，而在那场可怕的暴跌之后，这不太可能发生。\n讨厌的崩溃后，有些人很生气。\n\n但事情是这样的：谈论...",
      "title": "影响者在预测10万BTC，因为这是你想听到的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨天看到很多帖子，抱怨狂熱的預測沒有實現\n變成現實。多個加密貨幣影響者預測比特幣將超過\n10萬，而在那場可怕的暴跌之後，這不太可能發生。\n討厭的崩潰後，有些人很生氣。\n\n但事情是這樣的：談論...",
      "title": "影響者在預測10萬BTC，因爲這是你想聽到的。"
    }
  ]
}