{
  "author": "olihowells",
  "the_new_excerpt": "I’ve now seen many people, including the ceo of Binance, comparing bitcoins\nenergy consumption to energy usage in the current financial systems. This is\nstupid.\n\nCompanies like visa process many multiples more transactions than bitcoin, it’s\nridiculous that people are comparing these systems as a…",
  "original_created_utc": 1620906409,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BinanceのCEOを含め、多くの人がビットコインを比較しているのを目にしました。\nビットコインのエネルギー消費量と現在の金融システムのエネルギー使用量を比較しています。これは\n愚かなことです。\n\nビザのような会社は、ビットコインの何倍もの取引を処理しています。\n人々がこれらのシステムを比較しているのは馬鹿げています。",
      "title": "ビットコインにはエネルギー消費の問題があり、それを銀行システムと比較するのは愚かなことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在看到很多人，包括Binance的ceo，把比特币\n能源消耗与当前金融系统的能源使用相比较。这真是\n愚蠢。\n\n像visa这样的公司处理的交易要比比特币多很多倍，人们拿它们来比较是很荒谬的。\n荒谬的是，人们把这些系统比作一个...",
      "title": "比特币确实存在能源消耗问题，将其与银行系统进行比较是愚蠢的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在看到很多人，包括Binance的ceo，把比特幣\n能源消耗與當前金融系統的能源使用相比較。這真是\n愚蠢。\n\n像visa這樣的公司處理的交易要比比特幣多很多倍，人們拿它們來比較是很荒謬的。\n荒謬的是，人們把這些系統比作一個...",
      "title": "比特幣確實存在能源消耗問題，將其與銀行系統進行比較是愚蠢的。"
    }
  ],
  "title": "Bitcoin does have an energy consumption problem, and comparing it to the banking system is stupid.",
  "created_utc": 1620942526,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve now seen many people, including the ceo of Binance, comparing bitcoins energy consumption to energy usage in the current financial systems. This is stupid.</p>\n\n<p>Companies like visa process many multiples more transactions than bitcoin, it’s ridiculous that people are comparing these systems as a whole.</p>\n\n<p>When you compare the energy usage per transaction bitcoins real problem is shown.</p>\n\n<p>1 Bitcoin transaction uses 910 kWh \n100,000 Visa transactions use 149 kWh</p>\n</div><!-- SC_ON -->",
  "score": 350,
  "permalink": "/r/CryptoCurrency/comments/nbeq81/bitcoin_does_have_an_energy_consumption_problem/",
  "subreddit": "CryptoCurrency",
  "id": "nbeq81",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590796938
}