{
  "author": "WeirdChubbyGinger",
  "original_created_utc": 1659611679,
  "title": "why do women wear short shorts?",
  "created_utc": 1659630520,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why do women wear short shorts? I&amp;#39;ve seen so many women wearing shorts that are so short their cheeks hang out and they&amp;#39;re constantly walking around pulling them down, so why wear shorts that always need pulling down, surely get bigger shorts?&lt;/p&gt;\n\n&lt;p&gt;Edit: I am not telling people what to wear or not to wear, I&amp;#39;m simply asking sometimes it&amp;#39;s clear they&amp;#39;re not comfortable so why still wear them?&lt;/p&gt;\n\n&lt;p&gt;Edit 2: would people feel better if I changed the question to &amp;quot;why would ANYONE continue to wear something they find uncomfortable?&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 131,
  "permalink": "/r/TooAfraidToAsk/comments/wfyjpm/why_do_women_wear_short_shorts/",
  "subreddit": "TooAfraidToAsk",
  "id": "wfyjpm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Why do women wear short shorts? I've seen so many women wearing shorts that are\nso short their cheeks hang out and they're constantly walking around pulling\nthem down, so why wear shorts that always need pulling down, surely get bigger\nshorts?\n\nEdit: I am not telling people what to wear or not to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜ女性はショートパンツを履くのでしょうか？多くの女性が短パンを履いているのを見たことがあります。\nほっぺたが垂れてしまうほど短いショーツを着て、いつも引っ張って歩いているのを見たことがあります。\nなぜ、いつも引っ張らなければならないような短パンを履いているのでしょうか？\nショーツを買うべきでしょう。\n\n編集：私は人に何を着るか、何を着ないかを言っているのではありません...。",
      "title": "なぜ女性はショートパンツをはくのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为什么女人要穿短裤？我见过很多女人穿短裤，短到脸颊都露出来了。\n他们的脸颊都露出来了，而且他们不断地走来走去，把短裤拉下来。\n所以，为什么要穿总是需要拉下的短裤，肯定要买大一点的\n短裤？\n\n编辑：我不是在告诉人们该穿什么或不该穿什么......",
      "title": "为什么女人要穿短裤？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼女人要穿短褲？我見過很多女人穿短褲，短到臉頰都露出來了。\n他們的臉頰都露出來了，而且他們不斷地走來走去，把短褲拉下來。\n所以，爲什麼要穿總是需要拉下的短褲，肯定要買大一點的\n短褲？\n\n編輯：我不是在告訴人們該穿什麼或不該穿什麼......",
      "title": "爲什麼女人要穿短褲？"
    }
  ]
}