{
  "author": "mtb312000",
  "original_created_utc": 1625128966,
  "title": "Let me clear up the confusion about China and the crypto ban",
  "created_utc": 1625143169,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Been living in China 6 years.  China doesn&#39;t have a legitimate stock market because of widespread government interference and corruption.  The real estate scene is a huge bubble, propped up by the government.  There is a limit on the number of houses one can buy (you can&#39;t buy land).  So Chinese want to invest outside China, but the government will not allow you to send money abroad to invest.  SWIFT transfers, whatever....not allowed for investment purposes.  So Crypto presented a loophole for moving money out, and it was banned for that reason.</p>\n\n<p>In summary- Crypto = financial freedom.  CCP no like financial freedom.  CCP ban crypto.  Simple.  Nothing to do with the digital yuan.</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/Bitcoin/comments/obhjb8/let_me_clear_up_the_confusion_about_china_and_the/",
  "subreddit": "Bitcoin",
  "id": "obhjb8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Been living in China 6 years. China doesn't have a legitimate stock market\nbecause of widespread government interference and corruption. The real estate\nscene is a huge bubble, propped up by the government. There is a limit on the\nnumber of houses one can buy (you can't buy land). So Chinese want to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国に住んで6年になります。中国には合法的な株式市場がありません。\n政府の干渉と汚職が蔓延しているからです。不動産市場は\nは政府が支えている巨大なバブルだ。購入できる家の数には制限があります。\n買うことができる家の数には制限があります（土地は買えません）。だから中国人は...。",
      "title": "中国と暗号禁止に関する混乱を解消するために"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在中国生活了6年。中国没有一个合法的股票市场\n因为广泛的政府干预和腐败。房地产\n场是一个巨大的泡沫，由政府支撑着。对一个人可以购买的房屋数量有限制\n一个人可以购买的房屋数量有限制（你不能购买土地）。所以中国人想...",
      "title": "让我来澄清一下关于中国和加密货币禁令的混乱情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在中國生活了6年。中國沒有一個合法的股票市場\n因爲廣泛的政府幹預和腐敗。房地產\n場是一個巨大的泡沫，由政府支撐着。對一個人可以購買的房屋數量有限制\n一個人可以購買的房屋數量有限制（你不能購買土地）。所以中國人想...",
      "title": "讓我來澄清一下關於中國和加密貨幣禁令的混亂情況"
    }
  ]
}