{
  "author": "Br0sefStalin",
  "original_created_utc": 1627482146,
  "title": "I'm an 8th grade science teacher. For our first day, we get 30 mins to teach whatever lesson we want, specifically something not in our curriculum. I want to teach my students what Bitcoin is.",
  "created_utc": 1627497061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title says it! I&#39;m pretty excited for that actually. Does anyone know of a powerpoint of slide deck that has already been created somewhere I could use and/or modify? I&#39;d like it to be not too technical, but serve as a foundation to understanding money better.</p>\n\n<p>Anyone have any resources you think are good?</p>\n\n<p>By the way: I&#39;m asking here <em>using this community as a resource</em>. Of course I Googled Bitcoin lessons, and of course I could make my own. I&#39;d really like to see some of what&#39;s already out there!</p>\n\n<p>edit:typo</p>\n\n<p>Edit 2: Wow this blew up! Thanks for all the responses. Some general clarification - I’m not interested in teaching the technicals, yet. Many students have already asked me about Bitcoin and other coins. There are many ways to explain “what” Bitcoin is, and I see many more in the comments! I do not plan on talking anything market related. I just want to answer their question “what is this Bitcoin thing people are talking about?” And hopefully open the door to future lessons on what money is and the history of it. </p>\n\n<p>Also: I teach at a Charter. Long story short - I do what I want!</p>\n</div><!-- SC_ON -->",
  "score": 837,
  "permalink": "/r/Bitcoin/comments/otawl8/im_an_8th_grade_science_teacher_for_our_first_day/",
  "subreddit": "Bitcoin",
  "id": "otawl8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Title says it! I'm pretty excited for that actually. Does anyone know of a\npowerpoint of slide deck that has already been created somewhere I could use\nand/or modify? I'd like it to be not too technical, but serve as a foundation to\nunderstanding money better.\n\nAnyone have any resources you think…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトル通りですね。私はそれにかなり興奮しています。どなたか、どこかですでに作られた\nどこかで既に作られているパワーポイントやスライドデッキを知っていますか？\nどなたかご存知ですか？あまり専門的ではなく、お金をもっと理解するための基礎となるようなものがいいですね。\nお金のことをもっと理解するための基礎となるようなものにしたいです。\n\nどなたか、このような資料をお持ちではないでしょうか？",
      "title": "私は8年生の理科の先生をしています。初日は30分で好きな授業をすることになっていて、特にカリキュラムにないものを教えることになっています。私は、生徒たちにビットコインとは何かを教えたいと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了这一点! 实际上，我对这一点感到非常兴奋。有没有人知道有一个\n有谁知道在某处已经创建的Powerpoint或幻灯片，我可以使用\n和/或修改？我希望它不要太技术化，而是作为一个基础，让我更好地理解金钱。\n更好地理解金钱。\n\n谁有你认为的任何资源？",
      "title": "我是一名八年级的科学老师。第一天，我们有30分钟的时间来教任何我们想教的课程，特别是一些不在我们课程中的东西。我想教我的学生什么是比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了這一點! 實際上，我對這一點感到非常興奮。有沒有人知道有一個\n有誰知道在某處已經創建的Powerpoint或幻燈片，我可以使用\n和/或修改？我希望它不要太技術化，而是作爲一個基礎，讓我更好地理解金錢。\n更好地理解金錢。\n\n誰有你認爲的任何資源？",
      "title": "我是一名八年級的科學老師。第一天，我們有30分鐘的時間來教任何我們想教的課程，特別是一些不在我們課程中的東西。我想教我的學生什麼是比特幣。"
    }
  ]
}