{
  "author": "smittysomething",
  "original_created_utc": 1655154167,
  "title": "Why do I need infinite energy to keep a spring compressed, but a vice doesn't?",
  "created_utc": 1655186857,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If I take a big strong spring and compress it between my arms, it takes a continuous amount of energy for me to hold it there.&lt;/p&gt;\n\n&lt;p&gt;However if I put that same spring in a vice and use some of my energy to close the vice, it&amp;#39;ll happily sit there closed without me needing to add extra energy to the vice.&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s the difference here? Why do I seemingly need an infinite amount of energy to hold the spring closed but the vice doesn&amp;#39;t? Where is that energy from me going?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/askscience/comments/vbmdfy/why_do_i_need_infinite_energy_to_keep_a_spring/",
  "subreddit": "askscience",
  "id": "vbmdfy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If I take a big strong spring and compress it between my arms, it takes a\ncontinuous amount of energy for me to hold it there.\n\nHowever if I put that same spring in a vice and use some of my energy to close\nthe vice, it'll happily sit there closed without me needing to add extra energy\nto the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大きなバネを両腕で挟んで圧縮すると、そのバネを保持するためには連続したエネルギーが必要です。\nこのとき、両腕でバネを押さえるには、連続したエネルギーが必要です。\n\nしかし、同じバネを万力に挟んで、その万力を閉じるのに使ったとします。\nバイスを閉じるために、私のエネルギーの一部を使えば、バイスは喜んでそこに座っています。\nということです。",
      "title": "なぜ、バネを圧縮しておくには無限のエネルギーが必要なのに、万力は必要ないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我拿一个大的强壮的弹簧，把它压缩在我的双臂之间，我需要一个持续的能量来保持它。\n我需要持续的能量才能把它固定在那里。\n\n然而，如果我把同样的弹簧放在一个钳子里，用我的一些能量来关闭\n钳子，它就会很高兴地坐在那里关闭，而不需要我增加额外的能量\n的能量。",
      "title": "为什么我需要无限的能量来保持弹簧的压缩，而一个钳子却不需要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我拿一個大的強壯的彈簧，把它壓縮在我的雙臂之間，我需要一個持續的能量來保持它。\n我需要持續的能量才能把它固定在那裏。\n\n然而，如果我把同樣的彈簧放在一個鉗子裏，用我的一些能量來關閉\n鉗子，它就會很高興地坐在那裏關閉，而不需要我增加額外的能量\n的能量。",
      "title": "爲什麼我需要無限的能量來保持彈簧的壓縮，而一個鉗子卻不需要？"
    }
  ]
}