{
  "author": "RootlessBoots",
  "the_new_excerpt": "My recent shitpost guide had 600% more comments (positive comments) than\nupvotes, which is strange. I’m going to psychoanalyze this.\n\nPeople are a bit greedy. This is inherent in probably mostly everyone. It’s ok.\nI am going to surmise that people assume subconsciously there are a limited\namount of…",
  "original_created_utc": 1618965479,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の最近のシットポスト・ガイドは、upvotesよりも600%も多くのコメント（ポジティブなコメント）がありました。\n奇妙なことに、アップヴォートの数が600%もありました。これを精神分析してみます。\n\n人は少し欲張りです。これはおそらくほとんどの人に備わっています。それはいいんです。\n人は無意識のうちに、限られた数の......と思い込んでいるのではないかと推測しています。\n限られていると思っているのではないでしょうか。",
      "title": "私の質の高いクソ記事が、アップヴォートよりも600％も多くのコメントを得たという事実は、月がいかにこのサブコンテンツに影響を与えるかを示しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近的屎帖指南的评论（正面评论）比支持率多600%。\n上引，这很奇怪。我要对此进行心理分析。\n\n人们有点贪婪。这可能是大多数人固有的。这很正常。\n我将推测，人们在潜意识中认为有一个有限的\n的数量...",
      "title": "我的高质量狗屎帖得到了600%以上的评论，这表明月亮是如何影响这个子内容的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近的屎帖指南的評論（正面評論）比支持率多600%。\n上引，這很奇怪。我要對此進行心理分析。\n\n人們有點貪婪。這可能是大多數人固有的。這很正常。\n我將推測，人們在潛意識中認爲有一個有限的\n的數量...",
      "title": "我的高質量狗屎帖得到了600%以上的評論，這表明月亮是如何影響這個子內容的。"
    }
  ],
  "title": "The fact that my quality shitpost got 600% more comments than upvotes goes to show how moons affect this subs content.",
  "created_utc": 1619001517,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My recent shitpost guide had 600% more comments (positive comments) than upvotes, which is strange. I’m going to psychoanalyze this. </p>\n\n<p>People are a bit greedy. This is inherent in probably mostly everyone. It’s ok. I am going to surmise that people assume subconsciously there are a limited amount of moons to be given and so they are more likely to comment (receive) than upvote (give).</p>\n\n<p>I remember a post here talking about how moons are kind of ruining the quality of content on the sub. I lean toward the agree side of this argument, as nowadays all I see is regurgitated stuff or echo chamber emotional posts that garner thousands of dollars worth of moons. </p>\n\n<p>To say that most posts are not posted with monetary influence in mind now is a lie.. and this will have a ripple effect if more subreddits decide to implement this.</p>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/CryptoCurrency/comments/mv4jey/the_fact_that_my_quality_shitpost_got_600_more/",
  "subreddit": "CryptoCurrency",
  "id": "mv4jey",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523330
}