{
  "author": "Fungible_ecash_XMR",
  "original_created_utc": 1636750955,
  "title": "Stop listening to Market Manipulators and Reddit idiots. Early Bitcoin investors are voting with their feet.",
  "created_utc": 1636779071,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Monero. XMR, you know the coin with the $1.25 million IRS bounty. You know, that coin thats so decentralised that anyone with a CPU (from a PSP slim to a vending machine) can mine with and support the network. </p>\n\n<p>The one with the fairest of launches, no premine. No dev taxes. Developers are a rag tag of anonymous mathematicians and cryptographers from around the world. Anyone can view and edit the code. </p>\n\n<p>Didn’t put it in the title cos I’ve made some great posts and they seem to go unnoticed. Won’t get conspiratorial now. </p>\n\n<p>Anyways there is a reason that many people who invested in Bitcoin at say, $200, $20, are now Monero Maximalists. It is truly the CypherPunk coin. It’s the people’s money: Tail Emission ensures the networks security indefinitely, while Bitcoins security is at risk when there’s no more supply increase. </p>\n\n<p>Will tx fees be enough to secure the Bitcoin network? One that is completely transparent for the world to analyse? How about Eth, that rich mans playground?</p>\n\n<p>If you’re ignoring Monero now TRUST ME you still be crying about it in 5 years time. Stop investing in SHIT. LoopCrap, VAG and BAL nft social contracts BULLSHIT - nobody cares guys. </p>\n\n<p>Monero is powerful enough to uphold entire underworld economies, entire nations. </p>\n\n<p>Look up White House market. XMR is game changing. Not fucking Ripple.</p>\n\n<p><a href=\"/r/xmrtrader\">/r/xmrtrader</a> <a href=\"/r/monero\">/r/monero</a></p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/qskse1/stop_listening_to_market_manipulators_and_reddit/",
  "subreddit": "CryptoCurrency",
  "id": "qskse1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Monero. XMR, you know the coin with the $1.25 million IRS bounty. You know, that\ncoin thats so decentralised that anyone with a CPU (from a PSP slim to a vending\nmachine) can mine with and support the network.\n\nThe one with the fairest of launches, no premine. No dev taxes. Developers are a\nrag tag…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "モネロ XMR、125万ドルのIRS懸賞金がかかったコインを知っていますか？ご存知の通り、その\nCPUがあれば（PSPスリムから自動販売機まで）誰でもマイニングでき、ネットワークをサポートすることができる分散型コインです。\nCPUがあれば（PSPスリムから自動販売機まで）誰でもマイニングでき、ネットワークをサポートできる分散型コインです。\n\n最も公平なローンチで、前金なし。開発者の税金もありません。開発者は\nボロ雑巾...",
      "title": "Market ManipulatorやRedditの馬鹿の言うことを聞くのはやめましょう。初期のビットコイン投資家は自分の足で投票している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Monero. XMR，你知道那个有125万美元国税局赏金的币。你知道，那个\n币，它是如此分散，以至于任何有CPU的人（从一个PSP超薄到一个自动售货机）都可以\n矿机）都可以开采并支持网络。\n\n那是一个最公平的启动，没有预付金。没有开发税。开发人员是一个\n流浪汉...",
      "title": "不要再听信市场操纵者和Reddit的白痴。早期的比特币投资者正在用他们的脚投票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Monero. XMR，你知道那個有125萬美元國稅局賞金的幣。你知道，那個\n幣，它是如此分散，以至於任何有CPU的人（從一個PSP超薄到一個自動售貨機）都可以\n礦機）都可以開採並支持網絡。\n\n那是一個最公平的啓動，沒有預付金。沒有開發稅。開發人員是一個\n流浪漢...",
      "title": "不要再聽信市場操縱者和Reddit的白癡。早期的比特幣投資者正在用他們的腳投票。"
    }
  ]
}