{
  "author": "LincolnWasALiberal",
  "original_created_utc": 1630616488,
  "title": "Why aren't more Americans visibly outraged that their government spent $2.2 trillion dollars for a fruitless war in Afghanistan, when all that money could have been invested in solving homelessness and ending poverty?",
  "created_utc": 1630633196,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m too afraid to ask this question out of fear of being called a traitor or ungrateful to our troops. Throughout these last two decades, so many people have been thrown out on the streets, many families struggled to keep their heads above water while on the brink of homelessness. Studies have found that more than 26,000 Americans die each year due to lack of healthcare cost. Young people with tons of potential drop out of college (or don&#39;t even attend) because of crushing student debt.</p>\n\n<p>They&#39;ve been told to accept their suffering. Conservatives and Neo-Libs kept insisting that Medicare for All, free public college, U.B.I, investing in affordable housing, and other actions to eliminate poverty were &quot;too expensive.&quot; Meanwhile, those same people were pushing for a $2 trillion dollar war 8000 miles away that would accomplish nothing. All that money that could have been spent to make life better for Americans was flushed away.</p>\n\n<p>Now, poverty is just as bad. The status quo isn&#39;t showing any signs of improvement for many Americans and homelessness seems to be getting worse. Why aren&#39;t more Americans demanding their tax dollars be spent on THEM for a change? Or are they in fact outraged, but the media (which mostly works for the pro-war establishment) is just not covering it?</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/TooAfraidToAsk/comments/pgqp01/why_arent_more_americans_visibly_outraged_that/",
  "subreddit": "TooAfraidToAsk",
  "id": "pgqp01",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm too afraid to ask this question out of fear of being called a traitor or\nungrateful to our troops. Throughout these last two decades, so many people have\nbeen thrown out on the streets, many families struggled to keep their heads\nabove water while on the brink of homelessness. Studies have found…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "裏切り者だとか、軍隊に感謝していないとか言われるのが怖くて、この質問はできません。\nてしまうのではないかと恐れています。この20年間、多くの人々が路上に放り出され、多くの家族が生活の維持に苦労してきました。\nこの20年間、多くの人々が路上に放り出され、多くの家族がホームレスになる寸前で頭を抱えていました。\n多くの家族がホームレスになる寸前で頭を悩ませています。調査によると...",
      "title": "ホームレス問題の解決や貧困の解消に投資できたはずなのに、政府がアフガニスタンでの無益な戦争に2兆2千億ドルも費やしたことに、なぜもっと多くのアメリカ人が目に見える形で怒りを示さないのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不敢问这个问题，因为害怕被称为叛徒或\n对我们的部队忘恩负义。在过去的20年里，有那么多人\n许多家庭在无家可归的边缘挣扎着维持生计。\n处于无家可归的边缘。研究发现...",
      "title": "为什么没有更多的美国人对他们的政府花费2.2万亿美元在阿富汗进行毫无结果的战争感到明显的愤怒，而所有这些钱本可以投资于解决无家可归和结束贫困？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不敢問這個問題，因爲害怕被稱爲叛徒或\n對我們的部隊忘恩負義。在過去的20年裏，有那麼多人\n許多家庭在無家可歸的邊緣掙扎着維持生計。\n處於無家可歸的邊緣。研究發現...",
      "title": "爲什麼沒有更多的美國人對他們的政府花費2.2萬億美元在阿富汗進行毫無結果的戰爭感到明顯的憤怒，而所有這些錢本可以投資於解決無家可歸和結束貧困？"
    }
  ]
}