{
  "author": "r2002",
  "the_new_excerpt": "Bloomberg\n[https://www.bloomberg.com/news/articles/2020-12-18/cathie-wood-sees-control-fight-ending-lifting-cloud-over-ark].\n(Archive link [https://archive.fo/sELHo]). (Video interview\n[https://www.youtube.com/watch?v=kfhgbZBWgBE]). The video covers a lot more than\nthe article so I highly recommend…",
  "original_created_utc": 1608328077,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "彭博社\n[https://www.bloomberg.com/news/articles/2020-12-18/cathie-wood-sees-control-fight-ending-lifting-cloud-over-ark].\n(档案链接[https://archive.fo/sELHo]).(视频采访\n[https://www.youtube.com/watch?v=kfhgbZBWgBE]).这段视频涵盖的内容远远不止\n所以我强烈推荐…",
      "title": "凯西·伍德看到控制权之争结束，方舟上空的阴云散去"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "彭博社\n[https://www.bloomberg.com/news/articles/2020-12-18/cathie-wood-sees-control-fight-ending-lifting-cloud-over-ark].\n(檔案鏈接[https://archive.fo/sELHo]).(視頻採訪\n[https://www.youtube.com/watch?v=kfhgbZBWgBE]).這段視頻涵蓋的內容遠遠不止\n所以我強烈推薦…",
      "title": "凱西·伍德看到控制權之爭結束，方舟上空的陰雲散去"
    }
  ],
  "title": "Cathie Wood sees control fight ENDING, lifting cloud over Ark",
  "created_utc": 1608338866,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.bloomberg.com/news/articles/2020-12-18/cathie-wood-sees-control-fight-ending-lifting-cloud-over-ark\">Bloomberg</a>. (<a href=\"https://archive.fo/sELHo\">Archive link</a>). (<a href=\"https://www.youtube.com/watch?v=kfhgbZBWgBE\">Video interview</a>). The video covers a lot more than the article so I highly recommend watching that.</p>\n\n<blockquote>\n<p>“That has quieted down and we are in negotiations,” she said. “We wanted to be fair and square with our partner, and I think things will work out.”</p>\n</blockquote>\n\n<p>She&#39;s expecting strong return on her funds:</p>\n\n<blockquote>\n<p>Wood said she’s confident her investments will return <strong>at least 20% annually</strong>, more than <strong>doubling</strong> over the next five years. As one of the few female CEOs in finance, Wood prizes her performance. She also points to it as advice for other women in her field.</p>\n</blockquote>\n\n<p>Her biggest bet in the future is probably going to be in genomics (ARKG):</p>\n\n<blockquote>\n<p>Tesla’s still in the running, but I would have to say the biggest upside surprises are going to come from the genomic space</p>\n\n<p>The next FANNGs are going to be from genomics (from the video)</p>\n</blockquote>\n\n<p>I know Resolute is painted as the bad guys here, but according to this article, they were the first big backers to invest in Ark, to give Cathie a chance:</p>\n\n<blockquote>\n<p>“We were quite the loss-making company, and I felt it acutely since I funded most of it for the first three years,” Wood said. “We built it. They did not come.” With no background in ETFs and only $40 million of assets after 2 1/2 years, Wood needed a partner to distribute Ark’s products. That’s how Resolute entered the picture. In 2016, it acquired a minority stake, including an option to buy control.</p>\n</blockquote>\n\n<p>Ark is much bigger and more profitable than it appears.</p>\n\n<blockquote>\n<p>“We’re up to $50 billion,” Wood, Ark’s chief executive officer, said in a Bloomberg “Front Row” interview. “Our business is very profitable.” In addition to the $30.5 billion of assets in its seven ETFs, Ark <strong>manages accounts for retail and institutional clients</strong> as well as funds in non-U.S. markets. Its ETF revenue alone adds up to at least $225 million a year.</p>\n</blockquote>\n\n<p>I didn&#39;t know Ark handles accounts for institutional clients. Does that represent any conflicts of interest (I assume not this is probably very common right?)</p>\n\n<p>Just wanted to share the news since I know many here were worried about this.</p>\n</div><!-- SC_ON -->",
  "score": 844,
  "permalink": "/r/investing/comments/kfufwc/cathie_wood_sees_control_fight_ending_lifting/",
  "subreddit": "investing",
  "id": "kfufwc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493087
}