{
  "author": "spicytofu12",
  "original_created_utc": 1648859238,
  "title": "For guys: if I (a female) were to walk up to you on the sidewalk and pretend to know you and chat with you, how would you react?",
  "created_utc": 1648865764,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For context, I live in a not-so-great city but have to walk home at night all the time, and sometimes I don’t feel safe. I want to go up to an unassuming guy and do the whole “oh my god Matt there you are, I’ve been looking all over for you!” but I feel that a guy would either not get it or I’d be too uneasy that he is another person to fear to even go through with it. I ask specifically for guys just because there is a notable paucity of women walking around at night (I wonder why) and so a guy would likely be my only option for support. If a woman went up to you in this manner, would you be able to catch on that they were feeling unsafe or being followed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "permalink": "/r/TooAfraidToAsk/comments/tu5vz5/for_guys_if_i_a_female_were_to_walk_up_to_you_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "tu5vz5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For context, I live in a not-so-great city but have to walk home at night all\nthe time, and sometimes I don’t feel safe. I want to go up to an unassuming guy\nand do the whole “oh my god Matt there you are, I’ve been looking all over for\nyou!” but I feel that a guy would either not get it or I’d be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちなみに、私はあまり良くない街に住んでいますが、夜、歩いて帰宅しなければならないので、すべて\nと不安になることがあります。気の置けない男性に声をかけたい。\nマットさん、いらっしゃいませ！ずっと探していたんです。\nでも、「この人、わかってないなぁ」とか、「この人は......」と思うことがあるんです。",
      "title": "男性向け：もし私（女性）が歩道であなたに近づき、あなたのことを知っているふりをしておしゃべりしたら、あなたはどんな反応をしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了了解情况，我住在一个不是很好的城市，但晚上必须步行回家，所有的人都是如此。\n有时我觉得不安全。我想走到一个不起眼的家伙面前\n然后说 \"天哪，马特，你在这里，我一直在找你！\"。\n但我觉得一个人要么不明白，要么我就会......",
      "title": "对于男生来说：如果我（女性）在人行道上走到你面前，假装认识你并与你聊天，你会有什么反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了瞭解情況，我住在一個不是很好的城市，但晚上必須步行回家，所有的人都是如此。\n有時我覺得不安全。我想走到一個不起眼的傢伙面前\n然後說 \"天哪，馬特，你在這裏，我一直在找你！\"。\n但我覺得一個人要麼不明白，要麼我就會......",
      "title": "對於男生來說：如果我（女性）在人行道上走到你面前，假裝認識你並與你聊天，你會有什麼反應？"
    }
  ]
}