{
  "author": "Wubwub_Butter_Thump",
  "original_created_utc": 1648286189,
  "title": "Why do most doctors seem to not take their patients seriously? Or am I just special?",
  "created_utc": 1648307439,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t wanna be all &amp;quot;Oh I googled this and I have like most of the symptoms so I definitely 100% have this illness,&amp;quot; but my psychiatrist and the psychologist I had to see are having a disagreement over whether or not I have a certain mental illness. The psychiatrist kept saying &amp;quot;Oh, well if you had that, you wouldn&amp;#39;t be doing this or this or this,&amp;quot; and I kept telling her &amp;quot;I don&amp;#39;t do those things.&amp;quot; Even the symptoms I do have, &amp;quot;Yes, I do that too.&amp;quot; And she just kind of said, &amp;quot;Oh... Well, you still don&amp;#39;t have it.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;If a patient has a concern about something, no matter how ridiculous it is, why is it not heard out at the very least? Why is it immediately dismissed? It&amp;#39;d make sense for a Munchausen&amp;#39;s type patient that&amp;#39;d keep asking for more and more for the sake of attention, but  for someone like me who was asking out of a legitimate concern? Especially with all these stories about how some patient had a sudden sense of impending doom that got dismissed, and they wound up dead the next morning.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/tokrkt/why_do_most_doctors_seem_to_not_take_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "tokrkt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't wanna be all \"Oh I googled this and I have like most of the symptoms so\nI definitely 100% have this illness,\" but my psychiatrist and the psychologist I\nhad to see are having a disagreement over whether or not I have a certain mental\nillness. The psychiatrist kept saying \"Oh, well if you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ググってみたら、ほとんどの症状に当てはまったので\nしかし、私が通っている精神科医と心理学者は、「私は間違いなく100％この病気です。\nある精神疾患を患っているかどうかで意見が分かれています。\n病気です。精神科医は「ああ、もしあなたが...」と言い続けました。",
      "title": "なぜ、多くの医師は患者のことを真剣に考えていないように見えるのか？それとも私が特別なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不想说 \"哦，我在谷歌上搜索了这个，我有大部分的症状，所以\n我肯定100%有这种病。\"但我的心理医生和我要看的心理医生在我是否有某种疾病的问题上有分歧。\n但我的心理医生和我的心理医生在我是否有某种精神疾病的问题上产生了分歧。\n疾病。心理医生一直在说 \"哦，好吧，如果你...",
      "title": "为什么大多数医生似乎不认真对待他们的病人？还是说我只是特殊？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不想說 \"哦，我在谷歌上搜索了這個，我有大部分的症狀，所以\n我肯定100%有這種病。\"但我的心理醫生和我要看的心理醫生在我是否有某種疾病的問題上有分歧。\n但我的心理醫生和我的心理醫生在我是否有某種精神疾病的問題上產生了分歧。\n疾病。心理醫生一直在說 \"哦，好吧，如果你...",
      "title": "爲什麼大多數醫生似乎不認真對待他們的病人？還是說我只是特殊？"
    }
  ]
}