{
  "author": "Traditional_Key6164",
  "original_created_utc": 1652938669,
  "title": "People investing in high yield projects need to learn basic finance",
  "created_utc": 1652971163,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You cannot escape basic finance. Crypto is NO DIFFERENT to everyday finance, here is why.&lt;/p&gt;\n\n&lt;p&gt;You cannot have a system where savings are higher than lending rates. You cannot have high APR’s without inflation in the token supply.&lt;/p&gt;\n\n&lt;p&gt;High APR’s just mean infinite money printing, and high inflation in the token supply … AKA… your tokens value will tank.&lt;/p&gt;\n\n&lt;p&gt;HIGH APY PROJECTS WILL NOT MAKE YOU RICH. &lt;/p&gt;\n\n&lt;p&gt;..\n20% apy .. unsustainable. 300% apy definitely unsustainable.&lt;/p&gt;\n\n&lt;p&gt;After the fall of Anchor , Celsius, Ohm and other defi projects , it should be clear to you all that they can’t sustain those high rates otherwise the project risks going bankrupt and failing.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 323,
  "permalink": "/r/CryptoCurrency/comments/uswdhh/people_investing_in_high_yield_projects_need_to/",
  "subreddit": "CryptoCurrency",
  "id": "uswdhh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You cannot escape basic finance. Crypto is NO DIFFERENT to everyday finance,\nhere is why.\n\nYou cannot have a system where savings are higher than lending rates. You cannot\nhave high APR’s without inflation in the token supply.\n\nHigh APR’s just mean infinite money printing, and high inflation in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的な金融から逃れることはできない。暗号は日常の金融と何ら変わりません。\nこれがその理由です。\n\n貯蓄が貸出金利より高いというシステムはありえません。また\nトークン供給がインフレにならずに、高い金利を維持することはできません。\n\n高い金利は、無限に紙幣が印刷され、トークンの供給が高インフレになることを意味します。",
      "title": "高利回りプロジェクトに投資する人は、基本的なファイナンスを学ぶ必要がある"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你不能逃避基本的金融。加密货币与日常金融没有区别。\n这就是原因。\n\n你不能有一个储蓄高于贷款利率的系统。你不能\n有高的年利率而没有代币供应的通货膨胀。\n\n高的年利率意味着无限的印钞机，以及高的通货膨胀。",
      "title": "投资高收益项目的人需要学习基本的金融知识"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你不能逃避基本的金融。加密貨幣與日常金融沒有區別。\n這就是原因。\n\n你不能有一個儲蓄高於貸款利率的系統。你不能\n有高的年利率而沒有代幣供應的通貨膨脹。\n\n高的年利率意味着無限的印鈔機，以及高的通貨膨脹。",
      "title": "投資高收益項目的人需要學習基本的金融知識"
    }
  ]
}