{
  "author": "Alphabunsquad",
  "original_created_utc": 1631545703,
  "title": "Could a solar sail spacecraft carry its own laser emitter to provide propulsion or does a laser push its own emitter backwards?",
  "created_utc": 1631568908,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There’s a classic physics problem that asks why we don’t put fans on our sailboats to power our boats when there’s no wind? The obvious answer is that the fan will always provide equal or more impulse in the opposite direction than it provides to the sail. Does this same principle apply to solar sails? If you had lasers on the back of a space ship pointed at solar sails in the front, would you move or would you end up stuck in place, i.e. do lasers apply a force back onto their emitters? If they do, much like how you can have a fan boat that just uses the fan for propulsion, no sail involved, could you just power a spaceship by just firing lasers in the opposite direction?</p>\n\n<p>I get that this kind of defeats the purpose of solar sails which are supposed to be super light and capable of traveling without needing a power source that could run out of energy. Plus solar sails would either be powered by the sun or massive solar arrays on earth which would provide much more energy and impulse than what the ship could carry with it. I’m more just asking from more of a theoretical standpoint than a practical one.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askscience/comments/pnhce5/could_a_solar_sail_spacecraft_carry_its_own_laser/",
  "subreddit": "askscience",
  "id": "pnhce5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There’s a classic physics problem that asks why we don’t put fans on our\nsailboats to power our boats when there’s no wind? The obvious answer is that\nthe fan will always provide equal or more impulse in the opposite direction than\nit provides to the sail. Does this same principle apply to solar…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "物理学の古典的な問題に、「なぜヨットに扇風機をつけないのか」というものがあります。\n風がないときに船を動かすために、なぜヨットに扇風機をつけないのか？明らかな答えは次の通りです。\nファンは常にセイルに与えるのと同じかそれ以上の衝撃を反対方向に与えるからです。\nファンは常にセイルに与えるのと同じかそれ以上の衝撃を逆方向に与えるからです。これと同じ原理が、太陽電池にも当てはまるのでしょうか。",
      "title": "ソーラーセイル宇宙船は、推進力を得るために自らのレーザーエミッターを搭載することができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一个经典的物理问题，问我们为什么不把风扇放在我们的\n在没有风的时候给我们的帆船提供动力？明显的答案是\n风扇在相反的方向上提供的冲力总是等于或超过\n它提供给帆的动力。这个原则是否也适用于太阳能？",
      "title": "太阳帆飞船能否携带自己的激光发射器来提供推进力，或者激光会不会将自己的发射器向后推？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一個經典的物理問題，問我們爲什麼不把風扇放在我們的\n在沒有風的時候給我們的帆船提供動力？明顯的答案是\n風扇在相反的方向上提供的衝力總是等於或超過\n它提供給帆的動力。這個原則是否也適用於太陽能？",
      "title": "太陽帆飛船能否攜帶自己的激光發射器來提供推進力，或者激光會不會將自己的發射器向後推？"
    }
  ]
}