{
  "author": "CornCheeseMafia",
  "original_created_utc": 1649265638,
  "title": "Crypto won’t solve any of these problems you think they’ll solve because you don’t understand the problem",
  "created_utc": 1649292907,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Crypto is at the end of the day a shared record ledger. That’s it. &lt;/p&gt;\n\n&lt;p&gt;Regarding that other popular post, this doesn’t mean Ticketmaster can’t charge us ridiculous extra fees for facilitating concert ticket sales because they work with the people who own and operate the venue. Not the artists. &lt;/p&gt;\n\n&lt;p&gt;This has nothing to do with centralization and it has nothing to do with the form of currency they’re ripping us off in. &lt;/p&gt;\n\n&lt;p&gt;Crypto won’t solve asset seizure or sanctions.&lt;/p&gt;\n\n&lt;p&gt;It’s not designed to help you evade your taxes. &lt;/p&gt;\n\n&lt;p&gt;It’s not going to “dethrone” fiat currency because it’s not a competition. &lt;/p&gt;\n\n&lt;p&gt;Crypto is a tool like the internet is a tool. It’s one component in a large machine and can be used to serve and to fuck us, usually at the same time. &lt;/p&gt;\n\n&lt;p&gt;We aren’t going to replace governments with a crypto backed DAO because the problem corrupt governments isn’t that we don’t have a shared ledger. &lt;/p&gt;\n\n&lt;p&gt;Anytime there’s a problem and you think crypto can solve it, consider what the problem actually is and what having access to shared record would solve with respect to that problem. &lt;/p&gt;\n\n&lt;p&gt;Media blackout in your war torn country? Crypto doesn’t solve this. PayPal, gofundme, etc stopped processing your cash? Unless you can exclusively pay all your bills and be paid in crypto, it won’t help you there either. &lt;/p&gt;\n\n&lt;p&gt;At the end of the day, remember what blockchain is. It’s a decentralized ledger. It’s a SQL database that everyone can see and no one can modify. Only it’s slower and consumes far more resources than a single SQL server. &lt;/p&gt;\n\n&lt;p&gt;Unless the issue is ultimately rooted in ineffective record keeping, crypto doesn’t really solve it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 352,
  "permalink": "/r/CryptoCurrency/comments/txr9jf/crypto_wont_solve_any_of_these_problems_you_think/",
  "subreddit": "CryptoCurrency",
  "id": "txr9jf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Crypto is at the end of the day a shared record ledger. That’s it.\n\nRegarding that other popular post, this doesn’t mean Ticketmaster can’t charge\nus ridiculous extra fees for facilitating concert ticket sales because they work\nwith the people who own and operate the venue. Not the artists.\n\nThis…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は結局のところ、共有記録台帳です。それだけなんです。\n\nもう一つの人気のある投稿についてですが、これはチケットマスターが\nコンサートチケットの販売を促進するために、私たちにばかげた追加手数料を支払う。\n会場を所有し、運営する人たちと一緒に。アーティストではありません。\n\nこれは...",
      "title": "暗号は、あなたが問題を理解していないので、あなたが解決すると思っているこれらの問題のいずれも解決しないでしょう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Crypto在一天结束时是一个共享记录账本。就这样吧。\n\n关于另一个热门帖子，这并不意味着Ticketmaster不能向我们收取\n我们收取可笑的额外费用来促进音乐会门票销售，因为他们的工作\n他们与拥有和经营场地的人合作。而不是艺术家。\n\n这...",
      "title": "Crypto不会解决任何你认为他们会解决的问题，因为你不了解这个问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Crypto在一天結束時是一個共享記錄賬本。就這樣吧。\n\n關於另一個熱門帖子，這並不意味着Ticketmaster不能向我們收取\n我們收取可笑的額外費用來促進音樂會門票銷售，因爲他們的工作\n他們與擁有和經營場地的人合作。而不是藝術家。\n\n這...",
      "title": "Crypto不會解決任何你認爲他們會解決的問題，因爲你不瞭解這個問題"
    }
  ]
}