{
  "author": "CornCheeseMafia",
  "original_created_utc": 1649265638,
  "title": "Crypto won’t solve any of these problems you think they’ll solve because you don’t understand the problem",
  "created_utc": 1649292907,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Crypto is at the end of the day a shared record ledger. That’s it. &lt;/p&gt;\n\n&lt;p&gt;Regarding that other popular post, this doesn’t mean Ticketmaster can’t charge us ridiculous extra fees for facilitating concert ticket sales because they work with the people who own and operate the venue. Not the artists. &lt;/p&gt;\n\n&lt;p&gt;This has nothing to do with centralization and it has nothing to do with the form of currency they’re ripping us off in. &lt;/p&gt;\n\n&lt;p&gt;Crypto won’t solve asset seizure or sanctions.&lt;/p&gt;\n\n&lt;p&gt;It’s not designed to help you evade your taxes. &lt;/p&gt;\n\n&lt;p&gt;It’s not going to “dethrone” fiat currency because it’s not a competition. &lt;/p&gt;\n\n&lt;p&gt;Crypto is a tool like the internet is a tool. It’s one component in a large machine and can be used to serve and to fuck us, usually at the same time. &lt;/p&gt;\n\n&lt;p&gt;We aren’t going to replace governments with a crypto backed DAO because the problem corrupt governments isn’t that we don’t have a shared ledger. &lt;/p&gt;\n\n&lt;p&gt;Anytime there’s a problem and you think crypto can solve it, consider what the problem actually is and what having access to shared record would solve with respect to that problem. &lt;/p&gt;\n\n&lt;p&gt;Media blackout in your war torn country? Crypto doesn’t solve this. PayPal, gofundme, etc stopped processing your cash? Unless you can exclusively pay all your bills and be paid in crypto, it won’t help you there either. &lt;/p&gt;\n\n&lt;p&gt;At the end of the day, remember what blockchain is. It’s a decentralized ledger. It’s a SQL database that everyone can see and no one can modify. Only it’s slower and consumes far more resources than a single SQL server. &lt;/p&gt;\n\n&lt;p&gt;Unless the issue is ultimately rooted in ineffective record keeping, crypto doesn’t really solve it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 352,
  "permalink": "/r/CryptoCurrency/comments/txr9jf/crypto_wont_solve_any_of_these_problems_you_think/",
  "subreddit": "CryptoCurrency",
  "id": "txr9jf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Crypto is at the end of the day a shared record ledger. That’s it.\n\nRegarding that other popular post, this doesn’t mean Ticketmaster can’t charge\nus ridiculous extra fees for facilitating concert ticket sales because they work\nwith the people who own and operate the venue. Not the artists.\n\nThis…"
}