{
  "author": "xandel434",
  "original_created_utc": 1633310303,
  "title": "Solana NFT rug pull",
  "created_utc": 1633336984,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m surprised I haven’t seen this blow up here but recently an NFT project (Baller Ape Club) was set to be released but after people tried to mint their apes no one received any NFTs. The website had an error built in when a Solana deposit was made to prompt the miter to try again (giving them more money). Auto confirm wallets were drained. The scam team made out with 2.2 million. 1 hour before the project was set to release they blocked comments on the discord and after an hour or so deleted the discord, twitter, etc.</p>\n\n<p>The mint wallet I believe is (4BGKKuj26cbxJNszGXMMzw1gettydfg8SVfaAnRWZ9ud) moving around 15k solana through various different wallets.</p>\n\n<p>Let this be a lesson folks. If the team is a ghost even if the discord community is great, the end result will be like this most often than not.</p>\n\n<p>Edit: Title should be “Solana NFT project Scam” not “rug pull”. But… semantics.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/q0va7o/solana_nft_rug_pull/",
  "subreddit": "CryptoCurrency",
  "id": "q0va7o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m surprised I haven’t seen this blow up here but recently an NFT project\n(Baller Ape Club) was set to be released but after people tried to mint their\napes no one received any NFTs. The website had an error built in when a Solana\ndeposit was made to prompt the miter to try again (giving them more…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで吹聴していないのが不思議なくらいですが、最近NFTのプロジェクト\n(Baller Ape Club)がリリースされる予定でしたが、人々が自分の猿をミントにしようとした後、誰もNFTを受け取りませんでした。\nNFTを受け取った人はいませんでした。ウェブサイトでは、ソラナの入金時にエラーが発生していました。\nサイトには、ソラナのデポジットが発生した際にエラーが発生し、マイスターに再挑戦を促すようになっていました（より多くの...",
      "title": "ソラナNFTのラグプル"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很惊讶我没有在这里看到这个消息，但最近一个NFT项目\n(Baller Ape Club)将被发布，但在人们试图铸造他们的\n猿后，没有人收到任何NFT。该网站有一个错误，当一个Solana\n存款时，网站有一个错误，以提示铸币人再次尝试（给他们更多...",
      "title": "索拉娜NFT地毯拉花"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很驚訝我沒有在這裏看到這個消息，但最近一個NFT項目\n(Baller Ape Club)將被髮布，但在人們試圖鑄造他們的\n猿後，沒有人收到任何NFT。該網站有一個錯誤，當一個Solana\n存款時，網站有一個錯誤，以提示鑄幣人再次嘗試（給他們更多...",
      "title": "索拉娜NFT地毯拉花"
    }
  ]
}