{
  "author": "LordCommanderBlack",
  "original_created_utc": 1636300296,
  "title": "How has the introduction of the \"trailer house\" affected city planning, wealth accumulation, and general public health?",
  "created_utc": 1636348913,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So what I&#39;ve gathered, the classic trailer house was introduced around the 1950s and was marketed as the &quot;home of the future&quot; that would be cheap, comfortable, and everywhere.</p>\n\n<p>Currently, trailer house communities &quot;trailer parks&quot; have an unsavory reputation.</p>\n\n<p>In my rural area, it&#39;s very common to see trailers from the 1950-60s to still be living in while on several acres of land, and with a number of modifications on them.</p>\n\n<p>I&#39;m curious on if the introduction of these cheap houses <em>hurt</em> those families as they don&#39;t accumulate value as traditional housing does <strong>or</strong> possibly it&#39;s <em>helped</em> those families to have an easy way to get modern amenities in a house and these rural areas might have continued to live in Adobe houses without power or plumbing, or poorly done power and plumbing.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qor89c/how_has_the_introduction_of_the_trailer_house/",
  "subreddit": "AskHistorians",
  "id": "qor89c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So what I've gathered, the classic trailer house was introduced around the 1950s\nand was marketed as the \"home of the future\" that would be cheap, comfortable,\nand everywhere.\n\nCurrently, trailer house communities \"trailer parks\" have an unsavory\nreputation.\n\nIn my rural area, it's very common to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が調べたところ、クラシックなトレーラーハウスは1950年代頃に登場したもので\n安くて、快適で、どこにでも行ける「未来の家」として発売されました。\nそしてどこにでもある。\n\n現在、トレーラーハウスのコミュニティである「トレーラーパーク」には、不愉快な評判があります。\n評判です。\n\n私の田舎では、ごく普通に...",
      "title": "トレーラーハウス」の導入は、都市計画や富の蓄積、一般市民の健康にどのような影響を与えたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我所收集到的信息是，经典的拖车房是在20世纪50年代左右推出的\n并被推销为 \"未来的家\"，它将是廉价、舒适。\n而且无处不在。\n\n目前，拖车房社区 \"拖车公园 \"有一个令人不快的\n名声。\n\n在我所在的农村地区，很常见到...",
      "title": "\"拖车屋 \"的引入如何影响了城市规划、财富积累和一般公众健康？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我所收集到的信息是，經典的拖車房是在20世紀50年代左右推出的\n並被推銷爲 \"未來的家\"，它將是廉價、舒適。\n而且無處不在。\n\n目前，拖車房社區 \"拖車公園 \"有一個令人不快的\n名聲。\n\n在我所在的農村地區，很常見到...",
      "title": "\"拖車屋 \"的引入如何影響了城市規劃、財富積累和一般公衆健康？"
    }
  ]
}