{
  "author": "Set1Less",
  "original_created_utc": 1625573749,
  "title": "China banned Didi (Chinese Uber) just 2 days after USA IPO. Americans invested in this are losing big time. Where is the \"investor protection\"? US regulators dont care. Investor protection comes in only when its crypto - an asset class up a huge %.",
  "created_utc": 1625589107,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The double standards are just incredible. Bill Sherman says people should not invest in risky assets like Crypto but should instead invest in stocks, and these are the kind of stocks that the US regulators allow to IPO in the USA, allowing gullible US citizens and investors access to shady companies that dont even bother disclosing an ongoing investigation during its IPO. And voila, just 2 days after its IPO, heading into the long weekend, China banned this app from its app stores. </p>\n\n<p><a href=\"https://preview.redd.it/0tzs4l7j1l971.jpg?width=1338&amp;format=pjpg&amp;auto=webp&amp;s=5f6907f6fb2be4ce1ad85ea5de42292855ce53a8\">And today the price of Didi has crashed 25&#37; pre-market. </a></p>\n\n<p>But for the same Bill Sherman, bitcoin and crypto is just gambling, while investing in shady Chinese stocks that are approved by US regulators is &quot;investing&quot;. This is not even the first time that a Chinese company is exploiting US people&#39;s money. Couple of years ago, Luckin Coffee pulled the same thing by fudging its numbers and when the scam was exposed, all the US investors lost heavily. Dozens of other shady Chinese companies still continue to be listed in US public markets, without any oversight or monitoring. These scams will bust right in front of the SEC&#39;s eyes, but the SEC wont be least bothered by what these shady entities are upto. </p>\n\n<p>After Luckin Coffee scandal, lots of talk was in the air about tightening access to US markets for Chinese companies looking to raise funds. Hardly 2 years later, Didi pulls this soft scam now by not even disclosing an ongoing investigation during its IPO. First of all, what is the need to allow a Chinese company to raise funds in US markets? </p>\n\n<p>But for the regulators and legislators like Sherman, these shady companies in less than transparent offshore jurisdictions are good investments while anything associated with Crypto is automatically termed a scam, even though he does not know much about crypto at all. </p>\n\n<p>These regulators and legislators dont care at all about people&#39;s safety or finances. If they really care about investors safety (muh investor protection), junk companies like Luckin Coffee and Didi wont ever be allowed to raise funds from Americans in a blatant manner suppressing vital information about their operations. Investor protection only comes into the picture when its Bitcoin - an asset class that has grown by 10,000% last decade. </p>\n\n<p>You see, investor protection only exists to protect people.. from becoming rich and financially successful.</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/oetpwq/china_banned_didi_chinese_uber_just_2_days_after/",
  "subreddit": "CryptoCurrency",
  "id": "oetpwq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The double standards are just incredible. Bill Sherman says people should not\ninvest in risky assets like Crypto but should instead invest in stocks, and\nthese are the kind of stocks that the US regulators allow to IPO in the USA,\nallowing gullible US citizens and investors access to shady companies…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ダブルスタンダードは信じられないほどです。ビル・シャーマンは、人々はリスクのある投資をすべきではないと\nビル・シャーマンは、人々は暗号のようなリスクの高い資産に投資すべきではなく、株式に投資すべきだと言います。\n米国の規制当局が米国でのIPOを許可しているような銘柄です。\n騙されやすい米国市民や投資家が怪しげな企業にアクセスできるように...。",
      "title": "中国がDidi（中国版Uber）を禁止したのは、米国のIPOからわずか2日後のことでした。これに投資したアメリカ人は大損している。投資家保護」はどこにあるのか？米国の規制当局は気にしていません。投資家保護は、資産クラスが大幅に上昇している暗号の場合にのみ行われます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "双重标准实在是令人难以置信。比尔-谢尔曼说人们不应该\n投资于像加密货币这样的风险资产，而应该投资于股票，而这些是美国监管的股票。\n这些是美国监管机构允许在美国进行IPO的股票。\n允许易受骗的美国公民和投资者进入黑幕公司...",
      "title": "中国禁止滴滴（中国优步）在美国上市后仅2天。投资于此的美国人损失惨重。\"投资者保护 \"在哪里？美国监管机构并不关心。只有当加密货币--一个涨幅巨大的资产类别--出现时，投资者保护才会出现。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雙重標準實在是令人難以置信。比爾-謝爾曼說人們不應該\n投資於像加密貨幣這樣的風險資產，而應該投資於股票，而這些是美國監管的股票。\n這些是美國監管機構允許在美國進行IPO的股票。\n允許易受騙的美國公民和投資者進入黑幕公司...",
      "title": "中國禁止滴滴（中國優步）在美國上市後僅2天。投資於此的美國人損失慘重。\"投資者保護 \"在哪裏？美國監管機構並不關心。只有當加密貨幣--一個漲幅巨大的資產類別--出現時，投資者保護纔會出現。"
    }
  ]
}