{
  "author": "elbigbuf",
  "original_created_utc": 1634550766,
  "title": "How is Islam not a cult ?",
  "created_utc": 1634556056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wanna preface this by saying that I come from and currently live in a &quot;muslim country&quot;. I grew up in a muslim household and was taught Islam. I know the subject. I&#39;m also not trying to insult muslims. They are free to believe whatever they want.</p>\n\n<p>Anyway like I said, my parents taught me Islam as a kid which made me a &quot;muslim&quot;. But, as I matured and got to do my own research on religion, I discovered many things about Islam which conflicted with my personal set of beliefs and morals.</p>\n\n<p>I also realized that what we are told when we&#39;re kids about Islam is basically &quot;the good stuff&quot; while all the dark, violent, discriminating parts of it are cast aside until you&#39;re too deep in the religious psyche to actually question it.</p>\n\n<p>Which makes me ask this question: how is Islam not considered a cult ?</p>\n\n<p>It&#39;s a complete and thorough brain washing of (young) minds that makes them adhere to extreme ignorant ideas that at best lead to discrimination and at worst to abhorrent violence.</p>\n\n<p>It&#39;s also completely against any modernization and insists on applying every word of the Quran as is, because it&#39;s seen as the literal word of God.</p>\n\n<p>Even questioning such concepts is considered blasphemy and apostasy. And guess what, apostates are to be executed, most Islamic scholars say (there is a hadith -a Muhammad quote- which indicates the death penalty for ex muslims).</p>\n\n<p>I have seen first hand what Islam does to a society. My country is deeply misogynistic and antisemitic. Don&#39;t even get me started on homophobia. Average people here rely on faith healers more often than they do on physicians, especially when it comes to psychiatric pathologies. They firmly believe in eccentric paranormal phenomenons such as sorcery and possessions and get extremely hostile against anyone who isn&#39;t muslim.\nRecently, with the Taliban takeover of Afghanistan, I have seen a vast majority of my fellow countrymen cheer for the Taliban and wish for such a fate to our nation. Because apparently we strayed too far from God, hence why we are poor and &quot;rotten&quot;.</p>\n\n<p>So really, what makes this religion &quot;typical&quot; ? Why is it considered okay ? How is Islam not a cult ?</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/TooAfraidToAsk/comments/qajgme/how_is_islam_not_a_cult/",
  "subreddit": "TooAfraidToAsk",
  "id": "qajgme",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I wanna preface this by saying that I come from and currently live in a \"muslim\ncountry\". I grew up in a muslim household and was taught Islam. I know the\nsubject. I'm also not trying to insult muslims. They are free to believe\nwhatever they want.\n\nAnyway like I said, my parents taught me Islam as a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私は「イスラムの国」の出身で、現在はそこに住んでいます。\n国」に住んでいます。私はイスラム教徒の家庭で育ち、イスラム教を教えられました。私はそのことを知っています。\nを知っています。また、私はイスラム教徒を侮辱するつもりはありません。彼らが何を信じるかは自由です。\n彼らが何を信じようと自由です。\n\nとにかく私が言ったように、私の両親は私にイスラム教を...",
      "title": "イスラム教はカルトではないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想先说一下，我来自一个 \"穆斯林国家\"，目前也生活在一个 \"穆斯林国家\"。\n国家\"。我在一个穆斯林家庭中长大，并接受了伊斯兰教教育。我知道这个\n主题。我也不是要侮辱穆斯林。他们可以自由地相信\n任何他们想要的东西。\n\n总之就像我说的，我的父母教我伊斯兰教，作为一个...",
      "title": "伊斯兰教怎么不是邪教？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想先說一下，我來自一個 \"穆斯林國家\"，目前也生活在一個 \"穆斯林國家\"。\n國家\"。我在一個穆斯林家庭中長大，並接受了伊斯蘭教教育。我知道這個\n主題。我也不是要侮辱穆斯林。他們可以自由地相信\n任何他們想要的東西。\n\n總之就像我說的，我的父母教我伊斯蘭教，作爲一個...",
      "title": "伊斯蘭教怎麼不是邪教？"
    }
  ]
}