{
  "author": "SuperSonicRocket",
  "original_created_utc": 1627196541,
  "title": "PSA: Do not trust a “used” or second-hand hardware wallet (e.g. from eBay or Etsy or Craigslist or Amazon or your neighbor’s cousin). Only trust hardware wallets in their original packaging, purchased directly from the manufacturer (like Trezor or Ledger).",
  "created_utc": 1627209742,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The whole point of the hardware wallet is to keep your crypto safe from malicious third parties. Buying a used, potentially compromised device completely defeats this purpose.</p>\n\n<p>A coworker of mine just fell victim, and lost all his crypto after buying a used hardware wallet. He thought he was being smart and frugal by saving $30 on a hardware wallet. At least he only lost a few thousand doge and other assorted shitcoins…</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/CryptoCurrency/comments/or6w1v/psa_do_not_trust_a_used_or_secondhand_hardware/",
  "subreddit": "CryptoCurrency",
  "id": "or6w1v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The whole point of the hardware wallet is to keep your crypto safe from\nmalicious third parties. Buying a used, potentially compromised device\ncompletely defeats this purpose.\n\nA coworker of mine just fell victim, and lost all his crypto after buying a used\nhardware wallet. He thought he was being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハードウェアウォレットの目的は、悪意のある第三者から自分の暗号を守ることです。\n悪意のある第三者からお客様の暗号を守ることです。中古の危険なデバイスを購入することは\nこの目的は完全に失われます。\n\n私の同僚は、中古のハードウェアウォレットを購入したことで被害に遭い、すべての暗号を失ってしまいました。\nハードウェアウォレットを購入しました。彼は自分のことを...",
      "title": "PSA: 「中古」のハードウェアウォレットを信用しないでください（例：eBay、Etsy、Craigslist、Amazon、隣人のいとこなど）。TrezorやLedgerのように、メーカーから直接購入した、オリジナルパッケージのハードウェアウォレットのみを信用してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "硬件钱包的全部意义在于保护你的加密货币不受\n恶意的第三方。购买一个二手的、有可能被破坏的设备\n完全违背了这个目的。\n\n我的一个同事刚刚成为受害者，在购买了一个二手的\n硬件钱包。他认为自己是被...",
      "title": "PSA：不要相信 \"二手 \"或二手硬件钱包（例如，从eBay或Etsy或Craigslist或亚马逊或你邻居的表弟那里）。只相信原包装的硬件钱包，直接从制造商那里购买（如Trezor或Ledger）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "硬件錢包的全部意義在於保護你的加密貨幣不受\n惡意的第三方。購買一個二手的、有可能被破壞的設備\n完全違背了這個目的。\n\n我的一個同事剛剛成爲受害者，在購買了一個二手的\n硬件錢包。他認爲自己是被...",
      "title": "PSA：不要相信 \"二手 \"或二手硬件錢包（例如，從eBay或Etsy或Craigslist或亞馬遜或你鄰居的表弟那裏）。只相信原包裝的硬件錢包，直接從製造商那裏購買（如Trezor或Ledger）。"
    }
  ]
}