{
  "author": "AstronomerFar5463",
  "original_created_utc": 1638204805,
  "title": "How do I get my friends to stop talking about race while we are out?",
  "created_utc": 1638234760,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, I am wondering how I get my girlfriends (we are all the same race) to stop talking about race when we are out. It’s either self-degrading or racist, sometime productive. But when I’m out I don’t want to bask in self-pity or political talk. When things get quiet, it goes back to race. When the conversation is elsewhere, it is redirected to race or gossip. How do I revert or redirect the convo without mentioning that I am or sounding annoyed/ judgy. It happens in other groups too. I just don’t like the trauma bonding.</p>\n\n<p>Edit: I am not white. Stating this for context. I am not interested in the opinion that I don’t care about racial issues cause it doesn’t affect me. It does! I just don’t want to talk about it all the time.</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/r502tj/how_do_i_get_my_friends_to_stop_talking_about/",
  "subreddit": "TooAfraidToAsk",
  "id": "r502tj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi all, I am wondering how I get my girlfriends (we are all the same race) to\nstop talking about race when we are out. It’s either self-degrading or racist,\nsometime productive. But when I’m out I don’t want to bask in self-pity or\npolitical talk. When things get quiet, it goes back to race. When…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんこんにちは、私はどうやって女友達（全員同じ人種です）に\n人種の話をしないようにさせるにはどうしたらいいでしょうか？自虐的になるか、人種差別的になるかのどちらかだと思います。\n時には生産的なこともあります。しかし、私が外出しているときは、自己憐憫や政治的な話に浸りたくありません。\n政治的な話はしたくありません。静かになると、また人種の話になります。それは...",
      "title": "外出先で友達に人種の話をさせないようにするにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我想知道如何让我的女朋友们（我们都是同一种族）在外出时不再谈论种族问题。\n停止谈论种族问题，当我们出去的时候。这要么是自我贬低，要么是种族主义者。\n有时还很有成效。但是当我出去的时候，我不想沉浸在自怜自艾或\n政治谈话。当事情变得安静时，就会回到种族问题上。当...",
      "title": "我怎样才能让我的朋友在我们外出时不再谈论种族问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我想知道如何讓我的女朋友們（我們都是同一種族）在外出時不再談論種族問題。\n停止談論種族問題，當我們出去的時候。這要麼是自我貶低，要麼是種族主義者。\n有時還很有成效。但是當我出去的時候，我不想沉浸在自憐自艾或\n政治談話。當事情變得安靜時，就會回到種族問題上。當...",
      "title": "我怎樣才能讓我的朋友在我們外出時不再談論種族問題？"
    }
  ]
}