{
  "author": "Michael12390",
  "the_new_excerpt": "Seriously if you can’t sleep at night because Bitcoin fell 20% then you have too\nmuch of your assets allocated to it. Bitcoin is volatile. It will swing a lot in\nboth directions. You need to be able to handle the volatility. If you can’t\nhandle the volatility then don’t put so much of your money…",
  "original_created_utc": 1610368280,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，如果你因为比特币下跌20%而晚上睡不着觉，那么你也会睡不着觉\n你的大部分资产都分配给它了。比特币具有波动性。它会有很大的回旋余地\n两个方向。你需要能够应对波动性。如果你不能\n处理好波动，那就不要把这么多钱放在…",
      "title": "如果你对这一下跌感到非常紧张，那么你就是过度杠杆化了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，如果你因爲比特幣下跌20%而晚上睡不着覺，那麼你也會睡不着覺\n你的大部分資產都分配給它了。比特幣具有波動性。它會有很大的迴旋餘地\n兩個方向。你需要能夠應對波動性。如果你不能\n處理好波動，那就不要把這麼多錢放在…",
      "title": "如果你對這一下跌感到非常緊張，那麼你就是過度槓桿化了。"
    }
  ],
  "title": "If you’re extremely nervous about this drop, then you’re over leveraged.",
  "created_utc": 1610379412,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously if you can’t sleep at night because Bitcoin fell 20% then you have too much of your assets allocated to it. Bitcoin is volatile. It will swing a lot in both directions. You need to be able to handle the volatility. If you can’t handle the volatility then don’t put so much of your money into it. If you only put 20% of your money in Bitcoin and the price falls 20%, then that’s only a 4% drop in your net worth. If Bitcoin is 50%, then that’s a 10% drop. If you cannot handle these swings then to need to lower your exposure. You should not be up at night wondering how much money you may gain or lose the next day and how it will affect your financial situation. This mostly goes for losing money though as no one seems to think they’re over leveraged when they’re making money.</p>\n\n<p>Edit: I meant overexposed not over leveraged.</p>\n</div><!-- SC_ON -->",
  "score": 4074,
  "permalink": "/r/Bitcoin/comments/kv1qmh/if_youre_extremely_nervous_about_this_drop_then/",
  "subreddit": "Bitcoin",
  "id": "kv1qmh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706373016
}