{
  "author": "Monovon",
  "the_new_excerpt": "I have been struggling for weeks now with a verified Binance account and\neverytime I write on r/binance [/r/binance] they delete my post. Many peoples\nfunds are trapped. Thousands of dollars are held hostage.\n\nTwo weeks ago I wrote to the help center and all they are doing is bumming me\noff. Please…",
  "original_created_utc": 1616428688,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经在Binance账户上挣扎了好几周了，我的账户是经过验证的。\n每次我在r/binance[/r/binance]上写文章，他们都会删除我的帖子。许多人\n资金被套牢。数千美元被挟持。\n\n两个星期前，我给帮助中心写信，他们所做的一切就是在忽悠我。\n关。请你...",
      "title": "资金被Binance挟持。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經在Binance賬戶上掙扎了好幾周了，我的賬戶是經過驗證的。\n每次我在r/binance[/r/binance]上寫文章，他們都會刪除我的帖子。許多人\n資金被套牢。數千美元被挾持。\n\n兩個星期前，我給幫助中心寫信，他們所做的一切就是在忽悠我。\n關。請你...",
      "title": "資金被Binance挾持。"
    }
  ],
  "title": "Funds are being held hostage by Binance.",
  "created_utc": 1616456676,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been struggling for weeks now with a verified Binance account and everytime I write on <a href=\"/r/binance\">r/binance</a> they delete my post. Many peoples funds are trapped. Thousands of dollars are held hostage. </p>\n\n<p>Two weeks ago I wrote to the help center and all they are doing is bumming me off. Please check Binance sub reddit, new posts. The reason I am writing this is not to share my frustration and the amount of opportunities I have lost, but to create awareness that it has become a real problem and situation. I do not recommend Binance to anyone, the customer support is a joke. I don’t know what will happen. If there is anyone else in the same situation please upvote this post. Our voices need to be heard.</p>\n\n<p>Edit: Binance Global not U.S.</p>\n</div><!-- SC_ON -->",
  "score": 220,
  "permalink": "/r/CryptoCurrency/comments/maqycx/funds_are_being_held_hostage_by_binance/",
  "subreddit": "CryptoCurrency",
  "id": "maqycx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816912
}