{
  "author": "melanchohol",
  "original_created_utc": 1634503534,
  "title": "Girlfriend wants to invest, but I don't know shit about fuck.",
  "created_utc": 1634542270,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, the good news first. My girlfriend is ready to invest into crypto <em>(\\</em>pats myself in the back)*. She has fiat ready, sitting in an exchange. Now she&#39;s looking for a good opportunity to buy in.</p>\n\n<p>She is asking me for advice, and the thing is, I&#39;m no expert either. It&#39;s just my second month into the cryptoverse, and I think that makes me kind of a newbie. I only know the basics - DCA and HODL if you believe in the coin, buy the dip, take profits if you want to etc etc.</p>\n\n<p>I can ask her to buy the next dip, but I don&#39;t want her losing money. She&#39;ll invest more for long term returns, but only if she does not lose money in the next few days/weeks/months after investing. She, just like you and I, sees crypto as a medium for parabolic growth, and I want her to buy in at the right time.</p>\n\n<p>So tell me what I can ask her to do. Which coins, and most importantly, WHEN?  </p>\n\n<p>EDIT - Since I am desperate for a good answer to this, I&#39;ll tip a couple moons to the ones I find helpful.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/qa7bdu/girlfriend_wants_to_invest_but_i_dont_know_shit/",
  "subreddit": "CryptoCurrency",
  "id": "qa7bdu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, the good news first. My girlfriend is ready to invest into crypto (\\pats\nmyself in the back)*. She has fiat ready, sitting in an exchange. Now she's\nlooking for a good opportunity to buy in.\n\nShe is asking me for advice, and the thing is, I'm no expert either. It's just\nmy second month into the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では、まず良いニュースを。私のガールフレンドが、クリプトに投資する準備ができています（˶ˆ꒳ˆ˵ )\n自分の背中を押す）*。) 彼女はフィアットを用意して、取引所に預けています。今、彼女は\n今、彼女は購入するための良い機会を探しています。\n\n彼女は私にアドバイスを求めていますが、実際のところ、私も専門家ではありません。私はまだ\n2ヶ月目にして...",
      "title": "彼女は投資をしたいと言っていますが、私はファックについて何も知りません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，先说好消息。我的女朋友已经准备好投资加密货币了。\n我自己在后面）*。) 她已经准备好了法币，放在一个交易所里。现在她正在\n现在她正在寻找一个好的机会来买入。\n\n她在向我征求意见，问题是，我也不是专家。这只是\n我进入这个行业的第二个月...",
      "title": "女友想投资，但我对他妈的一无所知。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，先說好消息。我的女朋友已經準備好投資加密貨幣了。\n我自己在後面）*。) 她已經準備好了法幣，放在一個交易所裏。現在她正在\n現在她正在尋找一個好的機會來買入。\n\n她在向我徵求意見，問題是，我也不是專家。這只是\n我進入這個行業的第二個月...",
      "title": "女友想投資，但我對他媽的一無所知。"
    }
  ]
}