{
  "author": "Mynameistowelie",
  "the_new_excerpt": "Inflation and taxes can easily erode your profits/gains over time. Especially\nwhen you enter and exit trades consistently over the long-term or if your\ninvestments are placed in a non-tax sheltered account.\n\nYour break-even rate is the rate of return you need to make just to keep up your\npurchasing…",
  "original_created_utc": 1616493944,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "通货膨胀和税收很容易随着时间的推移侵蚀你的利润/收益。尤其是\n当你长期持续地进入和退出交易时，或者如果你的...。\n投资放在一个非避税账户中。\n\n你的盈亏平衡率是指你需要赚取的回报率，以维持你的收入。\n采购...",
      "title": "投资者。确保你们都了解并知道如何计算你们的 \"盈亏平衡率\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通貨膨脹和稅收很容易隨着時間的推移侵蝕你的利潤/收益。尤其是\n當你長期持續地進入和退出交易時，或者如果你的...。\n投資放在一個非避稅賬戶中。\n\n你的盈虧平衡率是指你需要賺取的回報率，以維持你的收入。\n採購...",
      "title": "投資者。確保你們都瞭解並知道如何計算你們的 \"盈虧平衡率\"。"
    }
  ],
  "title": "Investors: Make sure you all understand and know how to calculate your “Break-Even Rate”.",
  "created_utc": 1616505048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Inflation and taxes can easily erode your profits/gains over time. Especially when you enter and exit trades consistently over the long-term or if your investments are placed in a non-tax sheltered account. </p>\n\n<p>Your break-even rate is the rate of return you need to make just to keep up your purchasing power level, not including brokerage fees.</p>\n\n<p>To calculate, first estimate the rate of inflation you expect to experience over the next year, you can refer to the Bureau of Labour statistics (BLS) which also publishes the Consumer price index (CPI) which is a measure of inflation. (For the U.S)</p>\n\n<p>To calculate your break-even rate you can use the formula: (i) / (100 - E) = B</p>\n\n<p>B: Break-even rate\nI: Inflation \nE: Effective tax-rate </p>\n\n<p>Ex. If you assume a (2%) inflation over the coming year and your combined tax rate is 44% then your break even rate is: </p>\n\n<p>2% / (100 - 44) = (3.6%). </p>\n\n<p>3.6% “Net” on your portfolio to maintain your purchasing power. Earning this rate does not provide any real profits, it only maintains the value of your investments.</p>\n\n<p>If you are earning less than your break-even rate after taxes and inflation have been taken into account, you are actually losing money on your total investments and may have to accept high risk just to maintain your purchasing power.</p>\n</div><!-- SC_ON -->",
  "score": 90,
  "permalink": "/r/stocks/comments/mbbcjc/investors_make_sure_you_all_understand_and_know/",
  "subreddit": "stocks",
  "id": "mbbcjc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822095
}