{
  "author": "SilverDragonYOLO",
  "original_created_utc": 1631289899,
  "title": "Think crypto is getting overbought? Why this bull cycle probably isn't over in three quick facts.",
  "created_utc": 1631309584,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was getting concerned that the crypto market has become too frothy and overbought and the start of a bear market may be impending. However, three important facts (IMO) made me strongly reconsider:</p>\n\n<ol>\n<li><p>The entire crypto currency market cap of around $2 trillion is still less than the market cap of Apple, just a single company, which currently has a $2.5 trillion market cap. Granted, Apple is one of the world&#39;s largest corporations, but the fact that the entire crypto industry is still valued at less than a single company is incredible.\n&nbsp;</p></li>\n<li><p>Continuing Central bank money printing. Almost all of the world&#39;s central banks are currently continuing to debase their currencies through quantitative easing (for those that don&#39;t know, this is just a fancy name for creating money out of thin air). The US Federal Reserve is currently adding approximately $120 BILLION every month to the currency. That&#39;s $1.44 trillion a year. And this is just one central bank. The combined currency creation of all central banks in the world is much, much higher. During the last crypto bull of 2016-17, this element was not in play. In fact, back then the Federal Reserve had stopped QE and was increasing interest rates.\n&nbsp;</p></li>\n<li><p>Institutional interest in crypto. It&#39;s not a secret that since quantitative easing money printing began in 2009, a large proportion of that newly created money has flown into the stock market, which is why stocks are in a raging bull market even during a pandemic. Now that institutions are paying more attention to crypto, that money will also flow here. \n&nbsp;</p></li>\n</ol>\n\n<p>So yes, while the astronomical increases in almost all coins since 2019 may make it seem like you&#39;re late to the party, it&#39;s IMO very possible that this bull market has a lot further to go.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/plnzzk/think_crypto_is_getting_overbought_why_this_bull/",
  "subreddit": "CryptoCurrency",
  "id": "plnzzk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was getting concerned that the crypto market has become too frothy and\noverbought and the start of a bear market may be impending. However, three\nimportant facts (IMO) made me strongly reconsider:\n\n 1. The entire crypto currency market cap of around $2 trillion is still less\n    than the market…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、暗号市場があまりにも活発で買われすぎており、弱気な市場の始まりが迫っているのではないかと懸念していました。\n買いすぎて弱気になっているのではないかと懸念していました。しかし、3つの\nつの重要な事実（IMO）によって、私は強く考え直しました。\n\n 1. 暗号通貨全体の時価総額は約2兆ドルで、まだ少ない。\n    市場規模よりも小さい...",
      "title": "暗号が買われすぎていると思いますか？なぜこの強気サイクルが終わらないのか、3つの簡単な事実をご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我越来越担心加密货币市场已经变得过于浮躁和超买。\n我开始担心加密货币市场已经变得过于繁荣和超买，熊市的开始可能即将来临。然而，有三个\n重要的事实（IMO）使我强烈地重新考虑。\n\n 1. 整个加密货币的市值约为2万亿美元，仍然低于\n    比起市场上的...",
      "title": "认为加密货币正在超买？为什么这个牛市周期可能还没有结束，有三个快速事实。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我越來越擔心加密貨幣市場已經變得過於浮躁和超買。\n我開始擔心加密貨幣市場已經變得過於繁榮和超買，熊市的開始可能即將來臨。然而，有三個\n重要的事實（IMO）使我強烈地重新考慮。\n\n 1. 整個加密貨幣的市值約爲2萬億美元，仍然低於\n    比起市場上的...",
      "title": "認爲加密貨幣正在超買？爲什麼這個牛市週期可能還沒有結束，有三個快速事實。"
    }
  ]
}