{
  "author": "issaknight",
  "original_created_utc": 1657015578,
  "title": "Is it weird to just sleep with your friend girls?",
  "created_utc": 1657029205,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 27 male single and I have a lotta female friends, we dont have any sexual interest to each other whenever we chill no matter with which one of them after a movie or series we watch or night we go out for drinks together we go to my place we wear pjs give hugs each other and sleep... absolutely nothing else! I get horny sometimes but I know that this are my friends and dont want to ruin this good, years of friendship I have for one fuck.  &lt;/p&gt;\n\n&lt;p&gt;Am I weird or? is this not right or... idk...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/vrufc9/is_it_weird_to_just_sleep_with_your_friend_girls/",
  "subreddit": "TooAfraidToAsk",
  "id": "vrufc9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm 27 male single and I have a lotta female friends, we dont have any sexual\ninterest to each other whenever we chill no matter with which one of them after\na movie or series we watch or night we go out for drinks together we go to my\nplace we wear pjs give hugs each other and sleep... absolutely…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は27歳、男性、独身、女友達がたくさんいます。\nを見るか、一緒に飲みに行くかのどちらかです。\n映画やシリーズを観た後や、夜に一緒に飲みに行った時は、僕の家に行って\nパジャマを着て、ハグをして、寝る......絶対に。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是27岁的单身男性，我有很多女性朋友，我们没有任何性关系。\n我们对彼此没有任何性趣，每当我们聊天的时候，不管是和哪个人一起看完电影或电视剧，或者晚上一起出去喝酒，我们都会\n我们看完电影或连续剧后，或晚上我们一起出去喝酒，我们去我的地方。\n我们穿上睡衣，互相拥抱，然后睡觉......绝对的......。",
      "title": "只和朋友的女孩睡觉很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是27歲的單身男性，我有很多女性朋友，我們沒有任何性關係。\n我們對彼此沒有任何性趣，每當我們聊天的時候，不管是和哪個人一起看完電影或電視劇，或者晚上一起出去喝酒，我們都會\n我們看完電影或連續劇後，或晚上我們一起出去喝酒，我們去我的地方。\n我們穿上睡衣，互相擁抱，然後睡覺......絕對的......。",
      "title": "只和朋友的女孩睡覺很奇怪嗎？"
    }
  ]
}