{
  "author": "Dr-Preposterous",
  "original_created_utc": 1656619395,
  "title": "Who’s here has gotten rich and stayed rich in crypto? I know you’re out there. I want to hear your TLDR on how well you’ve played the game.",
  "created_utc": 1656701313,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m assuming not everyone has played the game as poorly as me. I fell in love with blockchain tech in 2020 and then decided to get risky at the top of this recent market. I’m not in an awful position but I am forced to consolidate into 3 of my most passionate chains and ride the HODL train. &lt;/p&gt;\n\n&lt;p&gt;But I want to hear from the folks who have played the game well. Did you get in at 2015 and are you still way up despite the current bear? Did you get in in early 2021 and degen your way to glory and sell while the rest of us were sucking on the ‘Super Cycle/BTC to 100k by EOY’ hopium? &lt;/p&gt;\n\n&lt;p&gt;I know there’s got to be a bunch of you out there who are comfortably in the green right now. I’m not looking for advice, I’m just more curious on hearing a TLDR of what got you up in the green.&lt;/p&gt;\n\n&lt;p&gt;So out of the presented options. Do any of them apply?&lt;/p&gt;\n\n&lt;p&gt;A) Did defi and did well&lt;/p&gt;\n\n&lt;p&gt;B) Bought early, and still holding&lt;/p&gt;\n\n&lt;p&gt;C) Rode a meme coin with good timing&lt;/p&gt;\n\n&lt;p&gt;D) I bought low and sold high  &lt;/p&gt;\n\n&lt;p&gt;E) Actively trade. And doing well?&lt;/p&gt;\n\n&lt;p&gt;F) I was already rich, bought a bunch of stables and still just as rich&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/vohhja/whos_here_has_gotten_rich_and_stayed_rich_in/",
  "subreddit": "CryptoCurrency",
  "id": "vohhja",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m assuming not everyone has played the game as poorly as me. I fell in love\nwith blockchain tech in 2020 and then decided to get risky at the top of this\nrecent market. I’m not in an awful position but I am forced to consolidate into\n3 of my most passionate chains and ride the HODL train.\n\nBut I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんなが僕みたいに下手くそなプレイをしたわけではないと思っています。私は2020年にブロックチェーン技術に惚れ込み\n2020年にブロックチェーン技術に惚れ込み、そして、この直近の相場の頂点でリスクを取ることにしました。\n最近の市場です。私はひどいポジションにいるわけではありませんが、私はに統合することを余儀なくされています。\n3 of my most passionate chains and ride the HODL train.\n\nしかし、私は...",
      "title": "暗号で金持ちになった人、金持ちであり続けた人はここにいるのでしょうか？私はあなたがそこにいることを知っています。あなたがどのようにゲームをプレイしてきたか、あなたのTLDRを聞きたいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我假设不是每个人都像我一样把游戏玩得那么差。我爱上了\n2020年，我爱上了区块链技术，然后决定在这一时期的顶部获得风险。\n最近的市场。我的处境并不可怕，但我被迫整合成\n3个我最热衷的链子，并乘坐HODL列车。\n\n但我...",
      "title": "这里有谁在加密货币中发了财，并且一直发财？我知道你在那里。我想听听你的TLDR，你是如何玩好这个游戏的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我假設不是每個人都像我一樣把遊戲玩得那麼差。我愛上了\n2020年，我愛上了區塊鏈技術，然後決定在這一時期的頂部獲得風險。\n最近的市場。我的處境並不可怕，但我被迫整合成\n3個我最熱衷的鏈子，並乘坐HODL列車。\n\n但我...",
      "title": "這裏有誰在加密貨幣中發了財，並且一直髮財？我知道你在那裏。我想聽聽你的TLDR，你是如何玩好這個遊戲的。"
    }
  ]
}