{
  "author": "Dr-Preposterous",
  "original_created_utc": 1656619395,
  "title": "Who’s here has gotten rich and stayed rich in crypto? I know you’re out there. I want to hear your TLDR on how well you’ve played the game.",
  "created_utc": 1656701313,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m assuming not everyone has played the game as poorly as me. I fell in love with blockchain tech in 2020 and then decided to get risky at the top of this recent market. I’m not in an awful position but I am forced to consolidate into 3 of my most passionate chains and ride the HODL train. &lt;/p&gt;\n\n&lt;p&gt;But I want to hear from the folks who have played the game well. Did you get in at 2015 and are you still way up despite the current bear? Did you get in in early 2021 and degen your way to glory and sell while the rest of us were sucking on the ‘Super Cycle/BTC to 100k by EOY’ hopium? &lt;/p&gt;\n\n&lt;p&gt;I know there’s got to be a bunch of you out there who are comfortably in the green right now. I’m not looking for advice, I’m just more curious on hearing a TLDR of what got you up in the green.&lt;/p&gt;\n\n&lt;p&gt;So out of the presented options. Do any of them apply?&lt;/p&gt;\n\n&lt;p&gt;A) Did defi and did well&lt;/p&gt;\n\n&lt;p&gt;B) Bought early, and still holding&lt;/p&gt;\n\n&lt;p&gt;C) Rode a meme coin with good timing&lt;/p&gt;\n\n&lt;p&gt;D) I bought low and sold high  &lt;/p&gt;\n\n&lt;p&gt;E) Actively trade. And doing well?&lt;/p&gt;\n\n&lt;p&gt;F) I was already rich, bought a bunch of stables and still just as rich&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/vohhja/whos_here_has_gotten_rich_and_stayed_rich_in/",
  "subreddit": "CryptoCurrency",
  "id": "vohhja",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m assuming not everyone has played the game as poorly as me. I fell in love\nwith blockchain tech in 2020 and then decided to get risky at the top of this\nrecent market. I’m not in an awful position but I am forced to consolidate into\n3 of my most passionate chains and ride the HODL train.\n\nBut I…"
}