{
  "author": "_s79",
  "original_created_utc": 1637233525,
  "title": "My bank (Barclays UK) blocked my transfers, froze my mobile banking app, and locked my account due to my \"Crypo Investments\"",
  "created_utc": 1637242313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday evening I made a bank transfer to my crypto_dot_com fiat wallet.  This is something that I`ve done many times in the last few months with very little problem and I even have them as a saved payee. Occasionally I`ve had to complete anti fraud checks; such as responding to my banking app or a SMS notification to confirm that it was me making the transfer.   However, last night my balance didn&#39;t update, so I assumed that I`d not hit confirm and so made a smaller test payment.  This time I received an error message &quot;RPS01&quot; that said their have been issues with the payment system and to check again in 4hrs.  </p>\n\n<p>I made a payment to another card account to see if it was their system or specifically CDC and those went through fine.  I opened up a chat with them and was told a similar message, that they couldn&#39;t confirm the status of the transfer but they&#39;re normally resolved in 4hrs.  I was also able to use the CDC visa card top-up from the same source.</p>\n\n<p>This morning I went to login to my mobile app to check the status and found that I was locked out.  The same with my online banking.  I had an error code (RG21M) that suggested that my account did not exist and a message to phone them.</p>\n\n<p>The number took me through to their anti fraud, so I thought that perhaps they&#39;d been a bit heavy handed but it would be a simple case of confirming that I`d made the payment.  Instead, after confirming my ID and explaining the circumstances surrounding the payment, I was told that they&#39;d escalate my case to another department.  There where I was told &quot;your account was locked due to the nature of your activity being related to cryptocurrency purchases or investments&quot; and that they would now read me a statement.   To reinstate my account, I would have to answer a series of questions that could take up to 30 minutes and that my responses would be digitally recorded.</p>\n\n<p>I had no choice but to agree, and thankfully it took much less time than that due to me pre-empting some of their questions.   I was told that if I continued with the payment then I was not protected by them.   At the end of the call, I asked whether my account would now be free to send further payments to this account and was told that it was likely that future payments may get flagged.</p>\n\n<p>To give you an idea of some of the questions that I was asked...</p>\n\n<p>- What research have I done into Cryptocurrencies? Am I aware of the risks around them? How long have I been purchasing Cryptocurrencies?</p>\n\n<p>- Why did I pick this particular exchange? Why did I trust them and what due diligence had I done?</p>\n\n<p>- Who had advised me to invest? Was I investing on behalf of anyone else? What was the source of my funds for the investment etc etc</p>\n</div><!-- SC_ON -->",
  "score": 206,
  "permalink": "/r/CryptoCurrency/comments/qwneze/my_bank_barclays_uk_blocked_my_transfers_froze_my/",
  "subreddit": "CryptoCurrency",
  "id": "qwneze",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday evening I made a bank transfer to my crypto_dot_com fiat wallet. This\nis something that I`ve done many times in the last few months with very little\nproblem and I even have them as a saved payee. Occasionally I`ve had to complete\nanti fraud checks; such as responding to my banking app or a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日の夕方、crypto_dot_comのフィアットウォレットに銀行振込をしました。これは\nこれは過去数ヶ月の間に何度も行ってきたことで、ほとんど問題はありません。\n振込先として保存していることもあります。時折、詐欺防止のチェックをしなければなりませんでした。\n詐欺防止のチェックをしなければならないこともあります。",
      "title": "私の銀行（Barclays UK）は、私の \"Crypo Investments \"を理由に、送金をブロックし、モバイルバンキングアプリをフリーズさせ、口座をロックしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天晚上，我向我的crypto_dot_com法币钱包进行了一次银行转账。这\n在过去的几个月里，我已经做了很多次，几乎没有问题。\n我甚至把他们作为一个保存的收款人。偶尔我不得不完成\n反欺诈检查；如回应我的银行应用程序或一个...",
      "title": "我的银行（英国巴克莱银行）封锁了我的转账，冻结了我的手机银行应用程序，并由于我的 \"加密投资 \"而锁定了我的账户。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天晚上，我向我的crypto_dot_com法幣錢包進行了一次銀行轉賬。這\n在過去的幾個月裏，我已經做了很多次，幾乎沒有問題。\n我甚至把他們作爲一個保存的收款人。偶爾我不得不完成\n反欺詐檢查；如迴應我的銀行應用程序或一個...",
      "title": "我的銀行（英國巴克萊銀行）封鎖了我的轉賬，凍結了我的手機銀行應用程序，並由於我的 \"加密投資 \"而鎖定了我的賬戶。"
    }
  ]
}