{
  "author": "Hopeful_Bus_2815",
  "original_created_utc": 1638746253,
  "title": "There’s a reason people say “Don’t invest more than you can afford to lose”",
  "created_utc": 1638795190,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From someone who had a tough rough in with a gambling addiction in my past, it genuinely scares me when I see people throwing everything they own and the kitchen sink into crypto.&lt;/p&gt;\n\n&lt;p&gt;Not investing more than you can afford to lose, allows you to remove any emotional attachment you have with crypto. You should realistically be able to look at your entire portfolio, and say that if it went all went tits up and dropped 99% overnight, you’d still be fine in the morning. &lt;/p&gt;\n\n&lt;p&gt;If you can come into this highly volatile market with an actual plan/strategy, you will be much better off 5-10 years down the line. There are many safe investment strategies, with DCA being the most popular amongst them. &lt;/p&gt;\n\n&lt;p&gt;If you’re not afraid of losing your crypto, you won’t be afraid of HODLing it. You won’t panic sell at a loss, you won’t convert to coins that are currently pumping. All in all, you’ll be in a better place if you’re not over-exposed.&lt;/p&gt;\n\n&lt;p&gt;Trust me, once you go balls deep into the rabbit hole, you’ll find yourself trying to catch the next Doge, the next SHIB, etc. &amp;amp; trust me, you won’t.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/r9sby9/theres_a_reason_people_say_dont_invest_more_than/",
  "subreddit": "CryptoCurrency",
  "id": "r9sby9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From someone who had a tough rough in with a gambling addiction in my past, it\ngenuinely scares me when I see people throwing everything they own and the\nkitchen sink into crypto.\n\nNot investing more than you can afford to lose, allows you to remove any\nemotional attachment you have with crypto.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "過去にギャンブル依存症で辛い思いをした人間からすると\n自分の持っているもの全てを投げ打っている人を見ると、本当に怖くなります。\ncryptoにキッチンシンクを。\n\nあなたが失うことができるよりも多くを投資しない、あなたが削除することができます任意の\n暗号に抱く感情......。",
      "title": "失う可能性がある以上の投資はするな」と言われるのには理由がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从一个过去曾因赌博成瘾而经历过艰难困苦的人来说，当我看到人们把所有的钱都投入到赌博中去时，我真的很害怕。\n当我看到人们把他们拥有的一切和厨房里的水槽都投向加密货币时，我真的很害怕。\n的时候，我真的很害怕，因为我看到人们把他们所有的东西和厨房水槽都扔到了加密货币上。\n\n不投资超过你能承受的损失，使你能够消除对加密货币的任何\n你对加密货币的情感依恋....",
      "title": "人们说 \"不要投资超过你能承受的损失 \"是有原因的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從一個過去曾因賭博成癮而經歷過艱難困苦的人來說，當我看到人們把所有的錢都投入到賭博中去時，我真的很害怕。\n當我看到人們把他們擁有的一切和廚房裏的水槽都投向加密貨幣時，我真的很害怕。\n的時候，我真的很害怕，因爲我看到人們把他們所有的東西和廚房水槽都扔到了加密貨幣上。\n\n不投資超過你能承受的損失，使你能夠消除對加密貨幣的任何\n你對加密貨幣的情感依戀....",
      "title": "人們說 \"不要投資超過你能承受的損失 \"是有原因的。"
    }
  ]
}