{
  "author": "third_legatron",
  "the_new_excerpt": "From what I see going into earnings season is we have a massive move upwards in\nApril so far, I also feel like earnings will most likely all be good. But my\nworry right now is good news being too priced in and it being a classic example\nof sell the news. I'm very bullish for this year but I think we…",
  "original_created_utc": 1618723872,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "決算シーズンに向けて、私が見ているところでは、4月に大規模な上向きの動きがありました。\nこれまでのところ、4月は大きく上昇していますし、決算もすべて良いものになる可能性が高いと感じています。しかし、私の\n今の心配は、良いニュースがあまりにも織り込まれすぎていて、ニュースを売るという典型的な例になっていることです。\nニュースを売るという典型的な例です。私は今年、非常に強気ですが、私が思うに...",
      "title": "マージンを削る時期"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从我看到的进入财报季的情况来看，我们有一个大规模的上调，在\n4月至今，我也觉得收益很可能都会不错。但我的\n现在担心的是好消息太贵，它是一个典型的例子。\n的卖出消息。我非常看好今年的行情，但我认为我们...",
      "title": "是时候减少保证金了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從我看到的進入財報季的情況來看，我們有一個大規模的上調，在\n4月至今，我也覺得收益很可能都會不錯。但我的\n現在擔心的是好消息太貴，它是一個典型的例子。\n的賣出消息。我非常看好今年的行情，但我認爲我們...",
      "title": "是時候減少保證金了"
    }
  ],
  "title": "Time to trim down margin",
  "created_utc": 1618790061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From what I see going into earnings season is we have a massive move upwards in April so far, I also feel like earnings will most likely all be good. But my worry right now is good news being too priced in and it being a classic example of sell the news. I&#39;m very bullish for this year but I think we will continue to see healthy pullbacks after each run. </p>\n\n<p>I suggest if you&#39;re like me, and use margin to a decent extent, now would be the time to take SOME of the profits and wait for a little downturn to buy more. I do not suggest at all pulling out completely because that would be stupid, this market is going up overall, but I fear margin users may have gotten too comfortable and a resurgence in volatility may happen going into may-june. </p>\n\n<p>It would be nice to see a little pullback just to pick up some good bargains, because honestly, stocks are expensive right now. So my two cents, free up some of that money to buy some dips and get right back in. If you&#39;re using leverage, take the profits it has beseeched you and wait for an opportune time to put it to work again. I think margin is a great tool in these market cycles when used wisely, and cautiously. </p>\n\n<p>I use margin so that I don&#39;t have to be too greedy with my own money, I instead can be safe with my brokers, and still get a nice slice of pie. But the risk of leveraging losses during a volatile market is something I don&#39;t want to risk.</p>\n\n<p>I also am not trying to spread any fear at all, this is a bull market, but I also advise to keep a close eye on your account if you use margin and make sure that you have quality names right now. Can never get too comfortable, and when it&#39;s calm like this it is the time to be prepared, especially when you have the capitol to properly protect yourself for relatively cheap.</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/stocks/comments/mt6we4/time_to_trim_down_margin/",
  "subreddit": "stocks",
  "id": "mt6we4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526209
}