{
  "author": "EmperorSomeone",
  "original_created_utc": 1645551012,
  "title": "What happened to the Soviet POWs who were forcibly repatriated to the USSR by the Western Allies?",
  "created_utc": 1645561645,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;By the end of WW2, the Americans held several Soviet POWs captured by the Germans and made to work in the Wehrmacht, mostly in background jobs like cooks and drivers. According to wiki:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Unlike the German prisoners, who were looking forward to release at war&amp;#39;s end, the Soviet prisoners urgently requested asylum in the United States or at least repatriation to a country not under Soviet occupation, as they knew they would be shot by Stalin as traitors for being captured (under Soviet law, surrender incurred the death penalty).  &lt;/p&gt;\n\n&lt;p&gt;The question of the Soviet POWs&amp;#39; conduct was difficult to determine but not their fate if repatriated. Most Soviet POWs stated that they had been given a choice by the Germans: volunteer for labor duty with the German army or be turned over to the Gestapo for execution or service in an &lt;em&gt;Arbeitslager&lt;/em&gt; (a camp used to work prisoners until they died of starvation or illness). In any case, in Stalin&amp;#39;s eyes, they were dead men, as they had been captured alive, &amp;quot;contaminated&amp;quot; by contact with those in bourgeois Western nations, and found in service with the German Army.  &lt;/p&gt;\n\n&lt;p&gt;Notified of their impending transfer to Soviet authorities, a riot at their POW camp erupted. No one was killed by the guards, but some POWS were wounded, and others hanged themselves. Truman granted the men a temporary reprieve, but the Acting Secretary of State signed an order on July 11, 1945, forcing the repatriation of the Soviet POWs to the Soviet Union. On August 31, 1945, the 153 survivors were officially returned to the Soviet Union&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It says that we do not know what happened to them, but since then have we found anything that gives us an idea of what may have happened? Are there any official Soviet documents remaining, recording what happened to them?&lt;/p&gt;\n\n&lt;p&gt;Edit: (Sorry, I didn&amp;#39;t see the weekly theme flair, but I guess it kind of fits?)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/syt5k3/what_happened_to_the_soviet_pows_who_were/",
  "subreddit": "AskHistorians",
  "id": "syt5k3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "By the end of WW2, the Americans held several Soviet POWs captured by the\nGermans and made to work in the Wehrmacht, mostly in background jobs like cooks\nand drivers. According to wiki:\n\n> Unlike the German prisoners, who were looking forward to release at war's end,\n> the Soviet prisoners urgently…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第二次世界大戦の終わりには、アメリカはソ連の捕虜を何人も捕まえていた。\nドイツ国防軍で働かされ、そのほとんどがコックなどの裏方の仕事でした。\nと運転手。wikiによると\n\n> 終戦時の解放を待ち望んでいたドイツ人捕虜とは異なり、捕虜の多くは戦争が終わると解放される。\n> ソ連人捕虜の切実な願いは...。",
      "title": "西側連合国によって強制的にソ連に送還されたソ連兵捕虜はどうなったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "到二战结束时，美国人扣留了几个被德国人俘虏的苏联战俘，并让他们在国防军中工作。\n被德国人俘虏的苏联战俘，并被强迫在德国国防军中工作，主要是从事背景工作，如厨师和司机。\n和司机。根据维基的说法。\n\n> 与德国战俘不同，他们期待着在战争结束时获得释放。\n> 苏联战俘迫切希望...",
      "title": "被西方盟国强行遣送回苏联的苏联战俘的情况如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "到二戰結束時，美國人扣留了幾個被德國人俘虜的蘇聯戰俘，並讓他們在國防軍中工作。\n被德國人俘虜的蘇聯戰俘，並被強迫在德國國防軍中工作，主要是從事背景工作，如廚師和司機。\n和司機。根據維基的說法。\n\n> 與德國戰俘不同，他們期待着在戰爭結束時獲得釋放。\n> 蘇聯戰俘迫切希望...",
      "title": "被西方盟國強行遣送回蘇聯的蘇聯戰俘的情況如何？"
    }
  ]
}