{
  "author": "imcoldhugme",
  "original_created_utc": 1646208048,
  "title": "Are there men out there who don’t mind waiting for at least 3 months?",
  "created_utc": 1646224446,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (19f) have only been in one relationship but it was a strange one lol so it doesn’t count. &lt;/p&gt;\n\n&lt;p&gt;Im totally clueless on this subject and whether or not it’s actually normal, preferable, reasonable, a turn-off, or a deal-breaker if a girl asks her partner to wait for a few months because she wants to know if they’re serious and compatible. I know every guy is different but there has to be a consensus right?&lt;/p&gt;\n\n&lt;p&gt;I don’t think losing your virginity is anything special but I guess like other things in life, I’d like my first time to be lovely with someone I love and trust my life with. I also want to make sure the guy wants to be with me as a whole and not just use me for fun and disappear (that truly sounds scary to me because I don’t think I’ll recover from the embarrassment of falling for someone who was laughing at me in secret the whole time and pretending to share the same feelings) so a few weeks isn’t enough I feel. I think 2-3 months?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/TooAfraidToAsk/comments/t4v7em/are_there_men_out_there_who_dont_mind_waiting_for/",
  "subreddit": "TooAfraidToAsk",
  "id": "t4v7em",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (19f) have only been in one relationship but it was a strange one lol so it\ndoesn’t count.\n\nIm totally clueless on this subject and whether or not it’s actually normal,\npreferable, reasonable, a turn-off, or a deal-breaker if a girl asks her partner\nto wait for a few months because she wants to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(19f)は一度だけ付き合ったことがありますが、変な人でした(笑)なので\nはカウントされません。\n\nこのテーマについて、そしてそれが実際に普通なのかどうか、まったく無知なのです。\nもし、女の子がパートナーに次のようなことを頼んだら、それは望ましいことであり、合理的であり、嫌なことであり、破滅的なことです。\nという理由で、数ヶ月待ってもらう。",
      "title": "最低でも3ヶ月は待っても構わないという男性はいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（19岁）只谈过一次恋爱，但那是一段奇怪的关系，所以\n所以不算数。\n\n我对这个问题完全没有头绪，也不知道这是否真的正常。\n如果一个女孩要求她的伴侣等上几个月，这究竟是正常的，还是合理的，还是令人厌恶的，或者说是一种破坏性的行为？\n因为她想等几个月......。",
      "title": "是否有男人不介意至少等待3个月？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（19歲）只談過一次戀愛，但那是一段奇怪的關係，所以\n所以不算數。\n\n我對這個問題完全沒有頭緒，也不知道這是否真的正常。\n如果一個女孩要求她的伴侶等上幾個月，這究竟是正常的，還是合理的，還是令人厭惡的，或者說是一種破壞性的行爲？\n因爲她想等幾個月......。",
      "title": "是否有男人不介意至少等待3個月？"
    }
  ]
}