{
  "author": "Michael_Therami",
  "the_new_excerpt": "RITE AID (RAD), WALGREENS ( WBA ), AND CVS ALL DOWN TODAY MAY 26, 2021 ON REPORT\nAMAZON (AMZN) IS CONSIDERING ENTERING THE PHYSICAL RETAIL PHARMACY SPACE. WHAT\nTHE MARKET IS MISCALCULATING IS THAT WITH A MARKET CAP OF ONLY $1 BILLION, RAD\nIS NOW A PRIMARY TAKEOVER TARGET FOR AMZN OR WALMART ( WMT…",
  "original_created_utc": 1622069042,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "RITE AID (RAD)、WALGREENS ( WBA )、CVSは本日2021年5月26日のレポートで全て下げている。\namazon (amzn)が薬局の小売分野への参入を検討している。WHAT\n市場の誤算は、たった10億ドルの時価総額しかないRADが\nは今やamznやwalmart ( wmt...)の主要な買収対象となっています。",
      "title": "アマゾン(AMZN)が物理的な小売薬局分野への参入を検討しているとの報道を受け、本日2021年5月26日、ライトエイド、ウォルグリーン、CVSが下落。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据报道，Rite Aid（RAD）、Walgreens（WBA）和Cvs今天全部下跌，2021年5月26日\n亚马逊（AMZN）正在考虑进入实体零售药店领域。什么是\n市场误判的是，由于市值只有10亿美元，RAD\n现在是亚马逊或沃尔玛（Wmt.）的主要收购目标。",
      "title": "据报道，亚马逊(AMZN)正在考虑进入实体零售药店领域，Rite Aid、Walgreens和CVS今天在2021年5月26日下跌。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據報道，Rite Aid（RAD）、Walgreens（WBA）和Cvs今天全部下跌，2021年5月26日\n亞馬遜（AMZN）正在考慮進入實體零售藥店領域。什麼是\n市場誤判的是，由於市值只有10億美元，RAD\n現在是亞馬遜或沃爾瑪（Wmt.）的主要收購目標。",
      "title": "據報道，亞馬遜(AMZN)正在考慮進入實體零售藥店領域，Rite Aid、Walgreens和CVS今天在2021年5月26日下跌。"
    }
  ],
  "title": "Rite Aid, Walgreens, and CVS down today May 26, 2021 on report Amazon (AMZN) is considering entering physical retail pharmacy space.",
  "created_utc": 1622096187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Rite Aid (RAD), Walgreens ( WBA ), and CVS all down today May 26, 2021 on report Amazon (AMZN) is considering entering the physical retail pharmacy space. What the market is miscalculating is that with a market cap of only $1 billion, RAD is now a primary takeover target for AMZN or Walmart ( WMT ).</h1>\n\n<p>Business Insider is reporting today that Amazon is looking to make a move into the physical retail pharmacy space. What are the implications for the overall pharmacy sector?</p>\n\n<ul>\n<li>Does Amazon make a play for Rite Aid to gain 2,500+ stores throughout the USA immediately, or does it take the slow path that ultimately leads to failure and dropping out of the space?</li>\n<li>Does Walmart buy Rite Aid to become the nations 3rd leading pharmacy behind CVS and Walgreens to build the scale / size requires to be a long-term player in the segment?</li>\n<li>What do CVS and Walgreens do to ensure they are able to maintain their share and dominance in the sector?</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/stocks/comments/nltj9w/rite_aid_walgreens_and_cvs_down_today_may_26_2021/",
  "subreddit": "stocks",
  "id": "nltj9w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389742
}