{
  "approved_at_utc": null,
  "subreddit": "investing",
  "selftext": "In 1996, I wrote my senior thesis on internet distribution of music.  Seven years later, Apple launched iTunes Music Store, marking the beginning of a new strategy: the digital lifestyle hub.\n\nThe Metaverse is and has been an interesting concept but it's going to fail (again) before it succeeds and here's why:\n\nWhen Apple began their journey to a trillion dollar valuation it didn't start with iPhone, iPad or iMac.... it didn't even technically start with iPod.  It really started in 2000, when Apple made two key acquisitions:\n\n1. Casady &amp; Greene's SoundJam Music Player - this became the foundation for the iTunes platform.  Limewire, Kazaa, etc. were un-navigable, barely-searchable, completely nonintuitive messes.\n2. One-Click Purchasing - Apple licensed this patent from the then fledgling e-commerce site, Amazon.\n\nThese two actions, combined with CFO Bob Anderson's restructuring of the company's finances, laid a roadmap that led them out of the jaws of bankruptcy and into a valuation that, today, is nearly double Amazon's.\n\nSo what's this have to do with VR?   Well, everyone has taken a swipe at virtual worlds... But I like to point to the excitement around the platform SecondLife.  It started as exactly what Zuckerberg wants the Metaverse to be... and ended up a ghost-world of BDSM dens where you go to get virtually banged by humanoid donkeys.\n\nFacebook's core competency is in taking simple ideas, overburdening them with complexity to the point where everyone gets worn down by the experience and wants to leave ... and when I interviewed with Facebook some years back, they knew they had a problem and I could see they were planning to divest the messaging platform away from the main site which had become, like Limewire and Kazaa, an un-navigable mess.\n\nEnter Apple.  Apple had figured out how to charge for something where the competition was free, by prioritizing convenience.  Sure, it's not without its problems and it's gone through many iterations over the years, but it underscores that Apple's core competency is the exact opposite of Facebook's.\n\nAfter Facebook and other tech companies have been lured back to the land of broken dreams purely out of FOMO, after tech and telecom have spent billions upon billions to put the basic infrastructure in place in anticipation of the demand Metaverse will create, after users have warmed to the concept, and just like 2000, when the rest of the tech world was collapsing because they'd been rushing to be first without any thought as to who will supply the content to drive the demand...\n\nIt is entirely foreseeable that Apple might, at that very specific convergence of events, release a hardware product that they've already been working on secretly (think Marklar) that does something like this: You look at a guy and see the coat he's wearing, your \"AppleVision AR\" tells you where he got that coat, how much it costs, and opens a sales portal that, like ApplePay, transmits your sizing information, payment information, billing and shipping address, and gives you the option to either have it delivered to your house, or pick it up curbside at a brick and mortar location where, if for any reason you don't like it, you can cancel the sale or swap for a different color, size, etc... all at the click of a finger, scan of your face, or the sound of your voice.\n\nThe Metaverse isn't a virtual escape from your real existence, where CEOs lacking in imagination can try to further commoditize your behavioral data... even that description of the concept is clunky.  No, the Metaverse is simply the digital hub moved into the cloud, virtually simplifying your real existence.",
  "author_fullname": "t2_8784sy",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "The Metaverse is the Next Big Thing™... But Not In The Way You Think",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/investing",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_sgj47b",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.67,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 41,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 41,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1643579621,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1643577175,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.investing",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In 1996, I wrote my senior thesis on internet distribution of music.  Seven years later, Apple launched iTunes Music Store, marking the beginning of a new strategy: the digital lifestyle hub.&lt;/p&gt;\n\n&lt;p&gt;The Metaverse is and has been an interesting concept but it&amp;#39;s going to fail (again) before it succeeds and here&amp;#39;s why:&lt;/p&gt;\n\n&lt;p&gt;When Apple began their journey to a trillion dollar valuation it didn&amp;#39;t start with iPhone, iPad or iMac.... it didn&amp;#39;t even technically start with iPod.  It really started in 2000, when Apple made two key acquisitions:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Casady &amp;amp; Greene&amp;#39;s SoundJam Music Player - this became the foundation for the iTunes platform.  Limewire, Kazaa, etc. were un-navigable, barely-searchable, completely nonintuitive messes.&lt;/li&gt;\n&lt;li&gt;One-Click Purchasing - Apple licensed this patent from the then fledgling e-commerce site, Amazon.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;These two actions, combined with CFO Bob Anderson&amp;#39;s restructuring of the company&amp;#39;s finances, laid a roadmap that led them out of the jaws of bankruptcy and into a valuation that, today, is nearly double Amazon&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;So what&amp;#39;s this have to do with VR?   Well, everyone has taken a swipe at virtual worlds... But I like to point to the excitement around the platform SecondLife.  It started as exactly what Zuckerberg wants the Metaverse to be... and ended up a ghost-world of BDSM dens where you go to get virtually banged by humanoid donkeys.&lt;/p&gt;\n\n&lt;p&gt;Facebook&amp;#39;s core competency is in taking simple ideas, overburdening them with complexity to the point where everyone gets worn down by the experience and wants to leave ... and when I interviewed with Facebook some years back, they knew they had a problem and I could see they were planning to divest the messaging platform away from the main site which had become, like Limewire and Kazaa, an un-navigable mess.&lt;/p&gt;\n\n&lt;p&gt;Enter Apple.  Apple had figured out how to charge for something where the competition was free, by prioritizing convenience.  Sure, it&amp;#39;s not without its problems and it&amp;#39;s gone through many iterations over the years, but it underscores that Apple&amp;#39;s core competency is the exact opposite of Facebook&amp;#39;s.&lt;/p&gt;\n\n&lt;p&gt;After Facebook and other tech companies have been lured back to the land of broken dreams purely out of FOMO, after tech and telecom have spent billions upon billions to put the basic infrastructure in place in anticipation of the demand Metaverse will create, after users have warmed to the concept, and just like 2000, when the rest of the tech world was collapsing because they&amp;#39;d been rushing to be first without any thought as to who will supply the content to drive the demand...&lt;/p&gt;\n\n&lt;p&gt;It is entirely foreseeable that Apple might, at that very specific convergence of events, release a hardware product that they&amp;#39;ve already been working on secretly (think Marklar) that does something like this: You look at a guy and see the coat he&amp;#39;s wearing, your &amp;quot;AppleVision AR&amp;quot; tells you where he got that coat, how much it costs, and opens a sales portal that, like ApplePay, transmits your sizing information, payment information, billing and shipping address, and gives you the option to either have it delivered to your house, or pick it up curbside at a brick and mortar location where, if for any reason you don&amp;#39;t like it, you can cancel the sale or swap for a different color, size, etc... all at the click of a finger, scan of your face, or the sound of your voice.&lt;/p&gt;\n\n&lt;p&gt;The Metaverse isn&amp;#39;t a virtual escape from your real existence, where CEOs lacking in imagination can try to further commoditize your behavioral data... even that description of the concept is clunky.  No, the Metaverse is simply the digital hub moved into the cloud, virtually simplifying your real existence.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qhhq",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "sgj47b",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "th3cr1t1c",
  "discussion_type": null,
  "num_comments": 45,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/investing/comments/sgj47b/the_metaverse_is_the_next_big_thing_but_not_in/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/investing/comments/sgj47b/the_metaverse_is_the_next_big_thing_but_not_in/",
  "subreddit_subscribers": 1992806,
  "created_utc": 1643589366,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1643577175,
  "the_new_excerpt": "In 1996, I wrote my senior thesis on internet distribution of music. Seven years\nlater, Apple launched iTunes Music Store, marking the beginning of a new\nstrategy: the digital lifestyle hub.\n\nThe Metaverse is and has been an interesting concept but it's going to fail\n(again) before it succeeds and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1996年、私は卒業論文で音楽のインターネット配信について書きました。その7年後\nアップルはiTunes Music Storeを立ち上げ、新しい時代の幕開けとなりました。\nデジタルライフスタイルの拠点という戦略\n\nメタバースは面白いコンセプトですが、失敗しそうです。\n(成功する前に（また）失敗してしまうし...。",
      "title": "メタバースは次の大きな流れだ... しかし、あなたが考えているような方法ではありません"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1996年，我写了一篇关于互联网传播音乐的毕业论文。七年后\n七年后，苹果公司推出了iTunes音乐商店，标志着一个新的战略的开始。\n战略的开始：数字生活方式中心。\n\nMetaverse现在和过去都是一个有趣的概念，但它将在成功之前失败\n(在成功之前，它将再次失败，而且...",
      "title": "Metaverse是下一个大事件™... 但不是你想的那样"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1996年，我寫了一篇關於互聯網傳播音樂的畢業論文。七年後\n七年後，蘋果公司推出了iTunes音樂商店，標誌着一個新的戰略的開始。\n戰略的開始：數字生活方式中心。\n\nMetaverse現在和過去都是一個有趣的概念，但它將在成功之前失敗\n(在成功之前，它將再次失敗，而且...",
      "title": "Metaverse是下一個大事件™... 但不是你想的那樣"
    }
  ]
}