{
  "author": "Real_Carl_Ramirez",
  "the_new_excerpt": "Here is the book in question\n[https://books.google.com.au/books/about/Australia.html?id=-CRXAAAAMAAJ&redir_esc=y].\n\nWhen I was in high school (I graduated in 2013), my teachers, who grew up in the\n50s, 60s and 70s, told me that back when they were in high school, they were\ntaught that Australia was…",
  "original_created_utc": 1611555293,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这是有关的书\n[https://books.google.com.au/books/about/Australia.html?id=-CRXAAAAMAAJ&redir_esc=y]。\n\n我上高中的时候（2013年毕业），我的老师，从小在。\n50、60、70岁的人，告诉我，他们在高中的时候，他们是。\n教澳大利亚是...",
      "title": "1931年，威廉-基思-汉考克写了一本名为《澳大利亚》的历史教科书。其中有一章叫 \"入侵澳大利亚\"。为什么在随后的几十年里，\"入侵澳大利亚 \"的提法成了禁忌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是有關的書\n[https://books.google.com.au/books/about/Australia.html?id=-CRXAAAAMAAJ&redir_esc=y]。\n\n我上高中的時候（2013年畢業），我的老師，從小在。\n50、60、70歲的人，告訴我，他們在高中的時候，他們是。\n教澳大利亞是...",
      "title": "1931年，威廉-基思-漢考克寫了一本名爲《澳大利亞》的歷史教科書。其中有一章叫 \"入侵澳大利亞\"。爲什麼在隨後的幾十年裏，\"入侵澳大利亞 \"的提法成了禁忌？"
    }
  ],
  "title": "In 1931, William Keith Hancock wrote a history textbook called \"Australia\". One of its chapters is called \"The Invasion of Australia\". How come the mention of the \"Invasion of Australia\" became taboo in the following decades?",
  "created_utc": 1611569394,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://books.google.com.au/books/about/Australia.html?id=-CRXAAAAMAAJ&amp;redir_esc=y\">Here is the book in question</a>.</p>\n\n<p>When I was in high school (I graduated in 2013), my teachers, who grew up in the 50s, 60s and 70s, told me that back when they were in high school, they were taught that Australia was &quot;settled&quot; because it was &quot;Terra Nullius&quot;. They told me that if you mention the &quot;Invasion of Australia&quot; to any non-Indigenous person back then, it would be considered offensive and taboo. </p>\n\n<p>Nowadays, the discussion on the Invasion of Australia has returned to public discourse and is now taught in the school curriculum. However, it still remains politically contentious.</p>\n\n<p>In 1931, William Keith Hancock was able to write about the &quot;Invasion of Australia&quot;. What happened after 1931 that has made it become taboo to talk about the &quot;Invasion of Australia&quot;, and for his writings on the topic to be completely ignored by the school curriculum? From what I&#39;ve been told, it would seem like no historian in the 50s, 60s or 70s would even dare to write about the &quot;Invasion of Australia&quot;.</p>\n\n<p>Finally, do we know if Hancock&#39;s writings about the &quot;Invasion of Australia&quot; back in 1931 caused significant public controversy and backlash? If not, why not?</p>\n</div><!-- SC_ON -->",
  "score": 2597,
  "permalink": "/r/AskHistorians/comments/l4hmav/in_1931_william_keith_hancock_wrote_a_history/",
  "subreddit": "AskHistorians",
  "id": "l4hmav",
  "is_self": true,
  "media": null,
  "is_video": false
}