{
  "author": "tom2kk",
  "original_created_utc": 1632167148,
  "title": "How did you come up with your side project idea?",
  "created_utc": 1632177337,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lately iv been getting the itch to start a new side project, and fancy making something that i can make some beer money with. </p>\n\n<p>I&#39;m a fairly competent developer and i like to think that i could put together at least an mvp for the majority of ideas that i come up with. The problem is that ideas completely elude me. The standard response to these type of posts is to solve a problem, but i cant even think of one of these.</p>\n\n<p>How did you come up with your project idea, or what is your process of brainstorming ideas?</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/ps28jf/how_did_you_come_up_with_your_side_project_idea/",
  "subreddit": "SideProject",
  "id": "ps28jf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Lately iv been getting the itch to start a new side project, and fancy making\nsomething that i can make some beer money with.\n\nI'm a fairly competent developer and i like to think that i could put together\nat least an mvp for the majority of ideas that i come up with. The problem is\nthat ideas…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、新しいサイドプロジェクトを始めたいと思っていて、ビール代を稼げるような\nビール代を稼げるようなものを作ってみたいと思っています。\n\n私はかなり有能な開発者であり、私が思いついたアイデアの大部分は少なくともMVPをまとめることができると考えています。\n少なくともMVPはとれると思います。問題は\nそのアイデアが...",
      "title": "サイドプロジェクトのアイデアはどのようにして生まれたのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我一直想开始一个新的副业，并且想做一些可以赚取啤酒钱的东西。\n我可以用它来赚取一些啤酒钱。\n\n我是一个相当有能力的开发者，我想我可以把它放在一起\n至少可以为我想出的大多数想法提供一个mvp。问题是\n这些想法...",
      "title": "你是如何想到你的副业想法的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我一直想開始一個新的副業，並且想做一些可以賺取啤酒錢的東西。\n我可以用它來賺取一些啤酒錢。\n\n我是一個相當有能力的開發者，我想我可以把它放在一起\n至少可以爲我想出的大多數想法提供一個mvp。問題是\n這些想法...",
      "title": "你是如何想到你的副業想法的？"
    }
  ]
}