{
  "author": "amrgunner1",
  "the_new_excerpt": "In 2016 Mckinsey issued a report called Monetizing Car Data. The report\nestimates the potential revenues when the cars are connected online. They said\nthat the overall revenue pool from car data monetization at a global scale might\nadd up to USD 450 - 750 billion by 2030.\n\nHere is a breakdown of the…",
  "original_created_utc": 1611526662,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "2016年，麦肯锡发布了一份名为《汽车数据货币化》的报告。该报告\n估计汽车联网后的潜在收入。他们说\n在全球范围内，汽车数据货币化的整体收入池可能会有以下几个方面\n到2030年将增加到4500-7500亿美元。\n\n以下是一个细分的...",
      "title": "了解黑莓。第二部分(无需足球知识)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2016年，麥肯錫發佈了一份名爲《汽車數據貨幣化》的報告。該報告\n估計汽車聯網後的潛在收入。他們說\n在全球範圍內，汽車數據貨幣化的整體收入池可能會有以下幾個方面\n到2030年將增加到4500-7500億美元。\n\n以下是一個細分的...",
      "title": "瞭解黑莓。第二部分(無需足球知識)"
    }
  ],
  "title": "Understanding Blackberry: Part 2 (No knowledge of soccer required)",
  "created_utc": 1611569404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 2016 Mckinsey issued a report called Monetizing Car Data. The report estimates the potential revenues when the cars are connected online. They said that the overall revenue pool from car data monetization at a global scale might add up to USD 450 - 750 billion by 2030.</p>\n\n<p>Here is a breakdown of the possible revenue streams as per the report: </p>\n\n<p>In-Car Sources of income (QNX Income):</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>OEMs selling the service to customers and advertisers paying for the data are among the business models that might contribute to the value of the data-enabled social driving experience, which is expected to have an estimated value of USD 7 - 8 billion by 2030.</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>High-tech giants are positioned to provide the fundamental car data analytics services that car OEMs and advertisers are willing to buy. In addition to being the IT backbone, they can offer front-end applications.</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Start-ups are the smaller counterparts of the high-tech      giants, entering the car data monetization space from a variety of angles,      such as developing new apps, engineering innovative hardware/interfaces      (e.g., retro-fittable gesture-activated controls)</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Retailers and service centers are using car data      analytics to optimize their sales network and get the messages about their      offerings directly to drivers</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Automotive OEMs. In addition to selling connectivity-related options and services (e.g., infotainment,      navigation), OEMs are already becoming active in-car data analytics to better understand how customers use their cars, shape their repair and maintenance choices, and improve the link between dealers and customers      (e.g., allowing for real-time, remote booking of vehicle check-ups).</li>\n<li>Insurers are able to capitalize on car data by offering      usage-based insurance contracts, exploring occasion-related policies</li>\n</ol>\n\n<p>Big data and Cloud Sources of Income (IVY Income):</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Service providers offer data management services </li>\n<li>Regulators/government institutions are setting the standards regarding the collection and sharing of car data.</li>\n<li>Automotive suppliers are developing the software and      hardware that are forming the infrastructure capable of capturing,      analyzing, and selling car data</li>\n<li>Roadside assistance providers can collect and process      distress calls in real-time from vehicle sensors and automated alerts</li>\n<li>Infrastructure operators, including      billing/toll road operators and recharging/refueling players, are      analyzing car data to optimize the geographic deployment of their      respective services</li>\n</ol>\n\n<p>Customer willingness to pay for features – as opposed to a preference for free, ad-supported features – varies across use cases and geographies. To make it easier for us to have an early estimate of QNX potential revenues, we need to know their market share geographically too.</p>\n\n<p>Germany (As per 2020 Sales):</p>\n\n<p>QNX Clients: VW + Mercedes + BMW + Audi + Ford + Toyota + Kia= more than 62% of the Auto Market </p>\n\n<p>China (As per 2019 Car sales):</p>\n\n<p>QNX Clients: VW+ Honda + Hyundai + Mercedes + BMW +Kia= 42.7% </p>\n\n<p>USA: </p>\n\n<p>QNX Clients: More than 70% </p>\n\n<p>**New EV Clients of QNX are not included and not projected in any figures </p>\n\n<p>**GM and Porsche signed deals with Android Auto and Apple to be the operating systems of the car despite these cars running with QNX system. We can exclude them as QNX clients for now. </p>\n\n<p><strong>Back to customer willingness to pay per product/service:</strong></p>\n\n<p><strong>1.Predictive maintenance services:</strong></p>\n\n<p>Germany: 73% </p>\n\n<p>USA: 73%</p>\n\n<p>China: 78%</p>\n\n<p>QNX Market share: 45% of Germany Revenues +</p>\n\n<p>53% of US revenues+32% of China revenues </p>\n\n<p><strong>2. Time-related use cases, such as networked parking:</strong></p>\n\n<p>Germany: 71%</p>\n\n<p>USA: 72%</p>\n\n<p>China: 76%</p>\n\n<p>Paying customers for networked parking in a QNX powered car: 43% of Germany + 51% of USA + 31.9% of China </p>\n\n<p>The majority prefer a One-time price at time of vehicle purchase of USD 300</p>\n\n<p>&#x200B;</p>\n\n<p><strong>3. Predictive maintenance, and vehicle usage monitoring and scoring:</strong></p>\n\n<p>Germany: 72%</p>\n\n<p>USA:71%</p>\n\n<p>China: 78%</p>\n\n<p>Paying customers for predictive maintenance, monitoring, and scoring in a QNX powered car: 43% of Germany + 51% of USA + 32% of China</p>\n\n<p>Willingness to pay for connected navigation:</p>\n\n<p>Germany: 45%</p>\n\n<p>USA: 28%</p>\n\n<p>China:35%</p>\n\n<p>Paying customers for connected navigation in QNX power car: 28% of Germany + 20% of USA + 14.7% of China </p>\n\n<p>The majority prefer One-time payment to activate the service of USD 20</p>\n\n<p>&#x200B;</p>\n\n<p><strong>FOR IVY solutions and products:</strong></p>\n\n<p>Willingness to share data:</p>\n\n<p>Germany: 92%</p>\n\n<p>US: 93%</p>\n\n<p>China:98%</p>\n\n<p>As the report said, car data monetization at a global scale might add up to USD 450 by 2030. If we take a look at Goldman Sachs report about expected car sales by 2025 </p>\n\n<p>Emerging Markets: 78 Million cars</p>\n\n<p>Developed Countries: 34 Million cars</p>\n\n<p>If we assume that by 2025 every car powered by QNX would have the new QNX system ( They said the first one will launch in 2023) and if we apply the QNX market share above. </p>\n\n<p><strong>QNX would power:</strong></p>\n\n<p>32 Million cars in emerging markets  </p>\n\n<p>22 Million cars in developed markets</p>\n\n<p>If QNX offered a bundle of $15/month (and $10 in emerging markets) tailored package for parking assistance and maintenance and other services in developed countries. and If we apply the willingness to pay numbers from the Mckinsey report</p>\n\n<p><strong>QNX Potential Revenue from basic features package:</strong></p>\n\n<p>Developed Countries: 22M * 71% * 15 * 12 = $ 2.8Bn</p>\n\n<p>Emerging Countries: 32M * 78% * 10* 12= $ 2.9Bn </p>\n\n<p>If you add up an estimate for the rest of the products it might provide and potential contracts it can have for IVY with several governments, It would be easy for Balckberry to reach 8-10 Bn in Sales by 2025.</p>\n</div><!-- SC_ON -->",
  "score": 71,
  "permalink": "/r/stocks/comments/l493p2/understanding_blackberry_part_2_no_knowledge_of/",
  "subreddit": "stocks",
  "id": "l493p2",
  "is_self": true,
  "media": null,
  "is_video": false
}