{
  "author": "Baddington_Bear",
  "the_new_excerpt": "Let me explain a bit more. I don't mean that you're a ghost, or in the\nafterlife. Sometimes I get this uneasy feeling that that one time I was driving\nX years ago I never actually made it home. My car flipped over and I'm just\nhanging in it upside down, dying, and everything that's happened since…",
  "original_created_utc": 1617198222,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "让我再解释一下。我的意思不是说你是鬼，或者在...\n来世。有时候我有种不安的感觉，那一次我开车的时候\nX年前，我其实一直没有回家。我的车翻了，我只是...\n倒挂在里面，奄奄一息，以及之后发生的一切... ...",
      "title": "有没有人有时会怀疑自己真的死了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我再解釋一下。我的意思不是說你是鬼，或者在...\n來世。有時候我有種不安的感覺，那一次我開車的時候\nX年前，我其實一直沒有回家。我的車翻了，我只是...\n倒掛在裏面，奄奄一息，以及之後發生的一切... ...",
      "title": "有沒有人有時會懷疑自己真的死了？"
    }
  ],
  "title": "Does anyone else sometimes suspect they're actually dead?",
  "created_utc": 1617210386,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me explain a bit more. I don&#39;t mean that you&#39;re a ghost, or in the afterlife. Sometimes I get this uneasy feeling that that one time I was driving X years ago I never actually made it home. My car flipped over and I&#39;m just hanging in it upside down, dying, and everything that&#39;s happened since then is almost like a pre-death dream. Sometimes I get this vision of me in that car, unconscious, and hanging, and it&#39;s like, I feel like that&#39;s what&#39;s real and everything else has been a near-death fever dream. To be clear, I&#39;ve never been in an accident like that. It&#39;s almost like I was driving and while I thought I just drove home normally, something else actually happened and my brain just cut it out and proceeded with my normal life while I&#39;m actually still in that car about to die.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/TooAfraidToAsk/comments/mh6ech/does_anyone_else_sometimes_suspect_theyre/",
  "subreddit": "TooAfraidToAsk",
  "id": "mh6ech",
  "is_self": true,
  "media": null,
  "is_video": false
}