{
  "author": "digitalmoneyguru",
  "the_new_excerpt": "This cycle is its own beast, with shorter, less deep corrections. It is not a\nlengthening cycle nor a run with diminishing ROI. It's not as immature as 2013\nwhich was a pure retail explosion of a few months nor an altcoin driven rally\nwith no clear bearings of what's exactly is happening like…",
  "original_created_utc": 1610417885,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个周期是自己的畜生，时间较短，深度修正较少。它不是一个\n延长周期，也不是投资回报率递减的运行。它不像2013年那样不成熟\n这是一个纯散户几个月的爆发，也不是一个altcoin驱动的反弹。\n没有明确的方位到底发生了什么，就像... ...",
      "title": "这个周期是自己的野兽。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個週期是自己的畜生，時間較短，深度修正較少。它不是一個\n延長週期，也不是投資回報率遞減的運行。它不像2013年那樣不成熟\n這是一個純散戶幾個月的爆發，也不是一個altcoin驅動的反彈。\n沒有明確的方位到底發生了什麼，就像... ...",
      "title": "這個週期是自己的野獸。"
    }
  ],
  "title": "This cycle is its own beast.",
  "created_utc": 1610502909,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This cycle is its own beast, with shorter, less deep corrections. It is not a lengthening cycle nor a run with diminishing ROI. It&#39;s not as immature as 2013 which was a pure retail explosion of a few months nor an altcoin driven rally with no clear bearings of what&#39;s exactly is happening like 2017. </p>\n\n<p><a href=\"https://preview.redd.it/l6qv2pcl9ta61.png?width=1275&amp;format=png&amp;auto=webp&amp;s=1b80e62047eb85a9baf28e397ff5c044fb720e14\">Clockwork.</a></p>\n\n<p>We now have the best infrastructure and the most mature players the industry has ever seen. Add to that the macro backdrop of:</p>\n\n<p>1) Excessive money printing (&quot;It&#39;s not a store of value&quot; types are crowded out of the conversation)</p>\n\n<p>2) Craving of decentralised/non-state infrastructure within Western youth (&quot;It&#39;s not backed by a state&quot; types sound disturbingly naive)</p>\n\n<p>3) Digital payments becoming the norm beyond Asia (&quot;I can&#39;t touch it!&quot; types sound like cavemen)</p>\n\n<p>It will likely be remembered as the most risk-adjusted (low risk/high return) rally of Bitcoin in the cycles to come. 2025 will be great but at that point, it won&#39;t be as cool to be living through it. There&#39;s nothing visionary about buying AAPL or AMZN at this point.</p>\n\n<p>These couple years will also be the inflexion point of &quot;oh wow you have Bitcoin as well?&quot; to &quot;you still don&#39;t save in Bitcoin? lol.&quot; - similar to the &#39;gradually then suddenly&#39; shift of smartphone adoption between 2005 and 2010.</p>\n\n<p>Just <strong>HODL</strong> and enjoy the ride.</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/Bitcoin/comments/kvi24e/this_cycle_is_its_own_beast/",
  "subreddit": "Bitcoin",
  "id": "kvi24e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706373018
}