{
  "author": "hlpmepleas56",
  "original_created_utc": 1655814125,
  "title": "How do i lose feelings for someone?",
  "created_utc": 1655869152,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t want this anymore. I feel like i can&amp;#39;t move forward without him. It&amp;#39;s ruining my everything. My mental health is ransacked not only because of this but other personal problems. I want to be able to move forward without thinkig of someone anymore. How do i lose feelings for someone who doesn&amp;#39;t care about you?&lt;/p&gt;\n\n&lt;p&gt;Edit: Thank you kind people of reddit. I will take all your advice into heart and reflect on nyself. I messaged him for the last time today. As usual he didn&amp;#39;t respond this is the last straw i guess. Thank you everyone. I&amp;#39;ll come back better.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/vhc2fe/how_do_i_lose_feelings_for_someone/",
  "subreddit": "TooAfraidToAsk",
  "id": "vhc2fe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't want this anymore. I feel like i can't move forward without him. It's\nruining my everything. My mental health is ransacked not only because of this\nbut other personal problems. I want to be able to move forward without thinkig\nof someone anymore. How do i lose feelings for someone who…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もう、こんなの嫌だ。彼がいないと前に進めない気がする。それは\n私のすべてを台無しにしている。私の精神状態はこの件だけでなく\n精神的に参っている。もう誰かのことを考えることなく、前に進みたい。\n前に進みたい。どうすればいいのでしょうか？",
      "title": "どうしたら好きな人をなくすことができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不想再这样了。我觉得没有他我就无法向前迈进。这是在\n破坏了我的一切。我的心理健康被洗劫一空，不仅是因为这个\n还有其他个人问题。我希望能够向前迈进，不再想\n的人了。我怎样才能失去对某人的感情呢？",
      "title": "我怎样才能失去对某人的感情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不想再這樣了。我覺得沒有他我就無法向前邁進。這是在\n破壞了我的一切。我的心理健康被洗劫一空，不僅是因爲這個\n還有其他個人問題。我希望能夠向前邁進，不再想\n的人了。我怎樣才能失去對某人的感情呢？",
      "title": "我怎樣才能失去對某人的感情？"
    }
  ]
}