{
  "author": "BerthjeTTV",
  "original_created_utc": 1635360963,
  "title": "Am I the Only One Who Experiences The Success Of Shiba Inu With Pain",
  "created_utc": 1635367237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I keep seeing Shiba Inu rising 20% 40% 35% and it just won&#39;t stop.... It frustrates me that good projects can never experience this or it is a 1/1000 that it happens. Shiba Inu is a coin with 1 goal,´dead dogecoin´ that is NOT even useful. And yet people are selling their assets to buy shiba on the ATH. </p>\n\n<p><strong>I am surely not the only one who cannot stand this. Summary is clear: crypto so far is more about the hype of the coin than the goals of the project.... We experienced this with Dogecoin and now with Shiba Inu</strong>, Shiba Inu almost reaches the top 10 and for what? For being better than doge....</p>\n\n<p>What are you guys opinion on the succes of Shiba Inu?</p>\n</div><!-- SC_ON -->",
  "score": 297,
  "permalink": "/r/CryptoCurrency/comments/qh3shg/am_i_the_only_one_who_experiences_the_success_of/",
  "subreddit": "CryptoCurrency",
  "id": "qh3shg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I keep seeing Shiba Inu rising 20% 40% 35% and it just won't stop.... It\nfrustrates me that good projects can never experience this or it is a 1/1000\nthat it happens. Shiba Inu is a coin with 1 goal,´dead dogecoin´ that is NOT\neven useful. And yet people are selling their assets to buy shiba on the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "柴犬が20% 40% 35%と上昇しているのを見続けているが、止まらない.... それは\n良いプロジェクトがこのようなことを経験することができない、あるいは1/1000しか起こらないことに苛立ちを覚える\n1/1000の確率で発生します。柴犬は1つの目標を持ったコインで、「死んだ犬のコイン」と呼ばれています。\n使えるものでもありません。それなのに、人々は自分の資産を売って柴犬を買おうとしている。",
      "title": "柴犬の成功を痛感しているのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直看到Shiba Inu上涨20% 40% 35%，它就是不停止....。这让我很沮丧\n让我感到沮丧的是，好的项目从来没有经历过这种情况，或者它是1/1000\n它发生了。Shiba Inu是一个只有一个目标的硬币，\"死亡的狗币\"，它甚至没有\n甚至没有用。然而，人们正在出售他们的资产来购买Shiba。",
      "title": "我是唯一一个体验到柴犬成功的人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直看到Shiba Inu上漲20% 40% 35%，它就是不停止....。這讓我很沮喪\n讓我感到沮喪的是，好的項目從來沒有經歷過這種情況，或者它是1/1000\n它發生了。Shiba Inu是一個只有一個目標的硬幣，\"死亡的狗幣\"，它甚至沒有\n甚至沒有用。然而，人們正在出售他們的資產來購買Shiba。",
      "title": "我是唯一一個體驗到柴犬成功的人嗎？"
    }
  ]
}