{
  "author": "roman-roz",
  "original_created_utc": 1624981160,
  "title": "Would you really be upset if you caught your partner watching porn? Does it hurt so badly?",
  "created_utc": 1625021081,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was reading <a href=\"/r/loveafterporn\">r/loveafterporn</a> where women share their stories about partners who secretly watch porn and it baffled me about how heartbreaking most of the stories are. Finding out about possible porn addiction caused huge distress to the level of anxiety and depression.  Most advice there comes down to breaking up.</p>\n\n<p>I know that this addiction is serious, leads to <a href=\"/r/DeadBedrooms\">r/DeadBedrooms</a> and <a href=\"/r/erectiledysfunction\">r/erectiledysfunction</a> not to mention dishonesty in relationships it can cause.</p>\n\n<p>But do you really afraid to death that your partner sometimes watches porn (secretly or openly)? Is it an insult? Asking mostly girls.</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/TooAfraidToAsk/comments/oaasnq/would_you_really_be_upset_if_you_caught_your/",
  "subreddit": "TooAfraidToAsk",
  "id": "oaasnq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was reading r/loveafterporn [/r/loveafterporn] where women share their stories\nabout partners who secretly watch porn and it baffled me about how heartbreaking\nmost of the stories are. Finding out about possible porn addiction caused huge\ndistress to the level of anxiety and depression. Most…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/loveafterporn [/r/loveafterporn]を読んでいたのですが、そこでは女性たちが密かにポルノを見ているパートナーについての話を共有していました。\n密かにポルノを見ているパートナーについての話を共有していますが、ほとんどの話がとても悲痛であることに困惑しました。\nほとんどの話がとても悲惨なものでした。ポルノ依存症の可能性があることを知ると、不安になるほどの大きな\n不安になったり、落ち込んだりするほどの大きな苦痛を感じます。ほとんどの...",
      "title": "パートナーがポルノを見ているのを見つけたら、あなたは本当に怒るだろうか？そんなに傷つきますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在阅读r/loveafterporn [/r/loveafterporn]，其中女性分享了她们的故事\n伴侣偷偷看色情片的故事，让我感到困惑的是，大多数故事都是如此令人心碎。\n大多数的故事都很令人心碎。发现可能的色情成瘾引起巨大的\n痛苦，甚至达到了焦虑和抑郁的程度。大多数人...",
      "title": "如果你发现你的伴侣在看色情片，你真的会不高兴吗？它的伤害有那么严重吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在閱讀r/loveafterporn [/r/loveafterporn]，其中女性分享了她們的故事\n伴侶偷偷看色情片的故事，讓我感到困惑的是，大多數故事都是如此令人心碎。\n大多數的故事都很令人心碎。發現可能的色情成癮引起巨大的\n痛苦，甚至達到了焦慮和抑鬱的程度。大多數人...",
      "title": "如果你發現你的伴侶在看色情片，你真的會不高興嗎？它的傷害有那麼嚴重嗎？"
    }
  ]
}