{
  "author": "Jsausage92",
  "the_new_excerpt": "As I've been led to understand, most people who survive a suicide attempt wish\nthey'd made a different choice while still conscious. Is the rational brain,\nwhich has weighed up years and years of unbearable conditions, suddenly\noverridden by the INSTINCT to survive - an instinct so strong it's…",
  "original_created_utc": 1617259104,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知 大多数自杀未遂后幸存的人都希望...\n他们在清醒的时候做出了不同的选择。是理性的大脑。\n多年来难以忍受的状况，突然间\n被求生的本能压倒了，这种本能如此强烈... ...",
      "title": "当那些想自杀而失败的人说 \"我一跳就意识到我想活下去 \"的时候，这不就是归结于一种进化的诱因吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知 大多數自殺未遂後倖存的人都希望...\n他們在清醒的時候做出了不同的選擇。是理性的大腦。\n多年來難以忍受的狀況，突然間\n被求生的本能壓倒了，這種本能如此強烈... ...",
      "title": "當那些想自殺而失敗的人說 \"我一跳就意識到我想活下去 \"的時候，這不就是歸結於一種進化的誘因嗎？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私の理解では、自殺未遂から生還した人の多くは、「あの時、自殺しておけばよかった」と思うそうです。\n意識があるうちに別の選択をしておけばよかったと思うものです。理性的な脳は\n何年も何年も耐え難い状況を重んじてきた理性的な脳が、突然、生き延びようとする本能に上書きされてしまうのでしょうか。\n生き延びようとする本能に支配されてしまうのでしょうか...",
      "title": "自殺を試みて失敗した人が「飛び降りたら生きたいと思った」と言うのは、進化のきっかけに過ぎないのでは？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、自殺未遂から生還した人の多くは、「あの時、自殺しておけばよかった」と思うそうです。\n意識があるうちに別の選択をしておけばよかったと思うものです。理性的な脳は\n何年も何年も耐え難い状況を重んじてきた理性的な脳が、突然、生き延びようとする本能に上書きされてしまうのでしょうか。\n生き延びようとする本能に支配されてしまうのでしょうか...",
      "title": "自殺を試みて失敗した人が「飛び降りたら生きたいと思った」と言うのは、進化のきっかけに過ぎないのでは？"
    }
  ],
  "title": "When people who tried to commit suicide and failed say \"I realised once I jumped I wanted to live\", isn't this just down to an evolutionary trigger?",
  "created_utc": 1617284110,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I&#39;ve been led to understand, most people who survive a suicide attempt wish they&#39;d made a different choice while still conscious. Is the rational brain, which has weighed up years and years of unbearable conditions, suddenly overridden by the INSTINCT to survive - an instinct so strong it&#39;s undeniable, and this ends up colouring the rational side of things?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/mhpeg5/when_people_who_tried_to_commit_suicide_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "mhpeg5",
  "is_self": true,
  "media": null,
  "is_video": false
}