{
  "author": "KAX1107",
  "original_created_utc": 1626632983,
  "title": "I am 100% convinced of $100k BTC this year",
  "created_utc": 1626640607,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have Glassnode subscription. I have been following the on chain metrics since the dip in May. I am comparing both on chain and the charts of the current sideways market to previous long bear markets and consolidation markets aka crab market.</p>\n\n<p>At first in May, there were a lot of negative metrics like miners capitulation, whale and retail capitulation.</p>\n\n<p>But since the middle of June, miners are accumulating, whales are accumulating, only retail is mostly selling but also the number of wallets keeps trending up. In long bear markets, this will not happen.</p>\n\n<p>The current situation looks exactly the same as the middle part of 2013 and 2017. Some boring months and then suddenly the mother of all bull runs out of nowhere.</p>\n\n<p>Remember that BTC was 2.5k around June-July in 2017. You wouldn&#39;t have believed it would hit 20k by December back then either. 2013 same story with a lot of sideways during middle of the year.</p>\n\n<p>First it was Elon FUD. Then in the last 3 to 4 weeks, Bitcoin has overcome being banned by the world&#39;s most populated country. It only made a slight impact on price. Difficulty adjusted and now miners are relocating and coming back online with renewables.</p>\n\n<p>Remember China also banned Bitcoin in the middle of 2017. These attacks never work on Bitcoin. It always makes Bitcoin stronger, so expect a raging bull run to start soon.</p>\n\n<p>Bitcoin history shows that dip buyers have always won. Dip sellers just end up buying at higher price. So take your opportunity or you will regret later.</p>\n\n<p>In 2013, BTC started in 3 figures and reached 4 figures.</p>\n\n<p>In 2017, BTC started in 4 figures and reached 5 figures.</p>\n\n<p>In 2021, BTC started in 5 figures and will reach 6 figures.</p>\n\n<p>It&#39;s like clockwork. A mathematical miracle!</p>\n\n<p>Edit : These are my thoughts based on my own research. NFA. DYOR.</p>\n</div><!-- SC_ON -->",
  "score": 279,
  "permalink": "/r/CryptoCurrency/comments/omwb4i/i_am_100_convinced_of_100k_btc_this_year/",
  "subreddit": "CryptoCurrency",
  "id": "omwb4i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have Glassnode subscription. I have been following the on chain metrics since\nthe dip in May. I am comparing both on chain and the charts of the current\nsideways market to previous long bear markets and consolidation markets aka crab\nmarket.\n\nAt first in May, there were a lot of negative metrics…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はGlassnodeを購読しています。私は5月のディップ以来、オンチェーン・メトリクスを追っています。\n5月に落ち込んだ時から、オンチェーンの指標を見ています。私は、オンチェーンと現在の横ばいマークのチャートの両方を比較しています。\n現在の横ばいの市場と過去の長い弱気の市場や統合市場、別名カニ市場の両方を比較しています。\n市場です。\n\n5月の最初の段階では、多くのネガティブな指標がありました...",
      "title": "私は今年、100k BTCを100％確信しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有Glassnode订阅。我一直在关注链上的指标，因为\n5月的下跌以来，我一直在关注链上指标。我在比较链上和目前的图表中的\n横向市场与以前的长期熊市和盘整市场（又称螃蟹\n市场。\n\n起初在5月份，有很多负面指标...",
      "title": "我对今年的10万美元BTC有100%的信心"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有Glassnode訂閱。我一直在關注鏈上的指標，因爲\n5月的下跌以來，我一直在關注鏈上指標。我在比較鏈上和目前的圖表中的\n橫向市場與以前的長期熊市和盤整市場（又稱螃蟹\n市場。\n\n起初在5月份，有很多負面指標...",
      "title": "我對今年的10萬美元BTC有100%的信心"
    }
  ]
}