{
  "author": "Froteet",
  "original_created_utc": 1645858485,
  "title": "Why do christians try to convert people all the time?",
  "created_utc": 1645868371,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So for context I work at a gas station and I am a member of The Satanic Temple. I wear a ring and necklace with satanic imagery, I even have a &amp;quot;membership card&amp;quot; in my wallet with the 7 tenets listed on the back&lt;/p&gt;\n\n&lt;p&gt;At work tonight an old man (75 at the youngest) comes in, walks to the counter and says &amp;quot;my wife and I are completely out of money can you please help us out with a snack?&amp;quot; As someone whose fairly altruistic I think for a minute and think about the first tenet which says &amp;quot;One should strive to treat all living things with compassion and empathy in accordance with reason&amp;quot; so I tell this man &amp;quot;bring something to the counter so I can pay for it and it&amp;#39;s all yours&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;He grabs a bag of popcorn and a bag of donuts for him and his wife and takes some napkins. I scan them and tell him that he&amp;#39;s all set which is when he says &amp;quot;Thank you, my wife and I will pray for you... do you believe in Jesus?&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;I calmly explain &amp;quot;No I&amp;#39;m a Satanist but the first tenet tells me to treat people with compassion&amp;quot; and he then goes into an explanation about how to get into heaven and how covid is sent by god because we&amp;#39;re too sinful and how I should seek salvation which goes on for several minutes of which I calmly tell him I&amp;#39;m not interested, eventually he leaves after telling me tk read John 3:16 and John 3:32&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m left wondering why try to convert someone who has already been kind and charitable to you to your religion which is for some reason better? If the man had been jewish or a muslim I don&amp;#39;t think they would have told me to read the torah or quran. &lt;/p&gt;\n\n&lt;p&gt;It consistently seems that very devoted christians are so concerned with converting people who want nothing to do with their teachings&lt;/p&gt;\n\n&lt;p&gt;EDIT: I should say that I harbor no ill will towards christians or religion as apparently the rest of reddit seems too.&lt;/p&gt;\n\n&lt;p&gt;I have a family member who is a devout christian who channeled her faith into thousands of community service hours doing things like sewing onesies for premature babies and dog toys for animal shelters.&lt;/p&gt;\n\n&lt;p&gt;Many Christians use their faith in service to their community and some of y&amp;#39;all need to back away from your &amp;quot;religion is cult&amp;quot; mindset&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/t1qojo/why_do_christians_try_to_convert_people_all_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "t1qojo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So for context I work at a gas station and I am a member of The Satanic Temple.\nI wear a ring and necklace with satanic imagery, I even have a \"membership card\"\nin my wallet with the 7 tenets listed on the back\n\nAt work tonight an old man (75 at the youngest) comes in, walks to the counter\nand says…"
}