{
  "author": "cm2_0",
  "the_new_excerpt": "I firmly believe this. I'll repeat it: you haven't earned anything and you\nhaven't lost anything until you sell.\n\nIs your portfolio up by 100%? 200%? 300%? Great, but you see, you haven't earned\nanything at all, because you haven't sold anything.\n\nOr is your portfolio down by x%? Well, I have a…",
  "original_created_utc": 1621423203,
  "title": "You haven't earned anything and you haven't lost anything until you sell",
  "created_utc": 1621434939,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I firmly believe this. I&#39;ll repeat it: <strong>you haven&#39;t earned anything and you haven&#39;t lost anything until you sell.</strong>  </p>\n\n<p>Is your portfolio up by 100%? 200%? 300%? Great, but you see, you haven&#39;t earned anything at all, because you haven&#39;t sold anything. </p>\n\n<p>Or is your portfolio down by x%? Well, I have a great news: for the same reason, you haven&#39;t lost anything, because you haven&#39;t sold. </p>\n\n<p><em>As long as you don&#39;t lose your initial invested capital</em>, it&#39;s fine. The only thing you would lose is a potential gain. Nothing more, nothing less. So, try to secure your initial capital and you&#39;ll be okay. You&#39;ll be much more calm and relaxed during these times. </p>\n\n<p>At least, this is what works for me. In the end, this is just my philosophy. Feel free to insult me or whatever. Peace!</p>\n</div><!-- SC_ON -->",
  "score": 2127,
  "permalink": "/r/CryptoCurrency/comments/ng33mk/you_havent_earned_anything_and_you_havent_lost/",
  "subreddit": "CryptoCurrency",
  "id": "ng33mk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801369,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はそう確信しています。繰り返しますが、あなたは何も得ていないし、何もしていません。\n売るまで何も失わない。\n\nあなたのポートフォリオは100％アップしていますか？200%? 300%? 素晴らしい、でもね、あなたは何も得ていないのです。\n何も売っていないのだから、全く何もない。\n\nあるいは、あなたのポートフォリオはx%減少していますか？まあ、私は...",
      "title": "売るまで何も稼げず、何も失わない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我坚定地相信这一点。我再重复一遍：你没有赢得任何东西，你\n除非你卖掉，否则你就没有损失任何东西。\n\n你的投资组合是否上涨了100%？200%? 300%? 很好，但你看，你还没有赚到\n任何东西，因为你还没有卖出任何东西。\n\n或者你的投资组合下降了X%？好吧，我有一个...",
      "title": "你没有赚到任何东西，你也没有失去任何东西，直到你卖掉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我堅定地相信這一點。我再重複一遍：你沒有贏得任何東西，你\n除非你賣掉，否則你就沒有損失任何東西。\n\n你的投資組合是否上漲了100%？200%? 300%? 很好，但你看，你還沒有賺到\n任何東西，因爲你還沒有賣出任何東西。\n\n或者你的投資組合下降了X%？好吧，我有一個...",
      "title": "你沒有賺到任何東西，你也沒有失去任何東西，直到你賣掉。"
    }
  ]
}