{
  "author": "Mrs-Plantain",
  "original_created_utc": 1632530728,
  "title": "Why do some people refuse to wash their hands?",
  "created_utc": 1632581864,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed that the most during the pandemic. People that have a bathroom stall and refuse to wash their hands. I watched a woman come out of stall, stand in front of a running faucet fixing her hair, then walk out without washing. I have a family member who notoriously won&#39;t wash his hands after he blows up a bathroom. These are grown, fully functioning adults. </p>\n\n<p>This isn&#39;t a rhetorical question, I&#39;m genuinely curious why some people will not wash their hands.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/puw7h2/why_do_some_people_refuse_to_wash_their_hands/",
  "subreddit": "TooAfraidToAsk",
  "id": "puw7h2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've noticed that the most during the pandemic. People that have a bathroom\nstall and refuse to wash their hands. I watched a woman come out of stall, stand\nin front of a running faucet fixing her hair, then walk out without washing. I\nhave a family member who notoriously won't wash his hands after…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パンデミックの時に一番気になっていた。トイレの個室を持っている人が\nストールを持っていても手を洗わない人がいます。ある女性がトイレから出てきて、流れる蛇口の前に立って髪を整えた後、洗わずに出て行くのを見ました。\n洗面所から出てきた女性が、流れる蛇口の前で髪を整え、洗わずに出て行くのを見ました。I\n私の家族には、トイレの後に手を洗わないことで有名な人がいます。",
      "title": "なぜ手を洗わない人がいるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在大流行期间注意到这一点最多。那些拥有一个卫生间的人\n的人拒绝洗手。我看到一个女人从隔间里出来，站在流水的水龙头前整理头发，然后没有洗手就走了。\n在流动的水龙头前整理她的头发，然后不洗就走出去。I\n我有一个家庭成员，他在上完厕所后不洗手，这是出了名的。",
      "title": "为什么有些人拒绝洗手？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在大流行期間注意到這一點最多。那些擁有一個衛生間的人\n的人拒絕洗手。我看到一個女人從隔間裏出來，站在流水的水龍頭前整理頭髮，然後沒有洗手就走了。\n在流動的水龍頭前整理她的頭髮，然後不洗就走出去。I\n我有一個家庭成員，他在上完廁所後不洗手，這是出了名的。",
      "title": "爲什麼有些人拒絕洗手？"
    }
  ]
}