{
  "author": "MaxThrustage",
  "the_new_excerpt": "I recently read \"Misquoting Jesus\" by Bart Ehrman, which tells how scribal\nerrors played a major role in shaping what we currently understand as the Bible.\nBut a lot of the arguments given there seem like they should apply to any\nancient text that was copied by hand many times over. This has lead to…",
  "original_created_utc": 1618069598,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、バート・エールマンの「イエスの誤記」を読みました。\nこの本は、私たちが現在理解している聖書を形成するのに、律法学者の誤りがいかに大きな役割を果たしたかを教えてくれます。\nしかし、この本に書かれていることは、手で何度もコピーされた古代のテキストにも当てはまることのように思えます。\n手で何度もコピーされた古代のテキストにも当てはまるように思えます。そのため、...",
      "title": "古代や中世の写字者は、聖書を書き写す際にいくつかの誤りや変更を行っています。そのため、今日に至るまで原版が争われている箇所がいくつかあり、また、重要な箇所の理解の仕方が誤りによって形成されている例もいくつかあります。十分に古いテキストでも、同じことが言えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近读了Bart Ehrman写的 \"Misquiting Jesus\"，其中讲述了文士是如何。\n错误在形成我们目前所理解的《圣经》中起到了重要作用。\n但那里给出的许多论点似乎应该适用于任何\n古文，是经过多次手抄的。这就导致了...",
      "title": "古代和中世纪的文士在抄写《圣经》时犯了好几处错误，做了一些改动，导致有好几处经文的原版至今仍有争议，也有好几处错误形成了关键经文的理解方式。任何足够古老的文本也是如此吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近讀了Bart Ehrman寫的 \"Misquiting Jesus\"，其中講述了文士是如何。\n錯誤在形成我們目前所理解的《聖經》中起到了重要作用。\n但那裏給出的許多論點似乎應該適用於任何\n古文，是經過多次手抄的。這就導致了...",
      "title": "古代和中世紀的文士在抄寫《聖經》時犯了好幾處錯誤，做了一些改動，導致有好幾處經文的原版至今仍有爭議，也有好幾處錯誤形成了關鍵經文的理解方式。任何足夠古老的文本也是如此嗎？"
    }
  ],
  "title": "Ancient and medieval scribes made several errors and changes when copying the Bible, leading to several passages where the original version is disputed to this day, and several instances where errors have shaped the way key passages are understood. Is the same true of any sufficiently ancient text?",
  "created_utc": 1618105935,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently read &quot;Misquoting Jesus&quot; by Bart Ehrman, which tells how scribal errors played a major role in shaping what we currently understand as the Bible. But a lot of the arguments given there seem like they should apply to any ancient text that was copied by hand many times over. This has lead to me thinking about other texts -- do we have the same accumulation of scribal errors in other ancient texts, and the same business of textual criticism trying to understand the &quot;original&quot; for other works, or is the Bible somehow special because of the number of copies made, or the level of academic focus on it?</p>\n\n<p>I&#39;m also curious if there is a difference in the role played by scribal error in different parts of the world. Does this propagation of errors affect our current understanding of, say, the Chinese classics? Is there an equivalent of the study of textual criticism for oral traditions, where one studies errors made in oral transmission of texts to try to reconstruct the original?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/mo74u5/ancient_and_medieval_scribes_made_several_errors/",
  "subreddit": "AskHistorians",
  "id": "mo74u5",
  "is_self": true,
  "media": null,
  "is_video": false
}