{
  "author": "0bran",
  "original_created_utc": 1634278299,
  "title": "Feel sad for people who don't understand",
  "created_utc": 1634355284,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Long time lurker first time poster. Been in crypto since the peak of the last bull, lost some money, gain much more, but what is more important I realized what BTC is and I love it more than any other asset.</p>\n\n<p>My question is, in these three years I have been talking to a numerous friends, explaining them what is BTC, what is blockchain, risks and benefits, everything that goes with it. I even created pdf document with guides for noobs and advanced users, on English and my country language.</p>\n\n<p>So my question, how can someone know about BTC for three years, one of the best friends is investing, trying to teach you and trying to make you understand, you see the price, the news, and your friend talking about BTC a lot, and still in three years you did not take time to read about this new technology, nor did you have shown any interest to learn something new.</p>\n\n<p>Now when BTC is reaching ATH again, they want to invest. They want to send me money without even researching BTC nor trying to make an acc for themselves.</p>\n\n<p>People are lazy, dumb, and they don&#39;t trust anyone. Herd mentality likes to sleep on the pillow made of cash, and we are about to see one of the biggest inflation crisis in History of a mankind</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/q8i6tf/feel_sad_for_people_who_dont_understand/",
  "subreddit": "Bitcoin",
  "id": "q8i6tf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Long time lurker first time poster. Been in crypto since the peak of the last\nbull, lost some money, gain much more, but what is more important I realized\nwhat BTC is and I love it more than any other asset.\n\nMy question is, in these three years I have been talking to a numerous friends,\nexplaining…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長い間隠れていた人が、初めて投稿しました。前回の強気のピーク時から暗号化に参加しています。\n失ったものもあったが、それ以上に得たものもあった。\n他のどの資産よりもBTCを愛しています。\n\n質問ですが、この3年間、私は多くの友人と話をしてきました。\n説明していましたが...",
      "title": "理解できない人を悲しく思う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "长时间的潜伏者，第一次发帖。从上一次牛市的高峰期开始就一直在做加密货币。\n损失了一些钱，获得了更多，但更重要的是我意识到了BTC是什么。\nBTC是什么，我爱它胜过其他任何资产。\n\n我的问题是，在这三年里，我一直在和许多朋友交谈。\n解释...",
      "title": "为那些不理解的人感到难过"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長時間的潛伏者，第一次發帖。從上一次牛市的高峯期開始就一直在做加密貨幣。\n損失了一些錢，獲得了更多，但更重要的是我意識到了BTC是什麼。\nBTC是什麼，我愛它勝過其他任何資產。\n\n我的問題是，在這三年裏，我一直在和許多朋友交談。\n解釋...",
      "title": "爲那些不理解的人感到難過"
    }
  ]
}