{
  "author": "Thomshan911",
  "original_created_utc": 1636199693,
  "title": "My 'crypto is a scam' dad talking about setting up a mining rig.",
  "created_utc": 1636238482,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My dad has always been investing in stocks and I&#39;ve urged him multiple times to take a look into crypto. He never paid any heed to my advice and I had given up trying to convince him. He&#39;s always equated crypto to the dot com bubble and said it&#39;s only a matter of time before the bubble bursts.</p>\n\n<p>I recently caught him watching a Udemy course on Cryptocurrency and mining. Seems like he&#39;s finally trying to  understand crypto and has also expressed to me that he wants to build a mining rig soon. He&#39;s also set up a Coinbase account. I&#39;m so excited since I&#39;ll soon have someone I can discuss crypto with at home.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/qnypr3/my_crypto_is_a_scam_dad_talking_about_setting_up/",
  "subreddit": "CryptoCurrency",
  "id": "qnypr3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My dad has always been investing in stocks and I've urged him multiple times to\ntake a look into crypto. He never paid any heed to my advice and I had given up\ntrying to convince him. He's always equated crypto to the dot com bubble and\nsaid it's only a matter of time before the bubble bursts.\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の父はいつも株に投資していますが、私は何度も父に暗号を見てみるように勧めました。\nと何度も勧めてきましたが、今回は暗号について考えてみました。父は私のアドバイスに耳を貸さず、私も説得を諦めていました。\n説得を諦めていました。彼はいつも、暗号をドットコム・バブルと同じように考えていて\nバブルが崩壊するのは時間の問題だと言っていました。\n\nI...",
      "title": "私の「暗号は詐欺だ」という父親は、マイニングリグのセットアップについて話していました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我父亲一直在投资股票，我多次敦促他\n看一下加密货币。他从不理会我的建议，我也曾放弃过\n试图说服他。他总是把加密货币等同于网络泡沫，并说它只是一个床垫。\n说泡沫破灭只是时间问题。\n\nI...",
      "title": "我的 \"加密货币是个骗局 \"的父亲正在谈论建立一个采矿设备。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我父親一直在投資股票，我多次敦促他\n看一下加密貨幣。他從不理會我的建議，我也曾放棄過\n試圖說服他。他總是把加密貨幣等同於網絡泡沫，並說它只是一個牀墊。\n說泡沫破滅只是時間問題。\n\nI...",
      "title": "我的 \"加密貨幣是個騙局 \"的父親正在談論建立一個採礦設備。"
    }
  ]
}