{
  "author": "gnarley_quinn",
  "original_created_utc": 1651208764,
  "title": "I tried to warn people about a metaverse project, and got downvoted, banned and labelled a FUDder across every social media platform. It is now down 92% from ATH. A warning about echo-chambers.",
  "created_utc": 1651240416,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Per my &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/twrkua/i_analysed_a_major_metaverse_project_and_believe/\"&gt;original post&lt;/a&gt; where I warned everyone about SOLICE. It is now at 40c which is more than 90% from its ATH and its less than a year old.&lt;/p&gt;\n\n&lt;p&gt;This project has been one disaster after another. Constant delays, regular fails to deliver, blaming others for the causes, ignoring questions from investors, VCs dumping hard, the list goes on. Check the post above for the full details.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;This post is more about echo-chambers.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;DO YOUR OWN RESEARCH.&lt;/p&gt;\n\n&lt;p&gt;That is the mantra. When something doesn&amp;#39;t feel right, challenge it. If you get downvoted, suspended, banned whatever that is a massive red flag. As long as you are challenging respectfully and providing evidence for your concern, moderators have no right to remove you from the conversation. This is literally you doing your research.&lt;/p&gt;\n\n&lt;p&gt;If you are prevented from doing your own research because the powers that be from the sub, discord, telegram, etc just keep pushing you out then you take the hint and get the f### out.&lt;/p&gt;\n\n&lt;p&gt;Some of the worst examples here include Loopring and Safemoon (also down similar levels from ATH). Jump into their subs, their discord channels and their telegrams. Try challenging respectfully and see how long you last. If you think we&amp;#39;re early in crypto, or its the wave of the future, head on over to the buttcoin sub and read the perspective of others.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The echochamber is one of the worst things about crypto. People get so excited to be involved &amp;quot;early&amp;quot; in a project, but this can lead to some massive emotional bias to overlook the more important fundamentals. By the time you realise the &amp;#39;FUD&amp;#39; was truth, it&amp;#39;s too late.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t believe anyone. Not even me.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;EDIT: To clarify,&lt;/p&gt;\n\n&lt;p&gt;I have been banned from:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;SOLICE discord (three different accounts)&lt;/li&gt;\n&lt;li&gt;SOLICE telegram&lt;/li&gt;\n&lt;li&gt;SOLANA discord (one account)&lt;/li&gt;\n&lt;li&gt;LOOPRING subreddit&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I have been suspended from:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;SOLANA subreddit&lt;/li&gt;\n&lt;li&gt;CARDANO subreddit&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I have been reported and flagged by:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;SOLICE twitter official&lt;/li&gt;\n&lt;li&gt;SOLICE youtube&lt;/li&gt;\n&lt;li&gt;LOOPRING twitter official&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;EDIT2: &lt;strong&gt;This post has proved my point yet again. Every single comment I&amp;#39;ve made on this post has been downvoted to hell.&lt;/strong&gt; Just scroll down and look. Granted its mostly by the insufferable LRC fanbois but its in pretty much every thread. We are in a f**king echo chamber and you all need to open your eyes.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 392,
  "permalink": "/r/CryptoCurrency/comments/ueehw6/i_tried_to_warn_people_about_a_metaverse_project/",
  "subreddit": "CryptoCurrency",
  "id": "ueehw6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Per my original post\n[https://np.reddit.com/r/CryptoCurrency/comments/twrkua/i_analysed_a_major_metaverse_project_and_believe/]\nwhere I warned everyone about SOLICE. It is now at 40c which is more than 90%\nfrom its ATH and its less than a year old.\n\nThis project has been one disaster after another.…"
}