{
  "author": "antichain",
  "the_new_excerpt": "I've recently become interested in the Khmer Rouge and one thing that I'm\nstruggling to make sense of is exactly where I would put them on the political\nlandscape. On one hand, I know they were allied with the USSR and certainly\nself-identified as communist, however, a lot of their stated beliefs…",
  "original_created_utc": 1617327141,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近对红色高棉产生了浓厚的兴趣，有一件事，我...\n在我看来，这正是我对他们在政治上的理解。\n景观。一方面，我知道他们与苏联结盟，肯定是\n自认为是共产党员，但是，他们的很多信仰... ...",
      "title": "历史学家如何对红色高棉进行分类？他们到底相信什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近對紅色高棉產生了濃厚的興趣，有一件事，我...\n在我看來，這正是我對他們在政治上的理解。\n景觀。一方面，我知道他們與蘇聯結盟，肯定是\n自認爲是共產黨員，但是，他們的很多信仰... ...",
      "title": "歷史學家如何對紅色高棉進行分類？他們到底相信什麼？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "最近、クメール・ルージュに興味を持っているのですが、一つだけ悩んでいることがあります。\n私は最近、クメール・ルージュに興味を持っているのですが、その意味を理解するのに苦労しています。\n悩んでいるのは、彼らを政治的にどこに位置づけるかということです。一方で、彼らがソ連と同盟していたことは知っています。\nしかし、彼らの信念の多くは...",
      "title": "歴史家はクメール・ルージュをどのように分類していますか？彼らは何を信じていたのか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "最近、クメール・ルージュに興味を持っているのですが、一つだけ悩んでいることがあります。\n私は最近、クメール・ルージュに興味を持っているのですが、その意味を理解するのに苦労しています。\n悩んでいるのは、彼らを政治的にどこに位置づけるかということです。一方で、彼らがソ連と同盟していたことは知っています。\nしかし、彼らの信念の多くは...",
      "title": "歴史家はクメール・ルージュをどのように分類していますか？彼らは何を信じていたのか？"
    }
  ],
  "title": "How do historians classify the Khmer Rouge? What did they really believe?",
  "created_utc": 1617355912,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve recently become interested in the Khmer Rouge and one thing that I&#39;m struggling to make sense of is exactly where I would put them on the political landscape. On one hand, I know they were allied with the USSR and certainly self-identified as communist, however, a lot of their stated beliefs seem a lot more like fascism - ethnic nationalism, nostalgia for a lost great past, focus on agricultural production as opposed to industry, and other things that I typically associate more with the far Right then the far Left.</p>\n\n<p>They weren&#39;t exactly singing &quot;Workers of the World.&quot;</p>\n\n<p>It seems like, in many respects, they combine the worst of state-communist and fascist ideologies. How do historians and political theorists talk about this? I always learned that Pol Pot was just another communist dictator, but it seems like there&#39;s a bit more going on than that.</p>\n\n<p>If anyone has any interesting readings on the Khmer Rouge as an ideological movement, or a good biography of Pol Pot, I&#39;d take a recommendation. Most of what I can find is first-person accounts of things like the Killing Fields. Tragic, but more personal narratives and autobiographies than political. </p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/mia0mp/how_do_historians_classify_the_khmer_rouge_what/",
  "subreddit": "AskHistorians",
  "id": "mia0mp",
  "is_self": true,
  "media": null,
  "is_video": false
}