{
  "author": "partymsl",
  "original_created_utc": 1645631109,
  "title": "Just made 1.1$ off leverage trading. Ask me anything now.",
  "created_utc": 1645688162,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes, I did the thing that everyone here in this sub is afraid of. I did the thing that no one else could. I went 25x into a certain coin and made an enormous 1.1$ profit. Now I can finally add professional leverage trader to my resume and apply for a job at some bug bank then go to a government organization, from there I will start my political career and in a few months be senator, after that I will make a crypto legal tender law as it should be and try do pass it.&lt;/p&gt;\n\n&lt;p&gt;Sounds good right?&lt;/p&gt;\n\n&lt;p&gt;But no joke had some amazing timing. Selling 3min before the dumb and making that profit. Oh leverage really is the safest thing ever.&lt;/p&gt;\n\n&lt;p&gt;But don&amp;#39;t worry I will obviously remember you all after becoming president.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/szkgsr/just_made_11_off_leverage_trading_ask_me_anything/",
  "subreddit": "CryptoCurrency",
  "id": "szkgsr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Yes, I did the thing that everyone here in this sub is afraid of. I did the\nthing that no one else could. I went 25x into a certain coin and made an\nenormous 1.1$ profit. Now I can finally add professional leverage trader to my\nresume and apply for a job at some bug bank then go to a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう、このサブでみんなが恐れていることをやってしまったのです。私がやったのは\n誰もできなかったこと。あるコインに25倍で投資し\n1.1$の莫大な利益を得た。これでようやく、プロのレバレッジトレーダーとして\n履歴書を書いて、どこかのバグバンクの求人に応募し、それから...",
      "title": "レバレッジ取引で1.1ドル儲けただけ。今すぐ何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我做了这个子里所有人都害怕的事情。我做了\n别人都做不到的事情。我对某一硬币进行了25倍的投资，并赚取了\n1.1美元的巨大利润。现在我终于可以在我的简历中加入专业的杠杆交易员了\n我终于可以在我的简历上加上专业的杠杆交易员，并申请在一些错误的银行工作，然后去一个...",
      "title": "刚刚从杠杆交易中赚了1.1美元。现在问我任何问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我做了這個子裏所有人都害怕的事情。我做了\n別人都做不到的事情。我對某一硬幣進行了25倍的投資，並賺取了\n1.1美元的巨大利潤。現在我終於可以在我的簡歷中加入專業的槓桿交易員了\n我終於可以在我的簡歷上加上專業的槓桿交易員，並申請在一些錯誤的銀行工作，然後去一個...",
      "title": "剛剛從槓桿交易中賺了1.1美元。現在問我任何問題。"
    }
  ]
}