{
  "author": "omahthedesignah",
  "the_new_excerpt": "If you don't know wtf is happening then just Google \"Suez Canal Blockage\" and\ncome back.\n\nI believe there is more to the story. And the Blockage might not be solved until\nweeks from now (maybe more who knows?) in case everything went smooth and no\nfuxk ups and wreckage happens because it's a VERY…",
  "original_created_utc": 1616761452,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你不知道发生了什么事，那就谷歌一下 \"苏伊士运河堵塞 \"和\n回来。\n\n我相信还有更多的故事。而 \"堵塞 \"的问题可能要等到 And the Blockage might not be solved until\n周后（也许更多，谁知道呢？\nfuxk ups和残骸发生，因为它是一个非常... ...",
      "title": "苏伊士运河堵塞"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你不知道發生了什麼事，那就谷歌一下 \"蘇伊士運河堵塞 \"和\n回來。\n\n我相信還有更多的故事。而 \"堵塞 \"的問題可能要等到 And the Blockage might not be solved until\n周後（也許更多，誰知道呢？\nfuxk ups和殘骸發生，因爲它是一個非常... ...",
      "title": "蘇伊士運河堵塞"
    }
  ],
  "title": "Suez Canal Blockage",
  "created_utc": 1616819723,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you don&#39;t know wtf is happening then just Google &quot;Suez Canal Blockage&quot; and come back. </p>\n\n<p>I believe there is more to the story. And the Blockage might not be solved until weeks from now (maybe more who knows?) in case everything went smooth and no fuxk ups and wreckage happens because it&#39;s a VERY BIG ASS SHIP that blocked the whole thing sideways. </p>\n\n<p>The longer this disruption persists, the wider the ripple effects will be. Understand?\nI was thinking about the ripple effect and how that might affect the world trade. Why? </p>\n\n<p>%10 of world trade by tonnage passes through the Suez Canal\n%9 of the world&#39;s seaborne oil (5.5 million barrels of oil) passes EVERYDAY!</p>\n\n<p>We need think out loud and discuss how the fuxk we can benefit from that. \nWhat instruments? And why? \nAnd I will edit the post for you dear apes. </p>\n\n<p>Long Oil while we think about fuxking the world economy this weekend.</p>\n\n<p>Edit1: Tankers could be a play.. $NAT has some potential to capitalize on the situation because of their fleet is Suezmax size etc</p>\n\n<p>I&#39;m not your financial advisor I&#39;m your daddy. Who does serious DD these days anyway</p>\n</div><!-- SC_ON -->",
  "score": 1147,
  "permalink": "/r/wallstreetbets/comments/mdnfyc/suez_canal_blockage/",
  "subreddit": "wallstreetbets",
  "id": "mdnfyc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357147039
}