{
  "author": "Ouiju",
  "the_new_excerpt": "After a fly-by-night post a few days ago said Alteryx was a buy, I decided to do\nsome DD. I've wanted to for awhile, at the time of this writing I owned AYX\n(buying ~$70 back in 2019) and it seemed like the stock could do no wrong as it\nexploded to ATHs (~$178) in Mid-2020. However, it's currently…",
  "original_created_utc": 1619201124,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数日前にAlteryxは買いだと言っていたフライバイナイトの投稿の後、私はいくつかのDDをすることにしました。\nDDをしてみることにしました。私はしばらくの間そうしたいと思っていました、この記事を書いている時点で私はAYXを所有していました\n(2019年に70ドルで購入)を所有していましたが、この記事を書いている時点では、この株は間違っていないように思えました。\n2020年半ばにATH（～178ドル）まで爆発しました。しかしながら、現在は...",
      "title": "私のAlteryx (AYX) DD: これは買うべきディップではなく、彼らの長い衰退の一部なのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几天前，有一个蝇头小利的帖子说Alteryx是一个买点，我决定做一下\n一些DD。我已经想了一段时间了，在写这篇文章的时候，我拥有AYX\n(2019年买入约70美元)，似乎这只股票不会有错，因为它\n在2020年中期爆炸到ATHs（约178美元）。然而，它目前...",
      "title": "我的Alteryx(AYX)DD：这不是一个可以买入的低点，这是他们长期下跌的一部分。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天前，有一個蠅頭小利的帖子說Alteryx是一個買點，我決定做一下\n一些DD。我已經想了一段時間了，在寫這篇文章的時候，我擁有AYX\n(2019年買入約70美元)，似乎這隻股票不會有錯，因爲它\n在2020年中期爆炸到ATHs（約178美元）。然而，它目前...",
      "title": "我的Alteryx(AYX)DD：這不是一個可以買入的低點，這是他們長期下跌的一部分。"
    }
  ],
  "title": "My Alteryx (AYX) DD: This isn't a dip to buy, it's part of their long decline.",
  "created_utc": 1619221915,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After a fly-by-night post a few days ago said Alteryx was a buy, I decided to do some DD. I&#39;ve wanted to for awhile, at the time of this writing I owned AYX (buying ~$70 back in 2019) and it seemed like the stock could do no wrong as it exploded to ATHs (~$178) in Mid-2020. However, it&#39;s currently trading at $84 and the question is, is this a dip worth buying or is it finally time to cut off my AYX position? Personally, I&#39;ve disliked the product when I&#39;ve seen it and dislike their lack of R&amp;D. When they become &quot;old&quot; feeling, I don&#39;t think they&#39;ll survive. I think they may already be at that point. Also, I heard a rumor but don&#39;t want to make it seem bigger than it is so I&#39;ll be adding some hypotheticals below.</p>\n\n<p><strong>Disclaimer:</strong> After doing this research I no longer hold any position in AYX.</p>\n\n<p><strong>R/Investing TLDR:</strong> I&#39;ve already sold my AYX shares</p>\n\n<p><strong>R/WSB Risky TLDR:</strong> and will take a short position (buying puts for post earnings and after next quarter&#39;s earnings)</p>\n\n<p>Most of my numbers come from <a href=\"https://investor.alteryx.com/financials/sec-filings/default.aspx\">their most recent 10-K</a>.</p>\n\n<p><strong>Bull case:</strong></p>\n\n<p>AYX is growing. Their &quot;dollar based net expansion&quot; rate is above 100% at 122%, which fits comfortably around <a href=\"https://softwareequity.com/the-impact-of-net-retention-on-valuation-for-public-saas-companies/\">the Docusign/Cloudflare zone</a>. Not bad.  However, this metric has been shrinking for 2 years now and if anything, it shows they don&#39;t know how to improve this metric any longer. They&#39;ve dropped 1-2% per quarter every quarter for 2 whole years. Because they do trailing 4 quarters, it&#39;s actually lower than 122% right this moment but we don&#39;t know exactly how much.</p>\n\n<p>They have nice case studies. They have grown customers up to 7083 customers, and revenue to $495.3M (+18.5%). Guidance for ARR is $555-565M for this year. Their margins are awesome at 91%.</p>\n\n<p><strong>Bear case:</strong></p>\n\n<p>The co-founder stepped down to <a href=\"https://www.nasdaq.com/articles/alteryx-ayx-appoints-new-ceo-raises-q3-top-line-outlook-2020-10-06\">bring on a new CEO</a>. This is typically something you&#39;d do when your company was at a new stage of it&#39;s life. That stage is sometimes &quot;fuck R&amp;D, just increase sales/marketing and get this to as many companies as possible.&quot; I think that&#39;s where we are, and I&#39;ll show it below.</p>\n\n<p>Additionally, the new CEO had to <a href=\"https://seekingalpha.com/news/3664513-alteryx-shares-drop-after-chief-revenue-officer-resigns\">instantly fire the CRO for offensive tweets</a>.</p>\n\n<p>Now I&#39;m going to get into the real meat. What started this whole thing? The rumor I heard is that some larger companies aren&#39;t interested in renewing anymore, and I think we&#39;ve seen that already in the numbers. I&#39;ll do some analysis below but the main question is: do you think this is a huge signal that other companies are starting to drop AYX, or is this just a temporary blip and the new CEO is going to come up with new valuable solutions? Based on the middling CEO above, and the lack of R&amp;D that I&#39;ll highlight below, my thought is AYX is going to have trouble retaining customers moving forward.</p>\n\n<p>The strategy straight from their 10k is:</p>\n\n<ul>\n<li>&quot;to increase our current customer base of approximately 7,100 customers through an active “land and expand” strategy.&quot; Cool, but that means they need to both land AND keep in order to expand.</li>\n</ul>\n\n<p>Their revenue is growing, but if you look at their subscription revenue only, it&#39;s only growing by 3%, compared to their other services growing 37%. That means most of their revenue growth isn&#39;t new contracts or customers or even added users within contracts, it&#39;s added services. These services have an 85% margin so I expect their 91% margins to start to drop. I&#39;m much more concerned with their actual growth looking to be closer to 3% in subscription revenue. That 3% number has been <strong>dropping</strong> every year!</p>\n\n<ul>\n<li><p>&quot;We plan to expand our online and offline marketing efforts to increase demand for our platform and awareness of our brand. We also plan to continue to invest in growing both our direct sales teams and indirect sales channels.&quot; Boo. I don&#39;t think they&#39;re to that point as a company yet, yet their numbers show that they are definitely spending most of their money on marketing/sales. Currently, 51% of their expenses are spent on marketing. In fact, R&amp;D has been the smallest part of their expenses every year since they went public. That doesn&#39;t make sense to me. This is a personal feeling but it feels like they&#39;re not continuing to develop what customers may need in the future.</p></li>\n<li><p>&quot;with  an increased  focus  on Global  2000 companies&quot; Here&#39;s the big one. In their 10k they specify that they have ~750 of the top 2000 companies, and that this is their strategy going forward. What if those big customers start to drop off?</p></li>\n</ul>\n\n<p>If my thesis is true that big companies don&#39;t quite jive with AYX and may start leaving or shrinking their contracts, this could be really bad for AYX especially since it&#39;s their top focus.</p>\n\n<p>AYX charges $5195/user/year for designers and $2100/user/year for others. The average contract value is hard to pinpoint, but we can look through the years at a few analyses and one of my own. From the S1 in 2017, <a href=\"https://medium.com/@alexfclayton/alteryx-s-1-breakdown-4a711683f6c\">an analyst</a> stated that annual contract value was $40.7K. In 2019, <a href=\"https://www.forbes.com/sites/robertdefrancesco/2019/04/24/alteryx-empowers-customers-to-turn-data-into-actionable-insights/?sh=2951aedd4690\">another analyst</a> said a typical new customer comes in at an average deal size of $10,000-$11,000.  If we just divide revenue by customers we get $70k/customer.  However, larger customers are obviously larger since they pay per user. In 2020, <a href=\"https://www.fool.com/investing/2020/06/29/why-alteryx-focusing-large-companies-fuel-growth.aspx\">another analyst</a> said that 33% of their revenue is from the Global 2000, so using the 750 number from their 10k that gets us to $220k/customer.</p>\n\n<p>However this quote gives us a better baseline for a top customer of AYX: &quot;Last year, the number of customers with annual recurring revenue (ARR) of more than $1 million more than doubled, while the number of transactions worth more than $500,000 tripled.&quot; The biggest customers are probably worth at least $1M if not more.</p>\n\n<p>Finally though, what if one of the really really big customers leave (going back to my rumor)? Someone with multiple teams adding up to 1000 analysts? Using the S1 link above, at the time they stated &quot;no customer had <strong>more than</strong> 10% of their total revenue.&quot; That probably means that at least one customer <strong>DID</strong> have up to 10% of their total revenue. If that&#39;s the case, that huge contract could have been worth <strong>$3.7M</strong> based on revenue at that time (years ago), and it could be worth more now.</p>\n\n<p>I want to check that figure: Let&#39;s say a major company has ~14k corporate workers, maybe 10% of them max would be analysts or desire access to those tools. Some of them would be normal users while some would be design users. Using some rough assumptions, 9% * 14k * $2100 + 1% * 14k * $5195 would be around $3.3M.  I think the $3.7M ARR figure is at least reasonable for a large customer.</p>\n\n<p>Finally, the average contract length is 2 years for an AYX customer. A lot of the big companies are coming up on contract renewal decisions. One point against this is: I&#39;ve searched major companies job postings with &quot;Alteryx&quot; in the description, and a lot of them still exist.</p>\n\n<p><strong>Bottom line:</strong> what would happen if a large, $3.7M ARR contract left AYX tomorrow? Not that much by itself.</p>\n\n<p>But, if you believe it&#39;s a signal for other large companies to do the same, and you don&#39;t think they have enough new customer revenue (maybe ~3% and dropping each year?) to make up for it, and their expansion/service revenue is higher cost/lower margin, and their R&amp;D won&#39;t save them because they haven&#39;t focused on it enough, then this is bad for AYX.</p>\n\n<p>If you think it&#39;s just one company and doesn&#39;t matter because its a rumor, then this is your time to buy.</p>\n\n<p>I think it&#39;s a signal that things are about to get worse for AYX and I&#39;ve already sold my shares.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/investing/comments/mx1aby/my_alteryx_ayx_dd_this_isnt_a_dip_to_buy_its_part/",
  "subreddit": "investing",
  "id": "mx1aby",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214679
}