{
  "author": "auriegvrd",
  "the_new_excerpt": "There is tons of advice floating around out there about how to pick stocks. I'm\nnot interested in what website X or newsletter Y will tell me. What I'm curious\nabout is how do you, personally, do your due diligence when picking stocks?\n\n * What is most and least important to you when looking (ex:…",
  "original_created_utc": 1612940743,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关于如何选股，有大量的建议流传出来。我是\n对X网站或Y通讯会告诉我什么不感兴趣。我好奇的是\n关于是你个人在选股的时候，如何做尽职调查？\n\n * 什么是最重要和最不重要的，你看时（如：...",
      "title": "选股时的尽职调查（DD）。选股时如何做你的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於如何選股，有大量的建議流傳出來。我是\n對X網站或Y通訊會告訴我什麼不感興趣。我好奇的是\n關於是你個人在選股的時候，如何做盡職調查？\n\n * 什麼是最重要和最不重要的，你看時（如：...",
      "title": "選股時的盡職調查（DD）。選股時如何做你的？"
    }
  ],
  "title": "Due Diligence (DD) when picking stocks: How do you do yours when picking stocks?",
  "created_utc": 1612990559,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is tons of advice floating around out there about how to pick stocks.  I&#39;m not interested in what website X or newsletter Y will tell me.  What I&#39;m curious about is how do you, <strong>personally</strong>, do your due diligence when picking stocks?</p>\n\n<ul>\n<li>What is most and least important to you when looking (ex: price to earnings ratio, how diversified you currently are, does it pay a dividend, etc.)?</li>\n<li>Do you have any personal red or yellow flags that make you reconsider a stock (especially if it&#39;s a &quot;it&#39;s just my personal rule&quot; thing)?</li>\n<li>Is there any stock you consider so great that it will make you break another rule you have?</li>\n<li>Is there any traditional investing advice that you personally buck when selecting investments, stocks, or otherwise?</li>\n</ul>\n\n<p>Thank you for any and all perspectives.</p>\n</div><!-- SC_ON -->",
  "score": 38,
  "permalink": "/r/stocks/comments/lgo897/due_diligence_dd_when_picking_stocks_how_do_you/",
  "subreddit": "stocks",
  "id": "lgo897",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204960
}