{
  "author": "Cpt_Daryl",
  "original_created_utc": 1640332152,
  "title": "What coin has been your biggest letdown for this year?",
  "created_utc": 1640356376,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As 2021 is coming to an end, what coin or coins have been a total let down for you? &lt;/p&gt;\n\n&lt;p&gt;Everyone is asking what are your go to coin in 2022 but I want to know the coin that you have invested in but has been a disappointment. &lt;/p&gt;\n\n&lt;p&gt;Speaking for myself I would have to say ADA. Fantastic project all round, the $3 all time high, the hype around the Alonzo launch but in the end (for now), the price and the dapps are not that convincing. Annnnd I didn’t take any profits when it hit $3 so that one is on me.&lt;/p&gt;\n\n&lt;p&gt;What about you guys?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/rnhb4c/what_coin_has_been_your_biggest_letdown_for_this/",
  "subreddit": "CryptoCurrency",
  "id": "rnhb4c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As 2021 is coming to an end, what coin or coins have been a total let down for\nyou?\n\nEveryone is asking what are your go to coin in 2022 but I want to know the coin\nthat you have invested in but has been a disappointment.\n\nSpeaking for myself I would have to say ADA. Fantastic project all round,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年が終わろうとしている今、あなたにとって期待を裏切られたコインは何ですか？\nあなたはどうですか？\n\nみんな2022年に行くコインは何かと聞いてきますが、私はそのコインを知りたいのです。\n投資したけれども期待はずれだったというものはありますか？\n\n私自身のことを言えば、ADAと言わざるを得ないでしょう。全体的に素晴らしいプロジェクトでしたが...",
      "title": "今年一番の期待はずれだったコインは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在2021年即将结束之际，哪种或哪几种钱币让你完全失望了？\n你完全失望？\n\n每个人都在问你2022年的首选硬币是什么，但我想知道的是什么硬币\n但我想知道你已经投资了但却让人失望的硬币。\n\n就我自己而言，我不得不说ADA。所有的项目都很好，...",
      "title": "什么硬币是你今年最大的遗憾？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在2021年即將結束之際，哪種或哪幾種錢幣讓你完全失望了？\n你完全失望？\n\n每個人都在問你2022年的首選硬幣是什麼，但我想知道的是什麼硬幣\n但我想知道你已經投資了但卻讓人失望的硬幣。\n\n就我自己而言，我不得不說ADA。所有的項目都很好，...",
      "title": "什麼硬幣是你今年最大的遺憾？"
    }
  ]
}