{
  "author": "alleeele",
  "original_created_utc": 1653901375,
  "title": "What was the extent of Dutch collaboration with the Nazis? How did the Dutch resistance compare to the resistance in other countries? Lastly, how were Dutch Jews received when they returned following the war?",
  "created_utc": 1653931370,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a Jewish exchange student in the Netherlands, and I have become very curious about the Dutch narrative of the Holocaust/WWII.  My experience during the lead-up to Memorial Day and Liberation Day was that there was a lot of focus on Dutch resistance, and no mention of collaboration.  The Dutch narrative appears to be one of pride due to the very active resistance forces in the region.  I have visited multiple museums and taken tours in many cities, and this has always been the focus.   Throughout all this, my question has become--then why were 90% of the Dutch Jews murdered?&lt;/p&gt;\n\n&lt;p&gt;However, recently I went on a tour through Amsterdam with a very passionate tour guide who, for the first time, asserted that collaboration between Dutch police in Amsterdam and the Nazis was extremely high, and that this was the reason for the disappearance of the Dutch Jews, and that Dutch people don&amp;#39;t like to discuss this aspect of Dutch history.  I found this very interesting, as the Jewish Museum in Amsterdam had presented a narrative of coexistence and prosperity until the Nazis came along.  So, I guess I&amp;#39;m asking; &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Is this narrative true?  Were the Netherlands truly a better place to be Jewish than most of the world?  Were Jews as assimilated as I have been told?&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;Is the Dutch pride in resistance and WWII tolerance a &amp;#39;whitewashing&amp;#39; narrative or one that reflects a reality in which the Dutch had less collaboration with the Nazis and greater resistance efforts than most of Europe?  What I mean by collaboration is on the more local level, individuals acting out of hatred.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;What happened to the surviving Dutch Jews?  Were there any instances of anger or violence such as the Kielce pogrom in Poland?  Did they remain in refugee camps?  After that, where did they go?&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;As a bonus question: how do the Dutch remember the Jews?&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Thanks in advance!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/v0w14o/what_was_the_extent_of_dutch_collaboration_with/",
  "subreddit": "AskHistorians",
  "id": "v0w14o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a Jewish exchange student in the Netherlands, and I have become very\ncurious about the Dutch narrative of the Holocaust/WWII. My experience during\nthe lead-up to Memorial Day and Liberation Day was that there was a lot of focus\non Dutch resistance, and no mention of collaboration. The Dutch…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はオランダでユダヤ人の交換留学生をしていますが、オランダのホロコーストと第二次世界大戦の物語にとても興味を持つようになりました。\nオランダのホロコーストと第二次世界大戦に関する物語に興味を持つようになりました。私の経験では\nオランダのレジスタンスに焦点が当てられ、協力関係については全く触れられませんでした。\nオランダの抵抗に焦点が当てられていて、協力については全く触れられていませんでした。オランダは...",
      "title": "オランダのナチスへの協力はどの程度だったのでしょうか。オランダのレジスタンスは他国のレジスタンスと比較してどうだったのか。最後に、オランダのユダヤ人は戦後帰国したとき、どのように迎えられたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名在荷兰的犹太交换生，我对荷兰人关于大屠杀/二战的叙述感到非常好奇。\n我对荷兰人关于大屠杀/二战的叙述感到非常好奇。我的经历是在\n在纪念日和解放日之前，我的经验是，有很多人都在关注荷兰的抵抗，而没有提到合作。\n荷兰人的抵抗，而没有提到合作。荷兰人...",
      "title": "荷兰与纳粹合作的程度如何？荷兰的抵抗运动与其他国家的抵抗运动相比如何？最后，荷兰犹太人在战后回国时是如何被接待的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名在荷蘭的猶太交換生，我對荷蘭人關於大屠殺/二戰的敘述感到非常好奇。\n我對荷蘭人關於大屠殺/二戰的敘述感到非常好奇。我的經歷是在\n在紀念日和解放日之前，我的經驗是，有很多人都在關注荷蘭的抵抗，而沒有提到合作。\n荷蘭人的抵抗，而沒有提到合作。荷蘭人...",
      "title": "荷蘭與納粹合作的程度如何？荷蘭的抵抗運動與其他國家的抵抗運動相比如何？最後，荷蘭猶太人在戰後回國時是如何被接待的？"
    }
  ]
}