{
  "author": "vvb777",
  "original_created_utc": 1637246592,
  "title": "What was your stupidest assumption about crypto ?",
  "created_utc": 1637253519,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly before I got into crypto I laughed at it and always thought it was fake internet money. However as time passed my friends kept talking about it and were investing a lot into it and that peaked my interest in it but yet again I was not able to invest in it because I was broke and couldn&#39;t afford to buy a Bitcoin in 2017.</p>\n\n<p>I honestly always thought that you needed to buy an entire bitcoin and never thought that you would be able to buy a fraction of a bitcoin. This was one of the stupidest assumptions I ever made and accepted it as a fact without doing my research. That has been one of my biggest regret to date.. </p>\n\n<p>What was your stupidest assumption about crypto?</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/qwr867/what_was_your_stupidest_assumption_about_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qwr867",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Honestly before I got into crypto I laughed at it and always thought it was fake\ninternet money. However as time passed my friends kept talking about it and were\ninvesting a lot into it and that peaked my interest in it but yet again I was\nnot able to invest in it because I was broke and couldn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、暗号の世界に入る前はそれを笑っていたし、いつも偽物だと思っていた。\nネットマネーだと思っていました。しかし、時間が経つにつれ、友人たちがこの話をしていて、多くの投資をしていました。\n投資をしていたので、私も興味を持ちました。\nしかし、私はお金がなくて投資できませんでした...",
      "title": "暗号についての最も愚かな仮定は何でしたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，在我进入加密货币领域之前，我对它嗤之以鼻，一直认为它是假的\n网络货币。然而，随着时间的推移，我的朋友们一直在谈论它，并对它进行了大量投资。\n这使我对它的兴趣达到了顶峰，但我还是没能投资它，因为我已经破产了。\n但我还是没能投资它，因为我已经破产了，没办法...",
      "title": "你对加密货币最愚蠢的假设是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，在我進入加密貨幣領域之前，我對它嗤之以鼻，一直認爲它是假的\n網絡貨幣。然而，隨着時間的推移，我的朋友們一直在談論它，並對它進行了大量投資。\n這使我對它的興趣達到了頂峯，但我還是沒能投資它，因爲我已經破產了。\n但我還是沒能投資它，因爲我已經破產了，沒辦法...",
      "title": "你對加密貨幣最愚蠢的假設是什麼？"
    }
  ]
}