{
  "author": "LordSaumya",
  "original_created_utc": 1628476672,
  "title": "Why do conservative positions (on average) tend to be more anti-science?",
  "created_utc": 1628504225,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most conservatives I’ve met or listened to are anti-vaccination (in general, not necessarily covid vaccines), anti-mask, don’t believe in climate change, etcetera. All of these positions pertain to actual scientific facts, and scientific studies have consistently shown that vaccination and masks are helpful, anthropogenic climate change is real, etcetera. Why do conservatives still stick to their positions?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/p0skb8/why_do_conservative_positions_on_average_tend_to/",
  "subreddit": "NoStupidQuestions",
  "id": "p0skb8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Most conservatives I’ve met or listened to are anti-vaccination (in general, not\nnecessarily covid vaccines), anti-mask, don’t believe in climate change,\netcetera. All of these positions pertain to actual scientific facts, and\nscientific studies have consistently shown that vaccination and masks…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が会ったり、話を聞いたりした保守派の多くは、ワクチン接種反対（一般的なもので、必ずしもワクチンが必要というわけではありません。\n反ワクチン（一般的なもので、コビドワクチンとは限りません）、反マスク、気候変動を信じない。\nなどなど。これらの立場はすべて、実際の科学的事実に関連しています。\n科学的な研究では、予防接種やマスクは一貫して...",
      "title": "なぜ保守的な立場の人は（平均的に）反科学的な傾向があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我见过的或听过的大多数保守派人士都反对接种疫苗（一般来说，不一定要接种混合疫苗），反对戴口罩，不相信气候变化，也不相信有什么好办法。\n反面具，不相信气候变化。\n等等。所有这些立场都与实际的科学事实有关，而\n科学研究一直表明，接种疫苗和口罩...",
      "title": "为什么保守派的立场（平均而言）更倾向于反科学？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我見過的或聽過的大多數保守派人士都反對接種疫苗（一般來說，不一定要接種混合疫苗），反對戴口罩，不相信氣候變化，也不相信有什麼好辦法。\n反面具，不相信氣候變化。\n等等。所有這些立場都與實際的科學事實有關，而\n科學研究一直表明，接種疫苗和口罩...",
      "title": "爲什麼保守派的立場（平均而言）更傾向於反科學？"
    }
  ]
}