{
  "author": "giddyup281",
  "original_created_utc": 1635406333,
  "title": "OK, let's see what else does this sub NOT recommend?",
  "created_utc": 1635417466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I can buy a metric shitload of it. And finally make bank.</p>\n\n<p>I mean, this is insane. Sub says sell BNB, bcs Binance sucks and BNB is centralized, which the sub does not want. BNB pumps. Sub recommends SOL, I buy SOL, it dumps bcs of a bug and SOL team halts the entire blockchain. Sub says this is centralized coin, not good, sell SOL, I sell. It pumps. Sub says buy QNT, I buy QNT, it dumps. Sub says buy ERG, I buy ERG, it dumps.</p>\n\n<p>I make some money on a dog named coin (got in on second day of it pumping 50-60% a day), make a small profit. Sub says sell it, I sell it. At 0.000025. It pumps 300% in a freakin&#39; week (from the day I sold), while everything else is dropping like crazy.</p>\n\n<p>So, let&#39;s make some money now. I&#39;m betting against this sub.</p>\n\n<p>Best two answers get $50 each. betting on the opposite outcome, of course.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Edit</strong>: I was initially joking but now I feel I can&#39;t let you down. $100 is only around 8% of the average monthly salary where I&#39;m from (on a sidenote, I live in a shithole). F it, let&#39;s do this.</p>\n\n<p>So, from the looks of it so far (sorting by Top), I should:</p>\n\n<p>- <strong>go long on ICP</strong> (looks like I have to sign up on FTX to leverage ICP so if anyone knows if this is a trusted (and only) exchange, let me know)</p>\n\n<p>- Buy Bitconnect (the closest thing is Bitconnect genesis which is not listed anywhere so I&#39;m afraid I can&#39;t buy it)</p>\n\n<p>- give people moons (not actually a trading advice, but hey, I help a fellow <a href=\"/r/cc\">r/cc</a> member when I can, so I tipped a few people, who wants to continue the tip train, feel free to find someone without moons and tip them)</p>\n\n<p>- <strong>Buy Doge</strong></p>\n\n<p>Will give it some more time for our NA friends to join in on the fun. Will make an update (with proof) when I see the final tally</p>\n</div><!-- SC_ON -->",
  "score": 244,
  "permalink": "/r/CryptoCurrency/comments/qhhleg/ok_lets_see_what_else_does_this_sub_not_recommend/",
  "subreddit": "CryptoCurrency",
  "id": "qhhleg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I can buy a metric shitload of it. And finally make bank.\n\nI mean, this is insane. Sub says sell BNB, bcs Binance sucks and BNB is\ncentralized, which the sub does not want. BNB pumps. Sub recommends SOL, I buy\nSOL, it dumps bcs of a bug and SOL team halts the entire blockchain. Sub says\nthis is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、大量に買うことができる。そしてついに銀行を設立しました。\n\nつまり、これは正気の沙汰ではありません。サブはBNBを売れと言っています。なぜなら、Binanceは最低だし、BNBは中央集権的だからです。\nBNBは中央集権的で、サブはそれを望んでいません。BNBが売られる。サブがSOLを勧めるので、買う。\nSOL、バグでダンピングされ、SOLチームがブロックチェーン全体を停止させる。サブが言う。\nこれは...",
      "title": "では、このサブ機が推奨していない他の製品を見てみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这样我就可以买一大堆了。并最终赚到钱。\n\n我是说，这太疯狂了。子公司说卖掉BNB，因为Binance很烂，而且BNB是集中式的。\n中心化，这是该机构不希望看到的。BNB抽水。子公司推荐SOL，我买了\nSOL，它因为一个bug而跳出，SOL团队停止了整个区块链。子公司说\n这就是...",
      "title": "好吧，让我们看看这个子不推荐的还有什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這樣我就可以買一大堆了。並最終賺到錢。\n\n我是說，這太瘋狂了。子公司說賣掉BNB，因爲Binance很爛，而且BNB是集中式的。\n中心化，這是該機構不希望看到的。BNB抽水。子公司推薦SOL，我買了\nSOL，它因爲一個bug而跳出，SOL團隊停止了整個區塊鏈。子公司說\n這就是...",
      "title": "好吧，讓我們看看這個子不推薦的還有什麼？"
    }
  ]
}