{
  "author": "laidlyworm",
  "original_created_utc": 1628161569,
  "title": "How common was organized crime in the medieval period and the ancient world?",
  "created_utc": 1628173955,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been thinking about how organized crime played a big part in the 20th century, and from what I can tell at least some of the 19th century. I’m wondering- how far back does this go?</p>\n\n<p>Things like organized protection rackets, smuggling and bootlegging, murder for hire services (for purposes pettier than political assassination), etc. I’m aware ancient Rome had a “””fire department””” that was basically an arson protection racket, but I can’t find much more info on that sort of thing.</p>\n</div><!-- SC_ON -->",
  "score": 269,
  "permalink": "/r/AskHistorians/comments/oyf9z9/how_common_was_organized_crime_in_the_medieval/",
  "subreddit": "AskHistorians",
  "id": "oyf9z9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been thinking about how organized crime played a big part in the 20th\ncentury, and from what I can tell at least some of the 19th century. I’m\nwondering- how far back does this go?\n\nThings like organized protection rackets, smuggling and bootlegging, murder for\nhire services (for purposes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、20世紀に組織犯罪がいかに大きな役割を果たしたかについて考えてきました。\n世紀、そして少なくとも19世紀の一部において、組織犯罪がいかに大きな役割を果たしていたかを考えています。私は\n疑問に思うのは、これはどのくらい前から続いているのかということです。\n\n組織化された保護ラケット、密輸や密造、雇われ殺人などです。\n雇われサービス（目的は...",
      "title": "中世や古代の世界では、組織犯罪はどのように行われていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在思考有组织犯罪是如何在20世纪发挥重要作用的。\n我一直在思考有组织犯罪是如何在20世纪发挥巨大作用的，而且据我所知，至少在19世纪也是如此。我在想\n我想知道--这可以追溯到多远？\n\n像有组织的保护伞、走私和私酒、雇佣谋杀（为了......）等事情。\n雇佣服务（为了...",
      "title": "在中世纪时期和古代世界，有组织犯罪有多普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在思考有組織犯罪是如何在20世紀發揮重要作用的。\n我一直在思考有組織犯罪是如何在20世紀發揮巨大作用的，而且據我所知，至少在19世紀也是如此。我在想\n我想知道--這可以追溯到多遠？\n\n像有組織的保護傘、走私和私酒、僱傭謀殺（爲了......）等事情。\n僱傭服務（爲了...",
      "title": "在中世紀時期和古代世界，有組織犯罪有多普遍？"
    }
  ]
}