{
  "author": "SaboKunn",
  "original_created_utc": 1637469488,
  "title": "Indian Government is planning to legalize Crypto Currencies in the country, What is gonna happen after that?",
  "created_utc": 1637498180,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is gonna be big in the crypto community. In the upcoming parliamentary session, World&#39;s second largest nation in the world is gonna legalize crypto in it&#39;s country very soon. This would mean that this is a really big news for crypto. Till now, Indians faced really bad experience with respect to buying crypto. The exchanges in India were abandoned by many payment partners and banks due to RBI&#39;s instructions, that they should not work with crypto companies. When we want to buy some crypto through exchaneges, we couldn&#39;t deposit money inside the exchange wallet, as banks are not supporting them. Still now this is the same situation, we&#39;re currently using a third party app to deposit fiat in exchange wallets. So, cheers this is all going to change soon. And fellow members in this community, there are currently more than 10M crypto investers from India, imagine huge influx of investments coming in the coming days, I&#39;m sure of this we&#39;re going to the moon really soon. And bullish on polygon if you know what I mean.:)</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/qyn7bi/indian_government_is_planning_to_legalize_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qyn7bi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is gonna be big in the crypto community. In the upcoming parliamentary\nsession, World's second largest nation in the world is gonna legalize crypto in\nit's country very soon. This would mean that this is a really big news for\ncrypto. Till now, Indians faced really bad experience with respect to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、暗号コミュニティにおいて大きな意味を持ちます。今度の国会で\n今度の国会で、世界第2位の大国が、自国での暗号をすぐに合法化するだろう。\n近いうちに合法化されるでしょう。これは、暗号にとって本当に大きなニュースであることを意味します。\n暗号にとっては本当に大きなニュースです。これまで、インド人は、暗号化に関して本当に悪い経験をしてきました。",
      "title": "インド政府は国内での暗号通貨の合法化を計画していますが、その後はどうなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这将是加密货币社区的大事。在即将举行的议会会议上\n会议上，世界上第二大国家将很快使加密货币在其国内合法化。\n它的国家很快就会合法化。这意味着这是一个真正的大新闻，对\n加密货币。到目前为止，印度人面临着非常糟糕的经验。",
      "title": "印度政府正计划将加密货币在该国合法化，之后会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這將是加密貨幣社區的大事。在即將舉行的議會會議上\n會議上，世界上第二大國家將很快使加密貨幣在其國內合法化。\n它的國家很快就會合法化。這意味着這是一個真正的大新聞，對\n加密貨幣。到目前爲止，印度人面臨着非常糟糕的經驗。",
      "title": "印度政府正計劃將加密貨幣在該國合法化，之後會發生什麼？"
    }
  ]
}