{
  "author": "Smol-Zookeeper",
  "original_created_utc": 1638966536,
  "title": "Do you hide your crypto from your partner?",
  "created_utc": 1638988581,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m thinking about just hiding my crypto from literally everyone. &lt;/p&gt;\n\n&lt;p&gt;But has crypto caused any issues for anyone in a relationship?&lt;/p&gt;\n\n&lt;p&gt;If you did hide your crypto in a serious relationship, how did you hide it?&lt;/p&gt;\n\n&lt;p&gt;If you transferred fiat into crypto wouldn’t your partner know from bank statements or something?&lt;/p&gt;\n\n&lt;p&gt;Do you even let your partners see your finances?&lt;/p&gt;\n\n&lt;p&gt;I know I wouldn’t let a random person see, but a serious partner, I would. I don’t want to hide that.&lt;/p&gt;\n\n&lt;p&gt;Crypto makes me feel like I need to hide it though, idk why, it’s just like the nature of the beast.&lt;/p&gt;\n\n&lt;p&gt;Also as a last tidbit which wallet is best for all types of coins, I was thinking about using omniwallet. &lt;/p&gt;\n\n&lt;p&gt;Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/rbqa91/do_you_hide_your_crypto_from_your_partner/",
  "subreddit": "CryptoCurrency",
  "id": "rbqa91",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m thinking about just hiding my crypto from literally everyone.\n\nBut has crypto caused any issues for anyone in a relationship?\n\nIf you did hide your crypto in a serious relationship, how did you hide it?\n\nIf you transferred fiat into crypto wouldn’t your partner know from bank\nstatements or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号を文字通り誰からも隠そうと考えています。\n\nしかし、クリプトは人間関係で何か問題を引き起こしたことがありますか？\n\nもし、真剣な交際の中で暗号を隠したとしたら、どのように隠しましたか？\n\nフィアットからクリプトに移行した場合、パートナーは銀行から知ることができないのでしょうか？\n明細書や...",
      "title": "パートナーに自分の暗号を隠していますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在考虑将我的加密货币藏起来，不让任何人看到。\n\n但是，在一段关系中，\"加密 \"有没有给任何人带来任何问题？\n\n如果你在一段严肃的关系中隐藏了你的加密货币，你是如何隐藏它的？\n\n如果你把法币转成了加密货币，你的伴侣难道不会从银行报表或...\n账单或...",
      "title": "你是否对你的伴侣隐藏你的加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在考慮將我的加密貨幣藏起來，不讓任何人看到。\n\n但是，在一段關係中，\"加密 \"有沒有給任何人帶來任何問題？\n\n如果你在一段嚴肅的關係中隱藏了你的加密貨幣，你是如何隱藏它的？\n\n如果你把法幣轉成了加密貨幣，你的伴侶難道不會從銀行報表或...\n賬單或...",
      "title": "你是否對你的伴侶隱藏你的加密貨幣？"
    }
  ]
}