{
  "author": "el_timinou",
  "original_created_utc": 1630954670,
  "title": "I did LSD and became a Maximalist. I'm selling all my altcoins for more Bitcoin",
  "created_utc": 1630968001,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everything is clear to me since.</p>\n\n<p>It seems obvious now that DeFi is a bubble. Everyone is trying to lure you away from Bitcoin with exceptional return rates, it feels so shady (I&#39;m not naming any specific altcoin here, but you can all guess it). </p>\n\n<p>Proof of stake make no sense. A currency itself doesn&#39;t need to give interest. I was feeling forced to stake to get interest or else I will get punished with inflation. So everyone are locking their coins in custodial exchanges so they can stake for them. Cryptocurrencies on exchanges can&#39;t work! It can get cornered by governments and even shutdown. </p>\n\n<p>Their systems is flawed and a messy catchall. The systemic risk in the ecosystem is insane and poorly reflected in the price. There is so much things that can turn out wrong and it can burst at anytime.</p>\n\n<p>DeFi is cool sure, but altcoins are at best testnets for the Bitcoin second layer. Everything of value that altcoins offer can and will be built on top of Bitcoin. Cryptocurrencies are not tech stocks!</p>\n\n<p>Bitcoin itself just need to be secure, private and decentralized. Keep it simple! It makes much more sense that institutions and decentralized projects will use the Bitcoin infrastructure. Thus, making altcoins completely obsolete.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/Bitcoin/comments/pj5xrq/i_did_lsd_and_became_a_maximalist_im_selling_all/",
  "subreddit": "Bitcoin",
  "id": "pj5xrq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everything is clear to me since.\n\nIt seems obvious now that DeFi is a bubble. Everyone is trying to lure you away\nfrom Bitcoin with exceptional return rates, it feels so shady (I'm not naming\nany specific altcoin here, but you can all guess it). \n\nProof of stake make no sense. A currency itself…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それ以来、すべてがクリアになりました。\n\nDeFiがバブルであることは、今では明らかなようです。誰もが例外的な還元率であなたをビットコインから誘い出そうとしています。\n抜群の還元率でビットコインから誘い出そうとしていて、とても怪しい感じがします。\nここで特定のアルトコインを挙げているわけではありませんが、皆さんは想像できるでしょう）。) \n\nProof of stakeは意味がない。通貨そのもの...",
      "title": "LSDをやってマキシマリストになった。私はすべてのアルトコインを売って、より多くのビットコインを手に入れます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "此后，一切都很清楚了。\n\n现在看来很明显，DeFi是一个泡沫。每个人都在试图引诱你离开\n用特殊的回报率来引诱你离开比特币，这让人感觉很不舒服（我在这里没有点名\n任何具体的altcoin，但你们都可以猜到）。) \n\n股权证明没有意义。一个货币本身...",
      "title": "我做了LSD，成为一名Maximalist。我卖掉我所有的altcoins以换取更多的Bitcoin"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "此後，一切都很清楚了。\n\n現在看來很明顯，DeFi是一個泡沫。每個人都在試圖引誘你離開\n用特殊的回報率來引誘你離開比特幣，這讓人感覺很不舒服（我在這裏沒有點名\n任何具體的altcoin，但你們都可以猜到）。) \n\n股權證明沒有意義。一個貨幣本身...",
      "title": "我做了LSD，成爲一名Maximalist。我賣掉我所有的altcoins以換取更多的Bitcoin"
    }
  ]
}