{
  "author": "gigabyteIO",
  "original_created_utc": 1637261887,
  "title": "Algorand once again trading inverse to the rest of the market with 4B+ trade volume.",
  "created_utc": 1637278347,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Algorand has over 4 Billion trade volume in the last 24 hours. Last night a huge whale bought into Algorand, causing the price to spike to $2.82 on coinbase. It seems like it&#39;s not slowing down either. There are rumors that Brazil will be building their CBDC on top of Algorand so there is much speculation that Brazilian whales are the cause of this. But who really knows? There is so much going on with Algorand it could be many different things. Algorand is currently in talks with 16 different countries about their CBDC&#39;s and supposedly something may be announced at Algorand&#39;s Miami Decipher event at the end of this month.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5fr7c603ie081.png?width=1044&amp;format=png&amp;auto=webp&amp;s=dbc4feac4df69e7c6f1a7b75c4be275498de3880\">Algorand trading inversely to the market AGAIN, this has happened multiple times in the last month.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qgc2ndw7ie081.png?width=1012&amp;format=png&amp;auto=webp&amp;s=e6512af5d232e086bdd7baa3dbcd7ed80f3d6568\">4 Billion in trade volume and it doesn&#39;t seem to be slowing down.</a></p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;m getting the feeling Algorand is breaking from the rest of the crypto market slowly but surely. This isn&#39;t a one off occurrence. It keeps happening. The huge increase in trade volume while trading green while everything else is red tells me that many rich investors are putting their eggs in the Algorand basket. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>TL;DR: Huge things coming for Algorand.</strong></p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/qwwtot/algorand_once_again_trading_inverse_to_the_rest/",
  "subreddit": "CryptoCurrency",
  "id": "qwwtot",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Algorand has over 4 Billion trade volume in the last 24 hours. Last night a huge\nwhale bought into Algorand, causing the price to spike to $2.82 on coinbase. It\nseems like it's not slowing down either. There are rumors that Brazil will be\nbuilding their CBDC on top of Algorand so there is much…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルゴランドは過去24時間で40億以上の取引量があります。昨晩、巨大な\n昨夜、巨大なクジラがAlgorandを購入し、coinbaseで2.82ドルまで価格が急上昇しました。これは\n勢いも衰えていないようだ。噂によると、ブラジルでは\nブラジルがCBDCをAlgorandの上に構築するという噂があるので、多くの...",
      "title": "アルゴランドは4B以上の取引量で再び他の市場と逆の取引をしています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Algorand在过去24小时内有超过40亿的交易量。昨天晚上，一个巨大的\n鲸鱼买入Algorand，导致其在coinbase的价格飙升至2.82美元。它\n看起来它也没有放慢脚步。有传言说，巴西将在\n在Algorand之上建立他们的CBDC，所以有很多...",
      "title": "Algorand再次与市场其他地区的交易情况相反，交易量达到40亿以上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Algorand在過去24小時內有超過40億的交易量。昨天晚上，一個巨大的\n鯨魚買入Algorand，導致其在coinbase的價格飆升至2.82美元。它\n看起來它也沒有放慢腳步。有傳言說，巴西將在\n在Algorand之上建立他們的CBDC，所以有很多...",
      "title": "Algorand再次與市場其他地區的交易情況相反，交易量達到40億以上。"
    }
  ]
}