{
  "author": "reasonableguy99",
  "original_created_utc": 1657273705,
  "title": "Isn’t non-binary more constraining than it is freeing?",
  "created_utc": 1657289967,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like the concept of non-binary is in and of itself more constraining on gender than it is freeing. If you don’t fit the “archetype” of male or female, isn’t it okay to just be a female who doesn’t subscribe to female norms? or a male or doesn’t subscribe to male norms? It feels like non-binary says if you don’t fit those archetypes you must be “different”, which i don’t really like the idea of.&lt;/p&gt;\n\n&lt;p&gt;I’m currently dating someone who is non-binary, female presenting. but they consistently dress and act female, just… less so, if that makes sense? it’s very weird to me to call them, “them”, when to me it just seems they’re a (seemingly) female who just isn’t super girly. they still wear and like “feminine” things, but maybe more of their closet is gender neutral things than not. &lt;/p&gt;\n\n&lt;p&gt;i guess i just haven’t seen much credible research into this topic. i fully understand the idea of being “trans”. male born in a female body, sure. female born in a male body, totally possible imo. but to be neither seems literally incomprehensible to me. i fully accept i may be super ignorant so if you know of a good study or something to disprove me i’m all ears. i just can’t wrap my head around it yet. i still try my best to respect them but it really makes no sense to me&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/vu6ziv/isnt_nonbinary_more_constraining_than_it_is/",
  "subreddit": "NoStupidQuestions",
  "id": "vu6ziv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel like the concept of non-binary is in and of itself more constraining on\ngender than it is freeing. If you don’t fit the “archetype” of male or female,\nisn’t it okay to just be a female who doesn’t subscribe to female norms? or a\nmale or doesn’t subscribe to male norms? It feels like non…"
}