{
  "author": "reasonableguy99",
  "original_created_utc": 1657273705,
  "title": "Isn’t non-binary more constraining than it is freeing?",
  "created_utc": 1657289967,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like the concept of non-binary is in and of itself more constraining on gender than it is freeing. If you don’t fit the “archetype” of male or female, isn’t it okay to just be a female who doesn’t subscribe to female norms? or a male or doesn’t subscribe to male norms? It feels like non-binary says if you don’t fit those archetypes you must be “different”, which i don’t really like the idea of.&lt;/p&gt;\n\n&lt;p&gt;I’m currently dating someone who is non-binary, female presenting. but they consistently dress and act female, just… less so, if that makes sense? it’s very weird to me to call them, “them”, when to me it just seems they’re a (seemingly) female who just isn’t super girly. they still wear and like “feminine” things, but maybe more of their closet is gender neutral things than not. &lt;/p&gt;\n\n&lt;p&gt;i guess i just haven’t seen much credible research into this topic. i fully understand the idea of being “trans”. male born in a female body, sure. female born in a male body, totally possible imo. but to be neither seems literally incomprehensible to me. i fully accept i may be super ignorant so if you know of a good study or something to disprove me i’m all ears. i just can’t wrap my head around it yet. i still try my best to respect them but it really makes no sense to me&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/vu6ziv/isnt_nonbinary_more_constraining_than_it_is/",
  "subreddit": "NoStupidQuestions",
  "id": "vu6ziv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel like the concept of non-binary is in and of itself more constraining on\ngender than it is freeing. If you don’t fit the “archetype” of male or female,\nisn’t it okay to just be a female who doesn’t subscribe to female norms? or a\nmale or doesn’t subscribe to male norms? It feels like non…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ノンバイナリーの概念自体が、より制約を受けるような気がするのは\nを拘束しているような気がします。男性や女性という「原型」に当てはまらないのであれば、女性の規範に従わない女性であってもいいのではないでしょうか。\n女性の規範に従わない女性であってもいいし、男性の規範に従わない男性であってもいいのではないでしょうか。\n男性であっても、男性の規範に従わなければいいのでは？それはまるで、非...",
      "title": "ノンバイナリーは自由というより、束縛されているのでは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得非二元的概念本身就对性别有更多的限制，而不是自由。\n性别的限制，而不是自由。如果你不符合男性或女性的 \"原型\"。\n做一个不符合女性标准的女性不是很好吗？\n男性或不认同男性规范的人？这感觉就像非...",
      "title": "非二元制不是更多的限制而不是自由吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得非二元的概念本身就對性別有更多的限制，而不是自由。\n性別的限制，而不是自由。如果你不符合男性或女性的 \"原型\"。\n做一個不符合女性標準的女性不是很好嗎？\n男性或不認同男性規範的人？這感覺就像非...",
      "title": "非二元制不是更多的限制而不是自由嗎？"
    }
  ]
}