{
  "author": "wloff",
  "original_created_utc": 1641577972,
  "title": "W.L.George in 1922: \"A sight of the world today would surprise President Jefferson much more, I suspect, than the world of 2022 would surprise the little girl who sells candies at Grand Central Station.\" Was he correct? Was the change from 1822 to 1922 greater than the change from 1922 to 2022?",
  "created_utc": 1641591427,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I apologize if this question is a too broad and speculative, but I found the thought interesting and hopefully someone else will too.&lt;/p&gt;\n\n&lt;p&gt;In this column from 1922, &lt;a href=\"https://www.loc.gov/resource/sn83045774/1922-05-07/ed-1?sp=87\"&gt;&amp;quot;What the World Will be Like In a Hundred Years&amp;quot;&lt;/a&gt;, English author W.L.George makes some frighteningly accurate predictions, accompanied by others that were completely wrong; as one might expect from a prediction like that.&lt;/p&gt;\n\n&lt;p&gt;But what I found most interesting was his notion that for the average person, the improvements in technology during the last hundred years had been much more life-changing than what might be expected of the next hundred.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The reader may conclude that I do not expect anything startling in the way of scientific discovery. That is not the case; I am convinced that in 2022 the advancement of science will be amazing, but it will be nothing like so amazing as is the present day in relation to a hundred years ago. A sight of the world today would surprise President Jefferson much more, I suspect, than the world of 2022 would surprise the little girl who sells candies at Grand Central Station. For Jefferson knew nothing of railroads, telegraphs, telephones, automobiles, aeroplanes, gramophones, movies, radium, &amp;amp;c.; he did not even know hot and cold bathrooms. The little girl at Grand Central is a blasé child; to her these things are commonplace; the year 2022 would have to produce something very startling to interest her ghost. The sad thing about discovery is that it works toward its own extinction, and that the more we discover the less there is left.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There have of course been amazing inventions no one could have foreseen a hundred years or even fifty years ago, the Internet probably being on top of the list; but when you compare the life of someone in 2022 to that of someone in 1922, and then someone from 1922 to 1822, in which time period has the change been greater? What technology has changed the way we live our lives the most?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/AskHistorians/comments/rydc8e/wlgeorge_in_1922_a_sight_of_the_world_today_would/",
  "subreddit": "AskHistorians",
  "id": "rydc8e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I apologize if this question is a too broad and speculative, but I found the\nthought interesting and hopefully someone else will too.\n\nIn this column from 1922, \"What the World Will be Like In a Hundred Years\"\n[https://www.loc.gov/resource/sn83045774/1922-05-07/ed-1?sp=87], English…"
}