{
  "author": "wrenruth",
  "original_created_utc": 1653332942,
  "title": "How much should we question our sexual desires?",
  "created_utc": 1653403889,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was reading this piece by Amia Srinivasan and it got me thinking about how the average person is aware of and critically engages with their own sexual desire.&lt;/p&gt;\n\n&lt;p&gt;Srinivasan’s main argument is that we have made a mistake by placing such an emphasis on consent when it comes to sex. We have positioned sex as an amoral category, reducing it to either “wanted” or “unwanted.” What this does is allow people to pursue any sexual interests as long as they are not participating in unwanted sexual interactions: rape and exploitation are bad, everything else is “just human nature.” &lt;/p&gt;\n\n&lt;p&gt;Srinivasan claims that we should interrogate the origins or manifestations of our sexual desires. And, if we don’t like what we find, then we have a duty to transfigure them, or at least attempt to do so.&lt;/p&gt;\n\n&lt;p&gt;The argument against this, I think, would be that the nature of human desire is inexplicable, that one cannot dictate what they’re attracted to. As long as it isn’t harming anyone, then the individual should not have the burden of trying to make sense of it. Politicizing and/or fighting against your inherent desires can also be destructive, as that mentality has been used to oppress and control sexualities. &lt;/p&gt;\n\n&lt;p&gt;I’m not sure where I fall between these two arguments, and I’m sure there are many more positions in-between. I can’t really think of anywhere else to post this, so I hope it’s okay to post it here because I’ve been wanting to have this discussion for awhile.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/uw7rub/how_much_should_we_question_our_sexual_desires/",
  "subreddit": "askphilosophy",
  "id": "uw7rub",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was reading this piece by Amia Srinivasan and it got me thinking about how the\naverage person is aware of and critically engages with their own sexual desire.\n\nSrinivasan’s main argument is that we have made a mistake by placing such an\nemphasis on consent when it comes to sex. We have positioned…"
}