{
  "author": "tornadofuck",
  "original_created_utc": 1630640955,
  "title": "After what distance is an orgy still considered an orgy?",
  "created_utc": 1630653727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If four couples are having sex 1 foot away from one another, its probably an orgy. </p>\n\n<p>But what if we extend the distance?</p>\n\n<p>What if the couples were 50 feet away from one another? 100? 1000??</p>\n\n<p>Is it still an orgy if these people, a football field away from each other, still switch partners and exchange sex acts? </p>\n\n<p>How far apart can an orgy <em>truly</em> occur to still be considered an orgy? </p>\n\n<p>Say I have 11 people and we all collectively agree to partake in an orgy. BUT, the problem is we all live 10 miles away from each other. If we all drive to each other’s houses in rotation having sex with one other until the sun goes down, couldn’t that technically be considered an orgy?</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/NoStupidQuestions/comments/pgxfpe/after_what_distance_is_an_orgy_still_considered/",
  "subreddit": "NoStupidQuestions",
  "id": "pgxfpe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If four couples are having sex 1 foot away from one another, its probably an\norgy.\n\nBut what if we extend the distance?\n\nWhat if the couples were 50 feet away from one another? 100? 1000??\n\nIs it still an orgy if these people, a football field away from each other,\nstill switch partners and exchange…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "4組のカップルが1フィート離れたところでセックスをしていたら、それはおそらく\n乱交パーティーです。\n\nしかし、その距離を延ばしてみたらどうでしょう？\n\nカップルが50フィート離れていたらどうでしょう？100? 1000??\n\nサッカー場1つ分の距離にいる人たちが、パートナーを入れ替えたり、交換したりしても、それは乱交なのでしょうか？\nパートナーを交換して...",
      "title": "どのくらいの距離であれば、まだ乱交と言えるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果四对夫妇在离彼此一英尺远的地方做爱，这可能是一场\n狂欢。\n\n但如果我们扩大距离呢？\n\n如果这对夫妇彼此相距50英尺呢？100? 1000??\n\n如果这些人在一个足球场之外，仍然是狂欢，那还是狂欢吗？\n仍旧交换伴侣并交换...",
      "title": "在什么距离之后，狂欢仍被认为是一种狂欢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果四對夫婦在離彼此一英尺遠的地方做愛，這可能是一場\n狂歡。\n\n但如果我們擴大距離呢？\n\n如果這對夫婦彼此相距50英尺呢？100? 1000??\n\n如果這些人在一個足球場之外，仍然是狂歡，那還是狂歡嗎？\n仍舊交換伴侶並交換...",
      "title": "在什麼距離之後，狂歡仍被認爲是一種狂歡？"
    }
  ]
}