{
  "author": "Socialinfluencing",
  "original_created_utc": 1639097979,
  "title": "Not falling for the dip of the DIP again.",
  "created_utc": 1639125483,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Seriously, I have my plans and I have my strategy. But I got blindsided by the recent dip. It dipped nicely then the market decided it wants to dip massively right after I bought what I thought was a steal. Now if we&amp;#39;re averaging down, yes I did average my % down overall, but I could have been in a much stronger position.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Whales are playing games atm, many feel this is the final leg of the bullrun and some whales understand this. On one hand if they can shake as many out before the biggest run up this year, they get monumental profits.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, if they can convince everyone the run up may still come and plunge us into a bear market then these small dips followed by a larger crash (then a green run before a rinse repeat), it can achieve the same result but just more subtle.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Anyone else feel a bit shaky, almost like you don&amp;#39;t know what to trust for the moment? I have my fiat ready but these whales are gaming hard. I won&amp;#39;t put in more than I can afford to lose but man, always remember you don&amp;#39;t know what&amp;#39;s coming next, so be careful and don&amp;#39;t just throw it on the table if you know you need that money. Dollar cost average and save some for a potential bear run, this is how you beat these bastards.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 217,
  "permalink": "/r/CryptoCurrency/comments/rcw317/not_falling_for_the_dip_of_the_dip_again/",
  "subreddit": "CryptoCurrency",
  "id": "rcw317",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously, I have my plans and I have my strategy. But I got blindsided by the\nrecent dip. It dipped nicely then the market decided it wants to dip massively\nright after I bought what I thought was a steal. Now if we're averaging down,\nyes I did average my % down overall, but I could have been in a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "真面目な話、私には計画があり、戦略があるのです。しかし、私は盲目になってしまいました。\n最近のディップ。うまく下落した後、市場は大規模な下落を望んだのです\n私がお買い得と思ったものを買った直後です。今、平均化すると。\nそうです、私は全体的に平均して％を下げました、しかし、私は...",
      "title": "もう二度とDIPのディップには陥らない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，我有我的计划，我有我的策略。但我被最近的下跌吓到了\n最近的下跌。跌得很好，然后市场决定要大幅下挫\n就在我买了我认为很有价值的东西之后。现在，如果我们是平均下来。\n是的，我确实在总体上平均降低了我的百分比，但我本可以在一个...",
      "title": "不会再上DIP的当了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，我有我的計劃，我有我的策略。但我被最近的下跌嚇到了\n最近的下跌。跌得很好，然後市場決定要大幅下挫\n就在我買了我認爲很有價值的東西之後。現在，如果我們是平均下來。\n是的，我確實在總體上平均降低了我的百分比，但我本可以在一個...",
      "title": "不會再上DIP的當了。"
    }
  ]
}