{
  "author": "HardlineMike",
  "original_created_utc": 1658158899,
  "title": "Why aren't space-based radio telescopes really a thing?",
  "created_utc": 1658176941,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So searching for radio telescopes I found that there are almost none currently operating in space and historically very few as well. Most of the big radio dishes in space are turned Earthwards for spying purposes.&lt;/p&gt;\n\n&lt;p&gt;As a layperson this strikes me as strange because it seems like a radio telescope would be significantly easier to build and launch than an optical telescope. &lt;/p&gt;\n\n&lt;p&gt;A few possible guesses come to mind based on my small amount of astronomy knowledge:&lt;/p&gt;\n\n&lt;p&gt;Fewer advantages over land-based observation, relative to an optical scope?&lt;/p&gt;\n\n&lt;p&gt;Interferometry using huge numbers of smaller ground based dishes simply more useful?&lt;/p&gt;\n\n&lt;p&gt;Some engineering challenge I&amp;#39;m not considering?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/askscience/comments/w22h90/why_arent_spacebased_radio_telescopes_really_a/",
  "subreddit": "askscience",
  "id": "w22h90",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So searching for radio telescopes I found that there are almost none currently\noperating in space and historically very few as well. Most of the big radio\ndishes in space are turned Earthwards for spying purposes.\n\nAs a layperson this strikes me as strange because it seems like a radio\ntelescope…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、電波望遠鏡を検索してみると、現在ではほとんどないことがわかりました。\nまた、歴史的にもほとんど存在しないことがわかりました。宇宙にある大きな電波アンテナはほとんど\n宇宙空間にある大きな電波アンテナは、スパイ目的で地球に向けられています。\n\n素人目には不思議な感じがします。\n電波望遠鏡のような...",
      "title": "なぜ、宇宙電波望遠鏡は実在しないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以搜索射电望远镜时，我发现目前几乎没有。\n在太空中运行，而且历史上也很少。大多数的大型射电\n碟都是为了间谍目的而转向地球。\n\n作为一个普通人，这让我感到很奇怪，因为它似乎是一个射电望远镜\n望远镜...",
      "title": "为什么天基射电望远镜还没有真正成为一种东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以搜索射電望遠鏡時，我發現目前幾乎沒有。\n在太空中運行，而且歷史上也很少。大多數的大型射電\n碟都是爲了間諜目的而轉向地球。\n\n作爲一個普通人，這讓我感到很奇怪，因爲它似乎是一個射電望遠鏡\n望遠鏡...",
      "title": "爲什麼天基射電望遠鏡還沒有真正成爲一種東西？"
    }
  ]
}