{
  "author": "TaxShield",
  "the_new_excerpt": "Preface: I'm not invested in any ARK funds myself. I do hold some of the stocks\nin her funds.\n\nLoved by most of this subreddit in 2020. Hated by most in 2021. Yikes. In the\npast 3 months, correlating with the sharp drop in most of her funds (Most of\nthem have dropped 30%+ since February), more and…",
  "original_created_utc": 1620588678,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりました。私自身はARKのファンドには投資していません。彼女のファンドの株式の一部を保有しています。\n彼女のファンドの銘柄をいくつか持っています。\n\n2020年、このサブレディットのほとんどの人に愛された。2021年にはほとんどの人に嫌われる。ヤバい。この3ヶ月で\nこの3ヶ月間で、彼女のファンドのほとんどが急落したことと相関している（Most of\nこの3ヶ月間で、彼女のファンドのほとんどが急落し（2月以降、ほとんどのファンドが30％以上下落）、ますます...",
      "title": "キャシー・ウッド（ARK）のこのサブレディットに対する愛憎の交尾ダンス、今回の修正に対する彼女の見解と今後の戦略について"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前言。我自己并没有投资于任何ARK基金。我确实持有一些股票\n在她的基金中。\n\n在2020年被这个分论坛的大多数人所喜爱。2021年被大多数人憎恨。呀。在\n在过去的3个月里，与她的大多数基金的急剧下降相关联（大多数\n自2月以来，它们已经下降了30%以上），越来越多的...",
      "title": "凯西-伍德（ARK）对这个子版块的爱恨交织的舞蹈，她对这次修正的看法和她未来的策略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前言。我自己並沒有投資於任何ARK基金。我確實持有一些股票\n在她的基金中。\n\n在2020年被這個分論壇的大多數人所喜愛。2021年被大多數人憎恨。呀。在\n在過去的3個月裏，與她的大多數基金的急劇下降相關聯（大多數\n自2月以來，它們已經下降了30%以上），越來越多的...",
      "title": "凱西-伍德（ARK）對這個子版塊的愛恨交織的舞蹈，她對這次修正的看法和她未來的策略"
    }
  ],
  "title": "The love/hate mating dance of Cathie Wood (ARK) with this subreddit, her take on this correction and her strategy going forward",
  "created_utc": 1620600013,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Preface: I&#39;m <strong>not</strong> invested in any ARK funds myself. I do hold some of the stocks in her funds.</p>\n\n<p>Loved by most of this subreddit in 2020. Hated by most in 2021. Yikes. In the past 3 months, correlating with the sharp drop in most of her funds (Most of them have dropped 30%+ since February), more and more people have started critizing ARK. ARK has seen outflows of more than $750 million in the last week. Now, everyone has a different take on whether her stock picks will do well or not, that&#39;s fine. I think we can all agree that 2020 has been an extraordinary year, with growth / tech / speculative stocks being the absolute winners of this mad year, mostly due to historically never before seen low interest rates, but also affected by a huge in-flow of new investors, support packages which are focused on certain sectors (Clean energy for example). More traditional sectors have underperformed last year, yet we&#39;ve been seeing an institutional rotation away from speculative stocks into more value oriented names. </p>\n\n<p>However, let&#39;s not forget that pretty much all ARK funds are still up 300%+ up from the beginning of 2020. And while the sectors ARK is heavily invested in outperformed hard, they are most likely primed to underperform this year as institutions rotated away with interest rates picking back up and the global economy slowly opening again. Is this a problem though? No. 300% in a year is insanity. This is a healthy correction. And while it may hurt seeing your portfolio like this, this is a good moment to remember why you invested the way you did (and also a good moment for self-reflection). </p>\n\n<p>Whether the criticism she&#39;s getting lately is deserved, i&#39;ll leave that up for debate. Some of her picks are HIGHLY questionable in my opinion, yet i also see some as primed for explosive growth in the upcoming 5/10 years. She has also received a lot of criticism on here for selling her bigger blue chip stocks. Is this warranted? How does she view this correction?   </p>\n\n<p>“I love this setup,” she said Friday on CNBC’. “The worst thing that could have happened to us is to have the market narrowly focus on just our ilk of stock — the innovation space. From our point of view — five-year time horizon — nothing has changed except the price,” she said. Back in February, Wood expected a 15% compound annual rate of return from her strategies, but after the recent fall in prices, she envisions that number rising to between 25% and 30%.&quot;</p>\n\n<p>In other words, she welcomes this. Now, obviously she would not say this is a disaster, as she is the fund manager. But there is also truth to her statement. Now, why does she love this setup? She sees this as an amazing buying opportunity, now that prices have dropped. But where does she get the money from? Mainly her blue chips, which is heavily debated on this sub.</p>\n\n<p>“The FAANGs certainly meet that criteria — they’re acting like defensives,” she said. “During a period of volatility like we’ve just seen, we will sell those stocks and move into either our more pure-play or earlier-stage innovation companies that are being hurt by risk-off.”  </p>\n\n<p>I actually wrote a quite comprehensive piece on this (on this subreddit as well), diving deeper into her strategy, and how she exectutes this. To read more about this, click <a href=\"https://www.reddit.com/r/stocks/comments/mtb0kc/analyzing_cathie_woods_ark_strategy_in_a/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Here</a>. </p>\n\n<p>Let&#39;s not forget that most people (even fund managers) do not beat the market over a long term (and even less on a risk-adjusted basis). ARK funds have outperformed in 2020, and will most likely underperform in the short term. Whether it will underperform in the long term, who knows. Imo, she has some holdings that i do not see a future in, and her projections and valuations are... Rich to say the least. But let&#39;s not forget she was right with her earlier Tesla valuation when everyone called her crazy. It&#39;s also possible that this correction gives her the ability to make changes in her portfolio&#39;s for favorable prices, and thus makes higher returns possible. </p>\n\n<p>This is not financial advice. Do your own research.</p>\n\n<p>To read more about the interview and watch it yourself, here ya go.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/05/07/cathie-wood-loves-the-set-up-for-her-stocks-after-sell-off-expects-big-returns-from-her-strategies.html\">https://www.cnbc.com/2021/05/07/cathie-wood-loves-the-set-up-for-her-stocks-after-sell-off-expects-big-returns-from-her-strategies.html</a></p>\n</div><!-- SC_ON -->",
  "score": 312,
  "permalink": "/r/stocks/comments/n8lkh6/the_lovehate_mating_dance_of_cathie_wood_ark_with/",
  "subreddit": "stocks",
  "id": "n8lkh6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995617
}