{
  "author": "bthemonarch",
  "original_created_utc": 1639097351,
  "title": "The implications of an \"Ape Army\" in the crypto space",
  "created_utc": 1639143120,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is total speculation, but the fact LRC has an Ape Army behind could provide an interesting dynamic as we anticipate a Bear Market. &lt;/p&gt;\n\n&lt;p&gt;Many are acutely aware of an impending crash and are trying to avoid it all costs. With LRC being involved with the Ape Army, many will see value in that communities ability to hold. Furthermore, the more that community chooses to hold, the more resilient that coin will be to btc dumps.   &lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t be the only one that has thought of that, and I would not be surprised if many choose to take advantage of that Ape Army dynamic. &amp;quot;Oh shit, btc is crashing, put it into LRC; it has the hodlers.&amp;quot;.   &lt;/p&gt;\n\n&lt;p&gt;Now, I fully understand there is a large group of day traders, that try to swing LRC, but it always seems to be picked up by the community. If this were 3 years ago, i would say no way an internet group would make a difference, but given the whole GME thing, this community does seem to play for keeps.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/rcvw4i/the_implications_of_an_ape_army_in_the_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "rcvw4i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is total speculation, but the fact LRC has an Ape Army behind could provide\nan interesting dynamic as we anticipate a Bear Market.\n\nMany are acutely aware of an impending crash and are trying to avoid it all\ncosts. With LRC being involved with the Ape Army, many will see value in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは全くの憶測ですが、LRCがApe Armyを後ろ盾にしているのは、そのためかもしれません。\nベアマーケットを予想する上で、興味深い動きです。\n\n多くの人は、差し迫った暴落を痛感し、それを避けようとしている。\nコストになります。LRCが猿軍団と関わっていることで、多くの人が価値を見出すでしょう。",
      "title": "暗号空間における「猿の軍隊」の意味するところ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这完全是猜测，但事实上，LRC背后有一支猿人军队，可以提供\n在我们预计会出现熊市的时候，会有一个有趣的动态。\n\n许多人敏锐地意识到即将发生的崩溃，并试图避免一切\n成本。由于LRC与猿人军团有牵连，许多人将看到其价值。",
      "title": "在加密货币领域的 \"猿人军队 \"的影响"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這完全是猜測，但事實上，LRC背後有一支猿人軍隊，可以提供\n在我們預計會出現熊市的時候，會有一個有趣的動態。\n\n許多人敏銳地意識到即將發生的崩潰，並試圖避免一切\n成本。由於LRC與猿人軍團有牽連，許多人將看到其價值。",
      "title": "在加密貨幣領域的 \"猿人軍隊 \"的影響"
    }
  ]
}