{
  "author": "IAmNoSherlock",
  "the_new_excerpt": "Oh god, it already sounds creepy.\n\nAnyways I am a guy in his mid 20's and I have never realised this before; I\nthink I get obsessive about the people I am romanticly interested in. Not in a\ncreepy way. No. I, probably think about them more often than I should and\npossibly overanalyze every…",
  "original_created_utc": 1622139861,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もうね、気持ち悪いですよね。\n\nとにかく、私は20代半ばの男性ですが、これまで一度も気づいたことがありませんでした。\nロマンチックに興味を持っている人に執着してしまうのだと思います。気持ち悪いという意味ではなく\n不気味な意味ではありません。いや、おそらく必要以上に相手のことを考えてしまい\n必要以上に相手のことを考えてしまい、すべてを分析しすぎてしまうのかもしれません...",
      "title": "恋愛感情を持った人に執着しないためにはどうすればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哦，上帝，这听起来已经令人毛骨悚然。\n\n总之，我是一个20多岁的男人，我以前从未意识到这一点；我认为我对我感兴趣的人有强迫症。\n我认为我对我感兴趣的人有强迫症。不是以一种\n不是令人毛骨悚然的方式。我可能比我应该想的更多，而且可能过度分析每一个人。\n可能过度分析每一个...",
      "title": "你怎样才能不对你有浪漫兴趣的人着迷呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "哦，上帝，這聽起來已經令人毛骨悚然。\n\n總之，我是一個20多歲的男人，我以前從未意識到這一點；我認爲我對我感興趣的人有強迫症。\n我認爲我對我感興趣的人有強迫症。不是以一種\n不是令人毛骨悚然的方式。我可能比我應該想的更多，而且可能過度分析每一個人。\n可能過度分析每一個...",
      "title": "你怎樣才能不對你有浪漫興趣的人着迷呢？"
    }
  ],
  "title": "How do you not be obsessive about the people that you have a romantic interest in?",
  "created_utc": 1622157103,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Oh god, it already sounds creepy.</p>\n\n<p>Anyways I am a guy in his mid 20&#39;s and I have never realised this before; I think I get obsessive about the people I am romanticly interested in. Not in a creepy way. No. I, probably think about them more often than I should and possibly overanalyze every interaction. And whenever I have a flirt or something, I am very impatient. How do I stop this?</p>\n\n<p>I don&#39;t know just give me some advice.</p>\n\n<p>(please don&#39;t say you might lack confidence because you know... duhhh. )</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/nmdy62/how_do_you_not_be_obsessive_about_the_people_that/",
  "subreddit": "NoStupidQuestions",
  "id": "nmdy62",
  "is_self": true,
  "media": null,
  "is_video": false
}