{
  "author": "Many_Scratch2269",
  "original_created_utc": 1641323970,
  "title": "Only 1% of the world owns Crypto, it is silly to say we aren't early.",
  "created_utc": 1641358323,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There are currently approximately 100 million blockchain wallets out there. This is an extremely small amount considering that is only 1.28% of the 7.8 Billion people we have on earth. The $2.2 Trillion Crypto market is extremely undervalued. In the future when digital currencies start gaining ground and you count inflation, tens of trillions in market cap are completely feasible.&lt;/p&gt;\n\n&lt;p&gt;Remember, market cap doesn&amp;#39;t reflect the amount of money invested in Crypto, it just multiplies the current market price with circulating coins. Just because the market cap is high, does not mean Crypto does not have more room to grow.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s say someone tries to acquire $10 Billion in Bitcoin, exchanges feel the pinch and start raising the prices accordingly, the new raised price for each Bitcoin is going to multiplied by the entire circulating amount and raise the market cap by hundreds of billions, if not more.&lt;/p&gt;\n\n&lt;p&gt;A good explanation would be Fiat, according to estimates, all the U.S money in circulation is worth &lt;strong&gt;6.6 trillion U.S. dollars.&lt;/strong&gt; Yet, the USD market cap exceeds 21 Trillion dollars.  The market cap of all Fiat in the world is over &lt;a href=\"https://fiatmarketcap.com/\"&gt;123 Trillion USD&lt;/a&gt;. Crypto has huge potential, and a 2.2 Trillion market cap for Crypto is still very undervalued.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TLDR&lt;/strong&gt;: Yes, we might not be early compared to people in 2010, but being the first 1% to adopt Crypto is still very early. Crypto still has the untapped potential of the 99%, and in that sense we are indeed early as we have tens, if not hundreds of trillions to go.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/rw2atb/only_1_of_the_world_owns_crypto_it_is_silly_to/",
  "subreddit": "CryptoCurrency",
  "id": "rw2atb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There are currently approximately 100 million blockchain wallets out there. This\nis an extremely small amount considering that is only 1.28% of the 7.8 Billion\npeople we have on earth. The $2.2 Trillion Crypto market is extremely\nundervalued. In the future when digital currencies start gaining…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、ブロックチェーンウォレットは約1億台あると言われています。これは\nこれは78億人の1.28%に過ぎないことを考えると、非常に小さな数字です。\n地球上にいる人たちです。2.2兆ドルの暗号化市場は、極めて重要です。\nを、割安な価格で提供します。将来、デジタル通貨が普及し始めたら...。",
      "title": "Cryptoを所有しているのは世界のわずか1％であり、我々が早くないというのは愚かなことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前大约有1亿个区块链钱包。这\n考虑到这只是78亿人中的1.28%，这是一个极小的数字。\n人的1.28%。2.2万亿美元的加密货币市场是极其\n被低估了。在未来，当数字货币开始获得...",
      "title": "世界上只有1%的人拥有加密货币，说我们不早是很愚蠢的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前大約有1億個區塊鏈錢包。這\n考慮到這只是78億人中的1.28%，這是一個極小的數字。\n人的1.28%。2.2萬億美元的加密貨幣市場是極其\n被低估了。在未來，當數字貨幣開始獲得...",
      "title": "世界上只有1%的人擁有加密貨幣，說我們不早是很愚蠢的。"
    }
  ]
}