{
  "author": "gulasch_man",
  "the_new_excerpt": "My request: If you really want to downvote a post, please provide some\ninformation why. Content creators are getting heavily discouraged about\nno-reason downvote waves and it hurts everyone. If you provide feedback or\ncritics, then you help the content provider to improve.\n\nI am really starting to…",
  "original_created_utc": 1623061090,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私からのお願いです。どうしてもダウンバイトしたいのであれば、その理由を書いてください。\n理由を教えてください。理由のないDOWNBOOTの波は、コンテンツ制作者を激しく落胆させます。\nコンテンツ制作者は、理由のないダウンボードの波に激しく落胆しており、皆に迷惑をかけています。もし、あなたがフィードバックや\n批判をすることは、コンテンツ提供者の改善につながります。\n\n私は本当に始め...",
      "title": "Upvoteは月だけではなく、コンテンツの視認性を高める効果があります。 Technical, Helping posts should be appreciated instead of shitposting."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的请求。如果你真的想给一个帖子降权，请提供一些\n信息，为什么。内容创作者对无理由的降票浪潮感到非常沮丧。\n无理由的降票浪潮，这对每个人都有伤害。如果你提供反馈或\n批评，那么你就能帮助内容提供者改进。\n\n我真的开始...",
      "title": "最高引号不仅是关于月球--它有助于内容的可见性--技术性的、帮助性的帖子应该得到赞赏，而不是狗屎贴。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的請求。如果你真的想給一個帖子降權，請提供一些\n信息，爲什麼。內容創作者對無理由的降票浪潮感到非常沮喪。\n無理由的降票浪潮，這對每個人都有傷害。如果你提供反饋或\n批評，那麼你就能幫助內容提供者改進。\n\n我真的開始...",
      "title": "最高引號不僅是關於月球--它有助於內容的可見性--技術性的、幫助性的帖子應該得到讚賞，而不是狗屎貼。"
    }
  ],
  "title": "Upvotes are not only about moons - it helps visibility for content - Technical, Helping posts should be appreciated instead of shitposting.",
  "created_utc": 1623074712,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My request: If you really want to downvote a post, please provide some information why. Content creators are getting heavily discouraged about no-reason downvote waves and it hurts everyone. If you provide feedback or critics, then you help the content provider to improve.</p>\n\n<p>I am really starting to get angry about the current sentiment of this sub. EVERYTHING is downvoted instantly as soon as it&#39;s posted or commented. I go through the posts by new and 80% of the comments are sitting with 0 or -1 because of the downvoting bots or users, I can&#39;t decide.</p>\n\n<p>You see posts with 15-25-30 comments and 1-2 upvotes only and every time I refresh on them, they go back to 1 or 0, constantly downvoted regardless of the content.</p>\n\n<p>I upvoted everything so far which wasn&#39;t harassment or negative attitude towards the others, because I wanted to counter these &quot;attacks&quot;, but it looks like a lost battle. If it&#39;s not a controversial post about moons or a sob story (I like some of them too to be honest) then it won&#39;t reach front page.</p>\n\n<p>Posts about tech or news barely reach anything. Please if you like a post support it, not just comment, because it won&#39;t get any exposure and won&#39;t reach more users.</p>\n</div><!-- SC_ON -->",
  "score": 928,
  "permalink": "/r/CryptoCurrency/comments/nu8y1z/upvotes_are_not_only_about_moons_it_helps/",
  "subreddit": "CryptoCurrency",
  "id": "nu8y1z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404882870
}