{
  "author": "dontoweyouathing",
  "the_new_excerpt": "I have an employee who is Indian. As in “arrived in America a few months ago”\nIndian. He strikes me as very boastful and pretentious. He credits his current\nstation of working for me as an accident of geopolitics (“In my country you\nwould be working for me” etc). His English isn’t that good and he…",
  "original_created_utc": 1622323723,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私にはインド人の社員がいます。数ヶ月前にアメリカに到着した」というように\nインド人。彼はとても自慢好きで気取っているように思えます。彼は今の自分の立場を\n働いているのは、地政学上の偶然だと言っています（「私の国では\n私の国では、あなたは私のために働いているでしょう」などと言っていました。) 彼の英語はそれほど上手ではなく、彼は...",
      "title": "私が人種差別をしているのか、それとも彼がただの嫌な奴なのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个雇员是印度人。如 \"几个月前抵达美国\"\n印度人。他给我的印象是非常自夸和自命不凡。他认为他现在的\n为我工作是一个地缘政治的意外（\"在我的国家，你会为我工作 \"等等）。\n会为我工作 \"等等）。) 他的英语不是很好，而且他...",
      "title": "我是种族主义者还是他只是个混蛋？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個僱員是印度人。如 \"幾個月前抵達美國\"\n印度人。他給我的印象是非常自誇和自命不凡。他認爲他現在的\n爲我工作是一個地緣政治的意外（\"在我的國家，你會爲我工作 \"等等）。\n會爲我工作 \"等等）。) 他的英語不是很好，而且他...",
      "title": "我是種族主義者還是他只是個混蛋？"
    }
  ],
  "title": "Am I racist or is he just a jerk?",
  "created_utc": 1622342677,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have an employee who is Indian. As in “arrived in America a few months ago” Indian. He strikes me as very boastful and pretentious. He credits his current station of working for me as an accident of geopolitics (“In my country you would be working for me” etc). His English isn’t that good and he mimics often, so I think he at least occasionally mistakenly uses phrases that come off as rude or inappropriate without meaning to do so. Even so, it’s hard not to let these things get my hackles up.</p>\n\n<p>When I mention that it is not our polite custom to be boastful or to express such a high opinion of oneself or to always “one up” the other person in a conversation, he says it’s just his cultural upbringing. He’s always done it better. I tend to just cock an eyebrow skeptically and let it go.</p>\n\n<p>He’s bright enough to notice when I’m pissed, and he’ll back off - for a bit anyway. But I wouldn’t call him contrite. The trouble is that I can’t tell if he’s not contrite because he’s culturally clueless or if he’s actually a pretentious asshole.</p>\n\n<p>I’m from a small town that is not very diverse (&gt;97% white). The Indians I’ve met in my life have been very Americanized, so I don’t have a frame of reference for this.</p>\n\n<p>I also recognize that India is a giant country and asking “is this normal” has the potential to vary way more than comparisons between New Yorkers and Texans and Californians.</p>\n\n<p>So, I’m trying to be respectful and tolerant, but is this a legitimate cultural disconnect? Or is he just a prick?</p>\n</div><!-- SC_ON -->",
  "score": 147,
  "permalink": "/r/NoStupidQuestions/comments/nnwpj0/am_i_racist_or_is_he_just_a_jerk/",
  "subreddit": "NoStupidQuestions",
  "id": "nnwpj0",
  "is_self": true,
  "media": null,
  "is_video": false
}