{
  "author": "Agreeable_Page3330",
  "original_created_utc": 1655526562,
  "title": "How do I know which sources of history to trust?",
  "created_utc": 1655569941,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;my friend says that a lot of the things I learn online are manipulated history written by people that only want you to see certain sides of something…. and history that was written by the victors…..&lt;/p&gt;\n\n&lt;p&gt;also that the government secretly sensors internet and very cleverly shows stuff that they want you to see and that the media is also very biased and are the puppets of the governments. &lt;/p&gt;\n\n&lt;p&gt;I have to say, we are human beings after all. We do have conscious and subconscious biases.&lt;/p&gt;\n\n&lt;p&gt;with all of this, how do I know which source of history is the truth? and what to trust?&lt;/p&gt;\n\n&lt;p&gt;how do I know if this is the history that actually happened and this is the history that is taught in all the other areas of the world? &lt;/p&gt;\n\n&lt;p&gt;How do I know that this isn’t a manipulated history written by the victor. &lt;/p&gt;\n\n&lt;p&gt;how do I know that this isn’t history from “western” point of view &lt;/p&gt;\n\n&lt;p&gt;how do I know that a lot of the things that we know today were not lost or misinterpreted through text translations?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/veyazb/how_do_i_know_which_sources_of_history_to_trust/",
  "subreddit": "AskHistorians",
  "id": "veyazb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "my friend says that a lot of the things I learn online are manipulated history\nwritten by people that only want you to see certain sides of something…. and\nhistory that was written by the victors…..\n\nalso that the government secretly sensors internet and very cleverly shows stuff\nthat they want you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人が言うには、私がネットで学んだことの多くは、ある特定の側面だけを見ようとする人たちによって\nということらしい。\n勝者によって書かれた歴史......。\n\nまた、政府はインターネットを密かにセンサーし、非常に巧妙に自分たちの望むものを見せている。\nを見せるということです。",
      "title": "どの歴史資料を信用すればいいのか、どうすればいいのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友说，我在网上学到的很多东西都是被操纵的历史。\n由那些只想让你看到某些方面的人写的....。\n历史是由胜利者写的.....\n\n还有，政府秘密地对互联网进行感应，并非常巧妙地展示他们想要的东西\n他们希望你...",
      "title": "我如何知道该相信哪些历史来源？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友說，我在網上學到的很多東西都是被操縱的歷史。\n由那些只想讓你看到某些方面的人寫的....。\n歷史是由勝利者寫的.....\n\n還有，政府祕密地對互聯網進行感應，並非常巧妙地展示他們想要的東西\n他們希望你...",
      "title": "我如何知道該相信哪些歷史來源？"
    }
  ]
}