{
  "author": "Emmaxop",
  "original_created_utc": 1651143558,
  "title": "Why did Spain so easily give up Roussillon, and why did they never attempt to get it back?",
  "created_utc": 1651153512,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Roussillion was a region in north-eastern Catalonia that was ceded to France in the Treaty of the Pyrenees. But I can&amp;#39;t seem to find anything on whether or not Spain attempted to take the province back. You&amp;#39;d think that at the Congress of Vienna in 1815 that Spain would attempt to push for the province to return to Spain, but it doesn&amp;#39;t seem like that was the case, but I 100% could be wrong on this. Nor can I find anything about Franco wanting the region back as condition for joining the Axis in WW2. He, in all likelyhood in bad faith, pushed to gain all of Morocco, Cameroon and Gibraltar in exchange for joining the war, but wouldn&amp;#39;t Roussillon be a natural addition as well? &lt;/p&gt;\n\n&lt;p&gt;The answer that I&amp;#39;m assuming to be most likely, is simply that Catalonia was not seen as a part of &amp;quot;Spain&amp;quot; proper and thus the Spanish weren&amp;#39;t that interested in enlarging the province again. But that&amp;#39;s just my guess, and I can&amp;#39;t seem to find any definitive answers on this. &lt;/p&gt;\n\n&lt;p&gt;Thanks for any replies!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/udsc43/why_did_spain_so_easily_give_up_roussillon_and/",
  "subreddit": "AskHistorians",
  "id": "udsc43",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Roussillion was a region in north-eastern Catalonia that was ceded to France in\nthe Treaty of the Pyrenees. But I can't seem to find anything on whether or not\nSpain attempted to take the province back. You'd think that at the Congress of\nVienna in 1815 that Spain would attempt to push for the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ルシリオンは、ピレネー条約でフランスに割譲されたカタルーニャ北東部の地域である。\nピレネー条約でフランスに割譲された地域です。しかし、その有無については、どうも見つからない。\nスペインはこの地方を取り戻そうとした。1815年のウィーン会議では、スペインは\n1815年のウィーン会議でスペインは...",
      "title": "なぜスペインはあっさりとルシヨンを手放し、それを取り戻そうとしなかったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鲁西恩是加泰罗尼亚东北部的一个地区，在《比利牛斯条约》中被割让给了法国。\n在《比利牛斯山脉条约》中被割让给法国。但我似乎找不到任何关于是否\n西班牙是否试图夺回该省。你会认为，在1815年的维也纳会议上\n你会认为在1815年的维也纳会议上，西班牙会试图推动...",
      "title": "为什么西班牙如此轻易地放弃了鲁西荣，而他们又从未试图夺回它？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "魯西恩是加泰羅尼亞東北部的一個地區，在《比利牛斯條約》中被割讓給了法國。\n在《比利牛斯山脈條約》中被割讓給法國。但我似乎找不到任何關於是否\n西班牙是否試圖奪回該省。你會認爲，在1815年的維也納會議上\n你會認爲在1815年的維也納會議上，西班牙會試圖推動...",
      "title": "爲什麼西班牙如此輕易地放棄了魯西榮，而他們又從未試圖奪回它？"
    }
  ]
}