{
  "author": "batmanEXPLOSION",
  "original_created_utc": 1627056199,
  "title": "Would it be possible to create a cryptocurrency that uses it's collective mining hashpower all at once, creating a massive supercomputer to solve complex equations, or a string of equations provided by the highest bidder?",
  "created_utc": 1627115771,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see this as a cross between NiceHash in that it pays other people to rent out other people&#39;s computing power to the highest bidder, Folding at Home in that it&#39;s solving complex equations (but not limited to must folding proteins), and a Super Computer.</p>\n\n<p>Could the NiceHash server be decentralized? Can this be done today in Ethereum or other Alt Coins?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/oq5gy5/would_it_be_possible_to_create_a_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "oq5gy5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see this as a cross between NiceHash in that it pays other people to rent out\nother people's computing power to the highest bidder, Folding at Home in that\nit's solving complex equations (but not limited to must folding proteins), and a\nSuper Computer.\n\nCould the NiceHash server be decentralized?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、NiceHashが他の人にお金を払って他の人の計算能力を最高入札者に貸し出すことと\nこれはNiceHashとFolding at Homeの中間のようなものです。\n複雑な方程式を解くという意味での「Folding at Home」と、「スーパーコンピュータ」を掛け合わせたものです。\nスーパーコンピュータ。\n\nNiceHashのサーバーは分散化されているのだろうか...。",
      "title": "複雑な方程式を解く巨大なスーパーコンピュータや、最高額入札者から提供された方程式の文字列を作るように、マイニングのハッシュパワーを一度に利用する暗号通貨を作ることはできないだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为这是NiceHash和Folding之间的一个交叉点，因为它付钱给其他人来出租\n它支付其他人的计算能力给出价最高的人，而Folding at Home则是解决复杂的方程（但不限于必须折叠的蛋白质）。\n它正在解决复杂的方程（但不限于必须折叠蛋白质），以及一个\n超级计算机。\n\nNiceHash的服务器可以去中心化吗？",
      "title": "有没有可能创造一种加密货币，一次性使用它的集体挖矿能力，创造一个巨大的超级计算机来解决复杂的方程式，或由出价最高的人提供一串方程式？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲這是NiceHash和Folding之間的一個交叉點，因爲它付錢給其他人來出租\n它支付其他人的計算能力給出價最高的人，而Folding at Home則是解決複雜的方程（但不限於必須摺疊的蛋白質）。\n它正在解決複雜的方程（但不限於必須摺疊蛋白質），以及一個\n超級計算機。\n\nNiceHash的服務器可以去中心化嗎？",
      "title": "有沒有可能創造一種加密貨幣，一次性使用它的集體挖礦能力，創造一個巨大的超級計算機來解決複雜的方程式，或由出價最高的人提供一串方程式？"
    }
  ]
}