{
  "author": "MangoExternal",
  "the_new_excerpt": "BlackBerry is expected to report its Q4 results in the final week of March.\nInvestors’ high expectations from these results could help its stock recover\nduring the month.\n\nIn the year 2020, we saw how the rising demand for EVs drove a massive rally in\nmany companies’ shares (like Tesla), despite the…",
  "original_created_utc": 1614656102,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "黑莓预计将在3月最后一周公布第四季度业绩。\n投资者对这些业绩的高预期可能会帮助其股价复苏\n月期间。\n\n年，我们看到了电动车需求的上升是如何推动电动车大规模上涨的。\n许多公司的股票（比如特斯拉），尽管...",
      "title": "黑莓股票还能买吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "黑莓預計將在3月最後一週公佈第四季度業績。\n投資者對這些業績的高預期可能會幫助其股價復甦\n月期間。\n\n年，我們看到了電動車需求的上升是如何推動電動車大規模上漲的。\n許多公司的股票（比如特斯拉），儘管...",
      "title": "黑莓股票還能買嗎？"
    }
  ],
  "title": "Is BlackBerry stock still a good buy?",
  "created_utc": 1614662592,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>BlackBerry is expected  to report its Q4 results in the final week of March. Investors’ high  expectations from these results could help its stock recover during the  month. </p>\n\n<p>In the year 2020, we saw how the rising demand for EVs drove a massive rally in many companies’ shares (like <strong>Tesla</strong>),  despite the global pandemic. Experts predict the 2020s to be the decade  of EVs, smart mobility, and autonomous cars. Investing in companies  focusing on these top emerging trends of the decade could be a great  idea to get rich. That’s why I consider a recent drop in BlackBerry  stock to be an opportunity for long-term investors to buy this great EV  technology stock cheaper.</p>\n\n<p>&#x200B;</p>\n\n<p>Disclaimer: I hold LEAP BB $15 Calls.</p>\n\n<p><a href=\"https://ca.finance.yahoo.com/news/march-outlook-why-blackberry-tsx-210054061.html\">https://ca.finance.yahoo.com/news/march-outlook-why-blackberry-tsx-210054061.html</a></p>\n</div><!-- SC_ON -->",
  "score": 397,
  "permalink": "/r/stocks/comments/lvswes/is_blackberry_stock_still_a_good_buy/",
  "subreddit": "stocks",
  "id": "lvswes",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937743432
}