{
  "author": "screwyoushadowban",
  "the_new_excerpt": "To what degree was tamping down nationalist feelings a regular part of the\ncentral authority's top priorities before Tito's death? How significant was\nethnic tension, really, in the middle part of the 20th century as part of public\nfeelings/discourse, especially a generation or so past the times of…",
  "original_created_utc": 1614717151,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在多大程度上压制民族主义情绪是经常性的工作。\n铁托死前，中央当局的首要任务是什么？有多重要？\n民族关系紧张，真的，在20世纪中叶，作为公众的一部分。\n感受/话语权，特别是在过去的一代或几代人的...",
      "title": "流行历史常常把南斯拉夫说成是一颗注定要爆炸的 \"民族主义定时炸弹\"，只有靠强硬的铁托总统的武力才能维持住。但他在1980年去世，1991年第一次南斯拉夫战争开始。到底发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在多大程度上壓制民族主義情緒是經常性的工作。\n鐵托死前，中央當局的首要任務是什麼？有多重要？\n民族關係緊張，真的，在20世紀中葉，作爲公衆的一部分。\n感受/話語權，特別是在過去的一代或幾代人的...",
      "title": "流行歷史常常把南斯拉夫說成是一顆註定要爆炸的 \"民族主義定時炸彈\"，只有靠強硬的鐵托總統的武力才能維持住。但他在1980年去世，1991年第一次南斯拉夫戰爭開始。到底發生了什麼？"
    }
  ],
  "title": "Pop history often presents Yugoslavia as a \"nationalist time bomb\" destined to blow, held together only by the force of strongman President Tito. But he died in 1980 and the first Yugoslav war began in 1991. What was really going on?",
  "created_utc": 1614732074,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To what degree was tamping down nationalist feelings a regular part of the central authority&#39;s top priorities before Tito&#39;s death? How significant was ethnic tension, really, in the middle part of the 20th century as part of public feelings/discourse, especially a generation or so past the times of the Utashe and the Chetniks? Why did ethnic/nationalist issues become so relevant in the 80s? If the popular narrative and Tito&#39;s central role hold any water, why did the first Yugoslav war happen in 1991 and not the early 80s?</p>\n</div><!-- SC_ON -->",
  "score": 304,
  "permalink": "/r/AskHistorians/comments/lwbshe/pop_history_often_presents_yugoslavia_as_a/",
  "subreddit": "AskHistorians",
  "id": "lwbshe",
  "is_self": true,
  "media": null,
  "is_video": false
}