{
  "author": "a_softy_potato",
  "original_created_utc": 1647677989,
  "title": "Crypto wont delete fiat from existence just like fiat didnt delete gold and silver.",
  "created_utc": 1647765174,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To this day gold and silver are traded in the market at huge volumes and some countries still back up their fiat currency with gold.&lt;/p&gt;\n\n&lt;p&gt;Although, precious metals slowly started losing a lot of their uses in the mainstream market. And in the event that crypto goes mainstream and most people start using it, I expect the same to happen to fiat.&lt;/p&gt;\n\n&lt;p&gt;Its dumb to assume that fiat will completely fade away into obscurity, but it will for sure be losing a lot of dominance in favor of crypto.&lt;/p&gt;\n\n&lt;p&gt;And this reality might not be too far away from happening. We’re already seeing things like crypto credit cards from platforms like Binance, Coinbase and CoinOvy gaining a lot of popularity in the mainstream market. These crypto-to-fiat bridges will give crypto a lot of exposure and help make the transition to full in crypto payments much easier and smoother.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/thqqc7/crypto_wont_delete_fiat_from_existence_just_like/",
  "subreddit": "CryptoCurrency",
  "id": "thqqc7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "To this day gold and silver are traded in the market at huge volumes and some\ncountries still back up their fiat currency with gold.\n\nAlthough, precious metals slowly started losing a lot of their uses in the\nmainstream market. And in the event that crypto goes mainstream and most people\nstart…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日でも金と銀は市場で大量に取引されており、中には\n現在でも不換紙幣を金でバックアップしている国があります。\n\nしかし、貴金属は徐々にその用途を失いつつあります。\nメインストリーム市場 そして、暗号が主流になり、ほとんどの人が\n開始...",
      "title": "暗号は、不換紙幣が金や銀を消さないように、不換紙幣の存在を消すことはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "时至今日，黄金和白银在市场上的交易量巨大，一些国家仍然用黄金来支持其法定货币。\n一些国家仍然用黄金来支持他们的法定货币。\n\n虽然，贵金属在主流市场上慢慢开始失去了很多用途。\n主流市场。而在加密货币成为主流的情况下，大多数人\n开始...",
      "title": "加密货币不会将法币从现实中删除，就像法币没有删除黄金和白银一样。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "時至今日，黃金和白銀在市場上的交易量巨大，一些國家仍然用黃金來支持其法定貨幣。\n一些國家仍然用黃金來支持他們的法定貨幣。\n\n雖然，貴金屬在主流市場上慢慢開始失去了很多用途。\n主流市場。而在加密貨幣成爲主流的情況下，大多數人\n開始...",
      "title": "加密貨幣不會將法幣從現實中刪除，就像法幣沒有刪除黃金和白銀一樣。"
    }
  ]
}