{
  "author": "AMC_Tendies42069",
  "original_created_utc": 1636740726,
  "title": "I can’t believe the shit I just saw on TV",
  "created_utc": 1636760308,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’m here visiting my pops, (Ottawa, Canada for those curious)</p>\n\n<p>On the TV there’s a local news station and they’re interviewing people who yolo’d their life savings into crypto and lost everything, all the doom and gloom and FUD they can throw at Bitcoin was thrown. Somehow there’s massive amounts of pity for these sore losers</p>\n\n<p>Do you think they would be complaining if they didn’t paper hand and lose all their money? What if they just understood how to invest in the first place and they made bank?</p>\n\n<p>I’m just so mad that these people get off with no personal responsibility... I just lost about $6,000 this week in alts, other than this sentence I haven’t complained about it and I certainly don’t think my losses are due to anything but me paperhanding some shitcoins I should of never bought in the first place.</p>\n\n<p>So frustrating.....</p>\n\n<p>Edit: if someone finds the newscast they also discussed this event as well: <a href=\"https://www.google.ca/amp/s/beta.ctvnews.ca/local/toronto/2020/10/8/1_5138828.html\">https://www.google.ca/amp/s/beta.ctvnews.ca/local/toronto/2020/10/8/1_5138828.html</a></p>\n\n<p>They ended the segment with a question as to whether Bitcoin should be banned pending legislation</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/Bitcoin/comments/qsh670/i_cant_believe_the_shit_i_just_saw_on_tv/",
  "subreddit": "Bitcoin",
  "id": "qsh670",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I’m here visiting my pops, (Ottawa, Canada for those curious)\n\nOn the TV there’s a local news station and they’re interviewing people who\nyolo’d their life savings into crypto and lost everything, all the doom and\ngloom and FUD they can throw at Bitcoin was thrown. Somehow there’s massive\namounts…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "というわけで、私は両親を訪ねています。\n\nテレビでは地元のニュースステーションがあり、人生の危機を乗り越えた人々にインタビューをしていたよ。\n貯めたお金を暗号につぎ込んですべてを失った人たちにインタビューしていた。\nビットコインに投げつけられる悲観的なFUDはすべて投げつけられました。どういうわけか、大量の\n量の...",
      "title": "今テレビで見たことが信じられない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看望我的父母，（加拿大渥太华，对那些好奇的人来说）。\n\n电视上有一个当地的新闻台，他们正在采访那些\n他们把一生的积蓄都投到了加密货币上，结果失去了一切，所有的厄运和\n他们向比特币抛出了所有的坏消息和恐惧。不知为何，有大量的\n数量...",
      "title": "我无法相信我刚刚在电视上看到的狗屎。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看望我的父母，（加拿大渥太華，對那些好奇的人來說）。\n\n電視上有一個當地的新聞臺，他們正在採訪那些\n他們把一生的積蓄都投到了加密貨幣上，結果失去了一切，所有的厄運和\n他們向比特幣拋出了所有的壞消息和恐懼。不知爲何，有大量的\n數量...",
      "title": "我無法相信我剛剛在電視上看到的狗屎。"
    }
  ]
}