{
  "author": "Karnes",
  "the_new_excerpt": "\"It seems that in the United States, at least, app developers and advertisers\nwho rely on targeted mobile advertising for revenue are seeing their worst fears\nrealized: Analytics data published this week suggests that US users choose to\nopt out of tracking 96 percent of the time in the wake of iOS…",
  "original_created_utc": 1620439925,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"少なくとも米国では、ターゲットを絞ったモバイル広告に収益を依存しているアプリ開発者や広告主が、最悪の事態に陥っているようです。\n少なくとも米国では、ターゲットを絞ったモバイル広告に収益を依存しているアプリ開発者や広告主の最悪の懸念が現実のものとなっているようです。\nが実現しています。今週発表された分析データによると、米国のユーザーはiOSの導入後、96%の確率でトラッキングを拒否しています。\n今週発表されたアナリティクスのデータによると、米国のユーザーは、iOS...をきっかけに、96％の確率でトラッキングを拒否することを選択しています。",
      "title": "米国ユーザーの96%がiOS 14.5でアプリのトラッキングをオプトアウト - ユーザーの行動に関する最初のデータは、広告主の最悪の懸念を上回るものでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"看来，至少在美国，应用程序开发商和广告商\n至少在美国，依靠定向移动广告获得收入的应用开发者和广告商看到了他们最担心的事情\n实现了。本周公布的分析数据表明，美国用户在iOS系统推出后，有96%的时间选择了\n在iOS系统之后，美国用户有96%的时间选择不接受追踪......",
      "title": "96%的美国用户在iOS 14.5系统中选择退出应用追踪 - 一些关于用户行为的首批数据超出了广告商的最担心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"看來，至少在美國，應用程序開發商和廣告商\n至少在美國，依靠定向移動廣告獲得收入的應用開發者和廣告商看到了他們最擔心的事情\n實現了。本週公佈的分析數據表明，美國用戶在iOS系統推出後，有96%的時間選擇了\n在iOS系統之後，美國用戶有96%的時間選擇不接受追蹤......",
      "title": "96%的美國用戶在iOS 14.5系統中選擇退出應用追蹤 - 一些關於用戶行爲的首批數據超出了廣告商的最擔心。"
    }
  ],
  "title": "96% of US users opt out of app tracking in iOS 14.5 - Some of the first data on user behavior exceeds advertisers' worst fears.",
  "created_utc": 1620445043,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;It seems that in the United States, at least, app developers and advertisers who rely on targeted mobile advertising for revenue are seeing their worst fears realized: Analytics data published this week suggests that US users choose to opt out of tracking 96 percent of the time in the wake of iOS 14.5.</p>\n\n<p>When Apple released iOS 14.5 late last month, it began enforcing a policy called App Tracking Transparency. iPhone, iPad, and Apple TV apps are now required to request users&#39; permission to use techniques like IDFA (ID for Advertisers) to track those users&#39; activity across multiple apps for data collection and ad targeting purposes.</p>\n\n<p>The change met fierce resistance from companies like Facebook, whose market advantages and revenue streams are built on leveraging users&#39; data to target the most effective ads at those users. Facebook went so far as to take out full-page newspaper ads claiming that the change would not just hurt Facebook but would destroy small businesses around the world. Shortly after, Apple CEO Tim Cook attended a data privacy conference and delivered a speech that harshly criticized Facebook&#39;s business model.</p>\n\n<p>Nonetheless, Facebook and others have complied with Apple&#39;s new rule to avoid being rejected from the iPhone&#39;s App Store, though some apps present a screen explaining why users should opt in before the Apple-mandated prompt to opt in or out appears.&quot;</p>\n\n<p>Source:  <a href=\"https://arstechnica.com/gadgets/2021/05/96-of-us-users-opt-out-of-app-tracking-in-ios-14-5-analytics-find/\">https://arstechnica.com/gadgets/2021/05/96-of-us-users-opt-out-of-app-tracking-in-ios-14-5-analytics-find/</a></p>\n</div><!-- SC_ON -->",
  "score": 14254,
  "permalink": "/r/stocks/comments/n7eybf/96_of_us_users_opt_out_of_app_tracking_in_ios_145/",
  "subreddit": "stocks",
  "id": "n7eybf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995615
}