{
  "author": "TheDorkNite1",
  "original_created_utc": 1636827976,
  "title": "Can scientists tell if trees in a forest are related (\"parents\"/\"children\") to each other?",
  "created_utc": 1636870438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that we can obviously say that a bunch of trees living near each other likely all came from the same group of older or long dead trees. But I mean can we scientifically say &quot;Yes this tree is this other tree&#39;s direct descendant&quot; or &quot;this tree and this other tree came from the same &#39;parent&#39;?&quot;</p>\n\n<p>For example, if we were to analyze the younger sequoia trees in the area around General Sherman in Sequoia National Park, could we say scientifically that this tree is General Sherman&#39;s &quot;child&quot;, this other tree is the &quot;grandchild&quot;, etc?</p>\n\n<p>I hope this makes sense.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/qt71v1/can_scientists_tell_if_trees_in_a_forest_are/",
  "subreddit": "askscience",
  "id": "qt71v1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that we can obviously say that a bunch of trees living near each\nother likely all came from the same group of older or long dead trees. But I\nmean can we scientifically say \"Yes this tree is this other tree's direct\ndescendant\" or \"this tree and this other tree came from the same…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "近くに住んでいる木は、古い木や長い間枯れていた木から生まれた可能性が高い、というのは当然のことです。\n近くにあるたくさんの木は、同じグループの古い木や長い間死んでいた木から来ている可能性が高いと言えるでしょう。しかし、私は\nしかし、科学的に「この木はこの木の直系の子孫だ」とか「この木とこの木は同じ...から生まれた」と言えるのかということです。\nしかし、科学的に「この木は他の木の直系の子孫だ」とか「この木と他の木は同じ...",
      "title": "森の中の木がお互いに親戚関係にあるかどうかは、科学者が判断できるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白，我们显然可以说，一群生活在彼此附近的树\n很可能都是来自同一批老树或早已死亡的树。但我的意思是，我们能不能科学地说 \"这棵树是另一棵树的直系亲属？\n但我的意思是，我们能不能科学地说 \"是的，这棵树是另一棵树的直系后代 \"或 \"这棵树和另一棵树是同源的\"？\n后裔 \"或 \"这棵树和另一棵树来自同一个......",
      "title": "科学家们能分辨出森林中的树木是否相互关联（\"父母\"/\"子女\"）吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白，我們顯然可以說，一羣生活在彼此附近的樹\n很可能都是來自同一批老樹或早已死亡的樹。但我的意思是，我們能不能科學地說 \"這棵樹是另一棵樹的直系親屬？\n但我的意思是，我們能不能科學地說 \"是的，這棵樹是另一棵樹的直系後代 \"或 \"這棵樹和另一棵樹是同源的\"？\n後裔 \"或 \"這棵樹和另一棵樹來自同一個......",
      "title": "科學家們能分辨出森林中的樹木是否相互關聯（\"父母\"/\"子女\"）嗎？"
    }
  ]
}