{
  "author": "legland28",
  "original_created_utc": 1632919579,
  "title": "Can I legally stalk a stalker?",
  "created_utc": 1632939951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My friend (22F) has what I (36F)consider to be a stalker. Nobody will do anything about it because he HaSn&#39;T DoNe aNyTHing yEt.  My friend is afraid, he has destroyed her sense of safety. He sits in her section at work for hours, follows her into the parking lot,messages her on every app he can find, and has started randomly showing up at places she goes. If that is something he can legally do can I take up stalking him? I want to strip away his sense of safety. I want him peeking through curtains to see if I&#39;m outside. I want to follow his bitch ass around and take pictures. Whatever he LeGaLly does to her I want to do to him. So are the rules the same? Can I relentlessly stalk him until he fucks off and leaves her alone?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/pxumns/can_i_legally_stalk_a_stalker/",
  "subreddit": "NoStupidQuestions",
  "id": "pxumns",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My friend (22F) has what I (36F)consider to be a stalker. Nobody will do\nanything about it because he HaSn'T DoNe aNyTHing yEt. My friend is afraid, he\nhas destroyed her sense of safety. He sits in her section at work for hours,\nfollows her into the parking lot,messages her on every app he can find,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人(22F)には、私(36F)が思うようなストーカーがいます。誰も何もしてくれません。\n誰も何もしてくれません。なぜなら、彼は今までに何もしていないからです。私の友人は恐れています。\n彼は彼女の安全感を破壊しました。彼は仕事場で何時間も彼女の席に座っています。\n駐車場まで追いかけたり、あらゆるアプリでメッセージを送ったり...。",
      "title": "ストーカー行為を法的に行うことはできますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友（22F）有我（36F）认为的跟踪者。没有人愿意做\n因为他没有做任何事情。我的朋友很害怕，他\n他已经破坏了她的安全感。他在她的工作区坐了几个小时。\n跟踪她到停车场，在所有他能找到的应用程序上给她发信息。",
      "title": "我可以合法地对跟踪者进行跟踪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友（22F）有我（36F）認爲的跟蹤者。沒有人願意做\n因爲他沒有做任何事情。我的朋友很害怕，他\n他已經破壞了她的安全感。他在她的工作區坐了幾個小時。\n跟蹤她到停車場，在所有他能找到的應用程序上給她發信息。",
      "title": "我可以合法地對跟蹤者進行跟蹤嗎？"
    }
  ]
}