{
  "author": "minimally__invasive",
  "the_new_excerpt": "I've noticed an insane influx of noobs here very recently, possibly because of\nthe stimmy arriving gradually in people's hands.\n\nThey're asking super basic questions like \"How to buy a satoshi\" not realizing\nthat it's a Bitcoin denomination, others asking whether exchanges can go poof,\nhow to change…",
  "original_created_utc": 1616006526,
  "localize": [
    {
      "locale": "zh",
      "title": "友好的提醒。请对新来的新手好一点！",
      "the_new_excerpt": "我注意到最近这里有大量的无名小卒涌入，可能是由于\n逐渐到达人们手中的兴奋剂。\n\n他们问的是 \"怎么买聪聪 \"这样的超级基本问题，却不知道。\n说是比特币的面额，还有人问交易所能不能噗。\n如何改变..."
    },
    {
      "locale": "zh-Hant",
      "title": "友好的提醒。請對新來的新手好一點！",
      "the_new_excerpt": "我注意到最近這裏有大量的無名小卒湧入，可能是由於\n逐漸到達人們手中的興奮劑。\n\n他們問的是 \"怎麼買聰聰 \"這樣的超級基本問題，卻不知道。\n說是比特幣的面額，還有人問交易所能不能噗。\n如何改變..."
    }
  ],
  "title": "Friendly reminder: Please be nice to the new wave of noobs arriving here!",
  "created_utc": 1616078306,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve noticed an insane influx of noobs here very recently, possibly because of the stimmy arriving gradually in people&#39;s hands. </p>\n\n<p>They&#39;re asking super basic questions like &quot;How to buy a satoshi&quot; not realizing that it&#39;s a Bitcoin denomination, others asking whether exchanges can go poof, how to change fees for a transaction, or whether totallynotascam.com is a scam. Others want to start a mining side gig with Bitcoin Core running on their laptop and so on and so on. </p>\n\n<p><strong>Just a friendly reminder</strong>: it&#39;s easy to think &quot;Wtf are you talking about? You&#39;re about to get REKT!&quot; (and I&#39;ve done that so often myself). And it&#39;s probably true that they will get REKT one day (hey, that&#39;s how you learn!) because being able to handle Bitcoin safely definitely requires some level of crypto literacy. But that&#39;s exactly why we are here this week! We are here to help! </p>\n\n<p>Let&#39;s be nice to them, welcome them to our great community, and teach them how to be safe, trustless, and decentralized. How to stack sats, HODL them no matter what, and live a better life... and maybe they&#39;ll spread the word some day as well! </p>\n\n<p>TL;DR: Stimmy noobs incoming! Don&#39;t jinx it!</p>\n</div><!-- SC_ON -->",
  "score": 150,
  "permalink": "/r/Bitcoin/comments/m77ekn/friendly_reminder_please_be_nice_to_the_new_wave/",
  "subreddit": "Bitcoin",
  "id": "m77ekn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752812173
}