{
  "author": "kafkasunbeam",
  "original_created_utc": 1630486188,
  "title": "What if we just replaced precious jewels with glass?",
  "created_utc": 1630501452,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So the other day there was this controversy about Beyoncé, and a few other celebrities before her, wearing a famous yellow diamond which (like every diamond, apparently) has a very dark, unethical origin in slave mines.</p>\n\n<p>So I wondered, couldn&#39;t we just wear colored (or clear) jewel shaped glass as jewelry? For ethical reasons, but also because... Can the human eye, without the aid of some specialized magnifying lens, tell the difference between a sapphire and blue colored glass? I get gemstones are beautiful, but do they have any intrinsic value beyond simply being rare?</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/pfpuqv/what_if_we_just_replaced_precious_jewels_with/",
  "subreddit": "NoStupidQuestions",
  "id": "pfpuqv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So the other day there was this controversy about Beyoncé, and a few other\ncelebrities before her, wearing a famous yellow diamond which (like every\ndiamond, apparently) has a very dark, unethical origin in slave mines.\n\nSo I wondered, couldn't we just wear colored (or clear) jewel shaped glass…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、ビヨンセとその前の数人のセレブが、有名なイエローダイヤモンドを身につけていたことが話題になりました。\n有名なイエローダイヤモンドを身につけていたことが話題になりました。\nそのダイヤモンドは（他のダイヤモンドと同様に）、奴隷鉱山で採掘された非常に暗く非倫理的なものです。\n\nそこで私は、色付きの（あるいは透明な）宝石の形をしたガラスを身につけることはできないだろうかと考えました...。",
      "title": "貴重な宝石をガラスに置き換えたらどうだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，关于碧昂斯和其他一些名人佩戴著名的黄钻的争议。\n名人，佩戴了一颗著名的黄钻，而这颗黄钻（就像每颗钻石一样\n这颗钻石（就像所有的钻石一样，显然）有一个非常黑暗的、不道德的奴隶矿场的起源。\n\n所以我想，难道我们就不能佩戴彩色（或透明）的珠宝形状的玻璃...",
      "title": "如果我们只是用玻璃代替珍贵的珠宝呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，關於碧昂斯和其他一些名人佩戴著名的黃鑽的爭議。\n名人，佩戴了一顆著名的黃鑽，而這顆黃鑽（就像每顆鑽石一樣\n這顆鑽石（就像所有的鑽石一樣，顯然）有一個非常黑暗的、不道德的奴隸礦場的起源。\n\n所以我想，難道我們就不能佩戴彩色（或透明）的珠寶形狀的玻璃...",
      "title": "如果我們只是用玻璃代替珍貴的珠寶呢？"
    }
  ]
}