{
  "author": "Creepy-Purchase-5630",
  "original_created_utc": 1628374591,
  "title": "I posted in late May about taking my excess cash from my business and buying BTC. I started to dca every week for 2.5 months. Here’s how it’s working. Spammers don’t waste your time.",
  "created_utc": 1628407907,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started out when BTC entered the upper 30’s and felt good I hadn’t started doing this in April. Instead of dollar cost averaging a set dollar amount I averaged buying .08 Bitcoin per week.(I know talking specifics is dangerous but I wanted other business owners to see the power of investing in BTC). I have accumulated .81 BTC in just under 3 months for $28,000. Today that investment sits at $36,000. Regardless of the current price, letting my money sit in a bank account was no longer an option. And luckily my partner agreed. </p>\n\n<p>I learned about business’ investing in BTC after talking with a proprietor of a dispensary in Colorado. He was not given the option to bank under American federal law. Like so many in the third world who are unbanked, he found Bitcoin. </p>\n\n<p>Thank you for all the sound advice I’ve learned from <a href=\"/r/bitcoin\">r/bitcoin</a>. Such a great resource I’ve found in your posts and comments.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/Bitcoin/comments/p02m5n/i_posted_in_late_may_about_taking_my_excess_cash/",
  "subreddit": "Bitcoin",
  "id": "p02m5n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I started out when BTC entered the upper 30’s and felt good I hadn’t started\ndoing this in April. Instead of dollar cost averaging a set dollar amount I\naveraged buying .08 Bitcoin per week.(I know talking specifics is dangerous but\nI wanted other business owners to see the power of investing in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCが30円台後半になった時に始めて、4月からやらなくて良かったと思った。\n4月からやっていてよかったと思いました。決められた金額のドルコスト平均法ではなく、私は週に0.08ビットコインを平均的に購入しました。\n週に0.08ビットコインを平均して購入しています。\n私は、他のビジネスオーナーにもビットコインへの投資の力を知ってもらいたいと思いました。",
      "title": "私は5月下旬に、ビジネスで余ったキャッシュを使ってBTCを購入することを投稿しました。私は2.5ヶ月間、毎週dcaを始めました。その効果は以下の通りです。スパマーはあなたの時間を無駄にしません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是在BTC进入30点以上时开始的，感觉很好，我没有在4月份开始\n在4月份开始做这个。我没有采用美元成本平均法，而是采用了一个固定的美元数额。\n平均每周购买0.08个比特币（我知道谈论具体细节是很危险的，但我想让其他企业主了解一下。\n我想让其他企业主看到投资的力量。",
      "title": "我在5月下旬发布了关于从我的生意中拿出多余的现金购买BTC的帖子。我开始每周dca，为期2.5个月。下面是它的工作原理。垃圾邮件制造者不会浪费你的时间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是在BTC進入30點以上時開始的，感覺很好，我沒有在4月份開始\n在4月份開始做這個。我沒有采用美元成本平均法，而是採用了一個固定的美元數額。\n平均每週購買0.08個比特幣（我知道談論具體細節是很危險的，但我想讓其他企業主瞭解一下。\n我想讓其他企業主看到投資的力量。",
      "title": "我在5月下旬發佈了關於從我的生意中拿出多餘的現金購買BTC的帖子。我開始每週dca，爲期2.5個月。下面是它的工作原理。垃圾郵件製造者不會浪費你的時間。"
    }
  ]
}