{
  "author": "sikeig",
  "original_created_utc": 1630748080,
  "title": "Could Crypto get to a point where it’s a Bubble?",
  "created_utc": 1630774056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Crypto mainstream adoption equals more and more like a new fancy way for Gen Z investing. — My question is: <strong>If the majority isn’t even using the blockchain technology, and is investing in it to simply profit off it, can it lead to a bubble?</strong></p>\n\n<ul>\n<li><p>The majority of Crypto isn’t even on-chain anymore. Most of the transactions are off-chain.</p></li>\n<li><p>New users don’t even want to understand the technology and the usefulness behind Crypto.</p></li>\n<li><p>Mainstream adoption means relying mainly on centralized solutions, regarding storage and security.</p></li>\n<li><p>Blockchain technology will probably be unnecessarily implemented in industries where other tech solutions are more efficient.</p></li>\n</ul>\n\n<p>I think in the future this could potentially play out like the dotcom bubble. That cryptocurrencies become so overvalued for the simple fact, that they are cryptocurrencies, “the new big thing”.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/phoh1o/could_crypto_get_to_a_point_where_its_a_bubble/",
  "subreddit": "CryptoCurrency",
  "id": "phoh1o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Crypto mainstream adoption equals more and more like a new fancy way for Gen Z\ninvesting. — My question is: If the majority isn’t even using the blockchain\ntechnology, and is investing in it to simply profit off it, can it lead to a\nbubble?\n\n * The majority of Crypto isn’t even on-chain anymore.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の主流化は、Z世代の新しいファンシーな方法になってきています。\n投資をすることになります。- 私が疑問に思うのは、大多数の人がブロックチェーン技術を利用していないのに、単に利益を得るために投資しているとしたら\n技術を利用しておらず、単に利益を得るために投資しているとしたら、それはバブルにつながるのでしょうか？\nバブルになるのか？\n\n * 大多数のCryptoは、もうオンチェーンでさえありません....",
      "title": "暗号がバブルになる可能性は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币的主流采用等于是越来越像Z世代的一种新的花式投资方式。\n投资。- 我的问题是：如果大多数人甚至没有使用区块链\n技术，而投资它只是为了从中获利，那么它是否会导致一个\n泡沫？\n\n *大多数的加密货币甚至没有在链上，....。",
      "title": "Crypto会不会到了成为泡沫的地步？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣的主流採用等於是越來越像Z世代的一種新的花式投資方式。\n投資。- 我的問題是：如果大多數人甚至沒有使用區塊鏈\n技術，而投資它只是爲了從中獲利，那麼它是否會導致一個\n泡沫？\n\n *大多數的加密貨幣甚至沒有在鏈上，....。",
      "title": "Crypto會不會到了成爲泡沫的地步？"
    }
  ]
}