{
  "author": "Pixeth_",
  "original_created_utc": 1637096166,
  "title": "If you believed enough to invest in the first place, dips like these shouldn't concern you",
  "created_utc": 1637116252,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know it&#39;s easier said than done, and, really, this sub has been a great source of calm this time around - but I&#39;m sure there are many here questioning their convictions after seeing red for the first time in a while.</p>\n\n<p>Just think about why you invested money in the first place: presumably you bought because you were convinced about crypto&#39;s long term success. If you put money into the top projects, whose movements effectively dictate the movements of the rest of the market, why should this dip concern you? Nothing ever keeps going up forever: the only thing that matters is the long term outlook, which is pretty good considering the way we&#39;re driving towards adoption and the level of attention on the market. Crypto isn&#39;t going away any time soon.</p>\n</div><!-- SC_ON -->",
  "score": 181,
  "permalink": "/r/CryptoCurrency/comments/qvhvv8/if_you_believed_enough_to_invest_in_the_first/",
  "subreddit": "CryptoCurrency",
  "id": "qvhvv8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know it's easier said than done, and, really, this sub has been a great source\nof calm this time around - but I'm sure there are many here questioning their\nconvictions after seeing red for the first time in a while.\n\nJust think about why you invested money in the first place: presumably…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "言うは易し、行うは難しで、今回はこのサブが心の拠り所になっていました。\nしかし、多くの人が自分の信念に疑問を持っていることでしょう。\nしかし、久しぶりに赤を見て、自分の信念に疑問を持った人も多いはずです。\n\nただ、そもそもなぜお金を投資したのかを考えると、おそらく...",
      "title": "投資をするほどの信念を持っていれば、このような下落は気にならないはずです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道说起来容易做起来难，而且，真的，这个潜水艇一直是一个伟大的源泉。\n但我相信这里有很多人在一段时间内第一次看到红色后，对自己的信念产生了怀疑。\n但我相信这里有很多人在第一次看到红色后质疑自己的信念。\n\n只要想一想你当初为什么要投钱：大概...",
      "title": "如果你一开始就有足够的信心进行投资，像这样的下跌不应该让你担心"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道說起來容易做起來難，而且，真的，這個潛水艇一直是一個偉大的源泉。\n但我相信這裏有很多人在一段時間內第一次看到紅色後，對自己的信念產生了懷疑。\n但我相信這裏有很多人在第一次看到紅色後質疑自己的信念。\n\n只要想一想你當初爲什麼要投錢：大概...",
      "title": "如果你一開始就有足夠的信心進行投資，像這樣的下跌不應該讓你擔心"
    }
  ]
}