{
  "author": "HowIsBuffakeeTaken",
  "original_created_utc": 1652818948,
  "title": "How can biologists (or entemologists) definitively tell whether an insect like an ant is dead or not?",
  "created_utc": 1652858401,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Some insects can just lie dormant for days, and don&amp;#39;t visibly look alive. Are there things like EKG&amp;#39;s for insects? Or are other signs used to determine this?&lt;/p&gt;\n\n&lt;p&gt;Just for background, I have absolutely no background in advanced biology or entemology, but I looked up for answers online and didn&amp;#39;t find any. Apologies if this is a stupid question!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/urvfif/how_can_biologists_or_entemologists_definitively/",
  "subreddit": "askscience",
  "id": "urvfif",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Some insects can just lie dormant for days, and don't visibly look alive. Are\nthere things like EKG's for insects? Or are other signs used to determine this?\n\nJust for background, I have absolutely no background in advanced biology or\nentemology, but I looked up for answers online and didn't find…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昆虫の中には、何日も休眠しているだけで、見た目には生きているように見えないものもあります。昆虫にも心電図のようなものがあるのでしょうか？\n昆虫の心電図みたいなものはあるのでしょうか？あるいは、他のサインで判断するのでしょうか？\n\n私は高度な生物学や昆虫学の知識は全くないのですが、一応調べてみました。\nネットで調べてみたのですが...",
      "title": "生物学者（昆虫学者）は、アリのような昆虫が死んでいるかどうかを、どのようにして明確に判断するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有些昆虫可能只是休眠了几天，并没有明显的生命迹象。是否有\n有类似于昆虫心电图的东西吗？或者是用其他的迹象来判断吗？\n\n只是为了说明背景，我完全没有高级生物学或昆虫学的背景。\n昆虫学，但我在网上查找了答案，没有找到...",
      "title": "生物学家（或昆虫学家）如何能明确地判断像蚂蚁这样的昆虫是否已经死亡？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有些昆蟲可能只是休眠了幾天，並沒有明顯的生命跡象。是否有\n有類似於昆蟲心電圖的東西嗎？或者是用其他的跡象來判斷嗎？\n\n只是爲了說明背景，我完全沒有高級生物學或昆蟲學的背景。\n昆蟲學，但我在網上查找了答案，沒有找到...",
      "title": "生物學家（或昆蟲學家）如何能明確地判斷像螞蟻這樣的昆蟲是否已經死亡？"
    }
  ]
}