{
  "author": "muybienfrutas",
  "original_created_utc": 1625493903,
  "title": "Monero is private, anonymous and fungible money.",
  "created_utc": 1625524576,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The majority of articles I’ve read regarding REvil did not mention Monero even once.</p>\n\n<p>Monero is dominating in the DNM’s and is now becoming the dominant form of payment for ransomware.</p>\n\n<p>Monero is and I stress IS private, anonymous and fungible digital money currently working in real time without fail.</p>\n\n<p>Monero works and as far as I can tell it is being suppressed in media because it works. No one wants to advertise a new private, anonymous and fungible digital money that works for criminals.</p>\n\n<p>We have a world changing technology that works and normal people have no clue about it and its starting to enter the mainstream. </p>\n\n<p>The genie is out of the bottle.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/CryptoCurrency/comments/oe8237/monero_is_private_anonymous_and_fungible_money/",
  "subreddit": "CryptoCurrency",
  "id": "oe8237",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The majority of articles I’ve read regarding REvil did not mention Monero even\nonce.\n\nMonero is dominating in the DNM’s and is now becoming the dominant form of\npayment for ransomware.\n\nMonero is and I stress IS private, anonymous and fungible digital money\ncurrently working in real time without…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が読んだREvilに関する記事の大半は、モネロについて一度も言及していませんでした。\n一度もです。\n\nモネロはDNMの中で支配的であり、今ではランサムウェアの支払いの主流になりつつある。\nランサムウェアの支払いの主流になりつつあります。\n\nMoneroはプライベートで、匿名で、偽造可能なデジタルマネーである。\n現在、リアルタイムで動作しています...",
      "title": "Moneroは、プライベートで、匿名性があり、ファンジブルなお金です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读过的大多数关于REvil的文章都没有提到Monero，甚至一次都没有。\n一次。\n\nMonero在DNM中占主导地位，现在正成为勒索软件的主要支付形式。\n赎金软件的主要支付方式。\n\nMonero是，我强调是私人的、匿名的、可替换的数字货币。\n目前在实时工作，没有...",
      "title": "Monero是私人的、匿名的和可替换的货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀過的大多數關於REvil的文章都沒有提到Monero，甚至一次都沒有。\n一次。\n\nMonero在DNM中占主導地位，現在正成爲勒索軟件的主要支付形式。\n贖金軟件的主要支付方式。\n\nMonero是，我強調是私人的、匿名的、可替換的數字貨幣。\n目前在實時工作，沒有...",
      "title": "Monero是私人的、匿名的和可替換的貨幣。"
    }
  ]
}