{
  "author": "windrider103",
  "original_created_utc": 1643357773,
  "title": "Why is cultural appropriation considered a bad thing ?",
  "created_utc": 1643378755,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really get the idea why people are against sharing each other&amp;#39;s cultures. As an Indian, if I see an American lady wearing saree, I&amp;#39;d be really proud of my culture, if a Christian wants to learn about the Ramayana and Mahabharata, I&amp;#39;ll gladly teach them, It makes me proud that my diverse culture is being adopted by so many amazing people. I don&amp;#39;t understand why that&amp;#39;s an issue. Why are people bitchy and sensitive about it ?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/selth2/why_is_cultural_appropriation_considered_a_bad/",
  "subreddit": "NoStupidQuestions",
  "id": "selth2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't really get the idea why people are against sharing each other's\ncultures. As an Indian, if I see an American lady wearing saree, I'd be really\nproud of my culture, if a Christian wants to learn about the Ramayana and\nMahabharata, I'll gladly teach them, It makes me proud that my diverse…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、なぜ人々がお互いのものを共有することに反対するのか、その考えがよくわかりません。\n文化があります。インド人として、もしアメリカ人の女性がサリーを着ているのを見たら、とても嬉しく思います。\nもし、クリスチャンがラーマーヤナやアッラーを学びたければ、自分の文化に誇りを持つことです。\nマハーバーラタ』なら喜んで教えてあげます。",
      "title": "なぜ文化的流用は悪いことだと考えられているのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不太明白为什么人们反对分享彼此的文化\n文化。作为一个印度人，如果我看到一位美国女士穿着纱丽，我真的会为我的文化感到骄傲。\n如果一个基督徒想了解《罗摩衍那》和《摩诃婆罗多》，我很乐意教他们。\n如果一个基督徒想了解《罗摩衍那》和《摩诃婆罗多》，我很乐意教他们，这让我感到自豪，我的多元化...",
      "title": "为什么文化盗用被认为是一件坏事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不太明白爲什麼人們反對分享彼此的文化\n文化。作爲一個印度人，如果我看到一位美國女士穿着紗麗，我真的會爲我的文化感到驕傲。\n如果一個基督徒想了解《羅摩衍那》和《摩訶婆羅多》，我很樂意教他們。\n如果一個基督徒想了解《羅摩衍那》和《摩訶婆羅多》，我很樂意教他們，這讓我感到自豪，我的多元化...",
      "title": "爲什麼文化盜用被認爲是一件壞事？"
    }
  ]
}