{
  "author": "3picEmuBoy",
  "the_new_excerpt": "Good afternoon\n\nThe current market has some obvious similarities with the internet bubble in the\n2000s at the moment:\n\n1) Sectoral bubble\n\nElectric Vehicle stocks, Renewable energy stocks, crypto and possibly even\nfintech stocks have skyrocketed to insane levels in 2020. A PE ratio of 100-200\nfor…",
  "original_created_utc": 1610205246,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "下午好\n\n当前的市场与互联网泡沫在以下几个方面有明显的相似之处\n目前的21世纪头10年：\n\n1)行业泡沫\n\n电动汽车股票，可再生能源股票，密码，甚至可能\n金融科技的股票在2020年飙升到了疯狂的水平。市盈率在100-200之间\n对于…",
      "title": "1999年又重演了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "下午好\n\n當前的市場與互聯網泡沫在以下幾個方面有明顯的相似之處\n目前的21世紀頭10年：\n\n1)行業泡沫\n\n電動汽車股票，可再生能源股票，密碼，甚至可能\n金融科技的股票在2020年飆升到了瘋狂的水平。市盈率在100-200之間\n對於…",
      "title": "1999年又重演了嗎？"
    }
  ],
  "title": "1999 all over again?",
  "created_utc": 1610212620,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good afternoon</p>\n\n<p>The current market has some obvious similarities with the internet bubble in the 2000s at the moment:</p>\n\n<p>1) Sectoral bubble</p>\n\n<p>Electric Vehicle stocks, Renewable energy stocks, crypto and possibly even fintech stocks have skyrocketed to insane levels in 2020. A PE ratio of 100-200 for stocks in these sectors is considered &quot;cheap&quot; right now, that&#39;s what &quot;investors&quot; before the dotcom crash thought aswell.</p>\n\n<p>2) Historic low interest rates</p>\n\n<p>This is the biggest catalyst for the creation of an insane bubble, very low interest rates. Just like in the 2000s, we currently have historic low interest rates, which makes stocks the only game in town. The big myth here is that people think stocks only go up, with interest rates close to 0. That&#39;s absolutely not true and that&#39;s the scary part in my opinion, because even professionals and analysts think that. The market doesn&#39;t stay disconnected from the economy forever.</p>\n\n<p>3) IPO mania and speculation</p>\n\n<p>We haven&#39;t seen more IPO&#39;s in 2020 since the dotcom bubble. This on itself isn&#39;t a big deal, but the valuations these IPO&#39;s get are beyond insanity. Any company that gets linked to EV in some way, automatically gets a 100%+ boost to their stock price, without even having a product or sales number. 1999 all over again?</p>\n\n<p>4) &quot;New paradigm&quot;</p>\n\n<p>Let&#39;s be honest, at least 80% of the people in any financial subreddit (excluding WSB, +-99% there) thinks that Tesla is the new paradigm that will take over the world. Trust me, it is not. I&#39;ve been doing some math on Tesla valuation, and I have no fitting word for its current valuation. I won&#39;t go in the details why, because I could write a whole book about this. I still firmly believe that growing positive cashflows should be the main catalyst of a stock that goes up, and a company with a negative cashflow (THAT ONLY GROWS AT A 25% RATE) shouldn&#39;t get a 1t valuation, that&#39;s too disrespectful for companies such as Google, Microsoft, Amazon and Apple.</p>\n\n<p>5) Greed and FOMO</p>\n\n<p>Everyone wants to jump on this train, no one wants to miss out, but I can assure you, these valuations are absurd and those who can&#39;t get out early enough, will be left holding the (empty) bag.</p>\n\n<p>Kind regards and stay safe (physically and financially)</p>\n</div><!-- SC_ON -->",
  "score": 862,
  "permalink": "/r/investing/comments/ktslbf/1999_all_over_again/",
  "subreddit": "investing",
  "id": "ktslbf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379509
}