{
  "author": "zomskii",
  "original_created_utc": 1646742810,
  "title": "Are there examples of authoritarian governments using urban planning to deter protest or revolution?",
  "created_utc": 1646781808,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In The Age of Revolution, Eric Hobsbawm writes “The decisive importance of the capitals was universally accepted, though it was not until after 1848 that governments began to replan them in order to facilitate the operation of troops against revolutionaries.”&lt;/p&gt;\n\n&lt;p&gt;Reading this, I was curious to learn which cities he might be talking about. Other than &lt;a href=\"https://en.wikipedia.org/wiki/Haussmann%27s_renovation_of_Paris#The_debate_about_the_military_purposes_of_Haussmann&amp;#x27;s_boulevards\"&gt;the debate on the boulevards of Paris&lt;/a&gt;, I couldn’t find any examples.&lt;/p&gt;\n\n&lt;p&gt;So, are there examples of authoritarian governments using urban planning to deter protest or revolution? Did city design impact the success or failure of any subsequent rebellion?&lt;/p&gt;\n\n&lt;p&gt;I’d be interested in either the European monarchies of the 19th century, or perhaps dictators of the 20th.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/t9fu6d/are_there_examples_of_authoritarian_governments/",
  "subreddit": "AskHistorians",
  "id": "t9fu6d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In The Age of Revolution, Eric Hobsbawm writes “The decisive importance of the\ncapitals was universally accepted, though it was not until after 1848 that\ngovernments began to replan them in order to facilitate the operation of troops\nagainst revolutionaries.”\n\nReading this, I was curious to learn…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エリック・ホブズボームは、『革命の時代』の中で、「革命の決定的な重要性」について次のように書いている。\n首都は普遍的に受け入れられていたが、1848年以降になると\n政府は、軍隊の活動を容易にするために、それらの再配置を始めた。\n革命派に対抗するために\"\n\nこれを読んで、私は興味を持ちました・・・。",
      "title": "権威主義的な政府が、抗議や革命を抑止するために都市計画を利用した例はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在《革命时代》中，埃里克-霍布斯鲍姆写道：\"首都的决定性重要性被普遍接受。\n首都的决定性重要性已被普遍接受，尽管直到1848年之后，政府才开始重新规划首都，以方便军队的运作。\n政府才开始重新规划首都，以方便军队对革命者的行动。\n以方便对革命者的行动\"。\n\n读到这里，我很好奇地想了解...",
      "title": "是否有专制政府利用城市规划来阻止抗议或革命的例子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在《革命時代》中，埃裏克-霍布斯鮑姆寫道：\"首都的決定性重要性被普遍接受。\n首都的決定性重要性已被普遍接受，儘管直到1848年之後，政府纔開始重新規劃首都，以方便軍隊的運作。\n政府纔開始重新規劃首都，以方便軍隊對革命者的行動。\n以方便對革命者的行動\"。\n\n讀到這裏，我很好奇地想了解...",
      "title": "是否有專制政府利用城市規劃來阻止抗議或革命的例子？"
    }
  ]
}