{
  "author": "mlsbbe",
  "the_new_excerpt": "Previously, I've made my case for Fiverr, a company for freelancers, only last\nweek. Since my recommendation, the stock has grown from 270 to 320 as time of\nwriting. That's an ~20% increase. I believe the future of work will also be\n'online' as opposed to traditional 'in office'. The last year, the…",
  "original_created_utc": 1613194957,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "此前，我已经为Fiverr这个自由职业者的公司做了论证，只是上一次\n周。自从我的建议，该股已经从270增长到320，因为时间的。\n写作。这是一个约20%的增长。我相信未来的工作也会是\n'网上'，而不是传统的'办公室'。去年，...",
      "title": "下一个高成长蓝筹股。Paypal"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "此前，我已經爲Fiverr這個自由職業者的公司做了論證，只是上一次\n周。自從我的建議，該股已經從270增長到320，因爲時間的。\n寫作。這是一個約20%的增長。我相信未來的工作也會是\n'網上'，而不是傳統的'辦公室'。去年，...",
      "title": "下一個高成長藍籌股。Paypal"
    }
  ],
  "title": "The next high growth blue chip stock: Paypal",
  "created_utc": 1613224028,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Previously, I&#39;ve made my case for Fiverr, a company for freelancers, only last week. Since my recommendation, the stock has grown from 270 to 320 as time of writing. That&#39;s an ~20% increase. I believe the future of work will also be &#39;online&#39; as opposed to traditional &#39;in office&#39;. The last year, the coronavirus has only accelerated the shift to online-work.</p>\n\n<p>I now propose another stock, PayPal. What&#39;s my reasoning for this?  When you look at growth stocks, you also look at their suppliers.  For Tesla, for example, you look at who&#39;s supplying the batteries for electric cars and can bet on that as well.   The rise of Tesla and electric cars has created a halo effect, and the rise in their stocks for all of the industry.  </p>\n\n<p>Now, when you think of Fiverr, and the rise of companies based on online work, payment processing companies will benefit.  When you transact with freelancers half way across the world, we are looking at payment processing companies that serve as a method of  payment for your transaction.  The likes of Visa, Mastercard, and Paypal stand to benefit. Why specifically PayPal? </p>\n\n<p>Basically not only will PayPal stand to benefit from increased transactions as outlined above,  Paypal also looking to get into anything related to digital payments.  To quote,  PayPal has jumped into the mobile payments space with Venmo, which is now the most widely used mobile peer-to-peer payments app out there.  PayPal has also delved into cryptocurrencies, and now accepts cryptos on its payment platform. What’s more, the payments company is also jumping into more direct shopping and stock trading. </p>\n\n<p>Basically, it’s doing it all.  PayPal is turning into an all-in-one digital wallet for consumers. They are looking at doubling it&#39;s user-base and hence revenues.  It&#39;s parallel is Alibaba&#39;s Ant Financial. It&#39;s massive in China, and before the Chinese government clamped down on the IPO, it was looking to the biggest IPO in all history.</p>\n\n<p>If you are looking to place a blue-chip stock in your portfolio, I believe Paypal will the next best bet.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/investing/comments/liuccj/the_next_high_growth_blue_chip_stock_paypal/",
  "subreddit": "investing",
  "id": "liuccj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621133
}