{
  "author": "EastCommercial1811",
  "original_created_utc": 1649193009,
  "title": "Why people afraid to say Islam is a dangerous religion?",
  "created_utc": 1649205668,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m living in a Islamic country. I was a Muslim till 3 years ago, and now I&amp;#39;m an atheist. I have read quran verse by verse.&lt;/p&gt;\n\n&lt;p&gt;In an Islamic country, if you drink water in street in Ramadan, you can get arrested and they can imprison you, and beat you just because you were thirsty.&lt;/p&gt;\n\n&lt;p&gt;in Quran, a man is allowed to beat his wife just because she has refused to have sex with him. (And its said that women are your land, enter them freely any time you wanted.) ➡️An-Nisā - 34 / Al-Baqarah - 223&lt;/p&gt;\n\n&lt;p&gt;In Quran, you are allowed to have slaves.&lt;/p&gt;\n\n&lt;p&gt;In Quran, a women worths half  a man, and a woman&amp;#39;s testimony is equal to half of a man&amp;#39;s testimony, so you should bring 2 woman in a court of law so they belive you. ➡️ Al-Baqarah - 282&lt;/p&gt;\n\n&lt;p&gt;There are tons of other examples about how Islam violates human rights, and you can check them up.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just exhausted about the fact that West tries to show that Islam is the religion of peace, because its not.\nAlthough I&amp;#39;m not saying Muslim should be treated different than others, all I&amp;#39;m trying to say is that Islam is a dangerous religion, and you can simply be dead in an Islamic country just because you drank water in street in Ramadan.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so exhausted and angry that media tries to show a different picture of what Islam truly is. Atheists and other communities who are not Muslim have a hard time in Islamic countries, just because they think differently than Muslims. Please don&amp;#39;t be fooled of this picture, it&amp;#39;s a lie.&lt;/p&gt;\n\n&lt;p&gt;Homosexuals and every single community in LGBTQ+ flag, have literally no right in Islam, and worse, if they find out that your Homosexual or transgender, etc... they will either hang you, cut your hands or other tortures that lead to your death.&lt;/p&gt;\n\n&lt;p&gt;➡️ just look at this verse from An-Nisā in quran:\nMen are in charge of women. by what Allāh has given one over the other and what they spend from their wealth. So righteous women are devoutly obedient, guarding in [the husband&amp;#39;s] absence what Allāh would have them guard. But those [wives] from whom you fear arrogance [first] advise them; [then if they persist], forsake them in bed; and [finally], strike them. But if they obey you [once more], seek no means against them. Indeed, Allāh is ever Exalted and Grand. &lt;/p&gt;\n\n&lt;p&gt;And I&amp;#39;m sorry for my grammatical errors, I&amp;#39;m learning English and I&amp;#39;m not so good at writing.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 435,
  "permalink": "/r/TooAfraidToAsk/comments/tx58r3/why_people_afraid_to_say_islam_is_a_dangerous/",
  "subreddit": "TooAfraidToAsk",
  "id": "tx58r3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm living in a Islamic country. I was a Muslim till 3 years ago, and now I'm an\natheist. I have read quran verse by verse.\n\nIn an Islamic country, if you drink water in street in Ramadan, you can get\narrested and they can imprison you, and beat you just because you were thirsty.\n\nin Quran, a man…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はイスラムの国に住んでいます。3年前までイスラム教徒だったのですが、現在は\n無神論者です。私はコーランを一節ずつ読みました。\n\nイスラムの国では、ラマダンの時期に路上で水を飲んだりしたら\n喉が渇いたという理由だけで、逮捕され、投獄され、殴られることもある。\n\nコーランでは、男は...",
      "title": "なぜ人々はイスラム教が危険な宗教であると言うのを恐れるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我生活在一个伊斯兰国家。三年前我还是一个穆斯林，现在我是一个\n无神论者。我已经逐节阅读了《古兰经》。\n\n在一个伊斯兰国家，如果你在斋月里在街上喝水，你可能会被逮捕，他们会把你关进监狱，并把你关进监狱。\n逮捕，他们可以监禁你，打你，只因为你渴了。\n\n在古兰经中，一个人...",
      "title": "为什么人们害怕说伊斯兰教是一个危险的宗教？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我生活在一個伊斯蘭國家。三年前我還是一個穆斯林，現在我是一個\n無神論者。我已經逐節閱讀了《古蘭經》。\n\n在一個伊斯蘭國家，如果你在齋月裏在街上喝水，你可能會被逮捕，他們會把你關進監獄，並把你關進監獄。\n逮捕，他們可以監禁你，打你，只因爲你渴了。\n\n在古蘭經中，一個人...",
      "title": "爲什麼人們害怕說伊斯蘭教是一個危險的宗教？"
    }
  ]
}