{
  "author": "SolorMining",
  "the_new_excerpt": "Berkeley offers 4 courses on the subject, all free to access, 2 with\ncertificates. Berkeley has been involved with blockchain for quite a while, and\nhaving taken the classes myself I can confirm that they are quite informative on\nboth the cryptocurrency and the blockchain side of…",
  "original_created_utc": 1619652263,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バークレー校では、4つのコースを提供しており、すべて無料でアクセスでき、2つのコースには証明書が付いています。\nの証明書を発行しています。バークレー校では、かなり前からブロックチェーンに取り組んでいます。\n自分でも受講してみましたが、暗号通貨と暗号化技術の両方について非常に参考になりました。\n暗号通貨とブロックチェーンの両方の面で非常に有益であることが確認できます。",
      "title": "Crypto Currency and Blockchain Technologyに初めて触れる方のために、UC Berkeleyが提供する4つのコースをご紹介します。講座の資料は無料で公開されています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "伯克利大学提供了4门关于这个主题的课程，都是免费的，其中2门有证书。\n证书。伯克利大学参与区块链已经有一段时间了。\n我自己也参加了这些课程，我可以确认，这些课程在加密货币与区块链方面的内容相当丰富。\n加密货币和区块链方面的信息。",
      "title": "对于那些刚接触加密货币和区块链技术的人，这里有加州大学伯克利分校提供的4门课程。课程材料对公众免费开放。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "伯克利大學提供了4門關於這個主題的課程，都是免費的，其中2門有證書。\n證書。伯克利大學參與區塊鏈已經有一段時間了。\n我自己也參加了這些課程，我可以確認，這些課程在加密貨幣與區塊鏈方面的內容相當豐富。\n加密貨幣和區塊鏈方面的信息。",
      "title": "對於那些剛接觸加密貨幣和區塊鏈技術的人，這裏有加州大學伯克利分校提供的4門課程。課程材料對公衆免費開放。"
    }
  ],
  "title": "For those new to Crypto Currency and Blockchain Technology, here are 4 courses offered by UC Berkeley. Course materials are free to the public.",
  "created_utc": 1619667111,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Berkeley offers 4 courses on the subject, all free to access, 2 with certificates. Berkeley has been involved with blockchain for quite a while, and having taken the classes myself I can confirm that they are quite informative on both the cryptocurrency and the blockchain side of things.</p>\n\n<p><a href=\"https://blockchain.berkeley.edu/courses/\">https://blockchain.berkeley.edu/courses/</a></p>\n\n<p>2 are courses are offered through edX that have optional paid certificates available.</p>\n\n<p>2 are courses they offer through University that have publicly accessible course materials on their decal page.</p>\n</div><!-- SC_ON -->",
  "score": 973,
  "permalink": "/r/CryptoCurrency/comments/n0rm7p/for_those_new_to_crypto_currency_and_blockchain/",
  "subreddit": "CryptoCurrency",
  "id": "n0rm7p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776213355
}