{
  "author": "Content_Structure118",
  "the_new_excerpt": "Yep, I get it. Boomers aren't cool.  We are old, seemingly grumpy, not risk\ntakers, and old school. But please, give me a minute to make you think. We were\nonce college students or just young folks struggling to make it just like you.\n\nHere are some thoughts:\n\n 1. Keep your day job. (Or get a day…",
  "original_created_utc": 1621381653,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "うん、わかったよ。ブーマーはクールではありません。  私たちは年老いていて、不機嫌そうで、リスクを取らず\nリスクを取らないし、学校も古い。でも、ちょっとだけ考えてみてください。私たちはかつて\n私たちもかつては大学生だったし、あなたと同じように苦労していた若い人たちだったのです。\n\nここで、いくつか考えてみましょう。\n\n 1. 1.本業を続ける。(または、日雇いの仕事に就く...",
      "title": "暗号通貨にハマった本物のおばあちゃんから、若い/新しい暗号投資家へのアドバイス..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我明白了。婴儿潮一代并不酷。  我们老了，看起来脾气暴躁，不喜欢冒险\n承担风险，而且是老派。但是，请给我一分钟时间，让你思考。我们曾经是\n曾经是大学生，或者只是像你们一样在挣扎的年轻人。\n\n这里有一些想法。\n\n 1. 保持你的日常工作。(或者找一份日间工作。",
      "title": "年轻/新的加密货币投资者的提示，从一个真正的奶奶进入加密货币..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我明白了。嬰兒潮一代並不酷。  我們老了，看起來脾氣暴躁，不喜歡冒險\n承擔風險，而且是老派。但是，請給我一分鐘時間，讓你思考。我們曾經是\n曾經是大學生，或者只是像你們一樣在掙扎的年輕人。\n\n這裏有一些想法。\n\n 1. 保持你的日常工作。(或者找一份日間工作。",
      "title": "年輕/新的加密貨幣投資者的提示，從一個真正的奶奶進入加密貨幣..."
    }
  ],
  "title": "Tips for Young/New Crypto Investors from a Real Grandma into Cryptocurrency...",
  "created_utc": 1621395888,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yep, I get it. Boomers aren&#39;t cool.  We are old, seemingly grumpy, not risk takers, and old school. But please, give me a minute to make you think. We were once college students or just young folks struggling to make it just like you.   </p>\n\n<p>Here are some thoughts:   </p>\n\n<ol>\n<li>Keep your day job. (Or get a day job!) Mine fiat by hard work every day to invest in cryptocurrency if that&#39;s your goal. Work hard and efficiently.<br/></li>\n</ol>\n\n<p>You&#39;ll be happier working - I don&#39;t care how many people want to stay home and do nothing. You&#39;ll get bored. Or depressed. Or start drinking. I promise, it&#39;s not all roses having no purpose in life. \nAs <a href=\"/u/antonito901\">u/antonito901</a> wrote in a good article on this sub, Crypto = Great. Crypto + a Job = Wonderful!   </p>\n\n<ol>\n<li><p>Even if you get your moon, stay in school or build your dream.  Start a business, do what you love - not what you&#39;re told to love;  go to trade school or college, even the school of hard knocks. Just get educated, wherever, however, you can. Money is not the goal...a better life is.   </p></li>\n<li><p>Your 20&#39;s, 30&#39;s and 40s may take you far from family and loved ones, but work hard to keep connected with them as they will become even more important to you with each passing decade. (Not crypto advice but living advice!)   </p></li>\n<li><p>Investing is risky. Don&#39;t invest what you don&#39;t have. Pay off debt (I learned this the hard way) and your life will be so much more worry free and happier. Buy necessities such as a simple car or house before that Lambo. Only risk what you can afford to lose. Don&#39;t dabble in meme coins unless you have lots of extra money you can afford to throw around.   </p></li>\n</ol>\n\n<p>5.  Getting Rich Quick is usually a scam. If it were easy,  why doesn&#39;t everyone do it? Stay away from poo coins. Don&#39;t get angry when older people suggest that meme coins have no long term value. Most or all will not. Even Doge&#39;s time will come, it will grow old and out of people&#39;s minds unless it quickly develops more use cases.  Stay off CryptoMoonShots.   </p>\n\n<p>Finally, failure is okay, even in Crypto. Each investment will teach you a lesson. Each time you sell will give you information. You twenty and thirty somethings have a LIFE CHANGING opportunity with cryptocurrencies. Remember it might take time,  don&#39;t sell on a whim or a worry.   </p>\n\n<p>Good luck, I hope you each reach your moons, no matter what it is!</p>\n</div><!-- SC_ON -->",
  "score": 3562,
  "permalink": "/r/CryptoCurrency/comments/nfq1jd/tips_for_youngnew_crypto_investors_from_a_real/",
  "subreddit": "CryptoCurrency",
  "id": "nfq1jd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801360
}