{
  "author": "deathtolucky",
  "original_created_utc": 1633885545,
  "title": "To everyone who says that crypto is a scam or a Ponzi scheme: I present to you, the modern economy.",
  "created_utc": 1633948825,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Banks are currently allowed to loan $10 for every dollar they actually possess, which means that 90% of all the money in our bank accounts is not covered by actual coins or notes. Yes, you read that right. If this seems surprising to you or if it seems like a giant house of cards waiting to collapse, it’s because it is. </p>\n\n<p>Why would they be allowed to do this you may ask? It’s the same thing that enables the entire financial system and economy to survive and flourish; collective trust in the future. The problem is people are losing faith in the future and becoming disillusioned. The days are fading fast where people believe that if they work hard, pull themselves up by their bootstraps and do their daily grind, they can attain a life they dream of. </p>\n\n<p>If it sounds like banks are operating under a different set of rules and regulations that appear to be a giant Ponzi scheme, then that would have to mean that the entire modern economy is a fraud. This fact seemed incomprehensible to people for years. But not anymore. People are waking up to this fact and they’re tired of it. </p>\n\n<p>Take control your own future. Take control of your own finances. Take control of your life back. HODL crypto.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/q5c412/to_everyone_who_says_that_crypto_is_a_scam_or_a/",
  "subreddit": "CryptoCurrency",
  "id": "q5c412",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Banks are currently allowed to loan $10 for every dollar they actually possess,\nwhich means that 90% of all the money in our bank accounts is not covered by\nactual coins or notes. Yes, you read that right. If this seems surprising to you\nor if it seems like a giant house of cards waiting to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "銀行は現在、実際に保有している1ドルに対して10ドルの融資が認められています。\nつまり、私たちの銀行口座にあるお金の90％は、実際の硬貨や紙幣でカバーされていないのです。\nていないことになります。そうです、その通りです。意外に思われるかもしれませんが\nあるいは、巨大なトランプの家が待っているかのように思われるかもしれません。",
      "title": "暗号は詐欺だとか、ネズミ講だとか言っている人たちへ。私はあなたに現代経済を紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，银行被允许为其实际拥有的每一美元贷款10美元。\n这意味着我们银行账户中90%的钱都不是由\n实际的硬币或纸币。是的，你没看错。如果这对你来说似乎令人惊讶\n或者如果它看起来像一个巨大的纸牌屋，等待...",
      "title": "对于每个说加密货币是一个骗局或庞氏骗局的人。我向你们介绍，现代经济。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，銀行被允許爲其實際擁有的每一美元貸款10美元。\n這意味着我們銀行賬戶中90%的錢都不是由\n實際的硬幣或紙幣。是的，你沒看錯。如果這對你來說似乎令人驚訝\n或者如果它看起來像一個巨大的紙牌屋，等待...",
      "title": "對於每個說加密貨幣是一個騙局或龐氏騙局的人。我向你們介紹，現代經濟。"
    }
  ]
}