{
  "author": "keanu4EvaAKitten",
  "original_created_utc": 1643555328,
  "title": "Why the Lightning Network is the most important thing in Bitcoin right now.",
  "created_utc": 1643625673,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Here are five reasons for the title´s claim, ordered from most the significant to the least.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1.&lt;/strong&gt; &lt;strong&gt;Increases decentralization&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;To run a Lightning Node, you have to also be running a fully synced Bitcoin Core node. This simple technical requirement means that the number of full Bitcoin nodes is going to explode. Bitcoin  nodes are the most important part of the network since they enforce the consensus rules. Therefore, the more nodes, the better level of the decentralization and the more immune the Bitcoin Network will be to consensus rules change as we saw during the Blocksize war. For example, if someone wanted to change our beloved 21 million fixed supply, they would have to convince a substantial majority of people. The more nodes and the more spread out they are across the globe, the more impossible this tasks becomes.&lt;/p&gt;\n\n&lt;p&gt;However, I&amp;#39;ve always felt that the incentives for an individual running a Bitcoin Node were never that strong. It was always sold as “&lt;em&gt;having full sovereignty over your transactions by not needing to be trust any third party&lt;/em&gt;.” But this is only going to convince a small group of people. A second argument that does have a bit more reach is the altruistic argument, “&lt;em&gt;you should run a bitcoin node to help out the network&lt;/em&gt;.” Many hardcore bitcoiners probably run their nodes for this reason, but it is not a sustainable value proposition for the long term and won´t allow us to reach the insanely high level of decentralization mandated by a global trustless currency.&lt;/p&gt;\n\n&lt;p&gt;I believe the incentives for running a Lightning Node, which implies running a Bitcoin Node under the hood, are far far stronger. First of all, if you are an individual or medium to large business that is going to be making and/or receiving a lot of transactions, you can use your own lightning node to make sure you&amp;#39;ll always be playing lowest possible fees. As a merchant with your own node, you can make sure your customers will pay the minimum fees for buying one of your products or if you are paying suppliers you can ensure that your node will search for the shortest route and minimize your fees paid. You can of course use a free custodial third party that avoids the hassle of installing your own lightning node but you will end up paying higher fees over the long run, that&amp;#39;s how they make their money of course. So a very simple and selfish incentive emerges: people will run lightning nodes so that they can save money. A time tried incentive that is pretty effective.&lt;/p&gt;\n\n&lt;p&gt;But an even stronger incentive than saving money is making money. Many people already run what are called routing nodes, with the only purpose of routing payments and taking a small fee every time. This is in fact the main reason why people are interested in running a Lightning node in order to generate a small secondary income stream.&lt;/p&gt;\n\n&lt;p&gt;Finally, the third selfish incentive is that for some sad nerdy people, like myself, running a node actually is fun! There is a growing group of hobbyists that enjoy maintaining their nodes and participating in the network as a whole, just check out &lt;a href=\"https://plebnet.wiki/wiki/Welcome_to_Plebnet\"&gt;PlebNet &lt;/a&gt;for proof of this. Unlike running a simple Bitcoin node where you simply get it up and running and then just watch it sit there, running a Lightning Network involves active maintanance by rebalancing channels or figuring which nodes to connect to. This community involvement effect has definitely been a driver for adoption.&lt;/p&gt;\n\n&lt;p&gt;These three incentives are much stronger than anything preceding them, and it simply means that many more people will want to run a Lightning note and therefore as a by-product they will also be running a Bitcoin node, whether they want to or not and whether they even know it or not. The end result is a far more decentralized network which will take Bitcoin´s most valuable attribute, decentralization, to a whole new level.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2. Solves the privacy tradeoff&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The criticism that both Edward Snowden and Eric Weinstein have made of Bitcoin, which is for me the only reasonable criticism of the protocol I have heard, is its lack of privacy on the base layer. The issue is that there needs to be a public record for every transaction as a by-product of having a decentralized blockchain. Buying Bitcoin without KYC is becoming increasingly a legal grey area, and the ability for people to track transactions threatens one of Bitcoin&amp;#39;s most important features: &lt;strong&gt;&lt;em&gt;fungibility&lt;/em&gt;&lt;/strong&gt;. If certain coins have a shady history, they might be worth less, while freshly mined coins can be sold at a premium. This is not good.&lt;/p&gt;\n\n&lt;p&gt;But the Lightning Network comes to the rescue.  When you open a Lightning channel, you are sending funds to a 2 of 2 multisig address and from there they do not move, &lt;strong&gt;ever&lt;/strong&gt;, until the channel is closed. With taproot now deployed, we will be able to able to hide that it&amp;#39;s a a multisig, so therefore hide that´s it&amp;#39;s problably a channel opening transaction. Lightning should be integrating this in the next few years &lt;/p&gt;\n\n&lt;p&gt;You transact on the Lightning network by exchanging and updating IOUs with your channel peer, as many times as required. This is 100% private, these transactions are fully within your custody and nobody can ever know how or what you spent your money on. Even nodes re-routing payments cannot know the sender and the receiver.&lt;/p&gt;\n\n&lt;p&gt;The Lightning Network does not increase the privacy of payment, it makes payments &lt;strong&gt;100% private&lt;/strong&gt;. &lt;strong&gt;Absolutely and unequivocally private&lt;/strong&gt;. End of.&lt;/p&gt;\n\n&lt;p&gt;This is an insane innovation when you think about it, not only are payments still permissionless and uncensorable, they are now also uncompromisingly private, no longer suffering from the trade-off of having to transact on a public ledger like the base Bitcoin layer does.&lt;/p&gt;\n\n&lt;p&gt;And my favourite part of this is that when you take your funds back onto the Bitcoin network, their traceability have also almost been entirely eliminated. Imagine that you buy 1m Satoshis from a fully KYC´ed exchange and then move your Sats from the exchange to your wallet and then from there you open a Lightning channel with a well-connected node in order to spend your Bitcoin. Let&amp;#39;s say you go on a bit of a shopping spree and you end up spending around 800K Satoshis. You decide that it would be wiser to save your remaining 200,000 sats by sending to your cold storage, so you close your Lightning channel, which means you move that amount from the multisig address to your cold wallet address. If you use a fresh address (which wallets will almost always generate automatically even if you are sending back to the same wallet), then there is absolutely no way on-chain analysis can know which UXTO is yours and which belongs to the other channel peer. They will see two transactions on the Blockchain with no idea which belongs to who. And funnily enough, if you spent the entire amount you put in to channel, when closing it there would only be one transaction on the blockchain and again nobody will know if those Sats are going back to you in or to the other owner of the node,  and so nobody knows if you spent the entirety o none of your coins. &lt;strong&gt;&lt;em&gt;What in essence you have done is an ad hoc CoinJoin which severs the relationship between your KYC account and your Bitcoin&lt;/em&gt;&lt;/strong&gt;. (As along as you do not use the same address as you opened the channel with, it goes without saying).&lt;/p&gt;\n\n&lt;p&gt;Even if the chain analysis makes the assumption that you spent all your Bitcoin,it is impossible for them to know what you spent it on and where those Satoshis now are.&lt;/p&gt;\n\n&lt;p&gt;Privacy solved.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3.  Makes every altcoin irrelevant&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;One way of understanding s*** coins  is to think of them as being a counterfeit copy of the Bitcoin protocole and token, pretending to offer a better or more specialized version of it when in reality they only dillute the value of Bitcoin´s market cap and serve as a very pesky distraction for many newcomers. This is an unfortunate consequence of Bitcoin´s open source nature, and the threat posed by s*** coins in the short to medium term is far larger than what many think.&lt;/p&gt;\n\n&lt;p&gt;However, the traction already garnered by the Lightning network and it&amp;#39;s capabilities really do put the shame all other coins that supposedly are solving Bitcoins scalability limitations. Many s*** coins sacrifice decentralization for more transactional efficiency. Meanwhile, the Lightning network achieves the highest speed of transaction at a ridiculously low costs without sacrificing in any shape or form the decentralized and secure properties of the underlying Bitcoin network. This makes other sh**coins completely irrelevant. And the number of users between both is an undeniable proof of this. &lt;strong&gt;Millions&lt;/strong&gt; of people use the Lightning network to make transactions &lt;strong&gt;everyday&lt;/strong&gt;. &lt;strong&gt;And when I say millions I am not exaggerating&lt;/strong&gt;. No other s*** coin even comes close to this number.&lt;/p&gt;\n\n&lt;p&gt;Another subset of sh** coins claim to use blockchain technologies for non-monetary use cases such as messaging or logistics or art. The whole Web 3.0 blurb. However, every single one of these ideas can be built far more easily on the Lightning network, and they already are. They are known as LAPPS. These are considered as layer 3 solutions and tackle specific problems. Of course many of these will fail just like in any free market but at least they won´t be stealing people&amp;#39;s money when doing so, since investing in these solutions will go through the traditional private market. There is no publicly available token for people to be swindled into buying.&lt;/p&gt;\n\n&lt;p&gt;Sphinx and Zion are a great example of this. Again I&amp;#39;m not saying that these are going to be successful, but they are proof that we do not need to be creating completely new chains and pouring capital into them in order to try use cases that by definition are aimed at a small niche of users. I really hope the Lightning Network exposes the Altcoin ecosystem for the inefficient capital draining and overhyped speculation that it really is. Smart entrepreneurs will soon understand that it is far cheaper and efficient to build and fail and iterate on the Lightning network. And in the long term, only smart entrepreneurs win.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;4. Offers a Proof-of-Stake Alternative&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This rarely gets mentioned, but it&amp;#39;s simple enough to understand. Imagine you could lock up your Bitcoin and get rewarded on a percentage basis for processing transactions. Sounds very much like proof of stake, right?&lt;/p&gt;\n\n&lt;p&gt;Well, the Lightning network offers you that option. Nodes can charge a small transaction fee for routing payments between unconnected nodes. This means you get a small financial reward for providing the liquidity the network needs. This offers pretty clear competition to what Ethereum is trying so hard and yet failing so far to implement. And unlike Ethereum, the Lightning´s network equivalent of staking is available today.&lt;/p&gt;\n\n&lt;p&gt;Imagine you were a large whale, and you wanted to earn a predictable yield on your Bitcoin &lt;strong&gt;while retaining custody&lt;/strong&gt; (this last bit is key). The Lightning Network, unlike anything else in the ecosystem, would allow you to do this. Right now the fees a node can obtain for routing are very low, but this is because for now supply outstrips demand, but if the Lightning Network´s adoption continues at the rate it&amp;#39;s at, then this will soon change.I can envision a near future where there are staking pools which groups together people&amp;#39;s liquidity to create a very well-connected routing node and collect fees, redistributing them out to their clients after taking a small commission for managing the node.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;5. Makes price volatility irrelevant.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Bitcoin&amp;#39;s critics cite volatility as an unsurmountable problem which means it will never become a viable currency , when in fact its volatility is just a temporary feature caused by its insanely fast monetization.But anyway, I understand the frustration of making an on-chain transaction and having to wait 6 confirmations (roughly 1 hour) during which Bitcoin´s fiat price could have drastically shifted. This is not great for international transactions or any circumstance where you are using Bitcoin as a bridge between two fiat currencies. (Far better than anything the legacy financial system can offer, mind you).&lt;/p&gt;\n\n&lt;p&gt;Again problem solved with the Lightning Network, the instantaneous nature of its transactions mean that you convert instantly in fiat, locking in your agreed price. Strike and &lt;a href=\"https://www.opennode.com/\"&gt;OpenNode&lt;/a&gt; have shown that this is a key advantage of using the Lightning Network around which they are building their business models.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How you can help&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So to close out, if this little post has got you more curious about the Lightning network, here are a few things you can do to help out.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Run your own node&lt;/strong&gt; (it´s fun I promise)&lt;/li&gt;\n&lt;li&gt;Show friends, families, local business how the Lightning Network works &lt;strong&gt;and give them a demonstration&lt;/strong&gt;. Most people are genuinely impressed by its speed and low transaction cost when they see it with their own eyes.&lt;/li&gt;\n&lt;li&gt;Contribute to open source code or &lt;strong&gt;create services for the growing community of node runners&lt;/strong&gt;. There is so much still to build.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Reimagine how existing services could be improved when powered by the Lightning Network&lt;/strong&gt;. Pay-Per-Second Podcasting, Reddit comment tipping with microSats, Fully custodial online poker… So many fun things to launch!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/Bitcoin/comments/sgb4si/why_the_lightning_network_is_the_most_important/",
  "subreddit": "Bitcoin",
  "id": "sgb4si",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Here are five reasons for the title´s claim, ordered from most the significant\nto the least.\n\n1. Increases decentralization\n\nTo run a Lightning Node, you have to also be running a fully synced Bitcoin Core\nnode. This simple technical requirement means that the number of full Bitcoin\nnodes is going…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以下、タイトルの主張する5つの理由を、重要度の高いものから順に紹介する。\nの順とした。\n\n1. 分散化の促進\n\nライトニングノードを動かすには、完全に同期したビットコインコア\nノードがあります。この単純な技術的要件は、完全なビットコインの数\nノードは、今後...",
      "title": "ライトニングネットワークが今ビットコインで最も重要な理由。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下是这个标题的五个理由，从最重要的角度排列\n到最小。\n\n1. 增加了分散性\n\n要运行一个闪电节点，你必须同时运行一个完全同步的Bitcoin Core\n节点。这个简单的技术要求意味着，完整的比特币\n节点的数量将...",
      "title": "为什么闪电网络是目前比特币中最重要的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是這個標題的五個理由，從最重要的角度排列\n到最小。\n\n1. 增加了分散性\n\n要運行一個閃電節點，你必須同時運行一個完全同步的Bitcoin Core\n節點。這個簡單的技術要求意味着，完整的比特幣\n節點的數量將...",
      "title": "爲什麼閃電網絡是目前比特幣中最重要的東西。"
    }
  ]
}