{
  "author": "LBJSmellsNice",
  "original_created_utc": 1654365944,
  "title": "Did every early civilization decide to name their cities? Or is that something we’ve done more recently to make them easier to discuss? I.e. would someone living in Ur say “I live in Ur” or just “I live in that city over there”?",
  "created_utc": 1654394224,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It just seems surprising that all early civilizations would independently come to the conclusion that a city needs a name, when it’s more or less a more densely populated area than the rest of the area. &lt;/p&gt;\n\n&lt;p&gt;(I guess what I’m saying is that I can see why a peoples or a culture or a general land would need a name, but specifically naming the city itself doesn’t strike me as something that would be as necessary)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 157,
  "permalink": "/r/AskHistorians/comments/v4udl8/did_every_early_civilization_decide_to_name_their/",
  "subreddit": "AskHistorians",
  "id": "v4udl8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It just seems surprising that all early civilizations would independently come\nto the conclusion that a city needs a name, when it’s more or less a more\ndensely populated area than the rest of the area.\n\n(I guess what I’m saying is that I can see why a peoples or a culture or a\ngeneral land would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ただ、初期の文明がすべて独立して生まれたというのは意外な気がします。\n都市には名前が必要だという結論に達したのは驚くべきことです。\n他の地域より人口密度の高い地域であるのに。\n\n(私が言いたいのは、民族や文化や一般的な土地が、なぜ\n一般的な土地は...",
      "title": "初期の文明はすべて、都市の名前を決めていたのだろうか？それとも、議論をしやすくするために、最近になってそうするようになったのでしょうか？例えば、ウルに住んでいる人が「私はウルに住んでいる」と言うでしょうか、それとも単に「私はあそこの街に住んでいる」と言うでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有的早期文明都能独立地得出 \"一个城市需要一个名字 \"的结论，这似乎令人惊讶。\n做出结论，认为一个城市需要一个名字，而它或多或少是一个更加\n它或多或少是一个比其他地区人口更稠密的地区。\n\n(我想我要说的是，我可以理解为什么一个民族或一个文化或一个\n一般的土地会...",
      "title": "是否每个早期文明都决定为其城市命名？还是说这是我们最近做的事情，使他们更容易讨论？例如，住在乌尔的人会说 \"我住在乌尔 \"还是 \"我住在那边的城市\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有的早期文明都能獨立地得出 \"一個城市需要一個名字 \"的結論，這似乎令人驚訝。\n做出結論，認爲一個城市需要一個名字，而它或多或少是一個更加\n它或多或少是一個比其他地區人口更稠密的地區。\n\n(我想我要說的是，我可以理解爲什麼一個民族或一個文化或一個\n一般的土地會...",
      "title": "是否每個早期文明都決定爲其城市命名？還是說這是我們最近做的事情，使他們更容易討論？例如，住在烏爾的人會說 \"我住在烏爾 \"還是 \"我住在那邊的城市\"？"
    }
  ]
}