{
  "author": "spinnyboiii",
  "original_created_utc": 1656168645,
  "title": "Why shouldn't personhood start at conception?",
  "created_utc": 1656240827,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Pro-lifers do not seem to care about the concept of &amp;quot;personhood&amp;quot; but rather just that human life is present.&lt;/p&gt;\n\n&lt;p&gt;Other than the example of abortion, where a persons bodily autonomy is removed in favor of a living human organism that is not a person, are there other problems that arise or ethical reasons why we shouldn&amp;#39;t just take the religious approach and say that personhood starts at conception?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/askphilosophy/comments/vkgnvk/why_shouldnt_personhood_start_at_conception/",
  "subreddit": "askphilosophy",
  "id": "vkgnvk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Pro-lifers do not seem to care about the concept of \"personhood\" but rather just\nthat human life is present.\n\nOther than the example of abortion, where a persons bodily autonomy is removed\nin favor of a living human organism that is not a person, are there other\nproblems that arise or ethical…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プロライファーたちは、「人らしさ」という概念には関心がないようで、むしろ、ただ\nを気にしないようです。\n\n中絶の例以外では、人の身体的な自律性が取り除かれることで\n人ではない生命体のために、その人の身体的な自律性を奪う中絶の例以外に、何か問題がありますか？\n倫理的な問題が発生するのでしょうか？",
      "title": "なぜ、受胎から人格が始まってはいけないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "支持堕胎者似乎并不关心 \"人格 \"的概念，而只是关心\n人的生命是存在的。\n\n除了堕胎的例子之外，一个人的身体自主权被剥夺了\n除了堕胎的例子，一个人的身体自主权被剥夺，而支持一个不是人的活生生的人类有机体，还有其他的问题吗？\n还有其他的问题出现吗？",
      "title": "为什么人的身份不应该从受孕开始？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "支持墮胎者似乎並不關心 \"人格 \"的概念，而只是關心\n人的生命是存在的。\n\n除了墮胎的例子之外，一個人的身體自主權被剝奪了\n除了墮胎的例子，一個人的身體自主權被剝奪，而支持一個不是人的活生生的人類有機體，還有其他的問題嗎？\n還有其他的問題出現嗎？",
      "title": "爲什麼人的身份不應該從受孕開始？"
    }
  ]
}