{
  "author": "Brojinacus",
  "original_created_utc": 1640208590,
  "title": "Loopring - Cash to crypto + general stealth",
  "created_utc": 1640223545,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I made the initial post on the loopring sub, but I figured a way to turn cash into crypto would be of general interest. this method does not completely avoid KYC, but I included the stealthiest way i found via bank, and you should be able to buy gift cards and use them on Ramp.&lt;/p&gt;\n\n&lt;p&gt;---&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Initially I went down this rabbit hole because i saw a post regarding Mexican culture in the US being primarily cash based because Illegal immigrants can open bank accounts. I did some digging and may have figured out some workarounds vs. direct bank/card to loopring.&lt;/p&gt;\n\n&lt;p&gt;I used Privacy.com linked to my bank account to mask the transaction from my bank successfully. I don&amp;#39;t believe you can currently fund a privacy.com account with a gift card, but it may be possible. it looks like they are adding future payment options, that might be one of them.&lt;/p&gt;\n\n&lt;p&gt;I do not fully understand the benefits of this, but ill be doing it.&lt;/p&gt;\n\n&lt;p&gt;I currently have a ledger Hardwallet, and you could possibly DOX yourself by going directly going from bank to your ledger address. I don&amp;#39;t know how ramps KYC works, but it may link that address to your verification. there&amp;#39;s unforeseen implications. The stealthier method would be: fiat onramp to free counterfactual wallet/loopring wallet, send to hardwallet on L2. the low fees should make that step negligible. i also plan on my counterfactual wallet being my &amp;quot;dummy&amp;quot; wallet in case of wrench attacks.&lt;/p&gt;\n\n&lt;p&gt;Ramp itself has a KYC, but it seems fairly low level. I&amp;#39;m not sure the tax implications, or how they operate with federals. if anyone could help me out let me know. but as far as i can tell, they would only have access to the data of the USD-ETH transfer at the moment of transfer. not any trades or gains made from trades. i haven&amp;#39;t figured out an off-ramp yet, but lets say you transfer and sell on Coinbase, and theres no record of gains, how will it be taxed? real question.&lt;/p&gt;\n\n&lt;p&gt;as far as turning cash into crypto... it looks like you can buy a visa gift card, and register it online with you mailing address. that mailing address becomes the billing address. you have to undergo the RAMP KYC, but you can use national documents, drivers license, and passports. and you should be good to go.&lt;/p&gt;\n\n&lt;p&gt;one step further into stealth: UPS rents mailboxes that count as legal home addresses. [redacted for illegal activities regarding fake IDs and mailboxes]&lt;/p&gt;\n\n&lt;p&gt;in the case of illegal immigrants turning USD into ETH and &amp;quot;becoming their own bank (since they cant register for a bank account), those immigrants could be able to use their home KYC data, USD gift cards from the states, and mailing address/ups box.&lt;/p&gt;\n\n&lt;p&gt;Edit: I didn&amp;#39;t try a gift card, but the fact that &lt;a href=\"https://privacy.com\"&gt;privacy.com&lt;/a&gt; cards work mean that it doesn&amp;#39;t have to be a bank issued card.&lt;/p&gt;\n\n&lt;p&gt;and for those implying i&amp;#39;m promoting illegal activities: this is merely a discussion for security and potential use cases of a new technology, and how it may disrupt current culture.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 197,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/wV8W2X8BnbJDQg7jVuVJrqeybFstOvCuAFaPY0j6484.jpg?auto=webp&amp;s=9cd1b50eca07f71f8e2051aee0bae021464af66b",
          "width": 1200,
          "height": 628
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/wV8W2X8BnbJDQg7jVuVJrqeybFstOvCuAFaPY0j6484.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=b5570d267d295b5a9f95f12bcabac5b92dd1d5bb",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/wV8W2X8BnbJDQg7jVuVJrqeybFstOvCuAFaPY0j6484.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=6bc2e3302641292a0532137f522d24f9b94683e4",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/wV8W2X8BnbJDQg7jVuVJrqeybFstOvCuAFaPY0j6484.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=4de6bb2dd76b5f0c10b9e06e65ab867ac99404fd",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/wV8W2X8BnbJDQg7jVuVJrqeybFstOvCuAFaPY0j6484.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=dd4b1127dea86ba5490114c1f0c7db6841d551bf",
            "width": 640,
            "height": 334
          },
          {
            "url": "https://external-preview.redd.it/wV8W2X8BnbJDQg7jVuVJrqeybFstOvCuAFaPY0j6484.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=84a050d3f51e1d0990a6bc32dd03c2e12e475385",
            "width": 960,
            "height": 502
          },
          {
            "url": "https://external-preview.redd.it/wV8W2X8BnbJDQg7jVuVJrqeybFstOvCuAFaPY0j6484.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=e9ad189216493bbc33bf1459b0f598834f4b862a",
            "width": 1080,
            "height": 565
          }
        ],
        "variants": {},
        "id": "REYbRxTVAsEg53Dp-XRhF2iV1Y4bt5Q5XTZjQuYFVno"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/rmfajw/loopring_cash_to_crypto_general_stealth/",
  "subreddit": "CryptoCurrency",
  "id": "rmfajw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I made the initial post on the loopring sub, but I figured a way to turn cash\ninto crypto would be of general interest. this method does not completely avoid\nKYC, but I included the stealthiest way i found via bank, and you should be able\nto buy gift cards and use them on Ramp.\n\n---\n\n\n\nInitially I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ループリングサブで最初の投稿をしたのは私ですが、現金を変える方法を考えたのです。\nこの方法は、暗号を完全に回避するものではありません。\nKYCですが、私が見つけた銀行を経由する最もステルスな方法を含めました。\nギフトカードを購入し、Rampで使用することができます。\n\n---\n\n\n\n当初は...",
      "title": "Loopring - 現金から暗号への変換＋一般的なステルス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在loopring子网站上发表了最初的帖子，但我认为将现金转为加密货币的方法\n这个方法不能完全避免KYC。\n但我把我发现的最隐蔽的方法包括在银行，你应该能够\n购买礼品卡并在Ramp上使用它们。\n\n---\n\n\n\n最初我...",
      "title": "Loopring - 现金转加密货币+一般隐蔽性"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在loopring子網站上發表了最初的帖子，但我認爲將現金轉爲加密貨幣的方法\n這個方法不能完全避免KYC。\n但我把我發現的最隱蔽的方法包括在銀行，你應該能夠\n購買禮品卡並在Ramp上使用它們。\n\n---\n\n\n\n最初我...",
      "title": "Loopring - 現金轉加密貨幣+一般隱蔽性"
    }
  ]
}