{
  "author": "thri54",
  "the_new_excerpt": "Their model is beyond amateurish. Tesla share count at the end of Q1 was 963.3M,\nup from 960M at the end of Q4. This is just 700K away from ARK's 964M 2025\nprojected share count.\n\nThose are only the outstanding shares. They missed Tesla's diluted share count\nby over 100M in their newest model. And…",
  "original_created_utc": 1620330775,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らのモデルは素人同然だ。テスラの第1四半期末の株式数は963.3万株。\n第1四半期末のテスラの株数は963.3Mで、第4四半期末の960Mから増加しています。これは、ARKの2025年の予想シェア数964Mまであと70万株となっています。\nの予想シェア数964Mからわずか700Kしか離れていません。\n\nこれはあくまでも発行済み株式数です。テスラの希薄化後の株式数を1億株以上も下回っています。\n最新のモデルでは1億株以上の差があります。そして...",
      "title": "ARKの評価モデルでは、テスラが2025年までに発行すると予測していた株式数の80％を、わずか3カ月で発行しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们的模式已经超出了业余水平。特斯拉第一季度末的股票数量为963.3万股。\n比第四季度末的9.6亿股有所增加。这离ARK的9.64亿股2025年仅有70万股的差距。\n预计的股票数量。\n\n这些仅仅是流通股。他们错过了特斯拉的摊薄股份数\n超过1亿股的最新模型。而且...",
      "title": "在短短3个月内，特斯拉已经发行了ARK估值模型预测他们将在2025年之前发行的80%的股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們的模式已經超出了業餘水平。特斯拉第一季度末的股票數量爲963.3萬股。\n比第四季度末的9.6億股有所增加。這離ARK的9.64億股2025年僅有70萬股的差距。\n預計的股票數量。\n\n這些僅僅是流通股。他們錯過了特斯拉的攤薄股份數\n超過1億股的最新模型。而且...",
      "title": "在短短3個月內，特斯拉已經發行了ARK估值模型預測他們將在2025年之前發行的80%的股票。"
    }
  ],
  "title": "In just 3 months, Tesla has issued 80% of the shares ARK's valuation model projected they would issue through 2025.",
  "created_utc": 1620341643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Their model is beyond amateurish.  Tesla share count at the end of Q1 was 963.3M, up from 960M at the end of Q4.  This is just 700K away from ARK&#39;s 964M 2025 projected share count.  </p>\n\n<p>Those are only the outstanding shares.  They missed Tesla&#39;s diluted share count by over 100M in their newest model.  And before anyone mentions possible buybacks, their model already includes a $300 billion cash pile in 2025 to pad their EV/EBITDA PT.  No room for buybacks in their modeled capital allocation.</p>\n\n<p>That&#39;s just what&#39;s provably wrong with the model.  Will Tesla create a human ride hail service with 3x more revenue than Uber in less than 5 years?   Will Tesla become the most profitable insurance company in the US in under 5 years?  Will Tesla sell sedans and crossovers at the same gross margins of Ferrari?  I can&#39;t say, but these are all standard assumptions made in ARK&#39;s &quot;bear case&quot; -- An odd context for the term.</p>\n\n<p>I wouldn&#39;t be so crass if they actually learned from their mistakes, but they don&#39;t.  Their year end 2019 model projected Tesla would issue 30 million more shares through 2024; 900M to 930M split adjusted.  They issued 55M in 2020 alone.  34M were attributable to capital raises.  Maybe that would be a good time to step back and check what the diluted share count would be in the event Tesla hit their PT?  I could almost forgive a hobby investor missing the dilutive effect of, at the time, anti-dilutive convertibles and stock options.  Not a firm like ARK, but a hobbyist.  They brazenly miss their share count estimate, take no further look as to why they missed, and, by some miracle, totally miss the dilutive share count &amp; effects plastered all over Tesla&#39;s filings since Q1 2020.</p>\n\n<p>To be blunt, these guys are either dumb or deceitful.  To those who invest in ARK funds, this is the level of DD you get.  Caveat emptor.</p>\n\n<p>Sources for the lazy:  <a href=\"https://www.sec.gov/Archives/edgar/data/0001318605/000156459021004599/tsla-10k_20201231.htm\">https://www.sec.gov/Archives/edgar/data/0001318605/000156459021004599/tsla-10k_20201231.htm</a></p>\n\n<p><a href=\"https://www.sec.gov/Archives/edgar/data/0001318605/000156459020004475/tsla-10k_20191231.htm\">https://www.sec.gov/Archives/edgar/data/0001318605/000156459020004475/tsla-10k_20191231.htm</a></p>\n\n<p><a href=\"https://github.com/ARKInvest/ARK-Invest-Tesla-Valuation-Model\">https://github.com/ARKInvest/ARK-Invest-Tesla-Valuation-Model</a></p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/investing/comments/n6fysa/in_just_3_months_tesla_has_issued_80_of_the/",
  "subreddit": "investing",
  "id": "n6fysa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994593
}