{
  "author": "Nightshade-1144",
  "original_created_utc": 1624242899,
  "title": "Would it be weird if I (21F) became friends with an older woman (89F)?",
  "created_utc": 1624323989,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>She&#39;s a patient where I work and has been trying to chat with the other older ladies there saying she just wants a friend. She&#39;s isolated and alone most of the time and can&#39;t drive herself anymore. Would it be weird if I offered to be her friend? She likes to talk a lot and reminds me of my grandparents and I like listening to their stories. She said she just wants someone to visit because she doesn&#39;t have anyone. I don&#39;t know any details.</p>\n\n<p>I also don&#39;t have many friends (2 + my bf) and most of my family is super far and I can&#39;t visit with them often. I have a difficult time socializing because I don&#39;t talk often and it puts people off. But she&#39;s super nice in the office and I always chat with her before and after her appointments. She wanted me to be her caretaker (mainly driving her around) but at the time I didn&#39;t have my own car to be able to do that. </p>\n\n<p>So now I have come to reddit because I&#39;m bad at social norms and am wondering if it would be inappropriate for me to offer my information and offer to be her friend. Thanks in advance!</p>\n\n<p>Edit: thank you everyone who replied. I&#39;m gonna make sure it&#39;s fine with my boss first and discuss it more with my bf (mainly so he knows where I am if I leave). She has said she&#39;s lonely and doesn&#39;t have anyone to visit, and I know how much it sucks being isolated and not having anyone to talk to. I&#39;ll post an update if things go well and put the link here :) thanks again!</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/o4l2n7/would_it_be_weird_if_i_21f_became_friends_with_an/",
  "subreddit": "NoStupidQuestions",
  "id": "o4l2n7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "She's a patient where I work and has been trying to chat with the other older\nladies there saying she just wants a friend. She's isolated and alone most of\nthe time and can't drive herself anymore. Would it be weird if I offered to be\nher friend? She likes to talk a lot and reminds me of my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女は私が働いている職場の患者さんで、他の年配の女性たちと話そうとしています。\n友達が欲しいと言っていました。彼女はほとんどの場合、一人で孤立しています。\nもう自分で運転することもできません。私が彼女の友達になることを申し出たら、変でしょうか？\n友人になることを提案したら変でしょうか？彼女はよく話すのが好きで、私の...を思い出させてくれます。",
      "title": "私(21F)が年上の女性(89F)と友達になったら、変ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她是我工作的地方的一个病人，一直试图与那里的其他老太太聊天，说她只是想找一个朋友。\n她说她只是想要一个朋友。她很孤独，大部分时间都是一个人，不能开车。\n她大部分时间都与世隔绝，而且不能自己开车了。如果我提出做她的朋友，会不会很奇怪？\n她的朋友会不会很奇怪？她喜欢说很多话，让我想起了我的...",
      "title": "如果我（21岁）和一个年长的女人（89岁）成为朋友，会不会很奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她是我工作的地方的一個病人，一直試圖與那裏的其他老太太聊天，說她只是想找一個朋友。\n她說她只是想要一個朋友。她很孤獨，大部分時間都是一個人，不能開車。\n她大部分時間都與世隔絕，而且不能自己開車了。如果我提出做她的朋友，會不會很奇怪？\n她的朋友會不會很奇怪？她喜歡說很多話，讓我想起了我的...",
      "title": "如果我（21歲）和一個年長的女人（89歲）成爲朋友，會不會很奇怪？"
    }
  ]
}