{
  "author": "Spreizbacken",
  "original_created_utc": 1636800027,
  "title": "My wife seems to have a sixth sense of market movement and crypto strategies while having no idea what crypto is.",
  "created_utc": 1636822428,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ever since I started investing in crypto I had to make my &#39;&#39;rookie mistakes&#39;&#39; - not having the full conviction, be scared by FUD, selling too early, buying too high and so on<br/>\nEver since I started this journey I&#39;ve been pretty open about it with my wife.</p>\n\n<p>Every time I did some change to my portfolio she would make some sort of a comment either agreeing or disagreeing with me.<br/>\nI remember one time in the summer, I bought ETH at around $2k, than it dropped down to $1.7k and started climbing back up, which I saw back then as a perfect get-out moment.<br/>\nAt that time nobody knew if we were in a bull market or a bear market and people were leaning more to the bearish side.<br/>\nAaanyway, wifey &#39;&#39;if you believe this thing is going to grow, just hold it&#39;&#39;.<br/>\nWOMAN, I&#39;ve been spending hours every day on charts, metrics, videos, podcasts and everything I can get my hands on, people are worried we are going back to $15k, you don&#39;t even know what crypto is... well, turns out she was right. Beginners luck, I thought.<br/>\nThis went on for more than 7-8 times with slight variations. Again, I didn&#39;t pay much attention.</p>\n\n<p>Lately I&#39;ve been reading through different exit strategies and debating whether I should cash out in the bull cycle or keep everything staked and wait another 2-3 years. Having a baby on the way I felt like this is something we should discuss as a family.<br/>\nWhen brought up, she said:<br/>\n&#39;&#39;I think cashing out everything at once would be risking it too much to either be too late or too early, why don&#39;t you take out your initial investment when you&#39;ve got 2-3x and when things get heated pull out smaller chunks untill you have like 10% in for a greater risk. When this drop comes you can put back 40% for the next time and be left with 50% for fun money.&#39;&#39;<br/>\nMy jaw dropped.<br/>\nWOMAN, I&#39;ve spent literally days going through everything to come down to this strategy and you just spilled it on a saturday breakfast before you&#39;ve even finished your coffee!</p>\n\n<p>My wife is either a fuckin genious or she is hiding a ledger somewhere. No other way.<br/>\n<strong>Listen</strong> to your women guys, we may not know shit about fuck, but these creatures seem to know everything fucking thing in the universe!<br/>\nGod damned.</p>\n</div><!-- SC_ON -->",
  "score": 213,
  "permalink": "/r/CryptoCurrency/comments/qsypgy/my_wife_seems_to_have_a_sixth_sense_of_market/",
  "subreddit": "CryptoCurrency",
  "id": "qsypgy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ever since I started investing in crypto I had to make my ''rookie mistakes'' -\nnot having the full conviction, be scared by FUD, selling too early, buying too\nhigh and so on\nEver since I started this journey I've been pretty open about it with my wife.\n\nEvery time I did some change to my portfolio…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号への投資を始めて以来、私は「新人としての失敗」をしなければなりませんでした。\n確信が持てなかったり、FUDにおびえたり、早く売りすぎたり、高く買いすぎたり。\nなどです。\nこの旅を始めて以来、私は妻にこのことをかなりオープンにしてきました。\n\nポートフォリオを変更するたびに...",
      "title": "私の妻は、暗号が何であるかを知らないのに、市場の動きや暗号戦略について第六感を持っているようです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "自从我开始投资加密货币以来，我不得不犯 \"菜鸟错误\" --\n没有充分的信念，被恐惧症所吓倒，过早卖出，买入太多\n购过高，等等。\n自从我开始这段旅程以来，我一直对我的妻子很开放。\n\n每次我对我的投资组合做一些改变时...",
      "title": "我的妻子似乎对市场动向和加密货币策略有第六感，而对加密货币是什么却一无所知。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從我開始投資加密貨幣以來，我不得不犯 \"菜鳥錯誤\" --\n沒有充分的信念，被恐懼症所嚇倒，過早賣出，買入太多\n購過高，等等。\n自從我開始這段旅程以來，我一直對我的妻子很開放。\n\n每次我對我的投資組合做一些改變時...",
      "title": "我的妻子似乎對市場動向和加密貨幣策略有第六感，而對加密貨幣是什麼卻一無所知。"
    }
  ]
}