{
  "author": "w3nch",
  "original_created_utc": 1650476526,
  "title": "I legitimately don’t understand dad strength. How is my dad so strong despite going to the gym maybe twice in the last decade?",
  "created_utc": 1650503176,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t get it. How are dads so strong?&lt;/p&gt;\n\n&lt;p&gt;I’m 26, basically in my physical prime. I hit the gym 4ish days a week, do plenty of strength training, and jog regularly. I wouldn’t say I’m the next Schwarzenegger, but I definitely take care of myself.&lt;/p&gt;\n\n&lt;p&gt;My dad is pushing 60, and while he’s not obese by any means, he’s got a bit of a dad bod. 6’0”, 210ish pounds. I haven’t seen him do a real workout since we went running together once back in 2009. I will say, he’s definitely not a couch potato. He likes to chop wood, putter around his yard, shovel compost and mulch, gardening, etc etc. He was also a roofer back when he was my age.&lt;/p&gt;\n\n&lt;p&gt;When it comes to anything that requires either cardio (jogging, biking) or a good strength to weight ratio (Pull-ups, jumping), I have him beat. But as far as pure strength goes? The dude is a tank. Arm wrestling is a stomp 10 out of 10 times in his favor. Dude can sling me over his shoulder and carry me like a fair maiden without breaking a sweat. I have no doubt he could out-benchpress me with both arms tied behind his back. It’s not even a competition. His functional strength is insane.&lt;/p&gt;\n\n&lt;p&gt;How??? I understand that he was very physically capable when he was younger, but he seemed to have retained every bit of his youthful strength, and THEN some, despite touching a dumbbell a total of 4 times in his life. His bad back is the only thing stopping him from being Thor.&lt;/p&gt;\n\n&lt;p&gt;And he’s almost SIXTY. Like I get if I was 16 and he was 45 or something, but I’m a grown ass man, and he’s hitting retirement age. I swear, he’s going to have to hit 80 before I can say I’m stronger than my dad, and even then I’m not so sure.&lt;/p&gt;\n\n&lt;p&gt;Is this a universal experience? I truly don’t get it from a physiological standpoint.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/NoStupidQuestions/comments/u821u3/i_legitimately_dont_understand_dad_strength_how/",
  "subreddit": "NoStupidQuestions",
  "id": "u821u3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don’t get it. How are dads so strong?\n\nI’m 26, basically in my physical prime. I hit the gym 4ish days a week, do\nplenty of strength training, and jog regularly. I wouldn’t say I’m the next\nSchwarzenegger, but I definitely take care of myself.\n\nMy dad is pushing 60, and while he’s not obese by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "理解できない お父さんって、どうしてそんなに強いんだろう？\n\n私は26歳で、基本的に肉体的には全盛期です。週4日ジムに通い、筋トレをし、定期的にジョギングをしています。\nジョギングも定期的にしています。次のシュワルツェネッガーとは言いませんが\n次のシュワルツェネッガーとは言いませんが、間違いなく自分のことは自分でやっています。\n\n私の父は60歳を過ぎていますが、肥満ではありません...",
      "title": "お父さんの強さが正当に理解できない。この10年で2回くらいしかジムに行ってないのに なぜ父はそんなに強いのでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白。爸爸们怎么会这么强壮？\n\n我26岁了，基本上处于身体的黄金时期。我每周去4天左右的健身房，做大量的力量训练，并定期慢跑。\n大量的力量训练，并定期慢跑。我不会说我是下一个\n施瓦辛格，但我肯定会照顾好自己。\n\n我父亲快60岁了，虽然他没有肥胖，但他的身体却很好。",
      "title": "我完全不理解爸爸的力量。尽管我爸爸在过去十年中可能去了两次健身房，但他怎么会如此强壮？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白。爸爸們怎麼會這麼強壯？\n\n我26歲了，基本上處於身體的黃金時期。我每週去4天左右的健身房，做大量的力量訓練，並定期慢跑。\n大量的力量訓練，並定期慢跑。我不會說我是下一個\n施瓦辛格，但我肯定會照顧好自己。\n\n我父親快60歲了，雖然他沒有肥胖，但他的身體卻很好。",
      "title": "我完全不理解爸爸的力量。儘管我爸爸在過去十年中可能去了兩次健身房，但他怎麼會如此強壯？"
    }
  ]
}