{
  "author": "Go_To_Bethel_And_Sin",
  "original_created_utc": 1643655661,
  "title": "In a recent interview with Joe Rogan, Jordan Peterson claimed: \"Now, in many ways, the first book was the Bible. I mean, literally.\" To what extent (if at all) is this true?",
  "created_utc": 1643668194,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You can watch him make this claim &lt;a href=\"https://www.youtube.com/watch?v=Vt9K6kmpx44\"&gt;here&lt;/a&gt; at 1:02, and I&amp;#39;ve transcribed it below:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Now, in many ways, the first book was the Bible. I mean, literally. Because, at one point, there was only one book. Like, as far as our Western culture is concerned, there was one book. And, for a while, literally, there was only one book, and that book was the Bible, and then, before it was the Bible, it was scrolls and writings on papyrus, but we were starting to aggregate written text together. And it went through all sorts of technological transformations, and then it became books that everybody could buy -- the book  everybody could buy -- and the first one of those was the Bible. And then became all sorts of books that everybody could buy, but all those books, in some sense, emerged out of that underlying book, and that book itself -- the Bible isn&amp;#39;t a book; it&amp;#39;s a library. It&amp;#39;s a collection of books.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Is this true at all? &lt;/p&gt;\n\n&lt;p&gt;(Disclaimer: I&amp;#39;m a fan of neither Rogan nor Peterson. I&amp;#39;m only interested in fact-checking this seemingly falsifiable statement.)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 125,
  "permalink": "/r/AskHistorians/comments/sh92go/in_a_recent_interview_with_joe_rogan_jordan/",
  "subreddit": "AskHistorians",
  "id": "sh92go",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You can watch him make this claim here\n[https://www.youtube.com/watch?v=Vt9K6kmpx44] at 1:02, and I've transcribed it\nbelow:\n\n> Now, in many ways, the first book was the Bible. I mean, literally. Because,\n> at one point, there was only one book. Like, as far as our Western culture is\n> concerned,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼のこの主張は、ここで見ることができます。\n[https://www.youtube.com/watch?v=Vt9K6kmpx44] 1:02から、その内容を書き起こしてみました。\nを以下に紹介します。\n\n> さて、いろいろな意味で、最初の本は聖書でした。つまり、文字通りの意味で。なぜなら\n> ある時期には、1冊の本しかなかったのです。私たち西洋の文化がそうであるように\n> ということです。",
      "title": "ジョーダン・ピーターソンは、ジョー・ローガンとの最近のインタビューで、こう主張しています。\"さて、多くの点で、最初の本は聖書でした。つまり、文字通りです。\" これはどの程度まで（もしそうであれば）本当なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可以在这里看到他的这种说法\n[https://www.youtube.com/watch?v=Vt9K6kmpx44]1:02处，我把它转录到\n以下。\n\n> 现在，在许多方面，第一本书是圣经。我是说，从字面上看。因为。\n> 在一个点上，只有一本书。比如，就我们的西方文化而言\n> 有关，...",
      "title": "在最近对乔-罗根的采访中，乔丹-彼得森声称。\"现在，在许多方面，第一本书是圣经。我的意思是，从字面上看\"。这在多大程度上（如果有的话）是真的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可以在這裏看到他的這種說法\n[https://www.youtube.com/watch?v=Vt9K6kmpx44]1:02處，我把它轉錄到\n以下。\n\n> 現在，在許多方面，第一本書是聖經。我是說，從字面上看。因爲。\n> 在一個點上，只有一本書。比如，就我們的西方文化而言\n> 有關，...",
      "title": "在最近對喬-羅根的採訪中，喬丹-彼得森聲稱。\"現在，在許多方面，第一本書是聖經。我的意思是，從字面上看\"。這在多大程度上（如果有的話）是真的？"
    }
  ]
}