{
  "author": "fatherintime",
  "the_new_excerpt": "I posted this once, but the timing was bad and it got buried. The original\ninterest in the idea was very high, so I'm putting it out there again for those\nwho missed it.\n\nHow to Approach Crypto Investing with a Stoic Mindset\n\nIntroduction\n\nAnyone who has ever decided to invest their hard earned cash…",
  "original_created_utc": 1616778141,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经发过一次，但时间不对，被埋没了。原来的\n对这个想法的兴趣非常高，所以我再次把它放在那里，为那些\n谁错过了\n\n如何以严谨的心态对待加密投资？\n\n介紹\n\n任何一个曾经决定将自己辛苦赚来的现金进行投资的人... ...",
      "title": "斯托克主义与加密投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經發過一次，但時間不對，被埋沒了。原來的\n對這個想法的興趣非常高，所以我再次把它放在那裏，爲那些\n誰錯過了\n\n如何以嚴謹的心態對待加密投資？\n\n介紹\n\n任何一個曾經決定將自己辛苦賺來的現金進行投資的人... ...",
      "title": "斯托克主義與加密投資"
    }
  ],
  "title": "Stoicism and Crypto Investing",
  "created_utc": 1616849618,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I posted this once, but the timing was bad and it got buried. The original interest in the idea was very high, so I&#39;m putting it out there again for those who missed it.  </p>\n\n<p>How to Approach Crypto Investing with a Stoic Mindset</p>\n\n<p><strong>Introduction</strong> </p>\n\n<p>Anyone who has ever decided to invest their hard earned cash into a market, regardless of the investment, has had to deal with the emotional roller coaster that sometimes comes with investing. In cryptocurrency, that roller coaster tends to have a lot more highs and lows than legacy markets. That means our traditional fears are more keenly felt; the fear of missing out (FOMO) while watching an investment quickly appreciate, and the trio of fear, uncertainty, and doubt (FUD) can feel like such a force that we act on those emotions, sometimes to our own detriment. Stories about buying high and selling low are heard every day, and are much more likely to happen when these emotional responses to the market take over. I too can turn a thousand dollars into five dollars this way. It’s only human.</p>\n\n<p>We don’t have to behave this way. Philosophy can aid us in becoming a more rational investor. Specifically, the ancient Greek philosophy of stoicism holds many insights into becoming a more rational investor, which will likely increase anyone’s success while investing. But, there are many strategies to investing, each with their own strengths and weaknesses. Some are a mix of holding onto Bitcoin and trading altcoins, only to roll profit back into Bitcoin, or perhaps some blue chip crypto. There are others better suited for a deep dive into those strategies, so here I only want to glance at some basic differences between Bitcoin and altcoins. First, let’s briefly examine whether holding Bitcoin for the long term works as a strategy, and any downfalls. Then, we’ll look at altcoin investments and some of the problems people run into investing there. </p>\n\n<p>Warren Buffet isn’t a fan of cryptocurrency, but he is a respected investor, and is cited as saying “the stock market is a device for transferring wealth from the impatient to the patient.” This would seem to apply to any market, and crypto is no exception. While volatility can scare us into irrational moves, that volatility does not affect whether an asset has a general trend visible when looking at larger time frames. Gains and losses can be averaged out to seek the annual return of an asset. According to upmyinterest.com, the mean annual return for Bitcoin is 408.8% from 2017-2020, though it is noteworthy that this includes 2017, in which the return was 1,318%, and the 2018 crash which was -72.6%. For Bitcoin none of this is news; investors have long said to “hodl” or hold on for dear life, meaning never sell your Bitcoin. Followers of this strategy will often tell you that time in the market is better than timing the market. Having diamond hands is easier when you zoom out and see the gains you’ve already had, and can expect to have in the future outside of the present moment. Stoicism can help you keep that perspective in focus.</p>\n\n<p>Could the same strategy be true for other coins? Veterans of the 2018 crash often speak of coins that went all the way to zero. Examples are plentiful, and in those cases, holding certainly didn’t work out. As of March 22, 2021 there are 1,924 dead coins (Coinopsy). However, as of January 2021, more than 4,000 cryptocurrencies exist (Investopedia). Obviously, you can’t just hold onto just any coin and expect it to increase in value, and if there’s no growth in the coin, you’re missing out somewhere else in the market where you could have an investment that is growing. There’s an opportunity cost to a bad investment, in addition to possible monetary losses. But where there is risk, there’s reward, and in altcoin season these smaller coins can significantly outperform Bitcoin. We have to manage our risk exposure, and a stoic mindset can help with that, too. You might also have to buy and sell more depending on how you invested, Whatever your investment strategy is, stoicism can help by teaching us how to react more rationally to market fluctuations that make us behave irrationally and buy or sell at the wrong times because of an emotional response.</p>\n\n<p><strong>Stoicism</strong></p>\n\n<p>To understand a stoic mindset to investing, we have to understand what stoicism is. There are only fragments that survive from the early stoic philosophers who founded this school of thought. We do know the story of perhaps the most famous founder, Zeno of Citium, who was a merchant who lost everything in a shipwreck near Athens around 300 BCE. Instead of despairing at starting over, he began reading and studying with the local philosophers, and later, started the school of thought we now call stoicism. If you’re someone who learns better by video, you can see an excellent summary of his story and an overview of stoicism here: <a href=\"https://youtu.be/R9OCA6UFE-0\">Stoicism Overview</a>. I’m sure many investors feel like they understand just a little what Zeno must have felt when his ship sank.</p>\n\n<p>We have a lot more material from Epictetus, Marcus Aurelius, and Seneca the Younger. There are also a lot of modern philosophers who’ve written about and studied stoicism, like Chris Fisher, Pierre Hadot, and William Braxton Irvine. Instead of getting into the particulars about the differences between all of their views, we’ll instead concentrate on the most basic elements of stoicism that might be useful for investing. However, I mention their names in case you have any interest in taking a deeper look at stoicism. This is just scratching the surface.</p>\n\n<p><strong>The Stoic Discipline of Assent</strong></p>\n\n<p>The facet we’ll be focusing on is the stoic discipline of assent. In the stoic discipline of assent, the idea is to increase how mindful we are concerning how we react to the events around us. Any time an event happens we get an impression of it. At this point, we have not yet formed an opinion of the event. There are no emotions because you have not assented to any value judgment yet. Now, let’s assume something bad is happening, like Bitcoin hitting a bear market. You might then experience what the stoics refer to as pathos. This arises after our assent to the value judgment but is not part of the event itself. Instead the negative emotion arises as a result of assent to the judgment about that event. For example, you might assent to the judgment of a driver as a terrible person when really their bad driving caused no harm. In other words, the event did not warrant your reaction.</p>\n\n<p>Where did the harm come from in the event? The harm, it turns out, comes from our negative reaction. The stoics define such events as morally indifferent, meaning the event cannot cause any real harm to us (they really mean our soul, but I’m keeping it simple). However, our reactions can cause us great harm and distress. I’ll borrow heavily from Chris Fisher here, who was originally who I first learned this from. You can find his excellent podcast on the topic here: <a href=\"http://www.traditionalstoicism.com/stoic-logic-the-discipline-of-assent-episode-9/\">Stoic Logic: The Discipline of Assent-Episode 9</a>. In it he outlines the following process, citing John Sellars. I’ll paraphrase here to try and make it clearer and remove some of the philosophical jargon.</p>\n\n<p>There is an event, and before we realize what is happening, we make a value judgment of that event concerning whether it is good or bad. Then, we give our assent, and whatever the event is begins to immediately affect our emotional state, regardless of whether that event is one that we should really be indifferent toward. Once we realize this is happening, we can reorder this process by being more mindful of it. This change in how we think gives us more internal control over the events that occur, which are largely out of our control anyway. What we can learn to better control is how we react to those events.</p>\n\n<p>The stoics refer to our observations about the world as impressions. Basically, they’re either something that is happening that we observe, or a thing we observe that is external to us. Dealing with impressions/external events or things is tricky. In this explanation Fisher borrows heavily from Pierre Hadot, who talks about the citadel of the mind. You can think of the mind as a citadel, and on the way to the citadel is a road. The events that happen in our lives travel up that road, gaining value judgments along the way that will affect our emotional state, and enter the citadel. Now we’re a mess! But what if we put a guard post on that road to stop those value judgments before they wreck us?  Epictetus writes, </p>\n\n<p>In the first place, do not allow yourself to be carried away by [the] intensity [of your impression]: but say, &#39;Impression, wait for me a little. Let me see what you are, and what you represent. Let me test you.&#39; Then, afterwards, do not allow it to draw you on by picturing what may come next, for if you do, it will lead you wherever it pleases. But rather, you should introduce some fair and noble impression to replace it, and banish this base and sordid one. (<em>Discourses</em> 2.18.24–5)</p>\n\n<p>Here’s how we might practice the wisdom Epictetus has shared with us. The presentation of this process is credited to Chris Fisher, but is paraphrased here:</p>\n\n<ol>\n<li><p>Stop the impression/event or thing in its tracks. Place a stoic road block at the gate of your inner citadel. There is so much that we can’t control about the world. Instead of trying to control those things, we can control how we react. In this stage, we are stopping the internal process of attaching a value judgment to that thing or event.</p></li>\n<li><p>Strip the impression/event or thing bare: Remove those value judgments from the bare impression. Don’t allow it to lead you on by picturing what may come next or what may happen to you. No thing or event is good or bad in itself, it is our thinking of those events that make it good or bad.</p></li>\n<li><p>See the impression/event or thing from a broader perspective for what it is. An example of doing this would be to see the impression as part of the world that is outside of your control, and view it more objectively. In both interpretations of stoicism, an event may have a different meaning when viewed from a broader perspective so that we can more easily see it for what it truly is. And most of the time, it isn’t as big of a deal as we thought it was to begin with. </p></li>\n</ol>\n\n<p>A final note on stoicism pertains to desires. When we desire a particular outcome, we are setting ourselves up to suffer because often the outcome isn’t up to us. This is particularly true in cryptocurrency markets. We like green candles, and when numbers go only ever upward. But, we have to be careful in what we assent to, because red candles exist and numbers can go to zero. Consider this often quoted paragraph from Marcus Aurelius’ Meditations, in which you can see the stoic mindset we’ve been discussing outlined:</p>\n\n<p>When you have savouries and fine dishes set before you, you will gain an idea of their nature if you tell yourself that this is the corpse of a fish, and that the corpse of a bird or a pig; or again, that fine Falernian wine is merely grape-juice, and this purple robe some sheep’s wool dipped in the blood of a shellfish; and as for sexual intercourse, it is the friction of a piece of gut and, following a sort of convulsion, the expulsion of mucus. Thoughts such as these reach through to the things themselves and strike to the heart of them, allowing us to see them as they truly are. So follow this practice throughout your life, and where things seem most worthy of your approval, lay them naked, and see how cheap they are, and strip them of the pretenses of which they are so vain. (Meditations VI.13)</p>\n\n<p>Similarly, Epictetus tells us that until we take control of our assent, we remain slaves to our desires. He would know something of it, because his name means gained or acquired, or what we might translate in modern times as “slave”. Though born a slave, Epictetus had a kind master who allowed him to educate himself, and eventually Epictetus gained his freedom. Along the way, he learned about stoicism and based much of his philosophy on the process outlined above.</p>\n\n<p>Note that all of this might give you the idea that stoics are just these passive, emotionless people. They’re not that way at all! Marcus Aurelius would not have been a very good emperor if he weren’t an active ruler. It isn’t that stoics don’t feel emotion, it is that they gain an understanding of why they feel that way, and over time are better able to prepare themselves to defend against being emotionally overwhelmed and therefore, less rational. Over time, the idea is that our reactions to impressions improves and we are able to live a better, freer life.</p>\n\n<p><strong>Stoicism and Investing</strong> </p>\n\n<p>Well, there you have it. If we fortify our minds to be more mindful of how we react to market fluctuations, we’ll be more rational investors and be better prepared to stop us from making emotional mistakes. Now, obviously, this is good advice to live by generally. But it seems me to be a very detailed way to avoid FOMO and FUD. Maybe taking a stoic mindset will make for stronger hands when there’s good narrative and analysis that indicates when to hold through a bearish trend to the promised land of green candles, or perhaps the stoic mindset might make it so we don’t hold onto a coin too long out of sentimentality instead of protecting profit. I hope this essay is able to help some people have a little more peace of mind, and enables them to be better investors regardless of the strategy they use.</p>\n\n<p>There are other ways stoicism might help your trading as well. You know when you took profits “too soon” and didn’t time the market just right? You controlled what events you could, and took a profit. That’s a win. Remember when you gave up on a coin and sold low, just before it took off? Hopefully you have no recollection of that happening because therapy is expensive, but if you do remember the stoic mindset can remind you to take a more objective perspective. You might see how your portfolio is performing overall instead of focusing on this loss and losing your confidence. Or, maybe you take a broader look and see your portfolio is underperforming the market, and instead of having a really bad time it’s only a little bit of a bad time and you’re able to see and understand why your portfolio is underperforming because you were able to keep your emotions in check well enough to give your trading a critique. If you have a rational understanding of your trades, instead of giving in to the human propensity to focusing on the bad things that happen, you’ll have a better understanding of your past trades and how to improve. If you keep a journal of your trades, you’ll have even more of an understanding of why you did what you did and how it worked out. This is beneficial for any transactions you make in the market, as you can objectively track your successes and failures over time. It might even make your taxes easier if you tracked prices and profits.</p>\n\n<p>We can’t predict the market, but we can strive to understand, and thereby regulate our reactions to it. That, my friends, will make us better at navigating it.</p>\n\n<p>Here are some of the sources I drew from that aren’t already linked. Since this is a reddit post I’m not making a true works cited page because they’re a pain.</p>\n\n<p><a href=\"https://www.investopedia.com/tech/most-important-cryptocurrencies-other-than-bitcoin/#:%7E:text=One%20reason%20for%20this%20is,communities%20of%20backers%20and%20investors\">https://www.investopedia.com/tech/most-important-cryptocurrencies-other-than-bitcoin/#:~:text=One%20reason%20for%20this%20is,communities%20of%20backers%20and%20investors</a>.</p>\n\n<p><a href=\"https://www.coinopsy.com/dead-coins/\">https://www.coinopsy.com/dead-coins/</a></p>\n\n<p><a href=\"https://www.statista.com/statistics/730876/cryptocurrency-maket-value/\">https://www.statista.com/statistics/730876/cryptocurrency-maket-value/</a></p>\n\n<p><a href=\"http://www.traditionalstoicism.com/stoic-logic-the-discipline-of-assent-episode-9/\">Stoic Logic: The Discipline of Assent-Episode 9</a></p>\n\n<p><a href=\"https://www.gutenberg.org/files/45109/45109-h/45109-h.htm\">https://www.gutenberg.org/files/45109/45109-h/45109-h.htm</a></p>\n\n<p><a href=\"http://classics.mit.edu/Antoninus/meditations.html\">http://classics.mit.edu/Antoninus/meditations.html</a></p>\n</div><!-- SC_ON -->",
  "score": 172,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/faPPQ8uMaeZTW2PLB6vDBHCtr-BWF9xgUe6xJ5geV8o.jpg?auto=webp&s=e2df63c4a12e5a3563c1cb4dd35d721bd61a6adb",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/faPPQ8uMaeZTW2PLB6vDBHCtr-BWF9xgUe6xJ5geV8o.jpg?width=108&crop=smart&auto=webp&s=3fe3665b227cb1ec93928f3b5e65dd73810317fc",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/faPPQ8uMaeZTW2PLB6vDBHCtr-BWF9xgUe6xJ5geV8o.jpg?width=216&crop=smart&auto=webp&s=d274c91801359d351385043d9e258ca286ef2417",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/faPPQ8uMaeZTW2PLB6vDBHCtr-BWF9xgUe6xJ5geV8o.jpg?width=320&crop=smart&auto=webp&s=31715024d78ac363de6b0c53fa3d10a832c22812",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "OauSIBXLFuub2QJIAgvvbJFfEoiUOXZfkLftxsPQq7g"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mdt6ur/stoicism_and_crypto_investing/",
  "subreddit": "CryptoCurrency",
  "id": "mdt6ur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135586
}