{
  "author": "Greyscale88",
  "original_created_utc": 1632850412,
  "title": "Why did the ban on Pork skip Christianity but come back with Islam?",
  "created_utc": 1632879454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello!</p>\n\n<p>I teach Global History to High Schoolers and during our World Religions unit we group the three Abrahamic Religions together so that students can see the progression of the original ideas through three different religions.</p>\n\n<p>However, for some reason this year I randomly had this thought that I can&#39;t find a clear answer on. In Judaism, it is against traditional law to eat Pork, and the same is true in Islam. Why then did Christians skip this part of the tradition? And how did it come back during the founding of Islam?</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/pxbgds/why_did_the_ban_on_pork_skip_christianity_but/",
  "subreddit": "AskHistorians",
  "id": "pxbgds",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello!\n\nI teach Global History to High Schoolers and during our World Religions unit we\ngroup the three Abrahamic Religions together so that students can see the\nprogression of the original ideas through three different religions.\n\nHowever, for some reason this year I randomly had this thought that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n私は高校生に世界史を教えていますが、「世界の宗教」の単元では\n世界の宗教」の単元では、3つのアブラハム系宗教をグループ化して、生徒たちがオリジナルの宗教の変遷を見られるようにしています。\n3つの異なる宗教を通じたオリジナルのアイデアの進行を見ることができます。\n\nしかし、今年はなぜか、私はランダムにこのような考えを持っていました...",
      "title": "豚肉禁止は、なぜキリスト教を飛び越えて、イスラム教で復活したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好!\n\n我给高中生教全球历史，在世界宗教单元中，我们\n在我们的世界宗教单元中，我们把三个亚伯拉罕宗教放在一起，这样学生就可以看到他们之间的关系。\n通过三个不同的宗教看到原始思想的发展。\n\n然而，由于某些原因，今年我随机产生了这样的想法，即...",
      "title": "为什么禁止猪肉的规定跳过了基督教，却在伊斯兰教那里回来了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好!\n\n我給高中生教全球歷史，在世界宗教單元中，我們\n在我們的世界宗教單元中，我們把三個亞伯拉罕宗教放在一起，這樣學生就可以看到他們之間的關係。\n通過三個不同的宗教看到原始思想的發展。\n\n然而，由於某些原因，今年我隨機產生了這樣的想法，即...",
      "title": "爲什麼禁止豬肉的規定跳過了基督教，卻在伊斯蘭教那裏回來了？"
    }
  ]
}