{
  "author": "TheRealBabyJezus",
  "original_created_utc": 1628064904,
  "title": "No, Spain is not considering mortgages payments in crypto.",
  "created_utc": 1628084036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen this headline thrown a lot in some crypto subs. The reality is much diferent however. The proponent of the bill is the right wing party (Partido Popular), and has the same chance of passing of Shiba hitting 1$. Unfortunately this proposal is being used as an attack to the party in power (PSOE) in a sensitive matter in Spain, mortgages, as the country got hitted hard during the housing crisis of 2008. Don&#39;t be fooled by headlines and always DYOR.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/oxo1tm/no_spain_is_not_considering_mortgages_payments_in/",
  "subreddit": "CryptoCurrency",
  "id": "oxo1tm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've seen this headline thrown a lot in some crypto subs. The reality is much\ndiferent however. The proponent of the bill is the right wing party (Partido\nPopular), and has the same chance of passing of Shiba hitting 1$. Unfortunately\nthis proposal is being used as an attack to the party in power…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この見出しは、一部の暗号サブサイトでよく目にするものです。しかし、現実は大きく\n違っています。この法案の提案者は右翼政党（Partido\n法案の提案者は右翼政党（Partido.Popular）で、Shibaが1ドルになるのと同じ確率で可決されます。残念ながら\nこの提案は政権与党への攻撃として利用されています...。",
      "title": "いいえ、スペインでは住宅ローンの支払いを暗号で行うことは考えていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在一些加密货币的子网站上经常看到这个标题的抛出。现实情况是\n然而，事实并非如此。该法案的支持者是右翼政党（Partido\n人民党），其通过的机会与芝罘区达到1美元的机会相同。不幸的是\n这个提案被用作对执政党的攻击......",
      "title": "不，西班牙没有考虑用加密货币支付抵押贷款。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一些加密貨幣的子網站上經常看到這個標題的拋出。現實情況是\n然而，事實並非如此。該法案的支持者是右翼政黨（Partido\n人民黨），其通過的機會與芝罘區達到1美元的機會相同。不幸的是\n這個提案被用作對執政黨的攻擊......",
      "title": "不，西班牙沒有考慮用加密貨幣支付抵押貸款。"
    }
  ]
}