{
  "author": "apricotcoffee",
  "original_created_utc": 1634575352,
  "title": "What was Colin Powell's role in the U.S. military's effort to cover up for the My Lai massacre?",
  "created_utc": 1634589481,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well my question is pretty much laid out in the title. I&#39;m familiar with controversies around Iraq back around 2000ish, but I had no idea Powell was involved in Vietnam at all.</p>\n\n<p>Basically I just came from a mention on Twitter that Powell <em>led</em> the military&#39;s attempt to hide the massacre - not just part of, but led it???</p>\n\n<p>Can somebody shed some light on this? Is it even true?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qaqi8r/what_was_colin_powells_role_in_the_us_militarys/",
  "subreddit": "AskHistorians",
  "id": "qaqi8r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well my question is pretty much laid out in the title. I'm familiar with\ncontroversies around Iraq back around 2000ish, but I had no idea Powell was\ninvolved in Vietnam at all.\n\nBasically I just came from a mention on Twitter that Powell led the military's\nattempt to hide the massacre - not just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の質問は、タイトルにある通りです。私がよく知っているのは\n私は2000年頃のイラクの論争についてはよく知っていますが、パウエルが\nベトナムに関わっていたことは全く知りませんでした。\n\n基本的には、パウエルが軍の虐殺を隠そうとする試みを主導したというツイッターでの言及から来たものです。\n虐殺を隠そうとしたということです。",
      "title": "米軍によるミライの虐殺事件の隠蔽工作において、コリン・パウエルが果たした役割とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的问题在标题中已经说得很清楚了。我很熟悉\n我熟悉2000年左右围绕伊拉克的争议，但我不知道鲍威尔曾参与越南问题。\n但我完全不知道鲍威尔参与了越南问题。\n\n基本上，我只是从推特上提到，鲍威尔领导军方的\n试图隐藏大屠杀--不仅仅是...",
      "title": "科林-鲍威尔在美国军方掩盖美莱大屠杀的努力中发挥了什么作用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的問題在標題中已經說得很清楚了。我很熟悉\n我熟悉2000年左右圍繞伊拉克的爭議，但我不知道鮑威爾曾參與越南問題。\n但我完全不知道鮑威爾參與了越南問題。\n\n基本上，我只是從推特上提到，鮑威爾領導軍方的\n試圖隱藏大屠殺--不僅僅是...",
      "title": "科林-鮑威爾在美國軍方掩蓋美萊大屠殺的努力中發揮了什麼作用？"
    }
  ]
}