{
  "author": "No_Platypus_8471",
  "the_new_excerpt": "I got this from browsing WSB. It is a pretty good post about AMC. Of course it\nis risky but it has the chance for people to make a bit of money from it. Again,\nthis is high risk, high reward if something similar happens to it like what\nhappened to GME. The difference is AMC has less short…",
  "original_created_utc": 1611829950,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是从浏览WSB得到的。这是一篇相当不错的关于AMC的帖子。当然，它\n是有风险的，但它有机会让人们从中赚点钱。又是。\n这是高风险，高回报，如果类似的事情发生在它身上，像什么？\n发生在GME身上。不同的是AMC的短线...",
      "title": "AMC借款费用"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是從瀏覽WSB得到的。這是一篇相當不錯的關於AMC的帖子。當然，它\n是有風險的，但它有機會讓人們從中賺點錢。又是。\n這是高風險，高回報，如果類似的事情發生在它身上，像什麼？\n發生在GME身上。不同的是AMC的短線...",
      "title": "AMC借款費用"
    }
  ],
  "title": "AMC borrowing fees",
  "created_utc": 1611849861,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got this from browsing WSB.  It is a pretty good post about AMC.  Of course it is risky but it has the chance for people to make a bit of money from it.  Again, this is high risk, high reward if something similar happens to it like what happened to GME.  The difference is AMC has less short interest.</p>\n\n<p>Thanks to the WSB poster who provided this info:</p>\n\n<p><a href=\"https://www.reddit.com/r/investing_discussion/comments/l6mpwl/hold_your_investments/gl21n74?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/investing_discussion/comments/l6mpwl/hold_your_investments/gl21n74?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n\n<p>Why the AMC squeeze hasn&#39;t happened yet:</p>\n\n<p>Take a look at this link ( <a href=\"https://iborrowdesk.com/report/AMC\">https://iborrowdesk.com/report/AMC</a> )and scroll down to recent data for AMC. Borrowing fees (meaning the rate at which the hedge funds have to pay to short the stock) have risen from 3.2% to 21.9% in the past day. This is a dramatic increase. However, that&#39;s only the beginning. This is GME&#39;s borrowing rates and available shares to short: <a href=\"https://iborrowdesk.com/report/gme\">https://iborrowdesk.com/report/gme</a></p>\n\n<p>If you look at GME&#39;s borrowing rates, the last time they were at 22% was 1/21/21 (6 days ago). 5 days later, the borrowing rates SPIKED up to 83%. This was also the same day the GME squeeze went crazy from 90 -&gt; 300. As Martin Shkreli said, keep your eye on the borrowing rates, not the short interest. The borrowing rates make the hedge funds nervous and is ultimately a huge factor for them having to cover. Covering leads to squeezing. I predict a similar, though not as significant squeeze as GME for AMC. This is something to keep an eye on.</p>\n\n<p>Shares available to short for AMC has also decreased from 10,000,000 6 days ago on 1/21 to &lt;200,000 as of close, meaning the hedge funds are getting greedy as fuck trying to make us lose!!!</p>\n\n<p>Additionally AMC is better off than it was during the pandemic. Their bankruptcy concerns are completely off the table with a billion in funding. They are also a very low market cap at 4B, meaning there is much bigger potential for their price to increase. Movies are not fucking dead, mark my words. AMC is due for a HUGE rally. There&#39;s room for both squeezes, lets fucking go boys.</p>\n</div><!-- SC_ON -->",
  "score": 339,
  "permalink": "/r/stocks/comments/l6tlga/amc_borrowing_fees/",
  "subreddit": "stocks",
  "id": "l6tlga",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518536229
}