{
  "author": "memmox",
  "original_created_utc": 1644692097,
  "title": "We need to do something about banks robbing us",
  "created_utc": 1644730853,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Banks collected $12.4 billion dollars in overdraft fees in 2020. That means banks took over $12 billion dollars from people with no money during a global pandemic.&lt;/p&gt;\n\n&lt;p&gt;My bank takes between $50/70 dollars in overdraft fees every quarter. \nYearly APY on my saving account is so bad that it’s actually never worth it.&lt;/p&gt;\n\n&lt;p&gt;I staked most of my crypto which gives me back so much more than my robber of a bank that when crypto goes mainstream we are saved from these robbers.&lt;/p&gt;\n\n&lt;p&gt;I do need my bank account because I have not a lot of other choices to pay for stuff or receive. I did learn to stake my savings after buying stable coins with it.&lt;/p&gt;\n\n&lt;p&gt;Cant wait for massive crypto adoptions.&lt;/p&gt;\n\n&lt;p&gt;Edit: I am debt free as of next month. I got lucky with a coin people on /CC dislike a lot. I sold it on it’s all time high and bought back at the recent crash and set aside the amount I needed for my debt. Next month is the last payment :)\nI wont make the same mistakes again.&lt;/p&gt;\n\n&lt;p&gt;Edit 2:&lt;/p&gt;\n\n&lt;p&gt;I actually said I dont want to be able to overdraft day one 1 signed there. I guess they did it wrong but at that moment I didnt bother changing it. Which was dumb&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/sqyfdw/we_need_to_do_something_about_banks_robbing_us/",
  "subreddit": "CryptoCurrency",
  "id": "sqyfdw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Banks collected $12.4 billion dollars in overdraft fees in 2020. That means\nbanks took over $12 billion dollars from people with no money during a global\npandemic.\n\nMy bank takes between $50/70 dollars in overdraft fees every quarter. Yearly APY\non my saving account is so bad that it’s actually…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "銀行は2020年に124億ドルの当座貸越手数料を徴収しました。これはつまり\n世界的にお金がない人が増えている中、銀行は120億ドル以上ものお金を奪っています。\nパンデミック\n\n私の銀行では、四半期ごとに50ドルから70ドルの当座貸越手数料を取られています。年利回り\n私の普通預金口座はあまりにひどいので、実は......。",
      "title": "銀行が私たちからお金を奪うのをどうにかしなければならない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "银行在2020年收取了124亿美元的透支费。这意味着\n银行在全球经济衰退期间从没有钱的人那里拿走了超过120亿美元。\n大流行。\n\n我的银行每季度收取50/70美元的透支费。我的储蓄账户每年的年利率\n是如此糟糕，以至于它实际上是...",
      "title": "我们需要对银行抢劫我们的行为做些什么"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "銀行在2020年收取了124億美元的透支費。這意味着\n銀行在全球經濟衰退期間從沒有錢的人那裏拿走了超過120億美元。\n大流行。\n\n我的銀行每季度收取50/70美元的透支費。我的儲蓄賬戶每年的年利率\n是如此糟糕，以至於它實際上是...",
      "title": "我們需要對銀行搶劫我們的行爲做些什麼"
    }
  ]
}