{
  "author": "AskMeAboutMyBandcamp",
  "the_new_excerpt": "Been hodling onto a small amount of LINK and BTC for years and years. I’m a\nstudent so I don’t have many opportunities to invest, but the investments have\nhelped me build a small but respectable nest egg for myself. Unfortunately\nunforseen car related circumstances have meant that I had fo transfer…",
  "original_created_utc": 1613507278,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几年来，我一直在囤积少量的LINK和BTC。我是一个\n学生，所以我的投资机会不多，但投资有。\n帮助我为自己建立了一个小而可敬的巢蛋。不幸的是\n由于不可预知的汽车相关情况，我不得不调... ...",
      "title": "衷心的感谢。再见了，朋友们，但我会回来的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年來，我一直在囤積少量的LINK和BTC。我是一個\n學生，所以我的投資機會不多，但投資有。\n幫助我爲自己建立了一個小而可敬的巢蛋。不幸的是\n由於不可預知的汽車相關情況，我不得不調... ...",
      "title": "衷心的感謝。再見了，朋友們，但我會回來的。"
    }
  ],
  "title": "A sincere thank you. Adios amigos, but I’ll be back.",
  "created_utc": 1613525645,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Been hodling onto a small amount of LINK and BTC for years and years. I’m a student so I don’t have many opportunities to invest, but the investments have helped me build a small but respectable nest egg for myself. Unfortunately unforseen car related circumstances have meant that I had fo transfer out my crypto. I have almost enough to cover major vehicle repairs, so I’m taking it all out. My initial investment in crypto was less than 100$, and over two years that number grew to a bit over a grand! Fantastic investment and I will be returning to crypto ASAFP, I just need to get my car fixed first lol. </p>\n\n<p>Thank you, you beautiful bastards. This broke ass student can get his car fixed. </p>\n\n<p>Also, in terms of the ease of withdrawal, I am mindblown. It was so easy and quick! My crypto was cash in my PayPal account within just minutes! I’m absolutely astounded and so happy at how easy it was! It’s just gonna get easier, lads! </p>\n\n<p>Hodl the line, and until I can invest again, thank you so much.</p>\n\n<p>EDIT: I wasn’t expecting such a mixed response. I’ve gotten some PMs and comments saying I will regret this and that I’m cowardly for not holding. I apologize to anyone I ticked off but a poor kid in rural Canada’s 400$ withdrawal is not going to crash the market. I need the money because I have loves ones that I need to support. I’m sorry.</p>\n</div><!-- SC_ON -->",
  "score": 370,
  "permalink": "/r/CryptoCurrency/comments/llct5x/a_sincere_thank_you_adios_amigos_but_ill_be_back/",
  "subreddit": "CryptoCurrency",
  "id": "llct5x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619140
}