{
  "author": "WestEasyx",
  "original_created_utc": 1652380147,
  "title": "After 13 years of Crypto, most of the market is still full of shit",
  "created_utc": 1652391103,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Now that we&amp;#39;ve had the latest face-melting event, and the crypto marketcap as a whole has plummeted from ``$3 trillion to $1.25 trillion, I thought it would be worthwhile to survey the landscape a bit and see where things stand. &lt;/p&gt;\n\n&lt;p&gt;Of the $1.25 trillion market cap, Bitcoin dominance is at 44.8%, Ethereum is at 19.3%, and when you account for (still) functioning stablecoins (USDT, USDC, BUSD, DAI) that makes up another 12%. All together, those 3 things make up 76% of the entire crypto marketcap. &lt;/p&gt;\n\n&lt;p&gt;Of the remaining 24%, some of the coins that still manage to crack the top 30  include Doge, Shib, XRP, UST (lol), BCH, and ETC.&lt;/p&gt;\n\n&lt;p&gt;So what is the takeaway here? After all of this time, the vast majority of the value created in this space has flown into just 2 assets, and 99% of the rest are pretty much dogshit.   &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in the markets since 2017, which hardly makes a hardened crypto alumni, yes somehow still seems to make me older than 95% of this sub, so here is a look back in time for those &amp;quot;new&amp;quot; here...   &lt;/p&gt;\n\n&lt;p&gt;This is a look at the top 20 coins from the end of 2016, how many do you recognize?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/4w3vo80043z81.png?width=1476&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=720dcd81a56962c01f4a613db44fdeb60d2a7192\"&gt;https://preview.redd.it/4w3vo80043z81.png?width=1476&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=720dcd81a56962c01f4a613db44fdeb60d2a7192&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;And 2017...&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/fmnxubpr33z81.png?width=1508&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=00b217504c9296f6b56c358ab297ed070b4dcace\"&gt;https://preview.redd.it/fmnxubpr33z81.png?width=1508&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=00b217504c9296f6b56c358ab297ed070b4dcace&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;and 2018...&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/wf3v1k4343z81.png?width=1470&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0738038a8808ce7375195b0e941041f8d8ab7b62\"&gt;https://preview.redd.it/wf3v1k4343z81.png?width=1470&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0738038a8808ce7375195b0e941041f8d8ab7b62&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I hate when people make these things absurdly long without getting to the point...so here it is....the number of projects we&amp;#39;ve seen come and go, projects that at one time were the darlings of this sub, is honestly laughable. Luna is one more casualty in a long, long list of examples. &lt;/p&gt;\n\n&lt;p&gt;The fact is that 99% of crypto investors that have made any sort of real and consistent money over the years have done so by regularly buying Bitcoin and Ethereum, as they can afford to, and then just holding. &lt;/p&gt;\n\n&lt;p&gt;It is so fucking simple guys, and most of you know this to be true. But every damn year there are some new toys to lose your life savings with, and people fall for it hook, line, and sinker every time. &lt;/p&gt;\n\n&lt;p&gt;If the 200% CAGRs of BTC and ETH aren&amp;#39;t good enough for you, and you need to dump everything you&amp;#39;ve got into fucking Willy Wonka coin or something, then godspeed and good luck.&lt;/p&gt;\n\n&lt;p&gt;But for those that are here to invest towards a better financial future for yourself and your family, and have the patience and temperance to do it, the writing is clearly on the wall for all of you to read.&lt;/p&gt;\n\n&lt;p&gt;“The two most powerful warriors are patience and time.” - Leo Tolstoy&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/uo7o8z/after_13_years_of_crypto_most_of_the_market_is/",
  "subreddit": "CryptoCurrency",
  "id": "uo7o8z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Now that we've had the latest face-melting event, and the crypto marketcap as a\nwhole has plummeted from ``$3 trillion to $1.25 trillion, I thought it would be\nworthwhile to survey the landscape a bit and see where things stand.\n\nOf the $1.25 trillion market cap, Bitcoin dominance is at 44.8%,…"
}