{
  "author": "coolcomfort123",
  "the_new_excerpt": "What is the Berkshire Hathaway ￼ mystery stock?\n\nWarren Buffett’s conglomerate could reveal that equity holding when it discloses\nits stock investments as of Dec. 31, 2020 on a securities filing expected late\nTuesday.\n\nSpeculation is that it could be Walt Disney ￼ (ticker: DIS), PayPal Holdings…",
  "original_created_utc": 1613396954,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "伯克希尔哈撒韦￼神秘股票是什么？\n\n巴菲特的企业集团在披露时，可能会透露该股权持有量\n其截至2020年12月31日的股票投资，预计将在晚些时候提交证券文件。\n周二。\n\n猜测可能是华特迪士尼￼（股票代码：DIS）、贝宝控股...",
      "title": "伯克希尔哈撒韦的神秘股票是什么？巴菲特的大手笔投资可能在明天披露。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "伯克希爾哈撒韋￼神祕股票是什麼？\n\n巴菲特的企業集團在披露時，可能會透露該股權持有量\n其截至2020年12月31日的股票投資，預計將在晚些時候提交證券文件。\n週二。\n\n猜測可能是華特迪士尼￼（股票代碼：DIS）、貝寶控股...",
      "title": "伯克希爾哈撒韋的神祕股票是什麼？巴菲特的大手筆投資可能在明天披露。"
    }
  ],
  "title": "What Is Berkshire Hathaway’s Mystery Stock? Big Investment by Warren Buffett Could Be Disclosed Tomorrow.",
  "created_utc": 1613409960,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What is the Berkshire Hathaway ￼ mystery stock?</p>\n\n<p>Warren Buffett’s conglomerate could reveal that equity holding when it discloses its stock investments as of Dec. 31, 2020 on a securities filing expected late Tuesday.</p>\n\n<p>Speculation is that it could be Walt Disney ￼ (ticker: DIS), PayPal Holdings ￼ (PYPL), Google parent Alphabet ￼ (GOOGL), Home Depot ￼ (HD), Exxon Mobil ￼ (XOM), or Chevron ￼ (CVX).</p>\n\n<p>When it released its most recent quarterly filing in mid-November for about $250 billion of equity holdings, Berkshire (BRK.B) said that it had made a confidential filing for unnamed investments, stating “Confidential information has been omitted from the public Form 13F report and filed separately with the U.S. Securities and Exchange Commission.”</p>\n\n<p>Berkshire CEO Buffett has rarely made use of a confidential filing in the past decade. The last such one was in 2015, and the mystery holding turned out to be Phillips 66 ￼ (PSX).</p>\n\n<p>The SEC can grant institutional investors confidential status if it agrees that public disclosure would move the stock price and make it more difficult for the investor to complete its buying program in the stock. It is possible that Berkshire will continue to keep the mystery holding confidential. News of a new Berkshire holding can sometimes boost the stock, thanks to the Buffett imprimatur.</p>\n\n<p>The mystery holding could be sizable, at $5 billion to $10 billion.</p>\n\n<p>Gary Black, a private investor and former CEO of both Aegon Asset Management and Janus Capital, surveyed his more than 50,000 Twitter followers and their top choices among four selections were Disney and PayPal.</p>\n\n<p>Black has been an influential bull on Tesla (TSLA), but said last week that he was out of the stock, citing the company’s lack of a clear forecast on 2021 deliveries and the risk of a first-quarter earnings miss.</p>\n\n<p>In recent quarters, Buffett has sold out of Berkshire’s holding in Goldman Sachs Group ￼ (GS), sharply reduced a stake in JPMorgan Chase ￼ (JPM), cut a longtime position in Wells Fargo ￼ (WFC) and bought stakes in a group of drug stocks notably Merck (MRK), AbbVie ￼ (ABBV), and Bristol Myers Squibb ￼ (BMY).</p>\n\n<p>Source: Barron&#39;s</p>\n\n<p>I think if Buffett select, it could be stable dividend payers such as xom, cvx and hd. But recent years his 2 managers will most likely pick techs, then googl and some other tech stocks will become target. Disney will be also favorable since it is the best recovery play stock with huge grow opportunity with streaming. What do you guys think.</p>\n\n<p>Thanks for the awards.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/stocks/comments/lke0lg/what_is_berkshire_hathaways_mystery_stock_big/",
  "subreddit": "stocks",
  "id": "lke0lg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624075
}