{
  "author": "That-Attitude6308",
  "original_created_utc": 1637842945,
  "title": "Did you know why Satoshi Nakomoto chose to be anonymous? Its supposedly because of the way US government treated Liberty dollar creator Bernard von NotHaus.",
  "created_utc": 1637861452,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: Bernard von NotHaus created a private currency that is backed by gold and US government bought criminal charges against him.</p>\n\n<p>The Liberty Dollar was a private currency system started in 1998 by Bernard von NotHaus, also co-founder of the Royal Hawaiian Mint Company and creator of the Free Marijuana Church of Honolulu. The name of the Indiana based company that produced Liberty Dollars was originally “National Organization for the Repeal of the Federal Reserve and the Internal Revenue Code” (NORFED), but it was later changed to the less inflammatory name, Liberty Services, to reduce negative attention.</p>\n\n<p>The premise of the Liberty Dollar was that unlike U.S. dollars and many world currencies, each Liberty Dollar was backed by a specific weight in precious metal. $20 Liberty Dollars were set to be one ounce of silver. Unlike most other forms of alternative currencies, each Liberty Dollar carried a U.S. face value, was exchanged for U.S. Dollars, and included not just paper currency but also minted coins. </p>\n\n<p>By 2007 Liberty Dollar’s attracted the attention of federal government officials. The exact legality of the currency was under debate by many government officials. At first, it was unclear if Liberty Dollars were being passed as counterfeit dollars because their likeness was too similar to the U.S. money, especially in light of the company’s original name. However, Claudia Dickens of the U.S. Treasury Department’s Bureau of Engraving and Printing was quoted as stating that it was not illegal provided that the bills did not say “legal tender”.</p>\n\n<p>This did not last long though since government officials soon found Liberty Dollars in violation of 18 U.S.C § 486 which forbids private citizens or companies from producing coins made of metal that are used for current money. In late 2007 the FBI launched a raid against the company, seizing the Liberty Dollars, the precious metal stores and computers used to store information. Soon after, the Liberty Dollar bank accounts were frozen and the company’s website was shut down. Legal troubles followed with creator Bernard Von NotHaus being convicted of several crimes related to creating his own coins along with one count of conspiracy. These convictions carry potentially steep penalties, that may also include forfeiture of the Liberty Dollars produced in precious metals. This last issue is still being ironed out in court, with the Liberty Dollars being worth $7 million in precious metal.</p>\n\n<p>The legal troubles faces by Bernard Von Nothaus is thought to be the reason why Satoshi Nakamoto chose to remain anonymous rather than expose himself to the mercy of the US government given the political situation at that time.</p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/CryptoCurrency/comments/r1vf3g/did_you_know_why_satoshi_nakomoto_chose_to_be/",
  "subreddit": "CryptoCurrency",
  "id": "r1vf3g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TLDR: Bernard von NotHaus created a private currency that is backed by gold and\nUS government bought criminal charges against him.\n\nThe Liberty Dollar was a private currency system started in 1998 by Bernard von\nNotHaus, also co-founder of the Royal Hawaiian Mint Company and creator of the\nFree…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR: バーナード・フォン・ノトハウズは、金に裏付けられた民間通貨を作り\n米国政府は彼を刑事告発しました。\n\nリバティ・ダラーは、1998年にバーナード・フォン・ノトハウズが始めた民間通貨システムです。\nノトハウが1998年に始めた民間通貨システムで、ロイヤル・ハワイアン・ミント・カンパニーの共同設立者でもあります。\nフリー...",
      "title": "中本哲史が匿名を選んだ理由を知っていますか？それは、リバティドルの生みの親であるバーナード・フォン・ノトハウズ氏に対するアメリカ政府の仕打ちが原因だと言われています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：伯纳德-冯-诺特豪斯创造了一种以黄金为支撑的私人货币，并且\n美国政府对他进行了刑事指控。\n\n自由美元是一个私人货币系统，由伯纳德-冯-诺特霍斯于1998年创立。\n诺特霍斯于1998年开始的，他也是夏威夷皇家造币公司的联合创始人，也是 \"自由美元 \"的创造者。\n自由...",
      "title": "你知道中本聪为什么选择匿名吗？据称是因为美国政府对待自由美元创造者Bernard von NotHaus的方式。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：伯納德-馮-諾特豪斯創造了一種以黃金爲支撐的私人貨幣，並且\n美國政府對他進行了刑事指控。\n\n自由美元是一個私人貨幣系統，由伯納德-馮-諾特霍斯於1998年創立。\n諾特霍斯於1998年開始的，他也是夏威夷皇家造幣公司的聯合創始人，也是 \"自由美元 \"的創造者。\n自由...",
      "title": "你知道中本聰爲什麼選擇匿名嗎？據稱是因爲美國政府對待自由美元創造者Bernard von NotHaus的方式。"
    }
  ]
}