{
  "author": "TheGalactico",
  "original_created_utc": 1638516844,
  "title": "Crypto.com Marketing Spend",
  "created_utc": 1638531043,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work in advertising sales at one of the largest media &amp;amp; entertainment companies on the planet. We closed a 1-year deal this week with CRO. Without sharing the exact number, I will say that their marketing spend is the single largest 1-year deal I’ve ever worked on in my 8-year career working with 400+ domestic &amp;amp; international advertisers. Their campaign kicks off next week &amp;amp; runs thru 2022 on National TV, digital, etc. If they’re spending this much on our networks, that means they’re likely spending just as much with the other major media networks/companies/platforms. Factor that in with their [former] Staples Center arena naming deal and their partnerships with UFC, Formula One, etc.. and you’ve got one of the largest marketing spends in recent history. I would not be surprised if they break some type of record for 1-year media spends. If Crypto.com isn’t already household name, I am absolutely certain that the size of their 2022 marketing campaign will make them one early next year. As the crypto space continues to trend upward in terms of mainstream adaption, my only hope is that casual first-time crypto investors will turn to Crypto.com if they want to dip their toes in the crypto space. They’re literally gonna see their ads everywhere. It’ll be natural. I’m not sure what that’ll do to the price/value of CRO (I’m no crypto expert) but I’d like to think their marketing efforts will yield positive results.&lt;/p&gt;\n\n&lt;p&gt;Disclaimer: Been a passive follower of this subreddit for a little while. Just paid &amp;amp; signed up to be a member today so that I could post. This is literally my first post ever. Just figured I’d share some info I think may be somewhat valuable to the community. Everyone knows crypto.com has spent a lot to get their name out there, but I don’t think most people really know how much. Just wanted to really put into perspective how massive their 2022 (&amp;amp; beyond) marketing campaign will be. Literally record breaking…&lt;/p&gt;\n\n&lt;p&gt;Edit: Also want to add that I’m currently involved in a similar 1-year negotiation with Coinbase, but their 2022 spend (with my company) is like pennies in comparison to Crypto.com.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/r7tm7s/cryptocom_marketing_spend/",
  "subreddit": "CryptoCurrency",
  "id": "r7tm7s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I work in advertising sales at one of the largest media & entertainment\ncompanies on the planet. We closed a 1-year deal this week with CRO. Without\nsharing the exact number, I will say that their marketing spend is the single\nlargest 1-year deal I’ve ever worked on in my 8-year career working with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、最大手のメディア＆エンターテインメント企業で広告営業に携わっています。\n地球上に存在する会社です。今週、CROと1年間の契約を結びました。しかし\n正確な数字は申し上げられませんが、彼らのマーケティング費用は、世界一です。\n私の8年間のキャリアにおいて、これまでで最大の1年契約...",
      "title": "Crypto.comのマーケティング費用"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在全球最大的媒体和娱乐公司之一从事广告销售工作。\n公司从事广告销售工作。本周我们与CRO公司完成了一项为期一年的交易。在不\n在不透露具体数字的情况下，我想说的是，他们的营销支出是我在8年的职业生涯中所处理过的最大的一笔\n在我8年的工作生涯中，最大的一笔一年期交易。",
      "title": "Crypto.com的营销支出"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在全球最大的媒體和娛樂公司之一從事廣告銷售工作。\n公司從事廣告銷售工作。本週我們與CRO公司完成了一項爲期一年的交易。在不\n在不透露具體數字的情況下，我想說的是，他們的營銷支出是我在8年的職業生涯中所處理過的最大的一筆\n在我8年的工作生涯中，最大的一筆一年期交易。",
      "title": "Crypto.com的營銷支出"
    }
  ]
}