{
  "author": "MentalUsurpation",
  "original_created_utc": 1642846074,
  "title": "This bear market actually revealed how \"financially fragile\" most of the crypto users are.",
  "created_utc": 1642870016,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For the record I am not including those who were in it since the beginning of July of last year.&lt;/p&gt;\n\n&lt;p&gt;One bear market was all that it took to send crypto users into total disarray. There are panic sellers, those that fearmonger --HOLY SHIT IT IS GOING TO $0. EVERYONE SHOULD PANIC SELL-- and there are those that keep calm and know that it is inevitable for BTC to bounce back where it was in November. But does that happen? Hell no. &lt;/p&gt;\n\n&lt;p&gt;Maybe some of you. But looking at social media, mostly Twitter, during the crash, most of the people are not cut out to invest, it seems regardless of how much they actually invest. But ultimately, I think it is a good thing since what it does is weed out the competiton so that there&amp;#39;s more profit for those that are &lt;em&gt;not&lt;/em&gt; fragile.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/s9zctz/this_bear_market_actually_revealed_how/",
  "subreddit": "CryptoCurrency",
  "id": "s9zctz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For the record I am not including those who were in it since the beginning of\nJuly of last year.\n\nOne bear market was all that it took to send crypto users into total disarray.\nThere are panic sellers, those that fearmonger --HOLY SHIT IT IS GOING TO $0.\nEVERYONE SHOULD PANIC SELL-- and there are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちなみに私は、年初から入っていた人は含めていません。\n昨年7月のことです。\n\n一度の弱気相場が、暗号ユーザーを総崩れにするのに必要なことだったのです。\nパニック売り、恐怖を煽る売り、「0ドルになるなんてとんでもない。\n誰もがパニック売りに走るはずだ......と。",
      "title": "今回の弱気相場は、実は暗号ユーザーの多くがいかに「財政的にもろい」かを明らかにした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了记录在案，我不包括那些从去年7月初开始就在其中的人。\n去年7月开始的人。\n\n一个熊市就能让加密货币用户完全陷入混乱。\n有一些恐慌性的卖家，那些鼓吹恐惧的人--好家伙，它要变成0美元了。\n每个人都应该恐慌性抛售--还有的人...",
      "title": "这个熊市实际上揭示了大多数加密货币用户的 \"金融脆弱性\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了記錄在案，我不包括那些從去年7月初開始就在其中的人。\n去年7月開始的人。\n\n一個熊市就能讓加密貨幣用戶完全陷入混亂。\n有一些恐慌性的賣家，那些鼓吹恐懼的人--好傢伙，它要變成0美元了。\n每個人都應該恐慌性拋售--還有的人...",
      "title": "這個熊市實際上揭示了大多數加密貨幣用戶的 \"金融脆弱性\"。"
    }
  ]
}