{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Friday, April 23, 2021\n\nStocks rose on Friday, largely recovering after a sharp sell-off yesterday\nfollowing news that President Biden was planning a proposal to increase the\ncapital gains tax rate on wealthy individuals. The S&P 500 (SPY) closed the day\n1.10% up, recording a…",
  "original_created_utc": 1619210530,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月23日（金\n\n2021年4月23日(金)の株式市場は、昨日の急激な売り越しから大きく回復して上昇しました。\n金曜日の株価は、バイデン大統領が富裕層に対するキャピタルゲイン税率の引き上げを計画しているというニュースを受けて、昨日の急激な売り越しから大きく回復しました。\n株式は、昨日、バイデン大統領が個人富裕層に対するキャピタルゲイン税率の引き上げを提案するとの報道を受けて急激に売られた後、大きく回復しました。S&P 500 (SPY)は、この日の終値で\n1.10%上昇し、終値では...",
      "title": "本日2021年4月23日（金）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月23日，星期五\n\n周五股市上涨，在昨天的大幅抛售后基本恢复。\n此前有消息称拜登总统正计划提出增加\n昨日有消息称拜登总统计划提高富人的资本利得税税率，此后股市基本恢复。标准普尔500指数（SPY）当天收盘时\n上涨1.10%，录得...",
      "title": "以下是今天（2021年4月23日，星期五）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月23日，星期五\n\n週五股市上漲，在昨天的大幅拋售後基本恢復。\n此前有消息稱拜登總統正計劃提出增加\n昨日有消息稱拜登總統計劃提高富人的資本利得稅稅率，此後股市基本恢復。標準普爾500指數（SPY）當天收盤時\n上漲1.10%，錄得...",
      "title": "以下是今天（2021年4月23日，星期五）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Friday, April 23, 2021",
  "created_utc": 1619228993,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Friday, April 23, 2021</strong></p>\n\n<p>Stocks rose on Friday, largely recovering after a sharp sell-off yesterday following news that President Biden was planning a proposal to increase the capital gains tax rate on wealthy individuals. The S&amp;P 500 (SPY) closed the day 1.10% up, recording a fresh intraday high. The Dow Jones (DIA) closed 0.67% up and the tech-heavy Nasdaq (QQQ) closed 1.26% higher.</p>\n\n<p>Yesterday, stocks sold off sharply following a report by <a href=\"https://www.bloomberg.com/news/articles/2021-04-22/biden-to-propose-capital-gains-tax-as-high-as-43-4-for-wealthy\">Bloomberg</a> suggesting President Biden will propose almost doubling the capital gains tax rate for wealthy individuals earning $1 million or more per year to 39.6% to help pay for a slew of social programs and the proposed infrastructure bill. The new 39.6% rate would almost double the tax rate from the current base rate of 20%,  people familiar with the matter said on the condition of anonymity because the plan is not yet public. The proposal could reverse a long-standing provision of the tax code that taxes returns on investment lower than on labor salary. </p>\n\n<p>However, the sharp bounce-back in equities today suggests the initial sell off was overdone. As we have suggested in previous recaps, the current high valuations of many companies even as corporate earnings blow past analyst expectations suggest there is froth in the market. In other words, the market is pricing in the most positive news, so it is not surprising to see any bad news sparking a sharp selloff. As Kathy Jones, chief fixed income strategist at Charles Schwab said, “I think the immediate reaction was probably a bit overdone. These proposals come out and you never know, especially with tax proposals, where we&#39;ll end up. So it looks like an opening bid. I&#39;m sure there will be intense lobbying from the investment community to adjust those numbers. But I think at the moment, when you have very high valuations in the market, anything that is bad news can spark a bit of a sell-off.&quot;</p>\n\n<p>In other news, the Labor Department’s Weekly Unemployment Report blew past analyst expectations for the second straight, signaling improving conditions in the labor market and corroborating the pick-up in economic activity as the economy reopens. </p>\n\n<ul>\n<li><strong>Initial jobless claims, week ended April</strong> <strong>17:</strong> 547,000 vs. 610,000 expected and below last week&#39;s total of 576,000</li>\n<li><strong>Continuing claims, week ended April 3:</strong> 3.674 million vs. 3.650 million expected and below last week’s total of 3.708 million </li>\n</ul>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Kathy Entwistle, managing director at Morgan Stanley (MS), “we’re going to have our own form of the Roaring Twenties.” <a href=\"https://finance.yahoo.com/video/u-economy-own-form-roaring-183205436.html\">(Full quote here)</a></li>\n<li>According to the<a href=\"https://www.census.gov/construction/nrs/pdf/newressales.pdf\"> Department of Commerce</a>, new home sales surged 20.7% in March compared to February, well above the  14.2% expected for the highest monthly surge since 2006.</li>\n<li>The U.S. manufacturing sector&#39;s preliminary purchasing managers&#39; index for April rose to 60.6, from 59.1 in March,<a href=\"https://www.bloomberg.com/news/articles/2021-04-23/u-s-business-output-expands-most-on-record-ihs-markit-says\"> IHS Markit reported Friday.</a> This marked the highest level since the firm began tracking the metric. </li>\n<li>The Biden administration wants to spend $174 billion to boost electric vehicles and charging stations but its 2030 climate emissions reduction pledge released on Thursday does not include a firm date to phase out gasoline-powered vehicles. &quot;These autos are coming. We know it. It is the future,&quot; White House climate adviser Gina McCarthy said of EVs at an event in Washington promoting administration efforts to boost EV charging.</li>\n<li>In the wake of the fatal crash of a Tesla car in Texas on Saturday, two U.S. senators have expressed concern about what they said may be an emerging pattern of safety concerns involving Tesla vehicles. </li>\n<li>**<strong>Please note that current stock price was written during the session and may not reflect closing prices*\\</strong>*</li>\n<li>Snapchat (SNAP) with two target raises after massively outperforming earnings. Stock currently around $61\n\n<ul>\n<li>Morgan STanley from $74 to $75 at Overweight. </li>\n<li>Barclays from $66 to $75 </li>\n</ul></li>\n<li>Skechers (SKX) target raised by UBS Group from $52 to $57 at Buy. Stock currently around $52. Stock gapped up 14% today</li>\n<li>Mattel (MAT) target raised by DA Davidson from $23 to $28.50 at Buy. Stock currently around $21</li>\n<li>DR Horton (DHI) with two target raises. Stock currently around $98\n\n<ul>\n<li>Raymond James from $91 to $110 at Outperform</li>\n<li>BTIG Research from $108 to $124 at Buy</li>\n</ul></li>\n<li>Discover Financial Services (DFS) with two target raises. Stock currently around $103\n\n<ul>\n<li>Barclays from $111 to $132 at Overweight.</li>\n<li>Deutsche Bank from $110 to $120 at Hold</li>\n</ul></li>\n<li>Alphabet (GOOG, GOOGL) target raised by BMO Capital Markets from $2350 to $2600 at Outperform. Stock currently around $2300</li>\n</ul>\n\n<p>“The secret of getting ahead is getting started.” – Mark Twain.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/stocks/comments/mx4mf7/here_is_a_market_recap_for_today_friday_april_23/",
  "subreddit": "stocks",
  "id": "mx4mf7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214690
}