{
  "author": "hirokinai",
  "original_created_utc": 1645599964,
  "title": "Crypto has absolutely ruined stocks for me.",
  "created_utc": 1645641415,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Crypto has absolutely destroyed my incentive to even look at my stock portfolio. &lt;/p&gt;\n\n&lt;p&gt;Before crypto I was a major stocks and options investor, who bought high dividend aristocrats like AT&amp;amp;T, then sold covered calls whenever there was an uptick in price on a relatively stable asset. 10% dividends plus options premiums made me drool like you wouldn’t believe. I did put spreads to buy stocks I believed in, iron condors during low volatility phases, the works. I made enough to put a down payment on a house through slow methodical management of my portfolio, while hedging and making money off premiums rather than gambling. &lt;/p&gt;\n\n&lt;p&gt;Now I yoloswag into new defi protocols like Mmf and darkcrypto, and consistently make 200-700% APR like nobody’s business, even while gaining appreciation on my coins. I still monitor risk and stay away from shitcoins, but I’m constantly yield farming protocols that have gained some traction, and go ham into new protocols that check the boxes for me. 100$ per day from yields on only 10k invested is common now, even during the recent downturn, where before 10k invested meant $100 per MONTH. &lt;/p&gt;\n\n&lt;p&gt;It’s absolutely RUINED stocks for me. I went from daily management of my portfolio on fidelity, schwab, and even Robinhood, and have since transferred all of my non-retirement stocks into m1finance (which auto rebalances and DCAs) and look at it once a week at best. &lt;/p&gt;\n\n&lt;p&gt;What a ride it’s been. Even as the market tumbled, I’m happily plugging away at the different yield farming opportunities, and While I do have the occasional loss on a protocol that I miscalculated the fall, the winners have made up for the rare loss 10x over. &lt;/p&gt;\n\n&lt;p&gt;As I get older and need more stability, I’m sure I’ll return, but as it is, crypto is my roller coaster, and stocks are the teacup ride that you’re forced to go on because your niece can’t go on any other ride. &lt;/p&gt;\n\n&lt;p&gt;TL;DR: crypto defi return (and loss) potentials blow all stock plays out of the water, and is my crack cocaine.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/szb56a/crypto_has_absolutely_ruined_stocks_for_me/",
  "subreddit": "CryptoCurrency",
  "id": "szb56a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Crypto has absolutely destroyed my incentive to even look at my stock portfolio.\n\nBefore crypto I was a major stocks and options investor, who bought high\ndividend aristocrats like AT&T, then sold covered calls whenever there was an\nuptick in price on a relatively stable asset. 10% dividends plus…"
}