{
  "author": "yaroslavwwe",
  "original_created_utc": 1658714528,
  "title": "If you suddenly made $50M from crypto. What would you do?",
  "created_utc": 1658775250,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s say that you invested in crypto, and that investment paid off BIG TIME, from night to day you made 50 Million dollars, what would you do? We are talking about life changing money right here.&lt;/p&gt;\n\n&lt;p&gt;I know it&amp;#39;s unlikely to happen to the normies of this sub, but it&amp;#39;s still healthy to dream about getting rich right? It&amp;#39;s our goal when investing after all. &lt;/p&gt;\n\n&lt;p&gt;I really want to know your crypto exit plan, but on steroids, 50 Million after all. &lt;/p&gt;\n\n&lt;p&gt;Personally, I would try to keep it as low key as possible, you always hear about people that win the lottery and then get harassed 24/7. And I don&amp;#39;t want any of it. So I would try to hide that info as much as I could until I&amp;#39;m actually comfortable.&lt;/p&gt;\n\n&lt;p&gt;Then I would save money just to pay taxes, as I always see people forgetting about it and ending up in bad places.&lt;/p&gt;\n\n&lt;p&gt;Then I would created another passive income for myself, maybe buy a apartment complex and then rent it? I don&amp;#39;t know, but something like that.&lt;/p&gt;\n\n&lt;p&gt;What about you?&lt;/p&gt;\n\n&lt;h1&gt;Edit: Damn so many comments!!&lt;/h1&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/w7cdhr/if_you_suddenly_made_50m_from_crypto_what_would/",
  "subreddit": "CryptoCurrency",
  "id": "w7cdhr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Let's say that you invested in crypto, and that investment paid off BIG TIME,\nfrom night to day you made 50 Million dollars, what would you do? We are talking\nabout life changing money right here.\n\nI know it's unlikely to happen to the normies of this sub, but it's still\nhealthy to dream about…"
}