{
  "author": "Plus-Staff",
  "original_created_utc": 1629748687,
  "title": "Should the majority of Latin American countries during the Cold War be considered “satellite states” of the United States, just like the majority of Eastern Europe being satellites of the Soviet Union?",
  "created_utc": 1629806077,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Soviet Union under Stalin installed communist governments in Eastern Europe. Khrushchev and Brezhnev made sure they were still communist, but relaxed their restrictions on the states. They did however launch invasions of Hungary, Yugoslavia and Poland when communism or the Warsaw Pact looked to be threatened.</p>\n\n<p>With the CIA manipulating governments and sponsoring coups in Guatemala, Brazil, Chile, Argentina etc, should the majority of Latin American states during that period be considered satellites?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/pa7j6t/should_the_majority_of_latin_american_countries/",
  "subreddit": "AskHistorians",
  "id": "pa7j6t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Soviet Union under Stalin installed communist governments in Eastern Europe.\nKhrushchev and Brezhnev made sure they were still communist, but relaxed their\nrestrictions on the states. They did however launch invasions of Hungary,\nYugoslavia and Poland when communism or the Warsaw Pact looked to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スターリン率いるソビエト連邦は、東欧に共産主義政権を樹立した。\nフルシチョフとブレジネフは、これらの国が依然として共産主義であることを確認しつつ、国家に対する規制を緩和しました。\n国家に対する規制を緩和した。しかし、彼らはハンガリー、ユーゴスラビア、ポーランドへの侵攻を開始した。\nしかし、共産主義やワルシャワ条約加盟国が...と思ったときには、ハンガリー、ユーゴスラビア、ポーランドに侵攻しました。",
      "title": "東欧の大半がソ連の衛星であったように、冷戦時代の中南米の大半の国々は、アメリカの「衛星国」と考えるべきなのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "斯大林领导下的苏联在东欧建立了共产主义政府。\n赫鲁晓夫和勃列日涅夫确保他们仍然是共产主义者，但放松了对各国的\n对各州的限制。然而，他们确实对匈牙利、南斯拉夫和波兰发动了入侵。\n南斯拉夫和波兰，当共产主义或华沙条约组织希望...",
      "title": "冷战时期的大多数拉美国家是否应该被视为美国的 \"卫星国\"，就像大多数东欧国家是苏联的卫星一样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "斯大林領導下的蘇聯在東歐建立了共產主義政府。\n赫魯曉夫和勃列日涅夫確保他們仍然是共產主義者，但放鬆了對各國的\n對各州的限制。然而，他們確實對匈牙利、南斯拉夫和波蘭發動了入侵。\n南斯拉夫和波蘭，當共產主義或華沙條約組織希望...",
      "title": "冷戰時期的大多數拉美國家是否應該被視爲美國的 \"衛星國\"，就像大多數東歐國家是蘇聯的衛星一樣？"
    }
  ]
}