{
  "author": "kola401",
  "original_created_utc": 1624908676,
  "title": "Bitcoiners need to be more tolerant of opposing views, no matter how unpopular they may be.",
  "created_utc": 1624934272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I consider myself an open-minded person who believes in innovation that will improve the world and make it a better place. I think the poor and underprivileged deserve a chance to improve their lives and I am not opposed to helping them out.  However, I am against Bitcoin because it&#39;s obviously a scam. </p>\n\n<p>Eventhough I don&#39;t really know how it works or how to use it, I have the feeling that it will not improve the world or make it a better place.  I think I know what it is enough to judge it without needing to learn about it because the name sounds simple. </p>\n\n<p>It&#39;s a coin on the internet. </p>\n\n<p>Eventhough I will never pretend to know how physics, neuroscience or chemistry work, I know how bitcoin works without needing to learn about it.  Eventhough I have no experience with decentralized systems, cryptography, peer-to-peer networks, or money itself, I have enough experience with scams and empty promises to know that Bitcoin is a scam.  </p>\n\n<p>I do think I am smarter than most people. Most people don&#39;t believe in Bitcoin. I , like 99% of the population, think Bitcoin is a scam and only morons would buy it. Because we are smart, we won&#39;t get scammed.  </p>\n\n<p>We don&#39;t need Bitcoin because it is not backed by anything. My money is backed by a government. I can trust my government because all governments are trustworthy and never print out too much money that will devalue our currency. </p>\n\n<p>This is why house prices have been the same for the past 100 years, and are affordable for everyone. This is how my parents bought this house for us 50 years ago. Now if we sell it, we can make half a million dollars. This is thanks to the government. </p>\n\n<p>Bitcoin is backed by what? It&#39;s backed by nothing. There is no government, no bank, no institution or company behind it. It&#39;s just a bunch of computers. Computers are untrustworthy. You can&#39;t trust a computer. Computers crash. They malfunction. You can trust the government because people are more trustworthy and uncorruptable.</p>\n\n<p>And don&#39;t even mention the fossil fuels used by Bitcoin itself. This is just ridiculous. I don&#39;t want to be part of that. I don&#39;t want to contribute to destroying the planet. I consider myself a person who cares and protects the planet that&#39;s why I only use electric cars and eat organic. </p>\n\n<p>Eventhough I understand poor people can&#39;t afford anything because their savings get devalued every year, I think their problems will be solved once they get a real job and work harder. Then they can retire in the house their parents bought them and contribute to our cause by getting their own electric cars.</p>\n\n<p>Why do we even need to waste so much energy on Bitcoin when we have banks? Banks don&#39;t use up fossil fuels. </p>\n\n<p>I have the feeling that the Bitcoin community is just full of greedy people who only care about making money. In my opinion, and in the opinion of almost everyone I know, only greedy people would buy something like that.</p>\n\n<p>I don&#39;t have any experience. And I don&#39;t care about Bitcoin. It&#39;s irrelevant to my life. I won&#39;t use it and I don&#39;t want to use it.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/o9rk04/bitcoiners_need_to_be_more_tolerant_of_opposing/",
  "subreddit": "Bitcoin",
  "id": "o9rk04",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I consider myself an open-minded person who believes in innovation that will\nimprove the world and make it a better place. I think the poor and\nunderprivileged deserve a chance to improve their lives and I am not opposed to\nhelping them out. However, I am against Bitcoin because it's obviously a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自分自身を、世界を改善し、より良い場所にするための革新を信じる、オープンマインドな人間だと思っています。\n世界を改善し、より良い場所にするためのイノベーションを信じているオープンマインドな人間だと思っています。貧しい人々や\n貧しい人々や恵まれない人々にも生活を向上させるチャンスがあると思いますし、彼らを支援することに反対はしません。\n助けることに反対はしません。しかし、ビットコインには反対です。なぜなら、ビットコインは明らかに...",
      "title": "ビットコインユーザーは、どんなに不人気な意見であっても、反対意見に寛容になる必要があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为自己是一个思想开放的人，相信创新会改善世界，让世界变得更美好。\n改善世界，使之成为一个更美好的地方。我认为穷人和弱势群体应该有机会改善他们的生活。\n我认为穷人和弱势群体应该有机会改善他们的生活，我不反对帮助他们。\n帮助他们。然而，我反对比特币，因为它显然是一个...",
      "title": "比特币人需要对反对意见更加宽容，无论它们多么不受欢迎。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲自己是一個思想開放的人，相信創新會改善世界，讓世界變得更美好。\n改善世界，使之成爲一個更美好的地方。我認爲窮人和弱勢羣體應該有機會改善他們的生活。\n我認爲窮人和弱勢羣體應該有機會改善他們的生活，我不反對幫助他們。\n幫助他們。然而，我反對比特幣，因爲它顯然是一個...",
      "title": "比特幣人需要對反對意見更加寬容，無論它們多麼不受歡迎。"
    }
  ]
}