{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "Greetings to the most intelligent people on the planet!\n\nI've been playing with GME and the other charts recently, and it all accumulated into a massive piece of delicious TA,  which I didn't really plan to post to WSB originally - because I felt like some of the honorable WSB residents might be a little tired from that particular stonk. However, after seening [this](https://www.reddit.com/r/wallstreetbets/comments/pppfro/tmc_spotted_the_cock_and_balls_upside_down_head/) and [this](https://www.reddit.com/r/wallstreetbets/comments/pph9f0/as_you_can_see_tmc_is_forming_a_classic_nut_sack/) beautiful examples of intellectual superiority, I just couldn't resist sharing my hard work with you, dear WSB!(If you, dear reader, are the one who is fed up with GME, then I would recommend you stop reading now and follow the two links above to appreciate HQ TA on other stonks).\n\nFor those, who stayed - enjoy the read!\n\nIt all started from my “L'Oreal shampoo commercial”-like hair bet post, where, in its third chapter, I was theorizing about GME's negative beta (particularly in light of the late January events, when the buy button was disabled) and the current general market setup - how it might influence subsequent GME moves. So, I decided to dive deeper into those correlations and deviations between the price movements of GME and other major assets, using January sneeze as the starting point. This led me to a fascinating, tits-jacking discovery that points at the upcoming inevitable volatile price action!\n\nBuckle up for the TA journey of your life, let’s ~~dive~~ fly in!\n\nOh, almost forgot to quote Jack Black:\n\n>“This is not the financial advice, no.  \n>  \n>This is just a tribute.  \n>  \n>Couldn't remember becoming a financial advisor, no.  \n>  \n>This is a tribute, oh, to the greatest stonk in the world, alright!”\n\n&#x200B;\n\nFirst things first, it’s a good idea therefore to revisit **late Jan events**, which in my opinion was the moment of revelation and a preview of inevitable storm, when:\n\n&#x200B;\n\n# I. The North Remembers:\n\n&#x200B;\n\n&#x200B;\n\n[GME v VIX v SP, 30 min chart](https://preview.redd.it/yu1zzckpa2o71.jpg?width=2388&format=pjpg&auto=webp&s=e10bd82e172e82ea16a68da5c9c4a9c3e07f70ff)\n\n* GME shares added more than 500% in less than two days, showing off its negative beta in all glory,\n* making VIX volatility index explode more than 60% in a single day,\n* and injuring SP badly (sharp decline of about 4% in 21 hours).\n\n&#x200B;\n\nAt this point, the thesis should sound something like GME🆙VIX🆙=SP🆘, and vice versa. It will be developed further in the next chapters.\n\n&#x200B;\n\nAlso, quoting my bet post here:\n\n&#x200B;\n\n>Pepperidge apes should remember that during one of the Gamestop congressional hearings Vlad 'the Stock Implaler' Tenev mentioned something about late January events falling into five-sigma category, which scientifically speaking corresponds to a p-value, or probability, of 3x10-7, or about 1 in 3.5 million. He also used such a hackneyed expression as a 'black swan' event.  \n>  \n>...  \n>  \n>Categorizing January craze as five sigma is debatable to say the least, because Gamestop shares started to skyrocket and multiply in price long before late January, and it doesn't take a lot of wrinkles to understand that the volatility should likely increase further, requiring additional collateral and somewhat decent risk management. However, I'm not going to discuss Vlad's choice of sacrificing Robbinhood users (disabling buy button) in order to protect the solvency of Robbinhood customers (Citadel and co), because that has been done enough times already, and the North remembers. Rather, Robbinhood example and Vlad's interpretation are provided here as a vivid illustration of the fact which we all feel deep inside: there is just too much risk in the market, it is being too much fucking over-leveraged so that even a fucking retail stock broker may easily get margin-called in a matter of hours. It is especially hilarious, considering the fact that unsophisticated actions of buying and holding a particular stock is enough to fuck the system, making the entire house of cards fall apart. The problem is that when you dive deeper, 2008 seem to be a blessing.\n\n&#x200B;\n\nFurthermore, I should recommend  you reading u/peruvian_bull Endgame series, and/or u/Criand the Bigger Short in order to develop the understanding of the fundamental processes taking place under the hood of the financial markets. To sum up the core idea: the financial system is over-levereged, way more than it was in 2008, and coupled with the industry poor risk assessment standards, it is heading to the next, coming soon, financial crisis. And, in my opinion, what you can see on the charts above, was a sneak peak of the house of cards collapsing. Disabling the buy button was the only option for the big moni guys to stop (or rather to postpone) the system failing miserably. By bringing this dirty trick into play they were able to ~~buy~~ steal some time, which was necessary for deploying emergency measures and urgent market mechanisms (such as new DTCC/NSCC rules) - which, in turn, are aimed at mitigating the inevitable financial hail**shit**storm, ready to hit the fans.\n\nThere is a plenty of outstanding fundamentals DD on that topic (start from clicking profiles in the paragraph above). As for me, I am the TA type of a wrincle-brained ape, so...\n\nLet me speak from my ~~heart~~ charts.\n\n&#x200B;\n\n# II. Negative beta more beautiful than Catherine Zeta\n\n&#x200B;\n\nLet's start from something that you must have heard about many times, but did you really dive into GME exceptional beta? So, what's that thing and why is it so negative? For the sake of saving my and your time, let me quote the almighty Inve**stop**edia:\n\n&#x200B;\n\n>In investing, beta does not refer to fraternities, product testing, or old videocassettes. Beta is a measurement of market risk or volatility. That is, it indicates how much the price of a stock tends to fluctuate up and down compared to other stocks.  \n>  \n>The value of any stock index, such as the Standard & Poor's 500 Index, moves up and down constantly. At the end of the trading day, we conclude that \"the markets\" were up or down. An investor considering buying a particular stock may want to know whether that stock moves up and down just as sharply as stocks in general. It may be inclined to hold its value on a bad day or get stuck in a rut when most stocks are rising; whereas the beta is the number that measures a stock's volatility, the degree to which its price fluctuates in relation to the overall stock market. In other words, it gives a sense of the stock's risk compared to that of the greater market's.  \n>  \n>Beta is used also to compare a stock's market risk to that of other stocks. Analysts use the Greek letter 'ß' to represent beta.Beta is calculated using regression analysis. A beta of 1 indicates that the security's price tends to move with the market. A beta greater than 1 indicates that the security's price tends to be more volatile than the market. A beta of less than 1 means it tends to be less volatile than the market.  \n>  \n>**Negative beta**: A beta less than 0, which would indicate an inverse relation to the market, is possible but highly unlikely.\n\nEssentially, negative beta asset is an asset that tends to move in the opposite direction from the general market. Famous precious metal is one of the good examples: gold and gold stocks have negative betas because they tend to do better when the stock market declines. That is exactly the reason why investors cherish this asset in the turbulent time of recessions, market crashes and corrections, or general uncertainty and volatility - historically gold tends to perform well during such periods, providing the 'safe heaven' to market participants and acting as a hedge. Noice, but this turbulent time we have something special on the horizon.\n\n\\*\\*Le wild negative beta unicorn appears\\*\\*\n\n[Captain GME to gold](https://preview.redd.it/rpv734w9c2o71.png?width=471&format=png&auto=webp&s=56080fa590e5ecb6f65ad1a72329cd4d12569014)\n\nMany of you must have seen -ß posts, but math and numbers are for geniuses, retards only understand crayons and visuals, so...\n\nLadies and gentleapes, with the great pleasure I present you the new negative beta king:\n\n[GME v SP, daily chart](https://preview.redd.it/iwtaoohhc2o71.jpg?width=2039&format=pjpg&auto=webp&s=67b2824b31bf155c6f7d5f992c5141f67a82cdfb)\n\nWhat you see on the chart above is a vivid illustration of GME's negative beta behavior, which commenced during/after the January sneeze. As for SP, the stable uptrend with the minor corrections is evident, while the asset is achieving ATHs on a regular basis. Looking at the GME now and connecting its highs with the median line, we may observe the opposite trend, as the line is descending. All in all, there is a big-ass convergence manifesting between the two assets, which most probably will result in the increased volatility and the explosive GME breakout / trend reversal for SP. Who will blink first?\n\n&#x200B;\n\n[GME v SP daily chart + Tower of Pisa](https://preview.redd.it/3fiwmwwqc2o71.jpg?width=2033&format=pjpg&auto=webp&s=63ecddcaa4651b946a4df8541409c8d8e547d435)\n\nNext, take a look at this chart. Don't worry about GME's Pisa offset here, as it is insignificant for the point I'm making (and I had some struggles overlaying the charts in this case). If the previous chart indicates a longer term negative correlation, the one above is like a zoom in: there is an obvious series of divergences and convergences highlighted yellow and blue respectively, which illustrate negative beta again, but on a smaller scale and with local trends. As you can see, as soon a GME bullrun commences and accelerates, SP dips, and vice versa. I hope, that the examples provided are persuasive, and that they helped you to reach the same conclusion as I did, namely: sstonk goes up when stonks go down, while when stonks go up, GME is suppressed = GME🆙SP🆘. Should that correlation continue manifesting itself (which I'm pretty damn confident it will), the exciting times are on the way.\n\nOk, so 🆙🆘 is a simple concept, but why is it important, you may ask.\n\nWell, that's why:\n\n[SP, daily chart ](https://preview.redd.it/6b41eaewc2o71.jpg?width=2388&format=pjpg&auto=webp&s=d9ae4bdc7758ecdbc84425e6ea567e1d4243f9e1)\n\nSP has been forming a powerful bearish technical formation called the rising wedge, through the past year and a half. Currently it is narrowing down, and the point of breakout is not far away - typically it is to the downside for such a technical setup. Add GME with its negative beta to this equation - if you know, you know.\n\n[SP 4H chart, I called it ‘Head of Penis’ formation ](https://preview.redd.it/sbs9va8od2o71.jpg?width=2388&format=pjpg&auto=webp&s=ce9b57e1a6fa2020ac1c91218ad5d462ceda5d07)\n\nBut wait, there’s more!\n\n[SP, monthly chart ](https://preview.redd.it/1goqfoa2e2o71.jpg?width=2388&format=pjpg&auto=webp&s=e3eefcd4720f38907877a2791ea642c3955122b5)\n\nIn one of my TA longwrites, the Big Short 2.0, I identified a beautiful, long term, juicy Elliott 1-2-3-4-5 impulse wave structure on SP, take a look! The investors are currently riding the top of the fifth wave, which is usually the most fun, euphoric and crazily risky. Everything in the nature works in cycles, and all the things that go up, must go down eventually! Considering the current bullrun being one of the (if not THE) most powerful and longest bullruns in history, you can imagine how nasty the retrace may look this time. Especially, when you take into account the fact that current financial markets are filled with shitty synthetic derivatives, excessive leverage of a bad quality, unthinkable level of risk, and... plain fucking crime. The financial world is craving for the correction (like Sahara for rainfall) and a proper bear market, as the deleveraging will make it healthier, and maybe, just maybe, it will bring price discovery back to life from the grave where it has been rolling for I don’t know how long.\n\nMan, I wish there was a safe heaven asset that would protect me from the upcoming financial typhoon, the price of which would move the opposite way from the overdue nasty correction on all financial markets, which have been enjoying the most powerful bullrun in history for more than ten fucking years... Oh, wait!\n\n[Vasco da Gama can’t be wrong ](https://preview.redd.it/gt1rnbz7e2o71.png?width=571&format=png&auto=webp&s=9f6db503236cce3d87f8c4511221e8b5e30f91bb)\n\n&#x200B;\n\n# III. Chew it Over with VIX\n\n&#x200B;\n\nNext, let’s talk about Volatility Index - what I noticed recently, is that VIX is often being neglected in the TA discussions, and in general also, so it’s a good idea to show it some love. Especially since GME and VIX correlate to a considerable fucking extent, but later on that.\n\nTo begin with,\n\n[VIX, monthly chart ](https://preview.redd.it/1fcd3vlge2o71.jpg?width=2388&format=pjpg&auto=webp&s=78c23f899b3d623552b4b402c0abe74266108223)\n\nThe chart above is provided for the visual explanation of how this instrument behaves. In short, markeds kaboom TWIX wroom wroom. In essence, the Cboe Volatility Index is a market sentiment tracking index that represents the market participants expectations for volatility over the coming 30 days. Volatility, or the severity of price fluctuations, is usually helpful to gauge market sentiment, particularly the degree of fear and uncertainty spreading on the financial markets. Investors use VIX to measure the level of risk, fear, or stress in the market when making investment decisions. It is an important index in the world of finance because it provides a quantifiable measure of market risk and investors' sentiments.\n\nAnd who would have guessed, throughout the year VIX spikes have been accompanying almost every single GME major run, but for one:\n\n[GME v VIX, daily log chart](https://preview.redd.it/ksd03p5pe2o71.jpg?width=1969&format=pjpg&auto=webp&s=835dee5dd6c8b5367088857995e01a720f41f13a)\n\nJust one major outlier to that tandem is late November 2020 run. Speaking of outliers, also VIX middle of June 2021 spike seems to stand out from the crowd, as there is no relevant proportionate positive price action on the GME side. Outside of those two occasions, the correlational behaviour of these two instruments is evident. Moreover, VIX and GME runs correlate to the extent that their peaks match time-wise in several run ups. Furthermore, take a look at how starting 2021 four out of five major VIX spikes correspond with the occasions when GME’s price action was trialling $230-ish level (margin call level, it seems) - the price territory, around which my concept of the ‘Purple Haze’ resistance (“break to initiate the squeeze”) is established, refer to the short squeezes comparisons post to explore the concept. The correlational behaviour described above, to my understanding, points at two big conclusions: the first and the most obvious one, is GME🆙VIX🆙; secondly, it seems that GME is currently the biggest risk for the market! - too much synchronicity is present between the two, for this to be a mere coincidence. Remember, VIX represents volatility, fear and stress - wut feelin Kenny?\n\nOh, and did I mention?\n\n[VIX, daily chart ](https://preview.redd.it/q0hb68xue2o71.jpg?width=2388&format=pjpg&auto=webp&s=2bcfaadcd5304e1c57307f4b954759dd402f33f8)\n\nDuring the year and a half, the instrument’s price action has been consolidating into a beautiful bullish formation, called the descending wedge - which is exactly the opposite of what SP is consolidating into. VIX descending wedge + SP rising wedge + GME🆙VIX🆙SP🆘, quick math, and\n\n[We get an ape’s best friend, Gator the Bubbles Deflator \\(the Greater\\).](https://preview.redd.it/2fzj2pdye2o71.jpg?width=2032&format=pjpg&auto=webp&s=ecbdb4676a65c16dee75b9d3613fde91cecf7335)\n\nIf you know, you know.\n\n&#x200B;\n\n&#x200B;\n\n# IV. This is the tits-jacking part. Achtung! You have been warned!\n\n&#x200B;\n\n&#x200B;\n\nAlright, that was quiet a TA journey. I hope that the discussion above helped you to build the solid understanding of what's happening on broader financial markets and how those correlations and tendencies are affecting GME price action, and will probably add the fuel to the rocket in the upcoming major GME moves. Now, the focus of the discussion is back on the GME current TA status quo! (yeah, finally!) And, what can I say, it is so fucking juicy!\n\nFirstly, let me remind you about this TA of mine, which aged like a fine wine:\n\n[GME, daily log chart ](https://preview.redd.it/ibiauo96f2o71.jpg?width=2388&format=pjpg&auto=webp&s=d4645e967977f6c91ad71f07546993dc6140fda1)\n\nThe log chart support above proved itself to be an ape's ultimate best friend! As you can see, during the year, each time the price action approached the lower support, a sharp re-bounce followed - August and September confirmed the price line as THE most important support, manifesting the steadfast buying pressure. That pressure is currently confronting the most important resistance for GME in 2021 (magenta line). The battle will be legendary! (Hint: remember the current market setups discussed in II, and III, and the correlations? Based solely on that, what do you think the GME breakout will look like?)\n\nBut wait, there's more! Let's change the viewing ~~tri~~angle:\n\n[GME, daily chart ](https://preview.redd.it/nii0wtvhf2o71.jpg?width=2388&format=pjpg&auto=webp&s=d29dc68d5034aa1a8258a22dae522f241ab3b196)\n\nHm, looks familiar. I swear, I must have seen this TA setup before! Oh...\n\n[AMC, daily chart - 4 months old analysis ](https://preview.redd.it/aahe793pf2o71.jpg?width=2388&format=pjpg&auto=webp&s=ce50af7363612d218d3f98ba410416dbc1e3cbdd)\n\nTake a look at beautiful triangular wedge formations at the core of each chart. Retardos love triangles, and this love has a fair justification. Triangles incarnate the flattening of the price accompanied by diminishing volatility - for the price action subsequently to make a fucking explosion, should the triangle be broken out. The perfect example of that is theatre stonk’s price action after the breakout. \\*\\* GME: \"Hold my beer\" \\*\\* I'm pretty much convinced, that the triangle on GME chart above is how the Mother Of All Triangles must look like.\n\nButth waaitt, therrz moooore! How about a monthly log chart bullish pennant?\n\n[GME, monthly log chart ](https://preview.redd.it/1sni96uyf2o71.jpg?width=1668&format=pjpg&auto=webp&s=8fadb4dbf28a61c83bcca28d30dc50e49df0114e)\n\nChapter IV, TL;DR:\n\n[If you know, you know.](https://preview.redd.it/nockp5t5g2o71.jpg?width=1604&format=pjpg&auto=webp&s=4f8bf91be3db5fa7c09fe3a642966de613be8443)\n\nWell, such a good note to end this massive piece of delicious TA on! What do you think, fellow professional investors?\n\n&#x200B;\n\n**TL;DR: there is a strong correlational behaviour which goes like GME🆙VIX🆙SP500🆘, and which is evident when you overlay and compare the charts. According to the current ‘the everything GME’ market setup, GME is ready to moon fuelled by the upcoming massive VIX spike and the sharp SP 500 !negative beta rulez! correction (which is way overdue already, as the rally is longer than 10 years and SP is craving the proper bear market). Based on the TA outlook, the moment of revelation is just around the corner... There is only one safe heaven to protect investors from the upcoming financial typhoon, which goes by the name GME, so buckle the fuck up, shrinky brain astronauts primates! What a time to be alive!**",
  "author_fullname": "t2_wjufi",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 1,
  "clicked": false,
  "title": "GME is about to fuk u with its negative beta.",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Technical Analysis"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "chart",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "ibiauo96f2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/ibiauo96f2o71.jpg?width=108&crop=smart&auto=webp&s=4dd3a09b5d8c59c539b28599c4b839d59a103f97"
        },
        {
          "y": 142,
          "x": 216,
          "u": "https://preview.redd.it/ibiauo96f2o71.jpg?width=216&crop=smart&auto=webp&s=c2c96a0c6101795397bdc07344f11be0a2483770"
        },
        {
          "y": 211,
          "x": 320,
          "u": "https://preview.redd.it/ibiauo96f2o71.jpg?width=320&crop=smart&auto=webp&s=99ecf5056b0d513d6e7f7b8edecfcf574ab8373c"
        },
        {
          "y": 423,
          "x": 640,
          "u": "https://preview.redd.it/ibiauo96f2o71.jpg?width=640&crop=smart&auto=webp&s=ae23bc8ce5c3f3aac62f07332aeb4ae03b74ad95"
        },
        {
          "y": 635,
          "x": 960,
          "u": "https://preview.redd.it/ibiauo96f2o71.jpg?width=960&crop=smart&auto=webp&s=6f300fd1195bee3b50c49cea07869cff1c1eaf10"
        },
        {
          "y": 714,
          "x": 1080,
          "u": "https://preview.redd.it/ibiauo96f2o71.jpg?width=1080&crop=smart&auto=webp&s=6d113552e800ff767718dd336720f58f81154226"
        }
      ],
      "s": {
        "y": 1580,
        "x": 2388,
        "u": "https://preview.redd.it/ibiauo96f2o71.jpg?width=2388&format=pjpg&auto=webp&s=d4645e967977f6c91ad71f07546993dc6140fda1"
      },
      "id": "ibiauo96f2o71"
    },
    "6b41eaewc2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/6b41eaewc2o71.jpg?width=108&crop=smart&auto=webp&s=b01869c0218e5fbf0aeadd9e178789bc0f5f66fa"
        },
        {
          "y": 142,
          "x": 216,
          "u": "https://preview.redd.it/6b41eaewc2o71.jpg?width=216&crop=smart&auto=webp&s=673da7d33df444d7f61eeb3a027157b487a16cea"
        },
        {
          "y": 211,
          "x": 320,
          "u": "https://preview.redd.it/6b41eaewc2o71.jpg?width=320&crop=smart&auto=webp&s=ba464a3e9f392b8c56c0487b13e4b13dad67ad22"
        },
        {
          "y": 423,
          "x": 640,
          "u": "https://preview.redd.it/6b41eaewc2o71.jpg?width=640&crop=smart&auto=webp&s=cf05815cb4e3902d8f66240b1512e3a0595b685f"
        },
        {
          "y": 635,
          "x": 960,
          "u": "https://preview.redd.it/6b41eaewc2o71.jpg?width=960&crop=smart&auto=webp&s=63a0c72bae3bc18bc7a772f172198c93b15d64b7"
        },
        {
          "y": 714,
          "x": 1080,
          "u": "https://preview.redd.it/6b41eaewc2o71.jpg?width=1080&crop=smart&auto=webp&s=52793751f45ddcf877bc2bf3d98aa388db2b7019"
        }
      ],
      "s": {
        "y": 1580,
        "x": 2388,
        "u": "https://preview.redd.it/6b41eaewc2o71.jpg?width=2388&format=pjpg&auto=webp&s=d9ae4bdc7758ecdbc84425e6ea567e1d4243f9e1"
      },
      "id": "6b41eaewc2o71"
    },
    "yu1zzckpa2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 201,
          "x": 108,
          "u": "https://preview.redd.it/yu1zzckpa2o71.jpg?width=108&crop=smart&auto=webp&s=858dd7537afc60a0b79765968949492d36c54a0c"
        },
        {
          "y": 402,
          "x": 216,
          "u": "https://preview.redd.it/yu1zzckpa2o71.jpg?width=216&crop=smart&auto=webp&s=9619e79e965d761cf711520d0f0cb035c893093f"
        },
        {
          "y": 596,
          "x": 320,
          "u": "https://preview.redd.it/yu1zzckpa2o71.jpg?width=320&crop=smart&auto=webp&s=084f09d7a48e19bb21b77c8be3567dc0b7934a02"
        },
        {
          "y": 1192,
          "x": 640,
          "u": "https://preview.redd.it/yu1zzckpa2o71.jpg?width=640&crop=smart&auto=webp&s=a9b20dc708fe8e06df08a2e78e2a2d5948b57a20"
        },
        {
          "y": 1788,
          "x": 960,
          "u": "https://preview.redd.it/yu1zzckpa2o71.jpg?width=960&crop=smart&auto=webp&s=b8b644fb51697f5d4b642288a3e228eaacf69565"
        },
        {
          "y": 2012,
          "x": 1080,
          "u": "https://preview.redd.it/yu1zzckpa2o71.jpg?width=1080&crop=smart&auto=webp&s=7e911ef4f99b2ab807048bfb08cde164b69a200e"
        }
      ],
      "s": {
        "y": 4449,
        "x": 2388,
        "u": "https://preview.redd.it/yu1zzckpa2o71.jpg?width=2388&format=pjpg&auto=webp&s=e10bd82e172e82ea16a68da5c9c4a9c3e07f70ff"
      },
      "id": "yu1zzckpa2o71"
    },
    "sbs9va8od2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 62,
          "x": 108,
          "u": "https://preview.redd.it/sbs9va8od2o71.jpg?width=108&crop=smart&auto=webp&s=f35ff405ce40be393b24aed62f7f852b7763e9a0"
        },
        {
          "y": 124,
          "x": 216,
          "u": "https://preview.redd.it/sbs9va8od2o71.jpg?width=216&crop=smart&auto=webp&s=1185a8b54a48c7346eb610914b441c1323caf80b"
        },
        {
          "y": 184,
          "x": 320,
          "u": "https://preview.redd.it/sbs9va8od2o71.jpg?width=320&crop=smart&auto=webp&s=5041dce54a8044a1d393c72bff223e8807bdcc09"
        },
        {
          "y": 369,
          "x": 640,
          "u": "https://preview.redd.it/sbs9va8od2o71.jpg?width=640&crop=smart&auto=webp&s=a82c53f67b11069299594a734d284ec42542701f"
        },
        {
          "y": 553,
          "x": 960,
          "u": "https://preview.redd.it/sbs9va8od2o71.jpg?width=960&crop=smart&auto=webp&s=e23032378269726fd23338014705ec4e1940d689"
        },
        {
          "y": 623,
          "x": 1080,
          "u": "https://preview.redd.it/sbs9va8od2o71.jpg?width=1080&crop=smart&auto=webp&s=cde32663c209c3d75b99dc37d35f6379010519a5"
        }
      ],
      "s": {
        "y": 1378,
        "x": 2388,
        "u": "https://preview.redd.it/sbs9va8od2o71.jpg?width=2388&format=pjpg&auto=webp&s=ce9b57e1a6fa2020ac1c91218ad5d462ceda5d07"
      },
      "id": "sbs9va8od2o71"
    },
    "3fiwmwwqc2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 61,
          "x": 108,
          "u": "https://preview.redd.it/3fiwmwwqc2o71.jpg?width=108&crop=smart&auto=webp&s=b72ab981a31d11077a51d7ef5858ecdfdd414b5c"
        },
        {
          "y": 123,
          "x": 216,
          "u": "https://preview.redd.it/3fiwmwwqc2o71.jpg?width=216&crop=smart&auto=webp&s=46cea994c1c143ca032cf052afaea73243921d44"
        },
        {
          "y": 182,
          "x": 320,
          "u": "https://preview.redd.it/3fiwmwwqc2o71.jpg?width=320&crop=smart&auto=webp&s=638f701bc7de4933005905ec18676ecec6249e7d"
        },
        {
          "y": 364,
          "x": 640,
          "u": "https://preview.redd.it/3fiwmwwqc2o71.jpg?width=640&crop=smart&auto=webp&s=4fffd86b3f30e1d6c2ebf6d42a5c0ab18edc449a"
        },
        {
          "y": 546,
          "x": 960,
          "u": "https://preview.redd.it/3fiwmwwqc2o71.jpg?width=960&crop=smart&auto=webp&s=ec87a4ee141fc6eafa4b7eaa9ddabe3f888d2afa"
        },
        {
          "y": 615,
          "x": 1080,
          "u": "https://preview.redd.it/3fiwmwwqc2o71.jpg?width=1080&crop=smart&auto=webp&s=a4d8a652bee042d4730ebb799dfe2fd0ff17c07f"
        }
      ],
      "s": {
        "y": 1158,
        "x": 2033,
        "u": "https://preview.redd.it/3fiwmwwqc2o71.jpg?width=2033&format=pjpg&auto=webp&s=63ecddcaa4651b946a4df8541409c8d8e547d435"
      },
      "id": "3fiwmwwqc2o71"
    },
    "rpv734w9c2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 77,
          "x": 108,
          "u": "https://preview.redd.it/rpv734w9c2o71.png?width=108&crop=smart&auto=webp&s=bc2abb63cb1e0c64a4704f5ca62581547b7c512b"
        },
        {
          "y": 154,
          "x": 216,
          "u": "https://preview.redd.it/rpv734w9c2o71.png?width=216&crop=smart&auto=webp&s=029783cce372200b2e2833dbd2895efa784d3936"
        },
        {
          "y": 228,
          "x": 320,
          "u": "https://preview.redd.it/rpv734w9c2o71.png?width=320&crop=smart&auto=webp&s=f472999e3d4c64a19dfefaf96090cfd06d4efb70"
        }
      ],
      "s": {
        "y": 336,
        "x": 471,
        "u": "https://preview.redd.it/rpv734w9c2o71.png?width=471&format=png&auto=webp&s=56080fa590e5ecb6f65ad1a72329cd4d12569014"
      },
      "id": "rpv734w9c2o71"
    },
    "q0hb68xue2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/q0hb68xue2o71.jpg?width=108&crop=smart&auto=webp&s=71dd916405d034dadec1c5f58e36cb3debfd39f0"
        },
        {
          "y": 142,
          "x": 216,
          "u": "https://preview.redd.it/q0hb68xue2o71.jpg?width=216&crop=smart&auto=webp&s=dfcd19f7f12343d3a29c9c483f07f9494ea460e3"
        },
        {
          "y": 211,
          "x": 320,
          "u": "https://preview.redd.it/q0hb68xue2o71.jpg?width=320&crop=smart&auto=webp&s=2f05cc5d851697cf41dfbbde03051702225ad103"
        },
        {
          "y": 423,
          "x": 640,
          "u": "https://preview.redd.it/q0hb68xue2o71.jpg?width=640&crop=smart&auto=webp&s=d831306d833d74e0ca7b30d8694322039680eadf"
        },
        {
          "y": 635,
          "x": 960,
          "u": "https://preview.redd.it/q0hb68xue2o71.jpg?width=960&crop=smart&auto=webp&s=4fd03dfd9c42f77ea92928a2af945d96e7d622ca"
        },
        {
          "y": 714,
          "x": 1080,
          "u": "https://preview.redd.it/q0hb68xue2o71.jpg?width=1080&crop=smart&auto=webp&s=339a798dcb05bf0c032a7a8620ff1f86eb3f7ed0"
        }
      ],
      "s": {
        "y": 1580,
        "x": 2388,
        "u": "https://preview.redd.it/q0hb68xue2o71.jpg?width=2388&format=pjpg&auto=webp&s=2bcfaadcd5304e1c57307f4b954759dd402f33f8"
      },
      "id": "q0hb68xue2o71"
    },
    "1fcd3vlge2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/1fcd3vlge2o71.jpg?width=108&crop=smart&auto=webp&s=5e2e6277c5ea2681c50d399b9e5c383f980a0a92"
        },
        {
          "y": 142,
          "x": 216,
          "u": "https://preview.redd.it/1fcd3vlge2o71.jpg?width=216&crop=smart&auto=webp&s=3a19a4ecba2b7f2405aa4f67d793c084f2023684"
        },
        {
          "y": 211,
          "x": 320,
          "u": "https://preview.redd.it/1fcd3vlge2o71.jpg?width=320&crop=smart&auto=webp&s=c3939e6945706c190ec6fa379b231fe807927cf6"
        },
        {
          "y": 423,
          "x": 640,
          "u": "https://preview.redd.it/1fcd3vlge2o71.jpg?width=640&crop=smart&auto=webp&s=66c3bff8d177ee7421d8d48e434850c7c8754a2a"
        },
        {
          "y": 635,
          "x": 960,
          "u": "https://preview.redd.it/1fcd3vlge2o71.jpg?width=960&crop=smart&auto=webp&s=f12f86d989e060726c040e3a269d8683c0a78b43"
        },
        {
          "y": 714,
          "x": 1080,
          "u": "https://preview.redd.it/1fcd3vlge2o71.jpg?width=1080&crop=smart&auto=webp&s=bbabe1cb67137df32df52c362d7737adcdb36ba8"
        }
      ],
      "s": {
        "y": 1580,
        "x": 2388,
        "u": "https://preview.redd.it/1fcd3vlge2o71.jpg?width=2388&format=pjpg&auto=webp&s=78c23f899b3d623552b4b402c0abe74266108223"
      },
      "id": "1fcd3vlge2o71"
    },
    "gt1rnbz7e2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 92,
          "x": 108,
          "u": "https://preview.redd.it/gt1rnbz7e2o71.png?width=108&crop=smart&auto=webp&s=10a644e5720cd2046a2c5e9f9e00ea7436820fdd"
        },
        {
          "y": 184,
          "x": 216,
          "u": "https://preview.redd.it/gt1rnbz7e2o71.png?width=216&crop=smart&auto=webp&s=04086df955ccd50dc0b3ef395d0fbf50199f20d9"
        },
        {
          "y": 274,
          "x": 320,
          "u": "https://preview.redd.it/gt1rnbz7e2o71.png?width=320&crop=smart&auto=webp&s=ff7ce744ec3bd8c5464db0322a3dcca70bf2df96"
        }
      ],
      "s": {
        "y": 489,
        "x": 571,
        "u": "https://preview.redd.it/gt1rnbz7e2o71.png?width=571&format=png&auto=webp&s=9f6db503236cce3d87f8c4511221e8b5e30f91bb"
      },
      "id": "gt1rnbz7e2o71"
    },
    "ksd03p5pe2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 63,
          "x": 108,
          "u": "https://preview.redd.it/ksd03p5pe2o71.jpg?width=108&crop=smart&auto=webp&s=1c25962bb2f77f598a1df85dffc80aed22010788"
        },
        {
          "y": 127,
          "x": 216,
          "u": "https://preview.redd.it/ksd03p5pe2o71.jpg?width=216&crop=smart&auto=webp&s=c4f2f3ec010ca2cb59e7d3c31ec84873bf82e22a"
        },
        {
          "y": 188,
          "x": 320,
          "u": "https://preview.redd.it/ksd03p5pe2o71.jpg?width=320&crop=smart&auto=webp&s=06b889b06af4a9d792cc135a0e4732c98f8a1aad"
        },
        {
          "y": 376,
          "x": 640,
          "u": "https://preview.redd.it/ksd03p5pe2o71.jpg?width=640&crop=smart&auto=webp&s=9d6376afd6dc695a585e4fe141c28eaa34c6cb5b"
        },
        {
          "y": 565,
          "x": 960,
          "u": "https://preview.redd.it/ksd03p5pe2o71.jpg?width=960&crop=smart&auto=webp&s=16d67e29463da867b09134134ce2f746e8dd05a4"
        },
        {
          "y": 635,
          "x": 1080,
          "u": "https://preview.redd.it/ksd03p5pe2o71.jpg?width=1080&crop=smart&auto=webp&s=13822382a39b9c03f5885fbc374ea1e6dcde9b71"
        }
      ],
      "s": {
        "y": 1159,
        "x": 1969,
        "u": "https://preview.redd.it/ksd03p5pe2o71.jpg?width=1969&format=pjpg&auto=webp&s=835dee5dd6c8b5367088857995e01a720f41f13a"
      },
      "id": "ksd03p5pe2o71"
    },
    "2fzj2pdye2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 65,
          "x": 108,
          "u": "https://preview.redd.it/2fzj2pdye2o71.jpg?width=108&crop=smart&auto=webp&s=4d8041f15a59bb713d2af3cf12f9745894e53b8b"
        },
        {
          "y": 131,
          "x": 216,
          "u": "https://preview.redd.it/2fzj2pdye2o71.jpg?width=216&crop=smart&auto=webp&s=a144a78cad88dbeb41e82b6707bed5ffe358a617"
        },
        {
          "y": 194,
          "x": 320,
          "u": "https://preview.redd.it/2fzj2pdye2o71.jpg?width=320&crop=smart&auto=webp&s=8059a61a2455e8867eef5d20c381516b981dba0d"
        },
        {
          "y": 388,
          "x": 640,
          "u": "https://preview.redd.it/2fzj2pdye2o71.jpg?width=640&crop=smart&auto=webp&s=eb0d89cf8e9c8cb68769ca14e32cc98db2a6df74"
        },
        {
          "y": 583,
          "x": 960,
          "u": "https://preview.redd.it/2fzj2pdye2o71.jpg?width=960&crop=smart&auto=webp&s=942ffb496f434f410b4f2d4620ea7ec04f2d34f3"
        },
        {
          "y": 656,
          "x": 1080,
          "u": "https://preview.redd.it/2fzj2pdye2o71.jpg?width=1080&crop=smart&auto=webp&s=72ff7e482bdf36c27b742b21dbc5013efd2b63f5"
        }
      ],
      "s": {
        "y": 1235,
        "x": 2032,
        "u": "https://preview.redd.it/2fzj2pdye2o71.jpg?width=2032&format=pjpg&auto=webp&s=ecbdb4676a65c16dee75b9d3613fde91cecf7335"
      },
      "id": "2fzj2pdye2o71"
    },
    "1sni96uyf2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 135,
          "x": 108,
          "u": "https://preview.redd.it/1sni96uyf2o71.jpg?width=108&crop=smart&auto=webp&s=40356ce8d2fe24e60cf36c9f3d03bf98d05839b1"
        },
        {
          "y": 270,
          "x": 216,
          "u": "https://preview.redd.it/1sni96uyf2o71.jpg?width=216&crop=smart&auto=webp&s=cd0543477133590f05ed65f168dd8c84d93e407c"
        },
        {
          "y": 400,
          "x": 320,
          "u": "https://preview.redd.it/1sni96uyf2o71.jpg?width=320&crop=smart&auto=webp&s=184302a151d85b1a784b2e8c83a1d047fcc03524"
        },
        {
          "y": 801,
          "x": 640,
          "u": "https://preview.redd.it/1sni96uyf2o71.jpg?width=640&crop=smart&auto=webp&s=3de7bde521e87ca86cdf2ff31bfed8ebe1bb76ac"
        },
        {
          "y": 1201,
          "x": 960,
          "u": "https://preview.redd.it/1sni96uyf2o71.jpg?width=960&crop=smart&auto=webp&s=061aed9cc1e1c475688d06fbdc1de087da1629a1"
        },
        {
          "y": 1351,
          "x": 1080,
          "u": "https://preview.redd.it/1sni96uyf2o71.jpg?width=1080&crop=smart&auto=webp&s=cddd97964177d030e6752b2adb1d76f36c997552"
        }
      ],
      "s": {
        "y": 2088,
        "x": 1668,
        "u": "https://preview.redd.it/1sni96uyf2o71.jpg?width=1668&format=pjpg&auto=webp&s=8fadb4dbf28a61c83bcca28d30dc50e49df0114e"
      },
      "id": "1sni96uyf2o71"
    },
    "aahe793pf2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/aahe793pf2o71.jpg?width=108&crop=smart&auto=webp&s=729b7a592c9967b3aa585eb6604415fa2478ed92"
        },
        {
          "y": 142,
          "x": 216,
          "u": "https://preview.redd.it/aahe793pf2o71.jpg?width=216&crop=smart&auto=webp&s=8bfd71f9b7200d235e6573871ca8f4346870f794"
        },
        {
          "y": 210,
          "x": 320,
          "u": "https://preview.redd.it/aahe793pf2o71.jpg?width=320&crop=smart&auto=webp&s=aaa1df02c067748649cf247abe3398d937d726f9"
        },
        {
          "y": 421,
          "x": 640,
          "u": "https://preview.redd.it/aahe793pf2o71.jpg?width=640&crop=smart&auto=webp&s=3a13aa1d47fb90572c54f18d739deb8418958dea"
        },
        {
          "y": 632,
          "x": 960,
          "u": "https://preview.redd.it/aahe793pf2o71.jpg?width=960&crop=smart&auto=webp&s=67b63767edae951b3e5854351707e99c542606e0"
        },
        {
          "y": 711,
          "x": 1080,
          "u": "https://preview.redd.it/aahe793pf2o71.jpg?width=1080&crop=smart&auto=webp&s=5bc26b2142b9362e8764044b0bf88ca8a2f8f1ef"
        }
      ],
      "s": {
        "y": 1574,
        "x": 2388,
        "u": "https://preview.redd.it/aahe793pf2o71.jpg?width=2388&format=pjpg&auto=webp&s=ce50af7363612d218d3f98ba410416dbc1e3cbdd"
      },
      "id": "aahe793pf2o71"
    },
    "1goqfoa2e2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/1goqfoa2e2o71.jpg?width=108&crop=smart&auto=webp&s=4013e14f054b54ff1c06e7993df8945f1b886e97"
        },
        {
          "y": 142,
          "x": 216,
          "u": "https://preview.redd.it/1goqfoa2e2o71.jpg?width=216&crop=smart&auto=webp&s=acb14cc03a6582e22eb9febc1dc448399485013b"
        },
        {
          "y": 211,
          "x": 320,
          "u": "https://preview.redd.it/1goqfoa2e2o71.jpg?width=320&crop=smart&auto=webp&s=0ba923cb482531e0b714be7dc190cffd04b7a396"
        },
        {
          "y": 423,
          "x": 640,
          "u": "https://preview.redd.it/1goqfoa2e2o71.jpg?width=640&crop=smart&auto=webp&s=62e5ccd2f248e06211950904adaceab2a3959914"
        },
        {
          "y": 635,
          "x": 960,
          "u": "https://preview.redd.it/1goqfoa2e2o71.jpg?width=960&crop=smart&auto=webp&s=e105a4a7013809faba2dc83e2a0191fc2c136a19"
        },
        {
          "y": 714,
          "x": 1080,
          "u": "https://preview.redd.it/1goqfoa2e2o71.jpg?width=1080&crop=smart&auto=webp&s=15d74cfcac73e5a84e28dcd1dd9183a48cc231f4"
        }
      ],
      "s": {
        "y": 1580,
        "x": 2388,
        "u": "https://preview.redd.it/1goqfoa2e2o71.jpg?width=2388&format=pjpg&auto=webp&s=e3eefcd4720f38907877a2791ea642c3955122b5"
      },
      "id": "1goqfoa2e2o71"
    },
    "nockp5t5g2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 111,
          "x": 108,
          "u": "https://preview.redd.it/nockp5t5g2o71.jpg?width=108&crop=smart&auto=webp&s=71ac1057f91cd52963b33d48d0fa56ee4b5bf675"
        },
        {
          "y": 223,
          "x": 216,
          "u": "https://preview.redd.it/nockp5t5g2o71.jpg?width=216&crop=smart&auto=webp&s=e437e3362ac07b12b97c7e4771affdcd35aa85e9"
        },
        {
          "y": 330,
          "x": 320,
          "u": "https://preview.redd.it/nockp5t5g2o71.jpg?width=320&crop=smart&auto=webp&s=77b0b837fd9424babea3474bd75bb3cde1b3758a"
        },
        {
          "y": 661,
          "x": 640,
          "u": "https://preview.redd.it/nockp5t5g2o71.jpg?width=640&crop=smart&auto=webp&s=abd14938ca0ae42400d4b41ecea68bba3f94bec7"
        },
        {
          "y": 992,
          "x": 960,
          "u": "https://preview.redd.it/nockp5t5g2o71.jpg?width=960&crop=smart&auto=webp&s=c268d1f22473504158a9dd8b5a9439bd83ae804f"
        },
        {
          "y": 1116,
          "x": 1080,
          "u": "https://preview.redd.it/nockp5t5g2o71.jpg?width=1080&crop=smart&auto=webp&s=5f95b67c8e0a684a2ef10ffd92fc675ac699f447"
        }
      ],
      "s": {
        "y": 1658,
        "x": 1604,
        "u": "https://preview.redd.it/nockp5t5g2o71.jpg?width=1604&format=pjpg&auto=webp&s=4f8bf91be3db5fa7c09fe3a642966de613be8443"
      },
      "id": "nockp5t5g2o71"
    },
    "nii0wtvhf2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 71,
          "x": 108,
          "u": "https://preview.redd.it/nii0wtvhf2o71.jpg?width=108&crop=smart&auto=webp&s=2f78679c8a7c89ca4479e3b5045291bd96013300"
        },
        {
          "y": 142,
          "x": 216,
          "u": "https://preview.redd.it/nii0wtvhf2o71.jpg?width=216&crop=smart&auto=webp&s=26ddf24c76da0fdfb71ad923b0f9371528dfde01"
        },
        {
          "y": 211,
          "x": 320,
          "u": "https://preview.redd.it/nii0wtvhf2o71.jpg?width=320&crop=smart&auto=webp&s=8bb7ab75114cd28e95f8955f9d3baf9cd1d6f8a0"
        },
        {
          "y": 423,
          "x": 640,
          "u": "https://preview.redd.it/nii0wtvhf2o71.jpg?width=640&crop=smart&auto=webp&s=8dce3e6bced31e0b2a001bff0e5cc9961a8dd856"
        },
        {
          "y": 635,
          "x": 960,
          "u": "https://preview.redd.it/nii0wtvhf2o71.jpg?width=960&crop=smart&auto=webp&s=bf0fd48fc532d9046259c1a829d77239d069759b"
        },
        {
          "y": 714,
          "x": 1080,
          "u": "https://preview.redd.it/nii0wtvhf2o71.jpg?width=1080&crop=smart&auto=webp&s=8fd11b3912849cc37752bdeee0f0d68755db6860"
        }
      ],
      "s": {
        "y": 1580,
        "x": 2388,
        "u": "https://preview.redd.it/nii0wtvhf2o71.jpg?width=2388&format=pjpg&auto=webp&s=d29dc68d5034aa1a8258a22dae522f241ab3b196"
      },
      "id": "nii0wtvhf2o71"
    },
    "iwtaoohhc2o71": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 68,
          "x": 108,
          "u": "https://preview.redd.it/iwtaoohhc2o71.jpg?width=108&crop=smart&auto=webp&s=3941ab6df0ef119079d4814ead2b36210ba17232"
        },
        {
          "y": 136,
          "x": 216,
          "u": "https://preview.redd.it/iwtaoohhc2o71.jpg?width=216&crop=smart&auto=webp&s=c542d9a018fa36e031b77b4fdfc35135f681f9b2"
        },
        {
          "y": 201,
          "x": 320,
          "u": "https://preview.redd.it/iwtaoohhc2o71.jpg?width=320&crop=smart&auto=webp&s=79eefe3fc317e171000002f7c4fba46b525f2167"
        },
        {
          "y": 403,
          "x": 640,
          "u": "https://preview.redd.it/iwtaoohhc2o71.jpg?width=640&crop=smart&auto=webp&s=3889463524d5baff941b6a900c91e70288206fdb"
        },
        {
          "y": 605,
          "x": 960,
          "u": "https://preview.redd.it/iwtaoohhc2o71.jpg?width=960&crop=smart&auto=webp&s=31a8292eea005ba3593db39ab3eb232dc9a60ace"
        },
        {
          "y": 680,
          "x": 1080,
          "u": "https://preview.redd.it/iwtaoohhc2o71.jpg?width=1080&crop=smart&auto=webp&s=55916f2065c35267c62f3b2a791c11e7ce589319"
        }
      ],
      "s": {
        "y": 1285,
        "x": 2039,
        "u": "https://preview.redd.it/iwtaoohhc2o71.jpg?width=2039&format=pjpg&auto=webp&s=67b2824b31bf155c6f7d5f992c5141f67a82cdfb"
      },
      "id": "iwtaoohhc2o71"
    }
  },
  "name": "t3_pq0aiy",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.93,
  "author_flair_background_color": "",
  "subreddit_type": "public",
  "ups": 3038,
  "total_awards_received": 42,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": true,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Technical Analysis",
  "can_mod_post": false,
  "score": 3038,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [
    {
      "e": "text",
      "t": "What's an exit strategy?"
    }
  ],
  "gildings": {
    "gid_1": 8,
    "gid_2": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1631885790,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "richtext",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Greetings to the most intelligent people on the planet!</p>\n\n<p>I&#39;ve been playing with GME and the other charts recently, and it all accumulated into a massive piece of delicious TA,  which I didn&#39;t really plan to post to WSB originally - because I felt like some of the honorable WSB residents might be a little tired from that particular stonk. However, after seening <a href=\"https://www.reddit.com/r/wallstreetbets/comments/pppfro/tmc_spotted_the_cock_and_balls_upside_down_head/\">this</a> and <a href=\"https://www.reddit.com/r/wallstreetbets/comments/pph9f0/as_you_can_see_tmc_is_forming_a_classic_nut_sack/\">this</a> beautiful examples of intellectual superiority, I just couldn&#39;t resist sharing my hard work with you, dear WSB!(If you, dear reader, are the one who is fed up with GME, then I would recommend you stop reading now and follow the two links above to appreciate HQ TA on other stonks).</p>\n\n<p>For those, who stayed - enjoy the read!</p>\n\n<p>It all started from my “L&#39;Oreal shampoo commercial”-like hair bet post, where, in its third chapter, I was theorizing about GME&#39;s negative beta (particularly in light of the late January events, when the buy button was disabled) and the current general market setup - how it might influence subsequent GME moves. So, I decided to dive deeper into those correlations and deviations between the price movements of GME and other major assets, using January sneeze as the starting point. This led me to a fascinating, tits-jacking discovery that points at the upcoming inevitable volatile price action!</p>\n\n<p>Buckle up for the TA journey of your life, let’s <del>dive</del> fly in!</p>\n\n<p>Oh, almost forgot to quote Jack Black:</p>\n\n<blockquote>\n<p>“This is not the financial advice, no.  </p>\n\n<p>This is just a tribute.  </p>\n\n<p>Couldn&#39;t remember becoming a financial advisor, no.  </p>\n\n<p>This is a tribute, oh, to the greatest stonk in the world, alright!”</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>First things first, it’s a good idea therefore to revisit <strong>late Jan events</strong>, which in my opinion was the moment of revelation and a preview of inevitable storm, when:</p>\n\n<p>&#x200B;</p>\n\n<h1>I. The North Remembers:</h1>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/yu1zzckpa2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=e10bd82e172e82ea16a68da5c9c4a9c3e07f70ff\">GME v VIX v SP, 30 min chart</a></p>\n\n<ul>\n<li>GME shares added more than 500% in less than two days, showing off its negative beta in all glory,</li>\n<li>making VIX volatility index explode more than 60% in a single day,</li>\n<li>and injuring SP badly (sharp decline of about 4% in 21 hours).</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>At this point, the thesis should sound something like GME🆙VIX🆙=SP🆘, and vice versa. It will be developed further in the next chapters.</p>\n\n<p>&#x200B;</p>\n\n<p>Also, quoting my bet post here:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Pepperidge apes should remember that during one of the Gamestop congressional hearings Vlad &#39;the Stock Implaler&#39; Tenev mentioned something about late January events falling into five-sigma category, which scientifically speaking corresponds to a p-value, or probability, of 3x10-7, or about 1 in 3.5 million. He also used such a hackneyed expression as a &#39;black swan&#39; event.  </p>\n\n<p>...  </p>\n\n<p>Categorizing January craze as five sigma is debatable to say the least, because Gamestop shares started to skyrocket and multiply in price long before late January, and it doesn&#39;t take a lot of wrinkles to understand that the volatility should likely increase further, requiring additional collateral and somewhat decent risk management. However, I&#39;m not going to discuss Vlad&#39;s choice of sacrificing Robbinhood users (disabling buy button) in order to protect the solvency of Robbinhood customers (Citadel and co), because that has been done enough times already, and the North remembers. Rather, Robbinhood example and Vlad&#39;s interpretation are provided here as a vivid illustration of the fact which we all feel deep inside: there is just too much risk in the market, it is being too much fucking over-leveraged so that even a fucking retail stock broker may easily get margin-called in a matter of hours. It is especially hilarious, considering the fact that unsophisticated actions of buying and holding a particular stock is enough to fuck the system, making the entire house of cards fall apart. The problem is that when you dive deeper, 2008 seem to be a blessing.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>Furthermore, I should recommend  you reading <a href=\"/u/peruvian_bull\">u/peruvian_bull</a> Endgame series, and/or <a href=\"/u/Criand\">u/Criand</a> the Bigger Short in order to develop the understanding of the fundamental processes taking place under the hood of the financial markets. To sum up the core idea: the financial system is over-levereged, way more than it was in 2008, and coupled with the industry poor risk assessment standards, it is heading to the next, coming soon, financial crisis. And, in my opinion, what you can see on the charts above, was a sneak peak of the house of cards collapsing. Disabling the buy button was the only option for the big moni guys to stop (or rather to postpone) the system failing miserably. By bringing this dirty trick into play they were able to <del>buy</del> steal some time, which was necessary for deploying emergency measures and urgent market mechanisms (such as new DTCC/NSCC rules) - which, in turn, are aimed at mitigating the inevitable financial hail<strong>shit</strong>storm, ready to hit the fans.</p>\n\n<p>There is a plenty of outstanding fundamentals DD on that topic (start from clicking profiles in the paragraph above). As for me, I am the TA type of a wrincle-brained ape, so...</p>\n\n<p>Let me speak from my <del>heart</del> charts.</p>\n\n<p>&#x200B;</p>\n\n<h1>II. Negative beta more beautiful than Catherine Zeta</h1>\n\n<p>&#x200B;</p>\n\n<p>Let&#39;s start from something that you must have heard about many times, but did you really dive into GME exceptional beta? So, what&#39;s that thing and why is it so negative? For the sake of saving my and your time, let me quote the almighty Inve<strong>stop</strong>edia:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>In investing, beta does not refer to fraternities, product testing, or old videocassettes. Beta is a measurement of market risk or volatility. That is, it indicates how much the price of a stock tends to fluctuate up and down compared to other stocks.  </p>\n\n<p>The value of any stock index, such as the Standard &amp; Poor&#39;s 500 Index, moves up and down constantly. At the end of the trading day, we conclude that &quot;the markets&quot; were up or down. An investor considering buying a particular stock may want to know whether that stock moves up and down just as sharply as stocks in general. It may be inclined to hold its value on a bad day or get stuck in a rut when most stocks are rising; whereas the beta is the number that measures a stock&#39;s volatility, the degree to which its price fluctuates in relation to the overall stock market. In other words, it gives a sense of the stock&#39;s risk compared to that of the greater market&#39;s.  </p>\n\n<p>Beta is used also to compare a stock&#39;s market risk to that of other stocks. Analysts use the Greek letter &#39;ß&#39; to represent beta.Beta is calculated using regression analysis. A beta of 1 indicates that the security&#39;s price tends to move with the market. A beta greater than 1 indicates that the security&#39;s price tends to be more volatile than the market. A beta of less than 1 means it tends to be less volatile than the market.  </p>\n\n<p><strong>Negative beta</strong>: A beta less than 0, which would indicate an inverse relation to the market, is possible but highly unlikely.</p>\n</blockquote>\n\n<p>Essentially, negative beta asset is an asset that tends to move in the opposite direction from the general market. Famous precious metal is one of the good examples: gold and gold stocks have negative betas because they tend to do better when the stock market declines. That is exactly the reason why investors cherish this asset in the turbulent time of recessions, market crashes and corrections, or general uncertainty and volatility - historically gold tends to perform well during such periods, providing the &#39;safe heaven&#39; to market participants and acting as a hedge. Noice, but this turbulent time we have something special on the horizon.</p>\n\n<p>**Le wild negative beta unicorn appears**</p>\n\n<p><a href=\"https://preview.redd.it/rpv734w9c2o71.png?width=471&amp;format=png&amp;auto=webp&amp;s=56080fa590e5ecb6f65ad1a72329cd4d12569014\">Captain GME to gold</a></p>\n\n<p>Many of you must have seen -ß posts, but math and numbers are for geniuses, retards only understand crayons and visuals, so...</p>\n\n<p>Ladies and gentleapes, with the great pleasure I present you the new negative beta king:</p>\n\n<p><a href=\"https://preview.redd.it/iwtaoohhc2o71.jpg?width=2039&amp;format=pjpg&amp;auto=webp&amp;s=67b2824b31bf155c6f7d5f992c5141f67a82cdfb\">GME v SP, daily chart</a></p>\n\n<p>What you see on the chart above is a vivid illustration of GME&#39;s negative beta behavior, which commenced during/after the January sneeze. As for SP, the stable uptrend with the minor corrections is evident, while the asset is achieving ATHs on a regular basis. Looking at the GME now and connecting its highs with the median line, we may observe the opposite trend, as the line is descending. All in all, there is a big-ass convergence manifesting between the two assets, which most probably will result in the increased volatility and the explosive GME breakout / trend reversal for SP. Who will blink first?</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3fiwmwwqc2o71.jpg?width=2033&amp;format=pjpg&amp;auto=webp&amp;s=63ecddcaa4651b946a4df8541409c8d8e547d435\">GME v SP daily chart + Tower of Pisa</a></p>\n\n<p>Next, take a look at this chart. Don&#39;t worry about GME&#39;s Pisa offset here, as it is insignificant for the point I&#39;m making (and I had some struggles overlaying the charts in this case). If the previous chart indicates a longer term negative correlation, the one above is like a zoom in: there is an obvious series of divergences and convergences highlighted yellow and blue respectively, which illustrate negative beta again, but on a smaller scale and with local trends. As you can see, as soon a GME bullrun commences and accelerates, SP dips, and vice versa. I hope, that the examples provided are persuasive, and that they helped you to reach the same conclusion as I did, namely: sstonk goes up when stonks go down, while when stonks go up, GME is suppressed = GME🆙SP🆘. Should that correlation continue manifesting itself (which I&#39;m pretty damn confident it will), the exciting times are on the way.</p>\n\n<p>Ok, so 🆙🆘 is a simple concept, but why is it important, you may ask.</p>\n\n<p>Well, that&#39;s why:</p>\n\n<p><a href=\"https://preview.redd.it/6b41eaewc2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=d9ae4bdc7758ecdbc84425e6ea567e1d4243f9e1\">SP, daily chart </a></p>\n\n<p>SP has been forming a powerful bearish technical formation called the rising wedge, through the past year and a half. Currently it is narrowing down, and the point of breakout is not far away - typically it is to the downside for such a technical setup. Add GME with its negative beta to this equation - if you know, you know.</p>\n\n<p><a href=\"https://preview.redd.it/sbs9va8od2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=ce9b57e1a6fa2020ac1c91218ad5d462ceda5d07\">SP 4H chart, I called it ‘Head of Penis’ formation </a></p>\n\n<p>But wait, there’s more!</p>\n\n<p><a href=\"https://preview.redd.it/1goqfoa2e2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=e3eefcd4720f38907877a2791ea642c3955122b5\">SP, monthly chart </a></p>\n\n<p>In one of my TA longwrites, the Big Short 2.0, I identified a beautiful, long term, juicy Elliott 1-2-3-4-5 impulse wave structure on SP, take a look! The investors are currently riding the top of the fifth wave, which is usually the most fun, euphoric and crazily risky. Everything in the nature works in cycles, and all the things that go up, must go down eventually! Considering the current bullrun being one of the (if not THE) most powerful and longest bullruns in history, you can imagine how nasty the retrace may look this time. Especially, when you take into account the fact that current financial markets are filled with shitty synthetic derivatives, excessive leverage of a bad quality, unthinkable level of risk, and... plain fucking crime. The financial world is craving for the correction (like Sahara for rainfall) and a proper bear market, as the deleveraging will make it healthier, and maybe, just maybe, it will bring price discovery back to life from the grave where it has been rolling for I don’t know how long.</p>\n\n<p>Man, I wish there was a safe heaven asset that would protect me from the upcoming financial typhoon, the price of which would move the opposite way from the overdue nasty correction on all financial markets, which have been enjoying the most powerful bullrun in history for more than ten fucking years... Oh, wait!</p>\n\n<p><a href=\"https://preview.redd.it/gt1rnbz7e2o71.png?width=571&amp;format=png&amp;auto=webp&amp;s=9f6db503236cce3d87f8c4511221e8b5e30f91bb\">Vasco da Gama can’t be wrong </a></p>\n\n<p>&#x200B;</p>\n\n<h1>III. Chew it Over with VIX</h1>\n\n<p>&#x200B;</p>\n\n<p>Next, let’s talk about Volatility Index - what I noticed recently, is that VIX is often being neglected in the TA discussions, and in general also, so it’s a good idea to show it some love. Especially since GME and VIX correlate to a considerable fucking extent, but later on that.</p>\n\n<p>To begin with,</p>\n\n<p><a href=\"https://preview.redd.it/1fcd3vlge2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=78c23f899b3d623552b4b402c0abe74266108223\">VIX, monthly chart </a></p>\n\n<p>The chart above is provided for the visual explanation of how this instrument behaves. In short, markeds kaboom TWIX wroom wroom. In essence, the Cboe Volatility Index is a market sentiment tracking index that represents the market participants expectations for volatility over the coming 30 days. Volatility, or the severity of price fluctuations, is usually helpful to gauge market sentiment, particularly the degree of fear and uncertainty spreading on the financial markets. Investors use VIX to measure the level of risk, fear, or stress in the market when making investment decisions. It is an important index in the world of finance because it provides a quantifiable measure of market risk and investors&#39; sentiments.</p>\n\n<p>And who would have guessed, throughout the year VIX spikes have been accompanying almost every single GME major run, but for one:</p>\n\n<p><a href=\"https://preview.redd.it/ksd03p5pe2o71.jpg?width=1969&amp;format=pjpg&amp;auto=webp&amp;s=835dee5dd6c8b5367088857995e01a720f41f13a\">GME v VIX, daily log chart</a></p>\n\n<p>Just one major outlier to that tandem is late November 2020 run. Speaking of outliers, also VIX middle of June 2021 spike seems to stand out from the crowd, as there is no relevant proportionate positive price action on the GME side. Outside of those two occasions, the correlational behaviour of these two instruments is evident. Moreover, VIX and GME runs correlate to the extent that their peaks match time-wise in several run ups. Furthermore, take a look at how starting 2021 four out of five major VIX spikes correspond with the occasions when GME’s price action was trialling $230-ish level (margin call level, it seems) - the price territory, around which my concept of the ‘Purple Haze’ resistance (“break to initiate the squeeze”) is established, refer to the short squeezes comparisons post to explore the concept. The correlational behaviour described above, to my understanding, points at two big conclusions: the first and the most obvious one, is GME🆙VIX🆙; secondly, it seems that GME is currently the biggest risk for the market! - too much synchronicity is present between the two, for this to be a mere coincidence. Remember, VIX represents volatility, fear and stress - wut feelin Kenny?</p>\n\n<p>Oh, and did I mention?</p>\n\n<p><a href=\"https://preview.redd.it/q0hb68xue2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=2bcfaadcd5304e1c57307f4b954759dd402f33f8\">VIX, daily chart </a></p>\n\n<p>During the year and a half, the instrument’s price action has been consolidating into a beautiful bullish formation, called the descending wedge - which is exactly the opposite of what SP is consolidating into. VIX descending wedge + SP rising wedge + GME🆙VIX🆙SP🆘, quick math, and</p>\n\n<p><a href=\"https://preview.redd.it/2fzj2pdye2o71.jpg?width=2032&amp;format=pjpg&amp;auto=webp&amp;s=ecbdb4676a65c16dee75b9d3613fde91cecf7335\">We get an ape’s best friend, Gator the Bubbles Deflator (the Greater).</a></p>\n\n<p>If you know, you know.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<h1>IV. This is the tits-jacking part. Achtung! You have been warned!</h1>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Alright, that was quiet a TA journey. I hope that the discussion above helped you to build the solid understanding of what&#39;s happening on broader financial markets and how those correlations and tendencies are affecting GME price action, and will probably add the fuel to the rocket in the upcoming major GME moves. Now, the focus of the discussion is back on the GME current TA status quo! (yeah, finally!) And, what can I say, it is so fucking juicy!</p>\n\n<p>Firstly, let me remind you about this TA of mine, which aged like a fine wine:</p>\n\n<p><a href=\"https://preview.redd.it/ibiauo96f2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=d4645e967977f6c91ad71f07546993dc6140fda1\">GME, daily log chart </a></p>\n\n<p>The log chart support above proved itself to be an ape&#39;s ultimate best friend! As you can see, during the year, each time the price action approached the lower support, a sharp re-bounce followed - August and September confirmed the price line as THE most important support, manifesting the steadfast buying pressure. That pressure is currently confronting the most important resistance for GME in 2021 (magenta line). The battle will be legendary! (Hint: remember the current market setups discussed in II, and III, and the correlations? Based solely on that, what do you think the GME breakout will look like?)</p>\n\n<p>But wait, there&#39;s more! Let&#39;s change the viewing <del>tri</del>angle:</p>\n\n<p><a href=\"https://preview.redd.it/nii0wtvhf2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=d29dc68d5034aa1a8258a22dae522f241ab3b196\">GME, daily chart </a></p>\n\n<p>Hm, looks familiar. I swear, I must have seen this TA setup before! Oh...</p>\n\n<p><a href=\"https://preview.redd.it/aahe793pf2o71.jpg?width=2388&amp;format=pjpg&amp;auto=webp&amp;s=ce50af7363612d218d3f98ba410416dbc1e3cbdd\">AMC, daily chart - 4 months old analysis </a></p>\n\n<p>Take a look at beautiful triangular wedge formations at the core of each chart. Retardos love triangles, and this love has a fair justification. Triangles incarnate the flattening of the price accompanied by diminishing volatility - for the price action subsequently to make a fucking explosion, should the triangle be broken out. The perfect example of that is theatre stonk’s price action after the breakout. ** GME: &quot;Hold my beer&quot; ** I&#39;m pretty much convinced, that the triangle on GME chart above is how the Mother Of All Triangles must look like.</p>\n\n<p>Butth waaitt, therrz moooore! How about a monthly log chart bullish pennant?</p>\n\n<p><a href=\"https://preview.redd.it/1sni96uyf2o71.jpg?width=1668&amp;format=pjpg&amp;auto=webp&amp;s=8fadb4dbf28a61c83bcca28d30dc50e49df0114e\">GME, monthly log chart </a></p>\n\n<p>Chapter IV, TL;DR:</p>\n\n<p><a href=\"https://preview.redd.it/nockp5t5g2o71.jpg?width=1604&amp;format=pjpg&amp;auto=webp&amp;s=4f8bf91be3db5fa7c09fe3a642966de613be8443\">If you know, you know.</a></p>\n\n<p>Well, such a good note to end this massive piece of delicious TA on! What do you think, fellow professional investors?</p>\n\n<p>&#x200B;</p>\n\n<p><strong>TL;DR: there is a strong correlational behaviour which goes like GME🆙VIX🆙SP500🆘, and which is evident when you overlay and compare the charts. According to the current ‘the everything GME’ market setup, GME is ready to moon fuelled by the upcoming massive VIX spike and the sharp SP 500 !negative beta rulez! correction (which is way overdue already, as the rally is longer than 10 years and SP is craving the proper bear market). Based on the TA outlook, the moment of revelation is just around the corner... There is only one safe heaven to protect investors from the upcoming financial typhoon, which goes by the name GME, so buckle the fuck up, shrinky brain astronauts primates! What a time to be alive!</strong></p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "e7bce9ea-4b49-11eb-ad96-0e210774c543",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": "What's an exit strategy?",
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ff4500",
  "id": "pq0aiy",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "roman_axt",
  "discussion_type": null,
  "num_comments": 216,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": "dark",
  "permalink": "/r/wallstreetbets/comments/pq0aiy/gme_is_about_to_fuk_u_with_its_negative_beta/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/pq0aiy/gme_is_about_to_fuk_u_with_its_negative_beta/",
  "subreddit_subscribers": 10844534,
  "created_utc": 1631913710,
  "num_crossposts": 4,
  "media": null,
  "is_video": false,
  "original_created_utc": 1631885790,
  "the_new_excerpt": "Greetings to the most intelligent people on the planet!\n\nI've been playing with GME and the other charts recently, and it all accumulated\ninto a massive piece of delicious TA, which I didn't really plan to post to WSB\noriginally - because I felt like some of the honorable WSB residents might be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "地球上で最も知的な人々への挨拶です。\n\n最近、GMEや他のチャートで遊んでいますが、全てが蓄積されていて\nもともとWSBに投稿するつもりはありませんでした。\nもともとWSBに投稿するつもりはなかったのですが、なぜなら、名誉あるWSBの住人の方々が...",
      "title": "GMEはそのネガティブベータであなたを悩ませています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "向地球上最聪明的人问好!\n\n我最近一直在玩GME和其他图表，这一切都积累成了一块巨大的美味的TA，我并不打算在WSB上发表。\n成了一块巨大的美味TA，我并不打算把它发到WSB上\n因为我觉得一些可敬的WSB居民可能...",
      "title": "GME即将用它的负β值来折磨你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "向地球上最聰明的人問好!\n\n我最近一直在玩GME和其他圖表，這一切都積累成了一塊巨大的美味的TA，我並不打算在WSB上發表。\n成了一塊巨大的美味TA，我並不打算把它發到WSB上\n因爲我覺得一些可敬的WSB居民可能...",
      "title": "GME即將用它的負β值來折磨你。"
    }
  ],
  "source_updated_at": 1632476402383
}