{
  "author": "IrritatedMonster",
  "original_created_utc": 1636609250,
  "title": "Until crypto becomes easier to use it'll never reach mass adoption",
  "created_utc": 1636652231,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think of myself as fairly knowledgeable about tech but after getting into crypto February of this year I&#39;ve realized just how hard using crypto can be. While I like the idea of decentralization I don&#39;t believe that it will ever be mass adopted in it&#39;s current form as it&#39;s just way to unfriendly to use. </p>\n\n<p>Sure some of it&#39;s really simple. I can create a coinbase pro account and buy crypto off of it and I can even send it to my Ledger with ease. What though happens when something goes wrong? </p>\n\n<p>I currently can&#39;t vote on Algo governance because even though the offical Algo wallet connects via bluetooth to my Ledger wallet it says it&#39;s not connected when I try to sign transactions. I&#39;ve reached out to Ledger and they are requiring video of me going through their online troubleshooting guide before they&#39;ll even talk to me and I just never heard back from the Algo wallet support. I also had issues with the Polygon network where I tried to move some Matic token from the ETH mainnet to the MATIC mainnet. Thought it was simple, logged in using the Polygon Bridge and paid the gas I needed to process the transaction and I figured I was done. Unfortunately for me nothing actually happened and my MATIC token are still sitting on the ETH mainnet. Reached out to Polygon support and they never even looked at my emails based on the replies I got. Spent a few weeks going back and forth with them only to give up. The best part was that the quickest reply I ever got from them was when they closed my ticket when I told them I was just giving up!</p>\n\n<p>Now maybe I&#39;m just an idiot and what I need/needed to do is obvious to someone reading this. When I think about mass adoption though I realize out of my group of friends if I&#39;m having these issues most of them would have more and they&#39;ll never adopt crypto if they can&#39;t even get support to talk to them without first taking a video of them sitting at a computer running through the troubleshooting guide. </p>\n\n<p>Sorry for the rant but after spending a few hours tonight trying to vote in Algo governance I just realized how fed up I was with feeling like and idiot because things that I think should be simple just aren&#39;t.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/qre3cl/until_crypto_becomes_easier_to_use_itll_never/",
  "subreddit": "CryptoCurrency",
  "id": "qre3cl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think of myself as fairly knowledgeable about tech but after getting into\ncrypto February of this year I've realized just how hard using crypto can be.\nWhile I like the idea of decentralization I don't believe that it will ever be\nmass adopted in it's current form as it's just way to unfriendly to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分では技術的なことにはかなり詳しいと思っていますが、今年の2月に暗号に出会ってからは\n今年の2月に暗号に参入してからは、暗号を使うことがいかに難しいかということを実感しました。\n非中央集権の考え方は好きですが、現在の形で大規模に採用されることはないと思います。\n私は分散化のアイデアは好きですが、現在の形では大量に採用されることはないと思っています...",
      "title": "暗号が簡単に使えるようにならないと、大量に普及することはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为自己对技术有相当的了解，但在今年2月开始接触加密货币后，我意识到使用加密货币有多难。\n我意识到使用加密货币是多么困难。\n虽然我喜欢去中心化的想法，但我不相信它能以目前的形式被大规模采用。\n大规模采用，因为它的方式太不友好了......",
      "title": "在加密货币变得更容易使用之前，它永远不会达到大规模的采用。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲自己對技術有相當的瞭解，但在今年2月開始接觸加密貨幣後，我意識到使用加密貨幣有多難。\n我意識到使用加密貨幣是多麼困難。\n雖然我喜歡去中心化的想法，但我不相信它能以目前的形式被大規模採用。\n大規模採用，因爲它的方式太不友好了......",
      "title": "在加密貨幣變得更容易使用之前，它永遠不會達到大規模的採用。"
    }
  ]
}