{
  "author": "ses92",
  "the_new_excerpt": "As many others this year, my account and strategy is quite aggressive, which\nalso means I keep quite a lot of cash (40-50%) to protest myself from sudden\nmarket downturns and give my myself flexibility in case of sudden corrections.\nRecently I’ve been thinking if it is wiser to keep money in fixed…",
  "original_created_utc": 1609230580,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "和今年其他很多人一样，我的账户和策略都很有进取心，\n也意味着我保留了相当多的现金(40%-50%)，以示抗议，以防突然\n在市场低迷的情况下，让我自己在突然调整的情况下有灵活性。\n最近我一直在想，把钱放在固定的…里是不是更明智",
      "title": "将过剩的流动性放在固定收益资产而不是现金中是明智的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "和今年其他很多人一樣，我的賬戶和策略都很有進取心，\n也意味着我保留了相當多的現金(40%-50%)，以示抗議，以防突然\n在市場低迷的情況下，讓我自己在突然調整的情況下有靈活性。\n最近我一直在想，把錢放在固定的…裏是不是更明智",
      "title": "將過剩的流動性放在固定收益資產而不是現金中是明智的嗎？"
    }
  ],
  "title": "It is wise to keep excess liquidity in Fixed income assets rather than cash?",
  "created_utc": 1609281022,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As many others this year, my account and strategy is quite aggressive, which also means I keep quite a lot of cash (40-50%) to protest myself from sudden market downturns and give my myself flexibility in case of sudden corrections. Recently I’ve been thinking if it is wiser to keep money in fixed income assets instead but I’m also not very well versed in the topic. REITs are also subject to market forces and so are dividend ETFs. I think that mostly leaves me with bonds, but governments bonds have returns that are too low and corporate bonds can be quite risky, but then again I’m open to all new ideas (maybe AAA bonds?). Nor will I even know how to go about purchasing them (maybe some vanguard etfs)? I’m looking for some guidance, whether it’s links, general advise, your personal experience etc</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/investing/comments/kmaghg/it_is_wise_to_keep_excess_liquidity_in_fixed/",
  "subreddit": "investing",
  "id": "kmaghg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334773
}