{
  "author": "eulersheep",
  "the_new_excerpt": "Many people are trying to draw connections between the many corrections of 2017,\nthe crash that signalled the end of the bull market in early 2018, and the\ncurrent market cycles of this bull market.\n\nSo far this bull cycle, Bitcoin has had a few corrections around the 30% mark. A\n30% correction in…",
  "original_created_utc": 1622265900,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が、2017年の多くの修正の間に関連性を描こうとしています。\n2018年初めの強気相場の終わりを告げる暴落、そして\nこの強気相場の現在の市場サイクル。\n\nこれまでのところ、この強気のサイクルでは、ビットコインは30％のマークの周辺で何度かの修正がありました。A\n30％の修正は...",
      "title": "この暴落は起こるべくして起こったものであり、強気相場はまだ終わっていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多人都试图在2017年的许多修正之间建立联系。\n在2018年初，标志着牛市结束的崩溃，以及目前的市场周期。\n目前这个牛市的市场周期。\n\n到目前为止，这个牛市周期，比特币在30%左右有几次修正。A\n30%的修正在...",
      "title": "这种崩溃需要发生，而牛市还没有结束。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多人都試圖在2017年的許多修正之間建立聯繫。\n在2018年初，標誌着牛市結束的崩潰，以及目前的市場週期。\n目前這個牛市的市場週期。\n\n到目前爲止，這個牛市週期，比特幣在30%左右有幾次修正。A\n30%的修正在...",
      "title": "這種崩潰需要發生，而牛市還沒有結束。"
    }
  ],
  "title": "This crash needed to happen, and the bull market is not over yet.",
  "created_utc": 1622280865,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many people are trying to draw connections between the many corrections of 2017, the crash that signalled the end of the bull market in early 2018, and the current market cycles of this bull market.</p>\n\n<p>So far this bull cycle, Bitcoin has had a few corrections around the 30% mark. A 30% correction in this market is not the same as any of the 30-40% corrections in 2017 for one key reason, sentiment. In 2017, people did not expect 30-40% corrections to lead to a continuation of the bull market. In 2017, Bitcoin was breaking into the mainstream, and we saw the first major alt seasons with Bitcoin losing a significant portion of its dominance for the first time.</p>\n\n<p>How is this time different? This time, people EXPECT 30-40% corrections to lead to a continuation in the bull market. Therefore a 30-40% correction is not capable of instilling the same level of fear and panic as a 30-40% correction did in 2017. In 2017, the 30-40% corrections lead to massive alt sell-offs, and mass panic. During the correction from 3k to $1.8k, many people were claiming the bull market was over. Same for the China ban crash in September. This time, basically no-one was calling for an end of the bull market during the crash from $42k to $28k, or $58k to $43k, those were just &#39;normal&#39; corrections.</p>\n\n<p>This is the first crash this bull market that has actually lead to panic, and alt sell-offs. In this respect, this crash is similar to the crash of June/July 2017. Bitcoin crashing 50% from its ATH was simply necessary, as any smaller crash was not capable of shifting sentiment. This is made clear by looking at Bitcoin dominance. Bitcoin did not even reclaim any dominance (i.e. alts weren&#39;t dropping more than Bticoin on average) until Bitcoin dropped below $40k.</p>\n\n<p><em>Tl;dr: This is the first crash this season that was powerful enough to shift sentiment. This makes this crash analogous to the June/July and September corrections in 2017, despite this being a larger correction.</em></p>\n</div><!-- SC_ON -->",
  "score": 699,
  "permalink": "/r/CryptoCurrency/comments/nngcvm/this_crash_needed_to_happen_and_the_bull_market/",
  "subreddit": "CryptoCurrency",
  "id": "nngcvm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296488
}