{
  "author": "ApprehensivePiglet86",
  "original_created_utc": 1633278646,
  "title": "How were longships actually useable? How did they manage to fit their supplies in the ship?",
  "created_utc": 1633311483,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Norse longships do not look like they were be good for raiding or trading at all. Every recreation I have ever seen requires it to be practically filled from bow to stern with people rowing for it to even operate, and there wasn&#39;t any below-deck storage for goods or money. So where did they keep everything? Not even just trade goods or stolen things, but even food, fresh water, medical supplies? Stuff to make a trip lasting longer than half a day?</p>\n\n<p>Of course it was versatile for shallow rivers or the sea, but the ship itself seems completely impractical for long voyages, especially for the weeks or even months-long trips that would eventually lead to the New World.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/q0l96q/how_were_longships_actually_useable_how_did_they/",
  "subreddit": "AskHistorians",
  "id": "q0l96q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Norse longships do not look like they were be good for raiding or trading at\nall. Every recreation I have ever seen requires it to be practically filled from\nbow to stern with people rowing for it to even operate, and there wasn't any\nbelow-deck storage for goods or money. So where did they keep…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "北欧の長船は、レイドやトレードには向いていないようです。\nした。私がこれまで見てきたレクリエーションでは、船首から船尾まで実質的に人で埋め尽くされていないと作動しませんでした。\n漕ぐ人で船首から船尾まで埋め尽くさないと動きません。\n船首から船尾まで人が溢れていないと動かないし、船尾には商品やお金を入れる場所がない。では、どこに保管していたのか...。",
      "title": "ロングシップは実際にどのように使われていたのでしょうか？どうやって物資を船に収めたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "北欧的长船看起来并不适合用于突袭或贸易。\n完全不适合。我所见过的每一种娱乐活动都要求它从船头到船尾几乎都要装满人，这样才能运行。\n它需要从船头到船尾都有人划船才能运行，而且没有任何\n而甲板下没有任何储存货物或金钱的地方。那么，他们在哪里保存...",
      "title": "长船实际上是如何使用的？他们是如何将物资装入船内的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "北歐的長船看起來並不適合用於突襲或貿易。\n完全不適合。我所見過的每一種娛樂活動都要求它從船頭到船尾幾乎都要裝滿人，這樣才能運行。\n它需要從船頭到船尾都有人划船才能運行，而且沒有任何\n而甲板下沒有任何儲存貨物或金錢的地方。那麼，他們在哪裏保存...",
      "title": "長船實際上是如何使用的？他們是如何將物資裝入船內的？"
    }
  ]
}