{
  "author": "RefugeeDutch_Syrian",
  "original_created_utc": 1640803523,
  "title": "I believe CoinMarketCap airdrops feature is a scam to get your personal information",
  "created_utc": 1640832713,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hear me out CMC fans, I have participated in all airdrops by CMC for the last months, every single one of them. Now I&amp;#39;m luckily not an idiot, so I created a new email just for crypto, with no information about my name or anything in the email address, created a FB account, telegram, a twitter account and installed trust wallet on an Android emulator.&lt;/p&gt;\n\n&lt;p&gt;I thought why not earn some free crypto for something that takes me a minute to fill in daily, I can just do it while drinking my morning coffee. Oh boy what I was wrong. I participated in +300 airdrops, each with hundreds or even thousands as the number of winners, but never, not even once have I gotten a single thing, even though I filled in the information required and followed the steps they list every time.&lt;/p&gt;\n\n&lt;p&gt;At this point, it is statistically improbable that it is not a scam. I believe it is a way that projects use to gain followers and never actually follow up on the airdrops, I will stop participating in it and you should too, especially if you are giving them your REAL data. That will enable them to link your crypto address to your twitter, FB and telegram, so please stop giving that data away for a complete waste of time!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/rrfcm5/i_believe_coinmarketcap_airdrops_feature_is_a/",
  "subreddit": "CryptoCurrency",
  "id": "rrfcm5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hear me out CMC fans, I have participated in all airdrops by CMC for the last\nmonths, every single one of them. Now I'm luckily not an idiot, so I created a\nnew email just for crypto, with no information about my name or anything in the\nemail address, created a FB account, telegram, a twitter…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CMCのファンの皆さん、私はCMCの全ての空輸に参加しました。\nヶ月、すべてです。今、私は幸いにも馬鹿ではないので、私が作成した\n自分の名前も何も書いていない暗号のための新しいメールです。\nFB、テレグラム、ツイッター...。",
      "title": "CoinMarketCapのエアドロップ機能は個人情報を取得するための詐欺だと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "听我说，在过去的几个月里，我参加了CMC的所有空投活动，每一次都是如此。\n我参加了CMC过去几个月的所有空投活动，每一次都是如此。现在我很幸运地不是一个白痴，所以我创建了一个\n我创建了一个新的电子邮件，专门用于加密货币，电子邮件中没有关于我的名字或任何信息。\n电子邮件地址，创建了一个FB账户，电报，微博......",
      "title": "我相信CoinMarketCap的空投功能是一个骗局，以获取你的个人信息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽我說，在過去的幾個月裏，我參加了CMC的所有空投活動，每一次都是如此。\n我參加了CMC過去幾個月的所有空投活動，每一次都是如此。現在我很幸運地不是一個白癡，所以我創建了一個\n我創建了一個新的電子郵件，專門用於加密貨幣，電子郵件中沒有關於我的名字或任何信息。\n電子郵件地址，創建了一個FB賬戶，電報，微博......",
      "title": "我相信CoinMarketCap的空投功能是一個騙局，以獲取你的個人信息。"
    }
  ]
}