{
  "author": "Dry_Tortuga_Island",
  "the_new_excerpt": "Hello, r/stocks [https://www.reddit.com/r/stocks/].\n\nI am trying to be a responsible investor and vote on the issues presented to\nshareholders for various annual meetings. The problem is that I really don't\nknow how to effectively find information on the people and proposals beyond…",
  "original_created_utc": 1618152270,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、r/stocks [https://www.reddit.com/r/stocks/]です。\n\n私は責任ある投資家になろうとしており、様々な年次総会で株主に提示された問題に投票しようとしています。\n投票しようとしています。問題は、どのようにして\n問題は、その先にある人や提案に関する情報を効果的に見つける方法がわからないことです...",
      "title": "株主投票。独立した情報やアドバイスをどこで得ることができるか（大企業の場合"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，r/stocks[https://www.reddit.com/r/stocks/]。\n\n我想做一个负责任的投资者，对提交给我的问题进行投票。\n各种年会的股东。问题是，我真的不\n懂得如何有效地找到信息的人和提案之外的...",
      "title": "股东投票。从哪里获得独立的信息和建议(对大公司而言)？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，r/stocks[https://www.reddit.com/r/stocks/]。\n\n我想做一個負責任的投資者，對提交給我的問題進行投票。\n各種年會的股東。問題是，我真的不\n懂得如何有效地找到信息的人和提案之外的...",
      "title": "股東投票。從哪裏獲得獨立的信息和建議(對大公司而言)？"
    }
  ],
  "title": "Shareholder voting: Where to get independent information and advice (for big companies)?",
  "created_utc": 1618185141,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello, <a href=\"https://www.reddit.com/r/stocks/\">r/stocks</a>.</p>\n\n<p>I am trying to be a responsible investor and vote on the issues presented to shareholders for various annual meetings. The problem is that I really don&#39;t know how to effectively find information on the people and proposals beyond the recommendation of the board.</p>\n\n<p>For example, Ford ($F) is holding a meeting and presented this proposal, on which the board is recommending a &quot;no&quot; vote:</p>\n\n<p><em>Relating to Consideration of a Recapitalization Plan to Provide That All of the Company&#39;s Outstanding Stock Have One Vote Per Share.</em></p>\n\n<p>Is there a place or method that people use to find independent recommendations on shareholder voting? Obviously, this would be mostly for big companies; I don&#39;t expect much info on an OTC junior mining venture, etc.</p>\n\n<p>Thanks for any advice! And if I am asking the wrong questions, please feel free to point me in the right direction.</p>\n\n<p>Edit:  I should note that I read through the segment in the annual report that outlined the issues surrounding share voting, but while I understand the facts of it, I am not able to interpret it effectively to know how to vote.</p>\n</div><!-- SC_ON -->",
  "score": 53,
  "permalink": "/r/stocks/comments/morxhn/shareholder_voting_where_to_get_independent/",
  "subreddit": "stocks",
  "id": "morxhn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618913
}