{
  "author": "malchik23",
  "original_created_utc": 1629388657,
  "title": "What I Learned from Roasting 200-300 Websites' SEO/marketing/landing copy/etc.",
  "created_utc": 1629392755,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A while back, I <a href=\"https://www.reddit.com/r/Entrepreneur/comments/otew4k/im_going_to_roast_your_website_seo_copy_marketing/\">did this thread</a> on where I roasted a whole bunch of websites in terms of marketing, SEO, landing page copy, and more.</p>\n\n<p>And funny enough, I noticed that most of the websites I was roasting were repeating <strong>the same exact mistakes</strong>.</p>\n\n<p>So, thought I&#39;d summarize all those mistakes into this one neat post. Think it&#39;s gonna be useful for a lot of the peeps here.</p>\n\n<p>Grab a tea/coffee/beer/tequila and let&#39;s get started!</p>\n\n<h1>#1. You&#39;re not getting SEO results unless you&#39;re actively doing SEO</h1>\n\n<p>I&#39;ve had a lot of people ask if their &quot;SEO was alright.&quot; The thing is, most of these people didn&#39;t have an SEO strategy in the first place.</p>\n\n<p>Sure, you can optimize your website based on SEO best practices (mention the keyword, include external/internal links, etc.), but that&#39;s nowhere near enough to get you to rank on Google.</p>\n\n<p>In order to drive SEO results for your website, you need to:</p>\n\n<ul>\n<li>Do keyword research and identify keywords you want to target (between 100-400 depending on the niche)</li>\n<li>Build your landing pages around these keywords as opposed to the other way around</li>\n<li>Write blog posts (if you&#39;re doing global SEO) targeting the keywords you found</li>\n<li>Optimize your site architecture by doing continuous internal linking</li>\n<li>Build backlinks to your website</li>\n</ul>\n\n<p>And a lot more.</p>\n\n<p>What I&#39;m getting at here is, SEO in 2021 is not something that &quot;just happens&quot; to your website. It&#39;s something you have to work for both actively and deliberately.</p>\n\n<p>Want to learn how to do SEO the right way? Check out my sub - <a href=\"/r/seogrowth\">/r/seogrowth</a>. Hope this doesn&#39;t come off as a self-insert, but I really think It&#39;s going to help a lot of people here. We&#39;re on a mission to make SEO accessible for everyone, and we&#39;d love to have you along for the trip :)</p>\n\n<p>That said, moving on to #2:</p>\n\n<h1>#2. Not all marketing channels are going to be relevant for your business</h1>\n\n<p>There are dozens of marketing channels you can use these days. Instagram ads, SEO, Google ads, and so many more.</p>\n\n<p>The thing is, though, that not all of these channels are going to be right for <strong>your business</strong> or your <strong>stage of growth.</strong></p>\n\n<p>For example, a lot of people with very fresh businesses (think, almost no customers) were asking how to do SEO.</p>\n\n<p>Well, the right answer here is that <strong>you shouldn&#39;t</strong>.</p>\n\n<p>For a new business, the most important thing you need to do is drive customers <strong>today</strong>, not next year.</p>\n\n<p>Unless you have a lot of VC capital, your business won&#39;t survive till your SEO kicks in.</p>\n\n<p>In such cases, you&#39;re better off using marketing channels with a more short-term impact. E.g. PPC ads, social media, direct outreach, and so on.</p>\n\n<h1>#3. Your website has to build trust</h1>\n\n<p>Waaaay too many websites I roasted looked extremely shady.</p>\n\n<p>Why? Because they had almost no information on who the person/team behind the website was.</p>\n\n<p>Say, I want to work with an accounting agency. The first thing I&#39;d do is check out their &quot;About Us&quot; page and see who&#39;s the team running the agency...</p>\n\n<p>And if their &quot;about us page&quot; is just generic copy-paste drivel with no team information, there&#39;s zero chance I&#39;m going to reach out to them.</p>\n\n<p>Want to add legitimacy to YOUR website? Here&#39;s what you can do:</p>\n\n<ol>\n<li>Add client testimonials. Don&#39;t have any? Go offer your service for free to a business that you think you can help.</li>\n<li>Add an &quot;about us&quot; page with <strong>your team on it.</strong> Don&#39;t have a team/are a solo founder? That&#39;s totally OK - just frame your website copy around a solo founder.</li>\n<li>Add photos of yourself / your team. Your clients want to work with <strong>real people</strong> - not faceless, nameless websites.</li>\n<li>Be as specific as you can about your services. If you can make the client understand what&#39;s the <strong>exact</strong> work you&#39;re doing for them, they&#39;re almost as good as sold.</li>\n</ol>\n\n<h1>#4. No one cares about your generic e-commerce website</h1>\n\n<p>If I want to order something online, 99% of the cases I&#39;ll just order from Amazon. I know, for a fact, that:</p>\n\n<ol>\n<li>The delivery will be fast</li>\n<li>The price will be good</li>\n<li>I&#39;m going to get quality support if I need it</li>\n</ol>\n\n<p>Now, if you want me to order from YOUR e-com store, you really have to work on your brand.</p>\n\n<p>Why should I order from YOUR website instead of Amazon?</p>\n\n<p>If your site is a list of random dropshipping products you scraped together, I ain&#39;t ordering.</p>\n\n<p>If you&#39;re selling random household stuff (which I can get faster from Amazon), I ain&#39;t ordering.</p>\n\n<p>On the other hand, if your store is built around a type of product line (e.g. you&#39;re selling Japanese streetwear clothing), then that&#39;s something a bit more unusual and interesting.</p>\n\n<h1>#5. If you&#39;re in a competitive niche, you have to differentiate your product/service</h1>\n\n<p>I NEVER tell people that they&#39;re in an oversaturated niche. I truly believe that if you&#39;re good at what you do and passionate about your business, you&#39;ll stand out even in a very overcrowded niche.</p>\n\n<p>That said, to make that happen, you need to differentiate your product/service.</p>\n\n<p>Let&#39;s say, for example, you have a crypto/blockchain blog. You won&#39;t be able to compete with big media in terms of how fast/well you cover crypto news. Chances are, you also won&#39;t be able to outrank them on Google (unless you&#39;re going to spend a TON of money on link-building or PR).</p>\n\n<p>So, what can you do to stand out with YOUR blog?</p>\n\n<p>Here are some examples:</p>\n\n<ul>\n<li>Cover crypto topics in simple English. Most blockchain content is very hard to understand for an outsider. Help solve that problem.</li>\n<li>Cover crypto topics in your native language. Most crypto content on the web is in English, so this could be a good way to niche down.</li>\n<li>Cover niche crypto projects big websites don&#39;t talk about as much.</li>\n<li>Do breakdowns of white papers of big projects. Most people don&#39;t want to spend 3 hours reading a white paper, so you could do videos that summarize them.</li>\n</ul>\n\n<h1>#6. It&#39;s 2021 - there&#39;s no excuse NOT to write good content</h1>\n\n<p>Around 10 years back, you could maintain a blog audience with subpar content.</p>\n\n<p>Today, literally everyone and their grandma writes blog content. Businesses, freelancers, bloggers, e-com stores, agencies, they all have a blog, and they&#39;re all publishing content.</p>\n\n<p>With so much content out there, you really need to create exceptional content in order to stand out.</p>\n\n<p>What&#39;s good content, you might ask?</p>\n\n<p>Well, good content is:</p>\n\n<ol>\n<li>Well-written and easy to read</li>\n<li>Jam-packed with graphics and images</li>\n<li>Includes examples and case studies</li>\n<li>Well-formatted. 2-4 sentences per paragraph, no blocks of text</li>\n<li>Written with an audience in mind</li>\n</ol>\n\n<h1>And that&#39;s about it!</h1>\n\n<p>I&#39;m planning on doing another roast thread soon, so if you missed the last one, stay tuned ;)</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/p7hmrb/what_i_learned_from_roasting_200300_websites/",
  "subreddit": "SideProject",
  "id": "p7hmrb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A while back, I did this thread\n[https://www.reddit.com/r/Entrepreneur/comments/otew4k/im_going_to_roast_your_website_seo_copy_marketing/]\non where I roasted a whole bunch of websites in terms of marketing, SEO, landing\npage copy, and more.\n\nAnd funny enough, I noticed that most of the websites I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し前にこんなスレッドを立てました。\n[https://www.reddit.com/r/Entrepreneur/comments/otew4k/im_going_to_roast_your_website_seo_copy_marketing/]\nマーケティング、SEO、ランディング・ページ・コピーなどの観点から、たくさんのウェブサイトを煎じて飲むという内容でした。\nページのコピーなどについて、たくさんのウェブサイトを批判しました。\n\nそして、面白いことに、私はほとんどのウェブサイトが...",
      "title": "200～300サイトのSEO/マーケティング/ランディングコピーなどを焙煎してわかったこと。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前一段时间，我做了这个主题\n[https://www.reddit.com/r/Entrepreneur/comments/otew4k/im_going_to_roast_your_website_seo_copy_marketing/]\n在那里我对一大堆网站的营销、搜索引擎优化、登陆页面的文案等方面进行了评估。\n页副本，以及更多。\n\n有趣的是，我注意到大多数的网站我...",
      "title": "我从200-300个网站的SEO/营销/登陆文案等方面学到的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前一段時間，我做了這個主題\n[https://www.reddit.com/r/Entrepreneur/comments/otew4k/im_going_to_roast_your_website_seo_copy_marketing/]\n在那裏我對一大堆網站的營銷、搜索引擎優化、登陸頁面的文案等方面進行了評估。\n頁副本，以及更多。\n\n有趣的是，我注意到大多數的網站我...",
      "title": "我從200-300個網站的SEO/營銷/登陸文案等方面學到的東西。"
    }
  ]
}