{
  "author": "yankees051693",
  "original_created_utc": 1637715245,
  "title": "The US Senate has just requested information on tether’s backing by DECEMBER 3",
  "created_utc": 1637725378,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you go on Twitter you can see the letter from the US Senate representatives yourselves. It doesn’t look great to be honest. They want to obviously know how it’s backed and if it’s truly backed which is the million dollar question. The senate wants answers to the questions asked in the letter by December 3. I also find it odd that Coinbase is having issues almost at the exact time this was announced. \n Nobody knows what’s going to happen but buckle up because it’s about to get bumpy. I hope we get some answers because this has been going on too long</p>\n</div><!-- SC_ON -->",
  "score": 354,
  "permalink": "/r/CryptoCurrency/comments/r0s553/the_us_senate_has_just_requested_information_on/",
  "subreddit": "CryptoCurrency",
  "id": "r0s553",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you go on Twitter you can see the letter from the US Senate representatives\nyourselves. It doesn’t look great to be honest. They want to obviously know how\nit’s backed and if it’s truly backed which is the million dollar question. The\nsenate wants answers to the questions asked in the letter by…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ツイッターを見れば、米国上院議員の手紙を見ることができます。\nあなた方自身のことです。正直なところ、あまり良い印象はありません。彼らが知りたいのは明らかに\n100万ドルの疑問である、どのような裏付けがあるのか、本当に裏付けがあるのかを知りたがっています。上院は\n上院は手紙に書かれた質問に答えを求めています...",
      "title": "米国上院は12月3日までにテザー社の裏付けに関する情報を要求してきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你上推特，你可以看到美国参议院代表的信\n你们自己。说实话，它看起来并不怎么样。他们显然想知道如何\n它是如何被支持的，以及它是否真的被支持，这是一个百万美元的问题。参议院\n参议院希望回答信中提出的问题，即...",
      "title": "美国参议院刚刚要求在12月3日之前提供有关tether的支持信息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你上推特，你可以看到美國參議院代表的信\n你們自己。說實話，它看起來並不怎麼樣。他們顯然想知道如何\n它是如何被支持的，以及它是否真的被支持，這是一個百萬美元的問題。參議院\n參議院希望回答信中提出的問題，即...",
      "title": "美國參議院剛剛要求在12月3日之前提供有關tether的支持信息。"
    }
  ]
}