{
  "author": "partymsl",
  "original_created_utc": 1650994680,
  "title": "Satoshi Nakamoto's disappearance is no mystery, but a Masterplan executed wisely.",
  "created_utc": 1651049000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today marks the 11 year-Anniversary of the Satoshi Nakamoto completly disappeared till today. Today he/she/they released their last message to the public, that already forshadowed the disappearance, the message was about not caring much about him but Bitcoin as a whole and the Dev team that was and is basically working for free on Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Now after 11 years many see this as a major mystery and maybe say that he even died. But for me it&amp;#39;s seems clear that he knowingly made this decision of going out forever.&lt;/p&gt;\n\n&lt;p&gt;During that time he disappeared, Bitcoin was picking up pace for the first time. Already the first big investments came in and it actually was seen as serious by some people. His work was done. He brought Bitcoin to the light and it was not his task to bring it further.&lt;/p&gt;\n\n&lt;p&gt;Because of his disappearance, today no one is capable of criticising him as he basically does not exist. He left making Bitcoin truely neutral, there is no  &amp;quot;head&amp;quot; or maker that has any specific goals for this projects, it&amp;#39;s truely just us.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/uci3r4/satoshi_nakamotos_disappearance_is_no_mystery_but/",
  "subreddit": "CryptoCurrency",
  "id": "uci3r4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today marks the 11 year-Anniversary of the Satoshi Nakamoto completly\ndisappeared till today. Today he/she/they released their last message to the\npublic, that already forshadowed the disappearance, the message was about not\ncaring much about him but Bitcoin as a whole and the Dev team that was and…"
}