{
  "author": "partymsl",
  "original_created_utc": 1650994680,
  "title": "Satoshi Nakamoto's disappearance is no mystery, but a Masterplan executed wisely.",
  "created_utc": 1651049000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today marks the 11 year-Anniversary of the Satoshi Nakamoto completly disappeared till today. Today he/she/they released their last message to the public, that already forshadowed the disappearance, the message was about not caring much about him but Bitcoin as a whole and the Dev team that was and is basically working for free on Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;Now after 11 years many see this as a major mystery and maybe say that he even died. But for me it&amp;#39;s seems clear that he knowingly made this decision of going out forever.&lt;/p&gt;\n\n&lt;p&gt;During that time he disappeared, Bitcoin was picking up pace for the first time. Already the first big investments came in and it actually was seen as serious by some people. His work was done. He brought Bitcoin to the light and it was not his task to bring it further.&lt;/p&gt;\n\n&lt;p&gt;Because of his disappearance, today no one is capable of criticising him as he basically does not exist. He left making Bitcoin truely neutral, there is no  &amp;quot;head&amp;quot; or maker that has any specific goals for this projects, it&amp;#39;s truely just us.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/uci3r4/satoshi_nakamotos_disappearance_is_no_mystery_but/",
  "subreddit": "CryptoCurrency",
  "id": "uci3r4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today marks the 11 year-Anniversary of the Satoshi Nakamoto completly\ndisappeared till today. Today he/she/they released their last message to the\npublic, that already forshadowed the disappearance, the message was about not\ncaring much about him but Bitcoin as a whole and the Dev team that was and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本日、サトシ・ナカモトの11周年記念日を迎えました。\n今日まで姿を消していました。今日、彼/彼女らは最後のメッセージを公開しました。\nそのメッセージは、彼のことはどうでもよくて、ビットコイン全体とその開発者のことを\nBitcoin全体と、その開発チームについてのメッセージでした。",
      "title": "サトシ・ナカモトの失踪は謎ではなく、賢明に実行されたマスタープランである。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天是中本聪完全消失11周年的日子。\n消失到今天。今天，他/她/他们向公众发布了他们的最后一条信息。\n今天，他/她/他们向公众发布了最后一条信息，这已经预示了他们的失踪，信息内容是关于不\n这条消息是关于不关心他，而是关心整个比特币和开发团队，他们曾经和...",
      "title": "中本聪的失踪并不神秘，而是一个明智地执行的总体计划。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天是中本聰完全消失11週年的日子。\n消失到今天。今天，他/她/他們向公衆發佈了他們的最後一條信息。\n今天，他/她/他們向公衆發佈了最後一條信息，這已經預示了他們的失蹤，信息內容是關於不\n這條消息是關於不關心他，而是關心整個比特幣和開發團隊，他們曾經和...",
      "title": "中本聰的失蹤並不神祕，而是一個明智地執行的總體計劃。"
    }
  ]
}