{
  "author": "Many_Scratch2269",
  "original_created_utc": 1637050705,
  "title": "Stop freaking out over minor corrections, we basically went up for 38 days straight.",
  "created_utc": 1637084075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I cringe every time someone posts here freaking out over the recent correction. This is possibly one of the most minor things you can worry about right now. Crypto is a highly volatile market and it is expected to have a few corrections of 5-10% here and there. </p>\n\n<p>This is even more true when the entire month of October was basically green including the first week of November. It is absolutely normal, and even healthy to have a few minor corrections on the way up. IMO, these dips are a great buying opportunity if you follow the pattern. These corrections are nothing compared to the -50% crash we had earlier this year.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8x9a16ey0xz71.png?width=836&amp;format=png&amp;auto=webp&amp;s=a5577f3d5c76f3c802d92d916ec1c0ca8798ca76\">To provide some perspective to the recent \\&quot;crash\\&quot; some people are worried about</a></p>\n\n<p>It perfectly fits into the rising wedge pattern, if just look at the correction before Oct 21 (great buying opportunity there). This is absolutely nothing to worry about. If you are a newbie, you should look at this as a buying opportunity instead. </p>\n\n<p>TLDR: It is crucial that you look at the bigger picture. Look at the trends, we had multiple of these corrections and they actually proved out to be a buying opportunity instead of a dip. The recent price action is absolutely nothing to worry about.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/qv32eu/stop_freaking_out_over_minor_corrections_we/",
  "subreddit": "CryptoCurrency",
  "id": "qv32eu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I cringe every time someone posts here freaking out over the recent correction.\nThis is possibly one of the most minor things you can worry about right now.\nCrypto is a highly volatile market and it is expected to have a few corrections\nof 5-10% here and there.\n\nThis is even more true when the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かが最近の修正に怯えてここに投稿するたびに、私はゾッとします。\nこれはおそらく、今心配すべき最も些細なことの一つです。\n暗号は非常に揮発性の高い市場であり、5～10％程度の修正があちこちで行われることが予想されます。\nあちこちで5～10％の修正があると予想されます。\n\nこれは、暗号化されていない場合はなおさらです。",
      "title": "細かい修正にビビるのはやめよう！基本的に38日連続で上昇したんだから。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当有人在这里发帖，为最近的修正感到恐慌时，我都会感到害怕。\n这可能是你现在可以担心的最次要的事情之一。\n加密货币是一个高度波动的市场，预计会有一些调整\n5-10%，在这里和那里。\n\n这甚至更真实，当...",
      "title": "不要再为小的修正而惊慌失措了，我们基本上连续上涨了38天。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當有人在這裏發帖，爲最近的修正感到恐慌時，我都會感到害怕。\n這可能是你現在可以擔心的最次要的事情之一。\n加密貨幣是一個高度波動的市場，預計會有一些調整\n5-10%，在這裏和那裏。\n\n這甚至更真實，當...",
      "title": "不要再爲小的修正而驚慌失措了，我們基本上連續上漲了38天。"
    }
  ]
}