{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Tuesday, April 27, 2021\n\nStocks turned modestly lower Tuesday, as market participants awaited for more\ncorporate earnings results and commentary from members of the Federal Open\nMarket Committee (FOMC), including Federal Reserve Chair Jerome Powell.\n\nThis week, a slew of huge…",
  "original_created_utc": 1619556121,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年4月27日（火\n\n4月27日(火)の株式市場は、企業の決算発表や連邦公開市場委員会(FOMC)での発言を控え、小幅な下落となりました。\nパウエル連邦準備制度理事会（FRB）議長を含む連邦公開市場委員会（FOMC）のメンバーのコメントを待っていました。\nパウエル連邦準備制度理事会議長を含む連邦公開市場委員会（FOMC）メンバーのコメントを待っていた。\n\n今週は、多数の巨大な...",
      "title": "本日2021年4月27日（火）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月27日，星期二\n\n周二股市小幅走低，因为市场参与者在等待更多的\n市场参与者等待更多的企业盈利结果和联邦公开市场委员会(FOMC)成员的评论，包括美联储主席杰罗姆-鲍威尔的评论。\n市场委员会（FOMC），包括美联储主席杰罗姆-鲍威尔的评论。\n\n本周，一连串的巨大...",
      "title": "以下是今天（2021年4月27日，星期二）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月27日，星期二\n\n週二股市小幅走低，因爲市場參與者在等待更多的\n市場參與者等待更多的企業盈利結果和聯邦公開市場委員會(FOMC)成員的評論，包括美聯儲主席傑羅姆-鮑威爾的評論。\n市場委員會（FOMC），包括美聯儲主席傑羅姆-鮑威爾的評論。\n\n本週，一連串的巨大...",
      "title": "以下是今天（2021年4月27日，星期二）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, April 27, 2021",
  "created_utc": 1619593746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Tuesday, April 27, 2021</strong></p>\n\n<p>Stocks turned modestly lower Tuesday, as market participants awaited for more corporate earnings results and commentary from members of the Federal Open Market Committee (FOMC), including Federal Reserve Chair Jerome Powell.</p>\n\n<p>This week, a slew of huge companies are set to report corporate earnings for the first quarter of 2021. Altogether, the market caps of the companies reporting this week comprise nearly half the total market cap of the S&amp;P 500, according to FactSet. So far, the vast majority of companies have vastly exceeded analyst estimates, with effective vaccine distribution in the US helping stoke demand as the economy gradually reopens. </p>\n\n<p>Eighty-four percent of the S&amp;P 500 companies that have reported first-quarter results to date posted a positive earnings per share surprise, according to data from FactSet. This would mark the highest percentage of companies reporting upside surprises since FactSet began tracking this metric in 2008, assuming this beat rate holds through the end of earnings season. </p>\n\n<p>Today kicked off the first of the FOMC’s two-day rate-setting meeting. The event is extremely unlikely to lead to any major shifts in monetary policy, with officials reiterating their commitment to keeping policy highly accommodative as the economy continues to recover from the pandemic. This includes maintaining interest rates near zero and maintaining an aggressive asset purchasing program at a monthly rate of $120 billion. In an earlier meeting, Powell said the Central Bank would slow the pace of its bond purchase program “well before” raising interest rates. Powell said, “We will taper asset purchases when we’ve made substantial further progress toward our goals from last December when we announced that guidance. That would in all likelihood be well before the time we consider raising rates.”</p>\n\n<p>In other news, according to a report by the Conference Board, consumer confidence has surged to a 14-month high in April as effective distribution of the vaccine and easing of social distancing guidelines in the US allows for the economy to gradually reopen. The Conference Board&#39;s monthly consumer confidence index jumped to a reading of 121.7 in April, or well above the 113.0 expected. Lynn Franco, senior director of economic indicators at the Conference Board, said in a statement, “Consumers’ assessment of current conditions improved significantly in April, suggesting the economic recovery strengthened further in early Q2. Consumers’ optimism about the short-term outlook held steady this month. Consumers were more upbeat about their income prospects, perhaps due to the improving job market and the recent round of stimulus checks.”</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Home price growth advanced further in February as tight inventory and still-strong demand weighed further on home affordability. </li>\n<li><a href=\"https://finance.yahoo.com/news/case-shiller-home-price-february-2021-130007537.html\">The S&amp;P CoreLogic Case-Shiller National Home Price Index </a>accelerated at a 11.97% year-over-year rate in February, according to a new report Tuesday morning. This marked the fastest pace since 2005</li>\n<li>Shares of Microsoft (MSFT) fell roughly 3% while shares of Alphabet (GOOG, GOOGL) surged more than 4% after both companies reported earnings today.</li>\n<li>Shares of Tesla (TSLA) fell roughly 4.5% after the company reported earnings, suggesting market participants were expecting more</li>\n<li>EU antitrust regulators are set to charge iPhone maker Apple this week with blocking rivals on its App Store following a complaint by music streaming service Spotify, a person familiar with the matter said on Tuesday.</li>\n<li><strong>**Please note that current stock price was written in the premarket and does not reflect intraday movement*\\</strong>*</li>\n<li>AutoZone (AZO) raised by Raymond James from $1565 to $1700 at Strong-Buy. Stock currently around $1444</li>\n<li>Chipotle (CMG) target raised by Royal Bank of Canada from $1730 to $1750 at Outperform. Stock currently around $1470</li>\n<li>COTY target raised by Royal Bank of Canada from $9 to $12 at Outperform. Stock currently around $10</li>\n<li>Caesars Entertainment (CZR) target raised by Deutsche Bank from $65 to $120 at Buy. Stock currently around $97</li>\n<li>DR Horton (DHI) target raised by Barclays from $108 to $114 at Overweight. Stock currently around $100</li>\n<li>FedEx (FDX) target raised by Berenberg Bank from $340 to $350 at Buy. Stock currently around $276</li>\n<li>Heico (HEI) target raised by Benchmark from $120 to $160 at Buy. Stock currently around $140</li>\n<li>LYFT target raised by BTIG Research from $70 to $80 at Buy. Stock currently around $63</li>\n<li>O&#39;Reilly Automotive (ORLY) target raised by Raymond James from $550 to $575 at Outperform. Stock currently around $526</li>\n<li>Proofpoint (PFPT) target raised by JPM Securities from $157 to $190 at Market Perform. Stock currently around $172</li>\n<li>Signature Bank (SBNY) target raised by Deutshce Bank from $165 to $285 at Buy. Stock currently around $252</li>\n<li>Tesla (TSLA) target raised by Goldman Sachs (GS) from $835 to $860 at Buy. Stock currently around $738</li>\n<li>Workday (WDAY) target raised by JMP Securities from $296 to $310 at Outperform. Stock currently around $259</li>\n</ul>\n\n<p>&quot;An investment in knowledge pays the best interest.&quot; — Benjamin Franklin</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/mzy3el/here_is_a_market_recap_for_today_tuesday_april_27/",
  "subreddit": "stocks",
  "id": "mzy3el",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776216012
}