{
  "author": "baconatoralpha",
  "the_new_excerpt": "So I recently got back into reddit after taking a break from crypto in general.\nI started investing in cryptocurrency around 2017 while I was still in\nuniversity as i was fortunate enough to be making money while studying.\n\nI initially only invested 1 btc and after scouring the forums and reddit,…",
  "original_created_utc": 1612123763,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我最近在远离加密货币后重新回到了reddit。\n我在2017年左右开始投资于加密货币，当时我还在读\n因为我很幸运，可以在学习期间赚钱。\n\n我最初只投资了1个btc，在浏览了论坛和reddit后，...",
      "title": "对于被Doge烧伤的投资者来说，这里有一个在2017年在诈骗币上损失了3个BTC的人的一些建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我最近在遠離加密貨幣後重新回到了reddit。\n我在2017年左右開始投資於加密貨幣，當時我還在讀\n因爲我很幸運，可以在學習期間賺錢。\n\n我最初只投資了1個btc，在瀏覽了論壇和reddit後，...",
      "title": "對於被Doge燒傷的投資者來說，這裏有一個在2017年在詐騙幣上損失了3個BTC的人的一些建議。"
    }
  ],
  "title": "For investors who got burned with Doge, here's some advice from someone who lost 3 BTC on a scamcoin in 2017.",
  "created_utc": 1612150672,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I recently got back into reddit after taking a break from crypto in general. I started investing in cryptocurrency around 2017 while I was still in university as i was fortunate enough to be making money while studying.</p>\n\n<p>I initially only invested 1 btc and after scouring the forums and reddit, I decided to invest in this coin called Confido. TBH, i cant remember now what the coin was about as I&#39;ve actively suppressed my memory of that event ever since it turned out to be a scam and I cant seem to make myself go into my telegram or google to remember it again.</p>\n\n<p>This was when I just entered the space and judging from what everyone who invested in the coin was saying, it was going to be the next big thing. As a clueless and young investor (I was 20 at that time), i decided to buy another 1 btc and bought more confido tokens. My interest in crypto was increasing by the day as I started to research more into other coins and learned how blockchain worked. Ethereum intrigued me, as it seemed to have more real world usage than bitcoin, and more importantly, a lot of ICO seemed to be running on that. As interesting as crypto was, my main goal was to make money and ICO seemed to have really good returns, and for that I needed ethereum. So I bought another 1.5 btc this time and 0.5 btc was put into ETH and the rest was put in confido (typing this part hurts as it always makes me remember the grief I experienced when that coin crashed as I watched it on my laptop in my empty dorm). I think I was one of the top 10 holders of this coin after that point.</p>\n\n<p>Anyways, with a good chunk of ethereum, and with better knowledge about this space, I began to research more into blockchain technology rather than just coins and started to figure out which coins would have actualy usage. Got into a few ICO and was lucky to be in the pool for the intial investment. It was at this point, i knew I shud diversify my portfolio so I only spent 1 ETH on all the ICOs I liked.</p>\n\n<p>Just as I was getting into all of this, the Confido coin I had invested 3 btc in turned out to be a scam and there were posts about it all over reddit. It was a frenzy in telegram as everyone started to panic sell. I decided to keep holding as I thought there was some mistake and its not a scamcoin. I was simply in shock watching my thousands of dollars investment plunge into nothing.</p>\n\n<p>I dont think I&#39;ve ever been this emotionally struck by anything in my life (maybe my first rejection from a girl in 6th grade would come a close second haha). I sat there in my dorm as I wondered why this happened. I was angry at the people who shilled it, I was angry at the ppl who made the coin, and I was angry at the community managers of this coin in telegram. However, I was most angry with myself with how naive and careless I was with money. I was hoping to save that money to buy a house for my parents in future and watching all of that disappear, I would never wish for anyone to go through that.</p>\n\n<p>At the end of the day, it was my fault. I put money into something not understanding how it worked and how investing in general worked as well. &quot;Always invest what you can afford to lose&quot; I wish i went with that mindset when I started.</p>\n\n<p>I tried everything to get something out of that coin but it was too late to sell as it was worthless. I had other coins as well as I was starting to diversify my portfolio but it was too late as majority of my investment was in that stupid coin. I tried to see if my ICO coins would help me recoup my losses but the market had entered a bearish run. I gave up and left everything related to crypto and decided to focus on my degree and job. I lost more than I could afford at the time, but i decided it was better to learn at this stage than later when I have a family to support. I have become a smarter investor after that incident and I learned how to better manage my finances.</p>\n\n<p>Here&#39;s my advice to ppl who got burned by Doge coin. Take it as a learning opportunity of how the crypto space works. Yes, money is lost and the feeling of pain and regret is overwhelming especially if you put a lot of money in, but know that time heals. A costly mistake always prevents you from making a similar one in future. As much as ppl like to roast others who are getting burned from the Doge PnD, sometimes its hard to know what&#39;s going through the other person&#39;s mind when they bought the coin. Maybe they were just stupid and wanted to make money for a better life, but didnt have any information. Telegrams and reddits of shitcoins are usually an echochamber of people convincing you that the coin will raise in value. For someone who is new to the space, they dont have the info as the people who have been here for years have.</p>\n\n<p>Seeing so many Doge memes roasting the people who bought at the peak made me recall the time I went through and I have sympathy for them. Some of them are delusional, yes, but that doesnt mean they&#39;re bad people, just lacking in information and crypto experience. Although I do have to admit, some of those Doge memes made me crack up, only because the face of the coin is an adorable chubby shiba.</p>\n\n<p>So, don&#39;t dwell on the loses and just take it as a learning experience. Crypto space is wonderful once you are familiar with it and there are so many people here willing to help others out.</p>\n\n<p>On the bright side, I came to see that some of my ICO coins are doing fantastic, especially Kyber Network and REN :)</p>\n</div><!-- SC_ON -->",
  "score": 266,
  "permalink": "/r/CryptoCurrency/comments/l9kqtk/for_investors_who_got_burned_with_doge_heres_some/",
  "subreddit": "CryptoCurrency",
  "id": "l9kqtk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518529081
}