{
  "author": "Armageddon85",
  "original_created_utc": 1629771102,
  "title": "You know what takes 3 days? Transferring $2,000 between two banks electronically. They're terrified!",
  "created_utc": 1629794425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work with various financial institutions and they&#39;re all scrambling to update their systems. They want plaid, they want faster transfers, but they&#39;re just so slow. I literally just went to transfer $2k from one bank to BOA. 3 days. <strong>3 GD DAYS for me to get my money moved?</strong> What are they doing with three days to verify electronic transactions? Oh and by the way I was only able to transfer $2k because there is a daily limit! WTH why do they limit the movement of money?? You bet your ass they take their sweet time so they make get the last ounce of milk out of your tits!</p>\n\n<p>Banks can&#39;t keep up and the likes of Crypto.com and Coin Base are going to be the next BOAs: </p>\n\n<ul>\n<li>cheaper fees</li>\n<li>faster transfers</li>\n<li>interconnected instant access</li>\n</ul>\n\n<p>The banks have been sucking on my $35 overdraft tits for far too long. It&#39;s only a matter of time before they crash and burn for the revolution of the banking industry.</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/pae5m6/you_know_what_takes_3_days_transferring_2000/",
  "subreddit": "CryptoCurrency",
  "id": "pae5m6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I work with various financial institutions and they're all scrambling to update\ntheir systems. They want plaid, they want faster transfers, but they're just so\nslow. I literally just went to transfer $2k from one bank to BOA. 3 days. 3 GD\nDAYS for me to get my money moved? What are they doing with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は様々な金融機関と仕事をしていますが、どこもアップデートに躍起になっています。\nシステムの更新に躍起になっています。格子柄がいいとか、転送速度を速くしたいとか、でもとにかく遅いんです。\n遅いのです。私は文字通り、ある銀行からBOAに2,000ドルを送金しに行きました。3日かかりました。3GD\n日もかかるのか？彼らは何をしているんだ...",
      "title": "3日かかることを知っていますか？2,000ドルを2つの銀行間で電子送金すること。彼らは怖がっている!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我与各种金融机构合作，他们都在争先恐后地更新\n他们的系统。他们想要格子，他们想要更快的传输，但他们只是如此\n缓慢。我真的只是去把2000美元从一家银行转到BOA。3天。3 GD\n天让我把钱转过来？他们在做什么...",
      "title": "你知道什么需要3天吗？在两家银行之间以电子方式转移2000美元。他们吓坏了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我與各種金融機構合作，他們都在爭先恐後地更新\n他們的系統。他們想要格子，他們想要更快的傳輸，但他們只是如此\n緩慢。我真的只是去把2000美元從一家銀行轉到BOA。3天。3 GD\n天讓我把錢轉過來？他們在做什麼...",
      "title": "你知道什麼需要3天嗎？在兩家銀行之間以電子方式轉移2000美元。他們嚇壞了!"
    }
  ]
}