{
  "author": "Solutar",
  "original_created_utc": 1630920876,
  "title": "Are we seriously back to the Elon Memes?",
  "created_utc": 1630931755,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reese Witherspoon? Gwyneth Paltrow? Paris Hilton? Are you kidding me?</p>\n\n<p>Few Months back everyone was celebrating Elon because he was into BTC, then he duped us, as Billionaires ALWAYS do because they are only interested in their money making, and we reacted oh so surprised!</p>\n\n<p>And now? F***g Paris Hilton?? If I was a investor that came fresh into this sub to check out crypto and seeing people like these being praised I would GET THE HELL OUTTA HERE!</p>\n\n<p>Seriously people, we should have learned by now, just because somebody invests in your favorite crypto coin does NOT mean that person has cryptos best interest in mind. Im all for upvoting, but certainly not posts that praise people that have no idea what crypto actually is.</p>\n\n<p>Also sorry for my English, it isn’t my first language.</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/piw632/are_we_seriously_back_to_the_elon_memes/",
  "subreddit": "CryptoCurrency",
  "id": "piw632",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Reese Witherspoon? Gwyneth Paltrow? Paris Hilton? Are you kidding me?\n\nFew Months back everyone was celebrating Elon because he was into BTC, then he\nduped us, as Billionaires ALWAYS do because they are only interested in their\nmoney making, and we reacted oh so surprised!\n\nAnd now? F***g Paris…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "リース・ウィザースプーン？グウィネス・パルトロウ？パリス・ヒルトン？私をからかっているのか？\n\n数ヶ月前、みんなはイーロンがBTCに参入したことを祝っていたが、その後彼は我々を騙した。\n億万長者はいつもそうですが、彼らは自分の利益にしか興味がないので、私たちを騙したのです。\nそして、私たちはとても驚きました。\n\nそして今？F***g Paris...",
      "title": "マジでElon Memesに戻るのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "里斯-威瑟斯彭（Reese Witherspoon）？格温妮丝-帕特洛？帕里斯-希尔顿？你在跟我开玩笑吗？\n\n几个月前，每个人都在为埃隆庆祝，因为他进入了BTC，然后他\n欺骗了我们，亿万富翁总是这样做，因为他们只对自己的钱感兴趣。\n赚钱，而我们的反应是哦，太惊讶了！现在呢？\n\n而现在呢？该死的巴黎......",
      "title": "我们是否真的回到了埃隆备忘录？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "里斯-威瑟斯彭（Reese Witherspoon）？格溫妮絲-帕特洛？帕里斯-希爾頓？你在跟我開玩笑嗎？\n\n幾個月前，每個人都在爲埃隆慶祝，因爲他進入了BTC，然後他\n欺騙了我們，億萬富翁總是這樣做，因爲他們只對自己的錢感興趣。\n賺錢，而我們的反應是哦，太驚訝了！現在呢？\n\n而現在呢？該死的巴黎......",
      "title": "我們是否真的回到了埃隆備忘錄？"
    }
  ]
}