{
  "author": "alexanderdegrote",
  "original_created_utc": 1650574974,
  "title": "why is Donald Duck way more popular than Mickey Mouse in Northern Europe and Mickey Mouse in the US?",
  "created_utc": 1650627950,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I used to read strips when I was younger I always used to skip Mickey Mouse stories because I found them boring. I heard this from more people around me So I think it is a popular opinion in the Netherlands. Generaly the strip is called Donald Duck and 80% of the stories is about the Donald Duck universe. So to conclude why does this difference exist?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/u8xj8x/why_is_donald_duck_way_more_popular_than_mickey/",
  "subreddit": "AskHistorians",
  "id": "u8xj8x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I used to read strips when I was younger I always used to skip Mickey Mouse\nstories because I found them boring. I heard this from more people around me So\nI think it is a popular opinion in the Netherlands. Generaly the strip is called\nDonald Duck and 80% of the stories is about the Donald…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "若い頃、ストリップを読んでいたとき、いつもミッキーマウスを飛ばしていました。\nミッキーマウスの話はつまらないと思い、いつも飛ばしていました。これは周りの人たちから聞いた話なので\nオランダでは一般的な意見なのでしょう。一般的なストリップは「ドナルドダック」と呼ばれ\nドナルド・ダックと呼ばれ、ストーリーの80％はドナルドの話です...。",
      "title": "北欧ではミッキーマウス、アメリカではミッキーマウスより、ドナルドダックの方が人気があるのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我年轻的时候，我曾经读过连环画，我总是习惯跳过米老鼠的故事\n故事，因为我觉得它们很无聊。我从我周围更多的人那里听到了这个消息。\n我认为这在荷兰是一种流行的观点。一般来说，这条带子被称为\n唐老鸭，80%的故事是关于唐老鸭的......",
      "title": "为什么唐老鸭在北欧比米老鼠更受欢迎，而在美国则是米老鼠？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我年輕的時候，我曾經讀過連環畫，我總是習慣跳過米老鼠的故事\n故事，因爲我覺得它們很無聊。我從我周圍更多的人那裏聽到了這個消息。\n我認爲這在荷蘭是一種流行的觀點。一般來說，這條帶子被稱爲\n唐老鴨，80%的故事是關於唐老鴨的......",
      "title": "爲什麼唐老鴨在北歐比米老鼠更受歡迎，而在美國則是米老鼠？"
    }
  ]
}