{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1636594267,
  "title": "I am a Nigerian prince about to inherit 3 billion Moons",
  "created_utc": 1636608643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello my friend, I do hope you are very well on this fine autumn evening. </p>\n\n<p>I have an opportunity for you if you would like to hear me out. </p>\n\n<p>I am Dr. Bakare Tunde, the cousin of Nigerian Astronaut, Air Force Major Abacha Tunde. He was the first African in space when he made a secret flight to the Salyut 6 space station in 1979. He was on a later Soviet spaceflight, Soyuz T-16Z to the secret Soviet military space station Salyut 8T in 1989. He was stranded there in 1990 when the Soviet Union was dissolved. His other Soviet crew members returned to earth on the Soyuz T-16Z, but his place was taken up by return cargo. There have been occasional Progrez supply flights to keep him going since that time. He is in good humor, but wants to come home.</p>\n\n<p>Long story short, you send me 5 moons and I will send you 5 million in return.</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/qr9l59/i_am_a_nigerian_prince_about_to_inherit_3_billion/",
  "subreddit": "CryptoCurrency",
  "id": "qr9l59",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello my friend, I do hope you are very well on this fine autumn evening.\n\nI have an opportunity for you if you would like to hear me out.\n\nI am Dr. Bakare Tunde, the cousin of Nigerian Astronaut, Air Force Major Abacha\nTunde. He was the first African in space when he made a secret flight to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "秋晴れの夕刻、お元気でしょうか。\n\nもしよろしければ、私の話を聞いていただきたいことがあります。\n\n私はナイジェリアの宇宙飛行士、アバチャ空軍少佐の従兄弟であるバカレ・トンデ博士です。\nTundeです。彼はアフリカ人として初めて宇宙に行った人で、秘密裏に飛行して...",
      "title": "私は30億ムーンを相続するナイジェリアの王子です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我的朋友，我确实希望你在这个美好的秋天夜晚过得很好。\n\n如果你愿意听我说完，我有一个机会。\n\n我是巴卡雷-唐德博士，是尼日利亚宇航员阿巴查空军少校的表弟。\nTunde。他是第一个进入太空的非洲人，当时他进行了一次秘密飞行，以...",
      "title": "我是一名尼日利亚王子，即将继承30亿月球。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我的朋友，我確實希望你在這個美好的秋天夜晚過得很好。\n\n如果你願意聽我說完，我有一個機會。\n\n我是巴卡雷-唐德博士，是尼日利亞宇航員阿巴查空軍少校的表弟。\nTunde。他是第一個進入太空的非洲人，當時他進行了一次祕密飛行，以...",
      "title": "我是一名尼日利亞王子，即將繼承30億月球。"
    }
  ]
}