{
  "author": "Nemesis916",
  "original_created_utc": 1649965086,
  "title": "Cardano’s Vasil hard fork will arrive on June 29th!",
  "created_utc": 1650004920,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As many of, you know, a major major major hard fork combinator event is happening in June, which is the Vasil hard fork, and that is going to contain pipelining, which will be a massive performance improvement to Cardano, alongside the first wave of significant Plutus enhancements since Plutus shipped in September.&lt;/p&gt;\n\n&lt;p&gt;Pipelining – or more precisely, diffusion pipelining – is an improvement to the consensus layer that facilitates faster block propagation. It enables even greater gains in headroom, which will enable further increases to Cardano’s performance and competitiveness.&lt;/p&gt;\n\n&lt;p&gt;Pipelining is just one of the pillars supporting Cardano’s scaling this year. Combined, all these changes will lead Cardano to a position where it is faster than its competitors, and a highly competitive platform for decentralized finance (DeFi) this year.&lt;/p&gt;\n\n&lt;p&gt;Expect June to be a month of innovation and change for the Cardano ecosystem.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/u3pi0h/cardanos_vasil_hard_fork_will_arrive_on_june_29th/",
  "subreddit": "CryptoCurrency",
  "id": "u3pi0h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As many of, you know, a major major major hard fork combinator event is\nhappening in June, which is the Vasil hard fork, and that is going to contain\npipelining, which will be a massive performance improvement to Cardano,\nalongside the first wave of significant Plutus enhancements since Plutus…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が知っているように、主要な主要なハードフォークコンビネーターイベントは\n6月に行われるバジル・ハードフォークでは、このハードフォークが行われる予定です。\nパイプライン化により、カルダノの性能は大幅に向上します。\nPlutus以来の重要なPlutusの強化の波と一緒に...。",
      "title": "CardanoのVasilハードフォークは6月29日に登場!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如许多人，你们知道的那样，一个主要的主要的硬分叉组合器事件是\n在6月发生，这是Vasil硬分叉，这将包含\n管道化，这将是对Cardano的一个巨大的性能改进。\n伴随着自Plutus以来的第一波重要的Plutus增强措施...",
      "title": "Cardano的Vasil硬分叉将于6月29日到来!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如許多人，你們知道的那樣，一個主要的主要的硬分叉組合器事件是\n在6月發生，這是Vasil硬分叉，這將包含\n管道化，這將是對Cardano的一個巨大的性能改進。\n伴隨着自Plutus以來的第一波重要的Plutus增強措施...",
      "title": "Cardano的Vasil硬分叉將於6月29日到來!"
    }
  ]
}