{
  "author": "quickerhunt",
  "original_created_utc": 1624510924,
  "title": "\"I didn't ask to be born.\" What is the philosophical solution to get out of this mindset?",
  "created_utc": 1624561807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A close friend of mine, whom I have known for several years, just had a breakup with his girlfriend. He is in depression for some days now, and just yesterday he hit me up with a question - &quot;I didn&#39;t ask to be born. I just randomly spawned into existence. Give me a good reason why I should build a life for myself while suffering through hardships and failures&quot;.</p>\n\n<p>I realized that this could be a really good reason why some people don&#39;t try at all, or why some people feel entitled.</p>\n\n<p>Has someone ever thought about this? Is there really a solution to this?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askphilosophy/comments/o6u0za/i_didnt_ask_to_be_born_what_is_the_philosophical/",
  "subreddit": "askphilosophy",
  "id": "o6u0za",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A close friend of mine, whom I have known for several years, just had a breakup\nwith his girlfriend. He is in depression for some days now, and just yesterday\nhe hit me up with a question - \"I didn't ask to be born. I just randomly spawned\ninto existence. Give me a good reason why I should build a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数年来の親しい友人が、ちょうど彼女と別れたところです。\n恋人と別れました。彼はここ数日落ち込んでいますが、ちょうど昨日、彼は私に質問しました。\n僕は頼んで生まれてきたわけじゃないんだ。ただランダムに生まれてきたんだ。\n存在している。なぜ私がこのような製品を作らなければならないのか、その理由を教えてください。",
      "title": "\"私は生まれてくることを望んでいない\" この考え方から抜け出すための哲学的な解決策とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的一个亲密朋友，我认识他好几年了，刚刚和他的女朋友分手了\n与他的女朋友分手。他已经抑郁了好几天了，就在昨天\n他问了我一个问题--\"我并没有要求出生。我只是随机地产生了\n存在。给我一个好的理由，为什么我应该建立一个...",
      "title": "\"我并没有要求出生\"。走出这种心态的哲学解决方案是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的一個親密朋友，我認識他好幾年了，剛剛和他的女朋友分手了\n與他的女朋友分手。他已經抑鬱了好幾天了，就在昨天\n他問了我一個問題--\"我並沒有要求出生。我只是隨機地產生了\n存在。給我一個好的理由，爲什麼我應該建立一個...",
      "title": "\"我並沒有要求出生\"。走出這種心態的哲學解決方案是什麼？"
    }
  ]
}