{
  "author": "Brrrtje",
  "the_new_excerpt": "Meteorite strike: I get it. Big bump, irridium, dinos dead. But recently I ran\ninto a geologist who is pointed out that there are other, bigger, craters that\nare not associated with mass extinctions, and who is convinced there story\nbehind the K-Pg mass extinction event is more complicated.\nI'm not…",
  "original_created_utc": 1623489641,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "隕石の衝突。わかります。大きな衝撃、イリジウム、恐竜の死。しかし、最近、私は\nしかし、最近、ある地質学者に出会いました。彼は、大量絶滅とは無縁の、もっと大きなクレーターが他にもあることを指摘しています。\n大量絶滅とは無縁のもっと大きなクレーターがあると指摘し、K-Pg大量絶滅にはストーリーがあると確信している地質学者に最近出会いました。\nK-Pg大量絶滅イベントの背景にはもっと複雑なストーリーがあると確信している地質学者に出会いました。\n私は...",
      "title": "恐竜の絶滅イベントに関する代替仮説の証拠はどの程度強いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "陨石撞击。我明白了。大撞击，铱，恐龙死亡。但最近我碰到了\n遇到一位地质学家，他指出还有其他更大的陨石坑，与大规模灭绝无关。\n他指出，还有其他更大的陨石坑与大规模灭绝无关，而且他确信K-PG大规模灭绝背后有一个故事。\n他相信K-Pg大灭绝事件背后的故事更加复杂。\n我不是...",
      "title": "恐龙灭绝事件的其他假说的证据有多强？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隕石撞擊。我明白了。大撞擊，銥，恐龍死亡。但最近我碰到了\n遇到一位地質學家，他指出還有其他更大的隕石坑，與大規模滅絕無關。\n他指出，還有其他更大的隕石坑與大規模滅絕無關，而且他確信K-PG大規模滅絕背後有一個故事。\n他相信K-Pg大滅絕事件背後的故事更加複雜。\n我不是...",
      "title": "恐龍滅絕事件的其他假說的證據有多強？"
    }
  ],
  "title": "How strong is the evidence for alternative hypotheses for the dinosaur extinction event?",
  "created_utc": 1623546785,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Meteorite strike: I get it. Big bump, irridium, dinos dead. But recently I ran into a geologist who is pointed out that there are other, bigger, craters that are not associated with mass extinctions, and who is convinced there story behind the K-Pg mass extinction event is more complicated.<br/>\nI&#39;m not asking what happened per se, but if there any sense to these alternatives, scientifically speaking? Is this just crackpot pseudoscience or is there some merit? How can you tell?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/ny2rl4/how_strong_is_the_evidence_for_alternative/",
  "subreddit": "askscience",
  "id": "ny2rl4",
  "is_self": true,
  "media": null,
  "is_video": false
}