{
  "author": "theodosiusthebear",
  "original_created_utc": 1631912054,
  "title": "Homosexuality was legal in revolutionary and Napoleonic France, but what would my experience as a gay French peasant have looked like?",
  "created_utc": 1631932750,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that homosexuality was made legal during the revolution, and that this was reaffirmed in Napoleon&#39;s later penal code. I&#39;ve also heard notable politicians and other public figures from this era being described as homosexual but that being said, I can&#39;t find any information relating to whether most of these people were out, or if they kept their sexuality more private. Would being an out homosexual have prevented you from holding a position of public trust?</p>\n\n<p>More specifically, I&#39;m wondering about what the experience of a less notable person who was queer (in any capacity) would have looked like. I&#39;m sure this would vary by region (for instance I would assume people in Paris were probably more accepting of social &#39;deviance&#39; than those in the conservative Vendée region?) but generally speaking, could I tell my family and neighbors? I know there wouldn&#39;t be legal repercussions but would I have to fear any other consequences? Would I and my partner be able to engage in public life? What would my experience have looked like?</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/pq8k5a/homosexuality_was_legal_in_revolutionary_and/",
  "subreddit": "AskHistorians",
  "id": "pq8k5a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know that homosexuality was made legal during the revolution, and that this\nwas reaffirmed in Napoleon's later penal code. I've also heard notable\npoliticians and other public figures from this era being described as homosexual\nbut that being said, I can't find any information relating to whether…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "革命時に同性愛が合法化され、その後のナポレオンの刑法でも再確認されたことを知っています。\n後のナポレオンの刑法でも再確認されています。また、この時代の著名な\nこの時代の政治家や公人が同性愛者だと言われているのを聞いたことがあります。\nとはいえ、この時代の著名な政治家や公人が同性愛者だったかどうかについての情報は見当たりません。",
      "title": "革命期やナポレオン期のフランスでは同性愛は合法でしたが、ゲイのフランス人農民としての私の経験はどのようなものだったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，同性恋在大革命期间是合法的，而这一点在拿破仑后来的刑法中得到了重申。\n在拿破仑后来的刑法典中得到了重申。我还听说这个时代的著名的\n我还听说这个时代的著名政治家和其他公众人物被描述为同性恋者。\n但话虽如此，我却找不到任何与此有关的信息。",
      "title": "同性恋在革命时期和拿破仑时期的法国是合法的，但我作为一个同性恋的法国农民，会有怎样的经历？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，同性戀在大革命期間是合法的，而這一點在拿破崙後來的刑法中得到了重申。\n在拿破崙後來的刑法典中得到了重申。我還聽說這個時代的著名的\n我還聽說這個時代的著名政治家和其他公衆人物被描述爲同性戀者。\n但話雖如此，我卻找不到任何與此有關的信息。",
      "title": "同性戀在革命時期和拿破崙時期的法國是合法的，但我作爲一個同性戀的法國農民，會有怎樣的經歷？"
    }
  ]
}