{
  "author": "Floridaboy453",
  "original_created_utc": 1645096904,
  "title": "I completely lost my cool last night at a McDonald's manager last night, I feel bad now for loosing my temper thats not like me, should I call and apologize.",
  "created_utc": 1645107945,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I got a burger on my way home from work last night, and when I got home I noticed, it didn&amp;#39;t have any patty on it. I was livid, since I had a long day at work and I drove back to the restaurant. I banged on the counter and the manager, who couldn&amp;#39;t have been older then 19 or 20, came out. I slammed the burger without a patty down on the counter , and starting yelling and swearing at the kid, granted he started getting a bit hostile and threatened to kick me out if I didn&amp;#39;t  calm down, I yelled at him and told him just to fix it. Eventfully he did, I grabbed my bag, and berated him again telling him hes a shitty manager, and he started getting a bit  defensive, which I don&amp;#39;t  blame him, I was being an asshole . I stormed out before calling him an asshole. When I got home I realized what an asshole I was, and how I acted was completely uncool. I feel bad for the kid, I could tell nobody has ever yelled at him like that before. Should I call the restrung tonight, and apologize. I really feel like a scumbag for going off like that, I was just exhausted and stressed out from work, the burger being messed up just set me off.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 147,
  "permalink": "/r/NoStupidQuestions/comments/sumj3i/i_completely_lost_my_cool_last_night_at_a/",
  "subreddit": "NoStupidQuestions",
  "id": "sumj3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I got a burger on my way home from work last night, and when I got home I\nnoticed, it didn't have any patty on it. I was livid, since I had a long day at\nwork and I drove back to the restaurant. I banged on the counter and the\nmanager, who couldn't have been older then 19 or 20, came out. I slammed…"
}