{
  "author": "Wafflywa",
  "the_new_excerpt": "I've only really been in crypto since '17, but since then I have seen the\nbiggest price swings imaginable. From btc 3k to 20k and back again to 5k in no\ntime.\n\nEvery time I have been thinking: \"ahh what if I would have just bought at 4k and\nsold at 20k, I would have had so much…",
  "original_created_utc": 1621842834,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が暗号に本格的に関わったのは17年からですが、それ以来、想像以上に大きな価格変動を目の当たりにしてきました。\n想像を絶する価格変動を目の当たりにしました。ビットコインが3,000円から20,000円になり、あっという間に5,000円に戻ったこともあります。\nあっという間でした。\n\nそのたびに私は考えていました。\"もし4kで買って20kで売っていたら、どうなっていただろう？\n20kで売っていたら、もっとたくさんのものを手に入れられたのに......」。",
      "title": "利益を得るということは、暗号から資金を引き出すことではなく、後からもっと資金を投入できるようにすることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从17年起才真正进入加密货币领域，但从那时起我就看到了\n可以想象的最大价格波动。从BTC的3K到20K，然后又回到5K，在短时间内\n时间。\n\n每一次我都在想。\"啊，如果我在4K时买入，在20K时卖出\n在20K时卖出，我就会有这么多......",
      "title": "获利不是为了把钱从加密货币中拿出来，而是为了能够在以后的时间里投入更多资金。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從17年起才真正進入加密貨幣領域，但從那時起我就看到了\n可以想象的最大價格波動。從BTC的3K到20K，然後又回到5K，在短時間內\n時間。\n\n每一次我都在想。\"啊，如果我在4K時買入，在20K時賣出\n在20K時賣出，我就會有這麼多......",
      "title": "獲利不是爲了把錢從加密貨幣中拿出來，而是爲了能夠在以後的時間裏投入更多資金。"
    }
  ],
  "title": "Taking profit is not about getting money out of crypto, it is about being able to put more in at a later time.",
  "created_utc": 1621879813,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve only really been in crypto since &#39;17, but since then I have seen the biggest price swings imaginable. From btc 3k to 20k and back again to 5k in no time.</p>\n\n<p>Every time I have been thinking: &quot;ahh what if I would have just bought at 4k and sold at 20k, I would have had so much money&quot;.</p>\n\n<p>Nevertheless, I have been sorta brainwashed that I can never sell any crypto because in the long run it will go up. It may be right, but just as you should dca in crypto you should Percentage Cost Average (PCA) out.</p>\n\n<p>I do realise that there were a lot of people advocating for this before me so I will just explain what I mean here.\nIf you have bought any crypto for let&#39;s say 100, then we are suddenly in a bull market and you wake if the next day at it is worth 130. There are 3 actions you can take: 1) Do nothing, you trust that it will be worth more in a few years so you don&#39;t want to gamble anything, 2) sell everything, you thing that the price will drop and you want to profit maximally from that, and 3) sell a percentage of your original investment so you have less money on the line.</p>\n\n<p>Let&#39;s focus on point 3 here. If your crypto rose from 100 to 130, and you had 100 invested, it means a 30% increase, which is actually insane in the normal world, but, luckily not in crypto. If you would just take the 30% out (or 20 or any number you feel comfortable with) you have just got 39 instead of your original 30. Your investment is now worth 91. If you would do this only 2 times more, it means that you have recovered your original investment and more. You are now playing with free money!\nThe second upside is that IF crypto drops again to below your original buy value, and there is a high chance that it will, that you can buy in at a much lower price with your profits.</p>\n\n<p>Tldr: taking percentage profits can lead to you having a bigger stack to buy crypto at bear market prices.</p>\n</div><!-- SC_ON -->",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/njsio2/taking_profit_is_not_about_getting_money_out_of/",
  "subreddit": "CryptoCurrency",
  "id": "njsio2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385281
}