{
  "author": "primarinadefensegang",
  "original_created_utc": 1657959456,
  "title": "How did 32 Wisconsin voters vote for \"Communist\" in 1876?",
  "created_utc": 1658011513,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I get this is small but this is bugging me so much. I have a book that details every Presidential election in US History, and in it, it says 32 people voted for &amp;quot;Communist&amp;quot; in Wisconsin. No candidate listed in either sources, and Wikipedia simply leads you to to the ideology of Communism.&lt;/p&gt;\n\n&lt;p&gt;There were a few Socialist parties at the time, such as Socialist Labor, but no Communist party to my knowledge, so what happened? Did people really vote for the ideology of Communism? And why 32 people, did they organize something?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/w0boaf/how_did_32_wisconsin_voters_vote_for_communist_in/",
  "subreddit": "AskHistorians",
  "id": "w0boaf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I get this is small but this is bugging me so much. I have a book that details\nevery Presidential election in US History, and in it, it says 32 people voted\nfor \"Communist\" in Wisconsin. No candidate listed in either sources, and\nWikipedia simply leads you to to the ideology of Communism.\n\nThere…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "小さいことだけど、これがすごく気になる。私の手元にある本には\nその中に、ウィスコンシン州で32人が \"共産主義者 \"に投票したと書いてあるんだ。\nがウィスコンシン州の \"共産主義者 \"に投票したと書いてある。どちらのソースにも候補者は載っていませんし\nウィキペディアは単に共産主義というイデオロギーに誘導しています。\n\nそこで...",
      "title": "1876年、ウィスコンシン州の32人の有権者は、どのようにして「共産主義者」に投票したのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这是个小问题，但这让我很不爽。我有一本书，上面详细介绍了美国历史上的每一次总统选举。\n我有一本详细介绍美国历史上每次总统选举的书，书中说有32人投票给 \"共产党\"。\n投给了威斯康星州的 \"共产党\"。两个资料中都没有列出候选人，而\n维基百科只是把你引向了共产主义的意识形态。\n\n那里...",
      "title": "1876年，威斯康星州的32名选民是如何投票给 \"共产党 \"的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這是個小問題，但這讓我很不爽。我有一本書，上面詳細介紹了美國曆史上的每一次總統選舉。\n我有一本詳細介紹美國曆史上每次總統選舉的書，書中說有32人投票給 \"共產黨\"。\n投給了威斯康星州的 \"共產黨\"。兩個資料中都沒有列出候選人，而\n維基百科只是把你引向了共產主義的意識形態。\n\n那裏...",
      "title": "1876年，威斯康星州的32名選民是如何投票給 \"共產黨 \"的？"
    }
  ]
}