{
  "author": "raebel33",
  "original_created_utc": 1630945843,
  "title": "I don't think Algorand is done.",
  "created_utc": 1630964146,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tomorrow El Salvador is launching it&#39;s crypto system on Algo blockchain. Governance starts in 25 days. Algodex, which found a way to make every currency tradable on their platform, will launch soon. Properties are increasingly being tokenized and sold on lofty. Yieldly continues to expand they staking prizes now with NFT&#39;s. NFT card game is in its infancy, but launched. All transaction are currently .0014 cents. I think all these things will power through accelerated vesting and the tokenomics concern is minimal. </p>\n\n<p>Not financial advice, DYOR, always invest what you can afford to lose, and no one knows shit about dick. But we&#39;ve been saying wait until Q4 for 6 months, and it appears to be playing out. It certainly appears to be way beyond some other currencies which are still in speculation phase, and top 5 MC&#39;s. I think Algo is STILL undervalued, even after this pump. My 2 cents.</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/CryptoCurrency/comments/pj2uha/i_dont_think_algorand_is_done/",
  "subreddit": "CryptoCurrency",
  "id": "pj2uha",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Tomorrow El Salvador is launching it's crypto system on Algo blockchain.\nGovernance starts in 25 days. Algodex, which found a way to make every currency\ntradable on their platform, will launch soon. Properties are increasingly being\ntokenized and sold on lofty. Yieldly continues to expand they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "明日、エルサルバドルがAlgoブロックチェーン上で暗号システムを立ち上げます。\nガバナンスの開始は25日後。あらゆる通貨をプラットフォーム上で取引可能にする方法を見つけたAlgodexは\nプラットフォーム上ですべての通貨を取引可能にする方法を見つけたAlgodexは、まもなくローンチします。不動産はますます\nトークン化してloftyで販売するケースが増えています。Yieldlyは、彼らを拡大し続けています。",
      "title": "アルゴランドは終わっていないと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "明天萨尔瓦多将在Algo区块链上推出它的加密货币系统。\n25天后开始治理。Algodex找到了一种方法，使每个货币\n可在其平台上交易的方法，将很快推出。物业正越来越多地被\n代币化并在lofty上出售。Yieldly继续扩大他们...",
      "title": "我不认为阿尔戈兰已经完成了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "明天薩爾瓦多將在Algo區塊鏈上推出它的加密貨幣系統。\n25天后開始治理。Algodex找到了一種方法，使每個貨幣\n可在其平臺上交易的方法，將很快推出。物業正越來越多地被\n代幣化並在lofty上出售。Yieldly繼續擴大他們...",
      "title": "我不認爲阿爾戈蘭已經完成了。"
    }
  ]
}