{
  "author": "Takemetoparadise_",
  "the_new_excerpt": "Hey everyone, just wanted to leave this here so that perhaps this tragedy won't\nhappen to anyone else. Been going through a really rough day as I just found out\na few hours ago from my best friend's girlfriend that he took his own life after\nthe huge market correction this morning. We've both…",
  "original_created_utc": 1621466138,
  "title": "Please don't trade on leverage if you aren't a professional trader. My best friend took his own life after he lost his entire portfolio from the correction earlier this morning.",
  "created_utc": 1621478265,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone, just wanted to leave this here so that perhaps this tragedy won&#39;t happen to anyone else. Been going through a really rough day as I just found out a few hours ago from my best friend&#39;s girlfriend that he took his own life after the huge market correction this morning. We&#39;ve both involved in the crypto scene for a while and even joked around last night about the market correction being a coordinated fud campaign to shake out investors.</p>\n\n<p>Unfortunately, my friend mistakenly assumed that the dip was over and that we would seen be having a bounce back very soon because we had never had more than a 40% correction during the last year or so. He opened a leveraged position and unfortunately had his entire account liquidated by Binance when he was unable to login to close his position.  From what I understand he had the entirety of his life savings in his account and unfortunately in the span of a few hours was completed wiped out.</p>\n\n<p>I&#39;m still not sure how to process and am still in a state of disbelief because we have been friends since the beginning of high school and knowing that I&#39;ll never be able to see or talk to him again is difficult to accept. We spoke and hung out almost every single day and he was like a brother to me. He always had my back whenever I needed it and I always had his. </p>\n\n<p>I just don&#39;t want this to have to happen to anyone else and I really wish he had spoken to me about what had happened because I would have definitely given him some of my own portfolio to help him get back up on his feet. </p>\n\n<p>If any of you reading this ever go through a difficult situation and have thoughts of self-harm, please reach out to a close friend or family member. At the end of the day its just money it can be earned back Life is too precious, and there are many people who care and love about you, that will deeply miss you if you are gone.</p>\n</div><!-- SC_ON -->",
  "score": 4122,
  "permalink": "/r/CryptoCurrency/comments/ngk8f6/please_dont_trade_on_leverage_if_you_arent_a/",
  "subreddit": "CryptoCurrency",
  "id": "ngk8f6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801373,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、このような悲劇が起きないように、ここに残しておきたいと思います。\n他の誰にでも起こることです。本当に辛い日々を過ごしています。\n数時間前、親友のガールフレンドから、彼が自ら命を絶ったことを聞きました。\n今朝の市場の大幅な調整。私たち二人は...",
      "title": "プロのトレーダーでない方は、レバレッジでの取引はしないでください。私の親友は、今朝方の調整でポートフォリオを全て失い、自ら命を絶ちました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我只是想把这个消息留在这里，这样也许这种悲剧就不会发生在其他人身上。\n发生在其他人身上。我一直在经历一个非常艰难的日子，因为我刚刚发现\n几个小时前，我从我最好的朋友的女朋友那里得知，他在发生巨大事故后自杀了。\n他在今天早上的巨大市场调整后自杀了。我们都...",
      "title": "如果你不是一个专业的交易员，请不要用杠杆交易。我最好的朋友在今天上午早些时候的调整中损失了他的全部投资组合后自杀了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我只是想把這個消息留在這裏，這樣也許這種悲劇就不會發生在其他人身上。\n發生在其他人身上。我一直在經歷一個非常艱難的日子，因爲我剛剛發現\n幾個小時前，我從我最好的朋友的女朋友那裏得知，他在發生巨大事故後自殺了。\n他在今天早上的巨大市場調整後自殺了。我們都...",
      "title": "如果你不是一個專業的交易員，請不要用槓桿交易。我最好的朋友在今天上午早些時候的調整中損失了他的全部投資組合後自殺了。"
    }
  ]
}