{
  "author": "ComicWeaver",
  "original_created_utc": 1634475045,
  "title": "Does decentralization automatically mean the Wild West? Is copyright even a thing in such a space?",
  "created_utc": 1634484962,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Code as Law, or Copyright Law?</p>\n\n<p>Bitcoin’s popularity increased as its value increased and people became excited about the prospect of a trustless, decentralized currency that could be used on the Internet.</p>\n\n<p>Within the last two years, however, people and organizations began exploiting the potential of the block chain that powers the bitcoin network. These people realized that the block chain — a transparent public ledger that cannot be altered — can be used for more than digital currency.</p>\n\n<p>One such organization calls itself Ethereum and its developers plan to use block chains to allow decentralized autonomous applications to operate free of government censorship or corruption. While such a network would have a profound effect on society — allowing trustless voting, uncensored social networking and the like — its impact on copyrights could be devastating.</p>\n\n<p>Decentralized Internet (also known as Web 3.0) will be the straw that breaks the copyright owner’s back. This post argues that, with block chain technology and decentralized applications, those buying and selling unauthorized copies of copyrighted material cannot be subject to court injunctions; making enforcement of copyrights nearly impossible on a decentralized Internet.</p>\n\n<p>This post then proposes that copyright holders get out in front of the problem by embracing a decentralized Internet. This can only be done by drastically reducing the price of copyright licenses. In other words, by offering cheap licenses at the dawn of Web 3.0, copyright holders can instill a sense that it’s better to be safe than sorry when it comes to the ongoing struggle between technology and copyrights.</p>\n\n<p>One of the prime examples have been most OpenSea collections or one project I am currently invested in: <a href=\"https://brickcoin.app/\">https://brickcoin.app</a></p>\n\n<p>It&#39;s a LEGO MiniFigure creator that you are able to mint to your own wallet as your own NFT, with the plan to sell, exchange or keep forever. Their Telegram chat is full of people like me, who grew up with LEGO.</p>\n\n<p>When asked in the chat, they will say that they are a fan project and not affiliated with LEGO, as they of course, should. They have the right to do whatever in a decentralized plane or else it wasn&#39;t decentralized right?  </p>\n\n<p>Credit: Dr. Scott J. Shackelford &amp; Dr. Steve Myers</p>\n</div><!-- SC_ON -->",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/q9y31g/does_decentralization_automatically_mean_the_wild/",
  "subreddit": "CryptoCurrency",
  "id": "q9y31g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Code as Law, or Copyright Law?\n\nBitcoin’s popularity increased as its value increased and people became excited\nabout the prospect of a trustless, decentralized currency that could be used on\nthe Internet.\n\nWithin the last two years, however, people and organizations began exploiting\nthe potential…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "法としてのコード、それとも著作権法？\n\nビットコインは、その価値の上昇に伴って人気が出てきました。\nビットコインは、インターネット上で使用できる信頼性の高い分散型の通貨として人気を博しました。\nビットコインは、その価値が上がり、インターネット上で使える信頼性の高い非中央集権的な通貨として人々の注目を集めました。\n\nしかし、この2年の間に、人々や組織がその可能性を利用し始めました。\nその可能性を利用して...",
      "title": "非中央集権化は、自動的に西部開拓時代を意味するのか？このような空間では、著作権は存在しないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "代码即法律，还是版权法？\n\n比特币的受欢迎程度随着其价值的增加而增加，人们对一个可以在网上使用的无信任的分散货币的前景感到兴奋。\n人们对一种可以在互联网上使用的无信任、去中心化的货币的前景感到兴奋。\n人们对可以在互联网上使用的无信任的、分散的货币的前景感到兴奋。\n\n然而，在过去的两年里，人们和组织开始利用\n的潜力...",
      "title": "去中心化是否自动意味着狂野的西部？在这样一个空间里，版权甚至是一个东西吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "代碼即法律，還是版權法？\n\n比特幣的受歡迎程度隨着其價值的增加而增加，人們對一個可以在網上使用的無信任的分散貨幣的前景感到興奮。\n人們對一種可以在互聯網上使用的無信任、去中心化的貨幣的前景感到興奮。\n人們對可以在互聯網上使用的無信任的、分散的貨幣的前景感到興奮。\n\n然而，在過去的兩年裏，人們和組織開始利用\n的潛力...",
      "title": "去中心化是否自動意味着狂野的西部？在這樣一個空間裏，版權甚至是一個東西嗎？"
    }
  ]
}