{
  "author": "MittlerPfalz",
  "original_created_utc": 1659550902,
  "title": "Why did Greek not leave behind a family of languages the way Latin did?",
  "created_utc": 1659556252,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been reading a lot about the Byzantine Empire and how Greek was the common language for centuries in huge swathes of the Mediterranean world.  Yet today Greek is pretty much only spoken in Greece and Cyprus, and has no major related languages to it in the same way that Latin morphed into the thriving family of Romance languages.  Why is that? Did the Ottoman Turks and all the other successor states of the formerly Greek speaking areas specifically stamp out the language?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/wfdyfn/why_did_greek_not_leave_behind_a_family_of/",
  "subreddit": "AskHistorians",
  "id": "wfdyfn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been reading a lot about the Byzantine Empire and how Greek was the common\nlanguage for centuries in huge swathes of the Mediterranean world. Yet today\nGreek is pretty much only spoken in Greece and Cyprus, and has no major related\nlanguages to it in the same way that Latin morphed into the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビザンツ帝国についてよく読んでいるのですが、ギリシャ語がいかに一般的な\n地中海沿岸の広大な地域で何世紀にもわたって共通語であったこと。しかし、今日\nギリシャ語はほとんどギリシャとキプロスでしか使われておらず、主要な関連言語もありません。\nラテン語が変化したのと同じように、ギリシャ語には主要な関連言語がありません。",
      "title": "なぜギリシャ語はラテン語のように言語の系列を残さなかったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在阅读关于拜占庭帝国的很多资料，以及希腊语是如何成为普遍的语言。\n几个世纪以来，希腊语是地中海世界大片地区的通用语言。然而今天\n希腊语几乎只在希腊和塞浦路斯使用，而且没有与之相关的主要语言。\n而没有任何主要的相关语言，就像拉丁语演变成其他语言一样。",
      "title": "为什么希腊语没有像拉丁语那样留下一个语言家族？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在閱讀關於拜占庭帝國的很多資料，以及希臘語是如何成爲普遍的語言。\n幾個世紀以來，希臘語是地中海世界大片地區的通用語言。然而今天\n希臘語幾乎只在希臘和塞浦路斯使用，而且沒有與之相關的主要語言。\n而沒有任何主要的相關語言，就像拉丁語演變成其他語言一樣。",
      "title": "爲什麼希臘語沒有像拉丁語那樣留下一個語言家族？"
    }
  ]
}