{
  "author": "GoldnDiesel",
  "the_new_excerpt": "Full Disclosure - I'm holding about 100 shares @ 38.\n\nThere was plenty of DD about CRSR leading up to earnings, everything I looked at\nshowed amazing future potential for this company that is consistently showing it\nis making alot of money and doing the right things to keep the company…",
  "original_created_utc": 1613240324,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "全面披露--我持有约100股@38。\n\n有大量的DD关于CRSR领先的收益，一切我看了\n显示了这家公司惊人的未来潜力，不断地显示出它的\n赚了很多钱，做了很多正确的事情来保持公司... ...",
      "title": "似乎在SOLID财报之后，CRSR就失去了讨论的机会。为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "全面披露--我持有約100股@38。\n\n有大量的DD關於CRSR領先的收益，一切我看了\n顯示了這家公司驚人的未來潛力，不斷地顯示出它的\n賺了很多錢，做了很多正確的事情來保持公司... ...",
      "title": "似乎在SOLID財報之後，CRSR就失去了討論的機會。爲什麼呢？"
    }
  ],
  "title": "Seems like CRSR lost its discussions after SOLID earnings. Why?",
  "created_utc": 1613269749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Full Disclosure - I&#39;m holding about 100 shares @ 38. </p>\n\n<p>There was plenty of DD about CRSR leading up to earnings, everything I looked at showed amazing future potential for this company that is consistently showing it is making alot of money and doing the right things to keep the company growing. </p>\n\n<p>After the drop in price after earnings, the research I did showed that this is normal for a stock that had alot of movement before an ER. </p>\n\n<p>That said, what usually happens after it finds its support, or resistance level, it will start to climb back up. I think we are currently at this point of consolidation before a upturn. It has held around $42 for a few days now, and with money coming out of Weed stocks and possibly out of pump and dump selections, it only seems logical that money will start being put back into safer, profitable, future potential companies. </p>\n\n<p>This is why I like CRSR, I have seen reports saying it&#39;s new price point is $50+. I agree with that price, and think that is a very safe evaluation with the possibility of reaching $60 by end of year. </p>\n\n<p>This isn&#39;t a DD, if you want to read up on it, check around all the subs, plenty of great long detailed posts discussing their potential. I am just reminding people to not forget about it if you are looking for a safer investment after making money (or losing) on the recent pump and dumps. </p>\n\n<p>;TLDR - CRSR has plenty of future potential, looks like it&#39;s hit it&#39;s support level and should start to trend back upwards. Take a look for yourself at the many great DDs posted before earnings, and then at how well they did last few quarters. Very large upside potential here for the long term as a safer investment. </p>\n\n<p>Do your own DD, but I think it looks like a safe entry point with little downside.</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/stocks/comments/lj5w11/seems_like_crsr_lost_its_discussions_after_solid/",
  "subreddit": "stocks",
  "id": "lj5w11",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623045
}