{
  "author": "LiveLaughLibor",
  "the_new_excerpt": "Full disclosure, I am a shareholder so my opinions can be biased.\n\nThis is not financial advice but I have tried to do some DD on this so please\nread to the end. I posted this to WSB yesterday and it didnt get much traction\nso i'm hoping more people here will find it useful.\n\nFor those of you who…",
  "original_created_utc": 1612724928,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "充分披露，我是股东，所以我的观点可能有偏差。\n\n这不是理财建议，但我试图对此做一些丈量，所以请你\n读到最后。我昨天把这个发到WSB上，但没有得到多少关注。\n所以我希望更多的人在这里会发现它的有用性。\n\n对于那些...",
      "title": "DD对Corsair($CRSR)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "充分披露，我是股東，所以我的觀點可能有偏差。\n\n這不是理財建議，但我試圖對此做一些丈量，所以請你\n讀到最後。我昨天把這個發到WSB上，但沒有得到多少關注。\n所以我希望更多的人在這裏會發現它的有用性。\n\n對於那些...",
      "title": "DD對Corsair($CRSR)"
    }
  ],
  "title": "DD on Corsair ($CRSR)",
  "created_utc": 1612730669,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong><em>Full disclosure, I am a shareholder so my opinions can be biased.</em></strong></p>\n\n<p>This is not financial advice but I have tried to do some DD on this so please read to the end. I posted this to WSB yesterday and it didnt get much traction so i&#39;m hoping more people here will find it useful. </p>\n\n<p>For those of you who might not know what Corsair is, they are a computer parts and peripherals company founded in 1994 that went public in September of 2020. If you have a desktop PC, keyboard, mouse, or are a streamer, chances are you have seen their logo. Corsair Gaming ($CRSR) reports earnings this coming week on Tuesday. In light of that, I have put together a few insights that some of you may find interesting.</p>\n\n<p><strong>Earnings. Tuesday February 9th</strong></p>\n\n<p>First, a look at the previous quarter’s earnings (Q3 2020)</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Q3 2020 Highlights</strong></p>\n\n<p>- Net revenue was $457.1 million, an <strong>increase of 60.7%</strong> year over year</p>\n\n<p>- Gamer and creator peripherals net revenue was $161.6 million, an <strong>increase of 128.8%</strong> year over year</p>\n\n<p>- Gross profit was $129.9 million, an <strong>increase of 112.4%</strong> year over year</p>\n\n<p>- Gross margin was 28%, an <strong>increase of 680 bps</strong> (that’s 6.8%)</p>\n\n<p>- Gamer and creator peripherals segment gross profit was $60 million, an <strong>increase of 200.8%</strong> year over year</p>\n\n<p>- Gaming components and systems segment gross profit was $67.9 million, an increase of 68.7% year over year</p>\n\n<p>- Operating income was $49.7 million, an <strong>increase of 353.6%</strong> year-over-year</p>\n\n<p>- Adjusted operating income was $61.4 million, an <strong>increase of 193.7%</strong> year-over-year</p>\n\n<p>- Net income was $36.4 million, or $0.40 per diluted share, compared to net income of $1.5 million in the same period a year ago, or $0.02 per diluted share</p>\n\n<p>- <strong>Adjusted net income was $48.5 million, or $0.54 per diluted share, an increase of 384.0% year-over-year compared to adjusted net income of $10.0 million, or $0.13 per diluted share.</strong></p>\n\n<p><strong>-</strong> Adjusted EBITDA was $63.7 million, an <strong>increase of 184.9%</strong> year-over-year, with adjusted EBITDA margin of 13.9%, an <strong>improvement of 610 bps</strong> year-over-year</p>\n\n<p><strong>Q3 Earnings Call Highlights (quotes from the call)</strong></p>\n\n<p>- “This last quarter was one with very strong demand, with many major retailers running out of stock of our gear. Our stock situation has gotten better but only a small part of Q3 revenue came from restocking shelves, <strong>with most gear selling as soon as they hit the shelves</strong>.”</p>\n\n<p>- “We also recently launched two new microphones under our Elgato brand, Wave 1 and Wave 3, <strong>which were sold out within the first few days of launch</strong>.”</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Catalysts for Growth</strong></p>\n\n<p>According to data released by the International Data Corporation (IDC),</p>\n\n<p>- Global gaming PC shipments are expected to jump by 25% by 2024, while <strong>global shipments of gaming laptops, desktop PCs, and monitors jumped 16.2% year over year in 2020 with December 2020 seeing the highest sales of PC components and peripherals on record</strong>.</p>\n\n<p><strong>-</strong> IDC predicts 2021 to witness a real surge in gaming PCs as new graphics processing units from Nvidia, AMD and Intel are expected to drive prices down and performance up.</p>\n\n<p><strong>- Global gaming PC sales revenue has jumped 60% in the past 5 years.</strong> In 2015 the global gaming PC market reached $24.6 billion in revenue, which has increased to $39.2 billion in 2020. High end gaming computers represent the largest revenue stream in 2020 at $18.5 billion or 47% of combined profits in 2020</p>\n\n<p>- Not only will Corsair be able to capitalize on a gaming PC super cycle upgrade with new GPUs but on October 22, 2020, Corsair announced the launch of their first officially licensed headset for Microsoft Xbox. Corsair will also be able to capitalize on the Sony Playstation and Microsoft Xbox console super cycle using their headsets and Scuf Gaming controllers for consoles. Corsair currently holds patents on several console controllers, Microsoft has licensed these patents to create the Xbox Elite Controller.</p>\n\n<p>- According to Corsair</p>\n\n<p>- There were 2.6 billion gamers (across all platforms) as of 2019</p>\n\n<p>- 11% of leisure time in the US is spent on gaming</p>\n\n<p>- 12 billion hours of gaming content was streamed in 2019</p>\n\n<p>- 71% of millennial gamers in the US watch gaming content on streaming platforms</p>\n\n<p>- Corsair will be able to capture this enormous rise in streaming using their Elgato line of products which enhance the ability of content creators to stream.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Market Share</strong></p>\n\n<p>- Pulled from Corsairs S-1 filing, they currently command over <strong>18% of the US market share in gaming peripherals and nearly 42% of the gaming PC components market share</strong>. This will allow them to capture a substantial portion of revenues from the global gaming peripherals market size which is expected to grow at a compounded annual growth rate <strong>(CAGR) of 10.4</strong>% from 2020 to 2025 according to grand view research.</p>\n\n<p><strong>- Ranking of Corsair’s Total US Market Share by Product:</strong></p>\n\n<p><strong>-</strong> Keyboards: 2nd</p>\n\n<p>- Mice: 3rd</p>\n\n<p>- Headsets: 4th</p>\n\n<p>- Streaming Peripherals: 2nd</p>\n\n<p>- Performance Controllers: 2nd </p>\n\n<p>- Memory: 1st </p>\n\n<p>- Cases: 1st </p>\n\n<p>- Power Supply Units: 1st </p>\n\n<p>- Cooling Solutions: 1st </p>\n\n<p><strong>-</strong> Releases of gaming content with ever-higher graphical requirements will drive consumers to upgrade their components and subsequently their peripherals as well. </p>\n\n<p>- <strong>Corsair gaming is an ecosystem of products with a strong and recognizable brand which creates extreme brand loyalty amongst its customers.</strong> This is more of a personal opinion but through my own experience and observation, it seems that when a customer goes to upgrade 1 component from Corsair, several hundred dollars later they come out the other side purchasing a number of internal PC components and have upgraded all of their peripherals (keyboard and mouse), but this is anecdotal.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Q4 Earnings &amp; Beyond</strong> (released before the bell on Tuesday February 9th).</p>\n\n<p>These are predictions and can obviously be taken with a grain of salt but I hope you can understand my rationale</p>\n\n<p>- I believe we will see a huge beat on Tuesday’s earnings release. This will be led by the compounding effects of the pandemic stay at home orders along-side an extremely strong holiday season. According to the site: Super Data, sales of digital games experienced a record number at $12 billion in December alone. This was the highest monthly revenue on record with PC games taking the lion’s share of this with a year over year revenue jump of 40% thanks to Cyberpunk 2077. This extremely high demand for PC games will drive the upgrading cycle and demand for Corsairs PC components and their peripherals. </p>\n\n<p>- I also believe that Corsair is a long term hold with substantial growth potential as the adoption of gaming grows.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Competitor Comparison</strong></p>\n\n<p><strong>-</strong> Corsair is frequently compared to Logitech. </p>\n\n<p>- Logitech currently has a market cap of $18.63 billion, Corsair has a market cap of $4.15 billion.</p>\n\n<p>- Logitech is expected to post 2020 fiscal year end revenue at $2.9 billion, Corsair is expected to post 2020 fiscal year end revenue at $1.65 billion.</p>\n\n<p>- Logitech is expected to post 2020 fiscal year end operating income at $300 million, Corsair is expected to post 2020 fiscal year end operating income at $192 million.</p>\n\n<p>- Logitech currently has 169 million shares outstanding with a float of 162 million shares (6% is shorted), Corsair currently has 92 million shares outstanding with a 25 million share float (24% is shorted)</p>\n\n<p>- If Corsair was trading at Logitech&#39;s market cap (which I would argue it should be with such similar revenue and operating income), $CRSR shares would be valued at $205/share as of the writing of this post.</p>\n\n<p><strong>I believe Corsair is severely undervalued</strong></p>\n</div><!-- SC_ON -->",
  "score": 737,
  "permalink": "/r/stocks/comments/let2ki/dd_on_corsair_crsr/",
  "subreddit": "stocks",
  "id": "let2ki",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203610
}