{
  "author": "petanibulan",
  "original_created_utc": 1642002082,
  "title": "If you want mass adoption, being an elitist to newbies won't help that",
  "created_utc": 1642026728,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The past few days I keep seeing people advising not to keep crypto in exchanges or stake in them.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s fine, they both have pros and cons. But what I hate is how these are written in a &lt;strong&gt;hostile manner&lt;/strong&gt; like &amp;quot;You deserve to lose money!&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;No. nobody deserves to lose money&lt;/strong&gt;, let alone being laughed at (unless you&amp;#39;re a scammer, then karma is a bitch).&lt;/p&gt;\n\n&lt;p&gt;Remember that according to the stats, &lt;strong&gt;~75% of subscribers joined after January 2021&lt;/strong&gt;. It&amp;#39;s safe to assume they started their crypto journey around that time.&lt;/p&gt;\n\n&lt;p&gt;Do you really expect newbies to be able to protect their seed phrase? Or not to mistakenly send their coin to the wrong address?&lt;/p&gt;\n\n&lt;p&gt;It is much safer to keep them in exchange as long as it&amp;#39;s the big one like Coinbase, Kraken, or Binance. Not to shady shit like Bitmart who listed every shitcoins out there. We have come a long way since Mt.Gox.&lt;/p&gt;\n\n&lt;p&gt;We should be glad that more and more people are investing in crypto. If someday managing own wallet is much simpler, then people will start transitioning by themselves.&lt;/p&gt;\n\n&lt;p&gt;And don&amp;#39;t forget to &lt;strong&gt;activate your 2FA&lt;/strong&gt;, but not with phone number because that&amp;#39;s easily hijacked.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/s29852/if_you_want_mass_adoption_being_an_elitist_to/",
  "subreddit": "CryptoCurrency",
  "id": "s29852",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The past few days I keep seeing people advising not to keep crypto in exchanges\nor stake in them.\n\nThat's fine, they both have pros and cons. But what I hate is how these are\nwritten in a hostile manner like \"You deserve to lose money!\".\n\nNo. nobody deserves to lose money, let alone being laughed…"
}