{
  "author": "petanibulan",
  "original_created_utc": 1642002082,
  "title": "If you want mass adoption, being an elitist to newbies won't help that",
  "created_utc": 1642026728,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The past few days I keep seeing people advising not to keep crypto in exchanges or stake in them.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s fine, they both have pros and cons. But what I hate is how these are written in a &lt;strong&gt;hostile manner&lt;/strong&gt; like &amp;quot;You deserve to lose money!&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;No. nobody deserves to lose money&lt;/strong&gt;, let alone being laughed at (unless you&amp;#39;re a scammer, then karma is a bitch).&lt;/p&gt;\n\n&lt;p&gt;Remember that according to the stats, &lt;strong&gt;~75% of subscribers joined after January 2021&lt;/strong&gt;. It&amp;#39;s safe to assume they started their crypto journey around that time.&lt;/p&gt;\n\n&lt;p&gt;Do you really expect newbies to be able to protect their seed phrase? Or not to mistakenly send their coin to the wrong address?&lt;/p&gt;\n\n&lt;p&gt;It is much safer to keep them in exchange as long as it&amp;#39;s the big one like Coinbase, Kraken, or Binance. Not to shady shit like Bitmart who listed every shitcoins out there. We have come a long way since Mt.Gox.&lt;/p&gt;\n\n&lt;p&gt;We should be glad that more and more people are investing in crypto. If someday managing own wallet is much simpler, then people will start transitioning by themselves.&lt;/p&gt;\n\n&lt;p&gt;And don&amp;#39;t forget to &lt;strong&gt;activate your 2FA&lt;/strong&gt;, but not with phone number because that&amp;#39;s easily hijacked.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/s29852/if_you_want_mass_adoption_being_an_elitist_to/",
  "subreddit": "CryptoCurrency",
  "id": "s29852",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The past few days I keep seeing people advising not to keep crypto in exchanges\nor stake in them.\n\nThat's fine, they both have pros and cons. But what I hate is how these are\nwritten in a hostile manner like \"You deserve to lose money!\".\n\nNo. nobody deserves to lose money, let alone being laughed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、暗号を取引所に預けるなというのをよく見かけます。\nあるいは出資している。\n\nどちらも長所と短所がありますから、それでいいんです。しかし、私が嫌いなのは、これらが\n損して当然だ！」みたいな敵意むき出しの書き方。\n\nいや、笑われるどころか、誰も損をする資格はないのだが...。",
      "title": "大量採用を目指すなら、初心者にエリート主義を貫いても、それは無理な話です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "过去几天，我不断看到有人建议不要把加密货币放在交易所里\n或入股它们。\n\n这很好，它们都有优点和缺点。但我讨厌的是这些建议是如何\n以一种敌对的方式写道：\"你应该输钱！\"。\n\n不，没有人值得输钱，更不用说被人嘲笑了......",
      "title": "如果你想大规模采用，对新手来说，做一个精英也无济于事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "過去幾天，我不斷看到有人建議不要把加密貨幣放在交易所裏\n或入股它們。\n\n這很好，它們都有優點和缺點。但我討厭的是這些建議是如何\n以一種敵對的方式寫道：\"你應該輸錢！\"。\n\n不，沒有人值得輸錢，更不用說被人嘲笑了......",
      "title": "如果你想大規模採用，對新手來說，做一個精英也無濟於事。"
    }
  ]
}