{
  "author": "partymsl",
  "original_created_utc": 1648332078,
  "title": "The amount of people here being 100% sure that their low-cap coin will make them rich is outrageous.",
  "created_utc": 1648359319,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently just made a post here asking whether there are any other bluechip coins else than BTC and ETH. I was obviously prepared for spam bots etc. But still the amount of people that claimed that their low-cap coin, no one knows about with a 100M market cap or so, is 100% safe was just outrageous.&lt;/p&gt;\n\n&lt;p&gt;Many claimed that some low-cap coin they invested in will definitely be successful in the future and is actually 100% safe. The sad thing is that many seemed like they are not even a bot. &lt;/p&gt;\n\n&lt;p&gt;Maybe that Crypto won&amp;#39;t crash into disappearance and actually survive but there is absolutely no guarantee that it will be profitable, especially with low-cap coins. That&amp;#39;s why it&amp;#39;s: higher risk, higher rewards.&lt;/p&gt;\n\n&lt;p&gt;Obviously a low cap coin no one knows about could possibly end up being very successful for you. So investing is not wrong. But you should know that there are probably hundreds of Cryptos doing the same thing, solving the same problem. So it&amp;#39;s very hard to find something legit and uniquely new nowadays in Crypto.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/tp57oc/the_amount_of_people_here_being_100_sure_that/",
  "subreddit": "CryptoCurrency",
  "id": "tp57oc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently just made a post here asking whether there are any other bluechip\ncoins else than BTC and ETH. I was obviously prepared for spam bots etc. But\nstill the amount of people that claimed that their low-cap coin, no one knows\nabout with a 100M market cap or so, is 100% safe was just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ここに「他の優良企業はないのか」という書き込みをしたところです。\nBTCとETH以外のコイン。スパムボットなどは当然覚悟の上でした。しかし\nそれでも、誰も知らない自分の低額コインを主張する人がたくさんいて\n時価総額1億円程度のものが100％安全というのは、ちょっと...。",
      "title": "ここで、自分の低額コインで金持ちになれると100％確信している人の多さは、とんでもないです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近刚刚在这里发了一个帖子，问除了BTC和ETH之外，还有没有其他的蓝筹币？\n除了BTC和ETH，还有没有其他的蓝筹币。我显然对垃圾邮件机器人等有所准备。但是\n但还是有很多人声称他们的低价币，没人知道，市值1亿左右，是100%的蓝筹币。\n声称他们的低价币，没有人知道，市值在1亿左右，是100%安全的，只是...",
      "title": "这里有多少人百分之百地确信他们的低帽币会让他们发财，这太离谱了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近剛剛在這裏發了一個帖子，問除了BTC和ETH之外，還有沒有其他的藍籌幣？\n除了BTC和ETH，還有沒有其他的藍籌幣。我顯然對垃圾郵件機器人等有所準備。但是\n但還是有很多人聲稱他們的低價幣，沒人知道，市值1億左右，是100%的藍籌幣。\n聲稱他們的低價幣，沒有人知道，市值在1億左右，是100%安全的，只是...",
      "title": "這裏有多少人百分之百地確信他們的低帽幣會讓他們發財，這太離譜了。"
    }
  ]
}