{
  "author": "SS117_",
  "original_created_utc": 1641219966,
  "title": "Why do we have the bad feeling before returning to work?",
  "created_utc": 1641257375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m returning to work tomorrow and for the life of me, I’m having the bad existential stomach churning experience. I’m in my late 20’s now and I know from the past it’s nothing, I will show up to work and it will be like before I left at Christmas. Same as when we used to return back to school. &lt;/p&gt;\n\n&lt;p&gt;So why do I still have this god-awful anxiety feeling when I know it will be fine? &lt;/p&gt;\n\n&lt;p&gt;Has anyone ever overcome it? I’d like to get rid of it completely if possible.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/rv2v4j/why_do_we_have_the_bad_feeling_before_returning/",
  "subreddit": "NoStupidQuestions",
  "id": "rv2v4j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m returning to work tomorrow and for the life of me, I’m having the bad\nexistential stomach churning experience. I’m in my late 20’s now and I know from\nthe past it’s nothing, I will show up to work and it will be like before I left\nat Christmas. Same as when we used to return back to school.\n\nSo…",
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我明天就要回去工作了，而我的生活中却有一种糟糕的\n存在感的胃部翻腾体验。我现在已经20多岁了，我知道从过去的情况来看，这没什么。\n我现在已经20多岁了，从过去的经验来看，这不算什么，我会去上班，就像我在圣诞节离开之前一样。\n在圣诞节。就像我们过去回到学校时一样。\n\n所以...",
      "title": "为什么我们在返回工作岗位之前会有这种不好的感觉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明天就要回去工作了，而我的生活中卻有一種糟糕的\n存在感的胃部翻騰體驗。我現在已經20多歲了，我知道從過去的情況來看，這沒什麼。\n我現在已經20多歲了，從過去的經驗來看，這不算什麼，我會去上班，就像我在聖誕節離開之前一樣。\n在聖誕節。就像我們過去回到學校時一樣。\n\n所以...",
      "title": "爲什麼我們在返回工作崗位之前會有這種不好的感覺？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "明日から仕事に復帰するのですが、どうしても、悪い\n存在する胃が痛くなるような体験をしました。私は今20代後半ですが、今までの経験上\n過去に何事もなかったかのように、職場に出てきて、辞める前のように\nクリスマスに 昔、学校に戻ったときと同じ。\n\nだから...",
      "title": "なぜ、復職前に嫌な予感がするのだろうか。"
    }
  ]
}