{
  "author": "TheWastebinAcc",
  "original_created_utc": 1627029558,
  "title": "What do you do when a man touches your waist “to get around you” ?",
  "created_utc": 1627065224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m not really sure how else to describe it, but you probably know what I mean. It’s become more well-known as of late thanks to Twitter/Instagram/etc. </p>\n\n<p>A guy moving around at a club or party puts his hand on your waist or the small of your back as they move by rather than just saying “excuse me I’m trying to get by.” Unnecessary, unwanted, and sort of… demeaning? And you just know a gesture like that is only for women, not other guys. </p>\n\n<p>What do you do in this situation? Do you push off his hand? Give him a look? Just ignore it? What is appropriate?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskWomen/comments/opy8vv/what_do_you_do_when_a_man_touches_your_waist_to/",
  "subreddit": "AskWomen",
  "id": "opy8vv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not really sure how else to describe it, but you probably know what I mean.\nIt’s become more well-known as of late thanks to Twitter/Instagram/etc.\n\nA guy moving around at a club or party puts his hand on your waist or the small\nof your back as they move by rather than just saying “excuse me I’m…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他にどう表現したらいいのかよくわからないのですが、たぶんあなたは私の言っていることがわかると思います。\n最近では、TwitterやInstagramなどのおかげで、よりよく知られるようになりました。\n\nクラブやパーティーで動き回っている男性が、あなたの腰や背中に手を置いて\n腰や背中に手を当てて、「すみません、ちょっと...」と言うのではなく",
      "title": "男性が「周りを気にして」腰を触ってきたら、どうしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的不知道还能怎么描述它，但你可能知道我的意思。\n最近，由于Twitter/Instagram/等的出现，它变得更加知名。\n\n一个在俱乐部或聚会上走动的男人，在他们走过你身边时，把他的手放在你的腰上或小\n而不是直接说 \"对不起，我是......\"。",
      "title": "当一个男人摸着你的腰 \"绕过你 \"时，你会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的不知道還能怎麼描述它，但你可能知道我的意思。\n最近，由於Twitter/Instagram/等的出現，它變得更加知名。\n\n一個在俱樂部或聚會上走動的男人，在他們走過你身邊時，把他的手放在你的腰上或小\n而不是直接說 \"對不起，我是......\"。",
      "title": "當一個男人摸着你的腰 \"繞過你 \"時，你會怎麼做？"
    }
  ]
}