{
  "author": "naomiidavison",
  "original_created_utc": 1628018067,
  "title": "do men prefer a hairless vagina?",
  "created_utc": 1628077040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I (f18) am really curious whether or not most men actually want their partner to shave. I wouldn&#39;t have much of a problem with doing it but for a hairy woman whose hair grows back fairly quickly, it&#39;s just not worth it for stubble to show up the next day. and not only does it take so much time and then grows back very soon, when it starts growing back its so damn itchy. just overall its not really worth it for me so I&#39;m always wondering if men are going to be unhappy with it.</p>\n\n<p>Edit: thank you everyone for the lovely replies! I definitely feel more secure in my choices now, I&#39;m also glad to know that I&#39;m not the only woman who finds shaving a hassle. have a good day/night guys!</p>\n</div><!-- SC_ON -->",
  "score": 3738,
  "permalink": "/r/TooAfraidToAsk/comments/oxam88/do_men_prefer_a_hairless_vagina/",
  "subreddit": "TooAfraidToAsk",
  "id": "oxam88",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I (f18) am really curious whether or not most men actually want their partner to\nshave. I wouldn't have much of a problem with doing it but for a hairy woman\nwhose hair grows back fairly quickly, it's just not worth it for stubble to show\nup the next day. and not only does it take so much time and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（F18）は、ほとんどの男性が実際にパートナーに剃ってもらいたいと思っているのかどうか、とても興味があります。\n剃ってほしいと思っているのか、とても気になります。私は剃っても問題ないと思いますが、毛がすぐに生えてくる毛深い女性にとっては\n私は剃っても問題ないと思いますが、毛深い女性はすぐに毛が生えてくるので、翌日に無精ひげが出てしまうのは勿体ないです。\n翌日に無精ひげが目立つのはもったいないし、時間もかかるし...。",
      "title": "男性は毛のないアソコを好む？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（18岁）真的很好奇，大多数男人是否真的想让他们的伴侣\n刮胡子。我对这样做没有什么意见，但对于一个多毛的女人来说\n但对于一个毛发生长得相当快的女人来说，为第二天出现的胡茬而付出代价是不值得的。\n而且这不仅需要花费大量的时间和...",
      "title": "男人喜欢无毛的阴道吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（18歲）真的很好奇，大多數男人是否真的想讓他們的伴侶\n刮鬍子。我對這樣做沒有什麼意見，但對於一個多毛的女人來說\n但對於一個毛髮生長得相當快的女人來說，爲第二天出現的胡茬而付出代價是不值得的。\n而且這不僅需要花費大量的時間和...",
      "title": "男人喜歡無毛的陰道嗎？"
    }
  ]
}