{
  "author": "XGamingMan",
  "original_created_utc": 1628854287,
  "title": "Can we stop posts asking about what coin is your favorite? Or what coin do you think will pump? And so on!!!!",
  "created_utc": 1628869650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every two hours there&#39;s a post asking the same queation with different wording.</p>\n\n<p>What is your favorite token? What is a coin you think will pump 1000x? What is a coin you think will dump next week? Tell me your favorite coin without telling me your favorite coin.</p>\n\n<p>And much much more. I am sick of seeing these stupid posts!</p>\n\n<p>CAN YOU STOP THIS SHIT?! IT IS FUCKING ANNOYING!!!!!</p>\n</div><!-- SC_ON -->",
  "score": 296,
  "permalink": "/r/CryptoCurrency/comments/p3ljn3/can_we_stop_posts_asking_about_what_coin_is_your/",
  "subreddit": "CryptoCurrency",
  "id": "p3ljn3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every two hours there's a post asking the same queation with different wording.\n\nWhat is your favorite token? What is a coin you think will pump 1000x? What is a\ncoin you think will dump next week? Tell me your favorite coin without telling\nme your favorite coin.\n\nAnd much much more. I am sick of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2時間ごとに、同じ質問を違う表現でしている投稿があります。\n\nあなたの好きなトークンは何ですか？あなたが1000倍になると思うコインは何ですか？来週ダンプすると思うコインは何ですか？\n来週には捨てられると思うコインは何ですか？あなたのお気に入りのコインを教えてください。\nあなたのお気に入りのコインを教えてください。\n\n他にもたくさんあります。私はうんざりしています。",
      "title": "どのコインが一番好きかという記事はやめてもらえませんか？とか、どのコインが流行ると思う？等々、!!!!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每两个小时就有一个帖子问同样的问题，但措辞不同。\n\n你最喜欢的代币是什么？你认为哪种硬币能抽到1000倍？什么是\n你认为下周会抛售的硬币是什么？告诉我你最喜欢的钱币，但不告诉\n我最喜欢的硬币。\n\n还有很多很多。我很讨厌...",
      "title": "我们能不能不要再发问什么硬币是你的最爱？或者你认为哪种硬币会抽奖？等等!!!!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每兩個小時就有一個帖子問同樣的問題，但措辭不同。\n\n你最喜歡的代幣是什麼？你認爲哪種硬幣能抽到1000倍？什麼是\n你認爲下週會拋售的硬幣是什麼？告訴我你最喜歡的錢幣，但不告訴\n我最喜歡的硬幣。\n\n還有很多很多。我很討厭...",
      "title": "我們能不能不要再發問什麼硬幣是你的最愛？或者你認爲哪種硬幣會抽獎？等等!!!!"
    }
  ]
}