{
  "author": "DangDoubleDaddy",
  "original_created_utc": 1637120356,
  "title": "I don’t understand this crest, like at all",
  "created_utc": 1637133932,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been staring at this old family crest for years. My family has no historians. We are remembered in French history for little besides a destroyed castle on the border with Germany and an old myth or two. But then there is this snake/horn armed lady and I can’t find any reason.</p>\n\n<p><a href=\"https://imgur.com/a/CSGgFor\">https://imgur.com/a/CSGgFor</a></p>\n\n<p>Like, she is a lady. The shield is unique enough but not totally incongruous with 17th century France. And then wavy horn arms. If someone could help me understand I would really appreciate it.</p>\n\n<p>FYI I am aware of the Chateau De Fleckenstein website, I’ve never found info on the crest from that source.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/qvq2dm/i_dont_understand_this_crest_like_at_all/",
  "subreddit": "AskHistorians",
  "id": "qvq2dm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been staring at this old family crest for years. My family has no\nhistorians. We are remembered in French history for little besides a destroyed\ncastle on the border with Germany and an old myth or two. But then there is this\nsnake/horn armed lady and I can’t find any…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの古い家紋を何年も見つめてきました。我が家には\n歴史家はいません。フランスの歴史の中では、ドイツとの国境にある破壊された城と\nドイツとの国境にある破壊された城と古い神話の他には、フランスの歴史に残っていません。しかし、そこにはこの\n蛇と角で武装した女性がいて、私は何も見つけられない...",
      "title": "私はこの紋章を全く理解していません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我盯着这个古老的家族徽章已经好多年了。我的家族没有\n历史学家。在法国历史上，除了与德国交界处的一座被毁坏的城堡和一两个古老的神话之外，我们几乎没有被人记住。\n除了与德国交界处的一座被毁坏的城堡和一两个古老的神话之外，我们在法国历史上几乎没有什么印象。但是，有这样一位\n蛇/角的女士，我找不到任何...",
      "title": "我不明白这个徽章，好像完全不明白"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我盯着這個古老的家族徽章已經好多年了。我的家族沒有\n歷史學家。在法國曆史上，除了與德國交界處的一座被毀壞的城堡和一兩個古老的神話之外，我們幾乎沒有被人記住。\n除了與德國交界處的一座被毀壞的城堡和一兩個古老的神話之外，我們在法國曆史上幾乎沒有什麼印象。但是，有這樣一位\n蛇/角的女士，我找不到任何...",
      "title": "我不明白這個徽章，好像完全不明白"
    }
  ]
}