{
  "author": "ScrollWithTheTimes",
  "original_created_utc": 1656337225,
  "title": "Do animals have episodic memory?",
  "created_utc": 1656351596,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was driving past an equestrian place the other day while there was a show happening. I drove past again the next day and all the horses were back in their fields quietly munching grass, and it got me wondering whether they had any memory of the previous day&amp;#39;s events.&lt;/p&gt;\n\n&lt;p&gt;We know that animals are able to remember which plants or other animals are good to eat, and which ones are dangerous, but I wouldn&amp;#39;t call this episodic memory. We also know that many animals can be trained to perform a certain action which they associate with a reward, but I doubt a dog is remembering what happened in training when told to sit - it&amp;#39;s become an instinct. Conversely we know that abused dogs will exhibit fear of humans, of men, or of particular objects because of negative experiences associated with these things, but are the dogs remembering specific times that they were hurt by these things, or is it again just a learned instinct?&lt;/p&gt;\n\n&lt;p&gt;When we as humans recall a memory, we are to all intents and purposes experiencing a dulled down abbreviated version of the original sensory inputs that created it (although obviously the sensory neurons from the body aren&amp;#39;t involved this time). We know that it&amp;#39;s only a memory, but I&amp;#39;m wondering whether an animal would be able to make this distinction. Perhaps the horses in my introduction would become really confused as to why they were eating grass but at the same time being ridden around, hearing a crowd but at the same time not seeing one, then suddenly seeing a crowd but not hearing any noise, then chewing on grass again but at the same time feeling a bit in their mouths. Do animals possess the intelligence to distinguish memories from live experiences, or is this a reason why they can&amp;#39;t possess episodic memory, because it would mess with their heads too much?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/askscience/comments/vlvrxt/do_animals_have_episodic_memory/",
  "subreddit": "askscience",
  "id": "vlvrxt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was driving past an equestrian place the other day while there was a show\nhappening. I drove past again the next day and all the horses were back in their\nfields quietly munching grass, and it got me wondering whether they had any\nmemory of the previous day's events.\n\nWe know that animals are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、ある馬術競技場の前を車で通りかかった時、ショーが行われていたのですが\nが行われていました。翌日も通りかかったら、馬はみんな田んぼに帰っていた。\nその時、馬たちは、「あの時のことは覚えているのだろうか？\nという疑問がわきました。\n\n私たちは、動物が...",
      "title": "動物にエピソード記憶はあるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，我开车经过一个马术馆，当时有一场表演。\n正在进行。第二天我又开车经过，所有的马匹都回到了它们的\n所有的马都回到了它们的田里，安静地啃着草，这让我想知道它们是否有任何\n是否对前一天的事件有记忆。\n\n我们知道，动物是...",
      "title": "动物是否有偶发记忆？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，我開車經過一個馬術館，當時有一場表演。\n正在進行。第二天我又開車經過，所有的馬匹都回到了它們的\n所有的馬都回到了它們的田裏，安靜地啃着草，這讓我想知道它們是否有任何\n是否對前一天的事件有記憶。\n\n我們知道，動物是...",
      "title": "動物是否有偶發記憶？"
    }
  ]
}