{
  "author": "Xayde26",
  "the_new_excerpt": "So, I'll start this by saying: Yes, if you look at my post history I mostly just\nopenly troll you autists. I've made fun of the conspiracy theories (mostly bc\n99% of you don't understand the importance of market integrity) and I've openly\nmocked the simps who joined WSB so they could be \"join the…",
  "original_created_utc": 1612661441,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我先说一下。是的，如果你看一下我的发帖记录，我主要是... ...\n公然挖苦你们这些自闭症患者。我已经取笑了阴谋论（主要是由于。\n99%的人都不明白市场诚信的重要性），我也曾公然\n嘲笑那些加入WSB的傻瓜，所以他们可以 \"加入...\"。",
      "title": "请阅读：我在富达投资的保证金部工作...... 罗宾汉的恐怖故事，由一个正在审查和处理您的ACATs的人讲述--第1部分。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我先說一下。是的，如果你看一下我的發帖記錄，我主要是... ...\n公然挖苦你們這些自閉症患者。我已經取笑了陰謀論（主要是由於。\n99%的人都不明白市場誠信的重要性），我也曾公然\n嘲笑那些加入WSB的傻瓜，所以他們可以 \"加入...\"。",
      "title": "請閱讀：我在富達投資的保證金部工作...... 羅賓漢的恐怖故事，由一個正在審查和處理您的ACATs的人講述--第1部分。"
    }
  ],
  "title": "PLEASE READ: I work at Fidelity Investments in the Margin Department... Horror Stories of the shitshow that is Robinhood, told by someone who is reviewing & processing your ACATs - PART 1",
  "created_utc": 1612675805,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I&#39;ll start this by saying: Yes, if you look at my post history I mostly just openly troll you autists.  I&#39;ve made fun of the conspiracy theories (mostly bc 99% of you don&#39;t understand the importance of market integrity) and I&#39;ve openly mocked the simps who joined WSB so they could be &quot;join the revolution&quot;.  I&#39;m OG WSB... this sub was about autistic YOLO plays that made no sense, coming up w/ retarded strategies, bragging about tendies, and telling people to long $ROPE when they blew their accounts up and cried about it.  I&#39;m the WSB equivalent of an old guy yelling at you kids to get off my lawn.</p>\n\n<p><strong><em>\\</em>****HOWEVER*****,</strong>* the things I&#39;ve seen over the past week as Fidelity is forced to restrict brand new accounts (bc of RH), reject perfectly good ACATs  (bc of RH), and watch as clients are shocked to hear the <strong>actual</strong> rules behind trading that the ENTIRE REST OF THE INDUSTRY USES are <strong>100% lawsuit worthy.</strong>  </p>\n\n<p>In the interest of time, ease of reading, and the desire to answer questions I will break these up into multiple parts.  </p>\n\n<p><em>Feel free to AMA in comments and I will respond as best I can. Assuming people find this helpful, part 2 will be coming soon.  If this post just ends up deleted by the bot then /shrug at least I posted it.</em></p>\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Part #1: Securities purchased using margin in RH accounts when the client had cash available to cover the position.</strong>So, RH is one of the only (the only?) firm where you just get margin as a part of opening your account.  Now, when I say margin I mean the thing that allows you to buy more stonks than you have funds in the account.</p>\n\n<p>____________________________________________________________________________</p>\n\n<p><strong>Please note:</strong> Having margin <em>ON</em> an account is different than having a <em>MARGIN ACCOUNT.</em> A margin account simply means that you have the ability to have the proceeds available for trade immediately after placing a sale.  Not all securities are marginable, which is why some securities (like GME the other week) required that you wait for the trade to settle before those funds became available to trade again).  Having margin <em>ON</em> an account, means your brokerage firm is giving you a line of credit through which you can purchase more stonks than you have the cash to cover (they charge you interest for this and this is how you can be margin called simply by holding stonks that you paid for).  Having margin <em>ON</em> an account ALSO means that, unless you sold the stonk within a few days of the initial purchase, you pay interest for using their money to buy/hold said stonk.</p>\n\n<p>FIDELITY ACCOUNTS REQUIRE THAT YOU FILL OUT A MARGIN AGREEMENT in order to have margin ON your account.  As such, when a security that has been purchased on margin hits an account without margin (like a freshly opened Fidelity account) the new account is restricted, the ACAT potentially rejected, and/or the client immediately is faced with a margin call at Fidelity.</p>\n\n<p>____________________________________________________________________________</p>\n\n<p><strong>WHAT DOES THIS MEAN TO YOU:</strong> Check your RH accounts!  If your positions show as being held in margin when you have cash available there is a good chance that Robinhood (rather than using the available cash to facilitate your securities purchase) instead purchased using the margin on the account.  In many cases, we are seeing clients who are looking back and realizing they&#39;ve been being charged margin interest without realizing it.  THIS IS NOT LEGAL.  If you have the cash available in your account to purchase a security, unless you specifically state otherwise, Robinhood is required to use your available cash FIRST.</p>\n\n<p><strong>IS THIS HAPPENING TO EVERYONE?</strong> No.  It seems to be sporadic but roughly 50% of the over 1m new accounts that Fidelity opened last week have had margin related restrictions slapped on them because of this issue.  However, one person we talked to had to close his bank account (at one of the big three banks) because, after transferring his Robinhood account, they started DEBITING HIS BANK ACCOUNT because they claimed he owed them margin interest.</p>\n\n<p><strong>MORALE OF THIS STORY: Review your account and make sure that your stonks and options (when applicable) are being held IN CASH if you know you had the cash available to purchase the position.</strong>  Review how much cash is in your RH account.  If RH says you are holding positions in margin and yet you have cash available to cover those positions then IMMEDIATELY contact Robinhood and insist that your positions be converted to CASH POSITIONS.  This does not require you to sell your positions.</p>\n\n<p>Review your statements, trade confirmations, and account to see if you have been charged margin interest.  If you used $10k in cash to buy $9.5k in GME stock, then you <strong>should not</strong> see any margin interest charges.  If you used $10k in cash + $5k in margin buying power to buy $15k of GME stock, then seeing interest charges makes sense.</p>\n\n<p>Assuming people find this helpful, part 2 will be coming soon.</p>\n</div><!-- SC_ON -->",
  "score": 16635,
  "permalink": "/r/wallstreetbets/comments/lec568/please_read_i_work_at_fidelity_investments_in_the/",
  "subreddit": "wallstreetbets",
  "id": "lec568",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123215616
}