{
  "author": "Rink1143",
  "original_created_utc": 1648203643,
  "title": "Do women ask to be eaten out like men ask for Blowjobs during dates?",
  "created_utc": 1648216509,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As the title says, men appararently are notorious for asking for a blow job or to be finished on 1st , 2nd or any date. Do women on dates also ask to be eaten out ?&lt;/p&gt;\n\n&lt;p&gt;I have been with few women and not one ever explicitly expressed me going down on them even though they would not stop me whenever my tongue would explore forbidden regions.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 201,
  "permalink": "/r/TooAfraidToAsk/comments/tnitgu/do_women_ask_to_be_eaten_out_like_men_ask_for/",
  "subreddit": "TooAfraidToAsk",
  "id": "tnitgu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "As the title says, men appararently are notorious for asking for a blow job or\nto be finished on 1st , 2nd or any date. Do women on dates also ask to be eaten\nout ?\n\nI have been with few women and not one ever explicitly expressed me going down\non them even though they would not stop me whenever my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、男性は見かけによらず、フェラチオを要求したり\n1回目、2回目、どのようなデートでも、フィニッシュを迎える。デート中の女性も「食べてください」と言うのでしょうか？\nアウト？\n\n今まで何人かの女性とお付き合いしてきましたが、はっきりと「降りる」と言った女性はいませんでした。\nしかし、そのようなことはありません。",
      "title": "男性がデート中にフェラチオをお願いするように、女性も食べ歩きをお願いするのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，男人显然是臭名昭著的，他们要求口交或\n在第一次、第二次或任何一次约会中被完成。女性在约会时也会要求被吃掉吗？\n的要求吗？\n\n我和几个女人在一起，没有一个人明确表示过我要对她们口交。\n在她们身上，尽管她们不会阻止我，只要我...",
      "title": "女人要求被吃掉，就像男人在约会时要求口交一样吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，男人顯然是臭名昭著的，他們要求口交或\n在第一次、第二次或任何一次約會中被完成。女性在約會時也會要求被喫掉嗎？\n的要求嗎？\n\n我和幾個女人在一起，沒有一個人明確表示過我要對她們口交。\n在她們身上，儘管她們不會阻止我，只要我...",
      "title": "女人要求被喫掉，就像男人在約會時要求口交一樣嗎？"
    }
  ]
}