{
  "author": "No_Weather682",
  "original_created_utc": 1655545852,
  "title": "Seriously, go out and enjoy this summer. Crypto won’t go anywhere.",
  "created_utc": 1655569954,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In times like these it’s very tempting to stare at the charts the whole day, but we all know that the next months look very bad for the crypto space. So why even spend the whole day looking at the charts?&lt;/p&gt;\n\n&lt;p&gt;I know that now it’s the perfect time for accumulating, but you can keep with your weekly/monthly DCA without spending your whole day at crypto charts. Mental Health is vital, and especially when you’re losing huge amounts of money. Everybody will be talking now about Bitcoin falling below the previous market cycle top, but you will thank yourself later if you take a break from social media and crypto charts.&lt;/p&gt;\n\n&lt;p&gt;TLDR: Go out with your family/friends and enjoy this summer, I promise when you come back crypto won’t be gone. Focus on your mental health in these hard times and keep doing your DCA in BTC/ETH.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 333,
  "permalink": "/r/CryptoCurrency/comments/vf2v49/seriously_go_out_and_enjoy_this_summer_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "vf2v49",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In times like these it’s very tempting to stare at the charts the whole day, but\nwe all know that the next months look very bad for the crypto space. So why even\nspend the whole day looking at the charts?\n\nI know that now it’s the perfect time for accumulating, but you can keep with\nyour…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんな時は一日中チャートとにらめっこしたくなるものですが\n今後数ヶ月は暗号空間にとって非常に悪い状況になることが分かっています。それなのに、なぜ\n一日中チャートを見ているのでしょうか？\n\n今が積み立てに最適な時期だということは分かっています。\nあなたの...",
      "title": "マジでこの夏を楽しんできてください。暗号はどこにも行きませんよ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这种时候，我们很想整天盯着图表看，但是\n我们都知道，未来几个月对加密货币领域来说是非常糟糕的。那么，为什么还要\n花一整天的时间看图表呢？\n\n我知道，现在是积累资金的最佳时机，但你可以继续保持\n你的...",
      "title": "说真的，走出去，享受这个夏天。Crypto不会去任何地方。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這種時候，我們很想整天盯着圖表看，但是\n我們都知道，未來幾個月對加密貨幣領域來說是非常糟糕的。那麼，爲什麼還要\n花一整天的時間看圖表呢？\n\n我知道，現在是積累資金的最佳時機，但你可以繼續保持\n你的...",
      "title": "說真的，走出去，享受這個夏天。Crypto不會去任何地方。"
    }
  ]
}