{
  "author": "BagOTurtles13",
  "original_created_utc": 1653740344,
  "title": "How do people decide they are non-binary?",
  "created_utc": 1653802492,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a girl and was raised in the 90&amp;#39;s/00&amp;#39;s being taught that it&amp;#39;s fine to be feminine and masculine. I played with my brother playing star wars and soldiers and football and cricket and getting messy outdoors, I played barbies with my sister and loved makeup and netball and doing my hair and wearing dresses. I carry that through to my adult life. What makes someone non-binary? To be clear, I have no agenda. I just feel as it&amp;#39;s become more mainstream I&amp;#39;d like to know what it means rather than be ignorant and dismissive on something I don&amp;#39;t understand.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/uzm5zb/how_do_people_decide_they_are_nonbinary/",
  "subreddit": "NoStupidQuestions",
  "id": "uzm5zb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a girl and was raised in the 90's/00's being taught that it's fine to be\nfeminine and masculine. I played with my brother playing star wars and soldiers\nand football and cricket and getting messy outdoors, I played barbies with my\nsister and loved makeup and netball and doing my hair and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は女の子ですが、90年代から00年代にかけて、「こうあるべき」と教えられながら育ちました。\n90年代から00年代にかけて、女性的であっても男性的であってもいいと教えられて育ちました。兄と一緒にスターウォーズやソルジャー、サッカーやクリケットで遊びました。\nとサッカーやクリケットで遊び、屋外で散らかしたり、妹とバービーで遊んだりしました。\n妹とバーベキューをしたり、お化粧やネットボール、髪をセットしたり...。",
      "title": "人はどのようにして自分がノンバイナリであると判断するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个女孩，在90/00年代长大，被灌输的思想是：\"做人要厚道\"。\n女性化和男性化。我和我哥哥一起玩星际战争和士兵\n我和哥哥一起玩星球大战、士兵、足球和板球，在户外玩得很乱。\n我和姐姐一起玩芭比娃娃，喜欢化妆，喜欢打网球，喜欢做头发和......",
      "title": "人们如何决定他们是非二进制的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個女孩，在90/00年代長大，被灌輸的思想是：\"做人要厚道\"。\n女性化和男性化。我和我哥哥一起玩星際戰爭和士兵\n我和哥哥一起玩星球大戰、士兵、足球和板球，在戶外玩得很亂。\n我和姐姐一起玩芭比娃娃，喜歡化妝，喜歡打網球，喜歡做頭髮和......",
      "title": "人們如何決定他們是非二進制的？"
    }
  ]
}