{
  "author": "pobopny",
  "original_created_utc": 1638197140,
  "title": "How do drugs know where to go in the body?",
  "created_utc": 1638234760,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, I obviously don&#39;t think medicine is actually making the choice of where to go.  </p>\n\n<p>But, if I take (for example) acetaminophen for a sprained ankle, adderall for my adhd, and bupropion and lamotrigine for my bipolar, how does all of that get to where it needs to go? Is it just a matter of getting distributed evenly through the body and then absorbed wherever there happen to be receptors that fit the molecules? Doesn&#39;t that end up being really inefficient? -- seems like most of the actual meds would just get filtered out pretty quickly.   </p>\n\n<p>Is that were drug interactions come from? -- multiple drugs competing for the same receptors?  </p>\n\n<p>EDIT: holy crap. I was not expecting this quantity or quality of responses. Seriously, i think I learned more here than an entire semester of biology. Every comment is a gem. Thank you all for your time and energy! It is very appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 2228,
  "permalink": "/r/askscience/comments/r4xct1/how_do_drugs_know_where_to_go_in_the_body/",
  "subreddit": "askscience",
  "id": "r4xct1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of all, I obviously don't think medicine is actually making the choice of\nwhere to go.\n\nBut, if I take (for example) acetaminophen for a sprained ankle, adderall for my\nadhd, and bupropion and lamotrigine for my bipolar, how does all of that get to\nwhere it needs to go? Is it just a matter of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず第一に、医療が実際にどこに行くかを選択しているとは明らかに思えません。\nどこに行くべきかを選択しているとは思えません。\n\nしかし、例えば、足首の捻挫にアセトアミノフェンを、adhdにアデロールを、双極性障害にブプロピオンとラモトリギンを服用したとします。\nadhdにはアデロール、双極性障害にはブプロピオンとラモトリギンを服用した場合、これらの薬はどのようにして必要な場所に行くのでしょうか？\nどのようにして、必要なところに行くのでしょうか？それは、単に...",
      "title": "薬が体内のどこに行くかは、どのようにして決まるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我显然不认为医学实际上是在选择\n去哪里。\n\n但是，如果我采取（例如）对乙酰氨基酚治疗扭伤的脚踝，阿德拉治疗我的\nadhd，以及治疗躁郁症的bupropion和lamotrigine，所有这些是如何到达\n它是如何到达需要去的地方的？这只是一个问题。",
      "title": "药物如何知道在体内的去向？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我顯然不認爲醫學實際上是在選擇\n去哪裏。\n\n但是，如果我採取（例如）對乙酰氨基酚治療扭傷的腳踝，阿德拉治療我的\nadhd，以及治療躁鬱症的bupropion和lamotrigine，所有這些是如何到達\n它是如何到達需要去的地方的？這只是一個問題。",
      "title": "藥物如何知道在體內的去向？"
    }
  ]
}