{
  "author": "tubrok98",
  "original_created_utc": 1633109160,
  "title": "World wide adoption of crypto has increased 880% since 2020",
  "created_utc": 1633163766,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly I wasn&#39;t surprised when I read about this. And the article was a couple months old so the number is probably even higher now.</p>\n\n<p>I can&#39;t wait for the day when crypto reaches full adoption and I can go to a grocery store and pay using crypto or something. We&#39;re already seeing something somewhat similar with crypto credit and Visa cards. Even I tried one from Eidoo Wallet. They&#39;re actually very handy and you can get used to them fast. Plus they give crypto cash back versus fiat cash back with regular credit cards. It&#39;s the things like these that will slowly make crypto more familiar to the mainstream market.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/pzcrwu/world_wide_adoption_of_crypto_has_increased_880/",
  "subreddit": "CryptoCurrency",
  "id": "pzcrwu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Honestly I wasn't surprised when I read about this. And the article was a couple\nmonths old so the number is probably even higher now.\n\nI can't wait for the day when crypto reaches full adoption and I can go to a\ngrocery store and pay using crypto or something. We're already seeing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、この記事を読んでも驚きませんでした。しかも、その記事は数ヶ月前のものだったので\n数ヶ月前の記事なので、今はもっと増えているでしょう。\n\n暗号が完全に普及して、食料品店に行っても、その日のうちに\n食料品店に行って、暗号を使って支払いができる日が待ち遠しいですね。私たちはすでに...",
      "title": "2020年以降、世界的に暗号の採用が880％増加"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，当我读到这个消息时，我并不感到惊讶。而且这篇文章是几个月前的\n几个月前，所以现在的数字可能会更高。\n\n我等不及有一天，当加密货币被全面采用时，我可以去一个\n我迫不及待地希望有一天加密货币能被全面采用，我可以去杂货店，用加密货币或其他东西付款。我们已经看到...",
      "title": "自2020年以来，世界范围内对加密货币的采用已增加了880%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，當我讀到這個消息時，我並不感到驚訝。而且這篇文章是幾個月前的\n幾個月前，所以現在的數字可能會更高。\n\n我等不及有一天，當加密貨幣被全面採用時，我可以去一個\n我迫不及待地希望有一天加密貨幣能被全面採用，我可以去雜貨店，用加密貨幣或其他東西付款。我們已經看到...",
      "title": "自2020年以來，世界範圍內對加密貨幣的採用已增加了880%。"
    }
  ]
}