{
  "author": "kadudu888",
  "original_created_utc": 1630622872,
  "title": "Have you become more and more respected amongst your family members, as price of Bitcoin climbs higher and higher?",
  "created_utc": 1630668709,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel like I have.</p>\n\n<p>But it was an uphill journey. Started in 2017 at $3000 and everyone was dismissive and was like “yea whatever one of your money making fantasy, again”</p>\n\n<p>2018 was “haha told you”</p>\n\n<p>2019 was “just move on”</p>\n\n<p>2020 was “you still at it?”</p>\n\n<p>I never gave up though, bite my lips and keep putting whatever i could into crypto, and continue to explain macro monetary concepts etc to family and friends</p>\n\n<p>It was not until when Bitcoin climbed to $30,000 when people started to speak to me in a different tone. “Oh so that Bitcoin thing can you tell me more about it”</p>\n\n<p>At $40000 “how do i buy Bitcoin please tell me”</p>\n\n<p>At $50000 “you are a genius i should have listened”</p>\n\n<p>At $60000 “may you please lend me some money?”</p>\n\n<p>Yet i dont care/mind peoples opinions too much nowadays, i just continue to explain to the ones who want to listen and learn. For the ones who jeer and throw dumb comments i just find them comical as I know I am now worth 50x their net worth and they will most likely continue to slave at those $12 an hour jobs until they invest in Bitcoin (or win the lottery, which ever is easier). </p>\n\n<p>Nowadays At the family dinner table with mum dad uncle aunt cousins, when I speak no one interrupts me anymore with random dismissive comments, they listen because they know that I know what they dont know.</p>\n\n<p>Do you feel the same?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/pgsjtz/have_you_become_more_and_more_respected_amongst/",
  "subreddit": "Bitcoin",
  "id": "pgsjtz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel like I have.\n\nBut it was an uphill journey. Started in 2017 at $3000 and everyone was\ndismissive and was like “yea whatever one of your money making fantasy, again”\n\n2018 was “haha told you”\n\n2019 was “just move on”\n\n2020 was “you still at it?”\n\nI never gave up though, bite my lips and keep…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はそう感じています。\n\nしかし、それは苦難の道のりでした。2017年に3000ドルでスタートして、誰もが否定的で\nまた金儲けの妄想かよ」と呆れられていました。\n\n2018年は「ハハ、言ったじゃないか」。\n\n2019年は \"Just move on\"\n\n2020年は「まだやってんの？\n\nしかし、私は決してあきらめず、唇を噛みしめて続けました...",
      "title": "ビットコインの価格が上昇するにつれて、家族の間で尊敬されるようになりましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得我有。\n\n但这是一个艰难的旅程。在2017年以3000美元开始，每个人都\n不屑一顾，说什么 \"又是你赚钱的幻想\"。\n\n2018年是 \"哈哈，告诉你了\"\n\n2019年是 \"继续前进\"\n\n2020年是 \"你还在做这个？\"\n\n但我从未放弃过，咬着嘴唇，继续...",
      "title": "随着比特币价格的不断攀升，你是否在你的家庭成员中变得越来越受尊重？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得我有。\n\n但這是一個艱難的旅程。在2017年以3000美元開始，每個人都\n不屑一顧，說什麼 \"又是你賺錢的幻想\"。\n\n2018年是 \"哈哈，告訴你了\"\n\n2019年是 \"繼續前進\"\n\n2020年是 \"你還在做這個？\"\n\n但我從未放棄過，咬着嘴脣，繼續...",
      "title": "隨着比特幣價格的不斷攀升，你是否在你的家庭成員中變得越來越受尊重？"
    }
  ]
}