{
  "author": "gdj11",
  "original_created_utc": 1633114970,
  "title": "Bitcoin is up not even 10% today, and only to where we were a month ago. Why is everyone acting like we just hit $100k or something?",
  "created_utc": 1633120487,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get everyone is happy there’s some green today, but we just went back to where we were only a month ago. Everyone is taking about “the journey to $100k has begun!” and “the recovery is here!” but if you zoom out of the charts just a little bit, it doesn’t look all that great. Maybe I’m missing something and don’t understand TA and can’t recognize the golden cross Fettuccini pattern or whatever the hell you draw on the charts, but don’t you think it’s a bit too early to call the next rocket launch?</p>\n</div><!-- SC_ON -->",
  "score": 327,
  "permalink": "/r/CryptoCurrency/comments/pzeqre/bitcoin_is_up_not_even_10_today_and_only_to_where/",
  "subreddit": "CryptoCurrency",
  "id": "pzeqre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I get everyone is happy there’s some green today, but we just went back to where\nwe were only a month ago. Everyone is taking about “the journey to $100k has\nbegun!” and “the recovery is here!” but if you zoom out of the charts just a\nlittle bit, it doesn’t look all that great. Maybe I’m missing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は緑があってみんな喜んでいるようですが、たった1ヶ月前の状態に戻ってしまったのです。\n一ヶ月前の状態に戻ってしまったのです。誰もが「10万ドルへの旅が始まった！」「回復の兆しが見えてきた！」と言っています。\n始まった！」とか「回復してきた！」とか言っていますが、チャートを少しだけ拡大してみると\nしかし、チャートを少しだけ拡大してみると、それほど素晴らしいとは思えません。もしかしたら、私の見落としかもしれませんが・・・。",
      "title": "ビットコインは今日、10％も上がっておらず、1ヶ月前の位置までしか上がっていません。なぜ皆、10万ドルを突破したかのように振る舞っているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道每个人都很高兴今天有一些绿色，但我们只是回到了一个月前的状态。\n我们只是在一个月前。每个人都在谈论 \"通往10万美元的旅程已经开始！\"和 \"复苏就在这里！\"但如果你把图表放大，就会发现\n但如果你把图表放大一点，就会发现情况并不那么好。\n但如果你把图表放大一点，它看起来并不那么好。也许我错过了...",
      "title": "比特币今天的涨幅连10%都不到，而且只到了一个月前的水平。为什么每个人都表现得像我们刚刚达到10万美元或什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道每個人都很高興今天有一些綠色，但我們只是回到了一個月前的狀態。\n我們只是在一個月前。每個人都在談論 \"通往10萬美元的旅程已經開始！\"和 \"復甦就在這裏！\"但如果你把圖表放大，就會發現\n但如果你把圖表放大一點，就會發現情況並不那麼好。\n但如果你把圖表放大一點，它看起來並不那麼好。也許我錯過了...",
      "title": "比特幣今天的漲幅連10%都不到，而且只到了一個月前的水平。爲什麼每個人都表現得像我們剛剛達到10萬美元或什麼？"
    }
  ]
}