{
  "author": "wise-purr",
  "the_new_excerpt": "I ask because I consider myself bisexual, but I don't have much relationship\nexperience, so I don't know how a relationship for me would differ. However, I'm\nstill curious. I know my friendships with men vs women differ sometimes, and I\nwonder if bisexual people have similar experiences with their…",
  "original_created_utc": 1621004274,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分はバイセクシャルだと思っていますが、あまり恋愛経験がないので\n自分はバイセクシャルだと思っていますが、あまり恋愛経験がないので、自分にとっての恋愛がどう違うのかわかりません。しかし、私は\n好奇心はあります。私は男性と女性との交友関係が時々異なることを知っています。\nバイセクシャルの人も同じような経験をしているのではないかと...。",
      "title": "バイセクシャルの方の場合、男性と付き合うのと女性と付き合うのとでは、人間関係はどう変わりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题是因为我认为自己是双性恋，但我没有太多的恋爱经验，所以我不知道我的恋爱会有什么不同。\n经验，所以我不知道我的关系会有什么不同。不过，我\n还是很好奇。我知道我与男性和女性的友谊有时是不同的，而我\n我想知道双性恋者是否也有类似的经历，他们是否也有类似的经历？",
      "title": "作为一个双性恋者，你和男人约会与和女人约会的关系有什么不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題是因爲我認爲自己是雙性戀，但我沒有太多的戀愛經驗，所以我不知道我的戀愛會有什麼不同。\n經驗，所以我不知道我的關係會有什麼不同。不過，我\n還是很好奇。我知道我與男性和女性的友誼有時是不同的，而我\n我想知道雙性戀者是否也有類似的經歷，他們是否也有類似的經歷？",
      "title": "作爲一個雙性戀者，你和男人約會與和女人約會的關係有什麼不同？"
    }
  ],
  "title": "As a bisexual person, how do your relationships different dating a man vs dating a woman?",
  "created_utc": 1621055452,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I ask because I consider myself bisexual, but I don&#39;t have much relationship experience, so I don&#39;t know how a relationship for me would differ. However, I&#39;m still curious. I know my friendships with men vs women differ sometimes, and I wonder if bisexual people have similar experiences with their romantic/intimate relationships, or if they experience a difference at all.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/ncal6p/as_a_bisexual_person_how_do_your_relationships/",
  "subreddit": "TrueAskReddit",
  "id": "ncal6p",
  "is_self": true,
  "media": null,
  "is_video": false
}