{
  "author": "Sissin88",
  "original_created_utc": 1631277789,
  "title": "As a formerly clueless United States citizen, how can I learn more about “the troubles” in Northern Ireland in the 90s specifically regarding Irish travelers?",
  "created_utc": 1631294794,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A close friend grew up in a traveling group but was sent to the United States as a child in the 90s. I recently asked what the deciding factor was when it came to her clan splitting up and was heartbroken by what came next. I only asked her because I am having such a hard time finding information on my own when it comes to the traveling groups. I would like to be better informed on the topic so if she wants to talk about her past I don’t have those types of possible painful questions to ask. If it helps at all we are in our early 30s so she was a child during the 90s. Anything I find online is in relation to the Catholics, Protestants, and larger ethnic groups. I understand traveler history is less documented but I’m hoping there is some resource I can find to become a better informed friend.</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/plk9yc/as_a_formerly_clueless_united_states_citizen_how/",
  "subreddit": "AskHistorians",
  "id": "plk9yc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A close friend grew up in a traveling group but was sent to the United States as\na child in the 90s. I recently asked what the deciding factor was when it came\nto her clan splitting up and was heartbroken by what came next. I only asked her\nbecause I am having such a hard time finding information on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "親しい友人は、旅のグループで育ちましたが、子供の頃にアメリカに送られたことがあります。\n90年代に子供としてアメリカに送られました。最近、彼女の一族が分裂することになったとき、何が決め手になったのか聞いてみました。\n私は最近、彼女の一族が分裂したときの決め手は何だったのかと尋ねたところ、その後の展開に心を痛めていました。私が彼女に尋ねたのは\n私が彼女に尋ねたのは、情報を見つけるのにとても苦労しているからです...",
      "title": "以前は何も知らなかった米国市民として、90年代に北アイルランドで起きた「トラブル」について、特にアイルランド人旅行者について、どうやって詳しく知ることができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一位亲密的朋友在一个旅行团中长大，但在90年代被送到美国。\n在90年代的时候被送到美国。我最近问他，当他想到要去美国时，决定性的因素是什么？\n她的宗族分裂时的决定性因素，并对接下来的事情感到心碎。我只是问她\n因为我很难找到关于她的信息。",
      "title": "作为一个曾经一无所知的美国公民，我如何才能更多了解90年代北爱尔兰的 \"麻烦\"，特别是关于爱尔兰旅客的情况？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一位親密的朋友在一個旅行團中長大，但在90年代被送到美國。\n在90年代的時候被送到美國。我最近問他，當他想到要去美國時，決定性的因素是什麼？\n她的宗族分裂時的決定性因素，並對接下來的事情感到心碎。我只是問她\n因爲我很難找到關於她的信息。",
      "title": "作爲一個曾經一無所知的美國公民，我如何才能更多瞭解90年代北愛爾蘭的 \"麻煩\"，特別是關於愛爾蘭旅客的情況？"
    }
  ]
}