{
  "author": "luciferlol_666",
  "original_created_utc": 1645630446,
  "title": "Crypto.com kinda sucks.",
  "created_utc": 1645681130,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There’s a lot of CDC fanboys on Reddit at the moment so this will get downvoted into obscurity and probably not seen by many, but I want to talk about my experience anyway. &lt;/p&gt;\n\n&lt;p&gt;I started using them about 20 days ago and have been buying around $20 usd of crypto per day to farm their loot boxes, plus around $1500 worth of CRO to hold. There are no fees for the first 30 days so I thought I’d just spread out some buys and see what I get in loot box rewards. So far….like $11 worth of CRO. &lt;/p&gt;\n\n&lt;p&gt;In this time I have had three instance where I needed to contact customer service. While it was easy to get in touch with customer service, not one has ever actually fixed the problem. &lt;/p&gt;\n\n&lt;p&gt;The first two problems were relatively minor. &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I didn’t get the loot box diamonds for a large order I made. I tried to use the support function, still never got them. Honestly, I don’t care that much. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;My NFT account and password won’t work. It constantly says my password is incorrect, even though it is 100% correct. I even reset the password, and it still won’t work. I contacted support and we just kept going in loops. It was almost like that scene from Idiocracy where they talk about plants and electrolytes. I wasn’t sure if I wanted to get into NFTs, but I did want to browse. I’ll just not get into NFTs now, no big deal. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The real issue….&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;I spent $500 yesterday for some crypto on the dip. The app glitches out, I get a “transaction cancelled” once the app starts working again, receive no cryto, but I was still charged $500. My banks has confirmed in their system and in Visa that the transaction was approved on their end and the money is at CDC. CDC support is non existent here. They say it isn’t in my transaction history however I sure as hell got charged for it.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;While talking to my bank the gentleman I was speaking with said the day before he had the exact same call come in about crypto.com charging people but not delivering the goods. &lt;/p&gt;\n\n&lt;p&gt;Cdc needs to get their shit together if they are looking for mass adoption to happen through them. I’m assuming I’ll get my $500 back in a few days, but even if I  do I missed an opportunity to buy at a target price because their system isn’t 100% functional. &lt;/p&gt;\n\n&lt;p&gt;Maybe they should have spent some of that Matt and Lebron money ensuring their systems work properly.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/szk86n/cryptocom_kinda_sucks/",
  "subreddit": "CryptoCurrency",
  "id": "szk86n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There’s a lot of CDC fanboys on Reddit at the moment so this will get downvoted\ninto obscurity and probably not seen by many, but I want to talk about my\nexperience anyway.\n\nI started using them about 20 days ago and have been buying around $20 usd of\ncrypto per day to farm their loot boxes, plus…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "RedditにはCDCファンボーイがたくさんいるので、この記事はdownvotedされるでしょう。\nを、おそらく多くの人が見ることはないでしょう。\nとにかく体験してください。\n\n私は20日ほど前に利用を開始し、20米ドルほどを購入しています。\n戦利品ボックスのファームアップのために1日あたり暗号を使用し、さらに...",
      "title": "Crypto.comはちょっと最悪です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前在Reddit上有很多CDC的粉丝，所以这篇文章会被降权到无声无息，可能很多人都看不到。\n变得默默无闻，可能没有多少人看到，但我还是想谈谈我的\n经验。\n\n我大约20天前开始使用他们，每天购买大约20美元的\n每天购买大约20美元的加密货币来耕种他们的战利品箱，加上...",
      "title": "Crypto.com有点糟糕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前在Reddit上有很多CDC的粉絲，所以這篇文章會被降權到無聲無息，可能很多人都看不到。\n變得默默無聞，可能沒有多少人看到，但我還是想談談我的\n經驗。\n\n我大約20天前開始使用他們，每天購買大約20美元的\n每天購買大約20美元的加密貨幣來耕種他們的戰利品箱，加上...",
      "title": "Crypto.com有點糟糕。"
    }
  ]
}