{
  "author": "FatBulkExpanse",
  "the_new_excerpt": "Considering the ETC and BCH pumps I thought this might be worthwhile to those\nnew to crypto.\n\nEthereum Classic (ETC) is not the same as the real Ethereum (ETH). They forked a\nlong time ago, which is why they share the name. But nothing is being done on\nETC. All those ERC-20 tokens live on ETH, not…",
  "original_created_utc": 1620316362,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ETCとBCHのポンプを考えると、これは暗号の初心者には価値があるかもしれないと思いました。\nこれは、暗号に慣れていない人にとって価値があると思います。\n\nイーサリアムクラシック（ETC）は、本物のイーサリアム（ETH）とは違います。彼らはフォークしました。\n長い間、名前を共有しているのはそのためです。しかし、何もしていない\nETCです。ERC-20トークンはすべてETH上で生きていますが、そうではありませ...",
      "title": "PSA：ビットコインとイーサリアムは1つしかありません。似たような名前のコインには注意してください。それらは同じものではありません。彼らは平等ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "考虑到ETC和BCH泵，我认为这可能值得那些\n新的加密货币。\n\n以太坊经典（ETC）与真正的以太坊（ETH）是不同的。他们很久以前就分叉了\n很久以前，这就是为什么他们共用一个名字。但在\nETC。所有那些ERC-20代币都生活在ETH上，而不是...",
      "title": "PSA：只有一个比特币和一个以太坊。小心那些名字相似的硬币。它们不是同一回事。他们是不平等的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "考慮到ETC和BCH泵，我認爲這可能值得那些\n新的加密貨幣。\n\n以太坊經典（ETC）與真正的以太坊（ETH）是不同的。他們很久以前就分叉了\n很久以前，這就是爲什麼他們共用一個名字。但在\nETC。所有那些ERC-20代幣都生活在ETH上，而不是...",
      "title": "PSA：只有一個比特幣和一個以太坊。小心那些名字相似的硬幣。它們不是同一回事。他們是不平等的。"
    }
  ],
  "title": "PSA: There is only one Bitcoin and one Ethereum. Beware of coins with similar names. They are not the same thing. They are not equal.",
  "created_utc": 1620329436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Considering the ETC and BCH pumps I thought this might be worthwhile to those new to crypto.</p>\n\n<p>Ethereum Classic (ETC) is not the same as the real Ethereum (ETH). They forked a long time ago, which is why they share the name. But nothing is being done on ETC. All those ERC-20 tokens live on ETH, not ETC. Don&#39;t be fooled.</p>\n\n<p>Same goes for Bitcoin. There is only one BTC. Bitcoin Cash (BCH), Bitcoin SV (BSV), etc are all forks of Bitcoin. Which means that they tried to make a change to BTC but failed, and ended up with a new coin.</p>\n\n<p>Just like ETH, the real Bitcoin network is the valuable one and that&#39;s why there is such a massive difference in price between BTC and the other Bitcoin forks.</p>\n\n<p>TLDR: Don&#39;t get fooled by similar names. There is only one BTC, and only one ETH.</p>\n\n<p>Good luck out there everyone!</p>\n</div><!-- SC_ON -->",
  "score": 1550,
  "permalink": "/r/CryptoCurrency/comments/n6ageo/psa_there_is_only_one_bitcoin_and_one_ethereum/",
  "subreddit": "CryptoCurrency",
  "id": "n6ageo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985988837
}