{
  "author": "yesboizindeed",
  "original_created_utc": 1638151876,
  "title": "I just made my first real life sale in Crypto Currency",
  "created_utc": 1638178251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My mother and I own a small clothing store in a touristic part of Mexico.   </p>\n\n<p>I opened the store this morning at around 10:30AM (UTC-6) and right away a young couple walked into the store and started trying on a few jackets, after a while he selected three of them (about 60USD each) and approached me  at the counter...  </p>\n\n<p>-Hey, so- I want to buy these jackets but I don&#39;t have cash on me or a card from any bank. Do you accept any other form of payment?</p>\n\n<p>-Sorry, what do you mean? (At the moment I was imagining some pretty weird things tbh)</p>\n\n<p>-Like Pay Pal, or Venmo? </p>\n\n<p>-Oh! right. Sorry, I don&#39;t have an account in either.  </p>\n\n<p><em>Pause...</em></p>\n\n<p>&#x200B;</p>\n\n<p>-I could probably take Crypto...</p>\n\n<p>-Yeah that be cool, would XRP be fine? (Fastest transaction speed of the currencies available in the most popular crypto exchanges in Mexico)</p>\n\n<p>&#x200B;</p>\n\n<p>I felt so exited! A real life transaction of physical goods for crypto currency! Just like the pizza guy! The transaction went fine and didn&#39;t take too long. Afterward  I put that shit into BTC and ETH and due to the recent spike I&#39;m already up like 6%!!! My mom said we should put a sign that says &quot;We accept Bitcoin&quot; lol. </p>\n\n<p>Do any of you have personal stories of transactions of the kind? I&#39;d love to hear them! </p>\n\n<p>&#x200B;</p>\n\n<p>(I hope this isn&#39;t a breach of Rule 5.2. If it is, I Apologize and feel free to delete)</p>\n</div><!-- SC_ON -->",
  "score": 217,
  "permalink": "/r/CryptoCurrency/comments/r4kr6t/i_just_made_my_first_real_life_sale_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r4kr6t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My mother and I own a small clothing store in a touristic part of Mexico.\n\nI opened the store this morning at around 10:30AM (UTC-6) and right away a young\ncouple walked into the store and started trying on a few jackets, after a while\nhe selected three of them (about 60USD each) and approached me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私と母は、メキシコの観光地で小さな衣料品店を経営しています。\n\n今朝、午前10時30分（UTC-6）頃に店を開けると、すぐに若いカップルが店に入ってきて、いくつかのジャケットを試着し始めました。\n若いカップルが店に入ってきて、いくつかのジャケットを試着し始め、しばらくしてから\n彼はその中から3着（1着約60ドル）を選び、私に近づいてきました・・・。",
      "title": "暗号通貨で初めてリアルに販売しました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我母亲和我在墨西哥的一个旅游区拥有一家小型服装店。\n\n今天上午10:30（UTC-6）左右，我开了这家店。\n一对年轻夫妇走进店里，开始试穿几件夹克，过了一会儿\n他选择了其中的三件（每件约60美元）并走到我面前......",
      "title": "我刚刚在加密货币中实现了我的第一笔现实销售"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我母親和我在墨西哥的一個旅遊區擁有一家小型服裝店。\n\n今天上午10:30（UTC-6）左右，我開了這家店。\n一對年輕夫婦走進店裏，開始試穿幾件夾克，過了一會兒\n他選擇了其中的三件（每件約60美元）並走到我面前......",
      "title": "我剛剛在加密貨幣中實現了我的第一筆現實銷售"
    }
  ]
}