{
  "author": "dgahbahwbwbwbwbw",
  "original_created_utc": 1660116619,
  "title": "My little brother watched Andrew Tate. Should I be concerned?",
  "created_utc": 1660136627,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My (21F) younger brother (16M) is a pretty typical teenage boy. He’s moody but in the way I think most teenagers are, and he’s overly anxious about school. I first learned he was watching Andrew Tate because my brother was showing me a quote from Andrew Tate about working hard and told me it motivates him when it comes to school.&lt;/p&gt;\n\n&lt;p&gt;I had no idea who Andrew Tate was and didn’t think much of it, but there’s been a lot of talk on the internet lately about Andrew Tate being a bad influence for young boys. I know my brother and his friends both watch Andrew Tate; there was another instance of my brother telling me about all the cars Tate owns, and he showed me a photo of Andrew Tate and asked if I thought he was attractive.&lt;/p&gt;\n\n&lt;p&gt;I brought up Andrew Tate to my brother and said I heard that he says some bad stuff about women and my brother kind of protested that criticism of him is exaggerated. I told him I was just worried and didn’t want him to absorb a bad message. My brother then admitted that Tate has some out there views, but said that Tate just says that’s stuff to generate controversy and get more views.&lt;/p&gt;\n\n&lt;p&gt;My brother continued that he doesn’t take that stuff seriously and just watches the videos for entertainment and likes Tate’s motivation content about working hard, success, not giving up, etc.&lt;/p&gt;\n\n&lt;p&gt;I left it at that and I feel like it probably isn’t an issue, but is there anything I should look out for? I’m not familiar with Tate’s content and what messages he is promoting specifically. My brother is a good kid but he is a teenager so it’s not like he’s talking to me about everything, so I don’t even know if I’d know if he was absorbing harmful views or what he talks about to his friends / how he behaves with girls.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/TooAfraidToAsk/comments/wkr4xr/my_little_brother_watched_andrew_tate_should_i_be/",
  "subreddit": "TooAfraidToAsk",
  "id": "wkr4xr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My (21F) younger brother (16M) is a pretty typical teenage boy. He’s moody but\nin the way I think most teenagers are, and he’s overly anxious about school. I\nfirst learned he was watching Andrew Tate because my brother was showing me a\nquote from Andrew Tate about working hard and told me it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（21F）の弟（16M）は、ごく普通の10代の男の子です。気分屋ですが\n学校に対して過剰な心配をしている。I\nを見せられたので、彼がAndrew Tateを見ていることを初めて知りました。\nAndrew Tateの「頑張る」という言葉を兄が見せてくれて、それを教えてくれたからです。",
      "title": "弟がアンドリュー・テイトを見ていた。心配すべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（21岁）的弟弟（16岁）是一个相当典型的十几岁的男孩。他很喜怒无常，但\n我认为大多数青少年都是这样，而且他对学校过于焦虑。I\n我第一次知道他在看安德鲁-塔特，是因为我哥哥给我看了安德鲁-塔特的一段话。\n安德鲁-塔特关于努力工作的一句话，并告诉我这是...",
      "title": "我的小兄弟看了安德鲁-塔特。我应该关注吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（21歲）的弟弟（16歲）是一個相當典型的十幾歲的男孩。他很喜怒無常，但\n我認爲大多數青少年都是這樣，而且他對學校過於焦慮。I\n我第一次知道他在看安德魯-塔特，是因爲我哥哥給我看了安德魯-塔特的一段話。\n安德魯-塔特關於努力工作的一句話，並告訴我這是...",
      "title": "我的小兄弟看了安德魯-塔特。我應該關注嗎？"
    }
  ]
}