{
  "author": "vemisfire",
  "original_created_utc": 1639927848,
  "title": "Why do some Americans proudly call themselves communists?",
  "created_utc": 1639933543,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Or generally, Westerners. I&amp;#39;ve only seen it online, but it makes me wonder. I come from a post communist Eastern European country and while I wasn&amp;#39;t born during the time, stories from my family are horrific about what a devastating regime it was. Why do people that come from non communist countries would ever want that? It just never sat right to me how some young people would embrace this regime when my grandfather was in prison, tortured, for daring to speak out against it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/rjz07u/why_do_some_americans_proudly_call_themselves/",
  "subreddit": "NoStupidQuestions",
  "id": "rjz07u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Or generally, Westerners. I've only seen it online, but it makes me wonder. I\ncome from a post communist Eastern European country and while I wasn't born\nduring the time, stories from my family are horrific about what a devastating\nregime it was. Why do people that come from non communist countries…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あるいは一般的に欧米人。ネットでしか見たことがないのですが、不思議な感じがします。I\n共産主義後の東欧の国から来たのですが、私は生まれてないのに\n私の家族からは、いかに悲惨な状況であったかが語られます。\n政権であった。なぜ非共産圏から来た人たちは...",
      "title": "なぜ一部のアメリカ人は誇らしげに自らをコミュニストと呼ぶのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "或者一般来说，西方人。我只在网上看到过，但这让我很好奇。I\n我来自一个后共产主义的东欧国家，虽然我不是在那个时代出生的\n我来自一个后共产主义时代的东欧国家，虽然我不是出生在那个时代，但我的家人讲述的故事是可怕的，说那是一个毁灭性的\n的政权。为什么来自非共产主义国家的人...",
      "title": "为什么有些美国人自豪地称自己为共产主义者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "或者一般來說，西方人。我只在網上看到過，但這讓我很好奇。I\n我來自一個後共產主義的東歐國家，雖然我不是在那個時代出生的\n我來自一個後共產主義時代的東歐國家，雖然我不是出生在那個時代，但我的家人講述的故事是可怕的，說那是一個毀滅性的\n的政權。爲什麼來自非共產主義國家的人...",
      "title": "爲什麼有些美國人自豪地稱自己爲共產主義者？"
    }
  ]
}