{
  "author": "Hard_Taco_Tuesday",
  "the_new_excerpt": "I visited Pompeii as a kid and one of the things that stuck with me the most\n(after the Priapus wall art\n[https://www.ancient.eu/uploads/images/11277.jpg?v=1599176702] and prostitution\nmenu and comment section graffiti [https://en.m.wikipedia.org/wiki/Lupanar]) was\nthe elevated sidewalks and giant…",
  "original_created_utc": 1613674352,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我小时候去过庞贝城，其中最让我难忘的是\n(仿照Priapus壁画)\n[https://www.ancient.eu/uploads/images/11277.jpg?v=1599176702]和卖淫问题\n菜单和评论部分的涂鸦[https://en.m.wikipedia.org/wiki/Lupanar]）是指\n高架人行道和巨大的... ...",
      "title": "2000年前，像庞贝这样的城市的污水和垃圾处理系统是怎样的？他们之所以有一尺高的人行道和高架的人行道石，是不是因为街道上深埋着大家的粪便？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我小時候去過龐貝城，其中最讓我難忘的是\n(仿照Priapus壁畫)\n[https://www.ancient.eu/uploads/images/11277.jpg?v=1599176702]和賣淫問題\n菜單和評論部分的塗鴉[https://en.m.wikipedia.org/wiki/Lupanar]）是指\n高架人行道和巨大的... ...",
      "title": "2000年前，像龐貝這樣的城市的污水和垃圾處理系統是怎樣的？他們之所以有一尺高的人行道和高架的人行道石，是不是因爲街道上深埋着大家的糞便？"
    }
  ],
  "title": "What was the sewage and waste removal system like 2000 years ago in cities like Pompeii? Is it true that the reason they had foot-high sidewalks and elevated crosswalk stones was because the streets ran deep with everyone’s shit?",
  "created_utc": 1613709563,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I visited Pompeii as a kid and one of the things that stuck with me the most (after the <a href=\"https://www.ancient.eu/uploads/images/11277.jpg?v=1599176702\">Priapus wall art</a> and <a href=\"https://en.m.wikipedia.org/wiki/Lupanar\">prostitution menu and comment section graffiti</a>) was the <a href=\"https://publicplacespastpresent.files.wordpress.com/2014/09/pompeii-crosswalk.jpg\">elevated sidewalks and giant stepping stones for pedestrians to cross the street</a>.  I think it was the tour guide that noted that this was designed so that citizens could cross the street without stepping into the river of liquid shit flowing through the streets.  Is that generally accurate? </p>\n\n<p>If “dumping the bucket in the street every morning” was the extent of urban waste removal 2000 years ago, was it common for cities to be designed around always having streets flowing downhill and preventing intersections at a low point that would turn into a shitpond?  Was part of the reason that men used to wear heels was to help keep their feet and clothes out of the shitrivers?   Would the property values in the city be determined by proximity to major shitcanal, with the worst parts of the city being the lowest?   Would there be a designated shitstreet where everyone collectively agreed to limit their waste removal to?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/lmu3cl/what_was_the_sewage_and_waste_removal_system_like/",
  "subreddit": "AskHistorians",
  "id": "lmu3cl",
  "is_self": true,
  "media": null,
  "is_video": false
}