{
  "author": "EFTurkeyHead",
  "the_new_excerpt": "EDIT: While I truly appreciate the Reddit awards, I hope that award and any\nwhich may follow came from free Reddit coins, and I would encourage anyone who\nwants to spend real money on an award for this post to instead either spend it\non yourself or give it to someone who needs it in a manner in…",
  "original_created_utc": 1616173466,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "EDIT：虽然我真的很感谢Reddit的奖项，但我希望这个奖项和任何的。\n随后可能来自免费的Reddit币，我鼓励任何人谁\n想花真金白银为这个职位颁奖，而不是花钱。\n或给需要它的人，以...",
      "title": "我昨天第一次投入500元入市。告诉我，我的仓位/逻辑有多垃圾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "EDIT：雖然我真的很感謝Reddit的獎項，但我希望這個獎項和任何的。\n隨後可能來自免費的Reddit幣，我鼓勵任何人誰\n想花真金白銀爲這個職位頒獎，而不是花錢。\n或給需要它的人，以...",
      "title": "我昨天第一次投入500元入市。告訴我，我的倉位/邏輯有多垃圾。"
    }
  ],
  "title": "I put $500 into the market for the first time yesterday. Tell me how garbage my positions/logic are.",
  "created_utc": 1616188998,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: While I truly appreciate the Reddit awards, I hope that award and any which may follow came from free Reddit coins, and I would encourage anyone who wants to spend real money on an award for this post to instead either spend it on yourself or give it to someone who needs it in a manner in which they would be able to use it.   </p>\n\n<p><strong>Thank you</strong> to all of you, today and in past days, who have given me advice on this subreddit. I truly feel as though I&#39;ve found a home in terms of where I need to go for advice/community information/input. You can&#39;t learn if you don&#39;t put yourself out there, and I&#39;ve done just that today, and the information I&#39;ve gained is invaluable. Thanks again.  </p>\n\n<p>EDIT2: Yes, I am aware now that I&#39;m too far spread out. We&#39;re fixing that.  </p>\n\n<hr/>\n\n<p>Hey y&#39;all. So I&#39;m basically brand new to investing - I&#39;ve dicked around on Robinhood before years ago, but never anything serious. I grew up in poverty and am only just finding my way out, so investment is still quite new but incredibly exciting to me.  </p>\n\n<p>Yesterday, I took $500 and put it into the market. Here&#39;s what I bought. I plan on holding all pretty much until it&#39;s either time to retire or until daddy&#39;s gotta make a purchase. My logic behind choosing tickers was as follows:  </p>\n\n<p>1) The index is too important to miss, and as I&#39;ve said elsewhere, a 14% annual return over a lifetime feels much better than jumping off a cliff. <strong>The indexes I chose are FTEC, QQQ, SCHA, SPY, VOO, VGT, and VUG.</strong>   </p>\n\n<p>2)Dividends are probably the most important aspect of a long term single stock hold IMO, closely followed by overall stability/growth projections. You don&#39;t need much inherent growth with dividend stocks, they just can&#39;t dip too far or else you&#39;re breaking even. Even if the stock itself stays even, you&#39;ll still compound your way ahead. <strong>The dividend paying stocks I chose are AMCR, HBAN, HPE, KEY, PEP, T, and TM.</strong> PEP and TM could arguably fall under other categories, but they both pay respectable dividends and are staple companies which will likely exist until the end of the current world, so they&#39;re on the list.    </p>\n\n<p>-And finally, I chose one stock that I consider to be a knock off version of a growth stock. It has the growth potential, but it also has the dividend to boot, and really I&#39;m looking at <strong>TROW</strong> and trying to find something wrong with the stock, but I can&#39;t. So TROW it is.  </p>\n\n<p>To preemptively answer some questions:  </p>\n\n<p>-I diversified within ETFs for two reasons; first, because it means more money overall within the indexes, and second because they&#39;ll all perform decently enough, but it&#39;s likely one or two might outperform the others, and I want in on those.  </p>\n\n<p>-I chose AMCR because it&#39;s been rock steady for as long as the Earth has been round, and the dividend is unreal. I chose T for similar reasons, although T also falls under &quot;buy what you use&quot; in my case.  </p>\n\n<p>-To me, HPE was the biggest &quot;risk&quot; in this portfolio, just because there&#39;s not a whole lot of evidence to suggest that it will grow drastically from its current status. However, again, HPE isn&#39;t going anywhere any time soon, it&#39;s recovering somewhat decently from the pandemic crash, and the dividend is still there. As long as I don&#39;t lose ~15% or more on price over the long term, I should still be in good shape.  </p>\n\n<p>So yeah. I sure feel like a monkey making and describing these decisions, but I wonder how bad or good these decisions actually are. Anyway, thank you for coming to my TED talk.  </p>\n\n<p>EDIT: In the brief time this has been up I&#39;ve learned quite a bit more, which is honestly typical <a href=\"/r/stocks\">/r/stocks</a> (thanks). What I&#39;m learning is that I need to pay a little closer attention to what exactly each ETF follows, and that I possibly over-diversified. Apparently I&#39;m still trading with technically unsettled funds, so once everything settles I&#39;ll look at making some corrective decisions. Thanks again.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/stocks/comments/m8lu7n/i_put_500_into_the_market_for_the_first_time/",
  "subreddit": "stocks",
  "id": "m8lu7n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821004
}