{
  "author": "ragstorichespodcast",
  "the_new_excerpt": "I've seen at least 2 post today on reddit of people claiming that they are gonna\npull their money out of the stock market due to consistent losses. Most of their\nholding are stocks that were once popular on reddit and more than likely they\nbought at the very top of the hype but that's not here nor…",
  "original_created_utc": 1618245876,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、redditで少なくとも2つの記事を見ましたが、一貫した損失のために株式市場から資金を引き上げると主張している人がいました。\n損失が続いているため、株式市場から資金を引き上げると主張している人をredditで今日少なくとも2つ見ました。彼らの保有株のほとんどは\n彼らが保有している株式のほとんどは、かつてredditで人気を博した銘柄であり、おそらく彼らは誇大広告の頂点で購入したのだと思います。\nしかし、それはここでもなく、また...",
      "title": "当面必要のないお金だけを投資しなさい」と言われるのには理由があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天在reddit上看到至少有2个帖子的人声称，他们要去\n由于持续的亏损，他们的资金从股市中撤出。他们的大部分\n持有的股票，曾经在reddit上流行，更有可能他们\n买在炒作的最高点，但这不是在这里也... ...",
      "title": "人们告诉你在可预见的未来只投资你不需要的钱，是有原因的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天在reddit上看到至少有2個帖子的人聲稱，他們要去\n由於持續的虧損，他們的資金從股市中撤出。他們的大部分\n持有的股票，曾經在reddit上流行，更有可能他們\n買在炒作的最高點，但這不是在這裏也... ...",
      "title": "人們告訴你在可預見的未來只投資你不需要的錢，是有原因的。"
    }
  ],
  "title": "There's a reason why people tell you to only invest money you don't need in the foreseeable future.",
  "created_utc": 1618253274,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen at least 2 post today on reddit of people claiming that they are gonna pull their money out of the stock market due to consistent losses. Most of their holding are stocks that were once popular on reddit and more than likely they bought at the very top of the hype but that&#39;s not here nor there. The fact is that if you invest money that you don&#39;t need any time soon you can just ride the wave of losses.</p>\n\n<p>I&#39;m personally living paycheck to paycheck and could definitely use the money I have invested but I keep trying to see that money as LOST already. Maybe not the greatest thing but I&#39;m definitely not dependent on it and don&#39;t plan on using it anytime soon. There&#39;s a certain Game ticker that has lost me a ton of money these last 2 weeks and I haven&#39;t bat an eye because I&#39;m not counting on that money. </p>\n\n<p>I know a lot of us have been and continue to be broke and when we hear people on reddit discussing a damn near certain winner you want to jump in and make some money. But the truth is most of the time it&#39;s either a Pump and Dump and more often than not these people are just wrong. </p>\n\n<p>So my advice to  you is if you can&#39;t afford to invest money and not touch it for at least a year whether it goes up or down then just don&#39;t invest that money. You&#39;ll most likely pull out too soon and just lose money.</p>\n</div><!-- SC_ON -->",
  "score": 3001,
  "permalink": "/r/stocks/comments/mphtpx/theres_a_reason_why_people_tell_you_to_only/",
  "subreddit": "stocks",
  "id": "mphtpx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618922
}