{
  "author": "doblitos",
  "original_created_utc": 1659828893,
  "title": "How did Khan Academy go so quickly from beloved to reviled?",
  "created_utc": 1659847552,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When my kids were very young, I heard nothing but good things about Khan Academy (primarily online). Now that my kids are in school and actually old enough to use it, everyone from students to parents hate it with the passion of a thousand suns including my children. I understand why they dislike it (constant repeating of himself in the videos and &amp;quot;all or nothing&amp;quot; tests in the app and repetitive, boring questions that test superficial abilities). I also see the generally negative reviews of the product online now.&lt;/p&gt;\n\n&lt;p&gt;However, why did anyone ever like it and why did that shift so rapidly?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/wi1f3z/how_did_khan_academy_go_so_quickly_from_beloved/",
  "subreddit": "NoStupidQuestions",
  "id": "wi1f3z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When my kids were very young, I heard nothing but good things about Khan Academy\n(primarily online). Now that my kids are in school and actually old enough to\nuse it, everyone from students to parents hate it with the passion of a thousand\nsuns including my children. I understand why they dislike…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "子供がまだ小さかった頃、カーンアカデミーの良い評判ばかりを聞いていました。\n(主にオンライン)。今、私の子供たちは学校に通い、実際に使える年齢になりました。\n今、子供たちが学校に通い、実際に使う年齢になると、生徒から親まで、誰もが千の太陽のような情熱でそれを嫌います。\n私の子供も含め、学生から親までが千の太陽のような情熱で嫌っています。なぜ嫌われるのか、よくわかります...。",
      "title": "カーン・アカデミーはなぜ、愛される存在から悪者にされる存在へと急転換したのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我的孩子还很小的时候，我只听说过可汗学院的好话。\n(主要是在线)。现在我的孩子已经上学了，而且实际上已经到了可以使用的年龄。\n现在我的孩子已经上学了，而且实际上已经到了可以使用它的年龄，从学生到家长都对它恨之入骨。\n包括我的孩子。我理解他们为什么不喜欢...",
      "title": "可汗学院是如何如此迅速地从受人喜爱变成被人唾弃的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我的孩子還很小的時候，我只聽說過可汗學院的好話。\n(主要是在線)。現在我的孩子已經上學了，而且實際上已經到了可以使用的年齡。\n現在我的孩子已經上學了，而且實際上已經到了可以使用它的年齡，從學生到家長都對它恨之入骨。\n包括我的孩子。我理解他們爲什麼不喜歡...",
      "title": "可汗學院是如何如此迅速地從受人喜愛變成被人唾棄的？"
    }
  ]
}