{
  "author": "dadasad2125",
  "the_new_excerpt": "I try to avoid things like that, completely blocking them out of my mind. To the\npoint it's selfish really, I could never help impoverished children or stray\nanimals or anything like that, because it's just super heart-breaking even\nthinking about stuff like that. Bums me out so hard it feels like…",
  "original_created_utc": 1612799212,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我尽量避免这样的事情发生，把它们完全屏蔽在脑海里。对...\n点是自私的，我不可能帮助贫困的孩子，也不可能帮助流浪的孩子。\n动物或类似的东西， 因为它只是超级心碎，即使是\n想到这样的东西。让我很失望，感觉就像... ...",
      "title": "作为一个男人，绝对经不起伤心事，这正常吗？比如受伤或饥饿的动物，可怜的孩子（一般来说，贫穷会让我心碎）。我的意思不是说像它只是让我伤心或哭泣，我的意思是，我必须主动从我的脑海中屏蔽这样的主题，并避免他们，因为它伤害。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我儘量避免這樣的事情發生，把它們完全屏蔽在腦海裏。對...\n點是自私的，我不可能幫助貧困的孩子，也不可能幫助流浪的孩子。\n動物或類似的東西， 因爲它只是超級心碎，即使是\n想到這樣的東西。讓我很失望，感覺就像... ...",
      "title": "作爲一個男人，絕對經不起傷心事，這正常嗎？比如受傷或飢餓的動物，可憐的孩子（一般來說，貧窮會讓我心碎）。我的意思不是說像它只是讓我傷心或哭泣，我的意思是，我必須主動從我的腦海中屏蔽這樣的主題，並避免他們，因爲它傷害。"
    }
  ],
  "title": "Is it normal as a guy to be absolutely unable to withstand sad things? Like hurt or hungry animals, poor children (poverty in general wrecks my heart). I don't mean like it just makes me sad or cry, I mean I have to actively block such subjects from my mind and avoid them cause it hurts.",
  "created_utc": 1612809761,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I try to avoid things like that, completely blocking them out of my mind. To the point it&#39;s selfish really, I could never help impoverished children or stray animals or anything like that, because it&#39;s just super heart-breaking even thinking about stuff like that. Bums me out so hard it feels like I&#39;m emotionally unbalanced or something.</p>\n\n<p>Can&#39;t even watch sad movies, god forbid it has anything to do with an animal being sad or a kid only having 1 simple toy he really cherishes or something.</p>\n\n<p><strong>Edit</strong>: Just wanted to clarify/add something. Multiple people were talking about desensitization and watching brutal stuff. I&#39;m actually desensitized to that stuff as well. For example, I even watched stuff on what used to be <a href=\"/r/watchpeopledie\">r/watchpeopledie</a>. They&#39;re disgusting, appalling things of course, but I don&#39;t as much as blink as that stuff tbh. But show me a hungry puppy or a poor child who only has a single, simple toy that he cherishes, and I&#39;m broken. Gotta block it out of my mind asap or I&#39;ll be super sad.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/NoStupidQuestions/comments/lfejt2/is_it_normal_as_a_guy_to_be_absolutely_unable_to/",
  "subreddit": "NoStupidQuestions",
  "id": "lfejt2",
  "is_self": true,
  "media": null,
  "is_video": false
}