{
  "author": "RusticBohemian",
  "original_created_utc": 1634221841,
  "title": "Richard Nixon seems smarmy due to Watergate. But he also made \"courageous\" decisions that would have caused a lot of backlash among his supporters, in international relations, civil rights, and the environment. Were these decisions as courageous as they seem in hindsight?",
  "created_utc": 1634234335,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here are a handful of things Nixon pursued that strike me as likely to cause a backlash among his supporters:</p>\n\n<ul>\n<li>Proposed the Family Assistance Plan,  guaranteeing an income to American families.</li>\n<li>Established the Environmental Protection Agency. </li>\n<li>Administered the desegregation of Southern schools. </li>\n<li>Signed the Strategic Arms Limitation Treaty (SALT), the first comprehensive and detailed nuclear weapons limitation pact between the two superpowers. </li>\n<li>Opened diplomatic relations with China after 20 years of animosity.<br/></li>\n<li>Beginning the process of winding down the Vietnam War</li>\n<li>Set aside a percentage of federal construction jobs for minorities. </li>\n<li>Proposed legislation that creating the Occupational Safety and Health Administration (OSHA) </li>\n</ul>\n\n<p>I realize that some of these issues were not as polarized as they are today, but it seems like every one must have been unpopular among a considerable portion of voters and politicians. They strike me as fairly courageous moves. In reality, did they cause a large amount of backlash?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/q80wnq/richard_nixon_seems_smarmy_due_to_watergate_but/",
  "subreddit": "AskHistorians",
  "id": "q80wnq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here are a handful of things Nixon pursued that strike me as likely to cause a\nbacklash among his supporters:\n\n * Proposed the Family Assistance Plan, guaranteeing an income to American\n   families.\n * Established the Environmental Protection Agency.\n * Administered the desegregation of Southern…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニクソンが追求したものの中で、反感を買いそうなものをいくつか紹介します。\n支持者の反発を招きそうなものを挙げてみましょう。\n\n * アメリカの家庭に収入を保証する「ファミリー・アシスタンス・プラン」を提案した。\n   アメリカの家庭に収入を保証する「ファミリー・アシスタンス・プラン」を提案。\n * 環境保護庁の設立。\n * 環境保護庁の設立。",
      "title": "リチャード・ニクソンは、ウォーターゲート事件の影響で、スマートな印象を受けます。しかし、彼は国際関係、公民権、環境などの分野で、支持者の反発を招くような「勇気ある」決断もしました。これらの決断は、後から見ると勇気あるものだったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下是尼克松追求的几件事情，我认为可能会引起\n在他的支持者中引起反响。\n\n * 提出家庭援助计划，保证美国家庭的收入。\n   家庭援助计划，保证美国家庭的收入。\n * 建立环境保护局。\n * 管理南部地区的废除种族隔离工作。",
      "title": "由于水门事件，理查德-尼克松显得很狡猾。但他也做出了 \"勇敢 \"的决定，在国际关系、民权和环境方面，这些决定会在他的支持者中引起很大的反响。这些决定是否像事后看来那样有勇气？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是尼克松追求的幾件事情，我認爲可能會引起\n在他的支持者中引起反響。\n\n * 提出家庭援助計劃，保證美國家庭的收入。\n   家庭援助計劃，保證美國家庭的收入。\n * 建立環境保護局。\n * 管理南部地區的廢除種族隔離工作。",
      "title": "由於水門事件，理查德-尼克松顯得很狡猾。但他也做出了 \"勇敢 \"的決定，在國際關係、民權和環境方面，這些決定會在他的支持者中引起很大的反響。這些決定是否像事後看來那樣有勇氣？"
    }
  ]
}