{
  "author": "DMotorBoater",
  "the_new_excerpt": "We only saw 148k shares returned to Iborrowdesk desk by close today with a total\nof 150k now available to borrow with a 116.7% fee and nearly 6 million still\nmissing. In violation of the short sale restriction someone continued to short\ninto the bid going into AH. At first I thought this may be a…",
  "original_created_utc": 1623273845,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日の終値で148k株がアイボローデスクに戻ってきました。\n合計15万株が116.7%の手数料で借りられるようになりましたが、600万株近くがまだ不足しています。\nまだ約600万株が不足しています。空売り規制に違反して、誰かが空売りを続けていました。\n空売り制限に違反して、誰かがAHに入るビッドに空売りを続けました。最初は、これはもしかしたら...と思いました。",
      "title": "CLOVの一日の終わりに、空売り行為と空売り制限違反についてまとめたものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "到今天收盘时，我们只看到14.8万股回到了Iborrowdesk的办公桌上，总共有\n现在共有15万股可供借贷，费用为116.7%，还有近600万股仍未归还。\n丢失。违反了卖空限制，有人继续做空。\n进入AH的竞价中。起初我认为这可能是一个...",
      "title": "CLOV日终总结的空头交易行动和违反卖空限制的情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "到今天收盤時，我們只看到14.8萬股回到了Iborrowdesk的辦公桌上，總共有\n現在共有15萬股可供借貸，費用爲116.7%，還有近600萬股仍未歸還。\n丟失。違反了賣空限制，有人繼續做空。\n進入AH的競價中。起初我認爲這可能是一個...",
      "title": "CLOV日終總結的空頭交易行動和違反賣空限制的情況。"
    }
  ],
  "title": "CLOV end of day summary for short trading action and short sale restriction violations.",
  "created_utc": 1623313255,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We only saw 148k shares returned to Iborrowdesk desk by close today with a total of 150k now available to borrow with a 116.7% fee and nearly 6 million still missing. In violation of the short sale restriction someone continued to short into the bid going into AH. At first I thought this may be a MM, but L2 data and borrow/return times suggest that is was indeed most likely a short HF.</p>\n\n<p>What happened today was literally criminal, but I wouldn&#39;t hold your breath on the responsible party being held accountable. They are clearly either banking on getting away with it because reporting this is such a pain in the ass, OR decided that whatever fines they would need to pay was worth it. </p>\n\n<p>It has been a frustrating day, but it appears very little covering was actually done today. With borrow fees over 116%, I wouldn&#39;t be surprised to see more violations tomorrow. They are getting incredibly desperate. That said they need to cover at some point with short borrowing fees so incredibly high, and when one large short holder finally decides it&#39;s time to cover and starts driving the price up the others will rush in to do the same so they are not stuck without shares to return and fees this high. It&#39;s really a game of chicken with shorts buying and selling the same shares back and forth until they meet a real resistance floor (this is why volume is so high, but number if returned shares so low), or one of them chickens out and starts covering enough volume to start real upward momentum. </p>\n\n<p>Tomorrow could be pretty explosive. Good luck!**</p>\n</div><!-- SC_ON -->",
  "score": 1146,
  "permalink": "/r/wallstreetbets/comments/nw6rbc/clov_end_of_day_summary_for_short_trading_action/",
  "subreddit": "wallstreetbets",
  "id": "nw6rbc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404895343
}