{
  "author": "throwaway29283733838",
  "original_created_utc": 1650936328,
  "title": "Is my fiancé wrong for not letting me have guy friends?",
  "created_utc": 1650944438,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I have a guy best friend who lives in another state (I’ve known him since childhood) and he’s coming here to visit family. He also asked if me and him could hang out since we haven’t seen each other for many years. My fiancé isn’t happy about me hanging out with another guy and he is literally not letting me go. He says if I go, this relationship is over. He doesn’t trust me and thinks I will sleep with him or something. I never cheated on him and never will&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/uc0xwx/is_my_fiancé_wrong_for_not_letting_me_have_guy/",
  "subreddit": "NoStupidQuestions",
  "id": "uc0xwx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I have a guy best friend who lives in another state (I’ve known him since\nchildhood) and he’s coming here to visit family. He also asked if me and him\ncould hang out since we haven’t seen each other for many years. My fiancé isn’t\nhappy about me hanging out with another guy and he is literally…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それで、私には別の州に住んでいる男の親友がいるのですが（彼とはその頃から知り合いです\nを訪ねてくるんです。また、彼は私と彼が何年も会っていないので、一緒に遊ばないかと言ってきました。\nもう何年も会っていないので、一緒に遊ばないかと言われました。私のフィアンセは\n私が他の男と付き合っていることを快く思っておらず、彼は文字通り...",
      "title": "男友達を作らせてくれないフィアンセは間違っている？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我有一个住在另一个州的最好的朋友（我认识他，因为他是我的朋友）。\n我从小就认识他），他要来这里探亲。他还问我和他是否\n可以一起出去玩，因为我们已经很多年没有见面了。我的未婚夫不喜欢\n我的未婚夫对我和另一个人出去玩不高兴，他简直是......",
      "title": "我的未婚夫不让我有男性朋友，是错的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我有一個住在另一個州的最好的朋友（我認識他，因爲他是我的朋友）。\n我從小就認識他），他要來這裏探親。他還問我和他是否\n可以一起出去玩，因爲我們已經很多年沒有見面了。我的未婚夫不喜歡\n我的未婚夫對我和另一個人出去玩不高興，他簡直是......",
      "title": "我的未婚夫不讓我有男性朋友，是錯的嗎？"
    }
  ]
}