{
  "author": "Nutshell1994",
  "original_created_utc": 1642470517,
  "title": "Taxes",
  "created_utc": 1642481349,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Taxes suck, we all know that. &lt;/p&gt;\n\n&lt;p&gt;Here is my pro tip for all of you. I made lots of trades, lots. Not only did I do that, I used mutiple exchanges and even more wallets. So my transaction count is quite high. &lt;/p&gt;\n\n&lt;p&gt;Here is the real bear though. When you sit here and import everything into your coin tracker of choice (Koinly here), everything may not be there. I spent the last two days trying different platforms and importing API’s. Nothing seemed to work. &lt;/p&gt;\n\n&lt;p&gt;Thankfully, I keep records of everything and was able link everything up manually over about six hours. Needless to say, dont be me. Being more of a minimalist when it comes to exchanges and wallets is by far the way to go. &lt;/p&gt;\n\n&lt;p&gt;Lastly, Fuck Uncle Sam and capital gains…&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 492,
  "permalink": "/r/CryptoCurrency/comments/s6la2c/taxes/",
  "subreddit": "CryptoCurrency",
  "id": "s6la2c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Taxes suck, we all know that.\n\nHere is my pro tip for all of you. I made lots of trades, lots. Not only did I\ndo that, I used mutiple exchanges and even more wallets. So my transaction count\nis quite high.\n\nHere is the real bear though. When you sit here and import everything into your\ncoin tracker…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "税金は最悪だ、それはみんな知っている。\n\nここで、皆さんへのプロからのアドバイスです。私はたくさんのトレードをしました。それだけでなく\n複数の取引所と、さらに多くのウォレットを使用しました。そのため、私の取引回数は\nはかなり高い。\n\nしかし、ここからが本当のクマです。ここに座って、すべてを自分のものにインポートすると\nコイントラッカー...",
      "title": "税金"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "税收很糟糕，我们都知道。\n\n这是我给你们所有人的专业建议。我做了很多交易，很多。我不仅做了\n我还使用了多个交易所，甚至更多的钱包。所以我的交易数量\n是相当高的。\n\n但真正的问题在这里。当你坐在这里，把所有东西都导入你的\n钱币追踪器...",
      "title": "税收"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "稅收很糟糕，我們都知道。\n\n這是我給你們所有人的專業建議。我做了很多交易，很多。我不僅做了\n我還使用了多個交易所，甚至更多的錢包。所以我的交易數量\n是相當高的。\n\n但真正的問題在這裏。當你坐在這裏，把所有東西都導入你的\n錢幣追蹤器...",
      "title": "稅收"
    }
  ]
}