{
  "author": "Ghostfxce",
  "original_created_utc": 1637320221,
  "title": "Stop blaming this sub for your poor investment decisions",
  "created_utc": 1637350407,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every day people are complaining here about how this sub &quot;advised&quot; them not to buy this or that coin before it blew up. Last month it was SHIBA, now it&#39;s CRO, and next week it will be something else.</p>\n\n<p>Taking advice from this sub is a bad idea for 2 reasons:</p>\n\n<ul>\n<li>Most people on here have no idea what they are talking about.</li>\n<li>Most people on here only start talking about a coin after it pumped already.</li>\n</ul>\n\n<p>There&#39;s a reason sensible people always tell you to &quot;Do Your Own Research&quot;: because you should. At best, you can use this sub to get a feel for the general sentiment around a project, but the most shilled coin on here can tank 80% the next day, and a coin everybody laughs off can go +1000% the next week. Crypto is always a gamble.</p>\n\n<p>So don&#39;t take what people say here as investment advice and then complain when it doesn&#39;t work out for you. Every investment you make is 100% your responsibility, and you shouldn&#39;t invest in something if you are completely confident about the risks-rewards involved.</p>\n\n<p>Good Luck</p>\n\n<p>&#x200B;</p>\n\n<p><strong>tl;dr - You are 100% responsible for your investments. Do your own research instead of blindly trusting strangers&#39; advice.</strong></p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/qxe0cm/stop_blaming_this_sub_for_your_poor_investment/",
  "subreddit": "CryptoCurrency",
  "id": "qxe0cm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every day people are complaining here about how this sub \"advised\" them not to\nbuy this or that coin before it blew up. Last month it was SHIBA, now it's CRO,\nand next week it will be something else.\n\nTaking advice from this sub is a bad idea for 2 reasons:\n\n * Most people on here have no idea what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のように、このサブが「爆発する前にこのコインを買わないようにアドバイスした」と文句を言っている人がいます。\n毎日のように、このサブサイトが、爆発する前にこのコインやこのコインを買わないようにアドバイスしたと文句を言っています。先月はSHIBAで、今はCROです。\nそして来週は何か他のものになるでしょう。\n\nこのサブサイトからアドバイスを受けるのは、2つの理由から良くないと思います。\n\n * ここにいるほとんどの人は何も知らない。",
      "title": "自分の投資判断の誤りをこのサブ機のせいにするのはやめよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每天都有人在这里抱怨，说这个分队如何 \"建议 \"他们不要在爆炸前买这个或那个硬币。\n在它爆炸之前购买这个或那个硬币。上个月是SHIBA，现在是CRO。\n而下周又会是别的什么。\n\n听从这个子的建议是个坏主意，有两个原因。\n\n * 这里的大多数人都不知道什么是...",
      "title": "不要再为你糟糕的投资决定而责怪这个子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每天都有人在這裏抱怨，說這個分隊如何 \"建議 \"他們不要在爆炸前買這個或那個硬幣。\n在它爆炸之前購買這個或那個硬幣。上個月是SHIBA，現在是CRO。\n而下週又會是別的什麼。\n\n聽從這個子的建議是個壞主意，有兩個原因。\n\n * 這裏的大多數人都不知道什麼是...",
      "title": "不要再爲你糟糕的投資決定而責怪這個子。"
    }
  ]
}