{
  "author": "002timmy",
  "original_created_utc": 1642733536,
  "title": "Fill your bags now! Last chance to get BTC over $40k!",
  "created_utc": 1642747144,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Alright guys, the time has come and the true crash is about to happen! With Bitcoin right at the $40k mark, this will be the last time in the foreseeable future you’ll be able to buy it this high a price. It’s time to go all-in and prove that you truly have diamond hands. &lt;/p&gt;\n\n&lt;p&gt;So what is my strategy-&lt;/p&gt;\n\n&lt;p&gt;1- early withdraw my 401k and invest it in BTC&lt;/p&gt;\n\n&lt;p&gt;2- get as many personal loans as I can and use those to buy ETH above $3k&lt;/p&gt;\n\n&lt;p&gt;3- go to the bank and get a reverse mortgage on my home &lt;/p&gt;\n\n&lt;p&gt;With these 3 simple steps, I can set myself up to show that I have diamond hands and believe in crypto. It will lead to wife-changing money, as she will divorce me and I can focus purely on crypto. &lt;/p&gt;\n\n&lt;p&gt;I am also going to pressure my family and friends to invest blindly into crypto. If they can survive the next 3 years if a crypto winter, they will earn my respect. &lt;/p&gt;\n\n&lt;p&gt;Buy high, sell low. Not financial advice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 376,
  "permalink": "/r/CryptoCurrency/comments/s905gr/fill_your_bags_now_last_chance_to_get_btc_over_40k/",
  "subreddit": "CryptoCurrency",
  "id": "s905gr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Alright guys, the time has come and the true crash is about to happen! With\nBitcoin right at the $40k mark, this will be the last time in the foreseeable\nfuture you’ll be able to buy it this high a price. It’s time to go all-in and\nprove that you truly have diamond hands.\n\nSo what is my strategy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さあ、みんな、時が来た！真の暴落が始まるぞ。というのも\nビットコインは4万ドルの大台に乗り、今回が当面の最後の機会となります。\nこれだけ高い値段で買えるのは、将来的には 今こそオールインする時であり\n本当にダイヤモンドの手を持っていることを証明する。\n\nでは、私の戦略はというと...",
      "title": "今すぐバッグに詰めよう BTCが$40kを超える最後のチャンス!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好了，伙计们，时间已经到了，真正的崩溃即将发生! 随着\n比特币正处于4万美元的关口，这将是在可预见的未来，你最后一次\n这将是在可预见的未来，你能以这么高的价格购买它。现在是时候全身心投入并\n证明你真正拥有钻石之手。\n\n那么，我的策略是什么呢...",
      "title": "现在就把你的袋子装满! 让BTC超过4万美元的最后机会!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，夥計們，時間已經到了，真正的崩潰即將發生! 隨着\n比特幣正處於4萬美元的關口，這將是在可預見的未來，你最後一次\n這將是在可預見的未來，你能以這麼高的價格購買它。現在是時候全身心投入並\n證明你真正擁有鑽石之手。\n\n那麼，我的策略是什麼呢...",
      "title": "現在就把你的袋子裝滿! 讓BTC超過4萬美元的最後機會!"
    }
  ]
}