{
  "author": "Erron89",
  "original_created_utc": 1638216801,
  "title": "Crypto is bettering my life and I haven't taken a single gain I've made.",
  "created_utc": 1638225674,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a crypto newb but I&#39;m amazed by the potential even stable coins have, I&#39;m also a new father and really want a better future for my son. That said I used to drink alot and eat alot of takeaways etc, always semi skint and feeling like I&#39;ll never get anywhere financially.\nI now quietly siphon that spare booze money that ive been wasting for over 10 years (better learnt late then never!) Into a crypto wallet.... My mental health is improving , I&#39;ve lost abit of weight. I feel much more positive about the future. This is my first post I&#39;ve been lurking but thanks for the info and the community.</p>\n</div><!-- SC_ON -->",
  "score": 323,
  "permalink": "/r/CryptoCurrency/comments/r54hs8/crypto_is_bettering_my_life_and_i_havent_taken_a/",
  "subreddit": "CryptoCurrency",
  "id": "r54hs8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a crypto newb but I'm amazed by the potential even stable coins have, I'm\nalso a new father and really want a better future for my son. That said I used\nto drink alot and eat alot of takeaways etc, always semi skint and feeling like\nI'll never get anywhere financially. I now quietly siphon that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号の初心者ですが、安定したコインにも可能性があることに驚いています。\nまた、私は父親になったばかりで、息子のためにより良い未来を望んでいます。とはいえ、私は以前\n私は新米の父親でもあり、息子のより良い未来を望んでいます。\n経済的にどこにも行けないと感じていました。私は今、静かにそのお金を吸い上げています...",
      "title": "暗号は私の人生を豊かにしてくれますし、得た利益は一つも取りこぼしていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名加密货币新手，但我对即使是稳定的硬币所具有的潜力感到惊讶。\n我也是一个新爸爸，真的希望我的儿子有一个更好的未来。这就是说，我曾经\n经常喝酒，吃很多外卖等，总是半斤八两，感觉\n我在经济上永远不会有任何进展。我现在悄悄地把这些钱抽走。",
      "title": "Crypto正在改善我的生活，我还没有拿走我的任何一笔收益。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名加密貨幣新手，但我對即使是穩定的硬幣所具有的潛力感到驚訝。\n我也是一個新爸爸，真的希望我的兒子有一個更好的未來。這就是說，我曾經\n經常喝酒，喫很多外賣等，總是半斤八兩，感覺\n我在經濟上永遠不會有任何進展。我現在悄悄地把這些錢抽走。",
      "title": "Crypto正在改善我的生活，我還沒有拿走我的任何一筆收益。"
    }
  ]
}