{
  "author": "vonhovan",
  "original_created_utc": 1630355892,
  "title": "Charles Hoskinson showing next level: a video made to answer on latest Coin Bureau video news",
  "created_utc": 1630377454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Must say that this guys is a next level. Love him or hate him he is updating videos regularly even though he is a fucking billionaire. He showed us that he even watches Guy&#39;s Crypto Bureau, which is the best guy on youtube for crypto info imo.</p>\n\n<p>Latest video he made, 2 hours ago or so, is just a minor reflect on Coin Bureau&#39;s last news video from today.</p>\n\n<p>Guy says that he is a bit concerned ablut Cardano&#39;s compliance, but he actually had misunderstood a bit. Charles explaining what is really happening.</p>\n\n<p>What&#39;s the other billionaire crypto person that updates educational videos almost daily? He is in with all of us.</p>\n\n<p>Respect well deserved.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/peqmt4/charles_hoskinson_showing_next_level_a_video_made/",
  "subreddit": "CryptoCurrency",
  "id": "peqmt4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Must say that this guys is a next level. Love him or hate him he is updating\nvideos regularly even though he is a fucking billionaire. He showed us that he\neven watches Guy's Crypto Bureau, which is the best guy on youtube for crypto\ninfo imo.\n\nLatest video he made, 2 hours ago or so, is just a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この人は次のレベルだと言わざるを得ません。彼を好きでも嫌いでも、彼は更新している\nビデオを定期的に更新していますが、彼は億万長者であるにもかかわらず 彼が見せてくれたのは\nGuy's Crypto Bureauを見ていることも示してくれました。\n情報ではyoutubeで一番の人ですね。\n\n2時間ほど前に彼が作った最新のビデオは、ただの...",
      "title": "チャールズ・ホスキンスン、次のレベルを見せる：コインビューローの最新ビデオニュースに答えるために作られたビデオ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "必须说，这家伙是一个新的水平。爱他或恨他，他都会定期更新\n视频，尽管他是一个他妈的亿万富翁。他向我们表明，他\n甚至观看Guy's Crypto Bureau，这是Youtube上最好的加密货币信息的人。\n信息的最佳人选。\n\n他的最新视频，2小时前左右，只是一个...",
      "title": "查尔斯-霍斯金森展示下一个水平：为回答最新硬币局视频新闻而制作的视频"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "必須說，這傢伙是一個新的水平。愛他或恨他，他都會定期更新\n視頻，儘管他是一個他媽的億萬富翁。他向我們表明，他\n甚至觀看Guy's Crypto Bureau，這是Youtube上最好的加密貨幣信息的人。\n信息的最佳人選。\n\n他的最新視頻，2小時前左右，只是一個...",
      "title": "查爾斯-霍斯金森展示下一個水平：爲回答最新硬幣局視頻新聞而製作的視頻"
    }
  ]
}