{
  "author": "ImGoneZero",
  "original_created_utc": 1627265449,
  "title": "Some of you guys are getting too excited right now.",
  "created_utc": 1627299026,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously, go take a nap or go to sleep. Get some fresh air and touch some grass. This shit could turn around any second and drop back down to the way its been for the last few months. On the other hand it could also continue going up, nobody knows.</p>\n\n<p>Just make sure you take care of yourself before you get too into watching those graphs again.</p>\n\n<p>edit: Im not saying you guys cant get excited, just dont get over hyped about something that can easily die down as fast as it went up</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/orp9oe/some_of_you_guys_are_getting_too_excited_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "orp9oe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously, go take a nap or go to sleep. Get some fresh air and touch some\ngrass. This shit could turn around any second and drop back down to the way its\nbeen for the last few months. On the other hand it could also continue going up,\nnobody knows.\n\nJust make sure you take care of yourself before…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マジで昼寝するか寝るかしてこいよ。新鮮な空気を吸って、草に触れて\n草に触れてみてください。このクソゲーはいつ逆転するかわからないし、今までのやり方に戻るかもしれない。\nこの数ヶ月間のように下がるかもしれない。その一方で、上昇し続ける可能性もある。\n誰にもわかりません。\n\nただ、その前に自分の体調管理には気をつけてくださいね...。",
      "title": "今、興奮しすぎている人がいますね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，去打个盹或去睡觉吧。呼吸一下新鲜空气，触摸一些\n草。这事随时都可能发生转折，然后跌回过去几个月的状态。\n过去几个月的情况。另一方面，它也可能继续上升。\n没有人知道。\n\n只是要确保你在这之前照顾好自己...",
      "title": "你们中的一些人现在变得太兴奋了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，去打個盹或去睡覺吧。呼吸一下新鮮空氣，觸摸一些\n草。這事隨時都可能發生轉折，然後跌回過去幾個月的狀態。\n過去幾個月的情況。另一方面，它也可能繼續上升。\n沒有人知道。\n\n只是要確保你在這之前照顧好自己...",
      "title": "你們中的一些人現在變得太興奮了。"
    }
  ]
}