{
  "author": "CarrotTamales",
  "original_created_utc": 1626560763,
  "title": "How do I cope with the fact that I eventually have to work for the rest of my life?",
  "created_utc": 1626576106,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m 19 graduated high school during the pandemic and such. I worked at Wendy’s from March of 2020 to July of 2020 and absolutely hated it. I ended up working at a country club with some friends until the seasonal position was over. I had a blast those few months then didn’t work till it reopened again. (this was all part time) I’ve been trying to figure out what to do with the rest of my life and I realize that I eventually have to be like most adults and go to school and eventually get a job/career.\nI can barely emotionally handle a part time job how do I accept that I will eventually work full time and just be an adult in general. I don’t know if I’m getting my thoughts across well enough so apologize for any confusion. :p</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/TooAfraidToAsk/comments/ome527/how_do_i_cope_with_the_fact_that_i_eventually/",
  "subreddit": "TooAfraidToAsk",
  "id": "ome527",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m 19 graduated high school during the pandemic and such. I worked at Wendy’s\nfrom March of 2020 to July of 2020 and absolutely hated it. I ended up working\nat a country club with some friends until the seasonal position was over. I had\na blast those few months then didn’t work till it reopened…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は19歳で、パンデミックの時に高校を卒業したりしています。ウェンディーズで働きました\n2020年3月から2020年7月まで働きましたが、絶対に嫌でした。結局、私は\n季節限定の仕事が終わるまで、友人たちとカントリークラブで働きました。その数ヶ月はとても楽しかったです。\nその数ヶ月間はとても楽しかったのですが、その後、再開するまで働けませんでした...。",
      "title": "最終的には一生働かなければならないという事実にどう対処したらいいのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我19岁，在大流行病之类的时候高中毕业。我在温迪公司工作\n从2020年3月到2020年7月，绝对讨厌它。我最后在\n在一个乡村俱乐部和一些朋友一起工作，直到季节性职位结束。我有\n那几个月很开心，然后没有工作，直到它重新开张......",
      "title": "我如何应对我最终要为我的余生工作的事实？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我19歲，在大流行病之類的時候高中畢業。我在溫迪公司工作\n從2020年3月到2020年7月，絕對討厭它。我最後在\n在一個鄉村俱樂部和一些朋友一起工作，直到季節性職位結束。我有\n那幾個月很開心，然後沒有工作，直到它重新開張......",
      "title": "我如何應對我最終要爲我的餘生工作的事實？"
    }
  ]
}