{
  "author": "BtcAnonymouse",
  "original_created_utc": 1632816501,
  "title": "I've never lost money because my goal is accumulating sats, not dollars.",
  "created_utc": 1632850637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the biggest mistakes newbies make is pricing everything in dollars. Dollar is a shitcoin. The Fed can outpace your profits by printing another trillion at any time.</p>\n\n<p>When I first got into bitcoin, I made the same mistakes. Oftentimes, I was gaining dollars but losing sats without even realising it.</p>\n\n<p>I stopped actively trading few years ago and I&#39;ve never lost money since. My strategy since 2018 has been making monthly recurring purchases. I have auto DCA set up. There are apps that allow you to auto DCA as little as even $10.</p>\n\n<p>With my auto DCA strategy, I don&#39;t worry about whether the price is going up or down. I rarely look at the charts. Every month, my BTC stack is growing regardless of the dollar price.</p>\n\n<p>Bitcoin is the hardest and most valuable money in the world. Everything else is a short term distraction. Your goal should be to accumulate as much of the 21 million BTC as you can. You&#39;re in a race against 8 billion people.</p>\n\n<p>Stop looking at the price every day. Stop overtrading. It&#39;s stressful and very rarely ends well. So many day traders and leverage traders have made millions and ended up losing everything on one bad trade. Stop listening to social media influencers and celebrities. They&#39;re full of shit. They prey on your ignorance to line their own pockets.</p>\n\n<p>Keep it simple and stress free. Switch to low time preference. Start working towards a simple accumulation strategy with the goal of having more sats than you did last month.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/px1lz4/ive_never_lost_money_because_my_goal_is/",
  "subreddit": "CryptoCurrency",
  "id": "px1lz4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One of the biggest mistakes newbies make is pricing everything in dollars.\nDollar is a shitcoin. The Fed can outpace your profits by printing another\ntrillion at any time.\n\nWhen I first got into bitcoin, I made the same mistakes. Oftentimes, I was\ngaining dollars but losing sats without even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "初心者が犯す最大の間違いの一つは、すべてをドルで価格設定することです。\nドルはシットコインです。FRBはいつ何時でも、さらに1兆円を刷ってあなたの利益を上回ることができます。\nいつでも、あなたの利益を上回ることができます。\n\n私が初めてビットコインに参入したときも、同じような間違いを犯しました。往々にして、私は\nドルを獲得しても、サットを失うことがよくありました。",
      "title": "私の目標はドルではなくサットを貯めることなので、損をしたことはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "新手犯的最大错误之一是用美元为所有东西定价。\n美元是一种狗屎币。美联储可以通过再印制一个\n万亿。\n\n当我第一次进入比特币时，我也犯了同样的错误。很多时候，我都是\n获得了美元，却失去了萨特，甚至没有...",
      "title": "我从来没有输过钱，因为我的目标是积累萨特，而不是美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "新手犯的最大錯誤之一是用美元爲所有東西定價。\n美元是一種狗屎幣。美聯儲可以通過再印製一個\n萬億。\n\n當我第一次進入比特幣時，我也犯了同樣的錯誤。很多時候，我都是\n獲得了美元，卻失去了薩特，甚至沒有...",
      "title": "我從來沒有輸過錢，因爲我的目標是積累薩特，而不是美元。"
    }
  ]
}