{
  "author": "JW_Alumnus",
  "original_created_utc": 1658326049,
  "title": "Why is Post-Modernism so Often Confused With Relativism?",
  "created_utc": 1658382389,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is the common interpretation that post-modernism equals a radically relativistic view of (moral) truths. Another notion popularized by the likes of Jordan Peterson is that post-modernism is a rebranded version of Marxist or generally communist ideology. Although I understand that post-modernism doesn&amp;#39;t have a definitive definition, I would say that the central notion common to most post-modern philosophies is that you should reject a &amp;#39;grand narrative&amp;#39;, therefore clearly being incompatible with something like Marxism. I know many people kind of cringe at Jordan Peterson as a philosopher, but I actually think he is smart enough not to make such a basic mistake. Other noteworthy people like the cognitive scientist and philosopher Daniel Dennett also shared the following sentiment that seems to be very popular:  &lt;/p&gt;\n\n&lt;p&gt;Dennett has been critical of &lt;a href=\"https://en.wikipedia.org/wiki/Postmodernism\"&gt;postmodernism&lt;/a&gt;, having said:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Postmodernism, the school of &amp;quot;thought&amp;quot; that proclaimed &amp;quot;There are no truths, only interpretations&amp;quot; has largely played itself out in absurdity, but it has left behind a generation of academics in the humanities disabled by their distrust of the very idea of truth and their disrespect for evidence, settling for &amp;quot;conversations&amp;quot; in which nobody is wrong and nothing can be confirmed, only asserted with whatever style you can muster.&lt;a href=\"https://en.wikipedia.org/wiki/Daniel_Dennett#cite_note-51\"&gt;[51]&lt;/a&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Moreover, it seems like they have a point in the sense that many Marxists/Moral Relativists/SJW&amp;#39;s/what-have-you&amp;#39;s do indeed label themselves as post-modern thinkers. Why is it the case that post-modernism has &amp;#39;evolved&amp;#39; into what seems to resemble a purely relativistic or Marxist worldview? (Bonus points if you try not to just blame Jordan Peterson for this).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askphilosophy/comments/w3n8v5/why_is_postmodernism_so_often_confused_with/",
  "subreddit": "askphilosophy",
  "id": "w3n8v5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There is the common interpretation that post-modernism equals a radically\nrelativistic view of (moral) truths. Another notion popularized by the likes of\nJordan Peterson is that post-modernism is a rebranded version of Marxist or\ngenerally communist ideology. Although I understand that post…"
}