{
  "author": "stonebolt",
  "original_created_utc": 1638813928,
  "title": "Does most people worry about \"breaking character\" at work? Do most people worry that their coworkers or boss will figure out that the person they pretend to be at work isn't real?",
  "created_utc": 1638830696,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everyone has to act &amp;quot;professional&amp;quot; at work, meaning everyone basically has to have a separate, fake personality at work. Or at least it seems that way to me? Do people worry that they&amp;#39;ll be found out? Do people worry that everyone at work will figure out that their &amp;quot;professional&amp;quot; personality isn&amp;#39;t the real them?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/radif3/does_most_people_worry_about_breaking_character/",
  "subreddit": "TooAfraidToAsk",
  "id": "radif3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyone has to act \"professional\" at work, meaning everyone basically has to\nhave a separate, fake personality at work. Or at least it seems that way to me?\nDo people worry that they'll be found out? Do people worry that everyone at work\nwill figure out that their \"professional\" personality isn't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仕事では誰もが「プロフェッショナル」に振舞わなければならない、つまり、誰もが基本的に\n仕事場では別の、偽りの人格を持っているのです。少なくとも、私にはそう見えるのですが。\n人々は、自分がバレることを心配しているのでしょうか？人々は、職場のみんなが\nその「プロフェッショナル」な人格が、実は...。",
      "title": "多くの人は、仕事で「キャラが崩れる」ことを心配しますか？多くの人は、職場で自分が演じている人物が実在しないことを同僚や上司に悟られることを心配しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个人在工作中都必须表现得 \"专业\"，这意味着每个人基本上都必须\n在工作中拥有独立的、虚假的人格。或者至少在我看来是这样的？\n人们是否担心他们会被发现？人们是否担心每个人在工作中\n会发现他们的 \"专业 \"人格并不是......",
      "title": "大多数人是否会担心在工作中 \"破坏性格\"？大多数人是否担心他们的同事或老板会发现他们在工作中假装的人并不真实？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人在工作中都必須表現得 \"專業\"，這意味着每個人基本上都必須\n在工作中擁有獨立的、虛假的人格。或者至少在我看來是這樣的？\n人們是否擔心他們會被發現？人們是否擔心每個人在工作中\n會發現他們的 \"專業 \"人格並不是......",
      "title": "大多數人是否會擔心在工作中 \"破壞性格\"？大多數人是否擔心他們的同事或老闆會發現他們在工作中假裝的人並不真實？"
    }
  ]
}