{
  "author": "PMmeyourboobsplox",
  "original_created_utc": 1631291733,
  "title": "Why is it so difficult to find condoms in smaller sizes?",
  "created_utc": 1631294794,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My wedding vegetables are smaller than average. That doesn’t bother me one bit, and so far I have never received any complaints, but standard condoms I buy in a supermarket or in a pharmacy make intercourse a bit awkward, because I seriously need to make sure that Batman doesn’t lose his cape whenever he is on active duty. I have found smaller condoms in online stores (but delivery is excruciatingly expensive where I live), but never in pharmacies, supermarkets, or other condom-selling places, while they do offer all kinds of ego-caressing sizes. Why is that? I mean, statistically there should be a lot of people in my situation; where should we go?</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/plol51/why_is_it_so_difficult_to_find_condoms_in_smaller/",
  "subreddit": "TooAfraidToAsk",
  "id": "plol51",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My wedding vegetables are smaller than average. That doesn’t bother me one bit,\nand so far I have never received any complaints, but standard condoms I buy in a\nsupermarket or in a pharmacy make intercourse a bit awkward, because I seriously\nneed to make sure that Batman doesn’t lose his cape…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の結婚式の野菜は平均より小さいです。それは少しも気になりません。\n今のところ苦情を受けたことはありませんが、スーパーや薬局で買う一般的なコンドームは\nスーパーマーケットや薬局で買う一般的なコンドームでは、性交が少し気まずくなってしまうのです。\nバットマンがマントを失くさないようにしないと...。",
      "title": "小さいサイズのコンドームを見つけるのが難しいのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的婚礼蔬菜比一般的小。这一点也不妨碍我。\n到目前为止，我从未收到任何投诉。\n但我在超市或药店购买的标准安全套使性交变得有点尴尬，因为我真的需要确保蝙蝠侠不会失去他的斗篷。\n因为我需要确保蝙蝠侠不会失去他的披风......",
      "title": "为什么很难找到小尺寸的安全套？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的婚禮蔬菜比一般的小。這一點也不妨礙我。\n到目前爲止，我從未收到任何投訴。\n但我在超市或藥店購買的標準安全套使性交變得有點尷尬，因爲我真的需要確保蝙蝠俠不會失去他的斗篷。\n因爲我需要確保蝙蝠俠不會失去他的披風......",
      "title": "爲什麼很難找到小尺寸的安全套？"
    }
  ]
}