{
  "author": "diggydirt",
  "the_new_excerpt": "I never even knew what an ETF was until about a week ago and had never even\nthought about investing till about 2 months ago when I yolo'd some money at AMC.\nLuckily I didn't get burned and got out with 12k to invest and immediately\nthought \"what the hell do I do now?\" That brought me to Bogleheads…",
  "original_created_utc": 1624027526,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は1週間ほど前までETFというものを知りませんでしたし、2週間ほど前までは投資を考えたこともありませんでした。\n投資について考えたこともなかった。2ヶ月ほど前、AMCでお金をヨロシク使ったときのことだ。\n幸運にも私は火傷をせずに済み、1万2千円の投資資金を手にして、すぐに\nどうしたらいいんだろう？」と思いました。そこで私はBogleheadsにたどり着きました...",
      "title": "39歳にして初めての経験で、必要以上にリスクを避けることはできませんが、ここにいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我甚至不知道什么是ETF，直到大约一周前，我甚至从来没有想过投资，直到大约2个月前，我在网上找到了一些ETF。\n直到大约2个月前，我在AMC投资了一些钱，才想到要投资。\n幸运的是，我没有被烧伤，带着1.2万块钱出来投资，并立即想\n想着 \"我现在到底该怎么做？\" 这让我找到了Bogleheads...",
      "title": "39岁的我是个新手，对风险的厌恶程度比我想象的要低，但我还是来了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我甚至不知道什麼是ETF，直到大約一週前，我甚至從來沒有想過投資，直到大約2個月前，我在網上找到了一些ETF。\n直到大約2個月前，我在AMC投資了一些錢，纔想到要投資。\n幸運的是，我沒有被燒傷，帶着1.2萬塊錢出來投資，並立即想\n想着 \"我現在到底該怎麼做？\" 這讓我找到了Bogleheads...",
      "title": "39歲的我是個新手，對風險的厭惡程度比我想象的要低，但我還是來了。"
    }
  ],
  "title": "Very new at 39 years old, less risk averse than I should be but here I am.",
  "created_utc": 1624041201,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I never even knew what an ETF was until about a week ago and had never even thought about investing till about 2 months ago when I yolo&#39;d some money at AMC. Luckily I didn&#39;t get burned and got out with 12k to invest and immediately thought &quot;what the hell do I do now?&quot; That brought me to Bogleheads through some Google rabbit holes and here I am. Looking to start a 80% VTI 10% VXUS and 10% small cap value tilt and putting right at 300 a week into that after the initial 12k. From what I have read, like after the tech bubble and &#39;08, small caps tend to outperform large caps after a major event. But all of this is after just 2 weeks of reading everything I can get my hands on and trying to make sense of it all. So ANY criticism is welcome and appreciated, started as a smooth brained, crayon-eating ape and now I&#39;m here ready to get some wrinkles.</p>\n</div><!-- SC_ON -->",
  "score": 25,
  "permalink": "/r/Bogleheads/comments/o2qqup/very_new_at_39_years_old_less_risk_averse_than_i/",
  "subreddit": "Bogleheads",
  "id": "o2qqup",
  "is_self": true,
  "media": null,
  "is_video": false
}