{
  "author": "throwawayamd14",
  "the_new_excerpt": "DISCLAIMER: This is not my post. I have researched tether a good bit and find\nthe information here true based on what I found but I did not take the time to\nwrite something like this. u/VodkaHaze [https://www.reddit.com/user/VodkaHaze/]\nWROTE THIS\n\nWhat's Tether?\n\nUSDT is a \"stablecoin\" -- a…",
  "original_created_utc": 1621424504,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "免責事項：これは私の投稿ではありません。私はテザーについて少し調べてみました。\nここに書かれている情報は私が見つけたものに基づいていますが、このようなことを書くために時間をかけたわけではありません。\nu/VodkaHaze [https://www.reddit.com/user/VodkaHaze/]。\nこれを書いたのは\n\nテザーとは？\n\nUSDTは「ステーブルコイン」と呼ばれるもので、...",
      "title": "テザーと暗号の価格の真実"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：这不是我的帖子。我对系绳进行了很好的研究，并发现\n这里的信息是真实的，但我并没有花时间去写类似的东西。\nu/VodkaHaze [https://www.reddit.com/user/VodkaHaze/]\n写了这个\n\n什么是Tether？\n\nUSDT是一种 \"稳定币\"--一种...",
      "title": "关于系绳和加密货币价格的真相"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：這不是我的帖子。我對繫繩進行了很好的研究，並發現\n這裏的信息是真實的，但我並沒有花時間去寫類似的東西。\nu/VodkaHaze [https://www.reddit.com/user/VodkaHaze/]\n寫了這個\n\n什麼是Tether？\n\nUSDT是一種 \"穩定幣\"--一種...",
      "title": "關於繫繩和加密貨幣價格的真相"
    }
  ],
  "title": "The truth about tether and crypto prices",
  "created_utc": 1621432445,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>DISCLAIMER: This is not my post. I have researched tether a good bit and find the information here true based on what I found but I did not take the time to write something like this.  <a href=\"https://www.reddit.com/user/VodkaHaze/\">u/VodkaHaze</a> WROTE THIS</p>\n\n<p>What&#39;s Tether?</p>\n\n<p>USDT is a &quot;stablecoin&quot; -- a cryptocurrency whose price is supposed to be pegged to the US dollar -- managed by a company called tether.</p>\n\n<p>Initially tether said they enforced the peg by having each USDT be backed by a USD in a bank account. Then tether ran into all sorts of hilarious hijinks over the years, many of which we only found out because they <a href=\"https://ag.ny.gov/sites/default/files/2021.02.17_-_settlement_agreement_-_execution_version.b-t_signed-c2_oag_signed.pdf\">were made public in NYAG litigation</a>, including:</p>\n\n<ul>\n<li>Having all of tether&#39;s money in their lawyer&#39;s personal bank account (May 2017)</li>\n<li>Not having any bank account anywhere in the world for 6 monthsto receive money in. Yet still emitting $400m new tethers in that period. Their lawyer&#39;s personal account had, at most, $60m at any point. Bitfinex had two institutional deposits in that whole period, neither of whom purchased USDT.</li>\n<li>Failing to complete an audit and settling on an attestation (An audit verifies where money comes from. An attestation is just an accoutnant saying &quot;there was money in a bank account on that date&quot;) for &quot;transparency&quot;. The morning of the attestation, tether moved $380m from sister company bitfinex into a bank account the morning of the day of the attestation.</li>\n<li>Losing $900M to their money launderer, and covering those losses by commingling bitfinex customer funds with tether reserve funds (2018)</li>\n<li>Finding the last bank on earth, <a href=\"https://www.deltecbank.com/\">Deltec Bank from Bahamas</a> willing to do business with them after Wells Fargo and HSBC fired them as clients. Remember HSBC has the kind of risk tolerance leaving them to <a href=\"https://www.icij.org/investigations/fincen-files/hsbc-moved-vast-sums-of-dirty-money-after-paying-record-laundering-fine/\">willingly deals with drug cartels</a>. No bank wants tether as a client.</li>\n</ul>\n\n<p>Just read section 2 and 3 of the NYAG settlement. It&#39;s a blast. The best recap on the tether saga is by <a href=\"https://amycastor.com/2019/01/17/the-curious-case-of-tether-a-complete-timeline-of-events/\">Amy Castor</a>, but <a href=\"https://www.kalzumeus.com/2019/10/28/tether-and-bitfinex/\">Patrick McKenzie</a> also has a good write up. Note that Patrick&#39;s piece is quaint now -- it was written back in 2019 when tether&#39;s balance sheet was $2B. Tether now has over <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/Screen-Shot-2021-05-18-at-11.28.53-PM-1024x585.png\">$58B on their balance sheet</a></p>\n\n<p>As far as we know, there was no point in history at which USDT in circulation were backed 1-to-1 by USD in a bank account. At this point, they stopped even pretending -- each tether in circulation is backed by... <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/02/reserves.gif\">tether&#39;s &quot;reserves&quot;.</a></p>\n\n<p>The &quot;Reserves&quot;</p>\n\n<p>For a long time, tether&#39;s &quot;reserves&quot; were a mystery. As found in the NYAG investigation, tether likely never had a dollar in a bank account for each USDT, at any point, ever. They&#39;re now forced to reveal the makeup in May 2021 as per the NYAG settlement. Tether found a 5-person accounting firm in the Cayman islands willing to do an <a href=\"https://tether.to/wp-content/uploads/2021/03/tether-assurance-feb-2021.pdf\">attestation</a>, which states they have 0.36% more assets than liabilities.</p>\n\n<p>In anticipation for their forced public disclosure, tether recently posted this <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/glorious_pie_chart-1024x769.png\">glorious pie chart</a></p>\n\n<p>Which <a href=\"https://protos.com/tether-pie-chart-usdt-dollar-pegged-crypto-stablecoin-dollar-value/\">has</a> <a href=\"https://bennettftomlin.com/2021/05/13/for-every-1-of-tether-there-are-0-03-in-cash/\">prompted</a> <a href=\"https://finance.yahoo.com/news/tether-first-breakdown-shows-token-120000439.html\">many</a> <a href=\"https://www.ft.com/content/529eb4e6-796a-4e81-8064-5967bbe3b4d9\">more</a> <a href=\"https://davidgerard.co.uk/blockchain/2021/05/13/tether-publishes-two-pie-charts-of-its-reserves/\">questions</a>. First, we can view the actual debt in this form, as <a href=\"https://twitter.com/intel_jakal\">broken Intel Jackal</a> (<a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/piechart.png\">image</a>)</p>\n\n<p>Almost all of the reserves are in some form of loan to a commercial company (corporate bonds, commercial paper, secured loans). Only around 5% are in assets whose value we know (cash, T-Bills).</p>\n\n<p>Inconsistencies</p>\n\n<p>Tether&#39;s general counsel, Stuart Hoegner, posted a <a href=\"https://stuarthoegner.medium.com/tether-is-setting-a-new-standard-for-transparency-and-responding-to-criticism-that-is-fc130e08319b\">highly unusual blog post</a> in which he claims this is good debt by any standard. This raises many inconsistencies, which are easy to see given the magnitude of the numbers at hand.</p>\n\n<ul>\n<li>Stuart claims they don&#39;t hold Treasury Bills because the interest rate is close to 0%. If they hold this risky debt as reserves because it pays higher interest, <strong>why does tether only have 0.36% more assets than liabilities?</strong> Either thether&#39;s management is looting the interest rates on the assets and leaving USDT holders with the debt&#39;s risk, or we&#39;re being lied to.</li>\n<li>With $20B in commercial paper at the time of the attestation, and 50% more USDT on the market since, tether presumably has <strong>$30B in commercial paper</strong> at time of writing. The <a href=\"https://sec.gov/files/primer-money-market-funds-commercial-paper-market.pdf\">entire commercial paper market</a> in the US is around $1T per year.</li>\n</ul>\n\n<p>We&#39;re supposed to believe that <strong>tether somehow holds 3% of the US commercial paper market</strong> at time of writing, and that they <em>apparently bought 1% of the entire market in the last month alone</em>.</p>\n\n<ul>\n<li>The asset allocation strategy in the reserves seems to be <a href=\"https://twitter.com/intel_jakal/status/1394562510070583296\">copied from</a> an investment fund at tether&#39;s bank, Deltec. This investment fund apparently manages $425M, rather than $60B.</li>\n<li>If the reserves are such regular financial assets, how come respectable accounting firms won&#39;t even touch it for a simple attestation?</li>\n</ul>\n\n<p>We know that some of the money used for USDT come from Chinese money laundering because a tether shareholder <a href=\"https://protos.com/china-crypto-otc-king-zhao-dong-criminal-charges-court-docs-show/\">was recently charged</a>. But we see no mention of frozen accounts in the reserves. Moreover, this amounts to less than $0.5B, and the perpetrator was nicknamed the &quot;Chinese OTC King&quot; -- so even in the charitable case where USDT are fully backed by money laundering, this raises inconsistencies.</p>\n\n<p>Reminder: non-USD reserves for a stablecoin are a problem</p>\n\n<p>As noted by <a href=\"https://www.coppolacomment.com/2021/05/tethers-smoke-and-mirrors.html\">Frances Coppola</a>, it&#39;s dangerous to guarantee to clients that something is worth $1 when your assets backing it are not dollars. The value of the USD changes very little. The value of crypto changes a lot.</p>\n\n<p>If you want to enforce a market price of $1 for something backed by not-dollars, then the quantity of reserves needs to go up and down with the asset price changes. Otherwise, you&#39;ll eventually become insolvent, when asset prices become lower than what you bought them for.</p>\n\n<p>Who are these loan to?</p>\n\n<p>Tether has lost the privilege of the benefit of doubt a long time ago. Here is how tether&#39;s Ponzi scheme likely works:</p>\n\n<ul>\n<li>All their commercial debt is to the related exchanges (Binance, FTX, Bitfinex - see below) or their affiliated shell companies.</li>\n<li>Tether make new USDT out of thin air and send them against a dollar-denominated loan to these affiliates</li>\n<li>The affiliates use the new USDT to put market buy-orders for crypto, putting them on the new USDT on market</li>\n<li>Crypto goes up in value becaue of the new demand pressure. This overcollateralizes the affiliated loans, justifying more loans.</li>\n<li>Rinse, repeat.</li>\n</ul>\n\n<p>We can track who new USDT go to directly by looking at their <a href=\"https://tronscan.org/#/address/TKHuVq1oKVruCGLvqVexFs6dawKv6fQgFs/transfers\">TRON</a>, <a href=\"https://etherscan.io/address/0x5754284f345afc66a98fbb0a0afe71e0f007b949#tokentxns\">ethereum</a>, <a href=\"https://omniexplorer.info/address/1NTMakcgVwQpMdGxRQnFKyb3G1FAJysSfz\">OMNI</a> and <a href=\"https://explorer.solana.com/address/Q6XprfkF8RQQKoQVG33xT88H7wi8Uk1B1CC7YAs69Gi\">Solana</a> blockchain addresses. By matching the blockchain addresses new USDT are sent to to known parties, we can track who are the ones sending <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/tether-to-exchanges-1024x530.png\">new USDT on the market:</a></p>\n\n<p>The counterparties are largely Binance, FTX, Bitfinex, and other exchanges. The commercial paper is presumably to affiliated shell companies. I wouldn&#39;t put those companies debt at a dollar-to-dollar valuation; for instance <a href=\"https://www.bloomberg.com/news/articles/2021-05-13/binance-probed-by-u-s-as-money-laundering-tax-sleuths-bore-in\">Binance is currently under investigation by the DOJ and IRS</a>.</p>\n\n<p>But how does the $1 peg hold?</p>\n\n<p>This is an easy one. <a href=\"https://twitter.com/AlamedaTrabucco/status/1348773044873949185\">FTX happily admits to enforcing the dollar peg</a> (<a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/Screen-Shot-2021-05-18-at-11.12.17-PM-861x1024.png\">image</a>)</p>\n\n<p>You can easily enforce the dollar peg by wash-trading around the $1 price and arbitraging on exchanges who don&#39;t.</p>\n\n<p>FTX don&#39;t even need to be complicit to the scheme for this to make financial sense: if FTX can get new USDT for $1 on an infinite loan margin from tether, it&#39;s perfectly sensible to buy USDT when it&#39;s below $1 and shortsell USDT when it&#39;s above.</p>\n\n<p>The Mississippi bubble, 2021 style</p>\n\n<p>The cryptocurrency ecosystem is conceptually simple. Money comes in from new investors buying, and the same money comes out to pay those cashing out. It would be a zero-sum ecosystem, except for the fact that miners have to pay their <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/crypto_is_simple.png\">bills in dollars</a></p>\n\n<p>This is why &quot;bitcoin investors&quot; feel an immediate urge to tell everyone else to invest in bitcoin -- if no new money comes in, the financial structure eventually collapses under the miner&#39;s sell pressure.</p>\n\n<p>Note how this is different than buying a company&#39;s stock. People buy and sell stocks on a stock exchange, but the companies independently have money coming in (from their clients). The stock of a profitable company is a positive-sum ecosystem. If somehow no one wants to buy the stock, a profitable company will be happy to buy it back itself.</p>\n\n<p>When tether comes in with their scheme, they put demand pressure on BTC then add a supply constraint on BTC (also driving up the price!) by reducing the total supply of BTC to <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/crypto_is_usdt.png\">hoard in their reserves</a></p>\n\n<p>Notice that even though bitcoin prices are higher, <strong>no additional money entered the ecosystem</strong> in the tether pump. Like a Ponzi scheme, we <em>cannot pay everyone off at the inflated price</em> using the pool of money that&#39;s in the crypto ecosystem (More specifically, the pool of money in the crypto exchange&#39;s customer fund bank accounts) When enough money starts looking for the exit door, a $60B hole gets torn into the ecosystem, and <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/masterpiece.gif\">someone has to pay for it.</a></p>\n\n<p>The danger zone happens when BTC drops below $18,500</p>\n\n<p>Assuming that each new USDT is used to instantly buy BTC at market prices (This is a lower bound estimate, since USDT are issued on the market between mint periods, where price is increasing), we can track where the BTC &quot;price of no return&quot; is -- where reserve BTC were paid for <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/tether_insolvency_point.png\">more overall than they&#39;re now worth.</a></p>\n\n<p>We can play around with parameters (they might buy ETH or Dogecoin rather than BTC, etc.) but most calculations land the death zone in the $17k-$20k range -- prices we were at around December 2020.</p>\n\n<p>The scheme can easily collapse above this point. Bernie Madoff&#39;s customer deposits was around $18B against a $65B promised liabilities, but his scheme collapsed way before $40B in funds were withdrawn, because fraudsters tend to mismanage and embezzle some of the money for themselves.</p>\n\n<p>Notice that the last point in time where BTC price went significantly below the death zone is the March 2020 COVID price crash -- which is also the point where USDT were started to be minted at a parabolic rate.</p>\n\n<p>The DeFi boom started with the USDT flood</p>\n\n<p>This is a sidenote to this story, but the Decentralized Finance (DeFi) boom started because of USDT flooding the market. DeFi is not a new invention: it&#39;s existed since the 2017 bubble. No one picked it up because it&#39;s a fairly useless idea: lock up more collateral for a crypto loan than the loan&#39;s value and use the loan.</p>\n\n<p>DeFi is exclusively used to leverage trading - eg. lock up BTC, keep the BTC exposure, and use the loan to buy more BTC. You can&#39;t buy a house or start a business on a DeFi loan -- the point of normal loans is to use personal creditworthiness and <strong>under</strong>collateralization to move future cashflows into the present. For these reasons, <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/Screen-Shot-2021-05-18-at-11.16.05-PM-1024x497.png\">no one picked it up for years</a></p>\n\n<p>But notice something happened around the same time as USDT exploded. We can track what happened to DeFi by getting historical borrowing rates and matching them to total money in DeFi (TVL), USDT in <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/defirates-1024x512.png\">DeFi and total USDT</a></p>\n\n<p>A clear story emerges:</p>\n\n<p>No one used DeFi until tether joined the Ethereum blockchain in April 2019. Then a ton of new tethers, with no particular place to go, found themselves emitting DeFi loans. This floored the borrowing rates for DeFi, especially so in April 2020, after tether started printing themselves out of insolvency.</p>\n\n<p>Once borrowing rates were appealing, DeFi started taking off.</p>\n\n<p>Eventually, the DeFi ecosystem tried to distance itself from USDT, but the coin is still around 45% of the entire space.</p>\n\n<p>USDT DeFi loans are generally USDT-denominated. If the USDT peg breaks significantly, these USDT DeFi loans will go into margin call one way or another.</p>\n\n<p>The noose is tightening</p>\n\n<p>At the time of writing, BTC crashed from a high of $64k to around $41k (now 38k). But more importantly, for the first time in months, we&#39;re starting to see <strong>significant backflows</strong> into tether addresses, largely from Binance. Here are the outflows and inflows (excluding newly minted USDT) into the tether address <a href=\"https://www.singlelunch.com/wp-content/uploads/2021/05/death-1024x567.png\">on Tron, for example</a></p>\n\n<p>The orange lines are USDT coming out onto market. The blue lines are USDT coming back into tether&#39;s blockchain address.</p>\n\n<p>This is means people are recently withdrawing, a lot. The music could stop at any moment now. It could take hours, or it could take months.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>Not from the copy paste: I want to add to this, on the day of Elon&#39;s initial tweet about Tesla not accepting bitcoin, there was a drastic spike of bitcoin coming into exchanges JUST PRIOR to the tweet. Was this Elon, someone he told, or just a lucky trade? Who knows. However, after the tweet there was a sudden move of 650 million tether (so $650m)  onto exchanges to BUY bitcoin as the price was collapsing and this stabilized the price. In my opinion tether is being used to inflate BTC but unlike the federal reserve tether cannot print $$$$. <strong>Oh, and tether clearly states they do NOT guarantee any redemption of dollars to holders of tether.</strong> IE they are not assured you can trade a tether for a dollar like other stable coins</p>\n\n<p>&#x200B;</p>\n\n<p>I would recommend avoiding BTC until tether is fully audited and we know what companies that commercial paper is from.</p>\n</div><!-- SC_ON -->",
  "score": 282,
  "permalink": "/r/investing/comments/ng3im3/the_truth_about_tether_and_crypto_prices/",
  "subreddit": "investing",
  "id": "ng3im3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803276
}