{
  "author": "mic_droo",
  "original_created_utc": 1647607103,
  "title": "Correcting misinformation about a 'bad coin' is not shilling it. Stating negative aspects or concerns about a 'good coin' does not make someone a hater. This mentality in crypto is extremely annoying.",
  "created_utc": 1647635510,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let me start out by telling you about my portfolio - I hate that I have to do this but it&amp;#39;s necessary to state my point. I only have relevant holdings of four coins: BTC, ETH, another top coin that this sub likes a lot and one pretty small coin that also used to be popular around here, as my high-risk option. I don&amp;#39;t mention the other two explicitly because this is not a shill post, the message is: I have a portfolio this sub would pretty much approve of, I don&amp;#39;t have any meme coins or hyped moonshots, not even in my smaller, insignificant holdings.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s because I don&amp;#39;t really like meme coins. Don&amp;#39;t really see the appeal, except from trying to get lucky and make money quick. But I dislike misinformation even more, and I see problems about that on this sub. If someone made a post right now where they said&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;ICP founder confirms: &amp;quot;It was a planned rug pull from the beginning!&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;and completely made up a story, it would get hundreds, maybe thousands of upvotes. Maybe the mods would remove it at some point, maybe not. But people would eat it up. If I then came along and made another post that elaborately showed how that post just completely lied, it would get buried in downvotes and only a few people would read it. I could start with a disclaimer that I don&amp;#39;t think ICP is a good project and that I don&amp;#39;t hold any and never did, people would still call me an ICP shill that is bitter because he gambled on the wrong coin and is now trying to pump his bags.&lt;/p&gt;\n\n&lt;p&gt;How do I know that? &lt;strong&gt;Because it happened to me multiple times.&lt;/strong&gt; I really dislike misinformation and the unfounded circle-jerk-hating that&amp;#39;s going on here. So quite a few of the posts I make are just trying to correct false information that got really popular on here, I feel like half my posts start with &amp;quot;No, &amp;quot;. If this misinformation I am trying to correct is about the coins this sub hates, however, this usually doesn&amp;#39;t go so well. Two examples:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;A few months ago, I made a post saying that it was a bad argument to say Doge is dead just because it&amp;#39;s down from ATH (back then, there were multiple very popular post saying just that), when almost everything was down from ATH. I did not say a positive word about Doge, just that &amp;quot;being down from ATH&amp;quot; is a bad argument, especially for a coin that has been surviving for 8 years. I was called a shill, people told me I fell for a get rich quick scheme (&lt;em&gt;remember, I never had any Doge and also said that in the post&lt;/em&gt;) etc.&lt;/li&gt;\n&lt;li&gt;Similarly, today I made a post that &amp;quot;ApeCoin fell 80% on its first day&amp;quot; is just as misleading as &amp;quot;ApeCoin increased 2,700% on its first day&amp;quot; and pretty much just lying. In the post I said that I was not interested at all in the coin, that it might be a scam but is most likely just a pretty bad coin. But well, that specific popular &amp;quot;criticism&amp;quot; on here was not valid as everyone that didn&amp;#39;t buy in the first two minutes after launch (i.e. some bots) currently made a profit. You guessed it: I&amp;#39;m a shill, I&amp;#39;m defending a scam, I fell for a scam (&lt;em&gt;remember: I did not&lt;/em&gt;).&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;It happened more often than this, usually in comments. And I am more annoyed about it than I should be. This mindset is just weird: &amp;#39;&lt;em&gt;I don&amp;#39;t like this coin, so I will just upvote negative posts about it and don&amp;#39;t care if they say the truth or not. If someone corrects these lies, they are shills&lt;/em&gt;&amp;#39;. &lt;strong&gt;Why this friend-or-enemy mentality? Why can people in crypto not accept that maybe, while their favorite coins are &amp;#39;good&amp;#39; on average, they have flaws and pointing them out is not FUD or makes someone a hater? And that the coins they hate might be &amp;#39;bad&amp;#39; on average, but not everything about them is, and that correcting misinformation about them is not shilling?&lt;/strong&gt; &amp;quot;I think coin X is bad, but this one aspect about it is just not true&amp;quot; would be an awful shill. Who would buy a coin because of that?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr: shades of grey exist, not everything is black and white. If someone doesn&amp;#39;t join in some circle-jerk-hating, that doesn&amp;#39;t make them a shill. If someone thinks not everything about a coin is perfect, that doesn&amp;#39;t make them a hater.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/th0coq/correcting_misinformation_about_a_bad_coin_is_not/",
  "subreddit": "CryptoCurrency",
  "id": "th0coq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Let me start out by telling you about my portfolio - I hate that I have to do\nthis but it's necessary to state my point. I only have relevant holdings of four\ncoins: BTC, ETH, another top coin that this sub likes a lot and one pretty small\ncoin that also used to be popular around here, as my high…"
}