{
  "author": "evDev84",
  "original_created_utc": 1628270888,
  "title": "Your portfolio is like a garden; It benefits from a bit of neglect.",
  "created_utc": 1628314758,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In gardening there is this concept that tending to your garden every day can be detrimental.  You end up overwatering it, misread various signs of disease that come on slowly that you might miss by seeing it every day (like missing how much your child is actually growing) or even over feeding as well.  </p>\n\n<p>It&#39;s a hard pill to swallow to watch your portfolio go down by half and know it could be years before it gets there again.  It&#39;s also hard to motivate yourself into keep investing in a market that just took half your portfolio away.  I personally have had this urge to constantly tinker with my portfolio, selling coins out of frustration with their performance, buying other coins out of what&#39;s essentially FOMO. It&#39;s all bad for you though. </p>\n\n<p>Stay motivated, ignore the short term pain volatility brings, and embrace it instead as opportunity.  This community is awesome and I just wanted to share some perspective for anyone who&#39;s feeling frustrated with the idea of tending to their investment like a day trader would. It doesn&#39;t take much.  Perseverance, a calm mind and realistic outlook on what&#39;s ahead, and yes, NEGLECT. It can give you great tomatoes and pretty decent portfolios.</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/ozbc5i/your_portfolio_is_like_a_garden_it_benefits_from/",
  "subreddit": "CryptoCurrency",
  "id": "ozbc5i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In gardening there is this concept that tending to your garden every day can be\ndetrimental. You end up overwatering it, misread various signs of disease that\ncome on slowly that you might miss by seeing it every day (like missing how much\nyour child is actually growing) or even over feeding as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ガーデニングでは、毎日庭の手入れをすることは有害であるという考え方があります。\n有害になるという考え方があります。水をやりすぎてしまったり、毎日見ていると見逃してしまうような、ゆっくりとやってくる病気の様々な兆候を見誤ってしまったりします。\n毎日見ていると見逃してしまうような、ゆっくりとやってくる様々な病気の兆候を見誤ってしまったり（子供が実際にどれくらい成長しているかを見落としてしまうようなものです）、あるいは、水を与えすぎてしまったり...。\n子供が実際にどのくらい成長しているのかを見逃してしまうようなものです）、あるいは餌を与えすぎてしまったり...。",
      "title": "ポートフォリオは庭のようなもので、ちょっとした手入れをするだけで効果があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在园艺中，有这样一个概念，即每天照看你的花园可能是\n有害的。你最终会给它浇水过多，误读各种疾病的征兆，而这些征兆是缓慢出现的。\n缓慢出现的各种疾病迹象，而你可能会因为每天看到它而错过（比如错过你的孩子究竟长了多少\n你的孩子到底长了多少），甚至过度喂食，因为......",
      "title": "你的投资组合就像一个花园；它受益于一点点的忽视。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在園藝中，有這樣一個概念，即每天照看你的花園可能是\n有害的。你最終會給它澆水過多，誤讀各種疾病的徵兆，而這些徵兆是緩慢出現的。\n緩慢出現的各種疾病跡象，而你可能會因爲每天看到它而錯過（比如錯過你的孩子究竟長了多少\n你的孩子到底長了多少），甚至過度餵食，因爲......",
      "title": "你的投資組合就像一個花園；它受益於一點點的忽視。"
    }
  ]
}