{
  "author": "brocko33",
  "original_created_utc": 1629038633,
  "title": "Hardware wallets explained",
  "created_utc": 1629053272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>(This is an updated version of a post I made a few months ago. I hope it will be useful to newcomers who may have missed it)</em></p>\n\n<p>Hardware wallets are, without a doubt, the most secure way to store your crypto. Yet, at first, they can be rather confusing and I have certainly seen a lot of misconceptions around them in some posts. This guide is structured as a FAQ so you can jump to the sections of interest. Please do let me know of any feedback or further questions in the comments and I will be happy to update the guide.</p>\n\n<h1>What’s a crypto wallet anyway?</h1>\n\n<p>A crypto wallet is essentially just a set of keys which identify you on the blockchain. The blockchain holds the ledger of all the transactions (entered by the miners or validators) hence it has at all times a record of where all the coins are. Thus, your wallet never really stores any coin. The coins are stored by the blockchain and your wallet simply contains the keys that let you prove the ownership of these coins. The wallet stores two types of keys:</p>\n\n<p><strong>Public key:</strong> this is hashed to generate an address you can use to receive your crypto, it is publicly available and can be shared safely.</p>\n\n<p><strong>Private key:</strong> this is the key you need to use to prove ownership of the coins i.e. to sign transactions when you move your coins around or withdraw them from your wallet. It is generated from the seed phrase (usually 12 word or 24-words).</p>\n\n<p>It is important to stress that, essentially, <strong>the seed phrase IS the wallet</strong>. This is because the seed phrase generates the private key which is the only way to prove ownership of the coins. Whoever learns this seed phrase can claim ownership of your portfolio and, on the contrary, if you forget this seed phrase you might end up locked out of your wallet forever.</p>\n\n<p><a href=\"https://preview.redd.it/ilvrel1j9jh71.png?width=326&amp;format=png&amp;auto=webp&amp;s=0087b3a4ce35a69ee8555453875e193919b9e73a\">https://preview.redd.it/ilvrel1j9jh71.png?width=326&amp;format=png&amp;auto=webp&amp;s=0087b3a4ce35a69ee8555453875e193919b9e73a</a></p>\n\n<h1>What are the different types of wallet ?</h1>\n\n<p><strong>Mobile/Desktop wallet:</strong> there are many desktop or mobile softwares that act as crypto wallets (e.g. Exodus, Atomic, Trust, Metamask,…). Those wallets are referred to as hot wallet because they are constantly connected to the internet. Whilst these are certainly the most convenient, their major drawback is that <strong>they are the most vulnerable to security threats</strong>. This is because your private key is stored on the computer or mobile phone which can be targeted by a malware, sim hack, key logger,…</p>\n\n<p><strong>Paper wallet:</strong> a paper wallet is simply a piece of paper where your keys have been printed, along with a QR code to scan to authenticate transactions. This is considered secure because it is removed from the internet. The only way to ‘hack’ it is to steal the sheet of paper.</p>\n\n<p><strong>Hardware wallet:</strong> a hardware wallet is a device, specifically designed to hold your private keys. It is another example of ‘cold storage’ meaning that it does not connect to the internet. You only have to plug it to confirm transactions, the private keys never leave the device. It is the most secure way to store your crypto but more on that later.</p>\n\n<h1>Why not simply leave my coins on the exchange ?</h1>\n\n<p>Leaving your coins on the exchange where you just bought them is easy and convenient but not the safest practice. When you create an account with an exchange, they manage your coins on your behalf. This means that, when you leave your coins at the exchange, you do not know your private keys and as the saying goes <strong>“not your keys, not your coins”</strong>. Many exchanges have been hacked (e.g. Altsbit, Upbit, Mt. Gox to name just a few and even Binance in May 2019) and in that case, it is almost impossible to recover the stolen funds. In some cases, there is also the risk that a government ban would freeze cryptocurrency transactions preventing you from accessing your coins.</p>\n\n<p>Having said that, some reputable exchanges, such as Coinbase, do invest a lot in their security and you need to consider whether you trust your own security measures more than theirs. Additionally, if you decide to store your crypto in your own wallet, you need to be confident that you will not lose your keys. It is estimated that <strong>more than 20% of all the bitcoins have been lost forever</strong>, mostly as a result of lost or forgotten keys.</p>\n\n<p>All this needs to be taken into account when assessing your personal decision but, it is generally considered that, for significant sums and/or for long term storage, a hardware wallet is the safest route.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lb7bt5ik9jh71.png?width=644&amp;format=png&amp;auto=webp&amp;s=dfa6efebf13ccac82a2a7a8ab2d41d0d4c9726f3\">In 2014, around 850,000 bitcoins were stolen from the exchange Mt. Gox</a></p>\n\n<h1>How does a hardware wallet work ? Why is it safe ?</h1>\n\n<p>A hardware wallet is designed to perform only a very limited set of tasks: it holds the private key and can be asked to confirm transaction using that key. It cannot connect to the internet and cannot prepare the transactions by itself. For this reason, it needs to be connected to a computer running a software, called a bridge, in order to prepare the transactions for the hardware wallet to sign. It is the safest way to store your crypto for several reasons:</p>\n\n<ul>\n<li>The operating system that runs the hardware wallet is extremely specific, unlike the one on a computer or a mobile phone. For this reason, it is immune to malware.</li>\n<li>It does not connect to the internet so it cannot be targeted by an attack.</li>\n<li>The private keys never leave the wallet so they are never exposed to a potential thief even if your computer has been compromised.</li>\n<li>Some hardware wallets use extra layers of security such as pin code, passphrase to protect against specific risks. See the next sections for more details.</li>\n</ul>\n\n<h1>What if my hardware wallet is lost or stolen?</h1>\n\n<p>If you lose your hardware wallet, simply use your seed phrase in any type of wallet (new hardware device or software wallet). Your private key will be re-generated and you will regain access to your funds. Then, because this private key is now probably compromised, you want to buy a new hardware wallet, obtain a brand new seed phrase and transfer your crypto to this new wallet.</p>\n\n<h1>What if my hardware wallet is broken?</h1>\n\n<p>Same answer as above. As long as you have the seed phrase, you can always recover the wallet.</p>\n\n<h1>What if the manufacturer of my hardware wallet goes out of business?</h1>\n\n<p>Same answer as above again except that you would buy a hardware wallet from a different brand. Most manufacturers will share the same seed phrase technology, thus the private key can be re-generated in a wallet from a different brand or even in a software wallet if need be.</p>\n\n<h1>Can hardware wallets be hacked ?</h1>\n\n<p><strong>Physically stolen device</strong></p>\n\n<p>It is possible for a hacker to extract the private keys from a hardware wallet but only if the wallet is physically stolen first. If your device does get lost or stolen, it is more likely that you will be able to restore the wallet in a different application using the seed phrase and transfer the funds to a brand new wallet before your device falls in the hands of a hacker skilled enough to extract the keys.</p>\n\n<p><strong>5$ wrench attack</strong></p>\n\n<p>Another type of possible theft is the less refined so-called 5$ wrench attack. This is the case where someone, possibly armed with a wrench, physically threatens you until you release your seed phrase. Obviously, the best way to protect yourself against this kind of threat is not to talk about your crypto portfolio but hardware wallet can also help. Some hardware wallet allow you to choose a <strong>passphrase</strong>which acts like an extra word that you choose to add to your seed phrase. This way, a single wallet can hold a default portfolio (the one with no passphrase) and multiple hidden portfolios (one for each passphrase you choose). If you are forced to reveal your seed phrase under duress, you could give access to a decoy portfolio which holds a small amount of crypto without having to reveal your other portfolio since there is no way to know how many hidden portfolio have been included in the wallet.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3zpegfgs9jh71.png?width=454&amp;format=png&amp;auto=webp&amp;s=34a647504ec701a09940113409d05aca1421100e\">https://preview.redd.it/3zpegfgs9jh71.png?width=454&amp;format=png&amp;auto=webp&amp;s=34a647504ec701a09940113409d05aca1421100e</a></p>\n\n<h1>Watch out for hardware wallet scams</h1>\n\n<p>When you decide to acquire a hardware wallet, you need to be very careful to buy a device that has not been compromised. Indeed, a widespread scam when it comes to hardware wallets consists in selling devices that have been previously tampered with. To avoid that, it is highly recommended to buy your device directly from the manufacturer website such as <a href=\"https://trezor.io/\">https://trezor.io</a> or <a href=\"https://www.ledger.com/\">https://www.ledger.com</a>instead of going through third-party sellers such as Ebay. When you do receive your device, you need to make sure it is genuine and has not been tampered with, you follow the steps described <a href=\"https://blog.trezor.io/psa-non-genuine-trezor-devices-979b64e359a7\">here for Trezor</a> and <a href=\"https://support.ledger.com/hc/en-us/articles/360002481534-Check-if-device-is-genuine\">here for Ledger</a>.</p>\n\n<p>A notable type of scam is the case where you receive a wallet that has already been preconfigured i.e. the seed phrase is already printed on a sheet or even a scratch card that you receive along with the device. This is a scam where the scammer already knows your private key and would have control over any fund you transfer into the wallet. <strong>The seed phrase should always be generated for the first time when you perform the initial set up of the device yourself.</strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/22lh8edu9jh71.png?width=296&amp;format=png&amp;auto=webp&amp;s=433ceb5b3f68b84126089adea4d6839cebad5e46\">A hardware wallet received with a pre-configured seed phrase is always a scam</a></p>\n\n<h1>Which wallet should I buy?</h1>\n\n<p>So, you’re convinced, you need a hardware wallet, but which one should you get? Below is a comparison table of the most common hardware wallets so you can make an informed decision. They all have their pros and cons but the most important is that you can’t go wrong with any of them.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/eyx02pc6ajh71.png?width=502&amp;format=png&amp;auto=webp&amp;s=2d14fc19853d365d564d2b32531b9ca12685117e\">Comparison table of the leading hardware wallets</a></p>\n\n<p><strong>*Touchscreen:</strong> this is an extra layer of security because it avoids having to type anything in the computer which is more vulnerable to security threats such as a key logger.</p>\n\n<p><strong>*Passphrase</strong>: this is the feature that lets you create hidden wallets within the device.</p>\n\n<p><strong>*Pin code</strong>: upon entering multiple incorrect pins, the device wipes itself such that the private keys are erased and can only be restored using the seed phrase.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/zut33ny7ajh71.png?width=559&amp;format=png&amp;auto=webp&amp;s=38e19fd1d050adc742b54204a19c92609fdb1601\">Trezor One and Model T</a></p>\n\n<h1>I heard Ledger was hacked, what’s up with that?</h1>\n\n<p>In 2020, Ledger company customers information were stolen. The actual ledger devices were not compromised and no coin were directly stolen. However, customer informations, including over a million email addresses as well as 270k home addresses and phone number, were made publicly available by hackers. This led to widespread phishing attempts whereby ledger customers were asked to download a fake version of Ledger live and input their seed phrase. Moreover, home addresses and phone numbers in the hands of hackers also led to personalised email threats as well as potential sim swap attack which could be used to overcome two-factor authentication.</p>\n\n<p>Consequently, even when using a hardware wallet, it is important to <strong>follow best practice in terms of security</strong>: ignore email scams, be on the lookout for phishing attempt, use authenticator app as 2FA, keep your seed phrase secure ideally in a rented safety box, …</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rvxdrcd9ajh71.png?width=386&amp;format=png&amp;auto=webp&amp;s=7fe5630cc7ebb66151e763c21e1fcaeb468f8309\">Ledger Nano X and S</a></p>\n\n<h1>I want to stake my coins, can I still store them on a hardware wallet?</h1>\n\n<p>Some coins can be staked directly from the hardware wallet allowing you to earn interest on your crypto in total security. This is the list at the time of writing so far as I am aware.</p>\n\n<p><strong>Ledger Nano X:</strong></p>\n\n<ul>\n<li>Polkadot (DOT): Ledger Live</li>\n<li>Cosmos (ATOM): Ledger Live</li>\n<li>Tezos (XTZ): Ledger Live</li>\n<li>Tron (TRX): Ledger Live</li>\n<li>Algorand (ALGO): Ledger Live</li>\n<li>Cardano (ADA): Yoroi, Adalite</li>\n<li>Harmony (ONE): Harmony One wallet</li>\n</ul>\n\n<p><strong>Trezor model T:</strong></p>\n\n<ul>\n<li>Cardano (ADA): Yoroi, Adalite.</li>\n<li>Tezos (XTZ): Trezor wallet</li>\n</ul>\n\n<p>A step-by-step guide to staking ADA from a hardware wallet can be found <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/n1p1ae/cardano_step_by_step_guide_to_staking_ada/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">here</a>.</p>\n\n<h1>Do I need to plug my wallet each time I receive coins or staking rewards ?</h1>\n\n<p>No. The private keys is not required to receive coins. The coins are sent to your public address and this transaction is recorded in the blockchain ledger. You will only need to plug the hardware wallet to prove ownership of the coins if you decide to spend them.</p>\n\n<h1>Any other best practice tip I should be aware of when setting up my hardware wallet ?</h1>\n\n<p>The first time you set up your hardware wallet, it is important to <strong>practice disaster recovery.</strong> After a few years using your device, it will likely be lost or fail and you need to be confident that you can recover your wallet. Thus, after the initial set up and after you have copied your seed phrase, send a very small amount of crypto to the wallet and wipe the device clean with a hard factory reset. Then, re-initialise the device using the seed phrase to recover the wallet. This makes sure you have correctly copied the seed phrase and gives you confidence you will be able to deal with the loss or failure of the device in the future.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/6UK-C7ZCuIc7z4k5NImeuTGRRLgPmh2S0TCHd4yecVc.jpg?auto=webp&s=2ae09ef16f6bdb80ed812fae17219ce0facc4270",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/6UK-C7ZCuIc7z4k5NImeuTGRRLgPmh2S0TCHd4yecVc.jpg?width=108&crop=smart&auto=webp&s=8bd991662878f3a879211d99bac72c9bae6425ba",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/6UK-C7ZCuIc7z4k5NImeuTGRRLgPmh2S0TCHd4yecVc.jpg?width=216&crop=smart&auto=webp&s=7d0ba42d83f802ae728e0140bb1da42de5134d22",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/6UK-C7ZCuIc7z4k5NImeuTGRRLgPmh2S0TCHd4yecVc.jpg?width=320&crop=smart&auto=webp&s=8ff5dbb79f049bef5a75508461d5140a1d8168e2",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/6UK-C7ZCuIc7z4k5NImeuTGRRLgPmh2S0TCHd4yecVc.jpg?width=640&crop=smart&auto=webp&s=3c532ce8095e57d633284d1f6ceda51743c351af",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/6UK-C7ZCuIc7z4k5NImeuTGRRLgPmh2S0TCHd4yecVc.jpg?width=960&crop=smart&auto=webp&s=283526a802f31437f234893b8f19b3e8c62d96cd",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/6UK-C7ZCuIc7z4k5NImeuTGRRLgPmh2S0TCHd4yecVc.jpg?width=1080&crop=smart&auto=webp&s=9b464d12e84828d3fd84e20916bfcf525e181c32",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "uy5LeMEQ_Wc3GAYKozjsW3jZcb6ghyXbYAjEdh0HH1g"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/p4ur1d/hardware_wallets_explained/",
  "subreddit": "CryptoCurrency",
  "id": "p4ur1d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "(This is an updated version of a post I made a few months ago. I hope it will be\nuseful to newcomers who may have missed it)\n\nHardware wallets are, without a doubt, the most secure way to store your crypto.\nYet, at first, they can be rather confusing and I have certainly seen a lot of\nmisconceptions…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(これは、数ヶ月前に行った投稿の更新版です。この記事が\nお役に立てれば幸いです。)\n\nハードウェアウォレットは、間違いなく、自分の暗号を保管する最も安全な方法です。\nしかし、最初のうちはかなり混乱することがあり、多くの誤解を目にしてきました。\n多くの誤解を目の当たりにしてきました...。",
      "title": "ハードウェアウォレットの説明"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(这是我几个月前所发帖子的更新版本。我希望它能对\n对那些可能已经错过的新人有用)\n\n毫无疑问，硬件钱包是存储加密货币的最安全方式。\n然而，一开始，他们可能会相当混乱，我当然看到了很多的\n误解...",
      "title": "硬件钱包解释"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(這是我幾個月前所發帖子的更新版本。我希望它能對\n對那些可能已經錯過的新人有用)\n\n毫無疑問，硬件錢包是存儲加密貨幣的最安全方式。\n然而，一開始，他們可能會相當混亂，我當然看到了很多的\n誤解...",
      "title": "硬件錢包解釋"
    }
  ]
}