{
  "author": "Slainte042",
  "original_created_utc": 1637846329,
  "title": "If you are smoker, quit and start buying Crypto.",
  "created_utc": 1637861452,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can&#39;t think of worse way to waste your hard earned money. Not only you are throwing them in the bin but you are harming your body as well. I know it&#39;s a pleasure and fun but the money paid for cigarettes pile up day by day, money which you otherwise can invest in Crypto.</p>\n\n<p>Where i live a pack of cigs costs around $3 and in most Western countries are much more expensive.</p>\n\n<p>Let&#39;s assume you smoke a pack per day and put things in perspective for 1 year. $3 x 365 = $1095 </p>\n\n<p>One of the most expensive places in the world to buy cigarettes is New York with average prices of around $12. This makes $4380 if you smoke a pack per day.</p>\n\n<p>Each one of you can make the calculation for themselves depending on the price and how much they smoke, but the totals are staggering. Thousands of euro, dollars, pounds which can be invested, staked, borrowed or whatever you can think of, all better than wasting them on this bad habit.</p>\n</div><!-- SC_ON -->",
  "score": 286,
  "permalink": "/r/CryptoCurrency/comments/r1wde2/if_you_are_smoker_quit_and_start_buying_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r1wde2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can't think of worse way to waste your hard earned money. Not only you are\nthrowing them in the bin but you are harming your body as well. I know it's a\npleasure and fun but the money paid for cigarettes pile up day by day, money\nwhich you otherwise can invest in Crypto.\n\nWhere i live a pack of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "稼いだお金を無駄にしないためには、これ以上の方法はないと思います。ゴミ箱に捨てているだけでなく\nゴミ箱に捨てるだけでなく、体にも悪影響を与えているのです。タバコを吸うのは楽しいことです。\n楽しんでいるのはわかりますが、タバコに払うお金は日に日に溜まっていきます。\nそのお金を暗号に投資することができるのです。\n\n私が住んでいるところでは、一箱の...",
      "title": "タバコを吸っている人は禁煙して、暗号を買いましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想不出有什么更糟糕的方式来浪费你辛苦赚来的钱。你不仅是在\n把它们扔进垃圾桶，而且还伤害了你的身体。我知道这是一种\n乐趣，但买烟的钱一天天堆积起来，这些钱你可以投资于加密货币。\n否则你可以投资于加密货币。\n\n在我住的地方，一包...",
      "title": "如果你是吸烟者，请戒烟并开始购买加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想不出有什麼更糟糕的方式來浪費你辛苦賺來的錢。你不僅是在\n把它們扔進垃圾桶，而且還傷害了你的身體。我知道這是一種\n樂趣，但買菸的錢一天天堆積起來，這些錢你可以投資於加密貨幣。\n否則你可以投資於加密貨幣。\n\n在我住的地方，一包...",
      "title": "如果你是吸菸者，請戒菸並開始購買加密貨幣。"
    }
  ]
}