{
  "author": "Two_Pickachu_One_Cup",
  "original_created_utc": 1643928839,
  "title": "Why do people invest in SOL, when cryptocurrencies with 100 percent uptime exist?",
  "created_utc": 1643957082,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s common knowledge here that the SOL network goes down frequently, gets hacked, doesn&amp;#39;t work etc yet people still continue to invest in it. Christ if traditional banking was this flakey the government would haul it over the coals and watch it burn.&lt;/p&gt;\n\n&lt;p&gt;Yet people still invest in this centralized garbage. Litecoin for example (and I am sure there are many other examples that people can name) has had 100 percent uptime with literally no hacks or exploits, yet people label it as a deadcoin that is garbage.&lt;/p&gt;\n\n&lt;p&gt;It brings me to the conclusion that we don&amp;#39;t really care about fundamentals in the crypto space, only juicy profits. &lt;/p&gt;\n\n&lt;p&gt;So it brings me back to the original point of this post, why an earth are people investing in SOL when it is the least secure and reliable chain in crypto?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 321,
  "permalink": "/r/CryptoCurrency/comments/sjwzgk/why_do_people_invest_in_sol_when_cryptocurrencies/",
  "subreddit": "CryptoCurrency",
  "id": "sjwzgk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's common knowledge here that the SOL network goes down frequently, gets\nhacked, doesn't work etc yet people still continue to invest in it. Christ if\ntraditional banking was this flakey the government would haul it over the coals\nand watch it burn.\n\nYet people still invest in this centralized…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SOLのネットワークが頻繁にダウンしていることは、ここでは常識です。\nハッキングされたり、機能しなかったりしても、人々はまだ投資を続けているのです。もし\n伝統的な銀行がこれほど不安定であれば、政府はその銀行を炭火の上に引きずり出すだろう。\nそして、それが燃えるのを見る。\n\nしかし、人々はまだこの中央集権的な...",
      "title": "稼働率100％の暗号通貨が存在するのに、なぜ人々はSOLに投資するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里的人都知道，SOL的网络经常瘫痪，被黑客攻击，无法正常工作。\n黑客攻击，不工作等，但人们仍然继续投资于它。天啊，如果\n如果传统的银行业务如此脆弱，政府会把它拖到煤堆上\n并看着它燃烧。\n\n然而，人们仍然投资于这种集中式的...",
      "title": "既然存在100%正常运行时间的加密货币，人们为什么还要投资于SOL？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏的人都知道，SOL的網絡經常癱瘓，被黑客攻擊，無法正常工作。\n黑客攻擊，不工作等，但人們仍然繼續投資於它。天啊，如果\n如果傳統的銀行業務如此脆弱，政府會把它拖到煤堆上\n並看着它燃燒。\n\n然而，人們仍然投資於這種集中式的...",
      "title": "既然存在100%正常運行時間的加密貨幣，人們爲什麼還要投資於SOL？"
    }
  ]
}