{
  "author": "lifesabatch",
  "original_created_utc": 1625754051,
  "title": "Digibyte is out of the Top 100 for the first time in its 7 1/2 Year History",
  "created_utc": 1625770147,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see that the Nano post was getting a lot of action for leaving the Top 100 (which it has done previously). Digibyte on the other hand is 1 of only 6 (Now 5) cryptos to have remained in the Top 100 since Q1 of 2014.</p>\n\n<p>The dev Team for Digibyte is on the Verge of releasing Version 8, which brings:</p>\n\n<p>-ProgPoW mining upgrade</p>\n\n<p>-RandomX mining upgrade</p>\n\n<p>-Schnorr Sigs</p>\n\n<p>-Taproot</p>\n\n<ul>\n<li>Plus many more minor upgrades</li>\n</ul>\n\n<p>DigiAssetX and DigiAssets Version 3 is also set to be released any day, which will allow for much better decentralized platforms for its NFTs, Dapps, Smart Contracts, etc.</p>\n\n<p>The Digibyte Foundation is announcing new partnerships almost weekly.</p>\n\n<p>Wrapped DGB via RenDGB is allowing yield farming and yield generation via the wrapped tokens.</p>\n\n<p>I guess what I&#39;m trying to say is.....this market blows. Dog Tokens, Food Tokens, and centralized garbage and outright scams remain and continue to thrive due to market manipulation and false marketing, yet Digibyte with tons of things to be excited about is being suppressed.</p>\n\n<p>Now I know none of that stuff is new to this space and Digibyte has survived all the previous cycles of trash in this space, but what is different this time is the blatant shadow ban that these large exchanges are placing on decentralization. They are listing any coin willing or capable of paying listing fees, but still ignore decentralized coins with no centralized funds to pay the ransom. Coins like Digibyte, Monero, and Nano are not just ignored, but seem to be blacklisted from the big players (Coinbase, Kraken, Gemini, Binance US, etc). Ask yourself why? Honestly the trading fee revenues would be much higher on these coins then some shit token absolutely nobody wants or trades. Sure it&#39;s not an instant ransom, but it would be much more profitable long term for these companies and support decentralization and sustainability. So why?</p>\n\n<p>/End Rant</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/og86hp/digibyte_is_out_of_the_top_100_for_the_first_time/",
  "subreddit": "CryptoCurrency",
  "id": "og86hp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see that the Nano post was getting a lot of action for leaving the Top 100\n(which it has done previously). Digibyte on the other hand is 1 of only 6 (Now\n5) cryptos to have remained in the Top 100 since Q1 of 2014.\n\nThe dev Team for Digibyte is on the Verge of releasing Version 8, which brings:\n\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナノの投稿がトップ100から外れたことで、多くの反響を呼んでいたようですが\n以前にもありましたが）。一方、Digibyteはたった6つ（現在は5つ）のクリプトのうちの1つです。\n5）のうちの1つです。\n\nDigibyteの開発チームは、バージョン8のリリースを目前にしており、以下のような特徴があります。\n\n...",
      "title": "Digibyte社が7年半の歴史の中で初めてトップ100から外れたことについて"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到Nano的帖子因为离开了前100名而得到了很多的行动\n(它以前也这样做过)。另一方面，Digibyte是仅有的6个（现在是\n5个）加密货币中的一个，自2014年第一季度以来一直保持在前100名。\n\nDigibyte的开发团队即将发布第8版，它将带来:\n\n...",
      "title": "Digibyte在其7年半的历史中首次跌出前100名"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到Nano的帖子因爲離開了前100名而得到了很多的行動\n(它以前也這樣做過)。另一方面，Digibyte是僅有的6個（現在是\n5個）加密貨幣中的一個，自2014年第一季度以來一直保持在前100名。\n\nDigibyte的開發團隊即將發佈第8版，它將帶來:\n\n...",
      "title": "Digibyte在其7年半的歷史中首次跌出前100名"
    }
  ]
}