{
  "author": "Kleecarim",
  "the_new_excerpt": "(disclaimer: I have no idea how to flair this, so I just put it under self\nstory)\n\nI feel like most people (especially newbies) on this sub are like me, and\nconstantly check their portfolio 24/7. The first thing we do after waking up is\nchecking out exchange, then we spend hours a day researching…",
  "original_created_utc": 1619736582,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "(免責事項：どのようにフレアをかけるかわからないので、自己紹介の下に入れておきました\nストーリー)\n\nこのサブにいるほとんどの人（特に初心者）は、私と同じように、24時間365日、常に自分のポートフォリオをチェックしているように感じます。\n24時間365日、常に自分のポートフォリオをチェックしています。目覚めて最初にすることは\nそして、1日に何時間もかけて研究しています。",
      "title": "ここにいるほとんどの人（私も含めて）は、暗号通貨に関して不健康な習慣を持っていて、それを演じているように感じます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "(免责声明：我不知道如何炫耀这个，所以我只是把它放在自我\n故事）。)\n\n我觉得这个网站上的大多数人（尤其是新手）都像我一样，24小时不停地查看自己的作品。\n不断检查他们的作品集，24/7。我们醒来后做的第一件事就是\n检查交流，然后我们每天花几个小时来研究......",
      "title": "我觉得这里的大多数人（包括我自己）都有关于加密货币的不健康的习惯，并把它淡化了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(免責聲明：我不知道如何炫耀這個，所以我只是把它放在自我\n故事）。)\n\n我覺得這個網站上的大多數人（尤其是新手）都像我一樣，24小時不停地查看自己的作品。\n不斷檢查他們的作品集，24/7。我們醒來後做的第一件事就是\n檢查交流，然後我們每天花幾個小時來研究......",
      "title": "我覺得這裏的大多數人（包括我自己）都有關於加密貨幣的不健康的習慣，並把它淡化了"
    }
  ],
  "title": "I feel like most people here (including myself) have unhealthy habits regarding cryptocurrency and play it down",
  "created_utc": 1619760633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(disclaimer: I have no idea how to flair this, so I just put it under self story)</p>\n\n<p>I feel like most people (especially newbies) on this sub are like me, and constantly check their portfolio 24/7. The first thing we do after waking up is checking out exchange, then we spend hours a day researching and thinking about all the amazing project out there. While this doesn&#39;t necessarily have to be a bad thing, I am sure a lot of people get too sucked up and are really emotional about their investments.</p>\n\n<p>We all want to make gains, but constantly checking won&#39;t help, it will only lead to stress. Cryptos are amazing and its easy to get sucked up in this huge new world full of promising technology, but we all have to think about our mental health, too</p>\n\n<p>So what I want to say is relax, take a step back and hodl for the long term. Day trading will most likely be less efficient for you anyways, so why bother checking the charts every few minutes? Just buy crypto and stay informed, but don&#39;t forget about all of your other hobbies. Do things that make you happy and see crypto as what is: an investment, not a hobby.</p>\n\n<p>I kinda want to add that part of the reason why I wrote this post is that I want to stop myself from behaving like this lol</p>\n</div><!-- SC_ON -->",
  "score": 256,
  "permalink": "/r/CryptoCurrency/comments/n1gflc/i_feel_like_most_people_here_including_myself/",
  "subreddit": "CryptoCurrency",
  "id": "n1gflc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961449
}