{
  "author": "Kleecarim",
  "original_created_utc": 1628668099,
  "title": "I hate how everything crypto related is centered around the US",
  "created_utc": 1628685312,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Disclaimer: I do not intend to insult anyone coming from the US, nor do I want to say the US in general is bad</p>\n\n<p>With that out of the way, let me start my rant. It is so annoying to me that crypto, which is supposed to be decentralized and international, is centered so heavily around the US. Whenever there are some new laws to regulate crypto in the US (like at the moment), everyone is calling it &quot;the end of crypto&quot;, prices start dropping and a lot if people get bearish. But whenever any other country does the same thing, noone gives a shit. Germany just allowed Spezialfonds to allocate 20% of their capital into crypto but for some reason this didn&#39;t really make the news, but a bill from the US to tax the shit out of stakers/miners made everyone go insane</p>\n\n<p>I get that the US is a powerful country and a worldwide economic leader, but I hate how regional regulations affect cryptocurrency as a whole. This is just annoying to everyone living in a different country</p>\n\n<p>With this being said, I know this probably won&#39;t change in the near future, since, as I mentioned, the US is a, if not the leading county in the global economy</p>\n</div><!-- SC_ON -->",
  "score": 518,
  "permalink": "/r/CryptoCurrency/comments/p28g75/i_hate_how_everything_crypto_related_is_centered/",
  "subreddit": "CryptoCurrency",
  "id": "p28g75",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Disclaimer: I do not intend to insult anyone coming from the US, nor do I want\nto say the US in general is bad\n\nWith that out of the way, let me start my rant. It is so annoying to me that\ncrypto, which is supposed to be decentralized and international, is centered so\nheavily around the US. Whenever…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "免責事項：アメリカから来た人を侮辱するつもりはありません。\nアメリカが悪いと言いたいわけではありません。\n\nそれはさておき、私の暴言を始めさせていただきます。私にとって非常に腹立たしいことに\n非中央集権的で国際的であるはずの暗号が、米国を中心にしているのはとても腹立たしいことです。\nアメリカを中心にしていることに腹が立ちます。いつでも...",
      "title": "暗号関連がすべてアメリカ中心になっているのが嫌だ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：我无意侮辱任何来自美国的人，也不想说美国普遍不好。\n说美国总体上是坏的\n\n说完这些，让我开始我的咆哮。对我来说，非常恼火的是\n本应是去中心化和国际化的加密货币，却如此以美国为中心\n严重地围绕着美国。每当...",
      "title": "我讨厌一切与加密货币有关的东西都以美国为中心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：我無意侮辱任何來自美國的人，也不想說美國普遍不好。\n說美國總體上是壞的\n\n說完這些，讓我開始我的咆哮。對我來說，非常惱火的是\n本應是去中心化和國際化的加密貨幣，卻如此以美國爲中心\n嚴重地圍繞着美國。每當...",
      "title": "我討厭一切與加密貨幣有關的東西都以美國爲中心。"
    }
  ]
}