{
  "author": "iPEEonCLOWNS",
  "original_created_utc": 1633007968,
  "title": "Starting off in BTC with my Dad, shortly before he passed away…and a word on DCA",
  "created_utc": 1633019653,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I first learned about Bitcoin in 2012, but started buying towards the end of the 2017 bullrun.  My father was a coin collector since he was a kid, and even though he was now in his 70s and physically not well, he was still very intrigued by crypto and virtual coins. </p>\n\n<p>My Dad was a technology enthusiast his whole life. He worked in healthcare but tech was his passion. I can remember he bought a 1.0 Megapixel Olympus Digital Camera when it first came out, and the first CD-R on the market (I think it was a 2x Plextor). The first Betamax and VHS players, and was always building his own computers. He was never great with money, we always seemed to be in debt, but he loved his tech and we had fun!</p>\n\n<p>Anyway, I made a couple small BTC purchases through a centralized exchange and told my Dad about it in early December 2017. He was excited! My Dad texted me that evening with an article, saying that I should probably purchase a hardware wallet. That was my last communication with him. </p>\n\n<p>I planned to go see him the next morning for lunch which was our usual Saturday activity. I got a call that morning at about 4:30 AM from the local police dept that my Dad was found unresponsive in his car and had been transported to the local hospital. He usually left at 4 AM to drive himself in for kidney dialysis 3 days a week. </p>\n\n<p>I jumped in my car and sped to the hospital; on the way there, I called and asked to speak to someone in the ER. I identified myself, and asked about the condition of my father. They said they couldn’t tell me any info on the phone because of HIPAA. I said “fine, let me speak to him.” Silence on the other end. And at that point driving towards the hospital, I knew he was already gone and it broke me. When I walked in, they tried to sit me down and I said “I already know, just let me see him.” I was devastated. I took a deep dive into crypto the following weeks to learn as much as I could, and it was a good distraction looking back. </p>\n\n<p>The point of my story: my Dad left me a small monthly annuity when he passed, not a lot, but something. I never really got the chance to sit down with him and discuss crypto in depth. It’s something I daydream about often. I wouldn’t have been able to discuss it with anyone else in real life except him, still can’t, so here I am on Reddit. I decided to DCA the exact amount of the annuity every month into crypto from January 2018 onward. I tell myself that it’s like I’m investing in crypto with my Dad, and that gives me some comfort. DCA works quite well by the way it you’re patient! Give it time! It works! </p>\n\n<p>BTW, Don’t count out all the boomers out there folks, there’s a good chunk of them that do/would love this tech and see how amazing it is given the right conditions and guidance. Let’s be inclusive.</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/Bitcoin/comments/pyjm5k/starting_off_in_btc_with_my_dad_shortly_before_he/",
  "subreddit": "Bitcoin",
  "id": "pyjm5k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I first learned about Bitcoin in 2012, but started buying towards the end of the\n2017 bullrun. My father was a coin collector since he was a kid, and even though\nhe was now in his 70s and physically not well, he was still very intrigued by\ncrypto and virtual coins.\n\nMy Dad was a technology…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が初めてビットコインを知ったのは2012年ですが、買い始めたのは\n2017年のブルランの終わり頃から買い始めました。私の父は子供の頃からコイン収集家で、70代になって体が弱っても\n70代になって体調が悪くなっても、クリプトや仮想コインにとても興味を持っていました。\nクリプトやバーチャルコインに興味を持っていました。\n\n父はテクノロジー...",
      "title": "父が亡くなる直前に、父と一緒にBTCでスタートしたこと...そして、DCAについて一言"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我第一次了解比特币是在2012年，但在2017年牛市结束时开始购买。\n2017年的牛市。我的父亲从小就是一个硬币收藏家，尽管他现在已经70多岁了，身体也不好，但他仍然很感兴趣。\n他现在已经70多岁了，身体也不好，但他仍然对加密货币非常感兴趣。\n加密货币和虚拟钱币。\n\n我的父亲是一个技术...",
      "title": "在我父亲去世前不久，和他一起在BTC开始工作......还有关于DCA的一句话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我第一次瞭解比特幣是在2012年，但在2017年牛市結束時開始購買。\n2017年的牛市。我的父親從小就是一個硬幣收藏家，儘管他現在已經70多歲了，身體也不好，但他仍然很感興趣。\n他現在已經70多歲了，身體也不好，但他仍然對加密貨幣非常感興趣。\n加密貨幣和虛擬錢幣。\n\n我的父親是一個技術...",
      "title": "在我父親去世前不久，和他一起在BTC開始工作......還有關於DCA的一句話"
    }
  ]
}