{
  "author": "Rh4bdo",
  "original_created_utc": 1639781229,
  "title": "Is it unusual for an adult to have no desire to leave the house unless it's for work?",
  "created_utc": 1639803590,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I&amp;#39;ll make this short. I work full time in health care and interact with patients constantly, see my spouse every day at home. When I&amp;#39;m not at work, I&amp;#39;m at home- it&amp;#39;s either work or home and I will actively make excuses not to leave the house unless I really need to. I&amp;#39;ve never been diagnosed with depression, nor do I feel depressed. Leaving the house honestly just feels like a giant chore to me and I&amp;#39;m not sure why. Is this just a normal part of adulthood for many of us or am I just kicking the boring bucket early?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/riswy6/is_it_unusual_for_an_adult_to_have_no_desire_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "riswy6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi, I'll make this short. I work full time in health care and interact with\npatients constantly, see my spouse every day at home. When I'm not at work, I'm\nat home- it's either work or home and I will actively make excuses not to leave\nthe house unless I really need to. I've never been diagnosed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハイ、手短に言いますね。私はフルタイムで医療に携わっており、以下のようなことを行っています。\n患者さんが絶えず、家では配偶者と毎日顔を合わせています。仕事以外の時間は\n自宅では、仕事か自宅かのどちらかで、積極的に言い訳をして外出しないようにしています。\n本当に必要な時以外は、家にいない。私は診断されたことがない...",
      "title": "仕事でもない限り、家から出たくないというのは、大人として珍しいことなのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我就长话短说吧。我在卫生保健部门全职工作，经常与病人打交道。\n病人，每天在家里看到我的配偶。当我不在工作时，我就在家里。\n我不是在工作，就是在家里，而且我会主动找借口不出门，除非我真的需要。\n除非我真的需要，否则我会主动找借口不离开家。我从来没有被诊断出...",
      "title": "一个成年人没有离开家的欲望，除非是为了工作，这很不正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我就長話短說吧。我在衛生保健部門全職工作，經常與病人打交道。\n病人，每天在家裏看到我的配偶。當我不在工作時，我就在家裏。\n我不是在工作，就是在家裏，而且我會主動找藉口不出門，除非我真的需要。\n除非我真的需要，否則我會主動找藉口不離開家。我從來沒有被診斷出...",
      "title": "一個成年人沒有離開家的慾望，除非是爲了工作，這很不正常嗎？"
    }
  ]
}