{
  "author": "Evolved_Dojo",
  "original_created_utc": 1635939053,
  "title": "Why in the hell is Squid Game pumping again?",
  "created_utc": 1635946483,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m honestly speechless. It was an obvious scam/rug pull from the beginning (read the white paper if you haven&#39;t already, it gave me a good laugh), and yet it&#39;s up 361% in 24 hours according to coinmarketcap, despite the fact that you still can&#39;t sell it for a profit. </p>\n\n<p>Some people will never learn, they&#39;ll chase the FOMO, chug the Kool aid, and light themselves on fire while they&#39;re still recovering in the burn unit from chasing the previous pump.</p>\n\n<p>Don&#39;t be like these people, come up with a strategy and stick to it, use limit order if it makes it easier for you. Happy trading everyone. </p>\n\n<p>TL;DR do your research before you buy into a project, not after. This seems to be becoming less of a norm in crypto.</p>\n</div><!-- SC_ON -->",
  "score": 335,
  "permalink": "/r/CryptoCurrency/comments/qlsfv2/why_in_the_hell_is_squid_game_pumping_again/",
  "subreddit": "CryptoCurrency",
  "id": "qlsfv2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm honestly speechless. It was an obvious scam/rug pull from the beginning\n(read the white paper if you haven't already, it gave me a good laugh), and yet\nit's up 361% in 24 hours according to coinmarketcap, despite the fact that you\nstill can't sell it for a profit.\n\nSome people will never learn,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直言って言葉が出ません。最初から明らかな詐欺・悪徳商法だったのに\n(まだ読んでいない方はホワイトペーパーを読んでみてください、大笑いしました）、それなのに\nにもかかわらず、coinmarketcapによると24時間で361％も上昇しています。\nまだ利益を得るために売ることはできません。\n\n懲りない人もいるものですね、、、。",
      "title": "なんでまたイカゲーが盛り上がってんの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，我很无语。这从一开始就是一个明显的骗局/毒品交易\n(如果你还没有读过白皮书，它让我笑得很开心），然而\n根据coinmarketcap的数据，它在24小时内上涨了361%，尽管事实上你仍然不能把它卖掉。\n尽管你仍然无法出售它以获得利润。\n\n有些人永远不会学会，...",
      "title": "鱿鱼游戏到底为什么又在抽水？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，我很無語。這從一開始就是一個明顯的騙局/毒品交易\n(如果你還沒有讀過白皮書，它讓我笑得很開心），然而\n根據coinmarketcap的數據，它在24小時內上漲了361%，儘管事實上你仍然不能把它賣掉。\n儘管你仍然無法出售它以獲得利潤。\n\n有些人永遠不會學會，...",
      "title": "魷魚遊戲到底爲什麼又在抽水？"
    }
  ]
}