{
  "author": "katzenpflanzen",
  "original_created_utc": 1644962832,
  "title": "I'm reading about the Aztecs and the Maya and it seems that being killed in a sacrifice was a normal and socially accepted way of ending one's life. My question is: did they mourn their dead? Did they feel the absence of loved ones? Did they feel attached to one another?",
  "created_utc": 1644995739,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What makes me come up with this question is the realization that, in most societies, dead is something that people try to avoid at all costs, especially for their loved ones.&lt;/p&gt;\n\n&lt;p&gt;It seems to me (I may be wrong) that in Mesoamerican societies, people didn&amp;#39;t consider ending one another&amp;#39;s life was wrong, that it was a normal part of their culture. And what, to my eyes, is murder, for them was something positive or neutral.&lt;/p&gt;\n\n&lt;p&gt;My question comes after the realization that, for people to be ok with human sacrifice, not considering it murder but something normal or even good, they must accept that it happens to people they love. And accepting it as something good or neutral. How did they deal with this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/sterwl/im_reading_about_the_aztecs_and_the_maya_and_it/",
  "subreddit": "AskHistorians",
  "id": "sterwl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What makes me come up with this question is the realization that, in most\nsocieties, dead is something that people try to avoid at all costs, especially\nfor their loved ones.\n\nIt seems to me (I may be wrong) that in Mesoamerican societies, people didn't\nconsider ending one another's life was wrong,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この問いを思いついたのは、ほとんどの場合において、そのようなことはない。\n社会では、死は何としても避けようとするものです。\n大切な人のために。\n\nメソアメリカの社会では、（間違っているかもしれませんが）人々は\n互いの人生を終わらせることが悪いことだと考えていた、、、。",
      "title": "アステカやマヤについて読んでいるのですが、生け贄として殺されることは、人生の終わり方として普通であり、社会的にも受け入れられていたようです。私の疑問は、彼らは死者を悼んだのでしょうか？愛する人の不在を感じたのでしょうか？彼らはお互いに愛着を感じていたのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是什么让我想到这个问题的呢？\n社会中，人们试图不惜一切代价避免死亡，尤其是对他们的亲人而言。\n为他们所爱的人。\n\n在我看来（我可能是错的），在中美洲社会，人们并不\n认为结束彼此的生命是错误的，...",
      "title": "我正在阅读关于阿兹特克人和玛雅人的资料，似乎在祭祀中被杀是一种正常的、被社会接受的结束生命的方式。我的问题是：他们是否为死者哀悼？他们感受到亲人的离去吗？他们是否觉得彼此相依为命？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是什麼讓我想到這個問題的呢？\n社會中，人們試圖不惜一切代價避免死亡，尤其是對他們的親人而言。\n爲他們所愛的人。\n\n在我看來（我可能是錯的），在中美洲社會，人們並不\n認爲結束彼此的生命是錯誤的，...",
      "title": "我正在閱讀關於阿茲特克人和瑪雅人的資料，似乎在祭祀中被殺是一種正常的、被社會接受的結束生命的方式。我的問題是：他們是否爲死者哀悼？他們感受到親人的離去嗎？他們是否覺得彼此相依爲命？"
    }
  ]
}