{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "Russian Deputy Prime Minister Alexander Novak said on Monday that if the United States and the European Union banned oil imports from Russia, international oil prices could climb to more than $300 a barrel.\n\"It is clear that rejecting Russian oil will have disastrous consequences for the global market and harm the interests of consumers,\" Novak said in a video statement broadcast on state television\n\"The surge in oil prices will be unpredictable. If not too high, it will reach $300 a barrel.\"\nNovak said that it will take Europe more than a year to replace Russian oil, and it will have to pay a much higher price than Russian oil.\nNovak said that Russia's oil exports can shift from the European market to other markets, for which Russia has made all preparations. In addition, the failure of European energy policy will lead to soaring oil and gas prices, which has nothing to do with Russia. Russia has fully fulfilled its obligations to supply natural gas, oil and petroleum products to Europe.\n\"European politicians need to be honest about what will happen to their citizens and consumers. If you really want to reject Russia's energy supply, do it, and we're ready,\" Novak said\nNovak warned that due to the sanctions on the \"Beixi 2\" project, Russia also has the right to stop transporting natural gas through the \"Beixi 1\" transmission pipeline, but Russia did not do so. However, the statements and accusations made by European politicians against Russia pushed us to that step.\nStatement of European and American countries\nOn the issue of whether to continue to use Russian energy, German Chancellor Scholz made it clear on Monday that it is impossible to completely eliminate the import of energy from Russia in the short term. \"At present, there is no other way to ensure the supply of heating, transportation, electricity and industrial energy in Europe. Energy from Russia is very important for citizens' daily life. So we decided to continue to cooperate with Russia in the field of energy supply.\"\nBritish Prime Minister Boris Johnson said on Monday that in the face of tensions between Russia and Ukraine, Britain will \"gradually\" get rid of its dependence on Russian oil and gas. He also called on western countries to work together to ensure energy alternatives. The UK will formulate a new energy supply strategy in the coming days and pointed out that the UK is considering using more of its own fossil fuels.\nBut he also stressed that the UK has not given up its commitment to reduce carbon emissions. At present, the UK imports less than 5% of its natural gas from Russia.\nIn the United States, both houses of Congress announced a bill aimed at stopping energy imports from Russia on Monday, which may be put to a vote this week. However, White House press secretary pusaki said Biden had not yet decided whether to sign the bill banning the import of Russian oil if Congress sent it to the president's desk.",
  "author_fullname": "t2_h9vowh19",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Russia warns that if Western countries refuse to import Russian oil, oil prices will soar to more than $300",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_t9g3yk",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.93,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 2550,
  "total_awards_received": 1,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 2550,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "self",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1646743786,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Russian Deputy Prime Minister Alexander Novak said on Monday that if the United States and the European Union banned oil imports from Russia, international oil prices could climb to more than $300 a barrel.\n&amp;quot;It is clear that rejecting Russian oil will have disastrous consequences for the global market and harm the interests of consumers,&amp;quot; Novak said in a video statement broadcast on state television\n&amp;quot;The surge in oil prices will be unpredictable. If not too high, it will reach $300 a barrel.&amp;quot;\nNovak said that it will take Europe more than a year to replace Russian oil, and it will have to pay a much higher price than Russian oil.\nNovak said that Russia&amp;#39;s oil exports can shift from the European market to other markets, for which Russia has made all preparations. In addition, the failure of European energy policy will lead to soaring oil and gas prices, which has nothing to do with Russia. Russia has fully fulfilled its obligations to supply natural gas, oil and petroleum products to Europe.\n&amp;quot;European politicians need to be honest about what will happen to their citizens and consumers. If you really want to reject Russia&amp;#39;s energy supply, do it, and we&amp;#39;re ready,&amp;quot; Novak said\nNovak warned that due to the sanctions on the &amp;quot;Beixi 2&amp;quot; project, Russia also has the right to stop transporting natural gas through the &amp;quot;Beixi 1&amp;quot; transmission pipeline, but Russia did not do so. However, the statements and accusations made by European politicians against Russia pushed us to that step.\nStatement of European and American countries\nOn the issue of whether to continue to use Russian energy, German Chancellor Scholz made it clear on Monday that it is impossible to completely eliminate the import of energy from Russia in the short term. &amp;quot;At present, there is no other way to ensure the supply of heating, transportation, electricity and industrial energy in Europe. Energy from Russia is very important for citizens&amp;#39; daily life. So we decided to continue to cooperate with Russia in the field of energy supply.&amp;quot;\nBritish Prime Minister Boris Johnson said on Monday that in the face of tensions between Russia and Ukraine, Britain will &amp;quot;gradually&amp;quot; get rid of its dependence on Russian oil and gas. He also called on western countries to work together to ensure energy alternatives. The UK will formulate a new energy supply strategy in the coming days and pointed out that the UK is considering using more of its own fossil fuels.\nBut he also stressed that the UK has not given up its commitment to reduce carbon emissions. At present, the UK imports less than 5% of its natural gas from Russia.\nIn the United States, both houses of Congress announced a bill aimed at stopping energy imports from Russia on Monday, which may be put to a vote this week. However, White House press secretary pusaki said Biden had not yet decided whether to sign the bill banning the import of Russian oil if Congress sent it to the president&amp;#39;s desk.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "t9g3yk",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "lilyxu185",
  "discussion_type": null,
  "num_comments": 519,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/t9g3yk/russia_warns_that_if_western_countries_refuse_to/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/t9g3yk/russia_warns_that_if_western_countries_refuse_to/",
  "subreddit_subscribers": 11726098,
  "created_utc": 1646763723,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1646743786,
  "the_new_excerpt": "Russian Deputy Prime Minister Alexander Novak said on Monday that if the United\nStates and the European Union banned oil imports from Russia, international oil\nprices could climb to more than $300 a barrel. \"It is clear that rejecting\nRussian oil will have disastrous consequences for the global…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロシアのアレクサンダー・ノバク副首相は月曜日、もし米国が... 続きを読む\n米国と欧州連合がロシアからの原油輸入を禁止すれば、国際石油\nは1バレル300ドル以上まで上昇する可能性があります。\"拒否することは明らかである\nロシアの石油は、世界にとって悲惨な結果をもたらすだろう。",
      "title": "ロシアは、欧米諸国がロシアの石油の輸入を拒否すれば、石油価格は300ドル以上に高騰すると警告している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "俄罗斯副总理亚历山大-诺瓦克周一表示，如果美国和日本\n美国和欧盟禁止从俄罗斯进口石油，国际石油\n国际油价可能攀升至每桶300美元以上。\"很明显，拒绝\n俄罗斯石油将对全球经济产生灾难性的后果。",
      "title": "俄罗斯警告说，如果西方国家拒绝进口俄罗斯石油，油价将飙升至300美元以上"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "俄羅斯副總理亞歷山大-諾瓦克週一表示，如果美國和日本\n美國和歐盟禁止從俄羅斯進口石油，國際石油\n國際油價可能攀升至每桶300美元以上。\"很明顯，拒絕\n俄羅斯石油將對全球經濟產生災難性的後果。",
      "title": "俄羅斯警告說，如果西方國家拒絕進口俄羅斯石油，油價將飆升至300美元以上"
    }
  ],
  "source_updated_at": 1646991707693
}