{
  "author": "sfjetsetter",
  "the_new_excerpt": "I know you guys are probably sick of hearing GME related stuff but I really\nwanted to post this here to get some additional thoughts/feedback from\nexperienced investors.\n\nLong post ahead, but I encourage you to read the whole thing.\n\nTLDR: Data points strongly point to Hedge Funds using tricks to…",
  "original_created_utc": 1612502940,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我知道你们可能听厌了与GME相关的东西，但我真的是\n我想把这个贴在这里，以获得一些额外的想法/反馈。\n经验丰富的投资者。\n\n前面的文章很长，但我鼓励你读完。\n\nTLDR：数据点强烈指向对冲基金使用技巧，以...",
      "title": "证据指向短线没有覆盖假装覆盖(通过期权)来打破压制(要求反馈)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道你們可能聽厭了與GME相關的東西，但我真的是\n我想把這個貼在這裏，以獲得一些額外的想法/反饋。\n經驗豐富的投資者。\n\n前面的文章很長，但我鼓勵你讀完。\n\nTLDR：數據點強烈指向對沖基金使用技巧，以...",
      "title": "證據指向短線沒有覆蓋假裝覆蓋(通過期權)來打破壓制(要求反饋)"
    }
  ],
  "title": "Evidence pointing to shorts did not cover pretended they did (via options) to break the squeeze (Feedback requested)",
  "created_utc": 1612513228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know you guys are probably sick of hearing GME related stuff but I really wanted to post this here to get some additional thoughts/feedback from experienced investors.</p>\n\n<p>Long post ahead, but I encourage you to read the whole thing.</p>\n\n<p>TLDR: Data points strongly point to Hedge Funds using tricks to appear as if they covered their shorts when they haven&#39;t truly covered. Full version below.</p>\n\n<p>There’s an insightful piece on <a href=\"https://tradesmithdaily.com/investing-strategies/the-drop-in-gamestop-short-interest-could-be-real-or-deceptive-market-manipulation/\">https://tradesmithdaily.com/investing-strategies/the-drop-in-gamestop-short-interest-could-be-real-or-deceptive-market-manipulation/</a> that identifies there are two ways for both short interest and price to fall quickly.</p>\n\n<p>First way is retail investors not holding the line and panic selling thereby driving the price down further, releasing into the market more of the float and enabling shorts to cover/buy back shares at progressively lower levels.</p>\n\n<p>**</p>\n\n<p>Quoting from Tradesmithdaily:</p>\n\n<p>Plummeting short interest along with a plummeting GME share price, in other words, could indicate that the Reddit army is headed for the hills, and the longs were selling early, giving the shorts a means to cover, as the longs got out… Important to note that if the long holders of GME shares did not break ranks and sell en masse, it would have been impossible for the share price to fall and hedge fund short interest to fall at the same time. because, without a critical mass of long-side holders selling into the market, the hedge funds covering their shorts would have nobody to buy from as they covered (bought back) their short positions.</p>\n\n<p>**</p>\n\n<p>However the other scenario where this can occur is the hedge fund short interest in GME didn’t really dissipate but instead they played a trick to make it seem like it did, demoralizing the retail side and further “breaking the squeeze.”</p>\n\n<p>**</p>\n\n<p>To now quote verbatim from Tradesmithdaily:</p>\n\n<p>The way the hedge funds could have done this — made it appear as if they covered their shorts, even when they really didn’t — involves trickery in the options market.</p>\n\n<p>The tactics involved are not a secret. In fact, the Securities and Exchange Commission (SEC) knows all about such tactics, and published a “risk alert” memo on the topic in August 2013.</p>\n\n<p>The SEC memo is titled “Strengthening Practices for Preventing and Detecting Illegal Options Trading Used to Reset Reg SHO Close-out Obligations.” You can <a href=\"https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf\">read it here via the SEC website</a>.</p>\n\n<p>The memo contains a dozen pages of highly technical language, but here’s a quick rundown:</p>\n\n<ul>\n<li>If short sellers are facing a squeeze because shares are hard to buy, or scrutiny for holding an illegal short position, they can create an appearance of having closed their short position through the use of deceptive options trades.</li>\n<li>A hedge fund that is short a stock can write call options on a stock — meaning they are now “short” the call options, having sold the call options to someone else (typically a market maker) — and simultaneously buy shares against the call options.</li>\n<li>The shares bought against the call options could be “synthetic” longs — meaning they are not part of the original share float of the stock — as sold to the hedge fund by the market maker that takes the other side of the options trade.</li>\n<li>This works because, if a market maker buys options from an options writer, the market maker has legal privileges to do a version of “naked shorting” as part of their hedging function. This is necessary, under the current rules and the current system, for market makers to protect themselves when facilitating options trades.</li>\n<li>As a result of the above transaction, the hedge fund that sold short calls was able to buy synthetic long shares against the calls. (A synthetic share is one that has a long on one side and a short on the other but wasn’t part of the original float.) The synthetic long shares are the other side of the naked shorts, legally initiated by the market maker, so the market maker can hedge.</li>\n<li>The hedge fund that bought the shares can now report that they have “bought back” their short position via buying long shares — except they actually haven’t! The synthetic shares they bought are canceled out against the short call positions they initiated, a necessity of the maneuver by way of the market maker’s hedging of the call position they bought from the hedge fund.</li>\n</ul>\n\n<p>It gets very complicated, very fast.</p>\n\n<p>But the gist is that hedge funds can use tricks to make it look like they’ve covered their shorts — even if they haven’t truly covered, and can’t, for lack of available float — by way of exploiting loopholes that exist due to an interplay of reporting rule delays, market maker naked shorting exceptions, and legal practices of synthetic share creation (new longs and shorts made from thin air) relating to market-making.</p>\n\n<p>Below is a section of the SEC memo (from page 8) that gets to the heart of it:</p>\n\n<p><em>“Trader A may enter a buy-write transaction, consisting of selling deep-in-the-money calls and buying shares of stock against the call sale. By doing so, Trader A appears to have purchased shares to meet the broker-dealer’s close-out obligation for the fail to deliver that resulted from the reverse conversion. In practice, however, the circumstances suggest that Trader A has no intention of delivering shares, and is instead re-establishing or extending a fail position.</em>”</p>\n\n<p>**</p>\n\n<p>In short (no pun intended) these tricks “help hedge funds maintain short positions that, legally speaking, they weren’t supposed to have because the shares were never properly located”, which triggers alarm bells when we consider the extraordinarily high amount of FTIDs/Failed to Deliver Shares (<a href=\"https://wherearetheshares.com/\">https://wherearetheshares.com/</a>) and Michael Burry’s (now deleted tweet viewable here <a href=\"https://web.archive.org/web/20210130030954/https://twitter.com/michaeljburry?lang=en\">https://web.archive.org/web/20210130030954/https://twitter.com/michaeljburry?lang=en</a>) about how when he called back shares he lent out, brokers took weeks to actually find them with the implication they could not be located.</p>\n\n<p>These factors lend credence to the idea that shorts weren’t really covered but were given the impression of being covered with trickery using options, in order to “cover” short positions that they shouldn’t have had to begin with because shares were never properly located.</p>\n\n<p>Separately but potentially related, S3 released updated short numbers last Sunday reducing from their projection of short interest from 122% to 113% (a day later on Friday) to 55% on Sunday (while markets were closed therefore in my estimation using the same data set that calculated 113%), which many found to be suspicious. Later it was found that this new number was calculated using the same data set that yielded 122% short interest percentage, but with the significant difference of adding synthetic long shares into the short float equation which is against standard practice.</p>\n\n<p>For a more detailed breakdown a user here pasted a good analysis of how those numbers were reached <a href=\"https://www.reddit.com/r/wallstreetbets/comments/laoaru/read_this_they_are_screwed_numbers_dont_lie/\">https://www.reddit.com/r/wallstreetbets/comments/laoaru/read_this_they_are_screwed_numbers_dont_lie/</a></p>\n\n<p>**</p>\n\n<p>Excerpt:</p>\n\n<p>The real short % according to S3&#39;s data is 122%. However, their 55% figure is technically not a lie, but extremely misleading. I will explain everything.</p>\n\n<p>Here is what they did:Sources (S3 head):<a href=\"https://twitter.com/ihors3/status/1355990194575564801?s=19\">https://twitter.com/ihors3/status/1355990194575564801?s=19</a><a href=\"https://twitter.com/ihors3/status/1356004816414269448\">https://twitter.com/ihors3/status/1356004816414269448</a><a href=\"https://twitter.com/ihors3/status/1355969693841051650\">https://twitter.com/ihors3/status/1355969693841051650</a></p>\n\n<p>S3 head is redefining share float to include shares that don&#39;t exist in order to be able to say shorted % of float is lower.</p>\n\n<p>it reduces the traditional SI % Float, Instead of Shares Shorted/Float our calc is Shares Shorted/ (Float + Shares Shorted)</p>\n\n<p>So, by this definition, if a stock is shorted 400% of existing shares (total banana count borrowed and resold 4x) and total shares is 100, short % is calculated like this:400 shorts / (100 shares + 400 longs whose shares are borrowed) = 0.8That is, the normal way we define short % would say it&#39;s 400% shorted. S3&#39;s way says 80%.</p>\n\n<p>Knowing this formula, we can work back to what S3 would have said the short % of float was using the normal definition of short % of float:55% short of float means for all existing shares + shorts (or, ont he other side of the trade &quot;longs whose shares were borrowed away to short&quot;) is 55/45 as much as existing shares. Meaning, portion of shares short by the normal definition (% of existing bananas borrowed) is 55/45 = 1.22</p>\n\n<p>That is, S3&#39;s data is telling them that after friday trading, GME is still 122% short.</p>\n\n<p>**</p>\n\n<p>Many have pointed out this could be manipulation on S3’s part. It’s interesting to note that as late as the Jan 29th, Ihor from S3 stated most GME shorts have not covered and net shares shorted hadn&#39;t moved much at all (<a href=\"https://twitter.com/ihors3/status/1355246955874701314\">https://twitter.com/ihors3/status/1355246955874701314</a>). Initially on the 28th he claimed short interest float to be $122 (<a href=\"https://twitter.com/ihors3/status/1354847896173240322\">https://twitter.com/ihors3/status/1354847896173240322</a>). The next day he claimed short interest to be 113% (<a href=\"https://twitter.com/ihors3/status/1355249817048522755\">https://twitter.com/ihors3/status/1355249817048522755</a>) of float. 2 days later on Sunday, S3 released a report on the calculated short interest to be 55% (oddly their original announcement tweet appears deleted, but found this <a href=\"https://twitter.com/S3Partners/status/1356392101806800897\">https://twitter.com/S3Partners/status/1356392101806800897</a>), which was confusing to many as this was a big discrepancy in short percentage in a short time. It turned out this percentage was calculated by including synthetic longs into the equation which is a practice that is not standard, thereby yielding a lower short interest percentage of 55% which the media then bandied around before and during market open on Monday. Whether this involved collusion to harm the retail investor I cannot conclusively say as I don’t have the evidence to conclusively make that claim, but definitely something to consider along with all other data points.</p>\n\n<p>With the possibility of Synthetic Long Shares being used in a fraudulent way, if you care about how this could play out if we force the issue, I would recommend you to follow instructions from this comment <a href=\"https://www.reddit.com/r/wallstreetbets/comments/lcpwh0/how_gme_can_still_be_a_great_play/gm2tsnw/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/wallstreetbets/comments/lcpwh0/how_gme_can_still_be_a_great_play/gm2tsnw/</a> and call or email Gamestop Investor Relations and ask them to call an emergency share holder meeting to save the company from bankruptcy, as calling this vote means calling shares back to owners eliminating all synthetic stock, and hence taking leverage away from short selling funds participating in fraudulent activity</p>\n\n<p>If you&#39;d like to read more into the subject here are more solid posts that are related to this subject that I recommend you check out:</p>\n\n<p><a href=\"https://old.reddit.com/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/\">https://old.reddit.com/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l9z88h/evidence_of_massive_naked_short_selling_fraud_in/\">https://www.reddit.com/r/wallstreetbets/comments/l9z88h/evidence_of_massive_naked_short_selling_fraud_in/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/lag1d3/why_gme_short_interest_appears_to_have_fallen/\">https://www.reddit.com/r/wallstreetbets/comments/lag1d3/why_gme_short_interest_appears_to_have_fallen/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l9rk78/sec_doj_60_minutes_public_data_suggests_massive/\">https://www.reddit.com/r/wallstreetbets/comments/l9rk78/sec_doj_60_minutes_public_data_suggests_massive/</a></p>\n\n<p><a href=\"https://old.reddit.com/r/wallstreetbets/comments/lalucf/i_suspect_the_hedgies_are_illegally_covering/\">https://old.reddit.com/r/wallstreetbets/comments/lalucf/i_suspect_the_hedgies_are_illegally_covering/</a></p>\n</div><!-- SC_ON -->",
  "score": 245,
  "permalink": "/r/stocks/comments/ld0cum/evidence_pointing_to_shorts_did_not_cover/",
  "subreddit": "stocks",
  "id": "ld0cum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201960
}