{
  "author": "SmooveyDoo",
  "the_new_excerpt": "I see alot of posts about dips today, I personally don't see this as a concern\nafter a parabolic few months but I thought I would share my story anyways, maybe\nnobody will care but maybe it will give a few people prospective.\n\nI bought ethereum shortly after the ico, I don't know if it was even…",
  "original_created_utc": 1614054785,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天我看到很多关于跌停的帖子，我个人不认为这是一个问题。\n抛物线后的几个月，但我想我会分享我的故事，无论如何，也许。\n没有人会关心，但也许它会给一些人的前景。\n\n我在ico之后不久就买了以太坊，我不知道它是否还... ...",
      "title": "我今天看到了很多关于潜水的事，所以我想我要分享我的故事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我看到很多關於跌停的帖子，我個人不認爲這是一個問題。\n拋物線後的幾個月，但我想我會分享我的故事，無論如何，也許。\n沒有人會關心，但也許它會給一些人的前景。\n\n我在ico之後不久就買了以太坊，我不知道它是否還... ...",
      "title": "我今天看到了很多關於潛水的事，所以我想我要分享我的故事。"
    }
  ],
  "title": "I see alot about dips today so I thought I'd share my story",
  "created_utc": 1614090871,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see alot of posts about dips today, I personally don&#39;t see this as a concern after a parabolic few months but I thought I would share my story anyways, maybe nobody will care but maybe it will give a few people prospective.</p>\n\n<p>I bought ethereum shortly after the ico,  I don&#39;t know if it was even called an ico back then but that&#39;s when I bought it, I had 400$ to my name and I put it all into ethereum. Never expecting much to come from it but I have always been a bit of a computer nerd and it really interested me.</p>\n\n<p>Alot of uninteresting stuff happened but to spare you the boredom I will fast forward to 2017, at this point in my life I am 25, had a decent paying job and a kid on the way, I didn&#39;t have alot of extra money but I worked 70 hour work weeks to make sure we didn&#39;t have to be paycheck to paycheck and me and my wife were trying to save up for a house. Ethereum really started to take off and the 400$ I put into it started to become quite a bit of money. I made some really lucky trades into cardano and nano right before they took off and somehow in the matter of 6 months my 400$ turned into half a million $. I was over the moon, me and my wife just bought our house and I had half a million to my name. No one in my family has ever had money, I have never even taken any sort of vacation and I am 25 years old and now I have my own house and half a million dollars. Holy s**t.</p>\n\n<p>At the end of 2017 I considered cashing out my crypto investment to buy another house but I was absolutely convinced that it was only a matter of time before I had 7 figures, I very seriously considered quitting my job and taking a year off because my son was now 6 months old and I had barely even seen him with my 70 hour work weeks.(at my job you can work as much as you want, the more you work the more you make the 70 hours is not a requirement I just wanted to give my family a better life then I had)</p>\n\n<p>Then the fall started to happen, at first I told myself it will all come back and I will cash out like I planned in the first place. I lost half of what I had in only a few months and I was devastated. I started to panic and made some horrible trades, and by the end of 6 months I had only 5000$.</p>\n\n<p>At that point I just put whatever currency I had in a wallet and left it. I was extremely depressed, nearly suicidal but I kept going to work every day to work hard.</p>\n\n<p>About a year later I was mostly mentally recovered, all my 70 hour work weeks came to fruition and I got a promotion, still long hours but it came with a raise. </p>\n\n<p>I fully committed to my role and a year and a half into my new role I was really succeeding and the company I work for was noticing, i got another promotion and this one came with a huge pay raise. They over doubled my income and I am extremely appreciative of the opportunity. I am now a year and a half into my new job and I am quite certain that in a few more years I will have the opportunity to be a partial owner in the company I work for.</p>\n\n<p>The whole point of this post is that, if I had made anymore gains on my cryptocurrency I would have quit my job and never had the opportunity to make the kind of income I have now. There is always a silver lining and I feel lucky that I got the opportunity to lose all that money. The best part about it is now I work a 40 hour work week and spend a tonne of time with my son and wife!</p>\n\n<p>I don&#39;t have even close to what I was holding in crypto before but I am here holding with all of you! Please if you do end up losing a big chunk of money, try to look at it as an opportunity, even though I know that is very difficult while you are going through it.</p>\n\n<p>If you are feeling down and out make sure you talk to someone, I am not sure how reddit really works but I&#39;m available if you just need to send someone a message that understands what being depressed feels like.</p>\n\n<p>Sorry for all the rambling I just wanted to share my experience</p>\n</div><!-- SC_ON -->",
  "score": 225,
  "permalink": "/r/CryptoCurrency/comments/lq99ap/i_see_alot_about_dips_today_so_i_thought_id_share/",
  "subreddit": "CryptoCurrency",
  "id": "lq99ap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880675
}