{
  "author": "Smart_Alex",
  "original_created_utc": 1644790833,
  "title": "Is it a dick move to plant a clover lawn, knowing it will spread outside of my property?",
  "created_utc": 1644811681,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to turn our front lawn into a no mow, low water, pollinator sanctuary. I want to do this mainly with a clover lawn, with some other flowers and bulbs scattered throughout. I live in a very hot, drought prone area, and the irrigation water is being turned off earlier and earlier every year, which means that many of the lawns around us (with the exception of our next door neighbor) are dry and brown. I think that a clover lawn would solve that problem, and I just think that they&amp;#39;re really neat.&lt;/p&gt;\n\n&lt;p&gt;The houses to either side of us are rentals. We don&amp;#39;t live in a &lt;em&gt;super&lt;/em&gt; nice area, but I wouldn&amp;#39;t call it very trashy either. It&amp;#39;s an eclectic mix of people who care a lot about their lawns, and people who don&amp;#39;t care much at all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/sruoql/is_it_a_dick_move_to_plant_a_clover_lawn_knowing/",
  "subreddit": "TooAfraidToAsk",
  "id": "sruoql",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I want to turn our front lawn into a no mow, low water, pollinator sanctuary. I\nwant to do this mainly with a clover lawn, with some other flowers and bulbs\nscattered throughout. I live in a very hot, drought prone area, and the\nirrigation water is being turned off earlier and earlier every year,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "家の前の芝生を、刈らない、水を使わない、花粉症の人のためのサンクチュアリにしたいです。I\nクローバーをメインに、その他の花や球根を植えたいと考えています。\n点在しています。私の住んでいる地域はとても暑く、干ばつになりやすいので、このような場合\n灌漑用水が止められる時期が年々早くなってきています。",
      "title": "クローバーが敷地外に広がるのを承知で芝生を植えるのは、アホなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想把我们前面的草坪变成一个免修剪、低水位、授粉者的圣地。I\n我想主要用三叶草草坪来实现这一目标，再加上一些其他的花和球茎植物\n散落在整个草坪上。我住在一个非常炎热、易受干旱影响的地区。\n我住在一个非常炎热、易受干旱影响的地区，而且每年的灌溉水被关闭的时间越来越早，...",
      "title": "明知三叶草会蔓延到我的财产之外，还种植三叶草草坪，这是否是一种混蛋行为？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想把我們前面的草坪變成一個免修剪、低水位、授粉者的聖地。I\n我想主要用三葉草草坪來實現這一目標，再加上一些其他的花和球莖植物\n散落在整個草坪上。我住在一個非常炎熱、易受乾旱影響的地區。\n我住在一個非常炎熱、易受乾旱影響的地區，而且每年的灌溉水被關閉的時間越來越早，...",
      "title": "明知三葉草會蔓延到我的財產之外，還種植三葉草草坪，這是否是一種混蛋行爲？"
    }
  ]
}