{
  "author": "Rules_Not_Rulers",
  "the_new_excerpt": "7 odd hours until Taproot locked in for activation in October. For anyone who\nlived through the 2017 fork wars, this feel quite cathartic. I think many of us\nwere worried we would see the same kind of FUD, bullshit, lies and just general\nmadness which happened, and it feel FUCKING GOOD that this got…",
  "original_created_utc": 1623470726,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タプルートが10月のアクティベーションに向けてロックインするまでの7時間の奇妙な時間。2017年のフォーク戦争を経験した人にとって\n2017年のフォーク戦争を経験した人にとって、これはかなりのカタルシスを感じさせてくれます。私たちの多くは\n同じようなFUD、デタラメ、嘘、そして起こった一般的な狂気を見るのではないかと心配していました。\n起こった同じようなFUD、デタラメ、嘘、一般的な狂気を見ることになるのではないかと多くの人が心配していたと思います。",
      "title": "Taproot Party?"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "离Taproot锁定在10月激活还有7个小时。对于那些\n经历过2017年分叉战争的人来说，这感觉相当的宣泄。我想我们中的许多人\n担心我们会看到同样的FUD、废话、谎言和一般的\n荒唐的事情发生了，这让我们感觉他妈的好极了，因为这已经...",
      "title": "塔根党？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "離Taproot鎖定在10月激活還有7個小時。對於那些\n經歷過2017年分叉戰爭的人來說，這感覺相當的宣泄。我想我們中的許多人\n擔心我們會看到同樣的FUD、廢話、謊言和一般的\n荒唐的事情發生了，這讓我們感覺他媽的好極了，因爲這已經...",
      "title": "塔根黨？"
    }
  ],
  "title": "Taproot Party?",
  "created_utc": 1623493833,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>7 odd hours until Taproot locked in for activation in October. For anyone who lived through the 2017 fork wars, this feel quite cathartic. I think many of us were worried we would see the same kind of FUD, bullshit, lies and just general madness which happened, and it feel FUCKING GOOD that this got through mostly fine, with some arguments around activation methods.</p>\n\n<p>Onward and upwards! Looking forward to more improvements to the network, and Bitcoin continuing to claim it&#39;s role as the settlement layer of record. It will be late at night for me when it locks in, I&#39;m going to pour a glass of very expensive single malt, and silently salute everyone who worked on it, and every giant upon whose shoulders they stand. 10 years into my Bitcoin journey, and feel like so many of my hopes of what it could become are being realised, I&#39;ve never been more confident that the revolution would succeed. Don&#39;t fight the present, build the future!</p>\n</div><!-- SC_ON -->",
  "score": 270,
  "permalink": "/r/Bitcoin/comments/nxy40l/taproot_party/",
  "subreddit": "Bitcoin",
  "id": "nxy40l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009733511
}