{
  "author": "Protolomeo",
  "original_created_utc": 1643658112,
  "title": "Trying to explain crypto to a friend made me realize something",
  "created_utc": 1643686556,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today I was talking to a friend of mine, a really skilled graphic designer that wanted to try minting NTFs but have basically 0 knowledge about blockchain.&lt;/p&gt;\n\n&lt;p&gt;I was trying to explain gas fees, minting, different blockchains, proof of stake vs proof of work, and suddenly I realized something... Something that I already knew from school days.&lt;/p&gt;\n\n&lt;p&gt;You haven&amp;#39;t really completely understood something unless you can explain that easily to somebody else.&lt;/p&gt;\n\n&lt;p&gt;I realized that my knowledge about blockchain and stuff is really scarce, so I&amp;#39;m going to read and study, because not being able to explain in simple words why the fuck stuff works the way it works affects my ability to understand where I&amp;#39;m putting my money.&lt;/p&gt;\n\n&lt;p&gt;This is probably something that is not very interesting for you guys, but maybe other people are in my situation... Let&amp;#39;s dive in and educate ourselves!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/sha2zp/trying_to_explain_crypto_to_a_friend_made_me/",
  "subreddit": "CryptoCurrency",
  "id": "sha2zp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today I was talking to a friend of mine, a really skilled graphic designer that\nwanted to try minting NTFs but have basically 0 knowledge about blockchain.\n\nI was trying to explain gas fees, minting, different blockchains, proof of stake\nvs proof of work, and suddenly I realized something...…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、友人のグラフィックデザイナーと話したのですが、彼はとても腕のいいデザイナーで\nNTFを鋳造してみたいが、ブロックチェーンに関する知識は基本的にゼロである。\n\n私はガス料金や造幣、様々なブロックチェーン、プルーフ・オブ・ステークについて説明し\nということで、ふと気がついたのですが......。",
      "title": "友人に暗号を説明しようとして、あることに気がつきました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我和我的一个朋友聊天，他是一个非常熟练的平面设计师，他想尝试铸造NTF，但对区块链基本没有了解。\n他想尝试铸造NTF，但对区块链基本一无所知。\n\n我试图解释天然气费用、铸币、不同的区块链、股权证明\n与工作证明，然后我突然意识到，......",
      "title": "试图向一个朋友解释加密货币使我意识到一些事情"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我和我的一個朋友聊天，他是一個非常熟練的平面設計師，他想嘗試鑄造NTF，但對區塊鏈基本沒有了解。\n他想嘗試鑄造NTF，但對區塊鏈基本一無所知。\n\n我試圖解釋天然氣費用、鑄幣、不同的區塊鏈、股權證明\n與工作證明，然後我突然意識到，......",
      "title": "試圖向一個朋友解釋加密貨幣使我意識到一些事情"
    }
  ]
}