{
  "author": "DOGZRS1CK",
  "original_created_utc": 1636810417,
  "title": "Why is death such a frowned upon alternative to treatment?",
  "created_utc": 1636817914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If someone is ill or in pain, and has been for a significant period of time with no foreseeable end, why is there such an emphasis on preserving the life, particularly if the person is wanting to die? </p>\n\n<p>For people who are ill, they are put onto life-support systems, or the mentally ill are put on medications/into therapy (these are over-simplifications, I know). In most circumstances, these solutions do work, but in the circumstances they don&#39;t and are just there to preserve the life, not actually improve it, why is death such a controversial alternative?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/qt1cz1/why_is_death_such_a_frowned_upon_alternative_to/",
  "subreddit": "NoStupidQuestions",
  "id": "qt1cz1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If someone is ill or in pain, and has been for a significant period of time with\nno foreseeable end, why is there such an emphasis on preserving the life,\nparticularly if the person is wanting to die?\n\nFor people who are ill, they are put onto life-support systems, or the mentally\nill are put on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かが病気や痛みを抱えていて、それがかなりの期間にわたって続いている場合は\n予測できる終わりがない場合、なぜ生命を維持することに重点が置かれるのでしょうか。\n特にその人が死にたがっている場合は。\n\n病気の人は生命維持装置に入れられたり、精神疾患の人は......。\n病気の人には生命維持装置を、精神疾患の人には...",
      "title": "なぜ死は治療の代替手段として嫌われるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果一个人生病或疼痛，而且已经持续了相当长的一段时间，没有可预见的结束。\n没有可预见的结局，为什么要如此强调保存生命呢？\n尤其是当这个人想死的时候？\n\n对于患病的人来说，他们被放在生命支持系统上，或者精神病人被放在\n精神病患者则被置于...",
      "title": "为什么死亡是如此令人皱眉的治疗替代方案？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果一個人生病或疼痛，而且已經持續了相當長的一段時間，沒有可預見的結束。\n沒有可預見的結局，爲什麼要如此強調保存生命呢？\n尤其是當這個人想死的時候？\n\n對於患病的人來說，他們被放在生命支持系統上，或者精神病人被放在\n精神病患者則被置於...",
      "title": "爲什麼死亡是如此令人皺眉的治療替代方案？"
    }
  ]
}