{
  "author": "EmbracingCuriosity76",
  "the_new_excerpt": "I was heavily invested in tech stocks and EV. I still believe in the companies,\nbut I have zero confidence in my portfolio for the short term.\n\nThe unfortunate part is that I had an unexpected expense pop up and it would be\ngreat to sell some stock and pay for it (I have savings and it’s not a big…",
  "original_created_utc": 1614801561,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我曾大量投资于科技股和电动车。我仍然相信这些公司。\n但我对我的投资组合短期内毫无信心。\n\n不幸的是，我有一个意想不到的支出突然出现，这将是\n很好的卖掉一些股票，然后支付（我有积蓄，而且不是很大......",
      "title": "我已经接受了我的投资组合将归零。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾大量投資於科技股和電動車。我仍然相信這些公司。\n但我對我的投資組合短期內毫無信心。\n\n不幸的是，我有一個意想不到的支出突然出現，這將是\n很好的賣掉一些股票，然後支付（我有積蓄，而且不是很大......",
      "title": "我已經接受了我的投資組合將歸零。"
    }
  ],
  "title": "I’ve accepted my portfolio is going to zero.",
  "created_utc": 1614881861,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was heavily invested in tech stocks and EV. I still believe in the companies, but I have zero confidence in my portfolio for the short term. </p>\n\n<p>The unfortunate part is that I had an unexpected expense pop up and it would be great to sell some stock and pay for it (I have savings and it’s not a big deal, but I’ll have to pay extra interest so it’s still a bummer).</p>\n\n<p>What’s funny is that I was just about to sell most of my profits in early Feb. and move into index funds. But I was just a tiny bit below my price targets for pulling out. </p>\n\n<p>I just hope the stocks I have are worth money again someday. But I think we are in full value mode now and a slow market. I knew this would happen at some point, but I gambled that it wouldn’t be the case for a few more months. </p>\n\n<p>No real point to this post. Just venting and I will be fine. I’m just annoyed with the timing. I can’t even average down because all my savings are going to this expense. I don’t think my portfolio will be green again for years lol.</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/lx2vvg/ive_accepted_my_portfolio_is_going_to_zero/",
  "subreddit": "stocks",
  "id": "lx2vvg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575853
}