{
  "author": "xFrosumx",
  "the_new_excerpt": "As per the title. I'm working on a research paper, and having read parts of\nDiamond's breakdown of domesticatability, I'm frankly left unsatisfied by the\nlack of explanations. I can't find a single article referencing the capybara or\ntapir, and only a few for the peccary. I've read a few that say…",
  "original_created_utc": 1614995247,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所言。我正在写一篇研究报告，读了部分内容。\n戴蒙德对家庭化的细分，坦率地说，我不满意的地方在于\n缺乏解释。我找不到任何一篇文章提到capybara或者是\n貘，只有少数的peccary。我读过一些说... ...",
      "title": "为什么没有南美土著人驯化卡比巴拉、貘、佩卡里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所言。我正在寫一篇研究報告，讀了部分內容。\n戴蒙德對家庭化的細分，坦率地說，我不滿意的地方在於\n缺乏解釋。我找不到任何一篇文章提到capybara或者是\n貘，只有少數的peccary。我讀過一些說... ...",
      "title": "爲什麼沒有南美土著人馴化卡比巴拉、貘、佩卡里？"
    }
  ],
  "title": "Why didn't any South American natives domesticate the Capybara, Tapir, or Peccary?",
  "created_utc": 1615009743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As per the title. I&#39;m working on a research paper, and having read parts of Diamond&#39;s breakdown of domesticatability, I&#39;m frankly left unsatisfied by the lack of explanations. I can&#39;t find a single article referencing the capybara or tapir, and only a few for the peccary. I&#39;ve read a few that say the Aztecs tamed and kept peccary for their meat, but why weren&#39;t they truly domesticated?</p>\n\n<p>I&#39;d ask the same of Bison, but have come to the conclusion through readings that they were simply easier to hunt than going to the effort of domesticating and hoping for positive returns, given their numbers and ease of running off a cliff. By comparison, game in South America seems relatively sparse, ergo why the quechua domesticated the cavy of all things. Capybara seem like the perfect animal for Muisca or other tribes in the region to farm for meat, and the Tapir could well be a cattle alternative with some selective breeding for size and meat, so what could have reasonably prevented such a thing? Was game so plentiful for tribes in South America as well that they didn&#39;t have a need to develop more advanced husbandry?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/lyraqg/why_didnt_any_south_american_natives_domesticate/",
  "subreddit": "AskHistorians",
  "id": "lyraqg",
  "is_self": true,
  "media": null,
  "is_video": false
}