{
  "author": "screwyoushadowban",
  "original_created_utc": 1624660247,
  "title": "Who was healthier: a rich city-dweller in 1st century Europe or a rich a city-dweller in 11th century Europe? What about a *poor* city-dweller in 1st century Europe compared to a *poor* a city-dweller in 11th century Europe?",
  "created_utc": 1624673055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve heard that medieval European cities were population sinks, but what about Classical cities? It seems that, for wealthy people at least, living in a city was a pretty good way to get by (even if plenty of Romans fled to rural villas whenever they could). But what about poor people (I&#39;m also familiar with the evidence that in at least some areas poor rural people were evidently healthier/more able to feed themselves after the breakdown of Roman government institutions)?</p>\n\n<p>What kind of agricultural, medical and structural (both social and in a material sense) changes occurred in the 1000 years of time between them that could have pushed average health up or down?</p>\n</div><!-- SC_ON -->",
  "score": 232,
  "permalink": "/r/AskHistorians/comments/o7y5xc/who_was_healthier_a_rich_citydweller_in_1st/",
  "subreddit": "AskHistorians",
  "id": "o7y5xc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've heard that medieval European cities were population sinks, but what about\nClassical cities? It seems that, for wealthy people at least, living in a city\nwas a pretty good way to get by (even if plenty of Romans fled to rural villas\nwhenever they could). But what about poor people (I'm also…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中世ヨーロッパの都市は人口吸収源だったと聞いたことがありますが、古典期の都市はどうでしょうか？\n古典派の都市は？少なくとも裕福な人々にとっては、都市に住むことは生活するための良い手段だったようです。\n少なくとも裕福な人々にとっては、都市に住むことはかなり良い方法だったようです（ローマ人の多くは、可能な限り田舎の別荘に逃げ込んだとしても\nしかし、ローマ人の多くは、可能な限り農村の別荘に逃げていました）。) しかし、貧しい人々はどうだったのでしょうか（私も...）。",
      "title": "1世紀のヨーロッパの豊かな都市生活者と、11世紀のヨーロッパの豊かな都市生活者とでは、どちらが健康的だったのでしょうか。1世紀のヨーロッパの*貧しい*都市生活者と、11世紀のヨーロッパの*貧しい*都市生活者ではどうでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听说中世纪的欧洲城市是人口集散地，但那些\n古典城市呢？看来，至少对富人来说，住在城市里\n至少对富人来说，住在城市里是一种很好的生活方式（即使很多罗马人一有机会就逃到农村的别墅里去了\n只要有机会就会逃到农村别墅）。) 但是穷人呢（我也...",
      "title": "1世纪欧洲的富裕城市居民和11世纪欧洲的富裕城市居民谁更健康？与11世纪欧洲*贫穷的城市居民相比，1世纪欧洲*贫穷的城市居民呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽說中世紀的歐洲城市是人口集散地，但那些\n古典城市呢？看來，至少對富人來說，住在城市裏\n至少對富人來說，住在城市裏是一種很好的生活方式（即使很多羅馬人一有機會就逃到農村的別墅裏去了\n只要有機會就會逃到農村別墅）。) 但是窮人呢（我也...",
      "title": "1世紀歐洲的富裕城市居民和11世紀歐洲的富裕城市居民誰更健康？與11世紀歐洲*貧窮的城市居民相比，1世紀歐洲*貧窮的城市居民呢？"
    }
  ]
}