{
  "author": "larry_ramsey",
  "the_new_excerpt": "So I had the idea that if we tokenized forests as an investment that we could\nplant a massive amount of trees and help preserve nature. For example the\nredwood forest has a lot of old trees that can live for thousands of years\npotentially. Each coin/token would be assigned to a specific tree. In…",
  "original_created_utc": 1614558949,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我有一个想法，如果我们把森林作为一种投资来象征性地对待，我们可以\n种植大量的树木，帮助保护自然。例如\n红木林中古木参天\n潜在的。每个硬币/令牌都会被分配到一个特定的树上。在...",
      "title": "符号化森林"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我有一個想法，如果我們把森林作爲一種投資來象徵性地對待，我們可以\n種植大量的樹木，幫助保護自然。例如\n紅木林中古木參天\n潛在的。每個硬幣/令牌都會被分配到一個特定的樹上。在...",
      "title": "符號化森林"
    }
  ],
  "title": "Tokenizing a forest",
  "created_utc": 1614605673,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I had the idea that if we tokenized forests as an investment that we could plant a massive amount of trees and help preserve nature. For example the redwood forest has a lot of old trees that can live for thousands of years potentially. Each coin/token would be assigned to a specific tree. In order to mint new tokens you plant more trees and assign them to the tokens. If a tree dies that coin is destroyed from circulation. The use case for the coins could be to simply reinvest in the health of the forest. I feel like this is even possible to do for coral reefs as well. Australia is sitting on a trillion dollar investment if they could tokenize sections of the coral reef. The health of the coral reef would be directly related to its potential value. I don’t really know much about the intricacies of how cryptocurrency‘s are formulated or made but I believe this idea is valuable and if it’s possible to implement could be revolutionary.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/luv7fq/tokenizing_a_forest/",
  "subreddit": "CryptoCurrency",
  "id": "luv7fq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937736463
}