{
  "author": "sraehsjess",
  "original_created_utc": 1659137268,
  "title": "how is everyone so comfortable bringing a child into this world?",
  "created_utc": 1659188083,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;with how conditions are now and the conditions of the world just getting worse and worse, how are there so many people okay with bringing a child into this world? you know how much guilt i would feel knowing my child would have to live on this planet with all these shitty people who just keep making everything worse? not to mention health care absolutely sucks ass in america so you’re paying about 20K just to give birth, a baby they want you to have but have to pay THOUSANDS of dollars for. it’s stupid. no one wins, not you or your child because that child is most likely going to grow up with heavy mental issues and the world barely live-able because some people don’t think climate change is real. too many shitty people on this planet and it just keeps getting worse, you’re bringing your child into a shit show.&lt;/p&gt;\n\n&lt;p&gt;edit: let me clarify, a lot of you keep telling me this is the best time to have a kid, in my opinion, no. you can’t even let your kids outside without worrying they’re going to get snatched, schools have been having major school shooting, shit not only schools but parades, festivals, etc. so the planet isn’t safe and TOO many people is bad. &lt;/p&gt;\n\n&lt;p&gt;also please stop telling me to stop watching the news, i don’t. i don’t care about it, i just see the shit happen everyday and not on reddit either. i live through the shit everyday. it just sounds like a lot of you are blinded or just don’t care about the future of the world because whatever is happening to you is good right now so fuck it right?&lt;/p&gt;\n\n&lt;p&gt;another thing, it is my bad for saying world and going on a rant about america, but the rest of the world still isn’t that much better&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/wbiugt/how_is_everyone_so_comfortable_bringing_a_child/",
  "subreddit": "TooAfraidToAsk",
  "id": "wbiugt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "with how conditions are now and the conditions of the world just getting worse\nand worse, how are there so many people okay with bringing a child into this\nworld? you know how much guilt i would feel knowing my child would have to live\non this planet with all these shitty people who just keep…"
}