{
  "author": "pmayall",
  "the_new_excerpt": "This whole thing makes no sense to me. It seems that news of bitcoin adoption;\nEl Salvador, banks storing assets, states accepting bitcoin plus the fact there\nare tons of news about it, more companies experimenting etc... isn't doing\nanything.\n\nThe price isn't going up.\n\nWhat is causing this…",
  "original_created_utc": 1623476417,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは私にとって意味のないことです。ビットコイン導入のニュースが出ているようです。\nエルサルバドル、銀行が資産を保管する、国がビットコインを受け入れる、さらに大量のニュースがあり、実験する企業が増えているという事実。\nさらに、ビットコインについてのニュースがたくさんあり、実験をしている企業が増えていることなども、何の役にも立っていません。\n何もしていません。\n\n価格も上がっていません。\n\n何が原因で...",
      "title": "では、実際にはどうなのでしょうか？真面目な議論"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这整个事情对我来说毫无意义。看来，采用比特币的消息。\n萨尔瓦多，银行储存资产，各州接受比特币的消息，再加上有\n有大量关于它的新闻，更多的公司在做实验等等......并没有做\n没有任何作用。\n\n价格没有上升。\n\n是什么导致了这个...",
      "title": "那么，实际上发生了什么？严肃的讨论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這整個事情對我來說毫無意義。看來，採用比特幣的消息。\n薩爾瓦多，銀行儲存資產，各州接受比特幣的消息，再加上有\n有大量關於它的新聞，更多的公司在做實驗等等......並沒有做\n沒有任何作用。\n\n價格沒有上升。\n\n是什麼導致了這個...",
      "title": "那麼，實際上發生了什麼？嚴肅的討論"
    }
  ],
  "title": "So what's actually going on? Serious discussion",
  "created_utc": 1623508505,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This whole thing makes no sense to me. It seems that news of bitcoin adoption; El Salvador, banks storing assets, states accepting bitcoin plus the fact there are tons of news about it, more companies experimenting etc... isn&#39;t doing anything. </p>\n\n<p>The price isn&#39;t going up. </p>\n\n<p>What is causing this struggle? Is it covid, what&#39;s happening with the dollar, any SEC things, or is it China again...? </p>\n\n<p>Just hoping to get a good thread started with what people, news, thoughts and opinions.</p>\n</div><!-- SC_ON -->",
  "score": 219,
  "permalink": "/r/CryptoCurrency/comments/nxzmnk/so_whats_actually_going_on_serious_discussion/",
  "subreddit": "CryptoCurrency",
  "id": "nxzmnk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009737345
}