{
  "author": "donotusethisaccountu",
  "original_created_utc": 1641515127,
  "title": "Why study Hegel and what makes him so important? His work seems too abstract to matter to day-to-day life.",
  "created_utc": 1641575744,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hegel is often brought up in philosophy circles as the final-boss of philosophical readings. But I don’t understand why. I can’t explain any of Hegel’s ideas in concrete terms (admittedly I don’t know much about it) and it doesn’t seem to have a call to action (like Stoicism) or revelations about scientific knowledge (like Karl Popper promoting the idea of falsifiability in science). And don’t even get me started on how Hegel somehow relates to Marx.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/askphilosophy/comments/rxtgx2/why_study_hegel_and_what_makes_him_so_important/",
  "subreddit": "askphilosophy",
  "id": "rxtgx2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hegel is often brought up in philosophy circles as the final-boss of\nphilosophical readings. But I don’t understand why. I can’t explain any of\nHegel’s ideas in concrete terms (admittedly I don’t know much about it) and it\ndoesn’t seem to have a call to action (like Stoicism) or revelations…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヘーゲルは、哲学界ではしばしば最終ボスとして持ち出される。\n哲学的な読み方をする。でも、なぜなのかがわからない。私は何一つ説明できないのです\nヘーゲルの思想を具体的に説明すると、（確かに私はあまり知らないのですが）ヘーゲルは\nストイシズムのような）行動への呼びかけや啓示がないように思えるのですが...。",
      "title": "なぜヘーゲルを研究するのか、何がヘーゲルを重要視しているのか。彼の作品は抽象的すぎて、日々の生活には関係ないように思えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在哲学界，黑格尔经常被当作哲学读物的最后主人而被提起。\n哲学读物的最后主人。但我不明白为什么。我无法解释任何\n我无法用具体的术语来解释黑格尔的任何想法（诚然我对它了解不多），而且它\n它似乎没有对行动的呼吁（像斯多葛主义）或启示......",
      "title": "为什么要研究黑格尔，是什么让他如此重要？他的作品似乎太抽象了，与日常生活无关。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在哲學界，黑格爾經常被當作哲學讀物的最後主人而被提起。\n哲學讀物的最後主人。但我不明白爲什麼。我無法解釋任何\n我無法用具體的術語來解釋黑格爾的任何想法（誠然我對它瞭解不多），而且它\n它似乎沒有對行動的呼籲（像斯多葛主義）或啓示......",
      "title": "爲什麼要研究黑格爾，是什麼讓他如此重要？他的作品似乎太抽象了，與日常生活無關。"
    }
  ]
}