{
  "author": "Lu_the_weeb",
  "original_created_utc": 1654579609,
  "title": "Why is a girl/woman dressing \"manly\" and enjoying/doing stuff that's labeled as something for boys normalized but when boys/men are interested in feminine clothing/items it's frowned upon?",
  "created_utc": 1654599413,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been confused by this for quite a bit. You&amp;#39;d see a little girl walk around wearing a monster trucks t-shirt, wearing &amp;quot;boys&amp;quot; clothes, playing with &amp;quot;boys&amp;quot; toys, and just wearing Halloween costumed typically made for boys and no one really batted an eye to it. Specifically in elementary, there&amp;#39;d be tons of tomboys in school and I never saw anyone say anything about it. Yet, when a little boy wants to wear a princess costume, play with barbies, and wear cute dresses and skirts or makeup, everyone is angry. The world is at an end. Grandparents and family members are enraged and believe you&amp;#39;re the worst parent for letting a little boy be a kid. &lt;/p&gt;\n\n&lt;p&gt;Another thing i find a little strange is how a tomboy can be seen as nothing more than a little girl just wanting to wear clothes but when a little boy tries feminine things, people automatically assume he&amp;#39;s gay or trans. \nIs it because they assume being a tomboy is a phase? Even if it is, why can&amp;#39;t they assume the same for a little boy? What&amp;#39;s wrong with a little boy being a little feminine?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/v6nffm/why_is_a_girlwoman_dressing_manly_and/",
  "subreddit": "NoStupidQuestions",
  "id": "v6nffm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been confused by this for quite a bit. You'd see a little girl walk around\nwearing a monster trucks t-shirt, wearing \"boys\" clothes, playing with \"boys\"\ntoys, and just wearing Halloween costumed typically made for boys and no one\nreally batted an eye to it. Specifically in elementary, there'd…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これにはかなり戸惑いました。小さな女の子が\nモンスター・トラックのTシャツを着て、「男の子」の服を着て、「男の子」のおもちゃで遊んでいる。\n男の子用の服を着て、男の子用のおもちゃで遊び、男の子用のハロウィンの衣装を身につけ、誰もそれを気にしない。\n誰もそれを見て見ぬふりをすることはありませんでした。特に小学校では、...",
      "title": "なぜ、女の子や女性が「男らしい」服装をしたり、男の子向けとされるものを楽しんだり、したりすることは普通なのに、男の子や男性が女性らしい服やアイテムに興味を持つと、嫌われるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对这个问题困惑了很久。你会看到一个小女孩走来走去\n穿着怪物卡车的T恤，穿着 \"男孩 \"的衣服，玩着 \"男孩 \"的玩具。\n玩 \"男孩 \"的玩具，而且只是穿着通常为男孩制作的万圣节服装，没有人\n而没有人对此视而不见。特别是在小学时，会有...",
      "title": "为什么一个女孩/女人穿得 \"很男人\"，喜欢/做那些被贴上男孩标签的东西是正常的，而当男孩/男人对女性的衣服/物品感兴趣时，却被人诟病？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對這個問題困惑了很久。你會看到一個小女孩走來走去\n穿着怪物卡車的T恤，穿着 \"男孩 \"的衣服，玩着 \"男孩 \"的玩具。\n玩 \"男孩 \"的玩具，而且只是穿着通常爲男孩製作的萬聖節服裝，沒有人\n而沒有人對此視而不見。特別是在小學時，會有...",
      "title": "爲什麼一個女孩/女人穿得 \"很男人\"，喜歡/做那些被貼上男孩標籤的東西是正常的，而當男孩/男人對女性的衣服/物品感興趣時，卻被人詬病？"
    }
  ]
}