{
  "author": "Lu_the_weeb",
  "original_created_utc": 1654579609,
  "title": "Why is a girl/woman dressing \"manly\" and enjoying/doing stuff that's labeled as something for boys normalized but when boys/men are interested in feminine clothing/items it's frowned upon?",
  "created_utc": 1654599413,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been confused by this for quite a bit. You&amp;#39;d see a little girl walk around wearing a monster trucks t-shirt, wearing &amp;quot;boys&amp;quot; clothes, playing with &amp;quot;boys&amp;quot; toys, and just wearing Halloween costumed typically made for boys and no one really batted an eye to it. Specifically in elementary, there&amp;#39;d be tons of tomboys in school and I never saw anyone say anything about it. Yet, when a little boy wants to wear a princess costume, play with barbies, and wear cute dresses and skirts or makeup, everyone is angry. The world is at an end. Grandparents and family members are enraged and believe you&amp;#39;re the worst parent for letting a little boy be a kid. &lt;/p&gt;\n\n&lt;p&gt;Another thing i find a little strange is how a tomboy can be seen as nothing more than a little girl just wanting to wear clothes but when a little boy tries feminine things, people automatically assume he&amp;#39;s gay or trans. \nIs it because they assume being a tomboy is a phase? Even if it is, why can&amp;#39;t they assume the same for a little boy? What&amp;#39;s wrong with a little boy being a little feminine?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/v6nffm/why_is_a_girlwoman_dressing_manly_and/",
  "subreddit": "NoStupidQuestions",
  "id": "v6nffm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been confused by this for quite a bit. You'd see a little girl walk around\nwearing a monster trucks t-shirt, wearing \"boys\" clothes, playing with \"boys\"\ntoys, and just wearing Halloween costumed typically made for boys and no one\nreally batted an eye to it. Specifically in elementary, there'd…"
}