{
  "author": "anakanin",
  "original_created_utc": 1632053988,
  "title": "Evergrande Group, one of the biggest Chinese companies is on the brink of collapsing and it could cause one of the biggest crypto crashes we've seen so fart",
  "created_utc": 1632065643,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Snowed under its massive debt of over $300 billion, Evergrande Group is so huge that the fallout from any failure could hurt not just China’s economy. This could very well spread to markets in US and EU as well as the rest of the Asia.</p>\n\n<p>&#x200B;</p>\n\n<h1>What exactly is Evergrande?</h1>\n\n<p>Evergrande has a position everywhere. Its main business is  real estate, and it’s China’s second-largest property developer by sales.</p>\n\n<ul>\n<li>They own more than 1,300 real estate projects in over 280 cities </li>\n<li>Its property services management arm is involved in nearly 2,800 projects across more than 310 cities in China.</li>\n<li>The company has seven units dabbling in a wide range of industries, including electric vehicles, health-care services, consumer products, video and television production units and even a theme park.</li>\n<li>The firm says it has 200,000 employees, but indirectly creates more than 3.8 million jobs every year, according to its website.</li>\n<li>Evergrande’s shares and bonds are included in indexes across whole Asia.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h2>Who will be affected the most if it comes crashing down?</h2>\n\n<p>The pool of affected parties will include banks, suppliers, home-buyers, investors, retail. Evergrande warned this week its escalating troubles could lead to even broader default risks.</p>\n\n<p>If the Evergrande can’t repay its debt, it could lead to a situation of “cross default” — where a default triggered in one situation may spread to other obligations, leading to broader contagion.</p>\n\n<p>And currently, they are unable to repay the debt due to the size of it.</p>\n\n<p>The banking industry will be among the first to be hit and they will be hit hard. And once the banks are hit it is only a matter of time when it comes to crypto.</p>\n\n<p>Evergrande’s debt crisis may snowball down the road, and economic growth will not mitigate financial losses as was the case in the past. </p>\n\n<p>&#x200B;</p>\n\n<h1>Should we fear?</h1>\n\n<p>I don&#39;t know but unfortunately China has a pretty big influence on markets even here in EU as also in US. If Evergrande comes crashing down, it could send ripples across markets which could cause a drastic change in crypto. Being vigilant is our best option right now.</p>\n</div><!-- SC_ON -->",
  "score": 463,
  "permalink": "/r/CryptoCurrency/comments/pr6wab/evergrande_group_one_of_the_biggest_chinese/",
  "subreddit": "CryptoCurrency",
  "id": "pr6wab",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Snowed under its massive debt of over $300 billion, Evergrande Group is so huge\nthat the fallout from any failure could hurt not just China’s economy. This\ncould very well spread to markets in US and EU as well as the rest of the Asia.\n\n\n\n\nWHAT EXACTLY IS EVERGRANDE?\n\nEvergrande has a position…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3,000億ドルを超える巨額の負債に雪だるま式に膨らんでいく、Evergrande Groupのあまりにも巨大な姿\n失敗すれば、中国経済だけでなく、日本にも打撃を与える可能性があります。これは\nアメリカやEU、そしてアジアの他の国々の市場にも影響を及ぼす可能性があります。\n\n\n\n\nエバーグランデとは何ですか？\n\nEvergrandeのポジションは...",
      "title": "中国最大の企業の一つであるEvergrande Groupが崩壊の危機に瀕しており、これまでに見た中で最大の暗号クラッシュの一つを引き起こす可能性がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "恒大集团被其超过3000亿美元的巨额债务压得喘不过气来。\n以至于任何失败的影响不仅会伤害中国的经济。这\n很可能蔓延到美国、欧盟以及亚洲其他国家的市场。\n\n\n\n\n恒大到底是什么？\n\n恒大在中国的地位...",
      "title": "中国最大的公司之一恒大集团正处于崩溃的边缘，它可能导致我们所看到的最大的加密货币崩溃之一。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "恆大集團被其超過3000億美元的鉅額債務壓得喘不過氣來。\n以至於任何失敗的影響不僅會傷害中國的經濟。這\n很可能蔓延到美國、歐盟以及亞洲其他國家的市場。\n\n\n\n\n恆大到底是什麼？\n\n恆大在中國的地位...",
      "title": "中國最大的公司之一恆大集團正處於崩潰的邊緣，它可能導致我們所看到的最大的加密貨幣崩潰之一。"
    }
  ]
}