{
  "author": "themorrishouse",
  "the_new_excerpt": "For the the past nine months, I’ve been trying to confirm or deny the age of a\nCincinnati, Ohio, house widely reported as built in 1804.\n\nThe facts: Although newspaper stories, county records, and the plaque on the\nhouse say 1804, I’ve only been able to date it to 1834. That’s the date on a\nplat…",
  "original_created_utc": 1623289644,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この9ヶ月間、私は、1804年に建てられたと広く伝えられているオハイオ州シンシナティの家の年代を確認しようとしてきた。\nオハイオ州シンシナティの家は、1804年に建てられたと広く伝えられている。\n\n事実はこうだ。新聞記事や郡の記録、家のプレートには1804年と書かれていますが\n事実：新聞記事、郡の記録、家のプレートには1804年と書かれていますが、私は1834年までしか確認できませんでした。それは地図に記載されている日付です。\nプレートの日付です。",
      "title": "アーリーアメリカンの歴史を専門とするヒストリアンなら、1804年から1828年の間にオハイオ州南部に建てられた家の情報をどこで探すだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的九个月里，我一直在试图证实或否认一幢\n俄亥俄州辛辛那提市的一所房子，据广泛报道，该房子建于1804年。\n\n事实是这样的。尽管报纸上的报道、县里的记录和房子上的牌匾都说是1804年的，但我只想确认它的年龄。\n尽管报纸上的报道、县里的记录和房子上的牌匾都说是1804年，但我只能确定它的日期是1834年。那是地图上的日期\n版图上的日期...",
      "title": "专门研究美国早期历史的历史学家，你会在哪里寻找1804年至1828年期间在俄亥俄州南部建造的房子的信息？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的九個月裏，我一直在試圖證實或否認一幢\n俄亥俄州辛辛那提市的一所房子，據廣泛報道，該房子建於1804年。\n\n事實是這樣的。儘管報紙上的報道、縣裏的記錄和房子上的牌匾都說是1804年的，但我只想確認它的年齡。\n儘管報紙上的報道、縣裏的記錄和房子上的牌匾都說是1804年，但我只能確定它的日期是1834年。那是地圖上的日期\n版圖上的日期...",
      "title": "專門研究美國早期歷史的歷史學家，你會在哪裏尋找1804年至1828年期間在俄亥俄州南部建造的房子的信息？"
    }
  ],
  "title": "Historians who specialize in early American history, where would you look for information on a house built in southern Ohio between 1804 and 1828?",
  "created_utc": 1623323259,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the the past nine months, I’ve been trying to confirm or deny the age of a Cincinnati, Ohio, house widely reported as built in 1804.</p>\n\n<p>The facts: Although newspaper stories, county records, and the plaque on the house say 1804, I’ve only been able to date it to 1834. That’s the date on a plat commissioned by the heirs of supposed builder James C. Morris. He died intestate, as did his wife, Jane. His children then sued for the right to divide and sell the family farm. The plat includes the house, labeled as “Morris Homestead.”</p>\n\n<p>The house presumably dates at least to 1828. Numerous period sources confirm that James C. Morris lived there, and he died in 1828. However, U.S. Navy records tell us that Morris was a prisoner in northern Africa—part of the crew of the USS Philadelphia—until 1805. Several family documents in a local archive confirm that the family did not come to this area until after his captivity. Furthermore, county records indicate that he almost certainly did not buy the property where the house stands until after 1814. (I’m still figuring out which deed refers to which piece of property, but he bought several large parcels in this area between 1815 and 1820. I believe the relevant deed is the one from 1817.)</p>\n\n<p>The 1804 story has appeared consistently in credible outlets since at least 1925. But I can’t find any factual basis for it, and I have found a number of other half-truths and contradictions in the story as commonly told. (It’s also odd to me that the sturdy farmhouse, which is one of the oldest buildings in the county if it’s actually 217 years old, didn’t seem to attract attention from writers or historians before 1925. They certainly enjoyed reminiscing about pioneer days in the late 1800s, and it was/is a prominent part of an urban neighborhood that grew rapidly from about 1870-1910... Maybe you historians have helpful perspective on that.)</p>\n\n<p>The most interesting evidence that the house could predate 1828 might be a passage in early Cincinnatian Oliver Spencer’s 1835 “Indian Captivity.” Spencer likely sold the property to Morris, and in describing his father’s 1790s frontier cabin, he mentions an “old hewed log house” then standing six feet from the site of the cabin, in a location that corresponds to that of the modern-day Morris House. If it was “old” in 1835... (I have also considered that many early settlers tore down their simple, fortified cabins relatively quickly, replacing them with more comfortable log and timber-frame homes. Could the Morris House actually be the Spencer House? Or could &quot;old&quot; in 1835, in a relatively young city, possibly have meant... 1825? Or 1817?)</p>\n\n<p>Anyway, I’ve written enough. The real question is: Where, beyond the usual sources, would you look for evidence? I’ve looked at deeds (which do not mention a house—but that seems to be normal), gathered all the maps I can, scoured newspaper archives... I’ve connected with a restorationist who could date a sample from one of the bark-on joists in the cellar, which could be helpful.</p>\n\n<p>I’m starting to worry we’ll never find a definitive answer. At this point, I’m thinking my best bet might be something random—a diary entry, a detail in a court case, a road report. I’ll keep looking in local archives, which have been helpful, but I’m looking for the kind of experience-based insight that can only come from a professional.</p>\n\n<p>Thank you for your time! I know I’m pushing boundaries by posting this here, but after reading the rules, I think it’s an appropriate question about process.</p>\n\n<p>EDIT: I don&#39;t know why this is flaired &quot;Oral History,&quot; but I can&#39;t figure out how to change it. Mods?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/nwc23c/historians_who_specialize_in_early_american/",
  "subreddit": "AskHistorians",
  "id": "nwc23c",
  "is_self": true,
  "media": null,
  "is_video": false
}