{
  "author": "Theobromas",
  "original_created_utc": 1634040746,
  "title": "META - As much as I've enjoyed r/AskHistorians for the past 10 years, I firmly believe that this subreddit should make a better effort to redirect people seeking more of a skin-deep understanding to subreddits more conducive to casual discussion. This would be a huge benefit to all.",
  "created_utc": 1634048176,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a teacher, there is a principle that comprehension is often more important than accuracy, and in some cases an oversimplification or other heuristics is a great starting off point in learning something new.  And as you learn more, the corrections in accuracy become more and more important. </p>\n\n<p>Since most of you are academic writers, I understand that there is a very strict mindset one must have in order to be as accurate as possible (lest you be destroyed by your colleagues).  This is why the intense policing of this sub is so incredibly scrutinized, and the result is it does provide for some of the most comprehensive and exhaustive answers I&#39;ve seen on the internet.  </p>\n\n<p>But where do people go who just want to ask a question where they might not know what information it is they&#39;re seeking?  If I&#39;m trying to get an understanding of what kind of life a Greek mercenary that fought for Xerxes would have been after the Persian invasion was thwarted, I don&#39;t even know what exactly it is I&#39;m trying to learn.  And that&#39;s where this subreddit seems to break down, and instead the focus turns on only answering questions that have a clear answer. Because after ten years, every one of these kinds of questions has already been asked and answered.</p>\n\n<p>I think this subreddit should actually try to reach out to subs like <a href=\"/r/history\">r/history</a> or <a href=\"/r/AskHistory\">r/AskHistory</a> (at the very least, link them in the FAQ, wiki, or about section so casual buffs can head there), or work with them to both ensure misinformation isn&#39;t being spread on theirs and redirect academic answers to here.</p>\n\n<p>Something tells me, however, that at least one historian will reply with, &quot;We don&#39;t care about raising general knowledge and interest in history. That&#39;s not the job of a historian, and if you don&#39;t like it, you go somewhere else.&quot; But that&#39;s kind of what I mean: <em>where should we go to start?</em></p>\n\n<p>TL;DR This sub is perfect for what it wants to be, but for the sake of raising standards of the general public and the quality of comments in this sub, please work with the other history subreddits to help build the knowledge of all or at least redirect people.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/AskHistorians/comments/q6krmc/meta_as_much_as_ive_enjoyed_raskhistorians_for/",
  "subreddit": "AskHistorians",
  "id": "q6krmc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a teacher, there is a principle that comprehension is often more important\nthan accuracy, and in some cases an oversimplification or other heuristics is a\ngreat starting off point in learning something new. And as you learn more, the\ncorrections in accuracy become more and more important.\n\nSince…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "教える側としては、理解することの方が重要であるという原則があります。\n場合によっては、単純化しすぎたり、他のヒューリスティックな方法を用いたりすることが\n新しいことを学ぶ際には、単純化しすぎたり、ヒューリスティックな表現が良いきっかけになることがあります。また、学習が進むにつれて\n正確さの修正がより重要になってきます。\n\n以来...",
      "title": "META - 過去10年間、r/AskHistoriansを楽しんできましたが、このサブレディットは、より深く理解しようとする人々を、カジュアルな議論に適したサブレディットに誘導する努力をすべきだと私は確信しています。これはすべての人にとって大きな利益となるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一名教师，有一个原则，即理解往往比准确更重要。\n在某些情况下，过度简化或其他启发式方法是一个很好的选择。\n在某些情况下，过度简化或其他启发式方法是学习新事物的一个很好的出发点。而随着你学习的深入，\n准确性方面的修正变得越来越重要。\n\n自从...",
      "title": "META - 在过去的10年里，我非常喜欢r/AskHistorians，我坚信这个子版块应该做出更好的努力，将寻求更多皮毛理解的人转到更有利于休闲讨论的子版块。这对所有人来说都是巨大的好处。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一名教師，有一個原則，即理解往往比準確更重要。\n在某些情況下，過度簡化或其他啓發式方法是一個很好的選擇。\n在某些情況下，過度簡化或其他啓發式方法是學習新事物的一個很好的出發點。而隨着你學習的深入，\n準確性方面的修正變得越來越重要。\n\n自從...",
      "title": "META - 在過去的10年裏，我非常喜歡r/AskHistorians，我堅信這個子版塊應該做出更好的努力，將尋求更多皮毛理解的人轉到更有利於休閒討論的子版塊。這對所有人來說都是巨大的好處。"
    }
  ]
}