{
  "author": "dsmlegend",
  "original_created_utc": 1658495901,
  "title": "Uh oh, I leaked my seed phrase! Crack a weak passphrase and steal my Monero! [Challenge]",
  "created_utc": 1658552042,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;One week ago, someone posted a &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/vyaj4t/comment/ig27rrv/\"&gt;challenge&lt;/a&gt; on this sub, which was solved surprisingly (or not-so-surprisingly, after reading the explanation) fast, as detailed in &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/vyialk/brute_forcing_531441_seeds_only_to_lose_a_reddit/ig3s508/?context=3\"&gt;this post&lt;/a&gt;. The puzzler offered a reward for cracking a dogecoin seed, and offered some hints to it. The solver was able to brute-force it in just a few seconds.&lt;/p&gt;\n\n&lt;p&gt;Something about the way in which it was achieved made me wonder if the experience would be similar for the dark side of crypto: Monero. I had some disagreements in the comments and ultimately promised to make my own challenge post, for a Monero reward, in one week from that day. Here is &lt;a href=\"https://www.reddit.com/r/CryptoCurrency/comments/vyialk/comment/ig3s508/?utm_source=share&amp;amp;utm_medium=web2x&amp;amp;context=3\"&gt;that comment&lt;/a&gt; - and it has now been one week.&lt;/p&gt;\n\n&lt;p&gt;To lay out the challenge, I will sketch out a plausible scenario.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;You&amp;#39;ve just been to my house for a meal, where I enthusiastically told you about recently discovering crypto and even buying myself a Ledger hardware device to secure it. I explained that it was delivered a week ago, after which I immediately set it up. Since then, I explain, I&amp;#39;ve stored some, specifically,&lt;/strong&gt; &lt;strong&gt;&lt;em&gt;Monero&lt;/em&gt;&lt;/strong&gt; &lt;strong&gt;with it because I&amp;#39;d heard that &amp;quot;privacy is important for security&amp;quot;.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;At some point, I had excused myself for a minute and your eye happened to catch a piece of paper sitting on my working-from-home desk. You couldn&amp;#39;t resist a peak, and had seen that it was my paper backup! You had hurriedly taken a photo with your phone and gone back to sit down before I noticed. Now, back at home, you look at your phone and see this written on the paper:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Ledger backup seed:&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;minimum nature junk elegant uncle speak suggest dream below actor thing abuse oak fall immense ticket alien market wrist dinosaur hammer unique bicycle drum&lt;/strong&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Passphrase hint: four small caps letters&lt;/strong&gt;   &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Date: July 15th, 2022&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;strong&gt;Unfortunately, I had been vague about exactly when I sent the funds to the hardware storage. Was it today, or the day I set up the wallet, or somewhere in between?... You want to steal the funds, but you dare not ask me any questions, for fear that you would thereby implicate yourself.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So, the technicals, just for clarity: I had generated a random fresh BIP39 seed and used a randomly generated offset passphrase for additional security. Thank goodness for that, since I was so careless with my paper backup! However, I set the parameters to a laughably insecure level: four characters, a-z (e.g. &amp;#39;abcd&amp;#39;). I.e., the number of possibilities are thus 26x26x26x26 = 456 976, which is almost the same number of brute-force attempts that were necessary to crack the dogecoin wallet. I performed a blind draw to select a random day to deposit the bounty to the wallet (somewhere between wallet creation date and today).&lt;/p&gt;\n\n&lt;p&gt;The bounty is a modest 0.1 XMR plus the sweet taste of victory. I even left enough extra to pay for the transaction fee, so you can extract a clean 0.1 XMR (I&amp;#39;m a gentleman like that). I will reveal the passphrase after 72 hours (which I may extend if there is continued interest). This will retrospectively prove the amount and date of the deposit, to anyone who wishes to restore the wallet.&lt;/p&gt;\n\n&lt;p&gt;It is my belief that this will be more difficult than it may at first seem, because &amp;quot;privacy is important for security&amp;quot;. If I&amp;#39;m wrong, it&amp;#39;s an easy win.&lt;/p&gt;\n\n&lt;p&gt;Good luck!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/w5afuh/uh_oh_i_leaked_my_seed_phrase_crack_a_weak/",
  "subreddit": "CryptoCurrency",
  "id": "w5afuh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "One week ago, someone posted a challenge\n[https://www.reddit.com/r/CryptoCurrency/comments/vyaj4t/comment/ig27rrv/] on\nthis sub, which was solved surprisingly (or not-so-surprisingly, after reading\nthe explanation) fast, as detailed in this…"
}