{
  "author": "Mandrake_m2",
  "original_created_utc": 1634685078,
  "title": "Where are my MATIC lovers at? It just hit 100 million unique addresses.",
  "created_utc": 1634707840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First they surpassed Ethereum by daily active addresses, and now this. No wonder they pumped 25% the past week.\nThey’ve been putting out bullish news above bullish news nonstop.</p>\n\n<p>I actually saw this coming for MATIC because its one of the few projects out there with an actual use case. People simply want lower fees and faster transactions and MATIC is up there with the best in that regard.\nIf MATIC keeps up this pace, it might have the potential to double its price by the end of this year. It’s not that far off.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/qbngn2/where_are_my_matic_lovers_at_it_just_hit_100/",
  "subreddit": "CryptoCurrency",
  "id": "qbngn2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First they surpassed Ethereum by daily active addresses, and now this. No wonder\nthey pumped 25% the past week. They’ve been putting out bullish news above\nbullish news nonstop.\n\nI actually saw this coming for MATIC because its one of the few projects out\nthere with an actual use case. People simply…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムのデイリーアクティブアドレス数を超えたと思ったら、今度はこれだ。それもそのはず\nこの1週間で25％も上昇したのも不思議ではありません。彼らは上記の強気のニュースを出してきた\n絶え間なく強気のニュースを発信している。\n\nMATICは実際のユースケースを持つ数少ないプロジェクトの1つなので、私はこの事態を予想していました。\n実際のユースケースがある数少ないプロジェクトだからです。人々は単に...",
      "title": "私のMATIC好きはどこにいるの？ちょうど1億ユニークアドレスを達成しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们先是以日活跃地址数超过了以太坊，现在又是这样。难怪\n他们在过去的一周里上涨了25%。他们一直在放出看涨的消息。\n看涨的消息不停。\n\n我实际上看到了MATIC的这种情况，因为它是为数不多的有实际用途的项目之一。\n有一个实际的使用案例。人们只是...",
      "title": "我的MATIC爱好者们在哪里？它刚刚达到1亿个独立地址。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們先是以日活躍地址數超過了以太坊，現在又是這樣。難怪\n他們在過去的一週裏上漲了25%。他們一直在放出看漲的消息。\n看漲的消息不停。\n\n我實際上看到了MATIC的這種情況，因爲它是爲數不多的有實際用途的項目之一。\n有一個實際的使用案例。人們只是...",
      "title": "我的MATIC愛好者們在哪裏？它剛剛達到1億個獨立地址。"
    }
  ]
}