{
  "author": "OptiFinancial",
  "the_new_excerpt": "You know what would be the best decision these companies could make going\nforward to really stick it to the hedge / keep momentum and stay strong? They\nneed to merge together. Can you imagine a world where you walk into AMC\ntheaters, can walk into a gaming shop play games, hang out and go watch a…",
  "original_created_utc": 1623441528,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この先、企業がヘッジに徹し、勢いを保ち、強くあり続けるためには、何が最良の決断なのかご存知でしょうか？\n勢いを維持し、強さを保つためには、どのような決断が必要でしょうか？それは\n両社は合併する必要があります。AMCの映画館に入ると、ゲームショップに入ってゲームをしたり、くつろいだりすることができるような世界を想像できますか？\n映画館に入って、ゲームショップに入って、ゲームをして、くつろいで、映画を見て...。",
      "title": "AMCとGMEの合併（深刻"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你知道什么才是这些公司可以做出的最好的决定？\n来真正坚持对冲/保持势头并保持强劲？他们\n他们需要合并在一起。你能想象一个世界吗？\n影院，可以走进一家游戏店玩游戏，闲逛并去看一场电影。",
      "title": "AMC和GME的合并（严重）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你知道什麼纔是這些公司可以做出的最好的決定？\n來真正堅持對沖/保持勢頭並保持強勁？他們\n他們需要合併在一起。你能想象一個世界嗎？\n影院，可以走進一家遊戲店玩遊戲，閒逛並去看一場電影。",
      "title": "AMC和GME的合併（嚴重）。"
    }
  ],
  "title": "AMC and GME merger (serious)",
  "created_utc": 1623463485,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You know what would be the best decision these companies could make going forward to really stick it to the hedge / keep momentum and stay strong? They need to merge together. Can you imagine a world where you walk into AMC theaters, can walk into a gaming shop play games, hang out and  go watch a movie? Maybe a little bit of alcohol and boom revenue through the roof. Why would they do this? \nAMC theaters have enough space and can change the insides to have a place for GME merchandise and play Areas. </p>\n\n<p>I think the companies could make a killing by working together. </p>\n\n<p>Opinions anyone?</p>\n</div><!-- SC_ON -->",
  "score": 2643,
  "permalink": "/r/wallstreetbets/comments/nxoraa/amc_and_gme_merger_serious/",
  "subreddit": "wallstreetbets",
  "id": "nxoraa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009747674
}