{
  "author": "OmniMachine",
  "the_new_excerpt": "When the pandemic started, my job closed, but they decided not to fire me. I\nmoved back in with my parents and started putting my extra money into the\nmarket. I’ve made some mistakes (selling nio at 25) but for the most part its\nbeen really good up 150%.\n\nI plan to get out soon, I understand anyone…",
  "original_created_utc": 1608725399,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当大流行开始时，我的工作关门了，但他们决定不解雇我。我\n搬回和我父母一起住，开始把多余的钱放到\n市场。我犯过一些错误(25岁时卖Nio)，但在很大程度上\n真的很不错，上涨了150%。\n\n我计划马上出去，我知道任何人…",
      "title": "感谢本子编辑网站上的每一个人。完成了我的第一个10000米！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當大流行開始時，我的工作關門了，但他們決定不解僱我。我\n搬回和我父母一起住，開始把多餘的錢放到\n市場。我犯過一些錯誤(25歲時賣Nio)，但在很大程度上\n真的很不錯，上漲了150%。\n\n我計劃馬上出去，我知道任何人…",
      "title": "感謝本子編輯網站上的每一個人。完成了我的第一個10000米！"
    }
  ],
  "title": "Thank you to everyone on this subreddit. Made my first 10k!",
  "created_utc": 1608734442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When the pandemic started, my job closed, but they decided not to fire me. I moved back in with my parents and started putting my extra money into the market. I’ve made some mistakes (selling nio at 25) but for the most part its been really good up 150%. </p>\n\n<p>I plan to get out soon, I understand anyone can make money in the current market. So I wouldn’t want to overstay my welcome. Just wanted enough to buy my parents a house, maybe rent the second floor.</p>\n\n<p>Learned a lot here and I am very thankful. As someone who came from nothing, its a little ridiculous to see these amounts. Also, clear that picking yourself up from your bootstraps is absolute bullshit. Those who have money can grow it, those who don’t are SOL.</p>\n\n<p>PS: By get out I mean get out of day trading. Currently in the process of transferring everything over to ETFs.</p>\n</div><!-- SC_ON -->",
  "score": 310,
  "permalink": "/r/stocks/comments/kirye5/thank_you_to_everyone_on_this_subreddit_made_my/",
  "subreddit": "stocks",
  "id": "kirye5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609271717002
}