{
  "author": "plokij24",
  "the_new_excerpt": "With so many new people in the crypto space, there are many mistakes that have\nbeen made that new investors need to know about.\n\nOne of them is what to do with your hardware wallet when you first receive it.\n\n\nLEGITIMATE DEVICES\n\nIn 99%+ of cases (99% is a low estimate) you will receive a legitimate…",
  "original_created_utc": 1613440020,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在加密领域有这么多新人，有很多错误的地方。\n已经做出，新的投资者需要知道。\n\n其中之一就是当你第一次收到你的硬件钱包时，该如何处理它。\n\n\n合法的设备\n\n在99%以上的情况下（99%是一个较低的估计），你会收到一个合法的...。",
      "title": "当你第一次收到你的硬件钱包时，你必须要做的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在加密領域有這麼多新人，有很多錯誤的地方。\n已經做出，新的投資者需要知道。\n\n其中之一就是當你第一次收到你的硬件錢包時，該如何處理它。\n\n\n合法的設備\n\n在99%以上的情況下（99%是一個較低的估計），你會收到一個合法的...。",
      "title": "當你第一次收到你的硬件錢包時，你必須要做的事情。"
    }
  ],
  "title": "Things you NEED to do when you first receive your hardware wallet",
  "created_utc": 1613453607,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With so many new people in the crypto space, there are many mistakes that have been made that new investors need to know about.</p>\n\n<p>One of them is what to do with your hardware wallet when you first receive it.</p>\n\n<h1>Legitimate devices</h1>\n\n<p>In 99%+ of cases (99% is a low estimate) you will receive a legitimate hardware wallet. However, there have been cases of fake Ledger/Trezor wallets, or even wallets already set up (more on this below).</p>\n\n<p><a href=\"https://support.ledger.com/hc/en-us/articles/360002481534-Check-if-device-is-genuine\">How to ensure your Ledger is genuine</a>.</p>\n\n<p><a href=\"https://blog.trezor.io/psa-non-genuine-trezor-devices-979b64e359a7\">How to ensure your Trezor is genuine</a>.</p>\n\n<p>These steps are particularly important if you buy from places like Amazon where there is very little individual stock quality control.</p>\n\n<h1>Your seed</h1>\n\n<p>When setting up your hardware wallet for the first time, you will be generating a <strong>BRAND NEW SEED</strong>. If you did not do this step during the setup, it&#39;s possible that someone has set it up, hoping you don&#39;t notice.</p>\n\n<p>They then monitor your wallet for transactions and drain your wallet.</p>\n\n<p>Every wallet has a process of generating your seed, then displaying it for you to record. This applies to every type of wallet, so if this isn&#39;t something you did you should investigate ASAP as your funds may be at risk.</p>\n\n<h1>Factory reset</h1>\n\n<p>After you have properly set up your new wallet and have noted down your seed, it&#39;s time to wipe your device. <strong>Yes, this is necessary.</strong></p>\n\n<p>Before sending a single transaction to your new address, factory reset your device and recover it using your seed. This ensures you have noted down your seed correctly and you are <strong>capable</strong> of restoring your wallet if it gets damaged or stolen.</p>\n\n<p>I personally know people who had no trouble setting up their wallet, but needed a lot of help recovering it. Practicing this with a zero-balance wallet is an extremely valuable exercise.</p>\n\n<p>This is such an important step that too many people don&#39;t do. Always practice disaster recovery as hardware devices will always eventually fail. It may be 15 years from now, but hardware doesn&#39;t last the test of time.</p>\n\n<p>Also worth noting - your seed can be used to recover your wallet across another medium. For example, the seed from your Trezor can be put into a desktop wallet like Exodus and you will be able to access everything.</p>\n</div><!-- SC_ON -->",
  "score": 1805,
  "permalink": "/r/CryptoCurrency/comments/lkssul/things_you_need_to_do_when_you_first_receive_your/",
  "subreddit": "CryptoCurrency",
  "id": "lkssul",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619121
}