{
  "author": "Kontikulus",
  "original_created_utc": 1634474766,
  "title": "My stupid opinion: we still are NOT in the mania phase. The top cryptos need to decisively break their ATHs. Then we will see some fireworks!",
  "created_utc": 1634506451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get a little annoyed seeing so many posts about &quot;peak greed&quot;, &quot;be careful!&quot; or &quot;don&#39;t FOMO&quot;.\nGuys, BTC and ETH are still not at their all time highs.   We didn&#39;t even started new price discovery yet! What mania? I do think that we get another pullback before 100k but the journey there did not start yet. \nOverall we are in a very good place right now. We confirmed some high marks and did not crash to lower lows. There are still some great buying opportunities, just don&#39;t start excessively buying something that is already up 300% or more.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/q9y0bb/my_stupid_opinion_we_still_are_not_in_the_mania/",
  "subreddit": "CryptoCurrency",
  "id": "q9y0bb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I get a little annoyed seeing so many posts about \"peak greed\", \"be careful!\" or\n\"don't FOMO\". Guys, BTC and ETH are still not at their all time highs. We didn't\neven started new price discovery yet! What mania? I do think that we get another\npullback before 100k but the journey there did not start…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "欲のピーク」とか「気をつけよう！」とか「FOMOはやめよう」とかの書き込みが多くて、ちょっとイラッとします。\n\"don't FOMO \"とかね。みんな、BTCとETHはまだ史上最高値ではないんだよ。私たちはまだ\n新しい価格の発見もまだ始まっていません どんなマニア？私は、100kまでにもう一回\nしかし、そこへの道のりはまだ始まっていません...。",
      "title": "私の愚かな意見：我々はまだマニアの段階ではありません。トップクリプトは、決定的にATHを破る必要がある。そうすれば花火を見ることができるだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看到这么多关于 \"贪婪的顶峰\"、\"要小心！\"或 \"不要FOMO \"的帖子，我有点恼火了。\n\"不要FOMO\"。伙计们，BTC和ETH仍未达到其历史高点。我们甚至还没有\n甚至还没有开始新的价格发现! 什么狂热？我认为，在10万比特币之前，我们会得到另一次\n在100K之前的回调，但这一过程并没有开始......",
      "title": "我的愚蠢观点：我们仍然没有进入狂热阶段。顶级加密货币需要果断地打破他们的ATH。然后，我们将看到一些烟花!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到這麼多關於 \"貪婪的頂峯\"、\"要小心！\"或 \"不要FOMO \"的帖子，我有點惱火了。\n\"不要FOMO\"。夥計們，BTC和ETH仍未達到其歷史高點。我們甚至還沒有\n甚至還沒有開始新的價格發現! 什麼狂熱？我認爲，在10萬比特幣之前，我們會得到另一次\n在100K之前的回調，但這一過程並沒有開始......",
      "title": "我的愚蠢觀點：我們仍然沒有進入狂熱階段。頂級加密貨幣需要果斷地打破他們的ATH。然後，我們將看到一些煙花!"
    }
  ]
}