{
  "author": "HuskerNatChamps2020",
  "original_created_utc": 1635198372,
  "title": "Bull market reminder: this sub and other crypto subs are dangerous echo-chambers that can lead to portfolio pound town if not taken seriously.",
  "created_utc": 1635216258,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This sub and every other crypto sub is a dangerous echo-chamber aimed at one thing, blasting you with enough information to keep you crawling back. </p>\n\n<p>Every post in a bull-market that is even slightly bearish gets downvoted to hell. Which leaves the remainder of posts bullish, and popular opinions. That is unsafe and dangerous. Having dissenting opinions downvoted to the point that casual viewers never see them is a one way ticket to portfolio pound town. </p>\n\n<p>And much worse, with the advent of moons for upvotes. Not only are we incentivizing popular and up-votable opinions, but worse, we are disincentivizing posts that negate the hivemind. Nobody wants to make a post that will get 3 upvotes, so instead they make a post that will get more even though it’s just regurgitated bullish buzz words.</p>\n\n<p>Be fucking careful if this subreddit is the only source of information you rely on to form opinions for YOUR financial future.</p>\n\n<p>Know the signs of an echo chamber. \n1.is there only one perspective on the front page?\n2.is the viewpoint supported by rumor or incomplete evidence?\n3. Are facts ignored when they prove a dissenting opinion to be true? </p>\n\n<p>Do 5 minutes of research in the s****oon subreddit or the SHIB sub. All 3 of the above points are laid out heavily and often. </p>\n\n<p>How to avoid an echo chamber. \n1. check multiple news sources to make sure you are getting complete and objective information. \n2. interact with people who have different perspectives.\n3. JUST BECAUSE YOU WANT SOMETHING TO BE TRUE DOES NOT MEAN THAT IT IS FACT.</p>\n\n<p>Have a good rest of your day.</p>\n</div><!-- SC_ON -->",
  "score": 210,
  "permalink": "/r/CryptoCurrency/comments/qfr97e/bull_market_reminder_this_sub_and_other_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qfr97e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This sub and every other crypto sub is a dangerous echo-chamber aimed at one\nthing, blasting you with enough information to keep you crawling back.\n\nEvery post in a bull-market that is even slightly bearish gets downvoted to\nhell. Which leaves the remainder of posts bullish, and popular opinions.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブと他のすべての暗号サブは、1つのことを目的とした危険なエコーチェンバーです。\nこのサブに限らず、他のすべての暗号サブは、一つのことを目的とした危険な反響の場です。\n\n強気相場の中で少しでも弱気になった投稿はすべて、地獄のようにダウンボットされます。\n地獄です。残りの投稿は強気のままで、人気のある意見は....。",
      "title": "Bull market reminder: このサブと他のcryptoサブは危険なエコーチェンバーであり、真剣に受け止めないとポートフォリオ・ポンド・タウンになる可能性がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个子系统和其他所有的加密子系统都是一个危险的回声室，目的是为了一件事。\n一件事，用足够的信息轰击你，让你爬着回来。\n\n在牛市中的每一个帖子，哪怕是稍微看跌的，都会被降权到\n地狱。这使得剩下的帖子都是看涨的，而流行的意见....。",
      "title": "牛市提醒：这个子和其他加密货币子是危险的回声室，如果不认真对待，会导致投资组合的捣乱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子系統和其他所有的加密子系統都是一個危險的回聲室，目的是爲了一件事。\n一件事，用足夠的信息轟擊你，讓你爬着回來。\n\n在牛市中的每一個帖子，哪怕是稍微看跌的，都會被降權到\n地獄。這使得剩下的帖子都是看漲的，而流行的意見....。",
      "title": "牛市提醒：這個子和其他加密貨幣子是危險的回聲室，如果不認真對待，會導致投資組合的搗亂。"
    }
  ]
}