{
  "author": "jordanw71",
  "the_new_excerpt": "I should start off by saying that I am a dividend growth investor. I usually\nlike investing in stocks where the risk vs. reward is appealing. In my opinion,\nLockheed Martin fits into that category and is one of my largest positions.\n\nBASIC COMPANY INFORMATION\n\nLockheed Martin is aerospace and…",
  "original_created_utc": 1621262038,
  "localize": [
    {
      "locale": "ja",
      "title": "ロッキード・マーチン（LMT） DD．",
      "the_new_excerpt": "まず最初に、私は配当成長投資家であることをお伝えしておきます。私は通常\nリスクとリターンが見合う銘柄に投資するのが好きなんだ。私の意見では\nロッキード・マーチンはそのカテゴリーに属し、私の最大のポジションの1つです。\n\n基本的な会社情報\n\nロッキード・マーチンは、航空宇宙および..."
    },
    {
      "locale": "zh",
      "title": "洛克希德-马丁公司（LMT）DD。",
      "the_new_excerpt": "首先，我应该说我是一个红利增长投资者。我通常\n我通常喜欢投资于风险和回报都很吸引人的股票。在我看来。\n洛克希德-马丁公司就属于这种类型，是我最大的持仓之一。\n\n公司基本信息\n\n洛克希德-马丁公司是一家航空和航天公司。"
    },
    {
      "locale": "zh-Hant",
      "title": "洛克希德-馬丁公司（LMT）DD。",
      "the_new_excerpt": "首先，我應該說我是一個紅利增長投資者。我通常\n我通常喜歡投資於風險和回報都很吸引人的股票。在我看來。\n洛克希德-馬丁公司就屬於這種類型，是我最大的持倉之一。\n\n公司基本信息\n\n洛克希德-馬丁公司是一家航空和航天公司。"
    }
  ],
  "title": "Lockheed Martin (LMT) DD.",
  "created_utc": 1621279292,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I should start off by saying that I am a dividend growth investor. I usually like investing in stocks where the risk vs. reward is appealing. In my opinion, Lockheed Martin fits into that category and is one of my largest positions.</p>\n\n<p>BASIC COMPANY INFORMATION</p>\n\n<p>Lockheed Martin is aerospace and defence company which provides very high-end military equipment. Aircraft is where they particularly shine with the F-35 accounting for about 30% of the company&#39;s revenue.</p>\n\n<p>The lion&#39;s share of the company&#39;s revenue comes the united states government. Most of all aircraft used by the air force comes from this one company.</p>\n\n<p>CEO INFORMATION</p>\n\n<p>Lockheed recently announced in 2020 a new CEO to run the company. His name is Jim Taiclet .While having several years of experience with Lockheed, his previous experience as CEO was not with another defense company.</p>\n\n<p>Most of his career was spent running the successful REIT known as American Tower (AMT). The company has been very successful both during and after his tenure. (Which is another great dividend growth company I might add).</p>\n\n<p><a href=\"https://www.lockheedmartin.com/en-us/who-we-are/leadership-governance/james-taiclet-joins-lockheed-martin-president-ceo.html\">https://www.lockheedmartin.com/en-us/who-we-are/leadership-governance/james-taiclet-joins-lockheed-martin-president-ceo.html</a></p>\n\n<p>DIVIDEND HISTORY/SAHRE BUYBACKS</p>\n\n<p>Quarterly Payout (At A Glance)\n2020 - $2.60\n2019 - $2.40\n2018 - $2.20\n2017 - $2.00\n2016 - $1.82\n2015 - $1.65</p>\n\n<p>Dividend Yield = 2.68%</p>\n\n<p>Payout Ratio = ~40% (Very Safe)</p>\n\n<p>Let me start be saying that this company is EXTREMELY  profitable. The company is currently on an 18 year consecutive dividend streak. Not to mention the company buys back BILLIONS of its own stock year in and year out. I fully expect this company to be a dividend aristocrat in a few years.</p>\n\n<p>The dividend yield is about double that of the S&amp;P as of today and only has a Payout Ratio of about 40%. This means that not only does this company has a good yield while buying back stock, but this company can EASILY afford to maintain and RAISE the dividend over time dramatically.</p>\n\n<p><a href=\"https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/lockheed-ramps-dividend-8-3-114733950.html\">https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/lockheed-ramps-dividend-8-3-114733950.html</a></p>\n\n<p><a href=\"https://investors.lockheedmartin.com/stock-information/dividend-history\">https://investors.lockheedmartin.com/stock-information/dividend-history</a></p>\n\n<p>MERGERS &amp; ACQUISITIONS</p>\n\n<p>The company has a long history of M&amp;A activity and the most recent example of this Aerojet Rocketdyne (AJRD). This is yet another example of the company using its financial fortress of a balance sheet and exemplary cash flows to acquire other businesses.</p>\n\n<p>AJRD is a space and aeronautics company which could potentially extend more deals with NASA and the U.S. government. This was recently announced about six months ago in December 2020 and is likely to finalize in 2021.</p>\n\n<p><a href=\"https://news.lockheedmartin.com/2020-12-20-Lockheed-Martin-to-Acquire-Aerojet-Rocketdyne-Strengthening-Position-as-Leading-Provider-of-Technologies-to-Deter-Threats-and-Help-Secure-the-United-States-and-its-Allies\">https://news.lockheedmartin.com/2020-12-20-Lockheed-Martin-to-Acquire-Aerojet-Rocketdyne-Strengthening-Position-as-Leading-Provider-of-Technologies-to-Deter-Threats-and-Help-Secure-the-United-States-and-its-Allies</a></p>\n\n<p>FINANCIAL INFORMATION</p>\n\n<p>The company has incredible financials. The balance sheet is a financial fortress. The debt load is very controllable. Cash flows continue to pour in record numbers year after year and 2021 guidance issued by the company expects record revenue and record EPS for the year. </p>\n\n<p>The Biden administration just issued an increase in defense spending of about ~1% earlier this year. All the more reason for this company&#39;s financials to continue to stay healthy. Financials linked below....</p>\n\n<p><a href=\"https://finance.yahoo.com/quote/LMT/balance-sheet/\">https://finance.yahoo.com/quote/LMT/balance-sheet/</a></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/LMT/cash-flow?p=LMT\">https://finance.yahoo.com/quote/LMT/cash-flow?p=LMT</a></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/LMT/financials?p=LMT\">https://finance.yahoo.com/quote/LMT/financials?p=LMT</a></p>\n\n<p>GROWTH STORY MOVING FORWARD</p>\n\n<p>LMT is expected to grow top-line revenue numbers 4.50% in 2021 and 3.70% in 2022. Earnings per share for  the company in 2020 finished at $24.58. This is expected to grow to $26.68 in 2021 and $27.90 in 2022.</p>\n\n<p>Contracts are usually signed many years in advance. Revenues can be easily forcasted for the next several years due to the timelines of the contracts. Furthermore, innovation is not only encouraged, but expected by shareholders AND the united states military is order for our nation to maintain relevant in terms of weaponry.</p>\n\n<p>New age military equipment is usually pretty &quot;hush-hush&quot; on what is in the works but Lockheed Martin does disclose some of these new products including technologies such as new highly intelligent drones, missile systems, and even targeted lasers.</p>\n\n<p>One thing is for sure, the military will continue come out with bigger and badder weapons. Who will likely be selling it to them? Probably good ole LMT.</p>\n\n<p>Newer acquisitions such as the recent AJRD deal allows Lockheed to also focus on other products in the space category and is another wildcard with some potential.</p>\n\n<p><a href=\"https://finance.yahoo.com/quote/LMT/analysis?p=LMT\">https://finance.yahoo.com/quote/LMT/analysis?p=LMT</a></p>\n\n<p>COMPETITIVE ADVANTAGE/ BARRIER TO ENTRY</p>\n\n<p>If you were given 10 million dollars, and your goal was to create a globally recognized soda brand, could you get it done? Maybe. What about 10 million to create a social media platform? Also a maybe. But could you start a aeronautics and/or defence company with 10 million budget? Absolutely not.</p>\n\n<p>The regulations are incredibly strict. The demand for capital is VERY HIGH with projects frequently running into the billions of dollars. Switching from one business to another poses risks for the government and our military and are usually avoided.</p>\n\n<p>This makes the U.S. government very loyal and sticky to LMT business and this is very likely to continue. While there are competitors in the space....Lockheed continues to dominate this market.</p>\n\n<p>VALUATION (WHY IT&#39;S A GREAT BUY IMO)</p>\n\n<p>As mentioned earlier, the company is expected to produce $27.90 in EPS in 2022. Based of of today&#39;s price of $390, this gives this company a forward PE ratio of ~13.9. This is an EXTREMELY low forward PE ratio for a company putting up record numbers and dominating the market that it operates in. </p>\n\n<p>This is even more impressive considering it&#39;s still off a fair amount from it&#39;s previous all time highs. I am very bullish and this is one of my largest positions. I am not remotely interested in selling. I am buying at these prices or really anything even close to these levels. I wouldn&#39;t sell a share if this company were to go to $800 a share tomorrow morning.</p>\n\n<p><a href=\"https://finance.yahoo.com/quote/LMT/analysis?p=LMT\">https://finance.yahoo.com/quote/LMT/analysis?p=LMT</a></p>\n\n<p>RISK FACTORS TO CONSIDER</p>\n\n<p>Almost all revenue comes from one customer (the government). It is steady and consistent but if the government were to fall out of love with Lockheed then this company would be negatively impacted.</p>\n\n<p>There aren&#39;t many who could take down LMTs throne but their main competitor is Boeing. Boeing has the capital and leverage to compete with Lockheed Martin long term.</p>\n\n<p>This company is susceptible to a number of different geopolitical risks. Conflicts with other countries could be both a Negative AND a positive for Lockheed.</p>\n\n<p>The current political climate is leaning harder and harder towards a more relaxed defence budget.</p>\n\n<p>THANKS FOR READING! COMMENT WHAT YOU THINK BELOW!</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/investing/comments/nehv61/lockheed_martin_lmt_dd/",
  "subreddit": "investing",
  "id": "nehv61",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803263
}