{
  "author": "I-LUV-CUPCAKES-AND-U",
  "original_created_utc": 1627060524,
  "title": "I live in India and Today i paid my pizza bill officially with Nano!!",
  "created_utc": 1627069021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Please don&#39;t show this to the police, crypto isn&#39;t a legal tender here but i did paid for my pizza with 1.02 Nano today. </p>\n\n<p>There&#39;s a great cafe here in my city and i regularly visit there so the owner knows me very well. He&#39;s a big fan of crypto too especially dogecoin (i know but what can i do?).</p>\n\n<p>My credit limit was expired for this month so i asked him if i could pay him in crypto, he said sure and then i paid him with Nano in an instant. Isn&#39;t that cool? I mean for you guys it&#39;s pretty common but i did it for the first time and it was great. The pizza was amazing too as always.</p>\n\n<p>Also, Dear Government, please legalize crypto</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/CryptoCurrency/comments/oq6y2s/i_live_in_india_and_today_i_paid_my_pizza_bill/",
  "subreddit": "CryptoCurrency",
  "id": "oq6y2s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Please don't show this to the police, crypto isn't a legal tender here but i did\npaid for my pizza with 1.02 Nano today.\n\nThere's a great cafe here in my city and i regularly visit there so the owner\nknows me very well. He's a big fan of crypto too especially dogecoin (i know but\nwhat can i…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これを警察に見せないでください。ここでは暗号は法定通貨ではありませんが、私は次のようにしました。\n今日は1.02ナノでピザの支払いをしました。\n\n私の街には素敵なカフェがあって、私はいつもそこを訪れるので、オーナーは私のことをよく知っています。\n私のことをよく知っています。彼は暗号の大ファンで、特にdogecoin（知ってるけど\nどうしたらいいんだろう...。",
      "title": "私はインドに住んでいますが、今日私はピザの請求書をNanoで正式に支払いました!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请不要把这个给警察看，加密货币在这里不是合法的货币，但我确实用了\n今天用1.02纳米支付了我的披萨。\n\n我所在的城市有一家很好的咖啡馆，我经常去那里，所以老板很了解我。\n所以老板很了解我。他也是加密货币的大粉丝，尤其是狗币（我知道，但\n我可以...",
      "title": "我住在印度，今天我正式用Nano支付了我的比萨饼账单！！。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請不要把這個給警察看，加密貨幣在這裏不是合法的貨幣，但我確實用了\n今天用1.02納米支付了我的披薩。\n\n我所在的城市有一家很好的咖啡館，我經常去那裏，所以老闆很瞭解我。\n所以老闆很瞭解我。他也是加密貨幣的大粉絲，尤其是狗幣（我知道，但\n我可以...",
      "title": "我住在印度，今天我正式用Nano支付了我的比薩餅賬單！！。"
    }
  ]
}