{
  "author": "Yeetasaurus1979",
  "original_created_utc": 1636052781,
  "title": "This isn’t the space for your libertarian rants about how the government isn’t allowed to tax you.",
  "created_utc": 1636061445,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You make money, you pay into the pot. The number of posts/comments I see in the vein of “taxation is theft” and just general entitlement about every cent we make is ridiculous. You are not exempt, none of us are. </p>\n\n<p>You are not a sovereign citizen. Your internet money does not excuse you from your respective tax laws. Telling people online how you are dodging taxes is also fucking stupid. </p>\n\n<p>Track your shit, pay your taxes, and move on. If you get cute you’re going to get caught. Crypto isn’t worth paying fines - or worse, going to jail - over.</p>\n\n<p>Edit: i’ve been called a lot of things on this thread, but I think my favorite act by the libertarian dude bros was someone reporting me to Reddit for suicidal thoughts/needing help lol</p>\n</div><!-- SC_ON -->",
  "score": 734,
  "permalink": "/r/CryptoCurrency/comments/qmrys0/this_isnt_the_space_for_your_libertarian_rants/",
  "subreddit": "CryptoCurrency",
  "id": "qmrys0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You make money, you pay into the pot. The number of posts/comments I see in the\nvein of “taxation is theft” and just general entitlement about every cent we\nmake is ridiculous. You are not exempt, none of us are.\n\nYou are not a sovereign citizen. Your internet money does not excuse you from\nyour…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お金を稼いだら、ポットに納める。私が目にするのは、「税金は窃盗だ」という内容の投稿やコメントの数です。\n課税は窃盗だ」というような投稿やコメントが多く見られます。\nばかげています。あなたは免除されていませんし、私たちの誰もがそうです。\n\nあなたは主権のある市民ではありません。あなたがインターネットで稼いだお金は、あなたに免罪符を与えるものではありません。\nあなたの...",
      "title": "ここは、政府があなたに課税することは許されないというリバタリアン的な主張をする場所ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你赚了钱，你就得向锅里交钱。我看到的帖子/评论的数量是\n我看到的 \"税收是偷窃 \"和对我们赚的每一分钱的一般权利的帖子/评论的数量是荒谬的。\n是荒谬的。你不能豁免，我们都不能。\n\n你不是一个有主权的公民。你在互联网上的钱并不能成为你的借口\n你的...",
      "title": "这里不是你的自由主义者关于政府不允许向你征税的咆哮的空间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你賺了錢，你就得向鍋裏交錢。我看到的帖子/評論的數量是\n我看到的 \"稅收是偷竊 \"和對我們賺的每一分錢的一般權利的帖子/評論的數量是荒謬的。\n是荒謬的。你不能豁免，我們都不能。\n\n你不是一個有主權的公民。你在互聯網上的錢並不能成爲你的藉口\n你的...",
      "title": "這裏不是你的自由主義者關於政府不允許向你徵稅的咆哮的空間。"
    }
  ]
}