{
  "author": "maxidpimp",
  "original_created_utc": 1655238466,
  "title": "It's sad how people only see crypto as a way to quick money",
  "created_utc": 1655261792,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Did everyone forget? Forget about how the financial system before crypto was convoluted, slow and expensive, how crypto forced the financial system to evolve and become what it is today?&lt;/p&gt;\n\n&lt;p&gt;Crypto used to be a hub for tech enthusiasts, a digital place where bleeding edge technology is developed helping reduce cost across the board and trustless accounting among many other things.&lt;/p&gt;\n\n&lt;p&gt;Now it is just in a shape were all that matters is how much GAINZ I made today leveraging my capital to oblivion, full of greed and insanity&lt;/p&gt;\n\n&lt;p&gt;This is a reminder for a of you to remember why we are here, a call to return sanity and sustainable grow to crypto, nothing good will come from degenerate gambling and we all should be ashamed of ourselves&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s make crypto great again, let&amp;#39;s make crypto about making life easier for everyone and having a smarter future&lt;/p&gt;\n\n&lt;p&gt;VALUES MATTER&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/vccqz8/its_sad_how_people_only_see_crypto_as_a_way_to/",
  "subreddit": "CryptoCurrency",
  "id": "vccqz8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Did everyone forget? Forget about how the financial system before crypto was\nconvoluted, slow and expensive, how crypto forced the financial system to evolve\nand become what it is today?\n\nCrypto used to be a hub for tech enthusiasts, a digital place where bleeding\nedge technology is developed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんな忘れたの？暗号化以前の金融システムがいかに\n複雑で、遅くて、高価なものでした。暗号は、金融システムを進化させ、\nを進化させ、現在のような形になったことを忘れてしまったのでしょうか？\n\n暗号は、かつて技術愛好家のハブであり、最先端の技術が開発されるデジタルな場所でした。\nデジタルな場であった...",
      "title": "暗号を手っ取り早くお金を得る方法としてしか見ていない人がいるのは悲しいことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家都忘了吗？忘记了加密货币之前的金融系统是如何\n错综复杂、缓慢而昂贵的金融系统，加密货币是如何迫使金融系统进化的\n并成为今天的样子？\n\n加密货币曾经是一个技术爱好者的中心，一个开发尖端技术的数字场所\n边缘技术被开发的数字场所...",
      "title": "人们只把加密货币看作是一种快速赚钱的方式，这很可悲。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家都忘了嗎？忘記了加密貨幣之前的金融系統是如何\n錯綜複雜、緩慢而昂貴的金融系統，加密貨幣是如何迫使金融系統進化的\n併成爲今天的樣子？\n\n加密貨幣曾經是一個技術愛好者的中心，一個開發尖端技術的數字場所\n邊緣技術被開發的數字場所...",
      "title": "人們只把加密貨幣看作是一種快速賺錢的方式，這很可悲。"
    }
  ]
}