{
  "author": "AskScienceModerator",
  "the_new_excerpt": "Millions of people have now been vaccinated against SARS-COV-2 and new vaccine\ncandidates are being approved by countries around the world. Yet infection\nnumbers and deaths continue rising worldwide, and new strains of the virus are\nemerging. With barely a year's worth of clinical data on…",
  "original_created_utc": 1612447256,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "目前已有数百万人接种了SARS-COV-2疫苗和新疫苗。\n候选人正在被世界各国批准。然而，感染\n世界范围内病毒的数量和死亡人数持续上升，新的病毒株也在不断增加。\n崭露头角。随着几乎没有一年的临床数据，在...",
      "title": "AskScience AMA系列。COVID疫苗的更新。AUA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前已有數百萬人接種了SARS-COV-2疫苗和新疫苗。\n候選人正在被世界各國批准。然而，感染\n世界範圍內病毒的數量和死亡人數持續上升，新的病毒株也在不斷增加。\n嶄露頭角。隨着幾乎沒有一年的臨牀數據，在...",
      "title": "AskScience AMA系列。COVID疫苗的更新。AUA!"
    }
  ],
  "title": "AskScience AMA Series: Updates on COVID vaccines. AUA!",
  "created_utc": 1612453328,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Millions of people have now been vaccinated against SARS-COV-2 and new vaccine candidates are being approved by countries around the world. Yet infection numbers and deaths continue rising worldwide, and new strains of the virus are emerging. With barely a year&#39;s worth of clinical data on protections offered by the current batch of vaccines, numerous questions remain as to just how effective these different vaccines will be in ending this pandemic.</p>\n\n<p>Join us today at 2 PM ET for a discussion with vaccine and immunology experts, organized by the American Society for Microbiology (ASM). We&#39;ll answer questions on how the current COVID vaccines work (and what the differences are between the different vaccines), what sort of protection the vaccine(s) offer against current, emerging and future strains of the virus, and how the various vaccine platforms used to develop the COVID vaccines can be used to fight against future diseases. Ask us anything!</p>\n\n<p>With us today are:</p>\n\n<ul>\n<li><a href=\"https://www.bcm.edu/people-search/maria-bottazzi-18431\">Dr. Maria Elena Bottazzi</a>, Ph.D., FASTMH (<a href=\"/u/MEBNSTM\">u/MEBNSTM</a>)- Associate Dean, National School of Tropical Medicine, Baylor College of Medicine</li>\n<li><a href=\"https://medicine.umich.edu/dept/microbiology-immunology/oveta-fuller-phd#websites\">Dr. A. Oveta Fuller</a>, Ph.D. (<a href=\"/u/TrustMessenger\">u/TrustMessenger</a>)- Associate Professor, African Studies Center International Institute; Microbiology and Immunology Department, University of Michigan Medical School</li>\n<li><a href=\"https://www.cvr.pitt.edu/people/kevin-mccarthy-phd\">Dr. Kevin McCarthy</a>, Ph.D. (<a href=\"/u/mccarthy_kr\">u/mccarthy_kr</a>)-  Assistant Professor, Center for Vaccine Research; Professor of Microbiology and Molecular Genetics, University of Pittsburgh</li>\n<li><a href=\"https://angelarasmussen.org/\">Dr. Angela Rasmussen</a>, Ph.D. (<a href=\"/u/angie_rasmussen\">u/angie_rasmussen</a>)- Affiliate, Georgetown University Center for Global Health Science and Security</li>\n</ul>\n\n<p>Links:</p>\n\n<ul>\n<li><a href=\"https://asm.org/Videos/Immunological-Memory-to-SARS-CoV-2-Microbial-M-1\">https://asm.org/Videos/Immunological-Memory-to-SARS-CoV-2-Microbial-M-1</a></li>\n<li><a href=\"https://asm.org/Press-Releases/2020/ASM-Initiatives-for-COVID-19\">https://asm.org/Press-Releases/2020/ASM-Initiatives-for-COVID-19</a></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 292,
  "permalink": "/r/askscience/comments/lcg8l0/askscience_ama_series_updates_on_covid_vaccines/",
  "subreddit": "askscience",
  "id": "lcg8l0",
  "is_self": true,
  "media": null,
  "is_video": false
}