{
  "author": "funkless_eck",
  "original_created_utc": 1632072671,
  "title": "I'm a foreigner who has never been to IHOP. How should I order to have the most \"authentic\" experience?",
  "created_utc": 1632093696,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: I appreciate all the responses telling me <em>not</em> to go, but even if you wouldn&#39;t recommend it, I am looking to learn something about the culture of my adoptive country. I&#39;ve been to MoMA, Carnegie Hall, Statue of Liberty, Waffle House, the Vegas Strip... all the greats... I&#39;d ask you instead to answer in good faith as if a thought experiment, if you really don&#39;t want to give your personal endorsement to the place.</p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/NoStupidQuestions/comments/prcez7/im_a_foreigner_who_has_never_been_to_ihop_how/",
  "subreddit": "NoStupidQuestions",
  "id": "prcez7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: I appreciate all the responses telling me not to go, but even if you\nwouldn't recommend it, I am looking to learn something about the culture of my\nadoptive country. I've been to MoMA, Carnegie Hall, Statue of Liberty, Waffle\nHouse, the Vegas Strip... all the greats... I'd ask you instead to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：「行かない方がいい」というご意見には感謝していますが、たとえお勧めできないとしても\n勧められなくても、私は自分の養子先の国の文化について何かを学びたいと思っています。\n養子先の国の文化を知りたいと思っています。MoMA、カーネギーホール、自由の女神、ワッフルハウス、ラスベガスのストリップ......すべての有名な場所に行きました。\nワッフルハウス、ラスベガス・ストリップ......すべての有名な場所に行ったことがあります。代わりにあなたにお願いしたいのは...",
      "title": "私はIHOPに行ったことのない外国人です。どのように注文すれば、最も「本物」の体験ができるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我感谢所有告诉我不要去的回复，但即使你\n但即使你不建议我去，我也想了解一下我收养国的文化。\n养国的文化。我已经去过纽约现代艺术博物馆、卡内基音乐厅、自由女神像、华夫饼屋、拉斯维加斯大道......所有伟大的地方。\n馆、拉斯维加斯大道......所有伟大的地方......。我想请你代替...",
      "title": "我是一个从未去过IHOP的外国人。我应该如何点餐才能获得最 \"正宗 \"的体验？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我感謝所有告訴我不要去的回覆，但即使你\n但即使你不建議我去，我也想了解一下我收養國的文化。\n養國的文化。我已經去過紐約現代藝術博物館、卡內基音樂廳、自由女神像、華夫餅屋、拉斯維加斯大道......所有偉大的地方。\n館、拉斯維加斯大道......所有偉大的地方......。我想請你代替...",
      "title": "我是一個從未去過IHOP的外國人。我應該如何點餐才能獲得最 \"正宗 \"的體驗？"
    }
  ]
}