{
  "author": "SageRunsTrain",
  "original_created_utc": 1634445255,
  "title": "Massive Scam Happening In The NFT Community",
  "created_utc": 1634463413,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just got sent a discord channel invite from someone. It was an invite to Cool Cats NFT channel. They’re a highly profitable and respected project and the message said they were doing a massive giveaway. I decided to check it out. Pop in and I’m sent to their verify channel which is usually pretty normal. Shows they have 95,000 members and all that. They require you to !join command to verify and you get sent a message by the bot Collab.Land to connect your MetaMask to verify. A little weird to verify using your wallet just to join a channel, but whatever. Thought maybe that’s just how they do it? So I type in my password to unlock my wallet and then it asks for my seed phrase.. I was on my iPad so I thought maybe I hadn’t logged onto/set up my metamask on here yet so I was looking for my seed phrase. I got distracted looking for it for awhile and came back a lil later and tried again when I started thinking this is kinda odd… I’ve used Collab.Land quite a few times but this was my first DM to the bot… odd. Searched my DMs for “collab” … BOOM .. two identical bots come back. One with all my previous messages and that new one.. I’m like wowwwwwww. Go back to the “Cool Cats” discord welcome channel and there are soOoOo many people joining and I’m like this is so bad!! I typed “THIS IS A SCAM!” And hit enter. My message was immediately deleted and the server was deleted from my server list. </p>\n\n<p>Someone or some people created a completely identical Collab.Land bot, very legit looking Discord channel with 95,000 members!? , and an extremely legit MetaMask modal that I’m assuming is harvesting everyone’s seed phrases and wallet login passwords. Haven’t seen a post about it yet. Spread the word. This one is elaborate. Help others to not get scammed.</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/CryptoCurrency/comments/q9rsjl/massive_scam_happening_in_the_nft_community/",
  "subreddit": "CryptoCurrency",
  "id": "q9rsjl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just got sent a discord channel invite from someone. It was an invite to Cool\nCats NFT channel. They’re a highly profitable and respected project and the\nmessage said they were doing a massive giveaway. I decided to check it out. Pop\nin and I’m sent to their verify channel which is usually pretty…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある人からdiscordチャンネルの招待状が送られてきました。それは「Cool」への招待でした。\nCats NFTチャンネルへの招待でした。彼らは非常に収益性が高く、尊敬されているプロジェクトで、メッセージには\n大規模なプレゼントを行っているというメッセージでした。私はそれをチェックすることにしました。ポップイン\nをクリックすると、彼らの検証チャンネルに飛ばされ、そこには通常、かなりの...",
      "title": "NFTコミュニティで起きている大規模なスキャム"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚收到一个人发来的discord频道邀请。它是一个邀请，邀请我去Cool\nCats NFT频道。他们是一个高利润和受人尊敬的项目。\n消息说他们正在做一个大规模的赠品。我决定去看看。点击\n在，我被送到他们的验证频道，这通常是很...",
      "title": "在NFT社区发生的大规模骗局"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛收到一個人發來的discord頻道邀請。它是一個邀請，邀請我去Cool\nCats NFT頻道。他們是一個高利潤和受人尊敬的項目。\n消息說他們正在做一個大規模的贈品。我決定去看看。點擊\n在，我被送到他們的驗證頻道，這通常是很...",
      "title": "在NFT社區發生的大規模騙局"
    }
  ]
}