{
  "author": "GeneReddit123",
  "original_created_utc": 1635466360,
  "title": "Many cultures had customary dowry, paid by the parents of a bride to her groom. Meanwhile, other cultures, often in the same or similar region and period, had a bride price, paid by the groom to the parents of the bride. What factors led to such diametrically opposite customs?",
  "created_utc": 1635477840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know there are some technical differences (the dowry wouldn&#39;t be paid to the groom per se, but rather given to the entire household). But I think that, largely, the point stands. A dowry would add funds from the bride&#39;s family to the household, while a bride price would do the opposite, since the groom&#39;s money (which would otherwise go to the household) would have to go to the bride&#39;s family instead.</p>\n\n<p>Both customs were common in similar (if not exactly the same) periods and regions, such as large parts of Asia and the Middle East, including cultures which are considered to have relatively similar social customs, family and household structures, religions, economies, etc. Both a dowry and a bride price could be a very significant amount of money, often being the make-or-break in determining whether a marriage would happen or not.) </p>\n\n<p>I understand the value of a dowry in providing a &quot;starting capital&quot; for the family, as well as financial security to the bride in case of abandonment or becoming a widow. Conversely, I also understand the value of a bride price in patriarchal cultures where a daughter would be considered a family &quot;asset&quot; by her parents, in lieu of the work a son could provide instead, to be &quot;cashed in&quot; in marriage. Both financial flows make some sense, but since they&#39;re diametrically opposite, I&#39;d imagine that, in similar cultural circumstances, the socioeconomic benefit of one flow would prevail over the other, and become a universally accepted social norm, rather than both coexisting at the same time.</p>\n\n<p>So it&#39;s perplexing how this significant amount of money flowed one way in certain situations, and the other way in others.</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/AskHistorians/comments/qi0791/many_cultures_had_customary_dowry_paid_by_the/",
  "subreddit": "AskHistorians",
  "id": "qi0791",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know there are some technical differences (the dowry wouldn't be paid to the\ngroom per se, but rather given to the entire household). But I think that,\nlargely, the point stands. A dowry would add funds from the bride's family to\nthe household, while a bride price would do the opposite, since the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "技術的な違いがあるのは承知していますが（持参金は花婿には支払われません。\n花婿に支払われるのではなく、家族全員に与えられる）。) しかし、私はこう思います。\n大まかに言えば、その通りだと思います。持参金は、新婦の家族の資金を家計に加えるものです。\n世帯に追加されるのに対し、花嫁代金は逆に...。",
      "title": "多くの文化では、花嫁の親が花婿に支払う持参金の習慣がありました。一方、同じ地域、同じ時代にあっても、新郎が新婦の両親に支払う「花嫁代金」を持つ文化もありました。このような正反対の習慣が生まれた要因は何でしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有一些技术上的差异（嫁妆不会支付给新郎本身，而是给整个家庭。\n新郎本身，而是给整个家庭）。) 但我认为。\n大体上，观点是正确的。嫁妆会使新娘家的资金增加到\n家庭，而彩礼则相反，因为......。",
      "title": "许多文化都有习惯性的嫁妆，由新娘的父母支付给她的新郎。同时，其他文化，通常在相同或相似的地区和时期，也有彩礼，由新郎支付给新娘的父母。是什么因素导致了这种截然相反的习俗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有一些技術上的差異（嫁妝不會支付給新郎本身，而是給整個家庭。\n新郎本身，而是給整個家庭）。) 但我認爲。\n大體上，觀點是正確的。嫁妝會使新娘家的資金增加到\n家庭，而彩禮則相反，因爲......。",
      "title": "許多文化都有習慣性的嫁妝，由新娘的父母支付給她的新郎。同時，其他文化，通常在相同或相似的地區和時期，也有彩禮，由新郎支付給新娘的父母。是什麼因素導致了這種截然相反的習俗？"
    }
  ]
}