{
  "author": "iwegian",
  "the_new_excerpt": "I've seen 2 therapists in the last year. In both cases, I came to know that they\nhad one or the other of Alexa or Siri.\n\nHow much do those devices really listen or record what's happening in the same\nroom? Aren't there ethical implications and breaches of confidentiality inherent\nin their use within…",
  "original_created_utc": 1617761575,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この1年で2人のセラピストに会いました。どちらのケースでも、彼らがAlexaとSiriのどちらかを持っていることを知りました。\nAlexaとSiriのどちらか一方を持っていることを知りました。\n\nそれらのデバイスは、同じ部屋で起きていることをどれだけ聞いたり、記録したりするのでしょうか？\n倫理的に問題があるのではないか？倫理的な意味合いや守秘義務の違反があるのではないか？\n倫理的に問題があるのではないか？",
      "title": "セラピストのオフィスでのAlexaやSiriの倫理について"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "去年，我见过2个治疗师。在这两种情况下，我都知道，他们...\n有一个或另一个的Alexa或Siri。\n\n这些设备到底能听懂或记录多少发生在同一个地方的事情。\n房间？难道不存在道德问题和违反保密性的内在问题吗？\n在他们的使用内...",
      "title": "Alexa或Siri在治疗师办公室中的道德规范。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去年，我見過2個治療師。在這兩種情況下，我都知道，他們...\n有一個或另一個的Alexa或Siri。\n\n這些設備到底能聽懂或記錄多少發生在同一個地方的事情。\n房間？難道不存在道德問題和違反保密性的內在問題嗎？\n在他們的使用內...",
      "title": "Alexa或Siri在治療師辦公室中的道德規範。"
    }
  ],
  "title": "Ethics of Alexa or Siri in a therapist's office",
  "created_utc": 1617819585,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen 2 therapists in the last year. In both cases, I came to know that they had one or the other of Alexa or Siri. </p>\n\n<p>How much do those devices really listen or record what&#39;s happening in the same room? Aren&#39;t there ethical implications and breaches of confidentiality inherent in their use within a therapy space? Should I ask either the therapist or their supervisor to remove them, or is it not a big deal?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/mlrvmq/ethics_of_alexa_or_siri_in_a_therapists_office/",
  "subreddit": "TrueAskReddit",
  "id": "mlrvmq",
  "is_self": true,
  "media": null,
  "is_video": false
}