{
  "author": "TimikaWestfield",
  "original_created_utc": 1640413190,
  "title": "Building and Living off passive income. Stake it till you make it!",
  "created_utc": 1640424762,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been looking at a lot of posts on the sub and noticed that a lot of of us here are newbies who have the ultimate goal of financial independence, of not having to worry about money or constantly check at prices in order to avoid having to go to work for another day but there are also some of us here who are trying to TIME the market instead of time IN the market on crypto which is very volatile. This is a very risky move. &lt;/p&gt;\n\n&lt;p&gt;Here’s what you can do instead: &lt;/p&gt;\n\n&lt;p&gt;Make a list of cryptos you&amp;#39;ve extensively studied and are confident about. Set a deadline or a monetary value for yourself as a goal. Then, on a regular basis, invest a defined amount based on your salary into cryptos. The most important ideas to remember are DCA and HODL.&lt;/p&gt;\n\n&lt;p&gt;When you&amp;#39;ve gained a better understanding of cryptos, it&amp;#39;s time to go on to the next step, which is creating passive income (staking, yielding, etc). &lt;/p&gt;\n\n&lt;p&gt;You can either:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Stake your crypto with the protocol you like with your cryptowallet.&lt;/li&gt;\n&lt;li&gt;Use platforms to lend or stake your crypto in exchange for compensation for permitting the platform to keep or lock up your coin. &lt;a href=\"https://rocketpool.net/\"&gt;Rocketpool&lt;/a&gt;, &lt;a href=\"http://haruinvest.com/\"&gt;Haru Invest&lt;/a&gt;, &lt;a href=\"https://www.kraken.com/\"&gt;Kraken&lt;/a&gt; and Lido are three investments that I personally suggest.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now imagine a future where you won’t be working as much if your passive income grows. It’s very much possible if you do it right. Staking or lending crypto alone can provide you with sufficient passive revenue. The market will reward you if you can put together a strategy and be patient in executing it.&lt;/p&gt;\n\n&lt;p&gt;Now it won’t be easy. If there are  bull markets, there will also be bear markets. All of this should be irrelevant, though, provided you have set goals and timetables for when you want to sell. Developing an emotional tie to the charts and tickers will only result in you selling at a loss.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/ro41av/building_and_living_off_passive_income_stake_it/",
  "subreddit": "CryptoCurrency",
  "id": "ro41av",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been looking at a lot of posts on the sub and noticed that a lot of of us\nhere are newbies who have the ultimate goal of financial independence, of not\nhaving to worry about money or constantly check at prices in order to avoid\nhaving to go to work for another day but there are also some of us…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サブの投稿をいろいろと見ていて気づいたのですが、私たちの多くが\n経済的な自立を最終的な目標としている新米たちです。\nお金の心配をする必要がなく、また、常に価格をチェックする必要がない。\nでも、中には...。",
      "title": "パッシブインカムを構築し、生活する。成功するまで杭を打て"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在看子上的很多帖子，发现我们中的很多人\n这里的很多人都是新手，他们的最终目标是经济独立，不需要担心钱的问题，也不需要不断地检查价格。\n不用担心钱的问题，也不用经常查看价格，以避免\n不用担心钱的问题，也不用经常查看价格以避免再去工作，但也有一些人......",
      "title": "建立并依靠被动收入生活。盯住它，直到你成功!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在看子上的很多帖子，發現我們中的很多人\n這裏的很多人都是新手，他們的最終目標是經濟獨立，不需要擔心錢的問題，也不需要不斷地檢查價格。\n不用擔心錢的問題，也不用經常查看價格，以避免\n不用擔心錢的問題，也不用經常查看價格以避免再去工作，但也有一些人......",
      "title": "建立並依靠被動收入生活。盯住它，直到你成功!"
    }
  ]
}