{
  "author": "NineteenSixtySix",
  "the_new_excerpt": "https://www.businesswire.com/news/home/20210506006341/en/Palantir-Technologies-and-the-Royal-Navy-Extend-Contracts\n\nhttps://twitter.com/PalantirTech/status/1390562068315656194?s=20\n\nMay 07, 2021 02:00 AM Eastern Daylight Time\n\nLONDON--(BUSINESS WIRE)--Palantir Technologies Inc. (NYSE:PLTR) announced…",
  "original_created_utc": 1620371623,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.businesswire.com/news/home/20210506006341/en/Palantir-Technologies-and-the-Royal-Navy-Extend-Contracts\n\nhttps://twitter.com/PalantirTech/status/1390562068315656194?s=20\n\n2021年5月07日午前02時00分（東部夏時間\n\nロンドン--(BUSINESS WIRE)--Palantir Technologies Inc. (NYSE:PLTR) が発表した...",
      "title": "パランティア・テクノロジーズと英国海軍が契約を延長"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.businesswire.com/news/home/20210506006341/en/Palantir-Technologies-and-the-Royal-Navy-Extend-Contracts\n\nhttps://twitter.com/PalantirTech/status/1390562068315656194?s=20\n\n东部夏令时2021年5月7日上午02:00\n\n伦敦--(美国商业资讯)--Palantir Technologies Inc. (NYSE:PLTR)宣布...",
      "title": "帕兰提尔技术公司和皇家海军延长合同期限"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.businesswire.com/news/home/20210506006341/en/Palantir-Technologies-and-the-Royal-Navy-Extend-Contracts\n\nhttps://twitter.com/PalantirTech/status/1390562068315656194?s=20\n\n東部夏令時2021年5月7日上午02:00\n\n倫敦--(美國商業資訊)--Palantir Technologies Inc. (NYSE:PLTR)宣佈...",
      "title": "帕蘭提爾技術公司和皇家海軍延長合同期限"
    }
  ],
  "title": "Palantir Technologies and the Royal Navy Extend Contracts",
  "created_utc": 1620388635,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.businesswire.com/news/home/20210506006341/en/Palantir-Technologies-and-the-Royal-Navy-Extend-Contracts\">https://www.businesswire.com/news/home/20210506006341/en/Palantir-Technologies-and-the-Royal-Navy-Extend-Contracts</a></p>\n\n<p><a href=\"https://twitter.com/PalantirTech/status/1390562068315656194?s=20\">https://twitter.com/PalantirTech/status/1390562068315656194?s=20</a></p>\n\n<p>May 07, 2021 02:00 AM Eastern Daylight Time</p>\n\n<p>LONDON--(BUSINESS WIRE)--Palantir Technologies Inc. (NYSE:PLTR) announced today the renewal of its contracts with the United Kingdom’s Royal Navy for its Palantir Foundry platform. Palantir’s software is used by the Royal Navy across a broad spectrum of areas from strategic workforce planning to supply chain management to the COVID-19 response.</p>\n\n<p>Palantir is enabling naval personnel, as well as civilians and contractors, most without programming expertise, to access and engage with a curated, single source of truth. Users are empowered to run complex models to test scenarios to make better decisions, faster. The Royal Navy has developed its own digital skills and data expertise through its adoption of Foundry - a growing number of naval personnel are programming and building directly in Foundry, showcasing their growing self-sufficiency and new technical competence.</p>\n\n<p>The renewed agreements will allow the Royal Navy to continue reaping the benefits of a more empowered workforce, whilst keeping tight control of security and privacy of its data, and full ownership of the logic behind its data model.</p>\n\n<p>The investment the Royal Navy made in Foundry meant it was able to react quickly to the COVID-19 crisis early last year. It took the Royal Navy less than 48 hours to stand up a Recognised People Picture in Foundry using self-reported updates to inform leadership of the impact of the pandemic on its force. The Royal Navy is applying this new data-driven approach to ensure readiness of its strength, proactive alerting on equipment health and inventory risk, fully transparent and informed maintenance delivery, all combined to increase the availability of its forces.</p>\n\n<p>The February 2021 edition of Navy News noted that Foundry had “allowed the Personnel and Training (P&amp;T) organisation to establish 200 temporary units, tasks, and positions to support the Covid response: from drivers for semi-refrigerated trucks to engineers conducting maintenance tasks to Royal Navy medics supporting the government’s broader pandemic response, ensuring resilience to operations. Looking ahead, the development of a strength modelling process in Foundry will allow better understanding of the pandemic’s long-term impact on future force readiness. Strategic planners can model a variety of scenarios quickly and independently, so that they can make sure there are enough training courses and promotion opportunities for example, to help the Royal Navy continue to adapt to changing circumstances.”</p>\n\n<p>“We are proud to be supporting the Royal Navy in its important mission and delighted to see the way in which it is using Foundry in support of the First Sea Lord’s objective to use technology and innovation, in a much bigger way than the Royal Navy has been to date, to drive everything it does” says Shyam Sankar, COO of Palantir.</p>\n</div><!-- SC_ON -->",
  "score": 237,
  "permalink": "/r/stocks/comments/n6sq76/palantir_technologies_and_the_royal_navy_extend/",
  "subreddit": "stocks",
  "id": "n6sq76",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995613
}