{
  "author": "SwapzoneIO",
  "original_created_utc": 1652437836,
  "title": "Germany Announces: No Tax On Crypto Sales For Investors Holding For 1 Year",
  "created_utc": 1652464047,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;While the crypto world is going crazy, Germany publishes a crypto sale tax guide. According to Katja Hessel, German Parliamentary State Secretary, crypto traders can get tax exemption benefits on the sale of digital currencies. Furthermore, if they have held onto their assets for one year or more, they will not have to pay taxes on the money they make from the crypto sales.&lt;/p&gt;\n\n&lt;p&gt;The Federal Finance Ministry of Germany issued 24 pages of guidelines defining blockchain technology ideas like airdrops, staking, masternodes, mining, and tax charges against sales and purchases of cryptocurrencies. If someone doesn’t have to do anything to receive an airdrop, they won’t have to pay income tax on it. &lt;/p&gt;\n\n&lt;p&gt;Do you believe that this new rule will make life easier for a crypto investor?&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/01yanv4808z81.png?width=1920&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=251148529213f92537b2210d0911913d08a91a41\"&gt;Source: tokenaround.com&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 315,
  "permalink": "/r/CryptoCurrency/comments/uoop7f/germany_announces_no_tax_on_crypto_sales_for/",
  "subreddit": "CryptoCurrency",
  "id": "uoop7f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "While the crypto world is going crazy, Germany publishes a crypto sale tax\nguide. According to Katja Hessel, German Parliamentary State Secretary, crypto\ntraders can get tax exemption benefits on the sale of digital currencies.\nFurthermore, if they have held onto their assets for one year or more,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の世界が熱狂する中、ドイツが暗号売却税について公表\nを案内しています。ドイツ連邦議会事務局長のカティア・ヘッセルによると、暗号\nトレーダーはデジタル通貨の売却に際して免税の恩恵を受けることができます。\nさらに、1年以上資産を保有していた場合、...",
      "title": "ドイツが発表。1年間保有する投資家は暗号売却に非課税"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当加密货币世界正在疯狂时，德国公布了加密货币销售税\n指南。根据德国议会国务秘书Katja Hessel的说法，加密货币\n交易者可以在出售数字货币时获得免税优惠。\n此外，如果他们持有资产一年或以上，...",
      "title": "德国宣布。对持有一年的投资者免征加密货币销售税"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當加密貨幣世界正在瘋狂時，德國公佈了加密貨幣銷售稅\n指南。根據德國議會國務祕書Katja Hessel的說法，加密貨幣\n交易者可以在出售數字貨幣時獲得免稅優惠。\n此外，如果他們持有資產一年或以上，...",
      "title": "德國宣佈。對持有一年的投資者免徵加密貨幣銷售稅"
    }
  ]
}