{
  "author": "Cutiepie9771",
  "original_created_utc": 1659162358,
  "title": "Does anyone else feel like therapy and mental health should be included in health care plans / free health care?",
  "created_utc": 1659169602,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve always wondered this. I personally feel like mental health is just as important as physical health. I’m not educated in laws or politics or health or anything though so I’m very curious to known what other people feel or know about this topic. Am I the odd one out or am I on to something? Or would this never be able to come to fruition? I’m interested to hear everyone’s thoughts&lt;/p&gt;\n\n&lt;p&gt;FYI: I live in America, I’m not sure how other countries might handle this&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/NoStupidQuestions/comments/wbqt1v/does_anyone_else_feel_like_therapy_and_mental/",
  "subreddit": "NoStupidQuestions",
  "id": "wbqt1v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve always wondered this. I personally feel like mental health is just as\nimportant as physical health. I’m not educated in laws or politics or health or\nanything though so I’m very curious to known what other people feel or know\nabout this topic. Am I the odd one out or am I on to something? Or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いつも不思議に思っていることがあるんです。私自身は、メンタルヘルスの重要性を感じています。\n精神的な健康は、身体的な健康と同じくらい重要だと思います。私は法律や政治、健康などに関する教育は受けていません。\nこのテーマについて、他の人が何を感じ、何を知っているのか、とても興味があります。\nを知りたいと思っています。私は変わり者なのでしょうか、それとも何かを掴んでいるのでしょうか？それとも...",
      "title": "セラピーやメンタルヘルスは、ヘルスケアプラン／無料医療に含まれるべきだと感じる人はいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直想知道这个问题。我个人觉得，心理健康和身体健康一样重要。\n和身体健康一样重要。我没有受过法律、政治或健康方面的教育。\n所以我很想知道其他人对这个问题的看法和认识。\n关于这个话题。我是个怪人，还是我有什么想法？或者...",
      "title": "还有人觉得治疗和心理健康应该包括在医疗保健计划/免费医疗保健中吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直想知道這個問題。我個人覺得，心理健康和身體健康一樣重要。\n和身體健康一樣重要。我沒有受過法律、政治或健康方面的教育。\n所以我很想知道其他人對這個問題的看法和認識。\n關於這個話題。我是個怪人，還是我有什麼想法？或者...",
      "title": "還有人覺得治療和心理健康應該包括在醫療保健計劃/免費醫療保健中嗎？"
    }
  ]
}