{
  "author": "UGisOnline",
  "original_created_utc": 1648816339,
  "title": "I’m a 21 year old male and I feel my memory is dwindling or flat out just bad… why is this?",
  "created_utc": 1648831112,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I feel like as a 21 year old, my memory seriously should not be this bad, and I’m not sure if it’s always been this bad or if it’s been declining recently (see. Shit memory) I often forget things I’ve just read and have just been overall slow it feels; am I going crazy? Also, not sure if there is a correlation but I’ve been pretty depressed lately and very overwhelmed, as well.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/ttpjyp/im_a_21_year_old_male_and_i_feel_my_memory_is/",
  "subreddit": "NoStupidQuestions",
  "id": "ttpjyp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I feel like as a 21 year old, my memory seriously should not be this bad, and\nI’m not sure if it’s always been this bad or if it’s been declining recently\n(see. Shit memory) I often forget things I’ve just read and have just been\noverall slow it feels; am I going crazy? Also, not sure if there is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "21歳として、マジで記憶力がここまで悪くなってはいけない気がしますし\n昔からこんなに悪かったのか、最近衰えてきたのか、よくわからないが\n(記憶力が悪いのか、読んだことをよく忘れる。\n全体的に遅い気がするのですが、私がおかしくなっているのでしょうか？また、あるのかどうかわかりませんが...。",
      "title": "私は21歳の男性ですが、記憶力が低下しているというか、平気で悪いというか...なぜなんでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得作为一个21岁的人，我的记忆力绝对不应该这么差，而且\n我不确定它是否一直如此糟糕，还是最近一直在下降。\n(看，糟糕的记忆力）我经常忘记我刚读过的东西，而且只是感觉到整体上的缓慢。\n总体上感觉很慢；我是不是要疯了？另外，不确定是否有...",
      "title": "我是一名21岁的男性，我觉得我的记忆力在下降，或者说是平白无故地变差了......这是为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得作爲一個21歲的人，我的記憶力絕對不應該這麼差，而且\n我不確定它是否一直如此糟糕，還是最近一直在下降。\n(看，糟糕的記憶力）我經常忘記我剛讀過的東西，而且只是感覺到整體上的緩慢。\n總體上感覺很慢；我是不是要瘋了？另外，不確定是否有...",
      "title": "我是一名21歲的男性，我覺得我的記憶力在下降，或者說是平白無故地變差了......這是爲什麼呢？"
    }
  ]
}