{
  "author": "CommentToBeDeleted",
  "original_created_utc": 1647869937,
  "title": "Does \"true\" randomness actually exist?",
  "created_utc": 1647882289,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you flip a coin and try to call heads or tails, we might all agree that it is &amp;quot;random&amp;quot;, but it isn&amp;#39;t. It&amp;#39;s just that the outcome is obscured behind variables we aren&amp;#39;t aware of. If you knew the starting conditions and all the variables that went into that system you could perfectly predict the outcome of a coin flip every single time. To put this another way, if you &amp;quot;rewound&amp;quot; the flip and pressed &amp;quot;play&amp;quot; the outcome would remain unchanged (even if done a million times), because the starting conditions and variables are all the same.&lt;/p&gt;\n\n&lt;p&gt;Most of the things we consider random (die roll, shuffled cards, roulette wheel, even the lottery) are not actually random, but events, that with enough information, could be predicted.&lt;/p&gt;\n\n&lt;p&gt;Our best attempts at making random functions in computers, are also not actually random. A company who built a form of security based on something they consider as close to actual random as we can get on a macro scale (wall of a bunch of lava lamps), is most likely using something we just can&amp;#39;t accurately predict over a long period of time (fluid dynamics) rather than actually being random.&lt;/p&gt;\n\n&lt;p&gt;Looking at the smallest scale, at the quantum level, again it&amp;#39;s tempting to say there are &amp;quot;random&amp;quot; events. Like where a particle might land (essentially what the wave function is), but how likely is it that this is actually, truly &amp;quot;random&amp;quot; and again not just us assigning &amp;quot;random&amp;quot; out of our ignorance, being unable to know enough information about a given system to accurately predict the outcome (from what we can tell, we will never be able know enough given the Uncertainty Principle)?&lt;/p&gt;\n\n&lt;p&gt;Are there any known mechanisms in the natural world that could even produce something truly &amp;quot;random&amp;quot;? Something that is so random that if you were to &amp;quot;rewind&amp;quot; and hit &amp;quot;play&amp;quot; the same outcome is not guaranteed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/tjc1ou/does_true_randomness_actually_exist/",
  "subreddit": "NoStupidQuestions",
  "id": "tjc1ou",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you flip a coin and try to call heads or tails, we might all agree that it is\n\"random\", but it isn't. It's just that the outcome is obscured behind variables\nwe aren't aware of. If you knew the starting conditions and all the variables\nthat went into that system you could perfectly predict the…"
}