{
  "author": "FreakingOwOmyDudes",
  "original_created_utc": 1640116312,
  "title": "Is it abnormal to not hear a voice in your head narrating stuff?",
  "created_utc": 1640146521,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I made a joke to a friend the other day about how the &amp;quot;internal voice&amp;quot; seen in a lot of novels is a rather stupid storytelling tool and makes the speaker sound schizophrenic.&lt;/p&gt;\n\n&lt;p&gt;He looked at me weird and said &amp;quot;It&amp;#39;s not a storytelling tool. You don&amp;#39;t have that?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I had no clue what to say. I&amp;#39;ve never had that. There&amp;#39;s no words in here, I&amp;#39;m pretty damn sure I&amp;#39;d know if there were.&lt;/p&gt;\n\n&lt;p&gt;This is haunting me. Holy shit, I need answers.&lt;/p&gt;\n\n&lt;p&gt;Edit 1: Asked another friend, she says she &lt;em&gt;constantly&lt;/em&gt; hears words, and couldn&amp;#39;t imagine it being &amp;quot;quiet.&amp;quot; She described it as similar to &amp;quot;a friend watching a movie who won&amp;#39;t shut the fuck up&amp;quot; and oh my god this is confusing me&lt;/p&gt;\n\n&lt;p&gt;Edit 2: Okay, not sure if I should trust what the second friend says because she just told me she sometimes thinks in the voice of Sans from Undertale&lt;/p&gt;\n\n&lt;p&gt;Edit 3: Asked my mother of all people. She says I probably do have it, and that it just goes so fast I don&amp;#39;t recognize it. Ha, ha, ha. Hilarious. ._.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/rlmmuq/is_it_abnormal_to_not_hear_a_voice_in_your_head/",
  "subreddit": "NoStupidQuestions",
  "id": "rlmmuq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I made a joke to a friend the other day about how the \"internal voice\" seen in a\nlot of novels is a rather stupid storytelling tool and makes the speaker sound\nschizophrenic.\n\nHe looked at me weird and said \"It's not a storytelling tool. You don't have\nthat?\"\n\nI had no clue what to say. I've never…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、友人と冗談で、「内なる声」というのがある。\n多くの小説は、かなり愚かなストーリーテリングのツールであり、話し手の声を聴かせる。\n精神分裂症のようなものです。\n\n彼は私を変な目で見て、「それはストーリーテリングの道具ではない」と言った。あなたにはないでしょう。\nということですか？\n\n私は何と言ったらいいのか、さっぱりわからなかった。私は一度も...",
      "title": "頭の中でナレーションの声が聞こえないのは異常なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，我跟一个朋友开玩笑说，在很多小说中看到的 \"内部声音 \"是怎样的？\n很多小说中的 \"内部声音 \"是一个相当愚蠢的讲故事的工具，使说话者听起来有\n精神分裂症。\n\n他奇怪地看着我，说：\"这不是一个讲故事的工具。你没有\n这个？\"\n\n我不知道该怎么说。我从来没有...",
      "title": "没有听到脑子里有声音在叙述东西是不正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，我跟一個朋友開玩笑說，在很多小說中看到的 \"內部聲音 \"是怎樣的？\n很多小說中的 \"內部聲音 \"是一個相當愚蠢的講故事的工具，使說話者聽起來有\n精神分裂症。\n\n他奇怪地看着我，說：\"這不是一個講故事的工具。你沒有\n這個？\"\n\n我不知道該怎麼說。我從來沒有...",
      "title": "沒有聽到腦子裏有聲音在敘述東西是不正常的嗎？"
    }
  ]
}