{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Tuesday, May 18, 2021\n\nStocks held steady today, with the three major indexes trading within a 0.5%\nrange of the even line. It’s encouraging to see the market holding steady after\nthe volatility experienced in the last few weeks. As I have said before, I\nthought the initial…",
  "original_created_utc": 1621369750,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年5月18日(火)\n\n今日の株式は堅調に推移し、主要3指数はイーブンラインの0.5％の範囲内で取引された。\nイーブンラインの0.5％の範囲内で推移した。ここ数週間の乱高下を経て、市場が堅調に推移しているのは心強いことです。\n市場が安定しているのは心強い。以前から申し上げているように、私は\n初期の...",
      "title": "本日2021年5月18日(火)のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年5月18日，星期二\n\n股市今天保持稳定，三大指数在偶数线的0.5%范围内交易。\n的范围内。在经历了过去几周的波动之后，看到市场保持稳定，这令人鼓舞。\n在过去几周经历的波动之后，看到市场保持稳定是令人鼓舞的。正如我之前所说，我\n认为最初的...",
      "title": "以下是今天的市场回顾，2021年5月18日，星期二"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年5月18日，星期二\n\n股市今天保持穩定，三大指數在偶數線的0.5%範圍內交易。\n的範圍內。在經歷了過去幾周的波動之後，看到市場保持穩定，這令人鼓舞。\n在過去幾周經歷的波動之後，看到市場保持穩定是令人鼓舞的。正如我之前所說，我\n認爲最初的...",
      "title": "以下是今天的市場回顧，2021年5月18日，星期二"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, May 18, 2021",
  "created_utc": 1621380530,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Tuesday, May 18, 2021</strong></p>\n\n<p>Stocks held steady today, with the three major indexes trading within a 0.5% range of the even line. It’s encouraging to see the market holding steady after the volatility experienced in the last few weeks. As I have said before, I thought the initial reaction to the April Consumer Price Index, where technology stocks sank and the S&amp;P 500 (SPY) fell 4%, was overblown for a few reasons that will be explained below. </p>\n\n<p>Last week, the market tumbled in the largest loss since February after the Bureau of Labor Statistics released the April Consumer and Producer Price indexes, which showed a larger increase than expected.  The CPI, which measures a basket of goods as well as energy and housing costs, rose 4.2% from a year ago, compared to the Dow Jones estimate for a 3.6% increase. The monthly gain was 0.8%, against the expected 0.2%. Excluding the volatile food and energy prices, the core CPI (this is the main measure of inflation) increased 3% compared to the same period in 2020 and 0.9% on a monthly basis. The respective estimates were 2.3% and 0.3%. </p>\n\n<p>The PPI, which measures the average changes in prices received by domestic producers for their output, rose 6.2% compared to April 2020 and 0.6% monthly increase. The core PPI, which excludes volatile items like food and energy rose 4.6% year over year and 0.7% in April. Economists polled by FactSet were expecting a 0.3% monthly increase in April and 3.8% year over year.</p>\n\n<p>While it’s difficult to pinpoint exact causes, there seem to be several factors contributing to the rise in inflation, none of which I think pose a significant threat to the sustainability of the current bull market.  First, after the collapse in prices during the height of the pandemic and lockdowns, it is not surprising to see prices comparatively much higher than last year as demand and consumer spending surges as the US economy reopens. </p>\n\n<p>Second are widespread supply shortages and manufacturing bottlenecks in key materials, limiting production capability and driving up delivery time, and as a result, driving up prices. As basic economics shows us, when demand begins to outstrip production capabilities (aka supply), prices inevitably go up. One prominent example of this you may be familiar with is the global shortage in semiconductors, which is causing automobile manufacturers across the industry to limit production. A similar situation is happening across an array of consumer goods. </p>\n\n<p>Third are historic levels of fiscal spending by the Federal Government in the form of stimulus and other benefits. Federal debt—incurred when the government sells Treasury bonds, bills, notes, and other securities to cover its costs—recently hit an all-time high. However, policymakers are not concerned with the debt at current levels. Jerome Powell said, “Given the low level of interest rates, there&#39;s no issue about the United States being able to service its debt at this time or in the foreseeable future.” Treasury Secretary Janet Yellen echoed a similar sentiment in a recent interview, saying “Even with inflation data coming in hotter than economists expected, long-term bond yields declined, indicating the market has been anticipating inflationary pressures for a while and are reassured by the Federal Reserve’s commitment to move slowly when raising rates.</p>\n\n<p>Now that we understand why inflation may be rising, these are the reasons I think fears are overblown. With the US economy reopening, we are seeing a surge in consumer spending (we saw a 10.8% increase in spending in March), supply is having a hard time catching up to rising demand, which of course, causes a rise in prices. As the economic reopening continues and supply in various consumer industries is able to catch up, inflation is expected to slow down. In a nutshell, this is why Jerome Powell and other monetary officials consistently refer to current inflationary pressures “transitory”. In an April 28 meeting, Jerome Powell said, “Amid progress on vaccinations and strong policy support, indicators of economic activity and employment have strengthened. Inflation has risen, largely reflecting transitory factors. Overall financial conditions remain accommodative, in part reflecting policy measures to support the economy and the flow of credit to U.S. households and businesses.” </p>\n\n<p>Moreover, it is important to note that Federal Reserve Chair Jerome Powell has consistently reiterated he expects any rise in inflation to be “transitory” as the economy continues to recover from the March and bottom and want to see a “string” of strong labor reports totaling 1 million before. Talking about the March Job report, Powell said, “We want to see a string of months like that [like in March] so we can really begin to show progress toward our goals. We just need to keep reminding ourselves that even though some parts of the economy are starting just great, there’s a very large group of people who are not.” Finally, the April Job Report, which showed the economy gained only 266,000 jobs compared to the 1 million expected and marked a sharp deceleration in growth compared to March, bolsters Powell’s argument that large segments that the Federal Reserve will move slowly in changing policy. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The US dollar dipped on Tuesday for the fourth straight session, reaching its lowest level against a basket of currencies since late February on waning fears that inflation spikes could prompt the Federal Reserve to raise interest rates sooner than anticipated, another great sign that inflationary fears are overblown. </li>\n<li>In a Ford factory in Michigan, President Biden promoted his $174 billion plan to promote and accelerate the adoption of electric vehicles across the United States and planned to roll-back vehicle emission standards. According to the fact sheet, Biden&#39;s plan &quot;proposes cost-sharing grants to support new high capacity battery facilities in the United States” and backs grants to fund the retooling of shuttered factories &quot;to build advanced vehicles and parts.&quot;</li>\n<li>Michael Burry, the investor famous for calling the 2008 housing market bubble and portrayed by Christian Bale in the movie “The Big Short”, recently unveiled a huge bearish bet on Tesla. Scion Asset Management, Burry’s firm, said in a regulatory filing it had put options on 800,100 shares of Tesla, as of the end of Quarter 1, a value of $534 million. Details on the strike price of the puts, their value and whether they are part of a broader trade are not publicly available. </li>\n<li>Square (SQ), one of the leading fintech companies, launched services in Ireland, it’s first foray into the Eurozone as the company looks to expand beyond the US.</li>\n<li>Interestingly, Berkshire Hathaway (BRK.B) has sold nearly all of its Wells Fargo (WFC) stock, a position the company has held since 1989. In a regulatory filing on Monday, Berkshire said it owned just $26.4 million of shares of WFC as of March 31, down from around $32 billion in January 2018.</li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday volatility*\\</strong>*</li>\n<li>Amazon (AMZN) target raised by Citigroup from $3750 to $4175 at Buy. Stcok currently around $3270</li>\n<li>BioNTech (BNTX) target raised by Canaccord Genuity from $230 to $252. Stock currently around $195</li>\n<li>CVS Health (CVS) target raised by Mizuho from $82 to $98 at Buy. Stock currently around $84.5</li>\n<li>Chevron (CVX) target raised by Argus from $108 to $127 at Buy. Stock currently around $111</li>\n<li>Electronic Arts (EA) target raised by Benchmark from $177 to $181 at Buy. Stock currently around $138</li>\n<li>Intuit (INTU) target raised by Royal Bank of Canada from $480 to $490 at Outperform. Stock currently around $419</li>\n<li>L Brands (LB) with two target raises. Stock currently around $70.5\n\n<ul>\n<li>Deutsche Bank from $80 to $87 at Buy</li>\n<li>Morgan Stanley from $73 to $81 at Overweight</li>\n</ul></li>\n<li>Lowe&#39;s (LOW) target raised by Morgan Stanley from $210 to $222 at Overweight. Stock currently around $194</li>\n<li>Western Digital (WDC) target raised by Mizuho from $88 to $90 at Buy. Stock currently around $76.50</li>\n</ul>\n\n<p>“The greatest glory in living lies not in never falling, but in rising every time we fall.&quot; -Nelson Mandela</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/stocks/comments/nflbtz/here_is_a_market_recap_for_today_tuesday_may_18/",
  "subreddit": "stocks",
  "id": "nflbtz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804460
}