{
  "author": "InGen_Lab_Intern",
  "original_created_utc": 1639333125,
  "title": "When did drinking tap water become so stigmatized?",
  "created_utc": 1639344164,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My household, like most I imagine now days, uses filtered water for drinking.  It&amp;#39;s second nature now, we don&amp;#39;t even think to drink water from the tap. (USA here for reference)&lt;/p&gt;\n\n&lt;p&gt;However, when I was growing up, I don&amp;#39;t remember people making such a big fuss about drinking straight from the tap. Did I just grow up poor? lol&lt;/p&gt;\n\n&lt;p&gt;Why don&amp;#39;t public water infrastructures just start filtering it from the source?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/reus23/when_did_drinking_tap_water_become_so_stigmatized/",
  "subreddit": "NoStupidQuestions",
  "id": "reus23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My household, like most I imagine now days, uses filtered water for drinking.\nIt's second nature now, we don't even think to drink water from the tap. (USA\nhere for reference)\n\nHowever, when I was growing up, I don't remember people making such a big fuss\nabout drinking straight from the tap. Did I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の家庭も、最近はほとんどそうだと思いますが、飲み水はフィルターでろ過したものを使っています。\n今では当たり前のことで、水道の水を飲もうとは思わないほどです。(アメリカ\n参考までにこちらをご覧ください)\n\nしかし、私が子供のころは、こんなに大騒ぎしていた記憶はありません。\n水道の蛇口から直接飲むこと。そうだったかな...",
      "title": "いつから水道水を飲むことが、こんなにも汚いことになってしまったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的家庭和我想象中的大多数家庭一样，使用过滤水进行饮用。\n这已经成为我们的第二天性，我们甚至没有想到要喝水龙头里的水。(美国\n这里供参考)\n\n然而，在我成长的过程中，我不记得人们对直接从水龙头喝水有多么大惊小怪。\n直接从水龙头喝水。我是否...",
      "title": "饮用自来水何时变得如此污名化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的家庭和我想象中的大多數家庭一樣，使用過濾水進行飲用。\n這已經成爲我們的第二天性，我們甚至沒有想到要喝水龍頭裏的水。(美國\n這裏供參考)\n\n然而，在我成長的過程中，我不記得人們對直接從水龍頭喝水有多麼大驚小怪。\n直接從水龍頭喝水。我是否...",
      "title": "飲用自來水何時變得如此污名化？"
    }
  ]
}