{
  "author": "DaddySkates",
  "original_created_utc": 1650444777,
  "title": "Crypto games aren't passive income if they require 6 hours of my times a day. That's called a job",
  "created_utc": 1650458982,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I open my Twitter and scroll around the new tweets from people, I keep seeing all those passive ways of earning crypto with some play to earn cryptocurrency games. And in the comments you see someone explaining how they amassed a grand with just 6 hours of hard farming a day in the game and spending a lot on the release to get ahead of the other players.&lt;/p&gt;\n\n&lt;p&gt;If you play 6 hours a day just to get some profit, that&amp;#39;s not a passive income. That&amp;#39;s called a real ass job. Now I&amp;#39;m not throwing everyone in the same basket, surely some people from developing countries really thrive off these games but for most people in developed countries it&amp;#39;s not a passive income at all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 678,
  "permalink": "/r/CryptoCurrency/comments/u7s1vv/crypto_games_arent_passive_income_if_they_require/",
  "subreddit": "CryptoCurrency",
  "id": "u7s1vv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I open my Twitter and scroll around the new tweets from people, I keep\nseeing all those passive ways of earning crypto with some play to earn\ncryptocurrency games. And in the comments you see someone explaining how they\namassed a grand with just 6 hours of hard farming a day in the game and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分のTwitterを開いて、人の新着ツイートをスクロールしていくと、ずっと\n暗号を獲得するためのいくつかのプレイで暗号を獲得するすべてのそれらの受動的な方法を参照してください。\ncryptocurrencyゲーム。そして、コメントでは、誰かが彼らがどのように説明するのを参照してください。\nゲーム内で1日6時間のハード農業で1,000ドルを蓄積し、...",
      "title": "クリプトゲームは1日6時間マイタイムが必要なら受動的な収入にはならない。それは仕事と呼ばれるものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我打开我的推特，在人们的新推特上滚动时，我不断地\n看到所有这些被动的赚取加密货币的方式，以及一些玩赚取\n加密货币游戏。而在评论中，你看到有人解释他们如何\n在游戏中每天只用6个小时努力耕作就积累了1000美元，而且......",
      "title": "如果加密货币游戏需要我每天6小时的时间，那就不是被动收入。这就叫工作"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我打開我的推特，在人們的新推特上滾動時，我不斷地\n看到所有這些被動的賺取加密貨幣的方式，以及一些玩賺取\n加密貨幣遊戲。而在評論中，你看到有人解釋他們如何\n在遊戲中每天只用6個小時努力耕作就積累了1000美元，而且......",
      "title": "如果加密貨幣遊戲需要我每天6小時的時間，那就不是被動收入。這就叫工作"
    }
  ]
}