{
  "author": "UnexperiencedIT",
  "original_created_utc": 1639953452,
  "title": "Cryptocurrencies will not kill banks, but cryptocurrencies provide an alternative to people which will force banks to improve conditions for their customers",
  "created_utc": 1639962097,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like it or not, the banks are here and they are not going anywhere. They will always be here, doing their job which is fine.&lt;/p&gt;\n\n&lt;p&gt;As much as cryptocurrencies have an impact on people, and therefore on banks, it is the governments that will not allow banks to fail.&lt;/p&gt;\n\n&lt;p&gt;There will always be people who will use the banks.&lt;/p&gt;\n\n&lt;p&gt;But due to the influence and growth of cryptocurrencies, banks will have to change their way of business.&lt;/p&gt;\n\n&lt;p&gt;They will have to improve the conditions for their clients, because people now have an alternative, and that alternative sounds good. There are already people who have most of their money in cryptocurrencies, but all of them leave some in the bank or in fiat in case something with crypto goes wrong.&lt;/p&gt;\n\n&lt;p&gt;Banks have been deeply ingrained in our society and our system for a long time. &lt;/p&gt;\n\n&lt;p&gt;It takes time to crypto do the same but it will happen.&lt;/p&gt;\n\n&lt;p&gt;If banks are going to go to war with cryptocurrencies, let them go. We know very well that nothing can happen to them, and competitive and evolving financial system benefits us all.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/rk7pt5/cryptocurrencies_will_not_kill_banks_but/",
  "subreddit": "CryptoCurrency",
  "id": "rk7pt5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like it or not, the banks are here and they are not going anywhere. They will\nalways be here, doing their job which is fine.\n\nAs much as cryptocurrencies have an impact on people, and therefore on banks, it\nis the governments that will not allow banks to fail.\n\nThere will always be people who will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "好むと好まざるとにかかわらず、銀行はここに存在し、どこにも行かない。これからも\n常にここにいて、自分の仕事をする、それでいいのです。\n\n暗号通貨が人々に影響を与えるのと同様に、したがって銀行にも影響を与えますが、それは\n銀行が倒産するのを許さないのは政府です。\n\nいつの時代も...",
      "title": "暗号通貨は銀行を殺さないが、暗号通貨は人々に代替手段を提供し、銀行は顧客のための条件を改善せざるを得なくなるだろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不管你喜不喜欢，银行就在这里，他们不会去任何地方。他们将\n永远在这里，做他们的工作，这很好。\n\n尽管加密货币对人们有影响，因此对银行也有影响，但它是政府不会允许银行倒闭的。\n是政府不会允许银行倒闭。\n\n总会有一些人将...",
      "title": "加密货币不会杀死银行，但加密货币为人们提供了一种选择，这将迫使银行为其客户改善条件"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不管你喜不喜歡，銀行就在這裏，他們不會去任何地方。他們將\n永遠在這裏，做他們的工作，這很好。\n\n儘管加密貨幣對人們有影響，因此對銀行也有影響，但它是政府不會允許銀行倒閉的。\n是政府不會允許銀行倒閉。\n\n總會有一些人將...",
      "title": "加密貨幣不會殺死銀行，但加密貨幣爲人們提供了一種選擇，這將迫使銀行爲其客戶改善條件"
    }
  ]
}