{
  "author": "Meymo",
  "the_new_excerpt": "(Reuters) - Mastercard Inc said on Wednesday it was planning to offer support\nfor some cryptocurrencies on its network this year, joining a string of\nbig-ticket firms that have pledged similar support.\n\nThe credit-card giant’s announcement comes days after Elon Musk’s Tesla Inc\nrevealed it had…",
  "original_created_utc": 1612996839,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "(路透社)--万事达卡公司周三表示，计划提供支持。\n为今年其网络上的一些加密货币，加入了一连串的。\n大票公司，已经承诺提供类似的支持。\n\n在埃隆-马斯克（Elon Musk）的特斯拉公司（Tesla Inc.\n揭示了它已经...",
      "title": "万事达卡将对部分加密货币开放网络"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(路透社)--萬事達卡公司週三表示，計劃提供支持。\n爲今年其網絡上的一些加密貨幣，加入了一連串的。\n大票公司，已經承諾提供類似的支持。\n\n在埃隆-馬斯克（Elon Musk）的特斯拉公司（Tesla Inc.\n揭示了它已經...",
      "title": "萬事達卡將對部分加密貨幣開放網絡"
    }
  ],
  "title": "Mastercard to open up network to select cryptocurrencies",
  "created_utc": 1613033895,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>(Reuters) - Mastercard Inc</strong> said on Wednesday it was planning to offer support for some cryptocurrencies on its network this year, joining a string of big-ticket firms that have pledged similar support.</p>\n\n<p>The credit-card giant’s announcement comes days after Elon Musk’s Tesla Inc revealed it had purchased $1.5 billion of bitcoin and would soon accept it as a form of payment.</p>\n\n<p>Asset manager BlackRock Inc and payments companies Square and PayPal have also recently backed cryptocurrencies.</p>\n\n<p>Mastercard already offers customers cards that allow people to transact using their cryptocurrencies, although without going through its network.</p>\n\n<p>&quot;Doing this work will create a lot more possibilities for shoppers and merchants, allowing them to transact in an entirely new form of payment. This change may open merchants up to new customers who are already flocking to digital assets,&quot; Mastercard said.</p>\n\n<p>Mastercard specified that not all cryptocurrencies will be supported on its network, adding that many of the hundreds of digital assets in circulation still need to tighten their compliance measures.</p>\n\n<p>Many cryptocurrencies have struggled to win the trust of mainstream investors and the general public due to their speculative nature and potential for money laundering.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.reuters.com/article/us-crypto-currency-mastercard/mastercard-to-open-up-network-to-select-cryptocurrencies-idUSKBN2AA2WF?il=0\">https://www.reuters.com/article/us-crypto-currency-mastercard/mastercard-to-open-up-network-to-select-cryptocurrencies-idUSKBN2AA2WF?il=0</a></p>\n</div><!-- SC_ON -->",
  "score": 85,
  "permalink": "/r/investing/comments/lh60za/mastercard_to_open_up_network_to_select/",
  "subreddit": "investing",
  "id": "lh60za",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200902
}