{
  "author": "averyfragilegirl",
  "the_new_excerpt": "I'm not technologically smart, and I've never had this happen to me before. I\ngot an email three days ago (didn't even open it until now, I because I rarely\ncheck my email), from a person who I don't recognize. They said said that they\nhacked my phone, stole my contacts, filmed me masturbating, and…",
  "original_created_utc": 1618739722,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は技術的には賢くありませんし、今までこのようなことはありませんでした。I\n滅多にメールをチェックしない私は、3日前にメールを受け取りました。\n知らない人からメールが来ました。彼らが言うには、彼らは\n私の携帯電話をハッキングして、連絡先を盗み、私が自慰行為をしているところを撮影し、そして...",
      "title": "見知らぬ人からメールが来て、「携帯電話をハッキングして、私が自慰行為をしているところを撮影し、お金を渡さないと私のすべての連絡先にビデオを送る」と言われました。これって詐欺だよね？私はどうすればいいの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在技术上并不聪明，而且我以前从未遇到过这种情况。I\n三天前收到了一封邮件（到现在都没打开，我因为我很少\n检查我的电子邮件），从一个我不认识的人。他们说，说他们\n黑了我的手机，偷了我的通讯录，拍了我的手淫，还有... ...",
      "title": "A收到一个我不认识的人发来的邮件，说他们黑了我的手机，拍下了我的自慰，如果我不给他们钱，他们会把视频发给我所有的联系人。这是个骗局吧？那我该怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在技術上並不聰明，而且我以前從未遇到過這種情況。I\n三天前收到了一封郵件（到現在都沒打開，我因爲我很少\n檢查我的電子郵件），從一個我不認識的人。他們說，說他們\n黑了我的手機，偷了我的通訊錄，拍了我的手淫，還有... ...",
      "title": "A收到一個我不認識的人發來的郵件，說他們黑了我的手機，拍下了我的自慰，如果我不給他們錢，他們會把視頻發給我所有的聯繫人。這是個騙局吧？那我該怎麼辦？"
    }
  ],
  "title": "A got an email from a person I don't recognize saying that they hacked my phone, filmed me masturbating, and are going to send the video to all my contacts if I don't give them money. This is a scam, right? What do I do?",
  "created_utc": 1618772544,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not technologically smart, and I&#39;ve never had this happen to me before. I got an email three days ago (didn&#39;t even open it until now, I because I rarely check my email), from a person who I don&#39;t recognize. They said said that they hacked my phone, stole my contacts, filmed me masturbating, and will be sending it to all my contacts unless I give them like $1500.</p>\n\n<p>They sent a google doc outlining extra details, like how they are demanding the money through bitcoin. At the end of the doc, they said that they would receive a notification of when I opened it and that I would have to send the money within 96 hours or they would send the video to all my contacts. It was probably dumb for me to open their doc at all, but it was 3am and I was hungover so not really thinking clearly.</p>\n\n<p>So I think this is probably a scam, but I&#39;m also pretty scared? I have no idea how this guy got my email. Ultimately, there&#39;s no way I&#39;m sending him the money because I don&#39;t even have it. But I&#39;m like, is there actually a chance that he filmed me and could send it to people? Does he actually have my contacts?</p>\n\n<p>I would appreciate any help I can get</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/mt9xf8/a_got_an_email_from_a_person_i_dont_recognize/",
  "subreddit": "NoStupidQuestions",
  "id": "mt9xf8",
  "is_self": true,
  "media": null,
  "is_video": false
}