{
  "author": "Brokendresser123",
  "the_new_excerpt": "Coming into 2021, most guessed that we would see rising long-term interest\nrates. However, we didn’t expect interest rates to move this high, this fast.\nThe 10-Year Treasury yield started the year at 0.91% and ended the month of\nFebruary at 1.41%, down from an intraday high of 1.61%. As such, core…",
  "original_created_utc": 1614984352,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "进入2021年，大多数人猜测，我们将看到长期利息的上升。\n利率。然而，我们没有想到利率会走得这么高，这么快。\n10年期国债收益率年初为0.91%，而到了本月则为0.91%。\n2月为1.41%，低于盘中高点1.61%。因此，核心...",
      "title": "T票、债券、股票为什么会被抛售？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "進入2021年，大多數人猜測，我們將看到長期利息的上升。\n利率。然而，我們沒有想到利率會走得這麼高，這麼快。\n10年期國債收益率年初爲0.91%，而到了本月則爲0.91%。\n2月爲1.41%，低於盤中高點1.61%。因此，核心...",
      "title": "T票、債券、股票爲什麼會被拋售？"
    }
  ],
  "title": "T notes, bonds, why stocks are selling off",
  "created_utc": 1614992425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Coming into 2021, most guessed that we would see rising long-term interest rates. However, we didn’t expect interest rates to move this high, this fast. The 10-Year Treasury yield started the year at 0.91% and ended the month of February at 1.41%, down from an intraday high of 1.61%. As such, core fixed income assets (bonds) are off to one of their worst starts ever (remember that as yields go up, prices go down).</p>\n\n<p>So what is driving interest rates higher? <strong><em>Changing expectations</em></strong></p>\n\n<p>Inflation and growth expectations are important factors into the fundamental outlook for interest rates. Broadly speaking, what we’ve seen in the bond market this year is a re-pricing of both higher inflation and higher growth expectations. Inflation expectations have steadily moved higher, and market-based gauges of inflation expectations are the highest they’ve been since 2011. We also need to keep watching how additional fiscal stimulus flows into the economy. Additionally, it seems increasing economic growth expectations have picked up recently as well. An increase in growth expectations may put pressure on the Federal Reserve (Fed) to move away from its low interest rate policy sooner than expected, which has put upward pressure on longer-dated Treasury yields. </p>\n\n<p>An unfortunate byproduct of those higher expectations is that we’ve seen an increase in the volatility of the 10-Year Treasury.</p>\n\n<p>We’ve expected the Fed to keep yields from moving too high or too fast. However, during Fed Chairman Jerome Powell’s recent testimony, he welcomed the sharp move higher as a sign of “confidence” in the economic recovery. Moreover, during last week’s Treasury Auction, selling bonds to the public to fund deficits, natural buyers of these securities largely balked at the offering, and in order to sell the offering in its entirety, the Treasury had to increase yields to make them more attractive. It seems that the market is challenging the Fed’s resolve to keep interest rates at current levels. If the natural buyers of Treasury securities continue to stand on the sideline or the Fed doesn’t take a harder stance on rising rates, we could see yields drift higher from here.</p>\n\n<p>As interest goes up speculative or growth (many tech) stocks start to lose their attraction from the whale investors. They want a sure play or to park their funds into what’s growing next which currently is recovery “epicenter” stocks. Stuff that has pent up demand, stuff that is inflation proof, and stuff that makes real money now and has a favorable price to earnings ratio. </p>\n\n<p>There’s a few more days of Treasure auctions coming up next week so expect the same sell offs from weeks past, especially with a raging Dow index that indicates full blown recovery mode, favorable vaccine news, states reopening and big leaps in jobs numbers.</p>\n\n<p>Key point to remember: Yellen is all about job creation and Powell is all about managing rates to stave off inflation. Neither care about growth stocks selling off...</p>\n\n<p>Treasury auction dates this week are Tues-Thurs</p>\n\n<p><a href=\"https://www.treasury.gov/resource-center/data-chart-center/quarterly-refunding/Documents/auctions.pdf\">https://www.treasury.gov/resource-center/data-chart-center/quarterly-refunding/Documents/auctions.pdf</a></p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/investing/comments/lynwgj/t_notes_bonds_why_stocks_are_selling_off/",
  "subreddit": "investing",
  "id": "lynwgj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574789
}