{
  "author": "historiagrephour",
  "the_new_excerpt": "From the r/AskHistorians [/r/AskHistorians] mod team:\n\nOn Tuesday, 16 March 2021, eight people were murdered in a series of attacks on\nmassage parlors in and around Atlanta, Georgia (United States). Six of these\nvictims were women of Asian descent. Their names are Daoyou Feng (冯道友), Hyun\nJung Grant…",
  "original_created_utc": 1616260995,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "来自r/AskHistorians[/r/AskHistorians]版主团队。\n\n2021年3月16日星期二 8人在一系列袭击中被杀\n在美国佐治亚州亚特兰大市及其附近的按摩院。其中六家\n受害者都是亚裔女性。她们的名字是冯道友、贤贤、小龙女。\n郑格兰特...",
      "title": "亚特兰大地区的谋杀案是出于种族动机。北美洲反亚裔种族主义简史"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來自r/AskHistorians[/r/AskHistorians]版主團隊。\n\n2021年3月16日星期二 8人在一系列襲擊中被殺\n在美國佐治亞州亞特蘭大市及其附近的按摩院。其中六家\n受害者都是亞裔女性。她們的名字是馮道友、賢賢、小龍女。\n鄭格蘭特...",
      "title": "亞特蘭大地區的謀殺案是出於種族動機。北美洲反亞裔種族主義簡史"
    }
  ],
  "title": "The Atlanta-Area Murders Were Racially Motivated: A Short History of Anti-Asian Racism in North America",
  "created_utc": 1616265131,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>From the</em> <a href=\"/r/AskHistorians\">r/AskHistorians</a> <em>mod team:</em></p>\n\n<p>On Tuesday, 16 March 2021, eight people were murdered in a series of attacks on massage parlors in and around Atlanta, Georgia (United States). Six of these victims were women of Asian descent. Their names are Daoyou Feng (冯道友), Hyun Jung Grant (김]현정), Suncha Kim (김순자), Soon Chung Park (박순정), Xiaojie “Emily” Tan (谭小洁), and Yong Ae Yue (유용애). Two others, Delaina Ashley Yaun and Paul Andre Michels, were also murdered on Tuesday evening.</p>\n\n<p>The brutality of these crimes has been met with expressions of shock and dismay across the globe; however, the Atlanta-area attacks are hardly unprecedented. Since the onset of the COVID-19 Pandemic, over four thousand incidents of anti-Asian violence have been reported across Canada and the United States.<sup>\\</sup>1]) While it is easy to ascribe the xenophobic hatred that fueled these attacks to the impact of Trumpian rhetoric, it is important to understand that the sentiments underpinning that rhetoric first originated in the white colonial empires of the nineteenth century. Anti-Asian racism is woven into the fabric of Canadian and American national history, and it is important to understand and acknowledge both the systematic othering of Asian Americans, Asian Canadians, and Asian immigrants to North America and the violence that such othering has historically inspired and, in many ways, excused.</p>\n\n<p><strong>The “Yellow Peril”</strong></p>\n\n<p>European states began colonizing parts of Asia in the sixteenth century in an attempt to control the production and movement of lucrative trade goods between Asia and Europe, Australia, New Zealand, Africa, and North and South America.  In this early period of colonialism, European perceptions of Asia were generally positive, resulting in a characterization of the region as being at least as civilized as Europe. However, by the nineteenth century, European intentions in Asia had become transparently imperialistic. Trade-driven colonization in the region was dominated by the United Kingdom, but Germany, France, Russia, and the United States, among others also held imperial aspirations in Asia. These aspirations were built increasingly upon stereotypes that characterized Asian persons as physically, intellectually, culturally, and morally inferior to the white Europeans who sought to exploit and control Asian resources. Gone were the positive stereotypes about Asia and its people, which were replaced by the same kinds of stereotypes that Europeans had used to justify the colonization of Australia, New Zealand, Africa, and the Americas, as well as the enslavement and murder of non-white peoples across the globe.</p>\n\n<p>It was not until the middle of the nineteenth century, when Chinese immigrants began to arrive in North America, Australia, and New Zealand that this rhetoric of inferiority began to shift—not back to the previously positive stereotypes that had dominated European discourse during the Enlightenment, but toward an ideology that represented Asian people as a threat to white Europeans and North Americans. (See this <a href=\"https://www.reddit.com/r/AskHistorians/comments/k6efdb/what_was_happening_in_china_in_the_1850s_that/gesinbd/\">response</a> by <a href=\"/u/EnclavedMicrostate\">/u/EnclavedMicrostate</a> from earlier this year for a more detailed discussion of the factors that influenced mid-nineteenth-century Chinese immigration, including the existing connections between the diminishing African slave trade and Chinese coolie immigration.) Chinese laborers were hard-working and willing to accept lower pay than their white counterparts; they were therefore soon perceived to be an economic threat to white Americans and Canadians. Previously benevolent but patronizing racial stereotypes were twisted and demonized to position Chinese people as a palpable danger to white supremacy and western culture. Political cartoons created by white artists in white-owned papers described Chinese immigrants as unclean, uncivilized, sexually voracious, listless, mindless, and as carriers of disease. They had become the “Yellow Peril”.</p>\n\n<p>The discursive shift worked. The United States and Canada passed a series of exclusionary legislative acts that started with the Page Act of 1875, which prohibited the entry of Chinese women into the United States and ended with a series of miscegenation laws in the early twentieth century. In 1882, the United States passed the Chinese Exclusion Act, which prohibited the immigration of all Chinese persons to the United States. The Scott Act (1888) prohibited Chinese laborers who went abroad from re-entering the United States. The Geary Act (1892), required Chinese residents of the United States to carry a resident permit at all times. Failure to do so was punishable by either deportation or by a year of hard labor. By this act, Chinese immigrants were unable to bear witness in a court of law and ineligible to receive bail in habeas corpus proceedings. In 1885, Canada passed its own Chinese Immigration Act, which imposed a head tax of $50 on all Chinese immigrants entering into Canada. This was intended to deter Chinese immigration to Canada, which was banned outright in 1923 with the passage of the Chinese Immigration Act / Chinese Exclusion Act. American legislation in 1917 (Immigration Act of 1917), 1922 (Cable Act), and 1924 (National Origins Quota) established a ban on immigration from most Asian countries, the exclusion of Asians as immigrants eligible for eventual naturalization and citizenship, and the loss of citizenship for any white American woman who married an Asian man. The National Origins Quota was explicitly enacted to “preserve the ideal of American homogeneity” by explicitly restricting immigration so that the relative proportion of races in the United States was maintained.</p>\n\n<p>These racial stereotypes also functioned as a way to flatten all immigrants from the Asian continent, and their American born descendants, into a single group. This empowered and enabled white school leaders to make decisions about Asian and Asian American children and to deny them access to the better resourced schools attended by white children. In one high profile case in San Francisco in the early 1900s, a Japanese family was told they had to enroll their English-speaking child in a segregated school for Chinese students. The rationale for this decision was based in the same case law and policy, including <em>Plessy v. Ferguson,</em> that was used by white school leaders to bar Black and Hispanic students from white schools.  (More <a href=\"https://www.reddit.com/r/AskHistorians/comments/9wp5do/did_immigrants_to_the_united_states_in_the_18th/e9pjl7x/\">here</a> on the history of schooling for immigrant children.)</p>\n\n<p>While discrimination and exclusion were legalized by the federal governments of Canada and the United States, violence toward Asian immigrant communities was frequently enacted by white Americans and Canadians. On 24 October 1871, a mob of 500 white persons entered Los Angeles’s Old Chinatown and attacked, robbed, and murdered members of the Chinese community. Twenty Chinese immigrants were murdered by the mob, some shot and some lynched before their bodies were then hung on display. At least one of the victims was mutilated, having a finger cut off by a white attacker in order to obtain the man’s diamond ring. Riots in San Francisco broke out in July 1877 following growing tensions between Chinese and white laborers during a railroad workers’ strike. Four Chinese immigrants were murdered and over $100,000 worth of property damage was inflicted upon the city’s Chinatown.</p>\n\n<p>The Yellow Peril pogrom of Denver in 1880 featured the lynching of a Chinese man and the destruction of the local Chinatown ghetto. In 1885, an entire community of Chinese immigrants was wiped out in Rock Springs, Wyoming at the hands of a white mob. That same year, a group of white laborers fired their guns into the tents of several sleeping Chinese hop pickers in Squak Valley, Washington. Three Chinese were killed and three more were wounded.</p>\n\n<p>On 3 November 1885, the Chinese population of Tacoma, Washington was forcefully expelled from the city by city authorities and a mob of white supporters. The following year, 200 Chinese civilians were forcefully expelled from Seattle, Washington by the local Knights of Labor Chapter. In 1886, white laborers in Vancouver attacked an encampment of Chinese laborers, driving them out into the icy waters of the harbor in retaliation for the Chinese laborers having “stolen” the white laborers’ jobs. The attackers then stole the Chinese laborers’ tents and provisions and camped in the tents. In 1887, thirty-four Chinese gold miners were ambushed and murdered by a gang of seven white men, who robbed and mutilated the corpses.</p>\n\n<p>This racially motivated violence continued into the twentieth century. In September 1907, a series of anti-Asian riots broke out across the Pacific Northwest. Though they were not coordinated, they reflected common underlying anti-Asian attitudes held by white Canadians and Americans. Sparked by labor tensions and the perception by white Americans and Canadians that Asian immigrants were stealing white jobs, the riots resulted in considerable damage to Asian-owned property, theft, injuries, and an unknown number of deaths.</p>\n\n<p>While the anti-Asian violence in the western United States and Canada can and should be attributed, at least in part, to economic tensions between whites and Asians, it is also important to note the effect that the Boxer War had on North American attitudes toward Chinese immigrants. If these immigrants were already perceived with general hostility, the reports of the atrocities committed by Boxers during this uprising only strengthened the Yellow Peril ideology that dominated discourse about Asians in North America. Drawing upon reports of violence, rape, and murder committed by the Boxers (though excluding reports of European reprisals during colonial responses to the rebellion), Asians were characterized as subhuman, beastly, and more of a threat than ever before.</p>\n\n<p>As part of this dehumanization of Asians, the Yellow Peril ideology also cemented particular sexual tropes about Asian individuals. Asian women were characterized as sexually voracious and exotic, capable of dominating and manipulating men with sexual skills that other women could not hope to possess. In this period, Asian men were characterized as amoral seducers, intent upon coercing white women into sex. Such characterizations date back to the 1850s, when Horace Greeley published an op-ed in the <em>New York Tribune</em> on the subject of Chinese immigration. He wrote:</p>\n\n<blockquote>\n<p><em>But of the remainder, what can be said? They are for the most part an industrious people, forbearing and patient of injury, quiet and peaceable in their habits; say this and you have said all good that can be said of them. They are uncivilized, unclean, and filthy beyond all conception, without any of the higher domestic or social relations; lustful and sensual in their dispositions; every female is a prostitute of the basest order; the first words of English that they learn are terms of obscenity or profanity, and beyond this they care to learn no more.</em></p>\n</blockquote>\n\n<p>By the 1920s, eugenicists in the United States had co-opted Yellow Peril rhetoric to misrepresent the U.S. as a nation of white Anglo-Saxon protestants that was threatened by miscegenation with the Asian Other. Such discourse was exploited in the 1930s by William Randolph Hearst, who used the Yellow Peril ideology to attack Elaine Black, an American communist and political activist, due to her relationship with Karl Yoneda, a Japanese-American communist activist.</p>\n\n<p>While much of white North America’s rancor for Asian immigrants had been directed toward Chinese immigrants in the latter half of the nineteenth century and the first two decades of the twentieth, by the 1930s, the imperial aspirations of Japan and the events of the Chinese Civil War had begun to shift the focus of anti-Asian racism. Following Japan’s invasion of China in 1937, the American government reluctantly agreed to aid Chiang Kai-shek’s faction against the communist Mao Tse-tung. This relationship was formalized after Japan attacked Pearl Harbor in December 1941. No longer were the Chinese the cultural enemy of the United States—now, it was Imperial Japan that represented the greatest threat to white North America. Between 1942 and 1946, 142,000 Japanese Americans and Japanese Canadians were incarcerated in internment camps. (For more on Japanese internment camps, see the answer <a href=\"https://www.reddit.com/r/AskHistorians/comments/c4zn4v/was_there_an_argument_about_what_to_call_japanese/\">here</a> by <a href=\"/u/Georgy_K_Zhukov\">/u/Georgy_K_Zhukov</a>, the answers <a href=\"https://www.reddit.com/r/AskHistorians/comments/8tm76v/what_were_the_reactions_to_japanese_internment/\">here</a> by <a href=\"/u/sakuraxatsume\">/u/sakuraxatsume</a> and <a href=\"/u/Lubyak\">/u/Lubyak</a>, the answer <a href=\"https://www.reddit.com/r/AskHistorians/comments/5do4i7/is_there_evidence_that_japanese_internment_camps/\">here</a> by <a href=\"/u/DBHT14\">/u/DBHT14</a>, and the answers <a href=\"https://www.reddit.com/r/AskHistorians/comments/45x8mo/what_happened_to_those_that_resisted_the_japanese/\">here</a> by <a href=\"/u/kizhe\">/u/kizhe</a>.)</p>\n\n<p>Victory over Japan in the Second World War shifted perceptions of Asians in North America yet again. In the postwar period, Asian Americans and Asian Canadians worked hard to assimilate more fully into Canadian and American society. In 1952, Asian immigrants were finally granted the right to become naturalized citizens of the United States, and in 1965, the exclusionary immigration acts were finally fully repealed, allowing for free Asian immigration into the United States for the first time in over eighty years.</p>\n\n<p><strong>The Myth of the Model Minority</strong></p>\n\n<p>The success of Asian Americans in the postwar period prompted sociologist William Peterson to dub Asians the “model minority” in a 1966 <em>New York Times</em> editorial. This ideological transformation represents the other side of historic anti-Asian racism in North America. As an ideology, though, it is especially insidious.</p>\n\n<p>It should not be taken as any surprise that Peterson published his editorial on the “model minority” at the height of the American civil rights movement. In his editorial, he describes both the “model minority” and the “problem minority”, which is implied to be Black Americans, though he never explicitly states this. Thus, the two racial groups were (and continue to be) unfairly compared to one another. Asian Americans were the model minority because they had successfully assimilated into North American society through hard work and the pursuit of education. Black Americans were the problem minority because they had failed to “improve” themselves in the same way given the same amount of time. What makes this characterization <em>especially</em> unfair, however, is that the Immigration Act that had been passed in 1965 explicitly gave preference to Asian immigrants who were educated, wealthy, or worked in certain professions. The “successes” to whom Black Americans were being compared had, to some degree, been recruited to prove a point. In all reality, the purpose of the model minority myth was to absolve white Americans and white Canadians of any responsibility for the structural inequalities from which they had benefited. After all, if Asians could do it, then every other race should be able to as well!</p>\n\n<p>But, the model minority myth is also <em>incredibly</em> racist towards Asians. According to Peterson’s characterization, Asians are intelligent, hard-working, polite, submissive, self-sufficient, driven but rule-abiding, obsessed with the appearance of success, and terrified of disappointing the expectations of their families. The myth sanitized Asians. By being rule-abiding and submissive, they no longer posed a threat to white supremacy and culture. Instead, they became adorably harmless. No longer were Asian men a threat to white male sexuality through their predatory desire for white women. Instead, Asian men were effectively neutered. They were recast as weak, effeminate, and nerdy. Asian women, however, maintained their exotic “China doll” sexuality. No longer did this sexuality represent danger to white men; rather, Asian women became sexual objects to be “enjoyed” by white men. The stereotype of sexual voracity became sexual availability. The Dragon Lady became a Lotus Blossom, and what is especially pernicious about this recharacterization is that this racist stereotype removes sexual agency from Asian women. Research suggests that the three businesses targeted by the Atlanta murderer were legitimate massage therapy spas. They were not places where a client could expect to receive a “happy ending”. Yet, the shooter apparently perceived these businesses as sexual temptations that fueled his sex addiction. Despite his claims that the attacks were not racially motivated, there’s a reason why he assumed Asian women working at spas were sex workers. This linkage between Asian women and sex work dates back to the first waves of Asian immigration to North America and has only been strengthened by the availability paradigm created by the model minority myth. This connection between Asian women and sex work makes Asian women especially vulnerable to this kind of racialized violence since sex workers have historically been one of the most vulnerable and targeted populations for gender-based violence across the globe.</p>\n\n<p>While much more can be said about the Myth of the Model Minority and the way that it places unreasonable expectations upon Asian Americans and Asian Canadians to perform, perhaps the most important thing to state in conclusion is that the Myth of the Model Minority is, in many respects, a silencing ideology. Asians have been characterized as polite and submissive and many have internalized this characterization. In so doing, Asians in North America are less likely to fight back against racially motivated violence. And perhaps this is why the Atlanta area massacres were so shocking. The thousands of individualized attacks in the last year were perpetrated against people socialized to be polite, submissive, and self-sufficient. People, moreover, who have been socialized to just accept what gets thrown at them because they’re the “good” minority…but only so long as they know their place.</p>\n\n<p>[1] See: <a href=\"https://theguardian.com/us-news/2021/mar/16/asian-americans-hate-incidents-pandemic-study\">https://theguardian.com/us-news/2021/mar/16/asian-americans-hate-incidents-pandemic-study</a> and <a href=\"https://www.project1907.org/reportingcentre\">https://www.project1907.org/reportingcentre</a></p>\n\n<p><strong>Further Reading</strong></p>\n\n<p>** Special thanks to <a href=\"/u/IlluminatiRex\">/u/IlluminatiRex</a> and <a href=\"/u/veryshanetoday\">/u/veryshanetoday</a> for suggesting readings for this.</p>\n\n<p>By <a href=\"/u/EnclavedMicrostate\">/u/EnclavedMicrostate</a>:</p>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/ei3r9p/til_tuesdays_luxury_ship_passengers_in_the/fcn5kfu/\">The Tale of the <em>Keying</em></a></li>\n</ul>\n\n<p>By <a href=\"/u/Keyilan\">/u/Keyilan</a>:</p>\n\n<ul>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/4976l7/when_and_went_why_did_asian_americans_go_from/d0pmqmt/\">When and why did Asian Americans go from &quot;yellow peril&quot; to &quot;model minority&quot; in the minds of white Americans?</a></li>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/3xw12k/were_vietnamese_refugees_subject_to_racial/cy8jies/\">Were Vietnamese refugees subject to racial violence in the United States?</a></li>\n<li><a href=\"https://www.reddit.com/r/AskHistorians/comments/4utjh5/questions_on_chinese_in_the_old_west/\">Questions on Chinese in the Old West</a></li>\n</ul>\n\n<p>Ancheta, Angelo N. <em>Race, Rights, and the Asian American Experience</em>, 2nd ed. New Brunswick, NJ and London: Rutgers University Press, 2006.</p>\n\n<p>Chou, Rosalind S. and Joe R. Feagin. <em>The Myth of the Model Minority: Asian Americans Facing Racism</em>, 2nd ed. Boulder, CO and London: Paradigm Publishers, 2015.</p>\n\n<p>Hong, Jane H. <em>Opening the Gates to Asia: A Transpacific History of How America Repealed Asian Exclusion</em>. Chapel Hill: UNC Press, 2019.</p>\n\n<p>Kurashige, Lon. <em>Two Faces of Exclusion: The Untold History of Anti-Asian Racism in the United States</em>. Chapel Hill, NC: UNC Press Books, 2016.</p>\n\n<p>Lee, Erika. <em>The Making of Asian America: A History</em>. New York and London: Simon &amp; Schuster, 2015.</p>\n\n<p>Lee, Jennifer and Min Zhou. <em>The Asian American Achievement Paradox</em>. New York: Russell Sage Foundation, 2015.</p>\n\n<p>Price, John. <em>Orienting Canada: Race, Empire, and the Transpacific</em>. Vancouver and Toronto: UBC Press, 2011.</p>\n\n<p>Tchen, John Kuo Wei and Dylan Yeats, eds. <em>Yellow Peril!: An Archive of Anti-Asian Fear</em>. London and New York: Verso, 2014.</p>\n\n<p>Wu, Ellen D. <em>The Color of Success: Asian Americans and the Origins of the Model Minority</em>. Princeton, NJ and Oxford: Princeton University Press, 2014.</p>\n</div><!-- SC_ON -->",
  "score": 245,
  "permalink": "/r/AskHistorians/comments/m9bmbq/the_atlantaarea_murders_were_racially_motivated_a/",
  "subreddit": "AskHistorians",
  "id": "m9bmbq",
  "is_self": true,
  "media": null,
  "is_video": false
}