{
  "author": "Jinglemisk",
  "original_created_utc": 1629209722,
  "title": "In HBO's Rome there is a dedicated man who reads announcements in the Forum for the public. Did such \"forum announcers\" exist? Were they commissioned by the Senate? Did they belong to a specific organisation?",
  "created_utc": 1629219816,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here is a <a href=\"https://www.youtube.com/watch?v=xH0kO5qcPf8\">video</a> of the man himself. I want to know more about this &quot;profession&quot; where your job was to read Senate announcements. To further add: Did Rome have a dedicated service where they travelled to major cities to spread &quot;state&#39;s news&quot; (laws, edicts, etc.) or since trade was very lucrative they just left it to traders and other travellers?</p>\n</div><!-- SC_ON -->",
  "score": 133,
  "permalink": "/r/AskHistorians/comments/p64nab/in_hbos_rome_there_is_a_dedicated_man_who_reads/",
  "subreddit": "AskHistorians",
  "id": "p64nab",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Here is a video [https://www.youtube.com/watch?v=xH0kO5qcPf8] of the man\nhimself. I want to know more about this \"profession\" where your job was to read\nSenate announcements. To further add: Did Rome have a dedicated service where\nthey travelled to major cities to spread \"state's news\" (laws,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本人の動画[https://www.youtube.com/watch?v=xH0kO5qcPf8]をご紹介します。\nを見てください。読むことが仕事だったこの「職業」について、もっと知りたい\n上院の発表を読むことが仕事だったこの「職業」について、もっと知りたい。さらに付け加えると。ローマには、主要都市を巡回するような\n国のニュース」（法律や...）を広めるために主要都市を回っていたのでしょうか？",
      "title": "HBOの『ローマ』では、フォーラムのアナウンスを一般向けに読む専任の人がいます。このような「フォーラム・アナウンサー」は存在したのでしょうか？元老院から依頼されたのか？特定の組織に属していたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里有一个视频[https://www.youtube.com/watch?v=xH0kO5qcPf8]，是这个人\n他本人。我想知道更多关于这个 \"职业 \"的情况，你的工作是阅读\n参议院的公告。要进一步补充。罗马是否有一个专门的服务机构，在那里\n他们到各大城市去传播 \"国家新闻\"（法律，......）。",
      "title": "在HBO的《罗马》中，有一个专门的人在论坛上为公众宣读公告。这种 \"论坛播报员 \"是否存在？他们是由元老院委托的吗？他们属于某个特定的组织吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有一個視頻[https://www.youtube.com/watch?v=xH0kO5qcPf8]，是這個人\n他本人。我想知道更多關於這個 \"職業 \"的情況，你的工作是閱讀\n參議院的公告。要進一步補充。羅馬是否有一個專門的服務機構，在那裏\n他們到各大城市去傳播 \"國家新聞\"（法律，......）。",
      "title": "在HBO的《羅馬》中，有一個專門的人在論壇上爲公衆宣讀公告。這種 \"論壇播報員 \"是否存在？他們是由元老院委託的嗎？他們屬於某個特定的組織嗎？"
    }
  ]
}