{
  "author": "anon8496847385",
  "the_new_excerpt": "I’m here for the sole reason to get out of this rat race that we call life and\nwork. I want control over my own life and Crypto offers opportunities that\nnothing else does.\n\nI want to invest over years and HODL my little diamond hands until it’s enough\nof a nest egg to rock up to my bosses office…",
  "original_created_utc": 1621366557,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がここにいる唯一の理由は、人生や仕事と呼ばれるラットレースから抜け出すためです。\n仕事をしています。私は自分の人生をコントロールしたいのですが、暗号は他にはない機会を提供してくれます。\n他にはない機会を提供してくれます。\n\n私は何年もかけて投資し、小さなダイヤモンドの手をHODLしたいと思っています。\n上司のオフィスに出向くのに十分な蓄えになるまで。",
      "title": "金持ちになるために来たんだから、気にすることもないさ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里的唯一原因是要摆脱我们称之为生活和工作的这场老鼠赛跑。\n工作。我想控制我自己的生活，而加密货币提供的机会是\n其他任何东西都做不到。\n\n我想通过多年的投资，用我的小钻石手，直到它足够的\n我想通过多年的投资，用我的小钻石手，直到它足以成为我老板办公室里的一个窝囊废......",
      "title": "我是来发财的，我甚至都不关心"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏的唯一原因是要擺脫我們稱之爲生活和工作的這場老鼠賽跑。\n工作。我想控制我自己的生活，而加密貨幣提供的機會是\n其他任何東西都做不到。\n\n我想通過多年的投資，用我的小鑽石手，直到它足夠的\n我想通過多年的投資，用我的小鑽石手，直到它足以成爲我老闆辦公室裏的一個窩囊廢......",
      "title": "我是來發財的，我甚至都不關心"
    }
  ],
  "title": "I’m here to get rich and I don’t even care",
  "created_utc": 1621373433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m here for the sole reason to get out of this rat race that we call life and work. I want control over my own life and Crypto offers opportunities that nothing else does.</p>\n\n<p>I want to invest over years and HODL my little diamond hands until it’s enough of a nest egg to rock up to my bosses office and say a big FU and I’m done with this shit.</p>\n\n<p>That is what I want, I’m willing to be patient. Good luck everyone and I hope they get what they want from this tech, be it financial freedom or a revolution of tech. </p>\n\n<p>Regardless of your goals and desire. We don’t have to be at each other’s throat. Someone can have a desire to profit whilst someone is in it for the tech. They can co-exist as can all of us. Positive vibes my friends.</p>\n</div><!-- SC_ON -->",
  "score": 542,
  "permalink": "/r/CryptoCurrency/comments/nfjzaj/im_here_to_get_rich_and_i_dont_even_care/",
  "subreddit": "CryptoCurrency",
  "id": "nfjzaj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801357
}