{
  "author": "partymsl",
  "original_created_utc": 1657216959,
  "title": "The President of El Salvador and CEO of the biggest crypto exchange just trolled the Gold-believer Peter Schiff, on Twitter. This is truly a simulation we live in.",
  "created_utc": 1657243663,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just today the President of El Salvador and the CEO of Binance trolled Peter Schiff on a tweet about Bitcoin. In the tweet Peter Schiff, the well known Gold-believer and Crypto hater, said that Crypto failed and now institutions are going to back out (meaning that he acknowledged at the first that institutions have actually invested in crypto) and that Saylor nor Nayib Bukele have the guts to hold up crypto now.&lt;/p&gt;\n\n&lt;p&gt;Nayib Bukele, the president of a whole country, had enough time to respond here and asked &amp;quot;How&amp;#39;s your bank going?&amp;quot;. That&amp;#39;s a pretty big troll to Peter Schiffs recently set up banks that got closed by Puerto Rico. And yes that was quit some emotional damage. The CEO of Binance responded do his tweet with a Bitcoin meme too.&lt;/p&gt;\n\n&lt;p&gt;Even in a bear market we getting no pause on some casual Crypto Twitter drama.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 408,
  "permalink": "/r/CryptoCurrency/comments/vtou1g/the_president_of_el_salvador_and_ceo_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "vtou1g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just today the President of El Salvador and the CEO of Binance trolled Peter\nSchiff on a tweet about Bitcoin. In the tweet Peter Schiff, the well known\nGold-believer and Crypto hater, said that Crypto failed and now institutions are\ngoing to back out (meaning that he acknowledged at the first that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど今日、エルサルバドルの大統領とBinanceのCEOがPeterを荒らしました。\nビットコインに関するツイートでシフ氏を荒らしました。そのツイートでは、ピーター・シフ氏は、有名な\n金信者で暗号嫌いで知られるピーター・シフ氏は、暗号は失敗し、今や金融機関は\nが手を引くと述べた。",
      "title": "エルサルバドル大統領と暗号取引所最大手のCEOが、Twitterで金信者のピーター・シフ氏を罵倒した。これはまさに私たちが住んでいるシミュレーションです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在今天，萨尔瓦多总统和Binance的首席执行官对Peter进行了嘲弄。\nSchiff关于比特币的一条推特。在这条推文中，彼得-希夫，众所周知的\n在推文中，Peter Schiff，众所周知的黄金信仰者和加密货币的仇视者，说加密货币失败了，现在机构要退出了。\n他说，加密货币失败了，现在机构要退缩了（意思是他一开始就承认...",
      "title": "萨尔瓦多总统和最大的加密货币交易所的首席执行官刚刚在Twitter上嘲弄了黄金信仰者彼得-希夫。这确实是我们生活的一个模拟。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在今天，薩爾瓦多總統和Binance的首席執行官對Peter進行了嘲弄。\nSchiff關於比特幣的一條推特。在這條推文中，彼得-希夫，衆所周知的\n在推文中，Peter Schiff，衆所周知的黃金信仰者和加密貨幣的仇視者，說加密貨幣失敗了，現在機構要退出了。\n他說，加密貨幣失敗了，現在機構要退縮了（意思是他一開始就承認...",
      "title": "薩爾瓦多總統和最大的加密貨幣交易所的首席執行官剛剛在Twitter上嘲弄了黃金信仰者彼得-希夫。這確實是我們生活的一個模擬。"
    }
  ]
}