{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Tuesday, April 20, 2021\n\nStocks fell Tuesday, with all three major indexes dipping for the second\nstraight session. Cyclical, travel and leisure stocks pulled back sharply while\nmega-cap tech stocks slid even as the 10-year Treasury yield edged lower.\n\nDespite recent dips, the…",
  "original_created_utc": 1618952485,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 火曜日, 4月 20, 2021\n\n火曜日の株価は下落し、主要3指数すべてが2回連続で下落した。\nした。景気循環型、旅行・レジャー関連の銘柄が大幅に反落した一方で\nまた、10年債利回りが低下しているにもかかわらず、メガキャップのハイテク株が下落しました。\n\n最近の下落にもかかわらず、...",
      "title": "本日、2021年4月20日（火）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾 - 2021年4月20日，星期二\n\n周二股市下跌，所有三个主要指数连续第二个交易日下跌。\n连续两个交易日下跌。周期性股票、旅游和休闲股票大幅回落，而\n巨型股科技股下滑，甚至10年期国债收益率也在走低。\n\n尽管最近有所下降，但...",
      "title": "以下是今天的市场回顾，2021年4月20日，星期二"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧 - 2021年4月20日，星期二\n\n週二股市下跌，所有三個主要指數連續第二個交易日下跌。\n連續兩個交易日下跌。週期性股票、旅遊和休閒股票大幅回落，而\n巨型股科技股下滑，甚至10年期國債收益率也在走低。\n\n儘管最近有所下降，但...",
      "title": "以下是今天的市場回顧，2021年4月20日，星期二"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, April 20, 2021",
  "created_utc": 1618976234,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Tuesday, April 20, 2021</strong></p>\n\n<p>Stocks fell Tuesday, with all three major indexes dipping for the second straight session. Cyclical, travel and leisure stocks pulled back sharply while mega-cap tech stocks slid even as the 10-year Treasury yield edged lower.  </p>\n\n<p>Despite recent dips, the indexes remain near all-time highs, with the S&amp;P 500 (SPY) up roughly 10% year-to-date, so it’s not necessarily surprising the market beginning to pull back.  Ryan Detrick, chief market strategist for LPL Financial wrote in a note today, &quot;Many of our favorite sentiment gauges are becoming extremely bullish, which could be a near-term contrarian warning. The American Association of Individual Investors Sentiment Survey recently showed bulls outnumber bears by the most since January 2018.&quot;</p>\n\n<p>In recent weeks, better-than-expected economic data in consumer spending and unemployment and strong performances by mega-cap stocks like Apple (AAPL), Microsoft (MSFT), and Google (GOOG, GOOGL) have driven the market higher. On the other hand, growth stocks and more speculative plays have pulled back sharply, extending a terrible run of performance in 2021. After hitting all-time highs near the middle of February, many growth stocks are down 30-50% from those levels. While it’s hard to pinpoint the exact factors why, we think (1) elevated Treasury yields compared to 12 months ago, (2) inflationary fears, (3) profit-taking after an incredible run in 2020, and (4) investor rotation to safer assets are all impacting growth stocks to the downside. </p>\n\n<p>Looking ahead, market participants will continue to monitor earnings season to gauge if corporate profits are growing in tandem with the recovering economy. Roughly 9% of companies in the SPY have reported, with 81% beating expectation. At the time of writing, Netflix (NFLX) just reported a sharp miss in new paying subscribers added (+3.98 million vs. +6.29 million expected), causing the stock to plummet 10% in after-hours. This is likely to have negative implications for market performance tomorrow.</p>\n\n<p>White House chief medical advisor Dr. Anthony Fauci said he believes the U.S. will likely resume use of the Johnson &amp; Johnson Covid-19 vaccine as soon as Friday with a warning or restriction attached. The doctor said, “My estimate is that we will continue to use it in some form. I doubt very seriously if they just cancel it. I don’t think that’s going to happen. I do think that there will likely be some sort of warning or restriction or risk assessment. I don’t think it’s just going to go back and say, ‘Okay, everything’s fine. Go right back.’ I think it’ll likely say, ‘Okay, we’re going to use it, but be careful under these certain circumstances.”</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Chat startup Discord Inc. has halted talks to sell itself to potential suitors including Microsoft (MSFT), according to people familiar with the matter, as it resumes interest in a potential initial public offering down the line.</li>\n<li>Senior executives with Alphabet&#39;s Google and Apple will testify on Wednesday about antitrust concerns related to their app stores along with executives of three companies which rely on those online stores, the leaders of the Senate Judiciary Committee&#39;s antitrust panel said on Monday.</li>\n<li>The U.S. Consumer Product Safety Commission issued a warning Saturday advising consumers to stop using Peloton (PTON) Interactive&#39;s treadmill if there are small children or pets at home. The warning comes after a small child died in March during a treadmill accident. This could affect the company&#39;s product-safety profile, a material category for the household and personal-goods sector, according to the Sustainability Accounting Standards Board. The stock pulled back sharply</li>\n<li>The U.K. government said it would probe Nvidia Corp.&#39;s $40 billion deal to buy British chip-designer Arm from SoftBank Group Corp., over possible national security issues, adding new regulatory scrutiny to the proposed deal.</li>\n<li><strong>**Please note current stock price was written premarket and does not reflect intraday movement*\\</strong>*</li>\n<li>Allegiant Travel (ALGT) from $250 to $285 at Buy. Stock currently around $231</li>\n<li>Coupa Software (COUP target raised by Piper Sandler from $300 to $315 at Overweight. Stock currently around </li>\n<li>IBM with a host of target raises. Consensus price target around $150 at Buy. Stock currently around $138</li>\n<li>UnitedHealth Group target raised by Truist Securities from $420 to $450 at Buy. Stock currently around $397</li>\n<li>Square (SQ) target raised by Barclays from $330 to $340 at Overweight. Stock currently around $243</li>\n<li>Raytheon Technologies (RTX) target raised by Credit Suisse from $81 to $90 at Outperform. Stock currently around $77</li>\n<li>Paypal (PYPL) target raised by Rosenblatt Securities from $320 to $350 at Buy. </li>\n<li>Morgan Stanley (MS) target raised by Piper Sandler from $82 to $87 at Neutral. Stock currently around $77</li>\n<li>Lam Research (LRCX) target raised by Cowen from $585 to $700 at Outperform. Stock currently around $612</li>\n</ul>\n\n<p>The four most dangerous words in investing are: this time is different.” - John Templeton</p>\n</div><!-- SC_ON -->",
  "score": 61,
  "permalink": "/r/stocks/comments/mv0b3x/here_is_a_market_recap_for_today_tuesday_april_20/",
  "subreddit": "stocks",
  "id": "mv0b3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527440
}