{
  "author": "TK-710",
  "original_created_utc": 1645917885,
  "title": "Why are soldiers and spies treated differently in the Geneva Convention?",
  "created_utc": 1645935867,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi All,&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve  been seeing posts about a group of Russian soldiers who were found  dressed as Ukrainian soldiers. These posts have noted how these soldiers  can be executed because dressing in an enemy&amp;#39;s uniform means that they  have given up the protections afforded to soldiers by the Geneva  Convention.&lt;/p&gt;\n\n&lt;p&gt;My question: What is the historical reason that soldiers and spies are treated so differently in the Geneva Convention?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if this is more of a legal or historical question, but it seems like it involves a fair amount of WWI/WWII history.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/t2a1ju/why_are_soldiers_and_spies_treated_differently_in/",
  "subreddit": "AskHistorians",
  "id": "t2a1ju",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi All,\n\nI've been seeing posts about a group of Russian soldiers who were found dressed\nas Ukrainian soldiers. These posts have noted how these soldiers can be executed\nbecause dressing in an enemy's uniform means that they have given up the\nprotections afforded to soldiers by the Geneva…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\nロシア兵の一団が服を着ているところを発見されたという記事を目にしたことがあります。\nウクライナの兵士として これらの投稿は、これらの兵士がどのように処刑されるかを指摘しています。\n敵の制服を着るということは、敵の制服を着るということを放棄したことになるからです。\nジュネーブ条約で兵士に与えられている保護...",
      "title": "ジュネーブ条約で兵士とスパイの扱いが違うのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我一直看到关于一群俄罗斯士兵的帖子，他们被发现装扮成\n装扮成乌克兰士兵。这些帖子指出这些士兵如何被处决\n因为穿上敌人的制服意味着他们已经放弃了日内瓦公约赋予士兵的保护。\n日内瓦公约》给予士兵的保护。",
      "title": "为什么《日内瓦公约》中对士兵和间谍的待遇不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我一直看到關於一羣俄羅斯士兵的帖子，他們被發現裝扮成\n裝扮成烏克蘭士兵。這些帖子指出這些士兵如何被處決\n因爲穿上敵人的制服意味着他們已經放棄了日內瓦公約賦予士兵的保護。\n日內瓦公約》給予士兵的保護。",
      "title": "爲什麼《日內瓦公約》中對士兵和間諜的待遇不同？"
    }
  ]
}