{
  "author": "SweetPie123",
  "the_new_excerpt": "In this post I will try to argue why HEX is not a solid investment, and might\neven be a Ponzi scheme\n\nSo before we start analyzing the ERC-20 token HEX, lets get the definition of a\nPonzi out of the way:\n\n> 'A Ponzi scheme (/ ˈ p ɒ n z i /, Italian: ; also a Ponzi game) is a form of\n> fraud that…",
  "original_created_utc": 1609772771,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在这篇文章中，我将试图论证为什么祸不单行不是一项坚实的投资，而可能\n甚至是一个庞氏骗局\n\n所以在我们开始分析erc-20令牌祸不单行之前，让我们先来了解一下\n庞氏：别挡道：\n\n>‘庞氏骗局(/ˈpɒn z i/，意大利语：；也是庞氏游戏)是\n>欺骗…",
      "title": "为什么祸不单行是庞氏骗局，而不是坚实的投资。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這篇文章中，我將試圖論證爲什麼禍不單行不是一項堅實的投資，而可能\n甚至是一個龐氏騙局\n\n所以在我們開始分析erc-20令牌禍不單行之前，讓我們先來了解一下\n龐氏：別擋道：\n\n>‘龐氏騙局(/ˈpɒn z i/，意大利語：；也是龐氏遊戲)是\n>欺騙…",
      "title": "爲什麼禍不單行是龐氏騙局，而不是堅實的投資。"
    }
  ],
  "title": "Why HEX is a Ponzi and not a solid investment.",
  "created_utc": 1609799910,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>In this post I will try to argue why HEX is not a solid investment, and might even be a Ponzi scheme</strong></p>\n\n<p>So before we start analyzing the ERC-20 token HEX, lets get the definition of a Ponzi out of the way:</p>\n\n<blockquote>\n<p><em>&#39;A Ponzi scheme (/ ˈ p ɒ n z i /, Italian: ; also a Ponzi game) is a form of fraud that lures investors and pays profits to earlier investors with funds from more recent investors. The scheme leads victims to believe that profits are coming from product sales or other means, and they remain unaware that other investors are the source of funds.&#39;</em></p>\n</blockquote>\n\n<p>From this definition we can conclude that a Ponzi needs to have a few aspects:</p>\n\n<ol>\n<li>lure in new investors</li>\n<li>profits are paid to early investors from recent investors</li>\n<li>Investors believe profits come from added value by the product (in this case the coin) but are actually retrieved from recent investors</li>\n</ol>\n\n<p><strong>Now, lets take a look at what HEX claims to be on their website:</strong></p>\n\n<blockquote>\n<p>&#39;HEX is the first blockchain certificate of deposit. HEX virtually lends value from stakers to non stakers, as staking reduces supply, causing positive price pressure on unstaked coins. HEX&#39;s goal is to replace gold as a store of value (7.7 Trillion USD). Replace credit card companies and payment companies like PayPal (around $770 billion in Visa, MasterCard, and PayPal alone) Replace legacy certificates for deposit ($571 Billion in the USA alone on just those under $100,000) Replace middlemen with trustless interest.</p>\n</blockquote>\n\n<p><strong>What actually is a Bank Time Deposit?</strong></p>\n\n<p>HEX claims that they transfer the Bank Time Deposit business model to the blockchain. In the normal banking sector a Bank Time Deposit is often a Certificate of Deposit (CD). A CD is essentially a savings account that is opened with the promise that the owner won&#39;t touch the money for a set period of time. There often is a penalty when a customer decides to withdraw money earlier than the set time frame. Why do banks do this you might wonder? Time deposit accounts provide banks with the cash flow they need to lend money to other customers. </p>\n\n<p><strong>Let&#39;s get back to point number 3 of the definition.</strong></p>\n\n<blockquote>\n<p>Investors believe profits come from added value by the product (in this case the coin) but are actually retrieved from recent investors</p>\n</blockquote>\n\n<p>So where does HEX get its value from?  According to HEX themselves:</p>\n\n<ul>\n<li><strong>Emergency end stake</strong> Half of the penalty which is 50% of days committed to.</li>\n<li><strong>Late End Stake</strong> Half of 1% of entire stake per week after 2 week grace week.</li>\n<li><strong>&#39;Shareholders</strong> profit from the 3.69% annual inflation, early &amp; late end stake penalties.&#39;</li>\n</ul>\n\n<p>The only way for HEX to be profitable is for stakers to get penalized for ending the stake early or if the price of the coin goes up. Staking does not add any real value to the coin itself, the profit is derived from their investors to give to other investors. </p>\n\n<p><strong>This also brings me back to number 2 of the definition.</strong></p>\n\n<p>HEX launched on December 2, 2019. Early investors had the time to start staking before anyone else did, this results in a cashflow from early investors to recent investors. HEX claims to have an average of <strong>40%</strong> interest per year. This means early investors already raked in more than 40% plus the end of stake penalties from later investors. 40% interest per year is only possible if they get new people in, otherwise the the scheme collapses (now cashflow anymore).</p>\n\n<p><strong>We covered point 2 and 3 of the definition of a Ponzi, lets get the final one out of the way.</strong></p>\n\n<blockquote>\n<p>lure in new investors</p>\n</blockquote>\n\n<p>Andreas Antonopoulos says he was offered 10 BTC for an interview with the HEX team to show that Hex is not a scam. He declined this, and decided to call them out directly on his Twitter. HEX has very aggressive advertisement campaigns. They plastered ads on <a href=\"https://cointelegraph.com/news/hex-plasters-uk-with-ads-boasting-of-11-500-returns\">London</a> public transportation, in newspapers, and during English Premier League soccer games. The token was even promoted in a half-page ad in The Economist to lure in new investors.</p>\n\n<p><strong>Some more sketchy things with HEX:</strong></p>\n\n<ul>\n<li>Around $7 million worth of Ethereum has been withdrawn from an address associated with the HEX cryptocurrency after weeks of speculation that it was headed towards an <a href=\"https://cryptoslate.com/hex-origin-address-emptied-out-almost-7-million-withdrawn/\">exit scam</a> - 7 january 2020. The creator of HEX, Richard Heart, is in control of this wallet.</li>\n<li>Richard Heart controls 45% of the total HEX supply. We see this more often with other coins, but in combination with the given arguments earlier it&#39;s a bit sketchy to say the least.</li>\n</ul>\n\n<p><strong>Conclusion:</strong></p>\n\n<p>As an investor with little knowledge behind how coins work, it might seem really profitable to start staking HEX or buying their tokens. My only advice to all the new people here can be: stay away from it, stay away from any coin that promises a certain return over a given period. HEX is very likely to be a Ponzi scheme and before you know it the creator disappears with all the funds they collected.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/f6IIAgOvYQUxbz0Wjp-tzDCYlZFdSbiZa6y6AO0MzJQ.jpg?auto=webp&s=137aabfe206c01f2b60f33aff0cdb01487a9bee3",
          "width": 1450,
          "height": 966
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/f6IIAgOvYQUxbz0Wjp-tzDCYlZFdSbiZa6y6AO0MzJQ.jpg?width=108&crop=smart&auto=webp&s=e6af85b7e7749b1945277ad4f257437d8deb351f",
            "width": 108,
            "height": 71
          },
          {
            "url": "https://external-preview.redd.it/f6IIAgOvYQUxbz0Wjp-tzDCYlZFdSbiZa6y6AO0MzJQ.jpg?width=216&crop=smart&auto=webp&s=89ad4a4e61c723295ebf8b74829ca9328680f658",
            "width": 216,
            "height": 143
          },
          {
            "url": "https://external-preview.redd.it/f6IIAgOvYQUxbz0Wjp-tzDCYlZFdSbiZa6y6AO0MzJQ.jpg?width=320&crop=smart&auto=webp&s=4f1b2c4781c38c226bd29b82eadb07159245156a",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/f6IIAgOvYQUxbz0Wjp-tzDCYlZFdSbiZa6y6AO0MzJQ.jpg?width=640&crop=smart&auto=webp&s=8378c44918fe3fceca4870cd2ee81d2180067d3c",
            "width": 640,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/f6IIAgOvYQUxbz0Wjp-tzDCYlZFdSbiZa6y6AO0MzJQ.jpg?width=960&crop=smart&auto=webp&s=d8fd5992dcd9a98aa5661422e834085f2384aa1a",
            "width": 960,
            "height": 639
          },
          {
            "url": "https://external-preview.redd.it/f6IIAgOvYQUxbz0Wjp-tzDCYlZFdSbiZa6y6AO0MzJQ.jpg?width=1080&crop=smart&auto=webp&s=d99cb68f68795fb5637f18aafcd9c9095f38788c",
            "width": 1080,
            "height": 719
          }
        ],
        "variants": {},
        "id": "w1tfPInbqcrbKOjNACUb08XRL-j-StA4Lu_BYy20pCs"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/kqagf7/why_hex_is_a_ponzi_and_not_a_solid_investment/",
  "subreddit": "CryptoCurrency",
  "id": "kqagf7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100746072
}