{
  "author": "Tepllhcgftwhdg",
  "the_new_excerpt": "Get your tinfoil hat out , its time to see what you think you want to see but\ndon't really want to. This is perfect for any newbie trying to understand what\nis going on and how the system has ended up the way it has.\n\nTl;Dr at end.\n\nThere are many great DD's that clearly explain Naked Shorting in 3…",
  "original_created_utc": 1615289451,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "把你的锡箔纸帽子拿出来，它的时间来看看你认为你想看到的，但。\n不真的想。这对于任何一个新手来说都是完美的，他们想了解什么是\n是怎么回事，以及如何系统已经结束的方式。\n\nTl;Dr在最后。\n\n有很多伟大的DD，清楚地解释了裸空的3... ...",
      "title": "一个10部分的系列，将清楚地解释什么是赤裸裸地在股市做空"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "把你的錫箔紙帽子拿出來，它的時間來看看你認爲你想看到的，但。\n不真的想。這對於任何一個新手來說都是完美的，他們想了解什麼是\n是怎麼回事，以及如何系統已經結束的方式。\n\nTl;Dr在最後。\n\n有很多偉大的DD，清楚地解釋了裸空的3... ...",
      "title": "一個10部分的系列，將清楚地解釋什麼是赤裸裸地在股市做空"
    }
  ],
  "title": "A 10 part series that will clearly explain what is going on with Naked Shorting in Stock Market",
  "created_utc": 1615304516,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Get your tinfoil hat out , its time to see what you think you want to see but don&#39;t really want to. This is perfect for any newbie trying to understand what is going on and how the system has ended up the way it has.</p>\n\n<p>Tl;Dr at end.</p>\n\n<p>There are many great DD&#39;s that clearly explain Naked Shorting in 3-4 sentences that we can all agree are great. <strong>However while looking around for DTCC ownership</strong> and after having found <a href=\"http://theoildrum.com/special/archives\">The Oil Drum</a> (a great archive of oil related information/discussion btw), <strong>Cede and co</strong> which was brought to my attention a month ago. I dismissed it as a conspiracy theory until I saw the post a couple days ago <strong>(credit:</strong> <a href=\"/u/bEAc0n\">u/bEAc0n</a>) bringing them up again and I took it seriously for once, which then led me to try and find a website like The Oil Drum but for Shorting.</p>\n\n<p>This website is run by a <strong>dude called Larry with 40 years of WS experience, ex-Goldman Sachs EVP, Board Member, Director of Equities+Income</strong> and so on, he clearly brings up and explains the implications of everything to do with Naked Shorting and how it plays out in the market. You can look around his website but all he really talks about other than the Shorting is Pharmaceuticals/Bio-tech.</p>\n\n<p>I sent him an email and this was his response</p>\n\n<blockquote>\n<p>Thanks for the kind words.  </p>\n\n<p>No problem with your request. Here is the link you should give them.  </p>\n\n<p><a href=\"https://smithonstocks.com/?s=illegal+naked+shorting\">https://smithonstocks.com/?s=illegal+naked+shorting</a> (This is Part 10)  </p>\n\n<p>If there is any movement formed to take on illegal naked shorting, I would be happy to contribute. I have been consistently frustrated in trying to get media or politicians interested.</p>\n</blockquote>\n\n<p><strong>Read part 8 if you want to hear about CEDE and how once a counterfeit share is created it is forever viewed as a legitimate share unless if the company bring all shares back into itself to verify them (basically once counterfeited it exists forever, as a shareholder meet only verifies the shares owned by the ppl who will vote iirc)</strong></p>\n\n<p><a href=\"https://smithonstocks.com/part-1-in-a-series-of-reports-on-blatant-widespread-stock-manipulation-that-is-enabled-by-illegal-naked-shorting/\"><strong>Part 1</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-2-in-series-on-illegal-naked-shortings-role-in-stock-manipulation-conventional-wisdom-on-how-illegal-short-sales-are-executed/\"><strong>Part 2</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-3-in-series-on-illegal-naked-shortings-role-in-stock-manipulation-prime-brokers-and-the-dtcc-have-a-troubling-monopoly-on-clearing-and-settling-stock-trades/\"><strong>Part 3</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-4-in-series-on-illegal-naked-shortings-role-in-stock-manipulation-who-are-the-key-players/\"><strong>Part 4</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-5-in-series-on-illegal-naked-shortings-role-in-stock-manipulation-traditional-shorting-compared-to-naked-shorting-both-legal-and-illegal/\"><strong>Part 5</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-6-illegal-naked-shorting-the-secs-regulation-sho-is-intended-to-prevent-illegal-naked-shorting-but-is-ineffective/\"><strong>Part 6</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-7-illegal-naked-shorting-dtcc-continuous-net-settlement-and-stock-borrowing-programs-have-loopholes-that-facilitate-illegal-naked-shorting/\"><strong>Part 7</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-8-illegal-naked-shorting-series-who-or-what-is-cede-and-what-role-does-cede-play-in-the-trading-of-stocks/\"><strong>Part 8</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-10-of-illegal-naked-shorting-series-the-risk-reward-of-shorting-versus-buying-stocks-is-extremely-unfavorable/\"><strong>Part 9</strong></a><strong>,</strong> <a href=\"https://smithonstocks.com/part-10-of-illegal-naked-shorting-series-legal-shorting-of-stocks-is-a-losers-game-but-illegal-naked-shorting-transforms-it-into-a-winners-game/\"><strong>Part 10</strong></a></p>\n\n<p>This is the important part: a quote from Part 8 if you dont want to read the whole series</p>\n\n<blockquote>\n<p><strong>While you may think you are buying registered stock, you are actually buying a financial derivative related to that stock.</strong> <strong>Effectively, you are buying a financial derivative from brokers of a financial derivative they hold from Cede that is just a digital entry in your DTC account.</strong>  </p>\n\n<p>Cede is at the center of the current, paperless electronic trading system that enables lightning fast trading of large blocks of stock by institutional investors and computers. Unfortunately, the intention  in designing it was to provide liquidity and reduce settlement risk. There is virtually no transparency in the system. Disturbingly, there are loopholes which allow for the counterfeiting of shares by market makers on a massive scale through illegal naked shorting and other measures. <strong>At present, there is no way for an outsider or even the securities industry’s regulator, the SEC, to meaningfully detect and track these counterfeit shares. Once created counterfeit shares go on to be treated the same as legitimate street name shares</strong></p>\n</blockquote>\n\n<p><strong>TL;DR: until the people at the top (aka CEDE and co) are brought into court/subpoenad we will never ever have a truly free financial system, they control everything and it is up to them to decide how and where the stock market goes. Their company valuation is somewhere in the region of $34T as of 2019 IIRC yet it is a private firm??? This means some very big people and organisations are playing a very big game that we are not a part of.</strong></p>\n</div><!-- SC_ON -->",
  "score": 5092,
  "permalink": "/r/stocks/comments/m14jye/a_10_part_series_that_will_clearly_explain_what/",
  "subreddit": "stocks",
  "id": "m14jye",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542577960
}