{
  "author": "Sir_Maxwell_378",
  "original_created_utc": 1659125019,
  "title": "Before the invention of Baby Formula, how did people feed babies when their mother or a wet nurse wasn't around?",
  "created_utc": 1659164980,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I ask this because I&amp;#39;m writing a character backstory for D&amp;amp;D, and it involves a character being abandoned with their blacksmith father shortly after birth, and I&amp;#39;m trying to figure out how a peasant or commoner in Medieval/Renaissance Europe would feed a still milk-dependant infant without access to a wetnurse or someone else who could breastfeed them. Would they just use animal milk like that of cows?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/wbeb52/before_the_invention_of_baby_formula_how_did/",
  "subreddit": "AskHistorians",
  "id": "wbeb52",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I ask this because I'm writing a character backstory for D&D, and it involves a\ncharacter being abandoned with their blacksmith father shortly after birth, and\nI'm trying to figure out how a peasant or commoner in Medieval/Renaissance\nEurope would feed a still milk-dependant infant without access…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "D&Dでキャラクターのバックストーリーを書いているのですが、そのバックストーリーには\nのキャラクターが、生まれてすぐに鍛冶屋の父親と一緒に捨てられたというものです。\n中世・ルネッサンス期のヨーロッパの農民や平民がどのように生活していたかを考えています。\n中世・ルネッサンス期のヨーロッパの農民や庶民が、ミルクに頼る乳児をどうやって養うのか、その方法を考えています。",
      "title": "粉ミルクが発明される前は、母親や乳母が近くにいないとき、どうやって赤ちゃんにミルクを与えていたのでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问这个问题是因为我正在为D&D写一个人物背景故事，它涉及到一个\n角色在出生后不久就被铁匠父亲遗弃了，并且\n我想弄清楚在中世纪/文艺复兴时期，一个农民或平民是如何在\n我想知道在中世纪/文艺复兴时期，一个农民或平民如何在没有机会的情况下喂养一个仍然依赖牛奶的婴儿......",
      "title": "在发明婴儿配方奶粉之前，当母亲或奶妈不在身边时，人们是如何喂养婴儿的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問這個問題是因爲我正在爲D&D寫一個人物背景故事，它涉及到一個\n角色在出生後不久就被鐵匠父親遺棄了，並且\n我想弄清楚在中世紀/文藝復興時期，一個農民或平民是如何在\n我想知道在中世紀/文藝復興時期，一個農民或平民如何在沒有機會的情況下餵養一個仍然依賴牛奶的嬰兒......",
      "title": "在發明嬰兒配方奶粉之前，當母親或奶媽不在身邊時，人們是如何餵養嬰兒的？"
    }
  ]
}