{
  "author": "2012Jesusdies",
  "original_created_utc": 1637768196,
  "title": "Do you experience nightmares, wake up, go back to sleep, get nightmares again, repeat like 7 times in a single night?",
  "created_utc": 1637785500,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have had this happen multiple times, seems to be when I&#39;m stressed out or sleeping very late. I don&#39;t care about a single nightmare, but it starts to get to you when you keep having it and you&#39;re anxious about even closing your eyes again. And I don&#39;t even feel fear during the later nightmares, but just frustration that it keeps happening.</p>\n\n<p>Does anyone else have this?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/r17wu5/do_you_experience_nightmares_wake_up_go_back_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "r17wu5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have had this happen multiple times, seems to be when I'm stressed out or\nsleeping very late. I don't care about a single nightmare, but it starts to get\nto you when you keep having it and you're anxious about even closing your eyes\nagain. And I don't even feel fear during the later nightmares,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この現象は何度も経験していますが、ストレスが溜まっている時や\n非常に遅くまで寝ているときのようです。一回の悪夢は気にしませんが、何度も見ていると気になってきます。\n一回の悪夢は気になりませんが、何度も見ていると、目を閉じることさえ不安になってきます。\nになってきます。また、後から見る悪夢には恐怖を感じないのですが...。",
      "title": "悪夢を見て、目が覚めて、また寝て、また悪夢を見る、ということを一晩に7回くらい繰り返していませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有过多次这样的情况，似乎是在我压力过大或睡觉时发生的。\n睡得很晚。我并不关心单一的噩梦，但当你不断地做噩梦，甚至连闭上眼睛都感到焦虑时，你就会开始感到不安。\n但当你不断地做恶梦时，你就会感到焦虑，甚至不敢闭上眼睛。\n再一次。而在后来的噩梦中，我甚至不感到恐惧，...",
      "title": "你是否经历过恶梦，醒来后继续睡觉，又做恶梦，一晚上重复7次？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有過多次這樣的情況，似乎是在我壓力過大或睡覺時發生的。\n睡得很晚。我並不關心單一的噩夢，但當你不斷地做噩夢，甚至連閉上眼睛都感到焦慮時，你就會開始感到不安。\n但當你不斷地做惡夢時，你就會感到焦慮，甚至不敢閉上眼睛。\n再一次。而在後來的噩夢中，我甚至不感到恐懼，...",
      "title": "你是否經歷過惡夢，醒來後繼續睡覺，又做惡夢，一晚上重複7次？"
    }
  ]
}