{
  "author": "Extension-Amphibian4",
  "original_created_utc": 1636363403,
  "title": "How do you cope with crypto profits being higher than your salary at your job?",
  "created_utc": 1636390261,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A little background: I&#39;m still a student but i&#39;m about to become an engineer next summer. This is my first year in crypto, even though i had been on the sidelines since 2017...yet i&#39;ve made more profits this year than i would while working as a beginner engineer for about 8 years (salaries are pretty low in my country, but so are costs and expenses). This is pretty demoralising, i love what i&#39;m studying but thinking that i would never make this kind of money is just sad. I know i&#39;m not the only one in this situation, how do you just go on with your everyday lives and go to work like usual, without thinking all the time about your investments? For me it&#39;s really distracting and being close to my final exams my performance is dying step by step. I also know that eventually bear market will kick in, but it seems so far away...this is my first post here, i hope i set the correct flair for this</p>\n\n<p>Edit: Thank you everyone, i never imagined to read 100+ replies on this matter. Many of the answers gave me a new insight on things and i am grateful to all of you!</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/qp9zvb/how_do_you_cope_with_crypto_profits_being_higher/",
  "subreddit": "CryptoCurrency",
  "id": "qp9zvb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A little background: I'm still a student but i'm about to become an engineer\nnext summer. This is my first year in crypto, even though i had been on the\nsidelines since 2017...yet i've made more profits this year than i would while\nworking as a beginner engineer for about 8 years (salaries are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "少し背景を説明します。私はまだ学生ですが、来年の夏にはエンジニアになろうとしています。\n来年の夏にはエンジニアになる予定です。今年は暗号の世界に入って1年目ですが、それまでは\n2017年から傍観していましたが、今年は初心者エンジニアとして約8年間働いた時よりも多くの利益を上げました。\n初心者のエンジニアとして8年くらい働いた時よりも利益が出ています（給料は...",
      "title": "暗号の利益が自分の仕事の給料よりも高い場合、どのように対処しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一点背景。我仍然是一名学生，但我即将成为一名工程师。\n明年夏天成为一名工程师。这是我在加密货币领域的第一年，尽管我从一开始就一直在旁观。\n但我今年赚的钱比我做了8年初级工程师的时候还要多。\n赚的钱比我做了8年的初级工程师还多（工资是...",
      "title": "你如何应对加密货币的利润高于你工作中的工资？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一點背景。我仍然是一名學生，但我即將成爲一名工程師。\n明年夏天成爲一名工程師。這是我在加密貨幣領域的第一年，儘管我從一開始就一直在旁觀。\n但我今年賺的錢比我做了8年初級工程師的時候還要多。\n賺的錢比我做了8年的初級工程師還多（工資是...",
      "title": "你如何應對加密貨幣的利潤高於你工作中的工資？"
    }
  ]
}