{
  "author": "Aquatax",
  "the_new_excerpt": "Say that I get a vaccine that’s good for a year and sometime during that year my\nbody catches and successfully fights off that disease.\n\nWould the antibodies be able to last for another year as of me successfully\nfighting that disease or would the one year limit still apply based on the\ninitial…",
  "original_created_utc": 1621600232,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、1年間有効なワクチンを接種し、その年のある日、私は\n体がその病気にかかり、見事に撃退されたとします。\n\nその抗体は、私がその病気とうまく戦ったことで、さらに1年間持続するでしょうか？\nそれとも、最初に受けたワクチンの効果に基づいて、1年間の制限が適用されるのでしょうか？\n最初の...",
      "title": "ある病気に対する抗体をすでに持っている人が、その後その病気にかかると、その抗体がブーストされて賞味期限より長く使えるようになるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "假设我接种了一种有效期为一年的疫苗，在这一年中的某个时候我的\n我的身体感染了这种疾病并成功地将其击退。\n\n在我成功抵抗该疾病后，这些抗体是否能够再持续一年？\n抵抗该疾病，还是说一年的限制仍然适用于最初的\n最初的...",
      "title": "如果你已经有了对某种疾病的抗体，之后再染上这种疾病会不会 \"增强 \"抗体，使其持续时间超过其有效期？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "假設我接種了一種有效期爲一年的疫苗，在這一年中的某個時候我的\n我的身體感染了這種疾病併成功地將其擊退。\n\n在我成功抵抗該疾病後，這些抗體是否能夠再持續一年？\n抵抗該疾病，還是說一年的限制仍然適用於最初的\n最初的...",
      "title": "如果你已經有了對某種疾病的抗體，之後再染上這種疾病會不會 \"增強 \"抗體，使其持續時間超過其有效期？"
    }
  ],
  "title": "If you already have antibodies to a disease, would catching that disease afterward “boost” the antibodies allowing them to last longer than their expiration date?",
  "created_utc": 1621620461,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Say that I get a vaccine that’s good for a year and sometime during that year my body catches and successfully fights off that disease. </p>\n\n<p>Would the antibodies be able to last for another year as of me successfully fighting that disease or would the one year limit still apply based on the initial gaining of antibodies?</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/askscience/comments/nhrct4/if_you_already_have_antibodies_to_a_disease_would/",
  "subreddit": "askscience",
  "id": "nhrct4",
  "is_self": true,
  "media": null,
  "is_video": false
}