{
  "author": "waltertrading",
  "the_new_excerpt": "WeedMaps Technology Inc, $MAPS goes public today on the NASDAQ. This is the\nfirst cannabis-tech company of this caliber to be publicly listed. They don’t\nhave to go OTC like other US cannabis stocks since they don’t “touch the plant”.\n\nWhat they do:\n\nWeedMaps provides enterprise software to cannabis…",
  "original_created_utc": 1623846566,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "WeedMaps Technology Inc, $MAPSは、本日、NASDAQに上場します。これは\nこの規模の大麻技術企業が上場するのは初めてです。他の米国の大麻企業のように\n米国の他の大麻銘柄のようにOTCにする必要はありませんが、彼らは「植物に触れない」からです。\n\n同社の事業内容\n\nウィードマップスは、大麻産業にエンタープライズソフトウェアを提供しています。",
      "title": "WeedMapsが公開されました! MAPS DD-テック＋カンナビス"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "WeedMaps科技公司，$MAPS今天在纳斯达克上市。这是\n这是第一家公开上市的这种规模的大麻技术公司。他们不需要\n他们不需要像其他美国大麻股票那样进行场外交易，因为他们不 \"接触植物\"。\n\n他们是做什么的。\n\nWeedMaps为大麻公司提供企业软件。",
      "title": "WeedMaps现已上市! $MAPS DD- 科技 + 大麻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "WeedMaps科技公司，$MAPS今天在納斯達克上市。這是\n這是第一家公開上市的這種規模的大麻技術公司。他們不需要\n他們不需要像其他美國大麻股票那樣進行場外交易，因爲他們不 \"接觸植物\"。\n\n他們是做什麼的。\n\nWeedMaps爲大麻公司提供企業軟件。",
      "title": "WeedMaps現已上市! $MAPS DD- 科技 + 大麻"
    }
  ],
  "title": "WeedMaps is now public! $MAPS DD- Tech + Cannabis",
  "created_utc": 1623851029,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>WeedMaps Technology Inc, $MAPS goes public today on the NASDAQ. This is the first cannabis-tech company of this caliber to be publicly listed. They don’t have to go OTC like other US cannabis stocks since they don’t “touch the plant”.</p>\n\n<p>What they do:</p>\n\n<p>WeedMaps provides enterprise software to cannabis businesses, running their point of sale (POS) services as well as aiding with logistics, regulatory compliance, wholesaling, and ordering. Clients (dispensaries) pay a monthly fee in a standard SaaS model, with fees for other optional services like featured posts or listing priority on the WeedMaps Marketplace. </p>\n\n<p>The company has been operating since 2008 and has been consistently profitable from the start. Weedmaps delivered approx $160 million in revenue in 2020 and has been profitable for its entire 12-year history. </p>\n\n<p>They have 18k+ dispensaries listed on WM Marketplace and over $1.5B GMV (Gross merchandise value) across the WM Business-in-a-Box platform. WeedMaps operates a high-margin marketplace services and never “touches the plant”. </p>\n\n<p>WeedMaps is an essential service for the operation of many retail dispensaries across the US and the many other countries. (including Canada, Austria, Germany, the Netherlands, Spain, and Switzerland).</p>\n\n<p>For instance, one dispensary chain owner said: “I remember when they (WeedMaps) raised their rates by 400% one year and we took a month off of our listings in protest. Our new client acquisition went down by 35%. Our monthly revenue went down by over $50,000 per location. Lesson learned.” </p>\n\n<p>Another owner said: “WeedMaps costs us a fortune, but it is worth every penny. They hit us over the head to be listed on the daily deals page, but that shit flies off the shelf.”</p>\n\n<p>Financials</p>\n\n<ul>\n<li>Revenue forecast to grow at an annualized 40%, EBITDA at an annualized 55% through 2023</li>\n<li>2020 EBITDA was $43 million</li>\n<li>WeedMaps generates 1.5 billion in gross merchandise volume alone</li>\n<li>Stock trades at enterprise value of ≈5x 2022 sales, well below SaaS comps</li>\n</ul>\n\n<p>WeedMaps operates a cloud-based platform, and unlike other cannabis-related businesses, they require minimal physical footprint and are not directly exposed to fluctuations in product input costs. WeedMaps does not require real estate or other significant capital outlays to enter new markets. Their offerings can be customized to new markets to help facilitate expansion, which provides significant flexibility to scale and enter new markets with minimal investment. The capital-efficiency of the WeedMaps business model is evidenced by their robust margin profile and high level of EBITDA converting to free cash flow while achieving their growth. From 2014 to 2020, WM grew revenue at a CAGR of 35%. Over that period of time, WeedMaps has expanded their gross margin rate from 92% to 95%. For 2020, their net income was $39 million and EBITDA was $43 million.</p>\n\n<p>Keep in mind. These financials are still without many states who are bound to legalize or have just recently legalized (NY most notably). As the US cannabis market continues to expand at an exponential rate, WeedMaps will undoubtedly capitalize.</p>\n\n<p>Management: CEO Chris Beals is an absolute Chad and knows how to regulate a complex cannabis industry with his UPenn law degree and weed expertise. Across the WeedMaps executive team, you have high level experience from Goldman Sachs, InstaCart, Google, Snap Inc, Twitter, Nike, Adobe, among other big time corporations. </p>\n\n<p>Yes, there is tons of regulatory complexities in this industry. But, as an well experienced company (doing business profitably since ‘08) and with possibly more connections than anyone in the cannabis game, WeedMaps looks poised for huge growth in a ‘budding’ industry.</p>\n\n<p>I also am linking the full WeedMaps investor presentation on the comments so you can do your own objective research and digging.</p>\n\n<p>I am long $MAPS common shares. This is not financial advice. But I definitely like the stock.</p>\n</div><!-- SC_ON -->",
  "score": 348,
  "permalink": "/r/investing/comments/o13q3g/weedmaps_is_now_public_maps_dd_tech_cannabis/",
  "subreddit": "investing",
  "id": "o13q3g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742350
}