{
  "author": "dkkc19",
  "original_created_utc": 1639661086,
  "title": "Out of all utility tokens, MATIC might be my favorite.",
  "created_utc": 1639683214,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Its okay if you’re someone who invests in a memecoin or dogcoin just for the profit, after all that’s all what we’re here to do.&lt;/p&gt;\n\n&lt;p&gt;But I for one only invest in coins with actual technology and utility behind them cause that will ensure their survival long term.&lt;/p&gt;\n\n&lt;p&gt;I think there are a lot of great utility tokens on the market, but MATIC is my favorite by far for many reasons.&lt;/p&gt;\n\n&lt;p&gt;MATIC might be the best at scaling Ethereum for starters. And they keep working so hard on expanding and upgrading their ZK technology and influence in the market (the recently acquired Mir Protocol for $400M). And I personally think ZK is the future in this market.&lt;/p&gt;\n\n&lt;p&gt;Second, the developers listen a lot to their user base and constantly make changes to the network based on users’ preferences.&lt;/p&gt;\n\n&lt;p&gt;Third, they’re all over the market from NFTs to scalability to GameFi. Wherever you go you can find them.&lt;/p&gt;\n\n&lt;p&gt;Would love to see what some of you favorite utility tokens are :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/rhqo7h/out_of_all_utility_tokens_matic_might_be_my/",
  "subreddit": "CryptoCurrency",
  "id": "rhqo7h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Its okay if you’re someone who invests in a memecoin or dogcoin just for the\nprofit, after all that’s all what we’re here to do.\n\nBut I for one only invest in coins with actual technology and utility behind\nthem cause that will ensure their survival long term.\n\nI think there are a lot of great…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ミームコインやドッグコインに投資している人なら大丈夫でしょう。\nそのために私たちはここにいるのですから。\n\nしかし、私は実際の技術や実用性を備えたコインにしか投資しません。\nその方が長期的に生き残れるからです。\n\n私は、多くの素晴らしい...",
      "title": "ユーティリティ・トークンの中では、MATICが一番好きかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你是一个仅仅为了利润而投资于美墨币或狗币的人，那也没关系。\n利润，毕竟这就是我们在这里要做的事情。\n\n但我只投资于背后有实际技术和效用的硬币\n因为这将确保其长期生存。\n\n我认为有很多伟大的...",
      "title": "在所有的实用代币中，MATIC可能是我最喜欢的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你是一個僅僅爲了利潤而投資於美墨幣或狗幣的人，那也沒關係。\n利潤，畢竟這就是我們在這裏要做的事情。\n\n但我只投資於背後有實際技術和效用的硬幣\n因爲這將確保其長期生存。\n\n我認爲有很多偉大的...",
      "title": "在所有的實用代幣中，MATIC可能是我最喜歡的。"
    }
  ]
}