{
  "author": "mrginopalacca",
  "original_created_utc": 1630663640,
  "title": "Today I boarded a billionaire to Bitcoin",
  "created_utc": 1630679463,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had a meeting today with a VC billionaire. Somehow we started talking about Bitcoin. He was interested, but also kind of suspicious. He told me that he called his private banker months ago about Bitcoin, and then he was redirected to some broker lady that wanted to sell some shares in some company buying into some Bitcoin. He felt it scammy and stayed away.</p>\n\n<p>As he was genuinely interested, I told him to forget about &quot;brokers&quot;, &quot;investment managers&quot; basically everything and everybody circling him and wanting his money. I told him that Bitcoin is available directly to him if he wants and that he does not need the help of suited monkeys. Referred him to try Coinbase and Bitstamp as first steps. Promised him to educate him further on self custody when he is done with the first purchases.</p>\n\n<p>Today he is proceeding with his first purchases.</p>\n\n<p>I think I did my part for the day. And this is the thing you all need to do. There are plenty of wealthy people out there, genuinely interested in Bitcoin. But they do not have the proper angle, the proper contacts, the proper knowledge. They are geniuses with money, but simply do not understand the crypto world, they do not know anyone honestly advising them how to approach. They easily fall into the trap of suits, ending up on the wrong side of the game. All we need to do is to stay humble, and gently assist them. Once their trust is there, real money flows into our ecosystem.</p>\n\n<p>Be humble, spread the word, and we will get to 100k very very soon.</p>\n</div><!-- SC_ON -->",
  "score": 166,
  "permalink": "/r/Bitcoin/comments/ph2809/today_i_boarded_a_billionaire_to_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "ph2809",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had a meeting today with a VC billionaire. Somehow we started talking about\nBitcoin. He was interested, but also kind of suspicious. He told me that he\ncalled his private banker months ago about Bitcoin, and then he was redirected\nto some broker lady that wanted to sell some shares in some company…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日はVCの億万長者とのミーティングがありました。なぜかビットコインの話になりました。\nビットコイン。彼は興味を示してくれましたが、同時にちょっとした疑念も抱いていました。彼が言うには\n数ヶ月前にプライベートバンカーにビットコインについて電話したら、あるブローカーの女性に転送されて\nどこかの会社の株を売りたいという ブローカーの女性に転送されたそうです...",
      "title": "今日はビットコインに億万長者を乗せる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天和一位风险投资的亿万富翁开了个会。不知怎的，我们开始谈论\n比特币。他很感兴趣，但也有点怀疑。他告诉我，他\n几个月前，他给他的私人银行家打电话谈比特币，然后他被转到了\n然后他被转到了某个经纪人女士那里，她想卖掉某个公司的一些股份...",
      "title": "今天我登上了一个亿万富翁去比特币的飞机"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天和一位風險投資的億萬富翁開了個會。不知怎的，我們開始談論\n比特幣。他很感興趣，但也有點懷疑。他告訴我，他\n幾個月前，他給他的私人銀行家打電話談比特幣，然後他被轉到了\n然後他被轉到了某個經紀人女士那裏，她想賣掉某個公司的一些股份...",
      "title": "今天我登上了一個億萬富翁去比特幣的飛機"
    }
  ]
}