{
  "author": "Shishilian",
  "original_created_utc": 1642216397,
  "title": "If you hold Solana accountable for going down but pretend nothing happened with Harmony, you’re a desperate hypocrite.",
  "created_utc": 1642235702,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t hold any SOL or ONE and I don’t plan to do it (at least not soon) but I know that the majority of this sub is scared of Solana, so scared that they’re trying to spread FUD all the time, as if this sub actually has any influence on the market (you really think 5k upvotes will have literally any effect on the market?)&lt;/p&gt;\n\n&lt;p&gt;If one posts “LUL Solana is so garbage Ethereum never went down” for when Solana went down, but then post “it’s no big deal stuff happens” for when Harmony went down, that’s just desperate hypocritical behavior. Either hold them both accountable for the same problem, or don’t hold either accountable. &lt;/p&gt;\n\n&lt;p&gt;It’s easy to pass on circle-jerking sub and shilling random coins on this sub, but this one is just too sad and disgusting to look over imo.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/s4adpl/if_you_hold_solana_accountable_for_going_down_but/",
  "subreddit": "CryptoCurrency",
  "id": "s4adpl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don’t hold any SOL or ONE and I don’t plan to do it (at least not soon) but I\nknow that the majority of this sub is scared of Solana, so scared that they’re\ntrying to spread FUD all the time, as if this sub actually has any influence on\nthe market (you really think 5k upvotes will have literally…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はSOLもONEも持っていませんし、やるつもりもありません（少なくともすぐには）。\nこのサブの大多数はソラナに怯えていることを知っています。\nまるでこのサブが実際に何らかの影響力を持っているかのように、常にFUDを広めようとしています。\n5kのアップヴォートで文字通り...と思っているのか？",
      "title": "潰れたソラナの責任は問うのに、ハーモニーの件は何事もなかったことにするなら、必死の偽善者だな。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不持有任何SOL或ONE，我也不打算这样做（至少不是很快），但我\n但我知道，这个组织的大多数人都害怕索拉纳，害怕到他们一直在散布谣言。\n以至于他们一直试图散布虚假信息，好像这部分人真的有任何影响力一样。\n你真的认为5k的支持率会有字面意义上的......",
      "title": "如果你让索拉纳负责倒下，却假装和谐号什么都没发生，你就是一个绝望的伪君子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不持有任何SOL或ONE，我也不打算這樣做（至少不是很快），但我\n但我知道，這個組織的大多數人都害怕索拉納，害怕到他們一直在散佈謠言。\n以至於他們一直試圖散佈虛假信息，好像這部分人真的有任何影響力一樣。\n你真的認爲5k的支持率會有字面意義上的......",
      "title": "如果你讓索拉納負責倒下，卻假裝和諧號什麼都沒發生，你就是一個絕望的僞君子。"
    }
  ]
}