{
  "author": "MGT01",
  "original_created_utc": 1624549989,
  "title": "Spent the morning with a suicidal friend who bought near ATH, sold all his crypto at near perfect lows. This is the dark side of crypto. Fellas, let’s look out for each other. And FFS don’t risk more than you can afford to lose.",
  "created_utc": 1624563397,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Buddy took out an equity on his home to buy BTC on the run up and was ecstatic for a bit when it hit the ATH. Sold some to later buy DOGE at .71 and ETH at $3900. Sold a few days ago. </p>\n\n<p>Called me up last night distressed as he saw BTC both go up. </p>\n\n<p>I’m kinda not sure how to handle this. Never had a suicidal friend before. I’m going to assume he’s serious. He’s mentally fucked right now, so we’re going to meet for drinks and lunch. </p>\n\n<p>For the record, I never tell my friends and family to get into crypto.</p>\n</div><!-- SC_ON -->",
  "score": 487,
  "permalink": "/r/CryptoCurrency/comments/o73oz6/spent_the_morning_with_a_suicidal_friend_who/",
  "subreddit": "CryptoCurrency",
  "id": "o73oz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Buddy took out an equity on his home to buy BTC on the run up and was ecstatic\nfor a bit when it hit the ATH. Sold some to later buy DOGE at .71 and ETH at\n$3900. Sold a few days ago.\n\nCalled me up last night distressed as he saw BTC both go up.\n\nI’m kinda not sure how to handle this. Never had a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バディはBTCを買うために家のローンを組んでいました。\nATHに到達した時にはちょっとした喜びを感じました。いくつか売って、後でDOGEを0.71で、ETHを\n$3900. 数日前に売却した。\n\n昨晩、BTCが両方とも上昇したのを見て悩んでいると電話がありました。\n\nこれをどう扱っていいのか、ちょっとわからない。今まで一度も...",
      "title": "ATHの近くで買った自殺願望のある友人と午前中を過ごし、完璧に近い安値ですべての暗号を売った。これが暗号の暗黒面だ。皆さん、お互いに気をつけましょう。そして、失う可能性がある以上のリスクを負わないようにしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哥们在BTC上涨的时候用他的房子抵押买了BTC，当它达到ATH时，他欣喜若狂。\n当它达到ATH时，他高兴了好一阵子。后来卖出了一些，在0.71美元买入DOGE，在3900美元买入ETH。\n$3900. 几天前卖掉了。\n\n昨晚给我打电话，他看到BTC都涨了，很苦恼。\n\n我有点不确定如何处理这个问题。从未有...",
      "title": "与一个有自杀倾向的朋友一起度过了一个上午，他在ATH附近买入，在接近完美的低点卖出了他所有的加密货币。这就是加密货币的黑暗面。伙计们，让我们互相照应吧。还有，不要冒超过你能承受的损失的风险。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "哥們在BTC上漲的時候用他的房子抵押買了BTC，當它達到ATH時，他欣喜若狂。\n當它達到ATH時，他高興了好一陣子。後來賣出了一些，在0.71美元買入DOGE，在3900美元買入ETH。\n$3900. 幾天前賣掉了。\n\n昨晚給我打電話，他看到BTC都漲了，很苦惱。\n\n我有點不確定如何處理這個問題。從未有...",
      "title": "與一個有自殺傾向的朋友一起度過了一個上午，他在ATH附近買入，在接近完美的低點賣出了他所有的加密貨幣。這就是加密貨幣的黑暗面。夥計們，讓我們互相照應吧。還有，不要冒超過你能承受的損失的風險。"
    }
  ]
}