{
  "author": "UnexperiencedIT",
  "original_created_utc": 1641818292,
  "title": "Cryptocurrencies will not \"kill\" fiat and people who think so are ignorant. But, Crypto and Fiat can coexist, and competitiveness in that financial world suits us all",
  "created_utc": 1641847257,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many &amp;quot;advocates&amp;quot; of cryptocurrencies often say that the revolution is coming to us and that cryptocurrencies will take down Fiat.  &lt;/p&gt;\n\n&lt;p&gt;Sometimes individuals remind us that the whole purpose of cryptocurrencies is that a decentralized financial system allows us freedom and independence from a third party as we conduct our transactions.  &lt;/p&gt;\n\n&lt;p&gt;But still crypto will never replace fiat fully.  &lt;/p&gt;\n\n&lt;p&gt;Crypto and Fiat will coexist.  &lt;/p&gt;\n\n&lt;p&gt;Fiat money has been used for longer and is accepted more globally then crypto, but crypto offers many advantages that fiat currencies do not have, especially when we talk about inflation and creating a fair financial system.  &lt;/p&gt;\n\n&lt;p&gt;Unlike gold that has gold in it and silver that has silver in it ,fiat as paper has worthless paper in it.&lt;/p&gt;\n\n&lt;p&gt;But the central government gives value to this paper and it exists only because the central government says that it has purchasing power.  Also, with the help of the central power, states preserve power, and thus peace with all manipulation that comes with it.  &lt;/p&gt;\n\n&lt;p&gt;It is precisely those states that will simply never hand over that power, but will jealously guard it, and whatever crypto does, fiat will historically still be there.  &lt;/p&gt;\n\n&lt;p&gt;Crypto will not replace Fiat, but with cryptocurrencies we get one strong alternative that we can use whenever we want, and banks will therefore have to change their business.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/s0j4bp/cryptocurrencies_will_not_kill_fiat_and_people/",
  "subreddit": "CryptoCurrency",
  "id": "s0j4bp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Many \"advocates\" of cryptocurrencies often say that the revolution is coming to\nus and that cryptocurrencies will take down Fiat.\n\nSometimes individuals remind us that the whole purpose of cryptocurrencies is\nthat a decentralized financial system allows us freedom and independence from a\nthird…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨の「擁護者」の多くは、しばしば「革命がやってくる」と言います。\n暗号通貨はフィアットを崩壊させるだろう。\n\n時々、個人は暗号通貨の全目的が以下の通りであることを思い出させてくれます。\n分散化された金融システムは、私たちに自由と独立を可能にすること。\n第三の...",
      "title": "暗号通貨はフィアットを「殺す」ことはできないし、そう考える人は無知です。しかし、クリプトとフィアットは共存でき、その金融の世界での競争力は私たちに合っています"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多加密货币的 \"倡导者 \"经常说，革命正在向我们走来。\n我们，并且加密货币将打倒菲亚特。\n\n有时个人会提醒我们，加密货币的整个目的是\n一个去中心化的金融系统允许我们自由和独立于第三方。\n第三...",
      "title": "加密货币不会 \"杀死 \"法币，这么想的人是无知的。但是，加密货币和法币可以共存，在这个金融世界中的竞争力适合我们所有人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多加密貨幣的 \"倡導者 \"經常說，革命正在向我們走來。\n我們，並且加密貨幣將打倒菲亞特。\n\n有時個人會提醒我們，加密貨幣的整個目的是\n一個去中心化的金融系統允許我們自由和獨立於第三方。\n第三...",
      "title": "加密貨幣不會 \"殺死 \"法幣，這麼想的人是無知的。但是，加密貨幣和法幣可以共存，在這個金融世界中的競爭力適合我們所有人"
    }
  ]
}