{
  "author": "shleebs",
  "the_new_excerpt": "I am tired of people defending Bill Gates and saying things like, \"Microsoft\nuses open source development and accepts crypto\" or \"He is looking out for small\ninvestors by warning them against volatility\". Microsoft is adopting these\nthings because their attacks against them failed. Where was Bill…",
  "original_created_utc": 1614464653,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经厌倦了人们为比尔-盖茨辩护，说诸如 \"微软。\n使用开源开发并接受加密 \"或 \"他在寻找小\n通过警告投资者注意波动性\"。微软正在采用这些\n因为他们对他们的攻击失败了 比尔在哪里...",
      "title": "停止为比尔-盖茨辩护。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經厭倦了人們爲比爾-蓋茨辯護，說諸如 \"微軟。\n使用開源開發並接受加密 \"或 \"他在尋找小\n通過警告投資者注意波動性\"。微軟正在採用這些\n因爲他們對他們的攻擊失敗了 比爾在哪裏...",
      "title": "停止爲比爾-蓋茨辯護。"
    }
  ],
  "title": "STOP DEFENDING BILL GATES",
  "created_utc": 1614483403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am tired of people defending Bill Gates and saying things like, &quot;Microsoft uses open source development and accepts crypto&quot; or &quot;He is looking out for small investors by warning them against volatility&quot;. Microsoft is adopting these things because their attacks against them failed. Where was Bill when small investors were getting wrecked in the stock market or losing their pensions? Where was his love for open source when Microsoft attacked open source licenses? Let&#39;s take a look at the history of Bill Gates and Microsoft regarding open source and crypto:</p>\n\n<ul>\n<li>1998 United States v. Microsoft was a set of civil actions filed against Microsoft Corporation by the United States Department of Justice and 20 U.S. states. The plaintiffs alleged that Microsoft abused monopoly power in its handling of operating system sales and web browser sales. Microsoft won their right to continue breaking the law.</li>\n<li>1998 leaked internal Microsoft documents state the following &quot;OSS [Open Source Software] poses a direct, short-term revenue and platform threat to Microsoft, particularly in server space. Additionally, the intrinsic parallelism and free idea exchange in OSS has benefits that are not replicable with our current licensing model and therefore present a long term developer mindshare threat.&quot;</li>\n<li>2001 Microsoft&#39;s Steve Ballmer is quoted as saying &quot;Linux is a cancer that attaches itself in an intellectual property sense to everything it touches&quot;</li>\n<li>2002, Microsoft applied for 1,411 patents.</li>\n<li>2003, Microsoft began licensing its patents to other companies in exchange for either royalties or access to their patents (a &quot;cross-licensing&quot; deal). Microsoft&#39;s lawyers began calculating how many of its patents were being infringed by free and open-source software.</li>\n<li>2004 Microsoft had more than doubled the number of patents, totaling 3,780.</li>\n<li>2004 Microsoft recruits Bill Hilf to build an open source lab where he and his cohorts would build Linux systems and test them in tandem machines running Windows software.</li>\n<li>2007 Licensing chief Horacio Gutierrez claimed the total number of patents allegedly violated by open source software was 235. Gutierrez is quoted as saying &quot;This is not a case of some accidental, unknowing infringement. There is an overwhelming number of patents being infringed.&quot;</li>\n<li>2007 Microsoft threatened to sue Linux based companies like Red Hat over patent violations.</li>\n<li>2008 Bill Gates said open source creates a license &quot;so that nobody can ever improve the software&quot;</li>\n<li>2008 Bill Gates outlined how open source development could work for Microsoft in a meeting with Sam Ramji (open source lead) and Ray Ozzie (lead developer).</li>\n<li>2008 Microsoft realized they couldn’t destroy or &quot;embrace and extend&quot; Linux. Microsoft adopts Linux benefits in fear of being left behind.</li>\n<li>2008 Microsoft purchases Powerset, one of the first companies to run a web service atop the open source project Hadoop.</li>\n<li>2009 Microsoft prototyped an Amazon-like cloud service under Sam Ramji using nothing but open source software such as Zend, OpenNebula, Eucalyptus, OpenScale and Hadoop.</li>\n<li>2009 Sam Ramji left Microsoft.</li>\n<li>2009 Microsoft sued GPS navigation device maker TomTom, arguing that the company’s Linux-based products violated a patent related to how operating systems handle file storage.</li>\n<li>2010 Microsoft releases open source project Azure</li>\n<li>2011 or earlier, Microsoft began threatening lawsuits against Android device manufacturers until they signed licensing agreements. Microsoft has never defended these patents in court. Rather than risk an expensive court battle, Android manufacturers pay Microsoft for a license.</li>\n<li>2011 Microsoft Windows announces ports for Node.js and Hadoop, both open source.</li>\n<li>2011 Microsoft contributes code to the open source project Samba.</li>\n<li>2012 Microsoft signed a patent deal with Amdocs covering its Linux use despite there never being any proof that Linux violates Microsoft&#39;s patents.</li>\n<li>2014 Microsoft CEO Satya Nadella is quoted as saying &quot;Microsoft loves Linux.&quot;</li>\n<li>2014 Microsoft adds Bitcoin to payment methods on Microsoft Accounts.</li>\n<li>2016 Microsoft releases open source .NET Core</li>\n<li>2017 In competition with Bitcoin, The Bill &amp; Melinda Gates Foundation released open-source software for creating payment platforms that will help unbanked people around the world access digital financial services.</li>\n<li>2018 Bill Gates on Bitcoin “As an asset class, you’re not producing anything and so you shouldn’t expect it to go up. It’s kind of a pure ‘greater fool theory’ type of investment. I agree I would short it if there was an easy way to do it”</li>\n<li>2020 Bill &amp; Melinda Gates Foundation asks Oxford to renege on their promise to open source a COVID-19 vaccine to drug makers.</li>\n<li>2021 Bill Gates on Bitcoin “The way cryptocurrency works today allows for certain criminal activities. It’d be good to get rid of that”</li>\n<li>2021 Bill Gates on Bitcoin “I don’t own bitcoin, I’m not short bitcoin, so I’ve taken a neutral view”</li>\n<li>2021 Bill Gates on Bitcoin &quot;Elon has tons of money and he’s very sophisticated, so I don’t worry that his bitcoin will sort of randomly go up or down. I do think people get bought into these manias who may not have as much money to spare. My general thought would be that if you have less money than Elon, you should probably watch out.&quot;</li>\n</ul>\n\n<p>If I missed anything let me know and I&#39;ll add it to the list maybe. </p>\n\n<p>TL;DR\nBill Gates does not have your best interests in mind.</p>\n\n<p>EDIT: For everyone pointing to Bill Gates and his philanthropy, I could do another full post about how corrupt his foundations are. He is taking resource rights away from local businesses in third-world countries and disenfranchising family owned farms. This is all paving the way for large corps to control and sell the resources of a country instead of the local population (all under the guise of feeding the world). If it was appropriate for me to post a timeline of this as well, I would. But this ain&#39;t the sub for it.</p>\n</div><!-- SC_ON -->",
  "score": 472,
  "permalink": "/r/Bitcoin/comments/ltytyj/stop_defending_bill_gates/",
  "subreddit": "Bitcoin",
  "id": "ltytyj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937732187
}