{
  "author": "relaxxed_",
  "original_created_utc": 1636899857,
  "title": "How is a Bitcoin upgrade being coordinated when Satoshi Nakamoto is not around?",
  "created_utc": 1636932649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was wondering this the other day and it might be a strange question but who is coordinating an upgrade to the Bitcoin network with the absence of Satoshi Nakamoto?</p>\n\n<p>We recently had a successful live upgrade of the Taproot protocol to Bitcoin for example. Taproot is an upgrade to the Bitcoin blockchain network which will preserve more privacy, efficiency, less fees and was the biggest upgrade done since 4 years.</p>\n\n<p>Who leads such a project or upgrade into the right corridors and plans the dates of these tasks to be executed successfully? This is somewhat still a mystery to me since I’m not sure how or by whom this is being done with the man or entity who built the Bitcoin blockchain in the first place not being around us at the moment.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/qtqu95/how_is_a_bitcoin_upgrade_being_coordinated_when/",
  "subreddit": "CryptoCurrency",
  "id": "qtqu95",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was wondering this the other day and it might be a strange question but who is\ncoordinating an upgrade to the Bitcoin network with the absence of Satoshi\nNakamoto?\n\nWe recently had a successful live upgrade of the Taproot protocol to Bitcoin for\nexample. Taproot is an upgrade to the Bitcoin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、不思議に思っていたのですが、変な質問かもしれませんが、サトシがいなくなったビットコインネットワークのアップグレードを誰が調整しているのでしょうか？\nサトシ・ナカモトが不在のビットコイン・ネットワークのアップグレードを誰が調整しているのか？\nナカモトが不在のとき、誰がビットコインネットワークのアップグレードを調整しているのでしょうか？\n\n例えば、最近、TaprootプロトコルのBitcoinへのライブアップグレードが成功しました。\n例を挙げてみましょう。Taprootは、Bitcoinへのアップグレード...",
      "title": "サトシ・ナカモトがいないときのビットコインのアップグレードはどのように調整されているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一天在想这个问题，这可能是一个奇怪的问题，但谁在协调比特币网络的升级？\n在中本聪缺席的情况下，谁在协调比特币网络的升级？\n中本聪不在了，谁在协调比特币网络的升级？\n\n例如，我们最近成功地将Taproot协议实时升级到比特币。\n例如。Taproot是对比特币的一种升级...",
      "title": "当中本聪不在身边时，如何协调比特币的升级？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一天在想這個問題，這可能是一個奇怪的問題，但誰在協調比特幣網絡的升級？\n在中本聰缺席的情況下，誰在協調比特幣網絡的升級？\n中本聰不在了，誰在協調比特幣網絡的升級？\n\n例如，我們最近成功地將Taproot協議實時升級到比特幣。\n例如。Taproot是對比特幣的一種升級...",
      "title": "當中本聰不在身邊時，如何協調比特幣的升級？"
    }
  ]
}