{
  "author": "RusticBohemian",
  "original_created_utc": 1628028233,
  "title": "Ancient Roman roads are useable 2,000 years after their creation. Our asphalt roads get replaced every 18-20 years. The Arkadiko bridge in Greece functions 3,100 after it was built. Modern bridges are designed to be replaced after 50 years. Why'd we stop building infrastructure that outlasts us?",
  "created_utc": 1628077040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Perhaps we have a survivorship bias skewing our perspective of past achievements, but it seems like very little infrastructure in the modern world gets built to last more than a single lifespan. On the other hand, you can visit dozens of cities in Europe where old buildings, roads, and water infrastructure from the classical and medieval periods are still perfectly functional (although they&#39;ve obviously been maintained).</p>\n\n<p>Was passing useful infrastructure on to future generations a goal of past building projects, or just a byproduct of the materials and technologies at hand? Would the builders and funders of these projects have take pride in creating something robust?</p>\n\n<p>At what point in history did we stop thinking about building infrastructure that lasts and switch to rapid replacement model? Why did this happen?</p>\n</div><!-- SC_ON -->",
  "score": 410,
  "permalink": "/r/AskHistorians/comments/oxe4ce/ancient_roman_roads_are_useable_2000_years_after/",
  "subreddit": "AskHistorians",
  "id": "oxe4ce",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Perhaps we have a survivorship bias skewing our perspective of past\nachievements, but it seems like very little infrastructure in the modern world\ngets built to last more than a single lifespan. On the other hand, you can visit\ndozens of cities in Europe where old buildings, roads, and water…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは、生存バイアスによって過去の業績に対する見方が偏っているのかもしれません。\n生存バイアスがかかっているのかもしれませんが、現代のインフラには\n現代のインフラは、一度の寿命を超えて構築されることはほとんどありません。その一方で、ヨーロッパの何十もの都市を訪れると\n一方で、ヨーロッパの何十もの都市を訪れると、古い建物、道路、水...",
      "title": "古代ローマ時代の道路が、誕生から2000年経っても使える。私たちのアスファルト道路は18〜20年で交換されます。ギリシャのアルカディコ橋は作ってから3100年経っても機能しています。現代の橋は50年で交換されるように設計されています。なぜ私たちは長持ちするインフラを作らなくなったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许我们有一种幸存者的偏见，使我们对过去的成就的看法有所偏差。\n但在现代世界中，似乎很少有基础设施被建造得超过一年。\n被建造得超过了单一的寿命。另一方面，你可以访问\n欧洲的几十个城市，那里的古老建筑、道路和水...",
      "title": "古罗马道路在创建2000年后仍可使用。我们的沥青路每隔18-20年就要更换一次。希腊的Arkadiko桥在建成3100年后还能使用。现代桥梁的设计是在50年后被替换。为什么我们停止建造比我们更长久的基础设施？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許我們有一種倖存者的偏見，使我們對過去的成就的看法有所偏差。\n但在現代世界中，似乎很少有基礎設施被建造得超過一年。\n被建造得超過了單一的壽命。另一方面，你可以訪問\n歐洲的幾十個城市，那裏的古老建築、道路和水...",
      "title": "古羅馬道路在創建2000年後仍可使用。我們的瀝青路每隔18-20年就要更換一次。希臘的Arkadiko橋在建成3100年後還能使用。現代橋樑的設計是在50年後被替換。爲什麼我們停止建造比我們更長久的基礎設施？"
    }
  ]
}