{
  "author": "step11234",
  "original_created_utc": 1631351713,
  "title": "Be prepared for a dump on Cardano tomorrow (or shortly after)",
  "created_utc": 1631359833,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As you may or may not know, Cardano (ADA) is launching smart contracts tomorrow after what seems like forever, which is great! I&#39;m very happy this is finally coming for all you ADA holders and speculators, I only hold a small amount but It&#39;s great to see progress on all the projects.</p>\n\n<p>However... The most likely scenario is that the news and launch smart contracts have already been priced in and will dump after the launch. This does not mean that ADA will not go up more in the future, but I do expect a dump for the next couple of days or even week followed by a slow rise to ATHs. Please be aware of this and DON&#39;T panic if the price drops heavily</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/pm4672/be_prepared_for_a_dump_on_cardano_tomorrow_or/",
  "subreddit": "CryptoCurrency",
  "id": "pm4672",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As you may or may not know, Cardano (ADA) is launching smart contracts tomorrow\nafter what seems like forever, which is great! I'm very happy this is finally\ncoming for all you ADA holders and speculators, I only hold a small amount but\nIt's great to see progress on all the projects.\n\nHowever... The…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知の方もそうでない方もいらっしゃると思いますが、Cardano(ADA)は明日スマートコントラクトを開始します。\nこれはとても素晴らしいことです。これは素晴らしいことです！ADAのホルダーや投機家の皆さんにとって、これがついに来ることをとても嬉しく思います。\n私は少量しか持っていませんが、すべてのADAホルダーと投機家のために、これがついに来たことをとても嬉しく思います。\nすべてのプロジェクトに進展が見られるのは素晴らしいことです。\n\nしかし... その...",
      "title": "明日（またはその直後）のカルダノのダンプに備えよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可能知道，也可能不知道，Cardano（ADA）明天将推出智能合约。\n这似乎是一个漫长的过程，这很好! 我很高兴这终于\n为所有ADA持有者和投机者而来，我只持有少量，但是\n看到所有项目的进展，这很好。\n\n然而... 我的朋友们...",
      "title": "准备好明天（或不久之后）对Cardano的倾销。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能知道，也可能不知道，Cardano（ADA）明天將推出智能合約。\n這似乎是一個漫長的過程，這很好! 我很高興這終於\n爲所有ADA持有者和投機者而來，我只持有少量，但是\n看到所有項目的進展，這很好。\n\n然而... 我的朋友們...",
      "title": "準備好明天（或不久之後）對Cardano的傾銷。"
    }
  ]
}