{
  "author": "Firestorm_001",
  "the_new_excerpt": "So, I bought the shares kind of cheap and this is my first time going through a\nbuy back or 100% redeeming of shares by the company. I want to know how the\nprocess takes place. Since I have the shares through TD, and this is a 100%\nredeem by the company, will this automatically take away my shares…",
  "original_created_utc": 1621331379,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの株を安く買いましたが、会社による自社株買いや100％償還を経験するのは初めてです。\n会社による株式の買い戻しや100％償還を受けるのは初めてです。このプロセスがどのように行われるのかを知りたい。\nプロセスがどのように行われるのか知りたい。私はTDを通じて株式を保有しており、これは会社による100%の償還である。\n株を持っていますが、これは会社による100％償還なので、自動的に私の株は...",
      "title": "ある株を持っているのですが、会社が100％償還することを決めました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我买的股票有点便宜，这是我第一次通过\n我是第一次通过公司的回购或100%赎回股份。我想知道这个过程是如何\n过程。由于我是通过道明公司购买的股票，而这是一个100%的\n赎回，这是否会自动带走我的股份？",
      "title": "我拥有一些股票，公司决定赎回100%的股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我買的股票有點便宜，這是我第一次通過\n我是第一次通過公司的回購或100%贖回股份。我想知道這個過程是如何\n過程。由於我是通過道明公司購買的股票，而這是一個100%的\n贖回，這是否會自動帶走我的股份？",
      "title": "我擁有一些股票，公司決定贖回100%的股票。"
    }
  ],
  "title": "I own some shares in a stock that the company decided to redeem 100% of the shares.",
  "created_utc": 1621371654,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I bought the shares kind of cheap and this is my first time going through a buy back or 100% redeeming of shares by the company.\nI want to know how the process takes place.\nSince I have the shares through TD, and this is a 100% redeem by the company, will this automatically take away my shares and corresponding share cost will be added to my account?</p>\n\n<p>Is there a formal procedure that I need to be a part of to ensure I get paid?</p>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/stocks/comments/nf6i80/i_own_some_shares_in_a_stock_that_the_company/",
  "subreddit": "stocks",
  "id": "nf6i80",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804459
}