{
  "author": "evolflush",
  "original_created_utc": 1642755425,
  "title": "What's happening right now? A quick explanation",
  "created_utc": 1642772370,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;What is going on right now?&lt;/h1&gt;\n\n&lt;p&gt;OK the price is low right now, prices have been falling and the whole market is fearful. Some people much smarter than me would say that this the time to buy, because this is when people get rich. Buy when there is blood on the street. Be greedy when others are fearful. That&amp;#39;s all good and well, but for the rest of us that are fully invested - what the hell is happening?&lt;/p&gt;\n\n&lt;h1&gt;The Fed&lt;/h1&gt;\n\n&lt;p&gt;The US federal reserve recently announced that they will begin hiking interest rates and tapering their purchases of securities - why does this affect cryptocurrencies? The current economic environment was one of extraordinary monetary policy. The money printer was on full throttle and interest rates were at near zero for a huge amount of time. What was the cost of this? inflation. Now that inflation is up, the money printer has to be shut off, and interest rates have to be hiked. This is bad news for companies with a lot of debt (like tech stocks with high future growth priced in). So traders, hedge funds, retail investors start cutting trades, and taking profit. Also to fund their safer bets they need to sell riskier assets... it&amp;#39;s a risk off environment. So risk is coming off, what is perceived as the riskiest asset out there? Cryptocurrencies. So we see trades unwind, as people panic. For context this is not just SCLP, or cryptocurrencies. At the time of writing NFLX is down 20%...&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/0xv9rhv890d81.png?width=1326&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=123fcb75d5657b94cc30fbd290db5a83629f5753\"&gt;Risk off&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The S&amp;amp;P has broken out of a long term channel ..&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/rb7fw46e90d81.png?width=2754&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=0063b1a820fe2912fc41de401eb4b663ceb86f9c\"&gt;Left chart is S&amp;amp;P - which defines risk in the market, bitcoin is a much smaller market and so follows in its wake.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;So what should I do?&lt;/h1&gt;\n\n&lt;p&gt;Ask yourself a few simple questions - what is my investment horizon? What is my long term view on cryptocurrencies, and my chosen projects?&lt;/p&gt;\n\n&lt;p&gt;You need to look for projects that are tangible. You need to look for projects that you believe in. If you are feeling a mental strain, perhaps this is your first foray into the crypto markets - I would suggest making sure your investments are not too much for you to mentally handle. If you feel you are too at risk, then rebalance into less risky assets. Buy some bonds, which will do well in the increased interest rate environment. Then take a walk, live your life. The markets are volatile, they go up and they go down, but fear won&amp;#39;t control the market forever. Think about why you invested in the space in the first place and ask yourself, has anything changed?&lt;/p&gt;\n\n&lt;h1&gt;We are in this together&lt;/h1&gt;\n\n&lt;p&gt;You are not alone. We will profit together, and people will think that the journey there was so easy - but we have to suffer to get there, which is something that the everyday person doesn&amp;#39;t get. The pain we had to face along the way. It&amp;#39;s a tale as old as crypto. Stay strong!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 357,
  "permalink": "/r/CryptoCurrency/comments/s96hlv/whats_happening_right_now_a_quick_explanation/",
  "subreddit": "CryptoCurrency",
  "id": "s96hlv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "WHAT IS GOING ON RIGHT NOW?\n\nOK the price is low right now, prices have been falling and the whole market is\nfearful. Some people much smarter than me would say that this the time to buy,\nbecause this is when people get rich. Buy when there is blood on the street. Be\ngreedy when others are fearful.…"
}