{
  "author": "TrueSpins",
  "original_created_utc": 1636456677,
  "title": "No, of course crypto is not a safe investment. One day it will be, but when that time comes you will definitely have missed the boat.",
  "created_utc": 1636486656,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We still see so many posts asking things like &quot;is crypto a safe investment&quot; or &quot;is it safe for me to invest my inheritance in crypto&quot; and the answer is - NO, YOU MANIAC!</p>\n\n<p>How can we make this any clearer - <strong>of course crypto isn&#39;t a safe investment. It&#39;s a mindbogglingly stupid investment if you&#39;re purely concerned with risk. I can think of no investment that would be more risky than crypto.</strong></p>\n\n<p>But that&#39;s why we love it!</p>\n\n<p>Honestly, if anyone in authority ever tells you that crypto is a good and safe investment, you have missed your chance. These are the last words you want to hear at the moment - it&#39;s the equivalent of a game over screen!</p>\n\n<p>To make real money in this world requires risk. Where there is no risk there is no money.</p>\n\n<p>This isn&#39;t to encourage people to FOMO into crypto when they can&#39;t afford to - but to understand that to be successful with crypto you have to accept the danger and embrace it. It&#39;s not safe, it&#39;s bloody dangerous  - even with a good plan in place.</p>\n\n<p>But that&#39;s the attraction!</p>\n\n<p>So stop trying to rationalise it or give yourself a false sense of security. Investing in crypto is terrifying, and you need to accept that.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/CryptoCurrency/comments/qq1j75/no_of_course_crypto_is_not_a_safe_investment_one/",
  "subreddit": "CryptoCurrency",
  "id": "qq1j75",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We still see so many posts asking things like \"is crypto a safe investment\" or\n\"is it safe for me to invest my inheritance in crypto\" and the answer is - NO,\nYOU MANIAC!\n\nHow can we make this any clearer - of course crypto isn't a safe investment.\nIt's a mindbogglingly stupid investment if you're…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "未だに「暗号は安全な投資ですか」とか「暗号に相続財産を投資しても大丈夫ですか」というような投稿をよく見かけます。\n相続財産を暗号に投資するのは安全か」といった投稿を目にしますが、答えは「NO」です。\nYOU MANIAC!\n\nもちろん、cryptoは安全な投資ではありませんが、これ以上明確にすることはできません。\nもしあなたが...ということであれば、それは気が遠くなるほど愚かな投資です。",
      "title": "いや、もちろん暗号は安全な投資ではありません。いつかはそうなるでしょうが、その時が来たら、あなたは間違いなく船に乗り遅れているでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们仍然看到有很多帖子在问 \"加密货币是一项安全的投资 \"或\n\"我把我的遗产投资于加密货币是否安全\"，答案是--不。\n你这个疯子!\n\n我们怎么能让这个问题更清楚呢--加密货币当然不是一项安全的投资。\n这是一个令人费解的愚蠢投资，如果你是...",
      "title": "不，加密货币当然不是一种安全的投资。有一天它会成为安全的，但当那个时候到来时，你肯定会错过时机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們仍然看到有很多帖子在問 \"加密貨幣是一項安全的投資 \"或\n\"我把我的遺產投資於加密貨幣是否安全\"，答案是--不。\n你這個瘋子!\n\n我們怎麼能讓這個問題更清楚呢--加密貨幣當然不是一項安全的投資。\n這是一個令人費解的愚蠢投資，如果你是...",
      "title": "不，加密貨幣當然不是一種安全的投資。有一天它會成爲安全的，但當那個時候到來時，你肯定會錯過時機。"
    }
  ]
}