{
  "author": "Kemba4Heisman",
  "the_new_excerpt": "Seen some popular posts/ sentiment around here about how it’s important to hold\nlots of different coins for diversification! A big problem with that thesis -\ntrue diversification is the accumulation of assets who’s returns are not well\ncorrelated with one another, I.e stocks and bonds, growth stocks…",
  "original_created_utc": 1619370634,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "分散投資のためにいろいろなコインを持つことが重要だという記事や意見がここではよく見られます。\n分散のためにたくさんの異なるコインを保有することが重要であるという人気のある投稿/感情があります この仮説には大きな問題があります。\n真の分散とは、株式と債券、成長株などのように、リターンが互いにあまり相関していない資産を蓄積することです。\n例えば、株式と債券、成長株などです。",
      "title": "PSA：暗号の中で「分散」することはほぼ不可能です"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这里看到了一些流行的帖子/情绪，关于如何持有\n币的重要性。这个论点有一个很大的问题--\n真正的分散投资是指资产的积累，而这些资产的收益并不是很相关的。\n互相关联的资产，如股票和债券、成长型股票......。",
      "title": "PSA：几乎不可能在加密货币中实现 \"多样化\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這裏看到了一些流行的帖子/情緒，關於如何持有\n幣的重要性。這個論點有一個很大的問題--\n真正的分散投資是指資產的積累，而這些資產的收益並不是很相關的。\n互相關聯的資產，如股票和債券、成長型股票......。",
      "title": "PSA：幾乎不可能在加密貨幣中實現 \"多樣化\"。"
    }
  ],
  "title": "PSA: it’s nearly impossible to “diversify” within crypto",
  "created_utc": 1619412585,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seen some popular posts/ sentiment around here about how it’s important to hold lots of different coins for diversification! A big problem with that thesis - true diversification is the accumulation of assets who’s returns are not well correlated with one another, I.e stocks and bonds, growth stocks and value stocks, real estate, equities from different segments of e global economy etc. </p>\n\n<p>Crypto is a great way to diversify your portfolio if you hold lots of the other asset classes- but if you already hold a ton of crypto, buying different kinds of coins isn’t diversifying- you’re just exposing yourself to the same underlying market dynamics via multiple assets. </p>\n\n<p>The way I view altcoins is essentially as a way to expose yourself to more volatility within the crypto space- you are subject to the same market forces as BTC but with a much higher beta and therefore the potential for greater returns (or losses obviously).</p>\n\n<p>The same is obviously true for folks that want to hold crypto and then also invest in stocks that derive their value from crypto like coin base, Riot etc...</p>\n\n<p>Any who good luck and happy mooning!</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/mycne2/psa_its_nearly_impossible_to_diversify_within/",
  "subreddit": "CryptoCurrency",
  "id": "mycne2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210456
}