{
  "author": "AlreadyLiberated",
  "the_new_excerpt": "We get it, there has been a massive influx of newbies lately. Guess what, there\nwill be more and more over the next few months. In the coming months, the number\nof new members will go as parabolic as the Bitcoin price in November-December of\n2017.\n\nCoinbase just hit #1 app in the Apple store. We may…",
  "original_created_utc": 1620824164,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、初心者が大量に押し寄せてきていますね。何と言っても\nこれから数ヶ月の間にもっともっと増えていくでしょう。今後数ヶ月の間に、新メンバーの数は\n新しいメンバーの数は、2017年の11月から12月のビットコイン価格のように放物線を描くでしょう。\n2017.\n\nコインベースはアップルストアのアプリで1位になったばかりだ。我々は、もしかしたら...",
      "title": "今年は500万人の会員数を達成します。積極的に新人を歓迎し、自分もかつてそうだったことを思い出してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们明白，最近有大量的新手涌入。你猜怎么着？\n在接下来的几个月里会越来越多。在未来几个月里，新成员的数量\n新成员的数量将像2017年11月至12月的比特币价格一样呈抛物线上升。\n2017.\n\nCoinbase刚刚在苹果商店的应用程序中排名第一。我们可能...",
      "title": "我们今年将达到500万会员。积极欢迎新手，并记住你曾经也是新手。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們明白，最近有大量的新手湧入。你猜怎麼着？\n在接下來的幾個月裏會越來越多。在未來幾個月裏，新成員的數量\n新成員的數量將像2017年11月至12月的比特幣價格一樣呈拋物線上升。\n2017.\n\nCoinbase剛剛在蘋果商店的應用程序中排名第一。我們可能...",
      "title": "我們今年將達到500萬會員。積極歡迎新手，並記住你曾經也是新手。"
    }
  ],
  "title": "We will hit 5 million members this year. Aggressively welcome newbies and remember that you were once one, too.",
  "created_utc": 1620842601,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We get it, there has been a massive influx of newbies lately. Guess what, there will be more and more over the next few months. In the coming months, the number of new members will go as parabolic as the Bitcoin price in November-December of 2017. </p>\n\n<p>Coinbase just hit #1 app in the Apple store. We may well be in for a huge summer/fall of gains and notoriety. The media lives stories about Reddit communities. </p>\n\n<p>This sub will hit 5 million members by fall. You think things have been crazy? Just wait. </p>\n\n<p>Welcome them, keep up the great educational posts, keep linking to ELI5 posts. We all want to make money, sure, and the more people who are welcomed into crypto, the more we will all make. </p>\n\n<p>But even more important: many of us truly believe that in 10 years crypto and blockchain will have the importance of the internet itself. This sub can be THE place where that future is discussed, cheered on, mourned when things go bad, and celebrated when we see a bit of that history being made. </p>\n\n<p>There are going to be lots of crummy posts, sure, lots of “Wen Moon” and “Do you think the price of Kitty-Safe-Coin can hit $50.” The mods do a great job filtering these, and their job will get harder. Instead of ripping these posts, downvote and move on to creating more excellent content. </p>\n\n<p>Let’s keep it awesome around here and make room for all the new folks who are eager to learn. ❤️</p>\n</div><!-- SC_ON -->",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/nao08g/we_will_hit_5_million_members_this_year/",
  "subreddit": "CryptoCurrency",
  "id": "nao08g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993623
}