{
  "author": "ackchanticleer",
  "original_created_utc": 1647176569,
  "title": "(Honest question not meant to be political) Why does Donald Trump out of all people have such a die hard following???",
  "created_utc": 1647182954,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I loved Obama but a simple bumper sticker on my car was enough for me. Yet a lot of Trump supporters are flat out fanatics. Even my aunt has a framed photo of him and her husband got her that Trump book for Christmas… The only way I would have a framed photo of Obama was if it was autographed. Yet the hardcore Trump supporters are like how I was when I was 12 and had pictures of ‘New Kids On The Block’ all over my wall…. I just don’t get it&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/NoStupidQuestions/comments/td6hfn/honest_question_not_meant_to_be_political_why/",
  "subreddit": "NoStupidQuestions",
  "id": "td6hfn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I loved Obama but a simple bumper sticker on my car was enough for me. Yet a lot\nof Trump supporters are flat out fanatics. Even my aunt has a framed photo of\nhim and her husband got her that Trump book for Christmas… The only way I would\nhave a framed photo of Obama was if it was autographed. Yet…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オバマは好きだったが、車に貼るバンパーステッカーだけで十分だった。しかし、多くの人が\nのトランプ支持者は、平たく言えば狂信者です。私の叔母でさえ、額縁に入れた写真を持っています。\nクリスマスには夫がトランプの本をプレゼントしてくれました。\nオバマの写真を額装して持っているのは、サイン入りの場合だけです。でも...",
      "title": "(政治的な意味ではなく、正直な質問です）なぜ、よりによってドナルド・トランプがこれほどまでに熱烈な支持を得ているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢奥巴马，但对我来说，在我的车上贴一张简单的保险杠贴纸就足够了。然而，很多\n特朗普的支持者都是纯粹的狂热分子。甚至我的姨妈也有一张裱好的他的照片。\n她的丈夫在圣诞节给她买了那本特朗普的书......我唯一的办法是\n的唯一方法就是拥有奥巴马的相框照片，如果它是亲笔签名的。然而...",
      "title": "(诚实的问题，并不意味着是政治性的)为什么唐纳德-特朗普在所有的人中有如此顽固的追随者？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡奧巴馬，但對我來說，在我的車上貼一張簡單的保險槓貼紙就足夠了。然而，很多\n特朗普的支持者都是純粹的狂熱分子。甚至我的姨媽也有一張裱好的他的照片。\n她的丈夫在聖誕節給她買了那本特朗普的書......我唯一的辦法是\n的唯一方法就是擁有奧巴馬的相框照片，如果它是親筆簽名的。然而...",
      "title": "(誠實的問題，並不意味着是政治性的)爲什麼唐納德-特朗普在所有的人中有如此頑固的追隨者？"
    }
  ]
}