{
  "author": "Icookadaspaget",
  "original_created_utc": 1657367717,
  "title": "If men are paid more than women, why don't employers hire solely women to increase profits?",
  "created_utc": 1657374367,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If I was a money-hungry capitalist bourgeois business owner, and I knew I could get away with paying women 73 cents to every dollar I would have to pay men, I would solely hire women. I mean that&amp;#39;s over a dollar saved an hour every four wage slaves.&lt;/p&gt;\n\n&lt;p&gt;So why do they not do this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 179,
  "permalink": "/r/NoStupidQuestions/comments/vv0315/if_men_are_paid_more_than_women_why_dont/",
  "subreddit": "NoStupidQuestions",
  "id": "vv0315",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If I was a money-hungry capitalist bourgeois business owner, and I knew I could\nget away with paying women 73 cents to every dollar I would have to pay men, I\nwould solely hire women. I mean that's over a dollar saved an hour every four\nwage slaves.\n\nSo why do they not do this?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし私が金満資本主義ブルジョア経営者だったら、そして私ができると知っていたら\n男性に払うべき1ドルに対して女性に払うべき73セントで済むと知ったら\n女性だけを雇うでしょう。つまり、1時間あたり1ドル以上節約できるのです。\n節約できるのです。\n\nでは、なぜ彼らはこれをしないのでしょうか？",
      "title": "男性の方が女性より給料が高いなら、なぜ雇用主は利益向上のために女性だけを雇わないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我是一个贪财的资本主义资产阶级企业主，而我知道我可以\n如果我是一个贪婪的资本主义资产阶级企业主，而且我知道我可以用73美分支付给女性，而我必须支付给男性，那么我就会只雇用女性。\n我将只雇用妇女。我的意思是，每四个工资奴隶每小时就能节省一美元以上。\n工资的奴隶。\n\n那么，为什么他们不这样做呢？",
      "title": "如果男性的工资比女性高，为什么雇主不只雇用女性来增加利润？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我是一個貪財的資本主義資產階級企業主，而我知道我可以\n如果我是一個貪婪的資本主義資產階級企業主，而且我知道我可以用73美分支付給女性，而我必須支付給男性，那麼我就會只僱用女性。\n我將只僱用婦女。我的意思是，每四個工資奴隸每小時就能節省一美元以上。\n工資的奴隸。\n\n那麼，爲什麼他們不這樣做呢？",
      "title": "如果男性的工資比女性高，爲什麼僱主不只僱用女性來增加利潤？"
    }
  ]
}