{
  "author": "xerxxxx",
  "the_new_excerpt": "I apologize in advance for the length (twss), but there is a lot to cover here\nand I’ve tried to be as thorough as possible.\n\nI’ve noticed a lot of folks on this sub asking about crypto-lending platforms\nand what they should consider before abandoning their APY-challenged,\ntraditional savings…",
  "original_created_utc": 1619998903,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "長くて申し訳ないのですが、ここにはカバーすべきことがたくさんあります。\nできる限り丁寧に説明したいと思っています。\n\nこのサブサイトでは、多くの人がcrypto-lendingプラットフォームについて質問していることに気づきました。\nそして、APYの低い伝統的な貯蓄を放棄する前に何を考慮すべきかを尋ねています。\n従来の貯蓄...",
      "title": "安定した高いAPYのために銀行口座を捨てると、こんなリスクがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我提前对其长度表示歉意（twss），但这里有很多内容需要涉及\n而且我已经尽量做到彻底。\n\n我注意到很多人在这个分论坛上询问加密货币贷款平台的情况\n以及他们在放弃他们的APY-挑战之前应该考虑什么。\n传统的储蓄...",
      "title": "为了高额的稳定币年利率而放弃银行账户时，有以下风险"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我提前對其長度表示歉意（twss），但這裏有很多內容需要涉及\n而且我已經儘量做到徹底。\n\n我注意到很多人在這個分論壇上詢問加密貨幣貸款平臺的情況\n以及他們在放棄他們的APY-挑戰之前應該考慮什麼。\n傳統的儲蓄...",
      "title": "爲了高額的穩定幣年利率而放棄銀行賬戶時，有以下風險"
    }
  ],
  "title": "These are the risks when ditching your bank account for high stablecoin APYs",
  "created_utc": 1620013133,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I apologize in advance for the length (twss), but there is a lot to cover here and I’ve tried to be as thorough as possible.</p>\n\n<p>I’ve noticed a lot of folks on this sub asking about crypto-lending platforms and what they should consider before abandoning their APY-challenged, traditional savings accounts and parking all of their money in stablecoin via BlockFi, Nexo, Celsius, Voyager or others. I thought it would be valuable to go over what I think are the most significant risks involved with this approach and thus what people should be thinking about before making the switch and going all-in. This is by no means an exhaustive list, but I do think these are the most material risks. I’ve also included some risk mitigation techniques that I am actively using in hopes that others will find them useful as well.</p>\n\n<p><strong>Counterparty risk/risk of default</strong></p>\n\n<p>The reason interest rates are so high on these platforms is because your crypto is not sitting safely in cold storage, but rather is actively being loaned out. People often mistake the personal loans that they can take from these companies as the main type of lending that they do. That is not the case however, and most of these companies are actually loaning your crypto on a much bigger scale. This comes with considerable counterparty risk regardless of what the company has advertised as their LTV. The reality is that there is a non-zero risk of each company not being able to call back its loaned capital (your crypto). This risk is exacerbated by extreme market conditions or tail events which can lead to significant losses for the company. In these cases, it would be you and your crypto on the hook.</p>\n\n<p>A risk mitigation strategy that I practice is to spread my funds across multiple companies to avoid a total loss if one platform experiences issues with defaults. However, given that the risk intensifies with extreme market conditions, it’s possible that several companies could be impacted at once. Continuing to hold at least some funds in fiat further mitigates this risk.</p>\n\n<p><strong>Cyber risk</strong></p>\n\n<p>This is the risk of a hack to either your personal account or the platform itself. One broad mitigation technique is again to spread funds across multiple platforms to avoid a total loss if one of your accounts or one platform is hacked.</p>\n\n<p>Account hack: This risk is considerably greater than the same thing happening to your online bank for example, given that once crypto is gone, it’s gone. The mitigation of this risk in entirely in your hands, however. Recommended actions include using a different, non-public email address for each platform that you use, setting strong, unique passwords for each account, enabling 2FA through an app rather than via SMS, and whitelisting addresses where available.</p>\n\n<p>Platform hack: Unlike account hacks, this risk is generally totally out of your control. There have been hacks to platforms in the past with significant losses and there will be hacks again in the future. Although this does not eliminate the risk, it is important to use only companies that you consider trustworthy and that demonstrate their concern for cybersecurity. While requiring that the company has some sort of insurance coverage is a good strategy, keep in mind that in the event of an extreme loss of assets, it is unlikely that their insurance coverage would even come close to making you whole.</p>\n\n<p>One broad mitigation technique for both types of hacks is again to spread funds across multiple platforms to avoid a total loss if one of your accounts or one platform is hacked.</p>\n\n<p><strong>&quot;Stablecoin risk&quot;</strong></p>\n\n<p>The question regarding these platforms is often, “Why shouldn’t I put all my savings in stablecoin on &lt;insert platform&gt; and earn 8.5% APY?” Setting aside the first two risks, there is also the risk that stablecoins are USD pegged, but they still aren’t USD. Without going into too much detail here (because you could write a whole post comparing/contrasting stablecoins and each one’s actual stability) what it essentially comes down to is that the value of these stablecoins depends entirely on the adequacy of their reserves and whether they are fully-backed and always-exchangeable for actual USD. Let’s call it the USD-standard. While most are audited, there still exists a non-zero risk that the USD-standard fails either through insolvency, fraud or something else. Obviously your funds held in stablecoin are not insured by any government backed insurance programs, so any risk event leading to those stablecoins not being as stable as advertised would fall on you. A mitigation technique that I practice here is to not hold all of my funds in one specific stablecoin, but rather spread out across USDC, GUSD, BUSD to avoid a total loss given an issue with one of them.</p>\n\n<p><strong>Investment/FX risks</strong></p>\n\n<p>We can call this an honorable mention since, in comparison to the first three, its high frequency/low severity nature and ability to be mitigated or avoided entirely make it less significant. Not only that, but there are scenarios where these risks yield favorable outcomes. First of all, by investment risk I’m referring to the option that many platforms have of receiving flex interest or interest not in-kind. You deposit stablecoin and they pay you interest in Bitcoin. There is clear investment risk here as a receiving your interest payments in a volatile asset could negate your gains and could leave you even worse off than the 0.5% APY your bank offered. In terms of FX risk, this impacts a lot of folks outside of the US whose options for stablecoins are almost exclusively USD pegged. Unfavorable movements in the FX rate between your native currency and USD could result in both your capital and interest payments being worth less to you than initial deposit.</p>\n\n<p>Mitigating/avoiding the first is relatively straightforward here. Either earn your interest-in-kind or in assets you believe have upside while knowing that you are taking a risk. In terms of FX, this is harder to mitigate if using USD stablecoin is what’s required to participate. However, you may be offsetting some currency risk to begin with by diversifying your savings across more than just your native currency.</p>\n</div><!-- SC_ON -->",
  "score": 859,
  "permalink": "/r/CryptoCurrency/comments/n3iya8/these_are_the_risks_when_ditching_your_bank/",
  "subreddit": "CryptoCurrency",
  "id": "n3iya8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380962702
}