{
  "author": "ipetgoat1984",
  "original_created_utc": 1647537991,
  "title": "This APE fiasco is just about getting the founders rich.",
  "created_utc": 1647549251,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is such a blatant money grab; it&amp;#39;s baffling that people are buying into it. So many examples of this have been done before, including but not limited to Safemoon, etc. APE is a group of opportunists and marketing experts taking advantage of the hype to make rich people richer.&lt;/p&gt;\n\n&lt;p&gt;Owners of Bored Ape NFTs were given the coin first(very rich people), then it was sold to the normies who got FOMO and pumped the price, then it crashed. Yet again, leaving regular people holding bags of pure garbage while the coin pushers wave bye-bye from their lambos.&lt;/p&gt;\n\n&lt;p&gt;I hope no one falls into this trap and makes noise about how obvious this all is. Rant over.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 750,
  "permalink": "/r/CryptoCurrency/comments/tgff80/this_ape_fiasco_is_just_about_getting_the/",
  "subreddit": "CryptoCurrency",
  "id": "tgff80",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is such a blatant money grab; it's baffling that people are buying into it.\nSo many examples of this have been done before, including but not limited to\nSafemoon, etc. APE is a group of opportunists and marketing experts taking\nadvantage of the hype to make rich people richer.\n\nOwners of Bored…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんなあからさまな金儲けがあるのか、それを信じている人がいることが不思議でならない。\nこのような例は、以前からたくさんあります。\nセイフムーンなど APEはご都合主義者とマーケティングの専門家の集まりで\n金持ちをより金持ちにするための誇大広告に便乗している。\n\nBoredのオーナー...",
      "title": "今回のAPE騒動は、創業者が金持ちになるためだけのものだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一种公然的抢钱行为；人们对其深信不疑，真是令人费解。\n以前有很多这样的例子，包括但不限于\nSafemoon，等等。APE是一群机会主义者和营销专家在利用\nAPE是一群机会主义者和营销专家，利用炒作使有钱人更有钱。\n\n无聊的业主们...",
      "title": "这个APE的惨败只是为了让创始人致富。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一種公然的搶錢行爲；人們對其深信不疑，真是令人費解。\n以前有很多這樣的例子，包括但不限於\nSafemoon，等等。APE是一羣機會主義者和營銷專家在利用\nAPE是一羣機會主義者和營銷專家，利用炒作使有錢人更有錢。\n\n無聊的業主們...",
      "title": "這個APE的慘敗只是爲了讓創始人致富。"
    }
  ]
}