{
  "author": "Kayters",
  "the_new_excerpt": "I often hear people saying stuff like \"just invest in the S&P 500 and forget\nabout it. you're never going to beat it anyway\" (especially in r/investing\n[/r/investing]), and I find it quite sad sometimes. I know that most people are\nprobably just saying it because they don't want anyone to lose…",
  "original_created_utc": 1612623943,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我经常听到有人说：\"只要投资标普500指数就可以了，忘记了。\n反正你永远也打不过它\"（特别是在R/investing中\n[/r/investing]），有时候我觉得挺悲哀的。我知道，大多数人都是\n可能只是说，因为他们不希望任何人失去... ...",
      "title": "你不厌烦别人说 \"投资标普500就好 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常聽到有人說：\"只要投資標普500指數就可以了，忘記了。\n反正你永遠也打不過它\"（特別是在R/investing中\n[/r/investing]），有時候我覺得挺悲哀的。我知道，大多數人都是\n可能只是說，因爲他們不希望任何人失去... ...",
      "title": "你不厭煩別人說 \"投資標普500就好 \"嗎？"
    }
  ],
  "title": "Aren't you tired of people saying \"just invest in the S&P 500\"?",
  "created_utc": 1612640243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I often hear people saying stuff like &quot;just invest in the S&amp;P 500 and forget about it. you&#39;re never going to beat it anyway&quot; (especially in <a href=\"/r/investing\">r/investing</a>), and I find it quite sad sometimes. I know that most people are probably just saying it because they don&#39;t want anyone to lose money, and it&#39;s true that most people will be better off just by investing in the S&amp;P 500. If my mother wanted to invest, I&#39;d probably tell her the same thing, so I get it. But not anyone is like that, and I&#39;d like to see more encouragement in trying stuff, instead of just saying &quot;just put your money in the S&amp;P 500 and don&#39;t even try&quot;.</p>\n\n<p>I&#39;m fairly new to investing, but I get great joy from investing and researching companies. Investing in the S&amp;P 500 would be very boring for me. And I&#39;m also doing very well so far. I don&#39;t have a long track record at the moment obviously, since I&#39;ve been investing for only 2 years. So far, I&#39;ve always beat the S&amp;P 500 by a long margin . I know 2 years is not much, but hopefully I can continue doing great in the long run.</p>\n\n<p>I also want to be clear about the fact that I don&#39;t do day trading or any of this stuff. I&#39;m sure I wouldn&#39;t be able to beat the S&amp;P 500 if I did that.</p>\n\n<p>My tactic is very simple: I buy great stocks and I hold. I never panic sell. And when things go badly and maybe some stocks go down 20%, that&#39;s when I buy more, because I still believe in my companies. I&#39;ve managed to cut out all of the emotions and it served me very well so far.</p>\n\n<p>I know that many people don&#39;t beat the S&amp;P 500 in the long run, but it&#39;s also true that the statistic is also full of people that do day trading or that simply panic sell every 6 months, right?</p>\n\n<p>So I&#39;m also curious to hear from people that have invested far longer than me; how&#39;s it going for you?</p>\n\n<p>Also, one more thing: funnily enough, 99% of the people that say to simply invest in the S&amp;P 500, are not even doing it themselves, and they&#39;re actually buying lots of individual stocks... and making lots of money. Isn&#39;t that ironic?</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/ldzbms/arent_you_tired_of_people_saying_just_invest_in/",
  "subreddit": "stocks",
  "id": "ldzbms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201980
}