{
  "author": "ZombieSurvivor365",
  "the_new_excerpt": "First off, I want to start this post by saying that moons are great, but I don’t\nlike the method of distribution.\n\nFrom what I understand, you get moons from upvoting. Moons cost money, so\ntherefore, upvoting = money. Although they don’t cost much, I’ve seen what they\ncan do to people living in some…",
  "original_created_utc": 1618984777,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に言いたいのは、「ムーンは素晴らしいが、配布方法が気に入らない」ということです。\n配布方法が好きではありません。\n\n私の理解では、ムーンはupvotingから得られます。ムーンはお金がかかるので\n投票＝お金ということになります。お金はかからないけど、住んでいる人がどうなるかは\n暮らしている人がどうなるかを見てきました。",
      "title": "ムーンもいいけど"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想在这篇文章的开头说，月亮很好，但我不喜欢\n喜欢这种分配方式。\n\n据我所知，你从投票中获得月球。月亮要花钱，所以\n因此，投票=金钱。虽然它们的成本不高，但我已经看到了它们对生活在某些地方的人的影响。\n对生活在某些地方的人的影响......",
      "title": "月亮很好，但是..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想在這篇文章的開頭說，月亮很好，但我不喜歡\n喜歡這種分配方式。\n\n據我所知，你從投票中獲得月球。月亮要花錢，所以\n因此，投票=金錢。雖然它們的成本不高，但我已經看到了它們對生活在某些地方的人的影響。\n對生活在某些地方的人的影響......",
      "title": "月亮很好，但是..."
    }
  ],
  "title": "Moons are great, but...",
  "created_utc": 1619005053,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off, I want to start this post by saying that moons are great, but I don’t like the method of distribution.</p>\n\n<p>From what I understand, you get moons from upvoting. Moons cost money, so therefore, upvoting = money. Although they don’t cost much, I’ve seen what they can do to people living in some of the more poorer countries. They’ve probably literally helped feed communities of people.</p>\n\n<p>With that being said, a lot of people are a whole lot more picky with who they give their upvote to. I’d say that this is nice because people take longer to consider what content is worth giving a moon to. It makes it so that only useful information and top-tier shitposts can get through this “moon-filter.”</p>\n\n<p>Or so I thought. Recently I’ve noticed that people have been <em>downvoting</em> in an attempt to choke the oh-so-precious moon-supply. </p>\n\n<p>Again, don’t get me wrong. Moons are incredible and life-changing. I like them, but other people around the world have a bigger and better need/use for them. So the fact that human greed is leading some people to try to choke the supply of moons is beyond absurd. </p>\n\n<p>I understand punishing an obvious karma-farming post with a downvote, but downvoting useful <em>information?</em> Again, absurd.</p>\n\n<p>With that being said, I feel as though moons should instead be based on awards. So now, ideas can get upvoted, and can be rewarded moons via actual awards. Feel free to add your ideas and opinions.</p>\n\n<p>tl;dr: Moons made people greedy enough to downvote useful information.</p>\n</div><!-- SC_ON -->",
  "score": 529,
  "permalink": "/r/CryptoCurrency/comments/mv9et0/moons_are_great_but/",
  "subreddit": "CryptoCurrency",
  "id": "mv9et0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523333
}