{
  "author": "n1ghsthade",
  "original_created_utc": 1651061164,
  "title": "If you read this, amazing! You are still in cryptocurrency.",
  "created_utc": 1651078784,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The market wears people down. Most of the retailers in the market have been leaving crypto, for now. Last approximate 1.5 years a lot of hype was present and a lot of retailers joined the party for quick gains. Now that the market topped at the last all time high, and we have been in an accumulation range for a long period, most people looking for gold have given up. Or they have been liquidated.&lt;/p&gt;\n\n&lt;p&gt;Throughout the, brief, history of bitcoin (and cryptocurrency in general) there have been multiple periods like the one we are in now. Historically, these periods were followed by new jumps of the market to new highs.&lt;/p&gt;\n\n&lt;p&gt;If you are reading this, you haven&amp;#39;t given up. Or at least you shouldn&amp;#39;t. Be careful now with any trades you make. There are roughly three things you could do. Hodl and wait. Sell most, if not all, wait for a definitive bottom and buy in after confirmation. Or wait to buy in when upper resistance levels have cleared and the markets are in a bull run again.&lt;/p&gt;\n\n&lt;p&gt;All of the above, I believe, will yield you good gains in coming 6-18 months. Not something I can guarantee obviously. But look at adoption, growth, technology emerging in the crypto industry. There is no doubt for me it will be used more than ever in the future.&lt;/p&gt;\n\n&lt;p&gt;Stay calm. Be patient. Being here puts you in a favorable position in comparison with most.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 334,
  "permalink": "/r/CryptoCurrency/comments/ud1zqr/if_you_read_this_amazing_you_are_still_in/",
  "subreddit": "CryptoCurrency",
  "id": "ud1zqr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The market wears people down. Most of the retailers in the market have been\nleaving crypto, for now. Last approximate 1.5 years a lot of hype was present\nand a lot of retailers joined the party for quick gains. Now that the market\ntopped at the last all time high, and we have been in an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場は人を疲弊させる。市場の小売業者のほとんどは\n暗号から離れました、今のところ。過去約1.5年間は、多くの誇大広告が行われ\n多くの小売業者が手っ取り早く利益を得るために参加しました。今、市場は\nこの間、市場は史上最高値を更新し、私たちは...",
      "title": "これを読んだ方は、スゴイ! まだ暗号通貨をやっているんですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "市场让人疲惫不堪。市场上的大多数零售商都已经\n离开了加密货币，目前是这样。在过去大约1.5年的时间里，出现了大量的炒作现象\n很多零售商为了快速收益加入了这个行列。现在，市场\n处于历史最高点，而我们一直处于一个 \"不稳定 \"的状态。",
      "title": "如果你读到了这篇文章，那就太神奇了! 你还在加密货币中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場讓人疲憊不堪。市場上的大多數零售商都已經\n離開了加密貨幣，目前是這樣。在過去大約1.5年的時間裏，出現了大量的炒作現象\n很多零售商爲了快速收益加入了這個行列。現在，市場\n處於歷史最高點，而我們一直處於一個 \"不穩定 \"的狀態。",
      "title": "如果你讀到了這篇文章，那就太神奇了! 你還在加密貨幣中。"
    }
  ]
}