{
  "author": "n1ghsthade",
  "original_created_utc": 1651061164,
  "title": "If you read this, amazing! You are still in cryptocurrency.",
  "created_utc": 1651078784,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The market wears people down. Most of the retailers in the market have been leaving crypto, for now. Last approximate 1.5 years a lot of hype was present and a lot of retailers joined the party for quick gains. Now that the market topped at the last all time high, and we have been in an accumulation range for a long period, most people looking for gold have given up. Or they have been liquidated.&lt;/p&gt;\n\n&lt;p&gt;Throughout the, brief, history of bitcoin (and cryptocurrency in general) there have been multiple periods like the one we are in now. Historically, these periods were followed by new jumps of the market to new highs.&lt;/p&gt;\n\n&lt;p&gt;If you are reading this, you haven&amp;#39;t given up. Or at least you shouldn&amp;#39;t. Be careful now with any trades you make. There are roughly three things you could do. Hodl and wait. Sell most, if not all, wait for a definitive bottom and buy in after confirmation. Or wait to buy in when upper resistance levels have cleared and the markets are in a bull run again.&lt;/p&gt;\n\n&lt;p&gt;All of the above, I believe, will yield you good gains in coming 6-18 months. Not something I can guarantee obviously. But look at adoption, growth, technology emerging in the crypto industry. There is no doubt for me it will be used more than ever in the future.&lt;/p&gt;\n\n&lt;p&gt;Stay calm. Be patient. Being here puts you in a favorable position in comparison with most.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 334,
  "permalink": "/r/CryptoCurrency/comments/ud1zqr/if_you_read_this_amazing_you_are_still_in/",
  "subreddit": "CryptoCurrency",
  "id": "ud1zqr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The market wears people down. Most of the retailers in the market have been\nleaving crypto, for now. Last approximate 1.5 years a lot of hype was present\nand a lot of retailers joined the party for quick gains. Now that the market\ntopped at the last all time high, and we have been in an…"
}