{
  "author": "PointlessThunk",
  "original_created_utc": 1640212330,
  "title": "Why are there still many people antivax?",
  "created_utc": 1640226252,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At this point, I just think of it like elementary school. We are all stuck in class because some students are misbehaving. We can&amp;#39;t leave the classroom until everyone is quiet. Unfortunately, we still have &lt;em&gt;those&lt;/em&gt; people in class. &lt;/p&gt;\n\n&lt;p&gt;In all seriousness, I want to know what kind of mindset those guys have that makes them avoid the vaccine. It&amp;#39;s &lt;strong&gt;free&lt;/strong&gt; (literally the only thing medical that I can think of that is free everywhere) helps reduce chances of getting sick or have worse conditions if gotten my a large margin, and accessible to most places. &lt;/p&gt;\n\n&lt;p&gt;So... why? Politics and paranoia is basically tin foil hat level of questionable intelligence but what else could there be?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 280,
  "permalink": "/r/TooAfraidToAsk/comments/rmgl5r/why_are_there_still_many_people_antivax/",
  "subreddit": "TooAfraidToAsk",
  "id": "rmgl5r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "At this point, I just think of it like elementary school. We are all stuck in\nclass because some students are misbehaving. We can't leave the classroom until\neveryone is quiet. Unfortunately, we still have those people in class.\n\nIn all seriousness, I want to know what kind of mindset those guys…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この時点では、小学生と同じように考えているだけです。この時点では、小学校のようなものだと思っています。\nというのも、一部の生徒が悪さをしているからです。教室から出られないのは\nを、静かにさせる。残念なことに、クラスにはまだそういう人たちがいるんです。\n\n真面目に言うと、あいつらがどういう考え方をしているのか知りたい...。",
      "title": "なぜ、いまだにアンチバックスが多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这一点上，我只是把它看作是小学。我们都被困在\n因为有些学生行为不端。我们不能离开教室，直到\n大家都安静下来。不幸的是，我们仍然有那些人在课堂上。\n\n说实在的，我想知道那些人是以什么样的心态...",
      "title": "为什么仍然有很多人反疫苗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這一點上，我只是把它看作是小學。我們都被困在\n因爲有些學生行爲不端。我們不能離開教室，直到\n大家都安靜下來。不幸的是，我們仍然有那些人在課堂上。\n\n說實在的，我想知道那些人是以什麼樣的心態...",
      "title": "爲什麼仍然有很多人反疫苗？"
    }
  ]
}