{
  "author": "disabledwantinglove",
  "the_new_excerpt": "Like, I don't want to lie to them and tell them I have some great, well-paying\njob and am in great health. I'm in poor health, and I live off of disability\nchecks because I cannot work. I don't look visibly disabled, like you'd never\nknow just looking at me that I have health problems, but...…",
  "original_created_utc": 1620060077,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、給料の高い素晴らしい仕事をしていて、健康だと嘘をつきたくないんです。\n私は健康ではありません。私は健康状態が悪く、働けないので障害者手帳で生活しています。\n働けないので障害者手帳で生活しています。私は目に見える障害があるようには見えません。\n見ただけでは健康上の問題があるとはわからないような、目に見える障害はありませんが、......",
      "title": "私は永久障害者であるため、無職である。でも... 私は孤独で、愛を求めています。どうすれば、真実を伝え、かつ哀れで無価値に見えないようなデートサイトのプロフィールを作ることができますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比如，我不想对他们撒谎，告诉他们我有一些伟大的、高收入的\n工作，健康状况很好。我的健康状况很差，而且我靠残疾支票生活，因为我不能工作。\n因为我不能工作。我看起来没有明显的残疾，好像你永远不会\n仅仅看着我就知道我有健康问题，但......",
      "title": "我是永久性残疾，因此没有工作。但是... 我很孤独，想要爱情。我怎样才能制作一个约会网站的简介，说出真相，但又不至于让我看起来很可悲和不值得信赖？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如，我不想對他們撒謊，告訴他們我有一些偉大的、高收入的\n工作，健康狀況很好。我的健康狀況很差，而且我靠殘疾支票生活，因爲我不能工作。\n因爲我不能工作。我看起來沒有明顯的殘疾，好像你永遠不會\n僅僅看着我就知道我有健康問題，但......",
      "title": "我是永久性殘疾，因此沒有工作。但是... 我很孤獨，想要愛情。我怎樣才能製作一個約會網站的簡介，說出真相，但又不至於讓我看起來很可悲和不值得信賴？"
    }
  ],
  "title": "I'm permanently disabled and am therefore unemployed. But... I'm lonely and want love. How can I make a dating site profile that tells the truth, yet doesn't make me look pathetic and undatable?",
  "created_utc": 1620076220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like, I don&#39;t want to lie to them and tell them I have some great, well-paying job and am in great health. I&#39;m in poor health, and I live off of disability checks because I cannot work. I don&#39;t look <em>visibly</em> disabled, like you&#39;d never know just looking at me that I have health problems, but... they&#39;re there. </p>\n\n<p>I want to be up front about this sort of thing. I wouldn&#39;t want a prospective girlfriend to expect that I&#39;m going to be able to contribute a bunch of money and stuff to our relationship, because I barely scrape by as is. But... I&#39;m so lonely. I want to find someone to love me. I know I&#39;m not exactly the most desirable bachelor in the world, but I figure that there must be <em>someone</em> out there for me... </p>\n\n<p>But I figure if I write &quot;I&#39;m disabled and unemployed&quot; on a dating site, they&#39;ll just immediately pass on me. What should I say to be honest about it, but also not look worthless and pathetic?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/n40rp6/im_permanently_disabled_and_am_therefore/",
  "subreddit": "NoStupidQuestions",
  "id": "n40rp6",
  "is_self": true,
  "media": null,
  "is_video": false
}