{
  "author": "VannguardAnon",
  "original_created_utc": 1627223513,
  "title": "I just got tipped in Crypto!",
  "created_utc": 1627234475,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>!</p>\n\n<p>I work at a bar, and yesterday (saturday), we had a customer with a ETH sticker on his bag. It was really slow for a saturday, so I ended up talking crypto with him for around 20 minutes, while he drank his beers.</p>\n\n<p>In the end, he asked me if he could tip me in crypto, I said yes, and he then sent me a very generous amount of XLM.</p>\n\n<p>It was very time-consuming, finding my XLM adress in coinbase, double checking it and everything. It would&#39;ve probably been easier to just recieve fiat, but it was a fun way to interact with crypto.</p>\n\n<p>The future is now!</p>\n\n<p>Edit: I get it! I couldve used the QR code for my wallet! I am dumb, okay?</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/orclxy/i_just_got_tipped_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "orclxy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey r/CryptoCurrency [/r/CryptoCurrency]!\n\nI work at a bar, and yesterday (saturday), we had a customer with a ETH sticker\non his bag. It was really slow for a saturday, so I ended up talking crypto with\nhim for around 20 minutes, while he drank his beers.\n\nIn the end, he asked me if he could tip me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Hey r/CryptoCurrency [/r/CryptoCurrency]!\n\n私はバーで働いているのですが、昨日（土曜日）、ETHのステッカーをバッグに貼ったお客さんがいました。\nをバッグに貼ったお客さんがいました。土曜にしては遅い時間だったので、20分くらい暗号の話をしてしまいました。\nビールを飲みながら、20分ほど暗号の話をしました。\n\n最後に、彼は私にチップをくれないかと言ってきました...。",
      "title": "Cryptoでチップをもらったところです!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，r/CryptoCurrency [/r/CryptoCurrency]!\n\n我在一家酒吧工作，昨天（星期六），我们有一个顾客在他的包上贴了一张ETH的标签\n在他的包上。在周六的时候真的很慢，所以我最后和他谈了20分钟的加密货币。\n他喝啤酒的时候，我和他聊了大约20分钟。\n\n最后，他问我是否可以给我小费......",
      "title": "我刚刚在Crypto得到了小费!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，r/CryptoCurrency [/r/CryptoCurrency]!\n\n我在一家酒吧工作，昨天（星期六），我們有一個顧客在他的包上貼了一張ETH的標籤\n在他的包上。在週六的時候真的很慢，所以我最後和他談了20分鐘的加密貨幣。\n他喝啤酒的時候，我和他聊了大約20分鐘。\n\n最後，他問我是否可以給我小費......",
      "title": "我剛剛在Crypto得到了小費!"
    }
  ]
}