{
  "author": "aidigvijay",
  "the_new_excerpt": "TL; DR - There is an underlying foodchain in our society. The things that you\nget are a product of where you are born. People on the top do not want you to\ngrow. Whenever something revolutionary like cryptocurrency is introduced in the\nsociety. It gets a lot of hate and rejection from the people on…",
  "original_created_utc": 1615112047,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL; DR - 我们的社会有一个潜在的食物链。你所做的事情\n得到的是你出生地的产物。上面的人不希望你\n增长。每当像加密货币这样革命性的东西出现在\n的社会。它得到了很多人的讨厌和排斥，在...",
      "title": "交易加密货币让我目睹了社会的真实面貌，其是丑陋和悲伤的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL; DR - 我們的社會有一個潛在的食物鏈。你所做的事情\n得到的是你出生地的產物。上面的人不希望你\n增長。每當像加密貨幣這樣革命性的東西出現在\n的社會。它得到了很多人的討厭和排斥，在...",
      "title": "交易加密貨幣讓我目睹了社會的真實面貌，其是醜陋和悲傷的。"
    }
  ],
  "title": "Trading Crypto made me witness the true face of society and its was ugly and sad",
  "created_utc": 1615136462,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL; DR - There is an underlying foodchain in our society. The things that you get are a product of where you are born. People on the top do not want you to grow. Whenever something revolutionary like cryptocurrency is introduced in the society. It gets a lot of hate and rejection from the people on the top because it gives common people a chance to attain a better life.</p>\n\n<p>When I started trading Bitcoin back in 2017, at that time the news media was very actively comparing it with a bubble and after its crash in the early 2018 I started believing the same.</p>\n\n<p>Later in Nov 2020 I again started trading Bitcoin and also came to know about DOGE and other altcoins. But this time I decided to learn more. I started reading news about crypto, the tech behind not just Bitcoin but other altcoins, I started studying the overall market trends from websites like coin gecko.</p>\n\n<p>While doing my research, I came to know that RBI (Reserve Bank of India) banned cryptocurrency back in 2018 which was later removed by the Supreme Court of India. Now again the Indian government is trying to ban all cryptocurrencies. The reason behind banning crypto was given that it could promote money laundering. </p>\n\n<p>I was like seriously. Are you kidding me? It was like banning internet because it could spread misinformation. Internet is a tool. People spread misinformation. Similarly cryptocurrency is a tool. How people use it, its up to them. Money laundering was happening before crypto and will happen after it. A common man does not have so much of money that he or she needs to launder it.</p>\n\n<p>Here, on reddit, there are stories of people who paid their home loan, student&#39;s loan, gifted their parents, paid their rents and much more just because of cryptocurrency. Let it be bitcoin or doge or nano, cryptocurrency is changing people&#39;s life. And not everyone is becoming a millionaire by trading crypto. People are earing just a little more than they used to and the government, financial institutions, rich business owners have a problem with it.</p>\n\n<p>It is so irritating and sad at the same time. If there are no life changing opportunities like cryptocurrency, then a common man&#39;s life will remain a struggle. Cryptocurrency offers a common man to live better, spend time with family, have a healthy life etc.</p>\n\n<p>We are not meant to spend 30-40 years of our life working in a cubical with no joy and no creativity. </p>\n\n<p>A common person, no matter how genius or strong, ends up working for a rich man or government. I hate this idea of society. </p>\n\n<p>I know that you already know all these things. Everyone knows but no one realizes how bad it is. I realized and I am angry after that. </p>\n\n<p>Thank you for reading.</p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/CryptoCurrency/comments/lznv8w/trading_crypto_made_me_witness_the_true_face_of/",
  "subreddit": "CryptoCurrency",
  "id": "lznv8w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542572116
}