{
  "author": "pale_blue_dots",
  "the_new_excerpt": "Such a perspective may be a fairly foreign concept and hard to grasp - myself\nincluded. Just saying/typing the words and thinking about it may create\nconfusion - which isn't surprising and... is expected, naturally.\n\nWe owe it to ourselves, our family and friends - and our conscientious,\nreasonable,…",
  "original_created_utc": 1608841981,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这样的观点可能是一个相当陌生的概念，很难把握--我自己\n包括在内。仅仅说/打单词，然后想一想，可能会创造出\n念力-这并不令人惊讶而且..。自然是意料之中的。\n\n我们欠我们自己，我们的家人和朋友--还有我们尽职尽责的，\n合理，…",
      "title": "不被强迫进入一个价值体系/货币体系-很像宗教-你不想成为其中的一部分，这在很大程度上就是区块链技术所代表的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這樣的觀點可能是一個相當陌生的概念，很難把握--我自己\n包括在內。僅僅說/打單詞，然後想一想，可能會創造出\n念力-這並不令人驚訝而且..。自然是意料之中的。\n\n我們欠我們自己，我們的家人和朋友--還有我們盡職盡責的，\n合理，…",
      "title": "不被強迫進入一個價值體系/貨幣體系-很像宗教-你不想成爲其中的一部分，這在很大程度上就是區塊鏈技術所代表的。"
    }
  ],
  "title": "To not be forced into a value system/monetary system - much like religion - that you do not want to be a part of is largely what blockchain technology represents.",
  "created_utc": 1608850223,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Such a perspective may be a fairly foreign concept and hard to grasp - myself included. Just saying/typing the words and thinking about it may create confusion - which isn&#39;t surprising and... is expected, naturally.</p>\n\n<p>We owe it to ourselves, our family and friends - and our conscientious, reasonable, rational selves - to fight for something like this.   </p>\n\n<p>We&#39;ve all been indoctrinated and steeped in the current monetary system - seeing outside of such a thing is very difficult and takes <em>effort</em> and <em>courage.</em> If anything, I think DLT is something like a window - a hatch that gives people the ability and means to <em>see</em> and <em>envision</em> a richer, wider, grander, more egalitarian world. </p>\n\n<p>There&#39;s a saying around/about religion that goes something like, <em>&quot;Religion is like living in a house and looking out a window - and then claiming the entire world and landscape and animalia is precisely and limited to what you see out that one window. Meanwhile, though, there are multiple other windows in the house with multiple other inhabitants who have different views and landscapes and animalia.&quot;</em> </p>\n\n<p>I&#39;m sure there are those out there who&#39;d mock this post&#39;s sentiment, but I&#39;d argue their point of view and vision to be myopic and unduly dismissive, among other reasons, by way of the role money/value plays in <em>all</em> people&#39;s lives - and how money and <em>value transfer</em> often forms personality, brain-physiology, and social circles. Indeed, it&#39;s often the very basis of the person we become.   </p>\n\n<p>When viewed through that perspective, it&#39;s both not surprising what we&#39;re seeing and is expected in terms of government reaction and &quot;traditionalist sentiment.&quot; If someone has time to really dig into the historical ramifications and goings-on related to the church and state in years past, there may be some important and salient things to learn.</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/CryptoCurrency/comments/kjmauh/to_not_be_forced_into_a_value_systemmonetary/",
  "subreddit": "CryptoCurrency",
  "id": "kjmauh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495331374
}