{
  "author": "Spielburger_witFries",
  "original_created_utc": 1653509279,
  "title": "What is your stance on spanking your kids?",
  "created_utc": 1653543659,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay, I don’t have children of my own, but I have had experiences when I was little. I was raised by a very loving single mother. She worked extremely hard, and even though we didn’t have much, she gave everything she had to my brother and I. Sometimes, we would misbehave (an example being running around and screaming in a store when we were about six), and after telling us to stop repeatedly, she would spank us. I don’t harbor any feelings about it, I don’t feel abused, I love her dearly. But whenever I mention this to someone they say “oh my god, that’s awful, you were clearly abused by her”. &lt;/p&gt;\n\n&lt;p&gt;I strongly disagree with that assumption. My whole family (both sides) did this to their kids up until the kids were more mature (maybe seven or so). It’s just how everyone was raised. Is this a problem?&lt;/p&gt;\n\n&lt;p&gt;I feel the need to add that my whole family is black, and when I mention the spanking thing to people of color, they share similar experiences and see no issue with it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/uxpw1a/what_is_your_stance_on_spanking_your_kids/",
  "subreddit": "TooAfraidToAsk",
  "id": "uxpw1a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Okay, I don’t have children of my own, but I have had experiences when I was\nlittle. I was raised by a very loving single mother. She worked extremely hard,\nand even though we didn’t have much, she gave everything she had to my brother\nand I. Sometimes, we would misbehave (an example being running…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、私は自分の子供がいないのですが、以前、自分の子供が\n小さい頃 私は、とても愛情深いシングルマザーに育てられました。彼女はとてもよく働きました。\n私たち兄弟にすべてを与えてくれました。\n時には悪さをすることもありましたが（たとえば走り回ること）。",
      "title": "子供を叱ることについては、どのようなスタンスで臨んでいるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我没有自己的孩子，但我有过这样的经历，当我是\n小时候。我是由一个非常有爱心的单身母亲抚养长大的。她工作非常努力。\n尽管我们没有多少钱，但她把自己的一切都给了我和弟弟。\n有时，我们会表现得很不乖（比如说跑......）。",
      "title": "你对打孩子的立场是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我沒有自己的孩子，但我有過這樣的經歷，當我是\n小時候。我是由一個非常有愛心的單身母親撫養長大的。她工作非常努力。\n儘管我們沒有多少錢，但她把自己的一切都給了我和弟弟。\n有時，我們會表現得很不乖（比如說跑......）。",
      "title": "你對打孩子的立場是什麼？"
    }
  ]
}