{
  "author": "Didgerydontt",
  "original_created_utc": 1627711306,
  "title": "Why do people say hello repeatedly?",
  "created_utc": 1627741767,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m autistic, and this is one behaviour that I really don&#39;t understand. I&#39;m on a work placement at the moment, for 10 weeks. The work environment means that you&#39;re constantly moving around a big lab, and bumping into the same people over and over.</p>\n\n<p>I will always say hi, good morning at the beginning of the day - obviously, this makes sense to me. But when we&#39;re all moving around the lab, every time I bump into people they will greet me again. Why? We already said hello, I know you&#39;re here! </p>\n\n<p>It&#39;s not in a funny &#39;we meet again lol&#39; way either. It&#39;s an earnest hello. It gets so exhausting for me because I can&#39;t just move around the space finding what I need, I have to constantly reply back to people. It&#39;s like walking through an assault course tbh, being in an unfamiliar space trying to concentrate and if you don&#39;t reply back to random greetings, you&#39;re rude.</p>\n\n<p>Another behaviour I really don&#39;t understand that keeps happening is the following exchange:</p>\n\n<p>I&#39;m approaching someone as we walk down a corridor from opposite ends.</p>\n\n<p>Person: hi!\nMe: good morning!\nPerson: how are you? \nMe: I&#39;m good thanks, how...</p>\n\n<p>And at this point where I&#39;m trying to be polite and ask them how they are in return, they carry on walking so I can no longer ask them. There will be other people around so I look rude in front of them. </p>\n\n<p>Honestly this work placement after a year of WFH has reminded me of why I dislike being around most people. There are so many things that can make you look rude and make people dislike you... I&#39;m just trying to come in, be polite, do my work and go home. The interactions I have with people are taking up more energy than the actual work itself.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/ov1wov/why_do_people_say_hello_repeatedly/",
  "subreddit": "NoStupidQuestions",
  "id": "ov1wov",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm autistic, and this is one behaviour that I really don't understand. I'm on a\nwork placement at the moment, for 10 weeks. The work environment means that\nyou're constantly moving around a big lab, and bumping into the same people over\nand over.\n\nI will always say hi, good morning at the beginning…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自閉症ですが、これは私が本当に理解できない行動の一つです。今、私は10週間の\n私は今、10週間の職場体験をしています。職場環境としては\n大きなラボの中を常に動き回り、同じ人に何度も出くわします。\n何度も会うことになります。\n\n私は最初に必ず「こんにちは、おはようございます」と挨拶します。",
      "title": "なぜ人は何度も挨拶をするのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是自闭症患者，这是我非常不理解的一种行为。我正在进行一个\n目前正在进行为期10周的工作实习。工作环境意味着\n你不断地在一个大的实验室里走来走去，不断地碰到同样的人。\n的人。\n\n我总是会在开始时打招呼，说早上好...",
      "title": "为什么人们会反复说你好？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是自閉症患者，這是我非常不理解的一種行爲。我正在進行一個\n目前正在進行爲期10周的工作實習。工作環境意味着\n你不斷地在一個大的實驗室裏走來走去，不斷地碰到同樣的人。\n的人。\n\n我總是會在開始時打招呼，說早上好...",
      "title": "爲什麼人們會反覆說你好？"
    }
  ]
}