{
  "author": "Jxntb733",
  "original_created_utc": 1650568767,
  "title": "We need to stop thinking ‘promoting women in crypto’ is at all progressive; crypto is gender neutral",
  "created_utc": 1650580588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Any headlines you read that say “we need to get more women in crypto” are promoting an ideology of equality of outcome, not equality of opportunity. Cryptocurrency is gender neutral, it does not care how you identify.         &lt;/p&gt;\n\n&lt;p&gt;We do not need to bring ones gender into decentralized finance or we will become no better than corrupt industries out there that only promote such talk to appear better and seem ‘inclusive’.            &lt;/p&gt;\n\n&lt;p&gt;The only thing that matters are your constructive or critiquing thoughts towards cryptocurrencies, not how you identify; not your gender not your sex not your nationality not your political affiliation not your star sign.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 392,
  "permalink": "/r/CryptoCurrency/comments/u8vabw/we_need_to_stop_thinking_promoting_women_in/",
  "subreddit": "CryptoCurrency",
  "id": "u8vabw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Any headlines you read that say “we need to get more women in crypto” are\npromoting an ideology of equality of outcome, not equality of opportunity.\nCryptocurrency is gender neutral, it does not care how you identify.\n\nWe do not need to bring ones gender into decentralized finance or we will…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号にもっと女性を参加させる必要がある」という見出しのものは\n機会の平等ではなく、結果の平等というイデオロギーを推進しています。\n暗号通貨は性別に関係なく、あなたがどのように識別するかは気にしません。\n\n私たちは、分散型金融にものの性別を持ち込む必要はありませんし、私たちは...",
      "title": "暗号における女性の地位向上」を進歩的だと考えるのはやめよう。暗号は性別に関係ない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你读到的任何说 \"我们需要让更多的女性参与加密货币 \"的头条新闻都是\n宣传的是结果平等的意识形态，而不是机会平等。\n加密货币是不分性别的，它不关心你的身份。\n\n我们不需要把自己的性别带入去中心化的金融，否则我们将...",
      "title": "我们需要停止认为 \"促进女性参与加密货币 \"是完全进步的；加密货币是性别中立的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你讀到的任何說 \"我們需要讓更多的女性參與加密貨幣 \"的頭條新聞都是\n宣傳的是結果平等的意識形態，而不是機會平等。\n加密貨幣是不分性別的，它不關心你的身份。\n\n我們不需要把自己的性別帶入去中心化的金融，否則我們將...",
      "title": "我們需要停止認爲 \"促進女性參與加密貨幣 \"是完全進步的；加密貨幣是性別中立的。"
    }
  ]
}