{
  "author": "Nostalg33k",
  "original_created_utc": 1635520089,
  "title": "Tell me what is your largest bag without telling me what is your largest bag !",
  "created_utc": 1635532246,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You own a lot of cryptos ? you own only one ? Try to tell us and we&#39;ll take a guess !The more you make it simple yet complicated the most entertaining it will be. I want to take a shot checking if I can guess what is the top coin in your portfolio right now !</p>\n\n<p>&#x200B;</p>\n\n<p>Let&#39;s have a fun time attempting to guess and trying to make other people guess !</p>\n\n<p>You can also make a riddle of some sort or even code your answer, just try to tell if it is very hard or easy. I&#39;m not good in deciphering but we could all try.This can take our mind off the market for a bit and celebrate our knowledge of so many specific coins !</p>\n\n<p>Edit: I&#39;m so happy right now you can&#39;t imagine, I had a shitty day (not shitty but just low energy) and you made my day by partaking in this game! Thank you to all ! </p>\n\n<p>&#x200B;</p>\n</div><!-- SC_ON -->",
  "score": 266,
  "permalink": "/r/CryptoCurrency/comments/qiexgo/tell_me_what_is_your_largest_bag_without_telling/",
  "subreddit": "CryptoCurrency",
  "id": "qiexgo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You own a lot of cryptos ? you own only one ? Try to tell us and we'll take a\nguess !The more you make it simple yet complicated the most entertaining it will\nbe. I want to take a shot checking if I can guess what is the top coin in your\nportfolio right now !\n\n\n\nLet's have a fun time attempting to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたはたくさんのクリプトを所有していますか、それとも1つしか所有していませんか？教えていただければ、私たちが推測します。\nシンプルかつ複雑にすればするほど、面白いと思います。\nになります。あなたのポートフォリオの中で、今一番のコインを当てられるかどうか、試してみたいと思います。\n今、あなたのポートフォリオの中で一番のコインを当てられるかどうか試してみたいと思います。\n\n\n\n楽しんでやってみましょう。",
      "title": "あなたの最大のバッグは何ですか？」と言わずに教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你拥有很多加密货币吗？ 你只拥有一个？试着告诉我们，我们将采取猜测\n你越是把它变得简单而又复杂，它就越有娱乐性。\n的。我想试一试，看看我是否能猜到你的投资组合中最重要的币种是什么？\n现在的投资组合中最重要的币种!\n\n\n\n让我们有一个有趣的时间，尝试...",
      "title": "告诉我你最大的包是什么，而不告诉我你最大的包是什么 !"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你擁有很多加密貨幣嗎？ 你只擁有一個？試着告訴我們，我們將採取猜測\n你越是把它變得簡單而又複雜，它就越有娛樂性。\n的。我想試一試，看看我是否能猜到你的投資組合中最重要的幣種是什麼？\n現在的投資組合中最重要的幣種!\n\n\n\n讓我們有一個有趣的時間，嘗試...",
      "title": "告訴我你最大的包是什麼，而不告訴我你最大的包是什麼 !"
    }
  ]
}