{
  "author": "partymsl",
  "original_created_utc": 1653588305,
  "title": "JP Morgan went from \"Bitcoin is going to zero\" in the 2018 bear market to \"Bitcoin is trading below its value\" in the 2022 bear market.",
  "created_utc": 1653604947,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In a recent note to clients, JP Morgan told its clients that Bitcoin&amp;#39;s real value right now would be 38k and its undervalued right now. And even made Crypto to their preferred alternative asset currently. That comes just four years after JP Morgan told investors in 2018 that Bitcoin is going to zero and that they should not buy more.&lt;/p&gt;\n\n&lt;p&gt;Just another example for the real metric over short term price action. Banks and highly anti-crypto companies changing their opinion about it completly from its &amp;quot;worthless&amp;quot; to &amp;quot;we are buying the dip&amp;quot;. Even in bear markets they are still standing in crypto, Crypto is not just a shortterm profit maker for them they believe in it for real.&lt;/p&gt;\n\n&lt;p&gt;I mean if even once anti-crypto people highly believe in Crypto during a bear market even after the current UST crash then Crypto is definitely not going anywhere, we are taking more and more people on our side. That&amp;#39;s the real mass adoption.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 359,
  "permalink": "/r/CryptoCurrency/comments/uydl6w/jp_morgan_went_from_bitcoin_is_going_to_zero_in/",
  "subreddit": "CryptoCurrency",
  "id": "uydl6w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In a recent note to clients, JP Morgan told its clients that Bitcoin's real\nvalue right now would be 38k and its undervalued right now. And even made Crypto\nto their preferred alternative asset currently. That comes just four years after\nJP Morgan told investors in 2018 that Bitcoin is going to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "JPモルガンは最近の顧客向けメモで、ビットコインの実\n今現在のビットコインの価値は38Kであり、今現在は過小評価されている。そしてさらに、現在好ましい代替資産としてCrypto\nを現在推奨する代替資産とした。からわずか4年後のことです。\nJP Morganは2018年に投資家に対して、Bitcoinは...になると伝えました。",
      "title": "JPモルガンは2018年の弱気相場で「ビットコインはゼロになる」から、2022年の弱気相場で「ビットコインはその価値を下回って取引されている」とした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在最近给客户的一份说明中，摩根大通告诉其客户，比特币的实际\n现在的价值将是3.8万，它的价值现在被低估了。甚至将加密货币\n成为他们目前首选的替代资产。这是在四年前\n摩根大通在2018年告诉投资者，比特币将会...",
      "title": "摩根大通从2018年熊市的 \"比特币将归零 \"到2022年熊市的 \"比特币交易低于其价值\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近給客戶的一份說明中，摩根大通告訴其客戶，比特幣的實際\n現在的價值將是3.8萬，它的價值現在被低估了。甚至將加密貨幣\n成爲他們目前首選的替代資產。這是在四年前\n摩根大通在2018年告訴投資者，比特幣將會...",
      "title": "摩根大通從2018年熊市的 \"比特幣將歸零 \"到2022年熊市的 \"比特幣交易低於其價值\"。"
    }
  ]
}