{
  "author": "retardedvisions",
  "original_created_utc": 1639835240,
  "title": "Moons for karma really give a good sense of the type of people on this sub",
  "created_utc": 1639906323,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We all know why we got into crypto, for the most part it was the “gains”. It was all just trying to chase the dream of escaping our 9 to 5 bullshit (not to say Cryptos real world utility isn’t groundbreaking)&lt;/p&gt;\n\n&lt;p&gt;This sub has taught me a lot about the game, how to handle losses and how to  grow my portfolio. But the sentiment around upvoting in this sub bothers the hell out of me.&lt;/p&gt;\n\n&lt;p&gt;Because of the association of earning Moons with karma and upvotes everyone is super stingy when it comes to supporting each other, like upvoting something is coming directly out of your own pocket.&lt;/p&gt;\n\n&lt;p&gt;It really got me thinking of the psychology behind the reluctance to upvote posts and comments, and when it comes down to it it’s just selfishness.&lt;/p&gt;\n\n&lt;p&gt;Instead of lifting up our brothers and sisters in the community by upvoting and making it a positive experience, we keep them down.&lt;/p&gt;\n\n&lt;p&gt;God forbid, anyone make a lunar dime off our generosity and support.&lt;/p&gt;\n\n&lt;p&gt;I am not saying I support the greedy little moon farmers who don’t bring anything to the community, f*ck those guys, but if someone is making a genuine effort to learn or teach, or has something valuable to say we need to support them.&lt;/p&gt;\n\n&lt;p&gt;So I implore you all, loosen up those upvoting thumbs. Let’s make &lt;a href=\"/r/cc\"&gt;r/cc&lt;/a&gt; great again!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/rj7u6h/moons_for_karma_really_give_a_good_sense_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "rj7u6h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all know why we got into crypto, for the most part it was the “gains”. It was\nall just trying to chase the dream of escaping our 9 to 5 bullshit (not to say\nCryptos real world utility isn’t groundbreaking)\n\nThis sub has taught me a lot about the game, how to handle losses and how to\ngrow my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちはなぜ暗号に手を出したのか、その理由の大半は「利潤」でした。それは\n9時から5時までの勤務から逃れたいという夢を追い求めただけである（とまでは言わないが\nCryptosの実世界での有用性は画期的なものではない)\n\nこのサブは、ゲームについて多くのことを教えてくれました、どのように損失を処理するか、そしてどのように\n自分を成長させる...",
      "title": "カルマのための月は、このサブの人々のタイプをよく表しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道我们为什么进入加密货币，在大多数情况下是 \"收益\"。那是\n所有这些都是为了追寻逃离朝九晚五的梦想（不是说\n加密货币在现实世界中的效用不是突破性的)\n\n这笔钱让我学到了很多关于游戏的知识，如何处理损失和如何\n增长我的...",
      "title": "因果报应的月亮真的能让人很好地了解这个子的人的类型。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道我們爲什麼進入加密貨幣，在大多數情況下是 \"收益\"。那是\n所有這些都是爲了追尋逃離朝九晚五的夢想（不是說\n加密貨幣在現實世界中的效用不是突破性的)\n\n這筆錢讓我學到了很多關於遊戲的知識，如何處理損失和如何\n增長我的...",
      "title": "因果報應的月亮真的能讓人很好地瞭解這個子的人的類型。"
    }
  ]
}