{
  "author": "Mandrake_m2",
  "original_created_utc": 1651749054,
  "title": "I think the fact that we can now send thousands of dollars for less than $1 in fees is what will make crypto go mainstream eventually.",
  "created_utc": 1651793774,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There are a lot of features that give crypto an edge over fiat currency. There’s the fact that some cryptos have a limited supply just like Bitcoin. Other coins are untraceable like Monero and are great for privacy and DeFi is decentralized and safe from government interference.&lt;/p&gt;\n\n&lt;p&gt;But out of all features that will later prove crypto more superior than fiat, I think that low transfer fees is what will bring in new people initially and make crypto go mainstream.&lt;/p&gt;\n\n&lt;p&gt;The reason I’m saying this is cause I’m seeing it in my own eyes. I live in a country where a lot of young people live abroad and help their families out with extra cash end of month.\nWestern Union here is HELLA EXPENSIVE so I’m seeing a lot of people who have never had any encounter with crypto before open a wallet and start using platforms like Binance and E-Money cause of the ultra low fees and fast transfers.&lt;/p&gt;\n\n&lt;p&gt;I’m not saying other features in crypto aren’t important. In fact I think limited supply and decentralization are much more important features. I’m just saying that low fees is what will most likely attract the largest number of people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/uiv32d/i_think_the_fact_that_we_can_now_send_thousands/",
  "subreddit": "CryptoCurrency",
  "id": "uiv32d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There are a lot of features that give crypto an edge over fiat currency. There’s\nthe fact that some cryptos have a limited supply just like Bitcoin. Other coins\nare untraceable like Monero and are great for privacy and DeFi is decentralized\nand safe from government interference.\n\nBut out of all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号が不換紙幣に対して優位に立つための特徴はたくさんあります。例えば\nビットコインのように供給が制限されている暗号もあります。他のコイン\nはMoneroのように追跡不可能で、プライバシーに優れていますし、DeFiは分散化されてい\nと政府の干渉から安全です。\n\nしかし、その中でも...",
      "title": "1ドル以下の手数料で何千ドルも送れるようになったことが、いずれ暗号が主流になるきっかけになると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有很多特点使加密货币比法定货币更有优势。还有就是\n有些加密货币的供应量有限，就像比特币。其他币种\n是不可追踪的，如Monero，对隐私来说是很好的，DeFi是去中心化的\n和DeFi是分散的，不受政府干预。\n\n但在所有...",
      "title": "我认为，我们现在可以用不到1美元的费用发送数千美元的事实，将使加密货币最终成为主流。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有很多特點使加密貨幣比法定貨幣更有優勢。還有就是\n有些加密貨幣的供應量有限，就像比特幣。其他幣種\n是不可追蹤的，如Monero，對隱私來說是很好的，DeFi是去中心化的\n和DeFi是分散的，不受政府幹預。\n\n但在所有...",
      "title": "我認爲，我們現在可以用不到1美元的費用發送數千美元的事實，將使加密貨幣最終成爲主流。"
    }
  ]
}