{
  "author": "Flying_Rainbows",
  "original_created_utc": 1656608581,
  "title": "In 1997 Albania's government collapsed due to widespread pyramid schemes and the country fell into civil war. How did pyramid schemes make a government fall and ultimately lead to chaos?",
  "created_utc": 1656659227,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As per the &lt;a href=\"https://en.wikipedia.org/wiki/Albanian_Civil_War\"&gt;wikipedia&lt;/a&gt; article: &amp;quot;The Albanian Civil War in 1997 was sparked by pyramid scheme failures in Albania soon after its transition to a market economy. The government was toppled and more than 2,000 people were killed.&amp;quot; What was going on here? How did pyramid schemes become so widespread as to overtake large parts of the economy and how did the schemes crashing down result in a state of anarchy or lack of governmetn?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/vodbjg/in_1997_albanias_government_collapsed_due_to/",
  "subreddit": "AskHistorians",
  "id": "vodbjg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As per the wikipedia [https://en.wikipedia.org/wiki/Albanian_Civil_War] article:\n\"The Albanian Civil War in 1997 was sparked by pyramid scheme failures in\nAlbania soon after its transition to a market economy. The government was\ntoppled and more than 2,000 people were killed.\" What was going on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "wikipedia[https://en.wikipedia.org/wiki/Albanian_Civil_War]の記事の通り。\n「1997年のアルバニア内戦は、アルバニアでのマルチ商法の失敗が発端となった。\nアルバニアは市場経済への移行直後で、マルチ商法の失敗が発端となった。政府は倒され\n政府が倒され、2,000人以上が死亡した。何が起きていたのか・・・。",
      "title": "1997年、アルバニアはマルチ商法の横行により政府が崩壊し、内戦状態に陥った。マルチ商法がどのように政府を崩壊させ、最終的に混乱を招いたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据维基百科[https://en.wikipedia.org/wiki/Albanian_Civil_War]的文章。\n\"1997年的阿尔巴尼亚内战是由阿尔巴尼亚向市场经济过渡后不久的金字塔计划失败引发的。\n阿尔巴尼亚在向市场经济转型后不久，因传销失败而引发。政府被推翻\n政府被推翻，超过2000人被杀\"。发生了什么事...",
      "title": "1997年，阿尔巴尼亚政府因广泛的传销活动而倒闭，国家陷入内战。传销是如何使政府垮台并最终导致混乱的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據維基百科[https://en.wikipedia.org/wiki/Albanian_Civil_War]的文章。\n\"1997年的阿爾巴尼亞內戰是由阿爾巴尼亞向市場經濟過渡後不久的金字塔計劃失敗引發的。\n阿爾巴尼亞在向市場經濟轉型後不久，因傳銷失敗而引發。政府被推翻\n政府被推翻，超過2000人被殺\"。發生了什麼事...",
      "title": "1997年，阿爾巴尼亞政府因廣泛的傳銷活動而倒閉，國家陷入內戰。傳銷是如何使政府垮臺並最終導致混亂的？"
    }
  ]
}