{
  "author": "ottolouis",
  "original_created_utc": 1628427602,
  "title": "During the American Revolution, to what extent were the Founding Fathers motivated by personal financial gain, as opposed to fighting for universal rights?",
  "created_utc": 1628484861,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s very conspicuous that most men who signed the Declaration of Independence were quite well-off — they tended to be wealthy landowners, merchants, lawyers, or some combination of the three. It&#39;s also conspicuous that most of the &quot;tyrannical legislation&quot; that led to the Revolution — the Sugar Act, Stamp Act, Townshend Duties, and Tea Act — was tax-related. The Quartering Act and Intolerable Acts are an exception to this, but they were reactions to American rebellion directed towards the previous acts. Ultimately, the convergence of economic rights and universal liberties in American founding thought seems strange to me. Was it really that unprecedented to ask colonists — or subjects — to pay taxes? Enlightenment ideas pertained largely to secularism, freedom of speech, consent of the governed, and, yes, property rights. But in the case of the American Revolution, the substantive right involved taxation, and I&#39;m not sure we would call that a &quot;property&quot; right. In the 18th century, did people truly believe that paying higher duties on the importation of goods was no different than one&#39;s property being seized? Even the Bill of Rights only mentions property insofar as it cannot be taken without due process in a trial, but the Constitution allows Congress to tax Americans with absolutely no qualifications. Is it possible that, contrary to popular belief, the American Revolution started because a group of wealthy colonists decided the benefits of receiving protection from the British army and navy no longer exceeded the costs of paying taxes for that protection? And was it those wealthy colonists — the landowners, merchants and lawyers — who disproportionately bore the burden of the taxation, as opposed to artisans and the lower class? On top of that, to what extent was the iconic universal rights jargon of the American Revolution an instrument for articulating grievances in a way that wasn&#39;t self-interested?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/p0e7u1/during_the_american_revolution_to_what_extent/",
  "subreddit": "AskHistorians",
  "id": "p0e7u1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's very conspicuous that most men who signed the Declaration of Independence\nwere quite well-off — they tended to be wealthy landowners, merchants, lawyers,\nor some combination of the three. It's also conspicuous that most of the\n\"tyrannical legislation\" that led to the Revolution — the Sugar Act,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "独立宣言に署名した人物のほとんどが、裕福な土地所有者や商人、弁護士であったことは、非常に注目に値します。\nはかなり裕福で、裕福な土地所有者、商人、弁護士である傾向がありました。\n彼らは裕福な地主、商人、弁護士、またはその3つの組み合わせである傾向がありました。また、「専制的な法律」のほとんどが\n革命の原因となった「専制的な法律」（砂糖法、...",
      "title": "アメリカ独立戦争中、建国の父たちは、普遍的な権利のために戦うのではなく、個人的な経済的利益のためにどの程度動機づけられていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "非常明显的是，签署《独立宣言》的大多数人都是相当富裕的。\n都是相当富裕的--他们往往是富有的地主、商人、律师。\n或三者的某种组合。同样明显的是，大多数的\n导致革命的 \"暴政立法\"--《糖业法案》、...",
      "title": "在美国革命期间，开国元勋们在多大程度上是受个人经济利益的驱使，而不是为普遍权利而战？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "非常明顯的是，簽署《獨立宣言》的大多數人都是相當富裕的。\n都是相當富裕的--他們往往是富有的地主、商人、律師。\n或三者的某種組合。同樣明顯的是，大多數的\n導致革命的 \"暴政立法\"--《糖業法案》、...",
      "title": "在美國革命期間，開國元勳們在多大程度上是受個人經濟利益的驅使，而不是爲普遍權利而戰？"
    }
  ]
}