{
  "author": "illintent99",
  "original_created_utc": 1638111209,
  "title": "You may want to keep this in mind",
  "created_utc": 1638128220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are those of us who are very fortunate to have grown up with, well, a fortune. Some have been set for life from the womb with access to great amounts of money. </p>\n\n<p>It&#39;s important to remember this while interacting with other cryptocurrency investors in spaces much like <a href=\"/r/cc\">r/cc</a>. Why? For your own mental health. </p>\n\n<p>It&#39;s much easier to make money when you have alot to start with. I&#39;m not much impressed by the guy who made $1,000,000 profit on his $1,000,000 investment but I&#39;m pumped for the person who took the big risk and their portfolio goes to 2k from 1k. </p>\n\n<p>You can call me jelly if you want, I just have more respect for the one who&#39;s trying to better themselves investing a month&#39;s rent than some guy gambling with a pair of Yeezy&#39;s.</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/CryptoCurrency/comments/r45zld/you_may_want_to_keep_this_in_mind/",
  "subreddit": "CryptoCurrency",
  "id": "r45zld",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are those of us who are very fortunate to have grown up with, well, a\nfortune. Some have been set for life from the womb with access to great amounts\nof money.\n\nIt's important to remember this while interacting with other cryptocurrency\ninvestors in spaces much like r/cc [/r/cc]. Why? For your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちの中には、非常に恵まれた環境で育った人たちがいます。\nfortune. 胎児の頃から大金を手にすることができた人もいます。\nのです。\n\nこのことを忘れずに、他の暗号通貨を使って\nr/cc [/r/cc]のようなスペースで他の暗号通貨投資家と交流する際には、このことを覚えておくことが重要です。なぜですか？あなたのために...",
      "title": "これを覚えておくといいかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们中有些人非常幸运，在成长过程中拥有，嗯，财富。\n财富。有些人从子宫里就被安排好了生活，可以获得大量的\n的钱。\n\n在与其他加密货币互动时，记住这一点很重要。\n投资者进行互动时，一定要记住这一点，就像在r/cc[/r/cc]这样的空间。为什么？因为你的...",
      "title": "你可能要牢记这一点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們中有些人非常幸運，在成長過程中擁有，嗯，財富。\n財富。有些人從子宮裏就被安排好了生活，可以獲得大量的\n的錢。\n\n在與其他加密貨幣互動時，記住這一點很重要。\n投資者進行互動時，一定要記住這一點，就像在r/cc[/r/cc]這樣的空間。爲什麼？因爲你的...",
      "title": "你可能要牢記這一點"
    }
  ]
}