{
  "author": "MariaKilledSwan",
  "the_new_excerpt": "Like that feeling when you finish watching someone's video and go check out\ntheir channel but the last video uploaded was 1 year ago. It's mild when the\nchannel is quite well known but any small channel just hits me with sadness. It\nfeels melancholy, like when you're done reading a story. It just…",
  "original_created_utc": 1623331039,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かの動画を見終わって、その人のチャンネルを見に行ったら、最後にアップロードされたのが1年前だった時のような感覚。\n最後にアップロードされたのが1年前だった時のような感覚です。有名なチャンネルならまだいいのですが\n知名度の高いチャンネルならまだしも、小さなチャンネルだと悲しい気持ちになります。それは\n物語を読み終えた時のような、憂鬱な気分になります。それは...",
      "title": "放置されたytチャンネルを見つけると、軽く落ち込んでしまう人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当你看完某人的视频，去查看他们的频道时，那种感觉就像\n他们的频道，但最后上传的视频是1年前的。当这个频道是相当知名的时候，这种感觉是温和的。\n频道是相当知名的，但任何小频道都会让我感到悲伤。它\n感觉很忧郁，就像你读完一个故事一样。它只是...",
      "title": "当你发现一个被遗弃的YT频道时，是否有人会感到轻微的沮丧？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當你看完某人的視頻，去查看他們的頻道時，那種感覺就像\n他們的頻道，但最後上傳的視頻是1年前的。當這個頻道是相當知名的時候，這種感覺是溫和的。\n頻道是相當知名的，但任何小頻道都會讓我感到悲傷。它\n感覺很憂鬱，就像你讀完一個故事一樣。它只是...",
      "title": "當你發現一個被遺棄的YT頻道時，是否有人會感到輕微的沮喪？"
    }
  ],
  "title": "Does anyone else get mildly depressed when you find an abandoned yt channel?",
  "created_utc": 1623346400,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like that feeling when you finish watching someone&#39;s video and go check out their channel but the last video uploaded was 1 year ago. It&#39;s mild when the channel is quite well known but any small channel just hits me with sadness. It feels melancholy, like when you&#39;re done reading a story. It just makes me sad because them being gone reminds me that nothing is permanent.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/nwnf5q/does_anyone_else_get_mildly_depressed_when_you/",
  "subreddit": "TooAfraidToAsk",
  "id": "nwnf5q",
  "is_self": true,
  "media": null,
  "is_video": false
}