{
  "author": "cm2_0",
  "the_new_excerpt": "Specifically, I am talking about this post\n[https://www.reddit.com/r/CryptoCurrency/comments/nc6qhm/we_wanted_decentralization_this_is_it/].\nPlease, don't fail for that rhetoric. Please, don't. This is not what mass\nadoption and decentralization look like. This is just a person, basically the\nsecond…",
  "original_created_utc": 1621069492,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "具体的には、この投稿についてです。\n[https://www.reddit.com/r/CryptoCurrency/comments/nc6qhm/we_wanted_decentralization_this_is_it/]をご覧ください。\nお願いだから、その美辞麗句で失敗しないで。頼むからやめてくれ。これでは大量\n採用や分散化の様子ではありません。これはただの人で、基本的には\n番目の...",
      "title": "私たちは大量採用を望んでいました。これは絶対にありえません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "具体来说，我说的是这个帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/nc6qhm/we_wanted_decentralization_this_is_it/]。\n请不要因为这种说辞而失败。请不要。这不是大规模\n采用和分散化的样子。这只是一个人，基本上是\n第二...",
      "title": "我们想要大规模收养。这绝对不是它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "具體來說，我說的是這個帖子\n[https://www.reddit.com/r/CryptoCurrency/comments/nc6qhm/we_wanted_decentralization_this_is_it/]。\n請不要因爲這種說辭而失敗。請不要。這不是大規模\n採用和分散化的樣子。這只是一個人，基本上是\n第二...",
      "title": "我們想要大規模收養。這絕對不是它。"
    }
  ],
  "title": "We wanted mass adoption. This is absolutely not it.",
  "created_utc": 1621089034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Specifically, I am talking about this <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/nc6qhm/we_wanted_decentralization_this_is_it/\">post</a>.  Please, don&#39;t fail for that rhetoric. Please, don&#39;t. This is not what mass adoption and decentralization look like. This is just a person, basically the second richest man in the world, the 1% of the 1%, playing with the money of millions of people. That&#39;s just the contrary of what decentralization truly is. One of the main goals of decentralization, as <a href=\"/u/spitefire\">u/spitefire</a> said in his <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/nbyj5k/when_did_it_become_ok_in_peoples_eyes_to_allow/\">post</a> is </p>\n\n<blockquote>\n<p>to get the financial system back into the hands of the ordinary person and not controlled and influenced by the top 1%. </p>\n</blockquote>\n\n<p>So, this is just the exact opposite of what cryptocurrencies stand for. Also, <a href=\"/u/Gilgameshbrah\">u/Gilgameshbrah</a> pointed out how only 2% of the world population uses cryptocurrencies. And probably a good part of them don&#39;t understand how they work.,</p>\n\n<p>Furthermore, mass adoption doesn&#39;t mean people buying shitcoins. Those are just people looking at a way to make easy money, they don&#39;t care about the projects or about the underlying technology behind those coins, or tokens, and that&#39;s why most shitcoins lack in fundamentals. </p>\n\n<p>Mass adoption means people will start using cryptocurrencies and blockchain technologies because they have a huge amount of potential in changing our societies, in changing our economics and in changing our world. Using this technology means to democratize our financial system in order to reduce inequalities, in order to take back our privacy and in order to finally take back our money.</p>\n\n<p>For me this technology is a gateway for a fairer world. So, this is not mass adoption and this is not decentralization, at all. This is the exact opposite. So, fuck that and fuck the people that think that.</p>\n</div><!-- SC_ON -->",
  "score": 494,
  "permalink": "/r/CryptoCurrency/comments/ncukye/we_wanted_mass_adoption_this_is_absolutely_not_it/",
  "subreddit": "CryptoCurrency",
  "id": "ncukye",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798339
}