{
  "author": "Joecheve13",
  "the_new_excerpt": "First off I want to preface this by saying that by no means do I think\nhomophobia is gone or that it’s accepted everywhere in the West. Go back a\nlittle over a decade and being openly homophobic was totally acceptable. We also\ncouldn’t even get married.\n\nHowever we have made a lot of progress in…",
  "original_created_utc": 1618038039,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に断っておきますが、私は決してホモフォビアがなくなったとか、欧米ではどこでも受け入れられていると思っているわけではありません。\n同性愛嫌悪がなくなったとか、欧米ではどこでも受け入れられているとか、そういうことでは決してありません。10年以上前を振り返ると\n10年以上前を振り返ると、公然と同性愛嫌悪をすることは全く問題ありませんでした。また、私たちは\n結婚することもできませんでした。\n\nしかし、今ではかなりの進歩を遂げています...。",
      "title": "欧米社会で同性愛が現在のように受け入れられていた時代はあったのでしょうか？例えば、同性愛者のカップルは、タブー視されることなく、公然と存在し、家族を持つことさえ許されていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想先说一句，我绝不是认为\n恐同症已经消失了，或者说在西方到处都能接受。回去吧\n十多年来，公开的同性恋恐惧症是完全可以接受的。我们还\n甚至不能结婚。\n\n然而我们已经取得了很大的进步，在...",
      "title": "西方社会曾经有过像现在这样接受同性恋的时代吗？例如，同性恋夫妇是否被允许公开存在，甚至有一个家庭而不被禁忌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想先說一句，我絕不是認爲\n恐同症已經消失了，或者說在西方到處都能接受。回去吧\n十多年來，公開的同性戀恐懼症是完全可以接受的。我們還\n甚至不能結婚。\n\n然而我們已經取得了很大的進步，在...",
      "title": "西方社會曾經有過像現在這樣接受同性戀的時代嗎？例如，同性戀夫婦是否被允許公開存在，甚至有一個家庭而不被禁忌？"
    }
  ],
  "title": "Was there ever a time when homosexuality was as accepted as it is now in Western society? For example were homosexual couples allowed to openly exist or even have a family without it being taboo?",
  "created_utc": 1618050622,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off I want to preface this by saying that by no means do I think homophobia is gone or that it’s accepted everywhere in the West. Go back a little over a decade and being openly homophobic was totally acceptable. We also couldn’t even get married.</p>\n\n<p>However we have made a lot of progress in recent years. Is this the farthest we’ve gotten? Was there any other point in history when a culture was so open to the idea of homosexuality that one could identify as gay and be in a relationship without fear of reprisal? Or even go so far as to start a family, through adoption obviously, without sparking outrage? </p>\n\n<p>I know different cultures and time periods had varying views and it wasn’t always vilified. But I’m not sure if I can see people getting to the level of acceptance we have now.</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/AskHistorians/comments/mnzwzi/was_there_ever_a_time_when_homosexuality_was_as/",
  "subreddit": "AskHistorians",
  "id": "mnzwzi",
  "is_self": true,
  "media": null,
  "is_video": false
}