{
  "author": "madroguri",
  "original_created_utc": 1628386208,
  "title": "Why are there so many sex related questions on this sub as of late?",
  "created_utc": 1628407149,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This may be a little meta, but for some time now almost 8/10 posts that make it to my general feed from here are all related to something about sex. </p>\n\n<p>I don’t really have a problem with that because at the end of the day I also had some of those doubts that get asked around at some point in my life. \nBut still, it is way too often that I see variations of the same questions around here</p>\n\n<ul>\n<li><p>Do people actually like (insert sexual activity)?</p></li>\n<li><p>is it ok to ask my partner to try (insert sexual activity)?</p></li>\n<li><p>is it rare to like (insert sexual activity)? </p></li>\n</ul>\n\n<p>You get the point. I am not saying that these are dumb questions of something like that. It’s just that the same questions get asked over and over again. Or maybe I’m just complaining too much lol</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/p05mh3/why_are_there_so_many_sex_related_questions_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "p05mh3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This may be a little meta, but for some time now almost 8/10 posts that make it\nto my general feed from here are all related to something about sex.\n\nI don’t really have a problem with that because at the end of the day I also had\nsome of those doubts that get asked around at some point in my life.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは少しメタ的な話かもしれませんが、ここ数年、ここから私の一般的なフィードへの投稿のほぼ8/10が\nここから私の一般的なフィードに送られてくる記事のほぼ8/10は、すべてセックスに関することです。\n\n私はそのことに特に問題を感じていません。\n疑問に思っていたからです。....",
      "title": "最近、このサブでは、なぜかセックスに関する質問が多いですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能有点玄乎，但有一段时间以来，几乎8/10的帖子\n都是与性有关的东西。\n\n我对此并无异议，因为在一天结束的时候，我也有过\n一些在我生命中的某个时刻被问及的疑惑，....",
      "title": "为什么最近在这个子上有这么多与性有关的问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能有點玄乎，但有一段時間以來，幾乎8/10的帖子\n都是與性有關的東西。\n\n我對此並無異議，因爲在一天結束的時候，我也有過\n一些在我生命中的某個時刻被問及的疑惑，....",
      "title": "爲什麼最近在這個子上有這麼多與性有關的問題？"
    }
  ]
}