{
  "author": "gorays21",
  "the_new_excerpt": "> The economy is at an “inflection point” and on the cusp of growing more\n> quickly, the Federal Reserve chairman, Jerome H. Powell, said in an interview\n> broadcast on Sunday night. But he warned that the crisis was not yet over.\n> \n> Jerome H. Powell, the Federal Reserve chairman, at a news…",
  "original_created_utc": 1618199937,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> 米連邦準備制度理事会（FRB）のパウエル議長は、米国経済は「変曲点」にあり、より急速に成長する可能性があると述べた。\n> 米連邦準備制度理事会（FRB）のパウエル議長は、日曜日の夜に放送されたインタビューで次のように述べた。\n> 日夜に放送されたインタビューで語った。しかし、危機はまだ終わっていないと警告した。\n> \n> 米連邦準備制度理事会（FRB）のジェローム・H・パウエル議長は、記者会見で...",
      "title": "ジェローム・パウエル、米国経済は「変曲点」にあると指摘"
    },
    {
      "locale": "zh",
      "the_new_excerpt": ">经济正处于 \"拐点\"，正处于增长的边缘。\n>迅速，美联储主席鲍威尔在接受采访时表示。\n周日晚间的>广播。但他警告说，危机还没有结束。\n> \n> 美联储主席杰罗姆-H-鲍威尔在新闻...",
      "title": "杰罗姆-鲍威尔称美国经济正处于 \"拐点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": ">經濟正處於 \"拐點\"，正處於增長的邊緣。\n>迅速，美聯儲主席鮑威爾在接受採訪時表示。\n週日晚間的>廣播。但他警告說，危機還沒有結束。\n> \n> 美聯儲主席傑羅姆-H-鮑威爾在新聞...",
      "title": "傑羅姆-鮑威爾稱美國經濟正處於 \"拐點"
    }
  ],
  "title": "Jerome Powell Says U.S. Economy Is at an ‘Inflection Point’",
  "created_utc": 1618210309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>The economy is at an “inflection point” and on the cusp of growing more quickly, the Federal Reserve chairman, Jerome H. Powell, said in an interview broadcast on Sunday night. But he warned that the crisis was not yet over.  </p>\n\n<p>Jerome H. Powell, the Federal Reserve chairman, at a news conference in March 2020, as the coronavirus began to cripple the U.S. economy. The outlook is brighter now but not without risks, he said on “60 Minutes” on Sunday night.  </p>\n\n<p>In the interview, with “60 Minutes” on CBS, Mr. Powell said that the American economy “has brightened substantially” as more people are vaccinated and businesses reopen. But he cautioned that “there really are risks out there,” specifically coronavirus flare-ups, if Americans return to normal life too quickly.  </p>\n\n<p>“The principal risk to our economy right now really is that the disease would spread again more quickly,” he said. “And that’s troubling. It’s going to be smart if people can continue to socially distance and wear masks.”  </p>\n\n<p>The Fed has held interest rates near zero since March 2020 and has been buying about $120 billion in government-backed bonds each month, policies meant to stoke spending by keeping borrowing cheap. Fed officials have been clear that they will continue to support the economy until it is closer to their goals of maximum employment and stable inflation — and that while the situation is improving, it is not there yet.  </p>\n\n<p>Mr. Powell reiterated that approach on Sunday, saying that the central bank would “consider raising rates when the labor market recovery is essentially complete, and we’re back to maximum employment, and inflation is back to our 2 percent goal and is on track to move above 2 percent for some time.”</p>\n</blockquote>\n\n<p><a href=\"https://www.msn.com/en-us/money/markets/fed-chief-says-u-s-economy-is-at-an-inflection-point-as-risks-remain/ar-BB1fxJue?ocid=msedgdhp\">Fed Chief Says U.S. Economy Is at an ‘Inflection Point’ as Risks Remain (msn.com)</a></p>\n</div><!-- SC_ON -->",
  "score": 244,
  "permalink": "/r/stocks/comments/mp6d77/jerome_powell_says_us_economy_is_at_an_inflection/",
  "subreddit": "stocks",
  "id": "mp6d77",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566618918
}