{
  "author": "luciagrace",
  "original_created_utc": 1628452518,
  "title": "Why do so many people choose expensive fertility treatments like IVF instead of adopting children?",
  "created_utc": 1628481594,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, I’ve had this on my mind recently, thought I’d ask here.</p>\n\n<p>IVF is such an expensive, long and complicated treatment process that women choose to go through when they can’t naturally conceive. Why would they choose to go through all that, when there are millions of children all over the world in the adoption system looking for a loving home?</p>\n\n<p>Wouldn’t it make sense to choose to adopt, especially when you find out you can’t conceive naturally? I don’t understand why someone would choose to push their body to the limit and force it to try and carry a baby, when it doesn’t want to. Yet it seems like such a popular thing to do, especially nowadays.</p>\n\n<p>Thanks in advance to anyone who answers! :)</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/p0lnh0/why_do_so_many_people_choose_expensive_fertility/",
  "subreddit": "TooAfraidToAsk",
  "id": "p0lnh0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi everyone, I’ve had this on my mind recently, thought I’d ask here.\n\nIVF is such an expensive, long and complicated treatment process that women\nchoose to go through when they can’t naturally conceive. Why would they choose\nto go through all that, when there are millions of children all over the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みなさん、こんにちは。最近、このことが気になっていたので、ここで聞いてみようと思いました。\n\n体外受精（IVF）は、女性が体外受精（IVF）を行う際に選択する、高価で、長く、複雑な治療プロセスです。\n体外受精は、自然妊娠ができないときに女性が選択する高価で長く複雑な治療法です。なぜ彼女たちは\n世界中には何百万人もの子供がいるのに、なぜそんなことをしなければならないのでしょうか...",
      "title": "なぜ、多くの人が養子縁組ではなく、体外受精などの高額な不妊治療を選択するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我最近一直在想这个问题，觉得应该在这里问一下。\n\n试管婴儿是一个昂贵、漫长和复杂的治疗过程，妇女们\n当她们不能自然受孕时，就会选择去做试管婴儿。为什么她们会选择\n去经历这一切，因为全世界有数以百万计的孩子。",
      "title": "为什么这么多人选择昂贵的生育治疗，如试管婴儿，而不是收养孩子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我最近一直在想這個問題，覺得應該在這裏問一下。\n\n試管嬰兒是一個昂貴、漫長和複雜的治療過程，婦女們\n當她們不能自然受孕時，就會選擇去做試管嬰兒。爲什麼她們會選擇\n去經歷這一切，因爲全世界有數以百萬計的孩子。",
      "title": "爲什麼這麼多人選擇昂貴的生育治療，如試管嬰兒，而不是收養孩子？"
    }
  ]
}