{
  "author": "velocipedic",
  "original_created_utc": 1638476963,
  "title": "I'm Convinced Porn Coins are Going to Be the Next Big Thing",
  "created_utc": 1638484485,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Porn Coins: The Next Big Thing&lt;/h1&gt;\n\n&lt;p&gt;Dog Coins. Pixelated monkey JPEG NFTs. The Metaverse. These are the &amp;quot;in thing&amp;quot; right now, but their time will pass as the hype fades. What do people use every day? Sometimes multiple times a day? Right now? What will never go away and will always have a market? &lt;/p&gt;\n\n&lt;h1&gt;Porn&lt;/h1&gt;\n\n&lt;p&gt;The internet may never have reached mainstream status if it wasn&amp;#39;t for pornography. Globally, the adult entertainment is a $97 Billion dollar industry and the internet brought porn to people quickly, easily, and (relatively) anonymously. Crypto can take it a step further by providing platforms and secure payments for the content producers and untold potential improvements available in Web 3.0.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Today, AVN stopped monetization on their platform due to discrimination from banks. People say it all the time incorrectly, but in this case, &amp;quot;crypto can fix this.&amp;quot; If you consume pornography, do what you can to support the performers. Crypto can genuinely improve their lives. &lt;a href=\"https://avn.com/business/articles/technology/avn-stars-gayvn-stars-to-discontinue-monetization-features-903845.html\"&gt;Source: AVN Website&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;h3&gt;SpankChain&lt;/h3&gt;\n\n&lt;p&gt;SpankChain is a cryptocurrency payment processor that is built on the Ethereum blockchain. The aim is to build an economic and technical infrastructure for the porn industry. To bring the core benefits of blockchain, such as privacy, security, economic efficiency, and self-sovereign identity, to the porn industry.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Recently, SpankChain partnered with JustFor.Fans, an adult entertainment industry fan platform to build SpankyPay. The newly created platform will help users to make payments instantly using cryptocurrencies like BTC, LTC, ETH, etc. Ameen Soleimani founded SpankChain.&lt;/p&gt;\n\n&lt;h3&gt;Bitcci&lt;/h3&gt;\n\n&lt;p&gt;Bitcci is made up of a group of public stock companies located in the cryptovalley of\nLichtenstein and Switzerland (I&amp;#39;m bullish on anything crypto that is Swiss-based). Founded by Christoph Elbert in 2017, the bitcci Group AG is building an entirely new global ecosystem for the next-generation sex industry.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Bitcci&amp;#39;s mission is to make the adult entertainment industry legal, safe, and free for anyone who wants to enjoy it. Several bitcci projects will be going live: portals, apps, and other IT solutions in the Q4 of 2021.&lt;/p&gt;\n\n&lt;h3&gt;WankCoin&lt;/h3&gt;\n\n&lt;p&gt;WankCoin is a cryptocurrency token project built to offer secure and anonymous adult site transactions. It is the leading adult entertainment cryptocurrency and is accepted on over 100 adult entertainment websites. WankCoin is a digital currency built on the Ethereum blockchain. With WankCoin, adult entertainment lovers can enjoy themselves while enjoying their anonymity. Unlike most cryptocurrencies today that doesn’t have real-world applications, WankCoin is officially accepted as a means of payment across more than 100 pornography websites.&lt;/p&gt;\n\n&lt;h3&gt;Bitcoin Adult (BTAD)&lt;/h3&gt;\n\n&lt;p&gt;Bitcoin Adult (BTAD) is a fast, private, secure proof-of-stake community-driven cryptocurrency project. The goal of BTAD is to become the ultimate payment solution for the porn industry. Bitcoin Adult crypto project was launched without ICO funding. The project&amp;#39;s main objective is to create an adult cryptocurrency, which people will earn while they watch porn. It is also designed to offer a scalable and sustainable alternative to Bitcoin. BTAD uses proof-of-stake with masternodes for the network’s security.&lt;/p&gt;\n\n&lt;h3&gt;PornVisory&lt;/h3&gt;\n\n&lt;p&gt;PornVisory is a cryptocurrency porn startup based on a decentralized, flexible organization (DFO) standard. Aside from allowing users access to adult content, PornVisory also provides reviews on the most interesting and hot videos, porn news, and rankings. Users can pay anonymously to enjoy adult entertainment without having their identity revealed. By leveraging the Basic Attention Token (BAT) project concept, the PornVisory team seeks to reward users for spending time on their platform. Based on this sub&amp;#39;s obsession with BAT, this is going to appeal to a lot of users here.&lt;/p&gt;\n\n&lt;h3&gt;Conclusion&lt;/h3&gt;\n\n&lt;p&gt;You want more and better porn, right?&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;These coins/platforms allow for anonymity&lt;/li&gt;\n&lt;li&gt;These coins/platforms allow for security&lt;/li&gt;\n&lt;li&gt;When performers are safer and compensated, they&amp;#39;ll make more content&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;TL;DR - Porn coins haven&amp;#39;t blasted off yet. I&amp;#39;m betting the explosion will come soon. Don&amp;#39;t act surprised when it hits you in the face.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://btcpeers.com/top-5-adult-crypto-projects-an-overview/\"&gt;Partial Source&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.coinlore.com/crypto/adult\"&gt;List of some other coins (not platforms)&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 367,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/JKp-cYRchQLjws9E16CeJxs9QFgTokEpwFOZ2lpeivI.jpg?auto=webp&amp;s=dc8cc2c9fba9482859e64bae71ba78ac7b55aad5",
          "width": 1024,
          "height": 500
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/JKp-cYRchQLjws9E16CeJxs9QFgTokEpwFOZ2lpeivI.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=35efbec50e20d8caf4f5037d10a543875fb1cc1d",
            "width": 108,
            "height": 52
          },
          {
            "url": "https://external-preview.redd.it/JKp-cYRchQLjws9E16CeJxs9QFgTokEpwFOZ2lpeivI.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=2745d9b5182fcfb3831c9297a61a817726608918",
            "width": 216,
            "height": 105
          },
          {
            "url": "https://external-preview.redd.it/JKp-cYRchQLjws9E16CeJxs9QFgTokEpwFOZ2lpeivI.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=66da7328e39af2491bd2083f747dc73a3961e54a",
            "width": 320,
            "height": 156
          },
          {
            "url": "https://external-preview.redd.it/JKp-cYRchQLjws9E16CeJxs9QFgTokEpwFOZ2lpeivI.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=767ae56640b265360651ed8e5ff4c95733ee730e",
            "width": 640,
            "height": 312
          },
          {
            "url": "https://external-preview.redd.it/JKp-cYRchQLjws9E16CeJxs9QFgTokEpwFOZ2lpeivI.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=80ade482f4aac72f4466df5e95f778be2a77942c",
            "width": 960,
            "height": 468
          }
        ],
        "variants": {},
        "id": "GpJ6EXMJWNJvZph53UX5g43ay1lvXDwjCRnKFMzbf8Y"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/r7giy8/im_convinced_porn_coins_are_going_to_be_the_next/",
  "subreddit": "CryptoCurrency",
  "id": "r7giy8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "PORN COINS: THE NEXT BIG THING\n\nDog Coins. Pixelated monkey JPEG NFTs. The Metaverse. These are the \"in thing\"\nright now, but their time will pass as the hype fades. What do people use every\nday? Sometimes multiple times a day? Right now? What will never go away and will\nalways have a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポルノコイン：次の大きな流れ\n\n犬のコイン。画素化された猿のJPEG NFT。メタバース これらは \"流行 \"です\nしかし、その誇大広告が消えれば、その時代は過ぎ去ります。人々が毎日使っているもの\n日ですか？時には1日に何度も？今すぐ？決してなくならないもの、そして\n常に...",
      "title": "ポルノコインが次のビッグ・シングになると確信しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "色情硬币：下一个大事件\n\n狗币。像素化的猴子JPEG NFTs。Metaverse。这些都是现在的 \"流行事物\"\n现在，但他们的时间会随着炒作的消退而过去。人们每天都在使用什么\n天都在使用什么？有时一天要用好几次？现在呢？哪些东西永远不会消失，将\n始终有一个...",
      "title": "我确信色情硬币将成为下一个大事件"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "色情硬幣：下一個大事件\n\n狗幣。像素化的猴子JPEG NFTs。Metaverse。這些都是現在的 \"流行事物\"\n現在，但他們的時間會隨着炒作的消退而過去。人們每天都在使用什麼\n天都在使用什麼？有時一天要用好幾次？現在呢？哪些東西永遠不會消失，將\n始終有一個...",
      "title": "我確信色情硬幣將成爲下一個大事件"
    }
  ]
}