{
  "author": "clevebeat",
  "the_new_excerpt": "I'm a 40 year old female who has always prided myself on being fairly tech\nsavvy. My friends all come to me for advice, I'm the first line of defense at\nwork with a computer or tech issue. I'm pretty good with the old school ways of\nthings, but I find crypto to be over my head sometimes.\n\nThere is…",
  "original_created_utc": 1615151529,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个40岁的女性，一直自诩自己是相当技术的人\n精明。我的朋友们都来找我咨询，我是第一道防线，在。\n工作与计算机或技术问题。我很擅长用老式的方法来处理\n但我发现加密技术有时会超出我的想象。\n\n有...",
      "title": "我已经40岁了，有时候觉得自己太老了，不懂加密技术。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個40歲的女性，一直自詡自己是相當技術的人\n精明。我的朋友們都來找我諮詢，我是第一道防線，在。\n工作與計算機或技術問題。我很擅長用老式的方法來處理\n但我發現加密技術有時會超出我的想象。\n\n有...",
      "title": "我已經40歲了，有時候覺得自己太老了，不懂加密技術。"
    }
  ],
  "title": "I'm 40 and sometimes feel too old to understand crypto.",
  "created_utc": 1615195843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a 40 year old female who has always prided myself on being fairly tech savvy. My friends all come to me for advice, I&#39;m the first line of defense at work with a computer or tech issue.  I&#39;m pretty good with the old school ways of things, but I find crypto to be over my head sometimes.</p>\n\n<p>There is so much in this system and so many terms, I just don&#39;t understand it. I&#39;ve been involved in crypto for 4 years and the ideas of roll-ups and staking and yield farming and even simply connecting my wallet to metamask I find terrifying and intriguing. I try to explain it to y 61 year old father, and I find myself less and less able to understand and relay the information. I&#39;m so hopeful in this tech because I&#39;m guessing that many of YOU get it, so moving forward these technologies will have greater embracing, not less.  But still, it&#39;s dejecting to not understand these things. </p>\n\n<p>I spent two hours trying to initially transfer but ultimately send USDC from my coinbase account to a new coinbase wallet. Still ended up having to send it the old fashioned way (manually typing in the address). I&#39;m terrified having metamask. Linking these things together without an actual login to compound finance I find unnerving. I&#39;m used to a login, password, not a linked connection.  Does anyone else have these challenges or is it just the first sign that technology is growing, changing and will eventually leave me in the dust?</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/lzztcs/im_40_and_sometimes_feel_too_old_to_understand/",
  "subreddit": "CryptoCurrency",
  "id": "lzztcs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542572121
}