{
  "author": "nobjos",
  "the_new_excerpt": "This post is in continuation of this\n[https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/]\npost I made 2 days back. The response I received was amazing and lot of you were\nasking for weekly updates. So here goes!\n\nMost Discussed Stocks of the…",
  "original_created_utc": 1617554863,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "本帖是本帖的续篇\n[https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/]\n的帖子，我做了2天回来。我收到的回应是惊人的，你们很多人都是。\n要求每周更新。所以，在这里开始！\n\n讨论最多的股票... ...",
      "title": "我建立了一个程序，跟踪Reddit和Twitter上的股票提及率和情绪! 本周讨论最多和增长最快的股票!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "本帖是本帖的續篇\n[https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/]\n的帖子，我做了2天回來。我收到的迴應是驚人的，你們很多人都是。\n要求每週更新。所以，在這裏開始！\n\n討論最多的股票... ...",
      "title": "我建立了一個程序，跟蹤Reddit和Twitter上的股票提及率和情緒! 本週討論最多和增長最快的股票!"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "この投稿は、この続きです。\n[https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/]\n2日前の投稿です。私が受け取った反応は驚くべきもので、多くの方が毎週の更新を求めていました。\n毎週のアップデートを求めていました。というわけで、ここで紹介します。\n\n最も議論された株式...",
      "title": "RedditやTwitterでの銘柄の言及やセンチメントを追跡するプログラムを作ってみた! 今週最も話題になった銘柄と、成長率の高い銘柄を紹介します"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "この投稿は、この続きです。\n[https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/]\n2日前の投稿です。私が受け取った反応は驚くべきもので、多くの方が毎週の更新を求めていました。\n毎週のアップデートを求めていました。というわけで、ここで紹介します。\n\n最も議論された株式...",
      "title": "RedditやTwitterでの銘柄の言及やセンチメントを追跡するプログラムを作ってみた! 今週最も話題になった銘柄と、成長率の高い銘柄を紹介します"
    }
  ],
  "title": "I built a program that tracks mentions and sentiment of stocks across Reddit and Twitter! This week's most discussed and top growing stocks!",
  "created_utc": 1617587561,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is in continuation of <a href=\"https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/\">this</a> post I made 2 days back. The response I received was amazing and lot of you were asking for weekly updates. So here goes!</p>\n\n<p><strong>Most Discussed Stocks of the Week</strong></p>\n\n<p><a href=\"https://preview.redd.it/tkhtpy8hq6r61.png?width=623&amp;format=png&amp;auto=webp&amp;s=cde4524f9c0f45d083d6370cce81e462640a965c\">https://preview.redd.it/tkhtpy8hq6r61.png?width=623&amp;format=png&amp;auto=webp&amp;s=cde4524f9c0f45d083d6370cce81e462640a965c</a></p>\n\n<p>GameStop continues to be the top discussed stock with more than 27K mentions. AMC dropped from 2nd to 4th position. PLTR gained in mentions and was the second most discussed stock last week due to a long-term deal they won with the U.S Department of Energy which is potentially worth 89 million dollars. ViacomCBS also made it into the top 10 but not in a good way. The company has lost 50% of valuation in the last 2 weeks and the sentiment reflects that. Rest all the companies are regulars in the top 10 list!</p>\n\n<p><strong>Top Growing Stocks of the Week</strong></p>\n\n<p><a href=\"https://preview.redd.it/brep8x8qq6r61.png?width=623&amp;format=png&amp;auto=webp&amp;s=47be46b91c1230ab01f618066a0344277613d285\">https://preview.redd.it/brep8x8qq6r61.png?width=623&amp;format=png&amp;auto=webp&amp;s=47be46b91c1230ab01f618066a0344277613d285</a></p>\n\n<p>Above is the list of stocks that have exploded in the number of mentions throughout social media.</p>\n\n<p><strong>ViacomCBS($VIAC)</strong> was the company with the most growth in mentions. But, the average sentiment across the mentions was negative given the 50% drop in valuation. The stock had crossed the $100 mark on 22nd March 2021 and has lost more than 50% of its value since then. The market had been over-enthusiastic about the stock since the beginning of 2021 due to its effort of transforming to a streaming giant from a traditional cable media company. However, this enthusiasm was short-lived. There might be some scope for a short-term rebound.</p>\n\n<p><strong>ASO</strong> was also growing in mentions due to their stellar earnings report. The company reported</p>\n\n<ul>\n<li>Revenues were US$5.7b, approximately in line with what analysts expected.</li>\n<li>(EPS) crushed expectations, coming in at US$3.79, an impressive 41% ahead of estimates.</li>\n</ul>\n\n<p><strong>Humanigen(HGEN)</strong> reported phase 3 results of Lenzilumab™ stating it improves survival without the need for mechanical ventilation in hospitalized patients with COVID-19. The stock jumped 100% on Monday and has stabilized at around 34% increase from last week. </p>\n\n<p><strong>MicroVision(MVIS)</strong> stock soared 50% on Wednesday. This is mainly due to Microsoft receiving a U.S. Army contract for augmented reality headsets. (It&#39;s estimated to be worth $21.9B over the next 10 years). There has been a lot of rumors stating Microsoft is planning to buy MicroVision which predominantly drove the discussions on MVIS.</p>\n\n<p><strong>FUBO</strong> stock price has been on a continuous decline for the last 2 months (more than 50% drop) and there is now increasing chatter on whether it is oversold or on the path to a rebound </p>\n\n<p><strong>SOME FAQ’s:</strong></p>\n\n<p>How does the program work: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth. I added sentiment analysis to the findings so as to check the general sentiment (whether what is being talked about the stock is positive or negative).</p>\n\n<p>What is sentiment: It&#39;s calculated using natural language processing with a modified version of vadersentiment. You get pre-trained models which classify whether a given statement is positive or negative. I have modified it to analyze financial comments also ( eg. Calls, puts, moon, gain, loss etc). It then classifies the statement between -100% and +100% depending on if it&#39;s negative or positive respectively. The numbers you are seeing here is the average across all the comments</p>\n\n<p><em>Disclaimer : I am not a financial advisor!</em></p>\n</div><!-- SC_ON -->",
  "score": 1627,
  "permalink": "/r/wallstreetbets/comments/mjzvwy/i_built_a_program_that_tracks_mentions_and/",
  "subreddit": "wallstreetbets",
  "id": "mjzvwy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961882741
}