{
  "author": "redditlurker2001",
  "the_new_excerpt": "There's a rich kid in town. Let's call him Melvin. He thinks he's really smart.\nHe finds a coupon for $20 off the new Nintendo Switch during the holidays with\nno limit on number of units. This is easy. I'll go ahead and sell the Switch now\nfor $200 and then buy it for $180 with the coupon. Easiest…",
  "original_created_utc": 1612014135,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "镇上有个富家子弟。就叫他梅尔文吧 他觉得自己很聪明\n他发现了一张优惠券 20美元关闭新任天堂开关 在假期与\n没有单位数量的限制。这很容易。我会继续前进，现在卖Switch。\n200元，然后用优惠券180元购买。最简单的...",
      "title": "如果你的朋友和家人都想知道为什么你要买300美元的GME，也许你可以这样向他们解释。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鎮上有個富家子弟。就叫他梅爾文吧 他覺得自己很聰明\n他發現了一張優惠券 20美元關閉新任天堂開關 在假期與\n沒有單位數量的限制。這很容易。我會繼續前進，現在賣Switch。\n200元，然後用優惠券180元購買。最簡單的...",
      "title": "如果你的朋友和家人都想知道爲什麼你要買300美元的GME，也許你可以這樣向他們解釋。"
    }
  ],
  "title": "If your friends and family are wondering why you're buying $GME @ $300, maybe you can explain it to them like this:",
  "created_utc": 1612056933,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s a rich kid in town. Let&#39;s call him Melvin. He thinks he&#39;s really smart. He finds a coupon for $20 off the new Nintendo Switch during the holidays with no limit on number of units. This is easy. I&#39;ll go ahead and sell the Switch now for $200 and then buy it for $180 with the coupon. Easiest $20 I&#39;ll ever make. He goes and tells all his parents&#39; friends at the Citadel Country Club that he can get them the new Nintendo Switch for their kids. He collects $200 each from 150 parents. He now has $30K and will use that money to purchase Nintendo Switches for $27K. He&#39;ll have earned $3K in just a few hours. His parents will be so proud.</p>\n\n<p>There&#39;s another kid watching Melvin this entire time. Let&#39;s call him Keith. Keith doesn&#39;t like Melvin. Keith is good friends with the guys over at Gamestop. He finds out that there are were only 100 new Switches shipped to the entire country. Keith and his 99 friends buy all 100 Nintendo Switches on the spot.</p>\n\n<p>Later in the day, Melvin goes to Gamestop with his $20 off coupon and says, &quot;I&#39;ll take 150 Nintendo Switches please.&quot; Gamestop guy looks at him and says, &quot;Sorry, we&#39;re all sold out.&quot; Melvin goes to the next Gamestop. Same story. All sold out. He goes to all the Gamestops in the city and can&#39;t find a single Switch. He won&#39;t be able to fulfill the orders.</p>\n\n<p>Meanwhile, Keith is telling all his friends about what Melvin promised the members at the Country Club. Nobody sell him the Nintendo Switch that you bought, no matter how much he offers you. Nobody likes Melvin, so everybody holds on to their Nintendo Switch.</p>\n\n<p>Melvin is in trouble. His parents rich friends are all asking when they are getting their Nintendo Switch. Melvins parents are angry, but they don&#39;t want to lose their standing in the Citadel Country Club. They have to help Melvin gets 150 Nintendo Switches. Now remember there are only 100 Switches in the city, but Melvin has created the expectation among the parents that there are 150. This is how you get a short percentage over 100%. Melvin has promised more than actually exist.</p>\n\n<p>The price of Nintendo Switches in the city skyrockets. Melvins parents were able to get a few units from Keiths friends, but they had to pay really inflated prices for them, first $1,000, then $2,000, now $3,000. It&#39;s nearing Christmas, and every rich parent at the Country Club is desperate for the Nintendo Switch they promised their kids. They can&#39;t trust that Melvin will be able to get them one. They all start bidding against each other for Switches. Everybody in town is in on the action now. Everybody wants to get a Nintendo Switch to sell at the country club for $10,000. Meanwhile, Keith and his friends are just hanging out and playing Animal Crossing.</p>\n\n<p>[Edit 1: Thanks for all the love and awards. I&#39;m really grateful. I&#39;ll try to answer as many question as I can on the thread and in the DM&#39;s]</p>\n\n<p>[Edit 2: A few astute monkeys have pointed out some flaws in my story. The example above is an oversimplification and I left a few important elements. So here&#39;s an expanded version and I&#39;ve had to adjust some of the numbers above to make room for new wrinkles.</p>\n\n<p>In a more accurate version, Melvin went to his brother Steve&#39;s high school and borrowed 150 Nintendo Switches from the high schoolers. He tells them all that if he doesn&#39;t give them back within 24 hours, he will give them each $5 per day. The high schoolers know that it&#39;s not likely that Melvin will give it back in 24 hours, so they will be perfectly happy to collect $5 per day. He sells the 150 Switches to the Country Club parents for $200 each, but now he owes 150 Switches to the high schoolers. This is a naked short. He sold Switches that were borrowed but didn&#39;t own. Let&#39;s assume the Country Club parents wrapped the Switches and they are now under the tree and out of circulation. Although there are 250 Switches in the city, there are now only 100 Switches in circulation (Keith&#39;s friends). So you have a situation where Melvin owes 150 Switches to high schoolers and there are only 100 available (150% short position of float). Melvin is overconfident and thinks he will get 150 Switches same day or at the very worse case, the day after, and maybe have to pay 150 Switches x $5 penalty = $450. He&#39;ll still have made $3,000-$450 = $2,550. The $5 penalty due to the high schoolers is interest or Melvin&#39;s carrying costs, so the longer Melvin cannot get the Switches, the more expensive it&#39;s going to be for him. After 4 days, he&#39;s at break even and will lose $450 for each day he cannot get a Switch. It gets very expensive for Melvin and his parents very quickly. This is what&#39;s happening for the past week or so for GME. The hedge funds are bleeding money every day they cannot fulfill the IOU.</p>\n\n<p>For those who are asking why Melvin doesn&#39;t just pay off the high schoolers with money, let&#39;s say that the new Zelda game is coming out and they all want to play. They also know that the price of Switches is rising. Even if Melvin offered $800 or $1,000 to cancel the IOU, they know that they can no longer get a Switch on the open market. In addition, the high schoolers are probably aware of the rising trend in Switch prices. They may think that it&#39;s better to wait for a Switch that will be worth $15,000 in a few days than to get paid off by Steve now for $1,000. So while it&#39;s possible that Melvin could buy his way out of it, it&#39;s very difficult.]</p>\n</div><!-- SC_ON -->",
  "score": 52959,
  "permalink": "/r/wallstreetbets/comments/l8lxuy/if_your_friends_and_family_are_wondering_why/",
  "subreddit": "wallstreetbets",
  "id": "l8lxuy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518552816
}