{
  "author": "Archie_The_Sage",
  "original_created_utc": 1637244216,
  "title": "Are there any philosophers who morally defend/justify eating meat?",
  "created_utc": 1637314638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If so, what would their arguments be? Full disclosure I do eat meat, but I dont hunt or kill. So I guess I would be a beneficiary but not a participant of a system of hunting and killing. </p>\n\n<p>Ive read arguments on this sub from a vegetarian/vegan perspective, and came away with the belief that my actions are pretty much indefensible. But Im wondering if there are real arguments on the other side? The only book ive ever read on this topic even was Michael Pollan&#39;s &quot;Omnivore&#39;s Dilemma,&quot; and that wasnt particularly philosophical.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/qwqf5d/are_there_any_philosophers_who_morally/",
  "subreddit": "askphilosophy",
  "id": "qwqf5d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If so, what would their arguments be? Full disclosure I do eat meat, but I dont\nhunt or kill. So I guess I would be a beneficiary but not a participant of a\nsystem of hunting and killing.\n\nIve read arguments on this sub from a vegetarian/vegan perspective, and came\naway with the belief that my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしそうであれば、彼らの主張はどのようなものでしょうか？私は肉を食べますが、狩猟はしません。\n狩りや殺しはしません。ですから、私は狩猟や殺戮のシステムの恩恵を受けているとは思いますが、参加しているとは思いません。\n狩猟や殺戮のシステムの恩恵を受けることはあっても、参加することはないでしょう。\n\n私はベジタリアン／ビーガンの観点からこのサブテーマに関する議論を読んできました。\n私はベジタリアン/ビーガンの観点からこのサブの議論を読んで、私の信念を持っています...",
      "title": "肉を食べることを道徳的に擁護・正当化する哲学者はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果是这样，他们的论点会是什么？全面披露我确实吃肉，但我不\n狩猎或杀戮。所以我想我是一个受益者，但不是一个参与者。\n狩猎和杀戮的系统的受益者，但不是参与者。\n\n我曾从素食者/素食者的角度阅读过关于这个问题的论点，并得出以下结论\n我相信，我的生活会越来越好。",
      "title": "是否有任何哲学家在道德上为吃肉辩护/辩解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果是這樣，他們的論點會是什麼？全面披露我確實喫肉，但我不\n狩獵或殺戮。所以我想我是一個受益者，但不是一個參與者。\n狩獵和殺戮的系統的受益者，但不是參與者。\n\n我曾從素食者/素食者的角度閱讀過關於這個問題的論點，並得出以下結論\n我相信，我的生活會越來越好。",
      "title": "是否有任何哲學家在道德上爲喫肉辯護/辯解？"
    }
  ]
}