{
  "author": "HonestlyDontKnow24",
  "the_new_excerpt": "I'm a new investor too, but I'm seeing a lot of people panicking about all the\nred as if this is unusual.\n\nIf you just started in February because of WSB, take a moment to look at the\nhistory of a stock or index. There are peaks and valleys. When you ask \"how does\neveryone get good deals?\" it's…",
  "original_created_utc": 1613688110,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我也是一个新的投资者，但是我看到很多人都很恐慌，所有的。\n红，仿佛这很不寻常。\n\n如果你是因为WSB才在2月份开始的，那就花点时间看看吧。\n股票或指数的历史。有高峰也有低谷。当你问 \"如何\n每个人都能得到好的待遇？\"这...",
      "title": "对新投资者来说很重要。大多数大钱来自于几个月/几年前的决定"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我也是一個新的投資者，但是我看到很多人都很恐慌，所有的。\n紅，彷彿這很不尋常。\n\n如果你是因爲WSB纔在2月份開始的，那就花點時間看看吧。\n股票或指數的歷史。有高峯也有低谷。當你問 \"如何\n每個人都能得到好的待遇？\"這...",
      "title": "對新投資者來說很重要。大多數大錢來自於幾個月/幾年前的決定"
    }
  ],
  "title": "Important for New Investors: Most Big Money Came From Decisions Made Months/Years Ago",
  "created_utc": 1613698991,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a new investor too, but I&#39;m seeing a lot of people panicking about all the red as if this is unusual.</p>\n\n<p>If you just started in February because of WSB, take a moment to look at the history of a stock or index. There are peaks and valleys. When you ask &quot;how does everyone get good deals?&quot; it&#39;s because they bought in 6 months ago and have held on since. There were times when there was a lot of green and sometimes when there was red (even more red than today). Unless you&#39;re pretty lucky, you will likely not buy something today and make a huge profit next week. Many/most of these plays are decisions people made awhile ago slowly coming to fruition (in a record bull-market no less).</p>\n\n<p>So, in the moment, all the red seems bad. But today doesn&#39;t matter unless you&#39;re buying or selling. What matters is months/years ahead. We&#39;re making decisions that will play out in May or August or 2023. That&#39;s where most of our minds need to be.</p>\n</div><!-- SC_ON -->",
  "score": 417,
  "permalink": "/r/stocks/comments/lmzi7q/important_for_new_investors_most_big_money_came/",
  "subreddit": "stocks",
  "id": "lmzi7q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883620
}