{
  "author": "MasterCookSwag",
  "the_new_excerpt": "Like the title says, we are still seeing an unprecedented amount of traffic and\nlow effort posts, of the 238 posts submitted in the last 12 hours 7 have been\napproved - the rest openly violated one or several of our rules, or were simply\npeople offering their take on the GME situation.\n\nIf you make…",
  "original_created_utc": 1612018899,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "就像标题所说的，我们仍然看到了前所未有的流量和。\n在过去12小时内提交的238个员额中，有7个员额的努力程度较低。\n其余的则公开违反了我们的一条或几条规则，或者只是简单的\n人们提供了他们对GME情况的看法。\n\n如果你做...",
      "title": "PSA 对于周末没有阅读任何东西的人群来说--该subreddit目前仍然被锁定，并设置为手动审批。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像標題所說的，我們仍然看到了前所未有的流量和。\n在過去12小時內提交的238個員額中，有7個員額的努力程度較低。\n其餘的則公開違反了我們的一條或幾條規則，或者只是簡單的\n人們提供了他們對GME情況的看法。\n\n如果你做...",
      "title": "PSA 對於週末沒有閱讀任何東西的人羣來說--該subreddit目前仍然被鎖定，並設置爲手動審批。"
    }
  ],
  "title": "PSA For the weekend crowd that hasn’t been reading anything- the subreddit is currently still locked down and set to manual approval.",
  "created_utc": 1612027784,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like the title says, we are still seeing an unprecedented amount of traffic and low effort posts, of the 238 posts submitted in the last 12 hours 7 have been approved - the rest openly violated one or several of our rules, or were simply people offering their take on the GME situation.   </p>\n\n<p>If you make a post and think it is worth approval then message the modmail, we’re also periodically looking through the queue and approving worthwhile posts. </p>\n\n<p>If your post is “what broker to use”, “I’m new how do I do X”, “I’m worried about robinhood”, “question about hedge funds/shorting” or literally anything to do with GME outside of breaking important news or analysis worthy of an investment bank it’s not getting approved.  I don’t care how important you think it is to warn others about losing money, or to encourage them to fight the evil capitalists.  </p>\n\n<p>Please feel free to use this thread as a general discussion thread for the day.  Please concentrate all GME discussion in the existing thread posted here: <a href=\"https://www.reddit.com/r/investing/comments/l8jwsl/gamestop_big_picture_technical_recap_125_129/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\">https://www.reddit.com/r/investing/comments/l8jwsl/gamestop_big_picture_technical_recap_125_129/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf</a></p>\n</div><!-- SC_ON -->",
  "score": 261,
  "permalink": "/r/investing/comments/l8nftg/psa_for_the_weekend_crowd_that_hasnt_been_reading/",
  "subreddit": "investing",
  "id": "l8nftg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534770
}