{
  "author": "RSVSinatra",
  "original_created_utc": 1631537745,
  "title": "We are Reserve - a cryptocurrency project that aims to eradicate hyperinflation. Ask us anything!",
  "created_utc": 1631554248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/x5j20vzwo9n71.png?width=1500&amp;format=png&amp;auto=webp&amp;s=6949d420998c935d1b850de7c249c14801bb40c6\">https://preview.redd.it/x5j20vzwo9n71.png?width=1500&amp;format=png&amp;auto=webp&amp;s=6949d420998c935d1b850de7c249c14801bb40c6</a></p>\n\n<p><a href=\"https://reserve.org/\">Reserve</a> is a stablecoin project with two main parts to it. There&#39;s a protocol that wraps asset-backed tokens to create basket-backed currencies, and an app that makes it possible to use the stablecoins as normal money, for ordinary transactions.</p>\n\n<p>The app is seeing 15,200 transactions per day, moving $1.6 million in value each day on average. A little over 5,000 merchants are accepting payment with Reserve in Argentina and Venezuela. What&#39;s interesting about these numbers is that they are nearly 100% ordinary people and businesses doing everyday transactions, not crypto speculators. As far as we can tell, RSV (the stablecoin) has overtaken BTC as the most used cryptocurrency in Venezuela.</p>\n\n<p>The initial basket-backed stablecoin is pegged to USD tokens only, so it works just like a normal USD stablecoin. The project has started off focusing on Latin America, and has started to catch on in Argentina, Venezuela, Colombia, and the US. Because Argentina and Venezuela are both dealing with high inflation, there has been the most interest in those countries. In Argentina it’s common for the currency to lose 50% of its value in a year, and in Venezuela it’s sometimes as high as 5–10% per day. So, naturally, there’s a need to save and earn in foreign stable currencies. The US dollar is the currency of choice in both of these countries. The project is working on launching an update to its Ethereum-based protocol, which will permit issuing further stablecoins backed by different token baskets, so that it can offer more than just a USD coin.</p>\n\n<p><strong>What are people buying the USD stablecoins with?</strong></p>\n\n<ul>\n<li>Local currency only: 75% </li>\n<li>USD or combo local+USD: 7%</li>\n<li>They aren’t! Only getting paid in stablecoins, not buying them: 18%</li>\n</ul>\n\n<p><strong>How much of the monetary volume is retail versus institutional?</strong></p>\n\n<ul>\n<li>Institutional: 76%</li>\n<li>Retail: 24%</li>\n</ul>\n\n<p>Institutional volume is mainly businesses converting their local currency earnings into stablecoins, and then selling the stablecoins for USD which they receive in their business’s American bank account. Because they have more money, they make up the majority of volume even though they are a small minority of the customer base.</p>\n\n<p>Reserve started as a silicon valley-based project, and these days has a distributed team, mostly in Latin America. Our technical and product teams are still small (12 engineers at the moment), but our customer support, operations, and compliance teams are scaling quickly to keep up with new customer growth (whole team is about 150 right now). Apply <a href=\"https://apply.workable.com/reserve/\">here</a> if what we are doing interests you.</p>\n\n<p><strong>Here today to answer questions are:</strong></p>\n\n<ul>\n<li>Nevin Freeman (CEO of Reserve) - <a href=\"/u/nnevvinn\">/u/nnevvinn</a></li>\n<li>Gabriel Jiménez (COO of Reserve) - <a href=\"/u/Gabo_At_Reserve\">/u/Gabo_At_Reserve</a></li>\n<li>Taylor Brent (Lead protocol development) - <a href=\"/u/Taylor_at_Reserve\">/u/Taylor_at_Reserve</a></li>\n</ul>\n\n<p>Ask us anything!</p>\n\n<p><em>This thread has been created at 1PM UTC. We will start responding to questions at 4PM UTC.</em></p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/pneufh/we_are_reserve_a_cryptocurrency_project_that_aims/",
  "subreddit": "CryptoCurrency",
  "id": "pneufh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "https://preview.redd.it/x5j20vzwo9n71.png?width=1500&format=png&auto=webp&s=6949d420998c935d1b850de7c249c14801bb40c6\n\nReserve [https://reserve.org/] is a stablecoin project with two main parts to\nit. There's a protocol that wraps asset-backed tokens to create basket-backed\ncurrencies, and an app…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://preview.redd.it/x5j20vzwo9n71.png?width=1500&format=png&auto=webp&s=6949d420998c935d1b850de7c249c14801bb40c6\n\nReserve [https://reserve.org/]は、2つの主要な部分を持つ安定したコインのプロジェクトです。\nつの主要な部分があります。資産担保型トークンを包み込んでバスケット担保型の通貨を作るプロトコルと\n通貨を作るプロトコルと、アプリ...",
      "title": "ハイパーインフレの撲滅を目指す暗号通貨プロジェクト「We are Reserve」。何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://preview.redd.it/x5j20vzwo9n71.png?width=1500&format=png&auto=webp&s=6949d420998c935d1b850de7c249c14801bb40c6\n\n储备[https://reserve.org/]是一个稳定币项目，有两个主要部分。\n它有两个主要部分。它有一个协议，将资产支持的代币包装起来，以创建篮子支持的货币。\n货币，以及一个应用程序。",
      "title": "我们是Reserve--一个旨在根除恶性通货膨胀的加密货币项目。向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://preview.redd.it/x5j20vzwo9n71.png?width=1500&format=png&auto=webp&s=6949d420998c935d1b850de7c249c14801bb40c6\n\n儲備[https://reserve.org/]是一個穩定幣項目，有兩個主要部分。\n它有兩個主要部分。它有一個協議，將資產支持的代幣包裝起來，以創建籃子支持的貨幣。\n貨幣，以及一個應用程序。",
      "title": "我們是Reserve--一個旨在根除惡性通貨膨脹的加密貨幣項目。向我們提出任何問題!"
    }
  ]
}