{
  "author": "txk1999",
  "original_created_utc": 1643490116,
  "title": "Do women tell all to their friends?",
  "created_utc": 1643507122,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So the wife and I were out one evening eating and having a few drinks and her best friend stopped by to have a drink with us. She had recently told the world that she was in a relationship with a particular fellow (apparently had been seeing him for a while but finally openly made it known on social media). &lt;/p&gt;\n\n&lt;p&gt;The wife did the usual &amp;quot;so tell us about him&amp;quot; and she went into details about him owning his own business, he was good with her kids, he takes her to do whatever she wants, buys her whatever she wants (hes loaded btw), just the sweetest guy ever.&lt;/p&gt;\n\n&lt;p&gt;Really giving all the other men within a 500 mile radius a run for their money. &lt;/p&gt;\n\n&lt;p&gt;Then she said it....&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He&amp;#39;s got the smallest penis I&amp;#39;ve ever seen... but he&amp;#39;s such a great guy&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My wife put her hand over her mouth with a surprised look. And then said &amp;quot;awwwww&amp;quot; as though a little kid just stumped their toe in front of her.&lt;/p&gt;\n\n&lt;p&gt;I mean that sort of stuff is a deadly ego slayer with some guys. And he had no clue that intel was just offered up over a mixed drink, across the table at a restaurant. I mean I get that it&amp;#39;s a fact to her and not &amp;quot;making fun of him&amp;quot; so to speak. But I didn&amp;#39;t feel it was fair to him at all.&lt;/p&gt;\n\n&lt;p&gt;So... is this something that&amp;#39;s common?  For this sort of information to be shared amongst gal pals?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/TooAfraidToAsk/comments/sfrmep/do_women_tell_all_to_their_friends/",
  "subreddit": "TooAfraidToAsk",
  "id": "sfrmep",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So the wife and I were out one evening eating and having a few drinks and her\nbest friend stopped by to have a drink with us. She had recently told the world\nthat she was in a relationship with a particular fellow (apparently had been\nseeing him for a while but finally openly made it known on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある晩、妻と二人で食事と酒を楽しんでいたところ、彼女の方から\n親友が立ち寄ったので一緒に飲んだ。彼女は最近、世間に\nある男性と交際していること（どうやら以前から交際していたようです。\nしばらく付き合っていたのですが、ついに公言してしまいました...。",
      "title": "女性は友人にすべてを話すのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一天晚上，我和妻子在外面吃饭，喝了几杯，她最好的朋友来找我们喝酒。\n她最好的朋友顺便和我们一起喝酒。她最近告诉全世界\n她最近告诉全世界，她和一个特定的家伙有关系（显然是一直在和他约会）。\n她最近告诉大家，她和一个特定的人在谈恋爱（显然已经和他交往了一段时间，但最后公开表明了这一点，在...",
      "title": "女人会不会把所有的事情都告诉她们的朋友？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一天晚上，我和妻子在外面喫飯，喝了幾杯，她最好的朋友來找我們喝酒。\n她最好的朋友順便和我們一起喝酒。她最近告訴全世界\n她最近告訴全世界，她和一個特定的傢伙有關係（顯然是一直在和他約會）。\n她最近告訴大家，她和一個特定的人在談戀愛（顯然已經和他交往了一段時間，但最後公開表明了這一點，在...",
      "title": "女人會不會把所有的事情都告訴她們的朋友？"
    }
  ]
}