{
  "author": "txk1999",
  "original_created_utc": 1643490116,
  "title": "Do women tell all to their friends?",
  "created_utc": 1643507122,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So the wife and I were out one evening eating and having a few drinks and her best friend stopped by to have a drink with us. She had recently told the world that she was in a relationship with a particular fellow (apparently had been seeing him for a while but finally openly made it known on social media). &lt;/p&gt;\n\n&lt;p&gt;The wife did the usual &amp;quot;so tell us about him&amp;quot; and she went into details about him owning his own business, he was good with her kids, he takes her to do whatever she wants, buys her whatever she wants (hes loaded btw), just the sweetest guy ever.&lt;/p&gt;\n\n&lt;p&gt;Really giving all the other men within a 500 mile radius a run for their money. &lt;/p&gt;\n\n&lt;p&gt;Then she said it....&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;He&amp;#39;s got the smallest penis I&amp;#39;ve ever seen... but he&amp;#39;s such a great guy&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;My wife put her hand over her mouth with a surprised look. And then said &amp;quot;awwwww&amp;quot; as though a little kid just stumped their toe in front of her.&lt;/p&gt;\n\n&lt;p&gt;I mean that sort of stuff is a deadly ego slayer with some guys. And he had no clue that intel was just offered up over a mixed drink, across the table at a restaurant. I mean I get that it&amp;#39;s a fact to her and not &amp;quot;making fun of him&amp;quot; so to speak. But I didn&amp;#39;t feel it was fair to him at all.&lt;/p&gt;\n\n&lt;p&gt;So... is this something that&amp;#39;s common?  For this sort of information to be shared amongst gal pals?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 122,
  "permalink": "/r/TooAfraidToAsk/comments/sfrmep/do_women_tell_all_to_their_friends/",
  "subreddit": "TooAfraidToAsk",
  "id": "sfrmep",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So the wife and I were out one evening eating and having a few drinks and her\nbest friend stopped by to have a drink with us. She had recently told the world\nthat she was in a relationship with a particular fellow (apparently had been\nseeing him for a while but finally openly made it known on…"
}