{
  "author": "This-is-Life-Man",
  "original_created_utc": 1629154163,
  "title": "Why is that people who made terrible life decisions are given special treatment when they finally turn their life around, wether by their own choice, or because the law enforced it, but those who consciously stayed away from bad decisions to begin with, never get any kind of acknowledgment for it?",
  "created_utc": 1629185630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People who go to jail or rehab multiple times for gnarly drug or alcohol abuse, or the multitude of crimes they commit while under the influence, or committed crimes clear headed because they were just douche bags of human beings because of pure selfish desires, but then change their lives for the better should be given some kind of positive attention for overcoming it... , but what about those who could have easily succumbed to the same temptations of theft, and bad drugs, and gangs, and all the other things that mess people up, but made the conscious decision to make better judgement calls and just say &quot;no&quot; to all the bad shit that&#39;s so easy to succumb to? Where&#39;s the award for just being good your whole life? It&#39;s frustrating to see people who chose to do bad shit get so much praise and respect for finally stopping the crap they should have never done in the first place, compared to those who just never did anything wrong to begin with. Am I misguided in my frustration?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/p5r4gr/why_is_that_people_who_made_terrible_life/",
  "subreddit": "TooAfraidToAsk",
  "id": "p5r4gr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People who go to jail or rehab multiple times for gnarly drug or alcohol abuse,\nor the multitude of crimes they commit while under the influence, or committed\ncrimes clear headed because they were just douche bags of human beings because\nof pure selfish desires, but then change their lives for the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "薬物やアルコールの乱用で何度も刑務所やリハビリ施設に入っている人。\n薬物やアルコールの乱用で何度も刑務所やリハビリ施設に入ったり、薬物の影響を受けながら多くの犯罪を犯したり、あるいは\n純粋な私利私欲のために、人間として最低な行為をしてしまったために、頭脳明晰な状態で犯罪を犯してしまった。\n純粋な私利私欲のために、人間として最低の行為をしてしまったが、その後、人生を変えてしまった...。",
      "title": "なぜ、人生の重大な決断をした人は、自分の意思で、あるいは法律で強制されて、ようやく人生を好転させたときに、特別な扱いを受けるのに、最初から意識的に悪い決断から遠ざかっていた人は、そのことを認めてもらえないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那些因滥用毒品或酒精而多次入狱或戒毒的人。\n或在受影响的情况下犯下众多罪行的人，或因为他们只是人类的恶棍而犯下了\n罪行，因为他们只是因为纯粹的私欲而成为人类的恶棍。\n纯粹的私欲，但后来改变了他们的生活。",
      "title": "为什么那些做了糟糕的生活决定的人，当他们最终扭转了他们的生活时，不管是他们自己的选择，还是因为法律的强制执行，都会得到特殊的待遇，而那些一开始就有意识地远离错误决定的人，从来没有得到任何形式的承认？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那些因濫用毒品或酒精而多次入獄或戒毒的人。\n或在受影響的情況下犯下衆多罪行的人，或因爲他們只是人類的惡棍而犯下了\n罪行，因爲他們只是因爲純粹的私慾而成爲人類的惡棍。\n純粹的私慾，但後來改變了他們的生活。",
      "title": "爲什麼那些做了糟糕的生活決定的人，當他們最終扭轉了他們的生活時，不管是他們自己的選擇，還是因爲法律的強制執行，都會得到特殊的待遇，而那些一開始就有意識地遠離錯誤決定的人，從來沒有得到任何形式的承認？"
    }
  ]
}