{
  "author": "xs_alisa",
  "original_created_utc": 1631976101,
  "title": "Am I intolerant for hating religion?",
  "created_utc": 1631989192,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I despise each and every religion, practicing people almost always seem like they&#39;re unhappy and uneducated to a degree. I know that there are millions and millions of smart and good religious people, but I really think they could achieve even more if it were not for their religion. </p>\n\n<p>I think it can be a good thing for some people, but where I live people take their religion to an unhealthy extreme and use it to cover for their heinous acts. I think that it&#39;s ridiculous how being an islamaphobe is compared to hating women or gay people when most of the Muslims I&#39;ve talked to are not good people at heart. </p>\n\n<p>Keep in mind I have only ever lived in Muslim countries and I&#39;ve never seen anyone do anything good in the name of their cult, only bad.</p>\n\n<p>I&#39;m not going to go on a rant on cherry pickers, and how the bible doesn&#39;t really exist because I&#39;m not here to try disprove religion, in the end i think it should be a choice. But I don&#39;t think that people who choose themselves and a god over their daughters, sons, families, and innocent people&#39;s lives are not good people. </p>\n\n<p>I&#39;m good friends with many religious people who interpret their religion in a peaceful way, i respect that and have considered doing the same. However i don&#39;t consider this to be accurate to any given religion. I mentioned Islam particularly as i am most familiar with it, and i see it get defended all the time, when it is obviously not any more peaceful and kind than catholicism or other Orthodox religions.</p>\n\n<p>Edit:\nI want to make an edit to clarify some things, after reading the comments I can see where i was ignorant and want to make my stance clear, so here goes:\nI have nothing against religious people who have the right intentions, and I now recognize that religion can do a lot of good to help people better themselves, and do good things. I have a problem with specific things that are unfortunately swept under the rug in certain religious groups, things like child abuse, honor killings, forced marriage, domestic abuse, homophobia, and a patriarchal system. </p>\n\n<p>My judgement has been clouded with daily horrific news of the above mentioned things Happening, and with no consequences, so I mistakenly assumed that this was the norm for everyone, when it only exists in specific places, and withing specific groups.</p>\n\n<p>A lot of really bad people use religion to justify their actions, and are not afraid of the law, and while this should be spoken about, someone made a comment how things like this aren&#39;t exclusive to religion, which is true.</p>\n\n<p>I have read some of the qoran and parts of the bible and the only thing i can confidently criticize is the issue of domestic and child abuse that exists in most religions and is either recommended, or goes unpunished. This is the type of thing i take issue with, not theism in itself. I have a problem when human rights are ignored, not when people believe in what they want.</p>\n\n<p>What i want to clarify is that i don&#39;t hate religious people, i hate fundamentalists, and extremists, who use religion to justify and excuse awful things. I hate religious institutions, not peaceful, kind hearted people. It is only now dawning on me that the majority of the Muslim population in my home country are extremists, so I was  misleading in my phrasing and I am truly sorry for grouping a vast group of different people together</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/pqnnzk/am_i_intolerant_for_hating_religion/",
  "subreddit": "TooAfraidToAsk",
  "id": "pqnnzk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I despise each and every religion, practicing people almost always seem like\nthey're unhappy and uneducated to a degree. I know that there are millions and\nmillions of smart and good religious people, but I really think they could\nachieve even more if it were not for their religion.\n\nI think it can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はあらゆる宗教を軽蔑していますが、宗教を実践している人はほとんどの場合、不幸で無教養な人のように見えます。\nある程度、不幸で無教養な人が多いように思います。何百万人もの賢くて良い宗教家がいることは知っています。\nしかし、もし宗教がなければ、彼らはもっと多くのことを達成できると思います。\nもし宗教がなければ、もっと多くのことを達成できると思います。\n\n私が思うに、それは...",
      "title": "宗教を嫌うことは不寛容なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我鄙视每一种宗教，信奉宗教的人几乎总是看起来像\n他们在某种程度上是不快乐的，没有受过教育的。我知道，有数以百万计的\n我知道有数以百万计的聪明和优秀的宗教人士，但我真的认为他们可以\n如果不是因为他们的宗教，他们可以取得更大的成就。\n\n我认为它可以...",
      "title": "我憎恨宗教是不宽容的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我鄙視每一種宗教，信奉宗教的人幾乎總是看起來像\n他們在某種程度上是不快樂的，沒有受過教育的。我知道，有數以百萬計的\n我知道有數以百萬計的聰明和優秀的宗教人士，但我真的認爲他們可以\n如果不是因爲他們的宗教，他們可以取得更大的成就。\n\n我認爲它可以...",
      "title": "我憎恨宗教是不寬容的嗎？"
    }
  ]
}