{
  "author": "M00OSE",
  "original_created_utc": 1638322787,
  "title": "Breaking down 'too good to be true' Defi rates – where's the money from, is it sustainable, and what's the catch?",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Money doesn&amp;#39;t just grow on &lt;del&gt;trees&lt;/del&gt; blockchains, not even &lt;em&gt;magic internet money&lt;/em&gt;. And yet some defi applications are offering astronomical rates. For this post, I&amp;#39;ll break down three common types of protocols and answer the following questions: &lt;em&gt;where&amp;#39;s the money from? Is it sustainable? And what&amp;#39;s the catch?&lt;/em&gt;&lt;/p&gt;\n\n&lt;h1&gt;Lending and Borrowing&lt;/h1&gt;\n\n&lt;p&gt;Examples; Aave, Anchor, Geist, Solend&lt;/p&gt;\n\n&lt;p&gt;Typical rates: Less than 10% net&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Where&amp;#39;s the money from?&lt;/strong&gt; Similar to a bank, users deposit money into the protocol, which is then used by borrowers. To borrow money, users have to pay an interest rate and also deposit collateral into the protocol. The main source of revenue is sourced from the interest borrowers have to pay. Some protocols also stake the collateral that users deposit and earn extra income from that.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Is it sustainable?&lt;/strong&gt; Most lending rates aren&amp;#39;t actually that high (2% to 20%) since they are usually balanced out by the borrowing rates at an equivalent rate. So the main question here is, &lt;em&gt;why are people lending/borrowing?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Beyond earning deposit fees, people lend because the majority of defi requires users to hold assets that they would otherwise not want to hold.  If a user wanted to use defi while holding the assets that they prefer to hold like BTC and ETH, they would deposit their assets as collateral and borrow against it.&lt;/p&gt;\n\n&lt;p&gt;People borrow because they can earn a yield higher than the rate they&amp;#39;re paying to borrow. You could for example, borrow a stablecoin at a 10% borrow rate and then deposit the borrowed funds into a stablecoin liquidity pool that earns you 20%. You keep the extra 10%.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What&amp;#39;s the catch?&lt;/strong&gt; If you&amp;#39;re not borrowing, the rates are oftentimes very low and you&amp;#39;re likely better off staking an asset than lending or even using Cefi. For example, the largest lending/borrowing dapps are Aave, Compound, or Cream and they only offer &lt;strong&gt;&amp;lt;3%&lt;/strong&gt; for ETH whereas ETH Cefi rates are &lt;strong&gt;~6%&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;If you are borrowing, there&amp;#39;s no bank to hold your hand and no bailouts. If your collateral falls below a certain amount, the protocols deems you ineligible to pay off your loan and you get liquidated. This can happen if the market falls and you&amp;#39;re not watching your funds. However, there are protocols that now allow for liquidity-free lending/borrow.&lt;/p&gt;\n\n&lt;h1&gt;Liquidity Pools (LPs)&lt;/h1&gt;\n\n&lt;p&gt;Examples: Uniswap, Curve, Serum, Raydium, TraderJoe, SpookySwap, Quickswap&lt;/p&gt;\n\n&lt;p&gt;Typical rates: 20% to 40% net (for stablecoins, BTC, and ETH)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Where&amp;#39;s the money from?&lt;/strong&gt; When you use decentralize exchanges (dexes), there are liquidity provider fees that typically charge 0.25% of trades. The trading fee is the main source of income for LPs.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Is it sustainable?&lt;/strong&gt; At its current state, most LPs are not sustainable. While the demand for LPs like ETH-DAI is pretty straightforward, demand for LPs with, sometimes obscure, protocol or farm tokens are not as clear. Oftentimes, they rely on circular dependencies, ie &lt;em&gt;finance for the sake of finance.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;As an example, let&amp;#39;s take a look at how degen yield farming typically happens:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Protocols offer a 1,000% rate for FARM-DAI LP providers&lt;/li&gt;\n&lt;li&gt;Higher rates mean higher inflation, which means the value of the FARM token tend to decrease&lt;/li&gt;\n&lt;li&gt;But the high rate creates demand for the FARM token as users have to buy FARM to join the LP&lt;/li&gt;\n&lt;li&gt;The high demand pumps the price of the FARM token and offsets the high inflation&lt;/li&gt;\n&lt;li&gt;But as the LP participants grow, the rates decrease&lt;/li&gt;\n&lt;li&gt;Lower rates cause lower demand, which means prices are no longer getting pumped&lt;/li&gt;\n&lt;li&gt;At some point, the farm reaches a stage where both prices and rates are going down&lt;/li&gt;\n&lt;li&gt;And when that happens, degens who are merely looking for quick money, tend to leave&lt;/li&gt;\n&lt;li&gt;More and more people leaving and selling the token causes the price to drop&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;For most farms, specifically &amp;quot;degen farms&amp;quot;, prices spike early making the LP seem more profitable than it actually is and then high inflation does its thing to prices slowly but surely fall. Most users enter and leave farms within 3 days to capture the parabolic price action and high rewards.&lt;/p&gt;\n\n&lt;p&gt;Protocols can avoid this by providing a legitimate use case for the FARM token beyond just earning a high yield. For pure LP protocols, the use cases are typically governance, which is not very appealing for retail who couldn&amp;#39;t care any less about how some protocols are governed.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What&amp;#39;s the catch?&lt;/strong&gt; Even if the LP rates are very high, a drastic enough drop in price can offset the gains earned from the reward rate. This is especially true for users who were late and were not able to accumulate the rewards. This is why it&amp;#39;s often recommended to look into the price action and avoid making decisions based off of rates alone.&lt;/p&gt;\n\n&lt;p&gt;LPs, specifically low liquidity ones, are also especially vulnerable to whales who can often cause spikes–both in the upside, when buying, and the downside, when selling. And large spikes can cause a domino effect of mass selling and whoever is left holding the bag gets rekt.&lt;/p&gt;\n\n&lt;p&gt;Beyond this, impermanent loss (IP) is the most obvious catch. Participating in LPs typically requires you to split your assets meaning you may be exposed to undesired price action. But there are several ways to avoid or mitigate IP such as participating in stablecoin LPs or LPs with relatively low volatility, ie BTC or ETH. In addition, there&amp;#39;s a lot of work going into new protocols to limit the impact of impermanent loss.&lt;/p&gt;\n\n&lt;h1&gt;Reserve Currencies&lt;/h1&gt;\n\n&lt;p&gt;Examples: Olympus DAO, Wonderland, KlimaDAO&lt;/p&gt;\n\n&lt;p&gt;Typical rates: 6,000% to 8,000% (current)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Where&amp;#39;s the money from?&lt;/strong&gt; Reserve currencies are brought at a premium that&amp;#39;s worth several magnitudes (8-10x) more than the intrinsic value of the token. New tokens are minted at an extremely high rate and then distributed as a reward to stakers. A combination of selling at a high premium and minting at a high rate leads to the high APYs.&lt;/p&gt;\n\n&lt;p&gt;But, similar to how LPs work, high distribution –&amp;gt; high inflation –&amp;gt; lower prices. At the same time, high rates –&amp;gt; high participation –&amp;gt; lower rates. The expectation is for both rewards to slowly decrease to a target rate of 1,000%. The goal is to accumulate long-term participants because long time horizons would ensure that staking rewards eventually offsets price action.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Is it sustainable?&lt;/strong&gt; Under the hood, the economics are designed similar to LPs. But LPs are often subject to the notion of &lt;em&gt;finance for the sake of finance&lt;/em&gt; because the only product is often the high yields offered. Reserve currencies have a secondary revenue generating product: bonds, which are means for protocols to accumulate their own liquidity. So the question to be asked here is &lt;em&gt;why is there a demand for bonds?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Bonds allow for protocol-owned liquidity, seeking to address the aforementioned issues that often make LPs unsustainable. Instead of protocols renting liquidity to mercenary users who come and go looking for the highest yields, bonding allows protocols to own their own liquidity and provide a sense of stability. This reduces the need for protocols to constantly offer unsustainably high rates in order to incentivize users to participate in their LP. In addition, it allows protocols to earn their own LP fees, which can give them another source of revenue.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;What&amp;#39;s the catch?&lt;/strong&gt; LP protocols actually incur some costs in exchange for partnering with the bonding program of a reserve currency protocol. And while reserve protocols offer users with more incentives to become long-term participants, they can still always exit and sell the LPs. This may the case during volatile swings.&lt;/p&gt;\n\n&lt;p&gt;On the user end, buying bonds usually isn&amp;#39;t worth it primarily because reserve protocols typically requires users to wait a certain interval (3-7 days, etc.) while holding the LPs. This presents some risks because the LPs can drop in value and, thus, offset the discounts. Additionally, if users buy the reserve currency token directly, they can immediately maximize the staking yields, which are also often higher than the discounts.&lt;/p&gt;\n\n&lt;p&gt;Overall, the long-term utility of the reserve protocol hinges on the demand for bonds. Most reserve currencies are still very new so only time will tell moving forward. Beyond questioning the bonds, reserve currencies are still vulnerable to bank runs, however these risks are designed to be mitigated with how the protocol works.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I know this was a long post so kudos to anyone who managed to read all throughout. These are not the only types of protocols available in defi, there are tons more that are either stark variations or completely unique. I hope you all learned something!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1249,
  "permalink": "/r/CryptoCurrency/comments/r636b6/breaking_down_too_good_to_be_true_defi_rates/",
  "subreddit": "CryptoCurrency",
  "id": "r636b6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Money doesn't just grow on trees blockchains, not even magic internet money. And\nyet some defi applications are offering astronomical rates. For this post, I'll\nbreak down three common types of protocols and answer the following questions:\nwhere's the money from? Is it sustainable? And what's the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お金は木に生えるだけではありません ブロックチェーン、魔法のインターネットマネーでもありません。そして\nしかし、一部のデファイ・アプリケーションは天文学的なレートを提示している。この記事では、次のことを説明します。\nよくある3つのタイプのプロトコルを分解し、以下の質問に答えます。\nそのお金はどこから来るのか？それは持続可能か？そして、それは何なのか...",
      "title": "お得すぎるDefiレートを検証する - お金はどこから来るのか、それは持続可能なのか、そして何が問題なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "钱不只是长在树上的区块链，甚至连神奇的互联网钱也不是。而\n然而，一些defi应用正在提供天文数字的利率。在这篇文章中，我将\n分解三种常见的协议类型，并回答以下问题。\n钱从哪里来？它是可持续的吗？以及什么是...",
      "title": "剖析 \"好得不能再好 \"的Defi利率--钱从哪里来，是否可持续，以及有什么好处？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "錢不只是長在樹上的區塊鏈，甚至連神奇的互聯網錢也不是。而\n然而，一些defi應用正在提供天文數字的利率。在這篇文章中，我將\n分解三種常見的協議類型，並回答以下問題。\n錢從哪裏來？它是可持續的嗎？以及什麼是...",
      "title": "剖析 \"好得不能再好 \"的Defi利率--錢從哪裏來，是否可持續，以及有什麼好處？"
    }
  ]
}