{
  "author": "JoacoFerna24",
  "the_new_excerpt": "Hello everyone, this is going to be an exhaustive and long analysis, as long and\nexhaustive as my knowledge will allow me. All your comments or suggestions are\nmore than welcome, good, or bad, but the important thing is that they contribute\nto the case.\n\nDisclaimer: I´m not even close to being a…",
  "original_created_utc": 1616370239,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，这将是一个详尽而漫长的分析，因为长而\n在我的知识允许的情况下，详尽地介绍一下。您的所有意见或建议\n更受欢迎，好的，或坏的，但重要的是，他们贡献了。\n的情况下。\n\n免责声明：我根本不是... ...",
      "title": "$BNGO Bionano Genomics DD--基因组学的未来已经到来。为什么我100%看好。巨大的上升潜力"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，這將是一個詳盡而漫長的分析，因爲長而\n在我的知識允許的情況下，詳盡地介紹一下。您的所有意見或建議\n更受歡迎，好的，或壞的，但重要的是，他們貢獻了。\n的情況下。\n\n免責聲明：我根本不是... ...",
      "title": "$BNGO Bionano Genomics DD--基因組學的未來已經到來。爲什麼我100%看好。巨大的上升潛力"
    }
  ],
  "title": "$BNGO Bionano Genomics DD – The future of genomics is here. Why I am 100% bullish. HUGE Upside potential",
  "created_utc": 1616384082,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone, this is going to be an exhaustive and long analysis, as long and exhaustive as my knowledge will allow me. All your comments or suggestions are more than welcome, good, or bad, but the important thing is that they contribute to the case.</p>\n\n<p><em>Disclaimer: I´m not even close to being a financial advisor so please do your research and make your own decisions based on what you understand.</em></p>\n\n<p><em>Before you ask, I firstly bought 10,000 shares of $BNGO at 1.89. Sold 5,000 at 8.49 and the other 5,000 at 13,59. I now bought 10,000 shares on the latest dip at 6.06.</em></p>\n\n<p>ONE MORE DISCLAIMER: This DD was firstly made with images that I had to remove to fit the subreddit so sorry for some extra links.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>About the company:</strong></p>\n\n<p><strong>BioNano Genomics</strong> is a company committed to unlocking the understanding of genome biology to advance the promise of genomics in areas including cancer and human disease, agricultural bioengineering, and genome discovery. Their next-generation genome mapping and analysis tools help researchers see true genome structure to fill in what’s missing from sequencing-based data. <strong>Saphyr</strong>, their high-speed, high-throughput whole-genome mapping solution, offers unmatched structural variation discovery capabilities and the ability to construct the most complete genome assemblies.</p>\n\n<p><strong>Price Target and Analysts Recommendations:</strong></p>\n\n<p>Three buys and one hold from analysts covering the stock. Oppenheimer&#39;s analyst Kevin DeGeeter maintained a <strong>Buy rating</strong> on February 2021, setting a price target of <strong>$15</strong> which is approximately <strong>75%</strong> above today´s share price of $8.59 (03/18/2021).</p>\n\n<p>DeGeeter expects BioNano Genomics Inc to post earnings per share (EPS) of -$0.08 for the first quarter of 2021.</p>\n\n<p><a href=\"https://www.investing.com/news/oppenheimer-stick-to-their-buy-rating-for-bionano-genomics-inc-2411677\"><em>https://www.investing.com/news/oppenheimer-stick-to-their-buy-rating-for-bionano-genomics-inc-2411677</em></a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Price Target:</strong> </p>\n\n<p><a href=\"https://www.barchart.com/stocks/quotes/BNGO/analyst-ratings\">https://www.barchart.com/stocks/quotes/BNGO/analyst-ratings</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Short, Medium- and Long-Term Indicators:</strong></p>\n\n<p>Barchart´s Opinion on the indicators is to hold, 50% buy and 100% buy respectively.</p>\n\n<p><a href=\"https://www.barchart.com/stocks/quotes/BNGO/opinion\">https://www.barchart.com/stocks/quotes/BNGO/opinion</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Management &amp; CEO:</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>CEO Erik Holmlin</strong></p>\n\n<p>He has twenty years of experience developing innovative solutions and companies in the life sciences and health care industries. In 2001, Erik led the formation and financing efforts of GeneOhm Sciences, Inc. and orchestrated the company’s acquisition by Becton Dickinson in 2006.</p>\n\n<p><strong>COO Mark Oldakowski</strong></p>\n\n<p>Mark has a 20-year history of success in the development of systems for the life sciences and medical device industries. Before joining Bionano Genomics, Mark led a global team at Brooks Life Science Systems in the development of sample analyzers, high-throughput screening solutions, and chemical storage and biobank systems. Before his time at Brooks, Mark was with Affymetrix, where he launched the array platform that is widely used today for GWAS and other genomics applications.</p>\n\n<p><strong>CFO Christopher Stewart</strong></p>\n\n<p>Christopher is a seasoned leader with over 20 years of experience spanning finance, accounting, and strategic planning for many commercial-stage operating businesses.</p>\n\n<p>Chris has served in several executive roles in both private and public companies as Controller, V.P. of Finance, and CFO. He also has experience with major financing events, acquisitions, and scaling revenues in high-growth tech companies. He joined Bionano from Tesla, where he served as Head of the Maxwell Ultracapacitors business unit after Maxwell Technology was acquired by Tesla.</p>\n\n<p><strong>CMO Alka Chaubey, PhD, FACMG</strong></p>\n\n<p>Alka is double board-certified in clinical cytogenetics/genomics and clinical molecular genetics/genomics by the American Board of Medical Genetics and Genomics (ABMGG).</p>\n\n<p>Previously, she was the Head of Cytogenomics at PerkinElmer Genomics, where Dr. Chaubey led the successful development and launch of several innovative products including the CNGnome test (low-pass whole genome sequencing), and a new FSHD assay utilizing Saphyr. She has also played an integral role on the Vanadis team at PerkinElmer in their efforts to bring a new PCR-free NIPT technology to the market. Prior to PerkinElmer Genomics, Dr. Chaubey was the Director of the Cytogenomics Laboratory at the Greenwood Genetic Center, SC, USA.</p>\n\n<p><strong>Board of Directors:</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Chairman Dr. David L. Barker, Ph.D.,</strong></p>\n\n<p>Has served on our Board of Directors since May 2010, and as Chairman of our Board of Directors since August 2016. Dr. Barker also serves as a director of AmideBio, Singular Genomics Systems, and Aspen Neuroscience.</p>\n\n<p><strong>President Erik Holmlin</strong> (mentioned above)</p>\n\n<p><strong>Director Albert Luderer</strong></p>\n\n<p>Has three decades of experience in biotechnology, with special focuses on technology, business development, and commercialization.</p>\n\n<p><strong>Director Christopher J. Twomey</strong></p>\n\n<p>Has served on the board of directors since July 2018.</p>\n\n<p><strong>Director Kristiina Vuori, MD, PhD</strong></p>\n\n<p>Has served on the board of directors since June 2019.</p>\n\n<p><strong>Director Hannah Mamuszka</strong></p>\n\n<p>Is the founder and Chief Executive Officer of Alva10, an advisory firm focused on creating partnerships between payors and diagnostic companies to increase the value of diagnostic technology, which she founded in March 2016.</p>\n\n<p><strong>Director Yvonne Linney, PhD</strong></p>\n\n<p>Founded Linney BioConsulting, an advisory and strategy development firm in the life sciences industry, in January 2019.</p>\n\n<p><strong>Financials:</strong></p>\n\n<p>The last earnings posted by Bionano was on the 13th of November, 2020. The consensus was ($0.06) and the reported ($0.08). They will report their Q4 financials for 2020 this Tuesday after the market close. The Consensus Estimate is ($0.05) and <strong>in my opinion, there will be a surprise considering 2021 has been a breakthrough year for them.</strong></p>\n\n<p><a href=\"https://www.marketbeat.com/stocks/NASDAQ/BNGO/earnings/\">https://www.marketbeat.com/stocks/NASDAQ/BNGO/earnings/</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>PUT / CALL Ratio:</strong></p>\n\n<p>Bionano currently has 0.49 put/call ratio which denotes a bullish sentiment that over the months and years becomes more and more bullish.</p>\n\n<p><a href=\"https://www.barchart.com/stocks/quotes/BNGO/put-call-ratios\">https://www.barchart.com/stocks/quotes/BNGO/put-call-ratios</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Share Statistics:</strong></p>\n\n<p><a href=\"https://finance.yahoo.com/quote/BNGO/key-statistics?p=BNGO\">https://finance.yahoo.com/quote/BNGO/key-statistics?p=BNGO</a></p>\n\n<p>&#x200B;</p>\n\n<p>If we focus on the <strong>short ratio</strong> we can be calm that shorts are not betting against this company to fall.</p>\n\n<p>We do see a very low percentage of shares owned by Insiders and Institutions. On the 25th of January, 2021, their CFO Christopher Stewart bought 64,500 shares. Insider buying is generally a positive prognostic and beneficial for the stock&#39;s price. Also, when insiders buy stock, less stock is available to the public. If the investing public meets this decreased supply with increased demand, the stock price rises. This might be the start of some Insiders movements in my opinion.</p>\n\n<p>Moving onto Institutional ownership, Vanguard Group Inc., bought over 7.1 million shares at the end of 2020. They are the largest provider of mutual funds and the second-largest provider of exchange-traded funds (ETFs) in the world after BlackRock&#39;s iShares.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Competitors:</strong></p>\n\n<p>&#x200B;</p>\n\n<p>The main three competitors are Fulgent Genetics Inc. ($FLGT), Twist Bioscience Corp. ($TWST), and NeoGenomics Inc. ($NEO).</p>\n\n<p>Comparing their prices the lowest is after BNGO is NEO with 50.18 per share, FLGT at 105.96 per share, and TWST sitting at 130.29 per share.</p>\n\n<p>Price aside, let&#39;s talk about <strong>Bionano&#39;s Saphyr</strong> characteristics that can put them above their competition.</p>\n\n<p>- Bionano’s Saphyr system is a research use-only platform for ultra-sensitive and ultra-specific structural variation detection that enables researchers and clinicians to accelerate the search for new diagnostics and therapeutic targets and to streamline the study of changes in chromosomes, which is known as cytogenetics.</p>\n\n<p>- Bionano provides genome analysis services to provide access to data generated by the Saphyr system for researchers who prefer not to adopt the Saphyr system in their labs.</p>\n\n<p>- A publication of a study by the Human Genome Structural Variation Consortium (HGSVC) revealing that their sequencing method based on PacBio HiFi reads detected only 72% of the large SVs that Bionano’s optical genome mapping (OGM) detected across 32 different human genomes. The consortium developed its custom sequencing method by combining sequencing with PacBio and the single-strand prep and sequencing method StrandSeq to establish a comprehensive catalog of human SVs with base-pair and haplotype resolution. The cost of this method is estimated, based on list pricing, to be between $10,000 and $20,000 per genome. <strong>OGM with Saphyr, which costs less than $500 per genome, was shown to be significantly more sensitive than the sequencing method.</strong></p>\n\n<p>- With the latest update to Saphyr’s software released this week, the instrument can now generate clinical quality SV calls on 12 samples per day per instrument and up to 96 samples per week. For cases requiring higher coverage, like mosaic samples or heterogeneous tumors, the run can be extended up to 24 hours to collect as much as 400x coverage of a human genome for each of the three flowcells.</p>\n\n<p>- Per Erik Holmlin “By contrast, Saphyr images molecules that are consistently <strong>20 to 30 times longer than PacBio reads</strong>. Sequencing reads are not getting longer, which we believe implies that Saphyr will remain the only effective and affordable technology currently capable of detecting the structural rearrangements in the genome that are involved in the disease.”</p>\n\n<p><a href=\"https://www.globenewswire.com/news-release/2020/12/23/2149974/0/en/Publication-Reveals-in-Side-by-Side-Comparison-that-Method-Using-PacBio-Sequencing-Detects-Only-72-of-the-Large-Structural-Variants-Detected-by-Optical-Genome-Mapping-with-Saphyr.html\"><em>https://www.globenewswire.com/news-release/2020/12/23/2149974/0/en/Publication-Reveals-in-Side-by-Side-Comparison-that-Method-Using-PacBio-Sequencing-Detects-Only-72-of-the-Large-Structural-Variants-Detected-by-Optical-Genome-Mapping-with-Saphyr.html</em></a></p>\n\n<p>- Saphyr Chip Clip protects sample integrity and eliminates the need for instrument wash cycles between runs. Requires less than 3 minutes hands-on instrument time per chip. Automatic optimization of run conditions based on sample characteristics maximizes throughput.</p>\n\n<p>- The Bionano Prep DLS DNA labeling kit provides all the enzymes, dyes, and buffers you need to label non-amplified DNA for Saphyr. Controls for validating the labeling biochemistry are also provided.</p>\n\n<p><a href=\"https://bionanogenomics.com/products/saphyr/\"><em>https://bionanogenomics.com/products/saphyr/</em></a></p>\n\n<p>- In a paper published the 10th of November, 2020, in MedRxiv, a consortium of cytogenetic experts led by Dr. Brynn Levy, Professor of pathology and cell biology at Columbia University and Medical Director of the Clinical Cytogenetics Laboratory at New York Presbyterian Hospital recommended that optical genome mapping (OGM) using Bionano’s Saphyr System be considered as a first-line test for detection and identification of clinically relevant structural variants and copy number variants in leukemias.</p>\n\n<p><a href=\"https://www.medrxiv.org/content/10.1101/2020.11.07.20227728v1\"><em>https://www.medrxiv.org/content/10.1101/2020.11.07.20227728v1</em></a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Latests news:</strong></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Keep on Buying Bionano Stock, Says Analyst Following Healthcare Conference.</strong></p>\n\n<p>Validation studies of hematological malignancies and post-natal constitutional disorders have progressed nicely, and management anticipates having data from &quot;no-call&quot; reflex testing in NIPS (noninvasive prenatal screening) later this year and next year for solid tumors.</p>\n\n<p>The company said that via a combination of better hardware capabilities and software updates that lower the amount of consumables required for each run, Bionano can achieve the goal of a $100 per genome cost in the next-gen Saphyr.</p>\n\n<p>All in all, DeGeeter reiterates an Outperform (i.e. Buy) rating on BNGO shares along with a $15 price target. Investors are expected to pocket a 69% gain if the analyst’s thesis materializes.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/keep-buying-bionano-stock-says-184238222.html\"><em>https://finance.yahoo.com/news/keep-buying-bionano-stock-says-184238222.html</em></a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>Why Bionano Genomics (BNGO) Might Surprise This Earnings Season.</strong></p>\n\n<p>Bionano Genomics is seeing favorable earnings estimate revision activity as of late, which is generally a precursor to an earnings beat. After all, analysts raising estimates right before earnings — with the most up-to-date information possible — is a pretty good indicator of some favorable trends underneath the surface for BNGO in this report.</p>\n\n<p>The Most Accurate Estimate for the current quarter is currently at a loss of 5 cents per share for BNGO, compared to a broader Zacks Consensus Estimate of a loss of 6 cents per share. This suggests that analysts have very recently bumped up their estimates for BNGO, giving the stock a Zacks Earnings ESP of +9.09% heading into earnings season.</p>\n\n<p>A positive reading for the Zacks Earnings ESP has proven to be very powerful in producing both positive surprises and outperforming the market. Our recent 10-year backtest shows that stocks that have a positive Earnings ESP and a Zacks Rank #3 (Hold) or better show a positive surprise nearly 70% of the time, and have returned over 28% on average in annual returns.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/why-bionano-genomics-bngo-might-135301546.html\"><em>https://finance.yahoo.com/news/why-bionano-genomics-bngo-might-135301546.html</em></a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>TLDR &amp; My plan:</strong></p>\n\n<p>I´m currently holding 10k shares and don´t plan to increase my position unless I can get some liquidity tomorrow. The stock already reached $15.69 per share and I see this getting to that point again anytime soon. I plan to hold this long trying to sell high and re-buy on the dips, but mid and long-term show great strength.</p>\n\n<p>This is a great company with a great product, a product that is cheaper than its competition´s, with greater results and continuously expanding its detection range.</p>\n\n<p>Let me know what you think in the comments, if something needs to be added or you have medical knowledge that can add to this DD feel free to comment and I´ll add it.</p>\n</div><!-- SC_ON -->",
  "score": 218,
  "permalink": "/r/investing/comments/ma9f0t/bngo_bionano_genomics_dd_the_future_of_genomics/",
  "subreddit": "investing",
  "id": "ma9f0t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819533
}