{
  "author": "Pashahlis",
  "original_created_utc": 1636834562,
  "title": "[META?] \"The Nazis improved the economy\", \"Clean Wehrmacht\", \"The Wehrmacht had the best tanks and was a highly mechanised army\" ... are but some of the popular history falsehoods that seem to just not want to die. How do historians deal with that?",
  "created_utc": 1636843637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;The Nazis improved the economy&quot;, &quot;Clean Wehrmacht&quot;, &quot;The Wehrmacht had the best tanks and was a highly mechanised army&quot; ... are but some of the popular history falsehoods that seem to just not want to die.</p>\n\n<p>The Nazis built an economy on debt and theft of Jewish property that was close to bankcruptcy before the war, yet it is a very popular belief that &quot;the Nazis werent 100% bad, they also dis good things, like build up the economy!&quot;</p>\n\n<p>The Wehrmacht was deeply involved in the warcrimes, yet it is a popular belief that they were mostly clean of sin and just apolitical draftees that didnt do nothing.</p>\n\n<p>The Nazi tanks that get the most praise, such as the Tiger and the Panther, were overengineered and had many mechanical problems, yet somehow are seen as the best tanks of the war. The Wehrmacht is seen as this highly efficient and mechanized force, despite being largely horse drawn (to a higher percentage than most of their major adversaries even).</p>\n\n<p>Most of these false beliefs stem directly from Nazi propaganda and the fact that Nazi generals were allowed to have a large influence on the post-war perception on their, and the Wehrmachts, performance during the War, because their memoirs were used as the primary source.</p>\n\n<p>Of course, for decades now much research has existed that busts all these myths. Yet thanks to the Internet these myths are more popular than ever and just dont seem to want to die.</p>\n\n<p>For every video there is on YouTube debunking this stuff, 10 more videos peddling the same falsehoods pop up.</p>\n\n<p>And this is not just in relation to myths about the Nazis. This can be seen in many other areas of history, too, such as &quot;The Roman Empire fell due to cultural decadence&quot; or &quot;the Civil War was about states rights&quot;. Its everywhere. </p>\n\n<p><strong>How do historians deal with that? How do they combat this spread of misinformation? What do they think about the chances of ever successfully eliminating most of the popular history falsehoods? Do they think its hopeless?</strong></p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/qt96jw/meta_the_nazis_improved_the_economy_clean/",
  "subreddit": "AskHistorians",
  "id": "qt96jw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"The Nazis improved the economy\", \"Clean Wehrmacht\", \"The Wehrmacht had the best\ntanks and was a highly mechanised army\" ... are but some of the popular history\nfalsehoods that seem to just not want to die.\n\nThe Nazis built an economy on debt and theft of Jewish property that was close\nto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナチスは経済を向上させた」、「清潔な国防軍」、「国防軍は最高の戦車を持ち、高度に機械化された軍隊であった」...などは、一般的な歴史の一部です。\n戦車を持ち、高度に機械化された軍隊であった」...などは、人気のある歴史上のデマの一部です。\n死にたくないと思っているようなデマです。\n\nナチスは、借金とユダヤ人の財産の窃盗で経済を構築しましたが、その経済規模はほぼ\nにしています。",
      "title": "[ナチスは経済を向上させた」、「清潔なドイツ国防軍」、「ドイツ国防軍は最高の戦車を持ち、高度に機械化された軍隊であった」...これらは、人気のある歴史上のデマの一部ですが、これらのデマは死ぬことを望んでいないようです。歴史家はこれにどう対処するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"纳粹改善了经济\"，\"干净的国防军\"，\"国防军拥有最好的\n坦克，是一支高度机械化的军队\"......这些都是流行的历史中的一些\n谎言，它们似乎就是不想死。\n\n纳粹在债务和偷窃犹太人财产的基础上建立了一个经济，这接近于\n的经济。",
      "title": "[META?] \"纳粹改善了经济\"，\"干净的国防军\"，\"国防军拥有最好的坦克，是一支高度机械化的军队\"......这些只是一些流行的历史谬论，似乎就是不想死。历史学家是如何处理这个问题的呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"納粹改善了經濟\"，\"乾淨的國防軍\"，\"國防軍擁有最好的\n坦克，是一支高度機械化的軍隊\"......這些都是流行的歷史中的一些\n謊言，它們似乎就是不想死。\n\n納粹在債務和偷竊猶太人財產的基礎上建立了一個經濟，這接近於\n的經濟。",
      "title": "[META?] \"納粹改善了經濟\"，\"乾淨的國防軍\"，\"國防軍擁有最好的坦克，是一支高度機械化的軍隊\"......這些只是一些流行的歷史謬論，似乎就是不想死。歷史學家是如何處理這個問題的呢？"
    }
  ]
}