{
  "author": "Pugnastyornah",
  "original_created_utc": 1637009908,
  "title": "Which crypto would you feel most confident in putting a large amount of money in and letting sit for 5 years?",
  "created_utc": 1637019243,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Which crypto would you feel most confident in putting a large amount of money in and letting sit for 5 years?</p>\n\n<p>You have a large amount of money for your standards. But you can only put all of the funds into 1 crypto. Then you can’t sell any of it for 5 years minimum. Which crypto would you chose? </p>\n\n<p>For the sake of argument, let’s say that you can live without those funds, you could buy more (but never sell or convert), you have other funds for other crypto trading, and if it’s something that you need for other transactions such as BNB you can lock up just the funds in question so that you can continue using other funds for those transactions. </p>\n\n<p>My personal pick would be catgirl… JUST KIDDING, it would probably be Quant based on use case and formal price predictions. I think it’s a solid investment with a decent market cap that leaves good room for growth.</p>\n\n<p><em>edit: this post was originally removed bc I included that it can’t be (E)(T)H or (B)(T)C and apparently they’ve been mentioned too much on this sub in the top 50 today; I’d still prefer other answers but if I get comments of those, then so be it lol</em></p>\n</div><!-- SC_ON -->",
  "score": 275,
  "permalink": "/r/CryptoCurrency/comments/quq8xk/which_crypto_would_you_feel_most_confident_in/",
  "subreddit": "CryptoCurrency",
  "id": "quq8xk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Which crypto would you feel most confident in putting a large amount of money in\nand letting sit for 5 years?\n\nYou have a large amount of money for your standards. But you can only put all of\nthe funds into 1 crypto. Then you can’t sell any of it for 5 years minimum.\nWhich crypto would you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大金を預けて5年放置しても大丈夫な暗号はどれですか？\n5年間放置しても大丈夫な暗号は？\n\nあなたの基準では大金を持っていますね。しかし、全資金を1つの暗号にしか投入できません。\n1つの暗号にしか資金を投入できません。そして、最低でも5年間は一切売ることができません。\nあなたならどの暗号を...",
      "title": "多額の資金を投入して5年間放置しても、最も安心できる暗号はどれですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你对将大量资金投入哪种加密货币最感兴趣？\n并放置5年？\n\n你有大量的资金，符合你的标准。但你只能把所有的\n资金放到一个加密货币中。那么你至少在5年内不能卖掉任何东西。\n你会选择哪种加密货币...",
      "title": "你对把大量资金投入并让其坐等5年最有信心的是哪种加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你對將大量資金投入哪種加密貨幣最感興趣？\n並放置5年？\n\n你有大量的資金，符合你的標準。但你只能把所有的\n資金放到一個加密貨幣中。那麼你至少在5年內不能賣掉任何東西。\n你會選擇哪種加密貨幣...",
      "title": "你對把大量資金投入並讓其坐等5年最有信心的是哪種加密貨幣？"
    }
  ]
}