{
  "author": "MichaelApproved",
  "original_created_utc": 1635260028,
  "title": "What does it mean to “solve” Einstein's field equations?",
  "created_utc": 1635275860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I read that Schwarzschild, among others, solved Einstein’s field equations. </p>\n\n<p>How could Einstein write an equation that he couldn&#39;t solve himself? </p>\n\n<p>The equations I see are complicated but they seem to boil down to basic algebra. Once you have the equation, wouldn&#39;t you just solve for X?</p>\n\n<p>I&#39;m guessing the source of my confusion is related to scientific terms having a different meaning than their regular English equivalent. Like how scientific &quot;theory&quot; means something different than a &quot;theory&quot; in English literature.</p>\n\n<p>Does &quot;solving an equation&quot; mean something different than it seems?</p>\n</div><!-- SC_ON -->",
  "score": 292,
  "permalink": "/r/askscience/comments/qg8579/what_does_it_mean_to_solve_einsteins_field/",
  "subreddit": "askscience",
  "id": "qg8579",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I read that Schwarzschild, among others, solved Einstein’s field equations.\n\nHow could Einstein write an equation that he couldn't solve himself?\n\nThe equations I see are complicated but they seem to boil down to basic algebra.\nOnce you have the equation, wouldn't you just solve for X?\n\nI'm guessing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アインシュタインの場の方程式を解いたのは、シュワルツシルトなどだと読みました。\n\nアインシュタインは、自分で解けない方程式をどうやって書いたのでしょうか？\n\n私が目にする方程式は複雑ですが、基本的な代数に集約されているようです。\n方程式ができたら、あとはXを解くだけではないでしょうか？\n\n推測ですが・・・。",
      "title": "アインシュタインの場の方程式を「解く」とはどういうことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读到，施瓦茨柴尔德等人解决了爱因斯坦的场方程。\n\n爱因斯坦怎么可能写出一个他自己都无法解决的方程呢？\n\n我看到的方程很复杂，但它们似乎可以归结为基本的代数。\n一旦你有了方程，你不就可以解出X了吗？\n\n我在猜测...",
      "title": "\"解决 \"爱因斯坦的场方程是什么意思？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀到，施瓦茨柴爾德等人解決了愛因斯坦的場方程。\n\n愛因斯坦怎麼可能寫出一個他自己都無法解決的方程呢？\n\n我看到的方程很複雜，但它們似乎可以歸結爲基本的代數。\n一旦你有了方程，你不就可以解出X了嗎？\n\n我在猜測...",
      "title": "\"解決 \"愛因斯坦的場方程是什麼意思？"
    }
  ]
}