{
  "author": "tradri3",
  "the_new_excerpt": "Is it crazy to think of Berkshire Hathaway as a way to invest in the broader\nstock market and do so in a low-cost and tax-advantaged way?\n\nTo me, it seems like the single stock that represents the closest thing to an\nETF, without having to worry about taxes and other costs associated with the…",
  "original_created_utc": 1623685300,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バークシャー・ハサウェイを、広く株式市場に投資し、低コストで税制優遇を受けられる方法と考えるのはおかしいでしょうか？\nバークシャー・ハサウェイを、低コストで税制優遇を受けながら、広く株式市場に投資する方法と考えるのはおかしいでしょうか？\n\n私には、バークシャー・ハサウェイこそが、ETFに最も近い銘柄のように思えます。\n私にとってバークシャー・ハサウェイは、税金やその他のコストを気にすることなく、ETFに最も近い形で投資できる銘柄のように思えます。",
      "title": "バークシャー・ハサウェイを低コスト・税制優遇のETFに"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "把伯克希尔-哈撒韦公司看作是投资于更广泛的股票市场的一种方式，这是不是很疯狂？\n以低成本和税收优惠的方式投资于更广泛的股票市场，这样做是否疯狂？\n\n对我来说，它似乎是最接近于ETF的单一股票。\nETF，而不必担心税收和其他与之相关的费用。",
      "title": "伯克希尔-哈撒韦公司作为一个低成本、税收优惠的ETF"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "把伯克希爾-哈撒韋公司看作是投資於更廣泛的股票市場的一種方式，這是不是很瘋狂？\n以低成本和稅收優惠的方式投資於更廣泛的股票市場，這樣做是否瘋狂？\n\n對我來說，它似乎是最接近於ETF的單一股票。\nETF，而不必擔心稅收和其他與之相關的費用。",
      "title": "伯克希爾-哈撒韋公司作爲一個低成本、稅收優惠的ETF"
    }
  ],
  "title": "Berkshire Hathaway as a low-cost, tax-advantaged ETF",
  "created_utc": 1623771264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Is it crazy to think of Berkshire Hathaway as a way to invest in the broader stock market and do so in a low-cost and tax-advantaged way?</p>\n\n<p>To me, it seems like the single stock that represents the closest thing to an ETF, without having to worry about taxes and other costs associated with the ETF structure.</p>\n\n<p>Am I completely wrong to think about Berkshire in that way, or is it OK to think/invest in it long-term like you would with an ETF?</p>\n</div><!-- SC_ON -->",
  "score": 37,
  "permalink": "/r/investing/comments/nzpoow/berkshire_hathaway_as_a_lowcost_taxadvantaged_etf/",
  "subreddit": "investing",
  "id": "nzpoow",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742345
}