{
  "author": "Jethroe1",
  "the_new_excerpt": "I am amazed at how quickly the authorities have \"awoken\" to the Apex Predator in\nthe room. I have always known why I'm in Bitcoin. For me, it has always been\naround the following core values:\n\nDecentralized, with no controlling authority. A finite supply. Freedom from\nbanks and debasement of what…",
  "original_created_utc": 1622474932,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、当局が部屋の中の頂点プレデターにいかに早く \"目覚めた \"かに驚いています。\n部屋の中で。自分がなぜビットコインをやっているのか、ずっとわかっていました。私にとって、それは常に\n次のような価値観を持っています。\n\n非中央集権的で、管理する機関がないこと。限りある供給。銀行からの自由\n銀行からの解放と、通貨の価値の低下...",
      "title": "\"インドがビットコインを禁止！\" Uh, NO. \"China bans Bitcoin\" Uh, NO. \"ナイジェリアはビットコインを禁止\" あー、違うね。ドルの蛇口に近い金権者たちがついにビットコインの正体に気づくと、終わりのない大混乱に陥ります。金融の拡大と中央銀行の権威に対する直接的な脅威です。シールドを張って、準備しましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对当局如此迅速地 \"醒悟 \"到房间里的 \"掠夺者 \"感到惊奇。\n房间里的大鳄。我一直都知道我为什么在比特币。对我来说，它一直都是\n围绕着以下的核心价值。\n\n去中心化，没有控制当局。有限的供应。不受\n银行和贬低的东西...",
      "title": "\"印度禁止比特币！\" 呃，没有。\"中国禁止比特币\" 呃，不。\"尼日利亚禁止比特币\" 呃，不。这是一场无休止的狗屎风暴，因为靠近美元水龙头的金钱利益集团终于看到了比特币的真面目。对货币扩张和中央银行权威的直接威胁。举起你的盾牌，做好准备。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對當局如此迅速地 \"醒悟 \"到房間裏的 \"掠奪者 \"感到驚奇。\n房間裏的大鱷。我一直都知道我爲什麼在比特幣。對我來說，它一直都是\n圍繞着以下的核心價值。\n\n去中心化，沒有控制當局。有限的供應。不受\n銀行和貶低的東西...",
      "title": "\"印度禁止比特幣！\" 呃，沒有。\"中國禁止比特幣\" 呃，不。\"尼日利亞禁止比特幣\" 呃，不。這是一場無休止的狗屎風暴，因爲靠近美元水龍頭的金錢利益集團終於看到了比特幣的真面目。對貨幣擴張和中央銀行權威的直接威脅。舉起你的盾牌，做好準備。"
    }
  ],
  "title": "\"India bans Bitcoin!\" Uh, NO. \"China bans Bitcoin\" Uh, NO. \"Nigeria bans Bitcoin\" Uh, NO. It's an endless shitstorm as moneyed interests close to the dollar spigot finally see Bitcoin for what it is: A direct threat to monetary expansion and Central bank authority. Put your shields up, and prepare.",
  "created_utc": 1622491843,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am amazed at how quickly the authorities have &quot;awoken&quot; to the Apex Predator in the room.  I have always known why I&#39;m in Bitcoin.  For me, it has always been around the following core values:</p>\n\n<p>Decentralized, with no controlling authority.  A finite supply.  Freedom from banks and debasement of what I&#39;ve worked hard to acquire.</p>\n\n<p>Saifedeen Ammous says without hesitation in &quot;The Bitcoin Standard&quot; that Bitcoin is a direct threat to Central Banks.  Many of us have danced around this issue, and tried to downplay where Bitcoin is going.  Even Saylor is careful to couch his answer to the repeated question, &quot;Is Bitcoin a threat to currencies and the Central Bank?&quot;</p>\n\n<p>I used to answer the same question with, &quot;The Central banks, and especially the FED, are too moribund and slow; hell, they can&#39;t even understand how--or the how important it is--to implement a CBDC.&quot;</p>\n\n<p>There is no doubt in my mind the authorities are fully awake now, and in attack mode.  Latest was Ms. Rowland with the Irish Central Bank just today attacking Bitcoin.  She is headed to the EU Central Bank to play a major oversight role.  Many here on Reddit have commented on the shitstorm of unprecedented proportions: crime, energy use, investors will lose all their money... .</p>\n\n<p>All of us are going to have to get a lot tougher.  Right now, the Bitcoin community is under attack, and it is not going to let up as adoption and success increase.  After this huge correction, which I personally feel was manipulated by many interests, the only way to be successful in the long run with Bitcoin is to &quot;circle the wagons together, and hold the line.&quot;    HODL</p>\n</div><!-- SC_ON -->",
  "score": 552,
  "permalink": "/r/Bitcoin/comments/np60n5/india_bans_bitcoin_uh_no_china_bans_bitcoin_uh_no/",
  "subreddit": "Bitcoin",
  "id": "np60n5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804295036
}