{
  "author": "take_eacy",
  "the_new_excerpt": "Softbank (SFTBF) CEO Masayoshi Son is the 2nd richest man in Japan. He is known\nfor being one of the early investors in Yahoo (bought in 1995) and Alibaba\n(1999) as well as the man behind the Vision Fund. The Vision Fund is the biggest\ntech VC fund in the world and has been an early investor in Uber…",
  "original_created_utc": 1623631042,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソフトバンク（SFTBF）のCEOである孫正義氏は、日本で2番目に裕福な人物です。孫氏は、Yahoo!\nヤフー（1995年に買収）やアリババ（1999年）への初期投資家の一人として知られています。\n1999年）の初期の投資家として知られています。ビジョン・ファンドは、世界最大の技術系VCファンドです。\nビジョン・ファンドは世界最大の技術系VCファンドであり、Uberの初期投資者でもあります。",
      "title": "どうせ「HODL！」するなら、2000年初頭のドットコム不況でソフトバンクの孫正義氏がやったように、99％の損失を出してもHODLする。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "软银（SFTBF）首席执行官孙正义是日本第二大富豪。他\n他是雅虎（1995年收购）和阿里巴巴（1999年）的早期投资者之一，也是愿景基金背后的人。\n(1999年)的早期投资者之一，也是愿景基金背后的人。愿景基金是美国最大的\n愿景基金是世界上最大的科技风险投资基金，也是Uber的早期投资者...",
      "title": "如果你要 \"HODL！\"，那就像软银首席执行官孙正义在2000年早期的互联网泡沫中那样，通过99%的损失来实现HODL。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "軟銀（SFTBF）首席執行官孫正義是日本第二大富豪。他\n他是雅虎（1995年收購）和阿里巴巴（1999年）的早期投資者之一，也是願景基金背後的人。\n(1999年)的早期投資者之一，也是願景基金背後的人。願景基金是美國最大的\n願景基金是世界上最大的科技風險投資基金，也是Uber的早期投資者...",
      "title": "如果你要 \"HODL！\"，那就像軟銀首席執行官孫正義在2000年早期的互聯網泡沫中那樣，通過99%的損失來實現HODL。"
    }
  ],
  "title": "If you're going to \"HODL!\", hodl through a 99% loss like Softbank CEO Masayoshi Son did in the early 2000 dotcom bust",
  "created_utc": 1623674360,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Softbank (SFTBF) CEO Masayoshi Son is the 2nd richest man in Japan. He is known for being one of the early investors in Yahoo (bought in 1995) and Alibaba (1999) as well as the man behind the Vision Fund. The Vision Fund is the biggest tech VC fund in the world and has been an early investor in Uber and DoorDash.</p>\n\n<p>Son is also known for being the man that lost the most money in human history (roughly $70 billion out of 76 billion of personal wealth in the 2000 dot com crash); Softbank crashed from $180 billion to 1.1 bil during that time as well. Now that the high flying Vision Fund has soared this past year (which 99% decrease in profits year-over-year in early 2020), it&#39;s obvious to see who Masayoshi Son really is.</p>\n\n<p>Son is the OG HODL-er, the real diamond hander, and the first &quot;this guy fucks.&quot;</p>\n\n<p>2 things to learn about HODL-ing from Son.</p>\n\n<ol>\n<li>If you&#39;re going to HODL, you better believe in what you&#39;re HODL-ing. Son was a huge believer in the future of the internet. DYOR and HODL only what you completely believe in. This helps you mentally prepare and commit to a reasonable investment plan. For example, my friend committed himself to buying XX dollars of ETH every $25 dollar drop in ETH price during the 2018 downturn.</li>\n<li>You can only HODL what you can totally throw away. This is the good old &quot;don&#39;t invest more than you can lose.&quot; Masayoshi Son could HODL so much only because he was already rich and could risk a lot.</li>\n</ol>\n\n<p>** This is not financial advice. This is merely entertainment material for moon-farming. Thank you for coming to my TED talk.</p>\n\n<p>Sources:</p>\n\n<p><a href=\"https://dealbook.nytimes.com/2010/12/13/a-key-figure-in-the-future-of-yahoo/\">Masayoshi Son: A Key Figure in the Future of Yahoo - The New York Times (nytimes.com)</a></p>\n\n<p><a href=\"https://finance.yahoo.com/news/softbank-surges-surpass-long-standing-061244282.html\">Masayoshi Son Just Pushed SoftBank Shares Past Dot-Com Peak (yahoo.com)</a></p>\n\n<p><a href=\"https://currently.att.yahoo.com/att/softbank-profits-plunge-99-dragged-065107556.html\">SoftBank profits plunge 99%, dragged down by Vision Fund losses (yahoo.com)</a></p>\n\n<p><a href=\"https://www.celebritynetworth.com/articles/entertainment-articles/meet-the-man-who-lost-the-most-money-in-human-history/\">Meet The Man Who Lost The Most Money In Human History | Celebrity Net Worth</a></p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/CryptoCurrency/comments/nzac1o/if_youre_going_to_hodl_hodl_through_a_99_loss/",
  "subreddit": "CryptoCurrency",
  "id": "nzac1o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738587
}