{
  "author": "SpaceMarxian",
  "the_new_excerpt": "I’ve heard that this was largely a financially motivated accusation/ lie\nleveraged by the monarch Phillip IV who used Pope Clement V as a mouthpiece\nbearing religious authority. However, elsewhere I’ve also heard that\ninscriptions of Aphrodite were made by the Knights Templar and that Baphomet…",
  "original_created_utc": 1618089693,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは主に経済的な動機に基づく告発・嘘だと聞いています。\nフィリップ4世が、宗教的権威を持つ教皇クレメンス5世を口利きして\n宗教的権威を持つ教皇クレメンス5世の口利きをした。しかし、別のところでは、次のようにも聞いています。\nアフロディーテの碑文はテンプル騎士団が作ったとか、バフォメットは...",
      "title": "テンプル騎士団が実際にキリスト教から逸脱して、ギリシャの汎神論やバフォメットのような異教の神々への信仰を取り入れたという証拠はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听说这很大程度上是出于经济动机的指控/谎言。\n腓力四世利用教皇克莱门特五世作为代言人\n具有宗教权威。然而，我在其他地方也听说过\n阿佛洛狄忒的铭文是由圣殿骑士团制作的，而巴弗梅特... ...",
      "title": "是否有任何证据表明圣殿骑士团实际上偏离了基督教，采用了希腊泛神论或信仰巴弗美特等异教神灵？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽說這很大程度上是出於經濟動機的指控/謊言。\n腓力四世利用教皇克萊門特五世作爲代言人\n具有宗教權威。然而，我在其他地方也聽說過\n阿佛洛狄忒的銘文是由聖殿騎士團製作的，而巴弗梅特... ...",
      "title": "是否有任何證據表明聖殿騎士團實際上偏離了基督教，採用了希臘泛神論或信仰巴弗美特等異教神靈？"
    }
  ],
  "title": "Is there any evidence that the Knights Templar actually deviated from Christianity and adopted Greek Pantheism or belief in Pagan deities like Baphomet?",
  "created_utc": 1618108561,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve heard that this was largely a financially motivated accusation/ lie leveraged by the monarch Phillip IV who used Pope Clement V as a mouthpiece bearing religious authority. However, elsewhere I’ve also heard that inscriptions of Aphrodite were made by the Knights Templar and that Baphomet was thought to be a misrendering of prophet Muhammad of the Mohammedans/ Muslims and that whilst they hadn’t converted to paganism that they’d adopted or converted with Islamic thought which would still be held to be blasphemous at the time. \nSo, I ask, what is the historical case that they actually did adopt esoteric, occult or non-Christian theology?</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/AskHistorians/comments/modc7l/is_there_any_evidence_that_the_knights_templar/",
  "subreddit": "AskHistorians",
  "id": "modc7l",
  "is_self": true,
  "media": null,
  "is_video": false
}