{
  "author": "Snoo65810",
  "original_created_utc": 1634981416,
  "title": "How much have you LOST in Crypto?",
  "created_utc": 1635008358,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Losses are part of the culture in Crypto but I don’t see them mentioned here. It seems that we are all successful astronauts. </p>\n\n<p>It’s the law of nature that there can’t be astronomical gains without astronomical losses so what gives? </p>\n\n<p>Ok Apes, let’s be a little bit more transparent in the space and also educate the youngsters, newbies and boomers that it is not all sunshine and roses. </p>\n\n<p>I will get the ball rolling. </p>\n\n<p>I lost $5000 in total! yes down the sewer, never to be seen again by me. Majority of this was in NFT’s and Ethereum’s Gas Fees. </p>\n\n<p>There was no avoiding it. At the time, a lot of big projects were releasing every day and I got caught up in the whirlwind, the only positive side is that I learnt from this (I hope) so it was a hurtful lesson but a lesson nonetheless.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qe1n0j/how_much_have_you_lost_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qe1n0j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Losses are part of the culture in Crypto but I don’t see them mentioned here. It\nseems that we are all successful astronauts.\n\nIt’s the law of nature that there can’t be astronomical gains without\nastronomical losses so what gives?\n\nOk Apes, let’s be a little bit more transparent in the space and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "損失はCryptoの文化の一部ですが、ここでは言及されていませんね。それは\n私たちは皆、成功した宇宙飛行士のようです。\n\n天文学的な損失を伴わない天文学的な利益はあり得ないのが自然の法則です。\n天文学的な損失なしに天文学的な利益はありえないというのが自然の法則です。\n\nよし、猿たちよ、宇宙ではもう少し透明性を高めよう。",
      "title": "あなたはCryptoでどれだけ損をしましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "损失是加密货币文化的一部分，但我没有看到这里提到它们。它\n似乎我们都是成功的宇航员。\n\n这是自然法则，不可能有天文数字的收益而没有\n天文数字的损失，那么是什么原因呢？\n\n好吧，猿人，让我们在太空中更透明一点，并...",
      "title": "你在加密货币中损失了多少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "損失是加密貨幣文化的一部分，但我沒有看到這裏提到它們。它\n似乎我們都是成功的宇航員。\n\n這是自然法則，不可能有天文數字的收益而沒有\n天文數字的損失，那麼是什麼原因呢？\n\n好吧，猿人，讓我們在太空中更透明一點，並...",
      "title": "你在加密貨幣中損失了多少？"
    }
  ]
}