{
  "author": "MyCryptoStuffAccount",
  "original_created_utc": 1638765898,
  "title": "Is it possible that “bull” and “bear” markets simply no longer apply to crypto?",
  "created_utc": 1638783337,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every spike it’s “bull market” this or that, and every crash it’s “bear market” blah blah. In the past we’ve definitely had clear bull and bear markets at various times, but when you look at the past year or so things have been far too erratic to call any of it “bull” or “bear” market. A &lt;em&gt;run&lt;/em&gt; maybe, but not a market. &lt;/p&gt;\n\n&lt;p&gt;Bull markets and bear markets are terms that were created for the stock market, not for crypto. Sure they’ve worked for crypto too so far, but crypto is new and evolving, and the ways it’s markets work are still growing and finding their own patterns. &lt;/p&gt;\n\n&lt;p&gt;We’ve seen crazy new all time highs in the past year or so, but we’ve also crashed dramatically from them. More than once. Maybe we’ve reached the point where crypto has simply become too erratic and too different from the stock market and the patterns we’re all used too for us to keep trying to conceive of it in old ways. &lt;/p&gt;\n\n&lt;p&gt;Maybe we need to stop asking “is this the bear market?” at every dip or crash and stop wondering “how long will this bull market last?” at every peak? Maybe it’s become more nuanced than that, and we need to start accepting that nobody knows shit about fuck and anything could happen at any time, &lt;em&gt;always&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;It’s a new paradigm. A new game. Old patterns don’t necessarily apply any more. Every day in this market is a complete unknown, and any attempt to conceive of the market as a whole according to old and familiar patterns has the potential to lead us astray.&lt;/p&gt;\n\n&lt;p&gt;It’s worth repeating: anything could happen at any time. &lt;strong&gt;Seriously.&lt;/strong&gt; This could be the start of a long hard multi-year crypto winter, or we could theoretically still hit 100k btc by end of year. (&lt;strong&gt;Highly&lt;/strong&gt; unlikely, yeah, but this is crypto. &lt;em&gt;Anything could happen.&lt;/em&gt;) &lt;strong&gt;Nobody knows shit about fuck.&lt;/strong&gt; Time to accept that fact, let go of outdated and limiting ways of thinking, and continue to venture boldly and blindly into the unknown. After all, isn’t that what we all do best?&lt;/p&gt;\n\n&lt;p&gt;edit: as I said in response to someone below, I guess the real question is: how long does a run need to be for it to be considered a “market”? I have always thought of a bull or bear &lt;em&gt;market&lt;/em&gt; as at least a couple of months, and bull or bear &lt;em&gt;runs&lt;/em&gt; to be extreme jumps in either direction, and the rest to just be good ol’ erratic crypto. Others in the comments seem to view it differently though… Is this just another issue that boils down to different definitions of words?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/r9ytsx/is_it_possible_that_bull_and_bear_markets_simply/",
  "subreddit": "CryptoCurrency",
  "id": "r9ytsx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every spike it’s “bull market” this or that, and every crash it’s “bear market”\nblah blah. In the past we’ve definitely had clear bull and bear markets at\nvarious times, but when you look at the past year or so things have been far too\nerratic to call any of it “bull” or “bear” market. A run maybe,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暴騰のたびに \"強気相場\"、暴落のたびに \"弱気相場\"\nといった具合に。過去には確かに明確な強気相場と弱気相場があったのですが\nしかし、ここ1年ほどの状況を見ると、あまりにひどい。\n強気相場」「弱気相場」と呼ぶには不規則です。もしかしたら、暴騰かもしれない。",
      "title": "強気」と「弱気」の市場は、もはや暗号には当てはまらないということでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每次暴涨都是 \"牛市 \"这个或那个，每次暴跌都是 \"熊市\"\n诸如此类。在过去，我们确实在不同时期有明确的牛市和熊市。\n但当你看到过去一年左右的情况时，就会发现它太不稳定了。\n变化无常，不能称之为 \"牛市 \"或 \"熊市\"。也许是一次运行，...",
      "title": "是否有可能 \"牛市 \"和 \"熊市 \"根本不再适用于加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每次暴漲都是 \"牛市 \"這個或那個，每次暴跌都是 \"熊市\"\n諸如此類。在過去，我們確實在不同時期有明確的牛市和熊市。\n但當你看到過去一年左右的情況時，就會發現它太不穩定了。\n變化無常，不能稱之爲 \"牛市 \"或 \"熊市\"。也許是一次運行，...",
      "title": "是否有可能 \"牛市 \"和 \"熊市 \"根本不再適用於加密貨幣？"
    }
  ]
}