{
  "author": "foyerhead",
  "original_created_utc": 1634423007,
  "title": "I bought BTC at the top in March, today I've finally broken even",
  "created_utc": 1634438673,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So yea, I got caught in the crypto craze early this year and, not knowing a single thing about cryptocurrency, put a sum of my money into BTC hoping to ride the wave to 100K+. So when BTC lost more than 50% of its value in June, you could say I learned a very important lesson about the dangers of FOMO. </p>\n\n<p>I was pretty panicked when that happened, and was really close to taking the 50% loss and never touching cryptocurrency ever again. After all, the only thing I knew about BTC was that it was some sort of digital money. But I kept holding and decided to start doing research and learning about the industry. It was around this time when I also found <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>. Admittedly, this sub seems like a massive echo chamber for crypto bulls, but I&#39;d be lying if I said that the confirmation bias didn&#39;t help with hodling my BTC. </p>\n\n<p>Finally, after almost 6 months of being deep in the red with my initial investment, I&#39;m happy to say I finally broke even. I know the ROI isn&#39;t pretty at all, and having 0% gains in 6 months isn&#39;t something to be necessarily proud of, but I&#39;m glad I stuck to my initial purchase and came out of it being much more informed about the vast potential of cryptocurrencies.</p>\n\n<p>Also shout out to this sub, a lot of good reads and memes alike. I usually just lurk on here, but I wanted to share my experience in crypto.</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/q9lzhh/i_bought_btc_at_the_top_in_march_today_ive/",
  "subreddit": "CryptoCurrency",
  "id": "q9lzhh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So yea, I got caught in the crypto craze early this year and, not knowing a\nsingle thing about cryptocurrency, put a sum of my money into BTC hoping to ride\nthe wave to 100K+. So when BTC lost more than 50% of its value in June, you\ncould say I learned a very important lesson about the dangers of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう、今年の初めに暗号ブームに乗って、暗号通貨について何も知らずに\n暗号通貨について何も知らないまま、BTCに大金を投じて、10万円以上の波に乗ろうと思った。\n10万ドル以上の波に乗ろうと思っていました。6月にBTCがその価値の50％以上を失ったとき、私は非常に重要な教訓を得たと言えるでしょう。\n私は暗号通貨の危険性について非常に重要な教訓を得たと言えるでしょう。",
      "title": "3月のトップでBTCを買ったが、今日はようやく収支が合った"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，是的，我在今年年初被卷入加密货币的热潮中，而且，我对加密货币一无所知。\n在对加密货币一无所知的情况下，我把一笔钱投入了BTC，希望能在这一波浪潮中\n到10万以上的浪潮。因此，当BTC在6月份损失了超过50%的价值时，你可以说我学到了非常重要的一课。\n可以说我学到了非常重要的一课，了解到加密货币的危险性。",
      "title": "我在3月份的顶部买入了BTC，今天我终于实现了收支平衡。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，是的，我在今年年初被捲入加密貨幣的熱潮中，而且，我對加密貨幣一無所知。\n在對加密貨幣一無所知的情況下，我把一筆錢投入了BTC，希望能在這一波浪潮中\n到10萬以上的浪潮。因此，當BTC在6月份損失了超過50%的價值時，你可以說我學到了非常重要的一課。\n可以說我學到了非常重要的一課，瞭解到加密貨幣的危險性。",
      "title": "我在3月份的頂部買入了BTC，今天我終於實現了收支平衡。"
    }
  ]
}