{
  "author": "Fleagster_69420",
  "original_created_utc": 1648622087,
  "title": "Does anyone ever feel like their life is going to well?",
  "created_utc": 1648640374,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a senior in college and I just got an internship that promised a job after college if they like me and I like them. I also am doing very well in school. My question is though, does anyone ever feel like their life is going to well? I feel fake or like a zombie almost rn. I feel like I don’t deserve what I’m experiencing. I’m just curious if anyone else has ever felt like their life is going to well and right around the corner is something that will take a shit down their throat?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/ts08d4/does_anyone_ever_feel_like_their_life_is_going_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "ts08d4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am a senior in college and I just got an internship that promised a job after\ncollege if they like me and I like them. I also am doing very well in school. My\nquestion is though, does anyone ever feel like their life is going to well? I\nfeel fake or like a zombie almost rn. I feel like I don’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は大学4年生で、ちょうどインターンシップに参加し、その後の仕事を約束されました。\nもし、彼らが私を気に入り、私が彼らを気に入れば、大学へ行くことができます。また、学校の成績もとても良いです。私の\nしかし、質問ですが、自分の人生がうまくいっていると感じたことがある人はいますか？I\n偽物というか、ほとんどゾンビのような感じです。私は...私は...私は...",
      "title": "自分の人生がうまくいっていると感じたことがある人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名大四学生，我刚刚得到一份实习工作，承诺大学毕业后会有工作。\n如果他们喜欢我，而我也喜欢他们的话。我在学校的表现也非常好。我的\n我的问题是，有没有人觉得他们的生活过得很好？I\n我觉得自己很假，或者说几乎像一具僵尸。我觉得我不...",
      "title": "有没有人觉得自己的生活会很顺利？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名大四學生，我剛剛得到一份實習工作，承諾大學畢業後會有工作。\n如果他們喜歡我，而我也喜歡他們的話。我在學校的表現也非常好。我的\n我的問題是，有沒有人覺得他們的生活過得很好？I\n我覺得自己很假，或者說幾乎像一具殭屍。我覺得我不...",
      "title": "有沒有人覺得自己的生活會很順利？"
    }
  ]
}