{
  "author": "Set1Less",
  "original_created_utc": 1642933291,
  "title": "Crypto needs to introspect. The entire space has been usurped by greed, ponzi farms, gamblers, NFT grifters, scammers.. In the eye of a normal person, all of these bring zero legitimacy to the space. A long bear market is good for weeding out all this nonsense",
  "created_utc": 1642956344,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We just saw a cycle where useless dog coins ran up to 50 BN market cap and more. People were selling millions of dollar worth &amp;quot;profile pictures&amp;quot;. Scams and hacks were a daily occurrence. The NFT space was and continues to be a perpetual clown show, lions, penguins, dogs, punk jpegs being sold for thousands of dollars. What even is this market. It puts every other bubble in history of mankind to shame. &lt;/p&gt;\n\n&lt;p&gt;If you wonder why the non-crypto crowd hates crypto and NFT viciously, it’s not an isolated incident or two, but a culmination of multiple events that are textbook examples of the worst capitalism has to offer. &lt;/p&gt;\n\n&lt;p&gt;Earlier in 2021, when I saw hit pieces against crypto, I thought they were quite wrong and were attacking crypto as they missed out on the gains. But over time it&amp;#39;s very clear that there is a lot of merit to the attacks on crypto. The entire space has become a circus of greed, scams, zero sum offerings where one is looking to profit from another. If you go to other reddit subs like &lt;a href=\"/r/technology\"&gt;r/technology&lt;/a&gt;, they are all spot on about crypto, the whole space is one big clown world detached from fundamentals. &lt;/p&gt;\n\n&lt;p&gt;You dont even need to bring in energy consumption into this, even without it crypto is a market aggregating the worsts of the worst. Even now, there is little to no real world adoption of crypto, and instead you have a perpetual grifting scheme where people rush into new launches just to dump them at a higher value and profit off late entrants. Think 2017 cycle but on steroids with thousands of new coins. &lt;/p&gt;\n\n&lt;p&gt;You have exchanges and other large players legitimising ponzi schemes by giving them attention and even running dog money competitions. You had large defi protocols add ponzi tokens as collateral. Guess what happens to that $100k loan that was taken out using OHM as collateral, when OHM itself crashes 80% in a matter of weeks. A culmination of all of these is cascading liquidations and steep corrections. &lt;/p&gt;\n\n&lt;p&gt;You have coins with 50 BN FDV, where insiders hold 90% of the supply and retail buys these coins at the very top because they told to FOMOing into every coin that an exchange adds. In particular, what FTX and the whole scam Sam ecosystem they have encouraged is disgusting, if not downright criminal. Institutions and VCs got into these coins at cents to the dollar valuation, and exchanges added them at exorbitant valuations allowing the insiders to cash out handsomely within just weeks. Influencers and ponzi pumpers ran with “FDV is a meme” narrative so that they can encourage retail to pile into these scams.&lt;/p&gt;\n\n&lt;p&gt;If you were even a small sized fund in this space, your limited partners were all chasing for maximal returns and exchanges facilitated all of this greed, all of them except retail knew that the loose monetary policy wasn’t going to last, and it was time to make the most out of it. Ultimately it’s the retail user and the crypto as a whole itself that suffers. &lt;/p&gt;\n\n&lt;p&gt;For a regular user of &lt;a href=\"/r/technology\"&gt;r/technology&lt;/a&gt;, he probably woudn&amp;#39;t care that its Alameda Research or A16Z thats behind a lot of these worthless hype tokens, but his indictment would fall on crypto as a whole. The partner of a crypto VC fund gives zero fucks if crypto&amp;#39;s reputation goes down the drain, he has made his millions and is happy collecting his share of profits.&lt;/p&gt;\n\n&lt;p&gt;If you really believe in the tech and vision of crypto, you have every reason to be angry about what the space has turned into since the pandemic crash. It has been one relentless machine churning out scam after scam. &lt;/p&gt;\n\n&lt;p&gt;A bear market offers actual builders to work in peace building good products that the users needs, while removing all the baggage that comes with increasing prices and the vicious cycle of people looking to profit from one another, and heightened regulatory attention that grifters and scams bring to crypto as a whole. &lt;/p&gt;\n\n&lt;p&gt;Crypto has a lot to offer the world, but only if the right products are built offering value to users. A ponzi farm and fork of a liquidity mining pool aint it, champ.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 415,
  "permalink": "/r/CryptoCurrency/comments/saqnl8/crypto_needs_to_introspect_the_entire_space_has/",
  "subreddit": "CryptoCurrency",
  "id": "saqnl8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We just saw a cycle where useless dog coins ran up to 50 BN market cap and more.\nPeople were selling millions of dollar worth \"profile pictures\". Scams and hacks\nwere a daily occurrence. The NFT space was and continues to be a perpetual clown\nshow, lions, penguins, dogs, punk jpegs being sold for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは、役に立たない犬のコインが時価総額50BN以上まで駆け上がるサイクルを見たばかりです。\n人々は何百万ドルもの価値のある「プロフィール写真」を売っていたのです。詐欺やハッキング\nは日常茶飯事でした。NFTの空間は、昔も今も、永遠のピエロである。\nライオン、ペンギン、犬、パンクのJPEGが売られている。",
      "title": "クリプトは内省する必要がある。この分野全体が、強欲、ポンジファーム、ギャンブラー、NFTペテン師、詐欺師によって簒奪されてきました。普通の人の目には、これらのすべてがこの分野に正統性をもたらさないように映るのです。長い弱気相場は、このようなナンセンスなものをすべて淘汰するのに適しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们刚刚看到一个周期，无用的狗币跑到了50 BN市值，甚至更多。\n人们在出售价值数百万美元的 \"资料图片\"。诈骗和黑客\n是每天都在发生的。NFT领域过去和现在都是一个永久的丑角。\n狮子、企鹅、狗、朋克jpeg被卖到......。",
      "title": "Crypto需要反省。整个空间已经被贪婪、庞氏骗局、赌徒、NFT骗子、诈骗者所侵占。在一个正常人的眼中，所有这些都给这个空间带来了零的合法性。漫长的熊市有利于剔除所有这些无稽之谈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們剛剛看到一個週期，無用的狗幣跑到了50 BN市值，甚至更多。\n人們在出售價值數百萬美元的 \"資料圖片\"。詐騙和黑客\n是每天都在發生的。NFT領域過去和現在都是一個永久的丑角。\n獅子、企鵝、狗、朋克jpeg被賣到......。",
      "title": "Crypto需要反省。整個空間已經被貪婪、龐氏騙局、賭徒、NFT騙子、詐騙者所侵佔。在一個正常人的眼中，所有這些都給這個空間帶來了零的合法性。漫長的熊市有利於剔除所有這些無稽之談。"
    }
  ]
}