{
  "author": "notbrokemexican",
  "the_new_excerpt": "PURPOSE\n\nThe purpose of this post is to write out the thought process and analysis of\nsome of my major investments. Each of these investments can take over a year to\ndecide on, but cannot be invested in until I have written out the process.\n\nPart of this is also due to the fact that I believe that…",
  "original_created_utc": 1613962527,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "目的\n\n本篇文章的目的是写出思路和分析的\n我的一些主要投资。每一项投资都可能需要一年以上的时间来进行。\n决定，但在我写出这个过程之前不能投资。\n\n部分原因也是由于我认为...。",
      "title": "了解金融科技。关于我对Square的投资的文章"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目的\n\n本篇文章的目的是寫出思路和分析的\n我的一些主要投資。每一項投資都可能需要一年以上的時間來進行。\n決定，但在我寫出這個過程之前不能投資。\n\n部分原因也是由於我認爲...。",
      "title": "瞭解金融科技。關於我對Square的投資的文章"
    }
  ],
  "title": "Understanding Fintech: An Essay on my Investment in Square",
  "created_utc": 1613975980,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h2>Purpose</h2>\n\n<p>The purpose of this post is to write out the thought process and analysis of some of my major investments. Each of these investments can take over a year to decide on, but cannot be invested in until I have written out the process.</p>\n\n<p>Part of this is also due to the fact that I believe that investing in securities will become increasingly complex yet accessible for a typical retail investor which will either result in isolation OR incentivize cooperation to open-source complex information.</p>\n\n<ul>\n<li><p>Does the average retail investor really understand the core regulatory influences in investments like Square, PayPal, or even RH? </p></li>\n<li><p>Does the average retail investor understand incentives vs. bias?</p></li>\n<li><p>Is the average retail investor familiar with fashion trends that make Nike and Foot Locker valuable?</p></li>\n<li><p>Is an average retail investor familiar with competitive types of manufacturing processes when they invest in technologies like AMD or GE? </p></li>\n<li><p>Is the average retail investor familiar with the network models that govern software like Fastly and Twilio?</p></li>\n</ul>\n\n<p>At the end of the day, I am an educator and I believe that the goal of education is to engage a reader into a deeper curiosity or discussion, so that’s why I’m sharing my writing. I’m not here to convince you that this stock is even a good choice - but to explore the economics behind it.</p>\n\n<h2>The Fundamental Constraint</h2>\n\n<p>This one is not going to be easy to understand, so get your coffee ready and get comfortable. It’s going to be difficult to digest the technology behind Square because it asks you to believe the premise that banking is going to change in unforeseeable ways in the near future. I currently work in the Banking-as-a-Service sector as an engineer, so I have some insight that I could offer.</p>\n\n<p>A fair amount of people may not know this, but organizations like Stripe, Square, PayPal, and other fintech infrastructures are just network layers over existing banks. For example, Stripe partners with Evolve Bank while Square partners with Sutton Bank. This is a win-win scenario, for now, where banks get to see the benefits of technology distribution powers, while tech companies gain a shortcut to regulatory requirements.</p>\n\n<p>It may help to accept this by understanding the idea that drives the financial technology sector. In order to distribute financial services to people, regardless of net worth, trustworthiness and accountability must be established. These are regulatory frameworks developed by the Bank Secrecy Act (BSA) or Financial Crimes Enforcement Network (FinCEN) that are also challenged by such technologies like B*tcoin, where validation is arbitrary and based on fingerprinting. This trustworthiness is also the reason why you’re able to instantly invest in your RH account - you are a trusted user and there is no reason to believe that you are somebody else.</p>\n\n<p>It is, then, no secret as to why Square invested in B*tcoin. There are other reasons, even cultural, as to why they did, but the basic root behind the decision is that it allows research into new verification methods that makes shipping financial services even more frictionless. It is a potential vector for changing the rules of the game and leveling the playing field, so to speak. Being a software-first bank allows you to distribute at a much more rapid pace than a traditional large bank.</p>\n\n<p>In short, The fuel of fintech is the underbanked. The combustion engine that burns it is cybersecurity and AI to validate that a user is trustworthy each time they commit a transaction. This is known as the KYC Problem and how each organization approaches the regulatory requirement to verify that a user is not committing fraud will determine the outcome of who dominates the fintech sector. This is also why you see customer-service as a pervasive problem.</p>\n\n<p>Now let me just go ahead and take the opinion here - I don’t think PayPal will achieve this in the US, but their investment in MercadoLibre might take them there in some way. Latin America is a particularly interesting case study in underbanking. The reason I hate this is because I feel that a lot of their services are disconnected and low-quality. For example, Remitly allows me to send money to Mexico in a highly informed and smooth way, while Xoom (a paypal remittance service) just about shits the bed the moment I touch it. Sure, that’s anecdote - but I want my investments going somewhere where the design is ALWAYS built around the customer. PayPal’s management resulting in the shipment of an unfinished and thoughtless product is just an awful red flag to me. I should not be getting unknown error alert when I send money to another country. </p>\n\n<h1>The Underbanked</h1>\n\n<p>Jack Dorsey is an interesting character, who views on technology can be highlighted:</p>\n\n<p>&gt; “...to develop an open and decentralized standard for social media. The goal is for Twitter to ultimately be a client of this standard. Twitter was so open early on that many saw its potential to be a decentralized internet standard, like SMTP (email protocol). For a variety of reasons, all reasonable at the time, we took a different path and increasingly centralized Twitter. But a lot’s changed over the years.”</p>\n\n<p>Interestingly enough, Twitter is used in such a manner. The Tweet system these days gets shared across all social media platforms due to its simple design and even appears interactively during sporting events or billboards.</p>\n\n<p>In my view, Jack Dorsey sees the current period of time as a turning point in internet communications and the underbanked. It is clear as day in its marketing strategy, where Square seller services is marketed strongly toward immigrants and first-time entrepreneurs while Cash App is strongly marketed toward young, first-time banking customers. No really, go ahead and look at two things:</p>\n\n<ul>\n<li>Cash App’s Twitter and advertising strategy</li>\n<li>The geographic results on Google Trends when searching “Cash App vs. Venmo”. Southern USA generally sees less banking due to increased poverty.</li>\n</ul>\n\n<p>It is clear as day and the reason is due to the nature of the demographics of underbanked users. You see, access to banking is not much different than access to the internet or access to clean water.  That is, the closer you are to poverty, the closer you are to lacking access to basic resources. What is interesting about Square’s youth &amp; culture strategy is that it builds a life-long trust with the org. You’ve heard it before, “why doesn’t school teach us important thing like taxes or investing?”. Square is attacking that pulse in its design. It offers:</p>\n\n<ol>\n<li>The ability to start a business</li>\n<li>The ability to invest and educate in basic stocks</li>\n<li>The ability to invest and educate in bitcoin</li>\n<li>The ability to save on basic purchases</li>\n<li>The ability to file taxes (not yet, but the company acquired the means to)</li>\n</ol>\n\n<p>What this inevitably means is that we probably won’t even see Square operating at “full-force” until at least 2030 and beyond, as these early aged customers grow with Square and embed more of their financials.</p>\n\n<h1>Speculation</h1>\n\n<p>This is what I expect after examining regulatory environments, product quality, and competitive outlooks:</p>\n\n<ol>\n<li>Square will either acquire Sutton Bank or reduce its dependency on Sutton Bank’s regulatory offerings.</li>\n<li>Square will become a bank to avoid direct competition with Big Tech, while competing aggressively against Big Banking by offering the ability to ship financial services.</li>\n<li>The way they will achieve this is by developing a stronger form of cybersecurity and AI that will allow a smoother verification process.</li>\n<li>Square will develop an internet railway, where exchanging currency will be accessible in different mediums like video-games or streams that may compete with orgs like Visa or MasterCard.</li>\n<li>Square will compete with Banking-as-a-service and checkout offerings like Stripe, Plaid, and Shopify.</li>\n<li>Square will foray into equal housing.</li>\n</ol>\n\n<p>Pls folllw.</p>\n\n<p><a href=\"https://i.pcmag.com/imagery/reviews/06hGKT6YUeRY99vz4MVPPh0-7..1569477220.jpg\">https://i.pcmag.com/imagery/reviews/06hGKT6YUeRY99vz4MVPPh0-7..1569477220.jpg</a></p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/stocks/comments/lpdeem/understanding_fintech_an_essay_on_my_investment/",
  "subreddit": "stocks",
  "id": "lpdeem",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332885072
}