{
  "author": "Veridiyus",
  "original_created_utc": 1638359687,
  "title": "BTC wont become less valuable if ETH takes the #1 spot",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have heard and read how concerned some people are of what might happen to BTC if it&amp;#39;s ever flipped by ETH. I think that the flippening will (with most certainty) not affect BTC&amp;#39;s price or legacy. The only thing that would change is ETH having a higher market cap but the value and importance of BTC would remain the same for decades to come. We already know that BTC is considered as digital gold and ETH digital oil but I also want to compare ETH to our financial sector for the sake of this post.&lt;/p&gt;\n\n&lt;p&gt;Gold has a market cap of $11.325T and the financial sector&amp;#39;s market cap sits around $28T (correct me if I am wrong). I believe ETH will probably flip BTC in the future for the same reasons the financial sector flipped gold, it has more to offer than just storing value. But the fact that the financial sector&amp;#39;s market cap is higher that of gold doesn&amp;#39;t take away its value and scarcity, hell even other scarce metals are worth more per ounce than gold but the world still prefers gold as a store of value. The same applies to BTC when compared to ETH or other currencies who claim they are better. Banks, countries, financial institutions etc will continue to store their wealth in BTC just like they do in gold no matter the ranking. ETH and BTC are essentially more than just two names on a list, they are two completely different but very important projects aiming for two different goals which has the ability to change the world.&lt;/p&gt;\n\n&lt;p&gt;BTC will most likely not vanish or become useless in our lifetime. The best thing you could do, in my opinion, is to keep investing in BTC because I don&amp;#39;t think you would stop once America releases their own CBDC which will flip every crypto coin by a huge amount, especially since new fiat is being printed at a record speed, the supply is not finite. Do you think BTC would lose its value in this scenario? No, it wouldn&amp;#39;t so don&amp;#39;t worry about ETH flipping BTC by a couple of billions, we will be fine.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/r6d3dh/btc_wont_become_less_valuable_if_eth_takes_the_1/",
  "subreddit": "CryptoCurrency",
  "id": "r6d3dh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have heard and read how concerned some people are of what might happen to BTC\nif it's ever flipped by ETH. I think that the flippening will (with most\ncertainty) not affect BTC's price or legacy. The only thing that would change is\nETH having a higher market cap but the value and importance of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCがどうなるかを心配する声を聞いたり読んだりしたことがあります。\nETHで反転することがあれば。私は、反転は（ほとんどの場合\nBTCの価格やレガシーに影響を与えないことは確実です。唯一変わるとすれば\nETHの方が時価総額は高いが、その価値と重要性は...。",
      "title": "ETHが1位になってもBTCの価値が下がることはない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听说和读到一些人对BTC可能发生的情况很担心\n如果它被ETH炒作的话。我认为，翻转将（最\n确定）不会影响BTC的价格或遗产。唯一会改变的是\nETH有更高的市值，但它的价值和重要性。",
      "title": "如果ETH占据第一的位置，BTC的价值不会降低"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽說和讀到一些人對BTC可能發生的情況很擔心\n如果它被ETH炒作的話。我認爲，翻轉將（最\n確定）不會影響BTC的價格或遺產。唯一會改變的是\nETH有更高的市值，但它的價值和重要性。",
      "title": "如果ETH佔據第一的位置，BTC的價值不會降低"
    }
  ]
}