{
  "author": "allthejokesareblue",
  "original_created_utc": 1645442173,
  "title": "The Condescension of Lady Catherine De Burgh: Why Does Mr Darcy visit her for 3 weeks given that he neither likes her, nor needs anything from her? Was this a common practice?",
  "created_utc": 1645528235,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In &lt;em&gt;Pride and Prejudice&lt;/em&gt;, Mr Darcy spends about 3 weeks visiting Lady Catherine De Burgh with Col. Fitzwilliam, who was a great friend of his mother&amp;#39;s.  &lt;/p&gt;\n\n&lt;p&gt;Mr Darcy is a man of vast independent means, and it is made clear that while Lady De Burgh wants him to marry her daughter, he has absolutely no interest in the match. It is also made clear that he has a very low opinion of Lady De Burgh herself.&lt;/p&gt;\n\n&lt;p&gt;To a modern reader, it seems odd that he should spend such a long time visiting someone for whom he has no personal affection, nor any expectation of material advancement: Lady De Burgh can give him absolutely nothing which he needs or wants. And I don&amp;#39;t think it is suggested in the text that he contrived the visit simply because Ms Bennett would be there, or that he was even aware of that fact?&lt;/p&gt;\n\n&lt;p&gt;Presumably to a contemporary reader, the visit is not an odd one though. Would visiting family friends for this length of time have been common for someone of Mr Darcy&amp;#39;s class? Why?&lt;/p&gt;\n\n&lt;p&gt;Edit: Mods I&amp;#39;m sorry I added the wrong flair and now seem unable to change it myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/sxr626/the_condescension_of_lady_catherine_de_burgh_why/",
  "subreddit": "AskHistorians",
  "id": "sxr626",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In Pride and Prejudice, Mr Darcy spends about 3 weeks visiting Lady Catherine De\nBurgh with Col. Fitzwilliam, who was a great friend of his mother's.\n\nMr Darcy is a man of vast independent means, and it is made clear that while\nLady De Burgh wants him to marry her daughter, he has absolutely no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "高慢と偏見』の中で、ダーシー氏は3週間ほどかけてキャサリン・ド・レディを訪ねます。\nバーグは、母親の大親友であったフィッツウィリアム大佐と一緒にいる。\n\nダーシー氏は独立した資力を持つ人物であり、そのことが明らかにされている。\nデ・バーグ夫人は彼に娘との結婚を望んでいるが、彼はまったく...",
      "title": "レディ・キャサリン・デ・バーグの慇懃無礼な態度。ダーシー氏はなぜ3週間も彼女を訪問したのでしょうか？これはよくあることだったのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在《傲慢与偏见》中，达西先生花了大约3个星期的时间和他母亲的好朋友菲茨威廉上校一起去拜访凯瑟琳-德-伯格夫人。\nBurgh，而Fitzwilliam上校是他母亲的一个好朋友。\n\n达西先生是一个有巨大的独立能力的人，而且很清楚，虽然德波夫人希望他能和她结婚，但他还是希望能和她结婚。\n德伯夫人希望他娶她的女儿，但他绝对没有......",
      "title": "凯瑟琳-德-伯格夫人的居高临下。既然达西先生既不喜欢她，也不需要她做什么，为什么还要去看她三个星期？这是不是一种常见的做法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在《傲慢與偏見》中，達西先生花了大約3個星期的時間和他母親的好朋友菲茨威廉上校一起去拜訪凱瑟琳-德-伯格夫人。\nBurgh，而Fitzwilliam上校是他母親的一個好朋友。\n\n達西先生是一個有巨大的獨立能力的人，而且很清楚，雖然德波夫人希望他能和她結婚，但他還是希望能和她結婚。\n德伯夫人希望他娶她的女兒，但他絕對沒有......",
      "title": "凱瑟琳-德-伯格夫人的居高臨下。既然達西先生既不喜歡她，也不需要她做什麼，爲什麼還要去看她三個星期？這是不是一種常見的做法？"
    }
  ]
}