{
  "author": "get_reddit_1",
  "the_new_excerpt": "Tesla market value today (716 Billion) is about the same as the market value of\nall the world's major car makers combined. In addition China's BYDDY (86B) and\nNio (78B) are both more valuable than Daimler (74B) even though NIO only\ndelivered less than 40,000 cars in all of 2020 with huge loss.…",
  "original_created_utc": 1609988027,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "特斯拉今天的市值(7160亿美元)大致相当于\n世界上所有的主要汽车制造商加在一起。此外，中国的比亚迪(86B)和\nNIO(78B)都比戴姆勒(74B)更有价值，尽管只有NIO\n2020年全年交付的汽车不到40,000辆，损失巨大。…",
      "title": "TSLA-Tesla今天的市值比世界上所有主要汽车制造商的总和都要高-是什么造成的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "特斯拉今天的市值(7160億美元)大致相當於\n世界上所有的主要汽車製造商加在一起。此外，中國的比亞迪(86B)和\nNIO(78B)都比戴姆勒(74B)更有價值，儘管只有NIO\n2020年全年交付的汽車不到40,000輛，損失巨大。…",
      "title": "TSLA-Tesla今天的市值比世界上所有主要汽車製造商的總和都要高-是什麼造成的？"
    }
  ],
  "title": "TSLA - Tesla market value today is more valuable than all the world's major auto makers combined - what gives?",
  "created_utc": 1609995080,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tesla market value today (716 Billion) is about the same as  the market value of all the world&#39;s major car makers combined.  In addition China&#39;s BYDDY (86B) and Nio (78B) are both more valuable than Daimler (74B) even though NIO only delivered less than 40,000 cars in all of 2020 with huge loss. China&#39;s LI and XPEV combined market value are similar to GM (61B), which has production in China and has a worldwide lineup of EV to be on the market in the next few years.</p>\n\n<p>With the exception of autonomous driving, EV manufacturing appears to have a low technology barrier to entry, that&#39;s why we have so many EV car companies pops up all over the world. Everybody used the same Total Addressable Market to justify their future value. I don&#39;t think autonomous driving is a must have in buying an EV, so the competition will be intense once all ICV companies start to produce their lineup of EVs in the near future.</p>\n\n<p>Since Auto industry is a cyclical business, historically, the market value of the auto companies were somewhat depressed as compared to other high growth industries. Since there is a limit on how many cars will be sold in a year based on historical trends, I don&#39;t know how we can justify doubling or tripling the total market value of the whole auto industry unless all the non-Tesla companies lost significant amount of their market value, which is not likely (you are talking about fierce competitors like Toyota, Daimler, Honda, GM, etc)</p>\n\n<p>The first movers (Tesla, BYDDY, Nio, Xpev) are catching all the investment dollars, driving their stock to current nose bleeding price.  Once all major car makers start to deliver EVs, supply and demand will determine their profit margin, future cash flow and true present value.</p>\n\n<p>What do you think? How long will this EV mania last?</p>\n</div><!-- SC_ON -->",
  "score": 1734,
  "permalink": "/r/investing/comments/ks3xo6/tsla_tesla_market_value_today_is_more_valuable/",
  "subreddit": "investing",
  "id": "ks3xo6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100748513
}