{
  "author": "repagator8",
  "the_new_excerpt": "I just want to share some upcoming catalyst on NIO. These are big upcoming\ncatalyst for NIO and why in my opinion even if you do not have a position in\nNIO, right now its a great time to buy. The price point right now is perfect\nfrom a tech analysis stand point. The $ 57 level is not a random…",
  "original_created_utc": 1611239259,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我只想分享一些即将到来的NIO催化剂。这些都是即将到来的大\nNIO的催化剂，为什么在我看来，即使你没有在NIO的位置\nNIO，现在是购买的好时机。现在的价位是完美的\n从技术分析的角度来看。57美元的水平不是随便...",
      "title": "3个理由让NIO即使在目前的价格也能买入"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想分享一些即將到來的NIO催化劑。這些都是即將到來的大\nNIO的催化劑，爲什麼在我看來，即使你沒有在NIO的位置\nNIO，現在是購買的好時機。現在的價位是完美的\n從技術分析的角度來看。57美元的水平不是隨便...",
      "title": "3個理由讓NIO即使在目前的價格也能買入"
    }
  ],
  "title": "3 reasons NIO is a buy even at current price",
  "created_utc": 1611254103,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just want to share some upcoming catalyst on NIO.  These are big upcoming catalyst for NIO and why in my opinion even if you do not have a position in NIO, right now its a great time to buy.  The price point right now is perfect from a tech analysis stand point.    The $ 57 level is not a random number, it was a previous resistance ( Jan 8) and according to the principal of polarity, it is supposed to work as a support now, and it seems this is exactly what <a href=\"https://www.tradingview.com/symbols/NYSE-NIO/\">NIO </a>is doing.  Strong support at the $57 level all week so far. </p>\n\n<p>1) lets start with something Juicy.    Call it a rumor if you want but NIO is building a second factory and will be working at lightspeed.  China has a huge workforce that works around the clock.  I know first hand that Countries such as Israel and UAE Dubai they hire Chinese construction firms because they get the job done the fastest efficiently.   China built hospitals from the ground up in 10 days during the early days of the pandemic in Wuhan.  Overnight Highway improvements is not unusual for them.  They can build a bridge overpass overnight.  </p>\n\n<p>Searching Chinese news for  &quot;蔚来&quot;  weilai which is NIO&#39;s Chinese name </p>\n\n<p>Original source :: <a href=\"http://baijiahao.baidu.com/s?id=1688960377220358553&amp;wfr=spider&amp;for=pc&amp;sa=vs_ob_realtime&amp;isFailFlag=1\">http://baijiahao.baidu.com/s?id=1688960377220358553&amp;wfr=spider&amp;for=pc&amp;sa=vs_ob_realtime&amp;isFailFlag=1</a></p>\n\n<p>Google translated to English link: <a href=\"https://tnfazfhhnmigefgk4zpsgws5xu-adwhj77lcyoafdy-baijiahao-baidu-com.translate.goog/s?id=1688960377220358553&amp;wfr=spider&amp;for=pc&amp;sa=vs_ob_realtime&amp;isFailFlag=1\">https://tnfazfhhnmigefgk4zpsgws5xu-adwhj77lcyoafdy-baijiahao-baidu-com.translate.goog/s?id=1688960377220358553&amp;wfr=spider&amp;for=pc&amp;sa=vs_ob_realtime&amp;isFailFlag=1</a></p>\n\n<p>Update Jan 16,2021 11:00 am est: It looks official according to this news outlet use chrome and translate : <a href=\"https://xw.qq.com/cmsid/20210114a0cwaf00?f=newdc\">https://xw.qq.com/cmsid/20210114a0cwaf00?f=newdc</a></p>\n\n<p>Please note the 60 day is just the &quot;earthwork&quot; which I assume means leveling the ground ready for construction. </p>\n\n<p>Translated as follows:</p>\n\n<p>The second factory of Jianghuai Weilai started bidding and is expected to be put into operation within the year</p>\n\n<p>01-15 08:42 Cenard (Beijing) Information Technology Official Account, Car Master, Quality Creator attention [Aika Auto Industry Information Original] Recently, the bidding announcement exposed on the Internet shows that Jianghuai NIO is bidding for its manufacturing base. The new base construction site is located in the section of Jiangnan Road, Economic Development Zone, Hefei City. According to the 60-day planned construction period shown in the tender document, it is expected that the second factory of Jianghuai Weilai will be completed and put into production within this year.</p>\n\n<p>It is worth mentioning that the Jianghuai Weilai manufacturing base has just been selected as the 2020 Anhui Smart Factory. The Jianghuai Weilai manufacturing base, which started in October 2016, was completed in one year and three months, and delivered more than 10,000 units that year. As of November 2020, nearly 80,000 units of ES8 and ES6 models have been delivered. EC6 sales have continued to increase since mass production and delivery started in September. With the launch of ET7, the construction of the second factory also prepares for future sales growth.</p>\n\n<p>1-2) Second to this Great news The current JAC factory is expanding to meet demands and future growth.  Really exciting stuff like a test track and an energy centre and sewage treatment station which sounds like they will make the factory as environmentally conscious as possible.  Basically every stage of production is getting a boost from painting workshop to press and welding.  Project expected to complete in 1 year, total size of upgraded facility is over 270,000m2 of building area.  </p>\n\n<p><a href=\"https://www.12369zb.com/view/159/5a_3GXcBzXGIkQ62BOD8\">https://www.12369zb.com/view/159/5a_3GXcBzXGIkQ62BOD8</a></p>\n\n<p>&#x200B;</p>\n\n<p>2) NIO is ready for sales in Europe earlier than expected, per this Dutch website which is an EV auto sales and leasing company in the Netherlands.  It says NIO will be available in the second half of 2021.  Does not mention anything about BaaS in europe but says they are curious.  Please google translate the link below</p>\n\n<p><a href=\"https://www.zakelijkelektrischleasen.nl/elektrische-autos-van-nio-komen-in-2021-naar-nederland/\">https://www.zakelijkelektrischleasen.nl/elektrische-autos-van-nio-komen-in-2021-naar-nederland/</a></p>\n\n<p>3)  closes $1.5 billion in convertible notes,  This does not dilute shares and the debt is due in halves of 650 million in 2026 &amp; 2027.  Investors can convert into equity in 2025 or NIO can pay back the debt.  these big investors are bullish on NIO and the rate for conversion for notes to equity (NIO ADS Stock) is around $93.06.  What this means is these big investors that have done more DD than is available to the public are confident NIO will hit the $100 price in the near future.  </p>\n\n<p>With all that mentioned I feel the next delivery report and earnings will take NIO to new ATH.  Next earnings is expected early March for the period ending Dec 2020.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/stocks/comments/l1zgcb/3_reasons_nio_is_a_buy_even_at_current_price/",
  "subreddit": "stocks",
  "id": "l1zgcb",
  "is_self": true,
  "media": null,
  "is_video": false
}