{
  "author": "Magelis86",
  "the_new_excerpt": "In the cryptocurrency business, airdrops approach is commonly used to spread\nawareness and increase ownership of a new currency startup.\n\nAn airdrop, is a marketing stunt that involves sending coins or tokens to wallet\naddresses in order to promote awareness of a new virtual currency.…",
  "original_created_utc": 1614868151,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在加密货币业务中，通常采用空投的方式来传播。\n知名度，提高新货币创业者的拥有率。\n\n空投，是一种营销噱头，即向钱包发送硬币或代币。\n地址，以提高对一种新的虚拟货币的认识....。",
      "title": "提醒: 如果该产品是免费的，您就是该产品。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在加密貨幣業務中，通常採用空投的方式來傳播。\n知名度，提高新貨幣創業者的擁有率。\n\n空投，是一種營銷噱頭，即向錢包發送硬幣或代幣。\n地址，以提高對一種新的虛擬貨幣的認識....。",
      "title": "提醒: 如果該產品是免費的，您就是該產品。"
    }
  ],
  "title": "Reminder : If the product is free, you are the product",
  "created_utc": 1614889901,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the cryptocurrency business, airdrops approach is commonly used to spread awareness and increase ownership of a new currency startup.</p>\n\n<p>An airdrop, is a marketing stunt that involves sending coins or tokens to wallet addresses in order to promote awareness of a new virtual currency. This ‘donation’ can be done either for free, or in exchange for a small promotional service.</p>\n\n<p>Every once in a while, an airdrop can be hugely profitable. The best example was the Oyster Pearl airdrop. Even though this crypto is now dead, back in the time, the users could receive up to 2400 PRL, which eventually went up in value to over $5 per token.</p>\n\n<p>But, as you can see on the following table (adapted from the excellent post by <a href=\"/u/mortuusmare\">u/mortuusmare</a>), 90% of the airdrops (or even more) are scams. At best you will never get your tokens. At worst you will end up in a scam costing you money :</p>\n\n<p><a href=\"https://preview.redd.it/x3ppui86u0l61.png?width=2589&amp;format=png&amp;auto=webp&amp;s=290e8117d4ba98e4c91a90c4d13a5cc071935e5a\">Out of 15 airdrops, 13 are scams, 1 is probably also a scam and 1 delivered less than promise.</a></p>\n\n<p>People always mention that DYOR (Doing Your Own Research) is the key to avoid those scams. Let’s take a look at the last name on the list: Initiative Q.</p>\n\n<p>Back in 2018, this project (founded by 2 famous ex-Paypal guys) coming out of nowhere and claiming that it will become the future of currencies became famous after being advertised by big crypto names. The only thing that you had to do was to register (thus give some of your infos) and invite as many friends as you could. Kind of attractive for people that want to earn without spending money. Then, depending on how many friends you successfully invited, you could lock some of their currency that you will later receive. The mainet was supposed to be launched end of 2019/beginning of 2020. 3 years later, nothing is done, and the project is probably dead.</p>\n\n<p>I can hear you thinking: 1) Why should I care? I never spend money. 2) What was the point? Why did they do that?</p>\n\n<p>Data is the new oil and Infos are the new currency. According to several sources (fraudpractice.com ; pacetechnical.com etc.), an email address and password combinations sell between $0.70 and $2.30 each on the black market. How many of us took the time to create a specific e-mail and a specific password for this airdrop? Less than 1%. If you participated in this airdrop, you probably used your standard e-mail and used your standard password. Each of us become the currency, a token worth $2.30.</p>\n\n<p>So, never forget that Airdrops are not so harmless as they seem. And creating a specific e-mail with a particular password just for this task is always a good idea.</p>\n\n<p>This is why 1) If it&#39;s too good to be true it probably isn&#39;t. 2) If the product is free, you are the product.</p>\n</div><!-- SC_ON -->",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/lxlqd4/reminder_if_the_product_is_free_you_are_the/",
  "subreddit": "CryptoCurrency",
  "id": "lxlqd4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542570794
}