{
  "author": "krikite",
  "original_created_utc": 1627571407,
  "title": "Just finished The Bitcoin Standard",
  "created_utc": 1627616442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The progression that happens throughout the book, starting by exposing problems with past and current forms of money and then showing how Bitcoin solves all of these problems was very well done and honestly impressive. My trust and understanding in Bitcoin and cryptocurrency in general has increase tenfold.</p>\n\n<p>However, I couldn&#39;t help but notice that he often proposes very contentious arguments like they are fact. His persistent critique of Keynes and his link between the &quot;decline in culture&quot; we have been seeing and the adoption of unsound money sure feels right in the context of the book, but I think they might be a bit of a stretch. </p>\n\n<p>Does anyone feel the same way or have resources that contradict some of his points? I&#39;d love to atleast see the other side of the medal before rejecting it altogether.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/Bitcoin/comments/otzc3z/just_finished_the_bitcoin_standard/",
  "subreddit": "Bitcoin",
  "id": "otzc3z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The progression that happens throughout the book, starting by exposing problems\nwith past and current forms of money and then showing how Bitcoin solves all of\nthese problems was very well done and honestly impressive. My trust and\nunderstanding in Bitcoin and cryptocurrency in general has increase…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この本の中では、まず問題点を明らかにすることから始めています。\nビットコインがこれらの問題を解決することを示しています。\n非常によくできていて、正直言って感心しました。私のビットコインや暗号に対する信頼と理解は\nビットコインや暗号通貨への信頼と理解が深まりました。",
      "title": "The Bitcoin Standardを終えて"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "整个书中发生的进展，从揭露问题开始\n然后展示比特币如何解决所有这些问题。\n这些问题都做得非常好，而且说实话，令人印象深刻。我的信任和\n我对比特币和整个加密货币的信任和理解增加了...",
      "title": "刚刚完成了《比特币标准》。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "整個書中發生的進展，從揭露問題開始\n然後展示比特幣如何解決所有這些問題。\n這些問題都做得非常好，而且說實話，令人印象深刻。我的信任和\n我對比特幣和整個加密貨幣的信任和理解增加了...",
      "title": "剛剛完成了《比特幣標準》。"
    }
  ]
}