{
  "author": "CalculatorOctavius",
  "original_created_utc": 1639974015,
  "title": "What is this word I am thinking of? It’s on the tip of my tongue",
  "created_utc": 1640007375,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s something like “schematics” but it’s basically a common blanket term for details regarding events. Including dates, times, locations, etc. &lt;/p&gt;\n\n&lt;p&gt;“Text me the (blank) surrounding the party tomorrow” would be an example, where the (blank) would be multiple things including the date, time, address, and the name of the person throwing it. &lt;/p&gt;\n\n&lt;p&gt;What is this word? I use it all the time but I am drawing a blank.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/rkegv5/what_is_this_word_i_am_thinking_of_its_on_the_tip/",
  "subreddit": "NoStupidQuestions",
  "id": "rkegv5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It’s something like “schematics” but it’s basically a common blanket term for\ndetails regarding events. Including dates, times, locations, etc.\n\n“Text me the (blank) surrounding the party tomorrow” would be an example, where\nthe (blank) would be multiple things including the date, time, address,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "回路図」のようなものですが、基本的には一般的な総称です。\nイベントに関する詳細です。日付、時間、場所などを含む。\n\n\"明日のパーティーに関する(空白)をメールして \"というのはその一例です。\n日付、時間、住所、などなど。",
      "title": "私が考えているこの言葉は何なのだろう。舌の先にあるのは"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一个类似于 \"示意图 \"的东西，但它基本上是一个通用的笼统术语，用于描述有关事件的细节。\n关于事件的细节。包括日期、时间、地点，等等。\n\n\"把明天聚会周围的（空白）发给我 \"将是一个例子，其中\n空白）将是多方面的，包括日期、时间、地址...。",
      "title": "我在想的这个词是什么？它就在我的舌尖上"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一個類似於 \"示意圖 \"的東西，但它基本上是一個通用的籠統術語，用於描述有關事件的細節。\n關於事件的細節。包括日期、時間、地點，等等。\n\n\"把明天聚會周圍的（空白）發給我 \"將是一個例子，其中\n空白）將是多方面的，包括日期、時間、地址...。",
      "title": "我在想的這個詞是什麼？它就在我的舌尖上"
    }
  ]
}