{
  "author": "Brainpry",
  "original_created_utc": 1631911021,
  "title": "Because of a tik toc trend, my sons school closed all the bathrooms. Is this legal?",
  "created_utc": 1631917402,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My son just texted me saying he had to poop, really bad and that all the bathrooms were locked. I didn’t believe him, but when I called the school he was telling the truth. After arguing for a while, they were willing to let him use a restroom in the office, with administrators around him. My son is a good kid, has a 4.0, and is in 2 honor classes. I need to know if this is legal, and what I can do about this?</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/NoStupidQuestions/comments/pq88wk/because_of_a_tik_toc_trend_my_sons_school_closed/",
  "subreddit": "NoStupidQuestions",
  "id": "pq88wk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My son just texted me saying he had to poop, really bad and that all the\nbathrooms were locked. I didn’t believe him, but when I called the school he was\ntelling the truth. After arguing for a while, they were willing to let him use a\nrestroom in the office, with administrators around him. My son is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "息子からのメールによると、とてもひどいウンコがしたいとのことで、すべてのトイレが\nトイレには鍵がかかっていた。信じられませんでしたが、学校に電話してみると、息子は本当のことを言っていました。\n本当だったのです。暫く議論した後、学校側は息子にオフィスのトイレを使わせてくれることになりました。\nオフィスのトイレを使わせてくれることになりましたが、周りには管理者がいました。私の息子は...",
      "title": "tik tocの流行のために、私の息子の学校はすべてのトイレを閉鎖しました。これは合法ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我儿子刚给我发短信说他要大便，非常糟糕，而且所有的\n厕所都锁上了。我本来不相信他，但当我给学校打电话时，他说的是真的。\n他说的是实话。在争论了一段时间后，他们愿意让他使用办公室里的厕所。\n他们愿意让他在办公室里使用洗手间，周围有管理人员。我的儿子是...",
      "title": "因为一个嘀嘀嗒嗒的趋势，我儿子的学校关闭了所有的浴室。这合法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我兒子剛給我發短信說他要大便，非常糟糕，而且所有的\n廁所都鎖上了。我本來不相信他，但當我給學校打電話時，他說的是真的。\n他說的是實話。在爭論了一段時間後，他們願意讓他使用辦公室裏的廁所。\n他們願意讓他在辦公室裏使用洗手間，周圍有管理人員。我的兒子是...",
      "title": "因爲一個嘀嘀嗒嗒的趨勢，我兒子的學校關閉了所有的浴室。這合法嗎？"
    }
  ]
}