{
  "author": "RjDaGOAT",
  "original_created_utc": 1636939307,
  "title": "Which crypto are you most bearish on despite this sub being bullish on?",
  "created_utc": 1636957865,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pretty straightforward. This sub is bullish on quite a few projects. Of this sub’s favorites, which one do you go against the grain on and are actually bearish?</p>\n\n<p>I’ll start: ALGO</p>\n\n<p>Disclaimer: I do own a small bag of ALGO.</p>\n\n<p>I was quite bullish on ALGO when it was below $1, but now I’m not so sure. It saw a big run up with other L1s in autumn such as SOL, AVAX, LUNA, etc. However, those coins run ups coincided with great increases in Total Value Locked (TVL). ALGO, on the other hand, did not see that rise. I still think ALGO has great potential and governance rewards are great, but I’m short term bearish on this project until we start seeing more dApps appear on it.</p>\n\n<p>With my opinion that you definitely don’t care about out of the way, what coin are you bearish on?</p>\n</div><!-- SC_ON -->",
  "score": 212,
  "permalink": "/r/CryptoCurrency/comments/qu4lpg/which_crypto_are_you_most_bearish_on_despite_this/",
  "subreddit": "CryptoCurrency",
  "id": "qu4lpg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pretty straightforward. This sub is bullish on quite a few projects. Of this\nsub’s favorites, which one do you go against the grain on and are actually\nbearish?\n\nI’ll start: ALGO\n\nDisclaimer: I do own a small bag of ALGO.\n\nI was quite bullish on ALGO when it was below $1, but now I’m not so sure.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かなり素直。このサブはかなりの数のプロジェクトで強気です。この\nこのサブのお気に入りの中で、あなたが逆らって実際に弱気になっているものはどれですか？\n弱気ですか？\n\nまずは私から。ALGO\n\n免責事項：私はALGOの小袋を所有しています。\n\nALGOが1ドルを切っていた頃はかなり強気だったが、今はそうでもない....",
      "title": "このサブが強気であるにもかかわらず、最も弱気になっている暗号は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "相当简单明了。这家子公司看好相当多的项目。在这个\n子的最爱，你对哪个项目持反对意见而实际上是\n看跌？\n\n我先说吧。ALGO\n\n免责声明：我确实拥有一小袋ALGO。\n\n在ALGO低于1美元时，我相当看好它，但现在我不太确定....。",
      "title": "尽管本子看涨，但你最看不起哪种加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "相當簡單明瞭。這家子公司看好相當多的項目。在這個\n子的最愛，你對哪個項目持反對意見而實際上是\n看跌？\n\n我先說吧。ALGO\n\n免責聲明：我確實擁有一小袋ALGO。\n\n在ALGO低於1美元時，我相當看好它，但現在我不太確定....。",
      "title": "儘管本子看漲，但你最看不起哪種加密貨幣？"
    }
  ]
}