{
  "author": "jessedjd",
  "the_new_excerpt": "As my investments grow, I realized I've been doing this on my own. Its not like\nI'm hiding anything from my wife. She knows how much I've invested, she just\ndoesn't know how to access it in case something happens. I'm currently writing\neverything up for her, and leaving it in our safe. I suggest for…",
  "original_created_utc": 1618810833,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資額が増えてくると、今までは自分でやっていたことに気がつきました。妻に隠していたわけでもなく\n妻に何かを隠しているわけではありません。妻は私がいくら投資したか知っていますが、知らないだけです。\n何かあったときにどうやってアクセスすればいいのかわからないだけです。現在、私は彼女のためにすべてを書き\n彼女のためにすべてを書き出して、我が家の金庫に置いています。私が提案するのは...",
      "title": "妻や夫に財布の出し入れ方法を教えたり、死亡時の具体的な指示を残したりする。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着投资的增长，我意识到自己一直在做这个事情。它不像\n我有什么事瞒着我老婆。她知道我投资了多少，她只是...\n不知道如何访问它，以备不测。我现在正在写\n把所有的东西都给她，然后放在我们的保险箱里。我建议...",
      "title": "教导你的妻子/丈夫如何取用你的钱包，或者在死亡时留下具体的指示。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着投資的增長，我意識到自己一直在做這個事情。它不像\n我有什麼事瞞着我老婆。她知道我投資了多少，她只是...\n不知道如何訪問它，以備不測。我現在正在寫\n把所有的東西都給她，然後放在我們的保險箱裏。我建議...",
      "title": "教導你的妻子/丈夫如何取用你的錢包，或者在死亡時留下具體的指示。"
    }
  ],
  "title": "Teach your wife/husband about how to access your wallets, or leave specific instructions in case of death.",
  "created_utc": 1618824660,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As my investments grow, I realized I&#39;ve been doing this on my own. Its not like I&#39;m hiding anything from my wife. She knows how much I&#39;ve invested, she just doesn&#39;t know how to access it in case something happens. I&#39;m currently writing everything up for her, and leaving it in our safe. I suggest for the married men/women out there, set a plan. Or something set up for your kids/next of kin. Write it down and keep it safe. Update it regularly, and walk them through it on occasion. Stay safe, and enjoy your crypto.</p>\n</div><!-- SC_ON -->",
  "score": 3073,
  "permalink": "/r/CryptoCurrency/comments/mtu1kv/teach_your_wifehusband_about_how_to_access_your/",
  "subreddit": "CryptoCurrency",
  "id": "mtu1kv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521469
}