{
  "author": "down_vote_magnet",
  "original_created_utc": 1642522759,
  "title": "Was there a common acceptance in the ancient world that the gods of others were as 'real' as one's own? Were empires/tribes afraid of angering foreign gods through the act of war? After conquering a foreign power, would the other's gods be assimilated into their own culture, or discarded?",
  "created_utc": 1642556541,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The crux of my question is whether people generally believed that only their own gods existed, or if they accepted the discovery of new gods when encountering foreign tribes.&lt;/p&gt;\n\n&lt;p&gt;Ancient history has many recorded incidents of foreign gods, temples and other symbols of religion being disrespected, desecrated or destroyed entirely during conflict. Were people afraid of repercussions from gods they had newly encountered but nevertheless disrespected?&lt;/p&gt;\n\n&lt;p&gt;What was the intent behind these kinds of actions?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;To deliberately disrespect those gods, because they believed them to be real but &amp;#39;allied with&amp;#39; their enemies?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;To simply offend the people or eradicate their religion, with no belief in their gods?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Did people believe that their own gods would protect them against foreign gods that might be angry?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/AskHistorians/comments/s7174x/was_there_a_common_acceptance_in_the_ancient/",
  "subreddit": "AskHistorians",
  "id": "s7174x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The crux of my question is whether people generally believed that only their own\ngods existed, or if they accepted the discovery of new gods when encountering\nforeign tribes.\n\nAncient history has many recorded incidents of foreign gods, temples and other\nsymbols of religion being disrespected,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の疑問の核心は、人々は一般的に、自分たちだけのものだと信じていたのか、ということです。\n神々が存在したのか、それとも新しい神々の発見を受け入れたのか。\n外来種族。\n\n古代の歴史には、異民族の神々や寺院などの事件が数多く記録されています。\n宗教の象徴が軽んじられる、...",
      "title": "古代世界では、他人の神々も自分の神々と同様に「本物」であるとする考え方が一般的だったのでしょうか。帝国や部族は戦争という行為によって外国の神々を怒らせることを恐れていたのだろうか。外国を征服した後、相手の神々は自国の文化に同化されたのか、それとも捨てられたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的问题的核心是，人们是否普遍相信只有他们自己的神存在？\n神的存在，还是他们在遇到外国部落时接受新神的发现？\n外国部落时，他们是否接受发现新的神。\n\n古代历史上有许多关于外国神、庙宇和其他宗教象征被不尊重的事件记录。\n宗教的象征被不尊重，...",
      "title": "古代世界是否普遍接受别人的神和自己的神一样 \"真实\"？帝国/部落是否害怕通过战争行为激怒外国神灵？在征服了一个外国势力之后，对方的神会被同化到他们自己的文化中，还是被抛弃？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的問題的核心是，人們是否普遍相信只有他們自己的神存在？\n神的存在，還是他們在遇到外國部落時接受新神的發現？\n外國部落時，他們是否接受發現新的神。\n\n古代歷史上有許多關於外國神、廟宇和其他宗教象徵被不尊重的事件記錄。\n宗教的象徵被不尊重，...",
      "title": "古代世界是否普遍接受別人的神和自己的神一樣 \"真實\"？帝國/部落是否害怕通過戰爭行爲激怒外國神靈？在征服了一個外國勢力之後，對方的神會被同化到他們自己的文化中，還是被拋棄？"
    }
  ]
}