{
  "author": "down_vote_magnet",
  "original_created_utc": 1642522759,
  "title": "Was there a common acceptance in the ancient world that the gods of others were as 'real' as one's own? Were empires/tribes afraid of angering foreign gods through the act of war? After conquering a foreign power, would the other's gods be assimilated into their own culture, or discarded?",
  "created_utc": 1642556541,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The crux of my question is whether people generally believed that only their own gods existed, or if they accepted the discovery of new gods when encountering foreign tribes.&lt;/p&gt;\n\n&lt;p&gt;Ancient history has many recorded incidents of foreign gods, temples and other symbols of religion being disrespected, desecrated or destroyed entirely during conflict. Were people afraid of repercussions from gods they had newly encountered but nevertheless disrespected?&lt;/p&gt;\n\n&lt;p&gt;What was the intent behind these kinds of actions?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;To deliberately disrespect those gods, because they believed them to be real but &amp;#39;allied with&amp;#39; their enemies?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;To simply offend the people or eradicate their religion, with no belief in their gods?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Did people believe that their own gods would protect them against foreign gods that might be angry?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/AskHistorians/comments/s7174x/was_there_a_common_acceptance_in_the_ancient/",
  "subreddit": "AskHistorians",
  "id": "s7174x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The crux of my question is whether people generally believed that only their own\ngods existed, or if they accepted the discovery of new gods when encountering\nforeign tribes.\n\nAncient history has many recorded incidents of foreign gods, temples and other\nsymbols of religion being disrespected,…"
}