{
  "author": "hardcoretuner",
  "original_created_utc": 1635562057,
  "title": "Fine. I'll say it. Millenials, GenX. If we start charging set values of crypto for goods and services. We can reclaim what the Boomers and Silent generation stole from us. They took our money. THEY RETIRED at 55. Get real. Time to reclaim it.",
  "created_utc": 1635582979,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They retired as early as 55. Many at 62. While I&#39;ll be working till I&#39;m dead. And I&#39;ve done all I can to prevent that. College, job at 50k out of school. I still won&#39;t get there. I didn&#39;t need my degree to understand that. Social security is theft at this point. Demand your paycheck in Cryptocurrency. You don&#39;t have to get USD for your job. More than just NFL players can ask for this. Many of you have salary jobs. All of them can be negotiable. Start with full salary as BTC. Then settle for bonus in ETH. Lol. We gotta make moves as a group. This is how crypto will get used and get real value.</p>\n</div><!-- SC_ON -->",
  "score": 174,
  "permalink": "/r/CryptoCurrency/comments/qisd6g/fine_ill_say_it_millenials_genx_if_we_start/",
  "subreddit": "CryptoCurrency",
  "id": "qisd6g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "They retired as early as 55. Many at 62. While I'll be working till I'm dead.\nAnd I've done all I can to prevent that. College, job at 50k out of school. I\nstill won't get there. I didn't need my degree to understand that. Social\nsecurity is theft at this point. Demand your paycheck in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らは55歳という早い段階で退職しました。多くは62歳で引退しました。一方、私は死ぬまで働くことになる。\nそれを防ぐために、私はできる限りのことをしてきました。大学を卒業して、5万円で仕事をした。I\n私はまだそこに到達していません。それを理解するのに、学位は必要ありませんでした。社会保障は\nこの時点で社会保障は窃盗です。で給料を要求して・・・。",
      "title": "いいよ。言いますよ。ミレニアル、ジェネックス。商品やサービスに対して設定した価値の暗号を課金するようになったら。ブーマーやサイレント世代が私たちから盗んだものを取り戻すことができます。彼らは私たちのお金を奪いました。彼らは55歳で引退しました。現実を見てください。奪い返す時が来たのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他们早在55岁就退休了。许多人62岁就退休了。而我却要工作到死。\n而且我已经做了我能做的一切来防止这种情况。大学，毕业后工作5万。I\n还是达不到这个目标。我不需要我的学位就能明白这一点。社会保障\n在这一点上，社会保障是偷窃。要求你的工资收入在...",
      "title": "好吧。我就说吧。千禧一代，X一代。如果我们开始对商品和服务收取设定价值的加密货币，那么 我们可以收回潮人和沉默的一代从我们这里偷走的东西。他们拿走了我们的钱。他们55岁就退休了。现实点吧。是时候夺回它了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們早在55歲就退休了。許多人62歲就退休了。而我卻要工作到死。\n而且我已經做了我能做的一切來防止這種情況。大學，畢業後工作5萬。I\n還是達不到這個目標。我不需要我的學位就能明白這一點。社會保障\n在這一點上，社會保障是偷竊。要求你的工資收入在...",
      "title": "好吧。我就說吧。千禧一代，X一代。如果我們開始對商品和服務收取設定價值的加密貨幣，那麼 我們可以收回潮人和沉默的一代從我們這裏偷走的東西。他們拿走了我們的錢。他們55歲就退休了。現實點吧。是時候奪回它了。"
    }
  ]
}