{
  "author": "pennyether",
  "the_new_excerpt": "You can either sit there and twiddle your green bean, or can you gawk at this\nepic set of DDs (delicately laced with euphemisms).\n\nWhy do squats in the cucumber patch when you can just buy…",
  "original_created_utc": 1623694178,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこに座ってインゲンをいじるか、それともこの\n壮大なDDのセットに目を奪われるか。\n\nキュウリ畑でスクワットをする必要はないでしょう。",
      "title": "$BGS - グリーン・ジャイアント™ディルド、WSBのクリーム"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可以坐在那里捻你的绿豆，或者你可以目不转睛地看着这个\n一组史诗般的DD（巧妙地加入委婉语）。\n\n为什么要在黄瓜地里做下蹲，而你可以直接买...",
      "title": "$BGS - Green Giant™ Dildos, and Cream of WSB"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可以坐在那裏捻你的綠豆，或者你可以目不轉睛地看着這個\n一組史詩般的DD（巧妙地加入委婉語）。\n\n爲什麼要在黃瓜地裏做下蹲，而你可以直接買...",
      "title": "$BGS - Green Giant™ Dildos, and Cream of WSB"
    }
  ],
  "title": "$BGS - Green Giant™ Dildos, and Cream of WSB",
  "created_utc": 1623719935,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You can either sit there and twiddle your green bean, or can you gawk at this epic set of DDs (delicately laced with euphemisms).</p>\n\n<p><a href=\"https://preview.redd.it/9356dlkmu9571.png?width=1560&amp;format=png&amp;auto=webp&amp;s=b4c05072704dd6ce4463b2e795650b9672849258\">Why do squats in the cucumber patch when you can just buy BGS?</a></p>\n\n<p><strong>TLDR:</strong></p>\n\n<ul>\n<li>Much more than a boomer value stock.</li>\n<li>Solid fundamentals, but who gives a shit. Has nice DDs.</li>\n<li>New <a href=\"https://bgfoods.com/investor-relations/news/article/14091/\">Big Dick CEO</a> starts <em>today</em>. He&#39;s literally led a company to Mars. Before that he was the overlord of tendies dipping sauces at Heinz.</li>\n<li>Priced at a discount to its peers, with significant Q2 and Q3 upside potential.</li>\n<li>Passes <a href=\"https://www.reddit.com/user/pennyether/comments/nzd2zi/whats_that_smell/\">the SMELL test</a>: 2nd highest SI of dividend stocks (BBBY is #1), low liquidity, low IV.</li>\n<li>It cums with the meme stocks. Basically like BBBY but IV = 40% instead of 110%.</li>\n<li>Sloppy seconds short squeeze potential: 1) growth-to-value rotation <em>or</em> 2) meme stocks squeeze again.</li>\n<li>Runs <a href=\"https://bgfoods.com/brands/\">a brothel</a>: Green Giant, Skinny Girl, Mama Mary&#39;s, Crisco, Cream of Wheat, etc.</li>\n<li>This is not financial advice and don&#39;t buy shit if the IV is through the roof.</li>\n</ul>\n\n<h1>Preface</h1>\n\n<p>This post comes to you after after discovering <a href=\"https://www.reddit.com/user/pennyether/comments/nzd2zi/whats_that_smell/\">the SMELL test</a> which lead to WWE opening her legs at +10%, climaxing at +25%, and cuddling to +11% at close.  All this on a day with zero news, except my one <a href=\"https://www.reddit.com/r/wallstreetbets/comments/nvcyxf/wwe_can_you_smell_what_the_stock_is_cooking/\">moderately successful WSB post</a>.</p>\n\n<p>WWE&#39;s IV of 35% implied a 2.2% stddev in daily price change... so an 11% close represents a 5 sigma event. My take is that WWE got pregnant after getting fucked by WSB wearing <em>five</em> condoms. I think MMs got defensive by pumping up the ask and IVs during PM, possibly due to seeing sentiment pop. (Unfortunately, it didn&#39;t take WWE long to start showing pregnancy sickness -- she regurgitated some gains in the last couple of days.)</p>\n\n<p>WWE definitely came, and so did I. My FDs were up 2500%, and Jan LEAPs up 250%. However, in an act of sheer horniness after spending all day furiously writing the DD, I had posted it after close. So only those able to get in at open were able to appreciate the climax. <strong>I&#39;m not making that mistake this time.</strong></p>\n\n<h2>My point is: if you&#39;re looking for a broad who is so fertile that even a modest amount of WSB autist-sperm can knock her up a few points, then go for a SMELLy broad... they get knocked up easily.</h2>\n\n<p>In this case, I&#39;m going gay and hoping BGS&#39;s <a href=\"https://bgfoods.com/brands/green-giant\">Green Giant</a> shows us more of his giant green cock. The fun doesn&#39;t stop there.. he&#39;ll bring along <a href=\"https://bgfoods.com/brands/clabber-girl/\">Ass-Clapper Girl</a>, some <a href=\"https://bgfoods.com/brands/skinnygirl-dressings/\">anorexic bitch</a>, a <a href=\"https://bgfoods.com/brands/mama-marys/\">certified MILF</a>, and hell, even <a href=\"https://bgfoods.com/brands/grandmas/\">Grandma</a>! They&#39;ll even bring some <a href=\"https://bgfoods.com/brands/crisco/\">Crisco</a> -- anything to make you <a href=\"https://bgfoods.com/brands/cream-of-wheat/\">cream</a> or have a <a href=\"https://bgfoods.com/brands/bakers-joy/\">perfect release</a>. If the thrill of evading the law is more your thing, they can bring along <a href=\"https://bgfoods.com/brands/ortega/\">some</a> <a href=\"https://bgfoods.com/brands/buena-vida/\">illegal</a> <a href=\"https://bgfoods.com/brands/las-palmas/\">immigrants</a>, too.</p>\n\n<p>The Aristocrats aside, BGS&#39;s <strong>S</strong>hort interest, <strong>M</strong>arket cap, <strong>L</strong>ow IV, and <strong>L</strong>iquidity make it one SMELLy bitch. As for <strong>F</strong>undamentals, I think they&#39;re solid. She&#39;s got a good heart, but who the fuck cares about that when she&#39;s got lovely DDs? Besides, &quot;f&quot; can&#39;t be jammed into a clever acronym. (Ok, I&#39;m a softy and I actually care and I&#39;ve included some fundamentals in this post.)</p>\n\n<p>Add to that some aphrodisiacs:</p>\n\n<ul>\n<li><a href=\"https://bgfoods.com/investor-relations/news/article/14091/\">New big dick CEO</a> that deployed a turnaround story literally to Mars, prior to that he led Heinz&#39;s tendies dipping sauce team.</li>\n<li>Q2 guidance teabagged the stock, so a surprise beat is very possible. Same for Q3.</li>\n<li>Market Tailwinds: &quot;growth to value&quot; pick, should the trend continue. High divs, underpriced wrt peers.</li>\n<li>Correlates with other squeeze stocks... is it still open season on shorts or nah?</li>\n<li>Options are cheap as fuck (IV = 41%).</li>\n</ul>\n\n<p>...aaaaaand I&#39;m hard.</p>\n\n<p>Alright. Enough foreplay. Let&#39;s get sniffing.</p>\n\n<h1>I. A Brief History of B&amp;G</h1>\n\n<p>The <a href=\"https://bgfoods.com/about/history/\">full history</a> of this perverted company is actually quite interesting, probably, if you read it. I didn&#39;t read it, I just mostly looked at the pictures:</p>\n\n<ul>\n<li>In 1822 some Englishman started a condiment business in Boston in 1822, most likely to pay for the most advanced oral cosmetics of the day.</li>\n<li>He then sells canned goods to Union troops.</li>\n<li>That guy dies, but his freaky perverted goth sons takes over and make a deal with the devil to sell some unholy canned mixture of ground ham and &quot;special&quot; seasonings.</li>\n<li>By 1889 two of these perverts become street walkers in Manhattan selling pickles by yelling &quot;get yer edible green dildos, here!&quot; from a horse and buggy.</li>\n<li>In 1893 they they latch onto the BBC trend, and offer the not so subtle &quot;Cream of Wheat&quot;</li>\n<li>While all this is going on, Mama Ortega squeezes out 13 kids, the 11th one establishes the &quot;Ortega&quot; brand.</li>\n<li>I guess the freaky sons decided it a good idea to conglomerate a huge harem of the freakiest sounding brand names. Something about bagel chips too.</li>\n<li>The rest is history!</li>\n</ul>\n\n<p>In short, B&amp;G has a solid history of selling phallic foods and acquiring <a href=\"https://bgfoods.com/brands/\">euphemistic memeable brands</a> to create some sort of weird food brothel:</p>\n\n<ul>\n<li>Green Giant</li>\n<li>Cream of Wheat</li>\n<li>Crisco</li>\n<li>Skinny Girl</li>\n<li>Clabber Girl</li>\n<li>Baker&#39;s Joy</li>\n<li>Moma Mary&#39;s</li>\n<li>Grandma&#39;s</li>\n<li>Accent Flavor Enhancer</li>\n</ul>\n\n<p>A true hags to riches story, this pimp of a company posted a record of $505m in Q1 sales, even in the face of supply shortages.</p>\n\n<h1>II. Fundamentals</h1>\n\n<h2>Comps</h2>\n\n<p>First, let&#39;s head to the red light district and do some window shopping:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Ticker</th>\n<th align=\"left\">Name</th>\n<th align=\"left\">NTM TEV/REV</th>\n<th align=\"left\">NTM TEV/EBITDA</th>\n<th align=\"left\">NTM P/E</th>\n<th align=\"left\">NTM MC/FCF</th>\n<th align=\"left\">Last Price</th>\n<th align=\"left\">Mean Analyst Target</th>\n<th align=\"left\">Market Cap</th>\n<th align=\"left\">TEV</th>\n<th align=\"left\">Dividend Yield</th>\n<th align=\"left\">SI % Free Float (Ortex Est.)</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">BGS</td>\n<td align=\"left\">B&amp;G Foods, Inc.</td>\n<td align=\"left\">2.18x</td>\n<td align=\"left\">11.97x</td>\n<td align=\"left\">15.03x</td>\n<td align=\"left\">10.92x</td>\n<td align=\"left\">$32.99</td>\n<td align=\"left\">$28.29</td>\n<td align=\"left\">$2.14B</td>\n<td align=\"left\">$4.46B</td>\n<td align=\"left\">6.27%</td>\n<td align=\"left\">21.92%</td>\n</tr>\n<tr>\n<td align=\"left\">MDLZ</td>\n<td align=\"left\">Mondelez International, Inc.</td>\n<td align=\"left\">3.82x</td>\n<td align=\"left\">18.12x</td>\n<td align=\"left\">21.67x</td>\n<td align=\"left\">19.41x</td>\n<td align=\"left\">$63.78</td>\n<td align=\"left\">$68.07</td>\n<td align=\"left\">$91.38B</td>\n<td align=\"left\">$109.58B</td>\n<td align=\"left\">2.10%</td>\n<td align=\"left\">1.00%</td>\n</tr>\n<tr>\n<td align=\"left\">KHC</td>\n<td align=\"left\">The Kraft Heinz Company</td>\n<td align=\"left\">3.14x</td>\n<td align=\"left\">12.82x</td>\n<td align=\"left\">16.87x</td>\n<td align=\"left\">12.79x</td>\n<td align=\"left\">$43.42</td>\n<td align=\"left\">$43.04</td>\n<td align=\"left\">$53.11B</td>\n<td align=\"left\">$78.30B</td>\n<td align=\"left\">4.00%</td>\n<td align=\"left\">2.14%</td>\n</tr>\n<tr>\n<td align=\"left\">GIS</td>\n<td align=\"left\">General Mills, Inc.</td>\n<td align=\"left\">2.83x</td>\n<td align=\"left\">13.61x</td>\n<td align=\"left\">16.97x</td>\n<td align=\"left\">17.30x</td>\n<td align=\"left\">$62.52</td>\n<td align=\"left\">$62.57</td>\n<td align=\"left\">$38.14B</td>\n<td align=\"left\">$50.13B</td>\n<td align=\"left\">3.64%</td>\n<td align=\"left\">3.38%</td>\n</tr>\n<tr>\n<td align=\"left\">ADM</td>\n<td align=\"left\">Archer-Daniels-Midland Company</td>\n<td align=\"left\">0.68x</td>\n<td align=\"left\">12.02x</td>\n<td align=\"left\">15.68x</td>\n<td align=\"left\">16.62x</td>\n<td align=\"left\">$66.00</td>\n<td align=\"left\">$68.21</td>\n<td align=\"left\">$36.87B</td>\n<td align=\"left\">$48.45B</td>\n<td align=\"left\">2.54%</td>\n<td align=\"left\">0.85%</td>\n</tr>\n<tr>\n<td align=\"left\">HRL</td>\n<td align=\"left\">Hormel Foods Corporation</td>\n<td align=\"left\">2.41x</td>\n<td align=\"left\">17.62x</td>\n<td align=\"left\">26.19x</td>\n<td align=\"left\">32.69x</td>\n<td align=\"left\">$48.78</td>\n<td align=\"left\">$45.44</td>\n<td align=\"left\">$26.44B</td>\n<td align=\"left\">$25.98B</td>\n<td align=\"left\">2.06%</td>\n<td align=\"left\">5.48%</td>\n</tr>\n<tr>\n<td align=\"left\">MKC</td>\n<td align=\"left\">McCormick &amp; Company, Incorporated</td>\n<td align=\"left\">4.77x</td>\n<td align=\"left\">21.86x</td>\n<td align=\"left\">29.91x</td>\n<td align=\"left\">14.00x</td>\n<td align=\"left\">$88.85</td>\n<td align=\"left\">$88.68</td>\n<td align=\"left\">$23.72B</td>\n<td align=\"left\">$29.10B</td>\n<td align=\"left\">1.54%</td>\n<td align=\"left\">1.60%</td>\n</tr>\n<tr>\n<td align=\"left\">K</td>\n<td align=\"left\">Kellogg Company</td>\n<td align=\"left\">2.21x</td>\n<td align=\"left\">13.09x</td>\n<td align=\"left\">15.91x</td>\n<td align=\"left\">15.51x</td>\n<td align=\"left\">$65.16</td>\n<td align=\"left\">$68.55</td>\n<td align=\"left\">$22.19B</td>\n<td align=\"left\">$30.64B</td>\n<td align=\"left\">3.60%</td>\n<td align=\"left\">7.05%</td>\n</tr>\n<tr>\n<td align=\"left\">CAG</td>\n<td align=\"left\">Conagra Brands, Inc.</td>\n<td align=\"left\">2.54x</td>\n<td align=\"left\">12.16x</td>\n<td align=\"left\">14.88x</td>\n<td align=\"left\">14.32x</td>\n<td align=\"left\">$37.33</td>\n<td align=\"left\">$39.29</td>\n<td align=\"left\">$17.92B</td>\n<td align=\"left\">$27.42B</td>\n<td align=\"left\">2.87%</td>\n<td align=\"left\">3.39%</td>\n</tr>\n</tbody></table>\n\n<p>You can see BGS is trading at a significant discount to her peers.</p>\n\n<p>Why?</p>\n\n<p>Well, beauty is in the eye of the beholder. One take is past company leadership hasn&#39;t been strong in developing and executing plans for growth or evolution of the company. They paid an unnecessarily high dividend at times (at various points it was a double digit % dividend), and prior management decided to accrue debt to complete deals even as it continued to pay high dividends.</p>\n\n<p>They&#39;re also being shorted.</p>\n\n<p>Their business is solid, though. From my perspective, I see a librarian with some light acne but with deep set sexual perversions just waiting for the right chad to unleash her. She&#39;s got nothing wrong with her, but she can&#39;t really sexually express herself comfortably -- until now she&#39;s just been dating some lazy ass cuck that can&#39;t find the clit.</p>\n\n<p>Basically: It’s easier to fix broken management decisions quickly than to fix a broken underlying business. In BGS you have the former rather than the latter.</p>\n\n<p>So how exactly will management get fixed?</p>\n\n<h2>New CEO</h2>\n\n<p>Enter Kenneth &quot;Clit Killer&quot; Keller. Announced May 11th just before the Q1 earnings call, and starts this very day. Mans can find the clit.</p>\n\n<p>You can read <a href=\"https://bgfoods.com/investor-relations/news/article/14091/\">the bio</a>, or just get erect right now:</p>\n\n<p><strong>☑ M&amp;A of a larger, high growth business</strong></p>\n\n<blockquote>\n<p>Most recently, Mr. Keller served as president and CEO of JDE Peet’s NV, a $7 billion global coffee and tea company with over 20,000 employees based in Amsterdam, The Netherlands. He led the merger of Jacobs Douwe Egberts (JDE) and Peet’s Coffee, Inc. and the successful initial public offering of the combined company in May 2020.</p>\n</blockquote>\n\n<p><strong>☑ Has literally led a company to Mars.</strong> <strong>☑ Can deliver a turnaround.</strong></p>\n\n<blockquote>\n<p>Prior to that, Mr. Keller served as global president of the Wm. Wrigley Jr. Company, a subsidiary of Mars, Inc., where he was responsible for delivering sales and profit growth across the global gum, mints and candy business. In the United States, the company’s largest global market, Mr. Keller led a turnaround of the Wrigley business, delivering growth well above the industry average. During the integration of Wrigley into Mars, Mr. Keller helped establish the global business units and strategy for the combined Mars-Wrigley confectionery business</p>\n</blockquote>\n\n<p><strong>☑ Former overlord of tendies dipping sauces.</strong></p>\n\n<blockquote>\n<p>He also worked at the H.J. Heinz Company in both the United States and Europe, leading the ketchup, condiments and sauces division in the United States</p>\n</blockquote>\n\n<p>This guy has a solid track record of both turning around and growing companies that deal with packages that consumers put in their mouths (packaged foods, that is). It&#39;s a great sign he chose BGS for his next gig.</p>\n\n<h2>Q1 earnings, Q2 guidance</h2>\n\n<p>First a reminder that this company absolutely crushed it during the start of COVID, where doomsday prepping of canned and frozen goods took hold. So, YoY comparisons were tough to beat. But beat them off it did.</p>\n\n<p>Net sales in Q1 rose to $505, from $449m last year, despite it being a tough comparison. The Crisco acquisition and strong net sales in the Spices and Seasonings brand area of $24.6 (47.5% Y/Y growth) more than offsetting reductions in Green Giant and other areas due to supply constraints (demand substantially exceeded supply -- a problem we all wish we had).</p>\n\n<p>E-commerce pimpery of their products increased by 60% Q1 &#39;20 vs Q1 &#39;21 to $50m. They expect it to grow to $250m for full year &#39;21, and are focused on growing that aspect of the business. They also have the option to put Skinny Girl on OF, though it wasn&#39;t mentioned in the call.</p>\n\n<p>The guidance for Q2? They&#39;re limited by supply, costs have risen, and last year&#39;s Q2 &#39;20 will be difficult to top due to people stuffing their <del>panties</del> pantries. <strong>This is very likely priced in,</strong> as management was quite conservative on their earnings call and transparent about the supply issues, which aren&#39;t particularly severe to begin with. It&#39;s a good problem to have.</p>\n\n<p><a href=\"https://www.barrons.com/articles/campbell-and-b-g-foods-have-outperformed-only-one-is-a-buy-for-this-analyst-51616436465\">Further evidence this is priced in</a>:</p>\n\n<blockquote>\n<p>By contrast, he downgraded B&amp;G Foods (BGS) to Neutral from Overweight, while maintaining a $31 price target. Lavery writes that he finds it difficult to see upside to the stock’s current valuation, especially as commodity-price inflation could lead to higher costs in the second half of this year and into 2022. That said, the company does have some ability to counteract this, like Campbell, via moves like hedging and price increases; even so, he estimates that B&amp;G Foods could face between 15% and 25% earnings per share risk this year—and next—if current commodity prices hold.</p>\n</blockquote>\n\n<h2>Addressing Risks</h2>\n\n<p>Analysts are treating BGS like it has ED, but <strong>Green Giant is a grower not a shower</strong>.</p>\n\n<p>BGS&#39; supply chain and sales are primarily integrated across US, Canada, and Mexico vs many peers&#39; more geographically dispersed sourcing and sales. BGS is thus well-insulated against global geopolitical/market trends toward de-globalization and global supply chain disruption risk, and has less exposure to ongoing COVID disruption due to North America&#39;s head start on vaccination and reopening.</p>\n\n<p>They also have a strong history and relationship sourcing their inputs, which should give them an edge over private brands that will struggle to source competitively in a supply environment that&#39;s tighter than your wife&#39;s hot friends.</p>\n\n<p>In short, anything they can source is sold, they&#39;re fuck buddies with COVID-proof and reliable growers, and as industry costs rise they can price better than the smaller off-brand competitors.</p>\n\n<p>Given the worst is priced in, a good growing season is all it would take for a significant impact on the share price.</p>\n\n<h1>III. Macro Tailwinds and Catalysts</h1>\n\n<h2>On COVID:</h2>\n\n<ul>\n<li>COVID lead to an unfortunate decline in eating out (pun intended, obviously). The upside to that is now consumers are slightly more apt at throwing frozen vegetables in the microwave. I expect that post-COVID people will remain more self-sufficient, and thus the demand for packaged goods will hopefully not decline much.</li>\n<li>Even if the above is wrong: BGS&#39;s foodservice sales, which took an ass pounding from COVID, saw the beginnings of an uptick in March. This corresponds to the start of general reopening across the US as vaccine availability accelerated. Foodservice were still at pre-COVID levels in Q1, so Q2 should capture much more of that recovery, which might surprise in terms of speed and scale.</li>\n<li>To the extent that people keep their COVID purchasing habits: As mentioned before: BGS e-commerce purchasing of their products increased by 60% Q1 &#39;20 vs Q1 &#39;21 to $50m. They expect it to grow to $250m for full year &#39;21, and are focused on growing that aspect of the business.</li>\n</ul>\n\n<h2>On the Growth to Value rotation:</h2>\n\n<ul>\n<li>A further market shift from growth to value would be welcomed. BGS had no performance anxiety during COVID and offers a <strong>6.3% yield</strong>, and has authorized a <strong>50m stock repurchase program</strong>.</li>\n<li>On the related subject of interest rates possibly rising: While they do have debt, they have limited exposure. The majority of their long-term debt, $1.45b is fixed-rate vs $906m variable rate.</li>\n</ul>\n\n<h2>Possible Catalysts:</h2>\n\n<ul>\n<li>As mentioned above, growth-to-value swing would really butter the biscuit.</li>\n<li>If we see early signs of persistent COVID outbreaks, or vaccine-resistant variants, there will be another rush on BGS products. Also, as a stock BGS has proved resilient and a surprise upside performer, so it will be high on the list of defensive stocks.</li>\n<li>Q2 earnings</li>\n<li>Good crops of veggies throughout rest of year.</li>\n<li>A short squeeze occurring from growth-to-value rotation</li>\n<li>A short squeeze occurring in meme stocks (see below)</li>\n</ul>\n\n<h1>IV. Technicals</h1>\n\n<h2>BGS SMELL Test</h2>\n\n<p><a href=\"https://www.reddit.com/user/pennyether/comments/nzd2zi/whats_that_smell/\">You can read about my SMELL test here.</a></p>\n\n<blockquote>\n<p>SMELL is my proprietary system scientifically engineered to maximize fear in the hearts of wall street. I identify tickers that have low liquidity (eg, their price moves up a lot per unit of inflow), but also have short interest and low implied volatility. I theorize this maximizes the chance that a squeeze or defensive posture by MMs happens, should a sustained inflow of capital occur. The result is, in theory, that buying inflows will lead to faster share price movements and rapid increases in IVs -- basically that options print.</p>\n</blockquote>\n\n<ul>\n<li><strong>S</strong>hort Interest: Exchange Reported: 25% float (May 28), Ortex: 22% (Jun 8).</li>\n<li><strong>M</strong>arket Cap: $2.14B</li>\n<li><strong>E</strong>xtremely Memeable: Green Giant. Crisco. Cream of Wheat.</li>\n<li><strong>L</strong>ow Liquidity: Avg Daily Volume: 1.18M shs ($39m), 1.8 % Market Cap, 72% inst ownership</li>\n<li><strong>L</strong>ow IV: ~40%</li>\n</ul>\n\n<p>Smells good to me. I like the 72% inst. ownership, as well.</p>\n\n<h2>Boomer Fundamentals, Meme Price Action</h2>\n\n<p>I didn&#39;t really see this ticker mentioned back in Jan, or during this squeeze cycle, but take a look here:</p>\n\n<p><a href=\"https://preview.redd.it/2648ua3pu9571.png?width=1560&amp;format=png&amp;auto=webp&amp;s=1ad31751c0d6634ac6fa8745ec435b6be14a4885\">It tracks with the memes, like BBBY</a></p>\n\n<p>It looks like BGS likes getting groped just as much as the other memes. If/when a squeeze happens to the others, I&#39;m betting that BGS rears its Green Giant Cock again. This is with zero catalysts -- I didn&#39;t find any <a href=\"https://www.reddit.com/r/wallstreetbets/search/?q=bgs+flair%3Add&amp;sort=top&amp;restrict_sr=on&amp;t=all\">posts for BGS</a> on or around Jun 2, when it last popped. So, most likely, this pop comes from short books being stressed elsewhere. This is good.</p>\n\n<p><strong>In fact, BGS is the second highest shorted dividend stock.</strong> First place? BBBY, which currently has an IV of 106%. Compare that to BGS&#39;s IV of 40%. Yeah, I&#39;ll be taking some LEAPs and seeing how squeeze season plays out.</p>\n\n<p>The conclusion here: If meme season doesn&#39;t squeeze BGS, there&#39;s the possibility of sloppy seconds coming from growth-to-value rotation.</p>\n\n<h2>More notes on Short Interest</h2>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/1oiuwdsqu9571.jpg?width=3535&amp;format=pjpg&amp;auto=webp&amp;s=cd56d6af80bf3155b974e631682f86d73e46c570\">Ortex Screenshot</a></p>\n\n<p>SI Peaked in mid May (before/during earnings), and has been tapering off as:</p>\n\n<ul>\n<li>Perhaps they fear the new CEO</li>\n<li>Squeeze season comes into full swing</li>\n</ul>\n\n<p>One of those will certainly continue, and the other is to be determined.</p>\n\n<h1>V. DeltaFlux (gamma/charm/vanna)</h1>\n\n<p>Let&#39;s head over to the deltaflux tables. I like to look at the options chain of tickers to approximate if/how deltahedging is likely to have an effect.</p>\n\n<h2>BGS -- $32.71 (-$0.46 [-1.39%]) -- <a href=\"https://old.reddit.com/user/pennyether/comments/ms7z36/deltaflux_tables_explained/\">DeltaFlux Tables Explained</a></h2>\n\n<p><strong>OI as of:</strong> Mon Jun 14 (at open) - <strong>Date used for DTE</strong>: Mon Jun 14, 2021 12:14 EST<strong>Weighted Avg IV:</strong> 50.07%, <strong>Shares:</strong> 64,750,000, <strong>Float:</strong> 63,430,000, <strong>Avg Vol (10d):</strong> 1,475,300</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Price Point</th>\n<th align=\"left\"># Shares DeltaHedged</th>\n<th align=\"left\">← % Float</th>\n<th align=\"left\">1% Price ∆flux (sh)</th>\n<th align=\"left\">← % Float / % Avg Vol</th>\n<th align=\"left\">24hr ∆flux (sh)</th>\n<th align=\"left\">← % Float / % Vol</th>\n<th align=\"left\">10% IV ∆flux (sh)</th>\n<th align=\"left\">← % Float / % Vol</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">$22.50</td>\n<td align=\"left\">-2,854,387</td>\n<td align=\"left\">-4.50</td>\n<td align=\"left\">54,992</td>\n<td align=\"left\">0.08 / 3.73</td>\n<td align=\"left\">-20,160</td>\n<td align=\"left\">-0.03 / -1.37</td>\n<td align=\"left\">103,286</td>\n<td align=\"left\">0.16 / 7.00</td>\n</tr>\n<tr>\n<td align=\"left\">$25.00</td>\n<td align=\"left\">-1,979,857</td>\n<td align=\"left\">-3.12</td>\n<td align=\"left\">107,662</td>\n<td align=\"left\">0.16 / 7.30</td>\n<td align=\"left\">-12,856</td>\n<td align=\"left\">-0.02 / -0.87</td>\n<td align=\"left\">96,675</td>\n<td align=\"left\">0.15 / 6.55</td>\n</tr>\n<tr>\n<td align=\"left\">$27.50</td>\n<td align=\"left\">-912,557</td>\n<td align=\"left\">-1.44</td>\n<td align=\"left\">114,528</td>\n<td align=\"left\">0.18 / 7.76</td>\n<td align=\"left\">-7,048</td>\n<td align=\"left\">-0.01 / -0.48</td>\n<td align=\"left\">80,345</td>\n<td align=\"left\">0.13 / 5.45</td>\n</tr>\n<tr>\n<td align=\"left\">$30.00</td>\n<td align=\"left\">213,233</td>\n<td align=\"left\">0.34</td>\n<td align=\"left\">151,636</td>\n<td align=\"left\">0.24 / 10.28</td>\n<td align=\"left\">-41,143</td>\n<td align=\"left\">-0.06 / -2.79</td>\n<td align=\"left\">82,723</td>\n<td align=\"left\">0.13 / 5.61</td>\n</tr>\n<tr>\n<td align=\"left\">$32.50</td>\n<td align=\"left\">1,621,584</td>\n<td align=\"left\">2.56</td>\n<td align=\"left\">195,276</td>\n<td align=\"left\">0.32 / 13.24</td>\n<td align=\"left\">-38,583</td>\n<td align=\"left\">-0.06 / -2.62</td>\n<td align=\"left\">44,557</td>\n<td align=\"left\">0.07 / 3.02</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>c - $32.71</strong></td>\n<td align=\"left\">1,747,885</td>\n<td align=\"left\">2.76</td>\n<td align=\"left\">196,734</td>\n<td align=\"left\">0.32 / 13.34</td>\n<td align=\"left\">-34,940</td>\n<td align=\"left\">-0.06 / -2.37</td>\n<td align=\"left\">38,756</td>\n<td align=\"left\">0.06 / 2.63</td>\n</tr>\n<tr>\n<td align=\"left\"><strong>o - $33.17</strong></td>\n<td align=\"left\">2,023,961</td>\n<td align=\"left\">3.19</td>\n<td align=\"left\">198,129</td>\n<td align=\"left\">0.32 / 13.43</td>\n<td align=\"left\">-25,415</td>\n<td align=\"left\">-0.04 / -1.72</td>\n<td align=\"left\">25,103</td>\n<td align=\"left\">0.04 / 1.70</td>\n</tr>\n<tr>\n<td align=\"left\">$35.00</td>\n<td align=\"left\">3,056,114</td>\n<td align=\"left\">4.82</td>\n<td align=\"left\">180,296</td>\n<td align=\"left\">0.30 / 12.22</td>\n<td align=\"left\">19,767</td>\n<td align=\"left\">0.03 / 1.34</td>\n<td align=\"left\">-31,256</td>\n<td align=\"left\">-0.05 / -2.12</td>\n</tr>\n<tr>\n<td align=\"left\">$37.50</td>\n<td align=\"left\">4,112,994</td>\n<td align=\"left\">6.48</td>\n<td align=\"left\">123,335</td>\n<td align=\"left\">0.21 / 8.36</td>\n<td align=\"left\">45,680</td>\n<td align=\"left\">0.07 / 3.10</td>\n<td align=\"left\">-73,873</td>\n<td align=\"left\">-0.12 / -5.01</td>\n</tr>\n<tr>\n<td align=\"left\">$40.00</td>\n<td align=\"left\">4,742,784</td>\n<td align=\"left\">7.48</td>\n<td align=\"left\">75,261</td>\n<td align=\"left\">0.13 / 5.10</td>\n<td align=\"left\">25,816</td>\n<td align=\"left\">0.04 / 1.75</td>\n<td align=\"left\">-72,589</td>\n<td align=\"left\">-0.11 / -4.92</td>\n</tr>\n<tr>\n<td align=\"left\">$42.50</td>\n<td align=\"left\">5,111,324</td>\n<td align=\"left\">8.06</td>\n<td align=\"left\">48,980</td>\n<td align=\"left\">0.08 / 3.32</td>\n<td align=\"left\">10,683</td>\n<td align=\"left\">0.02 / 0.72</td>\n<td align=\"left\">-62,438</td>\n<td align=\"left\">-0.10 / -4.23</td>\n</tr>\n<tr>\n<td align=\"left\">$45.00</td>\n<td align=\"left\">5,346,477</td>\n<td align=\"left\">8.43</td>\n<td align=\"left\">34,374</td>\n<td align=\"left\">0.06 / 2.33</td>\n<td align=\"left\">5,792</td>\n<td align=\"left\">0.01 / 0.39</td>\n<td align=\"left\">-54,325</td>\n<td align=\"left\">-0.09 / -3.68</td>\n</tr>\n<tr>\n<td align=\"left\">$47.50</td>\n<td align=\"left\">5,505,160</td>\n<td align=\"left\">8.68</td>\n<td align=\"left\">24,854</td>\n<td align=\"left\">0.04 / 1.68</td>\n<td align=\"left\">3,779</td>\n<td align=\"left\">0.01 / 0.26</td>\n<td align=\"left\">-46,639</td>\n<td align=\"left\">-0.07 / -3.16</td>\n</tr>\n</tbody></table>\n\n<h2>Notes</h2>\n\n<p>In my personal experience, gamma (1% price flux) values of &gt;0.30% float are significant, and I&#39;m surprised to see them given that the option chain seems pretty sparse. I imagine more OI would extend this ramp significantly. It&#39;s also nice that vanna (10% IV flux) is currently positive. My read is that short term movement to $35.00 is easily possible.</p>\n\n<p>2.75% of float currently deltahedged is a nothing burger. It&#39;s not tying up much float, and so I don&#39;t suspect the current option chain is subtracting from liquidity -- but I think liquidity is low to begin with. Of course, if OI blows up, this number is likely to skyrocket as well.</p>\n\n<p>What&#39;s exciting to me is the % avg volume -- I&#39;d consider &gt;4.00% to be pretty sizeable, and we&#39;re waaaay past that. If one were to believe that average volume were indicative of liquidity, then deltahedging could certainly start pushing the share price around, should it naturally move up (or down).</p>\n\n<p>For reference, here are some other tickers&#39; current peak values:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Ticker</th>\n<th align=\"left\">% DeltaHedged</th>\n<th align=\"left\">1% price flux % Float</th>\n<th align=\"left\">1% price flux % Avg Vol</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\"><strong>BGS</strong></td>\n<td align=\"left\">2.75%</td>\n<td align=\"left\">0.30%</td>\n<td align=\"left\">11.43%</td>\n</tr>\n<tr>\n<td align=\"left\">WWE (before pop)</td>\n<td align=\"left\">19.19%</td>\n<td align=\"left\">0.14%</td>\n<td align=\"left\">5.75%</td>\n</tr>\n<tr>\n<td align=\"left\">BBBY</td>\n<td align=\"left\">6.74%</td>\n<td align=\"left\">0.43%</td>\n<td align=\"left\">4.55%</td>\n</tr>\n<tr>\n<td align=\"left\">CLNE</td>\n<td align=\"left\">11.10%</td>\n<td align=\"left\">0.26%</td>\n<td align=\"left\">0.65%</td>\n</tr>\n<tr>\n<td align=\"left\">CLOV</td>\n<td align=\"left\">28.38%</td>\n<td align=\"left\">0.82%</td>\n<td align=\"left\">0.27%</td>\n</tr>\n<tr>\n<td align=\"left\">AMC</td>\n<td align=\"left\">23.75%</td>\n<td align=\"left\">0.25%</td>\n<td align=\"left\">0.42%</td>\n</tr>\n<tr>\n<td align=\"left\">GME</td>\n<td align=\"left\">18.38%</td>\n<td align=\"left\">0.39%</td>\n<td align=\"left\">1.50%</td>\n</tr>\n</tbody></table>\n\n<h1>VI. Positions and Closing Remarks</h1>\n\n<p>I see significant upside:</p>\n\n<ul>\n<li>Short Term: If squeeze season is still in effect, this currently tracks with meme stocks like BBBY. This is all without any significant coverage on WSB. If near-term rotation-to-value occurs, there is likely some upside there as well.</li>\n<li>Mid Term: Q2 guidance was conservative, and I believe the downside is priced in. Given that, a surprise Q2 is a major possibility. A slower rotation from growth to value would also work. BGS has a juicy dividend and is priced at a discount to its peers.</li>\n<li>Long Term: New CEO started <strong>today</strong>. Proven track record. For the foreseeable future, BGS will be limited only by supply, and not demand. I have faith on their ability to execute -- great relationships with suppliers and competitive pricing. Can reach price commensurate with its peers.</li>\n</ul>\n\n<p>I think downside is priced in, given some analysts did some scat play with it due to supply concerns.</p>\n\n<p>Other things I like:</p>\n\n<ul>\n<li>Passes the SMELL test</li>\n<li>Options are dirt cheap</li>\n<li>Green Giant, Crisco, Cream of Wheat</li>\n</ul>\n\n<h2>Don&#39;t YOLO, etc</h2>\n\n<p>None of this is financial advice. Don&#39;t go crazy with this and don&#39;t blame me if it doesn&#39;t moon. If share price or IV spike, then wait for a better entry or the next opportunity.</p>\n\n<h2>My positions</h2>\n\n<p>I&#39;m playing a little bit of everything. Yes, I have a lot of different calls, but this isn&#39;t a YOLO. It&#39;s about 5% of my options book.</p>\n\n<ul>\n<li>10% - Jun: $35 - Betting on miracle spike like with WWE.</li>\n<li>30% - Jul: $35, $37.50, $40 - Betting on squeeze season carrying BGS, and/or growth-to-value rotation.</li>\n<li>30% - Aug: $35, $37.50, $40 - Betting on Q2 blowout and/or growth-to-value rotation.</li>\n<li>20% - Jan: $35 - Betting long term CEO, Q2 and/or Q3 blowout. Valuation approaches that of peers.</li>\n<li>10% - Chance your wife has an STD</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 1669,
  "permalink": "/r/wallstreetbets/comments/nzszyd/bgs_green_giant_dildos_and_cream_of_wsb/",
  "subreddit": "wallstreetbets",
  "id": "nzszyd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009750271
}