{
  "author": "partymsl",
  "original_created_utc": 1643837773,
  "title": "MOONS are definetly a s*itcoin. No utility, no liquidy or even a roadmap.",
  "created_utc": 1643856123,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This sub is very anti-shitcoin and sure why shouldn&amp;#39;t it be, people are thinking some just made shitcoins are a better investment than some utility crypto. Over the longterm the utility always wins and hype leaves.&lt;/p&gt;\n\n&lt;p&gt;But thus subs own crypto MOONS are also, definitely, a shitcoin. It&amp;#39;s far away from any utility, let liquidy be it is not even listed on ANY good-enough exchanges, let alone the major ones. There is no easy or understandable way from selling those apart from a 45 step swap.&lt;/p&gt;\n\n&lt;p&gt;And there is no real roadmap for the near future with specific dates. The only thing we know is that a mainnet is coming. Someday.&lt;/p&gt;\n\n&lt;p&gt;I definitely do not say MOONS will forever be shit, but they for now are and there is no point against that and in also sure people are currently working to change that and I appreciate those people.&lt;/p&gt;\n\n&lt;p&gt;Just don&amp;#39;t push MOONS as some breakout crypto for now...&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/sj0nb0/moons_are_definetly_a_sitcoin_no_utility_no/",
  "subreddit": "CryptoCurrency",
  "id": "sj0nb0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This sub is very anti-shitcoin and sure why shouldn't it be, people are thinking\nsome just made shitcoins are a better investment than some utility crypto. Over\nthe longterm the utility always wins and hype leaves.\n\nBut thus subs own crypto MOONS are also, definitely, a shitcoin. It's far away\nfrom…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブは非常にアンチシットコインで、なぜそうしてはいけないのか、人々は考えています。\nただ作られただけのクソコインが、実用的な暗号よりも良い投資先である。以上\n長期的には常に実用的なものが勝ち、誇大広告は去っていく。\n\nしかし、このようにサブスクリプションのMOONSもまた、間違いなく、クソコインなのです。それは遠く離れている\nから...",
      "title": "MOONSは間違いなくス○イトコインです。実用性もなく 流動性もなく ロードマップさえもありません"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个子是非常反对屎币的，当然，为什么不应该是这样，人们认为\n一些刚刚制造出来的狗屎币是比一些实用的加密货币更好的投资。在\n长期来看，实用性总是赢的，而炒作则会离开。\n\n但因此次自己的加密货币MOONS也是，绝对是一个狗屎币。它离\n离...",
      "title": "月球绝对是一个**的硬币。没有实用性，没有流动性，甚至没有路线图。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個子是非常反對屎幣的，當然，爲什麼不應該是這樣，人們認爲\n一些剛剛製造出來的狗屎幣是比一些實用的加密貨幣更好的投資。在\n長期來看，實用性總是贏的，而炒作則會離開。\n\n但因此次自己的加密貨幣MOONS也是，絕對是一個狗屎幣。它離\n離...",
      "title": "月球絕對是一個**的硬幣。沒有實用性，沒有流動性，甚至沒有路線圖。"
    }
  ]
}