{
  "author": "8512764EA",
  "original_created_utc": 1625750073,
  "title": "Banks not letting people deposit to Binance? Why are you surprised? Elizabeth Warren calling for more regulation? Why are you surprised? Media spreading FUD 24/7? Why are you surprised? The bigger this gets, the more control they’ll want. Don’t be surprised.",
  "created_utc": 1625758294,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Any time the little guys start winning, the elite can’t help themselves but to try to fuck them over. </p>\n\n<p>They act like we’re too stupid to handle risk and they pass their regulations to “protect” us. </p>\n\n<p>Stop banking with these banks. Stop voting for these control freaks. Stop clicking the clickbait FUD. </p>\n\n<p>It’s only going to get worse.</p>\n</div><!-- SC_ON -->",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/og6ynd/banks_not_letting_people_deposit_to_binance_why/",
  "subreddit": "CryptoCurrency",
  "id": "og6ynd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Any time the little guys start winning, the elite can’t help themselves but to\ntry to fuck them over.\n\nThey act like we’re too stupid to handle risk and they pass their regulations to\n“protect” us.\n\nStop banking with these banks. Stop voting for these control freaks. Stop\nclicking the clickbait…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "小物が勝ち始めると、エリートはどうしようもなく、彼らをやっつけようとする。\n彼らを打ち負かそうとする。\n\n私たちがリスクを扱えないほど愚かであるかのように振る舞い、私たちを「守る」ために規制を通すのです。\n我々を \"保護 \"するために規制を設ける。\n\nこれらの銀行との取引をやめましょう。このようなコントロールフリークに投票するのはやめましょう。やめましょう。\nクリックベイトをやめよう",
      "title": "銀行がBinanceへの入金を許可していない？なぜ驚いたのか？エリザベス・ウォーレンが規制強化を要求？なぜ驚くのですか？メディアが24時間365日FUDを流している？なぜあなたは驚くのですか？これが大きくなればなるほど、彼らはもっとコントロールしたくなるだろう。驚くことはない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何时候，只要小人物开始赢了，精英们就会情不自禁地去\n试图把他们搞垮。\n\n他们表现得好像我们太傻了，无法处理风险，他们通过他们的法规来\n来 \"保护 \"我们。\n\n停止与这些银行合作。不要再给这些控制狂投票了。停止\n点击诱饵...",
      "title": "银行不允许人们向Binance存款？你为什么会感到惊讶？伊丽莎白-沃伦呼吁加强监管？你为什么会感到惊讶？媒体24小时不间断地散布虚假信息？你为什么会感到惊讶？这事越大，他们就越想控制。不要惊讶。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何時候，只要小人物開始贏了，精英們就會情不自禁地去\n試圖把他們搞垮。\n\n他們表現得好像我們太傻了，無法處理風險，他們通過他們的法規來\n來 \"保護 \"我們。\n\n停止與這些銀行合作。不要再給這些控制狂投票了。停止\n點擊誘餌...",
      "title": "銀行不允許人們向Binance存款？你爲什麼會感到驚訝？伊麗莎白-沃倫呼籲加強監管？你爲什麼會感到驚訝？媒體24小時不間斷地散佈虛假信息？你爲什麼會感到驚訝？這事越大，他們就越想控制。不要驚訝。"
    }
  ]
}