{
  "author": "tihotihotiho",
  "original_created_utc": 1624600424,
  "title": "Why is slavery in America talked about so much, but not the slavery and subjugation by Britain and other empires?",
  "created_utc": 1624653713,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m bringing up Britain because my family originated from a country that they colonized. My family&#39;s life under the british was hell-- violence,  famine, genocide. Many were shipped off to Carribean islands and other places to work as indentured servants. etc. This was within Queen Elizabeth&#39;s lifetime, it&#39;s not some distant past.</p>\n\n<p>I see a lot of content and discourse about the truths and effects of American slavery-- and I&#39;ve seen this dominance of discourse worldwide. When I lived in Britain, people were more likely to know and speak on the American atrocities than the ones done directly by their own government. There seems to be a feeling that somehow what America did was worse. (someone very highly educated tried to tell me my country profited from british subjugation because of the railways they left behind...go figure).</p>\n\n<p>So yeah. Is there something I&#39;m missing-- why is there so much focus on America, when other empires like the brits have never even apologizes for what they did, and no one seems to care that much.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/o7hl9s/why_is_slavery_in_america_talked_about_so_much/",
  "subreddit": "TooAfraidToAsk",
  "id": "o7hl9s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm bringing up Britain because my family originated from a country that they\ncolonized. My family's life under the british was hell-- violence, famine,\ngenocide. Many were shipped off to Carribean islands and other places to work as\nindentured servants. etc. This was within Queen Elizabeth's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がイギリスを持ち出したのは、私の家族がイギリスが植民地化した国の出身だからです。\n植民地化した国の出身だからです。イギリスの下での私の家族の生活は地獄でした...暴力、飢饉、大虐殺。\n大虐殺でした。多くの人がカリブ諸島などに送られ、年季奉公人として働かされました。\n私の家族の生活は地獄でした。これは、エリザベス女王の...",
      "title": "なぜアメリカの奴隷制度はよく語られるのに、イギリスや他の帝国による奴隷制度や服従は語られないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我提到英国，是因为我的家庭来自一个被他们殖民的国家。\n殖民化的国家。我的家人在英国人统治下的生活是地狱般的存在--暴力、饥荒。\n种族灭绝。许多人被运到加勒比岛国和其他地方去做契约仆人。\n契约仆人。等等。这是在伊丽莎白女王的...",
      "title": "为什么美国的奴隶制被谈得那么多，而英国和其他帝国的奴隶制和征服却没有被谈及？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我提到英國，是因爲我的家庭來自一個被他們殖民的國家。\n殖民化的國家。我的家人在英國人統治下的生活是地獄般的存在--暴力、饑荒。\n種族滅絕。許多人被運到加勒比島國和其他地方去做契約僕人。\n契約僕人。等等。這是在伊麗莎白女王的...",
      "title": "爲什麼美國的奴隸制被談得那麼多，而英國和其他帝國的奴隸制和征服卻沒有被談及？"
    }
  ]
}