{
  "author": "CryptoSorted",
  "original_created_utc": 1636451779,
  "title": "What's been your most unfortunate crypto investment so far?",
  "created_utc": 1636482950,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started investing in crypto in July 2017, and so far, I&#39;ve had my fair share of good and bad investments.</p>\n\n<p>Below are the 4 I can remember of the top of my head...</p>\n\n<ol>\n<li><p>Storiqa (STQ). Failed project. Had to cut huge loss and move on. I heard they merged with another project, but I&#39;m not interested.</p></li>\n<li><p>MoneyToken (IMT). Still existing and I&#39;m still holding my tokens on their platform since 2017. Every time I have checked, they&#39;re still in coma. </p></li>\n<li><p>Rocket Token (RCKT). Abandoned project. I got lucky with this one as they unwittingly sent me back my original investment amount and I left unhurt. I invested the money in CAKE and FUEL back in late 2020 and early 2021 and made over 20x. It felt good.</p></li>\n<li><p>KEBAB. I actually believed this clowns. Though at some points a lot of things weren&#39;t adding up, but I ignored my guts and lost $2500 off the gain I made from them. Had to cut my losses and move on.</p></li>\n</ol>\n\n<p>Now, over to you. What&#39;s been your most unfortunate crypto investment so far?</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/qq0dwj/whats_been_your_most_unfortunate_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qq0dwj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I started investing in crypto in July 2017, and so far, I've had my fair share\nof good and bad investments.\n\nBelow are the 4 I can remember of the top of my head...\n\n 1. Storiqa (STQ). Failed project. Had to cut huge loss and move on. I heard\n    they merged with another project, but I'm not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2017年7月に暗号投資を始めましたが、これまで、私の中では\nの良い投資と悪い投資がありました。\n\n以下は、頭の中で覚えている4つです...。\n\n 1. Storiqa（STQ）。失敗したプロジェクト。莫大な損失を出して次へ進まなければならなかった。聞いた話では\n    他のプロジェクトと合併したと聞いたが、私は...。",
      "title": "これまでに最も不幸だった暗号投資は何でしたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2017年7月开始投资加密货币，到目前为止，我已经有了我的公平份额\n好的和坏的投资。\n\n以下是我脑海中能记住的4个例子...\n\n 1. Storiqa（STQ）。失败的项目。不得不削减巨大的损失并继续前进。我听说\n    他们与另一个项目合并了，但我不...",
      "title": "到目前为止，你最不幸的加密货币投资是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2017年7月開始投資加密貨幣，到目前爲止，我已經有了我的公平份額\n好的和壞的投資。\n\n以下是我腦海中能記住的4個例子...\n\n 1. Storiqa（STQ）。失敗的項目。不得不削減巨大的損失並繼續前進。我聽說\n    他們與另一個項目合併了，但我不...",
      "title": "到目前爲止，你最不幸的加密貨幣投資是什麼？"
    }
  ]
}