{
  "author": "wildabroad",
  "original_created_utc": 1627590776,
  "title": "Reminder after Robinhood IPOed today. Move your funds out of Robinhood. You don't own your coins, robinhood does. They also have a history of blocking sellers when the prices rally.",
  "created_utc": 1627607111,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you bought any crypto through Robinhood, you are simply betting on the price of the coin. You DON&#39;T have a wallet nor can you transfer funds out of it without liquidating everything (also causing a tax liability for most people).</p>\n\n<p>&#x200B;</p>\n\n<p>The reason we buy crypto is because we don&#39;t need banks to manage our funds and have full control over our assets. When you use Robinhood you are literally doing the opposite of that.</p>\n</div><!-- SC_ON -->",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/ou5p6t/reminder_after_robinhood_ipoed_today_move_your/",
  "subreddit": "CryptoCurrency",
  "id": "ou5p6t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If you bought any crypto through Robinhood, you are simply betting on the price\nof the coin. You DON'T have a wallet nor can you transfer funds out of it\nwithout liquidating everything (also causing a tax liability for most people).\n\n\n\nThe reason we buy crypto is because we don't need banks to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロビンフッドで暗号を購入した場合、あなたは単にコインの価格に賭けているだけです。\nコインの価格に賭けているだけです。あなたはウォレットを持っていませんし、すべてを清算することなく、ウォレットから資金を移すこともできません。\nすべてを清算することなく、ウォレットから資金を移すこともできません（ほとんどの人が税金を負担することになります）。\n\n\n\n私たちが暗号を購入する理由は、銀行を必要としないからです...",
      "title": "ロビンフッドが今日IPOした後の備忘録。ロビンフッドから資金を移動させてください。あなたは自分のコインを所有していません、Robinhoodが所有しています。彼らはまた、価格が上昇したときに売り手をブロックした経緯があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你通过Robinhood购买了任何加密货币，你只是在押注硬币的价格\n币的价格。你没有钱包，也不能将资金转出。\n你没有钱包，也不能在不清算一切的情况下将资金转出（对大多数人来说也会造成纳税责任）。\n\n\n\n我们购买加密货币的原因是，我们不需要银行的帮助。",
      "title": "今天Robinhood IPO后的提醒。把你的资金从Robinhood转移出去。你并不拥有你的硬币，Robinhood拥有。他们也有在价格反弹时阻挠卖家的历史。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你通過Robinhood購買了任何加密貨幣，你只是在押注硬幣的價格\n幣的價格。你沒有錢包，也不能將資金轉出。\n你沒有錢包，也不能在不清算一切的情況下將資金轉出（對大多數人來說也會造成納稅責任）。\n\n\n\n我們購買加密貨幣的原因是，我們不需要銀行的幫助。",
      "title": "今天Robinhood IPO後的提醒。把你的資金從Robinhood轉移出去。你並不擁有你的硬幣，Robinhood擁有。他們也有在價格反彈時阻撓賣家的歷史。"
    }
  ]
}