{
  "author": "_RetroDigital_",
  "original_created_utc": 1658845332,
  "title": "Until there is mass adoption of Bitcoin, yes, it will behave like a speculative asset. No- that doesn’t mean the thesis behind it is wrong, and I am still 100% bullish and holding.",
  "created_utc": 1658888721,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My post will be long hope that’s okay but we need to clear the air on a few things for both the BTC haters and lovers so that we can all be on the same page.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin, in a vacuum, does it’s job incredibly well. It is a transparent, decentralized form of exchange with a limited supply.  It can be transferred anywhere anytime with no interference beyond two parties involved. There is almost no other infrastructure, digital or physical, that is even comparable to Bitcoin in this regard.&lt;/p&gt;\n\n&lt;p&gt;This has caused many to speculate BTC will eventually see widespread adoption as an alternative to fiat, and led to much investment into Bitcoin. This has recently caused bitcoins price to surge in comparison to the fiat it’s priced in. Currently, Bitcoin is behaving like a speculative asset, as it is one. This does not however make the thesis irrelevant or incorrect.&lt;/p&gt;\n\n&lt;p&gt;Fiat is still, over the long term, inflationary, and subject to unfair regulation, and cycles where we switch between the nation providing and backing the currency. There are many problems with fiat that aren’t being addressed that is being kept because those in charge benefit from the status quo. We are in a time of upheaval, in which it’s become obvious world wide income inequality nor inflation is going to be properly dealt with. There will eventually be an everyday person response that changes the dynamic in order to adjust to these circumstances.&lt;/p&gt;\n\n&lt;p&gt;In the digital age, I’m willing to take the bet that the service and value Bitcoin provides will eventually usurp that role. But the call is for yours to make based on the information provided.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/Bitcoin/comments/w8l34c/until_there_is_mass_adoption_of_bitcoin_yes_it/",
  "subreddit": "Bitcoin",
  "id": "w8l34c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My post will be long hope that’s okay but we need to clear the air on a few\nthings for both the BTC haters and lovers so that we can all be on the same\npage.\n\nBitcoin, in a vacuum, does it’s job incredibly well. It is a transparent,\ndecentralized form of exchange with a limited supply. It can be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の投稿は長くなりますが、いくつかクリアにしなければならないことがあります。\nBTCが嫌いな人も好きな人も、同じ目線に立てるように、いくつかのことをクリアにする必要があります。\nページです。\n\nビットコインは、真空中では、信じられないほどうまく機能しています。それは、透明で\n分散型取引で、供給量に限りがあります。それは...",
      "title": "ビットコインが大量に普及するまでは、そう、投機的な資産のような振る舞いをすることになる。しかし、だからといって、ビットコインの背景にあるテーゼが間違っているわけではなく、私は今でも100％強気で保有しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的帖子会很长，希望这没关系，但我们需要澄清一些问题。\n我们需要为BTC的讨厌者和热爱者澄清一些事情，以便我们都能站在同一起跑线上。\n一页。\n\n比特币，在真空中，它的工作做得非常好。它是一个透明的。\n它是一种透明的、去中心化的交换形式，供应量有限。它可以是...",
      "title": "在比特币被大规模采用之前，是的，它将表现得像一种投机性资产。不，这并不意味着它背后的理论是错误的，我仍然100%看涨并持有。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的帖子會很長，希望這沒關係，但我們需要澄清一些問題。\n我們需要爲BTC的討厭者和熱愛者澄清一些事情，以便我們都能站在同一起跑線上。\n一頁。\n\n比特幣，在真空中，它的工作做得非常好。它是一個透明的。\n它是一種透明的、去中心化的交換形式，供應量有限。它可以是...",
      "title": "在比特幣被大規模採用之前，是的，它將表現得像一種投機性資產。不，這並不意味着它背後的理論是錯誤的，我仍然100%看漲並持有。"
    }
  ]
}