{
  "author": "SparrowOnAHill",
  "original_created_utc": 1634451443,
  "title": "Do you have a \"One that got away\"?",
  "created_utc": 1634471020,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I was younger, I had a close guy friend that I was in love with. We spent years being best friends with insane sexual tension but then once we finally hooked up, he sort of freaked out and pushed me away. We didn&#39;t really talk for a few years. I ended up moving away, met the guy who&#39;s now my husband and had a couple of kids.\nI love my husband and the life we have, but I have always felt like the one I was really supposed to end up with was that friend. We have reconnected online and chatted here and there and he says he felt the same way. \nI&#39;m not going to leave my husband or pursue this guy in any way, that ship sailed, it just seems likely that somewhere in a parallel universe or something like that we probably ended up together.</p>\n\n<p>Do you have a &quot;one that got away&quot;? What&#39;s your story?</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/q9t53j/do_you_have_a_one_that_got_away/",
  "subreddit": "TooAfraidToAsk",
  "id": "q9t53j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "When I was younger, I had a close guy friend that I was in love with. We spent\nyears being best friends with insane sexual tension but then once we finally\nhooked up, he sort of freaked out and pushed me away. We didn't really talk for\na few years. I ended up moving away, met the guy who's now my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は若い頃、親しい男友達がいて、その人に恋をしていました。私たちは\n何年も親友として過ごしてきましたが、最終的には結婚しました。\n彼はパニックになって私を遠ざけてしまったのです。その後、数年間はあまり話をしませんでした。\n数年は本当に話をしませんでした。結局、私は引っ越しをして、今の私の彼に出会いました...",
      "title": "あなたには「逃げた一枚」がありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我年轻的时候，我有一个亲密的男性朋友，我爱上了他。我们花了\n多年来，我们一直是最好的朋友，有着疯狂的性紧张，但一旦我们最终\n勾搭上了，他有点吓坏了，把我推开了。我们有几年没有真正交谈。\n几年都没怎么说话。最后，我搬走了，遇到了现在是我的...",
      "title": "你有一个 \"跑掉的人 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我年輕的時候，我有一個親密的男性朋友，我愛上了他。我們花了\n多年來，我們一直是最好的朋友，有着瘋狂的性緊張，但一旦我們最終\n勾搭上了，他有點嚇壞了，把我推開了。我們有幾年沒有真正交談。\n幾年都沒怎麼說話。最後，我搬走了，遇到了現在是我的...",
      "title": "你有一個 \"跑掉的人 \"嗎？"
    }
  ]
}