{
  "author": "LetsBeJolly",
  "the_new_excerpt": "So it's quite obvious the majority of the market is sleeping on Litecoin, here's\nwhy you shouldn't. I've also noticed several people trashing Litecoin and asking\nwhy people hold it, so here's my answer.\n\nInflation & store of value - I think we can all agree this bull run is fueled by\ninflation in…",
  "original_created_utc": 1610489504,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以很明显，市场上大部分人都在睡Litecoin，下面是\n为什么你不应该。我也注意到有几个人在抨击Litecoin，并问道\n为什么人们持有它，所以我的答案是这样的。\n\n通货膨胀与价值储藏--我想大家都同意，这波牛市的动力来自于\n通货膨胀",
      "title": "Warum Sie nicht auf Litecoin schlafen sollten"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以很明顯，市場上大部分人都在睡Litecoin，下面是\n爲什麼你不應該。我也注意到有幾個人在抨擊Litecoin，並問道\n爲什麼人們持有它，所以我的答案是這樣的。\n\n通貨膨脹與價值儲藏--我想大家都同意，這波牛市的動力來自於\n通貨膨脹",
      "title": "Warum Sie nicht auf Litecoin schlafen sollten"
    }
  ],
  "title": "Why you shouldn't be sleeping on Litecoin",
  "created_utc": 1610525190,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So it&#39;s quite obvious the majority of the market is sleeping on Litecoin, here&#39;s why you shouldn&#39;t. I&#39;ve also noticed several people trashing Litecoin and asking why people hold it, so here&#39;s my answer.</p>\n\n<p><strong>Inflation &amp; store of value</strong> - I think we can all agree this bull run is fueled by inflation in fiat currencies, at levels never seen before. Well Litecoin also has limitted supply just like BTC. I see LTC as silver 2.0 while Bitcoin is gold 2.0</p>\n\n<p><strong>PayPal -</strong> When PayPal enabled it&#39;s US customers to buy crypto, LTC shot right up. Why? Litecoin is the most appealing coin to most people. It&#39;s very similiar to Bitcoin and it has a relatively low price. Q1 of this year, PayPal will enable ALL it&#39;s 345M customers worldwide to buy crypto, this should benefit LTC the most out of all the crypto choices PayPal offers.</p>\n\n<p><strong>MimbleWimble Network Upgrade</strong> - MWEB will enable opt-in privacy features for Litecoin, and it&#39;s just around the corner. A lot of people expect privacy to be the next hype/trend in crypto. Together with privacy, MWEB also offers scaling solutions.</p>\n\n<p><strong>Cardano Velvet Fork -</strong> A Velvet Fork / <a href=\"https://nipopows.com/\">Nipopow</a> will enable smart contract compatability to Litecoin. On top of the store of value and cheaper transactions Litecoin offers, it will be getting a lot more token use cases.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://twitter.com/FlareNetworks/status/1347540433572950018\"><strong>Flare Network airdrop &amp; smart contracts</strong></a> - Litecoin users will receive an airdrop of 5B Flare tokens. Together with this, LTC will be available on the Flare network as fLTC and be able to utilize Smart contracts and DeFi.</p>\n\n<p><strong>Grayscale</strong> - While the majority sleep on Litecoin, institutions know it&#39;s next in line once enough BTC has been bought by them.</p>\n\n<p><a href=\"https://preview.redd.it/c0cnlk176za61.png?width=1396&amp;format=png&amp;auto=webp&amp;s=be02c81c067d01905bf70af68b4cbb9faa7a1b6a\">Grayscale Accumulation</a></p>\n\n<p>&#x200B;</p>\n\n<p>On top of Grayscale heavily accumulating, they had stopped buying all crypto&#39;s around Xmas time. Today they announced they will be taking investments again, well they have disabled investment for ETH &amp; XRP. LTC is by far the most attractive alt for Grayscale investors and when the competition is offline, you know where the money is going to flow.</p>\n\n<p><a href=\"https://preview.redd.it/azr60ib96za61.png?width=939&amp;format=png&amp;auto=webp&amp;s=917ac27713314de1e75fa7c49d8e4d71632e9d35\">Grayscale disabling ETH &amp; XRP investments while LTC still being available. This indicates where large sums of money could flow in the coming days/weeks. </a></p>\n\n<p>&#x200B;</p>\n\n<p>There are several other factors such as LTC being made available on other networks and being cheap / fast, but these are the main and most important and recent developments people aren&#39;t keeping track of. </p>\n</div><!-- SC_ON -->",
  "score": 290,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/_s--KcXi1AaNl7RXAd7UhfvxM7WtWXNSexd2nVxf_C8.jpg?auto=webp&s=c951304c73d4be0f64c50d94375e8be7b057fc8d",
          "width": 256,
          "height": 256
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/_s--KcXi1AaNl7RXAd7UhfvxM7WtWXNSexd2nVxf_C8.jpg?width=108&crop=smart&auto=webp&s=89c894755426d17761656f07384fbb56661f49d9",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/_s--KcXi1AaNl7RXAd7UhfvxM7WtWXNSexd2nVxf_C8.jpg?width=216&crop=smart&auto=webp&s=07686fe47a67cc2dd6bd634b2fb9ce30e3c059e6",
            "width": 216,
            "height": 216
          }
        ],
        "variants": {},
        "id": "gSL0GE94Dv-qdw_E01knCSzwBAvTmttGTSguAq4rvv0"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/kw22uk/why_you_shouldnt_be_sleeping_on_litecoin/",
  "subreddit": "CryptoCurrency",
  "id": "kw22uk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706378005
}