{
  "author": "cnnisfakenews2",
  "the_new_excerpt": "It has to be said. Its common sense. There are thousands of coins. Scamcoin,\nlosercoin, Shiba coin. All real coins btw.\n\nYes there will be a couple coins that are very valuable in a couple years but\nthe vast majority of them will be worthless.\n\nOnly coins that do things will be valuable. Coins that…",
  "original_created_utc": 1622218983,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "言わなければならないことがある。常識です。何千ものコインがあります。詐欺コイン。\nlosercoin、Shiba coin。すべて本物のコインです。\n\n確かに数年後には非常に価値のあるコインがいくつか出てくるでしょうが\n大半は無価値になるでしょう。\n\n何かをするコインだけが価値があるのです。コインは...",
      "title": "あなたが持っているコインのほとんどは、数年後には無価値になってしまいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不得不说的是。它的常识。有成千上万的硬币。诈骗币。\nlosercoin, Shiba coin. 所有真正的硬币都是如此。\n\n是的，在几年内会有几个硬币非常有价值，但\n但绝大部分都将一文不值。\n\n只有那些做事的硬币才有价值。币是...",
      "title": "你的大部分钱币在几年后都会变得毫无价值。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不得不說的是。它的常識。有成千上萬的硬幣。詐騙幣。\nlosercoin, Shiba coin. 所有真正的硬幣都是如此。\n\n是的，在幾年內會有幾個硬幣非常有價值，但\n但絕大部分都將一文不值。\n\n只有那些做事的硬幣纔有價值。幣是...",
      "title": "你的大部分錢幣在幾年後都會變得毫無價值。"
    }
  ],
  "title": "Most of your coins are going to be worthless in years.",
  "created_utc": 1622233840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It has to be said. Its common sense. There are thousands of coins. Scamcoin, losercoin, Shiba coin. All real coins btw.</p>\n\n<p>Yes there will be a couple coins that are very valuable  in a couple years but the vast majority of them will be worthless.</p>\n\n<p>Only coins that do things will be valuable. Coins that you have that are just there to hopefully go up on value so you can profit will be worthless.</p>\n\n<p>Its like the dot com boom. You are betting on websites. Which website is going to get the most visitors. Most died.</p>\n</div><!-- SC_ON -->",
  "score": 1154,
  "permalink": "/r/CryptoCurrency/comments/nn1i7u/most_of_your_coins_are_going_to_be_worthless_in/",
  "subreddit": "CryptoCurrency",
  "id": "nn1i7u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296476
}