{
  "author": "Chaloby",
  "original_created_utc": 1645067578,
  "title": "What does \"cooking\" dynamite into \"grease\" mean?",
  "created_utc": 1645103091,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Big fan of Prohibition-era non-fiction and in a memoir I read of a safecracker, he talks of the explosives -- aka &amp;quot;grease&amp;quot; -- he would use to open safes:&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;Shooting a box is real touchy because the grease that you&amp;#39;re using is cooked out of dynamite and it&amp;#39;s not the same consistency as nitroglycerin that you buy. Sometime it may be real strong and next time weak and there&amp;#39;s no way to tell until you try it out.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;He doesn&amp;#39;t mention anything else about it and I&amp;#39;ve Googled this from every angle I know how. What does he mean by &amp;quot;cooked&amp;quot;? Literally, in an oven or on the stove? What is all even in that &amp;quot;grease&amp;quot;? Is it soupy or solidified?&lt;/p&gt;\n\n&lt;p&gt;EDIT: I&amp;#39;m now aware of Nobel having made nitroglycerin safer by inventing dynamite so that&amp;#39;s cool.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/askscience/comments/suefit/what_does_cooking_dynamite_into_grease_mean/",
  "subreddit": "askscience",
  "id": "suefit",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Big fan of Prohibition-era non-fiction and in a memoir I read of a safecracker,\nhe talks of the explosives -- aka \"grease\" -- he would use to open safes:\n\n\"Shooting a box is real touchy because the grease that you're using is cooked\nout of dynamite and it's not the same consistency as nitroglycerin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "禁酒法時代のノンフィクションの大ファンで、ある金庫破りの回想録を読みました。\n金庫を開けるときに使う爆薬、別名「グリース」のことを話しています。\n\n「箱を撃つのは本当に難しいんだ。\nダイナマイトとニトログリセリンでは粘度が違うし......」。",
      "title": "ダイナマイトを \"油 \"に \"調理 \"するとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我非常喜欢禁酒令时期的非虚构作品，在我读到的一本关于保险箱盗窃者的回忆录中。\n他谈到了他用来打开保险箱的炸药--又称 \"油脂\"。\n\n\"射击保险箱是非常敏感的，因为你所使用的油脂是由炸药煮出来的。\n因为你使用的油脂是由炸药煮出来的，它与硝化甘油的浓度不同......",
      "title": "将炸药 \"煮 \"成 \"油脂 \"是什么意思？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我非常喜歡禁酒令時期的非虛構作品，在我讀到的一本關於保險箱盜竊者的回憶錄中。\n他談到了他用來打開保險箱的炸藥--又稱 \"油脂\"。\n\n\"射擊保險箱是非常敏感的，因爲你所使用的油脂是由炸藥煮出來的。\n因爲你使用的油脂是由炸藥煮出來的，它與硝化甘油的濃度不同......",
      "title": "將炸藥 \"煮 \"成 \"油脂 \"是什麼意思？"
    }
  ]
}