{
  "author": "ljgillzl",
  "the_new_excerpt": "I’ve seen many pointing to the lyrics of the song as the kids ride a boat down\nthe chocolate river and into a tunnel. I actually think this is more on-the-nose\nthan that.\n\nThe story of Charlie Bucket is one where he & a few other children find Golden\nTickets. First off, I think we all know what the…",
  "original_created_utc": 1614882232,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人指着这首歌的歌词，当孩子们乘船下水时\n巧克力河，并进入一个隧道。其实我觉得这个更有看头。\n不止如此。\n\n查理-水桶的故事是，他与其他几个孩子找到金\n门票。首先，我想大家都知道什么是... ...",
      "title": "DFV的威利-旺卡推文"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人指着這首歌的歌詞，當孩子們乘船下水時\n巧克力河，並進入一個隧道。其實我覺得這個更有看頭。\n不止如此。\n\n查理-水桶的故事是，他與其他幾個孩子找到金\n門票。首先，我想大家都知道什麼是... ...",
      "title": "DFV的威利-旺卡推文"
    }
  ],
  "title": "DFV’s Willy Wonka tweet",
  "created_utc": 1614901107,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen many pointing to the lyrics of the song as the kids ride a boat down the chocolate river and into a tunnel. I actually think this is more on-the-nose than that.</p>\n\n<p>The story of Charlie Bucket is one where he &amp; a few other children find Golden Tickets. First off, I think we all know what the golden ticket represents. Upon arriving at the factory, the children are given an everlasting gobstopper and told to not sell or give it away. Through the journey, there are many crazy, stressful things that occur to the voyagers, many ups-and-downs that must be persevered. The man attempting to steal Mr. Wonka’s gobstopper recipe is able to convince and/or con the children out of theirs .... except for Charlie Bucket. In the end, he returns the gobstopper to Mr. Wonka, and is thus rewarded with everything he had dreamt of. In the end, he literally breaks through the glass ceiling and rises above all the other children who just couldn’t .... hold.</p>\n\n<p>On to the Wonkavator</p>\n</div><!-- SC_ON -->",
  "score": 6733,
  "permalink": "/r/wallstreetbets/comments/lxrgk7/dfvs_willy_wonka_tweet/",
  "subreddit": "wallstreetbets",
  "id": "lxrgk7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542579477
}