{
  "author": "yash404",
  "the_new_excerpt": "Hello People.\nI have little knowledge in Philosophy, outside of SEP/IEP pages and a lot of\nDeleuzian concepts have gotten me intrigued to read more. I do not plan on\nreading his major works until I understand the basics, and I think the\nrationalist-empiricist debate is a good place to start. I plan…",
  "original_created_utc": 1612358523,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n我在哲学方面的知识不多，除了SEP/IEP的网页和大量的\n德勒兹的概念让我产生了阅读更多的兴趣。我不打算\n阅读他的主要作品，直到我了解基本的内容，我认为。\n理性主义和经验主义的辩论是一个很好的开始。我打算...",
      "title": "笛卡尔的《沉思录》和斯宾诺莎的《伦理学》是哲学的好切入点吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n我在哲學方面的知識不多，除了SEP/IEP的網頁和大量的\n德勒茲的概念讓我產生了閱讀更多的興趣。我不打算\n閱讀他的主要作品，直到我瞭解基本的內容，我認爲。\n理性主義和經驗主義的辯論是一個很好的開始。我打算...",
      "title": "笛卡爾的《沉思錄》和斯賓諾莎的《倫理學》是哲學的好切入點嗎？"
    }
  ],
  "title": "Are Descartes's Meditations and Spinoza's Ethics good entry points in philosophy?",
  "created_utc": 1612423547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello People.<br/>\nI have little knowledge in Philosophy, outside of SEP/IEP pages and a lot of Deleuzian concepts have gotten me intrigued to read more. I do not plan on reading his major works until I understand the basics, and I think the rationalist-empiricist debate is a good place to start. I plan to buy a book which has a collection of works by Spinoza, Leibniz and Descartes, in particular, <em>Discourse on Method</em>, <em>Meditations</em>, <em>Ethics</em>, <em>Monadology</em> and <em>Discourse on Metaphysics.</em><br/>\nWould this be a good place to start? Also, should I start with <em>Ethics</em> or <em>Meditations</em>? I have heard people say <em>Ethics</em> is difficult to approach, but coming from a math background I find the structure of the text really interesting. Or should I start with some secondary works? Once I am done with <em>Ethics</em>, should I read Deleuze&#39;s books on Spinoza, or should I keep it for later?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/lbndxf/are_descartess_meditations_and_spinozas_ethics/",
  "subreddit": "askphilosophy",
  "id": "lbndxf",
  "is_self": true,
  "media": null,
  "is_video": false
}