{
  "author": "Gaffle74",
  "original_created_utc": 1658103997,
  "title": "Has anyone changed their mind about having children because of the current state of the world?",
  "created_utc": 1658151470,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I looked forward to raising children, but as of recently, I don&amp;#39;t have as much of an interest to do so. I&amp;#39;m only 20. The direction the world is heading with social media and how the world is presented through it. I feel like the only way I&amp;#39;d have a child is if I heavily monitored them just to make sure they&amp;#39;re headed in the right direction. I don&amp;#39;t want to be the type of parent who hovers over their child 24/7 and has strict rules. But I think with how the younger generation is coming up that&amp;#39;s the only way to do it. Has anyone else&amp;#39;s opinion on having kids changed because of this?&lt;/p&gt;\n\n&lt;p&gt;(PS: I&amp;#39;m sure I&amp;#39;m gonna have kids I just want to know if anyone else&amp;#39;s view on having kids changed since the world turned into what it is now)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/w1lqhk/has_anyone_changed_their_mind_about_having/",
  "subreddit": "TooAfraidToAsk",
  "id": "w1lqhk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I looked forward to raising children, but as of recently, I don't have as much\nof an interest to do so. I'm only 20. The direction the world is heading with\nsocial media and how the world is presented through it. I feel like the only way\nI'd have a child is if I heavily monitored them just to make…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "子育てを楽しみにしていたのですが、最近になって、あまり\nと思っています。まだ20歳ですからね。世の中の流れは\nソーシャルメディアとそれを通じた世の中の見せ方。という気がしています。\n私が子供を持つのは、子供を厳しく監視するためだけ...",
      "title": "今の世の中の状況を見て、子供を持つことに考えを改めた人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我期待着养育孩子，但从最近来看，我没有那么多的\n有兴趣这样做。我只有20岁。世界的发展方向是\n社交媒体和世界是如何通过它来呈现的。我觉得唯一的办法\n我有一个孩子是如果我严重监视他们，只是为了使...",
      "title": "有没有人因为世界的现状而改变了对生孩子的想法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我期待着養育孩子，但從最近來看，我沒有那麼多的\n有興趣這樣做。我只有20歲。世界的發展方向是\n社交媒體和世界是如何通過它來呈現的。我覺得唯一的辦法\n我有一個孩子是如果我嚴重監視他們，只是爲了使...",
      "title": "有沒有人因爲世界的現狀而改變了對生孩子的想法？"
    }
  ]
}