{
  "author": "BeefSoupReam",
  "original_created_utc": 1655585639,
  "title": "How do Anglosphere baby names just switch genders (ex: Leslie, Ashley)?",
  "created_utc": 1655603770,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I only have experience with America/ Anglosphere but certain baby names seemed to have abruptly switched genders. I do not mean feminizing a male name like Robert to Roberta, but a name being given to the other sex while unchanged. For example, the names Leslie,  Ashley, Madison &amp;quot;Maddie&amp;quot;,  Sydney, and Shannon all used to be solidly male names but today are solidly/ mostly female. Superficially, it seems like the male versions were at least reasonably common and thus understood to be male. &lt;/p&gt;\n\n&lt;p&gt;Also, why only those names? People had more rigid gender norms and the first girls named Ashley would have been seen like somebody naming their daughter David or Matthew today, right? &lt;/p&gt;\n\n&lt;p&gt;What happened?&lt;/p&gt;\n\n&lt;p&gt;PS: I know some Catholics give boys feminine middle names like &amp;quot;Maria&amp;quot;, but I&amp;#39;m talking about aggressively gender swapping some number of first/ given names.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 288,
  "permalink": "/r/AskHistorians/comments/vff40v/how_do_anglosphere_baby_names_just_switch_genders/",
  "subreddit": "AskHistorians",
  "id": "vff40v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I only have experience with America/ Anglosphere but certain baby names seemed\nto have abruptly switched genders. I do not mean feminizing a male name like\nRobert to Roberta, but a name being given to the other sex while unchanged. For\nexample, the names Leslie, Ashley, Madison \"Maddie\", Sydney,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカ・イギリス圏の経験しかありませんが、ある種の赤ちゃんの名前は、とても印象的でした。\nが突然性別が入れ替わってしまったことがあります。男性の名前を女性化するのではありません。\nロバートがロバータになるような男性名の女性化ではなく、そのままの名前で異性に付けられることです。例えば\n例えば、Leslie、Ashley、Madison \"Maddie\"、Sydney...など。",
      "title": "英語圏の赤ちゃんの名前って、どうして性別が入れ替わるの（例：Leslie、Ashley）？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只有在美国/英国的经验，但某些婴儿的名字似乎是\n似乎已经突然转换了性别。我并不是说将一个男性的名字女性化，如\n罗伯特变成罗伯塔，而是指名字在不变的情况下被赋予了另一种性别。例如\n例如，Leslie、Ashley、Madison \"Maddie\"、Sydney......这些名字。",
      "title": "英国的婴儿名字是如何转换性别的（例如：Leslie, Ashley）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只有在美國/英國的經驗，但某些嬰兒的名字似乎是\n似乎已經突然轉換了性別。我並不是說將一個男性的名字女性化，如\n羅伯特變成羅伯塔，而是指名字在不變的情況下被賦予了另一種性別。例如\n例如，Leslie、Ashley、Madison \"Maddie\"、Sydney......這些名字。",
      "title": "英國的嬰兒名字是如何轉換性別的（例如：Leslie, Ashley）？"
    }
  ]
}