{
  "author": "funkn83",
  "the_new_excerpt": "We really going to let these bears do us like this? No lube, no thank you ma'am,\nno cab fare, no nothing?\n\nI don't know about you but my tendies need dipping sauce damn it!\n\nLet's see some afternoon retardery, I'm already fully invested but I'll sell my\nleft nut (the good one) before I let them get…",
  "original_created_utc": 1623341119,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このまま熊にやられてしまうのか？潤滑剤なし、ノーサンキュー・マム。\nタクシー代もなし、何もなし？\n\nお前のことは知らんが、俺の体にはディッピングソースが必要なんだよ！\n\n私はすでに投資していますが、その前に自分の左手を売ります。\n私はすでに完全に投資していますが、彼らを手放す前に私の左のナット（良い方）を売るつもりです...",
      "title": "今日はミームストーンズがヒットした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们真的要让这些熊孩子这样对我们吗？没有润滑油，不谢谢你，女士。\n没有出租车费，什么都没有？\n\n我不知道你怎么想的，但我的小弟弟需要蘸酱，该死的！我的小弟弟需要蘸酱。\n\n让我们看看下午的迟钝，我已经完全投资了，但我要卖掉我的\n但在我让他们得到......之前，我会卖掉我的左脑（好的那个）。",
      "title": "今天，Meme Stonks受到打击。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們真的要讓這些熊孩子這樣對我們嗎？沒有潤滑油，不謝謝你，女士。\n沒有出租車費，什麼都沒有？\n\n我不知道你怎麼想的，但我的小弟弟需要蘸醬，該死的！我的小弟弟需要蘸醬。\n\n讓我們看看下午的遲鈍，我已經完全投資了，但我要賣掉我的\n但在我讓他們得到......之前，我會賣掉我的左腦（好的那個）。",
      "title": "今天，Meme Stonks受到打擊。"
    }
  ],
  "title": "Meme stonks taking a hit today.. $BB $CLN $CLOV $GME $AMC.. etc etc",
  "created_utc": 1623348881,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We really going to let these bears do us like this? No lube, no thank you ma&#39;am, no cab fare, no nothing?</p>\n\n<p>I don&#39;t know about you but my tendies need dipping sauce damn it!</p>\n\n<p>Let&#39;s see some afternoon retardery, I&#39;m already fully invested but I&#39;ll sell my left nut (the good one) before I let them get to the moon before me. After all first one there gets the delicious moon BBQ. I say spare ribs and tendies for all the little monkeys and apes!! None for shitadel shorties and anyone who would bet for a company to fail.</p>\n</div><!-- SC_ON -->",
  "score": 7048,
  "permalink": "/r/wallstreetbets/comments/nwravu/meme_stonks_taking_a_hit_today_bb_cln_clov_gme/",
  "subreddit": "wallstreetbets",
  "id": "nwravu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009745422
}