{
  "author": "Mad_Season_1994",
  "original_created_utc": 1651416180,
  "title": "Why should I respect people's religious views if their religion perpetuates hateful and abusive rhetoric and is the reason for so much human suffering?",
  "created_utc": 1651428432,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m talking mainly about Islam, Judaism, Christianity and any other religion that has doctrine that perpetuates hatred. I would never look at, say, a Muslim and beat the crap out of them just because of what they believe. But I would judge them and treat them with suspicion because they are at a point where they read their holy scriptures, saw what was written in there and either said &amp;quot;That&amp;#39;s fine, I&amp;#39;ll just ignore those violent bits&amp;quot;, or wholeheartedly agrees with those violent bits. The same goes for any other organized religion that has texts that tell them to do harm unto others or subjugate women or anything of the like. Yet, &lt;strong&gt;I&amp;#39;m&lt;/strong&gt; the bad guy because I don&amp;#39;t want to live on the same planet as people who follow that doctrine. &lt;/p&gt;\n\n&lt;p&gt;So what am I supposed to do? Hold my tongue until I inevitably implode?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/ug1c9g/why_should_i_respect_peoples_religious_views_if/",
  "subreddit": "TooAfraidToAsk",
  "id": "ug1c9g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm talking mainly about Islam, Judaism, Christianity and any other religion\nthat has doctrine that perpetuates hatred. I would never look at, say, a Muslim\nand beat the crap out of them just because of what they believe. But I would\njudge them and treat them with suspicion because they are at a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "主にイスラム教、ユダヤ教、キリスト教、その他あらゆる宗教について話しています。\n憎しみを永続させるような教義を持つ宗教のことです。私は、たとえばイスラム教徒を見て\nという理由で殴りつけるようなことはしません。しかし、私は\nしかし、私は彼らを判断し、疑いを持って扱います。なぜなら、彼らは...",
      "title": "もし彼らの宗教が憎しみや虐待のレトリックを永続させ、多くの人間の苦しみの原因となっているとしたら、なぜ私は人々の宗教的見解を尊重しなければならないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的主要是伊斯兰教、犹太教、基督教和任何其他宗教。\n那些有延续仇恨的教义的宗教。我绝不会看着，比如说，一个穆斯林\n就因为他们的信仰而把他们打得屁滚尿流。但是我会\n但我会判断他们，并以怀疑的态度对待他们，因为他们是在一个...",
      "title": "如果人们的宗教延续了仇恨和辱骂的言论，并且是人类遭受如此多苦难的原因，我为什么要尊重他们的宗教观点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的主要是伊斯蘭教、猶太教、基督教和任何其他宗教。\n那些有延續仇恨的教義的宗教。我絕不會看着，比如說，一個穆斯林\n就因爲他們的信仰而把他們打得屁滾尿流。但是我會\n但我會判斷他們，並以懷疑的態度對待他們，因爲他們是在一個...",
      "title": "如果人們的宗教延續了仇恨和辱罵的言論，並且是人類遭受如此多苦難的原因，我爲什麼要尊重他們的宗教觀點？"
    }
  ]
}