{
  "author": "ImpossibleReveal9356",
  "original_created_utc": 1642319037,
  "title": "do I tell my wife I invaded her privacy?",
  "created_utc": 1642352651,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My (39m) wife (36f) is friends with a co-worker (26m). I agreed that it was okay that they were friends at Christmas after she told me they were speaking often but on a purely platonic level. I had suspicions that the communication was becoming more frequent/intense since my green light and looked on her fb (a shitty thing to do, I know) and found a string of messages where he says things about her &amp;#39;stimulating his mind like no-one he has ever met&amp;#39; and how lovely she looked when she went to their place of work with a friend (39f) for a drink; &amp;#39;I was hoping you didn&amp;#39;t notice I could barely maintain eye contact with you because you looked lovely and i felt like I was staring&amp;#39;. That one is smooth as hell and blatant flirting, right? Another about watching her walk, but not for the walk. She responds, but not to tell him that his comments are inappropriate and this concerns me. Its very clear that he has a crush on my wife. Do I confront her with what I&amp;#39;ve seen, or do I engage in conversation hoping she will divulge this information herself?&lt;/p&gt;\n\n&lt;p&gt;TL;DR! Wife (36f) is friends with a colleague (26m). I snooped her fb and found inappropriate messages from him to her. Do I confront her and confess my snooping or find another way?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/s56qkp/do_i_tell_my_wife_i_invaded_her_privacy/",
  "subreddit": "TooAfraidToAsk",
  "id": "s56qkp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My (39m) wife (36f) is friends with a co-worker (26m). I agreed that it was okay\nthat they were friends at Christmas after she told me they were speaking often\nbut on a purely platonic level. I had suspicions that the communication was\nbecoming more frequent/intense since my green light and looked…"
}