{
  "author": "Charmycole",
  "original_created_utc": 1640457095,
  "title": "Please be KIND to newbies",
  "created_utc": 1640468054,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I sometimes hate how this sub treat newbies. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get me wrong: this sub has taught me a lot about crypto, and I&amp;#39;m grateful to have a place to talk about it and learn from others. The most important lesson I&amp;#39;ve learnt is to accept advise and opinions from this site with a grain of salt. Still, I believe it is critical that we be welcoming to newcomers and respectful when they ask what some may consider a silly question (s). &lt;/p&gt;\n\n&lt;p&gt;We all need to learn something, and I feel the best way to learn is to ask questions. When someone new to crypto asks a question, we shouldn&amp;#39;t be rude or condescending. I realize some of it can be found on google, but I honestly feel people just want to fit in and have conversations with people who share their interests. In the real world, where many people still believe crypto is a scam, that&amp;#39;s difficult to come by. &lt;/p&gt;\n\n&lt;p&gt;Anyway, this is all I&amp;#39;m saying.&lt;/p&gt;\n\n&lt;p&gt;Let’s treat each other with respect and be kind. &lt;/p&gt;\n\n&lt;p&gt;Merry Christmas&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/roeskj/please_be_kind_to_newbies/",
  "subreddit": "CryptoCurrency",
  "id": "roeskj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I sometimes hate how this sub treat newbies.\n\nDon't get me wrong: this sub has taught me a lot about crypto, and I'm grateful\nto have a place to talk about it and learn from others. The most important\nlesson I've learnt is to accept advise and opinions from this site with a grain\nof salt. Still, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブの初心者の扱いが嫌になることがあります。\n\n誤解しないでください：このサブは私に暗号について多くのことを教えてくれましたし、私は感謝しています。\nそれについて話し、他の人から学ぶ場があること。最も重要なのは\n私が学んだことは、このサイトからのアドバイスや意見は大目に見ることです。\n塩の それでも、私は...",
      "title": "初心者に優しくしてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有时讨厌这个分队对待新手的方式。\n\n不要误会我的意思：这个分站让我学到了很多关于加密货币的知识，我很感激\n我很感激有这样一个地方可以谈论它并向他人学习。最重要的\n我学到的最重要的一课是接受来自这个网站的建议和意见。\n咸的。尽管如此，我...",
      "title": "请善待新手"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有時討厭這個分隊對待新手的方式。\n\n不要誤會我的意思：這個分站讓我學到了很多關於加密貨幣的知識，我很感激\n我很感激有這樣一個地方可以談論它並向他人學習。最重要的\n我學到的最重要的一課是接受來自這個網站的建議和意見。\n鹹的。儘管如此，我...",
      "title": "請善待新手"
    }
  ]
}