{
  "author": "NotYourAttorney",
  "the_new_excerpt": "I keeps an eye on Canadian markets for a number of reasons, one thing that has\nbeen interesting to watch: Canadian REITs.\n\nWhile there are some caveats (many don’t have shares that trade in the US, FX\nissues), they seem like a great value. And if your broker let’s you get to\ninternational markets…",
  "original_created_utc": 1612631499,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我关注加拿大市场的原因有很多，其中有一件事是\n一直是有趣的观察。加拿大房地产信托基金。\n\n虽然有一些注意事项（许多人没有在美国交易的股票，FX\n问题），他们似乎是一个巨大的价值。如果你的经纪人让你得到\n国际市场...",
      "title": "加拿大REITs。小众，但准备好了增长和支付红利。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我關注加拿大市場的原因有很多，其中有一件事是\n一直是有趣的觀察。加拿大房地產信託基金。\n\n雖然有一些注意事項（許多人沒有在美國交易的股票，FX\n問題），他們似乎是一個巨大的價值。如果你的經紀人讓你得到\n國際市場...",
      "title": "加拿大REITs。小衆，但準備好了增長和支付紅利。"
    }
  ],
  "title": "Canadian REITs: Niche, but poised for growth and paying dividends",
  "created_utc": 1612686444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I keeps an eye on Canadian markets for a number of reasons, one thing that has been interesting to watch: Canadian REITs. </p>\n\n<p>While there are some caveats (many don’t have shares that trade in the US, FX issues), they seem like a great value. And if your broker let’s you get to international markets (like Interactive Brokers) this is less of an issue. </p>\n\n<p>Many have great leadership and Trustees. They have solid dividends. Current assets are valued at a discount compared to private market real estate transactions. Balance sheets are great, too. </p>\n\n<p>An example: Granite (GRT.UN). It’s an industrial REIT. Net debt is less than ~30%. Rent collections have been essentially 100% during covid. Yield is 4%. The dividend was just raised. And the units trade on the NYSE. </p>\n\n<p>Here’s a recent article on Canadian REITs from the <a href=\"https://www.theglobeandmail.com/investing/markets/inside-the-market/article-beaten-down-reits-could-see-negative-sentiment-reverse-quickly-as/\">Globe and Mail</a>. Thoughts?</p>\n\n<p>Anyone want to take a deeper look with me?</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/investing/comments/le1vc6/canadian_reits_niche_but_poised_for_growth_and/",
  "subreddit": "investing",
  "id": "le1vc6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199856
}