{
  "author": "dalibor68",
  "original_created_utc": 1640159958,
  "title": "Do NOT, under any circumstances, take out a loan for crypto investments",
  "created_utc": 1640180368,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I stopped counting how often I&amp;#39;ve read this same type of story over and over again, of users wanting to become rich, turning sort of desperate or being super naive and taking out huge loans in order to buy crypto or invest into other crypto-related assets.&lt;/p&gt;\n\n&lt;p&gt;Do NOT do this under any circumstances. Unless you are a millionaire doing random things on coke, taking out a loan to buy crypto means you are already far beyond spending only what you can afford. It is very likely that you will lose money or at best, if you&amp;#39;re lucky, make peanuts. You&amp;#39;re probably not going to be the 0,0001% exception. You&amp;#39;ll lose your financial independence (which is ironic) and have a high chance to come out worse.&lt;/p&gt;\n\n&lt;p&gt;If you need to get it out of your system, dump $50 or something on a shitcoin and you&amp;#39;ll still get your experience of loss and regret, but not in a life-ruining fashion. Worked for me.&lt;/p&gt;\n\n&lt;p&gt;Ideally you should reach a situation of positive indifference. For example, in the crab markets I pretty much stopped giving a damn. Still check my portfolio every now and then to see if there is movement. If there are big dips I watch it now and then to see if I want to invest more. If things are moving up I get a little bit more excited, but in a fun &amp;quot;let&amp;#39;s see where this is going&amp;quot; way, not in a &amp;quot;so which house will I buy?&amp;quot; way. The key to this is the simple old saying: don&amp;#39;t invest more than you can afford. Of course if my whole portfolio suddenly went to $0 for whatever reason, I&amp;#39;d be pissed and probably wouldn&amp;#39;t want to afford a big vacation for 1-2 years, but that&amp;#39;d be it.&lt;/p&gt;\n\n&lt;p&gt;What do you think?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 251,
  "permalink": "/r/CryptoCurrency/comments/rm0c7t/do_not_under_any_circumstances_take_out_a_loan/",
  "subreddit": "CryptoCurrency",
  "id": "rm0c7t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I stopped counting how often I've read this same type of story over and over\nagain, of users wanting to become rich, turning sort of desperate or being super\nnaive and taking out huge loans in order to buy crypto or invest into other\ncrypto-related assets.\n\nDo NOT do this under any circumstances.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "同じような話を何度も何度も読んで、数えるのをやめました。\n一攫千金を狙ったユーザーが、ある種の自暴自棄になったり、超がつくほど\n暗号を買ったり、他のものに投資するために多額のローンを組んだりするのは、素朴で\n暗号関連資産\n\nどんなことがあっても、こんなことはしないでください...。",
      "title": "いかなる場合においても、暗号投資のためにローンを組まないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不再计算我有多少次读到这种同样类型的故事，一遍又一遍\n用户想要致富，变得有点绝望，或者超级天真，为了购买加密货币或投资其他项目而借出巨额贷款。\n天真，为了购买加密货币或投资其他与加密货币有关的资产而获得巨额贷款。\n与加密货币有关的资产。\n\n在任何情况下都不要这样做....",
      "title": "在任何情况下，都不要为加密货币投资贷款"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不再計算我有多少次讀到這種同樣類型的故事，一遍又一遍\n用戶想要致富，變得有點絕望，或者超級天真，爲了購買加密貨幣或投資其他項目而借出鉅額貸款。\n天真，爲了購買加密貨幣或投資其他與加密貨幣有關的資產而獲得鉅額貸款。\n與加密貨幣有關的資產。\n\n在任何情況下都不要這樣做....",
      "title": "在任何情況下，都不要爲加密貨幣投資貸款"
    }
  ]
}