{
  "author": "Username-Not-A-Bot",
  "original_created_utc": 1649853740,
  "title": "How many of you actually invested only what you can 'afford' to lose?",
  "created_utc": 1649885910,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all; wether or not you can afford to lose money, losing money still sucks. Let me get that straight.&lt;/p&gt;\n\n&lt;p&gt;I always thought I invested only what I can &amp;#39;afford&amp;#39; to lose. I did not need the money at that time and I was working so I had a steady income as well.&lt;/p&gt;\n\n&lt;p&gt;When prices started dropping I realized I was checking the charts quite a lot. It was the last thing I did before going to sleep and the first thing I did when I woke up. The prices going down were nagging at me a lot more than I anticipated at first.&lt;/p&gt;\n\n&lt;p&gt;I decided to take out my initial investment and some extra profits if I wanted to go on a vacation with some friends. Since I did that, I barely check the charts anymore and to be honest I feel no stress at all when prices drop.&lt;/p&gt;\n\n&lt;p&gt;This made me wonder how many of you their mental health truly stays unaffected by the prices dropping and truly invested only what you can &amp;#39;afford&amp;#39; to lose?&lt;/p&gt;\n\n&lt;p&gt;Edit 1: I’m trying to reply to everyone but damn you all are going hard with the replies!&lt;/p&gt;\n\n&lt;p&gt;Edit 2: I agree “afford” to lose is a really ambiguous and weird term. That’s why I put it between brackets!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/u2pg2i/how_many_of_you_actually_invested_only_what_you/",
  "subreddit": "CryptoCurrency",
  "id": "u2pg2i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First of all; wether or not you can afford to lose money, losing money still\nsucks. Let me get that straight.\n\nI always thought I invested only what I can 'afford' to lose. I did not need the\nmoney at that time and I was working so I had a steady income as well.\n\nWhen prices started dropping I…"
}