{
  "author": "mariollinas",
  "original_created_utc": 1655465083,
  "title": "Why has Western culture come up with museums and the study of ethnography, while other cultures have simply lived alongside ancient artefacts and buildings for thousands of years?",
  "created_utc": 1655476845,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can’t exactly put my fingers on this question. I’m just puzzled by how in the 19th century, for example, European egyptologists “discovered” all sorts of ancient remains and artefacts that had actually been lying there all along. People were partially aware of them but they did not seem to have the same attitude of Europeans. So what does this attitude consist of? Where does it stem from?&lt;/p&gt;\n\n&lt;p&gt;Another example is the colosseum, whose stones have been used for centuries as building material. The arena itself was inhabited by different people. So why has the colosseum been considered for centuries as nothing more special than any other abandoned monument? What changed then?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 161,
  "permalink": "/r/AskHistorians/comments/veay18/why_has_western_culture_come_up_with_museums_and/",
  "subreddit": "AskHistorians",
  "id": "veay18",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I can’t exactly put my fingers on this question. I’m just puzzled by how in the\n19th century, for example, European egyptologists “discovered” all sorts of\nancient remains and artefacts that had actually been lying there all along.\nPeople were partially aware of them but they did not seem to have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この疑問について、私は正確には指をくわえて見ているわけにはいきません。ただ不思議なのは、例えば19世紀にヨーロッパのエジプト学者たちが\n例えば19世紀、ヨーロッパのエジプト学者が様々なものを「発見」したことが不可解です。\n19世紀、ヨーロッパのエジプト学者たちが、実はずっとそこに眠っていた古代の遺跡や遺物を「発見」したことが不可解です。\n人々は部分的には気づいていたようだが、実際には気づいていなかったようだ......。",
      "title": "なぜ西洋文化は博物館や民俗学という学問を生み出し、他の文化は何千年も古代の遺物や建物と一緒に暮らしてきたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不能确切地把我的手指放在这个问题上。我只是对以下情况感到困惑\n例如，在19世纪，欧洲埃及学家 \"发现 \"了各种各样的\n古代遗迹和手工艺品，而这些遗迹和手工艺品实际上一直都在那里。\n人们部分地意识到了它们，但他们似乎并没有...",
      "title": "为什么西方文化提出了博物馆和民族学研究，而其他文化只是与古代文物和建筑一起生活了几千年？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不能確切地把我的手指放在這個問題上。我只是對以下情況感到困惑\n例如，在19世紀，歐洲埃及學家 \"發現 \"了各種各樣的\n古代遺蹟和手工藝品，而這些遺蹟和手工藝品實際上一直都在那裏。\n人們部分地意識到了它們，但他們似乎並沒有...",
      "title": "爲什麼西方文化提出了博物館和民族學研究，而其他文化只是與古代文物和建築一起生活了幾千年？"
    }
  ]
}