{
  "author": "misunderstoodR",
  "original_created_utc": 1629999263,
  "title": "Advice for people who got in crypto this year.",
  "created_utc": 1630013432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been in crypto for many years. When I mean many years I mean I saw bitcoin at 300usd and eth at under 10usd. I’ve been through a bull and bear market. I’ve seen what works and what doesn’t. </p>\n\n<p>My honest advice to someone who’s new to this game is:</p>\n\n<ol>\n<li><p>Identify a coin you’re interested in and do good research on what they are trying to achieve. Think of whether they will have an impact on society in the next decade or so. </p></li>\n<li><p>DCA! Every month just allocate a small amount of your paycheck to your chosen coin. Mine was ethereum. I did this for 3 years straight. </p></li>\n<li><p>Do NOT try day trade. I mean if you want to try it out go ahead, but from past experience ive just seen people lose no matter what when they are day trading. The long term holders always win. </p></li>\n</ol>\n\n<p>The secrete? Accumulate and hold until your comfortable enough to take profits. Never sell at a loss unless in an emergency. </p>\n\n<p>The people i know who followed these obvious steps changed their lives for the better. I still believe there is opportunity for people to change their lives with crypto. Just don’t let greed blindside you. </p>\n\n<p>Thanks for reading. This is my first post on this subreddit so I wanted it to be good.</p>\n</div><!-- SC_ON -->",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/pc4dg9/advice_for_people_who_got_in_crypto_this_year/",
  "subreddit": "CryptoCurrency",
  "id": "pc4dg9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve been in crypto for many years. When I mean many years I mean I saw bitcoin\nat 300usd and eth at under 10usd. I’ve been through a bull and bear market. I’ve\nseen what works and what doesn’t.\n\nMy honest advice to someone who’s new to this game is:\n\n 1. Identify a coin you’re interested in and do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は何年も前から暗号に取り組んでいます。何年もというのは、ビットコインが\nが300米ドル、ethが10米ドル以下になるまで見てきました。私は強気の市場と弱気の市場を経験しました。私は\n何が有効で何が有効でないかを見てきました。\n\nこのゲームを始めたばかりの人への正直なアドバイスは\n\n 1. 1.興味のあるコインを見つけて、そのコインを...",
      "title": "今年、クリプトを始めた人へのアドバイス。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从事加密货币已经很多年了。我说的多年是指我看到比特币\n在300美元的时候，eth在10美元以下。我经历过牛市和熊市。我已经\n看到了什么是有效的，什么是无效的。\n\n我对刚进入这个游戏的人的诚实建议是。\n\n 1. 确定你感兴趣的钱币，并做...",
      "title": "给今年进入加密货币领域的人的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從事加密貨幣已經很多年了。我說的多年是指我看到比特幣\n在300美元的時候，eth在10美元以下。我經歷過牛市和熊市。我已經\n看到了什麼是有效的，什麼是無效的。\n\n我對剛進入這個遊戲的人的誠實建議是。\n\n 1. 確定你感興趣的錢幣，並做...",
      "title": "給今年進入加密貨幣領域的人的建議。"
    }
  ]
}