{
  "author": "amandamichelle90",
  "original_created_utc": 1636027164,
  "title": "If you invested $1000 into SGT a week ago it would be worth $52 today *the other side to these million dollar equations*",
  "created_utc": 1636036571,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’ve all see the headlines about SHIB and others, <em>$1000 a year ago would be millions today,</em> but at the point when you would have needed to invest to have those gains today — they weren’t different than most of the hype coins that landed people in the red. </p>\n\n<p>Shib took off yes, don’t misunderstand me — I’m perfectly happy with that. But the gamble those holders took <strong>then</strong> is way underestimated <strong>today</strong> now that everyone knows of it. </p>\n\n<p>The dozens of other coins that fucked people hard — don’t make for as good of a one year equation. I took the liberty of going through the <strong>most popular</strong> moonshots posts from a year ago.. to bring you some examples:</p>\n\n<ul>\n<li><p>BEYOND PROTOCOL - “bigger than Bitcoin and ETH combined” is the slogan and it was the most popular post in the last year, $1000 a year ago would be worth $647 today </p></li>\n<li><p>BabyKrypto - only 47 days old but if you bought $1000 worth when they started advertising it on Moonshots, you’d have $125 today </p></li>\n<li><p>$1000 in SHIBAFEVER would have gotten you 77 million coins just a week ago, worth $153 today </p></li>\n</ul>\n\n<p>After this we started getting into rebase tokens where the “price” doesn’t move they just “adjust” the tokens that you hold, but you can’t sell either so I’d say $1000 into those burned up pretty quickly. </p>\n\n<ul>\n<li>There’s also Floki Jr, Floki New York, Micro Shiba and Chopper Inu, Catch Doge, Doge back, and Robo Doge that I can’t even find accurate information on.. but I’m guessing those didn’t make many crypto millionaires. </li>\n</ul>\n\n<p>Anyway, I’m seeing a lot of posts asking how to jump on a newly listed coin first and where to find them, and I just wanted to say .. I don’t even think those that have held SHIB for a year give themselves enough credit for how big a leap they took. This style of investing breeds a lot more losers than winners, and winners rarely stop there and cash out — they’re on the hunt for the next opportunity to lose money. </p>\n\n<p><strong>Do whatever makes you happy — but I think we need to see more of the whole picture</strong></p>\n</div><!-- SC_ON -->",
  "score": 852,
  "permalink": "/r/CryptoCurrency/comments/qmiz59/if_you_invested_1000_into_sgt_a_week_ago_it_would/",
  "subreddit": "CryptoCurrency",
  "id": "qmiz59",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We’ve all see the headlines about SHIB and others, $1000 a year ago would be\nmillions today, but at the point when you would have needed to invest to have\nthose gains today — they weren’t different than most of the hype coins that\nlanded people in the red.\n\nShib took off yes, don’t misunderstand me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "SHIBなどのヘッドラインを見たことがあるが、1年前の1000ドルが今では数百万ドルになっている。\n1年前の1000ドルは今では数百万ドルですが、今の利益を得るためには投資が必要だった時点では\nしかし、今日の利益を得るために投資する必要があった時点では、人々を赤字にした多くの誇大広告のコインと変わらなかったのです。\n赤字になってしまった他の誇大広告と変わりません。\n\n誤解を恐れずに言えば、Shibは確かに離陸しましたが...。",
      "title": "1週間前にSGTに1000ドルを投資していたら、今日は52ドルの価値になっているだろう*100万ドルの方程式の裏側"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都看到了关于SHIB和其他公司的头条新闻，一年前的1000美元将是今天的数百万美元。\n但在你需要投资以获得这些收益的时候，你会发现\n但在你今天需要投资以获得这些收益的时候--它们与大多数炒作的硬币没有什么不同。\n让人们陷入亏损。\n\nShib已经起飞，是的，不要误解我......",
      "title": "如果你在一周前向SGT投资1000美元，那么今天它的价值将是52美元*这些百万美元方程式的另一面*。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都看到了關於SHIB和其他公司的頭條新聞，一年前的1000美元將是今天的數百萬美元。\n但在你需要投資以獲得這些收益的時候，你會發現\n但在你今天需要投資以獲得這些收益的時候--它們與大多數炒作的硬幣沒有什麼不同。\n讓人們陷入虧損。\n\nShib已經起飛，是的，不要誤解我......",
      "title": "如果你在一週前向SGT投資1000美元，那麼今天它的價值將是52美元*這些百萬美元方程式的另一面*。"
    }
  ]
}