{
  "author": "divorcee-megamind",
  "original_created_utc": 1656590205,
  "title": "Why are female nipples not allowed to be out in the same way men's are?",
  "created_utc": 1656599902,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve asked people, I&amp;#39;ve googled. I cannot find a legitimate answer. Have I missed some key difference aside from the fact that boobs/female nipples provide some kind of service (breastfeeding)? Even then I don&amp;#39;t see why that would warrant hiding them? If it was a sexual thing then plenty of people sexualise shirtless men and male pecs. Any religious motive would loop back around to the sexual aspect. Is there a genuine reason? Have I missed something?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/NoStupidQuestions/comments/vo6lwd/why_are_female_nipples_not_allowed_to_be_out_in/",
  "subreddit": "NoStupidQuestions",
  "id": "vo6lwd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I've asked people, I've googled. I cannot find a legitimate answer. Have I\nmissed some key difference aside from the fact that boobs/female nipples provide\nsome kind of service (breastfeeding)? Even then I don't see why that would\nwarrant hiding them? If it was a sexual thing then plenty of people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人に聞いたり、ググったりしているのですが 正当な答えが見つかりません。私は\nおっぱいや女性の乳首が何らかの効果をもたらすという事実の他に、何か重要な違いを見逃していたのでしょうか。\n何らかのサービス（授乳）を提供しているという事実以外に、何か重要な違いを見逃していたのでしょうか？それにしても、なぜ隠す必要があるのかわかりません。\n隠す理由があるのでしょうか？もしそれが性的なものであるなら、多くの人が...",
      "title": "なぜ女性の乳首は、男性と同じように出してはいけないのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我问过别人，我在谷歌上搜索过。我找不到一个合法的答案。难道我\n除了胸部/女性乳头提供了某种服务外，我是否错过了一些关键的区别？\n某种服务（母乳喂养）？即使如此，我也不明白为什么会有\n要把它们藏起来？如果这是一件性的事情，那么很多人都...",
      "title": "为什么女性的乳头不允许像男性那样露出来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我問過別人，我在谷歌上搜索過。我找不到一個合法的答案。難道我\n除了胸部/女性乳頭提供了某種服務外，我是否錯過了一些關鍵的區別？\n某種服務（母乳餵養）？即使如此，我也不明白爲什麼會有\n要把它們藏起來？如果這是一件性的事情，那麼很多人都...",
      "title": "爲什麼女性的乳頭不允許像男性那樣露出來？"
    }
  ]
}