{
  "author": "wuay",
  "the_new_excerpt": "I'm really devastated. Just looked at my wallet today when I was thinking of\nbuying more bitcoin, all to to find out all my cryptocurrency is gone -- valued\nover $40,000. I spent years earning it and resisting pulling it out, hoping I\ncould eventually use it to pay for college tuition.\n\nHere are the…",
  "original_created_utc": 1616804464,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我真的崩溃了。今天刚看了一下我的钱包，当我在想。\n购买更多的比特币，所有的发现我所有的加密货币都消失了 -- 价值。\n四万多块钱。我花了好几年的时间来赚取它，又不愿意把它拿出来，希望我\n最终可以用它来支付大学学费。\n\n下面是...",
      "title": "超过4万美元的加密货币被盗走"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的崩潰了。今天剛看了一下我的錢包，當我在想。\n購買更多的比特幣，所有的發現我所有的加密貨幣都消失了 -- 價值。\n四萬多塊錢。我花了好幾年的時間來賺取它，又不願意把它拿出來，希望我\n最終可以用它來支付大學學費。\n\n下面是...",
      "title": "超過4萬美元的加密貨幣被盜走"
    }
  ],
  "title": "Over $40k of CryptoCurrency Stolen",
  "created_utc": 1616816573,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m really devastated. Just looked at my wallet today when I was thinking of buying more bitcoin, all to to find out all my cryptocurrency is gone -- valued over $40,000. I spent years earning it and resisting pulling it out, hoping I could eventually use it to pay for college tuition.</p>\n\n<p>Here are the facts:</p>\n\n<ul>\n<li><p>I have a Ledger Nano S wallet.</p></li>\n<li><p>That wallet had 4.77 LTC, 4.48 ETH, and 0.73 BTC.</p></li>\n<li><p>The Ledger generated a passphrase containing 24 words.</p></li>\n<li><p>I recorded that passphrase on a piece of paper and hid it.</p></li>\n<li><p>No one had or has access to that paper.</p></li>\n<li><p>That passphrase (those words) were NEVER entered anywhere. (Not even on my phone)</p></li>\n<li><p>On February 24th at 5:45 AM Eastern Time, the BTC was stolen.</p></li>\n<li><p>On the same day, at 6:46 AM and 6:48 AM, the ETH and LTC, respectively, were stolen.</p></li>\n<li><p>I also has a Trust Wallet.</p></li>\n<li><p>I had $1500 worth of NPXS and $1000 worth of TRX in that wallet.</p></li>\n<li><p>On February 24th at 6:48 AM and 6:55 AM both of those were stolen.</p></li>\n<li><p>The passphrase for the Trust Wallet is saved as a screenshot on my iPhone.</p></li>\n<li><p>My iPhone has not left my possession.</p></li>\n<li><p>My iPhone has a 6 digit passcode.</p></li>\n</ul>\n\n<p>The recipient address for the BTC is: 3EP2Bq6yMpXQc3TvoxLtwDsd1tg2A59CJs</p>\n\n<p>Note: Both wallets were hacked on the same day at around the same time. Both had separate passphrases.</p>\n\n<p>No one has access to that paper and that the thief’s wallet address for BTC has other larger transactions. </p>\n\n<p>Did not have the 25th digit only 24 passphrase</p>\n\n<p>Can someone please shed some light on what can be done, if anything? How were both wallets compromised at the same time?! If nothing can be done to retrieve the crytpo, what can be done to prevent this from happening in  the future.</p>\n</div><!-- SC_ON -->",
  "score": 482,
  "permalink": "/r/Bitcoin/comments/me2c4i/over_40k_of_cryptocurrency_stolen/",
  "subreddit": "Bitcoin",
  "id": "me2c4i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357132827
}