{
  "author": "Electronic-Matter178",
  "original_created_utc": 1630072571,
  "title": "How I met your BTC",
  "created_utc": 1630083366,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>I just wanna share my story to inspire and not to brag also sorry for my English if it&#39;s not that fluent.</em><br/>\n<strong>Warning long story ahead</strong></p>\n\n<p>I’m a high school drop out, I’m one of those people who had difficulties in studying. After dropping out of school I became a pet sitter during my spare time in the morning , afternoon I take time to take care and be with my little sisters and at nights I worked at a pizza place, for  years working overtime to save up and provide for my needs and give something to my family, One day our mom left us because we got nothing else anymore. I swore to myself that I’ll do anything in my strength to help my dad provide for us. 4 years ago same day today, I had a conversation with a colleague about bitcoin, at first I couldn’t understand anything but I knew I was interested so during our lunch break I bug her off so we can talk about bitcoin and things about it and how much it can do more in the future and as days passed by I was really hook into it and decided to invest in bitcoin as well just like what she did. It’s not easy I tell you, I worked extra hours just to save up so I can invest in bitcoin, I didn’t buy anything for myself for  years all my savings was just for bitcoin and for my family. I have those crazy nights crying myself to sleep, the burden, the heartache was just heavy but I still managed to get back up because I have people who trust and need me . Well, what can I say? Hard work really does pay off. I’m not yet a millionaire but I can say that I can provide for my family. I even asked my dad to quit his work and just relax. If you’ll ask what happened to the “colleague” she’s now my wife, we got married two years ago and we are now pregnant.<br/>\nFor those who are just starting to invest in bitcoin, it’s not yet too late and it will never be.<br/>\nFor those people who haven’t experienced change, take heart it’ll be your turn soon. ;)<br/>\nSorry for the long post and if the story is a bit cringe or too sad.<br/>\nFelt so nostalgic because of this article :    <a href=\"https://bitcoinist.com/cryptocurrencies-are-positively-impacting-the-lives-and-pockets-of-billions-of-people-across-third-world-countries/\">https://bitcoinist.com/cryptocurrencies-are-positively-impacting-the-lives-and-pockets-of-billions-of-people-across-third-world-countries/</a></p>\n</div><!-- SC_ON -->",
  "score": 225,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/YsK2CrR1tok-iVDQcwbQjOL2cdbIEUMBf_keUhevp4c.jpg?auto=webp&s=0f2b1f79d88569f2128bdaf09f35d7df9ac12745",
          "width": 624,
          "height": 327
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/YsK2CrR1tok-iVDQcwbQjOL2cdbIEUMBf_keUhevp4c.jpg?width=108&crop=smart&auto=webp&s=c904b1915c9300290afece27f51b4498c15ea7d4",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/YsK2CrR1tok-iVDQcwbQjOL2cdbIEUMBf_keUhevp4c.jpg?width=216&crop=smart&auto=webp&s=a809f53e3385ab2cb3fa483f15d6d15f7aac0f50",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/YsK2CrR1tok-iVDQcwbQjOL2cdbIEUMBf_keUhevp4c.jpg?width=320&crop=smart&auto=webp&s=ad90ab57cb93a353a5ff63294add794ddcc944e2",
            "width": 320,
            "height": 167
          }
        ],
        "variants": {},
        "id": "QGp7b2p_X0axZvfwsiRn8mIGV9_HVwWwpwTz9XlWWPU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/pcnuo6/how_i_met_your_btc/",
  "subreddit": "Bitcoin",
  "id": "pcnuo6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just wanna share my story to inspire and not to brag also sorry for my English\nif it's not that fluent.\nWarning long story ahead\n\nI’m a high school drop out, I’m one of those people who had difficulties in\nstudying. After dropping out of school I became a pet sitter during my spare\ntime in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自慢するためではなく、インスピレーションを与えるために私のストーリーを共有したいと思っています。また、私の英語は流暢ではありませんが、申し訳ありません。\n流暢ではないかもしれませんが\n長い話になりますが\n\n僕は高校を中退していて、勉強するのが苦手な人間の一人です。\n勉強していました。中途退学後、暇な時にペットシッターをしていました。\nしています。",
      "title": "あなたのBTCとの出会い"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只想分享我的故事来激励大家，而不是吹嘘，也为我的英语感到抱歉\n如果它不是那么流利。\n警告，前面的故事很长\n\n我是一个高中辍学者，我是那种在学习上有困难的人。\n学习的人。辍学后，我在业余时间成为一名宠物保姆。\n辍学后，我在业余时间做了一个宠物保姆，在...",
      "title": "我是如何认识你的BTC的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想分享我的故事來激勵大家，而不是吹噓，也爲我的英語感到抱歉\n如果它不是那麼流利。\n警告，前面的故事很長\n\n我是一個高中輟學者，我是那種在學習上有困難的人。\n學習的人。輟學後，我在業餘時間成爲一名寵物保姆。\n輟學後，我在業餘時間做了一個寵物保姆，在...",
      "title": "我是如何認識你的BTC的"
    }
  ]
}