{
  "author": "LEONIDAAAS",
  "the_new_excerpt": "WE RECEIVED WORD FROM OUR ALLIES THAT THE FEDERATED POLEIS OF AMERIKA PRODUCED A\nFILM ABOUT OUR BATTLE AT THERMOPYLAI! I HAVE WATCHED THIS FILM CALLED \"300\" AND\nIT IS NOTHING BUT RECKLESS SLANDER OF OUR LAWS, OF OUR CITIZENS, AND OF MYSELF!\nAND ALSO WHERE ARE ALL THE COLOURS!?\n\nFIRST! I DO NOT…",
  "original_created_utc": 1617269016,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们从我们的盟友那里得到消息说，美国联邦波利尼西亚公司生产了一个。\n关于我们在热气球的战斗的电影！我看过这部名为 \"300 \"的电影，而且\n这不过是对我们的法律，对我们的公民，对我自己的肆意诽谤！\n还有，所有的颜色都在哪里？\n\n首先！我不...",
      "title": "[评论]这部电影 \"300 \"是对SPARTA的恶意诽谤，这意味着战争。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們從我們的盟友那裏得到消息說，美國聯邦波利尼西亞公司生產了一個。\n關於我們在熱氣球的戰鬥的電影！我看過這部名爲 \"300 \"的電影，而且\n這不過是對我們的法律，對我們的公民，對我自己的肆意誹謗！\n還有，所有的顏色都在哪裏？\n\n首先！我不...",
      "title": "[評論]這部電影 \"300 \"是對SPARTA的惡意誹謗，這意味着戰爭。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "同盟国からの情報によると、アメリカ連邦極東支部が私たちの活動を紹介する映画を制作したとのことです。\nテルモビライの戦いを題材にした映画を制作したとの情報を得ました。私はこの「300」という映画を見ました。\n我が国の法律、国民、そして私への無謀な誹謗中傷に過ぎない。\nそして、すべての色はどこにあるのでしょうか？\n\n最初に！私には...",
      "title": "レビュー】この映画「300」はスパルタへの悪意ある攻撃であり、これは戦争を意味する。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "同盟国からの情報によると、アメリカ連邦極東支部が私たちの活動を紹介する映画を制作したとのことです。\nテルモビライの戦いを題材にした映画を制作したとの情報を得ました。私はこの「300」という映画を見ました。\n我が国の法律、国民、そして私への無謀な誹謗中傷に過ぎない。\nそして、すべての色はどこにあるのでしょうか？\n\n最初に！私には...",
      "title": "レビュー】この映画「300」はスパルタへの悪意ある攻撃であり、これは戦争を意味する。"
    }
  ],
  "title": "[Review] THIS MOVIE \"300\" IS A VICIOUS SLANDER AGAINST SPARTA AND THIS MEANS WAR",
  "created_utc": 1617284110,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>WE RECEIVED WORD FROM OUR ALLIES THAT THE FEDERATED POLEIS OF AMERIKA PRODUCED A FILM ABOUT OUR BATTLE AT THERMOPYLAI! I HAVE WATCHED THIS FILM CALLED &quot;300&quot; AND IT IS NOTHING BUT RECKLESS SLANDER OF OUR LAWS, OF OUR CITIZENS, AND OF MYSELF! AND ALSO WHERE ARE ALL THE COLOURS!?</p>\n\n<p>FIRST! I DO NOT UNDERSTAND THE TITLE OF THIS FILM! I MARCHED OUT WITH ONE THOUSAND SPARTANS AND CALLED ON THE ALLIES TO SUPPLY THREE THOUSAND MORE! ADD THE CENTRAL GREEKS AND THERE WERE MORE THAN SIX THOUSAND OF US AT THE PASS!</p>\n\n<p>WHEN I LED THEM I WAS NOT SOME YOUNG MAN WITHOUT SENSE! I WAS 50 WHEN I BECAME KING AND FOUGHT MY FIRST BATTLE AT THERMOPYLAI TEN YEARS LATER!</p>\n\n<p>OUR VENERATED EPHORS ARE NOT INBRED MONSTERS BUT CITIZENS ELECTED ANNUALLY! THEIR JOB IS NOT RELIGIOUS BUT EXECUTIVE! THERE IS NO ORACLE AT SPARTA! WE SUBMIT OUR QUESTIONS TO THE ORACLE OF APOLLO AT DELPHI, WHERE BY ANCIENT CUSTOM THE PYTHIA IS A CRONE!</p>\n\n<p>IT IS OUTRAGEOUS TO SUGGEST THAT I TOOK PART IN THE GRAVE SACRILEGE OF KILLING THE MESSENGERS OF THE GREAT KING! THIS CURSED ACT MAY POLLUTE OUR STATE, BUT NOT MY HOUSE!</p>\n\n<p>THERE CAN BE NO GREATER INSULT THAN TO IMPLY THAT I MARCHED AGAINST THE WISHES OF THE EPHORS! AS SPARTIATES, OUR MASTER IS THE LAW! I AM VERY UNCOMFORTABLE MAKING MY OWN DECISIONS!</p>\n\n<p>I DO NOT UNDERSTAND THIS BABBLE ABOUT THE &quot;PHALANX&quot;! THIS WORD IS ONLY USED BY THE POETS TO SPEAK OF PRIMITIVE WARBANDS! OUR BATTLE FORMATION IS THE REDOUBTABLE TAXIS!</p>\n\n<p>I NEVER SAID &quot;COME AND GET THEM&quot; AND IT WOULD BE PURE HUBRIS IF I HAD TAUNTED THE GREAT KING IN SUCH A WAY!</p>\n\n<p>HOW DARE THIS MOVIE SUGGEST THAT SPARTANS WOULD FIGHT NAKED LIKE ATHLETES, WHEN IN FACT WE FINED THOSE WHO WENT INTO BATTLE UNPREPARED, EVEN WHEN THEY PERFORMED GREAT DEEDS!?</p>\n\n<p>IT IS AN INTOLERABLE SLANDER TO SUGGEST THAT WE WOULD SUFFER A WOMAN TO ADDRESS OUR COUNCIL OF ELDERS, EVEN ONE AS VENERABLE AS MY NIECE/WIFE!</p>\n\n<p>NO SPARTAN WOULD SPEAK TO A SURVIVOR OF THERMOPYLAI WHEN THE TRUE SPARTANS DIED IN GLORIOUS BATTLE! THE MEN I SENT AWAY WERE SO ASHAMED TO STILL DRAW BREATH THAT THEY KILLED THEMSELVES!</p>\n\n<p>I COULD GO ON AND ON BUT I AM NOT ACCUSTOMED TO MAKING LONG SPEECHES LIKE SOME CHATTERING ATHENIAN! THIS SLANDEROUS ILL-INFORMED ANTI-SPARTAN PROPAGANDA WILL NOT STAND! AND SINCE WE SPARTANS ONCE DECLARED WAR ON ELIS FOR NOT LETTING US TAKE PART IN THE OLYMPIC GAMES, AND ON THEBES BECAUSE THEY WOULD NOT LET MY DESCENDANT SACRIFICE AT AULIS, IT SEEMS FAIR TO TAKE THIS SLIGHT AS A CAUSE FOR WAR! MUSTER YOUR SPEARMEN, FEDERATED POLEIS OF AMERIKA! WE WILL MEET YOU IN THE FIELD!</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/AskHistorians/comments/mhrjdw/review_this_movie_300_is_a_vicious_slander/",
  "subreddit": "AskHistorians",
  "id": "mhrjdw",
  "is_self": true,
  "media": null,
  "is_video": false
}