{
  "author": "BigBet0",
  "the_new_excerpt": "As someone who likes to buy the dip and has plenty of stocks in various sectors\n(other than tech) they want to buy... I sense a bull market happening for at\nleast a month or so, and then inflation popping it's head back up in May.\n\nBut for whatever reason, I feel very dissatisfied and frustrated on…",
  "original_created_utc": 1615446271,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个喜欢买跌停板的人，并且在各个板块中拥有大量的股票。\n(除科技股外)他们想买... 我觉得牛市的发生在\n至少一个月左右，然后通胀率在5月份又回升了。\n\n但不管出于什么原因，我觉得很不满意，很沮丧，对... ...",
      "title": "还有人在牛市中不舒服吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個喜歡買跌停板的人，並且在各個板塊中擁有大量的股票。\n(除科技股外)他們想買... 我覺得牛市的發生在\n至少一個月左右，然後通脹率在5月份又回升了。\n\n但不管出於什麼原因，我覺得很不滿意，很沮喪，對... ...",
      "title": "還有人在牛市中不舒服嗎？"
    }
  ],
  "title": "Anyone else uncomfortable in a bull market?",
  "created_utc": 1615488846,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As someone who likes to buy the dip and has plenty of stocks in various sectors (other than tech) they want to buy... I sense a bull market happening for at least a month or so, and then inflation popping it&#39;s head back up in May.</p>\n\n<p>But for whatever reason, I feel very dissatisfied and frustrated on &quot;up&quot; green days, and get massive FOMO when most of the stocks on my watchlist are up 3-5% and the one&#39;s at worst are in the -1-+1% range. </p>\n\n<p>Some people panic or get emotional when stocks go down, but I feel much more comfortable there with buying opportunities. It&#39;s times like these where I get anxious and feel I didn&#39;t do &quot;enough&quot; on a given day (or in prior days ESPECIALLY on down days where I bought maybe 2-3 stocks and could have in retrospect bought 5-6) especially when my portfolio only goes up maybe .25% or so.</p>\n\n<p>This is coming from someone  who looked at stocks in past months and realized had they gotten them then, they would virtually all be at higher valuations today. Also as someone who is trying to transition out of tech into other sectors, but so far is not quite there.</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/stocks/comments/m2k8hk/anyone_else_uncomfortable_in_a_bull_market/",
  "subreddit": "stocks",
  "id": "m2k8hk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381378
}