{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": " On Monday June 7, 2021, shares of Scholastic (SCHL) rose 8%. They’d gain another 4.1% the following day.\n\nThe catalyst for the two-day rally was grim: chief executive officer, M. Richard Robinson, Jr., had passed away suddenly over the weekend.\n\nInvestors didn’t bid shares of Scholastic up because Robinson was a poor CEO. Rather, they did so because Robinson was not just the CEO, but the controlling shareholder. His passing opened the door to the sale of a company that even before the pandemic seemed to trade at a sharp discount to the value of its assets.\n\nThe surprising resolution of Robinson’s stake means that door is still open. Fourth quarter results last week suggest that the operating business retains significant value. Cash and owned real estate provides some downside protection if the bull case doesn’t play out.\n\nThere is a catch: SCHL has rallied a bit too far at the moment to be compelling. Shares have gained 22% over the last seven sessions. More than half the gains came on Friday, after Scholastic released a strong (and surprising) fiscal Q4 report that sent SCHL up 12%.\n\nAs a result, patience is advised. It’s possible SCHL reverses with or without the market. (The stock in fact did precisely that last June after the news of Robinson’s passing.) But given that a) the story is interesting b) we’ve done the work and c) to be blunt, compelling ideas (either long or short) are not easy to find right now, we felt it prudent to lay out the bull case here, allowing investors to join us in keeping a close eye on the stock in the coming weeks.\n\n**Scholastic At A Glance**\n\nFounded in 1920, Scholastic is the world’s largest publisher of children’s books. It offers those books via standard distribution channels (bookstores, online, big-box retailers, etc.) as well as book clubs and book fairs at schools. The company also develops curricula for elementary school students, along with *Scholastic* magazine.\n\nThe company also owns substantial intellectual property. Most notable are its publishing rights to *Harry Potter* and *The Hunger Games*. Scholastic also owns properties like *Clifford the Big Red Dog*, *Goosebumps*, *The Magic School Bus*, and *Captain Underpants*, which are developed under its Scholastic Entertainment arm.\n\n**Reasons For Caution**\n\nThat description alone highlights some of the risks here. A book publisher is not the kind of business that is going to garner a high valuation in any market, let alone this one. The reliance on book clubs and book fairs adds to potential top-line pressure.\n\nOstensibly, Scholastic can pivot away from traditional print sales to digital opportunities. But any investor paying attention for the last decade to legacy media companies (think television, radio, or even GameStop (GME)) will be keenly aware of how difficult those pivots are. Few have shown success, let alone met management expectations. Indeed, Scholastic’s own 2020 initiative contemplated a significant expansion of the company’s digital strategy. As we shall see, that hasn’t occurred to the extent hoped.\n\nThe two big franchises, *Potter* and *Hunger Games*, both appear to be over. *Potter* author J.K. Rowling [said as much](https://www.bustle.com/p/jk-rowling-explains-why-there-wont-be-any-more-stories-about-harry-potter-8900613) back in 2018. That series, in particular, was enormously profitable for Scholastic. In fiscal 2018, one year after the last Potter book was published, revenue and adjusted profit in Scholastic’s Children’s Book Publishing both declined more than 25%.\n\nThere’s also this problem: over two decades, on an annualized basis shareholders have gained only 1% in stock price appreciation and another 1% in dividends. A week ago 20-year *total* returns including dividends were 15%; payouts aside, SCHL had declined over that period.\n\nBroadly speaking, the bull case for SCHL is that the stock is cheap, not that the business is particularly attractive. And for years now (with only a few exceptions) those cases simply have not played out. Perhaps in a bear market where valuation suddenly matters again, that will change.\n\nBecause the downside here seems reasonably well-protected, and a potential catalyst looms, there’s a case that SCHL might be the exception to the rule, or at least that the risk of a few years of \\~dead-money returns is worth taking. (Our repeatedly-voiced skepticism toward valuations, even at this point in the market, adds to our comfort in taking that risk. 2% annualized returns may well represent alpha over the next 2-5 years.)\n\nBut that downside protection — cash alone is more than 20% of the fully-diluted market cap — also limits upside. So does the nature of the operating business. And so, like any good value play, valuation is paramount.\n\nThat’s why the rally of the past week does change the calculus here somewhat. Certainly, the Q4 earnings report implied a higher valuation, given strong guidance for fiscal 2023. But a 22% rally in the stock implies a \\~30% increase in Scholastic’s enterprise value — an obviously enormous move for a low-growth company. As we shall see, there’s still a case to be made for the stock, but it is more difficult to pound the table.\n\n**The Succession Drama**\n\nIncredibly, Scholastic went 101 years with two CEOs. Maurice R. Robinson (known as “Robbie”) began the magazine in 1920 and built the company from there. His son (known as “Dick”) took over as CEO in 1975 and stayed in that role until his passing last year.\n\nThe family nature of the business appears to have kept Scholastic off the market despite [broader consolidation in the publishing industry](https://www.authorsalliance.org/2021/12/08/the-consolidation-of-publishing-houses-past-and-present/). In 2015, now-private Houghton Mifflin Harcourt purchased Scholastic’s EdTech business for $575 million. Per a *Value Investors Club* article published that year, HMHC said in its roadshow that it was rebuffed from [buying the entire company](https://www.valueinvestorsclub.com/idea/SCHOLASTIC_CORP/4209194685).\n\nLast year, the *Wall Street Journal* [highlighted the succession drama](https://www.wsj.com/articles/succession-drama-grips-scholastic-ceos-sudden-death-an-office-romance-and-a-surprise-will-11627850787) that followed Dick Robinson’s passing. His brother William seemed to confirm the market’s long-running perception of Scholastic when he told the outlet:\n\n&gt;Our family value was we’d rather not have the financial benefit that we might get from a sale if it means the company won’t be in the future what it was. Everybody knows Scholastic and has a good feeling about it and it does good things for teachers. It’s more than just a business for us.\n\nThe problem is that, for shareholders, it is just a business; “good feeling\\[s\\]” aren’t enough. Yet, owing to a dual-class stock majority owned by Dick Robinson, common shareholders couldn’t do anything but complain or sell.\n\nRobinson’s death changed the blunt, unfeeling, financial calculus. Because, as the *Journal* reported, and Scholastic’s 2021 proxy statement confirmed, Robinson in his will [left all of his supervoting Class A shares](https://www.sec.gov/Archives/edgar/data/866729/000156459021043480/schl-def14a_20210922.htm) to Ms. Iole Lucchese. At the time of Robinson’s passing, Lucchese was a 30-year veteran of the company, rising to become Scholastic’s Chief Strategy Officer as well as the head of Scholastic Entertainment.\n\nShe was also Robinson’s ex-girlfriend, with a relationship that had gone on for some years, according to reporting from both the Journal and *Vanity Fair*. The bequest of the Class A shares to Lucchese bypassed both of Robinson’s children. (Lucchese is now chair of the board of directors as well.)\n\nAs the *Journal* reported in November, those children plan to contest the will. Notably, the financial adviser to Robinson’s ex-wife, Helen Benham Robinson, testified that, in 2009, Dick Robinson [agreed to give those shares](https://www.wsj.com/articles/scholastic-succession-lucchese-robinson-harry-potter-11637731535) to his sons in exchange for a $2 million loan. Benham Robinson has also said that Dick Robinson planned to update his will, though there’s no claim that he actually did so.\n\nHowever this plays out, however, the idea of Scholastic as a family business likely is over. *Vanity Fair* reported in March that [Lucchese was now engaged](https://www.vanityfair.com/style/2022/03/inside-the-succession-drama-at-scholastic), perhaps diminishing her loyalty to Dick Robinson and his family. Lucchese already has sold 300,000 common shares from the estate back to Scholastic at a modest discount to then-market price.\n\nShould the Robinson sons somehow regain control of the Class A shares, their adherence to the family’s century-long devotion to the business seems questionable. In the Journal’s initial report, neither came off as particularly devoted to Scholastic — and that’s both putting it mildly and skipping over the punchline.[1](https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually#footnote-1)\n\nIndeed, the *Journal* later reported that it’s possible the two sons could each clear less than $1 million from the estate after taxes and executor fees (some of which are going to Ms. Lucchese). It seems likely that the Robinson family may thus support a sale if only in the name of (not-unreasonable but suddenly more pressing) selfish financial interest. (As far as I can tell, there’s been no news on the legal front since; Scholastic’s 2022 proxy statement, due next month, may provide more color.)\n\nObviously, when Dick Robinson passed away, investors did not know any of these facts. Rather, the 12% rally was a response to the idea that SCHL stock needed something — anything — to happen. Then and now, the market is not going to be moral or polite about what or how something happened.\n\n**The Broad Case for Scholastic Stock**\n\nThe catalyst is important because, in some form, the current case for Scholastic stock has existed for years. The balance sheet has been a fortress since the EdTech sale; the company closed FY22 with $310 million in net cash on the books[2](https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually#footnote-2).\n\nNotably, Scholastic also owns its headquarters building at 557 Broadway in Manhattan’s SoHo neighborhood. The company got an absolute steal, paying just $25.5 million in 2010. It acquired the neighboring building [for $255 million](https://commercialobserver.com/2014/03/scholastic-buys-555-broadway-for-255-million/) four years later, and then undertook a nearly five-year renovation of both properties.\n\nIn 2015, Madison Capital [agreed to pay $400 million](https://therealdeal.com/2015/04/17/madison-capital-partner-to-pay-400m-for-scholastics-soho-retail/) just for the rights to two floors of retail space on the properties. That deal wound up falling through, and post-pandemic real estate values in Manhattan are likely now lower for both office and retail square footage. But simply at cost (including renovations), the two buildings likely are worth at least that $400 million. (Before the renovations were completed, Scholastic had projected at least $10 million in annual rental income; the company hasn’t specified a figure since, though Robinson on the Q3 FY18 call said the revenues would “add significantly to our bottom line.” At a 6% cap rate it does seem like $400 million is fairly achievable.) Combined with the cash on the books, \\~half of the market cap already is supported.\n\nAnd there’s still the operating business, with a valuable brand, and still-valuable IP. Trade channel revenues totaled $344 million in FY22, up year-over-year after growth in FY21 as well; the 10-K attributes the growth [to previously published titles](https://www.sec.gov/ix?doc=/Archives/edgar/data/866729/000086672922000017/schl-20220531.htm) as “demand for the Company’s best-selling series remained strong.” Scholastic Entertainment is having some success, with a live-action *Clifford* movie, the animated *Stillwater* on Apple (AAPL) TV+, and a live-action *Goosebumps* going to Disney (DIS) Plus.\n\nThere seem to be ways to find value here. A P-E firm could fund an LBO through cash on the books and a sale-leaseback of the SoHo headquarters. The fairs and clubs businesses, which still throw off cash flow, plus the backlist could fund any remaining debt; Scholastic Entertainment, digital and international efforts (including shipments to English-language schools in Asia) could provide potential growth drivers.\n\nA leveraged recap might also make some sense. The company could provide liquidity to Lucchese (and/or the Robinson family, depending on how court cases shake out) in return for an end to the dual-class structure.\n\nTo be clear, the point here is not that financial engineering can create value. Rather, it’s that there are now options for the existing value to make its way to minority shareholders. Pre-2021, SCHL could and did look ‘cheap’ on paper, but it didn’t really matter all that much. The company was controlled by a CEO so devoted to the business that (as both the *Journal* and *Vanity Fair* noted) he met *both* of his wives *and* a long-term girlfriend there. That CEO was part of a family for whom, as his own brother put it, Scholastic was “more than just a business.”\n\nAt some point soon, however, it seems likely that it will be just a business. And so the question of what that business is worth suddenly becomes much more pressing, and much more interesting.\n\n**Valuing Scholastic**\n\nAt Friday’s close of $41.66, Scholastic has an enterprise value of $1.17 billion. That’s a touch under 6x guided EBITDA for FY23 ($195 million-$205 million), guidance that appears to have driven the big post-earnings rally in the stock.\n\nPeer comparisons here are close to impossible, but 6x EBITDA seems a reasonable multiple, and perhaps a touch cheap. Normalized free cash flow at the midpoint of the guided EBITDA range would be \\~$120 million[3](https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually#footnote-3), valuing the operating business right at 10x free cash flow.[4](https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually#footnote-4)\n\nOn its face, 10x free cash flow perhaps doesn’t seem that attractive for a book publisher — ostensibly a business that’s a bit of a melting ice cube. But it’s perhaps premature to believe that Scholastic earnings have peaked.\n\nFor one, those earnings certainly haven’t peaked yet. FY20 EBITDA was guided to $160-$170 million after the second quarter, and on the Q3 call (held on Mar. 18, 2020, right as the severity of the pandemic was becoming all too clear) Robinson said the company was ahead of plan. FY23 guidance implies $35 million in dollar growth from that interrupted outlook three years earlier. Admittedly, there were $50 million in permanent cost cuts imposed, but Scholastic also has dealt with the same inflationary issues as so many other U.S. businesses (along with currency impacts on the international business, which accounted for 18% of FY22 revenue).\n\nSecondly, there are drivers here. As noted, Scholastic Entertainment has projects on the way. The book clubs business has been in decline since before the pandemic, due to secular trends and tax changes. (The 2018 Supreme Court decision that [forced e-commerce retailers to pay sales tax](https://www.cnbc.com/2018/06/21/why-amazon-wins-with-supreme-court-sales-tax-ruling.html) caught Scholastic in its wake.) But in FY23, Scholastic still only expects its fair count to reach 85% of the pre-pandemic total; revenue per fair in FY22 was above the FY19 level. Full normalcy there provides some incremental growth potential.\n\nScholastic’s new curriculum offering is showing success. International markets offer promise. Deferred revenue from digital subscriptions (per the 10-K) rose to nearly $20 million, as Scholastic found a measure of success on that front. Trade has grown for years now.\n\nScholastic is guiding for revenue to increase 8% to 10% this fiscal year; that’s not a sustainable long-term rate, but there is a pathway toward something like low-single-digit top-line growth beyond FY23.\n\nFinally, there’s the question of how well the business is being run at the moment. The coverage of the succession drama also highlighted concerns about talent drain and management capabilities. (Some of the criticisms were aimed at Lucchese herself, most notably in her handling of the digital initiatives. However, there were differing accounts about how much responsibility she had for those efforts. Of course, that’s part of the point: for an effort as important as digital transformation, there shouldn’t be any confusion about whose brief it is.) As with the balance sheet, there is reason to believe that more financially-motivated ownership might do things differently — and better.\n\nNow, again, the move to $41 from $34 two weeks ago has changed the story. At 10x FY23 free cash flow, the story here can work, but at least as a standalone Scholastic needs to hit guidance and stabilize FCF from there. (My numbers suggest, in that scenario, the stock would be worth about $54, 29% above current levels. My sense, having followed this company since the middle of the last decade, is that kind of scenario is closer to a bull case than a base case.) At $34, that forward multiple drops down to 8x, and there’s much more of a case that a) the market is misreading the business and b) an acquirer can wring out big value in a hurry.\n\nAfter Q4, it may be too much to ask for $34 again. (I’d hope for $38, at least getting one turn down in the P/FCF multiple.) Guidance, for now, dispels fears of a near-term decline in earnings. Until that outlook is proven optimistic (and it may well not be), it’s probably enough to keep investor interest — and it’s probably enough to drive some upside — even after the big gains of late. The question is whether “some upside” is the same as “enough upside.”\n\n[LINK TO ORIGINAL POST](https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually)\n\n*As of this writing, the author has no positions in any securities mentioned.*\n\nDisclaimer: The information in this article is not and should not be construed as investment advice. Overlooked Alpha is for information, entertainment purposes only. Please see the full disclaimer at overlookedalpha.com.",
  "author_fullname": "t2_l3buwvz6",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Analysis of Scholastic Corp: End of an Era?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_w79v8j",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.92,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 63,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 63,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1658707285,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;On Monday June 7, 2021, shares of Scholastic (SCHL) rose 8%. They’d gain another 4.1% the following day.&lt;/p&gt;\n\n&lt;p&gt;The catalyst for the two-day rally was grim: chief executive officer, M. Richard Robinson, Jr., had passed away suddenly over the weekend.&lt;/p&gt;\n\n&lt;p&gt;Investors didn’t bid shares of Scholastic up because Robinson was a poor CEO. Rather, they did so because Robinson was not just the CEO, but the controlling shareholder. His passing opened the door to the sale of a company that even before the pandemic seemed to trade at a sharp discount to the value of its assets.&lt;/p&gt;\n\n&lt;p&gt;The surprising resolution of Robinson’s stake means that door is still open. Fourth quarter results last week suggest that the operating business retains significant value. Cash and owned real estate provides some downside protection if the bull case doesn’t play out.&lt;/p&gt;\n\n&lt;p&gt;There is a catch: SCHL has rallied a bit too far at the moment to be compelling. Shares have gained 22% over the last seven sessions. More than half the gains came on Friday, after Scholastic released a strong (and surprising) fiscal Q4 report that sent SCHL up 12%.&lt;/p&gt;\n\n&lt;p&gt;As a result, patience is advised. It’s possible SCHL reverses with or without the market. (The stock in fact did precisely that last June after the news of Robinson’s passing.) But given that a) the story is interesting b) we’ve done the work and c) to be blunt, compelling ideas (either long or short) are not easy to find right now, we felt it prudent to lay out the bull case here, allowing investors to join us in keeping a close eye on the stock in the coming weeks.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Scholastic At A Glance&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Founded in 1920, Scholastic is the world’s largest publisher of children’s books. It offers those books via standard distribution channels (bookstores, online, big-box retailers, etc.) as well as book clubs and book fairs at schools. The company also develops curricula for elementary school students, along with &lt;em&gt;Scholastic&lt;/em&gt; magazine.&lt;/p&gt;\n\n&lt;p&gt;The company also owns substantial intellectual property. Most notable are its publishing rights to &lt;em&gt;Harry Potter&lt;/em&gt; and &lt;em&gt;The Hunger Games&lt;/em&gt;. Scholastic also owns properties like &lt;em&gt;Clifford the Big Red Dog&lt;/em&gt;, &lt;em&gt;Goosebumps&lt;/em&gt;, &lt;em&gt;The Magic School Bus&lt;/em&gt;, and &lt;em&gt;Captain Underpants&lt;/em&gt;, which are developed under its Scholastic Entertainment arm.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Reasons For Caution&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;That description alone highlights some of the risks here. A book publisher is not the kind of business that is going to garner a high valuation in any market, let alone this one. The reliance on book clubs and book fairs adds to potential top-line pressure.&lt;/p&gt;\n\n&lt;p&gt;Ostensibly, Scholastic can pivot away from traditional print sales to digital opportunities. But any investor paying attention for the last decade to legacy media companies (think television, radio, or even GameStop (GME)) will be keenly aware of how difficult those pivots are. Few have shown success, let alone met management expectations. Indeed, Scholastic’s own 2020 initiative contemplated a significant expansion of the company’s digital strategy. As we shall see, that hasn’t occurred to the extent hoped.&lt;/p&gt;\n\n&lt;p&gt;The two big franchises, &lt;em&gt;Potter&lt;/em&gt; and &lt;em&gt;Hunger Games&lt;/em&gt;, both appear to be over. &lt;em&gt;Potter&lt;/em&gt; author J.K. Rowling &lt;a href=\"https://www.bustle.com/p/jk-rowling-explains-why-there-wont-be-any-more-stories-about-harry-potter-8900613\"&gt;said as much&lt;/a&gt; back in 2018. That series, in particular, was enormously profitable for Scholastic. In fiscal 2018, one year after the last Potter book was published, revenue and adjusted profit in Scholastic’s Children’s Book Publishing both declined more than 25%.&lt;/p&gt;\n\n&lt;p&gt;There’s also this problem: over two decades, on an annualized basis shareholders have gained only 1% in stock price appreciation and another 1% in dividends. A week ago 20-year &lt;em&gt;total&lt;/em&gt; returns including dividends were 15%; payouts aside, SCHL had declined over that period.&lt;/p&gt;\n\n&lt;p&gt;Broadly speaking, the bull case for SCHL is that the stock is cheap, not that the business is particularly attractive. And for years now (with only a few exceptions) those cases simply have not played out. Perhaps in a bear market where valuation suddenly matters again, that will change.&lt;/p&gt;\n\n&lt;p&gt;Because the downside here seems reasonably well-protected, and a potential catalyst looms, there’s a case that SCHL might be the exception to the rule, or at least that the risk of a few years of ~dead-money returns is worth taking. (Our repeatedly-voiced skepticism toward valuations, even at this point in the market, adds to our comfort in taking that risk. 2% annualized returns may well represent alpha over the next 2-5 years.)&lt;/p&gt;\n\n&lt;p&gt;But that downside protection — cash alone is more than 20% of the fully-diluted market cap — also limits upside. So does the nature of the operating business. And so, like any good value play, valuation is paramount.&lt;/p&gt;\n\n&lt;p&gt;That’s why the rally of the past week does change the calculus here somewhat. Certainly, the Q4 earnings report implied a higher valuation, given strong guidance for fiscal 2023. But a 22% rally in the stock implies a ~30% increase in Scholastic’s enterprise value — an obviously enormous move for a low-growth company. As we shall see, there’s still a case to be made for the stock, but it is more difficult to pound the table.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Succession Drama&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Incredibly, Scholastic went 101 years with two CEOs. Maurice R. Robinson (known as “Robbie”) began the magazine in 1920 and built the company from there. His son (known as “Dick”) took over as CEO in 1975 and stayed in that role until his passing last year.&lt;/p&gt;\n\n&lt;p&gt;The family nature of the business appears to have kept Scholastic off the market despite &lt;a href=\"https://www.authorsalliance.org/2021/12/08/the-consolidation-of-publishing-houses-past-and-present/\"&gt;broader consolidation in the publishing industry&lt;/a&gt;. In 2015, now-private Houghton Mifflin Harcourt purchased Scholastic’s EdTech business for $575 million. Per a &lt;em&gt;Value Investors Club&lt;/em&gt; article published that year, HMHC said in its roadshow that it was rebuffed from &lt;a href=\"https://www.valueinvestorsclub.com/idea/SCHOLASTIC_CORP/4209194685\"&gt;buying the entire company&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Last year, the &lt;em&gt;Wall Street Journal&lt;/em&gt; &lt;a href=\"https://www.wsj.com/articles/succession-drama-grips-scholastic-ceos-sudden-death-an-office-romance-and-a-surprise-will-11627850787\"&gt;highlighted the succession drama&lt;/a&gt; that followed Dick Robinson’s passing. His brother William seemed to confirm the market’s long-running perception of Scholastic when he told the outlet:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Our family value was we’d rather not have the financial benefit that we might get from a sale if it means the company won’t be in the future what it was. Everybody knows Scholastic and has a good feeling about it and it does good things for teachers. It’s more than just a business for us.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The problem is that, for shareholders, it is just a business; “good feeling[s]” aren’t enough. Yet, owing to a dual-class stock majority owned by Dick Robinson, common shareholders couldn’t do anything but complain or sell.&lt;/p&gt;\n\n&lt;p&gt;Robinson’s death changed the blunt, unfeeling, financial calculus. Because, as the &lt;em&gt;Journal&lt;/em&gt; reported, and Scholastic’s 2021 proxy statement confirmed, Robinson in his will &lt;a href=\"https://www.sec.gov/Archives/edgar/data/866729/000156459021043480/schl-def14a_20210922.htm\"&gt;left all of his supervoting Class A shares&lt;/a&gt; to Ms. Iole Lucchese. At the time of Robinson’s passing, Lucchese was a 30-year veteran of the company, rising to become Scholastic’s Chief Strategy Officer as well as the head of Scholastic Entertainment.&lt;/p&gt;\n\n&lt;p&gt;She was also Robinson’s ex-girlfriend, with a relationship that had gone on for some years, according to reporting from both the Journal and &lt;em&gt;Vanity Fair&lt;/em&gt;. The bequest of the Class A shares to Lucchese bypassed both of Robinson’s children. (Lucchese is now chair of the board of directors as well.)&lt;/p&gt;\n\n&lt;p&gt;As the &lt;em&gt;Journal&lt;/em&gt; reported in November, those children plan to contest the will. Notably, the financial adviser to Robinson’s ex-wife, Helen Benham Robinson, testified that, in 2009, Dick Robinson &lt;a href=\"https://www.wsj.com/articles/scholastic-succession-lucchese-robinson-harry-potter-11637731535\"&gt;agreed to give those shares&lt;/a&gt; to his sons in exchange for a $2 million loan. Benham Robinson has also said that Dick Robinson planned to update his will, though there’s no claim that he actually did so.&lt;/p&gt;\n\n&lt;p&gt;However this plays out, however, the idea of Scholastic as a family business likely is over. &lt;em&gt;Vanity Fair&lt;/em&gt; reported in March that &lt;a href=\"https://www.vanityfair.com/style/2022/03/inside-the-succession-drama-at-scholastic\"&gt;Lucchese was now engaged&lt;/a&gt;, perhaps diminishing her loyalty to Dick Robinson and his family. Lucchese already has sold 300,000 common shares from the estate back to Scholastic at a modest discount to then-market price.&lt;/p&gt;\n\n&lt;p&gt;Should the Robinson sons somehow regain control of the Class A shares, their adherence to the family’s century-long devotion to the business seems questionable. In the Journal’s initial report, neither came off as particularly devoted to Scholastic — and that’s both putting it mildly and skipping over the punchline.&lt;a href=\"https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually#footnote-1\"&gt;1&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Indeed, the &lt;em&gt;Journal&lt;/em&gt; later reported that it’s possible the two sons could each clear less than $1 million from the estate after taxes and executor fees (some of which are going to Ms. Lucchese). It seems likely that the Robinson family may thus support a sale if only in the name of (not-unreasonable but suddenly more pressing) selfish financial interest. (As far as I can tell, there’s been no news on the legal front since; Scholastic’s 2022 proxy statement, due next month, may provide more color.)&lt;/p&gt;\n\n&lt;p&gt;Obviously, when Dick Robinson passed away, investors did not know any of these facts. Rather, the 12% rally was a response to the idea that SCHL stock needed something — anything — to happen. Then and now, the market is not going to be moral or polite about what or how something happened.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Broad Case for Scholastic Stock&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The catalyst is important because, in some form, the current case for Scholastic stock has existed for years. The balance sheet has been a fortress since the EdTech sale; the company closed FY22 with $310 million in net cash on the books&lt;a href=\"https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually#footnote-2\"&gt;2&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Notably, Scholastic also owns its headquarters building at 557 Broadway in Manhattan’s SoHo neighborhood. The company got an absolute steal, paying just $25.5 million in 2010. It acquired the neighboring building &lt;a href=\"https://commercialobserver.com/2014/03/scholastic-buys-555-broadway-for-255-million/\"&gt;for $255 million&lt;/a&gt; four years later, and then undertook a nearly five-year renovation of both properties.&lt;/p&gt;\n\n&lt;p&gt;In 2015, Madison Capital &lt;a href=\"https://therealdeal.com/2015/04/17/madison-capital-partner-to-pay-400m-for-scholastics-soho-retail/\"&gt;agreed to pay $400 million&lt;/a&gt; just for the rights to two floors of retail space on the properties. That deal wound up falling through, and post-pandemic real estate values in Manhattan are likely now lower for both office and retail square footage. But simply at cost (including renovations), the two buildings likely are worth at least that $400 million. (Before the renovations were completed, Scholastic had projected at least $10 million in annual rental income; the company hasn’t specified a figure since, though Robinson on the Q3 FY18 call said the revenues would “add significantly to our bottom line.” At a 6% cap rate it does seem like $400 million is fairly achievable.) Combined with the cash on the books, ~half of the market cap already is supported.&lt;/p&gt;\n\n&lt;p&gt;And there’s still the operating business, with a valuable brand, and still-valuable IP. Trade channel revenues totaled $344 million in FY22, up year-over-year after growth in FY21 as well; the 10-K attributes the growth &lt;a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/866729/000086672922000017/schl-20220531.htm\"&gt;to previously published titles&lt;/a&gt; as “demand for the Company’s best-selling series remained strong.” Scholastic Entertainment is having some success, with a live-action &lt;em&gt;Clifford&lt;/em&gt; movie, the animated &lt;em&gt;Stillwater&lt;/em&gt; on Apple (AAPL) TV+, and a live-action &lt;em&gt;Goosebumps&lt;/em&gt; going to Disney (DIS) Plus.&lt;/p&gt;\n\n&lt;p&gt;There seem to be ways to find value here. A P-E firm could fund an LBO through cash on the books and a sale-leaseback of the SoHo headquarters. The fairs and clubs businesses, which still throw off cash flow, plus the backlist could fund any remaining debt; Scholastic Entertainment, digital and international efforts (including shipments to English-language schools in Asia) could provide potential growth drivers.&lt;/p&gt;\n\n&lt;p&gt;A leveraged recap might also make some sense. The company could provide liquidity to Lucchese (and/or the Robinson family, depending on how court cases shake out) in return for an end to the dual-class structure.&lt;/p&gt;\n\n&lt;p&gt;To be clear, the point here is not that financial engineering can create value. Rather, it’s that there are now options for the existing value to make its way to minority shareholders. Pre-2021, SCHL could and did look ‘cheap’ on paper, but it didn’t really matter all that much. The company was controlled by a CEO so devoted to the business that (as both the &lt;em&gt;Journal&lt;/em&gt; and &lt;em&gt;Vanity Fair&lt;/em&gt; noted) he met &lt;em&gt;both&lt;/em&gt; of his wives &lt;em&gt;and&lt;/em&gt; a long-term girlfriend there. That CEO was part of a family for whom, as his own brother put it, Scholastic was “more than just a business.”&lt;/p&gt;\n\n&lt;p&gt;At some point soon, however, it seems likely that it will be just a business. And so the question of what that business is worth suddenly becomes much more pressing, and much more interesting.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Valuing Scholastic&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;At Friday’s close of $41.66, Scholastic has an enterprise value of $1.17 billion. That’s a touch under 6x guided EBITDA for FY23 ($195 million-$205 million), guidance that appears to have driven the big post-earnings rally in the stock.&lt;/p&gt;\n\n&lt;p&gt;Peer comparisons here are close to impossible, but 6x EBITDA seems a reasonable multiple, and perhaps a touch cheap. Normalized free cash flow at the midpoint of the guided EBITDA range would be ~$120 million&lt;a href=\"https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually#footnote-3\"&gt;3&lt;/a&gt;, valuing the operating business right at 10x free cash flow.&lt;a href=\"https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually#footnote-4\"&gt;4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;On its face, 10x free cash flow perhaps doesn’t seem that attractive for a book publisher — ostensibly a business that’s a bit of a melting ice cube. But it’s perhaps premature to believe that Scholastic earnings have peaked.&lt;/p&gt;\n\n&lt;p&gt;For one, those earnings certainly haven’t peaked yet. FY20 EBITDA was guided to $160-$170 million after the second quarter, and on the Q3 call (held on Mar. 18, 2020, right as the severity of the pandemic was becoming all too clear) Robinson said the company was ahead of plan. FY23 guidance implies $35 million in dollar growth from that interrupted outlook three years earlier. Admittedly, there were $50 million in permanent cost cuts imposed, but Scholastic also has dealt with the same inflationary issues as so many other U.S. businesses (along with currency impacts on the international business, which accounted for 18% of FY22 revenue).&lt;/p&gt;\n\n&lt;p&gt;Secondly, there are drivers here. As noted, Scholastic Entertainment has projects on the way. The book clubs business has been in decline since before the pandemic, due to secular trends and tax changes. (The 2018 Supreme Court decision that &lt;a href=\"https://www.cnbc.com/2018/06/21/why-amazon-wins-with-supreme-court-sales-tax-ruling.html\"&gt;forced e-commerce retailers to pay sales tax&lt;/a&gt; caught Scholastic in its wake.) But in FY23, Scholastic still only expects its fair count to reach 85% of the pre-pandemic total; revenue per fair in FY22 was above the FY19 level. Full normalcy there provides some incremental growth potential.&lt;/p&gt;\n\n&lt;p&gt;Scholastic’s new curriculum offering is showing success. International markets offer promise. Deferred revenue from digital subscriptions (per the 10-K) rose to nearly $20 million, as Scholastic found a measure of success on that front. Trade has grown for years now.&lt;/p&gt;\n\n&lt;p&gt;Scholastic is guiding for revenue to increase 8% to 10% this fiscal year; that’s not a sustainable long-term rate, but there is a pathway toward something like low-single-digit top-line growth beyond FY23.&lt;/p&gt;\n\n&lt;p&gt;Finally, there’s the question of how well the business is being run at the moment. The coverage of the succession drama also highlighted concerns about talent drain and management capabilities. (Some of the criticisms were aimed at Lucchese herself, most notably in her handling of the digital initiatives. However, there were differing accounts about how much responsibility she had for those efforts. Of course, that’s part of the point: for an effort as important as digital transformation, there shouldn’t be any confusion about whose brief it is.) As with the balance sheet, there is reason to believe that more financially-motivated ownership might do things differently — and better.&lt;/p&gt;\n\n&lt;p&gt;Now, again, the move to $41 from $34 two weeks ago has changed the story. At 10x FY23 free cash flow, the story here can work, but at least as a standalone Scholastic needs to hit guidance and stabilize FCF from there. (My numbers suggest, in that scenario, the stock would be worth about $54, 29% above current levels. My sense, having followed this company since the middle of the last decade, is that kind of scenario is closer to a bull case than a base case.) At $34, that forward multiple drops down to 8x, and there’s much more of a case that a) the market is misreading the business and b) an acquirer can wring out big value in a hurry.&lt;/p&gt;\n\n&lt;p&gt;After Q4, it may be too much to ask for $34 again. (I’d hope for $38, at least getting one turn down in the P/FCF multiple.) Guidance, for now, dispels fears of a near-term decline in earnings. Until that outlook is proven optimistic (and it may well not be), it’s probably enough to keep investor interest — and it’s probably enough to drive some upside — even after the big gains of late. The question is whether “some upside” is the same as “enough upside.”&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.overlookedalpha.com/p/scholastic-some-upside-left-eventually\"&gt;LINK TO ORIGINAL POST&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;As of this writing, the author has no positions in any securities mentioned.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Disclaimer: The information in this article is not and should not be construed as investment advice. Overlooked Alpha is for information, entertainment purposes only. Please see the full disclaimer at overlookedalpha.com.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "w79v8j",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "OverlookedAlpha",
  "discussion_type": null,
  "num_comments": 5,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/w79v8j/analysis_of_scholastic_corp_end_of_an_era/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/w79v8j/analysis_of_scholastic_corp_end_of_an_era/",
  "subreddit_subscribers": 4338541,
  "created_utc": 1658723812,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1658707285,
  "the_new_excerpt": "On Monday June 7, 2021, shares of Scholastic (SCHL) rose 8%. They’d gain another\n4.1% the following day.\n\nThe catalyst for the two-day rally was grim: chief executive officer, M. Richard\nRobinson, Jr., had passed away suddenly over the weekend.\n\nInvestors didn’t bid shares of Scholastic up because…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年6月7日（月）、Scholastic（SCHL）の株価が8％上昇しました。翌日にはさらに4.1％上昇し\n翌日には4.1％上昇した。\n\nこの2日間の上昇のきっかけは、最高経営責任者のM.リチャード・ロビンソンJr.の厳しいものでした。\n週末にCEOのM.リチャード・ロビンソンJr.が急逝したのだ。\n\n投資家がスコラスティック社の株を買い上げなかった理由は......。",
      "title": "スコラスティック社の分析 時代の終わり？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2021年6月7日星期一，学而思（SCHL）的股票上涨了8%。第二天，他们又涨了\n4.1%。\n\n这两天的涨势的催化剂是严峻的：首席执行官M.\nRobinson, Jr.在周末突然去世了。\n\n投资者没有对学而思的股票进行竞价，因为...",
      "title": "对学而思公司的分析 一个时代的结束？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2021年6月7日星期一，學而思（SCHL）的股票上漲了8%。第二天，他們又漲了\n4.1%。\n\n這兩天的漲勢的催化劑是嚴峻的：首席執行官M.\nRobinson, Jr.在週末突然去世了。\n\n投資者沒有對學而思的股票進行競價，因爲...",
      "title": "對學而思公司的分析 一個時代的結束？"
    }
  ],
  "source_updated_at": 1659087948096
}