{
  "author": "pizzaxp",
  "original_created_utc": 1633138926,
  "title": "Anyone self taught & successfully turn a side project into a product?",
  "created_utc": 1633146340,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hoping to hear some insight about peoples experience with CS/coding and how they got to the point where they have the expertise to create such cool projects (sorry if this isn&#39;t an appropriate type of post for this sub). I browse posts on here regularly and am always blown away by what you people make. I&#39;m curious if folks are developers in their day job, or if anyone is self taught? Is it possible to learn and teach yourself enough to really make a robust, secure, and scalable project? I&#39;ve made some small side projects but I never see how to push them into the next stage because things get so complex. I think I also lack confidence because I&#39;m not an actual software engineer in my day job. Do you think it&#39;s necessary to have that type of experience to really create something well enough that it can ultimately be sold to customers?</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/pzlvrh/anyone_self_taught_successfully_turn_a_side/",
  "subreddit": "SideProject",
  "id": "pzlvrh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hoping to hear some insight about peoples experience with CS/coding and how they\ngot to the point where they have the expertise to create such cool projects\n(sorry if this isn't an appropriate type of post for this sub). I browse posts\non here regularly and am always blown away by what you people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんのCS/コーディングの経験や、どのようにしてこのようなクールなプロジェクトを作る専門知識を身につけたのかなど、洞察力に富んだお話を伺いたいと思っています。\nこのようなクールなプロジェクトを作成するための専門知識を持つに至ったのかについての洞察を期待しています。\n(もし、このサブカテゴリにふさわしい投稿でなかったらごめんなさい)。ここの投稿を定期的に見ていますが\n私はここの投稿を定期的に閲覧していますが、皆さんの作品にはいつも驚かされます。",
      "title": "独学でサイドプロジェクトを製品化することに成功した人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "希望能听到一些关于人们的CS/编码经验的见解，以及他们如何\n的经验，以及他们是如何达到拥有专业知识来创造如此酷的项目的地步的。\n(如果这不是一个合适的帖子，请原谅）。) 我经常浏览这里的帖子\n我经常浏览这里的帖子，并且总是被你们这些人的作品所震撼...",
      "title": "有没有人自学成才，并成功地将一个副业变成产品？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "希望能聽到一些關於人們的CS/編碼經驗的見解，以及他們如何\n的經驗，以及他們是如何達到擁有專業知識來創造如此酷的項目的地步的。\n(如果這不是一個合適的帖子，請原諒）。) 我經常瀏覽這裏的帖子\n我經常瀏覽這裏的帖子，並且總是被你們這些人的作品所震撼...",
      "title": "有沒有人自學成才，併成功地將一個副業變成產品？"
    }
  ]
}