{
  "author": "CommunityPoints",
  "the_new_excerpt": "UPDATE (4/14): A bonus for voting in governance polls has been implemented\nstarting with this distribution, following the successful passing of this\nproposal\n[https://www.reddit.com/r/CryptoCurrency/comments/m7ehzz/proposal_5_bonus_moons_for_anyone_who_votes_on/_].\n\nKarma/Moons ratio: Each 1 point…",
  "original_created_utc": 1618434650,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "UPDATE(4/14)を行いました。ガバナンス投票に投票するとボーナスがもらえるようになりました。\n今回の配信から実施しました。\n提案\n[https://www.reddit.com/r/CryptoCurrency/comments/m7ehzz/proposal_5_bonus_moons_for_anyone_who_votes_on/_].\n\nカルマ/ムーンの比率。各1ポイント...",
      "title": "ニュームーン配信（ラウンド12提案"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "更新（4/14）。在治理调查中投票的奖金已经实施。\n从本次发行开始，在成功通过本次\n建议\n[https://www.reddit.com/r/CryptoCurrency/comments/m7ehzz/proposal_5_bonus_moons_for_anyone_who_votes_on/_]。\n\n因果报应/月亮的比率。每1分...",
      "title": "新月分布(第12轮提案)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "更新（4/14）。在治理調查中投票的獎金已經實施。\n從本次發行開始，在成功通過本次\n建議\n[https://www.reddit.com/r/CryptoCurrency/comments/m7ehzz/proposal_5_bonus_moons_for_anyone_who_votes_on/_]。\n\n因果報應/月亮的比率。每1分...",
      "title": "新月分佈(第12輪提案)"
    }
  ],
  "title": "New Moons Distribution (Round 12 Proposal)",
  "created_utc": 1618486890,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>UPDATE (4/14): A bonus for voting in governance polls has been implemented starting with this distribution, following the successful passing of <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/m7ehzz/proposal_5_bonus_moons_for_anyone_who_votes_on/_\">this proposal</a>. </p>\n\n<p>Karma/Moons ratio: Each 1 point of karma in this round corresponds to 0.88 Moons.</p>\n\n<p>***</p>\n\n<p>Moons are <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>&#39;s version of Community Points. <a href=\"https://reddit.com/community-points\">Community Points</a> are a way for users to be rewarded for their contributions to the subreddit, and they can be used on premium features in the community.</p>\n\n<p>Moons are distributed every 4 weeks based on contributions people make to <a href=\"/r/CryptoCurrency\">r/CryptoCurrency</a>. For every distribution, Reddit publishes karma data as a default measure of contribution. The community can review the data and optionally propose an alternative distribution, if they wish.</p>\n\n<p>This distribution is based on karma earned from 2021-03-17 to 2021-04-13. <a href=\"https://reddit-meta-production.s3.amazonaws.com/distribution/publish/CryptoCurrency/round_12_proposed.csv\">Here is the data.</a></p>\n\n<p>To propose an alternative distribution:</p>\n\n<ul>\n<li>You can create a CSV with alternative contribution scores or propose changes to the algorithm used to calculate them from karma (as long as the changes can be implemented easily).</li>\n<li>The amount of Moons distributed to a user will be proportional to their contribution score. Contribution scores cannot be negative.</li>\n<li>Make a poll to have the community vote on your proposal. Include an accurate description of the changes you are proposing.</li>\n<li>In order to pass, the winning option in the poll must meet the decision threshold (minimum number of Moons in support). If it is in favor of the change, it becomes the official contribution measurement (unless there is evidence of abuse in the vote, such as bribery). Algorithm changes will carry forward to future distributions.</li>\n<li>In case of multiple competing polls passing, the one with the most Moons cast in favor will be the official one.</li>\n<li>If no alternative passes, the data provided here will become official.</li>\n</ul>\n\n<p>The contribution scores for this round will be finalized on 2021-04-21. Any poll proposing an alternative needs to be completed by then.</p>\n\n<p>After the scores are finalized, Reddit will sign the data and publish the final, official data. After that, people will be able to claim their Moons through the Vault in the Reddit mobile app.</p>\n</div><!-- SC_ON -->",
  "score": 1653,
  "permalink": "/r/CryptoCurrency/comments/mr04qf/new_moons_distribution_round_12_proposal/",
  "subreddit": "CryptoCurrency",
  "id": "mr04qf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171517788
}