{
  "author": "Potentillapink",
  "original_created_utc": 1645924940,
  "title": "Why can't we show the same amount of concern for yemen and the uyghurs?",
  "created_utc": 1645932954,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t get me wrong I&amp;#39;m very concerned about what is happening in the Ukrain and what it&amp;#39;s effect will be for the world order. But there has been war and human suffering in Yemen for years and the world doesn&amp;#39;t really seem to care. There is a genocide going on in China on the Uyghur people and we&amp;#39;re celebrating the olympics there. And of course there are many more examples. &lt;/p&gt;\n\n&lt;p&gt;Do we only care about people that look like us (western europe &amp;amp; US)?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/t2ceub/why_cant_we_show_the_same_amount_of_concern_for/",
  "subreddit": "TooAfraidToAsk",
  "id": "t2ceub",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Don't get me wrong I'm very concerned about what is happening in the Ukrain and\nwhat it's effect will be for the world order. But there has been war and human\nsuffering in Yemen for years and the world doesn't really seem to care. There is\na genocide going on in China on the Uyghur people and we're…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誤解しないでほしいのですが、私はウクライナで起きていることをとても心配しています。\n世界秩序にどのような影響を及ぼすか。しかし、戦争があり、人々が\nイエメンでは何年も苦しんでいるのに、世界はそれを気にしていないようだ。そこには\n中国ではウイグル族の大虐殺が行われているのに、私たちは......。",
      "title": "なぜイエメンやウイグルに同じだけの関心を示さないのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要误会我的意思，我非常关注乌克兰发生的事情，以及它对世界秩序的影响。\n它对世界秩序将产生什么影响。但是，也门的战争和人类苦难已经持续了多年。\n但也门的战争和人类痛苦已经持续多年，世界似乎并不关心。这里有\n中国正在对维吾尔族人进行种族灭绝，而我们...",
      "title": "为什么我们不能对也门和维吾尔人表现出同样的关注？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要誤會我的意思，我非常關注烏克蘭發生的事情，以及它對世界秩序的影響。\n它對世界秩序將產生什麼影響。但是，也門的戰爭和人類苦難已經持續了多年。\n但也門的戰爭和人類痛苦已經持續多年，世界似乎並不關心。這裏有\n中國正在對維吾爾族人進行種族滅絕，而我們...",
      "title": "爲什麼我們不能對也門和維吾爾人表現出同樣的關注？"
    }
  ]
}