{
  "author": "afriendlystone",
  "original_created_utc": 1634519962,
  "title": "The moment I see \"community driven\" as a main point in a crypto advertisement or a project I feel like I want to puke.",
  "created_utc": 1634546641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>During the last year or so, I&#39;ve noticed how &quot;community driven&quot; became such a baseless buzzword it might just become a synonym for rugpull. I&#39;ve seen lots of projects on the binance scam chain that try to sell you a place in their community, &quot;buy our token join our community&quot; meanwhile their token does jackshit and its only use is to be traded, no utility or problem solving, just buy and hold it&#39;ll moon when It becomes popular.</p>\n\n<p>But you see, the problem is that it happened once or twice, a token without any actual use mooned and people think it&#39;ll it&#39;ll happen again to their community.</p>\n\n<p>Hype will only get you so far, a token needs actual use to survive in the long term.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/qac89i/the_moment_i_see_community_driven_as_a_main_point/",
  "subreddit": "CryptoCurrency",
  "id": "qac89i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "During the last year or so, I've noticed how \"community driven\" became such a\nbaseless buzzword it might just become a synonym for rugpull. I've seen lots of\nprojects on the binance scam chain that try to sell you a place in their\ncommunity, \"buy our token join our community\" meanwhile their token…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この1年ほどの間に、「コミュニティ・ドリブン」という言葉が、根拠のないバズワードになってしまったことに気づきました。\n根拠のないバズワードになってしまいました。私は多くの\nbinanceのスキャムチェーンでは、「私たちのトークンを買って、コミュニティに参加してください」と、コミュニティの場所を売ろうとするプロジェクトをたくさん見てきました。\nトークンを購入してコミュニティに参加してください」と言って、そのトークンを...",
      "title": "暗号の広告やプロジェクトで、「コミュニティ主導」がポイントになっているのを見た瞬間、吐き気がします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去一年左右的时间里，我注意到 \"社区驱动 \"是如何成为这样一个毫无根据的流行语的。\n毫无根据的流行语，它可能只是成为一个地毯式的同义词。我已经看到很多\n骗局链上的许多项目，试图向你推销他们的社区。\n同时，他们的代币...",
      "title": "当我看到 \"社区驱动 \"作为加密货币广告或项目的要点时，我觉得我想呕吐。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去一年左右的時間裏，我注意到 \"社區驅動 \"是如何成爲這樣一個毫無根據的流行語的。\n毫無根據的流行語，它可能只是成爲一個地毯式的同義詞。我已經看到很多\n騙局鏈上的許多項目，試圖向你推銷他們的社區。\n同時，他們的代幣...",
      "title": "當我看到 \"社區驅動 \"作爲加密貨幣廣告或項目的要點時，我覺得我想嘔吐。"
    }
  ]
}