{
  "author": "SeaworthinessWorth99",
  "the_new_excerpt": "Palladium is what's in your catalytic converter. It is so precious, that in a\nlot of 3rd world counties they remove the converters from their vehicles to sell\nthe Palladium. It was an interesting car rental experience in Belize a few years\nback...\n\nPalladium is pretty rare and pretty much only…",
  "original_created_utc": 1613965884,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "钯是你催化器里的东西。它是如此珍贵，以至于在\n很多第三世界国家，他们从他们的车辆上拆下转换器来卖。\n的Palladium。这是一个有趣的汽车租赁经验，在伯利兹的几年\n回...\n\n钯金是相当罕见的，几乎只...",
      "title": "钯金：同时玩转通胀、弱势美元和绿色科技。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鈀是你催化器裏的東西。它是如此珍貴，以至於在\n很多第三世界國家，他們從他們的車輛上拆下轉換器來賣。\n的Palladium。這是一個有趣的汽車租賃經驗，在伯利茲的幾年\n回...\n\n鈀金是相當罕見的，幾乎只...",
      "title": "鈀金：同時玩轉通脹、弱勢美元和綠色科技。"
    }
  ],
  "title": "Palladium: play inflation, weak dollar, and green tech all at once",
  "created_utc": 1613999144,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Palladium is what&#39;s in your catalytic converter. It is so precious, that in a lot of 3rd world counties they remove the converters from their vehicles to sell the Palladium. It was an interesting car rental experience in  Belize a few years back...</p>\n\n<p>Palladium  is pretty rare and pretty much only produced in Russia and S. Africa  while main consumers are US and China. We can imagine how well that can  end up.<br/>\n<a href=\"https://www.statista.com/statistics/273647/global-mine-production-of-palladium/\">https://www.statista.com/statistics/273647/global-mine-production-of-palladium/</a></p>\n\n<p>From an emerging technology perspective, it has a variety of application which are all summarized nicely in this review paper:<br/>\n<a href=\"https://pubs.acs.org/doi/10.1021/acs.chemrev.5b00324\">https://pubs.acs.org/doi/10.1021/acs.chemrev.5b00324</a></p>\n\n<p>If  inorganic chemistry bores you, just look at the picture in the  abstract. Pd is useful for a lot of stuff, present and future. The main  competitor to Palladium is Platinum and currently Palladium is less  expensive but that may change in the future as the demand for it  outgrows supply.</p>\n\n<p>Another fun fact,  other than the noble metals (Silver, Gold, Platinum), Palladium jewelry  has to get a purity stamp: 500, 950, or 999 <a href=\"https://www.jewelryshoppingguide.com/palladium-rings-guide/\">https://www.jewelryshoppingguide.com/palladium-rings-guide/</a></p>\n\n<p>There are a couple of ways to participate in Palladium:</p>\n\n<ol>\n<li>PALL ETF : <a href=\"https://etfdb.com/etf/PALL/#etf-ticker-profile\">https://etfdb.com/etf/PALL/#etf-ticker-profile</a></li>\n<li>Futures: <a href=\"https://www.cmegroup.com/trading/metals/precious/palladium.html\">https://www.cmegroup.com/trading/metals/precious/palladium.html</a></li>\n<li>bars/coins: <a href=\"https://bullionexchanges.com/buy-palladium\">https://bullionexchanges.com/buy-palladium</a></li>\n<li>The fun way: jewelry - if I buy it, might as well wear it</li>\n</ol>\n\n<p>Reservations:</p>\n\n<p>If the dollar starts to rally and we enter a new cycle, all precious metals will go down.</p>\n\n<p>Looking  at the chart of Palladium I can tell that this is obviously this is not  an original idea and it has been in a steady upward trend since  mid-2018 so it does have further to go down today than 3 years ago  should the demand diminish or we avoid inflation. <a href=\"https://seekingalpha.com/symbol/PALL/chart\">https://seekingalpha.com/symbol/PALL/chart</a></p>\n\n<p>I  have no position open today but looking into it after seeing the market  reaction to Powell this week. I&#39;ve been wanting to get some Gold in my  otherwise very tech-heavy portfolio but I think Palladium may be safer  since it a key metal for current and future carbon footprint reduction  tech.</p>\n</div><!-- SC_ON -->",
  "score": 92,
  "permalink": "/r/investing/comments/lpee2r/palladium_play_inflation_weak_dollar_and_green/",
  "subreddit": "investing",
  "id": "lpee2r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332881990
}