{
  "author": "AwkwardPerson1012",
  "original_created_utc": 1633031079,
  "title": "Why is \"why are you so quiet\" such a socially acceptable question to ask, regardless of how awkward it is?",
  "created_utc": 1633050754,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a quiet, shy introvert, I&#39;ve gotten this question a LOT growing up, since some of my earliest memories. And I still get the question occasionally at 20 years old. </p>\n\n<p>I never really liked this question, because I never quite knew how to explain why I was so quiet, and the times I was even more quiet than usual even by my own standards, it was a really personal reason like Major Depressive Disorder that I wouldn&#39;t really discuss with someone I barely knew. </p>\n\n<p>The question to me always felt like &quot;why are you the way you are,&quot; and that&#39;s just not something I know how to answer. </p>\n\n<p>My answer itself was also always awkward. &quot;Uh...I don&#39;t know? Because I want to I guess?&quot; </p>\n\n<p>And I can&#39;t help but wonder why such a awkward question is so socially acceptable.</p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/NoStupidQuestions/comments/pyratq/why_is_why_are_you_so_quiet_such_a_socially/",
  "subreddit": "NoStupidQuestions",
  "id": "pyratq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a quiet, shy introvert, I've gotten this question a LOT growing up, since\nsome of my earliest memories. And I still get the question occasionally at 20\nyears old.\n\nI never really liked this question, because I never quite knew how to explain\nwhy I was so quiet, and the times I was even more quiet…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "物静かで内向的な私は、幼少期からよくこの質問を受けました。\n私の最も古い記憶の一部です。そして、20歳になった今でも、時々その質問を受けることがあります。\n歳。\n\n私はこの質問があまり好きではありませんでした。\nなぜそんなに無口なのか、さらに無口な時期があったのか...。",
      "title": "なぜ「どうしてそんなに静かなの？」という質問は、それがどんなに気まずいことであっても、社会的に受け入れられるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个安静、害羞的内向者，我在成长过程中经常遇到这个问题。\n在我最早的一些记忆中，我就经常被问到这个问题。在我20岁的时候，我仍然偶尔会收到这个问题。\n岁的我仍然偶尔会被问到这个问题。\n\n我从来没有真正喜欢过这个问题，因为我从来不知道如何解释\n为什么我这么安静，而在我更安静的时候......",
      "title": "为什么 \"你为什么这么安静 \"是一个社会上可以接受的问题，不管它有多尴尬？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個安靜、害羞的內向者，我在成長過程中經常遇到這個問題。\n在我最早的一些記憶中，我就經常被問到這個問題。在我20歲的時候，我仍然偶爾會收到這個問題。\n歲的我仍然偶爾會被問到這個問題。\n\n我從來沒有真正喜歡過這個問題，因爲我從來不知道如何解釋\n爲什麼我這麼安靜，而在我更安靜的時候......",
      "title": "爲什麼 \"你爲什麼這麼安靜 \"是一個社會上可以接受的問題，不管它有多尷尬？"
    }
  ]
}