{
  "author": "fakemuseum",
  "original_created_utc": 1654504040,
  "title": "How can we take crypto market seriously when a shitcoin like TRON is the top 15?",
  "created_utc": 1654520950,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sol is in the top 10, Tron is the top 15, SHIB is in the top 20 and to be honest at the current stage, 99% of coins in the market has no real utility or intrinsic value. What they can do is swapping a shitcoin for another shitcoin or staking to gain more shitcoins. How crypto market isn’t just a large online betting site when everything gain value from short time speculation and manipulation. When the price hasn&amp;#39;t really been correlated with the quality of the product. It&amp;#39;s just all the hype. Many crypto holders have not even transferred their coins out of an exchange ever.&lt;/p&gt;\n\n&lt;p&gt;TBH, the longer I’m in the crypto market the less I&amp;#39;m leaning toward crypto and the more I lost hope in the community. Aren’t this community consisted of a bunch of greedy, naive, clueless people and a few scam artists who will get rich.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 402,
  "permalink": "/r/CryptoCurrency/comments/v5y27v/how_can_we_take_crypto_market_seriously_when_a/",
  "subreddit": "CryptoCurrency",
  "id": "v5y27v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sol is in the top 10, Tron is the top 15, SHIB is in the top 20 and to be honest\nat the current stage, 99% of coins in the market has no real utility or\nintrinsic value. What they can do is swapping a shitcoin for another shitcoin or\nstaking to gain more shitcoins. How crypto market isn’t just a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Solはトップ10、Tronはトップ15、SHIBはトップ20と、正直なところ現段階では\n現段階では、市場に出回っているコインの99%に真の実用性や本質的な価値はありません。\n正直なところ、現段階では市場に出回っているコインの99%に真の実用性や本質的な価値はありません。彼らができることは、クソコインを別のクソコインに交換したり\nより多くのクソコインを得るためのステーキングです。暗号化市場は単なる...",
      "title": "TRONのようなクソコインがトップ15にいるのだから、暗号市場を真面目に考えるわけがない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Sol是前10名，Tron是前15名，SHIB是前20名，说实话\n说实话，在目前阶段，市场上99%的硬币都没有真正的效用或\n本质价值。他们能做的就是用一个狗屎币换取另一个狗屎币，或\n赌注来获得更多的狗屎币。加密货币市场如何不仅仅是一个...",
      "title": "当TRON这样的烂币进入前15名时，我们怎么能认真对待加密货币市场？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Sol是前10名，Tron是前15名，SHIB是前20名，說實話\n說實話，在目前階段，市場上99%的硬幣都沒有真正的效用或\n本質價值。他們能做的就是用一個狗屎幣換取另一個狗屎幣，或\n賭注來獲得更多的狗屎幣。加密貨幣市場如何不僅僅是一個...",
      "title": "當TRON這樣的爛幣進入前15名時，我們怎麼能認真對待加密貨幣市場？"
    }
  ]
}