{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Good Friday evening to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning September 20th, 2021.\n\n# **As stocks enter volatile period, the Fed will attempt to not rock the boat further in the week ahead - [(Source)](https://www.cnbc.com/2021/09/17/as-stocks-enter-volatile-period-the-fed-will-attempt-to-not-rock-the-boat-further-in-the-week-ahead.html)**\n*****\n> The Federal Reserve’s much-anticipated meeting next week may not be quite as exciting for markets as some investors had been expecting in the usual choppy month of September.\n*****\n> The meeting is the highlight of the coming week, traditionally a negative time for stocks. Stocks were slightly lower in the past week, with the exception of the small-cap Russell 2000, which ended the week up 0.4%.\n*****\n> Central bank officials begin meeting Tuesday, and end their two-day session with an announcement Wednesday afternoon. That will be followed by a press briefing with Fed Chairman Jerome Powell.\n*****\n> The economic calendar is light, and there is mostly housing data. Starts and permits data are slated for Tuesday, existing home sales numbers are set for Wednesday, with new home sales figures coming out Friday. A handful of companies are reporting earnings, including Costco Wholesale, FedEx and Nike.\n*****\n> The Fed’s meeting may not be as eventful as investors once expected. The central bank’s move away from its bond-buying program has been expected by some strategists to cause turbulence for stocks. But the Fed is likely to only discuss tapering at the upcoming meeting and, at most, signal it could slow the bond purchases later in the year.\n*****\n> “They’ve been very clear in my view on the guidance on tapering. I think they get an ‘A plus’ on communicating their intentions around the balance sheet,” Bank of America head of U.S. economics Michelle Meyer said. “They said they want to take baby steps and they have.” She expects an announcement in November and the actual cut in bond purchases to start before year-end.\n*****\n> The unwinding of the $120 billion a month bond buying program is important since it would be the first major move away from the extraordinary policies the Fed used to fight the pandemic. It also takes the Fed a step closer to interest rate hikes.\n*****\n> # Debt ceiling risk\n> “Everybody’s been calling for a correction, and it’s always hard to see what the catalyst could be. The catalysts for a correction right now are as clear as they’ve been all year long,” Morgan Stanley Investment Management head of global macro strategy Jim Caron said.\n*****\n> For now, Caron sees the Fed’s communications in the week ahead as less of a risk for markets than other simmering issues, like the debt ceiling, the potential for more taxes and uncertainty surrounding the White House’s infrastructure bill.\n*****\n> Congress has until sometime in October to extend the debt ceiling before the government runs out of funds and defaults. Political rhetoric around raising the debt limit, which would allow Treasury to issue more debt, has been building. The White House warned Friday the economy could enter a recession if Congress fails to act.\n*****\n> “I think the Fed wants to stay out of the fight at this point. There’s just too much ambiguity,” Caron said. “They’re not going to announce tapering. Their statement is going to be carefully worded. The bar is really high for them to say anything hawkish right now. Between now and the next meeting, we should have a pretty good idea about the debt ceiling and where the infrastructure stands.”\n*****\n> # What the Fed could do\nThe odds for a September tapering announcement from the Fed fell sharply after August’s softer than expected employment report showed just 235,000 jobs were created, about 500,000 less than expected.\n*****\n> Economists now mostly expect a November announcement, but the September meeting could be important for what else the Fed says.\n*****\n> The quarterly forecasts of Fed officials are released along with the 2 p.m. statement Wednesday. They include new economic projections and an updated interest rate forecast.\n*****\n> https://i.imgur.com/vV59aJ6.png\n*****\n> “I don’t think they want to say anything that’s slightly hawkish, but the dot plot could come out that way,” Caron said. The so-called dot plot is the Fed’s interest rate forecast, which is the anonymous interest rate targets of Fed officials presented in a chart format.\n*****\n> Some Fed watchers expect the central bank to move its interest rate forecast forward slightly. In June, the dot plot showed two rate hikes for 2023 and none for 2022.\n*****\n> “They are two Fed officials from having a half a hike and they are three Fed officials from getting a full hike penciled in” for 2022, Bank of America’s Meyer said. “I think the dots will show the first hike is in 2023, but it is possible that shifts. ... I think if it shifts, the problem the Fed will have is to communicate the difference.”\n*****\n> Meyer said Powell has emphasized the asset purchase program’s unwinding is not linked to the Fed’s move to raise interest rates from the current near-zero level. If the interest rate forecast moves forward, it could suggest to the market that the Fed will wind down its bond program and immediately move on to a rate hike. The bond program is slowly expected to be unwound over the course of six months or more.\n*****\n> # September slump\n> The major indexes ended the past week with slight losses. The S&P 500 was down 0.6% for the week, closing Friday’s session at 4,432.99. The Dow lost 0.1% for the week. The Nasdaq Composite dropped nearly 0.5% for the week to 15,043.97. The 10-year Treasury yield was higher on the week, at 1.37%.\n*****\n> https://i.imgur.com/u10YCtQ.png\n*****\n> September as a whole has been weak for the stock market, with the S&P 500 down just under 2%.\n*****\n> J.P. Morgan technical strategists, however, do not see the big downdraft expected by some analysts.\n*****\n> They note the S&P 500 has held above 4,420 to 4,435 trend support levels and another key level of 4,367.\n*****\n> “As a base-case view, we believe the index holds that support and rallies in the fourth quarter. Even if the market breaks support and sees a near-term increase in realized volatility, we continue to think the 4238-4257 summer-time breakout area will put a floor under the index,” the strategists wrote.\n*****\n> # Earnings\nInvestors continue to watch for earnings warnings ahead of the third-quarter reporting season, which starts in mid-October. The concern is that supply chain risks will continue to crimp revenues and could hurt margins.\n*****\n> There are a few companies reporting in the week ahead, and they should comment on supply chains and rising costs. FedEx reports Tuesday; General Mills releases earnings Wednesday, and both Nike and Costco report Thursday.\n*****\n> Nike is being watched closely since it is expected that supply chain issues will hurt its profits and it could continue to have issues getting products to sell.\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/sJpYrsO.png))**\n\n# **S&P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/kHC57jC.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/Jhg9Dfb.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/Dh0h1Mt.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/X7wvTsI.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/A4RGdGJ.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ywQxa0R.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BBeiemF.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jvPSRuj.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/HZPu8q6.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/x9TOf99.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/vbkHbv9.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/ic3kYSn.png))**\n\n*****\n\n> # S&P 500 down 25 of 31 during week after September quarterly options expiration, average loss 0.94%\n\n> The week after September options expiration week, next week, has a dreadful history of declines most notably since 1990. The week after September quarterly options expiration week has been a nearly constant source of pain with only a few meaningful exceptions over the past 31 years. Substantial and across the board gains have occurred just four times: 1998, 2001, 2010 and 2016 while many more weeks were hit with sizable losses.\n\n> Full stats are in the above sea-of-red table. Average losses since 1990 are even worse; DJIA –1.03%, S&P 500 –0.94%, NASDAQ –0.88% and a sizable –1.50% for Russell 2000. End-of-Q3 portfolio restructuring is the most likely explanation for this trend as managers trim summer holdings and position for the fourth quarter.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/73877a7ce2dd016092de48a698ee4325/6e49ca6ca6aaa30d-13/s640x960/b5dfb5d72d2a68a0e564f8058c1c1bb06f021569.jpg))**\n\n*****\n\n> # Mid-Pack Performance for Post-Election Year Octobers\n\n> October often evokes fear on Wall Street as memories are stirred of crashes in 1929, 1987, the 554-point drop on October 27, 1997, back-to-back massacres in 1978 and 1979, Friday the 13th in 1989 and the 733-point drop on October 15, 2008. During the week ending October 10, 2008, Dow lost 1,874.19 points (18.2%), the worst weekly decline in our database going back to 1901, in percentage terms. March 2020 now holds the dubious honor of producing the worst, second and third worst DJIA weekly point declines. The term “Octoberphobia” has been used to describe the phenomenon of major market drops occurring during the month. Market calamities can become a self-fulfilling prophecy, so stay on the lookout and don’t get whipsawed if it happens.\n\n> Post-election year October’s are neither great nor bad since 1953, ranking mid-pack across DJIA, S&P 500, NASDAQ and Russell 1000 with gains averaging from 0.9% (DJIA & Russell 1000) to 1.4% (NASDAQ). DJIA has the best historical odds for gains having advanced in 12 of the last 17 post-election year Octobers. Despite the best average gain, NASDAQ actually has the worst record, declining in 6 of the last 12 post-election year Octobers. A 12.8% gain in 2001 boosts its average. Should a meaningful decline materialize in October it is likely to be an excellent buying opportunity, especially for any depressed technology and small-cap shares.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/7b16d8538635e224e9dc0b463c463ad1/9a8b32d0e45e4452-1e/s400x600/bc35b08a598f01d93a41d4340454f6d62868fa37.jpg))**\n\n*****\n\n> # Buy Yom Kippur, Sell Passover\n\n> Happy Jewish New Year 5782! May it be a sweet year for you all! As we informed you early this month the market tends to exhibit weakness during the Jewish High Holy days from Rosh Hashanah to Yom Kippur. Perhaps it is the market’s annual repentance for its own sins that drives the market lower over the years during the ten days of repentance or the days of awe as they are often referred. This trade ends tomorrow on Yom Kippur, September 16, but as of today’s close DJIA is down about 0.8% from the close on Rosh Hashanah.\n\n> We attribute this perennial pullback to the fact that market liquidity drops as many market participants step away from the market and likely square positions ahead of these ten days. These days of awe also land during the seasonally weak end of Q3/beginning of Q4 period as fund managers restructure portfolios and prepare for the October 31 mutual fund deadline. This has made September the worst month of the year and contributed to the phenomenon of Octoberphobia.\n\n> But there is a flipside to this trade. Buy Yom Kippur, Sell Passover. This has an even greater accuracy ratio than Sell Rosh Hashanah, Buy Yom Kippur up 72% of the time with average gains of 7%. And as I am sure our followers will realize this trade get a big boost from seasonal market strength during Q4 and Q1 and of course the Best Six Months of the Year November-April.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/50b4365b474dfe16373b2a7c4d27a4b2/a22228be383f50d1-d4/s500x750/f841ea12115829e47e743699ec795db2d4a0ca56.jpg))**\n\n*****\n\n> # Insurance Suddenly a Concern For Small Businesses\n\n> In addition to the various indices regarding small business conditions, the NFIB also surveys firms on what they see as their most pressing issue. In August, by far the most common issue among respondents was labor-related. A record 28% reported quality of labor as the biggest issue; up 2 percentage points versus July. Another 8% reported cost of labor as their biggest issue which was slightly lower than July. On a combined basis, the 36% reporting either cost or quality of labor as their biggest issue was the joint highest reading on record; tying August and November 2019.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Table.png))**\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Labor.png))**\n\n> Especially over the past several election cycles, the results of the NFIB survey have tended to be impacted by politics. For example, over the past few presidencies, when a Republican is in office there has been a lower percentage of respondents reporting either taxes or government red tap as their biggest issue and vice versa when a Democrat is in office. That combined reading has now completely reversed the uptick following the election of President Biden as labor concerns have increasingly come into focus.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Gv.png))**\n\n> While government-related problems are still the second biggest concern(s) on a combined basis, there have been some other notable moves this month. The percentage of respondents reporting inflation as their biggest issue rose back up to the pandemic high of 13% this month. The Great Recession was the only other period that has seen as elevated a share of respondents seeing price increases as their biggest issue. Additionally, that excludes those reporting cost of labor as an issue.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Infl.png))**\n\n> As for what the rise in Inflation as a problem may have borrowed from, one of the most notable has been competition from big business. The reading has seen a gradual decline since the end of 2019, and now at only 5%, it is tied with several months between September 2009 and September 2013 for the lowest reading on record.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Big-Biz.png))**\n\n*****\n\n> # Why Evergrande Isn’t The Next Lehman\n\n> Chinese property developer Evergrande’s liquidity crisis has sparked fear and massive selling in Chinese property stocks over the past several weeks. The big question is could this be the first domino to fall, sparking a systemic risk scenario, similar to when Lehman Brothers went under 13 years ago this week? The good news is we don’t think so, but we’ll get to that later.\n\n> With more than $300 billion in liabilities and only $15 billion in cash on hand, Evergrande is currently the world’s most indebted real estate developer. Worries are mounting that starting next week it won’t be able to pay $84 billion of interest due (according to Bloomberg), along with potentially missing a principal payment on at least one of its loans.\n\n> With Evergrande’s share price down more than 80% this year, investors are clearly voting with their pocketbooks, while the chart below shows the pressure its dollar bonds have been under as well, at deeply distressed levels to the tune of 28 cents on the dollar recently.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.17.21-Blog-Chart-1.png?ssl=1))**\n\n> Multiple downgrades have happened the past two weeks, and some rating agencies are noting that an outright default is probable. Should this happen, what could the fallout be? With 1,300 real estate projects in 280 cities in China, could China’s communist government intervene to avoid a messy default? So far that answer has been a resounding no, with the company instead looking to banks and other creditors to help the impact of a default.\n\n> The bad news keeps coming, as yesterday, Evergrande suspended trading of it’s onshore corporate bonds, after yet another downgrade, taking it one step closer to restructuring or default. So is Evergrande China’s version of Lehman Brothers? Here are three reasons we don’t think so.\n\n> * First, the dollar bonds will likely get restructured, but most of the debt is in global mutual funds, ETFs, and some Chinese companies and not banks or other important financial institutions. Remember, Lehman Brothers was held on nearly all other financial institution’s books, so not nearly as many institutions will be impacted by this versus Lehman.\n> * Secondly, we think the odds do favor the Chinese communist government will get involved should there be a default. They are holding out as of now, but the fallout could be too great for them to avoid intervening.\n> * Finally, Evergrande has tangible assets that can be sold off to settle financial obligations. Their assets aren’t great and creditors know that the company is in financial trouble , so the value of its assets aren’t likely worth as much as they think but it will still help settle some debts. Remember, Lehman didn’t have hard assets it could sell off whereas Evergrande does.\n\n> “Although the impact from Evergrande’s liquidity crisis is enormous, the good news is the fallout hasn’t started to spillover to other markets,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Short-term funding markets are acting just fine in China thus far; remember, it was the money markets in the U.S. that first started to show cracks in the system in early 2008, well before the wheels fell off.”\n\n> As shown in the LPL Chart of the Day, China’s money markets aren’t showing any signs of systemic risk. These tend to be the canary in the coal mine, and the fallout appears to be fairly contained as of now.\n\n> LPL Research downgraded our view on emerging markets to negative from neutral last month, due to concerns over China’s regulatory crackdowns and heightened political risk. Now with Evergrande’s liquidity crisis in the mix, we continue to recommend an underweight to emerging markets in portfolios.\n\n> This is a very fluid situation and one that could clearly change on a dime. Although the Chinese communist government has avoided helping Evergrande so far, we think the odds do favor some type of eventual bailout to limit the ripple effect from a potential default. We will continue to watch the action in the short-term lending markets for clues if this is spiraling into something larger.\n\n*****\n\n> # Retail Sales Surprise To The Upside\n\n> U.S. consumers shocked economists in August with their willingness to spend in the face of recent jitters over the economic outlook.\n\n> This morning, the U.S. Census Bureau released August retail sales data showing overall retail sales grew 0.7% month-over-month vs. a consensus forecast for a 0.7% drop, while retail sales ex autos and gas rose 2% month-over-month vs. a consensus forecast for no change. Auto sales remained under pressure because of supply chain bottlenecks and higher prices, accounting for the large gulf in the numbers. The big beats come on the heels of disappointing July data, which received additional negative revisions, taking a small bit of the shine off August’s numbers.\n\n> Nonetheless, the spending resilience shown in this report is receiving an overwhelmingly early positive response, as economic releases in recent weeks have generally been surprising to the downside. COVID-19’s resurgence in recent months is surely to blame for a significant portion of the lowered expectations, but consumers have also been forced to contend with rising prices, severe weather events, lukewarm payroll gains, and cuts to enhanced unemployment benefits.\n\n> “There have been several reasons to question the consumer outlook recently,” explained LPL Financial Chief Market Strategist Ryan Detrick. “And yet, the old mantra ‘never bet against the U.S. consumer’ continues to ring true. This has been a volatile series of late, but we look for the consumer to continue powering this economy well into the future.”\n\n> As seen in the LPL Chart of the Day, retail sales ticked significantly higher in August following a difficult July.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.16.21-Blog-Chart-2.png?ssl=1))**\n\n> The familiar theme of goods over services consumption seen during prior virus flare-ups is evident in this report, as well as a back-to-school boost. General merchandise stores (3.5%) and nonstore (online) retailers (5.3%) showed large monthly boosts, reversing a disappointing July. In addition, furniture and home furnishing stores rose nicely (3.7%). Meanwhile, food services and drinking places (0.0%), an in-person segment most impacted by virus caution, held steady against forecasts for a decline, while volatile electronics and appliance stores (-3.1%) showed weakness.\n\n> We continue to believe that successfully tackling Delta could set up a fourth quarter growth rebound despite many strategists increasingly turning sour on the second half of the year. Cases from this latest COVID-19 wave are starting to decline, and plentiful job openings and impressive wage gains data should prevent a major income shortfall resulting from the expiration of enhanced unemployment benefits. Consumers also still have elevated excess savings relative to history—in the neighborhood of $2 trillion. We continue to look for a resilient consumer, as well as for services spending to play catch-up vs. goods spending in coming months.\n\n*****\n\n> # Inflation Shows Signs Of Moderating\n\n> After a crazy summer of nosebleed inflation readings, we may finally be starting to see signs of transitory inflation.\n\n> The Bureau of Labor Statistics released the August Consumer Price Index (CPI) data this morning, which came in softer than expected. Headline CPI climbed 0.3% month-over-month vs. estimates of 0.4%, while core CPI jumped only 0.1% month-over-month vs. estimates of 0.3%. Base effects from rolling off weak numbers a year earlier meant the year-over-year numbers were larger, but we find more usefulness in the monthly numbers until we get past the weak comparisons versus a year ago.\n\n> To be sure, a resurgent Delta variant played a part in dampening overall inflation, and future reports will help clarify the magnitude of its effect—but, expectations were already lowered to account for this dynamic and the data still missed.\n\n> One major takeaway from the report is that the composition of the decline suggests that the long-awaited abatement in price spikes in supply-constrained segments of the economy could be upon us. These relatively smaller parts of the overall CPI basket were driving an outsized portion of the gains this summer. Used cars and trucks (-1.5%), airfare (-9.1%), and lodging away from home (-3.3%) all declined significantly month-over-month.\n\n> “’Transitory’ has certainly been lasting longer than we originally thought it would,” said LPL Financial Chief Market Strategist Ryan Detrick. “But the CPI components that displayed summer volatility resulting from supply chain bottlenecks are beginning to resolve themselves as expected.”\n\n> As seen in the LPL Chart of the Day, used car and truck prices have experienced a drop-off after the summer surge, which saw them become the posterchild for bottleneck-driven inflation from semiconductor shortages.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/blog-chart-9.14.21.png?ssl=1))**\n\n> As we have highlighted in previous inflation blogs, we make special note of the trend in rents since they are viewed as “stickier” parts of the inflation outlook and count for more than 40% of the overall calculation. Moreover, the Delta variant likely has less of a direct effect on rents compared to some of the other components mentioned earlier. As such, owners’ equivalent rent of primary residences rose 0.25% month-over-month, down slightly compared to the prior two months, a modest pace that is unlikely to spook even the most hawkish inflation watchers.\n\n> Gauging the Federal Reserve’s reaction function to inflation and jobs data is fast becoming the market’s primary focus. Following August’s weak payroll report, market participants have mostly pushed back their expected timelines for tapering asset purchases so long as inflation does not spiral out of control in the meantime. Judging by the early market reaction, today’s softer inflation numbers are confirming that narrative.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending September 17th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 9.12.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n> * (**T.B.A. THIS WEEKEND.**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!]())**\n(T.B.A. THIS WEEKEND.)\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 9.20.21 Before Market Open:***\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/g8cDHb1.png))\n\n> # ***Monday 9.20.21 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/EW7pGPA.png))\n\n*****\n\n> # ***Tuesday  9.21.21 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/8Q33PF9.png))\n\n> # ***Tuesday 9.21.21 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/6WzUoIZ.png))\n\n*****\n\n> # ***Wednesday 9.22.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/CSV1GLw.png))\n\n> # ***Wednesday 9.22.21 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/iaPGNad.png))\n\n*****\n\n> # ***Thursday 9.23.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/xFu57HV.png))\n\n> # ***Thursday 9.23.21 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/hsIB3z1.png))\n\n*****\n\n> # ***Friday 9.24.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # ***Friday 9.24.21 After Market Close:***\n> ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # (T.B.A. THIS WEEKEND.)\n**(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n> #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks. :)",
  "author_fullname": "t2_eaak0",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Wall Street Week Ahead for the trading week beginning September 20th, 2021",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_pqcjyr",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.97,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 63,
  "total_awards_received": 3,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 63,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1631926168,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Friday evening to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning September 20th, 2021.</p>\n\n<h1><strong>As stocks enter volatile period, the Fed will attempt to not rock the boat further in the week ahead - <a href=\"https://www.cnbc.com/2021/09/17/as-stocks-enter-volatile-period-the-fed-will-attempt-to-not-rock-the-boat-further-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>The Federal Reserve’s much-anticipated meeting next week may not be quite as exciting for markets as some investors had been expecting in the usual choppy month of September.</p>\n\n<hr/>\n\n<p>The meeting is the highlight of the coming week, traditionally a negative time for stocks. Stocks were slightly lower in the past week, with the exception of the small-cap Russell 2000, which ended the week up 0.4%.</p>\n\n<hr/>\n\n<p>Central bank officials begin meeting Tuesday, and end their two-day session with an announcement Wednesday afternoon. That will be followed by a press briefing with Fed Chairman Jerome Powell.</p>\n\n<hr/>\n\n<p>The economic calendar is light, and there is mostly housing data. Starts and permits data are slated for Tuesday, existing home sales numbers are set for Wednesday, with new home sales figures coming out Friday. A handful of companies are reporting earnings, including Costco Wholesale, FedEx and Nike.</p>\n\n<hr/>\n\n<p>The Fed’s meeting may not be as eventful as investors once expected. The central bank’s move away from its bond-buying program has been expected by some strategists to cause turbulence for stocks. But the Fed is likely to only discuss tapering at the upcoming meeting and, at most, signal it could slow the bond purchases later in the year.</p>\n\n<hr/>\n\n<p>“They’ve been very clear in my view on the guidance on tapering. I think they get an ‘A plus’ on communicating their intentions around the balance sheet,” Bank of America head of U.S. economics Michelle Meyer said. “They said they want to take baby steps and they have.” She expects an announcement in November and the actual cut in bond purchases to start before year-end.</p>\n\n<hr/>\n\n<p>The unwinding of the $120 billion a month bond buying program is important since it would be the first major move away from the extraordinary policies the Fed used to fight the pandemic. It also takes the Fed a step closer to interest rate hikes.</p>\n\n<hr/>\n\n<h1>Debt ceiling risk</h1>\n\n<p>“Everybody’s been calling for a correction, and it’s always hard to see what the catalyst could be. The catalysts for a correction right now are as clear as they’ve been all year long,” Morgan Stanley Investment Management head of global macro strategy Jim Caron said.</p>\n\n<hr/>\n\n<p>For now, Caron sees the Fed’s communications in the week ahead as less of a risk for markets than other simmering issues, like the debt ceiling, the potential for more taxes and uncertainty surrounding the White House’s infrastructure bill.</p>\n\n<hr/>\n\n<p>Congress has until sometime in October to extend the debt ceiling before the government runs out of funds and defaults. Political rhetoric around raising the debt limit, which would allow Treasury to issue more debt, has been building. The White House warned Friday the economy could enter a recession if Congress fails to act.</p>\n\n<hr/>\n\n<p>“I think the Fed wants to stay out of the fight at this point. There’s just too much ambiguity,” Caron said. “They’re not going to announce tapering. Their statement is going to be carefully worded. The bar is really high for them to say anything hawkish right now. Between now and the next meeting, we should have a pretty good idea about the debt ceiling and where the infrastructure stands.”</p>\n\n<hr/>\n\n<h1>What the Fed could do</h1>\n\n<p>The odds for a September tapering announcement from the Fed fell sharply after August’s softer than expected employment report showed just 235,000 jobs were created, about 500,000 less than expected.</p>\n\n<hr/>\n\n<p>Economists now mostly expect a November announcement, but the September meeting could be important for what else the Fed says.</p>\n\n<hr/>\n\n<p>The quarterly forecasts of Fed officials are released along with the 2 p.m. statement Wednesday. They include new economic projections and an updated interest rate forecast.</p>\n\n<hr/>\n\n<p><a href=\"https://i.imgur.com/vV59aJ6.png\">https://i.imgur.com/vV59aJ6.png</a></p>\n\n<hr/>\n\n<p>“I don’t think they want to say anything that’s slightly hawkish, but the dot plot could come out that way,” Caron said. The so-called dot plot is the Fed’s interest rate forecast, which is the anonymous interest rate targets of Fed officials presented in a chart format.</p>\n\n<hr/>\n\n<p>Some Fed watchers expect the central bank to move its interest rate forecast forward slightly. In June, the dot plot showed two rate hikes for 2023 and none for 2022.</p>\n\n<hr/>\n\n<p>“They are two Fed officials from having a half a hike and they are three Fed officials from getting a full hike penciled in” for 2022, Bank of America’s Meyer said. “I think the dots will show the first hike is in 2023, but it is possible that shifts. ... I think if it shifts, the problem the Fed will have is to communicate the difference.”</p>\n\n<hr/>\n\n<p>Meyer said Powell has emphasized the asset purchase program’s unwinding is not linked to the Fed’s move to raise interest rates from the current near-zero level. If the interest rate forecast moves forward, it could suggest to the market that the Fed will wind down its bond program and immediately move on to a rate hike. The bond program is slowly expected to be unwound over the course of six months or more.</p>\n\n<hr/>\n\n<h1>September slump</h1>\n\n<p>The major indexes ended the past week with slight losses. The S&amp;P 500 was down 0.6% for the week, closing Friday’s session at 4,432.99. The Dow lost 0.1% for the week. The Nasdaq Composite dropped nearly 0.5% for the week to 15,043.97. The 10-year Treasury yield was higher on the week, at 1.37%.</p>\n\n<hr/>\n\n<p><a href=\"https://i.imgur.com/u10YCtQ.png\">https://i.imgur.com/u10YCtQ.png</a></p>\n\n<hr/>\n\n<p>September as a whole has been weak for the stock market, with the S&amp;P 500 down just under 2%.</p>\n\n<hr/>\n\n<p>J.P. Morgan technical strategists, however, do not see the big downdraft expected by some analysts.</p>\n\n<hr/>\n\n<p>They note the S&amp;P 500 has held above 4,420 to 4,435 trend support levels and another key level of 4,367.</p>\n\n<hr/>\n\n<p>“As a base-case view, we believe the index holds that support and rallies in the fourth quarter. Even if the market breaks support and sees a near-term increase in realized volatility, we continue to think the 4238-4257 summer-time breakout area will put a floor under the index,” the strategists wrote.</p>\n\n<hr/>\n\n<h1>Earnings</h1>\n\n<p>Investors continue to watch for earnings warnings ahead of the third-quarter reporting season, which starts in mid-October. The concern is that supply chain risks will continue to crimp revenues and could hurt margins.</p>\n\n<hr/>\n\n<p>There are a few companies reporting in the week ahead, and they should comment on supply chains and rising costs. FedEx reports Tuesday; General Mills releases earnings Wednesday, and both Nike and Costco report Thursday.</p>\n\n<hr/>\n\n<p>Nike is being watched closely since it is expected that supply chain issues will hurt its profits and it could continue to have issues getting products to sell.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/sJpYrsO.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/kHC57jC.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Jhg9Dfb.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Dh0h1Mt.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/X7wvTsI.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/A4RGdGJ.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ywQxa0R.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/BBeiemF.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/jvPSRuj.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE CHART!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/HZPu8q6.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/x9TOf99.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/vbkHbv9.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ic3kYSn.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>S&amp;P 500 down 25 of 31 during week after September quarterly options expiration, average loss 0.94%</h1>\n\n<p>The week after September options expiration week, next week, has a dreadful history of declines most notably since 1990. The week after September quarterly options expiration week has been a nearly constant source of pain with only a few meaningful exceptions over the past 31 years. Substantial and across the board gains have occurred just four times: 1998, 2001, 2010 and 2016 while many more weeks were hit with sizable losses.</p>\n\n<p>Full stats are in the above sea-of-red table. Average losses since 1990 are even worse; DJIA –1.03%, S&amp;P 500 –0.94%, NASDAQ –0.88% and a sizable –1.50% for Russell 2000. End-of-Q3 portfolio restructuring is the most likely explanation for this trend as managers trim summer holdings and position for the fourth quarter.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/73877a7ce2dd016092de48a698ee4325/6e49ca6ca6aaa30d-13/s640x960/b5dfb5d72d2a68a0e564f8058c1c1bb06f021569.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Mid-Pack Performance for Post-Election Year Octobers</h1>\n\n<p>October often evokes fear on Wall Street as memories are stirred of crashes in 1929, 1987, the 554-point drop on October 27, 1997, back-to-back massacres in 1978 and 1979, Friday the 13th in 1989 and the 733-point drop on October 15, 2008. During the week ending October 10, 2008, Dow lost 1,874.19 points (18.2%), the worst weekly decline in our database going back to 1901, in percentage terms. March 2020 now holds the dubious honor of producing the worst, second and third worst DJIA weekly point declines. The term “Octoberphobia” has been used to describe the phenomenon of major market drops occurring during the month. Market calamities can become a self-fulfilling prophecy, so stay on the lookout and don’t get whipsawed if it happens.</p>\n\n<p>Post-election year October’s are neither great nor bad since 1953, ranking mid-pack across DJIA, S&amp;P 500, NASDAQ and Russell 1000 with gains averaging from 0.9% (DJIA &amp; Russell 1000) to 1.4% (NASDAQ). DJIA has the best historical odds for gains having advanced in 12 of the last 17 post-election year Octobers. Despite the best average gain, NASDAQ actually has the worst record, declining in 6 of the last 12 post-election year Octobers. A 12.8% gain in 2001 boosts its average. Should a meaningful decline materialize in October it is likely to be an excellent buying opportunity, especially for any depressed technology and small-cap shares.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/7b16d8538635e224e9dc0b463c463ad1/9a8b32d0e45e4452-1e/s400x600/bc35b08a598f01d93a41d4340454f6d62868fa37.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Buy Yom Kippur, Sell Passover</h1>\n\n<p>Happy Jewish New Year 5782! May it be a sweet year for you all! As we informed you early this month the market tends to exhibit weakness during the Jewish High Holy days from Rosh Hashanah to Yom Kippur. Perhaps it is the market’s annual repentance for its own sins that drives the market lower over the years during the ten days of repentance or the days of awe as they are often referred. This trade ends tomorrow on Yom Kippur, September 16, but as of today’s close DJIA is down about 0.8% from the close on Rosh Hashanah.</p>\n\n<p>We attribute this perennial pullback to the fact that market liquidity drops as many market participants step away from the market and likely square positions ahead of these ten days. These days of awe also land during the seasonally weak end of Q3/beginning of Q4 period as fund managers restructure portfolios and prepare for the October 31 mutual fund deadline. This has made September the worst month of the year and contributed to the phenomenon of Octoberphobia.</p>\n\n<p>But there is a flipside to this trade. Buy Yom Kippur, Sell Passover. This has an even greater accuracy ratio than Sell Rosh Hashanah, Buy Yom Kippur up 72% of the time with average gains of 7%. And as I am sure our followers will realize this trade get a big boost from seasonal market strength during Q4 and Q1 and of course the Best Six Months of the Year November-April.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/50b4365b474dfe16373b2a7c4d27a4b2/a22228be383f50d1-d4/s500x750/f841ea12115829e47e743699ec795db2d4a0ca56.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Insurance Suddenly a Concern For Small Businesses</h1>\n\n<p>In addition to the various indices regarding small business conditions, the NFIB also surveys firms on what they see as their most pressing issue. In August, by far the most common issue among respondents was labor-related. A record 28% reported quality of labor as the biggest issue; up 2 percentage points versus July. Another 8% reported cost of labor as their biggest issue which was slightly lower than July. On a combined basis, the 36% reporting either cost or quality of labor as their biggest issue was the joint highest reading on record; tying August and November 2019.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Table.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Labor.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Especially over the past several election cycles, the results of the NFIB survey have tended to be impacted by politics. For example, over the past few presidencies, when a Republican is in office there has been a lower percentage of respondents reporting either taxes or government red tap as their biggest issue and vice versa when a Democrat is in office. That combined reading has now completely reversed the uptick following the election of President Biden as labor concerns have increasingly come into focus.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Gv.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>While government-related problems are still the second biggest concern(s) on a combined basis, there have been some other notable moves this month. The percentage of respondents reporting inflation as their biggest issue rose back up to the pandemic high of 13% this month. The Great Recession was the only other period that has seen as elevated a share of respondents seeing price increases as their biggest issue. Additionally, that excludes those reporting cost of labor as an issue.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Infl.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>As for what the rise in Inflation as a problem may have borrowed from, one of the most notable has been competition from big business. The reading has seen a gradual decline since the end of 2019, and now at only 5%, it is tied with several months between September 2009 and September 2013 for the lowest reading on record.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/09/091421-NFIB-MIP-Big-Biz.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Why Evergrande Isn’t The Next Lehman</h1>\n\n<p>Chinese property developer Evergrande’s liquidity crisis has sparked fear and massive selling in Chinese property stocks over the past several weeks. The big question is could this be the first domino to fall, sparking a systemic risk scenario, similar to when Lehman Brothers went under 13 years ago this week? The good news is we don’t think so, but we’ll get to that later.</p>\n\n<p>With more than $300 billion in liabilities and only $15 billion in cash on hand, Evergrande is currently the world’s most indebted real estate developer. Worries are mounting that starting next week it won’t be able to pay $84 billion of interest due (according to Bloomberg), along with potentially missing a principal payment on at least one of its loans.</p>\n\n<p>With Evergrande’s share price down more than 80% this year, investors are clearly voting with their pocketbooks, while the chart below shows the pressure its dollar bonds have been under as well, at deeply distressed levels to the tune of 28 cents on the dollar recently.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.17.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Multiple downgrades have happened the past two weeks, and some rating agencies are noting that an outright default is probable. Should this happen, what could the fallout be? With 1,300 real estate projects in 280 cities in China, could China’s communist government intervene to avoid a messy default? So far that answer has been a resounding no, with the company instead looking to banks and other creditors to help the impact of a default.</p>\n\n<p>The bad news keeps coming, as yesterday, Evergrande suspended trading of it’s onshore corporate bonds, after yet another downgrade, taking it one step closer to restructuring or default. So is Evergrande China’s version of Lehman Brothers? Here are three reasons we don’t think so.</p>\n\n<ul>\n<li>First, the dollar bonds will likely get restructured, but most of the debt is in global mutual funds, ETFs, and some Chinese companies and not banks or other important financial institutions. Remember, Lehman Brothers was held on nearly all other financial institution’s books, so not nearly as many institutions will be impacted by this versus Lehman.</li>\n<li>Secondly, we think the odds do favor the Chinese communist government will get involved should there be a default. They are holding out as of now, but the fallout could be too great for them to avoid intervening.</li>\n<li>Finally, Evergrande has tangible assets that can be sold off to settle financial obligations. Their assets aren’t great and creditors know that the company is in financial trouble , so the value of its assets aren’t likely worth as much as they think but it will still help settle some debts. Remember, Lehman didn’t have hard assets it could sell off whereas Evergrande does.</li>\n</ul>\n\n<p>“Although the impact from Evergrande’s liquidity crisis is enormous, the good news is the fallout hasn’t started to spillover to other markets,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Short-term funding markets are acting just fine in China thus far; remember, it was the money markets in the U.S. that first started to show cracks in the system in early 2008, well before the wheels fell off.”</p>\n\n<p>As shown in the LPL Chart of the Day, China’s money markets aren’t showing any signs of systemic risk. These tend to be the canary in the coal mine, and the fallout appears to be fairly contained as of now.</p>\n\n<p>LPL Research downgraded our view on emerging markets to negative from neutral last month, due to concerns over China’s regulatory crackdowns and heightened political risk. Now with Evergrande’s liquidity crisis in the mix, we continue to recommend an underweight to emerging markets in portfolios.</p>\n\n<p>This is a very fluid situation and one that could clearly change on a dime. Although the Chinese communist government has avoided helping Evergrande so far, we think the odds do favor some type of eventual bailout to limit the ripple effect from a potential default. We will continue to watch the action in the short-term lending markets for clues if this is spiraling into something larger.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Retail Sales Surprise To The Upside</h1>\n\n<p>U.S. consumers shocked economists in August with their willingness to spend in the face of recent jitters over the economic outlook.</p>\n\n<p>This morning, the U.S. Census Bureau released August retail sales data showing overall retail sales grew 0.7% month-over-month vs. a consensus forecast for a 0.7% drop, while retail sales ex autos and gas rose 2% month-over-month vs. a consensus forecast for no change. Auto sales remained under pressure because of supply chain bottlenecks and higher prices, accounting for the large gulf in the numbers. The big beats come on the heels of disappointing July data, which received additional negative revisions, taking a small bit of the shine off August’s numbers.</p>\n\n<p>Nonetheless, the spending resilience shown in this report is receiving an overwhelmingly early positive response, as economic releases in recent weeks have generally been surprising to the downside. COVID-19’s resurgence in recent months is surely to blame for a significant portion of the lowered expectations, but consumers have also been forced to contend with rising prices, severe weather events, lukewarm payroll gains, and cuts to enhanced unemployment benefits.</p>\n\n<p>“There have been several reasons to question the consumer outlook recently,” explained LPL Financial Chief Market Strategist Ryan Detrick. “And yet, the old mantra ‘never bet against the U.S. consumer’ continues to ring true. This has been a volatile series of late, but we look for the consumer to continue powering this economy well into the future.”</p>\n\n<p>As seen in the LPL Chart of the Day, retail sales ticked significantly higher in August following a difficult July.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/09/9.16.21-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The familiar theme of goods over services consumption seen during prior virus flare-ups is evident in this report, as well as a back-to-school boost. General merchandise stores (3.5%) and nonstore (online) retailers (5.3%) showed large monthly boosts, reversing a disappointing July. In addition, furniture and home furnishing stores rose nicely (3.7%). Meanwhile, food services and drinking places (0.0%), an in-person segment most impacted by virus caution, held steady against forecasts for a decline, while volatile electronics and appliance stores (-3.1%) showed weakness.</p>\n\n<p>We continue to believe that successfully tackling Delta could set up a fourth quarter growth rebound despite many strategists increasingly turning sour on the second half of the year. Cases from this latest COVID-19 wave are starting to decline, and plentiful job openings and impressive wage gains data should prevent a major income shortfall resulting from the expiration of enhanced unemployment benefits. Consumers also still have elevated excess savings relative to history—in the neighborhood of $2 trillion. We continue to look for a resilient consumer, as well as for services spending to play catch-up vs. goods spending in coming months.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Inflation Shows Signs Of Moderating</h1>\n\n<p>After a crazy summer of nosebleed inflation readings, we may finally be starting to see signs of transitory inflation.</p>\n\n<p>The Bureau of Labor Statistics released the August Consumer Price Index (CPI) data this morning, which came in softer than expected. Headline CPI climbed 0.3% month-over-month vs. estimates of 0.4%, while core CPI jumped only 0.1% month-over-month vs. estimates of 0.3%. Base effects from rolling off weak numbers a year earlier meant the year-over-year numbers were larger, but we find more usefulness in the monthly numbers until we get past the weak comparisons versus a year ago.</p>\n\n<p>To be sure, a resurgent Delta variant played a part in dampening overall inflation, and future reports will help clarify the magnitude of its effect—but, expectations were already lowered to account for this dynamic and the data still missed.</p>\n\n<p>One major takeaway from the report is that the composition of the decline suggests that the long-awaited abatement in price spikes in supply-constrained segments of the economy could be upon us. These relatively smaller parts of the overall CPI basket were driving an outsized portion of the gains this summer. Used cars and trucks (-1.5%), airfare (-9.1%), and lodging away from home (-3.3%) all declined significantly month-over-month.</p>\n\n<p>“’Transitory’ has certainly been lasting longer than we originally thought it would,” said LPL Financial Chief Market Strategist Ryan Detrick. “But the CPI components that displayed summer volatility resulting from supply chain bottlenecks are beginning to resolve themselves as expected.”</p>\n\n<p>As seen in the LPL Chart of the Day, used car and truck prices have experienced a drop-off after the summer surge, which saw them become the posterchild for bottleneck-driven inflation from semiconductor shortages.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/09/blog-chart-9.14.21.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>As we have highlighted in previous inflation blogs, we make special note of the trend in rents since they are viewed as “stickier” parts of the inflation outlook and count for more than 40% of the overall calculation. Moreover, the Delta variant likely has less of a direct effect on rents compared to some of the other components mentioned earlier. As such, owners’ equivalent rent of primary residences rose 0.25% month-over-month, down slightly compared to the prior two months, a modest pace that is unlikely to spook even the most hawkish inflation watchers.</p>\n\n<p>Gauging the Federal Reserve’s reaction function to inflation and jobs data is fast becoming the market’s primary focus. Following August’s weak payroll report, market participants have mostly pushed back their expected timelines for tapering asset purchases so long as inflation does not spiral out of control in the meantime. Judging by the early market reaction, today’s softer inflation numbers are confirming that narrative.</p>\n</blockquote>\n\n<hr/>\n\n<h1><strong>STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending September 17th, 2021</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE YOUTUBE VIDEO!]())</strong></h6>\n\n<p>(VIDEO NOT YET POSTED.)</p>\n\n<h1><strong>STOCK MARKET VIDEO: ShadowTrader Video Weekly 9.12.21</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE YOUTUBE VIDEO!]())</strong></h6>\n\n<p>(VIDEO NOT YET POSTED.)</p>\n\n<hr/>\n\n<p>Here are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-</p>\n\n<hr/>\n\n<blockquote>\n<ul>\n<li>(<strong>T.B.A. THIS WEEKEND.</strong>)</li>\n</ul>\n</blockquote>\n\n<hr/>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 9.20.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/g8cDHb1.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 9.20.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/EW7pGPA.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  9.21.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/8Q33PF9.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 9.21.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/6WzUoIZ.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 9.22.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/CSV1GLw.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 9.22.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/iaPGNad.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 9.23.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/xFu57HV.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 9.23.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/hsIB3z1.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 9.24.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 9.24.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>(T.B.A. THIS WEEKEND.)</h1>\n\n<p><strong>(T.B.A. THIS WEEKEND.)</strong> (T.B.A. THIS WEEKEND.).</p>\n\n<h1>(<a href=\"https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great trading week ahead <a href=\"/r/stocks\">r/stocks</a>. :)</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "pqcjyr",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bigbear0083",
  "discussion_type": null,
  "num_comments": 4,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/pqcjyr/wall_street_week_ahead_for_the_trading_week/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/pqcjyr/wall_street_week_ahead_for_the_trading_week/",
  "subreddit_subscribers": 3051411,
  "created_utc": 1631989197,
  "num_crossposts": 1,
  "media": null,
  "is_video": false,
  "original_created_utc": 1631926168,
  "the_new_excerpt": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning September 20th,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks[/r/stocks]をご覧の皆さん、良い金曜日の夜をお過ごしください。このサブの皆さんは\nこのサブにいる皆さんは、先週の市場でうまく利益を得て、これから始まる新しい取引の準備ができていることと思います。\nこれから始まる新しい取引に向けて準備ができていることと思います。\n\nここでは、今週の取引の準備のために知っておくべきことをお伝えします。\n9月20日からの取引に備えて、知っておくべきことをまとめました...",
      "title": "2021年9月20日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友们周五晚上好。我希望每个人\n在过去的一周里在市场上赚得盆满钵满，并准备好迎接新的交易周。\n迎接新的交易周的到来。\n\n以下是你需要知道的一切，让你为本周的交易做好准备\n从9月20日开始，...",
      "title": "2021年9月20日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "祝各位在r/stocks [/r/stocks]的朋友們週五晚上好。我希望每個人\n在過去的一週裏在市場上賺得盆滿鉢滿，並準備好迎接新的交易周。\n迎接新的交易周的到來。\n\n以下是你需要知道的一切，讓你爲本週的交易做好準備\n從9月20日開始，...",
      "title": "2021年9月20日開始的交易周，華爾街一週前瞻"
    }
  ],
  "source_updated_at": 1632476399254
}