{
  "author": "OliviaFa",
  "original_created_utc": 1632497631,
  "title": "Is fuck the most versatile word in the English language?",
  "created_utc": 1632504803,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As in fuck this, we&#39;re fucked, go fuck yourself, fuck!, I don&#39;t give a fuck, fuck-all, fuck off, for fuck&#39;s sake, fucked over, you do this all the fucking time, fuck me dead, what the fuck (all negative connotations) </p>\n\n<p>OR!</p>\n\n<p>This is fucking cool / fucking amazing, fuck yeah, let&#39;s fuck, I want to fuck you like an animal, (I&#39;m sure there&#39;s more but it will come to me).</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/NoStupidQuestions/comments/pum9az/is_fuck_the_most_versatile_word_in_the_english/",
  "subreddit": "NoStupidQuestions",
  "id": "pum9az",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As in fuck this, we're fucked, go fuck yourself, fuck!, I don't give a fuck,\nfuck-all, fuck off, for fuck's sake, fucked over, you do this all the fucking\ntime, fuck me dead, what the fuck (all negative connotations)\n\nOR!\n\nThis is fucking cool / fucking amazing, fuck yeah, let's fuck, I want to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "fuck this, we're fucked, go fuck yourself, fuck!!!, I don't give a fuck,\nfuck-all, fuck off, for fuck's sake, fucked over, you do this all the fucking time, fuck me dead, what the fuck (すべての否定的な意味合い)\nfuck me dead, what the fuck (すべての否定的な意味合い)\n\nOR!\n\nこれはクソかっこいい/クソすごい、ファックイェー、ファックしよう、私はしたい...",
      "title": "fuckは英語の中で最も汎用性の高い言葉ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比如说，去他妈的，我们完蛋了，去他妈的，去他妈的！，我不给他妈的。\n操他妈的，操他妈的，看在上帝的份上，操他妈的，你他妈的一直在这样做\n艹死我了，什么他妈的（所有负面含义）。\n\n或者!\n\n这他妈的太酷了/他妈的太神奇了，他妈的是的，让我们干吧，我想......",
      "title": "操是英语中用途最广的词吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比如說，去他媽的，我們完蛋了，去他媽的，去他媽的！，我不給他媽的。\n操他媽的，操他媽的，看在上帝的份上，操他媽的，你他媽的一直在這樣做\n艹死我了，什麼他媽的（所有負面含義）。\n\n或者!\n\n這他媽的太酷了/他媽的太神奇了，他媽的是的，讓我們幹吧，我想......",
      "title": "操是英語中用途最廣的詞嗎？"
    }
  ]
}