{
  "author": "Individual-Trade756",
  "the_new_excerpt": "The fact that the Bahamas and other eastern islands were inhabited seems to\nindicate that there were seafaring people living along the east coast that had\nthe technology to travel quite far across the ocean, yet I can't find any\nresources on them. Have I been looking in the wrong places? Did they…",
  "original_created_utc": 1624203042,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バハマをはじめとする東の島々に人が住んでいたということは\n東海岸には海を渡る技術を持った人々が住んでいたことを示しています。\n海を渡る技術を持った海洋民族が東海岸に住んでいたと思われるが、彼らに関する資料は見当たらない。\nしかし、彼らに関する資料は見つかりません。私は間違った場所を見ていたのだろうか？彼らは...",
      "title": "私は、アメリカ大陸東海岸の海に面したネイティブアメリカンの国々に興味があります。このサブレディットのfaqsで、コロンブス以前のアメリカ大陸の水車についての質問を見つけましたが、西海岸の例しか書かれていませんでした。東海岸にも水上生活を営む国があったのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "巴哈马和其他东部岛屿有人居住的事实似乎表明\n这表明在东海岸生活着航海者，他们有\n具备远洋旅行的技术，但我却找不到任何\n关于他们的资源。我是不是找错地方了？他们是否...",
      "title": "我对美洲东海岸的航海美洲原住民国家感兴趣。我在这个子网站的问答中发现了一个关于前哥伦布时期美洲的水上交通工具的问题，但它只提到了西海岸的例子。东海岸肯定也有航海国家？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "巴哈馬和其他東部島嶼有人居住的事實似乎表明\n這表明在東海岸生活着航海者，他們有\n具備遠洋旅行的技術，但我卻找不到任何\n關於他們的資源。我是不是找錯地方了？他們是否...",
      "title": "我對美洲東海岸的航海美洲原住民國家感興趣。我在這個子網站的問答中發現了一個關於前哥倫布時期美洲的水上交通工具的問題，但它只提到了西海岸的例子。東海岸肯定也有航海國家？"
    }
  ],
  "title": "I am interested in sea-faring Native American nations on the East coast of the Americas. I found an ask on this sub-reddit's faqs about watercraft in the pre-Colombian Americas, but it only mentions examples from the west coast. There must have been seafaring nations on the east coast?",
  "created_utc": 1624242237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The fact that the Bahamas and other eastern islands were inhabited seems to indicate that there were seafaring people living along the east coast that had the technology to travel quite far across the ocean, yet I can&#39;t find any resources on them. Have I been looking in the wrong places? Did they use similar watercraft to tribes and nations on the western coast?</p>\n\n<p>Also, is there any evidence or are there any theories about people from the Americas reaching either Europe or Africa? Everything I could find always talks about European (sometimes Egyptian) people traveling west.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/o485jo/i_am_interested_in_seafaring_native_american/",
  "subreddit": "AskHistorians",
  "id": "o485jo",
  "is_self": true,
  "media": null,
  "is_video": false
}