{
  "author": "ImChadYourSkinTag",
  "the_new_excerpt": "So I decided to put down my banana and sign a message for my handler to deliver\nto my state Rep. Didn't expect to have a response, but just got this in. This\nhas been suggested before here, so be like Koko, don't throw shit, relay your\nconcerns like the cultured apes we are.\n\n\"Thank you for writing…",
  "original_created_utc": 1612442813,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我决定放下香蕉，签个字，让我的处理人去送。\n没想到会有回应，但刚收到这个。这个\n以前有人在这里建议过，所以要像Koko一样，不要扔狗屎，转达你的。\n像我们这种有教养的猿人一样关注问题。\n\n\"谢谢你的文章...",
      "title": "我们的州众议员其实是以我们的利益为重的，关于高频恶人。这是我的回应。我们可以做出改变。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我決定放下香蕉，籤個字，讓我的處理人去送。\n沒想到會有迴應，但剛收到這個。這個\n以前有人在這裏建議過，所以要像Koko一樣，不要扔狗屎，轉達你的。\n像我們這種有教養的猿人一樣關注問題。\n\n\"謝謝你的文章...",
      "title": "我們的州衆議員其實是以我們的利益爲重的，關於高頻惡人。這是我的迴應。我們可以做出改變。"
    }
  ],
  "title": "Our state Reps actually do have our interests at heart regarding the HF evildoers. Here's a response from mine. We can make change.",
  "created_utc": 1612486011,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I decided to put down my banana and sign a message for my handler to deliver to my state Rep. Didn&#39;t expect to have a response, but just got this in. This has been suggested before here, so be like Koko, don&#39;t throw shit, relay your concerns like the cultured apes we are.</p>\n\n<p>&quot;Thank you for writing to me with your concerns regarding the trading of stocks like GME and AMC. Your thoughts on these important matters are most welcome and appreciated.</p>\n\n<p>As you mentioned, after an unexpected surge in gains for stocks such as GME, certain financial services institutions and trading platforms suspended the trading of this and other stocks on January 28, 2020. These trading restrictions have since raised questions regarding the legality of barring smaller, retail investors from participating in stock trading during periods of volatility. Like you, I have serious concerns about brokerage platforms putting in place restrictions, which limit the free trading of stocks and options, especially when those restrictions disproportionately benefit large hedge fund operators at the expense of individual investors.</p>\n\n<p>In recent years, online brokerage platforms have made the stock market more accessible to individual retail investors. While this progress is important in allowing everyday Americans the freedom to make their own investment decisions, it&#39;s important that these platforms allow their users to participate on an equal playing field with the large banks, funds, and institutional investors that have dominated the stock market for decades.</p>\n\n<p>You may be interested to know that I am a member of the House Appropriations Subcommittee on Financial Services and General Government. Given that this subcommittee is responsible for funding the operations of the Securities and Exchange Commission (SEC), I have a unique opportunity to engage with this agency on recent market volatility. In the coming weeks, I look forward to the opportunity to question the SEC Chair on the handling of this situation and will keep your concerns in mind as I have those discussions. The SEC must help provide answers to the thousands of retail investors who may have been harmed by the surprise restrictions put in place on January 28th. &quot;</p>\n\n<p>Edit: Whether this Rep will really take this and run with it remains to be seen, however like I&#39;ve been told more than once in my life....&quot;You don&#39;t get if you don&#39;t ask&quot;.</p>\n\n<p>Edit 2: Most of the Senators, Reps, etc. have web based contact forms. I unfortunately didn&#39;t capture my original message. Just keep it simple, explain your concerns, and ask that they look into it. I.E: Dear xxx &quot;I&#39;m sure you are aware of recent events surrounding trading limitations imposed on retail investors by online brokerages such as Robinhood, who restricted buying of Gamestop, AMC, and a number of other stocks during critical periods of volume and price movement. These actions reek of manipulation by the hedge funds who were deeply underwater with their short  positions, the brokerages who restricted buying, and the clearing houses that handle all the flow. Additionally, it is widely believed that there was collusion and specific actions behind the scenes to artificially drive down these stock prices in order to minimize losses. </p>\n\n<p>I trust that your interest in protecting your constituents rights compels you to promote this issue to the appropriate entities for investigation and resolution. We should all be on equal footing with our ability to trade and invest freely.&quot; </p>\n</div><!-- SC_ON -->",
  "score": 19714,
  "permalink": "/r/wallstreetbets/comments/lcew5b/our_state_reps_actually_do_have_our_interests_at/",
  "subreddit": "wallstreetbets",
  "id": "lcew5b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123206823
}