{
  "author": "Set1Less",
  "original_created_utc": 1656441317,
  "title": "Roger Ver has been liquidated on CoinFLIX and now owes a big debt. And CoinFLIX has tokenised this debt to another debt, and sold it to users who are not even aware of the situation by promising 20% returns. Unbelievably scummy",
  "created_utc": 1656451871,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;News is just coming  in that &amp;quot;a wealthy individual&amp;quot; has been liquidated on CoinFLIX and owes the company $47m USDC. The CEO of CoinFLIX confirmed this so far, and has said they have issued a notice of default to Ver. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/xnkwn1hgne891.jpg?width=1646&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=95857d8d097cdd4a37f88aaf97b07727e9319158\"&gt;CoinFlix CEO: Roger Ver owes CoinFLEX $47 Million USDC. We have a written contract with him&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;However, Roger Ver in a throwback to his days of degeneracy and racketeering immediately denied this. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/ybvedakvne891.jpg?width=986&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=afe213729aa79cc63ea59813a29f20be3651c557\"&gt;Instead he claims CoinFLIX owes him money!&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Hence the CEO of Coinflix has issued additional clarifications that Roger is lying. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/9ta16af0oe891.jpg?width=1646&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=8642baabe57ab0591a1a55e770a31670d00e271a\"&gt;CoinFLEX also categorically denies that we have any debts owing to him. His statement is blatantly false.  It is unfortunate that Roger Ver needs to resort to such tactics in order to deflect from his liabilities and responsibilities&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This is some welcome back into crypto for &amp;quot;Bitcoin Jesus&amp;quot; who infamously foked BTC into BCash.&lt;/p&gt;\n\n&lt;p&gt;Literally all he had to do was hold on to his early BTC, and instead he created a shitcoin BCash which is sinking badly, and now he has been liquidated longing this shitcoin. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/r94l3vp8oe891.jpg?width=1306&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=cdebd899769dac24485f8f27adf8975c6b0e1804\"&gt;FatMan says he has confirmed that the liquidation was due to Roger Ver&amp;#39;s long BCash positions on CoinFLIX which &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Even more incredibly, CoinFlix has turned this debt owed by Roger Ver, which is denied by Roger Ver, into another debt and have sold this debt of a debt to other users as rvUSD token promising a 20% APY on these tokens. &lt;/p&gt;\n\n&lt;p&gt;This is just incredibly scammy and pathetic from every party concerned here.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 498,
  "permalink": "/r/CryptoCurrency/comments/vmuc02/roger_ver_has_been_liquidated_on_coinflix_and_now/",
  "subreddit": "CryptoCurrency",
  "id": "vmuc02",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "News is just coming in that \"a wealthy individual\" has been liquidated on\nCoinFLIX and owes the company $47m USDC. The CEO of CoinFLIX confirmed this so\nfar, and has said they have issued a notice of default to Ver.\n\nCoinFlix CEO: Roger Ver owes CoinFLEX $47 Million USDC. We have a written\ncontract…"
}