{
  "author": "LavaSquid",
  "the_new_excerpt": "I've been investing for a couple years. Most of my stock picks have been large\ncap companies, lots of tech and consumer products. I follow trends, buy the dip,\nyadda yadda.\n\nAbout a year ago I started putting extra money into ETFs. For those, I have\nfocused on tech heavy funds, clean energy, next…",
  "original_created_utc": 1612987259,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经投资了几年了。我选择的大部分股票都是大\n帽公司，大量的科技和消费产品。我跟着趋势走，买跌。\nyadda yadda。\n\n大约一年前，我开始把额外的钱投入到ETF中。对于这些，我有\n专注于科技重仓基金、清洁能源、下...",
      "title": "我不再选股了。对我来说是ETF。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經投資了幾年了。我選擇的大部分股票都是大\n帽公司，大量的科技和消費產品。我跟着趨勢走，買跌。\nyadda yadda。\n\n大約一年前，我開始把額外的錢投入到ETF中。對於這些，我有\n專注於科技重倉基金、清潔能源、下...",
      "title": "我不再選股了。對我來說是ETF。"
    }
  ],
  "title": "I am no longer picking stocks. It's ETFs for me.",
  "created_utc": 1612992490,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been investing for a couple years. Most of my stock picks have been large cap companies, lots of tech and consumer products. I follow trends, buy the dip, yadda yadda.</p>\n\n<p>About a year ago I started putting extra money into ETFs. For those, I have focused on tech heavy funds, clean energy, next gen stuff- all Vanguard or low cost funds. Now that my portfolio is split evenly between individual stocks and ETFs, I&#39;ve noticed a surprising trend:</p>\n\n<p>My ETFs beat my stock picks almost every day. Today is a great example- in a mixed market, my individual stocks are (collectively) down -$195, but my ETFs are (collectively) up $110. And it is like this fairly consistently. On a good day for the markets as a whole, my ETFs are always beating my stock picks. Sure, there are times I have an individual stock that might pop and outperform my ETFs, but more regularly, my collective stock picks rarely outperform my collection of ETF picks.</p>\n\n<p>I guess I am just saying that I am done trying to pick the next winning stock, spending my valuable time pouring over charts and digging through the news for rumors. I am liquidating my individual stocks and dumping it all back into my ETF picks at the next market dip.</p>\n</div><!-- SC_ON -->",
  "score": 4415,
  "permalink": "/r/investing/comments/lh2by7/i_am_no_longer_picking_stocks_its_etfs_for_me/",
  "subreddit": "investing",
  "id": "lh2by7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200901
}