{
  "author": "Mandrake_m2",
  "original_created_utc": 1634910915,
  "title": "To all newcomers, do NOT use YouTube for crypto advice.",
  "created_utc": 1634945969,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Its just a bunch of so called “crypto influencers” who shill shitcoins to make pocket money. What bothers me the most is that some newcomers who don’t know any better actually listen to these sell outs and end up investing in scams.</p>\n\n<p>I wish we could replace YouTube with another video platform for crypto. I think the best candidates for that would be crypto streaming platforms like AIOZ, Theta and Xfinite.</p>\n\n<p>I actually tried both AIOZ and Xfinite and they’re much better than I expected. Content there was of very high quality compared to that of YouTube. And while they’re not for exclusively for crypto videos, they’re fully crypto compatible meaning the potential is there.\nSo guys do yourself a favor and search for something else other than YouTube for advice.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/qdhgj8/to_all_newcomers_do_not_use_youtube_for_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qdhgj8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Its just a bunch of so called “crypto influencers” who shill shitcoins to make\npocket money. What bothers me the most is that some newcomers who don’t know any\nbetter actually listen to these sell outs and end up investing in scams.\n\nI wish we could replace YouTube with another video platform for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いわゆる「暗号インフルエンサー」と呼ばれる人たちが、小遣い稼ぎのためにクソコインを売りさばいているだけだ。\n小遣い稼ぎをしています。一番気になるのは、何も知らない新規参入者がこのような売名行為に耳を傾け、結局詐欺に投資してしまうことです。\n詐欺師の言うことに耳を傾けてしまい、詐欺に投資してしまうことです。\n\nYouTubeの代わりに別の動画プラットフォームがあればいいのですが...。",
      "title": "初心者の皆さん、YouTubeで暗号のアドバイスを受けてはいけません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它只是一群所谓的 \"加密货币影响者\"，为了赚取零花钱而兜售狗屎币。\n口袋里的钱。最让我困扰的是，一些不了解情况的新来者\n的新人居然听信这些卖家的话，最终投资于骗局。\n\n我希望我们能用另一个视频平台取代YouTube，为...",
      "title": "对所有的新人来说，不要用YouTube来获取加密货币的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它只是一羣所謂的 \"加密貨幣影響者\"，爲了賺取零花錢而兜售狗屎幣。\n口袋裏的錢。最讓我困擾的是，一些不瞭解情況的新來者\n的新人居然聽信這些賣家的話，最終投資於騙局。\n\n我希望我們能用另一個視頻平臺取代YouTube，爲...",
      "title": "對所有的新人來說，不要用YouTube來獲取加密貨幣的建議。"
    }
  ]
}