{
  "author": "shlammyjohnson",
  "original_created_utc": 1636566814,
  "title": "US inflation jumped to 6.2% from a year earlier, the fastest leap since 1990.",
  "created_utc": 1636576753,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And that&#39;s using busted valuations the remit so many prices to fit the &quot;inflation is transitory&quot; narrative.</p>\n\n<p>Costs of literally everything are increasing on a month to month basis, while property values, stocks, bonds, and crypto all seem to be increasing (especially crypto).</p>\n\n<p>The larger global market is likely due for a housing crash in the coming year or two as well, with Chinese property companies barely able to scrape up enough liquid cash to pay the interest on the bonds due.</p>\n\n<p>I don&#39;t see the crypto bull market dropping anytime soon as the global money printing continues to churn at an ever increasing rate.</p>\n\n<p>Just a reminder, if you did not receive at least around a 7% wage hike at your business or job, you lost an incredible amount of purchasing power year over year.</p>\n\n<p>But don&#39;t worry right? &quot;It&#39;s transitory&quot; nothing to see here. Do not look at the man behind the curtain.</p>\n</div><!-- SC_ON -->",
  "score": 231,
  "permalink": "/r/CryptoCurrency/comments/qr00yl/us_inflation_jumped_to_62_from_a_year_earlier_the/",
  "subreddit": "CryptoCurrency",
  "id": "qr00yl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "And that's using busted valuations the remit so many prices to fit the\n\"inflation is transitory\" narrative.\n\nCosts of literally everything are increasing on a month to month basis, while\nproperty values, stocks, bonds, and crypto all seem to be increasing (especially\ncrypto).\n\nThe larger global…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そして、それは破綻した評価を利用しています。\n「インフレは一過性のもの」というシナリオに合わせて、多くの価格を修正しています。\n\n文字通りあらゆるもののコストが月ごとに上昇している一方で\n資産価値、株式、債券、暗号のすべてが上昇しているように見えます（特に\n暗号は特に）。\n\nより大きな世界の...",
      "title": "米国のインフレ率は前年比6.2％となり、1990年以降で最も急速に上昇しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "而这是用破损的估值来汇入这么多的价格，以适应\n\"通货膨胀是短暂的 \"的说法。\n\n实际上，所有东西的成本都在逐月增加，而\n财产价值、股票、债券和加密货币似乎都在增加（特别是\n特别是加密货币）。\n\n更大的全球...",
      "title": "美国的通货膨胀率从一年前跃升至6.2%，是1990年以来最快的跃升。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而這是用破損的估值來匯入這麼多的價格，以適應\n\"通貨膨脹是短暫的 \"的說法。\n\n實際上，所有東西的成本都在逐月增加，而\n財產價值、股票、債券和加密貨幣似乎都在增加（特別是\n特別是加密貨幣）。\n\n更大的全球...",
      "title": "美國的通貨膨脹率從一年前躍升至6.2%，是1990年以來最快的躍升。"
    }
  ]
}