{
  "author": "cbelt3",
  "the_new_excerpt": "My son was not doing his homework so I confiscated his GBA. I told him he would\nget it back next week.\n\nWell he’s a pretty clever dude and knew all my hiding places, so I put it\nsomeplace he would never look.\n\nExcept I suffered a TBI a few years earlier and I forget stuff. So when he did\nhis…",
  "original_created_utc": 1617585794,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我儿子不做作业，所以我没收了他的GBA。我告诉他，他将\n下周再拿回来\n\n他是个很聪明的家伙 知道我所有的藏身之处，所以我把它\n某个他不会看的地方\n\n除了我几年前受过创伤性脑损伤，我忘记了一些东西。所以当他做了\n他的...",
      "title": "TIFU没收了我儿子的Gameboy并藏了起来。十八年来..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我兒子不做作業，所以我沒收了他的GBA。我告訴他，他將\n下週再拿回來\n\n他是個很聰明的傢伙 知道我所有的藏身之處，所以我把它\n某個他不會看的地方\n\n除了我幾年前受過創傷性腦損傷，我忘記了一些東西。所以當他做了\n他的...",
      "title": "TIFU沒收了我兒子的Gameboy並藏了起來。十八年來..."
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "息子が宿題をしないので、GBAを没収しました。来週返してもらうように言ったのですが\n来週返してもらうように言いました。\n\n彼はかなり賢い奴で、私の隠し場所を全て知っていたので、絶対に見られない場所に置いておいた。\n絶対に見られない場所に置いておきました。\n\nただし、私は数年前にTBIを受けており、物忘れが激しいのです。それで彼が\n彼の...",
      "title": "息子のゲームボーイを没収して隠してTIFU。18年間も..."
    },
    {
      "locale": "ja",
      "the_new_excerpt": "息子が宿題をしないので、GBAを没収しました。来週返してもらうように言ったのですが\n来週返してもらうように言いました。\n\n彼はかなり賢い奴で、私の隠し場所を全て知っていたので、絶対に見られない場所に置いておいた。\n絶対に見られない場所に置いておきました。\n\nただし、私は数年前にTBIを受けており、物忘れが激しいのです。それで彼が\n彼の...",
      "title": "息子のゲームボーイを没収して隠してTIFU。18年間も..."
    }
  ],
  "title": "TIFU by confiscating my son’s Gameboy and hiding it. For 18 years...",
  "created_utc": 1617638076,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My son was not doing his homework so I confiscated his GBA. I told him he would get it back next week.</p>\n\n<p>Well he’s a pretty clever dude and knew all my hiding places, so I put it someplace he would never look.</p>\n\n<p>Except I suffered a TBI a few years earlier and I forget stuff. So when he did his homework and asked for it back after a week, I ... could not find it. Aargh. I looked everywhere.</p>\n\n<p>Narrator: Obviously not everywhere...</p>\n\n<p>Then we moved house. And I still didn’t find it. </p>\n\n<p>Spongebob: 18 YEARS LATER...</p>\n\n<p>I was donating some coats I had not worn in a long time. And in the pocket of a Viennese trench coat from the 1930’s, I found... his Gameboy Advance. And turned it on. And it WORKED. Pokémon appeared. </p>\n\n<p>I put fresh batteries into it and handed it to my 28 year old son. Who proceeded to laugh for a good five minutes. Then played it for a few hours. Then proceeded to tell my wife and other adult children how silly I was.</p>\n\n<p>TL/DR: Hid kid’s Gameboy, forgot where. Found it almost 20 years later. Family has further proof that I’m an idiot.</p>\n</div><!-- SC_ON -->",
  "score": 89888,
  "permalink": "/r/tifu/comments/mk9j8n/tifu_by_confiscating_my_sons_gameboy_and_hiding/",
  "subreddit": "tifu",
  "id": "mk9j8n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961872388
}