{
  "author": "Gaming_Forever",
  "original_created_utc": 1638643791,
  "title": "If Bitcoin can survive 2014 then nothing can kill it (especially not this little mini crash)",
  "created_utc": 1638686467,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I first got into Bitcoin in December 2017 and quickly saw the awful collapse of 2018 - 2020 Bear market. But during that time of January 2018 I really started to research Bitcoins history and technology and I really fell in love. Now this post wont be about the technology since we already have plenty talking about it but instead we&amp;#39;ll talk about the history. Specifically the year 2014.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;When Shit Hits The Fan&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Mt Gox gets hacked&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;A lot of new people might not understand it but Mt Gox was the biggest Bitcoin Exchange at the time accounting for &lt;strong&gt;70%&lt;/strong&gt; of all Bitcoin volume at the time. Imagine bigger than Coinbase and Binance combined. A lot of people lost everything and its hard to keep people motivated in the technology when they no longer have the thousands in it they once had. Even worse all their money belongs to a hacker now who will benefit the most from bitcoin adoption.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Bit License&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;New York City creates the Bit License. One of the most repressive regulations the crypto market has seen. Back then a lot of Bitcoin startups were in New York City and this Bit license regulation shut down a huge portion of the Bitcoin startups at the time. Even throwing in jail some of the more high profile people in Bitcoin at the time over weird technicalities. &lt;/p&gt;\n\n&lt;p&gt;This crack down really hurt a lot if innovation and real world adoption that Bitcoin was going through at the time. Creating the biggest government hurdle that Bitcoin had to face yet. Nobody knew if Bitcoin would survive this. They were only a 1 Billion dollar asset at the time and there was no guarantee of network effect to withstand this kind of attack.   &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Silk Road Shutdown&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In late 2013 Silk Road was shutdown. It was the biggest real world use case for Bitcoin at the time. Since it was the first dark web marketplace to accept Bitcoin and then subsequently was shut down. A lot of people believed that was it for Bitcoin on the dark web. nobody new that a bunch of copycats would emerge over the years to pick up the mantle. All they new was that Silk Road was gone and with it the biggest real world use case for Bitcoin was taken too.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Blocksize wars &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Satoshi had left the project in 2011 but by 2014 Bitcoin was really starting to feel the loss of its figurehead when it came to the block size debate. Satoshi&amp;#39;s word was almost like gospel back then. Anytime the blockchain needed an important decision or an emergency fix Satoshi was always there to lead the way. But now Satoshi had been gone for 3 years and the Block size debate was getting extremely divisive and personal.&lt;/p&gt;\n\n&lt;p&gt;Now I wont get into the benefits of both sides of the war since this post is about history and not technicals. But the main take away is that the community was divided in two and it was only going to get worse. leading to the Bitcoin Cash fork that split off half of the community. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Conclusion&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Add all this together with Bitcoin going down 90% from a high of 1k to a low of $100 then it seems like Bitcoin is bound to die... that is until it didn&amp;#39;t. The next halving cycle came and Bitcoin shot up to the infamous 20k of the 2017 Bull cycle before crashing down again. In conclusion, Bitcoin isn&amp;#39;t going anywhere. not from the 2018 crash, not from this crash, and not from the 2026 crash. If Bitcoin can survive 2014 then Bitcoin can survive anything.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/r8w8ms/if_bitcoin_can_survive_2014_then_nothing_can_kill/",
  "subreddit": "CryptoCurrency",
  "id": "r8w8ms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I first got into Bitcoin in December 2017 and quickly saw the awful collapse of\n2018 - 2020 Bear market. But during that time of January 2018 I really started\nto research Bitcoins history and technology and I really fell in love. Now this\npost wont be about the technology since we already have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2017年12月に初めてビットコインに手を出し、すぐにひどい崩壊を目の当たりにし\n2018年～2020年 ベアマーケット しかし、2018年1月のその時期に、私は本当に始めました。\nは、ビットコインの歴史と技術を研究し、私は本当に恋に落ちました。今、この\nこの記事では、技術的なことは書きません。",
      "title": "ビットコインが2014年を生き延びることができれば、何者もそれを殺すことはできない（特にこの小さなミニクラッシュではない）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我第一次进入比特币是在2017年12月，很快就看到了可怕的崩盘。\n2018 - 2020年的熊市。但在2018年1月的那段时间，我真正开始\n研究比特币的历史和技术，我真的爱上了。现在这\n帖子不会是关于技术的，因为我们已经有了...",
      "title": "如果比特币能在2014年存活下来，那么没有什么能杀死它（尤其是这次小规模的崩溃）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我第一次進入比特幣是在2017年12月，很快就看到了可怕的崩盤。\n2018 - 2020年的熊市。但在2018年1月的那段時間，我真正開始\n研究比特幣的歷史和技術，我真的愛上了。現在這\n帖子不會是關於技術的，因爲我們已經有了...",
      "title": "如果比特幣能在2014年存活下來，那麼沒有什麼能殺死它（尤其是這次小規模的崩潰）。"
    }
  ]
}