{
  "author": "eaglesfan8835",
  "original_created_utc": 1625012561,
  "title": "Never sell your Bitcoin?",
  "created_utc": 1625038574,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone, </p>\n\n<p>I just wanted to see what the overall consensus was on selling Bitcoin. The well-known Bitcoin advocate Mr. Michael Saylor has already stated that you should never sell your Bitcoin and that you should hold onto it for life. He argues that when you sell you&#39;re Bitcoin you&#39;re taxed, but if you hold onto it you can borrow against the Bitcoin (tax-free) at a decent interest rate. Platforms such as Block Fi offer this type of service. </p>\n\n<p>What do you guys think about this? If I double my investment during this next bull run it would be tempting not to sell a little bit for liquidity purposes. I do love Bitcoin and the direction it&#39;s going so I plan on investing in this for the long term regardless of short-term price fluctuations. </p>\n\n<p>Thanks</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/Bitcoin/comments/oal9ye/never_sell_your_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "oal9ye",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone,\n\nI just wanted to see what the overall consensus was on selling Bitcoin. The\nwell-known Bitcoin advocate Mr. Michael Saylor has already stated that you\nshould never sell your Bitcoin and that you should hold onto it for life. He\nargues that when you sell you're Bitcoin you're taxed,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は、ビットコインを売ることについての全体的なコンセンサスを確認したかったのです。よく知られている\n有名なビットコイン提唱者であるMichael Saylor氏は、すでにビットコインを売るべきではないと述べています。\nビットコインは絶対に売ってはいけないし、一生持ち続けるべきだと述べています。彼は\n彼は、ビットコインを売ると課税されると主張していますが...",
      "title": "ビットコインを売らない？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我只是想看看大家对出售比特币的总体共识是什么。著名的\n著名的比特币倡导者Michael Saylor先生已经说过，你永远不应该卖掉你的比特币，你应该终身持有它。\n不应该卖掉你的比特币，你应该终生持有它。他认为\n他认为，当你卖掉你的比特币时，你会被征税，...",
      "title": "从来不卖你的比特币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我只是想看看大家對出售比特幣的總體共識是什麼。著名的\n著名的比特幣倡導者Michael Saylor先生已經說過，你永遠不應該賣掉你的比特幣，你應該終身持有它。\n不應該賣掉你的比特幣，你應該終生持有它。他認爲\n他認爲，當你賣掉你的比特幣時，你會被徵稅，...",
      "title": "從來不賣你的比特幣？"
    }
  ]
}