{
  "author": "willyumn",
  "the_new_excerpt": "For context, I'm 22, make $25/hr but have pretty much no bills since I live with\nmy parents, so my risk tolerance is pretty high. I have about 55 shares of Tesla\nafter \"un-diversifying\" and selling all my other stock. I'm pretty much all in.\nI cannot find any other company that i can put my money in…",
  "original_created_utc": 1617320661,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我今年22岁，时薪25美元，但几乎没有账单，因为我和家人住在一起。\n我的父母，所以我的风险承受能力相当高。我有大约55股特斯拉\n在 \"解套 \"并卖掉其他所有股票后。我几乎是全身心的投入。\n我找不到任何其他公司 我可以把我的钱...",
      "title": "一万块钱应该放在哪里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年22歲，時薪25美元，但幾乎沒有賬單，因爲我和家人住在一起。\n我的父母，所以我的風險承受能力相當高。我有大約55股特斯拉\n在 \"解套 \"並賣掉其他所有股票後。我幾乎是全身心的投入。\n我找不到任何其他公司 我可以把我的錢...",
      "title": "一萬塊錢應該放在哪裏？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私は22歳で、時給25ドルですが、親と同居しているので、ほとんど請求書はありません。\n親と同居しているので、私のリスク許容度はかなり高いです。私はTeslaの株式を約55株持っています。\nの株を55株ほど持っていますが、他の株をすべて売って「分散化」した後です。かなりの量を持っています。\n他に資金を投入できる会社が見つかりません...。",
      "title": "1万円をどこに置くべきか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私は22歳で、時給25ドルですが、親と同居しているので、ほとんど請求書はありません。\n親と同居しているので、私のリスク許容度はかなり高いです。私はTeslaの株式を約55株持っています。\nの株を55株ほど持っていますが、他の株をすべて売って「分散化」した後です。かなりの量を持っています。\n他に資金を投入できる会社が見つかりません...。",
      "title": "1万円をどこに置くべきか？"
    }
  ],
  "title": "Where should I put $10k?",
  "created_utc": 1617371875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For context, I&#39;m 22, make $25/hr but have pretty much no bills since I live with my parents, so my risk tolerance is pretty high. I have about 55 shares of Tesla after &quot;un-diversifying&quot; and selling all my other stock. I&#39;m pretty much all in. I cannot find any other company that i can put my money in where growth is seemingly inevitable. I do own bitcoin but what are some equities that I can purchase over the next few months, or all at once with 10k cash? </p>\n\n<p>I have a tiny % of my portfolio in Oracle, Trimble, Crispr, Upstart, Square, Paypal, to give you an idea of what types of stocks I&#39;m attracted to. (data, fintech, autonomy). I&#39;m averse to companies with binary outcomes like bio, pharma, etc. Any interesting leads? :)</p>\n</div><!-- SC_ON -->",
  "score": 78,
  "permalink": "/r/stocks/comments/mi84qf/where_should_i_put_10k/",
  "subreddit": "stocks",
  "id": "mi84qf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878973
}