{
  "author": "Khriz-134",
  "the_new_excerpt": "I started dipping my toes into the stock market back in Feb when the whole craze\nblew up and it made me a small but good profit. All this time I only really\ninvested into companies that are big and everyone recognizes (Car manufacturers,\ncell phone companies, etc.) Where can I find information about…",
  "original_created_utc": 1620222225,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2月に株式市場に足を踏み入れました。\n少ないながらも利益を得ることができました。この間、私が実際に投資したのは\n私は今までずっと、誰もが知っているような大きな会社（自動車メーカー、携帯電話会社など）にしか投資していませんでした。\nどこに情報があるのでしょうか？",
      "title": "普通の一般人には知られていないような銘柄を知るにはどうしたらいいのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早在2月份整个热潮时，我就开始涉足股票市场。\n我在2月份开始涉足股票市场，当时整个热潮爆发，我从中赚取了少量但不错的利润。一直以来，我只真正地\n投资于那些大的、大家都认可的公司（汽车制造商。\n我在哪里可以找到关于...",
      "title": "有什么好办法可以了解那些不为普通人所知的股票。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2月份整個熱潮時，我就開始涉足股票市場。\n我在2月份開始涉足股票市場，當時整個熱潮爆發，我從中賺取了少量但不錯的利潤。一直以來，我只真正地\n投資於那些大的、大家都認可的公司（汽車製造商。\n我在哪裏可以找到關於...",
      "title": "有什麼好辦法可以瞭解那些不爲普通人所知的股票。"
    }
  ],
  "title": "What is a good way to learn about those stocks that aren't known to the normal average joe.",
  "created_utc": 1620230416,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started dipping my toes into the stock market back in Feb when the whole craze blew up and it made me a small but good profit. All this time I only really invested into companies that are big and everyone recognizes (Car manufacturers, cell phone companies, etc.) Where can I find information about those stocks that aren&#39;t necessarily small but its not known to the average joe. I&#39;m talking about those stocks that makes medicines or they make parts for a big company.</p>\n</div><!-- SC_ON -->",
  "score": 537,
  "permalink": "/r/stocks/comments/n5g8si/what_is_a_good_way_to_learn_about_those_stocks/",
  "subreddit": "stocks",
  "id": "n5g8si",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968358
}