{
  "author": "hoenndex",
  "original_created_utc": 1636482983,
  "title": "Why is there so much pressure to have a girlfriend and marry? Is it really wrong to be perpetually single?",
  "created_utc": 1636523077,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Early  (M) 30s here, never dated and perpetually single by choice. As time  goes by I noticed my family and friends are starting to get concerned  that I am single. My family keeps asking when I will have a girlfriend.  If they see a photo of me with one of my woman friends the first thing  they ask is if she is single. Friends do the same, one of them even  claimed I must be suffering from some sort of unacknowledged trauma if I  am not interested in dating.  </p>\n\n<p>Are they right? I am straight and do find women attractive, but I have  zero interest in dating or being in a relationship. It just seems like  so much work for little pay off. I haven&#39;t had any traumatic sexual or romantic experiences either. There are many things I rather do with  my time like hang out with friends or go to the movies or play games  than waste a day with some stranger pretending to woo her. It doesn&#39;t  appeal to me to waste my time like that after a long week of work. Am I  the weird one here?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/qqa53r/why_is_there_so_much_pressure_to_have_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "qqa53r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Early (M) 30s here, never dated and perpetually single by choice. As time goes\nby I noticed my family and friends are starting to get concerned that I am\nsingle. My family keeps asking when I will have a girlfriend. If they see a\nphoto of me with one of my woman friends the first thing they ask is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こちらは30代前半で、一度もデートをしたことがなく、自分の意思で永遠に独身です。時が経つにつれ\n家族や友人が私が独身であることを気にし始めていることに気づきました。\n独身であることを心配し始めていることに気づきました。家族は「いつになったら彼女ができるのか」と聞いてきます。もし彼らが、私が女性と一緒に写っている写真を見たら\n女性の友人と一緒に写っている写真を見ると、まず最初に聞くのは......。",
      "title": "恋人を作って結婚しなければならないというプレッシャーがあるのはなぜですか？いつまでも独身でいることは本当に悪いことなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里是30岁出头，从未约会过，因选择而永远是单身。随着时间的推移\n我注意到我的家人和朋友都开始担心我是\n单身。我的家人一直在问我什么时候能有个女朋友。如果他们看到\n我和我的一个女性朋友的照片，他们问的第一件事就是......",
      "title": "为什么有这么大的压力要交女朋友和结婚？永远单身真的有错吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏是30歲出頭，從未約會過，因選擇而永遠是單身。隨着時間的推移\n我注意到我的家人和朋友都開始擔心我是\n單身。我的家人一直在問我什麼時候能有個女朋友。如果他們看到\n我和我的一個女性朋友的照片，他們問的第一件事就是......",
      "title": "爲什麼有這麼大的壓力要交女朋友和結婚？永遠單身真的有錯嗎？"
    }
  ]
}