{
  "author": "rulesforrebels",
  "the_new_excerpt": "New Investors, first off congratulations, we can now really welcome you to the\ncommunity, you just rode out your first storm. I know people said things before\nwhen we'd have a 3% dip but this one was significant enough to rattle some folks\nto the bones.\n\nWhen Crypto is super volatile I'm often…",
  "original_created_utc": 1618918654,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新たな投資家の皆様、まずはおめでとうございます！皆様をコミュニティにお迎えすることができました。\n最初の嵐を乗り切ったところですね。最初の嵐を乗り越えましたね。\nしかし、今回の暴風雨は何人かの人々を骨の髄まで揺さぶるのに十分な大きさでした。\n骨の髄まで揺さぶられました。\n\n暗号が非常に不安定なとき、私はしばしば...",
      "title": "新規投資家の皆さん、おめでとうございます！初めての嵐を乗り切って、コインにFOMOしてはいけない理由を学びました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "新的投资者，首先祝贺你，我们现在可以真正欢迎你来到社区。\n社区，你刚刚度过了你的第一次风暴。我知道人们以前说过\n当我们有一个3%的跌幅时，但这一次的跌幅足以让一些人感到震惊\n到骨子里。\n\n当加密货币超级不稳定时，我经常...",
      "title": "新的投资者，恭喜你，刚刚骑出了你的第一场风暴，并了解到为什么你不要FOMO入币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "新的投資者，首先祝賀你，我們現在可以真正歡迎你來到社區。\n社區，你剛剛度過了你的第一次風暴。我知道人們以前說過\n當我們有一個3%的跌幅時，但這一次的跌幅足以讓一些人感到震驚\n到骨子裏。\n\n當加密貨幣超級不穩定時，我經常...",
      "title": "新的投資者，恭喜你，剛剛騎出了你的第一場風暴，並瞭解到爲什麼你不要FOMO入幣"
    }
  ],
  "title": "New Investors Congratulations, Just Rode Out Your First Storm, and Learned Why You Don't FOMO Into Coins",
  "created_utc": 1618938391,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>New Investors, first off congratulations, we can now really welcome you to the community, you just rode out your first storm. I know people said things before when we&#39;d have a 3% dip but this one was significant enough to rattle some folks to the bones.</p>\n\n<p>When Crypto is super volatile I&#39;m often reminded of the scene from the movie Blow where Ray Liotta playing George Jungs Dad takes him to the bank and they get foreclosed on. He tells George ie Young Johnny Depp...</p>\n\n<p>Sometimes you&#39;re flush and sometimes you&#39;re bust, and when you&#39;re up, it&#39;s never as good as it seems, and when you&#39;re down, you never think you&#39;ll be up again, but life goes on.</p>\n\n<p>The quote reminds me of crypto as when your up it seems like it&#39;s never going to stop and when your down it seems like things are never going to come back. It&#39;s always been funny to me how our psychology is ie people are falling over themselves to buy Bitcoin at 60k but scared to buy it when it crashes to 4k, the time you should be buying.</p>\n\n<p>I think the valuable lesson that comes out of this is sometimes it seems like things are surging and are never going to stop surging or are never going to come back down. It&#39;s very easy to FOMO into coins, to buy at prices that you know deep down went up too fast. </p>\n\n<p>The danger of doing this is oftentimes you&#39;ll go in too heavy at high prices and then have no powder left when prices correct a bit and you really should be buying.</p>\n\n<p>I think this kind of shows and teaches to not lose your head and go all on a surging bull market and to sit back and have some patience and discipline and wait to make your move.</p>\n\n<p>Does this recent pullback change how you guys look at markets or how you invest? Do you wish you had more powder in the keg right now to load up on some coins at cheap, well relatively cheap prices. In the grand scheme of things even with this pretty heavy pullback many coins are still at the price they were only a week or two ago, though a good buying opportunity none the less.</p>\n</div><!-- SC_ON -->",
  "score": 633,
  "permalink": "/r/CryptoCurrency/comments/muodue/new_investors_congratulations_just_rode_out_your/",
  "subreddit": "CryptoCurrency",
  "id": "muodue",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171523319
}