{
  "author": "Johnblr",
  "the_new_excerpt": "Wall Street bears battered by the Reddit crowd earlier this year have yet to\nregain their gumption, even with stocks at records and valuations near\ntwo-decade highs. The median short interest in members of the S&P 500 sits at\njust 1.6% of market value, near a 17-year low, according to Goldman Sachs…",
  "original_created_utc": 1618924548,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年初めにReddit群衆によって打ちのめされたウォールストリートの熊たちは、株価が史上最高のバリュエーションに達しているにもかかわらず、まだ勇気を取り戻していません。\n株価が過去最高になり、バリュエーションが20年ぶりの高水準になっても、ウォール街の熊はまだ勇気を取り戻していません。\n株価が記録的に上昇し、バリュエーションが20年ぶりの高水準になっているにもかかわらず、ウォールストリートのベアはまだ勇気を取り戻していません。S&P500銘柄の空売りの中央値は、市場価値のわずか1.6%です。\nゴールドマン・サックスによると、S&P500銘柄の空売りの中央値は、市場価値のわずか1.6％で、17年ぶりの低水準にあります。",
      "title": "ヘッジファンドが「頭をもぎ取られる」ことを望まないため、株式のショートショートが崩壊する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年早些时候被Reddit人群打击的华尔街熊孩子们还没有恢复他们的勇气。\n即使股票价格创下历史新高，估值接近\n二十年来的高点。标准普尔500指数成员的空头利益中位数为\n仅占市值的1.6%，接近17年的低点，根据高盛的数据...",
      "title": "没有对冲基金希望 \"头破血流\"，股票空头崩盘"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年早些時候被Reddit人羣打擊的華爾街熊孩子們還沒有恢復他們的勇氣。\n即使股票價格創下歷史新高，估值接近\n二十年來的高點。標準普爾500指數成員的空頭利益中位數爲\n僅佔市值的1.6%，接近17年的低點，根據高盛的數據...",
      "title": "沒有對沖基金希望 \"頭破血流\"，股票空頭崩盤"
    }
  ],
  "title": "Stock Shorts Collapse as No Hedge Fund Wants ‘Head Ripped Off’",
  "created_utc": 1618929061,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wall Street bears battered by the Reddit crowd earlier this year have yet to regain their gumption, even with stocks at records and valuations near two-decade highs. The median short interest in members of the S&amp;P 500 sits at just 1.6% of market value, near a 17-year low, according to Goldman Sachs Group Inc. In Europe, a short-covering frenzy has sent bearish bets collapsing like never before in Morgan Stanley data.</p>\n\n<p>At the same time, hedge-fund longs are around the highest relative levels in years at JPMorgan Chase &amp; Co.’s prime brokerage. They’re all signs of the bullish mania propelling global equities to fresh records this month, thanks to the economic re-opening and big policy stimulus. The smart money has little appetite to wager against either expensive or deadbeat companies -- especially after being lashed by the day-trader army earlier this year. “There’s just mass euphoria,” said Benn Dunn, president of Alpha Theory Advisors. “No one wants to get their head ripped off by a short anymore.”</p>\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2021-04-19/stock-shorts-collapse-as-no-hedge-fund-wants-head-ripped-off\">https://www.bloomberg.com/news/articles/2021-04-19/stock-shorts-collapse-as-no-hedge-fund-wants-head-ripped-off</a></p>\n</div><!-- SC_ON -->",
  "score": 4172,
  "permalink": "/r/stocks/comments/muq20f/stock_shorts_collapse_as_no_hedge_fund_wants_head/",
  "subreddit": "stocks",
  "id": "muq20f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527438
}