{
  "author": "AmazingJ_TV",
  "original_created_utc": 1624500923,
  "title": "how effective were the Soviet Union and other countries in the eastern bloc at eliminating homelessness?",
  "created_utc": 1624539951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think it&#39;s pretty safe to say that the state narrative of there being no homeless people in the USSR quickly fell apart under Glasnost and Perestroika. Being homeless was considered a crime but that wasn&#39;t enough to prevent it from spouting out in some places (especially towards the 80s). However, I&#39;ve spoken with a few Russian acquaintances and they all site the Khrushchyovka and urban planning projects as being remarkably successful at guaranteeing housing for much of the population. Considering the massive ongoing housing crisis in the US, it&#39;s worth delving into how successful commieblocks actually were at housing the Soviet Populace.</p>\n\n<p>&#x200B;</p>\n\n<p>so how effective were the Soviet Union and other Communist Regimes at eliminating homeless and guaranteeing housing for their populace? Was the homeless situation in the USSR at it&#39;s worse comparable to that of the United States today? or did public housing and other state programs do a better job at containing it than what we&#39;re seeing here today?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/o6rg64/how_effective_were_the_soviet_union_and_other/",
  "subreddit": "AskHistorians",
  "id": "o6rg64",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think it's pretty safe to say that the state narrative of there being no\nhomeless people in the USSR quickly fell apart under Glasnost and Perestroika.\nBeing homeless was considered a crime but that wasn't enough to prevent it from\nspouting out in some places (especially towards the 80s). However,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "がないという状態の物語は、かなり安全だと思います。\nソ連にはホームレスがいないという国家シナリオは、グラスノスチとペレストロイカの下ですぐに崩壊しました。\nホームレスであることは犯罪とみなされていましたが、それだけでは、いくつかの場所（特にロシア）で、ホームレスがいないという話が広まるのを防ぐことはできませんでした。\n特に80年代に入ってからは）。しかし、...",
      "title": "ソ連をはじめとする東欧諸国では、ホームレスをなくすためにどのような効果があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为可以很肯定地说，在苏联没有无家可归者的国家叙事在格拉斯诺和改革开放时期迅速瓦解。\n苏联没有无家可归者的说法在Glasnost和Perestroika下迅速瓦解。\n无家可归被认为是一种犯罪，但这并不足以阻止它在一些地方出现。\n在一些地方（尤其是在80年代），无家可归者被认为是一种犯罪，但这并不足以阻止它在一些地方出现（特别是在80年代）。然而，...",
      "title": "苏联和东部集团的其他国家在消除无家可归现象方面的成效如何？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲可以很肯定地說，在蘇聯沒有無家可歸者的國家敘事在格拉斯諾和改革開放時期迅速瓦解。\n蘇聯沒有無家可歸者的說法在Glasnost和Perestroika下迅速瓦解。\n無家可歸被認爲是一種犯罪，但這並不足以阻止它在一些地方出現。\n在一些地方（尤其是在80年代），無家可歸者被認爲是一種犯罪，但這並不足以阻止它在一些地方出現（特別是在80年代）。然而，...",
      "title": "蘇聯和東部集團的其他國家在消除無家可歸現象方面的成效如何？"
    }
  ]
}