{
  "author": "anthonyd3ca",
  "the_new_excerpt": "I began investing it the second half of 2020 and like most people, things were\ngoing very well until February hit.\n\nEveryone started saying “buy the dip” and “it’s on sale!” when a stock dropped\n4-5% and it sounded like a good idea to make back a quick 5% once the stock\nrecovered. However the dips…",
  "original_created_utc": 1620834096,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2020年の後半に投資を始めましたが、多くの人がそうであるように、物事はとてもうまくいっていました。\n2月に入るまでは非常にうまくいっていました。\n\n誰もが株が下がると「ディップを買え」「セールだ！」と言い始めました。\n株価が4～5％下がると、誰もが「ディップを買おう」「セールだ！」と言い始め、株価が回復すれば5％の利益をすぐに得られると考えたのです。\nと言っていた。しかし、このディップは...",
      "title": "ディップ」を買って得た教訓"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在2020年下半年开始投资，和大多数人一样，事情进行得非常顺利，直到2月份。\n进展非常顺利，直到2月到来。\n\n每个人都开始说 \"买跌 \"和 \"它在销售！\"当一只股票下跌时\n4-5%，听起来像是一个好主意，一旦股票回升，就可以迅速赚回5%。\n迅速赚回5%。然而，下跌的时候...",
      "title": "从买入 \"跌停板 \"中得到的教训。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在2020年下半年開始投資，和大多數人一樣，事情進行得非常順利，直到2月份。\n進展非常順利，直到2月到來。\n\n每個人都開始說 \"買跌 \"和 \"它在銷售！\"當一隻股票下跌時\n4-5%，聽起來像是一個好主意，一旦股票回升，就可以迅速賺回5%。\n迅速賺回5%。然而，下跌的時候...",
      "title": "從買入 \"跌停板 \"中得到的教訓。"
    }
  ],
  "title": "Lesson learned from buying “the dip”.",
  "created_utc": 1620846739,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I began investing it the second half of 2020 and like most people, things were going very well until February hit. </p>\n\n<p>Everyone started saying “buy the dip” and “it’s on sale!” when a stock dropped 4-5% and it sounded like a good idea to make back a quick 5% once the stock recovered. However the dips kept coming and every 5-8% drop I kept “buying the dip”.</p>\n\n<p>I now realized how 5-8% is barely a dip and I should’ve waited for at least a 10-15% drop in price before buying more. Now I’ve got little capital left to buy at these 30-50% drops from ATH and I just gotta weather the storm until (hopefully) these climb back up. Lesson learned.</p>\n\n<p>Edit: No need to be condescending folks. Obviously no one has a crystal ball but everyone has something they would’ve done differently if they could.</p>\n</div><!-- SC_ON -->",
  "score": 335,
  "permalink": "/r/stocks/comments/narq4c/lesson_learned_from_buying_the_dip/",
  "subreddit": "stocks",
  "id": "narq4c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996884
}