{
  "author": "Ironleg01",
  "the_new_excerpt": "Source: [censored, against the sub rules]\n\n\n\n * Earnings reports will dominate the action next week even as investors keep a\n   watch for any developments with an infrastructure package or capital gains\n   tax announcement. Conference calls from Tesla (NASDAQ**:TSLA**), Boeing\n   (NYSE:BA) and AMD…",
  "original_created_utc": 1619363575,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ソースは？[検閲、サブルール違反]\n\n\n\n * 来週は、投資家がインフラパッケージやキャピタルゲインの動向を注視しながらも、収益報告が行動の中心となるでしょう。\n   投資家は、インフラパッケージやキャピタルゲイン税の動向を注視しています。\n   税の発表もある。テスラ(NASDAQ**:TSLA**)、ボーイング(NYSE:BA)、AMDのカンファレンスコールは\n   (NYSE:BA)やAMD...",
      "title": "ウォールストリート・ブレックファスト The Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "来源：《中国新闻周刊》。[有删减，违反子规则] 。\n\n\n\n * 盈利报告将在下周的行动中占主导地位，即使投资者保持对基础设施方案或人均收入的任何进展的关注。\n   观察任何有关基础设施方案或资本利得税的发展。\n   税的公告。特斯拉(NASDAQ**:TSLA**)、波音(Boeing)和AMD的电话会议。\n   (NYSE:BA)和AMD...",
      "title": "华尔街早餐会。未来一周"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來源：《中國新聞週刊》。[有刪減，違反子規則] 。\n\n\n\n * 盈利報告將在下週的行動中占主導地位，即使投資者保持對基礎設施方案或人均收入的任何進展的關注。\n   觀察任何有關基礎設施方案或資本利得稅的發展。\n   稅的公告。特斯拉(NASDAQ**:TSLA**)、波音(Boeing)和AMD的電話會議。\n   (NYSE:BA)和AMD...",
      "title": "華爾街早餐會。未來一週"
    }
  ],
  "title": "Wall Street Breakfast: The Week Ahead",
  "created_utc": 1619374645,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Source: [censored, against the sub rules]</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li>Earnings  reports will dominate the action next week even as investors keep a  watch for any developments with an infrastructure package or capital  gains tax announcement. Conference calls from Tesla (NASDAQ**:TSLA**), Boeing <strong>(NYSE:BA</strong>) and AMD (NASDAQ**:AMD**)  will be of high interest. Economic reports due in the week ahead  include updates on durable goods orders, pending home sales and GDP.</li>\n<li>Earnings season heats up in a big way with reports due in from Albertsons (NYSE:<strong>ACI</strong>), Tesla (<strong>TSLA</strong>) and NXP Semi (NASDAQ:<strong>NXPI</strong>) on April 26; BP (NYSE:<strong>BP</strong>), UPS (NYSE:<strong>UPS</strong>), General Electric (NYSE:<strong>GE</strong>), Alphabet (NASDAQ:<strong>GOOG</strong>), Microsoft (OTCPK:<strong>MFST</strong>) and Starbucks (NASDAQ:<strong>SBUX</strong>) on April 27; Humana (NYSE:<strong>HUM</strong>), Boeing (<strong>BA</strong>), Apple (NASDAQ:<strong>AAPL</strong>), Ford (NYSE:<strong>F</strong>), Qualcomm (NASDAQ:<strong>QCOM</strong>) and General Dynamics (NYSE:<strong>GD</strong>) on April 28; Comcast (NASDAQ:<strong>CMCSA</strong>), Merck (NYSE:<strong>MRK</strong>), Caterpillar (NYSE:<strong>CAT</strong>), Northrop Grumman (NYSE:<strong>NOC</strong>), Amazon (NASDAQ:<strong>AMZN</strong>), Nio (NYSE:<strong>NIO</strong>) and U.S. Steel (NYSE:<strong>X</strong>) on April 29; as well as Exxon Mobil (NYSE:<strong>XOM</strong>), Chevron (NYSE:<strong>CVX</strong>) and AbbVie (NYSE:<strong>ABBV</strong>) on April 30.</li>\n<li>The latest vibe from Wall Street analysts is that Tesla (<strong>TSLA</strong>)  has a good chance to top consensus estimates for Q1 revenue of $10.5B  and EPS of $0.75 after factoring in the strong Q1 delivery numbers.  &quot;While Tesla has navigated a myriad of Chinese government PR issues,  chip shortages, and a further spotlight on its auto pilot safety record  (given the Texas crash) over the past month, the Street is now laser  focused on gauging the annual delivery trajectory for 2021,&quot; previews  analyst Dan Ives. The conference call set for April 26 at 4:30 p.m.  takes on some added significance with the news flow working against  Tesla over the last week.</li>\n<li>Apple (<strong>AAPL</strong>)  is seen generating revenue of $77B and EPS of $0.98 in Q1. Analysts are  watching for indications that the company&#39;s strong services sales  growth has continued in Q2 quarter and that the pandemic boost in demand  for iPads and Macs has continued. Apple is also expected to increase  its dividend payout and boost its buyback allowance. After Apple turns  the page on Q1, investors will start looking to analyze how the iPhone  13 launch will factor in to the back half of the year.</li>\n<li>Microsoft (NASDAQ:<strong>MSFT</strong>)  is tipped by Wedbush Securities for another beat and raise quarter. &quot;We  strongly believe the tide is shifting in the cloud arms race as  Microsoft should deliver a ~45% Azure growth number this quarter and is  clearly taking market share vs. AWS based on our analysis. While we have  seen the momentum of this backdrop in the last few quarters, we believe  deal flow looks strong heading into the rest of FY21 and FY22 as we  estimate that Microsoft in particular is still only ~35% through  penetrating its unparalleled installed base on the cloud transition,&quot;  updates analyst Dan Ives.</li>\n<li>IPOs expected to start trading next week include FTC Solar (FTCI) on April 28 and both Endeavor Group (NYSE:EDR) and Fortegra Group (FRF) on April 29. IPO lockup periods are set to expire next week [censored, against the sub rules]</li>\n<li><strong>Projected dividend increases (quarterly):</strong> Expected dividend hikes for next week include Masco (NYSE:MAS) to $0.235 from $0.14, St Joe (NYSE:JOE) to $0.09 from $0.08, Tetra Tech (NYSE:TTI) $0.19 from $0.17, American Water (NYSE:AWK) to $0.60 from $0.55, Comfort Systems USA (NYSE:FIX) to $0.125 from $0.115, Ameriprise Financial (NYSE:AMP) to $1.11 from $1.04, Invesco (NYSE:IVZ) to $0.165 from $0.155, HP Enterprise (NYSE:HPE) to $0.1275 from $0.12 and Apple (AAPL) to $0.2175 from $0.205.</li>\n<li>On  the topic of dividends, UBS ran a deep screen for some dividend  favorites. A list of 16 stocks was generated based off a filter of  Buy-rated stocks with three-year dividend growth rate forecast at least  at a high single digit rate, with a current dividend yield that beats  the S&amp;P&#39;s yield, sustainable payout ratios and sitting with more  than 10% potential upside to price targets. On that list the fastest  dividend growth was projected for Barrick (NYSE<strong>GOLD</strong>), East West Bancorp (NASDAQ:<strong>EWBC</strong>), and Royalty Pharma (NASDAQ:<strong>RPRX</strong>) and the lowest payout ratios (suggesting the greatest ability to pay) were at Sealed Air (NYSE:<strong>SEE</strong>), Royalty Pharma (<strong>RPRX</strong>) and East West Bancorp (<strong>EWBC</strong>). The highest yielding names in the screen included Merck (<strong>MRK</strong>), American Electric Power (NASDAQ:<strong>AEP</strong>) and Sempra (NYSE:<strong>SRE</strong>).</li>\n<li>A pre-hearing conference will by held by the New Mexico Public Regulation Commission in regard to the PNM Resources (NYSE:PNM)-Avangrid (NYSE:AGR) merger. The companies have already landed several different approvals include from FERC. CoreLogic (NYSE:CLGX) shareholders vote on the buyout offer from Stone Point on April 28. Cooper Tire &amp; Rubber (NYSE:CTB) shareholders vote on the Goodyear Tire &amp; Rubber (NASDAQ:GT) merger on April 30. FactSet Research (NYSE:FDS) trades with takeover rumors swirling around it.</li>\n<li>I-Mab (NASDAQ:IMAB) hosts its 2021 R&amp;D Day on April 26. Executives from Facebook (NASDAQ:FB), Twitter (NYSE:TWTR) and YouTube (GOOG) testify in front of a Senate Judiciary hearing covering algorithmic amplification on April 27. Atlassian (NASDAQ:TEAM)  Co-CEO and founder Mike Cannon-Brookes gives a talk at the company&#39;s  Team 21 event on April 28 that it hopes will draw attention to the  company&#39;s new innovations.</li>\n<li>Wayfair (NYSE:W)  holds its two-day deals event on April 28-29. The Way Day shopping  event includes deals and promotions on best-selling items across the  whole home including furnishings, decor, housewares, home improvement  products, major appliances, outdoor and more. Shares of Wayfair are up  41% YTD and 232% over the last 52 weeks.</li>\n<li>The NFL draft begins  the evening of April 29 and is a bettable event in more states than ever  as legislation continues to advance in more states. New Gatorade  (NASDAQ:PEP)  endorser Trevor Lawrence is expected to go the Jacksonville Jaguars as  the number one overall pick. The draft follows a big week for sports  betting/iGaming stocks like DraftKings (NASDAQ:DKNG) and Penn National Gaming after BetMGM&#39;s investor event pushed up expectations for the total addressable market.</li>\n<li><strong>GamesBeat Summit 2021:</strong> The event gathers videogame industry players (virtually)  April 28-29 with a special focus on diversity, inclusion and mental  health challenges, as part of its larger theme of what will keep gaming  growing. Notable sessions will include Phil Spencer, executive VP of  gaming at Microsoft (MSFT), who is joined by his team for &quot;Team Xbox on Gaming for Everyone&quot;; Activision Blizzard (NASDAQ:ATVI) CEO Bobby Kotick and AMD&#39;s (AMD) Frank Azor each talking about gaming&#39;s post-pandemic world; and representatives from Electronic Arts (NASDAQ:EA), Playtika (NASDAQ:PLTK), NetEase (NASDAQ:NTES), Tencent (OTCPK:TCEHY), Roblox (NYSE:RBLX) and Sony (NYSE:SONY).</li>\n<li><strong>Conferences rundown:</strong>  Notable conferences running during the week include the Chardan  Manufacturing Summit, H.C. Wainwright &amp; Co. Cryptocurrency,  Blockchain &amp; FinTech Conference, Kempen Life Science Conference and  B. Riley Neuroscience Conference.</li>\n<li>Food  stocks catch the attention of the publication with more people heading  back to the office, to schools and to restaurants. Hershey (NYSE:HSY), Mondelez International (NASDAQ:MDLZ), Conagra Brands (NYSE:CAG), J.M. Smucker (NYSE:SJM), Hostess Brands (NASDAQ:TWNK), Kraft Heinz (NASDAQ:KHC), General Mills (NYSE:GIS), Kellogg (NYSE:K) and Campbell Soup (NYSE:CPB)  are called the leading food stocks with their lean valuations and  secure dividends comparing nicely to other sectors. Perrigo (NYSE:PRGO)  is tipped to see a turnaround. The company is seen moving past its  legal risks and its valuation is seen rising as investors get more  comfortable with the new growth profile. Meanwhile, Moderna (NASDAQ:MRNA) is called more than a one-hit wonder with strong sales seen for years.</li>\n</ul>\n\n<h1>Seeking Alpha Catalyst Watch</h1>\n\n<p>&#x200B;</p>\n\n<p><strong>Monday - April 26</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Volatility watch -</strong> Stocks with a high level of volatility implied by options trading include [censored, against the sub rules]. Names with an elevated level of short interest heading into next week include [censored, against the sub rules].</li>\n<li><strong>All week -</strong>  Notable conferences running during the week include the Chardan  Manufacturing Summit, H.C. Wainwright &amp; Co. Cryptocurrency,  Blockchain &amp; FinTech Conference, Kempen Life Science Conference and  B. Riley Neuroscience Conference.</li>\n<li><strong>All week -</strong>  The Nevada Gaming Control Board is due to release its March gaming win  report sometime during the week. The state&#39;s casinos are expected to  post sequential progress. States that have already reported gross gaming  revenue numbers for March have posted strong results, including records  being set in Maryland, Ohio, Missouri and Iowa. Looking ahead, the  Governor of Nevada has announced plans to have casinos in the state be  operating at 100% by summer, which bodes well for MGM Resorts (NYSE:MGM), Boyd Gaming (NYSE:BYD), Caesars Entertainment (NASDAQ:CZR) and Red Rock Resorts (NASDAQ:RRR).</li>\n<li><strong>All day -</strong> The IPO lockup period on Root (NASDAQ:ROOT)  expires on April 26. Short interest on Root is at over 40% of total  float. Just to make things really interesting, noted short seller Citron  is long on Root. Also watch Biodesiz (NASDAQ:BDSX), Gatos Silver (NYSE:GATO) and MediaAlpha (NYSE:MAX) with their IPO lockups ending. Meanwhile, the quiet period expires on Frontier (NASDAQ:ULCC), Coursera (NYSE:COUR), Compass (NYSE:COMP), Karooooo (NASDAQ:KARO) and Smart Share (NASDAQ:EM) - which will free up analysts to post ratings.</li>\n<li><strong>8:00 a.m.</strong> I-Mab (NASDAQ:IMAB)  hosts its 2021 R&amp;D Day. The presentations from execs will provide  an in-depth breakdown of the company&#39;s key pipeline programs, research  and development strategy, as well as a progress update on I-Mab&#39;s  transformation into a fully integrated global biopharma company. Shares  of IMAB jumped more than 3% after an investor presentation last fall.</li>\n<li><strong>10:20 a.m.</strong>  Dow (NYSE:DOW)  CEO Jim Fitterling will make an appearance at the Bloomberg Green  Summit to discuss why green is good for business. Later in the day,  QuantumScape (NYSE:QS) CEO Jagdeep Singh is a featured speaker.</li>\n<li><strong>1:45 p.m.</strong> Execs with MeiraGTx Holdings plc (NASDAQ:MGTX) participate in a fireside chat at the Chardan Virtual Genetic Medicines Manufacturing Summit.</li>\n<li><strong>5:30 p.m.</strong> Tesla (NASDAQ:TSLA)  holds its earnings call with drama ratcheted up a bit amid new safety  concerns on Autopilot and some recent backlash in China. Analysts and  investors will also be looking for an update from Elon Musk and gang on  the company&#39;s full-year deliveries target.</li>\n</ul>\n\n<p><strong>Tuesday - April 27</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>All day -</strong> The FDA action date arrives for Protalix BioTherapeutics (NYSEMKT:PLX)  on the priority review of Pegunigalsidase alfa (PRX-102) for Fabry  disease. Shares of Protalix Bio rallied in February when positive data  was released by the company.</li>\n<li><strong>8:00 a.m.</strong>  Cyclerion Therapeutics (NASDAQ:CYCN)  hosts a webinar with a live Q&amp;A. The company will provide a  corporate update on clinical programs for its CY6463 therapy used in  Alzheimer&#39;s Disease with Vascular pathology. Cyclerion will discuss the  potential for CY6463 to treat Cognitive Impairment Associated with  Schizophrenia. Phase 2 top-line data is due in the middle part of the  year.</li>\n<li><strong>10:00 a.m.</strong> [censored, against the sub rules]</li>\n<li><strong>10:00 a.m.</strong> Executives from Facebook (NASDAQ:FB), Twitter (NYSE:TWTR) and YouTube (NASDAQ:GOOG)  testify in front of a Senate Judiciary hearing covering algorithmic  amplification. The original plan was to bring in chief executives to  discuss algorithms, but the testimony will come from executives closer  to policymaking on the issue.</li>\n<li><strong>10:30 a.m.</strong> Top execs with Solid Biosciences (NASDAQ:SLDB)  will participate in a virtual fireside chat at the Chardan 5th Annual  Genetic Medicines Manufacturing Summit. SVB Leerink has an aggressive  price target of $15 (194% upside) on SLDB based on its positive view on  the upside for SGT-001.</li>\n<li><strong>11:00 a.m.</strong> The two-day Adobe (NASDAQ:ADBE) Summit event kicks off with keynotes addresses from FedEx (NYSE:FDX) COO Raijesh Subramaniam, Pfizer (NYSE:PFE) CEO Albert Bourla and Adobe CEO Shantanu Narayen.</li>\n<li><strong>5:00 p.m.</strong> Intel (NASDAQ:INTC) will be on watch when AMD (NASDAQ:AMD)  execs hold their post-earnings conference call. Color from AMD on  demand and pricing could highlight again the competitive pressure being  felt by Intel with datacenter market share. &quot;<em>Intel is set for a very  challenging 2-3 years in terms of share loss, margin pressure, and  heightened execution risk by juggling many more balls in the air than  ever before</em>,&quot; warns Rosenblatt Securities.</li>\n</ul>\n\n<p><strong>Wednesday - April 28</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>All day -</strong>   The two-day GamesBeat Summit begins in a digital format. The event is  expected to cover some of the next-gen plans for the gaming industry.  Notable speakers include Microsoft&#39;s (NASDAQ:MSFT) top Xbox exec, as well as the CEOs of Playtika (NASDAQ:PLTK) and Activision Blizzard (NASDAQ:ATVI).</li>\n<li><strong>All day -</strong>   OPEC and its allies hold a full ministerial meeting. The opening  session is scheduled to include remarks from Saudi oil minister Prince  Abdulaziz bin Salman, Russian Deputy Prime Minister Alexander Novak and  Angolan Oil Minister Diamantino Pedro Azevedo. The meeting is expected  to be largely technical without major changes to policy, but comments  coming out of the meeting on a potential NOPEC bill in the U.S. could be  impact trading.</li>\n<li><strong>10:00 a.m.</strong> Trillium Therapeutics (NASDAQ:TRIL)  holds a R&amp;D Day to provide a data update for TTI-622 and TTI-621,  including data for the 18 mg/kg and 2 mg/kg dose cohorts. The company is  also expected to announce key strategic priorities in terms of target  indications and drug combinations across hematologic malignancies and  solid tumors. Ahead of the event, Benchmark initiated Trillium  Therapeutics with a Buy rating and a price target of $21 (120% upside).</li>\n<li><strong>12:00 p.m.</strong> Atlassian (NASDAQ:TEAM)  Co-CEO and founder Mike Cannon-Brookes gives a talk at the company&#39;s  Team 21 event that it hopes will draw attention to the company&#39;s new  innovations. Zoom Video (NASDAQ:ZM) CEO Eric Yuan and Slack Technologies (NYSE:WORK) CEO Stewart Butterfield are also scheduled to give talks at the virtual event on the modern work environment.</li>\n<li><strong>2:00 p.m.</strong>  The Fed&#39;s FOMC announcement is due to be made. Economists expect some  changes in the assessment of the economy in the first paragraph of the  statement in order for the central bank to flag the better growth data  with gains in COVID-sensitive sectors, while still emphasizing that the  improvement is just beginning. The language around the transitory  strength in inflation will also be watched closely.</li>\n<li><strong>2:30 p.m.</strong> Federal Reserve Chairman Jerome Powell holds a press conference.</li>\n</ul>\n\n<p><strong>Thursday - April 29</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>All day -</strong>  The FDA action date on the review of Ardelyx&#39; (NASDAQ:ARDX)  Tenapanor for chronic kidney disease on dialysis arrives. Seeking Alpha  author Avisol Capital Partners is bullish on ARDX ahead of the FDA  decision.</li>\n<li><strong>Premarket -</strong>  Options trading implies large swings for 1-800-Flowers.com (NASDAQ:FLWS), Tempur-Sealy International (NYSE:TPX) and Realogy Holdings Corp (NYSE:RLGY)  after the companies report earnings. All three stocks are indicated to  swing between 9% and 10% (up or down) after the numbers hit.</li>\n<li><strong>7:30 a.m.</strong>  The advance release of Q1 U.S. GDP arrives. Bank of America expects an  acceleration in real growth to a robust 6.5% Q/Q pace, up from 4.1% in  Q4 of last year. &quot;Consumer spending likely surged this quarter by 11%,  boosted by the multiple shots to the arm from December stimulus, March  stimulus, and the COVID-19 vaccine which has allowed for greater  reopening in the economy. There is likely to be strength among many  other components of real activity with both residential and equipment  investment in particular seeing double digit annualized growth, and  government spending and intellectual property investment up solidly,&quot;  previews BofA.</li>\n<li><strong>1:30 p.m.</strong> Top execs with MediciNova(NASDAQ:MNOV)  will participate in a fireside chat hosted by B. Riley. The discussion  will cover MediciNova&#39;s development of MN-166 (ibudilast) for  neurological conditions. Shares of MediciNova soared last month after  the company announced a development agreement with the Biomedical  Advanced Research and Development Authority for MN-166.</li>\n<li><strong>Postmarket -</strong>  Amazon (NASDAQ:AMZN) is due to report earnings. Keep an eye on Summer Infant (NASDAQ:SUMR). The company derives 33% of its revenue from Amazon and moves in tandem with it the week after earnings 88% of the time.</li>\n</ul>\n\n<p><strong>Friday - April 30</strong></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>All day -</strong>  Clorox (NYSE:CLX) and Colgate-Palmolive (NYSE:CL)  both report earnings amid heightened interest in how the companies lap  the tough pandemic comparables and management updates on pricing vs.  commodity costs. Options trading on the two stock implies a  post-earnings move up or down of around 4%.</li>\n<li><strong>All day -</strong>  It may be time to watch Airbnb (NASDAQ:ABNB)  for increased volatility with another series of lockups expiring in  early May. 80% of A-shares (20% of total) will come unlocked two days  following the company&#39;s upcoming Q1 report.  All B-class shares held  primarily by management and VCs are subject to Rule 144 and would also  be available to sell at this time if registered. Short interest on  Airbnb is also at about 15% of total float.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 644,
  "permalink": "/r/stocks/comments/mya94l/wall_street_breakfast_the_week_ahead/",
  "subreddit": "stocks",
  "id": "mya94l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776215987
}