{
  "author": "Golo_red",
  "original_created_utc": 1635318096,
  "title": "We should not just stay in our own bubble -- engage with no-coiners!",
  "created_utc": 1635374176,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is an article in <a href=\"/r/technology\">r/technology</a> that made it to <a href=\"/r/all\">r/all</a>. <strong>Bitcoin is largely controlled by a small group of investors and miners, study finds.</strong> Now every time bitcoin or crypto is mentioned in another sub it feels like there are no proponents of bitcoin. Even though depending on the geography and the study, around (or up to) 20% of people hold bitcoin or a planning to acquire it. </p>\n\n<p>We are a sub with a few million members and <a href=\"/r/cc\">r/cc</a> is a sub with a few million members but as soon as someone cross-posts an article like this, the post is getting downvoted as FUD. While it may be FUD, such crossposts are still relevant: the point is that we need to engage with other communities / no-coiners in order to get heard. It is very frustrating to see what uneducated comments are getting thousands of upvotes on <a href=\"/r/technology\">r/technology</a> almost without any crypto enthusiasts trying to give context or educate. We cannot just stay in our own bubble and be our own echo chamber. We need to engage!</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/qgqp9e/we_should_not_just_stay_in_our_own_bubble_engage/",
  "subreddit": "Bitcoin",
  "id": "qgqp9e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There is an article in r/technology [/r/technology] that made it to r/all\n[/r/all]. Bitcoin is largely controlled by a small group of investors and\nminers, study finds. Now every time bitcoin or crypto is mentioned in another\nsub it feels like there are no proponents of bitcoin. Even though…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/technology [/r/technology]にある記事がr/allに進出してきました。\n[/r/all]に掲載されました。ビットコインは少数の投資家とマイナーによって大きくコントロールされている。\n研究で判明しました。今、ビットコインやcryptoが他の\n他のサブサイトでビットコインや暗号について言及されるたびに、ビットコインの支持者がいないように感じます。たとえ...",
      "title": "自分たちだけの世界に閉じこもるのではなく、ノーコインの人たちとも交流していきましょう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在r/technology [/r/technology]中有一篇文章，它进入了r/all\n[/r/all]。比特币在很大程度上是由一小部分投资者和矿工控制的。\n矿工控制，研究发现。现在，每当在另一个子上提到比特币或加密货币时\n子，就感觉没有比特币的拥护者。即使...",
      "title": "我们不应该只停留在自己的泡沫中--与无币者接触！我们应该与无币者接触。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/technology [/r/technology]中有一篇文章，它進入了r/all\n[/r/all]。比特幣在很大程度上是由一小部分投資者和礦工控制的。\n礦工控制，研究發現。現在，每當在另一個子上提到比特幣或加密貨幣時\n子，就感覺沒有比特幣的擁護者。即使...",
      "title": "我們不應該只停留在自己的泡沫中--與無幣者接觸！我們應該與無幣者接觸。"
    }
  ]
}