{
  "author": "ratshow",
  "the_new_excerpt": "Who didn’t see this coming? I think Amazon is next honestly. The new\nadministration is gonna have hella antitrust lawsuits and new laws coming out\nthat are gonna cripple the big bois imo.\n\n> almost every state in the nation has joined the bipartisan lawsuit, \"because\n> Facebook’s efforts to dominate…",
  "original_created_utc": 1607546906,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "谁没料到会这样呢？老实说，我认为亚马逊是下一个。新的\n政府将会有反垄断诉讼和新的法律出台\n会让大公牛们瘫痪的国际海事组织。\n\n>美国几乎每个州都加入了这场两党诉讼，“因为\n>脸书主宰…的努力",
      "title": "Facebook遭到联邦贸易委员会和48个州总检察长的反垄断诉讼"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "誰沒料到會這樣呢？老實說，我認爲亞馬遜是下一個。新的\n政府將會有反壟斷訴訟和新的法律出臺\n會讓大公牛們癱瘓的國際海事組織。\n\n>美國幾乎每個州都加入了這場兩黨訴訟，“因爲\n>臉書主宰…的努力",
      "title": "Facebook遭到聯邦貿易委員會和48個州總檢察長的反壟斷訴訟"
    }
  ],
  "title": "Facebook hit with antitrust lawsuit from FTC and 48 state attorneys general",
  "created_utc": 1607945298,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Who didn’t see this coming? I think Amazon is next honestly. The new administration is gonna have hella antitrust lawsuits and new laws coming out that are gonna cripple the big bois imo.</p>\n\n<blockquote>\n<p>almost every state in the nation has joined the bipartisan lawsuit, &quot;because Facebook’s efforts to dominate the market were as illegal as they were harmful.&quot; The separate FTC lawsuit alleged that the company illegally maintained its &quot;monopoly&quot; through years of anticompetitive practices.</p>\n\n<p>The FTC suit seeks a permanent injunction in federal court that could require Facebook to sell off Instagram and WhatsApp. It is also seeks Facebook giving notice and gaining approval for future mergers and acquisitions as well as end its alleged anticompetitive conditions for software developers.</p>\n</blockquote>\n\n<p><a href=\"https://abcnews.go.com/Business/facebook-hit-antitrust-lawsuit-ftc-48-state-attorneys/story?id=74623634\">https://abcnews.go.com/Business/facebook-hit-antitrust-lawsuit-ftc-48-state-attorneys/story?id=74623634</a></p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/stocks/comments/ka0brs/facebook_hit_with_antitrust_lawsuit_from_ftc_and/",
  "subreddit": "stocks",
  "id": "ka0brs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260493099
}