{
  "author": "Fizzlebang_Wonderpop",
  "original_created_utc": 1637499346,
  "title": "ETH Billionaire has had enough of ETH",
  "created_utc": 1637513704,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Three Arrows Capital CEO</strong> Su Zhu <strong>berated Ethereum and its community in a scathing tweet.</strong>   </p>\n\n<blockquote>\n<p>Yes I have abandoned Ethereum despite supporting it in the past.  Yes Ethereum has abandoned its users despite supporting them in the past.  The idea of sitting around jerking off watching the burn and concocting purity tests, while zero newcomers can afford the chain, is gross. </p>\n</blockquote>\n\n<p>Source: Tweet</p>\n\n<p>The sentiment to ETH on this sub has changed over the past few months, with some posts recently all out attacking it.  Transaction fees and gas fees are so high that it is impractical to use it as a day to day currency.</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/CryptoCurrency/comments/qyuemh/eth_billionaire_has_had_enough_of_eth/",
  "subreddit": "CryptoCurrency",
  "id": "qyuemh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Three Arrows Capital CEO Su Zhu berated Ethereum and its community in a scathing\ntweet.\n\n> Yes I have abandoned Ethereum despite supporting it in the past. Yes Ethereum\n> has abandoned its users despite supporting them in the past. The idea of\n> sitting around jerking off watching the burn and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スリー・アローズ・キャピタルのCEOであるSu Zhuは、イーサリアムとそのコミュニティを痛烈に非難しました。\nツイートしました。\n\n> 過去にイーサリアムをサポートしていたにもかかわらず、私はイーサリアムを放棄しました。Yes Ethereum\n> 過去にサポートしていたにもかかわらず、ユーザーを見捨てた。という考えは\n> 燃えているのを見て自慰行為をして座っていると...",
      "title": "ETH億万長者はETHに飽きている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "三箭资本首席执行官Su Zhu在一条尖锐的推文中痛斥以太坊及其社区。\n推文中痛斥以太坊及其社区。\n\n> 是的，我已经放弃了以太坊，尽管在过去支持它。是的，以太坊\n>已经抛弃了它的用户，尽管在过去支持他们。的想法。\n> 坐在一旁打飞机看着烧钱和...",
      "title": "ETH的亿万富翁已经受够了ETH"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "三箭資本首席執行官Su Zhu在一條尖銳的推文中痛斥以太坊及其社區。\n推文中痛斥以太坊及其社區。\n\n> 是的，我已經放棄了以太坊，儘管在過去支持它。是的，以太坊\n>已經拋棄了它的用戶，儘管在過去支持他們。的想法。\n> 坐在一旁打飛機看着燒錢和...",
      "title": "ETH的億萬富翁已經受夠了ETH"
    }
  ]
}