{
  "author": "Jayyykobbb",
  "original_created_utc": 1626497720,
  "title": "Do any philosophers touch on not giving into pessimism and cynicism (in the modern sense)? Would y’all recommend any particular works, essays, books, or anything for this?",
  "created_utc": 1626555751,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I’m getting older into my mid 20’s, I’m finding myself becoming increasingly pessimistic about politics, the state of the world, the state of humanity as a collective group, and other things. I’ve always considered myself to be overly positive and optimistic. </p>\n\n<p>Much of it seems to be based in ideals I hold. For example, I find myself thinking, “If only people could be like this” or “If only these politicians thought this way”. I have practical ideas, as in they’re not crazy or far off and could reasonably seen as being helpful, but I don’t expect or think they’d be implemented anytime soon given the political and social climate around me. </p>\n\n<p>I’ve been trying to figure out how to turn my “pessimism” into something more positive or at least constructive. Whether that be in a personal, mental way or in a real-world, practical way.  I feel like this is a pretty common feeling. I think reading Vonnegut and Pratchett have helped some. They were pretty strong and convicted on their opinions and ideals and recognized issues in the world. They seemingly weren’t turned into cynical people, at least permanently or for long periods.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/olxqsc/do_any_philosophers_touch_on_not_giving_into/",
  "subreddit": "askphilosophy",
  "id": "olxqsc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As I’m getting older into my mid 20’s, I’m finding myself becoming increasingly\npessimistic about politics, the state of the world, the state of humanity as a\ncollective group, and other things. I’ve always considered myself to be overly\npositive and optimistic.\n\nMuch of it seems to be based in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "20代半ばになると、政治、世界情勢、人類のあり方などについて、ますます悲観的になってきました。\n政治、世界情勢、人類のあり方などについて悲観的になってきています。\n集団としての人類のあり方などについて悲観的になってきています。私はこれまで、自分のことを過剰にポジティブで楽観的な人間だと思ってきました。\n楽観的であると思っていました。\n\nそれは、多くの場合、...",
      "title": "現代的な意味でのペシミズムやシニシズムに陥らないことについて触れている哲学者はいますか？また、そのためにおすすめの作品やエッセイ、本などがあれば教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着我逐渐长大，进入20岁左右，我发现自己变得越来越\n我发现自己对政治、世界的状况、人类作为一个集体的状况以及其他事情越来越悲观。\n和其他事情。我一直认为自己是一个过于积极和\n积极和乐观的。\n\n它的大部分似乎是基于...",
      "title": "是否有哲学家触及不屈服于悲观主义和犬儒主义（在现代意义上）？你们是否会为此推荐任何特定的作品、论文、书籍或其他东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着我逐漸長大，進入20歲左右，我發現自己變得越來越\n我發現自己對政治、世界的狀況、人類作爲一個集體的狀況以及其他事情越來越悲觀。\n和其他事情。我一直認爲自己是一個過於積極和\n積極和樂觀的。\n\n它的大部分似乎是基於...",
      "title": "是否有哲學家觸及不屈服於悲觀主義和犬儒主義（在現代意義上）？你們是否會爲此推薦任何特定的作品、論文、書籍或其他東西？"
    }
  ]
}