{
  "author": "tonystarkco",
  "original_created_utc": 1625993929,
  "title": "How to help a tiny village ?",
  "created_utc": 1626056640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all,</p>\n\n<p>my mother&#39;s village is located somewhere in South Europe (at 1100m altitude) and has a great history. Around 1940 it has about 450 residents, but nowadays it counts less than 100 people, most of them coming only in Summer.</p>\n\n<p>The house owners are mostly poor and any of them that aren&#39;t, the money they can provide are not enough to give this place an &quot;economic boost&quot;. They are busy maintaining their ancestors&#39; houses which are built around 1900s.</p>\n\n<p>The place is breathtaking, it&#39;s a total beauty on the top of a mountain with very rich flora and fauna. Unfortunately, since the majority doesn&#39;t live there nowadays except a few people, they don&#39;t produce something to advertise and sell. They also have a museum.</p>\n\n<p>I want to help them but don&#39;t know how. My toolset is my 13 year skills in computer science (programming, networks, operating systems) and my brain. I honestly don&#39;t care about earn a single $/€. I just want the history of my ancestors to survive and for more people to read and learn about it. If possible, to make more people aware of the place and make it (very hard, I know) more popular.</p>\n\n<p>I can create a beautiful website with information and stuff but it&#39;s not enough.</p>\n\n<p>If anyone has ANY idea to share, please feel free.<br/>\nThanks!</p>\n</div><!-- SC_ON -->",
  "score": 6,
  "permalink": "/r/SideProject/comments/oi129i/how_to_help_a_tiny_village/",
  "subreddit": "SideProject",
  "id": "oi129i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey all,\n\nmy mother's village is located somewhere in South Europe (at 1100m altitude) and\nhas a great history. Around 1940 it has about 450 residents, but nowadays it\ncounts less than 100 people, most of them coming only in Summer.\n\nThe house owners are mostly poor and any of them that aren't, the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私の母の村は、南ヨーロッパのどこか（標高1100m）に位置しています。\n偉大な歴史を持っています。1940年頃には約450人の住民がいましたが、現在では\n今では100人にも満たず、そのほとんどが夏にしか来ません。\n\n家の持ち主はほとんどが貧乏人で、そうでない人は...。",
      "title": "小さな村を助けるには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我母亲的村子位于南欧的某个地方（海拔1100米），拥有伟大的历史。\n有着辉煌的历史。在1940年左右，它有大约450名居民，但现在它只有不到100人。\n现在只有不到100人，其中大部分人只在夏天来。\n\n房子的主人大多是穷人，而其中任何一个不是穷人的人，都会被赶走。",
      "title": "如何帮助一个小村庄？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我母親的村子位於南歐的某個地方（海拔1100米），擁有偉大的歷史。\n有着輝煌的歷史。在1940年左右，它有大約450名居民，但現在它只有不到100人。\n現在只有不到100人，其中大部分人只在夏天來。\n\n房子的主人大多是窮人，而其中任何一個不是窮人的人，都會被趕走。",
      "title": "如何幫助一個小村莊？"
    }
  ]
}