{
  "author": "CrashDunning",
  "original_created_utc": 1651465618,
  "title": "Why are the people who go on about free speech the most the ones who usually don't actually understand how it works?",
  "created_utc": 1651492870,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I guess this might be a US specific post.&lt;/p&gt;\n\n&lt;p&gt;But for example, getting banned on social media, removed from a private business, or losing your job for saying certain things or causing a disturbance are all things that can legally happen under our first amendment, which only prevents being arrested and jailed for speech. &lt;/p&gt;\n\n&lt;p&gt;So why when one of the aforementioned things happens to many people do they go up in arms about their free speech being infringed upon? Is what these people really want a world where people can do anything they want without consequence?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/ughhmq/why_are_the_people_who_go_on_about_free_speech/",
  "subreddit": "NoStupidQuestions",
  "id": "ughhmq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I guess this might be a US specific post.\n\nBut for example, getting banned on social media, removed from a private\nbusiness, or losing your job for saying certain things or causing a disturbance\nare all things that can legally happen under our first amendment, which only\nprevents being arrested and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカ特有の投稿かもしれませんね。\n\nしかし、例えば、あることを言ったり、騒いだりしたことで、SNSで禁止されたり、個人事業主から外されたり\nあることを言った、あるいは騒ぎを起こしたという理由で、ソーシャルメディアから追放される、私企業から排除される、仕事を失う。\nこれらはすべて、憲法修正第1条のもとで合法的に起こりうることであり、逮捕や...\n逮捕されることを防ぐだけで、...",
      "title": "なぜ、言論の自由を一番主張する人は、普段からその仕組みを実は理解していない人なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这可能是一个美国特有的帖子。\n\n但是，举例来说，在社交媒体上被禁止，在私人企业中被除名，或者因为说了某些话或引起骚乱而失去工作。\n或因说某些话或引起骚乱而失去工作。\n这些都是根据我们的第一修正案可以合法发生的事情，这只是\n它只是防止被逮捕和...",
      "title": "为什么最喜欢谈论言论自由的人通常不了解它的运作方式？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這可能是一個美國特有的帖子。\n\n但是，舉例來說，在社交媒體上被禁止，在私人企業中被除名，或者因爲說了某些話或引起騷亂而失去工作。\n或因說某些話或引起騷亂而失去工作。\n這些都是根據我們的第一修正案可以合法發生的事情，這只是\n它只是防止被逮捕和...",
      "title": "爲什麼最喜歡談論言論自由的人通常不瞭解它的運作方式？"
    }
  ]
}