{
  "author": "LedditBe_2025",
  "original_created_utc": 1634561463,
  "title": "What is your crypto goal?",
  "created_utc": 1634581846,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I finally have enough comment karma to make a post on this sub, so here is my first post!</p>\n\n<p>I&#39;ve been seeing a lot of posts about cryptogoals so this is probably not the most unique post ever. But I really wanted to make a post about my take on this matter.</p>\n\n<p>When I first started investing in crypto (April 2021) I wanted to make quick money. I saw BTC reaching new ATH&#39;s and I FOMO&#39;d in. Little did I know that I actually signed up for quick losses instead of quick gains due to the May crash. But I held through the crash, did some research on how crypto &#39;works&#39; and lowered my average by DCA.</p>\n\n<p>During the dip I was daydreaming about tripling my portfolio and what I would do if I were to make significant gains. The first thing that came to mind was: &#39;When Lambo?&#39;. But after giving it some thought and experiencing the gas crisis in Europe right now, I have decided to put my crypto gains towards living a more sustainable life. I want to install solar panels, take our house off the gas, pay a little extra money for non processed foods etc. </p>\n\n<p>Not only will this be a financial investment because I don&#39;t have to pay electric and gasbills anymore so I can pay off my mortgage a little bit faster. It&#39;s an investment in myself because I might be able to retire a bit early when my mortgage is paid off. But it&#39;s also an investment for the evironment. The world needs a little bit of love.</p>\n\n<p>Don&#39;t get me wrong, this is not a post for starting a debate on climate change or whatsoever. But I wanted to give a different take on what I will do with my money when I make significant gains since most of the other posts about this topic focus on the materialistic goals. And ofcourse, everybody has different dreams and goals and I&#39;m cheering for you all to reach them. If your dream is owning a Lambo, please honk if you see me so I know you&#39;ve reached your goals. Do what makes you happy. </p>\n\n<p>For so many the main goal is to live a modest life where they are able to pay off their debts and bills. For others it would mean the world if they can send their kids to college. Since I don&#39;t have and will not have any kids and I&#39;m able to pay my monthly bills with my salary, for me it is leaving this world a little better for my nieces and nephews.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qam22u/what_is_your_crypto_goal/",
  "subreddit": "CryptoCurrency",
  "id": "qam22u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I finally have enough comment karma to make a post on this sub, so here is my\nfirst post!\n\nI've been seeing a lot of posts about cryptogoals so this is probably not the\nmost unique post ever. But I really wanted to make a post about my take on this\nmatter.\n\nWhen I first started investing in crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ようやくこのサブに投稿できるだけのコメントカルマができたので、ここで私の\n初投稿です。\n\nクリプトゴアルについての投稿をたくさん見てきたので、これまでで一番ユニークな投稿ではないかもしれませんが\nこれまでで最もユニークな投稿ではないかもしれません。しかし、私はこの問題についての私の考えを記事にしたかったのです。\nことです。\n\n私が初めてクリプトゴアルに投資したとき...",
      "title": "あなたのcrypto goalは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我终于有足够的评论业力在这个子上发一个帖子，所以这里是我的\n第一篇帖子!\n\n我已经看到了很多关于密码锁的帖子，所以这可能不是一个\n最独特的帖子。但我真的想发一个帖子，谈谈我对这件事的看法\n事。\n\n当我第一次开始投资加密货币时...",
      "title": "你的加密货币目标是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我終於有足夠的評論業力在這個子上發一個帖子，所以這裏是我的\n第一篇帖子!\n\n我已經看到了很多關於密碼鎖的帖子，所以這可能不是一個\n最獨特的帖子。但我真的想發一個帖子，談談我對這件事的看法\n事。\n\n當我第一次開始投資加密貨幣時...",
      "title": "你的加密貨幣目標是什麼？"
    }
  ]
}