{
  "author": "nnurmanov",
  "original_created_utc": 1638637018,
  "title": "Help to build products and get paid in equity (alternative to side projects) - withpublic.com",
  "created_utc": 1638680141,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is an attempt to match non-technical founders with experienced software engineers to build collaboratively amazing products. Instead of working on a side project of another clone of an existing product, help the founders to build their products. You shall help with the technical side, they will do the sales/marketing. You get % and who knows, you may become a shareholder of the next FB?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/r8ttsy/help_to_build_products_and_get_paid_in_equity/",
  "subreddit": "SideProject",
  "id": "r8ttsy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is an attempt to match non-technical founders with experienced software\nengineers to build collaboratively amazing products. Instead of working on a\nside project of another clone of an existing product, help the founders to build\ntheir products. You shall help with the technical side, they…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、技術者でない創業者と経験豊富なソフトウェア技術者をマッチングさせる試みです。\nエンジニアが協力して素晴らしい製品を作る。を手がけるのではなく\n既存の製品のクローンを作るサイドプロジェクトとして、創業者を支援する。\n製品になります。あなたは技術面を手伝い、彼らは...",
      "title": "製品の開発を手伝い、株式で報酬を得る（サイドプロジェクトの代替） - withpublic.com"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是将非技术性的创始人与有经验的软件工程师相匹配的尝试。\n这是将非技术性的创始人与有经验的软件工程师相匹配，以合作建立令人惊奇的产品。与其在一个\n而不是从事另一个克隆现有产品的副业，而是帮助创始人建立他们的产品。\n他们的产品。你将在技术方面提供帮助，而他们将在技术方面提供帮助。",
      "title": "帮助建立产品并获得股权报酬（替代副业项目） - withpublic.com"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是將非技術性的創始人與有經驗的軟件工程師相匹配的嘗試。\n這是將非技術性的創始人與有經驗的軟件工程師相匹配，以合作建立令人驚奇的產品。與其在一個\n而不是從事另一個克隆現有產品的副業，而是幫助創始人建立他們的產品。\n他們的產品。你將在技術方面提供幫助，而他們將在技術方面提供幫助。",
      "title": "幫助建立產品並獲得股權報酬（替代副業項目） - withpublic.com"
    }
  ]
}