{
  "author": "YumiRae",
  "original_created_utc": 1629030777,
  "title": "Historically, have governments initiated by a coups d'état ever become good places to live?",
  "created_utc": 1629053266,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that a coup is destabilizing and, often, anti-democratic. I&#39;m trying to see if, beyond my own western cultural way of thinking, there have been situations where coups didn&#39;t end up being too terrible for the inhabitants of the local people? Has it ever led to a good outcome? </p>\n\n<p>I&#39;m thinking about the Taliban in Afghanistan, and about how, if I understand correctly, the US government is particularly notorious for training and arming home grown organizations to overthrow goverments because it&#39;s convenient to them. The US only gets mad when their militants stop listening to their directives? My brain says &#39;Latin America?&#39; </p>\n\n<p>While we (probably) didn&#39;t directly arm them and tell them to do it this time, aren&#39;t there trails going back and back and back with the Taliban and the US? </p>\n\n<p>What can history tell us about the citizens of countries that suffered a coups d&#39;état?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/p4sl9c/historically_have_governments_initiated_by_a/",
  "subreddit": "AskHistorians",
  "id": "p4sl9c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that a coup is destabilizing and, often, anti-democratic. I'm\ntrying to see if, beyond my own western cultural way of thinking, there have\nbeen situations where coups didn't end up being too terrible for the inhabitants\nof the local people? Has it ever led to a good outcome?\n\nI'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クーデターは不安定で、多くの場合、反民主的であることを理解しています。私は\n私は、自分の西洋文化的な考え方を超えて、このような状況があったのかどうかを知りたいのです。\nクーデターが地元の住民にとってあまりひどい結果にならなかった状況があったのかどうかを知りたいのです。\n地元の人々にとってひどい結果にならなかったかどうかを知りたいのです。良い結果につながったことはありますか？\n\n私は...",
      "title": "歴史的に見て、クーデターで始まった政府が住みやすい国になったことがあるだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我明白，政变是破坏稳定的，而且往往是反民主的。我正在\n我想看看，除了我自己的西方文化思维方式之外，是否有一些情况下政变并没有最终导致太多损失。\n是否有过这样的情况，即政变最终没有对当地居民造成太大影响？\n的当地人来说是不是太可怕了？是否曾经导致过一个好的结果？\n\n我...",
      "title": "从历史上看，由政变发起的政府是否曾经成为良好的居住地？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我明白，政變是破壞穩定的，而且往往是反民主的。我正在\n我想看看，除了我自己的西方文化思維方式之外，是否有一些情況下政變並沒有最終導致太多損失。\n是否有過這樣的情況，即政變最終沒有對當地居民造成太大影響？\n的當地人來說是不是太可怕了？是否曾經導致過一個好的結果？\n\n我...",
      "title": "從歷史上看，由政變發起的政府是否曾經成爲良好的居住地？"
    }
  ]
}