{
  "author": "Wilberjay",
  "original_created_utc": 1640756619,
  "title": "2022 is less then 3 days away… What’s your plan?",
  "created_utc": 1640785289,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;With everything going on in the world, COVID, hyperinflation, China pushing boundaries as well as Russia, I think 2022 will be very interesting for crypto. I really think this will be the year crypto breaks out and becomes a staple for Finacial wealth and seen for what it is. It is the future. It has the technology and ultimately, it’s decentralized. These governments CANNOT control it. The word is out there and with companies like Crypto.com pushing heavily in the mainstream marketing, I think it’s going to explode. It is our time!&lt;/p&gt;\n\n&lt;p&gt;What’s your plan? DCA, HODL or time the market? Personally, I have my eyes on a set few cryptos (the obvious BTC and ETH) and plan to continue to DCA as I’m long on crypto. But am I doing this wrong? What’s been the best plan you’ve set in place that has brought you success?&lt;/p&gt;\n\n&lt;p&gt;I’m willing to listen!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/rr0jnh/2022_is_less_then_3_days_away_whats_your_plan/",
  "subreddit": "CryptoCurrency",
  "id": "rr0jnh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "With everything going on in the world, COVID, hyperinflation, China pushing\nboundaries as well as Russia, I think 2022 will be very interesting for crypto.\nI really think this will be the year crypto breaks out and becomes a staple for\nFinacial wealth and seen for what it is. It is the future. It…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "COVID、ハイパーインフレ、中国に押され気味の世界。\n2022年は暗号にとって非常に興味深い年になると思います。\n暗号がブレイクし、以下のような定番になる年だと思います。\n経済的な豊かさと、それが何であるかを見ることができます。それは未来なのです。それは...",
      "title": "2022年まであと3日弱・・・あなたはどうする？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着世界上发生的一切，COVID，恶性通货膨胀，中国推动的边界以及俄罗斯。\n以及俄罗斯，我认为2022年对加密货币来说将非常有趣。\n我真的认为这将是加密货币爆发的一年，并成为金融财富的主力军。\n金融财富，并看到它是什么。它是未来。它是未来。",
      "title": "离2022年不到3天了......你有什么计划？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着世界上發生的一切，COVID，惡性通貨膨脹，中國推動的邊界以及俄羅斯。\n以及俄羅斯，我認爲2022年對加密貨幣來說將非常有趣。\n我真的認爲這將是加密貨幣爆發的一年，併成爲金融財富的主力軍。\n金融財富，並看到它是什麼。它是未來。它是未來。",
      "title": "離2022年不到3天了......你有什麼計劃？"
    }
  ]
}