{
  "author": "Kukukazoo",
  "original_created_utc": 1651384404,
  "title": "Is it alright to ask my dad not to kiss me anymore?",
  "created_utc": 1651397492,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Okay some context, my (31f) family has a lot of issues when it comes to boundaries.  Touching, joking, giving advice when not asked,  and so on. Well my biggest issue is that my dad likes to kiss my neck or back. I hate it. It literally makes my stomach knot and I have told him on multiple occasions that I do not want that. He&amp;#39;ll make the excuse that &amp;quot;it&amp;#39;s not sexual&amp;quot; and my response is Idc, I still don&amp;#39;t want it.&lt;/p&gt;\n\n&lt;p&gt;This last week I flew home for my brother&amp;#39;s wedding and I was chatting with my mom outside. My dad comes out and starts massaging my shoulders and I can feel myself getting irritated but say nothing.  He then leans in and kisses my bare back (spaghetti straps). I yell at him, &amp;quot;I know I&amp;#39;ve said this before. I don&amp;#39;t like that.  Do not kiss my neck, back, of anywhere.&amp;quot; My mom then calls him out after I have confronted him and he walks away all huffy. Slams the door and throws some stuff around the kitchen.&lt;/p&gt;\n\n&lt;p&gt;He sees nothing wrong with his actions and I am besides myself.  This bothers me a lot. My comfort and boundaries are not respected.  I don&amp;#39;t feel it is right and I hate him for that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/uft96f/is_it_alright_to_ask_my_dad_not_to_kiss_me_anymore/",
  "subreddit": "NoStupidQuestions",
  "id": "uft96f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Okay some context, my (31f) family has a lot of issues when it comes to\nboundaries. Touching, joking, giving advice when not asked, and so on. Well my\nbiggest issue is that my dad likes to kiss my neck or back. I hate it. It\nliterally makes my stomach knot and I have told him on multiple occasions…"
}