{
  "author": "skilliard7",
  "the_new_excerpt": " 1. The corporate tax hike will affect most corporations, but REITs are \"pass\n    through\", so they will be unaffected by this as they do not pay corporate\n    taxes.\n\n 2. The capital gains and qualified dividend tax hike won't affect REITs either,\n    because they're already taxed as ordinary…",
  "original_created_utc": 1619630884,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " 1. 法人税増税はほとんどの企業に影響があるが、REITは「パススルー」なので、影響を受けない。\n    法人税を払っていないので、影響を受けません。\n    る。\n\n 2. 2. キャピタルゲインと適格配当の増税は、REITにも影響しない。\n    なぜなら、すでに普通の税金がかかっているからです。",
      "title": "なぜREITはリスク調整後で株式をアウトパフォームする立場にあるのか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " 1. 公司税的增加将影响大多数公司，但房地产投资信托基金是 \"通过 \"的。\n    递\"，所以它们将不受影响，因为它们不支付公司税。\n    税。\n\n 2. 2.资本收益和合格股息税的增加也不会影响房地产投资信托基金。\n    因为它们已经作为普通税被征收。",
      "title": "为什么房地产投资信托基金在风险调整的基础上能够超过股票的表现？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1. 公司稅的增加將影響大多數公司，但房地產投資信託基金是 \"通過 \"的。\n    遞\"，所以它們將不受影響，因爲它們不支付公司稅。\n    稅。\n\n 2. 2.資本收益和合格股息稅的增加也不會影響房地產投資信託基金。\n    因爲它們已經作爲普通稅被徵收。",
      "title": "爲什麼房地產投資信託基金在風險調整的基礎上能夠超過股票的表現？"
    }
  ],
  "title": "Why REITs Are in a position to outperform equities on a risk-adjusted basis",
  "created_utc": 1619636733,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>The corporate tax hike will affect most corporations, but REITs are &quot;pass through&quot;, so they will be unaffected by this as they do not pay corporate taxes.</p></li>\n<li><p>The capital gains and qualified dividend tax hike won&#39;t affect REITs either, because they&#39;re already taxed as ordinary income(other than QBI deduction)</p></li>\n<li><p>Biden&#39;s targetting of &quot;like kind exchange&quot; tax deferrals won&#39;t affect REITs, but investors that invested in real estate directly may have less of a reason to do so over just investing in REITs.</p></li>\n<li><p>Real estate has historically done well during periods of inflation, and many leading indicators for inflation are present(High commodity prices, shortages, high demand, stimulus, M2 growth, unemployment dropping, rising inflation expectations)</p></li>\n<li><p>REITs have yet to recover as much in share price as much as the equity market. While equities are trading at far higher P/E ratios than they were a year ago, REITs FFO to price ratios are still looking cheap.</p></li>\n<li><p>If you look at 1999 when equities were starting to trade at similar P/E Ratios, REITs went on to perform well during the tech bubble crash up until the real estate bubble several years later.</p></li>\n<li><p>Low interest rates present an opportunity for leveraged investment</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 592,
  "permalink": "/r/investing/comments/n0k1xc/why_reits_are_in_a_position_to_outperform/",
  "subreddit": "investing",
  "id": "n0k1xc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214683
}