{
  "author": "SonicHedgehogGene",
  "original_created_utc": 1635269268,
  "title": "What's next for you after taking profits?",
  "created_utc": 1635291239,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>These past few days have been a great ride with coins hitting new all-time highs. </p>\n\n<p>I&#39;m sure some are still holding on to their coins and some are taking profits by completely selling all their holdings on a coin or reducing their positions. I myself sold some by converting to stablecoin but I&#39;m still hodling most of my coins. Now I&#39;m thinking what I should do next and I would love to hear your thoughts. </p>\n\n<p>For those who took profits, what&#39;s your next move? Are you continuing to DCA? Waiting for those coins you sold to dip again so you can buy some more? Or are you shifting your focus to other coins that you think have the potential to moon? Any particular coins you&#39;re interested in?</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/qgbhkk/whats_next_for_you_after_taking_profits/",
  "subreddit": "CryptoCurrency",
  "id": "qgbhkk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These past few days have been a great ride with coins hitting new all-time\nhighs.\n\nI'm sure some are still holding on to their coins and some are taking profits by\ncompletely selling all their holdings on a coin or reducing their positions. I\nmyself sold some by converting to stablecoin but I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、コインが史上最高値を更新するなど、素晴らしい展開が続いています。\n史上最高値を更新しています。\n\nまだコインを持ち続けている人もいれば、保有コインを完全に売却したり、ポジションを減らして利益を得ている人もいると思います。\n保有コインを完全に売却したり、ポジションを減らして利益を得ている人もいるでしょう。I\n私自身は安定したコインに変えることで一部を売却しましたが、...",
      "title": "利益を出した後の次の展開は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几天里，随着钱币创下历史新高，这是一次伟大的旅程。\n纪录的新高。\n\n我相信有些人仍在持有他们的硬币，有些人正在通过以下方式获利\n完全卖出他们持有的所有硬币或减少他们的头寸。I\n我自己也通过转换为稳定币卖出了一些，但我...",
      "title": "获利后，你的下一步是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾天裏，隨着錢幣創下歷史新高，這是一次偉大的旅程。\n紀錄的新高。\n\n我相信有些人仍在持有他們的硬幣，有些人正在通過以下方式獲利\n完全賣出他們持有的所有硬幣或減少他們的頭寸。I\n我自己也通過轉換爲穩定幣賣出了一些，但我...",
      "title": "獲利後，你的下一步是什麼？"
    }
  ]
}