{
  "author": "mythrowawayyoyo",
  "original_created_utc": 1633440685,
  "title": "My mom wants me to invest in Bitcoin",
  "created_utc": 1633458646,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been fairly open about my investment in cryptocurrency with my mom, I told her my reasons and my outlook on the space</p>\n\n<p>Now, my mother is 12 months away from retirement. She inherited some money and is asking me to invest a small portion of this money in crypto (the equivalent of 5 months of her salary). \nShe is not tech savvy and she is asking me to invest for her. She is aware of the risks and not relying on this money. Hearing from my experience she is hoping to get a return as well as it could help her in retirement. She is also aware that she could lose that money.</p>\n\n<p>Any advice on how to approach this situation? Should I tech her how to do it herself or do it for her?</p>\n\n<p>Edit: Thanks everyone, really valuable perspectives and inputs. I will continue helping her educate herself and buy on her behalf for the moment, hoping to transfer to her own cold wallet one day when she’ll feel ready to self custody.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/Bitcoin/comments/q1wg55/my_mom_wants_me_to_invest_in_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "q1wg55",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been fairly open about my investment in cryptocurrency with my mom, I\ntold her my reasons and my outlook on the space\n\nNow, my mother is 12 months away from retirement. She inherited some money and\nis asking me to invest a small portion of this money in crypto (the equivalent\nof 5 months of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は母に暗号通貨への投資についてかなりオープンにしてきました。\n自分の理由と、この分野に対する自分の見通しを話しました。\n\n今、私の母は退職まであと12ヶ月です。彼女はいくつかのお金を相続し\nこのお金の一部を暗号に投資するように頼まれています。\n5ヶ月分の...",
      "title": "母は私にビットコインに投資してほしいと言っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直对我的加密货币投资与我母亲保持着相当开放的态度。\n告诉她我的理由和我对这个领域的看法。\n\n现在，我母亲离退休还有12个月。她继承了一些钱，并且\n她要求我将这笔钱的一小部分投资于加密货币（相当于\n相当于5个月的工资。",
      "title": "我妈妈希望我投资比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直對我的加密貨幣投資與我母親保持着相當開放的態度。\n告訴她我的理由和我對這個領域的看法。\n\n現在，我母親離退休還有12個月。她繼承了一些錢，並且\n她要求我將這筆錢的一小部分投資於加密貨幣（相當於\n相當於5個月的工資。",
      "title": "我媽媽希望我投資比特幣"
    }
  ]
}