{
  "author": "Earth_Worm_Jimbo",
  "original_created_utc": 1629458194,
  "title": "How do we know that \"Saturn Devouring One of His Sons\" by Francisco Goya is in fact depicting Saturn and his Child if the 'Black Paintings' were not named and only found after his death?",
  "created_utc": 1629491034,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s my understanding that the paintings in the Quinta Del Sordo were never meant to be seen by anyone, were not named, and also were not found until after Goya&#39;s death.  Could the paintings not have just been the artistic vision coming from a man losing his mind? how do we know it is in fact a painting of Saturn eating his Child?</p>\n</div><!-- SC_ON -->",
  "score": 1618,
  "permalink": "/r/AskHistorians/comments/p835k9/how_do_we_know_that_saturn_devouring_one_of_his/",
  "subreddit": "AskHistorians",
  "id": "p835k9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's my understanding that the paintings in the Quinta Del Sordo were never\nmeant to be seen by anyone, were not named, and also were not found until after\nGoya's death. Could the paintings not have just been the artistic vision coming\nfrom a man losing his mind? how do we know it is in fact a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、キンタ・デル・ソルドの絵画は、誰かに見られることはなかった。\nゴヤの死後に発見されたとのことです。\nゴヤの死後に発見されたと聞いています。あの絵は、心を失った男の芸術的ビジョンではなかったのか？\nそれが実際に...であることをどうやって知ることができますか？",
      "title": "もし「黒い絵」に名前がなく、彼の死後に発見されたのであれば、フランシスコ・ゴヤの「息子の一人を食い尽くす土星」が実際に土星とその子供を描いたものであると、どうやってわかるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的理解是，在Quinta Del Sordo的画作从未被任何人看过。\n我的理解是，在Quinta Del Sordo的画作从未被任何人看过，也没有被命名，而且直到戈雅去世后才被发现。\n戈雅死后才被发现。这些画会不会只是一个失去理智的人所产生的艺术想象？\n我们怎么知道它实际上是一个...",
      "title": "如果 \"黑画 \"没有被命名并且在他死后才被发现，我们怎么知道弗朗西斯科-戈雅的 \"土星吞噬他的一个儿子 \"实际上是在描绘土星和他的孩子？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的理解是，在Quinta Del Sordo的畫作從未被任何人看過。\n我的理解是，在Quinta Del Sordo的畫作從未被任何人看過，也沒有被命名，而且直到戈雅去世後才被發現。\n戈雅死後才被發現。這些畫會不會只是一個失去理智的人所產生的藝術想象？\n我們怎麼知道它實際上是一個...",
      "title": "如果 \"黑畫 \"沒有被命名並且在他死後才被發現，我們怎麼知道弗朗西斯科-戈雅的 \"土星吞噬他的一個兒子 \"實際上是在描繪土星和他的孩子？"
    }
  ]
}