{
  "author": "ES_Legman",
  "original_created_utc": 1639351783,
  "title": "You can't blame people outside crypto from calling NFTs a ponzi scheme or beanie babies if the only exposure NFT gets on the media is the overpriced JPEGs.",
  "created_utc": 1639366324,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The biggest use case for NFTs is transfer of ownership of digital or real life assets that gets reflected in an immutable, trustless and decentralized digital record which cryptocurrency is based on.&lt;/p&gt;\n\n&lt;p&gt;People overly hyping monkey and punk NFTs are getting blindsided by the money they think they are going to make short term. Same with parcel lots in the metaverse. That&amp;#39;s short term hype. Meanwhile there are very interesting projects out there putting out actual use cases of NFTs.&lt;/p&gt;\n\n&lt;p&gt;Do you know how you turn heads towards NFTs as a legit solution and not just a grand scheme for money laundering? Tell them you are going to kill Ticketmaster. Tell them that in the future, it is possible that legal documents like driving licenses could be verified worldwide against a decentralized blockchain. All this use cases are being developed right now, but they are not flashy, they are not going to make you money tomorrow and they don&amp;#39;t sell views on YouTube.&lt;/p&gt;\n\n&lt;p&gt;If all you can see behind NFT technology is overpriced JPEGs you need to step back and delve a little further down, otherwise you are going to miss on a huge future opportunity.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/rf1a7f/you_cant_blame_people_outside_crypto_from_calling/",
  "subreddit": "CryptoCurrency",
  "id": "rf1a7f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The biggest use case for NFTs is transfer of ownership of digital or real life\nassets that gets reflected in an immutable, trustless and decentralized digital\nrecord which cryptocurrency is based on.\n\nPeople overly hyping monkey and punk NFTs are getting blindsided by the money\nthey think they are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NFTの最大のユースケースは、デジタルまたはリアルの所有権の移転です。\nその資産は、不変で信頼できる分散化されたデジタル資産に反映されます。\n暗号通貨が基づいている記録です。\n\n猿やパンクのNFTを過剰に宣伝する人は、お金に目がくらんでしまうのです。\nと思っているのですが...。",
      "title": "NFTのメディアへの露出が高額なJPEGだけでは、暗号以外の人々がNFTをネズミ講やビーニーベイビーと呼んでも仕方がありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "NFTs的最大用例是数字或现实生活中的所有权转移。\n体现在一个不可改变的、不可信任的和去中心化的数字记录中。\n加密货币是基于这种记录的。\n\n过度夸大猴子和朋克NFTs的人被金钱所迷惑\n他们认为他们是...",
      "title": "如果NFT在媒体上得到的唯一曝光是价格过高的JPEG，你就不能责怪加密货币以外的人称NFT为庞氏骗局或豆芽菜婴儿。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "NFTs的最大用例是數字或現實生活中的所有權轉移。\n體現在一個不可改變的、不可信任的和去中心化的數字記錄中。\n加密貨幣是基於這種記錄的。\n\n過度誇大猴子和朋克NFTs的人被金錢所迷惑\n他們認爲他們是...",
      "title": "如果NFT在媒體上得到的唯一曝光是價格過高的JPEG，你就不能責怪加密貨幣以外的人稱NFT爲龐氏騙局或豆芽菜嬰兒。"
    }
  ]
}