{
  "author": "Tankre84",
  "the_new_excerpt": "Before I begin, I must give major credit to Daniel Kahneman. Much of the\nthoughts and procedures I'm going to lay out in this post is because I read his\nwonderful books, \"Thinking Fast and Slow,\" and \"Noise.\"\n\n\n\nI am here to propose a procedure to make optimal stock selling decisions by\neliminating…",
  "original_created_utc": 1623288475,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "始める前に、ダニエル・カーネマンの功績を大きく讃えなければなりません。考え方や手順の多くは\nこの記事で紹介する考えや手順の多くは、彼の素晴らしい著書「Thinking Fast and Slow」と「Noise」を読んだからです。\nこの記事で紹介する考えや手順の多くは、彼の素晴らしい本、\"Thinking Fast and Slow \"と \"Noise \"を読んだからです。\n\n\n\n私がここで提案したいのは、最適な株式売却の判断をするための手順です。\n排除する...",
      "title": "最適な意思決定とエグジットプランニング"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我开始之前，我必须把主要的功劳归于丹尼尔-卡尼曼。我在这篇文章中所阐述的大部分\n我将在这篇文章中阐述的许多想法和程序都是因为我读了他的\n精彩的书籍，\"思考的速度和速度 \"和 \"噪音\"。\n\n\n\n我在这里提出一个程序，通过以下方式做出最佳的股票销售决策\n消除...",
      "title": "最佳决策和退出计划"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我開始之前，我必須把主要的功勞歸於丹尼爾-卡尼曼。我在這篇文章中所闡述的大部分\n我將在這篇文章中闡述的許多想法和程序都是因爲我讀了他的\n精彩的書籍，\"思考的速度和速度 \"和 \"噪音\"。\n\n\n\n我在這裏提出一個程序，通過以下方式做出最佳的股票銷售決策\n消除...",
      "title": "最佳決策和退出計劃"
    }
  ],
  "title": "Optimal Decision Making and Exit Planning",
  "created_utc": 1623306833,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before I begin, I must give major credit to Daniel Kahneman. Much of the thoughts and procedures I&#39;m going to lay out in this post is because I read his wonderful books, &quot;Thinking Fast and Slow,&quot; and &quot;Noise.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>I am here to propose a procedure to make optimal stock selling decisions by eliminating common things that cause error in judgement. Part 1 of this post will be describing the common errors. Part 2 will discuss weaknesses in current methods. Part 3 will be my new proposed method.</p>\n\n<p>&#x200B;</p>\n\n<p>PART 1: WHAT ARE THE COMMON MISTAKES?</p>\n\n<p>MISTAKE 1: Making decisions out of ignorance. This one is obvious, you should not invest or bet on companies that you do not have a good understanding of. It&#39;s fine to come to Reddit to see what companies other people think are good, but you should always follow this up with your own due diligeance.</p>\n\n<p>&#x200B;</p>\n\n<p>MISTAKE 2: Making decisions without addressing your bias. Everyone has bias, and when you own a stock you will certainly have a bias in favor of the stock. There are some reasons you might have bias against a stock such as disliking a person who owns the stock or the way a CEO speaks. Either way positive or negative bias needs to be addressed.</p>\n\n<p>&#x200B;</p>\n\n<p>MISTAKE 3: Making decisions without addressing noise. Noise is all around us and affects us at every moment. Federal Judges give harsher sentences when the weather is hot. Students have different levels of focus in the morning vs right after lunch. You make different decisions based on how well you slept the night before or what kind of mood you are in. Even the music playing in the background has been shown to have significant effects on decision making! An optimal strategy needs to adjust for the noise in your life.</p>\n\n<p>&#x200B;</p>\n\n<p>MISTAKE 4: Making fast decisions on emotion. Kahneman explained in &quot;Thinking Fast and Slow,&quot; we all have 2 brains, the fast reactionary brain and the slow logical brain. The reactionary brain is great in an emergency reaction like moving your hand from the fire or running away from a dangerous person with a gun, but making a calculated financial decision should be left to the slow logical thinking brain.</p>\n\n<p>&#x200B;</p>\n\n<p>MISTAKE 5: Not making a decision and leaving it up to chance or letting others make the decision for you. If you believe that you are not smart enough to make decisions on investing in stocks, then it is perfectly fine to invest in SP500 and let it sit until you retire. However, if you believe that you are smart enough to make decisions of buying and selling stocks other then indexes, then it makes no sense to make full decisions on the buying side and letting chance decide when to sell.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>PART 2: WHAT IS WRONG WITH COMMON METHODS?</p>\n\n<p>If you don&#39;t have a good idea of the current common exit strategies, you can read about them here: <a href=\"https://www.investopedia.com/investing/understanding-exit-strategies/\">https://www.investopedia.com/investing/understanding-exit-strategies/</a></p>\n\n<p>&#x200B;</p>\n\n<p>Common Method 1: STOP LOSS ORDER</p>\n\n<p>&#x200B;</p>\n\n<p>Stop loss order is the worst exit strategy. If a stock is trading at say $10, and you have a stop loss of $8-$9, then you should just sell it at $10! Stop loss order will never be optimal because it is, at every moment in time, less optimal than the simple, &quot;sell everything now.&quot; </p>\n\n<p>&#x200B;</p>\n\n<p>Common Method 2: TRAILING STOP LOSS</p>\n\n<p>This method is better than the simple stop loss. The goal of this strategy is not to time the very peak of a stock. That&#39;s impossible, but rather to sell just a little after the stock has reached its peak. Here are the problems: look at any stock in the real world that has had a bullish run or a sky rocketing increase. In the middle of the run, I guarentee you will find a moment where the stock dropped 5% for a few minutes at least.</p>\n\n<p>&#x200B;</p>\n\n<p>Big money knows that stop losses are out there and very frequently go Stop Loss Hunting.</p>\n\n<p><a href=\"https://www.investopedia.com/terms/s/stophunting.asp\">https://www.investopedia.com/terms/s/stophunting.asp</a></p>\n\n<p>&#x200B;</p>\n\n<p>Common Method 3: TECHNICAL INDICATORS</p>\n\n<p>Selling based on Technical Indicators are generally a take-proft exit strategy which is good, but there are two problems with trading on technical indicators. </p>\n\n<p>One: technical indicators are well known and established, and because of this, can be manipulated. </p>\n\n<p>Two: technical indicators are for short term trades. No one does technical indicators for a 5 year projection. </p>\n\n<p>&#x200B;</p>\n\n<p>All short term trades are taxed at the same rate as income tax instead of the better Long Term Capital Gains tax rate (this is assuming you are in the USA). This can result in you paying 15%-20% more on taxes for your gains.</p>\n\n<p>&#x200B;</p>\n\n<p>Technical indicators are fine to use as part of your trading strategy, but not as the entirety of your strategy.</p>\n\n<p>&#x200B;</p>\n\n<p>Common Method 4: COVERED CALLS</p>\n\n<p>Selling Covered Calls is a valid strategy to earn a little extra, however, I&#39;m always reading posts about people who are sad that their covered calls are going to be exercised. If you sell a covered call, you should always assume the shares will be called away, otherwise you are trading with Mistake 5.</p>\n\n<p>&#x200B;</p>\n\n<p>PART 3: NEW PROPOSED METHOD</p>\n\n<p>&#x200B;</p>\n\n<p>I have made a Google Sheets for the process bellow. It does contain my current method for a stock that I own. Anyone is free to make a copy of this google sheet, delete all the cells in green and create your own numbers based on your research for your stock.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://docs.google.com/spreadsheets/d/1bVC5oD2A4V64kypra7keQG-SyiATXSNoxvikF2KTAJU/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1bVC5oD2A4V64kypra7keQG-SyiATXSNoxvikF2KTAJU/edit?usp=sharing</a></p>\n\n<p>&#x200B;</p>\n\n<p>1) First you must choose a method (or a few) to model the value of the stock. Common examples are: </p>\n\n<p>4 x Revenue</p>\n\n<p>P/E ratio of 8-30 depending on the industry</p>\n\n<p>Summation of total future profits discounted to present value (the Buffet Way). </p>\n\n<p>Sentiment indicators through polls or reddit/twitter activity</p>\n\n<p>2) Come up with a Base Case, Bear Case and Bull Case. Model the values of the stock under each scenario. This is designed to force you to do some DD and eliminate mistake 1.</p>\n\n<p>3) Next, you fill out a Trial using a probability matrix of the chances that you think the base case, bear case, and bull case actually happen.</p>\n\n<p>4) Using the same matrix repeat the trial 5 times with bearish and more bullish outlooks. Instructions are on the spreadsheet. This is designed to lower your bias (mistake 2). </p>\n\n<p>5) OPTIONAL: If you have a partner OR work as a team with people who also analysis stocks AND have different views about a stock, ask them to also fill out the probibility matrix as well to lower your bias even more (mistake 2).</p>\n\n<p>6) Repeat the model and trials 1-5 on different days, when in different moods, or in the morning versus the night time. This is in order to reduce noise (mistake 3). Each repeat should take you 10 minutes max.</p>\n\n<p>7) Plot/write down each of the results from every trial and every different day. Then use statistics to find your Mean, Variance Pop, Stand Deviation Pop.</p>\n\n<p>8) This will create a bell curve of YOUR true estimates of the price of the stock. </p>\n\n<p>&#x200B;</p>\n\n<p>NOTE: In a world with everyone having perfect information, this model would represent the true distribution of the price of the stock. However, since you and other buyers do not have perfect information, THIS IS NOT A BELL CURVE OF THE ACTUAL VALUE OF THE STOCK. However, the more you know and research the stock, the closer you would get to the actual real distribution.</p>\n\n<p>9) With the distribution of YOUR estimates in front of you, create an algorithm to follow and execute your trades.</p>\n\n<p>10)  WRITE THE ALGORITHM DOWN AND LOOK AT IT EVERYTIME BEFORE YOU PLAN TO SELL. Execute the algorithm to the best of your ability to minimize Mistakes 4 and 5.</p>\n\n<p>11) Each day should try to take 10 minutes to get more plot points for your statistics page. Each day you can tweek your algorithm a little, BUT ONLY RUN TRIALS AND MAKE CHANGES TO THE ALGORITHM WHEN THE MARKET IS CLOSED AND YOU CANNOT TRADE!!!! This is designed to prevent you from making quick emotional decisions (Mistake 4).</p>\n\n<p>&#x200B;</p>\n\n<p>Yes, I know the proposed method will take some work. Maybe it will take 30 minutes to read and understand and about 10 minutes to do each day. Imagine if this process increases your earnings/trades by just $100 a week, I would think most people would find it as time well spent.</p>\n\n<p>&#x200B;</p>\n\n<p>Last thought is that you should probably not share the true results of your algorithm and decisions with anyone you don&#39;t personally know. Reddit is a great place to share ideas, but it is a public forum, and anyone might be reading.</p>\n\n<p>&#x200B;</p>\n\n<p>Thank you for taking the time to read another long boring post by Tankre84!</p>\n\n<p>&#x200B;</p>\n\n<p>&quot;Sometimes the important thing isn&#39;t so much WHAT you think, but rather HOW you think.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 79,
  "permalink": "/r/stocks/comments/nwbope/optimal_decision_making_and_exit_planning/",
  "subreddit": "stocks",
  "id": "nwbope",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888036
}