{
  "author": "No_Valuable_8688",
  "original_created_utc": 1644692500,
  "title": "My ex boyfriend began having sex with my whilst I was sleeping. Is this rape?",
  "created_utc": 1644697015,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last night my ex boyfriend came over to talk, it ended up in an argument and I asked him to leave multiple times but he refused and said he wanted to continue talking. Around 2am I fell asleep and I woke up at some point during the night to him having sex with me. He had taken my clothes off me whilst I was sleeping. I told him to stop and he did but he wouldn&amp;#39;t get off me and kept trying to put it back in. After about 10 minutes of him continously trying to convince to let him have sex with me he finally got off of me. I fell back asleep and when I woke up in the morning he was naked and had put his erect penis between my thighs and was humping against me.\nIs this rape?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 243,
  "permalink": "/r/TooAfraidToAsk/comments/sqykzy/my_ex_boyfriend_began_having_sex_with_my_whilst_i/",
  "subreddit": "TooAfraidToAsk",
  "id": "sqykzy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Last night my ex boyfriend came over to talk, it ended up in an argument and I\nasked him to leave multiple times but he refused and said he wanted to continue\ntalking. Around 2am I fell asleep and I woke up at some point during the night\nto him having sex with me. He had taken my clothes off me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨夜、元彼氏が話しに来たのですが、口論になり、私が\n何度も出て行くように言ったが、拒否され、まだ続けたいと言われた。\nを話しています。午前2時頃、私は眠ってしまい、夜中に目が覚めたのです。\n彼が私とセックスしているところに。彼は私の服を脱がせていて...",
      "title": "元彼氏が、私が寝ている間にセックスをするようになりました。これはレイプですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨晚，我的前男友过来聊天，最后发生了争执，我多次要求他离开，但他拒绝了。\n我多次要求他离开，但他拒绝了，说他想继续\n谈话。凌晨2点左右，我睡着了，我在夜里的某个时刻醒来\n他和我发生了关系。他把我的衣服脱了下来......",
      "title": "我的前男友开始在我睡觉时与我发生性关系。这是强奸吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨晚，我的前男友過來聊天，最後發生了爭執，我多次要求他離開，但他拒絕了。\n我多次要求他離開，但他拒絕了，說他想繼續\n談話。凌晨2點左右，我睡着了，我在夜裏的某個時刻醒來\n他和我發生了關係。他把我的衣服脫了下來......",
      "title": "我的前男友開始在我睡覺時與我發生性關係。這是強姦嗎？"
    }
  ]
}