{
  "author": "Delicious_Moose_8417",
  "original_created_utc": 1648611568,
  "title": "Why does it seem socially okay to roast people who are bald for genetic reasons, but not alopecia?",
  "created_utc": 1648633435,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I might be slightly autistic so maybe it&amp;#39;s obvious, but I don&amp;#39;t get it. Neither is a choice, you just wake up one day and your hair is falling out. But it seems like it&amp;#39;s fair game to roast someone for being bald for one reason, but not so much the other. Although reddit is pretty much in favor of Chris Rock, I see a lot of people elsewhere acting like he did something heinous by making a bald joke specifically because Jada has alopecia. But I&amp;#39;m a balding man and I get worse jokes almost every day. Not a big deal to me, honestly, I got over it a while ago, but seems like a double standard&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/trxfj0/why_does_it_seem_socially_okay_to_roast_people/",
  "subreddit": "NoStupidQuestions",
  "id": "trxfj0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I might be slightly autistic so maybe it's obvious, but I don't get it. Neither\nis a choice, you just wake up one day and your hair is falling out. But it seems\nlike it's fair game to roast someone for being bald for one reason, but not so\nmuch the other. Although reddit is pretty much in favor of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は少し自閉症かもしれないので、当たり前かもしれませんが、理解できないのです。どちらも\nは、ある日突然、目が覚めたら髪が抜けていた、ということもあるのです。でも、どうやら\nハゲていることを理由に相手を糾弾するのはフェアだけど、そうでないような。\nもう一つはあまりない。redditはかなり賛成していますが...",
      "title": "遺伝的な理由でハゲている人を炙り出すのは社会的に問題ないと思われるのに、脱毛症はダメなのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可能有点自闭症，所以也许很明显，但我不明白。两者都不是\n是一种选择，你只是有一天醒来，你的头发就掉了。但这似乎\n好像因为一个原因而对一个人的秃头进行抨击是公平的，但对另一个原因就不那么公平了。\n另一个原因。虽然reddit相当支持...",
      "title": "为什么社会上对因遗传原因而秃头的人进行烘烤似乎没有问题，而对脱发症却没有问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可能有點自閉症，所以也許很明顯，但我不明白。兩者都不是\n是一種選擇，你只是有一天醒來，你的頭髮就掉了。但這似乎\n好像因爲一個原因而對一個人的禿頭進行抨擊是公平的，但對另一個原因就不那麼公平了。\n另一個原因。雖然reddit相當支持...",
      "title": "爲什麼社會上對因遺傳原因而禿頭的人進行烘烤似乎沒有問題，而對脫髮症卻沒有問題？"
    }
  ]
}