{
  "author": "InanetV",
  "original_created_utc": 1652575016,
  "title": "Discussion about USDT crashing behind the scenes",
  "created_utc": 1652604364,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone,&lt;/p&gt;\n\n&lt;p&gt;I wanted to make my own thread of this issue because in the other thread, I did not feel that it compiled enough information in the body of the post to facilitate a healthy discussion of the current situation. &lt;/p&gt;\n\n&lt;p&gt;USDT has lost about 6.6b in market cap since May 11, 2022 (~9% of their market cap). Historically, from what I have seen this has been the biggest drop ever in Tether’s history. So there is good reason to pay attention to it. I am not necessarily saying that a crash is imminent, but it is very alarming.&lt;/p&gt;\n\n&lt;p&gt;Historical, along with current data can be found here:\n&lt;a href=\"https://coinmarketcap.com/currencies/tether/historical-data/\"&gt;https://coinmarketcap.com/currencies/tether/historical-data/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;As we know, Tether is supposed to be backed by 1:1 to the USD by Tether’s reserves. Tether allegedly has fiat, bonds, and other assets to do this (will address this a bit more below). Even though Tether is near its’ peg, the change in market cap shows an overwhelming amount of redemption. &lt;/p&gt;\n\n&lt;p&gt;This is concerning for a few reasons, for one because the overall market is down. Meaning, the assets in Tether’s reserve also most likely are down as well. I’m not just talking about the crypto market, either. Since we do not have full transparency in Tether’s backing, many have speculated it’s tied to assets like BTC, which is also way down as well. Meaning, their backing “power” may be lower than it was previously and not exactly at 1:1. &lt;/p&gt;\n\n&lt;p&gt;As an example, for arguments sake, let’s say that BTC was bought and fully backed the USDT. Their average price for backing was when Bitcoin was at 30k. Now let’s say the market dips, and bitcoin goes to 27k. At the same time, many start redeeming Tether to cash out to fiat out of fear of the market conditions. This means that the backing of Tether is no longer 1:1 and since people are redeeming, Tether would have to sell off its bitcoin reserves for a loss of 10% to cover the redemption. &lt;/p&gt;\n\n&lt;p&gt;From the Cointest competition, we also found out that Tether has also previously lied about their backing: &lt;a href=\"https://www.theverge.com/22620464/tether-backing-cryptocurrency-stablecoin\"&gt;https://www.theverge.com/22620464/tether-backing-cryptocurrency-stablecoin&lt;/a&gt; they have also never allowed a public third party audit. &lt;/p&gt;\n\n&lt;p&gt;And it was never completely backed by fiat fiat equivalents and treasuries. Instead, it was backed by a mix of fiat and bond equivalents, 50% being Chinese white paper and other unstable assets. It’s closely tied to China’s debt: &lt;a href=\"https://cryptobriefing.com/report-alleges-tether-owns-billions-in-chinese-debt\"&gt;https://cryptobriefing.com/report-alleges-tether-owns-billions-in-chinese-debt&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Tl;dr This whole situation is concerning because Tether is supposed to be backed 1:1, but may have potentially have minted more than they have backing for. And due to the magnitude of redemption (that we know from the drastic change in market cap), it’s also causing their backing “power” to be lower and lower due to broader market conditions, such as war, inflation, China lockdowns, etc. Thus also making USDT more unstable.&lt;/p&gt;\n\n&lt;p&gt;And I know what most will say, most fiat is exactly the same, however, it doesn’t have nations backing it as a main form of currency and trade. &lt;/p&gt;\n\n&lt;p&gt;We have also seen many people on Twitter having a similar sentiment, Daniel Wang, Loopring former CEO and current advisor stated:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Just swapped all my USDT to USDC and DAI.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://twitter.com/daniel_loopring/status/1524399219288592384?s=21&amp;amp;t=WqCmeUFxqXmTx9WvJu_ViQ\"&gt;https://twitter.com/daniel_loopring/status/1524399219288592384?s=21&amp;amp;t=WqCmeUFxqXmTx9WvJu_ViQ&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I would like to thank &lt;a href=\"/u/DesignerVirtual9568\"&gt;u/DesignerVirtual9568&lt;/a&gt; for a lot of this information. I just compiled a lot of the info that I agreed with from their thread.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Just wanted to post this as an update: &lt;a href=\"https://twitter.com/whale_alert/status/1525593170876186624?s=20&amp;amp;t=4oJg1cCkP-cyaUtpmQfxdQ\"&gt;https://twitter.com/whale_alert/status/1525593170876186624?s=20&amp;amp;t=4oJg1cCkP-cyaUtpmQfxdQ&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In addition, the market cap for USDT has sunk another 1b since the time of this post&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 335,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/r2T_AIs2YyblrOyk-RsyD5LLqlUSWKZjfafI-lnSN2o.jpg?auto=webp&amp;s=fe820b985b7330763a96ec1907a80fe6ed3395a6",
          "width": 200,
          "height": 200
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/r2T_AIs2YyblrOyk-RsyD5LLqlUSWKZjfafI-lnSN2o.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=d90b788508a97fd2e78fb66dca7d664d22568ff0",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "yOcZTiz25tMKCN-HEAb6r_kusWbt0RJ15UBaN9CmyTM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/upuach/discussion_about_usdt_crashing_behind_the_scenes/",
  "subreddit": "CryptoCurrency",
  "id": "upuach",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hello everyone,\n\nI wanted to make my own thread of this issue because in the other thread, I did\nnot feel that it compiled enough information in the body of the post to\nfacilitate a healthy discussion of the current situation.\n\nUSDT has lost about 6.6b in market cap since May 11, 2022 (~9% of their…"
}