{
  "author": "midnight_throwawayxo",
  "original_created_utc": 1640864567,
  "title": "Why are some people okay with fat acceptance when it's basically promoting obesity?",
  "created_utc": 1640873402,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, I know that I should mind my own business, hence why I&amp;#39;m asking this question here.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t get me wrong, I&amp;#39;m not trying to body shame or fat shame anyone either. I&amp;#39;m all about body positivity; loving yourself is important and a lot of people are struggling with that.&lt;/p&gt;\n\n&lt;p&gt;What concerns me is the obesity part. I feel like it&amp;#39;s dangerous because there are a lot of health risks that are linked to obesity (especially if the person doesn&amp;#39;t exercise), I don&amp;#39;t understand why people tend to forget that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 150,
  "permalink": "/r/TooAfraidToAsk/comments/rrzwmu/why_are_some_people_okay_with_fat_acceptance_when/",
  "subreddit": "TooAfraidToAsk",
  "id": "rrzwmu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of all, I know that I should mind my own business, hence why I'm asking\nthis question here.\n\nDon't get me wrong, I'm not trying to body shame or fat shame anyone either. I'm\nall about body positivity; loving yourself is important and a lot of people are\nstruggling with that.\n\nWhat concerns me…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に、私は自分のことを気にするべきだということは分かっているので、なぜ質問しているのか。\nここで質問させていただきます。\n\n誤解しないでいただきたいのですが、私も誰かをボディシェイミングやファットシェイミングしようとしているわけではありません。私は\n自分を愛することは重要であり、多くの人がそうである。\nということに悩んでいます。\n\n気になるのは...",
      "title": "基本的に肥満を助長するものなのに、なぜデブ容認を平気でする人がいるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我知道我应该管好自己的事，因此我在这里问\n这个问题。\n\n不要误会我的意思，我也不是要对任何人进行身体羞辱或脂肪羞辱。我是\n爱自己是很重要的，很多人都在为这个问题挣扎。\n挣扎。\n\n我关注的是...",
      "title": "为什么有些人对接受脂肪没有意见，而这基本上是在促进肥胖？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我知道我應該管好自己的事，因此我在這裏問\n這個問題。\n\n不要誤會我的意思，我也不是要對任何人進行身體羞辱或脂肪羞辱。我是\n愛自己是很重要的，很多人都在爲這個問題掙扎。\n掙扎。\n\n我關注的是...",
      "title": "爲什麼有些人對接受脂肪沒有意見，而這基本上是在促進肥胖？"
    }
  ]
}