{
  "author": "TehranBro",
  "the_new_excerpt": "“Everybody seems to know when long-term interest rates rise you don’t buy\nlong-duration bonds. But what people forget is you also don’t want to buy\nlong-duration equities,” Bernstein, CEO and CIO of Richard Bernstein Advisors,\ntold CNBC’s “Trading Nation [https://www.cnbc.com/trading-nation/]”…",
  "original_created_utc": 1616085826,
  "localize": [
    {
      "locale": "zh",
      "title": "全明星投资人里奇-伯恩斯坦警告说，大科技面临 \"远不止 \"10%的下跌空间。",
      "the_new_excerpt": "\"大家似乎都知道，当长期利率上升时，你就不买了\n长期限的债券。但人们忘了的是，你也不想买入\n伯恩斯坦，理查德-伯恩斯坦顾问公司的首席执行官和首席信息官，\"长期股票。\n告诉CNBC的 \"贸易国度[https://www.cnbc.com/trading-nation/]\"......"
    },
    {
      "locale": "zh-Hant",
      "title": "全明星投資人裏奇-伯恩斯坦警告說，大科技面臨 \"遠不止 \"10%的下跌空間。",
      "the_new_excerpt": "\"大家似乎都知道，當長期利率上升時，你就不買了\n長期限的債券。但人們忘了的是，你也不想買入\n伯恩斯坦，理查德-伯恩斯坦顧問公司的首席執行官和首席信息官，\"長期股票。\n告訴CNBC的 \"貿易國度[https://www.cnbc.com/trading-nation/]\"......"
    }
  ],
  "title": "Big Tech faces ‘way more’ than 10% downside, all-star investor Rich Bernstein warns",
  "created_utc": 1616096503,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“Everybody seems to know when long-term interest rates rise you don’t buy long-duration bonds. But what people forget is you also don’t want to buy long-duration equities,” Bernstein, CEO and CIO of Richard Bernstein Advisors, told CNBC’s “<a href=\"https://www.cnbc.com/trading-nation/\">Trading Nation</a>” on Wednesday. “What’s a long-duration equity? Simply put, it’s one with a high P/E [price-to-earnings ratio].”</p>\n\n<p>“There were tons of promises made about what the future was going to look like. Those promises came true between 2000 and 2010. Largely, they came true,” he said. “But the tech sector gave you negative absolute returns for a decade.”</p>\n\n<p>“I don’t think too many tech investors today are prepared for negative absolute returns for three, five or 10 years,” he said.</p>\n\n<p>“If the nominal economy is getting stronger, you want stocks that are going to be very sensitive to that improvement in nominal economy,” Bernstein said. “That outlook for the next several years is probably going to favor cyclicals over more secular growers.”</p>\n\n<p><a href=\"https://www.cnbc.com/2021/03/17/big-tech-faces-way-more-than-10percent-downside-investor-rich-bernstein.html\">https://www.cnbc.com/2021/03/17/big-tech-faces-way-more-than-10percent-downside-investor-rich-bernstein.html</a></p>\n</div><!-- SC_ON -->",
  "score": 393,
  "permalink": "/r/investing/comments/m7v063/big_tech_faces_way_more_than_10_downside_allstar/",
  "subreddit": "investing",
  "id": "m7v063",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752818323
}