{
  "author": "RedactedRedditery",
  "original_created_utc": 1626006565,
  "title": "I just want to say that I don't know if Western Union will survive crypto. And thank God for that.",
  "created_utc": 1626017693,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday using ALGO, I was able to send $1000 across the country for 0.16¢. That is written correctly. It&#39;s not 16¢; it&#39;s 16/100 of 1¢. On top of that, because of the way ALGO rewards are paid with each transaction, that fee doesn&#39;t come out of pocket. I can remember a time when sending $50 across the country cost me $8.95 because my only options were Western Union or MoneyGram.         </p>\n\n<p>The service that is being provided is indispensable, and ridiculously cheap. If nothing else, crypto will always be a way to send money to family that ensures your family gets the money instead of some giant corporation.          </p>\n\n<p>Every once in a while, I stop to think about it. And I think about how those companies leached money off of the middle class for so long that I don&#39;t feel bad for them at all. Sorry Western Union, you blew it.</p>\n</div><!-- SC_ON -->",
  "score": 247,
  "permalink": "/r/CryptoCurrency/comments/oi3l1w/i_just_want_to_say_that_i_dont_know_if_western/",
  "subreddit": "CryptoCurrency",
  "id": "oi3l1w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday using ALGO, I was able to send $1000 across the country for 0.16¢.\nThat is written correctly. It's not 16¢; it's 16/100 of 1¢. On top of that,\nbecause of the way ALGO rewards are paid with each transaction, that fee doesn't\ncome out of pocket. I can remember a time when sending $50 across…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、ALGOを使って、0.16￠で1000ドルを日本中に送ることができました。\nこれは正しく書かれています。16￠ではなく、1￠の100分の16です。それに加えて\nさらに、ALGOのリワードは取引ごとに支払われるので、その手数料はポケットからは出ません。\nポケットから出てくるわけではありません。私は、かつて50ドルを送金したときのことを思い出しました...",
      "title": "Western Unionがcryptoを生き残れるかどうかはわからないと言いたい。そして、それを神に感謝します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天使用ALGO，我能够以0.16美分向全国各地发送1000美元。\n这个写法是正确的。这不是16美分，而是1美分的16/100。最重要的是。\n因为ALGO的奖励是在每笔交易中支付的，所以这笔费用并没有\n从口袋里掏出来的。我还记得有一次，我把50美元寄给了......",
      "title": "我只想说，我不知道西联汇款是否能在加密货币中生存。并为此感谢上帝。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天使用ALGO，我能夠以0.16美分向全國各地發送1000美元。\n這個寫法是正確的。這不是16美分，而是1美分的16/100。最重要的是。\n因爲ALGO的獎勵是在每筆交易中支付的，所以這筆費用並沒有\n從口袋裏掏出來的。我還記得有一次，我把50美元寄給了......",
      "title": "我只想說，我不知道西聯匯款是否能在加密貨幣中生存。併爲此感謝上帝。"
    }
  ]
}