{
  "author": "repostssleuthbot",
  "the_new_excerpt": "There's a heap of new people joining this sub, a lot of whom are just starting\nout with crypto.\n\nI don't like being the person to tell people what to do, it is your money in the\nend, but the one bit of advice I have for EVERYONE is don't share how much you\nhave invested.\n\nWhy?\n\nBecause you make…",
  "original_created_utc": 1619005510,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブには新しい人がたくさん参加していて、その多くが暗号を始めたばかりです。\n暗号を始めたばかりの人が多いですね。\n\n最終的には自分のお金なので、私は人に何をすべきかを教えたくありません。\n最終的には自分のお金ですから。しかし、皆さんに一つだけアドバイスしたいのは、自分がどれだけ投資したかを共有しないことです。\n投資した金額を公開しないことです。\n\nなぜかって？\n\nなぜなら、あなたは...",
      "title": "投資額を投稿するのはやめましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一大堆新人加入这个子，其中很多人刚刚开始\n的人都是刚开始接触加密货币。\n\n我不喜欢告诉别人该怎么做，因为那是你的钱。\n但我给大家的一个建议是，不要分享你的投资金额。\n投资了多少。\n\n为什么？\n\n因为你让...",
      "title": "不要再公布你的投资额度了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一大堆新人加入這個子，其中很多人剛剛開始\n的人都是剛開始接觸加密貨幣。\n\n我不喜歡告訴別人該怎麼做，因爲那是你的錢。\n但我給大家的一個建議是，不要分享你的投資金額。\n投資了多少。\n\n爲什麼？\n\n因爲你讓...",
      "title": "不要再公佈你的投資額度了。"
    }
  ],
  "title": "STOP posting how much you have invested!",
  "created_utc": 1619091849,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s a heap of new people joining this sub, a lot of whom are just starting out with crypto.</p>\n\n<p>I don&#39;t like being the person to tell people what to do, it is your money in the end, but the one bit of advice I have for EVERYONE is don&#39;t share how much you have invested.</p>\n\n<p>Why?</p>\n\n<p>Because you make yourself a target for scammers. I&#39;m sure that for every 100 new people to join this sub, there&#39;s one or two that are just here to make gains out of other people&#39;s ignorance.</p>\n\n<p>Do. Not. Share. Your. Positions.</p>\n\n<p>Even percentages of what you own (eg 50%btc, 25%ada, 25%eth) is a bad idea.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/mvdvif/stop_posting_how_much_you_have_invested/",
  "subreddit": "CryptoCurrency",
  "id": "mvdvif",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207011
}