{
  "author": "PoliteBrick2002",
  "original_created_utc": 1635849255,
  "title": "Will the melting polar ice caps actually bring on an ice age due to lower ocean salinity?",
  "created_utc": 1635867941,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’ve been reading a book called “A short history of nearly everything” by Bill Bryson. (Very good by the way). \nIt brought up some topics that got me thinking. </p>\n\n<p>As the ice caps melt, huge quantities of fresh water are dumped into the oceans, which I imagine over time would decrease the salinity of the ocean (making it a higher percentage of fresh water). \nBecause fresher water is easier to freeze, would we not see a rebound of ice forming at the poles, and therefore spreading a lot faster, and with the ice reflecting the heat of the sun, be able to expand even further and bring on an ice age? </p>\n\n<p>The reason I brought this up was because I was reading about the Messinian Salinity Crisis that supposedly happened about six million years ago that supposedly brought on the last ice age. \nFor those of you who aren’t too familiar with it; what is thought to have happened was that the continents shifting closed up the straight of Gibraltar, and without constant flow ended up evaporating the Mediterranean. As an entire sea began evaporating, is was brought back to earth as fresh water (rainfall), which desalinised the oceans enough to let it freeze a whole lot easier, reflect the sun a whole lot more and therefore caused an ice age.</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/askscience/comments/ql1bna/will_the_melting_polar_ice_caps_actually_bring_on/",
  "subreddit": "askscience",
  "id": "ql1bna",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I’ve been reading a book called “A short history of nearly everything” by\nBill Bryson. (Very good by the way). It brought up some topics that got me\nthinking.\n\nAs the ice caps melt, huge quantities of fresh water are dumped into the oceans,\nwhich I imagine over time would decrease the salinity of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、ビル・ブライソンの「A short history of nearly everything」という本を読んでいます。\nビル・ブライソン (非常に良い本です）。) この本を読んでいて、いくつかの話題が出てきて\n考えさせられました。\n\n氷冠が溶けると、大量の新鮮な水が海に捨てられます。\n時間が経てば、海の塩分濃度が下がると思うのですが...",
      "title": "極地の氷が溶けると、海の塩分濃度が下がり、実際に氷河期がやってくるのではないか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我一直在读一本名为《几乎所有事物的简史》的书，作者是\n比尔-布赖森。(顺便说一句，非常好）。) 它提出了一些话题，让我\n思考。\n\n随着冰盖的融化，大量的淡水被倒入海洋。\n我想随着时间的推移，这将降低海洋的盐度。",
      "title": "由于海洋盐度降低，极地冰盖的融化是否真的会带来冰期？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我一直在讀一本名爲《幾乎所有事物的簡史》的書，作者是\n比爾-布賴森。(順便說一句，非常好）。) 它提出了一些話題，讓我\n思考。\n\n隨着冰蓋的融化，大量的淡水被倒入海洋。\n我想隨着時間的推移，這將降低海洋的鹽度。",
      "title": "由於海洋鹽度降低，極地冰蓋的融化是否真的會帶來冰期？"
    }
  ]
}