{
  "author": "Klaasiker",
  "the_new_excerpt": "Plenty of people are in FUD. Yes maybe you are in red numbers. It sucks. I went\nthrough the same in 2018 and it really isn't nice to go to your portfolio and\nrealize it's like a wiener in ice cold water. Shrinking and shrinking.\n\nWhat I learned from 2018:\n\n * Try to take this as a chance. Take a…",
  "original_created_utc": 1621251936,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "沢山の人がFUDの中にいます。そう、もしかしたらあなたは赤い数字の中にいるかもしれない。最悪ですね。私は2018年に同じことを経験しました。\n私も2018年に同じような経験をしましたが、自分のポートフォリオを見に行って、氷水に浸かったウィンナーのようだと気づくのは本当に嫌なものです。\n冷たい水に浸かったウィンナーのようなものだと気づくのは、本当に嫌なことです。縮んで縮んで。\n\n2018年から学んだこと。\n\n * チャンスだと思ってやってみてください。Take a...",
      "title": "このディップの時に損をしているからといって、失礼なことを言っても何にもなりません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人都在FUD中。是的，也许你是在红色的数字中。这很糟糕。我经历了\n在2018年也经历了同样的情况，去看你的投资组合，发现它就像冰水里的腊肠一样，真的很不好受。\n意识到它就像冰水中的腊肠。缩水，缩水。\n\n我从2018年学到了什么。\n\n * 试着把这作为一个机会。以...",
      "title": "因为你在这次下跌中亏损而变得粗鲁并没有什么帮助。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人都在FUD中。是的，也許你是在紅色的數字中。這很糟糕。我經歷了\n在2018年也經歷了同樣的情況，去看你的投資組合，發現它就像冰水裏的臘腸一樣，真的很不好受。\n意識到它就像冰水中的臘腸。縮水，縮水。\n\n我從2018年學到了什麼。\n\n * 試着把這作爲一個機會。以...",
      "title": "因爲你在這次下跌中虧損而變得粗魯並沒有什麼幫助。"
    }
  ],
  "title": "Being rude because you are losing money during this dip doesn't help.",
  "created_utc": 1621265432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Plenty of people are in FUD. Yes maybe you are in red numbers. It sucks. I went through the same in 2018 and it really isn&#39;t nice to go to your portfolio and realize it&#39;s like a wiener in ice cold water. Shrinking and shrinking.</p>\n\n<p>What I learned from 2018:</p>\n\n<ul>\n<li>Try to take this as a chance. Take a look at coins with massive potential after this dip</li>\n<li>Do some Cost Average and buy at a lower price.</li>\n<li>You can&#39;t change the situation you are in. If it&#39;s too stressfull maybe you should consider quiting Crypto.</li>\n<li>We all don&#39;t want to lose money. So if you are rude or salty that makes it even worse.</li>\n<li>Grab a beer, chill out, enjoy life. Don&#39;t waste your time looking if the market goes up every 10 seconds.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 1188,
  "permalink": "/r/CryptoCurrency/comments/nee1dp/being_rude_because_you_are_losing_money_during/",
  "subreddit": "CryptoCurrency",
  "id": "nee1dp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799673
}