{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "You are not paid because of how useful you are. You are not paid according to your contribution to society. You're not even actually 'paid' at all. You're simply on one side of a trade.\n\nIf you work for an hourly wage, you are not 'earning money'. You are making a trade, time for money, and it's a shit trade, because no matter how rich you ever become you cannot buy more time. Time, when compared to money, has nearly infinite value. Any trade of time for money, is a bad deal. A lot of the time you don't really have a choice, but a shit deal is still a shit deal. Someone else is getting the better end of this equation, and they're able to fleece you like this because they possess more trading and bargaining power than you do.\n\nWhen the Fed decides to print money and lower interest rates, what they are doing, put simply, is increasing the trading and bargaining power of nearly everyone. This causes economies to overheat and rapid inflation, because the balance of trading power did not change, it just got pumped up on steroids. Because everyone now has way more trading power then they had before, there is a shortage of laborers and things to buy. Inflation is the natural response of trading power returning to the mean. This may sound overly simple, but that's because it really is just that simple.\n\nTo sum it up, if your goal in life is to become wealthy, your aim is not to acquire more money. Your aim is to acquire more trading and bargaining power. The end\n\n&amp;#x200B;\n\nPS: I am not saying you're an idiot if you have a job, how you want to live your life is entirely up to you. Nor do I even hate work, I like it. But your job does not make you morally superior. It makes you someone who is willing to take a bad trade. There's a lot of reasons people have to take that bad trade, but it's a bad trade, get out of it as soon as you can and don't let people make you feel guilty. I'm sure a lot of people who think that they \"earn a living\" are going to be pissed, but hey, fuck em.\n\n&amp;#x200B;\n\nPPS: \"Most of us aren't born into money\" If you learn to listen to wise advice, your children will be",
  "author_fullname": "t2_16u5fg",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Money is never earned. It is only traded.",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "Discussion"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "question",
  "downs": 0,
  "thumbnail_height": null,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_sb2491",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.84,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 1006,
  "total_awards_received": 12,
  "media_embed": {},
  "thumbnail_width": null,
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Discussion",
  "can_mod_post": false,
  "score": 1006,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "self",
  "edited": 1642984982,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 3
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1642967385,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You are not paid because of how useful you are. You are not paid according to your contribution to society. You&amp;#39;re not even actually &amp;#39;paid&amp;#39; at all. You&amp;#39;re simply on one side of a trade.&lt;/p&gt;\n\n&lt;p&gt;If you work for an hourly wage, you are not &amp;#39;earning money&amp;#39;. You are making a trade, time for money, and it&amp;#39;s a shit trade, because no matter how rich you ever become you cannot buy more time. Time, when compared to money, has nearly infinite value. Any trade of time for money, is a bad deal. A lot of the time you don&amp;#39;t really have a choice, but a shit deal is still a shit deal. Someone else is getting the better end of this equation, and they&amp;#39;re able to fleece you like this because they possess more trading and bargaining power than you do.&lt;/p&gt;\n\n&lt;p&gt;When the Fed decides to print money and lower interest rates, what they are doing, put simply, is increasing the trading and bargaining power of nearly everyone. This causes economies to overheat and rapid inflation, because the balance of trading power did not change, it just got pumped up on steroids. Because everyone now has way more trading power then they had before, there is a shortage of laborers and things to buy. Inflation is the natural response of trading power returning to the mean. This may sound overly simple, but that&amp;#39;s because it really is just that simple.&lt;/p&gt;\n\n&lt;p&gt;To sum it up, if your goal in life is to become wealthy, your aim is not to acquire more money. Your aim is to acquire more trading and bargaining power. The end&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;PS: I am not saying you&amp;#39;re an idiot if you have a job, how you want to live your life is entirely up to you. Nor do I even hate work, I like it. But your job does not make you morally superior. It makes you someone who is willing to take a bad trade. There&amp;#39;s a lot of reasons people have to take that bad trade, but it&amp;#39;s a bad trade, get out of it as soon as you can and don&amp;#39;t let people make you feel guilty. I&amp;#39;m sure a lot of people who think that they &amp;quot;earn a living&amp;quot; are going to be pissed, but hey, fuck em.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;PPS: &amp;quot;Most of us aren&amp;#39;t born into money&amp;quot; If you learn to listen to wise advice, your children will be&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#800080",
  "id": "sb2491",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "animalturds",
  "discussion_type": null,
  "num_comments": 340,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/wallstreetbets/comments/sb2491/money_is_never_earned_it_is_only_traded/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/sb2491/money_is_never_earned_it_is_only_traded/",
  "subreddit_subscribers": 11541082,
  "created_utc": 1643010210,
  "num_crossposts": 2,
  "media": null,
  "is_video": false,
  "original_created_utc": 1642967385,
  "the_new_excerpt": "You are not paid because of how useful you are. You are not paid according to\nyour contribution to society. You're not even actually 'paid' at all. You're\nsimply on one side of a trade.\n\nIf you work for an hourly wage, you are not 'earning money'. You are making a\ntrade, time for money, and it's a…"
}