{
  "author": "Obi_Wan_Shinobi_",
  "original_created_utc": 1652737827,
  "title": "Do you think Americans will ever wake up to the fact that all their notions of culture war are a distraction from the class war?",
  "created_utc": 1652748259,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems all over America more and more poor people are killing other poor people based on perceived exaggerated differences, with mouth pieces on Fox, CNN and elsewhere encouraging these perceived divisions. Will the average American (and Canadian, since this stuff is happening more and more where I&amp;#39;m from too, but to less of an extreme) ever again see that they have more in common with their neighbor than they do differences by a long shot? For that matter, will humanity ever come to see that we&amp;#39;re on a shifting ball of rock and water floating around a giant nuclear reactor and &lt;em&gt;no one actually knows&lt;/em&gt; &lt;strong&gt;&lt;em&gt;why&lt;/em&gt;&lt;/strong&gt;, and that that alone makes us all equals with more to accomplish together than as waring tribes? How long will 99% of us feel the need to fight each other while 1% of us takes bets on who comes out ahead?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/ur71q8/do_you_think_americans_will_ever_wake_up_to_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "ur71q8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It seems all over America more and more poor people are killing other poor\npeople based on perceived exaggerated differences, with mouth pieces on Fox, CNN\nand elsewhere encouraging these perceived divisions. Will the average American\n(and Canadian, since this stuff is happening more and more where…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカでは、ますます多くの貧しい人々が、他の貧しい人々を殺しているようです。\nアメリカでは、より多くの貧しい人々が、認識された誇張された差異に基づき、他の貧しい人々を殺しているようだ。\nなどが、このような対立を助長している。平均的なアメリカ人は\n(平均的なアメリカ人（そしてカナダ人、このようなことがますます多くなってきているので...",
      "title": "アメリカ人は、文化戦争という概念はすべて階級闘争からの目くらましであるという事実に目覚めることができると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在美国各地，似乎越来越多的穷人正在杀害其他穷人。\n在福克斯、CNN和其他地方的口中，越来越多的穷人正在杀害其他穷人，因为他们认为有夸大的差异。\n和其他地方的喉舌鼓励这些感知到的分歧。普通美国人是否会\n(和加拿大人，因为这种事情在越来越多的地方发生......",
      "title": "你认为美国人是否会清醒地认识到，他们所有的文化战争概念都是对阶级战争的一种干扰？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在美國各地，似乎越來越多的窮人正在殺害其他窮人。\n在福克斯、CNN和其他地方的口中，越來越多的窮人正在殺害其他窮人，因爲他們認爲有誇大的差異。\n和其他地方的喉舌鼓勵這些感知到的分歧。普通美國人是否會\n(和加拿大人，因爲這種事情在越來越多的地方發生......",
      "title": "你認爲美國人是否會清醒地認識到，他們所有的文化戰爭概念都是對階級戰爭的一種干擾？"
    }
  ]
}