{
  "author": "THICC_DICC_PRICC",
  "the_new_excerpt": "I can tell you right now with complete confidence that the only thing brokers\nwho halted trading are guilty of was bad PR and nothing else. I was pissed when\ntrading was halted, but now I’m just upset that I’m hearing people trash some\ntrading apps which did absolutely nothing wrong and has done so…",
  "original_created_utc": 1612053898,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我现在可以很有信心地告诉你，唯一的事情经纪人\n谁停止交易是有罪的 是坏公关，没有别的。我很生气，当\n交易被停止了，但现在我只是不高兴，我听到人们捣毁一些。\n交易应用程序，绝对没有做错任何事情，并已这样做... ...",
      "title": "解释导致交易涨停的原因，并为小程序交易辩护"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在可以很有信心地告訴你，唯一的事情經紀人\n誰停止交易是有罪的 是壞公關，沒有別的。我很生氣，當\n交易被停止了，但現在我只是不高興，我聽到人們搗毀一些。\n交易應用程序，絕對沒有做錯任何事情，並已這樣做... ...",
      "title": "解釋導致交易漲停的原因，併爲小程序交易辯護"
    }
  ],
  "title": "An explanation of what caused the trading halt and a defense for small trading apps",
  "created_utc": 1612062438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can tell you right now with complete confidence that the only thing brokers who halted trading are guilty of was bad PR and nothing else. I was pissed when trading was halted, but now I’m just upset that I’m hearing people trash some trading apps which did absolutely nothing wrong and has done so much good in the past years. People are piling on, politicians from left right and center are wrapping their own agenda around it, and somehow we finally saw AOC and Ben Shapiro agree on something. People are thinking “they” control it from the top and they stopped it because they were scared of us. I can assure you none of that is true, it is conspiratorial thinking and it is all nonsense and unfounded.</p>\n\n<p>Wanna know why? Read on, education ahead, and it’s good for you. </p>\n\n<p>When people in aggregate from exchange A buy 1 million dollar worth of a stock, if there’s not enough people selling that stock on exchange A, that stock needs to come from exchange B. That means that 1 million needs to be transferred from exchange A to B. Money transfer is very complicated (as you’ve probably seen with wire transfers) and take 2 business days to clear even for the big guys. Now, what would happen if before money clears, exchange A collapses and goes bust? Exchange B is fucked. It still promised and have to give its users  by law who sold those shares a 1 million dollars. Enter: Depository Trust &amp; Clearing Corporation(DTCC)</p>\n\n<p>DTCC is probably the biggest bank in the world and you’ve never heard of it. It acts as the man in the middle insurance company of sorts, it’s a self regulating private entity on wallstreet who’s existence is required by law. It exists to absorb all the risk of ripple effects of an exchange going bust and impacting other exchange. They basically want to take the risk of “what if that market we’re trading with doesn’t pay us?” completely off a brokers book. Also note, DTCC is not just for stock brokers, it’s for banks, institutional investors, hedge funds, mutual funds, all of them.</p>\n\n<p>In my example, DTCC fronts exchange A the cash by guaranteeing the 1 mil for exchange B. All good so far right? Well there’s a small catch, DTCC needs to still protect itself from going insolvent, since it’s basically the backbone of the market, their chances of going insolvent cannot be even 0.000001%. </p>\n\n<p>So they have this formula that calculates an upfront collateral for a particular stock. This collateral needs to be given cash to DTCC on the time of the trade. It’s not speculative, it’s just math and it takes a lot f factors in like the broker’s finances(how much cash they got on reserve, etc.) and also factors in the stock being traded. Usually it comes down to 1-4% of the security. Say that 1 mil I mentioned earlier was all SPY stock, since it’s safe and all the upfront fee is 1%. So when the 1 mil buy happens, exchange A immediately gives $10,000 to DTCC, and starts a wire of 1 million to fund B. Once the transaction clears, DTCC gives the $10,000 back.</p>\n\n<p>All that was happening with GameStop, but then the morning the guys got block, DTCC raised their collateral requirement for the meme stocks to 100%. Why? Well, because it’s volatile as fuck and they did not like the odds of keeping it lower. We all know that this is a bubble and given that so many retail investors are buying this stock on margin at $300+ which is for sure crashing to $20, most likely in an instant, there’s a solid chance some exchanges might go broke over it, so they can’t insure it.</p>\n\n<p>Now what does this mean for exchange A? That means for every 1 million dollars of GameStop, exchange A needs to wire 1 mil to to exchange B AND immediately send another million cash to DTCC. Well now we got a sticky situation, at the current market cap, we’re talking hundreds of billions (that’s not a typo) that these firms need to cough up to DTCC for 2 business days! They simply don’t have the money so they halted it. That’s it. Then the next day they secured some loans, and managed to re offer the stocks at a limited quantity that their loans enabled them to.</p>\n\n<p>One small clarification, I simplified my explanation by combining clearing firms and brokerages as one entity. In reality they’re usually separate(sometimes they’re not, for example the popular trading app I can’t name does their own clearing), the connection goes broker -&gt; clearing firm -&gt; DTC. Clearing firms are actually the companies that are trying to secure loans to support more, and it’s the clearing firms who don’t have enough money to pay DTC, so they just tell brokers “sorry, no GME, can’t clear it”</p>\n\n<p>“Dude fuck DTCC, they’re evil, they’re the ones controlling from the top they should’ve left us be” </p>\n\n<p>Well last time they were too slow to raise the collateral was 2008. Lehman which was a clearing firm collapsed. Finally DTCC did what it was supposed to do! They paid out $500bn to clear all of Lehman’s outstanding transactions. But that’s not all, since DTCC was slow to raise their rates for certain securities at the time, they were legit at the risk of going insolvent if more banks and hedge funds collapsed. Enter Bailout, a loan to help everyone sort their shit out, clear out their transactions and not collapse. Had enough banks and hedge funds collapsed to push DTCC into insolvency, the entire United States paper market(stocks, bonds, etc.) would’ve collapsed(total market breakdown). Little known fact: DTCC technically owns almost all paper assets in the US, including yours and mine in a trust. Technically we are just beneficiaries of those stocks. Also, government has every right to take those away from you due to “national emergency”. Fun fact eh?</p>\n\n<p>“DTCC is helping out their wallstreet buddies” </p>\n\n<p>No, they’re protecting the system, they raise collateral for all ultra volatile securities. They’d do it if hedge funds were profiting too.</p>\n\n<p>“But why some markets did allow buying?” </p>\n\n<p>Well their clearing firms did, and some did their own clearing and they had enough cash to allow trading. And if you noticed, it was a ripple effect. TD was a clearing firm that was first to stop doing GME, then a bunch of brokers ran to other clearing firms, and now a clearing firm is servicing their existing brokers and all the refugees from TD, and naturally they got overloaded with GME. So they fell, and now two sets of refugees went and crash another, and eventually almost all brokers stopped offering GME and friends. </p>\n\n<p>“Why sell only then?”</p>\n\n<p>Selling doesn’t require DTCC collateral, cuz a stock is going out not money. The stock is just a digital signature in DTCC’s database, it ain’t going anywhere, it’s not gonna go insolvent. Money on the other hand is more complicated and not just a digital signature on a database, it’s no guarantee you’ll get it from a buyer until it’s in your vaults, so you need a collateral until you get it</p>\n\n<p>“Why was so and so broker selling GME without my permission”</p>\n\n<p>Alright dude this one on you for getting a margin account, you agreed to it and all brokers do it. You know how those boomers alway tell you don’t get a margin account? This is why</p>\n\n<p>“Why do we need DTCC anyways?”</p>\n\n<p>They prevent cascading failures that doomers wish for on their birthdays. If a broker goes bust, suddenly that $2bn that broker was supposed to send to some other broker goes poof, and now that other broker is in the negative and goes bust, and so do all their debts to other companies</p>\n\n<p>“Does DTCC raising the collateral requirement mean we were at risk of collapsing the financial system?”</p>\n\n<p>Yea probably, but that’s why they raised the rates</p>\n\n<p>“Why can’t markets just trade inside themselves and avoid sending money and DTCC”</p>\n\n<p>They still need a transaction with DTCC because you all have your own bank accounts on a brokerage and DTCC being the owner of all stock needs to know which account which stock belongs to</p>\n\n<p>“Wtf why does it take 2 business days to transfer money? Can’t they Zelle or some shit?”</p>\n\n<p>It’s how things work at that large of a scale, they record transactions all day, end of the day they add it all up and move the money. One day to take the money from broker the clearing house, one day to move the money from clearing house to the receiving broker. It’s the same system as ACH transfers, which stands for automated clearing house</p>\n\n<p>“Why is DTCC private and so centralized, break it apart!”</p>\n\n<p>[blockchain shills have entered the chat]</p>\n</div><!-- SC_ON -->",
  "score": 616,
  "permalink": "/r/stocks/comments/l90an8/an_explanation_of_what_caused_the_trading_halt/",
  "subreddit": "stocks",
  "id": "l90an8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537985
}