{
  "author": "DoubleFaulty1",
  "original_created_utc": 1633524887,
  "title": "Bill Gates said, “The way cryptocurrency works today money is spent on bitcoin instead of laptops. It’d be good to get rid of that.”",
  "created_utc": 1633541445,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a recent fax machine message, noted laptop monger Bill Gates lamented the popularity of cryptocurrencies. “Bitcoin doesn’t do anything. It makes no sense. With two trillion dollars they could have bought a laptop that can sometimes run Excel without crashing.”</p>\n\n<p>Warren Buffet, replying via telegram, (the paper kind) said, “agreed. Investment should be limited to assets we already own. Preferably those that existed before I wore Depends. For consumer safety.”</p>\n\n<p>In recent congressional testimony Securities and Exchange Commission chairman Gary Gensler said, “consumer safety is my number one goal. Consumer safety means only allowing investment in assets that big political donors own. This ensures future donations so that I can safely ignore consumers.”</p>\n</div><!-- SC_ON -->",
  "score": 240,
  "permalink": "/r/CryptoCurrency/comments/q2jutr/bill_gates_said_the_way_cryptocurrency_works/",
  "subreddit": "CryptoCurrency",
  "id": "q2jutr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In a recent fax machine message, noted laptop monger Bill Gates lamented the\npopularity of cryptocurrencies. “Bitcoin doesn’t do anything. It makes no sense.\nWith two trillion dollars they could have bought a laptop that can sometimes run\nExcel without crashing.”\n\nWarren Buffet, replying via…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビル・ゲイツ氏は、最近のファックスメッセージの中で、暗号通貨の人気を嘆いていました。\n暗号通貨の人気を嘆いています。\"ビットコインは何もしない。何の意味もありません。\n2兆ドルもあれば、たまにエクセルがクラッシュせずに動くノートパソコンが買えただろう。\nExcelをクラッシュせずに動かすことができるノートパソコンを買うことができたでしょう。\"\n\nウォーレン・バフェットは、...を通じて返信しています。",
      "title": "ビル・ゲイツ氏は、「暗号通貨の仕組みでは、今のお金はラップトップではなくビットコインに使われています。それをなくすのはいいことだ」と述べています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在最近的一份传真机信息中，著名的笔记本电脑制造者比尔-盖茨感叹道\n加密货币的流行。\"比特币没有任何作用。它没有任何意义。\n用两万亿美元，他们可以买一台笔记本电脑，有时可以运行\nExcel而不崩溃。\"\n\n沃伦-巴菲特(Warren Buffet)，通过...",
      "title": "比尔-盖茨说，\"今天加密货币的工作方式是把钱花在比特币上，而不是花在笔记本电脑上。摆脱这种情况会很好\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近的一份傳真機信息中，著名的筆記本電腦製造者比爾-蓋茨感嘆道\n加密貨幣的流行。\"比特幣沒有任何作用。它沒有任何意義。\n用兩萬億美元，他們可以買一臺筆記本電腦，有時可以運行\nExcel而不崩潰。\"\n\n沃倫-巴菲特(Warren Buffet)，通過...",
      "title": "比爾-蓋茨說，\"今天加密貨幣的工作方式是把錢花在比特幣上，而不是花在筆記本電腦上。擺脫這種情況會很好\"。"
    }
  ]
}