{
  "author": "Sabast-",
  "original_created_utc": 1652306024,
  "title": "Seriously chill - Coinbase is not going bankrupt this crash, you're not going to lose your coins",
  "created_utc": 1652330665,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s a run on Coinbase. Hysteria in &lt;a href=\"/r/Coinbase\"&gt;r/Coinbase&lt;/a&gt;, you&amp;#39;d think there&amp;#39;s blood running in the streets.&lt;/p&gt;\n\n&lt;p&gt;As I myself can attest, many people are unable to get their USD or coins out of Coinbase. Mysterious error messages happen if you try. (I can put money in and buy though.)&lt;/p&gt;\n\n&lt;p&gt;Why? This is speculation but you know it&amp;#39;s true: a classic bank run. All the hysteria and FUD on Reddit is contributing.&lt;/p&gt;\n\n&lt;p&gt;It happens every crash like clockwork.&lt;/p&gt;\n\n&lt;p&gt;Coinbase simply doesn&amp;#39;t have the cash to cover the run. Like all CEXes including Kraken and Binance, they&amp;#39;re fractionally reserved. The balances shown are not actually on any blockchain or cash vault - until you withdraw or transfer. (In fact it&amp;#39;s very possible that once the last BTC is mined or close to it, that someday CEXes will sell more BTC combined than actually exists.)&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s nothing inherently &lt;em&gt;wrong&lt;/em&gt; with that. Nowadays banks can get away without &lt;em&gt;any&lt;/em&gt; reserves. But the FUD on Reddit is not helping, so blame your fellow Redditors. I&amp;#39;m not saying I like it, but it is the way the world works for now. And in a world economic system that falls apart if constant exponential growth is not maintained, what else do you expect? Don&amp;#39;t like it? Vote for people who promise to change that fundamentally flawed system.&lt;/p&gt;\n\n&lt;p&gt;Either way, &lt;strong&gt;Coinbase is not going bankrupt anytime soon, certainly not this crash&lt;/strong&gt;. Relax. They&amp;#39;ll be back online. I&amp;#39;m not happy about it either, but take a frickin chill pill already.&lt;/p&gt;\n\n&lt;p&gt;Each time this happens, it seems they get better at covering runs. Maybe they increase their reserve policies each time, who knows. Either way, you&amp;#39;ll get your coins. Sucks now, no doubt, but you aren&amp;#39;t going to lose your money. Not this time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/unl1dp/seriously_chill_coinbase_is_not_going_bankrupt/",
  "subreddit": "CryptoCurrency",
  "id": "unl1dp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There's a run on Coinbase. Hysteria in r/Coinbase [/r/Coinbase], you'd think\nthere's blood running in the streets.\n\nAs I myself can attest, many people are unable to get their USD or coins out of\nCoinbase. Mysterious error messages happen if you try. (I can put money in and\nbuy though.)\n\nWhy? This…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Coinbaseに逃げ込みがある。r/Coinbase [/r/Coinbase] のヒステリーは、あなたは思うでしょう。\n血が流れているようです。\n\n私自身が証明しているように、多くの人が米ドルやコインを取り出せなくなり\nコインベース 試しにやってみると謎のエラーメッセージが起こる。(お金は入れられるし\n買えますが)。\n\nなんでだろう？これって・・・。",
      "title": "マジで冷やかし - Coinbaseはこの暴落で倒産しない、あなたのコインを失うことはないだろう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Coinbase上出现了挤兑。在r/Coinbase [/r/Coinbase]的歇斯底里，你会认为\n街上有血在流淌。\n\n我自己可以证明，许多人无法将他们的美元或钱币从\nCoinbase。如果你尝试，会出现神秘的错误信息。(我可以把钱放进去并\n买）。\n\n为什么？这...",
      "title": "认真冷静 - Coinbase不会在这次崩溃中破产，你不会失去你的硬币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Coinbase上出現了擠兌。在r/Coinbase [/r/Coinbase]的歇斯底里，你會認爲\n街上有血在流淌。\n\n我自己可以證明，許多人無法將他們的美元或錢幣從\nCoinbase。如果你嘗試，會出現神祕的錯誤信息。(我可以把錢放進去並\n買）。\n\n爲什麼？這...",
      "title": "認真冷靜 - Coinbase不會在這次崩潰中破產，你不會失去你的硬幣"
    }
  ]
}