{
  "author": "dmiddy",
  "original_created_utc": 1637195325,
  "title": "Eth is good, and I'm tired of pretending it's not",
  "created_utc": 1637206931,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unlike the current popular post bashing Ethereum, this post will actually be based on fact and reality.</p>\n\n<p>The main thesis of this post being that Ethereum is amazing and will change the world (If I can&#39;t be idealistic on Reddit where can I be?)</p>\n\n<h1>Ethereum Is Highly Decentralized</h1>\n\n<p>The initial token distributions for many popular chains can be found <a href=\"https://medium.com/open-source-x/what-does-increased-insider-ownership-in-public-blockchains-mean-97f8e9e50368\">here</a>  </p>\n\n<p>What you&#39;ll see when you click the link is that, unlike the other post claims, Ethereum&#39;s token distribution is not only not centralized, it is among the most fair distributions in the history of crypto.  </p>\n\n<p>Shoutout to Cardano, Cosmos, and Tezos here as well.  </p>\n\n<p>Getting past token distribution there is the number of nodes that run the Ethereum blockchain.  </p>\n\n<p>Currently there are about 2700 nodes helping to secure the Ethereum blockchain as well as about 200,000 validators ready to secure it when PoS goes live in 2022.  Many of these validators will be run by exchanges or other companies, of course. The point is that anyone with 32 Eth can run a validator because the hardware requirements are low enough.</p>\n\n<p>Compare this to 120 for Algorand, 450 for Tezos(there are other nodes, but the bottleneck seems to be the nodes that write blocks), 1100 for Solana(even though other factors make Solana extremely centralized), and 21 for Binanace.  </p>\n\n<p>Another valid critique to Ethereum&#39;s Decentralization could be its client diversity. Currently about 50% of nodes are running the same client. This could cause issues when it comes to bugs found in that client, but it is fairly trivial to switch clients should something go wrong.  </p>\n\n<p>With all these factors(and more) taken into account, it is not up for debate that Ethereum is in the top tier of chains when it comes to Decentralization.  </p>\n\n<p>&quot;<em>Okay but the person said Proof Of Stake will centralize it!&quot;</em></p>\n\n<p>Unsurprisingly they are incorrect yet again. While it&#39;s valid to speculate that Proof of Stake could lead to token concentration (ie Coinbase running a ton of validators and offering staking services to users), it is incorrect to assume there are zero solutions in place to solve this.  </p>\n\n<p>Literally this week <a href=\"https://www.ethernodes.org/\">Rocketpool</a> launched. Rocketpool is a Decentralized Eth staking platform that allows people with 16 Eth to run validator nodes with the help of others that want to stake less than 16 Eth.  </p>\n\n<p>There&#39;s a reason very few new projects are launching as Proof of Work chains.</p>\n\n<p>&#x200B;</p>\n\n<h1>Ethereum Governance - Who&#39;s Really In Control?</h1>\n\n<p>The original post implied that Ethereum was captured by a central authority that hands decisions and orders down as easily as they fart in the wind.  </p>\n\n<p>Obviously this isn&#39;t true. Yes, the Ethereum Foundation exists and operates in pursuit of furthing the Ethereum ecosystem. No, it does not &quot;head&quot; the chain nor does it make any decisions.  </p>\n\n<p><a href=\"https://ethereum.org/en/governance/\">Ethereum&#39;s governance happens off-chain in the social layer.</a></p>\n\n<p>The community(devs, thought-leaders, regular users, validators, node-runners) is what makes the decisions. The valid criticism here is that Devs have too heavy a role in what changes are accepted, because they know the most about how Ethereum works under the hood. To date this has not been an issue.</p>\n\n<p>&#x200B;</p>\n\n<h1>Ethereum&#39;s Design - EIP 1559 is good</h1>\n\n<p>EIP-1559 does indeed make fees more stable. It was <strong><em>never meant to change how high fees were</em></strong>.   </p>\n\n<p>The increase in fees is due to the market heating up and NFTs taking off again right as it was implemented. It really is that simple. Amazing right?  </p>\n\n<p><em>&quot;Okay, whatever, the guy was wrong. What about the damn gas fees? Surely that means Ethereum is broken.&quot;</em>  </p>\n\n<p>Ethereum&#39;s gas fees are extremely high right now. They will remain high forever, on Layer 1.  </p>\n\n<p>Ethereum(and Tezos) have chosen to scale via <strong><em>Layer 2.</em></strong>  </p>\n\n<p>This means that very soon the average Ethereum user will never have to interact with layer 1 and will never have to pay extremely high gas fees. These projects are already live and dApps are being ported to them as we speak. I think they even hit a new ATH in total value locked this week!  </p>\n\n<p>These layer 2s are much more scalable than any layer 1 solution out there (like Solana, BSC) and I believe they will eventually consume the other layer-1-only chains.  </p>\n\n<p>&#x200B;</p>\n\n<p>To address the DAO hack:  </p>\n\n<p>In June 2016, someone found a bug in a smart contract that allowed them to drain millions of dollars worth of Ethereum. The Eth community at the time got together and made the difficult decision to roll the chain back and rescue those stolen funds. The community was split on this decision and it resulted in a hard fork, thus the creation of Ethereum Classic.  </p>\n\n<p>There is nobody serious in the Ethereum community that does not recognize the gravity of what took place there. Ethereum has since not had an incident anywhere close to that, and given how battle-tested it now is and how diverse the community is, I&#39;m comfortable saying nothing like that can ever happen again. Building smart contract platforms is hard and they get more and more secure as time goes on, not less.  </p>\n\n<p>&#x200B;</p>\n\n<p>TLDR:  </p>\n\n<p>Original poster is severely underinformed due to too much exposure to maximalism. Ethereum is highly decentralized, highly secure, and highly scalable.</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/6UFW0p5KCRHmA_9LIUp5PRLYKiSsT89L6YxlgZiaBkI.jpg?auto=webp&s=66c18529c2cc792e41caa7fb00399283f11f9583",
          "width": 1200,
          "height": 675
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/6UFW0p5KCRHmA_9LIUp5PRLYKiSsT89L6YxlgZiaBkI.jpg?width=108&crop=smart&auto=webp&s=6ee60144a740e4c68f144d9aa6307fbe03108b40",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/6UFW0p5KCRHmA_9LIUp5PRLYKiSsT89L6YxlgZiaBkI.jpg?width=216&crop=smart&auto=webp&s=b662f989e773cb24e1651e8d84ba3f81e8b2d2c0",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/6UFW0p5KCRHmA_9LIUp5PRLYKiSsT89L6YxlgZiaBkI.jpg?width=320&crop=smart&auto=webp&s=a852d9d1b9232ad13b3e421ff3a3becee91e2923",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/6UFW0p5KCRHmA_9LIUp5PRLYKiSsT89L6YxlgZiaBkI.jpg?width=640&crop=smart&auto=webp&s=d3a83fb657b36cf55a71b5952b30550e9d40c6b6",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/6UFW0p5KCRHmA_9LIUp5PRLYKiSsT89L6YxlgZiaBkI.jpg?width=960&crop=smart&auto=webp&s=afafb0117447fb5401a54c8d948faa72b88ec9db",
            "width": 960,
            "height": 540
          },
          {
            "url": "https://external-preview.redd.it/6UFW0p5KCRHmA_9LIUp5PRLYKiSsT89L6YxlgZiaBkI.jpg?width=1080&crop=smart&auto=webp&s=cd3cfe9a7cf700a0f8042386959465bf97342e2c",
            "width": 1080,
            "height": 607
          }
        ],
        "variants": {},
        "id": "Lk-k7oRg0wm1jCEv16b3TfzJ2qF28TKSer3kCE3dasY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qwd407/eth_is_good_and_im_tired_of_pretending_its_not/",
  "subreddit": "CryptoCurrency",
  "id": "qwd407",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unlike the current popular post bashing Ethereum, this post will actually be\nbased on fact and reality.\n\nThe main thesis of this post being that Ethereum is amazing and will change the\nworld (If I can't be idealistic on Reddit where can I be?)\n\n\nETHEREUM IS HIGHLY DECENTRALIZED\n\nThe initial token…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今流行りのイーサリアムを叩く記事とは違い、この記事は実際に\n事実と現実に基づいています。\n\nこの記事のメインテーゼは、Ethereumは素晴らしく、世界を変えるだろうということです。\n世界を変えるだろう」というものです（Redditで理想を語らずして何を語れというのでしょう）。\n\n\nイーサリアムは高度に分散化されている\n\n初期トークン...",
      "title": "イーサンはいいものだ、そうでないふりをするのはもう疲れた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "与目前流行的抨击以太坊的帖子不同，这篇帖子实际上将是\n基于事实和现实。\n\n这篇帖子的主要论点是，以太坊是惊人的，将改变世界。\n世界（如果我不能在Reddit上保持理想主义，我还能在哪里？）\n\n\n以太坊是高度去中心化的\n\n最初的代币...",
      "title": "道德是好的，我已经厌倦了假装它不存在。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與目前流行的抨擊以太坊的帖子不同，這篇帖子實際上將是\n基於事實和現實。\n\n這篇帖子的主要論點是，以太坊是驚人的，將改變世界。\n世界（如果我不能在Reddit上保持理想主義，我還能在哪裏？）\n\n\n以太坊是高度去中心化的\n\n最初的代幣...",
      "title": "道德是好的，我已經厭倦了假裝它不存在。"
    }
  ]
}