{
  "author": "Samerdown",
  "the_new_excerpt": "I know this is pretty controversial, but I’ve been really skeptical of a lot of\nthe racial unrest in the US recently because it seems that a lot of people are\njumping to conclusions. There are certainly race issues, but it doesn’t seem\nlike many people are addressing actual facts and most of the…",
  "original_created_utc": 1619635254,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはかなり議論の余地があると思いますが、私は最近のアメリカにおける多くの人種的騒動に本当に懐疑的でした。\nなぜなら、多くの人が結論を急ぎすぎているように思えるからです。\nなぜなら、多くの人が結論に飛びついているように見えるからです。確かに人種問題はありますが、多くの人が実際の事実に触れているようには見えません。\nしかし、多くの人が実際の事実を取り上げているようには見えませんし、ほとんどの人が...",
      "title": "私たちは出来事を人種差別の産物だと決めつけるのが早すぎると感じている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这很有争议，但我一直对美国最近的很多种族骚乱持怀疑态度。\n我知道这很有争议，但我对最近美国的很多种族骚乱持怀疑态度，因为似乎很多人都在下结论。\n妄下结论。当然有种族问题，但似乎并没有\n好像很多人都在处理实际的事实，而且大部分的...",
      "title": "还有人觉得我们太急于给事件贴上种族主义产物的标签吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這很有爭議，但我一直對美國最近的很多種族騷亂持懷疑態度。\n我知道這很有爭議，但我對最近美國的很多種族騷亂持懷疑態度，因爲似乎很多人都在下結論。\n妄下結論。當然有種族問題，但似乎並沒有\n好像很多人都在處理實際的事實，而且大部分的...",
      "title": "還有人覺得我們太急於給事件貼上種族主義產物的標籤嗎？"
    }
  ],
  "title": "Does anyone else feel like we are too quick to label events as a product of racism?",
  "created_utc": 1619652499,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know this is pretty controversial, but I’ve been really skeptical of a lot of the racial unrest in the US recently because it seems that a lot of people are jumping to conclusions. There are certainly race issues, but it doesn’t seem like many people are addressing actual facts and most of the information I see circulated is anecdotal. I personally don’t see any good in touting something as racism unless there is clear evidence that suggests that, because otherwise you can claim any altercation between two races is fueled by racism. Just saying that it feels like racism seems like a useless argument to me. I think these movements get pushed and everyone jumps on because people have the urge to get up in arms and pin the blame on something and it’s easy to do that when you boil events down to racism. What’s more is it’s difficult to call out some of this behavior without being labeled a racist yourself. I find it difficult to bring this up because it seems like few people around share this concern. Does anyone agree or maybe have some other perspective they would like to share?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/n0lnmn/does_anyone_else_feel_like_we_are_too_quick_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "n0lnmn",
  "is_self": true,
  "media": null,
  "is_video": false
}