{
  "author": "Reiimnz",
  "original_created_utc": 1654774524,
  "title": "Why is it so uncommon to see older women in relationships with younger men compared to the opposite?",
  "created_utc": 1654786136,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There&amp;#39;s definetly a greater distribution of men dating women half their age than women doing the same. I&amp;#39;ve met plenty of women dating men at 10-20+ years their own age, but have never in my life met a man dating a woman older than himself by a similar gap. I&amp;#39;m sure there are plenty of men and women who would love a similar relationship dynamic. Is there just some sort of unconscious stigma behind this or am I missing something else entirely?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 176,
  "permalink": "/r/TooAfraidToAsk/comments/v8eu0e/why_is_it_so_uncommon_to_see_older_women_in/",
  "subreddit": "TooAfraidToAsk",
  "id": "v8eu0e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "There's definetly a greater distribution of men dating women half their age than\nwomen doing the same. I've met plenty of women dating men at 10-20+ years their\nown age, but have never in my life met a man dating a woman older than himself\nby a similar gap. I'm sure there are plenty of men and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分の半分の年齢の女性と付き合っている男性の方が、確実に多く分布しています。\nの方が多い。私は、10～20歳以上年上の男性とデートしている女性にはたくさん会いましたが\n自分より年上の女性と付き合っている男性には会ったことがない。\nということです。きっと、たくさんの男性と...",
      "title": "年上の女性が年下の男性と交際するのは、その反対に比べてなぜ珍しいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "与年龄相差一半的女性约会的男性分布肯定要比女性多。\n女性也是如此。我见过很多女性与年龄在10-20岁以上的男性约会。\n但在我的生活中，从未见过一个男人与比自己大的女人约会，而且差距还很大。\n有类似的差距。我相信有很多男人和...",
      "title": "为什么年长的女性与年轻男性的关系与相反的情况相比如此不常见呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與年齡相差一半的女性約會的男性分佈肯定要比女性多。\n女性也是如此。我見過很多女性與年齡在10-20歲以上的男性約會。\n但在我的生活中，從未見過一個男人與比自己大的女人約會，而且差距還很大。\n有類似的差距。我相信有很多男人和...",
      "title": "爲什麼年長的女性與年輕男性的關係與相反的情況相比如此不常見呢？"
    }
  ]
}