{
  "author": "partymsl",
  "original_created_utc": 1656965728,
  "title": "Take a look at the upcoming big macro events that will influence the directions of the market. July is gonna have a ton of big moves.",
  "created_utc": 1657003189,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;With cryptos big correlation to the stock market crypto is getting heavily influenced by macro events to choose the upcoming direction. Obviously we can&amp;#39;t really predict what&amp;#39;s gonna in the world next but there indeed some major events scheduled on July where we know that they will dictate the direction.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;On July 13th we are gonna get the Inflation CPI numbers from the US and as we have seen the last time they were over mostly over predictions and actually increased in the midst of rate hikes, so markets tanked heavily. Right now they are expected to be about 8.5%, anything above that will be deadly for markets&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;From July 26 to 27 we are gonna have the monthly FOMC meeting, there won&amp;#39;t be any rate hike suprises here but we should expect some big statements about the upcoming moves the FED and how they adjust their targets as 2.5% or 3.5% won&amp;#39;t be enough in any way.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The by far biggest event is the Q2 GDP estimates on July 28th. After the confirmation that Q1 was even -1.6% to the estimated - 1.5% and the predicted  +1.1% we are only one GDP negative quarter away from a recession that so many in the US are denying. Even the consens of Atlanta FED is predicting a massive - 2.5% quarter. If we get even half of that it would be mayhem in the markets.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/vrg9yp/take_a_look_at_the_upcoming_big_macro_events_that/",
  "subreddit": "CryptoCurrency",
  "id": "vrg9yp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "With cryptos big correlation to the stock market crypto is getting heavily\ninfluenced by macro events to choose the upcoming direction. Obviously we can't\nreally predict what's gonna in the world next but there indeed some major events\nscheduled on July where we know that they will dictate the…"
}