{
  "author": "altwormburner",
  "original_created_utc": 1646368805,
  "title": "Are charcoals in soils always a good thing? I.e. Biochars and post processing",
  "created_utc": 1646399525,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=YB9g9l5CjGk\"&gt;https://www.youtube.com/watch?v=YB9g9l5CjGk&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Charcoals have polar surfaces with tremendous numbers of nooks and crannies and are found ubiquitously in the world&amp;#39;s soils deposited from fire. These legacy structures modulate soil fertility, individual plant response, and subsequent large-scale ecosystem patterns.&lt;/p&gt;\n\n&lt;p&gt;In recent years, incredible attention has been paid to their use as a soil amendment - converting waste biomass into charcoals, &amp;quot;biochars&amp;quot; - dually capturing carbon and increasing soil fertility in managed ecosystems. Most data synthesis, including my own with Dr. Sean Thomas at Toronto, show on average ~41% increase in biomass responses.&lt;/p&gt;\n\n&lt;p&gt;Source: &lt;a href=\"https://www.researchgate.net/publicat\"&gt;https://www.researchgate.net/publicat&lt;/a&gt;...&lt;/p&gt;\n\n&lt;p&gt;However, much variation ensues from the applied usage in agricultural and forestry contexts - including negative responses. The mechanisms that drive these detrimental effects are many. Still, research shows that low molecular weight leachates (i.e., acids, phenols, VOCs), Ash, and sometimes metals could be responsible for a mismatch in soil physiochemistry. Source: &lt;a href=\"https://peerj.com/articles/2385/\"&gt;https://peerj.com/articles/2385/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This video discusses ways to enhance biochars efficacy and is delivered by my Ph.D. advisor - Sean Thomas, at the United States Biochar Initiative, 2020. An expansion of our work and what is written above follows in the talk. And his recent paper: &lt;a href=\"https://link.springer.com/article/10\"&gt;https://link.springer.com/article/10&lt;/a&gt;.....&lt;/p&gt;\n\n&lt;p&gt;What do you all think? Any other biochar folks here to help weight in?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/askscience/comments/t6aqwb/are_charcoals_in_soils_always_a_good_thing_ie/",
  "subreddit": "askscience",
  "id": "t6aqwb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "https://www.youtube.com/watch?v=YB9g9l5CjGk\n\nCharcoals have polar surfaces with tremendous numbers of nooks and crannies and\nare found ubiquitously in the world's soils deposited from fire. These legacy\nstructures modulate soil fertility, individual plant response, and subsequent\nlarge-scale…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.youtube.com/watch?v=YB9g9l5CjGk\n\n炭化物は極表面に膨大な数の凹凸があり\nは、世界中の火災で堆積した土壌に普遍的に存在する。これらの遺産は\nは、土壌の肥沃度、個々の植物の反応、そしてその後に続く\n大規模な...",
      "title": "土壌に含まれる炭は、常に良いものなのでしょうか？バイオ炭と後処理について"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.youtube.com/watch?v=YB9g9l5CjGk\n\n木炭具有极性的表面，有大量的犄角和缝隙，在硅谷中无处不在。\n在世界的土壤中无处不在，这些土壤是由火灾沉积而成的。这些遗留的\n结构调节着土壤肥力、个别植物的反应和随后的\n大规模的...",
      "title": "土壤中的木炭总是一件好事吗？即生物炭和后处理"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.youtube.com/watch?v=YB9g9l5CjGk\n\n木炭具有極性的表面，有大量的犄角和縫隙，在硅谷中無處不在。\n在世界的土壤中無處不在，這些土壤是由火災沉積而成的。這些遺留的\n結構調節着土壤肥力、個別植物的反應和隨後的\n大規模的...",
      "title": "土壤中的木炭總是一件好事嗎？即生物炭和後處理"
    }
  ]
}