{
  "author": "gulasch_man",
  "original_created_utc": 1625929889,
  "title": "I'm selling - All you have to have in life is not patience or knowledge, but luck...",
  "created_utc": 1625942294,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So yes, it looks like this is happening. My grandfather lives in Hungary and somehow he got a really serious knee deformation. His left leg looks like a half moon and it&#39;s getting worse and worse. He just has been to the doctor and the answer is boiling my blood.</p>\n\n<p>&quot;Yes it is very serious and  we need to act quickly. Not so quickly though, first of all I have a holiday until 22nd of July and I wouldn&#39;t want to redirect you to another doctor BECAUSE I can opeate your leg in my private clinic for around  7-8000 Euros. But if you don&#39;t have that kind of money, well, I can still put you on the waitlist here (in the city&#39;s public hospital) but it looks like then your turn is somewhere around the end of next year.&quot;</p>\n\n<p>If you are any familiar with the Eastern European wages and state of the countries, then you know how much that 7-8k Euros is. My family obviously doesn&#39;t have that kind of money and I am fortunate enough to live in Austria and work my ass off to start my own family, so I could put some savings into crypto. From that portfolio, I can (with the current prices) pay half of the surgery and also put my cash savings into it, so around the 70% will be paid by me and the remaining will be distributed among my family members.</p>\n\n<p>The reason is why I&#39;m writing this here is 1. I gotta be honest, if this blows up and I can earn some on it, it will further help me to pay for the surgery and 2. I&#39;m kind of tired of all the bullshit talk about &quot;hard work and work clever&quot;. BULLSHIT. I have worked my whole life to be where I am now, coming from a poor background and now I am resetting to 0 again because of pure bad luck. You don&#39;t need anything else in your life just luck and that&#39;s all. Don&#39;t have delusions about becoming a millionaire or financially indepentend on waiting years with a crypto portfolio or daytrade. You can affect it to a certain degree, but all depends on luck.</p>\n\n<p>Now I am waiting for at least some luck to have a +10% day or something around it, so I can cash my portfolio out and have some extra money in case if it&#39;s needed.</p>\n\n<p>I wish you better luck guys...</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/ohkgts/im_selling_all_you_have_to_have_in_life_is_not/",
  "subreddit": "CryptoCurrency",
  "id": "ohkgts",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So yes, it looks like this is happening. My grandfather lives in Hungary and\nsomehow he got a really serious knee deformation. His left leg looks like a half\nmoon and it's getting worse and worse. He just has been to the doctor and the\nanswer is boiling my blood.\n\n\"Yes it is very serious and we need…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうですね、このようなことが起きているようですね。私の祖父はハンガリーに住んでいますが\nどういうわけか、彼は本当に深刻な膝の変形をしてしまいました。左足が半月のようになってしまいました。\nどんどん悪化しています。お医者さんに行ったところ、血の気が引くような答えが返ってきたそうです。\n私の血が騒ぐような答えが返ってきました。\n\n\"そうですね、とても深刻です。",
      "title": "I'm selling - 人生で必要なのは、忍耐でも知識でもなく、運..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，是的，看起来这正在发生。我的祖父住在匈牙利。\n不知何故，他的膝盖变形非常严重。他的左腿看起来像一个半月\n月亮，而且情况越来越糟。他刚刚去看了医生，医生说\n答案让我热血沸腾。\n\n\"是的，这非常严重，我们需要...",
      "title": "我在销售 - 你在生活中所拥有的不是耐心或知识，而是运气..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，是的，看起來這正在發生。我的祖父住在匈牙利。\n不知何故，他的膝蓋變形非常嚴重。他的左腿看起來像一個半月\n月亮，而且情況越來越糟。他剛剛去看了醫生，醫生說\n答案讓我熱血沸騰。\n\n\"是的，這非常嚴重，我們需要...",
      "title": "我在銷售 - 你在生活中所擁有的不是耐心或知識，而是運氣..."
    }
  ]
}