{
  "author": "milonuttigrain",
  "original_created_utc": 1638664555,
  "title": "A Vietnamese man saved 4,100 dongs (worth almost 1 oz of gold) with the bank in 1983 and forgot about it. In 2002, the bank returned him 110,000 dongs (which was around $8). And no-coiners say crypto is a rugpull. People don’t realise many fiats are rugpull, it’s just either fast or slow.",
  "created_utc": 1638678973,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is a common story for a lot of Vietnamese people in the 1980s as told in the online newspaper Vietnam Net. The local currency, Vietnamese dong, was devalued many times with inflation over 400% for several years in the mid 1980s.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/rywvj40lfn381.png?width=636&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=e5b1d5284b0df979f60d5084c0fda79e8d0a3593\"&gt;4,100 dong was worth an apartment in central Hanoi back in 1983. After 20 years of \\&amp;quot;savings\\&amp;quot; the bank returned 109,778 dong, enough to pay for 03 bowls of pho.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Another reason is that Vietnam implemented a currency denomination in 1985, in which 10 old dongs were exchanged for only 1 new dong. A lot of people suddenly have their wealth slashed 90% after a day.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/a84n23lyfn381.png?width=685&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=bf2dea633736a698f26b0d0d42893ebe06791615\"&gt;Historical and forecast inflation rate in Vietnam&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I guess many Vietnamese have PTSD with the dongs and develop a habit of converting their dongs into gold, USD or Bitcoin. According to an analysis, Vietnam ranks 1st on global crypto adoption index. Now, I don’t actually 100% trust the data due to their methodology, but I can somehow understand why Vietnamese invest so much in crypto. It’s simple - they don’t trust their dong!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/crl1uv05gn381.png?width=609&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=36490c8958e4543917821aa59e1a1769f242b5a8\"&gt;The 2021 Global Cryptocurrency Adoption index&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;You may raise the question - Is it just Vietnam or this is an issue in many corners of the world?&lt;/p&gt;\n\n&lt;p&gt;Nowadays Vietnam has a stable economy with inflation rates under 5% since 2014. However, let’s see some countries out there: Venezuela, Turkey, Lebanon, Iran, Argentina just to name a few. Have a look at this map and see how things go:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/2ykukzk8gn381.png?width=678&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b955006def7c42d22180dfcabdf01fe0e1bbd7dc\"&gt;Inflation around the world, IMF, 2020 data&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Now I don’t mean to say crypto will replace fiat, but many people don’t actually realise that fiat is also a type of slow rugpull (or fast!, as the above example in Vietnam in the 1980s and a bunch of countries right now). No-coiners often look at Bitconnect or Squid coin and say “Look, cryptos are rugpulls” but forget the fact that fiat currency loses value every day. Even the USD or EUR are not an exception, it’s just happening quite slowly that people are sleeping on it.&lt;/p&gt;\n\n&lt;p&gt;What do you think of inflation and the world&amp;#39;s economy today?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 349,
  "permalink": "/r/CryptoCurrency/comments/r93buh/a_vietnamese_man_saved_4100_dongs_worth_almost_1/",
  "subreddit": "CryptoCurrency",
  "id": "r93buh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is a common story for a lot of Vietnamese people in the 1980s as told in\nthe online newspaper Vietnam Net. The local currency, Vietnamese dong, was\ndevalued many times with inflation over 400% for several years in the mid 1980s.\n\n\n\n4,100 dong was worth an apartment in central Hanoi back in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、1980年代の多くのベトナム人に共通する話であり、次のように語られています。\nオンライン新聞「ベトナムネット」。現地通貨であるベトナムドンは\n1980年代半ばの数年間は、400％を超えるインフレで何度も切り下げられた。\n\n\n\n4,100ドンでハノイの中心部のアパートが買えた時代。",
      "title": "あるベトナム人男性は、1983年に4,100ドン（約1オンス分の金）を銀行に預けたまま忘れていました。2002年、銀行は彼に110,000ドン（約8ドル）を返しました。また、ノーコイン派の人たちは、暗号はラグラグだと言います。人々は多くのフィアットがラグプルであることに気づいていません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是20世纪80年代许多越南人的一个共同故事，正如网上报纸《越南网》所讲述的那样。\n在线报纸《越南网》讲述的。当地货币越南盾被多次贬值\n在20世纪80年代中期的几年里，当地货币越南盾多次贬值，通货膨胀率超过400%。\n\n\n\n4,100越南盾在河内市中心就能买到一套公寓。",
      "title": "1983年，一个越南人在银行存了4100个越南盾（价值近1盎司的黄金），然后就把它忘了。2002年，银行归还了他11万越南盾（约合8美元）。而无币者说，加密货币是一种地毯式的。人们没有意识到许多法币是地毯式的，只是要么快要么慢。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是20世紀80年代許多越南人的一個共同故事，正如網上報紙《越南網》所講述的那樣。\n在線報紙《越南網》講述的。當地貨幣越南盾被多次貶值\n在20世紀80年代中期的幾年裏，當地貨幣越南盾多次貶值，通貨膨脹率超過400%。\n\n\n\n4,100越南盾在河內市中心就能買到一套公寓。",
      "title": "1983年，一個越南人在銀行存了4100個越南盾（價值近1盎司的黃金），然後就把它忘了。2002年，銀行歸還了他11萬越南盾（約合8美元）。而無幣者說，加密貨幣是一種地毯式的。人們沒有意識到許多法幣是地毯式的，只是要麼快要麼慢。"
    }
  ]
}