{
  "author": "Many_Scratch2269",
  "original_created_utc": 1637329674,
  "title": "Inflation is just a legal way the elites can steal from you. A few influential people can print the same money you worked years for without any effort and devaluate whatever you are holding. Inflation is by far the best argument for Crypto.",
  "created_utc": 1637400650,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The past 2 years have been more than proof when the billionaires got <strong>62%</strong> richer during the pandemic while the middle and the poor class got even poorer. The government printed trillions of dollars and just dumped it into the stock market. </p>\n\n<p>No matter how much you say it, the trillions they spent didn&#39;t come out of nowhere. They came at your expense. People that hold any dollars are going to be the ones bearing brunt of the massive amount of money being printed.</p>\n\n<p>IMHO this is by far the greatest argument for Crypto. The money you worked hard for is actually yours as no one has the power to magically bring it into existence. Banks and governments around the world don&#39;t hate decentralized Cryptocurrencies for no reason. They know what they are losing.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qxgjzb/inflation_is_just_a_legal_way_the_elites_can/",
  "subreddit": "CryptoCurrency",
  "id": "qxgjzb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The past 2 years have been more than proof when the billionaires got 62% richer\nduring the pandemic while the middle and the poor class got even poorer. The\ngovernment printed trillions of dollars and just dumped it into the stock\nmarket.\n\nNo matter how much you say it, the trillions they spent…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この2年間で、億万長者が62％も豊かになったことが何よりの証拠です。\n億万長者は62％も金持ちになり、中間層や貧困層はさらに貧しくなりました。政府は\n政府は何兆ドルものお金を印刷し、それを株式市場に投じました。\n政府は何兆ドルものお金を印刷し、株式市場に投入しました。\n\nどれだけ言っても、彼らが使った数兆ドルは...",
      "title": "インフレは、エリートがあなたから盗むための合法的な手段に過ぎません。少数の影響力のある人々が、あなたが何年もかけて働いて手に入れた同じお金を、何の努力もせずに印刷し、あなたが持っているものを切り下げることができるのです。インフレは暗号化の最大の理由です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的两年里，亿万富翁们在大流行期间富了62%，而中产阶级和贫困阶级却更穷了，这就是更多的证据。\n而中产阶级和贫困阶级则变得更穷。政府印制了数万亿美元\n政府印制了数万亿美元，并将其倾倒在股票市场上。\n市场。\n\n不管你怎么说，他们花的那几万亿...",
      "title": "通货膨胀只是精英们偷窃你的一种合法方式。一些有影响力的人可以不费吹灰之力就印出你工作多年的钱，让你手中的东西贬值。到目前为止，通货膨胀是加密货币的最佳论据。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的兩年裏，億萬富翁們在大流行期間富了62%，而中產階級和貧困階級卻更窮了，這就是更多的證據。\n而中產階級和貧困階級則變得更窮。政府印製了數萬億美元\n政府印製了數萬億美元，並將其傾倒在股票市場上。\n市場。\n\n不管你怎麼說，他們花的那幾萬億...",
      "title": "通貨膨脹只是精英們偷竊你的一種合法方式。一些有影響力的人可以不費吹灰之力就印出你工作多年的錢，讓你手中的東西貶值。到目前爲止，通貨膨脹是加密貨幣的最佳論據。"
    }
  ]
}