{
  "author": "vandalxvisuals",
  "the_new_excerpt": "I think a lot of new, young investors that got caught up in this whole short\nsqueeze, f*** the hedge funds debacle are going to leave with a skewed view of\nhow investing works. Even before all of this went down I was, and still am,\nreally interested in the fundamentals of valuing a company or…",
  "original_created_utc": 1612363570,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我认为很多新的，年轻的投资者，被卷入了这个整个短\n挤，f***对冲基金的溃败都会带着歪曲的观点离开。\n投资是如何运作的。即使在所有这些事情发生之前，我是，现在也是。\n真正感兴趣的公司估值的基本原理或...",
      "title": "作为一个新的投资者，我从过去一周的混乱中得到的主要启示是：有时果汁不值得挤压。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲很多新的，年輕的投資者，被捲入了這個整個短\n擠，f***對沖基金的潰敗都會帶着歪曲的觀點離開。\n投資是如何運作的。即使在所有這些事情發生之前，我是，現在也是。\n真正感興趣的公司估值的基本原理或...",
      "title": "作爲一個新的投資者，我從過去一週的混亂中得到的主要啓示是：有時果汁不值得擠壓。"
    }
  ],
  "title": "My main takeaway from this chaotic past week as a new investor: sometimes the juice ain't worth the squeeze",
  "created_utc": 1612370853,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think a lot of new, young investors that got caught up in this whole short squeeze, f*** the hedge funds debacle are going to leave with a skewed view of how investing works. Even before all of this went down I was, and still am, really interested in the fundamentals of valuing a company or industry and making an informed investment decision based on my own research. I still don&#39;t know the full extent of the ramifications this will have on the markets and investing going forward but regardless, this served as a prime example (for me at least) that it isn&#39;t always worth jumping on the bandwagon even if there seemingly is no downside potential.</p>\n\n<p>However, the greater lesson for me is learning to exercise restraint and caution. With social media having so much power and influence over people it has really stressed the importance of understanding each investment you make and being intentional with your decisions. I was fortunate enough to come out of all this with only a small loss and I feel additionally fortunate that I didn&#39;t have enough capital to turn this valuable learning experience into irreversible financial damage. I understand investing isn&#39;t for everyone and some people just came in to make a quick buck (which is also okay), but I still encourage you to learn the ropes and look past the bullshit as it can be a valuable skill to have in the future. </p>\n\n<p>Thank you to everyone on this subreddit, among others, that took the time to educate us new investors by breaking things down into understandable and digestible concepts. I think it saved many of our asses, including mine in the process!</p>\n</div><!-- SC_ON -->",
  "score": 269,
  "permalink": "/r/investing/comments/lbp1q3/my_main_takeaway_from_this_chaotic_past_week_as_a/",
  "subreddit": "investing",
  "id": "lbp1q3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534803
}