{
  "author": "brown_diesel",
  "original_created_utc": 1628510641,
  "title": "Open letter to Joe Biden, Chuck Schumer, and Janet Yellen.",
  "created_utc": 1628524119,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Your smoke and mirror politics have been exposed over the last week.  The “card trick” you just tried to play on cryptocurrency didn’t slip past the American people.  In the name of improving infrastructure, you tried to slip dozens of non-relevant regulations into the bill in order to further your control and tyranny.  One of which was a weak attempt to kill crypto, largely Bitcoin.</p>\n\n<p>As I type this message, we are pushing toward $46k/Bitcoin and have risen 7% in the last 12 hours after Chuck blocked senate voting on a critical amendment.  You see, you cannot kill Bitcoin.  You may slow down broader crypto industry growth on U.S. soil.  But Bitcoin itself is at a point where it cannot be stopped.  The more you try to block it, the stronger it will get. </p>\n\n<p>This “problem” that the Federal Reserve and Treasury now have on their hands was created in response to decades of mismanaged fiat currency, corrupt central banking, and Wall Street puppetry.  And now the problem you created is fighting back.</p>\n\n<p>Even if this bill passes in it’s current language, what you will see over the next 1-2 years before it becomes law is millions of people buying MORE Bitcoin, storing their coins privately, and “holding on for dear life”.  </p>\n\n<p>You can take our guns, you can take our freedoms, hell you can even imprison us or kill us.  But Bitcoin is the one thing that you will never be able to take.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/Bitcoin/comments/p103id/open_letter_to_joe_biden_chuck_schumer_and_janet/",
  "subreddit": "Bitcoin",
  "id": "p103id",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Your smoke and mirror politics have been exposed over the last week. The “card\ntrick” you just tried to play on cryptocurrency didn’t slip past the American\npeople. In the name of improving infrastructure, you tried to slip dozens of\nnon-relevant regulations into the bill in order to further your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたの煙と鏡の政治は先週から露呈しています。暗号通貨を利用した「カード\n暗号通貨を利用した \"トランプ・トリック \"は、アメリカの人々の目に留まりました。\n人々の目にも留まりました。インフラの改善という名目で、あなたは何十もの無関係な規制を法案に入れようとしました。\n何十もの無関係な規制を法案に組み込み、自分の...",
      "title": "ジョー・バイデン氏、チャック・シューマー氏、ジャネット・イエレン氏への公開書簡。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一周里，你的烟雾和镜子政治已经被暴露。你刚刚试图在加密货币上玩的 \"牌技\n你刚刚试图在加密货币上玩的 \"牌技 \"并没有逃过美国人的眼睛。\n人民。在改善基础设施的名义下，你试图将几十项\n在改善基础设施的名义下，你试图在法案中塞进几十条无关紧要的规定，以促进你的...",
      "title": "致乔-拜登、查克-舒默和珍妮特-耶伦的公开信。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一週裏，你的煙霧和鏡子政治已經被暴露。你剛剛試圖在加密貨幣上玩的 \"牌技\n你剛剛試圖在加密貨幣上玩的 \"牌技 \"並沒有逃過美國人的眼睛。\n人民。在改善基礎設施的名義下，你試圖將幾十項\n在改善基礎設施的名義下，你試圖在法案中塞進幾十條無關緊要的規定，以促進你的...",
      "title": "致喬-拜登、查克-舒默和珍妮特-耶倫的公開信。"
    }
  ]
}