{
  "author": "I_amNND",
  "original_created_utc": 1630772006,
  "title": "Hard Truths you will not hear on Reddit... often.",
  "created_utc": 1630816219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I make this post to remind all of you who are relatively new and those who have been around a while the basic fundamentals and then a few absurd notions.</p>\n\n<ul>\n<li><strong>You are in this alone -</strong> Don&#39;t let friendly strangers on Reddit convince you otherwise. Your money is your responsibility. Try not to find comfort in the fact that if the ship goes down &quot;<em>we all go down TOGETHER&quot;</em> or <em>&quot;1 btc is always 1 btc&quot;</em> .  Yes 1 BTC is 1 BTC ..<strong>. But you know what is better than 1 BTC ?</strong> <strong>2.1 BTC</strong>. And that was a reality for many  who sold in April and rebought in the Summer. You know your situation better. You do what you feel is right. Do not let any hopium stop you from following through on your exit strategy.</li>\n<li><strong>You need to make tough calls without another person&#39;s validation -</strong> Most of my best performing coins this year VeChain, Avax, BNB, Sol recently ... These are all coins that I have found on my own. By the time you hear about it from your favorite Youtuber, you have already missed out on a pump.  Now, I am not saying that you cannot take <em>&quot;educational content&quot; .. not financial advise (lol)</em> ( clear sponsored shill but ok) All I am saying is that you learn to DYOR and make your own decision rather than always just trusting a credible person to tell you. I do have a certain people whose brain I like to pick to see how they are viewing the markets, sure.. But the end decision always has to be your own.</li>\n<li><strong>You need to protect your investments from your yourself -  Use this</strong> <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pbrbvm/detailed_case_study_what_if_you_purchased_btc_at/\">study</a> to understand the power of holding long term. Do NOT over extend your portfolio to a point where you need to check the price of your coins every couple hours. You do not want to be stressed. And no, this is not just about your well-being. It has to do with how long you are going to last in the market. <strong>The less number of times you check the price, the more likely you are to remain in the market.</strong>  No, don&#39;t buy and forget your coins. That is not what I am telling you. What I am telling you is to not invest an amount you would lose sleep over. I could care less about your sleep. I just don&#39;t want you panic selling just because you invested way too much for your own sanity.</li>\n<li><strong>Everyone is making money by putting their money where their mouth is.</strong>  I got in a lower prices. I will dump my holdings when the newcomers FOMO in. So will you. Remember that, all we are doing is seeking value based on our judgement and hoping we beat most people to it. The ones who join later get dumped on. That is just how it is. Remember that. Occasionally, you will find people who you can depend on FOR A SECOND ( or x number) OPINION. That is about it. Other than that, it is dog eats dog.</li>\n<li><strong>Exit Strategy is just as important as entry strategy</strong> - Analyze your life and come up with a sound exit strategy plan. Stick to it unless your situation or the markets change a lot. Improvisation is always AN OPTION but never due to FUD or FOMO.</li>\n<li><strong>The People who are terrified of their coins coming into the spotlight</strong> : In the last few days, I have noticed that lot of people including myself have light heartedly tried to spread the &quot;buy 30$ worth of BTC on Tuesday&quot; narrative. What surprised me so much was <strong>HOW MANY PEOPLE WERE SCARED SHITLESS by this.</strong> And for what ? &quot; iF wE wAnT cRyPtO TO bEcOmE lEgIt then you should not .......&quot; . Stop. You aren&#39;t concerned with the technology .. You are concerned with gaining validation from the corrupt legacy financial systems as &quot;sound money&quot;.  Are you people under the assumption that it is going to a &quot;smooth under the rug avoid the regulatory risks dont make too much noise &quot; path to a 6 figure BTC ? We preach radical changes but we ARE SO AFRAID of being in the spotlight. It is terrible.</li>\n<li>If you watch BitBoy, then idk man ... Can you like ... idk .. step on poop ?</li>\n</ul>\n\n<p>Maybe it is just a rant. But I try to be informative. Well, just a not so gentle reminder.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/phufk8/hard_truths_you_will_not_hear_on_reddit_often/",
  "subreddit": "CryptoCurrency",
  "id": "phufk8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I make this post to remind all of you who are relatively new and those who have\nbeen around a while the basic fundamentals and then a few absurd notions.\n\n * You are in this alone - Don't let friendly strangers on Reddit convince you\n   otherwise. Your money is your responsibility. Try not to find…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事は、比較的新しい皆さんや、今までの皆さんに思い出してもらいたいと思って作りました。\nこの記事では、比較的新しい方と経験のある方に、基本的な知識といくつかの不条理な考え方をお伝えします。\n\n * あなたは一人でやっています - Redditの友好的な他人に説得されないでください。\n   そうでなければ あなたのお金はあなたの責任です。あなたのお金は、あなたの責任です - 見つけることはありません。",
      "title": "Redditでは聞けないハードな真実...よくあることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我发这个帖子是为了提醒你们这些相对较新的人和那些已经\n的人，提醒你们基本的基本原理和一些荒谬的概念。\n\n * 你是一个人在战斗 - 不要让Reddit上的友好陌生人说服你\n   否则。你的钱是你的责任。尽量不要找...",
      "title": "你不会在Reddit上听到的硬道理......经常。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我發這個帖子是爲了提醒你們這些相對較新的人和那些已經\n的人，提醒你們基本的基本原理和一些荒謬的概念。\n\n * 你是一個人在戰鬥 - 不要讓Reddit上的友好陌生人說服你\n   否則。你的錢是你的責任。儘量不要找...",
      "title": "你不會在Reddit上聽到的硬道理......經常。"
    }
  ]
}