{
  "author": "ScenPath",
  "the_new_excerpt": "I have seen a lot of questions about inflation and market prices the last couple\nof weeks. Let me post some info for those thinking about the topic.\n\nFirst, what are standard assets to buy during high-inflation periods?\n\nYou have a couple of broad categories here. The simplest category is “stores…",
  "original_created_utc": 1624109710,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数週間、インフレや市場価格に関する質問を多く目にしました。\nここ数週間、インフレや市場価格に関する質問をよく目にします。このテーマについて考えている方のために、いくつかの情報を掲載させてください。\n\nまず、高インフレ時に購入すべき標準的な資産は何でしょうか？\n\nここでは、いくつかの大まかなカテゴリーがあります。最もシンプルなカテゴリーは「店舗」です。",
      "title": "初心者のためのインフレーション あなたのための情報が満載です"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几周里，我看到很多关于通货膨胀和市场价格的问题。\n的问题。让我为思考这个问题的人发布一些信息。\n\n首先，在高通货膨胀时期，买什么是标准资产？\n\n你在这里有几个大的类别。最简单的类别是 \"商店...",
      "title": "初学者的通货膨胀。一堆信息只为你而设!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾周裏，我看到很多關於通貨膨脹和市場價格的問題。\n的問題。讓我爲思考這個問題的人發佈一些信息。\n\n首先，在高通貨膨脹時期，買什麼是標準資產？\n\n你在這裏有幾個大的類別。最簡單的類別是 \"商店...",
      "title": "初學者的通貨膨脹。一堆信息只爲你而設!"
    }
  ],
  "title": "Inflation for beginners. A pile of info just for you!",
  "created_utc": 1624127363,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen a lot of questions about inflation and market prices the last couple of weeks. Let me post some info for those thinking about the topic.</p>\n\n<p><strong>First, what are standard assets to buy during high-inflation periods?</strong></p>\n\n<p>You have a couple of broad categories here. The simplest category is “stores of value,” items that tend to retain value in the long run. These include:<br/>\n-Precious metals (gold, platinum, etc.)<br/>\n-Commodities (metals are a subset of this, but this also includes oil, corn, etc.)<br/>\n-Real estate<br/>\n-Blue chip stocks</p>\n\n<p>The next broad category is the collection of assets that “float” with inflation; these things tend to track whatever inflation is doing. These include:<br/>\n-Utility stocks (people still need water, electricity, etc.)<br/>\n-Some dividend stocks (overlaps with blue chip stocks)<br/>\n-TIPS (Treasury Inflation Protected Securities; gov’t bonds designed for inflation)</p>\n\n<p>The last category is an asset that does well during inflation:<br/>\n-Leveraged companies (companies with a lot of debt borrowed at a fixed rate; the inflation makes the loans easier to pay back)</p>\n\n<p>Bonus category:<br/>\n-Cryptocurrencies (no one knows how these assets “traditionally” do because they haven’t been around long enough to have a “tradition”)</p>\n\n<p><strong>Second how are these inflation-related assets doing now?</strong></p>\n\n<p>I have bad news for you: Markets are forward-looking. The inflation hedges were being bought months ago. For myself, I did my largest personal inflation hedge last October: I refinanced my home mortgage to 2.85% and took out some equity. Before that I moved assets into a leveraged companies mutual fund, a commodity ETF, etc. Because other investors also did these things months ago, asset prices are high now.</p>\n\n<p>Some of these asset prices have also been dramatically affected by non-inflation factors. Inflation is one scenario trade everyone has been dealing with, but pandemic (covid) is another scenario trade, US political instability is another scenario trade, the rise of cryptocurrencies is another scenario trade, etc. As a result, there is a lot of noise in the market prices, and it can be hard to untangle the effects of, for instances, the pandemic scenario vs the inflation scenario (though one basically caused the other).</p>\n\n<p>Something like gold is more complicated than an inflation-only indicator. Track the price of gold and Bitcoin over the past two years. During the worst of the pandemic market downturn, gold held pretty well with bad news; Bitcoin tanked. That tells you something. (Both eventually rose) But there are other interesting factors. Gold is *not* rising recently as inflation fears have ramped up. Why? Well, looking at price history, gold was already being bought as a crisis hedge for pandemic. It was also likely being bought as a US political instability hedge. So the noise and signal in the price is hard to tease out for merely the inflation signal. Gold prices, and all asset prices lately, have been carrying multiple signals within their prices. The political stability signal may be noise to the inflation signal; all scenario signals will affect price. Each scenario has its own price pressures.</p>\n\n<p>Are asset prices high right now? Yes. We could be at the edge of a price cliff. Inflation could be tamed and prices could stabilize or drop. But we could also be at a cliff at the BASE of the cliff. Prices are high now, but if we enter into cycles of hyper-inflation, then today’s prices may seem like a bargain in tomorrow’s inflated dollars. There are people who predict both the end of inflation and much greater inflation to come. You’ll have to decide for yourself which path seems more likely and/or problematic for your personal situation.</p>\n\n<p><strong>So if asset prices are already high for inflation hedges, what should you do?</strong></p>\n\n<p>First off, in this case and in every case be forward-thinking! If you’re just starting to think about inflation now, you’re chasing the markets. Markets have already been adjusting for inflation for a long time. That doesn’t mean inflation won’t get worse; it very well could. What it does mean is that prices are already up. We have seen big moves in real estate, such as the refinance industry like I did with my personal refi, and as many REITs and other firms have done with massive property buys. But just because we’re at a high doesn’t mean we’re at a top. Prices could be at a top, prices could be at a relative low compared to coming inflation. Don’t just think, “Inflation! Buy real estate!” or “Prices are high! Don’t buy real estate!” Instead, think about where things are going over the next few months. Are markets properly efficient now or do will they be adjusting further in the coming months? Look forward.</p>\n\n<p>Second, do your homework! If you’re an active investor (which presumably you are if you are in this forum), then it is incumbent upon you to do your research. Do due diligence. Think about possible future paths and have a plan for the major paths.</p>\n\n<p>Third, if we’re in a period of high inflation, hopefully at some point we will return to a period of low inflation. Make your plan for that scenario NOW. You may not enact the plan now because we may experience more inflation before this cycle ends. But rather than being surprised by the end of inflation, have your trades ready to execute when you think the inflationary period is about to end.<br/>\n-Identify triggers (indicators that the inflationary period’s end is coming)<br/>\n-Identify major paths (how events are likely to unfold)<br/>\n-Identify targets for investment (assets that will do best in a return to low inflation)</p>\n\n<p>&#x200B;</p>\n\n<p>This is how I think about things; your mileage may vary. But in all cases do your homework and look a step or two ahead rather than just reacting to the day’s news. If you act after the market is efficient, you lose on the trades. Be ready before the broader market moves.</p>\n\n<p>&#x200B;</p>\n\n<p>(edited to delete an duplicate line; artifact of copy/paste error in Reddit)</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/investing/comments/o3g860/inflation_for_beginners_a_pile_of_info_just_for/",
  "subreddit": "investing",
  "id": "o3g860",
  "is_self": true,
  "media": null,
  "is_video": false
}