{
  "author": "OccamsRPG",
  "the_new_excerpt": "I'm quite confused by the market reaction to the Fed meeting today. Definitely\nnot an economist, so hoping someone smarter than me can help explain it.\n\nWe all expected the Fed to raise rates sometime in 2024. In yesterday's Fed\nmeeting, the median dot plot projected them increasing it twice in 2023…",
  "original_created_utc": 1623969686,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日のFRB会合に対する市場の反応にはかなり困惑しています。確かに\n経済学者ではないので、私より頭の良い人が説明してくれることを期待しています。\n\n私たちは皆、FRBが2024年のどこかで利上げを行うと予想していました。昨日のFRB会合では\n昨日のFRB会合では、ドットプロットの中央値では2023年に2回の利上げを予測していましたが...",
      "title": "今日のハイテクラリー - 混乱しています。FRBのタカ派的な政策が増えることはハイテクにとって悪いことではないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对今天美联储会议的市场反应感到相当困惑。绝对是\n不是经济学家，所以希望比我聪明的人能够帮助解释。\n\n我们都预计美联储将在2024年的某个时候加息。在昨天的美联储\n会议上，中位数点阵图预测他们在2023年加息两次......",
      "title": "今天的科技股反弹--我很困惑。更加鹰派的美联储政策不是对科技界不利吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對今天美聯儲會議的市場反應感到相當困惑。絕對是\n不是經濟學家，所以希望比我聰明的人能夠幫助解釋。\n\n我們都預計美聯儲將在2024年的某個時候加息。在昨天的美聯儲\n會議上，中位數點陣圖預測他們在2023年加息兩次......",
      "title": "今天的科技股反彈--我很困惑。更加鷹派的美聯儲政策不是對科技界不利嗎？"
    }
  ],
  "title": "Today's tech rally - I'm confused. Isn't more hawkish Fed policy bad for tech?",
  "created_utc": 1623978967,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m quite confused by the market reaction to the Fed meeting today. Definitely not an economist, so hoping someone smarter than me can help explain it. </p>\n\n<p>We all expected the Fed to raise rates sometime in 2024. In yesterday&#39;s Fed meeting, the median dot plot projected them increasing it twice in 2023 instead. Furthermore, they increased inflation expectations. Aren&#39;t higher projected inflation expectations and higher interest rates coming a year earlier both bad for tech stocks? Why are they rallying instead, with cyclicals/reopening stocks tanking?</p>\n</div><!-- SC_ON -->",
  "score": 362,
  "permalink": "/r/investing/comments/o29z8t/todays_tech_rally_im_confused_isnt_more_hawkish/",
  "subreddit": "investing",
  "id": "o29z8t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743438
}