{
  "author": "chocolatemacaroni",
  "original_created_utc": 1641503522,
  "title": "Is it bad that I only poop once a week???",
  "created_utc": 1641512422,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been like this for years and I&amp;#39;m too afraid to bring it up to my doctor. I will literally only poop like once a week, sometimes I&amp;#39;ll even go once every week and a half. When I finally do take a shit it&amp;#39;s not painful or hard and it&amp;#39;s not a lot of poop???&lt;/p&gt;\n\n&lt;p&gt;EDIT: OKAY APPARENTLY THIS IS BAD, lol. I kind of wanted to add in the detail that if I get anxious, I will poop but it&amp;#39;s really sudden and my stomach will hurt a LOT. I don&amp;#39;t know if that changes anything. This doesn&amp;#39;t happen too often, just if I&amp;#39;m worried about something and/or right before my period. But my &amp;quot;normal&amp;quot; is in fact once a week. Thank you for everyone who has replied so far. I genuinely didn&amp;#39;t realize this was a problem.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 146,
  "permalink": "/r/TooAfraidToAsk/comments/rxp3nz/is_it_bad_that_i_only_poop_once_a_week/",
  "subreddit": "TooAfraidToAsk",
  "id": "rxp3nz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been like this for years and I'm too afraid to bring it up to my doctor. I\nwill literally only poop like once a week, sometimes I'll even go once every\nweek and a half. When I finally do take a shit it's not painful or hard and it's\nnot a lot of poop???\n\nEDIT: OKAY APPARENTLY THIS IS BAD, lol.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何年も前からこんな感じなのですが、怖くて主治医に言い出せないんです。I\n文字通り、週に1回、時には1回しかウンチが出ません。\n週間半です。いざウンコをすると、痛くも辛くもなく、しかも\nウンコの量が少ない？\n\nEDIT: OK APPARENTLY THIS IS BAD, lol....",
      "title": "週に一度しかウンチをしないのは悪いことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经这样多年了，我不敢向医生提出来。I\n我真的是一周才拉一次，有时甚至一周半才拉一次。\n一周半一次。当我最后拉大便时，不痛也不硬，而且\n没有很多大便？\n\nEDIT: OKAY APPARENTLY THIS IS BAD, lol....",
      "title": "我一周只拉一次大便，这不好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經這樣多年了，我不敢向醫生提出來。I\n我真的是一週才拉一次，有時甚至一週半才拉一次。\n一週半一次。當我最後拉大便時，不痛也不硬，而且\n沒有很多大便？\n\nEDIT: OKAY APPARENTLY THIS IS BAD, lol....",
      "title": "我一週只拉一次大便，這不好嗎？"
    }
  ]
}