{
  "author": "Canuhere",
  "the_new_excerpt": "Hi Everyone, this is my first semi-dd post on here. I got into $ITRM for about\n$500 a few days back without really knowing anything about it, a foolish move by\na green investor. Only foolish because I bought it without knowing anything\nabout the stock and just saw some conversation about it on…",
  "original_created_utc": 1613156016,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，这是我第一次在这里发半dd的帖子。我进入$ITRM约\n几天前的500美元，却没有真正了解它的情况，这是一个愚蠢的举动。\n一个绿色的投资者。只是因为我在什么都不知道的情况下买了它，所以才会很傻。\n关于股票，只是看到了一些关于它的对话... ...",
      "title": "$ITRM和制药业投资"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，這是我第一次在這裏發半dd的帖子。我進入$ITRM約\n幾天前的500美元，卻沒有真正瞭解它的情況，這是一個愚蠢的舉動。\n一個綠色的投資者。只是因爲我在什麼都不知道的情況下買了它，所以纔會很傻。\n關於股票，只是看到了一些關於它的對話... ...",
      "title": "$ITRM和製藥業投資"
    }
  ],
  "title": "$ITRM and pharma investing",
  "created_utc": 1613227383,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi Everyone, this is my first semi-dd post on here. I got into $ITRM for about $500 a few days back without really knowing anything about it, a foolish move by a green investor. Only foolish because I bought it without knowing anything about the stock and just saw some conversation about it on stocktwits.</p>\n\n<p>Well, since then it has gone down, so I decided to learn about what it actually is and if I should be patient or cut my losses. I have learned some about FDA approval processes, offerings, urinary tract infections, and that drug companies can exist for some time hemorrhaging money without ever having released a drug before! I found this all to be very interesting! I&#39;d like to share the basics of what I learned, and also get opinions on this stock....</p>\n\n<p>The company as mentioned, is a &quot;clinical-stage pharmaceutical company&quot;, which I take to basically mean they have no approved drugs yet. My friend called it a gofundme for drugs when I explained it to him lol. They have been working on one drug, oral antibiotics for treating UTIs, which currently does not exist.</p>\n\n<p>They have complete phase 3 (of which there are 4 phases) trials with good results and have applied with the FDA for approval(NDA). Approval for this drug is on FDAs &quot;priority list&quot;, meaning if approved it is somewhat fast-tracked through the approval process. Expected approval is July of this year.</p>\n\n<p>From my research I gather that the majority of drugs that pass phase 3 and apply for NDA are eventually approved. Something like over 80%. The company has also recently made a public offering of almost 2 million shares to raise capital that will cover operating expenses until 2023 (that happened a few days ago). They also recently created an agreement with a firm that specializes in assisting drug companies in the final phases of development to bring the drug to market(also very recent activity).</p>\n\n<p>The stock price has really only gone down since the IPO and is currently at almost an all time low.</p>\n\n<p>To me, it seems like the approval of this drug is imminent. Why would they be partnering with a company to hash out the logistics of the release if this weren&#39;t the case? Why would they still be raising capital if this were not the case? I have a strong sense that the drug will be approved.</p>\n\n<p>Are there any experienced pharma investors here that can chime in on this or give their thoughts?</p>\n\n<p>Does it follow that if the drug is approved the price will go up as I predict? Or is the price built in?</p>\n\n<p>I think there is still quite some dd to do on this such as what would the drug cost and how many people need it, what is the competition, etc. Starting to look into these things but it gets pretty complicated.</p>\n\n<p>Still a lot to learn but I feel good about this investment after my initial blindfolded dart throw.</p>\n\n<p>Thanks for reading.</p>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/investing/comments/lihv5p/itrm_and_pharma_investing/",
  "subreddit": "investing",
  "id": "lihv5p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621131
}