{
  "author": "dysgr_ace",
  "original_created_utc": 1644406574,
  "title": "If someone makes an awful joke on you, is it ok to roast the shit out them in return?",
  "created_utc": 1644424563,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically, I&amp;#39;m shy and introverted and I am disabled due to a chronic condition. Sometimes people I barely know, friend of friends, think it is ok to make jokes on me. Maybe they &lt;em&gt;try&lt;/em&gt; to be funny and friendly, but damn. I don&amp;#39;t see how &amp;quot;I&amp;#39;m worried for the one who will have to clean the toilet after you have been there&amp;quot; (told out loud in the middle of a bar while we were sat on a table, surrounded by other people, because I ordered something I generally cannot eat if I&amp;#39;m not in remission - and I AM in remission) can be funny.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t really want to explain myself to strangers. It&amp;#39;s none of their business how I handle my disability and I just want people to leave me alone.&lt;/p&gt;\n\n&lt;p&gt;Would it be appropriate to just... Play along and roast them &amp;quot;as a joke&amp;quot;, maybe with equally hurtful jokes? I just want them to think &amp;quot;Well, lesson learnt, I should shut the fuck up because what I said is stupid&amp;quot;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/sobiny/if_someone_makes_an_awful_joke_on_you_is_it_ok_to/",
  "subreddit": "NoStupidQuestions",
  "id": "sobiny",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Basically, I'm shy and introverted and I am disabled due to a chronic condition.\nSometimes people I barely know, friend of friends, think it is ok to make jokes\non me. Maybe they try to be funny and friendly, but damn. I don't see how \"I'm\nworried for the one who will have to clean the toilet after…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的に人見知りで内向的な性格で、持病があるため体が不自由です。\n時々、ほとんど知らない人、友人の友人が、冗談を言っても大丈夫だと思うことがあります。\nということです。たぶん、彼らは面白がって、友好的であろうとしているのでしょうが、くそっ。でも、「私は」なんて\nトイレ掃除の後始末をする人が心配で...。",
      "title": "もし誰かがあなたにひどい冗談を言ったなら、お返しに相手を炙り出してもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，我很害羞，性格内向，而且由于慢性病，我是个残疾人。\n有时我几乎不认识的人，朋友的朋友，认为开我的玩笑是可以的。\n对我开玩笑。也许他们试图表现得有趣和友好，但该死的。我不明白为什么 \"我为那些\n我不明白 \"我很担心那个以后要打扫厕所的人...... \"是怎么一回事。",
      "title": "如果有人对你开了一个可怕的玩笑，作为回报，你可以把他们的屎烤出来吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，我很害羞，性格內向，而且由於慢性病，我是個殘疾人。\n有時我幾乎不認識的人，朋友的朋友，認爲開我的玩笑是可以的。\n對我開玩笑。也許他們試圖表現得有趣和友好，但該死的。我不明白爲什麼 \"我爲那些\n我不明白 \"我很擔心那個以後要打掃廁所的人...... \"是怎麼一回事。",
      "title": "如果有人對你開了一個可怕的玩笑，作爲回報，你可以把他們的屎烤出來嗎？"
    }
  ]
}