{
  "author": "magickrystalball13",
  "original_created_utc": 1625542843,
  "title": "Where did the stigma of “giving a woman head is gross” come from?",
  "created_utc": 1625600052,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I always wondered this… this might not be a thing in other parts of the world but where I’m from (canada) as well as in West Indian or Caribbean culture. I’ve heard it a lot where guys will say they would never go down on a girl or that it’s nasty. Or just the stigma of vaginas smelling like fish… a lot of times guys lie and say they wouldn’t do that but they actually do lol. It’s just weird because I feel like the idea of giving a woman head is also less talked about than a man getting head.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/oemysl/where_did_the_stigma_of_giving_a_woman_head_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "oemysl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I always wondered this… this might not be a thing in other parts of the world\nbut where I’m from (canada) as well as in West Indian or Caribbean culture. I’ve\nheard it a lot where guys will say they would never go down on a girl or that\nit’s nasty. Or just the stigma of vaginas smelling like fish… a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いつも思うのですが、他の地域ではこのようなことはないのかもしれませんが\n私の出身地（カナダ）では、西インド諸島やカリブ海の文化でもそうなんです。私はよく聞きます。\nよく聞くのは、男の人が女の子を口説くのは絶対にしないとか、気持ち悪いとか。\nよく聞く話です。あるいは、アソコが魚のような臭いがするという汚名を着せられることも...ア...",
      "title": "女性に頭を差し出すのはキモい」という汚名はどこから来たのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在想这个问题......这在世界其他地方可能不是一个事情\n但在我的家乡（加拿大），以及在西印度或加勒比文化中，这可能不是一件事。我听过很多这样的说法，男人们会说他们不愿意和别人发生关系。\n我听过很多这样的说法，男人们会说他们永远不会对一个女孩下手，或者说这很下流。\n这是很肮脏的。或者仅仅是阴道有鱼腥味的耻辱......一......。",
      "title": "\"给女人头是很恶心的 \"的污名是怎么来的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在想這個問題......這在世界其他地方可能不是一個事情\n但在我的家鄉（加拿大），以及在西印度或加勒比文化中，這可能不是一件事。我聽過很多這樣的說法，男人們會說他們不願意和別人發生關係。\n我聽過很多這樣的說法，男人們會說他們永遠不會對一個女孩下手，或者說這很下流。\n這是很骯髒的。或者僅僅是陰道有魚腥味的恥辱......一......。",
      "title": "\"給女人頭是很噁心的 \"的污名是怎麼來的？"
    }
  ]
}