{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning June 21st, 2021.\n\n\nTHE…",
  "original_created_utc": 1624058436,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks[/r/stocks]をご覧の皆様、金曜日の夜はいかがお過ごしでしょうか。このサブの皆さんは\nこのサブにいる皆さんは、先週の市場でうまく稼いで、準備ができていると思います。\n新しい週に向けて準備ができていることと思います。\n\nここでは、今週の取引の準備のために知っておくべきことをお伝えします。\n2021年6月21日からの取引に備えて、知っておくべきことをお伝えします。\n\n\nTHE...",
      "title": "2021年6月21日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks [/r/stocks]上的各位周五晚上好。我希望每个人\n在过去的一周里在市场上赚得盆满钵满，并准备好迎接新的交易周。\n迎接新的交易周的到来。\n\n以下是你需要知道的一切，让你为本周的交易做好准备\n2021年6月21日开始。\n\n\n节目中的...",
      "title": "2021年6月21日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks [/r/stocks]上的各位週五晚上好。我希望每個人\n在過去的一週裏在市場上賺得盆滿鉢滿，並準備好迎接新的交易周。\n迎接新的交易周的到來。\n\n以下是你需要知道的一切，讓你爲本週的交易做好準備\n2021年6月21日開始。\n\n\n節目中的...",
      "title": "2021年6月21日開始的交易周，華爾街一週前瞻"
    }
  ],
  "title": "Wall Street Week Ahead for the trading week beginning June 21st, 2021",
  "created_utc": 1624082502,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Friday evening to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning June 21st, 2021.</p>\n\n<h1><strong>The Fed will continue to dominate the market in the week ahead after sell-off - <a href=\"https://www.cnbc.com/2021/06/18/the-fed-will-continue-to-dominate-the-market-in-the-week-ahead-after-sell-off.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>The Federal Reserve’s signal that it is looking to step away from some of its easy policy is expected to be a dominant trading theme in the week ahead and likely for the rest of the summer.</p>\n\n<hr/>\n\n<p>In the past week, investors repositioned across the financial markets after Fed Chairman Jerome Powell said Wednesday that the central bank was considering tapering its purchases of Treasurys and mortgage securities. That is important since when the Fed eventually acts, it would be the first serious reversal of the easy policies it put in place to add liquidity to markets when the economy shut down last year because of the Covid crisis.</p>\n\n<hr/>\n\n<p>The purchases, which amount to $120 billion a month, would be gradually whittled away once the Fed decides to slow down and end the bond buying, or quantitative easing. That could then open the door to interest rate hikes, which the Fed now projects would come in 2023.</p>\n\n<hr/>\n\n<p>The Federal Reserve sent ripples across financial markets after its meeting Wednesday. The dollar jumped, stocks fell and bond yields moved to imply higher short-term interest rates in the future. The Dow fell 3.5%, its worst week since October. The S&amp;P 500 was down 1.9% for the week, its worst weekly loss since February, and the Nasdaq lost just 0.3%, helped by a small weekly gain in tech.</p>\n\n<hr/>\n\n<p>“I think the market is still digesting the Fed meeting,” said Ed Keon, chief investment strategist at QMA. Stocks were trading sharply lower Friday, after weakness Wednesday and Thursday. Yields fell on longer duration bonds, like the benchmark 10-year, but rose on the shorter duration 2- and 5-year notes.</p>\n\n<hr/>\n\n<p>The spreads between those shorter-duration notes and the 10- and 30-year bond yields narrowed dramatically in a so-called flattening trade. That’s common when interest rates are rising. The higher short rates reflect the expected increases in the fed funds rate, while the longer duration yields fall, because the thinking historically has been that a tightening Fed slows the economy.</p>\n\n<hr/>\n\n<p>The Fed also provided new economic forecasts, including a chart on interest rates that shows it expects to hike its fed funds rate twice in 2023, after its prior forecast included no increases.</p>\n\n<hr/>\n\n<p>Fed speakers will get a lot of attention in the week ahead. Powell speaks Tuesday before the House Select Subcommittee on the Coronavirus Crisis on the Fed’s policy response and the economy. His remarks could be a highlight of what looks to be a slow, but volatile first week of summer for markets.</p>\n\n<hr/>\n\n<p>There are a number of other Fed officials speaking, including New York Fed President John Williams on Monday and San Francisco Fed President Mary Daly and Cleveland Fed President Loretta Mester, both Tuesday. Other Fed speakers include Atlanta Fed President Raphael Bostic and St. Louis Fed President James Bullard.</p>\n\n<hr/>\n\n<p>“Getting more color from others will certainly be key,” said Peter Boockvar, chief investment strategist at Bleakley Global Advisors. “I’m most interested certainly in what Powell has to say. They’re all going to give us now the fine print of what was in the statement and what Powell said” at the end of the Fed’s June meeting.</p>\n\n<hr/>\n\n<p>There should be a lot of interest in personal consumption expenditures data next Friday, since it includes the PCE inflation index, closely watched by the Fed. The Fed has been pressing its view that elevated inflation readings are just temporary and that they should calm down next year.</p>\n\n<hr/>\n\n<p>Boockvar said the inflation data should reflect the same spike in prices that showed up in the consumer price index for May, up 5% year over year.</p>\n\n<hr/>\n\n<p>“It’s going to show some pretty robust month-over-month increases,” said Boockvar. He said inflation data will be the most important for markets.</p>\n\n<hr/>\n\n<p>“That’s what the rest of the year is all about — inflation, inflation, inflation and how does the Federal Reserve adjust to that,” he said. “In this inflation debate, it’s not just a U.S. thing, it’s a global thing.”</p>\n\n<hr/>\n\n<p>While the Fed has now penciled in two interest rate hikes for 2023, the market is more skeptical about inflation. According to futures markets, investors believe there could be one or more rate hikes next year and at least four in total before the end of 2023.</p>\n\n<hr/>\n\n<p>The Fed forecast 3.4% PCE inflation for this year, up a full point from its March forecast, but it still expects a tame 2.1% pace next year.</p>\n\n<hr/>\n\n<p>Housing data will also be of big interest to markets, after the Fed’s tiny step forward toward tightening unleased a surge in mortgage rates.</p>\n\n<hr/>\n\n<p>The rate for the 30-year fixed loan jumped to 3.25% by Thursday, the highest in months, according to Mortgage News Daily. The Fed is currently purchasing about $40 billion a month in mortgage securities, and that would slow down along with Treasury buying.</p>\n\n<hr/>\n\n<p>Existing home sales are released Tuesday, and new home sales are reported Wednesday.</p>\n\n<hr/>\n\n<h1>Value versus growth</h1>\n\n<p>Keon said the market is choppy but taking in stride the change in the Fed. He said he has overweight stocks in his portfolios. “We like that position with earnings likely to grow 40% this year, rates staying pretty low. That’s a good environment for stocks,” he said.</p>\n\n<hr/>\n\n<p>As the market traded lower this past week, tech and some growth names held their ground. Tech was barely positive, registering a nearly 0.1% gain for the week. The worst performing sectors were in the value space — commodities-related or part of the reopening cyclical trade.</p>\n\n<hr/>\n\n<p>Materials were down 6.3% for the week, and financials were down more than 6% as a flattening yield curve has the potential to hurt bank profits.</p>\n\n<hr/>\n\n<p>“We had a very good move for value stocks and for the reopening plays. They really did well for six months or so,” said Keon. “There’s nothing in the market that keeps going forever. This is probably a bit of a counter rotation. Whether it’s the beginning of a major shift or a slight bounce back [for tech], is hard to say and rates are going to be a determinant.”</p>\n\n<hr/>\n\n<p>Keon said if the closely watched 10-year yield goes to 2% from its current 1.5%, that would be a positive for value stocks. But if it stays anchored around 1.5%, tech could continue to do well.</p>\n\n<hr/>\n\n<p>The 10-year yield, which is the benchmark Treasury, fluctuated widely in the past week. After starting the week at about 1.45%, it moved higher right after the Fed meeting to as high as 1.59% but then fell back down to about 1.44% Friday afternoon.</p>\n\n<hr/>\n\n<p>The 2-year note yielded 0.256% on Friday, up sharply from the prior week’s Friday close of 0.149%.</p>\n\n<hr/>\n\n<p>“My guess is that the thinking is that at the press conference, Powell made it pretty clear he has no intention of raising rates until 2023,” said Keon. “Until you get to 2023, you’re going to get the boom we are in now, and you’re going to get pretty strong growth in 2022. By the time, you get to 2023, the economy is going to be slowing and is the Fed going to raise rates in a slowing economy? Probably not.”</p>\n\n<hr/>\n\n<p>Keon said that would keep a cap on the size of the Fed rate hikes. He said there’s little chance the Fed will hike before 2023 unless there’s an upside surprise in inflation.</p>\n\n<hr/>\n\n<p>“The market thinks the Fed is not going to raise rates until 2023, absent an unexpected surprise to inflation, and that they’re not going to raise rates that much in 2023 because they’ll be risking a recession,” he said.</p>\n\n<hr/>\n\n<p>Julian Emanuel, head of equities and derivatives strategy at BTIG, said the Fed has now injected a new level of volatility into the markets. He expects investors will be on edge now as the Fed’s late July meeting approaches and again as the Fed heads to Jackson Hole, Wyoming, in late August for its annual symposium.</p>\n\n<hr/>\n\n<p>Many economists expect Jackson Hole to be the forum where the Fed releases details of the tapering program. Once the Fed announces it will cut back, it is then expected to wait a few months before slowly paring back the purchases over many months. The end of the easing program is important since it would then open the door to a potential rate hike, based on the strength of the economy.</p>\n\n<hr/>\n\n<p>“The narrative here is the markets are likely to continue going back and forth with regard to their view on the Fed assessment of whether transitory is correct or not,” Emanuel said. “Transitory” is how the Fed describes its view that the surge in inflation will be short-lived.</p>\n\n<hr/>\n\n<p>In the past week, some of the inflationary pressure in the market dissipated with a major sell-off across the commodities complex. The Fed’s policy talk helped spur a surge in the dollar, which was part of the reason for the selling. But the first catalyst was a move by China to cool the hot commodities markets. Reuters reported that a Chinese government agency planned to release reserves of aluminum, copper and zinc.</p>\n\n<hr/>\n\n<p>Copper was down more than 8.4% on the week, its worst week since March 2020.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/QeDvubB.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/c4mOFUy.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/nfckMPA.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/7H0ZZUf.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/JBlGnli.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/OYV6vlW.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/GCWxRIe.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/WstlP83.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/xNqbPVY.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>([CLICK HERE FOR THE CHART!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/nyNirM8.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/IkwhPC6.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/J7KAQ4b.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/yEBCfYQ.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Down Triple Witching Weeks Trigger More Weakness Week After</h1>\n\n<p>As stocks continue to sell off on this Q2 Triple Witching Friday it is a good time to review the history and the pattern of down Triple Witching Weeks triggering more weakness the week after. This phenomenon is detailed on page 106 of the Stock Trader’s Almanac page 2022. The updated table of the four annual DJIA TWWs is pictured here.</p>\n\n<p>The most important fact to note is that the week after TWW is the worst in Q2 – down 26 of the past 30 years since 1991. Down TWWs not only trigger weakness the week after, but that trend is most pronounce in Q2 and Q3 – the quarters within the Worst Six Months. Since 1991, of 39 down TWWs, 27 following weeks were also down. But in Q2 10 of the 12 down TWWs were followed by a down week after and it’s 11 of 12 in Q3.</p>\n\n<p>Proceed with caution next week. And Happy Father’s Day to all the dads!</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/722621168e16fd8f0481b3814ac465a9/13339cd31fcce957-b1/s500x750/1fdc67c74f34e17bdc0587af331eda5a373860da.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Big Drops In The Percent of Stocks Above Their 50-DMAs</h1>\n\n<p>In yesterday&#39;s Sector Snapshot, we highlighted how the internals of several sectors have weakened dramatically in recent days. One such measure in which there are drastic differences versus a couple of weeks ago is the reading on the percentage of stocks above their 50-DMAs. In the charts below, we show the changes in this reading across sectors and for the broader S&amp;P 500.</p>\n\n<p>As shown, the two sectors which have seen the largest share of their stocks fall below the support of their 50-DMAs are Financials and Materials. Two weeks ago, both of these sectors boasted some of the strongest readings of all sectors, but through yesterday, those readings have fallen over 60 percentage points. Meanwhile, Energy and Real Estate have seen almost all of their stocks trade above their 50-DMAs over the past two weeks without much change. While the declines were not as dramatic as Materials and Financials, Industrials and Consumer Staples have also seen a significant share of their members fall below their 50-DMAs. While most sectors have seen a decline in this reading, Tech and Health Care have been notable standouts with both sectors having more stocks above their 50-DMAs now than two weeks ago. This is indicative of the rotation that has been going on underneath the surface throughout the entire bull market that began when the S&amp;P made its 2020 low after the COVID Crash last March.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/061821-50-DMA.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Leading Indicators Continue to Forecast Growth</h1>\n\n<p>As the economic focus has frantically shifted from inflation concerns to peak growth fears to the Federal Reserve’s (Fed) tightening timeline in recent weeks, it can be helpful to take a step back and assess the broad economic trend with a diversified set of indicators.</p>\n\n<p>Through this lens, we are encouraged by the latest reading of the Leading Economic Index (LEI), which strongly suggested that economic growth would continue at a strong clip in the near-to-intermediate term.</p>\n\n<p>On Thursday, June 17, the Conference Board released its May 2021 report detailing the latest datapoint for the LEI, a composite of ten data series that tend to lead changes in economic activity. Many economic data points are backward looking, but we pay special attention to the LEI, as it has a forward-looking tilt to it and spans many segments of the economy. The index grew 1.3% month over month, building on the strength seen in recent months since flirting with negative territory in February.</p>\n\n<p>“Three consecutive monthly gains in excess of 1% tend to be rare, and in fact, we never experienced that coming out of the 2008 recession,” said LPL Financial Chief Investment Strategist Ryan Detrick. “That we have seen this dynamic twice now exiting the trough of the most recent recession speaks to the speed and strength of the recovery. We certainly understand near-term jitters, but we expect broader economic trends to remain positive over the intermediate term, consistent with the LEI’s message.”</p>\n\n<p>As seen in the LPL Chart of the Day, the LEI has shown strong growth the last three months after limping through the second half of winter.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/06/6.18.21-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>Seven of the ten components grew in May, while two fell and one remained unchanged. Average weekly initial claims for unemployment insurance, the ISM New Orders Index, and the interest rate spread represented the three largest contributors. Building permits and manufacturers’ new orders for nondefense capital goods excluding aircraft detracted from the overall index’s performance, while average weekly manufacturing hours held steady.</p>\n\n<p>Strong breadth among the underlying components reinforces our view of continued economic strength. While supply chain bottlenecks and a slower-than-desired labor market recovery have acted as near term speedbumps, we expect those dynamics to largely self-correct and propel the economy further in the second half of the year. Reopening effects are snowballing, and we believe ever-increasing vaccination numbers, warmer weather, and the potential for strong employment growth later in 2021 warrant continued optimism for this economy.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Citi Surprise Indices Surging But Not Everywhere</h1>\n\n<p>It is a boring start to the week with nothing on the docket for earnings, Fed speakers, or economic data. With regards to the latter, the slate will pick up tomorrow with several US releases including retail sales, PPI, industrial production, and more. Expectations for tomorrow&#39;s releases are a bit mixed relative to the prior readings in each indicator, but overall, recent US data has been beating expectations at a healthy rate. The charts below show the Citi Economic Surprise indices for a variety of global regions and the US. Positive readings in these indices indicate economic data is coming in above forecasts, and vice versa for negative readings. Additionally, higher positive or negative readings would mean that economic data is exceeding or coming up short of those forecasts by a wider margin.</p>\n\n<p>Currently, the US index is well off record levels from the past year, but it has bounced since the start of June. The index has risen 42.7 points in the ten days from the end of May to last Friday. That move stands in the top 2% of all 10-day changes since the index began in 2003. That also comes not even a full month after the index saw its first negative reading in a year. While the negative reading was far from anything extreme, the sharp rebound has been impressive, leaving the index at a historically healthy level in the 83rd percentile.</p>\n\n<p>The US is not alone in having seen a rebound. Although it is similarly off the peak from last summer and generally trending lower since then, the global index has consistently sat at the high end of its historical range over the past year. The current reading is still in the top 1% of all periods, and the move higher over the past ten days is again dramatic ranking in the top 5% of ten-day changes in the index&#39;s history. While the jump in the US index has likely played at least some part in this, other regions around the world are also pulling weight having seen just as, if not more, significant moves. Sticking with a look at the move over the past ten days, the gains for the indices covering APAC and Central/Eastern Europe, the Middle East, and Africa all rank in the 98th percentile while the move in the index tracking Latin American countries ranks in the top decile. Each of these indices now sits in the top 1% or 2% of their historical ranges. One outlier region not contributing to the pickup in the global index has been Europe. While the Eurozone index is far from weak, it has not seen much of a move higher recently as other regions have.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/061421-CESI-Regions.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Likely thanks to the weakness in Eurozone countries, a similar dichotomy can be seen comparing the indices for major developed economies (the G10 members) and emerging market countries. While the index tracking major economies has simply held up at healthy levels, the emerging markets index has leaped to new record highs, breaking well above the previous records set earlier in the pandemic. BRIC countries in particular are some to thank for that sharp move higher as the index has seen one of its largest short-term moves on record.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/061421-CESI-EM.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>June Quarterly Options Expiration Week and After Historically Volatile</h1>\n\n<p>The second Triple Witching Week (Quadruple Witching if you prefer) of the year brings on some volatile trading with losses frequently exceeding gains. NASDAQ has the weakest record on the first trading day of the week. Triple-Witching Friday is usually better, DJIA has been up ten of the last eighteen years, but down five of the last six.</p>\n\n<p>Full-week performance is choppy as well, littered with greater than 1% moves in both directions. The week after Triple-Witching Day is horrendous. This week has experienced DJIA losses in 27 of the last 31 years with an average performance of –1.14%. S&amp;P 500 and NASDAQ have fared slightly better during the week after over the same 31-year span, declining 0.79% and 0.29% respectively on average.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/141a2a5cc757b0258359ef263f470d91/40704b63ac1ec12f-d2/s500x750/ee86f4713788c515bd122988f5c985ef05532feb.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/9d41367baa02618174dc7702572999ad/40704b63ac1ec12f-25/s500x750/111c5f72fa726e8c8a34ba1f7c4c85b920df1064.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/f92b0fab413284d3f5b71c9e6ebffef5/40704b63ac1ec12f-6e/s500x750/d8a03a5d3da450d13a7a4d98acea5011e421aa94.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Sentiment Shaky</h1>\n\n<p>Although there has not been any sort of dramatic breakout to the upside as the index has fallen over the past few days, the S&amp;P 500 did manage to tag new record highs in the past week for the first time since May 10th. The record-high milestone has done little to shift sentiment though. The AAII survey of individual investor sentiment saw its reading on bullish sentiment rise 0.9 percentage points to 41.1%. While higher, that is still three points below the reading from just a couple of weeks ago.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/061721-AAII-Bull.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The biggest move was in neutral sentiment as that reading fell 6.4 percentage points to 32.7%. That is the lowest reading in over a month and marked the biggest drop in neutral sentiment since the week of April 8th. Even though that was a big drop, neutral sentiment remains slightly elevated versus the historical average (31.42%) and especially relative to what has been the norm over the past year.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/061721-AAII-Neut.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The past couple of weeks have seen historically muted readings on bearish sentiment. While that is still the case with this week&#39;s readings remaining at the low end of its historical range, bearish sentiment saw a big 5.5 percentage point gain rising to 26.2%. That one-week uptick in bearish sentiment was the largest since last September. It also marked the first time since the end of last month that over a quarter of respondents reported as bearish. While the move was not nearly as large, the Investors Intelligence survey echoed that increase in bearish sentiment with the bull-bear spread in that survey falling from 38.3 to 37.8 after inverse moves in bullish and bearish sentiment. In other words, broadly speaking, optimism has appeared to have peaked for the time being.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/06/061721-AAII-Bear.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<p>Here are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-</p>\n\n<hr/>\n\n<blockquote>\n<ul>\n<li><strong>(T.B.A. THIS WEEKEND.)</strong></li>\n</ul>\n</blockquote>\n\n<hr/>\n\n<h6><strong>([CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!]())</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h6><strong>(<a href=\"https://i.imgur.com/I65Tz5o.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 6.21.21 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())</h6>\n\n<p>(NONE.)</p>\n\n<h1><strong><em>Monday 6.21.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  6.22.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/9Hkdz07.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 6.22.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 6.23.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/bqfPKzo.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 6.23.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/XDze5WZ.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 6.24.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/FBtMRmq.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 6.24.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/7xcKWik.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 6.25.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/nXBoxxn.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 6.25.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>(T.B.A. THIS WEEKEND.)</h1>\n\n<p><strong>(T.B.A. THIS WEEKEND.)</strong> (T.B.A. THIS WEEKEND.).</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great trading week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/o32y40/wall_street_week_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "o32y40",
  "is_self": true,
  "media": null,
  "is_video": false
}