{
  "author": "jonvoights_car",
  "original_created_utc": 1644467058,
  "title": "I know nobody cares, but after paperhanding 10+ btc years ago, I have finally clawed my way back to 2.1btc",
  "created_utc": 1644503627,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m using a throwaway for security, and also because I know some people will mock me for this post, but I wanted to share my journey. &lt;/p&gt;\n\n&lt;p&gt;After first learning about bitcoin in 2012, and feeling like I missed the boat in the 2013 bull run, I decided to start buying modest amounts in January 2014. In hindsight they weren&amp;#39;t modest at all. I was buying .5 or entire bitcoins every month. Over the next 2 years, I accumulated (and spent) anywhere between 6-12 btc. I wasn&amp;#39;t super detailed with my records at the time, and I spent a bunch of it frivolously. &lt;/p&gt;\n\n&lt;p&gt;I ended up buying a house in 2016, and I sold the rest of my stack for the down payment, just before the 2017 run up to 20k, so I missed out on all those gainz. Over the next 2 years I didn&amp;#39;t buy anything, but I still watched the market. In 2019 I started buying again. It has taken over 2 years, but I have successfully joined the &amp;quot;10 millionth club&amp;quot; (2.1btc is a 10 millionth of the entire bitcoin economy). To think I had a realistic shot at 21btc if I&amp;#39;d just stuck with it. Ah well. &lt;/p&gt;\n\n&lt;p&gt;Anyway, the point of this post is to say keep stacking and hodling. We are still early, even though we always feel late. Pretty weird.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tldr&lt;/strong&gt; i just dca&amp;#39;d for 2 years and now I have 2.1 btc&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/Bitcoin/comments/soxgdo/i_know_nobody_cares_but_after_paperhanding_10_btc/",
  "subreddit": "Bitcoin",
  "id": "soxgdo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm using a throwaway for security, and also because I know some people will\nmock me for this post, but I wanted to share my journey.\n\nAfter first learning about bitcoin in 2012, and feeling like I missed the boat\nin the 2013 bull run, I decided to start buying modest amounts in January 2014.\nIn…"
}