{
  "author": "Unlucky-Nobody",
  "original_created_utc": 1639755143,
  "title": "That' it. I'm done, I am going to start liquidating my positions this weekend. Final Post.",
  "created_utc": 1639760161,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So yeah. I recently learnt I have terminal cancer (stage 4 sarcoma) I&amp;#39;m 39 found a lump in my neck a few weeks ago.&lt;/p&gt;\n\n&lt;p&gt;Crypto has been incredibly good to me. I started mining Ether in 2018 and have been heavily into defi and staking since late 2020 needless to say I have done well. But you can&amp;#39;t take it with you. So now I&amp;#39;m going to blow my profits like there is no tomorrow. I have no dependents.&lt;/p&gt;\n\n&lt;p&gt;I have Been quiet lurker in this community for quite a while. I have learnt so much here that I have shared with my friends and family. My boomer mum owns a ETH BTC and Matic. They will carry the torch for me.&lt;/p&gt;\n\n&lt;p&gt;While I have come to terms with my fate the thing I&amp;#39;m most disappointed by is that I won&amp;#39;t be around to see the inevitable financial revolution that is coming. I&amp;#39;m am very confident I was going to be a crypto millionaire.&lt;/p&gt;\n\n&lt;p&gt;Thank you all for this Awesome community. Keep it strong guys!&lt;/p&gt;\n\n&lt;p&gt;To the fucking moon!&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Edit Thank you all for the kind messages and support! for now I need a break, this has been very emotional. I may make some replies tomorrow&lt;/p&gt;\n\n&lt;p&gt;Edit 2: I normally wouldn&amp;#39;t disclose this and it feels weird and wrong but I have about 40k to blow. fortunately I&amp;#39;m in Australia and all my medical expenses will be covered. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 3075,
  "permalink": "/r/CryptoCurrency/comments/rijxsf/that_it_im_done_i_am_going_to_start_liquidating/",
  "subreddit": "CryptoCurrency",
  "id": "rijxsf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So yeah. I recently learnt I have terminal cancer (stage 4 sarcoma) I'm 39 found\na lump in my neck a few weeks ago.\n\nCrypto has been incredibly good to me. I started mining Ether in 2018 and have\nbeen heavily into defi and staking since late 2020 needless to say I have done\nwell. But you can't take…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そうそう。最近、末期がん（ステージ4の肉腫）であることを知りました 39歳の私が見つけたのは\n数週間前、首にしこりができました。\n\nCryptoは私にとって信じられないほど良いものでした。私は2018年にEtherのマイニングを開始し\n2020年後半からデフィとステーキングにどっぷりはまり、言うまでもなく私はうまく\nをよくしています。でも、取れない・・・。",
      "title": "それだ。今週末にはポジションの整理を始めるつもりです。最後の投稿です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，是的。我最近得知我得了癌症晚期（第4期肉瘤），我39岁，几周前发现脖子上有一个肿块。\n几周前在我的脖子上发现了一个肿块。\n\nCrypto对我来说是非常好的。我在2018年开始开采以太币，并一直\n自2020年末以来，我一直在大量投入defi和staking，不用说，我已经做得很好了。\n很好。但你不能把...",
      "title": "就这样吧。我已经完成了，我将在本周末开始清算我的头寸。最后一篇文章。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，是的。我最近得知我得了癌症晚期（第4期肉瘤），我39歲，幾周前發現脖子上有一個腫塊。\n幾周前在我的脖子上發現了一個腫塊。\n\nCrypto對我來說是非常好的。我在2018年開始開採以太幣，並一直\n自2020年末以來，我一直在大量投入defi和staking，不用說，我已經做得很好了。\n很好。但你不能把...",
      "title": "就這樣吧。我已經完成了，我將在本週末開始清算我的頭寸。最後一篇文章。"
    }
  ]
}