{
  "author": "fan_of_hakiksexydays",
  "the_new_excerpt": "I don't really need to lecture anyone about the rising prices of goods.\n\nInflation is nothing new. And it's only getting worse with the aftermath of\ncovid.\n\nBut now we also have to deal with housing prices getting out of control with the\nlumber shortage.\n\nAnd many goods have accelerated their rise…",
  "original_created_utc": 1621603152,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "物価の上昇について、私が誰かに説教する必要はありません。\n\nインフレは今に始まったことではない。そして、それはcovidの余波を受けて悪化する一方だ。\ncovid\n\nしかし今は、木材不足で制御不能になった住宅価格にも対処しなければなりません。\n材木不足で住宅価格がコントロールできなくなっている。\n\nそして、多くの商品がその上昇を加速させています...。",
      "title": "暗号のボラティリティーについては何とでも言えますが、インフレや貧乏人が貧乏人になる今日の世界では、暗号はまだ私たちが得た最高のチャンスかもしれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的不需要向任何人讲授商品价格上涨的问题。\n\n通货膨胀不是什么新鲜事。而且，随着科威德事件的发生，它只会变得更糟。\ncovid。\n\n但现在我们还必须处理住房价格因木材短缺而失控的问题。\n木材短缺。\n\n许多商品也加速了上涨......",
      "title": "说你想说的是加密货币的波动性，但在今天这个通货膨胀和穷人越来越穷的世界，它可能仍然是我们得到的最好机会"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的不需要向任何人講授商品價格上漲的問題。\n\n通貨膨脹不是什麼新鮮事。而且，隨着科威德事件的發生，它只會變得更糟。\ncovid。\n\n但現在我們還必須處理住房價格因木材短缺而失控的問題。\n木材短缺。\n\n許多商品也加速了上漲......",
      "title": "說你想說的是加密貨幣的波動性，但在今天這個通貨膨脹和窮人越來越窮的世界，它可能仍然是我們得到的最好機會"
    }
  ],
  "title": "Say what you want about crypto's volatility, but in today's world of inflation and poorer getting poorer, it may still be the best chance we got",
  "created_utc": 1621620467,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t really need to lecture anyone about the rising prices of goods.</p>\n\n<p>Inflation is nothing new. And it&#39;s only getting worse with the aftermath of covid.</p>\n\n<p>But now we also have to deal with housing prices getting out of control with the lumber shortage.</p>\n\n<p>And many goods have accelerated their rise in price from the issues of supply chains. Like anything that has a chip in it. Including cars.</p>\n\n<p>While unemployment is going down, down from a ridiculous high, it&#39;s still mostly low paying jobs.</p>\n\n<p>Mostly jobs where typically half, or even most of your wage goes directly into your rent. Good luck ever buying your own house. Even college educated people are filling those jobs.</p>\n\n<p>As volatile as crypto might be, if you look in the long run, anyone who has held through the volatility has come out on top, and on top of inflation.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3ac238w52h071.png?width=1600&amp;format=png&amp;auto=webp&amp;s=3d216f6252e60a601b5e040d2fc50e000465c067\">https://preview.redd.it/3ac238w52h071.png?width=1600&amp;format=png&amp;auto=webp&amp;s=3d216f6252e60a601b5e040d2fc50e000465c067</a></p>\n\n<p>And it doesn&#39;t look like it&#39;s gonna stop yet. It even has a stock to flow similar to gold, and can store its value really well in the long run. Thanks in part to its scarcity.</p>\n\n<p>I&#39;ve been in crypto for over 8 years. And I have been through crashes like we have now. I have been through the bear winters. But I have come out on top each time, and still managed to beat inflation despite all that.</p>\n\n<p>Bitcoin has those 4 years halving. It&#39;s built in. It&#39;s a unique cyclical function that you don&#39;t see in gold, or bonds, or the stock market. Even people who bought a top, if they held through those cycles, have come out higher.</p>\n\n<p>In a world where it gets harder to stay above inflation. Where you are essentially getting a pay cut every year when you don&#39;t get a raise. Where upward mobility is increasingly difficult. Crypto may just be the only thing we can rely on anymore.</p>\n\n<p>Crypto doesn&#39;t discriminate. It&#39;s not something for just the rich. It doesn&#39;t have restrictions. It just requires you to keep a cool head. Even someone in a developing country can benefit from crypto.</p>\n\n<p>At the end of day, crypto provides opportunity.</p>\n\n<p>And if it might be volatile in the short run. But keep in mind that there are no good or bad price action in a market. There is just opportunity. And chaos can provide more opportunity.</p>\n</div><!-- SC_ON -->",
  "score": 883,
  "permalink": "/r/CryptoCurrency/comments/nhsbt0/say_what_you_want_about_cryptos_volatility_but_in/",
  "subreddit": "CryptoCurrency",
  "id": "nhsbt0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381675
}