{
  "author": "shlammyjohnson",
  "original_created_utc": 1624639591,
  "title": "Shorts on bitcoin just increased 1000% to 24,178 (one contract is 5 BTC) for a total of almost $4 billion in shorts in a few hours.",
  "created_utc": 1624653032,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>According to datamish.com, you can visually see the price impact as shorts are piled on, making up nearly 35% of total positions, and you can see how the price stabilizes when these positions stop increasing. </p>\n\n<p>I don&#39;t know if there&#39;s some sort of huge expiry happening near the end of the month today, but it looks like the price is being manipulated to stave off losses for existing shorts or cause max pain to some of the longs with greater weight.</p>\n\n<p>Might be a good time to buy a chunk of BTC if you&#39;ve got an appetite for risk lately, especially considering the bullish news and likelyhood that microstrategy and other companies will be purchasing near these prices.</p>\n\n<p>Edit: Using the same Info I would also like to point out that the vast majority of these shorts remain unhedged, almost guaranteeing price movement at time of expiry (Obviously I can&#39;t say to what side, gotta ask the magic conch for that).</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/o7riov/shorts_on_bitcoin_just_increased_1000_to_24178/",
  "subreddit": "CryptoCurrency",
  "id": "o7riov",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "According to datamish.com, you can visually see the price impact as shorts are\npiled on, making up nearly 35% of total positions, and you can see how the price\nstabilizes when these positions stop increasing.\n\nI don't know if there's some sort of huge expiry happening near the end of the\nmonth…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "datamish.comによると、ショートが積み重なって価格に影響が出ているのが視覚的にわかります。\n全体の35％近くを占めるショートが積み重なると価格に影響が出てくるのが視覚的にわかりますし、これらのポジションが増えなくなると価格が安定するのもわかります。\nこれらのポジションの増加が止まると、価格が安定することがわかります。\n\n月末近くに何か大きな満期があるのかどうかはわかりませんが\n月末近くに何か大きな満期があるのかどうか...。",
      "title": "ビットコインのショートは、先ほど1000％増の24,178枚（1枚は5BTC）となり、数時間で合計約40億ドルのショートとなりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据datamish.com，你可以直观地看到价格的影响，因为空头被堆积在一起\n的影响，占总头寸的近35%，你可以看到，当这些头寸停止增加时，价格是如何稳定下来的。\n你可以看到当这些头寸停止增加时，价格如何稳定下来。\n\n我不知道在接近年底的时候是否有某种巨大的到期量发生\n我不知道在月底是否会有某种巨大的到期交易发生......",
      "title": "比特币的空头刚刚增加了1000%，达到24178个（一个合约是5个BTC），在几个小时内总共有近40亿美元的空头。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據datamish.com，你可以直觀地看到價格的影響，因爲空頭被堆積在一起\n的影響，佔總頭寸的近35%，你可以看到，當這些頭寸停止增加時，價格是如何穩定下來的。\n你可以看到當這些頭寸停止增加時，價格如何穩定下來。\n\n我不知道在接近年底的時候是否有某種巨大的到期量發生\n我不知道在月底是否會有某種巨大的到期交易發生......",
      "title": "比特幣的空頭剛剛增加了1000%，達到24178個（一個合約是5個BTC），在幾個小時內總共有近40億美元的空頭。"
    }
  ]
}