{
  "author": "cohonan",
  "original_created_utc": 1637471027,
  "title": "What if gas fees never go down?",
  "created_utc": 1637498180,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve had an epiphany about this. What if the high gas fees never go down, and it’s all okay because we are witnessing the “fat protocol theory” at work. </p>\n\n<p>The fat protocol theory is that the value will naturally flow to the base crypto that other layer cryptocurrencies, and projects like NFT are built on. </p>\n\n<p>The main protocol still remains valuable but the demand stays high because it’s the consolidation layer for NFT, layer 2 currencies, and crypto gaming. </p>\n\n<p>You’re not expected to use the main crypto as a retail defi investor. It’s still valuable to own, but unless you can afford the gas fees of the main protocol, you just use the cheaper layer 2 and let them resolve it for you. </p>\n\n<p>To take the gas analogy further. You aren’t tapping into the crude oil pipeline to fill up your car, it has to first go through a refinery that converts it into a form you can use.</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/qynm6z/what_if_gas_fees_never_go_down/",
  "subreddit": "CryptoCurrency",
  "id": "qynm6z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve had an epiphany about this. What if the high gas fees never go down, and\nit’s all okay because we are witnessing the “fat protocol theory” at work.\n\nThe fat protocol theory is that the value will naturally flow to the base crypto\nthat other layer cryptocurrencies, and projects like NFT are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これについては、私も思い当たる節があります。もし、高いガソリン代が下がらなかったらどうしよう。\nなぜなら、私たちは「脂肪プロトコル理論」を目の当たりにしているからである。\n\nファットプロトコル理論とは、ベースとなる暗号に価値が自然に流れ込むことで\n他のレイヤークリプトやNFTのようなプロジェクトが...",
      "title": "ガス料金が下がらないとしたら？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对此有一个顿悟。如果高额的汽油费永远不会下降，而\n这一切都没关系，因为我们正在见证 \"脂肪协议理论 \"的运作。\n\n胖协议理论认为，价值会自然地流向基础加密货币\n其他层的加密货币，以及像NFT这样的项目是...",
      "title": "如果汽油费永远不会下降呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對此有一個頓悟。如果高額的汽油費永遠不會下降，而\n這一切都沒關係，因爲我們正在見證 \"脂肪協議理論 \"的運作。\n\n胖協議理論認爲，價值會自然地流向基礎加密貨幣\n其他層的加密貨幣，以及像NFT這樣的項目是...",
      "title": "如果汽油費永遠不會下降呢？"
    }
  ]
}