{
  "author": "ledditwind",
  "original_created_utc": 1638390119,
  "title": "Since the Supreme Court Justices are all political appointees with a role that lasted a lifetime, did the Founding Fathers ever worry that it would lead to them to side with the political parties or groups who appoint them? How does their reputation evolve throughout the two centuries since?",
  "created_utc": 1638444493,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: I greatly appreciated the great answers regarding how the SCOTUS system came to being. That was enlightening. I was thinking these questions because in the last two months, I&amp;#39; ve read and listen to interviews from three different Justices, nominated by Democratic and Republican presidents, strongly defending that SCOTUS rulings as apolitical. Yet none of them would be sitting as justices if they aren&amp;#39; t nominated by a politician.  These interviews reminded me of a remark said to come from Eishenhower that his chief justice nomination is his &amp;quot;most damn fool mistake&amp;quot;. It seem that he expected the Justice Warren to side more with his view and dismay that it did not.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39; m more curious on how the Supreme Court conduct themselves in accordances to the politics of their appointers and their reputation as apolitical branch throughout the 1800s to the Warren Court. I&amp;#39; m not looking for modern controversies in the last 30 years or so, there&amp;#39; s enough if that on the news.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/r6o5nf/since_the_supreme_court_justices_are_all/",
  "subreddit": "AskHistorians",
  "id": "r6o5nf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: I greatly appreciated the great answers regarding how the SCOTUS system\ncame to being. That was enlightening. I was thinking these questions because in\nthe last two months, I' ve read and listen to interviews from three different\nJustices, nominated by Democratic and Republican presidents,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：SCOTUSの制度について、素晴らしいご回答をいただき、大変感謝しております。\nということです。勉強になりました。私がこのような質問を考えていたのは、この間\nこの2ヶ月間、3人のインタビューを読み、聴きました。\n民主党と共和党の大統領によって指名された判事、...",
      "title": "最高裁判事は全員が政治的に任命され、生涯にわたる役割を担っているため、建国の父たちは、彼らを任命した政党や団体の側につくことになるのではないかと心配しなかったのでしょうか。それから2世紀の間に、彼らの評価はどのように変化したのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我非常感谢你对上合组织系统的精彩回答。\n来的。这很有启发性。我在想这些问题，因为在过去的两个月里，我读了\n在过去的两个月里，我阅读并听取了三个不同的大法官的访谈。\n由民主党和共和党总统提名的大法官，...",
      "title": "由于最高法院的大法官都是政治任命的，其作用持续一生，开国元勋们是否曾担心这会导致他们站到任命他们的政党或团体一边？在此后的两个世纪里，他们的声誉是如何演变的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我非常感謝你對上合組織系統的精彩回答。\n來的。這很有啓發性。我在想這些問題，因爲在過去的兩個月裏，我讀了\n在過去的兩個月裏，我閱讀並聽取了三個不同的大法官的訪談。\n由民主黨和共和黨總統提名的大法官，...",
      "title": "由於最高法院的大法官都是政治任命的，其作用持續一生，開國元勳們是否曾擔心這會導致他們站到任命他們的政黨或團體一邊？在此後的兩個世紀裏，他們的聲譽是如何演變的？"
    }
  ]
}