{
  "author": "erenjames",
  "the_new_excerpt": "i feel like i would really benefit from someone who can listen to what goes on\nin my head (my thought processes, mantras, etc) and give me insight into why i\nmight be feeling this way / thinking these things, or asking me pointed\nquestions that make me think deeper about myself. personal history has…",
  "original_created_utc": 1616566416,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得我真的会受益于一个人 谁可以听什么去了。\n在我的脑海中（我的思维过程、咒语等），让我深入了解为什么我\n可能会有这样的感觉/想法，或问我尖锐的。\n问题，让我对自己进行更深层次的思考.个人历史已经...",
      "title": "我可以找一个心理医生来 \"倾诉 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得我真的會受益於一個人 誰可以聽什麼去了。\n在我的腦海中（我的思維過程、咒語等），讓我深入瞭解爲什麼我\n可能會有這樣的感覺/想法，或問我尖銳的。\n問題，讓我對自己進行更深層次的思考.個人歷史已經...",
      "title": "我可以找一個心理醫生來 \"傾訴 \"嗎？"
    }
  ],
  "title": "would it be OK for me to get a therapist just to 'talk to'?",
  "created_utc": 1616628756,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>i feel like i would really benefit from someone who can listen to what goes on in my head (my thought processes, mantras, etc) and give me insight into why i might be feeling this way / thinking these things, or asking me pointed questions that make me think deeper about myself. personal history has proven that that kind of thinking about my behavior is the only thing that helps me change how i act or think for the better. is this a good enough reason to see a counselor? ive seen therapists, counselors, and psychiatrists galore in the past but usually for more urgent matters (such as im perma feeling HORRIBLE or like doing terrible things to myself in the name of coping). i feel like im doing mostly alright right now emotionally/physically/mentally, but that theres room for personal growth. is this a good enough reason to return to therapy???</p>\n\n<p>info: my insurance would cover all of the costs for sessions (medicaid), i even know a place and a potential therapist i could return to and be comfortable with.</p>\n\n<p>in the past i feel i&#39;ve had a lot of &quot;&quot;breakthroughs&quot;&quot; just by having to verbally recount experiences or detail thought processes to an objective bystander, but im not sure if this is enough of a reason to visit a therapist if i am not currently in need of urgent support or even something like coping mechanisms (which i have enough of) to get me through life.</p>\n</div><!-- SC_ON -->",
  "score": 251,
  "permalink": "/r/NoStupidQuestions/comments/mbyzil/would_it_be_ok_for_me_to_get_a_therapist_just_to/",
  "subreddit": "NoStupidQuestions",
  "id": "mbyzil",
  "is_self": true,
  "media": null,
  "is_video": false
}