{
  "author": "SealedForYourSafety",
  "original_created_utc": 1639687295,
  "title": "Crypto won't make video games better, folks just want to get rich",
  "created_utc": 1639733485,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think anybody that expects crypto to improve video games is foolish. Some of the worst decisions for modern games were motivated by greed and value.&lt;/p&gt;\n\n&lt;p&gt;Excellent level design, engaging mechanics and balancing couldn&amp;#39;t be improved by a real-world value system. Take a critically acclaimed game like Dark Souls and tell me the ways it could actually be made better by crypto. Would you add microtransactions for rare weapons? Would you be able to convert large amounts of Souls into fractions of a Soul Coin?&lt;/p&gt;\n\n&lt;p&gt;Any inclusion I can think of would incentivize players to farm areas until the experience is routine. It would encourage the pvp community to work only with the most efficient meta builds and make niche setups obsolete as everyone would rather win than familiarize themselves with a unique weapon, spell or tactic. If it were just loot boxes, that would give the edge to players willing to spend the most money, killing this perfectly balanced experience that FROM Software has created. One might say a player could still play however they wanted, but the money already would have changed the landscape so much for them, that it wouldn&amp;#39;t even be the same experience.&lt;/p&gt;\n\n&lt;p&gt;These problems already exist in games without crypto and people play them like jobs. That&amp;#39;s not what I want in my in my recreation time. I would hate it if the next potentially great game was cheapened by these systems. When I hear the hype about integration in video games, I only see men with dollar signs in their eyes. Those aren&amp;#39;t my people and I don&amp;#39;t want them to change one of my favorite passtimes.&lt;/p&gt;\n\n&lt;p&gt;-This isn&amp;#39;t an original opinion, I just wanted to get a little deeper into the reason I don&amp;#39;t believe any interactive media would be improved by the blockchain. I want to hear everyone else&amp;#39;s thoughts. Maybe you can prove me wrong!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/rhzp2d/crypto_wont_make_video_games_better_folks_just/",
  "subreddit": "CryptoCurrency",
  "id": "rhzp2d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think anybody that expects crypto to improve video games is foolish. Some of\nthe worst decisions for modern games were motivated by greed and value.\n\nExcellent level design, engaging mechanics and balancing couldn't be improved by\na real-world value system. Take a critically acclaimed game like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号がビデオゲームを向上させると期待する人は、愚かだと思います。いくつかの\n現代のゲームにとって最悪の決断は、欲と価値観に突き動かされています。\n\n優れたレベルデザイン、魅力的なメカニック、バランス感覚は、以下のような理由で改善されませんでした。\n現実世界の価値観で 例えば、絶賛されたゲーム...",
      "title": "暗号はビデオゲームを良くしない、人々はただ金持ちになりたいだけだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为任何期望加密货币改善视频游戏的人都是愚蠢的。一些\n现代游戏的一些最糟糕的决定是由贪婪和价值驱动的。\n\n优秀的关卡设计、引人入胜的机制和平衡性无法通过以下方式得到改善\n一个现实世界的价值体系来改善。以一个广受好评的游戏为例，如...",
      "title": "加密货币不会让视频游戏变得更好，人们只想发财"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲任何期望加密貨幣改善視頻遊戲的人都是愚蠢的。一些\n現代遊戲的一些最糟糕的決定是由貪婪和價值驅動的。\n\n優秀的關卡設計、引人入勝的機制和平衡性無法通過以下方式得到改善\n一個現實世界的價值體系來改善。以一個廣受好評的遊戲爲例，如...",
      "title": "加密貨幣不會讓視頻遊戲變得更好，人們只想發財"
    }
  ]
}