{
  "author": "atmowbray",
  "the_new_excerpt": "One of the biggest investing mistakes of my life was not holding my thousand or\nso Roku shares I got back when it was less than 30 per share and somewhere\naround the $5 billion market cap area (my biggest mistake twas not holding\nEnphase at 7 but that’s a different story). $5 billion seemed…",
  "original_created_utc": 1612475834,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一生中最大的投资失误之一，就是没有持有我的千或。\n所以Roku股份，我得到了回来，当它是不到30每股和地方\n50亿美金左右的市值区间（我最大的错误是没有持有\n7时的恩相，但那是另一个故事）。) 50亿美元似乎...",
      "title": "我有一种似曾相识的感觉，在好的方面。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一生中最大的投資失誤之一，就是沒有持有我的千或。\n所以Roku股份，我得到了回來，當它是不到30每股和地方\n50億美金左右的市值區間（我最大的錯誤是沒有持有\n7時的恩相，但那是另一個故事）。) 50億美元似乎...",
      "title": "我有一種似曾相識的感覺，在好的方面。"
    }
  ],
  "title": "FUBO: I’m having deja vu, in a good way",
  "created_utc": 1612535311,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the biggest investing mistakes of my life was not holding my thousand or so Roku shares I got back when it was less than 30 per share and somewhere around the $5 billion market cap area (my biggest mistake twas not holding Enphase at 7 but that’s a different story). $5 billion seemed expensive for a company like Roku and I was reminded of that constantly online. But there were still plenty of bulls and I did my research before buying, so I decided I would make it by biggest individual stock holding. But then it dipped, and being a relatively new investor at the time I was still very finicky. So I sold. At the time many people started talking about how it was a crowded field and there would be no way for them to make money and they couldn’t compete with other big names etc. etc. Go back and look at Seeking Alpha and Reddit comments about Roku from 2018 and you’ll see the negative chitter chatter. Well...just a couple short years later it’s now over 400/share with a market cap of 50 billion. It’s one of those that makes me proud that I saw the opportunity when I did but also makes me sick to look at. </p>\n\n<p>I see something similar brewing here, with a lot of uninformed folks talking about how Fubo is “no different than cable” due to the price (yeah try to pay for cable sports packages with all Fubos channels and see if that stays under $60, not to mention the ability to watch any shows aired in the last 72 hours), how they’d be screwed if someone else offered the same at a lower price, if they lost their rights to certain channels, etc etc.  Even some of the little similarities are funny, like “Roku TVs” becoming a thing, and now Fubo buttons are being added to Hisense TV remotes.  But I digress...of course they aren’t perfect yet and there are always risks but this time...I’m holding on. As long as subscribers keep increasing, positive reviews on app stores roll in, and they continue improving in general, why not? </p>\n\n<p>I’m not a financial advisor and not guaranteeing anything, but this is my input for what it’s worth.</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/stocks/comments/lcrcla/fubo_im_having_deja_vu_in_a_good_way/",
  "subreddit": "stocks",
  "id": "lcrcla",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201955
}