{
  "author": "Set1Less",
  "original_created_utc": 1653378779,
  "title": "\"Move to Earn\" like STEPN are the latest ponzis. There is no value created in any of this. If we can just move our ass to \"earn\", all of us will be billionaires. Unfortunately, someone will be holding heavy bags in the end. Solana founder promoting this as a \"paradigm shift\" is scummy",
  "created_utc": 1653396814,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Move to earn apps are gaining popularity and many seem to even think all of this is sustainable. A huge number of such apps have just launched out of nowhere. &lt;/p&gt;\n\n&lt;p&gt;Stepn for their part helps further the scam by closely controlling how many invites can be sent out each day, thereby ensuring supply/demand and the ponzi scheme doesnt collapse overnight. However they can only do this for so long. New people buying shoes are paying for early entrants to exit. Some time ago, the cheapest shoe to enter was around $700. At the end of this scheme, many will lose their investments they have put into the scheme. &lt;/p&gt;\n\n&lt;p&gt;It is just similar to bitconnect where new depositors withdrawals were limited (you could only withdraw after some time in the system). If you control the entry and exit parametric of a devious ponzi scheme, you can further the time till it all collapses. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/62oorpohod191.jpg?width=1086&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=332688a2f5787dd9649103154300f65f774c38c4\"&gt;However, Solana&amp;#39;s founder thinks this is a \\&amp;quot;paradigm shift\\&amp;quot;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Based on these recommendation from &amp;quot;public figures&amp;quot;, people are putting money into this expecting profits. If everyone understands it&amp;#39;s a ponzi and still decides to play the game, knowing the first one out win and the last one baghold to zero - thats fine given how devious this industry is. But to promote it as a &amp;quot;paradigm shift&amp;quot;.... bruh&lt;/p&gt;\n\n&lt;p&gt;Some seem to think its not a scam because &amp;quot;the app makes me go an extra mile a day and I also made $100, I cant possibly be scam&amp;quot;. - this is the same kind of thought process that led to $40 BN being wiped off the market just 2 weeks ago.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 722,
  "permalink": "/r/CryptoCurrency/comments/uwlkfg/move_to_earn_like_stepn_are_the_latest_ponzis/",
  "subreddit": "CryptoCurrency",
  "id": "uwlkfg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Move to earn apps are gaining popularity and many seem to even think all of this\nis sustainable. A huge number of such apps have just launched out of nowhere.\n\nStepn for their part helps further the scam by closely controlling how many\ninvites can be sent out each day, thereby ensuring…"
}