{
  "author": "Set1Less",
  "original_created_utc": 1653378779,
  "title": "\"Move to Earn\" like STEPN are the latest ponzis. There is no value created in any of this. If we can just move our ass to \"earn\", all of us will be billionaires. Unfortunately, someone will be holding heavy bags in the end. Solana founder promoting this as a \"paradigm shift\" is scummy",
  "created_utc": 1653396814,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Move to earn apps are gaining popularity and many seem to even think all of this is sustainable. A huge number of such apps have just launched out of nowhere. &lt;/p&gt;\n\n&lt;p&gt;Stepn for their part helps further the scam by closely controlling how many invites can be sent out each day, thereby ensuring supply/demand and the ponzi scheme doesnt collapse overnight. However they can only do this for so long. New people buying shoes are paying for early entrants to exit. Some time ago, the cheapest shoe to enter was around $700. At the end of this scheme, many will lose their investments they have put into the scheme. &lt;/p&gt;\n\n&lt;p&gt;It is just similar to bitconnect where new depositors withdrawals were limited (you could only withdraw after some time in the system). If you control the entry and exit parametric of a devious ponzi scheme, you can further the time till it all collapses. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/62oorpohod191.jpg?width=1086&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=332688a2f5787dd9649103154300f65f774c38c4\"&gt;However, Solana&amp;#39;s founder thinks this is a \\&amp;quot;paradigm shift\\&amp;quot;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Based on these recommendation from &amp;quot;public figures&amp;quot;, people are putting money into this expecting profits. If everyone understands it&amp;#39;s a ponzi and still decides to play the game, knowing the first one out win and the last one baghold to zero - thats fine given how devious this industry is. But to promote it as a &amp;quot;paradigm shift&amp;quot;.... bruh&lt;/p&gt;\n\n&lt;p&gt;Some seem to think its not a scam because &amp;quot;the app makes me go an extra mile a day and I also made $100, I cant possibly be scam&amp;quot;. - this is the same kind of thought process that led to $40 BN being wiped off the market just 2 weeks ago.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 722,
  "permalink": "/r/CryptoCurrency/comments/uwlkfg/move_to_earn_like_stepn_are_the_latest_ponzis/",
  "subreddit": "CryptoCurrency",
  "id": "uwlkfg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Move to earn apps are gaining popularity and many seem to even think all of this\nis sustainable. A huge number of such apps have just launched out of nowhere.\n\nStepn for their part helps further the scam by closely controlling how many\ninvites can be sent out each day, thereby ensuring…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アプリで稼ぐために移動することが人気を集めており、多くはこのすべてが持続可能であるとさえ考えているようです。\nと思っている人も多いようです。このようなアプリの膨大な数が、突如として立ち上がりました。\n\nStepnは、1日に送信できる招待状の数を厳密に管理し、詐欺を助長しています。\n招待状は1日に何通まで送ることができるかを細かく管理し、それによって詐欺を助長しています。",
      "title": "STEPNのような \"Move to Earn \"は、最新のポンジスです。何一つ価値が生まれない。もし、「稼ぐ」ためにケツを動かすことができれば、全員が億万長者になれるだろう。残念ながら、最終的には誰かが重い荷物を持つことになる。これを「パラダイムシフト」と宣伝するソラナ創業者はクズだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "移动赚钱的应用程序越来越受欢迎，许多人似乎甚至认为这一切\n是可持续的。大量这样的应用程序刚刚推出就不知所踪了。\n\nStepn则通过严格控制每天可以发出多少个邀请来帮助进一步实施骗局。\n严格控制每天可以发出多少邀请，从而确保...",
      "title": "像STEPN这样的 \"移动赚钱 \"是最新的庞氏骗局。这些都没有创造任何价值。如果我们能够移动我们的屁股去 \"挣钱\"，我们所有人都会成为亿万富翁。不幸的是，最终会有人拿着沉重的袋子。索拉纳创始人将此作为 \"范式转变 \"来宣传，这是很卑鄙的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "移動賺錢的應用程序越來越受歡迎，許多人似乎甚至認爲這一切\n是可持續的。大量這樣的應用程序剛剛推出就不知所蹤了。\n\nStepn則通過嚴格控制每天可以發出多少個邀請來幫助進一步實施騙局。\n嚴格控制每天可以發出多少邀請，從而確保...",
      "title": "像STEPN這樣的 \"移動賺錢 \"是最新的龐氏騙局。這些都沒有創造任何價值。如果我們能夠移動我們的屁股去 \"掙錢\"，我們所有人都會成爲億萬富翁。不幸的是，最終會有人拿着沉重的袋子。索拉納創始人將此作爲 \"範式轉變 \"來宣傳，這是很卑鄙的。"
    }
  ]
}