{
  "author": "soggit",
  "the_new_excerpt": "First of all this is all just my speculation and not financial advice. I have no\nidea what I'm talking about when it comes to stocks and I've only been doing\nthis for like a couple months. I am not a financial advisor or professional.\nWhat I am is a physician with at least some literacy, though not…",
  "original_created_utc": 1620399220,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず第一に、これはすべて私の憶測であり、金融機関のアドバイスではありません。私は株に関して何を言っているのかさっぱりわかりませんし\n株に関しては何を言っているのかさっぱりわからないし、この仕事を始めて数ヶ月しか経っていない。\n数ヶ月しかやっていません。私は金融アドバイザーでも専門家でもありません。\n私は、少なくともある程度の知識を持った医師です。",
      "title": "私の最初のDD：私は医者ですが、$INOはムーンショットになると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，这一切只是我的猜测，而不是财务建议。我不\n我不知道我在谈论什么，当它涉及到股票时，我只做了\n我只做了几个月的时间。我不是一个金融顾问或专业人士。\n我是一名医生，至少有一些文化知识，虽然不是...",
      "title": "我的第一个DD：我是一名医生，我认为$INO即将登顶"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，這一切只是我的猜測，而不是財務建議。我不\n我不知道我在談論什麼，當它涉及到股票時，我只做了\n我只做了幾個月的時間。我不是一個金融顧問或專業人士。\n我是一名醫生，至少有一些文化知識，雖然不是...",
      "title": "我的第一個DD：我是一名醫生，我認爲$INO即將登頂"
    }
  ],
  "title": "My first DD: I'm a doctor and I think $INO is about to moonshot",
  "created_utc": 1620480994,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all this is all just my speculation and not financial advice. I have no idea what I&#39;m talking about when it comes to stocks and I&#39;ve only been doing this for like a couple months. I am not a financial advisor or professional. What I am is a physician with at least some literacy, though not expertise, in oncology. In fact I am hoping to become an oncologist once I&#39;m done with all my training. Without further ado...I present my first DD:</p>\n\n<p>I was working the overnight shift at my hospital last night and was doing some late night reddit browsing when I saw someone post about INO filing a new patent and potential for a buyout from Regeneron (<a href=\"https://www.reddit.com/r/wallstreetbets/comments/n6q9v0/regeneron_rgen_is_rumored_to_be_buying_out_ino/\">https://www.reddit.com/r/wallstreetbets/comments/n6q9v0/regeneron_rgen_is_rumored_to_be_buying_out_ino/</a>). The guy who posted it is a 5 year user and his name had &quot;MD&quot; in it so it caught my attention...but he has almost no post history other than asking 4 years ago about making a career out of consulting for EPIC (epic is the #1 electronic medical chart for those of you unfamiliar) and anyone asking that probably 1) is actually a doctor and 2) doesn&#39;t want to work in medicine because it&#39;s toxic af and I can totally relate...the sort of person who would have interest in using their knowledge and training for picking stocks instead of being a clinician...not much unlike the famous Dr. Burry</p>\n\n<p>That said his post just looked weird and sus af so I decided to &quot;do my own DD&quot; as they say. Now I am not 100% sure OP above is a real doctor but I do know that  I&#39;m a doctor so I should be able to interpret this ish pretty well (ok just a little well), right?</p>\n\n<p>Background</p>\n\n<p>I open the patent application and read up on it. My first impression? Lol you can&#39;t treat GBM. For those of you unaware GBM is a horrible horrible brain cancer (read more here: <a href=\"https://en.wikipedia.org/wiki/Glioblastoma\">https://en.wikipedia.org/wiki/Glioblastoma</a>) that is one of the few &quot;death sentences&quot; that exist in medicine. I had the unfortunate experience of having not just one but two of my friends in medical school have a parent die from GBM and it was absolutely devastating to watch. Because of the nature of brain cancer there&#39;s basically nothing that can be done to treat this. Currently patients undergo radiation which is horribly morbid and doesn&#39;t help much. Patients die within a year basically 100% of the time even with advances such as &quot;gamma knife&quot; radiation. I have personally witnessed the treatment of GBM as a medical student and the prevailing sentiment is that it&#39;s basically untreatable. But then I read more about their tech and the patent and....wait a second this actually sounds legit. So now to break down some of the science behind this....</p>\n\n<p>Methods</p>\n\n<p>INO&#39;s patented tech is that they use a unique delivery system to basically deliver their drugs through impermeable membranes. To put it in non-doctor terms they trojan horse medicine into the walled off city of your brain. Your brain is particularly difficult to treat with chemotherapy and immunotherapy (two of the main methods of medical cancer treatment) due to what is called the blood brain barrier. Your brain is (reasonably so) walled off from the rest of your body to avoid bad shit getting up in there. Unfortunately that means we can&#39;t get medicine up in there either. In particular the medicine they have developed (INO 5401) is a PD-1 inhibitor, but delivered into the brain. As soon as I saw PD-1 this peaked my interest hard. anti PD-1 drugs are immunotherapy medications that &quot;uncloak&quot; cancer from hiding from your immune system. The same mechanism of action is used in the very successful drug Keytruda aka Pembrolizumab (read more here: <a href=\"https://en.wikipedia.org/wiki/Pembrolizumab\">https://en.wikipedia.org/wiki/Pembrolizumab</a>) which has been used in other very deadly cancers like Sarcoma and Melanoma. The idea of being able to use this same class of drug on a brain cancer is crazy smart and the problem until now has been delivery of that drug. That&#39;s where INO comes in with their patented tech.</p>\n\n<p>Results</p>\n\n<p>Go to the patent link above and click &quot;images&quot;. This is the money shot. MRI on left = v bad cancer. MRI on the right = cancer is dead. What. Yep. Their patent describes necrosis of the tissue with complete resolution. Mind blowing. Now I&#39;m sure this doesn&#39;t work that well in EVERY patient because response to PD-1 inhibitors is varied. Most of the time it&#39;s a long shot but when it works IT FUCKING WORKS. I have literally seen melanoma and sarcoma MELT away...but only in some patients. I have seen patients with Stage IV terminal cancer be literally cured. Every GBM patient in the world should have access to this treatment. Oh and did I mention the lead inventor on the patent is a pediatric neuro-oncologist that worked at a very prestigious hospital in NY previously? Google her.</p>\n\n<p>Conclusion</p>\n\n<p>Ok so I&#39;m now convinced of the science side but how does this all equal money? I go look up the study. This is a phase 2 trial meaning that they are looking to see if the drug is effective (phase 1 = is the drug safe, phase 2 = does the drug work...did I mention that before I was a doctor I ran clinical research studies?). I saunter over to clinical<a href=\"https://trials.gov\">trials.gov</a> (the federal website where all clinical trials are listed) and notice that the trial for this drug is set to be complete June 2021. The completion date is when the final patient has completed study protocol...meaning they have 99% of their data and the study is essentially complete. I then saunter over to <a href=\"https://google.com\">google.com</a> (the worlds largest search engine) and look for other data they have. Turns out they have ALREADY PUBLISHED EXTREMELY PROMISING INTERIM DATA (<a href=\"https://www.prnewswire.com/news-releases/inovio-demonstrates-80-6-month-progression-free-survival-in-phase-2-glioblastoma-multiforme-gbm-study-with-ino-5401-in-combination-with-pd-1-inhibitor-libtayo-cemiplimab-300951433.html\">https://www.prnewswire.com/news-releases/inovio-demonstrates-80-6-month-progression-free-survival-in-phase-2-glioblastoma-multiforme-gbm-study-with-ino-5401-in-combination-with-pd-1-inhibitor-libtayo-cemiplimab-300951433.html</a>). &quot;Overall survival&quot; and &quot;Progression free survival&quot; are the holy grails of results in cancer research. The fact that they have 80% progression free survival less than halfway through this study is mind blowing. I can only imagine what sort of data they have now considering they included an image of complete resolution of a GBM tumor on their patent. But again ... how is it that this is gonna moon soon? Well because $INO just signed up to present their findings at not one but two upcoming conferences. <a href=\"https://s23.q4cdn.com/479936946/files/doc_news/INOVIO-to-Present-at-Upcoming-Investor-Conferences-in-May-2021.pdf\">https://s23.q4cdn.com/479936946/files/doc_news/INOVIO-to-Present-at-Upcoming-Investor-Conferences-in-May-2021.pdf</a>. Dates: May 12, May 18. Not just a one tiered moon shot, but a two tiered moon shot! </p>\n\n<p>Discussion</p>\n\n<p>In conclusion: their study showing the delivery of a highly effective drug, to a cancer that is otherwise a death sentence and currently has NO EFFECTIVE TREATMENTS is coming to an end and results are imminent. Two upcoming conferences to disclose their findings. I don&#39;t know what I&#39;m more excited about...a potential game changing treatment for a devastating disease that has personally touched people I love or this rocket ride to the moon. I like the stock. I like the tech. I like the implications to cancer treatment.</p>\n\n<p>Disclosures: No affiliation with any of the above companies. I bought lots calls as well as stock this morning. I have no idea what I&#39;m doing. In fact if anyone wants to tell me how to make money from this information please let me know.</p>\n</div><!-- SC_ON -->",
  "score": 1320,
  "permalink": "/r/wallstreetbets/comments/n70cim/my_first_dd_im_a_doctor_and_i_think_ino_is_about/",
  "subreddit": "wallstreetbets",
  "id": "n70cim",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985998946
}