{
  "author": "No_Entrepreneur_3382",
  "the_new_excerpt": "I am really confused. I am a woman and will be 27 this year. I identify me as\nstraight all my life, loved guys, but I only get off to lesbian porn. Many\npeople tell that it is common for straight women, cuz is about women pleasure,\nbut I think it's not my case. I have just one fantasy with woman…",
  "original_created_utc": 1617269543,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我真的很困惑。我是一个女人，今年将27岁。我认定我是\n我一生都是直的，喜欢男人，但我只对女同性恋色情片有兴趣。很多\n人们告诉，这是常见的直女，因为是关于女性的乐趣。\n但我觉得这不是我的情况。我对女人只有一个幻想... ...",
      "title": "你看女同性恋色情片吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的很困惑。我是一個女人，今年將27歲。我認定我是\n我一生都是直的，喜歡男人，但我只對女同性戀色情片有興趣。很多\n人們告訴，這是常見的直女，因爲是關於女性的樂趣。\n但我覺得這不是我的情況。我對女人只有一個幻想... ...",
      "title": "你看女同性戀色情片嗎？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私は本当に混乱しています。私は女性で、今年27歳になります。私は自分を以下のように認識しています。\n男の人が大好きでしたが、レズビアン・ポルノでしか興奮しません。多くの\n多くの人は、女性の喜びのためだから、ストレートの女性にはよくあることだと言います。\nしかし、私の場合はそうではないと思います。私は女性とのファンタジーを一つだけ持っています...",
      "title": "レズビアン・ポルノは見ますか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私は本当に混乱しています。私は女性で、今年27歳になります。私は自分を以下のように認識しています。\n男の人が大好きでしたが、レズビアン・ポルノでしか興奮しません。多くの\n多くの人は、女性の喜びのためだから、ストレートの女性にはよくあることだと言います。\nしかし、私の場合はそうではないと思います。私は女性とのファンタジーを一つだけ持っています...",
      "title": "レズビアン・ポルノは見ますか？"
    }
  ],
  "title": "Do you watch lesbian porn?",
  "created_utc": 1617287192,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am really confused. I am a woman and will be 27 this year. I identify me as straight all my life, loved guys, but I only get off to lesbian porn. Many people tell that it is common for straight women, cuz is about women pleasure, but I think it&#39;s not my case. I have just one fantasy with woman that I meet one and I don&#39;t want to have sex with her, but she forced me and I liked it. That&#39;s all. It&#39;s more taboo thing for me. I cannot imagine me romantically with woman or sexually in real life. Maybe you tell me that I should try, but I don&#39;t want. When I tell me, let&#39;s try I feel that I have to force myself to do it :-(</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/mhrn9g/do_you_watch_lesbian_porn/",
  "subreddit": "TooAfraidToAsk",
  "id": "mhrn9g",
  "is_self": true,
  "media": null,
  "is_video": false
}