{
  "author": "Chilaquil420",
  "original_created_utc": 1652136663,
  "title": "How did the world OUTSIDE of Mexico react to the mexican election of 2000?",
  "created_utc": 1652223801,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Context: Ever since the end of the mexican revolution (civil war) until the year 2000, the PRI party ALWAYS won EVERYTHING. Mexico was essentially a one-party state. Such party surprisingly lasted MORE than the Soviet Communist Party in power. Some reforms in the 90s allowed for other parties to win local elections, until the year 2000 when, for the first time in more than 70 years, the PRI party DID NOT win. And even BEFORE the civil war and PRI, the winner was always dictator Porfirio Diaz&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;According to people who were alive and have memories of such moment, it was comparable to the fall of the Berlin Wall (although waaaaay less important in the global stage)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;In mexican history it was a before and after moment.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Saying &amp;quot;no one cared&amp;quot; outside of Mexico would be a valid and expected answer tho. But I am curious as to other nations like the US reacted.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;At that time, it was more or less a rule that the current mexican president (pri) would choose the next PRI candidate, essentially the president choosing his successor. This tradition was known as &amp;quot;Dedazo&amp;quot; (big finger). PRI &amp;quot;primaries&amp;quot; were esentially a contest to gain the current presidet&amp;#39;s favour.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/2000_Mexican_general_election\"&gt;2000 Mexican general election - Wikipedia&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Institutional_Revolutionary_Party\"&gt;Institutional Revolutionary Party - Wikipedia&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/um3nk0/how_did_the_world_outside_of_mexico_react_to_the/",
  "subreddit": "AskHistorians",
  "id": "um3nk0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Context: Ever since the end of the mexican revolution (civil war) until the year\n2000, the PRI party ALWAYS won EVERYTHING. Mexico was essentially a one-party\nstate. Such party surprisingly lasted MORE than the Soviet Communist Party in\npower. Some reforms in the 90s allowed for other parties to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コンテキスト メキシコ革命（内戦）が終わってから2000年まで\n2000年まで、常にPRI党があらゆるものに勝利していました。メキシコは本質的に一党独裁の国家でした\nメキシコは本質的に一党独裁の国家でした。そのような政党は、驚くことにソビエト共産党よりも長く政権を維持した。\nこのような政党は、意外にもソビエト共産党よりも長く政権を維持しました。90年代の改革により、他の政党が...",
      "title": "2000年のメキシコの選挙で、メキシコ以外の世界はどのような反応を示したのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "背景。自从墨西哥革命（内战）结束以来，直到2000年，PRI党总是赢得一切。\n2000年，PRI党总是赢得所有的事情。墨西哥本质上是一个一党制国家。\n国家。这样的政党竟然比苏联共产党的执政时间还长。\n执政。90年代的一些改革使其他政党能够...",
      "title": "墨西哥以外的世界对2000年的墨西哥选举有什么反应？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景。自從墨西哥革命（內戰）結束以來，直到2000年，PRI黨總是贏得一切。\n2000年，PRI黨總是贏得所有的事情。墨西哥本質上是一個一黨制國家。\n國家。這樣的政黨竟然比蘇聯共產黨的執政時間還長。\n執政。90年代的一些改革使其他政黨能夠...",
      "title": "墨西哥以外的世界對2000年的墨西哥選舉有什麼反應？"
    }
  ]
}