{
  "author": "Torpedo311",
  "the_new_excerpt": "In India, while learning about the Harappan civilisation, we are taught that the\ncivilisation's downfall was caused by the invasion of the Aryans, who originated\nfrom regions near the Caspian Sea. We also learn that they brought in new\nmaterials and objects like books, horses, chariots and so in to…",
  "original_created_utc": 1614601580,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在印度，当我们学习哈拉帕文明时，我们会被教导说\n雅利安文明的衰落是由雅利安人的入侵造成的，雅利安人是人类文明的始祖\n来自里海附近地区。我们还了解到，他们带来了新的\n材料和物品，如书、马、战车等在到... ...",
      "title": "雅利安人入侵印度是真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在印度，當我們學習哈拉帕文明時，我們會被教導說\n雅利安文明的衰落是由雅利安人的入侵造成的，雅利安人是人類文明的始祖\n來自裏海附近地區。我們還了解到，他們帶來了新的\n材料和物品，如書、馬、戰車等在到... ...",
      "title": "雅利安人入侵印度是真的嗎？"
    }
  ],
  "title": "Is the Aryan invasion in India true?",
  "created_utc": 1614613161,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In India, while learning about the Harappan civilisation, we are taught that the civilisation&#39;s downfall was caused by the invasion of the Aryans, who originated from regions near the Caspian Sea. We also learn that they brought in new materials and objects like books, horses, chariots and so in to India. This is what i know about it in brief. However, in a video I watched on Youtube, it seems to be that the Aryan invasion theory is actually fake. Apparently it was introduced by Europeans and the British Empire while India was under colonial rule, for reasons I can&#39;t exactly remember. I think it was along the lines of showing that the colonies had always been uncivilised and had to have some outsider ruling them. Would any historians like to present their point on this and prove/disprove the Aryan invasion theory, and also state why it ever came to be in the first place if it actually is fake?</p>\n\n<p>In the Youtube video, they have disproved the theory by using various techniques like genetics, linguistics, etc. I can&#39;t exactly remember which video it was, since I had watched it a while back, but I have provided a link of what i think is the video I saw.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=4VEdyPxkT3k\">Aryan Invasion Theory: Prove AIT, Win 2 Cr | David Frawley, Niraj Rai, Abhijit, Aravind, Sanjay - YouTube</a> </p>\n\n<p>Feel free to correct me as I don&#39;t have much knowledge on this topic or history in general.</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/AskHistorians/comments/lv7y77/is_the_aryan_invasion_in_india_true/",
  "subreddit": "AskHistorians",
  "id": "lv7y77",
  "is_self": true,
  "media": null,
  "is_video": false
}