{
  "author": "megacurl",
  "the_new_excerpt": " * Fed policies could end up threatening the long-term health of the U.S.\n   dollar, investing magnate Stanley Druckenmiller told CNBC.\n * “I can’t find any period in history where monetary and fiscal policy were\n   this out of step with the economic circumstances, not one,” the chair and CEO\n   of…",
  "original_created_utc": 1620746022,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": " * FRBの政策は、米国のドルの長期的な健全性を脅かすことになるかもしれません。\n   投資界の大物、スタンリー・ドラッケンミラー氏がCNBCに語った。\n * 「歴史上、金融・財政政策が経済とこれほど乖離していた時代は見当たらない。\n   歴史上、金融・財政政策が経済状況とこれほどまでに乖離していた時代は、一度もありません」。\n   の会長兼CEO。",
      "title": "スタンレー・ドラッケンミラー氏、FRBはドルの世界的な基軸の地位を危うくしていると語る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": " * 美联储的政策可能最终威胁到美国的长期健康。\n   投资巨头斯坦利-德鲁肯米勒(Stanley Druckenmiller)告诉CNBC。\n * 我找不到历史上任何一个时期的货币和财政政策有如此大的偏差。\n   与经济形势如此脱节的时期，没有之一，\"这位主席兼首席执行官说。\n   的主席兼首席执行官。",
      "title": "斯坦利-德鲁肯米勒说美联储正在危及美元的全球储备地位"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " * 美聯儲的政策可能最終威脅到美國的長期健康。\n   投資巨頭斯坦利-德魯肯米勒(Stanley Druckenmiller)告訴CNBC。\n * 我找不到歷史上任何一個時期的貨幣和財政政策有如此大的偏差。\n   與經濟形勢如此脫節的時期，沒有之一，\"這位主席兼首席執行官說。\n   的主席兼首席執行官。",
      "title": "斯坦利-德魯肯米勒說美聯儲正在危及美元的全球儲備地位"
    }
  ],
  "title": "Stanley Druckenmiller says the Fed is endangering the dollar’s global reserve status",
  "created_utc": 1620751579,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li>Fed policies could end up threatening the long-term health of the U.S. dollar, investing magnate Stanley Druckenmiller told CNBC.</li>\n<li>“I can’t find any period in history where monetary and fiscal policy were this out of step with the economic circumstances, not one,” the chair and CEO of Duquesne Family Office said.</li>\n<li>Though he agreed with the early steps the Fed took during the pandemic, he said the policies have continued for too long.</li>\n</ul>\n\n<p>Federal Reserve policies aimed at keeping markets and the economy afloat during the pandemic could end up threatening the long-term health of the U.S. dollar, investing magnate Stanley Druckenmiller told CNBC on Tuesday.</p>\n\n<p>The chairman and CEO of Duquesne Family Office said the Fed’s insistence on holding interest rates down and buying trillions in bonds even though markets are thriving and the economy is booming is a long-term risk.</p>\n\n<p>“I can’t find any period in history where monetary and fiscal policy were this out of step with the economic circumstances, not one,” Druckenmiller said during a”Squawk Box” interview.</p>\n\n<p>Though he does not take issue with the Fed’s initial actions to combat the pandemic-related threats, Druckenmiller said the central bank has kept its foot on the accelerator too long.</p>\n\n<p>He asserted that the Fed has continued its policies to help underwrite the spending binge in Congress, which has allocated more than $5 trillion in stimulus and is contemplating trillions more in infrastructure-related spending.</p>\n\n<p>Over the long haul, he said, the policies and the heavy debts and deficits they support will threaten the dollar’s standing as the world’s reserve currency. That status means the dollar is accepted for transactions and as a store of wealth anywhere and is widely held by central banks around the world.</p>\n\n<p>“If they want to do all this and risk our reserve currency status, risk an asset bubble blowing up, so be it. But I think we ought to at least have a conversation about it,” Druckenmiller said.</p>\n\n<p>“If we’re going to monetize our debt and we’re going to enable more and more of this spending, that’s why I’m worried now for the first time that within 15 years we lose reserve currency status and of course all the unbelievable benefits that have accrued with it,” he added.</p>\n\n<p>To be sure, others have warned in the past that Fed excesses could threaten the dollar, but the greenback has retained its position in the world.</p>\n\n<p>One reason for that is there have been no other viable alternatives introduced.</p>\n\n<p>Druckemiller has entertained the thought that a challenge could come from the crypto world. He said in the CNBC interview that the ultimate solution could be “some kind of ledger system invented by some kids from MIT or Stanford” though he conceded that “I don’t know what it will be.”</p>\n\n<p>However, he noted that in the early days of the pandemic, other foreign governments already voiced their concerns about the dollar by selling Treasurys, the opposite of what normally would happen in a crisis when ultra-safe U.S. debt is generally seen as a haven.</p>\n\n<p>Indeed, foreign holdings of government bills, notes and bonds actually have decreased, falling by $127 billion or nearly 2% over the past year, according to Treasury Department data. Foreigners hold nearly one-third of the public portion of the $28.2 trillion U.S. debt.</p>\n\n<p>Druckenmiller said central banks have been the root of a lack of confidence in dollar stability.</p>\n\n<p>“The problem has been clearly identified. It’s [Fed Chair[ Jerome Powell and the rest of the world’s central bankers,” he said. “There’s a lack of trust.”</p>\n\n<p>Druckenmiller’s comments came a day after he and Duquesne partner Christian Broda said in an opinion piece for The Wall Street Journal that Powell “needs to recognize the likelihood of future political pressures on the Fed and stop enabling financial and market excesses.”</p>\n\n<p>Similarly, former New York Fed President William Dudley wrote in Bloomberg News that markets are underestimating how much the central bank will have to raise interest rates in the years ahead to keep up with the inflation it is trying to foster.</p>\n\n<p>The Fed itself, in its semiannual Financial Stability Report last week, said it worried about risks coming from soaring asset prices.</p>\n\n<p>Druckenmiller told CNBC he has “no doubt whatsoever that we are in a raging mania in all assets.”</p>\n\n<p><a href=\"https://www.cnbc.com/2021/05/11/stanley-druckenmiller-says-the-fed-is-endangering-the-dollars-global-reserve-status.html\">https://www.cnbc.com/2021/05/11/stanley-druckenmiller-says-the-fed-is-endangering-the-dollars-global-reserve-status.html</a></p>\n</div><!-- SC_ON -->",
  "score": 1140,
  "permalink": "/r/investing/comments/n9zazb/stanley_druckenmiller_says_the_fed_is_endangering/",
  "subreddit": "investing",
  "id": "n9zazb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994600
}