{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1634327529,
  "title": "So much for the \"dead cat bounce\" and all the things bears got wrong in the last few months.",
  "created_utc": 1634366399,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Including Michael Burry aka &quot;Cassandra&quot; telling us to short Bitcoin at $30K. That itt was gonna tank.</p>\n\n<p>Looks like it tanked the wrong way. If you had listened to &quot;Cassandra&quot;, you would have gotten liquidated.</p>\n\n<h1>So much for 2018 2.0.</h1>\n\n<p>Back in April and May, that&#39;s all we would hear. 2018 2.0.</p>\n\n<p>Ok, maybe not what everyone was saying, but at least a quarter of the posts were telling us that this is 2018 all over again. Despite most metrics, and the dynamics of the market not really supporting that theory. If anything it was pointing to that first top of 2013, heading for a double top.</p>\n\n<p>But people only look at one chart or one point of data, and jump to conclusions too quickly. They see in 2018 it went up a lot, then crashed, so they think if we go up a lot, it&#39;s the same thing.</p>\n\n<p>And they think a 50% crash can only mean bear winter.</p>\n\n<p>When crypto has crashes every few months, even during bull runs.</p>\n\n<p>The people who actually looked deeper, and at multiple points of data, would have seen that this wasn&#39;t looking enough like 2018 2.0, and was actually pointing more in the opposite direction.</p>\n\n<p>But a simple clue that there was an issue with the comparison, was simply by looking at the charts, without distorted perspective.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/x8qduc6k0ot71.jpg?width=674&amp;format=pjpg&amp;auto=webp&amp;s=a383de1929680859b91a614707eb82c13fa9b602\">https://preview.redd.it/x8qduc6k0ot71.jpg?width=674&amp;format=pjpg&amp;auto=webp&amp;s=a383de1929680859b91a614707eb82c13fa9b602</a></p>\n\n<p>If you compare things at the right scale, you see two completely different formations, than if you just zoom in too much and look at things in the wrong context.</p>\n\n<h1>So much for China mining ban killing the bull market</h1>\n\n<p>A couple month ago, the bears were going around with the narrative that China&#39;s banning of Bitcoin was gonna kill the bull market. And it was pretty convincing. After all, most of Bitcoin&#39;s mining was in China. Shutting it all down could have some serious effect.</p>\n\n<p>But instead, it had 0 effect.</p>\n\n<p>In fact the price went from $30K to $50K.</p>\n\n<h1>So much for 2008 2.0</h1>\n\n<p>And while we&#39;re on the subject of China FUD, so much for Evergrande being 2008 2.0 and taking crypto down with it.</p>\n\n<p>I&#39;m sure Evergrande is gonna be like Mt Gox FUD. For years after Mt Gox went down, every few months bears reminded us that at any point, the victims could be paid out and sell all their Bitcoins.</p>\n\n<p>We&#39;ll be reminded every month about Evergrande.</p>\n\n<p>While Evergrande could still wreck havoc in China&#39;s economy, the CCP has already showed signs that it would intervene and at least partially nationalize some of the companies. What&#39;s something that the CCP likes more than controlling and nationalizing things?</p>\n\n<p>Plus, the Evergrande fear factor is diminishing, as markets are getting desensitized from that narrative.</p>\n\n<p>Even in a worst case scenario, we already know that China tanking like it did in 2015, didn&#39;t have the same effect as 2008.</p>\n\n<h1>So much for for Wyckoff distribution being bullshit</h1>\n\n<p>If you look at enough data points, and use the correct TA, you can see what&#39;s really happening, instead of trying to say something controversial to try to sound clever.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wnhev1rjznt71.png?width=1025&amp;format=png&amp;auto=webp&amp;s=4f31d3ec27cb6caf243b09cf44afff15d5fbdf67\">https://preview.redd.it/wnhev1rjznt71.png?width=1025&amp;format=png&amp;auto=webp&amp;s=4f31d3ec27cb6caf243b09cf44afff15d5fbdf67</a></p>\n\n<p>As it turned out, the people who noticed the Wyckoff Distribution in the months prior, for the dip down in the 20Ks correct, along with the part a lot of people were skeptical about, the spring.</p>\n\n<p>It&#39;s one thing to get one prediction right. That&#39;s just 50/50. To get 2 right in a row, that&#39;s pretty lucky.</p>\n\n<p>But to also get the bounce back, and going back in a bull run, that takes a little more than guessing to get ALL predictions right that closely.</p>\n\n<p>And as I explained before, there&#39;s a reason the market is so predictable in the long run. First off, 80% of the trading is done by bot, while 85% of Bitcoin is inactive in trading.</p>\n\n<p>And how would imagine bots are programed? To run based on what the market has always done before. This creates self fulfilling prophecies. Especially in a market where a single asset dominates and become the play caller for the whole market (I&#39;m talking about Bitcoin).</p>\n\n<h1>So much for &quot;there&#39;s not enough money to raise the market cap by billions&quot;</h1>\n\n<p>While there is more institutional money, more adoption, more companies using crypto, and growing investors, this misjudgement stems from a misunderstanding of market caps.</p>\n\n<p>There&#39;s actually still a lot of people who believe that for the market cap of a coin to increase by $1 Billion, it means that people have to put in an extra $1 Billion into that coin.</p>\n\n<p>There&#39;s a misunderstanding that market caps calculate the total amount of money people have put into a coin in buying orders.</p>\n\n<p>But market cap doesn&#39;t measure buying orders. It&#39;s a stupid equation of the amount of coins in circulation multiplied by the current price.</p>\n\n<p>On a low volume, it could theoretically take a few people buying Bitcoin at $500K to raise it to $500K, if not enough people want to sell on the other side. And they don&#39;t even need to buy a full Bitcoin. In fact they could be buying fractions of Bitcoin at $500K.</p>\n\n<p>It&#39;s a possible thing, but not realistic irl. But it could only take a few hundred millions coming in to raise the cap by a few billions.</p>\n\n<h1>So much for &quot;this time it&#39;s different&quot;</h1>\n\n<p>One thing I learned in my 8 years in this market, is the second you think &quot;this time it&#39;s different&quot; is the second you&#39;re likely gonna get burned.</p>\n\n<p>People don&#39;t learn, and as we&#39;ve seen in this bull market so far, they are repeating all the same mistakes all over again. That&#39;s why market behavior isn&#39;t changing much, even with institutional money.</p>\n\n<p>But you can look at anything from Rainbow Charts, to the 4 year cycles golden ratios, we haven&#39;t broken any of the course so far. And we&#39;re still on our way to repeat history. Thanks to trading bots, Bitcoin&#39;s domination, the built in deflationary function of the 4 year halving, and the market repeating the same behavior.</p>\n\n<p>If all of that stays true, we&#39;re not heading for just $100K, we&#39;re heading past $200K.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/q8w2ca/so_much_for_the_dead_cat_bounce_and_all_the/",
  "subreddit": "CryptoCurrency",
  "id": "q8w2ca",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Including Michael Burry aka \"Cassandra\" telling us to short Bitcoin at $30K.\nThat itt was gonna tank.\n\nLooks like it tanked the wrong way. If you had listened to \"Cassandra\", you\nwould have gotten liquidated.\n\n\nSO MUCH FOR 2018 2.0.\n\nBack in April and May, that's all we would hear. 2018 2.0.\n\nOk,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "カサンドラ」ことマイケル・バリーは、3万ドルでビットコインをショートするように言っていました。\nビットコインは暴落するだろうと。\n\nそれは間違った方向に暴落したようです。もし \"カサンドラ \"の言うことを聞いていたら、あなたは\n流動化していただろう。\n\n\n2018年2.0はもう終わりだ。\n\n4月や5月には、そればかりが聞こえてきました。2018 2.0.\n\nオッケー、、、。",
      "title": "デッド・キャット・バウンス」や、過去数ヶ月の間に熊が間違えたことなどは、もうおしまいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "包括Michael Burry aka \"Cassandra \"告诉我们在3万美元时做空比特币。\n它将会下跌。\n\n看起来，它以错误的方式下跌了。如果你听了 \"卡桑德拉 \"的话，你\n你就会被清算了。\n\n\n2018年的2.0版就这样了。\n\n早在4月和5月，这就是我们所听到的。2018 2.0.\n\n好吧，...",
      "title": "这么说来，\"死猫反弹 \"和熊市在过去几个月里所做的所有事情都是错误的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "包括Michael Burry aka \"Cassandra \"告訴我們在3萬美元時做空比特幣。\n它將會下跌。\n\n看起來，它以錯誤的方式下跌了。如果你聽了 \"卡桑德拉 \"的話，你\n你就會被清算了。\n\n\n2018年的2.0版就這樣了。\n\n早在4月和5月，這就是我們所聽到的。2018 2.0.\n\n好吧，...",
      "title": "這麼說來，\"死貓反彈 \"和熊市在過去幾個月裏所做的所有事情都是錯誤的。"
    }
  ]
}