{
  "author": "Gotigers811",
  "the_new_excerpt": "Over the past week, a spammer has been sending tens of millions of tiny\ntransactions to new wallets. This has been bloating the Nano blockchain which\nhas been putting stress on the validators.\n\nThey were handling it fairly well, until today. The attacker ramped up his\nattack and averaged 60 TPS,…",
  "original_created_utc": 1615436448,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一周里，一个垃圾邮件发送者已经发送了数千万个微小的。\n交易到新的钱包。这已经使Nano区块链变得臃肿起来，它\n一直在给验证者施加压力。\n\n他们处理得还不错，直到今天。攻击者加大了他的\n攻击和平均60TPS，...",
      "title": "纳米网络在经历了多周的攻击后，速度慢到了极点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一週裏，一個垃圾郵件發送者已經發送了數千萬個微小的。\n交易到新的錢包。這已經使Nano區塊鏈變得臃腫起來，它\n一直在給驗證者施加壓力。\n\n他們處理得還不錯，直到今天。攻擊者加大了他的\n攻擊和平均60TPS，...",
      "title": "納米網絡在經歷了多周的攻擊後，速度慢到了極點。"
    }
  ],
  "title": "Nano network is slowing to a crawl after a multi-week attack.",
  "created_utc": 1615447846,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Over the past week, a spammer has been sending tens of millions of tiny transactions to new wallets. This has been bloating the Nano blockchain which has been putting stress on the validators. </p>\n\n<p>They were handling it fairly well, until today. The attacker ramped up his attack and averaged 60 TPS, with bursts up to 500 TPS. This overloaded many of the nodes and they have started desyncing. Confirmation time is over 5.5 seconds and climbing fast. Before the attack, it was around 0.2 seconds. Edit: Seems like a lot of transactions aren&#39;t going through at all.</p>\n\n<p>Its unfortunate for the network, but fascinating to watch from a data perspective. I linked some resources below.</p>\n\n<p><a href=\"https://nanoticker.info/\">https://nanoticker.info/</a>\n<a href=\"https://nanocrawler.cc/network\">https://nanocrawler.cc/network</a>\n<a href=\"https://nanolooker.com/\">https://nanolooker.com/</a></p>\n</div><!-- SC_ON -->",
  "score": 653,
  "permalink": "/r/CryptoCurrency/comments/m2hmwj/nano_network_is_slowing_to_a_crawl_after_a/",
  "subreddit": "CryptoCurrency",
  "id": "m2hmwj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542574771
}