{
  "author": "SGP_MikeF",
  "the_new_excerpt": "It’s quite clear that the GOP is presently fractured with the removal of Rep.\nLiz Cheney recently between the pro-Trump faction and the anti-Trump faction.\n\nDoes anyone have demographic breakdowns within the party or other polling data\n(eg those on social media more are more likely to support Trump…",
  "original_created_utc": 1620829493,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、GOPは下院議員が解任されたことで分裂していることがよくわかります。\n親トランプ派と反トランプ派の間で、最近、リズ・チェイニー議員が解任されたことで、GOPが分裂していることは明らかです。\n\n誰か、党内の人口統計学的内訳やその他の世論調査データを持っていませんか？\n例えば、ソーシャルメディアを利用している人はトランプを支持する可能性が高いとか...。",
      "title": "親トランプと反トランプに沿ったGOPの人口構成を示す世論調査はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很明显，随着众议员的去职，美国共和党目前已经出现了分裂。\n最近，在亲特朗普派和反特朗普派之间，利兹-切尼被免职。\n\n有没有人有党内的人口统计细分或其他民调数据？\n例如，那些在社交媒体上的人更有可能支持特朗普......",
      "title": "是否有任何民调显示，美国共和党的人口结构沿着支持和反对特朗普的路线细分？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很明顯，隨着衆議員的去職，美國共和黨目前已經出現了分裂。\n最近，在親特朗普派和反特朗普派之間，利茲-切尼被免職。\n\n有沒有人有黨內的人口統計細分或其他民調數據？\n例如，那些在社交媒體上的人更有可能支持特朗普......",
      "title": "是否有任何民調顯示，美國共和黨的人口結構沿着支持和反對特朗普的路線細分？"
    }
  ],
  "title": "Are there any polls showing the demographic breakdown of the GOP along pro- vs. anti-Trump lines?",
  "created_utc": 1620882782,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s quite clear that the GOP is presently fractured with the removal of Rep. Liz Cheney recently between the pro-Trump faction and the anti-Trump faction. </p>\n\n<p>Does anyone have demographic breakdowns within the party or other polling data (eg those on social media more are more likely to support Trump and his followers)? Again, I’m looking for something on the divide within the Republican Party, not the general populace. Are the more educated in the GOP leaning one way? Are the poor in the GOP leaning one way? And so on.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/Ask_Politics/comments/napxaw/are_there_any_polls_showing_the_demographic/",
  "subreddit": "Ask_Politics",
  "id": "napxaw",
  "is_self": true,
  "media": null,
  "is_video": false
}