{
  "author": "GreenGuppyNZ",
  "original_created_utc": 1632545377,
  "title": "China bans oxygen.",
  "created_utc": 1632598263,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>China suddenly announced today a complete ban on all storage and use of oxygen by it&#39;s citizens.</p>\n\n<p>Citizens must now visit the official breathing stations twice a day to receive their allocation of the State developed O2 already referred to colloquially as the Fiart.</p>\n\n<p>Underground cold storage of O2 is rumoured to have begun and organised rebel breathing is now being carried out in secret. Ex-pats are looking into ways to transfer O2 into the country using Twitter or peer-to-peer means.</p>\n\n<p>Hedging markets have crashed resulting in artificial hedging synthetics blooming. Gas fees have hit an all time high.</p>\n\n<p>It is rumoured that China will be banning light next if it&#39;s uncontrolled use continues to get out of hand</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/Bitcoin/comments/puzxcr/china_bans_oxygen/",
  "subreddit": "Bitcoin",
  "id": "puzxcr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "China suddenly announced today a complete ban on all storage and use of oxygen\nby it's citizens.\n\nCitizens must now visit the official breathing stations twice a day to receive\ntheir allocation of the State developed O2 already referred to colloquially as\nthe Fiart.\n\nUnderground cold storage of O2…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国は本日、市民による酸素の貯蔵と使用を全面的に禁止すると突然発表した。\n酸素の保管と使用を全面的に禁止すると発表しました。\n\n国民は1日2回、公式の呼吸器ステーションに行って\n国民は1日2回、公式の呼吸ステーションを訪れ、国家が開発したO2の割り当てを受けなければならない。\nFiart \"と呼ばれています。\n\nO2の地下低温貯蔵は...",
      "title": "中国では酸素を禁止しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中国今天突然宣布全面禁止所有氧气的储存和使用\n中国公民的氧气。\n\n公民现在必须每天两次到官方呼吸站领取\n他们分配的国家开发的氧气已经被俗称为\n已被俗称为 \"Fiart\"。\n\n氧气的地下冷库...",
      "title": "中国禁止氧气。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中國今天突然宣佈全面禁止所有氧氣的儲存和使用\n中國公民的氧氣。\n\n公民現在必須每天兩次到官方呼吸站領取\n他們分配的國家開發的氧氣已經被俗稱爲\n已被俗稱爲 \"Fiart\"。\n\n氧氣的地下冷庫...",
      "title": "中國禁止氧氣。"
    }
  ]
}