{
  "author": "Kamikaze_Cash",
  "original_created_utc": 1638347306,
  "title": "How did the Byzantines blind 15,000 people after the Battle of Kleidon?",
  "created_utc": 1638394000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The story is that the Byzantines blinded 15,000 Bulgars after the Battle of Kleidion, leaving every 100th man half-blind so he could lead the others home. How is this even possible? It makes no sense.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;How did the Byzantines logistically blind so many people? Even using hot irons to blind 500 people/hour would still take over 30 hours.&lt;/li&gt;\n&lt;li&gt;Why did the Bulgars just hang out and wait to be blinded? 15,000 soldiers is an entire field army. Even half that number is a capable fighting force. Why would they sit and wait to be blinded, rather than fight to escape? Surely they were not all captured and disarmed, and even if they were, 15,000 is a lot of people to control.&lt;/li&gt;\n&lt;li&gt;Is it more likely it is a fake story of mass blinding was meant to sow fear among the Bulgars?&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 1165,
  "permalink": "/r/AskHistorians/comments/r6a31h/how_did_the_byzantines_blind_15000_people_after/",
  "subreddit": "AskHistorians",
  "id": "r6a31h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The story is that the Byzantines blinded 15,000 Bulgars after the Battle of\nKleidion, leaving every 100th man half-blind so he could lead the others home.\nHow is this even possible? It makes no sense.\n\n 1. How did the Byzantines logistically blind so many people? Even using hot\n    irons to blind…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "の戦いの後、ビザンチンが15,000人のブルガリアを失明させたという話がある。\nクライディオンでは、100人ごとに半盲にして、他の人たちを家に導くことができたのです。\nそんなことが可能なのだろうか？意味不明である。\n\n 1. 1. ビザンツ帝国はどうやってそんなに多くの人の目をつぶしたのだろう？熱い\n    アイロンで目をつぶして...",
      "title": "クライドンの戦いの後、ビザンチンは1万5千人をどうやって目隠ししたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "故事是这样的：拜占庭人在克莱迪恩之战后弄瞎了15000名保加利亚人的眼睛。\n瞎了15000名保加利亚人的眼睛，让每100个人都是半瞎的，这样他就可以带领其他人回家。\n这怎么可能呢？这毫无道理。\n\n 1. 拜占庭人是如何在后勤上弄瞎这么多人的？甚至用热\n    熨斗来弄瞎...",
      "title": "克莱顿之战后，拜占庭人是如何弄瞎15000人的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "故事是這樣的：拜占庭人在克萊迪恩之戰後弄瞎了15000名保加利亞人的眼睛。\n瞎了15000名保加利亞人的眼睛，讓每100個人都是半瞎的，這樣他就可以帶領其他人回家。\n這怎麼可能呢？這毫無道理。\n\n 1. 拜占庭人是如何在後勤上弄瞎這麼多人的？甚至用熱\n    熨斗來弄瞎...",
      "title": "克萊頓之戰後，拜占庭人是如何弄瞎15000人的？"
    }
  ]
}