{
  "author": "only1parkjisung",
  "the_new_excerpt": "Could you imagine two weeks ago a crusade was brewing, that several million\ntraders would soon band together to fire one, big, shot, across the bow of some\nthe most powerful entities in the world. How could you have? And yet here we\nstand in the early acts of an epic, with Hollywood fighting to tell…",
  "original_created_utc": 1612317626,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你能想象两个星期前，一场十字军东征正在酝酿，几百万的人都在为自己的利益而努力\n商人们很快就会联合起来，对着一些人的船头开出一枪，大枪。\n世界上最强大的实体。你怎么会有？而我们却在这里\n站在史诗的早期行为，与好莱坞争相讲述... ...",
      "title": "华尔街赌局的联盟状态。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你能想象兩個星期前，一場十字軍東征正在醞釀，幾百萬的人都在爲自己的利益而努力\n商人們很快就會聯合起來，對着一些人的船頭開出一槍，大槍。\n世界上最強大的實體。你怎麼會有？而我們卻在這裏\n站在史詩的早期行爲，與好萊塢爭相講述... ...",
      "title": "華爾街賭局的聯盟狀態。"
    }
  ],
  "title": "WALLSTREETBETS STATE OF THE UNION",
  "created_utc": 1612335172,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Could you imagine two weeks ago a crusade was brewing, that several million traders would soon band together to fire one, big, shot, across the bow of some the most powerful entities in the world. How could you have? And yet here we stand in the early acts of an epic, with Hollywood fighting to tell a story that has barely begun.</p>\n\n<p>Community.</p>\n\n<p>Wallstreetbets has not and will never be just one individual, rather a collective of ideals and goals greater than the sum of its parts. Reddit is the soapbox that allows these diverse individuals to amplify messages that resonate with them with their votes. That does not mean this is political -- Wallstreetbets has never and will never be political.</p>\n\n<p>The financial system has always been shrouded in mystery and complexity, on purpose, to keep the golden goose beneficiaries entrenched. We’ve especially seen it in action the last few weeks, where fairness and the now apparently idealistic thoughts of a level playing field have gone out the window as traders’ control of their own investments was wrested from them. We see the users, we see the quality of the content, and we’re here to evangelize on your behalf. The struggle will be long and arduous. But we’re in it if you’re in it with us. Let’s get it done you amazing degenerates.</p>\n\n<p>With that, a couple of our moderators have shared their personal thoughts on Wallstreetbets and the world we find ourselves in at this juncture.</p>\n\n<hr/>\n\n<p>Thoughts from <a href=\"/u/zjz\">/u/zjz</a> </p>\n\n<p>For a long time retail traders have been crabs in a bucket. Working alone with slow and limited data, crappy tools, bad execution, and worse advice. We used to be stuck listening almost solely to pre-approved narratives from people who already made it and wanted us to hold the bag. We used to be a bunch of duck-sized horses.</p>\n\n<p>I don&#39;t think this is a continuation of OWS. This isn&#39;t <em>really</em> political. For our newfriends, WSB was never political. It isn&#39;t solely a battle between the rich and the poor, and it&#39;s not an attack on <em>the system</em>. It&#39;s just the next step for retail and it&#39;s obviously scary to someone. We don&#39;t need to occupy anything, this subreddit and communities like it are soon to be the 1,000lbs gorilla in the room and we&#39;re just not quite sure how to stand yet. Retail money has always loomed large, it&#39;s just never had so much information and made most of its own decisions before. It was (mis)lead by hack analysts and at best had to huddle in index funds for safety.</p>\n\n<p>When we come together on platforms like this with similar goals, similar tools, and similar data, we become a force that can, even without any centralization, coordination, or deep pockets, easily destroy well-funded opponents and cause them to have to break the rules just to stay alive. Random people that have never spoken before buying GME for reasons ranging from &quot;haha brrr&quot; to 30 page writeups can cause spikes that can nearly bankrupt the kind of people that aren&#39;t used to being the ones on the losing end. They&#39;re used to being the only ones with a big stick.</p>\n\n<p>This is only going to accelerate unless the other actors in this space rig the game in their favor even further <strong>or trick us into destroying the means by which we can sit at the table</strong>. You notice how many circuit breakers there were on the way up vs the way down? Don&#39;t accept anything that limits our access to equities, options, futures, etc. Raise hell if they try.</p>\n\n<p>In order to function we need to figure out how to cram as many monkeys on as many typewriters as possible. We need to figure out how to make sure the whole sub sees what those monkeys write, we need to filter noise from signal via millions of self-interested actors. We need to figure out how we can avoid being outmaneuvered by people who will not play fair. We&#39;ve got problems to solve and there will be growing pains, but we&#39;ve all got a chance to be part of something that hasn&#39;t existed before. Something between a fund, a social network, a union, and an API. Work with us on improving this place and getting settled into this mode of operation instead of breaking into pieces. They&#39;d love that. Apes apart weak.</p>\n\n<p>Nobody should blame you if you love the stock or sold the stock. You should be here to make money. There will be a next time and a time after that. They can only cheat so many times before it catches up with them, they only have so many brains on the task, and we&#39;re only getting bigger.</p>\n\n<hr/>\n\n<p>Thoughts from <a href=\"/u/wallstreetboyfriend\">/u/wallstreetboyfriend</a></p>\n\n<p>If you’re still reading, thank you. I’m last because I’m least important. If you only skimmed the above content, fuck you. Go back and read it.</p>\n\n<p>Please give all of our mods a shout out and remember to do your part by following our subreddit rules.  As a reminder: We’re all volunteers, and we do NOT accept donations. We appreciate the sentiment in wanting to donate to us, but it would be great if you donated to a charity in our name instead.  (Check out <a href=\"https://www.charitynavigator.org\">https://www.charitynavigator.org</a> if you want suggestions)</p>\n\n<p><strong>I’ve been here since the sub was &lt;2000 members.</strong> It really didn’t hit me on how crazy everything was getting until I checked Twitter last week.</p>\n\n<p>Regardless of our personal political views, let’s marvel at the fact that Ted Cruz, AOC, Trump Jr, Chamath, Musk, Cuban, and countless others from various backgrounds and viewpoints agree so strongly on a single topic. We’ve had everything from fractional share owners to multi-millionaires band together because they like a stock. We’ve been in the news cycles nonstop, and there’s even tendies commercials.</p>\n\n<p>Memes aside, things have been shitty for individual traders. Recent events have highlighted how skewed the game has been towards institutional traders. Whether or not there was any intentional wrongdoing, the inherent biases for a hedge fund being bailed out by another hedge fund and ALSO being a major contributor to a large portion of a brokerage’s earnings is kinda fucked up. While I’m not smart enough to say whether the game is 100% rigged, it certainly doesn’t look good. The US government breaks up monopolies for this very reason, don’t they?</p>\n\n<p>The institutional investors claim we don’t know what we’re doing.  I’m just an artist myself, but there are a ton of you here, old and new, who are well-educated and actually do proper DD. \nDespite that, hedge funds continued to freely trade while retail traders were locked out. We’re showing them we can make decisions with our own finances, but institutions don’t like that. They enact laws and force emergency actions to “protect” us when the reality is that it limits our ability to compete <strong>fairly</strong>. Can someone explain to me how Pattern Day Trading protects the retail investor? Can someone explain to me why an individual must have &gt; $1m in assets to be an accredited investor? </p>\n\n<p>There’s an opportunity in front of us -- We have a chance to make a difference and maybe level the playing field. There are government hearings on Feb 18th, and we have politicians from ALL sides offering to look into what happened. <strong>We even have billionaires like Mark Cuban and the Winklevoss Twins speaking out against this unfairness.</strong> Regardless of what happens, I’m just thankful that I got to be here from the start. Our jungle may be bigger, but it’s been the same bananas the whole time.</p>\n\n<p>So what now? We have an opportunity to change the game. We need to move away from a system with power in the hands of the few to one where power is in the hands of the many. The alternative is that we stay where we are now, where the fate of retail traders is at the whim of archaic institutions. Where they can arbitrarily halt stocks and shackle the free market.  Why can I Cashapp someone for feet pics in <em>seconds</em>, but it takes TWO WHOLE DAYS for shares to be delivered from the DTCC?  Why do they also get to choose what the deposit requirements are? Something needs to change, and I’m certain we’re not limited by the technology. We’re limited by the people.</p>\n</div><!-- SC_ON -->",
  "score": 62358,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/BLv-H6PxhUC0MTWsjUyxd-JtJvjdcsqL_07afaZw6s0.jpg?auto=webp&s=1df95b4e814a083a0a981e7689c2344083b67311",
          "width": 750,
          "height": 750
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/BLv-H6PxhUC0MTWsjUyxd-JtJvjdcsqL_07afaZw6s0.jpg?width=108&crop=smart&auto=webp&s=2fefa5079862e24ece10150bbea44039b18e5f4f",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/BLv-H6PxhUC0MTWsjUyxd-JtJvjdcsqL_07afaZw6s0.jpg?width=216&crop=smart&auto=webp&s=923b1f9cee824294bac002a19836ad83d60c04f8",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/BLv-H6PxhUC0MTWsjUyxd-JtJvjdcsqL_07afaZw6s0.jpg?width=320&crop=smart&auto=webp&s=0adb40fd95c0ef318018dddc1e18ee7deb4cc5bd",
            "width": 320,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/BLv-H6PxhUC0MTWsjUyxd-JtJvjdcsqL_07afaZw6s0.jpg?width=640&crop=smart&auto=webp&s=b2597c4f5f60c19fbddcbaa22e61f3b941ba8c57",
            "width": 640,
            "height": 640
          }
        ],
        "variants": {},
        "id": "xfm_TtcR0hTjqujkgduQ1V9P3VqPM-13tD8djLqvEgE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lbcruc/wallstreetbets_state_of_the_union/",
  "subreddit": "wallstreetbets",
  "id": "lbcruc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518565575
}