{
  "author": "DaRealJohnQuicyAdams",
  "the_new_excerpt": "Usually \"dynasty\" refers to a family of rulers or influential people, like the\nHapsburg dynasty. In Chinese history though \"dynasty\" seems to be a different\nterm, as different eras where China is ruled by different families are given\nnames called \"dynasties\" but not named after the ruling family.…",
  "original_created_utc": 1622710186,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "通常、\"dynasty \"は、ハプスブルク家のような支配者や有力者の一族を指します。\nハプスブルク家のように。しかし、中国の歴史では、「王朝」は別の用語のようです。\n中国の歴史では、「王朝」は別の用語のようで、中国が異なる家系に支配された時代ごとに\n王朝」と呼ばれていますが、支配者一族の名前は付いていません....",
      "title": "中国の王朝は、なぜ実際に支配した王朝の名前を付けないのですか？例えば、明朝は朱氏が支配していましたが、なぜ「朱朝」ではないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "通常情况下，\"王朝 \"指的是一个统治者家族或有影响力的人，如\n哈布斯堡王朝。但在中国历史上，\"朝代 \"似乎是一个不同的术语。\n在中国历史上，\"王朝 \"似乎是一个不同的术语，因为在中国被不同家族统治的不同时代，都有被称为 \"王朝 \"的名称，但没有被命名为 \"中国\"。\n名为 \"王朝\"，但不是以统治家族命名的....。",
      "title": "为什么中国的朝代不是以统治它们的实际朝代命名的？例如，明朝是由朱家统治的，为什么不叫朱家王朝？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "通常情況下，\"王朝 \"指的是一個統治者家族或有影響力的人，如\n哈布斯堡王朝。但在中國歷史上，\"朝代 \"似乎是一個不同的術語。\n在中國歷史上，\"王朝 \"似乎是一個不同的術語，因爲在中國被不同家族統治的不同時代，都有被稱爲 \"王朝 \"的名稱，但沒有被命名爲 \"中國\"。\n名爲 \"王朝\"，但不是以統治家族命名的....。",
      "title": "爲什麼中國的朝代不是以統治它們的實際朝代命名的？例如，明朝是由朱家統治的，爲什麼不叫朱家王朝？"
    }
  ],
  "title": "Why are Chinese dynasties not named after the actual dynasties that ruled them? For example, the Ming dynasty was ruled by the Zhu family, why is it not the Zhu dynasty?",
  "created_utc": 1622735859,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Usually &quot;dynasty&quot; refers to a family of rulers or influential people, like the Hapsburg dynasty. In Chinese history though &quot;dynasty&quot; seems to be a different term, as different eras where China is ruled by different families are given names called &quot;dynasties&quot; but not named after the ruling family. Why is this?</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/AskHistorians/comments/nr8qo8/why_are_chinese_dynasties_not_named_after_the/",
  "subreddit": "AskHistorians",
  "id": "nr8qo8",
  "is_self": true,
  "media": null,
  "is_video": false
}