{
  "author": "Mattelambo",
  "original_created_utc": 1635278617,
  "title": "If Manchester United bought £80 million of BTC in 2019 instead of Maguire, they would have £868.5 million right now. They chose the wrong investment :D",
  "created_utc": 1635291239,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>Obviously this is more towards the football fans, I mean the proper football ofcourse not hand egg. Sorry Americans :D</p>\n\n<p>But actually imagine the amount of crazy amount of money put into football just to by slabheads.. instead they could have been in invested into crypto haha!</p>\n\n<p>Anyway, I am not a blue fan or anything. I am just posting this here also to see if in our wonderful cryptocurrency community there are also some good football lovers as well! I am sure there are but I don&#39;t know how many!</p>\n\n<p>Also I really apologize if you are not a football fan or any sports fan and you wasted some of your valuable time reading this- but anyway I wish you alot of success in your investments!</p>\n</div><!-- SC_ON -->",
  "score": 283,
  "permalink": "/r/CryptoCurrency/comments/qgew3x/if_manchester_united_bought_80_million_of_btc_in/",
  "subreddit": "CryptoCurrency",
  "id": "qgew3x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Obviously this is more towards the football fans, I mean the proper football\nofcourse not hand egg. Sorry Americans :D\n\nBut actually imagine the amount of crazy amount of money put into football just\nto by slabheads.. instead they could have been in invested into crypto haha!\n\nAnyway, I am not a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは明らかにサッカーファンのためのもので、私が言いたいのは適切なサッカーのことです。\nもちろん、ハンドエッグではありません。アメリカ人には申し訳ありませんが :D\n\nしかし、実際には、サッカーに投入される異常なほどの金額を想像してみてください。\n代わりに暗号に投資することができたかもしれませんね。\n\nいずれにせよ、私は...",
      "title": "もしマンチェスター・ユナイテッドがマグワイアの代わりに2019年に8000万ポンドのBTCを購入していたら、今頃は8億6850万ポンドになっています。彼らは間違った投資を選んだのです :D"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，这更多的是针对足球迷，我是指适当的足球。\n当然不是手蛋。对不起，美国人 :D\n\n但实际上，想象一下，有多少疯狂的资金投入到足球运动中去，而不是被那些蠢货所利用。\n相反，他们可以投资于加密货币，哈哈!\n\n无论如何，我不是一个...",
      "title": "如果曼联在2019年买了8000万英镑的BTC而不是马奎尔，他们现在就有8.685亿英镑。他们选择了错误的投资 :D"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，這更多的是針對足球迷，我是指適當的足球。\n當然不是手蛋。對不起，美國人 :D\n\n但實際上，想象一下，有多少瘋狂的資金投入到足球運動中去，而不是被那些蠢貨所利用。\n相反，他們可以投資於加密貨幣，哈哈!\n\n無論如何，我不是一個...",
      "title": "如果曼聯在2019年買了8000萬英鎊的BTC而不是馬奎爾，他們現在就有8.685億英鎊。他們選擇了錯誤的投資 :D"
    }
  ]
}