{
  "author": "[deleted]",
  "the_new_excerpt": "See the video here\n[https://twitter.com/UNWatch/status/1352034266679533568?s=19].\n\n * Are they trying to make Australians become pro-North Korea by creating the\n   image that North Korea cares about them?\n\n * Are they trying to encourage disadvantaged groups in Australia to engage in\n   rebellion to…",
  "original_created_utc": 1611232507,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "请看这里的视频\n[https://twitter.com/UNWatch/status/1352034266679533568?s=19].\n\n * 他们是否想通过制造 \"北约 \"来使澳大利亚人亲近北朝鲜？\n   北朝鲜关心他们的形象？\n\n * 他们是否试图鼓励澳大利亚的弱势群体参与到他们的生活中来？\n   叛逆至...",
      "title": "北朝鲜声称 \"关注澳大利亚的人权 \"是想达到什么目的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請看這裏的視頻\n[https://twitter.com/UNWatch/status/1352034266679533568?s=19].\n\n * 他們是否想通過製造 \"北約 \"來使澳大利亞人親近北朝鮮？\n   北朝鮮關心他們的形象？\n\n * 他們是否試圖鼓勵澳大利亞的弱勢羣體參與到他們的生活中來？\n   叛逆至...",
      "title": "北朝鮮聲稱 \"關注澳大利亞的人權 \"是想達到什麼目的？"
    }
  ],
  "title": "What is North Korea trying to achieve by claiming to be \"concerned about human rights in Australia\"?",
  "created_utc": 1611317021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://twitter.com/UNWatch/status/1352034266679533568?s=19\">See the video here</a>.</p>\n\n<ul>\n<li><p>Are they trying to make Australians become pro-North Korea by creating the image that North Korea cares about them?</p></li>\n<li><p>Are they trying to encourage disadvantaged groups in Australia to engage in rebellion to destabilize the state?</p></li>\n<li><p>Are they trying to justify a military action or at least sanctions against Australia?</p></li>\n<li><p>Are they trying to leverage their own negative reputation to make other nations turn against Australia? (i.e. make other nations think &quot;if North Korea lambasts Australia, that means that Australia must be outlandishly despicable&quot;)</p></li>\n</ul>\n\n<p>The most obvious answer would be &quot;to deflect from their own human rights issues&quot;. But considering that they are making this comment at a regular audit of the human rights situation in all UN member nations, it&#39;s not like North Korea (or any other UN member nation) can avoid being audited too.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/Ask_Politics/comments/l1xm5b/what_is_north_korea_trying_to_achieve_by_claiming/",
  "subreddit": "Ask_Politics",
  "id": "l1xm5b",
  "is_self": true,
  "media": null,
  "is_video": false
}