{
  "author": "RaisedbywolvesLP",
  "the_new_excerpt": "Hey fellow traders. Today, l’ll present to you a very strong bull case on AMC\nthat is not explained by simply putting a rocket emoji (I love this emoji by the\nway) or because someone else posted a strong YOLO bet on the stock. Here is my\nanalysis based on volume, price action, and a powerful pattern…",
  "original_created_utc": 1622307302,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Hey fellow traders. 今日は、AMCの非常に強いブルケースをご紹介します。\nは、単にロケットの絵文字（私はこの絵文字が大好きです）を入れたり、誰かがこの株に強いYOLOベットをしたからというだけでは説明できません。\nの絵文字が大好きです）や、誰かがこの株に強いYOLOの賭けをしたからといって説明できない、AMCの非常に強いブルケースを紹介します。以下は私の\n出来高、プライスアクション、そして強力なパターンに基づいた私の分析は...。",
      "title": "AMCボリュームプライス分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，交易员朋友们。今天，我将向你介绍一个关于AMC的非常强大的牛市案例。\n这不是简单地放一个火箭表情符号（顺便说一句，我喜欢这个表情符号）就能解释的。\n顺便说一下，我喜欢这个表情符号），或者因为其他人在该股上发布了一个强有力的YOLO赌注。以下是我的\n基于成交量、价格走势和强大的模式的分析...",
      "title": "AMC成交量价格分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，交易員朋友們。今天，我將向你介紹一個關於AMC的非常強大的牛市案例。\n這不是簡單地放一個火箭表情符號（順便說一句，我喜歡這個表情符號）就能解釋的。\n順便說一下，我喜歡這個表情符號），或者因爲其他人在該股上發佈了一個強有力的YOLO賭注。以下是我的\n基於成交量、價格走勢和強大的模式的分析...",
      "title": "AMC成交量價格分析"
    }
  ],
  "title": "AMC Volume Price Analysis",
  "created_utc": 1622342686,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey fellow traders. Today, l’ll present to you a very strong bull case on AMC that is not explained by simply putting a rocket emoji (I love this emoji by the way) or because someone else posted a strong YOLO bet on the stock. Here is my analysis based on volume, price action, and a powerful pattern named the flag, high and tight.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/5bruexp383271.png?width=570&amp;format=png&amp;auto=webp&amp;s=f679d9584a983071eaf036df2e4c5be14069eaae\">Weekly chart</a></p>\n\n<p>Firstly on the weekly chart, we see a high tight flag that started developing from the low on January 5th at $1.91 (#1) to the high of the pattern which was achieved on January 27th at a staggering price of $20.36 (#2). In 17 trading days, the stock soared 1065.96%. It’s an understatement that this price action caught my attention. The following months saw the stock consolidate in a flag, high and tight on falling volume. Bulkowski studied this pattern extensively and it’s one of his favorites. HTF is characterised by a rise of at least 90% (aim for double) in less than 2 months followed by a consolidation period on ideally falling volume. I think we easily meet these criteria! The performance rank of this pattern in his work is 1 on 23 in a bull market (1 being the best) with an average rise of 69% and throwbacks happening 54% of the time. Price meets target 90% of the time. The measure rule helps us acquire a potential price target for this trade. In his work, Bulkowski tells us to measure the rise and project it 50% past the breakout point. With the measure rule, using the breakout point at $12, we would have a theoretical price target of $63.96 (1065.96/100/2*12)). Now to the analysis based on volume and price.</p>\n\n<p>On the weekly chart, we have the breakout on #3 with rising and above average volume. This confirms the breakout is not fake, but supported by the professionals. After the minor pullback, we see the momentum exploding and the price action ripping past $20 on very high volume. Like we will see on the daily chart, the last trading day of the week saw some heavy selling which can be seen with the long upper wick on the weekly chart. </p>\n\n<p>I attribute this to two things. First, the stock rose to overbought levels and a pullback was imminent. Two, the stock hit the ATH of around $35 and many market participants saw this as a good point to take profits.  While it is true the SI rose in this period, I do not believe shorts created this long upper wick. Seems more likely professionals were taking money off the table. This being said, I do not think we are witnessing a trend end since strong momentums like this one cannot be broken in a single day. Like a big cargo ship, it cannot be stopped simply by turning off the engine. More effort will be necessary to break this rocket for sure. On top of that, the most conservative assessment would bring us to $63.96 in less than 30 days (around June 10th) following the breakout and we have a 90% chance of hitting this target according to Bulkowski. If these are not good odds, I don’t know what is. I truly believe this is an opportunity of a lifetime!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/wslu122983271.png?width=570&amp;format=png&amp;auto=webp&amp;s=0a1d2f718d41538d8bfad7ffad44ade99c796356\">Daily chart</a></p>\n\n<p>On the daily chart, we can see the flag, high and tight develop from January 27th on #2 to the breakout at #3 on May 13th. Developing this cause is important according to Wyckoff’s law of cause and effect. The development of a cause will be proportional to the subsequent effect. On May 14th (breakout day (#4)), we see rising and above average volume that confirms the start of a new trend. Then, the test of supply on the pullback at #5, we see falling volume until the stock reaches $12 which means there is no interest in selling at these prices. The rally resumes on very nice long white candles on steadily rising volume which means volume and price are in harmony fully supported by the great professionals. </p>\n\n<p>On the second to last candle, we see some selling happening as shown with the upper wick. On #6, we see a tall black candle that closes very close to the prior day’s close. I associate this candle with the bearish meeting lines candle. Bulkowski’s work establishes the candle to be a continuation pattern 51% of the time in a bull market, which is pretty much as valid as a coin toss. If the next day’s close is below this candle, Bulkowski tells us there is a 70% chance the candle acts as a reversal. So this is to be looked at closely for next week. The long upper wick and shorter lower wick associated with very high volume tells me there was more selling happening Friday by the professionals. </p>\n\n<p>We must remember that stocks do not trend in a straight line. Volatility is cyclical, and all this is normal price action. Even in the event that Friday’s price action is stopping volume by the great professionals and the beginning of a distribution phase, Wyckoff’s work tells us this is associated with a potential preliminary supply and this stopping action ALWAYS fails and thus the rally WILL continue. Ladies and gents, I cannot stress enough how AMC is trading currently at a discount and any entry point is a good one at this point in time. We do not choose our seats on a rocket ship! You get in, strap on, and enjoy the ride! Trying to perfectly time the bottom on any pullback is a fool’s errand! Looking back at the daily chart on AMC, #1 (hanging man) and #3 (dark cloud cover) shows us that any bearish candle in the recent history of this stock is likely to be very short lived. Shorting this stock based on the bearish meeting lines (weak bearish candle by the way) would be a very dangerous endeavour indeed.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/erdc846b83271.png?width=570&amp;format=png&amp;auto=webp&amp;s=5ec91557abfecf685c4af681eaf68f0da6a1fd9b\">30 minutes chart</a></p>\n\n<p>Lastly, on the 30 minutes chart, friday we see at #1 strong buying pressure as seen with the long lower wick and high volume at $25.50. #2 was a retest on falling volume meaning falling interest to sell at this price. I do believe we have strong support at this level.</p>\n\n<p>No one has a crystal ball and this could go either way, but the odds are that we reach $63.96 by the end of June with a 90% probability according to Bulkowski. I am adding to my position at any dip in this stock. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/qbs706tc83271.png?width=570&amp;format=png&amp;auto=webp&amp;s=8669186d98ef0792b216b50992969cd1d08fe785\">https://preview.redd.it/qbs706tc83271.png?width=570&amp;format=png&amp;auto=webp&amp;s=8669186d98ef0792b216b50992969cd1d08fe785</a></p>\n\n<p>If history is of any guide, I expect AMC to have a short consolidation period with falling volume like we saw with GME before the great run up. Thus, I believe we have another week to add to our positions before this really takes off. Any close above 35$ will be extremely bullish</p>\n\n<p>I’ve been reading many posts explaining the short squeeze potential and this adds to the excitement of a strong bull run in this stock way past $63.96. AMC is currently the most shorted stock in the market as we speak. Though I have doubts that AMC will reach 500k like many claim, I do believe we have a strong squeeze potential in this stock as shown by the candles and volume recently printed on the charts. Ultimately, volume and price will tell us when it is time to close our positions.</p>\n\n<p>Cheers,</p>\n\n<p>20$ 07/16C AMC</p>\n\n<p>30$ 07/16C AMC</p>\n\n<p>Edit: Just to be clear, Bulkowski’s HTF gives us a 90% chance to hit the target in the next 30 days after the breakout. This target is his CONSERVATIVE target not MY target. I do NOT plan to sell at this target. I have no price target at this time since it could squeeze to 10k for all I know. More price action is needed to accurately assess a higher target.</p>\n</div><!-- SC_ON -->",
  "score": 1930,
  "permalink": "/r/wallstreetbets/comments/nnriwg/amc_volume_price_analysis/",
  "subreddit": "wallstreetbets",
  "id": "nnriwg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804301827
}