{
  "author": "catfoodtime",
  "original_created_utc": 1638373191,
  "title": "Do people respond to acronyms with the same part of their brain as their actual phrases?",
  "created_utc": 1638399596,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;ALSO: Provided they understand both the phrase and the acronym, will a person respond to an acronym of a phrase and the actual phrase in the same way?  &lt;/p&gt;\n\n&lt;p&gt;I was texting my friend about how it&amp;#39;s weird that people find it easier to talk about the treatment of POWs over the treatment of prisoners of war. He responded a bit later that he had &amp;quot;fallen for it&amp;quot; and didn&amp;#39;t really have a visceral response when he read &amp;quot;POWs&amp;quot; but did when he read &amp;quot;prisoners of war&amp;quot; in my text, even though afaik he knows what POW stands for.   &lt;/p&gt;\n\n&lt;p&gt;I keep trying to find studies on how acronyms affect our thinking in situations like this but I mostly just find the list of abbreviations used in neuroscience with the way I&amp;#39;m searching :P can anyone help me out here? &lt;/p&gt;\n\n&lt;p&gt;The first question is more neuroscience but the second is more psychology so sorry if there&amp;#39;s a way to add two flairs and I didn&amp;#39;t realize it lol&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/askscience/comments/r6hkxd/do_people_respond_to_acronyms_with_the_same_part/",
  "subreddit": "askscience",
  "id": "r6hkxd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "ALSO: Provided they understand both the phrase and the acronym, will a person\nrespond to an acronym of a phrase and the actual phrase in the same way?\n\nI was texting my friend about how it's weird that people find it easier to talk\nabout the treatment of POWs over the treatment of prisoners of war.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ALSO フレーズと頭字語の両方を理解している場合、人はそのフレーズと頭字語の両方を理解できるのでしょうか？\nフレーズの頭文字と実際のフレーズに、同じように反応するのでしょうか？\n\n私は友人に、人々がより簡単に話すことを見つけるのは奇妙であるとメールしていました。\n捕虜の扱いより捕虜の扱いについて...。",
      "title": "人は頭字語に対して、実際のフレーズと同じ脳の部分で反応するのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "此外，还有。只要他们理解这个短语和缩写，一个人是否会\n对一个短语的缩写和实际的短语有相同的反应吗？\n\n我正在给我的朋友发短信，说人们发现谈论战俘的待遇比谈论战俘的待遇更容易，这很奇怪。\n关于战俘的待遇，而不是战俘的待遇....。",
      "title": "人们对缩略语的反应与他们实际的短语是同一部位的大脑吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "此外，還有。只要他們理解這個短語和縮寫，一個人是否會\n對一個短語的縮寫和實際的短語有相同的反應嗎？\n\n我正在給我的朋友發短信，說人們發現談論戰俘的待遇比談論戰俘的待遇更容易，這很奇怪。\n關於戰俘的待遇，而不是戰俘的待遇....。",
      "title": "人們對縮略語的反應與他們實際的短語是同一部位的大腦嗎？"
    }
  ]
}