{
  "author": "giddyup281",
  "original_created_utc": 1632820583,
  "title": "Would you return $22mil in ETH, if it were sent to you by mistake?",
  "created_utc": 1632836503,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, as you know, recently Bitfinex spent 7,626ETH to send 100k USDT to Diversifi. I know, I know, jokes are there, gas fees are high, I have probably spent more than that paying gas fees for buying meme coins on Uniswap etc.</p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;ll try to keep my personal feelings on Bitfinex (and the fact they are a part of the biggest reason of BTC volatility due to futures market manipulation) to myself.  But the miner returned it. Well, they kept 50 ETH, but let&#39;s pretend they returned everything, and do an experiment here.</p>\n\n<p>Would you personally return it or not?</p>\n\n<p>&#x200B;</p>\n\n<p>Reasons for return: we should be better than this. It is morally right. $20mil makes you a target (that&#39;s easily identifiable on the blockchain or if you ever communicated with an address on an exchange that does KYC).</p>\n\n<p>Reasons for not returning: if I misspell the address or don&#39;t check the gas fee cost, it&#39;s on me and I should bite the bullet. Why should this not be the case for Bitfinex? Oh, and yeah, $20mil changes life for me and 3 generations behind me.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: thank you for the award(s), please save it for someone that actually has a good, educational post. </p>\n</div><!-- SC_ON -->",
  "score": 223,
  "permalink": "/r/CryptoCurrency/comments/px2glo/would_you_return_22mil_in_eth_if_it_were_sent_to/",
  "subreddit": "CryptoCurrency",
  "id": "px2glo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, as you know, recently Bitfinex spent 7,626ETH to send 100k USDT to\nDiversifi. I know, I know, jokes are there, gas fees are high, I have probably\nspent more than that paying gas fees for buying meme coins on Uniswap etc.\n\n\n\nI'll try to keep my personal feelings on Bitfinex (and the fact they are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ご存知のように、最近、Bitfinexは100k USDTを送るために7,626ETHを費やしました。\nDiversifiです。分かっている、分かっている、ジョークはある、ガス料金は高い、私はおそらく\nUniswapなどでミームコインを買うために、おそらくそれ以上のガソリン代を使っています。\n\n\n\n私はBitfinexに対する個人的な感情を抑えようと思います（そして、彼らが...",
      "title": "22milのETHが間違って送られてきたら、それを返しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，如你所知，最近Bitfinex花了7,626ETH发送100k USDT给\nDiversifi。我知道，我知道，笑话是存在的，汽油费很高，我可能已经\n我在Uniswap上购买纪念币所花的油费可能比这还多。\n\n\n\n我将尽量保持我对Bitfinex的个人感受（以及他们是...",
      "title": "如果错发给你，你会退回22000万美元的ETH吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，如你所知，最近Bitfinex花了7,626ETH發送100k USDT給\nDiversifi。我知道，我知道，笑話是存在的，汽油費很高，我可能已經\n我在Uniswap上購買紀念幣所花的油費可能比這還多。\n\n\n\n我將盡量保持我對Bitfinex的個人感受（以及他們是...",
      "title": "如果錯發給你，你會退回22000萬美元的ETH嗎？"
    }
  ]
}