{
  "author": "SgtBooo",
  "the_new_excerpt": "PSA: for those who didn’t know, you have to pay taxes on your profits. If you\ndon’t hold the stock for more than 12 months (capital gains law) then you will\npay taxes at your prevailing tax bracket come tax time. Otherwise you only pay\n15% on profits.\n\nSo for all of you out there who made a shit ton…",
  "original_created_utc": 1613172263,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "PSA：对于那些不知道的人来说，你的利润是要交税的。如果你\n不持有股票超过12个月（资本收益法），那么你将\n在纳税时按现行税率缴税。否则您只需支付\n15%的利润。\n\n所以，对于所有的你在那里谁做了狗屎吨... ...",
      "title": "我们来谈谈税收吧! 我不希望一个WSB成员的同伴惹上山姆大叔的麻烦!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "PSA：對於那些不知道的人來說，你的利潤是要交稅的。如果你\n不持有股票超過12個月（資本收益法），那麼你將\n在納稅時按現行稅率繳稅。否則您只需支付\n15%的利潤。\n\n所以，對於所有的你在那裏誰做了狗屎噸... ...",
      "title": "我們來談談稅收吧! 我不希望一個WSB成員的同伴惹上山姆大叔的麻煩!"
    }
  ],
  "title": "Let’s talk taxes! I would hate for a fellow WSB member to get in trouble with Uncle Sam!",
  "created_utc": 1613234604,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>PSA: for those who didn’t know, you have to pay taxes on your profits. If you don’t hold the stock for more than 12 months (capital gains law) then you will pay taxes at your prevailing tax bracket come tax time. Otherwise you only pay 15% on profits. </p>\n\n<p>So for all of you out there who made a shit ton on $GME and other meme stocks prepare to pay huge taxes on those. Especially if you have a Normal day job salary as well. I would hate to see a fellow WSB go to jail for not paying taxes. Don’t go spending that money quite yet because once tax season rolls around next may 2022 you might owe the government $50,000+ in taxes for that 6 figure profit you made off GameStop for example. Just hoping this doesn’t get deleted by the mods and can educate others. </p>\n\n<p>To get around this invest in companies that you want to hold for 12 months or more. Then you only pay 15% on taxes instead of potentially 60% (for top earners). Same goes for houses and any appreciating asset.</p>\n</div><!-- SC_ON -->",
  "score": 1867,
  "permalink": "/r/wallstreetbets/comments/linn1y/lets_talk_taxes_i_would_hate_for_a_fellow_wsb/",
  "subreddit": "wallstreetbets",
  "id": "linn1y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728629805
}