{
  "author": "CMScientist",
  "the_new_excerpt": "Sure SI is high, possible gamma/short squeeze, etc etc. That's all documented in\nother posts. I want to talk about some other information on this stock. If the\nsqueeze doesn't work out then it's good to hold an undervalued (at current\nprices) stock right?\n\nValuation:\n\nEarning is negative as they are…",
  "original_created_utc": 1623179743,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かにSIは高い、ガンマやショートスクイーズの可能性がある、などなど。それはすべて他の投稿に書かれています。\n他の記事に書かれています。この銘柄の他の情報について話したいと思います。もし\nスクイーズがうまくいかなければ、（現在の価格で）割安な株を保有するのは良いことですよね？\n株を持つことは良いことだと思うよ。\n\n評価。\n\n稼ぎがマイナスなのは、彼らが...",
      "title": "WISHはショートスクイーズよりも"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当然SI很高，可能有伽马/空头挤压，等等等等。这些都记录在\n其他帖子中都有记载。我想谈谈关于这只股票的一些其他信息。如果\n如果挤压不成功，那么持有一只被低估的（以目前的价格）股票是很好的，对吗？\n价格）的股票，对吗？\n\n估值。\n\n盈利是负面的，因为他们是...",
      "title": "愿望 \"不仅仅是一个空头的挤压"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當然SI很高，可能有伽馬/空頭擠壓，等等等等。這些都記錄在\n其他帖子中都有記載。我想談談關於這隻股票的一些其他信息。如果\n如果擠壓不成功，那麼持有一隻被低估的（以目前的價格）股票是很好的，對嗎？\n價格）的股票，對嗎？\n\n估值。\n\n盈利是負面的，因爲他們是...",
      "title": "願望 \"不僅僅是一個空頭的擠壓"
    }
  ],
  "title": "WISH is more than a short squeeze",
  "created_utc": 1623215313,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sure SI is high, possible gamma/short squeeze, etc etc. That&#39;s all documented in other posts. I want to talk about some other information on this stock. If the squeeze doesn&#39;t work out then it&#39;s good to hold an undervalued (at current prices) stock right?</p>\n\n<p><strong>Valuation:</strong></p>\n\n<p>Earning is negative as they are still heavily spending and growing</p>\n\n<p>P/S of 1.67 (as of 6/7 closing) is industry low, suggesting that they are undervalued (compared to AMZN 3.82, BABA 5.2, PDD 13.8, EBAY 3.92, ETSY 10.54, W 2.27)</p>\n\n<p><strong>numbers from the latest</strong> <a href=\"https://sec.report/Document/0001157523-21-000651/\">8-k</a> <strong>and</strong> <a href=\"https://sec.report/Document/0001564590-21-027024/\">10-q</a><strong>:</strong></p>\n\n<p>Revenue $772m, up 70% Q/Q. Wish is spending heavily on sales and marketing, $470m last quarter (61% of revenue). They have been consistently spending ~60% to 70% of revenue on sales and marketing, and they anticipate reducing this to 40-45%, at which point they will likely be profitable. Comparing to ETSY for example, ETSY is only spending $151m out of $551m revenue (27%) last quarter. Of course ETSY is in the black - they are just not spending as much to grow. Meanwhile ETSY has a $21.6B valuation on $2B sales compared to WISH&#39;s $5B valuation on $2.87B sales.</p>\n\n<p>One of the concerns cited by analysts is the drop in monthly active users (MAUs) from 109m to 101m Q/Q. The explanation given by WISH is that they decided to de-emphasize in emerging markets due to logistic issues during the pandemic. But I anticipate that they will ramp back up. For example <a href=\"https://www.businessinsider.co.za/global-online-store-wish-has-struck-a-deal-with-the-sa-post-office-to-deliver-products-faster-2021-4\">WISH recently partner with the south african postal services</a>, indicating that they are going back to growth in emerging markets.</p>\n\n<p><strong>Balance book:</strong></p>\n\n<p>WISH has $1.6B cash. ~$2B total assets, ~$1.1B total liabilities, giving $930m equity.  For a growth company these numbers are excellent. Again comparing to ETSY, $1.16B cash, $2.5B total assets, $1.8B total liabilities, $684m equity. </p>\n\n<p><strong>Insider selling:</strong></p>\n\n<p>Another concern that a lot of people have is the amount of insider selling. First of all, it&#39;s normal for insiders to cash out for a new IPO company like this. This is certainly done with scheduled sales - they wouldn&#39;t want to sell at like 30% of IPO prices either but they couldn&#39;t change the scheduled sales. This on top of short seller has driven the prices to &lt;50% of IPO prices, &lt;30% of ATH. I think the insiders would certainly be reconsidering their next selling schedules, and we may see less selling pressure.</p>\n\n<p><strong>Technicals:</strong></p>\n\n<p>Again, the stock is near all time low, and at &lt;50% of IPO prices, &lt;30% of ATH. The spike today poked out of a descending wedge and a breakout looks very promising.</p>\n\n<p><strong>Conclusions:</strong></p>\n\n<p>From a pure price point of view, it&#39;s an excellent entry point into WISH, even after today&#39;s spike. I think this is a low risk, high reward play at it&#39;s current price. In the bull case, WISH gets a valuation similar to ETSY, and that would make WISH have a market cap of $25B for a share price of $40. For the bear case, I don&#39;t see how WISH can drop much more. Let&#39;s say it goes to $5, that would make it have a market cap of $3B with a P/S of ~1, and that would be absurd.</p>\n</div><!-- SC_ON -->",
  "score": 1194,
  "permalink": "/r/wallstreetbets/comments/nvbws4/wish_is_more_than_a_short_squeeze/",
  "subreddit": "wallstreetbets",
  "id": "nvbws4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404895326
}