{
  "author": "LisHere321",
  "original_created_utc": 1638220438,
  "title": "Would you play a NFT/crypto pokemon game?",
  "created_utc": 1638247024,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pokemon Go&#39;s developer <em>Niantic</em> wants to join the metaverse, they made a new game where the players can earn BTC.</p>\n\n<p>This sounds pretty bullish for crypto, because finally a AAA game developers does things around crypto. And it seems like a test if these kind of games works, maybe they will release a bigger game in the future with other crypto...maybe they partner with a certain coin project (which would be super bullish for that particular coin)</p>\n\n<p>And another question:</p>\n\n<p>Would you play a crypto game that is actually fun and not primarily &quot;play to earn&quot;? Would this be the breakthrough for mass adoption?</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/CryptoCurrency/comments/r55ubf/would_you_play_a_nftcrypto_pokemon_game/",
  "subreddit": "CryptoCurrency",
  "id": "r55ubf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Pokemon Go's developer Niantic wants to join the metaverse, they made a new game\nwhere the players can earn BTC.\n\nThis sounds pretty bullish for crypto, because finally a AAA game developers\ndoes things around crypto. And it seems like a test if these kind of games\nworks, maybe they will release a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポケモンGOの開発元であるNianticは、メタバースへの参加を目指し、プレイヤーがBTCを獲得できる新しいゲームを作りました。\nプレイヤーがBTCを稼ぐことができる新しいゲームを作りました。\n\nこれは、暗号にとってかなり強気な話です。なぜなら、ついにAAAゲーム開発者が暗号に関わることを\nようやくAAAゲーム開発者が暗号に関わることをするようになったからです。そして、この種のゲームがうまくいくかどうかのテストのようです。\nこの種のゲームがうまくいくかどうかのテストのようで、もしかしたら、彼らは...",
      "title": "NFT/暗号化ポケモンゲームをプレイしますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Pokemon Go的开发商Niantic希望加入元气大伤的行列，他们制作了一款新游戏\n玩家可以在其中赚取BTC。\n\n这听起来对加密货币很有利，因为终于有一个AAA级游戏开发商\n围绕加密货币做事情。而且这似乎是一个测试，如果这些游戏\n运作，也许他们会发布一个...",
      "title": "你会玩NFT/Crypto pokemon游戏吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Pokemon Go的開發商Niantic希望加入元氣大傷的行列，他們製作了一款新遊戲\n玩家可以在其中賺取BTC。\n\n這聽起來對加密貨幣很有利，因爲終於有一個AAA級遊戲開發商\n圍繞加密貨幣做事情。而且這似乎是一個測試，如果這些遊戲\n運作，也許他們會發佈一個...",
      "title": "你會玩NFT/Crypto pokemon遊戲嗎？"
    }
  ]
}