{
  "author": "wonebo8204",
  "original_created_utc": 1634779485,
  "title": "I am a long term holder. I’ve held through 3 halvings. What should I do next?",
  "created_utc": 1634805496,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m a fairly plain person. I’ve got everything I’ve ever wanted. I don’t need a car or home. I’ve got all those. My own business has been fairly successful so I’m setup on that end. </p>\n\n<p>I’ve held through 3 halvings. There is nothing I need or want to buy. </p>\n\n<p>I contribute to charity. I sponsor disabled children in poverty stricken areas. I’ve planted 280 native trees in the last 2 years. I donate to mental health.</p>\n\n<p>I’m young and single. I’m not interested in partying or being a show off. What should I do next? (For the greater good)</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/qcg67t/i_am_a_long_term_holder_ive_held_through_3/",
  "subreddit": "CryptoCurrency",
  "id": "qcg67t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a fairly plain person. I’ve got everything I’ve ever wanted. I don’t need a\ncar or home. I’ve got all those. My own business has been fairly successful so\nI’m setup on that end.\n\nI’ve held through 3 halvings. There is nothing I need or want to buy.\n\nI contribute to charity. I sponsor disabled…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はかなり地味な人間です。欲しいものは何でも持っています。車も家も必要ありません。\n車も家もいらない。それらはすべて手に入れている。自分のビジネスはかなり成功しているので\nその点では申し分ない。\n\n私は3回のハーフウェービングを経験しました。必要なもの、買いたいものはありません。\n\n私は慈善事業に貢献しています。障がい者のスポンサーをしています...",
      "title": "私は長期的に保有しています。これまで3回のハーフタイムで保有してきました。次は何をすればいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个相当朴素的人。我已经得到了我所想要的一切。我不需要\n汽车或住房。我已经有了所有这些。我自己的生意已经相当成功，所以\n我在那方面很有优势。\n\n我已经坚持了三个半年度。我没有什么需要或想买的东西。\n\n我向慈善机构捐款。我赞助残疾人...",
      "title": "我是一个长期的持有人。我已经持有了3个半年度的股票。接下来我应该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個相當樸素的人。我已經得到了我所想要的一切。我不需要\n汽車或住房。我已經有了所有這些。我自己的生意已經相當成功，所以\n我在那方面很有優勢。\n\n我已經堅持了三個半年度。我沒有什麼需要或想買的東西。\n\n我向慈善機構捐款。我贊助殘疾人...",
      "title": "我是一個長期的持有人。我已經持有了3個半年度的股票。接下來我應該怎麼做？"
    }
  ]
}