{
  "author": "ConsciousPatroller",
  "original_created_utc": 1650122040,
  "title": "Why does Elon Musk have such a passionate fan community?",
  "created_utc": 1650133671,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve never noticed that before (yes I&amp;#39;ve been living under a rock) until now with the whole Twitter thing. Every time I see a post about it there&amp;#39;s people saying how smart he is and how he&amp;#39;s owned everyone with this smart move, or responding to negative comments and defending him. Some (jokingly I guess) call him &amp;quot;our lord and savior&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Like, he&amp;#39;s a businessman? And businessmen make smart business decisions everyday, but you don&amp;#39;t see people praising Jeff Bezos&amp;#39; name for his latest farmland buyout. So why all of this love for Elon?&lt;/p&gt;\n\n&lt;p&gt;Edit: some very good examples of both types of Elon fanboys in this very thread, lol&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/u4zvfb/why_does_elon_musk_have_such_a_passionate_fan/",
  "subreddit": "TooAfraidToAsk",
  "id": "u4zvfb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've never noticed that before (yes I've been living under a rock) until now\nwith the whole Twitter thing. Every time I see a post about it there's people\nsaying how smart he is and how he's owned everyone with this smart move, or\nresponding to negative comments and defending him. Some (jokingly I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今まで気づかなかった（そう、私は岩の下で生きてきたのだ）。\nツイッターの件と この件に関する記事を見るたびに、多くの人が\nいかに彼が賢いか、この賢い行動で皆を支配したかを語る、あるいは\n否定的なコメントに反応し、彼を擁護する。何人かは（冗談で私は...",
      "title": "イーロン・マスクは、なぜこれほどまでに熱狂的なファンを持つのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我以前从未注意到这一点（是的，我一直生活在岩石下），直到现在\n在Twitter的事情上。每次我看到关于它的帖子，都有一些人\n说他有多聪明，他如何用这个聪明的举动征服了所有人，或\n或者回应负面评论并为他辩护。有些人（开玩笑说，我...",
      "title": "为什么埃隆-马斯克有如此热情的粉丝群体？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我以前從未注意到這一點（是的，我一直生活在岩石下），直到現在\n在Twitter的事情上。每次我看到關於它的帖子，都有一些人\n說他有多聰明，他如何用這個聰明的舉動征服了所有人，或\n或者回應負面評論併爲他辯護。有些人（開玩笑說，我...",
      "title": "爲什麼埃隆-馬斯克有如此熱情的粉絲羣體？"
    }
  ]
}