{
  "author": "aralseapiracy",
  "the_new_excerpt": "Yuval Noah Harari had a great part in one of his books which talked about the\nstory of the indigenous people who sold Manhattan to colonizers for trinkets and\nbeads because they didn't understand how someone could own land, or the value\nthat owning it has. He compared that situation to the modern…",
  "original_created_utc": 1614892739,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "尤瓦尔-诺亚-哈拉里在他的一本书里有一个很好的部分，其中谈到了：。\n土著人将曼哈顿卖给殖民者以换取小饰品及\n珠子，因为他们不明白为什么有人能拥有土地，或者说不知道土地的价值。\n的，拥有它有。他把这种情况与现代...",
      "title": "BAT和Brave浏览器"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "尤瓦爾-諾亞-哈拉里在他的一本書裏有一個很好的部分，其中談到了：。\n土著人將曼哈頓賣給殖民者以換取小飾品及\n珠子，因爲他們不明白爲什麼有人能擁有土地，或者說不知道土地的價值。\n的，擁有它有。他把這種情況與現代...",
      "title": "BAT和Brave瀏覽器"
    }
  ],
  "title": "BAT and Brave Browser",
  "created_utc": 1614929429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yuval Noah Harari had a great part in one of his books which talked about the story of the indigenous people who sold Manhattan to colonizers for trinkets and beads because they didn&#39;t understand how someone could own land, or the value that owning it has. He compared that situation to the modern day, where most of us freely give our data to google and facebook, without comprehending its true value.</p>\n\n<p>I feel like Data ownership is going to be majorly important in the near future, which is one of the main reasons I&#39;m so interested in BAT/Brave. Rather than functioning as a store of value or strictly as a currency, Brave and BAT are attempting to change the way we interact with targeted advertising and data ownership online.</p>\n\n<p>I wanted to  make this post to spread some info about BAT/Brave I recently learned, as well as see what other people think and know about it, as I&#39;m relatively new to it.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What is it?</strong> </p>\n\n<p>Brave is an internet browser which uses BAT (Basic Attention Token) as a token. You can award BAT to content creators who make stuff you enjoy, and earn BAT either as a content creator or by watching advertisements. Brave browser has a built in BAT wallet where your earned BAT accumulate. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Pros</strong></p>\n\n<p>- Built in Ad Blocker</p>\n\n<p>- Built in torrent downloader</p>\n\n<p>- Built in BAT Wallet</p>\n\n<p>- Built in TOR private browsing</p>\n\n<p>- Claims to be Faster than Chrome</p>\n\n<p>- Claims to use less memory than Chrome</p>\n\n<p>- Claims to use less battery than Chrome</p>\n\n<p>- Doesn&#39;t sell your data</p>\n\n<p>- Pays you for advertisements you watch</p>\n\n<p>- Can directly tip other Redditors if browsing reddit on Brave browser.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Cons</strong></p>\n\n<p>- In my experience it is slower than Chrome</p>\n\n<p>- Adoption. There is a lack of viewable ads for payment (depending on your location)</p>\n\n<p>- Adoption. Many content creators are not using Brave so tipping isn&#39;t always possible</p>\n\n<p>- Currently, even on Brave browser you still end up using chrome, yahoo, or another search engine.</p>\n\n<p>- Wallet is run through Uphold and requires verification to withdraw BAT to another wallet or exchange.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Examining the Pros and Cons</strong></p>\n\n<p>First off the built in Adblocker works quite well. I really only seem to see ads that are through the paid BAT function. </p>\n\n<p>The built in torrent downloader is one of my favorite features so far and was a pleasant surprise. If you use a torrent site like the popular pirate themed one, Brave will download the files directly in your browser instead of opening up a program like qbit or utorrent. Then when completed you can open the file and watch it (if its a show or movie) in your browser window, or download it. </p>\n\n<p>The BAT wallet seems fine. Its nothing fancy. Just stores your accumulated BAT. You can&#39;t transfer it out of your wallet unless you have more than 25 BAT. The main possible issue here is that the wallet is run through Uphold. Idk much about them so it could be inconvenient or sketchy?  I&#39;m nowhere near 25 BAT so maybe someone with more experience can shed light on the wallet and how transferring BAT works. </p>\n\n<p>The option to open private browsing windows in TOR is pretty cool. I have never used it in the past, and really don&#39;t know much about it, but having another added layer of privacy doesn&#39;t hurt. </p>\n\n<p>Brave claims to be faster than Chrome. This might be true for some people, but in my experience it is a bit slower.  They also claim to use less battery and memory. The only verification of this I&#39;ve seen appears in new tabs of the brave browser. </p>\n\n<p>The primary benefit of Brave is that it doesn&#39;t sell your data to anyone who offers to buy it. It creeps me out when I search for something and then get ads about it for the rest of the week. Brave works to reduce that type of shit. Basically, preventing a ton of ads, and paying you for the ones you do get. </p>\n\n<p>Being able to tip other Redditors directly is the feature I&#39;m most interested in. Moons have been really cool for this Sub so far IMO and it sorta bums me out that I can&#39;t easily tip crypto in other subs. Being able to tip BAT easily through reddit is a nice feature. If enough people adopt Brave it would be something I could see myself using pretty often. As of now, there don&#39;t seem to be a ton of people who can receive Brave tips on reddit.  I create cocktails and post photos on reddit and Instagram so I&#39;d definitely like to receive BAT tips and send them to other bartenders for cool drinks/recipes.  I think BAT tips are working on YouTube as well but I&#39;d like to see them expanded to Instagram. </p>\n\n<p>The Cons I listed earlier are pretty self explanatory. The biggest ones are rooted in lack of adoption so far. Another big issue is that as of now there is no Brave search engine. They do have plans to launch their own soon though, which solves that problem.</p>\n\n<p>I&#39;ve seen some people say they don&#39;t like the Uphold wallet or verification. As I haven&#39;t verified I cant really say for sure how it is, but having options in terms of storage would be nice.</p>\n\n<p>The speed thing is pretty annoying though. Supposedly its faster than Chrome, but that&#39;s not the case in me experience. </p>\n\n<p>Last, Brave is set to auto-contribute your BAT each month based on the sites you visit. You can simply turn off this feature if you don&#39;t want to give away all your BAT. However, you really don&#39;t earn much BAT through watching ads. You won&#39;t become rich by simply clicking through advertisements. </p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>TLDR:</em></strong> BAT and Brave are a cool project working to give users more control of their internet browsing data, and pay them for advertisements. There are some solid pros and a few cons so far.  I&#39;m hoping this post will spur more discussion and users who have experience with these pros and cons, or knowledge of pros and cons not listed here can bring that information into the light.</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/lxvpkp/bat_and_brave_browser/",
  "subreddit": "CryptoCurrency",
  "id": "lxvpkp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542570796
}