{
  "author": "eh_voila",
  "original_created_utc": 1656873884,
  "title": "Why would you worship a God who considers eternal torture a reasonable punishment?",
  "created_utc": 1656884142,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For those who consider Hell to be a literal place. &lt;/p&gt;\n\n&lt;p&gt;There is not a single person who has ever lived that I would send to Hell. No, not even him. At some point, it’s been enough torture, and now we’re really making a statement about me and not the wrongdoer. &lt;/p&gt;\n\n&lt;p&gt;I’m not that great, but I’d have to consider myself morally superior to a being that sends people to Hell. I could fear that being, and obey it, if I thought it existed. But I could never worship it, or believe it was capable of loving me.&lt;/p&gt;\n\n&lt;p&gt;How do believers square that?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/vqo4zb/why_would_you_worship_a_god_who_considers_eternal/",
  "subreddit": "TooAfraidToAsk",
  "id": "vqo4zb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For those who consider Hell to be a literal place.\n\nThere is not a single person who has ever lived that I would send to Hell. No,\nnot even him. At some point, it’s been enough torture, and now we’re really\nmaking a statement about me and not the wrongdoer.\n\nI’m not that great, but I’d have to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "地獄を文字通りの場所と考える人へ。\n\n私が地獄に送りたい人間は一人もいない。いない。\n彼でさえも ある時点で、それは十分な拷問であり、そして今、私たちは本当に\n私について声明を出しているのであって、悪人についてではありません。\n\n私はそんなに偉くないけど、でも、私は...",
      "title": "永遠の拷問を合理的な罰と考える神を、なぜ崇拝するのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些认为地狱是一个字面上的地方的人来说。\n\n没有一个人是我要送入地狱的。没有。\n甚至他也不会。在某些时候，它已经被折磨够了，现在我们真的\n做出关于我的声明，而不是关于犯错的人。\n\n我没有那么伟大，但我必须...",
      "title": "你为什么要崇拜一个认为永恒的折磨是合理的惩罚的上帝？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些認爲地獄是一個字面上的地方的人來說。\n\n沒有一個人是我要送入地獄的。沒有。\n甚至他也不會。在某些時候，它已經被折磨夠了，現在我們真的\n做出關於我的聲明，而不是關於犯錯的人。\n\n我沒有那麼偉大，但我必須...",
      "title": "你爲什麼要崇拜一個認爲永恆的折磨是合理的懲罰的上帝？"
    }
  ]
}