{
  "author": "pashtun92",
  "original_created_utc": 1629098268,
  "title": "Cryptocurrencies would NOT have saved the people of Afghanistan......",
  "created_utc": 1629109958,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a person who fled from Afghanistan in the year 2000......back when the Taliban was in charge as well. It is horrible for me to see them rise to power again today.</p>\n\n<p>My family is still in Kabul. I can tell you that cryptocurrencies would not have saved them. As soon as other countries heard of the Taliban rising, they closed all embassies so nobody could get a visum. It used to be easy to get out of the country to atleast Pakistan, India or China but they too closed their borders when the Taliban march became to &#39;real&#39;. With no passports, no visums and no money for 90% of the Afghan people, where would they go?</p>\n\n<p>As more and more provinces were being taken, more and more people were forced to go to Kabul. Most of these fugitives had fought against the taliban in their own province and were now forced to sleep in the parks, on the ground and in the parkings lots. The locals of Kabul spared them whatever food they could.......</p>\n\n<p>When the Taliban circled Kabul, hyperinflation occured. Prices of all foods skyrocketed out of fear of dying of starvation. Do you really believe cryptocurrencies could have changes this?</p>\n\n<p><strong>I think not.</strong></p>\n\n<p>Also what many people don&#39;t realise is that many in Afghanistan are UNBANKED. They only hold some cash and use it to buy stuff. Cash would be more useful in this scenario than having cryptocurrencies on some exchange or even in your wallet. What if they turn off the internet? They will surely censor a large part of the internet if not compeletly turn it off. I remember back in 2000, you weren&#39;t even allowed to listen to music, hold a wedding etc. I fear for my family but all I can do is pray.</p>\n</div><!-- SC_ON -->",
  "score": 505,
  "permalink": "/r/CryptoCurrency/comments/p5b4rs/cryptocurrencies_would_not_have_saved_the_people/",
  "subreddit": "CryptoCurrency",
  "id": "p5b4rs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a person who fled from Afghanistan in the year 2000......back when the\nTaliban was in charge as well. It is horrible for me to see them rise to power\nagain today.\n\nMy family is still in Kabul. I can tell you that cryptocurrencies would not have\nsaved them. As soon as other countries heard of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2000年にアフガニスタンから逃れてきた人間です......。\nタリバンが支配していた時代です。今日、再び彼らが権力を握っているのを見るのは、私にとって恐ろしいことです。\n私の家族はまだカブールにいます。\n\n私の家族はまだカブールにいます。暗号通貨では彼らを救えなかったと言えるでしょう。\n彼らを救うことはできませんでした。他の国がこの話を聞くや否や...",
      "title": "暗号通貨はアフガニスタンの人々を救うことはできなかっただろう......"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个在2000年从阿富汗逃出来的人，......back，当时塔利班也在掌管。\n塔利班也在执政。看到他们今天再次上台，我感到非常可怕。\n今天再次上台。\n\n我的家人仍然在喀布尔。我可以告诉你，加密货币不会\n拯救他们。一旦其他国家听说...",
      "title": "加密货币不会拯救阿富汗人民......。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個在2000年從阿富汗逃出來的人，......back，當時塔利班也在掌管。\n塔利班也在執政。看到他們今天再次上臺，我感到非常可怕。\n今天再次上臺。\n\n我的家人仍然在喀布爾。我可以告訴你，加密貨幣不會\n拯救他們。一旦其他國家聽說...",
      "title": "加密貨幣不會拯救阿富汗人民......。"
    }
  ]
}