{
  "author": "AJ_24601",
  "original_created_utc": 1630901220,
  "title": "In 1971 over 96% of voters in Egypt, Libya, and Syria voted on merging together into the Federation of Arab Republics, if this vote was so popular, why did it fail?",
  "created_utc": 1630922865,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>According to Wikipedia, Libya, Egypt, and Syria all held referendums in 1971 simultaneously to join the Federation of Arab Republics. Egypt approved it with 99.96% of voters, and a turnout of 98.1%, Libya with 98.6% with a 94.6%, and Syria with 96.4% and a 89.7% turnout. If accurate, this is overwhelming support. So my question is two parts: </p>\n\n<ol>\n<li>Was this referendum and turnout accurate and considered valid? </li>\n<li>If it was so incredibly popular, why did it fall apart?</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/piryyd/in_1971_over_96_of_voters_in_egypt_libya_and/",
  "subreddit": "AskHistorians",
  "id": "piryyd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "According to Wikipedia, Libya, Egypt, and Syria all held referendums in 1971\nsimultaneously to join the Federation of Arab Republics. Egypt approved it with\n99.96% of voters, and a turnout of 98.1%, Libya with 98.6% with a 94.6%, and\nSyria with 96.4% and a 89.7% turnout. If accurate, this is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウィキペディアによると、リビア、エジプト、シリアは、1971年にアラブ共和国連邦への加盟を問う住民投票を\n同時にアラブ共和国連邦への加盟を決めた。エジプトは投票率99.96%、投票率98.1%で承認。\nエジプトは投票率99.96%、投票率98.1%、リビアは98.6%、投票率94.6%、シリアは96.4%、投票率89.7%で承認された。\nシリアは96.4％、投票率89.7％であった。正確であれば、これは...",
      "title": "1971年にエジプト、リビア、シリアで96％以上の有権者がアラブ共和国連邦への統合を投票しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据维基百科，利比亚、埃及和叙利亚都在1971年同时举行公民投票\n同时加入阿拉伯共和国联盟。埃及以\n99.96%的选民同意，投票率为98.1%，利比亚为98.6%，投票率为94.6%，而\n叙利亚以96.4%和89.7%的投票率通过。如果准确的话，这就是...",
      "title": "1971年，埃及、利比亚和叙利亚超过96%的选民投票赞成合并为阿拉伯共和国联邦，如果这次投票如此受欢迎，为什么会失败？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據維基百科，利比亞、埃及和敘利亞都在1971年同時舉行公民投票\n同時加入阿拉伯共和國聯盟。埃及以\n99.96%的選民同意，投票率爲98.1%，利比亞爲98.6%，投票率爲94.6%，而\n敘利亞以96.4%和89.7%的投票率通過。如果準確的話，這就是...",
      "title": "1971年，埃及、利比亞和敘利亞超過96%的選民投票贊成合併爲阿拉伯共和國聯邦，如果這次投票如此受歡迎，爲什麼會失敗？"
    }
  ]
}