{
  "author": "RelaxedOrange",
  "original_created_utc": 1624661401,
  "title": "Napoleon III's wife, Empress Eugenie, owned a pair of gloves made from spider silk. What happened to them?",
  "created_utc": 1624675922,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen several references to a priceless, one-of-a-kind pair of small grey gloves made from spider silk which were created for Empress Eugenie. However, I cannot find any photos of them, or any indication that they are in a museum. So my best guess is that they must have been lost or destroyed at some point.   </p>\n\n<p>Do we know what happened with these unique gloves?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/o7yi82/napoleon_iiis_wife_empress_eugenie_owned_a_pair/",
  "subreddit": "AskHistorians",
  "id": "o7yi82",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve seen several references to a priceless, one-of-a-kind pair of small grey\ngloves made from spider silk which were created for Empress Eugenie. However, I\ncannot find any photos of them, or any indication that they are in a museum. So\nmy best guess is that they must have been lost or destroyed at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウジェニー皇后のために作られた、蜘蛛の糸で作られた貴重な一点物の小さなグレーの手袋の話を何度か見たことがあります。\n皇后ユージェニーのために作られた、蜘蛛の糸で作られた貴重な一組のグレーの小さな手袋をいくつか見たことがあります。しかし、私はそれらの写真や\nしかし、その写真は見当たらないし、博物館に所蔵されているという情報もない。そこで\n私の推測では、それらは失われたか、破壊されたのではないかと...。",
      "title": "ナポレオン3世の妻、ウージェニー皇后は、クモの糸で作られた手袋を所有していました。その手袋はどうなったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾多次提到一副无价的、独一无二的灰色小手套。\n用蜘蛛丝制作的灰色小手套，是为欧仁妮皇后制作的。然而，我\n我找不到它们的任何照片，也没有任何迹象表明它们在博物馆里。所以\n我最好的猜测是，它们肯定已经丢失或被毁，在...",
      "title": "拿破仑三世的妻子尤金妮皇后拥有一副由蜘蛛丝制成的手套。它们后来怎样了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾多次提到一副無價的、獨一無二的灰色小手套。\n用蜘蛛絲製作的灰色小手套，是爲歐仁妮皇后製作的。然而，我\n我找不到它們的任何照片，也沒有任何跡象表明它們在博物館裏。所以\n我最好的猜測是，它們肯定已經丟失或被毀，在...",
      "title": "拿破崙三世的妻子尤金妮皇后擁有一副由蜘蛛絲製成的手套。它們後來怎樣了？"
    }
  ]
}