{
  "author": "shouldIbuyahomenow",
  "original_created_utc": 1634601090,
  "title": "I need advice. Should I sell my bitcoin to buy a house now? Or should I wait 4 more years?",
  "created_utc": 1634617875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m an unmarried 36 year old American with a low paying job. I&#39;m stuck renting and living with roommates. I don&#39;t qualify for a home mortgage loan because of my low paying job and subpar credit score. With the current price of bitcoin, I could sell all of my bitcoin and afford to buy a nice small house where I live, and I like the area where I live.</p>\n\n<p>If you were in my position, would you sell your bitcoin to buy a house right now? Or would you wait 4 more years?</p>\n\n<p>I believe that the price of bitcoin will be a lot higher in 4 years. So if I wait 4 more years, I believe I will be able to afford a nicer house and still have some bitcoin left over to save, but then I will be 40 years old, and I would also be stuck renting and living with roommates until 2026... I&#39;d hate to sell most of my bitcoin. But I&#39;d love to own a house.</p>\n\n<p>I&#39;m so conflicted. I hate living with roommates and I&#39;ve always wanted to own a house, but I&#39;d hate to sell most of my bitcoin for only $62,000 each. I feel like they should be worth more and I think they will be worth a lot more in the future. Please give me advice and help me make a decision. What do you think I should do? What would you do?</p>\n\n<p>Edit: I forgot to mention that I was convicted of felony drug possession a long while back. Being a convicted felon has really limited my potential job prospects and made it a lot more difficult for me when trying to find a place to rent.</p>\n\n<p>Thank you for your input everyone. I&#39;ve decided to keep waiting. But if the price happens to reach $150k this bull run, I will go ahead and sell 1.5 BTC to buy a small condo, and then I probably will wait 8+ years before selling my condo and upgrading to a house. Otherwise I will wait 4 more years before selling some of my bitcoin to buy a house.</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/Bitcoin/comments/qaz6ew/i_need_advice_should_i_sell_my_bitcoin_to_buy_a/",
  "subreddit": "Bitcoin",
  "id": "qaz6ew",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm an unmarried 36 year old American with a low paying job. I'm stuck renting\nand living with roommates. I don't qualify for a home mortgage loan because of\nmy low paying job and subpar credit score. With the current price of bitcoin, I\ncould sell all of my bitcoin and afford to buy a nice small…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は未婚の36歳のアメリカ人で、低賃金の仕事をしています。賃貸ではなく、ルームメイトと暮らしています。\nルームメイトと暮らしています。低賃金の仕事と低いクレジットスコアのために、住宅ローンを組む資格がありません。\n低賃金の仕事と低いクレジットスコアのため、住宅ローンの資格がありません。現在のビットコインの価格では、私は\n現在のビットコイン価格なら、手持ちのビットコインをすべて売却して、素敵な小型の住宅を購入する余裕があるのですが...。",
      "title": "アドバイスが欲しい 今、ビットコインを売って家を買うべきでしょうか？それとも、あと4年待つべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个36岁的未婚美国人，有一份低薪的工作。我被困在租房里\n和室友一起生活。我没有资格申请房屋抵押贷款，因为\n我的低薪工作和不合格的信用评分。以目前比特币的价格，我\n我可以卖掉我所有的比特币，买得起一个漂亮的小房子。",
      "title": "我需要建议。我现在应该卖掉我的比特币去买房子吗？或者我应该再等4年？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個36歲的未婚美國人，有一份低薪的工作。我被困在租房裏\n和室友一起生活。我沒有資格申請房屋抵押貸款，因爲\n我的低薪工作和不合格的信用評分。以目前比特幣的價格，我\n我可以賣掉我所有的比特幣，買得起一個漂亮的小房子。",
      "title": "我需要建議。我現在應該賣掉我的比特幣去買房子嗎？或者我應該再等4年？"
    }
  ]
}