{
  "author": "cannainform2",
  "the_new_excerpt": "KEY POINTS\n\n * Paul Tudor Jones said he would “go all in on the inflation trades” if the\n   Federal Reserve is nonchalant this week regarding rising consumer prices.\n * “I’d probably buy commodities, buy crypto, buy gold,” the billionaire hedge\n   fund manager said.\n * “If they course correct,” he…",
  "original_created_utc": 1623697281,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "キーポイント\n\n * ポール・チューダー・ジョーンズは、もし米連邦準備制度理事会（FRB）が今週、消費者物価の上昇について無関心であれば、「インフレーション・トレードに全力で取り組む」と述べています。\n   ポール・チューダー・ジョーンズ氏は、もし米連邦準備制度理事会（FRB）が今週、消費者物価の上昇について無関心であれば、「インフレ・トレードに全力で取り組む」と述べた。\n * \"I'd probably buy commodities, buying crypto, buy gold,\" the billionaire hedge fund mana\n   億万長者のヘッジファンド・マネージャーが語った。\n * 「彼らが正しい方向に進むならば」彼は...",
      "title": "ポール・チューダー・ジョーンズ、FRBが物価上昇を無視し続けるなら「インフレ・トレードに全力投球」と発言"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关键点\n\n * 保罗-都铎-琼斯表示，如果美联储本周对消费物价上涨不闻不问，他将 \"全身心投入到通货膨胀交易中去\"。\n   如果美联储本周对消费者价格上涨不闻不问，他将 \"全力以赴地进行通货膨胀交易\"。\n * 这位亿万富翁的对冲基金经理说：\"我可能会购买商品，购买加密货币，购买黄金。\n   对冲基金经理说。\n * \"如果他们路线正确，\"他...",
      "title": "保罗-都铎-琼斯说，如果美联储继续无视更高的价格，就 \"全身心投入通胀交易\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關鍵點\n\n * 保羅-都鐸-瓊斯表示，如果美聯儲本週對消費物價上漲不聞不問，他將 \"全身心投入到通貨膨脹交易中去\"。\n   如果美聯儲本週對消費者價格上漲不聞不問，他將 \"全力以赴地進行通貨膨脹交易\"。\n * 這位億萬富翁的對沖基金經理說：\"我可能會購買商品，購買加密貨幣，購買黃金。\n   對沖基金經理說。\n * \"如果他們路線正確，\"他...",
      "title": "保羅-都鐸-瓊斯說，如果美聯儲繼續無視更高的價格，就 \"全身心投入通脹交易\"。"
    }
  ],
  "title": "Paul Tudor Jones says ‘go all in on the inflation trades’ if Fed keeps ignoring higher prices",
  "created_utc": 1623729321,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>KEY POINTS</strong></p>\n\n<ul>\n<li><strong>Paul Tudor Jones said he would “go all in on the inflation trades” if the Federal Reserve is nonchalant this week regarding rising consumer prices.</strong></li>\n<li><strong>“I’d probably buy commodities, buy crypto, buy gold,” the billionaire hedge fund manager said.</strong></li>\n<li><strong>“If they course correct,” he continued, “then you’re going to get a taper tantrum.”</strong></li>\n<li><strong>The Fed’s two-day policy meeting is scheduled to conclude Wednesday.</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Billionaire hedge fund manager <a href=\"https://www.cnbc.com/paul-tudor-jones/\">Paul Tudor Jones</a> told CNBC on Monday he’s paying close attention to this week’s Federal Reserve policy meeting in light of recent economic data showing <a href=\"https://www.cnbc.com/2021/06/10/cpi-may-2021.html\">higher consumer prices</a>.</p>\n\n<p>“If they treat these numbers — which were material events, they were very material — if they treat them with nonchalance, I think it’s just a green light to bet heavily on every inflation trade,” Jones said on <a href=\"https://www.cnbc.com/squawk-box-us/\">“Squawk Box.”</a></p>\n\n<p>“If they say, ‘We’re on path, things are good,’ then I would just go all in on the inflation trades. I’d probably buy commodities, buy crypto, buy gold,” added Jones, who called the stock market crash in 1987 and is founder and chief investment officer of <a href=\"https://www.tudor.com/default.aspx#section-About\">Tudor Investment</a>.</p>\n\n<p>On the other hand, Jones predicted that markets would be unsettled if the Fed comes out with a different tone Wednesday.</p>\n\n<p>“If they course correct, if they say, ‘We’ve got incoming data, we’ve accomplished our mission or we’re on the way very rapidly to accomplishing our mission on employment,’ then you’re going to get a taper tantrum,” Jones said. “You’re going to get a sell-off in fixed income. You’re going to get a correction in stocks. That doesn’t necessarily mean it’s over.”</p>\n\n<p>The Fed’s two-day policy meeting is <a href=\"https://www.cnbc.com/2021/06/11/markets-await-the-feds-meeting-in-the-week-ahead.html\">scheduled to conclude Wednesday</a>, and Chairman Jerome Powell is set to hold a news conference after the central bank releases its statement at 2 p.m. ET.</p>\n\n<p>Powell and company have maintained their highly accommodative monetary policy approach, which was instituted in response to <a href=\"https://www.cnbc.com/coronavirus/\">the coronavirus pandemic</a>. Central bankers have been steadfast <a href=\"https://www.cnbc.com/2021/05/11/stanley-druckenmiller-says-the-fed-is-endangering-the-dollars-global-reserve-status.html\">despite criticism</a> that massive bond buying and near-zero interest rates are no longer necessary because the economic recovery is well underway and inflation data is concerning. </p>\n\n<p>Powell and other Fed officials say they believe rising prices are likely temporary as the economy reopens from all manner of pandemic-related disruptions, which in turn justifies their policy stance.</p>\n\n<p>“The idea that inflation is transitory, to me ... that one just doesn’t work the way I see the world,” said Jones, who added he feels the central bank’s inflation views <a href=\"https://www.cnbc.com/2021/06/14/paul-tudor-jones-says-the-feds-credibility-is-at-risk-with-inflation-view.html\">put its credibility at risk</a>.</p>\n\n<p>In Monday’s “Squawk Box” interview, Jones also reiterated his <a href=\"https://www.cnbc.com/2021/06/14/tudor-jones-likes-bitcoin-calls-it-a-great-portfolio-diversifier-to-protect-his-wealth-over-time.html\">favorable outlook on bitcoin</a>, calling it a “portfolio diversifier” and a ” story of wealth.” The longtime trader added that<a href=\"https://www.cnbc.com/2021/06/14/tudor-jones-says-a-stock-market-valuation-making-him-nervous.html\"> he’s grown nervous</a> when considering the stock market’s valuation compared with the overall economy.</p>\n\n<p>“The only thing I know for certain, I want 5% in gold, 5% in bitcoin, 5% in cash, 5% in commodities. At this point in time, I don’t know what I want to do with the other 80% until I see what the Fed is going to do,” Jones said.</p>\n</div><!-- SC_ON -->",
  "score": 94,
  "permalink": "/r/investing/comments/nzu6qe/paul_tudor_jones_says_go_all_in_on_the_inflation/",
  "subreddit": "investing",
  "id": "nzu6qe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742346
}