{
  "author": "iNeedHealing24_7",
  "original_created_utc": 1626877610,
  "title": "Anyone else just clean the entire house and make it spotless when either mad or upset?",
  "created_utc": 1626892697,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I noticed this other day after I got in a fight over my gf on the phone. I used cleaning products I have never used before, I vacuumed, made the bed, wiped the desk and tables around the house and cleaned the whole bathroom literally making its sparkle. Not the first time this has happened. Edit: Normally when I clean, I end up procastinating and messing around with stuff I find. When I&#39;m upset and/or angry, none of that. High speed, efficient and thorough cleaning</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/ooqyxc/anyone_else_just_clean_the_entire_house_and_make/",
  "subreddit": "NoStupidQuestions",
  "id": "ooqyxc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I noticed this other day after I got in a fight over my gf on the phone. I used\ncleaning products I have never used before, I vacuumed, made the bed, wiped the\ndesk and tables around the house and cleaned the whole bathroom literally making\nits sparkle. Not the first time this has happened. Edit:…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、彼女と電話で喧嘩をした後に気づきました。使ったのは\n掃除機をかけ、ベッドメイキングをし、机やテーブルを拭いて、今まで使ったことのない掃除用具を使いました。\n掃除機をかけ、ベッドメイキングをし、机やテーブルを拭き、バスルーム全体を掃除して文字通りピカピカにしました。\n浴室もピカピカにしました。このようなことが起こったのは初めてではありません。編集：...",
      "title": "怒るか怒られるかしたときに、家中を掃除してピカピカにするだけの人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前几天，我在电话中为我的女友争吵后注意到了这一点。我使用了\n我使用了以前从未使用过的清洁产品，我吸尘、铺床、擦拭了\n桌子和屋子周围的桌子，并清洁了整个浴室，实际上是把它变成了\n它闪闪发光。这已经不是第一次发生了。编辑：...",
      "title": "还有人在生气或不高兴的时候就把整个房子打扫得一尘不染吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前幾天，我在電話中爲我的女友爭吵後注意到了這一點。我使用了\n我使用了以前從未使用過的清潔產品，我吸塵、鋪牀、擦拭了\n桌子和屋子周圍的桌子，並清潔了整個浴室，實際上是把它變成了\n它閃閃發光。這已經不是第一次發生了。編輯：...",
      "title": "還有人在生氣或不高興的時候就把整個房子打掃得一塵不染嗎？"
    }
  ]
}