{
  "author": "nip_dip",
  "original_created_utc": 1657515117,
  "title": "Why did Disney choose to make Splash Mountain?",
  "created_utc": 1657529770,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The park attraction &amp;quot;Splash Mountain&amp;quot; is a classic ride at the Disney Land/World theme parks, but I heard a few days ago that it is to be renamed and changed soon, which piqued my interest in the history of the attraction. The attraction is based off of an old and relatively obscure Disney movie named &amp;quot;Song of the South. The movie is widely considered one of the most racist films Disney has ever released, which is exactly why they are changing Splash Mountain&amp;#39;s name to &amp;quot;Tiana&amp;#39;s Bayou Adventure&amp;quot; in 2024 within the theme parks. However, one is to ask why Splash Mountain was even made in the first place. Ever since the Civil Rights Era, Disney has tried to erase the movie from its history entirely, which is why the movie has no VHS version and hasn&amp;#39;t been released in theaters since 1986, which predated Splash Mountain by 3 years. With this in mind, it is puzzling to me as to why Disney has decided to make an attraction in their theme parks based off of this movie in the first place. &lt;/p&gt;\n\n&lt;p&gt;With this in mind. why did Disney make a theme park attraction based off of a highly controversial movie that they&amp;#39;ve been trying to remove all traces of for the past 60 years?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/vwa6kj/why_did_disney_choose_to_make_splash_mountain/",
  "subreddit": "AskHistorians",
  "id": "vwa6kj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The park attraction \"Splash Mountain\" is a classic ride at the Disney Land/World\ntheme parks, but I heard a few days ago that it is to be renamed and changed\nsoon, which piqued my interest in the history of the attraction. The attraction\nis based off of an old and relatively obscure Disney movie…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ディズニーランド/ワールドの定番アトラクション「スプラッシュ・マウンテン」。\nテーマパークでは定番のアトラクションですが、数日前に「近々改名・変更される」という話を聞き\nアトラクションの歴史に興味がわきました。このアトラクションは\nこのアトラクションは、古い、そして比較的無名のディズニー映画が元になっています...",
      "title": "なぜ、ディズニーは「スプラッシュ・マウンテン」を作ったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "公园景点 \"飞溅山 \"是迪士尼乐园/世界主题公园的一个经典游乐项目。\n主题公园的经典游乐项目，但我几天前听说它很快就要改名换代了。\n这激起了我对该景点历史的兴趣。该景点\n是根据一部古老而相对模糊的迪斯尼电影改编的...",
      "title": "迪士尼为什么选择制作飞溅山？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "公園景點 \"飛濺山 \"是迪士尼樂園/世界主題公園的一個經典遊樂項目。\n主題公園的經典遊樂項目，但我幾天前聽說它很快就要改名換代了。\n這激起了我對該景點歷史的興趣。該景點\n是根據一部古老而相對模糊的迪斯尼電影改編的...",
      "title": "迪士尼爲什麼選擇製作飛濺山？"
    }
  ]
}