{
  "author": "Don_Montagna",
  "original_created_utc": 1650369766,
  "title": "So are we not gonna talk about the racial motivation of the Brooklyn Subway shooter?",
  "created_utc": 1650377504,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;EDIT: i am a Hispanic American and really not conservative, so if you&amp;#39;re gonna use this post as a platform to be racist, I&amp;#39;m gonna delete it. The problem I&amp;#39;m pointing out comes from media and &lt;em&gt;their&lt;/em&gt; racial discrimination. Please be kind no matter what your opinion in the comments so it doesn&amp;#39;t get blacked.&lt;/p&gt;\n\n&lt;p&gt;I mean just like the title says. The guy has hundreds of hours of self-documented hate and harrasment on his social medias, deliberately spent hours walking around Brooklyn attacking people verbally for being white, before going into a subway and randomly shooting any white person he could see. And the cherry on top is while he was running around Brooklyn, strapped, looking for white people to kill out of racist hatred, he would berate random whites and call them racist. &lt;/p&gt;\n\n&lt;p&gt;Everytime a white guy with a legal gun shoots somebody it&amp;#39;s an international talking point about &amp;quot;Americas tun culture&amp;quot; and &amp;quot;white nationalism&amp;quot; like, can we accept and talk about the fact that this dude&amp;#39;s racial bias was blatantly motivated by the anti-white rhetoric spread through our news and media?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/u73ifh/so_are_we_not_gonna_talk_about_the_racial/",
  "subreddit": "TooAfraidToAsk",
  "id": "u73ifh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "EDIT: i am a Hispanic American and really not conservative, so if you're gonna\nuse this post as a platform to be racist, I'm gonna delete it. The problem I'm\npointing out comes from media and their racial discrimination. Please be kind no\nmatter what your opinion in the comments so it doesn't get…"
}