{
  "author": "gnrlee01",
  "the_new_excerpt": "For a reddit group that is supposed to be \"stocks\" you guys block about half of\nthe available stock markets discussions and abilities on here. No S P A C's are\nallowed, which also includes units and warrants, not to mention any s p a c\nmergers. Not being allowed to mention anything from the O T C…",
  "original_created_utc": 1616313436,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于一个应该是 \"股票 \"的reddit小组，你们屏蔽了大约一半的。\n可用的股市讨论和能力在这里。没有S P A C的是\n允许的，其中还包括单位和权证，更不用说任何S P A C。\n合并。不允许提及任何从O T C... ...",
      "title": "这个reddit应该是针对 \"股票 \"的?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於一個應該是 \"股票 \"的reddit小組，你們屏蔽了大約一半的。\n可用的股市討論和能力在這裏。沒有S P A C的是\n允許的，其中還包括單位和權證，更不用說任何S P A C。\n合併。不允許提及任何從O T C... ...",
      "title": "這個reddit應該是針對 \"股票 \"的?"
    }
  ],
  "title": "This reddit is supposed to be for \"stocks\" ??",
  "created_utc": 1616318740,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For a reddit group that is supposed to be &quot;stocks&quot; you guys block about half of the available stock markets discussions and abilities on here. No S P A C&#39;s are allowed, which also includes units and warrants, not to mention any s p a c  mergers. Not being allowed to mention anything from the O T C market, prevents a huge sector of companies from being talked about, like Volkswagen for one...yeah, there are a lot of Penny s t o c k companies, but almost all of your European and other foreign markets are traded on that market.\nYou might as well change the name of this reddit to &quot;NYSE&quot; only, or &quot;NASDAQ&quot; only...because there are a LOT more &quot;stock offerings and options in other markets that you restrict us from posting about. HELL, EVEN THE MENTION OF ANY OF THESE KEY WORDS AUTOMATICALLY REMOVES A POST, REGARDLESS OF THE CONTEXT...AND I THOUGHT FACEBOOK AND GOOGLE WERE TOO MUCH OF A DICTATORSHIP...WOW!!!</p>\n</div><!-- SC_ON -->",
  "score": 1191,
  "permalink": "/r/stocks/comments/m9rt3h/this_reddit_is_supposed_to_be_for_stocks/",
  "subreddit": "stocks",
  "id": "m9rt3h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752821011
}