{
  "author": "Wilmotac",
  "original_created_utc": 1634808503,
  "title": "If you've just got into Crypto and are checking the prices constantly...don't worry, this passes",
  "created_utc": 1634851853,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember when I first started buying crypto again (having bought some bags and forgotten about them in 2017) last year. Every morning I&#39;d wake up and check my portfolio, and I&#39;d wake up in the night to check it. </p>\n\n<p>Mates of mine already had 5 or 6 figure portfolios, and I did not. How did they manage not to spend all day obsessing over 1-2% price movements? That&#39;s hundreds, maybe thousands of dollars of value shifting every minute. They told me that having been through a full bull and bear cycle already, they know better than to waste time checking the price constantly. </p>\n\n<p>I have a portfolio I&#39;m pleased with. No Lambo, and I can&#39;t quit my job, but it&#39;s more than I had hoped for when I started, and I find myself checking less and less. Why would I? I&#39;m not planning to sell for the next few years, and everything is locked and earning interest, so I couldn&#39;t sell even if I tried. </p>\n\n<p>As you stay in this space a bit longer, you will become more confident in your investments, and so won&#39;t need to be reassured by every tiny green candle, and won&#39;t panic at the slightest pullback.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qcnxks/if_youve_just_got_into_crypto_and_are_checking/",
  "subreddit": "CryptoCurrency",
  "id": "qcnxks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I remember when I first started buying crypto again (having bought some bags and\nforgotten about them in 2017) last year. Every morning I'd wake up and check my\nportfolio, and I'd wake up in the night to check it.\n\nMates of mine already had 5 or 6 figure portfolios, and I did not. How did…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最初に再び暗号を買い始めた時のことを覚えています（いくつかのバッグを購入していて\n2017年には忘れていた）昨年のことです。毎朝、目を覚まして自分の\nしたり、夜中に起きてポートフォリオを確認したりしていました。\n\n私のメイトはすでに5、6桁のポートフォリオを持っていましたが、私はそうではありませんでした。どうやって...",
      "title": "もしあなたがCryptoを始めたばかりで、常に価格をチェックしているなら、心配しないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得当我第一次开始重新购买加密货币时（买了一些袋子，但在2年内就忘记了）。\n2017年买了一些包，但却忘了它们），去年。每天早上，我都会醒来，检查我的\n投资组合，晚上我也会醒来检查。\n\n我的伙伴们已经有了5或6位数的投资组合，而我却没有。怎么会...",
      "title": "如果你刚刚进入加密货币，并不断检查价格......不要担心，这通过"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得當我第一次開始重新購買加密貨幣時（買了一些袋子，但在2年內就忘記了）。\n2017年買了一些包，但卻忘了它們），去年。每天早上，我都會醒來，檢查我的\n投資組合，晚上我也會醒來檢查。\n\n我的夥伴們已經有了5或6位數的投資組合，而我卻沒有。怎麼會...",
      "title": "如果你剛剛進入加密貨幣，並不斷檢查價格......不要擔心，這通過"
    }
  ]
}