{
  "author": "k-misc",
  "original_created_utc": 1656949712,
  "title": "In queer spaces, why is there so much pressure to “seem gay”?",
  "created_utc": 1656955700,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;19M here. When I started attending my college (Pretty prestigious school in a city with a pretty good LGBTQ+ culture), I thought it would be easy to be comfortable in my identity, and for the most part I have. I haven’t faced much, if any, outright homophobia, but there’s been a lot of difficulty coming from the queer community itself. I’m bisexual, but according to many other people, I don’t “act like it”. I constantly get told I look, dress, act, talk, and generally carry myself in a “straight” way. And to be fair, this is most likely true. I don’t really act in any of the “stereotypically gay” ways if you know what I mean. There’s no reason I’m doing that, it’s just that I’m most comfortable acting and dressing the way I do. The fact that that doesn’t seem to line up with what’s stereotypically queer didn’t seem like a big deal to me. I didn’t think this was going to be an issue, but so much of the queer community implicitly shuns me for it. Whether it’s a condescending “oh you didn’t SEEM queer I had no idea” when I come out to people, snide comments about my appearance or mannerisms being too straight, and even outright accusations that I’m “not really bi” or that I’m somehow faking my sexuality, I’ve noticed it a lot. Why is this? Is this phenomenon widespread or is it just my school? Any advice would be appreciated, because it’s seriously starting to upset me. Half the reason I was excited to go to a school and city with a good queer community was acceptance, and for some reason I can’t even get that.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 181,
  "permalink": "/r/TooAfraidToAsk/comments/vradrg/in_queer_spaces_why_is_there_so_much_pressure_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "vradrg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "19M here. When I started attending my college (Pretty prestigious school in a\ncity with a pretty good LGBTQ+ culture), I thought it would be easy to be\ncomfortable in my identity, and for the most part I have. I haven’t faced much,\nif any, outright homophobia, but there’s been a lot of difficulty…"
}