{
  "author": "Lidia-69",
  "original_created_utc": 1655940930,
  "title": "Is it petty to change my mind about sex because my bf doesn’t to wear a condom? Even with BC?",
  "created_utc": 1655946781,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My bf and I want to take the relationship to the next level, but I want him to use a condom even if I’m on bc. We’re both 14 almost 15 and have been together since last year, I don’t want to rush into sex but he said everyone is doing it at our age. I feel comfortable but I’ve been having second thoughts because of certain things he said. &lt;/p&gt;\n\n&lt;p&gt;1.) He said he was allergic to latex, but we’ve used latex gloves in class with no issues before. Plus they make latex free condoms but he said they always have a small percentage of latex in them.&lt;/p&gt;\n\n&lt;p&gt;2.) even when I bring up that bc won’t protect from std’s he’d say “so what you’re saying is you don’t love or trust me” which I feel is super manipulative.&lt;/p&gt;\n\n&lt;p&gt;I don’t feel comfortable losing my vcard like this but we’ve messed around with hands and mouth before, and I feel like I’d be a prude if I didn’t. When I have said I had second thoughts he called me petty because I was withholding sex from him because of his condition (latex allergy) now he won’t talk or touch me anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 176,
  "permalink": "/r/NoStupidQuestions/comments/viirvg/is_it_petty_to_change_my_mind_about_sex_because/",
  "subreddit": "NoStupidQuestions",
  "id": "viirvg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "My bf and I want to take the relationship to the next level, but I want him to\nuse a condom even if I’m on bc. We’re both 14 almost 15 and have been together\nsince last year, I don’t want to rush into sex but he said everyone is doing it\nat our age. I feel comfortable but I’ve been having second…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私と彼の関係は次のレベルに進みたいのですが、私は彼にこうして欲しいのです。\nコンドームを使ってほしいのです。私たちは14歳で、もうすぐ15歳になるのですが、去年からずっと一緒にいます。\n私はセックスを急ぎたくないのですが、彼は、私たちの年齢ではみんなしていると言います。\nと言っていました。私は気持ち良いのですが、2回目の...",
      "title": "私のボーイフレンドがコンドームを着用しないためにセックスに対する私の心を変更することは、小心者ですか？BCでも？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的男朋友想让我们的关系更上一层楼，但我想让他\n使用安全套，即使我在服用避孕药。我们都是14岁，差不多15岁，从去年开始就在一起了。\n我不想急于求成，但他说每个人都在做这件事。\n在我们这个年龄段。我觉得很舒服，但我已经有了第二次...",
      "title": "因为我的男朋友不戴安全套而改变我对性的看法，这算不算小题大做？即使有BC？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的男朋友想讓我們的關係更上一層樓，但我想讓他\n使用安全套，即使我在服用避孕藥。我們都是14歲，差不多15歲，從去年開始就在一起了。\n我不想急於求成，但他說每個人都在做這件事。\n在我們這個年齡段。我覺得很舒服，但我已經有了第二次...",
      "title": "因爲我的男朋友不戴安全套而改變我對性的看法，這算不算小題大做？即使有BC？"
    }
  ]
}