{
  "author": "M00OSE",
  "original_created_utc": 1642312764,
  "title": "I've lived and breathed Defi for over a year now, here are my best low-risk Defi strategies for each major chain",
  "created_utc": 1642340810,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Defi, &lt;em&gt;decentralized finance,&lt;/em&gt; is often referred to as the &lt;em&gt;Wild Wild West of Crypto&lt;/em&gt;. But after journeying in Defi for over a year, I&amp;#39;ve learned that the West is only &amp;#39;wild&amp;#39; for the cowboys and mercenaries—they are known as &amp;#39;degens&amp;#39; around these parts. For this post, I&amp;#39;ll provide ways for you to prosper in the Wild West as a steady and humble farmer.&lt;/p&gt;\n\n&lt;p&gt;Edit: Forgot to mention that this guide prioritizes security over profits. The rules of the low-risk strategies are to (1) hold &lt;em&gt;pristine assets&lt;/em&gt; like BTC and ETH, (2) avoid impermanent loss and splitting assets as you would by directly being in a LP position, (3) use reputable dapps, (4) use simple strategies (no leverage, no auto-compounding, etc.). &lt;/p&gt;\n\n&lt;h1&gt;Ethereum - Very high gas fees&lt;/h1&gt;\n\n&lt;p&gt;Wallet - &lt;a href=\"https://metamask.io/\"&gt;Metamask&lt;/a&gt; or &lt;a href=\"https://www.ledger.com/ledger-live\"&gt;Ledger&lt;/a&gt;   |   Dex - &lt;a href=\"https://defillama.com/protocol/uniswap\"&gt;Uniswap&lt;/a&gt; or &lt;a href=\"https://defillama.com/protocol/sushiswap\"&gt;SushiSwap&lt;/a&gt; are both good&lt;/p&gt;\n\n&lt;p&gt;I wouldn&amp;#39;t recommend Defi on Ethereum due to high fees and because the roadmap is to &lt;del&gt;stop using Ethereum for general purposes&lt;/del&gt; migrate to layer 2s; but, there are protocols that are only the Ethereum network right now. When using Ethereum, I recommend using as few dapps as possible to avoid gas fees.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The simplest Ethereum Defi strategy is to deposit ETH into Tokemak.&lt;/strong&gt; The expected yield is 8-12%. Using &lt;a href=\"https://defillama.com/protocol/tokemak\"&gt;Tokemak&lt;/a&gt;, you&amp;#39;ll be a single-token liquidity provider. This allows you to avoid impermanent loss (IL) and you can hold 100% of ETH instead of splitting your assets like a typical liquidity provider.&lt;/p&gt;\n\n&lt;p&gt;But the IL doesn&amp;#39;t just disappear. There are other type of users that work as &amp;quot;managers&amp;quot; who play a role in deciding how the protocols makes profits. I won&amp;#39;t dive deeper into this aspect since it&amp;#39;s a different strategy but for those interested to learn more, here&amp;#39;s an &lt;a href=\"https://www.youtube.com/watch?v=FMZ_fS1uZaU\"&gt;explanation&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Downsides: Expect to spend heavily on fees (~$200) on bridging to Ethereum as well as approving and depositing ETH. And the same amount for the withdrawing process. If the fees are peanuts to you, feel free to use this strategy, Mr/Mrs. Whale. You&amp;#39;ll be earning rewards via the protocol token, TOKE, as rewards, which may not be ideal given that TOKE does suffer from high price volatility and selling pressure.&lt;/p&gt;\n\n&lt;h1&gt;Polygon - Negligible fees (~$0.02)&lt;/h1&gt;\n\n&lt;p&gt;Wallet - &lt;a href=\"https://metamask.io/\"&gt;Metamask&lt;/a&gt; or &lt;a href=\"https://www.ledger.com/ledger-live\"&gt;Ledger&lt;/a&gt;   |   Dex - &lt;a href=\"https://defillama.com/protocol/quickswap\"&gt;QuickSwap&lt;/a&gt;, &lt;a href=\"https://defillama.com/protocol/uniswap\"&gt;Uniswap&lt;/a&gt;, or &lt;a href=\"https://defillama.com/protocol/sushiswap\"&gt;SushiSwap&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Polygon really made its strides between April to July 2021 when they launched a $40M &lt;a href=\"https://cryptobriefing.com/polygon-launches-40m-liquidity-mining-program-with-aave/\"&gt;incentive program&lt;/a&gt; and since they&amp;#39;ve been reliable and competitive. And with Polygon fees being so low, you’re pretty much free to do whatever.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;In terms of low-risk Defi investing, an Aave + Curve strategy is currently the golden standard.&lt;/strong&gt; Adding the rates for lending and providing liquidity and subtracting it from the costs of borrowing, the expected yield is 4-6%. This can be done by depositing into &lt;a href=\"https://defillama.com/protocol/aave\"&gt;Aave&lt;/a&gt;, using the deposits as collateral to borrow a stablecoin, and using the borrowed stablecoins to provide liquidity in Curve.&lt;/p&gt;\n\n&lt;p&gt;As a low-risk user, the ideal borrowing rate is 30% of your deposits (ie. deposit $1K, borrow $300). At this rate, you&amp;#39;ll be liquidated if your deposits depreciate more than 45%. Given that it historically takes several days or cryptos like BTC or ETH to crash, giving you a long enough timeframe to manage your risks. You can further mitigate liquidation risks are to deposit stablecoins, which improves the stability of your portfolio, while depositing even more volatile assets like MATIC will increase risks. It&amp;#39;s all about risk management.&lt;/p&gt;\n\n&lt;p&gt;Downsides: Borrowing and lending on Aave exposes you to liquidation risk and will require you to properly manage your assets. You will &amp;quot;be your own bank&amp;quot; and that isn&amp;#39;t easy. Alas, this is one of the few ways to participate while holding assets like BTC and ETH and avoiding liquidity providing risks. You&amp;#39;ll be earning rewards in wrapped MATIC and some rewards in CRV (a protocol token but has good fundamentals and has held its value historically).&lt;/p&gt;\n\n&lt;h1&gt;Terra - Relatively high fees (~$1)&lt;/h1&gt;\n\n&lt;p&gt;Wallet - &lt;a href=\"https://station.terra.money/\"&gt;Terrastation&lt;/a&gt;   |   Dex - &lt;a href=\"https://defillama.com/protocol/terraswap\"&gt;TerraSwap&lt;/a&gt; or &lt;a href=\"https://defillama.com/protocol/astroport\"&gt;AstroPort&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Terra is flag-shipped by the successes of Anchor Protocol and their stablecoin ecosystem that has a presence among most major defi networks thanks to the Cosmos network. But the option in Terra network itself are limited. I would only recommend using Terra if you want exposure to LUNA or if you&amp;#39;re in need of a Defi savings account. But I would consider exposure to LUNA as having medium to high risks, which is beyond the scope of this post.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;For low-risk Defi participation, I can only recommend depositing UST in Anchor&amp;#39;s Saving Protocol.&lt;/strong&gt; The expected yield is 19% annual percentage yield. By using &lt;a href=\"https://defillama.com/protocol/anchor\"&gt;Anchor&amp;#39;s&lt;/a&gt; savings protocol, you&amp;#39;ll be reward from the protocol&amp;#39;s revenue streams from (1) borrowing interest and (2) staking deposits. This revenue comes from another feature in Anchor that allows users to deposit LUNA or ETH and borrow UST, the native algorithmic stablecoin.&lt;/p&gt;\n\n&lt;p&gt;You can further optimize your yield via strategies like using your deposit as collateral for other protocols, but again those are medium to high risk strategies that go beyond the scope.&lt;/p&gt;\n\n&lt;p&gt;Downsides: A ~19% savings account is an undoubtedly insane yield granted traditional banks can barely offer 1% for a similar product. But this isn&amp;#39;t too far fetched given that Defi flips the model and instead of getting 20% of the revenue while banks get 80%, Defi users get 100%. The risks are explained thoroughly &lt;a href=\"https://cryptorisks.substack.com/p/ust-december-2021\"&gt;here&lt;/a&gt;. The ones that stand out are de-pegging, regulatory risk, and lowered yield as a result of &lt;a href=\"https://cryptorisks.substack.com/p/on-abracadabra-degenbox-strategies\"&gt;decreasing protocol revenue&lt;/a&gt;.  You&amp;#39;ll be earning rewards in UST.&lt;/p&gt;\n\n&lt;h1&gt;Avalanche -  Low fees ($0.3) but can high (&amp;gt;$5) when congested&lt;/h1&gt;\n\n&lt;p&gt;Wallet - &lt;a href=\"https://metamask.io/\"&gt;Metamask&lt;/a&gt;   |   Dex - &lt;a href=\"https://defillama.com/protocol/trader-joe\"&gt;TraderJoe&lt;/a&gt; or &lt;a href=\"https://defillama.com/protocol/sushiswap\"&gt;SushiSwap&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;A lot of big Defi players such as Aave, Curve, and Abracadabra also built on Avalanche, which is why it was able to rapidly grow when it first launched. That and it&amp;#39;s $180M &lt;a href=\"https://medium.com/avalancheavax/avalanche-foundation-announces-180m-defi-incentive-program-d320fdfafff7\"&gt;incentive program&lt;/a&gt;, which dwarfed Polygon&amp;#39;s incentive program.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;With Avalanche, you could do the same Aave + Curve strategy and get a similar yield.&lt;/strong&gt; But, unlike Polygon (&lt;a href=\"https://forum.abracadabra.money/t/aip-3-deploy-abracadabra-money-on-polygon-pos/864\"&gt;at least not yet&lt;/a&gt;), Avalanche has Abracadabra, which is a reputable dapp that&amp;#39;s also built on Ethereum. So an &lt;strong&gt;alternative low-risk strategy would be to use AAVE + Abracadabra.&lt;/strong&gt; The expected yield is 4-6%. You&amp;#39;ll be borrowing and lending on &lt;a href=\"https://defillama.com/protocol/aave\"&gt;Aave&lt;/a&gt; and providing liquidity on &lt;a href=\"https://defillama.com/protocol/curve\"&gt;Curve&lt;/a&gt; or &lt;a href=\"https://defillama.com/protocol/abracadabra\"&gt;Abracadabra&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Under the hood, you&amp;#39;re using Curve to provide liquidity for stablecoins that includes its algorithmic stablecoin, Magic Internet Money (MIM). The revenue comes from a liquidity fee that traders pay to swap between these stablecoins pairs. Again, you don&amp;#39;t need to know any more about the protocol but you can read more about it &lt;a href=\"https://medium.com/abracadabra-money/abracadabra-spell-and-magic-internet-money-a563637ce92e\"&gt;here&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;Downsides: Again, you&amp;#39;re borrowing and lending, which makes you vulnerable to liquidation risks if you&amp;#39;re mismanaging your assets. By using Abracadabra, which works on top of Curve, you&amp;#39;re increasing your exposure to the smart contracts of three protocols. In Aave, you&amp;#39;ll be earning rewards in wrapped AVAX and, in Abracadabra, in the protocol token, SPELL (likewise to TOKE, protocol tokens are not as ideal to hold as network tokens).&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;---&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll end this post with these four networks that I believe present the best opportunities at a low-risk based on factors that include total value locked and history among others. This also isn&amp;#39;t a list to rank Defi ecosystems, I think each have their own benefits, opportunities, and risks. I know there are other promising networks out there with equally good, if not better opportunities. I&amp;#39;ll be making a follow-up posts on them. But for now, thanks to anyone who read up to this point!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 366,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?auto=webp&amp;s=3b2a6cadcf175e7b6934d143cf3b5d1978639d43",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=0c5b3665287cd29680e9d291d94b751c080fde6f",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=d7e26e3dd005cd8f8087d98f847ab8996ef006c5",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=bda481b8d537cf7bfd3890c75d414b435be10ddd",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=4ad0a2b48b190f1d22ad85d05a5a11ecf06b95de",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=af87657d4879e0a086b5809b412d3cf154ee0764",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=829f9de305b30b51832f664c9703bd65edf4a706",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "4jPdiaVD-s35AxplTrYPcbo-8BUjZDBgXOuWFC8TM1Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/s552ks/ive_lived_and_breathed_defi_for_over_a_year_now/",
  "subreddit": "CryptoCurrency",
  "id": "s552ks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Defi, decentralized finance, is often referred to as the Wild Wild West of\nCrypto. But after journeying in Defi for over a year, I've learned that the West\nis only 'wild' for the cowboys and mercenaries—they are known as 'degens' around\nthese parts. For this post, I'll provide ways for you to…"
}