{
  "author": "wpeironnet",
  "original_created_utc": 1645820515,
  "title": "If you are looking to donate crypto to Ukraine for relief / aid… don’t. But first understand why.",
  "created_utc": 1645857267,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see a lot of people wanting to support Ukrainians who are currently being invaded by fascist Russia. &lt;/p&gt;\n\n&lt;p&gt;Financially supporting the Ukrainian army or people who are suffering is a fantastic and noble thing to do. It’s the right thing do and the least most of us can do.&lt;/p&gt;\n\n&lt;p&gt;I wish I could buy the bullets that personally kill the Russian invaders. But it’s not that simple.&lt;/p&gt;\n\n&lt;p&gt;As we all know scammers have a vacuum for a heart and are trying to profit off of this crisis. “Ukrainian relief funds” are more than likely scammers accepting your thoughtful donations. Worse yet even Russians creating fake donations to soak up the funds for their cause.&lt;/p&gt;\n\n&lt;p&gt;The ONLY way I would donate is by sending it directly to someone you know of in Ukraine who needs it or can distribute it. &lt;/p&gt;\n\n&lt;p&gt;Do NOT let your guard down. Scammers will profit off of anything even this. Yes it is a new low.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/t1di3u/if_you_are_looking_to_donate_crypto_to_ukraine/",
  "subreddit": "CryptoCurrency",
  "id": "t1di3u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see a lot of people wanting to support Ukrainians who are currently being\ninvaded by fascist Russia.\n\nFinancially supporting the Ukrainian army or people who are suffering is a\nfantastic and noble thing to do. It’s the right thing do and the least most of\nus can do.\n\nI wish I could buy the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウクライナの人たちを支援したい、という人たちがたくさんいますね。\nファシスト・ロシアに侵略された\n\nウクライナ軍や苦しんでいる人たちを金銭的に支援することは\n素晴らしいことであり、尊いことだと思います。それは正しいことであり、多くの人がする最低限のことです。\n私たちにできること\n\n買えればいいのですが・・・。",
      "title": "もしあなたがウクライナの救済/援助のために暗号を寄付しようとしているのなら...やめましょう。しかし、まずその理由を理解してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多人想支持乌克兰人，他们目前正被法西斯的俄罗斯人入侵。\n被法西斯俄罗斯入侵的乌克兰人。\n\n在经济上支持乌克兰军队或正在遭受苦难的人们是一个\n这是一件了不起和高尚的事情。这是正确的事情，也是我们大多数人至少可以做的事情。\n我们能做的。\n\n我希望我可以购买...",
      "title": "如果你想向乌克兰捐赠加密货币用于救济/援助...不要。但首先要明白为什么。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多人想支持烏克蘭人，他們目前正被法西斯的俄羅斯人入侵。\n被法西斯俄羅斯入侵的烏克蘭人。\n\n在經濟上支持烏克蘭軍隊或正在遭受苦難的人們是一個\n這是一件了不起和高尚的事情。這是正確的事情，也是我們大多數人至少可以做的事情。\n我們能做的。\n\n我希望我可以購買...",
      "title": "如果你想向烏克蘭捐贈加密貨幣用於救濟/援助...不要。但首先要明白爲什麼。"
    }
  ]
}