{
  "author": "ajay_2739",
  "original_created_utc": 1634535024,
  "title": "Why do Women's clothes in general reveal more skin than Men's clothing?",
  "created_utc": 1634562289,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In almost every category of clothing the women&#39; clothing items reveal more skin than Men&#39;s clothes. Apart from this women&#39;s clothes are also more likely to be form fitting. </p>\n\n<p>How did this &#39;Sexualization&#39; of women&#39;s clothes come about? Before 20th century it seems clothes of both men and women were similar in terms of material to skin ratio. The difference seems to have increased after the WW2. What were the socio-economic and cultural changes that lead to this change?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qag7k4/why_do_womens_clothes_in_general_reveal_more_skin/",
  "subreddit": "AskHistorians",
  "id": "qag7k4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In almost every category of clothing the women' clothing items reveal more skin\nthan Men's clothes. Apart from this women's clothes are also more likely to be\nform fitting.\n\nHow did this 'Sexualization' of women's clothes come about? Before 20th century\nit seems clothes of both men and women were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほとんどのカテゴリーの服で、女性用の服は男性用の服よりも肌を露出しています。\n男性用の服よりも肌の露出が多いのです。また、女性の服は体にフィットしていることが多いです。\n体にフィットしています。\n\n女性服の「セクシュアル化」はどのようにして起こったのでしょうか？20世紀以前は\n男性も女性も服は...だったようです。",
      "title": "一般的に女性の服は男性の服に比べて肌の露出が多いのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在几乎所有的服装类别中，女性服装项目比男性服装更容易暴露皮肤。\n比男性服装更多。除此以外，女性的衣服也更可能是\n合身。\n\n女性服装的这种 \"性 \"化是如何产生的？在20世纪之前\n男人和女人的衣服似乎都是......",
      "title": "为什么一般来说，女性的衣服比男性的衣服更容易暴露皮肤？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在幾乎所有的服裝類別中，女性服裝項目比男性服裝更容易暴露皮膚。\n比男性服裝更多。除此以外，女性的衣服也更可能是\n合身。\n\n女性服裝的這種 \"性 \"化是如何產生的？在20世紀之前\n男人和女人的衣服似乎都是......",
      "title": "爲什麼一般來說，女性的衣服比男性的衣服更容易暴露皮膚？"
    }
  ]
}