{
  "author": "crypto_grandma",
  "the_new_excerpt": "Let me start by saying that I don't think we've entered a bear market. As others\nhave said, I think the dip we're experiencing now is similar to what happened in\nSeptember 2017 (China fud, of course) during the last bull run, which was a\nminor blip (crashing from around 5k to 3k) before going on to…",
  "original_created_utc": 1622284273,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に言っておきますが、私は今が弱気な市場になったとは思っていません。他の人が言うように\n今、私たちが経験しているディップは、前回のブルランで2017年9月に起こったことに似ていると思います。\n前回のブルラン中の2017年9月（もちろん中国のファッド）、これは\n些細な一撃（5k前後から3kまで暴落）の後に...",
      "title": "投資の観点から見ると、弱気な市場はこれまでで最高の出来事になる可能性があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我先说，我不认为我们已经进入了熊市。正如其他人\n正如其他人所说，我认为我们现在所经历的下跌类似于上一轮牛市中2017年9月发生的情况（当然是中国的假货）。\n2017年9月（当然是中国的假货），在上一轮牛市中，那是一个\n小插曲（从5K左右崩溃到3K），然后再继续......",
      "title": "从投资的角度来看，熊市可能是发生在你身上最好的事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我先說，我不認爲我們已經進入了熊市。正如其他人\n正如其他人所說，我認爲我們現在所經歷的下跌類似於上一輪牛市中2017年9月發生的情況（當然是中國的假貨）。\n2017年9月（當然是中國的假貨），在上一輪牛市中，那是一個\n小插曲（從5K左右崩潰到3K），然後再繼續......",
      "title": "從投資的角度來看，熊市可能是發生在你身上最好的事情。"
    }
  ],
  "title": "From an investment point of view, a bear market can be the best thing that's ever happened to you.",
  "created_utc": 1622294641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me start by saying that I don&#39;t think we&#39;ve entered a bear market. As others have said, I think the dip we&#39;re experiencing now is similar to what happened in September 2017 (China fud, of course) during the last bull run, which was a minor blip (crashing from around 5k to 3k) before going on to make a new ath of 20k just 3 months later. But obviously I don&#39;t know what&#39;s going to happen next anymore than the rest of you.</p>\n\n<p>Either way, if or when a prolonged bear market does arrive, you don&#39;t necessarily have to see this as being such a bad thing. </p>\n\n<p>Thanks to the 2-3 years of accumulating during the last bear market, I was able to accumulate over 10x the amount of crypto that I had during the bull market, even though that 10x was actually worth less in fiat value come March 2020 (I was down 50% after 2 and a half years in this game. Not a wonderful feeling at the time I&#39;ve got to say). Those painful days, weeks, months and years turned out to be an absolute blessing in disguise. I don&#39;t have a high paying job, and I never would have come close to owning the amount of crypto that I currently own had the prices continued to go up and up.</p>\n\n<p>The previous bear market put me in a great position entering this bull run. I&#39;ve even started profit taking for the first time and have managed to take out all of my initial investment while still keeping a significant amount of crypto, way more than I could have imagined in 2017.</p>\n\n<p>Just like you, I want to see the prices going up, and would really rather not enter another bear market right now. But sometimes the things we want are not necessarily what we need, and sometimes the things we fear the most can actually turn out to be the best thing that can happen for us.</p>\n\n<p>To tweak a Warren Buffet quote:</p>\n\n<p><em>&quot;<del>the stock market</del> Crypto is a device for transferring money from the impatient to the patient.”</em></p>\n\n<p>Bear or bull, patience is the key.</p>\n\n<p>Keep learning, keep stacking <strong>what you can afford</strong> to stack, stay safe and enjoy the ride!</p>\n</div><!-- SC_ON -->",
  "score": 1523,
  "permalink": "/r/CryptoCurrency/comments/nnko30/from_an_investment_point_of_view_a_bear_market/",
  "subreddit": "CryptoCurrency",
  "id": "nnko30",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296492
}