{
  "author": "Onsyde",
  "original_created_utc": 1627266621,
  "title": "5th green day confirmed: Bitcoin has never had 5 green days in a row during a bear market, going back to 2013",
  "created_utc": 1627273812,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was looking back yesterday trying to find 5 straight green days inside a bear market. I didn&#39;t find one single instance of this going all the way back to 2013 when I stopped counting. If you want you can go back and confirm this. Something I did notice was that 5 straight green days is also rare even in bull markets. The last time it&#39;s happened was April 8-12. Huge bullish signal for bitcoin.</p>\n\n<p>Edit: just realized that April 8-12 is only 4 days...it goes back even further than that</p>\n</div><!-- SC_ON -->",
  "score": 189,
  "permalink": "/r/CryptoCurrency/comments/orpkwh/5th_green_day_confirmed_bitcoin_has_never_had_5/",
  "subreddit": "CryptoCurrency",
  "id": "orpkwh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was looking back yesterday trying to find 5 straight green days inside a bear\nmarket. I didn't find one single instance of this going all the way back to 2013\nwhen I stopped counting. If you want you can go back and confirm this. Something\nI did notice was that 5 straight green days is also rare…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は昨日、ベアマーケットの中で5日間連続してグリーンの日を見つけようと振り返っていました。\nを探していました。2013年までさかのぼっても、一度も見つかりませんでした。\n私が数えるのをやめた2013年まで遡っても一度も見つかりませんでした。もし望むなら、過去にさかのぼってこれを確認することができます。何か\n5日連続で緑の日が続くのも珍しいということに気がついた。",
      "title": "5回目のグリーンデー決定 ビットコインは2013年まで遡っても、弱気相場の中で5回連続してグリーンデーを迎えたことはない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我昨天回顾了一下，试图找到熊市中的5个连续绿日\n市场内的5个连续绿日。我没有找到一个这样的例子，可以一直追溯到2013年\n当我停止计数时。如果你愿意，你可以回去确认一下。一些事情\n我确实注意到，连续5个绿天也很罕见......",
      "title": "第5个绿化日确认。比特币在熊市中从未连续出现过5个绿日，可追溯到2013年"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我昨天回顧了一下，試圖找到熊市中的5個連續綠日\n市場內的5個連續綠日。我沒有找到一個這樣的例子，可以一直追溯到2013年\n當我停止計數時。如果你願意，你可以回去確認一下。一些事情\n我確實注意到，連續5個綠天也很罕見......",
      "title": "第5個綠化日確認。比特幣在熊市中從未連續出現過5個綠日，可追溯到2013年"
    }
  ]
}