{
  "author": "sped_izzo",
  "original_created_utc": 1659026913,
  "title": "Start of the next bull run?",
  "created_utc": 1659105716,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes, we are &amp;quot;officially&amp;quot; in a recession, but are we getting towards the end of it? Aside from the great recession of 2008, they typically last around 8 months.  We had 2 quarters of negative GDP growth, but the economy is still solid.  I assume inflation will come down in the July CPI reading due to gas, some food, and new building construction costs coming down?&lt;/p&gt;\n\n&lt;p&gt;Powell said 100 basis point hikes are on the table, but I can&amp;#39;t see that a reality.  I think we get a 50 basis point hike when the fed returns from their vacation.&lt;/p&gt;\n\n&lt;p&gt;With supply chains getting back on track, the democrats probably turning the money printers on heading into the mid terms (student loan cancellation?), and the federal reserve being more dovish, what stands in the way of the markets?&lt;/p&gt;\n\n&lt;p&gt;We still have the war in Ukraine, but all of that is already baked into the markets... any good news will be good news?&lt;/p&gt;\n\n&lt;p&gt;Not to mention everything going on with ETH, the next BTC halving, companies like Disney jumping into Matic...&lt;/p&gt;\n\n&lt;p&gt;Crypto endured a war in Russia, COVID, major crypto like Luna going to 0, firms like 3AC and Celsisus, Voyager, etc all collapsing or having withdrawal issues.  What else is next?&lt;/p&gt;\n\n&lt;p&gt;Edit: I am not saying this is a bull run start, I am just curious to hear people&amp;#39;s opinions given current events.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/waeuzd/start_of_the_next_bull_run/",
  "subreddit": "CryptoCurrency",
  "id": "waeuzd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Yes, we are \"officially\" in a recession, but are we getting towards the end of\nit? Aside from the great recession of 2008, they typically last around 8 months.\nWe had 2 quarters of negative GDP growth, but the economy is still solid. I\nassume inflation will come down in the July CPI reading due to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かに「公式には」不景気だが、終息に向かっているのだろうか？\n終わろうとしているのでしょうか。2008年の大不況を除けば、不況は通常8ヶ月程度続きます。\nGDPは2四半期にわたってマイナス成長でしたが、経済はまだ堅調です。I\n7月の消費者物価指数ではインフレ率が下がると思いますが、その理由は...。",
      "title": "次のブルランの始まり？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，我们 \"正式 \"处于经济衰退中，但我们是否正在走向衰退的终点？\n了吗？除了2008年的大衰退之外，它们通常持续8个月左右。\n我们有两个季度的GDP负增长，但经济仍然稳固。I\n我认为通货膨胀将在7月的CPI读数中下降，因为...",
      "title": "下一轮牛市的开始？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，我們 \"正式 \"處於經濟衰退中，但我們是否正在走向衰退的終點？\n了嗎？除了2008年的大衰退之外，它們通常持續8個月左右。\n我們有兩個季度的GDP負增長，但經濟仍然穩固。I\n我認爲通貨膨脹將在7月的CPI讀數中下降，因爲...",
      "title": "下一輪牛市的開始？"
    }
  ]
}