{
  "author": "decopper",
  "original_created_utc": 1630346204,
  "title": "Listening to billionaires will make you poor",
  "created_utc": 1630359050,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Billionaires used to be these magical mythical beings. Then Twitter came along. And we know now, they are just humans who have made a couple of good decisions.</p>\n\n<p>Never revere any single person. Much less a guy with a lot of money. He might have just been reckless enough to take a risk at the right time, and came out ahead. That doesn&#39;t mean he is super human. It just means that risks pay off sometimes, and he is a living embodiment of that.</p>\n\n<p>By definition, we&#39;re all flawed. Even the rich ones who think the world revolves around them. In a slightly different reality, they&#39;d be begging in the streets.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/pendg6/listening_to_billionaires_will_make_you_poor/",
  "subreddit": "CryptoCurrency",
  "id": "pendg6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Billionaires used to be these magical mythical beings. Then Twitter came along.\nAnd we know now, they are just humans who have made a couple of good decisions.\n\nNever revere any single person. Much less a guy with a lot of money. He might\nhave just been reckless enough to take a risk at the right…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "億万長者といえば、かつては魔法のような神話的存在でした。その後、Twitterが登場しました。\nそして今では、彼らはいくつかの良い決断をしただけの人間だと分かっています。\n\n一人の人間を崇拝してはいけません。ましてや、大金を持っている人を崇めてはいけません。彼はもしかしたら\n彼は無謀にも適切な時期にリスクを取っただけかもしれません...",
      "title": "億万長者の話を聞くと貧乏になる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "亿万富翁曾经是这些神奇的神话般的存在。然后推特出现了。\n我们现在知道，他们只是做了几个好决定的人。\n\n永远不要崇尚任何一个人。更不用说一个有很多钱的人了。他可能\n他可能只是鲁莽地在正确的时候冒了一次险...",
      "title": "听从亿万富翁的意见会让你变穷"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "億萬富翁曾經是這些神奇的神話般的存在。然後推特出現了。\n我們現在知道，他們只是做了幾個好決定的人。\n\n永遠不要崇尚任何一個人。更不用說一個有很多錢的人了。他可能\n他可能只是魯莽地在正確的時候冒了一次險...",
      "title": "聽從億萬富翁的意見會讓你變窮"
    }
  ]
}