{
  "author": "No_Dog_7969",
  "original_created_utc": 1646301424,
  "title": "How much is a cup of butter? I found online that it is 2 sticks????? What the fuck is sticks??",
  "created_utc": 1646317888,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I found online that grams and cups are not interchangeable so can please someone that has &amp;quot;a stick&amp;quot; tell me what quantity is written on it?&lt;/p&gt;\n\n&lt;p&gt;Edit: thanks for the quick reply, I&amp;#39;m kinda high and trying to make some cookies. Y&amp;#39;all saved me&lt;/p&gt;\n\n&lt;p&gt;Edit 2: don&amp;#39;t worry, I figured it out thanks to you and it worked. Thank you all again for the support&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/t5o5qc/how_much_is_a_cup_of_butter_i_found_online_that/",
  "subreddit": "NoStupidQuestions",
  "id": "t5o5qc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I found online that grams and cups are not interchangeable so can please someone\nthat has \"a stick\" tell me what quantity is written on it?\n\nEdit: thanks for the quick reply, I'm kinda high and trying to make some\ncookies. Y'all saved me\n\nEdit 2: don't worry, I figured it out thanks to you and it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ネットで調べたら、グラムとカップは互換性がないらしいので、どなたかお願いします。\n棒」をお持ちの方は、棒に書かれている分量を教えてください。\n\n編集：迅速な回答ありがとうございました。\nクッキーです。助かった\n\n編集2：心配しないでください、あなたのおかげでわかりました、そしてそれは...",
      "title": "バター1カップはいくらですか？ネットで調べたら2スティックと書いてあったのですが？スティックってなんだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在网上发现，克和杯是不能互换的，所以能不能请有 \"棍子 \"的人告诉我上面写的是什么量？\n有 \"棍子 \"的人告诉我上面写的是什么量？\n\n编辑：谢谢你的快速回复，我现在有点兴奋，想做一些\n饼干。你们都救了我\n\n编辑2：别担心，我想明白了，多亏了你和它...",
      "title": "一杯黄油是多少钱？我在网上发现，它是2支????? 棍子是什么鬼东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在網上發現，克和杯是不能互換的，所以能不能請有 \"棍子 \"的人告訴我上面寫的是什麼量？\n有 \"棍子 \"的人告訴我上面寫的是什麼量？\n\n編輯：謝謝你的快速回復，我現在有點興奮，想做一些\n餅乾。你們都救了我\n\n編輯2：別擔心，我想明白了，多虧了你和它...",
      "title": "一杯黃油是多少錢？我在網上發現，它是2支????? 棍子是什麼鬼東西？"
    }
  ]
}