{
  "author": "SuburbianJesus",
  "the_new_excerpt": "So today I bought 0.06 Bitcoin and it's a rather exciting experience. My life\nhas been quite the shit-storm these last two years.\n\nDue to a combination of making my own mistakes and finding out my parents'\nactual financial position I had to take out a few loans and put my plans on\npurchasing my…",
  "original_created_utc": 1610820259,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以今天我买了0.06个比特币，这是一次相当刺激的体验。我的人生\n这两年来，已经相当糟糕了。\n\n由于我自己的错误和发现我父母的错误相结合。\n实际财务状况，我不得不借了几笔钱，把我的计划。\n购买我的...",
      "title": "为一个童话故事的结局干杯。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以今天我買了0.06個比特幣，這是一次相當刺激的體驗。我的人生\n這兩年來，已經相當糟糕了。\n\n由於我自己的錯誤和發現我父母的錯誤相結合。\n實際財務狀況，我不得不借了幾筆錢，把我的計劃。\n購買我的...",
      "title": "爲一個童話故事的結局乾杯。"
    }
  ],
  "title": "Here's to a fairy tale ending.",
  "created_utc": 1610884902,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So today I bought 0.06 Bitcoin and it&#39;s a rather exciting experience. My life has been quite the shit-storm these last two years. </p>\n\n<p>Due to a combination of making my own mistakes and finding out my parents&#39; actual financial position I had to take out a few loans and put my plans on purchasing my first property on hold. I always knew things weren&#39;t the brightest for them, but holy shit. Long story short they are due to retire in 5 years, mountains of debt and still renting. </p>\n\n<p>Some of these success stories like giving your folks a new beginning, buying homes, have givin me the tingies and hope for the future. I&#39;m so happy for y&#39;all.</p>\n\n<p>Before judgement roles in, I put everything I can to get out of debt, I have purchased my share by voluntarily working overtime and staying on permanent night shift. Just had to throw that in there before the &quot;you are in no place&quot; comments role in.</p>\n\n<p>Good luck to all of you, and hopefully I can return with my own heartwarming story in a few years.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/kynu0s/heres_to_a_fairy_tale_ending/",
  "subreddit": "Bitcoin",
  "id": "kynu0s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311212244
}