{
  "author": "KrispyDangus",
  "original_created_utc": 1647012472,
  "title": "How are middle/lower-middle class Americans supposed to ditch oil &amp; gas when electric vehicles are so expensive?",
  "created_utc": 1647021117,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just want to preface that I&amp;#39;m not an advocate for oil and gas. But with prices going up, I can&amp;#39;t see how anybody is going to be able to save money and offset the cost by switching to an EV. It seems like a necessity to continue production until we can normalize the pricing. &lt;/p&gt;\n\n&lt;p&gt;I dunno man, it seems like the wealth gap is just getting larger by the minute and I can&amp;#39;t afford to save for something if prices keep spiking at the rate they are. Nobody in congress seems to care about HOW to get an EV - only that the common people should, which they can&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 144,
  "permalink": "/r/TooAfraidToAsk/comments/tbsjls/how_are_middlelowermiddle_class_americans/",
  "subreddit": "TooAfraidToAsk",
  "id": "tbsjls",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just want to preface that I'm not an advocate for oil and gas. But with prices\ngoing up, I can't see how anybody is going to be able to save money and offset\nthe cost by switching to an EV. It seems like a necessity to continue production\nuntil we can normalize the pricing.\n\nI dunno man, it seems…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "前置きが長くなりましたが、私は石油やガスを擁護しているわけではありません。しかし、この価格では\nこのままでは、誰もお金を節約したり、相殺したりすることはできないでしょう。\nEVに乗り換えることで、コストを削減することができます。生産継続の必要性\n価格設定を正常化するまでは。\n\nどうでしょう、それは...",
      "title": "電気自動車がこんなに高いのに、アメリカの中流・下流階級はどうやって石油やガスを捨てるというのだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只想先声明，我不是石油和天然气的倡导者。但随着价格\n涨，我看不出有谁能通过改用电动车来省钱和抵消成本。\n转用电动车的成本。继续生产似乎是一种必要\n直到我们能够使价格正常化。\n\n我不知道，这似乎...",
      "title": "在电动车如此昂贵的情况下，中/中下层美国人如何能抛弃石油和amp; gas呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只想先聲明，我不是石油和天然氣的倡導者。但隨着價格\n漲，我看不出有誰能通過改用電動車來省錢和抵消成本。\n轉用電動車的成本。繼續生產似乎是一種必要\n直到我們能夠使價格正常化。\n\n我不知道，這似乎...",
      "title": "在電動車如此昂貴的情況下，中/中下層美國人如何能拋棄石油和amp; gas呢？"
    }
  ]
}