{
  "author": "LibraProtocol",
  "original_created_utc": 1631858028,
  "title": "Is the term \"LatinX\" cringy and culturally ignorant?",
  "created_utc": 1631887889,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like... The term just sounds so.. ignorant. The only people I ever see using it are super american college people. Like, they keep trying to make it a thing and it is not a thing. It literally does not work in Spanish. It is only really pronouncible in English. </p>\n\n<p>And isn&#39;t this just a case of Americans trying to force their weird hang ups on everyone else? Like, it feels like Americans are trying to force their weird cultural hang ups on other people and Change their language. Romantic languages are gendered languages. It&#39;s in the root of their histories. Sorry but you can&#39;t &quot;ungender&quot; these languages.</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/ppuf5f/is_the_term_latinx_cringy_and_culturally_ignorant/",
  "subreddit": "TooAfraidToAsk",
  "id": "ppuf5f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like... The term just sounds so.. ignorant. The only people I ever see using it\nare super american college people. Like, they keep trying to make it a thing and\nit is not a thing. It literally does not work in Spanish. It is only really\npronouncible in English.\n\nAnd isn't this just a case of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば... この言葉はとても...無知な感じがします。使っているのを見かけるのは\n使っているのを見たことがあるのは、アメリカの大学関係者だけです。彼らはこの言葉を流行らせようとしていますが\nそうではありません。文字通り、スペイン語では使えません。使えるのは\n英語でしか発音できません。\n\nそして、これはただのケースではありません...。",
      "title": "\"LatinX \"という言葉は陳腐で文化的に無知なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像... 这个词听起来如此... ...无知。我只看到过使用这个词的人\n是超级美国大学的人。就像，他们一直试图让它成为一件事，但\n它不是一个东西。它在西班牙语中根本不起作用。它只有在\n它只有在英语中才是真正的发音。\n\n而这不就是一个......的例子吗？",
      "title": "拉美裔 \"这个词是不是很蹩脚，在文化上很无知？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像... 這個詞聽起來如此... ...無知。我只看到過使用這個詞的人\n是超級美國大學的人。就像，他們一直試圖讓它成爲一件事，但\n它不是一個東西。它在西班牙語中根本不起作用。它只有在\n它只有在英語中才是真正的發音。\n\n而這不就是一個......的例子嗎？",
      "title": "拉美裔 \"這個詞是不是很蹩腳，在文化上很無知？"
    }
  ]
}