{
  "author": "Drnelk",
  "original_created_utc": 1639533096,
  "title": "What industries / specific companies are you looking forward to crypto killing off?",
  "created_utc": 1639564519,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everybody in this sub who isn&amp;#39;t a troll assumes that crypto it&amp;#39;s going to replace a number of different Industries, most obviously banking and especially money transfer companies. I was surprised to see the vehement excitement with which people in here greeted the assumed imminent death of Ticketmaster and its competitors at the hand of blockchain tech, but hurray for that!&lt;/p&gt;\n\n&lt;p&gt;What other Industries or specific companies do you think crypto is going to kill off? Are there any that you&amp;#39;re so confident it will destroy that you are shorting them? Are there any companies you just hope it will kill off because you hate them so much?&lt;/p&gt;\n\n&lt;p&gt;Edit: is there any type of crime that blockchain makes impossible?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 237,
  "permalink": "/r/CryptoCurrency/comments/rgncg8/what_industries_specific_companies_are_you/",
  "subreddit": "CryptoCurrency",
  "id": "rgncg8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everybody in this sub who isn't a troll assumes that crypto it's going to\nreplace a number of different Industries, most obviously banking and especially\nmoney transfer companies. I was surprised to see the vehement excitement with\nwhich people in here greeted the assumed imminent death of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトの荒らしじゃない人はみんな、暗号はこうなると思っています。\n様々な産業に取って代わります。特に、銀行、特に\n送金業者。私は驚いたのです。\nここの人たちは、死が差し迫っていると思われる...を迎えた。",
      "title": "暗号が消滅することを楽しみにしている業界/特定の企業は何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这个子里，每个不是巨头的人都认为加密货币会\n取代一些不同的行业，最明显的是银行业，特别是\n汇款公司。我很惊讶地看到，这里的人用强烈的兴奋来迎接\n我很惊讶地看到这里的人对假定的即将死亡的...",
      "title": "你期待哪些行业/具体公司被加密货币干掉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這個子裏，每個不是巨頭的人都認爲加密貨幣會\n取代一些不同的行業，最明顯的是銀行業，特別是\n匯款公司。我很驚訝地看到，這裏的人用強烈的興奮來迎接\n我很驚訝地看到這裏的人對假定的即將死亡的...",
      "title": "你期待哪些行業/具體公司被加密貨幣幹掉？"
    }
  ]
}