{
  "author": "Holymoses43",
  "the_new_excerpt": "This post is in reference to $GME but it applies to the stock market in general.\nDon’t let anyone tell you when you should or should not buy. Don’t let anyone\ntell you when you should or should not sell. It is your money and your decision.\n3 weeks ago when GameStop touched back down to $40 I was…",
  "original_created_utc": 1615510297,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个帖子是指$GME，但它适用于一般的股市。\n不要让任何人告诉你什么时候该买或不该买。不要让任何人\n告诉你何时应该或不应该出售。这是你的钱和你的决定。\n3周前，当GameStop触及回落到40美元时，我... ...",
      "title": "没有 \"我们\"。股市中没有 \"我们与他们\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個帖子是指$GME，但它適用於一般的股市。\n不要讓任何人告訴你什麼時候該買或不該買。不要讓任何人\n告訴你何時應該或不應該出售。這是你的錢和你的決定。\n3周前，當GameStop觸及回落到40美元時，我... ...",
      "title": "沒有 \"我們\"。股市中沒有 \"我們與他們\"。"
    }
  ],
  "title": "There is no “we”. There is no “us vs them” in the stock market.",
  "created_utc": 1615595056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post is in reference to $GME but it applies to the stock market in general. Don’t let anyone tell you when you should or should not buy. Don’t let anyone tell you when you should or should not sell. It is your money and your decision. 3 weeks ago when GameStop touched back down to $40 I was talked out of going all in. It is my money and I should do what I want with it. If you decide you want to sell GameStop next time it touches $280 or $300 then sell, it is your money. Don’t listen to people here telling you that they are counting on you to hold to stick it to the hedge funds. Trading/investing is a one man game. No one here is going to support you if you go broke so don’t go broke listening to what other people tell you is the right thing to do. Good luck everyone.</p>\n</div><!-- SC_ON -->",
  "score": 2427,
  "permalink": "/r/wallstreetbets/comments/m35gnd/there_is_no_we_there_is_no_us_vs_them_in_the/",
  "subreddit": "wallstreetbets",
  "id": "m35gnd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147386930
}