{
  "author": "ConorIRL1595",
  "original_created_utc": 1631685435,
  "title": "In a deleted scene for the movie Jarhead, the marines are seen in 'the rear' (I'm guessing Saudi Arabia) driving past what seems to be a typical American neighbourhood. What's going on there?",
  "created_utc": 1631724689,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reposting this, as it was incorrectly removed for violating the 20 year rule (Jarhead is about the first Gulf War).</p>\n\n<p>This is the scene in question: <a href=\"https://www.youtube.com/watch?v=x9BUxnVhq7Y\">https://www.youtube.com/watch?v=x9BUxnVhq7Y</a></p>\n\n<p>I had read before that there were Western communities in Saudi Arabia composed mainly of oil workers and their families, is this what that scene is showing? What was life like in those places? Do they exist today?</p>\n\n<p>If that&#39;s not what this is, what is it?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/pok8fj/in_a_deleted_scene_for_the_movie_jarhead_the/",
  "subreddit": "AskHistorians",
  "id": "pok8fj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Reposting this, as it was incorrectly removed for violating the 20 year rule\n(Jarhead is about the first Gulf War).\n\nThis is the scene in question: https://www.youtube.com/watch?v=x9BUxnVhq7Y\n\nI had read before that there were Western communities in Saudi Arabia composed\nmainly of oil workers and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "20年ルール違反で誤って削除されてしまったので再掲\n(Jarheadは第一次湾岸戦争の話）。)\n\nこれが問題のシーンである。https://www.youtube.com/watch?v=x9BUxnVhq7Y\n\nサウジアラビアには、主に石油労働者と......で構成された西洋のコミュニティがあると、以前読んだことがあります。\n前に読んだのは、サウジアラビアには主に石油労働者と...",
      "title": "映画「ジャーヘッド」の削除されたシーンでは、海兵隊員たちが「後方」（サウジアラビアと思われる）で、典型的なアメリカ人の居住区と思われる場所を車で通り過ぎるシーンがある。そこで何が起こっているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "转贴这个，因为它因违反20年规则而被错误地删除了\n(Jarhead是关于第一次海湾战争的）。)\n\n这是有关的场景：https://www.youtube.com/watch?v=x9BUxnVhq7Y\n\n我以前读到过，在沙特阿拉伯有一些西方社区，主要由石油工人和\n主要由石油工人和...",
      "title": "在电影Jarhead的一个被删除的场景中，看到海军陆战队员在 \"后方\"（我猜是沙特阿拉伯）开车经过似乎是一个典型的美国社区。那里发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "轉貼這個，因爲它因違反20年規則而被錯誤地刪除了\n(Jarhead是關於第一次海灣戰爭的）。)\n\n這是有關的場景：https://www.youtube.com/watch?v=x9BUxnVhq7Y\n\n我以前讀到過，在沙特阿拉伯有一些西方社區，主要由石油工人和\n主要由石油工人和...",
      "title": "在電影Jarhead的一個被刪除的場景中，看到海軍陸戰隊員在 \"後方\"（我猜是沙特阿拉伯）開車經過似乎是一個典型的美國社區。那裏發生了什麼？"
    }
  ]
}