{
  "author": "daymonhandz",
  "the_new_excerpt": "I mainly created this thread because of so many users coming here and saying\nbitcoin is old and outdated. These users are very misinformed. They've been fed\nmisinformation by people that are profiting from spreading misinformation.\n\nJust read the bold text if this thread is too long for you. The…",
  "original_created_utc": 1620959493,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がこのスレッドを作ったのは、多くのユーザーがここに来て、ビットコインは時代遅れだと言っているからです。\nビットコインは古い、時代遅れだと言っているユーザーが多いからです。これらのユーザーは非常に誤った情報を持っています。誤った情報を広めて利益を得ている人々によって\n誤った情報を広めることで利益を得ている人々によって誤った情報を与えられています。\n\nこのスレッドが長すぎる場合は、太字のテキストを読むだけです。その...",
      "title": "これは、ビットコインに関する非常に重要なメッセージです。ぜひ時間をかけて読んでみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我创建这个主题主要是因为有很多用户来这里说\n比特币是旧的和过时的。这些用户是非常错误的信息。他们被灌输了\n从传播错误信息中获利的人提供的错误信息。\n\n如果这个主题对你来说太长了，就读读黑体字。这个...",
      "title": "这是一个关于比特币的非常重要的信息。请花时间阅读它。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我創建這個主題主要是因爲有很多用戶來這裏說\n比特幣是舊的和過時的。這些用戶是非常錯誤的信息。他們被灌輸了\n從傳播錯誤信息中獲利的人提供的錯誤信息。\n\n如果這個主題對你來說太長了，就讀讀黑體字。這個...",
      "title": "這是一個關於比特幣的非常重要的信息。請花時間閱讀它。"
    }
  ],
  "title": "This is a very important message about bitcoin. Please take the time to read it.",
  "created_utc": 1620974125,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mainly created this thread because of so many users coming here and saying bitcoin is old and outdated. These users are very misinformed. They&#39;ve been fed misinformation by people that are profiting from spreading misinformation.</p>\n\n<p><strong>Just read the bold text if this thread is too long for you.</strong> The bold text is the summarized version and it contains all of most important information within this long wall of this text. I did this for users who don&#39;t like to read long posts. I know it&#39;s still long.</p>\n\n<p><strong>If you&#39;r a bitcoin veteran and you already know a lot about bitcoin:</strong> Skip straight to the two bold paragraphs second from the bottom. They contain information about most of bitcoin&#39;s recent developments and second layer protocols.</p>\n\n<p><strong>Bitcoin is just a protocol. It was released in 2009</strong></p>\n\n<p><strong>TCP/IP are just protocols that were released in 1972. You could call them the backbone of the internet. Look at how long it took us to get to the internet that we have today, where TCP/IP is the backbone.</strong></p>\n\n<p><a href=\"https://hbr.org/2017/01/the-truth-about-blockchain\"><strong>Click here to read a bit about TCP/IP and blockchain technology.</strong></a></p>\n\n<p>HTTP is just a protocol that was released in 1991. You could call it the backbone of the world wide web.</p>\n\n<p>SMTP is just a protocol that was released in 1982. And IMAP is just a protocol that was released in 1986. You could call these protocols the backbone of email. Many people used to say that email was useless and nobody would ever use it.</p>\n\n<p>TCP/IP was actually developed by cypherpunks just like bitcoin, PGP, and many other great protocols and technologies. In fact, two cypherpunks by the names of Hal and Len actually lived near each other and both helped develop TCP/IP. And they are also two of the three most likely candidates for being Satoshi. But that&#39;s not important.</p>\n\n<p>People used to say computers and the internet was a useless waste too. Computers do use far more electricity than bitcoin mining. So perhaps they were right after all.</p>\n\n<p>We are in the early majority. Bitcoin hasn&#39;t had it&#39;s Windows 95 moment yet, and I&#39;ll explain that statement below.</p>\n\n<p><strong>Do you remember back in 1990 when everyone had heard of the internet but you didn&#39;t know anyone who used it? This is much like bitcoin right now, and even less people use the lightning network. Both are still in beta. February 1991 is when AOL for DOS was released. AOL for DOS made the internet fairly easy for everyone to use. But you still probably didn&#39;t know anyone who used it, and you probably didn&#39;t use it yourself. The internet didn&#39;t start getting popular until Windows 95 came out and most people still didn&#39;t use it for more years.</strong></p>\n\n<p><strong>I can&#39;t wait to see where bitcoin is in a 12 years where it will be 23 years old. It was 1995 back when TCP/IP was 23 years old.</strong> </p>\n\n<p><a href=\"https://www.youtube.com/watch?v=95-yZ-31j9A\"><strong>Click here to watch/listen to some news clips talking about the internet and email back in 1995 when TCP/IP was 23 years old.</strong></a> This was also the same year that Windows 95 was released.</p>\n\n<p><strong>Bitcoin has the potential to be the backbone of the financial system.</strong> And that&#39;s what people like the rocket scientist Michael Saylor are betting on. Michael Saylor is the same MIT graduate that predicted the mobile wave.</p>\n\n<p>I want to inform you all that <strong>I am not a bitcoin maximalist.</strong> And my favorite cryptocurrency is actually an altcoin. I know you&#39;re shocked to hear that. But bitcoin holders please fear not, because <strong>I still see bitcoin as the safest bet. And I also see bitcoin as the only protocol that has the potential to be the backbone of the financial system.</strong> If this happened, then companies and countries would be using on-chain payments to settle large payments. There could be bitcoin backed currencies (like gold backed currencies of the past) and even bitcoin banks. <strong>Hal Finney predicted there would be bitcoin banks in the future all the way back in 2010</strong> Most people would be using second layer payment protocols to send bitcoin in milliseconds and costing almost no fees. And these <strong>second layer protocols like the lightning network take a negligible amount of electricity to operate. Bitcoin can scale to handle as much demand as the world can create because of it&#39;s second layer protocols.</strong></p>\n\n<p>Satoshi didn&#39;t create bitcoin to get rich. <strong>He created bitcoin to allow online payments to be sent directly from one person to another without requiring trust or permission of anyone else.</strong> Over 99% of altcoins were created to enrich their founders and over 99% of them have no future. None of them are as secure, as decentralized, or launched as fairly as bitcoin. <strong>Bitcoin has the most users, largest infrastructure, no premine, no developer fund/tax, no leader, longest track record, is the most secure, is the most decentralized, and bitcoins circulated freely for 18 months before ever having any monetary value which can never even be replicated by an altcoin because the genie is out of the bottle now.</strong> And unlike the founders of every altcoin, Satoshi never cashed out. The issuance schedule and maximum supply of bitcoin are both clearly defined and will never change. Bitcoin development is decentralized and anyone can contribute because Satoshi published bitcoin under the MIT license so that it&#39;s open source and anyone is free to do anything with the source code. Bitcoin protocol rule changes are also decentralized because they require nodes to come to consensus.** All of this is why bitcoin is so vastly different than altcoins.</p>\n\n<p>Cryptocurrency is full of scammers/grifters, ignorance, and people that actually believe the lies because they&#39;ve been sucked into altcoin cults. Gamblers use altcoins for trading/gambling to increase their bitcoin stack <a href=\"http://www.youtube.com/watch?v=T89gsJ2MsG8&amp;t=47m24s\">or even their ETH stack if they don&#39;t understand bitcoin and cryptocurrency,</a> and they aren&#39;t aware that Gary Gensler, the current Chair of the SEC, just said that &quot;a lot of crypto tokens, I won&#39;t call them cryptocurrencies for this moment, are indeed non-compliant securities&quot; this week. And nobody told them that the SEC disregarded previous claims made by Bill Hinman, former director of the SEC’s Division of Corporation Finance, who suggested that offers and sales of ETH are not securities transactions. But enough about that.</p>\n\n<p>Gambling on altcoins can be very profitable during a bull run because the altcoin market is basically a short term casino where you actually have a good chance of winning. It&#39;s a relatively easy way to increase your bitcoin stack. </p>\n\n<p><strong>If you properly handle your private keys, then your bitcoin can&#39;t be stolen or seized and nobody can stop you from sending it to anyone else.</strong> </p>\n\n<p><strong>Any protocol rule change that doesn&#39;t make any previously invalid blocks now valid is called a soft fork.</strong> This would be a miner upgrade and is easier to accomplish, we can give the mining nodes a chance to upgrade, bip9 can be used, or the nodes can just run compatible software.</p>\n\n<p><strong>All protocol rule changes must be agreed upon by fully validating bitcoin nodes.</strong> Even if the mining nodes don&#39;t agree, if the full nodes come to consensus and make a rule change, people will continue to mine as long as it&#39;s profitable to mine, so the miners have to deal with it or piss off and other people will mine. The mining difficulty will adjust every 2016 blocks regardless. So when it comes down to it, only the users who run fully validating bitcoin nodes are in charge of bitcoin. </p>\n\n<p><strong>Fully validating bitcoin nodes must come to consensus on any rule change that makes any previously invalid blocks now valid, and that&#39;s called a hard fork.</strong> This would be a pretty big upgrade, and it would be difficult to pull off with bitcoin because it&#39;s decentralized. And that&#39;s a good thing.</p>\n\n<p><strong>There is a maximum supply of 21 million bitcoin</strong>, and that will never change. Satoshi designed the protocol so that <strong>miners solve a block every 10 minutes on average</strong>. The block reward started at 50 BTC. <strong>The block reward gets divided by 2 every 210,000 blocks</strong> (4 years if the hashrate remained constant), which we call the block reward halving. The block reward is currently 6.25 bitcoin and the next block reward halving will happen around April 2024. And then the block reward will be 3.125 bitcoin. <strong>The mining difficulty adjustments every 2016 blocks</strong> which is approximately 2 weeks. So if it&#39;s profitable for people to mine, then hardware gets turned on and the mining difficulty increases. But if the price of bitcoin lowers so that some hardware is unprofitable to run, then it gets turned off and the mining difficulty decreases. And as the block reward gets divided by 2 every 210 thousand blocks, the <strong>transaction fees will continue to incentivize miners to secure the network even when the block reward is minuscule.</strong></p>\n\n<p>Many users here like to repeat that the last bitcoin wont be mined until 2140. And while it is true that the last satoshi will not be mined until 2140. It is also true that <strong>approximately 97% of bitcoins will be mined by 2032</strong>, and the block reward will just be 0.78125 BTC at that time. But if bitcoin is worth, for example, a million dollars, then the block reward alone in 2032 would be worth more than the current block reward + transaction fees at this time. That&#39;s not even accounting for all of the transaction fees that the miners will also be collecting from the transactions that they include in blocks. </p>\n\n<p>Bitcoin is constantly being developed.  <strong>Bitcoin also has second layer protocols that are constantly being developed and they don&#39;t require any consensus.</strong> So anyone can just create second layer protocols for bitcoin and nobody needs to agree on anything. It&#39;s up to the users of bitcoin if they want to use various second layer protocols that maximize the user experience. <strong>One of bitcoin&#39;s second layer payment protocols is called the lightning network. It&#39;s still in beta but it already allows an unlimited amount of users to send and receive bitcoin transactions in milliseconds for extremely minuscule fees.</strong> </p>\n\n<p><a href=\"https://www.bitfinex.com/\"><strong>Bitfinex</strong></a>, <a href=\"https://www.okcoin.com/\"><strong>Okcoin</strong></a>, and <a href=\"https://beta.strike.me/faq\"><strong>Strike by Zap</strong></a> have already integrated the lightning network so that people can deposit and withdraw bitcoin using it and <a href=\"https://www.kraken.com/\"><strong>Kraken</strong></a> <strong>will be integrating the lightning network later this year.</strong> Kraken even has a US banking charter and <a href=\"https://www.kraken.com/en-us/bank\"><strong>Kraken Bank</strong></a> plans to offer most typical banking services later this year.</p>\n\n<p><strong>For newbies wanting to try out the lightning network:</strong> I only recommend you to use <a href=\"https://muun.com/\"><strong>Muun</strong></a> wallet or <a href=\"https://phoenix.acinq.co/\"><strong>Phoenix</strong></a> wallet. They&#39;re both user friendly and they allow users to send and receive on-chain transactions or lightning transactions, all from the same wallet. <a href=\"https://bluewallet.io/\"><strong>BlueWallet</strong></a> is also a great choice but it&#39;s more advanced than Muun and Phoenix.</p>\n\n<p><strong>For US residents only:</strong> Consider trying out <a href=\"https://beta.strike.me/faq\"><strong>Strike</strong></a> by Zap. It has no fees and it allows Americans to use cash in their bank account to buy bitcoin and have it be sent anywhere in milliseconds using the lightning network. Or they can send a lightning payment and receive cash in their bank. So Americans can use Strike app to fund lightning integrated exchanges with bitcoin instantly, to fund their lightning channels with satoshis, or to make instant bitcoin lightning payments, and all without any fees. I believe that Strike is also capable of sending and receiving on-chain bitcoin payments</p>\n\n<p><strong>Bitcoin has second layer protocols like the lightning network and statechains. The lightning network allows an unlimited amount of users to sent and receive bitcoin in milliseconds for almost no fees, and uses minuscule electricity. Bitcoin also has a second layer protocol called statechains that allow non-custodial off chain transfers which bypass paying transaction fees and waiting for confirmations. And statechains can also be turned directly into lightning channels at will. So statechains allow users to open and close lightning channels without performing any on-chain transactions, without paying a transaction fee, and without waiting for a confirmation.</strong></p>\n\n<p><strong>Bitcoin is also switching to schnorr signatures and activating taproot this year which will improve privacy, security, and efficiency. This will also lower the operating costs of running a node and the transaction fees for exchanges by an expected 30% and it will also allow us to use many more second layer protocols that have been developed. This will also allow us to create massive multi-signature transactions that are substantially smaller in size, and will even allow users to aggregate all the multiple signatures of a transaction into one (multiple signers can produce a joint public key and then jointly sign with a single signature). Shnorr signatures and taproot will also allow us to use the coinswap protocol which is pretty self explanatory, the musig2 protocol which will allow aggregating public keys and signatures, new discreet log contracts which increases privacy and scalability minimizes the trust required in the oracle which provides external data for the contract, and point time locked contracts which will improve the privacy of bitcoin payments using the lightning network. Trustless cross chain atomic swaps should also be available towards the end of this year. Schnorr signatures also makes multi-signature and single-signature transactions indistinguishable on the blockchain so an observer will not even be able to tell if a multi-signature transaction or a trustless cross chain atomic swap has happened by viewing the blockchain. NFTs can also be done on bitcoin and that&#39;s where they were done first back in 2012. There&#39;s also various sidechains in development, including liquid network. There&#39;s the RGB protocol which will allow smart contracts to be done using bitcoin on the lightning network. And much more.</strong></p>\n\n<p><strong>Money (not fiat currency) always evolves in four stages</strong> (this is from the <em>what is money?</em> section of <em>The Nature and Creation of Money</em> chapter of a college course on <em>Principles of Macroeconomics</em>). <strong>Bitcoin is currently going through the second stage of the evolution of money, which is a store of value.</strong> The next stage is a widely used medium of exchange. Bitcoin may evolve into the third stage in 5 years, in 7 years, in 12 years, or <strong>bitcoin may never evolve passed the second stage</strong>. The final stage of the evolution of money is a unit of account. Bitcoin is also currently going through price discovery. <strong>Bitcoin&#39;s true value needs to be found before it will ever be a widely used medium of exchange The lightning network also to be adopted by the users, merchants, and exchanges before it&#39;s even possible for bitcoin to evolve into a widely used medium of exchange.</strong></p>\n</div><!-- SC_ON -->",
  "score": 4528,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/CbNVJx6vviy9XjA9MZSWx1SWmLzWxOmCYXHcj8GPkoE.jpg?auto=webp&s=6336ff37d93b27cf28ed1ebb87429adecde1553d",
          "width": 2000,
          "height": 940
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/CbNVJx6vviy9XjA9MZSWx1SWmLzWxOmCYXHcj8GPkoE.jpg?width=108&crop=smart&auto=webp&s=c73a5b5899cc069a900e285bad9847976272c486",
            "width": 108,
            "height": 50
          },
          {
            "url": "https://external-preview.redd.it/CbNVJx6vviy9XjA9MZSWx1SWmLzWxOmCYXHcj8GPkoE.jpg?width=216&crop=smart&auto=webp&s=53c4cbda0ac2a89e770f32bd75dbb6fc75ca1b08",
            "width": 216,
            "height": 101
          },
          {
            "url": "https://external-preview.redd.it/CbNVJx6vviy9XjA9MZSWx1SWmLzWxOmCYXHcj8GPkoE.jpg?width=320&crop=smart&auto=webp&s=d04dc16bf37f557da18ad9897a4f2e034b08e7b8",
            "width": 320,
            "height": 150
          },
          {
            "url": "https://external-preview.redd.it/CbNVJx6vviy9XjA9MZSWx1SWmLzWxOmCYXHcj8GPkoE.jpg?width=640&crop=smart&auto=webp&s=6ff065bc428345240a199e65c49f4d63c1bb98f3",
            "width": 640,
            "height": 300
          },
          {
            "url": "https://external-preview.redd.it/CbNVJx6vviy9XjA9MZSWx1SWmLzWxOmCYXHcj8GPkoE.jpg?width=960&crop=smart&auto=webp&s=d564d2cc86d75433d5569d8215e55de52f38ec7a",
            "width": 960,
            "height": 451
          },
          {
            "url": "https://external-preview.redd.it/CbNVJx6vviy9XjA9MZSWx1SWmLzWxOmCYXHcj8GPkoE.jpg?width=1080&crop=smart&auto=webp&s=e5a6961661cd56408dd4f1bb0af149e1b8383f0e",
            "width": 1080,
            "height": 507
          }
        ],
        "variants": {},
        "id": "FMNDSpLcAHU_v4VbABoGPmNmP6SZtQyqwvtAg-wdXbg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/nby9zj/this_is_a_very_important_message_about_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "nby9zj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590794213
}