{
  "author": "ConsciousnessWizard",
  "the_new_excerpt": "Real-life example of this is how this pandemic talks about the number of\nCovid-positive tests, the number of hospitalized patients and the number of\ndeath, which are \"easy\" to count. However, the number of people suffering\nmentally in a way or another because of lockdown, restrictions, job…",
  "original_created_utc": 1611136274,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现实生活中的例子是，这次流行病是如何谈论数量的？\nCovid阳性检测，住院患者人数和。\n死亡，这些都是 \"容易 \"统计的。然而，遭受\n在精神上因为禁闭、限制、工作... ...",
      "title": "有没有人觉得，身体健康往往被视为比心理健康更重要，只是因为前者相比后者更容易被看到和衡量？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現實生活中的例子是，這次流行病是如何談論數量的？\nCovid陽性檢測，住院患者人數和。\n死亡，這些都是 \"容易 \"統計的。然而，遭受\n在精神上因爲禁閉、限制、工作... ...",
      "title": "有沒有人覺得，身體健康往往被視爲比心理健康更重要，只是因爲前者相比後者更容易被看到和衡量？"
    }
  ],
  "title": "Does anyone else feels that physical health is often seen as more important than mental health just because the former can be more easily seen and measured compared the latter?",
  "created_utc": 1611143787,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Real-life example of this is how this pandemic talks about the number of Covid-positive tests, the number of hospitalized patients and the number of death, which are &quot;easy&quot; to count. However, the number of people suffering mentally in a way or another because of lockdown, restrictions, job losses, grief etc. is not mentioned very often, and are much more difficult to count, just because there is no easy &quot;mental health PCR test&quot; that you can do.</p>\n\n<p>Obviously I don&#39;t want to minimize this pandemic and say that physical suffering is not important, but I feel that mental well-being is not properly taken into account in this pandemic (I guess this is also depends on the country you live in), but also in less dramatic examples.</p>\n</div><!-- SC_ON -->",
  "score": 414,
  "permalink": "/r/TooAfraidToAsk/comments/l164nq/does_anyone_else_feels_that_physical_health_is/",
  "subreddit": "TooAfraidToAsk",
  "id": "l164nq",
  "is_self": true,
  "media": null,
  "is_video": false
}