{
  "author": "Hardh_guy",
  "original_created_utc": 1651228552,
  "title": "You can use your PDFs and epubs like an audiobook with this app I made",
  "created_utc": 1651238572,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I built an app through which you can listen to your PDFs , ebooks and multiple other types of documents as an interactive audio book. You can try the app for free through this link &lt;a href=\"https://madhur-ai.com/\"&gt;https://madhur-ai.com/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Madhur is an AI text to speech reader which can read text from documents like PDFs, word, EPUBs and multiple other types. It can also read text from images. So you can scan your books and documents with the AI scanner and listen to it.&lt;/p&gt;\n\n&lt;p&gt;How does it work?&lt;/p&gt;\n\n&lt;p&gt;It can extract text from documents and images which are then read in an easy to listen sentence by sentence fashion by our natural sounding AI voices. You can also paste web articles or emails in the write or paste section.&lt;/p&gt;\n\n&lt;p&gt;Why use a text to speech readers like Madhur?&lt;/p&gt;\n\n&lt;p&gt;A text to speech reader like Madhur converts your reading material into an interactive audiobook. Which can help you save time. You can listen to your homework, documents or a story book while on commute, cooking ,cleaning or any other activities. Save your time and do more by using our text to speech reader.&lt;/p&gt;\n\n&lt;p&gt;Why choose Madhur?&lt;/p&gt;\n\n&lt;p&gt;* It helps you save time.&lt;/p&gt;\n\n&lt;p&gt;* Read more by listening as listening is 2-3 times faster than reading.&lt;/p&gt;\n\n&lt;p&gt;* Listen while moving or while doing other activities. Free up your time to do other things.&lt;/p&gt;\n\n&lt;p&gt;* Listen and take notes for deeper learning. Understand and retain more of what you’ve heard.&lt;/p&gt;\n\n&lt;p&gt;* We have natural sounding AI voices which make listening to the documents more engaging and Human like.&lt;/p&gt;\n\n&lt;p&gt;* Madhur also scans images for text so that you can scan your books or papers and save them for a later read.&lt;/p&gt;\n\n&lt;p&gt;Important features&lt;/p&gt;\n\n&lt;p&gt;Scan books, review papers and documents or any other text :&lt;/p&gt;\n\n&lt;p&gt;With Madhur you can use our AI OCR technology to read the text from images which can be then read by using natural AI voices.&lt;/p&gt;\n\n&lt;p&gt;Extract Text from multiple types of documents:&lt;/p&gt;\n\n&lt;p&gt;We use a powerful document parser which can parse multiple types of documents for text. So that the documents can be read easily.&lt;/p&gt;\n\n&lt;p&gt;Fast reading speeds:&lt;/p&gt;\n\n&lt;p&gt;You can change the reading speed of the reader which can help you listen to your document faster and save your time.&lt;/p&gt;\n\n&lt;p&gt;Natural sounding human like voices:&lt;/p&gt;\n\n&lt;p&gt;We have 20+ natural AI English voices which feel like a human is reading the document for you.&lt;/p&gt;\n\n&lt;p&gt;The voices have very good pronunciation and comprehension.&lt;/p&gt;\n\n&lt;p&gt;Why did we create Madhur?&lt;/p&gt;\n\n&lt;p&gt;We created Madhur so that reading may never be a barrier for anyone no matter who they are. Education empowers people and reading is an important pillar. Madhur helps people to consume their reading content with ease. It is also designed for people who are suffering with dyslexia, ADHD, Low vision acuity, concussions, and other reading disabilities.&lt;/p&gt;\n\n&lt;p&gt;It is for people who have reading disabilities or they are auditory learners, productivity fanatics, hobbyists, and more. We love all of our users and strive every day to create a reading assistant that empowers them to read more and succeed in life.&lt;/p&gt;\n\n&lt;p&gt;We strive to create a better text to speech reader that empowers our users to read more and succeed in their life.&lt;/p&gt;\n\n&lt;p&gt;You can try the app for free through this link &lt;a href=\"https://madhur-ai.com/\"&gt;https://madhur-ai.com/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/ueiznq/you_can_use_your_pdfs_and_epubs_like_an_audiobook/",
  "subreddit": "SideProject",
  "id": "ueiznq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So I built an app through which you can listen to your PDFs , ebooks and\nmultiple other types of documents as an interactive audio book. You can try the\napp for free through this link https://madhur-ai.com/\n\nMadhur is an AI text to speech reader which can read text from documents like\nPDFs, word,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで私は、PDFや電子書籍、その他様々な種類のドキュメントをインタラクティブに聴くことができるアプリを作りました。\nインタラクティブなオーディオブックとして聞くことができるアプリを作りました。あなたは、このリンクから無料でアプリを試すことができます。\nこのリンクから無料でお試しいただけます。https://madhur-ai.com/\n\nMadhurは、AIテキスト音声リーダーで、次のような文書からテキストを読み取ることができます。\nPDF、Word、...",
      "title": "私が作ったこのアプリで、PDFやepubをオーディオブックのように使用することができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我建立了一个应用程序，通过它你可以收听你的PDF，电子书和MAC。\n多种其他类型的文件作为互动的音频书。你可以通过以下链接尝试\n通过这个链接免费试用https://madhur-ai.com/\n\nMadhur是一个人工智能文本到语音阅读器，它可以从文件中读取文本，如\nPDFs, word,...",
      "title": "你可以用我做的这个应用程序把你的PDF和Epubs当作有声读物来使用"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我建立了一個應用程序，通過它你可以收聽你的PDF，電子書和MAC。\n多種其他類型的文件作爲互動的音頻書。你可以通過以下鏈接嘗試\n通過這個鏈接免費試用https://madhur-ai.com/\n\nMadhur是一個人工智能文本到語音閱讀器，它可以從文件中讀取文本，如\nPDFs, word,...",
      "title": "你可以用我做的這個應用程序把你的PDF和Epubs當作有聲讀物來使用"
    }
  ]
}