{
  "author": "HuskerNatChamps2020",
  "the_new_excerpt": "I raise this poll to give moon rights to the lurkers in this subreddit that\nchoose not to contribute when they have nothing productive to say. This is in\nreaction to the current meta in this sub in which people post and spam\nunproductive or unoriginal content to farm moons. I am proposing this not…",
  "original_created_utc": 1614575806,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我提出这个民意调查，给月亮的权利，在这个subreddit的游民，\n当他们没有什么有价值的话可说时，就选择不贡献。这是在\n反应到目前的元，在这个子里，人们张贴和垃圾邮件\n养殖月亮的非生产性或非原创性内容。我提出这个不...",
      "title": "给网友提供贡献，从而减少垃圾信息和非原创内容。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我提出這個民意調查，給月亮的權利，在這個subreddit的遊民，\n當他們沒有什麼有價值的話可說時，就選擇不貢獻。這是在\n反應到目前的元，在這個子裏，人們張貼和垃圾郵件\n養殖月亮的非生產性或非原創性內容。我提出這個不...",
      "title": "給網友提供貢獻，從而減少垃圾信息和非原創內容。"
    }
  ],
  "title": "giving lurkers contribution that may in turn reduce spamming and unoriginal content",
  "created_utc": 1614605673,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I raise this poll to give moon rights to the lurkers in this subreddit that choose not to contribute when they have nothing productive to say. This is in reaction to the current meta in this sub in which people post and spam unproductive or unoriginal content to farm moons. I am proposing this not as a way to farm moons silently but to incentivise people to only post and comment productive things while also staying active in the sub!</p>\n\n<p>-Voting Yes would mean that lurkers who upvote posts will get .25 karma for each upvote given, but only up to 100 karma each month for upvotes as to prevent even easier moon farming.</p>\n\n<p>-Voting keep as is will keep the current meta and not give lurkers incentive.</p>\n\n<p>Sincerely,</p>\n\n<p><a href=\"/u/huskernatchamps2020\">u/huskernatchamps2020</a></p>\n\n<p><a href=\"https://www.reddit.com/poll/lv0uat\">View Poll</a></p>\n</div><!-- SC_ON -->",
  "score": 414,
  "permalink": "/r/CryptoCurrency/comments/lv0uat/giving_lurkers_contribution_that_may_in_turn/",
  "subreddit": "CryptoCurrency",
  "id": "lv0uat",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937736465
}