{
  "author": "entropys_end",
  "the_new_excerpt": "Please educate me. I've been reading a lot of info recently and while they are\nnot conflicting, I have some trouble taking it all in.\n\nFirst, I see people saying options are expiring yesterday and next week with\nstrike prices below market value. This means the market makers have to buy\nstocks and…",
  "original_created_utc": 1612031936,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "请教我。我最近看了很多信息，虽然它们都是\n不冲突，我有些难以接受。\n\n首先，我看到有人说期权在昨天和下周到期，与\n行使价格低于市场价值。这意味着做市商必须买入\n股票和...",
      "title": "AMC：短裤覆盖了多少钱？而且必须要保吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請教我。我最近看了很多信息，雖然它們都是\n不衝突，我有些難以接受。\n\n首先，我看到有人說期權在昨天和下週到期，與\n行使價格低於市場價值。這意味着做市商必須買入\n股票和...",
      "title": "AMC：短褲覆蓋了多少錢？而且必須要保嗎？"
    }
  ],
  "title": "AMC: how much have the shorts covered? And do they have to?",
  "created_utc": 1612047217,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Please educate me. I&#39;ve been reading a lot of info recently and while they are not conflicting, I have some trouble taking it all in. </p>\n\n<p>First, I see people saying options are expiring yesterday and next week with strike prices below market value. This means the market makers have to buy stocks and drive up the price. What I don&#39;t understand is, I thought the point of option are you don&#39;t have to exercise if it is unfavorable, so couldn&#39;t the market makers just not exercise.</p>\n\n<p>Secondly, I hear people saying shorts technically have no expiry date, they just have to pay a premium. What is to say they just wait the fomo out? </p>\n\n<p>Lastly, I&#39;ve been seeing that there are like 4xx million volumes of AMC traded around which easily exceeds the number of shares shorted. Wouldn&#39;t this mean shorts are most likely covered?</p>\n\n<p>I know everyone is tired of this topic but this is a great learning opportunity for me, so please impart your wisdom.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/stocks/comments/l8sbos/amc_how_much_have_the_shorts_covered_and_do_they/",
  "subreddit": "stocks",
  "id": "l8sbos",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537980
}