{
  "author": "Iiau_",
  "the_new_excerpt": "Title.\n\nI have seen so many posts about people mistyping addresses and losing their\ncrypto recently. I am posting this again before some dude inevitably does the\nsame thing again.\n\nPaying fees twice is worth the peace of mind. If you're sending a small amount\nand it's a crypto with high fees (BTC,…",
  "original_created_utc": 1619411775,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルです。\n\n最近、アドレスを間違えて暗号を失った人の投稿をよく見かけます。\n最近、暗号を失ったという投稿をよく目にします。また同じようなことをする人が出てくる前に、もう一度投稿します。\n再度投稿します。\n\n2回手数料を払うことは、安心感につながります。少額しか送らないなら\n手数料の高い暗号（BTCや...）を少額で送る場合は",
      "title": "お願いだから、スタック全体を送信する前にダミーのトランザクションを送信してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题。\n\n我看到很多关于人们打错地址和丢失他们的\n的帖子。我再次发布这个帖子，以免一些人不可避免地再次做\n同样的事情。\n\n支付两次费用是值得安心的。如果你发送的金额不大\n而它是一种收费很高的加密货币（BTC，...",
      "title": "看在上帝的份上，在发送你的整个堆栈之前，先发送一个假的交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題。\n\n我看到很多關於人們打錯地址和丟失他們的\n的帖子。我再次發佈這個帖子，以免一些人不可避免地再次做\n同樣的事情。\n\n支付兩次費用是值得安心的。如果你發送的金額不大\n而它是一種收費很高的加密貨幣（BTC，...",
      "title": "看在上帝的份上，在發送你的整個堆棧之前，先發送一個假的交易。"
    }
  ],
  "title": "For the love of god, send a dummy transaction before sending your whole stack.",
  "created_utc": 1619429433,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title.</p>\n\n<p>I have seen so many posts about people mistyping addresses and losing their crypto recently. I am posting this again before some dude inevitably does the same thing again.</p>\n\n<p>Paying fees twice is worth the peace of mind. If you&#39;re sending a small amount and it&#39;s a crypto with high fees (BTC, ETH), I&#39;d either leave it on an exchange if it&#39;s there, wait until ETH 2.0 if it&#39;s ETH, or just send away if its so small that you won&#39;t get bummed out if you lost it.</p>\n\n<p>Anything else and there should be absolutely no excuse for you not to send a dummy transaction.</p>\n</div><!-- SC_ON -->",
  "score": 2137,
  "permalink": "/r/CryptoCurrency/comments/mypnsb/for_the_love_of_god_send_a_dummy_transaction/",
  "subreddit": "CryptoCurrency",
  "id": "mypnsb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210464
}