{
  "author": "kutes",
  "the_new_excerpt": "And I am seeing this. Don't tell me I'm not.\n\nIf you're a proponent of bitcoin, and you ridicule people who bought when the\nprice was booming, you're a complete and total piece of shit. I think I despise\nthis community. They aren't honest with themselves, which is about the only\nthing I ask of…",
  "original_created_utc": 1621271641,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そして、私はこれを見ている。そうじゃないとは言わせない。\n\nもしあなたがビットコインの支持者で、価格が高騰した時に買った人を嘲笑するなら、あなたは完全なクズです。\n価格が高騰していた時に買った人を嘲笑していたら、あなたは完全なクズです。私はこのコミュニティを軽蔑していると思います。\nこのコミュニティを軽蔑していると思う。彼らは自分自身に正直ではありません、それは私が求める唯一のことです。\n私が求めているのは...",
      "title": "トップに近いところで買った人を蔑視する人は、想像できる限り最悪の偽善者のクソです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "而我看到了这一点。别告诉我我没有。\n\n如果你是比特币的拥护者，而你却嘲笑那些在比特币价格上涨时买入的人\n那你就是个彻头彻尾的混蛋。我觉得我很鄙视\n这个社区。他们对自己不诚实，这也是我唯一要求的\n我要求的是...",
      "title": "贬低那些买入接近顶层的人是我能想象到的最虚伪的狗屎。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而我看到了這一點。別告訴我我沒有。\n\n如果你是比特幣的擁護者，而你卻嘲笑那些在比特幣價格上漲時買入的人\n那你就是個徹頭徹尾的混蛋。我覺得我很鄙視\n這個社區。他們對自己不誠實，這也是我唯一要求的\n我要求的是...",
      "title": "貶低那些買入接近頂層的人是我能想象到的最虛僞的狗屎。"
    }
  ],
  "title": "People being derogatory to people who bought in near the top are the worst pieces of hypocritical shit I can imagine",
  "created_utc": 1621299251,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>And I am seeing this. Don&#39;t tell me I&#39;m not.</p>\n\n<p>If you&#39;re a proponent of bitcoin, and you ridicule people who bought when the price was booming, you&#39;re a complete and total piece of shit. I think I despise this community. They aren&#39;t honest with themselves, which is about the only thing I ask of people. </p>\n\n<p>For the record, I bought my graphics cards either at MSRP or off of people who didn&#39;t know what they had and sold me for &quot;fair used&quot; prices. I&#39;ve made back what I spent and converted it into cash. I had to, so I could tell people that and not be lying.</p>\n\n<p>My modest operation is entering pure profit mode.</p>\n\n<p>Moving forward, I haven&#39;t decided what I&#39;ll do with what I make now. Probably hold since it&#39;s just a free 30 bucks of bitcoin a day. See where it goes. I&#39;m not going to invest cash in this until I know what we&#39;re dealing with.</p>\n</div><!-- SC_ON -->",
  "score": 458,
  "permalink": "/r/Bitcoin/comments/nelygr/people_being_derogatory_to_people_who_bought_in/",
  "subreddit": "Bitcoin",
  "id": "nelygr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590795287
}