{
  "author": "earth_worx",
  "the_new_excerpt": "This happened to me way back in 2003 - on a date with a rather nice guy. I was\nso nervous I swallowed funny and my food caught in my throat! I remember clearly\nmy thought processes: \"can't swallow, can't cough, can't breathe, can't talk - I\nhave 4 and a half minutes until brain death unless someone…",
  "original_created_utc": 1605907040,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "早在2003年，这件事就发生在我身上--当时我正和一个相当不错的男人约会。我曾经是\n太紧张了，我吞下了滑稽的东西，食物卡在喉咙里了！我记得很清楚\n我的思维过程：“不能吞咽，不能咳嗽，不能呼吸，不能说话-我\n离脑死亡还有4分半钟，除非有人…",
      "title": "LPT：不要因为礼貌而死去--如果你发现自己窒息了，不要感到尴尬，要引起注意！许多窒息的受害者死于餐厅的卫生间，因为他们试图私下自行清理气道。别让这件事发生在你身上--如果你需要帮助，就大惊小怪吧！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2003年，這件事就發生在我身上--當時我正和壹個相當不錯的男人約會。我曾經是\n太緊張了，我吞下了滑稽的東西，食物卡在喉嚨裏了！我記得很清楚\n我的思維過程：“不能吞咽，不能咳嗽，不能呼吸，不能說話-我\n離腦死亡還有4分半鐘，除非有人…",
      "title": "LPT：不要因為禮貌而死去--如果妳發現自己窒息了，不要感到尷尬，要引起註意！許多窒息的受害者死於餐廳的衛生間，因為他們試圖私下自行清理氣道。別讓這件事發生在妳身上--如果妳需要幫助，就大驚小怪吧！"
    }
  ],
  "title": "LPT: Don't die of politeness - if you find yourself choking, don't get embarrassed, GET ATTENTION! A lot of choking victims die in restaurant bathrooms because they tried to clear their airways by themselves in private. Don't let this be you - make a fuss if you need help!",
  "created_utc": 1605907040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This happened to me way back in 2003 - on a date with a rather nice guy. I was so nervous I swallowed funny and my food caught in my throat! I remember clearly my thought processes: &quot;can&#39;t swallow, can&#39;t cough, can&#39;t breathe, can&#39;t talk - I have 4 and a half minutes until brain death unless someone in this restaurant knows the Heimlich. There are about 40 people here, I bet the odds are pretty good...and you know, my date&#39;s a handy guy, bet he might be one of them!&quot; I stood up and started waving my hands around, forgot the &quot;international sign for choking&quot; (hands around the throat) but mimed the Heimlich and pointed at my mouth. My date figured it out, thankfully, did the Heimlich on me in front of 40 shocked onlookers, and saved my life! I found out 2 weeks later though that an acquaintance of mine had DIED in exactly the same circumstances because she had gone to the bathroom alone to try to clear her airway in private, and that this is a very common thing to happen. She literally died of embarrassment, of being too polite to make a fuss. Don&#39;t let this be you! <strong>If you&#39;re choking, get attention!</strong></p>\n\n<p>Oh and FWIW that rather nice guy and I have been married 16 years now :)</p>\n\n<p>EDIT: IF YOU ARE ALONE AND CHOKING you can do the Heimlich maneuver on yourself! <a href=\"https://youtu.be/ljL9JcK6RnM\">HERE is a very useful demo!</a> Thank you to <a href=\"/u/RanierMT\">u/RanierMT</a> for the link! </p>\n</div><!-- SC_ON -->",
  "score": 66078,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/E-lYD1fxEujFgmI1mE9jnhTdey7detcC25C5Mj-mboc.jpg?auto=webp&s=f477f9f011039250b2c53dd4f2dc0fefb30b1e51",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/E-lYD1fxEujFgmI1mE9jnhTdey7detcC25C5Mj-mboc.jpg?width=108&crop=smart&auto=webp&s=2e2955d5470f56d05cfd6e13339a7c117c50dde6",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/E-lYD1fxEujFgmI1mE9jnhTdey7detcC25C5Mj-mboc.jpg?width=216&crop=smart&auto=webp&s=938263b52a630786340022c48a9a3def5fc42854",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/E-lYD1fxEujFgmI1mE9jnhTdey7detcC25C5Mj-mboc.jpg?width=320&crop=smart&auto=webp&s=e0fd6a6542c5de6f0d0392d9939768e4a91b2612",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "cKsKJcnh_NwXvrbXYBkWHDadfrdHkt2UXFfKhf1DOvY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/LifeProTips/comments/jxdue8/lpt_dont_die_of_politeness_if_you_find_yourself/",
  "subreddit": "LifeProTips",
  "id": "jxdue8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260389666
}