{
  "author": "switchitalineman",
  "original_created_utc": 1640369517,
  "title": "Why is canceling student debt being considered over canceling medical debts?",
  "created_utc": 1640381230,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand that student loans programs are predatory and higher education costs and arm and a leg and the system needs to be fixed.&lt;/p&gt;\n\n&lt;p&gt;But in terms of canceling debt.. why is it student loan debt that we are talking about and not medical debt??&lt;/p&gt;\n\n&lt;p&gt;not trying to argue against student debt forgiveness, but one willingly signed up for that debt.. where as some people, through no choice of their own, end up drowning in medical bills..&lt;/p&gt;\n\n&lt;p&gt;Why is the topic of debt cancelation nt regarding medical debt?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/rnrn97/why_is_canceling_student_debt_being_considered/",
  "subreddit": "NoStupidQuestions",
  "id": "rnrn97",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that student loans programs are predatory and higher education\ncosts and arm and a leg and the system needs to be fixed.\n\nBut in terms of canceling debt.. why is it student loan debt that we are talking\nabout and not medical debt??\n\nnot trying to argue against student debt forgiveness,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "学生ローン制度が略奪的であること、高等教育が\nそのため、このシステムを修正する必要があります。\n\nしかし、借金を帳消しにするという点では、なぜ学生ローンの借金なのでしょう。\n医療費の借金ではなく、医療費の借金についてですか？\n\n学生の債務免除に反対しているわけではありませんが...。",
      "title": "なぜ、医療費の借金の帳消しよりも学生の借金の帳消しが検討されているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解学生贷款项目是掠夺性的，高等教育\n昂贵的费用，而且这个系统需要被修复。\n\n但就取消债务而言，为什么我们谈论的是学生贷款债务而不是医疗债务？\n而不是医疗债务？\n\n我不是想反对免除学生的债务，...",
      "title": "为什么考虑取消学生债务而不是取消医疗债务？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解學生貸款項目是掠奪性的，高等教育\n昂貴的費用，而且這個系統需要被修復。\n\n但就取消債務而言，爲什麼我們談論的是學生貸款債務而不是醫療債務？\n而不是醫療債務？\n\n我不是想反對免除學生的債務，...",
      "title": "爲什麼考慮取消學生債務而不是取消醫療債務？"
    }
  ]
}