{
  "author": "Kat_ri",
  "original_created_utc": 1633107935,
  "title": "Who to read after Nietzsche?",
  "created_utc": 1633157541,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Coworkers teenage son is clinically depressed, on the spectrum and in the last year got OBSESSED with Nietzche.  He naturally relates to Nietzsche&#39;a philosophy but isn&#39;t mature enough to take a critical lens to it. For him Nietzsche understands &quot;the truth,&quot; and part of that &quot;truth&quot; is that life is meaningless, full of suffering and he would be better off ending it all. Any recommendations on healthier,  broader ways to interpret Nietzsche that might pique the interest of a shy, smart, teenage bookworm?</p>\n\n<p>EDIT - he is being &quot;actively &quot; treated by medical professionals. Actively is in quotes because he and his family are reliant on the state and resources/ appointments are limited especially now that he legally an adult.</p>\n\n<p>EDIT EDIT: Thank you everyone for your kindness and responses!  His mom was initilaly very freaked out by his interest in Nietzsche but is now hopeful that his interest in philosophy will be beneficial.  These next few years will likely be the hardest of his life as he will have little access to child &amp; family services but is still too young to be safely prescibed antidepressants.   Even if he has no interest in further enaging philosophy, you&#39;ve given his momma a window into his interests and a great deal of comfort.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/pzcco6/who_to_read_after_nietzsche/",
  "subreddit": "askphilosophy",
  "id": "pzcco6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Coworkers teenage son is clinically depressed, on the spectrum and in the last\nyear got OBSESSED with Nietzche. He naturally relates to Nietzsche'a philosophy\nbut isn't mature enough to take a critical lens to it. For him Nietzsche\nunderstands \"the truth,\" and part of that \"truth\" is that life is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "同僚の10代の息子は、臨床的にはうつ病で、スペクトラムもあり、去年はニーチェに夢中になっていました。\n去年はニーチェに夢中になっていました。彼は自然にニーチェの哲学に共感していますが\n彼はニーチェの哲学に自然と共感しますが、それを批判的にとらえるほど成熟していません。彼にとってニーチェは\nは「真実」を理解しており、その「真実」の一部は、「人生は...」です。",
      "title": "ニーチェの次は誰を読むか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "同事的十几岁的儿子是临床上的抑郁症患者，有谱系，在去年\n去年，他迷上了尼采。他很自然地与尼采的哲学产生了联系\n但还没有成熟到可以用批判的眼光来看待它。对他来说，尼采\n了解 \"真相\"，而这个 \"真相 \"的一部分是：生命是......",
      "title": "在尼采之后该读谁？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "同事的十幾歲的兒子是臨牀上的抑鬱症患者，有譜系，在去年\n去年，他迷上了尼采。他很自然地與尼采的哲學產生了聯繫\n但還沒有成熟到可以用批判的眼光來看待它。對他來說，尼采\n瞭解 \"真相\"，而這個 \"真相 \"的一部分是：生命是......",
      "title": "在尼采之後該讀誰？"
    }
  ]
}