{
  "author": "dickbutt_md",
  "original_created_utc": 1653593715,
  "title": "Striggling: Did it exist?",
  "created_utc": 1653627874,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was in college (many years ago), I took a history class that covered aspects of ancient Greece and Rome. My professor offhandedly mentioned the practice of &amp;quot;striggling&amp;quot; one day that caught my attention. I just googled and spent some time trying to find more information about it, but there doesn&amp;#39;t seem to be anything, so I&amp;#39;m curious.&lt;/p&gt;\n\n&lt;p&gt;According to the little he said about it, striggling was a specific practice around drying the skin by scraping off the excess water with a &amp;quot;striggler&amp;quot;, a polished piece of wood, bone, etc, and then allowing the skin to air dry from there. People would sit in hot baths striggling away sweat, or if they came out of the bath they would striggle the excess water and air dry. I vaguely remember him saying that they (the upper class?) believed strongly in air drying only, which they didn&amp;#39;t consider striggling to disrupt like toweling or other methods. It sounded like a mainly upper class practice having to do with leisure time spent at public baths, sometimes servants would do the striggling.&lt;/p&gt;\n\n&lt;p&gt;I also remember he said something about striggling being related to the belief that not doing so would throw off the balance of the body&amp;#39;s humors. When sweating, for instance, they believed the sweat would get reabsorbed into the body during the process of drying and that the body expressed sweat in order to get rid of it, so striggling it off was good for health. Similarly, water after a bath would get absorbed so striggling the excess would keep things &amp;quot;in balance.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Where did my professor get this idea and the term &amp;quot;striggle&amp;quot; from? I can&amp;#39;t find anything about it, and now that I think about it, it seems weird that there would be an English term for a practice that didn&amp;#39;t seem to survive into modernity.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/uyfkol/striggling_did_it_exist/",
  "subreddit": "AskHistorians",
  "id": "uyfkol",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I was in college (many years ago), I took a history class that covered\naspects of ancient Greece and Rome. My professor offhandedly mentioned the\npractice of \"striggling\" one day that caught my attention. I just googled and\nspent some time trying to find more information about it, but there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大学時代（何年も前ですが）、歴史の授業を受けたことがあります。\n古代ギリシア・ローマを扱った歴史の授業を受けました。そのとき、教授が何気なく口にしたのが\nある日、教授が何気なく口にした \"striggling \"という言葉が気になりました。早速ググってみると\nそれについてもっと情報を得ようと時間を費やしたのですが、そこで",
      "title": "ストリッグス 存在したのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我上大学的时候（很多年前），我上了一门历史课，内容包括\n古希腊和古罗马的各个方面。我的教授有一天不经意地提到了\n我的教授有一天不经意地提到了 \"挣扎 \"的做法，这引起了我的注意。我就在谷歌上搜索，并\n花了一些时间试图找到更多关于它的信息，但是有...",
      "title": "蹒跚学步。它存在吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我上大學的時候（很多年前），我上了一門歷史課，內容包括\n古希臘和古羅馬的各個方面。我的教授有一天不經意地提到了\n我的教授有一天不經意地提到了 \"掙扎 \"的做法，這引起了我的注意。我就在谷歌上搜索，並\n花了一些時間試圖找到更多關於它的信息，但是有...",
      "title": "蹣跚學步。它存在嗎？"
    }
  ]
}