{
  "author": "dickbutt_md",
  "original_created_utc": 1653593715,
  "title": "Striggling: Did it exist?",
  "created_utc": 1653627874,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was in college (many years ago), I took a history class that covered aspects of ancient Greece and Rome. My professor offhandedly mentioned the practice of &amp;quot;striggling&amp;quot; one day that caught my attention. I just googled and spent some time trying to find more information about it, but there doesn&amp;#39;t seem to be anything, so I&amp;#39;m curious.&lt;/p&gt;\n\n&lt;p&gt;According to the little he said about it, striggling was a specific practice around drying the skin by scraping off the excess water with a &amp;quot;striggler&amp;quot;, a polished piece of wood, bone, etc, and then allowing the skin to air dry from there. People would sit in hot baths striggling away sweat, or if they came out of the bath they would striggle the excess water and air dry. I vaguely remember him saying that they (the upper class?) believed strongly in air drying only, which they didn&amp;#39;t consider striggling to disrupt like toweling or other methods. It sounded like a mainly upper class practice having to do with leisure time spent at public baths, sometimes servants would do the striggling.&lt;/p&gt;\n\n&lt;p&gt;I also remember he said something about striggling being related to the belief that not doing so would throw off the balance of the body&amp;#39;s humors. When sweating, for instance, they believed the sweat would get reabsorbed into the body during the process of drying and that the body expressed sweat in order to get rid of it, so striggling it off was good for health. Similarly, water after a bath would get absorbed so striggling the excess would keep things &amp;quot;in balance.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Where did my professor get this idea and the term &amp;quot;striggle&amp;quot; from? I can&amp;#39;t find anything about it, and now that I think about it, it seems weird that there would be an English term for a practice that didn&amp;#39;t seem to survive into modernity.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/uyfkol/striggling_did_it_exist/",
  "subreddit": "AskHistorians",
  "id": "uyfkol",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I was in college (many years ago), I took a history class that covered\naspects of ancient Greece and Rome. My professor offhandedly mentioned the\npractice of \"striggling\" one day that caught my attention. I just googled and\nspent some time trying to find more information about it, but there…"
}