{
  "author": "LifeisDankiThink",
  "the_new_excerpt": " 1. Don’t go all in on trades, keep some $ aside to dollar cost average if a\n    trade goes against you.\n\n 2. Try to average 2-4% gains per trade, if it goes down 2-4% you can either\n    take a loss and move on or if there’s no bad news and you’re confident it\n    should go back up, dollar cost…",
  "original_created_utc": 1613015897,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": " 1. 不要全身心地投入到交易中去，留一些美元留到美元成本平均，如果一\n    交易对你不利。\n\n 2. 尽量做到平均每笔交易有2-4%的收益，如果下跌2-4%，你可以或\n    失之东隅收之桑榆，收之桑榆\n    应该回升，美元成本... ...",
      "title": "我如何进行当日交易的指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": " 1. 不要全身心地投入到交易中去，留一些美元留到美元成本平均，如果一\n    交易對你不利。\n\n 2. 儘量做到平均每筆交易有2-4%的收益，如果下跌2-4%，你可以或\n    失之東隅收之桑榆，收之桑榆\n    應該回升，美元成本... ...",
      "title": "我如何進行當日交易的指南"
    }
  ],
  "title": "A guide to how I day trade",
  "created_utc": 1613021278,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li><p>Don’t go all in on trades, keep some $ aside to dollar cost average if a trade goes against you.</p></li>\n<li><p>Try to average 2-4% gains per trade, if it goes down 2-4% you can either take a loss and move on or if there’s no bad news and you’re confident it should go back up, dollar cost average to lower your entry price.</p></li>\n<li><p>Manage your emotions no matter what way the stock heads, if you’re panicking when it goes down you’re more inclined to make a bad decision, if a stock goes up, don’t pat yourself on the back thinking this is easy and get used to winning.</p></li>\n<li><p>Risk management, sometimes there will be bad news and the stock might open 10% lower. If this news is not potentially going to end the company, you’ll need to dictate more time to holding your position. Generally stocks tend to go up overtime.</p></li>\n<li><p>AVOID MEME STOCKS. By the time it became a meme the party’s already over, also avoid FOMO (fear of missing out) if a stock has risen too much too quickly, people will sure be taking profit.</p></li>\n<li><p>The more money you have on the table the more the gains and losses, if you’re making 2-4% profit per day trading day (roughly 253 days) that’s roughly 500-1000% gains in a year.</p></li>\n<li><p>If you’re a beginner, start small and find your own method eventually that works best for you.</p></li>\n<li><p>There’s a rule called pattern day trading, if you’re trading with below $25k in cash balance and stocks, you can only make 3 day trades in a 5 day trading period otherwise a 90 day trading ban.</p></li>\n</ol>\n\n<p>I’ve been using this method and it’s working out really well for me so far. </p>\n\n<p>Feel free to list your own methods that works for you :)</p>\n</div><!-- SC_ON -->",
  "score": 270,
  "permalink": "/r/stocks/comments/lhcc55/a_guide_to_how_i_day_trade/",
  "subreddit": "stocks",
  "id": "lhcc55",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123205011
}