{
  "author": "AskScienceModerator",
  "original_created_utc": 1626433214,
  "title": "AskScience AMA Series: We're Event Horizon Horizon Telescope members who captured the first black hole image. Ask Us Anything!",
  "created_utc": 1626444996,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Two years ago, we captured the first image of a Black Hole. Ask Us Anything! We&#39;ll be answering questions from 11:30 AM - 1:00 PM Eastern Time!</p>\n\n<p>The Event Horizon Telescope (EHT) - a planet-scale array of eleven ground-based radio telescopes forged through international collaboration - was designed to capture images of a black hole. Two years ago, EHT researchers successfully unveiled the first direct visual evidence of a supermassive black hole and its shadow. The EHT recently released a new version of the historic image, now shown in polarized light.</p>\n\n<p>As we continue to delve into data from past observations and pave the way for the next-generation EHT, we wanted to answer some of your questions! You might ask us about:</p>\n\n<ul>\n<li>Observing with a global telescope array</li>\n<li>Black hole theory and simulations</li>\n<li>The black hole imaging process</li>\n<li>Technology and engineering in astronomy</li>\n<li>Recent and upcoming results</li>\n<li>International collaboration at the EHT</li>\n<li>The next-generation Event Horizon Telescope (ngEHT)</li>\n</ul>\n\n<p>Our Panel Members consist of:</p>\n\n<ul>\n<li>Richard Anantua, Postdoctoral Fellow at the Center for Astrophysics | Harvard &amp; Smithsonian</li>\n<li>Nicholas Conroy, Outreach and Science Technician at the Center for Astrophysics | Harvard &amp; Smithsonian</li>\n<li>Sheperd Doeleman, Founding Director of the Event Horizon Telescope and Astrophysicist at the Center for Astrophysics | Harvard &amp; Smithsonian</li>\n<li>Charles Gammie, Donald Biggar Willett Professor of Physics and Professor of Astronomy at University of Illinois Urbana-Champaign</li>\n<li>Kari Haworth, Chief Technology Officer at the Center for Astrophysics | Harvard &amp; Smithsonian</li>\n<li>Sara Issaoun, PhD Student at Radboud University and incoming Einstein Postdoctoral Fellow at the Center for Astrophysics | Harvard &amp; Smithsonian</li>\n<li>Dom Pesce, Astrophysicist at the Center for Astrophysics | Harvard &amp; Smithsonian</li>\n<li>Angelo Ricarte, Institute for Theory and Computation (ITC) Fellow at the Center for Astrophysics | Harvard &amp; Smithsonian</li>\n<li>Jonathan Weintroub, EHT Electrical Engineer at the Center for Astrophysics | Harvard &amp; Smithsonian.</li>\n</ul>\n\n<p>If you&#39;d like to learn more about us, you can also check out our <a href=\"https://eventhorizontelescope.org/\">Website</a>, <a href=\"https://www.facebook.com/ehtelescope/\">Facebook</a>, <a href=\"https://twitter.com/ehtelescope\">Twitter</a>, <a href=\"https://www.instagram.com/ehtelescope\">Instagram</a>, and <a href=\"https://www.youtube.com/channel/UC4sItzYomoJ6Flt0aDyHMOQ\">YouTube</a>. We look forward to answering your questions!</p>\n\n<p>Username: <a href=\"/u/EHTelescope\">/u/EHTelescope</a></p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/askscience/comments/olel36/askscience_ama_series_were_event_horizon_horizon/",
  "subreddit": "askscience",
  "id": "olel36",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Two years ago, we captured the first image of a Black Hole. Ask Us Anything!\nWe'll be answering questions from 11:30 AM - 1:00 PM Eastern Time!\n\nThe Event Horizon Telescope (EHT) - a planet-scale array of eleven ground-based\nradio telescopes forged through international collaboration - was designed…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2年前、私たちは初めてブラックホールの画像を撮影しました。何でも聞いてください\n米国東部時間の午前11時30分から午後1時まで、質問にお答えします!\n\nイベント・ホライズン望遠鏡（EHT）は、国際的な協力体制のもと、11台の地上電波望遠鏡からなる惑星規模のアレイです。\nイベント・ホライゾン・テレスコープ（EHT）は、国際的な協力によって作られた11台の地上電波望遠鏡からなる惑星規模のアレイで、その設計は...",
      "title": "AskScience AMAシリーズ。We're Event Horizon ブラックホールの画像を初めて撮影したホライゾン望遠鏡のメンバー。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "两年前，我们捕捉到了第一张黑洞的图像。向我们提出任何问题!\n我们将在东部时间上午11:30-下午1:00回答问题!\n\n事件地平线望远镜（EHT）--一个由11个地基射电望远镜组成的星球级阵列。\n通过国际合作形成的行星规模的射电望远镜阵列--旨在...",
      "title": "AskScience AMA系列。我们是Event Horizon地平线望远镜的成员，他们拍摄了第一张黑洞图像。向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "兩年前，我們捕捉到了第一張黑洞的圖像。向我們提出任何問題!\n我們將在東部時間上午11:30-下午1:00回答問題!\n\n事件地平線望遠鏡（EHT）--一個由11個地基射電望遠鏡組成的星球級陣列。\n通過國際合作形成的行星規模的射電望遠鏡陣列--旨在...",
      "title": "AskScience AMA系列。我們是Event Horizon地平線望遠鏡的成員，他們拍攝了第一張黑洞圖像。向我們提出任何問題!"
    }
  ]
}