{
  "author": "bobic6",
  "the_new_excerpt": "This question may as well be about Aristotelian metaphysics. As far as I can\nunderstand, when it comes to everyday life, St. Thomas and Aristotle are\nbasically in agreement.\n\nI know that Aquinas believes that the essence of God cannot be comprehended by\nany creature…",
  "original_created_utc": 1612318891,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题也可能是关于亚里士多德的形而上学。据我所知\n明白，在日常生活中，圣托马斯和亚里士多德是。\n基本上是一致的。\n\n我知道，阿奎那认为，上帝的本质是无法通过\n任何生物...",
      "title": "圣托马斯-阿奎那是否相信有可能理解不是上帝的众生的本质？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題也可能是關於亞里士多德的形而上學。據我所知\n明白，在日常生活中，聖托馬斯和亞里士多德是。\n基本上是一致的。\n\n我知道，阿奎那認爲，上帝的本質是無法通過\n任何生物...",
      "title": "聖托馬斯-阿奎那是否相信有可能理解不是上帝的衆生的本質？"
    }
  ],
  "title": "Did St. Thomas Aquinas believe that it is possible to comprehend the essence of beings which are not God?",
  "created_utc": 1612373182,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This question may as well be about Aristotelian metaphysics. As far as I can understand, when it comes to everyday life, St. Thomas and Aristotle are basically in agreement.</p>\n\n<p>I know that Aquinas believes that <a href=\"https://www.newadvent.org/summa/1012.htm#article7\">the essence of God cannot be comprehended by any creature</a>. </p>\n\n<p>But how does his account of &quot;everyday&quot; comprehension go? Do human beings comprehend things in the world, or at least their essences? What is his definition of comprehension? </p>\n\n<p>Basically, if human beings <em>can</em> comprehend the essences of things—does Aquinas believe that earthly things can be known in their entirety, or is &quot;comprehension&quot; somehow restricted to the essence of a thing (excluding its various accidents).</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askphilosophy/comments/lbd6kb/did_st_thomas_aquinas_believe_that_it_is_possible/",
  "subreddit": "askphilosophy",
  "id": "lbd6kb",
  "is_self": true,
  "media": null,
  "is_video": false
}