{
  "author": "lollihobbes",
  "original_created_utc": 1624293313,
  "title": "Did Ancient Roman cities have their own distinct cultures and attitudes like cities do today?",
  "created_utc": 1624308969,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For example, New Yorkers are seen as tough and loud and people from Seattle are seen as compassionate liberals. Would people from Pompeii be seen as drunkards due to their city&#39;s history as a major figure in the wine industry? Would citizens of the city of Rome be seen as rich snobs due to it being full of wealthy politicians?</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/AskHistorians/comments/o4z9xv/did_ancient_roman_cities_have_their_own_distinct/",
  "subreddit": "AskHistorians",
  "id": "o4z9xv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For example, New Yorkers are seen as tough and loud and people from Seattle are\nseen as compassionate liberals. Would people from Pompeii be seen as drunkards\ndue to their city's history as a major figure in the wine industry? Would\ncitizens of the city of Rome be seen as rich snobs due to it being…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、ニューヨーカーはタフでうるさいと思われ、シアトル出身者は思いやりのあるリベラルと思われます。\nシアトル出身の人は、思いやりのあるリベラルだと思われています。ポンペイの人は、ワイン産業が盛んな街であることから、酔っぱらいと思われるでしょうか？\nポンペイの人は、ワイン産業の中心地であることから、酒飲みと思われるでしょうか？ローマの市民は\nローマの市民は、その都市が...であることから、金持ちの俗物と見られるだろうか？",
      "title": "古代ローマの都市には、現在の都市のような独自の文化や考え方があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，纽约人被视为强硬和喧闹，而来自西雅图的人被视为富有同情心的自由派。\n被看作是富有同情心的自由主义者。来自庞贝的人是否会被看作是酒鬼？\n因为他们的城市在历史上是葡萄酒行业的主要人物？会不会\n罗马市的公民会被视为富有的势利小人，因为它是......",
      "title": "古罗马城市是否像今天的城市一样有自己独特的文化和态度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，紐約人被視爲強硬和喧鬧，而來自西雅圖的人被視爲富有同情心的自由派。\n被看作是富有同情心的自由主義者。來自龐貝的人是否會被看作是酒鬼？\n因爲他們的城市在歷史上是葡萄酒行業的主要人物？會不會\n羅馬市的公民會被視爲富有的勢利小人，因爲它是......",
      "title": "古羅馬城市是否像今天的城市一樣有自己獨特的文化和態度？"
    }
  ]
}