{
  "author": "SnPotager",
  "original_created_utc": 1640891348,
  "title": "How do historians tell the difference between legends that people actually believed, and ones that were just popular fictional stories?",
  "created_utc": 1640903547,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m not trying to step on any toes here. &lt;/p&gt;\n\n&lt;p&gt;In our society, lots of people literally and earnestly believe that, for example, Jesus of Nazareth was a divine being who performed various miracles and returned from the dead. Everyone also knows the popular legend of King Arthur, who drew the sword from the stone and went on a quest for the holy grail, but virtually no one believes this literally happened. How would future historians tell the difference, and how do contemporary historians tell this about ancient societies?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/rs9hkm/how_do_historians_tell_the_difference_between/",
  "subreddit": "AskHistorians",
  "id": "rs9hkm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not trying to step on any toes here.\n\nIn our society, lots of people literally and earnestly believe that, for\nexample, Jesus of Nazareth was a divine being who performed various miracles and\nreturned from the dead. Everyone also knows the popular legend of King Arthur,\nwho drew the sword from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで踏ん切りをつけるつもりはない。\n\n私たちの社会では、多くの人々が文字通り真剣に、例えば、次のように信じています。\n例えば、ナザレのイエスは神的存在で、様々な奇跡を起こし\n死から生還した。また、誰もが知っているアーサー王伝説も有名だ。\n剣を抜いたのは...",
      "title": "歴史家は、人々が実際に信じていた伝説と、単なるフィクションであった伝説をどのように区別しているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是想在这里踩到任何脚趾。\n\n在我们的社会中，很多人从字面上认真地相信，例如\n例如，拿撒勒人耶稣是一个神圣的存在，他创造了各种奇迹并从死里复活。\n死而复生。大家也都知道亚瑟王的流行传说。\n拔出剑来的人。",
      "title": "历史学家如何区分人们真正相信的传说，以及那些只是流行的虚构故事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是想在這裏踩到任何腳趾。\n\n在我們的社會中，很多人從字面上認真地相信，例如\n例如，拿撒勒人耶穌是一個神聖的存在，他創造了各種奇蹟並從死裏復活。\n死而復生。大家也都知道亞瑟王的流行傳說。\n拔出劍來的人。",
      "title": "歷史學家如何區分人們真正相信的傳說，以及那些只是流行的虛構故事？"
    }
  ]
}