{
  "author": "naji102",
  "original_created_utc": 1636554179,
  "title": "This is the day our ancestors promised us and the prophecy has come true, Bitcoin has hit $69K.",
  "created_utc": 1636559224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is the moment every Bitcoiner has dreamed once in their life that one day Bitcoin will look as beautiful as your neighbors wife.</p>\n\n<p>$69K this is the numbers our ancestors promised us I can’t believe after years of waiting we have finally seen it.</p>\n\n<p>Hope you have bring out your finest wine today on the top of $2 h*oker to celebrate this beautiful day.</p>\n\n<p>On today’s occasion I just want to say one thing which I have been keeping it to myself for so long but I think it’s finally time to open up to you guys and say it.</p>\n\n<h1>“Nice”</h1>\n</div><!-- SC_ON -->",
  "score": 742,
  "permalink": "/r/CryptoCurrency/comments/qqvj8z/this_is_the_day_our_ancestors_promised_us_and_the/",
  "subreddit": "CryptoCurrency",
  "id": "qqvj8z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is the moment every Bitcoiner has dreamed once in their life that one day\nBitcoin will look as beautiful as your neighbors wife.\n\n$69K this is the numbers our ancestors promised us I can’t believe after years\nof waiting we have finally seen it.\n\nHope you have bring out your finest wine today on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、ビットコイナーなら誰もが一度は夢見る、「いつの日か\nビットコインが近所の奥さんのように美しく見える日が来ることを。\n\n6万9千ドル、これは私たちの祖先が約束してくれた数字です。\n何年も待ってようやく実現したなんて。\n\n今日は最高のワインを持ってきてください。",
      "title": "この日は先人たちが約束した日であり、予言は実現し、ビットコインは69Kドルに達しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是每个比特币持有者一生中曾经梦想过的时刻，即有一天\n比特币会像你邻居的妻子一样漂亮。\n\n6.9万美元，这是我们的祖先向我们承诺的数字，我无法相信在多年的等待之后\n我们终于看到了它。\n\n希望你今天能拿出你最好的酒来，在...",
      "title": "这是我们的祖先向我们承诺的日子，预言已经成真，比特币已经达到69K美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是每個比特幣持有者一生中曾經夢想過的時刻，即有一天\n比特幣會像你鄰居的妻子一樣漂亮。\n\n6.9萬美元，這是我們的祖先向我們承諾的數字，我無法相信在多年的等待之後\n我們終於看到了它。\n\n希望你今天能拿出你最好的酒來，在...",
      "title": "這是我們的祖先向我們承諾的日子，預言已經成真，比特幣已經達到69K美元。"
    }
  ]
}