{
  "author": "thenudedentist",
  "the_new_excerpt": "I'm newer to the game so maybe someone can help me with this. I am sure I am\nmissing something basic but, looking at their revenue, NVDA is not much more\nthan AMD. NVDA shows $5 billion for quarterly revenue January 21 and AMD is\nshowing $3.44 billion for the same time period. So roughly, 1.5 times…",
  "original_created_utc": 1620095913,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はゲーム初心者なので、誰かに助けてもらえるかもしれません。私は何か基本的なことを見逃していると思います。\n基本的なことを見逃しているかもしれませんが、NVDAの収益を見ると、AMDに比べてあまり\nAMDよりも少ないです。NVDAは1月21日の四半期収益で50億ドル、AMDは34.4億ドルとなっています。\n同じ時期に34.4億ドルと表示されています。つまり、大体、1.5倍...。",
      "title": "なぜNVDAはAMDよりも価値があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是游戏新手，所以也许有人能帮我解决这个问题。我肯定我是\n错过了一些基本的东西，但是，从他们的收入来看，NVDA并不比AMD多多少\n比AMD多得多。NVDA在1月21日的季度收入显示为50亿美元，而AMD则是\n同期显示为34.4亿美元。因此，大致上，1.5倍...",
      "title": "为什么NVDA的价值比AMD高那么多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是遊戲新手，所以也許有人能幫我解決這個問題。我肯定我是\n錯過了一些基本的東西，但是，從他們的收入來看，NVDA並不比AMD多多少\n比AMD多得多。NVDA在1月21日的季度收入顯示爲50億美元，而AMD則是\n同期顯示爲34.4億美元。因此，大致上，1.5倍...",
      "title": "爲什麼NVDA的價值比AMD高那麼多？"
    }
  ],
  "title": "Why is NVDA worth so much more than AMD?",
  "created_utc": 1620115614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m newer to the game so maybe someone can help me with this.  I am sure I am missing something basic but, looking at their revenue, NVDA is not much more than AMD.  NVDA shows $5 billion for quarterly revenue January 21 and AMD is showing $3.44 billion for the same time period. So roughly, 1.5 times as much revenue.</p>\n\n<p>NVDA is shown being valued at $370 billion and AMD at $97 billion.  That means NVDA is worth almost 4 times as much with only 1.5 times the revenue.  Why is this?  </p>\n\n<p>I like AMD and have been invested since March of last year and plan to keep buying more, but I just wonder why they are worth so much less.  Again, I am sure I am missing something very fundamental here so any input is greatly appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/",
  "subreddit": "stocks",
  "id": "n4e3w6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380968353
}