{
  "author": "jsake",
  "original_created_utc": 1637257170,
  "title": "I finally understand why people are so upset about ETH gas fees.",
  "created_utc": 1637275187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earlier this year I did a bit of fooling around with the ETH ecosystem and found myself paying between 10-20 bucks in gas fees per transaction, as long as I was careful and monitored EthGasStation.info before making a swap, so when people complained about gas fees I just thought &quot;hey that&#39;s the price of doing business&quot;, while I certainly empathized with people for whom 10-20 bucks represented a significant portion of their crypto investment, mine is large enough that a 20 dollar fee is totally worth the upside for any given project I think will do well.     </p>\n\n<p>Well today I went to swap some coins on Uniswap, for a trade of ~175 bucks, I was getting fees of 250-300!! Holy crap!    </p>\n\n<p>I understand that the fees are high because usage is high, and that the fees are a cost of keeping things relatively decentralized, but god damn when the market is popping off it&#39;s basically impossible for anyone besides a 5 or 6 + figure whale to make transactions if they&#39;re not on a Cex.<br/>\nIt&#39;s a real shame!! I hope they can sort it out, I&#39;d much rather have my ETH and ERC20 tokens in my own wallet instead of on an exchange, but for now it really doesn&#39;t seem feasible!!     </p>\n\n<p>Anyway, rant over. Please use the comments below as a safe space to complain about gas fees or make arguments for them. Just be nice to people !</p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/qwv2v1/i_finally_understand_why_people_are_so_upset/",
  "subreddit": "CryptoCurrency",
  "id": "qwv2v1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Earlier this year I did a bit of fooling around with the ETH ecosystem and found\nmyself paying between 10-20 bucks in gas fees per transaction, as long as I was\ncareful and monitored EthGasStation.info before making a swap, so when people\ncomplained about gas fees I just thought \"hey that's the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年の初め、私はETHのエコシステムを少し試してみました。\n慎重に行動し、EthGasStation.iを監視している限り、1回の取引につき10～20ドルのガス料金を支払うことになりました。\n気をつけて、スワップをする前にEthGasStation.infoを監視していれば、1回の取引で10～20ドルのガス料金を支払うことができました。\nそのため、人々がガス料金について文句を言ったとき、私は「これは...」と思いました。",
      "title": "ETHのガス料金について、人々が騒ぐ理由がやっとわかりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年早些时候，我对ETH生态系统进行了一番愚弄，发现\n我发现自己每笔交易支付了10-20美元的汽油费，只要我小心翼翼地监测EthGasStati\n只要我在交易前小心翼翼地监控EthGasStation.info，所以当人们抱怨汽油费时，我只是想 \"嘿，那是我的错。\n所以当人们抱怨气体费用时，我只是想 \"嘿，这就是......\"。",
      "title": "我终于明白为什么人们对ETH汽油费如此不满。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年早些時候，我對ETH生態系統進行了一番愚弄，發現\n我發現自己每筆交易支付了10-20美元的汽油費，只要我小心翼翼地監測EthGasStati\n只要我在交易前小心翼翼地監控EthGasStation.info，所以當人們抱怨汽油費時，我只是想 \"嘿，那是我的錯。\n所以當人們抱怨氣體費用時，我只是想 \"嘿，這就是......\"。",
      "title": "我終於明白爲什麼人們對ETH汽油費如此不滿。"
    }
  ]
}