{
  "author": "onlymadethistoargue",
  "original_created_utc": 1630865320,
  "title": "BULLRUN CONFIRMED as BTC forms myrrh cross, frankincense cross in addition to golden cross",
  "created_utc": 1630889743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin has been lagging behind Ethereum and alt coins’ surge as alt season rages on. Sure it’s up to $50k after months of falling from its ATH, but we still need to be looking for hard economic indicators that the FUD isn’t real.</p>\n\n<p>Luckily, thanks to a small rural think tank in Bethlehem (I can’t post the link due to sub rules and blasphemy), our worries may be over. After following the star of crypto, investment firm 3WM located three separate financial signals that show that the King of Coins is ready to take his seat in the lambo at the right hand of the almighty moon.</p>\n\n<p>These analyses indicates we’ve hit a golden cross, a myrrh cross, and a frankincense cross. These three gifts have been given to all faithful BTC hodlers and they’ve made little investors drum up a lot of rum pa pum pum over the salvation of their portfolios.</p>\n\n<p>Further, according to Gabriel, head of communications at the parent company of 3WM, we can expect to see 12 coins skyrocket off of the backs of BTC within 30 crypto years (4 human years), but be warned: one of these will rugpull so hard as to betray the entire crypto market by selling the entire supply for silver.</p>\n\n<p>Not to worry, however, the CEO of the crypto analyst firm Bitcoin Investment, Brokerage and Legal Evaluation, has informed shareholders that any potential crash will rebound and lead to a new ATH they describe as “heavenly.”</p>\n\n<h1>tl;dr</h1>\n\n<p>When in doubt, always remember the white paper: “For Satoshi so loved decentralized financial technologies that he gave the world his only coin” - Nakamoto 3:16</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/CryptoCurrency/comments/pii2hf/bullrun_confirmed_as_btc_forms_myrrh_cross/",
  "subreddit": "CryptoCurrency",
  "id": "pii2hf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitcoin has been lagging behind Ethereum and alt coins’ surge as alt season\nrages on. Sure it’s up to $50k after months of falling from its ATH, but we\nstill need to be looking for hard economic indicators that the FUD isn’t real.\n\nLuckily, thanks to a small rural think tank in Bethlehem (I can’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは、イーサリアムやアルトコインの高騰に遅れをとっており、アルトシーズンが\n続いています。確かに、ビットコインは数ヶ月間、最高値から下落した後、50kドルまで上昇しています。\nしかし、私たちは、FUDが本物ではないことを示す経済指標を探す必要があります。\n\n幸運なことに、ベツレヘムにある小さな田舎のシンクタンクのおかげで（私は...",
      "title": "BTCが金色の十字架に加えて、ミルラの十字架、乳香の十字架を形成していることをBULLRUNが確認。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币一直落后于以太坊和另类币的激增，因为另类币季\n汹涌而来。当然，在经历了几个月的下跌之后，它已经涨到了5万美元，但我们\n但我们仍然需要寻找硬性的经济指标，以证明FUD不是真的。\n\n幸运的是，由于伯利恒的一个小型农村智囊团（我不能...",
      "title": "证实BTC形成没药十字架、乳香十字架以及黄金十字架的BULLRUN确认"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣一直落後於以太坊和另類幣的激增，因爲另類幣季\n洶湧而來。當然，在經歷了幾個月的下跌之後，它已經漲到了5萬美元，但我們\n但我們仍然需要尋找硬性的經濟指標，以證明FUD不是真的。\n\n幸運的是，由於伯利恆的一個小型農村智囊團（我不能...",
      "title": "證實BTC形成沒藥十字架、乳香十字架以及黃金十字架的BULLRUN確認"
    }
  ]
}