{
  "author": "codex561",
  "the_new_excerpt": "I live in Canada and have met way more people who don't understand anything\nabout the political system or economics than those who do. I need to explain\nwhat progressive taxes mean on the regular, never mind foreign policy. I'm sure\nthis applies to nearly all democratic countries.\n\nI would see…",
  "original_created_utc": 1621551085,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はカナダに住んでいますが、政治システムや経済について何も理解していない人の方が\n私はカナダに住んでいますが、政治システムや経済について理解している人よりも理解していない人の方がはるかに多いです。累進課税の意味を説明する必要があります。\n累進課税の意味を説明しなければなりませんが、外交政策はどうでもいいのです。きっと\nこれはほぼすべての民主主義国に当てはまることだと思います。\n\n私が見るのは...",
      "title": "選挙民が自分の投票内容を真に理解していない民主主義に何の意味があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在加拿大，遇到的不了解政治制度或经济的人比了解的人多得多。\n的人比那些了解政治制度或经济的人多。我需要解释\n我需要经常解释累进税是什么意思，更不用说外交政策了。我相信\n这几乎适用于所有的民主国家。\n\n我会看到...",
      "title": "如果选民不能真正理解他们投票的内容，那么民主的意义何在？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在加拿大，遇到的不瞭解政治制度或經濟的人比了解的人多得多。\n的人比那些瞭解政治制度或經濟的人多。我需要解釋\n我需要經常解釋累進稅是什麼意思，更不用說外交政策了。我相信\n這幾乎適用於所有的民主國家。\n\n我會看到...",
      "title": "如果選民不能真正理解他們投票的內容，那麼民主的意義何在？"
    }
  ],
  "title": "What's the point of a democracy where the electorate doesn't truly understand what they're voting for?",
  "created_utc": 1621572767,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in Canada and have met way more people who don&#39;t understand anything about the political system or economics than those who do. I need to explain what progressive taxes mean on the regular, never mind foreign policy. I&#39;m sure this applies to nearly all democratic countries.</p>\n\n<p>I would see myself as a well-informed voter, except I don&#39;t vote anymore. I can&#39;t see the point of it when in the end, the winner will be decided by who the media props up or who is more charismatic. Policy doesn&#39;t enter the equation beyond voting for self-interest with no understanding of the costs, unless if it&#39;s an equally uninformed kneejerk.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/nhduaf/whats_the_point_of_a_democracy_where_the/",
  "subreddit": "TrueAskReddit",
  "id": "nhduaf",
  "is_self": true,
  "media": null,
  "is_video": false
}