{
  "author": "Acceptable_Novel8200",
  "original_created_utc": 1638109281,
  "title": "You wanna know how early you are in Crypto,people are still stuck in \"BTC only used to buy drugs\" era!",
  "created_utc": 1638121285,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sometimes I just go on other subs to check out People&#39;s view about Crypto,today I visited \n<a href=\"/r/technology\">r/technology</a> sub \nThere is a hot post on the sub ,an old news article about Crypto :</p>\n\n<p>&quot;Bitcoin miners resurrect fossil fuel power plant, Drawing backlash from Environmentalists&quot;</p>\n\n<p>Here are the some of the top comments </p>\n\n<blockquote>\n<p>Here come the Crypto miners to attempt to push this into the dirt.I can&#39;t hear you over the sound of the GPU market on flames </p>\n\n<p>How else will I make millions in Cumcoin so that I can buy an NFT of a rainbow monkey wearing a crown to make my profile picture on Twitter? This is the future we were waiting for.</p>\n\n<p>What a monumental pointless waste.Its not only the plant spewing out CO2 for nothing, it&#39;s also the astronomical e-waste of all those servers just burning energy to make speculative bullshit </p>\n\n<p>Mining Crypto needs to be permanently banned in all countries </p>\n\n<p>Blockchain as a concept is very intriguing, but I have yet to read but I have yet to read a sufficient explanation of what problem Cryptocurrency solves outside of avoiding regulation from existing markets and nation states </p>\n\n<p>I think the reasons you listed is the only reason what they don&#39;t consider is that in a world where the current government backed currencies stop working, they probably won&#39;t have electricity or any network to use Bitcoin.And with an upper limit of 20k transactions per hour, if everyone were to use it, they can only do one transaction every 50years </p>\n\n<p>As long as we allow this BS we don&#39;t have to talk about electric cars and biodegradable straws </p>\n\n<p>All for something that&#39;s sole practical use is to buy drugs and payoff ransomware. The world weeps</p>\n\n<p>It is also used for international money laundering and human trafficking</p>\n\n<p>Crypto is nothing but a scam most of the time and at best it&#39;s just a way for the wealthy to hide their money and purchase drugs anonymously </p>\n</blockquote>\n\n<p>To sum it up, People outside Crypto subs, have the opinion BTC is a scam, only used to buy drugs, used in money laundering,consumes energy. \nSame circle jerk arguments used 5-7 years ago.,nothing new.\nThey lack the new arguments to bash crypto,even after years,that tells lot of things</p>\n</div><!-- SC_ON -->",
  "score": 228,
  "permalink": "/r/CryptoCurrency/comments/r45ceu/you_wanna_know_how_early_you_are_in_cryptopeople/",
  "subreddit": "CryptoCurrency",
  "id": "r45ceu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sometimes I just go on other subs to check out People's view about Crypto,today\nI visited r/technology [/r/technology] sub There is a hot post on the sub ,an\nold news article about Crypto :\n\n\"Bitcoin miners resurrect fossil fuel power plant, Drawing backlash from\nEnvironmentalists\"\n\nHere are the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時々、Cryptoについての人々の見解を確認するために他のサブサイトに行くことがありますが、今日は\nr/technology [/r/technology] サブに行ってみました。\nCryptoに関する古いニュース記事です。\n\n\"Bitcoin miners resurrect fossil fuel power plant, Drawing backlash from Environmentalists\n環境保護主義者からの反発を招く\"\n\nここでは、その...",
      "title": "人々はまだ「BTCは麻薬を買うためにしか使われていない」という時代に留まっているのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有时我只是去其他子网站看看人们对加密货币的看法，今天\n我访问了r/technology [/r/technology]子，该子上有一个热帖，是一篇关于加密货币的旧新闻。\n关于加密货币的旧新闻文章。\n\n\"比特币矿工复活化石燃料发电厂，引来环保人士的反击。\n环保主义者\"。\n\n这里是...",
      "title": "你想知道你在加密货币方面有多早，人们还停留在 \"BTC只能用来买毒品 \"的时代"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有時我只是去其他子網站看看人們對加密貨幣的看法，今天\n我訪問了r/technology [/r/technology]子，該子上有一個熱帖，是一篇關於加密貨幣的舊新聞。\n關於加密貨幣的舊新聞文章。\n\n\"比特幣礦工復活化石燃料發電廠，引來環保人士的反擊。\n環保主義者\"。\n\n這裏是...",
      "title": "你想知道你在加密貨幣方面有多早，人們還停留在 \"BTC只能用來買毒品 \"的時代"
    }
  ]
}