{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Recently, there's been a lot of advertisements for Titan on YouTube. They've quite clearly been spending a lot on their marketing budget. Titan is an app where they take your money and invest it in their actively managed fund. Their marketing material will claim to earn a high return annually.  They also tend to market towards younger, inexperienced investors (perhaps aged 20-35). Disclaimer, I am a huge critic of public actively managed funds and I hate them with a passion. I believe that they are one of the largest financial scam inventions of the past century.\n\nThe track record of this \"fund\" only goes back to 2018, a year in the middle of one of the longest bull runs in history. A blindfolded monkey had a 50/50 percent chance of beating the S&amp;P 500 over this time period (not a joke, google it).\n\nLet's pretend for a minute that the \"advisors\" at Titan have a magical ability to pick stocks that will outperform the S&amp;P 500 every year. Even if this is true, the **real enemy** in the room is the fees. Titan charges 1% per year on the market value of your account (monthly charges). Commissions like this are absolute **destroyers of wealth**.\n\nLet’s say your portfolio earns 9% per year.  1% goes to the fee.  Let’s say 3% to inflation (assuming inflation falls back to normal ranges eventually. Today, it's *much* higher) and maybe 3% to taxes and…..omg there’s nothing left for you!  Investment returns are very fragile and this model only hurts you.\n\nThe evidence is clear that when you put your money in the hands of someone else, rather than the market, you will pay the opportunity cost of gains and compounding that the market could have given you. Just look at Cathie Wood's ETF's. Sure, they might recover, but imagine all of the people who trusted her \"intelligence\" and \"magic\". Nothing against her, but she has failed to outperform the market as she claimed she would. In fact, she's not only failed to match the market, but she has lost money for her shareholders.\n\nThe hedge funds (btw, Titan is not a real hedge fund even though they use that slang in their marketing) that actually could outperform the market (Buffett's early years, Soros, Medallion Fund, etc) were **private.** You don't find ads on YouTube for these types of funds.\n\nThere's nothing wrong with buying individual stocks if you want to play the game. It's fun, I do it too (I'm a total WSB freak), but when it comes to the bulk of your money and long term wealth, why not just buy the market? Just go SPY or VTI and pay **barely** **any fee** and get **better** performance.\n\nMore reading on why investment advisors are toxic:\n\n[https://jlcollinsnh.com/2012/06/06/why-i-dont-like-investment-advisors/](https://jlcollinsnh.com/2012/06/06/why-i-dont-like-investment-advisors/)\n\nP.S. F\\*\\*\\* the YouTubers who shill this crap even though they preach index fund investing on their channels.",
  "author_fullname": "t2_acdds",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "PSA: The new app, \"Titan Invest\", that is being shilled in ads across all of the big finance Youtuber's channels is not something you need.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_sm1wnc",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.89,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 206,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 206,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1644168003,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1644167726,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Recently, there&amp;#39;s been a lot of advertisements for Titan on YouTube. They&amp;#39;ve quite clearly been spending a lot on their marketing budget. Titan is an app where they take your money and invest it in their actively managed fund. Their marketing material will claim to earn a high return annually.  They also tend to market towards younger, inexperienced investors (perhaps aged 20-35). Disclaimer, I am a huge critic of public actively managed funds and I hate them with a passion. I believe that they are one of the largest financial scam inventions of the past century.&lt;/p&gt;\n\n&lt;p&gt;The track record of this &amp;quot;fund&amp;quot; only goes back to 2018, a year in the middle of one of the longest bull runs in history. A blindfolded monkey had a 50/50 percent chance of beating the S&amp;amp;P 500 over this time period (not a joke, google it).&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s pretend for a minute that the &amp;quot;advisors&amp;quot; at Titan have a magical ability to pick stocks that will outperform the S&amp;amp;P 500 every year. Even if this is true, the &lt;strong&gt;real enemy&lt;/strong&gt; in the room is the fees. Titan charges 1% per year on the market value of your account (monthly charges). Commissions like this are absolute &lt;strong&gt;destroyers of wealth&lt;/strong&gt;.&lt;/p&gt;\n\n&lt;p&gt;Let’s say your portfolio earns 9% per year.  1% goes to the fee.  Let’s say 3% to inflation (assuming inflation falls back to normal ranges eventually. Today, it&amp;#39;s &lt;em&gt;much&lt;/em&gt; higher) and maybe 3% to taxes and…..omg there’s nothing left for you!  Investment returns are very fragile and this model only hurts you.&lt;/p&gt;\n\n&lt;p&gt;The evidence is clear that when you put your money in the hands of someone else, rather than the market, you will pay the opportunity cost of gains and compounding that the market could have given you. Just look at Cathie Wood&amp;#39;s ETF&amp;#39;s. Sure, they might recover, but imagine all of the people who trusted her &amp;quot;intelligence&amp;quot; and &amp;quot;magic&amp;quot;. Nothing against her, but she has failed to outperform the market as she claimed she would. In fact, she&amp;#39;s not only failed to match the market, but she has lost money for her shareholders.&lt;/p&gt;\n\n&lt;p&gt;The hedge funds (btw, Titan is not a real hedge fund even though they use that slang in their marketing) that actually could outperform the market (Buffett&amp;#39;s early years, Soros, Medallion Fund, etc) were &lt;strong&gt;private.&lt;/strong&gt; You don&amp;#39;t find ads on YouTube for these types of funds.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s nothing wrong with buying individual stocks if you want to play the game. It&amp;#39;s fun, I do it too (I&amp;#39;m a total WSB freak), but when it comes to the bulk of your money and long term wealth, why not just buy the market? Just go SPY or VTI and pay &lt;strong&gt;barely&lt;/strong&gt; &lt;strong&gt;any fee&lt;/strong&gt; and get &lt;strong&gt;better&lt;/strong&gt; performance.&lt;/p&gt;\n\n&lt;p&gt;More reading on why investment advisors are toxic:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://jlcollinsnh.com/2012/06/06/why-i-dont-like-investment-advisors/\"&gt;https://jlcollinsnh.com/2012/06/06/why-i-dont-like-investment-advisors/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;P.S. F*** the YouTubers who shill this crap even though they preach index fund investing on their channels.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "sm1wnc",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Zachincool",
  "discussion_type": null,
  "num_comments": 13,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/sm1wnc/psa_the_new_app_titan_invest_that_is_being/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/sm1wnc/psa_the_new_app_titan_invest_that_is_being/",
  "subreddit_subscribers": 3617292,
  "created_utc": 1644177662,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1644167726,
  "the_new_excerpt": "Recently, there's been a lot of advertisements for Titan on YouTube. They've\nquite clearly been spending a lot on their marketing budget. Titan is an app\nwhere they take your money and invest it in their actively managed fund. Their\nmarketing material will claim to earn a high return annually. They…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、YouTubeでタイタンの広告がよく流れていますね。タイタンは\n明らかにマーケティング予算がかかっている。Titanはアプリです。\nお金を預かって、アクティブ運用のファンドに投資する。彼らの\nマーケティング資料では、毎年高いリターンを得られると謳われています。彼らは...",
      "title": "PSA：大手金融系Youtuberのチャンネルで広告宣伝されている新しいアプリ「Titan Invest」は、あなたにとって必要なものではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，YouTube上出现了很多泰坦的广告。他们\n很明显，他们已经在营销预算上花费了很多。泰坦是一个应用程序\n他们把你的钱投资到他们的主动管理基金中。他们的\n营销材料会声称每年获得高额回报。他们...",
      "title": "PSA：新的应用程序 \"泰坦投资\"，在所有大型金融Youtuber频道的广告中被兜售，这不是你需要的东西。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，YouTube上出現了很多泰坦的廣告。他們\n很明顯，他們已經在營銷預算上花費了很多。泰坦是一個應用程序\n他們把你的錢投資到他們的主動管理基金中。他們的\n營銷材料會聲稱每年獲得高額回報。他們...",
      "title": "PSA：新的應用程序 \"泰坦投資\"，在所有大型金融Youtuber頻道的廣告中被兜售，這不是你需要的東西。"
    }
  ],
  "source_updated_at": 1644572437697
}