{
  "author": "jbrandyman",
  "the_new_excerpt": "THE MANIA PHASE\n\nDuring the mania phase, any coin can pump for any (or even no discernible)\nreason, everyone new to the space will believe they are a genius, all of this is\ndeserved and they are the best and all of the old people are idiotic gatekeeping\nbitcoin maximalists.\n\n\n\n\"This time it's…",
  "original_created_utc": 1618634994,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マニア期\n\nマニア期には、どんなコインでも、どんな理由でも（あるいは理由がわからなくても）ポンピングすることができます。\n理由もなく）、新参者は皆、自分は天才だ、これは当然だ、自分は最高だと\n自分が一番で、年配者は皆、馬鹿な門番だと信じています。\nビットコイン・マキシマリスト\n\n\n\n\"今回は...",
      "title": "躁状態が近づいています（基準によってはすでに来ているかもしれませんが）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "狂热阶段\n\n在狂热阶段，任何硬币都可以抽到任何（甚至是没有辨别的）。\n原因，每一个新进入空间的人都会认为自己是个天才，这一切的一切都在于\n当之无愧，他们是最棒的，所有的老人都是白痴守门人。\n比特币最大主义者。\n\n\n\n\"这次是...",
      "title": "狂热阶段即将到来（或已经到来，取决于你使用的度量标准），请记得互相礼让，保持冷静的头脑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "狂熱階段\n\n在狂熱階段，任何硬幣都可以抽到任何（甚至是沒有辨別的）。\n原因，每一個新進入空間的人都會認爲自己是個天才，這一切的一切都在於\n當之無愧，他們是最棒的，所有的老人都是白癡守門人。\n比特幣最大主義者。\n\n\n\n\"這次是...",
      "title": "狂熱階段即將到來（或已經到來，取決於你使用的度量標準），請記得互相禮讓，保持冷靜的頭腦。"
    }
  ],
  "title": "The mania phase is approaching (or already here depending on the metric you use) please remember to be courteous to each other and keep a level head",
  "created_utc": 1618648983,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>The Mania Phase</h1>\n\n<p>During the mania phase, any coin can pump for any (or even no discernible) reason, everyone new to the space will believe they are a genius, all of this is deserved and they are the best and all of the old people are idiotic gatekeeping bitcoin maximalists.</p>\n\n<p>&#x200B;</p>\n\n<p>&quot;This time it&#39;s different!&quot; Everyone says, just like last time, the coins they bought are surely going to the moon, in fact, it&#39;s better than bitcoin! All of these people are just jealous because they missed the bitcoin train, bought bitcoin instead of <strong><em>\\</em>insert literally any altcoin during mania phase\\</strong>** and are salty of how rich we will become!</p>\n\n<p>&#x200B;</p>\n\n<h1>The Bear Market</h1>\n\n<p>But then in a year or so, the bear market hits, and once bitcoin comes down, all alts follow, the sub pins the suicide hotline, and most of the new members disappear, while the old members go back about their business, with some of the new members staying.</p>\n\n<p>&#x200B;</p>\n\n<p>The usual memes come up once again, the classic, &quot;First noobs buy bitcoin, then they buy altcoin, then noobs learn to buy bitcoin&quot;</p>\n\n<p>&#x200B;</p>\n\n<h1>The Start of the next Bull Market</h1>\n\n<p>Bitcoin breaks ATH, goes up 200~300%, now bitcoin is looking too expensive for the common man, who&#39;s going to buy bitcoin at <del>$300</del> <del>$2000</del> <del>$10,000</del> $100,000 dollars? Time to look for the next big thing! If it goes up as much as bitcoin then I&#39;ll be rich! &quot;Surely this is genius, I wonder why nobody ever thought of it!&quot; Everyone says.</p>\n\n<h1>The next Mania Phase</h1>\n\n<pre><code>20 Go To 10\n</code></pre>\n\n<p>&#x200B;</p>\n\n<h1>My opinions</h1>\n\n<ol>\n<li>Please try to be AT LEAST playing with house money (aka. withdraw initial investment), doesn&#39;t have to be right now but definitely before the market turns. When is that? That&#39;s the question that if I could answer I would already be a millionaire, so sorry, you&#39;ll have to figure it out yourself. DYOR is a motto for a reason.</li>\n<li>Be nice in this sub please: I enjoy being here, and would prefer not to have fights all over the place, if you think the DOGE pump was bad, see what happens in a few months, weirder things have pumped harder during bull markets (look up TRON in the last bull market) , so it&#39;s honestly not even an issue. If they bought into a pump and dump, it&#39;s their responsibility to figure it out before the dump. You can warn them, but no more than that, it&#39;s their money and they can do whatever they want with it. For those who&#39;s favorite coin everyone hates pumped, don&#39;t go around telling people they&#39;re just jealous. Remember, anyone here who bought bitcoin is up at least several hundreds of percent, and this idea that they&#39;d be jealous is very immature, and will probably make them hate your coin even more. As many atheists say, &quot;I don&#39;t hate Jesus Christ, I hate his fan club.&quot;</li>\n<li>Congratulations to everyone on your gains! Hopefully in a year I will hear of all the great stories of how you changed your life with the money!</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>TL;DR: Nothing here so far didn&#39;t happen last time (perhaps arguably even every time), please be nice and if possible withdraw your initial money before the bear market. Congratulations and hope in a year you are wealthier than you are today.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: This is not financial advice please don&#39;t sue me &gt;&lt;</p>\n</div><!-- SC_ON -->",
  "score": 543,
  "permalink": "/r/CryptoCurrency/comments/mskb43/the_mania_phase_is_approaching_or_already_here/",
  "subreddit": "CryptoCurrency",
  "id": "mskb43",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519539
}