{
  "author": "Xenu4u",
  "original_created_utc": 1631237354,
  "title": "We are all early, you know who is too late? The SEC.",
  "created_utc": 1631280632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are all early, you know it, I know it, we all know it. But I just saw something that made me realize how much momentum crypto really has. I&#39;m watching the opening night of the NFL and right there in prime time was a commercial for FTX. If the SEC wanted to damage crypto, they should have tried a few years ago. Now we have commercials during football games. Football games are the highest rated programs on television every single year, and all those eyes just saw a commercial for a crypto exchange. This train has no brakes and not even the SEC can slow it down!</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/plb71r/we_are_all_early_you_know_who_is_too_late_the_sec/",
  "subreddit": "CryptoCurrency",
  "id": "plb71r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We are all early, you know it, I know it, we all know it. But I just saw\nsomething that made me realize how much momentum crypto really has. I'm watching\nthe opening night of the NFL and right there in prime time was a commercial for\nFTX. If the SEC wanted to damage crypto, they should have tried a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、早い者勝ちです。あなたも、私も、皆それを知っています。しかし、私はあるものを見て\n暗号がどれだけ勢いがあるかを実感したことがあります。私はNFLのオープニングナイトを見ていました。\nNFLのオープニングナイトを見ていたのですが、ちょうどプライムタイムにFTXのコマーシャルが流れていました。\nFTXです。SECが暗号にダメージを与えたいのであれば、彼らは...",
      "title": "みんな早い！遅すぎるのは誰かわかる？SECです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都很早，你知道，我知道，我们都知道。但我刚刚看到\n的东西，让我意识到加密货币真的有多大的发展势头。我在看\nNFL的开幕之夜，就在黄金时段，有一个FTX的广告。\nFTX的广告。如果美国证券交易委员会想破坏加密货币，他们应该尝试一个...",
      "title": "我们都来早了，你知道谁来晚了吗？证监会。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都很早，你知道，我知道，我們都知道。但我剛剛看到\n的東西，讓我意識到加密貨幣真的有多大的發展勢頭。我在看\nNFL的開幕之夜，就在黃金時段，有一個FTX的廣告。\nFTX的廣告。如果美國證券交易委員會想破壞加密貨幣，他們應該嘗試一個...",
      "title": "我們都來早了，你知道誰來晚了嗎？證監會。"
    }
  ]
}