{
  "author": "MmeElky",
  "the_new_excerpt": "I'm wondering which funds would be best for me to put my pathetic nest egg into.\nI'd like to see my investments grow, but I also know that at my age, I may need\nto be more conservative.\n\nI'm 72 and trying to improve my finances in my old age. Due to circumstances and\ndumb business decisions earlier…",
  "original_created_utc": 1621014044,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、自分の哀れな巣ごもりのために、どのファンドに投資するのがベストなのか悩んでいます。\n私は自分の投資が成長するのを見たいと思っていますが、私の年齢では、より保守的になる必要があるかもしれないとも思っています。\nより保守的になる必要があることもわかっています。\n\n私は72歳で、老後のために財政を改善しようとしています。事情があって、以前に愚かなビジネス上の決定をしてしまったため\n私は72歳ですが、老後の経済状態を改善しようとしています。",
      "title": "婆さんはどうすればいいんだ！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想知道哪些基金最适合我把我那可怜的窝蛋放进去。\n我希望看到我的投资增长，但我也知道，在我这个年龄，我可能需要\n要更加保守。\n\n我今年72岁，正试图在我的晚年改善我的财务状况。由于环境和\n早期愚蠢的商业决定...",
      "title": "一个老太太能做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想知道哪些基金最適合我把我那可憐的窩蛋放進去。\n我希望看到我的投資增長，但我也知道，在我這個年齡，我可能需要\n要更加保守。\n\n我今年72歲，正試圖在我的晚年改善我的財務狀況。由於環境和\n早期愚蠢的商業決定...",
      "title": "一個老太太能做什麼？"
    }
  ],
  "title": "What's an old lady to do?!",
  "created_utc": 1621018712,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m wondering which funds would be best for me to put my pathetic nest egg into. I&#39;d like to see my investments grow, but I also know that at my age, I may need to be more conservative.</p>\n\n<p>I&#39;m 72 and trying to improve my finances in my old age. Due to circumstances and dumb business decisions earlier in my life, I don&#39;t have a large nest egg. My husband and I live on our Social Security, a reverse mortgage and my income from part time job. I definitely started saving for retirement late, but I&#39;m trying to catch up as best I can.</p>\n\n<p>I have a Roth IRA at Vanguard and a 401K through my job. There&#39;s $13,000 in each of those accounts. I also have about $10,000 in CDs as an emergency fund. Each month I put a total of $750 into the Roth, 401k and savings. The Vanguard funds are VWINX and VWUSA. The 401K is in a VG Target Retirement 2035, a Target Retirement Income Trust Select and a fund consisting of Lowe&#39;s stock.</p>\n\n<p>At present, I don&#39;t need to withdraw any money from these funds. I don&#39;t have any other debts besides the typical living expenses, utilities, food, gasoline, auto insurance.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/Bogleheads/comments/ncedbz/whats_an_old_lady_to_do/",
  "subreddit": "Bogleheads",
  "id": "ncedbz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590802221
}