{
  "author": "misomiso82",
  "the_new_excerpt": "I know in WW2 Hitler seemed to hate the Czechs, and I'm very confused as why -\nas far as I understand it the Czechs were another Germanic Ethnic group?\n\nWhat was the attitude to the Czechs, and Bohemia during the process of German\nunification? Were they thought of as fellow Germans? Were they…",
  "original_created_utc": 1620302230,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "第二次世界大戦中、ヒトラーはチェコ人を嫌っていたようですが、その理由については非常に困惑しています。\n私の理解では、チェコ人はゲルマン民族の一員だったのではないでしょうか？\n\nドイツ統一の過程において、チェコ人とボヘミアに対する態度はどのようなものでしたか？\nドイツ統一の過程において、チェコやボヘミアはどのような態度をとっていたのでしょうか？彼らは同じドイツ人として考えられていたのでしょうか？彼らは...",
      "title": "ドイツ統一の時代、ドイツ人はチェコ人を同じドイツ人として、あるいはスラブ人として考えていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道在二战中，希特勒似乎很讨厌捷克人，我很困惑，为什么？\n据我所知，捷克人是另一个日耳曼民族的群体？\n\n在德国统一的过程中，对捷克人和波西米亚的态度是什么？\n统一的过程中，对捷克人和波希米亚的态度如何？他们被认为是德国人的同胞吗？他们是...",
      "title": "在德国统一时期，德国人认为捷克人是德国同胞还是斯拉夫人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道在二戰中，希特勒似乎很討厭捷克人，我很困惑，爲什麼？\n據我所知，捷克人是另一個日耳曼民族的羣體？\n\n在德國統一的過程中，對捷克人和波西米亞的態度是什麼？\n統一的過程中，對捷克人和波希米亞的態度如何？他們被認爲是德國人的同胞嗎？他們是...",
      "title": "在德國統一時期，德國人認爲捷克人是德國同胞還是斯拉夫人？"
    }
  ],
  "title": "During the period of the Unification of Germany, did the Germans think of the Czechs as fellow Germans or Slavs?",
  "created_utc": 1620352228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know in WW2 Hitler seemed to hate the Czechs, and I&#39;m very confused as why - as far as I understand it the Czechs were another Germanic Ethnic group?  </p>\n\n<p>What was the attitude to the Czechs, and Bohemia during the process of German unification?  Were they thought of as fellow Germans?  Were they treated well by the Austrian Empire?  </p>\n\n<p>Many thanks</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/n65kay/during_the_period_of_the_unification_of_germany/",
  "subreddit": "AskHistorians",
  "id": "n65kay",
  "is_self": true,
  "media": null,
  "is_video": false
}