{
  "author": "TessaigaVI",
  "the_new_excerpt": "Ever since this subreddit has gained a lot of new comers you're starting to see\na lot of complaining. I've noticed people in this sub are constantly looking for\nsomeone to blame and it's usually crypto YouTubers. Most of you are not stupid\nbut a most of you are lazy. You follow these crypto…",
  "original_created_utc": 1616635914,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "自从这个subreddit有了很多新来的人，你开始看到\n很多的抱怨。我注意到这个子里的人不断地在寻找\n有人要责怪，通常是加密优步的人。你们大多数人都不傻\n但你们大多数人都很懒。你跟着这些加密...",
      "title": "不受欢迎的意见。Crypto YouTubers不是问题所在. 你只是懒惰和贪婪。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "自從這個subreddit有了很多新來的人，你開始看到\n很多的抱怨。我注意到這個子裏的人不斷地在尋找\n有人要責怪，通常是加密優步的人。你們大多數人都不傻\n但你們大多數人都很懶。你跟着這些加密...",
      "title": "不受歡迎的意見。Crypto YouTubers不是問題所在. 你只是懶惰和貪婪。"
    }
  ],
  "title": "Unpopular opinion: Crypto YouTubers are not the problem. You're just lazy and greedy.",
  "created_utc": 1616698748,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ever since this subreddit has gained a lot of new comers you&#39;re starting to see a lot of complaining. I&#39;ve noticed people in this sub are constantly looking for someone to blame and it&#39;s usually crypto YouTubers. Most of you are not stupid but a most of you are lazy. You follow these crypto youtubers every word, you fall for the clickbait titles and blame them when they shilled altcoin doesn&#39;t work out on your favor. Stop acting like children. These videos are not law, they&#39;re all opinion but you&#39;re acting like if you don&#39;t invest in the shilled altcoin you&#39;ll lose out on gains. You&#39;re greedy as fuck. When the bear market hits, I can&#39;t wait to see where the witchhunt goes. I&#39;m so sick of people on this sub not talking personal responsibility. Bitboy, Ivan and others are not the problem. You&#39;re just greedy as fuck without doing research and you deserve it. </p>\n\n<p>This sub has turned into a witch hunting angry children looking for someone to blame.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/mcmik5/unpopular_opinion_crypto_youtubers_are_not_the/",
  "subreddit": "CryptoCurrency",
  "id": "mcmik5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357135568
}