{
  "author": "htii_",
  "original_created_utc": 1649605250,
  "title": "Do toxic substances all share a similar sort of molecular makeup? If so, would we be able to use that information on an alien world to determine if the vegetation would be toxic for humans to eat, or would we have to just try it and find out?",
  "created_utc": 1649618120,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know that for most of human history, we discovered toxic substances by having Dave try them, and if he died then we all knew not to eat it. But, if we were to have aliens bring us a cuisine or be on an alien world with vegetation, could we test for certain molecular structures to know if the item in question would be toxic to humans?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/askscience/comments/u0k6ie/do_toxic_substances_all_share_a_similar_sort_of/",
  "subreddit": "askscience",
  "id": "u0k6ie",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know that for most of human history, we discovered toxic substances by having\nDave try them, and if he died then we all knew not to eat it. But, if we were to\nhave aliens bring us a cuisine or be on an alien world with vegetation, could we\ntest for certain molecular structures to know if the item…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人類の歴史の大半は、有毒な物質を発見するために、持っていることを知っています。\nデイブが試してみて、もし彼が死んだら、それを食べてはいけないと皆知っていたのです。しかし、もし私たちが\n宇宙人が料理を持ってきたり、植物が生い茂る異世界に行ったりすることで\nある分子構造を検査することで、その品物が...",
      "title": "有害物質も同じような分子構造をしているのでしょうか？もしそうなら、異世界でその情報を使って、人間が食べても毒にならない植物かどうかを判断できるのでしょうか、それとも食べてみないとわからないのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，在人类历史的大部分时间里，我们是通过让戴夫尝试来发现有毒物质的。\n戴夫尝试它们，如果他死了，那么我们都知道不能吃它。但是，如果我们\n外星人给我们带来美食，或者在一个有植被的外星世界，我们能否\n测试某些分子结构以了解该物品是否...",
      "title": "有毒物质是否都有一种类似的分子构成？如果是这样的话，我们是否能够利用外星世界的这些信息来确定人类食用的植被是否有毒，还是说我们只能通过尝试来发现问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，在人類歷史的大部分時間裏，我們是通過讓戴夫嘗試來發現有毒物質的。\n戴夫嘗試它們，如果他死了，那麼我們都知道不能喫它。但是，如果我們\n外星人給我們帶來美食，或者在一個有植被的外星世界，我們能否\n測試某些分子結構以瞭解該物品是否...",
      "title": "有毒物質是否都有一種類似的分子構成？如果是這樣的話，我們是否能夠利用外星世界的這些信息來確定人類食用的植被是否有毒，還是說我們只能通過嘗試來發現問題？"
    }
  ]
}