{
  "author": "Fantastic-Ad9218",
  "original_created_utc": 1652460092,
  "title": "Is it weird for a guy to envy girls because they get to shave their armpits?",
  "created_utc": 1652465267,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a heterosexual guy, but for some reason, I find armpit hair repulsive. Arm and leg hair on myself, I&amp;#39;m ok with, but armpit hair just feels gross. Whenever I see girls with their hairless armpits, I envy them because it looks so neat and clean. I wish I could have hairless armpits like them but it&amp;#39;s not socially acceptable and would weird out some people if I did remove the hair.&lt;/p&gt;\n\n&lt;p&gt;But is it weird that I feel this way and want to shave my armpit hair off?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/uovuhy/is_it_weird_for_a_guy_to_envy_girls_because_they/",
  "subreddit": "NoStupidQuestions",
  "id": "uovuhy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a heterosexual guy, but for some reason, I find armpit hair repulsive. Arm\nand leg hair on myself, I'm ok with, but armpit hair just feels gross. Whenever\nI see girls with their hairless armpits, I envy them because it looks so neat\nand clean. I wish I could have hairless armpits like them but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は異性愛者ですが、なぜかワキ毛には嫌悪感を覚えます。腕\n腕や足の毛は大丈夫なんですが、ワキ毛は気持ち悪いんです。いつ見ても\nワキ毛のない女の子を見ると、とてもきれいでうらやましくなります。\n羨ましいです。私も彼女たちのように毛のないワキになりたいけど...。",
      "title": "男が女子を羨むのは、ワキ毛を剃ってもらえるからというのは変な話ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个异性恋者，但由于某些原因，我觉得腋毛令人厌恶。胳膊\n我可以接受自己的手臂和腿毛，但腋下的毛发感觉很恶心。无论何时\n我看到女孩的腋窝没有毛发，我就羡慕她们，因为她们的腋窝看起来很整洁\n和干净。我希望我也能像她们一样拥有无毛的腋窝，但是......",
      "title": "一个男人羡慕女孩，因为她们可以刮腋毛，这很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個異性戀者，但由於某些原因，我覺得腋毛令人厭惡。胳膊\n我可以接受自己的手臂和腿毛，但腋下的毛髮感覺很噁心。無論何時\n我看到女孩的腋窩沒有毛髮，我就羨慕她們，因爲她們的腋窩看起來很整潔\n和乾淨。我希望我也能像她們一樣擁有無毛的腋窩，但是......",
      "title": "一個男人羨慕女孩，因爲她們可以刮腋毛，這很奇怪嗎？"
    }
  ]
}