{
  "author": "penqwins",
  "original_created_utc": 1660873141,
  "title": "Do people not know how to have fun anymore without smoking weed/being high?",
  "created_utc": 1660918952,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don’t smoke or do drugs because of work. I’ve smoked weed before, but not anymore and idk I feel like I’d rather not do it again. It’s been a while.&lt;/p&gt;\n\n&lt;p&gt;Anyways, it’s like every time I hang out with friends, they always want to be high.  &lt;/p&gt;\n\n&lt;p&gt;For example, we would just be setting up for a volleyball game at a park and everyone’s like “hold up before that let’s all take a hit.”&lt;/p&gt;\n\n&lt;p&gt;Like every single occasion — hiking, dining, arcade, bowling, etc., it’s “Yo bro lemme get your pen,” “Yo bro lemme take a pull, this food is a boutta hit diff,” “I’m so smacked broo (LMAO)”&lt;/p&gt;\n\n&lt;p&gt;Like you can’t just enjoy the food sober? Y’all can’t enjoy a peaceful hike and appreciate nature? I just wanna play some football, some sports, get fking exhausted, eat some good ass food, and crash at home. &lt;/p&gt;\n\n&lt;p&gt;I mean as the sober one of the group it’s funny watch them laugh at literally nothing and just talk random shit. But sometimes I just want to have a regular, sober chat about things. And it doesn’t feel all that “fitting” to talk about that in an atmosphere where one dude is sober and his friends are all high. &lt;/p&gt;\n\n&lt;p&gt;I feel like i’d be killing the vibe. Like why would I ask “yo bro how’s work, how’s your family doing” when everyone else’s like “Yo why is the floor mad dry LMAO” or some random shit. In these cases all of our conversations are usually random asf.&lt;/p&gt;\n\n&lt;p&gt;Also, for concerts and raves, it’s like everybody NEEDS to be on something to enjoy the music. “Yooo the drop is a boutta hit diff”. Am I the only one who can vibe and dance to the music sober? People can do the same but would rather experience it high it seems.&lt;/p&gt;\n\n&lt;p&gt;It’s better though when I’m tipsy or drunk, like better in a way that I could be on their mental level while they’re high, whenever we go hang out. I totally worded that in a weird way but hope you know what I mean.&lt;/p&gt;\n\n&lt;p&gt;What are your thoughts? Thanks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/ws0zw2/do_people_not_know_how_to_have_fun_anymore/",
  "subreddit": "TooAfraidToAsk",
  "id": "ws0zw2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don’t smoke or do drugs because of work. I’ve smoked weed before, but not\nanymore and idk I feel like I’d rather not do it again. It’s been a while.\n\nAnyways, it’s like every time I hang out with friends, they always want to be\nhigh.\n\nFor example, we would just be setting up for a volleyball game…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仕事柄、タバコも薬もやらない。以前はマリファナを吸っていましたが、今は吸っていません。\nもう二度とやりたくないと思っている。久しぶりです。\n\nとにかく、友達と遊ぶたびに、彼らはいつもハイになりたがるんだ。\nハイになりたがるんだ。\n\n例えば、バレーボールの試合の準備をしてる時とか...。",
      "title": "人々はもう、マリファナを吸わずに／ハイにならずに楽しむ方法を知らないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为工作关系，我不抽烟也不吸毒。我以前吸过大麻，但现在不吸了。\n不再抽了，我觉得我宁愿不再抽了。已经有一段时间了。\n\n总之，每次我和朋友出去玩的时候，他们总是想要\n高。\n\n例如，我们只是在为排球比赛做准备......",
      "title": "人们不知道如何在不抽大麻/不嗑药的情况下获得乐趣了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲工作關係，我不抽菸也不吸毒。我以前吸過大麻，但現在不吸了。\n不再抽了，我覺得我寧願不再抽了。已經有一段時間了。\n\n總之，每次我和朋友出去玩的時候，他們總是想要\n高。\n\n例如，我們只是在爲排球比賽做準備......",
      "title": "人們不知道如何在不抽大麻/不嗑藥的情況下獲得樂趣了嗎？"
    }
  ]
}