{
  "author": "hankthehippo_",
  "original_created_utc": 1655952449,
  "title": "As much as you love your spouse, what type of proposal would disappoint you? (location, time, amounts of people, certain event, etc.)",
  "created_utc": 1656000183,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I just came across a video of a man kneeling down at the end of a marathon line waiting for his girlfriend to finish. Personally, wtf? Imagine coming close to the finish line and see someone in the distance kneeling down with a ring in their hands and as you come closer, you realize it&amp;#39;s your partner. I couldn&amp;#39;t imagine the physical exhaustion of running all that time and being excited to finish but you can&amp;#39;t calm down or recuperate because you&amp;#39;re getting proposed to. The people on the sidelines watching, other runners finishing and seeing this moment, and just being sweaty and gross after running. In a public situation (friends, family, strangers, whoever) with like 10+ people, I would feel pressured to say yes even if I do want to say yes, which I feel would take away the genuine feeling of that moment. Like any relationship, it&amp;#39;s personal between the two of you and I feel like the proposal needs to be as well, to both experience the genuine feeling you have in that moment with each other. Presence of others would make me feel judged by the way I react, pressured, and just make me anxious. So what does everyone think PERSONALLY? I&amp;#39;m not bashing anyone or judging anyone if they would prefer what I would not. Everyone is different socially, romantically, etc.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/vimhux/as_much_as_you_love_your_spouse_what_type_of/",
  "subreddit": "TooAfraidToAsk",
  "id": "vimhux",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I just came across a video of a man kneeling down at the end of a marathon line\nwaiting for his girlfriend to finish. Personally, wtf? Imagine coming close to\nthe finish line and see someone in the distance kneeling down with a ring in\ntheir hands and as you come closer, you realize it's your…"
}