{
  "author": "industriousness",
  "the_new_excerpt": "We are so early in the advent of the cryptocurrency world. All of the prices we\nare seeing today were unthinkable a few days or weeks ago, let alone back in\n2009. Who knows what they will look like in 2030? So many studies - and\nschadenfreude anecdotes - reveal that the people who do best across the…",
  "original_created_utc": 1612984429,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们在加密货币世界的出现是如此之早。我们所有的价格\n今天所看到的是几天或几周前不可想象的，更不用说是在今天的\n2009. 谁知道2030年他们会是什么样子？这么多的研究--以及\n学霸趣闻--揭秘各地做得最好的人...",
      "title": "还有人的策略仅仅是持有十年、二十年、三十年不卖吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們在加密貨幣世界的出現是如此之早。我們所有的價格\n今天所看到的是幾天或幾周前不可想象的，更不用說是在今天的\n2009. 誰知道2030年他們會是什麼樣子？這麼多的研究--以及\n學霸趣聞--揭祕各地做得最好的人...",
      "title": "還有人的策略僅僅是持有十年、二十年、三十年不賣嗎？"
    }
  ],
  "title": "Is anyone else's strategy simply to hold and not sell for ten, twenty or thirty years?",
  "created_utc": 1613000150,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are so early in the advent of the cryptocurrency world. All of the prices we are seeing today were unthinkable a few days or weeks ago, let alone back in 2009. Who knows what they will look like in 2030? So many studies - and schadenfreude anecdotes - reveal that the people who do best across the world of investing are those who simply hold through everything and restrain themselves from ever trading. (I think there was a famous Felicity study about the stock market that found that dead people&#39;s accounts usually outperformed living people&#39;s accounts, however I cannot find a source for this upon doing a cursory google search, so if anyone has heard of the same study, please let us know what it was.) My game plan is simply a little bit of euro cost averaging each month for the next few decades, never selling, and using a bit of cash on the side whenever there are huge dips or if a new cryptocurrency with potential pops up and I find myself particularly compelled by it. </p>\n\n<p>Is anyone else the same? I feel like this should be the textbook method of making the most out of your money. And it also means that you lose nothing if, say, in twenty or thirty years, the world had completely converted to cryptocurrencies and government-backed fiat monies became obsolete.</p>\n</div><!-- SC_ON -->",
  "score": 690,
  "permalink": "/r/CryptoCurrency/comments/lh17ws/is_anyone_elses_strategy_simply_to_hold_and_not/",
  "subreddit": "CryptoCurrency",
  "id": "lh17ws",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123197397
}