{
  "author": "sfjetsetter",
  "the_new_excerpt": "TLDR: Naked shorting appears prevalent in GME, and if true was likely aided by\nDTCC, whom by extension may have shut down the short squeeze on 1/28 because it\nwould've caused a massive scandal had the squeeze happened. (This post has a lot\nof sources but in order to push this through I've had to…",
  "original_created_utc": 1613162692,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：裸露的做空在GME中似乎很普遍，如果属实很可能是由\n戴德梁行，以此类推，他可能在1/28关闭了空头压榨，因为它\n如果发生挤压，会引起巨大的丑闻。(这篇文章有很多\n的来源，但为了推动这个通过我不得不... ...",
      "title": "赤裸裸的做空GME，怎么突然就拼凑起来了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：裸露的做空在GME中似乎很普遍，如果屬實很可能是由\n戴德梁行，以此類推，他可能在1/28關閉了空頭壓榨，因爲它\n如果發生擠壓，會引起巨大的醜聞。(這篇文章有很多\n的來源，但爲了推動這個通過我不得不... ...",
      "title": "赤裸裸的做空GME，怎麼突然就拼湊起來了？"
    }
  ],
  "title": "Naked shorting in GME and how the pieces suddenly fit together",
  "created_utc": 1613168930,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: <strong>Naked shorting appears prevalent in GME, and if true was likely aided by DTCC, whom by extension may have shut down the short squeeze on 1/28 because it would&#39;ve caused a massive scandal had the squeeze happened</strong>. (This post has a lot of sources but in order to push this through I&#39;ve had to remove most of the link, you can pm me for sources if you&#39;d like)</p>\n\n<p>I was doing some research on naked shorting in the context of GME which led me down a rabbit hole of pieces connecting with each other as it relates to GME. I was taking notes while reading and below are the results of my notes. This is still a hypothesis and theory but appears supported by numerous pieces of the puzzle, I could be wrong but personally the pieces seem clear to me now:</p>\n\n<p>One of the interesting things about GME and a big part of what triggered the short squeeze happening is the extraordinarily large short interest percentage reported by Finra to be 226%, and later in the range of 150% percent of total float. Another interesting factor is the extraordinarily high number of FTIDs (<a href=\"https://wherearetheshares.com/\">https://wherearetheshares.com/</a>). Both are strong indicators of the practice of naked short selling which in general is illegal. In addition there have been many indications that there are far more shares out there then should exist. Where do these shares come from? One potential explanation is covering using synthetic long shares or counterfeit shares caused by naked shorting.</p>\n\n<p>I’m an entrepreneur, not a finance expert, so I started doing some more digging on naked short selling to educate myself more on the subject. I started withreading SEC Regulation SHO which deals with naked short selling. “Failures to deliver may result from either a short or a long sale. There may be legitimate reasons for a failure to deliver. For example, human or mechanical errors or processing delays can result from transferring securities in physical certificate rather than book-entry form, thus causing a failure to deliver on a long sale within the normal three-day settlement period. <strong>A fail may also result from “naked” short selling</strong>.”</p>\n\n<p>Interesting. We have a consistent and very high rate of FTIDs dating from 2020 and beyond, an indicator that the stock has potentially been naked shorted for a long time.</p>\n\n<p>According to former Chairman of the SEC Christopher Cox, “Abusive <strong>naked short sales... can be used as a tool to drive down a company&#39;s stock price</strong> to the detriment of all of its investors. The Commission is particularly concerned about <strong>persistent failures to deliver in the market</strong> for some securities that may be due to loopholes in the Commission&#39;s Regulation SHO, adopted just two years ago… Selling short without having stock available for delivery, and <strong>intentionally failing to deliver stock within the standard three-day settlement period, is market manipulation that is clearly violative of the federal securities laws</strong>… We are particularly concerned about the potential negative effect that <strong>substantial and persistent fails to deliver may be having on the market in some securities.</strong> Specifically, these fails to deliver can deprive shareholders of the benefits of ownership - voting, lending, and dividends from issuers. Moreover, <strong>they can be indicative of abusive naked short selling, which could be used as a tool to drive down a company&#39;s stock price</strong>.</p>\n\n<p>In a different speech Mr Cox re-iterated that short selling helps prevent &quot;irrational exuberance and bubbles. But <strong>when someone fails to borrow and deliver the securities needed to make good on a short position, after failing even to determine that they can be borrowed, that is not contributing to an orderly market – it is undermining it.”</strong> Mr Cox also “referred to &quot;the serious problem of abusive naked short sales” as “<strong>a tool to drive down a company&#39;s stock price</strong>&quot; and that the SEC is &quot;concerned about the persistent failures to deliver in the market for some securities that may be due to <strong>loopholes in Regulation SHO</strong>&quot;</p>\n\n<p>As another datapoint, Robert J. Shapiro, former undersecretary of commerce for economic affairs has claimed that <strong>naked short selling has cost investors $100 billion and driven 1,000 companies into the ground</strong>.</p>\n\n<p>I also read ‘<strong>One complaint about naked shorting from targeted companies is that the practice dilutes a company&#39;s shares</strong> for as long as unsettled short sales sit open on the books. This has been alleged to create &quot;<strong>phantom&quot; or &quot;counterfeit&quot; shares</strong>, sometimes going from trade to trade without connection to any physical shares, and <strong>artificially depressing the share price’</strong>”. Shortly after, I read that Matt Taibbi contended the use of naked shorting and counterfeit shares was the tactic used to help kill both Bear Sterns and Lehman Brothers. Taibbi said that the two firms got a &quot;push&quot; into extinction from &quot;a flat-out counterfeiting scheme called naked short-selling&quot;.</p>\n\n<p>All these sources above seem to support the theory that GME stock was wildly naked shorted, which put funds in the risk of being badly short squeezed. If investing on the basis of the extraordinarily high short interest percentage, GME was a prime candidate for a short squeeze to happen -- potentially even an infinite short squeeze. On 1/26 Elon tweeted about Gamestop and that was the day the stock entered the mainstream for a lot of people and retail investors began to really pile on to the stock outside of WSB. The goal of this was to push the stock price up and trigger a short squeeze, the theorized losers would be the funds that naked shorted and would be stuck in the squeeze.</p>\n\n<p>On 1/28 Thursday when the stock had immense momentum from the moment pre-trading started (the stock shot up to 513 in pre-trading) and it looked like the squeeze was going to happen that day, the momentum was suddenly shut down when RHood (where many or potentially majority of retail investors were on) were shut off from the ability to buy GME stock and only allow selling, followed by several other brokers. Many believe this was a result of collusion and that this shut down allowed badly besieged hedge funds to close some positions while the public was shut out of buying (but funds were not.) When this happened people were upset at RHood suspecting it was a result of potential collusion between RHoodand Citadel (which along with Point72 invested a lifeline of 2.5 billion to Melvin Capital, one of the short side funds, and is also responsible for something like 40% of RHoods entire revenue by buying their order books), but many also speculated collusion with DTCC itself. Now, personally speaking, its kind of crazy to think about DTCC being complicit in something like this. However, looking into the details of what happened, a skeptical part of me became suspicious.</p>\n\n<p>Apparently what triggered the shut down on trading GME on that day was DTCC sending a letter at 4 am to RHood requiring them to come up with 3 billion dollars. So it sounds like it was essentially this DTCC letter that led to the shut down of the momentum on GME and the short squeeze happening. On that day, there were theories thrown out that DTCC was potentially complicit in the naked short selling of GME and intentionally did this to stem the massive blow back/scandal if an infinite short squeeze did happen. Assuming the price of share of the price rocketed to 1000 or beyond (which would be likely in the event of a short squeeze or infinite short squeeze), hedge funds would likely go bankrupt as financially speaking there would be no way they would be able to cover all their shorts, and presumably entities that lent the short side hedge fund the shares to short would be holding the bag. Worse, DTCC would be exposed for being complicit in this entire thing, I imagine it would be an incredible scandal to say the least.</p>\n\n<p>Then I read something that caught my eye… DTCC has had a history of being at the center and source of naked shorts. From an article dating back to 2007, “Depository Trust &amp; Clearing Corp. is a little-known institution in the nation&#39;s stock markets with a seemingly straightforward job: It is the middleman that helps ensure delivery of shares to buyers and money to sellers. About 99% of the time, trades are completed without incident. But about 1% of the shares -- valued at about $2.5 billion on a given a day -- aren&#39;t delivered to the buyer within the requisite three days, for one reason or another. <strong>These &quot;failures to deliver&quot; have put DTCC in the middle of a long-running fight over whether unscrupulous investors are driving down hundreds of small companies&#39; share prices</strong>.”</p>\n\n<p>Apparently the DTCC has been known to be allowing or complicit in this action for a very long time. According to Wall Street Journal “<strong>There is no dispute that illegal naked shorting happens. The fight is over how prevalent the problem is -- and the extent to which DTCC is responsible</strong>. Some companies with falling stock prices say it is rampant and blame DTCC as the keepers of the system where it happens. DTCC and others say it isn&#39;t widespread enough to be a major concern.”</p>\n\n<p>&quot;It has been alleged in <strong>tens or hundreds of lawsuit</strong>s that the DTCC and its <strong>Prime Broker owners have abused their monopoly position to create numerous techniques that allow for the creation of counterfeit shares through naked shorting</strong> that facilitate stock manipulation by hedge funds. Law suits have been brought against Merrell. Lynch, Goldman Sachs, Morgan Stanley, JP Morgan, UBS, other market makers and also the DTCC. The Prime Brokers and DTCC have fought back ferociously against these lawsuits with great success and <strong>have been largely successful in blocking attempts to gain access to their transaction data bases. The information that they do release is incomplete, self-serving and misleading</strong>.</p>\n\n<p>As a thought experiment, lets say naked shorting is rampant in GME (many many indicators point to this) and lets say DTCC was ultimately responsible for allowing a wide scale naked shorting campaign on GME, wouldn’t it be in their best interest to make sure this doesn’t get out and blow up in their faces? Something to consider. Because had they not done what they did on 1/28 Thursday, many traders believe the squeeze would’ve happened that day.</p>\n\n<p>From the Wall Street Journal: “The Securities and Exchange Commission has viewed naked shorting as a serious enough matter to have made two separate efforts to restrict the practice. The latest move came last month, when the SEC further tightened the rules regarding when stock has to be delivered after a sale. But <strong>some critics argue the SEC still hasn&#39;t done enough</strong>… Some delivery failures linger for weeks or months. Until that failure is resolved, there are effectively additional shares of a company&#39;s stock rattling around the trading system in the form of the shares credited to the buyer&#39;s account, critics say. <strong>This &quot;phantom stock&quot; can put downward pressure on a company&#39;s share price by increasing the supply… Critics contend DTCC has turned a blind eye to the naked-shorting problem.”</strong></p>\n\n<p>From everything I’ve seen, as someone who has been an observer and a participant of this saga starting from 1/26, many things look very fishy and there are a lot of red flags people have documented. I personally hold the following hypothesis:</p>\n\n<ul>\n<li>GME shorts engaged in rampant naked shorting which lead to the short interest of the stock being 221% and 150% at various times, and as late as 1/28 reported by S3 to be 122%</li>\n<li>GME shorts potentially hid their positions via a loophole of generating synthetic longs and using those to “cover” their positions but not truly covering, which is illegal to cover using this particular method, and which has the effect of delaying the short needing to be closed, potentially betting on retail investors to lost interest and price to go back down before they truly close</li>\n<li>As a result of naked shorting a large amount of counterfeit shares are floating in the market leading to there being far more GME shares then the actual float</li>\n<li>The counterfeit shares can/have been used in aggressive naked short attacks to further drive down the price of GME, which may have led to the precipitous price drop starting last Monday and which may have also been aided by if they were able to artificially cover their shorts using synthetic long shares</li>\n<li>Due to the widespread naked shorting that all signs are pointing to, DTCC which has had history of being accused of turning a blind eye to naked shorts, may’ve turned a blind eye to the rampant naked shorting happening in GME</li>\n<li>There was potentially collusion on 1/28 to stop the short squeeze from happening whereby DTCC may be involved and may be implicated had the squeeze happened due to the position of naked shorts, it would have been an unbelievable scandal if exposed.</li>\n</ul>\n\n<p><strong>If you care about this case, you might asking yourself now, what I can do? You can:</strong></p>\n\n<p>- Tweet, email or write a letter to your local congressman. Feel free to send them this post if you&#39;d like or summarize the issue for them.</p>\n\n<p>- Notify the SEC</p>\n\n<p>- Contact any journalists you know, forward this post to them, let them know the story and why its significant.</p>\n\n<p>- Spread the word through word of mouth, twitter, etc. Share this post as much as you can.</p>\n\n<p><strong>Edit: Matt Taibbi&#39;s rolling stone article is highly relevant and good reading on this subject</strong> <a href=\"https://www.rollingstone.com/feature/wall-streets-naked-swindle-194908/\"><strong>https://www.rollingstone.com/feature/wall-streets-naked-swindle-194908/</strong></a><strong>, so many parallels that the signs are hard to miss. Even if you&#39;ve read it before, recommend reading it again. Shows me that if the hypothesis posed is true, Prime brokers are likely complicit. Prime brokers also happen to own the DTCC.</strong></p>\n\n<p><strong>This brings up another interesting thought experiment a Redditor brought up: On 1/28 when the price was 450+ and shorts were likely under 100, if we assume prime brokers allowed naked shorting in GME, then when the squeeze was about to happen (or happening), if brokers margin called the shorts, they would presumably also go down because shorts would not be able to pay in that event and the brokers would be holding the bag. By that logic, they have every incentive in this case to NOT to margin call because doing would also taken them down and they would lose a lot of money. Instead the most logical option would probably be to make a backroom deal, which is what I personally think mostly likely happened.</strong></p>\n</div><!-- SC_ON -->",
  "score": 772,
  "permalink": "/r/stocks/comments/likb1g/naked_shorting_in_gme_and_how_the_pieces_suddenly/",
  "subreddit": "stocks",
  "id": "likb1g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623036
}