{
  "author": "questions1223232",
  "original_created_utc": 1656764114,
  "title": "If a Tunguska-like meteoroid impact event happens every few hundred years, then what are some others from our recent recorded history?",
  "created_utc": 1656798938,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everywhere I look up the Tunguska event of 1908, it seems to suggest that a meteoroid of this size impacts Earth every few hundred  years. Some go so far as to put it at around every three hundred years. But I couldn&amp;#39;t find references to any other impact event of this scale from the last two millennia. What am I missing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/askscience/comments/vpqiqy/if_a_tunguskalike_meteoroid_impact_event_happens/",
  "subreddit": "askscience",
  "id": "vpqiqy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Everywhere I look up the Tunguska event of 1908, it seems to suggest that a\nmeteoroid of this size impacts Earth every few hundred years. Some go so far as\nto put it at around every three hundred years. But I couldn't find references to\nany other impact event of this scale from the last two…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1908年のツングースカ事件については、どこを調べても、示唆に富んでいるようです。\nこの大きさの隕石が数百年おきに地球に衝突しているようだ。中には\n300年に一度という説もある。しかし\nこの規模の隕石が地球に衝突したという文献は見つかりませんでした。",
      "title": "ツングースカのような隕石衝突現象が数百年に一度起こるのであれば、最近の記録では他にどのようなものがあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我查找1908年通古斯卡事件的每一个地方，似乎都在暗示，一个\n这样大小的流星体每隔几百年就会撞击地球。有些人甚至认为\n说大约每三百年就有一次。但是我找不到关于\n任何其他这种规模的撞击事件...",
      "title": "如果类似通古斯卡的流星体撞击事件每隔几百年就会发生一次，那么在我们最近的历史记录中，还有哪些流星体？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我查找1908年通古斯卡事件的每一個地方，似乎都在暗示，一個\n這樣大小的流星體每隔幾百年就會撞擊地球。有些人甚至認爲\n說大約每三百年就有一次。但是我找不到關於\n任何其他這種規模的撞擊事件...",
      "title": "如果類似通古斯卡的流星體撞擊事件每隔幾百年就會發生一次，那麼在我們最近的歷史記錄中，還有哪些流星體？"
    }
  ]
}