{
  "author": "NikkiRPG",
  "the_new_excerpt": "Sorry if it sounds confusing. Basically, I don't remember ever having a role\nmodel to look up to or to mentor me. I grew up with people I absolutely don't\nwant to be like. They set bad examples and I try to do what's necessary to not\nbecome like them. Anyone else have similar stories? How did you…",
  "original_created_utc": 1623690429,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "わかりづらかったらごめんなさい。基本的に私は、尊敬するモデルや指導者がいたという記憶がありません。\n尊敬したり、指導を受けたりするようなロールモデルがいた記憶はありません。私は、絶対にこうなりたくないと思う人たちと一緒に育ちました。\nのようになりたくない人たちと一緒に育ちました。彼らは悪い手本となり、私は彼らのようにならないために必要なことをしようとします。\n努力しています。似たような話をお持ちの方はいらっしゃいますか？また、どのようにして...",
      "title": "ロールモデルではなく、こんな大人にはなりたくないと思うような人たちと一緒に育った人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这听起来很混乱，请原谅。基本上，我不记得我曾经有一个可以仰望的榜样。\n榜样，或指导我。我是在我绝对不想成为的人中长大的。\n想成为他们那样的人。他们树立了坏榜样，我努力做必要的事情，以避免成为他们那样的人。\n成为他们那样的人。还有人有类似的故事吗？你是如何...",
      "title": "还有人在成长过程中，不是与榜样一起，而是与他们不想长大的人一起吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這聽起來很混亂，請原諒。基本上，我不記得我曾經有一個可以仰望的榜樣。\n榜樣，或指導我。我是在我絕對不想成爲的人中長大的。\n想成爲他們那樣的人。他們樹立了壞榜樣，我努力做必要的事情，以避免成爲他們那樣的人。\n成爲他們那樣的人。還有人有類似的故事嗎？你是如何...",
      "title": "還有人在成長過程中，不是與榜樣一起，而是與他們不想長大的人一起嗎？"
    }
  ],
  "title": "Anyone else grow up, not with role models, but with people they didn't want to grow up like?",
  "created_utc": 1623726012,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if it sounds confusing. Basically, I don&#39;t remember ever having a role model to look up to or to mentor me. I grew up with people I absolutely don&#39;t want to be like. They set bad examples and I try to do what&#39;s necessary to not become like them. Anyone else have similar stories? How did you deal with it?</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/TooAfraidToAsk/comments/nzrld0/anyone_else_grow_up_not_with_role_models_but_with/",
  "subreddit": "TooAfraidToAsk",
  "id": "nzrld0",
  "is_self": true,
  "media": null,
  "is_video": false
}