{
  "author": "conflicted_luddite",
  "the_new_excerpt": "I see constant posts complaining about people buying our not buying the dip.\nPeople holding orbit holding. People taking profit or not taking profit.\n\nI'm just here:\n\nNot investing what I can't just write off.\n\nDollar cost averaging.\n\nOnly really buying and holding a few of the top coins.\n\nIf…",
  "original_created_utc": 1620495179,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ディップを買った人、買わなかった人の文句の投稿が絶えませんね。\n保有している人、していない人。利益を出している人、出していない人。\n\n私はただここにいるだけです。\n\n償却できないものは投資しない。\n\nドルコスト平均法。\n\n上位のコインを数枚だけ買って持っている。\n\nもし...",
      "title": "誰もが静かに標準的なアドバイスに従っているだけで、ほとんどがサブを読んで部屋の中を少しずつ読んでいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到不断有帖子抱怨人们买入或不买入跌停板。\n人们持有的是轨道上的东西。人们获利或不获利。\n\n我就在这里。\n\n不投资于我不能直接注销的东西。\n\n美元成本平均法。\n\n只真正购买和持有几个顶级硬币。\n\n如果...",
      "title": "还有人只是静静地遵循标准建议，主要是看子看一下房间吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到不斷有帖子抱怨人們買入或不買入跌停板。\n人們持有的是軌道上的東西。人們獲利或不獲利。\n\n我就在這裏。\n\n不投資於我不能直接註銷的東西。\n\n美元成本平均法。\n\n只真正購買和持有幾個頂級硬幣。\n\n如果...",
      "title": "還有人只是靜靜地遵循標準建議，主要是看子看一下房間嗎？"
    }
  ],
  "title": "Does anyone else just quietly follow the standard advice, mostly reading the sub to read the room a bit?",
  "created_utc": 1620536046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see constant posts complaining about people buying our not buying the dip. People holding orbit holding. People taking profit or not taking profit.</p>\n\n<p>I&#39;m just here:</p>\n\n<p>Not investing what I can&#39;t just write off.</p>\n\n<p>Dollar cost averaging.</p>\n\n<p>Only really buying and holding a few of the top coins. </p>\n\n<p>If there&#39;s a big dip I do a months worth of DCA that day.</p>\n\n<p>I have a set number at which point I&#39;ll recoup my initial.</p>\n\n<p>I have a set number at which point I&#39;ll make a large purchase in the case of a real bear market.</p>\n\n<p>If those numbers never come then I&#39;ll never make those moves.</p>\n\n<p>I have 2-3 long term plans depending on how things go (one of which is that it all goes to 0).</p>\n\n<p>I don&#39;t post often and certainly not every time the price shifts 10% any direction.</p>\n\n<hr/>\n\n<p>I can&#39;t be the only one right?</p>\n\n<p>I mostly just read here and a few other sites to sort of read the general community sentiment.</p>\n\n<p>Maybe I&#39;ll never win the alt coin lottery but that&#39;s not what I&#39;m here for.</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/n7u6kg/does_anyone_else_just_quietly_follow_the_standard/",
  "subreddit": "CryptoCurrency",
  "id": "n7u6kg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990896
}