{
  "author": "Dwez1337",
  "original_created_utc": 1624900626,
  "title": "Bitcoins Whitepaper is now being Censored across the Internet (even on Bitcoin.org)",
  "created_utc": 1624912641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoins whitepaper is now being censored across the internet by Craig Wright, who claims to be Satoshi Nakamoto. Now the owner of Bitcoin.org is forced to pay at least $48,600 and remove the whitepaper from the website. Wright is nowhere in the community accepted as being the person behind Satoshi, but he abuses the legal system to claim this. He is also promoting his own (unsuccesful, its more than 200 times smaller than Bitcoin) shitcoin and tries to harm the classic Bitcoin as much as possible. <a href=\"https://www.ussc.gov/sites/default/files/pdf/training/annual-national-training-seminar/2018/Emerging_Tech_Bitcoin_Crypto.pdf\">Download Bitcoins whitepaper here and tell people that he is not Satoshi if they claim he is.</a></p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/o9ouel/bitcoins_whitepaper_is_now_being_censored_across/",
  "subreddit": "CryptoCurrency",
  "id": "o9ouel",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bitcoins whitepaper is now being censored across the internet by Craig Wright,\nwho claims to be Satoshi Nakamoto. Now the owner of Bitcoin.org is forced to pay\nat least $48,600 and remove the whitepaper from the website. Wright is nowhere\nin the community accepted as being the person behind Satoshi,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインのホワイトペーパーが、クレイグ・ライトによってインターネット上で検閲されています。\nサトシ・ナカモトを名乗るCraig Wright氏によってインターネット上で検閲されています。現在、Bitcoin.orgのオーナーは、少なくとも48,600ドルを支払い、ウェブサイトからホワイトペーパーを削除することを余儀なくされています。\n少なくとも48,600ドルを支払い、ウェブサイトからホワイトペーパーを削除することを余儀なくされている。ライトはどこにも\nライトは、サトシの背後にいる人物であるとコミュニティで受け入れられていません。",
      "title": "Bitcoins Whitepaperがインターネット上で検閲されている（Bitcoin.orgでも"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比特币白皮书现在被Craig Wright在互联网上审查。\n他自称是中本聪。现在，Bitcoin.org的所有者被迫支付\n至少48,600美元，并从网站上删除白皮书。赖特现在在\n在社会上被认为是中本聪背后的人，...",
      "title": "比特币白皮书现在被整个互联网审查（甚至在Bitcoin.org上）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣白皮書現在被Craig Wright在互聯網上審查。\n他自稱是中本聰。現在，Bitcoin.org的所有者被迫支付\n至少48,600美元，並從網站上刪除白皮書。賴特現在在\n在社會上被認爲是中本聰背後的人，...",
      "title": "比特幣白皮書現在被整個互聯網審查（甚至在Bitcoin.org上）。"
    }
  ]
}