{
  "author": "RCViking44",
  "original_created_utc": 1626055228,
  "title": "How many wealthy Russians escaped in 1917+, and at one point was it \"too late\" (if ever) to leave with your assets largely intact? Could you just...get on a train with a suitcase of gold?",
  "created_utc": 1626066899,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am aware that the Czar and his ministers (as the &#39;Stones so helpful remind me) didn&#39;t fare so well, but I am interested in the broad class of Petrograd bankers, royal 3rd cousins, and general cocktail-party types. I assume these made up the core of what was later called &quot;White Emigres&quot;, but did many get out in March of &#39;17 (or even earlier)? Was emigration safe? Was it controlled?</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/AskHistorians/comments/oihoha/how_many_wealthy_russians_escaped_in_1917_and_at/",
  "subreddit": "AskHistorians",
  "id": "oihoha",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am aware that the Czar and his ministers (as the 'Stones so helpful remind me)\ndidn't fare so well, but I am interested in the broad class of Petrograd\nbankers, royal 3rd cousins, and general cocktail-party types. I assume these\nmade up the core of what was later called \"White Emigres\", but did…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、皇帝とその大臣（「ストーンズ」が私に親切に教えてくれたように）がそれほどうまくいかなかったことを知っています。\nしかし、私が興味を持っているのは、ペトログラードの幅広い層の\nしかし、私が興味を持っているのは、ペトログラードの銀行家、王室の3番目のいとこ、そして一般的なカクテルパーティーのタイプの人々です。私はこれらが\n後に「白人移民」と呼ばれる人たちの中核をなしていたと思いますが、それは...。",
      "title": "1917年以降、どれだけの裕福なロシア人が脱出したのか、そしてある時点で、資産をほぼそのままにして出発するには「遅すぎた」のか（もしそうなら）？金塊の入ったスーツケースを持って列車に乗ることはできたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，沙皇和他的大臣们（正如 \"石头 \"所提醒我的那样）过得并不好。\n但我对彼得堡的广大阶层感兴趣的是\n银行家、皇室三表弟和一般鸡尾酒会上的人。我认为这些\n构成了后来被称为 \"白色移民 \"的核心，但是...。",
      "title": "在1917年以上，有多少富有的俄罗斯人逃了出来，在某一时刻，在你的资产基本完好的情况下离开是否 \"太晚\"（如果有的话）？你能不能......带着一箱黄金上火车？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，沙皇和他的大臣們（正如 \"石頭 \"所提醒我的那樣）過得並不好。\n但我對彼得堡的廣大階層感興趣的是\n銀行家、皇室三表弟和一般雞尾酒會上的人。我認爲這些\n構成了後來被稱爲 \"白色移民 \"的核心，但是...。",
      "title": "在1917年以上，有多少富有的俄羅斯人逃了出來，在某一時刻，在你的資產基本完好的情況下離開是否 \"太晚\"（如果有的話）？你能不能......帶着一箱黃金上火車？"
    }
  ]
}