{
  "author": "rpaverion",
  "original_created_utc": 1633003671,
  "title": "Do NOT buy ALGO on Binance if you want to participate in the governance program!!",
  "created_utc": 1633012345,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To participate in the Algorand governance program, you need to deposit your Algo in one of the supported wallets. </p>\n\n<p>Binance has conveniently disabled ALGO withdrawals a few days ago by putting it in “maintenance mode”. Up until today it said withdrawals would be re-enabled on 30 september. I just checked again and now it says 15 October. </p>\n\n<p>Maybe they’re scared of a large Algo outflow? Smells of manipulation.</p>\n\n<p>Anyway, don’t buy ALGO on Binance, you won’t be able to withdraw to the supported wallets for the governance program. Be warned!</p>\n\n<p>EDIT: the sign up period for the first period of the governance program is 1-15 Oct so they are definitely trying to screw people over</p>\n</div><!-- SC_ON -->",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/pyif4i/do_not_buy_algo_on_binance_if_you_want_to/",
  "subreddit": "CryptoCurrency",
  "id": "pyif4i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To participate in the Algorand governance program, you need to deposit your Algo\nin one of the supported wallets.\n\nBinance has conveniently disabled ALGO withdrawals a few days ago by putting it\nin “maintenance mode”. Up until today it said withdrawals would be re-enabled on\n30 september. I just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルゴランドのガバナンスプログラムに参加するには、サポートされているウォレットにアルゴを入金する必要があります。\nをサポートされているウォレットの一つに預ける必要があります。\n\nBinanceは、数日前にALGOの引き出しを「メンテナンスモード」にして、都合よく無効にしました。\nメンテナンスモード」にしました。今日まで、引き出しは9月30日に再び有効になると言っていました。\n9月30日です。私はただ...",
      "title": "ガバナンスプログラムに参加したいのであれば、BinanceでALGOを購入してはいけません！！。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "要参与Algorand治理计划，你需要将你的Algo\n在一个受支持的钱包中。\n\n几天前，Binance通过将ALGO置于 \"维护模式\"，方便地禁止ALGO提款。\n处于 \"维护模式\"。到今天为止，它说提款将在9月30日重新启用。\n9月30日重新启用。我只是...",
      "title": "如果你想参与治理计划，请不要在Binance上购买ALGO！!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "要參與Algorand治理計劃，你需要將你的Algo\n在一個受支持的錢包中。\n\n幾天前，Binance通過將ALGO置於 \"維護模式\"，方便地禁止ALGO提款。\n處於 \"維護模式\"。到今天爲止，它說提款將在9月30日重新啓用。\n9月30日重新啓用。我只是...",
      "title": "如果你想參與治理計劃，請不要在Binance上購買ALGO！!"
    }
  ]
}