{
  "author": "Numerous_Sport_2774",
  "original_created_utc": 1643886494,
  "title": "Crypto isn’t going to magically make you rich, get a job.",
  "created_utc": 1643895640,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is probably a massively unpopular option.&lt;/p&gt;\n\n&lt;p&gt;I see a lot of people on this sub saying that crypto is their path to financial freedom, early retirement and a lambo. Many of these people boast a portfolio of up to 100% in crypto. &lt;/p&gt;\n\n&lt;p&gt;If you don’t have much invested to begin with, let’s say $10,000 or equivalent in your country (which I’m sure is more than a lot of people have in crypto), then you would have to see some out of this world gains to get rich.&lt;/p&gt;\n\n&lt;p&gt;What people actually need to do is to invest in themselves, get a good job and funnel some decent earnings into crypto. That being said it needs to be in a proportion that goes with a high risk investment. Other things like property and stocks can’t be overlooked. &lt;/p&gt;\n\n&lt;p&gt;Sometimes I get the impression people here are selling lemonade out the front of their house and putting $20 into crypto a week expecting to get rich.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 469,
  "permalink": "/r/CryptoCurrency/comments/sjgkhx/crypto_isnt_going_to_magically_make_you_rich_get/",
  "subreddit": "CryptoCurrency",
  "id": "sjgkhx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is probably a massively unpopular option.\n\nI see a lot of people on this sub saying that crypto is their path to financial\nfreedom, early retirement and a lambo. Many of these people boast a portfolio of\nup to 100% in crypto.\n\nIf you don’t have much invested to begin with, let’s say $10,000 or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはおそらく、大不評の選択肢でしょう。\n\nこのサブサイトで多くの人が 暗号は経済的な道だと言っていますが\n自由と早期退職とランボを手に入れる。これらの人々の多くは\n暗号を100%まで\n\nそもそも投資額が少ない場合、例えば1万ドルとか...。",
      "title": "暗号は魔法のようにあなたを豊かにするものではありません、仕事をしましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能是一个非常不受欢迎的选择。\n\n我看到这个网站上有很多人说加密货币是他们实现财务自由、提前退休和获得兰博的途径。\n自由、提前退休和获得兰博的途径。这些人中有许多人吹嘘自己的投资组合是\n高达100%的加密货币投资。\n\n如果你一开始投资不多，比方说10,000美元或......",
      "title": "Crypto不会神奇地让你发财，找一份工作吧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能是一個非常不受歡迎的選擇。\n\n我看到這個網站上有很多人說加密貨幣是他們實現財務自由、提前退休和獲得蘭博的途徑。\n自由、提前退休和獲得蘭博的途徑。這些人中有許多人吹噓自己的投資組合是\n高達100%的加密貨幣投資。\n\n如果你一開始投資不多，比方說10,000美元或......",
      "title": "Crypto不會神奇地讓你發財，找一份工作吧。"
    }
  ]
}