{
  "author": "Weaver96",
  "the_new_excerpt": "Don't let anyone bring you down because you can only afford $100 to invest in\ncrypto. If a few hundred dollars is a significant amount for you, then the gains\non that will also be significant. Time in the market is a huge factor, so if\nyou're young and patient, chances are you'll make decent money…",
  "original_created_utc": 1614338544,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "不要因为你只有100元的投资能力而被人打倒\n加密货币。如果几百美元对你来说是一笔不小的数目，那么收益的\n上，也将是重要的。在市场上的时间是一个巨大的因素，所以如果\n年纪轻，有耐心，有机会赚大钱...",
      "title": "我不在乎你是投资100美元还是100万美元。你在为你的未来做一些事情，我们都应该尊重这一点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要因爲你只有100元的投資能力而被人打倒\n加密貨幣。如果幾百美元對你來說是一筆不小的數目，那麼收益的\n上，也將是重要的。在市場上的時間是一個巨大的因素，所以如果\n年紀輕，有耐心，有機會賺大錢...",
      "title": "我不在乎你是投資100美元還是100萬美元。你在爲你的未來做一些事情，我們都應該尊重這一點。"
    }
  ],
  "title": "I don't care if you invested $100 or $1M. You're doing something for your future and we should all respect that.",
  "created_utc": 1614350165,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don&#39;t let anyone bring you down because you can only afford $100 to invest in crypto. If a few hundred dollars is a significant amount for you, then the gains on that will also be significant. Time in the market is a huge factor, so if you&#39;re young and patient, chances are you&#39;ll make decent money even with less invested. </p>\n\n<p>Moreover, a smaller investment at first is ideal to test the waters, it gives you time to properly understand how crypto works, and do your own research on several projects.</p>\n\n<p>I was also a broke college student when I put my first $200 in crypto in 2017. I wasn&#39;t really active in this sub because I felt like I was not part of this community. Most of the guys here were talking about lambos &amp; yachts, and to be honest, at first I would&#39;ve been super happy to just double my investment and buy gas to visit my GF more frequently.  </p>\n\n<p>Only invest what you can afford to lose, do your own research, and don&#39;t be afraid to ask!</p>\n</div><!-- SC_ON -->",
  "score": 12102,
  "permalink": "/r/CryptoCurrency/comments/lsvqeu/i_dont_care_if_you_invested_100_or_1m_youre_doing/",
  "subreddit": "CryptoCurrency",
  "id": "lsvqeu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937735127
}