{
  "author": "AO4710",
  "original_created_utc": 1637615116,
  "title": "Have people gotten away from Satoshi Nakamoto's vision?",
  "created_utc": 1637685554,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I reread Satoshi Nakamoto&#39;s whitepaper from time to time. Please check me if I am wrong but based on what I read, I feel like bitcoin&#39;s intention was not to replace the dollar or base the price off of the dollar. Most of the posts I see here or anywhere is about seeing if it will reach a certain fiat dollar value. And it shouldn&#39;t be that way. Am I wrong in this thinking? Should I continue to say to myself &quot;btc will reach hit 100k&quot;, When in reality its intention was to facilitate a medium of exchange without the need for a central authority? If bitcoin gets mass adoption it should become deflationary. Now with the lightning network speeding transactions, why stress over how much the price of bitcoin fluctuates when it should provide an actual service as it was intended to be? I just feel like if this thing is intended to revert it back to fiat to make purchases and &quot;get rich&quot; off of fiat then somehow we have distorted Satoshi&#39;s vision. Maybe we shouldn&#39;t be looking at it like some &quot;store of value&quot; because what value are we placing it on? Fiat? I dunno i&#39;m just thinking maybe at the moment it is a store of wealth, but not for long when it gets mass adopted. What are your thoughts on this?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/qzvth9/have_people_gotten_away_from_satoshi_nakamotos/",
  "subreddit": "Bitcoin",
  "id": "qzvth9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I reread Satoshi Nakamoto's whitepaper from time to time. Please check me if I\nam wrong but based on what I read, I feel like bitcoin's intention was not to\nreplace the dollar or base the price off of the dollar. Most of the posts I see\nhere or anywhere is about seeing if it will reach a certain…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中本哲史氏のホワイトペーパーを時々読み返しています。間違っていたらご指摘ください。\nビットコインの意図は、ドルに取って代わることでも、価格のベースにすることでもないように感じます。\nビットコインの意図は、ドルに取って代わることや、ドルを基準とした価格設定ではないように感じます。ここでもどこでも、私が見たほとんどの投稿は\nここやどこで見ても、ビットコインがある一定の価格に達するかどうかを確認するためのものです...",
      "title": "サトシ・ナカモトのビジョンから人々は離れてしまったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不时地重读中本聪的白皮书。如果我是错的，请检查我\n但根据我读到的内容，我觉得比特币的目的不是为了\n取代美元或以美元为基础的价格。我看到的大多数帖子\n我在这里或任何地方看到的大多数帖子都是关于看它是否会达到某个...",
      "title": "人们是否已经脱离了中本聪的愿景？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不時地重讀中本聰的白皮書。如果我是錯的，請檢查我\n但根據我讀到的內容，我覺得比特幣的目的不是爲了\n取代美元或以美元爲基礎的價格。我看到的大多數帖子\n我在這裏或任何地方看到的大多數帖子都是關於看它是否會達到某個...",
      "title": "人們是否已經脫離了中本聰的願景？"
    }
  ]
}