{
  "author": "partymsl",
  "original_created_utc": 1658610994,
  "title": "Next week is going to be very brutal for Crypto. Let's take a look at the many events happening that influence crypto.",
  "created_utc": 1658638571,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After we have had a bit of a relief, now shit us actually getting real as we are going to enter probably one of the worst or at least most interesting week for the stock markets, crypto and the world in general. So you gotta keep an open mind throughout the week and be ready for everything. Here the list of most important events:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Earnings, a lot of Earnings. As it&amp;#39;s earnings season right now at the stock market and we already had a dull with snapchat falling -35% and losing billions. Now it&amp;#39;s actually getting real with much of big tech like Apple and Microsoft reporting. Bad will cause stock markets to melt and with a high correlation also crypto.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;FOMC. This is probably the biggest event of the week where we will actually get our rate hike, whether it&amp;#39;s 75bps or 100bps is to be seen. A 100bps would definitely cause havoc over the markets as already a 75vps last month did make markets melt.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;GDP Q2 numbers, this could be the most important event too of its done in the week, which is it exactly clear yet (may be early August) but if the Q2 number like the Q1 number would be in the minus then the US would officially be in a recession and even if most economists knew that, the constant lying from politics could have made it unclear for many.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;A recently added event is the US dividing whether they should declare an health emergency over monkeypox. Just now the WHO declared one and Biden administration said to do it on Monday. I&amp;#39;m not expecting it to be big news but certainly some minor panic.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/w6edr5/next_week_is_going_to_be_very_brutal_for_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "w6edr5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After we have had a bit of a relief, now shit us actually getting real as we are\ngoing to enter probably one of the worst or at least most interesting week for\nthe stock markets, crypto and the world in general. So you gotta keep an open\nmind throughout the week and be ready for everything. Here…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちが少し安心した後、今度は私たちが実際に現実のものとなっているクソ。\n最悪の、あるいは少なくとも最も興味深い1週間を迎えることになるでしょう。\n株式市場、暗号、そして世界一般にとって、おそらく最悪の、あるいは少なくとも最も興味深い週を迎えようとしています。だから、あなたはオープンマインドを維持しなければならない\n週を通して心を開いて、すべてのために準備する必要があります。ここで...",
      "title": "来週はCryptoにとって非常に残酷なことになりそうです。暗号に影響を与える多くのイベントが起こっていることを見てみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我们稍稍松了一口气之后，现在我们要做的是真正地去做，因为我们是\n我们将进入可能是最糟糕的或至少是最有趣的一周，为\n股市、加密货币和整个世界最糟糕的一周。所以你必须保持开放的\n思想，并准备好迎接一切。这里...",
      "title": "下周对加密货币来说将是非常残酷的。让我们来看看发生的影响加密货币的许多事件。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們稍稍鬆了一口氣之後，現在我們要做的是真正地去做，因爲我們是\n我們將進入可能是最糟糕的或至少是最有趣的一週，爲\n股市、加密貨幣和整個世界最糟糕的一週。所以你必須保持開放的\n思想，並準備好迎接一切。這裏...",
      "title": "下週對加密貨幣來說將是非常殘酷的。讓我們來看看發生的影響加密貨幣的許多事件。"
    }
  ]
}