{
  "author": "thri54",
  "the_new_excerpt": "That title is worse than it sounds. We need to talk about shipping:\n\n\n\nFor anyone who hasn't looked at a maritime shipping/bulker/tanker company: A)\nGood choice! B) The value of these companies is almost all assets. This is one\nof the few places you'll still see companies trade at/below book value.…",
  "original_created_utc": 1613108905,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题比听起来更糟糕。我们需要谈谈航运。\n\n\n\n对于那些没有看过海运/散货/油轮公司的人来说..: A)\n好的选择! B）这些公司的价值几乎都是资产。这是一个\n的少数地方，你仍然会看到公司交易/低于账面价值....。",
      "title": "Castor Maritime ($CTRM)将以27MM美元购买两艘LR2油轮。市值猛增250MM。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題比聽起來更糟糕。我們需要談談航運。\n\n\n\n對於那些沒有看過海運/散貨/油輪公司的人來說..: A)\n好的選擇! B）這些公司的價值幾乎都是資產。這是一個\n的少數地方，你仍然會看到公司交易/低於賬面價值....。",
      "title": "Castor Maritime ($CTRM)將以27MM美元購買兩艘LR2油輪。市值猛增250MM。"
    }
  ],
  "title": "Castor Maritime ($CTRM) to buy two LR2 tankers for $27MM. Market Cap jumps $250MM.",
  "created_utc": 1613125657,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>That title is  worse than it sounds.  We need to talk about shipping:</p>\n\n<p>&#x200B;</p>\n\n<p>For anyone who hasn&#39;t looked at a maritime shipping/bulker/tanker company:  A) Good choice! B) The value of these companies is almost all assets.  This is one of the few places you&#39;ll still see companies trade at/below book value.  Star Bulker Carriers, for example, has $2.9 billion in ships, $1.5 billion in net equity, and a $1.2 Billion market cap.  Frontline has $1.5 Billion in equity, $1.3 billion market cap.  That doesn&#39;t mean you should go out and buy $SBLK or $FRO.  The business is an asset heavy, miserably unprofitable commodity service.  Everyone in the shipping industry waits around cutting their teeth until a shipping supercycle hits and they can actually profit.  They have extreme sensitivity to interest rates, and extreme sensitivity to economic downturns.</p>\n\n<p>&#x200B;</p>\n\n<p>You aren&#39;t getting $1 for $.90 buying these stocks.  You&#39;re getting the expected future cashflows from $1 of net merchant ship, which the market ascribes an NPV of  &gt;$1.</p>\n\n<p>&#x200B;</p>\n\n<p>I digress.  Castor, as of 9/30, has $30 million in ships.  Six 75,000 DWT bulkers, to be exact.  A tiny fleet. They&#39;ve now bought a Capesize and 2 LR2 tankers.  Lets call that an extra $80 million.  $110MM in ships.  Their market cap, as of close, is $880MM.  8x price/assets for merchant ships!  WHAT?  It&#39;s not uncommon for this company&#39;s peers to trade at .3x price/assets!</p>\n\n<p>&#x200B;</p>\n\n<p>That&#39;s... a bad investment.  Quite possibly the worst investment opportunity I&#39;ve ever seen.  At least most bubbles have some &quot;moonshot&quot; potential; these guys buy boats.  Sell.  Run.  This is the dumbest bubble I&#39;ve ever seen.</p>\n\n<p>&#x200B;</p>\n\n<p>TLDR:  This is the top, lads.</p>\n</div><!-- SC_ON -->",
  "score": 219,
  "permalink": "/r/investing/comments/li4uaz/castor_maritime_ctrm_to_buy_two_lr2_tankers_for/",
  "subreddit": "investing",
  "id": "li4uaz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621127
}