{
  "author": "OberynMartell94",
  "original_created_utc": 1641447973,
  "title": "I can't be the only one who thinks that most of the \"Buy the dip\" dudes are full of shit.",
  "created_utc": 1641458682,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before you say OP is just mad because he is in the red: I am well in the green and I don&amp;#39;t care even if there is a 90% flash crash, I only invest what I can afford to lose.  &lt;/p&gt;\n\n&lt;p&gt;Every single time there there is a small correction this sub gets bombarded with &amp;quot;Did you buy the dip? Oh man you better buy the dip!&amp;quot;, &amp;quot;What coins are you guys buying this dip?&amp;quot;, &amp;quot;Yo, bro I wish the dip was 50% so I could buy more&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;If people in this sub bought the dip as much as they claim to in their posts I am pretty positive we would have ran out of some coins in the market. To me these posts are no different than someone commenting &amp;quot;To the moon&amp;quot;,&amp;quot;When Lambo?&amp;quot; or &amp;quot;Nobody knows shit about fuck&amp;quot;. Low effort bullshit that gets spammed over and over again.  &lt;/p&gt;\n\n&lt;p&gt;Just buy whatever the fuck you want, at whatever price you want.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 419,
  "permalink": "/r/CryptoCurrency/comments/rx6zdf/i_cant_be_the_only_one_who_thinks_that_most_of/",
  "subreddit": "CryptoCurrency",
  "id": "rx6zdf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Before you say OP is just mad because he is in the red: I am well in the green\nand I don't care even if there is a 90% flash crash, I only invest what I can\nafford to lose.\n\nEvery single time there there is a small correction this sub gets bombarded with\n\"Did you buy the dip? Oh man you better buy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OPは赤字だから怒ってるだけと言う前に 私は、緑色で十分です。\n私は、90％のフラッシュ・クラッシュがあっても気にしません。\n失う余裕がある。\n\n小さな調整があるたびに、このサブタイトルには次のような言葉が並びます。\n\"ディップを買ったか？やばい、買ったほうがいい...」。",
      "title": "ディップを買え」の連中のほとんどが嘘っぱちだと思うのは俺だけではないはずだ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你说OP只是生气，因为他是在红色。我现在很好，处于绿色状态\n即使有90%的闪电崩盘我也不在乎，我只投资我可以承受的\n我只投资我能够承受的损失。\n\n每次出现小幅回调时，这个子网站都会被轰炸成\n\"你买了跌停板吗？哦，你最好买...",
      "title": "我不可能是唯一一个认为大多数 \"买跌停板 \"的人是在胡说八道的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你說OP只是生氣，因爲他是在紅色。我現在很好，處於綠色狀態\n即使有90%的閃電崩盤我也不在乎，我只投資我可以承受的\n我只投資我能夠承受的損失。\n\n每次出現小幅回調時，這個子網站都會被轟炸成\n\"你買了跌停板嗎？哦，你最好買...",
      "title": "我不可能是唯一一個認爲大多數 \"買跌停板 \"的人是在胡說八道的人。"
    }
  ]
}