{
  "author": "Chicky_Nuggy",
  "original_created_utc": 1639587971,
  "title": "Bit Boy, XRP Bro, Barby Crypto and other embarrassing influencers in crypto. Who are some influencers in the space who are actually useful to listen to?",
  "created_utc": 1639611484,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As most of us know, all but some of these are just scams with extra steps to pump their own shitty bags then dump on newcomers and/or idiots on YouTube.  &lt;/p&gt;\n\n&lt;p&gt;How crypto online is ever taken seriously when you can’t tell the difference between a crypto news article on YouTube to some 12 year old kids Fortnite upload when both thumbnails look exactly the same. With emoji, stupid fonts, shocked cum faces...&lt;/p&gt;\n\n&lt;p&gt;Anyway, I was looking up for some credible analysis channels on any platforms and couldn&amp;#39;t find many, other than Crypto Dad (pretty basic though) and chain specific c suite people on Twitter. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not looking for coin shillers or moonshot bullshitting TA &amp;#39;analyst&amp;#39; more news and educational speculation.&lt;/p&gt;\n\n&lt;p&gt;Any recommendations?&lt;/p&gt;\n\n&lt;p&gt;Edit: you can save yourself from replying with DYOR etc, I&amp;#39;m bored over the holidays and want stuff to listen/watch. I won&amp;#39;t be taking any advice as gospel. I am not a retard.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/rh3u0b/bit_boy_xrp_bro_barby_crypto_and_other/",
  "subreddit": "CryptoCurrency",
  "id": "rh3u0b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As most of us know, all but some of these are just scams with extra steps to\npump their own shitty bags then dump on newcomers and/or idiots on YouTube.\n\nHow crypto online is ever taken seriously when you can’t tell the difference\nbetween a crypto news article on YouTube to some 12 year old kids…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちの多くが知っているように、これらのすべては、一部を除いて、余分な手順を踏んだ詐欺に過ぎません。\nYouTubeで新参者やバカを相手に、自分たちのクソみたいな袋を押し付ける。\n\nオンライン暗号は、あなたがその違いを見分けることができないとき、これまで真剣に取られています。\nYouTubeの暗号のニュース記事と12歳の子供たちの間で...",
      "title": "ビットボーイ、XRPブロ、バービークリプトなど、暗号にまつわる恥ずかしいインフルエンサーたち。実際に耳を傾けるのに役立つ、この分野のインフルエンサーは誰でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如我们大多数人所知道的那样，所有这些都是骗局，但有些是有额外步骤的。\n然后在YouTube上向新来者和/或白痴倾销他们自己的垃圾袋。\n\n当你无法区分YouTube上的加密货币新闻文章与一些12岁的人的区别时，网上的加密货币怎么会被认真对待呢？\n当你无法区分YouTube上的加密货币新闻文章与一些12岁的孩子之间的区别时......",
      "title": "Bit Boy、XRP Bro、Barby Crypto和其他令人尴尬的加密货币影响者。谁是这个领域的一些有影响力的人，他们的意见实际上是有用的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如我們大多數人所知道的那樣，所有這些都是騙局，但有些是有額外步驟的。\n然後在YouTube上向新來者和/或白癡傾銷他們自己的垃圾袋。\n\n當你無法區分YouTube上的加密貨幣新聞文章與一些12歲的人的區別時，網上的加密貨幣怎麼會被認真對待呢？\n當你無法區分YouTube上的加密貨幣新聞文章與一些12歲的孩子之間的區別時......",
      "title": "Bit Boy、XRP Bro、Barby Crypto和其他令人尷尬的加密貨幣影響者。誰是這個領域的一些有影響力的人，他們的意見實際上是有用的？"
    }
  ]
}