{
  "author": "ryuk_luvs_apples",
  "original_created_utc": 1642088373,
  "title": "Polygon has announced that its long awaited London hard fork, which will be initiating the burning of MATIC tokens, is set to go live by January 18.",
  "created_utc": 1642131458,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yesterday, Polygon has announced that it’s long awaited EIP-1559 upgrade is set to take place by January 18 (about 8a.m UTC). This upgrade is set to change the entire fee market operations on the Ethereum network, as it will be bringing a discrete fee base that is burned instead of being paid to the miners, and an elimination to the first-price auction mechanism.&lt;/p&gt;\n\n&lt;p&gt;This upgrade won’t be having a direct impact on the gas fees, but it will be allowing the users to estimate the costs better.&lt;/p&gt;\n\n&lt;p&gt;Another main impact of this upgrade is that it’ll be having a deflationary impact on MATIC. Since Polygon’s total supply of tokens is fixed at 10 billion, the reduction of the token number will be having a direct deflationary impact on the asset. A we know, 0.27% of the total supply will be burned annually, which means 27 million MATIC. &lt;/p&gt;\n\n&lt;p&gt;This upgrade is going to have a positive impact on the dApps users, as they’ll be enjoying even lower fees, and developers will be receiving a boost as well. Not to forget that the EIP 1559 will also minimize the number of spam transactions and the network congestion. &lt;/p&gt;\n\n&lt;p&gt;Finally, will this upgrade have a direct impact on MATIC’s price?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/s328qt/polygon_has_announced_that_its_long_awaited/",
  "subreddit": "CryptoCurrency",
  "id": "s328qt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Yesterday, Polygon has announced that it’s long awaited EIP-1559 upgrade is set\nto take place by January 18 (about 8a.m UTC). This upgrade is set to change the\nentire fee market operations on the Ethereum network, as it will be bringing a\ndiscrete fee base that is burned instead of being paid to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、Polygonは待望のEIP-1559アップグレードが決定したことを発表しました。\n1月18日（UTC午前8時頃）までに実施する予定です。このアップグレードにより\nイーサリアムネットワーク上の手数料市場全体の運用を可能にするためです。\n手数料を支払う代わりに、燃やされる個別の手数料ベース...",
      "title": "ポリゴンは、MATICトークンの燃焼を開始する待望のロンドンハードフォークを、1月18日までに稼働させると発表しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天，Polygon公司宣布，它期待已久的EIP-1559升级将在1月18日（大约8点）之前进行。\n将于1月18日（UTC时间上午8点左右）进行。这次升级将改变\n以太坊网络上的整个收费市场运作，因为它将会带来一个\n离散的费用基础，而不是支付给...",
      "title": "Polygon宣布，其期待已久的伦敦硬分叉，将在1月18日前启动MATIC代币的燃烧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天，Polygon公司宣佈，它期待已久的EIP-1559升級將在1月18日（大約8點）之前進行。\n將於1月18日（UTC時間上午8點左右）進行。這次升級將改變\n以太坊網絡上的整個收費市場運作，因爲它將會帶來一個\n離散的費用基礎，而不是支付給...",
      "title": "Polygon宣佈，其期待已久的倫敦硬分叉，將在1月18日前啓動MATIC代幣的燃燒。"
    }
  ]
}