{
  "author": "HMHype",
  "original_created_utc": 1625350858,
  "title": "What major environment impact differences are caused by a “typical” oil spill vs one that sets on fire?",
  "created_utc": 1625381014,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most people have seen the video of the Pemex oil spill in the Gulf of Mexico, which is spewing flaming oil into the ocean. My first thought after that it looks like CGI from a disaster movie was that maybe it being on fire could be good since the crude oil is burning and won’t just sit in the ocean damaging wildlife. Of course the burned oil byproducts are not good for the environment either and the extra heat I’m sure is bad too.</p>\n\n<p>Basically as the title states if you’re going to have a massive oil spill what are the relative environmental impact differences of it igniting vs just spewing crude oil into the ocean?</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/askscience/comments/od7o2n/what_major_environment_impact_differences_are/",
  "subreddit": "askscience",
  "id": "od7o2n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Most people have seen the video of the Pemex oil spill in the Gulf of Mexico,\nwhich is spewing flaming oil into the ocean. My first thought after that it\nlooks like CGI from a disaster movie was that maybe it being on fire could be\ngood since the crude oil is burning and won’t just sit in the ocean…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの人が、メキシコ湾で起きているPemex社の原油流出事故の映像を見たことがあると思います。\n海に向かって燃えるような石油を噴出している。まるで災害映画のCGIのようだと思った私が最初に思ったのは\nディザスター映画のCGIのようだと思った後、私が最初に思ったのは、原油が海に流出しているのだから\n原油が燃えているのだから、海に沈むことはないだろう」と思ったのですが...。",
      "title": "一般的な油流出と火災による油流出では、環境への影響にどのような違いがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大多数人都看过墨西哥湾Pemex石油泄漏事件的视频。\n它正在向海洋中喷出燃烧的石油。我的第一个想法是，它\n我的第一个想法是，它看起来像灾难片中的CGI，也许它着火可能是\n因为原油正在燃烧，不会仅仅停留在海洋中......",
      "title": "一个 \"典型的 \"漏油事件与一个着火的漏油事件对环境造成的影响有什么不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數人都看過墨西哥灣Pemex石油泄漏事件的視頻。\n它正在向海洋中噴出燃燒的石油。我的第一個想法是，它\n我的第一個想法是，它看起來像災難片中的CGI，也許它着火可能是\n因爲原油正在燃燒，不會僅僅停留在海洋中......",
      "title": "一個 \"典型的 \"漏油事件與一個着火的漏油事件對環境造成的影響有什麼不同？"
    }
  ]
}