{
  "author": "Son0fTheSun333",
  "the_new_excerpt": "Think about it. We're in so early to the crypto game that in a few years when\nmass adoption occurs, we will 100% not see these same level of returns that we\ncan currently get right now depending on what you stake and where.\n\nI'm getting 12% off Kusama and will soon be getting 12% off DOT (when I…",
  "original_created_utc": 1616017512,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "想一想吧。我们进入加密游戏的时间太早了，所以几年后\n大规模采用，我们将100%看不到同样水平的回报，而我们\n可以目前得到的权利，现在取决于你的股权和地方。\n\n我现在得到的是草间的12%，很快就会得到DOT的12%（当我...",
      "title": "桩是他妈的涂料，哟！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想一想吧。我們進入加密遊戲的時間太早了，所以幾年後\n大規模採用，我們將100%看不到同樣水平的回報，而我們\n可以目前得到的權利，現在取決於你的股權和地方。\n\n我現在得到的是草間的12%，很快就會得到DOT的12%（當我...",
      "title": "樁是他媽的塗料，喲！"
    }
  ],
  "title": "Staking is fucking dope, yo!",
  "created_utc": 1616056229,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Think about it. We&#39;re in so early to the crypto game that in a few years when mass adoption occurs, we will 100% not see these same level of returns that we can currently get right now depending on what you stake and where. </p>\n\n<p>I&#39;m getting 12% off Kusama and will soon be getting 12% off DOT (when I can withdraw from Voyager - get your shit together, Voyager!). I have a good amount of both right now so those 12% gainz will be nice, real nice, over time. And they&#39;re safe on an exchange I trust. </p>\n\n<p>I have a bunch of ADA making 5-6% interest on Daedalus, staking in Cardano pools. I have half my ETH, BTC, and my entire stash of LINK on Celsius just sitting there earning an average of over 5% interest between the 3 of them. </p>\n\n<p>How fucking dope is this shit? My fiat never earned me interest. I can&#39;t guarantee those same returns in the current state of the stock market (although I&#39;m jacked to the tits with GME shares right now too) so I just want to say how lucky we are to be in where we are now.</p>\n\n<p>This is the future. We&#39;re here. And it&#39;s awesome.</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/m7bje6/staking_is_fucking_dope_yo/",
  "subreddit": "CryptoCurrency",
  "id": "m7bje6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147378445
}