{
  "author": "premed_thr0waway",
  "original_created_utc": 1638891813,
  "title": "Do individuals who appear older or younger than their biological age live a shorter or longer lifespan, respectively?",
  "created_utc": 1638898681,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand there are various confounding variables (ex. those appearing older than stated age may smoke, drink, have a poorly balanced diet, etc.) but if those factors are controlled as much as possible, is there a correlation between appearing age and life expectancy?&lt;/p&gt;\n\n&lt;p&gt;Love this community, interested to hear your perspectives and knowledge!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 144,
  "permalink": "/r/askscience/comments/rb1zd9/do_individuals_who_appear_older_or_younger_than/",
  "subreddit": "askscience",
  "id": "rb1zd9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand there are various confounding variables (ex. those appearing older\nthan stated age may smoke, drink, have a poorly balanced diet, etc.) but if\nthose factors are controlled as much as possible, is there a correlation between\nappearing age and life expectancy?\n\nLove this community,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "様々な交絡変数があることは理解している（例えば、年齢が高く見える人など）。\nタバコを吸う、酒を飲む、食事のバランスが悪い、などなど。\nそれらの要因を可能な限りコントロールした場合、その相関はあるのでしょうか？\n見た目年齢と平均寿命は？\n\nこのコミュニティが大好きです、、、。",
      "title": "生物学的な年齢よりも老けて見える人、若く見える人は、それぞれ寿命が短いのか、長いのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有各种混杂的变量（例如，那些看起来比所述年龄大的人可能吸烟喝酒，有便秘）。\n的人可能吸烟、喝酒、饮食不均衡等），但如果这些因素被尽可能地控制住了。\n这些因素被尽可能地控制，那么，这些因素之间是否存在关联？\n貌似年龄和预期寿命之间是否有关联？\n\n我喜欢这个社区，...",
      "title": "看起来比生理年龄大或小的人，其寿命是否分别较短或较长？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有各種混雜的變量（例如，那些看起來比所述年齡大的人可能吸菸喝酒，有便祕）。\n的人可能吸菸、喝酒、飲食不均衡等），但如果這些因素被儘可能地控制住了。\n這些因素被儘可能地控制，那麼，這些因素之間是否存在關聯？\n貌似年齡和預期壽命之間是否有關聯？\n\n我喜歡這個社區，...",
      "title": "看起來比生理年齡大或小的人，其壽命是否分別較短或較長？"
    }
  ]
}