{
  "author": "VonDerBerg",
  "the_new_excerpt": "DESCRIPTION\nCharge Point is an electric infrastructure company that designs, develops &\nmanufactures hardware & software solutions for electric vehicles at large. It\noffers a portfolio of hardware, software, & services for corporate, public, &\nresidential customers. Company was founded in 2007 and…",
  "original_created_utc": 1617712565,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "説明\nチャージポイントは、電気自動車のためのハードウェアとソフトウェアのソリューションを設計、開発、製造する電気インフラ企業です。\n電気自動車のためのハードウェアとソフトウェアのソリューションを設計・開発・製造しています。同社は\nハードウェア、ソフトウェア、サービスのポートフォリオを、企業、公共機関、家庭のお客様に提供しています。\nサービスを提供しています。同社は2007年に設立され、...",
      "title": "チャージポイント代替プレー"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "描述\nCharge Point是一家电力基础设施公司，其设计、开发和运营的业务包括\n生产电动汽车的硬件和软件解决方案。它\n为企业、公共机构和个人提供硬件、软件和服务组合。\n住宅客户。公司成立于2007年，...",
      "title": "ChargePoint另类玩法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "描述\nCharge Point是一家電力基礎設施公司，其設計、開發和運營的業務包括\n生產電動汽車的硬件和軟件解決方案。它\n爲企業、公共機構和個人提供硬件、軟件和服務組合。\n住宅客戶。公司成立於2007年，...",
      "title": "ChargePoint另類玩法"
    }
  ],
  "title": "ChargePoint Alternative Play",
  "created_utc": 1617723113,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>DESCRIPTION</strong><br/>\n Charge Point is an electric infrastructure company that <em>designs, develops &amp; manufactures hardware &amp; software solutions</em> for electric vehicles at large. It offers a portfolio of hardware, software, &amp; services for <em>corporate, public, &amp; residential customers</em>. Company was founded in 2007 and operates in 14 countries.  </p>\n\n<p>History</p>\n\n<p>In June 2017, $CHPT took over 9,800 electric vehicle charging spots from GE. Prior to that point, $CHPT managed 34,900 charging stations across Mexico, Australia, Canada, and the United States.</p>\n\n<p>The current CEO and president as of 2018 is Pasquale Romano. On November 28, 2018, $CHPT raised $240 million. At the time, $CHPT maintained 57,000 charging spots. In 2019, VW&#39;s <a href=\"https://en.wikipedia.org/wiki/Electrify_America\">Electrify America</a> and $CHPT agreed to provide common access to their US customers. Company reached 100,000 chargers in September 2019, while adding more than 2,000 charging locations per month. Currently $CHPT offers 132k charging station network. Which accounts for <strong><em>72% market share of total level 2</em></strong> charging in North America. New entity was formed from Legacy Charge Point combined with SBE (SPAC) late Feb 2021;</p>\n\n<p><strong>What is the business model of CHPT?</strong></p>\n\n<p>Charge Point sells hardware &amp; software (network subscriptions &amp; equipment) to property owners. The company doesn&#39;t own the majority of stations. It doesn&#39;t monetize energy. It only monetizes the driver, thus capital light business model.</p>\n\n<p><strong>BUSINESS OVERVIEW</strong></p>\n\n<p>· Market Cap: <strong>$6.99bn</strong> </p>\n\n<p>· Shares Float ~ 300mln</p>\n\n<p>· <strong><em>Short Interest ~70%</em></strong>, per latest short numbers the short interest is <strong>85%</strong>, but it&#39;s an old figure, which might have dissipated as price fell from ATH $49.48, an update due later this month.</p>\n\n<p>· Institutional ownership <strong>~5%</strong></p>\n\n<p>· <strong>2 Year CAGR Revenue Growth 65.65%; 5 Year 60%;</strong></p>\n\n<p>· <strong>TAM $190bn</strong></p>\n\n<p>· No Debt. Cash &amp; Cash Equivalents ~$650m. Exponential Revenue growth &amp; estimated profitability in 2024 with<br/>\n 41% Gross Margin.</p>\n\n<p>$CHPT enjoys the <a href=\"https://investors.chargepoint.com/why-invest/default.aspx\">largest share</a> of Level 2 chargers in US. Data from <a href=\"https://afdc.energy.gov/fuels/electricity_locations.html#/analyze?fuel=ELEC\">AFDC</a> shows that $CHPT wields the largest market share at 42.8K Level 2 chargers out of 92.8K total of which 11.5K are &quot;non-networked&quot;, giving $CHPT ~53% of &quot;networked&quot; chargers. No 2 competitor is Tesla with 16.8K, No3 largest, is SemaCharge Network at 5.2K, followed by Blink with 3.1k which is 4th. In terms of Level 3 &#39;<em>Superchargers</em>&#39;, where Tesla leads the way with 10.7k of 19.6k units. $CHPT is competitive with 1.5k with only Electrify America coming in higher at 2.5k. Superchargers account for ~22% of the market pie, Level 2, ~75% and Level 1, ~3% of market share.</p>\n\n<p><strong>Products</strong></p>\n\n<p>Comprehensive Hardware Portfolio Delivers<br/>\n - Solutions for every use case, all vehicle types and brands<br/>\n - High efficiency in power and footprint<br/>\n - Modular, scalable, secure architecture designed for serviceability </p>\n\n<p>- Unparalleled quality; advanced testing (vehicle, functional, climate, environment) for long-term reliability<br/>\n - Options for site hosts to use custom branding</p>\n\n<p>Software Enables<br/>\n - Control of who can use stations and when<br/>\n - All vehicles to get charged on time<br/>\n - Multiple vehicles to share power<br/>\n - Drivers to get in line when ports are occupied<br/>\n - Proactive and remote diagnosis + Power management to avoid demand charges</p>\n\n<p>- Roaming integrations with other charging networks</p>\n\n<p><strong>Challengers</strong></p>\n\n<p>· $VLTA (SNPR) Claims to go beyond just charging EVs, their chargers are used for ads and their charger placement is based on data analytics in collaboration with $PLTR. When company compares itself to the competition, they do it all - they own the gear, they sell the electricity, they provide software and networks, they do fancy data things, they do advertising. The only things they don&#39;t do are manufacture and sell the chargers. They cherry-pick a bunch of stats to show that their chargers have better &quot;engagement&quot; but given they only have 1.7k Level 2s and 6 DCFCs I wouldn&#39;t put too much stock in that. It&#39;s basically chargers-as-billboards, selected to boutique locations. <em>Anyone can replicate it, if it provides substantial revenue boost, competitors will emulate it.</em></p>\n\n<p>· SemmaConnect: Company boasts 3rd largest market share of Level 2 chargers. SemmaConnect also manufactures chargers, offers warranties and sell software. SemaConnect chargers are OCPP compliant. Sema appears not to have a DCFC offering, nor do they appear to offer sales to individuals (single-family residential).</p>\n\n<p>· $EVGO(CLII): EVgo claims to have made the first 150kW and 350kW DCFCs, and DCFCs are their game. AFDC data says they only have 403 Level 2s but 1.4k DCFCs which garners 4th market share. Company also offers drivers a membership for reduced charging rates (looks like 0.04/min assuming you spend 7.99/month) and they have integrated Tesla connectors on their newer DCFCs. They also have a nationwide infrastructure roll-out deal with GM and are entirely powered by renewables. What differentiates the company is the DCFC focus.</p>\n\n<p>· $BLNK: Overhyped POP stock. Blink sells Level 2 and DCFC chargers to business and individuals. Claims to operate on an owner/operator model. From EC:<br/>\n <em>&quot;The Company made continued progress with its owner/operator strategy; the number of commercial Blink-owned charging stations contracted or deployed during the quarter grew by 51% in the fourth quarter compared to the prior year period.&quot;</em> </p>\n\n<p>· $VWAGY Subsidiary:(Electrify America): DCFC focused company, it enjoys 2.5k DCFCs. EM also sells a Level 2 for the home. EM offers an app, membership for drivers with a monthly fee that gets you a good discount on their charging costs. The membership and cost to charge suggests that they own their chargers. EM also have an electric vehicle subscription service and have some relationships with Jeep and Hyundai. All its reports seem to be released to the California Air Resources Board. Company doesn&#39;t appear to build their own chargers, instead relying on procurement, using third-party hardware and software.</p>\n\n<p><strong>Near Term Catalysts</strong> </p>\n\n<p>In relation to upcoming US government infrastructure bill: <em>&quot;AlixPartners estimates $300 billion will be needed to build out a global charging network to accommodate the expected growth of EVs by 2030, including $50 billion in the U.S. alone.&quot;</em></p>\n\n<p>It&#39;s not too late to make bets on upcoming infrastructure bill. Yes you can dabble into construction firms and commodity plays, but you don&#39;t know which companies will win lucrative contracts and sizes of those contracts. Well the biggest companies you might say? It&#39;s not that clear cut. What is clear cut, is that the focal point of this infrastructure bill is transition to renewable energy and overhaul pivotal infrastructure. $CHPT has the most experienced (14yrs) company with largest manufacturing capacity, technical now how and ability to take on large scale projects like, building hundreds of thousands of charging stations across all states (500k by 2030). Oh yeah one more thing, <em>former $CHPT board member is in current administration.</em></p>\n\n<p>That&#39;s only US. $CHPT operates infrastructure in the hub of world&#39;s renewable energy aka Europe. (Also, Canada, Australia, UK, Mexico among other places) You find yourself at the erection of the infrastructure that you and your kids will be utilizing down the road. Just like, railways, roads, telcoms and internet.</p>\n\n<p><strong>Long Term Catalysts</strong></p>\n\n<p>- Fossil fuel bans<br/>\n - Transit electrification dates<br/>\n - Incentive programs<br/>\n - All major auto OEM brands committed to electric + Further EV cost reductions with advances in battery technology.</p>\n\n<p>$CHPT Growth Directly Proportional to EV Penetration, $CHPT Estimated $1B Revenue at 3% EV Penetration.</p>\n\n<p><strong>Miscellaneous</strong></p>\n\n<p>$CHPT Apple Store rating - 4.6.</p>\n\n<p>$CHPT also has the #1 bestselling home charging station on Amazon with hundreds of 5 star reviews.</p>\n\n<p>$CHPT offers access to hundreds of thousands of places to charge with one account via proprietary app.</p>\n\n<p>In collaborations with Daimler, Toyota, BMW, Siemens etc.</p>\n\n<p>No1 choice for Fortune 500 companies. Customers include: Google, Target, IKEA, NASA, GM, Pepsico, Disney, McDonalds, FedEx, Stanford etc.</p>\n\n<p>Shareholders lock up period ends on September 1st. </p>\n\n<p><strong>MOAT</strong></p>\n\n<p>· First Mover Advantage (With 14 years of experience in a nascent industry, this is where big contracts will go)</p>\n\n<p>· Asset light business model ( Selective ownership of charge stations, outsources maintenance &amp; responsibilities to the owner)</p>\n\n<p>· Economies of Scale ( $CHPT has largest manufacturing capacity)</p>\n\n<p>· Network Effect ( ~75% of charging network market share &amp; operations in 14 countries)</p>\n\n<p><strong>CONCLUSION</strong></p>\n\n<p>All in all $CHPT stock is a pure EV exposure, with light CapEx business model. Company is the ecosystem player with defensible MOATs, recurring revenue streams and visibility. $CHPT finds itself in ESG friendly category and attracts premium valuation due to penetrance in multiple domains: EV Ecosystem (Hardware), Software Powered Solutions and Energy Technology</p>\n\n<p>Why am I interested in $CHPT?</p>\n\n<p>Is because it entrenched leader with tremendous experience in a nascent industry?</p>\n\n<p>Is because it&#39;s a clever business model based on light assets which will subsequently offer high margins 5 years from now</p>\n\n<p><strong>And</strong> is literally replacement of GAS stations no matter what happens! And is a home &quot;GAS station&quot;.</p>\n\n<p>Is it because EVs are the future and I am catching the momentum? + ESG and inevitable supremacy and prevalence?</p>\n\n<p>Is it a small market cap in the market that will <strong><em>explode no matter what?</em></strong></p>\n\n<p><em>That’s</em> <strong><em>bananas</em></strong> but not the main reason. The main reason is high short interest well over 50% which can be taken advantage of. That&#39;s first way of making money on $CHPT. The second way, after squeeze should squoze, this is really well rounded company with superb fundamentals &amp; ~5% institutional ownership, what&#39;s going to happen to the stock when institutions commence adoption of it?  The valuation will go - <strong>bananas.</strong></p>\n\n<p><strong>This is not a financial advice, do your own research.</strong></p>\n\n<p>Sources:<br/>\n <a href=\"https://evadoption.com/ev-charging-stations-statistics/\">https://evadoption.com/ev-charging-stations-statistics/</a></p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/ChargePoint\">https://en.wikipedia.org/wiki/ChargePoint</a></p>\n\n<p>[<a href=\"https://www.myev.com/research/comparisons/comparing-public-electric-vehicle-charging-netwo\">https://www.myev.com/research/comparisons/comparing-public-electric-vehicle-charging-netwo</a></p>\n</div><!-- SC_ON -->",
  "score": 77,
  "permalink": "/r/investing/comments/mlamxt/chargepoint_alternative_play/",
  "subreddit": "investing",
  "id": "mlamxt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961877889
}