{
  "author": "TitaniumTacos",
  "the_new_excerpt": "I’ve only been investing for less than a year, so I’ve only know an economy with\nlow interest rates. What are some things I should be doing to prepare for the\n2022-2023 interest rates in terms of my portfolios?\n\nI have a retirement account that I put most of my savings in and a small\ninvesting…",
  "original_created_utc": 1624040494,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は投資を始めてまだ1年足らずなので、低金利の経済しか知りません。\n低金利の経済しか知りません。2022年～2023年の金利に備えて、ポートフォリオの観点から何かやっておくべきことはありますか？\n2022年から2023年の金利に備えて、ポートフォリオの観点から何をすべきでしょうか？\n\n私は、自分の貯蓄のほとんどを入れている退職金口座と、小さな\n投資をしています...",
      "title": "金利上昇にどう備えるべきか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只做了不到一年的投资，所以我只知道有一个经济的\n低利率的经济。我应该做哪些事情来为2022-2023年的利率做准备？\n2022-2023年的利率，在我的投资组合方面我应该做些什么？\n\n我有一个退休账户，我把大部分的储蓄都放在里面，还有一个小的\n投资...",
      "title": "我应该如何准备应对利率上升？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只做了不到一年的投資，所以我只知道有一個經濟的\n低利率的經濟。我應該做哪些事情來爲2022-2023年的利率做準備？\n2022-2023年的利率，在我的投資組合方面我應該做些什麼？\n\n我有一個退休賬戶，我把大部分的儲蓄都放在裏面，還有一個小的\n投資...",
      "title": "我應該如何準備應對利率上升？"
    }
  ],
  "title": "How should I prepare for rising interest rates?",
  "created_utc": 1624081414,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve only been investing for less than a year, so I’ve only know an economy with low interest rates. What are some things I should be doing to prepare for the 2022-2023 interest rates in terms of my portfolios? </p>\n\n<p>I have a retirement account that I put most of my savings in and a small investing account where I play around to try to gain experience. As a 23 year old I’d say I’m about ~80% in stocks and 20% bonds/ETFs. Is it more beneficial to move out of bonds and into stocks? Also what markets seem to handle high interest better? </p>\n\n<p>Cheers</p>\n</div><!-- SC_ON -->",
  "score": 44,
  "permalink": "/r/investing/comments/o2wm6j/how_should_i_prepare_for_rising_interest_rates/",
  "subreddit": "investing",
  "id": "o2wm6j",
  "is_self": true,
  "media": null,
  "is_video": false
}