{
  "author": "thekelkin",
  "original_created_utc": 1635989095,
  "title": "What happened to Nano?",
  "created_utc": 1636036571,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t get it? Zero fees, instant transactions, but yet it seems to be frowned on by many. Why did it not blow up? How is it not on Coinbase? Am I missing something? I have used nano to send small sums of money between friends and it always works so well. I even accepted Nano for a market place sell once. The buyer was so excited when he found out that I accepted crypto.  Could nano ever come back in a big way?</p>\n\n<p>I know that Nano is peer to peer, and works in a much different way than say BTC or ETH. Does this make Nano less secure, or is it simply a lack of “innovation”? </p>\n\n<p>Full disclosure: I have less than 10 Nano. I’m not looking for this to pump. I just want so insight on why it went from “neat-O” to “meh”  over time.</p>\n\n<p>Edit: this really blew up. Thank you for the rewards kind strangers!</p>\n</div><!-- SC_ON -->",
  "score": 251,
  "permalink": "/r/CryptoCurrency/comments/qm9iif/what_happened_to_nano/",
  "subreddit": "CryptoCurrency",
  "id": "qm9iif",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don’t get it? Zero fees, instant transactions, but yet it seems to be frowned\non by many. Why did it not blow up? How is it not on Coinbase? Am I missing\nsomething? I have used nano to send small sums of money between friends and it\nalways works so well. I even accepted Nano for a market place…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はそれを理解していません。手数料無料、即時取引、なのに多くの人に嫌われているようです。\n多くの人に嫌われているようです。なぜ爆発しなかったのか？なぜCoinbaseに登録されていないのか？私は何かを\n何か見逃しているのでしょうか？友人間で少額のお金を送るときにnanoを使っていますが、いつもうまくいきます。\nいつもうまくいっています。私は、マーケットプレイスのためにnanoを受け入れたこともあります...",
      "title": "ナノはどうなった？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不明白？零费用，即时交易，但它似乎被许多人所诟病\n皱眉头。为什么它没有爆炸？它怎么不在Coinbase上？我是不是错过了\n了什么？我曾用纳米币在朋友之间发送小笔资金，它\n总是那么好用。我甚至接受Nano用于市场交易...",
      "title": "纳诺怎么了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不明白？零費用，即時交易，但它似乎被許多人所詬病\n皺眉頭。爲什麼它沒有爆炸？它怎麼不在Coinbase上？我是不是錯過了\n了什麼？我曾用納米幣在朋友之間發送小筆資金，它\n總是那麼好用。我甚至接受Nano用於市場交易...",
      "title": "納諾怎麼了？"
    }
  ]
}