{
  "author": "Juub1990",
  "original_created_utc": 1660901066,
  "title": "Could you just walk into a store and buy arms and armors in medieval Europe?",
  "created_utc": 1660946021,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A common trope of fantasy games like D&amp;amp;D are armorers; you just walk in their shops and they have weapons and armors on display that anyone with the money can buy.&lt;/p&gt;\n\n&lt;p&gt;Was this ever a thing? From my understanding, armors were prohibitively expensive so I can’t imagine someone just setting up shop and selling stuff to the average joe. Additionally, full suits were often custom fitted and couldn’t just be worn by anybody.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/ws9gsp/could_you_just_walk_into_a_store_and_buy_arms_and/",
  "subreddit": "AskHistorians",
  "id": "ws9gsp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A common trope of fantasy games like D&D are armorers; you just walk in their\nshops and they have weapons and armors on display that anyone with the money can\nbuy.\n\nWas this ever a thing? From my understanding, armors were prohibitively\nexpensive so I can’t imagine someone just setting up shop and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "D&Dのようなファンタジーゲームでは、武器屋がよく登場します。\nを買うことができます。\n買うことができます。\n\nこんなのあったっけ？私の理解では、鎧は法外に高価なものでした。\n鎧は法外に高いので、誰かが店を構えて......というのは想像がつきません。",
      "title": "中世ヨーロッパでは、店に入れば武器や防具が買えたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "像D&D这样的奇幻游戏的一个常见特例是盔甲师；你只要走进他们的\n你只要走进他们的商店，他们就会陈列出武器和盔甲，任何有钱的人都可以买到。\n买。\n\n这曾经是一件事吗？根据我的理解，盔甲是非常昂贵的。\n昂贵，所以我无法想象有人会开店并......",
      "title": "在中世纪的欧洲，你可以随便走进一家商店购买武器和盔甲吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像D&D這樣的奇幻遊戲的一個常見特例是盔甲師；你只要走進他們的\n你只要走進他們的商店，他們就會陳列出武器和盔甲，任何有錢的人都可以買到。\n買。\n\n這曾經是一件事嗎？根據我的理解，盔甲是非常昂貴的。\n昂貴，所以我無法想象有人會開店並......",
      "title": "在中世紀的歐洲，你可以隨便走進一家商店購買武器和盔甲嗎？"
    }
  ]
}