{
  "author": "Set1Less",
  "original_created_utc": 1642914026,
  "title": "President of El Salvador Nayib Bukeke updates profile picture to McDonalds. No matter what happens to the price, don't lose your sense of humor",
  "created_utc": 1642923176,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Nayib Bukeke has been catching flak from all sides as many have questioned his decisions to buy Bitcoin. He recently bought the dip. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/goninpvicdd81.jpg?width=1400&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=5dac20d1b67f6706d4bc173e3858a6e6e7c043c8\"&gt;However as the dip dipped, he has changed his profile picture. &lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Atleast he is owning it. Though some will say its not his money, its his country&amp;#39;s money, but a lot of El Salvador&amp;#39;s economy now depends on Bitcoin - from volcano mining, and now their bitcoin bonds that are going to be issued for raising funds after El Salvador showed the finger to IMF. &lt;/p&gt;\n\n&lt;p&gt;Some people take hard and painful decisions in these times, that can cause pain to family and friends. Its worth remembering that money is not everything. &lt;/p&gt;\n\n&lt;p&gt;If you have lost an obscene amount of unrealised gains, its best to make peace with it than to keep beating yourself up over it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 492,
  "permalink": "/r/CryptoCurrency/comments/salofl/president_of_el_salvador_nayib_bukeke_updates/",
  "subreddit": "CryptoCurrency",
  "id": "salofl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Nayib Bukeke has been catching flak from all sides as many have questioned his\ndecisions to buy Bitcoin. He recently bought the dip.\n\nHowever as the dip dipped, he has changed his profile…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ナイブ・ブケケは各方面から非難を浴びており、多くの人が彼を疑問視している。\nビットコインを購入する決断をした。彼は最近ディップを買いました\n\nしかし、ディップが下落すると、彼はプロフィールを変更しました...",
      "title": "エルサルバドルのナイブ・ブケケ大統領がプロフィール写真をマクドナルドに更新。価格がどうなろうと、ユーモアのセンスを失わないこと"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Nayib Bukeke一直受到来自各方的抨击，因为许多人质疑他的\n购买比特币的决定。他最近买入了跌停板。\n\n然而，随着该股下跌，他已经改变了他的资料...",
      "title": "萨尔瓦多总统纳伊布-布凯克将个人照片更新为麦当劳。无论价格如何变化，都不要失去幽默感"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Nayib Bukeke一直受到來自各方的抨擊，因爲許多人質疑他的\n購買比特幣的決定。他最近買入了跌停板。\n\n然而，隨着該股下跌，他已經改變了他的資料...",
      "title": "薩爾瓦多總統納伊布-布凱克將個人照片更新爲麥當勞。無論價格如何變化，都不要失去幽默感"
    }
  ]
}