{
  "author": "Floofyboy",
  "the_new_excerpt": "First of all, when you think about it, Nasdaq only lost 7% in a month. That\nmeans the huge majority of smart money is still holding and doesn't think\nthere's a reason to panic. When smart money panics, you have the covid crash.\n\nSecondly, its important to understand why there is so much red…",
  "original_created_utc": 1614873969,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，你仔细想想，纳斯达克一个月只跌了7%。那\n意味着绝大部分聪明的资金还在持有，不认为\n有一个理由恐慌。当聪明的资金恐慌的时候，你就会有covid崩溃。\n\n其次，重要的是要明白为什么有这么多的红色... ...",
      "title": "不要惊慌，一切都会好起来的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，你仔細想想，納斯達克一個月只跌了7%。那\n意味着絕大部分聰明的資金還在持有，不認爲\n有一個理由恐慌。當聰明的資金恐慌的時候，你就會有covid崩潰。\n\n其次，重要的是要明白爲什麼有這麼多的紅色... ...",
      "title": "不要驚慌，一切都會好起來的"
    }
  ],
  "title": "Stop panicking, its going to be ok",
  "created_utc": 1614886316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, when you think about it, Nasdaq only lost 7% in a month. That means the huge majority of smart money is still holding and doesn&#39;t think there&#39;s a reason to panic. When smart money panics, you have the covid crash.</p>\n\n<p>Secondly, its important to understand why there is so much red recently. The main reason is the fear due to the rising 10 year old treasury yield. When we woke up this morning, it did spike in a scary way, but now its going back down sharply, we are fine: <a href=\"https://finance.yahoo.com/quote/%5ETNX?p=%5ETNX&amp;.tsrc=fin-srch\">https://finance.yahoo.com/quote/%5ETNX?p=^TNX&amp;.tsrc=fin-srch</a></p>\n\n<p>Now, even if this stupid 10 year old treasury yield did not go down, most people would agree these fears are irrational. Check this quick interview: <a href=\"https://ca.sports.yahoo.com/video/philadelphia-fed-harker-don-t-011809466.html\">https://ca.sports.yahoo.com/video/philadelphia-fed-harker-don-t-011809466.html</a></p>\n\n<p>Historically, the rates, they go down, not up. The fear of massive interest rates are irrational, and as i said earlier, its only ~7% of people who are pulling out of nasdaq, that&#39;s a small number of people who&#39;s irrationally fearful. Feds have been under their target of 2% for a LONG time, they aren&#39;t concerned about this.</p>\n\n<p>Additionally, Biden agreed to tighten the covid stimulus requirements. This is good news because it means its less likely to over heat the economy beyond control. And when that stimulus does get released, its hard to imagine it won&#39;t at least give a small boost to the markets.</p>\n\n<p>I also think we need to look at the bright side. Historically, most crash happens when the market overheat. Corrections like we are having right now help avoid a real full breakdown of the market, and they help buy cheaper dips.</p>\n\n<p>I also think there is a decent chance our buddy JPow props up the market today with his speech ;)</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/stocks/comments/lxnzms/stop_panicking_its_going_to_be_ok/",
  "subreddit": "stocks",
  "id": "lxnzms",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575855
}