{
  "author": "3STmotivation",
  "the_new_excerpt": "Recently I had uploaded a post regarding the investment opportunity for silver,\nwhere I go into the base investment case for this precious/industrial hybrid\nmetal. It can be found here.\n[https://www.reddit.com/r/investing/comments/kvs2ow/silver_way_more_than_just_a_precious_metal_and_an/]\n\nIn short,…",
  "original_created_utc": 1611911910,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近我曾上传过一篇关于白银的投资机会的帖子。\n在这里，我将深入探讨这种贵族/产业混合型的基础投资案例。\n金属。它可以在这里找到。\n[https://www.reddit.com/r/investing/comments/kvs2ow/silver_way_more_than_just_a_precious_metal_and_an/]\n\n总之，...",
      "title": "白银大规模反弹的机会，是全球最空头的投资资产之一。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我曾上傳過一篇關於白銀的投資機會的帖子。\n在這裏，我將深入探討這種貴族/產業混合型的基礎投資案例。\n金屬。它可以在這裏找到。\n[https://www.reddit.com/r/investing/comments/kvs2ow/silver_way_more_than_just_a_precious_metal_and_an/]\n\n總之，...",
      "title": "白銀大規模反彈的機會，是全球最空頭的投資資產之一。"
    }
  ],
  "title": "The opportunity for a massive silver rally, one of the most shorted investment assets on the planet",
  "created_utc": 1611915413,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I had uploaded a post regarding the investment opportunity for silver, where I go into the base investment case for this precious/industrial hybrid metal. It can be found <a href=\"https://www.reddit.com/r/investing/comments/kvs2ow/silver_way_more_than_just_a_precious_metal_and_an/\">here.</a></p>\n\n<p>In short, there is a massive and growing amount of demand for silver. This is partly due to the fears of inflation and devaluation of the dollar and other fiat currencies around the world, but mostly (60% of it to be exact) comes from industrial usage. People mention, and rightly so, the growing emphasis on solar, electrical vehicles and the computerization of nearly everything. What do all these things have in common? They need silver and substantially more of it the more demand for these products grows.</p>\n\n<p>With demand growing and no way to easily scale up supply (see previous post on why), we are looking at quite and attractive industrial supply/demand story backed up by the fact that it is a precious metal and often moves in tandem with gold.</p>\n\n<p>Now, onto the title, the short interest. We have seen an incredible amount of media attention for what happened to GS and the hedge funds that tried to short the stock, but a somewhat similar case can be made for the silver sector. <a href=\"https://silverseek.com/article/silver-shorts-last-stand\">This article puts it best.</a></p>\n\n<p>&quot;The 8 big shorts have been “lucky” so far, that their predicament isn’t widely recognized. I’m sure that a small number of sophisticated investors are aware of the plight of the 8 big shorts. But the simple truth is that there has been no mention of the concentrated short position in COMEX gold and silver futures by any mainstream media source. Even on the Internet, the concentrated short position is hardly mentioned. There seems to be a growing groundswell of opinion that silver is the cheapest asset around (it is) and I’m even starting to hear some ask why silver is so cheap to begin with? Let me make it easy for you – the only reason silver is so cheap is because of the concentrated short position of the 4 biggest traders, who hold more than 312 million ounces short, as of the latest COT report. When combined with the next 4 largest traders, the concentrated short position grows to nearly 404 million ounces. The connection couldn’t be more direct. Silver is the cheapest because its short position is the largest.&quot;</p>\n\n<p>In the debate about of which ETF is the best for our purposes (PSLV or SLV) I think that obviously the choice is SLV. Many people try to discredit it putting in doubt that it holds all the silver that it should, but I think that this has always been biased statements by the bullion dealers. SLV is ran by BlackRock, who have many, many, many more assets under management than the SLV (in fact SLV is one of their smallest funds). Will such a leader of the investment industry put its reputation in risk?</p>\n\n<p>Some years ago (in the darkest recent age of silver, about 2013-2015), the short interest in SLV was much higher than nowadays (about 25-30%). Ted Buttler always defended that shorting the SLV was not permitted by the ETF prospectus itself, because shorting one share inhibits the adding os one Oz of silver (you can sell one share to a new investor without issuing it). He initiated a public campaign against BlackRock by permitting it. The result was a legal threat of BlackRock to Buttler, he had to retreat, but magically the short interest started to decrease during the next weeks/months till &quot;simbolic&quot; levels. Even during this last year, where we witnessed silver inflow to the trust of several hundreds Oz Moz over the year before, the short interest of SLV itself didn&#39;t rise.</p>\n\n<p>SLV itself has no meaningful short interest itself, but the arbitrage among it and the spot/futures market make the concentrated shorts of the Comex very vulnerable. And remember, the one with the biggest and arguably most corrupt influences, JPM, is no longer in the short side, so it will not be threated and because of that will do nothing, as they only stand to benefit from it.</p>\n\n<p>Advantages of SLV over PSLV are clear:</p>\n\n<ul>\n<li><p>Much more available on brokers (unless in Europe due to MiFid II)</p></li>\n<li><p>Much more liquid</p></li>\n<li><p>And of course, it has options!!</p></li>\n</ul>\n\n<p>As you can see, what we have here is a combination of an important precious and industrial metal that is being held short to a significant extent, with an extremely attractive supply/demand case for the coming decade to be made as well. Make sure to do your own research on this as well, but in my opinion it is clear that this market is ready to go much higher. Best of luck to all of you and have a good and healthy rest of your day!</p>\n</div><!-- SC_ON -->",
  "score": 2602,
  "permalink": "/r/stocks/comments/l7o7sj/the_opportunity_for_a_massive_silver_rally_one_of/",
  "subreddit": "stocks",
  "id": "l7o7sj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537961
}