{
  "author": "KAX1107",
  "original_created_utc": 1628507559,
  "title": "Bitcoin golden cross is coming in less than 10 days. Get ready for mother of all bull cycles",
  "created_utc": 1628515964,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On June 19, Bitcoin made a death cross which is the 50 day short term moving average crossing below 200 day long term moving average.</p>\n\n<p>On July 25, the price started trending up and crossed above 50 day moving average and today it crossed the 200 day moving average as well.</p>\n\n<p>The 50 day moving average has started trending back up. If price keeps rising at this rate then it will cross back above 200 day average. This is called a golden cross and it could be happen in 1 week to 10 days time.</p>\n\n<p>Golden cross is one of the strongest signs of a new bull cycle. When it happens so soon after death cross, it shows the bulls were just taking a little break and now they&#39;re back in business.</p>\n\n<p>A face melting pump is on the way. It will make 2013 and 2017 bull cycles seem like nothing.</p>\n</div><!-- SC_ON -->",
  "score": 624,
  "permalink": "/r/CryptoCurrency/comments/p0zdgu/bitcoin_golden_cross_is_coming_in_less_than_10/",
  "subreddit": "CryptoCurrency",
  "id": "p0zdgu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On June 19, Bitcoin made a death cross which is the 50 day short term moving\naverage crossing below 200 day long term moving average.\n\nOn July 25, the price started trending up and crossed above 50 day moving\naverage and today it crossed the 200 day moving average as well.\n\nThe 50 day moving average…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "6月19日、ビットコインは50日短期移動平均線のデスクロスを作りました。\nが200日長期移動平均を下回りました。\n\n7月25日、価格は上昇トレンドに転じ、50日移動平均線を超え、今日は200日移動平均線も超えました。\n7月25日、価格は上昇トレンドに転じ、50日移動平均線を超え、今日は200日移動平均線も超えました。\n\n50日移動平均線は...",
      "title": "ビットコインのゴールデンクロスは10日以内にやってくる。ブルサイクルの母の準備を"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "6月19日，比特币出现了一个死亡交叉，即50天短期移动平均线从下往上穿过。\n突破了200天的长期移动平均线。\n\n7月25日，价格开始呈上升趋势，并越过50日移动平均线。\n今天，它也越过了200天的移动平均线。\n\n50天移动平均线...",
      "title": "比特币金叉在不到10天的时间里即将到来。准备好迎接所有牛市周期之母"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "6月19日，比特幣出現了一個死亡交叉，即50天短期移動平均線從下往上穿過。\n突破了200天的長期移動平均線。\n\n7月25日，價格開始呈上升趨勢，並越過50日移動平均線。\n今天，它也越過了200天的移動平均線。\n\n50天移動平均線...",
      "title": "比特幣金叉在不到10天的時間裏即將到來。準備好迎接所有牛市週期之母"
    }
  ]
}