{
  "author": "Certain_Cobby03",
  "the_new_excerpt": "Hello everyone! I do't know if you guys will be looking at this on the\nweekend...\n\nI was hoping some more experienced investors could provide some advice for me, a\nnew trader.\n\nI turned 18 at the beginning of this year and created a brokerage account (TD\nAmeritrade). I put my savings (about 5k) into…",
  "original_created_utc": 1621202073,
  "localize": [
    {
      "locale": "ja",
      "title": "今こそハイテク株の買い時か？",
      "the_new_excerpt": "皆さん、こんにちは。皆さんは、この記事をご覧になっているかどうか分かりませんが\n週末に...\n\n経験豊富な投資家の皆様から、未熟な私へのアドバイスを頂ければと思いま\n新米トレーダー。\n\n今年の初めに18歳になり、証券会社の口座を作りました（TD\nアメリトレード）。貯金（5千円ほど）を投入して・・・。"
    },
    {
      "locale": "zh",
      "title": "现在是购买科技股的时候吗？",
      "the_new_excerpt": "大家好! 我不知道你们是否会在周末看这个\n周末看这个...\n\n我希望一些更有经验的投资者能给我这个新手提供一些建议。\n新的交易员。\n\n我在今年年初刚满18岁，创建了一个经纪账户（TD\nAmeritrade）。我把我的积蓄（大约5千）放入..."
    },
    {
      "locale": "zh-Hant",
      "title": "現在是購買科技股的時候嗎？",
      "the_new_excerpt": "大家好! 我不知道你們是否會在週末看這個\n週末看這個...\n\n我希望一些更有經驗的投資者能給我這個新手提供一些建議。\n新的交易員。\n\n我在今年年初剛滿18歲，創建了一個經紀賬戶（TD\nAmeritrade）。我把我的積蓄（大約5千）放入..."
    }
  ],
  "title": "Is now the time to buy tech stocks?",
  "created_utc": 1621261637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone! I do&#39;t know if you guys will be looking at this on the weekend...</p>\n\n<p>I was hoping some more experienced investors could provide some advice for me, a new trader.</p>\n\n<p>I turned 18 at the beginning of this year and created a brokerage account (TD Ameritrade). I put my savings (about 5k) into some ETFs with good dividends, Grayscale crypto trusts, and bought 1 share of ABBV (bought in mid-March), BRK-B, XOM, CVX and REGN (which I bought in early March). I recently put in another few thousand into some tech stocks that fell a lot early this week - CRM, NVDA, BIDU, BABA, XLK, U, along with a few others. My money has grown a fair amount.</p>\n\n<p>So, should I put some more money into tech stocks and other stocks that fell this week? If so, which ones should I have on my watchlist?</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/stocks/comments/ndyzxa/is_now_the_time_to_buy_tech_stocks/",
  "subreddit": "stocks",
  "id": "ndyzxa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804457
}