{
  "author": "_ii_",
  "the_new_excerpt": "MICROSOFT SHOULD ACQUIRE BLACKBERRY\n\nTLDR: MSFT wants what GOOL and AAPL have – Android and iOS. Windows is shit.\nBuying BB makes MSFT instant dominant car OS vender.\n\n\nSOFTWARE DEFINED VEHICLE\n\nMuch like the evolution of cell phones. You used to buy new flip phones in order\nto get new features, now…",
  "original_created_utc": 1614706933,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "微软应该收购BLKBERRY公司。\n\nTLDR：MSFT想要GOOL和AAPL拥有的东西--Android和iOS。Windows是狗屎。\n收购BB让MSFT瞬间成为汽车操作系统的主导者。\n\n\n软件定义的汽车。\n\n就像手机的发展一样。你以前买新的翻盖手机是为了。\n获得新功能，现在...",
      "title": "MSFT + BB = 主导型车载操作系统厂商"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "微軟應該收購BLKBERRY公司。\n\nTLDR：MSFT想要GOOL和AAPL擁有的東西--Android和iOS。Windows是狗屎。\n收購BB讓MSFT瞬間成爲汽車操作系統的主導者。\n\n\n軟件定義的汽車。\n\n就像手機的發展一樣。你以前買新的翻蓋手機是爲了。\n獲得新功能，現在...",
      "title": "MSFT + BB = 主導型車載操作系統廠商"
    }
  ],
  "title": "MSFT + BB = Dominant Car OS vender",
  "created_utc": 1614741768,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Microsoft should acquire BlackBerry</h1>\n\n<p>TLDR: MSFT wants what GOOL and AAPL have – Android and iOS. Windows is shit. Buying BB makes MSFT instant dominant car OS vender.</p>\n\n<h1>Software defined vehicle</h1>\n\n<p>Much like the evolution of cell phones. You used to buy new flip phones in order to get new features, now hardware and software on smart phones are updated separately. Vehicles are the next app platform. Vehicle software will be the next frontier for innovation. Every major player will want to sell you apps, services, and show you ads in your car. Unlike smart phones, Microsoft has not lost the battle in software defined vehicle space yet. The time for Microsoft to do something about it is now, and the fastest way to get a foot in the door is by acquiring BB. </p>\n\n<p>How much is each smart connected car worth to social media, ad platforms, cloud service platforms, etc.? A quick web search “social network value per user” says Facebook will generate $226 per user in the U.S. in 2021. Let’s say each U.S. driver is worth additional $50 to Facebook per year, $150 to all other social media and ad platforms combined. I’m being extremely conservative here; car users are captive audiences while phone users often are not. Users should worth more to social media companies when they’re in the car. The U.S. alone has over 270 million vehicles. That’s half a trillion total addressable market. That is just social media in the U.S., how about services and other apps we don’t know we need yet? All in, this can easily be a multi-trillion-dollar market. We haven’t even touched commercial vehicles and taxis yet.</p>\n\n<h1>Microsoft needs a secure real-time OS that’s not Windows.</h1>\n\n<p>Microsoft and Ford’s Sync is an embarrassment to both Ford and Microsoft – source I bought my first and last Ford about 10 years ago. Ford kicked Microsoft to the curb in favor of QNX sometime ago. Ford is replacing QNX with Android from Google. Microsoft needs to redeem itself with Azure Cloud connected infotainment system running on a secure real-time OS. A proven secure platform is going to pitch well against Android and Linux based systems.</p>\n\n<p>Apple has CarPlay and Google has Android Auto, and Microsoft is practically absent in infotainment space. CarPlay and most instances of Android Auto runs on QNX based systems. More specifically they rely on QNX’s Projection system. Basically, the apps run on your phone, and “project” the display via QNX and QNX sends control signals (touch screen, button press, etc.) to the phone app. If you’re huge company who wants a piece of the car software pie, but no one uses your Windows phone, what can you do? You can bundle your software with the car! Build it into the car’s OS, for free! </p>\n\n<p>Microsoft would love to pull another Internet Explorer vs Netscape Navigator if they can control the car OS. Only in this case Apple and Google are not the underdog Netscape was. Apple and Tesla will do their own thing, but for the majority of auto makers who already use QNX, the easy thing to do is keep using QNX if it is good enough and backed by MSFT’s engineering power. A MSFT own QNX can even be free or less than free.</p>\n\n<h1>Monolithic Kernel vs Micro Kernel</h1>\n\n<p>Microsoft Windows is not suitable for cars, and it can’t be fixed. BlackBarry’s QNX Neutrino RTOS, based on microkernel architecture, is inherently more secure than monolithic kernel such as Linux. Microsoft Windows has hybrid kernel and by some measures has worse security track record. When your email, IM, and text can be shown on your car’s screen or read aloud via your car’s audio system. Security will be a major concern for consumers and government agencies. Microsoft owned QNX has a real chance of dominating Android and upcoming Apple Car OS.</p>\n\n<h1>Conclusion</h1>\n\n<p>I see increasing chatter about MSFT may benefit from a BB acquisition so I did some DD before start buying BB stock. I believe after MSFT lost the smart phone battle, car software and OS are MSFT’s once in a generation second chance. BB enterprise value is about 6 billion. I can see MSFT spend 20+ billion in stock and cash to buy BB. I write code for a living and thinks he understands markets he has little to no knowledge of. I’m not a financial advisor. I spent a lot of my time on GitHub and various programming chatrooms. I may have read something on the web that give me this idea, or it may be all in my head. I honestly can’t tell. I do not have any direct or indirect knowledges pertinent to MSFT and BB’s technical or management decisions. Invest at your own risk.</p>\n\n<p>Disclosure: 500 shares at 13.80 and some calls spread over 17 to 20 range.</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/lw7vlh/msft_bb_dominant_car_os_vender/",
  "subreddit": "stocks",
  "id": "lw7vlh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937744911
}