{
  "author": "joeroganthumbhead",
  "the_new_excerpt": "There seems to always be a big debate as to whether real estate or stock market\nis overall the better investment strategy. I’m young so this is me wanting to\nspeak discussion on this topic since I’m interested in it.\n\nHow exactly is real estate investing much better than stock market investing?\nFor…",
  "original_created_utc": 1617329020,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于房地产还是股市，似乎总是有很大的争议\n是整体比较好的投资策略。我还年轻，所以这是我想。\n说说这个话题的讨论，因为我对这个话题很感兴趣。\n\n房地产投资到底比股市投资好多少？\n对于...",
      "title": "股市VS房地产"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於房地產還是股市，似乎總是有很大的爭議\n是整體比較好的投資策略。我還年輕，所以這是我想。\n說說這個話題的討論，因爲我對這個話題很感興趣。\n\n房地產投資到底比股市投資好多少？\n對於...",
      "title": "股市VS房地產"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "不動産と株式市場のどちらが優れているかは、常に大きな議論となっているようです。\nの方が全体的に優れた投資戦略であるかどうか、常に大きな議論があるようです。私は若いので、これは私が話したいことです。\nこの話題に興味があるので、議論をしてみたいと思います。\n\nどのように正確に不動産投資は株式市場の投資よりもはるかに優れていますか？\nのために...",
      "title": "株式市場と不動産の比較"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "不動産と株式市場のどちらが優れているかは、常に大きな議論となっているようです。\nの方が全体的に優れた投資戦略であるかどうか、常に大きな議論があるようです。私は若いので、これは私が話したいことです。\nこの話題に興味があるので、議論をしてみたいと思います。\n\nどのように正確に不動産投資は株式市場の投資よりもはるかに優れていますか？\nのために...",
      "title": "株式市場と不動産の比較"
    }
  ],
  "title": "Stock market VS real estate",
  "created_utc": 1617383453,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There seems to always be a big debate as to whether real estate or stock market is overall the better investment strategy. I’m young so this is me wanting to speak discussion on this topic since I’m interested in it.</p>\n\n<p>How exactly is real estate investing much better than stock market investing? For example, if I were to put 50K down on a property and take out a mortgage, I might be cash flowing couple hundred bucks after everything is paid each month but if I were to simply invest in a dividend company like O Realty, I would get roughly the same in dividends each month without the hassle. They both have the potential for appreciation too so that argument is a wash.</p>\n\n<p>Also, the mortgage would be paying itself but it would take years to get it fully paid unless you put extra down right? Also what if a tenant doesn’t want to pay or moves out? What happens?</p>\n\n<p>Would love to hear the thoughts of your real estate investors.</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/stocks/comments/miaixy/stock_market_vs_real_estate/",
  "subreddit": "stocks",
  "id": "miaixy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961878975
}