{
  "author": "shiefson",
  "original_created_utc": 1632396599,
  "title": "HOME DEPOT x ORIGINTRAIL. Ken McElroy, Global Manager Trade Risk & Export Compliance at Home Depot, confirms their partnership and explains the scope & vision.",
  "created_utc": 1632418508,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all,</p>\n\n<p>Back here with another post. You may wonder why TRAC has been going up while the whole market was down. This is due to some big news in recent events. I&#39;m updating you on two recent blockchain events/gatherings (yesterday and day before) where OriginTrail and two of their partners (Home Depot and British Standards Institution) spoke about their usage of the OriginTrail Decentralised Knowlegde Graph.</p>\n\n<p><a href=\"https://preview.redd.it/rm8jwycoi8p71.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=f052424eb97d864e203549f2b76e6c719962e7b4\">https://preview.redd.it/rm8jwycoi8p71.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=f052424eb97d864e203549f2b76e6c719962e7b4</a></p>\n\n<h1>First up was the event hosted by OriginTrail. Frictionless International Trade.</h1>\n\n<p>Watch it back here:  <a href=\"https://www.youtube.com/watch?v=QLUVBtnGCLw\">https://www.youtube.com/watch?v=QLUVBtnGCLw</a></p>\n\n<p>Ken McElroy is the global manager of trade risk &amp; export compliance at Home Depot. He was invited to speak on their (Home Depot) usage of the OriginTrail network. I&#39;ve  highlighted the most interesting quotes from Ken expanding on the relationship between Home Depot and OriginTrail:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;Everybody wants their data protected, they want their supply chain as anonymous as it can be. What OriginTrail and BSI and SCAN have accomplished is the ability to have competitors sharing compliance information on facilities that they are doing business with, without knowing who of their competitors are doing business with the same locations.&quot;</p>\n</blockquote>\n\n<p>In technical terms, this quote relates to the usage of ZK-Snarks in the OriginTrail network, where partners can share sensitive information without giving up the exact details of the information.</p>\n\n<blockquote>\n<p>&quot;The beauty of this technology going forward is the owners of the data own the permission for who can have access to it. So it&#39;s a complete shift. That&#39;s where I think the beauty of where we&#39;re going with secure data exchanges is going to be going forward&quot;</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;I am really passionate about the fact that most of what supply chains do is really generate costs as opposed to generating revenue. So one of the things that we&#39;ve been able to accomplish in the last 6 years of my career is launching a trustable platform that actually generates return on investment from what would normally be considered a cost center in a supply chain. The fact that we can arrange this and have it be trustworthy is really attributable to the fact that we have a verifiable, trusted blockchain environment that allows us to share that data.&quot;</p>\n</blockquote>\n\n<p>Ken explains here that using the blockchain environment actually transforms a cost center to a revenue generating item. Sharing the data, trusted via the OriginTrail Decentralised Knowledge Graph doesn&#39;t cost them money. It makes them money. It&#39;s profitable for businesses.</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;Where we&#39;re tying to take this going forward is really to say we&#39;re trying to take this to the point where we can create an end data flow verifiable trace of where a product starts in the supply chain and manufacture to where it lands at destination ultimately to the retail shelf, so that anyone can take a verifiable UPC scannable detail and say ok this product came from point A to point B through this this and this network or interchange without any tampering or whatever, so that&#39;s really the innovation that ( British Standards Institution Director of Innovation ) Dan ( Purtell, also in attendance ) was highlighting before. The fact that we have the ability to link data from different organizations and put that together, that&#39;s really the cutting edge perspective I think from a supply chain perspective in today&#39;s market.&quot;</p>\n</blockquote>\n\n<p>This part is really exciting and expands on their vision of using OriginTrail for end to end tracing of every product. This also ties in really nicely to the GS1 Digital Link barcode OriginTrail is heavily involved in. (Making every barcode basically smart and scannable for consumers to get valuable information.</p>\n\n<p>&#x200B;</p>\n\n<h1>The second event I want to highlight is the European Blockchain Week Event.</h1>\n\n<p>Watch it back here: <a href=\"https://youtu.be/KKgqGpZablw?t=25149\">https://youtu.be/KKgqGpZablw?t=25149</a></p>\n\n<p>Ken McElroy is also the Board Vice Chair of SCAN Association. (A Supplier Compliance Audit Network including Walmart, Home Depot, Walt Disney.) (<a href=\"https://www.scanassociation.com/about/\">https://www.scanassociation.com/about/</a>). This event he talked more from the angle of SCAN using OriginTrail. He is back again with some juicy quotes:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;Let me just say that it&#39;s been kind enough to partner with BSI and OriginTrail to really take a circumstance where competitors in the marketplace are able to utilize technology to provide value added services to their individual organizations while maintaining the integrity of their own proprietary data.&quot;</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;It&#39;s really something that if you&#39;d asked me 35 years ago as a young practitioner in supply chain that i would be at the time sharing manufacturing and supply chain details with proctor &amp; gamble working for colgate palmolive i would have laughed, we were dead against each other with regard to the competitive landscape and would NOT have even dreamed of that. fast forward to today and here we have a workable business case where some of the largest manufacturing and retail organization in the world particularly in the US market space are doing exactly that.&quot;</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;Suffice to say it&#39;s 1.4 trillion dollars and growing every year. there&#39;s 22,000 factories in our repository and our criteria align directly with US customs recently upgraded minimum security criteria that has been created in 2019 after initially being created in 2001.&quot;</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;Where we are looking to take this and how we expect we can grow this is we can then add permissioned access to regulatory agencies AEO organizations, other government agencies such as the US FDA, US Customs and specifically give them the ability to see the results of these particular audits.&quot;</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;Just let me say this before we move on i think that the opportunity that we presented from a trusted trader perspective with regulatory agencies is a complete and total paradigm shift potentially in supply chain security, the ability to have regulatory agencies take data that is generated and gathered and marry that with their own internal intelligence to do things like security targeting could affectively change supply chains security going forward and take us into the next several decades going forward.&quot;</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>&quot;The concepts of shared data and frictionless supply chain really say a lot about how we can take technology and allow things like taking data flow, taking information and combining that information to allow for a forward looking speedy release of goods through the enablization of the blockchain and data elements that the regulatory agencies are obligated to take into consideration but if we&#39;re able to maintain and demonstrate those kinds of touch point connections that can take what would&#39;ve been a container of fruits and vegetables coming through the suez canal sitting in place for many days or longer but allowing the data points to say ok that container was never outside it&#39;s temp realms, we have the touch points for where it&#39;s loaded and where it&#39;s going to. we can with relative integrity verify that those realities took place and then release that container to the consumer or the consumer chain without any further delay. that&#39;s just a simple example of think of where this reality has a profound practical delivery purpose and where i think we&#39;re gonna go in the future as we expand these footprints into other regulatory agencies and ecosystems.&quot;</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>OriginTrail is achieving real world adoption under everyones noses and it still flies so heavily under the radar. This is my pick to do super well this bull market. DYOR.</p>\n\n<p>If you want to learn more about the current adoption and tech of the OriginTrail Decentralised Knowledge Graph, here are some useful links:</p>\n\n<p>OriginTrail medium: <a href=\"https://medium.com/origintrail\">https://medium.com/origintrail</a></p>\n\n<p>20 minute community made explainer: <a href=\"https://origintrailexplained.info/\">https://origintrailexplained.info/</a></p>\n</div><!-- SC_ON -->",
  "score": 204,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/nTd_LjpP4cRx0EjaUh53wQO83usocgdA3FihacVAsa8.jpg?auto=webp&s=27f2a5d2372b9fe7c5b1921c9fc69b02a21abd9c",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/nTd_LjpP4cRx0EjaUh53wQO83usocgdA3FihacVAsa8.jpg?width=108&crop=smart&auto=webp&s=8fcb106303dd1acb1685f2a9e4e4f7a8dc9bfe30",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/nTd_LjpP4cRx0EjaUh53wQO83usocgdA3FihacVAsa8.jpg?width=216&crop=smart&auto=webp&s=93fda21dfb99ce232a710a4d9688d55ee3e0e012",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/nTd_LjpP4cRx0EjaUh53wQO83usocgdA3FihacVAsa8.jpg?width=320&crop=smart&auto=webp&s=a39aee8b723b003126fa98d925e7413cc25df5bb",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "eP5YA5eX4Kxf5tMjiRqQtE5fFNUpTgch7RWHcvDKRf8"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ptt631/home_depot_x_origintrail_ken_mcelroy_global/",
  "subreddit": "CryptoCurrency",
  "id": "ptt631",
  "is_self": true,
  "media": {
    "type": "youtube.com",
    "oembed": {
      "provider_url": "https://www.youtube.com/",
      "version": "1.0",
      "title": "Frictionless International Trade",
      "type": "video",
      "thumbnail_width": 480,
      "height": 200,
      "width": 356,
      "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/QLUVBtnGCLw?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
      "author_name": "OriginTrail",
      "provider_name": "YouTube",
      "thumbnail_url": "https://i.ytimg.com/vi/QLUVBtnGCLw/hqdefault.jpg",
      "thumbnail_height": 360,
      "author_url": "https://www.youtube.com/c/OriginTrail"
    }
  },
  "is_video": false,
  "the_new_excerpt": "Hey all,\n\nBack here with another post. You may wonder why TRAC has been going up while the\nwhole market was down. This is due to some big news in recent events. I'm\nupdating you on two recent blockchain events/gatherings (yesterday and day\nbefore) where OriginTrail and two of their partners (Home…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n今回も投稿します。市場全体が下がっている中で、なぜTRACが上がっているのか不思議に思われるかもしれません。\n不思議に思われるかもしれませんが、市場全体が下がっているのに これは、最近の出来事でいくつかの大きなニュースがあったためです。今回は\n最近行われた2つのブロックチェーンのイベント/集会（昨日と一昨日）についてお知らせします。\nOriginTrailとそのパートナー2社（Home...",
      "title": "HOME DEPOT×ORIGINTRAIL。ホーム・デポ社の貿易リスクおよび輸出コンプライアンスのグローバル・マネージャーであるケン・マッケルロイ氏が、両社のパートナーシップを確認し、その範囲とビジョンについて説明しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n回到这里，又发了一个帖子。你可能想知道为什么TRAC一直在上涨而\n而整个市场却在下跌。这是由于最近发生的一些重大新闻。我是\n更新最近的两个区块链事件/集会（昨天和前天\n前），OriginTrail和他们的两个合作伙伴（Home...",
      "title": "家电公司xORIGINTRAIL. 家得宝公司的贸易风险和出口合规部全球经理Ken McElroy确认了他们的合作关系，并解释了其范围和愿景。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n回到這裏，又發了一個帖子。你可能想知道爲什麼TRAC一直在上漲而\n而整個市場卻在下跌。這是由於最近發生的一些重大新聞。我是\n更新最近的兩個區塊鏈事件/集會（昨天和前天\n前），OriginTrail和他們的兩個合作伙伴（Home...",
      "title": "家電公司xORIGINTRAIL. 家得寶公司的貿易風險和出口合規部全球經理Ken McElroy確認了他們的合作關係，並解釋了其範圍和願景。"
    }
  ]
}