{
  "author": "Bluebro11",
  "original_created_utc": 1657067071,
  "title": "Having a girl over at my apartment for the first time, how to prepare?",
  "created_utc": 1657102692,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve lived alone in my apartment for over 5 years now. I moved out of my parents since my job lets me afford a nice place by myself. I am having a girl over for the first time in a week. My apartment is really geared towards me, a single person and has been for a long time. What are some things I can do to make sure the girl feels like she is welcome and comfortable in my apartment?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/vsckbn/having_a_girl_over_at_my_apartment_for_the_first/",
  "subreddit": "NoStupidQuestions",
  "id": "vsckbn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve lived alone in my apartment for over 5 years now. I moved out of my parents\nsince my job lets me afford a nice place by myself. I am having a girl over for\nthe first time in a week. My apartment is really geared towards me, a single\nperson and has been for a long time. What are some things I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マンションで一人暮らしを始めて5年以上になります。実家を出て\n仕事柄、一人でいい部屋に住めるようになったからです。今度、一週間ぶりに女の子を家に招待することになった。\n一週間後に初めて女の子を招待します。私のアパートは本当に私向きで、単身者向けです。\n私のアパートは本当に私、単身者向けであり、長い間そうであった。私はいくつかのものがあります...",
      "title": "初めて女の子をアパートに泊めることになったのですが、どう準備したらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我独自住在我的公寓里已经超过5年了。我搬出了我的父母\n因为我的工作可以让我自己负担得起一个好地方。我正在邀请一个女孩过来，这是\n一个星期以来的第一次。我的公寓真的是为我这个单身人士准备的。\n的人，而且已经有很长一段时间了。我有哪些事情要做？",
      "title": "第一次有女孩来我的公寓，如何准备？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我獨自住在我的公寓裏已經超過5年了。我搬出了我的父母\n因爲我的工作可以讓我自己負擔得起一個好地方。我正在邀請一個女孩過來，這是\n一個星期以來的第一次。我的公寓真的是爲我這個單身人士準備的。\n的人，而且已經有很長一段時間了。我有哪些事情要做？",
      "title": "第一次有女孩來我的公寓，如何準備？"
    }
  ]
}