{
  "author": "flovidchan",
  "the_new_excerpt": "Reddit went from 1.7M subs to 9M subs in like two weeks because of gamestop.\nEven if 98% of these 9M subs weren't broke AF with $50 in their Robinhood\naccounts, and each person invested $1000, that would only be 9 billion dollars\nof purchasing power.\n\n9 billion dollars is PEANUTS for hedge funds. A…",
  "original_created_utc": 1613426777,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Reddit因为gamestop的缘故，在两周内从170万分站变成了900万分站。\n即使98%的900万次的人没有破产AF与50美元在他们的Robinhood\n账户，而每人投资1000元，那就只有90亿元\n的购买力。\n\n90亿美元对对冲基金来说是PEANUTS。A…",
      "title": "厌倦了你们这些无名小卒把什么都叫做 \"P&D\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Reddit因爲gamestop的緣故，在兩週內從170萬分站變成了900萬分站。\n即使98%的900萬次的人沒有破產AF與50美元在他們的Robinhood\n賬戶，而每人投資1000元，那就只有90億元\n的購買力。\n\n90億美元對對沖基金來說是PEANUTS。A…",
      "title": "厭倦了你們這些無名小卒把什麼都叫做 \"P&D\""
    }
  ],
  "title": "Tired of you noob gays calling everything a \"P&D\"",
  "created_utc": 1613457440,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reddit went from 1.7M subs to 9M subs in like two weeks because of gamestop. Even if 98% of these 9M subs weren&#39;t broke AF with $50 in their Robinhood accounts, and each person invested $1000, that would only be 9 billion dollars of purchasing power.</p>\n\n<p>9 billion dollars is PEANUTS for hedge funds. A single hedge fund or investment group can move 9 billion in a day, can you imagine what thousands of hedge funds around the globe can do?</p>\n\n<p>There are INDIVIDUAL INVESTORS with more investing power/cash than all of WSB combined. This is not /biz/, this is not basement NEETS shilling shitcoins, this is big boy land with big boy people in suits in Manhattan skyscrapers and high class polish escorts going for 5k/hour. This is entire trading floors made up of Wharton MBA grads who come from old money, and most of you are just freshmen in the Derek Zoolander School of Options Trading, so shut the fuck up.</p>\n\n<p>What we have going on here is .01% of WSB people are actually not completely retarded, and they SHARE their good DD with us which gives us the OPPORTUNITY to buy and make some money off hedge fund wars and hedge fund plays.</p>\n\n<p>Learn some fucking humility and be grateful you made money off a dumb fucking purple mattress store or something equally stupid. You are literally a retarded ape if you think WSB can &quot;fight hedge funds&quot; or some dumb shit like that. 75% of you don&#39;t even know how to read. </p>\n\n<h1>PLTR 28c 3/19 THE FIRE RISES</h1>\n</div><!-- SC_ON -->",
  "score": 1493,
  "permalink": "/r/wallstreetbets/comments/lkoggd/tired_of_you_noob_gays_calling_everything_a_pd/",
  "subreddit": "wallstreetbets",
  "id": "lkoggd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728633164
}