{
  "author": "Lexlex_le_tirex",
  "original_created_utc": 1642343932,
  "title": "If you have money in Coinbase, take it out...",
  "created_utc": 1642397554,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m so frustrated and disappointed with Coinbase with what appears to be gross negligence in basic security and customer service.&lt;/p&gt;\n\n&lt;p&gt;I opened an account in December and within a week was hacked. The hacker somehow was able to change my phone number for two-factor authentication therefore I am unable to access the account or even freeze or close the account. When calling Coinbase help, I cannot reach a human for help. Numerous emails result in automated responses pointing me to self-help pages and FAQs. This is unacceptable! How can Coinbase be a publicly-traded company?&lt;/p&gt;\n\n&lt;p&gt;I simply want to regain access to my account and have no way to do so. Looking over at ethscan, it looks like my account is being used for incoming and outgoing transactions without my consent.&lt;/p&gt;\n\n&lt;p&gt;If Coinbase wants to be a leader in Crypto, then it needs to demonstrate solid customer support. Right now there is less than zero support. It’s dangerous and too risky to use.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/Bitcoin/comments/s5d6fn/if_you_have_money_in_coinbase_take_it_out/",
  "subreddit": "Bitcoin",
  "id": "s5d6fn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m so frustrated and disappointed with Coinbase with what appears to be gross\nnegligence in basic security and customer service.\n\nI opened an account in December and within a week was hacked. The hacker somehow\nwas able to change my phone number for two-factor authentication therefore I am\nunable…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コインベースには、とても不満と失望を感じています。\n基本的なセキュリティと顧客サービスを怠っている。\n\n12月に口座を開設して、1週間以内にハッキングされました。ハッカーはどういうわけか\n2ファクタ認証の電話番号を変更され、そのために\nできない...",
      "title": "Coinbaseにお金を入れている人は、それを取り出してください...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对Coinbase感到非常沮丧和失望，因为它似乎是在基本安全和客户服务方面的严重疏忽。\n在基本安全和客户服务方面的严重疏忽。\n\n我在12月开了一个账户，一周内就被黑了。黑客以某种方式\n黑客能够改变我的双因素认证的电话号码，因此我无法\n无法...",
      "title": "如果你有钱在Coinbase，把它拿出来..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對Coinbase感到非常沮喪和失望，因爲它似乎是在基本安全和客戶服務方面的嚴重疏忽。\n在基本安全和客戶服務方面的嚴重疏忽。\n\n我在12月開了一個賬戶，一週內就被黑了。黑客以某種方式\n黑客能夠改變我的雙因素認證的電話號碼，因此我無法\n無法...",
      "title": "如果你有錢在Coinbase，把它拿出來..."
    }
  ]
}