{
  "author": "lIllContaktIlIl",
  "original_created_utc": 1649454891,
  "title": "Snoop Dog on record labels - \"you got to get fucking 700 million streams and make $10,000... we're just trying to find lanes and ways to keep shit the way it was when we first started pure and authentic and about the fans\"",
  "created_utc": 1649523228,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Music and crypto is definitely a new use case. Let&amp;#39;s take a look at it:&lt;/p&gt;\n\n&lt;p&gt;Snoop talks about how all music is influenced by labels and all sound the same. The music industry, as you can imagine, is extremely predatory for young artists and even stars. Apparently even Taylor Swift is having problems getting back her master sountracks. He and his son see crypto as a way to give artists back their freedom and creativity without being influenced by big labels. Pretty freakin awesome.&lt;/p&gt;\n\n&lt;p&gt;Snoop also talks about using his tracks without worrying about copyrights. With all this Youtube copystriking bullshit stifling content creators, its refreshing to see us going back to the golden days of content creation with crypto.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Yeah, we heard some dope shit. Somebody took one of my vocals from a rap song that I did on the mixtape and made a whole fucking EDM song out of it. That shit banging. So I&amp;#39;m anxious to hear what what, these you know content creators are going to do with my vocals with the music with the songs because once you get it you can do whatever the fuck you want to do with it. That&amp;#39;s what I love about this shit. There&amp;#39;s no rules and regulations you can make it yours. You can flip it, dip it. You know how much it costs to get me on the verse?  &lt;/p&gt;\n\n&lt;p&gt;Yeah, I know you don&amp;#39;t, but anyway they get it on the House.&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Link to interview:&lt;a href=\"https://twitter.com/IOHK_Charles/status/1511402568420929538\"&gt;https://twitter.com/IOHK_Charles/status/1511402568420929538&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;EDIT: FFS mispelled dee o double gee&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 328,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/eTNA3M5VmDsVfADojFKJGy9luEl2SZj_BrZ4wUEO-Ho.jpg?auto=webp&amp;s=9e663c3044818919a85d612742a849d847536b39",
          "width": 140,
          "height": 140
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/eTNA3M5VmDsVfADojFKJGy9luEl2SZj_BrZ4wUEO-Ho.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=10e4ad0b9052db5600a5419e0dc50187997b397f",
            "width": 108,
            "height": 108
          }
        ],
        "variants": {},
        "id": "Xg-W1uDY3c_arIi5sqLjJK8jAMMp-MP4YXhUa8Lrw7E"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/tzecuf/snoop_dog_on_record_labels_you_got_to_get_fucking/",
  "subreddit": "CryptoCurrency",
  "id": "tzecuf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Music and crypto is definitely a new use case. Let's take a look at it:\n\nSnoop talks about how all music is influenced by labels and all sound the same.\nThe music industry, as you can imagine, is extremely predatory for young artists\nand even stars. Apparently even Taylor Swift is having problems…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "音楽と暗号は、間違いなく新しいユースケースです。さっそく見てみましょう。\n\nスヌープは、すべての音楽がレーベルの影響を受け、すべて同じに聞こえることについて話しています。\n音楽業界は、ご想像の通り、若いアーティストにとって非常に食い物にされています。\nそしてスターも。どうやらTaylor Swiftでさえも問題を抱えているようです...。",
      "title": "スヌープ・ドッグ、レコード会社について - 「7億のストリーミングを獲得して、1万ドルを稼ぐんだ...俺たちはただ、俺たちが最初に始めたときの純粋で本物の、ファンについてのやり方を維持する道筋と方法を見つけようとしているだけだ」。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "音乐和加密货币绝对是一个新的用例。让我们来看一看。\n\nSnoop谈到了所有的音乐都受到标签的影响，而且听起来都一样。\n你可以想象，音乐产业对年轻艺术家，甚至明星来说是非常具有掠夺性的。\n甚至是明星。显然，即使是泰勒-斯威夫特也有问题...",
      "title": "Snoop Dog谈唱片公司--\"你必须获得他妈的7亿流量并赚取1万美元......我们只是试图找到通道和方法，以保持我们最初开始时的纯粹和真实，并以粉丝为中心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "音樂和加密貨幣絕對是一個新的用例。讓我們來看一看。\n\nSnoop談到了所有的音樂都受到標籤的影響，而且聽起來都一樣。\n你可以想象，音樂產業對年輕藝術家，甚至明星來說是非常具有掠奪性的。\n甚至是明星。顯然，即使是泰勒-斯威夫特也有問題...",
      "title": "Snoop Dog談唱片公司--\"你必須獲得他媽的7億流量並賺取1萬美元......我們只是試圖找到通道和方法，以保持我們最初開始時的純粹和真實，並以粉絲爲中心。"
    }
  ]
}