{
  "author": "Brothanogood",
  "the_new_excerpt": "Chipotle said it will increase restaurant wages resulting in a $15 average\nhourly wage by the end of June, as it looks to bring on 20,000 workers.\n\nStarting pay for hourly crew members will range from $11 to $18 an hour. There\nare opportunities to advance to general manager positions with average…",
  "original_created_utc": 1620665963,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Chipotle社は、6月末までにレストランの賃金を引き上げ、平均時給を15ドルにすると発表しました。\n6月末までにレストランの賃金を引き上げ、平均時給を15ドルとし、2万人の従業員の採用を目指します。\n\n時給制クルーの初任給は、11ドルから18ドルとなります。また\nまた、平均時給15ドルのジェネラル・マネージャーへの昇進のチャンスもあります。",
      "title": "Chipotle社、2万人の雇用を目指して賃金を引き上げ、紹介ボーナスをデビューさせる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Chipotle公司表示，它将提高餐厅的工资，到6月底达到平均每小时15美元。\n到6月底，它将提高餐厅的工资，使平均时薪达到15美元，因为它希望招收20,000名工人。\n\n时薪人员的起薪将从每小时11美元到18美元不等。有\n有机会晋升到总经理职位，平均时薪为15美元。",
      "title": "Chipotle将提高工资，首次推出推荐奖金，试图雇用2万名工人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Chipotle公司表示，它將提高餐廳的工資，到6月底達到平均每小時15美元。\n到6月底，它將提高餐廳的工資，使平均時薪達到15美元，因爲它希望招收20,000名工人。\n\n時薪人員的起薪將從每小時11美元到18美元不等。有\n有機會晉升到總經理職位，平均時薪爲15美元。",
      "title": "Chipotle將提高工資，首次推出推薦獎金，試圖僱用2萬名工人"
    }
  ],
  "title": "Chipotle to hike wages, debut referral bonuses in attempt to hire 20,000 workers",
  "created_utc": 1620670249,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Chipotle said it will increase restaurant wages resulting in a $15 average hourly wage by the end of June, as it looks to bring on 20,000 workers.</p>\n\n<p>Starting pay for hourly crew members will range from $11 to $18 an hour. There are opportunities to advance to general manager positions with average annual pay of $100,000.</p>\n\n<p>Chipotle CEO Brian Niccol said the current labor market is among the most challenging he&#39;s seen in his career in the restaurant industry. He cited a range of reasons including child care and a rethinking of work post-pandemic.</p>\n\n<p>As the labor market heats up, Chipotle Mexican Grill announced Monday it&#39;s raising pay for restaurant workers, reaching an average of $15 an hour by the end of June.</p>\n\n<p>The company has also introduced employee referral bonuses of $200 for crew members and $750 for apprentices or general managers, as it looks to recruit 20,000 new workers across the country to support its peak season and new restaurant openings.</p>\n\n<p>The pay hike for new and existing restaurant workers, both hourly and salaried, will roll out over the next few weeks, with hourly crew wages starting in the range of $11 to $18 per hour. There are also opportunities to advance to a restaurateur position, which is the highest-ranking general manager, with average compensation of $100,000 a year, Chipotle said, in as little as 3½ years.</p>\n\n<p>Chipotle is getting creative in its hiring initiatives. It is hosting a virtual career fair on Thursday on Discord, the social platform, that will include sessions with current employees. Other Chipotle benefits include mental health care and 401(k) plans and debt-free degrees for workers after 120 days from nonprofit, accredited universities in partnership with Guild Education.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/05/10/chipotle-to-hike-wages-debut-referral-bonuses-amid-tight-labor-market.html\">Source</a></p>\n</div><!-- SC_ON -->",
  "score": 12747,
  "permalink": "/r/stocks/comments/n9a2nc/chipotle_to_hike_wages_debut_referral_bonuses_in/",
  "subreddit": "stocks",
  "id": "n9a2nc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996880
}