{
  "author": "jonawesome",
  "original_created_utc": 1647545674,
  "title": "Why do successful imperial powers seem incapable of providing shared prosperity towards their domestic citizenry?",
  "created_utc": 1647613296,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been thinking a bit about Victorian England, a time and place of huge contradictions. On the one hand, England was arguable the strongest imperial power in human history, using its global reach to accumulate resources from around the world for cheap. But on the other hand, the standard of living of much of the populace &lt;em&gt;within England&lt;/em&gt; was terrible, to the point that Marxist theory of class conflict grew out of observation of class conflict within England, and the era&amp;#39;s most famous writer, Charles Dickens, became known for his observations of poverty and agony within Britain&amp;#39;s lower classes.&lt;/p&gt;\n\n&lt;p&gt;Thinking about this more, it strikes me as a somewhat common occurrence. Not long before the era of Victorian England, the House of Bourbon controlled one of the most far-reaching and richest empires in world history — and the standard of living of the everyday citizenry was so bad that it led to a revolution that killed the King and his family and continues to influence revolutionary movements to this day. How was France so rich but so incapable of providing to its domestic citizenry?&lt;/p&gt;\n\n&lt;p&gt;There are shades of this in the modern United States. While the American empire does not technically exist in the way the British or French ones did, the system of alliances and global capitalism that the US enforces globally provides for cheap imports and other financial advantages at a scale nearly unparalleled in human history. While the US standard of living is for the most part quite high, it doesn&amp;#39;t seem to reach the heights one would expect based on this economic dominance. Public goods such as healthcare and education remain unaffordable for many Americans, and the country&amp;#39;s poverty rate, life expectancy, and homeless population are worse off than many peer countries that do not have the same dominance over global economics.&lt;/p&gt;\n\n&lt;p&gt;Is this something that historians have looked at closely? Is it possible that inequality is part of what allows for this hegemonic economic positioning, since it allows for easier exploitation of foreign countries? Am I making up a trend where one doesn&amp;#39;t exist? &lt;strong&gt;Why can&amp;#39;t rich countries provide for their own citizens?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/tgi9dv/why_do_successful_imperial_powers_seem_incapable/",
  "subreddit": "AskHistorians",
  "id": "tgi9dv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been thinking a bit about Victorian England, a time and place of huge\ncontradictions. On the one hand, England was arguable the strongest imperial\npower in human history, using its global reach to accumulate resources from\naround the world for cheap. But on the other hand, the standard of…"
}