{
  "author": "unresolvedthrowaway7",
  "original_created_utc": 1634656896,
  "title": "Why don't people use the bathroom fan?",
  "created_utc": 1634666273,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of bathrooms (all new ones?) have a fan to draw air to an exhaust so as to speed the removal of odors.  It also has the nice side effect of muffling the noise of you doing your business in there.</p>\n\n<p>Whenever people come over, they don&#39;t use it. My did didn&#39;t use it. My girlfriend didn&#39;t use it.</p>\n\n<p>But for the real kicker ... I bought a home this year that was new construction. The builder came over one time and used the bathroom. He knows this place in and out.  <em>He</em> didn&#39;t turn the fan on.</p>\n\n<p>Why not?</p>\n\n<p><strong>Edit:</strong> To clarify, I use it regardless of what I&#39;m doing in there when someone else is present. I figure they don&#39;t want to hear urination sounds either.</p>\n\n<p><strong>Edit2:</strong> Apparently, some people believe the fan means &quot;I&#39;m pooping&quot;, yet I&#39;ve always turned on the fan unconditionally, so as to <em>obscure</em> what it is signaling.</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/qbdqlc/why_dont_people_use_the_bathroom_fan/",
  "subreddit": "NoStupidQuestions",
  "id": "qbdqlc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of bathrooms (all new ones?) have a fan to draw air to an exhaust so as to\nspeed the removal of odors. It also has the nice side effect of muffling the\nnoise of you doing your business in there.\n\nWhenever people come over, they don't use it. My did didn't use it. My\ngirlfriend didn't use…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くのバスルーム(新しいものはすべて？)には、臭いを早く消すために、排気口に空気を吸い込むファンが付いています。\nにおいの除去を早めます。また、トイレの音を小さくするという副次的な効果もあります。\n用を足すときの音を小さくする効果もあります。\n\n人が来ても使わないんですよ。うちの人は使わなかった。私の\nガールフレンドも使っていない...",
      "title": "なぜみんなトイレの換気扇を使わないの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多浴室（所有的新浴室？）都有一个风扇，将空气吸入排气管，以便\n加快消除气味。它还有一个很好的副作用，就是可以消减\n你在里面做事情的噪音。\n\n每当有人来的时候，他们不使用它。我的人没有使用它。我的\n我的女朋友没有使用...",
      "title": "人们为什么不使用卫生间的风扇？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多浴室（所有的新浴室？）都有一個風扇，將空氣吸入排氣管，以便\n加快消除氣味。它還有一個很好的副作用，就是可以消減\n你在裏面做事情的噪音。\n\n每當有人來的時候，他們不使用它。我的人沒有使用它。我的\n我的女朋友沒有使用...",
      "title": "人們爲什麼不使用衛生間的風扇？"
    }
  ]
}