{
  "author": "SoupaSoka",
  "original_created_utc": 1625796253,
  "title": "At their current price of about $0.08 per Moon, 13 Moons would buy you a Spicy Potato Soft Taco from Taco Bell",
  "created_utc": 1625812245,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Moons are basically free tacos at this point. Don&#39;t forget to grab a Beef Burrito for 13 Moons, and then hit up McDonald&#39;s for a Large Dr. Pepper for 13 more Moons.</p>\n\n<p>For not even 40 Moons, you can eat good (well, you&#39;ll be full) based on USA dollar menu prices. Thanks for doing what you do, Moons.</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/oglrvs/at_their_current_price_of_about_008_per_moon_13/",
  "subreddit": "CryptoCurrency",
  "id": "oglrvs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Moons are basically free tacos at this point. Don't forget to grab a Beef\nBurrito for 13 Moons, and then hit up McDonald's for a Large Dr. Pepper for 13\nmore Moons.\n\nFor not even 40 Moons, you can eat good (well, you'll be full) based on USA\ndollar menu prices. Thanks for doing what you do, Moons.",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この時点で、ムーンは基本的に無料のタコスです。牛肉のブリトーもお忘れなく。\nムーン分のビーフブリートを食べて、マクドナルドでドクターペッパー（大）を買って、さらに13ムーン分の\nムーンの追加です。\n\n40ムーンにも満たない金額で、アメリカのドルメニューの価格を参考にして、おいしいものを食べることができます（まあ、お腹いっぱいになりますが）。\nドルのメニュー価格に基づいています。ありがとう、Moonたち。",
      "title": "現在の1個あたりの価格は約0.08ドルで、13個の月でタコベルのスパイシーポテト・ソフトタコスが買えます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在这一点上，月亮基本上是免费的玉米饼。不要忘了用13个月的时间买一个牛肉卷\n13个月的卷饼，然后去麦当劳买一个大号的胡椒博士，再买13个月的卷饼。\n更多月球。\n\n不到40个月的时间，你就可以吃得很好（好吧，你会吃饱），根据美国\n美元菜单的价格。谢谢你所做的工作，月球。",
      "title": "按照目前每个月球约0.08美元的价格，13个月球可以在塔可钟买到一个香辣土豆软塔可。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這一點上，月亮基本上是免費的玉米餅。不要忘了用13個月的時間買一個牛肉卷\n13個月的捲餅，然後去麥當勞買一個大號的胡椒博士，再買13個月的捲餅。\n更多月球。\n\n不到40個月的時間，你就可以喫得很好（好吧，你會喫飽），根據美國\n美元菜單的價格。謝謝你所做的工作，月球。",
      "title": "按照目前每個月球約0.08美元的價格，13個月球可以在塔可鍾買到一個香辣土豆軟塔可。"
    }
  ]
}