{
  "author": "wiptheman",
  "the_new_excerpt": "A word of caution from someone who has been through several cycles.\n\nWhen in a Bull market like the one we are in now you almost can’t go wrong! Take\nDoge for example. The danger is that it gives over confidence and many start to\nFOMO in money they cannot afford to lose.\n\nSo try and remember a…",
  "original_created_utc": 1612868144,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "一个经历过几个周期的人的忠告。\n\n当在像我们现在这样的牛市中，你几乎不会错! 以\n例如，Doge。危险的是，它给了过度的信心，许多人开始。\nFOMO在钱他们不能失去的。\n\n所以尽量记住一个...",
      "title": "在牛市中，人人都是投资天才!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個經歷過幾個週期的人的忠告。\n\n當在像我們現在這樣的牛市中，你幾乎不會錯! 以\n例如，Doge。危險的是，它給了過度的信心，許多人開始。\nFOMO在錢他們不能失去的。\n\n所以儘量記住一個...",
      "title": "在牛市中，人人都是投資天才!"
    }
  ],
  "title": "In a bull market everyone is an investing genius!",
  "created_utc": 1612885248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A word of caution from someone who has been through several cycles.</p>\n\n<p>When in a Bull market like the one we are in now you almost can’t go wrong! Take Doge for example. The danger is that it gives over confidence and many start to FOMO in money they cannot afford to lose.</p>\n\n<p>So try and remember a couple of key rules that could save you a lot of money:</p>\n\n<ul>\n<li>Don’t invest money you can’t afford to lose.</li>\n<li>Don’t invest money you might need in the short term. Anyone who held its Bitcoin through the drops at this point is in profit.</li>\n<li>Certainly do not borrow to invest</li>\n<li>If you are late to the party consider Dollar Cost Averaging (google it)</li>\n<li>At some point BTC is going to create an ultimate ATH for this market cycle and then correct back down by 70 to 80%. Other crypto’s will drop even more.</li>\n<li>Yes it will correct back down a very big percentage. Usually 80% (look at previous cycles) It could be triggered by a stock market correction when there are no more stimulus checks. Stock market is already dangerously over priced. (Google Stock market cap Vs GDP).</li>\n<li>You can “Dodge” that correction by progressively taking profits each time BTC creates and new ATH. You want to have cash when the big correction comes.</li>\n<li>Re invest your profits when we are again in an accumulation zone (after the 80% drop)</li>\n<li>Those cycle take years, be patient.</li>\n</ul>\n\n<p>This is not financial advise. Good luck with your investments!</p>\n</div><!-- SC_ON -->",
  "score": 1015,
  "permalink": "/r/CryptoCurrency/comments/lg0f20/in_a_bull_market_everyone_is_an_investing_genius/",
  "subreddit": "CryptoCurrency",
  "id": "lg0f20",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123197353
}