{
  "author": "Invnsbl123",
  "the_new_excerpt": "tl;dr: $TAKOF is taking off and going places. Rockets (or batteries) have been\nfueled – up we go! I’m not a financial advisor and this is not investment\nadvice.\n\n(Sources in comments)\n\nLonger version\n\nMy investment strategy is finding a stock that will perform well in medium/long\nterm. I usually try…",
  "original_created_utc": 1612389787,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "tl;dr：$TAKOF正在起飞，并去往各个地方。火箭（或电池）已经\n加油-------------------------------我们走 我不是理财顾问，也不是投资。\n建议。\n\n(来源见评论)\n\n较长版本\n\n我的投资策略是找一只中/长线表现好的股票。\n术语。我通常会尝试...",
      "title": "$TAKOF - 无人机交付加拿大 DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "tl;dr：$TAKOF正在起飛，並去往各個地方。火箭（或電池）已經\n加油-------------------------------我們走 我不是理財顧問，也不是投資。\n建議。\n\n(來源見評論)\n\n較長版本\n\n我的投資策略是找一隻中/長線表現好的股票。\n術語。我通常會嘗試...",
      "title": "$TAKOF - 無人機交付加拿大 DD"
    }
  ],
  "title": "$TAKOF - Drone Delivery Canada DD",
  "created_utc": 1612417454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>tl;dr: $<em>TAKOF</em> is taking off and going places. Rockets (or batteries) have been fueled – up we go! I’m not a financial advisor and this is not investment advice.</p>\n\n<p>(<strong>Sources in comments</strong>)</p>\n\n<p>Longer version</p>\n\n<p>My investment strategy is finding a stock that will perform well in medium/long term. I usually try to take profits or cut losses within one year, so look for companies that should benefit from what is happening around the world (be it Covid, green revolution, retail industry tendencies). Today I’ll share my opinion about future of deliveries.</p>\n\n<p>For quite a while there has been a buzz around drone deliveries. Be it Amazon Prime Air, UPS Flight Forward, DHL Parcelcopter (my favorite because of this ridiculous name), Boeing’s Matternet… Everyone with the capacity to is trying to jump on this ship. You can read more about latest developments and companies working in Source 1.</p>\n\n<p>Why there’s such race to develop unmanned cargo air vehicles and autonomous flight technology you might ask? Well, drone doesn’t get sick, can workday and night, it doesn’t have to take breaks or spend half of it’s time chatting around or staring at its phone. It also doesn’t need any contributions to its pension fund or healthcare insurance (needs insurance nevertheless, but technical insurances should come at much better rate than insuring a ball of flesh against all that world could throw at it). Finally, drones don’t care if there’s pandemic raging outside or boogaloo boys are stepping on the grass around some government building.</p>\n\n<p>Drone comes off for the buyer as a one-time purchase cost, thus saving loads of cash in the lung run. Many businesses are taking more ‘green’ approach to their business and calculate their CO2 footprint. Given that drones are powered by electricity (all the attention to the renewable energy, wink wink) it would also help business to boast about reducing carbon footprint while improving their efficiency.</p>\n\n<p>One might think of one issue here: drones are cool and stuff, but what about the battery - it might not be able to cover required distance? Worry not, there are already solutions for this. Mainly ultra-fast charging stations (charge time: 5 minutes) or wireless charging hotspots (charge time: 6 minutes). Check out Source 2 and Source 3.</p>\n\n<p>All in all I believe that drones have a bright future ahead of them and $<em>TAKOF</em> is one of the players in this industry.</p>\n\n<p><strong>Company</strong>: Founded in 2014, Drone Delivery Canada has developed a proprietary and patented turnkey drone delivery solution. The company is fully commercialized, operational, and revenue generating.</p>\n\n<p>DDC has developed a drone delivery platform solution which is cost effective, highly scalable and can provide next generation logistic services to various market sectors including: retail, ecommerce, parcel &amp; post, healthcare, pharmaceuticals, mining, oil &amp; gas, logistics companies, Indigenous Communities, military and government agencies, in Canada and internationally. The Company’s patented, fully integrated hardware/software platform is used as a managed service in a SaaS business model. Drone Delivery Canada is fully commercialized, operational and revenue-generating, with a robust sales funnel of global prospects. <a href=\"https://dronedeliverycanada.com/\">https://dronedeliverycanada.com</a></p>\n\n<p>So far, the company has signed test flight agreements with several major corporations. A medical facility in Ontario, two remote First Nations communities in the same province, GlobalMedic, and Air Canada have all agreed to test the company’s drones. Last year, it also struck a partnership with European logistics/transport group DSV Panalpina A/S.</p>\n\n<p><strong>Latest Catalysts</strong>: Drone Delivery Canada plans to integrate Artificial Intelligence (AI) into its disruptive drone delivery solution (Source 4); Drone Delivery Canada has been named to the 2021 OTCQX® Best 50 (Source 5); In January 2021, the FAA added new rules to 14 CFR Part 107 to permit the expansion of routine flights and created four categories of UAS for flights over suburban/urban areas (Source 6)</p>\n\n<p><strong>Upcoming Catalysts</strong>: release of Q4 and 2020 results; in July company started process to entering US market – at some point there will be announcement if this is a success.</p>\n\n<p><strong>Industry Catalyst</strong>: establishment of a legal basis for unmanned cargo air vehicles, battery technology and wireless charging developments.</p>\n\n<p>Research by Goldman Sachs suggests the market potential could be as big as US$100 billion (CA$130 billion). Meanwhile, startups in the sector are nearly all worth less than $1 billion today (source 7 – claims $<em>TAKOF</em> has multi-bagger also discusses $<em>TAKOF</em> cash position).</p>\n\n<p><strong>Summary</strong>: $<em>TAKOF</em> is ready for a take off! It’s literally in their name.</p>\n\n<p>Seriously, given all the craziness in the current market I wouldn’t rule out this reaching $10 in the next months. Especially if expansion to US is confirmed.</p>\n\n<p>My position: 1k shares at $1.22</p>\n\n<p>That’s it. Now do your own DD. I’m not a financial advisor and this is not investment advice.</p>\n</div><!-- SC_ON -->",
  "score": 69,
  "permalink": "/r/investing/comments/lbzmoi/takof_drone_delivery_canada_dd/",
  "subreddit": "investing",
  "id": "lbzmoi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518536211
}