{
  "author": "IluvBsissa",
  "original_created_utc": 1624808693,
  "title": "Do we have any evidence to support the classic Patriarchy transition theory ?",
  "created_utc": 1624858944,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One  of the most reccurring theme in the feminist intellectual foundation,  is that humans are &quot;naturally&quot; equalitarian (like their Ape cousins) and  have been living so until the Patriarchy transition phase 10 000 years  ago.</p>\n\n<p>In this common narrative,  patrilinearity was not a thing then. Women raised their offsprings  relatively without the assistance of men, and could sustain themselves  quite easily. They had complete control over their reproductive process  (killing babies like any other mammals, if unable to sustain them), men  had seldom any involvement in their education and lived generally  separated from women, while carrying activities that women didn&#39;t have  time to pursue (war and hunting), because of child bearing. Sex was free  and devoid of any social contract.</p>\n\n<p>Everything  changed with the creation of agriculture, surplus production and thus  property : men also figured out that they had an involvement in  reproduction and started gradually to exert control over women&#39;s  offspring and thus their body. They claimed rights over their male  infants to impart their inheritance and changed the fabric of society.</p>\n\n<p>How &quot;true&quot; is this kind of narrative ? Can you recommend any accademic work that can back up this theory ?</p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/o8zkf6/do_we_have_any_evidence_to_support_the_classic/",
  "subreddit": "AskHistorians",
  "id": "o8zkf6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One of the most reccurring theme in the feminist intellectual foundation, is\nthat humans are \"naturally\" equalitarian (like their Ape cousins) and have been\nliving so until the Patriarchy transition phase 10 000 years ago.\n\nIn this common narrative, patrilinearity was not a thing then. Women…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "フェミニストの知的基盤の中で最も繰り返されているテーマの一つが\n人間は（猿の仲間のように）「自然に」平等主義であり、1万年前の家父長制移行期までは\n万年前に家父長制へと移行するまでは、そのように生きてきた。\n\nこの共通の物語では、当時は父系制は存在しませんでした。女性は...",
      "title": "古典的な家父長制移行説を裏付ける証拠はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "女权主义思想基础中最经常出现的主题之一，就是\n人类是 \"天生 \"的平等主义者（就像他们的猿类表亲一样），并且一直如此生活，直到一万年前的父权制过渡阶段。\n在一万年前的父权制过渡阶段之前一直如此生活。\n\n在这个共同的叙述中，父权制在当时并不是一个东西。妇女...",
      "title": "我们有任何证据支持经典的父权制过渡理论吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "女權主義思想基礎中最經常出現的主題之一，就是\n人類是 \"天生 \"的平等主義者（就像他們的猿類表親一樣），並且一直如此生活，直到一萬年前的父權制過渡階段。\n在一萬年前的父權制過渡階段之前一直如此生活。\n\n在這個共同的敘述中，父權制在當時並不是一個東西。婦女...",
      "title": "我們有任何證據支持經典的父權制過渡理論嗎？"
    }
  ]
}