{
  "author": "SB054",
  "the_new_excerpt": "Hello Historians, hopefully this will be an interesting and engaging topic for\nyou to discuss!\n\nIn short, I read a few comments somewhere and the gist of it is this:\n\n\"Some puritans decided to leave their colonies to go live with the native\nAmericans\"\n\nOther comments indicated that young puritan…",
  "original_created_utc": 1623298038,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史家の皆さん、今回のテーマが面白くて魅力的なものになることを願っています。\n議論していただきたいと思います。\n\n要するに、どこかでいくつかのコメントを読んだのですが、その要点はこうです。\n\n\"一部のピューリタンは、植民地を離れてネイティブ・アメリカンと暮らすことを決めた。\nアメリカ人と一緒に暮らそうと考えた」というものです。\n\n他のコメントによると、若いピューリタンは...",
      "title": "アメリカの初期の入植者の中には、植民地を捨ててネイティブ・アメリカンの人々の中で暮らした人もいたのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "历史学家们好，希望这将是一个有趣的、吸引人的话题，供你们讨论。\n的讨论!\n\n简而言之，我在某个地方看到了一些评论，其要点是这样的。\n\n\"一些清教徒决定离开他们的殖民地，去和当地的美国人一起生活\n美国人\"。\n\n其他评论指出，年轻的清教徒...",
      "title": "一些早期的美国定居者是否放弃了他们的殖民地而生活在美国原住民中？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歷史學家們好，希望這將是一個有趣的、吸引人的話題，供你們討論。\n的討論!\n\n簡而言之，我在某個地方看到了一些評論，其要點是這樣的。\n\n\"一些清教徒決定離開他們的殖民地，去和當地的美國人一起生活\n美國人\"。\n\n其他評論指出，年輕的清教徒...",
      "title": "一些早期的美國定居者是否放棄了他們的殖民地而生活在美國原住民中？"
    }
  ],
  "title": "Did some early American settlers abandon their colonies to live among the Native American populations?",
  "created_utc": 1623324548,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello Historians, hopefully this will be an interesting and engaging topic for you to discuss!</p>\n\n<p>In short, I read a few comments somewhere and the gist of it is this: </p>\n\n<p>&quot;Some puritans decided to leave their colonies to go live with the native Americans&quot;</p>\n\n<p>Other comments indicated that young puritan children who were kidnapped did not try to escape and return to their own people. This was chalked up to the natives having better quality of lives due to their millennia of experience on the land. Others equated it to the strict lifestyle of the puritans and the children enjoying the more &quot;free spirited&quot; life of the native population.</p>\n\n<p>So my question is: is there any truth to these claims? Are there any primary sources I can read about this? I tried to Google it but I wasn&#39;t able to find anything that fit the question. So any answers, or even some concise topics to Google, would be greatly appreciated! Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/nwemge/did_some_early_american_settlers_abandon_their/",
  "subreddit": "AskHistorians",
  "id": "nwemge",
  "is_self": true,
  "media": null,
  "is_video": false
}