{
  "author": "Etherealityyyy",
  "original_created_utc": 1650829616,
  "title": "Is it fine to live in a daydream instead of acknowledging a miserable reality if it allows you to function properly?",
  "created_utc": 1650880580,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If the only things that bring you joy are within your own imagination, would it be acceptable to spend all your time daydreaming? Reality would be overwhelmingly desolate and debilitating, resulting in the negligence of basic necessities, such as eating. Meanwhile, pleasant fantasies would provide you with energy to perform any task and enjoy existing. You’d be so absorbed in your own mind, that you wouldn’t see reality the way it really is; it would be a helpful delusion.&lt;/p&gt;\n\n&lt;p&gt;If it’s naught more than an illusion, is daydreaming sound? At what point would daydreaming become unwise?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/ub2nls/is_it_fine_to_live_in_a_daydream_instead_of/",
  "subreddit": "TrueAskReddit",
  "id": "ub2nls",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If the only things that bring you joy are within your own imagination, would it\nbe acceptable to spend all your time daydreaming? Reality would be\noverwhelmingly desolate and debilitating, resulting in the negligence of basic\nnecessities, such as eating. Meanwhile, pleasant fantasies would provide…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "喜びを感じるものが自分の想像力の中にしかないとしたら、それはどうだろう\n空想に耽っていてもいいのでしょうか？現実は\n現実は圧倒的に荒廃し、衰弱し、食事などの基本的なことがおろそかになる。\n食事もままならない。一方、楽しい空想は...。",
      "title": "自分が正しく機能するためなら、惨めな現実を認めず、白昼夢の中で生きていてもいいのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果唯一能给你带来快乐的事情是在你自己的想象中，那么把所有时间都花在白日梦上是否可以接受呢？\n是否可以接受把所有的时间都花在做白日梦上？现实将是\n压倒性的荒凉和衰弱，导致忽略了基本的\n导致忽视基本的需要，如吃饭。同时，愉快的幻想会提供...",
      "title": "生活在白日梦中，而不是承认悲惨的现实，如果这能让你正常运作的话，是不是就可以了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果唯一能給你帶來快樂的事情是在你自己的想象中，那麼把所有時間都花在白日夢上是否可以接受呢？\n是否可以接受把所有的時間都花在做白日夢上？現實將是\n壓倒性的荒涼和衰弱，導致忽略了基本的\n導致忽視基本的需要，如喫飯。同時，愉快的幻想會提供...",
      "title": "生活在白日夢中，而不是承認悲慘的現實，如果這能讓你正常運作的話，是不是就可以了？"
    }
  ]
}