{
  "author": "TresLebres",
  "the_new_excerpt": "I started investing in crypto in 2017 with only a few thousand bucks and a debt\nthat would take about 10 years to be settled. At the time, I couldn't imagine\nhow to get out of this situation and decided to go all in into crypto.\n\nThanks to A LOT OF WORK obviously, a few successful trades, airdrops…",
  "original_created_utc": 1610459904,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从2017年开始投资加密技术，只有几千块钱，还欠了一屁股债。\n这将需要10年左右的时间来解决。当时，我无法想象\n如何摆脱这种情况，并决定全力以赴进入加密。\n\n感谢大量的工作，显然，几个成功的交易，空投... ...",
      "title": "上个月，我已经偿还了8.3万的债务，感谢加密技术!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2017年開始投資加密技術，只有幾千塊錢，還欠了一屁股債。\n這將需要10年左右的時間來解決。當時，我無法想象\n如何擺脫這種情況，並決定全力以赴進入加密。\n\n感謝大量的工作，顯然，幾個成功的交易，空投... ...",
      "title": "上個月，我已經償還了8.3萬的債務，感謝加密技術!"
    }
  ],
  "title": "Last month, I've paid an 83k debt thanks to crypto!",
  "created_utc": 1610502909,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started investing in crypto in 2017 with only a few thousand bucks and a debt that would take about 10 years to be settled. At the time, I couldn&#39;t imagine how to get out of this situation and decided to go all in into crypto.</p>\n\n<p>Thanks to A LOT OF WORK obviously, a few successful trades, airdrops and especially the daily reading of the Reddit forums (which made me keep hope in the Long Winter), I managed to settle the last debt a few weeks ago.</p>\n\n<p>I was inspired by the post from the guy who became a millionaire thanks to crypto, and I&#39;d like to celebrate this little victory with you too!</p>\n\n<p>Now it&#39;s time to start accumulating again! Once more, thank you!</p>\n\n<p>—</p>\n\n<p>EDIT: Some updates answering most asked questions:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Yeah, I paid the taxes.</li>\n<li>About jumping out in a bull market:</li>\n</ol>\n\n<p>I know, but I couldn&#39;t wait any longer... the bank I owed wouldn&#39;t open a checking account that became necessary because of a business contract. I have 2 employees depending on this contract. =]</p>\n\n<ol>\n<li>Some highlights of these 3 years:</li>\n</ol>\n\n<p>Please, this is not a financial advice.</p>\n\n<p>I started reading a lot about BTC and other top10 coins. Invested in some alts because, for me back in 2017, BTC was also too high at 10-20k.</p>\n\n<p>So, I picked up coins with a good product/idea and company/team behind it. Examples are: IOTA, XRP (at least in my first readings), XMR. Because I joined in quite early, I didn&#39;t lose money with XRP, for example, but I did with IOTA (because of the timing).</p>\n\n<p>In the bear market, I put some money in BTC as well -- monthly, yeah. Then, started to look for microcap projects, such as BOMB, Parachute token, Uptrennd, XIO etc. Making part of these microcap communities is a good way to make some extra and know some good people. Of course, be very aware of scams.</p>\n\n<p>Today, I wish I could have done some things different:</p>\n\n<ol>\n<li>Don&#39;t fall in love with an asset (and sell or exchange them for profit);</li>\n<li>Bitcoin is the most resillient coin around, so it would be much less stressful if I had more BTC instead of alts;</li>\n<li>Don&#39;t be too greedy and profit all over the bullrun;</li>\n<li>DCA is the best strategy, as most of you pointed out;</li>\n<li>Don&#39;t hodl when the bear market starts (these were the longest 3 years in my life lol). I would sell everything back in Q1 2018 to return months or years later.</li>\n</ol>\n\n<p>Thanks for your kind words. And yes,  this is why we crypto!</p>\n</div><!-- SC_ON -->",
  "score": 2864,
  "permalink": "/r/CryptoCurrency/comments/kvs4rc/last_month_ive_paid_an_83k_debt_thanks_to_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "kvs4rc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706376237
}