{
  "author": "ZypherBro",
  "original_created_utc": 1626470785,
  "title": "Stay away from Anon INU!! Scamcoin!",
  "created_utc": 1626526413,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Noone buy this fucking crap!!!! You think anonymous would launch a coin to get money??? And on a friggin centralized chain??? This is so bullshit. I hope noone ever buys this piece of scam coin… Awww god it makes me so fucking pissed that people are actually gonna fall for this, and a bunch of pissants are gonna get rich on this scam.</p>\n\n<p>Please dont fall for it…! </p>\n\n<p>And if youre an opportunist, please do not take advantage of this scam by joining in on a hype-&gt;chartist-&gt;rugpull process. Sometimes moral &gt; money! If crypto is gonna stay deregulated, we need to fucking fight this shit! And never contribute, no matter how tempting!</p>\n\n<p>We all know how the «Anonymous» video on Musk went viral not too long ago. We all know that people fucking love anonymous. Thats what makes this freakin scam very scary and disgusting. STAY AWAY! Whether you know what this is or not!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/olqfc5/stay_away_from_anon_inu_scamcoin/",
  "subreddit": "CryptoCurrency",
  "id": "olqfc5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Noone buy this fucking crap!!!! You think anonymous would launch a coin to get\nmoney??? And on a friggin centralized chain??? This is so bullshit. I hope noone\never buys this piece of scam coin… Awww god it makes me so fucking pissed that\npeople are actually gonna fall for this, and a bunch of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もこのクソゲーを買わない!!!! 匿名がお金を得るためにコインを発行すると思いますか？\n貨幣を得るために 糞みたいな中央集権的チェーンで？これは本当にデタラメだ。誰も\nこの詐欺コインを誰も買わないことを願うよ...。\n人々は実際にこれに騙されるだろうし、多くの...",
      "title": "アノンINUに近づかないで! 詐欺コイン!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "没有人买这该死的垃圾!!!! 你认为匿名者会推出一个硬币来获取\n钱吗？而且是在一个该死的中心化链上？这简直是胡说八道。我希望没有人\n我希望没有人买这个骗人的硬币......天啊，这让我他妈的很生气，因为\n人们居然会上当受骗，还有一群...",
      "title": "远离Anon INU!!! 诈骗币!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "沒有人買這該死的垃圾!!!! 你認爲匿名者會推出一個硬幣來獲取\n錢嗎？而且是在一個該死的中心化鏈上？這簡直是胡說八道。我希望沒有人\n我希望沒有人買這個騙人的硬幣......天啊，這讓我他媽的很生氣，因爲\n人們居然會上當受騙，還有一羣...",
      "title": "遠離Anon INU!!! 詐騙幣!"
    }
  ]
}