{
  "author": "PadraicG",
  "original_created_utc": 1648471106,
  "title": "Why are people angry with Chris Rock?",
  "created_utc": 1648474739,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;He made a joke about a bald person being bald. Yes she has alopecia. It&amp;#39;s not her fault. He&amp;#39;s a fucking comedian. Have you heard some of the shit Frankie Boyle has said? &lt;/p&gt;\n\n&lt;p&gt;From jadas reaction it&amp;#39;s clear she has ego problems. This is not a good trait. Saying she&amp;#39;s insecure and has no control over the fact she&amp;#39;s bald doesn&amp;#39;t really mean much to me. Lots of people are insecure about things they can&amp;#39;t change, me included. Own it! &lt;/p&gt;\n\n&lt;p&gt;When you have an insecurity you should work on your relationship with it. No one does this anymore. People just hope no one ever notices it and get offended when a joke is made. Chris didn&amp;#39;t call her ugly, or make a much worse joke about her fucking her son&amp;#39;s friend. &lt;/p&gt;\n\n&lt;p&gt;I actually can&amp;#39;t believe how sensitive people are these days. I&amp;#39;m young, I&amp;#39;m very accepting and empathetic but my god it was a harmless joke. Some people are calling it bullying? Have you ever been bullied before??? That&amp;#39;s not bullying. That&amp;#39;s comedy, from a comedian who was literally on stage getting paid to do comedy. &lt;/p&gt;\n\n&lt;p&gt;Honestly I hope more jokes are made at their expense, maybe they&amp;#39;ll finally deal with their fragile egos and insecurities.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/tq8dar/why_are_people_angry_with_chris_rock/",
  "subreddit": "TooAfraidToAsk",
  "id": "tq8dar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "He made a joke about a bald person being bald. Yes she has alopecia. It's not\nher fault. He's a fucking comedian. Have you heard some of the shit Frankie\nBoyle has said?\n\nFrom jadas reaction it's clear she has ego problems. This is not a good trait.\nSaying she's insecure and has no control over the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハゲの人がハゲているというジョークを言ったのです。そう彼女は脱毛症なのです。それは\n彼女のせいだ 彼はクソコメディアンだ。フランキーのクソ話を聞いたか？\nボイルが言ったのか？\n\nジェイダスの反応からして、彼女がエゴの問題を抱えていることは明らかです。これは良い特徴ではありません。\n\"不安だ \"と言って...",
      "title": "なぜ、人々はクリス・ロックに怒っているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他开了一个关于秃头人的玩笑。是的，她有脱发症。这不是\n她的错。他是一个他妈的喜剧演员。你听说过弗兰基-博伊尔说过的一些废话吗？\n博伊尔说过的话吗？\n\n从贾达斯的反应来看，她显然有自我问题。这不是一个好的特质。\n说她没有安全感，无法控制...",
      "title": "为什么人们对克里斯-洛克感到愤怒？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他開了一個關於禿頭人的玩笑。是的，她有脫髮症。這不是\n她的錯。他是一個他媽的喜劇演員。你聽說過弗蘭基-博伊爾說過的一些廢話嗎？\n博伊爾說過的話嗎？\n\n從賈達斯的反應來看，她顯然有自我問題。這不是一個好的特質。\n說她沒有安全感，無法控制...",
      "title": "爲什麼人們對克里斯-洛克感到憤怒？"
    }
  ]
}