{
  "author": "PadraicG",
  "original_created_utc": 1648471106,
  "title": "Why are people angry with Chris Rock?",
  "created_utc": 1648474739,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;He made a joke about a bald person being bald. Yes she has alopecia. It&amp;#39;s not her fault. He&amp;#39;s a fucking comedian. Have you heard some of the shit Frankie Boyle has said? &lt;/p&gt;\n\n&lt;p&gt;From jadas reaction it&amp;#39;s clear she has ego problems. This is not a good trait. Saying she&amp;#39;s insecure and has no control over the fact she&amp;#39;s bald doesn&amp;#39;t really mean much to me. Lots of people are insecure about things they can&amp;#39;t change, me included. Own it! &lt;/p&gt;\n\n&lt;p&gt;When you have an insecurity you should work on your relationship with it. No one does this anymore. People just hope no one ever notices it and get offended when a joke is made. Chris didn&amp;#39;t call her ugly, or make a much worse joke about her fucking her son&amp;#39;s friend. &lt;/p&gt;\n\n&lt;p&gt;I actually can&amp;#39;t believe how sensitive people are these days. I&amp;#39;m young, I&amp;#39;m very accepting and empathetic but my god it was a harmless joke. Some people are calling it bullying? Have you ever been bullied before??? That&amp;#39;s not bullying. That&amp;#39;s comedy, from a comedian who was literally on stage getting paid to do comedy. &lt;/p&gt;\n\n&lt;p&gt;Honestly I hope more jokes are made at their expense, maybe they&amp;#39;ll finally deal with their fragile egos and insecurities.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/tq8dar/why_are_people_angry_with_chris_rock/",
  "subreddit": "TooAfraidToAsk",
  "id": "tq8dar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "He made a joke about a bald person being bald. Yes she has alopecia. It's not\nher fault. He's a fucking comedian. Have you heard some of the shit Frankie\nBoyle has said?\n\nFrom jadas reaction it's clear she has ego problems. This is not a good trait.\nSaying she's insecure and has no control over the…"
}