{
  "author": "OutOfWine",
  "the_new_excerpt": "I have worked some 20 years as an engineer. Ever since I started working, I had\nthis gut feeling that I would never get enough for retirement, that there would\nbe depreciation, that the system might collapse.\n\nI grew up in a third world country, and I remember my father being VERY upset\nbecause of…",
  "original_created_utc": 1616907775,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我做了20多年的工程师。自从我开始工作以来，我有\n这种直觉，我永远不会得到足够的退休，有将\n贬值，系统可能会崩溃。\n\n我在第三世界国家长大 我记得我父亲非常不高兴\n因为...",
      "title": "我从来不相信我的退休基金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做了20多年的工程師。自從我開始工作以來，我有\n這種直覺，我永遠不會得到足夠的退休，有將\n貶值，系統可能會崩潰。\n\n我在第三世界國家長大 我記得我父親非常不高興\n因爲...",
      "title": "我從來不相信我的退休基金"
    }
  ],
  "title": "I never ever believe in my retirement fund",
  "created_utc": 1616931497,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have worked some 20 years as an engineer. Ever since I started working, I had this gut feeling that I would never get enough for retirement, that there would be depreciation, that the system might collapse.</p>\n\n<p>I grew up in a third world country, and I remember my father being VERY upset because of an 80% devaluation -overnight. He had his debts in usd, so we were financially screw. I was very young, did not even knew math, but when he literally eli5 the situation for my, I had complete understanding of the situation.</p>\n\n<p>He owe 10 american bananas and needed about 20 local bananas to pay. But now our bananas were cheaper and he needed 100 bananas to pay for the 10 american bananas. And we only had about 30, so we needed 70 extra bananas and that is how my sister, his wife and the girl she find in a forest ended up working in the streets at night, to get most needed bananas for us.</p>\n\n<p>Joke aside, I never in my life see my family being so miserable overnight.</p>\n\n<p>In 2014, there was &quot;a voice&quot; telling me to buy btc. I did not even understood what it was but I buy in and after the crash, I sold and lost (7 btc).</p>\n\n<p>2015, when the price went up again, the voice kept telling me to buy and I did. I kept doing that and in 2018, after the crash, I did not sell. I understood it was a cycle.</p>\n\n<p>And oh boy, are 3 years long? They are.</p>\n\n<p>But I kept buying, every month a little bit.</p>\n\n<p>If anything, I regret I did not put all my savings there. I kept accumulating satoshis.</p>\n\n<p>During this bullrun, I got probably 3x what I have in my retirement fund already, and I am not planning to sell like I did in 2015.</p>\n\n<p>Another thing I realize while growing up is that both my grandparents had big houses and a number of cars, and my father could only afford a tiny house and 1 car, and myself? I was never willing to get a credit to pay in 30 years for a house half the size of my parents and move on public transport. The system was obviously not working.</p>\n\n<p>All the fears that I had when I was a kid came back to hunt me. Devaluation is not just a phenomenon of third world countries.</p>\n\n<p>Today I do not give a fuck anymore about my retirement money. I am much more upset that the government takes taxes from the risk that I took since 2014. While they keep devaluating the money a little bit every year to a lot sometimes, they want us to pay for they stupid games. And all along, the people who make the rules, politicians backed by big money, keep doing more money.</p>\n\n<p>Is this a rant?</p>\n\n<p>TLDR, I never believe in my retirement fund.</p>\n\n<p>Edit: for people sending me PMs/DMs, as always, you will get immediately blocked. If you have something to say, do it public, in the comments.</p>\n</div><!-- SC_ON -->",
  "score": 346,
  "permalink": "/r/Bitcoin/comments/meuy1v/i_never_ever_believe_in_my_retirement_fund/",
  "subreddit": "Bitcoin",
  "id": "meuy1v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357133937
}