{
  "author": "EMInvestor",
  "the_new_excerpt": "Saw this excerpt in today's Economic Times which made me think of how to play\nthe India housing theme. INDF and INDA are two ETFs with mortgage company HDFC.\nAny other ways to invest for investors outside India?\n\n\n\nThe chief anchor of demand in India incrementally is housing. Given the higher\nlevel…",
  "original_created_utc": 1610474925,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在今天的《经济时报》上看到这样的节选，让我想到了如何玩转\n的印度住房主题。INDF和INDA是两只ETF，抵押贷款公司HDFC。\n印度以外的投资者还有其他投资方式吗？\n\n\n\n印度增量需求的主力军是住房。鉴于较高的\n级别...",
      "title": "如何玩转印度即将到来的房市热潮？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在今天的《經濟時報》上看到這樣的節選，讓我想到了如何玩轉\n的印度住房主題。INDF和INDA是兩隻ETF，抵押貸款公司HDFC。\n印度以外的投資者還有其他投資方式嗎？\n\n\n\n印度增量需求的主力軍是住房。鑑於較高的\n級別...",
      "title": "如何玩轉印度即將到來的房市熱潮？"
    }
  ],
  "title": "Ways to play India's upcoming housing market boom?",
  "created_utc": 1610502911,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Saw this excerpt in today&#39;s Economic Times which made me think of how to play the India housing theme. INDF and INDA are two ETFs with mortgage company HDFC. Any other ways to invest for investors outside India?</p>\n\n<p>&#x200B;</p>\n\n<p>The chief anchor of demand in India incrementally is housing. Given the higher level of affordability, very low levels of real interest rates and interest rates, access to mortgage loans and subsidised loans for affordable housing, it is very attractive for people to go and buy houses. Every time you buy a house, there are a million things you do; you buy your curtains and furniture and 20 other things.</p>\n\n<p>Our real estate prices have actually gone nowhere and the income levels have risen. So the affordability is very, very high. It is not just in charts but in reality if you go and buy a house today, it is very high especially in the tier II, tier III towns.</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/investing/comments/kvx0cl/ways_to_play_indias_upcoming_housing_market_boom/",
  "subreddit": "investing",
  "id": "kvx0cl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379517
}