{
  "author": "JustiNoPot",
  "original_created_utc": 1635519642,
  "title": "What is your 3rd blue chip?",
  "created_utc": 1635539808,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>BTC and ETH are often considered the blue chips of the crypto space. Everything else is often called an Altcoin. But, if you had to pick one Altcoin, which Altcoin do you think deserves to be recognized as a crypto blue chip? Why?</p>\n\n<p>For me, I think I would have to choose CRV. I love the revenue share component and the stickiness its tokenomics provide.</p>\n\n<p>I&#39;m curious what others think of as the blue chips of the crypto space. Not necessarily the best opportunities that have the potential to make the most money, but what do you all think are some of the safer bets?</p>\n\n<p>Obviously none of this discussion should be considered financial advice.</p>\n\n<p>Edit: I&#39;ve never had a post blow up like this. This is crazy</p>\n</div><!-- SC_ON -->",
  "score": 234,
  "permalink": "/r/CryptoCurrency/comments/qier88/what_is_your_3rd_blue_chip/",
  "subreddit": "CryptoCurrency",
  "id": "qier88",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "BTC and ETH are often considered the blue chips of the crypto space. Everything\nelse is often called an Altcoin. But, if you had to pick one Altcoin, which\nAltcoin do you think deserves to be recognized as a crypto blue chip? Why?\n\nFor me, I think I would have to choose CRV. I love the revenue share…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCとETHは、しばしば暗号空間のブルーチップと考えられています。それ以外の\nアルトコインと呼ばれています。しかし、もしあなたがアルトコインをひとつ選ぶとしたら、どのアルトコインが\nAltcoinは、暗号のブルーチップとして認識されるに値すると思いますか？なぜですか？\n\n私の場合は、CRVを選ぶべきだと思います。レベニューシェアが気に入っています...",
      "title": "あなたの3番目のブルーチップは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "BTC和ETH通常被认为是加密货币领域的蓝筹股。其他一切\n其他的通常被称为阿尔特币。但是，如果你不得不选择一个阿尔特币，你认为哪个\n你认为哪一个Altcoin值得被认可为加密货币蓝筹股？为什么？\n\n对我来说，我想我必须选择CRV。我喜欢这种收入分成...",
      "title": "你的第三个蓝筹股是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "BTC和ETH通常被認爲是加密貨幣領域的藍籌股。其他一切\n其他的通常被稱爲阿爾特幣。但是，如果你不得不選擇一個阿爾特幣，你認爲哪個\n你認爲哪一個Altcoin值得被認可爲加密貨幣藍籌股？爲什麼？\n\n對我來說，我想我必須選擇CRV。我喜歡這種收入分成...",
      "title": "你的第三個藍籌股是什麼？"
    }
  ]
}