{
  "author": "Successful_Craft3076",
  "original_created_utc": 1650996861,
  "title": "Doge is gaining because Elon is buying Twitter. I guess some people never learn!!",
  "created_utc": 1651035238,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You remember saint Elon? \nAKA The Dogefather?\nThe man who loves to creat hype around his beloved Doge and just when everyone is jumping the bandwagon, drop the hammer on the same coin. Like in the middle of SNL? Yes. That Elon. Same man who promised you can buy Tesla with Doge but always had some kind of excuse for not doing it?&lt;/p&gt;\n\n&lt;p&gt;The man who always makes big promises only to backtrack on them?\nThe richest man in the world which I am sure was possible because he is such a nice and caring human being and not a greedy wage thief! &lt;/p&gt;\n\n&lt;p&gt;That same Elon is buying twitter and millions rushed to buy Doge sending it&amp;#39;s price more than 30% upward before it nosedive -20% few hours later.&lt;/p&gt;\n\n&lt;p&gt;And we are discussing 24/7 about what is the problem with crypto.&lt;/p&gt;\n\n&lt;p&gt;Have a nice day!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/ucixf5/doge_is_gaining_because_elon_is_buying_twitter_i/",
  "subreddit": "CryptoCurrency",
  "id": "ucixf5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You remember saint Elon? AKA The Dogefather? The man who loves to creat hype\naround his beloved Doge and just when everyone is jumping the bandwagon, drop\nthe hammer on the same coin. Like in the middle of SNL? Yes. That Elon. Same man\nwho promised you can buy Tesla with Doge but always had some…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "聖人Elonを覚えていますか？別名「ドージェフファーザー」？愛すべきドージェに誇大広告を打つのが大好きな男\n自分の愛するDogeの周りに誇大宣伝をするのが大好きで、みんながその流れに乗ったところで、同じコインを落としていく。\n同じコインにハンマーを落とす。SNLみたいな？そうだ あのイーロンだ。同じ男\nテスラをドージェで買うと約束した男だでも、いつも...",
      "title": "ドゲが得しているのは、イーロンがツイッターを買っているからだ。懲りない人がいるもんだ!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你还记得圣人伊隆吗？又名 \"狗爸爸\"？那个喜欢围绕他心爱的Doge进行炒作的人\n他喜欢围绕他心爱的Doge进行炒作，当所有人都在跳槽的时候，他又把\n砸下同一枚硬币的锤子。就像在SNL的中间？是的。那个埃隆。同一个人\n他承诺你可以用Doge购买特斯拉，但总是有一些...",
      "title": "多格正在获得收益，因为埃隆正在收购Twitter。我想有些人永远也学不会！!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你還記得聖人伊隆嗎？又名 \"狗爸爸\"？那個喜歡圍繞他心愛的Doge進行炒作的人\n他喜歡圍繞他心愛的Doge進行炒作，當所有人都在跳槽的時候，他又把\n砸下同一枚硬幣的錘子。就像在SNL的中間？是的。那個埃隆。同一個人\n他承諾你可以用Doge購買特斯拉，但總是有一些...",
      "title": "多格正在獲得收益，因爲埃隆正在收購Twitter。我想有些人永遠也學不會！!"
    }
  ]
}