{
  "author": "snytax",
  "the_new_excerpt": "I was just wondering if anyone could shed some more light on optics behind the\ndecision to not prosecute them. From what I've read high ranking officer's in\nMussolini's army gave orders for the use of mustard gas and deliberate attacks\nagainst red cross facilities. Surely these crimes alone would…",
  "original_created_utc": 1617638439,
  "localize": [
    {
      "locale": "ja-JA",
      "the_new_excerpt": "私はただ、誰かがこの決断をした背景にある光学的な要因を説明してくれないかと思っていました。\n不起訴処分にした背景について 私が読んだところによると、ムッソリーニ軍の高級将校は、マスタードガスの使用や意図的な攻撃を命令したそうです。\nムッソリーニ軍の高級将校がマスタードガスの使用や赤十字施設への意図的な攻撃を指示したと聞いています。\nムッソリーニ軍の高級将校がマスタードガスの使用や赤十字施設への意図的な攻撃を指示したとのことです。確かにこれらの犯罪だけでは...。",
      "title": "枢軸国の戦争犯罪の調査において、イタリアがエチオピアでガスを使用したことがほとんど無視されたのはなぜか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想知道，如果有人能提供一些更多的光背后的光学。\n决定不起诉他们。从我所读到的高级官员的在。\n墨索里尼的军队下达了使用芥子气和蓄意攻击的命令。\n对红十字会的设施。当然，仅这些罪行就会...",
      "title": "为什么在调查轴心国战争罪行的过程中，意大利在埃塞俄比亚使用毒气的情况基本被忽略？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想知道，如果有人能提供一些更多的光背後的光學。\n決定不起訴他們。從我所讀到的高級官員的在。\n墨索里尼的軍隊下達了使用芥子氣和蓄意攻擊的命令。\n對紅十字會的設施。當然，僅這些罪行就會...",
      "title": "爲什麼在調查軸心國戰爭罪行的過程中，意大利在埃塞俄比亞使用毒氣的情況基本被忽略？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "私はただ、誰かがこの決断をした背景にある光学的な要因を説明してくれないかと思っていました。\n不起訴処分にした背景について 私が読んだところによると、ムッソリーニ軍の高級将校は、マスタードガスの使用や意図的な攻撃を命令したそうです。\nムッソリーニ軍の高級将校がマスタードガスの使用や赤十字施設への意図的な攻撃を指示したと聞いています。\nムッソリーニ軍の高級将校がマスタードガスの使用や赤十字施設への意図的な攻撃を指示したとのことです。確かにこれらの犯罪だけでは...。",
      "title": "枢軸国の戦争犯罪の調査において、イタリアがエチオピアでガスを使用したことがほとんど無視されたのはなぜか？"
    }
  ],
  "title": "Why was the Italian use of gas in Ethiopia largely ignored during the investigation of Axis war crimes?",
  "created_utc": 1617696364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was just wondering if anyone could shed some more light on optics behind the decision to not prosecute them. From what I&#39;ve read high ranking officer&#39;s in Mussolini&#39;s army gave orders for the use of mustard gas and deliberate attacks against red cross facilities. Surely these crimes alone would warrant st least lengthy prison sentences, but it seems as most of them died years after the war free.  Pietro Badoglio and Rodolfo Graziani are two examples of this I found already but nothing on why they were spared. I&#39;m guessing it had to do with political pressure or logistical issues but any further information would be great.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/mko1g2/why_was_the_italian_use_of_gas_in_ethiopia/",
  "subreddit": "AskHistorians",
  "id": "mko1g2",
  "is_self": true,
  "media": null,
  "is_video": false
}