{
  "author": "WolvesWillWin",
  "original_created_utc": 1632547867,
  "title": "How does anything exist at all and why does nobody else lose their minds over it?",
  "created_utc": 1632575894,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So like im just trying to comprehend life. So regardless if you believe in strictly science or are religious, how can anything exist? Like there should be nothing but what would nothing look like or be? It wouldn&#39;t just be blackness because that&#39;s something. So moving past how anything at all exists, from a 3rd person perspective, I can sort of see how life can be created and exist but it&#39;s a total mindfuck that I am me. Like I myself am a thing come from nothing. I can&#39;t stop thinking about this shit every day and the only logical thing is there is a God and we are in an existence of rules we can only comprehend and life outside of this universe has a whole different set of physics, rules, etc. That explains existence. Something that we can&#39;t even think of. Which doesn&#39;t really make sense but is the most sensible reasoning. Anyways. I just can&#39;t stop thinking about it all the time and I don&#39;t understand why I&#39;m the only one it seems truly bothered by this constantly</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/pv0i5r/how_does_anything_exist_at_all_and_why_does/",
  "subreddit": "NoStupidQuestions",
  "id": "pv0i5r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So like im just trying to comprehend life. So regardless if you believe in\nstrictly science or are religious, how can anything exist? Like there should be\nnothing but what would nothing look like or be? It wouldn't just be blackness\nbecause that's something. So moving past how anything at all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、私は人生を理解しようとしているのです。厳密に科学を信じるか、宗教を信じるかに関わらず\n厳密に科学を信じるか、宗教を信じるかに関わらず、どうやって何かが存在するのか？何もないはずなのに\n何もないはずなのに、何もないというのはどのようなものなのでしょうか？それはただの黒ではないでしょう\nそれは何かがあるからです。つまり、何かが存在するということを超えて...",
      "title": "何がどう存在しているのか、なぜ誰もそれに気づかないのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我只是在努力理解生活。所以不管你是相信\n严格意义上的科学或宗教，怎么可能有东西存在？比如说应该有\n但什么也没有看起来像什么？它不会仅仅是黑色的\n因为那是一些东西。因此，在任何东西都不存在的情况下...",
      "title": "任何东西都是怎么存在的，为什么没有人为此失去理智？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我只是在努力理解生活。所以不管你是相信\n嚴格意義上的科學或宗教，怎麼可能有東西存在？比如說應該有\n但什麼也沒有看起來像什麼？它不會僅僅是黑色的\n因爲那是一些東西。因此，在任何東西都不存在的情況下...",
      "title": "任何東西都是怎麼存在的，爲什麼沒有人爲此失去理智？"
    }
  ]
}