{
  "author": "lighteningrod3",
  "original_created_utc": 1647910911,
  "title": "Would it be psychotic to live in the woods?",
  "created_utc": 1647924937,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m tired of paying 1,300 dollars a month, plus utilities. If I spent 3 or 4 months in a tent in the woods I would save a lot of money, which would be very helpful to me. I work in an industrial zone, but a lot of it is actually still undeveloped, and there’s plenty of woods about only a few 100 yards from where I work. &lt;/p&gt;\n\n&lt;p&gt;What I could do is something like this, go into the woods after work, hang out in the tent, wake up, hit the gym, shower, go to work, charge my phone at work, and use their fridge to store a bit of food here and there. Also use their microwave. I work fairly independently, so they wouldn’t mind me staying late or coming in early, and I work in the side of the building away from manufacturing and most of the offices, so I can take a lot of time to prepare food without anyone really noticing or caring. Overall I think I can make it work and basically have all my essential needs taken care of. &lt;/p&gt;\n\n&lt;p&gt;But I’m a little bit worried if I do, somehow, someone would find out I’m living in the woods. And then they’d assume I’ve gone completely insane and am psychotic. No one just lives in the woods. But I actually like camping, and nature, so I think I would be fine out there. Should I live in the woods, or is it not worth it and a deranged idea?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/tjr0yr/would_it_be_psychotic_to_live_in_the_woods/",
  "subreddit": "TooAfraidToAsk",
  "id": "tjr0yr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m tired of paying 1,300 dollars a month, plus utilities. If I spent 3 or 4\nmonths in a tent in the woods I would save a lot of money, which would be very\nhelpful to me. I work in an industrial zone, but a lot of it is actually still\nundeveloped, and there’s plenty of woods about only a few 100…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "月々1,300円、光熱費も払っているので、もううんざりです。もし、3、4ヶ月\n森の中のテントで数ヶ月過ごせば、かなりの節約になるはずです。\nということです。私の職場は工業地帯ですが、実はまだその多くが未完成です。\n未開発の森がたくさんあるんです。",
      "title": "森に住むのは精神病でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经厌倦了每月支付1300美元，外加水电费。如果我花3或4个\n个月，我就能省下一大笔钱，这对我很有帮助。\n对我很有帮助。我在一个工业区工作，但很多地方实际上仍然是\n未开发，而且有很多树林，只有几百米......",
      "title": "住在树林里会不会是精神病？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經厭倦了每月支付1300美元，外加水電費。如果我花3或4個\n個月，我就能省下一大筆錢，這對我很有幫助。\n對我很有幫助。我在一個工業區工作，但很多地方實際上仍然是\n未開發，而且有很多樹林，只有幾百米......",
      "title": "住在樹林裏會不會是精神病？"
    }
  ]
}