{
  "author": "lighteningrod3",
  "original_created_utc": 1647910911,
  "title": "Would it be psychotic to live in the woods?",
  "created_utc": 1647924937,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m tired of paying 1,300 dollars a month, plus utilities. If I spent 3 or 4 months in a tent in the woods I would save a lot of money, which would be very helpful to me. I work in an industrial zone, but a lot of it is actually still undeveloped, and there’s plenty of woods about only a few 100 yards from where I work. &lt;/p&gt;\n\n&lt;p&gt;What I could do is something like this, go into the woods after work, hang out in the tent, wake up, hit the gym, shower, go to work, charge my phone at work, and use their fridge to store a bit of food here and there. Also use their microwave. I work fairly independently, so they wouldn’t mind me staying late or coming in early, and I work in the side of the building away from manufacturing and most of the offices, so I can take a lot of time to prepare food without anyone really noticing or caring. Overall I think I can make it work and basically have all my essential needs taken care of. &lt;/p&gt;\n\n&lt;p&gt;But I’m a little bit worried if I do, somehow, someone would find out I’m living in the woods. And then they’d assume I’ve gone completely insane and am psychotic. No one just lives in the woods. But I actually like camping, and nature, so I think I would be fine out there. Should I live in the woods, or is it not worth it and a deranged idea?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/tjr0yr/would_it_be_psychotic_to_live_in_the_woods/",
  "subreddit": "TooAfraidToAsk",
  "id": "tjr0yr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m tired of paying 1,300 dollars a month, plus utilities. If I spent 3 or 4\nmonths in a tent in the woods I would save a lot of money, which would be very\nhelpful to me. I work in an industrial zone, but a lot of it is actually still\nundeveloped, and there’s plenty of woods about only a few 100…"
}