{
  "author": "Algorithmsandblues",
  "the_new_excerpt": "We know Warren Buffett’s advice to be greedy when others are fearful and fearful\nwhen others are greedy. I’m in my mid 30s and followed this advice pretty well,\ngoing into index ETFs pretty hard last March, with some additional individual\nstocks along the way\n\nI worry now with the all time highs we…",
  "original_created_utc": 1618751896,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウォーレン・バフェットの「人が恐れているときには貪欲に、人が恐れているときには恐怖心を持て」というアドバイスを知っています。\n他の人が欲張っているときには欲張れ。私は30代半ばですが、このアドバイスによく従いました。\n私は30代半ばですが、このアドバイスに従って、昨年の3月にインデックスETFに本格的に取り組み、途中で個別株をいくつか追加しました。\nまた、途中でいくつかの個別株を購入しました。\n\n史上最高値を記録した今、私は心配しています...",
      "title": "今は恐れるべき時なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们知道巴菲特的忠告，在别人胆战心惊的时候，我们要贪婪。\n当别人贪心的时候。我30多岁了，很好地遵循了这个建议。\n去年3月，进入指数ETF的力度相当大，一些额外的个人\n沿途股票\n\n我担心现在的所有时间高点，我们... ...",
      "title": "现在是害怕的时候吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們知道巴菲特的忠告，在別人膽戰心驚的時候，我們要貪婪。\n當別人貪心的時候。我30多歲了，很好地遵循了這個建議。\n去年3月，進入指數ETF的力度相當大，一些額外的個人\n沿途股票\n\n我擔心現在的所有時間高點，我們... ...",
      "title": "現在是害怕的時候嗎？"
    }
  ],
  "title": "Is now the time to be fearful?",
  "created_utc": 1618757005,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We know Warren Buffett’s advice to be  greedy when others are fearful and fearful when others are greedy. I’m in my mid 30s and followed this advice pretty well, going into index ETFs pretty hard last March, with some additional individual stocks along the way</p>\n\n<p>I worry now with the all time highs we are in a time that there is a lot of greed. Is it time to start being fearful and get some liquidity with the expectation of the correction where we can go back in with the bargains?</p>\n</div><!-- SC_ON -->",
  "score": 3024,
  "permalink": "/r/stocks/comments/mtcntf/is_now_the_time_to_be_fearful/",
  "subreddit": "stocks",
  "id": "mtcntf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526210
}