{
  "author": "futureIsYes",
  "the_new_excerpt": "https://www.wsj.com/articles/if-tesla-bubble-bursts-catastrophe-wont-follow-11613221203\n\n * The excess in today’s story stocks—electric cars, clean power and cannabis in\n   particular—surely poses a threat to the wealth of their shareholders. Even if\n   there is a wider bubble, it might not be a…",
  "original_created_utc": 1613467695,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.wsj.com/articles/if-tesla-bubble-bursts-catastrophe-wont-follow-11613221203\n\n *今天故事中的过剩股票--电动汽车、清洁能源和大麻在。\n   尤其是--肯定会对其股东的财富构成威胁。即使\n   有一个更广泛的泡沫，它可能不是一个... ...",
      "title": "华尔街日报》的文章很有意思。如果TSLA泡沫破灭，灾难就不会发生了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.wsj.com/articles/if-tesla-bubble-bursts-catastrophe-wont-follow-11613221203\n\n *今天故事中的過剩股票--電動汽車、清潔能源和大麻在。\n   尤其是--肯定會對其股東的財富構成威脅。即使\n   有一個更廣泛的泡沫，它可能不是一個... ...",
      "title": "華爾街日報》的文章很有意思。如果TSLA泡沫破滅，災難就不會發生了"
    }
  ],
  "title": "Interesting article from WSJ: If TSLA bubble bursts, catastrophe won't flow",
  "created_utc": 1613495616,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.wsj.com/articles/if-tesla-bubble-bursts-catastrophe-wont-follow-11613221203\">https://www.wsj.com/articles/if-tesla-bubble-bursts-catastrophe-wont-follow-11613221203</a></p>\n\n<ul>\n<li>The excess in today’s story stocks—electric cars, clean power and cannabis in particular—surely poses a threat to the wealth of their shareholders. Even if there is a wider bubble, it might not be a catastrophe for the country.</li>\n</ul>\n\n<p>-not all bubbles are equal. The economic dangers of a stock bubble come from people taking on debt to buy shares and from companies overinvesting. </p>\n\n<p>-When the bubble pops, overextended shareholders have to cut spending or go bankrupt. Companies suddenly faced with investors demanding a return have to lay off workers and slash investment.</p>\n\n<p>-None of this is an issue for the obvious bubbles under way in the fashionable stocks of the moment</p>\n\n<p>-Even if TSLA vanished tomorrow, it would have an insignificant effect on the economy, as Tesla’s operations are tiny. It is mostly equity-financed, so its failure wouldn’t start a domino line of bank failures. And while shareholders would be hurt, there’s no reason to think that would lead to a collapse in spending across the country</p>\n\n<p>-The closest parallel is not the dot-com bubble, for all the similarities, but the British bicycle mania of the 1890s. 671 new bicycle companies, raising £27 million in 1896 alone—equivalent to 1.6% of British gross domestic product that year. By comparison, the fast-growing IPO alternative of SPACs raised only about 0.4% of U.S. GDP last year</p>\n\n<ul>\n<li>Half these bicycle companies failed by the end of the decade, leading to 71% fall in bicycle stocks in18 months. But the British economy barely noticed this.</li>\n</ul>\n\n<p>What if today’s excesses aren’t just in the speculative story stocks like Tesla, but across the market?  if I’m wrong and shares in the highly valued technology and associated sectors did crash, it probably wouldn’t be that bad. If Apple’s share price halved, it would make no difference to the underlying business. That is different from the dot-coms, which were forced to slash spending when the market crashed, and they lost the ability to issue expensive new shares.</p>\n\n<p>TLDR</p>\n\n<p>-Yes, there are bubbles of story stocks like TSLA now. But they are not funded by bank loans. They may burst, but they will not bring the whole market with them, like the housing bubble of the 2000s that were irresponsibly financed by banks.</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/stocks/comments/ll0bwn/interesting_article_from_wsj_if_tsla_bubble/",
  "subreddit": "stocks",
  "id": "ll0bwn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624089
}