{
  "author": "Geddy87",
  "original_created_utc": 1635559722,
  "title": "My portfolio has hit its ath and I don’t know what to do",
  "created_utc": 1635582979,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t have a huge portfolio by any means , but it’s recently hit its most prob green zone. I have been slowly adding to it over the last 2 years in a very modest way, I took some small profits to pay some bills ; but I have mostly held . </p>\n\n<p>I’m not sure what to do now , the hold has paid off to this point, but the alt coins I have are bound to drop in any bear market , I want to take gains before they drop, but I don’t want to miss more gains that may happen. </p>\n\n<p>Holding crypto is so incredibly stressful, it’s lucrative; I don’t want to be greedy but these investments give me hope and I invested for my future. </p>\n\n<p>Gains to selling is such a fine line of what if and it’s not somthing the whales will ever have to deal with.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/qirqwh/my_portfolio_has_hit_its_ath_and_i_dont_know_what/",
  "subreddit": "CryptoCurrency",
  "id": "qirqwh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don’t have a huge portfolio by any means , but it’s recently hit its most prob\ngreen zone. I have been slowly adding to it over the last 2 years in a very\nmodest way, I took some small profits to pay some bills ; but I have mostly held\n.\n\nI’m not sure what to do now , the hold has paid off to this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は決して大きなポートフォリオを持っているわけではありませんが、最近、最も確率の高いグリーンゾーンに突入しました。\nグリーンゾーンに達しています。私は過去2年間、非常にささやかな方法でゆっくりとポートフォリオを増やしてきました。\n請求書を支払うためにいくつかの小さな利益を得ましたが、ほとんどは保有しています。\n.\n\n今はどうしたらいいのかわかりませんが、ホールドが功を奏して今に至っています...。",
      "title": "自分のポートフォリオが限界に達していて、どうしたらいいかわからない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我没有一个巨大的投资组合，但它最近达到了最可能的绿色区域。\n绿色区域。在过去的两年里，我一直在以非常温和的方式慢慢增加它。\n我获取了一些小的利润来支付一些账单；但我大部分时间都在持有\n.\n\n我不知道现在该怎么做，持股到现在已经得到了回报......",
      "title": "我的投资组合已经达到了极限，我不知道该怎么做"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我沒有一個巨大的投資組合，但它最近達到了最可能的綠色區域。\n綠色區域。在過去的兩年裏，我一直在以非常溫和的方式慢慢增加它。\n我獲取了一些小的利潤來支付一些賬單；但我大部分時間都在持有\n.\n\n我不知道現在該怎麼做，持股到現在已經得到了回報......",
      "title": "我的投資組合已經達到了極限，我不知道該怎麼做"
    }
  ]
}