{
  "author": "Brownhombre84",
  "original_created_utc": 1637117279,
  "title": "I feel like Facebook’s Meta is another step towards a world like 1984’s Big Brother, and it’s anti crypto.",
  "created_utc": 1637148663,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Am I paranoid? The couldn’t stave off the creepy, stomach dropping into my feet feeling when the Zuck announced the change. I don’t think this is good for the world and humanity at large. The amount of tracking and the data mining is already at an uncomfortable level. Adding this to the mix is just too far IMO. Zuck promises privacy and safety but I don&#39;t believe him. It&#39;s all too centralized, too invasive, too calculated. </p>\n\n<p>I love crypto because of the decentralization, the freedom and openness of the projects. Sure some are close doored, but the majority are transparent.</p>\n\n<p>I’ve read a lot of your posts about Meta and each one makes me more sick. Deleting FB and IG from my phone and asking them to scrub the data from my profiles. They probably won’t do it, but I’m going to try.</p>\n</div><!-- SC_ON -->",
  "score": 248,
  "permalink": "/r/CryptoCurrency/comments/qvp3mv/i_feel_like_facebooks_meta_is_another_step/",
  "subreddit": "CryptoCurrency",
  "id": "qvp3mv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Am I paranoid? The couldn’t stave off the creepy, stomach dropping into my feet\nfeeling when the Zuck announced the change. I don’t think this is good for the\nworld and humanity at large. The amount of tracking and the data mining is\nalready at an uncomfortable level. Adding this to the mix is just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の被害妄想でしょうか？Zuckが変更を発表したときには、胃の中に落ちるような気味の悪さを感じました。\nザックがこの変更を発表したときの気持ち悪さを抑えることができませんでした。これが世の中のため、人類のためになるとは思えません。\n世の中のため、人類のためにならないと思います。トラッキングやデータマイニングの量は\nすでに不快なレベルに達しています。それに加えてこのようなことをするのは...。",
      "title": "FacebookのMetaは、1984年のビッグブラザーのような世界へのもう一歩であり、アンチ暗号だと感じています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有妄想症吗？我无法避免当Zuck通知我的时候，那种令人毛骨悚然的、胃部坠落到脚底的感觉。\n当Zuck宣布这一变化时，我无法避免令人毛骨悚然的感觉。我认为这对世界和整个人类都没有好处。\n世界和整个人类都有好处。追踪和数据挖掘的数量\n已经达到了令人不舒服的程度。再加上这一点，简直是...",
      "title": "我觉得Facebook的Meta是向1984年的老大哥那样的世界迈出的又一步，它是反加密货币的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有妄想症嗎？我無法避免當Zuck通知我的時候，那種令人毛骨悚然的、胃部墜落到腳底的感覺。\n當Zuck宣佈這一變化時，我無法避免令人毛骨悚然的感覺。我認爲這對世界和整個人類都沒有好處。\n世界和整個人類都有好處。追蹤和數據挖掘的數量\n已經達到了令人不舒服的程度。再加上這一點，簡直是...",
      "title": "我覺得Facebook的Meta是向1984年的老大哥那樣的世界邁出的又一步，它是反加密貨幣的。"
    }
  ]
}