{
  "author": "LargeSnorlax",
  "original_created_utc": 1629905330,
  "title": "A lot of people are hoping Cryptocurrency will \"kill\" banks. Banks are never going away. What you should be hoping for is Cryptocurrency to change how banks operate.",
  "created_utc": 1629920051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yes, it&#39;s the cypherpunk dream - To be part of a financial revolution that topples the current financial system, leading to the overthrow of your overlords, and the rise of an entirely decentralized financial system.</p>\n\n<p>Unfortunately like some dreams, that needs a dose of cold water - It&#39;s never going to happen. </p>\n\n<p>Banks in some form have been around since the earliest merchants in history. They evolved into the religious ruling class and eventually into the privately owned and government subsidized businesses you see today.</p>\n\n<p>And they&#39;re doing awesome. Every year is a record profit, paid for by <strong>your money</strong>.</p>\n\n<ul>\n<li><p><a href=\"https://www.cbc.ca/news/business/royal-bank-earnings-1.6152479\">https://www.cbc.ca/news/business/royal-bank-earnings-1.6152479</a> </p></li>\n<li><p><a href=\"https://www.newswire.ca/news-releases/national-bank-reports-its-results-for-the-third-quarter-of-2021-838928765.html\">https://www.newswire.ca/news-releases/national-bank-reports-its-results-for-the-third-quarter-of-2021-838928765.html</a></p></li>\n<li><p><a href=\"https://www.reuters.com/business/bank-nova-scotia-beats-profit-estimates-third-quarter-2021-08-24/\">https://www.reuters.com/business/bank-nova-scotia-beats-profit-estimates-third-quarter-2021-08-24/</a> </p></li>\n</ul>\n\n<p>Banks in Canada are kicking ass. After all, why wouldn&#39;t they? They have all the funds in the world (Yours) to play with. Everyone who isn&#39;t a crypto nerd like us has money in a bank somewhere, and it is earning banks mindboggling record blowing profits quarter after quarter. Monopolies on people&#39;s money is great - If you&#39;re a bank.</p>\n\n<p>So, this is where Crypto comes in. Giving people an alternative revenue stream, a choice. Somewhere else to put your money, and if you&#39;re smart and savvy, a way to <em>permanently manage your money by yourself</em>.</p>\n\n<p>Banks <em>hate</em> this. Why wouldn&#39;t they? It directly impacts their business, influences their massive monopoly, and hurts their profit margins.</p>\n\n<p>The real power of Cryptocurrency and decentralized finance is <em>not to tear down the traditional banking structure</em>.</p>\n\n<p>It is to <strong>force banks and traditional financial systems to adapt and become competitive with a changing market</strong>.</p>\n\n<p>Every time you see a bank, credit union, or big name that previously &quot;hated&quot; Bitcoin offering it to their clients, know that you&#39;re a part of that change. When wire transfer amounts go down, you&#39;re part of that change. When you notice banks changing their fee structures, or interest rates, you&#39;re part of that change. </p>\n\n<p>You&#39;re helping banks move out of the dark ages, breaking down a monopoly, and gaining not only financial freedom, but financial wisdom too, which is way more important.</p>\n\n<p>Don&#39;t worry about the banks. They&#39;re going to be there, doing their thing. There are always going to be people who need a bank, whether it is trust, reliance, or just fear of things going wrong. That&#39;s fine.</p>\n\n<p>Every time you take money out of your bank to invest in crypto, you&#39;re making people in the financial system think - <em>&quot;Why isn&#39;t this money staying with us, and what can we do to keep it?&quot;</em> No matter what, this benefits us all.</p>\n\n<p>A competitive and evolving financial system benefits us all.  Don&#39;t worry about the banks, build your own future. They&#39;ll follow suit.</p>\n</div><!-- SC_ON -->",
  "score": 496,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/TpRmgF5XpVxcs-lSgj5XCgURoTpuiPE9EyURhYRvvKY.jpg?auto=webp&s=e989d40505367b16ee896c479931b8f7deeefc99",
          "width": 620,
          "height": 349
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/TpRmgF5XpVxcs-lSgj5XCgURoTpuiPE9EyURhYRvvKY.jpg?width=108&crop=smart&auto=webp&s=c18903ab8a87a788424ade934722f3ef5d81359e",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/TpRmgF5XpVxcs-lSgj5XCgURoTpuiPE9EyURhYRvvKY.jpg?width=216&crop=smart&auto=webp&s=f5356616658ef09e57b1d6b1dcd3300488763a18",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/TpRmgF5XpVxcs-lSgj5XCgURoTpuiPE9EyURhYRvvKY.jpg?width=320&crop=smart&auto=webp&s=d0cf15479c5219f5f0d0ed1c2cba514636d45049",
            "width": 320,
            "height": 180
          }
        ],
        "variants": {},
        "id": "CX_BcgPi59Hk0ADZt-0q_qN7HImVViZYKFTUXW-Uslg"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/pbdkvr/a_lot_of_people_are_hoping_cryptocurrency_will/",
  "subreddit": "CryptoCurrency",
  "id": "pbdkvr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yes, it's the cypherpunk dream - To be part of a financial revolution that\ntopples the current financial system, leading to the overthrow of your\noverlords, and the rise of an entirely decentralized financial system.\n\nUnfortunately like some dreams, that needs a dose of cold water - It's never\ngoing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう、それはサイファーパンクの夢なのだ。\n現在の金融システムを崩壊させ、君たちの支配者を倒して\n現在の金融システムを崩壊させ、君たちの支配者を倒し、完全に分散化された金融システムを立ち上げる金融革命の一員になることだ。\n\n残念ながら、いくつかの夢のように、それは冷や水を浴びる必要があります。\nそれは...",
      "title": "多くの人が、暗号通貨が銀行を「殺す」ことを期待しています。銀行がなくなることはありません。あなたが期待すべきことは、暗号通貨が銀行の運営方法を変えることです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，这就是赛博朋克的梦想--成为金融革命的一部分，推翻当前的金融体系。\n成为金融革命的一部分，推翻当前的金融体系，从而推翻你的\n导致推翻你的霸主，以及一个完全去中心化的金融系统的崛起。\n\n不幸的是，像一些梦想一样，这需要一剂冷水--它永远不会\n会...",
      "title": "很多人都希望加密货币能 \"杀死 \"银行。银行是永远不会消失的。你应该希望的是加密货币能改变银行的运作方式。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，這就是賽博朋克的夢想--成爲金融革命的一部分，推翻當前的金融體系。\n成爲金融革命的一部分，推翻當前的金融體系，從而推翻你的\n導致推翻你的霸主，以及一個完全去中心化的金融系統的崛起。\n\n不幸的是，像一些夢想一樣，這需要一劑冷水--它永遠不會\n會...",
      "title": "很多人都希望加密貨幣能 \"殺死 \"銀行。銀行是永遠不會消失的。你應該希望的是加密貨幣能改變銀行的運作方式。"
    }
  ]
}