{
  "author": "Major_Bandicoot_3239",
  "original_created_utc": 1635379664,
  "title": "No Sell November",
  "created_utc": 1635406595,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You&#39;ve probably heard of No Shave November or No Nut November, well... this is the Crypto version: No Sell November.</p>\n\n<p>That&#39;s right people, I am proposing a full month of only holding and buying.  No Selling Allowed!  If you&#39;re up for the challenge, it&#39;s pretty simple. Just don&#39;t hit that damn sell button.  Market tanking? don&#39;t you even think about it.  Market surging, don&#39;t even think about it.  Just sit back, hold, and relax.  If you&#39;re feeling crazy, throw a few buy orders in or continue your normal DCA.</p>\n\n<p>This isn&#39;t meant to pump the market and I have no delusions that this will.  This is just a fun way to celebrate our love for Crypto and come together as a community. Could cause a supply shock if enough people really participate in this but that&#39;s not the point. If we want to stop shaving and hold off from you know what, you can do that too.</p>\n\n<p>No Sell November, folks. It&#39;s now a thing!</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/Bitcoin/comments/qha8f4/no_sell_november/",
  "subreddit": "Bitcoin",
  "id": "qha8f4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You've probably heard of No Shave November or No Nut November, well... this is\nthe Crypto version: No Sell November.\n\nThat's right people, I am proposing a full month of only holding and buying. No\nSelling Allowed! If you're up for the challenge, it's pretty simple. Just don't\nhit that damn sell…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "No Shave November」や「No Nut November」という言葉を聞いたことがあると思いますが、これはその暗号版です。\n暗号バージョンです。No Sell November」です。\n\nその通り、皆さん、私は1ヶ月間、保有と購入のみを行うことを提案します。そうです。\n売ることはできません! もしあなたがこのチャレンジに参加するなら、それはとても簡単なことです。ただ\n売ってはいけない...",
      "title": "No Sell November"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可能听说过 \"不刮胡子十一月 \"或 \"不吃坚果十一月\"，那么......这就是\n秘密版本。11月不卖。\n\n这是正确的，我建议整整一个月只持有和购买。不\n允许卖出! 如果你愿意接受挑战，这很简单。只要不\n敲那该死的卖出...",
      "title": "11月不卖"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能聽說過 \"不刮鬍子十一月 \"或 \"不喫堅果十一月\"，那麼......這就是\n祕密版本。11月不賣。\n\n這是正確的，我建議整整一個月只持有和購買。不\n允許賣出! 如果你願意接受挑戰，這很簡單。只要不\n敲那該死的賣出...",
      "title": "11月不賣"
    }
  ]
}