{
  "author": "noticky",
  "the_new_excerpt": "Sign the petition here: https://www.change.org/sec-amend-13-f\n\nRetail Investors demand more visibility into institutional trading and\nborrowing. Anyone investing over 1 billion dollars (i.e. hedge funds and other\ninvestment institutions) is required to disclose their holdings to promote\ntransparency…",
  "original_created_utc": 1611900378,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在这里签署请愿书：https://www.change.org/sec-amend-13-f\n\n散户投资者要求提高机构交易的可见度和\n借款。凡是投资超过10亿美元（即对冲基金和其他。\n投资机构）必须披露其持股情况，以促进其发展。\n透明度...",
      "title": "签署请愿书。散户要求市场透明化！让对冲基金报告他们的短线!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這裏簽署請願書：https://www.change.org/sec-amend-13-f\n\n散戶投資者要求提高機構交易的可見度和\n借款。凡是投資超過10億美元（即對沖基金和其他。\n投資機構）必須披露其持股情況，以促進其發展。\n透明度...",
      "title": "簽署請願書。散戶要求市場透明化！讓對沖基金報告他們的短線!"
    }
  ],
  "title": "Sign The Petition: Retail Investors Demand Market Transparency! Make the Hedge Funds report their Shorts!",
  "created_utc": 1611905359,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Sign the petition here: <a href=\"https://www.change.org/sec-amend-13-f\">https://www.change.org/sec-amend-13-f</a></strong></p>\n\n<p>Retail Investors demand more visibility into institutional trading and borrowing. Anyone investing over 1 billion dollars (i.e. hedge funds and other investment institutions) is required to disclose their holdings to promote transparency in our markets - it&#39;s called Form 13-F. <strong>But did you know that they only need to disclose it 4 times a year? And did you know its published with a 1 month delay? And did you know that they don&#39;t need to disclose all of their positions?</strong></p>\n\n<p>We the people are asking for a re-evaluation of transparency requirements for Institutional Investors. We have access to technology and data that gives us new sophistication - and are beginning to understand there is a tremendous disparity in access between retail and institutional investors, and are concerned that this access is being used against us, in ways that we genuinely worry could be in flagrant violation of Securities Laws. We believe that with better access to institutional trading data, retail investors can better participate in the market when making buying and selling decisions.</p>\n\n<p><strong>According to Form 13F (<a href=\"https://www.sec.gov/files/form13f.pdf\">https://www.sec.gov/files/form13f.pdf</a>), Institutional Investors only need to disclose their positions 4 times a year. Why?</strong></p>\n\n<p><em>Filing of Form 13F. A Manager must file a Form 13F report with the Commission within 45 days after the end of each calendar year and each of the first three calendar quarters of each calendar year. As required by Section 13(f)(5) of the Exchange Act, a Manager which is a bank, the deposits of which are insured in accordance with the Federal Deposit Insurance Act, must file with the appropriate regulatory agency for the bank a copy of every Form 13F report filed with the Commission pursuant to this subsection by or with respect to such bank. Filers who file Form 13F electronically can satisfy their obligation to file with other regulatory agencies by sending (a) a paper copy of the EDGAR filing (provided the Manager removes or blanks out the confidential access codes); (b) the filing in electronic format, if the regulatory agency with which the filing is being made has made provisions to receive filings in electronic format;</em></p>\n\n<p><strong>In your FAQ (<a href=\"https://www.sec.gov/divisions/investment/13ffaq.htm\">https://www.sec.gov/divisions/investment/13ffaq.htm</a>), it is clear Institutional Investors are not required to disclose short positions. Why?</strong></p>\n\n<p><em>Question 41\nQ: What about short positions?\nA: You should not include short positions on Form 13F. You also should not subtract your short position(s) in a security from your long position(s) in that same security; report only the long position.</em></p>\n\n<p><strong>Contact the SEC and let them know retail investors demand increased transparency (<a href=\"https://www.sec.gov/contact-information/sec-directory\">https://www.sec.gov/contact-information/sec-directory</a>)</strong></p>\n</div><!-- SC_ON -->",
  "score": 17001,
  "permalink": "/r/stocks/comments/l7l2xj/sign_the_petition_retail_investors_demand_market/",
  "subreddit": "stocks",
  "id": "l7l2xj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537960
}