{
  "author": "LifeisDankiThink",
  "the_new_excerpt": "They may try to sell themselves as the network for financial news. This is all a\nload of dog shit. You’re the product and a lot of the time they’re biased for\ntheir own self agenda.\n\nTake EVERYTHING you hear or read from them with a grain of salt, in fact ALWAYS\nlook at the other side of what…",
  "original_created_utc": 1612604391,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "他们可能会试图推销自己是财经新闻的网络。这都是一个\n负载的狗屁。你是产品，而很多时候他们偏偏是为了\n他们自己的自我议程。\n\n你从他们那里听到或读到的每一件事都要小心翼翼，事实上，永远都要小心翼翼。\n顾左右而言他",
      "title": "CNBC不是你的朋友，他们想从你身上赚钱"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他們可能會試圖推銷自己是財經新聞的網絡。這都是一個\n負載的狗屁。你是產品，而很多時候他們偏偏是爲了\n他們自己的自我議程。\n\n你從他們那裏聽到或讀到的每一件事都要小心翼翼，事實上，永遠都要小心翼翼。\n顧左右而言他",
      "title": "CNBC不是你的朋友，他們想從你身上賺錢"
    }
  ],
  "title": "CNBC are not your friends, they’re trying to profit off of you",
  "created_utc": 1612646959,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>They may try to sell themselves as the network for financial news. This is all a load of dog shit. You’re the product and a lot of the time they’re biased for their own self agenda.</p>\n\n<p>Take EVERYTHING you hear or read from them with a grain of salt, in fact ALWAYS look at the other side of what they’re spewing.</p>\n\n<p>The scripted conversations they have between one another is all to make you take their side and view. They’re imbedded with institutions that are profiting off of retail investors. They’re sneaky fucks and it’s about time we all start boycotting whatever the fuck they have to say. The manipulation has to stop.</p>\n\n<p>This whole GameStop situation just proved the narrative, it’s sad to think how many of their paying customers or viewers have been financially fucked over for their own gain.</p>\n\n<p>TLDR: FUCK CNBC.</p>\n</div><!-- SC_ON -->",
  "score": 3520,
  "permalink": "/r/wallstreetbets/comments/ldu16u/cnbc_are_not_your_friends_theyre_trying_to_profit/",
  "subreddit": "wallstreetbets",
  "id": "ldu16u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123213445
}