{
  "author": "AdamFeigs",
  "the_new_excerpt": "One of the most frequent topics here and everywhere the market is discussed, is\nexit strategy. Everyone seems to have one (whether it works or not) and frankly\nI have no idea how they're doing it. So either I just have a glaring weakness or\nmost people are full of shit.\n\nIn any case, I like to…",
  "original_created_utc": 1613398247,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在这里和各地市场讨论最频繁的话题之一，就是......。\n退出策略。每个人似乎都有一个(不管是否有效)，坦率地说。\n我不知道他们是怎么做到的。所以，要么我只是有一个明显的弱点，或\n大多数人都是充满了狗屎。\n\n在任何情况下，我喜欢... ...",
      "title": "究竟如何制定退出策略？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在這裏和各地市場討論最頻繁的話題之一，就是......。\n退出策略。每個人似乎都有一個(不管是否有效)，坦率地說。\n我不知道他們是怎麼做到的。所以，要麼我只是有一個明顯的弱點，或\n大多數人都是充滿了狗屎。\n\n在任何情況下，我喜歡... ...",
      "title": "究竟如何制定退出策略？"
    }
  ],
  "title": "How do you actually come up with an exit strategy?",
  "created_utc": 1613422355,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One of the most frequent topics here and everywhere the market is discussed, is exit strategy.  Everyone seems to have one (whether it works or not) and frankly I have no idea how they&#39;re doing it.  So either I just have a glaring weakness or most people are full of shit.  </p>\n\n<p>In any case, I like to invest in stocks for the long term.  My shortest holds are at least a few years, and my longest holds are for decades.  I&#39;m not a trader and dont plan on being one and I just buy stocks that I like.  My only real insight about what to buy is based on things I have some familiarity with, or an industry with plenty of upside and potential.</p>\n\n<p>So that being said, I have no mathematical formula to determine an exit point.  I have no market cap to signal an exit and because my investments are for the very long term I really don&#39;t have any plan as to when I&#39;m out.  </p>\n\n<p>So how the hell do you guys make these determinations?</p>\n</div><!-- SC_ON -->",
  "score": 68,
  "permalink": "/r/stocks/comments/lkeepc/how_do_you_actually_come_up_with_an_exit_strategy/",
  "subreddit": "stocks",
  "id": "lkeepc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624076
}