{
  "author": "blorg",
  "the_new_excerpt": "> This conventional wisdom pervades much of the financial industry. As the old\n> saying goes, “it’s never wrong to take a profit”. A client is unlikely to be\n> unhappy or indeed notice if you sell a stock that subsequently goes up\n> significantly. The loss of foregone upside is not captured in…",
  "original_created_utc": 1614594707,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": ">这种传统的智慧在金融业的很多地方都很普遍。正如老\n> 俗话说：\"获利是不会错的\"。客户不太可能\n> 不高兴或确实注意到，如果你卖出的股票，随后上涨。\n> 显著。前期上涨的损失没有体现在...",
      "title": "为什么投资者获利通常是错误的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": ">這種傳統的智慧在金融業的很多地方都很普遍。正如老\n> 俗話說：\"獲利是不會錯的\"。客戶不太可能\n> 不高興或確實注意到，如果你賣出的股票，隨後上漲。\n> 顯著。前期上漲的損失沒有體現在...",
      "title": "爲什麼投資者獲利通常是錯誤的？"
    }
  ],
  "title": "Why it is usually a mistake for investors to take profits",
  "created_utc": 1614655520,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>This conventional wisdom pervades much of the financial industry. As the old saying goes, “it’s never wrong to take a profit”. A client is unlikely to be unhappy or indeed notice if you sell a stock that subsequently goes up significantly. The loss of foregone upside is not captured in performance data. Perhaps it should be.</p>\n\n<p>On the other hand, if an investment manager continues to hold the stock in question and its price starts to fall, the drop will be clearly visible in performance data. The manager should expect to be asked, if not chastised, about it. That is why, from the investment manager’s point of view, it is never wrong to take a profit.</p>\n\n<p>What about the client? For the client, equity investing is asymmetric — the upside of not selling is nearly unlimited, while the downside is naturally capped. For the client it can be very wrong to take a profit. Sadly, too few fund managers try to get investment right for investors. Most conventions and practices exist to serve, protect and enrich investment managers’ interests.</p>\n\n<p>In fact, it is often not just wrong to take a profit, but it can be the worst possible mistake. [...]</p>\n\n<p>In 1999, Goldman Sachs invested in Chinese ecommerce company Alibaba. Shirley Lin, who worked for its private equity fund, has said she was offered the chance to invest $5m for a 50 per cent stake. Unfortunately, she said her colleagues deemed $5m too risky and so they opted for investing a “safer” $3m.</p>\n\n<p>Five years later their stake was worth $22m, a seven-fold return. At this point, the decision was taken to sell. In many ways this was a remarkably successful investment until, that is, you realise that today those shares would be worth more than $200bn. That investment alone, if held, would have been worth nearly double the value of the whole of Goldman Sachs today.</p>\n</blockquote>\n\n<p><a href=\"https://www.ft.com/content/f8f8b067-e663-4afe-90dd-6a243929af86\">https://www.ft.com/content/f8f8b067-e663-4afe-90dd-6a243929af86</a><br/>\n<a href=\"https://archive.is/rBE12\">https://archive.is/rBE12</a></p>\n</div><!-- SC_ON -->",
  "score": 86,
  "permalink": "/r/investing/comments/lv5wlm/why_it_is_usually_a_mistake_for_investors_to_take/",
  "subreddit": "investing",
  "id": "lv5wlm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740757
}