{
  "author": "JotakuTM",
  "original_created_utc": 1634217665,
  "title": "I'm building a Chrome extension that finds out what font is being used on a website",
  "created_utc": 1634228919,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey there, the names Jojo Duke.</p>\n\n<p>So basically, as a web developer, anytime I&#39;d surf the web, go to a website, product landing page, or the like I always realized that most websites use the most beautiful and unique fonts for their web designs, and a lot of times I always wondered what font/typeface that is.</p>\n\n<p>So I decided to use that opportunity to build out my first side-project; <a href=\"https://fontsnatcher-landing-page.vercel.app/\">Fontsnatcher</a></p>\n\n<p>Fontsnatcher is a Chrome extension that allows you to discover and &quot;snatch&quot; the fonts being used on websites and landing pages. A user simply turns on the extension, hovers over a text element on a page, and clicks it to get all the information about it and save that info for later use.</p>\n\n<p>This can especially help developers, designers, and typographers when they want to get creative or simply when they&#39;re curious about a certain font.</p>\n\n<p>The actual Chrome extension is in development right now, so I&#39;m posting the landing page here to see if I can get any feedback on the product.</p>\n\n<p><a href=\"https://fontsnatcher-landing-page.vercel.app/\">https://fontsnatcher-landing-page.vercel.app/</a></p>\n\n<p>Please feel free to check out the landing page and comment below, Thanks~</p>\n</div><!-- SC_ON -->",
  "score": 8,
  "permalink": "/r/SideProject/comments/q7zlaj/im_building_a_chrome_extension_that_finds_out/",
  "subreddit": "SideProject",
  "id": "q7zlaj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey there, the names Jojo Duke.\n\nSo basically, as a web developer, anytime I'd surf the web, go to a website,\nproduct landing page, or the like I always realized that most websites use the\nmost beautiful and unique fonts for their web designs, and a lot of times I\nalways wondered what font/typeface…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、ジョジョ・デュークと申します。\n\n基本的には、ウェブ開発者として、ウェブを閲覧したり、ウェブサイトや製品のランディングページにアクセスしたりするときにはいつも、ほとんどのウェブサイトでは、製品のランディングページを使用しています。\nWebサイトや製品のランディングページなどを見ていると、ほとんどのWebサイトが最も美しくユニークなフォントを使っていることに気づきます。\nそして、多くの場合、どんなフォントが使われているのだろうと思っていました。\nどんなフォントが使われているんだろう？",
      "title": "Webサイトで使用されているフォントを検索するChrome拡張機能を作っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，我叫乔乔-杜克。\n\n因此，基本上，作为一个网络开发人员，无论何时我都会上网，进入一个网站。\n产品登陆页面，或类似的，我总是意识到，大多数网站使用的是\n最漂亮和独特的字体来设计网页，而很多时候，我总是想知道什么是字体/类型。\n很多时候，我总是想知道什么字体/字样...",
      "title": "我正在开发一个Chrome扩展，可以找出网站上使用的字体。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，我叫喬喬-杜克。\n\n因此，基本上，作爲一個網絡開發人員，無論何時我都會上網，進入一個網站。\n產品登陸頁面，或類似的，我總是意識到，大多數網站使用的是\n最漂亮和獨特的字體來設計網頁，而很多時候，我總是想知道什麼是字體/類型。\n很多時候，我總是想知道什麼字體/字樣...",
      "title": "我正在開發一個Chrome擴展，可以找出網站上使用的字體。"
    }
  ]
}