{
  "author": "nitrolimitz",
  "original_created_utc": 1646062661,
  "title": "Is the Era of Dogecoin over?",
  "created_utc": 1646097441,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been watching Dogecoin for quite a while now, it&amp;#39;s what brought me into crypto (a little over an year ago!).&lt;/p&gt;\n\n&lt;p&gt;Anyways, ever since the grand slam dump of a fall from what was an astonishing number for a coin like doge, It has been in a constant downtrend ever since. Now currently at $0.122 from it&amp;#39;s ath of $0.68, thats a fall of nearly 70%!&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/kadgk0cpelk81.png?width=891&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=15f4b2d6d0c637c624ea0a2c22859b6dea2952b7\"&gt;Consistent downtrend (1D chart)&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There have been minor jumps and pumps along the way, but after every single jump, there&amp;#39;s a even bigger dump. The gap between pumps have been becoming higher and higher, and the duration of the pump has shown to be shortening over time.&lt;/p&gt;\n\n&lt;p&gt;Is it safe to say the era of not memecoins, but dogecoin in reference is over? I honestly don&amp;#39;t think Elon or anyone for that matter would be able to bring back the hype of dogecoin as it was back in May. I personally know many people who bought at the top and still hold for the &amp;quot;$1 dogecoin!&amp;quot; line. &lt;/p&gt;\n\n&lt;p&gt;I although did hold through .07 and saw my investment hit the multi-thousands. I didn&amp;#39;t sell because of that line, my knowledge in cryptocurrency tokenomics has a huge role in my decision making. I&amp;#39;m still baffled that Dogecoin managed to pull off being in Top 3 cryptocurrencies, when you look at it now. That&amp;#39;s crazy!&lt;/p&gt;\n\n&lt;p&gt;Anyways, just wanted to discuss my thoughts. What do you think? I don&amp;#39;t think doge will ever go back up aside from the little pumps it may have, definitely not close to where it was at it&amp;#39;s highest.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 352,
  "permalink": "/r/CryptoCurrency/comments/t3icby/is_the_era_of_dogecoin_over/",
  "subreddit": "CryptoCurrency",
  "id": "t3icby",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been watching Dogecoin for quite a while now, it's what brought me into\ncrypto (a little over an year ago!).\n\nAnyways, ever since the grand slam dump of a fall from what was an astonishing\nnumber for a coin like doge, It has been in a constant downtrend ever since. Now\ncurrently at $0.122 from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Dogecoinは、私がDogecoinの世界に入るきっかけとなったもので、かなり前から見ています。\nクリプト（1年ちょっと前！）。\n\nとにかく、驚異的だったものからグランドスラムのような暴落をして以来\nそれ以来、ドージは常に下降トレンドにあります。現在\n現在0.122ドル...",
      "title": "Dogecoinの時代は終わったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我关注Dogecoin已经有一段时间了，是它把我带入了\n它把我带入加密货币领域（一年多以前！）。\n\n不管怎么说，自从大满贯下跌以来，从一个令人惊讶的\n币后，它就一直处于持续的下跌趋势中。现在\n目前在0.122美元，从...",
      "title": "狗币的时代结束了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我關注Dogecoin已經有一段時間了，是它把我帶入了\n它把我帶入加密貨幣領域（一年多以前！）。\n\n不管怎麼說，自從大滿貫下跌以來，從一個令人驚訝的\n幣後，它就一直處於持續的下跌趨勢中。現在\n目前在0.122美元，從...",
      "title": "狗幣的時代結束了嗎？"
    }
  ]
}