{
  "author": "Creepy-Nectarine-225",
  "original_created_utc": 1633645918,
  "title": "This guy at my record store",
  "created_utc": 1633685873,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’m the owner at a local record shop and yesterday this guy came in causing a ruckus. He smelt like a bowl of ramen and wouldn’t stop talking about how crypto is the future. </p>\n\n<p>When it was time for him to checkout, he was waiving his “coinbase debit card” around but in fact it was an expired library card covered in cocaine residue. When I told him that’s not a form of payment, he proceeded to point out the “Visa logo” which was the logo of the library the card was for.  </p>\n\n<p>After politely asking for a different form of payment he finally pulled out a real Visa card while mumbling, “The only reason I’m not taking my business elsewhere is because this record is underpriced, I can sell it for 10x as much!” </p>\n\n<p>On his way out he stumbled into the door and yelled, “I want my 4% cash back, Stellar to the mooooon!” </p>\n\n<p>Hopefully all of you crypto people aren’t this obnoxious, have a good day!</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/q3kdes/this_guy_at_my_record_store/",
  "subreddit": "CryptoCurrency",
  "id": "q3kdes",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I’m the owner at a local record shop and yesterday this guy came in causing a\nruckus. He smelt like a bowl of ramen and wouldn’t stop talking about how crypto\nis the future.\n\nWhen it was time for him to checkout, he was waiving his “coinbase debit card”\naround but in fact it was an expired…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は地元のレコード店のオーナーですが、昨日、ある男性が来店して、その男性が「何かあったのか？\n騒いでいたんだ。ラーメンのような匂いがして、「暗号は未来だ」という話をやめようとしなかった。\nの話をやめようとしなかった。\n\n会計時には「coinbase debit card」を振り回していましたが、実際には期限切れのカードでした。\nを振り回していましたが、実はそれは期限切れの...。",
      "title": "私のレコード店のこの人"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是当地一家唱片店的老板，昨天有个人进来引起了一阵骚动。\n喧闹。他闻起来像一碗拉面，并不停地谈论加密货币是如何\n是未来。\n\n当他要结账的时候，他挥舞着他的 \"coinbase借记卡\"\n但实际上那是一张过期的...",
      "title": "我的唱片店里的这个人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是當地一家唱片店的老闆，昨天有個人進來引起了一陣騷動。\n喧鬧。他聞起來像一碗拉麪，並不停地談論加密貨幣是如何\n是未來。\n\n當他要結賬的時候，他揮舞着他的 \"coinbase借記卡\"\n但實際上那是一張過期的...",
      "title": "我的唱片店裏的這個人"
    }
  ]
}