{
  "author": "Hsiang7",
  "original_created_utc": 1637193966,
  "title": "What's your opinion on buying digital land? Is it a good idea to buy now while it's still relatively cheap?",
  "created_utc": 1637217587,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unlike buying real estate in the real world, buying digital land (in my opinion) is a huge gamble. Buying land in Decentraland costs a few thousand dollars, but there is absolutely no guarantee that Decentraland will be the big digital world that everyone is using in the future. In fact, having experienced the world I am personally of the opinion that Decentraland is nowhere near ready and is not in the position to become that digital world. It&#39;s laggy, I don&#39;t particularly like the art style they went for (reminds me a bit of Minecraft) and there are bugs everywhere. I also don&#39;t have a lot of faith that the team behind it can actually make it that future digital world everyone is using. </p>\n\n<p>That being said, Decentraland is <em>currently</em> really the only viable candidate without much competition. Do you see Decentraland hanging in there and being developed to the point where it could actually become big? Or is it much more likely that a big tech/gaming company comes in and steals the show, making all the Decentraland land essentially worthless? I&#39;d like to hear the thoughts of the people on this sub on the subject.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/qwco16/whats_your_opinion_on_buying_digital_land_is_it_a/",
  "subreddit": "CryptoCurrency",
  "id": "qwco16",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unlike buying real estate in the real world, buying digital land (in my opinion)\nis a huge gamble. Buying land in Decentraland costs a few thousand dollars, but\nthere is absolutely no guarantee that Decentraland will be the big digital world\nthat everyone is using in the future. In fact, having…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現実の世界で不動産を買うのとは違い、デジタルランドを買うのは（私の意見ですが）\nは大きなギャンブルだと思います。Decentralandで土地を買うのは数千ドルの費用がかかりますが\nDecentralandが将来的に誰もが利用する大きなデジタルワールドになるという保証は全くありません。\nしかし、Decentralandが将来的に誰もが利用する大きなデジタル世界になるという保証は全くありません。実際に、持っている...",
      "title": "デジタルランドの購入についてはどう思われますか？比較的安価な今のうちに購入するのが良いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "与在现实世界购买房地产不同，购买数字土地（在我看来）\n是一场巨大的赌博。在Decentraland购买土地只需要几千美元，但是\n绝对不能保证Decentraland会成为未来人人都在使用的大数字世界。\n每个人在未来都在使用。事实上，有...",
      "title": "你对购买数字土地有什么看法？趁着现在还比较便宜，现在买是个好主意吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "與在現實世界購買房地產不同，購買數字土地（在我看來）\n是一場巨大的賭博。在Decentraland購買土地只需要幾千美元，但是\n絕對不能保證Decentraland會成爲未來人人都在使用的大數字世界。\n每個人在未來都在使用。事實上，有...",
      "title": "你對購買數字土地有什麼看法？趁着現在還比較便宜，現在買是個好主意嗎？"
    }
  ]
}