{
  "author": "The420Legend",
  "original_created_utc": 1633636586,
  "title": "Reminder to not FOMO like I just did. Star idiot on the subreddit right here!!!",
  "created_utc": 1633655443,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well against all advice and even the post I saw yesterday saying &quot;Don&#39;t FOMO&quot;. I&#39;ve done exactly the opposite. Am I an idiot? Probably but aren&#39;t we all. I have the classic story just like everybody else. yesterday I was sitting back from my shift at work and saw the SHIB graph greening super high. At this point all I could see was +50% today and so I took the last of my USDC (Around $1500) and went all in on SHIB.</p>\n\n<p>&#x200B;</p>\n\n<p>Should I have saved some for buying opportunities for my other coins like ADA and ETH? Yea but I didn&#39;t and the worst part is I knew it was gonna drop as soon as I bought it. My thought process is &quot;If I buy it, it&#39;ll instantly drop. Maybe I should pretend not to care about the graph and maybe it&#39;ll rise&quot;. I was wrong and you take this as lesson just like I will. I&#39;ll just add it to the other FOMOs pile.</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/q3h7mh/reminder_to_not_fomo_like_i_just_did_star_idiot/",
  "subreddit": "CryptoCurrency",
  "id": "q3h7mh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well against all advice and even the post I saw yesterday saying \"Don't FOMO\".\nI've done exactly the opposite. Am I an idiot? Probably but aren't we all. I\nhave the classic story just like everybody else. yesterday I was sitting back\nfrom my shift at work and saw the SHIB graph greening super high.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アドバイスに反して、そして昨日見た「Don't FOMO」という投稿にも反して。\n私は全く逆のことをしてしまいました。私はバカですか？恐らくですが、私たちは皆そうではないでしょうか。I\n昨日、私は仕事のシフトを終えて座っていました。\nSHIBのグラフが緑になっているのを見ました。スーパーハイ....",
      "title": "私のようにFOMOにならないように注意してください。ここのサブレディットでは、スター級のバカが登場します!!!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，违背所有的建议，甚至我昨天看到的帖子说 \"不要FOMO\"。\n我所做的正好相反。我是个白痴吗？可能是，但我们不都是吗。I\n就像其他人一样，我也有一个经典的故事。\n上完班后，看到SHIB图表变绿了，超级高....。",
      "title": "提醒大家不要像我刚才那样FOMO。明星白痴就在这里的subreddit上！！！。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，違背所有的建議，甚至我昨天看到的帖子說 \"不要FOMO\"。\n我所做的正好相反。我是個白癡嗎？可能是，但我們不都是嗎。I\n就像其他人一樣，我也有一個經典的故事。\n上完班後，看到SHIB圖表變綠了，超級高....。",
      "title": "提醒大家不要像我剛纔那樣FOMO。明星白癡就在這裏的subreddit上！！！。"
    }
  ]
}