{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "For additional insight into why Clements selected these 22 mental pitfalls, his section on this was influenced by [this publication.](https://www.wiley.com/en-us/Behavioral+Finance+and+Wealth+Management%3A+How+to+Build+Investment+Strategies+That+Account+for+Investor+Biases%2C+2nd+Edition-p-9781118182291)\n\nFor those mental mistakes that seem pretty obvious (e.g. lack of self-control), I did not provide elaboration. Where I provided elaboration is an extension of the author's views. None of the views on these biases are my own.\n\n1. **Focusing too much on the short-term.** Even when people have a logical plan to retire 20-30 years from now, they can assign too much weight to current events and the latest political news.\n1. **Lack of self-control.**\n1. **Believing that successful investing is the product of hard work.** Actively putting in work in our investments gives us the illusion of control over our investment results. In reality, this can lead to higher-than-anticipated trading costs and significant undiversified bets.\n1. **Believing the future is predictable.** Hindsight bias can lead us to forget the uncertainty regarding predicting events that have already happened, and sets the stage for ignoring the uncertainty that comes with predicting events in the future.\n1. **Seeing patterns where none exist.** As financial markets move up and down, people tend to extrapolate from recent returns or predict a reversal respectively.\n1. **Hatred of losing.** Studies suggest that distaste for losing is greater than pleasure derived from winning. E.g. To entice us to bet $100 on whether a flipped quarter would land on heads or tails, it would take a prize of $200 or more. This explains why people shy away from stocks despite long-run returns.\n1. **A propensity for selling winners and hanging on to losers.** We refuse to sell our \"losers\" until they rise to our original purchase price (and that may never happen). Meanwhile, while it may be emotionally satisfying to sell our \"winners\" for cash based on gains, it could incur a tax bill and trading costs.\n1. **Overconfidence.** Overestimating our abilities leads us to trade too much and believing we can beat the market average with large, undiversified bets.\n1. **When we win, we take credit. When we lose, we blame everyone but ourselves.**\n1. **Assuming risk tolerance is stable.** Risk tolerance can change and is heavily influenced by the mental mistakes we make in the face of volatility that are detailed above.\n1. **We ascribe special meaning to a specific price.** e.g. Buying a stock at $50 that has fallen to $30 and stays around there. Refusal to sell could be based on ascribing special emotional significance to the $50 price tag.\n1. **Rationalizing bad decisions.** We have the tendency to come up with rational explanations for our mistakes in order to protect the idea that we are good with money.\n1. **We favor familiar investments.** A pharmacist or pharmacologist may favor investing in pharmaceutical companies as a result of this bias, but this bias guides us away from a heavily diversified portfolio. Worth noting that the author thinks \"Invest in what you know\" is a bad investment strategy.\n1. **We place special significance on investments we already own.** Known as the [endowment effect.](https://www.investopedia.com/terms/e/endowment-effect.asp) Could be the product of familiarity with the investment or an emotional sense of commitment tied to the investment.\n1. **A preference for sins of omission vs. sins of commission.** In short, this is a bias against acting that is stronger than a bias against inaction. e.g. Selling an investment that then proceeds to skyrocket in value hurts more than refusing to sell a stock that then proceeds to decrease in value.\n1. **Favoring stories over statistics.** Author points out academic studies that show value stocks ultimately outperform growth stocks. Imagining the growth potential of growth stocks can somehow have more allure than the academic finding that value stocks outperform.\n1. **We make decisions based on more easily recalled information.** E.g. Airplane crashes can make us more fearful of flying because of their notability, even though car accidents cause more deaths.\n1. **We cling to information that confirms what we originally believed.** E.g. Bulls spy reasons for optimism, bears the opposite.\n1. **Believing that there is safety in numbers.** It may feel comforting to invest in something that a lot of other people are investing in, but this could easily lead to investing in overpriced assets.\n1. **Financial decisions are not always purely financial.** We often like to believe that we are buying something purely for utilitarian reasons, but we also buy things because of how they make us feel or to express something about ourselves to others.\n1. **Engaging in mental accounting.** Example 1: We divvy our total assets into mental buckets that operate according to different rules. For example, we could be spend-happy about what's in our checking account, but extremely reluctant about selling our mutual funds. Example 2: Despite a heavily diversified portfolio, we could fret about the performance of individual investments. Example 3: We make a sharp mental distinction between money derived from investment income and money derived from selling our assets.\n1. **We are heavily influenced by how things are framed.** Example: We could be told that X asset has made money 75% of the time over the past 50 years. Or we could be told that X asset has lost money 25% of the time over the past 50 years. They both mean the same thing, but the former characterization just sounds more appealing.",
  "author_fullname": "t2_1ssg1ub4",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Twenty-two mental mistakes in investing identified by behavioral finance researchers. From \"How to Think About Money\" by Jonathan Clements.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_u6lufw",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 1,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 20,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Investment Theory",
  "can_mod_post": false,
  "score": 20,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1650314426,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1650311524,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For additional insight into why Clements selected these 22 mental pitfalls, his section on this was influenced by &lt;a href=\"https://www.wiley.com/en-us/Behavioral+Finance+and+Wealth+Management%3A+How+to+Build+Investment+Strategies+That+Account+for+Investor+Biases%2C+2nd+Edition-p-9781118182291\"&gt;this publication.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;For those mental mistakes that seem pretty obvious (e.g. lack of self-control), I did not provide elaboration. Where I provided elaboration is an extension of the author&amp;#39;s views. None of the views on these biases are my own.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Focusing too much on the short-term.&lt;/strong&gt; Even when people have a logical plan to retire 20-30 years from now, they can assign too much weight to current events and the latest political news.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Lack of self-control.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Believing that successful investing is the product of hard work.&lt;/strong&gt; Actively putting in work in our investments gives us the illusion of control over our investment results. In reality, this can lead to higher-than-anticipated trading costs and significant undiversified bets.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Believing the future is predictable.&lt;/strong&gt; Hindsight bias can lead us to forget the uncertainty regarding predicting events that have already happened, and sets the stage for ignoring the uncertainty that comes with predicting events in the future.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Seeing patterns where none exist.&lt;/strong&gt; As financial markets move up and down, people tend to extrapolate from recent returns or predict a reversal respectively.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hatred of losing.&lt;/strong&gt; Studies suggest that distaste for losing is greater than pleasure derived from winning. E.g. To entice us to bet $100 on whether a flipped quarter would land on heads or tails, it would take a prize of $200 or more. This explains why people shy away from stocks despite long-run returns.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A propensity for selling winners and hanging on to losers.&lt;/strong&gt; We refuse to sell our &amp;quot;losers&amp;quot; until they rise to our original purchase price (and that may never happen). Meanwhile, while it may be emotionally satisfying to sell our &amp;quot;winners&amp;quot; for cash based on gains, it could incur a tax bill and trading costs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Overconfidence.&lt;/strong&gt; Overestimating our abilities leads us to trade too much and believing we can beat the market average with large, undiversified bets.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;When we win, we take credit. When we lose, we blame everyone but ourselves.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Assuming risk tolerance is stable.&lt;/strong&gt; Risk tolerance can change and is heavily influenced by the mental mistakes we make in the face of volatility that are detailed above.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We ascribe special meaning to a specific price.&lt;/strong&gt; e.g. Buying a stock at $50 that has fallen to $30 and stays around there. Refusal to sell could be based on ascribing special emotional significance to the $50 price tag.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Rationalizing bad decisions.&lt;/strong&gt; We have the tendency to come up with rational explanations for our mistakes in order to protect the idea that we are good with money.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We favor familiar investments.&lt;/strong&gt; A pharmacist or pharmacologist may favor investing in pharmaceutical companies as a result of this bias, but this bias guides us away from a heavily diversified portfolio. Worth noting that the author thinks &amp;quot;Invest in what you know&amp;quot; is a bad investment strategy.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We place special significance on investments we already own.&lt;/strong&gt; Known as the &lt;a href=\"https://www.investopedia.com/terms/e/endowment-effect.asp\"&gt;endowment effect.&lt;/a&gt; Could be the product of familiarity with the investment or an emotional sense of commitment tied to the investment.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A preference for sins of omission vs. sins of commission.&lt;/strong&gt; In short, this is a bias against acting that is stronger than a bias against inaction. e.g. Selling an investment that then proceeds to skyrocket in value hurts more than refusing to sell a stock that then proceeds to decrease in value.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Favoring stories over statistics.&lt;/strong&gt; Author points out academic studies that show value stocks ultimately outperform growth stocks. Imagining the growth potential of growth stocks can somehow have more allure than the academic finding that value stocks outperform.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We make decisions based on more easily recalled information.&lt;/strong&gt; E.g. Airplane crashes can make us more fearful of flying because of their notability, even though car accidents cause more deaths.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We cling to information that confirms what we originally believed.&lt;/strong&gt; E.g. Bulls spy reasons for optimism, bears the opposite.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Believing that there is safety in numbers.&lt;/strong&gt; It may feel comforting to invest in something that a lot of other people are investing in, but this could easily lead to investing in overpriced assets.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Financial decisions are not always purely financial.&lt;/strong&gt; We often like to believe that we are buying something purely for utilitarian reasons, but we also buy things because of how they make us feel or to express something about ourselves to others.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Engaging in mental accounting.&lt;/strong&gt; Example 1: We divvy our total assets into mental buckets that operate according to different rules. For example, we could be spend-happy about what&amp;#39;s in our checking account, but extremely reluctant about selling our mutual funds. Example 2: Despite a heavily diversified portfolio, we could fret about the performance of individual investments. Example 3: We make a sharp mental distinction between money derived from investment income and money derived from selling our assets.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We are heavily influenced by how things are framed.&lt;/strong&gt; Example: We could be told that X asset has made money 75% of the time over the past 50 years. Or we could be told that X asset has lost money 25% of the time over the past 50 years. They both mean the same thing, but the former characterization just sounds more appealing.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "039ac088-6c0f-11ec-9e3f-2294c5b4c8da",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ffd635",
  "id": "u6lufw",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "_EthanGrey",
  "discussion_type": null,
  "num_comments": 1,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/u6lufw/twentytwo_mental_mistakes_in_investing_identified/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/u6lufw/twentytwo_mental_mistakes_in_investing_identified/",
  "subreddit_subscribers": 155308,
  "created_utc": 1650325867,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1650311524,
  "the_new_excerpt": "For additional insight into why Clements selected these 22 mental pitfalls, his\nsection on this was influenced by this publication.\n[https://www.wiley.com/en-us/Behavioral+Finance+and+Wealth+Management%3A+How+to+Build+Investment+Strategies+That+Account+for+Investor+Biases%2C+2nd+Edition-p…"
}