{
  "author": "Lunchyyy",
  "original_created_utc": 1652693885,
  "title": "How is a virus like chicken pox able to remain dormant in your body and manifest itself again later in life as Shingles (sometimes even decades later)?",
  "created_utc": 1652702954,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I apologise if my understanding is incorrect, but I&amp;#39;ve watched a few videos on the Immune system and the really basic takeaway I got on how it works is something like:&lt;/p&gt;\n\n&lt;p&gt;Virus detected &amp;gt; Immune system battles virus &amp;gt; Recovery&lt;/p&gt;\n\n&lt;p&gt;From my understanding there is also something involving Memory cells and Helper T cells to help protect you against the same virus/bacteria once you&amp;#39;ve recovered. So why then is something like Chicken pox simply able to recede into our nerves and not be bothered by our Immune system instead of being fully eradicated in the first place?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 173,
  "permalink": "/r/askscience/comments/uqs0zm/how_is_a_virus_like_chicken_pox_able_to_remain/",
  "subreddit": "askscience",
  "id": "uqs0zm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I apologise if my understanding is incorrect, but I've watched a few videos on\nthe Immune system and the really basic takeaway I got on how it works is\nsomething like:\n\nVirus detected > Immune system battles virus > Recovery\n\nFrom my understanding there is also something involving Memory cells and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解が誤っていたら申し訳ないのですが、何度か動画で見たことのある\n免疫システムについてのビデオをいくつか見たのですが、私が得た基本的な考え方は、次のようなものでした。\nのようなものだと思います。\n\nウイルスが検出される > 免疫系がウイルスと戦う > 回復する\n\n私の理解では、記憶細胞が関与するものもあると思いますし...",
      "title": "水ぼうそうのようなウイルスが、どうして体の中で休眠したまま、後年（時には数十年後）帯状疱疹として再び現れるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我的理解不正确，我很抱歉，但我看了一些关于\n免疫系统，我得到的关于它如何工作的真正的基本启示是\n类似的东西。\n\n检测到病毒 > 免疫系统与病毒作战 > 恢复\n\n根据我的理解，还有一些涉及记忆细胞和...",
      "title": "像水痘这样的病毒是如何在你的体内保持休眠状态，并在以后的生活中再次表现为带状疱疹（有时甚至是几十年后）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我的理解不正確，我很抱歉，但我看了一些關於\n免疫系統，我得到的關於它如何工作的真正的基本啓示是\n類似的東西。\n\n檢測到病毒 > 免疫系統與病毒作戰 > 恢復\n\n根據我的理解，還有一些涉及記憶細胞和...",
      "title": "像水痘這樣的病毒是如何在你的體內保持休眠狀態，並在以後的生活中再次表現爲帶狀皰疹（有時甚至是幾十年後）？"
    }
  ]
}