{
  "author": "KawadaShogo",
  "original_created_utc": 1659699257,
  "title": "Ancient Mediterranean piracy was largely wiped out by the Romans in the first century BC. But what about Indian Ocean piracy? With the vast wealth of India, Rome and China crisscrossing the seas from Egypt to Malacca, was piracy a major issue in the region in antiquity?",
  "created_utc": 1659708340,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When piracy in antiquity is discussed, it almost always focuses on the Mediterranean. But there were rich trade routes across the Indian Ocean, with India being a major trading hub, rich in resources of its own while also connecting trade between Rome and China. So it seems natural that with so much wealth being shipped back and forth, piracy would have been a significant problem in the Indian Ocean. Yet I&amp;#39;ve never really seen Indian Ocean piracy mentioned unless it&amp;#39;s in connection to the colonial era or later, as if it suddenly appeared from nowhere in the 16th century. But what about in antiquity? How much of a problem were pirates in the Indian Ocean during the Roman era, and how much did it affect the Rome-India-China trade? Did the Romans have a naval fleet in the Red Sea to combat piracy? What about other countries around the ocean, in India, East Africa, Persia, Arabia, Southeast Asia? Did they have navies strong enough to keep piracy under control?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/wgt59c/ancient_mediterranean_piracy_was_largely_wiped/",
  "subreddit": "AskHistorians",
  "id": "wgt59c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When piracy in antiquity is discussed, it almost always focuses on the\nMediterranean. But there were rich trade routes across the Indian Ocean, with\nIndia being a major trading hub, rich in resources of its own while also\nconnecting trade between Rome and China. So it seems natural that with so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "古代における海賊行為が論じられるとき、ほとんどの場合、その焦点は次のようなものです。\n地中海が中心です。しかし、インド洋には豊かな交易路があり、インドを中心に\nインドが主要な貿易拠点であり、自国の資源を豊富に持ちながら、ローマと中国との貿易を結んでいた。\nローマと中国を結ぶ貿易の中心地であった。そのため、インドとローマを結ぶ交易路が存在するのは自然なことである。",
      "title": "古代地中海の海賊は、紀元前1世紀にローマ帝国によってほぼ一掃された。しかし、インド洋の海賊はどうだろう。インド、ローマ、中国の莫大な富がエジプトからマラッカまで海を横断していたため、古代、この地域で海賊行為は大きな問題だったのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当人们讨论古代的海盗行为时，几乎总是集中在地中海地区。\n地中海地区。但印度洋上也有丰富的贸易路线。\n印度是一个主要的贸易中心，它本身拥有丰富的资源，同时也连接着罗马和中国的贸易。\n同时也连接着罗马和中国之间的贸易。因此，这似乎是很自然的，因为有了这样的...",
      "title": "古代地中海的海盗行为在公元前一世纪被罗马人基本消灭了。但印度洋的海盗行为呢？从埃及到马六甲，印度、罗马和中国的巨大财富在海上纵横交错，在古代，海盗是该地区的主要问题吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當人們討論古代的海盜行爲時，幾乎總是集中在地中海地區。\n地中海地區。但印度洋上也有豐富的貿易路線。\n印度是一個主要的貿易中心，它本身擁有豐富的資源，同時也連接着羅馬和中國的貿易。\n同時也連接着羅馬和中國之間的貿易。因此，這似乎是很自然的，因爲有了這樣的...",
      "title": "古代地中海的海盜行爲在公元前一世紀被羅馬人基本消滅了。但印度洋的海盜行爲呢？從埃及到馬六甲，印度、羅馬和中國的巨大財富在海上縱橫交錯，在古代，海盜是該地區的主要問題嗎？"
    }
  ]
}