{
  "author": "Rishloos",
  "the_new_excerpt": "I know that after you've held your breath for a while, you get a signal from\nyour brain that indicates your blood oxygen is low, and that you need to breathe\nagain. But this doesn't feel like a strictly mental thing. It feels like\nsomething is happening physiologically too, in your diaphragm; it's…",
  "original_created_utc": 1618124177,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しばらく息を止めていると、血液中の酸素が少なくなっていることを示す信号が脳から送られてくることは知っています。\n血中酸素濃度が低くなっていることを示す信号が脳から送られ、再び呼吸をする必要があります。\nという信号が出ます。しかし、これは厳密には精神的なものではないようです。感覚的には\n横隔膜で生理的にも何かが起こっているように感じます...",
      "title": "長時間息を止めていると、横隔膜に違和感を感じるのはなぜでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，当你屏住呼吸一段时间后，你会收到一个信号，来自...\n你的大脑，表明你的血液氧气是低的，你需要呼吸。\n再次。但这感觉不像是严格意义上的心理问题。这感觉就像\n在你的横膈膜上也发生了一些生理上的事情，它... ...",
      "title": "憋气时间长了，横膈膜有不舒服的生理感觉是什么原因？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，當你屏住呼吸一段時間後，你會收到一個信號，來自...\n你的大腦，表明你的血液氧氣是低的，你需要呼吸。\n再次。但這感覺不像是嚴格意義上的心理問題。這感覺就像\n在你的橫膈膜上也發生了一些生理上的事情，它... ...",
      "title": "憋氣時間長了，橫膈膜有不舒服的生理感覺是什麼原因？"
    }
  ],
  "title": "What causes the uncomfortable physical sensation in your diaphragm after you've held your breath for a long time?",
  "created_utc": 1618142446,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that after you&#39;ve held your breath for a while, you get a signal from your brain that indicates your blood oxygen is low, and that you need to breathe again. But this doesn&#39;t feel like a strictly mental thing. It feels like something is happening physiologically too, in your diaphragm; it&#39;s some kind of discomfort, tension... Hard to describe. What, precisely, <em>is</em> happening? Or am I way off the mark and interpreting something that isn&#39;t actually there?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/askscience/comments/mom5hm/what_causes_the_uncomfortable_physical_sensation/",
  "subreddit": "askscience",
  "id": "mom5hm",
  "is_self": true,
  "media": null,
  "is_video": false
}