{
  "author": "calabash_bro",
  "original_created_utc": 1636099621,
  "title": "Why is the US seemingly the only country that uses hyphens to distinguish ethnic groups (ex: Asian-American, African-American, Italian-American, Irish-American)? Are there any other countries that do this?",
  "created_utc": 1636127224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve read that, for example, the French government pushes back against this practice because they want to ensure a coherent French national identity. Do other countries share a similar belief? Is there a reason the US in particular seems to place so much emphasis on national/racial origin?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/qn69p8/why_is_the_us_seemingly_the_only_country_that/",
  "subreddit": "AskHistorians",
  "id": "qn69p8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve read that, for example, the French government pushes back against this\npractice because they want to ensure a coherent French national identity. Do\nother countries share a similar belief? Is there a reason the US in particular\nseems to place so much emphasis on national/racial origin?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、フランス政府はこのような慣習に反発していると読みました。\nフランス政府は、一貫したフランス国民のアイデンティティを確保するために、この慣行に反発していると読んだことがあります。他の国でも\n他の国でも同じように考えているのでしょうか？特にアメリカでは、このようなことを重視する理由があるのでしょうか？\n特にアメリカでは、国籍や人種を重視しているようですが、その理由はあるのでしょうか？",
      "title": "アジア系アメリカ人、アフリカ系アメリカ人、イタリア系アメリカ人、アイルランド系アメリカ人など、民族を区別するのにハイフンを使うのは、なぜアメリカだけなのでしょうか？他の国でも同じようなことをしている国はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我读到，例如，法国政府反对这种做法，因为他们想确保法国民族身份的一致性。\n因为他们想确保一个连贯的法国民族身份。其他国家是否\n其他国家也有类似的想法吗？尤其是美国，是否有什么原因\n似乎如此强调民族/种族出身？",
      "title": "为什么美国似乎是唯一一个用连字符来区分族裔群体的国家（例如：亚裔美国人、非裔美国人、意大利裔美国人、爱尔兰裔美国人）？还有其他国家这样做吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我讀到，例如，法國政府反對這種做法，因爲他們想確保法國民族身份的一致性。\n因爲他們想確保一個連貫的法國民族身份。其他國家是否\n其他國家也有類似的想法嗎？尤其是美國，是否有什麼原因\n似乎如此強調民族/種族出身？",
      "title": "爲什麼美國似乎是唯一一個用連字符來區分族裔羣體的國家（例如：亞裔美國人、非裔美國人、意大利裔美國人、愛爾蘭裔美國人）？還有其他國家這樣做嗎？"
    }
  ]
}