{
  "author": "SoonMoonn",
  "original_created_utc": 1634403681,
  "title": "Now that Crypto is reaching ATHs again. There will a lot of new people joining crypto, instead of mocking them for not knowing the basics. Let’s help them and give them a fun environment!",
  "created_utc": 1634412852,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Always, during bull runs a lot of new people get interested in crypto to join in on the hype! Which is good for crypto because we like adoption! </p>\n\n<p>A lot of them won’t know the basics, like Market Cap, difference between good and shitcoins and a lot of other stuff.</p>\n\n<p>Instead of mocking them for thinking Shib can reach $0.1, teach them about market cap and how it’s almost* impossible for that to happen.</p>\n\n<p>*almost because nothing in crypto is impossible.</p>\n\n<p>This sub did teach me a lot, but I was a lurker and I didn’t ask any questions, I only read other people’s question and people answering them. Most of them were nice, but some were not so nice.</p>\n\n<p>Do your part for helping crypto grow!</p>\n</div><!-- SC_ON -->",
  "score": 363,
  "permalink": "/r/CryptoCurrency/comments/q9fyws/now_that_crypto_is_reaching_aths_again_there_will/",
  "subreddit": "CryptoCurrency",
  "id": "q9fyws",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Always, during bull runs a lot of new people get interested in crypto to join in\non the hype! Which is good for crypto because we like adoption!\n\nA lot of them won’t know the basics, like Market Cap, difference between good\nand shitcoins and a lot of other stuff.\n\nInstead of mocking them for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いつも、強気の相場の時には、多くの新しい人々が暗号に興味を持ち、ハイプに参加します。\n誇大広告に参加しようとします。これは暗号にとっては良いことです。私たちは採用を好みますから。\n\n彼らの多くは、時価総額や優良コインと糞コインの違いなどの基本的なことを知らないでしょう。\nマーケットキャップ、グッドコインとシットコインの違いなど、基本的なことを知らない人も多いでしょう。\n\n彼らを馬鹿にするのではなく...",
      "title": "今、Cryptoは再びATHに到達しています。基本的なことを知らないことを馬鹿にするのではなく、たくさんの新しい人々がCryptoに参加するでしょう。彼らを助けて、楽しい環境を与えてあげましょう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一直以来，在牛市期间，很多新人对加密货币感兴趣，加入到\n炒作! 这对加密货币来说是好事，因为我们喜欢采用!\n\n他们中的很多人都不知道基础知识，比如市值，好的和坏的区别。\n和屎币的区别，以及很多其他的东西。\n\n与其嘲笑他们...",
      "title": "现在，加密货币又达到了ATH。会有很多新人加入加密货币，而不是嘲笑他们不懂基础知识。让我们帮助他们，给他们一个有趣的环境!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一直以來，在牛市期間，很多新人對加密貨幣感興趣，加入到\n炒作! 這對加密貨幣來說是好事，因爲我們喜歡採用!\n\n他們中的很多人都不知道基礎知識，比如市值，好的和壞的區別。\n和屎幣的區別，以及很多其他的東西。\n\n與其嘲笑他們...",
      "title": "現在，加密貨幣又達到了ATH。會有很多新人加入加密貨幣，而不是嘲笑他們不懂基礎知識。讓我們幫助他們，給他們一個有趣的環境!"
    }
  ]
}