{
  "author": "Rydersilver",
  "original_created_utc": 1624565240,
  "title": "After careful skimming of hundreds of comments, I have concluded that we are entering a bullbear market",
  "created_utc": 1624583741,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have done the unthinkable, and am now employing a new strategy that looks past all technical and fundamental analysis, DYOR, use cases and market analysis to exclusively tunnel vision on my feels and normal price fluctuations. </p>\n\n<p>I have carefully skimmed hundreds or possibly tens of reddit comments to aggregate the consensus of the average reddit user’s emotions into my conclusion: that we are both simultaneously in a bull market and a bear market.  </p>\n\n<p>It is obvious really. When the price goes up by 2%, we are in a bull market. Did China crack down on cryptocurrency again? Good, we don’t want too much mass adoption.  </p>\n\n<p>Of course, we are also in a bear market as Bitcoin stagnates at the same time. Tomorrow it may even go up or down. You know what they say, pray in May it will go both ways.  </p>\n\n<p>I hope this was unhelpful to most of you. <em>This analysis brought to you by enlightened crypto centrism.</em></p>\n</div><!-- SC_ON -->",
  "score": 214,
  "permalink": "/r/CryptoCurrency/comments/o78w92/after_careful_skimming_of_hundreds_of_comments_i/",
  "subreddit": "CryptoCurrency",
  "id": "o78w92",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have done the unthinkable, and am now employing a new strategy that looks past\nall technical and fundamental analysis, DYOR, use cases and market analysis to\nexclusively tunnel vision on my feels and normal price fluctuations.\n\nI have carefully skimmed hundreds or possibly tens of reddit comments…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は考えもしなかったことをしてしまいました。\nテクニカル分析、ファンダメンタル分析、DYOR、ユースケース、市場分析などを一切無視して\n自分の感覚と通常の価格変動だけに目を向けています。\n\n私は何百、何十ものredditのコメントを注意深く読みました...。",
      "title": "何百ものコメントを丹念に読み込んだ結果、私は「ブルベア市場に突入した」と結論づけました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我做了一件不可思议的事，现在采用了一种新的策略，即不考虑所有技术和基本面分析、DYOR、用例和市场分析。\n所有的技术和基本面分析、DYOR、使用案例和市场分析。\n完全以隧道的眼光看待我的感觉和正常的价格波动。\n\n我仔细地浏览了数百条或可能数十条reddit评论...",
      "title": "在仔细浏览了数百条评论后，我得出结论，我们正在进入一个牛熊市场"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我做了一件不可思議的事，現在採用了一種新的策略，即不考慮所有技術和基本面分析、DYOR、用例和市場分析。\n所有的技術和基本面分析、DYOR、使用案例和市場分析。\n完全以隧道的眼光看待我的感覺和正常的價格波動。\n\n我仔細地瀏覽了數百條或可能數十條reddit評論...",
      "title": "在仔細瀏覽了數百條評論後，我得出結論，我們正在進入一個牛熊市場"
    }
  ]
}