{
  "author": "Life_Complaint6500",
  "original_created_utc": 1656991683,
  "title": "Is it normal if i cant even talk to my mother after she wakes up?",
  "created_utc": 1657024531,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Basically, when she (50 years old) wakes up she needs a coffee and like 10-20 minutes of alone time, like i cant even be in the same room as she is, bc she gets so triggered by anything i do/say, that she starts yelling and arguing about anything. Last time we had an agrument which ended in her thinking that im only waiting for her to die so i can inherit her wealth and homes and shit. I was basically stunned by this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/vrojcw/is_it_normal_if_i_cant_even_talk_to_my_mother/",
  "subreddit": "NoStupidQuestions",
  "id": "vrojcw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Basically, when she (50 years old) wakes up she needs a coffee and like 10-20\nminutes of alone time, like i cant even be in the same room as she is, bc she\ngets so triggered by anything i do/say, that she starts yelling and arguing\nabout anything. Last time we had an agrument which ended in her…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的に、彼女（50歳）は目が覚めると、コーヒーを飲み、10～20杯ほど飲みたいそうです。\n分くらい一人の時間が必要で、私は同じ部屋にいることさえできません。\n私が何をやっても、何を言っても、彼女は怒鳴り始め、口論になる。\nをし始めるからだ。この前も口論になり、最後には彼女が...。",
      "title": "母が目を覚ました後、話すこともできないのは正常なことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，当她（50岁）醒来的时候，她需要一杯咖啡和像10-20个\n分钟的独处时间，我甚至不能和她待在同一个房间里，因为她\n因为我做什么/说什么，她都会被激怒，开始大喊大叫，争论不休。\n任何事情。上一次，我们发生了争吵，最后她...",
      "title": "如果我在我母亲醒来后甚至不能和她说话，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，當她（50歲）醒來的時候，她需要一杯咖啡和像10-20個\n分鐘的獨處時間，我甚至不能和她待在同一個房間裏，因爲她\n因爲我做什麼/說什麼，她都會被激怒，開始大喊大叫，爭論不休。\n任何事情。上一次，我們發生了爭吵，最後她...",
      "title": "如果我在我母親醒來後甚至不能和她說話，這正常嗎？"
    }
  ]
}