{
  "author": "rhoadsalive",
  "the_new_excerpt": "There seems to be an influx of new \"traders\" that literally spam the same\nquestions about the same 2 tickers on a daily basis, asking us if they should\nspend their life savings on a single position or how they can buy a certain hype\nstock as quick as possible because they heard that those might go…",
  "original_created_utc": 1611488741,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "似乎有大量新的 \"交易商 \"涌入，他们从字面上喷洒同样的信息。\n每天都有关于相同的2个股票的问题，问我们他们是否应\n将毕生积蓄花在单一的仓位上，或者说如何买到某项炒作\n尽可能快的库存，因为他们听说那些可能会去... ...",
      "title": "本子质量下降"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎有大量新的 \"交易商 \"湧入，他們從字面上噴灑同樣的信息。\n每天都有關於相同的2個股票的問題，問我們他們是否應\n將畢生積蓄花在單一的倉位上，或者說如何買到某項炒作\n儘可能快的庫存，因爲他們聽說那些可能會去... ...",
      "title": "本子質量下降"
    }
  ],
  "title": "Deteriorating quality of this sub",
  "created_utc": 1611497451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There seems to be an influx of new &quot;traders&quot; that literally spam the same questions about the same 2 tickers on a daily basis, asking us if they should spend their life savings on a single position or how they can buy a certain hype stock as quick as possible because they heard that those might go up indefinitely, never having made a financial decision like that in their life before, most don&#39;t even seem to know the very basics but want to make quick money. WSB used to be a funny little subreddit in which you could discuss serious DD and also post your losses on stupid trades (no upvotes for green accounts), now it&#39;s some kind of weird echo chamber and it&#39;s suddenly &quot;cool&quot; to be part of it and also take part in every stupid idea people there come up with, not to mention it&#39;s toxic, e.g. harrassing Andrew Left is not okay, you might not agree with him, but he has made some valid points most people don&#39;t even want to consider because of mob mentality, just the keep the insults out of this sub please.</p>\n\n<p>It feels like the same kind of people are now slowly taking over this sub, sorting posts by &quot;new&quot; is pointless because the same stupid questions that could be answered with a 10 second Google search are asked every 10 minutes, if you don&#39;t have the patience for that, or even reading the sidebar you shouldn&#39;t be able to post here and spam this sub because it drowns the few actually interesting questions and discussions that don&#39;t concern Gamestop, Palantir or Blackberry or gambling away your family&#39;s life savings. The worst thing is that people who have no clue get positively reinforced by members of this sub &quot;yeah totally yolo all your savings into GME&quot;. This is not WSB, people should at least put some thought into their posts.</p>\n\n<p>The moderators should be a lot tougher again and curate the sub more, keep out the toxicity, make sure people get useful advice and are not lead into financial ruin (some can&#39;t tell the difference between irony and serious advice). Several uses have suggested to put more of an emphasis on to FAQ and Q&amp;A sections as well, many people already use the daily threads and and post good questions and discussions, let&#39;s increase its use.</p>\n\n<p>The quality has deteriorated so much, I almost don&#39;t feel like scrolling through the sub anymore.</p>\n\n<p>Excuse the wall of text but it&#39;s been bothering me for a while now, anybody else feel the same way or am I just delusional?</p>\n\n<p>Edit: Thank you all for your contributions, seems like we got a real discussion going here, which is great, let&#39;s all stay civil though, even if it&#39;s a controversial topic, please don&#39;t insult the posters you don&#39;t agree with.</p>\n</div><!-- SC_ON -->",
  "score": 2896,
  "permalink": "/r/stocks/comments/l3y04z/deteriorating_quality_of_this_sub/",
  "subreddit": "stocks",
  "id": "l3y04z",
  "is_self": true,
  "media": null,
  "is_video": false
}