{
  "author": "ConicalSofa",
  "original_created_utc": 1632827522,
  "title": "Why is Labrador?",
  "created_utc": 1632855869,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s this big random chunk of worthless taiga that for some reason is carved off the mainland and assigned to the island of Newfoundland. Hardly anybody lives there, there isn&#39;t much in the way of natural resources, the climate is not conducive to settlement, so why would it be a separate place?</p>\n\n<p>Furthermore, as I was reading through to see if this question was answered before, I read that there was apparently a spat with Quebec over where the border is. Who cares??? I feel like other times when there have been borders between friendly polities that ran through wasteland, eg the border between Saudi Arabia and Oman in the Empty Quarter, they&#39;re happy to leave it Undefined until they had to define it.</p>\n\n<p>So why would Labrador be a thing, much less a thing whose borders anybody cares about?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/px43fj/why_is_labrador/",
  "subreddit": "AskHistorians",
  "id": "px43fj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's this big random chunk of worthless taiga that for some reason is carved off\nthe mainland and assigned to the island of Newfoundland. Hardly anybody lives\nthere, there isn't much in the way of natural resources, the climate is not\nconducive to settlement, so why would it be a separate…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何の価値もないタイガの大きな塊が、なぜか本土から切り離されて\n本土から切り離され、ニューファンドランド島に割り当てられている。ほとんど誰も住んでいない\nそこにはほとんど誰も住んでおらず、天然資源もあまりなく、気候も定住には適していません。\nなぜそこが独立した島なのか...",
      "title": "なぜラブラドールなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是一大块随机的毫无价值的针叶林，由于某种原因被从大陆上分割出来，并被分配到新泽西岛。\n由于某种原因，这一大块毫无价值的针叶林被从大陆上划出，并被分配到纽芬兰岛上。几乎没有人住在那里\n那里几乎没有人居住，没有多少自然资源，气候也不适合定居。\n气候也不利于定居，所以它为什么会成为一个独立的...",
      "title": "为什么是拉布拉多？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是一大塊隨機的毫無價值的針葉林，由於某種原因被從大陸上分割出來，並被分配到新澤西島。\n由於某種原因，這一大塊毫無價值的針葉林被從大陸上劃出，並被分配到紐芬蘭島上。幾乎沒有人住在那裏\n那裏幾乎沒有人居住，沒有多少自然資源，氣候也不適合定居。\n氣候也不利於定居，所以它爲什麼會成爲一個獨立的...",
      "title": "爲什麼是拉布拉多？"
    }
  ]
}