{
  "author": "Dingobaby87",
  "the_new_excerpt": "It’s all in the title really. I feel like a black person cant just be a shitty\nperson without that reflecting on all of them. I get that subs like\nr/NoahGetTheBoat [/r/NoahGetTheBoat] and others are populated by a lot of hidden\nconservatives and that’s expected of them but I’ve seen this even…",
  "original_created_utc": 1619415452,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それは、タイトルにも表れています。私は、黒人がただのクソみたいな人間であってはならないと感じています。\nそれがすべての人に反映されないような気がします。のようなサブ的なものはわかります。\nr/NoahGetTheBoat [/r/NoahGetTheBoat]などのサブは隠れた保守派が多く住んでいて、それが期待されています。\n私は、r/NoahGetTheBoat [/r/NoahGetTheBoat]などのサブは、多くの隠れた保守派が住んでいて、それは彼らに期待されています。",
      "title": "なぜ、黒人が何かバカなことをしている記事になると、必ず人種差別と答える人がいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这一切都在标题中，真的。我觉得一个黑人不可能只是一个糟糕的人\n我觉得一个黑人不能只做一个低劣的人，而不反映在他们所有人身上。我明白，像这样的子网站\nr/NoahGetTheBoat [/r/NoahGetTheBoat]等子论坛上有许多隐藏的\n保守主义者，这是对他们的期望，但我已经看到这甚至...",
      "title": "为什么当一个帖子中的黑人做了什么蠢事时，人们总是用种族主义来回答？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這一切都在標題中，真的。我覺得一個黑人不可能只是一個糟糕的人\n我覺得一個黑人不能只做一個低劣的人，而不反映在他們所有人身上。我明白，像這樣的子網站\nr/NoahGetTheBoat [/r/NoahGetTheBoat]等子論壇上有許多隱藏的\n保守主義者，這是對他們的期望，但我已經看到這甚至...",
      "title": "爲什麼當一個帖子中的黑人做了什麼蠢事時，人們總是用種族主義來回答？"
    }
  ],
  "title": "Why do people always reply with racism when a post has a black person doing something stupid?",
  "created_utc": 1619499593,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s all in the title really. I feel like a black person cant just be a shitty person without that reflecting on all of them. I get that subs like <a href=\"/r/NoahGetTheBoat\">r/NoahGetTheBoat</a> and others are populated by a lot of hidden conservatives and that’s expected of them but I’ve seen this even in “progressive” spaces. Even in spaces where you’d assume it’s majority black people. It’s just straight up n words and stuff too, not even hidden racism.</p>\n\n<p>And before people assume stuff, I’m also against generalizing white people as school shooters or whatever. There’s definitely trends there but racism is never the answer.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/myqkiw/why_do_people_always_reply_with_racism_when_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "myqkiw",
  "is_self": true,
  "media": null,
  "is_video": false
}