{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "Hi Everyone, I'm only 42 but have been becoming increasingly interested in finances and believe I now have enough understanding to manage my own money. I don't panic during downturns, in fact, I'll usually purchase a lot more! Likewise, I'm not stupid enough to buy some MEME stock. Anyways,  about 4 years ago I had a lot of money in CDs/savings account -- so Edward Jones was actually initially attractive to someone like myself who's only market exposure was within a 401k/IRA and ESPP/RSUs. After a lot of nudging by friends, I realized I had way too much cash parked on the sidelines so I gave EJ about 100k of my cash, and also let them convince me I needed to rollover my Putnam IRA (which was doing extremely well) into Edward Jones. I doubly regret agreeing to the latter because in hindsight there was no need to change anything as I was doing very well and like the funds I was invested in there. I guess this is price one pays for not realizing they weren't a fiduciary, but were in fact a salesperson getting commissions on shoving my money into high-load funds with heavy fees. \n\nEJ put my cash into about \\~20 individual stocks and 6 mutual funds.  Honestly, it's the mutual funds and IRA where I feel EJ socked it to me the most. I had no concept of \"load\" or anything, and some of these funds simply haven't performed well enough to justify the exorbitant fees. I was initially on a month AUM fee, but soon realized I wasn't transacting enough to justify writing the check every month. So, while they gave me some resistance, I switched over to the no month fee account, but this now means any buys/sell results in a hefty fee. I can tell the lady no longer \"liked\" me from this point forward as I undoubtedly took money out of her pocket once my eyes began to open. The performance drag from all their fund choices is rather maddening, but I guess it's a lesson learned the hard way. So, my strategy is to soon begin an in-kind transfer of  all the individual stocks and 2 of the mutual funds that etrade supports. I will then rollover my IRA into fidelity where I currently have a 401k that's done a lot better than the dog shit EJ put me in. This leaves me for 4 mutual funds within EJ that only they peddle, but I'm going to leave them long enough to capture all the financial statements.I don't want to sell the 2 mutual funds that will transfer in-kind until they're at etrade as I know EJ will charge me an arm and a leg. Ultimately, I'm going to read up and likely do a simple 3 fund strategy of low/no fee ETF/Index funds.  I'll slowly unwind the individual stocks as it's just too complicated and tiring to follow so many tickers even though all the companies I invest in I do \"like.\"",
  "author_fullname": "t2_294ic05q",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Another lucky Edward Jones client",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_t7yj21",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.88,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 18,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 18,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1646577461,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1646572565,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi Everyone, I&amp;#39;m only 42 but have been becoming increasingly interested in finances and believe I now have enough understanding to manage my own money. I don&amp;#39;t panic during downturns, in fact, I&amp;#39;ll usually purchase a lot more! Likewise, I&amp;#39;m not stupid enough to buy some MEME stock. Anyways,  about 4 years ago I had a lot of money in CDs/savings account -- so Edward Jones was actually initially attractive to someone like myself who&amp;#39;s only market exposure was within a 401k/IRA and ESPP/RSUs. After a lot of nudging by friends, I realized I had way too much cash parked on the sidelines so I gave EJ about 100k of my cash, and also let them convince me I needed to rollover my Putnam IRA (which was doing extremely well) into Edward Jones. I doubly regret agreeing to the latter because in hindsight there was no need to change anything as I was doing very well and like the funds I was invested in there. I guess this is price one pays for not realizing they weren&amp;#39;t a fiduciary, but were in fact a salesperson getting commissions on shoving my money into high-load funds with heavy fees. &lt;/p&gt;\n\n&lt;p&gt;EJ put my cash into about ~20 individual stocks and 6 mutual funds.  Honestly, it&amp;#39;s the mutual funds and IRA where I feel EJ socked it to me the most. I had no concept of &amp;quot;load&amp;quot; or anything, and some of these funds simply haven&amp;#39;t performed well enough to justify the exorbitant fees. I was initially on a month AUM fee, but soon realized I wasn&amp;#39;t transacting enough to justify writing the check every month. So, while they gave me some resistance, I switched over to the no month fee account, but this now means any buys/sell results in a hefty fee. I can tell the lady no longer &amp;quot;liked&amp;quot; me from this point forward as I undoubtedly took money out of her pocket once my eyes began to open. The performance drag from all their fund choices is rather maddening, but I guess it&amp;#39;s a lesson learned the hard way. So, my strategy is to soon begin an in-kind transfer of  all the individual stocks and 2 of the mutual funds that etrade supports. I will then rollover my IRA into fidelity where I currently have a 401k that&amp;#39;s done a lot better than the dog shit EJ put me in. This leaves me for 4 mutual funds within EJ that only they peddle, but I&amp;#39;m going to leave them long enough to capture all the financial statements.I don&amp;#39;t want to sell the 2 mutual funds that will transfer in-kind until they&amp;#39;re at etrade as I know EJ will charge me an arm and a leg. Ultimately, I&amp;#39;m going to read up and likely do a simple 3 fund strategy of low/no fee ETF/Index funds.  I&amp;#39;ll slowly unwind the individual stocks as it&amp;#39;s just too complicated and tiring to follow so many tickers even though all the companies I invest in I do &amp;quot;like.&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "t7yj21",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "nexusmoonshot",
  "discussion_type": null,
  "num_comments": 24,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/t7yj21/another_lucky_edward_jones_client/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/t7yj21/another_lucky_edward_jones_client/",
  "subreddit_subscribers": 143824,
  "created_utc": 1646588124,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1646572565,
  "the_new_excerpt": "Hi Everyone, I'm only 42 but have been becoming increasingly interested in\nfinances and believe I now have enough understanding to manage my own money. I\ndon't panic during downturns, in fact, I'll usually purchase a lot more!\nLikewise, I'm not stupid enough to buy some MEME stock. Anyways, about 4…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、私はまだ42歳ですが、だんだん興味が湧いてきました。\nを理解し、自分でお金を管理できるようになったと思っています。I\n不景気でも慌てず、むしろ買い増しをするのが普通です\n同様に、MEMEの株を買うほどバカでもない。とにかく、約4..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我只有42岁，但对财务越来越感兴趣。\n财务，并相信我现在有足够的理解来管理自己的钱。I\n在经济下滑的时候不会惊慌失措，事实上，我通常会购买更多的东西!\n同样，我也不会傻到去买一些MEME的股票。总之，大约4...",
      "title": "另一位幸运的爱德华-琼斯客户"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我只有42歲，但對財務越來越感興趣。\n財務，並相信我現在有足夠的理解來管理自己的錢。I\n在經濟下滑的時候不會驚慌失措，事實上，我通常會購買更多的東西!\n同樣，我也不會傻到去買一些MEME的股票。總之，大約4...",
      "title": "另一位幸運的愛德華-瓊斯客戶"
    }
  ]
}