{
  "author": "depressedkittyfr",
  "original_created_utc": 1646735641,
  "title": "Why didn’t we cancel trade with Saudi Arabia and many oil nations when they committed human rights violations of highest order?",
  "created_utc": 1646747812,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Right from harbour, funding and morally defending Islamic terrorism to what it’s doing to Yemen ( another “sovereign” country ). &lt;/p&gt;\n\n&lt;p&gt;Whereas europe and USA just cancelled oil and gas trade at the expense of citizens. A lot of people are already facing the music and are shit scared with the soaring bills yet to come ! And it’s not like wages are reflecting the change either ( as it never does ) . Europe’s next winter is going to go the dark ages for this reason and even 7 months is too soon to make drastic measures to save the situation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 156,
  "permalink": "/r/TooAfraidToAsk/comments/t9dzti/why_didnt_we_cancel_trade_with_saudi_arabia_and/",
  "subreddit": "TooAfraidToAsk",
  "id": "t9dzti",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Right from harbour, funding and morally defending Islamic terrorism to what it’s\ndoing to Yemen ( another “sovereign” country ).\n\nWhereas europe and USA just cancelled oil and gas trade at the expense of\ncitizens. A lot of people are already facing the music and are shit scared with\nthe soaring…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イスラムのテロリズムを受け入れ、資金を提供し、道徳的に擁護している。\nイエメン（もう一つの「主権」国）に対して行っている。\n\n一方、ヨーロッパとアメリカは、犠牲を払って石油とガスの取引を取りやめただけです。\n市民 多くの人々がすでに音楽に直面し、恐怖を感じています。\n高騰する...",
      "title": "サウジアラビアや多くの石油国が最高レベルの人権侵害を行ったとき、なぜ貿易を中止しなかったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从庇护、资助和从道义上维护伊斯兰恐怖主义到它对也门（另一个 \"主权国家\"）的所作所为。\n对也门（另一个 \"主权 \"国家）的行为。\n\n而欧洲和美国只是取消了石油和天然气贸易，牺牲了公民的利益。\n公民。很多人已经在面对音乐了，他们被吓得屁滚尿流。\n飙升的价格......",
      "title": "当沙特阿拉伯和许多石油国家犯下最高级别的侵犯人权行为时，我们为什么不取消与他们的贸易？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從庇護、資助和從道義上維護伊斯蘭恐怖主義到它對也門（另一個 \"主權國家\"）的所作所爲。\n對也門（另一個 \"主權 \"國家）的行爲。\n\n而歐洲和美國只是取消了石油和天然氣貿易，犧牲了公民的利益。\n公民。很多人已經在面對音樂了，他們被嚇得屁滾尿流。\n飆升的價格......",
      "title": "當沙特阿拉伯和許多石油國家犯下最高級別的侵犯人權行爲時，我們爲什麼不取消與他們的貿易？"
    }
  ]
}