{
  "author": "Frigorifico",
  "original_created_utc": 1631893257,
  "title": "In Medieval Europe there existed a superstition that fairies would sometimes kidnap people, usually babies, and leave changelings in their place. What would happen if a person really thought their baby was a changeling?",
  "created_utc": 1631914471,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off, I&#39;m working on the assumption that some people really believed these stories. They seem very silly to us today but at least some people really believed in these stories, right?</p>\n\n<p>Second, these stories are often full of advice on how to avoid your baby or even yourself from being kidnaped by the fairies, like having iron scissors, but what if a person believed their baby was indeed stolen by the fairies and they left a changeling in its place?, how would you even know if your baby was a changeling or not?</p>\n\n<p>I have a very morbid idea about all this, and I hope I&#39;m wrong, but I think this superstitions could be used as a pretext for infanticide when poor people couldn&#39;t take care of their children for some reason</p>\n\n<p>Like, if your baby was born with a disability yo could argue your real baby was stolen by the fae and kill the changeling, no one would blame you</p>\n\n<p>There are also many stories of adults being stolen by the fae, particularly old people, which could be the explanation they had for senile dementia. Like if a person got Alzheimer and didn&#39;t remember their friends and family it could be they were a changeling who just took the form of that person</p>\n\n<p>However I have not found mentions to killing changelings so hopefully I&#39;m wrong, but I imagine there had to be some kind of superstition about what to do with changelings, even if the stories associated with that superstition weren&#39;t as popular</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/pq2kj5/in_medieval_europe_there_existed_a_superstition/",
  "subreddit": "AskHistorians",
  "id": "pq2kj5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First off, I'm working on the assumption that some people really believed these\nstories. They seem very silly to us today but at least some people really\nbelieved in these stories, right?\n\nSecond, these stories are often full of advice on how to avoid your baby or even\nyourself from being kidnaped…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、これらの話を本当に信じた人がいたという前提で話を進めます。\n想定しています。現代の私たちから見れば、とても馬鹿げた話ですが、少なくとも、これらの話を本当に信じていた人がいたのです。\n信じていた人もいたのではないでしょうか？\n\n次に、これらの話には、赤ちゃんや自分自身が誘拐されないようにするためのアドバイスが多く含まれています。\n誘拐されないようにするためのアドバイスが書かれています。",
      "title": "中世ヨーロッパでは、妖精が人（たいていは赤ん坊）をさらってきて、その代わりにチェンジリングを置いていくという迷信がありました。もし、ある人が自分の赤ちゃんがチェンジリングだと本気で思ったらどうなるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我的假设是，有些人真的相信这些\n故事。在我们今天看来，这些故事非常愚蠢，但至少有些人真的\n相信这些故事，对吗？\n\n其次，这些故事往往充满了关于如何避免你的孩子甚至是\n自己不被绑架......",
      "title": "在中世纪的欧洲，存在着一种迷信，即仙女有时会绑架人，通常是婴儿，并在他们的位置上留下变种人。如果一个人真的认为自己的婴儿是一个变种人，会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我的假設是，有些人真的相信這些\n故事。在我們今天看來，這些故事非常愚蠢，但至少有些人真的\n相信這些故事，對嗎？\n\n其次，這些故事往往充滿了關於如何避免你的孩子甚至是\n自己不被綁架......",
      "title": "在中世紀的歐洲，存在着一種迷信，即仙女有時會綁架人，通常是嬰兒，並在他們的位置上留下變種人。如果一個人真的認爲自己的嬰兒是一個變種人，會發生什麼？"
    }
  ]
}