{
  "author": "CorneredSponge",
  "the_new_excerpt": "Although they lost $911mln with Archegos, it was a low impact event overall, and\nMS remains an excellent stock, with a diverse FICC portfolio, collateralized\nassets all around (including level 3), stretching their legs throughout every\naspect of high finance (intangible vertical integration,…",
  "original_created_utc": 1618580295,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Archegosで911百万ドルの損失を出したが、全体的にはインパクトの少ないイベントだったし\nMSは、多様なFICCポートフォリオ、担保付きの資産（レベル3を含む）を持ち、あらゆる場面で足を伸ばしている優れた銘柄である。\nレベル3を含む）、ハイファイナンスのあらゆる面で足を伸ばしている。\nハイファイナンスのあらゆる側面（無形の垂直統合、...）で足を伸ばしている。",
      "title": "モルガン・スタンレー、トレーディングおよび投資銀行部門の業績が予想を上回り、業績予想を上回る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "虽然他们在Archegos那里损失了9.11亿美元，但总体来说影响不大，而且。\nMS仍然是一只优秀的股票，它拥有多样化的FICC组合，有抵押的\n包括3级）的资产，在每一个环节中都要伸长腿。\n方面的高金融（无形的垂直整合，...",
      "title": "摩根士丹利因交易、投行业绩好于预期，盈利超预期。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雖然他們在Archegos那裏損失了9.11億美元，但總體來說影響不大，而且。\nMS仍然是一隻優秀的股票，它擁有多樣化的FICC組合，有抵押的\n包括3級）的資產，在每一個環節中都要伸長腿。\n方面的高金融（無形的垂直整合，...",
      "title": "摩根士丹利因交易、投行業績好於預期，盈利超預期。"
    }
  ],
  "title": "Morgan Stanley tops earnings estimates on better-than-expected trading, investment banking results",
  "created_utc": 1618600780,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Although they lost $911mln with Archegos, it was a low impact event overall, and MS remains an excellent stock, with a diverse FICC portfolio, collateralized assets all around (including level 3), stretching their legs throughout every aspect of high finance (intangible vertical integration, essentially), etc.</p>\n\n<p>This comes on the heels of excellent bank earnings for Goldman Sachs, JP Morgan Chase, Wells Fargo, etc. thanks to record liquidity and savings.</p>\n\n<p>Record revenue and earnings are likely products of a busy year of acquisitions in 2020, which included the purchase of e*trade and Eaton Vance.</p>\n\n<p>As a part of a larger trend, MS looks to be undergoing a transformation, achieving most of their revenues through trading, asset/wealth management, and fees and commissions rather than investment banking and interest revenues.</p>\n\n<p>Here are the key figures:</p>\n\n<p>Earnings: $1.70 a share, 68% higher than a year earlier, according to Refinitiv</p>\n\n<p>Revenue: $14.1 billion, 49% higher than a year earlier</p>\n\n<p><a href=\"https://www.cnbc.com/2021/04/16/morgan-stanley-ms-earnings-1q-2021.html?__source=androidappshare\">https://www.cnbc.com/2021/04/16/morgan-stanley-ms-earnings-1q-2021.html?__source=androidappshare</a></p>\n</div><!-- SC_ON -->",
  "score": 89,
  "permalink": "/r/investing/comments/ms3bqn/morgan_stanley_tops_earnings_estimates_on/",
  "subreddit": "investing",
  "id": "ms3bqn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171524766
}