{
  "author": "mydadpickshisnose",
  "original_created_utc": 1630916091,
  "title": "Do Americans really go to church as often as popular culture, media, and Reddit indicate?",
  "created_utc": 1630947924,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m from Australia and I&#39;ve literally never heard anyone under the age of 60 talk about their &quot;church&quot;.</p>\n\n<p>However, pretty much every episode of Forged in Fire I&#39;ve watched, the contestants always refer to their church in one form or another. Same with pretty much every other tv show from the US. They always praise God or thank God and make a big show of it.</p>\n\n<p>Same with reading comments on Reddit, it feels like more US citizens seem to go to church and actually state as much online than other countries.</p>\n\n<p>So I guess what I&#39;m asking is whether the US is more religious or evangelical than the other developed/Western countries? And if so, why.</p>\n</div><!-- SC_ON -->",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/piv8pd/do_americans_really_go_to_church_as_often_as/",
  "subreddit": "NoStupidQuestions",
  "id": "piv8pd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm from Australia and I've literally never heard anyone under the age of 60\ntalk about their \"church\".\n\nHowever, pretty much every episode of Forged in Fire I've watched, the\ncontestants always refer to their church in one form or another. Same with\npretty much every other tv show from the US. They…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はオーストラリア出身ですが、60歳以下の人が自分の「教会」について話すのを文字通り聞いたことがありません。\n自分の「教会」について話しているのを聞いたことがありません。\n\nしかし、私が見たForged in Fireのほとんどすべてのエピソードでは、出場者は常に何らかの形で自分の教会について言及していました。\nしかし、私が見たForged in Fireのほとんど全てのエピソードで、出場者は常に何らかの形で自分の教会について言及しています。同じように\nアメリカの他のテレビ番組でも同じです。彼らは...",
      "title": "アメリカ人は、ポピュラーカルチャーやメディア、Redditが示すように、本当に頻繁に教会に行っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我来自澳大利亚，我从来没有听说过60岁以下的人\n谈论他们的 \"教会\"。\n\n然而，在我看的几乎每一集《烈火锻造》中，参赛者总是用 \"教会 \"这个词来形容他们。\n参赛者总是以这样或那样的形式提到他们的教会。这与\n几乎所有其他来自美国的电视节目都是如此。他们...",
      "title": "美国人真的像流行文化、媒体和Reddit显示的那样经常去教堂吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我來自澳大利亞，我從來沒有聽說過60歲以下的人\n談論他們的 \"教會\"。\n\n然而，在我看的幾乎每一集《烈火鍛造》中，參賽者總是用 \"教會 \"這個詞來形容他們。\n參賽者總是以這樣或那樣的形式提到他們的教會。這與\n幾乎所有其他來自美國的電視節目都是如此。他們...",
      "title": "美國人真的像流行文化、媒體和Reddit顯示的那樣經常去教堂嗎？"
    }
  ]
}