{
  "author": "Siri-findwittynames",
  "original_created_utc": 1630072441,
  "title": "It's Always Sunny In Philadelphia: \"The Gang discovers Crypto\"",
  "created_utc": 1630093135,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Dennis</strong> - tries to create a new Shitcoin, probably something to do with breasts. Titcoin? Nipple? You get the picture. </p>\n\n<p><strong>Mac</strong> - acts like he understands what Crypto is in front of Dennis. &quot;So once we&#39;ve got enough of these bad boys, we trade them in for a rocket that&#39;ll take us to the moon? What the hell am I gonna do on the moon, Dennis...?&quot;</p>\n\n<p><strong>Frank</strong> - shills Dennis&#39;s Shitcoin and convinces people to put every penny into it for guaranteed success, including Rickety Cricket, who has finally started to get his life back together. </p>\n\n<p><strong>Dee</strong> - bird.</p>\n\n<p><strong>Charlie</strong> - believes people are giving all their money to computers and it&#39;s going to bring on an uprising of wealthy A.I. that want to take away our freedoms. He decides to take down the &#39;Hive&#39; from the inside by attending a Blockchain Expo, but ends up at a Sci-Fi Con and thinks he&#39;s too late. Retreats to the woods in an attempt to ride it out.</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks in advance for all the moons, Jebronis...</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/pcntaa/its_always_sunny_in_philadelphia_the_gang/",
  "subreddit": "CryptoCurrency",
  "id": "pcntaa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Dennis - tries to create a new Shitcoin, probably something to do with breasts.\nTitcoin? Nipple? You get the picture.\n\nMac - acts like he understands what Crypto is in front of Dennis. \"So once we've\ngot enough of these bad boys, we trade them in for a rocket that'll take us to\nthe moon? What the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "デニス - 新しいShitcoinを作ろうとしているが、おそらく胸に関係するものだろう。\nTitcoin？ニップル？写真を見てください。\n\nマック - デニスの前でCryptoの意味を理解しているように振る舞う。\"だから、この悪い子たちを十分に手に入れたら\n月に行けるロケットと交換するのか？\n月に行けるロケットと交換するのか？なんだよ...。",
      "title": "It's Always Sunny In Philadelphia」です。\"The Gang discover Crypto\""
    },
    {
      "locale": "zh",
      "the_new_excerpt": "丹尼斯--试图创造一个新的屎币，可能与乳房有关。\n泰特币？乳头？你会明白的。\n\n麦克--在丹尼斯面前表现得好像他明白什么是加密货币。\"所以一旦我们\n我们就把它们换成火箭，带我们去月球？\n月球？什么...",
      "title": "费城永远阳光》。\"该团伙发现了Crypto\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "丹尼斯--試圖創造一個新的屎幣，可能與乳房有關。\n泰特幣？乳頭？你會明白的。\n\n麥克--在丹尼斯面前表現得好像他明白什麼是加密貨幣。\"所以一旦我們\n我們就把它們換成火箭，帶我們去月球？\n月球？什麼...",
      "title": "費城永遠陽光》。\"該團伙發現了Crypto\""
    }
  ]
}