{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "**The Little Book of Common-Sense Investing**\n\n-\tBuffet – Newtons 4th law of motion. Investor return decrease as motion increases.\n-\tWinning Strategy for investing is to buy a fund that holds all market portfolio and hold it forever\n-\tThe index fund eliminates the risks of individual stocks, market sectors, and manager selection. Only stock market risk remains, which is large\n-\tThe returns earned by business are ultimately translated into the stock market\n-\tActive Investing is a zero-sum game, for every person that beats the market by 1% someone else lost by 1%.\n-\tThe stock market returns must equal the business returns over a long period. But this goes up and down in cycles. As investors are willing to pay higher or lower P/E.\n-\tInvestment yield on stocks (dividends plus dividend earnings growth) tracks with the total market return. About 9.5% for the last 100 years\n-\tReversions to the mean – Tendency for P/E ratios to return to their long-term norms over time.\n-\tEconomics controls the long-term stock market return. Emotions control the short term. Accurately predicting short term emotions is impossible\n-\tInvestors as a group must earn precisely the market return, BEFORE THE COSTS OF INVESTING ARE DEDUCTED – when we subtract all the fees, turnover, taxes, commissions, sales loads, advertising, and legal fees – the returns of investors will fall short of the market by precisely those costs. The lower these costs the better\n  - Assume the turnover costs equal 1% the turnover rate. IE - 100% turnover = 1%. 50% turnover = 0.5%\n-\tMost equity fund investors actually get lower returns than the funds they invest in.…. why? Counterproductive market timing and adverse fund selection. Most investors put money in as a fund is rising and pull money out as it is falling. Investors chase past performance.\n-\tAs the active fund does better, it has more inflows of cash which makes it difficult to maintain that advantage.\n-\tPicking a winner based on the past is hazardous duty\n-\tOver the long-term stocks have provided higher returns than bonds, so why own bonds?\n  - Bonds have beat stocks in 42 of the last 112 years\n\nAll About Asset Allocation\n\n- As a nation, we are not saving enough in retirement accounts to make up for diminishing Social Security benefits and other traditional sources of income\n  - It is unreliable to assume that managers who have beaten the market in the past will continue to do so over the long term\n- On any given year, the index fund will be beat by many active managed funds. But in the long run, the index fund will be at the top\n- Earnings Growth (Corporate Earnings or GDP) +Dividend (Yield)+Speculation (P/E ratio) = market return\n- In the short run, speculation creates the volatility in stock prices, but in the long term, economic growth is the real driver of returns. You can&amp;#39;t guess what P/E ratio the market will assign in the future so don&amp;#39;t try\n\nThe Investors Manifesto\n\n- Gordon&amp;#39;s Equation\n    - Expected return = dividend yield + dividend growth rate\n    - The average dividend growth rate for the U.S since 1870 has been about 1.5% per year. The US economy has grown at about 3% during this time. The difference can be explained by share dilution.\n    - This explains why some fast-growing emerging markets can actually be bad investments. If total share dilution is growing faster than they economy, you will have a negative return\n    - Don&amp;#39;t use past returns in your estimates. Use the Gordon equation.\n-\tHomes are NOT investments. At best you will get a real 1% return after factoring in maintenance, taxes, insurance, etc., and more likely 0%. It is a place to live and nothing more.\n-\tOne way to calculate a home&amp;#39;s fair market value is to take the estimated rental and multiply it by 150. Example - $2,500 rent x 150 = fair value of $375,000\n\n4 Pillars\n\nMath – Chapter 2\n\n-\tDR – Discount Rate – Amount we expect to get from the market. IE 8% Return\n-\tTwo times this century, investors have demanded a 15% DR.\n-\tHigh DR = high perceived risk, high returns, depressed stock price\n-\tLow DR = low perceived risk, low returns, elevated stock price\n-\tPV – Present Value\n-\tDR and PV are inversely related. Higher DR = Lower PV or Lower DR = Higher PV\n-\tThe risker the situation, the higher the DR we demand, and the less that asset is worth to us\n-\tFood companies DR is lower because their earnings/dividends are more stable. Compare this to the DR of an auto company who has a higher DR because their earnings are more erratic. This is why cyclical companies with erratic earnings sell cheaper than say food companies\n-\tIt is impossible to do this with a single security. Because if the company falters, then your math will be off. But for the market as a whole. It will work because it evens out. The income stream of the market as a whole is more reliable. You can also use this formula in reverse.\n  - Fisher&amp;#39;s Dividend Discount Method (DDM) - Market Value = Present Dividend / (DR - Dividend Growth Rate)\n-\tHistoric DGR is 4.5 - 5%\n-\tThe above equation does not predict the short-term future. You can make it say whatever you want. One book even predicted a 36,000 Dow based on this formula in 2000\n-\tGordon Equation – As close to financial law as you can get. Accurate way to predict long term stock returns (20-30 Years)\n  - DR (Market Return) = Dividend Yield + Earnings Growth\n-\tThis formula has been extremely accurate. It predicted a 9% (4.5% Yield + 4.5% Growth) growth the last century and the actual growth was 9.89%.\n-\tIf a company doesn&amp;#39;t pay dividends, their long-term return would roughly be the same as their aggregate earnings growth. IE – 10% earnings growth would get 10% return. But the long-term average corporate earnings and dividends growth is 5% and has not changed in 100 years.\n-\tRemember, if the average annualized earnings growth is about 5%, the annualized stock price increase must be very close to this number. Unless they are buying shares or selling shares. Then the growth rate will increase or decrease by that amount. IE – company has 5% growth and bought back 5% of outstanding shares = 10% growth. Or company has 5% growth and sells 5% of outstanding shares = 0% growth. But for the market as a whole, this evens out.\n-\tGordon Equation works with bonds too. You just put the DGR at 0. Market Return = Dividend Yield\n-\tOver short periods (less than 20 years) changes in the dividend yield or PE multiple account for most of the stock markets return. This is the &amp;quot;speculative return&amp;quot; of the market. The short-term return of the market is purely speculative and cannot be predicted.\n-\tLong term increases in the stock market value is entirely the result of long term dividend growth and dividend yield calculated from the Gordon Equation or &amp;quot;fundamental return&amp;quot; of the market\n-\tRalph Wanger analogy of the market = The market is a very excitable dog on a very long leash in NYC, darting randomly in every direction. The dog&amp;#39;s owner is walking from Columbus Circle, through Central Park, to the Met. At any moment, the is no predicting which way the dog will lurch. But in the long run, you know he is headed Northeast at 3 mph. The problem is that almost all of the market players have their eye on the dog and not the owner.\n-\tIf public confidence is low, DR will rise and asset prices will fall, which will increase subsequent returns. The opposite is also true. This means the worst possible time to invest is when the skies are the clearest. The best possible time to invest is when the skies are darkest. You are going to be investing against the grain if you want good returns.\n-\tDR seems quite sensitive to prior stock market returns. This means a rising stock market lowers DR and perceived risks which drives up prices. Then you get the vicious cycle. The same thing happens in reverse during recessions/depressions.\n-\tThe immediate past is not predictive of the future\n-\tAsset classes have a tendency to revert to their mean over periods longer than 3 years\n-\tMean revision means that periods of relatively good performance tend to be followed by periods of relatively poor performance. The opposite is also true. But this is not a sure thing.\n-\t1993 Fuller study showed that popular growth stocks with high P/E ratios increased their earnings 10% faster than the market in year 1, 3% faster in year 2, 2% faster in year 3 and 4 and 1% in years 5 and 6. Eventually their high P/E ratios come down and with it their returns. In other words, you can expect a growth stock to increase its earnings, on average, about 20% more than the market over 6 years.\n-\tExample of above – and why you don&amp;#39;t invest in growth stocks\n  - Smokestack has a P/E of 20 and Glamour has a P/E of 80\n    - For every $100 of Smokestack stock it earns $5. 100/20 = 5\n    - For every $100 of Glamour stock it earns $1.25. 100/80 = 1.25\n    - If SS grows its earnings at 6% for 6 years it will increase earnings by 48% from $5 per share to $7.40 per share\n    - If Glamour grows is earnings 20% faster than the market over 6 years. It will increase earnings by 78%. 1.48 x 1.20 = 1.78. So, its earnings will grow from $1.25 to $2.23. After that it will have the same earnings growth as SS. The market will see the earnings slowing down and clobber its shareholders\n-\tThere are no patterns to the market. You can&amp;#39;t predict them. Just because the market behaved a certain way one time doesn&amp;#39;t mean it will repeat\n-\tIf history did repeat itself, the wealthiest investors would be librarians\n-\tThere are some pieces of data that have worth. Like housing starts or the length of the average industrial working week. The problem is that everyone knows this information too and it is already being factored into the stock and bond prices. Something that everyone knows isn&amp;#39;t worth knowing yourself.\n\nRational Expectations\n\n- Irving Fisher noted that the value of any investment was simply the stream of future dividends, discounted by the risk adjusted expected rate of return\n  1. Return = Current dividend yield + historical dividend growth rate\n  2. R = Yield + G\n- For the last 150 years, after inflation (Real) dividend growth is about 1.5%\n- If dividend on the S+P 500 is 2% for example then add the real dividend growth rate of 1.5% = 3.5% expected real return\n- This is what Vanguard founder John Bogle called the fundamental return of the market.\n- The other part of the return is the &amp;quot;speculative return&amp;quot;\n  1. Return = Dividend yield + Growth + Speculative return\n  2. &amp;quot;Speculative Return&amp;quot; is due to change in short term valuations of stocks (P/E&amp;#39;s, etc.)\n- Over short periods, the speculative returns are the driver of stock returns. But over long terms, it is the fundamental return that is key.\n- Your job as an investor is to (as best you can) ignore the speculative return (Short Term) in order to earn the fundamental return (Long Term)\n- No one knows what the speculative return will be and if they did, they wouldn&amp;#39;t tell anyone\n- Shiller&amp;#39;s CAPE 10 ratio is another great way to estimate returns\n- The fair value CAPE 10 ratio is probably about 20. Up from its historic 16.5\n- Just like the P/E average is around 20, up from its historic 15.\n- A rebalancing bonus can among stock asset classes can be viewed as a kind of risk premium for betting that stock asset classes will revert to the mean and produce similar long-term returns\n- In other words, Asset class returns tend to revert to the mean or there would be no rebalancing bonus\n\nIAA\n\n- The best way to estimate future stock returns is the DDM (Dividend Discount Method)\n  - Return = Dividend Yield + Dividend Growth Rate + Multiple Change\n    - Dividend yield is the yield on the investment (Example – 2020 S+P 500 yield is 1.5%). The Dividend growth rate is historically 5%. And the Multiple change refers to the increase or decrease in the overall P/E ratio.\n    - The Dividend yield and dividend growth rate is the fundamental return (easy to estimate). The Multiple change is the speculative return (impossible to estimate).\n- An optimizer will heavily favor those assets with high historical or assumed returns. This is a problem because asset returns have a tendency to &amp;quot;mean revert&amp;quot;.\n  - Don&amp;#39;t use an optimizer to try to develop an asset allocation. We can&amp;#39;t predict returns, standard deviations, or correlations accurately enough. And if we could, we wouldn&amp;#39;t need one anyway.\n    - And optimizing historic returns is a one-way ticket to the poor house\n- A well-diversified portfolio is not a free lunch. It does not come anywhere near eliminating risk. You will still suffer loss from time to time\n  - The benefit is also psychological because you are getting into the habit of buying low and selling high. Thus, profiting by moving in the opposite direction of the market\n- Stocks outperform almost all other assets in the long run because you are buying a piece of our almost constantly growing economy\n  - But then investors make the mistake of thinking the most profitable stocks to own must be those of the most rapidly growing companies (Growth Stocks)\n- Long term returns are usually higher when valuations are cheap and lower when they are expensive\n- Paul Miller did the first study on cheap stocks called the Dow P/E strategy. He examined buying the 10 lowest P/E stocks in the Dow from 1936-1964 and discovered that the lowest P/E stocks (those everyone hates) actually outperformed the market and the highest P/E stocks (those everyone loves) greatly underperformed\n\n- Dividend Discount Method (DDM) formulated by John Burr Williams in 1938 was formulated by a simple idea. Since all companies eventually go bankrupt, the value of a stock, bond or the entire market is simply the value of all its future dividends discounted to the present.\n  - And since a dollar in the future is worth less than a dollar today, its value must be reduced or discounted to reflect the fact you won&amp;#39;t receive it today.\n    - The reduction is called the Discount Rate (DR)\n      - The DR is determined by the cost of money (Risk Free Rate) plus the risk to the lender\n        - Safer investments have a lower DR and risker investments a higher DR\n      - DR can also be thought of as the expected return of the asset\n        - Lower risks = lower DR = Lower expected return/Higher Present Value\n        - Higher risks = higher DR = Higher expected return/Lower Present Value\n      - Formula – Reasonable Price = (Annual Dividend Amount)/(DR – Dividend Growth Rate)\n        - But you can make this formula say anything you want depending on your inputs. So be careful with this formula\n\nAsset Allocation\n\n- A research firm did an analysis on inflows and outflows (1986-2005) from equity mutual fund investors, it showed that the average investor earned just 3.9% vs 11.9% for the S+P 500\n  - Why? Mostly due to chasing the performance of funds that had recently done well\n  - Investment return is far more dependent on investor behavior than on fund performance\n- Research studies repeatedly show that most money managers underperform the market\n  - Professionals populate the marketplace and by definition, the majority cannot outperform the average. And this will continue to be true\n- Some managers with superior skill do exist, the problem is they are rare and very difficult to identify conclusively\n- Modern Portfolio Theory considers each asset class not as an end in itself but rather as it stands in relationship to all others in the portfolio\n- No liquid investment alternative with stable guaranteed principal exist that can provide real returns by consistently beating the combined impact of inflation and taxes\n- Simple Average Return vs Compound Annual Return\n  - Example – If I invest $100 and I get a 25% return year 1 and a -20% return in year 2.\n    - Simple average return (Arithmetic return) is 2.5%. 25%-20%/2 = 2.5%\n    - Compound Annual Return (Geometric return) - $100 x 25% = $125 x -20% = $100 or 0%\n      - For any series of returns, the simple average return will ALWAYS be higher or equal to the compound annual return\n      - The difference between the simple average and compound annual is larger for highly volatile returns.\n      - Only in a situation where returns are consistent will the returns be equal\n        - The reason in the disparity is that it requires a larger percentage of above average performance to offset a given percentage of below average performance\n          - Simple average is ok to use in a single period\n          - Compound return is more appropriate to use when comparing returns over multiple periods\n- You should be concerned not only about an asset class historical return but also about the dispersion of those returns and the likelihood that future returns will be higher or lower than past returns\n  - People often anchor their return expectation to an investments long term historical return. The average return could be an unlikely result\n- The TIPS spread provides a market-concensus forecast of future inflation\n  - Equal to the difference between the yield to maturity of a conventional treasury bond and the yield to maturity of a similar TIPS bond\n- The median normalized P/E ratio for 1926-2011 is 16.45\n  - Higher current P/E ratios signal lower future returns\n  - Lower current P/E ratios signal higher future returns\n  - But there is a range to these outcomes\n  - P/E ratio and 10-year returns following\n    - Below 9 = Average 15.09%\n    - 9-11 = Average 15.40%\n    - 11-14 = Average 12.99%\n    - 14-18 = Average 10.9%\n    - 18-25 = Average 6.46%\n    - 25+ = Average 3.07%\n      - Range was -1% on the low to 6% on the high\n- Market timing doesn&amp;#39;t exist, but people want to believe it is possible\n- Over 11 cycles post WWII\n  - Median bull market was up 79%, bear market was down 28%\n  - Median bull market lasted 2.5x as long as the median bear market\n- A study by Robert Jeffrey concluded: No one can predict the market&amp;#39;s ups and downs over a long period, and the risks of trying outweigh the rewards\n  - Most of the &amp;quot;positive action&amp;quot; in stocks in compressed into just a few periods, which (perversely but understandably) tend to follow particularly adverse times for stocks\n- Much of the problem with market timing is that a disproportionate % of the total gain from a bull market tends to occur very rapidly at the beginning of a market recovery\n- Percent you must be right to make marking timing a viable strategy\n  - 80% bull and 50% bear\n  - 70% bull and 80% bear\n  - 60% bull and 90% bear\n- Do not invest in stocks unless you are in it for the long run\n- Most people do not think in terms of expected returns and standard deviation.\n  - They think in terms of the chance of loss\n- For any series of returns, the larger the standard deviation, the more the compound annual returns (geometric) drop below the simple average return\n  - Volatility therefore impairs the compounding of returns\n  - If I have 2 investments, both with the same 10% simple average return and one has a higher standard deviation than the other, the investment with the higher standard deviation will have a lower compound annual return.\n- An ideal investment would be inversely correlated assets with similar returns. But they don&amp;#39;t exist in real life.\n  - If you had 2 investments with 10% simple average return and a negative correlation, the compound annual return would be 10% also.\n    - This doesn&amp;#39;t exist though in real life; it would be too good to be true\n- Most investments in real life that have similar return patterns have a slightly positive correlation to each other. Although differing in degree, most financial classes are positively correlated to each other\n  - If you have 2 portfolios with the same 10% simple average return, the one with the lower volatility will have the higher compound annual return.\n- Having assets with similar return profiles and slightly positive correlations will reduce standard deviation and therefore improve the compound annual return of the portfolio. Even if the correlation is just mostly or slightly positive, it still provides a benefit\n- Historic data is helpful in understanding asset class volatility and return characteristics and relationships. But precise answers to future portfolio AA decisions simply are not possible. The perfect AA is not possible except in retrospect\n- A portfolio that minimizes portfolio volatility for a given expected return or maximizes portfolio expected return for a given level of risk is said to be efficient\n\nA Random Walk Down Wall Street\n\n- Technical analyst looks at charts and patterns (They don&amp;#39;t exist). They believe the market is 10% logical and 90% psychological and attempt to beat the crowd with their picks. Does not work.\n- Fundamental analyst believe that the market is 90% logical and 10% psychological. Caring little for patterns and past price movements. Fundamentalists seek to determine a stocks proper value. Value applies to assets, growth rates, earnings and dividends, interest rate, and risks. They believe that the company&amp;#39;s price will eventually reflect its real worth\n- God Almighty does not know the proper P/E multiple for a common stock\n- The history of stock price movement contains no useful information that will enable an investor to consistently to outperform a buy and hold strategy\n- Technical analysis strategies are usually amusing, often comforting, but of no real value\n- The past history of stock prices cannot be used to predict the future in any meaningful way\n- Technical analysis enriches people marketing them, not investors\n- The idea is simple, if past prices contain little to no useful information for the prediction of future prices, there is no point in following any technical trading rule for the timing of purchases or sales. A simple policy of buying and holding will be at least as good as any technical procedure. Also, buying and selling short term generate taxable events, brokerage charges, and spreads that decrease returns\n- Analysts&amp;#39; recommendations are tainted by very profitable investment banking relationships\n- Brad Barber studied the performance of the &amp;quot;strong buy&amp;quot; recommendations and found the results were terrible\n- Systemic Risk AKA &amp;quot;Market Risk&amp;quot; – arises from the basic variability of stock prices in general and the tendency for all stocks to go along with the general market, at least to some extent. Cannot be eliminated by diversification\n- Unsystematic Risk – results from factors peculiar to that specific company. IE – strikes, new products, management, etc. This can be eliminated through adequate diversification. With as few as 60 stocks.\n- Beta – relative volatility or sensitivity to market moves\n  - Numerical description of systemic risk\n  - It is a comparison between the movements of an individual stock or portfolio and the movements of the market as a whole\n  - IE – the total stock market has a Beta of 1. If a stock has a Beta of 2. It will move up or down 2x as much as the total market. +-10% change in the total market would mean a +-20% change for the stock. Beta of 0.5 would be +-5%\n- Investors will not be paid for bearing risks that can be diversified away. The is the logic behind the capital asset pricing model\n- As the systemic risk (Beta) of an individual portfolio increases, so does the return an investor can expect\n- Beta isn&amp;#39;t the end all be all though. Fama and French did a study in 1992 that discovered that there was no relationship between returns for portfolios and their beta measures. It is not a useful single measure to capture the relationship between risk and return\n- It appears that the only way to obtain higher long-run investment returns is to accept greater risks\n- Unfortunately, a perfect risk measure doesn&amp;#39;t exist. Beta and rate of return has not corresponded to the relationship predicted in theory. Beta can also change.\n- In the short run, change in valuations can have a major role in determining returns. IE – P/E&amp;#39;s and Dividend yields\n- P/E have varied widely. During the early 2000&amp;#39;s with high optimism, the P/E&amp;#39;s were about 30. During 1982 stocks sold at only a P/E of 8\n- P/E go up with lower interest rates and go down with higher interest rates because now equities have to compete with bonds\n\nStocks for the Long Run\n\n- Real stock returns in the 19th century do not differ appreciably from the real returns in the 20th century\n- Stocks fluctuate both below and above the trendline but eventually return to the trend. AKA mean reversion. This means that periods of above average returns tend to be followed by periods of below average returns and vice versa\n- In the short run, stock returns are very volatile driven by changes in earnings, interest rates, risk, uncertainty and psychological factors\n- The stock market has real annualized returns of 6.7% from 1802-1870, 6.6% from 1871-1925, and 6.4% from 1926-2012. This is remarkable constancy\n- As stable as the long-term returns for equities have been, the same cannot be said of fixed-income investments. Real returns on treasures were 5.1% in the early 19th century to a bare 0.6% since 1926, only slightly above inflation\n- Real return on bonds have shown a similar but more moderate decline as fixed-income. 4.8% in the first period to 3.7% in the 2nd period and now only 2.6% in the current period.\n- The excess return of stocks over bonds is referred to as the equity risk premium.\n- Subtracting stock and bond returns from equity shows that the premium has averaged 3% against bonds and 3.9% over treasury bills over the last 200 years.\n- 19 countries were analyzed from 1900-2012 and it was determined that the US experience of equites outperforming bonds and bills has been mirrored in all countries examined. Every country achieved equity performance that was better than bonds.\n- While the US and UK have performed well, that is no indication that they are out of line with other countries. Therefore, studies on the US market results have relevance to all investors in all countries\n- Swings in investor sentiment from political or economic crisis can throw stocks off their long-term path, but the fundamental forces producing economic growth have always enabled equities to regain their long-term trend\n- Correlations between asset classes can and do change over time\n- During 20 year holding periods, stock have never fallen below inflation. Bond and treasury bills have lagged by as much as 3% below inflation\n- The worst 30-year timeframe since 1802 stocks beat inflation by 2.6%.\n- As the holding period increases, the odds that stocks will beat bonds or bills increase drastically\n- On any given 2-year cycle, there is a 33% chance bonds or bills will beat stocks\n- Under a paper money standard, bad economic times are more likely to be associated with inflation, not deflation like the 1930&amp;#39;s. Under these circumstances, stock and bond prices tend to be more correlated. Thereby reducing the diversifying qualities of government bonds\n- Because of this it is unlikely that bonds will remain a good long-term diversifier, especially if inflation looms once again\n- Real returns (post tax) since 1913 (income tax enacted) have ranged from 6.1%-2.7% on stocks, 2.2% to -0.3% for bonds and bills having a 0.4% to -2.3%\n- Taxes have the greatest impact on fixed income investments\n- Since 1871, for someone in the highest tax bracket, short term treasury bills have had a negative real return after tax\n- The inflation tax hits harder when the holding period is shorter. The more you buy and sell, the more frequently the government can tax the gains, which might not be real after inflation\n- P/E ratio is the ratio of a stock&amp;#39;s price to its earnings. The average P/E is 15 from 1871-2012\n- Earnings yield is important also. It measures the earnings generated per dollar of stock market value. IE – if the P/E of the market is 15 means the earnings yield is 1/15 or 6.67% which is historically accurate long-term rate of return on stocks. This is not a coincidence. If the P/E went to 20 it would be 1/20 or 5%.\n- But there have been changes in the economy and markets that may rise the average P/E in the future. These changes include a decrease in the cost of investing in indexes, a lower discount rate, and an increase in knowledge about the advantages of equity vs fixed income investing.\n- There are many reasons for a decline in real returns available to investors. Whatever the reasons, such a decline implies that the real return on equity need not be as high as it had historically been to attract investors. The historic equity risk premium was 3-3.5%. If we assume the long-run real rate is somewhere around 2%, then a 3% equity premium will require a 5% real return on stocks, which, gives us an average P/E of 20. 1/20 = 5%\n- Transaction costs have come down and this has led to a higher P/E ratio than in the past\n- The equity risk premium also itself may have shrunk. There is considerable truth in the statement that widespread knowledge of the profitability of common stocks, gained from the studies that have been made, tends to diminish the likelihood that correspondingly large profits can be gained from stocks in the future. The competitive bidding for stocks causes prices at the time of purchase to be high\n- Investors are drawn to firms able to generate high earnings and revenue growth. But empirical data shows this pursuit of growth often leads to subpar returns. IE – IBM vs Exxon 1950-2012. Exxon was a better investment\n- Financial theory has shown that if capital markets are &amp;quot;efficient&amp;quot; in the sense that known valuation criteria, such as earnings, dividends, cash flows, book values, and other factors are already factored into the security price, investing on the basis of these fundamentals will not improve returns.\n- In an efficient market, the only way investors can consistently earn higher returns is to undertake higher risk, where risk is defined as the correlation of an asset&amp;#39;s return with the overall stock market. This was the basis for the Capital Asset Pricing Model (CAPM) or Beta\n- Beta and CAPM was the primary basis for stock returns in the 1970&amp;#39;s and 1980&amp;#39;s. Unfortunately, beta and CAPM did not prove effective in explaining the differences in returns among individual stocks\n- Don&amp;#39;t use Beta to try to buy stocks, it doesn&amp;#39;t work\n- Fama and French wrote an article that showed there are 2 factors (size and value) that are far more important in determining a stock return that the beta of a stock\n- Although the historical return on small stocks has outpaced large stocks since 1926, the magnitude of small cap outperformance has waxed and waned unpredictably.\n- The existence of a small-cap premium does not mean they will outperform large stock every year or even every decade. They have lost to large cap for more than a decade before.\n- F+F also determined that value played a role in returns. Stocks with low prices relative to their fundamentals are value stocks. Stocks with high prices relative to their fundamentals are growth stocks\n- In 1978 Ramaswamy and Litzenberger established a significant correlation between dividend yield and subsequent return. O&amp;#39;Shaughnessy has shown that in the period of 1951-1994, the 50 highest dividend yielding large cap stocks had a return that was 1.7% higher than the market\n- Basu did some studies in the 1960&amp;#39;s that showed that stocks with lower P/E ratios have significantly higher returns than stocks with high P/E ratios, even after accounting for risks\n- Graham wrote in Security Analysis (1940) that people who habitually pay more than 16x average earnings are likely to lose considerable money in the long run\n- P/B ratio is a good ratio but there are conceptual problems with using book value as a value criterion. It does not correct for changes in the market value of assets, not does it capitalize R+D expenditures. From 1987-2012 the author determined that book value underperformed either dividend yields or P/E ratios in explaining returns\n- The worst course an investor can take is to follow the prevailing sentiment about economic activity. That will lead investors to buy at high prices when times are good and everyone is optimistic and sell at the low\n- Since 1885, there have been 145 days where the market moved 5% or more. Only ¼ of those days can be attributed to an event. This confirms the unpredictability of the market and the difficulty in forecasting moves\n- News moves markets. But the timing of much news is unpredictable, like wars, political developments, and natural disasters\n- Markets do not directly respond to what is announced, rather, they respond to the difference between what the traders expect to happen and what actually happens. The market already incorporates all the information that was expected\n- For example – a strong economic report can send stocks down. Why? Because even though the news is good for main street and corporate earnings, it can mean the federal reserve will raise interest rates, which raises the discount rate at which these future profits are discounted\n- The opposite can also happen. A weak report can send stocks higher as interest rates decline\n- A lower than expected inflation report lowers interest rates and boosts bond and stock prices. Inflation worse than expected raises interest rates and depress stock and bond prices\n- Although fascinating to observe and understand a market&amp;#39;s reaction, investing on the basis of data releases (CPI, unemployment, etc.) is a tricky game and best left to speculators. Most investors will do well to watch from the sidelines and stick to a long-term investment strategy.\n- From 1971-2012, the average U.S. equity active mutual fund returned 1% below the Wilshire 5000 index and 0.88% below the S&amp;amp;P 500 index.\n- Very few active managed mutual funds beat the index and the odds of you picking on early are low. Good money managers are extremely difficult to identify as luck plays a role in all successful investment outcomes\n- The generally poor performance of active mutual funds is not because the fund managers pick losing stocks. It is because of the fees and trading costs\n- Contrary to their oft articulated goal of outperforming the market averages, investment managers are not beating the market; the market is beating them\n- Investing $1000 with a compound return of 11% will accumulate 23,000 in 30 years. A 1% fee will reduce this number by 1/3. A 3% fee will reduce it to just over 10,000. The fees add up.\n- In the 1990&amp;#39;s passive investing took off. Indexing has low fees. Most investors are better off in a capitalization weighted index fund\n- Indexing also has a problem in that when a company is announced it will be added to an index, the price usually goes up forcing the index to have to pay inflated prices\n\nWinning the Losers Game\n\n- Investment managers are not beating the market, the market is beating them\n  - Over 1 year, 70% of professionals underperform their benchmarks\n  - Over 10 years, 80%\n  - Over 15 years, 90%\n- Yes, some professional money managers will beat the market in any given year. But most will not over the long term and there is no reliable way to figure out who would be in that 10% that outperforms ahead of time\n- Investment professionals daily trading volume by decade\n  - 10% in the 1960&amp;#39;s to over 90% currently.\n- This is why it is so difficult for active managers to beat the market\n- Understanding the outlook for the near term is easy as J.P Morgan said, &amp;quot;It will fluctuate.&amp;quot;\n- One way to be realistic about future returns is to assume that future range of P/E multiples and corporate profits will be within their historical upper and lower limits and will appear with frequency at values close to the long-term average\n- Investors almost always project recent past market and economic behavior out into the future, somehow expecting more of the same to continue\n  - Math example – If dividends are at 1.5% and corporate earnings are growing at 4.5% (Historical Average), then a composite of 6% return is reasonable. This is the fundamental rate of return the investor can expect from the market\n  - Then you add or subtract the changes in P/E over that time frame. The average P/E in recent decades has been about 15.5. This is the speculative return component\n- Predicting the market roughly is not hard, but predicting it accurately is impossible\n  - Predicting where the market will be in the long run is not hard, but even estimating how it will move in the next few months is impossible and pointless\n\nOne up on Wall Street\n\n- If the company insiders are buying, you should too. Management normally sells 2.3 shares for every 1 share they buy. In 1987 after the crash, it was 4 buys for 1 sell\n- Avoid the hottest stock in the hottest industry, any stock being touted as the next X\n- A share of stock is NOT a lotto ticket. It is a part ownership of a business\n- P/E ratio can be thought of as the number of years to earn back your original investment. IE = P/E of 10 would be 10 years assuming earnings stay constant. Ratios tend to be lower for slow growers and highest for the fast growers with cyclicals in between depending on the current cycle.\n- Look at average P/E ratios on the company you are researching and peers going back several years to determine if it is a good buy\n- Avoid stocks with HIGH P/E ratios. They must have incredible earnings growth to justify the price\n- P/E ratio that is half the growth rate (annual earnings) is very positive and one that is twice the growth rate is very negative. IE = P/E of 10 should be growing at 10%\n- Formula = Growth rate plus dividend yield divided by P/E. IE = 12% growth + 3% yield/10 P/E = 1.5. Less than 1 is bad. 1.5 is ok and 2+ is great.\n- The stock market as a whole has its own collective P/E ratio, which is a good indicator of weather the market at large is over or under valued. If some stocks are selling at inflated prices relative to earnings, then it could be likely most stocks are selling at inflated prices.\n- Interest rates have a large effect on p/e ratios as investors pay higher p/e when interest rates are lower and bonds less attractive\n- Dividend paying stocks keep the stock price from falling as far as if there was no dividend\n\nHow to Calculate Estimated Returns\n\nhttp://www.efficientfrontier.com/ef/403/fairy.htm\n\nJunk Bond Math\n\nhttp://www.efficientfrontier.com/ef/401/junk.htm\n\nLarry Swedroe Book Summaries\n\nhttps://www.reddit.com/r/Bogleheads/comments/sdqtl7/larry_swedroe_the_incredible_shrinking_alpha/\n\nhttps://www.reddit.com/r/Bogleheads/comments/sdqrf0/larry_swedroe_the_only_guide_to_alternative/\n\nMy Summaries and FAQ\n\nhttps://www.reddit.com/user/captmorgan50/comments/rnftyk/book_summaries/",
  "author_fullname": "t2_6ucr2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Investor Math and Statistics",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_tq0ii9",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.88,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 154,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Articles &amp; Resources",
  "can_mod_post": false,
  "score": 154,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1648441971,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1648439239,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;The Little Book of Common-Sense Investing&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;  Buffet – Newtons 4th law of motion. Investor return decrease as motion increases.&lt;/li&gt;\n&lt;li&gt;  Winning Strategy for investing is to buy a fund that holds all market portfolio and hold it forever&lt;/li&gt;\n&lt;li&gt;  The index fund eliminates the risks of individual stocks, market sectors, and manager selection. Only stock market risk remains, which is large&lt;/li&gt;\n&lt;li&gt;  The returns earned by business are ultimately translated into the stock market&lt;/li&gt;\n&lt;li&gt;  Active Investing is a zero-sum game, for every person that beats the market by 1% someone else lost by 1%.&lt;/li&gt;\n&lt;li&gt;  The stock market returns must equal the business returns over a long period. But this goes up and down in cycles. As investors are willing to pay higher or lower P/E.&lt;/li&gt;\n&lt;li&gt;  Investment yield on stocks (dividends plus dividend earnings growth) tracks with the total market return. About 9.5% for the last 100 years&lt;/li&gt;\n&lt;li&gt;  Reversions to the mean – Tendency for P/E ratios to return to their long-term norms over time.&lt;/li&gt;\n&lt;li&gt;  Economics controls the long-term stock market return. Emotions control the short term. Accurately predicting short term emotions is impossible&lt;/li&gt;\n&lt;li&gt;  Investors as a group must earn precisely the market return, BEFORE THE COSTS OF INVESTING ARE DEDUCTED – when we subtract all the fees, turnover, taxes, commissions, sales loads, advertising, and legal fees – the returns of investors will fall short of the market by precisely those costs. The lower these costs the better\n\n&lt;ul&gt;\n&lt;li&gt;Assume the turnover costs equal 1% the turnover rate. IE - 100% turnover = 1%. 50% turnover = 0.5%&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Most equity fund investors actually get lower returns than the funds they invest in.…. why? Counterproductive market timing and adverse fund selection. Most investors put money in as a fund is rising and pull money out as it is falling. Investors chase past performance.&lt;/li&gt;\n&lt;li&gt;  As the active fund does better, it has more inflows of cash which makes it difficult to maintain that advantage.&lt;/li&gt;\n&lt;li&gt;  Picking a winner based on the past is hazardous duty&lt;/li&gt;\n&lt;li&gt;  Over the long-term stocks have provided higher returns than bonds, so why own bonds?\n\n&lt;ul&gt;\n&lt;li&gt;Bonds have beat stocks in 42 of the last 112 years&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;All About Asset Allocation&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;As a nation, we are not saving enough in retirement accounts to make up for diminishing Social Security benefits and other traditional sources of income\n\n&lt;ul&gt;\n&lt;li&gt;It is unreliable to assume that managers who have beaten the market in the past will continue to do so over the long term&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;On any given year, the index fund will be beat by many active managed funds. But in the long run, the index fund will be at the top&lt;/li&gt;\n&lt;li&gt;Earnings Growth (Corporate Earnings or GDP) +Dividend (Yield)+Speculation (P/E ratio) = market return&lt;/li&gt;\n&lt;li&gt;In the short run, speculation creates the volatility in stock prices, but in the long term, economic growth is the real driver of returns. You can&amp;#39;t guess what P/E ratio the market will assign in the future so don&amp;#39;t try&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The Investors Manifesto&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Gordon&amp;#39;s Equation\n\n&lt;ul&gt;\n&lt;li&gt;Expected return = dividend yield + dividend growth rate&lt;/li&gt;\n&lt;li&gt;The average dividend growth rate for the U.S since 1870 has been about 1.5% per year. The US economy has grown at about 3% during this time. The difference can be explained by share dilution.&lt;/li&gt;\n&lt;li&gt;This explains why some fast-growing emerging markets can actually be bad investments. If total share dilution is growing faster than they economy, you will have a negative return&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t use past returns in your estimates. Use the Gordon equation.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Homes are NOT investments. At best you will get a real 1% return after factoring in maintenance, taxes, insurance, etc., and more likely 0%. It is a place to live and nothing more.&lt;/li&gt;\n&lt;li&gt;  One way to calculate a home&amp;#39;s fair market value is to take the estimated rental and multiply it by 150. Example - $2,500 rent x 150 = fair value of $375,000&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;4 Pillars&lt;/p&gt;\n\n&lt;p&gt;Math – Chapter 2&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;  DR – Discount Rate – Amount we expect to get from the market. IE 8% Return&lt;/li&gt;\n&lt;li&gt;  Two times this century, investors have demanded a 15% DR.&lt;/li&gt;\n&lt;li&gt;  High DR = high perceived risk, high returns, depressed stock price&lt;/li&gt;\n&lt;li&gt;  Low DR = low perceived risk, low returns, elevated stock price&lt;/li&gt;\n&lt;li&gt;  PV – Present Value&lt;/li&gt;\n&lt;li&gt;  DR and PV are inversely related. Higher DR = Lower PV or Lower DR = Higher PV&lt;/li&gt;\n&lt;li&gt;  The risker the situation, the higher the DR we demand, and the less that asset is worth to us&lt;/li&gt;\n&lt;li&gt;  Food companies DR is lower because their earnings/dividends are more stable. Compare this to the DR of an auto company who has a higher DR because their earnings are more erratic. This is why cyclical companies with erratic earnings sell cheaper than say food companies&lt;/li&gt;\n&lt;li&gt;  It is impossible to do this with a single security. Because if the company falters, then your math will be off. But for the market as a whole. It will work because it evens out. The income stream of the market as a whole is more reliable. You can also use this formula in reverse.\n\n&lt;ul&gt;\n&lt;li&gt;Fisher&amp;#39;s Dividend Discount Method (DDM) - Market Value = Present Dividend / (DR - Dividend Growth Rate)&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  Historic DGR is 4.5 - 5%&lt;/li&gt;\n&lt;li&gt;  The above equation does not predict the short-term future. You can make it say whatever you want. One book even predicted a 36,000 Dow based on this formula in 2000&lt;/li&gt;\n&lt;li&gt;  Gordon Equation – As close to financial law as you can get. Accurate way to predict long term stock returns (20-30 Years)\n\n&lt;ul&gt;\n&lt;li&gt;DR (Market Return) = Dividend Yield + Earnings Growth&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  This formula has been extremely accurate. It predicted a 9% (4.5% Yield + 4.5% Growth) growth the last century and the actual growth was 9.89%.&lt;/li&gt;\n&lt;li&gt;  If a company doesn&amp;#39;t pay dividends, their long-term return would roughly be the same as their aggregate earnings growth. IE – 10% earnings growth would get 10% return. But the long-term average corporate earnings and dividends growth is 5% and has not changed in 100 years.&lt;/li&gt;\n&lt;li&gt;  Remember, if the average annualized earnings growth is about 5%, the annualized stock price increase must be very close to this number. Unless they are buying shares or selling shares. Then the growth rate will increase or decrease by that amount. IE – company has 5% growth and bought back 5% of outstanding shares = 10% growth. Or company has 5% growth and sells 5% of outstanding shares = 0% growth. But for the market as a whole, this evens out.&lt;/li&gt;\n&lt;li&gt;  Gordon Equation works with bonds too. You just put the DGR at 0. Market Return = Dividend Yield&lt;/li&gt;\n&lt;li&gt;  Over short periods (less than 20 years) changes in the dividend yield or PE multiple account for most of the stock markets return. This is the &amp;quot;speculative return&amp;quot; of the market. The short-term return of the market is purely speculative and cannot be predicted.&lt;/li&gt;\n&lt;li&gt;  Long term increases in the stock market value is entirely the result of long term dividend growth and dividend yield calculated from the Gordon Equation or &amp;quot;fundamental return&amp;quot; of the market&lt;/li&gt;\n&lt;li&gt;  Ralph Wanger analogy of the market = The market is a very excitable dog on a very long leash in NYC, darting randomly in every direction. The dog&amp;#39;s owner is walking from Columbus Circle, through Central Park, to the Met. At any moment, the is no predicting which way the dog will lurch. But in the long run, you know he is headed Northeast at 3 mph. The problem is that almost all of the market players have their eye on the dog and not the owner.&lt;/li&gt;\n&lt;li&gt;  If public confidence is low, DR will rise and asset prices will fall, which will increase subsequent returns. The opposite is also true. This means the worst possible time to invest is when the skies are the clearest. The best possible time to invest is when the skies are darkest. You are going to be investing against the grain if you want good returns.&lt;/li&gt;\n&lt;li&gt;  DR seems quite sensitive to prior stock market returns. This means a rising stock market lowers DR and perceived risks which drives up prices. Then you get the vicious cycle. The same thing happens in reverse during recessions/depressions.&lt;/li&gt;\n&lt;li&gt;  The immediate past is not predictive of the future&lt;/li&gt;\n&lt;li&gt;  Asset classes have a tendency to revert to their mean over periods longer than 3 years&lt;/li&gt;\n&lt;li&gt;  Mean revision means that periods of relatively good performance tend to be followed by periods of relatively poor performance. The opposite is also true. But this is not a sure thing.&lt;/li&gt;\n&lt;li&gt;  1993 Fuller study showed that popular growth stocks with high P/E ratios increased their earnings 10% faster than the market in year 1, 3% faster in year 2, 2% faster in year 3 and 4 and 1% in years 5 and 6. Eventually their high P/E ratios come down and with it their returns. In other words, you can expect a growth stock to increase its earnings, on average, about 20% more than the market over 6 years.&lt;/li&gt;\n&lt;li&gt;  Example of above – and why you don&amp;#39;t invest in growth stocks\n\n&lt;ul&gt;\n&lt;li&gt;Smokestack has a P/E of 20 and Glamour has a P/E of 80&lt;/li&gt;\n&lt;li&gt;For every $100 of Smokestack stock it earns $5. 100/20 = 5&lt;/li&gt;\n&lt;li&gt;For every $100 of Glamour stock it earns $1.25. 100/80 = 1.25&lt;/li&gt;\n&lt;li&gt;If SS grows its earnings at 6% for 6 years it will increase earnings by 48% from $5 per share to $7.40 per share&lt;/li&gt;\n&lt;li&gt;If Glamour grows is earnings 20% faster than the market over 6 years. It will increase earnings by 78%. 1.48 x 1.20 = 1.78. So, its earnings will grow from $1.25 to $2.23. After that it will have the same earnings growth as SS. The market will see the earnings slowing down and clobber its shareholders&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;  There are no patterns to the market. You can&amp;#39;t predict them. Just because the market behaved a certain way one time doesn&amp;#39;t mean it will repeat&lt;/li&gt;\n&lt;li&gt;  If history did repeat itself, the wealthiest investors would be librarians&lt;/li&gt;\n&lt;li&gt;  There are some pieces of data that have worth. Like housing starts or the length of the average industrial working week. The problem is that everyone knows this information too and it is already being factored into the stock and bond prices. Something that everyone knows isn&amp;#39;t worth knowing yourself.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Rational Expectations&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Irving Fisher noted that the value of any investment was simply the stream of future dividends, discounted by the risk adjusted expected rate of return\n\n&lt;ol&gt;\n&lt;li&gt;Return = Current dividend yield + historical dividend growth rate&lt;/li&gt;\n&lt;li&gt;R = Yield + G&lt;/li&gt;\n&lt;/ol&gt;&lt;/li&gt;\n&lt;li&gt;For the last 150 years, after inflation (Real) dividend growth is about 1.5%&lt;/li&gt;\n&lt;li&gt;If dividend on the S+P 500 is 2% for example then add the real dividend growth rate of 1.5% = 3.5% expected real return&lt;/li&gt;\n&lt;li&gt;This is what Vanguard founder John Bogle called the fundamental return of the market.&lt;/li&gt;\n&lt;li&gt;The other part of the return is the &amp;quot;speculative return&amp;quot;\n\n&lt;ol&gt;\n&lt;li&gt;Return = Dividend yield + Growth + Speculative return&lt;/li&gt;\n&lt;li&gt;&amp;quot;Speculative Return&amp;quot; is due to change in short term valuations of stocks (P/E&amp;#39;s, etc.)&lt;/li&gt;\n&lt;/ol&gt;&lt;/li&gt;\n&lt;li&gt;Over short periods, the speculative returns are the driver of stock returns. But over long terms, it is the fundamental return that is key.&lt;/li&gt;\n&lt;li&gt;Your job as an investor is to (as best you can) ignore the speculative return (Short Term) in order to earn the fundamental return (Long Term)&lt;/li&gt;\n&lt;li&gt;No one knows what the speculative return will be and if they did, they wouldn&amp;#39;t tell anyone&lt;/li&gt;\n&lt;li&gt;Shiller&amp;#39;s CAPE 10 ratio is another great way to estimate returns&lt;/li&gt;\n&lt;li&gt;The fair value CAPE 10 ratio is probably about 20. Up from its historic 16.5&lt;/li&gt;\n&lt;li&gt;Just like the P/E average is around 20, up from its historic 15.&lt;/li&gt;\n&lt;li&gt;A rebalancing bonus can among stock asset classes can be viewed as a kind of risk premium for betting that stock asset classes will revert to the mean and produce similar long-term returns&lt;/li&gt;\n&lt;li&gt;In other words, Asset class returns tend to revert to the mean or there would be no rebalancing bonus&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;IAA&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The best way to estimate future stock returns is the DDM (Dividend Discount Method)\n\n&lt;ul&gt;\n&lt;li&gt;Return = Dividend Yield + Dividend Growth Rate + Multiple Change&lt;/li&gt;\n&lt;li&gt;Dividend yield is the yield on the investment (Example – 2020 S+P 500 yield is 1.5%). The Dividend growth rate is historically 5%. And the Multiple change refers to the increase or decrease in the overall P/E ratio.&lt;/li&gt;\n&lt;li&gt;The Dividend yield and dividend growth rate is the fundamental return (easy to estimate). The Multiple change is the speculative return (impossible to estimate).&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;An optimizer will heavily favor those assets with high historical or assumed returns. This is a problem because asset returns have a tendency to &amp;quot;mean revert&amp;quot;.\n\n&lt;ul&gt;\n&lt;li&gt;Don&amp;#39;t use an optimizer to try to develop an asset allocation. We can&amp;#39;t predict returns, standard deviations, or correlations accurately enough. And if we could, we wouldn&amp;#39;t need one anyway.&lt;/li&gt;\n&lt;li&gt;And optimizing historic returns is a one-way ticket to the poor house&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;A well-diversified portfolio is not a free lunch. It does not come anywhere near eliminating risk. You will still suffer loss from time to time\n\n&lt;ul&gt;\n&lt;li&gt;The benefit is also psychological because you are getting into the habit of buying low and selling high. Thus, profiting by moving in the opposite direction of the market&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Stocks outperform almost all other assets in the long run because you are buying a piece of our almost constantly growing economy\n\n&lt;ul&gt;\n&lt;li&gt;But then investors make the mistake of thinking the most profitable stocks to own must be those of the most rapidly growing companies (Growth Stocks)&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Long term returns are usually higher when valuations are cheap and lower when they are expensive&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Paul Miller did the first study on cheap stocks called the Dow P/E strategy. He examined buying the 10 lowest P/E stocks in the Dow from 1936-1964 and discovered that the lowest P/E stocks (those everyone hates) actually outperformed the market and the highest P/E stocks (those everyone loves) greatly underperformed&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Dividend Discount Method (DDM) formulated by John Burr Williams in 1938 was formulated by a simple idea. Since all companies eventually go bankrupt, the value of a stock, bond or the entire market is simply the value of all its future dividends discounted to the present.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;And since a dollar in the future is worth less than a dollar today, its value must be reduced or discounted to reflect the fact you won&amp;#39;t receive it today.&lt;/li&gt;\n&lt;li&gt;The reduction is called the Discount Rate (DR)\n\n&lt;ul&gt;\n&lt;li&gt;The DR is determined by the cost of money (Risk Free Rate) plus the risk to the lender&lt;/li&gt;\n&lt;li&gt;Safer investments have a lower DR and risker investments a higher DR&lt;/li&gt;\n&lt;li&gt;DR can also be thought of as the expected return of the asset&lt;/li&gt;\n&lt;li&gt;Lower risks = lower DR = Lower expected return/Higher Present Value&lt;/li&gt;\n&lt;li&gt;Higher risks = higher DR = Higher expected return/Lower Present Value&lt;/li&gt;\n&lt;li&gt;Formula – Reasonable Price = (Annual Dividend Amount)/(DR – Dividend Growth Rate)&lt;/li&gt;\n&lt;li&gt;But you can make this formula say anything you want depending on your inputs. So be careful with this formula&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Asset Allocation&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;A research firm did an analysis on inflows and outflows (1986-2005) from equity mutual fund investors, it showed that the average investor earned just 3.9% vs 11.9% for the S+P 500\n\n&lt;ul&gt;\n&lt;li&gt;Why? Mostly due to chasing the performance of funds that had recently done well&lt;/li&gt;\n&lt;li&gt;Investment return is far more dependent on investor behavior than on fund performance&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Research studies repeatedly show that most money managers underperform the market\n\n&lt;ul&gt;\n&lt;li&gt;Professionals populate the marketplace and by definition, the majority cannot outperform the average. And this will continue to be true&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Some managers with superior skill do exist, the problem is they are rare and very difficult to identify conclusively&lt;/li&gt;\n&lt;li&gt;Modern Portfolio Theory considers each asset class not as an end in itself but rather as it stands in relationship to all others in the portfolio&lt;/li&gt;\n&lt;li&gt;No liquid investment alternative with stable guaranteed principal exist that can provide real returns by consistently beating the combined impact of inflation and taxes&lt;/li&gt;\n&lt;li&gt;Simple Average Return vs Compound Annual Return\n\n&lt;ul&gt;\n&lt;li&gt;Example – If I invest $100 and I get a 25% return year 1 and a -20% return in year 2.&lt;/li&gt;\n&lt;li&gt;Simple average return (Arithmetic return) is 2.5%. 25%-20%/2 = 2.5%&lt;/li&gt;\n&lt;li&gt;Compound Annual Return (Geometric return) - $100 x 25% = $125 x -20% = $100 or 0%\n\n&lt;ul&gt;\n&lt;li&gt;For any series of returns, the simple average return will ALWAYS be higher or equal to the compound annual return&lt;/li&gt;\n&lt;li&gt;The difference between the simple average and compound annual is larger for highly volatile returns.&lt;/li&gt;\n&lt;li&gt;Only in a situation where returns are consistent will the returns be equal&lt;/li&gt;\n&lt;li&gt;The reason in the disparity is that it requires a larger percentage of above average performance to offset a given percentage of below average performance\n\n&lt;ul&gt;\n&lt;li&gt;Simple average is ok to use in a single period&lt;/li&gt;\n&lt;li&gt;Compound return is more appropriate to use when comparing returns over multiple periods&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;You should be concerned not only about an asset class historical return but also about the dispersion of those returns and the likelihood that future returns will be higher or lower than past returns\n\n&lt;ul&gt;\n&lt;li&gt;People often anchor their return expectation to an investments long term historical return. The average return could be an unlikely result&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The TIPS spread provides a market-concensus forecast of future inflation\n\n&lt;ul&gt;\n&lt;li&gt;Equal to the difference between the yield to maturity of a conventional treasury bond and the yield to maturity of a similar TIPS bond&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;The median normalized P/E ratio for 1926-2011 is 16.45\n\n&lt;ul&gt;\n&lt;li&gt;Higher current P/E ratios signal lower future returns&lt;/li&gt;\n&lt;li&gt;Lower current P/E ratios signal higher future returns&lt;/li&gt;\n&lt;li&gt;But there is a range to these outcomes&lt;/li&gt;\n&lt;li&gt;P/E ratio and 10-year returns following&lt;/li&gt;\n&lt;li&gt;Below 9 = Average 15.09%&lt;/li&gt;\n&lt;li&gt;9-11 = Average 15.40%&lt;/li&gt;\n&lt;li&gt;11-14 = Average 12.99%&lt;/li&gt;\n&lt;li&gt;14-18 = Average 10.9%&lt;/li&gt;\n&lt;li&gt;18-25 = Average 6.46%&lt;/li&gt;\n&lt;li&gt;25+ = Average 3.07%\n\n&lt;ul&gt;\n&lt;li&gt;Range was -1% on the low to 6% on the high&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Market timing doesn&amp;#39;t exist, but people want to believe it is possible&lt;/li&gt;\n&lt;li&gt;Over 11 cycles post WWII\n\n&lt;ul&gt;\n&lt;li&gt;Median bull market was up 79%, bear market was down 28%&lt;/li&gt;\n&lt;li&gt;Median bull market lasted 2.5x as long as the median bear market&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;A study by Robert Jeffrey concluded: No one can predict the market&amp;#39;s ups and downs over a long period, and the risks of trying outweigh the rewards\n\n&lt;ul&gt;\n&lt;li&gt;Most of the &amp;quot;positive action&amp;quot; in stocks in compressed into just a few periods, which (perversely but understandably) tend to follow particularly adverse times for stocks&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Much of the problem with market timing is that a disproportionate % of the total gain from a bull market tends to occur very rapidly at the beginning of a market recovery&lt;/li&gt;\n&lt;li&gt;Percent you must be right to make marking timing a viable strategy\n\n&lt;ul&gt;\n&lt;li&gt;80% bull and 50% bear&lt;/li&gt;\n&lt;li&gt;70% bull and 80% bear&lt;/li&gt;\n&lt;li&gt;60% bull and 90% bear&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Do not invest in stocks unless you are in it for the long run&lt;/li&gt;\n&lt;li&gt;Most people do not think in terms of expected returns and standard deviation.\n\n&lt;ul&gt;\n&lt;li&gt;They think in terms of the chance of loss&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;For any series of returns, the larger the standard deviation, the more the compound annual returns (geometric) drop below the simple average return\n\n&lt;ul&gt;\n&lt;li&gt;Volatility therefore impairs the compounding of returns&lt;/li&gt;\n&lt;li&gt;If I have 2 investments, both with the same 10% simple average return and one has a higher standard deviation than the other, the investment with the higher standard deviation will have a lower compound annual return.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;An ideal investment would be inversely correlated assets with similar returns. But they don&amp;#39;t exist in real life.\n\n&lt;ul&gt;\n&lt;li&gt;If you had 2 investments with 10% simple average return and a negative correlation, the compound annual return would be 10% also.&lt;/li&gt;\n&lt;li&gt;This doesn&amp;#39;t exist though in real life; it would be too good to be true&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Most investments in real life that have similar return patterns have a slightly positive correlation to each other. Although differing in degree, most financial classes are positively correlated to each other\n\n&lt;ul&gt;\n&lt;li&gt;If you have 2 portfolios with the same 10% simple average return, the one with the lower volatility will have the higher compound annual return.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Having assets with similar return profiles and slightly positive correlations will reduce standard deviation and therefore improve the compound annual return of the portfolio. Even if the correlation is just mostly or slightly positive, it still provides a benefit&lt;/li&gt;\n&lt;li&gt;Historic data is helpful in understanding asset class volatility and return characteristics and relationships. But precise answers to future portfolio AA decisions simply are not possible. The perfect AA is not possible except in retrospect&lt;/li&gt;\n&lt;li&gt;A portfolio that minimizes portfolio volatility for a given expected return or maximizes portfolio expected return for a given level of risk is said to be efficient&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;A Random Walk Down Wall Street&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Technical analyst looks at charts and patterns (They don&amp;#39;t exist). They believe the market is 10% logical and 90% psychological and attempt to beat the crowd with their picks. Does not work.&lt;/li&gt;\n&lt;li&gt;Fundamental analyst believe that the market is 90% logical and 10% psychological. Caring little for patterns and past price movements. Fundamentalists seek to determine a stocks proper value. Value applies to assets, growth rates, earnings and dividends, interest rate, and risks. They believe that the company&amp;#39;s price will eventually reflect its real worth&lt;/li&gt;\n&lt;li&gt;God Almighty does not know the proper P/E multiple for a common stock&lt;/li&gt;\n&lt;li&gt;The history of stock price movement contains no useful information that will enable an investor to consistently to outperform a buy and hold strategy&lt;/li&gt;\n&lt;li&gt;Technical analysis strategies are usually amusing, often comforting, but of no real value&lt;/li&gt;\n&lt;li&gt;The past history of stock prices cannot be used to predict the future in any meaningful way&lt;/li&gt;\n&lt;li&gt;Technical analysis enriches people marketing them, not investors&lt;/li&gt;\n&lt;li&gt;The idea is simple, if past prices contain little to no useful information for the prediction of future prices, there is no point in following any technical trading rule for the timing of purchases or sales. A simple policy of buying and holding will be at least as good as any technical procedure. Also, buying and selling short term generate taxable events, brokerage charges, and spreads that decrease returns&lt;/li&gt;\n&lt;li&gt;Analysts&amp;#39; recommendations are tainted by very profitable investment banking relationships&lt;/li&gt;\n&lt;li&gt;Brad Barber studied the performance of the &amp;quot;strong buy&amp;quot; recommendations and found the results were terrible&lt;/li&gt;\n&lt;li&gt;Systemic Risk AKA &amp;quot;Market Risk&amp;quot; – arises from the basic variability of stock prices in general and the tendency for all stocks to go along with the general market, at least to some extent. Cannot be eliminated by diversification&lt;/li&gt;\n&lt;li&gt;Unsystematic Risk – results from factors peculiar to that specific company. IE – strikes, new products, management, etc. This can be eliminated through adequate diversification. With as few as 60 stocks.&lt;/li&gt;\n&lt;li&gt;Beta – relative volatility or sensitivity to market moves\n\n&lt;ul&gt;\n&lt;li&gt;Numerical description of systemic risk&lt;/li&gt;\n&lt;li&gt;It is a comparison between the movements of an individual stock or portfolio and the movements of the market as a whole&lt;/li&gt;\n&lt;li&gt;IE – the total stock market has a Beta of 1. If a stock has a Beta of 2. It will move up or down 2x as much as the total market. +-10% change in the total market would mean a +-20% change for the stock. Beta of 0.5 would be +-5%&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Investors will not be paid for bearing risks that can be diversified away. The is the logic behind the capital asset pricing model&lt;/li&gt;\n&lt;li&gt;As the systemic risk (Beta) of an individual portfolio increases, so does the return an investor can expect&lt;/li&gt;\n&lt;li&gt;Beta isn&amp;#39;t the end all be all though. Fama and French did a study in 1992 that discovered that there was no relationship between returns for portfolios and their beta measures. It is not a useful single measure to capture the relationship between risk and return&lt;/li&gt;\n&lt;li&gt;It appears that the only way to obtain higher long-run investment returns is to accept greater risks&lt;/li&gt;\n&lt;li&gt;Unfortunately, a perfect risk measure doesn&amp;#39;t exist. Beta and rate of return has not corresponded to the relationship predicted in theory. Beta can also change.&lt;/li&gt;\n&lt;li&gt;In the short run, change in valuations can have a major role in determining returns. IE – P/E&amp;#39;s and Dividend yields&lt;/li&gt;\n&lt;li&gt;P/E have varied widely. During the early 2000&amp;#39;s with high optimism, the P/E&amp;#39;s were about 30. During 1982 stocks sold at only a P/E of 8&lt;/li&gt;\n&lt;li&gt;P/E go up with lower interest rates and go down with higher interest rates because now equities have to compete with bonds&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Stocks for the Long Run&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Real stock returns in the 19th century do not differ appreciably from the real returns in the 20th century&lt;/li&gt;\n&lt;li&gt;Stocks fluctuate both below and above the trendline but eventually return to the trend. AKA mean reversion. This means that periods of above average returns tend to be followed by periods of below average returns and vice versa&lt;/li&gt;\n&lt;li&gt;In the short run, stock returns are very volatile driven by changes in earnings, interest rates, risk, uncertainty and psychological factors&lt;/li&gt;\n&lt;li&gt;The stock market has real annualized returns of 6.7% from 1802-1870, 6.6% from 1871-1925, and 6.4% from 1926-2012. This is remarkable constancy&lt;/li&gt;\n&lt;li&gt;As stable as the long-term returns for equities have been, the same cannot be said of fixed-income investments. Real returns on treasures were 5.1% in the early 19th century to a bare 0.6% since 1926, only slightly above inflation&lt;/li&gt;\n&lt;li&gt;Real return on bonds have shown a similar but more moderate decline as fixed-income. 4.8% in the first period to 3.7% in the 2nd period and now only 2.6% in the current period.&lt;/li&gt;\n&lt;li&gt;The excess return of stocks over bonds is referred to as the equity risk premium.&lt;/li&gt;\n&lt;li&gt;Subtracting stock and bond returns from equity shows that the premium has averaged 3% against bonds and 3.9% over treasury bills over the last 200 years.&lt;/li&gt;\n&lt;li&gt;19 countries were analyzed from 1900-2012 and it was determined that the US experience of equites outperforming bonds and bills has been mirrored in all countries examined. Every country achieved equity performance that was better than bonds.&lt;/li&gt;\n&lt;li&gt;While the US and UK have performed well, that is no indication that they are out of line with other countries. Therefore, studies on the US market results have relevance to all investors in all countries&lt;/li&gt;\n&lt;li&gt;Swings in investor sentiment from political or economic crisis can throw stocks off their long-term path, but the fundamental forces producing economic growth have always enabled equities to regain their long-term trend&lt;/li&gt;\n&lt;li&gt;Correlations between asset classes can and do change over time&lt;/li&gt;\n&lt;li&gt;During 20 year holding periods, stock have never fallen below inflation. Bond and treasury bills have lagged by as much as 3% below inflation&lt;/li&gt;\n&lt;li&gt;The worst 30-year timeframe since 1802 stocks beat inflation by 2.6%.&lt;/li&gt;\n&lt;li&gt;As the holding period increases, the odds that stocks will beat bonds or bills increase drastically&lt;/li&gt;\n&lt;li&gt;On any given 2-year cycle, there is a 33% chance bonds or bills will beat stocks&lt;/li&gt;\n&lt;li&gt;Under a paper money standard, bad economic times are more likely to be associated with inflation, not deflation like the 1930&amp;#39;s. Under these circumstances, stock and bond prices tend to be more correlated. Thereby reducing the diversifying qualities of government bonds&lt;/li&gt;\n&lt;li&gt;Because of this it is unlikely that bonds will remain a good long-term diversifier, especially if inflation looms once again&lt;/li&gt;\n&lt;li&gt;Real returns (post tax) since 1913 (income tax enacted) have ranged from 6.1%-2.7% on stocks, 2.2% to -0.3% for bonds and bills having a 0.4% to -2.3%&lt;/li&gt;\n&lt;li&gt;Taxes have the greatest impact on fixed income investments&lt;/li&gt;\n&lt;li&gt;Since 1871, for someone in the highest tax bracket, short term treasury bills have had a negative real return after tax&lt;/li&gt;\n&lt;li&gt;The inflation tax hits harder when the holding period is shorter. The more you buy and sell, the more frequently the government can tax the gains, which might not be real after inflation&lt;/li&gt;\n&lt;li&gt;P/E ratio is the ratio of a stock&amp;#39;s price to its earnings. The average P/E is 15 from 1871-2012&lt;/li&gt;\n&lt;li&gt;Earnings yield is important also. It measures the earnings generated per dollar of stock market value. IE – if the P/E of the market is 15 means the earnings yield is 1/15 or 6.67% which is historically accurate long-term rate of return on stocks. This is not a coincidence. If the P/E went to 20 it would be 1/20 or 5%.&lt;/li&gt;\n&lt;li&gt;But there have been changes in the economy and markets that may rise the average P/E in the future. These changes include a decrease in the cost of investing in indexes, a lower discount rate, and an increase in knowledge about the advantages of equity vs fixed income investing.&lt;/li&gt;\n&lt;li&gt;There are many reasons for a decline in real returns available to investors. Whatever the reasons, such a decline implies that the real return on equity need not be as high as it had historically been to attract investors. The historic equity risk premium was 3-3.5%. If we assume the long-run real rate is somewhere around 2%, then a 3% equity premium will require a 5% real return on stocks, which, gives us an average P/E of 20. 1/20 = 5%&lt;/li&gt;\n&lt;li&gt;Transaction costs have come down and this has led to a higher P/E ratio than in the past&lt;/li&gt;\n&lt;li&gt;The equity risk premium also itself may have shrunk. There is considerable truth in the statement that widespread knowledge of the profitability of common stocks, gained from the studies that have been made, tends to diminish the likelihood that correspondingly large profits can be gained from stocks in the future. The competitive bidding for stocks causes prices at the time of purchase to be high&lt;/li&gt;\n&lt;li&gt;Investors are drawn to firms able to generate high earnings and revenue growth. But empirical data shows this pursuit of growth often leads to subpar returns. IE – IBM vs Exxon 1950-2012. Exxon was a better investment&lt;/li&gt;\n&lt;li&gt;Financial theory has shown that if capital markets are &amp;quot;efficient&amp;quot; in the sense that known valuation criteria, such as earnings, dividends, cash flows, book values, and other factors are already factored into the security price, investing on the basis of these fundamentals will not improve returns.&lt;/li&gt;\n&lt;li&gt;In an efficient market, the only way investors can consistently earn higher returns is to undertake higher risk, where risk is defined as the correlation of an asset&amp;#39;s return with the overall stock market. This was the basis for the Capital Asset Pricing Model (CAPM) or Beta&lt;/li&gt;\n&lt;li&gt;Beta and CAPM was the primary basis for stock returns in the 1970&amp;#39;s and 1980&amp;#39;s. Unfortunately, beta and CAPM did not prove effective in explaining the differences in returns among individual stocks&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t use Beta to try to buy stocks, it doesn&amp;#39;t work&lt;/li&gt;\n&lt;li&gt;Fama and French wrote an article that showed there are 2 factors (size and value) that are far more important in determining a stock return that the beta of a stock&lt;/li&gt;\n&lt;li&gt;Although the historical return on small stocks has outpaced large stocks since 1926, the magnitude of small cap outperformance has waxed and waned unpredictably.&lt;/li&gt;\n&lt;li&gt;The existence of a small-cap premium does not mean they will outperform large stock every year or even every decade. They have lost to large cap for more than a decade before.&lt;/li&gt;\n&lt;li&gt;F+F also determined that value played a role in returns. Stocks with low prices relative to their fundamentals are value stocks. Stocks with high prices relative to their fundamentals are growth stocks&lt;/li&gt;\n&lt;li&gt;In 1978 Ramaswamy and Litzenberger established a significant correlation between dividend yield and subsequent return. O&amp;#39;Shaughnessy has shown that in the period of 1951-1994, the 50 highest dividend yielding large cap stocks had a return that was 1.7% higher than the market&lt;/li&gt;\n&lt;li&gt;Basu did some studies in the 1960&amp;#39;s that showed that stocks with lower P/E ratios have significantly higher returns than stocks with high P/E ratios, even after accounting for risks&lt;/li&gt;\n&lt;li&gt;Graham wrote in Security Analysis (1940) that people who habitually pay more than 16x average earnings are likely to lose considerable money in the long run&lt;/li&gt;\n&lt;li&gt;P/B ratio is a good ratio but there are conceptual problems with using book value as a value criterion. It does not correct for changes in the market value of assets, not does it capitalize R+D expenditures. From 1987-2012 the author determined that book value underperformed either dividend yields or P/E ratios in explaining returns&lt;/li&gt;\n&lt;li&gt;The worst course an investor can take is to follow the prevailing sentiment about economic activity. That will lead investors to buy at high prices when times are good and everyone is optimistic and sell at the low&lt;/li&gt;\n&lt;li&gt;Since 1885, there have been 145 days where the market moved 5% or more. Only ¼ of those days can be attributed to an event. This confirms the unpredictability of the market and the difficulty in forecasting moves&lt;/li&gt;\n&lt;li&gt;News moves markets. But the timing of much news is unpredictable, like wars, political developments, and natural disasters&lt;/li&gt;\n&lt;li&gt;Markets do not directly respond to what is announced, rather, they respond to the difference between what the traders expect to happen and what actually happens. The market already incorporates all the information that was expected&lt;/li&gt;\n&lt;li&gt;For example – a strong economic report can send stocks down. Why? Because even though the news is good for main street and corporate earnings, it can mean the federal reserve will raise interest rates, which raises the discount rate at which these future profits are discounted&lt;/li&gt;\n&lt;li&gt;The opposite can also happen. A weak report can send stocks higher as interest rates decline&lt;/li&gt;\n&lt;li&gt;A lower than expected inflation report lowers interest rates and boosts bond and stock prices. Inflation worse than expected raises interest rates and depress stock and bond prices&lt;/li&gt;\n&lt;li&gt;Although fascinating to observe and understand a market&amp;#39;s reaction, investing on the basis of data releases (CPI, unemployment, etc.) is a tricky game and best left to speculators. Most investors will do well to watch from the sidelines and stick to a long-term investment strategy.&lt;/li&gt;\n&lt;li&gt;From 1971-2012, the average U.S. equity active mutual fund returned 1% below the Wilshire 5000 index and 0.88% below the S&amp;amp;P 500 index.&lt;/li&gt;\n&lt;li&gt;Very few active managed mutual funds beat the index and the odds of you picking on early are low. Good money managers are extremely difficult to identify as luck plays a role in all successful investment outcomes&lt;/li&gt;\n&lt;li&gt;The generally poor performance of active mutual funds is not because the fund managers pick losing stocks. It is because of the fees and trading costs&lt;/li&gt;\n&lt;li&gt;Contrary to their oft articulated goal of outperforming the market averages, investment managers are not beating the market; the market is beating them&lt;/li&gt;\n&lt;li&gt;Investing $1000 with a compound return of 11% will accumulate 23,000 in 30 years. A 1% fee will reduce this number by 1/3. A 3% fee will reduce it to just over 10,000. The fees add up.&lt;/li&gt;\n&lt;li&gt;In the 1990&amp;#39;s passive investing took off. Indexing has low fees. Most investors are better off in a capitalization weighted index fund&lt;/li&gt;\n&lt;li&gt;Indexing also has a problem in that when a company is announced it will be added to an index, the price usually goes up forcing the index to have to pay inflated prices&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Winning the Losers Game&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Investment managers are not beating the market, the market is beating them\n\n&lt;ul&gt;\n&lt;li&gt;Over 1 year, 70% of professionals underperform their benchmarks&lt;/li&gt;\n&lt;li&gt;Over 10 years, 80%&lt;/li&gt;\n&lt;li&gt;Over 15 years, 90%&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Yes, some professional money managers will beat the market in any given year. But most will not over the long term and there is no reliable way to figure out who would be in that 10% that outperforms ahead of time&lt;/li&gt;\n&lt;li&gt;Investment professionals daily trading volume by decade\n\n&lt;ul&gt;\n&lt;li&gt;10% in the 1960&amp;#39;s to over 90% currently.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;This is why it is so difficult for active managers to beat the market&lt;/li&gt;\n&lt;li&gt;Understanding the outlook for the near term is easy as J.P Morgan said, &amp;quot;It will fluctuate.&amp;quot;&lt;/li&gt;\n&lt;li&gt;One way to be realistic about future returns is to assume that future range of P/E multiples and corporate profits will be within their historical upper and lower limits and will appear with frequency at values close to the long-term average&lt;/li&gt;\n&lt;li&gt;Investors almost always project recent past market and economic behavior out into the future, somehow expecting more of the same to continue\n\n&lt;ul&gt;\n&lt;li&gt;Math example – If dividends are at 1.5% and corporate earnings are growing at 4.5% (Historical Average), then a composite of 6% return is reasonable. This is the fundamental rate of return the investor can expect from the market&lt;/li&gt;\n&lt;li&gt;Then you add or subtract the changes in P/E over that time frame. The average P/E in recent decades has been about 15.5. This is the speculative return component&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Predicting the market roughly is not hard, but predicting it accurately is impossible\n\n&lt;ul&gt;\n&lt;li&gt;Predicting where the market will be in the long run is not hard, but even estimating how it will move in the next few months is impossible and pointless&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;One up on Wall Street&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;If the company insiders are buying, you should too. Management normally sells 2.3 shares for every 1 share they buy. In 1987 after the crash, it was 4 buys for 1 sell&lt;/li&gt;\n&lt;li&gt;Avoid the hottest stock in the hottest industry, any stock being touted as the next X&lt;/li&gt;\n&lt;li&gt;A share of stock is NOT a lotto ticket. It is a part ownership of a business&lt;/li&gt;\n&lt;li&gt;P/E ratio can be thought of as the number of years to earn back your original investment. IE = P/E of 10 would be 10 years assuming earnings stay constant. Ratios tend to be lower for slow growers and highest for the fast growers with cyclicals in between depending on the current cycle.&lt;/li&gt;\n&lt;li&gt;Look at average P/E ratios on the company you are researching and peers going back several years to determine if it is a good buy&lt;/li&gt;\n&lt;li&gt;Avoid stocks with HIGH P/E ratios. They must have incredible earnings growth to justify the price&lt;/li&gt;\n&lt;li&gt;P/E ratio that is half the growth rate (annual earnings) is very positive and one that is twice the growth rate is very negative. IE = P/E of 10 should be growing at 10%&lt;/li&gt;\n&lt;li&gt;Formula = Growth rate plus dividend yield divided by P/E. IE = 12% growth + 3% yield/10 P/E = 1.5. Less than 1 is bad. 1.5 is ok and 2+ is great.&lt;/li&gt;\n&lt;li&gt;The stock market as a whole has its own collective P/E ratio, which is a good indicator of weather the market at large is over or under valued. If some stocks are selling at inflated prices relative to earnings, then it could be likely most stocks are selling at inflated prices.&lt;/li&gt;\n&lt;li&gt;Interest rates have a large effect on p/e ratios as investors pay higher p/e when interest rates are lower and bonds less attractive&lt;/li&gt;\n&lt;li&gt;Dividend paying stocks keep the stock price from falling as far as if there was no dividend&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;How to Calculate Estimated Returns&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.efficientfrontier.com/ef/403/fairy.htm\"&gt;http://www.efficientfrontier.com/ef/403/fairy.htm&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Junk Bond Math&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"http://www.efficientfrontier.com/ef/401/junk.htm\"&gt;http://www.efficientfrontier.com/ef/401/junk.htm&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Larry Swedroe Book Summaries&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/Bogleheads/comments/sdqtl7/larry_swedroe_the_incredible_shrinking_alpha/\"&gt;https://www.reddit.com/r/Bogleheads/comments/sdqtl7/larry_swedroe_the_incredible_shrinking_alpha/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/r/Bogleheads/comments/sdqrf0/larry_swedroe_the_only_guide_to_alternative/\"&gt;https://www.reddit.com/r/Bogleheads/comments/sdqrf0/larry_swedroe_the_only_guide_to_alternative/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;My Summaries and FAQ&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.reddit.com/user/captmorgan50/comments/rnftyk/book_summaries/\"&gt;https://www.reddit.com/user/captmorgan50/comments/rnftyk/book_summaries/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "cc31739e-6c0e-11ec-a019-9eae049f0f7d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#ff4500",
  "id": "tq0ii9",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "captmorgan50",
  "discussion_type": null,
  "num_comments": 3,
  "send_replies": false,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/tq0ii9/investor_math_and_statistics/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/tq0ii9/investor_math_and_statistics/",
  "subreddit_subscribers": 150776,
  "created_utc": 1648450624,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1648439239,
  "the_new_excerpt": "The Little Book of Common-Sense Investing\n\n * Buffet – Newtons 4th law of motion. Investor return decrease as motion\n   increases.\n * Winning Strategy for investing is to buy a fund that holds all market\n   portfolio and hold it forever\n * The index fund eliminates the risks of individual stocks,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資の常識がわかる小冊子\n\n * バフェット - ニュートン運動の第4法則。投資家のリターンは運動によって減少する。\n   が増える。\n * 投資の必勝法は、すべての市場を保有するファンドを買うこと。\n   ポートフォリオに組み入れ、永遠に保有する\n * インデックスファンドは、個別銘柄のリスクを排除し...",
      "title": "投資家向け数学・統計学"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "投资常识小书》（The Little Book of Common-Sense Investing\n\n * 巴菲特 - 纽顿运动第四定律。投资者的回报随着运动的增加而减少。\n   增加。\n * 投资的制胜策略是购买一个持有所有市场投资组合的基金，并永远持有。\n   投资的成功策略是购买一个持有所有市场投资组合的基金，并永远持有它\n * 指数基金消除了单个股票的风险，...",
      "title": "投资者数学和统计学"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "投資常識小書》（The Little Book of Common-Sense Investing\n\n * 巴菲特 - 紐頓運動第四定律。投資者的回報隨着運動的增加而減少。\n   增加。\n * 投資的制勝策略是購買一個持有所有市場投資組合的基金，並永遠持有。\n   投資的成功策略是購買一個持有所有市場投資組合的基金，並永遠持有它\n * 指數基金消除了單個股票的風險，...",
      "title": "投資者數學和統計學"
    }
  ],
  "source_updated_at": 1648806126857
}