{
  "author": "SnoozeSquirrels",
  "original_created_utc": 1630216564,
  "title": "My Boyfriend Keeps Calling me Slut in Bed but I don’t like it",
  "created_utc": 1630242096,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My boyfriend and I started a relationship last year and after a few months in bed (not sex), he asked me if I was his slut which I said no to but eventually since he said he only gets turned on if he objectifies me, so I said yes. But now, I’m really regretting it, I don’t like it at all, and derive no pleasure from it. It feels like words. He’s asked me a couple of times if I like certain things but words it in a way that’s hard to refuse like putting “right?” at the end so I tend to say yes. He’s asked me to say a lot of things I don’t want to say and when I say I don’t want to, he says, now I’m turned off and looks at me like it’s all my fault. I don’t know what to do now. I love him which is why I’m willing to put up with it but at this point he says it every time and it really bothers me. What should I do?</p>\n</div><!-- SC_ON -->",
  "score": 147,
  "permalink": "/r/NoStupidQuestions/comments/pdptjh/my_boyfriend_keeps_calling_me_slut_in_bed_but_i/",
  "subreddit": "NoStupidQuestions",
  "id": "pdptjh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My boyfriend and I started a relationship last year and after a few months in\nbed (not sex), he asked me if I was his slut which I said no to but eventually\nsince he said he only gets turned on if he objectifies me, so I said yes. But\nnow, I’m really regretting it, I don’t like it at all, and derive…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の彼氏と私は去年交際を始め、数ヶ月間ベッドで過ごした後（セックスはしませんでしたが\n彼は私に、彼の尻軽女にならないかと聞いてきましたが、私はノーと答えました。\n彼は私を客観視したときだけ興奮すると言っていたので、私はイエスと答えました。でも\n今は本当に後悔していて、全然好きじゃないし、派生して...",
      "title": "私の彼氏はベッドの中で私のことをスラットと呼び続けていますが、私はそれが好きではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的男朋友和我去年开始了一段关系，在床上呆了几个月之后\n他问我是否是他的荡妇，我说不是，但最终\n因为他说只有当他把我物化时才会兴奋，所以我说是。但是\n现在，我真的很后悔，我一点也不喜欢这样，而且我还在想......",
      "title": "我的男朋友在床上一直叫我荡妇，但我不喜欢。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的男朋友和我去年開始了一段關係，在牀上呆了幾個月之後\n他問我是否是他的蕩婦，我說不是，但最終\n因爲他說只有當他把我物化時纔會興奮，所以我說是。但是\n現在，我真的很後悔，我一點也不喜歡這樣，而且我還在想......",
      "title": "我的男朋友在牀上一直叫我蕩婦，但我不喜歡。"
    }
  ]
}