{
  "author": "HuskerNatChamps2020",
  "original_created_utc": 1630947505,
  "title": "Tell me your favorite cryptocurrency and I’ll assume something about you.",
  "created_utc": 1630956638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sup jabronis its ya boy huskernatchamps2020, back at it again. I bet you&#39;re sick of seeing BTC 50k posts, and staring at this crab market. So let me interject with something completely useless to distract you all! </p>\n\n<p>Comment your favorite cryptocurrency and I’ll assume something about you. May be negative… may be positive. Who knows?</p>\n\n<p>qualification:</p>\n\n<ol>\n<li>2.5 college GPA</li>\n<li>funniest in my friend group</li>\n<li>Strong opinion </li>\n<li>Been here since 2017</li>\n<li>Paper hands </li>\n<li>3 hours till I have to work and it’s a holiday</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/pj3eg6/tell_me_your_favorite_cryptocurrency_and_ill/",
  "subreddit": "CryptoCurrency",
  "id": "pj3eg6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Sup jabronis its ya boy huskernatchamps2020, back at it again. I bet you're sick\nof seeing BTC 50k posts, and staring at this crab market. So let me interject\nwith something completely useless to distract you all!\n\nComment your favorite cryptocurrency and I’ll assume something about you. May…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Sup jabronis is ya boy huskernatchamps2020, back at it again. BTCの50kポストを見てうんざりしていることでしょう。\nBTC50kの投稿を見て、このカニ市場を見つめることにうんざりしていることでしょう。そこで、私が邪魔をしてみよう\n皆さんの気を紛らわすために、全く役に立たないことを言ってみましょう\n\nあなたの好きな暗号通貨をコメントしてください、あなたについて何か仮定します。五月蠅いな。",
      "title": "好きな暗号通貨を教えてくれたら、あなたのことを想定します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，我是你的儿子Huskernatchamps2020，又回来了。我打赌你已经厌倦了\n看到BTC 5万的帖子，并盯着这个螃蟹市场。所以让我插一句\n一些完全无用的东西来分散你们的注意力!\n\n请评论你最喜欢的加密货币，我将假设一些关于你的事情。五月...",
      "title": "告诉我你最喜欢的加密货币，我将假设你的一些情况。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，我是你的兒子Huskernatchamps2020，又回來了。我打賭你已經厭倦了\n看到BTC 5萬的帖子，並盯着這個螃蟹市場。所以讓我插一句\n一些完全無用的東西來分散你們的注意力!\n\n請評論你最喜歡的加密貨幣，我將假設一些關於你的事情。五月...",
      "title": "告訴我你最喜歡的加密貨幣，我將假設你的一些情況。"
    }
  ]
}