{
  "author": "JonahGrassyKnoll",
  "original_created_utc": 1632934139,
  "title": "How far back in human history were people inhaling burnt plant matter (tobacco, cannabis, opium) in order to receive a desired physical effect/high and do we know the origins of smoking plants in general?",
  "created_utc": 1632976513,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The more I think about it the more I wonder. While eating is a necessary and instinctual thing to do, smoking is absolutely not. Ingesting plants/meat orally can sometimes give you different highs or have a strong effect on the body/mind, but <em>smoking them</em> would take a whole new level of creativity. When and how did humans learn to not only smoke plants but then specifically grow and harvest particularly-powerful plants (opium, cannabis, tobacco, coca plant) for use? Also is there any hard evidence of documented substance abuse/addiction in ancient cultures, and if so what were the repercussions for someone who became physically dependent/addicted to such things? Is there any documented evidence of withdrawals or sickness or death related to medicinal plants?</p>\n\n<p>Side question: Was there ever a time in pre-modern history where <em>medicinal</em> plants were highly sought-after and used as a <em>currency?</em> For example, I would think that the discovery of man&#39;s most effective painkiller (opium) would be quite a massive business long before the Chinese/British opium conflicts.</p>\n\n<p>&#x200B;</p>\n\n<p>edit: added coca plant because I forgot about that one :)</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/pxzh2l/how_far_back_in_human_history_were_people/",
  "subreddit": "AskHistorians",
  "id": "pxzh2l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The more I think about it the more I wonder. While eating is a necessary and\ninstinctual thing to do, smoking is absolutely not. Ingesting plants/meat orally\ncan sometimes give you different highs or have a strong effect on the body/mind,\nbut smoking them would take a whole new level of creativity.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "考えれば考えるほど、不思議です。食べることは必要であり、本能的なことですが\n食べることは本能的に必要なことですが、タバコは絶対にダメです。植物・肉類を経口的に摂取する\n植物や肉を経口的に摂取すると、時には違った高揚感が得られたり、体や心に強い影響を与えることがあります。\nしかし、それを吸うということは、全く新しいレベルの創造性を必要とします。....",
      "title": "人類の歴史の中で、人々はどのくらい前から、燃焼した植物（タバコ、大麻、アヘン）を吸い込むことで、望ましい身体的効果や高揚感を得ていたのか、また、一般的な植物の喫煙の起源はわかっているのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我越想越觉得奇怪。虽然吃饭是一件必要的和\n本能的事情，而吸烟则绝对不是。口服植物/肉类\n有时会给你带来不同的高潮或对身体/心理产生强烈的影响。\n但吸食它们将需要一个全新的创造性水平，....。",
      "title": "在人类历史上，人们吸入烧焦的植物物质（烟草、大麻、鸦片）以获得所需的生理效果/高潮的时间有多长，我们是否知道一般来说吸食植物的起源？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我越想越覺得奇怪。雖然喫飯是一件必要的和\n本能的事情，而吸菸則絕對不是。口服植物/肉類\n有時會給你帶來不同的高潮或對身體/心理產生強烈的影響。\n但吸食它們將需要一個全新的創造性水平，....。",
      "title": "在人類歷史上，人們吸入燒焦的植物物質（菸草、大麻、鴉片）以獲得所需的生理效果/高潮的時間有多長，我們是否知道一般來說吸食植物的起源？"
    }
  ]
}