{
  "author": "Good-Rooster-9736",
  "the_new_excerpt": "Today I sold a 2018 used car to vroom for more than I fucking bought it for\nbrand new off the lot. Granted it had very low mileage for a car 3 years old,\nbut still.\n\nThis feels a lot like the 2008 financial crisis, so get yourself prepared.\nPeople who survive hyperinflation own assets. Buy some shit…",
  "original_created_utc": 1623639165,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、私は2018年式の中古車を、私が買った値段よりも高い値段でvroomに売りました。\n新車で買った時よりも 3年前の車にしては走行距離が少なかったのは認める。\nしかし、それでもです。\n\nこれは2008年の金融危機と同じような感じがするので、しっかりと準備をしておきましょう。\nハイパーインフレで生き残る人は資産を持っています。何か買えよ...。",
      "title": "そう、このインフレーションは本物なのだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天我把一辆2018年的二手车卖给了vroom，价格比我他妈的买它的价格还要高。\n崭新的车。当然，对于一辆三年前的车来说，它的里程数很低。\n但仍然如此。\n\n这感觉很像2008年的金融危机，所以让自己做好准备。\n在恶性通货膨胀中幸存下来的人都拥有资产。买点东西...",
      "title": "因此，是的，这个通货膨胀的事情是真实的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天我把一輛2018年的二手車賣給了vroom，價格比我他媽的買它的價格還要高。\n嶄新的車。當然，對於一輛三年前的車來說，它的里程數很低。\n但仍然如此。\n\n這感覺很像2008年的金融危機，所以讓自己做好準備。\n在惡性通貨膨脹中倖存下來的人都擁有資產。買點東西...",
      "title": "因此，是的，這個通貨膨脹的事情是真實的"
    }
  ],
  "title": "So yeah this inflation thing is real",
  "created_utc": 1623653053,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today I sold a 2018 used car to vroom for more than I fucking bought it for brand new off the lot. Granted it had very low mileage for a car 3 years old, but still. </p>\n\n<p>This feels a lot like the 2008 financial crisis, so get yourself prepared. People who survive hyperinflation own assets. Buy some shit that will have value through what is shaping up to be a wild time. Property, “safe” stocks, of course crypto. Buy it with cash. Satoshi invented bitcoin for this moment. </p>\n\n<p>I know all these moon boys and Twitter chart junkies sound like they are running a pyramid scheme but there’s truth behind the hyperbole, just look.</p>\n</div><!-- SC_ON -->",
  "score": 1625,
  "permalink": "/r/CryptoCurrency/comments/nzcv1a/so_yeah_this_inflation_thing_is_real/",
  "subreddit": "CryptoCurrency",
  "id": "nzcv1a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009738588
}