{
  "author": "shallowbitchwants2no",
  "original_created_utc": 1654045454,
  "title": "Do unattractive people find other unattractive people attractive?",
  "created_utc": 1654087917,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throwaway because I don’t want the people who know my main to know I’m a petty bitch, but really…&lt;/p&gt;\n\n&lt;p&gt;We all know that some people are more attractive than others, and some people are significantly less attractive. I feel like the less attractive people KNOW they’re less attractive, right? Despite that, these objectively less attractive people date people, and usually people on their own… level? &lt;/p&gt;\n\n&lt;p&gt;I’m just wondering… are less attractive people actually attracted to their equally less attractive peers? Or are they just settling? Do they secretly think their partner is ugly? Does their partner secretly think they’re ugly? I gotta know. &lt;/p&gt;\n\n&lt;p&gt;P.S. I am genuinely not trolling, I’ve had this discussion with several people in my life and most of them came back and said “You should ask Reddit” so here I am. No rude answers, please, whether or not we’re conventionally attractive we all have value and deserved to be treated as human beings.&lt;/p&gt;\n\n&lt;p&gt;Edit: Typos&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/v24yuw/do_unattractive_people_find_other_unattractive/",
  "subreddit": "NoStupidQuestions",
  "id": "v24yuw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Throwaway because I don’t want the people who know my main to know I’m a petty\nbitch, but really…\n\nWe all know that some people are more attractive than others, and some people\nare significantly less attractive. I feel like the less attractive people KNOW\nthey’re less attractive, right? Despite…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メインを知ってる人に小心者だと知られたくないから捨て身で。\nでも、本当に...。\n\n魅力的な人もいれば、そうでない人もいることは、みんな知っている。\n魅力的な人もいれば、そうでない人もいる。魅力的でない人は、自分が魅力的でないことを知っているような気がします。\n自分が魅力的でないことを自覚してるんだ、だろ？にもかかわらず...",
      "title": "モテない人は、他のモテない人を魅力的に感じるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扔掉是因为我不想让了解我的主要人物知道我是一个小气的\n婊子，但实际上...\n\n我们都知道，有些人比其他人更有吸引力，而有些人\n有的人明显不那么有吸引力。我觉得那些没有吸引力的人知道\n他们不那么有吸引力，对吗？尽管...",
      "title": "没有吸引力的人是否会觉得其他没有吸引力的人有吸引力？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扔掉是因爲我不想讓瞭解我的主要人物知道我是一個小氣的\n婊子，但實際上...\n\n我們都知道，有些人比其他人更有吸引力，而有些人\n有的人明顯不那麼有吸引力。我覺得那些沒有吸引力的人知道\n他們不那麼有吸引力，對嗎？儘管...",
      "title": "沒有吸引力的人是否會覺得其他沒有吸引力的人有吸引力？"
    }
  ]
}