{
  "author": "Virtual_Beast1123",
  "original_created_utc": 1629102734,
  "title": "What is one coin you'll never invest in?",
  "created_utc": 1629121230,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What cojn will you, for whatever reason, never invest in? Whether it be ethical or personal.</p>\n\n<p>Mine is dogecoin. I hate Elon Musk (despite being a massive space fan, and all the things he&#39;s done for space), and feel like doge is &quot;his coin&quot;. I know it has nothing to do with him, he was just some of the original hype.</p>\n\n<p>So, what coin will you never invest in?</p>\n</div><!-- SC_ON -->",
  "score": 222,
  "permalink": "/r/CryptoCurrency/comments/p5bzll/what_is_one_coin_youll_never_invest_in/",
  "subreddit": "CryptoCurrency",
  "id": "p5bzll",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "What cojn will you, for whatever reason, never invest in? Whether it be ethical\nor personal.\n\nMine is dogecoin. I hate Elon Musk (despite being a massive space fan, and all\nthe things he's done for space), and feel like doge is \"his coin\". I know it has\nnothing to do with him, he was just some of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何らかの理由で、絶対に投資しないCOJは？それが倫理的なものであれ\n個人的にでも。\n\n私はdogecoinです。私はイーロン・マスクが嫌いで（宇宙の大ファンであり、彼が宇宙のためにしてきたことにもかかわらず）、dogeは「彼のコイン」だと感じています。\n私はイーロン・マスクが嫌いで（宇宙の大ファンで、彼が宇宙のためにしたことすべてに）、dogeは「彼のコイン」だと感じています。彼とは何の関係もないことはわかっています。\n彼とは何の関係もありませんが、彼はただ...",
      "title": "絶対に投資しないコインは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "无论出于何种原因，你将永远不会投资于哪种商品？无论它是道德的\n或个人。\n\n我的是dogecoin。我讨厌埃隆-马斯克（尽管我是一个巨大的太空迷，以及他为太空所做的所有事情）。\n他为太空所做的一切），并觉得多格币是 \"他的币\"。我知道这与\n与他无关，他只是一些...",
      "title": "你永远不会投资的一种硬币是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "無論出於何種原因，你將永遠不會投資於哪種商品？無論它是道德的\n或個人。\n\n我的是dogecoin。我討厭埃隆-馬斯克（儘管我是一個巨大的太空迷，以及他爲太空所做的所有事情）。\n他爲太空所做的一切），並覺得多格幣是 \"他的幣\"。我知道這與\n與他無關，他只是一些...",
      "title": "你永遠不會投資的一種硬幣是什麼？"
    }
  ]
}