{
  "author": "HeavyMetalSasquatch",
  "the_new_excerpt": "This might seem a bit counter intuitive, and I am sure I'm not the only one, but\nI have used this dip as an opportunity to loosen the grip crypto has on my\nattention span.\n\nI've been in crypto for under a year and got swept up in the bull mania. My life\nconsisted of checking my exchanges, wallets,…",
  "original_created_utc": 1624098879,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはちょっと直感的ではないかもしれませんし、私だけではないと思いますが\n私はこの下落を、暗号が私の注意力を奪うのを緩める機会として利用しました。\n注意力を緩める機会としました。\n\n私は暗号化を始めて1年未満ですが、ブル・マニアに巻き込まれました。私の生活は\n私の生活は、取引所やウォレットをチェックすることで成り立っていました。",
      "title": "このディップは私の精神状態を健全にしてくれました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能看起来有点违反直觉，而且我相信我不是唯一的一个，但\n我把这次下跌作为一个机会，放松了对加密货币的控制。\n的注意力。\n\n我从事加密货币不到一年，就被卷进了牛市的狂热中。我的生活\n包括检查我的交易所、钱包、...",
      "title": "这种浸泡对我的精神状态很健康"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能看起來有點違反直覺，而且我相信我不是唯一的一個，但\n我把這次下跌作爲一個機會，放鬆了對加密貨幣的控制。\n的注意力。\n\n我從事加密貨幣不到一年，就被捲進了牛市的狂熱中。我的生活\n包括檢查我的交易所、錢包、...",
      "title": "這種浸泡對我的精神狀態很健康"
    }
  ],
  "title": "This dip has been healthy for my mental state",
  "created_utc": 1624134743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This might seem a bit counter intuitive, and I am sure I&#39;m not the only one, but I have used this dip as an opportunity to loosen the grip crypto has on my attention span. </p>\n\n<p>I&#39;ve been in crypto for under a year and got swept up in the bull mania. My life consisted of checking my exchanges, wallets, and drinking up all the crypto content I could. To be honest I was getting quite dull, w my other hobbies and interests left in the curb and crypto in the driver seat. My plans have always been to longterm hold, and now that I have chosen my projects (and they arnt skyrocketing nonstop) I don&#39;t find the urge to check on them. I no longer need to validate my choices w emotional up and downs of market. I am happy with my coins and have accepted that some will go up and some will go down. </p>\n\n<p>Of course I realize its easy to not think about the coins when theyre all red, but I have been lowkey thankful for the dip to alow me to reset my priorities alittle bit. Just a reminder to try and balance crypto w other interests/investments to not burn out and stress yourself into oblivion. </p>\n\n<p>Cheers and hope to see you all on the otherside when the submarine decides to come up for air again!!</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/o3d5l9/this_dip_has_been_healthy_for_my_mental_state/",
  "subreddit": "CryptoCurrency",
  "id": "o3d5l9",
  "is_self": true,
  "media": null,
  "is_video": false
}