{
  "author": "Spamalicious62",
  "original_created_utc": 1628913722,
  "title": "Boomer perspective",
  "created_utc": 1628947928,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Having sat through my share of stock market dips and dives, I find hodling easy. I can&#39;t tell you the number of times I&#39;ve told my wife to relax, it&#39;s not like we need the money tomorrow, the market will bounce back. And it always does, and it always grows. A few decades of that. Now we&#39;re in good shape, and I plan on working awhile yet because I enjoy what I do.</p>\n\n<p>I wanted to mention that some of us really do understand the tech, we&#39;re open to new things, we&#39;re old as fuck but still vital, and we&#39;re in it with you. We&#39;re no more pleased with the old guard than you are. We&#39;re not all on our knees blowing Trump or re-electing dinosaurs just because they&#39;re old, too (there aren&#39;t many options out there to begin with). So please, try to qualify the boomer bashing with &quot;most&quot; boomers don&#39;t get it. I&#39;d agree with that. Most of my friends my age think I&#39;ve lost it going in on crypto.  Fuck &#39;em. But I&#39;ve had plenty of younger folks who can&#39;t even make change for a dollar if the cash register doesn&#39;t tell them how.  It&#39;s not all about age.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/p41096/boomer_perspective/",
  "subreddit": "CryptoCurrency",
  "id": "p41096",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Having sat through my share of stock market dips and dives, I find hodling easy.\nI can't tell you the number of times I've told my wife to relax, it's not like\nwe need the money tomorrow, the market will bounce back. And it always does, and\nit always grows. A few decades of that. Now we're in good…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は株式市場の暴落を何度も経験しているので、ホドホドにしています。\n私は妻に何度も「落ち着いて、明日お金が必要なわけでもないし、市場は立ち直るから」と言ったことがありますが、それは間違いです。\n明日、お金が必要なわけじゃないし、市場は立ち直るよ」と妻に何度も言ったものです。そして、いつもそうなのです。\nいつも成長する。それが数十年続きました。今、私たちは良い状態にある...",
      "title": "ブーマーの視点"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在经历了我所经历的股市下跌和跳水之后，我发现霍德林很容易。\n我无法告诉你有多少次我告诉我的妻子要放松，这并不像我们明天需要钱一样。\n我们明天需要这笔钱，市场会反弹的。而它总是这样，而且\n它总是在增长。几十年来都是如此。现在我们的情况很好...",
      "title": "布尔族人的观点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在經歷了我所經歷的股市下跌和跳水之後，我發現霍德林很容易。\n我無法告訴你有多少次我告訴我的妻子要放鬆，這並不像我們明天需要錢一樣。\n我們明天需要這筆錢，市場會反彈的。而它總是這樣，而且\n它總是在增長。幾十年來都是如此。現在我們的情況很好...",
      "title": "布爾族人的觀點"
    }
  ]
}