{
  "author": "calvintheidiot",
  "the_new_excerpt": "People love to talk about “buying the dip”, or Bitcoin being “on sale” when the\nprice drops. While there’s merit to this strategy, and intuitively it just …\nmake sense, you may very well be better off dollar cost averaging your buys,\nignoring the market volatility entirely.\n\nBefore we take a look,…",
  "original_created_utc": 1613631602,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "人们喜欢谈论 \"买跌\"，或者比特币 \"大甩卖\"，当\n跌价。虽然这种策略有其可取之处，直觉上它只是......\n有意义的，你很可能会更好的美元成本平均你的购买。\n完全忽略了市场的波动。\n\n在我们看之前，...",
      "title": "\"买跌 \"往往并不像它看起来那样--为什么美元成本平均法(DCA)可以是一个更明智的选择？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們喜歡談論 \"買跌\"，或者比特幣 \"大甩賣\"，當\n跌價。雖然這種策略有其可取之處，直覺上它只是......\n有意義的，你很可能會更好的美元成本平均你的購買。\n完全忽略了市場的波動。\n\n在我們看之前，...",
      "title": "\"買跌 \"往往並不像它看起來那樣--爲什麼美元成本平均法(DCA)可以是一個更明智的選擇？"
    }
  ],
  "title": "“Buy The Dip” Isn’t Often What It Seems - Why Dollar Cost Averaging (DCA) Can Be A Smarter Choice",
  "created_utc": 1613659329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People love to talk about “buying the dip”, or Bitcoin being “on sale” when the price drops. While there’s merit to this strategy, and intuitively it just … make sense, you may very well be better off dollar cost averaging your buys, ignoring the market volatility entirely.</p>\n\n<p>Before we take a look, let’s explain what Dollar Cost Averaging (DCA) is. Explained simply, DCA is simply an investing strategy where we have a set amount of money we want to invest, and we divide it up to be invested over regular intervals. For example, if we have $100 to invest, and we want to invest it over one month, we can split the $100 into 4, and invest $25 every week. DCA helps lessen the impact of volatility, as you average out the highs and lows of the market (as crypto is especially volatile). You may buy high one day, and lower on another, and since it’s notoriously hard to time the market (aka impossible), over time your purchases will average out.</p>\n\n<p>Now, isn’t it better to just wait until the market takes a big dip, and then buy it while it’s on sale? It’s tempting to take this route, as no one wants to buy high and sell low, but even if you time it extremely well, it may not be the best strategy. Let’s take a look at why.</p>\n\n<p>For the sake of these two examples, we&#39;ll be looking at the past 3 months, where things started to really get exciting.</p>\n\n<p>Here&#39;s the chart of Bitcoin for the past 3 months:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7wumh5kdm6i61.png?width=1886&amp;format=png&amp;auto=webp&amp;s=ab9d9aeee9b3e7bf7b44722837b7ec4c90894139\">Bitcoin Price: November 18, 2020 - February 17, 2021</a></p>\n\n<h1>Scenario 1:  DCA Strategy</h1>\n\n<p>It’s November 18 (3 months ago), and you have $30,000 you want to invest into Bitcoin. Bitcoin is sitting at around $17,000. Since we&#39;ve decided to DCA, we’ll be purchasing every week on Wednesday, and over the course of the 3 months we’ll be making 14 purchases.</p>\n\n<p>So, every Wednesday, regardless of what the price is, you go to your exchange, and purchase $2142.85 ($30,000/14) worth of Bitcoin.</p>\n\n<p>Let’s take a look at how much Bitcoin you’d have today.</p>\n\n<p>Purchase 1: November 18</p>\n\n<p>Price: $17,929</p>\n\n<p>Purchase 2: November 25</p>\n\n<p>Price: $18,701</p>\n\n<p>Purchase 3: December 2</p>\n\n<p>Price: $18,991</p>\n\n<p>Purchase 4: December 9</p>\n\n<p>Price: $18,467</p>\n\n<p>Purchase 5: December 16</p>\n\n<p>Price: $21,666</p>\n\n<p>Purchase 6: December 23</p>\n\n<p>Price: $23,172</p>\n\n<p>Purchase 7: December 30</p>\n\n<p>Price: $28,689</p>\n\n<p>Purchase 8: January 6</p>\n\n<p>Price: $37,085</p>\n\n<p>Purchase 9: January 13</p>\n\n<p>Price: $37,519</p>\n\n<p>Purchase 10: January 20</p>\n\n<p>Price: $34,696</p>\n\n<p>Purchase 11: January 27</p>\n\n<p>Price: $31,001</p>\n\n<p>Purchase 12: February 3</p>\n\n<p>Price: $37,992</p>\n\n<p>Purchase 13: February 10</p>\n\n<p>Price: $44,586</p>\n\n<p>Purchase 14: February 17</p>\n\n<p>Price: $52,129</p>\n\n<p>Total Bitcoin Obtained:</p>\n\n<p>2142.85/17929 + 2142.85/18701 + 2142.85/18991 + 2142.85/18467 + 2142.85/21666 + 2142.85/23172 + 2142.85/28689 + 2142.85/37085 + 2142.85/37519 + 2142.85/34696 + 2142.85/31001 + 2142.85/37992 + 2142.85/44586 + 2142.85/52129</p>\n\n<p>= 1.12 Bitcoins</p>\n\n<p>You end up with: <strong>1.12 Bitcoins</strong>, which would be worth <strong>~$58,000</strong> at the time of this post.</p>\n\n<h1>Scenario 2:  Buy The Dip Strategy</h1>\n\n<p>It’s November 18 (3 months ago), and you have $30,000 you want to invest into Bitcoin. Bitcoin is sitting at around $17,000. Things are looking up, and Bitcoin has been making some upward movement, so you don&#39;t want to buy just yet. Why not wait until things take a dive, and then scoop them up on the cheap? So you wait. Surely things are going to dip, right? And we wait some more ...</p>\n\n<p><a href=\"https://preview.redd.it/ncspnzdkm6i61.png?width=1886&amp;format=png&amp;auto=webp&amp;s=578c61614e4753c3020790242b8b9922a9549070\">Bitcoin on Sale!!</a></p>\n\n<p>FINALLY - It&#39;s Tuesday, January 12th, and Bitcoin&#39;s finally on sale. It tanked from $41,000 to $33,000, and using our superpower of seeing the future, we scoop up $15,000 worth of Bitcoin at the bottom of this dip.</p>\n\n<p>Bitcoin Obtained:</p>\n\n<p>15000/33000 = 0.4545 Bitcoin</p>\n\n<p>Great. Let&#39;s wait for the next great sale, and get the rest of our Bitcoin then. This time, we don&#39;t have to wait as long, as Bitcoin climbs back to $38,000, then steadily dips back down to $31,000. Once again, we use our superpower and see that this is the bottom, so we spend the rest of our money, $15,000.</p>\n\n<p>Bitcoin Obtained:</p>\n\n<p>15000/31000 = 0.4838 Bitcoin</p>\n\n<p>In total, we end up with 0.4838 + 0.4838 = 0.9383 Bitcoin</p>\n\n<p>You end up with: <strong>0.9383 Bitcoin</strong>, which would be worth <strong>~$49,000</strong> at the time of this post.</p>\n\n<h1>Comparison:</h1>\n\n<p>Using our DCA strategy, we end up with <strong>1.12 Bitcoins,</strong> or <strong>$58,000.</strong></p>\n\n<p>Using our Buy the Dip strategy, we end up with <strong>0.9383 Bitcoin,</strong> or $<strong>49,000</strong>.</p>\n\n<p>Note: this is basically the best case scenario where you bought basically the exact low of the dip. In reality, you probably would have bought somewhere above the bottom of the dip, netting you even less Bitcoin in the end.</p>\n\n<p>We missed out on at least $9,000 by trying to time the market, and buying the dip.</p>\n\n<p>Even if we twist the example more in our favor, and go all in with our $30,000 at the lowest dip when Bitcoin hit $31,000, we would have ended up with less than 1 Bitcoin using the &quot;Buy the Dip&quot; strategy.</p>\n\n<h1>Summary</h1>\n\n<p>The past 3 months have been unusual, even for the already volatile crypto markets. This post is not meant to say buying the dip is never the right option (a legitimate strategy can be to combine both methods).  Rather, it&#39;s meant to highlight why it&#39;s not always a &quot;sale&quot;, as you could have netted better returns simply by shutting off your brain, and buying at the same time every week. Often, being the smartest is doing the least.</p>\n</div><!-- SC_ON -->",
  "score": 470,
  "permalink": "/r/CryptoCurrency/comments/lmgdc7/buy_the_dip_isnt_often_what_it_seems_why_dollar/",
  "subreddit": "CryptoCurrency",
  "id": "lmgdc7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332875929
}