{
  "author": "jetmax25",
  "original_created_utc": 1636359355,
  "title": "This subreddit failed to discuss Crypto.com’s $100 Million marketing push when it was announced. We have gone from news oriented to price reactionary",
  "created_utc": 1636375807,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>On October 28th crypto.com announced a 100 million dollar marketing push. The most I can find talking about it from this subreddit is a 300 upvote post mentioning the Matt Damon deal.</p>\n\n<p>Now there are plenty of posts talking about the push as people are seeing CRO double in a week, but we need to ask ourselves why did news like this fly under the radar to begin with. I’ve noticed more and more this subreddit talks about the coins that pumped yesterday rather than developments that may lead to the next pump. </p>\n\n<p>I’m not going to pretend I’m not chasing pumps but I would like to come to this subreddit to discuss news and developments, not to bandwagon hop. Either we need to start downvoting needless price speculation posts and focus on industry updates or we need to spin off another subreddit like <a href=\"/r/cryptotechnology\">r/cryptotechnology</a></p>\n</div><!-- SC_ON -->",
  "score": 268,
  "permalink": "/r/CryptoCurrency/comments/qp95pl/this_subreddit_failed_to_discuss_cryptocoms_100/",
  "subreddit": "CryptoCurrency",
  "id": "qp95pl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "On October 28th crypto.com announced a 100 million dollar marketing push. The\nmost I can find talking about it from this subreddit is a 300 upvote post\nmentioning the Matt Damon deal.\n\nNow there are plenty of posts talking about the push as people are seeing CRO\ndouble in a week, but we need to ask…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10月28日、crypto.comは1億円のマーケティングを発表しました。このサブレディットで\nこのサブレディットでこの話題を見つけたのは、Matt Damonとの契約に言及した300 upvoteの投稿でした。\nMatt Damonとの契約について言及しています。\n\n現在、CROが1週間で2倍になったことを受けて、このプッシュについて語る投稿がたくさんあります。\nが1週間で2倍になったという投稿がたくさんありますが、私たちは質問する必要があります...。",
      "title": "このサブレディットでは、Crypto.comの1億ドルのマーケティングプッシュが発表されたときに議論できませんでした。私たちは、ニュース重視から価格反応重視になりました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "10月28日，crypto.com宣布进行1亿美元的营销推广。我可以找到的最多的关于它的报道是\n我在这个分论坛上能找到的最多的关于它的讨论是一个300票的帖子\n提到了马特-达蒙的交易。\n\n现在有很多帖子都在谈论这次推广，因为人们看到CRO\n一周内翻倍，但我们需要问......",
      "title": "这个分论坛在宣布Crypto.com的1亿美元营销计划时，没有讨论该计划。我们已经从新闻导向变成了价格反应导向"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "10月28日，crypto.com宣佈進行1億美元的營銷推廣。我可以找到的最多的關於它的報道是\n我在這個分論壇上能找到的最多的關於它的討論是一個300票的帖子\n提到了馬特-達蒙的交易。\n\n現在有很多帖子都在談論這次推廣，因爲人們看到CRO\n一週內翻倍，但我們需要問......",
      "title": "這個分論壇在宣佈Crypto.com的1億美元營銷計劃時，沒有討論該計劃。我們已經從新聞導向變成了價格反應導向"
    }
  ]
}