{
  "author": "Chicano_Ducky",
  "original_created_utc": 1640086564,
  "title": "In Chinese Feng Shui buildings must be built with doors facing south for bedrooms, west for kitchens, and other very specific rules for how buildings can be designed. Is there a historical reason for this?",
  "created_utc": 1640097716,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;These rules seem very specific and part of me wonders if there is a practical and historical reasoning for these rules that had spiritual meaning layered on top of it over time.&lt;/p&gt;\n\n&lt;p&gt;Are there any Chinese historians that can shed light on the reasoning?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/AskHistorians/comments/rlcu6y/in_chinese_feng_shui_buildings_must_be_built_with/",
  "subreddit": "AskHistorians",
  "id": "rlcu6y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These rules seem very specific and part of me wonders if there is a practical\nand historical reasoning for these rules that had spiritual meaning layered on\ntop of it over time.\n\nAre there any Chinese historians that can shed light on the reasoning?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらのルールは非常に特殊であり、実用的なルールがあるのだろうかと思う部分もあります。\nこれらのルールは、精神的な意味が重ねられた歴史的な理由です。\nその上に、長い時間をかけて\n\n中国の歴史家の方で、その理由を明らかにできる方はいらっしゃいますか？",
      "title": "中国の風水では、寝室は南向き、キッチンは西向きなど、建物の設計に非常に細かい決まりがあるんです。これには歴史的な理由があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些规则似乎非常具体，我想知道这些规则是否有一个实际的和历史的理由，而这些理由又有精神上的意义。\n我想知道这些规则是否有一个实际的和历史的理由，这些规则有精神上的意义，随着时间的推移，它被分层在\n随着时间的推移，这些规则是否有实用和历史的原因，并有精神上的意义。\n\n是否有任何中国历史学家能够阐明其中的道理？",
      "title": "在中国的风水学中，建筑物的门必须朝向南方的卧室，西方的厨房，以及其他非常具体的建筑物设计规则。这有什么历史原因吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些規則似乎非常具體，我想知道這些規則是否有一個實際的和歷史的理由，而這些理由又有精神上的意義。\n我想知道這些規則是否有一個實際的和歷史的理由，這些規則有精神上的意義，隨着時間的推移，它被分層在\n隨着時間的推移，這些規則是否有實用和歷史的原因，並有精神上的意義。\n\n是否有任何中國歷史學家能夠闡明其中的道理？",
      "title": "在中國的風水學中，建築物的門必須朝向南方的臥室，西方的廚房，以及其他非常具體的建築物設計規則。這有什麼歷史原因嗎？"
    }
  ]
}