{
  "author": "khordicrypto",
  "the_new_excerpt": "I shit you not with the fast movement of Cardano in this last 3 weeks its fast\nbecoming a crypto people want to purchase and rightly so it is still undervalued\nimo.\n\nI am seeing a lot of people asking where can you buy it, I am from Scotland and\nuse binance.com I believe Kraken also sell it but…",
  "original_created_utc": 1614044602,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我操你妈的，卡达诺在过去3周的快速行动，其速度之快，令人咋舌。\n成为人们想要购买的加密货币，理所当然，它的价值仍然被低估了\nimo。\n\n我看到很多人在问你在哪里可以买到它，我来自苏格兰和\n用binance.com我相信Kraken也有卖，但是......",
      "title": "为什么ADA不在Coinbase上？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我操你媽的，卡達諾在過去3周的快速行動，其速度之快，令人咋舌。\n成爲人們想要購買的加密貨幣，理所當然，它的價值仍然被低估了\nimo。\n\n我看到很多人在問你在哪裏可以買到它，我來自蘇格蘭和\n用binance.com我相信Kraken也有賣，但是......",
      "title": "爲什麼ADA不在Coinbase上？"
    }
  ],
  "title": "Why the fuck is ADA not on Coinbase?",
  "created_utc": 1614055302,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I shit you not with the fast movement of Cardano  in this last 3 weeks its fast becoming a crypto people want to purchase and rightly so it is still undervalued imo.</p>\n\n<p>I am seeing a lot of people asking where can you buy it, I am from Scotland and use binance.com I believe Kraken also sell it but there are numerous other exchanges.. but there are a lot of people who should be able to buy ADA from Coinbase but can’t as its not listed.</p>\n\n<p>THE FUCK IS GOING ON!?!!!!</p>\n\n<p>Coinbase hosts a huge list of crypto currencys from BTC , ETH , XLM even that shit coin XRP.</p>\n\n<p>It makes no sense what so ever why ADA isnt on their exchange soon as it goes on expect an instant increase in price and watch the adoption rates ramp up.</p>\n\n<p>Maybe this is the reason Coinbase , Gemini and exchanges the like are scared the market cap of this could flip the likes of ETH and cause a ruckus who knows but there is literaly no valid reason this crypto should not be on there to purchase right now!</p>\n\n<p>This isn’t Doge this isn’t some fad this is backed by 25 Universities has numerous whitepapers on how it works and is also future proof.</p>\n\n<p>Would be good to hear other views as something isn’t adding up.</p>\n</div><!-- SC_ON -->",
  "score": 551,
  "permalink": "/r/CryptoCurrency/comments/lq5yxl/why_the_fuck_is_ada_not_on_coinbase/",
  "subreddit": "CryptoCurrency",
  "id": "lq5yxl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880673
}