{
  "author": "superlative_dingus",
  "original_created_utc": 1652886111,
  "title": "To what extent did Romano-British culture survive into the Middle Ages? Did Roman culture influence early medieval Welsh and Cornish culture?",
  "created_utc": 1652905207,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m interested in the fate of the Romano-Britons and the vestiges of Roman culture on the island of Great Britain in the period following the departure of Roman authorities and during the formative years of Anglo-Saxon settlement. My rough understanding drawn from media such as The Last Kingdom and other fictional depictions of the period was that the future Welsh/Cornish peoples held onto a sense of their Roman-influenced heritage long into the period of Germanic occupation. Indeed, the consensus appears to be that most famous Welsh folk legend, that of King Arthur, seems to be widely held to be a corruption of legends surrounding the lives of post-Roman Britonnic leaders fighting the investing Anglo-Saxons. However, the &lt;a href=\"https://upload.wikimedia.org/wikipedia/commons/d/d6/Roman.Britain.Romanisation.jpg\"&gt;map&lt;/a&gt; heading the Wikipedia article on Romano-British culture seems to indicate that the future Wales and Cornwall were among the least romanized regions of Roman Britain. Later in the same article is another &lt;a href=\"https://upload.wikimedia.org/wikipedia/commons/f/f9/Britonia6hcentury.png\"&gt;map&lt;/a&gt; showing that the Britons has already lost control of the most romanized areas of the island by the 6th century and we’re beginning to be restricted to Wales, Devon, Cornwall, the Lake District, and Galloway. This leads me to a few questions. If the areas where Brittonic language and culture survived after Anglo-Saxon settlement were the least romanized areas of former Roman Britain, then to what extent was there any influence of Roman culture on the medieval Britons? And, what happened to the Britons in those more Romanized areas which were settled by Anglo-Saxons? Did they move west and north to join their brethren, or were they subsumed by the Germanic newcomers? And, given that Christianity (brought to the island by the Romans) survived amongst the medieval Britons but did not make substantial inroads into the Anglo-Saxons until the Gregorian Mission, did Christianity itself carry cultural connotations of “Roman-ness” to the Britons who practiced it in the early medieval period? I’m generally interested in anything and everything related to this topic, so if you have something to add about it even if I didn’t explicitly ask, please enlighten me anyways!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/usexr0/to_what_extent_did_romanobritish_culture_survive/",
  "subreddit": "AskHistorians",
  "id": "usexr0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m interested in the fate of the Romano-Britons and the vestiges of Roman\nculture on the island of Great Britain in the period following the departure of\nRoman authorities and during the formative years of Anglo-Saxon settlement. My\nrough understanding drawn from media such as The Last Kingdom and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロマノ・ブライトンの運命とローマの名残に興味がある\nローマ帝国当局が去った後、アングロサクソンの形成期にあるグレートブリテン島でのローマ文化の名残とその運命に興味がある。\nローマ帝国当局が去った後、アングロサクソンの入植が始まった時期のグレートブリテン島におけるローマ人の運命とローマ文化の名残に興味があります。私の\nラスト・キングダム』などのメディアから得た大まかな理解...",
      "title": "ローマ・イギリス文化は中世までどの程度残っていたのでしょうか。ローマ文化は、中世初期のウェールズやコーニッシュの文化に影響を与えたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对罗马-英国人的命运和罗马文化的残余感兴趣。\n兴趣的是，在罗马人离开大不列颠岛后的那段时间里，罗马文化在大不列颠岛的残余。\n在罗马当局离开后和盎格鲁-撒克逊人定居的形成时期，罗马-不列颠人的命运和罗马文化的残余。我的\n从《最后的王国》等媒体中得出的粗浅认识。",
      "title": "罗马-英国文化在多大程度上延续到了中世纪？罗马文化是否影响了中世纪早期的威尔士和康尼什文化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對羅馬-英國人的命運和羅馬文化的殘餘感興趣。\n興趣的是，在羅馬人離開大不列顛島後的那段時間裏，羅馬文化在大不列顛島的殘餘。\n在羅馬當局離開後和盎格魯-撒克遜人定居的形成時期，羅馬-不列顛人的命運和羅馬文化的殘餘。我的\n從《最後的王國》等媒體中得出的粗淺認識。",
      "title": "羅馬-英國文化在多大程度上延續到了中世紀？羅馬文化是否影響了中世紀早期的威爾士和康尼什文化？"
    }
  ]
}