{
  "author": "PuffLaser",
  "original_created_utc": 1650640308,
  "title": "Why do people online believe that just because you explain a concept, you \"believe in or support\" that concept?",
  "created_utc": 1650653123,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s say I explain why some people litter. I&amp;#39;ll get tons of negative replies and downvotes because people think that I&amp;#39;m standing up for littering. Are people really so [redacted] that they can&amp;#39;t see the difference between someone explaining a concept and someone who supports a concept?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/u9gxk4/why_do_people_online_believe_that_just_because/",
  "subreddit": "NoStupidQuestions",
  "id": "u9gxk4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Let's say I explain why some people litter. I'll get tons of negative replies\nand downvotes because people think that I'm standing up for littering. Are\npeople really so [redacted] that they can't see the difference between someone\nexplaining a concept and someone who supports a concept?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、ポイ捨てする人がいる理由を説明するとします。たくさんの否定的なリプライやダウンボートを受けるでしょう。\nというのも、私がポイ捨てを擁護していると思われるからです。果たして\nの違いがわからないほど、人々は本当に[redacted]なのでしょうか？\nを説明する人と、その概念を支持する人の違いがわからないほど、人々は本当に[redacted]なのでしょうか？",
      "title": "なぜネットでは、ある概念を説明したからといって、その概念を「信じている、支持している」と思い込んでしまうのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "比方说，我解释为什么有些人乱丢垃圾。我将得到大量的负面回复\n和降分，因为人们认为我在为乱扔垃圾站台。难道\n人们真的如此[编辑]，以至于他们看不出一个人在解释一个概念和一个人在解释一个概念之间的区别。\n解释一个概念和支持一个概念的人的区别？",
      "title": "为什么网上的人认为，仅仅因为你解释了一个概念，你就 \"相信或支持 \"这个概念？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比方說，我解釋爲什麼有些人亂丟垃圾。我將得到大量的負面回覆\n和降分，因爲人們認爲我在爲亂扔垃圾站臺。難道\n人們真的如此[編輯]，以至於他們看不出一個人在解釋一個概念和一個人在解釋一個概念之間的區別。\n解釋一個概念和支持一個概念的人的區別？",
      "title": "爲什麼網上的人認爲，僅僅因爲你解釋了一個概念，你就 \"相信或支持 \"這個概念？"
    }
  ]
}