{
  "author": "ser_antonii",
  "the_new_excerpt": "I recently watched a video about a YouTuber who shed light on a frightening but\nreal issue that takes place on YouTube. This individual was wrote to by a\ncompany telling him that he could make serious money by doing what he does\nalready, all he has to do is mention a few specific penny stocks to his…",
  "original_created_utc": 1611715765,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近看了一个视频，是关于一个YouTuber的视频，他揭示了一个可怕的但是\n真正的问题，发生在YouTube上。这个人是由一个\n公司告诉他，他可以通过做他所做的事情赚大钱。\n已经，他所要做的就是提到一些特定的仙股，以他的... ...",
      "title": "在YouTube上要小心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近看了一個視頻，是關於一個YouTuber的視頻，他揭示了一個可怕的但是\n真正的問題，發生在YouTube上。這個人是由一個\n公司告訴他，他可以通過做他所做的事情賺大錢。\n已經，他所要做的就是提到一些特定的仙股，以他的... ...",
      "title": "在YouTube上要小心。"
    }
  ],
  "title": "Be careful on YouTube.",
  "created_utc": 1611731419,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently watched a video about a YouTuber who shed light on a frightening but real issue that takes place on YouTube. This individual was wrote to by a company telling him that he could make serious money by doing what he does already, all he has to do is mention a few specific penny stocks to his audience throughout his videos. This is unnerving and the company representative admitted to this YouTuber that he was already working with (and paying) dozens of popular investing channels. This is clearly a pump and dump scheme by this company in a effort to raise the penny stock’s price, only for it to crash down later. Everyone wins except the audience tuning into these videos to learn and get some investment tips. I’m sure there are genuine YouTubers out there who really want to educate and help people with investing but it’s better to be cautious and always do your own research first. Ultimately, what you do with your money has to be decided by you alone.</p>\n</div><!-- SC_ON -->",
  "score": 369,
  "permalink": "/r/stocks/comments/l5uj72/be_careful_on_youtube/",
  "subreddit": "stocks",
  "id": "l5uj72",
  "is_self": true,
  "media": null,
  "is_video": false
}