{
  "author": "Fuligo_septica",
  "original_created_utc": 1624579600,
  "title": "Mass graves of Indigenous peoples keep getting discovered at the sites of Canadian residential schools. Should I expect mass graves to be found at Aboriginal missions here in Australia?",
  "created_utc": 1624587172,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just 4 hours ago, <a href=\"https://www.bbc.com/news/world-us-canada-57592243\">even more mass graves were found at the site of a Canadian residential school</a>. Considering that this source is the BBC, I strongly doubt that a British media outlet are fabricating or exaggerating an atrocity that makes a close ally like Canada look bad.</p>\n\n<p>Australia had the <a href=\"https://en.wikipedia.org/wiki/Stolen_Generations\">Stolen Generations</a>. In 1997, a governmental inquiry into this was published, known as the <a href=\"https://www.aph.gov.au/About_Parliament/Parliamentary_Departments/Parliamentary_Library/pubs/BN/0708/BringingThemHomeReport#:%7E:text=On%2026%20May%201997%20the,Home%2C%20was%20tabled%20in%20Parliament.&amp;text=A%20key%20recommendation%20in%20the,by%20policies%20of%20forced%20removal.\">&quot;Bringing Them Home&quot; report</a>. The report estimated that between 1 in 10 and 1 in 3 Indigenous Australian children were forcibly taken from their families and communities between 1910 and 1970. These children were then put into the care of Aboriginal missions run by governmental or church groups, which, like the <a href=\"https://en.wikipedia.org/wiki/Canadian_Indian_residential_school_system\">Canadian residential schools</a>, were rife with abuse.</p>\n\n<p>Do historians expect that there are mass graves at Aboriginal missions in Australia? If not, why not?</p>\n\n<p>On a side note, is the &quot;Bringing Them Home&quot; report trustworthy? Or is even the &quot;between 1 in 10 and 1 in 3&quot; estimate in the report a deliberate underestimate by our government?</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/o7c9rc/mass_graves_of_indigenous_peoples_keep_getting/",
  "subreddit": "AskHistorians",
  "id": "o7c9rc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just 4 hours ago, even more mass graves were found at the site of a Canadian\nresidential school [https://www.bbc.com/news/world-us-canada-57592243].\nConsidering that this source is the BBC, I strongly doubt that a British media\noutlet are fabricating or exaggerating an atrocity that makes a close…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ちょうど4時間前、カナダのレジデンシャル・スクールの跡地でさらに多くの集団墓地が発見されました。\nカナダのレジデンシャル・スクール[https://www.bbc.com/news/world-us-canada-57592243]。\nこの情報源がBBCであることを考えると、イギリスのメディアがこのような残虐行為を捏造したり誇張したりしているとはとても思えません。\nこのような残虐な事件を、イギリスのメディアが捏造したり誇張したりするとは思えません。",
      "title": "カナダのレジデンシャル・スクールの跡地では、先住民の大量の墓が次々と発見されています。ここオーストラリアでも、アボリジニのミッションで大量の墓が発見されると期待していいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就在4小时前，在加拿大一所寄宿学校的所在地发现了更多的万人坑。\n居住学校[https://www.bbc.com/news/world-us-canada-57592243]。\n考虑到这一消息来源是英国广播公司，我强烈怀疑一家英国媒体\n我强烈怀疑一个英国媒体是否在捏造或夸大一个暴行，而这个暴行让人很难相信。",
      "title": "在加拿大寄宿学校的所在地不断发现原住民的乱葬岗。我是否应该期待在澳大利亚这里的原住民传教所发现乱葬岗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就在4小時前，在加拿大一所寄宿學校的所在地發現了更多的萬人坑。\n居住學校[https://www.bbc.com/news/world-us-canada-57592243]。\n考慮到這一消息來源是英國廣播公司，我強烈懷疑一家英國媒體\n我強烈懷疑一個英國媒體是否在捏造或誇大一個暴行，而這個暴行讓人很難相信。",
      "title": "在加拿大寄宿學校的所在地不斷髮現原住民的亂葬崗。我是否應該期待在澳大利亞這裏的原住民傳教所發現亂葬崗？"
    }
  ]
}