{
  "author": "getspothome",
  "original_created_utc": 1645273400,
  "title": "I built an amber alerts service for when pets go missing",
  "created_utc": 1645282145,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey &lt;a href=\"/r/sideprojects\"&gt;r/sideprojects&lt;/a&gt;. I wanted to share an app that I built on the side over the last year. &lt;a href=\"https://www.findspot.app\"&gt;Spot&lt;/a&gt; is an amber alerts system built specifically for bringing lost pets home as quickly and safely as possible. I have two rescue pups in my home, and would be terrified if they ever ran off.&lt;/p&gt;\n\n&lt;p&gt;Currently, I have an &lt;a href=\"https://apps.apple.com/us/app/spot-bring-pets-home-faster/id1498398482?ls=1\"&gt;iOS app&lt;/a&gt; that enables you to receive notifications of lost pets in your area. You can view a feed of pets that are missing in your area, as well as globally. You can even share the alerts with others on social media, or if you know someone nearby that may have seen them. Through the app, you can contact the pet owner and let them know that you have found or seen their pet. You can also view all pets that have been found through the app.&lt;/p&gt;\n\n&lt;p&gt;I am now working on growing the network, so that when a pet goes missing, there is a large number of users to receive an alert of a missing pet and help them get home to their family. If you’re an iOS user and you’d like to join me on my mission to bringing missing pets home safely, I’d love to hear what you think and how I can make improvements too.&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n\n&lt;p&gt;The Spot Family&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/sw8wlo/i_built_an_amber_alerts_service_for_when_pets_go/",
  "subreddit": "SideProject",
  "id": "sw8wlo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey r/sideprojects [/r/sideprojects]. I wanted to share an app that I built on\nthe side over the last year. Spot [https://www.findspot.app] is an amber alerts\nsystem built specifically for bringing lost pets home as quickly and safely as\npossible. I have two rescue pups in my home, and would be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "やあ、r/sideprojects [/r/sideprojects]。私が作ったアプリを共有したいと思います。\nこの1年間、副業として スポット[https://www.findspot.app]は琥珀色の警告を発するものです。\n迷子のペットをできるだけ早く、安全に家に帰すことに特化したシステムです。\n可能です。私の家には2匹のレスキューされた子犬がいますが、...",
      "title": "ペットが行方不明になったときのためのアンバーアラートサービスを構築しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，r/sideprojects [/r/sideprojects]。我想和大家分享一下我在过去一年中建立的一个应用程序\n我想和大家分享我在过去一年中建立的一个应用程序。Spot[https://www.findspot.app]是一个琥珀色警报系统，专门用于将丢失的宠物带回家。\n系统，专门用于尽快和安全地将走失的宠物带回家。\n尽可能快地带回家。我家里有两只获救的小狗，我将会...",
      "title": "我为宠物失踪时建立了一个琥珀警报服务"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，r/sideprojects [/r/sideprojects]。我想和大家分享一下我在過去一年中建立的一個應用程序\n我想和大家分享我在過去一年中建立的一個應用程序。Spot[https://www.findspot.app]是一個琥珀色警報系統，專門用於將丟失的寵物帶回家。\n系統，專門用於儘快和安全地將走失的寵物帶回家。\n儘可能快地帶回家。我家裏有兩隻獲救的小狗，我將會...",
      "title": "我爲寵物失蹤時建立了一個琥珀警報服務"
    }
  ]
}