{
  "author": "getspothome",
  "original_created_utc": 1645273400,
  "title": "I built an amber alerts service for when pets go missing",
  "created_utc": 1645282145,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey &lt;a href=\"/r/sideprojects\"&gt;r/sideprojects&lt;/a&gt;. I wanted to share an app that I built on the side over the last year. &lt;a href=\"https://www.findspot.app\"&gt;Spot&lt;/a&gt; is an amber alerts system built specifically for bringing lost pets home as quickly and safely as possible. I have two rescue pups in my home, and would be terrified if they ever ran off.&lt;/p&gt;\n\n&lt;p&gt;Currently, I have an &lt;a href=\"https://apps.apple.com/us/app/spot-bring-pets-home-faster/id1498398482?ls=1\"&gt;iOS app&lt;/a&gt; that enables you to receive notifications of lost pets in your area. You can view a feed of pets that are missing in your area, as well as globally. You can even share the alerts with others on social media, or if you know someone nearby that may have seen them. Through the app, you can contact the pet owner and let them know that you have found or seen their pet. You can also view all pets that have been found through the app.&lt;/p&gt;\n\n&lt;p&gt;I am now working on growing the network, so that when a pet goes missing, there is a large number of users to receive an alert of a missing pet and help them get home to their family. If you’re an iOS user and you’d like to join me on my mission to bringing missing pets home safely, I’d love to hear what you think and how I can make improvements too.&lt;/p&gt;\n\n&lt;p&gt;Thank you!&lt;/p&gt;\n\n&lt;p&gt;The Spot Family&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/sw8wlo/i_built_an_amber_alerts_service_for_when_pets_go/",
  "subreddit": "SideProject",
  "id": "sw8wlo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey r/sideprojects [/r/sideprojects]. I wanted to share an app that I built on\nthe side over the last year. Spot [https://www.findspot.app] is an amber alerts\nsystem built specifically for bringing lost pets home as quickly and safely as\npossible. I have two rescue pups in my home, and would be…"
}