{
  "author": "ipetgoat1984",
  "original_created_utc": 1648514960,
  "title": "I’m so full of shit.",
  "created_utc": 1648535483,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Every time we get into a dip/crash/downturn, whatever; I say to myself “I’m going to pull profits the next time I see any.” And then the slightest bit of green happens, and my whole sentiment changes to “I’m never fucking leaving!”. &lt;/p&gt;\n\n&lt;p&gt;It takes more discipline to sell than to buy. Give me two beers and a shot; I’m buying everything like I’m Warren fucking Buffet. But when it comes to selling, I am totally inept and whatever conviction I had during the bear goes straight out the window. &lt;/p&gt;\n\n&lt;p&gt;Maybe this is my future self telling me to hold, or perhaps this is greed. Whatever the case, I’m full of shit.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 350,
  "permalink": "/r/CryptoCurrency/comments/tqnt69/im_so_full_of_shit/",
  "subreddit": "CryptoCurrency",
  "id": "tqnt69",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Every time we get into a dip/crash/downturn, whatever; I say to myself “I’m\ngoing to pull profits the next time I see any.” And then the slightest bit of\ngreen happens, and my whole sentiment changes to “I’m never fucking leaving!”.\n\nIt takes more discipline to sell than to buy. Give me two beers…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ディップ、クラッシュ、ダウンターンに入るたびに、私は自分に言い聞かせる。\n次に何かあったら、利益を引き出そうと思っています。そして、ほんのわずかな\nが起きると、「絶対帰らないぞ！」という気持ちに変わる。\n\n買うより売る方が、より訓練が必要なのです。ビールを2本くれ...",
      "title": "もう、お腹いっぱいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我们遇到下跌/暴跌/回落等情况时，我都会对自己说：\"下次再看到这种情况，我就把利润撤掉。\n下次看到任何情况时，我都要拉动利润。\" 然后，只要有一丁点的绿色出现\n发生，我的整个情绪就会变成 \"我他妈的永远不会离开！\"。\n\n卖出比买入需要更多的纪律。给我两瓶啤酒...",
      "title": "我是如此的满腹经纶。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我們遇到下跌/暴跌/回落等情況時，我都會對自己說：\"下次再看到這種情況，我就把利潤撤掉。\n下次看到任何情況時，我都要拉動利潤。\" 然後，只要有一丁點的綠色出現\n發生，我的整個情緒就會變成 \"我他媽的永遠不會離開！\"。\n\n賣出比買入需要更多的紀律。給我兩瓶啤酒...",
      "title": "我是如此的滿腹經綸。"
    }
  ]
}