{
  "author": "DDelphinus",
  "the_new_excerpt": "Everyone has $$$ in their eyes seeing how random NFTs are selling for huge\namounts.\n\nIf you want to get into selling NFTs, you need to: - Be a famous person like\nJack Dorsey - Be a famous artist like Beeple - Into money laundering (all\nothers)\n\nRegular people don't spend thousands of dollars for a…",
  "original_created_utc": 1616856757,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家看到随便的NFT都能卖出巨额的价格，眼里都有$$$$。\n数额。\n\n如果你想进入销售NFTs，你需要。- 成为一个名人，比如\n杰克-多西--做一个像哔哩哔哩一样的著名艺术家--进入洗钱（全部\n其他）)\n\n普通人不会花几千块钱买个... ...",
      "title": "改变我的想法。非自由贸易区是为洗钱和名人服务的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家看到隨便的NFT都能賣出鉅額的價格，眼裏都有$$$$。\n數額。\n\n如果你想進入銷售NFTs，你需要。- 成爲一個名人，比如\n傑克-多西--做一個像嗶哩嗶哩一樣的著名藝術家--進入洗錢（全部\n其他）)\n\n普通人不會花幾千塊錢買個... ...",
      "title": "改變我的想法。非自由貿易區是爲洗錢和名人服務的。"
    }
  ],
  "title": "Change my mind: NFTs are for money laundering and famous people",
  "created_utc": 1616873428,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyone has $$$ in their eyes seeing how random NFTs are selling for huge amounts.</p>\n\n<p>If you want to get into selling NFTs, you need to:\n - Be a famous person like Jack Dorsey \n - Be a famous artist like Beeple\n - Into money laundering (all others)</p>\n\n<p>Regular people don&#39;t spend thousands of dollars for a link to an online picture (which disappears when the web hoster quits) and can easily be copied. Your NFT is generally not hosted on the Blockchain.</p>\n\n<p>The reason I&#39;m posting this is because many people are paying upwards of $50,- in transaction fees to get their NFTs published only for no one to buy them.</p>\n\n<p>If you want to make money, invest these transaction fees wisely in crypto and you&#39;re more likely to earn money than selling your NFTs as a non-famous person.</p>\n</div><!-- SC_ON -->",
  "score": 1073,
  "permalink": "/r/CryptoCurrency/comments/mef9v9/change_my_mind_nfts_are_for_money_laundering_and/",
  "subreddit": "CryptoCurrency",
  "id": "mef9v9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357137106
}