{
  "author": "AnchanSan",
  "original_created_utc": 1653221766,
  "title": "Why has Elon Musk Sexual Harassment story died down?",
  "created_utc": 1653232782,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;2 days ago almost every newspaper posted the story of Sexual Harrashment of flight attendant by Elon Musk. However, it seems that he won&amp;#39;t be facing any repercussion for it. There is no calls for his resignation from any of the public companies he&amp;#39;s leading. Also, no discussion or opinion in any of the major news  websites. If you search in Google, there aren&amp;#39;t many stories on it in last 24 hours. Not even Me too activists are posting any opinion pieces about it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/uv9sch/why_has_elon_musk_sexual_harassment_story_died/",
  "subreddit": "NoStupidQuestions",
  "id": "uv9sch",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "2 days ago almost every newspaper posted the story of Sexual Harrashment of\nflight attendant by Elon Musk. However, it seems that he won't be facing any\nrepercussion for it. There is no calls for his resignation from any of the\npublic companies he's leading. Also, no discussion or opinion in any of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2日前、ほぼすべての新聞に、イーロン・マスクが客室乗務員にセクハラをしたという記事が掲載されました。\nを行ったという記事が掲載されました。しかし、この件に関して、彼は何の影響も受けないようである。\nを受けることはなさそうだ。イーロン・マスクが率いる上場企業のいずれからも、辞任を求める声は上がっていない。\nまた また、この件に関する議論や意見もない。",
      "title": "イーロン・マスクのセクハラ話はなぜ沈静化したのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "两天前，几乎所有的报纸都刊登了关于女性性骚扰的故事。\n空姐被埃隆-马斯克性骚扰的故事。然而，他似乎不会面临任何\n反响。没有人要求他从任何一家他领导的上市公司辞职。\n他所领导的任何一家上市公司都没有要求他辞职。此外，在任何一家公司的讨论或意见中都没有...",
      "title": "为什么埃隆-马斯克的性骚扰事件平息了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "兩天前，幾乎所有的報紙都刊登了關於女性性騷擾的故事。\n空姐被埃隆-馬斯克性騷擾的故事。然而，他似乎不會面臨任何\n反響。沒有人要求他從任何一家他領導的上市公司辭職。\n他所領導的任何一家上市公司都沒有要求他辭職。此外，在任何一家公司的討論或意見中都沒有...",
      "title": "爲什麼埃隆-馬斯克的性騷擾事件平息了？"
    }
  ]
}