{
  "author": "twinfiresigns14",
  "original_created_utc": 1653998263,
  "title": "Is licking a minor wound (such as a small cut) generally effective or harmful?",
  "created_utc": 1654012006,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And does being immunocompromised make a difference?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;ETA:&lt;/strong&gt; I’m not immunocompromised, sorry, didn’t realise people would draw that conclusion. I was just curious about what would happen if an immunocompromised person &lt;em&gt;did&lt;/em&gt; lick a cut. Clearly, it’s nothing good.&lt;/p&gt;\n\n&lt;p&gt;The reddit app isn’t letting me reply to posts, but thanks to all who’ve answered so far!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/askscience/comments/v1okq2/is_licking_a_minor_wound_such_as_a_small_cut/",
  "subreddit": "askscience",
  "id": "v1okq2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And does being immunocompromised make a difference?\n\nETA: I’m not immunocompromised, sorry, didn’t realise people would draw that\nconclusion. I was just curious about what would happen if an immunocompromised\nperson did lick a cut. Clearly, it’s nothing good.\n\nThe reddit app isn’t letting me reply…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "また、免疫不全であることは、違いをもたらすのでしょうか？\n\nETA: 私は免疫不全ではありません。\n結論に至りませんでした。ただ、免疫不全の人がLCMを使うとどうなるのかが気になりました。\nもし免疫不全の人が切り傷を舐めたとしたらどうなるのだろうと思っただけです。明らかに、良いことは何もありません。\n\nredditのアプリで返信できないんだけど...。",
      "title": "小さな傷（小さな切り傷など）を舐めることは、一般的に有効なのでしょうか、それとも有害なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "而免疫力低下是否会有影响？\n\nETA: 我没有免疫力低下，抱歉，没有意识到人们会得出这个结论。\n结论。我只是好奇，如果一个免疫力低下的人舔了伤口，会发生什么？\n的人舔了一个伤口会怎么样。很明显，这不是什么好事。\n\nreddit应用程序不允许我回复...",
      "title": "舔一个小伤口（如一个小伤口）一般是有效还是有害？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "而免疫力低下是否會有影響？\n\nETA: 我沒有免疫力低下，抱歉，沒有意識到人們會得出這個結論。\n結論。我只是好奇，如果一個免疫力低下的人舔了傷口，會發生什麼？\n的人舔了一個傷口會怎麼樣。很明顯，這不是什麼好事。\n\nreddit應用程序不允許我回復...",
      "title": "舔一個小傷口（如一個小傷口）一般是有效還是有害？"
    }
  ]
}