{
  "author": "anakanin",
  "the_new_excerpt": "A Beginner's Guide to Cryptocurrency Wallets\n\n\n\nA cryptocurrency wallet is basically a software that enables you to track, send\nand receive coins through the blockchain like a bank account. Every wallet has a\npublic key and a private key, but we'll get back to this later. But first...\n\n\n\n\nWHY DO YOU…",
  "original_created_utc": 1623869218,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号通貨ウォレットの初心者向けガイド\n\n\n\n暗号通貨ウォレットとは、基本的には、コインの追跡、送信、受信を可能にするソフトウェアのことです。\n銀行口座のように、ブロックチェーンを通じてコインを追跡、送信、受信できるソフトウェアです。すべてのウォレットには、公開鍵と秘密鍵があります。\n公開鍵と秘密鍵がありますが、これについては後ほど説明します。その前に...\n\n\n\n\nWHY DO YOU...",
      "title": "初心者のためのクリプトウォレット完全ガイド"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币钱包的新手指南\n\n\n\n加密货币钱包基本上是一个软件，使你能够通过区块链跟踪、发送\n并通过区块链接收硬币，就像一个银行账户。每个钱包都有一个\n公钥和私钥，但我们稍后会回到这个问题上。但首先...\n\n\n\n\n你为什么要...",
      "title": "加密货币钱包的完整入门指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣錢包的新手指南\n\n\n\n加密貨幣錢包基本上是一個軟件，使你能夠通過區塊鏈跟蹤、發送\n並通過區塊鏈接收硬幣，就像一個銀行賬戶。每個錢包都有一個\n公鑰和私鑰，但我們稍後會回到這個問題上。但首先...\n\n\n\n\n你爲什麼要...",
      "title": "加密貨幣錢包的完整入門指南"
    }
  ],
  "title": "Complete Beginners' guide to crypto wallets",
  "created_utc": 1623901112,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>A Beginner&#39;s Guide to Cryptocurrency Wallets</strong></p>\n\n<p>&#x200B;</p>\n\n<p>A cryptocurrency wallet is basically a software that enables you to track, send and receive coins through the blockchain like a bank account. Every wallet has a public key and a private key, but we&#39;ll get back to this later. But first...</p>\n\n<p>&#x200B;</p>\n\n<h1>Why do you need a wallet?</h1>\n\n<p>&#x200B;</p>\n\n<p>There&#39;s an old saying in Tennessee that says: **&quot;Not your keys, not your coins.&quot;** What it actually means is that if you keep your cryptocurrencies on an exchange (such as Coinbase, Binance or Kraken), you don&#39;t actually own those coins, because you don&#39;t have the keys to the related wallet. You gain access to those wallets by logging into these exchanges, but your account can - theoretically - be deleted in the blink of an eye, or the exchange can get hacked, attacked, etc. And with it, your funds can disappear forever. If you want to learn more about this, make sure to look up Mt. Gox&#39;s hacking. It is an unfortunate event, but one that puts you on guard.</p>\n\n<p>&#x200B;</p>\n\n<p>So you already know that you need to own your keys in order to own your coins. **But what are these keys?**</p>\n\n<p>&#x200B;</p>\n\n<p>Your **public key** is what identifies your account on the network. Think of it as your email address, because when someone wants to send you cryptocurrency, they will send it to this address.</p>\n\n<p>&#x200B;</p>\n\n<p>Your **private key** is a string of 64 characters that can be generated from a 12-word seed phrase. It basically serves as the password of your account. It is used to sign transactions and to prove that you own the related public key.</p>\n\n<p>&#x200B;</p>\n\n<p>See, it&#39;s not that complicated, is it?</p>\n\n<p>&#x200B;</p>\n\n<h1>About wallet types</h1>\n\n<p>There are 4 types of wallets that you should be using. Ideally, you can pick the one that fits your crypto habits the most. You should avoid using Web wallets. As always, if you can, please pick the safest wallet type in order to minimize the risk of losing your cryptos.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Hardware / Offline / Cold Wallet</em></strong>- an offline storage device (e.g. hard disk, USB stick). You might&#39;ve heard the names Ledger or Trezor, these are the 2 biggest brands at the moment. The ledger supports over 1200 cryptocurrencies, while Trezor supports over a thousand. It is also the most secure way to store your cryptocurrencies.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Mobile Wallet</em></strong>- applications that are installable on your mobile phone. Beware that even though an app can hold crypto, it doesn&#39;t mean it is NOT custodial. (e.g. Coinbase has a mobile app, but it is custodial, meaning that they control your coins.) Exodus or Atomic mobile apps are recommended if you decide to create a mobile wallet.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Desktop Wallet</em></strong>- wallets that are installable on different desktops and are compatible with Windows, Mac, and Linux. Your keys are stored on your computer, and you can use this wallet even when you&#39;re offline. Note: Desktop wallets tend to be more advanced than mobile wallets, and usually come with more technically complicated features that can increase privacy or allow for more flexibility when it comes to signing transactions.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Paper wallet</em></strong>- a paper wallet is essentially a piece of paper including your public and private key, or a QR code (so that you can quickly scan them and add the keys to a software wallet to make a transaction). It&#39;s a really safe way to store your cryptos because your keys are not connected to any servers. The only way someone can steal your cryptos is if they steal this paper.</p>\n\n<p>&#x200B;</p>\n\n<p>If you choose to go the physical way of storing keys I highly recommend that you buy a piece of soft metal and a cheapest dremel tool to etch the keys into the plate. it takes about 20 minutes to get it done but its 1000x times safer. Paper burns, gets wet, gets eaten by pets and such.</p>\n\n<p>&#x200B;</p>\n\n<h1>The Best Hardware Wallets</h1>\n\n<p><strong><em>Ledger Nano (S and X)</em></strong>- The most popular hardware wallet brand in the world, currently sells 2 different sticks. The S is the cheaper alternative, but if you handle transactions between multiple cryptocurrencies frequently, the larger storage of the Nano X should be more convenient. The Nano X also has Bluetooth 5.0 support. You can read more about Ledgers on their website.</p>\n\n<p>&#x200B;</p>\n\n<p>Beware that **Ledger was targeted by a cyberattack that led to a data breach** in July 2020. A larger subset of detailed information has been leaked, approximately 272,000 detailed information such as postal address, last name, first name, and telephone number of our customers. However, not a single coin was stolen as hackers didn&#39;t gain access to private keys. Please keep this in mind when making your decision.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Trezor (One and Model T)</em></strong>- Trezor is the other popular hardware wallet brand. The Trezor One is the cheaper alternative ($59), while the Model T is more expensive but comes with extended functionality and additionally supports cryptocurrencies such as ADA, XMR, XTZ, etc.</p>\n\n<p>&#x200B;</p>\n\n<p>Despite the security of hardware devices themselves, **the weakest link is always the people using them.** If possible, avoid buying used hardware wallets, even though both Trezor and Ledger have security measures to avoid the attempt of installing malwares.</p>\n\n<p>&#x200B;</p>\n\n<p>DO NOT BUY USED HARDWARE WALLETS or from sites such as EBAY, ALIEXPRESS etc.</p>\n\n<p>Be sure to check the wallet for any signs of tampering before using</p>\n\n<p>&#x200B;</p>\n\n<h1>The Best Desktop Wallets</h1>\n\n<p><strong><em>Exodus</em></strong>- a very user-friendly and easy to understand, reliable wallet. As of now, it is probably the most popular desktop wallet. Available on Windows, Mac and Linux as well.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Atomic</em></strong>- it is also a user-friendly and reliable wallet. Atomic supports 500+ assets and allows staking various cryptocurrencies. Available on Windows, Mac and Linux.</p>\n\n<p>&#x200B;</p>\n\n<p><strong><em>Metamask</em></strong>- arguably the best browser based wallet with the best support. Works best with Chrome and even Brave (as its a Chromium based browser).</p>\n\n<p>&#x200B;</p>\n\n<p>Of course, there are several other reliable desktop wallets, but these two proved to be the most user-friendly and easy to use wallets so far. As always, please DYOR!</p>\n\n<p>&#x200B;</p>\n\n<h1>The Best Mobile Wallets</h1>\n\n<p>Exodus and Atomic wallet are great also on mobile but if you want you can also check these below</p>\n\n<p>Trust- Trust has been getting very popular and I particularly like it because of a solid browser integrated in app and the ability to seamlessly store tons of different crypto.</p>\n\n<p><strong><em>Jaxx Liberty</em></strong>-Weird name but a very solid multicoin app.</p>\n\n<p>&#x200B;</p>\n\n<p>Note: many coins have their specific wallets such as Algo, ADA, VET and others. Those wallets sometimes have perks such as staking, delegating and such.</p>\n\n<p>&#x200B;</p>\n\n<p>Last piece of advice: always be cautious and double-check everything. Keep your devices malware-free, and don&#39;t click on anything suspicious (such as emails from &quot;Binnance&quot;, crazy bonus links from &quot;Coimbase&quot;, etc.)</p>\n\n<p>&#x200B;</p>\n\n<p>Guide was originally written by <a href=\"/u/Weaver96\">u/Weaver96</a> I added a few updates to it.</p>\n\n<p>&#x200B;</p>\n\n<p><sup>edited formatting</sup></p>\n</div><!-- SC_ON -->",
  "score": 254,
  "permalink": "/r/CryptoCurrency/comments/o1c75n/complete_beginners_guide_to_crypto_wallets/",
  "subreddit": "CryptoCurrency",
  "id": "o1c75n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009740009
}