{
  "author": "GrayNish",
  "original_created_utc": 1645258805,
  "title": "Why people so obsessed with preventing suicide but doesn't care about their living before or after?",
  "created_utc": 1645284444,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For someone to go over the edge and actually try to suicide, they must have suffered a lot in life. Maybe they&amp;#39;re in some mess with no way out but no one try to reach out for them to get them out of that suffering. Now that they can go longer go on with it, they decided to end it all.&lt;/p&gt;\n\n&lt;p&gt;This is the point where everyone lose their shit and do everything in their power to prevent the suicider from death, and may even condemn them for attempting so.  and then go on merry way about how they just saved one life&lt;/p&gt;\n\n&lt;p&gt;but after that? they get thrown out into the same society, same suffering, same mess nothing. which will eventually lead to them attempting the suicide again.&lt;/p&gt;\n\n&lt;p&gt;Society don&amp;#39;t let them live but won&amp;#39;t let them die as well.&lt;/p&gt;\n\n&lt;p&gt;shouldn&amp;#39;t those who don&amp;#39;t really have a life be allowed to end it if they choose so?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/sw55ry/why_people_so_obsessed_with_preventing_suicide/",
  "subreddit": "TooAfraidToAsk",
  "id": "sw55ry",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For someone to go over the edge and actually try to suicide, they must have\nsuffered a lot in life. Maybe they're in some mess with no way out but no one\ntry to reach out for them to get them out of that suffering. Now that they can\ngo longer go on with it, they decided to end it all.\n\nThis is the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自殺を試みるような人は、よっぽどのことがないとできない。\n人生において、多くの苦しみを味わった。出口のない混乱に陥っているのかもしれませんが、誰一人\nその苦しみから抜け出すために、手を差し伸べようとする。今、彼らができることは\nこのままではいけないと思い、すべてを終わらせることにしたのです。\n\nこれは...",
      "title": "なぜ人々は自殺を防ぐことに執着するのか、しかしその前後の生活には無関心なのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于一个人来说，要想越过边缘并真正尝试自杀，他们必须在生活中遭受很多痛苦。\n在生活中遭受了很多痛苦。也许他们处于某种混乱之中，没有出路，但没有人\n试图向他们伸出援手，让他们摆脱这种痛苦。现在，他们可以\n不再继续下去了，他们决定结束这一切。\n\n这是...",
      "title": "为什么人们对防止自杀如此痴迷，却不关心他们的生活前后？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於一個人來說，要想越過邊緣並真正嘗試自殺，他們必須在生活中遭受很多痛苦。\n在生活中遭受了很多痛苦。也許他們處於某種混亂之中，沒有出路，但沒有人\n試圖向他們伸出援手，讓他們擺脫這種痛苦。現在，他們可以\n不再繼續下去了，他們決定結束這一切。\n\n這是...",
      "title": "爲什麼人們對防止自殺如此癡迷，卻不關心他們的生活前後？"
    }
  ]
}