{
  "author": "musecorn",
  "original_created_utc": 1636726121,
  "title": "My father told me about a stock that did 100%",
  "created_utc": 1636735082,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My father told me about a stock he missed out on investing in. He said that he watched it over that time and eventually it rose 100% in value. TWO YEARS LATER. He was so shocked and impressed and ashamed that he didn&#39;t invest in it when he had the chance.</p>\n\n<p>I looked at him and went....two years? I&#39;ve seen plenty of coins that did quadruple that in a matter of days. He looked at me like I was from another planet.</p>\n\n<p>I think crypto has ruined my concept of value.</p>\n\n<p>It won&#39;t always be like this... it&#39;s really insane when you think about it</p>\n</div><!-- SC_ON -->",
  "score": 481,
  "permalink": "/r/CryptoCurrency/comments/qsbxx8/my_father_told_me_about_a_stock_that_did_100/",
  "subreddit": "CryptoCurrency",
  "id": "qsbxx8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My father told me about a stock he missed out on investing in. He said that he\nwatched it over that time and eventually it rose 100% in value. TWO YEARS LATER.\nHe was so shocked and impressed and ashamed that he didn't invest in it when he\nhad the chance.\n\nI looked at him and went....two years? I've…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "父から、投資し損ねた銘柄の話を聞きました。その間、その銘柄を見守っていたそうです。\nその間様子を見ていたら、最終的には100％値上がりしたそうです。2年後のことです。\n父はとてもショックを受け、感動し、チャンスがあったのに投資しなかったことを恥じた。\n彼はとてもショックを受け、感動し、チャンスがあったのに投資しなかったことを恥じた。\n\n私は彼を見て、....、2年？私は...",
      "title": "父から聞いた、100％の株の話。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我父亲告诉我，他错过了一只股票的投资。他说，他\n观察了一段时间，最终它的价值上升了100%。两年后。\n他非常震惊，印象深刻，并为自己没有在有机会时投资它而感到羞愧。\n有机会的时候没有投资。\n\n我看着他，说：....，两年了？我已经...",
      "title": "我父亲告诉我，有一支股票的业绩是100%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我父親告訴我，他錯過了一隻股票的投資。他說，他\n觀察了一段時間，最終它的價值上升了100%。兩年後。\n他非常震驚，印象深刻，併爲自己沒有在有機會時投資它而感到羞愧。\n有機會的時候沒有投資。\n\n我看着他，說：....，兩年了？我已經...",
      "title": "我父親告訴我，有一支股票的業績是100%。"
    }
  ]
}