{
  "author": "Juub1990",
  "the_new_excerpt": "Great ancient empires like Axum or the Nubians (which I believe was part of\nnorth Africa) have very little about them. I attributed that to the lack of\nwritten sources but it seems we know as much if not more about Mesoamerican\ncivilizations despite their remoteness compared to the old world and…",
  "original_created_utc": 1621419331,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アクスムやヌビア人（北アフリカの一部だったと思う）のような偉大な古代帝国は、ほとんど情報がありません。\n北アフリカの一部だったと思われる）のような古代の大帝国には、ほとんど情報がありません。それは文献がないからだと思っていました。\nしかし、メソアメリカの文明については、旧世界に比べて遠いにもかかわらず、同じくらい、いやそれ以上のことがわかっているようです。\nしかし、メソアメリカ文明については、旧世界と比べて遠いにもかかわらず、同じくらい、あるいはそれ以上に知っているようです。",
      "title": "なぜエジプトや北アフリカ以外のアフリカの歴史はあまり理解されていないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "像阿克苏姆或努比亚（我认为是北非的一部分）这样的伟大的古代帝国，其对中国的了解很少。\n北非的一部分），关于他们的资料非常少。我把这归因于缺乏书面资料。\n但似乎我们对中美洲文明的了解也是如此，甚至更多。\n尽管他们与旧世界相比很遥远，但我们似乎对中美洲文明了解得一样多，甚至更多，而且......",
      "title": "为什么对埃及和北非以外的非洲历史的了解如此之少？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像阿克蘇姆或努比亞（我認爲是北非的一部分）這樣的偉大的古代帝國，其對中國的瞭解很少。\n北非的一部分），關於他們的資料非常少。我把這歸因於缺乏書面資料。\n但似乎我們對中美洲文明的瞭解也是如此，甚至更多。\n儘管他們與舊世界相比很遙遠，但我們似乎對中美洲文明瞭解得一樣多，甚至更多，而且......",
      "title": "爲什麼對埃及和北非以外的非洲歷史的瞭解如此之少？"
    }
  ],
  "title": "Why is African history outside of Egypt and north Africa so poorly understood?",
  "created_utc": 1621443064,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Great ancient empires like Axum or the Nubians (which I believe was part of north Africa) have very little about them. I attributed that to the lack of written sources but it seems we know as much if not more about Mesoamerican civilizations despite their remoteness compared to the old world and lack of written records as well. Whenever I look up great African civilizations outside of Egypt or north Africa, there’s almost nothing. Even relatively modern ones like the kingdom of Kongo or Ethiopia (which if I’m not mistaken has perhaps the most information about it). My question mostly concerns the civilizations during classical antiquity.</p>\n\n<p>Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 140,
  "permalink": "/r/AskHistorians/comments/ng1x0h/why_is_african_history_outside_of_egypt_and_north/",
  "subreddit": "AskHistorians",
  "id": "ng1x0h",
  "is_self": true,
  "media": null,
  "is_video": false
}