{
  "author": "MAARJA007",
  "the_new_excerpt": "https://www.irishtimes.com/business/technology/google-used-double-irish-to-shift-75-4bn-in-profits-out-of-ireland-1.4540519\n\n\n\nGoogle\n[https://www.irishtimes.com/topics/topics-7.1213540?article=true&tag_company=Google]\nshifted more than $75.4 billion (€63 billion) in profits out of the…",
  "original_created_utc": 1618679422,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.irishtimes.com/business/technology/google-used-double-irish-to-shift-75-4bn-in-profits-out-of-ireland-1.4540519\n\n\n\nグーグル\n[https://www.irishtimes.com/topics/topics-7.1213540?article=true&tag_company=Google]\nは、754億ドル（630億ユーロ）以上の利益を海外に移転しました。",
      "title": "グーグル、\"ダブルアイリッシュ \"で754億ドルの利益をアイルランド国外に移転"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.irishtimes.com/business/technology/google-used-double-irish-to-shift-75-4bn-in-profits-out-of-ireland-1.4540519\n\n\n\n谷歌\n[https://www.irishtimes.com/topics/topics-7.1213540?article=true&tag_company=Google]\n将超过754亿美元（630亿欧元）的利润从...",
      "title": "谷歌利用 \"双爱尔兰 \"将754亿美元利润转移出爱尔兰。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.irishtimes.com/business/technology/google-used-double-irish-to-shift-75-4bn-in-profits-out-of-ireland-1.4540519\n\n\n\n谷歌\n[https://www.irishtimes.com/topics/topics-7.1213540?article=true&tag_company=Google]\n將超過754億美元（630億歐元）的利潤從...",
      "title": "谷歌利用 \"雙愛爾蘭 \"將754億美元利潤轉移出愛爾蘭。"
    }
  ],
  "title": "Google uses ‘double-Irish’ to shift $75.4bn in profits out of Ireland",
  "created_utc": 1618686670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.irishtimes.com/business/technology/google-used-double-irish-to-shift-75-4bn-in-profits-out-of-ireland-1.4540519\">https://www.irishtimes.com/business/technology/google-used-double-irish-to-shift-75-4bn-in-profits-out-of-ireland-1.4540519</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.irishtimes.com/topics/topics-7.1213540?article=true&amp;tag_company=Google\">Google</a> shifted more than $75.4 billion (€63 billion) in profits out of the Republic using the controversial “double-Irish” tax arrangement in 2019, the last year in which it used the loophole.</p>\n\n<p>The technology giant availed of the tax arrangement to move the money out of Google <a href=\"https://www.irishtimes.com/news\">Ireland</a> Holdings Unlimited Company via interim dividends and other payments. This company was incorporated in Ireland but tax domiciled in <a href=\"https://www.irishtimes.com/topics/topics-7.1213540?article=true&amp;tag_location=Bermuda\">Bermuda</a> at the time of the transfer.</p>\n\n<p>The move allowed Google Ireland Holdings to escape corporation tax both in the Republic and in the <a href=\"https://www.irishtimes.com/topics/topics-7.1213540?article=true&amp;tag_location=United+States\">United States</a> where its ultimate parent, Alphabet, is headquartered. The holding company reported a $13 billion pretax profit for 2019, which was effectively tax-free, the accounts show.</p>\n\n<p>A year earlier, Google Ireland Holdings paid out dividends of €23 billion, having recorded turnover of $25.7 billion.</p>\n\n<p>Google has used the double Irish loophole to funnel billions in global profits through Ireland and on to Bermuda, effectively put them beyond the reach of US tax authorities.</p>\n\n<p>Companies exploiting the double Irish put their intellectual property into an Irish-registered company that is controlled from a tax haven such as Bermuda. Ireland considers the company to be tax-resident in Bermuda, while the US considers it to be tax-resident here. The result is that when royalty payments are sent to the company, they go untaxed – unless or until the money is eventually sent home to the US parent.</p>\n\n<p>The “double Irish” was abolished in 2015 for new companies establishing operations in the Republic. However, controversially, it allowed those already using it until the end of 2020 to phase it out.</p>\n\n<p>Google overhauled its global tax structure and consolidated its intellectual property holdings back to the United States in early 2020, meaning 2019 was the final year in which it availed of the arrangement.</p>\n\n<p>Up to late 2019, Google Ireland Holdings Unlimited Company was an intellectual property licensing company with turnover derived from the licensing of IP to subsidiaries. The accounts state it had no employees and that it was tax resident at the time in Bermuda, where the “standard rate tax is 0 per cent”.</p>\n\n<p>Commenting on the movement of the profits out of its Irish unit, a spokeswoman for Google said: “In December 2019, in line with the OECD’s base erosion and profit shifting (BEPS) conclusions and changes to US and Irish tax laws, we simplified our corporate structure and started licensing our IP from the US, not Bermuda. The accounts filed today cover the 2019 financial year, before we made those changes.</p>\n\n<p>“Including all annual and one-time income taxes over the past ten years, our global effective tax rate has been over 20 per cent, with more than 80 per cent of that tax due in the US,” she added.</p>\n\n<p>The accounts state that Google Ireland Holdings Unlimited Company became tax resident in Ireland from January 1st, 2021, and that it now just operates as a holding company.</p>\n\n<p>Turnover for the holding company rose from $25.7 billion in 2018 to $26.5 billion in 2019. The increase was primarily due to a rise in turnover recorded by the company’s subsidiaries, which results in higher royalty payments.</p>\n\n<p>Dividend income from shares in group undertakings jumped from just $2.9 million in 2018 to $597.5 million a year later. The accounts also show a $3 billion increase in research and development costs in 2019, with the company incurring R&amp;D expenses of $10.4 billion under a cost-sharing agreement with other Google entities globally.</p>\n\n<p>Google Ireland, the tech company’s main operating Irish subsidiary with over 4,000 employees, recorded €45.7 billion in revenues in 2019 with pretax profits amounting to €1.94 billion. It paid €263 million in tax that year, down nearly €9 million versus 2018.</p>\n\n<p>It is estimated that US multinationals were holding more than a $1 trillion in profits offshore via mechanisms such as the double Irish and the so-called Dutch sandwich by the end of 2017. Tax cuts introduced by former US president <a href=\"https://www.irishtimes.com/topics/topics-7.1213540?article=true&amp;tag_person=Donald+Trump\">Donald Trump</a> in 2019 have led to some of those profits being repatriated to the United States.</p>\n</div><!-- SC_ON -->",
  "score": 3753,
  "permalink": "/r/stocks/comments/msuo56/google_uses_doubleirish_to_shift_754bn_in_profits/",
  "subreddit": "stocks",
  "id": "msuo56",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526205
}