{
  "author": "warkel",
  "original_created_utc": 1656584597,
  "title": "Are Jews, Muslims, and Christians all praying to the same \"One True God\"? Or are they different \"God\"s?",
  "created_utc": 1656601409,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Sorry, I feel like this is stupid, but I felt like I had to ask because I don&amp;#39;t understand the animosity between these religions if they all pray to the same God. From my understanding, they are all Abrahamic religions, which means that they all pray to the same God that Abraham was praying to... right? It&amp;#39;s something like the Trojans and the Greeks hating each other yet all praying to the same Zeus to seize victory over the other, right?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 113,
  "permalink": "/r/NoStupidQuestions/comments/vo52r9/are_jews_muslims_and_christians_all_praying_to/",
  "subreddit": "NoStupidQuestions",
  "id": "vo52r9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Sorry, I feel like this is stupid, but I felt like I had to ask because I don't\nunderstand the animosity between these religions if they all pray to the same\nGod. From my understanding, they are all Abrahamic religions, which means that\nthey all pray to the same God that Abraham was praying to...…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すみません、馬鹿みたいな話なんですが、私が知らないので聞いてみたくなったんです。\n同じ神に祈るのであれば、これらの宗教の間にある敵意が理解できないからです。\n神です。私の理解では、これらの宗教はすべてアブラハムの宗教であり、それはつまり\nアブラハムが祈ったのと同じ神様に祈るということですよね......。",
      "title": "ユダヤ教徒、イスラム教徒、キリスト教徒は、同じ「唯一神」に祈っているのでしょうか？それとも、違う「神」なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对不起，我觉得这很愚蠢，但我觉得我必须要问，因为我不知道。\n我不明白这些宗教之间的敌意，如果他们都向同一个人祈祷的话。\n神。根据我的理解，它们都是亚伯拉罕宗教，这意味着\n他们都向亚伯拉罕所祈求的同一个上帝祈祷，......",
      "title": "犹太人、穆斯林和基督徒都在向同一个 \"唯一的真神 \"祈祷吗？还是说他们是不同的 \"神\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對不起，我覺得這很愚蠢，但我覺得我必須要問，因爲我不知道。\n我不明白這些宗教之間的敵意，如果他們都向同一個人祈禱的話。\n神。根據我的理解，它們都是亞伯拉罕宗教，這意味着\n他們都向亞伯拉罕所祈求的同一個上帝祈禱，......",
      "title": "猶太人、穆斯林和基督徒都在向同一個 \"唯一的真神 \"祈禱嗎？還是說他們是不同的 \"神\"？"
    }
  ]
}