{
  "author": "BrakumOne",
  "original_created_utc": 1632249714,
  "title": "Dear American Citizens. Your Tips and Tricks are appreciated but I live in a first world country.",
  "created_utc": 1632263450,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all notice the COMEDY tag, even though those are all facts I used the tag because I&#39;m not trying to hate on US people (love you), so I&#39;m joking. Joking with the truth though.</p>\n\n<p>Second, I did NOT put all my lifesaving in to crypto.</p>\n\n<p>But if I did then what&#39;s the big deal? Would I be homeless and struggle to survive? No, not really, my life would go on as usual.</p>\n\n<p>Oh but what about 401k? What the fuck is a 401k? You don&#39;t need to tell me, something something retirement. I don&#39;t care. When I&#39;m 65 I retire and get enough money from the government to live a normal life until I die. No questions asked.</p>\n\n<p>But what if I lose my job? Well then I get money from the government to live a normal life for years and in that time frame I&#39;m pretty confident I&#39;ll find a new job.</p>\n\n<p>But what if you or your family have a medical emergency? Then I go to the doctor I guess, which sends me to the hospital or wherever I need to get what I need, sure I would pay a little bit but not really something I&#39;d have to worry about.</p>\n\n<p>Even if all those those things happened to me at once I&#39;d probably do just fine.</p>\n\n<p>Oh and by the way, don&#39;t think I have a good job. I wash dishes and my gf works cleaning in a hotel. Although its relative, compared to most of the world its great, just in the context of where I live, they&#39;re low paying jobs.</p>\n</div><!-- SC_ON -->",
  "score": 224,
  "permalink": "/r/CryptoCurrency/comments/psp2xm/dear_american_citizens_your_tips_and_tricks_are/",
  "subreddit": "CryptoCurrency",
  "id": "psp2xm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First of all notice the COMEDY tag, even though those are all facts I used the\ntag because I'm not trying to hate on US people (love you), so I'm joking.\nJoking with the truth though.\n\nSecond, I did NOT put all my lifesaving in to crypto.\n\nBut if I did then what's the big deal? Would I be homeless…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に、COMEDYのタグに注目してください。これらはすべて事実ですが、私はアメリカ人を嫌うつもりはないので、このタグを使いました。\nタグを使ったのは、アメリカ人を嫌いになりたいわけではないので（あなたを愛しています）、冗談を言っているのです。\n本当のことを言っているんだけどね。\n\n第二に、私は自分の命を守るためのお金をすべて暗号化したわけではありません。\n\nでも、もしそうだとしたら、何が大変なのでしょうか？私はホームレスになってしまうのでしょうか...。",
      "title": "親愛なるアメリカ市民の皆様へ あなたのヒントやコツはありがたいですが、私は第一世界の国に住んでいます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先注意到喜剧标签，尽管这些都是事实，但我使用了\n标签，因为我不是要恨美国人（爱你），所以我是在开玩笑。\n不过是用事实开玩笑。\n\n第二，我没有把我所有的救命钱都投入到加密货币中。\n\n但如果我这样做了，又有什么大不了的呢？我是否会无家可归...",
      "title": "亲爱的美国公民。感谢你们的提示和技巧，但我生活在一个第一世界国家。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先注意到喜劇標籤，儘管這些都是事實，但我使用了\n標籤，因爲我不是要恨美國人（愛你），所以我是在開玩笑。\n不過是用事實開玩笑。\n\n第二，我沒有把我所有的救命錢都投入到加密貨幣中。\n\n但如果我這樣做了，又有什麼大不了的呢？我是否會無家可歸...",
      "title": "親愛的美國公民。感謝你們的提示和技巧，但我生活在一個第一世界國家。"
    }
  ]
}