{
  "author": "Rehochipe",
  "original_created_utc": 1639053605,
  "title": "How many of my fellow females here on reddit got at least once sexually harassed in their life? I feel like it is a lot more common than most people think.",
  "created_utc": 1639064221,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello everyone,\nI saw a post on reddit which stated that only some women/girls get sexually haressed but i actally think most have experienced it at least once in their life.&lt;/p&gt;\n\n&lt;p&gt;I experienced it both in rl and online (23f)&lt;/p&gt;\n\n&lt;p&gt;(PS. I know men can also get sexually harassed which is absolutly not okay as well)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/rcguo2/how_many_of_my_fellow_females_here_on_reddit_got/",
  "subreddit": "TooAfraidToAsk",
  "id": "rcguo2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello everyone, I saw a post on reddit which stated that only some women/girls\nget sexually haressed but i actally think most have experienced it at least once\nin their life.\n\nI experienced it both in rl and online (23f)\n\n(PS. I know men can also get sexually harassed which is absolutly not okay…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みなさんこんにちは。\nしかし、ほとんどの人が一度は経験したことがあるのではないでしょうか。\nを、一生のうちに何度も経験するものです。\n\nRLとネットの両方で経験しました (23f)\n\n(追記)男性でもセクハラを受けることがありますが、これは絶対にダメです...。",
      "title": "このredditにいる私の仲間の女性のうち、何人が人生で一度はセクハラを受けたことがあるでしょうか？多くの人が思っている以上に、よくあることだと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我在reddit上看到一个帖子，上面说只有一些妇女/女孩\n遭到性骚扰，但实际上我认为大多数人在生活中至少经历过一次\n在他们的生活中。\n\n我在网上和现实中都有过这种经历（23岁）。\n\n(PS.我知道男人也会被性骚扰，这是绝对不允许的......)",
      "title": "在reddit上有多少女性同胞在他们的生活中至少被性骚扰过一次？我觉得这比大多数人想象的要普遍得多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我在reddit上看到一個帖子，上面說只有一些婦女/女孩\n遭到性騷擾，但實際上我認爲大多數人在生活中至少經歷過一次\n在他們的生活中。\n\n我在網上和現實中都有過這種經歷（23歲）。\n\n(PS.我知道男人也會被性騷擾，這是絕對不允許的......)",
      "title": "在reddit上有多少女性同胞在他們的生活中至少被性騷擾過一次？我覺得這比大多數人想象的要普遍得多。"
    }
  ]
}