{
  "author": "Ok_Vanilla_1169",
  "original_created_utc": 1647082624,
  "title": "Have I been brainwashed by my religious family to defend rapists?",
  "created_utc": 1647109415,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Please don&amp;#39;t hate me.... I was raped before myself and my family and the therapists they would hire told me how important it was to &amp;#39;forgive&amp;#39; my rapist. So I &amp;#39;forgave&amp;#39; him and would tell other people to do the same. &lt;/p&gt;\n\n&lt;p&gt;One day in philosophy class we were talking about Harvey Weinstein and I said the same thing, that we should &amp;#39;forgive&amp;#39; him. You can imagine how the whole class took a massive shit on me for suggesting that.&lt;/p&gt;\n\n&lt;p&gt;Now looking back on that.... I kind of feel like I was brainwashed into saying those things. I think it comes from an event when I was 10 and I got molested by someone in a church home and my Mom and dad made me go to a church and &amp;#39;forgive&amp;#39; him publicly in front of a bunch of people...&lt;/p&gt;\n\n&lt;p&gt;Not sure what to think, some feedback would be much appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/tce1r0/have_i_been_brainwashed_by_my_religious_family_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "tce1r0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Please don't hate me.... I was raped before myself and my family and the\ntherapists they would hire told me how important it was to 'forgive' my rapist.\nSo I 'forgave' him and would tell other people to do the same.\n\nOne day in philosophy class we were talking about Harvey Weinstein and I said\nthe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どうか嫌いにならないでください...。私は自分より先にレイプされ、家族も、そして\n彼らが雇うセラピストは、レイプ犯を「許す」ことがいかに重要かを教えてくれました。\nだから私は彼を『許し』、他の人にも同じようにするように言っていました。\n\nある日、哲学の授業でハーヴェイ・ワインスタインについて話していて、私はこう言いました。\nその",
      "title": "私は宗教家の家族に洗脳され、強姦魔を擁護するようになったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请不要恨我.... 我在被强奸之前，我的家人和他们雇用的\n他们聘请的治疗师告诉我 \"原谅 \"强奸我的人是多么重要。\n所以我'原谅'了他，并告诉其他人也要这样做。\n\n有一天，在哲学课上，我们正在谈论哈维-温斯坦，我说\n我说：\"这...",
      "title": "我是不是被我的宗教家庭洗脑了，为强奸犯辩护？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請不要恨我.... 我在被強姦之前，我的家人和他們僱用的\n他們聘請的治療師告訴我 \"原諒 \"強姦我的人是多麼重要。\n所以我'原諒'了他，並告訴其他人也要這樣做。\n\n有一天，在哲學課上，我們正在談論哈維-溫斯坦，我說\n我說：\"這...",
      "title": "我是不是被我的宗教家庭洗腦了，爲強姦犯辯護？"
    }
  ]
}