{
  "author": "iGot5onBit",
  "original_created_utc": 1626133914,
  "title": "It’s ok for Billionaires to go to space for no reason and burn a ton of rocket fuel but nooooo we can’t have any crypto mining going on cause you know the oceans are LITERALLY ON FIRE because of crypto mining",
  "created_utc": 1626144173,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just have this little rant as people are so quick to jump on crypto with all the FUD even though it’s a insanely smart and useful technology that will 100% be a part of our future and probably for the better of the world. But the media is jumping around giddy reporting on billionaires in space. People should get their priorities straight and stop being hypocrites.</p>\n\n<p>EDIT: should have put an /s in there somewhere cause of course I know the ocean being on fire has nothing to do with crypto mining.</p>\n</div><!-- SC_ON -->",
  "score": 680,
  "permalink": "/r/CryptoCurrency/comments/oj3mn2/its_ok_for_billionaires_to_go_to_space_for_no/",
  "subreddit": "CryptoCurrency",
  "id": "oj3mn2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I just have this little rant as people are so quick to jump on crypto with all\nthe FUD even though it’s a insanely smart and useful technology that will 100%\nbe a part of our future and probably for the better of the world. But the media\nis jumping around giddy reporting on billionaires in space.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人々はすぐにFUDで暗号に飛びつくので、私はちょっとした不満を持っています。\n非常にスマートで有用な技術であり、私たちの未来の一部となり、おそらく世界を良くするものであるにもかかわらず、人々はすぐにFUDに飛びつきます。\n私たちの未来の一部であり、おそらく世界のためになるものだと思います。しかし、メディアは\n宇宙の億万長者についての報道に目を輝かせています....",
      "title": "億万長者が意味もなく宇宙に行ってロケット燃料を大量に消費するのはいいのですが、暗号採掘はダメなんです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只是想发发牢骚，因为人们如此迅速地跳上加密货币，并带有所有的疑虑。\n尽管它是一项非常聪明和有用的技术，将100%成为我们未来的一部分，而且可能对世界更有利。\n是我们未来的一部分，可能对世界更有利。但媒体\n正欢呼雀跃地报道着太空中的亿万富翁....",
      "title": "亿万富翁可以无缘无故上太空，烧掉一吨火箭燃料，但不，我们不能有任何加密货币的开采，因为你知道，由于加密货币的开采，海洋几乎被烧毁了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只是想發發牢騷，因爲人們如此迅速地跳上加密貨幣，並帶有所有的疑慮。\n儘管它是一項非常聰明和有用的技術，將100%成爲我們未來的一部分，而且可能對世界更有利。\n是我們未來的一部分，可能對世界更有利。但媒體\n正歡呼雀躍地報道着太空中的億萬富翁....",
      "title": "億萬富翁可以無緣無故上太空，燒掉一噸火箭燃料，但不，我們不能有任何加密貨幣的開採，因爲你知道，由於加密貨幣的開採，海洋幾乎被燒燬了。"
    }
  ]
}