{
  "author": "donotusethisaccountu",
  "original_created_utc": 1655630146,
  "title": "The three wise men in the Bible? Were they Zoroastrian?",
  "created_utc": 1655649321,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In Matthew 2:1-2, Jesus is visited by wise men as a child and received gifts from them. They claimed to have received a prophecy from God to come to Jerusalem. The Latin vulgate describes the men as “magi from the East.” Magi were priests of the Zoroastrian religion, popular in the eastern empire of Persia. &lt;/p&gt;\n\n&lt;p&gt;Were these men truly magi? Why would people of a different faith celebrate Jesus? Was magi just an expression back then?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/vfrair/the_three_wise_men_in_the_bible_were_they/",
  "subreddit": "AskHistorians",
  "id": "vfrair",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In Matthew 2:1-2, Jesus is visited by wise men as a child and received gifts\nfrom them. They claimed to have received a prophecy from God to come to\nJerusalem. The Latin vulgate describes the men as “magi from the East.” Magi\nwere priests of the Zoroastrian religion, popular in the eastern empire…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "マタイによる福音書2章1-2節では、イエス様が幼い頃に賢者たちの訪問を受け、贈り物を受け取られています。\n彼らは 彼らは、神からの予言を受けてエルサレムに来たと主張した。\nエルサレムに来るようにという神のお告げを受けたという。ラテン語のヴルゲートでは、この男たちを \"東方から来たマギ \"と表現している。マギ\nは、東の帝国で人気のあったゾロアスター教の司祭であった...",
      "title": "聖書に登場する3人の賢者？彼らはゾロアスター教徒だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在马太福音2:1-2中，耶稣还是个孩子的时候就被智者拜访，并收到了他们的礼物\n从他们那里得到了礼物。他们声称收到了上帝的预言，要他们到耶路撒冷来。\n耶路撒冷。拉丁文版将这些人描述为 \"来自东方的魔术师\"。麦琪人\n是拜火教的祭司，流行于东方帝国......",
      "title": "圣经》中的三贤人？他们是琐罗亚斯德教派吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在馬太福音2:1-2中，耶穌還是個孩子的時候就被智者拜訪，並收到了他們的禮物\n從他們那裏得到了禮物。他們聲稱收到了上帝的預言，要他們到耶路撒冷來。\n耶路撒冷。拉丁文版將這些人描述爲 \"來自東方的魔術師\"。麥琪人\n是拜火教的祭司，流行於東方帝國......",
      "title": "聖經》中的三賢人？他們是瑣羅亞斯德教派嗎？"
    }
  ]
}