{
  "author": "xiaogege1",
  "original_created_utc": 1638004124,
  "title": "How do I respectfully ask someone if they have a penis or not",
  "created_utc": 1638020482,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I (straight male) been flirting with this classmate of mine and I want to escalate things(sexualy) but the thing is she kinda looks like a dude. All my friends(straight guys and gals) say she&#39;s probably trans and i think so too but I&#39;m afraid to ask. If she happens to be trans that wouldn&#39;t be an issue for me but I&#39;ve heard most trans women keep their penises and sadly that will be a deal breaker for me. So how do I ask this question without offending her because I don&#39;t want things to go any further without me knowing this and also to avoid any future akward moments if it turns out she has a Penis.</p>\n</div><!-- SC_ON -->",
  "score": 131,
  "permalink": "/r/NoStupidQuestions/comments/r39r11/how_do_i_respectfully_ask_someone_if_they_have_a/",
  "subreddit": "NoStupidQuestions",
  "id": "r39r11",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I (straight male) been flirting with this classmate of mine and I want to\nescalate things(sexualy) but the thing is she kinda looks like a dude. All my\nfriends(straight guys and gals) say she's probably trans and i think so too but\nI'm afraid to ask. If she happens to be trans that wouldn't be an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（ノンケ男性）は、同級生とイチャイチャしていて、これをエスカレートさせたいと思っています。\nエスカレートしていきたいのですが、彼女は男性のように見えてしまいます。僕の\n俺の友達（ノンケの男女）はみんな彼女はトランスだろうと言っていて、俺もそう思うけど\n聞くのが怖いんだ。もし彼女がトランスであったとしても、それは問題ではありません...",
      "title": "ペニスがあるかないかを尋ねるにはどうしたらいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（直男）一直在和我的这个同学调情，我想让事情升级（性）。\n但问题是她看起来有点像个男人。我所有的\n我的朋友（直男和直女）都说她可能是变性人，我也这么认为，但我不敢问。\n我不敢问。如果她碰巧是变性人，那就不是什么问题了。",
      "title": "我如何恭敬地问别人是否有阴茎？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（直男）一直在和我的這個同學調情，我想讓事情升級（性）。\n但問題是她看起來有點像個男人。我所有的\n我的朋友（直男和直女）都說她可能是變性人，我也這麼認爲，但我不敢問。\n我不敢問。如果她碰巧是變性人，那就不是什麼問題了。",
      "title": "我如何恭敬地問別人是否有陰莖？"
    }
  ]
}