{
  "author": "gitarr",
  "original_created_utc": 1629786719,
  "title": "Crypto YouTubers need to be less clickbaity so the whole market can be taken serious",
  "created_utc": 1629819928,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, right now I am looking at my recommended video list on YouTube and what I see is just awful:</p>\n\n<p>I&#39;m over 40 and have been in crypto some time now, next to investing elsewhere. Recently I have been watching some YouTube videos on cryptocurrencies, mainly from Benjamin Cowen and Coin Bureau (also has some overly clickbait thumbnails and titles), which both are very good in my opinion.</p>\n\n<p>But like the YouTube algorithm does, it now thinks I want to watch all kinds of other videos about crypto. </p>\n\n<p>But the clickbait titles and thumbnails I am seeing right now range from hilariously bad to outright lies. It&#39;s often the same recipe: A name of a coin, lots of signal colours like green, red, yellow etc, lots of buzz words, lots of exclamation marks, and the face of some guy.</p>\n\n<p>Something like: &quot;CARDANO PRICE TARGET 100x!!!!!? Prepare for the next ADA move ... WARNING!!!&quot;</p>\n\n<p>The video itself, most of the times, isn&#39;t really worth a watch either.</p>\n\n<p>My problem with these clickbaits is that it makes the whole market seem childish and not very professional. I&#39;d like for the crypto market to grow up a bit more.</p>\n\n<p>What do you think? Discuss.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/pahunn/crypto_youtubers_need_to_be_less_clickbaity_so/",
  "subreddit": "CryptoCurrency",
  "id": "pahunn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, right now I am looking at my recommended video list on YouTube and what I\nsee is just awful:\n\nI'm over 40 and have been in crypto some time now, next to investing elsewhere.\nRecently I have been watching some YouTube videos on cryptocurrencies, mainly\nfrom Benjamin Cowen and Coin Bureau (also…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、私はYouTubeのおすすめビデオリストを見ています。\n見てみると、とにかくひどい。\n\n私は40歳以上で、他の場所での投資の次に、しばらく前から暗号に取り組んでいます。\n最近、私は暗号に関するYouTubeのビデオをいくつか見ています。\n主にBenjamin Cowen氏とCoin Bureau氏のビデオを見ています。",
      "title": "暗号系ユーチューバーは、市場全体を真剣にとらえるために、クリック感を減らす必要がある"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以，现在我正在看我在YouTube上的推荐视频列表，我看到的是\n看到的东西实在是太糟糕了。\n\n我已经40多岁了，在加密货币方面已经有一段时间了，其次是投资其他地方。\n最近我一直在看一些关于加密货币的YouTube视频，主要是\n来自Benjamin Cowen和Coin Bureau（也...",
      "title": "Crypto YouTubers需要减少点击率，这样整个市场才能被认真对待"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，現在我正在看我在YouTube上的推薦視頻列表，我看到的是\n看到的東西實在是太糟糕了。\n\n我已經40多歲了，在加密貨幣方面已經有一段時間了，其次是投資其他地方。\n最近我一直在看一些關於加密貨幣的YouTube視頻，主要是\n來自Benjamin Cowen和Coin Bureau（也...",
      "title": "Crypto YouTubers需要減少點擊率，這樣整個市場才能被認真對待"
    }
  ]
}