{
  "author": "sweaty_garbage",
  "original_created_utc": 1642650855,
  "title": "Was the Britain's infantry tank doctrine in WWII just flat out wrong, or did it have merits?",
  "created_utc": 1642689397,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Specifically, I&amp;#39;m referring to British doctrine around &amp;quot;infantry tanks,&amp;quot; tanks designed to support infantry rather than fight other tanks or perform more mobile offensive actions. Infantry tanks seem to be only a thing the British tried, and it seems like they tried it for a long time, with many of the wholesale British tanks of the war being slow, thickly armored tanks, from the Matilda to the Cromwell to the Churchill.&lt;/p&gt;\n\n&lt;p&gt;Am I missing something, or was this just a bad doctrine? Maybe it made since in the interwar and Phoney War phase, where the allies expected a more static, WWI-esque war, but after the war began in earnest, why did the British keep investing in infantry tanks? While the Matilda was a famous part of the desert war, from what I understand it was so slow it couldn&amp;#39;t keep up with the highly maneuverable nature of the North African campaign, and it seems like Shermans were just better in every regard, and is why the British and the French adopted them in such large numbers (in addition to there just being so many). But why did they keep building and designing new bulky, slow infantry tanks, rather than investing earlier in a medium tank with higher speed and bigger guns?&lt;/p&gt;\n\n&lt;p&gt;And it seems like post-war history also supports the idea that infantry tanks were just a bad bet, because after the war every adopted the American and Soviet medium-tank model, with the &amp;quot;main battle tank&amp;quot; being the, well, main feature of tanks, including the British Centurion and onward. Even Germany&amp;#39;s heavy tank doctrine had its merits, and had a big influence on later tanks, but it really seems like infantry tanks were just a plain old mistake, and no part of tank history onwards made any use of them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/s89fqq/was_the_britains_infantry_tank_doctrine_in_wwii/",
  "subreddit": "AskHistorians",
  "id": "s89fqq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Specifically, I'm referring to British doctrine around \"infantry tanks,\" tanks\ndesigned to support infantry rather than fight other tanks or perform more\nmobile offensive actions. Infantry tanks seem to be only a thing the British\ntried, and it seems like they tried it for a long time, with many of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "具体的には、イギリスの「歩兵戦車」についてのドクトリンを指しています。\n他の戦車と戦ったり、より高いパフォーマンスを発揮するのではなく、歩兵を支援するために設計されています。\n移動攻撃行動 歩兵戦車はあくまでイギリスが作ったもののようですが\nを、長い間、試していたようです。",
      "title": "第二次世界大戦中のイギリスの歩兵戦車のドクトリンは、全くの誤りだったのか、それともメリットがあったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "具体而言，我指的是英国围绕 \"步兵坦克 \"的学说。\n坦克被设计用来支持步兵，而不是与其他坦克作战或进行更多的\n移动的进攻行动。步兵坦克似乎只是英国人尝试过的一种东西。\n尝试，而且似乎他们尝试了很长时间，其中有许多",
      "title": "二战中英国的步兵坦克理论是完全错误的，还是有可取之处？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "具體而言，我指的是英國圍繞 \"步兵坦克 \"的學說。\n坦克被設計用來支持步兵，而不是與其他坦克作戰或進行更多的\n移動的進攻行動。步兵坦克似乎只是英國人嘗試過的一種東西。\n嘗試，而且似乎他們嘗試了很長時間，其中有許多",
      "title": "二戰中英國的步兵坦克理論是完全錯誤的，還是有可取之處？"
    }
  ]
}