{
  "author": "SmileyCyprus",
  "original_created_utc": 1654702850,
  "title": "Life is mostly doing things you don't want to do until you die. How do most people, like, deal?",
  "created_utc": 1654711145,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For instance, I work twelve hour days. I wake up early, I work with strangers, I go home, I pay for gas, I drive, I cook, I clean, I do dishes, I brush my teeth I do my laundry on my days off I have to do chores -- visits, appointments, etc. Then when I finally have any time to myself I just don&amp;#39;t want to do anything. &lt;/p&gt;\n\n&lt;p&gt;It seems like whatever pleasure we feel is just relief, but maybe all please is relief. Idk. We&amp;#39;re born without our consent, if we&amp;#39;re lucky we leave without our consent. We&amp;#39;re complicit in an economic system that&amp;#39;s basically just a blood engine -- like, yeah, ice cream, right? That&amp;#39;s great, sure, but then you think about how other people are doing shit they hate to make it. Or what about the animals? Where they have to strap a cow to a milking machine and centrifuge the pus from the blood crusted nipples out to make the ice cream? Everything just seems horrific. Our economic system is grown from the environment it&amp;#39;s created on -- life feeding on life, even the ground we walk on is decay. It&amp;#39;s just corpses all the way to the ground.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know how to keep doing this and whenever I&amp;#39;m around other people and they seem even kind of fine I feel like I&amp;#39;m taking crazy pills. This shit sucks so fucking much. I hate being alive&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/v7sjwn/life_is_mostly_doing_things_you_dont_want_to_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "v7sjwn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For instance, I work twelve hour days. I wake up early, I work with strangers, I\ngo home, I pay for gas, I drive, I cook, I clean, I do dishes, I brush my teeth\nI do my laundry on my days off I have to do chores -- visits, appointments, etc.\nThen when I finally have any time to myself I just don't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、私は1日12時間働いています。早起きして、見知らぬ人と働いて、帰宅して、ガソリン代を払って、運転をして\n帰宅し、ガソリン代を払い、運転し、料理をし、掃除をし、皿洗いをし、歯を磨き、休みの日には洗濯をする。\n休みの日には洗濯をし、雑用をこなし、訪問先や約束の場所に行かなければならな\nそして、やっと自分の時間ができたと思ったら......もうだめだ。",
      "title": "人生というのは、やりたくないことを死ぬまでやるのがほとんどです。ほとんどの人は、どうやって、対処しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，我每天工作12个小时。我早早起床，与陌生人一起工作，我\n回家后，我付汽油费，开车，做饭，打扫卫生，洗碗，刷牙。\n我在休息日洗衣服，我必须做家务 -- 探访，约会，等等。\n然后当我终于有自己的时间时，我就是不...",
      "title": "生活主要是做你不想做的事情，直到你死。大多数人，是如何处理的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，我每天工作12個小時。我早早起牀，與陌生人一起工作，我\n回家後，我付汽油費，開車，做飯，打掃衛生，洗碗，刷牙。\n我在休息日洗衣服，我必須做家務 -- 探訪，約會，等等。\n然後當我終於有自己的時間時，我就是不...",
      "title": "生活主要是做你不想做的事情，直到你死。大多數人，是如何處理的？"
    }
  ]
}