{
  "author": "NadxCee",
  "original_created_utc": 1651530049,
  "title": "Why do people get offended on behalf of my culture when someone else use or wear clothes from my culture?",
  "created_utc": 1651546151,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m thai, me and I know a lot of other Thai people that like it when foreigners wear our traditional clothes, get involved in our holidays and cultural gatherings. Why do people seem to think it’s cultural appropriation when someone wears our traditional clothing when they are on holiday in Thailand? Or it’s wrong that the owner of a Thai restaurant is a white guy? (My local Thai restaurant is owned by a white guy and his Thai wife) &lt;/p&gt;\n\n&lt;p&gt;“Profiting from someone else’s culture” is what I’ve heard on this. I don’t see a problem with it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/uh1buo/why_do_people_get_offended_on_behalf_of_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "uh1buo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m thai, me and I know a lot of other Thai people that like it when foreigners\nwear our traditional clothes, get involved in our holidays and cultural\ngatherings. Why do people seem to think it’s cultural appropriation when someone\nwears our traditional clothing when they are on holiday in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はタイ人です、私も他の多くのタイ人も外国人が好きです。\nが伝統的な服を着たり、祝祭日や文化的な集まりに参加するのが好きです。\nの集まりに参加するのが好きです。なぜ人々は、外国人が私たちの伝統的な服を着ることを文化的流用と考えるのでしょうか？\nを着ることを文化的流用だと考えるのはなぜでしょうか？",
      "title": "なぜ人々は、他人が私の文化の服を使ったり着たりすると、私の文化の代表として怒るのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是泰国人，我和我认识的很多其他泰国人都喜欢外国人\n穿着我们的传统服装，参与我们的节日和文化活动。\n欢聚一堂。为什么人们认为在泰国度假时有人穿我们的传统服装是文化侵占呢？\n为什么人们认为在泰国度假时有人穿我们的传统服装是文化侵占？",
      "title": "为什么当别人使用或穿着我的文化的衣服时，人们会代表我的文化而感到不快？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是泰國人，我和我認識的很多其他泰國人都喜歡外國人\n穿着我們的傳統服裝，參與我們的節日和文化活動。\n歡聚一堂。爲什麼人們認爲在泰國度假時有人穿我們的傳統服裝是文化侵佔呢？\n爲什麼人們認爲在泰國度假時有人穿我們的傳統服裝是文化侵佔？",
      "title": "爲什麼當別人使用或穿着我的文化的衣服時，人們會代表我的文化而感到不快？"
    }
  ]
}