{
  "author": "busterrulezzz",
  "original_created_utc": 1647111491,
  "title": "Crypto is becoming a ghost town, but if you're still here, you're (probably) gonna make it",
  "created_utc": 1647128298,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Well, here we are. After an exciting year in 2021, the cryptocurrency space is becoming a ghost town, like the elders from 2017 prophesied. &lt;/p&gt;\n\n&lt;p&gt;I am not just talking about prices, which has been depressed for a few weeks now ; the hype surrounding our ecosystem is fading. Google Trends clearly shows that searches for terms like &amp;quot;bitcoin&amp;quot;, &amp;quot;NFT&amp;quot; and &amp;quot;crypto&amp;quot; are at their lowest level since summer, and the activity on this sub has been falling off a cliff. The Daily barely have 2k comments...&lt;/p&gt;\n\n&lt;p&gt;But here&amp;#39;s the deal : &lt;strong&gt;I am convinced that, in a few years, people will look at that slump as a once-in-a-lifetime opportunity.&lt;/strong&gt; If you are still holding, or even better, DCAing, you&amp;#39;re gonna make it. Well, probably.&lt;/p&gt;\n\n&lt;p&gt;Every single person that was there in 2017 told me the same thing : those who bought and hold during the brutal bear market made insane amount of money when the bull came back. And, from a long-term perspective, there is a lot of reasons to be bullish. Ethereum will finally switch to proof-of-stake in about three months, Bitcoin has been hold surprisingly well against growth/tech stocks, a lot of new protocols are being worked on/launched, Biden basically told us last week the US will regulate - but not ban - cryptocurrencies...&lt;/p&gt;\n\n&lt;p&gt;Could the prices get lower in the next few weeks? Absolutely. Inflation, war, recession : it&amp;#39;s possible that we drill further down. But if you hold through this tumultuous period, you will emerge on the other side wealthier.&lt;/p&gt;\n\n&lt;p&gt;It is in moments like these that characters are forged. I hope that in ten years you can look back on this time and be proud that you stayed true to your convictions!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 620,
  "permalink": "/r/CryptoCurrency/comments/tco84k/crypto_is_becoming_a_ghost_town_but_if_youre/",
  "subreddit": "CryptoCurrency",
  "id": "tco84k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Well, here we are. After an exciting year in 2021, the cryptocurrency space is\nbecoming a ghost town, like the elders from 2017 prophesied.\n\nI am not just talking about prices, which has been depressed for a few weeks now\n; the hype surrounding our ecosystem is fading. Google Trends clearly shows…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、ここまで来ました。2021年のエキサイティングな1年の後、暗号通貨スペースは\n2017年からの長老たちが予言したように、ゴーストタウンになりつつある。\n\n私は、ここ数週間落ち込んでいる価格についてだけ言っているのではありません\n私たちのエコシステムを取り巻くハイプは消えつつあります。Google Trendsは明らかに...",
      "title": "暗号はゴーストタウンになりつつあるが、もしあなたがここに残っていれば、（おそらく）成功するだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我们来了。经过2021年令人兴奋的一年，加密货币空间正在成为一个鬼城，就像2017年的长老们预言的那样。\n变成了一个鬼城，就像2017年的长老们预言的那样。\n\n我说的不仅仅是价格，它已经被压抑了几周了\n；围绕我们的生态系统的炒作正在消退。谷歌趋势清楚地显示...",
      "title": "晶体管正在成为一个鬼城，但如果你还在这里，你（可能）会成功的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我們來了。經過2021年令人興奮的一年，加密貨幣空間正在成爲一個鬼城，就像2017年的長老們預言的那樣。\n變成了一個鬼城，就像2017年的長老們預言的那樣。\n\n我說的不僅僅是價格，它已經被壓抑了幾周了\n；圍繞我們的生態系統的炒作正在消退。谷歌趨勢清楚地顯示...",
      "title": "晶體管正在成爲一個鬼城，但如果你還在這裏，你（可能）會成功的"
    }
  ]
}