{
  "author": "coinsntings",
  "the_new_excerpt": "I hate to give him attention but it is quite funny this time. Musk tweeted that\npeople should suggest ways, on either github or r/dogecoin [/r/dogecoin], for\nthe devs to improve dogecoin.\n\nSo far theres been lots of suggestions for:\n\n * Tesla to accept doge (nothing to do with the devs)\n * More…",
  "original_created_utc": 1621894482,
  "localize": [
    {
      "locale": "ja",
      "title": "自分は暗号について何も知らないと思っていたが、r/dogecoinをちらっと見てみた。",
      "the_new_excerpt": "注意するのは嫌ですが、今回はなかなか面白いです。マスクは次のようにツイートしています。\ngithubかr/dogecoin [/r/dogecoin]で、次のような方法を提案してください。\n開発者がdogecoinを改善するために。\n\n今のところ、多くの提案がなされている。\n\n * テスラがドージに対応する（開発者とは関係ない）。\n * もっと詳しく..."
    },
    {
      "locale": "zh",
      "title": "我以为我对加密货币一无所知，然后我瞥了一眼r/dogecoin",
      "the_new_excerpt": "我讨厌给他关注，但这次相当有趣。马斯克在推特上说\n人们应该在github或r/dogecoin[/r/dogecoin]上提出建议，以便\n开发人员改进dogecoin。\n\n到目前为止，已经有很多建议了。\n\n * 特斯拉接受doge（与开发者无关）\n * 更多..."
    },
    {
      "locale": "zh-Hant",
      "title": "我以爲我對加密貨幣一無所知，然後我瞥了一眼r/dogecoin",
      "the_new_excerpt": "我討厭給他關注，但這次相當有趣。馬斯克在推特上說\n人們應該在github或r/dogecoin[/r/dogecoin]上提出建議，以便\n開發人員改進dogecoin。\n\n到目前爲止，已經有很多建議了。\n\n * 特斯拉接受doge（與開發者無關）\n * 更多..."
    }
  ],
  "title": "I thought I knew nothing about crypto, then I glanced at r/dogecoin",
  "created_utc": 1621933027,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I hate to give him attention but it is quite funny this time. Musk tweeted that people should suggest ways, on either github or <a href=\"/r/dogecoin\">r/dogecoin</a>, for the devs to improve dogecoin.</p>\n\n<p>So far theres been lots of suggestions for:</p>\n\n<ul>\n<li>Tesla to accept doge (nothing to do with the devs)</li>\n<li>More online shops to accept doge (nothing to do with the devs)</li>\n<li>Charities to accept doge (nothing to do with the devs)</li>\n<li>Doge to only be mined with solar (thats miners, not devs guys) </li>\n</ul>\n\n<p>In addition to this, a lot of calls for a hard cap, coin burning, x amount of transactions to go towards specific causes, lots of confusion between inflation and deflation and a ton of straight up incorrect economic theory. </p>\n\n<p>The only suggestion that actually felt in the spirit of doge was &#39;it to say wow when a transaction is completed&#39; which I thought was brilliant.</p>\n\n<p>I suddenly feel like I know a lot more than I thought I did about this stuff now. Cheers doge for the ego boost. If you need one too, check out their ideas for the devs.</p>\n\n<p>(edit, i got into doge at 0.0012, wherever it goes I&#39;m laughing. Like many I love the coin, just hate the new community)</p>\n</div><!-- SC_ON -->",
  "score": 770,
  "permalink": "/r/CryptoCurrency/comments/nk9wo6/i_thought_i_knew_nothing_about_crypto_then_i/",
  "subreddit": "CryptoCurrency",
  "id": "nk9wo6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387090
}