{
  "author": "Phite007",
  "original_created_utc": 1626691521,
  "title": "How many of you successfully live off the profit of your Crypto?",
  "created_utc": 1626713048,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen so many posts and comments mentioning DCAing, Staking and HODLing suggesting that most on this sub hold and accumulate waiting for a date far off in the future to “Cash-In” their tokens and reap the Lambo reward and the like.\nThe market trading volumes would suggest otherwise and that there is a significant portion of you taking margins and buying back in dip.</p>\n\n<p>If you are able to live off the profits, We’ll Done! I envy you enormously at this juncture but I wonder if:</p>\n\n<ol>\n<li>The profit comes from selling down incrementally the long held high growth assets like BTC or ETH\nEtc.</li>\n</ol>\n\n<p>Or</p>\n\n<ol>\n<li>If you are in fact day trading, selling the peaks, buying the dips?</li>\n</ol>\n\n<p>Or </p>\n\n<ol>\n<li>Can you live off the Staking margins? Or are they immediately reinvested in the same or alternate coins?</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/CryptoCurrency/comments/onbkrv/how_many_of_you_successfully_live_off_the_profit/",
  "subreddit": "CryptoCurrency",
  "id": "onbkrv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve seen so many posts and comments mentioning DCAing, Staking and HODLing\nsuggesting that most on this sub hold and accumulate waiting for a date far off\nin the future to “Cash-In” their tokens and reap the Lambo reward and the like.\nThe market trading volumes would suggest otherwise and that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DCAing、Staking、HODLingに言及する多くの投稿やコメントを見てきました。\nこのサブサイトのほとんどの人は、トークンを「キャッシュイン」してランボの報酬を得るために、遠い将来の日を待って、ホールドして蓄積していると思われます。\nトークンを \"キャッシュイン \"してランボの報酬を得るために、このサブメンバーのほとんどがホールドして蓄積していることを示唆しています。\n市場での取引量はそうではないことを示唆しており、それは...",
      "title": "暗号の利益でうまく生活している人は何人いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多帖子和评论都提到DCAing、Staking和HODLing。\n暗示着这个子项目中的大多数人都持有和积累，等待着一个遥远的日期\n在未来 \"兑现 \"他们的代币并获得兰博的奖励等等。\n市场交易量表明，情况并非如此，而且...",
      "title": "你们有多少人成功地依靠加密货币的利润生活？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多帖子和評論都提到DCAing、Staking和HODLing。\n暗示着這個子項目中的大多數人都持有和積累，等待着一個遙遠的日期\n在未來 \"兌現 \"他們的代幣並獲得蘭博的獎勵等等。\n市場交易量表明，情況並非如此，而且...",
      "title": "你們有多少人成功地依靠加密貨幣的利潤生活？"
    }
  ]
}