{
  "author": "HeyManHowAreYa",
  "the_new_excerpt": "Yesterday I put in a limit order for RBLX and when I woke up around 5 pm saw my\norder was never filled because the price shot up right away.\n\nThis isn't the first time I've missed a buying opportunity. I probably wouldn't\nhave bought the same amount this high anyway but I may have bought a few…",
  "original_created_utc": 1615464913,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "昨天我下了一个RBLX的限价单，当我下午5点左右醒来的时候看到我的\n订单一直没有成交，因为价格马上飙升。\n\n这已经不是我第一次错过买入机会了。我可能不会\n反正买了这么多，但我可能买了几个... ...",
      "title": "我通宵工作，由于时间安排的原因，我从来没有机会在市场开盘时参与主动买入。昨天我错过了一个机会。我有一个问题要问轮班工人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天我下了一個RBLX的限價單，當我下午5點左右醒來的時候看到我的\n訂單一直沒有成交，因爲價格馬上飆升。\n\n這已經不是我第一次錯過買入機會了。我可能不會\n反正買了這麼多，但我可能買了幾個... ...",
      "title": "我通宵工作，由於時間安排的原因，我從來沒有機會在市場開盤時參與主動買入。昨天我錯過了一個機會。我有一個問題要問輪班工人。"
    }
  ],
  "title": "I work overnight and because of my schedule I never get to participate in active buying when the market is open. I missed out on an opportunity yesterday. I have a question for shift workers.",
  "created_utc": 1615474041,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday I put in a limit order for RBLX and when I woke up around 5 pm saw my order was never filled because the price shot up right away.</p>\n\n<p>This isn&#39;t the first time I&#39;ve missed a buying opportunity. I probably wouldn&#39;t have bought the same amount this high anyway but I may have bought a few shares if I was awake.</p>\n\n<p>Is anyone else in my situation? And how would you proceed without seeing the active market when you&#39;re sleeping?</p>\n\n<p>I want to set another limit order before bed in a half hour but I&#39;m debating on whether or not it&#39;s worth it at this price. Not looking for specific advice on buying this particular stock. I&#39;m more or less wondering how you would handle buying shares when you&#39;re sleeping. Probably sounds like an obvious question to some but I&#39;m about 6 months into this now and I&#39;m still learning a bit.</p>\n</div><!-- SC_ON -->",
  "score": 231,
  "permalink": "/r/stocks/comments/m2ostv/i_work_overnight_and_because_of_my_schedule_i/",
  "subreddit": "stocks",
  "id": "m2ostv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147381380
}