{
  "author": "Internet-Top",
  "original_created_utc": 1630548680,
  "title": "Cardano just hit 3$. It blows my mind that it is up a 100x since march bottom.",
  "created_utc": 1630564534,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know you ADA is one of  this subreddit&#39;s favorite coin. I know it has been eyeing 3$ since several days. However, it just blows my mind that it is up a 100x just 18 months ago. Imagine throwing 1000$ in it just 18 months ago. However I digress but that just let you realize how much powerful it is to just buy when everyone is scared and the world seems to be collapsing. and just hold for dear life. Also one of my favorite coins, VET is up nearly 100x since march bottom. Not that I bought then, I was not even interested in crypto is last March. But it just blows my mind the returns of crypto if you invested wisely for long term.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/pg8gpw/cardano_just_hit_3_it_blows_my_mind_that_it_is_up/",
  "subreddit": "CryptoCurrency",
  "id": "pg8gpw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know you ADA is one of this subreddit's favorite coin. I know it has been\neyeing 3$ since several days. However, it just blows my mind that it is up a\n100x just 18 months ago. Imagine throwing 1000$ in it just 18 months ago.\nHowever I digress but that just let you realize how much powerful it is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "I know you ADAはこのsubredditのお気に入りのコインの一つです。数日前から3ドルを狙っていることも知っています。\n数日前から3ドルを狙っていることも知っています。しかし、わずか18ヶ月前に100倍になったことには驚かされました。\nたった18ヶ月前の100倍になっていることには驚かされます。18ヶ月前に1000ドルを投入したことを想像してみてください。\nしかし、話が脱線してしまいましたが、このことは、この銘柄がどれほど強力であるかを実感させてくれます...。",
      "title": "カルダノが3ドルになりました。3月の底値から100倍になっているのは驚きです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道你ADA是这个subreddit最喜欢的硬币之一。我知道它已经\n几天以来一直盯着3美元。然而，它只是让我感到震惊，它在18个月前就已经上涨了\n100倍，仅仅18个月。想象一下，在18个月前，把1000美元扔进它。\n然而，我想说的是，这只是让你意识到它是多么强大......",
      "title": "Cardano刚刚达到3美元。自三月底以来，它已经上涨了100倍，这让我很吃惊。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道你ADA是這個subreddit最喜歡的硬幣之一。我知道它已經\n幾天以來一直盯着3美元。然而，它只是讓我感到震驚，它在18個月前就已經上漲了\n100倍，僅僅18個月。想象一下，在18個月前，把1000美元扔進它。\n然而，我想說的是，這只是讓你意識到它是多麼強大......",
      "title": "Cardano剛剛達到3美元。自三月底以來，它已經上漲了100倍，這讓我很喫驚。"
    }
  ]
}