{
  "author": "MySweetDoge2",
  "original_created_utc": 1628891417,
  "title": "Reminder: Check your PC for hidden miners",
  "created_utc": 1628904608,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello all,</p>\n\n<p>Let me start by saying that I am a regular guy with average knowledge of PCs. I can not code but I can manage my way with computers. However my PC got infected with stupid hidden miner that was almost impossible to delete. I could not believe that it happened to me. And I still don&#39;t know how I got infected.</p>\n\n<p>I spoke with a close friend of mine who told me there are several types of these hidden miners. What makes them nasty are few things. First of all, the hackers can set up the virus to use just a small percentage of the CPU/GPU so that the fans don&#39;t make the usual &quot;brrrrrrrrrrr&quot; when the CPU is at 100%. Secondly when you open the task manager the virus stops so you can&#39;t actually detect it. And finally even after quarantine and removal it still manages to pop up and infect the PC. As far as I know (it&#39;s basically what my friend told me) it only works on Windows and not on Mac.</p>\n\n<p>Well I still can&#39;t figure out how I got it (maybe via &quot;friend&quot; just like covid &quot;ha-ha&quot;) but anyway.</p>\n\n<p>Check your temps and fans speed and open Task manager. If you notice a significant drop after you open Task manager - congrats you are positive for hidden miner</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/p3v0mu/reminder_check_your_pc_for_hidden_miners/",
  "subreddit": "CryptoCurrency",
  "id": "p3v0mu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello all,\n\nLet me start by saying that I am a regular guy with average knowledge of PCs. I\ncan not code but I can manage my way with computers. However my PC got infected\nwith stupid hidden miner that was almost impossible to delete. I could not\nbelieve that it happened to me. And I still don't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n最初に言っておきますが、私はPCに関する平均的な知識を持つ普通の男です。I\nコードを書くことはできませんが、コンピュータを使ってなんとかすることはできます。しかし、私のPCはStageに感染しました。\n愚かな隠しマイナーに感染してしまい、削除することがほとんどできませんでした。私は信じられませんでした。\n自分の身に起こったことが信じられませんでした。そして、私はまだ...",
      "title": "リマインダーです。あなたのPCに隠れた鉱夫がいないかチェックしてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n让我先说一下，我是一个普通人，对个人电脑有一般的了解。I\n我不会编码，但我可以用电脑来管理我的方式。然而，我的电脑被感染了\n感染了愚蠢的隐藏矿工，几乎无法删除。我无法\n相信它发生在我身上。而且我仍然不相信...",
      "title": "提醒您。检查你的电脑是否有隐藏的矿工"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n讓我先說一下，我是一個普通人，對個人電腦有一般的瞭解。I\n我不會編碼，但我可以用電腦來管理我的方式。然而，我的電腦被感染了\n感染了愚蠢的隱藏礦工，幾乎無法刪除。我無法\n相信它發生在我身上。而且我仍然不相信...",
      "title": "提醒您。檢查你的電腦是否有隱藏的礦工"
    }
  ]
}