{
  "author": "DaddySkates",
  "original_created_utc": 1640470334,
  "title": "When crypto really takes off, people won't give a single shit if it's centralised or not.",
  "created_utc": 1640484778,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We love and circlejerk about how decentralized our favorite cryptocurrencies are. But when it goes really mainstream, I think that other people wont share that kind of enthusiasm with us. &lt;/p&gt;\n\n&lt;p&gt;We still buy products from companies that exploit poor and vulnerable. We will order from Amazon even though we say &amp;quot;fuck amazon&amp;quot; in the same breath. We buy shoes and branded shirts made in Bangladesh by women who work there for a few dollars a week. We buy phones that are made in Foxconn by workers who don&amp;#39;t even have basic human rights.&lt;/p&gt;\n\n&lt;p&gt;Do you really think that consumers will care whether their crypto is centralized or decentralized? They won&amp;#39;t. They will use the solution that will save them the most money and will be the most profitable. If it&amp;#39;ll cost $100 to buy something with a super decentralized crypto and $80, I would bet that most if not all people would go the cheapest route.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 166,
  "permalink": "/r/CryptoCurrency/comments/roim9t/when_crypto_really_takes_off_people_wont_give_a/",
  "subreddit": "CryptoCurrency",
  "id": "roim9t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We love and circlejerk about how decentralized our favorite cryptocurrencies\nare. But when it goes really mainstream, I think that other people wont share\nthat kind of enthusiasm with us.\n\nWe still buy products from companies that exploit poor and vulnerable. We will\norder from Amazon even though…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは、お気に入りの暗号通貨がいかに非中央集権的であるかということを、大好きであり、また、サークルジャーキングしています。\nがあります。しかし、それが本当にメインストリームになったとき、他の人々はそれを共有することができなくなると思います。\nそのような熱意は、私たちと同じです。\n\n私たちは今でも、貧しい人々や弱い人々を搾取する企業の製品を買っています。私たちは\nアマゾンに注文するのは...",
      "title": "暗号が本当に普及したら、中央集権的かどうかなんて、みんな気にしなくなるでしょうね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们喜欢并嘲笑我们最喜欢的加密货币是如何去中心化的\n是多么的分散。但当它真正成为主流时，我认为其他人不会与我们分享这种热情。\n这种热情了。\n\n我们仍然购买那些剥削穷人和弱势群体的公司的产品。我们会\n从亚马逊订购，即使...",
      "title": "当加密货币真正起飞的时候，人们不会在乎它是否是中心化的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們喜歡並嘲笑我們最喜歡的加密貨幣是如何去中心化的\n是多麼的分散。但當它真正成爲主流時，我認爲其他人不會與我們分享這種熱情。\n這種熱情了。\n\n我們仍然購買那些剝削窮人和弱勢羣體的公司的產品。我們會\n從亞馬遜訂購，即使...",
      "title": "當加密貨幣真正起飛的時候，人們不會在乎它是否是中心化的。"
    }
  ]
}