{
  "author": "MaxdOut",
  "original_created_utc": 1627916134,
  "title": "I just released Mylo, a workout management and tracking app!",
  "created_utc": 1627930350,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been exercising for the last few years with a mix of calisthenics and weights and could never find a practical way to manage my workouts. I tried various apps before settling on an excel sheet which eventually became a mess so I thought let me build my own.</p>\n\n<p><a href=\"https://preview.redd.it/bwp8842flye71.png?width=2600&amp;format=png&amp;auto=webp&amp;s=5e75bfe5f36cbf01b4b69a8a379ec8c515f54ab0\">https://preview.redd.it/bwp8842flye71.png?width=2600&amp;format=png&amp;auto=webp&amp;s=5e75bfe5f36cbf01b4b69a8a379ec8c515f54ab0</a></p>\n\n<p>Mylo was made to support</p>\n\n<ul>\n<li>custom exercises (reps, duration, or distance based)</li>\n<li>flexible workout creation tools</li>\n<li>custom exercise progressions so that reps/weights/rest can update for you</li>\n<li>easy to share whole workouts</li>\n<li>single reliable place to find workout plans (coming next)</li>\n<li>100% free</li>\n</ul>\n\n<p>There&#39;s still a lot more I want to keep adding and I would love getting your feedback on it!</p>\n\n<p>And also if you could let me know:</p>\n\n<ol>\n<li>What are your first impressions from the site?</li>\n<li>What is Mylo missing? My next plans are to add an index of the shared workouts, history of training sessions, custom exercise skill trees, and more social features.</li>\n</ol>\n\n<p>Here&#39;s the link: <a href=\"https://www.mylo.fit?utm_source=reddit+webdev&amp;utm_medium=Referral\">Mylo</a></p>\n</div><!-- SC_ON -->",
  "score": 6,
  "permalink": "/r/SideProject/comments/owg6ku/i_just_released_mylo_a_workout_management_and/",
  "subreddit": "SideProject",
  "id": "owg6ku",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been exercising for the last few years with a mix of calisthenics and\nweights and could never find a practical way to manage my workouts. I tried\nvarious apps before settling on an excel sheet which eventually became a mess so\nI thought let me build my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はここ数年、柔軟体操とウェイトトレーニングを組み合わせたエクササイズをしてきました。\n私はここ数年、柔軟体操とウェイトを組み合わせたエクササイズをしてきましたが、自分のワークアウトを管理する実用的な方法を見つけることができませんでした。いろいろなアプリを試してみましたが\nいろいろなアプリを試してみましたが、結局エクセルシートに落ち着きましたが、それでは混乱してしまうので\n自分で作ってみようと思いました。",
      "title": "ワークアウト管理・トラッキングアプリ「Mylo」をリリースしました!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几年里，我一直在进行健身和举重的混合运动。\n在过去的几年里，我一直在进行健身和举重的混合锻炼，但从来没有找到一个实用的方法来管理我的锻炼。我尝试了\n各种各样的应用程序，最后决定用excel表格来管理我的锻炼，但最后变得一团糟。\n我想，让我建立一个自己的 \"运动管理\"。",
      "title": "我刚刚发布了Mylo，一个锻炼管理和跟踪的应用程序！这是我的工作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾年裏，我一直在進行健身和舉重的混合運動。\n在過去的幾年裏，我一直在進行健身和舉重的混合鍛鍊，但從來沒有找到一個實用的方法來管理我的鍛鍊。我嘗試了\n各種各樣的應用程序，最後決定用excel表格來管理我的鍛鍊，但最後變得一團糟。\n我想，讓我建立一個自己的 \"運動管理\"。",
      "title": "我剛剛發佈了Mylo，一個鍛鍊管理和跟蹤的應用程序！這是我的工作。"
    }
  ]
}