{
  "author": "whatisgf",
  "the_new_excerpt": "Alright folks, here's the comprehensive guide about the BB products, revenue\ndetails, customers, and what's in the store in the future. It's quite a lengthy\none, please bare with me as you read and this is the first time I looked up\nregarding a company at this depth.\n\nSome background on the John…",
  "original_created_utc": 1612467985,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好了，这里是关于BB产品的全面指南，收入\n细节，客户，以及未来店内的情况。这是一个相当长的\n一、请您在阅读时，勉强接受，这是我第一次查到了\n关于一个公司在这个深度。\n\n的一些背景，约翰...",
      "title": "关于BB的综合指南，以及它在未来几年的腾飞。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好了，這裏是關於BB產品的全面指南，收入\n細節，客戶，以及未來店內的情況。這是一個相當長的\n一、請您在閱讀時，勉強接受，這是我第一次查到了\n關於一個公司在這個深度。\n\n的一些背景，約翰...",
      "title": "關於BB的綜合指南，以及它在未來幾年的騰飛。"
    }
  ],
  "title": "Comprehensive Guide about BB and how it shall take off in coming years",
  "created_utc": 1612474425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright folks, here&#39;s the comprehensive guide about the BB products, revenue details, customers, and what&#39;s in the store in the future. It&#39;s quite a lengthy one, please bare with me as you read and this is the first time I looked up regarding a company at this depth.</p>\n\n<p>Some background on the John Chen, who took up a massive challenge when he was the CEO for Sybase where the stock price was around 4-5$. But when he sold off to SAP it was around 65$, although it took 10 years to accomplish. He understands the business quite well and knows where to focus to generate more revenue and certainly be the best in what they do and provide the best to their customers.</p>\n\n<h1>Why should companies embrace BB products?</h1>\n\n<ul>\n<li>Best-in-class security</li>\n<li>Safety</li>\n<li>Reliability</li>\n</ul>\n\n<p><strong>Achievements:</strong></p>\n\n<ul>\n<li>18 of the G20 governments as customers</li>\n<li>Leader in EPP sector</li>\n<li>Only software company to attain various security certifications from US Govt</li>\n<li>BlackBerry’s solutions address over 96% of the collective threats (Frost &amp; Sullivan research data)</li>\n<li>19 out of 25 OEM’s are using BB QNX products</li>\n</ul>\n\n<p>Ref: <a href=\"https://imgur.com/OgrCGNg\">https://imgur.com/OgrCGNg</a></p>\n\n<p><strong>Achievements in 2019 (According to 10-k report):</strong></p>\n\n<ul>\n<li>Named as a Leader in Gartner’s 2019 Magic Quadrant for Unified Endpoint Management Tools for the fourth consecutive year</li>\n<li>Collaboration with Ansys to support BlackBerry QNX’s “RTOS” for connected and autonomous vehicles</li>\n<li>WM Motor to embed BlackBerry’s QNX Neutrino Realtime Operating System and other BlackBerry QNX software products within the company’s third-generation SUVs</li>\n<li>Integration of the QNX Platform for Digital Cockpits in MARELLI Electronics China’s eCockpit and Digital Cluster solution</li>\n<li>Reece Group is now using BlackBerry Cylance technology to protect thousands of endpoints across its retail stores and offices in Australia and the United States</li>\n<li>Agreement with ETAS GmbH, a subsidiary of Bosch, to cooperate on the joint development and marketing of an automotive software platform based on the AUTOSAR Adaptive standard</li>\n<li>Deeper partnership with Jaguar Land Rover for the use of the Company’s AI and machine learning technologies, BlackBerry QNX software and BlackBerry Cybersecurity Consulting services</li>\n<li>LG Electronics Inc. to accelerate the deployment of connected and autonomous vehicle technology for automotive OEMs and Tier 1 vendors</li>\n<li>SYNNEX Corporation to distribute the BlackBerry Enterprise Mobility Suite in the United States and accelerate partner recruitment for the BlackBerry Enterprise Partner Program</li>\n<li>BlackBerry Limited announced that the NATO Communications and Information (NCI) Agency has awarded a contract for BlackBerry’s SecuSUITE® for Government to encrypt the conversations of its technology and cyber leaders</li>\n</ul>\n\n<p><strong>Certifications</strong></p>\n\n<p>Let&#39;s highlight the <a href=\"https://imgur.com/U0wjME5\">security certifications</a> BB got in 2020.</p>\n\n<p>Before you read about the certifications which BB got, let this statement sink in deeply</p>\n\n<blockquote>\n<p>No other software vendor in the cybersecurity space has been awarded more security certification by the US Government than BlackBerry.</p>\n</blockquote>\n\n<p>In Q3 2020, BlackBerry UEM achieved the National Security Agency, NSA, commercial solution for classified program approval. This adds to the portfolio of US government certifications we have received for BlackBerry UEM including the NIAP-certification, the Department of Defense Information Network Approved Product List, which I think we talked about last quarter, DoDIN APL, FedRAMP and FIPS 140-2.</p>\n\n<p>Context from Q3 2020 earnings call:</p>\n\n<p><strong>Recognition</strong></p>\n\n<p>As you see from multiple research firms, BB stands out in what are they doing</p>\n\n<p>Ref: </p>\n\n<p><a href=\"https://imgur.com/2CMg3OV\">https://imgur.com/2CMg3OV</a></p>\n\n<p><a href=\"https://imgur.com/qE13Y32\">https://imgur.com/qE13Y32</a></p>\n\n<h1>Which Markets BB has and will be targeting?</h1>\n\n<ul>\n<li>IoT</li>\n<li>Cybersecurity</li>\n<li>Connected transportation</li>\n<li>Healthcare</li>\n<li>Financial services</li>\n<li>Government markets</li>\n<li>Energy</li>\n<li>Oil</li>\n<li>Gas</li>\n</ul>\n\n<h1>What Products are offered by BB?</h1>\n\n<p>I&#39;ll share brief info about the below products specific to QNX itself</p>\n\n<p><strong>QNX OTA:</strong></p>\n\n<p>QNX Over the Air (OTA) is a customized remote software update solution addressing the increasingly complex requirements of embedded system manufacturers. It can be tailored to seamlessly and securely update and manage endpoints on a variety of embedded systems.</p>\n\n<p><strong>QNX Acoustics Management Platform:</strong></p>\n\n<p>Design and manage the total vehicle sonic experience with a pure software solution designed to run on general-purpose application processor cores for cost-effective high-fidelity sound.</p>\n\n<p><strong>QNX Multimedia Suite:</strong></p>\n\n<p>If the OEM or developers would like to use a framework to build multimedia players.</p>\n\n<p><strong>QNX Black Channel Communications:</strong></p>\n\n<p>It provides reliable data transmission and consumption and greatly reduces the scope of certification while eliminating the need to have a safety certified network stack. It&#39;s critical across automotive, robotics, industrial controls, and medical device industries. It can run on QNX® OS (SDP 7.0 or QOS 2.1), Linux® or SafeRTOS.</p>\n\n<p><strong>QNX ADAS:</strong></p>\n\n<p>Integrates sensor feeds from diverse sources (Camera, Radar, LiDAR, IMU, GPS sensors, etc.) into your critical embedded systems, including autonomous driving applications.</p>\n\n<p><strong>RADAR:</strong></p>\n\n<p>Launched in 2016, it is a complete asset tracking solution providing reliable visibility to trailer, chassis, containers and equipment. These ruggedized devices are easy-to-install, low maintenance and long-lasting to minimize operational disruptions and maximize your ROI.</p>\n\n<p>How it’s different from rest of the competitors:</p>\n\n<ul>\n<li>High volume of collection, up to 100 times more than other solutions in the market</li>\n<li>It is designed for cloud-based – cloud-hosted business analytics applications, and reporting in one integrated and scalable platform</li>\n<li>Long lasting battery, its modular architecture, and the ease of installation</li>\n</ul>\n\n<p>Do check this post about description of the below products: <a href=\"https://www.reddit.com/r/wallstreetbets/comments/l4ehan/blackberry_dd/\">https://www.reddit.com/r/wallstreetbets/comments/l4ehan/blackberry_dd/</a></p>\n\n<ul>\n<li>QNX Products</li>\n<li>QNX OS</li>\n<li>QNX Hypervisor</li>\n<li>UEM</li>\n<li>UES</li>\n<li>Blackberry Spark</li>\n</ul>\n\n<h1>How can the BB retain leading position in different sectors?</h1>\n\n<p>The Company’s goal is to remain a leader in regulated industries and other core verticals by continuing to extend the functionality of its secure BlackBerry Spark® software platform (UEM + UES).</p>\n\n<h1>How does the EV Sector Exponential Growth help BB?</h1>\n\n<p>Well, the 2020 to 2022 is a period for gaining significant momentum in the Smart EV sector and which shall rapidly accelerate from 2023 to 2025. As we are noticing multiple companies in EV sector trying to launch their products.</p>\n\n<p>Most of the companies would love to be part of the growing EV sector as it just the beginning excluding TESLA. They will eventually develop products/platforms for OEM&#39;s and Tier1 and provide it as a service.</p>\n\n<p>As EV sector evolves more, we should see more partnerships across other companies which aren&#39;t part of BB yet might be inclined to use at least one product. As the BB product offerings are diverse and the customer success stories about how they have played a role while manufacturing their own EV products with minimal efforts can boost the marketing efforts.</p>\n\n<p>Chen stated they are going after the other 6 OEM&#39;s which aren&#39;t using the Blackberry yet. Currently, BlackBerry QNX has design wins with 19 of top 25 Electric Vehicle OEMs, who together have 61% of EV market.</p>\n\n<h1>How is BB coping up during the COVID?</h1>\n\n<p>The company expects BlackBerry QNX revenue to be negatively impacted by a slowdown in automotive market related to the COVID-19 pandemic, the impact of which could be partially offset by increased customer demand for the Company’s endpoint security and productivity solutions that support business continuity and remote working environments, including the BlackBerry Spark platform, SecuSUITE and BlackBerry AtHoc.</p>\n\n<h1>What&#39;s upcoming and where is BB focusing strategically?</h1>\n\n<p>The Company is developing a concept system to integrate BlackBerry Spark capabilities, including AI and machine learning technologies, with BlackBerry QNX automotive solutions. How to watch out for more information during the earnings calls.</p>\n\n<h1>How was the Customers growth among BB products?</h1>\n\n<p><strong>QNX:</strong></p>\n\n<p>QNX was acquired by BB in 2010, right from that moment, BB started its journey in Automotive industry. Initially, it has launched Infotainments and Telematic under QNX product category and it was deployed on leading car manufacturers. It started branching out and was able to offer more products under QNX. Now it is has aligned itself very well for the next gen EV cars.</p>\n\n<p>Adoption of QNX products from 2016 to 2020:</p>\n\n<ul>\n<li>2016 - 50 Million</li>\n<li>2017 - 60 Million</li>\n<li>2018 - 120 Million</li>\n<li>2019 - 150 Million</li>\n<li>2020 - 175 Million</li>\n</ul>\n\n<p>As we see, the growth has been substantial, and we can expect it grow more as we see more cars from new manufacturers and from existing ones and also automotive driving platforms especially in EV sector. There are currently 1.4 billion cars approximately.  In 2018, approximately 4.2 million heavy commercial vehicles and just over 20 million light commercial vehicles were produced throughout the world.</p>\n\n<p>It’s estimated to have at least 470 million cars by 2025.</p>\n\n<p>Link: <a href=\"https://www.itsdigest.com/470-million-connected-vehicles-road-2025\">https://www.itsdigest.com/470-million-connected-vehicles-road-2025</a>.</p>\n\n<p>The market share is about 10% in total across automotive</p>\n\n<p><strong>Customers:</strong></p>\n\n<p><a href=\"https://docs.google.com/spreadsheets/d/1NQQ6lkby32kHu2tWqbfYqlDEYy90KI6QfsyYd8moYjo/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1NQQ6lkby32kHu2tWqbfYqlDEYy90KI6QfsyYd8moYjo/edit?usp=sharing</a></p>\n\n<p><strong>IVY:</strong></p>\n\n<p>KARMA Automotive is the first customer to use this product.</p>\n\n<p>Link: <a href=\"https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-collaborating-with-amazon-web-services-to-demonstrate-safe-secure-and-intelligent-connected-vehicle-software-platform-for-in-vehicle-applications\">https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-collaborating-with-amazon-web-services-to-demonstrate-safe-secure-and-intelligent-connected-vehicle-software-platform-for-in-vehicle-applications</a></p>\n\n<p>Chen stated that there won&#39;t be much of the revenue growth from IVY until 2023.</p>\n\n<blockquote>\n<p>Under the terms of our agreement, BlackBerry will own all the commercial relationships with customers and will share revenues with AWS.  </p>\n\n<p>The target is to be in the 2023 year’s auto model, with possibly potentially some professional services prior to it. While it is too early for us to provide a revenue outlook, we are confident that BlackBerry IVY addresses a very large market opportunity that will greatly increase our ASP.</p>\n</blockquote>\n\n<p><strong>Cylance:</strong></p>\n\n<p>It is part of the Blackberry Spark product under UES category</p>\n\n<p>Typically, Cylance subscription period is 1 to 3 yrs. based on the deal’s BB made.</p>\n\n<p>Leader in EPP (Endpoint Protection Platform) and they are able to catch with competitors in EDR (Endpoint Detection and Response)</p>\n\n<p>Customers:</p>\n\n<p>Added 279 new customers and new active subscription customer growth was about 15%. Notable new customers include General Motors, Becton Dickinson, Phillips Healthcare, SKF, which is one of Sweden’s largest manufacturers, the New Zealand Defense Force and the United States Census Bureau, just to name a few.</p>\n\n<p>Verizon launched their business internet secure offering, which includes our BlackBerry smart AV antivirus product and Cisco’s Umbrella security service.</p>\n\n<p><strong>Blackberry Spark:</strong></p>\n\n<p>Spark is collection of BlackBerry Cylance, BlackBerry® UEM, BlackBerry® Dynamics™ and BlackBerry® Workspaces products. BB to pushing its efforts for customers to choose this product in 2021.</p>\n\n<p>Spark, as a reminder, is a combination of UEM and UES, the Unified Endpoint Security offerings. In the 2020 Q2, Q3, BB made good progress in both the government, and financial services verticals with customer wins</p>\n\n<ul>\n<li>U.S. Army\n\n<ul>\n<li>The United States Air Force, which upgraded over 90,000 users from UEM to the Spark Suite.</li>\n</ul></li>\n<li>U.S. Postal Service</li>\n<li>IRS</li>\n<li>Department of Energy</li>\n<li>Department of Justice</li>\n<li>Raymond James Financial</li>\n<li>Citibank</li>\n<li>German Bundesbank</li>\n<li>Bank of India</li>\n<li>Government of Rwanda</li>\n<li>UK Ministry of Defence</li>\n<li>Royal Canadian Mint</li>\n<li>Banco de Mexico</li>\n<li>New Zealand Ministry of Foreign Affairs and Trade</li>\n<li>Rolls Royce</li>\n<li>Lloyds Bank</li>\n<li>Societe Générale</li>\n<li>Mitsubishi UFJ Financial Group</li>\n<li>American Express</li>\n<li>CIBC</li>\n<li>The European Bank for Reconstruction and Development</li>\n<li>Qatar National Bank</li>\n<li>The National Commercial Bank</li>\n<li>Absa Bank</li>\n<li>The Development Bank of Singapore</li>\n</ul>\n\n<p>In addition, they had success in verticals including healthcare and manufacturing sector.</p>\n\n<p>Up on the acquisition of Cylance company, BB was able to integrate it with its existing products which will be part of UES suite. Customers are inclined to upgrade from UEM (Unified Endpoint Management) to UES (Unified Endpoint Security)</p>\n\n<p>Customers are eager to get with UES:</p>\n\n<ul>\n<li>Deutsche Bank</li>\n<li>Deutsche Borse</li>\n<li>ConvergeOne</li>\n<li>Multiple ministries of the Dutch government</li>\n</ul>\n\n<p>UEM Suite</p>\n\n<p>UEM Suite was added to the Department of Defense Information Network Approved Products List (DoDIN APL). <strong>BlackBerry is the only UEM vendor that has achieved this level of approval to date</strong>. This achievement is based on the completion of cybersecurity and interoperability certifications. This approval will provide us better access and a more streamlined approval process. This should naturally lead to greater revenue opportunities going forward. The latest release of UEM has also recently achieved NIAP accreditation</p>\n\n<p><strong>AtHoc:</strong></p>\n\n<p>Zoom was one of the customers who is using AtHoc product, after we know what happened to the stock when street found out that it wasn&#39;t secure. In this way, Zoom can highly secure way to hold virtual meetings in this new work-from-anywhere environment.</p>\n\n<p>Even, Microsoft Teams and ServiceNow’s Now platforms are on AtHoc. As we know, Teams market leader has 116 million active users and Service Now 51%, IT Service management.</p>\n\n<p>Customers:</p>\n\n<ul>\n<li>NYSE</li>\n<li>Office of the Director of National Intelligence</li>\n<li>Edmonton Police Service</li>\n<li>US Department of Transportation</li>\n</ul>\n\n<p><strong>BlackBerry Radar:</strong></p>\n\n<p>In 2020, Canadian Pacific Railway agreed to deploy product on 2,000 of its domestic intermodal chassis.</p>\n\n<p>In 2019, one of the top three U.S. retailers specializing in home improvement. The customer placed a 2,500 unit’s order.</p>\n\n<p>In 2019 fiscal year, they have added 50 new customers and recurring revenue from the existing customers.</p>\n\n<blockquote>\n<p>A big part of our competitive advantage is the BlackBerry legacy experience in designing a reliable, secure solution,” Plaat said. “That’s an important issue in this industry with high capital assets that you keep for years. The ROI is very good for a reliable solution like ours.”</p>\n</blockquote>\n\n<p>Customers:</p>\n\n<ul>\n<li>Almon Equipment</li>\n<li>Titanium Transportation Group</li>\n<li>KreilKamp Trucking</li>\n<li>RightLane Carrier</li>\n<li>Axsun</li>\n<li>Matson Logistics</li>\n<li>CP</li>\n<li>New Malwa Express</li>\n<li>CTS (Contract Transport Services)</li>\n<li>Polaris Transportation Group</li>\n<li>XTL</li>\n</ul>\n\n<h1>BB Revenue:</h1>\n\n<p>Check the Spreadsheet for the Revenue Sources.</p>\n\n<p><a href=\"https://imgur.com/pFnGMId\">2021 Fiscal year</a></p>\n\n<p>Note: Software and Services include these products IoT, QNX, BlackBerry Spark, AtHoc, Radar.</p>\n\n<p>The revenue got impacted due to 2020 chaos especially on the QNX product side. According to the earning calls. There are still on track to maintain the gross margin over 70% and dollar net retention rate is above 90%.</p>\n\n<p>As you see, the <a href=\"https://imgur.com/Qf6fp2n\">gross margin</a> has been consistent past few years and revenue is steadily increasing every year.</p>\n\n<p><a href=\"https://imgur.com/QjDndWv\">Revenue, Gross Margin, Net Income, EPS for years 2019, 2018, 2017 and 2016</a></p>\n\n<p><a href=\"https://imgur.com/ODRyRZY\">Growth in Revenue from Products from 2019-2013</a></p>\n\n<p>Notes:</p>\n\n<p>In 2019, due to restructuring, BB was unable to close deals, we should see +ve in 2020.</p>\n\n<p>IoT: Comprised of QNX products, UEM, &amp; Radar</p>\n\n<p>Other: Handheld Devices and Service Access Fee (SAF)</p>\n\n<p>Since BB was moving away from manufacturing of devices gradually, in 2020 most of it done by third party companies. That’s why we have negative growth under <strong>Other.</strong></p>\n\n<h1>Pricing for BB products</h1>\n\n<p><strong>QNX Pricing:</strong></p>\n\n<p>As there are many modules under QNX, like hypervisor, ADAS, clusters, cockpit, IVI. The cost ranges anywhere from the low-single digit dollars to literally high-single digit or low-double digit dollars per module.</p>\n\n<p>Trefis estimates BlackBerry generates about $4 in QNX revenue per vehicle. Automakers are only expected to ship about 62 million new vehicles this year, according to Statista Research. Assuming QNX is installed on at least half of those vehicles, BlackBerry would generate about $120 million in annual sales -- or nearly a fifth of its trailing 12-month software and services revenue -- from QNX this year.</p>\n\n<p>Link: <a href=\"https://www.fool.com/investing/2020/12/07/investors-overreacting-blackberry-deal-with-amazon/\">https://www.fool.com/investing/2020/12/07/investors-overreacting-blackberry-deal-with-amazon/</a></p>\n\n<p>Unfortunately, we don&#39;t know the exact price the QNX OS costs or per say other modules under QNX. If more modules of QNX are used, then it&#39;s adds up and the Average Rate for Per Unit might be 4x or 5x.</p>\n\n<p>This gives us an idea about how to get more revenue from QNX itself when the manufacturer would use other modules under QNX apart from OS.</p>\n\n<p>We have already seen list of the OEM&#39;s from previous posts and in the below spreadsheet you shall see list of the QNX products certain OEM&#39;s are using</p>\n\n<p>IoT subscription period is typically 4 yrs.</p>\n\n<p><strong>Radar Pricing:</strong></p>\n\n<p>Estimation in 2017:</p>\n\n<p>BlackBerry charges $10 to $20 per month for every trailer connected to Radar.</p>\n\n<p>The Go-to-Market objective is to have approximately a 50-50 split in Radar sales between BlackBerry’s channel partners and its direct sales force. BlackBerry Radar partners typically sell only this particular solution.</p>\n\n<p>Recently, BB was able to expand channel ecosystem to more than 12 channel partners, this new partnership might help BB capture more of the logistics and transportation area.</p>\n\n<p><a href=\"https://www.prnewswire.com/news-releases/blackberry-radar-expands-channel-ecosystem-with-new-partners-301052631.html\">https://www.prnewswire.com/news-releases/blackberry-radar-expands-channel-ecosystem-with-new-partners-301052631.html</a></p>\n\n<p><a href=\"https://www.reuters.com/article/us-blackberry-recovery/born-again-blackberry-canadian-icon-hopes-to-ride-trucks-to-growth-idUSKBN1901P1\">https://www.reuters.com/article/us-blackberry-recovery/born-again-blackberry-canadian-icon-hopes-to-ride-trucks-to-growth-idUSKBN1901P1</a></p>\n\n<p><strong>Cylance Pricing:</strong></p>\n\n<p>Cylance might charge 55$ per endpoint per year.</p>\n\n<p>Announced that Forrester found that BlackBerry Cylance’s AI-driven endpoint security products delivered a 99 percent return on investment. We will see more revenue in 2021 as we shared earlier that customers who bought UEM are excited about UES too.</p>\n\n<p>At present, the market share is below 1%.</p>\n\n<p>Ref: <a href=\"https://www.datanyze.com/market-share/ep--359\">https://www.datanyze.com/market-share/ep--359</a></p>\n\n<p><a href=\"https://imgur.com/bYEj5GZ\">The outlook of the Cylance in 2021 and further</a></p>\n\n<p><strong>Projected Product Sector Revenue Growth by 2025:</strong></p>\n\n<p><strong>QNX:</strong></p>\n\n<p>According to survey, the Global In-Vehicle Infotainment Market size is expected to reach $42.7 billion by 2025 (This is where we shall see more competition from different OEM manufacturers as they build their own products)</p>\n\n<p>Global Market Insights, Inc. has recently added a new report on automotive operating system market which estimates the global market valuation for automotive OS will cross US$ 4.5 billion by 2026</p>\n\n<p>And the QNX OS (Just the OS) segment is expected to grow at a CAGR of nearly 15% from 2020 to 2026</p>\n\n<p><a href=\"https://www.globenewswire.com/news-release/2020/11/24/2132346/0/en/Automotive-OS-Market-to-hit-USD-4-5-Bn-by-2026-Global-Market-Insights-Inc.html\">https://www.globenewswire.com/news-release/2020/11/24/2132346/0/en/Automotive-OS-Market-to-hit-USD-4-5-Bn-by-2026-Global-Market-Insights-Inc.html</a></p>\n\n<p><strong>Endpoint Protection (Cylance):</strong></p>\n\n<p>The global endpoint security market is expected to grow from 13.58 billion $ in 2020 to 19.24 billion $ in 2025 at a CAGR of 7.6% during the forecast period.</p>\n\n<p><a href=\"https://www.marketdataforecast.com/market-reports/endpoint-security-market\">https://www.marketdataforecast.com/market-reports/endpoint-security-market</a>.</p>\n\n<p>Assuming the market share in endpoint increases to ~3%. It can be around 577 million</p>\n\n<p><strong>Asset Management (Radar):</strong></p>\n\n<p>Global asset tracking market will reach $36.3B by 2025, growing at 15% CAGR</p>\n\n<p><a href=\"https://www.globenewswire.com/news-release/2020/03/04/1995009/0/en/Global-Asset-Tracking-Market-2020-2025-Insights-Into-Technologies-Solutions-and-the-Ecosystem-Including-Major-Players.html\">https://www.globenewswire.com/news-release/2020/03/04/1995009/0/en/Global-Asset-Tracking-Market-2020-2025-Insights-Into-Technologies-Solutions-and-the-Ecosystem-Including-Major-Players.html</a></p>\n\n<p>We have to know what the priority level for BB for this product and how much market share they are targeting in the upcoming years. It’s quite early to say about it and the contribution to the revenue is insignificant compared to other products.</p>\n\n<p><strong>Challenges:</strong></p>\n\n<p>QNX:</p>\n\n<p>Toyota, VW, Mercedes Benz have started taking route of AGL (Automotive Grade Linux) which is an open source (free to use) which implies the QNX market share in OS is waning. These are big manufacturers and how blackberry shall adapt is wait and see game.</p>\n\n<p>There is always a case where companies might decide not to use more of the QNX modules just the OS, this will impact the Average Selling Price (ASP) per car as well as the revenue since those modules add up 4x-5x ASP.</p>\n\n<p>IVY:</p>\n\n<p>Revenue from Blackberry IVY shall be more reflective from 2023, stated by Chen. So, there is uncertainty in this area and no revenue estimate. We have to see how this partnership plays out how companies are willing to adopt cloud platform for insights and management of the automotive software’s.</p>\n\n<p>Cylance:</p>\n\n<p>Currently, the market is highly competitive, and BB has to make it way to top 10 and capture more market share. In 2021, it shall unfold more about it as we are seeing rapid growth in IoT sector across various sectors.</p>\n\n<p>The BB is in the right position to capture more of the automotive market and we have to see how it shall play out in coming years when EV sector is full blown and more cars are delivered, and security threats increase. Also, it offers the endpoint protection, which certainly companies can benefit but not necessarily the SMB which are driven through e-commerce platforms.</p>\n\n<p>Radar:</p>\n\n<p>It’s barely scratching the surface in this sector and as there are bigger sharks who have been in the market for long time.</p>\n\n<p>In the second quarter of fiscal 2019, the Company previously stated that it expected to generate $100 million in cumulative revenue from its BlackBerry Radar asset tracking solution over the next three years. The Company no longer expects to generate this revenue within this time frame. (This is a set back and there are other competitors who have been in the Logistics and Transportation Industry for quite some time).</p>\n\n<p>In general, BB has to pitch itself more aggressively in other sectors especially in Medical, Industrial, Oil and Energy. Considering the certifications they have and the clients they serve.</p>\n\n<p>Thanks to OP&#39;s and go give a read at these DD&#39;s too:</p>\n\n<p><a href=\"https://new.reddit.com/r/wallstreetbets/comments/ks4s3s/bb_king_the_blast_from_the_past_with_the/\">https://new.reddit.com/r/wallstreetbets/comments/ks4s3s/bb_king_the_blast_from_the_past_with_the/</a></p>\n\n<p><a href=\"https://new.reddit.com/r/wallstreetbets/comments/l37ktg/bb_weekend_due_diligence_confirmation_bias/\">https://new.reddit.com/r/wallstreetbets/comments/l37ktg/bb_weekend_due_diligence_confirmation_bias/</a></p>\n\n<p>Target Price in 2021: 25-30 (by not considering crazy valuations into account). I personally believe if the IVY platform and Spark product revenue increases then we can certainly see the stock price 4x-5x in coming years.</p>\n\n<p>Positions: 400 shares @ 12 and 2 Jan 15 2023 calls. I plan to add more as I see the potential and growth in the newly introduced products.</p>\n\n<p>Disclaimer: This is not a financial advice, I&#39;m merely a random person who loves BB and would like to see this company fly to new heigths. Cheers to everyone!!</p>\n</div><!-- SC_ON -->",
  "score": 2512,
  "permalink": "/r/stocks/comments/lco7rh/comprehensive_guide_about_bb_and_how_it_shall/",
  "subreddit": "stocks",
  "id": "lco7rh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123200919
}