{
  "author": "Kilv3r",
  "original_created_utc": 1655289245,
  "title": "The reversal will not happen at a specific price. It will happen at specific market conditions.",
  "created_utc": 1655344776,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The sub is filled with “How low will it go” posts and people trying to guess a specific price the reversal will happen. The truth is that it will go lower until the inflation gets under control. I know is weird, the inflation should help crypto’s case not work against it but looking at the bigger picture will help understand the situation.    &lt;/p&gt;\n\n&lt;p&gt;The FED at the moment is pumping the value of the USD by continuously raising interest rates and by that effect lowering the value of everything that is paired against the dollar. It’s not more complicated than that. Once inflation will be brought down to normal levels and the quantitive tightening will stop, then the other assets can catch a break and return to normal.    &lt;/p&gt;\n\n&lt;p&gt;Yes there is the option where they can’t control the inflation and people will lose faith in the dollar in which case everything will explode in value but honestly when one of the world’s biggest economy will go through hyperinflation, half of the other nations would be absolutely ruined. The Euro and GBP are burning to the ground at the moment and it’s making the USD more of a safe space than ever to have your money in.&lt;/p&gt;\n\n&lt;p&gt;So basically it’s a matter of economic stability more than Bitcoin’s price.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/vcrhmx/the_reversal_will_not_happen_at_a_specific_price/",
  "subreddit": "CryptoCurrency",
  "id": "vcrhmx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The sub is filled with “How low will it go” posts and people trying to guess a\nspecific price the reversal will happen. The truth is that it will go lower\nuntil the inflation gets under control. I know is weird, the inflation should\nhelp crypto’s case not work against it but looking at the bigger…"
}