{
  "author": "Kilv3r",
  "original_created_utc": 1655289245,
  "title": "The reversal will not happen at a specific price. It will happen at specific market conditions.",
  "created_utc": 1655344776,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The sub is filled with “How low will it go” posts and people trying to guess a specific price the reversal will happen. The truth is that it will go lower until the inflation gets under control. I know is weird, the inflation should help crypto’s case not work against it but looking at the bigger picture will help understand the situation.    &lt;/p&gt;\n\n&lt;p&gt;The FED at the moment is pumping the value of the USD by continuously raising interest rates and by that effect lowering the value of everything that is paired against the dollar. It’s not more complicated than that. Once inflation will be brought down to normal levels and the quantitive tightening will stop, then the other assets can catch a break and return to normal.    &lt;/p&gt;\n\n&lt;p&gt;Yes there is the option where they can’t control the inflation and people will lose faith in the dollar in which case everything will explode in value but honestly when one of the world’s biggest economy will go through hyperinflation, half of the other nations would be absolutely ruined. The Euro and GBP are burning to the ground at the moment and it’s making the USD more of a safe space than ever to have your money in.&lt;/p&gt;\n\n&lt;p&gt;So basically it’s a matter of economic stability more than Bitcoin’s price.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/vcrhmx/the_reversal_will_not_happen_at_a_specific_price/",
  "subreddit": "CryptoCurrency",
  "id": "vcrhmx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The sub is filled with “How low will it go” posts and people trying to guess a\nspecific price the reversal will happen. The truth is that it will go lower\nuntil the inflation gets under control. I know is weird, the inflation should\nhelp crypto’s case not work against it but looking at the bigger…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サブには、「どこまで下がるか」という書き込みと、反転する値段を推測しようとする人がたくさんいます。\nを予想する人々で溢れています。真実は、インフレがコントロールされるまで、もっと下がる\nインフレがコントロールされるまで。私は奇妙であることを知っている、インフレは暗号のケースを助けるべきである\nしかし、もっと大きな視点で見ると......。",
      "title": "特定の価格で反転が起こるわけではありません。特定の市況で起こる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "子网站上充斥着 \"会跌到多低 \"的帖子，人们试图猜测一个\n试图猜测反转将发生的具体价格。事实是，它将走低\n直到通货膨胀得到控制。我知道这很奇怪，通货膨胀应该\n帮助加密货币的情况，而不是对它不利，但从更大的角度来看...",
      "title": "逆转不会发生在一个特定的价格。它将在特定的市场条件下发生。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "子網站上充斥着 \"會跌到多低 \"的帖子，人們試圖猜測一個\n試圖猜測反轉將發生的具體價格。事實是，它將走低\n直到通貨膨脹得到控制。我知道這很奇怪，通貨膨脹應該\n幫助加密貨幣的情況，而不是對它不利，但從更大的角度來看...",
      "title": "逆轉不會發生在一個特定的價格。它將在特定的市場條件下發生。"
    }
  ]
}