{
  "author": "TheDankGhost",
  "original_created_utc": 1631390923,
  "title": "To people who got circumsized late, what's the the difference between having a foreskin and not having one, in your opinion?",
  "created_utc": 1631414319,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been circumsized early so i don&#39;t know what it feels like to have a foreskin, and all i&#39;ve  heard so far are hypothetical differences from people who&#39;ve never been circumsized or who, like me, have no memory of having a foreskin. I would like to hear it from people with actual experience with both.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/pmegbj/to_people_who_got_circumsized_late_whats_the_the/",
  "subreddit": "NoStupidQuestions",
  "id": "pmegbj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been circumsized early so i don't know what it feels like to have a\nforeskin, and all i've heard so far are hypothetical differences from people\nwho've never been circumsized or who, like me, have no memory of having a\nforeskin. I would like to hear it from people with actual experience with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は早くから割礼を受けているので、包茎の感覚がわかりません。\n今まで聞いた話では、包茎をしたことがない人や、私のように包茎の記憶がない人から、仮説的な違いを聞いただけでした。\nこれまでに聞いたのは、包茎にしたことがない人や、私のように包茎だったことを覚えていない人の仮説的な違いだけです。\nこれまでに聞いたことがあるのは、包茎をしたことがない人や、私のように包茎だった記憶がない人の仮説的な違いだけです。実際に経験した人に聞いてみたいと思います。",
      "title": "遅れて割礼を受けた人に、あなたから見た包茎とそうでない場合の違いは何ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很早就有包皮过长，所以我不知道有包皮是什么感觉。\n到目前为止，我所听到的都是那些从未做过包皮手术的人的假设性差异。\n我目前听到的都是那些从未做过包皮手术或者像我一样对包皮没有印象的人的假设性差异。\n包皮。我希望从有实际经验的人那里听到...",
      "title": "对于那些很晚才做包皮手术的人来说，在你看来，有包皮和没有包皮的区别是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很早就有包皮過長，所以我不知道有包皮是什麼感覺。\n到目前爲止，我所聽到的都是那些從未做過包皮手術的人的假設性差異。\n我目前聽到的都是那些從未做過包皮手術或者像我一樣對包皮沒有印象的人的假設性差異。\n包皮。我希望從有實際經驗的人那裏聽到...",
      "title": "對於那些很晚才做包皮手術的人來說，在你看來，有包皮和沒有包皮的區別是什麼？"
    }
  ]
}