{
  "author": "Kaiisim",
  "original_created_utc": 1655208195,
  "title": "Shoutout to all the warnings from crypto veterans over the past 2 years",
  "created_utc": 1655232680,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;During the Bull run of 2020 and 21, I thought I understood crypto. Massive players were entering the market. More mainstream acceptance. So much FOMO.  The halvening is in 2024! Bitcoin is inflation proof! &lt;/p&gt;\n\n&lt;p&gt;I considered dumping everything into crypto. Taking out leverage. &lt;/p&gt;\n\n&lt;p&gt;But I didn&amp;#39;t because this sub would have posts from vets saying - dont do that. Warning that crypto winters are coooold and hard. &lt;/p&gt;\n\n&lt;p&gt;So I DCAed in. I avoided alt coins. I didnt spend more than I can afford to lose. I diversified into energy stocks. &lt;/p&gt;\n\n&lt;p&gt;Now its the end of the world - and I feel fine! No leverage so my crypto can sit there. I have cash so I dont need to panic sell. Im actually getting ready to buy when we truly hit the bottom! &lt;/p&gt;\n\n&lt;p&gt;So thanks to all the gloomy bastards who spent the last two years warning to be careful - I was ready for this shit show because of you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/vc1xyp/shoutout_to_all_the_warnings_from_crypto_veterans/",
  "subreddit": "CryptoCurrency",
  "id": "vc1xyp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "During the Bull run of 2020 and 21, I thought I understood crypto. Massive\nplayers were entering the market. More mainstream acceptance. So much FOMO. The\nhalvening is in 2024! Bitcoin is inflation proof!\n\nI considered dumping everything into crypto. Taking out leverage.\n\nBut I didn't because this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2020年、21年のブルランの時、私は暗号を理解したつもりだった。大規模な\nプレーヤーが市場に参入していました。よりメインストリームに受け入れられました。多くのFOMO。が出てきました。\nハーフベニングは2024年! ビットコインはインフレに強い!\n\n暗号に全てを投じることを検討しました。レバレッジをかけることも考えた\n\nしかし、私はそうしなかった なぜなら、これは...",
      "title": "過去2年間の暗号のベテランからの警告にエールを送ります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在2020年和21年的牛市运行期间，我以为我了解加密货币。大规模的\n玩家正在进入这个市场。更多的主流接受。如此多的FOMO。在\n2024年将迎来大庆! 比特币可以抵御通货膨胀!\n\n我考虑过把所有东西都扔到加密货币里。取出杠杆。\n\n但我没有，因为这...",
      "title": "向过去2年中所有来自加密货币老手的警告喊话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在2020年和21年的牛市運行期間，我以爲我瞭解加密貨幣。大規模的\n玩家正在進入這個市場。更多的主流接受。如此多的FOMO。在\n2024年將迎來大慶! 比特幣可以抵禦通貨膨脹!\n\n我考慮過把所有東西都扔到加密貨幣裏。取出槓桿。\n\n但我沒有，因爲這...",
      "title": "向過去2年中所有來自加密貨幣老手的警告喊話"
    }
  ]
}