{
  "author": "BigTiddyOrc",
  "original_created_utc": 1624790041,
  "title": "Do women really not enjoy working for female bosses?",
  "created_utc": 1624803360,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A girl I&#39;m seeing recently got a new job and mentioned how she&#39;s glad her boss is a man. I asked what she meant and she basically said a lot of older career women who become bosses see younger women in the workforce as competition for her power/social prestige and get jealous of them, so they engage with &#39;bitchy&#39; or catty with other women in the workplace.</p>\n\n<p>Of course I&#39;m not assuming all female bosses are like this, but do ladies how true is this? Do you actually have negative experiences working for female bosses?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/o8um4z/do_women_really_not_enjoy_working_for_female/",
  "subreddit": "TooAfraidToAsk",
  "id": "o8um4z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A girl I'm seeing recently got a new job and mentioned how she's glad her boss\nis a man. I asked what she meant and she basically said a lot of older career\nwomen who become bosses see younger women in the workforce as competition for\nher power/social prestige and get jealous of them, so they engage…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "付き合っている女の子が最近新しい仕事に就いて、「上司が男性でよかった」と言っていました。\nが男性でよかったと言っていました。どういう意味なのか聞いてみると、基本的には、上司になる年配のキャリアウーマンの多くは\n上司になった年配のキャリアウーマンの多くは、若い女性が社会に出てくると、自分の権力や社会的名声を奪う競争相手とみなして\n上司になる年配のキャリアウーマンの多くは、職場にいる若い女性を自分の権力や社会的名声の競争相手と見なし、彼女たちに嫉妬し、それゆえに...",
      "title": "女性は、女性の上司の下で働くことが本当に楽しくないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我交往的一个女孩最近得到了一份新工作，她提到她很高兴她的老板\n是个男人。我问她是什么意思，她基本上说，很多年长的职业女性在成为老板后，看到工作中的年轻女性，就会觉得很高兴。\n成为老板的很多年长的职业女性把年轻女性的工作视为对她的权力/社会声望的竞争，并嫉妒她。\n她的权力/社会声望，并嫉妒她们，所以她们从事...",
      "title": "女性真的不喜欢为女老板工作吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我交往的一個女孩最近得到了一份新工作，她提到她很高興她的老闆\n是個男人。我問她是什麼意思，她基本上說，很多年長的職業女性在成爲老闆後，看到工作中的年輕女性，就會覺得很高興。\n成爲老闆的很多年長的職業女性把年輕女性的工作視爲對她的權力/社會聲望的競爭，並嫉妒她。\n她的權力/社會聲望，並嫉妒她們，所以她們從事...",
      "title": "女性真的不喜歡爲女老闆工作嗎？"
    }
  ]
}