{
  "author": "Gilgameshbrah",
  "original_created_utc": 1648573384,
  "title": "Why do so many americans hate the homeless with an unrivaled passion?",
  "created_utc": 1648591180,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;All the money spent on &amp;quot;hostile architecture&amp;quot;, playing annoying music in parks so they can&amp;#39;t sleep, denying them access to public bathrooms and not wanting shelters anywhere in you immediate vacinity and punishing them when it would cost a fraction of that to feed and give them shelter points to real hatred. When it&amp;#39;s cheaper to help them than to punish them but you&amp;#39;d rather do the former through laws and policies made to hurt the poorest and most helpless of you. Why is that a thing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 127,
  "permalink": "/r/TooAfraidToAsk/comments/tr9pie/why_do_so_many_americans_hate_the_homeless_with/",
  "subreddit": "TooAfraidToAsk",
  "id": "tr9pie",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "All the money spent on \"hostile architecture\", playing annoying music in parks\nso they can't sleep, denying them access to public bathrooms and not wanting\nshelters anywhere in you immediate vacinity and punishing them when it would\ncost a fraction of that to feed and give them shelter points to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "敵対的建築物」に費やされたすべてのお金は、公園で迷惑な音楽を流している。\n眠れないようにし、公衆浴場の利用を拒否し、そして、そのような人たちを\n自分の周辺にシェルターがない場合、罰することができます。\n餌とシェルターポイントを与えるのに、その何分の一かの費用で...",
      "title": "なぜ多くのアメリカ人はホームレスを無類の嫌悪感で憎むのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所有花在 \"敌对建筑 \"上的钱，在公园里播放恼人的音乐\n让他们无法入睡，不让他们使用公共浴室，并且不希望在你附近的空地上有庇护所。\n庇护所的任何地方，并惩罚他们。\n惩罚他们的时候，只需要花费一小部分钱来喂养他们并给他们提供庇护点......",
      "title": "为什么这么多美国人对无家可归的人有一种无与伦比的热情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所有花在 \"敵對建築 \"上的錢，在公園裏播放惱人的音樂\n讓他們無法入睡，不讓他們使用公共浴室，並且不希望在你附近的空地上有庇護所。\n庇護所的任何地方，並懲罰他們。\n懲罰他們的時候，只需要花費一小部分錢來餵養他們並給他們提供庇護點......",
      "title": "爲什麼這麼多美國人對無家可歸的人有一種無與倫比的熱情？"
    }
  ]
}