{
  "author": "TwistedFluke",
  "original_created_utc": 1626831711,
  "title": "Conspiracy: I believe there’s downvote bots on this board",
  "created_utc": 1626863478,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every time I sort the posts by new, I notice that posts are instantly bombarded with downvotes while certain stocks that appears to be pumps are getting upvoted like crazy. To me it seems theres bots similar to what was posted to in regards to this but rather the bots posting similar comments..... it appears they’re doing the follow:</p>\n\n<ol>\n<li>Posting a bump or farming post</li>\n<li>Downvote the shit out of al new posts to have the algorithm favour their post</li>\n</ol>\n\n<p>I tried following some new posts and found that they get downvoted almost instantly to 50%-65% while a short post about “crypto name” gets an average 95% to 100% with those short comments either saying “crypto name” or an emoji.</p>\n\n<p>In conclusion, the moon system is broken</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/oog41f/conspiracy_i_believe_theres_downvote_bots_on_this/",
  "subreddit": "CryptoCurrency",
  "id": "oog41f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every time I sort the posts by new, I notice that posts are instantly bombarded\nwith downvotes while certain stocks that appears to be pumps are getting upvoted\nlike crazy. To me it seems theres bots similar to what was posted to in regards\nto this but rather the bots posting similar comments.....…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投稿を新着順に並べるたびに、ある投稿にはすぐにダウンコートがつき、ある投稿には\n一方で、パンプスと思われる特定の銘柄には狂ったようにupvoteがついています。\n狂ったように上昇しています。この件に関しては、投稿されたものと同様のボットがいるように思えます。\nむしろボットが似たようなコメントを投稿しているような気がします........",
      "title": "陰謀：この掲示板にはダウンボート・ボットがいると思います"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每次我按新帖排序时，我注意到帖子立即被轰击成\n而某些看起来是泵的股票却被疯狂地投上一票。\n像疯了一样。对我来说，似乎有类似于所发帖子的机器人来处理这个问题。\n导致的，而是发布类似评论的机器人........。",
      "title": "阴谋：我相信这个论坛上有降票的机器人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每次我按新帖排序時，我注意到帖子立即被轟擊成\n而某些看起來是泵的股票卻被瘋狂地投上一票。\n像瘋了一樣。對我來說，似乎有類似於所發帖子的機器人來處理這個問題。\n導致的，而是發佈類似評論的機器人........。",
      "title": "陰謀：我相信這個論壇上有降票的機器人"
    }
  ]
}