{
  "author": "EarthDefenceForces",
  "the_new_excerpt": "Dear fellow crypto enthusiasts,\n\nSurely you have noticed the XRP pump&dump that took place two days ago. I am\nposting this as someone who completely fell for it. I hope that by sharing my\nexperience I may gain some resolution and prevent someone else from doing the\nsame mistake.\n\nI am relatively new…",
  "original_created_utc": 1612361153,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "亲爱的加密爱好者朋友们\n\n你肯定已经注意到了两天前发生的XRP泵和倾倒事件。我是\n作为一个完全上当的人，发此贴。我希望通过分享我的\n经验，我可能会得到一些解决，并防止别人做。\n同样的错误。\n\n我是比较新...",
      "title": "我是如何和为什么我把我的HODL战略扔出窗外，爱上了一个泵和倾销的计划"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "親愛的加密愛好者朋友們\n\n你肯定已經注意到了兩天前發生的XRP泵和傾倒事件。我是\n作爲一個完全上當的人，發此貼。我希望通過分享我的\n經驗，我可能會得到一些解決，並防止別人做。\n同樣的錯誤。\n\n我是比較新...",
      "title": "我是如何和爲什麼我把我的HODL戰略扔出窗外，愛上了一個泵和傾銷的計劃"
    }
  ],
  "title": "How and why I threw my HODL strategy out the window and fell for a pump & dump scheme",
  "created_utc": 1612384638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Dear fellow crypto enthusiasts,</p>\n\n<p>Surely you have noticed the XRP pump&amp;dump that took place two days ago. I am posting this as someone who completely fell for it. I hope that by sharing my experience I may gain some resolution and prevent someone else from doing the same mistake.</p>\n\n<p>I am relatively new to crypto and went in way over my head. My strategy was to take most of my savings and put it on bitcoin for 5-7 years. Originally, I used €45k or $54k.</p>\n\n<p>I went in when BTC was a little over 20k. But when it dipped to 30k, I threw my own strategy out the window and thought that I could time the market. As I lacked strategy and patience, it resulted in a loss that brought me down from 2 BTC down to 1.55 BTC. This was a lesson for me, which I should have paid more attention to.</p>\n\n<p>Then on the first of February the XRP pump happened, so follow me for this ride (time in UTC):</p>\n\n<p><a href=\"https://preview.redd.it/be5aztpfq9f61.jpg?width=1486&amp;format=pjpg&amp;auto=webp&amp;s=c6a433c4bee9b5dda80294d6cd09865051722f3b\">https://preview.redd.it/be5aztpfq9f61.jpg?width=1486&amp;format=pjpg&amp;auto=webp&amp;s=c6a433c4bee9b5dda80294d6cd09865051722f3b</a></p>\n\n<ol>\n<li><strong>(05:00)</strong> Early in the morning, I notice the rise of XRP, because it was promoted in various subreddits. A huge rise was promised because of some arbitrary reason (ripple filed its defence towards the SEC).</li>\n<li><strong>(08:54) Buy order:</strong> At this point, I thought it was a good idea to switch about 50% of my BTC (0.77) into XRP.</li>\n<li><strong>(10:37)</strong> <strong>Sell order:</strong> It started to work. It went up and I sold it for 0.787 BTC. This small profit made me even more reckless.</li>\n<li><strong>(10:44) Buy order:</strong> I saw a larger dip, which happened before on XRPs way up. I thought that this was a good spot to get in again. My goal was now to swing back to 2 BTC to remake my loss. A huge gambling red flag – as I learned later.</li>\n<li><strong>(11:14) Buy order:</strong> It’s up again! I thought that I should accelerate the gain by moving the rest of my BTC (0.78) into XRP. I am almost there! Somewhere I read that there was a huge pump incoming at 14:30. I was adamant about holding until then.</li>\n<li><strong>(12:14) Sell order:</strong> I didn’t realize what has happened, but now there was an even bigger dip. I panicked and sold, but I am now down to 1.157 BTC.</li>\n<li><strong>(12:15) Buy order:</strong> Another irrational decision, as I thought that this surely must be the recovery. So I went all-in again.</li>\n<li><strong>(13:33) Sell order:</strong> Another panic sell. Now I only get 0.9 BTC.</li>\n<li><strong>(13:36) Buy order:</strong> I thought that the loss is unacceptable and that this must be the recovery before the big pump! I go all-in into XRP again.</li>\n<li><strong>(17:11) Sell order:</strong> My final sell order. I am now down to 0.66 BTC and finally realizing that I got scammed and that I was left holding the bag.</li>\n</ol>\n\n<p>Here is my transaction history from Bitstamp:</p>\n\n<p><a href=\"https://i.redd.it/xdefuznhq9f61.gif\">https://i.redd.it/xdefuznhq9f61.gif</a></p>\n\n<p>My worst mistakes besides not sticking to my HODL strategy were that I invested more than I could afford to lose, that I did not accept the losses, and that I fell for the obvious pump&amp;dump signs:</p>\n\n<ul>\n<li>The many posts that were advocating the XRP recovery.</li>\n<li>The speed as XRP gained significant volume over the course of a few hours.</li>\n<li>The rumour of a huge pump on a specific time.</li>\n</ul>\n\n<p>Now there is a great guide out there on pump&amp;dump schemes by <a href=\"/u/Anhowa123\">u/Anhowa123</a> that I wish I had known earlier:</p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/lb4zsv/with_the_recent_influx_of_new_users_i_decided_to/\">https://www.reddit.com/r/CryptoCurrency/comments/lb4zsv/with_the_recent_influx_of_new_users_i_decided_to/</a></p>\n\n<p>Apparently, everything was organized via a telegram group. I lost about €25k or 0.9 BTC in the pump&amp;dump. This is more than I can take to lose. Since then, I am devasted. I am feeling physically sick and stressed. I can barely eat, and I am too ashamed to tell anyone in person what I have done.</p>\n\n<p>The worst part is that I have invested money that I inherited from my grandmother, who worked hard for this. I feel that I have let her down and I do not know what to do anymore. It would take me many years to earn it back.</p>\n\n<p>Please don’t make the mistakes that I did.</p>\n</div><!-- SC_ON -->",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/lbo7zw/how_and_why_i_threw_my_hodl_strategy_out_the/",
  "subreddit": "CryptoCurrency",
  "id": "lbo7zw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532601
}