{
  "author": "Set1Less",
  "original_created_utc": 1652740076,
  "title": "Analysis shows a possibility that LFG/operators allowed VCs and insiders to be bailed out at $1 peg with their early trades, while retail holders took the slack and lost almost everything",
  "created_utc": 1652769939,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Transaction analysis has uncovered a possible series of transactions that could have possibly allowed few holders to cash out almost at 100% peg, while majority who held on till late lost all their savings.&lt;/p&gt;\n\n&lt;p&gt;This becomes even more suspicious as LFG and other operators are not releasing evidence of their transactions where they claim they sold coins to market makers.&lt;/p&gt;\n\n&lt;p&gt;The initial research has been done by blockchain analysis software provider Elipsis, and shows the possible time of the trades and are documented here: &lt;a href=\"https://twitter.com/elliptic/status/1525246959161905153\"&gt;https://twitter.com/elliptic/status/1525246959161905153&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The LFG wallets were emptied on 9/10 May, as UST began to collapse - purportedly to to support the UST price&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;However today, LFG revealed they sold their holdings as below:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://twitter.com/LFG_org/status/1526126708193054721\"&gt;https://twitter.com/LFG_org/status/1526126708193054721&lt;/a&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Transferred 52,189 BTC to trade with a counterparty, net of an excess of 5,313 $BTC that they have returned, for an aggregate 1,515,689,462 UST&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This implies 52189 minus 5313 btc was sold for 1515689462 UST , i.e. the BTC price at the time of sale/loan was : $32334.01&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sold 33,206 BTC for an aggregate 1,164,018,521 UST&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;a href=\"https://twitter.com/LFG_org/status/1526126713062576128\"&gt;https://twitter.com/LFG_org/status/1526126713062576128&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This gives us a BTC price of $35054.46 per BTC at the time of this transaction!&lt;/p&gt;\n\n&lt;p&gt;LFG apparently used the proceeds of the BTC sale to market buy UST on exchanges in an effort to support its peg. &lt;/p&gt;\n\n&lt;p&gt;If you look at BTC charts, the price of BTC during 9th to 10th May was around $34200 to $29700 range. &lt;/p&gt;\n\n&lt;p&gt;This means those who were on the opposite side of LFG&amp;#39;s BTC sale for UST buys (published by LFG themselves) seemed to have got a much higher conversion rate, than what the UST&amp;#39;s crashing price reflected! &lt;/p&gt;\n\n&lt;p&gt;According to the price of UST on Coinbase, we can see that on 9th, UST ranged from 99.6c to as low as 75c! And on 10th, UST opened at 93c and fell to as low as 62c! &lt;/p&gt;\n\n&lt;p&gt;Those who were on the other side of these initial trades were able to redeem their UST almost at a $1 peg, as LFG bought their coins. &lt;/p&gt;\n\n&lt;p&gt;Who were at the end of these trades, only LFG and other insiders seem to know. &lt;/p&gt;\n\n&lt;p&gt;This whole thing is murky af, and this kind of suspicions is enough to call for an audit of the entire transaction history by a reputed audit firm. Around $40 BN worth assets were burnt to the ground in this mess, it is not a small amount by any means. The Mcap destroyed in this is comparable to the mcap of Lehmann Brothers. Whats worse is that UST mcap was actually dollar denominated debt held by many retail users. &lt;/p&gt;\n\n&lt;p&gt;LFG and all the operators/insiders involved should provide maximum transparency around these trades.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 308,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/a9qdmWmWhnakXnhCbmp3mjHCH45254WDZlzSq_huOKw.jpg?auto=webp&amp;s=8ea5c62f293899795b49d4d40038e67ec60cad3d",
          "width": 140,
          "height": 73
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/a9qdmWmWhnakXnhCbmp3mjHCH45254WDZlzSq_huOKw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=a6fce7ba005c3220a8142cf7f12c8c3d09873138",
            "width": 108,
            "height": 56
          }
        ],
        "variants": {},
        "id": "GUglDkEo9PwZKekaBBR_l6tRDeU6RjNpP1MwWs2zXlo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ur7uqe/analysis_shows_a_possibility_that_lfgoperators/",
  "subreddit": "CryptoCurrency",
  "id": "ur7uqe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Transaction analysis has uncovered a possible series of transactions that could\nhave possibly allowed few holders to cash out almost at 100% peg, while majority\nwho held on till late lost all their savings.\n\nThis becomes even more suspicious as LFG and other operators are not releasing\nevidence of…"
}