{
  "author": "LetsGoToTheMars",
  "original_created_utc": 1653370586,
  "title": "How is Zelensky's request to receive $10 billion a month not ridiculous?",
  "created_utc": 1653401022,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Firstly, I am 100% opposing Russia&amp;#39;s actions against Ukraine.&lt;/p&gt;\n\n&lt;p&gt;As you may have heard, Zelensky gave a 25 minute speech at the world economic forum requesting $10 billion a month to rebuild Ukraine. &lt;/p&gt;\n\n&lt;p&gt;I understand that the country got destroyed big times and that it will cost a fortune to get back to normal but asking for that much money on a monthly base seems kinda ridiculous?&lt;/p&gt;\n\n&lt;p&gt;Most (if not all?) Nations across the world are heavily indebted and I don&amp;#39;t understand where the money is supposed to come from. &lt;/p&gt;\n\n&lt;p&gt;The speech was directed to leaders of nations and businesses, so if everyone chips in &amp;quot;only&amp;quot; a few millions, I guess we could get to the $10B a month but if that&amp;#39;s possible, I am wondering why they were not able to get that much money together for other issues such as climate change or world hunger. &lt;/p&gt;\n\n&lt;p&gt;Anyway, please share your thoughts, perhaps you have a different perspective on this topic that broadens my mind.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/uwjnqj/how_is_zelenskys_request_to_receive_10_billion_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "uwjnqj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Firstly, I am 100% opposing Russia's actions against Ukraine.\n\nAs you may have heard, Zelensky gave a 25 minute speech at the world economic\nforum requesting $10 billion a month to rebuild Ukraine.\n\nI understand that the country got destroyed big times and that it will cost a\nfortune to get back to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず、私はロシアのウクライナに対する行動には100％反対です。\n\nご存知のように、ゼレンスキーは世界経済フォーラムで25分間のスピーチを行い、ウクライナの再建のために毎月100億ドルを要求しました。\nウクライナを再建するために毎月100億ドルを要求した。\n\n国が大きく破壊され、元に戻るには莫大な費用がかかることは理解しています。\nそのために必要なのは...",
      "title": "毎月100億円を受け取るというゼレンスキーの要求は、どうして馬鹿げたことではないのだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我100%反对俄罗斯对乌克兰的行动。\n\n你可能已经听说了，泽伦斯基在世界经济论坛上发表了25分钟的演讲，要求每月提供100亿美元来重建乌克兰。\n论坛上发表了25分钟的演讲，要求每月提供100亿美元来重建乌克兰。\n\n我知道，这个国家被摧毁了很久，而且要花一大笔钱才能恢复。\n财富来恢复...",
      "title": "泽伦斯基要求每月收到100亿美元，这怎么会不荒唐呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我100%反對俄羅斯對烏克蘭的行動。\n\n你可能已經聽說了，澤倫斯基在世界經濟論壇上發表了25分鐘的演講，要求每月提供100億美元來重建烏克蘭。\n論壇上發表了25分鐘的演講，要求每月提供100億美元來重建烏克蘭。\n\n我知道，這個國家被摧毀了很久，而且要花一大筆錢才能恢復。\n財富來恢復...",
      "title": "澤倫斯基要求每月收到100億美元，這怎麼會不荒唐呢？"
    }
  ]
}