{
  "author": "Interesting-Base84",
  "original_created_utc": 1653567665,
  "title": "The modern React UI components - Float UI",
  "created_utc": 1653577429,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you are working as a web developer with a company, just as a freelancer, or building your first Start-Up of course you will need something to build your websites, web apps quickly.&lt;/p&gt;\n\n&lt;p&gt;The React UI libraries like material UI and React Bootstrap built to help others to save the time, by building web products quickly, and this is exactly what Float UI do.&lt;/p&gt;\n\n&lt;h1&gt;What is &lt;strong&gt;Float UI&lt;/strong&gt;?&lt;/h1&gt;\n\n&lt;p&gt;&lt;a href=\"https://floatui.com\"&gt;Float UI&lt;/a&gt; is a collection of ready React components, such as CTA sections, Newsletters, Cards, Navbars, Footers, etc... the components are beautiful designed, expertly crafted components, that allow you to build a great UI/UX, and are easy to customize, you can use the components with Nextjs, if you want.&lt;/p&gt;\n\n&lt;h2&gt;Float UI Supports RTL Components.&lt;/h2&gt;\n\n&lt;p&gt;When we released The first version of &lt;a href=\"https://floatui.com\"&gt;Float UI&lt;/a&gt;, the components were only supporting LTR ( Left To Right ) direction, then we thought of building this feature, to allowing people creating their products using both directions LTR and RTL, and also for reach out to more people to use Float UI components.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://floatui.com\"&gt;Float UI&lt;/a&gt; supports RTL components very smoothly.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;ALRIGHT&lt;/em&gt;. &lt;a href=\"https://floatui.com\"&gt;Float UI&lt;/a&gt; keeps growing every day and we get a lot of comments about it and what we need to do to improve it. We&amp;#39;d love to hear your opinion about Float UI.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s go, guys!&lt;/p&gt;\n\n&lt;p&gt;Url: &lt;a href=\"https://floatui.com\"&gt;https://floatui.com&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 6,
  "permalink": "/r/SideProject/comments/uy6da3/the_modern_react_ui_components_float_ui/",
  "subreddit": "SideProject",
  "id": "uy6da3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you are working as a web developer with a company, just as a freelancer, or\nbuilding your first Start-Up of course you will need something to build your\nwebsites, web apps quickly.\n\nThe React UI libraries like material UI and React Bootstrap built to help others\nto save the time, by building web…"
}