{
  "author": "ijustliketocomment",
  "original_created_utc": 1644300450,
  "title": "Are \"pronoun affirmations\" at the beginning of work meetings normal or weird?",
  "created_utc": 1644317646,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work for a small company in CA and recently a new policy was put into place where at the beginning of meetings that involve new clients or partners, we go around and do introductions and share pronouns and then do &amp;quot;pronoun affirmations.&amp;quot; Which means that each person in the group says the name of every other person and that they affirm their pronouns. &lt;/p&gt;\n\n&lt;p&gt;So if I was meeting with Bob, Linda, and Pat, I would say, &amp;quot;I affirm Bob&amp;#39;s pronouns are he/him, thank you Bob. I affirm Linda&amp;#39;s pronouns are she/they, thank you Linda. I affirm Pat&amp;#39;s pronouns are they/them, thank you Pat.&amp;quot; And then the next person would go. When we organize meetings we include instructions about this to new people we are meeting with so they will know what to do.&lt;/p&gt;\n\n&lt;p&gt;The managers told us the purpose of this is to affirmatively express our acceptance of the pronouns of others. It feels awkward though, and sometimes I think the people we are meeting with seem anxious. Also when there&amp;#39;s more than about five people it takes a long time. &lt;/p&gt;\n\n&lt;p&gt;So is this normal or is my company going overboard? I haven&amp;#39;t heard about this from anyone else, most people just put their pronouns in their email sigs.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/sncxol/are_pronoun_affirmations_at_the_beginning_of_work/",
  "subreddit": "TooAfraidToAsk",
  "id": "sncxol",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work for a small company in CA and recently a new policy was put into place\nwhere at the beginning of meetings that involve new clients or partners, we go\naround and do introductions and share pronouns and then do \"pronoun\naffirmations.\" Which means that each person in the group says the name of…"
}