{
  "author": "ijustliketocomment",
  "original_created_utc": 1644300450,
  "title": "Are \"pronoun affirmations\" at the beginning of work meetings normal or weird?",
  "created_utc": 1644317646,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I work for a small company in CA and recently a new policy was put into place where at the beginning of meetings that involve new clients or partners, we go around and do introductions and share pronouns and then do &amp;quot;pronoun affirmations.&amp;quot; Which means that each person in the group says the name of every other person and that they affirm their pronouns. &lt;/p&gt;\n\n&lt;p&gt;So if I was meeting with Bob, Linda, and Pat, I would say, &amp;quot;I affirm Bob&amp;#39;s pronouns are he/him, thank you Bob. I affirm Linda&amp;#39;s pronouns are she/they, thank you Linda. I affirm Pat&amp;#39;s pronouns are they/them, thank you Pat.&amp;quot; And then the next person would go. When we organize meetings we include instructions about this to new people we are meeting with so they will know what to do.&lt;/p&gt;\n\n&lt;p&gt;The managers told us the purpose of this is to affirmatively express our acceptance of the pronouns of others. It feels awkward though, and sometimes I think the people we are meeting with seem anxious. Also when there&amp;#39;s more than about five people it takes a long time. &lt;/p&gt;\n\n&lt;p&gt;So is this normal or is my company going overboard? I haven&amp;#39;t heard about this from anyone else, most people just put their pronouns in their email sigs.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/sncxol/are_pronoun_affirmations_at_the_beginning_of_work/",
  "subreddit": "TooAfraidToAsk",
  "id": "sncxol",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I work for a small company in CA and recently a new policy was put into place\nwhere at the beginning of meetings that involve new clients or partners, we go\naround and do introductions and share pronouns and then do \"pronoun\naffirmations.\" Which means that each person in the group says the name of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はカリフォルニア州の小さな会社に勤めていますが、最近、新しいポリシーが導入されました。\n新しい顧客やパートナーが参加する会議の冒頭で、私たちは次のようなことを行っています。\n自己紹介をし、代名詞を共有した後、「代名詞」を行います。\nアファメーション \"です。つまり、グループ内の各人が名前を言うのです...",
      "title": "仕事の打ち合わせの冒頭で「代名詞の肯定」は普通なのか、それとも変なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在加州的一家小公司工作，最近实施了一项新政策\n在涉及到新客户或合作伙伴的会议开始时，我们要绕着做自我介绍，分享人称，然后做 \"人称\"。\n围绕做介绍，分享代词，然后做 \"代词确认\"。\n肯定\"。这意味着小组中的每个人都要说出自己的名字。",
      "title": "在工作会议开始时的 \"代词肯定 \"是正常的还是奇怪的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在加州的一家小公司工作，最近實施了一項新政策\n在涉及到新客戶或合作伙伴的會議開始時，我們要繞着做自我介紹，分享人稱，然後做 \"人稱\"。\n圍繞做介紹，分享代詞，然後做 \"代詞確認\"。\n肯定\"。這意味着小組中的每個人都要說出自己的名字。",
      "title": "在工作會議開始時的 \"代詞肯定 \"是正常的還是奇怪的？"
    }
  ]
}