{
  "author": "swarley_14",
  "original_created_utc": 1639641091,
  "title": "Why is \"Muhammad\" such a common name among Muslims but \"Jesus\" isn't among Christians. Even though both are equally important in their religions.",
  "created_utc": 1639670427,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Edit: Many answers have pointed out that Jesus is in fact a common name in many countries. I agree with that but still it&amp;#39;s not as common as &amp;quot;Muhammad&amp;quot; (Which is the most popular first name in whe world with over 150 million people). I want to understand this difference. Is it social, religious, cultural....? &lt;/p&gt;\n\n&lt;p&gt;To paraphrase the question: &amp;quot;Why the name &amp;quot;Jesus and its variants&amp;quot; is not as popular as &amp;quot;Muhammad and it&amp;#39;s variants&amp;quot;?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/rhluwx/why_is_muhammad_such_a_common_name_among_muslims/",
  "subreddit": "NoStupidQuestions",
  "id": "rhluwx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: Many answers have pointed out that Jesus is in fact a common name in many\ncountries. I agree with that but still it's not as common as \"Muhammad\" (Which\nis the most popular first name in whe world with over 150 million people). I\nwant to understand this difference. Is it social, religious,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：多くの回答者が、イエスは実際には多くの国で一般的な名前であると指摘しています。\nの国です。私もそれには賛成ですが、それでも「ムハンマド」ほどには一般的ではありません（これは\n1億5千万人以上いる世界で最も人気のあるファーストネームです。） I\nこの違いを理解したいのです。社会的なものなのか、宗教的なものなのか、それとも......。",
      "title": "なぜ、イスラム教徒の間では「ムハンマド」が一般的なのに、キリスト教徒の間では「イエス」が一般的でないのか。どちらも宗教上、同じように重要なのに。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：许多答案都指出，耶稣其实是许多国家的一个普通名字。\n国家是很常见的名字。我同意这一点，但它仍然没有 \"穆罕默德\"（Muhammad）那么普遍。\n是小麦世界上最受欢迎的名字，有超过1.5亿人）。I\n我想了解这种差异。它是社会的、宗教的、...",
      "title": "为什么 \"穆罕默德 \"在穆斯林中是如此常见的名字，而 \"耶稣 \"在基督徒中却不是。尽管两者在他们的宗教中同样重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：許多答案都指出，耶穌其實是許多國家的一個普通名字。\n國家是很常見的名字。我同意這一點，但它仍然沒有 \"穆罕默德\"（Muhammad）那麼普遍。\n是小麥世界上最受歡迎的名字，有超過1.5億人）。I\n我想了解這種差異。它是社會的、宗教的、...",
      "title": "爲什麼 \"穆罕默德 \"在穆斯林中是如此常見的名字，而 \"耶穌 \"在基督徒中卻不是。儘管兩者在他們的宗教中同樣重要。"
    }
  ]
}