{
  "author": "koshermodels",
  "the_new_excerpt": "Like the Post says I have been steady acquiring Joann fabrics (JOAN) stocks\nbecause it is a pick and shovel stock. If you are unfamiliar with the topic,\nwhat that means is in a gold rush you don’t go digging for gold you sell the\npicks and shovels to dig gold. Tech stocks can be way overvalued, so…",
  "original_created_utc": 1621299440,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポストに書かれているように、私はJoann fabrics (JOAN)の株を着実に取得してきました。\nなぜなら、ピック＆ショベルの銘柄だからです。この話題に慣れていない人は、この意味を理解していないだろう。\nゴールドラッシュでは、金を掘りに行くのではなく、金塊を売るということです。\n金を掘るためのピックとシャベルを売るのです。技術株は過大評価されている可能性があるので、...",
      "title": "ジョアン・ファブリックスの株は「ピック・アンド・ショベル」ということで取得していますが、他の「ピック・アンド・ショベル」銘柄でお勧めはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像帖子里说的，我一直在稳定地收购Joann织物（JOAN）的股票\n因为它是一种镐头和铲子股票。如果你对这个话题不熟悉。\n这意味着在淘金热中，你不去挖金子，而是出售\n镐头和铁锹来挖金子。科技股的价值可能被高估，所以...",
      "title": "我一直在收购Joann Fabrics的股票，因为它是一种 \"镐和铲 \"的股票，你还推荐哪些 \"镐和铲 \"的股票？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像帖子裏說的，我一直在穩定地收購Joann織物（JOAN）的股票\n因爲它是一種鎬頭和鏟子股票。如果你對這個話題不熟悉。\n這意味着在淘金熱中，你不去挖金子，而是出售\n鎬頭和鐵鍬來挖金子。科技股的價值可能被高估，所以...",
      "title": "我一直在收購Joann Fabrics的股票，因爲它是一種 \"鎬和鏟 \"的股票，你還推薦哪些 \"鎬和鏟 \"的股票？"
    }
  ],
  "title": "I have been acquiring Joann Fabrics stock because it is a “pick and shovel” stock, what other “pick and shovel” stocks do you recommend?",
  "created_utc": 1621309585,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like the Post says I have been steady acquiring Joann fabrics (JOAN) stocks because it is a pick and shovel stock. If you are unfamiliar with the topic, what that means is in a gold rush you don’t go digging for gold you sell the picks and shovels to dig gold. Tech stocks can be way overvalued, so instead of buying Etsy or EBay, one might buy JOAN because it sells to those who sell on those platforms. Scott’s Miracle Gro (SMG) is also an example, and who I own stock in, for the marijuana industry. </p>\n\n<p>I would love to get recommendations for any other stocks that you think fit in this category.</p>\n</div><!-- SC_ON -->",
  "score": 245,
  "permalink": "/r/stocks/comments/newz73/i_have_been_acquiring_joann_fabrics_stock_because/",
  "subreddit": "stocks",
  "id": "newz73",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590804459
}