{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "https://docs.google.com/spreadsheets/d/1wTaLVChUTW7l_-1eMn5JcirG7Mjg8dbyyd_gT85FkPU/edit?usp=sharing\n\n______\n\nHi all,\n\nAs my first DCF with the community, I'll be writing about Waste Management.  Before I begin, I'd like to state my intentions with this post.\n\nFirst, I am by no means a professional investor.  I do this for fun.  Do not make any decisions based on my work and please do your own due diligence.\n\nSecond, while I am happy to do the heavy lifting, this is a community exercise.  I will post my initial findings, but I want the community to challenge my assumptions.  If I am wrong about something, please let me know.  Criticism is fine and encouraged.  \n\nSince my intention is to produce a large number of these for the community, I won't be digging too deep unless I see a compelling opportunity.  My goal is to get into the ballpark of a fair value as there is a sacrifice of quality in the name of quantity.  As I am not digging deep on most stocks, there is a greater chance that my assumptions are not fair (though if I'm not looking further into a company, it's typically because I believe the difference between my initial valuation and an accurate valuation is too great and my time would be better spent elsewhere).  \n\nIf I see an opportunity that is interesting, I will spend a much greater amount of time on the stock and will stop producing daily DCFs for a while.\n\nThe above points will be listed with every post.\n\nAs for the DCF, I produce it using a 10 year history of a company's income statements.  I will assume an interest rate of 2% and make my discount rate assumption based on recent debt offerings by the company.  I may need to increase the interest rate in the future, but I will continue using 2% for the time being.  I also look for irregularities and points of possible concern in the balance sheet.  Within the Cash flow statement, I use it when making an investment decision, but it does not come into play within my DCF.\n\nWithout further adieu, here we go.\n\nWaste Management is a provider of waste management environmental services including: Collection, Landfill, Transfer, Recycling and Other lines of business.  They trade on the NYSE at a SP of $159.8.  They have a Mkt Cap of $66B.  Based on my initial DCF for WM, they are overvalued by more than 100%.  As such, I have limited my review to 10 years of income statements, one year of press releases, and the 2021 annual report.  Had WM seemed more compelling, there are many more details that I'd want to investigate which would require reading additional reports, reviewing earnings calls, investigating management, looking at publicly available employee feedback, etc, but alas, this is a pretty brief and simplified DCF so that I can spend tomorrow looking at another company that I hope will provide a more interesting story.\n\nAttached below is a DCF for WM:\n\nhttps://docs.google.com/spreadsheets/d/1wTaLVChUTW7l_-1eMn5JcirG7Mjg8dbyyd_gT85FkPU/edit?usp=sharing\n\nWithin, we see that WM can expect long term growth of roughly 3.1%.  COGS generally trails revenue by .3%.  While this growth isn't exceptional, it is fairly reasonable considering that the waste industry is both mature and stable.  The majority of revenue growth comes from their collection business rather than their disposal business, albeit neither number is overly exciting.\n\nThere is limited opportunity to drive revenue growth within the control of the company.  Revenue can grow through acquisition, higher commodity prices for recyclables, and more favourable terms with municipalities.  Acquisitions would need to be evaluated on a case by case basis.  In the case of commodities, given their cyclical nature, we can not expect this to provide long-term growth, but rather to come in short 2 to 3 year bursts. \n\nShare repurchasing will continue in a limited capacity with an average buyback rate of 1%.  This honestly seems like a good use of excess cash given their limited opportunities for growth. They could pay down debt, but their debt terms are very favourable, thus there is no rush.\n\nSome closing remarks about WM:\n\nI suspect WM is overvalued because it is a strong and reliable business.  The company has a tremendous moat and incredibly steady, predictable growth.  These traits can lead to a company trading at a premium.  I am not a buyer at this price and given its industry and reputation, I suspect it will never get to a price where I am a buyer.  With that said, if you have this stock in your portfolio, are not trying to chase higher returns, and you plan on holding it until you retire, this truly seems like a \"set it and forget it\" stock that will allow you to sleep comfortably at night.  This stock seems fine in the long-run, but is not of interest to me at this time.\n\n_________\n\nIf you want to propose another stock, please use the following thread:\nhttps://www.reddit.com/r/stocks/comments/v6svtc/give_me_a_company_and_i_will_make_a_discounted/\n\nPlease read the criteria in that thread.  I will not be reviewing Gamestop.",
  "author_fullname": "t2_nybzdgd3",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "DCF #1: Waste Management (WM)",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_v7nujh",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.88,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Analysis",
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": 1654692584,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1654689319,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://docs.google.com/spreadsheets/d/1wTaLVChUTW7l_-1eMn5JcirG7Mjg8dbyyd_gT85FkPU/edit?usp=sharing\"&gt;https://docs.google.com/spreadsheets/d/1wTaLVChUTW7l_-1eMn5JcirG7Mjg8dbyyd_gT85FkPU/edit?usp=sharing&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Hi all,&lt;/p&gt;\n\n&lt;p&gt;As my first DCF with the community, I&amp;#39;ll be writing about Waste Management.  Before I begin, I&amp;#39;d like to state my intentions with this post.&lt;/p&gt;\n\n&lt;p&gt;First, I am by no means a professional investor.  I do this for fun.  Do not make any decisions based on my work and please do your own due diligence.&lt;/p&gt;\n\n&lt;p&gt;Second, while I am happy to do the heavy lifting, this is a community exercise.  I will post my initial findings, but I want the community to challenge my assumptions.  If I am wrong about something, please let me know.  Criticism is fine and encouraged.  &lt;/p&gt;\n\n&lt;p&gt;Since my intention is to produce a large number of these for the community, I won&amp;#39;t be digging too deep unless I see a compelling opportunity.  My goal is to get into the ballpark of a fair value as there is a sacrifice of quality in the name of quantity.  As I am not digging deep on most stocks, there is a greater chance that my assumptions are not fair (though if I&amp;#39;m not looking further into a company, it&amp;#39;s typically because I believe the difference between my initial valuation and an accurate valuation is too great and my time would be better spent elsewhere).  &lt;/p&gt;\n\n&lt;p&gt;If I see an opportunity that is interesting, I will spend a much greater amount of time on the stock and will stop producing daily DCFs for a while.&lt;/p&gt;\n\n&lt;p&gt;The above points will be listed with every post.&lt;/p&gt;\n\n&lt;p&gt;As for the DCF, I produce it using a 10 year history of a company&amp;#39;s income statements.  I will assume an interest rate of 2% and make my discount rate assumption based on recent debt offerings by the company.  I may need to increase the interest rate in the future, but I will continue using 2% for the time being.  I also look for irregularities and points of possible concern in the balance sheet.  Within the Cash flow statement, I use it when making an investment decision, but it does not come into play within my DCF.&lt;/p&gt;\n\n&lt;p&gt;Without further adieu, here we go.&lt;/p&gt;\n\n&lt;p&gt;Waste Management is a provider of waste management environmental services including: Collection, Landfill, Transfer, Recycling and Other lines of business.  They trade on the NYSE at a SP of $159.8.  They have a Mkt Cap of $66B.  Based on my initial DCF for WM, they are overvalued by more than 100%.  As such, I have limited my review to 10 years of income statements, one year of press releases, and the 2021 annual report.  Had WM seemed more compelling, there are many more details that I&amp;#39;d want to investigate which would require reading additional reports, reviewing earnings calls, investigating management, looking at publicly available employee feedback, etc, but alas, this is a pretty brief and simplified DCF so that I can spend tomorrow looking at another company that I hope will provide a more interesting story.&lt;/p&gt;\n\n&lt;p&gt;Attached below is a DCF for WM:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://docs.google.com/spreadsheets/d/1wTaLVChUTW7l_-1eMn5JcirG7Mjg8dbyyd_gT85FkPU/edit?usp=sharing\"&gt;https://docs.google.com/spreadsheets/d/1wTaLVChUTW7l_-1eMn5JcirG7Mjg8dbyyd_gT85FkPU/edit?usp=sharing&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Within, we see that WM can expect long term growth of roughly 3.1%.  COGS generally trails revenue by .3%.  While this growth isn&amp;#39;t exceptional, it is fairly reasonable considering that the waste industry is both mature and stable.  The majority of revenue growth comes from their collection business rather than their disposal business, albeit neither number is overly exciting.&lt;/p&gt;\n\n&lt;p&gt;There is limited opportunity to drive revenue growth within the control of the company.  Revenue can grow through acquisition, higher commodity prices for recyclables, and more favourable terms with municipalities.  Acquisitions would need to be evaluated on a case by case basis.  In the case of commodities, given their cyclical nature, we can not expect this to provide long-term growth, but rather to come in short 2 to 3 year bursts. &lt;/p&gt;\n\n&lt;p&gt;Share repurchasing will continue in a limited capacity with an average buyback rate of 1%.  This honestly seems like a good use of excess cash given their limited opportunities for growth. They could pay down debt, but their debt terms are very favourable, thus there is no rush.&lt;/p&gt;\n\n&lt;p&gt;Some closing remarks about WM:&lt;/p&gt;\n\n&lt;p&gt;I suspect WM is overvalued because it is a strong and reliable business.  The company has a tremendous moat and incredibly steady, predictable growth.  These traits can lead to a company trading at a premium.  I am not a buyer at this price and given its industry and reputation, I suspect it will never get to a price where I am a buyer.  With that said, if you have this stock in your portfolio, are not trying to chase higher returns, and you plan on holding it until you retire, this truly seems like a &amp;quot;set it and forget it&amp;quot; stock that will allow you to sleep comfortably at night.  This stock seems fine in the long-run, but is not of interest to me at this time.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;If you want to propose another stock, please use the following thread:\n&lt;a href=\"https://www.reddit.com/r/stocks/comments/v6svtc/give_me_a_company_and_i_will_make_a_discounted/\"&gt;https://www.reddit.com/r/stocks/comments/v6svtc/give_me_a_company_and_i_will_make_a_discounted/&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Please read the criteria in that thread.  I will not be reviewing Gamestop.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "1235582c-6848-11eb-96e8-0e132357f477",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#d6890a",
  "id": "v7nujh",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "DCF_Stock_Analysis",
  "discussion_type": null,
  "num_comments": 15,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/v7nujh/dcf_1_waste_management_wm/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/v7nujh/dcf_1_waste_management_wm/",
  "subreddit_subscribers": 4148703,
  "created_utc": 1654700263,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1654689319,
  "the_new_excerpt": "https://docs.google.com/spreadsheets/d/1wTaLVChUTW7l_-1eMn5JcirG7Mjg8dbyyd_gT85FkPU/edit?usp=sharing\n\n--------------------------------------------------------------------------------\n\nHi all,\n\nAs my first DCF with the community, I'll be writing about Waste Management.\nBefore I begin, I'd like to…"
}