{
  "author": "Successful_Craft3076",
  "original_created_utc": 1658949215,
  "title": "Feds just rised interest rate by another 75 point. what does it mean for crypto?",
  "created_utc": 1659036747,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So what everyone was expecting happened about an hour ago.\nHere are my thoughts:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Market was expecting 75 point so this, alone would not come as a surprise or shock. As a matter of fact as I am writing this market slowly going up. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Bank lending requirements are tightening and that process will accelerate. This mean less and less money for risky investments. Don&amp;#39;t know how much institutional investment gonna change tho. And we little guys are mostly out of cash already. So there is that. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;If second quarter numbers look grim (at least worst than everyone predicted)in addition to rate hike it might push the market down further. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Part of where market goes from here is same as stock market. it depends heavily on how well Feds can manage inflation. If fed rate hikes prove to be successful we might have better days ahead. If not...well it will not be only crypto which would go to doom spiral I suppose.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Next few hours/days will tell us where we stand. I would not buy until I see a nice dive which might never come. Who knows!&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;For now nothing new/game changing added to the picture. If situation keeps going like this I expect to see a relief rally.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/w9n9ih/feds_just_rised_interest_rate_by_another_75_point/",
  "subreddit": "CryptoCurrency",
  "id": "w9n9ih",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So what everyone was expecting happened about an hour ago. Here are my thoughts:\n\n 1. Market was expecting 75 point so this, alone would not come as a surprise or\n    shock. As a matter of fact as I am writing this market slowly going up.\n\n 2. Bank lending requirements are tightening and that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんなが期待していたことが、1時間前に起こったわけです。以下は私の感想です。\n\n 1. 市場は75ポイントを予想していたので、これだけでは驚きやショックはないだろう。\n    ショックはない。実のところ、この文章を書いている間にも、市場はゆっくりと上昇している。\n\n 2. 銀行の融資要件が厳しくなっているとその...",
      "title": "FRBは金利をさらに75ポイント引き上げたが、暗号にはどのような意味があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以大家期待的事情在一小时前发生了。以下是我的想法。\n\n 1. 市场预期75点，所以这一点不会让人感到惊讶，也不会让人感到意外。\n    震惊。事实上，在我写这篇文章的时候，市场正在缓慢上升。\n\n 2. 2.银行的贷款要求正在收紧，这...",
      "title": "美联储刚刚将利率又提高了75点。这对加密货币意味着什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以大家期待的事情在一小時前發生了。以下是我的想法。\n\n 1. 市場預期75點，所以這一點不會讓人感到驚訝，也不會讓人感到意外。\n    震驚。事實上，在我寫這篇文章的時候，市場正在緩慢上升。\n\n 2. 2.銀行的貸款要求正在收緊，這...",
      "title": "美聯儲剛剛將利率又提高了75點。這對加密貨幣意味着什麼？"
    }
  ]
}