{
  "author": "Djjv76533",
  "original_created_utc": 1626507954,
  "title": "How can I prove to my girlfriend’s dad the Holocaust existed?",
  "created_utc": 1626522772,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am currently on vacation with my girlfriend’s family and her dad has always been a bit extreme. For stories sake I will call him Bill. Bill is very intelligent and spends most of his time studying history in the Middle East. </p>\n\n<p>Tonight we checked into a new Airbnb and I found a stack of DVDs in the room I am staying in (sadly I have the pullout in the living room.) To wind down I put on the first DVD of a 6 part WWII documentary. Roughly 15 minutes in, Bill insists that I need to turn it off as it’s all American propaganda to pity Jews and to despise the German people. Bill quickly changes his mind and starts using it as a tool to teach me what really happened in WWII… </p>\n\n<p>Fast forward 2 hours of me being stuck in a room being lectured by Bill.</p>\n\n<p>According to Bill’s own research, America joined WWI because of the Balfour Declaration and the Jews claimed that they would be able to persuade the Americans to join the war if Britain promised them Palestine. Somewhere down the road the Jews were given Palestine and were partnered with the German democrats who agreed to the treaty of Versailles. Thus the difficulties and poverty in Germany following WWI was ultimately the Jews fault.</p>\n\n<p>Bill believes that the Jews were forced out of Germany during this time period leading up to WWII and flooded Turkey and the Middle East. Jews who remained worked in factories for the war. </p>\n\n<p>Bill believes that footage we have of concentration camps were Hollywood’s attempt to rally American troops towards the war efforts and were staged. The bodies of skeletons were those who suffered of typhoid fever or of homosexuals who were disposed of (who are equally as manipulative as the Jews.) Numbers and tattoos on the bodies were for sick count to research and study typhoid. </p>\n\n<p>Bill also believes that testimonies aren’t usually factual and were paid off. What historical evidence do we have that is irrefutable and can help me properly keep my sanity? Sources and documents (preferably from German record during the time period) would be greatly appreciated.</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/AskHistorians/comments/olzwa1/how_can_i_prove_to_my_girlfriends_dad_the/",
  "subreddit": "AskHistorians",
  "id": "olzwa1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am currently on vacation with my girlfriend’s family and her dad has always\nbeen a bit extreme. For stories sake I will call him Bill. Bill is very\nintelligent and spends most of his time studying history in the Middle East.\n\nTonight we checked into a new Airbnb and I found a stack of DVDs in the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、私はガールフレンドの家族と一緒に休暇を過ごしていますが、彼女の父親はいつも\nはちょっと過激なんですよね。話の都合上、彼をビルと呼ぶことにします。ビルはとても知的で\nビルはとても聡明で、ほとんどの時間を中東の歴史の勉強に費やしています。\n\n今夜、私たちは新しいAirbnbにチェックインしましたが、私はDVDの束を見つけました...",
      "title": "恋人の父親にホロコーストが存在したことを証明するにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我目前正在和我女朋友的家人一起度假，她的父亲总是\n她的父亲总是有点极端。为了讲故事，我就叫他比尔。比尔非常\n聪明，大部分时间都在研究中东地区的历史。\n\n今晚我们住进了一家新的Airbnb，我在房间里发现了一叠DVD...",
      "title": "我怎样才能向我女朋友的爸爸证明大屠杀的存在？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我目前正在和我女朋友的家人一起度假，她的父親總是\n她的父親總是有點極端。爲了講故事，我就叫他比爾。比爾非常\n聰明，大部分時間都在研究中東地區的歷史。\n\n今晚我們住進了一家新的Airbnb，我在房間裏發現了一疊DVD...",
      "title": "我怎樣才能向我女朋友的爸爸證明大屠殺的存在？"
    }
  ]
}