{
  "author": "Schanzenraute",
  "the_new_excerpt": "I understand that the formation process of galaxies isn't terribly well\nunderstood. From what I have read, galaxies including the Milky Way formed\npretty soon after the Big Bang (13-14 billion yrs ago), so - shouldn't we be\nable to have a peek at galaxies in the making when we look far enough out…",
  "original_created_utc": 1617376764,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我知道星系的形成过程并不是很清楚。\n明白了。从我读到的资料来看，包括银河系在内的星系都是这样形成的\n在大爆炸后不久（130亿-140亿年前），所以 - 我们不应该是。\n当我们看得足够远的时候，能够窥见正在形成的星系... ...",
      "title": "银河系的形成。我们在可观测宇宙的边缘看到了原星系吗?"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道星系的形成過程並不是很清楚。\n明白了。從我讀到的資料來看，包括銀河系在內的星系都是這樣形成的\n在大爆炸後不久（130億-140億年前），所以 - 我們不應該是。\n當我們看得足夠遠的時候，能夠窺見正在形成的星系... ...",
      "title": "銀河系的形成。我們在可觀測宇宙的邊緣看到了原星系嗎?"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "銀河の形成過程があまりよくわかっていないことは理解しています。\n理解されていません。私が読んだ限りでは、天の川銀河をはじめとする銀河の形成は\nビッグバンの直後（130〜140億年前）に形成されたと聞いています。\n遠くを見れば、できかけの銀河を覗き見ることができるのでは......。",
      "title": "銀河の形成。観測可能な宇宙の端には原始銀河が存在するのか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "銀河の形成過程があまりよくわかっていないことは理解しています。\n理解されていません。私が読んだ限りでは、天の川銀河をはじめとする銀河の形成は\nビッグバンの直後（130〜140億年前）に形成されたと聞いています。\n遠くを見れば、できかけの銀河を覗き見ることができるのでは......。",
      "title": "銀河の形成。観測可能な宇宙の端には原始銀河が存在するのか？"
    }
  ],
  "title": "Galaxy formation: Do we see proto-galaxies at the edge of the observable universe?",
  "created_utc": 1617424602,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that the formation process of galaxies isn&#39;t terribly well understood. From what I have read, galaxies including the Milky Way formed pretty soon after the Big Bang (13-14 billion yrs ago), so - shouldn&#39;t we be able to have a peek at galaxies in the making when we look far enough out into space? As far as I know we already observe galaxies 13 BLY away. Are these in any way more &quot;primordial&quot; than our own Milky Way?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askscience/comments/mimgzx/galaxy_formation_do_we_see_protogalaxies_at_the/",
  "subreddit": "askscience",
  "id": "mimgzx",
  "is_self": true,
  "media": null,
  "is_video": false
}