{
  "author": "yankthrough",
  "original_created_utc": 1633338683,
  "title": "Top 3 jokes get 1,000 sats each",
  "created_utc": 1633357881,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>No memes this time, text only. Has to be Bitcoin related, something within the scope of this sub. Converting existing jokes into Bitcoin jokes is allowed. You can write as many jokes as you want, you can even win all 3,000 sats if you have the top 3, but make each joke a unique reply. </p>\n\n<p>I will let the community decide the top 2 by votes and I&#39;ll pick the last 1. Sats sent via lntip here on reddit. Contest is over in 12 hours. Runners up may get a couple sats their way as well.</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/q11tlo/top_3_jokes_get_1000_sats_each/",
  "subreddit": "Bitcoin",
  "id": "q11tlo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "No memes this time, text only. Has to be Bitcoin related, something within the\nscope of this sub. Converting existing jokes into Bitcoin jokes is allowed. You\ncan write as many jokes as you want, you can even win all 3,000 sats if you have\nthe top 3, but make each joke a unique reply.\n\nI will let…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回はミームはなく、テキストのみです。ビットコインに関連した、このサブの範囲内のものでなければなりません。\nこのサブの範囲内のものでなければなりません。既存のジョークをBitcoinジョークに変換することは可能です。あなたは\n好きなだけジョークを書いてもいいし、上位3位までに入れば3,000人全員に勝つこともできます。\nしかし、それぞれのジョークはユニークな返答にしてください。\n\n私は...",
      "title": "トップ3のジョークには、それぞれ1,000サットの賞金が与えられます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这次没有备忘录，只有文字。必须是与比特币有关的，在这个主题范围内的东西。\n的范围内。将现有的笑话转换成比特币的笑话是允许的。你\n你可以写任何你想写的笑话，如果你有前三名，你甚至可以赢得所有的3000个笑话。\n前三名，但是每个笑话都要有独特的答案。\n\n我将让...",
      "title": "排名前三的笑话各获得1000分"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這次沒有備忘錄，只有文字。必須是與比特幣有關的，在這個主題範圍內的東西。\n的範圍內。將現有的笑話轉換成比特幣的笑話是允許的。你\n你可以寫任何你想寫的笑話，如果你有前三名，你甚至可以贏得所有的3000個笑話。\n前三名，但是每個笑話都要有獨特的答案。\n\n我將讓...",
      "title": "排名前三的笑話各獲得1000分"
    }
  ]
}