{
  "author": "nobjos",
  "original_created_utc": 1634653668,
  "title": "How to consistently make returns from the Crypto market! : I analyzed ~2,000 cryptocurrencies over the past 8 years to create an effective DCA strategy for the crypto market",
  "created_utc": 1634664639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We have all come across news articles that discuss people who made insane gains in the crypto market like the <a href=\"https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m\">trader who turned $17 into ~6MM</a> or <a href=\"https://www.cnbc.com/2021/07/06/millennial-dogecoin-millionaire-on-being-paid-in-dogecoin.html\">Dogecoin millionaires</a> who invested a considerable amount right at the beginning of the rally.</p>\n\n<p>But the problem with these strategies is that it’s heavily based on luck and for every winner, there would be hundreds of folks who lost all of their investment [1]. While it’s great to be that guy who made a 1,00,000% gain in an investment, the realistic chances of that happening is slim to none.</p>\n\n<p>So in my first-ever analysis covering the crypto market, we are diving deep into the data to create a strategy that will give us consistent returns year over year while trying to minimize the downside.</p>\n\n<p><a href=\"https://preview.redd.it/yy9ggzm81fu71.png?width=1728&amp;format=png&amp;auto=webp&amp;s=7311d222188eba337e5532be8ea09a166225d746\"> </a></p>\n\n<p><strong>Data</strong></p>\n\n<p>There were a number of sources available for cryptocurrency data, but many of these sources had issues - They were either expensive, incomplete, or required separate signups. After extensive testing, I decided on a single source that solved many of these issues.</p>\n\n<p>The data for this analysis was extracted using the <a href=\"https://www.coingecko.com/\">CoinGecko API</a> which had aggregated historical data across 317 different exchanges related to price, market capital, and the trading volume for thousands of cryptocurrencies. In most cases, the data was available even up to the time that the cryptocurrencies were initially listed!</p>\n\n<p>All the data used in the analysis is shared as a Google sheet at the end.</p>\n\n<p><a href=\"https://preview.redd.it/po5nxrq81fu71.png?width=1728&amp;format=png&amp;auto=webp&amp;s=06a90c560dd42691def6131829a8c74a36e05f66\">https://preview.redd.it/po5nxrq81fu71.png?width=1728&amp;format=png&amp;auto=webp&amp;s=06a90c560dd42691def6131829a8c74a36e05f66</a></p>\n\n<p><strong>Results</strong> </p>\n\n<p><a href=\"https://preview.redd.it/ultgwwqa1fu71.png?width=623&amp;format=png&amp;auto=webp&amp;s=ddc9b8361d413045f9b90cd92a055e38fd3e3a81\">https://preview.redd.it/ultgwwqa1fu71.png?width=623&amp;format=png&amp;auto=webp&amp;s=ddc9b8361d413045f9b90cd92a055e38fd3e3a81</a></p>\n\n<p>Daily price and volume data for 1,985 cryptos were collected with data going back up to 2013 for some currencies. If you compare the first listing price on the exchange and the latest available price, only 40% of them have gained in value. </p>\n\n<p><a href=\"https://preview.redd.it/ijtwk4sb1fu71.png?width=739&amp;format=png&amp;auto=webp&amp;s=08bf6014e8ad84dd9a860c4924bceb7feef9cfb6\"> </a></p>\n\n<p>Even though you have slightly less than a coin toss probability of picking a winner, the average gain across the currencies was a whopping 3048%! What is more interesting is the impact of outliers. If you just remove the top 1% of the currencies, the returns drop down to 641% and if you remove top 5% of the currencies, your return would only be slightly higher than the S&amp;P500!</p>\n\n<p>Now the challenge becomes a question of how to make sure that you are consistently picking the top currencies that will gain in value over time. While you can try your luck at picking something that will end up in the top 1% and then get featured in the news for insane gains, the chances that you will pull it off are very low.</p>\n\n<p>What I have tried to create is a Dollar Cost Averaging strategy for the Crypto market based on the popularity/trading volume of the Currency. Before we jump into the exact strategy, here is a visualization of how the Crypto market has changed over the years.</p>\n\n<p><a href=\"https://i.redd.it/x3prca6d1fu71.gif\"> </a></p>\n\n<p><em>In case the visualization is not loading in Reddit,</em> <a href=\"https://public.flourish.studio/visualisation/7551046/\"><em>check it out here</em></a><em>.</em></p>\n\n<p>As you can see there has been a lot of turnover over the years with a few currencies maintaining their top 10 positions.</p>\n\n<p>The strategy I have created is simple. On the 1st of every month, you check what the top-10 [2] traded currencies of the last month were and invest in them. For example, if I am investing $100 on 1st Nov 2021, I will check what were the most traded (i.e popular) cryptos in the past month (in this case Oct&#39;21) and then invest in that. By following this strategy, you are not jumping into any investment. You are just methodologically checking the popular cryptos at the beginning of the month and investing in them. </p>\n\n<p>The underlying principle was to create a straightforward strategy that can be followed by anyone without luck coming into the factor. Now there would be two ways to invest in the top 10 currencies. You can either split your investment equally across the cryptocurrencies or split it in the proportion to the traded volume.</p>\n\n<p><a href=\"https://preview.redd.it/8z1psb4q1fu71.png?width=692&amp;format=png&amp;auto=webp&amp;s=b43708b7921772b4c27afa6655ce5e1067b971fe\"> </a></p>\n\n<p>Both strategies give amazing returns but equally splitting your investment produces almost double the weighted average split. This is mainly due to these reasons:</p>\n\n<ul>\n<li>As we saw from the trading volume chart, the volume is <strong><em>extremely skewed</em></strong> towards Bitcoin. So if you do the weighted average split, most of your investment will go into Bitcoin and your returns would be pegged majorly to Bitcoin.</li>\n<li>By doing an equal split, you are taking on much higher risk (as you are investing in relatively smaller cryptos) and you are being rewarded for the extra risk you took. [3]</li>\n</ul>\n\n<p>But now you would be wondering whether this is applicable only for those who started in 2014. Sure, they would have made money in the crypto market.</p>\n\n<p>What if I had started late? Would my returns be significant enough to follow this strategy?</p>\n\n<p><a href=\"https://preview.redd.it/djmu593r1fu71.png?width=911&amp;format=png&amp;auto=webp&amp;s=cbaae2139fc3fcc8d41f5d9050ebc692e64e3a90\">https://preview.redd.it/djmu593r1fu71.png?width=911&amp;format=png&amp;auto=webp&amp;s=cbaae2139fc3fcc8d41f5d9050ebc692e64e3a90</a></p>\n\n<p>This chart should put all the apprehensions to rest. No matter which year we had started, by following the DCA strategy, we would have made a significant return on our investment [4]. </p>\n\n<p><a href=\"https://preview.redd.it/z3y73in81fu71.png?width=1728&amp;format=png&amp;auto=webp&amp;s=ad5e60b20c42f2c2d162ff364c59e4482536f174\"> </a></p>\n\n<p><strong>Limitations</strong></p>\n\n<p>This analysis comes with its own limitations.</p>\n\n<ul>\n<li>We are relying on the data produced by one company (CoinGecko). While they track more than 300 exchanges, we might have missed out on some other popular cryptos that were not traded in the exchanges tracked by CoinGecko</li>\n<li>There are <a href=\"https://www.coinopsy.com/dead-coins/#other\">more than 2200 dead coins</a> - but the majority of them were not listed on any big exchange (due to which we won&#39;t have data) and if particular crypto became popular (like top 100 in trading volume) at any time, the chances of them dying out completely is very low. (In the 2,000 cryptos we have data for, from 2013, only 3% became inactive completely)</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/lq950go81fu71.png?width=1728&amp;format=png&amp;auto=webp&amp;s=b363b8d322a5ebcc66e110e63c0c2c974e702f8e\"> </a></p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>While there are <a href=\"https://www.bitwiseinvestments.com/funds/Bitwise-10\">index funds/tokenized ETF’</a>s available for Cryptos, they usually charge an exorbitant expense ratio (Bitwise Index fund charges a whopping 2.5% [5]) and have not been around for long enough to reliably trust them with your funds.</p>\n\n<p>It certainly is alluring to be that guy who can now retire after <a href=\"https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m\">making a $17 investment</a> in the right cryptocurrency. But then again, you have similar chances of winning the lottery.</p>\n\n<p>Certainly, you can invest in one currency if you completely believe in its long-term prospects and viability. For the rest of us who might not have the time and capabilities to research and invest in individual cryptocurrencies, I guess the 10,000%+ return on your invested amount is plenty good enough!</p>\n\n<p><a href=\"https://preview.redd.it/nc9u42p81fu71.png?width=1728&amp;format=png&amp;auto=webp&amp;s=7540e84037c5567335dd5e417a94d13287213fdd\"> </a></p>\n\n<p>Price, Volume, and Market cap data collected for all Cryptos: <a href=\"https://drive.google.com/file/d/11jtsghd_XcxIZgOFDUFkGYAe1vzvwXSz/view?usp=sharing\">here</a> (It’s around 100MB in size and has ~1.2MM rows)</p>\n\n<p>Analysis Sheet: <a href=\"https://docs.google.com/spreadsheets/d/1mILuQILazut6ejI2zROTV_zW9Bngl0TOagzvAamQlus/edit?usp=sharing\">here</a></p>\n\n<p><a href=\"https://preview.redd.it/f2litlp81fu71.png?width=1728&amp;format=png&amp;auto=webp&amp;s=78b2c3927d8222dfb4f6cf21877b9c123c791915\"> </a></p>\n\n<p><strong>Footnotes</strong></p>\n\n<p>[1] As we found later in the analysis, approximately 60% of the listed currency lost value over the tracking period.</p>\n\n<p>[2] I took top-10 as it felt like a realistic number of cryptos to keep track of. The results would be different if you choose the top 100 or top 5. If you are planning on following this strategy, please optimize the number of cryptos based on your risk profile and the time you can invest in this exercise.</p>\n\n<p>[3] Do note that extra returns are not always guaranteed just because you are taking a higher risk. There is a concept of Beta in stock markets. Beta measures the volatility of stocks. Investing in stocks having higher volatility (say +3 or +4) will net you higher returns when the market is going up but if the market turns, your losses also will be proportionally higher when compared to stable stocks.</p>\n\n<p>[4] Even if you had started your investment at the peak of the 2016-17 rally, you would have made a 629% return to date.</p>\n\n<p>[5] The below chart from Vanguard shows the impact of 2% fees over a 25 year period for a $100K investment.</p>\n\n<p><a href=\"https://preview.redd.it/rwthymku1fu71.png?width=286&amp;format=png&amp;auto=webp&amp;s=9a0d3325c78530b9ea94acf7e339e7c5f50d58f5\">https://preview.redd.it/rwthymku1fu71.png?width=286&amp;format=png&amp;auto=webp&amp;s=9a0d3325c78530b9ea94acf7e339e7c5f50d58f5</a></p>\n\n<p><em>Disclaimer: I am not a financial advisor. Please do your own research before investing.</em></p>\n</div><!-- SC_ON -->",
  "score": 360,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/_mpiUuiOXhnz9p8VcZud5GjoHJqg_sXXYcmvgjssvwY.jpg?auto=webp&s=33517433fb7e03812595f3622c5a05bb39a78432",
          "width": 720,
          "height": 378
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/_mpiUuiOXhnz9p8VcZud5GjoHJqg_sXXYcmvgjssvwY.jpg?width=108&crop=smart&auto=webp&s=06b9f1af48b52e6db7928bff5b01b85fd085ecea",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/_mpiUuiOXhnz9p8VcZud5GjoHJqg_sXXYcmvgjssvwY.jpg?width=216&crop=smart&auto=webp&s=3770ae4d8e6c0a5c2d6e71a6611ac68ccf423cb8",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/_mpiUuiOXhnz9p8VcZud5GjoHJqg_sXXYcmvgjssvwY.jpg?width=320&crop=smart&auto=webp&s=8b4920fc39276148fced4e04c09abef54a51d904",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/_mpiUuiOXhnz9p8VcZud5GjoHJqg_sXXYcmvgjssvwY.jpg?width=640&crop=smart&auto=webp&s=14dfa743a046052ad4fbaa5787e6adf3dbc5b5ed",
            "width": 640,
            "height": 336
          }
        ],
        "variants": {},
        "id": "A1pdBAlPqEiDh8ELofPwh6M8vsrLt7DE-dDh2hfCEUk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qbcneq/how_to_consistently_make_returns_from_the_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qbcneq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We have all come across news articles that discuss people who made insane gains\nin the crypto market like the trader who turned $17 into ~6MM\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\nor Dogecoin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "莫大な利益を得た人々についてのニュース記事を目にしたことがあると思います。\n17ドルを6百万ドルにしたトレーダーのように、暗号市場で非常に大きな利益を上げた人たちのニュース記事を目にしたことがあるでしょう。\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\nまたはDogecoin...",
      "title": "暗号市場から一貫してリターンを得る方法とは！？: 私は過去8年間で~2,000の暗号を分析し、暗号市場に効果的なDCA戦略を作りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都遇到过一些新闻文章，讨论那些在加密货币市场上取得疯狂收益的人\n诸如将17美元变成约600万美元的交易员。\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\n或Dogecoin...",
      "title": "如何从加密货币市场持续获得回报! ：我在过去8年中分析了~2,000种加密货币，为加密货币市场创建了有效的DCA策略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都遇到過一些新聞文章，討論那些在加密貨幣市場上取得瘋狂收益的人\n諸如將17美元變成約600萬美元的交易員。\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\n或Dogecoin...",
      "title": "如何從加密貨幣市場持續獲得回報! ：我在過去8年中分析了~2,000種加密貨幣，爲加密貨幣市場創建了有效的DCA策略"
    }
  ]
}