{
  "author": "Alaskan-Haida",
  "original_created_utc": 1657609651,
  "title": "Americans that left the United States and never came back, was it worth it?",
  "created_utc": 1657635974,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m at the point where I can’t stand it here, I know there’s hatred and crime in every corner of the world. I’m fine with that as I try to keep a positive outlook regardless. But the backwards healthcare system, the failure of our justice system, the bickering between our politicians like it’s a episode of WWE Raw, the fact that I can’t enjoy a movie, going shopping for groceries or clothes without the fear of getting shot and killed at any moment (Im sure those who got shot and killed didn’t think they’d get killed the day they passed for those who think I’m too paranoid), It makes leaving the US sound worth it and I wanna know for those who did leave, was it worth it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 120,
  "permalink": "/r/NoStupidQuestions/comments/vx50re/americans_that_left_the_united_states_and_never/",
  "subreddit": "NoStupidQuestions",
  "id": "vx50re",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m at the point where I can’t stand it here, I know there’s hatred and crime in\nevery corner of the world. I’m fine with that as I try to keep a positive\noutlook regardless. But the backwards healthcare system, the failure of our\njustice system, the bickering between our politicians like it’s a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "に憎しみや犯罪があるのは知っているが、ここでは耐えられないというところだ。\nっています。私は前向きに考えようと思っているので、それでいいんです。\nを持ち続けようと思っているからです。しかし、後進的な医療制度、司法制度の失敗、そして\n政治家同士のいがみ合いは、まるで...",
      "title": "米国を離れ、二度と戻ってこなかったアメリカ人、その価値はあったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经到了无法忍受这里的地步了，我知道这里有仇恨和犯罪。\n世界上的每个角落都有仇恨和犯罪。我对此无所谓，因为我试图保持一个积极的\n观点，我无所谓。但是，落后的医疗系统，我们的司法系统的失败\n司法系统的失败，我们的政治家之间的争吵，就像一个...",
      "title": "离开美国后再也没有回来的美国人，这样做值得吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經到了無法忍受這裏的地步了，我知道這裏有仇恨和犯罪。\n世界上的每個角落都有仇恨和犯罪。我對此無所謂，因爲我試圖保持一個積極的\n觀點，我無所謂。但是，落後的醫療系統，我們的司法系統的失敗\n司法系統的失敗，我們的政治家之間的爭吵，就像一個...",
      "title": "離開美國後再也沒有回來的美國人，這樣做值得嗎？"
    }
  ]
}