{
  "author": "PompeiiAcademyYT",
  "the_new_excerpt": "We have definitely all seen the power of truly innovative companies with\nexcellent vision. This is especially true if we as investors are able to\nidentify these companies before the market at large does. Take Tesla, for\nexample. After a decade of market doubt, the stock nearly 10x this year…",
  "original_created_utc": 1612828462,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我们肯定都见识到了真正的创新企业的力量，有\n优秀的愿景。尤其是我们作为投资者，如果能够做到\n在整个市场之前识别这些公司。以特斯拉为例\n例。经历了十年的市场质疑，该股今年近10倍...",
      "title": "尽早发现创新并获得回报"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們肯定都見識到了真正的創新企業的力量，有\n優秀的願景。尤其是我們作爲投資者，如果能夠做到\n在整個市場之前識別這些公司。以特斯拉爲例\n例。經歷了十年的市場質疑，該股今年近10倍...",
      "title": "儘早發現創新並獲得回報"
    }
  ],
  "title": "Finding Innovation Early and Reaping the Rewards",
  "created_utc": 1612861639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We have definitely all seen the power of truly innovative companies with excellent vision. This is especially true if we as investors are able to identify these companies before the market at large does. Take Tesla, for example. After a decade of market doubt, the stock nearly 10x this year alone. This is not a fluke, as Tesla is not (entirely) driven by hype. Their long term goal, execution, and product is second to none, and they are being rewarded.</p>\n\n<p>Today, there are more areas affected by innovation than ever before. Industries converge and solve problems exponentially faster as time goes on. Over time, innovation will displace the status quo, increase efficiencies, and gain significant market share. We as investors can place our money with conviction knowing that, no matter where the economy is short term, disruption is inevitable. It is up to us to recognize the opportunities and invest in disruption. By doing so, we can position ourselves at society’s cutting edge, reaping the rewards along the way.</p>\n\n<p>But what drives innovation, and how can we find it early? While every situation is unique, I believe two key factors to keep in mind are <strong>Leadership</strong> and <strong>Mission.</strong></p>\n\n<p>Before we analyze a company from the lens of innovation, we first have to be sure we will derive value from our research. Go through the following checklist:</p>\n\n<ul>\n<li>Is the company something I understand, or something I can easily learn about?</li>\n<li>What is my personal feeling of confidence with my research? And finally,</li>\n<li>Write down what the company does and the problem they try to solve in less than one page.</li>\n</ul>\n\n<p>Chances are if you can&#39;t do that, you need to reevaluate 1 and 2.  This is fundamental when placing money in any investment, but a step many overlook completely. Ensure you have a firm understanding of the company and a justification about why you allocate your money towards it. This is especially important with highly innovative companies in their early stages of growth, as the market may not reflect its future value. Now that you are confident in your own knowledge, you can consider assessing the company for disruption.</p>\n\n<p><strong>Leadership</strong></p>\n\n<p>A company&#39;s leader has a profound effect on what can be accomplished. Not only do they steer the  focus and the allocation of resources, but they have a dramatic effect on a company’s most valuable asset: human capital. Human capital, which comprises the habits, knowledge, creativity, social and personality attributes a workforce possesses, is the defining factor in a company&#39;s success, and the larger the aspirations, the more vital it becomes. But how does a leader communicate their vision and attract the best employees? Ones that want challenges, to solve hard problems, and risk failure? Charisma.</p>\n\n<p>In the book The Charisma Myth, Olivia Fox Cabane outlines the four main charisma styles—focus, visionary, kindness and authority.  Focus charismatics make people feel heard, respected and understood.  Visionary charismatics move people with their passion, conviction and vision.  Kindness charismatics emit warmth and show acceptance. Authority charismatics project great power and confidence, forcing those around them to obey.</p>\n\n<p>What type of charisma does the leader of the company you are evaluating have, and does it align with the company mission? In order to find this, watch all the interviews, press releases and other media that feature the CEO. Pay attention to their attitude towards doubt and competition on social media. Furthermore, look at the company&#39;s past goals, have they kept promises and attracted others that share their mission? Make sure to check employee reviews, determine whether employees are happy and believe in the company.</p>\n\n<p><strong>Mission</strong></p>\n\n<p>The next place you should look when evaluating a company is their mission. Does the company solve a profound problem, or reimagine a now complacent industry? An article that I find useful to reference when asking this question is “<a href=\"https://www.ycombinator.com/rfs/\">Requests for Startups</a>” by Y-Combinator. As you may imagine, these requests touch on some of the most widespread and complex problems we face, such as climate change, education, and healthcare.  Note that this is not an exhaustive list, but a good place to start.</p>\n\n<p>Do they dare to solve a problem thought too big, too far away, or too unprofitable? I would argue that with the right leadership and human capital, any problem of this type is solvable, and faster than we may imagine. Progress is not linear. This is because of Wright’s Law, which describes how progress increases with experience. It states that the cost of each unit produced decreases as a function of the cumulative number of units produced.  Think of the television, batteries, or cellphones. When we evaluate a company, this exponential growth may not be immediately intuitive, but is incredibly powerful nonetheless.</p>\n\n<p>While we should be careful not to be blindly speculative, looking for charismatic, driven leaders solving our planet&#39;s most profound problems will pay off greatly as an investor.</p>\n\n<p>This is not an exhaustive guide, but a great place to start.  Let me know what you think or if I missed anything</p>\n</div><!-- SC_ON -->",
  "score": 71,
  "permalink": "/r/investing/comments/lfphd4/finding_innovation_early_and_reaping_the_rewards/",
  "subreddit": "investing",
  "id": "lfphd4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199873
}