{
  "author": "Stock-Bee-9522",
  "original_created_utc": 1638491698,
  "title": "Does anyone else washes their hands and change into house clothes when they get home?",
  "created_utc": 1638540897,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve always done this since I was little(despite no one else in my household doing it), I would always come and wash my hands, change clothes before getting in bed. I have never come home and lay down on my bed with the clothes I wore at school or going out. I just think it’s gross that people would be comfortable walking in their house with shoes on, not washing their hands first, and just not changing their clothes prior to sitting or laying down. I’ve seen it with my non-Asian friends all the time when I would come over to their house. I thought I was weird, until my ex-Girlfriend(non-Asian btw) lived with me and she pretty much did the same hygienic practice as I did. I don’t understand, can someone explain?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/r7lq0w/does_anyone_else_washes_their_hands_and_change/",
  "subreddit": "NoStupidQuestions",
  "id": "r7lq0w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve always done this since I was little(despite no one else in my household\ndoing it), I would always come and wash my hands, change clothes before getting\nin bed. I have never come home and lay down on my bed with the clothes I wore at\nschool or going out. I just think it’s gross that people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "小さい頃からずっとやっていたことです（家族の中で誰もやっていないのに）。\nいつも手を洗い、服を着替えてから寝ていました。\nベッドで 家に帰ってきてから、その時の服のままベッドに横になったことは一度もありません。\n学校や外出先で ただ、気持ち悪いと思うのは、人が...",
      "title": "帰宅後、手を洗って家着に着替える人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从小就这样做（尽管我家里没有其他人做）。\n我总是来洗手，换衣服，然后再上床。\n在床上。我从来没有回到家，躺在床上，穿着我在学校穿的衣服。\n学校或外出时穿的衣服。我只是觉得人们这样做很恶心...",
      "title": "还有人在回家后洗手并换上家居服吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從小就這樣做（儘管我家裏沒有其他人做）。\n我總是來洗手，換衣服，然後再上牀。\n在牀上。我從來沒有回到家，躺在牀上，穿着我在學校穿的衣服。\n學校或外出時穿的衣服。我只是覺得人們這樣做很噁心...",
      "title": "還有人在回家後洗手並換上家居服嗎？"
    }
  ]
}