{
  "author": "orgasmic_protoplasm",
  "the_new_excerpt": "When I say practically nonexistent, I mean of course it still exists if you’re\ndedicated enough to search for it, but the only people who seem to be regularly\nreleasing new rock music are people who’ve been at it for longer than I’ve been\nalive, and you’re probably not going to hear their works…",
  "original_created_utc": 1610986109,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当我说几乎不存在，我的意思是，当然，它仍然存在，如果你是。\n专注于搜索它，但唯一的人似乎是经常的\n发行新的摇滚音乐的人谁一直在它比我长的时间\n活着，你可能不会听到他们的作品... ...",
      "title": "为什么摇滚乐从40年左右的流行文化中最突出的音乐类型之一，到2010年代几乎不存在？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我說幾乎不存在，我的意思是，當然，它仍然存在，如果你是。\n專注於搜索它，但唯一的人似乎是經常的\n發行新的搖滾音樂的人誰一直在它比我長的時間\n活着，你可能不會聽到他們的作品... ...",
      "title": "爲什麼搖滾樂從40年左右的流行文化中最突出的音樂類型之一，到2010年代幾乎不存在？"
    }
  ],
  "title": "Why did rock music go from one of the most prominent musical genres in pop culture for around 40 years to practically nonexistent in the 2010s?",
  "created_utc": 1611008281,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I say practically nonexistent, I mean of course it still exists if you’re dedicated enough to search for it, but the only people who seem to be regularly releasing new rock music are people who’ve been at it for longer than I’ve been alive, and you’re probably not going to hear their works unless you specifically seek it out. I know it’s kind of an overused thing to say, but it’s true: if you turn on the radio today you’ll hear almost exclusively rap and pop, maybe EDM if you’re lucky, probably no rock at all unless you’re on a classic rock station. Contrast that to the 1960s-90s, and even the 2000s, it was played everywhere, constantly. I mean countless songs were written specifically about listening to rock music on the radio. What was the big change in the last 10 years specifically that has made rock start to go the way of the dodo?</p>\n</div><!-- SC_ON -->",
  "score": 135,
  "permalink": "/r/NoStupidQuestions/comments/kzxk02/why_did_rock_music_go_from_one_of_the_most/",
  "subreddit": "NoStupidQuestions",
  "id": "kzxk02",
  "is_self": true,
  "media": null,
  "is_video": false
}