{
  "author": "quietandproud",
  "original_created_utc": 1627809960,
  "title": "Would Columbus and his crew have died if America hadn't been there, or did they decide on a point at which they would abort the voyage?",
  "created_utc": 1627837017,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As far as I know Colombus expected to be able to circumnavigate the world and reach Asia because he (mistakenly) thought the globe was much smaller than most people (correctly) thought.</p>\n\n<p>If America hadn&#39;t been there, therefore, he would have failed on his mission of reaching Asia&#39;s on its Eastern coast. But would he just have gone on until they had run out of food and water, or were they planning on coming back if they hadn&#39;t found Asia within a certain amount of time?</p>\n\n<p>If they didn&#39;t, were the other captains and the crew aware of the risk involved on betting that the Earth was small enough to reach land before dying?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/ovp3wv/would_columbus_and_his_crew_have_died_if_america/",
  "subreddit": "AskHistorians",
  "id": "ovp3wv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As far as I know Colombus expected to be able to circumnavigate the world and\nreach Asia because he (mistakenly) thought the globe was much smaller than most\npeople (correctly) thought.\n\nIf America hadn't been there, therefore, he would have failed on his mission of\nreaching Asia's on its Eastern…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の知る限り、コロンブスは世界を一周してアジアに到達できると期待していたようです。\nコロンブスが世界を一周してアジアに到達できると期待したのは、地球が普通の人よりもずっと小さいと思っていたからです。\nコロンブスは世界を一周してアジアに到達できると期待していた。\n\nもしアメリカがなかったら、アジアの東方面に到達するという任務は失敗していただろう。\nアジアの東方面に到達するという任務は失敗していただろう...。",
      "title": "アメリカがなかったらコロンブスたちは死んでいたのか、それとも航海を中止するポイントを決めていたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，哥伦布期望能够环游世界并到达亚洲，因为他（错误地）认为地球比大多数人要小。\n因为他（错误地）认为地球要比大多数人（正确地）认为的小得多。\n人（正确）的想法。\n\n因此，如果美国不在那里，他的任务就会失败。\n抵达亚洲的东方......",
      "title": "如果没有美洲，哥伦布和他的船员会死吗？还是他们决定在某一点上放弃航行？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，哥倫布期望能夠環遊世界併到達亞洲，因爲他（錯誤地）認爲地球比大多數人要小。\n因爲他（錯誤地）認爲地球要比大多數人（正確地）認爲的小得多。\n人（正確）的想法。\n\n因此，如果美國不在那裏，他的任務就會失敗。\n抵達亞洲的東方......",
      "title": "如果沒有美洲，哥倫布和他的船員會死嗎？還是他們決定在某一點上放棄航行？"
    }
  ]
}