{
  "author": "IndustreeBaby",
  "original_created_utc": 1654601610,
  "title": "Why is it that the CIA interfered with South America so heavily for relatively benign progressive policies, but Europe was left pretty much completely untouched?",
  "created_utc": 1654613384,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My brother and I were talking about this the other day, and he suggested they were afraid of MI6, but I&amp;#39;m not so sure that would&amp;#39;ve been enough to keep them out of literally every country. Obviously the Soviet Union had the eastern block, but former Soviet nations don&amp;#39;t really have the policies I&amp;#39;m talking about.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 129,
  "permalink": "/r/AskHistorians/comments/v6t0u7/why_is_it_that_the_cia_interfered_with_south/",
  "subreddit": "AskHistorians",
  "id": "v6t0u7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My brother and I were talking about this the other day, and he suggested they\nwere afraid of MI6, but I'm not so sure that would've been enough to keep them\nout of literally every country. Obviously the Soviet Union had the eastern\nblock, but former Soviet nations don't really have the policies I'm…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、兄とこの話をしていて、兄は彼らがMI6を恐れているのではないかと言っていた。\nMI6を恐れていたようです。\nを防ぐのに十分だったとは思えません。明らかにソ連は東側ブロックを持っていました。\n旧ソ連諸国には政策がない...",
      "title": "CIAは比較的良心的な進歩的政策のために南米に大きく干渉したのに、ヨーロッパはほとんど手つかずだったのはなぜか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我哥哥和我有一天在谈论这个问题，他建议他们\n他认为他们害怕军情六处，但我不确定这是否足以让他们远离所有国家。\n阻止他们进入每个国家。显然，苏联有东部地区。\n但前苏联国家并没有我说的那种政策。",
      "title": "为什么中情局为了相对良性的进步政策对南美进行了如此大的干预，而欧洲却几乎完全没有被触动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我哥哥和我有一天在談論這個問題，他建議他們\n他認爲他們害怕軍情六處，但我不確定這是否足以讓他們遠離所有國家。\n阻止他們進入每個國家。顯然，蘇聯有東部地區。\n但前蘇聯國家並沒有我說的那種政策。",
      "title": "爲什麼中情局爲了相對良性的進步政策對南美進行了如此大的干預，而歐洲卻幾乎完全沒有被觸動？"
    }
  ]
}