{
  "author": "UnexperiencedIT",
  "original_created_utc": 1649143321,
  "title": "If \"burning\" is a greatest utility with coin/token you bought, chances are high that you probably invested in something with no future",
  "created_utc": 1649162296,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And probably if you want to hold a long term you will get rekt. Probably. Your decision.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;&lt;em&gt;We are going to burn 5% of our supply every 2 weeks&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;If this is the only thing developers of the project are forcing, targeting, then chances are high that you invested in a shitcoin.&lt;/p&gt;\n\n&lt;p&gt;Not only that, but sometimes you will see a massive 50% burn immediately after the launch.&lt;/p&gt;\n\n&lt;p&gt;They will talk about great burning of 50% like it is the best thing in the world and the only &lt;strong&gt;thing that matters in crypto.&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;With that they will also try to &lt;strong&gt;hide their whales messing around with % of the coin ownership&lt;/strong&gt; (&lt;em&gt;for example on BSC scan, if you have 10m tokens and supply is 100m tokens, they burn 50%, BSC scan will show you as the owner of  10% while truth is you own much more then that. It is because BSC count the burn address in the pool aswell)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even know why do we keep calling it &amp;quot;shitcoin&amp;quot; when most of them are &amp;quot;shitTOKENS&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Now I am not saying that you are not able to make money with it, its your call and your decisions, not all of them are a rugpull. Also some legit projects are burning coins, but that is not the main thing of their project.&lt;/p&gt;\n\n&lt;p&gt;If you plan to hold it long term, beware&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/twp9ed/if_burning_is_a_greatest_utility_with_cointoken/",
  "subreddit": "CryptoCurrency",
  "id": "twp9ed",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And probably if you want to hold a long term you will get rekt. Probably. Your\ndecision.\n\n\"We are going to burn 5% of our supply every 2 weeks\"\n\nIf this is the only thing developers of the project are forcing, targeting, then\nchances are high that you invested in a shitcoin.\n\nNot only that, but…"
}