{
  "author": "PARADlSE",
  "the_new_excerpt": "So my fiancée has been talking to her friend lately and she’s been going through\nsome issues with her husband, who apparently has been asking his coworkers for\nhelp with their bills because he’s put all of his paychecks into his brokerage.\n\nFor months, she has been wondering why her husband has been…",
  "original_created_utc": 1615136758,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我的未婚妻最近一直在和她的朋友聊天，她一直在经历。\n她的丈夫有一些问题，他显然一直在问他的同事，为\n帮助他们的账单，因为他把他所有的工资支票 到他的经纪公司。\n\n几个月来，她一直在想为什么她丈夫一直... ...",
      "title": "你们这些弱智中的哪一个把钱都扔到石头上，就快离婚了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我的未婚妻最近一直在和她的朋友聊天，她一直在經歷。\n她的丈夫有一些問題，他顯然一直在問他的同事，爲\n幫助他們的賬單，因爲他把他所有的工資支票 到他的經紀公司。\n\n幾個月來，她一直在想爲什麼她丈夫一直... ...",
      "title": "你們這些弱智中的哪一個把錢都扔到石頭上，就快離婚了？"
    }
  ],
  "title": "Which one of you retards is on the brink of divorce by tossing all of your money into stonks?",
  "created_utc": 1615149364,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my fiancée has been talking to her friend lately and she’s been going through some issues with her husband, who apparently has been asking his coworkers for help with their bills because he’s put all of his paychecks into his brokerage. </p>\n\n<p>For months, she has been wondering why her husband has been short on paying the bills until recently she has decided to check their joint bank account’s transactions. Sure enough this ape has withdrawn thousands of dollars they can’t afford to put into his RH account lmao. </p>\n\n<p>On top of that, she has also seen charges for Onlyfans too. </p>\n\n<p>Based off of what I’ve heard, it seems like it’s his first time investing. IMAGINE being such a dumb fuck you dump all of you and your wife’s money into stocks you don’t know shit about and into e-girls. </p>\n\n<p>If this retard is one of you guys, I applaud you on being at the bottom of the IQ scale and wish you the best of luck on your divorce.</p>\n</div><!-- SC_ON -->",
  "score": 17870,
  "permalink": "/r/wallstreetbets/comments/lzut0t/which_one_of_you_retards_is_on_the_brink_of/",
  "subreddit": "wallstreetbets",
  "id": "lzut0t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542583505
}