{
  "author": "hotdog-n-juicebox",
  "original_created_utc": 1636717589,
  "title": "I have health insurance for the first time in my life as a 30 year old and I don't know who to contact. How do I get to the point where I can see a doctor for things?",
  "created_utc": 1636736684,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve never been educated on how health insurance works. I grew up poor and in a messed up family. I&#39;ve been working on my independence for years and I&#39;m finally on an insurance plan and after years of hearing &quot;Just talk to your doctor&quot; I genuinely don&#39;t know what it means to &quot;have a doctor&quot;</p>\n\n<p>Do I just call a hospital and say &quot;I&#39;m new here&quot;? Do I have to ask my insurance to hook me up with one? Where do I begin, and can someone give me like... A rough overview of who to talk to? I have a bit of social anxieties so I have to be really prepared and confident to call up places like this.</p>\n\n<p>This isn&#39;t a request for medical advice, I&#39;m just really not sure how I get in contact with a doctor. I&#39;ve never been to one before.</p>\n\n<p>Edit: Thank you for all the responses, I read/am reading all of them even if I don&#39;t reapond. I greatly appreciate all of it, including anecdotes.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/qs9gr4/i_have_health_insurance_for_the_first_time_in_my/",
  "subreddit": "NoStupidQuestions",
  "id": "qs9gr4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've never been educated on how health insurance works. I grew up poor and in a\nmessed up family. I've been working on my independence for years and I'm finally\non an insurance plan and after years of hearing \"Just talk to your doctor\" I\ngenuinely don't know what it means to \"have a doctor\"\n\nDo I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は健康保険の仕組みについて教育を受けたことがありません。私は貧しい家庭で育ちました。\n混乱した家庭で育ちました。私は何年も前から自立のために努力してきましたが、ようやく\n何年も前から「お医者さんに相談してね」と言われ続けてきましたが、ようやく保険に入ることができました。\n純粋に「医者がいる」ということがどういうことなのかわからない。\n\n私は...",
      "title": "30歳にして生まれて初めて健康保険に加入しましたが、誰に連絡すればいいのかわかりません。どうすれば、いろいろなことでお医者さんに診てもらえるようになるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有接受过关于医疗保险如何运作的教育。我从小就很穷，在一个\n混乱的家庭。多年来，我一直在努力提高自己的独立性，我终于加入了保险计划。\n我终于加入了一个保险计划，在听了多年的 \"只要和你的医生谈谈 \"之后，我\n我真的不知道 \"有医生 \"意味着什么。\n\n我是否...",
      "title": "我作为一个30岁的人，一生中第一次拥有健康保险，我不知道该和谁联系。我怎样才能达到可以看医生的程度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有接受過關於醫療保險如何運作的教育。我從小就很窮，在一個\n混亂的家庭。多年來，我一直在努力提高自己的獨立性，我終於加入了保險計劃。\n我終於加入了一個保險計劃，在聽了多年的 \"只要和你的醫生談談 \"之後，我\n我真的不知道 \"有醫生 \"意味着什麼。\n\n我是否...",
      "title": "我作爲一個30歲的人，一生中第一次擁有健康保險，我不知道該和誰聯繫。我怎樣才能達到可以看醫生的程度？"
    }
  ]
}