{
  "author": "Grouchy_Yam_4857",
  "the_new_excerpt": "I want to start off by saying this is not a post comparing CLOV to GME or AMC.\nWhile these stocks have some similarities, particularly being targeted by hedge\nfunds for short squeezes, I’m not going to get into that. This post is for\nanyone who is somewhat new to investing, still learning about…",
  "original_created_utc": 1623020398,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に断っておきますが、これはCLOVとGMEやAMCを比較する記事ではありません。\nこれらの銘柄にはいくつかの類似点がありますが、特にヘッジファンドがショートスクイーズの対象としている点などが挙げられます。\nこれらの銘柄にはいくつかの共通点があり、特にヘッジファンドのショートスクイーズの対象になっていますが、そのことについては触れません。この投稿は\n投資を始めたばかりで、まだ勉強中の人。",
      "title": "CLOV - すべてのスクイーズのビッグダディ DD"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想说这不是一个将CLOV与GME或AMC进行比较的帖子。\n虽然这些股票有一些相似之处，特别是被对冲基金盯上做空。\n挤兑的目标，但我不打算讨论这个问题。这篇文章是为\n任何对投资有点陌生，仍在学习的人。",
      "title": "CLOV - 所有挤压的大爸爸DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想說這不是一個將CLOV與GME或AMC進行比較的帖子。\n雖然這些股票有一些相似之處，特別是被對沖基金盯上做空。\n擠兌的目標，但我不打算討論這個問題。這篇文章是爲\n任何對投資有點陌生，仍在學習的人。",
      "title": "CLOV - 所有擠壓的大爸爸DD"
    }
  ],
  "title": "CLOV - Big Daddy of All Squeezes DD",
  "created_utc": 1623080373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I want to start off by saying this is not a post comparing CLOV to GME or AMC. While these stocks have some similarities, particularly being targeted by hedge funds for short squeezes, I’m not going to get into that. This post is for anyone who is somewhat new to investing, still learning about shorts and squeezes, and those of you who are more knowledgeable but want the full picture of what’s going on with this stock. You can also think of this post as a Part 2 to <a href=\"https://www.reddit.com/r/CLOV/comments/ngesez/this_is_the_bottom_and_youll_be_top_of_the_world/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">my previous post</a>. Brief description of my last post - it was about the stock reaching its bottom at $6.80 and only going up from there (which was correct).</p>\n\n<p><strong>TL;DR - Currently, the highest number of options purchased have a strike price between $7-18 for every single month. The goal is to stay above $12 to create a snowball of options being executed, thereby causing a gamma squeeze - the higher the strike price, the higher the limit to execute and the hedges are worse off.</strong></p>\n\n<p><strong>What Is Clover Health?</strong></p>\n\n<p>Clover Health is not just another insurance company. They have combined Medicare insurance services with new patient-centered technology aimed at facilitating the ease and effectiveness of diagnosis, treatment, and most importantly, prevention. This company should not be classified as a health insurance company, but a tech company. Their AI learning and database, Clover Assistant, make it easier for providers to eliminate unnecessary and repetitive lab testing, repetitive diagnoses, and it consolidates a patient’s medical history into one platform. This not only saves the patient headaches from navigating our decentralized healthcare system, but it also saves both patients and insurance companies an enormous amount of money by avoiding duplicated efforts. </p>\n\n<p>Currently, CLOV covers 66,300 customers across 8 states out of the 61,212,247 Medicare beneficiaries nationwide, which equates to .0011% of the beneficiary population. As you can tell, this number is extremely low, which makes sense since they are a brand new company. When they reach even 1% of the beneficiaries, this company’s stock price would be $100+ based on fundamentals alone. But I expect these numbers to skyrocket as they gain more members and their AI learning database improves more and more.</p>\n\n<p><a href=\"https://preview.redd.it/wuoalim07q371.png?width=3297&amp;format=png&amp;auto=webp&amp;s=b38cba4adeb4fcbbeae5d53ea93751964480113a\">CLOV Medicare Advantage Plan by &#37; of growth compared to competitors (cloverhealth.com)</a></p>\n\n<p>CLOV has huge long-term growth potential, so the risk to reward is extremely favorable towards getting into the squeeze. Let me explain why.</p>\n\n<p><strong>Positive Catalysts</strong></p>\n\n<p>All the negative catalysts are out of the way and everything is priced in. Here are some positives I’m keeping an eye on: </p>\n\n<ul>\n<li>DOJ/SEC case dropping or settling (even if CLOV is found guilty of taking advantage of Medicare, it will still be positive because at max they’ll pay a fine and that’ll be over with). I highly doubt CLOV will be found guilty though because the Hindenburg claims are rather baseless and the DOJ were forced to inquire about this only because it’s related to Medicare. </li>\n<li>Biden’s health care proposal reducing the Medicare qualifying age below 65 would create millions of new beneficiaries. The hype around the proposal alone will create a huge stock price increase in all healthcare-related stocks, so CLOV will definitely benefit.</li>\n<li>CLOV is officially added to the Russell 3000, who will have to purchase a ton of CLOV shares.</li>\n<li>PR of any new partnership, expanding to further states, and increasing current partnerships. They’re growing rapidly as is, so news like this is bound to come out in the near future.</li>\n</ul>\n\n<p><strong>The Dark Clouds Surrounding CLOV</strong></p>\n\n<ul>\n<li>As previously mentioned, the DOJ inquiry is still lingering and it’s unclear when it will be settled. Although it’s priced in, it is still something to watch out for.</li>\n<li>Hindenturd’s constant attacks despite insisting they don’t have any positions. Why would Hindenburg attack Chamath Palihapitiya even though they aren’t benefiting from it, according to themselves? This relates to the GME/AMC squeeze; Chamath was a big proponent of the push against the hedges. He was outspoken about the squeeze on several occasions and gave GME his validation, which in turn hurt Citadel and other hedges shorting GME immensely. Hindenburg’s report was created to hurt all of Chamath’s IPOs, especially CLOV. Basically, this is retaliation against Chamath for standing with the retail investors, and if I had to take a wild guess, Citadel has paid Hindenburg to write this baseless report. I’ve added a link at the bottom of this post about the Hindenburg allegations and the counter from CLOV for those who were not aware of all the allegations. (PS - Despite all the negative press surrounding Chamath, his track record is stellar.)</li>\n<li>The constant manipulation by short sellers to create negative incentive. For instance, the fake lawsuits by Lifshitz that are shady at best; if you go to their website, you’ll find the phone number listed goes straight to voicemail. All their social media lead to Wix.com platforms instead of their own. And, <strong>THEIR PHYSICAL LOCATION DOES NOT EXIST</strong> as shown in Google Maps. Lots of red flags.</li>\n</ul>\n\n<p><strong>Let’s get down to the nitty gritty - The Daddy of all Short Squeezes</strong></p>\n\n<p>CLOV is currently over 42.58% as of Friday, making it the highest shorted stock on paper (and it’s unclear how many naked shorts there are, which could easily be 70-100%+; it’s impossible to know since those shares are shorted illegally). THE SQUEEZE IS INEVITABLE, it’s just a matter of how much more the short interest increases, which will correlate to a bigger squeeze. Furthermore, the borrowed interest on CLOV stock has more than doubled to 3.7%, meaning those who are shorting have to pay much higher interest on borrowing the stocks, and that number will only continue to increase as demand increases. Soon, they won’t be able to borrow anymore stocks and will have to short it naked in order to suppress the price further, essentially digging a gargantuan hole in which to bury themselves.</p>\n\n<p><a href=\"https://preview.redd.it/yem0laz57q371.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=d0602994d6bc0ddc1305c2737a8b1d70de3f7c58\">CLOV S/I&#37; as reported by Ortex</a></p>\n\n<p>No need to fear the company dumping their shares or diluting it because the Class B shares are locked up - the directors aren’t able to sell any shares until the stock price stays above $30 for 90 consecutive days or more. The company is $700 million cash flow positive and no debt, therefore there won’t be any dilution.</p>\n\n<p>The P/S ratio is considered a particularly good metric for evaluating young, potentially high growth companies or companies in cyclical industries that may not show an actual net profit every year. Let’s talk about CLOV’s P/S ratio for a moment. </p>\n\n<p>CLOV’s 2020 revenue was $672.9 million compared to $462.3 million in 2019, which puts it at 45.6% increase in growth. They beat their own expectations and those of analysts by a wide margin. In 2018 and 2019, the market valued tech companies with IPOs at an average of 11.7 and 10.4 times (respectively) their previous 12 month earnings. Conservatively, that would put CLOV at $7 billion market cap, which is around $20+ fair value. But in 2020, that number doubled, which would increase CLOV’s market cap significantly. However, for this consideration, I’m using the 2018/19 valuation to be conservative.</p>\n\n<p><strong>Bottom Line</strong></p>\n\n<p>The fair value of CLOV is anywhere from $20-30 fundamentally, which makes it a very risk-free, undervalued stock that has been suppressed by short sellers. But this post is not about the fundamentals - this is about exposing the short sellers’ manipulation of CLOV. On paper, this company is shorted 42.58% (though this is MUCH higher when you include the illegal naked shorts that aren’t reported), making it the highest shorted stock as of Friday. This number could go much higher as short sellers continue to borrow stocks and suppress the price further, which only hurts them more the longer this is shorted. As is common knowledge from previous squeezes, hedge funds are not going to cover anytime soon; they have to be forced by triggering their margins. As the Fed hinted recently, hedge funds are the most leveraged they’ve ever been in the last 20 years, which means retail investors can take advantage of them just like they’ve been taking advantage of retail investors for 100s of years.</p>\n\n<p>I don’t know how much it could squeeze, from $50-150 or much higher, and there’s no telling where the ceiling will end up. The squeeze is inevitable, whether you or I buy it or not, but the process of how long it will take is up to the retail investing community.</p>\n\n<p>CLOV’s Response to Hindenburg Allegations: <a href=\"https://www.streetinsider.com/Corporate+News/Clover+Health+Investments+%28CLOV%29+Issues+Response+to+Short+Seller+Hindenburg+Research/17921324.html\">https://www.streetinsider.com/Corporate+News/Clover+Health+Investments+%28CLOV%29+Issues+Response+to+Short+Seller+Hindenburg+Research/17921324.html</a></p>\n</div><!-- SC_ON -->",
  "score": 1833,
  "permalink": "/r/wallstreetbets/comments/nty1bd/clov_big_daddy_of_all_squeezes_dd/",
  "subreddit": "wallstreetbets",
  "id": "nty1bd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404892702
}