{
  "author": "virusamongus",
  "the_new_excerpt": "Looking back at a crash or a bear market and I beat myself up for not buying way\nmore, but then I realised every time I actually did have some fiat set aside -\nit's just that I had thrown it all back into crypto way before we got anywhere\nnear the bottoms.\n\nI keep taking some profits and having it…",
  "original_created_utc": 1622546951,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暴落や弱気な市場を振り返ると、もっと買っておけばよかったと自分を責めてしまいます。\nしかしその後、実際にフィアットを確保していたことに気づきました。\nボットに近づく前に全部暗号に戻してしまっただけなんです。\nただ、底値に近づく前にすべてを暗号に戻していたのです。\n\n私は利益を得ても、それを...",
      "title": "不換紙幣を保有することは、暗号を保有するよりもはるかに困難です。私はフィアットのペーパーハンドを持っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "回顾崩盘或熊市，我为没有买入更多东西而自责。\n但后来我意识到，每次我实际上都有一些法币留着 --\n只是在我们到达任何地方之前，我已经把它全部扔回了加密货币中。\n接近底部。\n\n我不断地获取一些利润，并让它...",
      "title": "持有法币要比持有加密货币难得多。我有法币的纸手。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "回顧崩盤或熊市，我爲沒有買入更多東西而自責。\n但後來我意識到，每次我實際上都有一些法幣留着 --\n只是在我們到達任何地方之前，我已經把它全部扔回了加密貨幣中。\n接近底部。\n\n我不斷地獲取一些利潤，並讓它...",
      "title": "持有法幣要比持有加密貨幣難得多。我有法幣的紙手。"
    }
  ],
  "title": "Holding fiat is way harder than holding crypto. I got fiat paper hands.",
  "created_utc": 1622607495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Looking back at a crash or a bear market and I beat myself up for not buying way more, but then I realised every time I actually did have some fiat set aside - it&#39;s just that I had thrown it all back into crypto way before we got anywhere near the bottoms. </p>\n\n<p>I keep taking some profits and having it ready in stable coins whenever a coin has a particularily good day, to get ready for a bear season or the next flash crash sale, but it&#39;s just impossible for me to sit on it after a 10-15% drop. How the hell can anyone sit on fiat that they want to invest, and <em>not</em> buy at -30% and below, but keep waiting for a better in? How do you still have money to invest by the time it&#39;s at -90%??</p>\n\n<p>Im way too stubborn and proud to sell any coins if its down from ATH , and I sure as shit aint selling at price discovery - so hodling crypto is easy peasy to me. When it comes to fiat though, I got paper hands man.</p>\n</div><!-- SC_ON -->",
  "score": 160,
  "permalink": "/r/CryptoCurrency/comments/nprrm7/holding_fiat_is_way_harder_than_holding_crypto_i/",
  "subreddit": "CryptoCurrency",
  "id": "nprrm7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804297934
}