{
  "author": "CylonBunny",
  "the_new_excerpt": "Thought this was especially interesting given the article currently on the front\npage of this sub about SPAC mergers.\n[https://www.wsj.com/articles/rocket-lab-nears-deal-to-merge-with-vector-spac-11614556800?mod=hp_lista_pos5]\n\nThis is the first publicly traded spac company I'm excited about. Along…",
  "original_created_utc": 1614610679,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于目前前面的文章，觉得这个特别有意思。\n本分册关于SPAC合并的页面。\n[https://www.wsj.com/articles/rocket-lab-nears-deal-to-merge-with-vector-spac-11614556800?mod=hp_lista_pos5]\n\n这是我对第一家上市的太空公司感到兴奋。随着...",
      "title": "Rocketlab将通过SPAC合并上市"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於目前前面的文章，覺得這個特別有意思。\n本分冊關於SPAC合併的頁面。\n[https://www.wsj.com/articles/rocket-lab-nears-deal-to-merge-with-vector-spac-11614556800?mod=hp_lista_pos5]\n\n這是我對第一家上市的太空公司感到興奮。隨着...",
      "title": "Rocketlab將通過SPAC合併上市"
    }
  ],
  "title": "Rocketlab to go public via SPAC merger",
  "created_utc": 1614626380,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.wsj.com/articles/rocket-lab-nears-deal-to-merge-with-vector-spac-11614556800?mod=hp_lista_pos5\">Thought this was especially interesting given the article currently on the front page of this sub about SPAC mergers.</a></p>\n\n<p>This is the first publicly traded spac company I&#39;m excited about. Along with going public. They&#39;ve announced a new medium-lift reusable rocket and plans for human launch capabilities. The CEO, Peter Beck, once said he&#39;d eat his hat if Rocketlab ever made bigger rockets, persued reusablity, went public, or tried to launch humans. Well they are doing them all at once, so he must be pretty confident.</p>\n\n<p>Rocketlab&#39;s Electron rocket has a great record in the small rocket world, but there is so much that still remains to be seen about their new rocket, the Neutron. I assume it will be using an entirely new engine architecture, and probably will not use electric turbo pumps like their current Rutherford engines. It also seems like they are dropping their use of carbon fiber based on the shiny pictures.</p>\n\n<p>Then, beyond the rocket science, there is the business side of things. How will they plan to compete with SpaceX and Blue Origin who each have their own satellite constellations? (Or plans anyways for Blue Origin.) Is there room enough in the growing space industry for another medium-lift launcher? Perhaps if Rocket Lab can beat Blue Origin&#39;s New Glen to space. I can think it could definitely happen?</p>\n</div><!-- SC_ON -->",
  "score": 122,
  "permalink": "/r/investing/comments/lvb8qc/rocketlab_to_go_public_via_spac_merger/",
  "subreddit": "investing",
  "id": "lvb8qc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740758
}