{
  "author": "Avocadoooo_0000",
  "original_created_utc": 1635932741,
  "title": "Is the decision not to have children selfish?",
  "created_utc": 1635943740,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Aside from the fear of giving birth, I don’t think I am mentally and emotionally fit to be a parent. Parenting is a huge responsibility, it’s a lifetime commitment. I am emotionally unstable but I’m trying my best to heal. Healing is an ongoing and continuous process. It might take a long time before healing my life, but at least I won’t ruin the life of an innocent. I do not want to bring a child into this world knowing that there’s a strong chance it will struggle like I have.</p>\n\n<p>Why do people around me think that I’m selfish for not wanting children?</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/qlr09i/is_the_decision_not_to_have_children_selfish/",
  "subreddit": "TooAfraidToAsk",
  "id": "qlr09i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Aside from the fear of giving birth, I don’t think I am mentally and emotionally\nfit to be a parent. Parenting is a huge responsibility, it’s a lifetime\ncommitment. I am emotionally unstable but I’m trying my best to heal. Healing is\nan ongoing and continuous process. It might take a long time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "出産の恐怖もさることながら、私は精神的にも感情的にも親になる資格がないと思っています。\n親になるのに適しているとは思えません。子育ては大きな責任を伴い、一生を左右するものです。\nのコミットメントです。私は情緒不安定ですが、一生懸命治そうと努力しています。癒すことは\n現在進行形で継続的なプロセスです。長い時間がかかるかもしれませんが...。",
      "title": "子供を産まないという決断は、自分勝手なものでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除了对分娩的恐惧外，我认为我在精神和情感上都不适合做父母。\n适合做父母。为人父母是一项巨大的责任，是一项终身的承诺。\n承诺。我的情绪不稳定，但我正在尽力愈合。愈合是\n一个持续不断的过程。它可能需要很长的时间...",
      "title": "不生孩子的决定是不是很自私？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除了對分娩的恐懼外，我認爲我在精神和情感上都不適合做父母。\n適合做父母。爲人父母是一項巨大的責任，是一項終身的承諾。\n承諾。我的情緒不穩定，但我正在盡力癒合。癒合是\n一個持續不斷的過程。它可能需要很長的時間...",
      "title": "不生孩子的決定是不是很自私？"
    }
  ]
}