{
  "author": "SnooPets1127",
  "original_created_utc": 1631207887,
  "title": "Am I asexual if I could take it or leave it?",
  "created_utc": 1631236544,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Basically, haven’t had sex in a few years and just haven’t been pursuing it. I masturbate regularly, don’t really feel like putting effort into a relationship, and one night-stands/flings aren’t really an appealing concept. Sometimes I get lonely, but it’s fleeting and I enjoy my independence at the end of the day. I feel like the biggest reason to get into a sexual relationship would be the regret id feel later in life for ‘missing out’ but I just don’t want it right now. I’m in early 30s. Would you say I’m asexual?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/pl26zp/am_i_asexual_if_i_could_take_it_or_leave_it/",
  "subreddit": "TooAfraidToAsk",
  "id": "pl26zp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Basically, haven’t had sex in a few years and just haven’t been pursuing it. I\nmasturbate regularly, don’t really feel like putting effort into a relationship,\nand one night-stands/flings aren’t really an appealing concept. Sometimes I get\nlonely, but it’s fleeting and I enjoy my independence at the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的には、数年前からセックスをしておらず、追求していないだけです。I\n定期的にオナニーをしていますが、恋愛に力を入れる気はありません。\n一晩だけの関係や浮気も魅力的なコンセプトではありません。時々、私は\n寂しくなることもありますが、それは一瞬のことで、今は独立した生活を楽しんでいます・・・。",
      "title": "受け入れるかどうかは別として、私はアセクシャルなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，已经有几年没有性生活了，只是一直没有追求。I\n我经常自慰，并不觉得自己真的想在一段关系中付出努力。\n一夜情/一夜情并不是一个真正有吸引力的概念。有时我会感到\n孤独，但那是转瞬即逝的，而且我很享受我的独立。",
      "title": "如果我可以接受或不接受，我是不是无性恋？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，已經有幾年沒有性生活了，只是一直沒有追求。I\n我經常自慰，並不覺得自己真的想在一段關係中付出努力。\n一夜情/一夜情並不是一個真正有吸引力的概念。有時我會感到\n孤獨，但那是轉瞬即逝的，而且我很享受我的獨立。",
      "title": "如果我可以接受或不接受，我是不是無性戀？"
    }
  ]
}