{
  "author": "thicc_dads_club",
  "the_new_excerpt": "I’m not a financial adviser and this isn’t financial advice. I just have a knack\nfor explaining things and lots of people have asked about this topic so I\nthought I’d share my own personal thoughts.\n\n\nTHE BULL THESIS\n\nTo date, the GME play has been pretty simple: buy and hold and wait for…",
  "original_created_utc": 1611724176,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不是理财顾问，这也不是理财建议。我只是有一个诀窍\n解释的东西，很多人都问这个话题，所以我。\n以为我会分享我个人的想法。\n\n\n大牛的故事\n\n到目前为止，金交所的玩法非常简单：买入并持有，等待...",
      "title": "GME Endgame"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是理財顧問，這也不是理財建議。我只是有一個訣竅\n解釋的東西，很多人都問這個話題，所以我。\n以爲我會分享我個人的想法。\n\n\n大牛的故事\n\n到目前爲止，金交所的玩法非常簡單：買入並持有，等待...",
      "title": "GME Endgame"
    }
  ],
  "title": "GME Endgame",
  "created_utc": 1611741448,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>I’m not a financial adviser and this isn’t financial advice. I just have a knack for explaining things and lots of people have asked about this topic so I thought I’d share my own personal thoughts.</strong></p>\n\n<h1>The bull thesis</h1>\n\n<p>To date, the GME play has been pretty simple: buy and hold and wait for the squeeze, whether that comes in hours, days, or weeks. Try not to have a heart attack during the intermittent gamma squeezes, keep your hands diamond strong during the manipulated downward spikes, and buy baby buy.</p>\n\n<p>It’s rapidly becoming apparent that we will soon enter the GME endgame. Before you can come up with an exit strategy or, if you’re still on the fence, decide whether to jump in, you need to form an opinion about the GME bull thesis, <em>without considering the short squeeze</em>. Your thoughts on the bull thesis will dictate how you play it from here on out.</p>\n\n<p>One braindead simple way to calculate a fair stock price for a company is to use a &quot;times-revenue&quot; valuation. You take the company&#39;s revenue ($6.466B in 2020) and multiply by some magic number (often 0.5 for low-growth companies and 2 for high-growth companies), then divide by the float (number of shares available to trade, 50.65M). A times-revenue multiplier of 0.5 gives a GME stock price of $64, while a multiplier of 2 gives $255.</p>\n\n<p>This isn&#39;t a particularly sophisticated method but whatever, I&#39;m not a particularly sophisticated investor.</p>\n\n<p>Working backwards, if Melvin Capital thinks that GME is overpriced at $20 then a times-revenue valuation would suggest a multiplier of 0.16. That&#39;s extraordinarily low for a retail business. If you applied that multiplier to Best Buy ($43B revenue in 2020, 231.59M float) you would get a stock price of $30. Best Buy currently trades for $115, which works out to a much more reasonable multiplier of 0.62.</p>\n\n<p>What multiplier is correct? Well, the bulls point out:</p>\n\n<ul>\n<li>Ryan Cohen (13% stake in GME, sits on the board) has a great e-commerce success story with Chewy, his previous company.</li>\n<li>Three new successful e-commerce board members from Cohen&#39;s firm were added to the board in 2020.</li>\n<li>Despite being a brick-and-mortar business and the pandemic, Gamestop&#39;s balance sheet isn&#39;t bad. They have approx. $550M in debt, but more than that in cash (net cash positive). They have minimal risk of default or bankruptcy in the near future, even without any change to company direction.</li>\n<li>Their traditional core business of game and console sales is not shrinking as fast as many people expected, with major new consoles still supporting optical discs and digital game downloads not accelerating as fast as feared, possibly due to stagnation in the ISP industry. So even if Cohen and his board seats take a long time to roll out new changes, the company is in little danger of any sudden spiral.</li>\n</ul>\n\n<p>So is Melvin right and GME is a dead-end company with no growth potential and should be valued with a times-revenue multiplier vastly below its competitors? Or is it more appropriate to think of it as a brand new business, being spring-boarded off the healthy books of an existing brand by a successful e-commerce businessman alongside a revamped board?</p>\n\n<p>How you judge that determines your exit strategy.</p>\n\n<h1>Exit strategy 1: Just along for the ride</h1>\n\n<p>Maybe you don&#39;t care at all about GME&#39;s balance sheet or Cohen&#39;s planned turnaround, you bought a couple shares on a whim to be part of a unique movement. You don&#39;t intend to be a long-term Gamestop shareholder nor do you really care if you miss out on the highest peaks, so long as you make a few dollars and get to say you were part of the squeeze.</p>\n\n<p>If I were this person, what would I do? I&#39;d pick a number between 0 and 3 that I feel represents my confidence in the retail market&#39;s current expectation for Cohen and GME, and multiply it by 128. I&#39;d submit a limit sell order for all my shares at that share price.</p>\n\n<h1>Exit strategy 2: Pants-shitting fear</h1>\n\n<p>You&#39;ve got a handful of shares and maybe some options and you&#39;re up big. You don&#39;t know much about squeezes or fundamentals or greeks and every time there&#39;s a dip and the stock gets halted you shit your pants and your finger hovers over the sell button. But then the price jumps up and you wipe the drenching sweat off your face and promise to hold firm next time.</p>\n\n<p>If I were this person, what would I do? I&#39;d sell all my options that expire sooner than 30 days at market open to reduce the number of pairs of pants I&#39;m going through. I&#39;d keep all my shares and longer-dated options until the news comes out that the shorts are being liquidated. And I&#39;m not watching hedge fund managers get on Fox Business or CNBC or whatever, I&#39;m following WSB and Twitter for rapid fire updates about short volume. If the short volume as reported by WSB posters drops below, say, 50% I&#39;m selling everything and getting out. I might also pick a maximum times-revenue multiplier (something pretty high, like 4 or 5) and use that for a limit sell for shares.</p>\n\n<h1>Exit strategy 3: Diamond hands</h1>\n\n<p>You&#39;ve got bigger balls than most, and this isn&#39;t your first time dumping a significant fraction of your net worth into a company whose financials you&#39;ve never looked at. You want to ride it to the peak, if at all possible, and you want to impress the pants shitters and the weak-kneed with your maximum gains. You are ok with increasing your cost basis to squeeze out extra tendies on the way to the top.</p>\n\n<p>If I were this person, what would I do? I&#39;d sell my weeklies on open tomorrow and immediately plow every dollar of those 20-bagger returns into shares. If my longer-dated options were purchased at extreme IV I&#39;d do the same for them, otherwise I&#39;d let them ride. I wouldn&#39;t sell a single share until the final squeeze, when news comes out that Melvin is done, and then I&#39;d unload (in my pants). See you on the moon, brother.</p>\n\n<h1>Exit strategy 4: <a href=\"/u/DeepFuckingValue\">u/DeepFuckingValue</a></h1>\n\n<p>IF HE&#39;S STILL IN I&#39;M STILL IN</p>\n\n<h1>FAQ 1: Is it too late to get in?</h1>\n\n<p>The best way to judge this is by looking at the exit strategies. Which person are you? If you&#39;re (1) then sure, buy a share or two to be part of a once-in-a-decade event, but think of it as a fun expense - a ticket to ride the squeeze train - not an investment. If you&#39;re (2) then hell yeah buy those shares baby but avoid options unless there&#39;s a dip. If you&#39;re (3) or (4) then you&#39;re already in and lying to your wife about how deep.</p>\n\n<h1>FAQ 2: Was that the squeeze?! Is it over?</h1>\n\n<p>This must get posted every time there&#39;s a gamma squeeze. It&#39;s midmorning and price suddenly launches into the stratosphere, trading halts, and it crashes back down. No, that wasn&#39;t <em>the</em> squeeze. Gamma squeezes occur when options prices are rising (due to sudden increased options buying or volatility) faster than market makers can hedge. They&#39;re good to get your heart racing but a short squeeze is slower and more stable.</p>\n\n<h1>FAQ 3: How high will it go during the squeeze?</h1>\n\n<p>Who knows. $500? $1000? $2000? There&#39;s really no way to know. If you have the stones to get those max tendies then you should focus on listening to the emerging news about Melvin Capital and Citadel rather than watching the price. Sell when they&#39;re covering and not a moment before. That will be the peak.</p>\n\n<h1>FAQ 4: How long will this take?</h1>\n\n<p>Could be tomorrow morning, could be tomorrow afternoon, could be next week. At the rate that shorts are losing money it won&#39;t be much longer than that. If you&#39;re not in yet, this is the final boarding call.</p>\n\n<h1>FAQ 5: Who will buy our shares at the peak?</h1>\n\n<p>The idea behind selling at the peak isn&#39;t to sell your shares to another retail trader, but to sell your shares to the desperate short sellers who are forced by their prime brokers to liquidate their positions at any cost. That&#39;s the difference between a perfectly legal and time-honored short squeeze and a pump-and-dump. This isn&#39;t about irrationally driving the price upwards with the hopes of selling to a bigger idiot, it&#39;s about buying and holding and waiting for the shorts to crack and beg us to sell to them.</p>\n\n<h1>FAQ 6: What is the next stock?</h1>\n\n<p>Get this thought out of your head. Yeah you just joined WSB and made a few bucks and now you think you found yourself an investment club. <strong>No</strong>. This is a forum for folks to share their risky trade ideas, not a place to coordinate to manipulate the market. Yes, at the moment the consensus is that we can make a boatload of money off of dumbass hedge funds, but think of it less like a pack of draft horses following a path and more like a room of angry, shitting monkeys who happen, for the time being, to be throwing their shit in the same direction.</p>\n\n<h1>FAQ 7: Am I gay?</h1>\n\n<p>Many of us grow up to assume that we’re straight only to find out, later, that we’re not. Sometimes, we realize this because we have sex dreams, sexual thoughts, or feelings of intense attraction toward people of the same gender as us. However, none of those things — sex dreams, sexual thoughts, or even feelings of intense attraction — necessarily “prove” your orientation. There are a few different forms of attraction. When it comes to orientation, we usually refer to romantic attraction (who you have strong romantic feelings for and desire a romantic relationship with) and sexual attraction (who you want to engage in sexual activity with). Sometimes we’re romantically and sexually attracted to the same groups of people. Sometimes we’re not. For example, it’s possible to be romantically attracted to men but sexually attracted to men, women, and nonbinary people. This sort of situation is called “mixed orientation” or “cross orientation” — and it’s totally OK. Bear this in mind as you consider your sexual and romantic feelings.</p>\n</div><!-- SC_ON -->",
  "score": 53006,
  "permalink": "/r/wallstreetbets/comments/l5x0fc/gme_endgame/",
  "subreddit": "wallstreetbets",
  "id": "l5x0fc",
  "is_self": true,
  "media": null,
  "is_video": false
}