{
  "author": "FriedCheeseFromHell",
  "the_new_excerpt": "My grandma was telling me a story about visiting Russia in the mid 70' and\nremembered that in GUM (the main shopping mall in Moscow) tracksuits cost more\nthan confectionary suits. Even more that they visited a spa and that they would\nwear them there too. She hypothesised that it could have been the…",
  "original_created_utc": 1621176538,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の祖母は、70年代半ばにロシアを訪れた際の話をしていました。\nグム（モスクワの主要ショッピングモール）では、トラックスーツがお菓子のスーツよりも高かったことを覚えています。\nグム（モスクワの主要ショッピングモール）では、トラックスーツがお菓子のスーツよりも高かったことを覚えています。さらには、温泉にも行っていて、そこでも履いていたそうです。\nさらに、温泉に行ったときにもトラックスーツを着ていたという。彼女は、もしかしたら...と仮説を立てました。",
      "title": "トラックスーツ（特にサイドにストライプが入ったもの）は、どのようにしてロシア／東スラブ文化に根付いたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的祖母告诉我一个关于70年代中期访问俄罗斯的故事。\n我记得在GUM（莫斯科的主要购物中心），运动服的价格比糖果套装还要高。\n比糖果套装还贵。更重要的是，他们去了一个温泉，在那里他们也会穿上运动服。\n他们在那里也穿运动服。她假设，这可能是......",
      "title": "运动服（尤其是两侧有条纹的）是如何成为俄罗斯/东斯拉夫文化的固有组成部分的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的祖母告訴我一個關於70年代中期訪問俄羅斯的故事。\n我記得在GUM（莫斯科的主要購物中心），運動服的價格比糖果套裝還要高。\n比糖果套裝還貴。更重要的是，他們去了一個溫泉，在那裏他們也會穿上運動服。\n他們在那裏也穿運動服。她假設，這可能是......",
      "title": "運動服（尤其是兩側有條紋的）是如何成爲俄羅斯/東斯拉夫文化的固有組成部分的？"
    }
  ],
  "title": "How did tracksuits (especially the ones with stripes on their sides) become an inherent part of Russian/East Slavic culture?",
  "created_utc": 1621191425,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My grandma was telling me a story about visiting Russia in the mid 70&#39; and remembered that in GUM (the main shopping mall in Moscow) tracksuits cost more than confectionary suits. Even more that they visited a spa and that they would wear them there too. She hypothesised that it could have been the price of man amde materials, but couldn&#39;t say for sure.</p>\n\n<p>Have they been a status symbol? And how did they stay popular till today?</p>\n</div><!-- SC_ON -->",
  "score": 1238,
  "permalink": "/r/AskHistorians/comments/ndpx06/how_did_tracksuits_especially_the_ones_with/",
  "subreddit": "AskHistorians",
  "id": "ndpx06",
  "is_self": true,
  "media": null,
  "is_video": false
}