{
  "author": "BigBootyBear",
  "original_created_utc": 1638358750,
  "title": "How come the Netherlands managed to pull their weight versus Europe's superpowers with a population of a measly 1.5 million?",
  "created_utc": 1638401967,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The trading empire of the Dutch Republic would be impressive alone for it&amp;#39;s achievements in trade and warfare, but it&amp;#39;s astounding when you realize that by 1600, the Netherlands had 1.5m for population! Compare that to 18m of France, or 9m approx of Spain, or 5.6m by England.&lt;/p&gt;\n\n&lt;p&gt;I get that they were very sophisticated and had advanced commerce, production and politics. But still... 1.5 million? How is that enough manpower to arm enough soldiers on land to prevent invasions, and sailors to operate a huge fleet? And given the immense wealth and manpower of Spain and Portugal compared to that of the Dutch - what prevented them from just dropping in on Amsterdam and burn it so to keep them out of their business? Or maybe drop in on Calais and march on land if they didn&amp;#39;t have enough naval power.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/r6cuhu/how_come_the_netherlands_managed_to_pull_their/",
  "subreddit": "AskHistorians",
  "id": "r6cuhu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The trading empire of the Dutch Republic would be impressive alone for it's\nachievements in trade and warfare, but it's astounding when you realize that by\n1600, the Netherlands had 1.5m for population! Compare that to 18m of France, or\n9m approx of Spain, or 5.6m by England.\n\nI get that they were…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "オランダ共和国の貿易帝国は、それだけで印象的なものです。\n貿易や戦争における成果もさることながら、その一方で、1960年代には\n1600年、オランダの人口は150万人でした。フランスが1,800万人であることと比較すると\nスペインの約9百万人、イギリスの約560万人。\n\n彼らがそうであったことはわかるが...",
      "title": "人口150万人のオランダが、なぜヨーロッパの大国と肩を並べることができたのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "荷兰共和国的贸易帝国，仅就其在以下方面的成就而言就令人印象深刻\n在贸易和战争方面的成就令人印象深刻，但当你意识到，到1600年时，荷兰共和国的贸易帝国已经达到了令人震惊的程度。\n1600年，荷兰有150万人口。与法国的1800万，或\n西班牙的900万，或英国的560万。\n\n我明白，他们是...",
      "title": "荷兰为何能以区区150万人口在欧洲超级大国中独占鳌头？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "荷蘭共和國的貿易帝國，僅就其在以下方面的成就而言就令人印象深刻\n在貿易和戰爭方面的成就令人印象深刻，但當你意識到，到1600年時，荷蘭共和國的貿易帝國已經達到了令人震驚的程度。\n1600年，荷蘭有150萬人口。與法國的1800萬，或\n西班牙的900萬，或英國的560萬。\n\n我明白，他們是...",
      "title": "荷蘭爲何能以區區150萬人口在歐洲超級大國中獨佔鰲頭？"
    }
  ]
}