{
  "author": "spacej3di",
  "the_new_excerpt": "Dow (0.26%), S&P 500 +0.36%, Nasdaq +1.54%, Russell 2000 +1.13%Wednesday, March\n31, 2021\n\n * Synopsis\n   * US equities were mostly higher in Wednesday trading, though finished off\n     best levels, with S&P now little changed on the week. Small caps higher\n     again after resuming recent bounce…",
  "original_created_utc": 1617222016,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "道指(0.26%)，标普500指数+0.36%，纳斯达克指数+1.54%，罗素2000指数+1.13%3月3日星期三\n31, 2021\n\n * 概要\n   * 美国股市在周三的交易中大多走高，虽然收盘时跌幅较大。\n     最佳水平，标普本周变化不大。小型股走高\n     再次恢复最近的反弹后... ...",
      "title": "美国市场回顾--2021年3月31日，星期三。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "道指(0.26%)，標普500指數+0.36%，納斯達克指數+1.54%，羅素2000指數+1.13%3月3日星期三\n31, 2021\n\n * 概要\n   * 美國股市在週三的交易中大多走高，雖然收盤時跌幅較大。\n     最佳水平，標普本週變化不大。小型股走高\n     再次恢復最近的反彈後... ...",
      "title": "美國市場回顧--2021年3月31日，星期三。"
    }
  ],
  "title": "U.S. Market Recap - Wednesday, March 31, 2021",
  "created_utc": 1617235187,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Dow (0.26%), S&amp;P 500 +0.36%, Nasdaq +1.54%, Russell 2000 +1.13%Wednesday, March 31, 2021</strong></p>\n\n<ul>\n<li><strong>Synopsis</strong>\n\n<ul>\n<li>US equities were mostly higher in Wednesday trading, though finished off best levels, with S&amp;P now little changed on the week. Small caps higher again after resuming recent bounce yesterday. Growth outperformed value with tech and consumer discretionary the leaders. FAANGs all higher and semis reversed some of the week&#39;s declines. Financials, energy, consumer staples among sectors lower. Treasuries little changed to a touch weaker. Dollar stronger vs yen but little changed vs euro. Gold finished up 1.8%. WTI crude settled down 2.3%.</li>\n<li><strong>White House infrastructure</strong> <strong>stimulus plan released</strong> ahead of Biden speech. White House has proposed over $2T of spending over eight-year period focused on traditional road, bridge, airport, water-delivery and utility projects, as well as electrification, high-speed broadband, worker training, supply chain and R&amp;D investments, and home-based care. Partial funding will come from 15 years of higher taxes, including increase in corporate tax rate to 28% from 21%, an increase in the global minimum tax from ~13% to 21%, and other measures. Democrats expected to have to use reconciliation to pass. Demands for SALT relief emerging as a potential stumbling block.</li>\n<li>Pretty quiet elsewhere ahead of <strong>nonfarm payrolls on Friday</strong> where market seems to be looking for a print above the ~650K consensus. However, <strong>ADP private payrolls</strong> growth of 517K only a bit better than 500K consensus. March <strong>Chicago PMI</strong> highest since Jul-18. February <strong>pending home sales</strong> missed on tight inventory. <strong>China manufacturing and services PMIs</strong> <strong>surprised to the upside</strong>, hitting three- and four-month highs, respectively. <strong>Eurozone headline and core inflation came in softer</strong>. Some discussion about <strong>worsening coronavirus trends in the US</strong> with new infections up 20% in past two weeks, though vaccine optimism remains fairly elevated with good news from Pfizer/BioNTech this morning regarding efficacy in adolescents. Multiple reports noted <strong>Biden to let Trump&#39;s H1-B visa ban expire</strong>.</li>\n<li><strong>WBA</strong> beat and raised with Street positive on execution given COVID headwinds. <strong>LULU</strong> beat with Street positive on digital sales strength and momentum into Q1 but some disappointment 2021 EPS guidance light on Mirror dilution. <strong>CHWY</strong> a standout after it beat and guided above with takeaways positive on rebound in new customer adds and opportunities in healthcare. <strong>KR</strong> reconfirmed FY21 comps guidance but bar high. <strong>CLF</strong> guided 2021 EBITDA above the Street with takeaways noting the company&#39;s leverage to stronger domestic steel prices. <strong>PVH</strong> results mixed with revenue below but EBIT ahead while FY guide below on softer NA outlook but not really a surprise. <strong>BB</strong> revenue missed.</li>\n</ul></li>\n<li><strong>Digest</strong>\n\n<ul>\n<li><strong>Tech, consumer discretionary best performers as growth extends week&#39;s outperformance:</strong>\n\n<ul>\n<li>Growth continued to outperform value factor today. <strong>Tech</strong> the best performer with semis, AAPL (upgrade), internet names stronger. <strong>Consumer discretionary</strong> saw solid gains TSLA and AMZN. <strong>Communication services</strong> in line with interactive media, entertainment better groups but media weaker. <strong>Healthcare</strong> weighed down by hospitals and managed care. <strong>Industrials</strong> lower on weakness across airlines, trucking, machinery. <strong>Consumer staples</strong> an underperformer with grocers (KR update), tobacco weaker. <strong>Materials</strong> down as broader chemicals group traded lower. <strong>Financials</strong> trailed as banks, insurance gave back some of yesterday&#39;s gains. <strong>Energy</strong> the worst performer, following WTI crude lower as integrated oil extended week&#39;s losses.</li>\n</ul></li>\n<li><strong>March ADP employment beats ahead of Friday&#39;s payrolls report:</strong>\n\n<ul>\n<li>March <strong>ADP employment report</strong> showed a gain of 517K, ahead of estimates for 500K and the highest since September. February was also revised up 59K to 176K. Service-sector jobs were up 437K, led by leisure and hospitality, up 169K. Good-producing jobs were up 80K on a 49K manufacturing and 32K construction gain. Report comes ahead of Friday&#39;s <strong>March nonfarm payrolls report</strong>, with expectations for a gain of 614K, up from February&#39;s 329K print. Would be highest since October&#39;s 680K increase. Private payrolls expected to increase by 525K and government up 89K. Unemployment rate expected to fall 0.2 pp to 6.0%, while average hourly earnings expected to hold at +0.2% (and down to 4.5% y/y from February&#39;s +5.3%). Some sell-side previews noted upside risk to payrolls could be driven by strong reopening momentum, with some real-time data showing fastest activity growth since last summer.</li>\n</ul></li>\n<li><strong>Details of infrastructure stimulus in focus ahead of Biden speech:</strong>\n\n<ul>\n<li>White House release <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/\">proposal</a> that includes ~$2T of spending over eight-year period focused on traditional road, bridge, airport, water-delivery and utility projects, as well as electrification, high-speed broadband, worker training, supply chain and R&amp;D investments, and home-based care (<a href=\"https://urldefense.com/v3/__https:/www.washingtonpost.com/us-policy/2021/03/30/biden-infrastructure-plan-jobs/__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q05vFqPAw$\">Washington Post</a>, <a href=\"https://urldefense.com/v3/__https:/www.nytimes.com/2021/03/30/business/economy/biden-infrastructure-taxes.html__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q0d-INcDA$\">NY Times</a>, <a href=\"https://urldefense.com/v3/__https:/www.politico.com/news/2021/03/30/biden-infrastructure-plan-478627__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q2iMz2d3A$\">Politico</a>, <a href=\"https://urldefense.com/v3/__https:/www.bloomberg.com/news/articles/2021-03-30/biden-to-lay-out-u-s-economic-renewal-in-rejuvenated-pittsburgh?srnd=premium&amp;sref=J9GPLx1B__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q3IwE9qlg$\">Bloomberg</a>) In terms of some of the bigger tranches, reports said ~$621B will go to traditional infrastructure, ~$400B to home care for elderly and disabled, $300B to housing infrastructure, $300B to revive US manufacturing, and $174B to vehicle electrification. Partial funding will come from 15 years of higher taxes, including increase in corporate tax rate to 28% from 21% and increase in global minimum tax. Democrats expected to have to use reconciliation in Senate to pass while one stumbling block emerging in House is demand from Blue-state Democrats to scrap $10K SALT deduction limit (<a href=\"https://urldefense.com/v3/__https:/www.bloomberg.com/news/articles/2021-03-30/salt-cap-repeal-advocates-near-numbers-to-block-biden-tax-plan?srnd=premium&amp;sref=J9GPLx1B__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q1QjL0aAA$\">Bloomberg</a>, <a href=\"https://urldefense.com/v3/__https:/thehill.com/policy/finance/545632-democrats-have-a-growing-salt-tax-problem__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q1OL7zEuA$\">The Hill</a>, <a href=\"https://urldefense.com/v3/__https:/www.politico.com/news/2021/03/30/blue-state-democrats-salt-taxes-478556__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q1aQ8Klhg$\">Politico</a>).</li>\n</ul></li>\n<li><strong>Still no clarity on what exactly is coming in Phase 2 of Biden plan:</strong>\n\n<ul>\n<li>While programs announced today in Biden&#39;s &quot;American Jobs Plan&quot; to focus on physical infrastructure, White House also preparing another round of proposals which could bring the total pricetag for this effort near $4T. Administration officials speaking about this next phase only in broadest strokes, though likely to include family-centered elements such as improved health coverage, expanded child tax benefit, and paid family/medical leave. Structure and timing of this follow-on effort remain unclear, though idea of pairing physical infrastructure with other traditional Democratic priorities plays into notion Biden hopes to engineer a broad overhaul of the economy in the mold of FDR&#39;s New Deal or LBJ&#39;s Great Society. No rollout date for phase 2 has been announced but commentators see a speech coming sometime before the White House&#39;s climate summit on 22-23 April.</li>\n</ul></li>\n</ul></li>\n<li><strong>Afternoon headlines:</strong>\n\n<ul>\n<li><strong>Economic policy/Stimulus:</strong>\n\n<ul>\n<li>Infrastructure plan could benefit lower middle-income workers, minorities the most (<a href=\"https://reut.rs/3fIhq2T\">Reuters</a>)</li>\n</ul></li>\n<li><strong>Coronavirus:</strong>\n\n<ul>\n<li>Pfizer plans amend EUA to include older children after tests found no infections among vaccinated 12 to 15 year olds (<a href=\"https://nyti.ms/3wboOcR\">NY Times</a>)</li>\n<li>France, Italy set to extend curbs to contain Covid variants (<a href=\"https://bloom.bg/31DnAZA\">Bloomberg</a>)</li>\n<li>Biden administration struggling over how to portray a burst of new coronavirus cases (<a href=\"https://politi.co/3rA3WYZ\">Politico</a>)</li>\n</ul></li>\n<li><strong>Corporate:</strong>\n\n<ul>\n<li>Microsoft wins $22B US army Contract to build custom AR headsets (<a href=\"https://cnb.cx/3rDD22B\">CNBC</a>)</li>\n<li>Delta to sell middle seats starting 1-May for first time in more than a year (<a href=\"https://nyti.ms/3sH48Hg\">NY Times</a>)</li>\n</ul></li>\n<li><strong>Market:</strong>\n\n<ul>\n<li>OPEC+ panel makes no production recommendation ahead of 1-Apr cartel meeting (<a href=\"https://bloom.bg/3weu3IA\">Bloomberg</a>)</li>\n<li>SEC opens preliminary probe into Archegos trades (<a href=\"https://bloom.bg/2PoTSoD\">Bloomberg</a>)</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Notable Gainers:</strong>\n\n<ul>\n<li>+16.7% <strong>CLF</strong> (Cleveland-Cliffs): Guided Q1 EBITDA ~27% above the Street based on current contractual business and forecast for hot-rolled coil to average $975/ton for remainder of the year; Q2 and FY21 guidance ahead as well.</li>\n<li>+13.3% <strong>AYI</strong> (Acuity Brands): FQ2 earnings beat with gross margins also ahead; noted ongoing Covid impact with Direct Network sales holding up best; analysts see last quarter as a trough for activity and sales amidst improving commercial real estate trends including larger contractor backlogs.</li>\n<li>+6.9% <strong>HOG</strong> (Harley-Davidson): Upgraded to outperform from neutral at RW Baird; positive on strategic direction of Hardwire plan; expects retail to turn positive in 2021 with lean dealer inventory fueling a healthy replenishment cycle (with checks showing signs of shortages).</li>\n<li>+6.7% <strong>SQ</strong> (Square): Upgraded to outperform from market perform at Keefe, Bruyette &amp; Woods; said platform positioned to be a winner within underserved market with Seller less than 3% penetrated and Cash App less than 2%; also cited additional customer acquisition avenues with TIDAL, Credit Karma&#39;s tax business.</li>\n<li>+5.4% <strong>CHWY</strong> (Chewy, Inc.): Q4 EBITDA and revenue margins beat; margins boosted by hardgoods, proprietary brands, and healthcare; FY21 revenue guidance above the Street; said QTD customer acquisition and spending trends remain strong.</li>\n<li>+5.4% <strong>AMAT</strong> (Applied Materials): Initiated outperform at Bernstein; cited positive long term industry outlook, expects rapid growth in wafer fab equipment, sees additional upside optionality for the firm along with LRCX.</li>\n<li>+4.6% <strong>BNTX</strong> (BioNTech): Announced with PFE positive topline results for Covid vaccine study in adolescents 12 to 15 years old; no cases of Covid were observed in the vaccinated group, similar to prior 16-25 year old study, vaccine was well tolerated; plan to request emergency use authorization as soon as possible.</li>\n<li>+3.6% <strong>WBA</strong> (Walgreens Boots Alliance): FQ2 earnings and revenue beat with FY guidance raised; analysts noted good execution, particularly in US, despite larger than expected Covid headwind; lower tax rate and interest expenses also benefited earnings; International wholesale business sale likely to be completed this year.</li>\n<li>+1.9% <strong>AAPL</strong> (Apple): Upgraded to buy from neutral at UBS; cited more stable long-term iPhone demand environment and optionality surrounding likely entry to the auto market.</li>\n</ul></li>\n<li><strong>Notable Decliners:</strong>\n\n<ul>\n<li>-19.7% <strong>RMO</strong> (Romeo Power): Preliminary Q4 EPS and revenue missed; FY21 revenue guide ~78% below the Street; noted near-term production and revenues to be constrained by supply shortage in battery cells; said working with preferred partners to secure allocations.</li>\n<li>-11% <strong>OLO</strong> (Olo, Inc.): FT reported DoorDash (DASH) accused company of overcharging it for more than three years; paper said DoorDash was Olo&#39;s largest delivery partner last year, accounting for 19.3% of revenue.</li>\n<li>-9.7% <strong>BB</strong> (BlackBerry): Q4 results below expectations with Software and Services a drag; Licensing and other revenues also missed; company has entered into negotiations to sell majority of its patent portfolio; if no sale, company guided license revenue well below consensus in its most conservative scenario; upgraded at Canaccord Genuity.</li>\n<li>-5.5% <strong>KR</strong> (Kroger): To provide update at today&#39;s Investor Day; reconfirmed FY 21 EPS guidance, which brackets Street consensus; also reconfirms comps, OI, capex, FCF guidance; analysts noted high bar into Investor Day, noting optimism around comps, holding market share gains accumulated in FY20.</li>\n<li>-3.3% <strong>LULU</strong> (lululemon athletica): Q4 EPS and revenue beat; comps beat, but store comp decline worse than expected; OM light on higher SG&amp;A than expected; guided FY22 EPS below Street, but revenue ahead; analysts said expense outlook given MIRROR, digital channel costs likely to weigh on earnings growth.</li>\n</ul></li>\n<li><strong>S&amp;P 500 Sector Performance</strong>\n\n<ul>\n<li><strong>Outperformers:</strong> Tech +1.50%, Consumer Disc. +0.83%, Utilities +0.65%, Communication Svcs. +0.40%</li>\n<li><strong>Underperformers:</strong> Energy (0.93%), Financials (0.90%), REITs (0.50%), Materials (0.49%), Consumer Spls. (0.48%), Industrials (0.33%), Healthcare +0.14%</li>\n</ul></li>\n<li><strong>Data</strong></li>\n<li>DXY: 93.23, (0.07)</li>\n<li>€-$ +0.0004 or +0.03% to 1.1726</li>\n<li>£-$ +0.0045 or +0.33% to 1.3783</li>\n<li>$-¥ +0.37 or +0.34% to 110.74</li>\n<li>€-¥ +0.52 or +0.40% to 129.84</li>\n<li>2-year yield +1 bps to 0.16%</li>\n<li>10-year yield +1 bps to 1.74%</li>\n<li>30-year yield +1 bps to 2.41%</li>\n<li>WTI Crude (May 21): ($1.24) or (2.05%) to $59.31</li>\n<li>Gold (Jun 21): +$22.10 or +1.31% to $1708.1</li>\n<li>Index Performance\n\n<ul>\n<li>Month-to-date: Dow +6.62%, S&amp;P +4.24%, Nasdaq +0.41% Russell +0.88%</li>\n<li>Quarter-to-date: Dow +7.76%, S&amp;P +5.77%, Nasdaq +2.78% Russell +12.44%</li>\n<li>Year-to-date: Dow +7.76%, S&amp;P +5.77%, Nasdaq +2.78% Russell +12.44%</li>\n</ul></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 95,
  "permalink": "/r/stocks/comments/mhes8g/us_market_recap_wednesday_march_31_2021/",
  "subreddit": "stocks",
  "id": "mhes8g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142685
}