{
  "author": "AverageStudent1",
  "original_created_utc": 1640085172,
  "title": "Don't forget to JOMO! Joy of Missing Out. Feeling content with staying in and disconnecting as a form of self-care.",
  "created_utc": 1640100894,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve all been there. Looking up the charts more than we should, to track a coin we can&amp;#39;t afford. &amp;quot;If I got paid just 1 week earlier, I could&amp;#39;ve afforded this dip that will magically increase in price just when I get my salary&amp;quot; It&amp;#39;s happened to all of us, trust me. Stick to a plan that works for you so you don&amp;#39;t have worry about short term price fluctuations. &lt;/p&gt;\n\n&lt;p&gt;Be happy with how much you have right now. You&amp;#39;ve bought coins for the money you had available at the time. Sometimes it can be the perfect solution to disconnect from everything. Forget about crypto for a period. Get your ass out and get a good workout in, catch up with family or friends you haven&amp;#39;t been talking to for a while. Read a book, play your favourite games or do what makes you truly happy. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t forget your mental well-being comes first. Take care of yourselves and your loved ones first guys, it&amp;#39;s especially important during these times. I wish you all a happy holidays and new years!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/rlchrg/dont_forget_to_jomo_joy_of_missing_out_feeling/",
  "subreddit": "CryptoCurrency",
  "id": "rlchrg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We've all been there. Looking up the charts more than we should, to track a coin\nwe can't afford. \"If I got paid just 1 week earlier, I could've afforded this\ndip that will magically increase in price just when I get my salary\" It's\nhappened to all of us, trust me. Stick to a plan that works for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが経験することです。コインを追うために必要以上にチャートを見上げたり\n買えなくなる。「あと1週間給料が早ければ、これを買う余裕があったのに\n給料が入ったら、魔法のように価格が上がるかもしれない」。\n誰にでもあることなんです、信じてください。そのために有効なプランにこだわる...",
      "title": "JOMOを忘れずに! Joy of Missing Outの略。セルフケアとして家にこもり、切り離すことに満足感を覚えること。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都有过这样的经历。为了追踪一枚我们买不起的硬币，不惜多看图表。\n我们买不起的硬币。\"如果我早一个星期拿到钱，我就能买得起这个\n如果我早一点拿到工资，我就能买得起这个在我拿到工资时就会神奇地涨价的硬币。\n发生在我们所有人身上，相信我。坚持一个适合自己的计划...",
      "title": "不要忘记JOMO! 错过的喜悦。感到满足于呆在家里和断开联系，作为一种自我保健的形式。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都有過這樣的經歷。爲了追蹤一枚我們買不起的硬幣，不惜多看圖表。\n我們買不起的硬幣。\"如果我早一個星期拿到錢，我就能買得起這個\n如果我早一點拿到工資，我就能買得起這個在我拿到工資時就會神奇地漲價的硬幣。\n發生在我們所有人身上，相信我。堅持一個適合自己的計劃...",
      "title": "不要忘記JOMO! 錯過的喜悅。感到滿足於呆在家裏和斷開聯繫，作爲一種自我保健的形式。"
    }
  ]
}