{
  "author": "bigshooTer39",
  "original_created_utc": 1639076602,
  "title": "I feel like I made a mistake…",
  "created_utc": 1639118501,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had a small amount of money (to me) in crypto through October.  In late October, I decided to slap a larger chunk of change into crypto.  The market was booming and media analysts were calling for $100k BTC by EoY, $10k ETH by EoY.  Reddit DD wasn’t that different, most was very optimistic.  &lt;/p&gt;\n\n&lt;p&gt;Maybe you can say I FOMO’d, but I did not buy all at once.  Tried to DCA in.  Over the course of several weeks I gradually bought various coins trying to average in but quick enough to maximize my gains.  The prices just kept climbing and climbing.  15% gain was mild and normal.  Some were hitting 80-90% in a day.  I thought this might be retail adoption/influx of new investors driving price up and $10k ETH was imminent.  About 1-2 weeks after the money I allocated was invested, the market tanked.  What. The. Fuck. &lt;/p&gt;\n\n&lt;p&gt;Whatever it was (omicron, govt bill, Evergrande, etc) it doesn’t matter.  I’m pretty sure I’m in the red now and really can’t sell until I get back to breaking even.  You don’t lose money until you sell.  (By the way it would be great if CB or CB Pro displayed unrealized gains/losses.  When I try to upload my transactions to Coin tracker.io the upload fails due to no transactions rows found.  Tried emailing support but no response.)&lt;/p&gt;\n\n&lt;p&gt;Anyway, I bought some BTC at 35k and some ETH at 3,700 but bought a majority of BTC in the mid 60s.  I definitely bought some at $68k too.  Similar situation with ETH.  I don’t worry about ETH though.  The later purchases feel like a mistake now.  Seeing red almost every day is tough.&lt;br/&gt;\n- Yes, I know this is not get rich quick.&lt;br/&gt;\n- Yes, I did DYOR .&lt;br/&gt;\n- Yes, I know the market fluctuates and is tied to BTC and the stock market in a way.&lt;/p&gt;\n\n&lt;p&gt;Did I make a mistake with my timing?  I’ve been beating myself up mentally.  It seems far fetched to think that BTC will reach $68k again before 2022.&lt;/p&gt;\n\n&lt;p&gt;A good chunk of my portfolio is in CRO as well.  I just don’t understand why the price is suppressed.  With all the marketing lately and announcements it seems like it should be skyrocketing.  I see it mentioned here in almost every other thread lately.  Last week they bought a Us exchange.  Why didn’t it pump?  What’s keeping the price from climbing?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 195,
  "permalink": "/r/CryptoCurrency/comments/rcoksv/i_feel_like_i_made_a_mistake/",
  "subreddit": "CryptoCurrency",
  "id": "rcoksv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had a small amount of money (to me) in crypto through October. In late\nOctober, I decided to slap a larger chunk of change into crypto. The market was\nbooming and media analysts were calling for $100k BTC by EoY, $10k ETH by EoY.\nReddit DD wasn’t that different, most was very optimistic.\n\nMaybe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10月までは（私にとって）少額の資金を暗号で持っていました。10月下旬に\n10月、私はより大きな小銭を暗号に叩き込むことにしました。市場は\nメディアアナリストは、EoYまでに10万ドルのBTC、EoYまでに1万ドルのETHが来ると言っていました。\nRedditのDDはそれほど変わっておらず、ほとんどが非常に楽観的でした。\n\nもしかしたら...",
      "title": "なんだか間違えたような気がして・・・。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在整个10月份，我有少量的钱（对我来说）在加密货币中。在10月下旬\n10月，我决定将一大笔钱投入加密货币。当时的市场\n市场正在蓬勃发展，媒体分析师们呼吁在EoY之前实现10万美元的BTC，在EoY之前实现1万美元的ETH。\nReddit上的DD并没有什么不同，大多数人都非常乐观。\n\n也许...",
      "title": "我觉得我犯了一个错误......。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在整個10月份，我有少量的錢（對我來說）在加密貨幣中。在10月下旬\n10月，我決定將一大筆錢投入加密貨幣。當時的市場\n市場正在蓬勃發展，媒體分析師們呼籲在EoY之前實現10萬美元的BTC，在EoY之前實現1萬美元的ETH。\nReddit上的DD並沒有什麼不同，大多數人都非常樂觀。\n\n也許...",
      "title": "我覺得我犯了一個錯誤......。"
    }
  ]
}