{
  "author": "delvo14827",
  "original_created_utc": 1635925829,
  "title": "Gamestop, NFT's and Cryptocurrency - Part 3 - The Latest Update",
  "created_utc": 1635943746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wrote the last two posts on Loopring, which seemed to help and educate a lot of people on their potential partnership with some large companies.</p>\n\n<p>I have just updated the post with my latest update which breaks down potential partnerships, including a potential one with Ubisoft.</p>\n\n<p>I wanted to talk about why Loopring and NFT’s are being linked to GameStop.</p>\n\n<p><strong>What is GameStop?</strong></p>\n\n<p>If you don’t follow the news or anything financial, GameStop is a company which sells video games, consumer electronics, and gaming merchandise retailer. For a while, GameStop had (and continues) to have a lot of selling pressure by large companies who wanted to see it crash, so they could gain financially. However, the loyalty of its customer base and shareholders has prevented this, and have turn the hooks on companies which shorted it. It has defied anyone who has gone against it, and is continuing to grow. It has also made a lot of people a lot of money who hold the shares.</p>\n\n<p>It has a true following which is loyal and unlike any other company around, and people are willing to keep buying it to watch it succeed. This is what we call a golden supporter base. Apple has it with its products. Samsung with there’s. GameStop has the same thing.</p>\n\n<p><strong>Why is GameStop getting into NFT’s?</strong></p>\n\n<p>A NFT is a single asset usually embedded in an object (like a video game skin, for example) and registered in a blockchain network. It is an encrypted digital record of a piece of art that can be bought, sold, and collected. NFTs, meanwhile, have been on their own popularity surge as everyone from traditional auction houses to billionaires began selling the unique digital collectibles.</p>\n\n<p>GameStop announced they would enter the NTF arena, to a great uproar from customers and shareholders. This was further enhanced by them launching a NFT website: <strong>htps://nft.gamestop.com/</strong></p>\n\n<p>GameStop will be launching its platform on the Ethereum marketplace. The NFT marketplace is expected to reach 1-2 trillion dollars in sales in the next few years. With GameStop at the heart of the gaming industry, it has the ability to capture a large part of the gaming market with its NFT’s. With large gaming companies, and large movie producers looking for a industry leading platform to sell their NFT’s, GameStop would be the perfect place for them to get exposure, whilst increasing their revenue through there NFT marketplace.</p>\n\n<p><strong>So Why are GME Holders So Excited and Buying Up Loopring?</strong></p>\n\n<p>The Head of GameStop’s Blockchain is Matthew Finestone. The reason why many are getting excited is that he was Head of Business for Loopring before moving to GameStop. He was responsible for bringing business to Loopring, whilst onboarding other companies onto the Loopring system. One can assume that if GameStop needs a reliable, secure, and fast platform, then they would ask their Head of Blockchain where to go. In this case, it could potentially be Loopring. After all, Matthew Finestone did work for the company. He would potentially know everything he needs to know about the Loopring platform, and could integrate both companies together quite easily.</p>\n\n<p>Furthermore, GameStop is building a team of engineers, designers, gamers, and marketers to really create a NFT platform which is next generational, and the best in the industry.</p>\n\n<p>This along with Ryan Cohen who is known for launching and turning around businesses to make them reach new levels, meaning that backing Loopring and GameStop on a potential partnership could be rewarding for holders.</p>\n\n<p><strong>So, What Does This Mean for Loopring?</strong></p>\n\n<p>Loopring (before any rumours of GME came out) have stated they are going to be launching a free wallet (maybe this wallet can be provided to all users of the potential GME platform). They also stated that a big announcement is coming in Q4 which would be worth 10 times more than any announcement/quarterly report they would announce. <strong>Possible rumours include Ubisoft.</strong></p>\n\n<p>This along with rumours that are working with an established partner who is building atop our newly released L2 NFT functionality, is why GME and Loopring holders are pretty excited to see what happens.</p>\n\n<p><strong>I hope it helps to why people keep linking GME and Loopring together. If this partnership is real, then you are linking a viral powerhouse with GME (who’s holders actually care about the company passionately), and Loopring (who has a game changing NFT platform to scale any company), which can cause an immediate impact to the global NFT marketplace.</strong></p>\n\n<p>I hope it helps anyone!</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/qlpkca/gamestop_nfts_and_cryptocurrency_part_3_the/",
  "subreddit": "CryptoCurrency",
  "id": "qlpkca",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I wrote the last two posts on Loopring, which seemed to help and educate a lot\nof people on their potential partnership with some large companies.\n\nI have just updated the post with my latest update which breaks down potential\npartnerships, including a potential one with Ubisoft.\n\nI wanted to talk…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はLoopringに関する最後の2つの記事を書きましたが、この記事は多くの人々を助け、教育したようです。\n大企業との提携の可能性について、多くの人に知ってもらうことができました。\n\nその記事を更新しました。\nその中には、Ubisoftとの提携の可能性も含まれています。\n\n私が話したかったのは...",
      "title": "GamestopとNFTと暗号通貨～その3～最新情報"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我写了关于Loopring的最后两篇文章，这似乎帮助和教育了很多\n的人了解他们与一些大公司的潜在合作关系。\n\n我刚刚更新了这个帖子，其中对潜在的\n合作关系，包括与育碧的潜在合作关系。\n\n我想谈谈...",
      "title": "Gamestop、NFT和加密货币--第三部分--最新进展"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我寫了關於Loopring的最後兩篇文章，這似乎幫助和教育了很多\n的人瞭解他們與一些大公司的潛在合作關係。\n\n我剛剛更新了這個帖子，其中對潛在的\n合作關係，包括與育碧的潛在合作關係。\n\n我想談談...",
      "title": "Gamestop、NFT和加密貨幣--第三部分--最新進展"
    }
  ]
}