{
  "author": "xMarinx",
  "original_created_utc": 1636631517,
  "title": "Can BTC really reach 100k before this year ends?",
  "created_utc": 1636641421,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I heard many, many opinions on this and it&#39;s tough for me to decide if I believe in it or not. Some say they expect some crazy gains like 130k while others are a bit more conservative with expectations of around 80k-ish. Especially in this sub, it seems like every post has a different opinion; I see a post saying how we are going to pump and trust the process of a big end of the year and a few minutes later there is a post saying that there is soon going to be the peak and a huge crash is coming in the very near future or that BTC will very soon become a stablecoin and there is not too much room for profit investing in it. I belive BTC has quite a bit of time left ahead of itself before it becomes a stablecoin. In 2022 I definitely expect BTC to get to that magical 100k mark. Currently I&#39;m leaning towards it being maybe in range of 85-90k for this year before going higher in 2022; 100k seems really far away for 50 days we have left in this year, that would be 30k+ from the current price which seems mental as we are currently at the time of writing this sitting at around 65k meaning that we would need a rise of over 50 percent which looks like too much for such a short period of time. Looking forward to hearing your predictions and opinions.</p>\n</div><!-- SC_ON -->",
  "score": 290,
  "permalink": "/r/CryptoCurrency/comments/qrjmb6/can_btc_really_reach_100k_before_this_year_ends/",
  "subreddit": "CryptoCurrency",
  "id": "qrjmb6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I heard many, many opinions on this and it's tough for me to decide if I believe\nin it or not. Some say they expect some crazy gains like 130k while others are a\nbit more conservative with expectations of around 80k-ish. Especially in this\nsub, it seems like every post has a different opinion; I see…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いろいろな意見を聞きましたが、自分が信じるかどうかを決めるのは難しいですね。\n信じるかどうかを決めるのは難しいですね。ある人は130kのようなとんでもない利益を期待しているし、別の人は80k程度の期待をしている。\n控えめに8万円程度と予想する人もいます。特にこの\nサブでは、すべての投稿に異なる意見があるように見えますが、なるほど...。",
      "title": "今年が終わる前に、BTCは本当に100kに到達できるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听到了许多关于这个问题的意见，我很难决定我是否相信\n么相信它。有些人说他们期待一些疯狂的收益，如13万，而其他人则比较保守，期待8万左右。\n有些人则比较保守，期望有8万左右的收益。特别是在这个\n子，似乎每个帖子都有不同的观点；我明白了......",
      "title": "BTC真的能在今年结束前达到10万吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽到了許多關於這個問題的意見，我很難決定我是否相信\n麼相信它。有些人說他們期待一些瘋狂的收益，如13萬，而其他人則比較保守，期待8萬左右。\n有些人則比較保守，期望有8萬左右的收益。特別是在這個\n子，似乎每個帖子都有不同的觀點；我明白了......",
      "title": "BTC真的能在今年結束前達到10萬嗎？"
    }
  ]
}