{
  "author": "FeFountain",
  "original_created_utc": 1635502833,
  "title": "I’m not gonna let myself miss a meme coin ultra-pump again",
  "created_utc": 1635507111,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been investing in crypto for almost 3 years and ive always focused on coins/projects with good use cases.<br/>\nBut after watching DOGE and SHIB moon (and deliver much better returns than my portfolio) I&#39;ve decided to jump on the next meme coin ultra pump.<br/>\nI saw a post here on Thursday about there not being cat meme coins… turns out there is one called Pussy.Financial (PUSSY). You can only buy it on Uniswap at the moment, and it&#39;s up something like 500% in the last 2 days.<br/>\nI&#39;m convinced this is going to be the next big thing and since no one is talking about it (not even on this sub, let alone the mainstream media) I know I&#39;m early.<br/>\nI bought 20 million PUSSY coins yesterday and I&#39;m already up 70%. Not gonna even think about selling until it&#39;s worth 6 or 7 figures. Wish me luck!</p>\n</div><!-- SC_ON -->",
  "score": 239,
  "permalink": "/r/CryptoCurrency/comments/qi9n96/im_not_gonna_let_myself_miss_a_meme_coin/",
  "subreddit": "CryptoCurrency",
  "id": "qi9n96",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been investing in crypto for almost 3 years and ive always focused on\ncoins/projects with good use cases.\nBut after watching DOGE and SHIB moon (and deliver much better returns than my\nportfolio) I've decided to jump on the next meme coin ultra pump.\nI saw a post here on Thursday about there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は約3年間、暗号に投資してきましたが、常に以下の点に注目してきました。\nなユースケースを持つコインやプロジェクトに注目してきました。\nしかし、DOGEとSHIBの月を見た後（そして私のポートフォリオよりもはるかに良いリターンをもたらした）、私は次のミームコインであるウルトラポンプに飛びつくことにしました。\n私のポートフォリオよりもはるかに良いリターンをもたらした）次のミームコインであるウルトラポンプに飛びつくことにしました。\n木曜日にここで、そのことについての投稿を見ました...",
      "title": "もうミームコインのウルトラパンプを見逃すわけにはいかない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经投资加密货币近3年了，我一直专注于有良好用途的硬币/项目。\n币/项目，有良好的使用案例。\n但是，在看到DOGE和SHIB月球（并提供比我的投资组合好得多的回报）后，我决定跳到下一个纪念币的超级泵。\n投资组合）后，我决定跳到下一个纪念币的超级泵上。\n我周四在这里看到一个帖子，关于有...",
      "title": "我不会再让自己错过一个备忘录硬币的超强动力了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經投資加密貨幣近3年了，我一直專注於有良好用途的硬幣/項目。\n幣/項目，有良好的使用案例。\n但是，在看到DOGE和SHIB月球（並提供比我的投資組合好得多的回報）後，我決定跳到下一個紀念幣的超級泵。\n投資組合）後，我決定跳到下一個紀念幣的超級泵上。\n我週四在這裏看到一個帖子，關於有...",
      "title": "我不會再讓自己錯過一個備忘錄硬幣的超強動力了"
    }
  ]
}