{
  "author": "thegreatjamoco",
  "original_created_utc": 1645642103,
  "title": "Why are virtually no country flags purple?",
  "created_utc": 1645674776,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know this is a history subreddit but flags are an important part of history imo. Qatar has a burgundyish color and Sri Lanka has a maroon bit but I’d argue that is more red than purple. Was it an unattractive color to people? It’s one of the three secondary (subtractive) colors and you see plenty of orange and green but no eggplant purple. The only country flag I can think of with significant purple is the flag of The Second Spanish Republic which is no longer used to my knowledge (except by Hispanophiles like me) . To be clear, I’m referring to a general color theme, not minor details of a flag such as a small section of a country seal present on a flag.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/szoqm1/why_are_virtually_no_country_flags_purple/",
  "subreddit": "AskHistorians",
  "id": "szoqm1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know this is a history subreddit but flags are an important part of history\nimo. Qatar has a burgundyish color and Sri Lanka has a maroon bit but I’d argue\nthat is more red than purple. Was it an unattractive color to people? It’s one\nof the three secondary (subtractive) colors and you see plenty…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは歴史のサブレディットですが、国旗は歴史の重要な部分です。\nイモ カタールはワインレッド系で、スリランカはマルーン系ですが、私が主張するのは\nというのは、紫というより赤ですね。人々にとって魅力のない色だったのでしょうか。それは\n三原色（減色）のうちの一つで、たくさん見かけますが......。",
      "title": "なぜ、国旗に紫色がほとんどないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这是一个历史分论坛，但旗帜是历史的一个重要组成部分。\n我认为。卡塔尔的颜色是酒红色的，斯里兰卡的颜色是栗色的，但我想说的是\n但我认为那更像是红色而不是紫色。它是一种对人没有吸引力的颜色吗？这是一个\n它是三种次要（减法）颜色之一，你可以看到很多...",
      "title": "为什么几乎没有国家的旗帜是紫色的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這是一個歷史分論壇，但旗幟是歷史的一個重要組成部分。\n我認爲。卡塔爾的顏色是酒紅色的，斯里蘭卡的顏色是栗色的，但我想說的是\n但我認爲那更像是紅色而不是紫色。它是一種對人沒有吸引力的顏色嗎？這是一個\n它是三種次要（減法）顏色之一，你可以看到很多...",
      "title": "爲什麼幾乎沒有國家的旗幟是紫色的？"
    }
  ]
}